{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.8,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good afternoon, ladies and gentlemen. I'm Ian Tabor. I'm here to do my talk on how an"
    },
    {
      "Time_Start": 5.8,
      "Time_End": 11.4,
      "Text": " automotive researcher had his car stolen by a can injection. That's the official title"
    },
    {
      "Time_Start": 11.4,
      "Time_End": 17.44,
      "Text": " of this talk. The unofficial title of this talk is the irony of how an automotive security"
    },
    {
      "Time_Start": 17.44,
      "Time_End": 24.0,
      "Text": " researcher had his car stolen by a method he found on another vehicle. Yeah, great."
    },
    {
      "Time_Start": 24.0,
      "Time_End": 30.04,
      "Text": " My colleague who did the research with me, Dr. Ken Tindall, isn't present, but he has"
    },
    {
      "Time_Start": 30.04,
      "Time_End": 36.04,
      "Text": " recorded some of the slides here. So I will be introducing him now, and I'll introduce"
    },
    {
      "Time_Start": 36.04,
      "Time_End": 43.04,
      "Text": " myself after. There should be audio. That should be audio."
    },
    {
      "Time_Start": 66.04,
      "Time_End": 85.04,
      "Text": " My name is Dr. Ken Tindall, and Ian calls me the Ken Bus Guru. And it's true, I've been"
    },
    {
      "Time_Start": 85.04,
      "Time_End": 90.04,
      "Text": " working with Ken in the car industry for a long time. I'm an industry veteran. I started"
    },
    {
      "Time_Start": 90.04,
      "Time_End": 97.04,
      "Text": " in 1995 with Volvo's P2X large platform project, and that was back when can was a shiny new"
    },
    {
      "Time_Start": 97.04,
      "Time_End": 102.04,
      "Text": " thing, and this was their first major can platform. I helped Motorola design the first"
    },
    {
      "Time_Start": 102.04,
      "Time_End": 109.04,
      "Text": " real-time can controller, and I sold my startup back then to Bosch, so I'm an industry veteran."
    },
    {
      "Time_Start": 109.04,
      "Time_End": 117.04,
      "Text": " I'm the CTO of Canis Labs, and that's a can bus security company. And I have quite a few"
    },
    {
      "Time_Start": 117.04,
      "Time_End": 123.04,
      "Text": " roles in that. I've been a hardware IP designer, so I designed CANHG, the protocol for speeding"
    },
    {
      "Time_Start": 123.04,
      "Time_End": 130.04000000000002,
      "Text": " up CAN by inserting extra fast data inside a slow CAN bit. And I've been an embedded"
    },
    {
      "Time_Start": 130.04000000000002,
      "Time_End": 136.04000000000002,
      "Text": " real-time hardware software designer, and I designed the CryptoCAN system for encrypting"
    },
    {
      "Time_Start": 136.04000000000002,
      "Time_End": 143.04000000000002,
      "Text": " any CAN frame. And today I'm working on the CAN in automation, CANSEC working group for"
    },
    {
      "Time_Start": 143.04,
      "Time_End": 150.04,
      "Text": " CanXL security. So now I'll introduce who I am. You could say I'm the ultimate car"
    },
    {
      "Time_Start": 150.04,
      "Time_End": 155.04,
      "Text": " hacker. I built this vehicle 18 years ago now. It's based on the Ford Sierra rear wheel"
    },
    {
      "Time_Start": 155.04,
      "Time_End": 161.04,
      "Text": " drive platform from around the 1990s. It's got a Ford Focus 2 liter engine in. It does"
    },
    {
      "Time_Start": 161.04,
      "Time_End": 166.04,
      "Text": " actually have three CUs, and it includes CAN, but if you want to try and hack it, I think"
    },
    {
      "Time_Start": 166.04,
      "Time_End": 172.04,
      "Text": " you would be sitting on my lap, because the CAN wire is about that long. So good luck."
    },
    {
      "Time_Start": 172.04,
      "Time_End": 177.04,
      "Text": " There's a little disclaimer down the bottom there. This work was carried out on my own money,"
    },
    {
      "Time_Start": 177.04,
      "Time_End": 183.04,
      "Text": " on my own time, and nothing to do with any current or previous employers. Just to get that"
    },
    {
      "Time_Start": 183.04,
      "Time_End": 190.04,
      "Text": " clear. So a little bit of history about my car hacking in the past. In 2015, I bought this"
    },
    {
      "Time_Start": 190.04,
      "Time_End": 196.04,
      "Text": " Citroen DS5, and you could tether your phone to the head unit and surf the internet from the"
    },
    {
      "Time_Start": 197.04,
      "Time_End": 203.04,
      "Text": " car. Why you'd want to, I don't know. Whatever. But if you did a Nmap scan in the other"
    },
    {
      "Time_Start": 203.04,
      "Time_End": 209.04,
      "Text": " direction, you could find four ports open. 23, 111, 3333, and 20,000. 23 is telnet, like"
    },
    {
      "Time_Start": 212.04,
      "Time_End": 217.04,
      "Text": " everyone knows. Guess what? No credentials, straight in root access. You could then"
    },
    {
      "Time_Start": 217.04,
      "Time_End": 223.04,
      "Text": " extricate any of the data via the USB or via FTP server mapped as a path. Yeah, so"
    },
    {
      "Time_Start": 226.04,
      "Time_End": 232.04,
      "Text": " great. I wrote up my findings, sent them over to Citroen in France, and said, by the way, is"
    },
    {
      "Time_Start": 232.04,
      "Time_End": 237.04,
      "Text": " this not a matter of French national security? Because the French president gets driven"
    },
    {
      "Time_Start": 237.04,
      "Time_End": 243.04,
      "Text": " around in one of these things. And they were like, meh, I don't care. One of my most"
    },
    {
      "Time_Start": 243.04,
      "Time_End": 249.04,
      "Text": " popular tweets, or one of my most personally highlighted tweets is from Charlie Miller"
    },
    {
      "Time_Start": 249.04,
      "Time_End": 255.04,
      "Text": " himself saying, yep, good find. Great. That was in 2017. August 2018, I spoke at"
    },
    {
      "Time_Start": 259.03999999999996,
      "Time_End": 265.03999999999996,
      "Text": " Defcon Car Hacking Village, Defcon 26 now, about the entire findings and what I found, how I"
    },
    {
      "Time_Start": 267.03999999999996,
      "Time_End": 273.03999999999996,
      "Text": " found it, the disclosure process, and how they fixed it. Guess what? They disabled the Wi-Fi."
    },
    {
      "Time_Start": 273.03999999999996,
      "Time_End": 278.03999999999996,
      "Text": " They didn't actually disable the telnet daemon. You could still go back in over the Bluetooth"
    },
    {
      "Time_Start": 278.04,
      "Time_End": 283.04,
      "Text": " and turn it back on by modifying those SQLite databases that just happened to be in there. So"
    },
    {
      "Time_Start": 283.04,
      "Time_End": 289.04,
      "Text": " great, wonderful. Eventually they did actually disable the telnet daemon in about three"
    },
    {
      "Time_Start": 289.04,
      "Time_End": 294.04,
      "Text": " versions of software later, but no one actually had ever got a recall to actually say, here's a"
    },
    {
      "Time_Start": 294.04,
      "Time_End": 299.04,
      "Text": " security update to your head unit. So good luck. If you've got one of them there, it's probably"
    },
    {
      "Time_Start": 299.04,
      "Time_End": 305.04,
      "Text": " still vulnerable. In September 18, I went to the bug crowd bug bash. I was one of 12 global"
    },
    {
      "Time_Start": 306.04,
      "Time_End": 312.04,
      "Text": " researchers at the event in Louisville, Kentucky, and the vehicles there all had radar-guided"
    },
    {
      "Time_Start": 315.04,
      "Time_End": 321.54,
      "Text": " cruise control. If you look at the radar-guided cruise control sensor, which is that one there,"
    },
    {
      "Time_Start": 321.54,
      "Time_End": 326.84000000000003,
      "Text": " there's a little plastic shroud. Pop that out with a screwdriver, take two bolts out, sensors"
    },
    {
      "Time_Start": 326.84000000000003,
      "Time_End": 333.74,
      "Text": " out, you're on the CAN bus wiring. Guess what that CAN bus wiring can do? Start, stop the car,"
    },
    {
      "Time_Start": 333.74,
      "Time_End": 339.74,
      "Text": " unlock the vehicle, unarm the alarm, open the trunk. We weren't actually allowed to test"
    },
    {
      "Time_Start": 339.74,
      "Time_End": 344.74,
      "Text": " whether we could actually do any hacks on a moving vehicle, but yes, we did get a payout"
    },
    {
      "Time_Start": 344.74,
      "Time_End": 350.74,
      "Text": " between myself, Spectres, and RQU of a five-figure sum. So thank you very much, bug crowd."
    },
    {
      "Time_Start": 350.74,
      "Time_End": 357.74,
      "Text": " Hell yeah. After I did that, there's a picture of me, slightly slimmer, slightly younger"
    },
    {
      "Time_Start": 357.74,
      "Time_End": 363.74,
      "Text": " version of doing a ha-ha, watch this. Tap, tap, tap, unlock. Tap, tap, tap, car started."
    },
    {
      "Time_Start": 363.74,
      "Time_End": 369.74,
      "Text": " Yeah. I can steal that vehicle. I can't tell you which because an NDA in under 90 seconds from a"
    },
    {
      "Time_Start": 371.74,
      "Time_End": 377.74,
      "Text": " virgin vehicle. And the car is still vulnerable today, one generation later. So great. Security"
    },
    {
      "Time_Start": 379.74,
      "Time_End": 386.74,
      "Text": " really works, doesn't it? Since then, using that money from that bounty, I built my own car in a"
    },
    {
      "Time_Start": 386.74,
      "Time_End": 392.74,
      "Text": " box called PD0. PD0 is a Peugeot 208, P for Peugeot, and D0 is 208 in hex. It's basically"
    },
    {
      "Time_Start": 395.74,
      "Time_End": 400.74,
      "Text": " most of the electronics from that vehicle, except for the airbag ECU, and it thinks it's a fully"
    },
    {
      "Time_Start": 400.74,
      "Time_End": 406.74,
      "Text": " working car. The inspiration was 3P over there, but as you can see on the left there, there's a"
    },
    {
      "Time_Start": 406.74,
      "Time_End": 412.74,
      "Text": " ABS simulator for the wheel speed sensors, there's a crank and cam sensor simulator for the speed,"
    },
    {
      "Time_Start": 413.74,
      "Time_End": 419.74,
      "Text": " for the engine speed, et cetera. There's some O2 simulators as well. If you want any of the"
    },
    {
      "Time_Start": 419.74,
      "Time_End": 425.74,
      "Text": " hardware to do that, contact me. I have spares of those things and I have instructions on how to"
    },
    {
      "Time_Start": 425.74,
      "Time_End": 431.74,
      "Text": " do it. It's up on my GitHub. But I now take this around the UK and Europe as part of the Car"
    },
    {
      "Time_Start": 431.74,
      "Time_End": 437.74,
      "Text": " Hacking Village Europe. I've actually been requested to take it to Australia, Brazil, America,"
    },
    {
      "Time_Start": 438.74,
      "Time_End": 444.74,
      "Text": " Singapore, Philippines, amongst other places. I took it to Amsterdam once and that was fun."
    },
    {
      "Time_Start": 444.74,
      "Time_End": 450.74,
      "Text": " What's in the box? A car. Well, a model car. No, a whole car. Security man didn't find it funny."
    },
    {
      "Time_Start": 452.74,
      "Time_End": 458.74,
      "Text": " It was like, yeah, what did you do that for? It was like, on your way. I don't want to fill"
    },
    {
      "Time_Start": 458.74,
      "Time_End": 464.74,
      "Text": " that for me. So great. In October 2019, I again went to the bug bash in the global headquarters"
    },
    {
      "Time_Start": 465.74,
      "Time_End": 471.74,
      "Text": " of the same OEM up in Detroit. Again, can't mention it, but it's in Detroit. There's one of"
    },
    {
      "Time_Start": 471.74,
      "Time_End": 477.74,
      "Text": " the few. And there was radar hack version 2. This little device here is based on an ESP32. It"
    },
    {
      "Time_Start": 479.74,
      "Time_End": 485.74,
      "Text": " has Bluetooth and Wi-Fi and it also has an infrared receiver. At the bottom there is a little"
    },
    {
      "Time_Start": 485.74,
      "Time_End": 491.74,
      "Text": " remote control. If I put that device between the radar and the radar wiring and go the other"
    },
    {
      "Time_Start": 492.74,
      "Time_End": 498.74,
      "Text": " side of the car park, press the button, the trunk opens. There's nothing you can do about it."
    },
    {
      "Time_Start": 498.74,
      "Time_End": 503.74,
      "Text": " Yes, it's a targeted hack against a single vehicle, but you could have some fun with your"
    },
    {
      "Time_Start": 503.74,
      "Time_End": 509.74,
      "Text": " mate's car. You could also possibly test it on a moving vehicle because the Bluetooth actually"
    },
    {
      "Time_Start": 509.74,
      "Time_End": 515.74,
      "Text": " is Bluetooth can, but they wouldn't allow us to test it on a moving vehicle because that would"
    },
    {
      "Time_Start": 515.74,
      "Time_End": 521.74,
      "Text": " be dangerous and we might do something stupid. So, yeah. In October 2019, also went to the"
    },
    {
      "Time_Start": 524.74,
      "Time_End": 530.74,
      "Text": " auto Isaac over in Texas for hacker one at Toyota's headquarters. That will come pertinent"
    },
    {
      "Time_Start": 532.74,
      "Time_End": 538.74,
      "Text": " later. Myself, Spectres and Mutley did a talk about vulnerability disclosure program and how"
    },
    {
      "Time_Start": 539.74,
      "Time_End": 545.74,
      "Text": " that's actually valuable to the automotive industry and how researchers like myself and others"
    },
    {
      "Time_Start": 545.74,
      "Time_End": 551.74,
      "Text": " can help the automotive industry and you need to have this program in place so that we can get"
    },
    {
      "Time_Start": 551.74,
      "Time_End": 557.74,
      "Text": " you that information and you can start to fix things. Some vendors do have it. Some vendors do"
    },
    {
      "Time_Start": 557.74,
      "Time_End": 563.74,
      "Text": " it well. Some vendors don't. But, yeah. 2020 or the COVID year as you call it, I made this"
    },
    {
      "Time_Start": 564.74,
      "Time_End": 570.74,
      "Text": " little box here. It's what I call value pasta. The real version of Toyota pasta is over there"
    },
    {
      "Time_Start": 572.74,
      "Time_End": 578.74,
      "Text": " somewhere on the PwC stand. Their version costs you $30,000. That's a car. That version costs me"
    },
    {
      "Time_Start": 580.74,
      "Time_End": 586.74,
      "Text": " $800 to build. It does almost exactly the same thing and I've actually retrofitted it with RFID"
    },
    {
      "Time_Start": 586.74,
      "Time_End": 592.74,
      "Text": " based ignition and the JBL speaker thing I'm talking about is actually the same thing as the"
    },
    {
      "Time_Start": 593.74,
      "Time_End": 598.74,
      "Text": " car. It's possible to plug it in and basically use this to start the ignition on the car in a"
    },
    {
      "Time_Start": 598.74,
      "Time_End": 604.74,
      "Text": " case. So, none of that code is in the code that is on GitHub because I'm not going to release"
    },
    {
      "Time_Start": 604.74,
      "Time_End": 609.74,
      "Text": " that because I'm not stupid. It's actually stored in the Eprom and no one's ever going to get"
    },
    {
      "Time_Start": 609.74,
      "Time_End": 613.74,
      "Text": " that other than me. But it's actually vulnerable. I was going to bring it but I didn't have"
    },
    {
      "Time_Start": 613.74,
      "Time_End": 619.74,
      "Text": " enough space in my hand luggage. So, yep. Onto the actual theft itself. April last year, I came"
    },
    {
      "Time_Start": 620.74,
      "Time_End": 626.74,
      "Text": " out on a Sunday morning, found my bumper hanging off and the wheel latch trim hanging off and"
    },
    {
      "Time_Start": 628.74,
      "Time_End": 634.74,
      "Text": " the headlight was unplugged and I'm thinking that's on the curb side. No one's hit it. That"
    },
    {
      "Time_Start": 634.74,
      "Time_End": 640.74,
      "Text": " looks like vandalism. Looks a bit dodgy. I didn't even think it was trying to steal my car."
    },
    {
      "Time_Start": 640.74,
      "Time_End": 646.74,
      "Text": " And then a friend of mine who's another security researcher got in contact and said, by the"
    },
    {
      "Time_Start": 646.74,
      "Time_End": 652.74,
      "Text": " way, they might be trying to nick it. For fuck's sake. I actually tested the radar sensor on"
    },
    {
      "Time_Start": 652.74,
      "Time_End": 658.74,
      "Text": " the Toyota. It's on a different network. You can't do it by the radar sensor. You can do it by"
    },
    {
      "Time_Start": 658.74,
      "Time_End": 665.74,
      "Text": " the headlight, though. Thank you. Great. Wonderful. So, at that point, I bought myself a dash"
    },
    {
      "Time_Start": 665.74,
      "Time_End": 673.74,
      "Text": " cam, installed it front and rear. Come back to that in a second. In July, I started a new job"
    },
    {
      "Time_Start": 673.74,
      "Time_End": 677.74,
      "Text": " up the other end of the country. I had to leave at sort of 5 o'clock in the morning. Came out,"
    },
    {
      "Time_Start": 677.74,
      "Time_End": 682.74,
      "Text": " found the same thing again. Bumper hanging off, headlight not working. So, I drove to work with"
    },
    {
      "Time_Start": 682.74,
      "Time_End": 688.74,
      "Text": " one headlight in the dark. Not a good idea. Whatever. Not quite the dark, but yeah. So, when I"
    },
    {
      "Time_Start": 688.74,
      "Time_End": 694.74,
      "Text": " got to work, I put it all back together, plugged it all in. Everything's all hunky dory. Came back"
    },
    {
      "Time_Start": 694.74,
      "Time_End": 702.74,
      "Text": " home. Next day, everything was fine with work. Go to bed Wednesday night. Get a good night's"
    },
    {
      "Time_Start": 703.74,
      "Time_End": 709.74,
      "Text": " sleep. Get a nudge from the missus. Where did you park the car last night? Same place I"
    },
    {
      "Time_Start": 709.74,
      "Time_End": 715.74,
      "Text": " usually park it. Oh, crap. It's not there. So, look out the window. Big space. No car. Shit. So,"
    },
    {
      "Time_Start": 721.74,
      "Time_End": 727.74,
      "Text": " what do I do? Get onto the old my Toyota app. You may or may not be able to see this, but the"
    },
    {
      "Time_Start": 728.74,
      "Time_End": 734.74,
      "Text": " my Toyota app says it's got 100% fuel. 11,463 miles. And at the bottom there, if you see just"
    },
    {
      "Time_Start": 738.74,
      "Time_End": 744.74,
      "Text": " where it's got the icons, it says vehicle in motion. So, the car was currently in motion. It"
    },
    {
      "Time_Start": 746.74,
      "Time_End": 750.74,
      "Text": " doesn't track a vehicle that has been stolen. There is no way to track a vehicle that has been"
    },
    {
      "Time_Start": 750.74,
      "Time_End": 756.74,
      "Text": " stolen. Because there is the issue of say there was a domestic violence case and someone wanted"
    },
    {
      "Time_Start": 756.74,
      "Time_End": 760.74,
      "Text": " to get away from their other half. Someone might have access to the app so they know where"
    },
    {
      "Time_Start": 760.74,
      "Time_End": 765.74,
      "Text": " you are. So, the only time that actually updates is when it actually stops at the other end."
    },
    {
      "Time_Start": 765.74,
      "Time_End": 771.74,
      "Text": " Which is great. But that comes on to my next thing from the my Toyota app. I got an update"
    },
    {
      "Time_Start": 771.74,
      "Time_End": 777.74,
      "Text": " saying the fuel gauge is down at 50%. Where was it when the fuel gauge was down at 50%? I"
    },
    {
      "Time_Start": 777.74,
      "Time_End": 783.74,
      "Text": " don't know. It must have known somewhere where it was. But, yeah, great. I'm not going to dox"
    },
    {
      "Time_Start": 783.74,
      "Time_End": 789.74,
      "Text": " myself because I don't actually live there anymore. So, don't worry. So, in the my Toyota app,"
    },
    {
      "Time_Start": 789.74,
      "Time_End": 795.74,
      "Text": " you get notifications. As you can see, those big orange alerts are like, oh, bugger. Something"
    },
    {
      "Time_Start": 795.74,
      "Time_End": 801.74,
      "Text": " bad has happened. The one at the top says hybrid system. Major malfunction. Take it to a dealer"
    },
    {
      "Time_Start": 801.74,
      "Time_End": 807.74,
      "Text": " immediately. The one below it says sonar system. Again, take it to the dealer immediately. So,"
    },
    {
      "Time_Start": 808.74,
      "Time_End": 814.74,
      "Text": " they basically screwed the car. Bugger. So, I couldn't track where it was. It didn't then"
    },
    {
      "Time_Start": 814.74,
      "Time_End": 820.74,
      "Text": " appear ever again. Phoned the police. They couldn't do anything. Tried to contact Toyota"
    },
    {
      "Time_Start": 820.74,
      "Time_End": 825.74,
      "Text": " online. They wouldn't do anything because they don't have stolen vehicle tracking in the"
    },
    {
      "Time_Start": 825.74,
      "Time_End": 831.74,
      "Text": " country. Which is a bit shit, really. Actually, a friend of mine, Ken, actually thought it was a"
    },
    {
      "Time_Start": 831.74,
      "Time_End": 835.74,
      "Text": " targeted hack because I did the radar hack and someone thought, oh, it must be another car"
    },
    {
      "Time_Start": 835.74,
      "Time_End": 840.74,
      "Text": " hacker. They've nicked the car for a couple of days and it will reappear in three days' time. It"
    },
    {
      "Time_Start": 840.74,
      "Time_End": 847.74,
      "Text": " didn't. A couple of weeks later, my neighbor has a Land Cruiser. Or shall we say had a Land"
    },
    {
      "Time_Start": 847.74,
      "Time_End": 852.74,
      "Text": " Cruiser. First time they tried to nick it, the alarm went off and they run off, the three"
    },
    {
      "Time_Start": 852.74,
      "Time_End": 858.74,
      "Text": " little scrotes. A couple of weeks later, he left it out on the road around the front. We went"
    },
    {
      "Time_Start": 858.74,
      "Time_End": 864.74,
      "Text": " in for half an hour, came back out, it was gone. So, it wasn't a targeted hack. There was two"
    },
    {
      "Time_Start": 864.74,
      "Time_End": 871.74,
      "Text": " vehicles from my block stolen. And also, there are a couple of RAV4s around the area where I"
    },
    {
      "Time_Start": 871.74,
      "Time_End": 876.74,
      "Text": " used to live that I used to see around and about that aren't there anymore either. So, there are"
    },
    {
      "Time_Start": 876.74,
      "Time_End": 880.74,
      "Text": " quite a few that were stolen from that area. And looking on Reddit and things, there are also"
    },
    {
      "Time_Start": 880.74,
      "Time_End": 886.74,
      "Text": " quite a few in the north London area that have also been stolen. So, on to my initial"
    },
    {
      "Time_Start": 886.74,
      "Time_End": 891.74,
      "Text": " investigations. I'm not going to play this video because it's a bit dark and a bit rubbish and"
    },
    {
      "Time_Start": 891.74,
      "Time_End": 897.74,
      "Text": " you can't really see it. But if you take a look at the video there, QR code, this video is linked"
    },
    {
      "Time_Start": 897.74,
      "Time_End": 903.74,
      "Text": " in the blog post. When we first linked it, it had 20,000 views on it. It now currently has"
    },
    {
      "Time_Start": 903.74,
      "Time_End": 910.74,
      "Text": " about 330,000 views on it. I think they've made some money out of us linking to their video."
    },
    {
      "Time_Start": 910.74,
      "Time_End": 916.74,
      "Text": " Good luck to them because they had their car nicked as well. So, that's great. So, on to another"
    },
    {
      "Time_Start": 916.74,
      "Time_End": 922.74,
      "Text": " vehicle. This one was from Twitter. This is slightly sped up and takes about 90 seconds in"
    },
    {
      "Time_Start": 922.74,
      "Time_End": 930.74,
      "Text": " total. So, playing around in the corner by the bumper. Mate comes along with a torch. See the"
    },
    {
      "Time_Start": 930.74,
      "Time_End": 938.74,
      "Text": " lights come on. Doors are open. Job's a good'un. Car's gone. That's literally 90 seconds."
    },
    {
      "Time_Start": 939.74,
      "Time_End": 947.74,
      "Text": " Oh, bugger. So, I did a bit of an investigation. I spoke to a friend of mine who works in vehicle"
    },
    {
      "Time_Start": 947.74,
      "Time_End": 953.74,
      "Text": " system forensics. He used to be an ex-police traffic cop and he said he'd come across some of"
    },
    {
      "Time_Start": 953.74,
      "Time_End": 958.74,
      "Text": " these things with his colleagues that he used to work with and they are basically a little"
    },
    {
      "Time_Start": 958.74,
      "Time_End": 965.74,
      "Text": " Bluetooth speaker that has some extra electronics inside it that you plug into the CAN bus in the"
    },
    {
      "Time_Start": 965.74,
      "Time_End": 971.74,
      "Text": " back of the headlight wiring. The giveaway is the two pins here. So, USB-C cable. So, yeah,"
    },
    {
      "Time_Start": 971.74,
      "Time_End": 977.74,
      "Text": " great. But this is used for plausible deniability. They get stopped in the street. It's a"
    },
    {
      "Time_Start": 977.74,
      "Time_End": 981.74,
      "Text": " speaker. It's broken. It doesn't work. If they were clever, they could actually put a slightly"
    },
    {
      "Time_Start": 981.74,
      "Time_End": 987.74,
      "Text": " smaller speaker in and still work. But whatever. But they're sold as emergency start devices."
    },
    {
      "Time_Start": 987.74,
      "Time_End": 992.74,
      "Text": " Why would a locksmith want something that looks vaguely like a USB speaker to go and open"
    },
    {
      "Time_Start": 992.74,
      "Time_End": 999.74,
      "Text": " cars? Yeah, not good. When I first found out about it, the price of this device was 1,500"
    },
    {
      "Time_Start": 999.74,
      "Time_End": 1005.74,
      "Text": " euros. When I actually eventually got around to buying it in February this year, the price"
    },
    {
      "Time_Start": 1005.74,
      "Time_End": 1010.74,
      "Text": " had gone up to 2,500 euros. I'm not going to give any details of where I purchased it from"
    },
    {
      "Time_Start": 1010.74,
      "Time_End": 1017.74,
      "Text": " because they actually don't sell it anymore. But if you Google emergency start device JBL,"
    },
    {
      "Time_Start": 1017.74,
      "Time_End": 1023.74,
      "Text": " you'll find it. And there are shops across Europe and in Eastern Europe, in America, other"
    },
    {
      "Time_Start": 1023.74,
      "Time_End": 1031.74,
      "Text": " places that now sell it for nearly 4, 5,000 euros or $5,000. So, the price is going up"
    },
    {
      "Time_Start": 1031.74,
      "Time_End": 1039.74,
      "Text": " because they're obviously in demand. But, yeah. Here's a list of the actually claimed devices it"
    },
    {
      "Time_Start": 1039.74,
      "Time_End": 1048.74,
      "Text": " believes it works on. So, you've got the Toyota Supra, Prius, CHR, RAV4, Highlander, Land"
    },
    {
      "Time_Start": 1048.74,
      "Time_End": 1056.74,
      "Text": " Cruiser, Proace, and the majority of the Lexus range. So, that's quite a wide spread. So, yeah."
    },
    {
      "Time_Start": 1056.74,
      "Time_End": 1063.74,
      "Text": " You can nick quite a few different cars quite easily. Very cheap. So, what is actually in this"
    },
    {
      "Time_Start": 1063.74,
      "Time_End": 1070.74,
      "Text": " device? You've got externally, it just looks like a JBL speaker. Internally, there's the"
    },
    {
      "Time_Start": 1070.74,
      "Time_End": 1075.74,
      "Text": " electronics from the speaker, the blue PCB. The black blob is the electronics for the actual"
    },
    {
      "Time_Start": 1075.74,
      "Time_End": 1080.74,
      "Text": " device itself. I can't give you the details of the underneath the black blob because that gives"
    },
    {
      "Time_Start": 1080.74,
      "Time_End": 1091.74,
      "Text": " away what it actually is. But basically, there's a PIC18F25K80 and a modified transceiver. I"
    },
    {
      "Time_Start": 1091.74,
      "Time_End": 1098.74,
      "Text": " can't go into details on how that modified transceiver works or what it does. Ken's going to go"
    },
    {
      "Time_Start": 1098.74,
      "Time_End": 1106.74,
      "Text": " through that in a minute. So, yes, it is modified. That detail will never get out. I tried to"
    },
    {
      "Time_Start": 1106.74,
      "Time_End": 1112.74,
      "Text": " do a bit of reverse engineering with my old PIC thing, but there's no one amongst thieves and the"
    },
    {
      "Time_Start": 1112.74,
      "Time_End": 1118.74,
      "Text": " bastard locked down the firmware so you couldn't read it out. But there is a heart of darkness"
    },
    {
      "Time_Start": 1118.74,
      "Time_End": 1124.74,
      "Text": " track that you can do on that chip. But you potentially need two of those chips because you"
    },
    {
      "Time_Start": 1124.74,
      "Time_End": 1129.74,
      "Text": " have to read it out half of the chip at a time, which is, I'm not buying another one, especially"
    },
    {
      "Time_Start": 1129.74,
      "Time_End": 1135.74,
      "Text": " as it's 4,500 euros now. There is possibly a few other ways to glitch it and get access to the"
    },
    {
      "Time_Start": 1135.74,
      "Time_End": 1141.74,
      "Text": " firmware as well, but we believe we've actually got the data out anyway by just what it does on"
    },
    {
      "Time_Start": 1141.74,
      "Time_End": 1147.74,
      "Text": " the CAN bus. I'm now going to hand back to Ken."
    },
    {
      "Time_Start": 1147.74,
      "Time_End": 1153.74,
      "Text": " Let's look at some bench testing that we did to investigate how this theft device works. First"
    },
    {
      "Time_Start": 1153.74,
      "Time_End": 1159.74,
      "Text": " point I want to make out is this is using fake data. So we renamed the CAN identifies and payloads"
    },
    {
      "Time_Start": 1159.74,
      "Time_End": 1166.74,
      "Text": " because we're not here to help people make devices to steal Toyota cars. So this is a logic"
    },
    {
      "Time_Start": 1166.74,
      "Time_End": 1172.74,
      "Text": " analyzer trace and we've got some CAN data here from various ECU traces and the theft device."
    },
    {
      "Time_Start": 1175.74,
      "Time_End": 1181.74,
      "Text": " And there's a signal here called inject chip select. So that enables the override transceiver,"
    },
    {
      "Time_Start": 1183.74,
      "Time_End": 1189.74,
      "Text": " which we'll talk about in a moment. And then this is the TX line for the theft device that's"
    },
    {
      "Time_Start": 1190.74,
      "Time_End": 1196.74,
      "Text": " injecting CAN frames. And then we can see here all the other ECUs. Here's a transmit line from one"
    },
    {
      "Time_Start": 1198.74,
      "Time_End": 1204.74,
      "Text": " of the ECUs and then various CAN high low signals on the bus. And then we have another receive"
    },
    {
      "Time_Start": 1204.74,
      "Time_End": 1210.74,
      "Text": " pin on the CAN transceiver. So we can see what comes through. So this is a standard CAN frame."
    },
    {
      "Time_Start": 1210.74,
      "Time_End": 1216.74,
      "Text": " It's all very nice. So here's the visual line that goes through. Here's what's transmitted."
    },
    {
      "Time_Start": 1216.74,
      "Time_End": 1222.74,
      "Text": " Here's the CAN high low lines are pulled apart when we have a dominant bit. And that all comes"
    },
    {
      "Time_Start": 1222.74,
      "Time_End": 1228.74,
      "Text": " through just fine here. So this is a perfectly fine CAN frame. Now let's have a look when we"
    },
    {
      "Time_Start": 1228.74,
      "Time_End": 1234.74,
      "Text": " turn on the inject chip select line. So this turns on the transceiver and that forces a"
    },
    {
      "Time_Start": 1236.74,
      "Time_End": 1242.74,
      "Text": " recessive state onto the bus. So here we're injecting a one bit onto the CAN line. So we're"
    },
    {
      "Time_Start": 1242.74,
      "Time_End": 1246.74,
      "Text": " injecting a recessive state. And here's an ECU trying to transmit. And it goes through this very,"
    },
    {
      "Time_Start": 1246.74,
      "Time_End": 1252.74,
      "Text": " very funny pattern here, trying to assert a dominant state. And you can see it's trying to pull"
    },
    {
      "Time_Start": 1252.74,
      "Time_End": 1258.74,
      "Text": " these CAN high low lines apart, but it doesn't really succeed. So what the other ECUs see on their"
    },
    {
      "Time_Start": 1258.74,
      "Time_End": 1264.74,
      "Text": " CAN receive pins is just a recessive, which is the same as the transmitted signal. If you want to"
    },
    {
      "Time_Start": 1264.74,
      "Time_End": 1270.74,
      "Text": " know why this pattern is like it is, this is one of my CAN quiz questions on my blog post,"
    },
    {
      "Time_Start": 1270.74,
      "Time_End": 1276.74,
      "Text": " which we'll point you at. So you can see here when we're actually trying to transmit a frame."
    },
    {
      "Time_Start": 1280.74,
      "Time_End": 1286.74,
      "Text": " So here is a spoof frame being transmitted. And here are the ECUs receiving that. And one of the"
    },
    {
      "Time_Start": 1286.74,
      "Time_End": 1292.74,
      "Text": " interesting things about CAN is the sender transmits a recessive bit for the acknowledgement slot"
    },
    {
      "Time_Start": 1292.74,
      "Time_End": 1298.74,
      "Text": " and then all the ECUs respond with a dominant bit. Now normally this override transceiver is"
    },
    {
      "Time_Start": 1298.74,
      "Time_End": 1304.74,
      "Text": " this override transceiver would cause that to fail. And there would be an error because you wouldn't"
    },
    {
      "Time_Start": 1304.74,
      "Time_End": 1310.74,
      "Text": " get an acknowledgement back. But when all of the ECUs are all pulling together, they have enough,"
    },
    {
      "Time_Start": 1310.74,
      "Time_End": 1316.74,
      "Text": " they can drive enough voltage onto the bus through the combined transceivers. And that's just enough"
    },
    {
      "Time_Start": 1316.74,
      "Time_End": 1322.74,
      "Text": " to push CAN high low apart enough to then come through as a dominant bit. So everyone sees that"
    },
    {
      "Time_Start": 1322.74,
      "Time_End": 1328.74,
      "Text": " as a valid CAN frame. So that's one of the nice properties of the way this transceiver works. Nice as"
    },
    {
      "Time_Start": 1328.74,
      "Time_End": 1334.74,
      "Text": " in it works, is it allows all the ECUs to pull together. So you have one ECU on the bus that's not strong enough"
    },
    {
      "Time_Start": 1334.74,
      "Time_End": 1340.74,
      "Text": " to drive an acknowledgement bit. So I've been talking about that custom CAN transceiver circuit."
    },
    {
      "Time_Start": 1340.74,
      "Time_End": 1346.74,
      "Text": " It's inside that resin blob. It's not a proper CAN transceiver of course because criminals don't care"
    },
    {
      "Time_Start": 1346.74,
      "Time_End": 1352.74,
      "Text": " about CAN standards. So it's designed to break all the protocols to push weird voltages onto the bus"
    },
    {
      "Time_Start": 1352.74,
      "Time_End": 1358.74,
      "Text": " and that's enough to spoof all the CAN transceiver circuits for all the real ECUs."
    },
    {
      "Time_Start": 1358.74,
      "Time_End": 1364.74,
      "Text": " So it can push any CAN bus traffic onto the bus that other transceivers will see as proper CAN frames"
    },
    {
      "Time_Start": 1364.74,
      "Time_End": 1370.74,
      "Text": " and most importantly it can't be stopped. You can't, other ECUs cannot drive a dominant bit"
    },
    {
      "Time_Start": 1370.74,
      "Time_End": 1376.74,
      "Text": " onto the CAN bus unless they're all acting at exactly the same time. So this means"
    },
    {
      "Time_Start": 1376.74,
      "Time_End": 1382.74,
      "Text": " hardware security approaches like NXP Stinger, Transceiver, which has a kind of blacklist"
    },
    {
      "Time_Start": 1382.74,
      "Time_End": 1388.74,
      "Text": " whitelist for destroying CAN frames and it knows it spoofs. That won't work because it can't send"
    },
    {
      "Time_Start": 1388.74,
      "Time_End": 1394.74,
      "Text": " an error frame onto the bus because it can't drive a dominant state. And the CANHG protocol I mentioned earlier"
    },
    {
      "Time_Start": 1394.74,
      "Time_End": 1400.74,
      "Text": " uses the same technique to destroy frames and it knows are bad in some way and again it can't do that"
    },
    {
      "Time_Start": 1400.74,
      "Time_End": 1406.74,
      "Text": " if this transceiver circuit is driving a recessive state on the bus."
    },
    {
      "Time_Start": 1406.74,
      "Time_End": 1412.74,
      "Text": " So let's have a look briefly how this works in a bit more detail. This is a network topology diagram"
    },
    {
      "Time_Start": 1412.74,
      "Time_End": 1418.74,
      "Text": " for the Toyota RAV4. It's very very simplified just for clarity."
    },
    {
      "Time_Start": 1418.74,
      "Time_End": 1424.74,
      "Text": " So the actual wiring diagram is an awful lot more complicated with an awful lot more ECUs in it and many more CAN buses."
    },
    {
      "Time_Start": 1424.74,
      "Time_End": 1430.74,
      "Text": " But this is the rough schematic. So up here we have the left headlight where the thieves break in"
    },
    {
      "Time_Start": 1430.74,
      "Time_End": 1436.74,
      "Text": " the connector so they can access the CAN high and low on this red bus. Also on this bus is"
    },
    {
      "Time_Start": 1436.74,
      "Time_End": 1442.74,
      "Text": " the smart key ECU. So this is the ECU that enters into a nice dialogue with the driver's"
    },
    {
      "Time_Start": 1442.74,
      "Time_End": 1448.74,
      "Text": " keys. It uses asymmetric encryption certificates and things all nice and secure"
    },
    {
      "Time_Start": 1448.74,
      "Time_End": 1454.74,
      "Text": " and the driver's keys can be authenticated. And then once it's been authenticated it sends a message over the CAN bus"
    },
    {
      "Time_Start": 1454.74,
      "Time_End": 1460.74,
      "Text": " to the door ECUs to unlock the doors and to this gateway ECU"
    },
    {
      "Time_Start": 1460.74,
      "Time_End": 1466.74,
      "Text": " which is forwarded on to the engine management system on another CAN bus that disables the immobiliser."
    },
    {
      "Time_Start": 1466.74,
      "Time_End": 1472.74,
      "Text": " And so the thieves basically disable this whole bus"
    },
    {
      "Time_Start": 1472.74,
      "Time_End": 1478.74,
      "Text": " and inject CAN frames that spoof the smart key's CAN frames to say that everything is fine"
    },
    {
      "Time_Start": 1478.74,
      "Time_End": 1484.74,
      "Text": " so all these ECUs see everything, see the smart key frames and act on them"
    },
    {
      "Time_Start": 1484.74,
      "Time_End": 1490.74,
      "Text": " so the door module is open, the gateway sees a valid frame and turns it on and the engine management system"
    },
    {
      "Time_Start": 1490.74,
      "Time_End": 1496.74,
      "Text": " operates on that. So that's how the CAN injection works."
    },
    {
      "Time_Start": 1496.74,
      "Time_End": 1502.74,
      "Text": " There's a blog post I wrote up on this"
    },
    {
      "Time_Start": 1502.74,
      "Time_End": 1508.74,
      "Text": " and it's been very well received and it's in fact used for the CV that's been awarded"
    },
    {
      "Time_Start": 1508.74,
      "Time_End": 1514.74,
      "Text": " for this vulnerability and it generated an awful lot of comments."
    },
    {
      "Time_Start": 1514.74,
      "Time_End": 1520.74,
      "Text": " We thought we'd do a top three frequently asked questions here, except they're not frequently"
    },
    {
      "Time_Start": 1520.74,
      "Time_End": 1526.74,
      "Text": " asked questions, they're car security mansplanations from people who don't understand how cars work"
    },
    {
      "Time_Start": 1526.74,
      "Time_End": 1532.74,
      "Text": " so I thought I would give the top three why your mansplanation of how easy it all is is not actually true."
    },
    {
      "Time_Start": 1532.74,
      "Time_End": 1538.74,
      "Text": " So coming in at number three is just add a firewall to isolate the headlights"
    },
    {
      "Time_Start": 1538.74,
      "Time_End": 1544.74,
      "Text": " but unfortunately a firewall costs money."
    },
    {
      "Time_Start": 1544.74,
      "Time_End": 1550.74,
      "Text": " There's a PCB, power, metal case, connectors, a couple of CAN buses, all kinds of stuff like that"
    },
    {
      "Time_Start": 1550.74,
      "Time_End": 1556.74,
      "Text": " and some more connectors on the other side. Even if it costs $10, which it won't, it's more than that"
    },
    {
      "Time_Start": 1556.74,
      "Time_End": 1562.74,
      "Text": " but even if it costs $10, multiply that by 50 million cars, which is what Toyota made"
    },
    {
      "Time_Start": 1562.74,
      "Time_End": 1568.74,
      "Text": " in the last few years, that is a total of half a billion dollars. So this is a brilliant security solution"
    },
    {
      "Time_Start": 1568.74,
      "Time_End": 1574.74,
      "Text": " you're about as smart as Elon Musk because you've wasted about the same amount of money he's just wasted on Twitter."
    },
    {
      "Time_Start": 1574.74,
      "Time_End": 1580.74,
      "Text": " Number two, just use TLS and WireGuard to encrypt all the messages."
    },
    {
      "Time_Start": 1580.74,
      "Time_End": 1586.74,
      "Text": " CAN messages are 8 bytes long and CAN messages contain small sensor and"
    },
    {
      "Time_Start": 1586.74,
      "Time_End": 1592.74,
      "Text": " data like turn the main beam on. This is not the sort of thing that you throw huge overheads of mainstream IT solutions for."
    },
    {
      "Time_Start": 1592.74,
      "Time_End": 1598.74,
      "Text": " Car electronics is a distributed real-time embedded safety critical mechatronics system"
    },
    {
      "Time_Start": 1598.74,
      "Time_End": 1604.74,
      "Text": " controlling wheels. It is not a phone on wheels, it is not a computer on wheels"
    },
    {
      "Time_Start": 1604.74,
      "Time_End": 1610.74,
      "Text": " it's a distributed control system and it's all about short worst case latencies, not about bandwidth."
    },
    {
      "Time_Start": 1610.74,
      "Time_End": 1616.74,
      "Text": " Even though CAN is relatively slow, because the data is relatively small, this is a perfect solution for it."
    },
    {
      "Time_Start": 1616.74,
      "Time_End": 1622.74,
      "Text": " A car isn't this data center on wheels and all these mainstream IT solutions, they're solving a completely different set of problems"
    },
    {
      "Time_Start": 1622.74,
      "Time_End": 1628.74,
      "Text": " and so those solutions are not appropriate for real-time control."
    },
    {
      "Time_Start": 1628.74,
      "Time_End": 1634.74,
      "Text": " And number one, just use a relay to turn the headlights on. Why do you need a CAN bus in headlights?"
    },
    {
      "Time_Start": 1634.74,
      "Time_End": 1640.74,
      "Text": " Well, first of all, it's not called a headlight cluster for nothing."
    },
    {
      "Time_Start": 1640.74,
      "Time_End": 1646.74,
      "Text": " Inside that are the main beam, the low beam, the side lights, the indicator lights, the daylight running lights"
    },
    {
      "Time_Start": 1646.74,
      "Time_End": 1652.74,
      "Text": " different lighting modes, washer pump motors, wiper motors, LED projector lights"
    },
    {
      "Time_Start": 1652.74,
      "Time_End": 1658.74,
      "Text": " and then there are multiple ECUs that want to control all of this stuff."
    },
    {
      "Time_Start": 1658.74,
      "Time_End": 1664.74,
      "Text": " But a superlative suggestion and one that we'll bear in mind."
    },
    {
      "Time_Start": 1668.74,
      "Time_End": 1674.74,
      "Text": " No, we're not going to do that. Can't just chuck it back to a relay."
    },
    {
      "Time_Start": 1674.74,
      "Time_End": 1680.74,
      "Text": " So onto media coverage. Here is a sample of the different reports about what happened after the blog post was released."
    },
    {
      "Time_Start": 1680.74,
      "Time_End": 1686.74,
      "Text": " Most of them come out with, oh, headlight hacking. It's not the effing headlight, it's the effing headlight wire."
    },
    {
      "Time_Start": 1686.74,
      "Time_End": 1692.74,
      "Text": " Yeah, you unplug the headlight. The headlight is now nothing to do with it."
    },
    {
      "Time_Start": 1692.74,
      "Time_End": 1698.74,
      "Text": " But life happens. They make up the stories. It was quite interesting. There was a story in Sweden"
    },
    {
      "Time_Start": 1698.74,
      "Time_End": 1704.74,
      "Text": " about a shed load of RAV4s and RX450s being found in a container warehouse"
    },
    {
      "Time_Start": 1704.74,
      "Time_End": 1710.74,
      "Text": " which were allegedly stolen for payment for drugs to be shipped abroad."
    },
    {
      "Time_Start": 1711.74,
      "Time_End": 1717.74,
      "Text": " It was actually done by can injection after we published our details on our blog post"
    },
    {
      "Time_Start": 1717.74,
      "Time_End": 1723.74,
      "Text": " because they actually thought it was done by a relay attack because both of them look exactly the same."
    },
    {
      "Time_Start": 1723.74,
      "Time_End": 1729.74,
      "Text": " I will go on to another bit in the press. If you know of the AA in the UK, Automobile Association,"
    },
    {
      "Time_Start": 1729.74,
      "Time_End": 1735.74,
      "Text": " the chairman, Sir Edmund King, had his wife's Lexus stolen"
    },
    {
      "Time_Start": 1735.74,
      "Time_End": 1741.74,
      "Text": " and he then published a post saying, by the way, put your keys in the microwave"
    },
    {
      "Time_Start": 1741.74,
      "Time_End": 1747.74,
      "Text": " because that's a Faraday cage. Yep, great. He then said his keys were actually in the microwave."
    },
    {
      "Time_Start": 1749.74,
      "Time_End": 1755.74,
      "Text": " So how did they steal it? Probably can injection. Didn't go anywhere near his keys."
    },
    {
      "Time_Start": 1755.74,
      "Time_End": 1759.74,
      "Text": " So I did send him the details and he is going to have a look at it and get back to me."
    },
    {
      "Time_Start": 1759.74,
      "Time_End": 1765.74,
      "Text": " But he was busy with some smart motorway stuff. So that's an interesting story that the man in"
    },
    {
      "Time_Start": 1765.74,
      "Time_End": 1771.74,
      "Text": " charge of AA had his Lexus nicked and he still doesn't know how it was nicked. He does now,"
    },
    {
      "Time_Start": 1771.74,
      "Time_End": 1777.74,
      "Text": " but whatever. On to a bit more media coverage. Vice.com did this video. Try the door handle."
    },
    {
      "Time_Start": 1780.74,
      "Time_End": 1786.74,
      "Text": " Cable's already plugged into the back of the headlight under the wheel arch. Plug the thing in."
    },
    {
      "Time_Start": 1786.74,
      "Time_End": 1792.74,
      "Text": " It's doing some messages. He now tries the door handle again. Oh, no, it's still locked. Whoops."
    },
    {
      "Time_Start": 1793.74,
      "Time_End": 1799.74,
      "Text": " Press the play button on the side. That triggers the locks. Now he just unplugs the thing"
    },
    {
      "Time_Start": 1799.74,
      "Time_End": 1805.74,
      "Text": " because you don't need it anymore. Wander around to the side of the vehicle. Open the door."
    },
    {
      "Time_Start": 1807.74,
      "Time_End": 1813.74,
      "Text": " Press your foot on the brake. And if you look carefully, the rev counter now shows 1,000 rpm."
    },
    {
      "Time_Start": 1814.74,
      "Time_End": 1820.74,
      "Text": " That again, less than two minutes. There is a Vice video with the same story showing the older"
    },
    {
      "Time_Start": 1820.74,
      "Time_End": 1826.74,
      "Text": " 3210 Nokia version, which will steal 2012 to 2015 type varieties. So there are links on my"
    },
    {
      "Time_Start": 1830.74,
      "Time_End": 1836.74,
      "Text": " website to all these stories and things and videos. So if you want to have a look later, my website"
    },
    {
      "Time_Start": 1836.74,
      "Time_End": 1842.74,
      "Text": " is at the end. There's also been quite a lot of industry coverage. Upstream produced their"
    },
    {
      "Time_Start": 1842.74,
      "Time_End": 1848.74,
      "Text": " half year 2023 auto cyber trend report. Our research got mentioned and our blog post was linked."
    },
    {
      "Time_Start": 1850.74,
      "Time_End": 1856.74,
      "Text": " Oh, no, can injection. Yep. It's been around for years. Just no one speaks about it. They think"
    },
    {
      "Time_Start": 1856.74,
      "Time_End": 1862.74,
      "Text": " things are secure. It's not. C2A also published this other one, can injection, a rising threat to"
    },
    {
      "Time_Start": 1864.74,
      "Time_End": 1870.74,
      "Text": " the auto security. Yep. Again, links are on there to my website, on my website to those."
    },
    {
      "Time_Start": 1872.74,
      "Time_End": 1878.74,
      "Text": " So we actually got the CV issued by ASRG and we did that so that other manufacturers can be made"
    },
    {
      "Time_Start": 1880.74,
      "Time_End": 1886.74,
      "Text": " aware. That website, I bought the device for the Toyota and Lexus, sell devices for every make that"
    },
    {
      "Time_Start": 1888.74,
      "Time_End": 1894.74,
      "Text": " is available at the moment, ranging from a few hundred dollars to $25,000-ish. So no manufacturer"
    },
    {
      "Time_Start": 1895.74,
      "Time_End": 1901.74,
      "Text": " is immune. And yep, I'll go on to some of that bit later. I did actually log the name of the CVE as"
    },
    {
      "Time_Start": 1909.74,
      "Time_End": 1915.74,
      "Text": " can injection with the emojis. That's the U.K. spec emojis because we drive on the correct side of"
    },
    {
      "Time_Start": 1915.74,
      "Time_End": 1921.74,
      "Text": " the road. That's the American spec emojis because you drive on the wrong side of the road or the"
    },
    {
      "Time_Start": 1921.74,
      "Time_End": 1927.74,
      "Text": " right, whichever you want to say. But I'm English. I'm right. Currently the CV is only listed"
    },
    {
      "Time_Start": 1927.74,
      "Time_End": 1933.74,
      "Text": " against my 2021 RAV4 because that's my car. I'd like to get it updated with the other ones when we"
    },
    {
      "Time_Start": 1935.74,
      "Time_End": 1941.74,
      "Text": " confirm which ones actually do work. But that may take time. So on to actual numbers. So in the"
    },
    {
      "Time_Start": 1943.74,
      "Time_End": 1949.74,
      "Text": " last six years, the RAV4 has sold just over 5 million vehicles. The Prius, about half a million."
    },
    {
      "Time_Start": 1950.74,
      "Time_End": 1956.74,
      "Text": " CHR, about 4 million. Land cruiser, 100,000. Highlander, 2 million-ish. Lexus, I couldn't find"
    },
    {
      "Time_Start": 1958.74,
      "Time_End": 1964.74,
      "Text": " individual details of all the different models. But over that five, six years, 4.2 million"
    },
    {
      "Time_Start": 1964.74,
      "Time_End": 1970.74,
      "Text": " vehicles. So potentially across the globe, there's at least 15 and a half million cars that can be"
    },
    {
      "Time_Start": 1970.74,
      "Time_End": 1976.74,
      "Text": " stolen by this $20 worth of electronics. Yeah. Great. Wonderful. And I'm going to talk about"
    },
    {
      "Time_Start": 1980.74,
      "Time_End": 1986.74,
      "Text": " that number of 50 million-ish cars. Over the last six years, they sold 56 and a half million cars."
    },
    {
      "Time_Start": 1986.74,
      "Time_End": 1992.74,
      "Text": " Again, times that by $10, that's half a billion dollars. Security ain't that cheap. All these"
    },
    {
      "Time_Start": 1993.74,
      "Time_End": 1999.74,
      "Text": " figures were taken from either Wikipedia or Google or Toyota's website themselves. So when we"
    },
    {
      "Time_Start": 2001.74,
      "Time_End": 2007.74,
      "Text": " actually bought this device, I did some testing on a friend of mine's car, a Lexus NS300H. I made"
    },
    {
      "Time_Start": 2009.74,
      "Time_End": 2015.74,
      "Text": " a device here. As you can see, it's got a little missile switch. That does the unlock. The other"
    },
    {
      "Time_Start": 2015.74,
      "Time_End": 2022.74,
      "Text": " switch here turns off and on the additional transceiver component. I went over to see my mate"
    },
    {
      "Time_Start": 2022.74,
      "Time_End": 2027.74,
      "Text": " and we tried it without the additional transceiver. Because I didn't want to break his car."
    },
    {
      "Time_Start": 2027.74,
      "Time_End": 2033.74,
      "Text": " Because I know when my car was stolen, it threw 26 DTCs and probably had to be reset. So I was a"
    },
    {
      "Time_Start": 2034.74,
      "Time_End": 2040.74,
      "Text": " bit cautious. Check the one for unlock. That worked. Check the one for start the engine without"
    },
    {
      "Time_Start": 2040.74,
      "Time_End": 2046.74,
      "Text": " the additional transceiver. Didn't work. After I left, curiosity got the better of him and he"
    },
    {
      "Time_Start": 2046.74,
      "Time_End": 2052.74,
      "Text": " used my version of this and had a little play himself. No keys in the car. Nowhere near. Plugged"
    },
    {
      "Time_Start": 2052.74,
      "Time_End": 2058.74,
      "Text": " it into the headlight. Let it do its thing. Pop the thing up. Press the button. Car unlocked."
    },
    {
      "Time_Start": 2059.7400000000002,
      "Time_End": 2065.7400000000002,
      "Text": " Drove around the car park a couple of times. Yeah. Oops. He then put it all back together."
    },
    {
      "Time_Start": 2067.7400000000002,
      "Time_End": 2073.7400000000002,
      "Text": " Started the car with a key properly. With a key present, et cetera. And the rotating headlight"
    },
    {
      "Time_Start": 2073.7400000000002,
      "Time_End": 2078.7400000000002,
      "Text": " on the left‑hand side of the vehicle stopped working. So he had to take it back to the dealer"
    },
    {
      "Time_Start": 2078.7400000000002,
      "Time_End": 2084.7400000000002,
      "Text": " and say, ooh, my headlight stopped working. I haven't been playing around with it. Luckily it"
    },
    {
      "Time_Start": 2084.7400000000002,
      "Time_End": 2090.7400000000002,
      "Text": " didn't cost him anything because I feel a bit guilty that he broke his car for me. So, yep, thank"
    },
    {
      "Time_Start": 2090.7400000000002,
      "Time_End": 2096.7400000000002,
      "Text": " you very much. Yep, cheers. I'd like to actually get access to all of the different models that are"
    },
    {
      "Time_Start": 2096.7400000000002,
      "Time_End": 2102.7400000000002,
      "Text": " actually claimed to be used and then have the full Toyota diagnostic tool with the cooperation"
    },
    {
      "Time_Start": 2102.7400000000002,
      "Time_End": 2108.7400000000002,
      "Text": " of Toyota to then reset them and then update the list on the CVE to then actually see which"
    },
    {
      "Time_Start": 2108.7400000000002,
      "Time_End": 2114.7400000000002,
      "Text": " ones are and are not possible. The interesting one is, though, if you know anything about the"
    },
    {
      "Time_Start": 2114.7400000000002,
      "Time_End": 2120.7400000000002,
      "Text": " Toyota Supra, that may or may not be a BMW Z4. So is the BMW Z4 also vulnerable to the same"
    },
    {
      "Time_Start": 2124.7400000000002,
      "Time_End": 2130.7400000000002,
      "Text": " thing? I don't know. I would like to check it. If you have a Z4 in the car park, hit me up"
    },
    {
      "Time_Start": 2130.7400000000002,
      "Time_End": 2136.7400000000002,
      "Text": " later. Where did I go? No, don't, please. I don't want to get done doing anything stupid. And"
    },
    {
      "Time_Start": 2136.7400000000002,
      "Time_End": 2142.7400000000002,
      "Text": " the Toyota Proace van, if you know anything about that one, that's based on the Peugeot"
    },
    {
      "Time_Start": 2142.7400000000002,
      "Time_End": 2148.7400000000002,
      "Text": " Citroen platform in Europe. So, again, there are other vehicles also based on that platform that"
    },
    {
      "Time_Start": 2148.7400000000002,
      "Time_End": 2154.7400000000002,
      "Text": " could potentially be vulnerable. On to the disclosure process. This was fun. In March earlier"
    },
    {
      "Time_Start": 2154.7400000000002,
      "Time_End": 2160.7400000000002,
      "Text": " this year, I put a tweet out, does anyone have a contact in Toyota, either Japan or U.S. or"
    },
    {
      "Time_Start": 2161.7400000000002,
      "Time_End": 2167.7400000000002,
      "Text": " anywhere, to help us with the disclosure? I've got this thing that's used to steal cars. I've"
    },
    {
      "Time_Start": 2167.7400000000002,
      "Time_End": 2173.7400000000002,
      "Text": " got nothing. I said, okay. I rang my local dealer. I nearly bought the car off and said, by"
    },
    {
      "Time_Start": 2176.5800000000004,
      "Time_End": 2181.5400000000004,
      "Text": " the way, have you had any issues with cars being stolen? And the receptionist was really"
    },
    {
      "Time_Start": 2181.5400000000004,
      "Time_End": 2186.2000000000003,
      "Text": " helpful and said, no, but I'll get the service manager to ring you back. About a half hour"
    },
    {
      "Time_Start": 2186.2000000000003,
      "Time_End": 2191.0000000000005,
      "Text": " later, service manager rang me back and went, actually, yeah, one of my demonstrators, I was out"
    },
    {
      "Time_Start": 2191.0000000000005,
      "Time_End": 2197.32,
      "Text": " for a night out a couple of weeks back or a couple of months back, parked it up, went home, came"
    },
    {
      "Time_Start": 2197.32,
      "Time_End": 2202.78,
      "Text": " back the next morning, it wasn't there. He did a bit of an investigation and then found out,"
    },
    {
      "Time_Start": 2202.78,
      "Time_End": 2209.5800000000004,
      "Text": " yep, they've been nicking it by the headlights. I spoke to him and he said at one point late in"
    },
    {
      "Time_Start": 2209.58,
      "Time_End": 2216.74,
      "Text": " last year, there was his garage alone that he worked at was getting three instances a week of"
    },
    {
      "Time_Start": 2216.74,
      "Time_End": 2222.54,
      "Text": " vehicles either being stolen or being potentially stolen. There was a memo put out by someone"
    },
    {
      "Time_Start": 2222.54,
      "Time_End": 2227.2799999999997,
      "Text": " somewhere in Toyota U.K. or Europe or something saying, by the way, make sure you lock your"
    },
    {
      "Time_Start": 2227.2799999999997,
      "Time_End": 2232.5,
      "Text": " vehicles up behind the bars and things because they will go walkies off your forecourt. So,"
    },
    {
      "Time_Start": 2232.5,
      "Time_End": 2239.08,
      "Text": " yes, they are aware of it. They've known about it. Great. I then sent some details to him"
    },
    {
      "Time_Start": 2239.08,
      "Time_End": 2245.24,
      "Text": " about what we found out. He then sent them off to somewhere who he was dealing with and a few"
    },
    {
      "Time_Start": 2245.24,
      "Time_End": 2251.0,
      "Text": " days later I got a direct e‑mail from someone from Toyota Japan copied into quite a few people"
    },
    {
      "Time_Start": 2251.0,
      "Time_End": 2257.96,
      "Text": " in Toyota Europe and it basically said, use hacker one vulnerability disclosure program. So,"
    },
    {
      "Time_Start": 2257.96,
      "Time_End": 2263.8199999999997,
      "Text": " yeah, that one that I went to auto Isaac in 2019 to talk about vulnerability disclosure, that was"
    },
    {
      "Time_Start": 2263.82,
      "Time_End": 2269.02,
      "Text": " at Toyota's headquarters. Great. Their vulnerability disclosure program has a couple of"
    },
    {
      "Time_Start": 2269.02,
      "Time_End": 2275.1600000000003,
      "Text": " caveats. There's a restriction to modifications to the vehicle. Tell that to the criminal, rip"
    },
    {
      "Time_Start": 2275.1600000000003,
      "Time_End": 2279.82,
      "Text": " the bumper off to actually get to the headlight. So, yep, you can't do that to steal my car."
    },
    {
      "Time_Start": 2279.82,
      "Time_End": 2285.2400000000002,
      "Text": " Yeah, no, you're not allowed to do that. So, yeah, great. And there's an implied NDA. And"
    },
    {
      "Time_Start": 2285.2400000000002,
      "Time_End": 2291.2400000000002,
      "Text": " then implied NDA says when you tell hacker one something about it, basically you then can't"
    },
    {
      "Time_Start": 2291.2400000000002,
      "Time_End": 2296.94,
      "Text": " tell anyone else about it. So, you can't warn anyone that you've actually told Toyota via"
    },
    {
      "Time_Start": 2296.94,
      "Time_End": 2304.1200000000003,
      "Text": " hacker one. So, great. Wonderful. I did actually get an e‑mail back from Toyota Japan saying,"
    },
    {
      "Time_Start": 2304.1200000000003,
      "Time_End": 2311.1600000000003,
      "Text": " by the way, we're going to waive that NDA. But a few weeks later I got someone I know was on"
    },
    {
      "Time_Start": 2311.1600000000003,
      "Time_End": 2318.44,
      "Text": " the auto Isaac panel and they were discussing our vulnerability in one of their meetings and"
    },
    {
      "Time_Start": 2318.44,
      "Time_End": 2324.9,
      "Text": " the discussion basically went along the lines of how can we shut these people up? Because it's"
    },
    {
      "Time_Start": 2324.9,
      "Time_End": 2331.4,
      "Text": " cheaper to silence them to actually then fix the problem. So, someone sends me a random NDA"
    },
    {
      "Time_Start": 2331.4,
      "Time_End": 2336.82,
      "Text": " disclaimer thingy that may or may not be on an e‑mail that I can't guarantee is genuine. You"
    },
    {
      "Time_Start": 2336.82,
      "Time_End": 2344.82,
      "Text": " think I'm going to trust that? Do anyone see what happened to Carlos Ghosn? Yeah? Great. No."
    },
    {
      "Time_Start": 2344.82,
      "Time_End": 2350.1600000000003,
      "Text": " Got done for fraud. Had to be smuggled out of Japan in a flight box. So, currently we're in the"
    },
    {
      "Time_Start": 2350.1600000000003,
      "Time_End": 2356.2400000000002,
      "Text": " process of disclosing via ASRG, automotive security research group. And they are again"
    },
    {
      "Time_Start": 2356.2400000000002,
      "Time_End": 2363.0800000000004,
      "Text": " getting exactly the same response from Toyota. And the response is report it by hacker one. This"
    },
    {
      "Time_Start": 2363.0800000000004,
      "Time_End": 2370.32,
      "Text": " morning I actually had a meeting with someone from Toyota USA. And basically told them some"
    },
    {
      "Time_Start": 2370.32,
      "Time_End": 2375.6600000000003,
      "Text": " of the details of my findings and they basically said it needs to go via hacker one because we"
    },
    {
      "Time_Start": 2375.6600000000003,
      "Time_End": 2381.1200000000003,
      "Text": " need to track things. Which I understand. That's fine. And I said to him, as long as you get me a"
    },
    {
      "Time_Start": 2381.1200000000003,
      "Time_End": 2387.44,
      "Text": " piece of paper that is a signed proper piece of paper on Toyota headed paper, we will do it. We"
    },
    {
      "Time_Start": 2387.44,
      "Time_End": 2391.7000000000003,
      "Text": " will share some information. There may have to be an NDA in one direction because you might"
    },
    {
      "Time_Start": 2391.7000000000003,
      "Time_End": 2395.78,
      "Text": " tell me some stuff that you don't want getting out. Which is fine. But anything that is"
    },
    {
      "Time_Start": 2395.78,
      "Time_End": 2401.94,
      "Text": " currently out isn't dangerous because I'm not going to tell you all the secrets. And I can't"
    },
    {
      "Time_Start": 2401.94,
      "Time_End": 2409.28,
      "Text": " tell you all the secrets because it's how to steal a bloody car. So, yep. After that thing, I did"
    },
    {
      "Time_Start": 2409.28,
      "Time_End": 2414.36,
      "Text": " actually put a LinkedIn post with a bit of tongue in cheek thing that basically said, by the way,"
    },
    {
      "Time_Start": 2414.36,
      "Time_End": 2420.82,
      "Text": " if you want some information on this stuff, hit us up. We can have a private meeting without too"
    },
    {
      "Time_Start": 2420.86,
      "Time_End": 2428.86,
      "Text": " many people around so that we can discuss it with other OEMs, et cetera. So, back on to my"
    },
    {
      "Time_Start": 2428.86,
      "Time_End": 2434.7400000000002,
      "Text": " colleague, Ken, with some potential fixes. Okay, so we've talked a lot about how this theft"
    },
    {
      "Time_Start": 2434.7400000000002,
      "Time_End": 2440.86,
      "Text": " device works and how it uses a transceiver to bust through all kinds of defenses. And we've"
    },
    {
      "Time_Start": 2440.86,
      "Time_End": 2445.6600000000003,
      "Text": " talked about all the things that won't work like relays to headlights and $50 billion of money"
    },
    {
      "Time_Start": 2445.66,
      "Time_End": 2454.54,
      "Text": " spent on electronics. What fixes are there? So, we offered two. One of them is to do a quick and"
    },
    {
      "Time_Start": 2454.54,
      "Time_End": 2461.5,
      "Text": " dirty short-term fix. So, make the gateway paranoid about CAN bus errors at startup. So,"
    },
    {
      "Time_Start": 2461.5,
      "Time_End": 2466.7,
      "Text": " when the vehicle is first being started up and this theft device is working, it's a very crude"
    },
    {
      "Time_Start": 2466.7,
      "Time_End": 2472.3199999999997,
      "Text": " device. So, it blasts its frames onto the CAN bus and everyone else's frames don't turn up. So,"
    },
    {
      "Time_Start": 2472.36,
      "Time_End": 2477.44,
      "Text": " there are heartbeat messages missing and stuff like that. So, if the gateway device is a bit"
    },
    {
      "Time_Start": 2477.44,
      "Time_End": 2482.6400000000003,
      "Text": " paranoid and sees a bunch of errors on the CAN bus, its own frames are not being sent,"
    },
    {
      "Time_Start": 2482.6400000000003,
      "Time_End": 2487.0800000000004,
      "Text": " it's gone, it can basically say, I'm not going to forward any messages until that happens,"
    },
    {
      "Time_Start": 2487.0800000000004,
      "Time_End": 2491.6400000000003,
      "Text": " until it's all gone away. And if there was a false positive on that, you would just try your"
    },
    {
      "Time_Start": 2491.6400000000003,
      "Time_End": 2497.2400000000002,
      "Text": " smart key again. So, this is a quick and dirty hack. The theft device vendors, I won't explain"
    },
    {
      "Time_Start": 2497.2400000000002,
      "Time_End": 2502.6800000000003,
      "Text": " how, but they could work around this after a while with a bit more work and effort or maybe"
    },
    {
      "Time_Start": 2502.6800000000003,
      "Time_End": 2509.1600000000003,
      "Text": " we just move on to someone else's car. But either way, it's a short-term fix. A permanent fix to"
    },
    {
      "Time_Start": 2509.1600000000003,
      "Time_End": 2519.8,
      "Text": " this is to use cryptographic messaging between the smart key up here, smart key ECU and the doors"
    },
    {
      "Time_Start": 2520.28,
      "Time_End": 2527.1600000000003,
      "Text": " and the smart key and the engine management or possibly just the gateway. And you can use"
    },
    {
      "Time_Start": 2527.1600000000003,
      "Time_End": 2534.1200000000003,
      "Text": " solutions like CryptoCAN, which I developed at Canis Labs, or you could use SECOC, which is"
    },
    {
      "Time_Start": 2534.1200000000003,
      "Time_End": 2540.84,
      "Text": " Autosales Secure Onboard Communication, to secure those messages against spoofing. There's no need"
    },
    {
      "Time_Start": 2540.84,
      "Time_End": 2545.2400000000002,
      "Text": " to encrypt every message, of course, you don't need to encrypt everything because thieves are"
    },
    {
      "Time_Start": 2545.2400000000002,
      "Time_End": 2550.2000000000003,
      "Text": " not going to get by with some of the really boring sensor messages. It's important it's the"
    },
    {
      "Time_Start": 2550.2000000000003,
      "Time_End": 2558.2000000000003,
      "Text": " smart key traffic to the immobilizer and the doors and other things to encrypt. Just a"
    },
    {
      "Time_Start": 2558.2000000000003,
      "Time_End": 2565.4,
      "Text": " couple of slides left. This one's quite funny. I think Toyota might be trolling me. 2024 Toyota"
    },
    {
      "Time_Start": 2565.4,
      "Time_End": 2573.0800000000004,
      "Text": " Tacoma gets a JBL speaker that has a nifty removable speaker. Looks a bit like this. Is this"
    },
    {
      "Time_Start": 2573.08,
      "Time_End": 2578.12,
      "Text": " just in case you lose the keys out on the trail? It's got the hardware in it. A little extra"
    },
    {
      "Time_Start": 2578.12,
      "Time_End": 2584.2,
      "Text": " wire, poke it underneath the wheel arch, job's a good'un. I don't think it does, but it would be"
    },
    {
      "Time_Start": 2584.2,
      "Time_End": 2590.2,
      "Text": " bloody hilarious if you could retrofit it. I could do that. I'm not going to because we don't"
    },
    {
      "Time_Start": 2590.2,
      "Time_End": 2596.66,
      "Text": " get the Tacoma in the U.K., but it would be funny. This is potentially my last slide with any"
    },
    {
      "Time_Start": 2596.66,
      "Time_End": 2604.94,
      "Text": " sort of information. The fallout of our findings. A friend of mine, David Rogers, found this"
    },
    {
      "Time_Start": 2604.94,
      "Time_End": 2611.62,
      "Text": " article about Jaguar Land Rover. Insurance companies in the U.K. are not insuring them anymore"
    },
    {
      "Time_Start": 2611.62,
      "Time_End": 2618.08,
      "Text": " because they are so easy to be stolen or they're basically pricing it out of the market. So car"
    },
    {
      "Time_Start": 2618.08,
      "Time_End": 2624.62,
      "Text": " makers need to get their finger out of their ass and fix it because cars are going to be either"
    },
    {
      "Time_Start": 2624.62,
      "Time_End": 2630.3199999999997,
      "Text": " uninsurable or no one's going to want them because no one's going to be able to afford a few"
    },
    {
      "Time_Start": 2630.3199999999997,
      "Time_End": 2636.7,
      "Text": " grand a year to actually insure their car. But the problem is, they will fix it going forward."
    },
    {
      "Time_Start": 2636.7,
      "Time_End": 2641.7799999999997,
      "Text": " They won't fix it going back. So all those cars that are previously made are still vulnerable."
    },
    {
      "Time_Start": 2641.7799999999997,
      "Time_End": 2651.7799999999997,
      "Text": " So yeah, not good. On to my final slide. Just like to say thank yous. First to the ASRG, to"
    },
    {
      "Time_Start": 2652.02,
      "Time_End": 2659.6000000000004,
      "Text": " specifically John Hildreth. He's been helping us with the disclosure process to go to Japan. We"
    },
    {
      "Time_Start": 2659.6000000000004,
      "Time_End": 2667.6000000000004,
      "Text": " are doing this exactly the same talk at the ASRG SOS conference next month in September. So look"
    },
    {
      "Time_Start": 2667.6000000000004,
      "Time_End": 2675.32,
      "Text": " it up. I'd also like to say thank you to Bug Crowd and all the team of car hackers that were"
    },
    {
      "Time_Start": 2675.32,
      "Time_End": 2682.6600000000003,
      "Text": " there in the 2018 and 2019 events. Wave if you're in the audience. There's some down at the"
    },
    {
      "Time_Start": 2682.6600000000003,
      "Time_End": 2689.44,
      "Text": " front. There's some at the back. Yep. Noel Loudon, my friend that's an incident"
    },
    {
      "Time_Start": 2689.44,
      "Time_End": 2695.9,
      "Text": " investigation chap, ex-policeman. He's the one that pointed me in the direction. Zoltan may or"
    },
    {
      "Time_Start": 2695.9,
      "Time_End": 2701.82,
      "Text": " may not be the crazy bugger that broke his own car for me. Thank you very much. I didn't ask you"
    },
    {
      "Time_Start": 2701.82,
      "Time_End": 2708.78,
      "Text": " to do that, you idiot. Finally, I'd like to say thank you to Car Hacking Village for allowing"
    },
    {
      "Time_Start": 2708.78,
      "Time_End": 2713.94,
      "Text": " me to be here and share this story. I don't have time for questions because cockups with"
    },
    {
      "Time_Start": 2713.94,
      "Time_End": 2720.9,
      "Text": " audio and I can't give you any more information than has already been given. So don't ask."
    },
    {
      "Time_Start": 2720.9,
      "Time_End": 2726.44,
      "Text": " Yeah? I can't give it. I cannot tell you anything about how it was made, the messages or"
    },
    {
      "Time_Start": 2726.44,
      "Time_End": 2728.48,
      "Text": " anything. So thank you very much."
    }
  ]
}