{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 6.78,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Uh thanks for coming for to the to the presentation. Uh I didn't expect that there would be so many"
    },
    {
      "Time_Start": 6.78,
      "Time_End": 13.280000000000001,
      "Text": " people and frankly speaking I've never presented before such a huge audience. So I should"
    },
    {
      "Time_Start": 13.280000000000001,
      "Time_End": 18.28,
      "Text": " apologize in advance uh if I forget how to speak or faint just wake me up I will proceed where"
    },
    {
      "Time_Start": 21.72,
      "Time_End": 26.72,
      "Text": " from where I stopped. So the presentation today the name of the presentation is How an Exiled"
    },
    {
      "Time_Start": 27.38,
      "Time_End": 32.379999999999995,
      "Text": " Pirate Media Outlet Breaks Through the Kremlin's Propaganda Firewall. The long name uh pretty"
    },
    {
      "Time_Start": 36.22,
      "Time_End": 41.22,
      "Text": " straightforward and today I would like to tell you uh the story of the pirate media. Uh the"
    },
    {
      "Time_Start": 44.56,
      "Time_End": 49.56,
      "Text": " story of the small company that has become the most important, the biggest independent Russian"
    },
    {
      "Time_Start": 49.92,
      "Time_End": 54.92,
      "Text": " speaking media outlet that has been blocked but yet but still we have millions of readers"
    },
    {
      "Time_Start": 59.2,
      "Time_End": 65.56,
      "Text": " within Russian borders. Also I'm gonna tell you about the what actually happens within"
    },
    {
      "Time_Start": 65.56,
      "Time_End": 70.58,
      "Text": " Russia in regards of uh censorship. And tell you that Russia has become one of the most uh"
    },
    {
      "Time_Start": 71.24,
      "Time_End": 76.24,
      "Text": " technically advanced countries in these regards. Uh I'll tell you uh how being such a big"
    },
    {
      "Time_Start": 82.78,
      "Time_End": 87.78,
      "Text": " pin in the ass of the government uh Meduza are still alive. And as a bonus I'm gonna give"
    },
    {
      "Time_Start": 91.16,
      "Time_End": 96.16,
      "Text": " you our forecast on what's gonna happen next in upcoming years. Is it okay with you?"
    },
    {
      "Time_Start": 101.53999999999999,
      "Time_End": 106.53999999999999,
      "Text": " Okay. Thanks guys. So uh my name is Alex. I'm head of technical department. I should apologize"
    },
    {
      "Time_Start": 111.28,
      "Time_End": 116.28,
      "Text": " for the photo of myself. It's the design team who put it there. Um couple words about"
    },
    {
      "Time_Start": 118.58,
      "Time_End": 123.58,
      "Text": " myself. I started as a network engineer and I'm doing IT stuff for almost 18 years already."
    },
    {
      "Time_Start": 124.14,
      "Time_End": 129.14,
      "Text": " And I feel like I'm the dumbest person in this conference. The other day I approached some"
    },
    {
      "Time_Start": 135.72,
      "Time_End": 140.72,
      "Text": " kids because I thought they will be smart at the same level as smart as as myself. You know."
    },
    {
      "Time_Start": 142.46,
      "Time_End": 148.92,
      "Text": " And they told me that they managed to hijack transportation system. You know. And it was"
    },
    {
      "Time_Start": 148.94000000000003,
      "Time_End": 153.94000000000003,
      "Text": " like big impact uh at my ego. So I'm feeling now the dumbest person here. Sorry for that."
    },
    {
      "Time_Start": 156.62,
      "Time_End": 162.12,
      "Text": " Couple words about the technical team of Meduza. It's about like 20 person. It's developers,"
    },
    {
      "Time_Start": 162.12,
      "Time_End": 167.12,
      "Text": " designers, testers, product project people. And normally before the war in Ukraine we were"
    },
    {
      "Time_Start": 168.9,
      "Time_End": 173.56,
      "Text": " focused on the development of our products. Mobile application, website, side products,"
    },
    {
      "Time_Start": 173.58,
      "Time_End": 178.58,
      "Text": " whatever. Our infrastructure, podcast distribution, so on and so forth. After the war since we"
    },
    {
      "Time_Start": 180.72,
      "Time_End": 186.12,
      "Text": " become once again the biggest pin in the ass of the government. Uh we started spending the"
    },
    {
      "Time_Start": 186.12,
      "Time_End": 191.12,
      "Text": " waste- the best part of our time uh trying to protect ourself from attacks. And uh trying to"
    },
    {
      "Time_Start": 193.92000000000002,
      "Time_End": 198.92000000000002,
      "Text": " sneak information within Russian Federation. Couple slides about geopolitics. We are"
    },
    {
      "Time_Start": 203.88,
      "Time_End": 208.88,
      "Text": " hoping you like it. Uh this is Russia. If someone doesn't know. Uh the population of Russia is"
    },
    {
      "Time_Start": 211.38,
      "Time_End": 216.38,
      "Text": " 133 millions according to Wikipedia. Uh to give a comparison it's pretty much it's a little bit"
    },
    {
      "Time_Start": 220.12,
      "Time_End": 225.12,
      "Text": " more than in uh Mexico and about a half of population of United States of America. Um I'm"
    },
    {
      "Time_Start": 226.12,
      "Time_End": 231.12,
      "Text": " asking you to imagine what if all the population, all the people who lives in Russia won't be"
    },
    {
      "Time_Start": 236.6,
      "Time_End": 241.6,
      "Text": " able to receive information except from the information that delivered by government. Just"
    },
    {
      "Time_Start": 244.3,
      "Time_End": 250.88,
      "Text": " think about that I'm not saying something. Um so basically they will receive just propaganda."
    },
    {
      "Time_Start": 250.88,
      "Time_End": 257.12,
      "Text": " It's something pretty much like I guess in North Korea for instance. So government decides"
    },
    {
      "Time_Start": 257.12,
      "Time_End": 262.12,
      "Text": " what information they will get from abroad. Is it good or bad? Just think about that. And"
    },
    {
      "Time_Start": 265.82,
      "Time_End": 270.82,
      "Text": " tell me afterwards. Also uh on the second slide you can see some more countries which are"
    },
    {
      "Time_Start": 273.6,
      "Time_End": 279.44,
      "Text": " with a- which are good friends of Russia. They have lots of similarities. These countries"
    },
    {
      "Time_Start": 279.44,
      "Time_End": 284.44,
      "Text": " are autocratics or some would call it uh dictatorship. These countries are fond of blocking"
    },
    {
      "Time_Start": 287.34,
      "Time_End": 292.34,
      "Text": " internet. They are fond of uh pursuing journalists and they like to get the best out of Russia"
    },
    {
      "Time_Start": 299.02,
      "Time_End": 304.82,
      "Text": " you know. I'm talking about the knowledge uh technologies of censorship and so on and so"
    },
    {
      "Time_Start": 304.84,
      "Time_End": 311.68,
      "Text": " forth. Together with Russia it's almost 250 millions of people. It's pretty much the uh"
    },
    {
      "Time_Start": 311.68,
      "Time_End": 316.68,
      "Text": " population of United States of America. And the same questions. Same question. Think what will"
    },
    {
      "Time_Start": 318.26,
      "Time_End": 323.26,
      "Text": " happen if all those countries together with Russia will have no access to any information"
    },
    {
      "Time_Start": 326.4,
      "Time_End": 331.4,
      "Text": " except for what government says to them. Once again it reminds me of Soviet Union. We had"
    },
    {
      "Time_Start": 332.12000000000006,
      "Time_End": 337.12000000000006,
      "Text": " that before. And maybe some of that or your parents remember Cold War. So it's not the good"
    },
    {
      "Time_Start": 343.50000000000006,
      "Time_End": 348.50000000000006,
      "Text": " thing uh for people to be scared of uh die because of like nuclear strike. And the last"
    },
    {
      "Time_Start": 353.98,
      "Time_End": 358.98,
      "Text": " geopolitical slide. Sorry. Uh you can see it's a good partners of Russia. It's a good partners"
    },
    {
      "Time_Start": 361.96000000000004,
      "Time_End": 368.46000000000004,
      "Text": " which is China, Iran, Syria and of course North Korea. And the from what we know these countries"
    },
    {
      "Time_Start": 368.46000000000004,
      "Time_End": 374.56000000000006,
      "Text": " are constantly uh have communication with Russia. They have exchange of knowledge about the"
    },
    {
      "Time_Start": 374.56000000000006,
      "Time_End": 379.56000000000006,
      "Text": " technologies. China provides equipment for Russia for censorship. Once again what might go"
    },
    {
      "Time_Start": 381.34000000000003,
      "Time_End": 386.34000000000003,
      "Text": " wrong if all those countries will work together and where it all goes. So here I'm finishing"
    },
    {
      "Time_Start": 386.72,
      "Time_End": 391.72,
      "Text": " my geopolitical part of the presentation. Think what could go wrong. We will get to this in"
    },
    {
      "Time_Start": 395.26000000000005,
      "Time_End": 400.26000000000005,
      "Text": " the end of the presentation. So and now let's get back to 2014. It's not exactly how it all"
    },
    {
      "Time_Start": 403.1,
      "Time_End": 408.54,
      "Text": " started. It's not the time when the like the ideas of control of the internet has started. It"
    },
    {
      "Time_Start": 408.54,
      "Time_End": 414.84000000000003,
      "Text": " started a little bit before. But in 2014 everything has become turbulent. And these events"
    },
    {
      "Time_Start": 414.88000000000005,
      "Time_End": 420.08000000000004,
      "Text": " brought us where we currently are. I'm talking about this uh massive censorship. I'm talking"
    },
    {
      "Time_Start": 420.08000000000004,
      "Time_End": 423.88000000000005,
      "Text": " about the war in Ukraine. I'm talking about all the other bad things that happening"
    },
    {
      "Time_Start": 423.88000000000005,
      "Time_End": 428.90000000000003,
      "Text": " currently. And when I googled what is the most important event in 2014 this is what I found."
    },
    {
      "Time_Start": 433.3,
      "Time_End": 439.50000000000006,
      "Text": " Ice bucket challenge. I'm pretty sure this is not anyhow related to the massive censorship"
    },
    {
      "Time_Start": 439.5,
      "Time_End": 444.5,
      "Text": " in Russia. But if it would I would understand the government you know. On the other part of"
    },
    {
      "Time_Start": 447.9,
      "Time_End": 454.18,
      "Text": " the world at this moment in 2014 when the like ice bucket challenge was popular there was"
    },
    {
      "Time_Start": 454.18,
      "Time_End": 460.48,
      "Text": " some serious events. Euromaidan uh it's like when Ukrainian people took down pro-Russian"
    },
    {
      "Time_Start": 460.48,
      "Time_End": 466.7,
      "Text": " president. Annexation of Crimea and consequent sanctions from European Union and USA"
    },
    {
      "Time_Start": 466.7,
      "Time_End": 471.7,
      "Text": " against Russia. And I guess uh we feel that that was the moment when something has changed and"
    },
    {
      "Time_Start": 474.24,
      "Time_End": 480.3,
      "Text": " Russian government decided to change the direction. They always wanted to control media"
    },
    {
      "Time_Start": 480.3,
      "Time_End": 485.32,
      "Text": " market and internet but in 2014 I guess they decided that they need to invest more. And this"
    },
    {
      "Time_Start": 488.82,
      "Time_End": 495.56,
      "Text": " is the moment when everything has changed. But I mean we have a saying uh there's no bad"
    },
    {
      "Time_Start": 495.62,
      "Time_End": 500.62,
      "Text": " things without good things. And in 2014 company named Medusa was born. The company uh I will"
    },
    {
      "Time_Start": 505.0,
      "Time_End": 511.0,
      "Text": " tell you about currently. Basically uh Russian government started interfering uh to"
    },
    {
      "Time_Start": 511.0,
      "Time_End": 516.0,
      "Text": " journalistic work and as you can see from the head heading of the article uh they uh fired uh"
    },
    {
      "Time_Start": 518.84,
      "Time_End": 524.94,
      "Text": " editor in chief from one of the biggest independent internet media organizations. Uh and"
    },
    {
      "Time_Start": 524.96,
      "Time_End": 530.94,
      "Text": " replaced her with a pro-Kremlin figure. This was because she dis- disobeyed, she didn't want to"
    },
    {
      "Time_Start": 530.94,
      "Time_End": 535.94,
      "Text": " take down some articles and luckily or I don't know some um a part of her team uh part of uh"
    },
    {
      "Time_Start": 541.4200000000001,
      "Time_End": 546.4200000000001,
      "Text": " Lentaru left the company together with her. And this was the start of the Medusa. And now I"
    },
    {
      "Time_Start": 546.8399999999999,
      "Time_End": 551.8399999999999,
      "Text": " will explain why we're talking about the pirate ship. So Medusa 2014 uh the idea of the"
    },
    {
      "Time_Start": 555.9799999999999,
      "Time_End": 560.52,
      "Text": " creation of the media we called it like we're gonna be pirates. We will be pirate media. What"
    },
    {
      "Time_Start": 560.52,
      "Time_End": 565.52,
      "Text": " does it mean? So we will need a safe haven. We will be independent from anyone. We will obey"
    },
    {
      "Time_Start": 567.7199999999999,
      "Time_End": 574.24,
      "Text": " no one. We will be self-sufficient. And we constantly will be attacked uh we constantly we"
    },
    {
      "Time_Start": 574.26,
      "Time_End": 578.5600000000001,
      "Text": " will be persecuted. Apparently we will be killed. So we were like kind of pirates. And you can"
    },
    {
      "Time_Start": 578.5600000000001,
      "Time_End": 584.34,
      "Text": " see the photo. Uh actually we have lots of these black flags still in our office and this is"
    },
    {
      "Time_Start": 584.34,
      "Time_End": 589.34,
      "Text": " one of our like official symbols. Uh something like that. So the safe haven for us become"
    },
    {
      "Time_Start": 591.88,
      "Time_End": 596.88,
      "Text": " European Union. We started abroad from Russia. This helped us to avoid uh interference"
    },
    {
      "Time_Start": 597.5,
      "Time_End": 602.5,
      "Text": " inter- government can interest, sorry it's a complicated word I can't pronounce it."
    },
    {
      "Time_Start": 607.98,
      "Time_End": 612.72,
      "Text": " Governments can affect anyhow our work. We decided that it would be decentralized"
    },
    {
      "Time_Start": 612.72,
      "Time_End": 617.96,
      "Text": " leadership and funding so we will have no single person who owns the company who can affect"
    },
    {
      "Time_Start": 617.96,
      "Time_End": 624.6,
      "Text": " anyhow us. Uh we expected that we will be blocked, prosecuted, attacked so security was"
    },
    {
      "Time_Start": 624.62,
      "Time_End": 630.82,
      "Text": " priority for us. And we wanted to be independent from everyone so we started with a technical"
    },
    {
      "Time_Start": 630.82,
      "Time_End": 635.82,
      "Text": " team. I told you about that. And uh everything is built in house. Websites, uh content"
    },
    {
      "Time_Start": 638.8000000000001,
      "Time_End": 644.0,
      "Text": " management system, mobile application, everything. And the important thing to mention uh that"
    },
    {
      "Time_Start": 644.0,
      "Time_End": 648.44,
      "Text": " we decided that we'll be different. I mean we're pirate media. We don't want to be like this"
    },
    {
      "Time_Start": 648.44,
      "Time_End": 653.44,
      "Text": " smart uh serious news media. We would like to appeal to younger generation. We would like to"
    },
    {
      "Time_Start": 654.64,
      "Time_End": 659.1800000000001,
      "Text": " appeal to younger generation because we were younger ourselves. And we never used this smart"
    },
    {
      "Time_Start": 659.1800000000001,
      "Time_End": 665.58,
      "Text": " language. We always used to use the simple language uh like hey buddy let me explain you"
    },
    {
      "Time_Start": 665.58,
      "Time_End": 672.52,
      "Text": " what does this new law means. So we tried to explain politics through memes, through jokes,"
    },
    {
      "Time_Start": 672.52,
      "Time_End": 677.86,
      "Text": " through swear words, I don't know something like that. We were never boring. And another"
    },
    {
      "Time_Start": 677.86,
      "Time_End": 683.7,
      "Text": " important thing to mention that we were always negative thinkers. We were expecting that"
    },
    {
      "Time_Start": 683.7,
      "Time_End": 687.84,
      "Text": " tomorrow we will be dead. I mean tomorrow uh we will have no money, tomorrow we will be"
    },
    {
      "Time_Start": 687.84,
      "Time_End": 693.1400000000001,
      "Text": " persecuted. And you can see from the first uh design, actually it didn't change much. I mean it"
    },
    {
      "Time_Start": 693.1400000000001,
      "Time_End": 699.12,
      "Text": " was dark because we thought we were living in the Gotham City or something like that. So and"
    },
    {
      "Time_Start": 699.12,
      "Time_End": 705.62,
      "Text": " this negative thinking helped us a lot. I will tell a little bit more about that later. So"
    },
    {
      "Time_Start": 705.62,
      "Time_End": 712.3000000000001,
      "Text": " moving to today. Nine years after like I mean it was difficult nine years. We was dying I"
    },
    {
      "Time_Start": 712.3000000000001,
      "Time_End": 717.8000000000001,
      "Text": " guess four times. We was close to death. There was like terrible accidents when for instance"
    },
    {
      "Time_Start": 717.8000000000001,
      "Time_End": 722.8000000000001,
      "Text": " police planted drugs into the uh backpack of one hour journalist. But now as as of today right"
    },
    {
      "Time_Start": 725.58,
      "Time_End": 730.9200000000001,
      "Text": " at the moment we are the biggest independent Russian speaking media outlet. The most"
    },
    {
      "Time_Start": 730.9200000000001,
      "Time_End": 736.72,
      "Text": " influential and we still can reach millions of readers within Russian Federation despite"
    },
    {
      "Time_Start": 736.72,
      "Time_End": 741.72,
      "Text": " being blocked. There is some analytics, it's boring I guess. Important thing to know, last"
    },
    {
      "Time_Start": 744.0600000000001,
      "Time_End": 749.0600000000001,
      "Text": " year we have been blocked. This year we have become real pirates because since 2023 we"
    },
    {
      "Time_Start": 751.4,
      "Time_End": 756.4,
      "Text": " outlawed in Russia. What does it means? Uh everyone who works for Meduza will go to jail."
    },
    {
      "Time_Start": 758.5,
      "Time_End": 764.1800000000001,
      "Text": " Everyone who partners with Meduza will go to jail. Everyone who donates money to Meduza"
    },
    {
      "Time_Start": 764.1800000000001,
      "Time_End": 769.1800000000001,
      "Text": " will go to jail. I'm talking about uh Russian people. So in the meantime uh Russia didn't"
    },
    {
      "Time_Start": 773.5400000000001,
      "Time_End": 778.5600000000001,
      "Text": " waste time of course and Russia was evolving technologically. Uh this picture once again we go"
    },
    {
      "Time_Start": 781.5600000000001,
      "Time_End": 786.5600000000001,
      "Text": " back to 2014. This picture actually better explains what was with Russia in 2014 in terms of"
    },
    {
      "Time_Start": 787.0600000000001,
      "Time_End": 792.0600000000001,
      "Text": " technologies. I mean some of you maybe remember these pathetic attempts how they tried to uh"
    },
    {
      "Time_Start": 796.2,
      "Time_End": 801.2,
      "Text": " block telegram and never succeeded actually. But by now they managed to achieve something"
    },
    {
      "Time_Start": 806.2800000000001,
      "Time_End": 812.8800000000001,
      "Text": " that seemed impossible back in the day. All the experts like 3-4 years just 3-4 years ago all"
    },
    {
      "Time_Start": 812.9,
      "Time_End": 818.14,
      "Text": " the technical experts were saying that it is not possible uh to build something similar to"
    },
    {
      "Time_Start": 818.14,
      "Time_End": 824.04,
      "Text": " Chinese firewall in Russia. But I can tell you by now they achieved the goal. They managed to"
    },
    {
      "Time_Start": 824.04,
      "Time_End": 829.58,
      "Text": " install DPI pretty much everywhere. DPI stands for Deep Pocket Inspection. It's like special"
    },
    {
      "Time_Start": 829.58,
      "Time_End": 835.22,
      "Text": " boxes that analyze. I mean you guys you're smarter than me you know it. If you don't know I"
    },
    {
      "Time_Start": 835.22,
      "Time_End": 840.22,
      "Text": " encourage you to visit Pocket Inspection Village. Please do learn and then get back to me and"
    },
    {
      "Time_Start": 843.04,
      "Time_End": 848.04,
      "Text": " help me to outsmart this shit you know. Thanks guys. Sorry can I use swear words? Okay. Sorry"
    },
    {
      "Time_Start": 858.68,
      "Time_End": 863.68,
      "Text": " for that. So on this uh chart you can see what was the difference between 21 and 2022. How"
    },
    {
      "Time_Start": 866.72,
      "Time_End": 871.72,
      "Text": " drastically uh amount of blockings has increased. Some more graphs. At the left hand side"
    },
    {
      "Time_Start": 873.14,
      "Time_End": 878.14,
      "Text": " you see uh the chart from our friends Roskom Svoboda. Uh they block 20,000 websites every"
    },
    {
      "Time_Start": 883.64,
      "Time_End": 888.64,
      "Text": " month in average. And it gets even worse nowadays. And it's not just the pages it's whole"
    },
    {
      "Time_Start": 892.78,
      "Time_End": 897.86,
      "Text": " sites because normally they block by mask. At the right hand side uh I'm not sure if you can"
    },
    {
      "Time_Start": 897.88,
      "Time_End": 904.38,
      "Text": " clearly see it. You can see uh it it's uh it's the chart from our friends Uni Internet"
    },
    {
      "Time_Start": 904.38,
      "Time_End": 910.02,
      "Text": " Observatory. And you can see this is the type of websites they're blocking. The biggest"
    },
    {
      "Time_Start": 910.02,
      "Time_End": 915.02,
      "Text": " bubble is news media. The smaller ones but still big are what is it? I can't see myself. It's"
    },
    {
      "Time_Start": 919.42,
      "Time_End": 926.44,
      "Text": " circumvention, it's human rights, it's social networks, it's file sharing. So obviously you"
    },
    {
      "Time_Start": 926.48,
      "Time_End": 931.48,
      "Text": " can see that they're targeting like freedom of information. And what pisses me off more than"
    },
    {
      "Time_Start": 934.0200000000001,
      "Time_End": 939.0200000000001,
      "Text": " anything else, the other big bubbles are porn and alcohol. So they took information from us."
    },
    {
      "Time_Start": 942.4000000000001,
      "Time_End": 947.4000000000001,
      "Text": " It was fine. But then they took porn and alcohol. And that's why Russians are so grumpy now."
    },
    {
      "Time_Start": 947.8,
      "Time_End": 952.8,
      "Text": " And this actually the uh from my Google analytics from the website. And this is a moment of"
    },
    {
      "Time_Start": 958.98,
      "Time_End": 964.62,
      "Text": " blocking. You can see at left hand side there is we hit the top with 2 million unique readers a"
    },
    {
      "Time_Start": 964.62,
      "Time_End": 969.62,
      "Text": " day. Which is a lot. And the day after the blocking everything dropped by 90%. So we left"
    },
    {
      "Time_Start": 970.02,
      "Time_End": 975.02,
      "Text": " pretty much all the audience. So you are a government. You blocked everything you wanted. All"
    },
    {
      "Time_Start": 982.0600000000001,
      "Time_End": 987.0600000000001,
      "Text": " independent media, porn. What's your next step? Circumvention tools. Of course if you cannot"
    },
    {
      "Time_Start": 989.74,
      "Time_End": 995.84,
      "Text": " watch porn you go and find a VPN service to watch porn. They blocked Tor immediately. It"
    },
    {
      "Time_Start": 995.84,
      "Time_End": 1000.84,
      "Text": " still can, you can still use Tor in Russia. However it's not that easy for ordinary people."
    },
    {
      "Time_Start": 1003.2,
      "Time_End": 1008.88,
      "Text": " They blocked all the major VPN services in Russia so, and they continue blocking those. Even"
    },
    {
      "Time_Start": 1008.88,
      "Time_End": 1013.5400000000001,
      "Text": " those that was called like bulletproof, unblockable VPN services are not working well in"
    },
    {
      "Time_Start": 1013.5400000000001,
      "Time_End": 1019.76,
      "Text": " Russia now. Uh they even forbid from any promotion of VPN service or circumvention tools. If"
    },
    {
      "Time_Start": 1019.76,
      "Time_End": 1025.26,
      "Text": " you ever would like to uh have instruction on your, I don't know, social network, how to set"
    },
    {
      "Time_Start": 1025.28,
      "Time_End": 1030.28,
      "Text": " up Tor bridges, you will be fined and you will go to jail. Uh they even started marketing"
    },
    {
      "Time_Start": 1033.78,
      "Time_End": 1039.46,
      "Text": " campaign uh against VPN services or circumvention tools. You can find in YouTube video when"
    },
    {
      "Time_Start": 1039.46,
      "Time_End": 1045.2,
      "Text": " they tell you that VPN services are stealing your personal data. I mean, I mean they are right"
    },
    {
      "Time_Start": 1045.2,
      "Time_End": 1050.2,
      "Text": " partially. Yeah. So another thing uh that just happened a week ago. They blocked uh WireGuard"
    },
    {
      "Time_Start": 1050.82,
      "Time_End": 1055.82,
      "Text": " and OpenVPN protocols. So the reason for that is uh that in Russia have become self-hosted"
    },
    {
      "Time_Start": 1060.66,
      "Time_End": 1067.46,
      "Text": " VPN services and normally they would be based on WireGuard. So they blocked it. Couple"
    },
    {
      "Time_Start": 1067.46,
      "Time_End": 1072.8,
      "Text": " words about media space control. It's like quite boring for you I guess. But the important"
    },
    {
      "Time_Start": 1072.8,
      "Time_End": 1077.8,
      "Text": " thing like one of the weird laws that was issued just couple weeks ago. Uh they oblige"
    },
    {
      "Time_Start": 1081.18,
      "Time_End": 1086.18,
      "Text": " all the uh recommendation services, new services to disclose to government their algorithms."
    },
    {
      "Time_Start": 1088.5800000000002,
      "Time_End": 1094.06,
      "Text": " How smart, it's how evil smart is that you know. So obviously they will use this algorithm to"
    },
    {
      "Time_Start": 1094.06,
      "Time_End": 1099.06,
      "Text": " make sure that people get in propaganda. What about global companies? So Facebook and"
    },
    {
      "Time_Start": 1102.3600000000001,
      "Time_End": 1107.3600000000001,
      "Text": " Instagram actually whole meta was uh get the status of terrorist terroristic organization in"
    },
    {
      "Time_Start": 1108.1000000000001,
      "Time_End": 1113.1000000000001,
      "Text": " Russia. Which means that you they have been blocked immediately but it's not that safe for"
    },
    {
      "Time_Start": 1115.38,
      "Time_End": 1120.38,
      "Text": " you to use Instagram and uh uh Facebook now. Twitter was blocked quite a while ago. YouTube"
    },
    {
      "Time_Start": 1124.72,
      "Time_End": 1128.88,
      "Text": " while I was preparing this presentation today morning we got the information that in some"
    },
    {
      "Time_Start": 1128.88,
      "Time_End": 1134.8600000000001,
      "Text": " regions in Russia YouTube's no longer working. We do not know yet if it's YouTube block or"
    },
    {
      "Time_Start": 1134.8600000000001,
      "Time_End": 1139.8600000000001,
      "Text": " just like some problems. Uh Google and Apple all the time face uh different types of"
    },
    {
      "Time_Start": 1142.7600000000002,
      "Time_End": 1148.3400000000001,
      "Text": " pressure. Normally it's like they have a lot of use, they find. Google News has been blocked a"
    },
    {
      "Time_Start": 1148.3400000000001,
      "Time_End": 1154.5200000000002,
      "Text": " while ago and Google Search has been blocked today. So it's evolving pretty fast. The last"
    },
    {
      "Time_Start": 1154.5200000000002,
      "Time_End": 1159.5200000000002,
      "Text": " time I checked like several minutes ago in half of the Russia Google Google Search is not"
    },
    {
      "Time_Start": 1159.82,
      "Time_End": 1164.82,
      "Text": " is no longer working. And government pushes people uh to move to national platform. But"
    },
    {
      "Time_Start": 1167.46,
      "Time_End": 1172.96,
      "Text": " sometimes big tech companies help to Russian government. This happened a week ago when I was"
    },
    {
      "Time_Start": 1172.96,
      "Time_End": 1177.96,
      "Text": " preparing the presentation. Apple uh complied with the requirements of government and removed"
    },
    {
      "Time_Start": 1179.8,
      "Time_End": 1184.8,
      "Text": " our best news podcast. Fortunately they get it back in several days but still I mean what will"
    },
    {
      "Time_Start": 1185.76,
      "Time_End": 1190.76,
      "Text": " happen if they will remove our mobile application? This doesn't make any sense because"
    },
    {
      "Time_Start": 1194.1,
      "Time_End": 1199.54,
      "Text": " Google now blocked in Russia. But before you know if you go to Russia you will never find"
    },
    {
      "Time_Start": 1199.54,
      "Time_End": 1204.54,
      "Text": " Medusa even though it's the biggest media outlet. And in top 30 popular uh Google Search you"
    },
    {
      "Time_Start": 1207.3799999999999,
      "Time_End": 1212.3799999999999,
      "Text": " will uh find yellow media or propaganda media. Obviously it's not intentional uh this is"
    },
    {
      "Time_Start": 1213.0,
      "Time_End": 1218.0,
      "Text": " because algorithms. Medusa is blocked in Russia that's why Google put it put it put it down."
    },
    {
      "Time_Start": 1221.0800000000002,
      "Time_End": 1226.0800000000002,
      "Text": " But it's it shouldn't be like that. But how did we survive? I mentioned the negative thinking"
    },
    {
      "Time_Start": 1228.7800000000002,
      "Time_End": 1234.46,
      "Text": " and we were preparing to death and to be blocked quite a while ago. So like several months"
    },
    {
      "Time_Start": 1234.46,
      "Time_End": 1240.0,
      "Text": " before we were blocked we started thinking what can we do? What will happen if government"
    },
    {
      "Time_Start": 1240.02,
      "Time_End": 1246.62,
      "Text": " will block our website? Which are like the core product of the news media. And we come up"
    },
    {
      "Time_Start": 1246.62,
      "Time_End": 1252.06,
      "Text": " with some ideas they are not bright at all. We just prepared some kind of the SOS"
    },
    {
      "Time_Start": 1252.06,
      "Time_End": 1258.1,
      "Text": " communication as we call it. Like hey guys like the giant banner on the website. Hey guys we"
    },
    {
      "Time_Start": 1258.1,
      "Time_End": 1264.84,
      "Text": " will be blocked as soon as the war starts. If the war starts. And you should install VPN you"
    },
    {
      "Time_Start": 1264.84,
      "Time_End": 1269.08,
      "Text": " should do this and that and that and that. You should check our social networks. You should"
    },
    {
      "Time_Start": 1269.12,
      "Time_End": 1275.0,
      "Text": " check YouTube channel and so on and so forth. So we invested a lot like to we started new"
    },
    {
      "Time_Start": 1275.0,
      "Time_End": 1280.0,
      "Text": " podcasts. We started new video shows. Uh we even uh reinvented newsletters. I mean which is"
    },
    {
      "Time_Start": 1282.6399999999999,
      "Time_End": 1287.6799999999998,
      "Text": " like in 21st century who reads newsletters. But I mean it worked perfectly great for us. And I"
    },
    {
      "Time_Start": 1287.6799999999998,
      "Time_End": 1292.52,
      "Text": " highlighted the phrase that what can we do before it's too late. So it's like it's crucial"
    },
    {
      "Time_Start": 1292.52,
      "Time_End": 1297.52,
      "Text": " thing. If we would do it later we wouldn't we won't be successful. So we started to"
    },
    {
      "Time_Start": 1299.6599999999999,
      "Time_End": 1304.52,
      "Text": " and actually that's what happened uh when we were blocked. So people lost access to the"
    },
    {
      "Time_Start": 1304.52,
      "Time_End": 1310.6,
      "Text": " website. I showed you the graphic the chart before. And here you can see how for instance"
    },
    {
      "Time_Start": 1310.6,
      "Time_End": 1317.34,
      "Text": " social networks boomed. Uh downloads of our mobile app is like tripled multiplied by 4. And"
    },
    {
      "Time_Start": 1317.34,
      "Time_End": 1321.98,
      "Text": " this is newsletter one of newsletters. There's hundreds of thousand people signed up"
    },
    {
      "Time_Start": 1321.98,
      "Time_End": 1326.98,
      "Text": " immediately. And now one of my favorite parts the mobile application. This is something we"
    },
    {
      "Time_Start": 1329.48,
      "Time_End": 1335.6,
      "Text": " are very proud of. Uh we had mobile application from the very beginning. Uh the reason for"
    },
    {
      "Time_Start": 1335.6,
      "Time_End": 1340.6,
      "Text": " that we we were our thinking was that we can put anything we want under the hood of"
    },
    {
      "Time_Start": 1342.54,
      "Time_End": 1347.54,
      "Text": " mobile application. So basically we can integrate some circumvention tools. And actually"
    },
    {
      "Time_Start": 1348.54,
      "Time_End": 1352.84,
      "Text": " that's exactly what we've done right before the blocking. Several months before the"
    },
    {
      "Time_Start": 1352.84,
      "Time_End": 1357.84,
      "Text": " blocking. We started using like peer to peer. Uh basically if you install our app your phone"
    },
    {
      "Time_Start": 1361.08,
      "Time_End": 1366.82,
      "Text": " beca- becomes a part of like some mesh. Pretty much like torrents. I mean you know how"
    },
    {
      "Time_Start": 1366.82,
      "Time_End": 1373.32,
      "Text": " that works. I mean it it and it works well. But I mean due to some issues with the battery"
    },
    {
      "Time_Start": 1373.34,
      "Time_End": 1378.34,
      "Text": " drain. And you know people are picky. We need we we stopped using the peer to peer. Then we"
    },
    {
      "Time_Start": 1381.02,
      "Time_End": 1386.02,
      "Text": " were using some uh nice one of the biggest VPN service as a part of our app. Uh but it was"
    },
    {
      "Time_Start": 1388.7,
      "Time_End": 1393.7,
      "Text": " blocked. Together with our VPN services. And we moved to the simpler but yet reliable ways"
    },
    {
      "Time_Start": 1395.86,
      "Time_End": 1402.0,
      "Text": " like uh automated mirror changes like proxying. Something like that. And now we have some"
    },
    {
      "Time_Start": 1402.06,
      "Time_End": 1406.66,
      "Text": " combination of the circumvention tools embedded to the app. And this is something that we're"
    },
    {
      "Time_Start": 1406.66,
      "Time_End": 1412.86,
      "Text": " gonna like evolve develop further. Because we are preparing now for the worst. For instance"
    },
    {
      "Time_Start": 1412.86,
      "Time_End": 1417.5,
      "Text": " we have already implemented the precaution of the content. For instance uh if you're reading"
    },
    {
      "Time_Start": 1417.5,
      "Time_End": 1422.5,
      "Text": " the article the old articles are are downloaded. And I think that will prove itself when we"
    },
    {
      "Time_Start": 1425.58,
      "Time_End": 1429.98,
      "Text": " start using again the peer to peer solution. Also we have the light version that we can"
    },
    {
      "Time_Start": 1430.0,
      "Time_End": 1435.64,
      "Text": " feed within our app. So it doesn't it's like takes just couple of kilobytes for article. So it"
    },
    {
      "Time_Start": 1435.64,
      "Time_End": 1440.64,
      "Text": " will work for the poor connectivity. Emergency mode uh when we can uh upload. We have"
    },
    {
      "Time_Start": 1442.72,
      "Time_End": 1447.1200000000001,
      "Text": " infrastructure for that. We can upload to the Google cloud services. So this is something"
    },
    {
      "Time_Start": 1447.1200000000001,
      "Time_End": 1452.46,
      "Text": " you can hardly block. Without blocking whole Google. Which is happening currently. And lots"
    },
    {
      "Time_Start": 1452.46,
      "Time_End": 1458.3,
      "Text": " of other things we're working on. Automated mirror rotation. This is another thing I would"
    },
    {
      "Time_Start": 1458.32,
      "Time_End": 1463.06,
      "Text": " like to tell you about because we are very proud of. To make automated mirror rotation you need"
    },
    {
      "Time_Start": 1463.06,
      "Time_End": 1468.06,
      "Text": " three things. The first one to discover that the link has been blocked. Issue a new mirror and"
    },
    {
      "Time_Start": 1470.8,
      "Time_End": 1475.8,
      "Text": " deliver it to the user. Normally the problem in Russia with discovery. So I know I don't know"
    },
    {
      "Time_Start": 1479.68,
      "Time_End": 1484.68,
      "Text": " anyone who managed to solve it except except for us. Because of the specific of uh these"
    },
    {
      "Time_Start": 1484.74,
      "Time_End": 1489.74,
      "Text": " DPI tools around of types of blockings around Russia. Because dependent on the region they have"
    },
    {
      "Time_Start": 1492.04,
      "Time_End": 1496.0800000000002,
      "Text": " different types. Some sometimes it's like throttling. Sometimes they have TLS connection."
    },
    {
      "Time_Start": 1496.0800000000002,
      "Time_End": 1501.0800000000002,
      "Text": " Sometimes they don't have. So basically uh we're using our mobile app as a probe. So the"
    },
    {
      "Time_Start": 1503.26,
      "Time_End": 1508.26,
      "Text": " probing the mirrors and we have as soon as we have a lot of uh network issues above some"
    },
    {
      "Time_Start": 1508.62,
      "Time_End": 1513.62,
      "Text": " particular threshold level. We issue a new we issue a new mirror and deliver it to the reader."
    },
    {
      "Time_Start": 1516.36,
      "Time_End": 1521.36,
      "Text": " And it takes like several seconds to get it to the mobile app. This is boring. Okay. I this is"
    },
    {
      "Time_Start": 1525.9,
      "Time_End": 1531.4,
      "Text": " this is this is so much fun you know. This was like the weird idea. Because I mean once again"
    },
    {
      "Time_Start": 1531.4,
      "Time_End": 1536.4,
      "Text": " it's 21st century who will use PDF. Except for me for this presentation. Uh who uses PDF"
    },
    {
      "Time_Start": 1539.08,
      "Time_End": 1545.76,
      "Text": " and we come up with the like weird idea that let's add the functionality that allows you to"
    },
    {
      "Time_Start": 1545.76,
      "Time_End": 1552.36,
      "Text": " print out as the PDF file from the website any of articles. Like on the screenshot you can"
    },
    {
      "Time_Start": 1552.36,
      "Time_End": 1557.36,
      "Text": " see it. And actually we designed it's it's nice and beautiful design which fits perfectly"
    },
    {
      "Time_Start": 1558.9,
      "Time_End": 1564.78,
      "Text": " for printing out. And we were so surprised that hundred thousand of people uses this"
    },
    {
      "Time_Start": 1564.8,
      "Time_End": 1570.5,
      "Text": " functionality. And we had a lot of stories how grandparents or parents of some people ask"
    },
    {
      "Time_Start": 1570.5,
      "Time_End": 1577.5,
      "Text": " them to print this out so they can read it like a newspaper. And I mean this is weird idea."
    },
    {
      "Time_Start": 1577.5,
      "Time_End": 1581.78,
      "Text": " But at the same time if it works then it works. I mean it's better than people reading"
    },
    {
      "Time_Start": 1581.78,
      "Time_End": 1586.78,
      "Text": " Medusa. And they understand that anything they get from the government is a propaganda."
    },
    {
      "Time_Start": 1587.76,
      "Time_End": 1592.76,
      "Text": " Yeah our key idea that we never stop looking for new paths. We always trying to find some"
    },
    {
      "Time_Start": 1595.26,
      "Time_End": 1601.54,
      "Text": " this weird strange ideas to find the ways how to sneak in information to Russia to people."
    },
    {
      "Time_Start": 1601.54,
      "Time_End": 1606.78,
      "Text": " Like we have Instagram story generator. We have uh we using instant view from telegram."
    },
    {
      "Time_Start": 1606.78,
      "Time_End": 1611.44,
      "Text": " It's actually it's the nice thing. Whenever you send Medusa's link to somewhere through"
    },
    {
      "Time_Start": 1611.44,
      "Time_End": 1617.38,
      "Text": " telegram uh you will see instant view. You just click it and you will open article within the"
    },
    {
      "Time_Start": 1617.38,
      "Time_End": 1622.46,
      "Text": " telegram. And even if the site blocked it will be the full article. Light version of the"
    },
    {
      "Time_Start": 1622.46,
      "Time_End": 1628.1000000000001,
      "Text": " website we we collaborating with uh different companies like news aggregators. We providing"
    },
    {
      "Time_Start": 1628.1000000000001,
      "Time_End": 1633.46,
      "Text": " them integrate them so they can get our information. And so on and so forth. Uh and nice"
    },
    {
      "Time_Start": 1633.46,
      "Time_End": 1639.98,
      "Text": " story by the way. Uh there was a guy in Russia who had a radio translator and he was just"
    },
    {
      "Time_Start": 1639.98,
      "Time_End": 1644.8600000000001,
      "Text": " broadcasting through the radio our podcasts. Something like that. I mean if that works"
    },
    {
      "Time_Start": 1644.8600000000001,
      "Time_End": 1649.8600000000001,
      "Text": " then it works. So what's the bottom line? How much time do I have? Uh what's the bottom line?"
    },
    {
      "Time_Start": 1652.4,
      "Time_End": 1657.4,
      "Text": " Uh I mean we are this relatively small company. And obviously we don't have those resources"
    },
    {
      "Time_Start": 1660.04,
      "Time_End": 1665.38,
      "Text": " as uh Russian government has. We don't have like so much money. We don't have we have a small"
    },
    {
      "Time_Start": 1665.38,
      "Time_End": 1670.38,
      "Text": " team. Small technical team. But uh we are inventive. Weird and we are creative. And we have a"
    },
    {
      "Time_Start": 1673.92,
      "Time_End": 1680.0600000000002,
      "Text": " good will. So like and we truly believe in the freedom of information so people tend to help us"
    },
    {
      "Time_Start": 1680.0600000000002,
      "Time_End": 1685.0600000000002,
      "Text": " which was surprising for me. And that's why actually I'm here. Because uh what I've not from"
    },
    {
      "Time_Start": 1687.24,
      "Time_End": 1691.74,
      "Text": " what I've noticed here are the most like brightest people. The smartest people I ever saw in"
    },
    {
      "Time_Start": 1691.76,
      "Time_End": 1698.04,
      "Text": " all my life. And if you have experience any experience in circumvention tools. If you have"
    },
    {
      "Time_Start": 1698.04,
      "Time_End": 1704.32,
      "Text": " experience in packet inspections. If you know technologies. Please reach me out. If there are"
    },
    {
      "Time_Start": 1704.32,
      "Time_End": 1709.78,
      "Text": " people from the big technology big tech companies. Please reach me out. Uh we need your help."
    },
    {
      "Time_Start": 1709.78,
      "Time_End": 1714.8,
      "Text": " If uh is there anyone who works for Russian government? Yeah. So please reach me out. I have"
    },
    {
      "Time_Start": 1714.8999999999999,
      "Time_End": 1719.8999999999999,
      "Text": " some questions you know. You you need to explain to me what is going on. So we are open for any"
    },
    {
      "Time_Start": 1726.0,
      "Time_End": 1732.18,
      "Text": " collaboration. Any kind of support we'll do. Like resources, knowledge, funding, whatever. Or"
    },
    {
      "Time_Start": 1732.18,
      "Time_End": 1736.8799999999999,
      "Text": " if you like us you know just or if you never read Meduza and never heard of Meduza. Go and"
    },
    {
      "Time_Start": 1736.8799999999999,
      "Time_End": 1743.02,
      "Text": " check the website at the bottom like Meduza dot IO slash EN. We have English version. If you"
    },
    {
      "Time_Start": 1743.04,
      "Time_End": 1748.04,
      "Text": " can read in Russian. Check the Russian version. And spread the word about us. And also uh you"
    },
    {
      "Time_Start": 1751.78,
      "Time_End": 1756.96,
      "Text": " can donate. This is like this is not malware by the way. It's just the link to the support"
    },
    {
      "Time_Start": 1756.96,
      "Time_End": 1763.3,
      "Text": " site so you can go like and each buck bucks will matter. And it looks like the last slide but"
    },
    {
      "Time_Start": 1763.3,
      "Time_End": 1768.3,
      "Text": " it's not actually. I have the bonus part of the presentation. So um what is the future of"
    },
    {
      "Time_Start": 1768.36,
      "Time_End": 1773.36,
      "Text": " internet in Russia? What should we expect in the future? As we see from today's presentation uh"
    },
    {
      "Time_Start": 1780.3,
      "Time_End": 1786.0,
      "Text": " just today they blocked Google and this is what's gonna happen in upcoming days, months I"
    },
    {
      "Time_Start": 1786.0,
      "Time_End": 1793.0,
      "Text": " guess. Uh all the global services that are not complying with uh Russian requirements, Russian"
    },
    {
      "Time_Start": 1793.0,
      "Time_End": 1797.78,
      "Text": " government requirements will be replaced by Russian services. And this is something that"
    },
    {
      "Time_Start": 1797.8,
      "Time_End": 1803.24,
      "Text": " already going on. We can see it. We can see that like Google uh Chrome is not the most pop"
    },
    {
      "Time_Start": 1803.24,
      "Time_End": 1808.24,
      "Text": " popular browser anymore. Uh circumvention tools will be available only for advanced uh"
    },
    {
      "Time_Start": 1810.58,
      "Time_End": 1815.58,
      "Text": " technical advanced users. I explained to you before. Uh from what we know from the leaks they"
    },
    {
      "Time_Start": 1817.92,
      "Time_End": 1822.92,
      "Text": " starting massively using AI tools. And that helps them to faster discover and block the"
    },
    {
      "Time_Start": 1823.9,
      "Time_End": 1828.9,
      "Text": " content. Including especially audio visual content. Normally we used to say that podcasts"
    },
    {
      "Time_Start": 1832.44,
      "Time_End": 1838.18,
      "Text": " are below the raiders. It's not the case anymore. Uh we expect they that will they will"
    },
    {
      "Time_Start": 1838.18,
      "Time_End": 1844.8200000000002,
      "Text": " start blocking mirrors for in a faster way. Because like a month ago they were blocking once"
    },
    {
      "Time_Start": 1844.8200000000002,
      "Time_End": 1849.66,
      "Text": " per month. Now they're blocking three times a day. If they will block us like ten times a day"
    },
    {
      "Time_Start": 1849.66,
      "Time_End": 1856.4,
      "Text": " we can do nothing with that. And suffering internet and separation Russian people from"
    },
    {
      "Time_Start": 1856.4,
      "Time_End": 1861.4,
      "Text": " outer world. This is something that's gonna happen very very soon. So like my uh you guys you"
    },
    {
      "Time_Start": 1865.3200000000002,
      "Time_End": 1870.3200000000002,
      "Text": " can read Russian. This is how we imagine Russian internet within what will happen with"
    },
    {
      "Time_Start": 1873.3200000000002,
      "Time_End": 1878.3200000000002,
      "Text": " Russian internet within one year from now on. So I mean my uh forecast would be that less"
    },
    {
      "Time_Start": 1879.66,
      "Time_End": 1885.3600000000001,
      "Text": " than a year before each and every Russian will be isolated from outer information. And we"
    },
    {
      "Time_Start": 1885.3600000000001,
      "Time_End": 1891.88,
      "Text": " getting back to my geopolitical slide. So I mean we are negative thinkers and this is last"
    },
    {
      "Time_Start": 1891.88,
      "Time_End": 1897.38,
      "Text": " slide by the way. We are the negative thinkers and I mean we have the terrible forecasts"
    },
    {
      "Time_Start": 1897.38,
      "Time_End": 1903.6200000000001,
      "Text": " that this this countries this part of the world soon become at least Russia will become some"
    },
    {
      "Time_Start": 1903.6200000000001,
      "Time_End": 1910.6000000000001,
      "Text": " kind of the North Korea. I mean yes this looks like the world collapses for us because we're"
    },
    {
      "Time_Start": 1910.6000000000001,
      "Time_End": 1915.6000000000001,
      "Text": " negative thinkers. But I tell you you know we did already I don't know we doing this forecast"
    },
    {
      "Time_Start": 1918.2600000000002,
      "Time_End": 1924.7,
      "Text": " like four years in a row. And the worst scenario are usually uh the most realistic scenario."
    },
    {
      "Time_Start": 1924.7,
      "Time_End": 1929.38,
      "Text": " And it's pretty accurate. And this was definitely will happen. Within one year we will have"
    },
    {
      "Time_Start": 1929.38,
      "Time_End": 1934.38,
      "Text": " Russia separated from outer world. Within several years we'll have Russia plus uh CIS some"
    },
    {
      "Time_Start": 1937.3200000000002,
      "Time_End": 1943.16,
      "Text": " CIS countries. And just think of what could happen if those countries will collaborate"
    },
    {
      "Time_Start": 1943.16,
      "Time_End": 1948.16,
      "Text": " together. But uh I'm optimistic here. Uh I mean I understand that Meduza only Meduza"
    },
    {
      "Time_Start": 1948.8200000000002,
      "Time_End": 1953.8200000000002,
      "Text": " cannot can do nothing with it. But I'm optimistic here because there's so many people who"
    },
    {
      "Time_Start": 1958.3000000000002,
      "Time_End": 1963.3000000000002,
      "Text": " believe uh in freedom of information uh to freedom of speech. Uh so many bright people"
    },
    {
      "Time_Start": 1966.0400000000002,
      "Time_End": 1973.0400000000002,
      "Text": " around. And and I think we are goodies definitely. I'm pretty sure about that. So I think"
    },
    {
      "Time_Start": 1973.06,
      "Time_End": 1978.06,
      "Text": " that we'll figure it out somehow. And the future will prevail. And I guess that's it."
    },
    {
      "Time_Start": 1980.94,
      "Time_End": 1985.94,
      "Text": " Applause. Thanks guys. And um I have these envelopes. If you want uh to reach me out there's"
    },
    {
      "Time_Start": 1986.42,
      "Time_End": 1991.42,
      "Text": " my contacts here. And there's some nice stickers inside. If you like you can just approach me."
    },
    {
      "Time_Start": 2004.6000000000001,
      "Time_End": 2011.6000000000001,
      "Text": " I will give it away. And you can get from the guy over there. So thank you so much."
    }
  ]
}