{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 4.84,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay. Uh so uh first of all thank you very much for attending this talk and welcome to uh"
    },
    {
      "Time_Start": 4.84,
      "Time_End": 9.84,
      "Text": " video based cryptanalysis. Extracting cryptographic keys from uh video footage of a device"
    },
    {
      "Time_Start": 12.72,
      "Time_End": 17.72,
      "Text": " that's power LED. I will start by uh introducing ourself. Uh my name is Ben. I'm a black and"
    },
    {
      "Time_Start": 20.92,
      "Time_End": 25.82,
      "Text": " bold member. I also do some freelancing and a postdoc at Cornell Tech. I have a PhD in"
    },
    {
      "Time_Start": 25.82,
      "Time_End": 31.560000000000002,
      "Text": " security and privacy and together with me is uh Ofek which is a master of science student at"
    },
    {
      "Time_Start": 31.560000000000002,
      "Time_End": 36.56,
      "Text": " uh the Ben Gurion University of the Negev. This work relies on uh two papers that we have"
    },
    {
      "Time_Start": 40.5,
      "Time_End": 45.5,
      "Text": " recently published which are video based cryptanalysis and optical cryptanalysis. You can"
    },
    {
      "Time_Start": 45.5,
      "Time_End": 50.5,
      "Text": " find them online if you just look for them. And moreover no prior knowledge of cryptography"
    },
    {
      "Time_Start": 50.92,
      "Time_End": 57.66,
      "Text": " is required to understand this talk. We try to keep it as simple as possible so the entire"
    },
    {
      "Time_Start": 57.66,
      "Time_End": 61.94,
      "Text": " audience will be able to enjoy it. Some of the implement some of the specifics of the"
    },
    {
      "Time_Start": 61.94,
      "Time_End": 67.64,
      "Text": " implementations uh are not uh I will not discuss them in the talk. You will be able to find"
    },
    {
      "Time_Start": 67.64,
      "Time_End": 72.64,
      "Text": " them in the papers. Now with that in mind let's have some fun. So here is a question for the"
    },
    {
      "Time_Start": 72.8,
      "Time_End": 77.8,
      "Text": " audience. Uh what do you associate with the term cryptanalysis? Now some of you probably"
    },
    {
      "Time_Start": 82.84,
      "Time_End": 87.84,
      "Text": " associate um servers and quantum computers and data centers and in general you probably tend"
    },
    {
      "Time_Start": 92.48,
      "Time_End": 97.48,
      "Text": " to associate high level of computing capabilities with the term cryptanalysis. Others"
    },
    {
      "Time_Start": 97.8,
      "Time_End": 102.80000000000001,
      "Text": " might associate specialized hardware for example oscilloscopes as the hardware that is"
    },
    {
      "Time_Start": 106.94,
      "Time_End": 111.94,
      "Text": " needed to conduct cryptanalysis. Probably supply chain attacks uh is also a term which is"
    },
    {
      "Time_Start": 114.62,
      "Time_End": 119.62,
      "Text": " associated with the term cryptanalysis. And also the name of some special agencies um might"
    },
    {
      "Time_Start": 119.64,
      "Time_End": 124.64,
      "Text": " appear as well. Um however I tend to believe that the vast majority of you do not associate"
    },
    {
      "Time_Start": 133.58,
      "Time_End": 138.58,
      "Text": " this iPhone with uh the term cryptanalysis because smartphones in general have weak"
    },
    {
      "Time_Start": 141.28,
      "Time_End": 147.4,
      "Text": " computing capabilities. They are very popular devices. They cannot be used to apply any"
    },
    {
      "Time_Start": 147.44,
      "Time_End": 153.72,
      "Text": " complex attack and the vast majority of you do not consider yourself as an entity who owns"
    },
    {
      "Time_Start": 153.72,
      "Time_End": 158.72,
      "Text": " a smartphone as uh as uh somebody will uh is interested in uh recovering cryptographic"
    },
    {
      "Time_Start": 162.76,
      "Time_End": 167.76,
      "Text": " keys. And here is our message for today. Okay? Think again. By the end of this talk you"
    },
    {
      "Time_Start": 167.76,
      "Time_End": 172.76,
      "Text": " will understand that power LEDs pose a great risk to information confidentiality and video"
    },
    {
      "Time_Start": 180.54,
      "Time_End": 185.54,
      "Text": " cameras whether they are security video cameras or video cameras of a smartphone provide"
    },
    {
      "Time_Start": 188.12,
      "Time_End": 193.12,
      "Text": " the needed infrastructure to exploit this risk. Now by the end of this talk we will discuss"
    },
    {
      "Time_Start": 193.12,
      "Time_End": 198.12,
      "Text": " on how to recover cryptographic keys uh from a device by using or by obtaining a video"
    },
    {
      "Time_Start": 204.06,
      "Time_End": 209.06,
      "Text": " footage of its power uh LED. But first let's try to answer where did the idea of using a"
    },
    {
      "Time_Start": 213.04000000000002,
      "Time_End": 218.04000000000002,
      "Text": " video camera to recover secret keys from a device's power LED come from? Now this is"
    },
    {
      "Time_Start": 219.04,
      "Time_End": 224.04,
      "Text": " actually takes us to 2014 where the visual microphone was published by a group of"
    },
    {
      "Time_Start": 227.54,
      "Time_End": 234.54,
      "Text": " researchers uh from MIT. These guys were able to demonstrate a speech recovery technique uh"
    },
    {
      "Time_Start": 234.54,
      "Time_End": 239.56,
      "Text": " using a video camera uh where they analyzed the movement of an object. It was demonstrated"
    },
    {
      "Time_Start": 242.32,
      "Time_End": 247.32,
      "Text": " on various objects but the most iconic demonstration was the one with the bag of chips uh and"
    },
    {
      "Time_Start": 247.34,
      "Time_End": 253.54,
      "Text": " they were able to analyze the movement of a bag of chips from the video footage and recover the"
    },
    {
      "Time_Start": 253.54,
      "Time_End": 260.32,
      "Text": " speech played nearby the bag of chips. Okay? And they demonstrated it with the use of two"
    },
    {
      "Time_Start": 260.32,
      "Time_End": 266.82,
      "Text": " types of uh video cameras. The first one was a professional video camera. A high uh a high"
    },
    {
      "Time_Start": 266.82,
      "Time_End": 273.1,
      "Text": " frequency video camera that ables to provide 20,000 frames per second. And the second one"
    },
    {
      "Time_Start": 273.14000000000004,
      "Time_End": 278.14000000000004,
      "Text": " was a regular video camera and they exploited the rolling shutter in order to do so. And we'll"
    },
    {
      "Time_Start": 281.12,
      "Time_End": 286.12,
      "Text": " discuss the rolling shutter later on in this talk. In 2016 I started my uh PhD. And a few years"
    },
    {
      "Time_Start": 290.06,
      "Time_End": 295.06,
      "Text": " later uh we um published uh the LEM phone attack. The LEM phone attack is a method to recover"
    },
    {
      "Time_Start": 295.9,
      "Time_End": 300.9,
      "Text": " speech by using a photodiode. Now a photodiode is the sensor that you can see on the right"
    },
    {
      "Time_Start": 303.24,
      "Time_End": 308.24,
      "Text": " side. Okay it's an optical sensor which converts light into electricity. Okay? Not for"
    },
    {
      "Time_Start": 311.78,
      "Time_End": 316.78,
      "Text": " pictures but for electricity. And then it need to be digitized with an A to D. Um we show"
    },
    {
      "Time_Start": 317.68,
      "Time_End": 322.68,
      "Text": " that attackers can analyze the movement of a desktop light bulb such as the one that you can"
    },
    {
      "Time_Start": 326.36,
      "Time_End": 331.36,
      "Text": " see in the picture. By obtaining optical measurements using the photodiode and then to"
    },
    {
      "Time_Start": 334.1,
      "Time_End": 341.0,
      "Text": " recover the speech played by the speakers that you can see uh that are placed nearby the uh"
    },
    {
      "Time_Start": 341.0,
      "Time_End": 346.6,
      "Text": " desktop. Okay and we demonstrated speech recovery from various distances up to"
    },
    {
      "Time_Start": 346.6,
      "Time_End": 351.64000000000004,
      "Text": " 35 meters away. You can see the experimental setup at the bottom. The photodiode was"
    },
    {
      "Time_Start": 351.64000000000004,
      "Time_End": 357.34000000000003,
      "Text": " mounted into a telescope. The telescope was directed to the light bulb that was placed on"
    },
    {
      "Time_Start": 357.34000000000003,
      "Time_End": 363.74,
      "Text": " top of the table on top of the desktop. And the speakers were used in order to play the"
    },
    {
      "Time_Start": 363.74,
      "Time_End": 369.12,
      "Text": " speech. Now I want to play to you the speech recoveries uh in order to convince you that you"
    },
    {
      "Time_Start": 369.12,
      "Time_End": 375.72,
      "Text": " are able to uh uh recover speech at very high quality. Uh the guys from the audio can I play"
    },
    {
      "Time_Start": 375.78000000000003,
      "Time_End": 380.78000000000003,
      "Text": " it? Okay let's try. We will make America great again. This is the original. This is from 15"
    },
    {
      "Time_Start": 395.76000000000005,
      "Time_End": 400.76000000000005,
      "Text": " meters. 25 meters away. This is the original. We will make America great again. This is the"
    },
    {
      "Time_Start": 405.84000000000003,
      "Time_End": 410.84000000000003,
      "Text": " original. Now the last one was was recovered 35 meters away from the light bulb. And bear in"
    },
    {
      "Time_Start": 413.48,
      "Time_End": 419.02000000000004,
      "Text": " mind this was recovered from light measurements obtained via the photodiode that was"
    },
    {
      "Time_Start": 419.02000000000004,
      "Time_End": 424.02000000000004,
      "Text": " directed to the rotating or to the vibrating uh light bulb. Now interestingly in one of the"
    },
    {
      "Time_Start": 427.40000000000003,
      "Time_End": 433.70000000000005,
      "Text": " experiment that we conducted we found that not only we can recover speech from by"
    },
    {
      "Time_Start": 433.71999999999997,
      "Time_End": 439.06,
      "Text": " obtaining optical measurements from the light bulb, we can also recover speech from the"
    },
    {
      "Time_Start": 439.06,
      "Time_End": 445.36,
      "Text": " power LED that we used from the power LED of the speakers that we used to project the sound"
    },
    {
      "Time_Start": 445.36,
      "Time_End": 452.3,
      "Text": " uh nearby the uh light bulb. Okay? And this is actually led us to write or to publish an"
    },
    {
      "Time_Start": 452.3,
      "Time_End": 457.53999999999996,
      "Text": " additional research that we named the Glow-O-Matac. Now the Glow-O-Matac is the exact same"
    },
    {
      "Time_Start": 457.53999999999996,
      "Time_End": 461.88,
      "Text": " technique. Okay we used we recovered speech using optical measurements obtained by an"
    },
    {
      "Time_Start": 461.9,
      "Time_End": 467.8,
      "Text": " optical sensor of the photodiode. Um but in this specific case we analyzed the speaker's"
    },
    {
      "Time_Start": 467.8,
      "Time_End": 474.08,
      "Text": " power LED intensity. Okay? When speech is played by the speakers and recovers the speech out"
    },
    {
      "Time_Start": 474.08,
      "Time_End": 479.42,
      "Text": " of it. And again you can see the exact same threat model. The photodiode is mounted to a"
    },
    {
      "Time_Start": 479.42,
      "Time_End": 483.92,
      "Text": " telescope. The telescope is directed towards the power LED. You can see it in here. It's"
    },
    {
      "Time_Start": 483.92,
      "Time_End": 488.92,
      "Text": " the uh green LED of the speakers. And we recovered again uh speech at very high quality. I"
    },
    {
      "Time_Start": 492.1,
      "Time_End": 497.24,
      "Text": " will play to you the speech recoveries again. Uh that this time we recovered from 5 meters"
    },
    {
      "Time_Start": 497.24,
      "Time_End": 502.24,
      "Text": " up to 35 meters away. We will not allow the Glow-O-Matac. We will not allow the Glow-O-Matac. We"
    },
    {
      "Time_Start": 510.92,
      "Time_End": 516.92,
      "Text": " will not allow the Glow-O-Matac. We will not allow the Glow-O-Matac. Okay. So we have a"
    },
    {
      "Time_Start": 521.96,
      "Time_End": 525.3,
      "Text": " Glow-O-Matac. As you can see the speech or the quality of the speech deteriorates with"
    },
    {
      "Time_Start": 525.3,
      "Time_End": 530.14,
      "Text": " distance but then again it was recovered uh by optical measurements obtained by the"
    },
    {
      "Time_Start": 530.14,
      "Time_End": 536.34,
      "Text": " photodiode and optical measurements are the uh optical meas- taken from the power LED of the"
    },
    {
      "Time_Start": 536.34,
      "Time_End": 541.34,
      "Text": " speakers. Now this is very surprising in a way because probably some of you wonder why can the"
    },
    {
      "Time_Start": 543.68,
      "Time_End": 548.68,
      "Text": " intensity of a speaker's power LED can even be used to recover speech? And in order to"
    },
    {
      "Time_Start": 548.96,
      "Time_End": 553.96,
      "Text": " answer it we actually conducted an experiment where we took the USB speakers and played"
    },
    {
      "Time_Start": 556.82,
      "Time_End": 561.82,
      "Text": " the frequency scan from the USB speakers between 0 to 4 kilohertz. Now we obtained 2 traces."
    },
    {
      "Time_Start": 565.34,
      "Time_End": 572.3000000000001,
      "Text": " The first trace was a power trace that we obtained uh via uh an oscilloscope that was"
    },
    {
      "Time_Start": 572.3000000000001,
      "Time_End": 578.58,
      "Text": " connected to the USB connector of the speakers. And the second trace that we obtained was an"
    },
    {
      "Time_Start": 578.58,
      "Time_End": 585.22,
      "Text": " optical trace that was obtained by directing the photodiode towards the LED of the USB"
    },
    {
      "Time_Start": 585.22,
      "Time_End": 590.22,
      "Text": " speakers. Okay. You can see them uh at the bottom. Now we made very interesting"
    },
    {
      "Time_Start": 592.72,
      "Time_End": 597.96,
      "Text": " observations but I think that the most interesting observation among them was the fact that"
    },
    {
      "Time_Start": 597.96,
      "Time_End": 602.76,
      "Text": " you can see that the power consumption correlates with the intensity of the power LED of the"
    },
    {
      "Time_Start": 602.78,
      "Time_End": 607.78,
      "Text": " speakers. Okay. Now this is very nice and very interesting but is this correlation between the"
    },
    {
      "Time_Start": 613.6,
      "Time_End": 618.04,
      "Text": " intensity of the power LED and the power consumption can also be seen in additional"
    },
    {
      "Time_Start": 618.04,
      "Time_End": 623.04,
      "Text": " speakers or is it is it just limited to this specific model that we've used? So then again we"
    },
    {
      "Time_Start": 625.68,
      "Time_End": 630.68,
      "Text": " conducted um a few additional experiments. We took various we actually took a few"
    },
    {
      "Time_Start": 632.92,
      "Time_End": 636.22,
      "Text": " experiments. We actually repeated the exact same experiment but with different uh models of"
    },
    {
      "Time_Start": 636.22,
      "Time_End": 641.22,
      "Text": " speakers. Among them there are Sony uh speakers um Google's assistant. There is also JBL"
    },
    {
      "Time_Start": 644.0,
      "Time_End": 648.8,
      "Text": " and Creative. You can see that we took the the best one among them. Okay. You can see that the"
    },
    {
      "Time_Start": 648.8,
      "Time_End": 654.2,
      "Text": " correlation appears in each and every one of them. This is by the way spectrograms that were"
    },
    {
      "Time_Start": 654.2,
      "Time_End": 660.48,
      "Text": " obtained from the optical measurements. Um and as you can see the intensity of the power"
    },
    {
      "Time_Start": 660.5,
      "Time_End": 666.34,
      "Text": " LED of various speakers correlates with the power uh consumption in the range of zero to"
    },
    {
      "Time_Start": 666.34,
      "Time_End": 671.34,
      "Text": " four kilohertz. This is what we consider the universal phenomenon. Now some of you still"
    },
    {
      "Time_Start": 675.4200000000001,
      "Time_End": 682.46,
      "Text": " probably wonder why do we see this correlation? So the fact is that in various electrical"
    },
    {
      "Time_Start": 682.46,
      "Time_End": 687.46,
      "Text": " circuits the integrated power LED is connected directly to the power line. Okay. Moreover"
    },
    {
      "Time_Start": 690.9,
      "Time_End": 697.94,
      "Text": " dedicated means intended to decouple the correlation between the power consumption and the uh"
    },
    {
      "Time_Start": 697.94,
      "Time_End": 704.98,
      "Text": " and the optical and the power correlation are either not integrated to the circuit at all or in"
    },
    {
      "Time_Start": 704.98,
      "Time_End": 709.98,
      "Text": " some cases they are integrated but they are ineffective. Okay and as a result the power"
    },
    {
      "Time_Start": 713.02,
      "Time_End": 719.36,
      "Text": " consumption of the device which is essentially the power supply to the integrated power LED"
    },
    {
      "Time_Start": 719.38,
      "Time_End": 724.38,
      "Text": " affects the intensity of the LED. And due to this fact the optical measurements reflect the"
    },
    {
      "Time_Start": 727.66,
      "Time_End": 732.66,
      "Text": " power consumption of the device. Okay. Now at this specific point in time I decided to"
    },
    {
      "Time_Start": 736.2,
      "Time_End": 741.2,
      "Text": " leverage these findings to conduct cryptanalysis and uh the idea was to apply the previously"
    },
    {
      "Time_Start": 741.9200000000001,
      "Time_End": 746.9200000000001,
      "Text": " um suggested cryptanalytic attacks that first relied on uh power traces in order to conduct"
    },
    {
      "Time_Start": 752.8000000000001,
      "Time_End": 758.2,
      "Text": " them. This time we wanted to apply them using optical measurements obtained from the power"
    },
    {
      "Time_Start": 758.2,
      "Time_End": 763.2,
      "Text": " LED. And this actually uh led us to optical cryptanalysis. It is a paper again it is about to"
    },
    {
      "Time_Start": 763.9200000000001,
      "Time_End": 768.9200000000001,
      "Text": " be presented at CCS but you can find it online. Optical cryptanalysis is a key recovery"
    },
    {
      "Time_Start": 774.6600000000001,
      "Time_End": 781.46,
      "Text": " technique to recover the key from a device using optical measurements obtained from the"
    },
    {
      "Time_Start": 781.46,
      "Time_End": 786.46,
      "Text": " power LED of the device using a photodiode. Okay. As you can see we directed the uh photodiode"
    },
    {
      "Time_Start": 787.14,
      "Time_End": 792.14,
      "Text": " towards the LED of the of uh Raspberry Pi and one of the first observations that we made is"
    },
    {
      "Time_Start": 796.08,
      "Time_End": 801.08,
      "Text": " that the intensity of the power LED of various devices it's not only uh Raspberry Pi there are"
    },
    {
      "Time_Start": 803.58,
      "Time_End": 808.58,
      "Text": " additional devices as well. Um so the intensity of the power LED correlates with the power"
    },
    {
      "Time_Start": 810.96,
      "Time_End": 815.9000000000001,
      "Text": " consumption of the device in much wider spectrum that we initially thought. We analyzed"
    },
    {
      "Time_Start": 815.9,
      "Time_End": 821.14,
      "Text": " zero to four kilohertz you can see that in this specific case it reaches up to 500"
    },
    {
      "Time_Start": 821.14,
      "Time_End": 825.98,
      "Text": " kilohertz which was the upper limit of our equipment. The potential is actually much greater"
    },
    {
      "Time_Start": 825.98,
      "Time_End": 830.98,
      "Text": " than 500 kilohertz. Interestingly we conducted an additional experiment where we took um"
    },
    {
      "Time_Start": 837.22,
      "Time_End": 842.22,
      "Text": " GNU PG run it on the Raspberry Pi and extracted and obtained optical measurements from the"
    },
    {
      "Time_Start": 846.16,
      "Time_End": 851.66,
      "Text": " uh power LED using the photodiode. As you can see in the spectrogram uh that uh appears in"
    },
    {
      "Time_Start": 851.66,
      "Time_End": 857.78,
      "Text": " the right side we can distinguish we we can distinguish between the decrypt operations and"
    },
    {
      "Time_Start": 857.78,
      "Time_End": 864.42,
      "Text": " the slip uh uh operations of the device which we consider as an idle and moreover as you can"
    },
    {
      "Time_Start": 864.42,
      "Time_End": 870.0799999999999,
      "Text": " see we can detect the beginning and the end of the cryptographic operations performed by"
    },
    {
      "Time_Start": 870.1,
      "Time_End": 875.1,
      "Text": " the CPU. Okay? This is very bad for information confidentiality. This is very bad because um it"
    },
    {
      "Time_Start": 878.88,
      "Time_End": 883.88,
      "Text": " now opens a door to conduct the previous timing cryptanalytic attacks that were demonstrated"
    },
    {
      "Time_Start": 886.46,
      "Time_End": 892.22,
      "Text": " in the past but in this specific case they can now be demonstrated using uh optical"
    },
    {
      "Time_Start": 892.22,
      "Time_End": 898.5,
      "Text": " measurements obtained from the power LED of the uh obtained by the photodiode that was"
    },
    {
      "Time_Start": 898.52,
      "Time_End": 903.52,
      "Text": " directed to the power LED of the device. And we use this understanding in order to uh"
    },
    {
      "Time_Start": 907.52,
      "Time_End": 912.54,
      "Text": " recover RSA, ECDSA and side keys again you can find this information in the paper. Now this is"
    },
    {
      "Time_Start": 917.0,
      "Time_End": 922.0,
      "Text": " very interesting okay? Uh having the ability to recover cryptographic keys using optical"
    },
    {
      "Time_Start": 922.32,
      "Time_End": 928.92,
      "Text": " measurements instead of power traces is something which is very interesting. However the"
    },
    {
      "Time_Start": 928.92,
      "Time_End": 933.92,
      "Text": " primary disadvantage of uh this entire uh method is the fact that photodiodes aren't"
    },
    {
      "Time_Start": 936.66,
      "Time_End": 941.2,
      "Text": " commonly used sensors okay? The vast majority of you do not own a photodiode or at least a"
    },
    {
      "Time_Start": 941.2,
      "Time_End": 946.2,
      "Text": " photodiode that can be used to recover this cryptographic keys. Moreover in order to um"
    },
    {
      "Time_Start": 946.84,
      "Time_End": 951.84,
      "Text": " obtain optical measurements from a photodiode, attackers must connect them to a dedicated"
    },
    {
      "Time_Start": 954.48,
      "Time_End": 959.48,
      "Text": " A to D in order to sample the electricity, the output of the photodiode. Okay? And the idea"
    },
    {
      "Time_Start": 962.62,
      "Time_End": 967.62,
      "Text": " we had back then was to go from a photodiode to a video camera. Okay? Instead of using a"
    },
    {
      "Time_Start": 967.62,
      "Time_End": 972.62,
      "Text": " photodiode we will use um a video camera to obtain the optical uh to obtain the video"
    },
    {
      "Time_Start": 978.26,
      "Time_End": 983.26,
      "Text": " footage from the power LED of the device. Now with that in mind I will let Ofek to discuss uh"
    },
    {
      "Time_Start": 985.24,
      "Time_End": 990.24,
      "Text": " the threat models and uh the rolling shutters. Okay so let's discuss the threat models. Our"
    },
    {
      "Time_Start": 991.24,
      "Time_End": 996.24,
      "Text": " objective is to perform cryptanalysis and recover secret keys from a device's power LED"
    },
    {
      "Time_Start": 1002.98,
      "Time_End": 1008.58,
      "Text": " using video cameras instead of photodiodes. Now we have two different threat models. The"
    },
    {
      "Time_Start": 1008.58,
      "Time_End": 1014.52,
      "Text": " first one is closed video acquisition. Closed video acquisition uses a smartphone's video"
    },
    {
      "Time_Start": 1014.52,
      "Time_End": 1019.52,
      "Text": " camera. It targets any type of power LED and requires physical access to the device. The"
    },
    {
      "Time_Start": 1024.28,
      "Time_End": 1030.0,
      "Text": " second threat model is over the internet video acquisition. It uses an internet connected"
    },
    {
      "Time_Start": 1030.0,
      "Time_End": 1035.0,
      "Text": " video camera. It targets only type 2 power LEDs which turn on when an operation is executed"
    },
    {
      "Time_Start": 1038.1,
      "Time_End": 1042.8799999999999,
      "Text": " and turn off when the operation is stopped being executed and are commonly used in smart"
    },
    {
      "Time_Start": 1042.88,
      "Time_End": 1048.68,
      "Text": " code readers and it can be applied remotely over the internet using a hijacked video"
    },
    {
      "Time_Start": 1048.68,
      "Time_End": 1053.68,
      "Text": " camera. So far we have used photodiodes which are analog sensors that can be sampled at few"
    },
    {
      "Time_Start": 1056.5200000000002,
      "Time_End": 1061.5200000000002,
      "Text": " gigahertz. Video cameras can record 60 or 120 frames per second. A sampling rate of 60 frames"
    },
    {
      "Time_Start": 1065.9,
      "Time_End": 1070.9,
      "Text": " per second is not sufficient to perform cryptanalysis. Or is it? The third threat model is"
    },
    {
      "Time_Start": 1073.3400000000001,
      "Time_End": 1077.88,
      "Text": " rolling shutter. We used to think that a picture is the result of one atomic snapshot taken by"
    },
    {
      "Time_Start": 1077.88,
      "Time_End": 1084.88,
      "Text": " the video camera. However 99 percent of the video cameras use a rolling shutter to record the"
    },
    {
      "Time_Start": 1084.88,
      "Time_End": 1091.22,
      "Text": " video. A single picture is the result of multiple snapshots taken at different times by the"
    },
    {
      "Time_Start": 1091.22,
      "Time_End": 1096.96,
      "Text": " video camera. A video camera uses a rolling shutter to scan an object vertically or"
    },
    {
      "Time_Start": 1096.98,
      "Time_End": 1103.3600000000001,
      "Text": " horizontally and combines the scanned pieces into a single frame. Only a few rows are"
    },
    {
      "Time_Start": 1103.3600000000001,
      "Time_End": 1108.82,
      "Text": " captured atomically each time and the entire picture consists of multiple snapshots of an"
    },
    {
      "Time_Start": 1108.82,
      "Time_End": 1113.8400000000001,
      "Text": " object. Here we can see an example of a picture captured using a rolling shutter. On the left"
    },
    {
      "Time_Start": 1117.94,
      "Time_End": 1124.44,
      "Text": " there is a moving object and on the right there is a captured image. As you can see because"
    },
    {
      "Time_Start": 1124.46,
      "Time_End": 1131.24,
      "Text": " each a couple of rows are captured uh at different times, distortions appears in pictures of"
    },
    {
      "Time_Start": 1131.24,
      "Time_End": 1137.64,
      "Text": " fast moving objects. Such distortions should not appear if the picture was taken using one"
    },
    {
      "Time_Start": 1137.64,
      "Time_End": 1142.64,
      "Text": " atomic snapshot of the object. Now let's describe an experiment we conducted to visualize the"
    },
    {
      "Time_Start": 1146.98,
      "Time_End": 1153.02,
      "Text": " effect of the rolling shutter. First we programmed an Arduino UNO to turn its power lead on"
    },
    {
      "Time_Start": 1153.04,
      "Time_End": 1158.04,
      "Text": " and off every 250 microseconds. And here's what we can see. Now we cannot see the LED turns its"
    },
    {
      "Time_Start": 1168.58,
      "Time_End": 1173.58,
      "Text": " power on and off at 4 kilohertz because the sampling rate is only 60 frames per second. Second"
    },
    {
      "Time_Start": 1174.58,
      "Time_End": 1179.58,
      "Text": " an extra lens was used to direct the camera of a Samsung Galaxy S22 Ultra to the Arduino's"
    },
    {
      "Time_Start": 1183.96,
      "Time_End": 1188.96,
      "Text": " power LED so that the video of the LED fills the entire frame. And here's what you can see."
    },
    {
      "Time_Start": 1189.52,
      "Time_End": 1194.52,
      "Text": " Now because the LED turns its power on and off a few times in each frame, there are red rows"
    },
    {
      "Time_Start": 1206.4,
      "Time_End": 1211.58,
      "Text": " that were captured when the LED was turned on and black rows that were captured when the LED"
    },
    {
      "Time_Start": 1211.58,
      "Time_End": 1216.58,
      "Text": " was turned off. And this is why we can see those black and red stripes across each frame."
    },
    {
      "Time_Start": 1219.08,
      "Time_End": 1224.08,
      "Text": " So by filling the frame with the video of the LED we exploit the video camera's rolling shutter to"
    },
    {
      "Time_Start": 1226.3600000000001,
      "Time_End": 1233.3600000000001,
      "Text": " increase the number of measurements obtained at different times. This allows us to detect the 4"
    },
    {
      "Time_Start": 1233.3600000000001,
      "Time_End": 1238.3600000000001,
      "Text": " kilohertz flicker. Theoretically by exploiting a video camera's rolling shutter we can increase"
    },
    {
      "Time_Start": 1241.1000000000001,
      "Time_End": 1247.44,
      "Text": " the sampling rate by 3 orders of magnitude. From the FPS rate 60 measurements per second to the"
    },
    {
      "Time_Start": 1247.46,
      "Time_End": 1252.46,
      "Text": " rolling shutter rate 60K. In reality there is a delay, a transition time, between"
    },
    {
      "Time_Start": 1258.3600000000001,
      "Time_End": 1264.4,
      "Text": " consecutive frames. The transition time between frames is a period of time during which no"
    },
    {
      "Time_Start": 1264.4,
      "Time_End": 1270.28,
      "Text": " object is captured by the video camera. You can see it here in the figure that between two"
    },
    {
      "Time_Start": 1270.28,
      "Time_End": 1275.28,
      "Text": " consecutive frames there is a transition time. This should be taken account of by the"
    },
    {
      "Time_Start": 1278.1200000000001,
      "Time_End": 1283.1200000000001,
      "Text": " video footage of the power LED. Now I will let Ben to discuss the ACDSA key recovery."
    },
    {
      "Time_Start": 1296.64,
      "Time_End": 1301.64,
      "Text": " Okay so um before we'll discuss the ACDSA key recovery in order to discuss the ACDSA key"
    },
    {
      "Time_Start": 1301.8600000000001,
      "Time_End": 1306.8600000000001,
      "Text": " recovery we need to briefly uh discuss the Minerva attack. The Minerva attack introduced or"
    },
    {
      "Time_Start": 1310.3600000000001,
      "Time_End": 1317.26,
      "Text": " published 3 years ago and one of the most uh interesting revelations that uh uh researchers"
    },
    {
      "Time_Start": 1317.26,
      "Time_End": 1322.26,
      "Text": " uh did was the fact that they found that various cryptographic libraries uh uh apply some"
    },
    {
      "Time_Start": 1323.26,
      "Time_End": 1328.26,
      "Text": " runtime optimizations in the in the code. Okay? Um and uh I I refer to the code of uh the"
    },
    {
      "Time_Start": 1334.24,
      "Time_End": 1340.64,
      "Text": " elliptic curve 256 R1, the implementation of the ACDSA. And they found that the number of"
    },
    {
      "Time_Start": 1340.64,
      "Time_End": 1345.18,
      "Text": " iterations of the main loop is actually determined by the number of leading zeros in the"
    },
    {
      "Time_Start": 1345.18,
      "Time_End": 1352.06,
      "Text": " nonce. Okay? And as a result it created a time dependency between the number of leading"
    },
    {
      "Time_Start": 1352.06,
      "Time_End": 1357.22,
      "Text": " zeros in the nonce and the execution time of the main loop and essentially the ACDSA"
    },
    {
      "Time_Start": 1357.22,
      "Time_End": 1362.24,
      "Text": " signing time. And the Minerva attack introduced a technique to recover the ACDSA uh um key"
    },
    {
      "Time_Start": 1369.28,
      "Time_End": 1374.28,
      "Text": " by analyzing uh the uh a set of uh by analyzing the um uh ACDSA signing uh measurements"
    },
    {
      "Time_Start": 1374.28,
      "Time_End": 1379.28,
      "Text": " of uh a set of uh ACDSA signatures. You need to have about 4,000 signatures in order to"
    },
    {
      "Time_Start": 1383.42,
      "Time_End": 1388.92,
      "Text": " recover and their associated uh ACDSA signing time in order to recover the complete key."
    },
    {
      "Time_Start": 1388.92,
      "Time_End": 1393.92,
      "Text": " Okay? Now the original Minerva attack required attackers to obtain uh measurements from the"
    },
    {
      "Time_Start": 1396.1,
      "Time_End": 1401.1,
      "Text": " CPU. The timing measurements obtained by querying the CPU. And essentially it required the"
    },
    {
      "Time_Start": 1401.1200000000001,
      "Time_End": 1407.8600000000001,
      "Text": " attacker, the attackers to uh compromise the host machine. The authors were unable to"
    },
    {
      "Time_Start": 1407.8600000000001,
      "Time_End": 1412.44,
      "Text": " demonstrate the attack remotely over the internet due to the noise added by the network"
    },
    {
      "Time_Start": 1412.44,
      "Time_End": 1419.3000000000002,
      "Text": " latency. Okay? The Minerva attack is very sensitive to errors in the timing measurements."
    },
    {
      "Time_Start": 1419.3000000000002,
      "Time_End": 1424.3200000000002,
      "Text": " You are about to see it now uh demonstrated over the internet. Um without getting into too"
    },
    {
      "Time_Start": 1425.32,
      "Time_End": 1431.84,
      "Text": " much specifics and details regarding the Minerva attack, you can think about it as a black"
    },
    {
      "Time_Start": 1431.84,
      "Time_End": 1438.26,
      "Text": " box. Okay? The black box receives a set of signatures and their associated uh signing time"
    },
    {
      "Time_Start": 1438.26,
      "Time_End": 1443.26,
      "Text": " and returns the ACDSA key out of them. So essentially what we need to answer is how can the"
    },
    {
      "Time_Start": 1447.1599999999999,
      "Time_End": 1453.54,
      "Text": " ACDSA signing time of a signature be estimated from video footage. If we will be able to"
    },
    {
      "Time_Start": 1453.56,
      "Time_End": 1458.56,
      "Text": " answer it, we'll be able to recover the complete ACDSA key using video footage. Now this"
    },
    {
      "Time_Start": 1461.2,
      "Time_End": 1466.2,
      "Text": " was the experimental setup. Uh in our uh in our uh in our um uh experiment. We used it, we"
    },
    {
      "Time_Start": 1470.74,
      "Time_End": 1475.74,
      "Text": " placed an internet connected video camera and directed it to uh the uh the power led of the"
    },
    {
      "Time_Start": 1476.08,
      "Time_End": 1481.08,
      "Text": " smart card reader. Inside the smart card reader there was uh a smart card with an ACDSA"
    },
    {
      "Time_Start": 1484.32,
      "Time_End": 1491.32,
      "Text": " key. And we wanted to recover the ACDSA the ACDSA key from the smart card using video"
    },
    {
      "Time_Start": 1491.32,
      "Time_End": 1496.06,
      "Text": " footage of the power LED of the smart card reader by using this internet connected video"
    },
    {
      "Time_Start": 1496.06,
      "Time_End": 1501.06,
      "Text": " camera that was placed 16 meters away from the uh from the uh from this desktop. Uh"
    },
    {
      "Time_Start": 1505.74,
      "Time_End": 1510.5,
      "Text": " okay and this is the experimental setup. I want to show to you the video. Um you can see on"
    },
    {
      "Time_Start": 1510.5,
      "Time_End": 1517.58,
      "Text": " the left side this was the the card reader that we uh the smart card reader that we used. We"
    },
    {
      "Time_Start": 1517.58,
      "Time_End": 1522.58,
      "Text": " actually focused on the right uh power LED of it of uh it. And let me show it to you now. Now"
    },
    {
      "Time_Start": 1526.52,
      "Time_End": 1533.1,
      "Text": " you can see that we zoom into the uh power LED of the um smart card. And interestingly the"
    },
    {
      "Time_Start": 1533.1000000000001,
      "Time_End": 1538.2,
      "Text": " smart card actually provides you with indication regarding whether the the smart card reader"
    },
    {
      "Time_Start": 1538.2,
      "Time_End": 1542.44,
      "Text": " actually provides you with indication regarding the smart card. Whether an operation"
    },
    {
      "Time_Start": 1542.44,
      "Time_End": 1547.8000000000002,
      "Text": " actually uh taking place or not. And this is done by uh by changing the color of the LED"
    },
    {
      "Time_Start": 1547.8000000000002,
      "Time_End": 1553.9800000000002,
      "Text": " between blue or basically turn it off. Okay anytime it's blue the uh smart card is in"
    },
    {
      "Time_Start": 1553.9800000000002,
      "Time_End": 1558.9800000000002,
      "Text": " idle. Anytime it's off it the smart card is being used to sign. So um as you can see from the"
    },
    {
      "Time_Start": 1559.84,
      "Time_End": 1566.98,
      "Text": " video on the right side there are differences between black and blue colors. Okay which"
    },
    {
      "Time_Start": 1566.98,
      "Time_End": 1571.98,
      "Text": " indicate whether the smart card is currently being used to sign on on stuff or not. So as you"
    },
    {
      "Time_Start": 1576.72,
      "Time_End": 1582.66,
      "Text": " can see this actually uh the the picture on the left side is actually the result of"
    },
    {
      "Time_Start": 1582.66,
      "Time_End": 1588.94,
      "Text": " averaging each row in a frame to a single value and arrange them in a time series. Okay and"
    },
    {
      "Time_Start": 1588.96,
      "Time_End": 1594.8400000000001,
      "Text": " we did it for the red green and blue uh channels. You can see that we can distinguish between"
    },
    {
      "Time_Start": 1594.8400000000001,
      "Time_End": 1599.9,
      "Text": " the sign operations where the power LED is off and the idle operations where the color of the"
    },
    {
      "Time_Start": 1599.9,
      "Time_End": 1606.48,
      "Text": " power LED is blue based on the blue channel. Now now we need to answer how how can we"
    },
    {
      "Time_Start": 1606.48,
      "Time_End": 1611.48,
      "Text": " calculate the signing time out of it. Now in order to calculate the ACDSA time of a"
    },
    {
      "Time_Start": 1611.84,
      "Time_End": 1616.84,
      "Text": " signature, we extract the series frames associated with each signature from the video. Okay you"
    },
    {
      "Time_Start": 1621.68,
      "Time_End": 1626.68,
      "Text": " can see them you can see uh examples of them uh on the bottom of the slide. Now we kept"
    },
    {
      "Time_Start": 1630.18,
      "Time_End": 1635.6200000000001,
      "Text": " series that contain the indication of the switch between the beginning and the end of the"
    },
    {
      "Time_Start": 1635.6200000000001,
      "Time_End": 1640.9,
      "Text": " signing. Meaning that we kept series that the beginning and the end of the uh of the"
    },
    {
      "Time_Start": 1641.7800000000002,
      "Time_End": 1647.26,
      "Text": " signing were kept in the frames. Where you can see uh in this specific case, this is the"
    },
    {
      "Time_Start": 1647.26,
      "Time_End": 1653.5,
      "Text": " series that you can see on top. Okay? Each series that missed or lacks one of these"
    },
    {
      "Time_Start": 1653.5,
      "Time_End": 1658.5,
      "Text": " indications regarding the switch between the beginning of the signature and the end of the"
    },
    {
      "Time_Start": 1658.5,
      "Time_End": 1663.5,
      "Text": " signature, we filtered it off. Okay? You can see that uh how the in uh the frames uh that"
    },
    {
      "Time_Start": 1663.86,
      "Time_End": 1668.86,
      "Text": " appear in the first series, the color is changed inside the frame between blue and black and"
    },
    {
      "Time_Start": 1673.32,
      "Time_End": 1679.3,
      "Text": " vice versa. Okay this is what we considered as the indication that the operation started and"
    },
    {
      "Time_Start": 1679.3,
      "Time_End": 1684.3,
      "Text": " ended. Okay and these are only the type of series that we kept. Now um first of all we"
    },
    {
      "Time_Start": 1685.3,
      "Time_End": 1690.3,
      "Text": " calculated T1 which T1 in our case is the execution time of all of the uh the full black"
    },
    {
      "Time_Start": 1695.3799999999999,
      "Time_End": 1700.52,
      "Text": " frames that you can see in in here. This is actually done just by counting the number of uh"
    },
    {
      "Time_Start": 1700.52,
      "Time_End": 1705.52,
      "Text": " full uh black frames and multiplying them by this constant. This gives you T1. T2 is the"
    },
    {
      "Time_Start": 1708.86,
      "Time_End": 1714.26,
      "Text": " execution time of the first frame. Okay? In which the color changed between as you can"
    },
    {
      "Time_Start": 1714.26,
      "Time_End": 1719.26,
      "Text": " see in here between blue to uh black. So uh we calculated it as follows. We counted the"
    },
    {
      "Time_Start": 1721.96,
      "Time_End": 1727.96,
      "Text": " number of uh rows that are associated with the sign which are you can see it in here. They"
    },
    {
      "Time_Start": 1727.96,
      "Time_End": 1734.84,
      "Text": " are in black. And divided them by the total number of rows in the frame. Okay this is"
    },
    {
      "Time_Start": 1734.84,
      "Time_End": 1741.18,
      "Text": " actually gives us the relative time in the frame. We multiply it by the scanning time and"
    },
    {
      "Time_Start": 1741.2,
      "Time_End": 1746.68,
      "Text": " added the transition time. Now so far Ofek discussed about the scanning time and the"
    },
    {
      "Time_Start": 1746.68,
      "Time_End": 1751.28,
      "Text": " transition time but he did not mention how you can determine the scanning time and the"
    },
    {
      "Time_Start": 1751.28,
      "Time_End": 1757.1200000000001,
      "Text": " transition time. So let's discuss how we can find S which stands for the scanning time and T"
    },
    {
      "Time_Start": 1757.1200000000001,
      "Time_End": 1763.6000000000001,
      "Text": " which stands for the transition time. So I remind you the uh experiment that we did at the"
    },
    {
      "Time_Start": 1763.6000000000001,
      "Time_End": 1770.3400000000001,
      "Text": " beginning with uh flickering LED of the Arduino. You can just take one of the you can repeat"
    },
    {
      "Time_Start": 1770.3600000000001,
      "Time_End": 1775.3600000000001,
      "Text": " the exact same experiment with the flicker. Take only one of the um frames from the video."
    },
    {
      "Time_Start": 1778.4,
      "Time_End": 1783.4,
      "Text": " Count the number of changes between black and red that you have in the frame and multiply it"
    },
    {
      "Time_Start": 1786.44,
      "Time_End": 1791.2200000000003,
      "Text": " by the time that the flicker is on and off. In this specific case the on and off uh periods"
    },
    {
      "Time_Start": 1791.2200000000003,
      "Time_End": 1796.2200000000003,
      "Text": " were equal. Okay? And by doing so this will gives you the scanning time of the video uh the"
    },
    {
      "Time_Start": 1797.08,
      "Time_End": 1802.08,
      "Text": " video camera. And the beauty of it is then when you get the scanning time out of this"
    },
    {
      "Time_Start": 1804.72,
      "Time_End": 1809.72,
      "Text": " experiment you get the transition time for free by deducting the scanning time out of this"
    },
    {
      "Time_Start": 1809.72,
      "Time_End": 1814.72,
      "Text": " constant uh out of this constant. Now with that in mind and returning to T2 you now have S"
    },
    {
      "Time_Start": 1816.8600000000001,
      "Time_End": 1821.8600000000001,
      "Text": " and T and everything needed to calculate T2. Now T3 is actually calculated at the exact same"
    },
    {
      "Time_Start": 1822.14,
      "Time_End": 1827.14,
      "Text": " way. Okay? Um but in this specific uh case we do not um add the transition time because"
    },
    {
      "Time_Start": 1831.72,
      "Time_End": 1836.72,
      "Text": " the the um ECDSA sign stopped or ended in the middle of the frame so the transition time"
    },
    {
      "Time_Start": 1839.22,
      "Time_End": 1846.0600000000002,
      "Text": " happened after the frame so there is no need to add it to this specific uh to T3. And the"
    },
    {
      "Time_Start": 1846.0600000000002,
      "Time_End": 1851.0600000000002,
      "Text": " sign time is actually the sum of T1, T2 and T3. Now the beauty of this is that you can"
    },
    {
      "Time_Start": 1852.5400000000002,
      "Time_End": 1859.2400000000002,
      "Text": " do it to enough signatures for about 4,000 signatures. You can see that this is the result"
    },
    {
      "Time_Start": 1859.2400000000002,
      "Time_End": 1864.2400000000002,
      "Text": " that we got. We were able to recover the ECDSA key out of it. Um using the Minerva uh"
    },
    {
      "Time_Start": 1867.0800000000002,
      "Time_End": 1871.8600000000001,
      "Text": " script that uh that the others were published. Again using an internet connected video"
    },
    {
      "Time_Start": 1871.8600000000001,
      "Time_End": 1876.8600000000001,
      "Text": " camera that was directed to a power lead of a smart card reader. Thank you."
    },
    {
      "Time_Start": 1882.1000000000001,
      "Time_End": 1887.1000000000001,
      "Text": " Okay. Now moreover there are many additional smart card readers available to purchase on"
    },
    {
      "Time_Start": 1894.18,
      "Time_End": 1900.14,
      "Text": " Amazon that are vulnerable to this attack. And the distance between them and the video"
    },
    {
      "Time_Start": 1900.14,
      "Time_End": 1906.7600000000002,
      "Text": " camera might vary based on the intensity of their own power LED but we were able to"
    },
    {
      "Time_Start": 1906.76,
      "Time_End": 1911.76,
      "Text": " recover the same ECDSA key from the smart card inserting it to 5 additional smart card"
    },
    {
      "Time_Start": 1914.1,
      "Time_End": 1919.1,
      "Text": " readers. Again all of them are available online. Okay now let's discuss um recovering a"
    },
    {
      "Time_Start": 1922.74,
      "Time_End": 1927.94,
      "Text": " side key from uh from a device. And again recovering a side key from a device or in order to"
    },
    {
      "Time_Start": 1927.94,
      "Time_End": 1932.62,
      "Text": " understand how to recover a side key from a device we need to briefly discuss the"
    },
    {
      "Time_Start": 1932.72,
      "Time_End": 1937.98,
      "Text": " Herzblied attack. The Herzblied attack introduced uh a year ago. They also presented their"
    },
    {
      "Time_Start": 1937.98,
      "Time_End": 1943.0000000000002,
      "Text": " talk at uh Black Hat. And they were able to uh suggest or introduce a new timing attack to"
    },
    {
      "Time_Start": 1945.92,
      "Time_End": 1950.94,
      "Text": " recover the complete side key from a server. The Herzblied attack unlike the Minerva attack"
    },
    {
      "Time_Start": 1953.7600000000002,
      "Time_End": 1958.68,
      "Text": " that I showed you before is not the result of the implementation of the code. Okay. It's"
    },
    {
      "Time_Start": 1958.68,
      "Time_End": 1964.04,
      "Text": " the result of the execution of the device. The code should be resilient to timing attack"
    },
    {
      "Time_Start": 1964.04,
      "Time_End": 1969.1200000000001,
      "Text": " but the execution actually reveals something in terms of the time that it was uh uh"
    },
    {
      "Time_Start": 1969.1200000000001,
      "Time_End": 1975.8600000000001,
      "Text": " executed regarding the data being executed by the device. And this is happening due to the"
    },
    {
      "Time_Start": 1975.8600000000001,
      "Time_End": 1981.96,
      "Text": " dynamic voltage frequency stabilizers. Maybe you are more familiar with the DVFS. Okay."
    },
    {
      "Time_Start": 1981.96,
      "Time_End": 1988.1000000000001,
      "Text": " Which yields different execution times based on the data that was recovered that uh is"
    },
    {
      "Time_Start": 1988.1000000000001,
      "Time_End": 1994.7,
      "Text": " being processed by uh by the device. And uh researchers were able to show that for each"
    },
    {
      "Time_Start": 1994.7,
      "Time_End": 1999.7,
      "Text": " index of the bit they can craft a dedicate a dedicated cryptogram that relies on the um"
    },
    {
      "Time_Start": 2002.0400000000002,
      "Time_End": 2005.9800000000002,
      "Text": " indexes that they were already recovered. Okay it's an adaptive attack for those of you"
    },
    {
      "Time_Start": 2005.9800000000002,
      "Time_End": 2010.9800000000002,
      "Text": " familiar with cryptography. And determine whether the value of the bit under attack uh is"
    },
    {
      "Time_Start": 2011.54,
      "Time_End": 2016.54,
      "Text": " similar to the um to the to the value that was recovered in the previous index or changed."
    },
    {
      "Time_Start": 2022.18,
      "Time_End": 2028.02,
      "Text": " Okay and this is all done based on the timing threshold. Now the original attack was"
    },
    {
      "Time_Start": 2028.02,
      "Time_End": 2033.66,
      "Text": " implemented using timing measurements obtained by querying the API of a server over the"
    },
    {
      "Time_Start": 2033.66,
      "Time_End": 2038.66,
      "Text": " internet. Uh they deducted the request time from the response time. And again due to the"
    },
    {
      "Time_Start": 2039.66,
      "Time_End": 2046.46,
      "Text": " added uh noise that was added by the uh network latency it took a few days to recover the"
    },
    {
      "Time_Start": 2046.46,
      "Time_End": 2051.46,
      "Text": " keys. Now this was our attack. Okay. And this is the experimental setup of our attack. We"
    },
    {
      "Time_Start": 2056.7000000000003,
      "Time_End": 2061.58,
      "Text": " tried to recover the secret key, the side key from the Samsung Galaxy S8. The Samsung Galaxy"
    },
    {
      "Time_Start": 2061.58,
      "Time_End": 2065.7400000000002,
      "Text": " S8 is the smartphone that you can see on the right side. It's not the smartphone that you can"
    },
    {
      "Time_Start": 2065.76,
      "Time_End": 2070.76,
      "Text": " see on top. The Samsung Galaxy S8 was the device that holded the side key. Okay. Now um"
    },
    {
      "Time_Start": 2076.9,
      "Time_End": 2082.2400000000002,
      "Text": " interestingly in this specific case we tried to recover the secret key from a device by"
    },
    {
      "Time_Start": 2082.2400000000002,
      "Time_End": 2087.2400000000002,
      "Text": " obtaining video footage not from the Samsung Galaxy but from the speakers. Okay the power"
    },
    {
      "Time_Start": 2089.5400000000004,
      "Time_End": 2095.28,
      "Text": " lid of the speakers that were connected to the same USB hub that was used to charge the"
    },
    {
      "Time_Start": 2095.32,
      "Time_End": 2100.3,
      "Text": " Samsung Galaxy. And in order in order to make it completely outrageous we did it with an"
    },
    {
      "Time_Start": 2100.3,
      "Time_End": 2107.3,
      "Text": " iPhone. Tried to recover the Samsung the key from the Samsung Galaxy S8. On the right side"
    },
    {
      "Time_Start": 2107.3,
      "Time_End": 2112.3,
      "Text": " you can see the video footage of uh the power lid of the speakers. Okay you can see that this"
    },
    {
      "Time_Start": 2114.5800000000004,
      "Time_End": 2121.28,
      "Text": " uh green. This is actually being taken from the speakers as you can see uh on the left side."
    },
    {
      "Time_Start": 2121.28,
      "Time_End": 2126.76,
      "Text": " Between the speakers and the smartphone you can see a lens which was used to fill the entire"
    },
    {
      "Time_Start": 2126.76,
      "Time_End": 2131.76,
      "Text": " uh frame with the view of the LED. I want to show to you the video. You cannot see anything"
    },
    {
      "Time_Start": 2135.1600000000003,
      "Time_End": 2140.1600000000003,
      "Text": " right? Seems like completely innocent video with green color. Moreover I will argue that you"
    },
    {
      "Time_Start": 2140.7999999999997,
      "Time_End": 2145.7999999999997,
      "Text": " cannot see even the difference between the idle and the cycle operations being performed by"
    },
    {
      "Time_Start": 2151.3799999999997,
      "Time_End": 2156.3799999999997,
      "Text": " the Samsung Galaxy S8. Okay. They cannot be detected by the naked eye. But there is"
    },
    {
      "Time_Start": 2160.52,
      "Time_End": 2167.06,
      "Text": " something very interesting. Okay. We executed 8 consecutive iterations of cycle operations"
    },
    {
      "Time_Start": 2167.06,
      "Time_End": 2172.06,
      "Text": " where each iteration consisted of 100 uh and uh 1100 of cycle operations on the Samsung"
    },
    {
      "Time_Start": 2174.7999999999997,
      "Time_End": 2179.7999999999997,
      "Text": " Galaxy S8 while obtaining video footage from the power LED of the connected speakers. You"
    },
    {
      "Time_Start": 2182.7999999999997,
      "Time_End": 2188.98,
      "Text": " can see that by averaging each frame into a single value and arranging them in a time series"
    },
    {
      "Time_Start": 2188.98,
      "Time_End": 2195.06,
      "Text": " and then again zooming into the green channel you can see that we can detect the beginning"
    },
    {
      "Time_Start": 2195.06,
      "Time_End": 2201.2,
      "Text": " and the end of the iterate of the 8 iterations by analyzing the green channel and again using"
    },
    {
      "Time_Start": 2201.2,
      "Time_End": 2206.2,
      "Text": " this uh by arranging them by arranging the values in a time series. Now this is actually"
    },
    {
      "Time_Start": 2209.7799999999997,
      "Time_End": 2216.38,
      "Text": " gives you uh the ability to calculate the iteration time based on the number of values between"
    },
    {
      "Time_Start": 2216.38,
      "Time_End": 2221.38,
      "Text": " each 2 peaks that you can see in here. Okay? Um but then again another question that we need"
    },
    {
      "Time_Start": 2221.94,
      "Time_End": 2226.94,
      "Text": " to answer is how accurate is this calculation? So on the left side you can see the distribution"
    },
    {
      "Time_Start": 2233.2200000000003,
      "Time_End": 2239.32,
      "Text": " of the execution time based only on the first iteration. Okay? We apply the attack on by using"
    },
    {
      "Time_Start": 2239.32,
      "Time_End": 2244.32,
      "Text": " only the first iteration and as you can see it's very noisy. The 2 possibilities of the the 2"
    },
    {
      "Time_Start": 2244.88,
      "Time_End": 2249.88,
      "Text": " cases that uh that whether the bit was uh have a similar value or was it changed in comparison to"
    },
    {
      "Time_Start": 2255.96,
      "Time_End": 2260.96,
      "Text": " the previous uh index, you cannot set a threshold that will give you an accurate uh you will be"
    },
    {
      "Time_Start": 2264.86,
      "Time_End": 2269.86,
      "Text": " able to use it in order to accurately distinguish between the 2 specific cases. However when"
    },
    {
      "Time_Start": 2270.2200000000003,
      "Time_End": 2275.2200000000003,
      "Text": " you use um instead the distribution of the execution time based on the minimum execution"
    },
    {
      "Time_Start": 2279.86,
      "Time_End": 2285.46,
      "Text": " time among these 8 iterations, what you're seeing in the middle, you can see that you can"
    },
    {
      "Time_Start": 2285.46,
      "Time_End": 2291.28,
      "Text": " actually set a threshold in the middle that will uh that will allow you to distinguish between"
    },
    {
      "Time_Start": 2291.28,
      "Time_End": 2296.28,
      "Text": " the 2 possible uh bits of the key uh index with very high accuracy. Okay? 99% accuracy."
    },
    {
      "Time_Start": 2300.38,
      "Time_End": 2305.38,
      "Text": " Now 99% accuracy is good. It's not excellent. Okay? It's not error prone. And as a result, we"
    },
    {
      "Time_Start": 2308.86,
      "Time_End": 2315.06,
      "Text": " will we will have to uh to use an error detection and correction mechanism throughout the key"
    },
    {
      "Time_Start": 2315.06,
      "Time_End": 2320.06,
      "Text": " reco- throughout the uh key recovery process in order to uh recover the complete key. And as"
    },
    {
      "Time_Start": 2322.76,
      "Time_End": 2327.5,
      "Text": " you can see this is actually what we did. We recovered the complete key, the complete uh uh"
    },
    {
      "Time_Start": 2327.54,
      "Time_End": 2333.88,
      "Text": " psyche from the device using a video footage obtained from the connected speakers. Um then"
    },
    {
      "Time_Start": 2333.88,
      "Time_End": 2339.32,
      "Text": " again we also integrated an error detecting and correcting mechanism that was suggested by"
    },
    {
      "Time_Start": 2339.32,
      "Time_End": 2344.32,
      "Text": " the guys that presented the Hertzbleed attack. Okay so let's briefly discuss the limitations"
    },
    {
      "Time_Start": 2347.1,
      "Time_End": 2352.84,
      "Text": " of uh video based script analysis. So first of all the first limitation is the fact that the"
    },
    {
      "Time_Start": 2352.84,
      "Time_End": 2359.1200000000003,
      "Text": " attack mostly targets weak IOT devices. I would say up to a level of a smartphone. I would"
    },
    {
      "Time_Start": 2359.1200000000003,
      "Time_End": 2363.96,
      "Text": " be very surprised if somebody will take the exact same video cameras that we used and will"
    },
    {
      "Time_Start": 2363.96,
      "Time_End": 2368.96,
      "Text": " show me that he was able to recover secret keys from uh power led of servers or power led of"
    },
    {
      "Time_Start": 2368.96,
      "Time_End": 2373.96,
      "Text": " laptops. Now moreover, we discussed about it uh earlier, due to the fact that there is a"
    },
    {
      "Time_Start": 2374.76,
      "Time_End": 2379.76,
      "Text": " transition time where uh between each two frames where the object or the power led isn't being"
    },
    {
      "Time_Start": 2383.34,
      "Time_End": 2390.34,
      "Text": " captured in any frame, the sampling uh the uh the distribution of the sampling is semi"
    },
    {
      "Time_Start": 2390.34,
      "Time_End": 2395.2400000000002,
      "Text": " uniform. It's not exactly uniform which is a exact which is another issue that we need to"
    },
    {
      "Time_Start": 2395.2400000000002,
      "Time_End": 2401.62,
      "Text": " resolve when recovering the secret keys. Now let's discuss the takeaways. I think that now"
    },
    {
      "Time_Start": 2401.62,
      "Time_End": 2406.7799999999997,
      "Text": " you are convinced that power leds are much more informative than you initially uh"
    },
    {
      "Time_Start": 2406.7799999999997,
      "Time_End": 2411.7999999999997,
      "Text": " imagined. Um in some cases attackers can use the information modulated over the power led to"
    },
    {
      "Time_Start": 2415.56,
      "Time_End": 2420.14,
      "Text": " recover speech. In other cases it can be used to recover cryptographic keys as we showed in"
    },
    {
      "Time_Start": 2420.14,
      "Time_End": 2425.14,
      "Text": " this uh in this talk. Now moreover, the potential of the attack is actually much greater"
    },
    {
      "Time_Start": 2425.9,
      "Time_End": 2430.9,
      "Text": " than uh than uh we showed you in this uh work. Okay? We focused on what we consider as"
    },
    {
      "Time_Start": 2434.3399999999997,
      "Time_End": 2439.52,
      "Text": " ubiquitous cameras. Okay? Not professional cameras. We use security cameras and"
    },
    {
      "Time_Start": 2439.52,
      "Time_End": 2445.18,
      "Text": " smartphones, video cameras in order to recover the secret keys. Attackers in reality can use"
    },
    {
      "Time_Start": 2445.18,
      "Time_End": 2450.18,
      "Text": " professional video cameras that will provide a high rolling shutter rate, a higher beat"
    },
    {
      "Time_Start": 2450.64,
      "Time_End": 2455.64,
      "Text": " depth and enhance zoom capabilities and by doing so they probably will be able to recover uh"
    },
    {
      "Time_Start": 2460.48,
      "Time_End": 2465.48,
      "Text": " secret keys from a wider range of devices from probably even um a greater distance. And this"
    },
    {
      "Time_Start": 2471.9199999999996,
      "Time_End": 2479.0,
      "Text": " is I think the most interesting uh insight or takeaway from this talk. We expect that more"
    },
    {
      "Time_Start": 2479.02,
      "Time_End": 2484.46,
      "Text": " and more devices will be exposed to video based cryptanalysis every year. Okay? This is"
    },
    {
      "Time_Start": 2484.46,
      "Time_End": 2490.4,
      "Text": " actually the result of two interesting facts. First of all uh video cameras specifications"
    },
    {
      "Time_Start": 2490.4,
      "Time_End": 2495.7,
      "Text": " are continuously improving each and every year uh following Moore's law. You can see how"
    },
    {
      "Time_Start": 2495.7,
      "Time_End": 2500.7,
      "Text": " the sensitivity of this picture has improved significantly throughout the years. Moreover,"
    },
    {
      "Time_Start": 2501.6600000000003,
      "Time_End": 2506.6600000000003,
      "Text": " the number of functional IOT devices with weak CPU power and I'm referring to sensors and"
    },
    {
      "Time_Start": 2511.6000000000004,
      "Time_End": 2516.6000000000004,
      "Text": " uh smart cards and robotic vacuum cleaners and smartphones and even video uh streamers,"
    },
    {
      "Time_Start": 2519.5000000000005,
      "Time_End": 2525.0800000000004,
      "Text": " the number of such devices are continuously uh increased each and every day. Their"
    },
    {
      "Time_Start": 2525.0800000000004,
      "Time_End": 2530.6800000000003,
      "Text": " deployment is expected to grow throughout the next year as well. And as a result,"
    },
    {
      "Time_Start": 2531.46,
      "Time_End": 2538.5,
      "Text": " we will have much improved uh video cameras throughout the years that co-located with a"
    },
    {
      "Time_Start": 2538.5,
      "Time_End": 2545.8399999999997,
      "Text": " greater number of weak IOT devices. Okay? And due to this fact, we believe that uh more and"
    },
    {
      "Time_Start": 2545.8399999999997,
      "Time_End": 2551.72,
      "Text": " more devices will be exposed to video based cryptanalysis each and every year. This is the"
    },
    {
      "Time_Start": 2551.72,
      "Time_End": 2556.72,
      "Text": " final takeaway. It's mostly uh meant for perspective. It might be easier for this audience"
    },
    {
      "Time_Start": 2557.36,
      "Time_End": 2563.94,
      "Text": " to compromise the target device with the malware and exfiltrate the key over the internet."
    },
    {
      "Time_Start": 2563.94,
      "Time_End": 2569.5400000000004,
      "Text": " Okay? Than applying the attack that I've just, the attacks that I've just mentioned. However,"
    },
    {
      "Time_Start": 2569.5400000000004,
      "Time_End": 2576.2400000000002,
      "Text": " bear in mind that video based cryptanalysis is intended to extract keys from non-compromised"
    },
    {
      "Time_Start": 2576.2400000000002,
      "Time_End": 2582.0800000000004,
      "Text": " devices. Okay? And the beauty of it is that it uses popular equipment, not something that we"
    },
    {
      "Time_Start": 2582.08,
      "Time_End": 2588.06,
      "Text": " consider specialized equipment as the equipment that I've discussed at the beginning. Now a"
    },
    {
      "Time_Start": 2588.06,
      "Time_End": 2594.5,
      "Text": " few other uh takeaway, a few uh other things that I would like to mention. Uh this research"
    },
    {
      "Time_Start": 2594.5,
      "Time_End": 2599.5,
      "Text": " was recently awarded with a Pony Award for the best cryptographic attack of 2023. Um you"
    },
    {
      "Time_Start": 2602.2,
      "Time_End": 2607.22,
      "Text": " can find the additional details if you will look for video based cryptanalysis online. And"
    },
    {
      "Time_Start": 2607.82,
      "Time_End": 2613.9,
      "Text": " with that in mind, thank you very much for attending this talk. I will be happy to take any"
    },
    {
      "Time_Start": 2613.9,
      "Time_End": 2615.9,
      "Text": " questions from the audience. Thank you."
    },
    {
      "Time_Start": 2615.9,
      "Time_End": 2619.9,
      "Text": " >>[applause and cheers from audience and audience members"
    }
  ]
}