{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 8.96,
      "Text": "This text was transcribed using whisper model: large-v2\n\n This is like an incredible honor to be here. I had no idea there would be this many people."
    },
    {
      "Time_Start": 8.96,
      "Time_End": 14.88,
      "Text": " This is amazing. We're incredibly honored, excited, and absolutely terrified to be here"
    },
    {
      "Time_Start": 14.88,
      "Time_End": 21.44,
      "Text": " right now. So, as I think he alluded to earlier, I'm going to start off with a quick question."
    },
    {
      "Time_Start": 21.44,
      "Time_End": 28.240000000000002,
      "Text": " How many of you guys like taking public transportation? Okay, all right, all right. Now, how many"
    },
    {
      "Time_Start": 28.880000000000003,
      "Time_End": 34.24,
      "Text": " of those same people enjoy paying for public transportation? I see a couple hands. Okay."
    },
    {
      "Time_Start": 35.120000000000005,
      "Time_End": 39.36,
      "Text": " Well, for those of you with your hands up, it's a good opportunity to avert your eyes if you want."
    },
    {
      "Time_Start": 40.32,
      "Time_End": 46.400000000000006,
      "Text": " But for everybody else, I actually have a little bit of bad news to start off with, because"
    },
    {
      "Time_Start": 47.760000000000005,
      "Time_End": 52.72,
      "Text": " as our local transit agency's lawyers have instructed us to say and put on our title slide,"
    },
    {
      "Time_Start": 53.6,
      "Time_End": 56.32000000000001,
      "Text": " the MBTA does not endorse or encourage this type of conduct. We're debating fares and"
    },
    {
      "Time_Start": 57.2,
      "Time_End": 60.32,
      "Text": " legal, and the MBTA takes these matters seriously. Anyone caught engaging in this type of behavior"
    },
    {
      "Time_Start": 60.32,
      "Time_End": 63.12,
      "Text": " will be referred to the appropriate law enforcement agency. MBTA has implemented"
    },
    {
      "Time_Start": 63.12,
      "Time_End": 72.16,
      "Text": " mitigation measures to address some of these concerns. Okay. So, now we can begin."
    },
    {
      "Time_Start": 73.6,
      "Time_End": 83.68,
      "Text": " So, are any of these, no, these aren't even up here. Let's see. The slide should be appearing,"
    },
    {
      "Time_Start": 83.68,
      "Time_End": 92.08000000000001,
      "Text": " right? I think we're having a bit of trouble. Okay. We're on it. Good. Yeah. So, I'll just"
    },
    {
      "Time_Start": 92.08000000000001,
      "Time_End": 98.80000000000001,
      "Text": " explain who we are. So, we don't actually have any real, like, qualifications or anything. We"
    },
    {
      "Time_Start": 98.80000000000001,
      "Time_End": 104.88000000000001,
      "Text": " don't work at any fancy cybersecurity companies, not yet anyway. We're vocational high school"
    },
    {
      "Time_Start": 104.88000000000001,
      "Time_End": 110.96000000000001,
      "Text": " students from Medford, Massachusetts. We call ourselves amateur miscreants. We really like to"
    },
    {
      "Time_Start": 110.96000000000001,
      "Time_End": 115.2,
      "Text": " make stuff, but we also like to break stuff, and we don't really like being told what to do,"
    },
    {
      "Time_Start": 116.56,
      "Time_End": 121.28,
      "Text": " and we're also part of an underwater robotics team at our school called Sunk Robotics. We"
    },
    {
      "Time_Start": 121.28,
      "Time_End": 125.36000000000001,
      "Text": " participate in a competition called the Mate ROV competition. A lot of fun, and it's brought the"
    },
    {
      "Time_Start": 125.36000000000001,
      "Time_End": 134.16,
      "Text": " four of us a lot closer together. So, let's see. It's helpful. Yeah. Okay. So, I have pictures"
    },
    {
      "Time_Start": 134.16,
      "Time_End": 141.28,
      "Text": " up here of us, but you'll just have to take a look at us here. So, it's me, Zach, Scott,"
    },
    {
      "Time_Start": 142.4,
      "Time_End": 151.28,
      "Text": " and Noah. So, you might be wondering what you're actually going to get out of this talk. Well,"
    },
    {
      "Time_Start": 151.28,
      "Time_End": 155.76,
      "Text": " if you live in Boston and you're paying attention, you'll get free rides on the MBTA."
    },
    {
      "Time_Start": 156.72,
      "Time_End": 161.12,
      "Text": " You also, if you don't, you can get lessons on how to reverse engineer a transit card,"
    },
    {
      "Time_Start": 161.20000000000002,
      "Time_End": 166.8,
      "Text": " and more generally, some lessons on reverse engineering. You'll also get a lesson on how"
    },
    {
      "Time_Start": 166.8,
      "Time_End": 171.20000000000002,
      "Text": " to talk to a government agency and how to not end up in handcuffs when you do so,"
    },
    {
      "Time_Start": 172.08,
      "Time_End": 175.20000000000002,
      "Text": " and if nothing else, you'll hopefully at least get a fun story."
    },
    {
      "Time_Start": 176.96,
      "Time_End": 184.24,
      "Text": " So, and I should mention, as I just did, that this is illegal. Don't do it, or if you do,"
    },
    {
      "Time_Start": 184.24,
      "Time_End": 194.4,
      "Text": " don't tell us about it. Okay? So, let's see. We'll figure it out. Okay. Brief introduction."
    },
    {
      "Time_Start": 214.24,
      "Time_End": 222.4,
      "Text": " So,"
    },
    {
      "Time_Start": 226.32000000000002,
      "Time_End": 236.4,
      "Text": " one second. Let's just see."
    },
    {
      "Time_Start": 244.24,
      "Time_End": 250.4,
      "Text": " Okay."
    },
    {
      "Time_Start": 250.4,
      "Time_End": 262.56,
      "Text": " Okay."
    },
    {
      "Time_Start": 269.44,
      "Time_End": 276.56,
      "Text": " This wouldn't be DEF CON without computer glitches."
    },
    {
      "Time_Start": 280.40000000000003,
      "Time_End": 290.56000000000006,
      "Text": " So,"
    },
    {
      "Time_Start": 290.56,
      "Time_End": 294.72,
      "Text": " okay."
    },
    {
      "Time_Start": 308.4,
      "Time_End": 310.16,
      "Text": " Is it seeing the second display?"
    },
    {
      "Time_Start": 312.16,
      "Time_End": 315.84000000000003,
      "Text": " Started detecting it. Couldn't find another display."
    },
    {
      "Time_Start": 315.84000000000003,
      "Time_End": 322.00000000000006,
      "Text": " Okay. Okay. Give me one second. Okay."
    },
    {
      "Time_Start": 346.00000000000006,
      "Time_End": 350.00000000000006,
      "Text": " So,"
    },
    {
      "Time_Start": 363.12,
      "Time_End": 368.8,
      "Text": " ah, okay. Well, can you guys wait? Go for it. All right."
    },
    {
      "Time_Start": 369.76,
      "Time_End": 375.44,
      "Text": " Okay. Do your best. We'll just get you back."
    },
    {
      "Time_Start": 379.68,
      "Time_End": 386.64,
      "Text": " Hi. Sorry about the whole thing here. Falling from the last bit. Meet the team. The"
    },
    {
      "Time_Start": 386.64,
      "Time_End": 391.68,
      "Text": " Massachusetts Bay Transportation Authority is the public transit agency in Boston."
    },
    {
      "Time_Start": 391.68,
      "Time_End": 397.28000000000003,
      "Text": " They manage all the buses and the subways. It's also the oldest transit system in the country."
    },
    {
      "Time_Start": 398.16,
      "Time_End": 402.24,
      "Text": " We have a picture of the TA's logo and the subway map here, but these are the slides."
    },
    {
      "Time_Start": 408.72,
      "Time_End": 416.24,
      "Text": " Sorry. So, sounds great. How can you hop on? Option one, you have traditional fare evasion,"
    },
    {
      "Time_Start": 416.24,
      "Time_End": 424.24,
      "Text": " which is like hopping the gates or forcing them open, or even just waving your hand over the"
    },
    {
      "Time_Start": 424.24,
      "Time_End": 433.36,
      "Text": " sensor to make them open. Paying also works. Subway fare is $2.40, and bus fare is $1.70."
    },
    {
      "Time_Start": 435.6,
      "Time_End": 441.52,
      "Text": " But there's some problems with these strategies. Traditional fare evasion, it's too easy. It's"
    },
    {
      "Time_Start": 441.52,
      "Time_End": 448.48,
      "Text": " really boring, and you also might get caught. Paying is way too legal. It's also way too boring,"
    },
    {
      "Time_Start": 448.48,
      "Time_End": 456.0,
      "Text": " and importantly, it costs money. So, what do you do? You hack the fare system. Duh."
    },
    {
      "Time_Start": 464.24,
      "Time_End": 469.20000000000005,
      "Text": " So, how many of you enjoy reading random Wikipedia articles in your spare time?"
    },
    {
      "Time_Start": 470.48,
      "Time_End": 476.48,
      "Text": " Alright. Okay. Very good. I certainly do as well. And this whole project started by me actually"
    },
    {
      "Time_Start": 476.48,
      "Time_End": 481.20000000000005,
      "Text": " reading a Wikipedia article, a trolley card Wikipedia article, and I went down to the"
    },
    {
      "Time_Start": 481.20000000000005,
      "Time_End": 488.0,
      "Text": " criticism section, the best part of any article, and I saw a nice security concerns, and a couple"
    },
    {
      "Time_Start": 488.0,
      "Time_End": 496.32,
      "Text": " things stuck out to me. One, DEF CON, MIT students, and a federal lawsuit. Let's see if anyone here"
    },
    {
      "Time_Start": 496.32,
      "Time_End": 502.56,
      "Text": " remembers that. And Zach can tell you a little bit more about some of these security concerns."
    },
    {
      "Time_Start": 503.04,
      "Time_End": 511.92,
      "Text": " So, just to get a feel for things, does anybody remember that? He does. Okay. So, around 15 years"
    },
    {
      "Time_Start": 511.92,
      "Time_End": 518.88,
      "Text": " ago, back when dinosaurs roamed the earth and we were two years old, the MIT students figured out"
    },
    {
      "Time_Start": 518.88,
      "Time_End": 524.32,
      "Text": " how to hack the trolley cards, or more specifically the trolley tickets, the mag stripe tickets,"
    },
    {
      "Time_Start": 524.32,
      "Time_End": 530.56,
      "Text": " and add values up to $600 on them. So, they had the same ambition as us and wanted to come here"
    },
    {
      "Time_Start": 530.5600000000001,
      "Time_End": 537.6800000000001,
      "Text": " to present. The MBTA did not like that. So, they put out a restraining order against these kids"
    },
    {
      "Time_Start": 537.6800000000001,
      "Time_End": 545.6,
      "Text": " from MIT so they couldn't come here and present. So, if the slides were working, we'd have our"
    },
    {
      "Time_Start": 545.6,
      "Time_End": 553.7600000000001,
      "Text": " comically timed gavel and a picture of their restraining order, but you know, they got sued."
    },
    {
      "Time_Start": 554.72,
      "Time_End": 563.6,
      "Text": " So, we actually were inspired by them a little bit, and when they got sued, their slides, all"
    },
    {
      "Time_Start": 563.6,
      "Time_End": 569.52,
      "Text": " their research was just put straight into public domain, which allowed people like us to get our"
    },
    {
      "Time_Start": 569.52,
      "Time_End": 578.56,
      "Text": " grimy hands on them. So, let's try to be like them, maybe minus the lawsuit part. So, step one,"
    },
    {
      "Time_Start": 578.6400000000001,
      "Time_End": 585.0400000000001,
      "Text": " go for the low-hanging fruit. Trolley tickets, they have awful security, and the MIT students,"
    },
    {
      "Time_Start": 585.0400000000001,
      "Time_End": 590.8000000000001,
      "Text": " they found out how to clone and reverse engineer them. So, seems easy enough, free rides for life."
    },
    {
      "Time_Start": 592.1600000000001,
      "Time_End": 598.48,
      "Text": " So, step two, choose your weapon. If the slides were working, you'd be seeing a picture of a mag"
    },
    {
      "Time_Start": 598.48,
      "Time_End": 606.96,
      "Text": " stripe reader on eBay. It was $88, a little pricey, but it's an investment. Riding the subway is also"
    },
    {
      "Time_Start": 606.96,
      "Time_End": 614.48,
      "Text": " pricey and an investment. So, we're thinking, do we buy a mag stripe reader? The answer is no."
    },
    {
      "Time_Start": 615.0400000000001,
      "Time_End": 620.96,
      "Text": " So, around the time when we started this project, about two years ago, the MBTA actually phased out"
    },
    {
      "Time_Start": 620.96,
      "Time_End": 627.76,
      "Text": " mag stripe tickets. So, any disposable paper tickets were out and actually tappable, which"
    },
    {
      "Time_Start": 627.76,
      "Time_End": 635.44,
      "Text": " renders them useless to us. So, it's time for a new plan. Yeah, so now that trolley tickets were"
    },
    {
      "Time_Start": 635.44,
      "Time_End": 640.08,
      "Text": " out of the question, and the new tappable tickets that replaced them seemed like they actually"
    },
    {
      "Time_Start": 640.08,
      "Time_End": 645.9200000000001,
      "Text": " might have had some decent security, we decided to move on to the trolley cards. So, if you're not"
    },
    {
      "Time_Start": 645.9200000000001,
      "Time_End": 652.1600000000001,
      "Text": " familiar, there would be a picture up here, but the trolley card is a contactless smart card. It was"
    },
    {
      "Time_Start": 652.1600000000001,
      "Time_End": 658.72,
      "Text": " introduced in 2004, before any of us were born. You just add money at vending machines and you tap"
    },
    {
      "Time_Start": 658.72,
      "Time_End": 666.1600000000001,
      "Text": " cards at fare gates. There you go. But how does that actually work? Well, when we first started"
    },
    {
      "Time_Start": 666.1600000000001,
      "Time_End": 671.2,
      "Text": " doing our research about two years ago, we weren't 100% sure. There wasn't very much published"
    },
    {
      "Time_Start": 671.2,
      "Time_End": 676.8000000000001,
      "Text": " research about it. We kind of assumed that it would use NFC or RFID. How else would you be able to"
    },
    {
      "Time_Start": 676.8000000000001,
      "Time_End": 682.08,
      "Text": " tap it? But we didn't know much more than that until we took a look at the MIT students and their"
    },
    {
      "Time_Start": 682.08,
      "Time_End": 689.6,
      "Text": " slides. And they described that it used MyFair Classic. And so, what is MyFair? So I had to"
    },
    {
      "Time_Start": 689.6,
      "Time_End": 695.6,
      "Text": " read another Wikipedia article, and I can tell you that it's a standard for data storage and"
    },
    {
      "Time_Start": 695.6,
      "Time_End": 701.36,
      "Text": " communication. It's made by a company called NXP. There's a lot of different flavors of it, MyFair"
    },
    {
      "Time_Start": 701.36,
      "Time_End": 707.44,
      "Text": " Plus, Ultralight, Desfire, that all serve different purposes. But the most famous, or rather infamous"
    },
    {
      "Time_Start": 707.44,
      "Time_End": 713.6800000000001,
      "Text": " flavor is MyFair Classic. And that's the one they use in the Charlie cards. It's the oldest flavor,"
    },
    {
      "Time_Start": 713.6800000000001,
      "Time_End": 721.2800000000001,
      "Text": " and it has NXP's homegrown encryption algorithm called Crypto One. And fortunately for us, it's"
    },
    {
      "Time_Start": 721.2800000000001,
      "Time_End": 728.24,
      "Text": " proprietary, 48-bit, and relies on security through obscurity. Now, if you don't actually know"
    },
    {
      "Time_Start": 728.24,
      "Time_End": 733.0400000000001,
      "Text": " anything about crypto, which I'm sure most of you do, that might sound like a good thing, because"
    },
    {
      "Time_Start": 733.04,
      "Time_End": 739.5999999999999,
      "Text": " proprietary formulas are touted as, like, good or something. 48's a big number. But any"
    },
    {
      "Time_Start": 739.5999999999999,
      "Time_End": 744.64,
      "Text": " encryption algorithm worth its salt is going to have millions of eyes looking for ways to"
    },
    {
      "Time_Start": 744.64,
      "Time_End": 751.12,
      "Text": " improve it. And 48-bit encryption can be cracked in, like, an hour. So unsurprisingly, some"
    },
    {
      "Time_Start": 751.12,
      "Time_End": 756.64,
      "Text": " researchers found some holes in it, and they tried to publish it. And they got met with a whole"
    },
    {
      "Time_Start": 756.64,
      "Time_End": 763.28,
      "Text": " mess of lawsuits around it. So now that we know what kind of technology we're dealing with, how"
    },
    {
      "Time_Start": 763.28,
      "Time_End": 768.88,
      "Text": " do we actually talk to these cards? Well, the first step, and I would have a picture here, was"
    },
    {
      "Time_Start": 768.88,
      "Time_End": 775.36,
      "Text": " grabbing an NFC reader. I found one on Amazon for, like, 40 bucks. It had a convenient USB"
    },
    {
      "Time_Start": 775.36,
      "Time_End": 780.56,
      "Text": " interface, and there was software out there for it. I then set out trying to figure out how to use"
    },
    {
      "Time_Start": 780.5600000000001,
      "Time_End": 786.8800000000001,
      "Text": " that software. It's called LibNFC. But I then sent it right back, because I couldn't figure out"
    },
    {
      "Time_Start": 786.8800000000001,
      "Time_End": 793.44,
      "Text": " how to use it. It was too complicated for me. So I had to buy another one. This one's called the"
    },
    {
      "Time_Start": 793.44,
      "Time_End": 798.72,
      "Text": " Proxmark 3. I don't know how many of you are familiar with it, but it's kind of, like, before the"
    },
    {
      "Time_Start": 798.72,
      "Time_End": 804.24,
      "Text": " Flipper Zero came around, like, Swiss Army Knife. It was 40, 80 bucks, although some of the"
    },
    {
      "Time_Start": 804.24,
      "Time_End": 809.0400000000001,
      "Text": " really expensive ones can be, like, $300 or $400. It has some really nice software that's really"
    },
    {
      "Time_Start": 809.04,
      "Time_End": 816.4,
      "Text": " easy to use. The only problem I had is that it didn't work. It came to my doorstep, and I could,"
    },
    {
      "Time_Start": 816.4,
      "Time_End": 820.88,
      "Text": " like, I opened it up, I could connect to it, but I couldn't really do that whole, you know, reading"
    },
    {
      "Time_Start": 820.88,
      "Time_End": 826.0,
      "Text": " and writing cards thing that I was supposed to do. So I had to buy another one, about 40 bucks,"
    },
    {
      "Time_Start": 826.0,
      "Time_End": 832.64,
      "Text": " this time from AliExpress. I'm sure that's not going to be an issue at all. And it wasn't. It"
    },
    {
      "Time_Start": 832.72,
      "Time_End": 838.8,
      "Text": " worked just fine. I could read and write to cards, and I had a blast with it, until, and I also"
    },
    {
      "Time_Start": 838.8,
      "Time_End": 844.88,
      "Text": " have a picture for this, but the USB, the micro USB header came clean off, and I tried soldering"
    },
    {
      "Time_Start": 844.88,
      "Time_End": 851.04,
      "Text": " it back onto the board, and I couldn't do that. So guess what? I bought another reader. This one's"
    },
    {
      "Time_Start": 851.04,
      "Time_End": 858.08,
      "Text": " PN532. It's a nice, small, red thing. It's about 9 bucks, and which might be concerning, given"
    },
    {
      "Time_Start": 858.08,
      "Time_End": 863.0400000000001,
      "Text": " that we got burned by the last two 40-dollar readers, but if you are familiar with it, you'll"
    },
    {
      "Time_Start": 863.0400000000001,
      "Time_End": 868.4000000000001,
      "Text": " know why it's 9 bucks. There's no USB. It doesn't even come pre-soldered, and it also only works"
    },
    {
      "Time_Start": 868.4000000000001,
      "Time_End": 874.32,
      "Text": " with the Raspberry Pi, but it does, like, actually work this time, like, not just break when you"
    },
    {
      "Time_Start": 874.32,
      "Time_End": 880.0,
      "Text": " turn your back on it, and what I thought would have been as simple as just buying one NFC reader"
    },
    {
      "Time_Start": 880.0,
      "Time_End": 885.2800000000001,
      "Text": " from Amazon and calling it a day turned into, like, a two-to-three-month ordeal, where I can"
    },
    {
      "Time_Start": 885.28,
      "Time_End": 890.0799999999999,
      "Text": " say that I did at least learn a lot about NFC and NFC readers, maybe a little more than I would"
    },
    {
      "Time_Start": 890.0799999999999,
      "Time_End": 897.8399999999999,
      "Text": " have liked to. Now that we have an NFC reader, we can actually start trying to talk to cards,"
    },
    {
      "Time_Start": 897.8399999999999,
      "Time_End": 902.48,
      "Text": " but before we do that, we need to get the encryption keys. Unlike regular encryption"
    },
    {
      "Time_Start": 902.48,
      "Time_End": 909.36,
      "Text": " that just has, like, one key or two keys, My Fair Classic has 32 keys in total, so you actually"
    },
    {
      "Time_Start": 909.36,
      "Time_End": 914.24,
      "Text": " need to go out and find them, and while we've established that the encryption they use is"
    },
    {
      "Time_Start": 914.24,
      "Time_End": 918.96,
      "Text": " pretty terrible, it's still, like, encryption, so you actually need to get the keys if you want"
    },
    {
      "Time_Start": 918.96,
      "Time_End": 926.0,
      "Text": " to have any fun. So how do we do that? Well, I found a slide show from Black Hat called"
    },
    {
      "Time_Start": 926.0,
      "Time_End": 931.6,
      "Text": " Hacking My Fair Classic Cards. I thought it would be kind of promising, and I took a look,"
    },
    {
      "Time_Start": 931.6,
      "Time_End": 937.12,
      "Text": " and it described two different attacks, nested and dark side attack, and it described some"
    },
    {
      "Time_Start": 937.12,
      "Time_End": 943.04,
      "Text": " software that implemented that. So I figured, all right, let's give them a go. So the first tool I"
    },
    {
      "Time_Start": 943.04,
      "Time_End": 948.7199999999999,
      "Text": " tried was called MFOC, implements that nested attack, and it does some fancy magic that I don't"
    },
    {
      "Time_Start": 948.7199999999999,
      "Time_End": 955.12,
      "Text": " really understand to get a card's keys, and I gave it a go, and it didn't work because you need an"
    },
    {
      "Time_Start": 955.12,
      "Time_End": 962.0799999999999,
      "Text": " initial key. So how do we get that? Well, we can try implementing the dark side attack."
    },
    {
      "Time_Start": 962.0799999999999,
      "Time_End": 968.64,
      "Text": " Fortunately, there's some software called MFCuck that gets the keys kind of, like, out of thin"
    },
    {
      "Time_Start": 968.64,
      "Time_End": 975.04,
      "Text": " air. It's kind of cool. I don't know how it works. And I gave it a try, and it didn't work. I left"
    },
    {
      "Time_Start": 975.04,
      "Time_End": 981.68,
      "Text": " it running for, like, 24 hours, and I got nothing out of it. And by this point, I was thinking, am I"
    },
    {
      "Time_Start": 981.68,
      "Time_End": 986.3199999999999,
      "Text": " really going to have to buy my third Proxmark and try an attack where I put it in between the card"
    },
    {
      "Time_Start": 986.3199999999999,
      "Time_End": 991.84,
      "Text": " and the turnstile and try to sniff the keys? But then I thought, you know, it would be kind of"
    },
    {
      "Time_Start": 991.84,
      "Time_End": 998.0,
      "Text": " nice if the T just kind of left the back door open and used, like, default keys. So I made a"
    },
    {
      "Time_Start": 998.0,
      "Time_End": 1005.6,
      "Text": " quick Google search or DuckDuckGo search for my classic default keys, and I found a pretty"
    },
    {
      "Time_Start": 1005.6,
      "Time_End": 1010.56,
      "Text": " awesome repository of, like, a thousand different keys in it. And I fed them into MFCuck, which"
    },
    {
      "Time_Start": 1010.56,
      "Time_End": 1018.0,
      "Text": " can take a key list as an input, and there they were. Right there. All 16 of them, A and B,"
    },
    {
      "Time_Start": 1018.0,
      "Time_End": 1024.96,
      "Text": " right there in that list. And I was like, holy shit, this is awesome. So now that we have the"
    },
    {
      "Time_Start": 1024.96,
      "Time_End": 1032.8,
      "Text": " keys, we can actually start reading and writing the cards. So we can grab a binary dump. Here I"
    },
    {
      "Time_Start": 1032.8,
      "Time_End": 1039.2,
      "Text": " would have a picture of a hex editor where you can see the binary data. But obviously you can't"
    },
    {
      "Time_Start": 1039.2,
      "Time_End": 1047.2,
      "Text": " see that. So now that we have a binary dump, we can actually attempt to implement a similar"
    },
    {
      "Time_Start": 1047.2,
      "Time_End": 1055.2,
      "Text": " attack that the MIT students did with their cloning. And before you do that, you need"
    },
    {
      "Time_Start": 1055.2,
      "Time_End": 1061.68,
      "Text": " yet more special equipment. You can't use any old regular MyFairCard. You have to use these"
    },
    {
      "Time_Start": 1061.68,
      "Time_End": 1067.76,
      "Text": " special Chinese back door magic cards that let you edit the UID for copying. And I had"
    },
    {
      "Time_Start": 1067.76,
      "Time_End": 1071.8400000000001,
      "Text": " fortunately accumulated a bunch of them with all the, like, bajillion different NFC readers I had"
    },
    {
      "Time_Start": 1071.84,
      "Time_End": 1079.76,
      "Text": " bought. So what I did was I took a dump from a Charlie card, took that hex dump, put it on a"
    },
    {
      "Time_Start": 1079.76,
      "Time_End": 1085.76,
      "Text": " magic card. We're going to get this fixed real quick. All right. We're going to use some"
    },
    {
      "Time_Start": 1085.76,
      "Time_End": 1091.76,
      "Text": " hand waving magic to make the slides change. So, yeah. You know, classic DEF CON fashion."
    },
    {
      "Time_Start": 1105.76,
      "Time_End": 1111.76,
      "Text": " Okay. So what I did was I took a dump from a Charlie card, put that on a magic card, and"
    },
    {
      "Time_Start": 1115.76,
      "Time_End": 1121.76,
      "Text": " I tapped it on a reader. And sure enough, it actually worked. I would have a picture of it."
    },
    {
      "Time_Start": 1121.76,
      "Time_End": 1127.76,
      "Text": " And we might in a second, but we'll probably be on that. But I have a nice white card tapped"
    },
    {
      "Time_Start": 1127.76,
      "Time_End": 1133.76,
      "Text": " on a reader. It's very obviously not a Charlie card. But crucially, the reader seemed to"
    },
    {
      "Time_Start": 1133.76,
      "Time_End": 1139.76,
      "Text": " believe it was. And I noticed that when I went to tap that clone card on a reader, it worked."
    },
    {
      "Time_Start": 1140.76,
      "Time_End": 1146.76,
      "Text": " It deducted money. But the card that I copied it from still had its initial value. So if"
    },
    {
      "Time_Start": 1148.76,
      "Time_End": 1154.76,
      "Text": " you're kind of paying attention here, you'll notice that means that the source of truth isn't"
    },
    {
      "Time_Start": 1154.76,
      "Time_End": 1160.76,
      "Text": " in some database somewhere. It's actually right on the card. And the T is trusting people to"
    },
    {
      "Time_Start": 1160.76,
      "Time_End": 1166.76,
      "Text": " just not change it. But you can't trust us. So we figured, okay, that means we can actually"
    },
    {
      "Time_Start": 1167.76,
      "Time_End": 1173.76,
      "Text": " change it. So let's see. I'm trying to remember. I know I might have the slides up in front"
    },
    {
      "Time_Start": 1173.76,
      "Time_End": 1179.76,
      "Text": " of me. But, yeah, that means we can actually attempt to change that. But before I did any"
    },
    {
      "Time_Start": 1181.76,
      "Time_End": 1187.76,
      "Text": " of that, I wrote a little program that we call Charlie Clone written in C. I spent a long"
    },
    {
      "Time_Start": 1187.76,
      "Time_End": 1193.76,
      "Text": " time making a little progress bar for it. But it just copies cards pretty efficiently. And we"
    },
    {
      "Time_Start": 1193.76,
      "Time_End": 1199.76,
      "Text": " don't use that for any future cloning endeavors. And one of the issues with cloning cards,"
    },
    {
      "Time_Start": 1199.76,
      "Time_End": 1205.76,
      "Text": " well, it feels kind of like we found the infinite money glitch because you can just copy"
    },
    {
      "Time_Start": 1205.76,
      "Time_End": 1211.76,
      "Text": " cards. There are a couple of issues. Namely that if you want a $50 card, there we have it."
    },
    {
      "Time_Start": 1211.76,
      "Time_End": 1217.76,
      "Text": " Yay! All right. This is great. This is going to be a lot easier now. So we need to go on."
    },
    {
      "Time_Start": 1218.76,
      "Time_End": 1224.76,
      "Text": " I need to change the next slide. All right. So let's see. There are a couple of issues. Mainly"
    },
    {
      "Time_Start": 1234.76,
      "Time_End": 1239.76,
      "Text": " that you need an up front investment. If you want a $50 card, you're going to need to spend $50"
    },
    {
      "Time_Start": 1239.76,
      "Time_End": 1245.76,
      "Text": " to do so. And, you know, it might set off some fraud alarms here and there. Because they"
    },
    {
      "Time_Start": 1245.76,
      "Time_End": 1251.76,
      "Text": " can detect clone cards. We've actually gotten a couple disabled. But let's see. Okay. Yeah."
    },
    {
      "Time_Start": 1254.76,
      "Time_End": 1260.76,
      "Text": " So there's a couple issues. Yeah. They can detect it. And when the cards do get disabled, you"
    },
    {
      "Time_Start": 1260.76,
      "Time_End": 1266.76,
      "Text": " have to spend yet another 50 bucks. Okay. Nice. Okay. Here we go. This is what I just"
    },
    {
      "Time_Start": 1267.76,
      "Time_End": 1273.76,
      "Text": " described. All right. Now we're in business. This is great. Okay. So as you can tell, there's a"
    },
    {
      "Time_Start": 1276.76,
      "Time_End": 1282.76,
      "Text": " couple issues with cloning cards. Right? So what's better than that? Forging cards."
    },
    {
      "Time_Start": 1282.76,
      "Time_End": 1288.76,
      "Text": " Actually trying to put our own data on there and have some fun. So if we want to forge cards,"
    },
    {
      "Time_Start": 1288.76,
      "Time_End": 1293.76,
      "Text": " that means that we actually have to reverse engineer the cards and figure out how they're"
    },
    {
      "Time_Start": 1293.76,
      "Time_End": 1299.76,
      "Text": " storing data and figure out what the hell they're doing. So where do we start for that? Well,"
    },
    {
      "Time_Start": 1299.76,
      "Time_End": 1303.76,
      "Text": " it makes sense to look at the hex dump. After all, the money is stored on the card. So it must"
    },
    {
      "Time_Start": 1303.76,
      "Time_End": 1309.76,
      "Text": " be in here somewhere. I looked around for a couple things that stood out. I noticed a serial"
    },
    {
      "Time_Start": 1309.76,
      "Time_End": 1314.76,
      "Text": " number. When you convert the first four bytes, that's a UID, into decimal, they match the"
    },
    {
      "Time_Start": 1314.76,
      "Time_End": 1320.76,
      "Text": " number printed on the card. I then tried to change some data. Just, you know, I put in some"
    },
    {
      "Time_Start": 1320.76,
      "Time_End": 1326.76,
      "Text": " data and just tried to see what happened. And the reader seemed to disagree a little"
    },
    {
      "Time_Start": 1326.76,
      "Time_End": 1332.76,
      "Text": " bit. As you can see, it says, cannot read your card or ticket. And then I remembered something."
    },
    {
      "Time_Start": 1332.76,
      "Time_End": 1338.76,
      "Text": " That the Charlie tickets, the old ones, had a checksum in them. It was pretty terrible, but"
    },
    {
      "Time_Start": 1338.76,
      "Time_End": 1344.76,
      "Text": " there was still some attempt to avoid people just tampering with it or accidental tampering."
    },
    {
      "Time_Start": 1345.76,
      "Time_End": 1351.76,
      "Text": " So I quickly realized that the data, that the last two bytes that I've highlighted up here in"
    },
    {
      "Time_Start": 1351.76,
      "Time_End": 1356.76,
      "Text": " yellow, they might be a checksum. Because if you take a look at the red lines that are just"
    },
    {
      "Time_Start": 1356.76,
      "Time_End": 1362.76,
      "Text": " zeroes, they still have some of those two weird bytes at the end. And I thought to myself,"
    },
    {
      "Time_Start": 1362.76,
      "Time_End": 1368.76,
      "Text": " okay, well, checksum, that's not too bad, right? I mean, maybe they're just using some standard"
    },
    {
      "Time_Start": 1368.76,
      "Time_End": 1373.76,
      "Text": " algorithm and we can just plop the data into the checksum algorithm and have a blast. So I"
    },
    {
      "Time_Start": 1373.76,
      "Time_End": 1378.76,
      "Text": " tried some common algorithms. And you can see a couple pictures of them up here. I tried"
    },
    {
      "Time_Start": 1378.76,
      "Time_End": 1384.76,
      "Text": " like 20 or 30 of them. And sure enough, none of them worked. So at this point, I didn't"
    },
    {
      "Time_Start": 1384.76,
      "Time_End": 1390.76,
      "Text": " really know much about checksum algorithms or much of anything. And I thought, okay, this"
    },
    {
      "Time_Start": 1390.76,
      "Time_End": 1394.76,
      "Text": " checksum's a little bit evil. I don't know what they're doing. They're probably having their"
    },
    {
      "Time_Start": 1394.76,
      "Time_End": 1399.76,
      "Text": " own algorithm. And it's kind of above my pay grade of like zero dollars to try to figure that"
    },
    {
      "Time_Start": 1399.76,
      "Time_End": 1404.76,
      "Text": " out. So I figured, okay, cloning cards, there's some issues, but it's just all right. I'll take"
    },
    {
      "Time_Start": 1404.76,
      "Time_End": 1411.76,
      "Text": " them and just put this whole project to rest until I met Scott."
    },
    {
      "Time_Start": 1411.76,
      "Time_End": 1417.76,
      "Text": " So I had received a student card in Boston area. If you live far enough away from your school,"
    },
    {
      "Time_Start": 1417.76,
      "Time_End": 1423.76,
      "Text": " they'll give you a Charlie card that gives you free transit within a given area, which happens"
    },
    {
      "Time_Start": 1423.76,
      "Time_End": 1429.76,
      "Text": " to be where I live. And I wanted to clone these cards and maybe share them with my friends. We"
    },
    {
      "Time_Start": 1429.76,
      "Time_End": 1435.76,
      "Text": " all get free rides, yay. And in passing, I mentioned that idea to Maddy at Robotics Club. We"
    },
    {
      "Time_Start": 1435.76,
      "Time_End": 1441.76,
      "Text": " didn't really know each other that well at the time. But that started a lifelong friendship,"
    },
    {
      "Time_Start": 1441.76,
      "Time_End": 1447.76,
      "Text": " didn't it, Maddy? I've got to really press it. All right. So I'm going to show you a"
    },
    {
      "Time_Start": 1453.76,
      "Time_End": 1458.76,
      "Text": " demo. He'd already figured out how to clone the cards. So we wanted to maybe take the project a"
    },
    {
      "Time_Start": 1458.76,
      "Time_End": 1464.76,
      "Text": " little bit further. So a reasonable step seemed to be let's find where the money is, kind of get"
    },
    {
      "Time_Start": 1464.76,
      "Time_End": 1472.76,
      "Text": " our bearings with the data. So we looked at some hex data together. For many hours and"
    },
    {
      "Time_Start": 1472.76,
      "Time_End": 1478.76,
      "Text": " hours, what we were trying to do is figure out where the money is. We would take a dump of one"
    },
    {
      "Time_Start": 1478.76,
      "Time_End": 1484.76,
      "Text": " card, save it, add a bit of money, take another dump, and then compare them in a program"
    },
    {
      "Time_Start": 1484.76,
      "Time_End": 1490.76,
      "Text": " called vbindeth and look at the differences. And then, like, we're trying to figure out which one of"
    },
    {
      "Time_Start": 1490.76,
      "Time_End": 1498.76,
      "Text": " these bytes is the money. There's another accurate 3D rendering. And about 2,000 years later,"
    },
    {
      "Time_Start": 1498.76,
      "Time_End": 1506.76,
      "Text": " after much trial and tribulation, we found nothing. So here's a sample of the"
    },
    {
      "Time_Start": 1507.76,
      "Time_End": 1512.76,
      "Text": " project. So here's a screenshot from that MIT DEF CON slide presentation we were talking"
    },
    {
      "Time_Start": 1512.76,
      "Time_End": 1518.76,
      "Text": " about earlier. And how do you reverse engineer things again? Oh, wait. You've got to change it."
    },
    {
      "Time_Start": 1518.76,
      "Time_End": 1524.76,
      "Text": " So we had to figure out how to do that. But that pesky checksum is in the way. So let's try to"
    },
    {
      "Time_Start": 1524.76,
      "Time_End": 1532.76,
      "Text": " crack the checksum. So if you look at these two screenshots of binary dumps, there's, as you"
    },
    {
      "Time_Start": 1533.76,
      "Time_End": 1539.76,
      "Text": " see in the yellow, that's where the checksum is. And then there's all those zeros leading up to"
    },
    {
      "Time_Start": 1539.76,
      "Time_End": 1545.76,
      "Text": " those two checksums. Those are on two different cards. But even though all the data is the same,"
    },
    {
      "Time_Start": 1545.76,
      "Time_End": 1549.76,
      "Text": " the checksum is different. So that's something that's kind of weird. And it probably means"
    },
    {
      "Time_Start": 1549.76,
      "Time_End": 1554.76,
      "Text": " they're adding cryptographic salt. And for those of you who don't know, cryptographic salt is a"
    },
    {
      "Time_Start": 1554.76,
      "Time_End": 1559.76,
      "Text": " little bit of extra data that you mix in just to make it a little bit harder to go backwards."
    },
    {
      "Time_Start": 1559.76,
      "Time_End": 1564.76,
      "Text": " You do it when you're storing passwords. And most of you are probably familiar with that. So we"
    },
    {
      "Time_Start": 1564.76,
      "Time_End": 1569.76,
      "Text": " tried those off-the-shelf checksum calculators again, but with a bit of salt. And none of them"
    },
    {
      "Time_Start": 1569.76,
      "Time_End": 1575.76,
      "Text": " worked. I spent a little bit of time in my English class doing this. And by a little bit of"
    },
    {
      "Time_Start": 1575.76,
      "Time_End": 1582.76,
      "Text": " time, I mean three straight weeks of all day. But I still managed to pass. So that brings us to"
    },
    {
      "Time_Start": 1582.76,
      "Time_End": 1588.76,
      "Text": " our first breakthrough. Up until this point, we'd been replicating earlier research. But now"
    },
    {
      "Time_Start": 1589.76,
      "Time_End": 1595.76,
      "Text": " we want to try to do something new. So if you take those two checksums at the end of the line"
    },
    {
      "Time_Start": 1595.76,
      "Time_End": 1601.76,
      "Text": " with all those zeros, we thought maybe there's a mathematical relationship between the"
    },
    {
      "Time_Start": 1601.76,
      "Time_End": 1607.76,
      "Text": " checksums between the two cards. So we tried a bunch of operations on them. Addition,"
    },
    {
      "Time_Start": 1607.76,
      "Time_End": 1613.76,
      "Text": " subtraction, multiplication, division. And eventually we landed on the bitwise operation XOR."
    },
    {
      "Time_Start": 1613.76,
      "Time_End": 1619.76,
      "Text": " For those of you who don't know what XOR is, it's just like addition or subtraction but for"
    },
    {
      "Time_Start": 1619.76,
      "Time_End": 1625.76,
      "Text": " binary. So if you look at these two hex dump screenshots, you take the checksums. If you"
    },
    {
      "Time_Start": 1627.76,
      "Time_End": 1633.76,
      "Text": " XOR those checksums together, you get a value. That's not surprising. But if you take two"
    },
    {
      "Time_Start": 1633.76,
      "Time_End": 1639.76,
      "Text": " different lines that have identical data from two different cards and you XOR those"
    },
    {
      "Time_Start": 1639.76,
      "Time_End": 1645.76,
      "Text": " together, you get the same value. So that's kind of interesting. Maybe it's something we can"
    },
    {
      "Time_Start": 1645.76,
      "Time_End": 1651.76,
      "Text": " work with. So how do we use it? The first step to our process is you find two identical lines."
    },
    {
      "Time_Start": 1653.76,
      "Time_End": 1659.76,
      "Text": " So go back to all those zeros. And then you find a checksum modifier. That's what we call the"
    },
    {
      "Time_Start": 1659.76,
      "Time_End": 1665.76,
      "Text": " value you get when you XOR the two checksums together. And we can use it to transfer lines from"
    },
    {
      "Time_Start": 1665.76,
      "Time_End": 1671.76,
      "Text": " one card to another card. So you copy any line from those two cards. You copy the whole line"
    },
    {
      "Time_Start": 1671.76,
      "Time_End": 1677.76,
      "Text": " over. Checksum and all. Then you XOR the checksum that you copied over with the checksum"
    },
    {
      "Time_Start": 1681.76,
      "Time_End": 1687.76,
      "Text": " modifier and you get a new checksum. And you write that into the checksum slot. And boom, the"
    },
    {
      "Time_Start": 1687.76,
      "Time_End": 1693.76,
      "Text": " line's copied. So just to recap, here are your instructions if you want to replicate this,"
    },
    {
      "Time_Start": 1693.76,
      "Time_End": 1699.76,
      "Text": " which don't. It's bad. But you start with two cards. You find two identical lines. XOR the"
    },
    {
      "Time_Start": 1699.76,
      "Time_End": 1705.76,
      "Text": " two different checksums to get a checksum modifier. Find a line that you want to move. Copy"
    },
    {
      "Time_Start": 1705.76,
      "Time_End": 1711.76,
      "Text": " that line onto the other card. XOR the old checksum by the checksum modifier. And profit. But"
    },
    {
      "Time_Start": 1711.76,
      "Time_End": 1717.76,
      "Text": " don't profit. So what can we do with this? You might be thinking, how is this any better than"
    },
    {
      "Time_Start": 1717.76,
      "Time_End": 1723.76,
      "Text": " XOR? But remember how those cards get disabled sometimes when you clone them? Now if your card"
    },
    {
      "Time_Start": 1723.76,
      "Time_End": 1727.76,
      "Text": " gets disabled, say you put $50 on the card you were cloning. It gets disabled, those $50 are"
    },
    {
      "Time_Start": 1727.76,
      "Time_End": 1732.76,
      "Text": " gone. But we can copy that money line from the old card to the new card. And we can also edit"
    },
    {
      "Time_Start": 1732.76,
      "Time_End": 1737.76,
      "Text": " data so it's easier to move from here in reverse engineering. So that moves us on to the next"
    },
    {
      "Time_Start": 1737.76,
      "Time_End": 1743.76,
      "Text": " step of trial and error. So up to this point, we had been just copying data from card to card."
    },
    {
      "Time_Start": 1744.76,
      "Time_End": 1750.76,
      "Text": " But we still haven't been able to actually fine tune and edit values. So if you want a $50"
    },
    {
      "Time_Start": 1750.76,
      "Time_End": 1756.76,
      "Text": " card, you still have to spend that initial $50. So we had also been mostly just sitting at"
    },
    {
      "Time_Start": 1757.76,
      "Time_End": 1763.76,
      "Text": " home staring at hex data. And eventually if you want to get things done, you got to go to"
    },
    {
      "Time_Start": 1763.76,
      "Time_End": 1769.76,
      "Text": " some readers and tap them. And where do you do that? At a subway station. So if you want to"
    },
    {
      "Time_Start": 1769.76,
      "Time_End": 1773.76,
      "Text": " have your own subway station adventure, the first thing you need is an NFC reader and a"
    },
    {
      "Time_Start": 1773.76,
      "Time_End": 1778.76,
      "Text": " portable one. We didn't have any portable ones at this point. All of them had died on us. So"
    },
    {
      "Time_Start": 1778.76,
      "Time_End": 1784.76,
      "Text": " we had to make our own. We took the PN532 which works with the Raspberry Pi. Here's a picture"
    },
    {
      "Time_Start": 1784.76,
      "Time_End": 1789.76,
      "Text": " if you hadn't been able to see that. Hook it up to a battery bank and toss that whole"
    },
    {
      "Time_Start": 1789.76,
      "Time_End": 1797.76,
      "Text": " contraption into your backpack and refrain from boarding any airplanes. Next step is to spend"
    },
    {
      "Time_Start": 1797.76,
      "Time_End": 1803.76,
      "Text": " hours or better yet days just sitting at a train station trying to just kind of reverse engineer"
    },
    {
      "Time_Start": 1803.76,
      "Time_End": 1808.76,
      "Text": " stuff. More about that in the next slide. You can see some of the benches we sat at at those"
    },
    {
      "Time_Start": 1808.76,
      "Time_End": 1814.76,
      "Text": " stations. And we got quite familiar with the smell of subway stations. And while we were"
    },
    {
      "Time_Start": 1814.76,
      "Time_End": 1820.76,
      "Text": " sitting there, we tried to make a lot of random or better yet educated guess based changes to"
    },
    {
      "Time_Start": 1820.76,
      "Time_End": 1826.76,
      "Text": " try to figure out mainly how the checksum was working. How it was translating data into"
    },
    {
      "Time_Start": 1826.76,
      "Time_End": 1832.76,
      "Text": " those two bytes at the end. We would mostly try changing some data, seeing what happens or"
    },
    {
      "Time_Start": 1832.76,
      "Time_End": 1839.76,
      "Text": " just try changing the checksum directly. And what we do is we take all of the changes, flash"
    },
    {
      "Time_Start": 1839.76,
      "Time_End": 1845.76,
      "Text": " them on to some magic cards, run up to the reader, tap them, they'd make a loud and then we'd"
    },
    {
      "Time_Start": 1845.76,
      "Time_End": 1850.76,
      "Text": " run back to our seats, whip out our laptops and do that like 20 times. All the while we tried"
    },
    {
      "Time_Start": 1850.76,
      "Time_End": 1854.76,
      "Text": " to hide the cards in our hands to make it not obvious even though we're still running up to"
    },
    {
      "Time_Start": 1854.76,
      "Time_End": 1858.76,
      "Text": " the reader, tapping and running back and whipping out our laptops. But we never got stopped. No"
    },
    {
      "Time_Start": 1858.76,
      "Time_End": 1864.76,
      "Text": " one so much as even asked us what we were doing. And so eventually after doing this for long"
    },
    {
      "Time_Start": 1864.76,
      "Time_End": 1872.76,
      "Text": " enough, we made a bit of a breakthrough in terms of figuring out where the money is. So we"
    },
    {
      "Time_Start": 1872.76,
      "Time_End": 1877.76,
      "Text": " knew that the money is stored on the card. And so that means if you take the same card with"
    },
    {
      "Time_Start": 1877.76,
      "Time_End": 1883.76,
      "Text": " different amounts of money, we know that the money must have changed. So we can take a look at"
    },
    {
      "Time_Start": 1883.76,
      "Time_End": 1888.76,
      "Text": " some of the binary differences. This program right here highlights the data in red. That's"
    },
    {
      "Time_Start": 1888.76,
      "Time_End": 1894.76,
      "Text": " different. And I stumbled upon the bytes that I've highlighted in yellow. And I noticed"
    },
    {
      "Time_Start": 1894.76,
      "Time_End": 1899.76,
      "Text": " something about them when you convert them from hex into decimal that you get these numbers"
    },
    {
      "Time_Start": 1899.76,
      "Time_End": 1905.76,
      "Text": " here. And they don't quite look like anything. But if you divide by two, now they start to"
    },
    {
      "Time_Start": 1905.76,
      "Time_End": 1912.76,
      "Text": " look a little bit familiar. And upon trying this with other cards, we quickly realized that"
    },
    {
      "Time_Start": 1913.76,
      "Time_End": 1918.76,
      "Text": " this is where, those yellow bytes are where the money is stored. And it's also like in half"
    },
    {
      "Time_Start": 1918.76,
      "Time_End": 1923.76,
      "Text": " pennies for some reason. We also found that there's two transaction registers, one of the"
    },
    {
      "Time_Start": 1923.76,
      "Time_End": 1930.76,
      "Text": " current and last values and that Charlie cards are just kind of weird. So now that we know"
    },
    {
      "Time_Start": 1930.76,
      "Time_End": 1936.76,
      "Text": " where the money is, why don't we try to change it? So I'm going to go a little bit into the"
    },
    {
      "Time_Start": 1936.76,
      "Time_End": 1940.76,
      "Text": " weeds here. So either get your weed whacker ready or just tell the person next to you, wake"
    },
    {
      "Time_Start": 1940.76,
      "Time_End": 1945.76,
      "Text": " me up when I'm done. So the first step when you're trying to figure something out like this"
    },
    {
      "Time_Start": 1945.76,
      "Time_End": 1950.76,
      "Text": " is to isolate variables. As you can see here, the only data that's different between these two"
    },
    {
      "Time_Start": 1950.76,
      "Time_End": 1954.76,
      "Text": " lines is the stuff highlighted in red. That's the money on the left and the check sum on the"
    },
    {
      "Time_Start": 1954.76,
      "Time_End": 1961.76,
      "Text": " right. And we tried XORing the two values together between the different versions. And we"
    },
    {
      "Time_Start": 1961.76,
      "Time_End": 1966.76,
      "Text": " chose XOR because that seemed to be the key between copying data between cards. So we"
    },
    {
      "Time_Start": 1966.76,
      "Time_End": 1972.76,
      "Text": " figured it might be the key for copying data within a card. Or editing data within a card."
    },
    {
      "Time_Start": 1972.76,
      "Time_End": 1976.76,
      "Text": " And we XORed the two money values together and we got a value highlighted in green that we"
    },
    {
      "Time_Start": 1976.76,
      "Time_End": 1981.76,
      "Text": " called the data modifier. We then XORed the two check sums together and got a value"
    },
    {
      "Time_Start": 1981.76,
      "Time_End": 1985.76,
      "Text": " highlighted in red that we called the check sum modifier. We call them modifiers because if"
    },
    {
      "Time_Start": 1985.76,
      "Time_End": 1990.76,
      "Text": " you kind of shift your perspective in terms of how we change the top line to get to the bottom"
    },
    {
      "Time_Start": 1990.76,
      "Time_End": 1996.76,
      "Text": " line, you XOR them by the modifiers. And that's a valid way to change data within this"
    },
    {
      "Time_Start": 1996.76,
      "Time_End": 2001.76,
      "Text": " line. Now, of course, there's a lot of valid ways to change data between any two lines. But"
    },
    {
      "Time_Start": 2001.76,
      "Time_End": 2005.76,
      "Text": " what we wanted to see is if this would work with other data. So we took a card with"
    },
    {
      "Time_Start": 2005.76,
      "Time_End": 2010.76,
      "Text": " nothing on it, zero dollars, zero cents, and we XORed the data by the data modifier and the"
    },
    {
      "Time_Start": 2010.76,
      "Time_End": 2015.76,
      "Text": " check sum by the check sum modifier and we got this new line here. And we weren't sure if it"
    },
    {
      "Time_Start": 2015.76,
      "Time_End": 2021.76,
      "Text": " worked. But when we went to tap it, it sure did. And so while this isn't anything crazy, it's"
    },
    {
      "Time_Start": 2021.76,
      "Time_End": 2028.76,
      "Text": " not even enough to ride the subway. It's still our own homegrown value right here. The next"
    },
    {
      "Time_Start": 2028.76,
      "Time_End": 2034.76,
      "Text": " step is to add a quarter. It's a little bit confusing. So if you don't fully understand it,"
    },
    {
      "Time_Start": 2034.76,
      "Time_End": 2042.76,
      "Text": " just trust us. But you need to add a quarter because this method relies on XORing things"
    },
    {
      "Time_Start": 2042.76,
      "Time_End": 2048.76,
      "Text": " together. And with XOR, you can only, like, if you get saturated with one, as you can see"
    },
    {
      "Time_Start": 2048.76,
      "Time_End": 2054.76,
      "Text": " with the example with 15, there's no way you can keep XORing it to get higher and higher. So"
    },
    {
      "Time_Start": 2054.76,
      "Time_End": 2061.76,
      "Text": " you have to add an external value to get another bit and then you can keep increasing that. So"
    },
    {
      "Time_Start": 2061.76,
      "Time_End": 2067.76,
      "Text": " what we did was we added a quarter and we got a card with $2.60 and then we did the same"
    },
    {
      "Time_Start": 2067.76,
      "Time_End": 2073.76,
      "Text": " thing by XORing the values to get a data modifier, XORing the check sums to get a check sum"
    },
    {
      "Time_Start": 2073.76,
      "Time_End": 2079.76,
      "Text": " modifier and then we XORed, we applied the strategy we did earlier by taking a card with zero,"
    },
    {
      "Time_Start": 2079.76,
      "Time_End": 2084.76,
      "Text": " XORing the money by the data modifier and the check sum by the check sum modifier and we got a"
    },
    {
      "Time_Start": 2084.76,
      "Time_End": 2092.76,
      "Text": " new line with $4.95 on it. And we went to tap that. That worked as well. So it means that we"
    },
    {
      "Time_Start": 2093.76,
      "Time_End": 2101.76,
      "Text": " have a repeatable strategy that we can just rinse and repeat and try as many times to see how"
    },
    {
      "Time_Start": 2101.76,
      "Time_End": 2109.76,
      "Text": " high we can get. And we did just that. And we got up to $163.84. And as you can see, the"
    },
    {
      "Time_Start": 2109.76,
      "Time_End": 2117.76,
      "Text": " buttons are grayed out because past $100, you can't even add any more money. I noted by"
    },
    {
      "Time_Start": 2117.76,
      "Time_End": 2123.76,
      "Text": " writing down the data and seeing how they grow, I saw a pattern that they were doubling and"
    },
    {
      "Time_Start": 2123.76,
      "Time_End": 2129.76,
      "Text": " I tried that again one more time and I got up to $327.67, which if you're good with your"
    },
    {
      "Time_Start": 2129.76,
      "Time_End": 2134.76,
      "Text": " powers of two, you know that's a signed 16-bit integer limit. And no, we tried. You can't have a"
    },
    {
      "Time_Start": 2134.76,
      "Time_End": 2140.76,
      "Text": " negative Charlie card. So we eventually refined this process so we don't actually have to add"
    },
    {
      "Time_Start": 2140.76,
      "Time_End": 2146.76,
      "Text": " quarters every time by writing down all the modifiers and building a big table of them. But"
    },
    {
      "Time_Start": 2146.76,
      "Time_End": 2152.76,
      "Text": " we got it down to a process like this. You buy a card for a quarter. You just casually set"
    },
    {
      "Time_Start": 2152.76,
      "Time_End": 2158.76,
      "Text": " the value to $327. And then you profit. We chose to open all the fare gates because we're so"
    },
    {
      "Time_Start": 2158.76,
      "Time_End": 2163.76,
      "Text": " nice. But if you were a little less scrupulous than us, you could use them for your own"
    },
    {
      "Time_Start": 2163.76,
      "Time_End": 2170.76,
      "Text": " personal use or you could sell them and make the T very mad at you. So how does this"
    },
    {
      "Time_Start": 2170.76,
      "Time_End": 2176.76,
      "Text": " actually work? So pardon me if I go a little bit fast. We only have 10 minutes left. So we"
    },
    {
      "Time_Start": 2176.76,
      "Time_End": 2182.76,
      "Text": " wanted to, that's how we did it, but we wanted to have a more refined version to use in"
    },
    {
      "Time_Start": 2182.76,
      "Time_End": 2188.76,
      "Text": " writing programs so we can do this more automatically. So here's the vocabulary you need to"
    },
    {
      "Time_Start": 2188.76,
      "Time_End": 2194.76,
      "Text": " know. The existing data is what's there. Target data is what you want to be. The data"
    },
    {
      "Time_Start": 2194.76,
      "Time_End": 2200.76,
      "Text": " modifier is what you get when you XOR the target data and existing data. The existing"
    },
    {
      "Time_Start": 2200.76,
      "Time_End": 2204.76,
      "Text": " checksum is what's there. Like the checksum is already on the card. The target checksum is"
    },
    {
      "Time_Start": 2204.76,
      "Time_End": 2212.76,
      "Text": " what we need to make the target data valid. The checksum modifier is what ‑‑ I'm just"
    },
    {
      "Time_Start": 2212.76,
      "Time_End": 2220.76,
      "Text": " going to skip part of this down to this slide. So this is our process. You XOR the existing"
    },
    {
      "Time_Start": 2220.76,
      "Time_End": 2225.76,
      "Text": " data with the target data to get data modifier. Plug the data modifier and the column the data"
    },
    {
      "Time_Start": 2225.76,
      "Time_End": 2230.76,
      "Text": " is in into our look up table. Our look up table is a super secret black box. META"
    },
    {
      "Time_Start": 2230.76,
      "Time_End": 2235.76,
      "Text": " specifically requested that we did not share this. But what that really means is come"
    },
    {
      "Time_Start": 2235.76,
      "Time_End": 2241.76,
      "Text": " after maybe 10 bucks and we'll talk. And that spits out a checksum modifier. Finally you"
    },
    {
      "Time_Start": 2241.76,
      "Time_End": 2246.76,
      "Text": " XOR the existing checksum with the checksum modifier to get a target checksum. So"
    },
    {
      "Time_Start": 2246.76,
      "Time_End": 2251.76,
      "Text": " there's an example of steps. Read really fast. And a few more station adventures later. We"
    },
    {
      "Time_Start": 2251.76,
      "Time_End": 2256.76,
      "Text": " were able to use this to reverse engineer a lot quicker. Because we can just edit data and"
    },
    {
      "Time_Start": 2256.76,
      "Time_End": 2261.76,
      "Text": " see what it does. Here's the charlie card. The coolest parts in my opinion are the money and"
    },
    {
      "Time_Start": 2261.76,
      "Time_End": 2267.76,
      "Text": " the card type. The money allows us to make a $300 charlie card. That's cool obviously. And"
    },
    {
      "Time_Start": 2267.76,
      "Time_End": 2272.76,
      "Text": " the card type allows to make employee cards which are our favorite. Blind cards, senior,"
    },
    {
      "Time_Start": 2272.76,
      "Time_End": 2280.76,
      "Text": " student cards, whatever we want. We can make it now pretty much. So. Okay we're on a time"
    },
    {
      "Time_Start": 2280.76,
      "Time_End": 2287.76,
      "Text": " crunch here. So what button is it? Okay. Fun gadgets. We did all this stuff but we need to prove"
    },
    {
      "Time_Start": 2287.76,
      "Time_End": 2295.76,
      "Text": " that we can do it. That's me. I thought about it. Built a machine. Version 1, bad. Version 2,"
    },
    {
      "Time_Start": 2295.76,
      "Time_End": 2304.76,
      "Text": " bad. Version 3, horrible. 4, little better, getting there. Version 5, the first one, the first"
    },
    {
      "Time_Start": 2304.76,
      "Time_End": 2314.76,
      "Text": " version that we showed to the MBTA. The screen's upside down and I broke it. Version 6, I"
    },
    {
      "Time_Start": 2314.76,
      "Time_End": 2322.76,
      "Text": " broke it on the way here. But it worked. It did everything. Changed the data such as the"
    },
    {
      "Time_Start": 2323.76,
      "Time_End": 2331.76,
      "Text": " expiration date, money, and it looks cool. So ingredients, just read blood, sweat, tears, don't"
    },
    {
      "Time_Start": 2331.76,
      "Time_End": 2341.76,
      "Text": " do it. So we're going to go pretty fast here. We chose tarry. It lets you do background"
    },
    {
      "Time_Start": 2341.76,
      "Time_End": 2348.76,
      "Text": " computation and front end computation separates them. We had a program that reads NFC and"
    },
    {
      "Time_Start": 2348.76,
      "Time_End": 2354.76,
      "Text": " MyFairCards on the back end and sends it to basically a web design front end. We also have an"
    },
    {
      "Time_Start": 2354.76,
      "Time_End": 2368.76,
      "Text": " Android app. It was slapped together in like two nights and super ugly. It's slow too but it"
    },
    {
      "Time_Start": 2368.76,
      "Time_End": 2380.76,
      "Text": " does the job. Part 5. Cool. We're here today. We didn't end up in handcuffs. So do we go to"
    },
    {
      "Time_Start": 2380.76,
      "Time_End": 2386.76,
      "Text": " jail or do we not go to jail? We could have published this, given it to you guys, come to"
    },
    {
      "Time_Start": 2386.76,
      "Time_End": 2394.76,
      "Text": " Boston, you know, no more MBTA, no more paying for it at least. But we decided to go to them."
    },
    {
      "Time_Start": 2395.76,
      "Time_End": 2402.76,
      "Text": " Here's an article about Bobby Roush. He actually found out how to clone the cards, went to the"
    },
    {
      "Time_Start": 2402.76,
      "Time_End": 2410.76,
      "Text": " MBTA, wrote this nice article about him. So we say, hey, Bobby, talk to us, man. How do we do"
    },
    {
      "Time_Start": 2410.76,
      "Time_End": 2416.76,
      "Text": " this? How do we get in touch? So this is a complaint form for the MBTA. They don't really have a"
    },
    {
      "Time_Start": 2417.76,
      "Time_End": 2425.76,
      "Text": " we hacked your transit card form. So we filled it out under question, topic, others said, hey,"
    },
    {
      "Time_Start": 2425.76,
      "Time_End": 2431.76,
      "Text": " we did something. So we thought they were going to react like this, shoo us away. But they"
    },
    {
      "Time_Start": 2431.76,
      "Time_End": 2439.76,
      "Text": " responded. Not quite like this, though. That's an email inviting us to their headquarters. So"
    },
    {
      "Time_Start": 2439.76,
      "Time_End": 2445.76,
      "Text": " there you are. We went to the meeting. They brought in a bunch of execs. We talked to them"
    },
    {
      "Time_Start": 2445.76,
      "Time_End": 2449.76,
      "Text": " about what we'd been working on, how we did it, and how they could prevent us from doing it"
    },
    {
      "Time_Start": 2449.76,
      "Time_End": 2455.76,
      "Text": " next time. So that's a real picture of us. Just kidding. They didn't allow us to take pictures"
    },
    {
      "Time_Start": 2455.76,
      "Time_End": 2464.76,
      "Text": " in there. So post-meeting fun. Quickly, picture, picture. The cops got called on us."
    },
    {
      "Time_Start": 2464.76,
      "Time_End": 2476.76,
      "Text": " Whole story. Ask us afterwards. Come on. Demo. What's our time? Do we have time to play it?"
    },
    {
      "Time_Start": 2476.76,
      "Time_End": 2484.76,
      "Text": " Four minutes. Do we do it? Okay. Can they do it over there? Can they play the video for us?"
    },
    {
      "Time_Start": 2484.76,
      "Time_End": 2512.76,
      "Text": " It's on the laptop."
    },
    {
      "Time_Start": 2512.76,
      "Time_End": 2531.76,
      "Text": " Is there a laptop? Check files, maybe? Not quite. You see it? Okay. Maybe that other tab of"
    },
    {
      "Time_Start": 2531.76,
      "Time_End": 2543.76,
      "Text": " files. There's two. There you go. Yeah. All right. Wrong one. Wrong one. No, the other video."
    },
    {
      "Time_Start": 2543.76,
      "Time_End": 2548.76,
      "Text": " Yeah, there I am. Okay. I don't even know if you're going to be able to hear it. We're just going"
    },
    {
      "Time_Start": 2548.76,
      "Time_End": 2555.76,
      "Text": " to roll. This is me buying a Charlie card. I bought it. Blah, blah, blah. There's, you know,"
    },
    {
      "Time_Start": 2555.76,
      "Time_End": 2562.76,
      "Text": " audio. 25 cents for cheapskates."
    },
    {
      "Time_Start": 2586.76,
      "Time_End": 2593.76,
      "Text": " So right now there's 25 cents on it. It's verified. Okay. So you'll see the card type is adult."
    },
    {
      "Time_Start": 2593.76,
      "Time_End": 2600.76,
      "Text": " Has one use. The money on the card is 25 cents. Expiration date January 14th, 2033. And it has"
    },
    {
      "Time_Start": 2600.76,
      "Time_End": 2607.76,
      "Text": " no passes on it. So let's say we want to edit the money value. Just click the money values button."
    },
    {
      "Time_Start": 2607.76,
      "Time_End": 2618.76,
      "Text": " Okay. And we'll go, I don't know, just click some numbers. $251.53. So let's press edit. You'll"
    },
    {
      "Time_Start": 2618.76,
      "Time_End": 2626.76,
      "Text": " tap it on the reader. Then press your little edit button here. Give it a second. Tap it again."
    },
    {
      "Time_Start": 2626.76,
      "Time_End": 2634.76,
      "Text": " And give it another second. And another. There we go. There we go. Okay. So let's check if that"
    },
    {
      "Time_Start": 2634.76,
      "Time_End": 2648.76,
      "Text": " edited anything. Okay. So as you'll see, the money value has changed to $251.53. So how about"
    },
    {
      "Time_Start": 2648.76,
      "Time_End": 2655.76,
      "Text": " the card type? Card type, another big button. Let's change it to an employee because, you know,"
    },
    {
      "Time_Start": 2656.76,
      "Time_End": 2666.76,
      "Text": " why not? So we click employee. Click edit. Put it on the reader. Then press our little button. Tap"
    },
    {
      "Time_Start": 2666.76,
      "Time_End": 2681.76,
      "Text": " again. Okay. So you'll see the card type, employee with passback. Again, number of uses, one."
    },
    {
      "Time_Start": 2681.76,
      "Time_End": 2692.76,
      "Text": " Money on card, $251.53. So one more thing. Can we cut the video? So that's our time. Thank you"
    },
    {
      "Time_Start": 2692.76,
      "Time_End": 2699.76,
      "Text": " guys for being here. Then stand up. Give it up for this guy, these guys. Thank you guys so much."
    },
    {
      "Time_Start": 2699.76,
      "Time_End": 2702.76,
      "Text": " Thank you guys."
    }
  ]
}