{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 12.08,
      "Text": "This text was transcribed using whisper model: large-v2\n\n All right. Thank you so much. Thanks for coming out. Okay. So I'm worried that I'm really"
    },
    {
      "Time_Start": 12.08,
      "Time_End": 17.48,
      "Text": " going to have to book it through this talk because I've got a lot to go through. So hold"
    },
    {
      "Time_Start": 17.48,
      "Time_End": 26.84,
      "Text": " on tight. Okay. So first off, I'm Headless Zeke. Ricky Lausche, if you're nasty. I'm"
    },
    {
      "Time_Start": 26.84,
      "Time_End": 33.92,
      "Text": " a Principal Security Researcher at Keysight. I mainly focus on offensive IoT research."
    },
    {
      "Time_Start": 33.92,
      "Time_End": 40.04,
      "Text": " I've been doing this stuff since 09-ish, and this is actually my fifth time speaking at"
    },
    {
      "Time_Start": 40.04,
      "Time_End": 45.84,
      "Text": " DEF CON. For some reason, they keep letting me come back. We'll see about after this one."
    },
    {
      "Time_Start": 45.84,
      "Time_End": 53.84,
      "Text": " Okay. So first off, a couple of ground rules about this talk. So, yeah, we're going to"
    },
    {
      "Time_Start": 53.84,
      "Time_End": 59.84,
      "Text": " be diving into the wonderful world of Layer 2 networking. You know, everybody always does"
    },
    {
      "Time_Start": 59.84,
      "Time_End": 68.0,
      "Text": " like Layer 3 and above, but all the cool kids hang out on Layer 2. So, yeah, this is basically"
    },
    {
      "Time_Start": 68.0,
      "Time_End": 74.56,
      "Text": " just going to be like a survey of lots of different really weird Ether types. They're"
    },
    {
      "Time_Start": 74.56,
      "Time_End": 81.88,
      "Text": " not like specifically not common, not ubiquitous, and these are local network only, no Internet"
    },
    {
      "Time_Start": 81.88,
      "Time_End": 89.75999999999999,
      "Text": " facing protocols. It's just Layer 2 Ethernet protocols that may or may not be a good idea"
    },
    {
      "Time_Start": 89.75999999999999,
      "Time_End": 98.08,
      "Text": " to have on the network. Okay. So first off, what is an Ether type? This is defined in"
    },
    {
      "Time_Start": 98.08,
      "Time_End": 104.64,
      "Text": " IEEE 802.3. Basically, you've got a picture of an Ethernet frame that I ripped straight"
    },
    {
      "Time_Start": 104.64,
      "Time_End": 110.39999999999999,
      "Text": " off of Wikipedia right there. So you've got your preamble, and then you've got your destination"
    },
    {
      "Time_Start": 110.4,
      "Time_End": 114.08000000000001,
      "Text": " and source MAC addresses, and then the next two bytes after that are going to be your"
    },
    {
      "Time_Start": 114.08000000000001,
      "Time_End": 121.32000000000001,
      "Text": " Ether type, and this is basically a way for switches to know what kind of payload is coming"
    },
    {
      "Time_Start": 121.32000000000001,
      "Time_End": 133.24,
      "Text": " next. Some common examples are like, you know, 0800 for IPv4, et cetera. These ones are going"
    },
    {
      "Time_Start": 133.24,
      "Time_End": 143.4,
      "Text": " to not be those. These are the uncommon types. So a fun fact about the Ether type field,"
    },
    {
      "Time_Start": 143.4,
      "Time_End": 151.52,
      "Text": " if the value of that field is less than 15, it's a length, and if it's more than 1563,"
    },
    {
      "Time_Start": 151.52,
      "Time_End": 155.56,
      "Text": " it's an Ether type, and between those two is undefined. I can imagine that there was"
    },
    {
      "Time_Start": 155.56,
      "Time_End": 163.68,
      "Text": " a very heated discussion at IEEE about this. Does anyone know the significance of that"
    },
    {
      "Time_Start": 163.68,
      "Time_End": 177.36,
      "Text": " 1500 MTU? MTU? That's right. Okay. So in order to get an Ether type registered, you have"
    },
    {
      "Time_Start": 177.36,
      "Time_End": 185.4,
      "Text": " to go through IEEE. Basically, it costs $3,810, which is not cheap, so these aren't just"
    },
    {
      "Time_Start": 186.4,
      "Time_End": 192.52,
      "Text": " throwaway things that you do just for fun. It's a one-time fee. I don't think the registration"
    },
    {
      "Time_Start": 192.52,
      "Time_End": 198.6,
      "Text": " ever expires, although I have seen on their list of public Ether types, some of them are"
    },
    {
      "Time_Start": 198.6,
      "Time_End": 204.24,
      "Text": " no longer in use, so maybe they do expire. There are several different listings where"
    },
    {
      "Time_Start": 204.24,
      "Time_End": 211.52,
      "Text": " you can find all of the publicly registered Ether types there, and there are a couple"
    },
    {
      "Time_Start": 211.52,
      "Time_End": 221.64000000000001,
      "Text": " of special Ether types. These ones are reserved for particular uses. That's ADA B5 and B6"
    },
    {
      "Time_Start": 221.64000000000001,
      "Time_End": 226.88,
      "Text": " are for the playpen Ether types. These are what you can use when you're prototyping your"
    },
    {
      "Time_Start": 226.88,
      "Time_End": 236.84,
      "Text": " own Ethernet protocol. These cannot be used in actual production. These are just for prototyping"
    },
    {
      "Time_Start": 236.96,
      "Time_End": 241.96,
      "Text": " so that you can figure things out before you actually register your Ether type. And then"
    },
    {
      "Time_Start": 241.96,
      "Time_End": 251.04,
      "Text": " ADA B7 is the OUI extended Ether type. This is to handle the case of, you know, it's just"
    },
    {
      "Time_Start": 251.04,
      "Time_End": 255.36,
      "Text": " two bytes, so there are only so many Ether types that can be registered. So this one"
    },
    {
      "Time_Start": 255.36,
      "Time_End": 263.0,
      "Text": " exists to allow you to create a lot of Ether types without having to register a specific"
    },
    {
      "Time_Start": 263.04,
      "Time_End": 268.68,
      "Text": " Ether type. So you use this one, and then you've got your organizationally unique identifier,"
    },
    {
      "Time_Start": 268.68,
      "Time_End": 274.04,
      "Text": " and then your protocol identifier so that you can subtype multiple protocols within"
    },
    {
      "Time_Start": 274.04,
      "Time_End": 284.56,
      "Text": " one organization. So yeah, that's that. Okay, everybody ready? Okay, we're going to start"
    },
    {
      "Time_Start": 284.56,
      "Time_End": 290.76,
      "Text": " off easy and kind of ease our way into it. I've kind of broken this talk up into different"
    },
    {
      "Time_Start": 290.76,
      "Time_End": 296.8,
      "Text": " verticals. This one is network management. So we're going to start off with everybody's"
    },
    {
      "Time_Start": 296.8,
      "Time_End": 306.48,
      "Text": " old dear old friend SNMP. SNMP actually exists on Ethernet as well. Ether type 814C. Basically"
    },
    {
      "Time_Start": 306.48,
      "Time_End": 313.71999999999997,
      "Text": " the way this works is they just take SNMP packets, burn code them, burn code them, and"
    },
    {
      "Time_Start": 313.72,
      "Time_End": 322.48,
      "Text": " then wrap them in an Ethernet frame. It supports all versions of SNMP, mostly. So the uses"
    },
    {
      "Time_Start": 322.48,
      "Time_End": 329.32000000000005,
      "Text": " and abuses, I do this on every one of the protocols. So this one is mainly used in these"
    },
    {
      "Time_Start": 329.32000000000005,
      "Time_End": 335.08000000000004,
      "Text": " two port Mac relay bridges. They're kind of like Ethernet extender kind of things. But"
    },
    {
      "Time_Start": 335.08000000000004,
      "Time_End": 341.44000000000005,
      "Text": " in the spec for this protocol, it actually talks about using them anywhere where you"
    },
    {
      "Time_Start": 341.44,
      "Time_End": 350.71999999999997,
      "Text": " need to manage a device but you don't have IP access. But yeah, so abuses, basically"
    },
    {
      "Time_Start": 350.71999999999997,
      "Time_End": 356.52,
      "Text": " everything that you can abuse SNMP for before, you can do that over Ethernet and you might"
    },
    {
      "Time_Start": 356.52,
      "Time_End": 364.72,
      "Text": " actually get the added benefit of bypassing some firewall restrictions. Okay, this one"
    },
    {
      "Time_Start": 364.72,
      "Time_End": 374.28000000000003,
      "Text": " is really cool. This is one of my favorites. All right, so 8899 is the Realtek remote control"
    },
    {
      "Time_Start": 374.28000000000003,
      "Time_End": 382.78000000000003,
      "Text": " protocol. This one is basically with certain Realtek switches, Realtek chipsets, it allows"
    },
    {
      "Time_Start": 382.78000000000003,
      "Time_End": 388.88000000000005,
      "Text": " you to take an unmanaged switch and turn it into a managed switch. And the way this works"
    },
    {
      "Time_Start": 388.88,
      "Time_End": 399.4,
      "Text": " is basically you give it an address, like I squared C style, like an EPROM address."
    },
    {
      "Time_Start": 399.4,
      "Time_End": 406.96,
      "Text": " And then what you want to like read or write data to that and you can actually like modify"
    },
    {
      "Time_Start": 406.96,
      "Time_End": 414.0,
      "Text": " physical memory over the network. It's kind of cool. There's actually an open RRCP project"
    },
    {
      "Time_Start": 414.04,
      "Time_End": 419.04,
      "Text": " that has tons of information on the protocol and they've got a list of all the supported"
    },
    {
      "Time_Start": 419.04,
      "Time_End": 426.6,
      "Text": " hardware. Harder to find than you would think. I actually coincidentally ran across this"
    },
    {
      "Time_Start": 426.6,
      "Time_End": 432.24,
      "Text": " protocol on a device that I'm not allowed to talk about because it was pre-release at"
    },
    {
      "Time_Start": 432.24,
      "Time_End": 440.16,
      "Text": " the time. Thank you. It was pre-release at the time and I'm not sure if it's, you know,"
    },
    {
      "Time_Start": 440.16,
      "Time_End": 447.8,
      "Text": " public knowledge yet. So this is kind of what the protocol looks like. You've got,"
    },
    {
      "Time_Start": 447.8,
      "Time_End": 458.44000000000005,
      "Text": " so speaking of subtyping, this actually works for RRCP and Realtek echo protocol. You might"
    },
    {
      "Time_Start": 458.44000000000005,
      "Time_End": 467.8,
      "Text": " actually see that particular packet on your network or actually, sorry, no, network loop"
    },
    {
      "Time_Start": 467.84000000000003,
      "Time_End": 474.84000000000003,
      "Text": " detection is the one that you might actually see on your network. But that is not actually"
    },
    {
      "Time_Start": 474.84000000000003,
      "Time_End": 482.48,
      "Text": " remote control, the Realtek remote control protocol. That's a different subtype. Anyways,"
    },
    {
      "Time_Start": 482.48,
      "Time_End": 487.76,
      "Text": " they have an authentication key, but it's two bytes long. So you could easily brute"
    },
    {
      "Time_Start": 487.76,
      "Time_End": 495.22,
      "Text": " force that. And also it defaults as 2379 and nobody even knows that this protocol exists."
    },
    {
      "Time_Start": 495.26000000000005,
      "Time_End": 501.3,
      "Text": " Nobody knows that they're supposed to change the authentication key. So yeah, it's just that. So"
    },
    {
      "Time_Start": 501.3,
      "Time_End": 507.62,
      "Text": " yeah, basically at the end of the packet, you've got your register address and your data. So you"
    },
    {
      "Time_Start": 507.62,
      "Time_End": 514.38,
      "Text": " just have straight up access to registers. Uses, I kind of already talked about that. There's a"
    },
    {
      "Time_Start": 514.38,
      "Time_End": 521.58,
      "Text": " limited amount of chipsets. Realtek's data sheets on this protocol are really, really awesome. Like"
    },
    {
      "Time_Start": 521.58,
      "Time_End": 525.98,
      "Text": " some of the best data sheets I've ever seen. They'd give you like full register maps and"
    },
    {
      "Time_Start": 525.98,
      "Time_End": 533.7,
      "Text": " everything. But it's only certain chipsets that do this. Some cool abuses that you can do with"
    },
    {
      "Time_Start": 533.7,
      "Time_End": 540.82,
      "Text": " this, you can actually change your own VLAN tags. So if you don't like the VLAN you're on, you feel"
    },
    {
      "Time_Start": 540.82,
      "Time_End": 546.86,
      "Text": " lonely, you can change your VLAN tag and be on somebody else's VLAN. Or you can actually set"
    },
    {
      "Time_Start": 546.86,
      "Time_End": 554.98,
      "Text": " yourself up as a trunk port and just get all of the traffic going through you. Okay. This one is"
    },
    {
      "Time_Start": 554.98,
      "Time_End": 566.02,
      "Text": " funny. So 6001 and 6002, does anybody in the room remember DECnet? You should probably schedule a"
    },
    {
      "Time_Start": 566.02,
      "Time_End": 579.18,
      "Text": " colonoscopy. So yeah, DECnet, they had a whole protocol stack in like the 1970s, 80s. You know,"
    },
    {
      "Time_Start": 579.18,
      "Time_End": 587.8199999999999,
      "Text": " long dead. This DECnet Maintenance Operation Protocol or MOP basically had two functions. One"
    },
    {
      "Time_Start": 587.8199999999999,
      "Time_End": 595.6999999999999,
      "Text": " was to dump and load system memory and the other was to have a remote control console on like VACs"
    },
    {
      "Time_Start": 595.82,
      "Time_End": 601.1400000000001,
      "Text": " systems and stuff like that. So basically whenever a system was malfunctioning to the point where you"
    },
    {
      "Time_Start": 601.1400000000001,
      "Time_End": 607.6600000000001,
      "Text": " couldn't actually like create a session on it, you could use this protocol to still like remotely"
    },
    {
      "Time_Start": 607.6600000000001,
      "Time_End": 616.0200000000001,
      "Text": " recover from it. So yeah, DECnet is gone, except that it's not because Cisco still includes the MOP"
    },
    {
      "Time_Start": 616.14,
      "Time_End": 626.14,
      "Text": " protocol on all of its routers enabled by default to this very day. So yeah, and they actually still"
    },
    {
      "Time_Start": 626.14,
      "Time_End": 634.5,
      "Text": " like this was from the hardened Cisco iOS devices PDF from September of 2020, where they actually"
    },
    {
      "Time_Start": 634.5,
      "Time_End": 640.54,
      "Text": " talk about how you're supposed to go into the interface configuration mode and disable the"
    },
    {
      "Time_Start": 640.54,
      "Time_End": 652.06,
      "Text": " maintenance operation service. But yeah, so the dumping memory side, you basically, you give it an"
    },
    {
      "Time_Start": 652.06,
      "Time_End": 660.86,
      "Text": " address, an account of bytes, and it will read that, you know, that many bytes from that address. I"
    },
    {
      "Time_Start": 660.86,
      "Time_End": 666.3,
      "Text": " haven't actually gotten that side working yet, but you know, in theory, that's how it works. And then"
    },
    {
      "Time_Start": 666.3000000000001,
      "Time_End": 675.5000000000001,
      "Text": " the remote console side, the data field is, it depends on what command you're doing. But there is a full"
    },
    {
      "Time_Start": 675.5000000000001,
      "Time_End": 681.98,
      "Text": " protocol spec out there. And I've included a link to that in the slides. Oh, and there's also already a"
    },
    {
      "Time_Start": 681.98,
      "Time_End": 693.98,
      "Text": " Linux tool called MOPRC that you can just use. Okay, so yeah, uses and abuses. You can maintain old"
    },
    {
      "Time_Start": 693.98,
      "Time_End": 703.74,
      "Text": " X systems, hooray. Or you can maintain every Cisco router, apparently. But yeah, so like, the dumping"
    },
    {
      "Time_Start": 703.74,
      "Time_End": 710.94,
      "Text": " memory combined with the remote console could be pretty killer, especially when you consider that Cisco"
    },
    {
      "Time_Start": 710.94,
      "Time_End": 720.4200000000001,
      "Text": " devices store their hashes in config files and in VRAM. So if I could actually get that memory dumping"
    },
    {
      "Time_Start": 720.54,
      "Time_End": 728.0999999999999,
      "Text": " side of things working, then I could dump the hashes and use those to log into the console. Okay, so that was"
    },
    {
      "Time_Start": 728.0999999999999,
      "Time_End": 736.8199999999999,
      "Text": " network management. I'm really gonna have to pick up the pace here. So let's talk industrial electrical. So"
    },
    {
      "Time_Start": 736.9399999999999,
      "Time_End": 743.74,
      "Text": " ADAB-8 is the GOOSE protocol. Some of you will probably be familiar with GOOSE. It's pretty, pretty"
    },
    {
      "Time_Start": 743.74,
      "Time_End": 754.14,
      "Text": " popular. GOOSE stands for generic object-oriented substation events. And it is described in the IEC"
    },
    {
      "Time_Start": 754.14,
      "Time_End": 765.26,
      "Text": " 61850 standard. Basically, this is a protocol that's used in substations so that smart devices within a"
    },
    {
      "Time_Start": 765.26,
      "Time_End": 772.94,
      "Text": " power station can communicate with each other. And they can also send out events for like, you know,"
    },
    {
      "Time_Start": 772.94,
      "Time_End": 782.1,
      "Text": " voltage measurement, fault detection, etc. It's a PubSub model. And you can actually, they apparently do"
    },
    {
      "Time_Start": 782.1,
      "Time_End": 791.7800000000001,
      "Text": " like IO through this protocol also. But yeah, so they actually tried to add some security to this protocol"
    },
    {
      "Time_Start": 791.7800000000001,
      "Time_End": 800.86,
      "Text": " with the IEC 62351 standard. But the problem was that the latency requirements in these environments were"
    },
    {
      "Time_Start": 800.86,
      "Time_End": 810.86,
      "Text": " so low that they actually, nobody uses the security because they can't. So yeah, still pretty widely"
    },
    {
      "Time_Start": 810.86,
      "Time_End": 820.62,
      "Text": " unsecured. This is kind of what that protocol looks like on the wire. App ID, byte length, or two byte"
    },
    {
      "Time_Start": 820.62,
      "Time_End": 833.98,
      "Text": " length, a couple of reserved fields, and then ASM1 encoded payload. Easy peasy. Used in smart grid and"
    },
    {
      "Time_Start": 833.98,
      "Time_End": 843.54,
      "Text": " intelligent electronic devices and general IO devices within a power substation. But yeah, basically I could see"
    },
    {
      "Time_Start": 843.9,
      "Time_End": 852.66,
      "Text": " being able to abuse this by like, you know, those events are sent to multicast or broadcast on the Ethernet. So you can"
    },
    {
      "Time_Start": 852.66,
      "Time_End": 860.5799999999999,
      "Text": " just push out your own events and cause, you know, all kinds of havoc in a power substation. Also theoretically"
    },
    {
      "Time_Start": 860.58,
      "Time_End": 866.7800000000001,
      "Text": " possible to control those IO devices to, you know, do whatever you want to do."
    },
    {
      "Time_Start": 869.62,
      "Time_End": 886.26,
      "Text": " KEPCO. So 89 3D is the KEPCO PLC interoperability protocol. KEPCO is Korea Electric Power Corporation. And this"
    },
    {
      "Time_Start": 886.26,
      "Time_End": 894.54,
      "Text": " protocol is basically, so Korea started installing a bunch of smart meters on everybody's houses, but didn't have a"
    },
    {
      "Time_Start": 894.54,
      "Time_End": 903.3,
      "Text": " way to talk to all of those smart meters in like, you know, specifically like rural areas and stuff like that. So they"
    },
    {
      "Time_Start": 903.3,
      "Time_End": 910.62,
      "Text": " came up with this protocol in order to be able to communicate with the smart meters over the power lines, like the"
    },
    {
      "Time_Start": 910.62,
      "Time_End": 921.0600000000001,
      "Text": " electrical power lines. So I couldn't find any protocol specifics on this one, but I found a few papers that kind of, you"
    },
    {
      "Time_Start": 921.0600000000001,
      "Time_End": 930.66,
      "Text": " know, danced around the topic a little bit. So like this one was about AMI protocols for two-way communication and KAMI. I"
    },
    {
      "Time_Start": 930.66,
      "Time_End": 937.98,
      "Text": " don't think this is actually the protocol because like that end of field stuff makes me think it's actually a serial"
    },
    {
      "Time_Start": 937.98,
      "Time_End": 957.02,
      "Text": " protocol. And then a couple other papers. Again, like none of these, like they all gave little clues about what AMI and PLC"
    },
    {
      "Time_Start": 957.9,
      "Time_End": 966.94,
      "Text": " interoperability would look like. But none of them actually talked about the specific protocol itself. So I'm kind of still in the"
    },
    {
      "Time_Start": 966.94,
      "Time_End": 979.74,
      "Text": " dark a little bit on that one. But yeah, so like I said, it's used for allowing AMI smart meters to talk back home over PLC"
    },
    {
      "Time_Start": 979.82,
      "Time_End": 989.1400000000001,
      "Text": " infrastructure. But you could theoretically use this to cut off somebody's power or possibly use it to get free electricity"
    },
    {
      "Time_Start": 989.1400000000001,
      "Time_End": 994.3800000000001,
      "Text": " depending on, you know, what kind of things they're monitoring across the wire."
    },
    {
      "Time_Start": 997.6600000000001,
      "Time_End": 1013.46,
      "Text": " And speaking of PLC, 88E1 is the HomePlug AV protocol. So HomePlug is kind of a catch-all protocol spec for power line"
    },
    {
      "Time_Start": 1013.46,
      "Time_End": 1023.1,
      "Text": " communications. It's actually, there are three different interoperable standards. There's HomePlug AV, which is mainly used for"
    },
    {
      "Time_Start": 1023.1,
      "Time_End": 1034.06,
      "Text": " in-home power line communications, speeds up to 500 megabits. HomePlug AV2 is the same, but just with higher bandwidth. And then"
    },
    {
      "Time_Start": 1034.06,
      "Time_End": 1045.46,
      "Text": " HomePlug GreenPHY is actually kind of cool. That's used mainly at like electric vehicle charging stations. So you plug it in and it"
    },
    {
      "Time_Start": 1045.46,
      "Time_End": 1055.14,
      "Text": " does like a little like authentication handshake thing over this HomePlug GreenPHY and then it unlocks it and allows you to charge your"
    },
    {
      "Time_Start": 1055.14,
      "Time_End": 1069.5,
      "Text": " vehicle. Okay, so this is actually one of the best secured protocols that I'm going to be talking about. They do 128-bit AES"
    },
    {
      "Time_Start": 1069.5,
      "Time_End": 1082.94,
      "Text": " encryption on the wire between devices. They have a rotating network encryption key that rotates every hour or so. And then new stations can"
    },
    {
      "Time_Start": 1082.94,
      "Time_End": 1093.46,
      "Text": " join a network as long as they have a network membership key. And then you can also pull in new devices into your network as long as you have"
    },
    {
      "Time_Start": 1093.46,
      "Time_End": 1104.38,
      "Text": " that device. It's called either a device access key or a device encryption key. So all of this is done so that, you know, some random person can't"
    },
    {
      "Time_Start": 1104.38,
      "Time_End": 1114.78,
      "Text": " just plug one of these adapters into an outlet on the outside of your house and get onto your network. And that's what the protocol looks like."
    },
    {
      "Time_Start": 1114.78,
      "Time_End": 1134.06,
      "Text": " This protocol is super annoying, but I put a bunch of specs again. So basically, yeah, just you read them. I don't want to. Okay, so yeah, this is basically"
    },
    {
      "Time_Start": 1134.06,
      "Time_End": 1145.5,
      "Text": " like with HomePlug AV, you've got these two devices that plug into wall outlets and then you can connect them to your network on either end and it'll send the network"
    },
    {
      "Time_Start": 1145.5,
      "Time_End": 1158.6599999999999,
      "Text": " traffic over the power lines in your house. So it's basically used for whole home Ethernet. I actually, back in the day, used one of these as a Wi-Fi extender in my house"
    },
    {
      "Time_Start": 1158.7,
      "Time_End": 1171.5400000000002,
      "Text": " because my house is basically a Faraday cage and I could not get Wi-Fi upstairs no matter what I tried. So I used one of these. But yeah, if you can figure out those network"
    },
    {
      "Time_Start": 1171.5400000000002,
      "Time_End": 1186.8200000000002,
      "Text": " management keys or the device encryption keys, you can build your own kind of malicious network. But, you know, getting the keys is the hard part because you have to"
    },
    {
      "Time_Start": 1186.82,
      "Time_End": 1207.3,
      "Text": " already be on the network in order to get the keys. But yeah, there's also cases where these things are used in like apartment complexes and stuff like that. So you could actually be on a power line network with your neighbors and not even realize that you're on the same network as your neighbors."
    },
    {
      "Time_Start": 1209.6599999999999,
      "Time_End": 1213.4199999999998,
      "Text": " Okay, so transportation. This is where stuff starts getting really interesting."
    },
    {
      "Time_Start": 1217.82,
      "Time_End": 1237.82,
      "Text": " Okay, so 99FE is TechMP, the Technically Enhanced Capture Module Protocol. So this Ether type was registered by ASAM, but the actual protocol itself was developed by Technica Engineering."
    },
    {
      "Time_Start": 1238.82,
      "Time_End": 1256.02,
      "Text": " This is designed to work with a capture module inside of a vehicle in order to pull out all of the CAN and FlexRay data and you can actually like replay that back onto the bus, which is kind of cool."
    },
    {
      "Time_Start": 1257.02,
      "Time_End": 1271.02,
      "Text": " The protocol itself is like a lot of overhead for what the protocol is doing. So basically like the really light blue is all just like regular Ethernet standard stuff."
    },
    {
      "Time_Start": 1271.02,
      "Time_End": 1289.02,
      "Text": " The medium blue is all of the overhead on this protocol. It's basically just like a bunch of like identification things and like timestamps and stuff. And then the dark blue is the actual like CAN or FlexRay payload."
    },
    {
      "Time_Start": 1289.02,
      "Time_End": 1318.02,
      "Text": " So as far as the TechMP protocol itself, it doesn't really do much. But still, you know, the replay stuff is cool. So yeah, you know, allow remote diagnostics of in-vehicle networks. You need to have a capture module inside the vehicle in order to access it. Possibly useful in replay attacks."
    },
    {
      "Time_Start": 1319.02,
      "Time_End": 1336.02,
      "Text": " Okay, so WAVE. This one, if you're, you know, following along with current events, you've probably heard of WAVE. 88DC is the WAVE short message protocol. WAVE is wireless access in vehicular environments."
    },
    {
      "Time_Start": 1336.02,
      "Time_End": 1365.02,
      "Text": " Basically, so like imagine autonomous vehicles, they can communicate with each other. They can communicate with like stoplights and stuff, like emergency vehicles can switch stoplights using this kind of protocol. And they can also communicate with like infrastructure, like signs and stuff for doing location-based advertisements, because of course that's what they want to do."
    },
    {
      "Time_Start": 1367.02,
      "Time_End": 1388.02,
      "Text": " So the short message protocol, again, ASM1 encoded. You've got a version, PSID. Then you've got several possible extensions, et cetera, et cetera."
    },
    {
      "Time_Start": 1391.02,
      "Time_End": 1393.02,
      "Text": " Yeah, I don't know. It's cool."
    },
    {
      "Time_Start": 1394.02,
      "Time_End": 1402.02,
      "Text": " So as far as uses go, I already talked about that again. Autonomous vehicles talking to each other, talking to the environment."
    },
    {
      "Time_Start": 1403.02,
      "Time_End": 1418.02,
      "Text": " So it's designed to keep riders and pedestrians and emergency vehicles safe, because they can all talk to each other and, you know, work things out without having to rely on human intervention."
    },
    {
      "Time_Start": 1419.02,
      "Time_End": 1439.02,
      "Text": " But it also allows for remote control of cars. You can modify traffic lights. I don't know if you guys remember the old days of like having a strobe light on the dash of your car, because that's the way emergency vehicles used to switch the lights to green as they were driving up. It would be like a strobe light thing."
    },
    {
      "Time_Start": 1440.02,
      "Time_End": 1444.02,
      "Text": " So you don't have to do that anymore. You can use this Ethernet protocol."
    },
    {
      "Time_Start": 1445.02,
      "Time_End": 1458.02,
      "Text": " But yeah, I could also envision some abuses on the location-based ads, like seeing where somebody you're stalking is driving is kind of bad."
    },
    {
      "Time_Start": 1459.02,
      "Time_End": 1464.02,
      "Text": " Okay, so if cars aren't doing it for you, how about trains?"
    },
    {
      "Time_Start": 1465.02,
      "Time_End": 1485.02,
      "Text": " So the Ethernet 89.4c is for the train communication network protocol. This is basically two separate protocols. Ethernet train backbone, ETB, is a replacement for the older wire train bus standard."
    },
    {
      "Time_Start": 1486.02,
      "Time_End": 1500.02,
      "Text": " And then Ethernet consist network. Consist is like another name for like a train car. Ethernet consist network replaces the multifunction vehicle bus standard."
    },
    {
      "Time_Start": 1500.02,
      "Time_End": 1515.02,
      "Text": " So the Ethernet train backbone is basically the entire train communicating. It'll tell you how the cars are oriented, how long the train is, and all that."
    },
    {
      "Time_Start": 1516.02,
      "Time_End": 1526.02,
      "Text": " And then the Ethernet consist network is within one train car, all of the systems there working together."
    },
    {
      "Time_Start": 1527.02,
      "Time_End": 1539.02,
      "Text": " These standards, so the IEC standards there, they're available. But they cost like 400 bucks each to get access to them."
    },
    {
      "Time_Start": 1540.02,
      "Time_End": 1552.02,
      "Text": " And I mean, I like you guys, but I'm not spending like a grand on a single DEF CON slide. So if you want access to those standards, they're out there."
    },
    {
      "Time_Start": 1553.02,
      "Time_End": 1569.02,
      "Text": " But yeah, so if you've ridden on the monorail out there, you know, like whenever it pulls up to a stop and it lines up with the doors and then the doors automatically open, that's all handled by this kind of Ethernet protocol."
    },
    {
      "Time_Start": 1570.02,
      "Time_End": 1585.02,
      "Text": " But because of that, you know, if you get access to that protocol, maybe you could open the doors while the train is in motion, or maybe you could tell the train that it's shorter or longer than it actually is kind of things."
    },
    {
      "Time_Start": 1585.02,
      "Time_End": 1605.02,
      "Text": " Okay, medical, this was a failure on my part. This was the only section where I came up pretty dry for the entire thing. But I'm still going to talk about the Ethernet protocols because, you know, they exist."
    },
    {
      "Time_Start": 1606.02,
      "Time_End": 1614.02,
      "Text": " I just couldn't find any specifics on like any of them. I'm not going to be writing any kind of like hospital ransomware anytime soon."
    },
    {
      "Time_Start": 1615.02,
      "Time_End": 1630.02,
      "Text": " Okay, so 885B and 885C are for the Philips Clinical Network. I am pretty sure this is related to IntelliView. Everything that I've read indicates that this is related to IntelliView."
    },
    {
      "Time_Start": 1631.02,
      "Time_End": 1647.02,
      "Text": " So I went out and bought an MP50 heart monitor, like one of those big like buy your hospital bed heart monitor things. But I could only ever get it talking UDP. I can't get it to talk Ethernet no matter what I do."
    },
    {
      "Time_Start": 1647.02,
      "Time_End": 1661.02,
      "Text": " So I'm thinking now that maybe there's some other piece to this puzzle like this Philips Agilent Care Net network switch is like a specifically designed network switch for these clinical network environments."
    },
    {
      "Time_Start": 1662.02,
      "Time_End": 1684.02,
      "Text": " So maybe I need to pick up one of those. There's also this Philips Information Center or PIC IX, which is kind of like a database, like a server side of things. So maybe I need to get access to that, but I couldn't find it available anywhere without talking to a sales guy."
    },
    {
      "Time_Start": 1685.02,
      "Time_End": 1695.02,
      "Text": " It could be that I'm just wrong about all of this. That's entirely possible. But you know, hopefully someday I'll find out more about the Philips Clinical Network Protocol."
    },
    {
      "Time_Start": 1696.02,
      "Time_End": 1714.02,
      "Text": " So these uses and abuses, I'm just making guesses based on the UDP traffic that I was able to get out of that heart monitor. So you can admit and discharge patients. It's constantly sending out vitals and patient condition type things."
    },
    {
      "Time_Start": 1715.02,
      "Time_End": 1739.02,
      "Text": " And of course, alarms and exporting data. So, you know, the abuses are pretty obvious. Like you can, you know, spoof cardiac arrest or something like that and cause interventions to happen or, you know, you could spoof normal activity when bad things are happening kind of thing."
    },
    {
      "Time_Start": 1740.02,
      "Time_End": 1745.02,
      "Text": " And then, you know, personal identifying information disclosure, of course."
    },
    {
      "Time_Start": 1746.02,
      "Time_End": 1755.02,
      "Text": " And then ethertypes 815F through 8163 are all registered to the Massachusetts General Hospital."
    },
    {
      "Time_Start": 1756.02,
      "Time_End": 1763.02,
      "Text": " They've got five ethertypes and I can't find anything on any of them. It's so frustrating."
    },
    {
      "Time_Start": 1764.02,
      "Time_End": 1773.02,
      "Text": " So Massachusetts General Hospital is actually fed in by Harvard Medical and they've got their own computer science department."
    },
    {
      "Time_Start": 1774.02,
      "Time_End": 1785.02,
      "Text": " They've got lots of patents around transferring patient scans and imaging and stuff over a network. So maybe these protocols have to do with that."
    },
    {
      "Time_Start": 1786.02,
      "Time_End": 1788.02,
      "Text": " Oh yeah, he's such a nice guy."
    },
    {
      "Time_Start": 1788.02,
      "Time_End": 1805.02,
      "Text": " So I don't know if any of you have heard of Impact Cybertrust, but it's like a website where researchers and professionals can come together and share like PCAPs and protocol data specs and stuff like that. Really great site."
    },
    {
      "Time_Start": 1806.02,
      "Time_End": 1815.02,
      "Text": " So I came across them when I was looking into Massachusetts General Hospital because they had uploaded a bunch of PCAPs to this site."
    },
    {
      "Time_Start": 1815.02,
      "Time_End": 1817.02,
      "Text": " And I was like, oh my God, that's amazing."
    },
    {
      "Time_Start": 1818.02,
      "Time_End": 1825.02,
      "Text": " And then I looked at the descriptions of the PCAPs and they were all taken from within Phillips Clinical Network environments."
    },
    {
      "Time_Start": 1826.02,
      "Time_End": 1830.02,
      "Text": " And I was like, that still works. I still need that."
    },
    {
      "Time_Start": 1831.02,
      "Time_End": 1837.02,
      "Text": " But unfortunately, they've got like restrictions on sharing the information on some of these."
    },
    {
      "Time_Start": 1838.02,
      "Time_End": 1844.02,
      "Text": " They've got like different levels of sharing, like some of them are restricted, some are quasi-restricted, some are unrestricted."
    },
    {
      "Time_Start": 1845.02,
      "Time_End": 1850.02,
      "Text": " And the restriction placed on this would mean that I couldn't talk about it at DEF CON at all."
    },
    {
      "Time_Start": 1851.02,
      "Time_End": 1857.02,
      "Text": " So I didn't end up looking at those PCAPs anyways, because I wouldn't have been able to use the information."
    },
    {
      "Time_Start": 1858.02,
      "Time_End": 1866.02,
      "Text": " But if you're curious, go look at Impact Cybertrust, create an account and get access to those things."
    },
    {
      "Time_Start": 1868.02,
      "Time_End": 1872.02,
      "Text": " So yeah, they do things."
    },
    {
      "Time_Start": 1875.02,
      "Time_End": 1887.02,
      "Text": " Okay, and now, this is one that didn't fit anywhere else, but was pretty cool, so I wanted to include it."
    },
    {
      "Time_Start": 1889.02,
      "Time_End": 1896.02,
      "Text": " So EtherType-889E is Remote Tech Hazardous Duty Robot Protocol."
    },
    {
      "Time_Start": 1897.02,
      "Time_End": 1902.02,
      "Text": " These are basically Northrop Grumman unmanned ground vehicles."
    },
    {
      "Time_Start": 1903.02,
      "Time_End": 1909.02,
      "Text": " So these are basically like the bomb defusal robot type things."
    },
    {
      "Time_Start": 1911.02,
      "Time_End": 1917.02,
      "Text": " So I think, you know, obviously I couldn't find details on the protocol itself."
    },
    {
      "Time_Start": 1918.02,
      "Time_End": 1923.02,
      "Text": " But I think this one is related to their Andros Titus line."
    },
    {
      "Time_Start": 1924.02,
      "Time_End": 1934.02,
      "Text": " Specifically because they've got a press release where they're touting all of the new Ethernet features of their Titus robots."
    },
    {
      "Time_Start": 1937.02,
      "Time_End": 1946.02,
      "Text": " So just because I couldn't get access to the network protocol doesn't mean we can't make some guesses about how it would work."
    },
    {
      "Time_Start": 1947.02,
      "Time_End": 1965.02,
      "Text": " Because back in 2002, there was this guy that his master thesis at the University of Tennessee was actually all about the serial control protocol for the Andros Mark IV Hazardous Duty Robot."
    },
    {
      "Time_Start": 1966.02,
      "Time_End": 1970.02,
      "Text": " It was basically like he wanted to be able to control this robot from his computer."
    },
    {
      "Time_Start": 1971.02,
      "Time_End": 1973.02,
      "Text": " So he pulled apart the serial protocol."
    },
    {
      "Time_Start": 1974.02,
      "Time_End": 1983.02,
      "Text": " And the way that works is basically it's a 22-byte packet of command data and then one byte checksum."
    },
    {
      "Time_Start": 1984.02,
      "Time_End": 1989.02,
      "Text": " And basically each one of those bytes is dedicated to a particular part of the robot."
    },
    {
      "Time_Start": 1990.02,
      "Time_End": 1998.02,
      "Text": " So like, you know, one byte will be like moving the treads and one byte will be like raising the arm kind of thing, you know."
    },
    {
      "Time_Start": 2000.02,
      "Time_End": 2005.02,
      "Text": " And then there was this byte eight that was the weapons byte."
    },
    {
      "Time_Start": 2006.02,
      "Time_End": 2012.02,
      "Text": " Where basically, you know, you got weapon one, weapon two, weapon vehicle, and weapon shotgun."
    },
    {
      "Time_Start": 2016.02,
      "Time_End": 2018.02,
      "Text": " Okay, so yeah."
    },
    {
      "Time_Start": 2019.02,
      "Time_End": 2021.02,
      "Text": " Obviously that was the serial protocol."
    },
    {
      "Time_Start": 2021.02,
      "Time_End": 2023.02,
      "Text": " The Ethernet protocol is probably different."
    },
    {
      "Time_Start": 2023.02,
      "Time_End": 2029.02,
      "Text": " They're going to have, you know, functionality for like upgrading firmware and stuff like that."
    },
    {
      "Time_Start": 2030.02,
      "Time_End": 2038.02,
      "Text": " But it does kind of give you an idea of what kind of things that you could do with this kind of protocol."
    },
    {
      "Time_Start": 2041.02,
      "Time_End": 2050.02,
      "Text": " Yeah, and also I don't know how much they would change the protocol from version to version, you know."
    },
    {
      "Time_Start": 2050.02,
      "Time_End": 2052.02,
      "Text": " Because you have to like retrain on these things."
    },
    {
      "Time_Start": 2052.02,
      "Time_End": 2058.02,
      "Text": " And they're really like, you know, they're delicate machinery doing delicate operations and stuff."
    },
    {
      "Time_Start": 2058.02,
      "Time_End": 2061.02,
      "Text": " You don't want to have to train somebody from scratch every single time."
    },
    {
      "Time_Start": 2062.02,
      "Time_End": 2071.02,
      "Text": " But anyways, yeah, they're used for bomb disposal and to handle dangerous situations without putting actual people in danger."
    },
    {
      "Time_Start": 2073.02,
      "Time_End": 2081.02,
      "Text": " But of course, you know, if you get access to this protocol, you can do things like, you know, wait until they're about to do something."
    },
    {
      "Time_Start": 2081.02,
      "Time_End": 2085.02,
      "Text": " And then just like change the position of the arm on them."
    },
    {
      "Time_Start": 2086.02,
      "Time_End": 2092.02,
      "Text": " Or, you know, actually like legit control the weapons on the robot."
    },
    {
      "Time_Start": 2094.02,
      "Time_End": 2096.02,
      "Text": " All right, so that's all the protocols that I was going to talk about today."
    },
    {
      "Time_Start": 2096.02,
      "Time_End": 2100.02,
      "Text": " So I've got a couple of demos that I've got worked out."
    },
    {
      "Time_Start": 2101.02,
      "Time_End": 2113.02,
      "Text": " The first one is using the MOP protocol to get access to the management console on a Cisco 1800 series router."
    },
    {
      "Time_Start": 2115.02,
      "Time_End": 2121.02,
      "Text": " Basically, you know, I wish I had gotten the MOP dump side of things working on this."
    },
    {
      "Time_Start": 2121.02,
      "Time_End": 2123.02,
      "Text": " Because that would have been the icing on the cake."
    },
    {
      "Time_Start": 2124.02,
      "Time_End": 2128.02,
      "Text": " But basically, this is my interface config."
    },
    {
      "Time_Start": 2128.02,
      "Time_End": 2131.02,
      "Text": " Notice there's no mention of MOP whatsoever."
    },
    {
      "Time_Start": 2132.02,
      "Time_End": 2136.02,
      "Text": " Because, you know, if you don't mention MOP, then it's enabled."
    },
    {
      "Time_Start": 2136.02,
      "Time_End": 2143.02,
      "Text": " And if you want it disabled, then you have to say like, no MOP enable in your interface config."
    },
    {
      "Time_Start": 2145.02,
      "Time_End": 2148.02,
      "Text": " Okay, so that's demo one."
    },
    {
      "Time_Start": 2148.02,
      "Time_End": 2149.02,
      "Text": " Oh no, what did I do?"
    },
    {
      "Time_Start": 2149.02,
      "Time_End": 2150.02,
      "Text": " Okay."
    },
    {
      "Time_Start": 2152.02,
      "Time_End": 2155.02,
      "Text": " Let me open up the video."
    },
    {
      "Time_Start": 2170.02,
      "Time_End": 2171.02,
      "Text": " Okay, so yeah."
    },
    {
      "Time_Start": 2171.02,
      "Time_End": 2173.02,
      "Text": " Basically, like this couldn't be simpler."
    },
    {
      "Time_Start": 2173.02,
      "Time_End": 2177.02,
      "Text": " I'm just using the MOP RC Linux utility."
    },
    {
      "Time_Start": 2177.02,
      "Time_End": 2180.02,
      "Text": " I give it the MAC address of the router I want to connect to."
    },
    {
      "Time_Start": 2182.02,
      "Time_End": 2188.02,
      "Text": " And it basically like drops me straight into a Cisco iOS shell."
    },
    {
      "Time_Start": 2188.02,
      "Time_End": 2191.02,
      "Text": " It's like a fully interactive shell too."
    },
    {
      "Time_Start": 2191.02,
      "Time_End": 2193.02,
      "Text": " It's got like tab completion and everything."
    },
    {
      "Time_Start": 2195.02,
      "Time_End": 2202.02,
      "Text": " So yeah, basically you don't have to be on the management interface in order to access the management console."
    },
    {
      "Time_Start": 2202.02,
      "Time_End": 2203.02,
      "Text": " You can just be on any interface."
    },
    {
      "Time_Start": 2203.02,
      "Time_End": 2211.02,
      "Text": " And as long as they haven't disabled MOP, then you can get access to the management console."
    },
    {
      "Time_Start": 2213.02,
      "Time_End": 2215.02,
      "Text": " So that's that one."
    },
    {
      "Time_Start": 2228.02,
      "Time_End": 2230.02,
      "Text": " Okay, so that was that demo."
    },
    {
      "Time_Start": 2230.02,
      "Time_End": 2241.02,
      "Text": " Second demo is using the HomePlug AV protocol to actually pull a device encryption key and a network management key from an adapter."
    },
    {
      "Time_Start": 2243.02,
      "Time_End": 2254.02,
      "Text": " This script uses some Qualcomm Atheros specific functionality, but it should work on all Qualcomm Atheros based HomePlug adapters."
    },
    {
      "Time_Start": 2255.02,
      "Time_End": 2259.02,
      "Text": " It sends the get software request."
    },
    {
      "Time_Start": 2261.02,
      "Time_End": 2270.02,
      "Text": " Basically, I send that to broadcast and all of the responses I get back, I make a note of their firmware version."
    },
    {
      "Time_Start": 2270.02,
      "Time_End": 2278.02,
      "Text": " And then I make a note of their MAC address to use for the next command I send, which is VS module operation,"
    },
    {
      "Time_Start": 2278.02,
      "Time_End": 2286.02,
      "Text": " which gives me a lot of detail back from that MAC address, including those keys."
    },
    {
      "Time_Start": 2287.02,
      "Time_End": 2297.02,
      "Text": " So I ran this against the TP-Link TLWPA8630, which is actually the device that I used to use in my house."
    },
    {
      "Time_Start": 2297.02,
      "Time_End": 2299.02,
      "Text": " I do not use it anymore."
    },
    {
      "Time_Start": 2300.02,
      "Time_End": 2312.02,
      "Text": " But yeah, so the thing about this is you have to actually be on the network in order to get access to these keys."
    },
    {
      "Time_Start": 2316.02,
      "Time_End": 2324.02,
      "Text": " But you could use this to dump those keys so that you could bring back an adapter later on sometime or whatever."
    },
    {
      "Time_Start": 2325.02,
      "Time_End": 2329.02,
      "Text": " This is my really ugly, scapy script that I wrote."
    },
    {
      "Time_Start": 2329.02,
      "Time_End": 2337.02,
      "Text": " Again, I included this in the media server stuff so you do not have to worry about the fact that you cannot read anything that is up on the screen right now."
    },
    {
      "Time_Start": 2339.02,
      "Time_End": 2348.02,
      "Text": " But yeah, so basically it just loops, sends the first packet to broadcast, listens for any responses,"
    },
    {
      "Time_Start": 2348.02,
      "Time_End": 2355.02,
      "Text": " and then sends the second one to that specific MAC address and parses out the key information."
    },
    {
      "Time_Start": 2356.02,
      "Time_End": 2358.02,
      "Text": " All right, so now we will look at that."
    },
    {
      "Time_Start": 2379.02,
      "Time_End": 2384.02,
      "Text": " So yeah, you just run the script, and then you will see it comes back with a version."
    },
    {
      "Time_Start": 2385.02,
      "Time_End": 2389.02,
      "Text": " That is the version of the HomePlug adapter that it found."
    },
    {
      "Time_Start": 2389.02,
      "Time_End": 2390.02,
      "Text": " Oh, man."
    },
    {
      "Time_Start": 2391.02,
      "Time_End": 2397.02,
      "Text": " And then it spits out the network management key and the device encryption key."
    },
    {
      "Time_Start": 2397.02,
      "Time_End": 2404.02,
      "Text": " So then from there, you could either use that to join your own adapter to see what is going on,"
    },
    {
      "Time_Start": 2404.02,
      "Time_End": 2410.02,
      "Text": " you could either use that to join your own adapter to the network using the network management key,"
    },
    {
      "Time_Start": 2410.02,
      "Time_End": 2417.02,
      "Text": " or you could force adapters on their network to join your own network using the device encryption key."
    },
    {
      "Time_Start": 2418.02,
      "Time_End": 2420.02,
      "Text": " So that is that."
    },
    {
      "Time_Start": 2421.02,
      "Time_End": 2422.02,
      "Text": " Hey."
    },
    {
      "Time_Start": 2430.02,
      "Time_End": 2441.02,
      "Text": " Okay, so hopefully at the end of this talk you have seen how many crazy things there are out there on layer 2 of a network."
    },
    {
      "Time_Start": 2443.02,
      "Time_End": 2449.02,
      "Text": " You know, they are local only, but still so much fun to be had, especially when you are in weird environments."
    },
    {
      "Time_Start": 2450.02,
      "Time_End": 2454.02,
      "Text": " And this isn't even close to what all is out there."
    },
    {
      "Time_Start": 2454.02,
      "Time_End": 2464.02,
      "Text": " There are, like, well over 3,500 registered Ether types on IEEE's public listings, and I talked about, like, 12."
    },
    {
      "Time_Start": 2465.02,
      "Time_End": 2468.02,
      "Text": " So there is still lots of stuff out there."
    },
    {
      "Time_Start": 2469.02,
      "Time_End": 2474.02,
      "Text": " So these are some of the places I found the most helpful in my research efforts."
    },
    {
      "Time_Start": 2474.02,
      "Time_End": 2476.02,
      "Text": " RFCs, of course, are the best."
    },
    {
      "Time_Start": 2476.02,
      "Time_End": 2479.02,
      "Text": " IEEE standards are also good."
    },
    {
      "Time_Start": 2479.02,
      "Time_End": 2487.02,
      "Text": " And if there is a Wireshark detector, then you are absolutely golden because somebody else already did the work for you."
    },
    {
      "Time_Start": 2489.02,
      "Time_End": 2496.02,
      "Text": " IEC standards are a little less reliable and often cost a lot of money."
    },
    {
      "Time_Start": 2496.02,
      "Time_End": 2500.02,
      "Text": " But, you know, if you can get access to them, then that is great."
    },
    {
      "Time_Start": 2500.02,
      "Time_End": 2508.02,
      "Text": " Research papers and patents, again, you know, not as good, but sometimes contain useful information."
    },
    {
      "Time_Start": 2509.02,
      "Time_End": 2512.02,
      "Text": " And, of course, lots of Googling and patience."
    },
    {
      "Time_Start": 2513.02,
      "Time_End": 2518.02,
      "Text": " And that was just kind of a fun thing that I found while I was doing all of this work."
    },
    {
      "Time_Start": 2518.02,
      "Time_End": 2529.02,
      "Text": " Is this guy who makes the ultimate PCAP, which is basically a single PCAP with every single protocol he could possibly cram into it."
    },
    {
      "Time_Start": 2529.02,
      "Time_End": 2532.02,
      "Text": " All in one PCAP. It is really awesome."
    },
    {
      "Time_Start": 2533.02,
      "Time_End": 2539.02,
      "Text": " But, yeah, and then eBay is awesome for grabbing random devices that you can't find anywhere else."
    },
    {
      "Time_Start": 2539.02,
      "Time_End": 2542.02,
      "Text": " And, you know, sometimes you can find them for pretty cheap."
    },
    {
      "Time_Start": 2544.02,
      "Time_End": 2546.02,
      "Text": " But, yeah, so that is my talk."
    },
    {
      "Time_Start": 2546.02,
      "Time_End": 2549.02,
      "Text": " These are ways that you can reach out to me."
    },
    {
      "Time_Start": 2550.02,
      "Time_End": 2553.02,
      "Text": " I am on InfoSec Exchange and DEF CON Social."
    },
    {
      "Time_Start": 2554.02,
      "Time_End": 2556.02,
      "Text": " I am also on Twitter, but not really anymore."
    },
    {
      "Time_Start": 2557.02,
      "Time_End": 2560.02,
      "Text": " There is my GitHub where I will put some of this code that I wrote."
    },
    {
      "Time_Start": 2560.02,
      "Time_End": 2565.02,
      "Text": " I will probably also throw an RCP script up on my GitHub."
    },
    {
      "Time_Start": 2567.02,
      "Time_End": 2574.02,
      "Text": " You should all come to the IoT Village because Keysight has a booth over there where we are doing some Bluetooth fuzzing and it is awesome."
    },
    {
      "Time_Start": 2574.02,
      "Time_End": 2578.02,
      "Text": " So come and see me over there and you can ask me questions or whatever."
    },
    {
      "Time_Start": 2579.02,
      "Time_End": 2583.02,
      "Text": " So, yeah, that is it. Any questions?"
    },
    {
      "Time_Start": 2590.02,
      "Time_End": 2591.02,
      "Text": " Thank you."
    }
  ]
}