{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good. Okay. Today we are going to talk a little bit about the work we are doing at a global"
    },
    {
      "Time_Start": 8.540000000000001,
      "Time_End": 15.76,
      "Text": " level, fighting a proposed UN cybercrime treaty. But before I start to discuss what's on the"
    },
    {
      "Time_Start": 15.76,
      "Time_End": 20.76,
      "Text": " text of the treaty, I want to give a little of how we end up with this treaty and these"
    },
    {
      "Time_Start": 20.76,
      "Time_End": 26.92,
      "Text": " global negotiations. So there is already a global cybercrime treaty. It's not global, it's"
    },
    {
      "Time_Start": 26.92,
      "Time_End": 32.54,
      "Text": " international. It's the Budapest Convention and has been the main existing treaty for"
    },
    {
      "Time_Start": 32.54,
      "Time_End": 38.46,
      "Text": " international cooperation, like one country helping another investigate a crime in"
    },
    {
      "Time_Start": 38.46,
      "Time_End": 43.46,
      "Text": " cross-border spying powers. It was finalized in 2001 and recently has been extended next year."
    },
    {
      "Time_Start": 43.46,
      "Time_End": 48.46,
      "Text": " Next. Next. Yeah. And it has, we have been criticizing that treaty for many, many, many"
    },
    {
      "Time_Start": 56.96,
      "Time_End": 63.620000000000005,
      "Text": " problems. And Budapest has become the, the fact of standard for many countries. So"
    },
    {
      "Time_Start": 63.620000000000005,
      "Time_End": 69.66,
      "Text": " Budapest has like 64 countries, next, and many of the countries have already adopted many of"
    },
    {
      "Time_Start": 69.66,
      "Time_End": 76.24,
      "Text": " the computer crimes that are in Budapest. However, um, and many countries have also used it"
    },
    {
      "Time_Start": 76.24,
      "Time_End": 81.32,
      "Text": " as a model law, even if they have not ratified. However, some countries like Russia has"
    },
    {
      "Time_Start": 81.32,
      "Time_End": 86.58,
      "Text": " objected to the Budapest Convention because sitting concerns that it infringed on our"
    },
    {
      "Time_Start": 86.58,
      "Time_End": 93.78,
      "Text": " sovereignty by allowing other nations to investigate a crime in their own country. That's"
    },
    {
      "Time_Start": 93.78,
      "Time_End": 98.53999999999999,
      "Text": " one of the main reasons why Russia proposed a new cybercrime convention at the UN in"
    },
    {
      "Time_Start": 98.54,
      "Time_End": 105.42,
      "Text": " 2017. At that moment, we thought this is not going to go forward. But in 2019, the UN"
    },
    {
      "Time_Start": 105.42,
      "Time_End": 110.42,
      "Text": " General Assembly adopted a resolution that create this ad hoc committee. Next. Um, okay, I"
    },
    {
      "Time_Start": 114.08000000000001,
      "Time_End": 119.92,
      "Text": " do it. This ad hoc committee, uh, tasked with the job of elaborating this proposed UN"
    },
    {
      "Time_Start": 119.92,
      "Time_End": 126.92,
      "Text": " cybercrime convention. And this proposal was put forward by Russia, Belarus, Cambodia,"
    },
    {
      "Time_Start": 126.92,
      "Time_End": 134.08,
      "Text": " China, Iran, Myanmar, Nicaragua, Syria, Venezuela. Many countries opposed it, including the"
    },
    {
      "Time_Start": 134.08,
      "Time_End": 139.92000000000002,
      "Text": " United States and the EU, and with concerns that this treaty could infringe on people's"
    },
    {
      "Time_Start": 139.92000000000002,
      "Time_End": 147.92000000000002,
      "Text": " freedom. Let's fast forward to, to 2002, and the UN just started the actual negotiations of"
    },
    {
      "Time_Start": 147.92000000000002,
      "Time_End": 154.84,
      "Text": " this draft treaty, with member states submitting some proposed steps. Russia having"
    },
    {
      "Time_Start": 154.84,
      "Time_End": 161.04,
      "Text": " illegally invade Ukraine in that moment was considered less than fully credible on"
    },
    {
      "Time_Start": 161.04,
      "Time_End": 166.18,
      "Text": " respecting sovereignty, which was his claim why the treaty, you know, didn't work in the"
    },
    {
      "Time_Start": 166.18,
      "Time_End": 172.22,
      "Text": " first place. But nevertheless, Russia got the ball rolling, and many of the proposals made it"
    },
    {
      "Time_Start": 172.22,
      "Time_End": 180.22,
      "Text": " to the first negotiating text. But geopolitics is always messy. And in 2000, as the"
    },
    {
      "Time_Start": 180.46,
      "Time_End": 185.06,
      "Text": " negotiation opposed it, many of the countries who were originally opposed to the treaty"
    },
    {
      "Time_Start": 185.06,
      "Time_End": 192.18,
      "Text": " decided to engage in the negotiations, and pursuing their own agendas. While forming alliance"
    },
    {
      "Time_Start": 192.18,
      "Time_End": 198.64,
      "Text": " in essential global negotiations is like necessary to get consensus and move, uh, move, uh,"
    },
    {
      "Time_Start": 198.64,
      "Time_End": 204.76,
      "Text": " proposals forward, it could also be complicated, because it could end up compromising the"
    },
    {
      "Time_Start": 204.76,
      "Time_End": 211.29999999999998,
      "Text": " standards of human rights protections. And regrettably, instead of progressing towards a"
    },
    {
      "Time_Start": 211.29999999999998,
      "Time_End": 217.45999999999998,
      "Text": " pro-human rights treaty, the current version of the draft, and it's called Zero Draft, which"
    },
    {
      "Time_Start": 217.45999999999998,
      "Time_End": 224.6,
      "Text": " was released two weeks ago, it's um, this, the first negotiated draft that is on the table, is"
    },
    {
      "Time_Start": 224.6,
      "Time_End": 231.1,
      "Text": " moving away from it. The Zero Draft has five chapters. One on criminalization, that we talk"
    },
    {
      "Time_Start": 231.1,
      "Time_End": 236.18,
      "Text": " about computer access, and all the color, color's crimes, and also a chapter on domestic"
    },
    {
      "Time_Start": 236.18,
      "Time_End": 242.72,
      "Text": " surveillance, cross-border surveillance, technical assistance, and proactive measures. The draft"
    },
    {
      "Time_Start": 242.72,
      "Time_End": 247.34,
      "Text": " convention has two articles on human rights. One article five, that will apply to the whole"
    },
    {
      "Time_Start": 247.34,
      "Time_End": 254.01999999999998,
      "Text": " treaty, uh, general one, and one on safeguards, that will apply only to the domestic powers."
    },
    {
      "Time_Start": 254.01999999999998,
      "Time_End": 260.71999999999997,
      "Text": " Um, this article 24 is very weak, not even strong enough, but even those articles, uh,"
    },
    {
      "Time_Start": 260.72,
      "Time_End": 266.34000000000003,
      "Text": " some countries want to delete them from the treaty. Um, interesting enough, when it comes to"
    },
    {
      "Time_Start": 266.34000000000003,
      "Time_End": 271.68,
      "Text": " international cooperation, the previous draft made clear that human rights should apply also to"
    },
    {
      "Time_Start": 271.68,
      "Time_End": 277.38000000000005,
      "Text": " the cross-border spying powers, the international cooperation chapter. However, that was"
    },
    {
      "Time_Start": 277.38000000000005,
      "Time_End": 285.38000000000005,
      "Text": " removed. Um, during the discussions leading to this Zero Draft, countries such as India, Russia,"
    },
    {
      "Time_Start": 286.24,
      "Time_End": 292.96,
      "Text": " China, Iran, Syria, Egypt, and Tonga, have even proposed to delete reference to the"
    },
    {
      "Time_Start": 292.96,
      "Time_End": 298.0,
      "Text": " international human rights obligation, this article five, which is concerning, and even"
    },
    {
      "Time_Start": 298.0,
      "Time_End": 304.0,
      "Text": " objective on the language of the limitations of domestic spying powers, making it even weaker"
    },
    {
      "Time_Start": 305.92,
      "Time_End": 311.92,
      "Text": " than Budapest. So, why we care about treaties? Treaties are binding, uh, for the countries who"
    },
    {
      "Time_Start": 312.08000000000004,
      "Time_End": 320.08000000000004,
      "Text": " decide to sign it, who are obliged to comply with it, with them. Some treaty provisions"
    },
    {
      "Time_Start": 320.08000000000004,
      "Time_End": 327.34000000000003,
      "Text": " compel states to adopt certain laws to implement such obligations. They use child, uh, the"
    },
    {
      "Time_Start": 327.34000000000003,
      "Time_End": 334.16,
      "Text": " state shall implement, shall adopt domestic legislation. And some others will say a state may"
    },
    {
      "Time_Start": 334.16,
      "Time_End": 339.96000000000004,
      "Text": " adopt domestic legislation. Sometimes a state can make reservations and say, oh, I can"
    },
    {
      "Time_Start": 340.0,
      "Time_End": 346.0,
      "Text": " exclude from that provision only if a treaty allow it. It's not always the case. And this is"
    },
    {
      "Time_Start": 347.58,
      "Time_End": 353.58,
      "Text": " problematic because, uh, when you come and have a law discussed in Congress, most of the core"
    },
    {
      "Time_Start": 355.34,
      "Time_End": 360.08,
      "Text": " features of the treaty has already been negotiated. So there are little things you can do at"
    },
    {
      "Time_Start": 360.08,
      "Time_End": 365.62,
      "Text": " the domestic level. Of course, you will try to find flexibility, these flexibilities that"
    },
    {
      "Time_Start": 365.62,
      "Time_End": 371.32,
      "Text": " could, you could use to get better safeguards in place, or better protections for human"
    },
    {
      "Time_Start": 371.32,
      "Time_End": 376.86,
      "Text": " rights, or whatever you want to include in the treaty. But this is a sour, uh, it's, it's, it's"
    },
    {
      "Time_Start": 376.86,
      "Time_End": 383.58,
      "Text": " not always useful to have flexibility because sometimes it could be problematic for human"
    },
    {
      "Time_Start": 383.58,
      "Time_End": 390.7,
      "Text": " rights. For instance, the treaty doesn't compel states to adopt mass surveillance powers, but"
    },
    {
      "Time_Start": 390.7,
      "Time_End": 396.82,
      "Text": " also doesn't foreclose it. Meaning that if a state, like the USA state, will use the"
    },
    {
      "Time_Start": 396.82,
      "Time_End": 403.62,
      "Text": " particularity standard or the more standards to limit, um, surveillance powers, others could"
    },
    {
      "Time_Start": 403.62,
      "Time_End": 409.32,
      "Text": " decide not to do that. So that, that's why it's problematic to have too much flexibility. But"
    },
    {
      "Time_Start": 409.32,
      "Time_End": 414.65999999999997,
      "Text": " sometimes it could be good because you can have people trying to advocate for better"
    },
    {
      "Time_Start": 414.66,
      "Time_End": 419.66,
      "Text": " protections, especially when it comes to criminalization. Um, so right now, uh, we are, the"
    },
    {
      "Time_Start": 423.58000000000004,
      "Time_End": 430.28000000000003,
      "Text": " assembly in 2001, that's a little, uh, the general assembly finally provide a draft"
    },
    {
      "Time_Start": 430.28000000000003,
      "Time_End": 435.28000000000003,
      "Text": " convention to the treaty. There's six sections to negotiate. It was from March 22 until 2023."
    },
    {
      "Time_Start": 438.62,
      "Time_End": 444.12,
      "Text": " And it's supposed that the treaty will be finalized in January 2024, but we don't know yet."
    },
    {
      "Time_Start": 444.12,
      "Time_End": 450.5,
      "Text": " We will see. The coming negotiations is going to be in two weeks, August 21st, and we hope the"
    },
    {
      "Time_Start": 450.5,
      "Time_End": 455.5,
      "Text": " treaty keeps negotiating. I, I think there are too many red lines in the treaty to be able to"
    },
    {
      "Time_Start": 455.5,
      "Time_End": 461.04,
      "Text": " get a consensus, but we don't know. And so far, according to the timeline, it's going to be"
    },
    {
      "Time_Start": 461.04,
      "Time_End": 466.04,
      "Text": " finalized in January. So, why, uh, what we are doing here. So, let's discuss the chapter of"
    },
    {
      "Time_Start": 466.64000000000004,
      "Time_End": 471.64000000000004,
      "Text": " criminalization. A matter of time, I won't be able to deal with everything. We are not going to."
    },
    {
      "Time_Start": 476.08000000000004,
      "Time_End": 481.08000000000004,
      "Text": " So, but, um, the treaty is very broad, and so we don't have the time with everything. But, um, one"
    },
    {
      "Time_Start": 484.12,
      "Time_End": 490.58000000000004,
      "Text": " of the main concerns is the crimes that are in the criminalization section. Usually these are"
    },
    {
      "Time_Start": 490.58,
      "Time_End": 496.74,
      "Text": " the core cybercrimes, and we call core cybercrimes in the U.N., they call core cybercrimes to"
    },
    {
      "Time_Start": 496.74,
      "Time_End": 503.78,
      "Text": " those who are computer access without authorization, illegal interference, misuse of"
    },
    {
      "Time_Start": 503.78,
      "Time_End": 509.5,
      "Text": " devices, interference of data, interference of systems, uh, et cetera, illegal"
    },
    {
      "Time_Start": 509.5,
      "Time_End": 515.5,
      "Text": " interception, et cetera. But, uh, before there were more than 30 crimes, so in that sense we won."
    },
    {
      "Time_Start": 516.02,
      "Time_End": 521.02,
      "Text": " Many countries like Russia and China, but also many other, not authoritarian, but in the"
    },
    {
      "Time_Start": 524.1,
      "Time_End": 530.1,
      "Text": " middle were proposing fake news crimes and many other crimes that can criminalize a speech. Um, so"
    },
    {
      "Time_Start": 532.9,
      "Time_End": 538.62,
      "Text": " that's out of the treaty. However, there always is a loophole, and this loophole is called"
    },
    {
      "Time_Start": 538.62,
      "Time_End": 544.62,
      "Text": " Article 17, in which it compels states to adopt, to make a cybercrime, to make a"
    },
    {
      "Time_Start": 546.02,
      "Time_End": 552.26,
      "Text": " cybercrime, any other applicable cybercrime treaty that exists. Imagine, there is a treaty of"
    },
    {
      "Time_Start": 552.26,
      "Time_End": 559.14,
      "Text": " terrorism of Lyme, smuggling, narcotics, now they all have to turn it into cybercrime. And"
    },
    {
      "Time_Start": 559.14,
      "Time_End": 565.34,
      "Text": " that's all. Making something of Lyme and turning it into cybercrime is a problem because"
    },
    {
      "Time_Start": 565.34,
      "Time_End": 570.78,
      "Text": " many of the provisions of Lyme, they don't have problems like criminal liability by"
    },
    {
      "Time_Start": 570.8,
      "Time_End": 576.4,
      "Text": " intermediaries. They have not been fought, uh, under those, how these crimes will be"
    },
    {
      "Time_Start": 576.4,
      "Time_End": 581.6999999999999,
      "Text": " committed under which conditions. And so making this automatic translation could create a"
    },
    {
      "Time_Start": 581.6999999999999,
      "Time_End": 588.8199999999999,
      "Text": " lot of problems. So we are asking to delete this loophole. Um, but, um, what is more"
    },
    {
      "Time_Start": 588.8199999999999,
      "Time_End": 595.52,
      "Text": " important is that, uh, the crime have these articles of computer access without"
    },
    {
      "Time_Start": 595.52,
      "Time_End": 601.36,
      "Text": " authorization that you already know maybe from the CFAA. However, what is new here is"
    },
    {
      "Time_Start": 601.36,
      "Time_End": 606.36,
      "Text": " first, the older convention, uh, the Budapest Convention was ratified by 60 countries. So 60"
    },
    {
      "Time_Start": 609.6,
      "Time_End": 615.06,
      "Text": " countries have those crimes in their books. I don't know, many others may have adopted, but"
    },
    {
      "Time_Start": 615.06,
      "Time_End": 620.06,
      "Text": " it's not the 194 countries around the world. Meaning, by adopting this treaty, and if we"
    },
    {
      "Time_Start": 620.4000000000001,
      "Time_End": 625.4000000000001,
      "Text": " get consensus, all countries around the world will have these crimes. And it's not only that"
    },
    {
      "Time_Start": 628.3000000000001,
      "Time_End": 634.4000000000001,
      "Text": " it's a problem. It's that it also has an article on jurisdiction. When a state can claim"
    },
    {
      "Time_Start": 634.4000000000001,
      "Time_End": 640.4000000000001,
      "Text": " jurisdiction on the investigation of crime. And the real issue of this treaty is international"
    },
    {
      "Time_Start": 640.4000000000001,
      "Time_End": 647.0600000000001,
      "Text": " cooperation. Once all countries have in their books this crime, they can help each other"
    },
    {
      "Time_Start": 647.0600000000001,
      "Time_End": 653.82,
      "Text": " investigate a crime, and they can easily claim jurisdiction for the investigation and"
    },
    {
      "Time_Start": 653.82,
      "Time_End": 659.82,
      "Text": " extradition of a crime and extradition of the person accused. So, yeah, so Article 22 have,"
    },
    {
      "Time_Start": 662.86,
      "Time_End": 667.7800000000001,
      "Text": " you can claim jurisdiction if the offense happen which is territory. A state can claim"
    },
    {
      "Time_Start": 667.7800000000001,
      "Time_End": 672.94,
      "Text": " jurisdiction if the offense involve a national event, um, if you are not in the territory,"
    },
    {
      "Time_Start": 672.94,
      "Time_End": 679.1600000000001,
      "Text": " whether they are victims or perpetrators. Also, if the offense is planned outside, but"
    },
    {
      "Time_Start": 679.1600000000001,
      "Time_End": 685.1600000000001,
      "Text": " committed in their territory, or if the state is, uh, against the state itself. Um, let's make"
    },
    {
      "Time_Start": 687.82,
      "Time_End": 693.4000000000001,
      "Text": " a case to understand this. And a simple one first. If a security researcher from country A"
    },
    {
      "Time_Start": 693.4000000000001,
      "Time_End": 700.36,
      "Text": " without authorization access a database in country B, and country B has a jurisdiction"
    },
    {
      "Time_Start": 700.36,
      "Time_End": 706.5,
      "Text": " because the offenses happen within its territory. But if the researcher is a national, also"
    },
    {
      "Time_Start": 706.5,
      "Time_End": 712.5,
      "Text": " this country B, or target a national of country B, country B can also claim jurisdiction. And,"
    },
    {
      "Time_Start": 715.36,
      "Time_End": 722.04,
      "Text": " um, and even while operating from the United States, let's say, country A, country B can"
    },
    {
      "Time_Start": 722.04,
      "Time_End": 728.04,
      "Text": " still claim jurisdiction in, in those cases. And if there is multiple countries"
    },
    {
      "Time_Start": 728.04,
      "Time_End": 732.5799999999999,
      "Text": " investigating the crime, they have to coordinate. But they don't say how. And this is very"
    },
    {
      "Time_Start": 732.5799999999999,
      "Time_End": 737.4599999999999,
      "Text": " problematic at a global level when you have different countries with different standards of"
    },
    {
      "Time_Start": 737.4599999999999,
      "Time_End": 743.62,
      "Text": " human rights protections. So let's see a little more complex scenario. A security researcher"
    },
    {
      "Time_Start": 743.62,
      "Time_End": 750.66,
      "Text": " from country A, let's say a democratic nations, identifies a vulnerability and without"
    },
    {
      "Time_Start": 750.66,
      "Time_End": 757.4599999999999,
      "Text": " authorization, without rights, access a database in country B. Let's say country B is an"
    },
    {
      "Time_Start": 757.46,
      "Time_End": 764.0400000000001,
      "Text": " authoritarian regime. The database, which is unknown to the researcher at that time,"
    },
    {
      "Time_Start": 764.0400000000001,
      "Time_End": 770.4200000000001,
      "Text": " contains sensitive information about dissidents from country C, which also is an"
    },
    {
      "Time_Start": 770.4200000000001,
      "Time_End": 776.0400000000001,
      "Text": " authoritarian regime. So we have country A democratic, country B and C authoritarian. And"
    },
    {
      "Time_Start": 776.0400000000001,
      "Time_End": 781.8000000000001,
      "Text": " information about dissidents from country C. The researcher's intentions are purely"
    },
    {
      "Time_Start": 781.84,
      "Time_End": 788.46,
      "Text": " academic. But implications are political and sensitive. So what would happen here,"
    },
    {
      "Time_Start": 788.46,
      "Time_End": 794.22,
      "Text": " could country B would likely want to claim jurisdiction over the matter since the"
    },
    {
      "Time_Start": 794.22,
      "Time_End": 800.22,
      "Text": " unauthorized access occurred in their territory. Given the nature of the laws in that country,"
    },
    {
      "Time_Start": 803.3800000000001,
      "Time_End": 810.3800000000001,
      "Text": " they might paint the researcher as a spy or a foreign agent and demand extradition. Country"
    },
    {
      "Time_Start": 810.38,
      "Time_End": 816.38,
      "Text": " C would also be deeply concerned as their national data was compromised. Even though the"
    },
    {
      "Time_Start": 818.08,
      "Time_End": 824.96,
      "Text": " researcher has no malicious intent, the sensitive information possibly, the sensitive"
    },
    {
      "Time_Start": 824.96,
      "Time_End": 831.96,
      "Text": " information nature means that country C would likely also claim jurisdiction over the"
    },
    {
      "Time_Start": 831.96,
      "Time_End": 837.96,
      "Text": " matter. Possibly painting it as an act against the state, which is also another clause in the"
    },
    {
      "Time_Start": 838.96,
      "Time_End": 844.96,
      "Text": " article 22. If the researcher travels to country C for any reason, or if country C can somehow"
    },
    {
      "Time_Start": 848.84,
      "Time_End": 854.84,
      "Text": " apprehend him, country C would want to establish its own jurisdiction over the researcher."
    },
    {
      "Time_Start": 857.1600000000001,
      "Time_End": 862.5400000000001,
      "Text": " Over the researcher, especially if country A, imagine the United States, don't want to"
    },
    {
      "Time_Start": 862.5799999999999,
      "Time_End": 868.5799999999999,
      "Text": " punish that person. Since both country B and C, that both authoritarian regimes have a"
    },
    {
      "Time_Start": 871.42,
      "Time_End": 877.42,
      "Text": " stakes issue, there will be a diplomatic tussle. And when there is diplomatic issues, it gets very"
    },
    {
      "Time_Start": 879.5799999999999,
      "Time_End": 886.24,
      "Text": " complicated and murky. The two authoritarian regimes might coordinate or even blame country A"
    },
    {
      "Time_Start": 886.24,
      "Time_End": 892.24,
      "Text": " for supposed espionage or interference. Country A, being a democratic country, would find"
    },
    {
      "Time_Start": 893.62,
      "Time_End": 899.62,
      "Text": " itself in a very difficult position. And depending on the international relationship, treaties,"
    },
    {
      "Time_Start": 901.54,
      "Time_End": 907.54,
      "Text": " geopolitical strategies of that country, country A might be forced to either protect or distance"
    },
    {
      "Time_Start": 909.54,
      "Time_End": 915.28,
      "Text": " themselves or even hand over the researcher to the country. So we are calling for article 22"
    },
    {
      "Time_Start": 915.4,
      "Time_End": 921.4,
      "Text": " also to be deleted. Because once you claim jurisdiction, other laws could apply to them. And"
    },
    {
      "Time_Start": 923.24,
      "Time_End": 927.36,
      "Text": " this is very mathematical also for the surveillance powers, because some countries' laws,"
    },
    {
      "Time_Start": 927.36,
      "Time_End": 934.36,
      "Text": " for instance, when claim jurisdiction may have laws that are very draconian and have very"
    },
    {
      "Time_Start": 934.36,
      "Time_End": 940.36,
      "Text": " little standards, it can create obligations on providers to localize data among other issues."
    },
    {
      "Time_Start": 940.36,
      "Time_End": 946.36,
      "Text": " That will make it easier for them to access data. So I think I will pass to Bill about, but"
    },
    {
      "Time_Start": 951.98,
      "Time_End": 958.52,
      "Text": " just to make very clear, while these articles are already in the GFAA, we think that most"
    },
    {
      "Time_Start": 958.52,
      "Time_End": 964.52,
      "Text": " importantly, we need to have limitations here. And we need to make sure that computer access"
    },
    {
      "Time_Start": 965.52,
      "Time_End": 971.76,
      "Text": " without authorization means breaching a security measure that is done with dishonest"
    },
    {
      "Time_Start": 971.76,
      "Time_End": 977.76,
      "Text": " intentions, causing harm. And there should be a public interest protection for the public"
    },
    {
      "Time_Start": 980.14,
      "Time_End": 986.72,
      "Text": " interest. This article is not only applicable to security researchers. Many of the work of"
    },
    {
      "Time_Start": 986.72,
      "Time_End": 993.52,
      "Text": " journalists sometimes involve finding information that is very obscure on the Internet. But"
    },
    {
      "Time_Start": 993.52,
      "Time_End": 998.64,
      "Text": " it is public available. And if it's just using a simple tool to get access to information"
    },
    {
      "Time_Start": 998.64,
      "Time_End": 1003.18,
      "Text": " that is public available, that could make them a crime. And then we have all these other"
    },
    {
      "Time_Start": 1003.18,
      "Time_End": 1009.52,
      "Text": " repercussions. The treaty itself is a treaty about international cooperation, meaning now"
    },
    {
      "Time_Start": 1009.52,
      "Time_End": 1015.76,
      "Text": " country, whatever country, can help the other country to investigate that crime. We are"
    },
    {
      "Time_Start": 1015.76,
      "Time_End": 1020.1,
      "Text": " fighting for dual criminality to make sure that the crime that is being investigated is a"
    },
    {
      "Time_Start": 1020.1,
      "Time_End": 1025.64,
      "Text": " crime in both countries, but that's not mandatory. Right now it's just optional. And even"
    },
    {
      "Time_Start": 1025.64,
      "Time_End": 1031.84,
      "Text": " two countries who are authoritarian regimes may allow each other to help each other"
    },
    {
      "Time_Start": 1031.84,
      "Time_End": 1036.72,
      "Text": " investigate a content related crime, a crime that is inherently illegal in international law."
    },
    {
      "Time_Start": 1036.72,
      "Time_End": 1042.38,
      "Text": " Laissez Majesté, for instance, insulting the king. So they will use the whole surveillance"
    },
    {
      "Time_Start": 1042.38,
      "Time_End": 1048.46,
      "Text": " powers to investigate a crime that is that. For us, that's providing a legal, I think that"
    },
    {
      "Time_Start": 1048.46,
      "Time_End": 1054.46,
      "Text": " the treaty, what it's doing is providing a legal basis for authoritarian regimes to rank among, to"
    },
    {
      "Time_Start": 1054.46,
      "Time_End": 1061.24,
      "Text": " legitimize the illegal prices of international cooperation on crimes that are not worth it, or"
    },
    {
      "Time_Start": 1061.24,
      "Time_End": 1066.74,
      "Text": " should not be subject of criminal investigation. So I pass."
    },
    {
      "Time_Start": 1066.74,
      "Time_End": 1072.74,
      "Text": " Thanks very much, Katica. So, as Katica mentioned, Articles 5, which kind of applies to the"
    },
    {
      "Time_Start": 1079.48,
      "Time_End": 1085.48,
      "Text": " entire treaty, and Articles 24, which applies to the new investigative powers with regards to"
    },
    {
      "Time_Start": 1088.06,
      "Time_End": 1093.16,
      "Text": " human rights, the human rights limits on the new powers that are delegated to states that are"
    },
    {
      "Time_Start": 1093.18,
      "Time_End": 1099.18,
      "Text": " signatories to the treaty. What we want to push are stringent limitations to the new powers on"
    },
    {
      "Time_Start": 1101.6200000000001,
      "Time_End": 1107.6200000000001,
      "Text": " surveillance. We would love to see the UN Cybercrime Treaty in general be just discarded, but"
    },
    {
      "Time_Start": 1111.2,
      "Time_End": 1115.8600000000001,
      "Text": " at the very least there should be stringent safeguards on human rights abuses that are"
    },
    {
      "Time_Start": 1115.8600000000001,
      "Time_End": 1121.5,
      "Text": " possible. One thing that we want is to set time limits on investigative powers and"
    },
    {
      "Time_Start": 1121.52,
      "Time_End": 1128.08,
      "Text": " surveillance. So if there is an investigation going on, then set strict time limits for when that"
    },
    {
      "Time_Start": 1128.08,
      "Time_End": 1134.08,
      "Text": " cooperation will happen. Effective remedy, which is when someone is targeted for"
    },
    {
      "Time_Start": 1136.56,
      "Time_End": 1142.66,
      "Text": " investigation, and they are targeted wrongly, then they should have the ability to then in the"
    },
    {
      "Time_Start": 1142.66,
      "Time_End": 1148.66,
      "Text": " future seek remedy, seek some kind of justice for what happened to them. We want to require"
    },
    {
      "Time_Start": 1148.96,
      "Time_End": 1154.96,
      "Text": " prior judicial review when a surveillance power is brought to the table. There should be, in the"
    },
    {
      "Time_Start": 1160.6200000000001,
      "Time_End": 1167.24,
      "Text": " country which is employing the surveillance technology, a judicial oversight that happens"
    },
    {
      "Time_Start": 1167.24,
      "Time_End": 1175.1200000000001,
      "Text": " prior to it actually being implemented. So an infactual basis for any crime that is being"
    },
    {
      "Time_Start": 1175.1200000000001,
      "Time_End": 1181.1200000000001,
      "Text": " alleged has to be a paper trail for why you think this is a crime that is being committed and"
    },
    {
      "Time_Start": 1182.42,
      "Time_End": 1188.7800000000002,
      "Text": " that there could be vetting on both sides and not just arbitrary statement that this is"
    },
    {
      "Time_Start": 1188.7800000000002,
      "Time_End": 1195.5000000000002,
      "Text": " happening by say an authoritarian regime forcing investigation on someone who is in the"
    },
    {
      "Time_Start": 1195.5000000000002,
      "Time_End": 1201.5000000000002,
      "Text": " jurisdiction of a democratic society. Finally, we want the investigative committee to"
    },
    {
      "Time_Start": 1206.0800000000002,
      "Time_End": 1212.0800000000002,
      "Text": " tell the public how often these new powers were used. Somewhat like a transparency report for"
    },
    {
      "Time_Start": 1213.7,
      "Time_End": 1219.92,
      "Text": " the amount that these new powers were used so that we know if there is massive abuse"
    },
    {
      "Time_Start": 1219.92,
      "Time_End": 1225.66,
      "Text": " happening, say mass surveillance. So we want these strong protections to be incorporated"
    },
    {
      "Time_Start": 1225.66,
      "Time_End": 1231.66,
      "Text": " within article 24 on the new investigative powers. So we want a new bolstered article"
    },
    {
      "Time_Start": 1232.66,
      "Time_End": 1238.66,
      "Text": " 5 which applies generally to the convention and article 24 which applies to these new"
    },
    {
      "Time_Start": 1241.0,
      "Time_End": 1247.0800000000002,
      "Text": " surveillance powers. One of the things that's problematic throughout the treaty, the"
    },
    {
      "Time_Start": 1247.0800000000002,
      "Time_End": 1254.5400000000002,
      "Text": " zero draft, is the term competent authorities which is not defined. So in these"
    },
    {
      "Time_Start": 1254.5400000000002,
      "Time_End": 1261.16,
      "Text": " conventions you'll have a long text and the terms and definitions will be in the first few"
    },
    {
      "Time_Start": 1261.16,
      "Time_End": 1268.28,
      "Text": " articles. Article 2 in this case defines a whole slew of terms but not competent"
    },
    {
      "Time_Start": 1268.28,
      "Time_End": 1273.3200000000002,
      "Text": " authorities which appears throughout the treaty. And competent authorities could be"
    },
    {
      "Time_Start": 1273.3200000000002,
      "Time_End": 1279.0800000000002,
      "Text": " interpreted as prosecutors or law enforcement by countries which adopt this. So we want"
    },
    {
      "Time_Start": 1279.0800000000002,
      "Time_End": 1285.0800000000002,
      "Text": " that to be better defined and not to apply to say overzealous prosecutorial authorities."
    },
    {
      "Time_Start": 1286.04,
      "Time_End": 1292.04,
      "Text": " And what should be most relevant for the DEF CON community is perhaps article 28. So"
    },
    {
      "Time_Start": 1300.04,
      "Time_End": 1306.6599999999999,
      "Text": " article 28 empowers the search and seizure of stored data allowing competent authorities to"
    },
    {
      "Time_Start": 1306.6599999999999,
      "Time_End": 1312.6599999999999,
      "Text": " compel those with device knowledge to disclose information about how to access data on these"
    },
    {
      "Time_Start": 1313.5800000000002,
      "Time_End": 1319.5800000000002,
      "Text": " devices. Say security researchers who know about a vulnerability in a device or network and"
    },
    {
      "Time_Start": 1323.5800000000002,
      "Time_End": 1329.5800000000002,
      "Text": " they are given, investigative authorities are given new powers to compel them to take part in"
    },
    {
      "Time_Start": 1333.8200000000002,
      "Time_End": 1339.1200000000001,
      "Text": " an investigative. This is open, the wording is open to interpretation but it can be"
    },
    {
      "Time_Start": 1339.1200000000001,
      "Time_End": 1346.46,
      "Text": " interpreted as forced disclosure of security vulnerabilities to government authorities. So"
    },
    {
      "Time_Start": 1346.46,
      "Time_End": 1352.46,
      "Text": " this is something that we at EFF feel very strongly about and also has to do with another"
    },
    {
      "Time_Start": 1354.7800000000002,
      "Time_End": 1360.7800000000002,
      "Text": " piece of pending international legislation which is the EU Cyber Resilience Act. And that's"
    },
    {
      "Time_Start": 1361.78,
      "Time_End": 1367.78,
      "Text": " another piece of legislation which may compel companies to report vulnerabilities to EU"
    },
    {
      "Time_Start": 1371.32,
      "Time_End": 1377.28,
      "Text": " regulatory authorities when there is a vulnerability that they know of. Basically it's"
    },
    {
      "Time_Start": 1377.28,
      "Time_End": 1383.28,
      "Text": " trying to rein in the irresponsible companies from not doing their due diligence with regards"
    },
    {
      "Time_Start": 1383.58,
      "Time_End": 1389.58,
      "Text": " to end devices and patching vulnerabilities. But the good actors in the space of cyber"
    },
    {
      "Time_Start": 1396.0,
      "Time_End": 1402.0,
      "Text": " security are reasonably terrified of this because vulnerabilities are very justifiably so"
    },
    {
      "Time_Start": 1404.74,
      "Time_End": 1411.78,
      "Text": " regarded as well kept secrets in the industry and they don't want to alert regulatory"
    },
    {
      "Time_Start": 1411.82,
      "Time_End": 1418.2,
      "Text": " authorities to continue the spread of information about a vulnerability before, for"
    },
    {
      "Time_Start": 1418.2,
      "Time_End": 1424.2,
      "Text": " instance, it's able to be fixed and pushed. So these are kind of, it's a new push by"
    },
    {
      "Time_Start": 1428.54,
      "Time_End": 1435.04,
      "Text": " governments to get information on vulnerabilities both in the UN Cybercrime Treaty and the"
    },
    {
      "Time_Start": 1435.08,
      "Time_End": 1441.08,
      "Text": " EU Cyber Resilience Act. So what is next? Next is the 6th session of the Cybercrime"
    },
    {
      "Time_Start": 1444.5,
      "Time_End": 1452.5,
      "Text": " Convention which will happen and will be attending in August and September and that is when an"
    },
    {
      "Time_Start": 1452.5,
      "Time_End": 1457.2,
      "Text": " intensive round of negotiations will happen around the text. We're trying to get these"
    },
    {
      "Time_Start": 1457.2,
      "Time_End": 1464.04,
      "Text": " protections built into the text of the convention and that will be incorporated into a final"
    },
    {
      "Time_Start": 1464.08,
      "Time_End": 1469.78,
      "Text": " draft if we can hopefully have some input on the process. Although they're not obliged to"
    },
    {
      "Time_Start": 1469.78,
      "Time_End": 1475.78,
      "Text": " listen to us in any way, shape or form. But then in January, February of 2024 is when it will"
    },
    {
      "Time_Start": 1481.96,
      "Time_End": 1487.96,
      "Text": " go into effect and there can be new signatories. But that deadline, January, February 2024"
    },
    {
      "Time_Start": 1488.58,
      "Time_End": 1494.58,
      "Text": " may be pushed back if there's not agreement in member states. So we're trying, we're trying"
    },
    {
      "Time_Start": 1499.1200000000001,
      "Time_End": 1503.7,
      "Text": " to stand up for users' rights and the rights of security researchers not to be criminalized"
    },
    {
      "Time_Start": 1503.7,
      "Time_End": 1509.7,
      "Text": " in the international forum and we hope that you will all follow this closely."
    },
    {
      "Time_Start": 1509.7,
      "Time_End": 1515.7,
      "Text": " Thank you."
    }
  ]
}