{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 9.68,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Yeah, great. So, happy to be here with you, speaking a little bit about science fiction"
    },
    {
      "Time_Start": 9.68,
      "Time_End": 19.400000000000002,
      "Text": " and future. I am Xavier Facelina. I'm the CEO of a company called TechLab. And I work"
    },
    {
      "Time_Start": 19.400000000000002,
      "Time_End": 27.76,
      "Text": " in securing critical systems and including nuclear facilities. Keep that in mind for"
    },
    {
      "Time_Start": 27.76,
      "Time_End": 37.44,
      "Text": " a few seconds. And Nicola is my co-author and is not my co-presenter today. Couldn't"
    },
    {
      "Time_Start": 37.44,
      "Time_End": 47.92,
      "Text": " make it to the U.S. is very sad. But I will present for the two of us. So, Nicola is futurist."
    },
    {
      "Time_Start": 47.92,
      "Time_End": 54.160000000000004,
      "Text": " I didn't know what was a futurist before meeting Nicola. But it is a futurist. He's a researcher"
    },
    {
      "Time_Start": 54.160000000000004,
      "Time_End": 63.040000000000006,
      "Text": " at the University in France. He's CEO of his own company. And he leads the red team"
    },
    {
      "Time_Start": 63.040000000000006,
      "Time_End": 69.12,
      "Text": " defense of the French Department of Defense. So, what is the red team? It's not the same"
    },
    {
      "Time_Start": 69.12,
      "Time_End": 77.4,
      "Text": " red team as you. It's not about cyber security. It's a team of military, of authors, science"
    },
    {
      "Time_Start": 77.4,
      "Time_End": 83.60000000000001,
      "Text": " fiction authors, of scenarists, of movie makers, reflecting about the future of the"
    },
    {
      "Time_Start": 83.60000000000001,
      "Time_End": 89.12,
      "Text": " war and the future of the conflict. So, that's the red team of the Department of Defense."
    },
    {
      "Time_Start": 89.12,
      "Time_End": 95.32000000000001,
      "Text": " I was speaking about that with someone yesterday. He said it's the French thing I heard in DEF"
    },
    {
      "Time_Start": 95.32000000000001,
      "Time_End": 103.4,
      "Text": " CON. So, yes, it's very French to have a red team at the DOD. But Nicola leads this team."
    },
    {
      "Time_Start": 103.4,
      "Time_End": 109.72,
      "Text": " I will introduce us by and introduce the conference by saying a little word about, okay, how we"
    },
    {
      "Time_Start": 109.72,
      "Time_End": 117.72,
      "Text": " met and how we have this idea to make this conference. So, we were both of us a speaker at a"
    },
    {
      "Time_Start": 117.72,
      "Time_End": 124.56,
      "Text": " conference. It was presenting something on the future and innovation. And I was giving a"
    },
    {
      "Time_Start": 124.56,
      "Time_End": 132.14000000000001,
      "Text": " talk, an inspirational talk on my own past and personal journey. And in this talk, I was"
    },
    {
      "Time_Start": 132.14000000000001,
      "Time_End": 139.84,
      "Text": " saying that when I was a kid, I saw this movie, War Games. I was 7 years old and I decided to"
    },
    {
      "Time_Start": 139.84,
      "Time_End": 145.84,
      "Text": " be a hacker and to marry Jennifer. Don Juan failed one. Perhaps some of you failed one, too."
    },
    {
      "Time_Start": 152.18,
      "Time_End": 159.18,
      "Text": " But I speak about that and say, okay, War Games was a very moving movie to me, et cetera, et"
    },
    {
      "Time_Start": 160.18,
      "Time_End": 167.18,
      "Text": " cetera. And continue my story. And after my talk, Nicola came to me and said, hey, Xavier, you"
    },
    {
      "Time_Start": 167.18,
      "Time_End": 175.18,
      "Text": " are one of the living examples of the fact that science fiction drives reality. And I was like,"
    },
    {
      "Time_Start": 175.18,
      "Time_End": 183.42000000000002,
      "Text": " what? What do you say to that? You didn't figure that you funded and ran a company to protect"
    },
    {
      "Time_Start": 183.42000000000002,
      "Time_End": 189.04000000000002,
      "Text": " nuclear facilities from hacking because you saw a movie when you were 7 years old and that the"
    },
    {
      "Time_Start": 189.04000000000002,
      "Time_End": 196.50000000000003,
      "Text": " threat was just pure fiction. And I was, no, I didn't figure that. It was the first time I"
    },
    {
      "Time_Start": 196.50000000000003,
      "Time_End": 204.26000000000002,
      "Text": " think about that. So, I said, okay. It's very interesting. And a few years later, we decided to"
    },
    {
      "Time_Start": 204.26000000000002,
      "Time_End": 210.34000000000003,
      "Text": " start a research program on hacking in science fiction. And a few months later, like eight"
    },
    {
      "Time_Start": 210.34,
      "Time_End": 216.96,
      "Text": " months later, I'm here in front of you. Thank you very much for being here with me. So, it"
    },
    {
      "Time_Start": 216.96,
      "Time_End": 222.96,
      "Text": " will be a journey. I will not be conclusive. It's more about introduce you to the usage of"
    },
    {
      "Time_Start": 226.96,
      "Time_End": 234.08,
      "Text": " science fiction in innovation and reality. How we can care about science fiction. I think"
    },
    {
      "Time_Start": 234.08,
      "Time_End": 242.08,
      "Text": " that probably most of us are a little geeky and like science fiction. But I think that in this"
    },
    {
      "Time_Start": 242.08,
      "Time_End": 250.08,
      "Text": " talk, I probably would invite you to consider it like something that is professionally very"
    },
    {
      "Time_Start": 250.08,
      "Time_End": 260.58000000000004,
      "Text": " accurate. So, let's start the journey by some thing about the science fiction and the"
    },
    {
      "Time_Start": 260.7,
      "Time_End": 266.7,
      "Text": " imaginaries. So, first, just to clear the air, this is a scientific domain. So, you can read a lot"
    },
    {
      "Time_Start": 271.15999999999997,
      "Time_End": 277.15999999999997,
      "Text": " of papers or books like the excellent books of David Kirby on the impact of science fiction on the"
    },
    {
      "Time_Start": 280.0,
      "Time_End": 286.0,
      "Text": " real world. And how science fiction is pushing the world in a, let's say, not known future, but"
    },
    {
      "Time_Start": 286.96,
      "Time_End": 292.96,
      "Text": " in a casted future. So, and there is a feedback loop between science fiction that drove the"
    },
    {
      "Time_Start": 296.42,
      "Time_End": 302.2,
      "Text": " innovation. And the innovation that inspires science fiction. And this feedback loop is well"
    },
    {
      "Time_Start": 302.2,
      "Time_End": 308.2,
      "Text": " documented in some scientific readings. One of the usage of science fiction is, of course, to raise"
    },
    {
      "Time_Start": 308.82,
      "Time_End": 314.82,
      "Text": " the awareness of public politics. There is two main ways of doing that. One is by utopia, by"
    },
    {
      "Time_Start": 322.48,
      "Time_End": 329.62,
      "Text": " presenting something that we want to get. And the other one by dystopian. So, by showing"
    },
    {
      "Time_Start": 329.62,
      "Time_End": 335.62,
      "Text": " something that we don't want to have. Statistically, we have more dystopia than utopia in"
    },
    {
      "Time_Start": 338.44,
      "Time_End": 344.44,
      "Text": " science fiction. Who here never saw this video on YouTube? Okay. So, I will not show the video"
    },
    {
      "Time_Start": 349.08,
      "Time_End": 356.03999999999996,
      "Text": " because it's a seven minute long video. But I do encourage you to note the term and to look at"
    },
    {
      "Time_Start": 356.03999999999996,
      "Time_End": 362.03999999999996,
      "Text": " this video right after the talk. It's seven minutes. And I swear it's a good idea. So, just wait a"
    },
    {
      "Time_Start": 362.08000000000004,
      "Time_End": 368.08000000000004,
      "Text": " second for the pictures. Three, two, one, new slide. So, now I will spoil you the video. So, it's"
    },
    {
      "Time_Start": 379.5,
      "Time_End": 387.20000000000005,
      "Text": " about a presentation. A presentation about a company making a weapon and drones. So, the guy is"
    },
    {
      "Time_Start": 387.2,
      "Time_End": 393.2,
      "Text": " on stage. He's very happy to present the successful product, the drone. And he's presenting the"
    },
    {
      "Time_Start": 396.5,
      "Time_End": 402.5,
      "Text": " new generation, like micro drones. Micro drones capable of escaping the bullets of snipers."
    },
    {
      "Time_Start": 407.41999999999996,
      "Time_End": 414.84,
      "Text": " Having a camera, technical sensor, face recognition, like any phone or apps. So, it's very"
    },
    {
      "Time_Start": 414.84000000000003,
      "Time_End": 421.98,
      "Text": " important when you do some fiction to relate to what exists. Because we can figure that, yes, it's"
    },
    {
      "Time_Start": 421.98,
      "Time_End": 427.98,
      "Text": " possible. And of course, some explosive. And then he showed a demo of a surgical strike of the micro"
    },
    {
      "Time_Start": 436.18,
      "Time_End": 443.68,
      "Text": " drone killing something. And then he goes on. Example of another surgical strike. Everybody is"
    },
    {
      "Time_Start": 443.72,
      "Time_End": 449.72,
      "Text": " happy. Except then, of course, there's the beginning of some accident. Of some terrorism with these"
    },
    {
      "Time_Start": 452.18,
      "Time_End": 458.18,
      "Text": " drones. Even in university classroom, targeting specific people that have reposted a video on"
    },
    {
      "Time_Start": 461.94,
      "Time_End": 467.94,
      "Text": " social media. Denouncing some government, et cetera, et cetera. So, at the end, we see that it could be"
    },
    {
      "Time_Start": 468.94,
      "Time_End": 474.94,
      "Text": " very bad to have this kind of technology. And at the very end of the video, you see, this is for"
    },
    {
      "Time_Start": 480.52,
      "Time_End": 486.52,
      "Text": " real. It's in the video. But he's a real professor that explains, okay, guys, we made this movie to"
    },
    {
      "Time_Start": 488.82,
      "Time_End": 494.82,
      "Text": " raise your awareness about the danger of such technology. So, that's one usage of science"
    },
    {
      "Time_Start": 495.12,
      "Time_End": 501.12,
      "Text": " fiction in reality is to shape innovation, yes. But to shape politics, regulations. I think it's"
    },
    {
      "Time_Start": 505.24,
      "Time_End": 511.24,
      "Text": " very important. So, that said, let's talk about hacking. So, we started to look at the core"
    },
    {
      "Time_Start": 515.9,
      "Time_End": 523.9,
      "Text": " subject. Like I said, when I met Nicolas, we decided to work on science fiction and hacking. Hacking"
    },
    {
      "Time_Start": 523.9399999999999,
      "Time_End": 529.9399999999999,
      "Text": " in science fiction. So, we said, okay, what is, to clear the air again, what is the"
    },
    {
      "Time_Start": 531.8199999999999,
      "Time_End": 537.8199999999999,
      "Text": " representation of hacking? So, we started to call images, like a lot of images from Pinterest,"
    },
    {
      "Time_Start": 541.9399999999999,
      "Time_End": 547.9399999999999,
      "Text": " Art Station, etc. And we use a tool named PixPlot by DH labs of Yale University to map the images"
    },
    {
      "Time_Start": 548.94,
      "Time_End": 554.94,
      "Text": " and to see some cloud, etc., etc. So, what you see behind is the cloud of the representation of"
    },
    {
      "Time_Start": 562.2,
      "Time_End": 568.2,
      "Text": " the word hacking. It's very, it was a huge disappointment. It's hacking furniture, like Swedish"
    },
    {
      "Time_Start": 569.2,
      "Time_End": 575.2,
      "Text": " furniture. So, when you look at all the pictures of hacking, it's not related with hackers. So, we"
    },
    {
      "Time_Start": 582.58,
      "Time_End": 588.2800000000001,
      "Text": " look for another word, oh, sorry, no. Another thing that you find, because you see there was"
    },
    {
      "Time_Start": 588.2800000000001,
      "Time_End": 594.2800000000001,
      "Text": " two clouds. One is hacking Ikea furniture. The other is hacking your phone like the 10 features"
    },
    {
      "Time_Start": 595.28,
      "Time_End": 601.28,
      "Text": " that you don't know, the super shortcuts that you must know, etc., etc. So, on the internet, the"
    },
    {
      "Time_Start": 604.6999999999999,
      "Time_End": 611.66,
      "Text": " representation, visual representation of hacking is now not related to hackers. So, we look for"
    },
    {
      "Time_Start": 611.66,
      "Time_End": 617.66,
      "Text": " hacker. And this is very, there are strong archetypes of hackers. Of course, the mask of V4FanData"
    },
    {
      "Time_Start": 618.66,
      "Time_End": 624.66,
      "Text": " and Anonymous. Of course, the hoodie. It's a must have. And sometimes both, the mask and the"
    },
    {
      "Time_Start": 631.5799999999999,
      "Time_End": 639.5799999999999,
      "Text": " hoodie. Another representation of hacker, it's drawing. And you can see that there is a sort of"
    },
    {
      "Time_Start": 639.5799999999999,
      "Time_End": 645.5799999999999,
      "Text": " pattern sometimes. So, again, strong archetypes. And when we speak about archetypes, we"
    },
    {
      "Time_Start": 647.74,
      "Time_End": 653.74,
      "Text": " say that every family of image that we found was quite the same. I mean, it's like four images."
    },
    {
      "Time_Start": 656.24,
      "Time_End": 662.78,
      "Text": " So, we have terminals, we have metrics, and we have some hardware hacking. So, yes, we have"
    },
    {
      "Time_Start": 662.78,
      "Time_End": 668.78,
      "Text": " some. If we look for cyber security, we can see padlocks. So, for the lock pickers in the room,"
    },
    {
      "Time_Start": 669.78,
      "Time_End": 675.78,
      "Text": " you are well represented. Cyber security is clearly a padlock for the rest of the world. And you"
    },
    {
      "Time_Start": 680.6999999999999,
      "Time_End": 688.12,
      "Text": " can see some devices, mostly Apple ones and iPhone. And you can see people. Some with hoodies,"
    },
    {
      "Time_Start": 688.12,
      "Time_End": 695.62,
      "Text": " and some of them with shirts and suits. That's cyber security. So, it's, again, really, really"
    },
    {
      "Time_Start": 695.66,
      "Time_End": 702.46,
      "Text": " caricature. So, the representation of hacking, hackers, et cetera, is a caricature. And this is"
    },
    {
      "Time_Start": 702.46,
      "Time_End": 708.8,
      "Text": " an important point in the fact that it's difficult to raise the awareness of the public with a"
    },
    {
      "Time_Start": 708.8,
      "Time_End": 714.8,
      "Text": " caricature. So, as experts, we know, for example, that some threats exist, that some risks are"
    },
    {
      "Time_Start": 717.08,
      "Time_End": 724.12,
      "Text": " important. And we sometimes fail to communicate that to people. Why? Because the"
    },
    {
      "Time_Start": 724.16,
      "Time_End": 731.04,
      "Text": " representation that they have is caricature. So, we are not legitimate, credible, because they"
    },
    {
      "Time_Start": 731.04,
      "Time_End": 737.04,
      "Text": " picture us with hoodies and with padlocks. So, that's one of the bias. Some people try to"
    },
    {
      "Time_Start": 739.46,
      "Time_End": 745.46,
      "Text": " change that. So, the idea with HP, run a contest to say, okay, please submit some"
    },
    {
      "Time_Start": 746.46,
      "Time_End": 752.46,
      "Text": " representation to raise the awareness of the public on cyber security. But without being"
    },
    {
      "Time_Start": 755.1800000000001,
      "Time_End": 761.1800000000001,
      "Text": " caricature. So, I'm just showing you some examples. One is, okay, my other computer is your"
    },
    {
      "Time_Start": 765.38,
      "Time_End": 771.38,
      "Text": " monitor. The T-shirt with all your information on you. A picture about what is encryption for"
    },
    {
      "Time_Start": 772.38,
      "Time_End": 778.38,
      "Text": " the movies. And I like the one on the right to say, okay, which one is the hacker? All of"
    },
    {
      "Time_Start": 780.88,
      "Time_End": 786.88,
      "Text": " them. And hackers can be in any shape, age, et cetera. And so, it's, I mean, it's a try to be"
    },
    {
      "Time_Start": 792.42,
      "Time_End": 798.42,
      "Text": " less caricature and to give some space and some imagination to the public to drive them into,"
    },
    {
      "Time_Start": 798.7600000000001,
      "Time_End": 804.7600000000001,
      "Text": " okay, that's the real world of hacking. It's not hoodies and padlocks. And to be clear, I have"
    },
    {
      "Time_Start": 807.84,
      "Time_End": 813.84,
      "Text": " hoodies. And that's an interesting point. Because when, I don't know, when it's 3 a.m. and I"
    },
    {
      "Time_Start": 817.34,
      "Time_End": 823.34,
      "Text": " can't figure this particular bug. So, I don't, I fail to scan something. I have my hoodie and"
    },
    {
      "Time_Start": 823.6800000000001,
      "Time_End": 829.6800000000001,
      "Text": " you know, I make this move, take a coffee, et cetera. And I am into the character. So, yes,"
    },
    {
      "Time_Start": 833.1,
      "Time_End": 839.1,
      "Text": " it's caricature. But it defines me, too. So, I have a hoodie and I feel like, okay, I am in"
    },
    {
      "Time_Start": 841.5600000000001,
      "Time_End": 847.5600000000001,
      "Text": " the hacker community because I dress like that. So, it's a feedback interaction again. So,"
    },
    {
      "Time_Start": 847.5600000000001,
      "Time_End": 853.5600000000001,
      "Text": " let's explore. Because when we saw this caricature representation, we say, okay, now we"
    },
    {
      "Time_Start": 859.32,
      "Time_End": 865.32,
      "Text": " have to explore the real science fiction. It was just internet representation, present public"
    },
    {
      "Time_Start": 867.48,
      "Time_End": 873.48,
      "Text": " representation, nothing about science fiction. So, we started the real work. And by"
    },
    {
      "Time_Start": 877.5600000000001,
      "Time_End": 883.5600000000001,
      "Text": " real work, I mean that Nicola and his team had to watch and read a lot of him. So, I'm not"
    },
    {
      "Time_Start": 887.48,
      "Time_End": 893.48,
      "Text": " judging, but it's not working. I mean, I'm joking. Of course, it's a huge work. So, they"
    },
    {
      "Time_Start": 894.9000000000001,
      "Time_End": 900.9000000000001,
      "Text": " characterized almost 200 entries, reading movies, comics, et cetera, et cetera. It's just"
    },
    {
      "Time_Start": 901.0799999999999,
      "Time_End": 907.0799999999999,
      "Text": " an example of the database. And this database was like that. We can obviously see that we"
    },
    {
      "Time_Start": 920.54,
      "Time_End": 926.54,
      "Text": " have a lot of movies speaking about hacking and hackers. Some TV shows and after manga, we"
    },
    {
      "Time_Start": 927.3399999999999,
      "Time_End": 933.3399999999999,
      "Text": " have found one video game about hacking. And all of that were studied by Nicola and his team."
    },
    {
      "Time_Start": 940.54,
      "Time_End": 946.54,
      "Text": " And then, okay, excuse me. So, they looked at a lot of movies and series and they"
    },
    {
      "Time_Start": 947.54,
      "Time_End": 953.54,
      "Text": " characterized the thing to see, okay, what is the target? What is the type of attack that has"
    },
    {
      "Time_Start": 961.54,
      "Time_End": 967.54,
      "Text": " been done? And, okay. So, I will just try the PDF file after that. So, okay."
    },
    {
      "Time_Start": 977.54,
      "Time_End": 983.54,
      "Text": " So, what's important is to see that these movies, et cetera, et cetera, we have made a"
    },
    {
      "Time_Start": 989.54,
      "Time_End": 995.04,
      "Text": " study to characterize all of the attacks in the movie. So, what is the characterization? It's"
    },
    {
      "Time_Start": 995.04,
      "Time_End": 1001.04,
      "Text": " what type of targets, like military, civil society, private sector, et cetera. And what type"
    },
    {
      "Time_Start": 1002.0400000000001,
      "Time_End": 1008.0400000000001,
      "Text": " of attacks? Was it just spying, tapping? Was it destroying? Was it modifying things? Okay."
    },
    {
      "Time_Start": 1012.9200000000001,
      "Time_End": 1018.9200000000001,
      "Text": " Excuse me. I'll try in the same time to have this. I will need some technical help here to"
    },
    {
      "Time_Start": 1019.9200000000001,
      "Time_End": 1025.92,
      "Text": " have the PDF on the screen because the PowerPoint file is crushing PowerPoint. So, while my"
    },
    {
      "Time_Start": 1035.92,
      "Time_End": 1041.92,
      "Text": " savior will try to have the PDF file on the screen, I can show you some of the insights. So,"
    },
    {
      "Time_Start": 1042.92,
      "Time_End": 1048.92,
      "Text": " first of all, in the fiction world, the attacks are very well spread across destroy and erase."
    },
    {
      "Time_Start": 1063.42,
      "Time_End": 1069.42,
      "Text": " Like one, let's say 25% of the attacks is destroying things in the science fiction. So,"
    },
    {
      "Time_Start": 1072.92,
      "Time_End": 1078.92,
      "Text": " almost 25%, it's spying things. And then you have a little more of sabotage, slowdown. And the"
    },
    {
      "Time_Start": 1085.72,
      "Time_End": 1092.22,
      "Text": " majority is about modifying things, like to influence people, to change that, et cetera. So,"
    },
    {
      "Time_Start": 1092.22,
      "Time_End": 1098.22,
      "Text": " in the science fiction, all the things are, I mean, well spread into this fourth category. So,"
    },
    {
      "Time_Start": 1102.42,
      "Time_End": 1108.42,
      "Text": " and the government is the main target. And then military and civil society. When we, I don't"
    },
    {
      "Time_Start": 1116.76,
      "Time_End": 1122.76,
      "Text": " know if we succeeded. I'm with you, you know. When we went to reality and to study the real"
    },
    {
      "Time_Start": 1123.76,
      "Time_End": 1129.76,
      "Text": " attacks, we studied almost 1,000 attacks with three sources. One is the U.S. concealed"
    },
    {
      "Time_Start": 1138.76,
      "Time_End": 1144.76,
      "Text": " foreign relation database, which is very rich. It's a lot of attacks. Another one was the"
    },
    {
      "Time_Start": 1145.76,
      "Time_End": 1151.76,
      "Text": " cybercrime story data line. And then we've made some interviews to characterize some of the"
    },
    {
      "Time_Start": 1157.76,
      "Time_End": 1163.76,
      "Text": " attacks, et cetera. So, of course, keep in mind that we do have a bias on the reality because"
    },
    {
      "Time_Start": 1166.76,
      "Time_End": 1172.76,
      "Text": " it's declarative. So, on the fiction, we have access to all the data. But on the reality, it's"
    },
    {
      "Time_Start": 1173.76,
      "Time_End": 1179.76,
      "Text": " declarative. So, the data set is not representative of all the real world attacks. Only the"
    },
    {
      "Time_Start": 1181.76,
      "Time_End": 1187.76,
      "Text": " attacks that have been reported. So, almost 1,000 for the reality. And then when we compare"
    },
    {
      "Time_Start": 1187.76,
      "Time_End": 1193.76,
      "Text": " on the same aspect that science fiction attacks, we can see that it's not at all equal. It's"
    },
    {
      "Time_Start": 1194.76,
      "Time_End": 1200.76,
      "Text": " like, I mean, 80% of spying government and spying financial data. It's a very few"
    },
    {
      "Time_Start": 1210.96,
      "Time_End": 1216.96,
      "Text": " destruction, very few influence. So, it exists, of course. But when you look in the proportions,"
    },
    {
      "Time_Start": 1217.96,
      "Time_End": 1223.96,
      "Text": " you have most, I mean, a lot of spying. And the targets, like I said, are more government,"
    },
    {
      "Time_Start": 1231.26,
      "Time_End": 1237.26,
      "Text": " private sectors, and then military. So, what was my curiosity about that is that we were"
    },
    {
      "Time_Start": 1238.26,
      "Time_End": 1244.26,
      "Text": " thinking that, okay, science fiction is super aggressive with the world. When you see a"
    },
    {
      "Time_Start": 1250.56,
      "Time_End": 1254.96,
      "Text": " movie or you look at science fiction, it's like destroying things, killing people by hacking,"
    },
    {
      "Time_Start": 1254.96,
      "Time_End": 1260.96,
      "Text": " et cetera, et cetera. And you don't have that yet in the database of the past attacks. But"
    },
    {
      "Time_Start": 1261.46,
      "Time_End": 1267.46,
      "Text": " when you look closer at the numbers, you see, okay, what are the attacks that destroy"
    },
    {
      "Time_Start": 1273.66,
      "Time_End": 1279.96,
      "Text": " something in the real world that are used for terrorism, et cetera? You find some of these"
    },
    {
      "Time_Start": 1279.96,
      "Time_End": 1285.96,
      "Text": " attacks, and you can find a sweet spot in 2008, let's say 2008, 2010, when attacks become"
    },
    {
      "Time_Start": 1291.16,
      "Time_End": 1297.16,
      "Text": " real world attacks. So, of course, we can have in mind Stuxnet or some pipelines blowing,"
    },
    {
      "Time_Start": 1299.66,
      "Time_End": 1305.66,
      "Text": " et cetera. So, we have a curve of real world attacks that is coming for 10 years now. And"
    },
    {
      "Time_Start": 1310.16,
      "Time_End": 1316.16,
      "Text": " that we start to capture in the databases of real world attacks. So, I think that we are"
    },
    {
      "Time_Start": 1317.16,
      "Time_End": 1323.16,
      "Text": " exposing ourself to what science fiction showed to us for years. And we are doing that because"
    },
    {
      "Time_Start": 1328.8600000000001,
      "Time_End": 1334.8600000000001,
      "Text": " we are digitalizing things. But anyway, the point is, what can we do now to prevent that?"
    },
    {
      "Time_Start": 1335.8600000000001,
      "Time_End": 1341.8600000000001,
      "Text": " And is there some solutions in science fiction? I will stop just a second to see if we can"
    },
    {
      "Time_Start": 1348.8600000000001,
      "Time_End": 1354.8600000000001,
      "Text": " get some sort of presentation back. Sorry about that. Okay. So, like I said, 2008, the"
    },
    {
      "Time_Start": 1355.8600000000001,
      "Time_End": 1361.8600000000001,
      "Text": " first reported real world accidents due to hacking. So, pipeline blowing. And in 2010,"
    },
    {
      "Time_Start": 1371.0600000000002,
      "Time_End": 1379.0600000000002,
      "Text": " Stuxnet. So, let's have a quick stop on two examples of physical threats or attacks. Hacking"
    },
    {
      "Time_Start": 1379.06,
      "Time_End": 1385.06,
      "Text": " a nuclear plant or hacking a pacemaker. So, two examples of real world potential attacks"
    },
    {
      "Time_Start": 1385.06,
      "Time_End": 1391.56,
      "Text": " or threats. So, if we're speaking of nuclear plants, interestingly enough, the first"
    },
    {
      "Time_Start": 1391.56,
      "Time_End": 1397.56,
      "Text": " appearance of hacking a nuclear plant in science fiction is quite old. It's like 1984. A movie"
    },
    {
      "Time_Start": 1399.76,
      "Time_End": 1405.76,
      "Text": " called where a college kid hacked into a nuclear plant, et cetera, et cetera. This is a"
    },
    {
      "Time_Start": 1409.26,
      "Time_End": 1413.26,
      "Text": " movie. Actually, I think it's not surprising. Because if you are careful enough, the guys"
    },
    {
      "Time_Start": 1413.26,
      "Time_End": 1419.26,
      "Text": " in the nuclear plant cannot spell conference correctly. It's conference. But anyway, they"
    },
    {
      "Time_Start": 1421.26,
      "Time_End": 1427.26,
      "Text": " managed to hack into it. And we had to wait 2010 to have the first nuclear plant hacking"
    },
    {
      "Time_Start": 1431.26,
      "Time_End": 1437.26,
      "Text": " with Stuxnet. So, in that case, science fiction was very early before we had a nuclear plant."
    },
    {
      "Time_Start": 1439.26,
      "Time_End": 1445.26,
      "Text": " Before the real world attack and before the real world exposure. The pacemaker case, it's"
    },
    {
      "Time_Start": 1448.56,
      "Time_End": 1454.56,
      "Text": " a little different. Because the first appearance is in reality. In 2008, a scientific paper"
    },
    {
      "Time_Start": 1460.1399999999999,
      "Time_End": 1466.1399999999999,
      "Text": " showing some potential vulnerabilities in pacemakers. And in 2012, at the end of the year,"
    },
    {
      "Time_Start": 1469.26,
      "Time_End": 1475.26,
      "Text": " 2012, there was an episode showing the murder of the vice president with the hacking of"
    },
    {
      "Time_Start": 1478.26,
      "Time_End": 1484.26,
      "Text": " his pacemaker. So, what he's doing now is to gather the ID number of the pacemaker. And look"
    },
    {
      "Time_Start": 1487.8,
      "Time_End": 1493.8,
      "Text": " at 2013, the actual vice president dictionary removed the features of his pacemaker. And he"
    },
    {
      "Time_Start": 1494.8,
      "Time_End": 1500.8,
      "Text": " said publicly that, yes, he saw the TV show and, yes, it's credible and it's an accurate"
    },
    {
      "Time_Start": 1505.8799999999999,
      "Time_End": 1511.8799999999999,
      "Text": " representation of what was possible. So, he did not read the scientific paper in 2008. But"
    },
    {
      "Time_Start": 1514.5,
      "Time_End": 1520.5,
      "Text": " he saw the episode and decided to remove the functionality. In 2017, there was a"
    },
    {
      "Time_Start": 1524.04,
      "Time_End": 1530.04,
      "Text": " recall of half a million pacemakers to fix, to patch some vulnerability that made the"
    },
    {
      "Time_Start": 1532.3799999999999,
      "Time_End": 1539.08,
      "Text": " pacemaker hackable. And in 2018, there was a presentation, I mean at Black Hat, but at"
    },
    {
      "Time_Start": 1539.08,
      "Time_End": 1545.08,
      "Text": " DEFCON 2, about a threat in the pacemakers. So, in that case, the science fiction was lagging"
    },
    {
      "Time_Start": 1546.08,
      "Time_End": 1552.08,
      "Text": " behind the reality. But I think that we can say that the reality reacts to the science fiction"
    },
    {
      "Time_Start": 1560.12,
      "Time_End": 1566.12,
      "Text": " more than the scientific publication. So, for the last part, try to go on a more positive"
    },
    {
      "Time_Start": 1566.6200000000001,
      "Time_End": 1572.6200000000001,
      "Text": " vibe and to see how we can use the science fiction and study the science fiction to innovate."
    },
    {
      "Time_Start": 1584.6200000000001,
      "Time_End": 1592.1200000000001,
      "Text": " So, for the moment, it was a very glimpse on a very quantitative approach. And now, we"
    },
    {
      "Time_Start": 1592.1200000000001,
      "Time_End": 1598.3200000000002,
      "Text": " will be more of a qualitative approach with an example of an innovation track. So, nothing"
    },
    {
      "Time_Start": 1598.3200000000002,
      "Time_End": 1604.3200000000002,
      "Text": " really fancy, but let's try. So, as we gathered a lot, lot, lot of pictures and a lot of movies,"
    },
    {
      "Time_Start": 1608.0800000000002,
      "Time_End": 1613.8200000000002,
      "Text": " et cetera, et cetera, we found that the representation of the cartographic map was"
    },
    {
      "Time_Start": 1613.8200000000002,
      "Time_End": 1620.2800000000002,
      "Text": " something that was coming very often in the science fiction and very often in the real world."
    },
    {
      "Time_Start": 1620.28,
      "Time_End": 1626.28,
      "Text": " So, we can see on any vendor site, some cartographic representation of the threats and"
    },
    {
      "Time_Start": 1629.28,
      "Time_End": 1637.28,
      "Text": " attacks, et cetera. I don't know if they know that, but actually, it's from a science fiction movie,"
    },
    {
      "Time_Start": 1637.28,
      "Time_End": 1644.28,
      "Text": " a very great movie in 1970 called Colossus, the Forbidden Project with robots, AI, et cetera."
    },
    {
      "Time_Start": 1644.28,
      "Time_End": 1650.28,
      "Text": " Very, very great movie, where you can see the threats moving on the map. And so, we ask"
    },
    {
      "Time_Start": 1652.62,
      "Time_End": 1658.62,
      "Text": " ourselves, is it the best representation of cyber threats, this geographical map? Not sure of"
    },
    {
      "Time_Start": 1661.12,
      "Time_End": 1669.12,
      "Text": " that. So, we dig a little bit on geographical representation and we found the work of the"
    },
    {
      "Time_Start": 1669.1200000000001,
      "Time_End": 1675.1200000000001,
      "Text": " professor about health and about a way of representing pandemics. So, he made this"
    },
    {
      "Time_Start": 1681.6200000000001,
      "Time_End": 1687.6200000000001,
      "Text": " simulation with a standard representation of a virus spreading on the earth. So, you can look,"
    },
    {
      "Time_Start": 1690.88,
      "Time_End": 1696.88,
      "Text": " it's, I mean, okay, it's blinking, it's red. You clearly see that it's a problem, it's a pandemic,"
    },
    {
      "Time_Start": 1699.88,
      "Time_End": 1705.88,
      "Text": " but we cannot get a lot of information of it. And so, this professor said, okay, let's make the"
    },
    {
      "Time_Start": 1710.88,
      "Time_End": 1716.88,
      "Text": " exact same simulation of a pandemic, but instead of having a cartographic map, let's have a map"
    },
    {
      "Time_Start": 1720.96,
      "Time_End": 1726.96,
      "Text": " of the duration of the flights between airports. So, at the middle, we have the airport,"
    },
    {
      "Time_Start": 1729.1200000000001,
      "Time_End": 1735.1200000000001,
      "Text": " the start of the pandemic, and then you have all the cities by time of flight airport to airport."
    },
    {
      "Time_Start": 1737.7600000000002,
      "Time_End": 1743.7600000000002,
      "Text": " And, of course, he found out that it is useful, because you can clearly predict where the"
    },
    {
      "Time_Start": 1749.2,
      "Time_End": 1755.2,
      "Text": " pandemic will hit and at which stage. So, we get this first thing about cartographic map,"
    },
    {
      "Time_Start": 1759.8000000000002,
      "Time_End": 1765.3400000000001,
      "Text": " and we continue the work, and we found other work, a scientific work about cartography. This"
    },
    {
      "Time_Start": 1765.3400000000001,
      "Time_End": 1771.3400000000001,
      "Text": " one is about banks' risk, how to map the risk on the attack from a DAB or from an agency on a"
    },
    {
      "Time_Start": 1777.96,
      "Time_End": 1785.3400000000001,
      "Text": " bank. And those guys made something pretty funny to look at. They make this first cartography,"
    },
    {
      "Time_Start": 1785.3400000000001,
      "Time_End": 1791.3400000000001,
      "Text": " and then they decided to represent geographically with Lego the whole system. So, the DAB, the"
    },
    {
      "Time_Start": 1796.0600000000002,
      "Time_End": 1802.0600000000002,
      "Text": " bank, the bank servers, et cetera. And at last, they put a little camera on the attacker to see"
    },
    {
      "Time_Start": 1805.5600000000002,
      "Time_End": 1811.5600000000002,
      "Text": " the point of view of the attacker. And to say, okay, we can see what it can reach easily, what"
    },
    {
      "Time_Start": 1812.32,
      "Time_End": 1818.32,
      "Text": " is hidden behind something, et cetera, et cetera. So, we decided to mix as an experiment. It's not"
    },
    {
      "Time_Start": 1822.86,
      "Time_End": 1830.52,
      "Text": " a real innovation. It's just an experiment. We decided to mix the two representations and say,"
    },
    {
      "Time_Start": 1830.52,
      "Time_End": 1836.52,
      "Text": " okay, what if we picture a cyber attack with a distance by connection and not a map of the"
    },
    {
      "Time_Start": 1836.86,
      "Time_End": 1842.86,
      "Text": " network. With a distance by connection. And we, like in this picture, and we take the point of"
    },
    {
      "Time_Start": 1849.94,
      "Time_End": 1855.78,
      "Text": " view of the attacker, of the point of view of the malware, for example, on the network. And then"
    },
    {
      "Time_Start": 1855.78,
      "Time_End": 1862.44,
      "Text": " we say, okay, perhaps it can look something like that. If you put some VR, it's okay. I will put"
    },
    {
      "Time_Start": 1862.44,
      "Time_End": 1868.44,
      "Text": " my VR lens and then I will go straight into the network and at the place where the malware is"
    },
    {
      "Time_Start": 1871.24,
      "Time_End": 1878.1200000000001,
      "Text": " detected and I can say, okay, from here, I can see this system. I can see this one. This one is"
    },
    {
      "Time_Start": 1878.1200000000001,
      "Time_End": 1884.1200000000001,
      "Text": " protected enough, but I think that I can reach the OT network in one jump or two, et cetera. So,"
    },
    {
      "Time_Start": 1885.0800000000002,
      "Time_End": 1891.0800000000002,
      "Text": " of course, if we elaborate that, we can draft some information and perhaps we can work with the"
    },
    {
      "Time_Start": 1895.46,
      "Time_End": 1901.46,
      "Text": " team in the SOC to be able to react more efficiently with a typical SOC. I mean, when you"
    },
    {
      "Time_Start": 1907.8000000000002,
      "Time_End": 1912.2600000000002,
      "Text": " look at the picture of a SOC, it's a wall of screen. Everybody is looking at the screen."
    },
    {
      "Time_Start": 1912.26,
      "Time_End": 1918.26,
      "Text": " Nobody is talking to each other. It's very strange. So, again, we use the science fiction to"
    },
    {
      "Time_Start": 1920.48,
      "Time_End": 1927.36,
      "Text": " say, okay, in the movies, what are the SOCs? So the first thing that we found out is that the"
    },
    {
      "Time_Start": 1927.36,
      "Time_End": 1933.36,
      "Text": " people are talking to each other. So we designed some draft of an SOC where people sit around"
    },
    {
      "Time_Start": 1933.7,
      "Time_End": 1939.7,
      "Text": " tables. They can see each other. They can have a big screen if needed. And, of course, you can"
    },
    {
      "Time_Start": 1944.1200000000001,
      "Time_End": 1950.1200000000001,
      "Text": " see the guy on the left with the guy inside the attack that we see previously. He's working"
    },
    {
      "Time_Start": 1955.7800000000002,
      "Time_End": 1961.7800000000002,
      "Text": " with his teammates. He can send data to the workstation. And he can see what is happening."
    },
    {
      "Time_Start": 1963.6200000000001,
      "Time_End": 1969.6200000000001,
      "Text": " And when we are done, when we are here, what we have to do is to get back to reality and to"
    },
    {
      "Time_Start": 1972.3600000000001,
      "Time_End": 1978.3600000000001,
      "Text": " project something that is tangible, that some people can think about, okay, yes, it's real. It"
    },
    {
      "Time_Start": 1981.5000000000002,
      "Time_End": 1987.5000000000002,
      "Text": " can be done. So we just try to picture that and say, okay, let's remove the two fancy things"
    },
    {
      "Time_Start": 1987.92,
      "Time_End": 1993.92,
      "Text": " but we can have some screen in the middle. We can have people sitting and people working"
    },
    {
      "Time_Start": 1998.46,
      "Time_End": 2004.46,
      "Text": " together. We can have this guy with this VR lens to work on the SOC. So that is, again, it's"
    },
    {
      "Time_Start": 2010.42,
      "Time_End": 2016.42,
      "Text": " not product. It's not an innovation. It's just a picture of, okay, we can use and we can"
    },
    {
      "Time_Start": 2018.08,
      "Time_End": 2024.08,
      "Text": " wrap up like that. We can use science fiction to see macro tendencies. For example, the"
    },
    {
      "Time_Start": 2026.34,
      "Time_End": 2032.34,
      "Text": " macro tendency that we missed is that the world will be aggressive and the cyber attacks will"
    },
    {
      "Time_Start": 2034.5,
      "Time_End": 2040.5,
      "Text": " convert to real world attacks. It was clearly present in the science fiction and we did not see"
    },
    {
      "Time_Start": 2040.92,
      "Time_End": 2046.92,
      "Text": " that coming in 2008 and 2010. So that's the macro vision. We can use the science fiction on a"
    },
    {
      "Time_Start": 2050.76,
      "Time_End": 2057.96,
      "Text": " more specific vision when we say, for example, for the nuclear plants or for the pacemaker and"
    },
    {
      "Time_Start": 2057.96,
      "Time_End": 2063.96,
      "Text": " to say, okay, if it's coming, what we can do. We saw that we can use it to raise awareness. So"
    },
    {
      "Time_Start": 2064.96,
      "Time_End": 2070.84,
      "Text": " instead of just gathering information for the science fiction, we can produce content. We can"
    },
    {
      "Time_Start": 2070.84,
      "Time_End": 2076.84,
      "Text": " produce movies. We can produce art to raise the awareness of people on the subject. And, of"
    },
    {
      "Time_Start": 2079.38,
      "Time_End": 2087.04,
      "Text": " course, we can innovate because we can figure what kind of threats will come or what kind of"
    },
    {
      "Time_Start": 2087.08,
      "Time_End": 2093.08,
      "Text": " defense we would like to have. So to conclude, I would say that this is a starting project,"
    },
    {
      "Time_Start": 2098.3,
      "Time_End": 2106.3,
      "Text": " a starting research project. So just eight months ago I was sharing the information with you. If"
    },
    {
      "Time_Start": 2106.3,
      "Time_End": 2112.3,
      "Text": " any of you are interested to participate or to know something about, please just ping us or"
    },
    {
      "Time_Start": 2113.3,
      "Time_End": 2119.3,
      "Text": " follow us on Twitter, for example. We will publish soon the information about the group that"
    },
    {
      "Time_Start": 2123.76,
      "Time_End": 2129.76,
      "Text": " will be found like an open research group to dig in this subject of what we can learn about"
    },
    {
      "Time_Start": 2130.76,
      "Time_End": 2136.76,
      "Text": " science fiction, what we can do with science fiction and what we can change in the future, how"
    },
    {
      "Time_Start": 2142.26,
      "Time_End": 2148.26,
      "Text": " we can shape the future of cyber defense. So if you want to watch a movie and work with us on"
    },
    {
      "Time_Start": 2149.5200000000004,
      "Time_End": 2155.5200000000004,
      "Text": " the project, please give us a word. So thank you. Thank you very much for your presence."
    },
    {
      "Time_Start": 2155.74,
      "Time_End": 2161.74,
      "Text": " Sorry for the bug in the middle of the presentation. And I think we have some minutes for a"
    },
    {
      "Time_Start": 2166.28,
      "Time_End": 2172.28,
      "Text": " few questions, if there are. Thank you. Thank you very much."
    }
  ]
}