{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 8.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hey, everyone. Thanks for coming to the party. Show of hands, who here is this year's first"
    },
    {
      "Time_Start": 8.0,
      "Time_End": 19.0,
      "Text": " DEF CON? Okay, so we had a DEF CON 101 panel yesterday for newbies. This isn't that, but"
    },
    {
      "Time_Start": 19.0,
      "Time_End": 25.0,
      "Text": " what I'm going to do is cover a lot of some of the same stuff. So you'll hear a little bit"
    },
    {
      "Time_Start": 25.0,
      "Time_End": 29.0,
      "Text": " of DEF CON history. You'll hear a little bit about what's been going on this year. So with"
    },
    {
      "Time_Start": 29.0,
      "Time_End": 45.0,
      "Text": " that said, welcome to DEF CON 31. So this started as a sort of a party 31 years ago. And"
    },
    {
      "Time_Start": 45.0,
      "Time_End": 51.0,
      "Text": " the original origin story was essentially there's a lot of bullshit going around online."
    },
    {
      "Time_Start": 51.0,
      "Time_End": 57.0,
      "Text": " Well, in the bulletin board days. And people would say the most ridiculous stuff. Like"
    },
    {
      "Time_Start": 57.0,
      "Time_End": 61.0,
      "Text": " phone freaking was a thing back then because calling long distance was really expensive. So"
    },
    {
      "Time_Start": 61.0,
      "Time_End": 65.0,
      "Text": " people would come up with all these ways to try to make free phone calls. And so that"
    },
    {
      "Time_Start": 65.0,
      "Time_End": 72.0,
      "Text": " involved fraud. And so then people would be concerned that maybe they would get traced or"
    },
    {
      "Time_Start": 72.0,
      "Time_End": 76.0,
      "Text": " the telco would figure out their home phone number. And so there's all this nonsensical"
    },
    {
      "Time_Start": 76.0,
      "Time_End": 82.0,
      "Text": " stuff. Like if you run the jammer program, it dials these magical phone numbers and then"
    },
    {
      "Time_Start": 82.0,
      "Time_End": 87.0,
      "Text": " nobody can trace you. You're fine. You can do whatever you want on your home phone. And"
    },
    {
      "Time_Start": 87.0,
      "Time_End": 93.0,
      "Text": " you'd be like, that doesn't, like, I don't think phone switching works that way. So when we"
    },
    {
      "Time_Start": 93.0,
      "Time_End": 97.0,
      "Text": " were trying to figure out the conference, like what are we going to do at a conference that was"
    },
    {
      "Time_Start": 97.0,
      "Time_End": 101.0,
      "Text": " originally supposed to be a party, but we should, I really wanted to dispel a lot of this"
    },
    {
      "Time_Start": 101.0,
      "Time_End": 107.0,
      "Text": " nonsense. Okay. So we need to find somebody who can explain to the audience, to the other"
    },
    {
      "Time_Start": 107.0,
      "Time_End": 112.0,
      "Text": " hackers, why the jammer is not working. And then people would say stuff like, well, on my"
    },
    {
      "Time_Start": 112.0,
      "Time_End": 118.0,
      "Text": " bulletin board if I have my home screen and it says no law enforcement allowed. And they then"
    },
    {
      "Time_Start": 118.0,
      "Time_End": 126.0,
      "Text": " connect. That's entrapment. Like, I don't think it works that way. I think there's probably a"
    },
    {
      "Time_Start": 126.0,
      "Time_End": 132.0,
      "Text": " way around that for law enforcement. So we got Gail Thackeray who was the prosecutor at the"
    },
    {
      "Time_Start": 132.0,
      "Time_End": 138.0,
      "Text": " time who just prosecuted the first cyber crime case, Operation Sun Devil in Maricopa County,"
    },
    {
      "Time_Start": 138.0,
      "Time_End": 144.0,
      "Text": " Arizona. So Gail Thackeray comes. And then the Internet is a thing. And we're like, gosh,"
    },
    {
      "Time_Start": 144.0,
      "Time_End": 149.0,
      "Text": " what's going on there? We should get somebody who really understands that. And so we got"
    },
    {
      "Time_Start": 149.0,
      "Time_End": 155.0,
      "Text": " Dan Farmer who was the person everybody wanted to be. The original hacking rock star. He"
    },
    {
      "Time_Start": 156.0,
      "Time_End": 162.0,
      "Text": " was in charge of security for Sun Microsystems when Sun was the Internet. And he gives a talk"
    },
    {
      "Time_Start": 162.0,
      "Time_End": 168.0,
      "Text": " about how problematic it is as Sun was growing. There's so many computers on their network, he"
    },
    {
      "Time_Start": 168.0,
      "Time_End": 174.0,
      "Text": " couldn't spend time on all of them, securing them. So what he's going to do, he's going to try to"
    },
    {
      "Time_Start": 174.0,
      "Time_End": 180.0,
      "Text": " write scripts to scan his Sun network to find security vulnerabilities. And it will be like the"
    },
    {
      "Time_Start": 180.0,
      "Time_End": 186.0,
      "Text": " security automation network tool. And it gets them on the front page of Time Magazine. And"
    },
    {
      "Time_Start": 186.0,
      "Time_End": 192.0,
      "Text": " that was the first scanning tool called Satan. And so the whole purpose is to try to get you"
    },
    {
      "Time_Start": 192.0,
      "Time_End": 198.0,
      "Text": " in front of the people that are doing the thing. And trying to dispel the nonsense. And it"
    },
    {
      "Time_Start": 198.0,
      "Time_End": 204.0,
      "Text": " wasn't a master plan of mine. It just sort of worked out that way. And I've just been smart"
    },
    {
      "Time_Start": 205.0,
      "Time_End": 211.0,
      "Text": " enough to steer clear. Not mess with it too much. And so that's essentially how we've turned"
    },
    {
      "Time_Start": 211.0,
      "Time_End": 217.0,
      "Text": " in today. Balancing the partying and the social with trying to get you the technical. The"
    },
    {
      "Time_Start": 217.0,
      "Time_End": 223.0,
      "Text": " other thing is we try to do is as we've grown, we've realized that we've turned into like a"
    },
    {
      "Time_Start": 223.0,
      "Time_End": 229.0,
      "Text": " conference of conferences. We're like a meta conference. And so DEF CON, the main DEF CON, we"
    },
    {
      "Time_Start": 229.0,
      "Time_End": 235.0,
      "Text": " spend a lot of time trying to figure out who to give space to. Who to give stage time. Who to"
    },
    {
      "Time_Start": 235.0,
      "Time_End": 241.0,
      "Text": " platform. Literally put you on the platform. And so that's why you'll see churn. You'll see"
    },
    {
      "Time_Start": 241.0,
      "Time_End": 247.0,
      "Text": " contests come and go. You'll see a village try something for a few years and go. And if you do"
    },
    {
      "Time_Start": 247.0,
      "Time_End": 253.0,
      "Text": " well, we'll give you more space. And if you don't do well, you get less space. And it just"
    },
    {
      "Time_Start": 253.0,
      "Time_End": 259.0,
      "Text": " morphs over the years. So all of this is possible because of goons. We have over, the"
    },
    {
      "Time_Start": 263.0,
      "Time_End": 270.0,
      "Text": " people in the red shirts, we have over 500 goons that make the onsite operations possible. So"
    },
    {
      "Time_Start": 270.0,
      "Time_End": 276.0,
      "Text": " yay goons. Give it up. It's pretty fantastic because, you know, once you're in the goon"
    },
    {
      "Time_Start": 277.0,
      "Time_End": 283.0,
      "Text": " brotherhood, you're sort of like one of us. But we don't give a shit who you are in the real"
    },
    {
      "Time_Start": 285.2,
      "Time_End": 291.0,
      "Text": " world. And so you'll have like CSOs of billion dollar companies crawling around pulling"
    },
    {
      "Time_Start": 291.0,
      "Time_End": 296.0,
      "Text": " network cable. You'll have head of procurement for the Department of Defense for a while"
    },
    {
      "Time_Start": 296.0,
      "Time_End": 301.84,
      "Text": " pulling cable for years. And they just want to hang out and kind of be with their peeps. And so"
    },
    {
      "Time_Start": 301.84000000000003,
      "Time_End": 307.84000000000003,
      "Text": " that's what's also pretty cool is you never know who you're talking to. And that's part of the"
    },
    {
      "Time_Start": 307.84000000000003,
      "Time_End": 313.84000000000003,
      "Text": " fear and excitement of who's next to you. The other thing is it takes over probably 1,500,"
    },
    {
      "Time_Start": 316.08000000000004,
      "Time_End": 322.08000000000004,
      "Text": " about maybe 1,500 or more, maybe 2,000 people, the people creating the content. The"
    },
    {
      "Time_Start": 324.8,
      "Time_End": 331.3,
      "Text": " creators. There's almost 2,000. They run contests and events and villages. They run stuff"
    },
    {
      "Time_Start": 331.34000000000003,
      "Time_End": 337.34000000000003,
      "Text": " online. They build art. They play music. They design infrastructure. They build this"
    },
    {
      "Time_Start": 338.92,
      "Time_End": 344.92,
      "Text": " podium. A great art collective. So there's tons of people that give so much of themselves to"
    },
    {
      "Time_Start": 347.0,
      "Time_End": 350.76,
      "Text": " make this happen. And if you notice, you know, we're not super slick. We don't spend a lot of"
    },
    {
      "Time_Start": 350.76,
      "Time_End": 356.76,
      "Text": " money on a whole lot of what I consider sort of unimportant sort of puffery. We try to"
    },
    {
      "Time_Start": 357.5,
      "Time_End": 363.5,
      "Text": " keep the price as low as possible. I can't control the economy. I'm really sorry about the"
    },
    {
      "Time_Start": 363.5,
      "Time_End": 369.5,
      "Text": " price increase this year. But we try to focus on the things that we think matter. And that's"
    },
    {
      "Time_Start": 370.96,
      "Time_End": 376.96,
      "Text": " supporting content creators, supporting goons, and trying to fund our legal defense, pay"
    },
    {
      "Time_Start": 378.71999999999997,
      "Time_End": 384.71999999999997,
      "Text": " insurance companies. So we can keep this going. And because of that model, we're not"
    },
    {
      "Time_Start": 386.76,
      "Time_End": 392.18,
      "Text": " we had enough money saved in the bank to survive COVID. Which is fantastic. I'm just a"
    },
    {
      "Time_Start": 392.18,
      "Time_End": 398.3,
      "Text": " compulsively worrier on a lot of things. But that allowed us to do the DEF CON 28 for free"
    },
    {
      "Time_Start": 398.3,
      "Time_End": 405.3,
      "Text": " online. It allowed us to survive to DEF CON 29. And here we are again. Back up to full speed."
    },
    {
      "Time_Start": 405.3,
      "Time_End": 410.38,
      "Text": " And that's because we just try to focus on our core. And the community is really our core. And"
    },
    {
      "Time_Start": 410.38,
      "Time_End": 416.59999999999997,
      "Text": " if you think about it a little bit, our community, this community right here in the room,"
    },
    {
      "Time_Start": 416.6,
      "Time_End": 423.06,
      "Text": " we've become more I would say relevant and more important over the last probably five or"
    },
    {
      "Time_Start": 423.06,
      "Time_End": 429.06,
      "Text": " ten years. And it's I feel a little uncomfortable saying that. But it's true. After this"
    },
    {
      "Time_Start": 431.44,
      "Time_End": 437.44,
      "Text": " talk, I'm having a conversation with the Secretary of Homeland Security. Like he's not"
    },
    {
      "Time_Start": 437.44,
      "Time_End": 444.40000000000003,
      "Text": " coming here because it's unimportant to the department. Right? It's like what we're doing is"
    },
    {
      "Time_Start": 444.40000000000003,
      "Time_End": 449.58000000000004,
      "Text": " relevant not to just our country but to countries around the world. And I think that's"
    },
    {
      "Time_Start": 449.58000000000004,
      "Time_End": 456.90000000000003,
      "Text": " because Internet problems are really global problems. And now we're seeing AI problems are"
    },
    {
      "Time_Start": 456.90000000000003,
      "Time_End": 462.90000000000003,
      "Text": " going to be global problems. And we sort of are acting as this sort of third party civil"
    },
    {
      "Time_Start": 465.44000000000005,
      "Time_End": 471.78000000000003,
      "Text": " society like validators. So for example, the lock manufacturer is not going to tell you"
    },
    {
      "Time_Start": 471.82000000000005,
      "Time_End": 477.66,
      "Text": " that their lock is a piece of shit. Right? Like every master lock, you read that master lock"
    },
    {
      "Time_Start": 477.66,
      "Time_End": 483.04,
      "Text": " thing and it's like this is the best thing in the world. It will keep the pink panther out. And"
    },
    {
      "Time_Start": 483.04,
      "Time_End": 487.46000000000004,
      "Text": " then you go to the lock picking village and it's like boop, done. You're like no, no, wait."
    },
    {
      "Time_Start": 487.46000000000004,
      "Time_End": 492.04,
      "Text": " No, there's more to it than that. You're like a professional. Like no, I just sat down five"
    },
    {
      "Time_Start": 492.04,
      "Time_End": 497.78000000000003,
      "Text": " minutes ago. See, look. It's open. You're like, well, who's talking about this? Well, the"
    },
    {
      "Time_Start": 497.82000000000005,
      "Time_End": 501.62,
      "Text": " government doesn't regulate locks and the lock manufacturer doesn't and they have a"
    },
    {
      "Time_Start": 501.62,
      "Time_End": 509.86,
      "Text": " marketing budget. Lock smiths are very protective of their territory. Right? So who talks"
    },
    {
      "Time_Start": 509.86,
      "Time_End": 513.82,
      "Text": " about locks? Well, it's us. It's our community started talking about picking locks and"
    },
    {
      "Time_Start": 513.82,
      "Time_End": 519.6600000000001,
      "Text": " safes. Access control. Who's talking about access control systems? Implanted medical"
    },
    {
      "Time_Start": 519.66,
      "Time_End": 528.66,
      "Text": " devices. That was DEF CON. Insulin pump talks. Automotive. Aerospace. Right? And so what's"
    },
    {
      "Time_Start": 528.66,
      "Time_End": 532.9599999999999,
      "Text": " happening is the dynamic is companies don't have a financial incentive to reveal their"
    },
    {
      "Time_Start": 532.9599999999999,
      "Time_End": 538.54,
      "Text": " problems. Organized criminals taking advantage of those problems definitely don't have an"
    },
    {
      "Time_Start": 538.54,
      "Time_End": 542.42,
      "Text": " incentive to tell the world how they're using the technology to steal money or commit"
    },
    {
      "Time_Start": 542.42,
      "Time_End": 547.66,
      "Text": " crimes or espionage. Government agencies half the time might be using those exploits for"
    },
    {
      "Time_Start": 547.6999999999999,
      "Time_End": 553.8,
      "Text": " law enforcement purposes. But that's fine. Pursue your law enforcement objectives. But I"
    },
    {
      "Time_Start": 553.8,
      "Time_End": 558.0799999999999,
      "Text": " just want to be able to buy a better lock. You know? I want things to get better in my"
    },
    {
      "Time_Start": 558.0799999999999,
      "Time_End": 566.38,
      "Text": " lifetime. And so it's up to us, hackers, researchers, academics. We're the ones that are"
    },
    {
      "Time_Start": 566.38,
      "Time_End": 572.8,
      "Text": " speaking truth to power and telling the world what works and what doesn't work and why. And"
    },
    {
      "Time_Start": 572.8000000000001,
      "Time_End": 578.8000000000001,
      "Text": " I think that function has only gotten more important as the technology has become more"
    },
    {
      "Time_Start": 578.8000000000001,
      "Time_End": 585.1400000000001,
      "Text": " embedded. And now with AI we're going to become more relevant. Space. Right? So, yeah,"
    },
    {
      "Time_Start": 585.1400000000001,
      "Time_End": 590.2600000000001,
      "Text": " have a party and hang out and meet people. But remember also what you're trying to do is"
    },
    {
      "Time_Start": 590.2600000000001,
      "Time_End": 596.5600000000001,
      "Text": " you're trying to help make society a little bit better by speaking truth to power. And it's"
    },
    {
      "Time_Start": 596.5600000000001,
      "Time_End": 600.1400000000001,
      "Text": " not easy. Right? We had a couple talks pulled this year. Intimidation from giant"
    },
    {
      "Time_Start": 600.14,
      "Time_End": 606.6,
      "Text": " corporation. Lawyers involved. People threatening to quit, get fired. I mean, every year"
    },
    {
      "Time_Start": 606.6,
      "Time_End": 611.64,
      "Text": " there's a tension between companies trying to protect themselves and researchers trying to"
    },
    {
      "Time_Start": 611.64,
      "Time_End": 616.06,
      "Text": " reveal information. And that's why we have friends like the Electronic Frontier"
    },
    {
      "Time_Start": 616.06,
      "Time_End": 621.9399999999999,
      "Text": " Foundation and Coder's Rights where they're the experts. Right? If you have a question or"
    },
    {
      "Time_Start": 621.9399999999999,
      "Time_End": 626.4399999999999,
      "Text": " you're feeling intimidated or you're not quite sure if you should do something, the EFF has"
    },
    {
      "Time_Start": 626.44,
      "Time_End": 632.36,
      "Text": " been with us for decades. And they're there to fulfill their role in our community to help"
    },
    {
      "Time_Start": 632.36,
      "Time_End": 638.36,
      "Text": " be the legal protectors. So, also want to give a shout out to EFF. Yay. Good job, guys."
    },
    {
      "Time_Start": 638.36,
      "Time_End": 646.36,
      "Text": " So, a couple operational things for the show this year. Every year since the very first one"
    },
    {
      "Time_Start": 646.4,
      "Time_End": 652.4,
      "Text": " we always try to make things better. And sometimes it works and sometimes it doesn't. And"
    },
    {
      "Time_Start": 657.2,
      "Time_End": 662.7,
      "Text": " so, for example, this year, there's a lot of questions. Right? The badges are still"
    },
    {
      "Time_Start": 662.7,
      "Time_End": 669.02,
      "Text": " arriving. And our plan is to as we get more real badges from the manufacturer, we'll be doing"
    },
    {
      "Time_Start": 669.02,
      "Time_End": 674.02,
      "Text": " swap outs. And normally what a swap out entails is goons walking around with big bags of"
    },
    {
      "Time_Start": 674.06,
      "Time_End": 678.86,
      "Text": " badges and if they see you with the wrong kind of older paper badge or plastic badge,"
    },
    {
      "Time_Start": 678.86,
      "Time_End": 685.52,
      "Text": " temporary badge, they'll swap it out. Or we'll put them at the info booths. But our plan is as"
    },
    {
      "Time_Start": 685.52,
      "Time_End": 691.52,
      "Text": " we get more in, we'll be doing swap outs. We even have somebody, we're trying to figure out"
    },
    {
      "Time_Start": 691.52,
      "Time_End": 697.4399999999999,
      "Text": " how to fly them on an airplane on a Sunday morning to fly back here from the facility with"
    },
    {
      "Time_Start": 697.4399999999999,
      "Time_End": 703.98,
      "Text": " boxes. I mean, we're doing everything we can to untangle it. But when it's all said and"
    },
    {
      "Time_Start": 703.98,
      "Time_End": 709.82,
      "Text": " done, if you go to the badge talk, you can see the pictures and hear the gory details if"
    },
    {
      "Time_Start": 709.82,
      "Time_End": 715.82,
      "Text": " you're kind of into accident porn. So I hope that doesn't start your vibe off wrong. But"
    },
    {
      "Time_Start": 719.28,
      "Time_End": 724.36,
      "Text": " every year we alternate between an electronic badge and a physical badge. And the reason"
    },
    {
      "Time_Start": 724.36,
      "Time_End": 730.86,
      "Text": " is, electronic badges are expensive and complicated. And physical badges are generally"
    },
    {
      "Time_Start": 730.86,
      "Time_End": 736.54,
      "Text": " less expensive. Also complicated. And it's a way of us trying to balance our budget over"
    },
    {
      "Time_Start": 736.54,
      "Time_End": 742.54,
      "Text": " the long run. But DEF CON 29, it was an electronic year. DEF CON 30, it's an anniversary"
    },
    {
      "Time_Start": 745.78,
      "Time_End": 749.94,
      "Text": " year. Of course we have to do electronic badges. So we did two years of electronic badges."
    },
    {
      "Time_Start": 749.94,
      "Time_End": 754.24,
      "Text": " And so now the new tick tock cycle of going between electronic and physical and electronic"
    },
    {
      "Time_Start": 754.24,
      "Time_End": 759.58,
      "Text": " is starting again. So next year it will be an electronic badge. And the problem with that,"
    },
    {
      "Time_Start": 759.58,
      "Time_End": 766.0400000000001,
      "Text": " since we originated and invented the electronic badge, Joe Grand, you guys, the community"
    },
    {
      "Time_Start": 766.0400000000001,
      "Time_End": 770.46,
      "Text": " have totally outclassed us on some of the electronic badges. Because we have to produce"
    },
    {
      "Time_Start": 770.46,
      "Time_End": 776.08,
      "Text": " like 26,000 of them or something. And a lot of these cooler badges will produce like 200."
    },
    {
      "Time_Start": 776.08,
      "Time_End": 782.0,
      "Text": " And you just can't compete with that. So we're always trying to do instead something new."
    },
    {
      "Time_Start": 782.0,
      "Time_End": 788.5400000000001,
      "Text": " Aluminum. One time we did flexible badges. We always try to add something that we can get"
    },
    {
      "Time_Start": 788.54,
      "Time_End": 794.04,
      "Text": " our hands on, quantity 26,000 that you can't get your hands on, quantity 200. So it's a"
    },
    {
      "Time_Start": 794.04,
      "Time_End": 800.1999999999999,
      "Text": " really fascinating give and take in the badge space. And that kicked off hardware hacking"
    },
    {
      "Time_Start": 800.1999999999999,
      "Time_End": 806.8399999999999,
      "Text": " village and a lot of other stuff. And it ‑‑ okay, I'll just digress. I have five minutes"
    },
    {
      "Time_Start": 806.8399999999999,
      "Time_End": 811.62,
      "Text": " left but I really want to tell the story. Because it might be instrumental on our future battles"
    },
    {
      "Time_Start": 811.62,
      "Time_End": 817.8399999999999,
      "Text": " with AI. I was thinking all the movies and books you read, the hackers, the people fighting"
    },
    {
      "Time_Start": 817.84,
      "Time_End": 824.1800000000001,
      "Text": " against the evil intelligence or whatever, they always seem to know how to like fight back. And"
    },
    {
      "Time_Start": 824.1800000000001,
      "Time_End": 830.14,
      "Text": " I was thinking, well, nobody knows how to really hack hardware. So if we need to incubate"
    },
    {
      "Time_Start": 830.14,
      "Time_End": 835.34,
      "Text": " the next generation to be able to fight the Terminator, how are we going to do that? And"
    },
    {
      "Time_Start": 835.34,
      "Time_End": 839.5400000000001,
      "Text": " we're like, oh, an electronic badge. And then we'll get people to hack on the electronic badge"
    },
    {
      "Time_Start": 839.5400000000001,
      "Time_End": 843.72,
      "Text": " and it will be very simple and over time it will get more complicated. And it worked. It"
    },
    {
      "Time_Start": 843.72,
      "Time_End": 847.72,
      "Text": " totally worked like that. Everybody like was messing around with LEDs one year and five"
    },
    {
      "Time_Start": 847.72,
      "Time_End": 853.46,
      "Text": " years later they're making drone badges that fly around. It was amazing. And so, again, we"
    },
    {
      "Time_Start": 853.46,
      "Time_End": 859.26,
      "Text": " can plant seeds and see what the community does with them. And also hopefully prepare to"
    },
    {
      "Time_Start": 859.26,
      "Time_End": 865.26,
      "Text": " defeat our, you know, overlords. There's a lot of things going on here. And info.DEF CON"
    },
    {
      "Time_Start": 865.68,
      "Time_End": 871.68,
      "Text": " .org is the main repository for like all the schedule updates. The data from info.DEF CON .org"
    },
    {
      "Time_Start": 874.92,
      "Time_End": 879.92,
      "Text": " feeds hacker tracker app on your phone. So if you're using hacker tracker, it's all the same"
    },
    {
      "Time_Start": 879.92,
      "Time_End": 885.38,
      "Text": " data. One's more in a web presentation. The other's mobile. If you're in your hotel room, we"
    },
    {
      "Time_Start": 885.38,
      "Time_End": 891.88,
      "Text": " have DEF CON TV. You're just hung over or broke your foot walking too many feet. TV channels"
    },
    {
      "Time_Start": 891.88,
      "Time_End": 897.62,
      "Text": " we stream to all the con properties, all the five tracks. So if you feel like it's too"
    },
    {
      "Time_Start": 897.62,
      "Time_End": 902.74,
      "Text": " crowded, you can just chill in your room, have a room party. DEF CON TV also we're streaming"
    },
    {
      "Time_Start": 902.74,
      "Time_End": 908.2,
      "Text": " certain tracks based on bandwidth out to everybody, to the internet for free. And that's"
    },
    {
      "Time_Start": 908.2,
      "Time_End": 915.2,
      "Text": " another big thing we do with DEF CON is I try to release all the talks. Everything is free."
    },
    {
      "Time_Start": 915.2,
      "Time_End": 923.2,
      "Text": " And the origin of that was because I got lazy. I recorded DEF CON 1 on audio tape and I"
    },
    {
      "Time_Start": 923.2,
      "Time_End": 927.9000000000001,
      "Text": " was selling the audio tapes to help make money. And after a couple of years, I just didn't"
    },
    {
      "Time_Start": 927.9000000000001,
      "Time_End": 933.2800000000001,
      "Text": " want to do that anymore. And so we used real networks. And we just released the content for"
    },
    {
      "Time_Start": 933.2800000000001,
      "Time_End": 939.32,
      "Text": " free. But in doing that, and then when I started Black Hat and we released the Black Hat"
    },
    {
      "Time_Start": 939.32,
      "Time_End": 944.2,
      "Text": " content for free, accidentally what we were doing is we were creating a culture of sharing"
    },
    {
      "Time_Start": 944.2,
      "Time_End": 950.2,
      "Text": " information for free. And that culture started, what, 30 years ago. And that's why nobody"
    },
    {
      "Time_Start": 953.2,
      "Time_End": 957.58,
      "Text": " thinks twice about, well, of course I give away the content. Again, I would like to think"
    },
    {
      "Time_Start": 957.58,
      "Time_End": 962.86,
      "Text": " that that was a master plan. It was not. I was being lazy. Right? But now we get all this"
    },
    {
      "Time_Start": 962.86,
      "Time_End": 968.86,
      "Text": " stuff for free. It's great. So feel free to share and feel free to use our online resources."
    },
    {
      "Time_Start": 969.1800000000001,
      "Time_End": 975.94,
      "Text": " You know, we've been running the DEF CON forums for over 25 years. And online activities"
    },
    {
      "Time_Start": 975.94,
      "Time_End": 980.74,
      "Text": " come and gone over the years. Now it's more like on our DEF CON discord. You'll see in your"
    },
    {
      "Time_Start": 980.74,
      "Time_End": 987.82,
      "Text": " bag, we started a mastodon server, DEF CON dot social. Once the musk started wrecking"
    },
    {
      "Time_Start": 987.82,
      "Time_End": 993.74,
      "Text": " Twitter, we needed an escape hatch. So that's DEF CON dot social. And if that takes off and"
    },
    {
      "Time_Start": 993.74,
      "Time_End": 998.74,
      "Text": " people like it, we might do, you know, there's a distributed version for like a Reddit"
    },
    {
      "Time_Start": 998.74,
      "Time_End": 1005.04,
      "Text": " replacement and a pixel fed for Instagram. We'll think about do we want to run more services"
    },
    {
      "Time_Start": 1005.04,
      "Time_End": 1011.04,
      "Text": " to support the community. And let me see. Final thoughts? We were one of the first, I guess,"
    },
    {
      "Time_Start": 1014.62,
      "Time_End": 1020.16,
      "Text": " in information security conferences to have a code of conduct and a transparency report. And"
    },
    {
      "Time_Start": 1020.1999999999999,
      "Time_End": 1027.0,
      "Text": " I'll just briefly touch on those. The idea with our code of conduct is as we grew and people"
    },
    {
      "Time_Start": 1027.0,
      "Time_End": 1032.1599999999999,
      "Text": " got a little bit more sophisticated in sort of evading appropriate behavior, we really"
    },
    {
      "Time_Start": 1032.1599999999999,
      "Time_End": 1036.1599999999999,
      "Text": " needed to say, hey, this is what we stand for. This is our code of conduct. We spent money on"
    },
    {
      "Time_Start": 1036.1599999999999,
      "Time_End": 1041.0,
      "Text": " lawyers. We got it reviewed. And we tried to create it as a model that other conferences"
    },
    {
      "Time_Start": 1041.0,
      "Time_End": 1047.58,
      "Text": " could take what they liked out of our code of conduct. Make it their own. But that's half"
    },
    {
      "Time_Start": 1047.58,
      "Time_End": 1052.3,
      "Text": " of the problem, right? We have a way of you identifying that there's a problem, reporting a"
    },
    {
      "Time_Start": 1052.3,
      "Time_End": 1057.5,
      "Text": " code of conduct violation say through our hotline or talking to security goons. But if we"
    },
    {
      "Time_Start": 1057.5,
      "Time_End": 1064.46,
      "Text": " don't hold ourself accountable publicly, then you might not trust anything we're saying. So"
    },
    {
      "Time_Start": 1064.46,
      "Time_End": 1069.34,
      "Text": " our transparency report was launched where we started in a sort of sanitized way saying this"
    },
    {
      "Time_Start": 1069.34,
      "Time_End": 1072.76,
      "Text": " is how many people we kicked out, this is how many drunk accidents, this is how many"
    },
    {
      "Time_Start": 1072.76,
      "Time_End": 1080.68,
      "Text": " allegations of just nobody knew in the conference world like is it prevalent or not? Is"
    },
    {
      "Time_Start": 1080.68,
      "Time_End": 1085.34,
      "Text": " there a lot of abuse or very little abuse? Nobody knew. And we figured being data geeks,"
    },
    {
      "Time_Start": 1085.34,
      "Time_End": 1090.64,
      "Text": " well, we got to collect the data. And if we collect the data, we got to share the data. And so"
    },
    {
      "Time_Start": 1090.64,
      "Time_End": 1093.68,
      "Text": " that's where the transparency report comes on. And you'll see every once in a while we kick"
    },
    {
      "Time_Start": 1093.68,
      "Time_End": 1098.68,
      "Text": " out goons. The code of conduct applies to goons and creators just as it applies to"
    },
    {
      "Time_Start": 1098.68,
      "Time_End": 1107.3,
      "Text": " attendees. I see you there. And so what I want you to think about is, you know, we're not"
    },
    {
      "Time_Start": 1107.3,
      "Time_End": 1112.22,
      "Text": " perfect, but if you see something, please report it. If you're feeling like you're under"
    },
    {
      "Time_Start": 1112.22,
      "Time_End": 1117.02,
      "Text": " stress or you're having troubles, it's too overwhelming, we have a hotline of trained"
    },
    {
      "Time_Start": 1117.02,
      "Time_End": 1122.72,
      "Text": " professionals to help you deal with issues. So please take advantage of this. And if you"
    },
    {
      "Time_Start": 1122.72,
      "Time_End": 1127.02,
      "Text": " look at it from the big picture, all we're trying to do is we're trying to build a bigger,"
    },
    {
      "Time_Start": 1127.06,
      "Time_End": 1133.4,
      "Text": " safer community so we can all hack on shit. And that's what it's about. So thank you for"
    },
    {
      "Time_Start": 1133.4,
      "Time_End": 1137.4,
      "Text": " coming to 31. I hope you have a great time. Yeah."
    }
  ]
}