{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 4.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome. We're going to be talking about some email stuff today."
    },
    {
      "Time_Start": 4.0,
      "Time_End": 8.0,
      "Text": " A couple of disclaimers. There's going to be a number of disclaimers throughout the talk."
    },
    {
      "Time_Start": 8.0,
      "Time_End": 12.0,
      "Text": " First two, I tend to curse a lot during presentations. I'm going to try to curb it to an"
    },
    {
      "Time_Start": 12.0,
      "Time_End": 16.0,
      "Text": " absolute minimum, because I know it can be annoying. Number two is"
    },
    {
      "Time_Start": 16.0,
      "Time_End": 20.0,
      "Text": " I'm going to be going very fast throughout these slides, so just bear with me."
    },
    {
      "Time_Start": 20.0,
      "Time_End": 24.0,
      "Text": " I have a lot of content. It was really hard to push this to 45"
    },
    {
      "Time_Start": 24.0,
      "Time_End": 28.0,
      "Text": " slides, to 80 slides in 45 minutes, but unfortunately"
    },
    {
      "Time_Start": 28.0,
      "Time_End": 32.0,
      "Text": " because of the timeline and everything, it was almost impossible."
    },
    {
      "Time_Start": 32.0,
      "Time_End": 36.0,
      "Text": " Really quickly, who am I? My name is Marcello. I go by Bytebleeder a little bit"
    },
    {
      "Time_Start": 36.0,
      "Time_End": 40.0,
      "Text": " everywhere. I'm an open source developer, researcher, engineer. I like to call myself"
    },
    {
      "Time_Start": 40.0,
      "Time_End": 44.0,
      "Text": " an Infinity Stones teamer, because I collected all the colors."
    },
    {
      "Time_Start": 44.0,
      "Time_End": 48.0,
      "Text": " And hey, fresh off the press, I'm looking for a new gig, so if you're hiring,"
    },
    {
      "Time_Start": 48.0,
      "Time_End": 52.0,
      "Text": " come grab me after the talk. Even if you're not hiring, you can come grab me after the talk and chat. I'm a friendly guy."
    },
    {
      "Time_Start": 52.0,
      "Time_End": 56.0,
      "Text": " I like talking to people."
    },
    {
      "Time_Start": 56.0,
      "Time_End": 60.0,
      "Text": " Third disclaimer, please don't do crimes."
    },
    {
      "Time_Start": 60.0,
      "Time_End": 64.0,
      "Text": " This is going to be apparent while I'm saying this towards the end of the talk, but"
    },
    {
      "Time_Start": 64.0,
      "Time_End": 68.0,
      "Text": " you're just going to get in trouble."
    },
    {
      "Time_Start": 68.0,
      "Time_End": 72.0,
      "Text": " Please don't. I know doing that here is like going to a heroin convention and asking"
    },
    {
      "Time_Start": 72.0,
      "Time_End": 76.0,
      "Text": " them not to do heroin, but just"
    },
    {
      "Time_Start": 76.0,
      "Time_End": 80.0,
      "Text": " please don't. How did this all get started? I just wanted to send an"
    },
    {
      "Time_Start": 80.0,
      "Time_End": 84.0,
      "Text": " email, albeit programmatically, through a Cloudflare worker."
    },
    {
      "Time_Start": 84.0,
      "Time_End": 88.0,
      "Text": " If you're asking yourself why through a Cloudflare worker, it's because"
    },
    {
      "Time_Start": 88.0,
      "Time_End": 92.0,
      "Text": " I backed myself into a corner from a tech sack perspective. I had no other option."
    },
    {
      "Time_Start": 92.0,
      "Time_End": 96.0,
      "Text": " I built this entire backend website using Cloudflare workers, because I wanted to be the hip"
    },
    {
      "Time_Start": 96.0,
      "Time_End": 100.0,
      "Text": " person using the latest stuff. And if you're not familiar with Cloudflare"
    },
    {
      "Time_Start": 100.0,
      "Time_End": 104.0,
      "Text": " workers, they're sort of akin to AWS Lambdas."
    },
    {
      "Time_Start": 104.0,
      "Time_End": 108.0,
      "Text": " So it's a serverless computing platform. And it's a little bit edgy"
    },
    {
      "Time_Start": 108.0,
      "Time_End": 112.0,
      "Text": " though, in the sense that there's a twist to the Cloudflare solution, which"
    },
    {
      "Time_Start": 112.0,
      "Time_End": 116.0,
      "Text": " is they take your code and they distribute it automatically throughout their CDN, so it's always"
    },
    {
      "Time_Start": 116.0,
      "Time_End": 120.0,
      "Text": " like the person hitting your service is always latency optimized geographically"
    },
    {
      "Time_Start": 120.0,
      "Time_End": 124.0,
      "Text": " to where you're trying to hit the service. And you can also"
    },
    {
      "Time_Start": 124.0,
      "Time_End": 128.0,
      "Text": " only write them in JavaScript, TypeScript, and anything that emits WebAssembly, so"
    },
    {
      "Time_Start": 128.0,
      "Time_End": 132.0,
      "Text": " they're also slightly depressed as well, because they can only be living in"
    },
    {
      "Time_Start": 132.0,
      "Time_End": 136.0,
      "Text": " TypeScript land. This is"
    },
    {
      "Time_Start": 136.0,
      "Time_End": 140.0,
      "Text": " basically how you start out with Cloudflare workers."
    },
    {
      "Time_Start": 140.0,
      "Time_End": 144.0,
      "Text": " You basically just run a command, creates a directory structure, then Cloudflare"
    },
    {
      "Time_Start": 144.0,
      "Time_End": 148.0,
      "Text": " provides a tool called Wrangler that automatically you can use"
    },
    {
      "Time_Start": 148.0,
      "Time_End": 152.0,
      "Text": " to manage and upload your Wrangler and your worker code."
    },
    {
      "Time_Start": 152.0,
      "Time_End": 156.0,
      "Text": " And then your worker code is just automatically available at an HTTPS-enabled"
    },
    {
      "Time_Start": 156.0,
      "Time_End": 160.0,
      "Text": " URL that everybody can access. And the main takeaway here is that by"
    },
    {
      "Time_Start": 160.0,
      "Time_End": 164.0,
      "Text": " default, the worker code is public, because that's the whole point."
    },
    {
      "Time_Start": 164.0,
      "Time_End": 168.0,
      "Text": " People want to access your service so they can use it, right?"
    },
    {
      "Time_Start": 168.0,
      "Time_End": 172.0,
      "Text": " So just for some context here, this is like"
    },
    {
      "Time_Start": 172.0,
      "Time_End": 176.0,
      "Text": " imagine 1 a.m., I'm just trying to work on this freaking website,"
    },
    {
      "Time_Start": 176.0,
      "Time_End": 180.0,
      "Text": " I want to go to bed so I can actually get to my day job. It's late,"
    },
    {
      "Time_Start": 180.0,
      "Time_End": 184.0,
      "Text": " maybe even a little drunk, and I just need"
    },
    {
      "Time_Start": 184.0,
      "Time_End": 188.0,
      "Text": " this website backend to send an email, right? So I'm just"
    },
    {
      "Time_Start": 188.0,
      "Time_End": 192.0,
      "Text": " drunkenly Googling, send email Cloudflare workers, and I stumbled"
    },
    {
      "Time_Start": 192.0,
      "Time_End": 196.0,
      "Text": " across this blog post from Cloudflare. It's like, send email using"
    },
    {
      "Time_Start": 196.0,
      "Time_End": 200.0,
      "Text": " workers with something called Mail Channels. I've never heard of whatever Mail Channels is, but at the time I didn't care."
    },
    {
      "Time_Start": 200.0,
      "Time_End": 204.0,
      "Text": " Hey, it's got code. Great. Copy-paste this thing into my worker."
    },
    {
      "Time_Start": 204.0,
      "Time_End": 208.0,
      "Text": " Works first try. And we'll go back to that code in a second."
    },
    {
      "Time_Start": 208.0,
      "Time_End": 212.0,
      "Text": " It works first try, which in hindsight, red flag. Nothing really ever"
    },
    {
      "Time_Start": 212.0,
      "Time_End": 216.0,
      "Text": " works first try. But hey, I get an email, and it goes"
    },
    {
      "Time_Start": 216.0,
      "Time_End": 220.0,
      "Text": " to my spam inbox, which is somewhat normal, I think, because I didn't set up any"
    },
    {
      "Time_Start": 220.0,
      "Time_End": 224.0,
      "Text": " email security stuff, which I had very little about at the time."
    },
    {
      "Time_Start": 224.0,
      "Time_End": 228.0,
      "Text": " So I leave this behind, come back a couple days later,"
    },
    {
      "Time_Start": 228.0,
      "Time_End": 232.0,
      "Text": " and I see that there was an open browser tab"
    },
    {
      "Time_Start": 232.0,
      "Time_End": 236.0,
      "Text": " throughout the gazillions that I had open from when I was working on this a couple days ago,"
    },
    {
      "Time_Start": 236.0,
      "Time_End": 240.0,
      "Text": " where there's this person asking on the Cloudflare community forum, saying, hey,"
    },
    {
      "Time_Start": 240.0,
      "Time_End": 244.0,
      "Text": " if I use this feature, this Mail Channels thing,"
    },
    {
      "Time_Start": 244.0,
      "Time_End": 248.0,
      "Text": " doesn't this allow anybody to impersonate my domain"
    },
    {
      "Time_Start": 248.0,
      "Time_End": 252.0,
      "Text": " and send emails from my domain? And I'm like, why, as the kids say, that's pretty"
    },
    {
      "Time_Start": 252.0,
      "Time_End": 256.0,
      "Text": " sus, right? Why are you even asking that? That's a weird question to be"
    },
    {
      "Time_Start": 256.0,
      "Time_End": 260.0,
      "Text": " asking just randomly out of the blue. And then there's a Mail Channels person in there"
    },
    {
      "Time_Start": 260.0,
      "Time_End": 264.0,
      "Text": " saying, yeah, this is just how the email works, though, so"
    },
    {
      "Time_Start": 264.0,
      "Time_End": 268.0,
      "Text": " there's nothing really you can do about it. Which, at this point, I'm completely nerd-sniped,"
    },
    {
      "Time_Start": 268.0,
      "Time_End": 272.0,
      "Text": " so I just keep Googling what's going on with this Mail Channels thing. I've never"
    },
    {
      "Time_Start": 272.0,
      "Time_End": 276.0,
      "Text": " heard of this before. And a bunch of people asking"
    },
    {
      "Time_Start": 276.0,
      "Time_End": 280.0,
      "Text": " a little bit all over the place, hey, can't people just impersonate my domain with this?"
    },
    {
      "Time_Start": 280.0,
      "Time_End": 284.0,
      "Text": " And I'm like, okay, what's going on? And then there's this guy on Reddit that's like, hey,"
    },
    {
      "Time_Start": 284.0,
      "Time_End": 288.0,
      "Text": " asks a really important question, because I didn't even think of this. Why is this free?"
    },
    {
      "Time_Start": 288.0,
      "Time_End": 292.0,
      "Text": " Why aren't you monetizing this? This seems weird. You're just allowing"
    },
    {
      "Time_Start": 292.0,
      "Time_End": 296.0,
      "Text": " people to send emails for free? And they're like, yeah, no, no, no, we don't care about"
    },
    {
      "Time_Start": 296.0,
      "Time_End": 300.0,
      "Text": " the money, right? We just care about sending an"
    },
    {
      "Time_Start": 300.0,
      "Time_End": 304.0,
      "Text": " email. It's fine. So they just went full Joker."
    },
    {
      "Time_Start": 304.0,
      "Time_End": 308.0,
      "Text": " So I'm like, okay, let me just go back to the code that I just"
    },
    {
      "Time_Start": 308.0,
      "Time_End": 312.0,
      "Text": " in my sleepless stupor just copy-pasted into my worker code"
    },
    {
      "Time_Start": 312.0,
      "Time_End": 316.0,
      "Text": " and stare at this for a good two minutes. And for those"
    },
    {
      "Time_Start": 316.0,
      "Time_End": 320.0,
      "Text": " of you not TypeScript-inclined, first off, I envy you. Second off,"
    },
    {
      "Time_Start": 320.0,
      "Time_End": 324.0,
      "Text": " basically all this is doing is just sending an HTTP post request to some"
    },
    {
      "Time_Start": 324.0,
      "Time_End": 328.0,
      "Text": " Mail Channels API with the contents of the email that you want"
    },
    {
      "Time_Start": 328.0,
      "Time_End": 332.0,
      "Text": " to send. And if you stare at this for a while, you're like, wait a second,"
    },
    {
      "Time_Start": 332.0,
      "Time_End": 336.0,
      "Text": " there's no authentication here. There's no"
    },
    {
      "Time_Start": 336.0,
      "Time_End": 340.0,
      "Text": " username and passwords or API key in this shit. There's nothing."
    },
    {
      "Time_Start": 340.0,
      "Time_End": 344.0,
      "Text": " So that's really weird. So I dig a little more."
    },
    {
      "Time_Start": 344.0,
      "Time_End": 348.0,
      "Text": " And it turns out the Cloudflare and Mail Channels partnership"
    },
    {
      "Time_Start": 348.0,
      "Time_End": 352.0,
      "Text": " entailed Mail Channels creating this API, no auth required."
    },
    {
      "Time_Start": 352.0,
      "Time_End": 356.0,
      "Text": " However, the twist is that it's only allowed listed at the network level"
    },
    {
      "Time_Start": 356.0,
      "Time_End": 360.0,
      "Text": " to Cloudflare SP space. So you'll only be able to hit this API if you come from a"
    },
    {
      "Time_Start": 360.0,
      "Time_End": 364.0,
      "Text": " Cloudflare IP. Well, anybody on the Internet can just create a Cloudflare account"
    },
    {
      "Time_Start": 364.0,
      "Time_End": 368.0,
      "Text": " for free and hit this API. So, you know,"
    },
    {
      "Time_Start": 368.0,
      "Time_End": 372.0,
      "Text": " just like connecting the dots at like 1 a.m. in the morning here, it's like, okay,"
    },
    {
      "Time_Start": 372.0,
      "Time_End": 376.0,
      "Text": " so is this like, I just need to create a Cloudflare account, which I already did. I just"
    },
    {
      "Time_Start": 376.0,
      "Time_End": 380.0,
      "Text": " uploaded the worker code, which I already did. And then you could just send emails through Mail Channels for real."
    },
    {
      "Time_Start": 380.0,
      "Time_End": 384.0,
      "Text": " And yeah, that's basically how it works, which is really"
    },
    {
      "Time_Start": 384.0,
      "Time_End": 388.0,
      "Text": " weird. And then there was this other user in the same community forum, after all"
    },
    {
      "Time_Start": 388.0,
      "Time_End": 392.0,
      "Text": " the snarky comments, also asking the same issue about worker impersonation, which I still"
    },
    {
      "Time_Start": 392.0,
      "Time_End": 396.0,
      "Text": " don't understand at that point. And"
    },
    {
      "Time_Start": 396.0,
      "Time_End": 400.0,
      "Text": " the person's like, hey, so I created a Cloudflare worker that demonstrates this capability,"
    },
    {
      "Time_Start": 400.0,
      "Time_End": 404.0,
      "Text": " demonstrates this partnership between Cloudflare and Mail Channels. And it's just an HTML form"
    },
    {
      "Time_Start": 404.0,
      "Time_End": 408.0,
      "Text": " where you just put in the contents of the email. It's publicly"
    },
    {
      "Time_Start": 408.0,
      "Time_End": 412.0,
      "Text": " available. I blacked out the URL because I don't want you guys running"
    },
    {
      "Time_Start": 412.0,
      "Time_End": 416.0,
      "Text": " up this person's Cloudflare bill. But it's publicly available"
    },
    {
      "Time_Start": 416.0,
      "Time_End": 420.0,
      "Text": " and you just put in, oh, sorry, it's publicly available and you just put in"
    },
    {
      "Time_Start": 420.0,
      "Time_End": 424.0,
      "Text": " the content of the email and you just submit and you send"
    },
    {
      "Time_Start": 424.0,
      "Time_End": 428.0,
      "Text": " the email, which, okay. And I'm like, okay, for testing purposes, this is fantastic."
    },
    {
      "Time_Start": 428.0,
      "Time_End": 432.0,
      "Text": " And I guess since I'm completely nerd sniped at this point, I'm just going to"
    },
    {
      "Time_Start": 432.0,
      "Time_End": 436.0,
      "Text": " what's the first three or four test cases that I can think of in order to possibly"
    },
    {
      "Time_Start": 436.0,
      "Time_End": 440.0,
      "Text": " figure out what these other people are talking about in terms of impersonation. So"
    },
    {
      "Time_Start": 440.0,
      "Time_End": 444.0,
      "Text": " test case number one, what happens if I just put a domain that doesn't exist"
    },
    {
      "Time_Start": 444.0,
      "Time_End": 448.0,
      "Text": " in the HTML form of the worker?"
    },
    {
      "Time_Start": 448.0,
      "Time_End": 452.0,
      "Text": " So I put in as a sender test.waterhogger.com, which is a domain that didn't"
    },
    {
      "Time_Start": 452.0,
      "Time_End": 456.0,
      "Text": " exist at the time. And I get an error back saying, hey,"
    },
    {
      "Time_Start": 456.0,
      "Time_End": 460.0,
      "Text": " failed to send email because the domain doesn't exist dummy, which, yeah, makes sense."
    },
    {
      "Time_Start": 460.0,
      "Time_End": 464.0,
      "Text": " If this worked, that would be completely foobar, right?"
    },
    {
      "Time_Start": 464.0,
      "Time_End": 468.0,
      "Text": " And then how about a domain that does exist but I don't control? So as the sender,"
    },
    {
      "Time_Start": 468.0,
      "Time_End": 472.0,
      "Text": " then I put in test.example.com and it gives me back null."
    },
    {
      "Time_Start": 472.0,
      "Time_End": 476.0,
      "Text": " Yay. I don't know what null means, but it turns out null means it works."
    },
    {
      "Time_Start": 476.0,
      "Time_End": 480.0,
      "Text": " And I"
    },
    {
      "Time_Start": 480.0,
      "Time_End": 484.0,
      "Text": " got the email, right? But it goes to spam again, which is normal because I don't control"
    },
    {
      "Time_Start": 484.0,
      "Time_End": 488.0,
      "Text": " the domain. So I'm like, okay, this seems completely normal. What are these people talking about"
    },
    {
      "Time_Start": 488.0,
      "Time_End": 492.0,
      "Text": " with impersonation? And I don't know much about email security, but I look up the headers"
    },
    {
      "Time_Start": 492.0,
      "Time_End": 496.0,
      "Text": " and they're like, yeah, it's fail, soft fail, everything's bad, go back, whatever you're doing,"
    },
    {
      "Time_Start": 496.0,
      "Time_End": 500.0,
      "Text": " stop doing it. But test case three, I'm like, okay, what's the next"
    },
    {
      "Time_Start": 500.0,
      "Time_End": 504.0,
      "Text": " logical step? What happens out of sheer curiosity if I use a domain that"
    },
    {
      "Time_Start": 504.0,
      "Time_End": 508.0,
      "Text": " actually uses this thing called mail channels? Because I still don't know what the hell it is at this point,"
    },
    {
      "Time_Start": 508.0,
      "Time_End": 512.0,
      "Text": " right? So I just Google, okay, websites that use mail channels."
    },
    {
      "Time_Start": 512.0,
      "Time_End": 516.0,
      "Text": " And at this point, I'm just thinking, you know, I've never heard of this. This must be"
    },
    {
      "Time_Start": 516.0,
      "Time_End": 520.0,
      "Text": " like some bottom of the barrel email service that maybe like your grandma used in the"
    },
    {
      "Time_Start": 520.0,
      "Time_End": 524.0,
      "Text": " 1980s or something, right? Maybe like a thousand people use this, if not less."
    },
    {
      "Time_Start": 524.0,
      "Time_End": 528.0,
      "Text": " Nope. Nope, nope, nope, nope, nope. So"
    },
    {
      "Time_Start": 528.0,
      "Time_End": 532.0,
      "Text": " two million somewhat domains, at least according to builtwith.com,"
    },
    {
      "Time_Start": 532.0,
      "Time_End": 536.0,
      "Text": " which is a site that aggregates technology that a bunch of websites use"
    },
    {
      "Time_Start": 536.0,
      "Time_End": 540.0,
      "Text": " and stuff. And this might be a little small there, but"
    },
    {
      "Time_Start": 540.0,
      "Time_End": 544.0,
      "Text": " there's a few heavy hitters in terms of people who use this"
    },
    {
      "Time_Start": 544.0,
      "Time_End": 548.0,
      "Text": " mail channel service. There's like boston.gov, there's notepad++.org,"
    },
    {
      "Time_Start": 548.0,
      "Time_End": 552.0,
      "Text": " which is really funny. And then everything else, though, is more like just"
    },
    {
      "Time_Start": 552.0,
      "Time_End": 556.0,
      "Text": " random ass websites that host everything and everything. And I really like builtwith.com"
    },
    {
      "Time_Start": 556.0,
      "Time_End": 560.0,
      "Text": " because if you were someone trying to target people, the filter"
    },
    {
      "Time_Start": 560.0,
      "Time_End": 564.0,
      "Text": " you know, mail channels, websites with estimated sales revenue over"
    },
    {
      "Time_Start": 564.0,
      "Time_End": 568.0,
      "Text": " one million dollars, just really just preem stuff right there."
    },
    {
      "Time_Start": 568.0,
      "Time_End": 572.0,
      "Text": " Turns out I didn't even need to do this because mail channels also has a list of all their customers on the website."
    },
    {
      "Time_Start": 572.0,
      "Time_End": 576.0,
      "Text": " Yay. So then I'm like, okay, so then"
    },
    {
      "Time_Start": 576.0,
      "Time_End": 580.0,
      "Text": " I go back to the worker and I put in like, you know, lobsters at boston.gov because"
    },
    {
      "Time_Start": 580.0,
      "Time_End": 584.0,
      "Text": " boston.gov was the one that popped out and, you know, go big or go home."
    },
    {
      "Time_Start": 584.0,
      "Time_End": 588.0,
      "Text": " Yeah. And it goes straight to my inbox. No, doesn't pass go,"
    },
    {
      "Time_Start": 588.0,
      "Time_End": 592.0,
      "Text": " doesn't collect $200, just goes straight into my inbox. And on top of that,"
    },
    {
      "Time_Start": 592.0,
      "Time_End": 596.0,
      "Text": " if you take a look at the headers, SPF and DMARC both passed."
    },
    {
      "Time_Start": 596.0,
      "Time_End": 600.0,
      "Text": " Okay. Just to be clear, at this point, I'm like, this is a worker"
    },
    {
      "Time_Start": 600.0,
      "Time_End": 604.0,
      "Text": " publicly available just on random on the internet that anyone can hit. They can just put in the details"
    },
    {
      "Time_Start": 604.0,
      "Time_End": 608.0,
      "Text": " of the email and they'll just be able to spoof any of these, those mains."
    },
    {
      "Time_Start": 608.0,
      "Time_End": 612.0,
      "Text": " And then, so I try another, like how about minus at notepad++.org, right?"
    },
    {
      "Time_Start": 612.0,
      "Time_End": 616.0,
      "Text": " That's, yeah. So, and then"
    },
    {
      "Time_Start": 616.0,
      "Time_End": 620.0,
      "Text": " I try another, same deal, like goes to my inbox and another and another and another."
    },
    {
      "Time_Start": 620.0,
      "Time_End": 624.0,
      "Text": " There's a lot of humorous websites you can pull from builtwith.com"
    },
    {
      "Time_Start": 624.0,
      "Time_End": 628.0,
      "Text": " about this. And yeah, they all land in my inbox. So, at this point, I'm like,"
    },
    {
      "Time_Start": 628.0,
      "Time_End": 632.0,
      "Text": " okay, this is obviously a problem, but what the hell is Mail Channels?"
    },
    {
      "Time_Start": 632.0,
      "Time_End": 636.0,
      "Text": " I've been using this thing for like at least a few hours now."
    },
    {
      "Time_Start": 636.0,
      "Time_End": 640.0,
      "Text": " I still don't know like the who. I know the how, I guess, but not"
    },
    {
      "Time_Start": 640.0,
      "Time_End": 644.0,
      "Text": " the who. So it turns out, surprise, surprise, Mail Channels is an"
    },
    {
      "Time_Start": 644.0,
      "Time_End": 648.0,
      "Text": " email transaction service. And just to be on"
    },
    {
      "Time_Start": 648.0,
      "Time_End": 652.0,
      "Text": " the same page, transactional email is like your automated email. So like these are emails going from"
    },
    {
      "Time_Start": 652.0,
      "Time_End": 656.0,
      "Text": " robot to human. So like your password resets, your notifications, your"
    },
    {
      "Time_Start": 656.0,
      "Time_End": 660.0,
      "Text": " emails, newsletters, that kind of stuff. But what was really weird"
    },
    {
      "Time_Start": 660.0,
      "Time_End": 664.0,
      "Text": " and just like really confusing at the time is that also"
    },
    {
      "Time_Start": 664.0,
      "Time_End": 668.0,
      "Text": " they're sort of like almost like a cyber security company. Well, at least like they're trying to market that"
    },
    {
      "Time_Start": 668.0,
      "Time_End": 672.0,
      "Text": " yeah, we're an email transaction service, but we also stop, you know, the bad hackers with the"
    },
    {
      "Time_Start": 672.0,
      "Time_End": 676.0,
      "Text": " spam and stuff, which is very ironic because, you know,"
    },
    {
      "Time_Start": 676.0,
      "Time_End": 680.0,
      "Text": " the Boston.gov email tends to prove otherwise. But"
    },
    {
      "Time_Start": 680.0,
      "Time_End": 684.0,
      "Text": " you know, you find out too that when you start digging into the Mail"
    },
    {
      "Time_Start": 684.0,
      "Time_End": 688.0,
      "Text": " Channels website, it's its own little microcosm, you know, like it's like a multi"
    },
    {
      "Time_Start": 688.0,
      "Time_End": 692.0,
      "Text": " universe of things that you never really thought could be possible. Like you got people putting like"
    },
    {
      "Time_Start": 692.0,
      "Time_End": 696.0,
      "Text": " RDP credentials in the comment sections of blog posts, you know."
    },
    {
      "Time_Start": 696.0,
      "Time_End": 700.0,
      "Text": " Like it's its own little universe of things that you never knew could be"
    },
    {
      "Time_Start": 700.0,
      "Time_End": 704.0,
      "Text": " possible. And it turns out Mail Channels, I was the ignorant one"
    },
    {
      "Time_Start": 704.0,
      "Time_End": 708.0,
      "Text": " because it turns out Mail Channels is the biggest player in the email transactional space."
    },
    {
      "Time_Start": 708.0,
      "Time_End": 712.0,
      "Text": " It's got 42% of the market share and it's got double, more than double"
    },
    {
      "Time_Start": 712.0,
      "Time_End": 716.0,
      "Text": " the amount of domains or clients rather than like SendGrid, Mailgun"
    },
    {
      "Time_Start": 716.0,
      "Time_End": 720.0,
      "Text": " and all the ones that I knew that I've heard of before. But Mail Channels"
    },
    {
      "Time_Start": 720.0,
      "Time_End": 724.0,
      "Text": " turns out to be double, more than double the bit like SendGrid, for example."
    },
    {
      "Time_Start": 724.0,
      "Time_End": 728.0,
      "Text": " So at this point, like I'm like, okay, how is this possible?"
    },
    {
      "Time_Start": 728.0,
      "Time_End": 732.0,
      "Text": " So some of the basics and just so we're on the same page, like SPF. So"
    },
    {
      "Time_Start": 732.0,
      "Time_End": 736.0,
      "Text": " Sender Policy Framework, this, what you gotta know is that in every email there's"
    },
    {
      "Time_Start": 736.0,
      "Time_End": 740.0,
      "Text": " like two from fields. There's one in the SMTP, at the SMTP level and the one that the user"
    },
    {
      "Time_Start": 740.0,
      "Time_End": 744.0,
      "Text": " sees in the actual email. So SPF, aka Sender Policy Framework"
    },
    {
      "Time_Start": 744.0,
      "Time_End": 748.0,
      "Text": " allows you to set a security control on the from field in SMTP."
    },
    {
      "Time_Start": 748.0,
      "Time_End": 752.0,
      "Text": " So the one that the user doesn't see. And it basically just allows you to say, hey,"
    },
    {
      "Time_Start": 752.0,
      "Time_End": 756.0,
      "Text": " these are the IPs and host names that are allowed to send email on behalf of"
    },
    {
      "Time_Start": 756.0,
      "Time_End": 760.0,
      "Text": " my domain. So this is what it looks like in practice. It might"
    },
    {
      "Time_Start": 760.0,
      "Time_End": 764.0,
      "Text": " be a little small, but that's the SPF record of like Boston.gov"
    },
    {
      "Time_Start": 764.0,
      "Time_End": 768.0,
      "Text": " and there's a bunch of IPs that basically are saying, hey, these IPs are allowed"
    },
    {
      "Time_Start": 768.0,
      "Time_End": 772.0,
      "Text": " to send emails on behalf of my domain. But there's also a include statement"
    },
    {
      "Time_Start": 772.0,
      "Time_End": 776.0,
      "Text": " that includes relay.mailchannels.net, which I'm like, okay, that kind of makes sense"
    },
    {
      "Time_Start": 776.0,
      "Time_End": 780.0,
      "Text": " because like, you know, they use Mail Channels, right? And then I try"
    },
    {
      "Time_Start": 780.0,
      "Time_End": 784.0,
      "Text": " another SPF of another domain that builtwith.com said uses it. Same"
    },
    {
      "Time_Start": 784.0,
      "Time_End": 788.0,
      "Text": " deal. Always had that include statement with relay.mailchannels.net. Try a few others."
    },
    {
      "Time_Start": 788.0,
      "Time_End": 792.0,
      "Text": " Same thing. And lo and behold, turns out that's part of the setup process of using"
    },
    {
      "Time_Start": 792.0,
      "Time_End": 796.0,
      "Text": " this Mail Channel service. That they tell people to put this include statement in their SPF"
    },
    {
      "Time_Start": 796.0,
      "Time_End": 800.0,
      "Text": " in order to use their service. But the thing is, if you start thinking"
    },
    {
      "Time_Start": 800.0,
      "Time_End": 804.0,
      "Text": " about it, right, that also means that all of their customers"
    },
    {
      "Time_Start": 804.0,
      "Time_End": 808.0,
      "Text": " can spoof each other. Because if, like, they all"
    },
    {
      "Time_Start": 808.0,
      "Time_End": 812.0,
      "Text": " have the same SPF, that means all of the other domains that have the same SPF"
    },
    {
      "Time_Start": 812.0,
      "Time_End": 816.0,
      "Text": " are authorized to send on behalf of each other. And couple that with this"
    },
    {
      "Time_Start": 816.0,
      "Time_End": 820.0,
      "Text": " Cloudflare worker thing, all of a sudden, it's almost like an open relay situation"
    },
    {
      "Time_Start": 820.0,
      "Time_End": 824.0,
      "Text": " where anybody can just go to the Cloudflare worker URL and just put in the"
    },
    {
      "Time_Start": 824.0,
      "Time_End": 828.0,
      "Text": " email details that they want to see, and bam, you can just spoof their emails."
    },
    {
      "Time_Start": 828.0,
      "Time_End": 832.0,
      "Text": " And I'm like, okay, there's no way. This is a little bit too simple. How has this not"
    },
    {
      "Time_Start": 832.0,
      "Time_End": 836.0,
      "Text": " been found out before? And it turns out people back in 2016 were already"
    },
    {
      "Time_Start": 836.0,
      "Time_End": 840.0,
      "Text": " doing the same calculations like I was doing. I'm like, hey, so if"
    },
    {
      "Time_Start": 840.0,
      "Time_End": 844.0,
      "Text": " website A is using mail channels and website B has the same"
    },
    {
      "Time_Start": 844.0,
      "Time_End": 848.0,
      "Text": " SPF record, can't they spoof each other?"
    },
    {
      "Time_Start": 848.0,
      "Time_End": 852.0,
      "Text": " And again, mail channels in the comments section, they're like, yeah, so"
    },
    {
      "Time_Start": 852.0,
      "Time_End": 856.0,
      "Text": " the great thing about using us is you just call us and we'll stop the spammer."
    },
    {
      "Time_Start": 856.0,
      "Time_End": 860.0,
      "Text": " And again, like, I don't want"
    },
    {
      "Time_Start": 860.0,
      "Time_End": 864.0,
      "Text": " to misrepresent. I mean, this was 2016, so they might have"
    },
    {
      "Time_Start": 864.0,
      "Time_End": 868.0,
      "Text": " some other stuff. But this is a fine situation"
    },
    {
      "Time_Start": 868.0,
      "Time_End": 872.0,
      "Text": " in my head going off here. So I'm like, okay, these guys obviously know"
    },
    {
      "Time_Start": 872.0,
      "Time_End": 876.0,
      "Text": " about this because people were complaining about it since 2016. But I'm just going to email"
    },
    {
      "Time_Start": 876.0,
      "Time_End": 880.0,
      "Text": " them. They had no official vulnerability reporting channel. I'm just going to email them and say, hey, I found some stuff,"
    },
    {
      "Time_Start": 880.0,
      "Time_End": 884.0,
      "Text": " whatever. And I email them, and within two minutes, the CEO"
    },
    {
      "Time_Start": 884.0,
      "Time_End": 888.0,
      "Text": " replies to me. Like, this guy had this email on speed dial."
    },
    {
      "Time_Start": 888.0,
      "Time_End": 892.0,
      "Text": " It was crazy. I thought they were using like chat GPT for a second."
    },
    {
      "Time_Start": 892.0,
      "Time_End": 896.0,
      "Text": " And he was like, yeah, so you're probably talking about the SPF"
    },
    {
      "Time_Start": 896.0,
      "Time_End": 900.0,
      "Text": " issue, right? Yeah, no, we know about that. We don't consider that a vulnerability"
    },
    {
      "Time_Start": 900.0,
      "Time_End": 904.0,
      "Text": " or an issue whatsoever. And I email them about, okay, but"
    },
    {
      "Time_Start": 904.0,
      "Time_End": 908.0,
      "Text": " you got the Cloudflare worker thing now. Don't you think that requires"
    },
    {
      "Time_Start": 908.0,
      "Time_End": 912.0,
      "Text": " like a little bit of a different kind of thinking, like at least mitigate that? And they're like, no."
    },
    {
      "Time_Start": 912.0,
      "Time_End": 916.0,
      "Text": " And radio silence after that. There was no response."
    },
    {
      "Time_Start": 916.0,
      "Time_End": 920.0,
      "Text": " And at that point, I'm also questioning myself because it's like, wow, okay, this guy seemed"
    },
    {
      "Time_Start": 920.0,
      "Time_End": 924.0,
      "Text": " very assertive. Am I the idiot here? Like, is it just"
    },
    {
      "Time_Start": 924.0,
      "Time_End": 928.0,
      "Text": " how these services work? But it turns out, no."
    },
    {
      "Time_Start": 928.0,
      "Time_End": 932.0,
      "Text": " Like, other people, other companies like SendGrid and Mailgun"
    },
    {
      "Time_Start": 932.0,
      "Time_End": 936.0,
      "Text": " have a bunch of stuff that solves this situation completely, and especially"
    },
    {
      "Time_Start": 936.0,
      "Time_End": 940.0,
      "Text": " regarding to the SPF headers. So there's sender identity verification, which is basically"
    },
    {
      "Time_Start": 940.0,
      "Time_End": 944.0,
      "Text": " like what you do with Let's Encrypt certificates to prove domain ownership."
    },
    {
      "Time_Start": 944.0,
      "Time_End": 948.0,
      "Text": " You have dedicated sending IPs, which allows you to actually put unique SPF records"
    },
    {
      "Time_Start": 948.0,
      "Time_End": 952.0,
      "Text": " in your DNS text record."
    },
    {
      "Time_Start": 952.0,
      "Time_End": 956.0,
      "Text": " And then actual authentication on their API, which ties back the verified domains"
    },
    {
      "Time_Start": 956.0,
      "Time_End": 960.0,
      "Text": " when you actually try to send an email through the service, right?"
    },
    {
      "Time_Start": 960.0,
      "Time_End": 964.0,
      "Text": " And this is what, like, if you try to do the same thing with SendGrid, for example,"
    },
    {
      "Time_Start": 964.0,
      "Time_End": 968.0,
      "Text": " you basically, like, you put in the API key. You have to first verify"
    },
    {
      "Time_Start": 968.0,
      "Time_End": 972.0,
      "Text": " you own a domain. But if you try to send an email from a domain that you"
    },
    {
      "Time_Start": 972.0,
      "Time_End": 976.0,
      "Text": " haven't verified you own, it just says, get out of here, bucko."
    },
    {
      "Time_Start": 976.0,
      "Time_End": 980.0,
      "Text": " Like, this is not how this works. Like, stop doing this. You're not allowed to do it."
    },
    {
      "Time_Start": 980.0,
      "Time_End": 984.0,
      "Text": " So at this point, I'm like, okay, I need a bigger picture in order to understand stuff."
    },
    {
      "Time_Start": 984.0,
      "Time_End": 988.0,
      "Text": " And I heard, like, through just random research that there's this thing called Project"
    },
    {
      "Time_Start": 988.0,
      "Time_End": 992.0,
      "Text": " Sonar from Rapid7, and they aggregate internet-wide data"
    },
    {
      "Time_Start": 992.0,
      "Time_End": 996.0,
      "Text": " regarding, like, HTTP, DNS, and stuff. So I hit them up in order to get access to this"
    },
    {
      "Time_Start": 996.0,
      "Time_End": 1000.0,
      "Text": " database in order to, like, check"
    },
    {
      "Time_Start": 1000.0,
      "Time_End": 1004.0,
      "Text": " all these assumptions of, like, hey, are 2 million domains actually using this?"
    },
    {
      "Time_Start": 1004.0,
      "Time_End": 1008.0,
      "Text": " Like, what's another very important information if we want to"
    },
    {
      "Time_Start": 1008.0,
      "Time_End": 1012.0,
      "Text": " go forward with this? And so I hit them up, and they gave me access. And not only did they give me access,"
    },
    {
      "Time_Start": 1012.0,
      "Time_End": 1016.0,
      "Text": " they're like, hey, yeah, we're going to help you with this, because this is really weird. So shout out"
    },
    {
      "Time_Start": 1016.0,
      "Time_End": 1020.0,
      "Text": " to these people over at Rapid7. There were a few that I think don't work there anymore,"
    },
    {
      "Time_Start": 1020.0,
      "Time_End": 1024.0,
      "Text": " but they used to work at a time. So shout out to them."
    },
    {
      "Time_Start": 1024.0,
      "Time_End": 1028.0,
      "Text": " And once we start digging through the data, it turns out builtwith.com is accurate."
    },
    {
      "Time_Start": 1028.0,
      "Time_End": 1032.0,
      "Text": " And there are around 2,200,000 domains as of January 2023"
    },
    {
      "Time_Start": 1032.0,
      "Time_End": 1036.0,
      "Text": " that use mail channels. And at this point, Rapid7 reaches out to"
    },
    {
      "Time_Start": 1036.0,
      "Time_End": 1040.0,
      "Text": " them as well as part of the standard vulnerability disclosure process. And they're like,"
    },
    {
      "Time_Start": 1040.0,
      "Time_End": 1044.0,
      "Text": " hey, like, you know, we're working with Marcello now. And the CEO, again, replies in two minutes"
    },
    {
      "Time_Start": 1044.0,
      "Time_End": 1048.0,
      "Text": " saying, so we don't consider this SPF thing an issue,"
    },
    {
      "Time_Start": 1048.0,
      "Time_End": 1052.0,
      "Text": " but this is the piece of the puzzle that we are missing here."
    },
    {
      "Time_Start": 1052.0,
      "Time_End": 1056.0,
      "Text": " Most of our clients are web hosting providers that don't"
    },
    {
      "Time_Start": 1056.0,
      "Time_End": 1060.0,
      "Text": " necessarily own the domains that they send emails from."
    },
    {
      "Time_Start": 1060.0,
      "Time_End": 1064.0,
      "Text": " Okay? So it's a feature."
    },
    {
      "Time_Start": 1064.0,
      "Time_End": 1068.0,
      "Text": " So what we have to understand is that apparently there's a niche market"
    },
    {
      "Time_Start": 1068.0,
      "Time_End": 1072.0,
      "Text": " out there for web hosting providers to send emails on behalf"
    },
    {
      "Time_Start": 1072.0,
      "Time_End": 1076.0,
      "Text": " of their clients, and mail channels is sort of like a middleman in order to"
    },
    {
      "Time_Start": 1076.0,
      "Time_End": 1080.0,
      "Text": " do that. So it's a feature, not a bug."
    },
    {
      "Time_Start": 1080.0,
      "Time_End": 1084.0,
      "Text": " And it turns out, you're probably asking yourself, well, how do they stop this from being like Wild West?"
    },
    {
      "Time_Start": 1084.0,
      "Time_End": 1088.0,
      "Text": " Well, mail channels has a bunch of compensating controls, at least"
    },
    {
      "Time_Start": 1088.0,
      "Time_End": 1092.0,
      "Text": " according to them, that they do like signature checking, math, statistics, trends,"
    },
    {
      "Time_Start": 1092.0,
      "Time_End": 1096.0,
      "Text": " IP domain reputation. They also analyze the email responses"
    },
    {
      "Time_Start": 1096.0,
      "Time_End": 1100.0,
      "Text": " from people that receive the email. So if that means, I don't know if that means"
    },
    {
      "Time_Start": 1100.0,
      "Time_End": 1104.0,
      "Text": " if I just tell someone to fuck off, do they block them? I don't know."
    },
    {
      "Time_Start": 1104.0,
      "Time_End": 1108.0,
      "Text": " I'm not sure how that works. But they also do OCR stuff."
    },
    {
      "Time_Start": 1108.0,
      "Time_End": 1112.0,
      "Text": " But okay, fine. I couldn't really tell you how good these"
    },
    {
      "Time_Start": 1112.0,
      "Time_End": 1116.0,
      "Text": " compensating controls are because in none of our testing, none of the emails were blocked."
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1120.0,
      "Text": " We probably sent like 100 emails between"
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1124.0,
      "Text": " me and Rapid7 and none of them were blocked. That being said,"
    },
    {
      "Time_Start": 1124.0,
      "Time_End": 1128.0,
      "Text": " our emails were clearly labeled as test, right?"
    },
    {
      "Time_Start": 1128.0,
      "Time_End": 1132.0,
      "Text": " So I don't want to misrepresent things. However, I did try to send myself like legit"
    },
    {
      "Time_Start": 1132.0,
      "Time_End": 1136.0,
      "Text": " phishing emails and they weren't blocked. So I don't know. But then he says"
    },
    {
      "Time_Start": 1136.0,
      "Time_End": 1140.0,
      "Text": " something very interesting. He says, domain owners are welcome to secure their domain"
    },
    {
      "Time_Start": 1140.0,
      "Time_End": 1144.0,
      "Text": " against impersonation by signing messages with DKIM and setting up an appropriate DMARC policy."
    },
    {
      "Time_Start": 1144.0,
      "Time_End": 1148.0,
      "Text": " So mail channels is basically saying, yeah,"
    },
    {
      "Time_Start": 1148.0,
      "Time_End": 1152.0,
      "Text": " I mean, we have this SPF issue, but you just set up a DMARC record in DKIM and you're fine."
    },
    {
      "Time_Start": 1152.0,
      "Time_End": 1156.0,
      "Text": " Nobody can impersonate you. But here's the thing. Remember that Boston.gov email?"
    },
    {
      "Time_Start": 1156.0,
      "Time_End": 1160.0,
      "Text": " SPF passed, but also DMARC was passing as well."
    },
    {
      "Time_Start": 1160.0,
      "Time_End": 1164.0,
      "Text": " So what the hell is that all about? So DMARC really quickly is a way"
    },
    {
      "Time_Start": 1164.0,
      "Time_End": 1168.0,
      "Text": " of putting a security control on the from field that the user does see. So when we're talking"
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1172.0,
      "Text": " about DMARC alignment, we're talking about, hey, does the from field that the user does see"
    },
    {
      "Time_Start": 1172.0,
      "Time_End": 1176.0,
      "Text": " match the from field in SMTP and does it match"
    },
    {
      "Time_Start": 1176.0,
      "Time_End": 1180.0,
      "Text": " also any domain sent with any DKIM signature?"
    },
    {
      "Time_Start": 1180.0,
      "Time_End": 1184.0,
      "Text": " So that's when we talk about DMARC alignment. And in order to"
    },
    {
      "Time_Start": 1184.0,
      "Time_End": 1188.0,
      "Text": " test if DMARC does actually stop impersonation from this,"
    },
    {
      "Time_Start": 1188.0,
      "Time_End": 1192.0,
      "Text": " we had to grab a bunch of mail channels"
    },
    {
      "Time_Start": 1192.0,
      "Time_End": 1196.0,
      "Text": " customers' domains that had DMARC set up and DKIM"
    },
    {
      "Time_Start": 1196.0,
      "Time_End": 1200.0,
      "Text": " set up in order to test that. So it turns out out of the"
    },
    {
      "Time_Start": 1200.0,
      "Time_End": 1204.0,
      "Text": " 2 million domains using mail channels, only 407 actually have any"
    },
    {
      "Time_Start": 1204.0,
      "Time_End": 1208.0,
      "Text": " DMARC record whatsoever. And out of that, only 105"
    },
    {
      "Time_Start": 1208.0,
      "Time_End": 1212.0,
      "Text": " actually use DKIM. So this whole encouraging customers to do the right thing is definitely"
    },
    {
      "Time_Start": 1212.0,
      "Time_End": 1216.0,
      "Text": " like it needs a little bit more encouragement, if you ask me."
    },
    {
      "Time_Start": 1216.0,
      "Time_End": 1220.0,
      "Text": " So test case number four. So this is like the obvious next step. It's like, okay,"
    },
    {
      "Time_Start": 1220.0,
      "Time_End": 1224.0,
      "Text": " let's try to spoof an email from a domain that does use mail channels in their SPF"
    },
    {
      "Time_Start": 1224.0,
      "Time_End": 1228.0,
      "Text": " but also has DMARC and DKIM set up. Gits.com, I don't know what"
    },
    {
      "Time_Start": 1228.0,
      "Time_End": 1232.0,
      "Text": " the hell this is, but they are serious about email. They are using"
    },
    {
      "Time_Start": 1232.0,
      "Time_End": 1236.0,
      "Text": " email channels, but they have DMARC set to strict mode in regards to"
    },
    {
      "Time_Start": 1236.0,
      "Time_End": 1240.0,
      "Text": " DKIM alignment and their SPF record. So what this means is basically"
    },
    {
      "Time_Start": 1240.0,
      "Time_End": 1244.0,
      "Text": " if the from field doesn't match, right, the one that the user sees"
    },
    {
      "Time_Start": 1244.0,
      "Time_End": 1248.0,
      "Text": " in the email, that doesn't match the one in SMTP and doesn't match the one in DKIM signature, it just"
    },
    {
      "Time_Start": 1248.0,
      "Time_End": 1252.0,
      "Text": " rejects it. Like the end person doesn't even get the email at all. So this is like"
    },
    {
      "Time_Start": 1252.0,
      "Time_End": 1256.0,
      "Text": " very serious about email stuff. So, you know, Gits.com and it"
    },
    {
      "Time_Start": 1256.0,
      "Time_End": 1260.0,
      "Text": " goes straight to inbox. So at this point"
    },
    {
      "Time_Start": 1260.0,
      "Time_End": 1264.0,
      "Text": " we're like, okay, I don't know what's going on here. And it turns out"
    },
    {
      "Time_Start": 1264.0,
      "Time_End": 1268.0,
      "Text": " that DMARC and DKIM don't really actually fix this because DMARC passes"
    },
    {
      "Time_Start": 1268.0,
      "Time_End": 1272.0,
      "Text": " if SPF or DKIM passes. The or is the important part there."
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1276.0,
      "Text": " As long as you pass SPF, you're also guaranteed to pass DMARC."
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1280.0,
      "Text": " Like that's the gist here. And there's no actual proper way"
    },
    {
      "Time_Start": 1280.0,
      "Time_End": 1284.0,
      "Text": " to tell receivers to strictly enforce DKIM."
    },
    {
      "Time_Start": 1284.0,
      "Time_End": 1288.0,
      "Text": " Apparently. At least from what we understand. So in summary, you're also guaranteed"
    },
    {
      "Time_Start": 1288.0,
      "Time_End": 1292.0,
      "Text": " to pass DMARC by using the Cloudflare worker that"
    },
    {
      "Time_Start": 1292.0,
      "Time_End": 1296.0,
      "Text": " uses mail channels. And we verified this really quickly as well through MailTester"
    },
    {
      "Time_Start": 1296.0,
      "Time_End": 1300.0,
      "Text": " because if you just send the email through MailTester, which is a service that"
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1304.0,
      "Text": " actually tests the delivery, like the chances of delivery of your email,"
    },
    {
      "Time_Start": 1304.0,
      "Time_End": 1308.0,
      "Text": " right, you can see, hey, DMARC passed, SPF passed, and we get a 9 out of 10."
    },
    {
      "Time_Start": 1308.0,
      "Time_End": 1312.0,
      "Text": " So like, this is, you know, we're good to go here. There's no problems here."
    },
    {
      "Time_Start": 1312.0,
      "Time_End": 1316.0,
      "Text": " We get docked a point for missing DKIM signature, but like"
    },
    {
      "Time_Start": 1316.0,
      "Time_End": 1320.0,
      "Text": " it'll still hit the inbox. And at this point, you're probably"
    },
    {
      "Time_Start": 1320.0,
      "Time_End": 1324.0,
      "Text": " wondering, but wait, like"
    },
    {
      "Time_Start": 1324.0,
      "Time_End": 1328.0,
      "Text": " what could there possibly else be? And yeah, I'm here to tell you, yeah, there's more. Hold on."
    },
    {
      "Time_Start": 1328.0,
      "Time_End": 1332.0,
      "Text": " So we, while analyzing the emails,"
    },
    {
      "Time_Start": 1332.0,
      "Time_End": 1336.0,
      "Text": " we found a bunch of ARC stuff."
    },
    {
      "Time_Start": 1336.0,
      "Time_End": 1340.0,
      "Text": " And we weren't really sure what this was. We've never seen these headers before in an email."
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1344.0,
      "Text": " We, there was like ARC seal, ARC message signature, ARC authentication"
    },
    {
      "Time_Start": 1344.0,
      "Time_End": 1348.0,
      "Text": " results, and we were like wondering, what is this? Like I've never seen"
    },
    {
      "Time_Start": 1348.0,
      "Time_End": 1352.0,
      "Text": " this before. So let me introduce you to authenticated receive chain."
    },
    {
      "Time_Start": 1352.0,
      "Time_End": 1356.0,
      "Text": " Okay, so that's what ARC stands for. And I quote here,"
    },
    {
      "Time_Start": 1356.0,
      "Time_End": 1360.0,
      "Text": " ARC allows an intermediate mail server to sign the message's original authentication results"
    },
    {
      "Time_Start": 1360.0,
      "Time_End": 1364.0,
      "Text": " so that even when SPF or DKIM fails at the receiver end, the receiver"
    },
    {
      "Time_Start": 1364.0,
      "Time_End": 1368.0,
      "Text": " can still check the chain of authentication records to determine whether the message can be"
    },
    {
      "Time_Start": 1368.0,
      "Time_End": 1372.0,
      "Text": " accepted. Okay, so what the important thing to know about ARC is that"
    },
    {
      "Time_Start": 1372.0,
      "Time_End": 1376.0,
      "Text": " it guarantees chain of custody. It doesn't necessarily"
    },
    {
      "Time_Start": 1376.0,
      "Time_End": 1380.0,
      "Text": " mean that the email wasn't spoofed, okay."
    },
    {
      "Time_Start": 1380.0,
      "Time_End": 1384.0,
      "Text": " And ARC was made specifically"
    },
    {
      "Time_Start": 1384.0,
      "Time_End": 1388.0,
      "Text": " for email forwarding scenarios because"
    },
    {
      "Time_Start": 1388.0,
      "Time_End": 1392.0,
      "Text": " like if you want to send a newsletter out, what happens is that"
    },
    {
      "Time_Start": 1392.0,
      "Time_End": 1396.0,
      "Text": " the newsletter service sometimes modifies the body of the message and stuff"
    },
    {
      "Time_Start": 1396.0,
      "Time_End": 1400.0,
      "Text": " with like unsubscribe links and subject links and that kind of stuff. And so"
    },
    {
      "Time_Start": 1400.0,
      "Time_End": 1404.0,
      "Text": " that makes it impossible to use DKIM, for example, in order to actually"
    },
    {
      "Time_Start": 1404.0,
      "Time_End": 1408.0,
      "Text": " forward that mail securely. And ARC, it's a relatively"
    },
    {
      "Time_Start": 1408.0,
      "Time_End": 1412.0,
      "Text": " experimental protocol. Like it was written up I think in 2016. It was published"
    },
    {
      "Time_Start": 1412.0,
      "Time_End": 1416.0,
      "Text": " in 2019. However, that hasn't stopped a few brave"
    },
    {
      "Time_Start": 1416.0,
      "Time_End": 1420.0,
      "Text": " souls in adopting it. And by a few brave souls, I mean like Gmail, Outlook,"
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1424.0,
      "Text": " Zoho, Fastmail, like all the big ones. And ProtonMail, new, which"
    },
    {
      "Time_Start": 1424.0,
      "Time_End": 1428.0,
      "Text": " I found out, which you'll see in a second. It's pretty hilarious."
    },
    {
      "Time_Start": 1428.0,
      "Time_End": 1432.0,
      "Text": " So this is what ARC looked like in practice. So when you want to"
    },
    {
      "Time_Start": 1432.0,
      "Time_End": 1436.0,
      "Text": " forward an email, right, ARC basically records"
    },
    {
      "Time_Start": 1436.0,
      "Time_End": 1440.0,
      "Text": " the authentication results, hence the ARC authentication results header."
    },
    {
      "Time_Start": 1440.0,
      "Time_End": 1444.0,
      "Text": " Each hop the email goes through. So like you"
    },
    {
      "Time_Start": 1444.0,
      "Time_End": 1448.0,
      "Text": " send it from your email server. It gets sent through multiple other email"
    },
    {
      "Time_Start": 1448.0,
      "Time_End": 1452.0,
      "Text": " servers. Each hop puts the AAR header,"
    },
    {
      "Time_Start": 1452.0,
      "Time_End": 1456.0,
      "Text": " the AMS header, and the AS header each step of the way in the email"
    },
    {
      "Time_Start": 1456.0,
      "Time_End": 1460.0,
      "Text": " in order to record those results. And for the sake of this"
    },
    {
      "Time_Start": 1460.0,
      "Time_End": 1464.0,
      "Text": " talk, we're only going to talk about the AAR header"
    },
    {
      "Time_Start": 1464.0,
      "Time_End": 1468.0,
      "Text": " because that's where the juice comes in."
    },
    {
      "Time_Start": 1468.0,
      "Time_End": 1472.0,
      "Text": " And again, like ARC is meant to determine"
    },
    {
      "Time_Start": 1472.0,
      "Time_End": 1476.0,
      "Text": " that the chain of custody hasn't been broken in the email. So like the message hasn't been tampered with."
    },
    {
      "Time_Start": 1476.0,
      "Time_End": 1480.0,
      "Text": " It's not really meant to, it's left up to the end receiver"
    },
    {
      "Time_Start": 1480.0,
      "Time_End": 1484.0,
      "Text": " to determine if the email was spoofed"
    },
    {
      "Time_Start": 1484.0,
      "Time_End": 1488.0,
      "Text": " with the AAR header. So the end receiver"
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1492.0,
      "Text": " has to look at the AAR header, look at the SPF, DKIM, and DMARC results"
    },
    {
      "Time_Start": 1492.0,
      "Time_End": 1496.0,
      "Text": " in that header to determine if the email was spoofed or not."
    },
    {
      "Time_Start": 1496.0,
      "Time_End": 1500.0,
      "Text": " So according to the RFC, this is what an AAR"
    },
    {
      "Time_Start": 1500.0,
      "Time_End": 1504.0,
      "Text": " header is supposed to look like. So you got your"
    },
    {
      "Time_Start": 1504.0,
      "Time_End": 1508.0,
      "Text": " hop, which is the I property there, and then you got the results of SPF,"
    },
    {
      "Time_Start": 1508.0,
      "Time_End": 1512.0,
      "Text": " DKIM, and DMARC. So you can see in the RFC example,"
    },
    {
      "Time_Start": 1512.0,
      "Time_End": 1516.0,
      "Text": " they all passed, and the end receiver has to take these results"
    },
    {
      "Time_Start": 1516.0,
      "Time_End": 1520.0,
      "Text": " and interpret that and put that in the calculations of the"
    },
    {
      "Time_Start": 1520.0,
      "Time_End": 1524.0,
      "Text": " spam score in order to determine if the email should go to inbox or should go to spam."
    },
    {
      "Time_Start": 1524.0,
      "Time_End": 1528.0,
      "Text": " This is what MailChannel's AAR header looks like."
    },
    {
      "Time_Start": 1528.0,
      "Time_End": 1532.0,
      "Text": " So basically, they're not checking"
    },
    {
      "Time_Start": 1532.0,
      "Time_End": 1536.0,
      "Text": " SPF, DMARC, or DKIM at all. And what happens is"
    },
    {
      "Time_Start": 1536.0,
      "Time_End": 1540.0,
      "Text": " they put in these properties that aren't really necessarily"
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1544.0,
      "Text": " representing what the header is supposed to do."
    },
    {
      "Time_Start": 1544.0,
      "Time_End": 1548.0,
      "Text": " They put this auth equals pass. What auth? There's no auth."
    },
    {
      "Time_Start": 1548.0,
      "Time_End": 1552.0,
      "Text": " You just do this. You just put the workers public. You don't need auth to do this."
    },
    {
      "Time_Start": 1552.0,
      "Time_End": 1556.0,
      "Text": " So they don't actually check the SPF,"
    },
    {
      "Time_Start": 1556.0,
      "Time_End": 1560.0,
      "Text": " DMARC, or DKIM results. And at this point, we're just like,"
    },
    {
      "Time_Start": 1560.0,
      "Time_End": 1564.0,
      "Text": " please, why can't you just be normal?"
    },
    {
      "Time_Start": 1564.0,
      "Time_End": 1568.0,
      "Text": " This is the weirdest freaking thing we've ever seen."
    },
    {
      "Time_Start": 1568.0,
      "Time_End": 1572.0,
      "Text": " It always claims auth equals pass in the AAR header."
    },
    {
      "Time_Start": 1572.0,
      "Time_End": 1576.0,
      "Text": " We were really confused about that."
    },
    {
      "Time_Start": 1576.0,
      "Time_End": 1580.0,
      "Text": " Unfortunately, though, because it's left up to the end receiver to"
    },
    {
      "Time_Start": 1580.0,
      "Time_End": 1584.0,
      "Text": " take this information and calculate the spam score with it, it's really impossible to know"
    },
    {
      "Time_Start": 1584.0,
      "Time_End": 1588.0,
      "Text": " how putting bad values in this header"
    },
    {
      "Time_Start": 1588.0,
      "Time_End": 1592.0,
      "Text": " will influence email delivery."
    },
    {
      "Time_Start": 1592.0,
      "Time_End": 1596.0,
      "Text": " With Fortinet, for example, Fortinet is a good example"
    },
    {
      "Time_Start": 1596.0,
      "Time_End": 1600.0,
      "Text": " of anything, to be clear. However, they have"
    },
    {
      "Time_Start": 1600.0,
      "Time_End": 1604.0,
      "Text": " documentation out there that states, hey, you can check this checkbox in our product"
    },
    {
      "Time_Start": 1604.0,
      "Time_End": 1608.0,
      "Text": " and we'll basically override all of the SPF, DMARC, and"
    },
    {
      "Time_Start": 1608.0,
      "Time_End": 1612.0,
      "Text": " DKIM results with the results of the AAR header."
    },
    {
      "Time_Start": 1612.0,
      "Time_End": 1616.0,
      "Text": " It's great. It's fantastic."
    },
    {
      "Time_Start": 1616.0,
      "Time_End": 1620.0,
      "Text": " And again, there's no way to actually know how this gets interpreted"
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1624.0,
      "Text": " at the end of the receiver, unfortunately."
    },
    {
      "Time_Start": 1624.0,
      "Time_End": 1628.0,
      "Text": " But what we've found through research is that"
    },
    {
      "Time_Start": 1628.0,
      "Time_End": 1632.0,
      "Text": " the presence, the sheer presence of ARC passing"
    },
    {
      "Time_Start": 1632.0,
      "Time_End": 1636.0,
      "Text": " in the email headers guarantees a better spam score."
    },
    {
      "Time_Start": 1636.0,
      "Time_End": 1640.0,
      "Text": " And we confirmed this with ProtonMail because ProtonMail actually gives you the spam score"
    },
    {
      "Time_Start": 1640.0,
      "Time_End": 1644.0,
      "Text": " result, like it breaks down how it calculated the spam score. With Gmail and"
    },
    {
      "Time_Start": 1644.0,
      "Time_End": 1648.0,
      "Text": " Outlook, there really isn't a good way of knowing that. However, in our"
    },
    {
      "Time_Start": 1648.0,
      "Time_End": 1652.0,
      "Text": " tests, it seems like it sort of behaves the same way. So ARC passing"
    },
    {
      "Time_Start": 1652.0,
      "Time_End": 1656.0,
      "Text": " generally guarantees a better spam score. So if you're conducting phishing engagements,"
    },
    {
      "Time_Start": 1656.0,
      "Time_End": 1660.0,
      "Text": " all you have to do is adopt ARC and you'll have"
    },
    {
      "Time_Start": 1660.0,
      "Time_End": 1664.0,
      "Text": " a better chance of landing that email in people's inbox. A little Red Team Pro tip"
    },
    {
      "Time_Start": 1664.0,
      "Time_End": 1668.0,
      "Text": " right there. But as a consequence of this,"
    },
    {
      "Time_Start": 1668.0,
      "Time_End": 1672.0,
      "Text": " which is very interesting, is that if a domain"
    },
    {
      "Time_Start": 1672.0,
      "Time_End": 1676.0,
      "Text": " doesn't have any SPF, DMARC, or DKIM record at all,"
    },
    {
      "Time_Start": 1676.0,
      "Time_End": 1680.0,
      "Text": " using mail channels, you can actually"
    },
    {
      "Time_Start": 1680.0,
      "Time_End": 1684.0,
      "Text": " potentially spoof them at a higher success rate."
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1688.0,
      "Text": " And then this sort of increases the blast radius a bit, where you can"
    },
    {
      "Time_Start": 1688.0,
      "Time_End": 1692.0,
      "Text": " basically spoof emails from domains that aren't set up to send"
    },
    {
      "Time_Start": 1692.0,
      "Time_End": 1696.0,
      "Text": " email, and you have a very high chance of actually landing that email in the inbox."
    },
    {
      "Time_Start": 1696.0,
      "Time_End": 1700.0,
      "Text": " So this opens up the blast radius from like 2 million domains"
    },
    {
      "Time_Start": 1700.0,
      "Time_End": 1704.0,
      "Text": " to like over 3 billion, which is very interesting."
    },
    {
      "Time_Start": 1704.0,
      "Time_End": 1708.0,
      "Text": " And again, the caveat being, as long as the end service"
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1712.0,
      "Text": " adopted ARC here, you have a higher chance of doing this, which is"
    },
    {
      "Time_Start": 1712.0,
      "Time_End": 1716.0,
      "Text": " very interesting."
    },
    {
      "Time_Start": 1716.0,
      "Time_End": 1720.0,
      "Text": " In order to prove this, I was like, okay, well, first off,"
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1724.0,
      "Text": " I have to find a domain without any SPF"
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1728.0,
      "Text": " and DMARC record, which is pretty easy, but"
    },
    {
      "Time_Start": 1728.0,
      "Time_End": 1732.0,
      "Text": " there was one in particular that was super interesting to me, and about that time"
    },
    {
      "Time_Start": 1732.0,
      "Time_End": 1736.0,
      "Text": " my Black Hat talk about this got accepted. So that was really"
    },
    {
      "Time_Start": 1736.0,
      "Time_End": 1740.0,
      "Text": " weird also because I didn't actually submit the Black Hat talk."
    },
    {
      "Time_Start": 1740.0,
      "Time_End": 1744.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1744.0,
      "Time_End": 1748.0,
      "Text": " So it turns out that I spoofed BlackHat.com."
    },
    {
      "Time_Start": 1748.0,
      "Time_End": 1752.0,
      "Text": " So BlackHat.com..."
    },
    {
      "Time_Start": 1756.0,
      "Time_End": 1760.0,
      "Text": " So BlackHat.com didn't have an SPF or DMARC"
    },
    {
      "Time_Start": 1760.0,
      "Time_End": 1764.0,
      "Text": " record until February 2023, and"
    },
    {
      "Time_Start": 1764.0,
      "Time_End": 1768.0,
      "Text": " because ProtonMail, which is the service I use for my mail,"
    },
    {
      "Time_Start": 1768.0,
      "Time_End": 1772.0,
      "Text": " takes ARC into consideration, through the Cloudflare worker that"
    },
    {
      "Time_Start": 1772.0,
      "Time_End": 1776.0,
      "Text": " uses mail channels, I was able to spoof BlackHat.com because of"
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1780.0,
      "Text": " their adoption of ARC, ProtonMail calculated that into the spam score"
    },
    {
      "Time_Start": 1780.0,
      "Time_End": 1784.0,
      "Text": " and it just landed straight into the inbox. And these are the headers to prove it"
    },
    {
      "Time_Start": 1784.0,
      "Time_End": 1788.0,
      "Text": " where you can see ProtonMail is like, okay, BlackHat.com doesn't have a DMARC,"
    },
    {
      "Time_Start": 1788.0,
      "Time_End": 1792.0,
      "Text": " SPF, or DKIM record, right? So that"
    },
    {
      "Time_Start": 1792.0,
      "Time_End": 1796.0,
      "Text": " adds zero to the spam score. It's neutral. But hey, ARC passed."
    },
    {
      "Time_Start": 1796.0,
      "Time_End": 1800.0,
      "Text": " So, hey, that minus one. And apparently"
    },
    {
      "Time_Start": 1800.0,
      "Time_End": 1804.0,
      "Text": " that's all that was needed to get that email into the inbox."
    },
    {
      "Time_Start": 1804.0,
      "Time_End": 1808.0,
      "Text": " That little minus one. And again,"
    },
    {
      "Time_Start": 1808.0,
      "Time_End": 1812.0,
      "Text": " there's no way of knowing this"
    },
    {
      "Time_Start": 1812.0,
      "Time_End": 1816.0,
      "Text": " for sure outside of ProtonMail because Gmail and Outlook from"
    },
    {
      "Time_Start": 1816.0,
      "Time_End": 1820.0,
      "Text": " what we've seen doesn't actually give you the spam score calculations"
    },
    {
      "Time_Start": 1820.0,
      "Time_End": 1824.0,
      "Text": " like this. But yeah, this is very interesting."
    },
    {
      "Time_Start": 1824.0,
      "Time_End": 1828.0,
      "Text": " So, another disclaimer before I do the demo here."
    },
    {
      "Time_Start": 1828.0,
      "Time_End": 1832.0,
      "Text": " Don't do crimes, again."
    },
    {
      "Time_Start": 1832.0,
      "Time_End": 1836.0,
      "Text": " But basically now this is public where you can go to"
    },
    {
      "Time_Start": 1836.0,
      "Time_End": 1840.0,
      "Text": " spamchannel.hacks.worker.dev"
    },
    {
      "Time_Start": 1840.0,
      "Time_End": 1844.0,
      "Text": " and you can basically spoof all of mail channels"
    },
    {
      "Time_Start": 1844.0,
      "Time_End": 1848.0,
      "Text": " domains and any domain that"
    },
    {
      "Time_Start": 1848.0,
      "Time_End": 1852.0,
      "Text": " potentially doesn't have a DMARC, SPF record. And this was based off"
    },
    {
      "Time_Start": 1852.0,
      "Time_End": 1856.0,
      "Text": " of Isangan's CloudFlare worker code, which is the original person who wrote this."
    },
    {
      "Time_Start": 1856.0,
      "Time_End": 1860.0,
      "Text": " So shout out to him or her. But yeah, and it only tests on domains you control."
    },
    {
      "Time_Start": 1860.0,
      "Time_End": 1864.0,
      "Text": " The code for this will be available after the talk as well."
    },
    {
      "Time_Start": 1864.0,
      "Time_End": 1868.0,
      "Text": " So, quick demo here."
    },
    {
      "Time_Start": 1878.0,
      "Time_End": 1882.0,
      "Text": " Just thinking"
    },
    {
      "Time_Start": 1882.0,
      "Time_End": 1886.0,
      "Text": " about it."
    },
    {
      "Time_Start": 1886.0,
      "Time_End": 1890.0,
      "Text": " Uh-oh."
    },
    {
      "Time_Start": 1890.0,
      "Time_End": 1894.0,
      "Text": " Hmm."
    },
    {
      "Time_Start": 1894.0,
      "Time_End": 1898.0,
      "Text": " All right, I'm going to try that again."
    },
    {
      "Time_Start": 1898.0,
      "Time_End": 1902.0,
      "Text": " Wow."
    },
    {
      "Time_Start": 1902.0,
      "Time_End": 1906.0,
      "Text": " Wow, demo gods really hate me. How about this one?"
    },
    {
      "Time_Start": 1906.0,
      "Time_End": 1910.0,
      "Text": " Well, there are videos here."
    },
    {
      "Time_Start": 1910.0,
      "Time_End": 1914.0,
      "Text": " Oh."
    },
    {
      "Time_Start": 1918.0,
      "Time_End": 1922.0,
      "Text": " I don't know if we're going to be able to fix that in time."
    },
    {
      "Time_Start": 1922.0,
      "Time_End": 1926.0,
      "Text": " But maybe we will. I don't know. Well, let's see."
    },
    {
      "Time_Start": 1926.0,
      "Time_End": 1930.0,
      "Text": " I'm going to continue the presentation. Am I allowed to connect to the Internet?"
    },
    {
      "Time_Start": 1930.0,
      "Time_End": 1934.0,
      "Text": " Well,"
    },
    {
      "Time_Start": 1934.0,
      "Time_End": 1938.0,
      "Text": " at this point I think I'm not going to get invited to Black Hat, so I think at this point I'm just going to..."
    },
    {
      "Time_Start": 1946.0,
      "Time_End": 1950.0,
      "Text": " I mean, I don't know."
    },
    {
      "Time_Start": 1950.0,
      "Time_End": 1954.0,
      "Text": " All right, well."
    },
    {
      "Time_Start": 1954.0,
      "Time_End": 1958.0,
      "Text": " I don't know what's going on, but I'm going to continue and maybe somebody can come up"
    },
    {
      "Time_Start": 1958.0,
      "Time_End": 1962.0,
      "Text": " here and figure that out. Okay. Let's see."
    },
    {
      "Time_Start": 1962.0,
      "Time_End": 1966.0,
      "Text": " Where is the presentation button? There it is. Okay."
    },
    {
      "Time_Start": 1966.0,
      "Time_End": 1970.0,
      "Text": " Perfect. Well, hopefully I'll be able to show you a video of this. If not, you can literally just try"
    },
    {
      "Time_Start": 1970.0,
      "Time_End": 1974.0,
      "Text": " it yourself. You just go to that URL. So, disclosure"
    },
    {
      "Time_Start": 1974.0,
      "Time_End": 1978.0,
      "Text": " timeline. This all started in November of 2022. I initially contacted"
    },
    {
      "Time_Start": 1978.0,
      "Time_End": 1982.0,
      "Text": " mail channels and told them, hey, you know, this is a thing."
    },
    {
      "Time_Start": 1982.0,
      "Time_End": 1986.0,
      "Text": " You should probably reconsider considering the Cloudflare workers."
    },
    {
      "Time_Start": 1986.0,
      "Time_End": 1990.0,
      "Text": " You did this partnership with Cloudflare now and you got the Cloudflare worker thing going on."
    },
    {
      "Time_Start": 1990.0,
      "Time_End": 1994.0,
      "Text": " No further response after that. January 2023, they were contacted by"
    },
    {
      "Time_Start": 1994.0,
      "Time_End": 1998.0,
      "Text": " Rapid7 and they were, again, response immediately"
    },
    {
      "Time_Start": 1998.0,
      "Time_End": 2002.0,
      "Text": " saying we don't consider this an issue, but then"
    },
    {
      "Time_Start": 2002.0,
      "Time_End": 2006.0,
      "Text": " no further response. Then in June of 2023,"
    },
    {
      "Time_Start": 2006.0,
      "Time_End": 2010.0,
      "Text": " I sent the final update to them saying, hey, you know, I got accepted at"
    },
    {
      "Time_Start": 2010.0,
      "Time_End": 2014.0,
      "Text": " DEF CON and I summarized all the findings and everything. Again, no response."
    },
    {
      "Time_Start": 2014.0,
      "Time_End": 2018.0,
      "Text": " And then July of 2023, my mail channel sends me a random"
    },
    {
      "Time_Start": 2018.0,
      "Time_End": 2022.0,
      "Text": " email saying, hey, we noticed that you're speaking at DEF CON. Can you please share your findings"
    },
    {
      "Time_Start": 2022.0,
      "Time_End": 2026.0,
      "Text": " with us? To which I said, well,"
    },
    {
      "Time_Start": 2026.0,
      "Time_End": 2030.0,
      "Text": " I mean, I've been literally talking to your CEO since November of 2022, but okay."
    },
    {
      "Time_Start": 2030.0,
      "Time_End": 2034.0,
      "Text": " And then so it turns out my vulnerability"
    },
    {
      "Time_Start": 2034.0,
      "Time_End": 2038.0,
      "Text": " reporting was going straight to spam."
    },
    {
      "Time_Start": 2038.0,
      "Time_End": 2042.0,
      "Text": " Which is very ironic. I should have used mail channels for that"
    },
    {
      "Time_Start": 2042.0,
      "Time_End": 2046.0,
      "Text": " apparently."
    },
    {
      "Time_Start": 2046.0,
      "Time_End": 2050.0,
      "Text": " So yeah, like a Gmail filter on that was literally sending my emails to spam for some reason."
    },
    {
      "Time_Start": 2050.0,
      "Time_End": 2054.0,
      "Text": " But after that, they basically said, hey,"
    },
    {
      "Time_Start": 2054.0,
      "Time_End": 2058.0,
      "Text": " we introduced this thing called domain lockdown mode. So the takeaway here"
    },
    {
      "Time_Start": 2058.0,
      "Time_End": 2062.0,
      "Text": " is as of June 2023, if you're a mail channels customer, you have"
    },
    {
      "Time_Start": 2062.0,
      "Time_End": 2066.0,
      "Text": " this domain lockdown record that they implemented, which basically allows you to"
    },
    {
      "Time_Start": 2066.0,
      "Time_End": 2070.0,
      "Text": " specify the worker, the Cloudflare worker that"
    },
    {
      "Time_Start": 2070.0,
      "Time_End": 2074.0,
      "Text": " is actually allowed to send emails on behalf of your domain, or you can"
    },
    {
      "Time_Start": 2074.0,
      "Time_End": 2078.0,
      "Text": " completely disallow mail channels from sending emails from your domain at all."
    },
    {
      "Time_Start": 2078.0,
      "Time_End": 2082.0,
      "Text": " So that's nice. Now the kicker here, though, is that"
    },
    {
      "Time_Start": 2082.0,
      "Time_End": 2086.0,
      "Text": " you can still send emails without"
    },
    {
      "Time_Start": 2086.0,
      "Time_End": 2090.0,
      "Text": " the domain lockdown record. So it's not like you"
    },
    {
      "Time_Start": 2090.0,
      "Time_End": 2094.0,
      "Text": " don't need a domain lockdown record in order for people to randomly just send emails"
    },
    {
      "Time_Start": 2094.0,
      "Time_End": 2098.0,
      "Text": " from your domain. So you need to actively go in there and put the record in. Otherwise, people"
    },
    {
      "Time_Start": 2098.0,
      "Time_End": 2102.0,
      "Text": " can just spoof your domain. It's to be announced when"
    },
    {
      "Time_Start": 2102.0,
      "Time_End": 2106.0,
      "Text": " this will be like a default thing where you're not going to be allowed to send emails"
    },
    {
      "Time_Start": 2106.0,
      "Time_End": 2110.0,
      "Text": " through Cloudflare through mail channels unless you put in the domain lockdown"
    },
    {
      "Time_Start": 2110.0,
      "Time_End": 2114.0,
      "Text": " record. So as of now, you can still spoof all"
    },
    {
      "Time_Start": 2114.0,
      "Time_End": 2118.0,
      "Text": " of their customer domains with this."
    },
    {
      "Time_Start": 2118.0,
      "Time_End": 2122.0,
      "Text": " And so if you're an org that uses mail channels,"
    },
    {
      "Time_Start": 2122.0,
      "Time_End": 2126.0,
      "Text": " you should, well, if you don't know, you should check your SPF record, number one."
    },
    {
      "Time_Start": 2126.0,
      "Time_End": 2130.0,
      "Text": " And if you do use mail channels, put in the domain lockdown record. You should probably go"
    },
    {
      "Time_Start": 2130.0,
      "Time_End": 2134.0,
      "Text": " through all of your also domains and just make sure that you have an SPF record"
    },
    {
      "Time_Start": 2134.0,
      "Time_End": 2138.0,
      "Text": " there set."
    },
    {
      "Time_Start": 2138.0,
      "Time_End": 2142.0,
      "Text": " And if it's a thing, you can also have like, you can potentially"
    },
    {
      "Time_Start": 2142.0,
      "Time_End": 2146.0,
      "Text": " display a banner if an email that doesn't have a DKIM signature"
    },
    {
      "Time_Start": 2146.0,
      "Time_End": 2150.0,
      "Text": " comes from a domain that has implemented DKIM. I've never seen that. I don't even know that's a thing."
    },
    {
      "Time_Start": 2150.0,
      "Time_End": 2154.0,
      "Text": " But that's potentially something you can do. If you're an email service"
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2158.0,
      "Text": " provider like Gmail Outlook,"
    },
    {
      "Time_Start": 2158.0,
      "Time_End": 2162.0,
      "Text": " don't just bump the spam score of an email just because ARC is passing."
    },
    {
      "Time_Start": 2162.0,
      "Time_End": 2166.0,
      "Text": " I don't know why that's a thing, but"
    },
    {
      "Time_Start": 2166.0,
      "Time_End": 2170.0,
      "Text": " you should probably not do that because I don't think that's how"
    },
    {
      "Time_Start": 2170.0,
      "Time_End": 2174.0,
      "Text": " the protocol is intended to work."
    },
    {
      "Time_Start": 2174.0,
      "Time_End": 2178.0,
      "Text": " And if you're an email transaction service, just don't do this. Just use"
    },
    {
      "Time_Start": 2178.0,
      "Time_End": 2182.0,
      "Text": " sender identity verification and dedicated sending IPs"
    },
    {
      "Time_Start": 2182.0,
      "Time_End": 2186.0,
      "Text": " because that just solves this entire swath of problems"
    },
    {
      "Time_Start": 2186.0,
      "Time_End": 2190.0,
      "Text": " and everybody uses this except mail channels apparently."
    },
    {
      "Time_Start": 2190.0,
      "Time_End": 2194.0,
      "Text": " And so the final takeaway is email security is very brittle. It relies on, still relies on"
    },
    {
      "Time_Start": 2194.0,
      "Time_End": 2198.0,
      "Text": " users and orgs to do the right things. And ARC potentially could"
    },
    {
      "Time_Start": 2198.0,
      "Time_End": 2202.0,
      "Text": " incentivize a trend of gaming the system, which is something to consider as well."
    },
    {
      "Time_Start": 2202.0,
      "Time_End": 2206.0,
      "Text": " And then finally, I want to shout out two researchers,"
    },
    {
      "Time_Start": 2206.0,
      "Time_End": 2210.0,
      "Text": " Shengkai and Gang, who basically is who I stole"
    },
    {
      "Time_Start": 2210.0,
      "Time_End": 2214.0,
      "Text": " the awesome graphics for DMARC and SPF explanations and stuff, and they did a lot of"
    },
    {
      "Time_Start": 2214.0,
      "Time_End": 2218.0,
      "Text": " the initial research into ARC as well. As well as Yisangan, who"
    },
    {
      "Time_Start": 2218.0,
      "Time_End": 2222.0,
      "Text": " made the initial worker code that I based the tool that I released off of."
    },
    {
      "Time_Start": 2222.0,
      "Time_End": 2226.0,
      "Text": " And a huge shout out to the Rapid7 folks as well,"
    },
    {
      "Time_Start": 2226.0,
      "Time_End": 2230.0,
      "Text": " to help me do this research. Thank you."
    },
    {
      "Time_Start": 2230.0,
      "Time_End": 2234.0,
      "Text": " applause"
    },
    {
      "Time_Start": 2234.0,
      "Time_End": 2238.0,
      "Text": " applause"
    },
    {
      "Time_Start": 2238.0,
      "Time_End": 2242.0,
      "Text": " Perfect. I just want to double check that."
    }
  ]
}