{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thanks. Alright. So we were hustling and stressing because of the, cause we have a Diablo font and"
    },
    {
      "Time_Start": 10.38,
      "Time_End": 15.780000000000001,
      "Text": " it was not working. So this is why we switched lap lap laptop last minute and like we really"
    },
    {
      "Time_Start": 15.780000000000001,
      "Time_End": 20.76,
      "Text": " want the thing to be themed properly and so for you to enjoy this this thing. This is quite an"
    },
    {
      "Time_Start": 20.76,
      "Time_End": 26.36,
      "Text": " adventure that we're gonna we're gonna talk about today. Disclaimer there's a lot of nerdiness"
    },
    {
      "Time_Start": 26.36,
      "Time_End": 30.56,
      "Text": " in there. There's a lot of of tongue in cheek references to Dungeon and Dragons. Those who"
    },
    {
      "Time_Start": 30.56,
      "Time_End": 36.7,
      "Text": " don't know I'm sorry. Those who do will enjoy it. Uh we were inspired by Stranger Things last"
    },
    {
      "Time_Start": 36.7,
      "Time_End": 42.64,
      "Text": " year obviously which made it very popular bring it to the forefront. But also the movie um"
    },
    {
      "Time_Start": 42.64,
      "Time_End": 47.519999999999996,
      "Text": " Dungeon and Dragons Honor Among Thieves that was out in March when we were doing the CFP"
    },
    {
      "Time_Start": 47.519999999999996,
      "Time_End": 52.82,
      "Text": " obviously and I am a big Dungeon and Dragon player. But so we thought we could pull it off."
    },
    {
      "Time_Start": 52.82,
      "Time_End": 58.12,
      "Text": " Thank you. We thought we we could pull it off because it was in the mainstream right. It is"
    },
    {
      "Time_Start": 58.12,
      "Time_End": 64.16,
      "Text": " trendy but uh we're gonna end the pop culture reference here. It's gonna be like the more OG"
    },
    {
      "Time_Start": 64.16,
      "Time_End": 70.46000000000001,
      "Text": " Dungeon and Dragons stuff. So I'm Oliver. I'm a cyber security security research director at"
    },
    {
      "Time_Start": 70.46000000000001,
      "Time_End": 75.48,
      "Text": " Go Secure and. And I'm Andrea Vergeron. I'm uh I have a PhD in criminology and I also work as"
    },
    {
      "Time_Start": 77.48,
      "Time_End": 82.74000000000001,
      "Text": " a cyber security researcher at Go Secure. So I'm interested in the criminal behavior and the"
    },
    {
      "Time_Start": 83.66,
      "Time_End": 90.5,
      "Text": " decision making and everything. Thank you. So today's quest. Alright. So our agenda if you"
    },
    {
      "Time_Start": 90.5,
      "Time_End": 95.61999999999999,
      "Text": " want. We're gonna talk about RDP interception. We're gonna eh like we you you need to"
    },
    {
      "Time_Start": 95.61999999999999,
      "Time_End": 100.67999999999999,
      "Text": " understand what's possible and how it can be done and what tools we use. But this is not the"
    },
    {
      "Time_Start": 100.67999999999999,
      "Time_End": 106.96,
      "Text": " core focus of this presentation. Uh we were then gonna dive into attacker classes. So like"
    },
    {
      "Time_Start": 106.98,
      "Time_End": 112.62,
      "Text": " barbarians and thieves and stuff like that. Uh we we summarize over a hundred and ninety"
    },
    {
      "Time_Start": 112.62,
      "Time_End": 118.96000000000001,
      "Text": " million events. An event is basically a log line. So a JSON log. Uh uh we're gonna we're"
    },
    {
      "Time_Start": 118.96000000000001,
      "Time_End": 123.96000000000001,
      "Text": " gonna summarize what we collected. Then we're gonna talk about the tools of the hacker."
    },
    {
      "Time_Start": 123.96000000000001,
      "Time_End": 129.36,
      "Text": " What they use. Their weapons. Their swords and their axes and shit. And uh we're gonna then"
    },
    {
      "Time_Start": 129.36,
      "Time_End": 136.28,
      "Text": " show some really cool interesting memor memorizable sessions. So here are the characters"
    },
    {
      "Time_Start": 136.3,
      "Time_End": 142.04,
      "Text": " we're gonna cover today. So pretty dark themed and stuff like that. Custom art made by a"
    },
    {
      "Time_Start": 142.04,
      "Time_End": 147.04,
      "Text": " friend from Montreal. And um let's go. So why RDP? Why Olivier are you so insane about RDP?"
    },
    {
      "Time_Start": 152.58,
      "Time_End": 157.58,
      "Text": " Not giving up after four years still at it? It's because it's targeted by humans. I've run"
    },
    {
      "Time_Start": 158.42000000000002,
      "Time_End": 163.42000000000002,
      "Text": " like SSH and Telnet honeypots for for years and these are attacked by scripts and and you"
    },
    {
      "Time_Start": 166.96,
      "Time_End": 171.96,
      "Text": " know malware automated stuff. There's not like the the the richness the human behind the"
    },
    {
      "Time_Start": 175.0,
      "Time_End": 180.14000000000001,
      "Text": " keyboard aspect. When we started doing RDP research I expected automated malware. I"
    },
    {
      "Time_Start": 180.14000000000001,
      "Time_End": 185.94,
      "Text": " expected bots. But this is not what happened. What happened was a lot of uh human"
    },
    {
      "Time_Start": 185.94,
      "Time_End": 191.6,
      "Text": " interactions. And so uh this is why it's a very interesting and and really ripe for"
    },
    {
      "Time_Start": 191.6,
      "Time_End": 197.98,
      "Text": " research. Ripe for intelligence collection. But Olivier you keep talking about RDP. What is"
    },
    {
      "Time_Start": 197.98,
      "Time_End": 202.98,
      "Text": " RDP? Okay. I'm I'm like way too into this. Sorry. So this is the uh on the left hand side"
    },
    {
      "Time_Start": 206.38,
      "Time_End": 213.2,
      "Text": " this is the MSTSC client. So basically RDP is you know remote desktop protocol. So it is a"
    },
    {
      "Time_Start": 213.22000000000003,
      "Time_End": 219.06000000000003,
      "Text": " client that allow you to connect to a remote computer and then interact with it graphically."
    },
    {
      "Time_Start": 219.06000000000003,
      "Time_End": 225.64000000000001,
      "Text": " So you have the display. You have the keyboard. You have the mouse. You have sound. Uh and uh"
    },
    {
      "Time_Start": 225.64000000000001,
      "Time_End": 232.24,
      "Text": " the clipboard uh and files can be uh shared via RDP. So so we are all on the same page. We"
    },
    {
      "Time_Start": 232.24,
      "Time_End": 239.24,
      "Text": " understand this is what's what what this is about. Now the uh attack that are are done the"
    },
    {
      "Time_Start": 239.26000000000002,
      "Time_End": 245.20000000000002,
      "Text": " what allows us to study RDP at this level is because of a tool called PyRDP. I have"
    },
    {
      "Time_Start": 245.20000000000002,
      "Time_End": 250.4,
      "Text": " stickers in my bag if you want of the logo. Made by the same guy who made the art for this"
    },
    {
      "Time_Start": 250.4,
      "Time_End": 257.04,
      "Text": " talk. Um it is a a interception engine so it it can uh intercept everything record"
    },
    {
      "Time_Start": 257.04,
      "Time_End": 263.08,
      "Text": " everything and you can tamper with the RDP. And you can watch after the fact. After uh"
    },
    {
      "Time_Start": 263.08,
      "Time_End": 269.06,
      "Text": " uh everything is collected you can look at the the capture that were done. So everything"
    },
    {
      "Time_Start": 269.58,
      "Time_End": 274.58,
      "Text": " we present today was powered by or enabled by PyRDP. Now. Let's take our crystal ball and"
    },
    {
      "Time_Start": 278.32,
      "Time_End": 283.32,
      "Text": " take a look at what it looks like. What the the tool looks like. Sorry. So here uh this"
    },
    {
      "Time_Start": 285.66,
      "Time_End": 291.34000000000003,
      "Text": " is the this is our tool so it's uh the PyRDP player. Uh so this is what we see when we"
    },
    {
      "Time_Start": 291.34000000000003,
      "Time_End": 295.6,
      "Text": " analyze the sessions. So when it will start in a second you'll see the screen of the"
    },
    {
      "Time_Start": 295.62,
      "Time_End": 300.78000000000003,
      "Text": " attacker and everything that's going on on it. And then you'll see the mouse movement uh on"
    },
    {
      "Time_Start": 300.78000000000003,
      "Time_End": 306.46000000000004,
      "Text": " the uh with the little yellow dot. And then here you'll see everything that goes through"
    },
    {
      "Time_Start": 306.46000000000004,
      "Time_End": 312.3,
      "Text": " the clipboard and the keyboard so everything that it types or uh or copy paste and at the"
    },
    {
      "Time_Start": 312.3,
      "Time_End": 317.04,
      "Text": " beginning of the session like here you see the host and the domain they use to connect and"
    },
    {
      "Time_Start": 317.04,
      "Time_End": 322.04,
      "Text": " the credential they use also. So it starts. So right here we see in the clipboard the"
    },
    {
      "Time_Start": 322.58000000000004,
      "Time_End": 327.58000000000004,
      "Text": " first thing we still is uh is our IP address. It's the the last thing it copy paste basically."
    },
    {
      "Time_Start": 331.36,
      "Time_End": 336.36,
      "Text": " Here we see the attacker type and everything like and even here it will change the the the"
    },
    {
      "Time_Start": 339.40000000000003,
      "Time_End": 345.24,
      "Text": " creds to enter the session and even if we don't see on the screen we see it on the clipboard"
    },
    {
      "Time_Start": 345.24,
      "Time_End": 350.24,
      "Text": " uh capture. Uh what's interesting here is that the attacker paste his C drive to the"
    },
    {
      "Time_Start": 352.08000000000004,
      "Time_End": 359.02000000000004,
      "Text": " C drive directly on our our system so we can uh basically steal everything. Um and here he"
    },
    {
      "Time_Start": 359.02000000000004,
      "Time_End": 365.52000000000004,
      "Text": " proceeds with uh with uh with his activity which is using XMRID. So it's basically a"
    },
    {
      "Time_Start": 365.52000000000004,
      "Time_End": 370.54,
      "Text": " surveillance camera for Windows system. So the um the way we deployed this, we deployed"
    },
    {
      "Time_Start": 373.64000000000004,
      "Time_End": 380.08000000000004,
      "Text": " this in the cloud uh and we exposed only the PyRDP system. You can see in this diagram"
    },
    {
      "Time_Start": 380.08,
      "Time_End": 386.82,
      "Text": " that we carefully firewalled with OG castles our system but so the Windows system it was"
    },
    {
      "Time_Start": 386.82,
      "Time_End": 392.09999999999997,
      "Text": " not exposed directly. You had to go through the intercept the RDP interception engine in"
    },
    {
      "Time_Start": 392.09999999999997,
      "Time_End": 397.96,
      "Text": " order to reach it. This is what we want to convey here that is important. Uh and if you"
    },
    {
      "Time_Start": 397.96,
      "Time_End": 403.09999999999997,
      "Text": " want to learn more about PyRDP since this talk is not about PyRDP, there's a ton of"
    },
    {
      "Time_Start": 403.09999999999997,
      "Time_End": 410.02,
      "Text": " references out there, ton of blog posts, ton of stuff and the guy who first wrote PyRDP"
    },
    {
      "Time_Start": 410.02,
      "Time_End": 415.02,
      "Text": " as an intern working with me is even here, Emilio. Shout out to Emilio Gonzalez. And so"
    },
    {
      "Time_Start": 420.79999999999995,
      "Time_End": 425.79999999999995,
      "Text": " you can see his talks, his blog posts and his presentations about it. But now we"
    },
    {
      "Time_Start": 425.79999999999995,
      "Time_End": 431.94,
      "Text": " collected data with it and let's talk about that. So welcome to the dungeon adventures."
    },
    {
      "Time_Start": 431.94,
      "Time_End": 436.94,
      "Text": " Sorry about that. So what we have is we collected events for over 3 years, 190 million"
    },
    {
      "Time_Start": 437.34,
      "Time_End": 442.34,
      "Text": " events as I said earlier. This is like 21 million net NTLM V2 hashes because we support"
    },
    {
      "Time_Start": 445.88,
      "Time_End": 450.88,
      "Text": " NLA network level authentication. Um we have like 2,500 successful logins. Okay. Uh I'm"
    },
    {
      "Time_Start": 454.96,
      "Time_End": 460.76,
      "Text": " going to give you an insight. Our password is admin. So 2 hundred 2 thousand people"
    },
    {
      "Time_Start": 460.76,
      "Time_End": 465.76,
      "Text": " figured that out. Um we uh and then we collected via that 478 files. We collected"
    },
    {
      "Time_Start": 466.96,
      "Time_End": 471.96,
      "Text": " uh more than 2,300 valid captures that we could replay, see the keyboard, clipboard, mouse"
    },
    {
      "Time_Start": 475.28,
      "Time_End": 480.88,
      "Text": " movement, all of that stuff. Some of those sessions are related right? The attacker might"
    },
    {
      "Time_Start": 480.88,
      "Time_End": 484.64,
      "Text": " connect to our system more than once for example and there's a couple of evidence that we"
    },
    {
      "Time_Start": 484.64,
      "Time_End": 489.65999999999997,
      "Text": " can uh uh that we can observe uh to make to group them. Uh so the first one would be like if"
    },
    {
      "Time_Start": 491.82,
      "Time_End": 496.12,
      "Text": " they change the password and then come back on our system with this password so we know"
    },
    {
      "Time_Start": 496.14,
      "Time_End": 500.98,
      "Text": " it's the same person. Or when there's a continuity of activities uh throughout the different"
    },
    {
      "Time_Start": 500.98,
      "Time_End": 506.42,
      "Text": " session. Uh so those are all evidence that uh that we use to group them. And uh when we"
    },
    {
      "Time_Start": 506.42,
      "Time_End": 511.42,
      "Text": " group the that the final data set that we have, we have uh 95 different attackers or group"
    },
    {
      "Time_Start": 513.4,
      "Time_End": 518.4,
      "Text": " of attackers. Um so the so the for for from the 2 point 3 thousand session there's uh"
    },
    {
      "Time_Start": 519.36,
      "Time_End": 524.36,
      "Text": " 455 session with some content so that they actually connect to the server and open the"
    },
    {
      "Time_Start": 528.26,
      "Time_End": 532.4,
      "Text": " system. Uh but they are not all interesting because sometimes they just connect and"
    },
    {
      "Time_Start": 532.4,
      "Time_End": 537.4,
      "Text": " disconnect. So uh so over that there there's 339 session of interest that we analyze and"
    },
    {
      "Time_Start": 539.34,
      "Time_End": 544.78,
      "Text": " this is what we are presenting today. If we take a look at the indicator of the MITRE"
    },
    {
      "Time_Start": 544.8,
      "Time_End": 549.9599999999999,
      "Text": " ATT&CK framework, this is what we get. So there's a lot of uh resource hijacking, system"
    },
    {
      "Time_Start": 549.9599999999999,
      "Time_End": 555.1999999999999,
      "Text": " network configuration discovery, uh active scanning including scanning IP blocks and uh"
    },
    {
      "Time_Start": 555.1999999999999,
      "Time_End": 560.1999999999999,
      "Text": " wordless scanning. Uh so basically what you see uh the most is uh is uh reconnaissance uh and"
    },
    {
      "Time_Start": 563.62,
      "Time_End": 568.62,
      "Text": " discovery. Thank you. Uh so let's see what are the different profile of behavior that we see"
    },
    {
      "Time_Start": 568.76,
      "Time_End": 573.76,
      "Text": " on our uh on our sessions. So this is our party. Uh there's 5 different profile and we will"
    },
    {
      "Time_Start": 576.8,
      "Time_End": 581.8,
      "Text": " see uh we we seal them uh 1 by 1 yeah 1 by 1. So maybe you didn't notice it already but this"
    },
    {
      "Time_Start": 585.54,
      "Time_End": 590.54,
      "Text": " one is the ranger. Okay and he's stealthy. You'll understand why. So um the ranger will"
    },
    {
      "Time_Start": 592.6800000000001,
      "Time_End": 598.02,
      "Text": " explore all the folder of the computer and or check the network and host performance"
    },
    {
      "Time_Start": 598.8199999999999,
      "Time_End": 604.62,
      "Text": " characteristics. Uh they run reconnaissance through program uh or script uh and or they can"
    },
    {
      "Time_Start": 604.62,
      "Time_End": 608.86,
      "Text": " also run this reconnaissance just by clicking their way through like opening the task"
    },
    {
      "Time_Start": 608.86,
      "Time_End": 613.86,
      "Text": " manager, looking at the CPU performance and then uh googling our IP address. Uh and they do"
    },
    {
      "Time_Start": 615.4,
      "Time_End": 620.64,
      "Text": " not perform any other meaningful action uh on on our sessions. So they just run"
    },
    {
      "Time_Start": 620.64,
      "Time_End": 625.64,
      "Text": " reconnaissance. Uh so we uh we hypothesize that uh they might be evaluating the system for"
    },
    {
      "Time_Start": 626.3,
      "Time_End": 631.3,
      "Text": " other to use or to use later. I'll show you a a ranger in action. So here yeah it started."
    },
    {
      "Time_Start": 635.4399999999999,
      "Time_End": 640.4399999999999,
      "Text": " So here it will paste 2 binaries on the desktop to run. So those are uh read script that are"
    },
    {
      "Time_Start": 643.18,
      "Time_End": 649.56,
      "Text": " ready to just grab the information of the system. So he runs the first one and then run the"
    },
    {
      "Time_Start": 649.56,
      "Time_End": 654.56,
      "Text": " second one. He copies the information of the computer and then he runs the second one."
    },
    {
      "Time_Start": 655.6999999999999,
      "Time_End": 660.6999999999999,
      "Text": " He copies the information of the computer and we can and we steal that on uh to the clipboard."
    },
    {
      "Time_Start": 663.24,
      "Time_End": 668.24,
      "Text": " And then uh before leaving he just he will erase all his traces and leave. So this is a a"
    },
    {
      "Time_Start": 670.98,
      "Time_End": 675.98,
      "Text": " typical ranger in action. The second character is the thief. The thieves will monetize their"
    },
    {
      "Time_Start": 679.8199999999999,
      "Time_End": 685.06,
      "Text": " uh the RDP access in many different ways. Uh so they will the tool they use will be like"
    },
    {
      "Time_Start": 685.08,
      "Time_End": 691.4200000000001,
      "Text": " proxyware, monetizing browsers, uh monetizing browsers that participate in the pay to serve"
    },
    {
      "Time_Start": 691.4200000000001,
      "Time_End": 697.32,
      "Text": " schemes. Uh after that there's a crypto miner, android emulator to do fraud. So all kind of"
    },
    {
      "Time_Start": 697.32,
      "Time_End": 703.7600000000001,
      "Text": " different things to monetize the access. Um and and I'll show you 2 examples. So the first"
    },
    {
      "Time_Start": 703.7600000000001,
      "Time_End": 710.5000000000001,
      "Text": " one here uh the person is using trough monetizer which is a residential proxy enabler. Will"
    },
    {
      "Time_Start": 710.52,
      "Time_End": 717.68,
      "Text": " connect to uh to his account uh and and then you can see. So they use it to pass third party"
    },
    {
      "Time_Start": 717.68,
      "Time_End": 722.26,
      "Text": " traffic through our system and then get paid for doing so. So you see the amount of money"
    },
    {
      "Time_Start": 722.26,
      "Time_End": 729.1,
      "Text": " that he is doing with our session which is not a lot by the way. The second uh example of a"
    },
    {
      "Time_Start": 729.1,
      "Time_End": 734.3,
      "Text": " thief in action will be uh this one that use a crypto miner called xmrig. So he launched a"
    },
    {
      "Time_Start": 734.3000000000001,
      "Time_End": 739.32,
      "Text": " crypto miner. Uh connect to his wallet with his creds and everything. He choose bitcoin gold"
    },
    {
      "Time_Start": 742.1800000000001,
      "Time_End": 746.98,
      "Text": " to mine. And uh at the bottom you see the local hash rate and the effective hash rate uh that"
    },
    {
      "Time_Start": 746.98,
      "Time_End": 752.0000000000001,
      "Text": " goes on uh during during that. He can conduct any other activity uh at the same time. And uh"
    },
    {
      "Time_Start": 756.0000000000001,
      "Time_End": 761.0000000000001,
      "Text": " and it will. Uh so the third per- the third character is the barbarian. The barbarian will"
    },
    {
      "Time_Start": 765.3000000000001,
      "Time_End": 771.2400000000001,
      "Text": " you'll understand by by the name of the character that the they use a large area of tools to"
    },
    {
      "Time_Start": 771.2400000000001,
      "Time_End": 776.8800000000001,
      "Text": " brute force their way into more computers. They compromise other system by using working by"
    },
    {
      "Time_Start": 776.8800000000001,
      "Time_End": 781.8800000000001,
      "Text": " by yeah working with uh with IP addresses, username, list of of passwords and uh and here is"
    },
    {
      "Time_Start": 784.0200000000001,
      "Time_End": 789.0200000000001,
      "Text": " the barbarian in action. So here um the person is using mass scan uh GUI more particularly"
    },
    {
      "Time_Start": 789.38,
      "Time_End": 794.38,
      "Text": " so there's an interface uh easier to to use. Uh here they enter the RDP the yeah the RDP"
    },
    {
      "Time_Start": 802.66,
      "Time_End": 807.66,
      "Text": " port 3389 and choose the country that they want to uh to target. In this case Vietnam. Launch"
    },
    {
      "Time_Start": 808.52,
      "Time_End": 813.52,
      "Text": " the attack and it's as easy as it. The fourth character is uh the wizard. The wizard is my"
    },
    {
      "Time_Start": 827.8399999999999,
      "Time_End": 833.88,
      "Text": " favorite one because they are the most skillful one. They use RDP access as a portal to"
    },
    {
      "Time_Start": 833.9,
      "Time_End": 838.88,
      "Text": " connect to other computers so they secure their identity their identity via a jump over"
    },
    {
      "Time_Start": 838.88,
      "Time_End": 844.24,
      "Text": " compromised host. Uh so they are the one who show the highest level of skills and I'll show"
    },
    {
      "Time_Start": 844.24,
      "Time_End": 850.62,
      "Text": " you in this session right now. So they are on our RDP session and then they connect to"
    },
    {
      "Time_Start": 850.62,
      "Time_End": 855.62,
      "Text": " another session through our system. Uh so you see that in our session uh the wizard is"
    },
    {
      "Time_Start": 856.28,
      "Time_End": 861.28,
      "Text": " file less. They do not require to install any code or script uh the within the target"
    },
    {
      "Time_Start": 864.92,
      "Time_End": 870.42,
      "Text": " system. Uh instead the the attacker use uses tools that are already present in the"
    },
    {
      "Time_Start": 870.42,
      "Time_End": 876.8,
      "Text": " environment and in this case it's RDP. Uh so you see that there's a session uh open here"
    },
    {
      "Time_Start": 876.8,
      "Time_End": 881.8,
      "Text": " and on which NL Brute is is uh open so they launch an attack using uh a brute force uh"
    },
    {
      "Time_Start": 882.5200000000001,
      "Time_End": 887.5200000000001,
      "Text": " tool and here we see that they use a ghost user. We will come back to this uh so it's"
    },
    {
      "Time_Start": 890.36,
      "Time_End": 897.0000000000001,
      "Text": " connected to a tool they use to uh to enter other uh RDP session. So uh and we will talk"
    },
    {
      "Time_Start": 897.0000000000001,
      "Time_End": 902.0000000000001,
      "Text": " about it in a second. Uh so he is monitoring his NL Brute activities on two other uh"
    },
    {
      "Time_Start": 903.94,
      "Time_End": 909.0400000000001,
      "Text": " priority P session true true two other priority P session. So this makes it far more"
    },
    {
      "Time_Start": 909.0799999999999,
      "Time_End": 913.8199999999999,
      "Text": " difficult to detect especially if the if the organization are leveraging traditional"
    },
    {
      "Time_Start": 913.8199999999999,
      "Time_End": 919.86,
      "Text": " security tools that will search for known malware script or file. Uh they can stay there"
    },
    {
      "Time_Start": 919.86,
      "Time_End": 926.64,
      "Text": " forever before being flagged basically and they leave no artifacts behind. And the last"
    },
    {
      "Time_Start": 926.64,
      "Time_End": 932.14,
      "Text": " character uh I said that the wizard was my favorite my favorite one but this one is my"
    },
    {
      "Time_Start": 932.14,
      "Time_End": 936.88,
      "Text": " favorite one. So the bard. The bard in Dungeon and Dragon I don't want to start a debate"
    },
    {
      "Time_Start": 936.88,
      "Time_End": 942.12,
      "Text": " here but in Dungeon and Dragon it's sometimes considered as the small contributor or the"
    },
    {
      "Time_Start": 942.12,
      "Time_End": 947.92,
      "Text": " annoying team player. So here uh in this case there uh the bard has no apparent hacking"
    },
    {
      "Time_Start": 947.92,
      "Time_End": 952.9399999999999,
      "Text": " skills. So they will use our system to uh make basic Google search uh to watch porn and to"
    },
    {
      "Time_Start": 956.0,
      "Time_End": 962.58,
      "Text": " download movies etc. So we think that they might have bought bought their access uh to"
    },
    {
      "Time_Start": 962.58,
      "Time_End": 968.0200000000001,
      "Text": " someone else that uh compromised the computer for them. Um and just for the laugh I need to"
    },
    {
      "Time_Start": 968.0200000000001,
      "Time_End": 975.0200000000001,
      "Text": " show you a bard uh a bard in action. So here uh we see basic Google search about the"
    },
    {
      "Time_Start": 975.0200000000001,
      "Time_End": 980.0200000000001,
      "Text": " strongest virus ever. And he will you know uh look for information about that, read a bit uh"
    },
    {
      "Time_Start": 986.1,
      "Time_End": 991.2,
      "Text": " on that. I just translate the what is going on on this page. Basically just information"
    },
    {
      "Time_Start": 991.22,
      "Time_End": 996.22,
      "Text": " about uh very uh the strongest virus. Here another virus script. He looks around but like it"
    },
    {
      "Time_Start": 1001.6,
      "Time_End": 1006.6,
      "Text": " doesn't it doesn't last very long. He abandon right away and go watch porn. So there's a"
    },
    {
      "Time_Start": 1009.1800000000001,
      "Time_End": 1014.1800000000001,
      "Text": " couple of research uh about porn so porn dot com, sex dot com, sex dot org. He's trying"
    },
    {
      "Time_Start": 1014.2,
      "Time_End": 1019.2,
      "Text": " really hard. Iranian porn. And then we can see the beginner level of porn consuming uh as he"
    },
    {
      "Time_Start": 1025.0800000000002,
      "Time_End": 1030.0800000000002,
      "Text": " is looking for porn on YouTube. He even types porn hub so he knows about it but it like you know,"
    },
    {
      "Time_Start": 1034.1200000000001,
      "Time_End": 1039.1200000000001,
      "Text": " it's hard. It's hard. Why porn? So there's some country with internet censorship uh and"
    },
    {
      "Time_Start": 1039.5000000000002,
      "Time_End": 1044.5000000000002,
      "Text": " this censorship include ban on pornography. So uh so they might and and also they often"
    },
    {
      "Time_Start": 1050.18,
      "Time_End": 1055.18,
      "Text": " uh block for VPNs and and other uh other tools. So they might use our RDP access just to uh go"
    },
    {
      "Time_Start": 1057.5800000000002,
      "Time_End": 1062.5800000000002,
      "Text": " around those uh those ban. So if we look at the the different the yeah the the number of RDP"
    },
    {
      "Time_Start": 1062.98,
      "Time_End": 1069.3799999999999,
      "Text": " session associated with each profile, this is what we get. So you see a lot of barbarian, a"
    },
    {
      "Time_Start": 1069.3799999999999,
      "Time_End": 1076.1599999999999,
      "Text": " lot of rangers uh and after that um thieves, bard, wizard. Uh and the the profile are not"
    },
    {
      "Time_Start": 1076.1599999999999,
      "Time_End": 1081.76,
      "Text": " mutually exclusive. Uh they can't like they can't perform they they might intertwine. This is"
    },
    {
      "Time_Start": 1081.76,
      "Time_End": 1086.76,
      "Text": " what we get when uh we observe the this mix. So a ranger might also uh uh do barbarian uh"
    },
    {
      "Time_Start": 1087.46,
      "Time_End": 1092.46,
      "Text": " actions. Uh so yeah. What about the weaponry Olivier? Yes, yes, yes. So we did build some uh"
    },
    {
      "Time_Start": 1099.44,
      "Time_End": 1104.94,
      "Text": " kind of a character sheets for the weapons cause I'm a geek and a Dungeon and Dragon fans. So"
    },
    {
      "Time_Start": 1104.94,
      "Time_End": 1109.94,
      "Text": " here we go. The uh the XDIDZIC RDP patch is a a ranger tool. So it is what we saw earlier"
    },
    {
      "Time_Start": 1110.76,
      "Time_End": 1115.76,
      "Text": " that created the ghost user account. So it's basically a turnkey GUI tool that creates an"
    },
    {
      "Time_Start": 1119.98,
      "Time_End": 1126.98,
      "Text": " admin account and allow you to patch RDP. Patch RDP in a specific way. In a sense that it"
    },
    {
      "Time_Start": 1126.98,
      "Time_End": 1132.8200000000002,
      "Text": " will allow desktop versions of the operating system to have concurrent sessions. Which is"
    },
    {
      "Time_Start": 1132.8200000000002,
      "Time_End": 1138.26,
      "Text": " not allowed usually. You need like a specific license or you need a a server type system. But"
    },
    {
      "Time_Start": 1138.28,
      "Time_End": 1145.08,
      "Text": " this will enable that. Meaning that the computer can be used while it's used legitimately. And"
    },
    {
      "Time_Start": 1145.08,
      "Time_End": 1149.12,
      "Text": " it and the patch is actually very well done. It's a different binary that is uh embedded in"
    },
    {
      "Time_Start": 1149.12,
      "Time_End": 1154.3,
      "Text": " the XDIDZIC tool. And it survives uh OS updates and stuff like that. Like it's a really"
    },
    {
      "Time_Start": 1154.3,
      "Time_End": 1159.3,
      "Text": " clever uh tool. Uh so we see this as a persistent mechanism. Has a high detection ratio on VT"
    },
    {
      "Time_Start": 1161.74,
      "Time_End": 1168.08,
      "Text": " cause it's super packed. Um uh but the XDIDZIC group was taken down but the the tools still"
    },
    {
      "Time_Start": 1168.1,
      "Time_End": 1173.96,
      "Text": " exist and are still available. Next up we're gonna talk about NLBrute. So she uh uh"
    },
    {
      "Time_Start": 1173.96,
      "Time_End": 1179.84,
      "Text": " Andrea mentioned it earlier. NLBrute is the the RDP brute forcing tool. It is a super"
    },
    {
      "Time_Start": 1179.84,
      "Time_End": 1185.54,
      "Text": " effective one. If we have pen testers or red teamers here, this stuff is better than you know"
    },
    {
      "Time_Start": 1185.54,
      "Time_End": 1190.54,
      "Text": " Hydra or uh Net and Map. But I wouldn't run it on a system uh besides a VM. Again, super"
    },
    {
      "Time_Start": 1190.98,
      "Time_End": 1197.92,
      "Text": " packed. The versions that you can download online are are like cracked and or probably"
    },
    {
      "Time_Start": 1197.92,
      "Time_End": 1202.92,
      "Text": " backdoored. Uh it has a relatively high uh VT detection ratio. However, uh the the some"
    },
    {
      "Time_Start": 1206.2,
      "Time_End": 1212.8,
      "Text": " of the samples that I've seen are undetected by CrowdStrike, ESET, Fsecure, Kaspersky for"
    },
    {
      "Time_Start": 1212.8,
      "Time_End": 1217.8,
      "Text": " instance. So detection ratio is still high. It is like 15 to 62. But the 15 are like all AI"
    },
    {
      "Time_Start": 1220.94,
      "Time_End": 1226.1399999999999,
      "Text": " stuff that probably has a lot of false positive. Um the guy who wrote it got arrested and"
    },
    {
      "Time_Start": 1226.1399999999999,
      "Time_End": 1231.82,
      "Text": " extradited to the US uh early February. So we will probably not see updates for a short"
    },
    {
      "Time_Start": 1231.82,
      "Time_End": 1236.82,
      "Text": " while. So uh the next up is Masscan GUI, a tool used by barbarians. Uh it is like a you"
    },
    {
      "Time_Start": 1241.52,
      "Time_End": 1248.46,
      "Text": " know wrapper around um Robert Graham's Masscan. Very effective uh internet scanner. Uh but"
    },
    {
      "Time_Start": 1248.46,
      "Time_End": 1253.6000000000001,
      "Text": " it dumbs it down so that anyone can use it. And uh you can choose a country. So it has"
    },
    {
      "Time_Start": 1253.6000000000001,
      "Time_End": 1258.7,
      "Text": " like pre-filled configuration in it if you want to target a specific country. What's"
    },
    {
      "Time_Start": 1258.7,
      "Time_End": 1262.6000000000001,
      "Text": " something that I didn't realize cause we have a lot of instinct about attackers right?"
    },
    {
      "Time_Start": 1262.6000000000001,
      "Time_End": 1267.74,
      "Text": " Because we do that we research you know for threats and we read a lot of blogs. But one"
    },
    {
      "Time_Start": 1267.74,
      "Time_End": 1272.98,
      "Text": " thing that surprised me is the pivoting capabilities of the barbarians. So when they"
    },
    {
      "Time_Start": 1272.98,
      "Time_End": 1277.98,
      "Text": " compromise a specific system they go after nearby networks or the whole internet. But for"
    },
    {
      "Time_Start": 1280.58,
      "Time_End": 1285.58,
      "Text": " instance our stuff was in AWS. And so we feel that when they realize it's in the AWS they're"
    },
    {
      "Time_Start": 1288.32,
      "Time_End": 1294.46,
      "Text": " happy because they're like oh maybe some organization whitelisted AWS ranges. And so they"
    },
    {
      "Time_Start": 1294.46,
      "Time_End": 1300.04,
      "Text": " scan the whole internet like super triggered. So we think that this is uh some of the stuff"
    },
    {
      "Time_Start": 1300.06,
      "Time_End": 1305.8,
      "Text": " that they do and it allows them to reach stuff that wasn't reachable before or via other"
    },
    {
      "Time_Start": 1305.8,
      "Time_End": 1312.28,
      "Text": " compromised infrastructure. So the the the a tool like Masscan GUI kinda is important for"
    },
    {
      "Time_Start": 1312.28,
      "Time_End": 1319.28,
      "Text": " them to penetrate into uh deeper networks and more networks. The next one is a weird one."
    },
    {
      "Time_Start": 1319.28,
      "Time_End": 1324.28,
      "Text": " Silver Bullet. It's a burp like web application security tool if you want. But the"
    },
    {
      "Time_Start": 1324.5,
      "Time_End": 1329.5,
      "Text": " comparison with burp fell short really quickly. Uh because it's proxy first. So in burp you"
    },
    {
      "Time_Start": 1333.74,
      "Time_End": 1338.82,
      "Text": " use one proxy and then you you know you do your tests and stuff like that. But this is like"
    },
    {
      "Time_Start": 1338.82,
      "Time_End": 1345.82,
      "Text": " give me a hundred of proxies. So clearly this is about credential stuffing uh uh uh you"
    },
    {
      "Time_Start": 1345.82,
      "Time_End": 1352.06,
      "Text": " know popular services like PayPal, Gmail and and um Netflix or whatever. Uh it comes with"
    },
    {
      "Time_Start": 1352.08,
      "Time_End": 1359.1799999999998,
      "Text": " pre-made configuration kits, a whole scripting language. Uh it is uh super talked about on uh"
    },
    {
      "Time_Start": 1359.1799999999998,
      "Time_End": 1366.12,
      "Text": " Telegram. There are channels dedicated to share configurations. So it's a very um uh big"
    },
    {
      "Time_Start": 1366.12,
      "Time_End": 1372.22,
      "Text": " tool for people who compromises online accounts. Clearly little very little legitimate use."
    },
    {
      "Time_Start": 1372.22,
      "Time_End": 1379.0,
      "Text": " Um but but it's distributed on GitHub. And they uh talk about it uh openly on GitHub and this"
    },
    {
      "Time_Start": 1379.04,
      "Time_End": 1384.48,
      "Text": " is from the the GitHub page. And they say like this is for scraping, parsing data, automated"
    },
    {
      "Time_Start": 1384.48,
      "Time_End": 1390.42,
      "Text": " pen testing, user selenium or whatever. But look at this. Like if we check the tabs that are"
    },
    {
      "Time_Start": 1390.42,
      "Time_End": 1395.32,
      "Text": " in there, it's like top level tab proxies where you provide hundreds of proxies that you"
    },
    {
      "Time_Start": 1395.32,
      "Time_End": 1400.32,
      "Text": " want to use. Second tab word lists. I mean what pen test tool would expose word list as a"
    },
    {
      "Time_Start": 1400.9199999999998,
      "Time_End": 1405.9199999999998,
      "Text": " first class component in your in your tool right? And then you have like captures uh bypass"
    },
    {
      "Time_Start": 1409.8,
      "Time_End": 1415.5,
      "Text": " you have uh OCR so character recognition. You have cloud flare bypass built into the"
    },
    {
      "Time_Start": 1415.5,
      "Time_End": 1420.5,
      "Text": " configurations. So clearly again little legitimate use or or you know it's shady as uh really"
    },
    {
      "Time_Start": 1423.1399999999999,
      "Time_End": 1428.1399999999999,
      "Text": " shady. Now on their on their website on their website they uh they even like drop the"
    },
    {
      "Time_Start": 1429.0,
      "Time_End": 1434.0,
      "Text": " language about automated pen test. They they basically say like it's illegal but they"
    },
    {
      "Time_Start": 1436.74,
      "Time_End": 1442.22,
      "Text": " talk about credential stuffing. It's like oh yeah we're a web pen testing tool. Pfft no we're a"
    },
    {
      "Time_Start": 1442.22,
      "Time_End": 1447.6200000000001,
      "Text": " credential stuffing tool right? This is making it very clear. But what I like the most about"
    },
    {
      "Time_Start": 1447.6200000000001,
      "Time_End": 1452.6200000000001,
      "Text": " discla- disclaimers like this is of course you said for research only this is gonna stop"
    },
    {
      "Time_Start": 1453.0800000000002,
      "Time_End": 1458.0800000000002,
      "Text": " cybercrime. Fuck them. Oh sorry about that. So moving on uh to the next thing um we have the"
    },
    {
      "Time_Start": 1464.3200000000002,
      "Time_End": 1469.6000000000001,
      "Text": " Windows Defender remove script. So a lot of Defender bypass technology was used and it's"
    },
    {
      "Time_Start": 1469.6000000000001,
      "Time_End": 1475.8400000000001,
      "Text": " interesting to describe especially this one because it has a zero virus total detection rate."
    },
    {
      "Time_Start": 1475.8400000000001,
      "Time_End": 1480.8400000000001,
      "Text": " Um but so it's a wrapper around install WIM tweaks which is considered a legitimate"
    },
    {
      "Time_Start": 1483.14,
      "Time_End": 1489.2800000000002,
      "Text": " uh package. It allows you to change the uh Microsoft's OS can be customized by uh auto"
    },
    {
      "Time_Start": 1489.2800000000002,
      "Time_End": 1494.2800000000002,
      "Text": " unattend stuff right? And it allows you to alter the OS packages like you would do for a POS or"
    },
    {
      "Time_Start": 1496.6200000000001,
      "Time_End": 1501.6200000000001,
      "Text": " for an ATM for instance if you are stupid enough to use Windows for an ATM. But um uh it it"
    },
    {
      "Time_Start": 1503.7600000000002,
      "Time_End": 1508.7600000000002,
      "Text": " unhides the OS packages that are protected. Allows you to remove Defender the package and"
    },
    {
      "Time_Start": 1509.08,
      "Time_End": 1514.08,
      "Text": " then it will repack the the Windows packages so Windows still works afterwards. But so this"
    },
    {
      "Time_Start": 1517.28,
      "Time_End": 1522.28,
      "Text": " is pretty crazy cause it it is basically legitimate software uh however I wanna say it doesn't"
    },
    {
      "Time_Start": 1524.86,
      "Time_End": 1531.26,
      "Text": " work on Windows 11 even with tamper protection removed. So we've seen this work on Windows"
    },
    {
      "Time_Start": 1531.26,
      "Time_End": 1536.26,
      "Text": " server 2016. Haven't tested more than that cause uh I was you know busy creating nice"
    },
    {
      "Time_Start": 1536.64,
      "Time_End": 1541.64,
      "Text": " sheets, cards for the for the the attack tools. But so it it it could like you know become"
    },
    {
      "Time_Start": 1546.68,
      "Time_End": 1551.92,
      "Text": " obsolete with time but it is effective today. Another one that I wanted to talk about is"
    },
    {
      "Time_Start": 1551.92,
      "Time_End": 1556.92,
      "Text": " decontrol or Defender control and this one uh is uh um shared online as a freeware from a"
    },
    {
      "Time_Start": 1559.66,
      "Time_End": 1565.9,
      "Text": " super shady site. It is super packed. Uh has a high VT ratio and I think they're not gonna"
    },
    {
      "Time_Start": 1565.9,
      "Time_End": 1572.98,
      "Text": " update it. Uh but so um this tool is used by the luckiest uh Russian ransomware group. Like we"
    },
    {
      "Time_Start": 1572.98,
      "Time_End": 1578.18,
      "Text": " know it's linked through them. So we know that it is used by ransomware groups out there. It"
    },
    {
      "Time_Start": 1578.18,
      "Time_End": 1583.42,
      "Text": " it has been so it disables Defender and unload the driver so it's it's effective. Doesn't"
    },
    {
      "Time_Start": 1583.42,
      "Time_End": 1588.5,
      "Text": " require reboot whereas the other tool does require reboot. But uh it's been super well"
    },
    {
      "Time_Start": 1588.5,
      "Time_End": 1593.8400000000001,
      "Text": " documented by the DFIR report so if you guys wanna detect this uh I think they even provide"
    },
    {
      "Time_Start": 1593.8400000000001,
      "Time_End": 1599.5400000000002,
      "Text": " Sigma rules and stuff like that so I would advise you check that. And last but not least is"
    },
    {
      "Time_Start": 1599.5400000000002,
      "Time_End": 1604.5600000000002,
      "Text": " Gamadine Mailer. So this is a turnkey noob friendly phishing tool so it can be used for spear"
    },
    {
      "Time_Start": 1609.1200000000001,
      "Time_End": 1614.7200000000003,
      "Text": " phishing but also spam. So it does their whole spectrum of email flaws, have a templating"
    },
    {
      "Time_Start": 1614.7200000000003,
      "Time_End": 1619.7400000000002,
      "Text": " engine and all that stuff. Um it we yeah. It is basically making it possible for people to"
    },
    {
      "Time_Start": 1624.2,
      "Time_End": 1631.7,
      "Text": " uh to send you know good emails and and what not but we we we think that um IP reputation of"
    },
    {
      "Time_Start": 1631.7,
      "Time_End": 1637.2800000000002,
      "Text": " compromised system is probably what attracts people to deploy tools like this and uh"
    },
    {
      "Time_Start": 1637.2800000000002,
      "Time_End": 1642.2800000000002,
      "Text": " honeypots so that they are able to send their spam. Um uh it is uh not detected by like"
    },
    {
      "Time_Start": 1644.7800000000002,
      "Time_End": 1651.1200000000001,
      "Text": " CrowdStrike, ESET, F-Secure, Kaspersky, Microsoft. So it has a like a low detection ratio"
    },
    {
      "Time_Start": 1651.14,
      "Time_End": 1657.48,
      "Text": " and uh we know it it's not but then again like all of the samples I shared in the IOC I"
    },
    {
      "Time_Start": 1657.48,
      "Time_End": 1662.5800000000002,
      "Text": " provided I uploaded all of them on VT so they will probably the detection ratio will"
    },
    {
      "Time_Start": 1662.5800000000002,
      "Time_End": 1667.5600000000002,
      "Text": " probably increase hopefully. So uh it's gonna we're we're gonna be good we're gonna detect"
    },
    {
      "Time_Start": 1667.5600000000002,
      "Time_End": 1672.5600000000002,
      "Text": " this very soon. There is a lot more tooling and our aim is to document them uh via our"
    },
    {
      "Time_Start": 1673.48,
      "Time_End": 1678.48,
      "Text": " blog and uh as you know some of them don't need documentation but some of them do. Uh and"
    },
    {
      "Time_Start": 1681.4199999999998,
      "Time_End": 1686.4199999999998,
      "Text": " share uh you know hashes and uh Sigma rules for detection. So if we take this list that we"
    },
    {
      "Time_Start": 1688.62,
      "Time_End": 1695.0,
      "Text": " just saw and all the the tools that we present uh and we classify them by objective this is"
    },
    {
      "Time_Start": 1695.0,
      "Time_End": 1700.0,
      "Text": " what we get. So a lot of scanning and attack. Then there's enabler tool that they use all"
    },
    {
      "Time_Start": 1700.04,
      "Time_End": 1704.84,
      "Text": " the time. Monetization, download, communication. By communication I refer uh more"
    },
    {
      "Time_Start": 1704.84,
      "Time_End": 1711.42,
      "Text": " precise precisely to telegram. So they use telegram to communicate but also to transfer"
    },
    {
      "Time_Start": 1711.42,
      "Time_End": 1716.42,
      "Text": " files. We see uh that a lot. So let's go back to our crystal ball. I wanted we wanted to"
    },
    {
      "Time_Start": 1718.7,
      "Time_End": 1724.9,
      "Text": " show you uh and some interesting observation that we saw during the our research. So"
    },
    {
      "Time_Start": 1724.9,
      "Time_End": 1731.0800000000002,
      "Text": " first the attacker might work in team. Okay here we see the person uh downloading NL"
    },
    {
      "Time_Start": 1731.0800000000002,
      "Time_End": 1737.0400000000002,
      "Text": " Brute uh while in the on the clipboard we see appear I'll translate it right now. Why did you"
    },
    {
      "Time_Start": 1737.0400000000002,
      "Time_End": 1742.0600000000002,
      "Text": " delete all application with a broken broken heart? So downloading the tools again they were"
    },
    {
      "Time_Start": 1744.3600000000001,
      "Time_End": 1749.8000000000002,
      "Text": " there on on a session a previous session but then he has to download uh again and then"
    },
    {
      "Time_Start": 1749.8,
      "Time_End": 1756.3799999999999,
      "Text": " communicate with someone else to show his disappointment or her disappointment. After"
    },
    {
      "Time_Start": 1756.3799999999999,
      "Time_End": 1763.12,
      "Text": " that there's some attacker who do not speak English and that might be uh funny sometimes. So"
    },
    {
      "Time_Start": 1763.12,
      "Time_End": 1768.12,
      "Text": " here the person is playing around with some credit card on Google ad and then a pending"
    },
    {
      "Time_Start": 1771.3799999999999,
      "Time_End": 1776.3999999999999,
      "Text": " approval message appears. And the person has no clue what's going on so copies it. Goes"
    },
    {
      "Time_Start": 1776.96,
      "Time_End": 1781.96,
      "Text": " into Google translate. And then even go choose the exact language the person speak. So really"
    },
    {
      "Time_Start": 1786.7800000000002,
      "Time_End": 1791.7800000000002,
      "Text": " you cannot beat this level of attribution. So Arabic here. And there's we have a couple of"
    },
    {
      "Time_Start": 1794.38,
      "Time_End": 1799.5800000000002,
      "Text": " session with person that with people who do not speak English who look like they do not"
    },
    {
      "Time_Start": 1799.5800000000002,
      "Time_End": 1806.1000000000001,
      "Text": " speak English. Uh or at least their their basic language, their principle language. Uh"
    },
    {
      "Time_Start": 1806.42,
      "Time_End": 1812.46,
      "Text": " is not English. And when we uh we analyze those sessions so it's 45 session in which we are"
    },
    {
      "Time_Start": 1812.46,
      "Time_End": 1817.7400000000002,
      "Text": " sure of the attribution of the language which is not all the the data set. But this is what we"
    },
    {
      "Time_Start": 1817.7400000000002,
      "Time_End": 1822.7400000000002,
      "Text": " get. So Arabic first and then Farsi or Persian. Uh Cyrillic, Vietnamese and Chinese. And the"
    },
    {
      "Time_Start": 1826.3200000000002,
      "Time_End": 1831.3200000000002,
      "Text": " last video we wanted to show you is uh how great our tool is uh to collect intelligence. So"
    },
    {
      "Time_Start": 1832.32,
      "Time_End": 1837.32,
      "Text": " here the person is connecting to uh their telegram account. So they will enter their"
    },
    {
      "Time_Start": 1841.72,
      "Time_End": 1846.4199999999998,
      "Text": " their cell phone num- their phone number. Uh obviously they could they could uh use"
    },
    {
      "Time_Start": 1846.4199999999998,
      "Time_End": 1853.1,
      "Text": " burning phone uh right but but here we could uh we when we look at the IP address uh it"
    },
    {
      "Time_Start": 1853.1,
      "Time_End": 1859.8999999999999,
      "Text": " corresponds to Algeria. Uh and then like their password of course that we can still to the"
    },
    {
      "Time_Start": 1859.92,
      "Time_End": 1866.26,
      "Text": " clipboard. And and then once they connect to their telegram we can see all the chat room in"
    },
    {
      "Time_Start": 1866.26,
      "Time_End": 1872.0,
      "Text": " which there's some illegal stuff going on. So to start an investigation that's it's a lot of"
    },
    {
      "Time_Start": 1872.0,
      "Time_End": 1877.0,
      "Text": " information of useful information. What about the end game? Yes. Um uh we're now at the"
    },
    {
      "Time_Start": 1881.14,
      "Time_End": 1886.22,
      "Text": " near the end of the presentation so it's time for experience points of course. And looped"
    },
    {
      "Time_Start": 1886.24,
      "Time_End": 1891.68,
      "Text": " right? But so I'm still gonna spend some time trying to really convey why the the level of"
    },
    {
      "Time_Start": 1891.68,
      "Time_End": 1896.68,
      "Text": " enthusiasm I want you guys to uh leave with around like RDP research and interception. Um so"
    },
    {
      "Time_Start": 1899.22,
      "Time_End": 1905.02,
      "Text": " this is how we deployed our environments. Uh we made uh the Windows machines like the the"
    },
    {
      "Time_Start": 1905.02,
      "Time_End": 1910.8600000000001,
      "Text": " the box in the middle. We made it we we made sure to stream the logs to a message queue as as"
    },
    {
      "Time_Start": 1910.88,
      "Time_End": 1917.38,
      "Text": " quick as we can in order for it to be destroyable. So we we really like don't like to give"
    },
    {
      "Time_Start": 1917.38,
      "Time_End": 1924.46,
      "Text": " free infrastructure to bad guys. So when we have like anything that is you know misused we"
    },
    {
      "Time_Start": 1924.46,
      "Time_End": 1929.16,
      "Text": " will destroy the infrastructure because it's faster to destroy than to investigate. But this"
    },
    {
      "Time_Start": 1929.16,
      "Time_End": 1935.5000000000002,
      "Text": " means that we in order not to lose evidence we needed to have something streaming to our"
    },
    {
      "Time_Start": 1935.54,
      "Time_End": 1941.38,
      "Text": " stuff right? So all open source stuff but like uh streaming logs to RabbitMQ are syncing"
    },
    {
      "Time_Start": 1941.38,
      "Time_End": 1946.38,
      "Text": " binary artifacts to uh object storage. Um and uh then we we are slurping these for uh inside"
    },
    {
      "Time_Start": 1948.78,
      "Time_End": 1955.42,
      "Text": " an elastic where we query it via Jupyter uh R studio as well so some R language code for"
    },
    {
      "Time_Start": 1955.42,
      "Time_End": 1959.7,
      "Text": " like Latin class analysis and stuff like that. And then good old Excel because it's just"
    },
    {
      "Time_Start": 1959.7,
      "Time_End": 1964.94,
      "Text": " fast you know but but after a million records or events Excel just blows up so you need"
    },
    {
      "Time_Start": 1964.94,
      "Time_End": 1969.94,
      "Text": " the Python uh cool kids tools. Um we everything was deployed using Docker compose and"
    },
    {
      "Time_Start": 1972.92,
      "Time_End": 1977.96,
      "Text": " then uh the infrastructure was terraformed and we were recreating like destroying the"
    },
    {
      "Time_Start": 1977.96,
      "Time_End": 1984.9,
      "Text": " honeypots and recreating them so that we get fresh bad guys uh using uh GitLab CICD uh"
    },
    {
      "Time_Start": 1984.9,
      "Time_End": 1989.9,
      "Text": " automation. Now what we talked about today is the rangers right on the left uh they are the"
    },
    {
      "Time_Start": 1990.9,
      "Time_End": 1995.9,
      "Text": " largest group and clearly the ones that we want to go after next right? We're going to"
    },
    {
      "Time_Start": 1998.44,
      "Time_End": 2003.4,
      "Text": " increase the deception that we do and make sure that we understand what they are after"
    },
    {
      "Time_Start": 2003.4,
      "Time_End": 2008.92,
      "Text": " because they're the big group and they open the path to others. Then there's the bard of"
    },
    {
      "Time_Start": 2008.92,
      "Time_End": 2013.92,
      "Text": " questionable technical skills and appetite as Andrean showed you earlier. Um we saw the"
    },
    {
      "Time_Start": 2014.74,
      "Time_End": 2021.48,
      "Text": " thieves. Thieves for me represent what cyber crime is about and this is a take away uh I"
    },
    {
      "Time_Start": 2021.48,
      "Time_End": 2028.76,
      "Text": " think important uh for for for our industry. They are about monetizing everything. They are"
    },
    {
      "Time_Start": 2028.76,
      "Time_End": 2035.16,
      "Text": " not after your organization necessarily. Like most of cyber crime is like that right? Of"
    },
    {
      "Time_Start": 2035.16,
      "Time_End": 2039.5,
      "Text": " course there are spies and state actors and stuff like that but there's a ton of cyber crime"
    },
    {
      "Time_Start": 2039.52,
      "Time_End": 2045.52,
      "Text": " out there that is just opportunistic. Um the wizard are the scariest group in my opinion and"
    },
    {
      "Time_Start": 2045.52,
      "Time_End": 2050.96,
      "Text": " Andrean's opinion uh because they are doing the living of the land stuff. They like like"
    },
    {
      "Time_Start": 2050.96,
      "Time_End": 2057.6,
      "Text": " leave no artifacts uh really are really stealthy um and the barbarians last but not least"
    },
    {
      "Time_Start": 2057.6,
      "Time_End": 2062.08,
      "Text": " they're they just brute force their way around as I was saying earlier like compromising new"
    },
    {
      "Time_Start": 2062.08,
      "Time_End": 2067.08,
      "Text": " uh infrastructure and um and and and it is successful unfortunately. Now uh really"
    },
    {
      "Time_Start": 2069.56,
      "Time_End": 2074.56,
      "Text": " researchers like RDP is right for attacker study. I uh it attracts humans not scripts so it's"
    },
    {
      "Time_Start": 2077.96,
      "Time_End": 2084.96,
      "Text": " super cool to do. Uh for Blue Team like our we have a repository called Malware IOC uh on our"
    },
    {
      "Time_Start": 2084.96,
      "Time_End": 2089.2,
      "Text": " our GitHub. The link is at the end of the slide deck. It's in the slide deck that is shared on"
    },
    {
      "Time_Start": 2089.2,
      "Time_End": 2095.18,
      "Text": " the DEFCON servers already. Uh you can consume the IOCs but we also want you to try to roll"
    },
    {
      "Time_Start": 2095.2599999999998,
      "Time_End": 2099.96,
      "Text": " out your own traps. You can do it externally. You can do it internally. Internally this is"
    },
    {
      "Time_Start": 2099.96,
      "Time_End": 2105.2,
      "Text": " like a low false positive rate alarm system but you may you must make sure that you have the"
    },
    {
      "Time_Start": 2105.2,
      "Time_End": 2110.2,
      "Text": " proper alerting in place. What's cool about the doing that is the the video captures talk so"
    },
    {
      "Time_Start": 2113.64,
      "Time_End": 2119.04,
      "Text": " well to management. This is not a sequence of lugs that you know people don't understand. This"
    },
    {
      "Time_Start": 2119.04,
      "Time_End": 2125.72,
      "Text": " is like he did this he was after that like directly show it in your face the the the"
    },
    {
      "Time_Start": 2125.72,
      "Time_End": 2130.72,
      "Text": " attacker right? So this is why it's powerful. Um for uh law enforcement we want you to go"
    },
    {
      "Time_Start": 2132.86,
      "Time_End": 2137.86,
      "Text": " after the ransomware uh groups. This needs to end right? We are really in a I mean it ransomware"
    },
    {
      "Time_Start": 2140.44,
      "Time_End": 2146.04,
      "Text": " groups are like the exploit kits of the of the 2010 something like that. Like we need to"
    },
    {
      "Time_Start": 2146.04,
      "Time_End": 2152.2799999999997,
      "Text": " fix that problem. And the reason why uh RDP interception is is relevant in that context"
    },
    {
      "Time_Start": 2152.2799999999997,
      "Time_End": 2157.68,
      "Text": " is because when they like they use compromised infrastructure. A lot of RDP compromised"
    },
    {
      "Time_Start": 2157.68,
      "Time_End": 2162.16,
      "Text": " infrastructure. When you look at the metadata like law enforcement would do in lawful"
    },
    {
      "Time_Start": 2162.16,
      "Time_End": 2167.16,
      "Text": " contexts. You will have like SMTP out to Office 365. SMTP out to Google. But what does that"
    },
    {
      "Time_Start": 2170.7599999999998,
      "Time_End": 2175.54,
      "Text": " tell you? You have no victim information. You have nothing right? If you lawfully intercept"
    },
    {
      "Time_Start": 2175.54,
      "Time_End": 2181.54,
      "Text": " the RDP you see them write the emails that they send. You can go after the victims. So it's a"
    },
    {
      "Time_Start": 2181.54,
      "Time_End": 2188.48,
      "Text": " very effective way to to build a case quickly uh in my mind. So like I'm giving this open"
    },
    {
      "Time_Start": 2188.48,
      "Time_End": 2194.12,
      "Text": " source for free so that you can change the world and fix this shit. Um I'm I'm really"
    },
    {
      "Time_Start": 2194.12,
      "Time_End": 2199.12,
      "Text": " passionate about that by the way. Sorry. Thank you. So yeah I guess this leads well into"
    },
    {
      "Time_Start": 2200.12,
      "Time_End": 2206.12,
      "Text": " the if the attacker fear getting caught you know they will slow down and this is what this is"
    },
    {
      "Time_Start": 2210.96,
      "Time_End": 2216.2,
      "Text": " about. It might sound as irresponsible what we're doing but it is not because we're there"
    },
    {
      "Time_Start": 2216.2,
      "Time_End": 2221.2,
      "Text": " for the good game and we're trying to solve the world's problem. Or one of them. So uh one"
    },
    {
      "Time_Start": 2221.7000000000003,
      "Time_End": 2226.7000000000003,
      "Text": " more thing. You know Apple style. Pi RDP is open source and we released uh 3 days ago our"
    },
    {
      "Time_Start": 2230.44,
      "Time_End": 2235.44,
      "Text": " FQ binary parsing tool. So this FQ is like the JQ for binary files. So with this you can you"
    },
    {
      "Time_Start": 2237.84,
      "Time_End": 2243.6200000000003,
      "Text": " know do analysis and scale on captures that you have. Uh so yeah it's out there if you want"
    },
    {
      "Time_Start": 2243.6200000000003,
      "Time_End": 2250.26,
      "Text": " to contribute to it. Uh we we would appreciate it. And with that we are done folks. You've"
    },
    {
      "Time_Start": 2250.78,
      "Time_End": 2253.78,
      "Text": " been a great movement. You've been generous. You've been amazing. Thank you so much."
    },
    {
      "Time_Start": 2253.78,
      "Time_End": 2259.78,
      "Text": " Yeah we have time for questions I think. Do we do we take questions? 5 5 minutes? 5 minutes?"
    },
    {
      "Time_Start": 2269.88,
      "Time_End": 2276.48,
      "Text": " Alright. Yeah so I don't know how questions work but yeah. Do people yell or are they"
    },
    {
      "Time_Start": 2276.48,
      "Time_End": 2282.48,
      "Text": " microphones? So there's a microphone in the back but if you're willing to yell, yell and I'll"
    },
    {
      "Time_Start": 2284.42,
      "Time_End": 2290.42,
      "Text": " repeat the question. The question is how am I getting around Amazon's abuse policies? They I I"
    },
    {
      "Time_Start": 2299.66,
      "Time_End": 2304.66,
      "Text": " told them I'm doing this type of research so all the cloud provider I open a support ticket"
    },
    {
      "Time_Start": 2304.68,
      "Time_End": 2310.68,
      "Text": " which I screenshotted which I printed which I tattooed on me saying I'm going to do this and"
    },
    {
      "Time_Start": 2311.92,
      "Time_End": 2317.92,
      "Text": " Amazon I never got anything from them. Zero. But at the same time if you break prod you you you"
    },
    {
      "Time_Start": 2322.3599999999997,
      "Time_End": 2326.8399999999997,
      "Text": " piss your customers so I understand they're not doing it right? And and and I'm not doing"
    },
    {
      "Time_Start": 2326.8399999999997,
      "Time_End": 2332.24,
      "Text": " hypervisor level we're not doing hypervisor level attacks or whatever it's just RDP. So yeah"
    },
    {
      "Time_Start": 2332.26,
      "Time_End": 2337.1200000000003,
      "Text": " and and it all comes from one IP if you think about it right? But they they're not blocking"
    },
    {
      "Time_Start": 2337.1200000000003,
      "Time_End": 2343.6600000000003,
      "Text": " outbound and uh and yeah so no uh no harm and it's for research and I am affiliated with a"
    },
    {
      "Time_Start": 2343.6600000000003,
      "Time_End": 2348.9,
      "Text": " security organization so maybe if you do this under your own name you could have problems but I"
    },
    {
      "Time_Start": 2348.9,
      "Time_End": 2354.9,
      "Text": " I didn't face any. Good question by the way. Are you working for Amazon? I was censored right"
    },
    {
      "Time_Start": 2355.9,
      "Time_End": 2361.9,
      "Text": " there. I I ask are you working for Amazon? Okay alright. Any other question? Yes. You want to"
    },
    {
      "Time_Start": 2361.9,
      "Time_End": 2367.9,
      "Text": " take that? So the question is how long did we uh did the the collection? For how long? So the"
    },
    {
      "Time_Start": 2367.9,
      "Time_End": 2373.9,
      "Text": " data were collected uh over three years but like the system was not always up so because it"
    },
    {
      "Time_Start": 2373.9,
      "Time_End": 2379.9,
      "Text": " was in development right? So but it's three years of data on and off. Yeah. So the question is"
    },
    {
      "Time_Start": 2404.26,
      "Time_End": 2410.26,
      "Text": " other questions? Yes. So uh he asked for a overview of the FQ tool. So uh you know JQ the it's a"
    },
    {
      "Time_Start": 2419.04,
      "Time_End": 2425.04,
      "Text": " like a a a linterpretifier and a query tool that is using like a CSS selectors for uh JSON stuff."
    },
    {
      "Time_Start": 2426.04,
      "Time_End": 2431.04,
      "Text": " So it's basically the same thing using a very similar language. So for binary files like PE's"
    },
    {
      "Time_Start": 2434.24,
      "Time_End": 2441.34,
      "Text": " or PCAPs or stuff that people provided support, it's really nice. Um so if you've if you've"
    },
    {
      "Time_Start": 2441.34,
      "Time_End": 2447.38,
      "Text": " used zero one zero editor template that their own they have their own language which allows"
    },
    {
      "Time_Start": 2447.38,
      "Time_End": 2454.4,
      "Text": " you to dive into binary files. It's very similar but in a in a scripting way. So like like T"
    },
    {
      "Time_Start": 2454.4,
      "Time_End": 2461.26,
      "Text": " shark is for PCAPs basically. So with this you can say so our when you pass uh RDP capture in"
    },
    {
      "Time_Start": 2461.26,
      "Time_End": 2467.7400000000002,
      "Text": " it, it's see it's seen as an array of events. So these are and they have types. So there is"
    },
    {
      "Time_Start": 2467.7400000000002,
      "Time_End": 2475.7400000000002,
      "Text": " client information, mouse, uh um you know display and stuff like that. So you could say I want the"
    },
    {
      "Time_Start": 2475.7400000000002,
      "Time_End": 2482.6800000000003,
      "Text": " keyboard events if they match this characteristics list list uh them out. And so for this this"
    },
    {
      "Time_Start": 2482.7,
      "Time_End": 2489.54,
      "Text": " is why we could do stuff we could have like uh we we want to find credentials in general. And"
    },
    {
      "Time_Start": 2489.54,
      "Time_End": 2497.04,
      "Text": " then we could provide a list of um of uh restrictions and so we would get out only that. So"
    },
    {
      "Time_Start": 2497.04,
      "Time_End": 2502.98,
      "Text": " if you're doing binary research on any binary stuff at scale like thousands of files and stuff"
    },
    {
      "Time_Start": 2502.98,
      "Time_End": 2508.98,
      "Text": " like that, super interesting. Yes? How big is? How big is? How big is? How big is? How big is?"
    },
    {
      "Time_Start": 2513.66,
      "Time_End": 2521.66,
      "Text": " How big is a file? You want to take it? Okay so cause you saw the large file so we went after"
    },
    {
      "Time_Start": 2521.66,
      "Time_End": 2527.44,
      "Text": " like size first. But so what's interesting is that if you don't do a lot, they're gonna be"
    },
    {
      "Time_Start": 2527.44,
      "Time_End": 2535.44,
      "Text": " small. The the the the window is tiled and then compressed. But if for example you watch porn,"
    },
    {
      "Time_Start": 2535.78,
      "Time_End": 2542.88,
      "Text": " not that I encourage that. I've never done it myself. But uh it is gonna be huge. Because"
    },
    {
      "Time_Start": 2542.88,
      "Time_End": 2547.98,
      "Text": " you're sending a ton of tiles and uh Windows cannot cache any of it. But if you're using"
    },
    {
      "Time_Start": 2547.98,
      "Time_End": 2554.4,
      "Text": " Explorer.exe and like stuff that Windows knows really well and can cache, then they are"
    },
    {
      "Time_Start": 2554.4,
      "Time_End": 2560.7000000000003,
      "Text": " small. At some point she was going after the large one and it was, tell the story. I thought"
    },
    {
      "Time_Start": 2560.7000000000003,
      "Time_End": 2565.0,
      "Text": " that like the large one would be the most interesting one or the longer session and it was"
    },
    {
      "Time_Start": 2565.0,
      "Time_End": 2571.2,
      "Text": " only porn. So I watched like one week of porn. I was like I cannot believe I did a PhD to"
    },
    {
      "Time_Start": 2571.2,
      "Time_End": 2579.2,
      "Text": " watch porn. Porn at work, which I had to clear by to HR by the way. I was like she's gonna watch"
    },
    {
      "Time_Start": 2579.2,
      "Time_End": 2587.22,
      "Text": " porn but it's research. So yeah but the second week of analysis it was way better. Like it's"
    },
    {
      "Time_Start": 2587.22,
      "Time_End": 2592.32,
      "Text": " not uh it really depends what they do on the session but they're not so large files. And I"
    },
    {
      "Time_Start": 2592.38,
      "Time_End": 2598.2200000000003,
      "Text": " said, I also said like if you're not okay with this, we'll find someone else. Like it's not"
    },
    {
      "Time_Start": 2598.2200000000003,
      "Time_End": 2604.2200000000003,
      "Text": " mandatory. Cleared myself out of a problem. Yes? So the question is did people, were people able"
    },
    {
      "Time_Start": 2612.5,
      "Time_End": 2618.0,
      "Text": " to identify that we were a honeypot? What's your feeling about this? Like to realize that it's"
    },
    {
      "Time_Start": 2618.02,
      "Time_End": 2625.52,
      "Text": " fake. Oh so yeah. I there there's not much of them realizing anything because of course they"
    },
    {
      "Time_Start": 2625.52,
      "Time_End": 2629.26,
      "Text": " like the they uh they connect to their own personal emails and things like that so"
    },
    {
      "Time_Start": 2629.26,
      "Time_End": 2636.04,
      "Text": " obviously they do not know. Uh but there was one guy at one point, well guy or girl, at one"
    },
    {
      "Time_Start": 2636.04,
      "Time_End": 2642.44,
      "Text": " point that just uh make a run a little reconnaissance and then uh open the notepad and then"
    },
    {
      "Time_Start": 2642.46,
      "Time_End": 2648.46,
      "Text": " write lol and disconnect. So I was like oh maybe he knows but we we are not sure about that."
    },
    {
      "Time_Start": 2651.7000000000003,
      "Time_End": 2657.7000000000003,
      "Text": " Yeah we're done. Thank you folks. Thank you. It was nice. You've been super generous."
    }
  ]
}