{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n All right. Hello. Welcome to track the planet. Today we're going to be talking a little bit"
    },
    {
      "Time_Start": 7.44,
      "Time_End": 16.04,
      "Text": " about user enumeration in Azure. And I hope to demonstrate to you today a little bit about"
    },
    {
      "Time_Start": 16.04,
      "Time_End": 20.86,
      "Text": " why user enumeration is a vulnerability and why it should be taken seriously."
    },
    {
      "Time_Start": 20.86,
      "Time_End": 26.32,
      "Text": " So with that, a little bit about me. I'm Nick Skeak. I'm over at TrustedSec, but this research"
    },
    {
      "Time_Start": 26.32,
      "Time_End": 33.12,
      "Text": " is my own. This talk is about user enumeration. And there are no zero days being announced"
    },
    {
      "Time_Start": 33.12,
      "Time_End": 39.04,
      "Text": " here. There's nothing really like no hotness really except for some really just taking"
    },
    {
      "Time_Start": 39.04,
      "Time_End": 42.620000000000005,
      "Text": " advantage of things that are already existing. Microsoft knows about all of this. There's"
    },
    {
      "Time_Start": 42.620000000000005,
      "Time_End": 49.56,
      "Text": " nothing new being announced that's going to be a surprise to them. Well, maybe."
    },
    {
      "Time_Start": 49.56,
      "Time_End": 54.24,
      "Text": " So first let's really just talk about user enumeration and why it matters. So what is"
    },
    {
      "Time_Start": 54.24,
      "Time_End": 60.160000000000004,
      "Text": " it? User enumeration is the ability to determine if a user is valid on a system. There's various"
    },
    {
      "Time_Start": 60.160000000000004,
      "Time_End": 65.36,
      "Text": " ways of doing it, especially in Azure. But some examples here you can see verbose responses"
    },
    {
      "Time_Start": 65.36,
      "Time_End": 71.0,
      "Text": " just saying if the user name is invalid or not. There's time based ones. Or you might"
    },
    {
      "Time_Start": 71.0,
      "Time_End": 76.48,
      "Text": " do one that's web based. Maybe it's a 404 if it doesn't exist and a 302 or a 401 if"
    },
    {
      "Time_Start": 76.48,
      "Time_End": 81.12,
      "Text": " it does exist. So there's various ways of doing this. And it is a security flaw. We"
    },
    {
      "Time_Start": 81.12,
      "Time_End": 85.4,
      "Text": " use it all the time in pen testing. It enables all of these different attacks, primarily"
    },
    {
      "Time_Start": 85.4,
      "Time_End": 91.08000000000001,
      "Text": " password sprays, phishing, and then the occasional targeted RCE that can affect users if you"
    },
    {
      "Time_Start": 91.08000000000001,
      "Time_End": 95.52000000000001,
      "Text": " have their email address. It's an unnecessary feature. It doesn't need to be here. It's"
    },
    {
      "Time_Start": 95.52000000000001,
      "Time_End": 101.96000000000001,
      "Text": " purely cosmetic. And then it also allows the identification of targets. Right? So we often"
    },
    {
      "Time_Start": 101.96000000000001,
      "Time_End": 108.96000000000001,
      "Text": " use first dot last name. We use our identities in our email addresses. So when that's possible,"
    },
    {
      "Time_Start": 108.96000000000001,
      "Time_End": 113.64000000000001,
      "Text": " it's possible then to not just identify a user name, like a numeric user name, but when"
    },
    {
      "Time_Start": 113.64000000000001,
      "Time_End": 118.84,
      "Text": " it's John Smith, you know that person's identity. You can find them. So this is a dangerous"
    },
    {
      "Time_Start": 118.84,
      "Time_End": 124.2,
      "Text": " thing because it allows all of these different attacks to happen. Especially with password"
    },
    {
      "Time_Start": 124.2,
      "Time_End": 128.64000000000001,
      "Text": " sprays. I just want to mention on this real quick. It is enormous. If you are on a pen"
    },
    {
      "Time_Start": 128.64000000000001,
      "Time_End": 132.76000000000002,
      "Text": " test and you can't do user enumeration, you're going to have a bad time. If you're looking"
    },
    {
      "Time_Start": 132.76000000000002,
      "Time_End": 137.92000000000002,
      "Text": " at like for instance J Smith format, if you're using census data from 2010, that's 4.2 million"
    },
    {
      "Time_Start": 137.92000000000002,
      "Time_End": 143.84,
      "Text": " lines. If you can reduce that to 2,000 lines or less, if you can find just the valid users,"
    },
    {
      "Time_Start": 143.84,
      "Time_End": 148.12,
      "Text": " now all of a sudden you're not wasting a day doing password sprays. You can rotate every"
    },
    {
      "Time_Start": 148.12,
      "Time_End": 153.76000000000002,
      "Text": " hour or as often as you can without setting their lockout off. So it's huge for that."
    },
    {
      "Time_Start": 153.76000000000002,
      "Time_End": 157.68,
      "Text": " It wouldn't really be possible if it wasn't for user enumeration. It would be not worth"
    },
    {
      "Time_Start": 157.68,
      "Time_End": 163.12,
      "Text": " the time. And often if you've ever dumped a domain controller, I'm sure that you know"
    },
    {
      "Time_Start": 163.12,
      "Time_End": 167.52,
      "Text": " that there's always one or two bad passwords in there. I can count on one hand the number"
    },
    {
      "Time_Start": 167.52,
      "Time_End": 171.8,
      "Text": " of times that I've dumped a DC and not found anything that I was like, oh, yeah, that's"
    },
    {
      "Time_Start": 171.8,
      "Time_End": 176.8,
      "Text": " yeah. So instead of thinking about it like you're trying to guess the password when you're"
    },
    {
      "Time_Start": 176.8,
      "Time_End": 180.28,
      "Text": " doing password sprays, assume that there's going to be one out of those hundred top passwords"
    },
    {
      "Time_Start": 180.28,
      "Time_End": 184.8,
      "Text": " in there. Instead focus on finding the users. Because if you can get complete enumeration,"
    },
    {
      "Time_Start": 184.8,
      "Time_End": 188.68,
      "Text": " you can almost always find a weak password. So think about it that way instead of thinking"
    },
    {
      "Time_Start": 188.68,
      "Time_End": 192.68,
      "Text": " about it as trying to find the password. You're trying to find the user with that weak password"
    },
    {
      "Time_Start": 192.72,
      "Time_End": 199.72,
      "Text": " that we assume exists somewhere. So it really matters in Azure because everybody uses Azure."
    },
    {
      "Time_Start": 201.56,
      "Time_End": 207.56,
      "Text": " Not everybody, but nearly. So in the Fortune 500, for instance, 99% have Azure tenants,"
    },
    {
      "Time_Start": 207.56,
      "Time_End": 211.8,
      "Text": " whether they use them or not. They might have just registered it. But out of those, 96%"
    },
    {
      "Time_Start": 211.8,
      "Time_End": 216.96,
      "Text": " had SharePoint enabled and I've identified valid user names via OneDrive in 89% of the"
    },
    {
      "Time_Start": 216.96,
      "Time_End": 222.88,
      "Text": " Fortune 500. So they are being used. It is widespread. If you look at state government"
    },
    {
      "Time_Start": 222.88,
      "Time_End": 227.68,
      "Text": " adoption, every state government uses Azure. This is so widespread. Everyone is affected"
    },
    {
      "Time_Start": 227.68,
      "Time_End": 232.28,
      "Text": " by things that come up in Azure, especially with the user enumeration. There are federal"
    },
    {
      "Time_Start": 232.28,
      "Time_End": 237.96,
      "Text": " government agencies that use Azure. Everything has the same vulnerability built in there"
    },
    {
      "Time_Start": 237.96,
      "Time_End": 244.16,
      "Text": " with OneDrive and other user enumeration methods. So who might not want to be enumerated, right?"
    },
    {
      "Time_Start": 244.16,
      "Time_End": 248.96,
      "Text": " Who might want to stay kind of hidden from view? There are a number of areas where you"
    },
    {
      "Time_Start": 248.96,
      "Time_End": 253.56,
      "Text": " think maybe we shouldn't allow them to make lists of potential cyber targets, right? People"
    },
    {
      "Time_Start": 253.56,
      "Time_End": 259.8,
      "Text": " that might be targeted with phishing, password sprays, et cetera. And it's not new to think"
    },
    {
      "Time_Start": 259.8,
      "Time_End": 266.8,
      "Text": " about user enumeration as a vulnerability. This has been recognized by many large organizations."
    },
    {
      "Time_Start": 268.12,
      "Time_End": 272.96,
      "Text": " It shouldn't be the case that Microsoft makes the argument that user enumeration isn't a"
    },
    {
      "Time_Start": 272.96,
      "Time_End": 277.08,
      "Text": " vulnerability. And you can see that they don't take it seriously because if you look"
    },
    {
      "Time_Start": 277.08,
      "Time_End": 281.96,
      "Text": " from back even to 2014, that's a decade ago almost, that's when I believe the first exchange"
    },
    {
      "Time_Start": 281.96,
      "Time_End": 286.47999999999996,
      "Text": " time-based user enumeration was identified. There were multiple loans after that, you"
    },
    {
      "Time_Start": 286.47999999999996,
      "Time_End": 291.76,
      "Text": " can see. And it's just persistent throughout all their products because they don't consider"
    },
    {
      "Time_Start": 291.76,
      "Time_End": 296.67999999999995,
      "Text": " it a vulnerability. You can see this actually if you were to go to look at their bounty"
    },
    {
      "Time_Start": 296.68,
      "Time_End": 303.68,
      "Text": " page out of scope submissions and vulnerabilities, these are not in scope for submission. So"
    },
    {
      "Time_Start": 304.32,
      "Time_End": 309.24,
      "Text": " it's not surprising. I submitted the SharePoint OneDrive enumeration vulnerability to them."
    },
    {
      "Time_Start": 309.24,
      "Time_End": 315.92,
      "Text": " And you can actually see they actually gave us a really nice verbose response. So the"
    },
    {
      "Time_Start": 315.92,
      "Time_End": 321.02,
      "Text": " parts that I want to point out are basically we would not consider it on its own a security"
    },
    {
      "Time_Start": 321.02,
      "Time_End": 326.12,
      "Text": " vulnerability and that it's similar to knowing a website IP address. And that's something"
    },
    {
      "Time_Start": 326.12,
      "Time_End": 330.84000000000003,
      "Text": " that's public, right? That's not something that's considered private information at all."
    },
    {
      "Time_Start": 330.84000000000003,
      "Time_End": 336.28000000000003,
      "Text": " So that is their stance on it. It's not a bug, it's a feature. It's built in. So with"
    },
    {
      "Time_Start": 336.28000000000003,
      "Time_End": 343.28000000000003,
      "Text": " that, we arrive at stage one, user enumeration. So knowing that OneDrive can enumerate users"
    },
    {
      "Time_Start": 344.52,
      "Time_End": 348.96,
      "Text": " and it can do so silently via HTTP, it's just a head request and you can tell if the user"
    },
    {
      "Time_Start": 348.96,
      "Time_End": 353.76,
      "Text": " is valid or not, it's basically web scraping. There's no authentication attempt, unlike"
    },
    {
      "Time_Start": 353.76,
      "Time_End": 357.32,
      "Text": " graph and other methods where you have to actually try to make a login, which is sketchy"
    },
    {
      "Time_Start": 357.32,
      "Time_End": 362.36,
      "Text": " if you're going to try doing something on a large scale. But OneDrive doesn't have any"
    },
    {
      "Time_Start": 362.36,
      "Time_End": 367.76,
      "Text": " of those problems. You can use this and nobody can see it, except for Microsoft."
    },
    {
      "Time_Start": 367.76,
      "Time_End": 370.96,
      "Text": " So there's a few different Azure enumeration methods. These are the popular ones that I'm"
    },
    {
      "Time_Start": 370.96,
      "Time_End": 376.36,
      "Text": " aware of. The graph one has a logon attempt made. It shows up in any logs. That's the"
    },
    {
      "Time_Start": 376.36,
      "Time_End": 378.88,
      "Text": " normal one that people will use to attack oftentimes."
    },
    {
      "Time_Start": 379.88,
      "Time_End": 386.88,
      "Text": " Oops, sorry. My bad. So the next one down, seamless SSO, that's a quiet one, but you"
    },
    {
      "Time_Start": 387.48,
      "Time_End": 392.12,
      "Text": " get false positives with it. There's the team's presence, but you need to have the external"
    },
    {
      "Time_Start": 392.12,
      "Time_End": 395.96,
      "Text": " access enabled. We'll be talking about that later. And so we have OneDrive. OneDrive has"
    },
    {
      "Time_Start": 395.96,
      "Time_End": 402.32,
      "Text": " no rate limits, no false positives. It's simple. It's easy to script out because it's so easy."
    },
    {
      "Time_Start": 402.32,
      "Time_End": 409.32,
      "Text": " You can, in fact, use Durbuster if you really wanted to, to do the same type of enumeration."
    },
    {
      "Time_Start": 409.59999999999997,
      "Time_End": 413.76,
      "Text": " Now in order to enumerate a OneDrive user, there are a few things that you need to know."
    },
    {
      "Time_Start": 413.76,
      "Time_End": 417.84,
      "Text": " You need to know the domain name and you need to know the tenant name. But you don't always"
    },
    {
      "Time_Start": 417.84,
      "Time_End": 423.28,
      "Text": " know what the tenant name is. Oftentimes it will match the domain name minus the TLD,"
    },
    {
      "Time_Start": 423.28,
      "Time_End": 427.8,
      "Text": " but that's not always the case. And in fact, a good portion of the time it's not the case."
    },
    {
      "Time_Start": 427.8,
      "Time_End": 431.88,
      "Text": " And so that's an important requirement to doing the OneDrive enumeration, and thankfully"
    },
    {
      "Time_Start": 431.88,
      "Time_End": 438.44,
      "Text": " Dr. Azure AD, who is amazing, identified a way to do this. He published it in AAD Internals"
    },
    {
      "Time_Start": 438.44,
      "Time_End": 442.44,
      "Text": " and then Trevor Spray added it into their tool, which is also amazing and you should"
    },
    {
      "Time_Start": 442.44,
      "Time_End": 449.12,
      "Text": " check it out. And it identifies the tenant names using a Microsoft lookup service. So"
    },
    {
      "Time_Start": 449.12,
      "Time_End": 456.12,
      "Text": " I implemented these into my own tool, OneDrive Enum, and I started enumerating users and"
    },
    {
      "Time_Start": 457.12,
      "Time_End": 462.92,
      "Text": " I then added networking capabilities and just had basically a SQL backend and a bunch of"
    },
    {
      "Time_Start": 462.92,
      "Time_End": 468.48,
      "Text": " VPSs. For this I used Clue, which is not a codified likeness, but it's a cloud lookup"
    },
    {
      "Time_Start": 468.48,
      "Time_End": 474.72,
      "Text": " utility. And so that would just talk back to my Tron server and sync up word lists,"
    },
    {
      "Time_Start": 474.72,
      "Time_End": 480.52,
      "Text": " et cetera, and then you could run your enumeration on there. And I had, the original Clue crew"
    },
    {
      "Time_Start": 480.52,
      "Time_End": 485.4,
      "Text": " was only a small squad, but after about six months or so of doing this, I decided to go"
    },
    {
      "Time_Start": 485.40000000000003,
      "Time_End": 490.8,
      "Text": " a little bit harder and we upped it up a little bit. At one time I did reach 56, but"
    },
    {
      "Time_Start": 490.8,
      "Time_End": 496.64000000000004,
      "Text": " it was a little, that's too much. 40 was my running, and over the course of a year and"
    },
    {
      "Time_Start": 496.64000000000004,
      "Time_End": 502.32000000000005,
      "Text": " a half I was able to enumerate 24 million users. So these are users at the largest organizations"
    },
    {
      "Time_Start": 502.32000000000005,
      "Time_End": 506.34000000000003,
      "Text": " in the world. Not just limited to Fortune 500 and 1000, but I did specifically look"
    },
    {
      "Time_Start": 506.34000000000003,
      "Time_End": 513.34,
      "Text": " at those. So for reference, 20 million users, it's kind of hard to imagine, but it's about"
    },
    {
      "Time_Start": 513.74,
      "Time_End": 520.74,
      "Text": " the state of Florida or Australia or New York state. So it's a lot of users. So let's take"
    },
    {
      "Time_Start": 523.38,
      "Time_End": 527.9,
      "Text": " a look at some of the results of the user enumeration that I did. The total user names"
    },
    {
      "Time_Start": 527.9,
      "Time_End": 534.5,
      "Text": " that were found were 24 million. The unique were about 10 million. It took about 556 days"
    },
    {
      "Time_Start": 534.5,
      "Time_End": 540.7800000000001,
      "Text": " and I averaged around 40K or so a day. And this was with a small scale operation. If"
    },
    {
      "Time_Start": 540.78,
      "Time_End": 546.5799999999999,
      "Text": " somebody really wanted to do it, they could scale it up a lot. So this is, the total operating"
    },
    {
      "Time_Start": 546.5799999999999,
      "Time_End": 552.02,
      "Text": " budget for this, by the way, was about $5,000. So it's more than I wanted to spend, but it's"
    },
    {
      "Time_Start": 552.02,
      "Time_End": 557.52,
      "Text": " something that proves that it would be so cheap for anybody in the world to do this."
    },
    {
      "Time_Start": 557.52,
      "Time_End": 564.52,
      "Text": " Now looking at user name formats, when you're trying to identify, oops. Okay. So I'm going"
    },
    {
      "Time_Start": 571.78,
      "Time_End": 578.78,
      "Text": " to try. So I don't know about this. Microsoft doesn't want this to happen. Okay. Well, let's"
    },
    {
      "Time_Start": 589.86,
      "Time_End": 595.66,
      "Text": " see what we can do here. So to identify user name formats, I used a survey script. And"
    },
    {
      "Time_Start": 595.66,
      "Time_End": 600.1,
      "Text": " in doing so, I would run a set of different user names against that. And then you can"
    },
    {
      "Time_Start": 600.1,
      "Time_End": 605.62,
      "Text": " get back the number of the matching formats. So for instance, here you can see J. Smith"
    },
    {
      "Time_Start": 605.62,
      "Time_End": 610.62,
      "Text": " was the top format. Let me just see if I can jiggle some stuff here. I might be able to"
    },
    {
      "Time_Start": 610.62,
      "Time_End": 617.62,
      "Text": " get it going. Oh. Well, so going through the different user name formats, I actually sprayed"
    },
    {
      "Time_Start": 620.26,
      "Time_End": 625.3399999999999,
      "Text": " this against all of the Fortune 1000 companies. And we can see overall what were the most"
    },
    {
      "Time_Start": 625.34,
      "Time_End": 630.5400000000001,
      "Text": " prevalent user name formats. We have John Smith as the top, followed by J. Smith, et"
    },
    {
      "Time_Start": 630.5400000000001,
      "Time_End": 634.1800000000001,
      "Text": " cetera. It's just kind of interesting to see. The one thing you have to realize, though,"
    },
    {
      "Time_Start": 634.1800000000001,
      "Time_End": 641.1800000000001,
      "Text": " is that this is probably not really perfect. You know, obviously there's more variation"
    },
    {
      "Time_Start": 641.4200000000001,
      "Time_End": 646.6600000000001,
      "Text": " in John Smith user name formats than there are in J. Smith. So it's going to be a little"
    },
    {
      "Time_Start": 646.6600000000001,
      "Time_End": 653.6600000000001,
      "Text": " bit skewed. John Smith is probably underrepresented in this survey here. One of the interesting"
    },
    {
      "Time_Start": 654.62,
      "Time_End": 658.6999999999999,
      "Text": " things that I identified when I was doing this is that I had originally assumed that"
    },
    {
      "Time_Start": 658.6999999999999,
      "Time_End": 663.3,
      "Text": " people would have one user name format, that it would only be the single one. But that's"
    },
    {
      "Time_Start": 663.3,
      "Time_End": 666.42,
      "Text": " not the case, right? Because you run out of user name space eventually. If you're starting"
    },
    {
      "Time_Start": 666.42,
      "Time_End": 672.3,
      "Text": " with J. Smith, you have to do something when you get that 2,000th user or so. And you can"
    },
    {
      "Time_Start": 672.3,
      "Time_End": 676.2199999999999,
      "Text": " do it a few ways. You can either go up in digits. You can add a format. You can switch"
    },
    {
      "Time_Start": 676.2199999999999,
      "Time_End": 679.9,
      "Text": " over from J. Smith to JJ Smith, for instance, something like that. Or you truncate it. And"
    },
    {
      "Time_Start": 679.9,
      "Time_End": 684.54,
      "Text": " those are the main areas that I saw organizations would move as they were doing this."
    },
    {
      "Time_Start": 684.54,
      "Time_End": 689.66,
      "Text": " So I went through and I kind of did a catalog of that as well, looking at what combinations"
    },
    {
      "Time_Start": 689.66,
      "Time_End": 696.26,
      "Text": " were used. So you can see here that it's actually sorted also commonly limited by popularity"
    },
    {
      "Time_Start": 696.26,
      "Time_End": 699.9,
      "Text": " on each level. So the third and fourth lines down, they're basically the same thing but"
    },
    {
      "Time_Start": 699.9,
      "Time_End": 706.9,
      "Text": " flipped, right? So it's just kind of interesting to see the variations and how they fall out."
    },
    {
      "Time_Start": 707.22,
      "Time_End": 710.5799999999999,
      "Text": " So looking at Fortune 1,000 companies, I just pulled these out specifically just so we'd"
    },
    {
      "Time_Start": 710.5799999999999,
      "Time_End": 715.5799999999999,
      "Text": " be targeting large organizations and not picking on anybody really small. But just to show"
    },
    {
      "Time_Start": 715.5799999999999,
      "Time_End": 720.34,
      "Text": " kind of what type of user enumeration is possible. And you'll notice here that a lot of these"
    },
    {
      "Time_Start": 720.34,
      "Time_End": 725.5,
      "Text": " actually are over 100%. And the reason for that is with OneDrive, you actually the user"
    },
    {
      "Time_Start": 725.5,
      "Time_End": 730.66,
      "Text": " URL exists until you delete the user and then you empty your recycle bin. So if you have"
    },
    {
      "Time_Start": 730.66,
      "Time_End": 734.34,
      "Text": " a long retention policy, that's going to keep them in there a long time. And or if you have"
    },
    {
      "Time_Start": 734.34,
      "Time_End": 740.0600000000001,
      "Text": " a high turnover, that would also super inflate your findings there. But at any rate, even"
    },
    {
      "Time_Start": 740.0600000000001,
      "Time_End": 746.7800000000001,
      "Text": " for an attacker, that reduces it drastically. So it's still worthwhile."
    },
    {
      "Time_Start": 746.7800000000001,
      "Time_End": 752.6600000000001,
      "Text": " So in Azure, there are tenants and then there are domain or email addresses associated with"
    },
    {
      "Time_Start": 752.6600000000001,
      "Time_End": 757.94,
      "Text": " those tenants. There are some multi-tenant domain or organizations like Microsoft where"
    },
    {
      "Time_Start": 757.94,
      "Time_End": 763.14,
      "Text": " you can see they have their main Microsoft, but then they also have APC in Europe, etc."
    },
    {
      "Time_Start": 763.14,
      "Time_End": 768.54,
      "Text": " And this is just the breakdown of the users I found there. I got about 126k in Microsoft's"
    },
    {
      "Time_Start": 768.54,
      "Time_End": 774.14,
      "Text": " main tenant on Microsoft.com. You can see LinkedIn is in there. I had forgotten that"
    },
    {
      "Time_Start": 774.14,
      "Time_End": 780.02,
      "Text": " they had acquired that. And then you can see actually there is a Microsoft APC or Microsoft"
    },
    {
      "Time_Start": 780.02,
      "Time_End": 783.22,
      "Text": " Europe. Yeah, both of Microsoft.com domains there. So you can see how they're actually"
    },
    {
      "Time_Start": 783.22,
      "Time_End": 787.9,
      "Text": " split up. So if you're an attacker, you could actually target one of those specific geographic"
    },
    {
      "Time_Start": 787.9,
      "Time_End": 795.34,
      "Text": " locations based on that tenant name."
    },
    {
      "Time_Start": 795.34,
      "Time_End": 804.74,
      "Text": " So got phase one done. Does anybody remember what phase two is? We're going to do some"
    },
    {
      "Time_Start": 804.74,
      "Time_End": 811.3,
      "Text": " presence enumeration here. Stage two. So to do this, we're going to monitor teams. Before"
    },
    {
      "Time_Start": 811.3,
      "Time_End": 814.38,
      "Text": " we talk about that, I'm just going to give you a real brief timeline here about teams"
    },
    {
      "Time_Start": 814.38,
      "Time_End": 818.82,
      "Text": " and prior to that Skype for Business and prior to that Link and before that Office"
    },
    {
      "Time_Start": 818.82,
      "Time_End": 822.98,
      "Text": " Communicator, I guess. But they're all really the same thing. They're just incarnations"
    },
    {
      "Time_Start": 822.98,
      "Time_End": 827.98,
      "Text": " of it again and they label it new, but they all have the same problems. So here, it started"
    },
    {
      "Time_Start": 827.98,
      "Time_End": 831.98,
      "Text": " out with being called Open Federation and that lets anybody from anywhere message people"
    },
    {
      "Time_Start": 831.98,
      "Time_End": 837.3,
      "Text": " at your organization. That's back when it was Link. I just want to point out here, in"
    },
    {
      "Time_Start": 837.3,
      "Time_End": 842.5,
      "Text": " 2016, Carl Fossum spoke about PowerSkype and attacking Federated Skype for Business at"
    },
    {
      "Time_Start": 842.5,
      "Time_End": 848.34,
      "Text": " DerbyCon. That was the first talk that I'm aware of where anybody discussed using presence"
    },
    {
      "Time_Start": 848.34,
      "Time_End": 852.22,
      "Text": " enumeration and he had a great tool for it there. They eventually did shut down the PowerShell"
    },
    {
      "Time_Start": 852.22,
      "Time_End": 857.02,
      "Text": " APIs that were on the back end, but it had a good run. So this problem with presence"
    },
    {
      "Time_Start": 857.02,
      "Time_End": 862.18,
      "Text": " enumeration is not new. I actually had a little side project here. I was going to release"
    },
    {
      "Time_Start": 862.18,
      "Time_End": 866.94,
      "Text": " it, you know how things happen. You don't end up getting around to releasing it. But"
    },
    {
      "Time_Start": 866.94,
      "Time_End": 871.78,
      "Text": " I was trying to prove that this is a problem back then. So I took a bunch of the CEOs from"
    },
    {
      "Time_Start": 871.78,
      "Time_End": 874.8199999999999,
      "Text": " the biggest corporations in the world and I would, you know, monitor their online presence"
    },
    {
      "Time_Start": 874.8199999999999,
      "Time_End": 877.42,
      "Text": " so you could look at a website and see if they're online or not. You could message them"
    },
    {
      "Time_Start": 877.42,
      "Time_End": 882.8199999999999,
      "Text": " directly because they have external access enabled. So that was just kind of a thing"
    },
    {
      "Time_Start": 882.8199999999999,
      "Time_End": 888.18,
      "Text": " to prove out that this is an issue back then. So this is not a new thing at all. Right now,"
    },
    {
      "Time_Start": 888.18,
      "Time_End": 891.98,
      "Text": " it's called external access and that's in Teams and it's the default setting to have"
    },
    {
      "Time_Start": 891.98,
      "Time_End": 896.8199999999999,
      "Text": " it enabled to let anybody speak with you. You can see it right there and you might recognize"
    },
    {
      "Time_Start": 896.8199999999999,
      "Time_End": 900.38,
      "Text": " it from an outlook. If you ever see a green dot show up next to somebody's email and you"
    },
    {
      "Time_Start": 900.38,
      "Time_End": 908.5,
      "Text": " have the Teams plug-in installed, that's what that is. So again, it's not a bug. It's"
    },
    {
      "Time_Start": 908.5,
      "Time_End": 914.14,
      "Text": " a feature. So one day while I was playing with Graph Explorer, I noticed that there's"
    },
    {
      "Time_Start": 914.14,
      "Time_End": 918.06,
      "Text": " a feature in there for presence lookups. So you can look up somebody's presence and you're"
    },
    {
      "Time_Start": 918.06,
      "Time_End": 923.26,
      "Text": " using unauthenticated, you're on the outside and somehow it was doing the presence lookup"
    },
    {
      "Time_Start": 923.26,
      "Time_End": 927.02,
      "Text": " and I was like, wait, that's kind of weird because you need to be licensed and you need"
    },
    {
      "Time_Start": 927.02,
      "Time_End": 934.1,
      "Text": " to be logged in to do that. So I started playing with it in Burp and it turns out there's a"
    },
    {
      "Time_Start": 934.1,
      "Time_End": 937.74,
      "Text": " weird bearer token set and if you're familiar with bearer tokens, that is not a normal bearer"
    },
    {
      "Time_Start": 937.74,
      "Time_End": 943.5,
      "Text": " token. So I went digging around and lo and behold in the source code, they have a bypass"
    },
    {
      "Time_Start": 943.5,
      "Time_End": 949.54,
      "Text": " to make anonymous presence lookups. It's on GitHub even. And so here you can actually"
    },
    {
      "Time_Start": 949.54,
      "Time_End": 955.42,
      "Text": " see they're proxying the graph request through graph.office.net. So with this, if you have"
    },
    {
      "Time_Start": 955.4200000000001,
      "Time_End": 960.2600000000001,
      "Text": " the UUID, which is that last item there on the right, that long string of characters,"
    },
    {
      "Time_Start": 960.2600000000001,
      "Time_End": 966.3800000000001,
      "Text": " if you have that for a user, you can check their presence via this lookup. So, enter"
    },
    {
      "Time_Start": 966.3800000000001,
      "Time_End": 973.3800000000001,
      "Text": " team filtration. So this was released last year actually at DEF CON 30. And you can use"
    },
    {
      "Time_Start": 974.0400000000001,
      "Time_End": 978.94,
      "Text": " it to enumerate teams. Microsoft messed a little bit with the external access enumeration"
    },
    {
      "Time_Start": 978.94,
      "Time_End": 982.58,
      "Text": " but you can still do it if they have external access enabled. Prior to that, you could tell"
    },
    {
      "Time_Start": 982.7,
      "Time_End": 987.0200000000001,
      "Text": " even if they didn't have external access enabled, you could still enumerate them. At any rate,"
    },
    {
      "Time_Start": 987.0200000000001,
      "Time_End": 993.0600000000001,
      "Text": " what we're looking for are the GUIDs that they can look up for teams. So we can now"
    },
    {
      "Time_Start": 993.0600000000001,
      "Time_End": 1000.0600000000001,
      "Text": " pull down a list of users' GUIDs and using that previous trick, we can start looking"
    },
    {
      "Time_Start": 1000.58,
      "Time_End": 1005.7,
      "Text": " up their presence without having to worry about any authentication or not using an actual"
    },
    {
      "Time_Start": 1005.7,
      "Time_End": 1011.5400000000001,
      "Text": " account or anything. So you can do this purely anonymously. Now beware, there are limits"
    },
    {
      "Time_Start": 1011.5400000000001,
      "Time_End": 1017.7400000000001,
      "Text": " on this, right? There are rate limits on this. And so keep that in mind. There will"
    },
    {
      "Time_Start": 1017.7400000000001,
      "Time_End": 1020.4200000000001,
      "Text": " be a tool drop later. If you're looking for it right now, I'm sorry, it's not there. It"
    },
    {
      "Time_Start": 1020.4200000000001,
      "Time_End": 1025.1000000000001,
      "Text": " will be later today. So keep your eye out for it. My Twitter handle will be out later,"
    },
    {
      "Time_Start": 1025.1000000000001,
      "Time_End": 1029.3400000000001,
      "Text": " so check that. Now, so what should we do with something like this, right? This is pretty"
    },
    {
      "Time_Start": 1029.3400000000001,
      "Time_End": 1035.74,
      "Text": " cool but what should we do? We should track a company. And who better than Microsoft,"
    },
    {
      "Time_Start": 1035.74,
      "Time_End": 1039.74,
      "Text": " right? This is their feature. They've enabled it by default on everybody's. They have to"
    },
    {
      "Time_Start": 1039.74,
      "Time_End": 1044.38,
      "Text": " know how it works. And if they don't, who can be expected to know how it works? So I"
    },
    {
      "Time_Start": 1044.38,
      "Time_End": 1049.54,
      "Text": " don't really feel bad about doing this because it's their feature that I'm demonstrating."
    },
    {
      "Time_Start": 1049.54,
      "Time_End": 1056.54,
      "Text": " So I started doing some monitoring around April 28th. And I started graphing it out"
    },
    {
      "Time_Start": 1056.66,
      "Time_End": 1059.74,
      "Text": " and it's kind of neat, right? You can see their daily activity throughout the day, how"
    },
    {
      "Time_Start": 1059.74,
      "Time_End": 1065.74,
      "Text": " many people are online. And it was great. I submitted to DEF CON. I was like, yes, this"
    },
    {
      "Time_Start": 1065.78,
      "Time_End": 1071.7,
      "Text": " is going to be good. And then a week later this happened. I was so bummed out. I was"
    },
    {
      "Time_Start": 1071.7,
      "Time_End": 1076.54,
      "Text": " like, okay, this is going to be way more complicated now. I'm going to have to spin up an Azure"
    },
    {
      "Time_Start": 1076.54,
      "Time_End": 1082.18,
      "Text": " tenant, blah, blah, blah. But I waited and a month later it came back. So I don't know"
    },
    {
      "Time_Start": 1082.18,
      "Time_End": 1088.26,
      "Text": " what happened, but things are working again. And you can now do this. I'm going to be,"
    },
    {
      "Time_Start": 1088.26,
      "Time_End": 1091.5,
      "Text": " I'm actually not monitoring that anymore, so you guys are free to use this and not worry"
    },
    {
      "Time_Start": 1091.5,
      "Time_End": 1098.5,
      "Text": " about the rate limits. Yeah, so here's something interesting that popped up one day. Any guesses"
    },
    {
      "Time_Start": 1098.74,
      "Time_End": 1105.26,
      "Text": " on what this is? It's an all-hands meeting there for just a little bit. And you can actually"
    },
    {
      "Time_Start": 1105.26,
      "Time_End": 1110.26,
      "Text": " see two of them, right? There's one for probably in the Americas and probably one for overseas."
    },
    {
      "Time_Start": 1110.26,
      "Time_End": 1116.38,
      "Text": " There's actually, you can see a Microsoft Build event there where they announced that"
    },
    {
      "Time_Start": 1116.38,
      "Time_End": 1122.0600000000002,
      "Text": " and then the two days that they're actually out there and busy on those days. I just want"
    },
    {
      "Time_Start": 1122.0600000000002,
      "Time_End": 1129.0600000000002,
      "Text": " to put this up here for a second while I take a drink of water. So you can also draw heat"
    },
    {
      "Time_Start": 1129.8600000000001,
      "Time_End": 1134.66,
      "Text": " maps. You can find out what day people are active, how many available users are active"
    },
    {
      "Time_Start": 1134.66,
      "Time_End": 1138.2600000000002,
      "Text": " on any given day. And you can actually see, I think the 4th of July this week being on"
    },
    {
      "Time_Start": 1138.2600000000002,
      "Time_End": 1141.5400000000002,
      "Text": " a weekday, I think that messed with people taking off. People were still checking their"
    },
    {
      "Time_Start": 1141.54,
      "Time_End": 1146.42,
      "Text": " phones, you can see on the holiday. They were more off on the weekend before. But yeah,"
    },
    {
      "Time_Start": 1146.42,
      "Time_End": 1151.62,
      "Text": " it's kind of neat. And on Fridays, of course, look on Fridays. Summertime. So I took all"
    },
    {
      "Time_Start": 1151.62,
      "Time_End": 1155.58,
      "Text": " their out-of-office messages too. These are also all available through the presence lookup."
    },
    {
      "Time_Start": 1155.58,
      "Time_End": 1159.94,
      "Text": " So Team Filtration will do this. Yeah, so I've got all their out-of-office messages"
    },
    {
      "Time_Start": 1159.94,
      "Time_End": 1166.94,
      "Text": " and just kind of, it's not very useful, but it's kind of neat. But, so back to identities"
    },
    {
      "Time_Start": 1167.7,
      "Time_End": 1174.1000000000001,
      "Text": " and emails being linked, right? So you can go on LinkedIn, right, and find members of"
    },
    {
      "Time_Start": 1174.1000000000001,
      "Time_End": 1180.78,
      "Text": " the Microsoft security team. You can then enumerate their email addresses and pull them"
    },
    {
      "Time_Start": 1180.78,
      "Time_End": 1183.98,
      "Text": " up to make sure they're the right one. Because teams will tell you their display name. So"
    },
    {
      "Time_Start": 1183.98,
      "Time_End": 1186.8600000000001,
      "Text": " you can verify that that's actually who you're looking for and not just somebody else named"
    },
    {
      "Time_Start": 1186.8600000000001,
      "Time_End": 1192.46,
      "Text": " Jay Smith. So if an attacker were to do this, there are a few things that they might be"
    },
    {
      "Time_Start": 1192.46,
      "Time_End": 1197.98,
      "Text": " interested in, right? Are they online right now? Who's on vacation? Who's out of office?"
    },
    {
      "Time_Start": 1197.98,
      "Time_End": 1203.8600000000001,
      "Text": " Who should I call to talk to that person that's out of office? And then the other thing is"
    },
    {
      "Time_Start": 1203.8600000000001,
      "Time_End": 1208.58,
      "Text": " it doesn't even have to be an adversary. This could be some marketing person that wants"
    },
    {
      "Time_Start": 1208.58,
      "Time_End": 1211.9,
      "Text": " to reach somebody when they're at their desk. Just find out what their schedule is and now"
    },
    {
      "Time_Start": 1211.9,
      "Time_End": 1217.0,
      "Text": " I know that they're going to be there right now and I can email them. So the other thing"
    },
    {
      "Time_Start": 1217.0,
      "Time_End": 1221.16,
      "Text": " is that even if the usernames were completely anonymous, right, you can still tell a lot"
    },
    {
      "Time_Start": 1221.16,
      "Time_End": 1225.4,
      "Text": " about somebody based on their schedule. Like when are their normal hours? Are they a night"
    },
    {
      "Time_Start": 1225.4,
      "Time_End": 1229.24,
      "Text": " owl or are they up in the morning? What holidays are they taking off? Are they taking religious"
    },
    {
      "Time_Start": 1229.24,
      "Time_End": 1234.4,
      "Text": " holidays or are they taking holidays particularly to one nation? Even if you used numeric usernames,"
    },
    {
      "Time_Start": 1234.4,
      "Time_End": 1238.24,
      "Text": " you could still identify a lot about people by putting a game of 20 questions there, you"
    },
    {
      "Time_Start": 1238.24,
      "Time_End": 1243.48,
      "Text": " know, figuring out this or that, this or that. And you can really narrow down who that could"
    },
    {
      "Time_Start": 1243.48,
      "Time_End": 1250.48,
      "Text": " possibly be. So that was the end of that one. Stage three is the really interesting part"
    },
    {
      "Time_Start": 1251.44,
      "Time_End": 1258.44,
      "Text": " guest enumeration. So just real quick, know that it is possible to enumerate guest users"
    },
    {
      "Time_Start": 1259.28,
      "Time_End": 1266.28,
      "Text": " in Azure so you should consider any guests that you have to be public information. Real"
    },
    {
      "Time_Start": 1268.4,
      "Time_End": 1273.8000000000002,
      "Text": " quick how it works, right? You invite somebody to your tenant in Azure. Beware. So anything,"
    },
    {
      "Time_Start": 1273.8000000000002,
      "Time_End": 1279.6000000000001,
      "Text": " I'm going to show you some stuff here. These do not imply business relationships. Anybody"
    },
    {
      "Time_Start": 1279.6000000000001,
      "Time_End": 1283.4800000000002,
      "Text": " can invite a guest user by default, even other guests. So if, you know, if you invited"
    },
    {
      "Time_Start": 1283.4800000000002,
      "Time_End": 1287.72,
      "Text": " me to your tenant, I can then turn around and invite a random third party to your tenant"
    },
    {
      "Time_Start": 1287.72,
      "Time_End": 1291.72,
      "Text": " because that's the default setting there. And I don't know how many people actually"
    },
    {
      "Time_Start": 1291.72,
      "Time_End": 1295.2,
      "Text": " go through and change that. But I'm just telling you, that's what it is by default. So there's"
    },
    {
      "Time_Start": 1295.2,
      "Time_End": 1300.8200000000002,
      "Text": " a lot of like ambiguity here about relationships if you're trying to infer them by looking"
    },
    {
      "Time_Start": 1300.8200000000002,
      "Time_End": 1305.96,
      "Text": " at guests, guest users at an organization. But on the other hand, if you see that there's"
    },
    {
      "Time_Start": 1305.96,
      "Time_End": 1312.8,
      "Text": " like maybe 30 or 100 guest users at an org, that might not be just a coincidence. So it's"
    },
    {
      "Time_Start": 1312.8,
      "Time_End": 1317.08,
      "Text": " actually, this is all out in plain sight too. So if you go log into the Azure portal and"
    },
    {
      "Time_Start": 1317.08,
      "Time_End": 1320.0,
      "Text": " you go to a guest account and you pull it up, this is the user principal name you'll"
    },
    {
      "Time_Start": 1320.0,
      "Time_End": 1325.24,
      "Text": " see. And it's not too hard to decipher what we need to change, you know, from the email"
    },
    {
      "Time_Start": 1325.24,
      "Time_End": 1332.24,
      "Text": " address to get to that user name. And because user enumeration isn't a vulnerability, it's"
    },
    {
      "Time_Start": 1332.24,
      "Time_End": 1339.24,
      "Text": " a feature. So I have to say, Dr. Azure AD is the first one to discover guest enumeration."
    },
    {
      "Time_Start": 1342.96,
      "Time_End": 1348.72,
      "Text": " I ran across this and he actually found it four years ago. So this is not new at all."
    },
    {
      "Time_Start": 1348.72,
      "Time_End": 1353.48,
      "Text": " Not new in the least. He didn't make a big deal about it and it was kind of published"
    },
    {
      "Time_Start": 1353.48,
      "Time_End": 1359.04,
      "Text": " midway down. And I also think the other reason this hasn't received much attention yet is"
    },
    {
      "Time_Start": 1359.04,
      "Time_End": 1363.12,
      "Text": " that this will not come up on a pen test. This is not in scope on a pen test, right?"
    },
    {
      "Time_Start": 1363.12,
      "Time_End": 1367.04,
      "Text": " I can't try pivoting to another tenant there, so why would I even care if I can enumerate"
    },
    {
      "Time_Start": 1367.04,
      "Time_End": 1371.54,
      "Text": " users there? But it's been possible this whole time. And so I'm rather certain that people"
    },
    {
      "Time_Start": 1371.54,
      "Time_End": 1375.84,
      "Text": " are using this already. Why wouldn't they? You know, it's been out there. There are various"
    },
    {
      "Time_Start": 1375.84,
      "Time_End": 1379.32,
      "Text": " ways of doing this, so why wouldn't people be doing this already? So keep that in mind"
    },
    {
      "Time_Start": 1379.32,
      "Time_End": 1383.8,
      "Text": " while I show you these next ones. So real quick though, I'll show you how it works,"
    },
    {
      "Time_Start": 1383.8,
      "Time_End": 1387.8,
      "Text": " right? This is how simple it is. How simple. You can do it from a browser yourself if you"
    },
    {
      "Time_Start": 1387.8,
      "Time_End": 1391.52,
      "Text": " know what the email address is. So on the left, that's an invalid one. Fake user underscore"
    },
    {
      "Time_Start": 1391.52,
      "Time_End": 1397.72,
      "Text": " domain dot com exd Microsoft dot on Microsoft dot com. So that's Microsoft's tenant there."
    },
    {
      "Time_Start": 1397.72,
      "Time_End": 1401.44,
      "Text": " Microsoft dot on Microsoft dot com. You can see on the left side, I'm showing you some"
    },
    {
      "Time_Start": 1401.44,
      "Time_End": 1405.6,
      "Text": " valid user. You get redirected to a sign-in page if it's a valid user. So you can tell"
    },
    {
      "Time_Start": 1405.6,
      "Time_End": 1409.58,
      "Text": " immediately. You don't even need to authenticate. You're simply entering that user name there"
    },
    {
      "Time_Start": 1409.58,
      "Time_End": 1416.58,
      "Text": " in that sign-in page. So another tool drop that will be out. There's another method of"
    },
    {
      "Time_Start": 1416.86,
      "Time_End": 1422.26,
      "Text": " doing this too that I identified, which is via graph enumeration. So the same enumeration"
    },
    {
      "Time_Start": 1422.26,
      "Time_End": 1427.9399999999998,
      "Text": " method that we use for, you know, other enumerations that are interactive. Same thing works there."
    },
    {
      "Time_Start": 1427.9399999999998,
      "Time_End": 1434.24,
      "Text": " There are a few differences though. Graph-based user enumeration is an authentication attempt"
    },
    {
      "Time_Start": 1434.24,
      "Time_End": 1440.1399999999999,
      "Text": " against graph, but you can't log in this way. So even if you have the valid password, it"
    },
    {
      "Time_Start": 1440.1399999999999,
      "Time_End": 1443.5,
      "Text": " won't let you in. It won't tell you if it's a valid password or not. Nothing about it."
    },
    {
      "Time_Start": 1443.5,
      "Time_End": 1449.74,
      "Text": " It's not possible to log in via this avenue with that guest account. So it's not really"
    },
    {
      "Time_Start": 1449.74,
      "Time_End": 1455.02,
      "Text": " a log in attempt, but if you decide to use this method, just keep that in mind. In the"
    },
    {
      "Time_Start": 1455.02,
      "Time_End": 1459.1,
      "Text": " tool, the password is set to a really long GUID so that it won't be any chance that somebody"
    },
    {
      "Time_Start": 1459.1,
      "Time_End": 1462.94,
      "Text": " actually has that password, but you can't leave the field blank. So it has to be there."
    },
    {
      "Time_Start": 1462.94,
      "Time_End": 1466.48,
      "Text": " Just be aware it will show up in logs and defunders. If you see this in your logs where"
    },
    {
      "Time_Start": 1466.48,
      "Time_End": 1473.48,
      "Text": " you see a failed guest EXE log on your account, don't be alarmed. You can't get in that way,"
    },
    {
      "Time_Start": 1473.5,
      "Time_End": 1477.26,
      "Text": " but do know that somebody's found out about that account."
    },
    {
      "Time_Start": 1477.26,
      "Time_End": 1484.58,
      "Text": " Now what can we do with this, right? If only we had a giant list of usernames from somewhere."
    },
    {
      "Time_Start": 1484.58,
      "Time_End": 1489.66,
      "Text": " Then we could do something interesting. We could try identifying some partnerships between"
    },
    {
      "Time_Start": 1489.66,
      "Time_End": 1495.62,
      "Text": " companies. So I started by looking at, you know, going to Google, say, okay, so-and-so"
    },
    {
      "Time_Start": 1495.62,
      "Time_End": 1501.6,
      "Text": " partners with blank. Who comes up? Let's look at that. So took a few consultant companies"
    },
    {
      "Time_Start": 1501.72,
      "Time_End": 1505.2,
      "Text": " and I got some hits back. Okay, this works. For real. I can prove it out that it's actually"
    },
    {
      "Time_Start": 1505.2,
      "Time_End": 1511.5200000000002,
      "Text": " actionable attack in the real world. This is not just, you know, an idea. So this is"
    },
    {
      "Time_Start": 1511.5200000000002,
      "Time_End": 1518.92,
      "Text": " what 30,000 guest connections between companies looks like. So these are a lot of big companies"
    },
    {
      "Time_Start": 1518.92,
      "Time_End": 1524.44,
      "Text": " in America. Now this one is in color code. I left Microsoft in there because, again,"
    },
    {
      "Time_Start": 1524.44,
      "Time_End": 1530.88,
      "Text": " this is their feature, but I'm going to show you here in just a slide or two here, but"
    },
    {
      "Time_Start": 1531.16,
      "Time_End": 1535.0400000000002,
      "Text": " we identified guest accounts among all these giant organizations, ones that maybe they"
    },
    {
      "Time_Start": 1535.0400000000002,
      "Time_End": 1540.16,
      "Text": " don't want people knowing who potentially, you know, right, because we don't know for"
    },
    {
      "Time_Start": 1540.16,
      "Time_End": 1545.7600000000002,
      "Text": " sure if there's actually a business relationship there, but potentially could be because of"
    },
    {
      "Time_Start": 1545.7600000000002,
      "Time_End": 1559.0400000000002,
      "Text": " this guest relationship. Now one more sip of water. Where was I? So let's look at Microsoft's"
    },
    {
      "Time_Start": 1559.1599999999999,
      "Time_End": 1563.6,
      "Text": " guest relationships. I've taken out all the names. I'm sorry. Not going to be that fun,"
    },
    {
      "Time_Start": 1563.6,
      "Time_End": 1568.8,
      "Text": " but you can see the diversity of relationships there. Now any of the blue ones are where"
    },
    {
      "Time_Start": 1568.8,
      "Time_End": 1574.72,
      "Text": " Microsoft has guest access to. Any of the red ones are where that entity has guest access"
    },
    {
      "Time_Start": 1574.72,
      "Time_End": 1581.72,
      "Text": " to Microsoft. Now by default, you know, they might just have guest access and no actual"
    },
    {
      "Time_Start": 1581.72,
      "Time_End": 1587.8,
      "Text": " group membership, et cetera, no special privileges, but they are there. Any of the green that"
    },
    {
      "Time_Start": 1587.8,
      "Time_End": 1591.08,
      "Text": " are interconnected are in between partners of Microsoft that also have a connection to"
    },
    {
      "Time_Start": 1591.08,
      "Time_End": 1596.0,
      "Text": " Microsoft. So you can see between various entities there, and then the larger it is,"
    },
    {
      "Time_Start": 1596.0,
      "Time_End": 1600.68,
      "Text": " the bigger or the greater number of connections there are to that node. So that's what you're"
    },
    {
      "Time_Start": 1600.68,
      "Time_End": 1609.04,
      "Text": " seeing here. Now, again, this is Microsoft's stance. This is pure user enumeration. Nothing"
    },
    {
      "Time_Start": 1609.04,
      "Time_End": 1617.36,
      "Text": " about this is an attack. This is user enumeration, pure. So I want to focus on Microsoft, but"
    },
    {
      "Time_Start": 1617.3600000000001,
      "Time_End": 1621.3600000000001,
      "Text": " to show like the width of this and how it affects everybody, I'm just going to show"
    },
    {
      "Time_Start": 1621.3600000000001,
      "Time_End": 1630.92,
      "Text": " you a few other large companies here. So for instance, here's Metas. You can see. We've"
    },
    {
      "Time_Start": 1630.92,
      "Time_End": 1641.5200000000002,
      "Text": " got Tesla. Might be interesting. Again, I apologize that it's not more juicy, but here's"
    },
    {
      "Time_Start": 1641.5200000000002,
      "Time_End": 1645.48,
      "Text": " a company named Palantir. I don't know if anybody's heard of that one. Remember the"
    },
    {
      "Time_Start": 1645.48,
      "Time_End": 1654.08,
      "Text": " blue says that they have guest access to that tenant. So looking at the most widespread"
    },
    {
      "Time_Start": 1654.08,
      "Time_End": 1658.08,
      "Text": " companies, I'm just showing you a few of the top ones here that I found the most connections"
    },
    {
      "Time_Start": 1658.08,
      "Time_End": 1664.56,
      "Text": " to organizations, and these are distinct hosts that they have connections to. You can see"
    },
    {
      "Time_Start": 1664.56,
      "Time_End": 1673.92,
      "Text": " a bunch of consultancy companies there. Not too unusual. But so speaking again about users"
    },
    {
      "Time_Start": 1674.04,
      "Time_End": 1679.3600000000001,
      "Text": " and identities, right, and enumeration, with this type of information, we know the email"
    },
    {
      "Time_Start": 1679.3600000000001,
      "Time_End": 1683.96,
      "Text": " address that's there, right? So we have their identity oftentimes. So you can actually do"
    },
    {
      "Time_Start": 1683.96,
      "Time_End": 1688.96,
      "Text": " some deeper digging and give it some more context with what years these guest relationships"
    },
    {
      "Time_Start": 1688.96,
      "Time_End": 1693.2,
      "Text": " are active because almost nobody cleans up guests. They almost always just leave them"
    },
    {
      "Time_Start": 1693.2,
      "Time_End": 1697.44,
      "Text": " out there and maybe they disable them or whatnot, but they almost always leave them there. So"
    },
    {
      "Time_Start": 1697.44,
      "Time_End": 1701.8000000000002,
      "Text": " you can at least see when they are. The oldest one I identified personally that I verified"
    },
    {
      "Time_Start": 1701.8,
      "Time_End": 1707.68,
      "Text": " was like 2018. So that's a little ways ago. So how does this matter, right, for attackers,"
    },
    {
      "Time_Start": 1707.68,
      "Time_End": 1711.1599999999999,
      "Text": " right? If you're looking at these guest relationships, now all of a sudden if you're trying to hit"
    },
    {
      "Time_Start": 1711.1599999999999,
      "Time_End": 1714.6,
      "Text": " a hardened target, you might want to say, hey, let's see what we can do around these"
    },
    {
      "Time_Start": 1714.6,
      "Time_End": 1720.6,
      "Text": " peripherals. Can we compromise another tenant and see if we have any access? It might be"
    },
    {
      "Time_Start": 1720.6,
      "Time_End": 1726.6,
      "Text": " a fruitless effort, but it might be something. So I mean, this is providing a roadmap to"
    },
    {
      "Time_Start": 1726.6000000000001,
      "Time_End": 1733.0800000000002,
      "Text": " allow attackers to identify their next steps. And this is pure user enumeration, right?"
    },
    {
      "Time_Start": 1733.0800000000002,
      "Time_End": 1740.0400000000002,
      "Text": " Not a vulnerability. So one of the last things I want to say is that this is a U.S. adversary's"
    },
    {
      "Time_Start": 1740.0400000000002,
      "Time_End": 1745.5600000000002,
      "Text": " dream, right? You have nations that love to do data collection. Do you think that they're"
    },
    {
      "Time_Start": 1745.5600000000002,
      "Time_End": 1749.96,
      "Text": " not doing something with this yet? Do you think that they're just letting this sit out"
    },
    {
      "Time_Start": 1749.96,
      "Time_End": 1756.96,
      "Text": " there because it's not ethical to collect this? I mean, look at these different industries."
    },
    {
      "Time_Start": 1757.32,
      "Time_End": 1763.6000000000001,
      "Text": " All of America is tied up in this, right? State governments, federal corporations. And"
    },
    {
      "Time_Start": 1763.6000000000001,
      "Time_End": 1766.3600000000001,
      "Text": " if they don't take this seriously, they're not going to fix this. They're going to let"
    },
    {
      "Time_Start": 1766.3600000000001,
      "Time_End": 1771.48,
      "Text": " this sit. And this isn't just like a short-term investment. This is a long-term investment."
    },
    {
      "Time_Start": 1771.48,
      "Time_End": 1775.64,
      "Text": " Names are durable, right? How many times do most people change their name in their life?"
    },
    {
      "Time_Start": 1775.64,
      "Time_End": 1780.2800000000002,
      "Text": " A couple times, maybe a few. But most people don't change their names very often. So once"
    },
    {
      "Time_Start": 1780.2800000000002,
      "Time_End": 1784.2800000000002,
      "Text": " you make these lists, they're valid for a long time, right? They might switch organizations,"
    },
    {
      "Time_Start": 1784.2800000000002,
      "Time_End": 1788.16,
      "Text": " but that person's name, you still have that. You can make permutations out of that and"
    },
    {
      "Time_Start": 1788.16,
      "Time_End": 1793.64,
      "Text": " try those other places. So I mean, this isn't something that I think we should let. Is this"
    },
    {
      "Time_Start": 1793.64,
      "Time_End": 1799.3200000000002,
      "Text": " something that we want? You know, is this how we want to have our stuff run? I think"
    },
    {
      "Time_Start": 1799.32,
      "Time_End": 1806.12,
      "Text": " that we should maybe recommend, politely, that they take this a little more seriously."
    },
    {
      "Time_Start": 1806.12,
      "Time_End": 1811.12,
      "Text": " I mean, so we've demonstrated that it's possible to get 24 million users out of Azure. We've"
    },
    {
      "Time_Start": 1811.12,
      "Time_End": 1817.72,
      "Text": " demonstrated 100,000 users every 30 minutes, so twice a day. That's a huge number of requests."
    },
    {
      "Time_Start": 1817.72,
      "Time_End": 1823.4399999999998,
      "Text": " We're able to do that. We can monitor an entire company as big as Microsoft. We can select"
    },
    {
      "Time_Start": 1823.44,
      "Time_End": 1828.64,
      "Text": " out users from there and monitor them exclusively if we wanted to on an even finer, you know,"
    },
    {
      "Time_Start": 1828.64,
      "Time_End": 1833.44,
      "Text": " rotation. And we've shown that we can do guest enumeration, right, between different companies."
    },
    {
      "Time_Start": 1833.44,
      "Time_End": 1838.98,
      "Text": " This is all user enumeration. This isn't an exploit, at least not by Microsoft's stance."
    },
    {
      "Time_Start": 1838.98,
      "Time_End": 1845.4,
      "Text": " This is all just user enumeration. So I just want you to remember, though, in closing,"
    },
    {
      "Time_Start": 1845.4,
      "Time_End": 1848.92,
      "Text": " that I am just the messenger here. I'm just showing you what the logical conclusion of"
    },
    {
      "Time_Start": 1848.92,
      "Time_End": 1853.16,
      "Text": " this is, right? I'm not anybody special. I'm just some dude that, this is basically"
    },
    {
      "Time_Start": 1853.16,
      "Time_End": 1857.96,
      "Text": " sysadmin 101, right? I made a SQL server. I still have servers and I had to report back."
    },
    {
      "Time_Start": 1857.96,
      "Time_End": 1863.52,
      "Text": " I made a Python script. It's not hard stuff. And it only cost me about 5K, right? If you're"
    },
    {
      "Time_Start": 1863.52,
      "Time_End": 1867.72,
      "Text": " a nation state or somebody who really wants to invest in this, you can do something much"
    },
    {
      "Time_Start": 1867.72,
      "Time_End": 1871.92,
      "Text": " bigger than I did. This is just like a hobby that I did in spare time to try to get Microsoft"
    },
    {
      "Time_Start": 1871.92,
      "Time_End": 1876.8000000000002,
      "Text": " to fix this. And that is why I did this. I want Microsoft to fix this. I don't know how"
    },
    {
      "Time_Start": 1876.8,
      "Time_End": 1880.32,
      "Text": " else to go about it. We've talked to Microsoft and they don't take it seriously as an issue."
    },
    {
      "Time_Start": 1880.32,
      "Time_End": 1883.68,
      "Text": " So at this point, I just wanted to share this with you so at least we can all be on the"
    },
    {
      "Time_Start": 1883.68,
      "Time_End": 1890.12,
      "Text": " same footing and know what's possible out there. So with that, some shoutouts. Dr. Azure"
    },
    {
      "Time_Start": 1890.12,
      "Time_End": 1896.6399999999999,
      "Text": " AD, TechRomancer, Carl Fawson, he's awesome, RootSecDev, Flagwick, and then everybody at"
    },
    {
      "Time_Start": 1896.6399999999999,
      "Time_End": 1902.68,
      "Text": " TrustedSec, of course. These are some links to the different tools. The last two will"
    },
    {
      "Time_Start": 1902.68,
      "Time_End": 1906.04,
      "Text": " be out later today, so just keep an eye on that. Follow me on Twitter. And thank you"
    },
    {
      "Time_Start": 1906.04,
      "Time_End": 1907.04,
      "Text": " so much."
    },
    {
      "Time_Start": 1907.04,
      "Time_End": 1907.06,
      "Text": " Thank you."
    }
  ]
}