{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 6.24,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hey, welcome. Thanks for coming to our session. We're going to be doing a talk on internet"
    },
    {
      "Time_Start": 6.24,
      "Time_End": 11.82,
      "Text": " censorship and what governments are doing around the world. And we're going to stage"
    },
    {
      "Time_Start": 11.82,
      "Time_End": 18.36,
      "Text": " it to be like a conversation. So the idea is us three or four with different perspectives"
    },
    {
      "Time_Start": 18.36,
      "Time_End": 25.86,
      "Text": " are having a conversation. I'll try to be the moderator and create some runway for the"
    },
    {
      "Time_Start": 25.86,
      "Time_End": 32.14,
      "Text": " three panelists to have a conversation. And it's something I think the problem with these"
    },
    {
      "Time_Start": 32.14,
      "Time_End": 35.56,
      "Text": " is you sit around the speaker room and you're getting ready and you're having such a great"
    },
    {
      "Time_Start": 35.56,
      "Time_End": 40.22,
      "Text": " conversation you have to constantly be telling yourself stop. Save that for the stage. No,"
    },
    {
      "Time_Start": 40.22,
      "Time_End": 44.7,
      "Text": " no, no. Stop. So we think we've got some fun things to talk about. Or at least we think"
    },
    {
      "Time_Start": 44.7,
      "Time_End": 50.46,
      "Text": " it's fun. So to kick it off I'm going to start on my right with Roger. And everybody's going"
    },
    {
      "Time_Start": 50.46,
      "Time_End": 56.46,
      "Text": " to introduce themselves. And then we'll just jump right on in. All right? So thank you."
    },
    {
      "Time_Start": 56.46,
      "Time_End": 62.46,
      "Text": " Okay. Hi, everybody. I'm Roger Dingledine from Tor. I founded Tor long ago. I wrote the"
    },
    {
      "Time_Start": 68.62,
      "Time_End": 73.5,
      "Text": " original Tor code and now I wear all sorts of hats and I've been paying more attention to"
    },
    {
      "Time_Start": 73.5,
      "Time_End": 79.0,
      "Text": " the anti‑censorship side of things, the anonymity research side of things and the policy"
    },
    {
      "Time_Start": 79.04,
      "Time_End": 84.24,
      "Text": " side of things. Talking to governments and trying to help them understand that end‑to‑end"
    },
    {
      "Time_Start": 84.24,
      "Time_End": 88.04,
      "Text": " encryption is important and things like that. And that's how I find myself on a policy"
    },
    {
      "Time_Start": 88.04,
      "Time_End": 94.04,
      "Text": " panel. Hey, I'm Chris Painter. I've been doing cyber stuff for about 33 years now. I"
    },
    {
      "Time_Start": 98.74000000000001,
      "Time_End": 102.53999999999999,
      "Text": " started as a federal prosecutor. I didn't start life as a federal prosecutor but I was a"
    },
    {
      "Time_Start": 102.53999999999999,
      "Time_End": 107.28,
      "Text": " federal prosecutor for a while doing cyber crime cases. Then I went to the mothership at"
    },
    {
      "Time_Start": 107.32000000000001,
      "Time_End": 113.02,
      "Text": " Maine justice in D.C. and then I was at the White House creating the cyber directorate and"
    },
    {
      "Time_Start": 113.02,
      "Time_End": 118.68,
      "Text": " then was the world's first cyber diplomat at the State Department. And now among other"
    },
    {
      "Time_Start": 118.68,
      "Time_End": 125.32,
      "Text": " things I run a foundation that's devoted to cyber security capacity building. Jeff and I"
    },
    {
      "Time_Start": 125.32,
      "Time_End": 129.24,
      "Text": " share a love for a movie called Colossus the Forbidden Project which you haven't seen. It's"
    },
    {
      "Time_Start": 129.24,
      "Time_End": 132.52,
      "Text": " like one of the best movies out there. A little kitschy but great."
    },
    {
      "Time_Start": 132.56,
      "Time_End": 138.06,
      "Text": " That's the original movie where the intelligent computer takes over the world to protect"
    },
    {
      "Time_Start": 138.06,
      "Time_End": 143.02,
      "Text": " humanity from itself. And all the stories kind of come from that. It's based on a three"
    },
    {
      "Time_Start": 143.02,
      "Time_End": 145.52,
      "Text": " series of books. Colossus the Forbidden Project."
    },
    {
      "Time_Start": 145.52,
      "Time_End": 149.10000000000002,
      "Text": " 1970, 14 years before war games were terminated."
    },
    {
      "Time_Start": 149.10000000000002,
      "Time_End": 155.64000000000001,
      "Text": " That's right. I'm Joel Todorov. I'm a Fed. I've been a Fed for some time now working on"
    },
    {
      "Time_Start": 155.64000000000001,
      "Time_End": 159.26000000000002,
      "Text": " technology issues really all around government. Right now I'm working for the office of"
    },
    {
      "Time_Start": 159.29999999999998,
      "Time_End": 163.42,
      "Text": " the national cyber director in the White House and some of the projects that I work on"
    },
    {
      "Time_Start": 163.42,
      "Time_End": 167.62,
      "Text": " relate to this. Relate to these questions of Internet censorship and countering the"
    },
    {
      "Time_Start": 167.62,
      "Time_End": 173.07999999999998,
      "Text": " misuse of authoritarian technologies. There is one caveat I do have to provide. They are"
    },
    {
      "Time_Start": 173.07999999999998,
      "Time_End": 178.38,
      "Text": " letting me speak but they said I have to put in a plug for ONCD and the work we're doing"
    },
    {
      "Time_Start": 178.38,
      "Time_End": 183.54,
      "Text": " and to tell you all to go to the website and look at the documents we've published."
    },
    {
      "Time_Start": 183.54,
      "Time_End": 187.62,
      "Text": " And so you actually have some requests for a comment, right?"
    },
    {
      "Time_Start": 187.70000000000002,
      "Time_End": 188.28,
      "Text": " We do."
    },
    {
      "Time_Start": 188.28,
      "Time_End": 189.78,
      "Text": " It's not just look at the documents."
    },
    {
      "Time_Start": 189.78,
      "Time_End": 194.44,
      "Text": " Yeah, so there are areas where you can actively contribute. We'll talk more on this topic"
    },
    {
      "Time_Start": 194.44,
      "Time_End": 198.9,
      "Text": " later but one on open source security. There's a request for information now. So if people"
    },
    {
      "Time_Start": 198.9,
      "Time_End": 203.44,
      "Text": " are interested in that topic you can look there. One on workforce and the cyber security"
    },
    {
      "Time_Start": 203.44,
      "Time_End": 208.16,
      "Text": " workforce. So if you're interested in that, please do give them a look. There's really a lot"
    },
    {
      "Time_Start": 208.16,
      "Time_End": 209.62,
      "Text": " on there."
    },
    {
      "Time_Start": 209.62,
      "Time_End": 215.12,
      "Text": " Okay, so let's kick it off. Let's get this party started. You said something. I'm going to"
    },
    {
      "Time_Start": 215.12,
      "Time_End": 222.24,
      "Text": " jump on you first. You said censorship and other authoritarian technologies. What are"
    },
    {
      "Time_Start": 222.24,
      "Time_End": 229.24,
      "Text": " authoritarian technologies? Do we know? Everything is dual use. So is it really just the way"
    },
    {
      "Time_Start": 229.24,
      "Time_End": 234.32,
      "Text": " in which the commercial off the shelf technology is configured, like the way the router is"
    },
    {
      "Time_Start": 234.32,
      "Time_End": 237.70000000000002,
      "Text": " filtering? Or is it we can actually make that distinction?"
    },
    {
      "Time_Start": 238.66000000000003,
      "Time_End": 245.66000000000003,
      "Text": " I feel like we're starting with a really hard question. And I love it. So I don't have, I"
    },
    {
      "Time_Start": 245.66000000000003,
      "Time_End": 249.48000000000002,
      "Text": " think, a great answer but I have a thought. And the thought is the general sense we come in"
    },
    {
      "Time_Start": 249.48000000000002,
      "Time_End": 255.56,
      "Text": " with is that technology starts as being value neutral. That we imbue it with values by"
    },
    {
      "Time_Start": 255.56,
      "Time_End": 263.28000000000003,
      "Text": " creating it, by operating it, by owning it. And so a technology or a protocol is not itself"
    },
    {
      "Time_Start": 263.28000000000003,
      "Time_End": 268.24,
      "Text": " going to be authoritarian or democratic. And I think there's a sense in which that is"
    },
    {
      "Time_Start": 268.24,
      "Time_End": 276.48,
      "Text": " certainly true. Maybe that's DNS blocking or IP or something like that. You can certainly"
    },
    {
      "Time_Start": 276.48,
      "Time_End": 280.94000000000005,
      "Text": " imagine a lot of entirely legitimate uses. And you can also see instances where an"
    },
    {
      "Time_Start": 280.94000000000005,
      "Time_End": 286.1,
      "Text": " authoritarian regime would misuse the same technologies, the same protocols to do"
    },
    {
      "Time_Start": 286.1,
      "Time_End": 291.98,
      "Text": " something like target ethnic minorities or surveil journalists or prevent people from"
    },
    {
      "Time_Start": 291.98,
      "Time_End": 297.34000000000003,
      "Text": " accessing LGBT information on the internet. Those would definitely be problematic. And we"
    },
    {
      "Time_Start": 297.34000000000003,
      "Time_End": 301.14000000000004,
      "Text": " can say, okay, the values that we're ascribing to this are those from the owners and"
    },
    {
      "Time_Start": 301.14000000000004,
      "Time_End": 307.76,
      "Text": " operators. But different than say, I don't know, commercial command and control for"
    },
    {
      "Time_Start": 307.76,
      "Time_End": 314.64000000000004,
      "Text": " ransomware or NSO, things that have made it, there seems to be a threshold that gets you on"
    },
    {
      "Time_Start": 314.64,
      "Time_End": 322.18,
      "Text": " a sanctions list or on a commerce, you know, Wassenaar arrangement list, right? So there are"
    },
    {
      "Time_Start": 322.18,
      "Time_End": 329.76,
      "Text": " some. Yeah, so you can definitely do things that are really problematic with a technology."
    },
    {
      "Time_Start": 329.76,
      "Time_End": 334.91999999999996,
      "Text": " And so I know Chris has some specific thoughts on this. But one of the things that I'll also"
    },
    {
      "Time_Start": 334.91999999999996,
      "Time_End": 339.3,
      "Text": " flag that I think is interesting is this question of our default state of saying technology"
    },
    {
      "Time_Start": 339.34000000000003,
      "Time_End": 344.54,
      "Text": " is value neutral. One of the things the Biden administration is looking at and you'll"
    },
    {
      "Time_Start": 344.54,
      "Time_End": 348.58,
      "Text": " see a resurgence in is this focus on things like standards bodies, which gets to this idea"
    },
    {
      "Time_Start": 348.58,
      "Time_End": 355.42,
      "Text": " that the value neutrality of technology is a really good first pass. But then you have to"
    },
    {
      "Time_Start": 355.42,
      "Time_End": 360.54,
      "Text": " start asking, is that the case always? Or are there things where really early in the"
    },
    {
      "Time_Start": 360.54,
      "Time_End": 365.88,
      "Text": " design and implementation, you might build something in a way that it's predisposed to be"
    },
    {
      "Time_Start": 365.88,
      "Time_End": 370.46,
      "Text": " used by an authoritarian regime? In a way that it's predisposed to enable an"
    },
    {
      "Time_Start": 370.46,
      "Time_End": 375.58,
      "Text": " anti-democratic or an anti-liberal use of the technology? And how do we think about"
    },
    {
      "Time_Start": 375.58,
      "Time_End": 380.34,
      "Text": " ensuring that our values are put into the tech stack, are put into protocols, are put into"
    },
    {
      "Time_Start": 380.34,
      "Time_End": 385.46,
      "Text": " standards from the beginning? And that I think is certainly an area of ongoing interest and"
    },
    {
      "Time_Start": 385.46,
      "Time_End": 390.96,
      "Text": " an area of ongoing effort. I think that's right. I think that the technology is largely"
    },
    {
      "Time_Start": 390.96,
      "Time_End": 394.8,
      "Text": " value neutral. And we've always said that. It's been like a talking point for forever that"
    },
    {
      "Time_Start": 394.8,
      "Time_End": 399.68,
      "Text": " people said. And I think it's largely true. There is some technology, some things that are"
    },
    {
      "Time_Start": 399.68,
      "Time_End": 407.3,
      "Text": " clearly designed for purposes that are to subvert civil liberties or to enable unreviewed"
    },
    {
      "Time_Start": 407.3,
      "Time_End": 413.68,
      "Text": " and undemocratic sort of surveillance of folks. But the problem is, whenever we've talked in"
    },
    {
      "Time_Start": 413.68,
      "Time_End": 417.92,
      "Text": " the past about, oh, we need to regulate this. Oh, we need to make this illegal. That's really"
    },
    {
      "Time_Start": 417.92,
      "Time_End": 422.92,
      "Text": " problematic because of the dual use issue that Jeff talked about. And to give you a good"
    },
    {
      "Time_Start": 422.92,
      "Time_End": 427.92,
      "Text": " example, we tried this years ago now with the Vasanar. The Vasanar arrangement is this"
    },
    {
      "Time_Start": 427.92,
      "Time_End": 433.42,
      "Text": " export control issue that's used for lots of different things. But we tried this with"
    },
    {
      "Time_Start": 433.42,
      "Time_End": 439.92,
      "Text": " software that could be used to either launch attacks or to surveil and protect civil"
    },
    {
      "Time_Start": 439.92,
      "Time_End": 445.62,
      "Text": " liberties. And the U.S. was a big mover of this and we did it. But the problem was, it really"
    },
    {
      "Time_Start": 445.62,
      "Time_End": 452.12,
      "Text": " didn't work very well because it also inadvertently covered security software. So this is"
    },
    {
      "Time_Start": 452.12,
      "Time_End": 455.62,
      "Text": " a tension which I think is very difficult. But I do agree with you. I think there's some ways"
    },
    {
      "Time_Start": 455.62,
      "Time_End": 463.12,
      "Text": " you can architect the tools of technology that clearly are meant in a bad way. But at the"
    },
    {
      "Time_Start": 463.12,
      "Time_End": 467.04,
      "Text": " same time, it's a pretty slippery slope. So figuring out where that line is I think is very"
    },
    {
      "Time_Start": 467.04,
      "Time_End": 473.36,
      "Text": " difficult. And I'll disagree so that we get a good panel here. So I keep hearing that"
    },
    {
      "Time_Start": 473.36,
      "Time_End": 477.86,
      "Text": " technology is inherently neutral. It's what you do with it that matters. But you have to"
    },
    {
      "Time_Start": 477.86,
      "Time_End": 484.6,
      "Text": " look at the architecture. Some technology is inherently decentralized that empowers a"
    },
    {
      "Time_Start": 484.6,
      "Time_End": 488.94,
      "Text": " broad group of people. Some technology is inherently centralized that ends up"
    },
    {
      "Time_Start": 488.94,
      "Time_End": 493.98,
      "Text": " centralizing power. So you might start off thinking the technology side is inherently"
    },
    {
      "Time_Start": 493.98,
      "Time_End": 499.48,
      "Text": " neutral. But no, technology is inherently political. And you need to think through what"
    },
    {
      "Time_Start": 499.48,
      "Time_End": 507.40000000000003,
      "Text": " people are going to use it for. Because, so if you're going to end up, if you're not"
    },
    {
      "Time_Start": 507.40000000000003,
      "Time_End": 511.98,
      "Text": " thinking it through, you're going to end up reinforcing the existing power structures. And if"
    },
    {
      "Time_Start": 511.98,
      "Time_End": 516.9000000000001,
      "Text": " you want to build something that changes the power structures, that's political and you need"
    },
    {
      "Time_Start": 516.9000000000001,
      "Time_End": 521.72,
      "Text": " to think that through with the architecture. I have to challenge it a little bit. And I would"
    },
    {
      "Time_Start": 521.72,
      "Time_End": 527.48,
      "Text": " agree with you it's political but I would also say it's inherently now commercial. And so"
    },
    {
      "Time_Start": 527.48,
      "Time_End": 532.9000000000001,
      "Text": " the commercial pressures are centralized for efficiency. And the market forces now are"
    },
    {
      "Time_Start": 532.9,
      "Time_End": 539.22,
      "Text": " essentially creating pools of technology then. It's like an attractive nuisance. If you only"
    },
    {
      "Time_Start": 539.22,
      "Time_End": 544.02,
      "Text": " have to provide one subpoena to Gmail and you get half of the email accounts on the planet,"
    },
    {
      "Time_Start": 544.02,
      "Time_End": 550.1,
      "Text": " boy that's really convenient. But if you had to supply subpoenas to 50,000 email providers,"
    },
    {
      "Time_Start": 550.1,
      "Time_End": 556.14,
      "Text": " that's a pain in the ass. And so maybe it's not also political, it's a side effect. Or the"
    },
    {
      "Time_Start": 556.14,
      "Time_End": 560.4,
      "Text": " political side sees the market force and says, wow, this is great for us. Yeah, that"
    },
    {
      "Time_Start": 560.4,
      "Time_End": 565.48,
      "Text": " centralization is super scary. And the centralization is a choice made by people when"
    },
    {
      "Time_Start": 565.48,
      "Time_End": 570.4399999999999,
      "Text": " they're building their architecture to centralize the power or decentralize the power. And"
    },
    {
      "Time_Start": 570.4399999999999,
      "Time_End": 576.14,
      "Text": " that centralization, it's not just one email provider, it's not enough CDNs, not enough"
    },
    {
      "Time_Start": 576.14,
      "Time_End": 583.64,
      "Text": " undersea cables between continents, not enough app stores. Yeah, I mean, look, I think"
    },
    {
      "Time_Start": 583.64,
      "Time_End": 588.1,
      "Text": " decentralization is one area. But when you get beyond that, I think it's tough to draw that"
    },
    {
      "Time_Start": 588.1,
      "Time_End": 593.26,
      "Text": " line again and say, okay, you're right, but then how do you actually get to that next mile? And"
    },
    {
      "Time_Start": 593.26,
      "Time_End": 597.34,
      "Text": " look, this is not technology, it's policy, too. I remember having a conversation when I was at"
    },
    {
      "Time_Start": 597.34,
      "Time_End": 603.34,
      "Text": " the State Department with the Chinese and the cyber administration of China. And for some"
    },
    {
      "Time_Start": 603.34,
      "Time_End": 606.14,
      "Text": " reason we were talking about public private partnerships, which seems like a pretty good"
    },
    {
      "Time_Start": 606.14,
      "Time_End": 609.84,
      "Text": " thing, right, normally? And they said, oh, you're absolutely right, we need public private"
    },
    {
      "Time_Start": 609.84,
      "Time_End": 615.52,
      "Text": " partnerships because we can't monitor the Internet alone. We need their help. Not what I"
    },
    {
      "Time_Start": 615.52,
      "Time_End": 622.56,
      "Text": " had in mind. Just to pick up on that quickly, riffing off some work that my colleagues at the"
    },
    {
      "Time_Start": 622.56,
      "Time_End": 627.52,
      "Text": " State Department have done, if you look at censorship around the world right now, more than"
    },
    {
      "Time_Start": 627.52,
      "Time_End": 634.14,
      "Text": " two-thirds of the world's population is having their human rights on the Internet infringed"
    },
    {
      "Time_Start": 634.14,
      "Time_End": 641.02,
      "Text": " based on these repressive regimes surveilling them or censoring them on the Internet. And"
    },
    {
      "Time_Start": 641.02,
      "Time_End": 647.9399999999999,
      "Text": " they are spending billions of dollars to build out ecosystems that enable surveillance and"
    },
    {
      "Time_Start": 647.9399999999999,
      "Time_End": 653.9399999999999,
      "Text": " censorship at scale in real time. There is a clear push for ‑‑ I wouldn't ‑‑ I think I"
    },
    {
      "Time_Start": 657.4,
      "Time_End": 662.72,
      "Text": " would use the idea of centralization versus decentralization a little differently. The idea of"
    },
    {
      "Time_Start": 662.72,
      "Time_End": 669.6,
      "Text": " moving away from a free and global Internet to essentially a series of isolated networks of"
    },
    {
      "Time_Start": 669.64,
      "Time_End": 674.6,
      "Text": " censorship and surveillance that an individual repressive regime would want to run often"
    },
    {
      "Time_Start": 674.6,
      "Time_End": 679.72,
      "Text": " against their own citizens. And they would want it centralized in the sense that they want"
    },
    {
      "Time_Start": 679.72,
      "Time_End": 686.3000000000001,
      "Text": " the authority, but not centralized in the sense that there would be global interconnectivity"
    },
    {
      "Time_Start": 686.3000000000001,
      "Time_End": 691.14,
      "Text": " where they would have to reach out to a different central location to engage in their sort of"
    },
    {
      "Time_Start": 691.14,
      "Time_End": 691.84,
      "Text": " mass surveillance."
    },
    {
      "Time_Start": 691.84,
      "Time_End": 695.9200000000001,
      "Text": " And that's been going on for a while because Hillary Clinton when she was the Secretary of"
    },
    {
      "Time_Start": 695.92,
      "Time_End": 700.4599999999999,
      "Text": " State gave a speech launching the Freedom Online Coalition, a group of a lot of countries that"
    },
    {
      "Time_Start": 700.4599999999999,
      "Time_End": 704.9599999999999,
      "Text": " champion freedom online. And she talked about digital bubbles, authoritarian bubbles around"
    },
    {
      "Time_Start": 704.9599999999999,
      "Time_End": 709.92,
      "Text": " the world. And that's been accelerating I think since then. And that's, you know, again, it's"
    },
    {
      "Time_Start": 709.92,
      "Time_End": 714.3399999999999,
      "Text": " hard to stop that from happening. And we've gone from the promise of the Internet is the"
    },
    {
      "Time_Start": 714.3399999999999,
      "Time_End": 718.54,
      "Text": " greatest thing in the world, the greatest democratizing force in the world to it's also the"
    },
    {
      "Time_Start": 718.54,
      "Time_End": 722.16,
      "Text": " greatest way that repressive regimes, and not just repressive regimes, we'll get into this"
    },
    {
      "Time_Start": 722.16,
      "Time_End": 726.78,
      "Text": " later, can do things that are not great. And this includes monitoring and controlling their"
    },
    {
      "Time_Start": 726.78,
      "Time_End": 729.1999999999999,
      "Text": " citizenry in ways they haven't been able to before."
    },
    {
      "Time_Start": 729.1999999999999,
      "Time_End": 738.0,
      "Text": " Just one other thought on the centralization. The thing that really bothers me is we have no"
    },
    {
      "Time_Start": 738.0,
      "Time_End": 746.0,
      "Text": " plan B for, if Roger has heard me say this, we have no plan B for certificate authorities. So"
    },
    {
      "Time_Start": 746.72,
      "Time_End": 755.04,
      "Text": " if something goes wrong with TLS or certificate authority structure, there's no like we'll use"
    },
    {
      "Time_Start": 755.04,
      "Time_End": 761.38,
      "Text": " DNSSEC and we'll push out Dane, TLS records and then the web will keep going. There's no"
    },
    {
      "Time_Start": 761.38,
      "Time_End": 766.34,
      "Text": " agility. We're all in. And the browsers went away. All the browsers now have removed"
    },
    {
      "Time_Start": 766.34,
      "Time_End": 773.42,
      "Text": " support for Dane and TLS certificates. The only thing that's using it now are mail servers. So I"
    },
    {
      "Time_Start": 773.4200000000001,
      "Time_End": 780.3000000000001,
      "Text": " guess if the certificate authority system sort of collapses or is under attack or is subpoenaed"
    },
    {
      "Time_Start": 780.3000000000001,
      "Time_End": 786.5600000000001,
      "Text": " or let's encrypt blows up and that's 90 something percent of all certificates, if let's"
    },
    {
      "Time_Start": 786.5600000000001,
      "Time_End": 791.3000000000001,
      "Text": " encrypt goes down, we'll be able to change mail because mail servers use Dane but nobody else"
    },
    {
      "Time_Start": 791.3000000000001,
      "Time_End": 795.8000000000001,
      "Text": " will be able to browse the web. That really worries me that we have no backup plan and"
    },
    {
      "Time_Start": 795.8000000000001,
      "Time_End": 802.6,
      "Text": " governments know this and governments that want to suppress know. I just saw a takedown"
    },
    {
      "Time_Start": 802.6,
      "Time_End": 809.44,
      "Text": " against an onion domain name for I think a white supremacist website. The registrar in"
    },
    {
      "Time_Start": 809.44,
      "Time_End": 816.94,
      "Text": " Greece pulled the TLS certificate name for, that's going to be the start. I'm happy they did"
    },
    {
      "Time_Start": 816.94,
      "Time_End": 823.02,
      "Text": " that but I'm just saying that soon we'll be seeing subpoenas or takedowns on TLS certificates"
    },
    {
      "Time_Start": 823.02,
      "Time_End": 829.1800000000001,
      "Text": " and since browsers are now default, that is the gateway, right? And we don't have these"
    },
    {
      "Time_Start": 829.22,
      "Time_End": 835.4000000000001,
      "Text": " conversations and we build these technologies that now we have no agility so don't be"
    },
    {
      "Time_Start": 835.4000000000001,
      "Time_End": 841.4000000000001,
      "Text": " surprised when the world you describe happens. And so when I look at my Rolodex of who do I"
    },
    {
      "Time_Start": 844.72,
      "Time_End": 851.1400000000001,
      "Text": " call what's the backup plan, I get Roger. I don't get five Rogers, I get one Roger. There's one"
    },
    {
      "Time_Start": 851.1400000000001,
      "Time_End": 856.6400000000001,
      "Text": " option kind of and it's Tor and it's not perfect but we don't have a thriving ecosystem of"
    },
    {
      "Time_Start": 856.64,
      "Time_End": 862.64,
      "Text": " five Tors. That worries me. I want you to talk now about your unbounded adversaries."
    },
    {
      "Time_Start": 866.56,
      "Time_End": 872.26,
      "Text": " Yeah, so part of the reason why I am thinking about the policy side of things and it's fun to"
    },
    {
      "Time_Start": 872.26,
      "Time_End": 877.26,
      "Text": " have the balance here because we've got a policy person saying yeah, yeah, yeah, we've got"
    },
    {
      "Time_Start": 877.26,
      "Time_End": 880.9399999999999,
      "Text": " the policy stuff under control but if only you could build better tech for us then we'll be"
    },
    {
      "Time_Start": 880.94,
      "Time_End": 886.4000000000001,
      "Text": " able to keep people safe. And here I am the technology side saying yeah, yeah, yeah, we've"
    },
    {
      "Time_Start": 886.4000000000001,
      "Time_End": 891.0200000000001,
      "Text": " got tools and they work pretty well and millions of people are using them but if governments"
    },
    {
      "Time_Start": 891.0200000000001,
      "Time_End": 897.6400000000001,
      "Text": " are unbounded, if they're breaking their own laws, if they're attacking everything at will,"
    },
    {
      "Time_Start": 897.6400000000001,
      "Time_End": 902.98,
      "Text": " if they're putting billions of dollars into harming people, we can't solve this with technology"
    },
    {
      "Time_Start": 902.98,
      "Time_End": 910.1800000000001,
      "Text": " alone. Like in China, in the Uyghur province, if they end up sending a person to live in the"
    },
    {
      "Time_Start": 910.22,
      "Time_End": 918.22,
      "Text": " house of each of the families there, Tor is not going to be what they need. This is a social"
    },
    {
      "Time_Start": 918.22,
      "Time_End": 923.8000000000001,
      "Text": " problem, a political problem, a policy problem. So yeah, the reason why I'm thinking broader"
    },
    {
      "Time_Start": 923.8000000000001,
      "Time_End": 930.5200000000001,
      "Text": " than just the technology is increasingly we're seeing governments that do more than technical"
    },
    {
      "Time_Start": 930.5200000000001,
      "Time_End": 934.1800000000001,
      "Text": " attacks and we need to tackle that at every layer."
    },
    {
      "Time_Start": 934.1800000000001,
      "Time_End": 943.72,
      "Text": " This is your censorship implies surveillance model. Yes, so we used to think of this, so Tor"
    },
    {
      "Time_Start": 943.72,
      "Time_End": 950.0200000000001,
      "Text": " started as a way to let you browse the web more safely meaning metadata, communications"
    },
    {
      "Time_Start": 950.0200000000001,
      "Time_End": 955.6400000000001,
      "Text": " metadata protection so people watching you can't learn what you're doing and then it morphed"
    },
    {
      "Time_Start": 955.6400000000001,
      "Time_End": 960.84,
      "Text": " into a censorship resistance thing and the key to realize is they're actually the same thing."
    },
    {
      "Time_Start": 960.84,
      "Time_End": 966.84,
      "Text": " So when a government is censoring your internet connection, they start off by surveilling you"
    },
    {
      "Time_Start": 966.84,
      "Time_End": 972.34,
      "Text": " to learn who you are and what you're doing to decide whether to let you do it. So it's actually"
    },
    {
      "Time_Start": 972.34,
      "Time_End": 977.22,
      "Text": " two sides of the same coin. So if you're only thinking about censorship, you should be"
    },
    {
      "Time_Start": 977.22,
      "Time_End": 981.26,
      "Text": " thinking about surveillance. If you're thinking about surveillance, the next step to think"
    },
    {
      "Time_Start": 981.26,
      "Time_End": 988.0,
      "Text": " about is censorship. These are both two sides of the same issue and that leads me to also"
    },
    {
      "Time_Start": 988.0,
      "Time_End": 994.04,
      "Text": " think about end-to-end encryption and other attacks at the policy layer that are related"
    },
    {
      "Time_Start": 994.04,
      "Time_End": 1003.12,
      "Text": " to both censorship and surveillance. I think the issue is there's policy for liberal democracies"
    },
    {
      "Time_Start": 1003.12,
      "Time_End": 1007.54,
      "Text": " and there's policies for repressive regimes and it's much harder to change the policies"
    },
    {
      "Time_Start": 1007.54,
      "Time_End": 1014.08,
      "Text": " of repressive regimes. But there has been some good work. But if they're buying the"
    },
    {
      "Time_Start": 1014.2,
      "Time_End": 1018.58,
      "Text": " technology designed for a liberal democracy. That's what I was about to say. So I think there's"
    },
    {
      "Time_Start": 1018.58,
      "Time_End": 1022.7800000000001,
      "Text": " been some good work that's been done. For instance, the White House issued this anti-commercial"
    },
    {
      "Time_Start": 1022.7800000000001,
      "Time_End": 1028.78,
      "Text": " spyware executive order. Got ten countries initially. I think it's up to maybe 15 or so now"
    },
    {
      "Time_Start": 1028.78,
      "Time_End": 1032.7,
      "Text": " or maybe more than that countries have signed on to this. Now they're all the good people or"
    },
    {
      "Time_Start": 1032.7,
      "Time_End": 1037.24,
      "Text": " what we think of as more of the good people. But there are things you can do to exert"
    },
    {
      "Time_Start": 1037.24,
      "Time_End": 1042.32,
      "Text": " pressure on these more repressive countries. Maybe not China or Russia as easily, but a lot"
    },
    {
      "Time_Start": 1042.36,
      "Time_End": 1046.52,
      "Text": " of the countries in the middle where you can have an impact and you have to use the full suite"
    },
    {
      "Time_Start": 1046.52,
      "Time_End": 1049.98,
      "Text": " of policy tools you have. And that's not just cyber stuff. That's trade and other things you"
    },
    {
      "Time_Start": 1049.98,
      "Time_End": 1055.32,
      "Text": " can do. And I think there's been much more awareness and movement toward that recently. I"
    },
    {
      "Time_Start": 1055.32,
      "Time_End": 1059.4399999999998,
      "Text": " think the other problem, though, is we think of the world as binary. There's the bad guys and"
    },
    {
      "Time_Start": 1059.4399999999998,
      "Time_End": 1064.4399999999998,
      "Text": " the good guys. Even some of the good guys are starting to come down this path a little bit"
    },
    {
      "Time_Start": 1064.4399999999998,
      "Time_End": 1068.36,
      "Text": " because they're worried about terrorism. They're worried about misinformation and"
    },
    {
      "Time_Start": 1068.3600000000001,
      "Time_End": 1073.4,
      "Text": " disinformation. By the way, my suggestion to Jeff earlier was next year the"
    },
    {
      "Time_Start": 1073.4,
      "Time_End": 1079.2,
      "Text": " misinformation village should have the sign out in front of a different room. I think it would"
    },
    {
      "Time_Start": 1079.2,
      "Time_End": 1087.2,
      "Text": " be perfect. They did that when the Soviets invaded Prague. They changed all the street"
    },
    {
      "Time_Start": 1088.3200000000002,
      "Time_End": 1094.1200000000001,
      "Text": " signs. So it's good misinformation. So I think that the problem is you have to target the"
    },
    {
      "Time_Start": 1094.1200000000001,
      "Time_End": 1097.66,
      "Text": " repressive regimes, but you also have to think about liberal democracies and where they're"
    },
    {
      "Time_Start": 1097.66,
      "Time_End": 1101.74,
      "Text": " going and what path they're taking on these issues. And that involves the gnarly debate"
    },
    {
      "Time_Start": 1101.74,
      "Time_End": 1106.3200000000002,
      "Text": " around encryption and all these other things. But where can we make sure that we have the"
    },
    {
      "Time_Start": 1106.3200000000002,
      "Time_End": 1110.2,
      "Text": " kind of transparency rule of law and they're actually following the laws, as was said, too?"
    },
    {
      "Time_Start": 1110.2,
      "Time_End": 1116.5800000000002,
      "Text": " And that's not just an issue for the cyber community. That's an issue for the entire policy"
    },
    {
      "Time_Start": 1116.5800000000002,
      "Time_End": 1121.66,
      "Text": " community and all the tools that we might have that might change behavior."
    },
    {
      "Time_Start": 1121.66,
      "Time_End": 1125.3600000000001,
      "Text": " I largely agree with what everyone was saying. I think one of the things we're looking at in"
    },
    {
      "Time_Start": 1125.4,
      "Time_End": 1129.8600000000001,
      "Text": " the Office of the National Cyber Director is that question of what's the backup plan?"
    },
    {
      "Time_Start": 1129.8600000000001,
      "Time_End": 1136.2400000000002,
      "Text": " Because to some of these points, Tor is an excellent tool in certain instances. But if a"
    },
    {
      "Time_Start": 1136.2400000000002,
      "Time_End": 1141.44,
      "Text": " government sends some people with guns to the one cable landing site in a country and says"
    },
    {
      "Time_Start": 1141.44,
      "Time_End": 1147.2800000000002,
      "Text": " turn it off, Tor doesn't help you. So the question is what do you use when the censorship"
    },
    {
      "Time_Start": 1147.2800000000002,
      "Time_End": 1153.8200000000002,
      "Text": " model is a man comes in the room with a weapon? Or a complete internet shutdown. And there"
    },
    {
      "Time_Start": 1153.86,
      "Time_End": 1157.6599999999999,
      "Text": " will be things that we can do with technology. There will be things we can do with policy."
    },
    {
      "Time_Start": 1157.6599999999999,
      "Time_End": 1162.24,
      "Text": " And for us to have efficacious solutions, I think we have to work it together. That's part of"
    },
    {
      "Time_Start": 1162.24,
      "Time_End": 1164.98,
      "Text": " why we're here. I hope that's part of why we're talking about it. That's part of why there's"
    },
    {
      "Time_Start": 1164.98,
      "Time_End": 1170.2,
      "Text": " going to be a workshop later today to hear from you and to get and exchange ideas. But I"
    },
    {
      "Time_Start": 1170.2,
      "Time_End": 1175.02,
      "Text": " also think we need to think of this almost from a network stack sort of layer. To say if"
    },
    {
      "Time_Start": 1175.02,
      "Time_End": 1180.86,
      "Text": " someone is going after layer one to engage in censorship or surveillance, how do we ensure"
    },
    {
      "Time_Start": 1180.8600000000001,
      "Time_End": 1184.98,
      "Text": " that there's security at that layer? If people are targeting another layer of the stack, how"
    },
    {
      "Time_Start": 1184.98,
      "Time_End": 1187.7800000000002,
      "Text": " do we ensure there's appropriate security at each of those layers?"
    },
    {
      "Time_Start": 1187.7800000000002,
      "Time_End": 1193.9,
      "Text": " So I guess we didn't talk about this in the ready room. But maybe just talk about domain"
    },
    {
      "Time_Start": 1193.9,
      "Time_End": 1200.94,
      "Text": " fronting. Maybe first about why it's useful. But then why now it's people are not supporting"
    },
    {
      "Time_Start": 1200.94,
      "Time_End": 1207.2800000000002,
      "Text": " it. Right? Vendors are not. Google I think is stopping it. A lot of cloud providers don't"
    },
    {
      "Time_Start": 1207.28,
      "Time_End": 1212.8999999999999,
      "Text": " domain front anymore. And that's what signal messenger relied on for some protections. So"
    },
    {
      "Time_Start": 1212.8999999999999,
      "Time_End": 1220.8999999999999,
      "Text": " we're not a repressive regime so much. But again, market forces are making it harder. I'm"
    },
    {
      "Time_Start": 1220.8999999999999,
      "Time_End": 1222.28,
      "Text": " looking at you."
    },
    {
      "Time_Start": 1222.28,
      "Time_End": 1227.58,
      "Text": " Okay. So domain fronting is one of the tricks that we have at the technical level for"
    },
    {
      "Time_Start": 1227.58,
      "Time_End": 1233.04,
      "Text": " getting around censorship. And the way that it works is you find a cloud provider like Google"
    },
    {
      "Time_Start": 1233.04,
      "Time_End": 1239.72,
      "Text": " or Azure or cloud flare. And you do a TLS connection. And on the outside of the TLS"
    },
    {
      "Time_Start": 1239.72,
      "Time_End": 1244.96,
      "Text": " connection in the SNI field, you list a domain that they're not going to block. And then once"
    },
    {
      "Time_Start": 1244.96,
      "Time_End": 1250.04,
      "Text": " you've done the TLS connection, inside the encrypted channel, you do a host header for the"
    },
    {
      "Time_Start": 1250.04,
      "Time_End": 1254.26,
      "Text": " domain that you'd actually like to go to. And technically this is violating some sort of"
    },
    {
      "Time_Start": 1254.26,
      "Time_End": 1260.26,
      "Text": " spec somewhere in IETF land. But it works in most places. Until a few years ago when"
    },
    {
      "Time_Start": 1260.26,
      "Time_End": 1266.6,
      "Text": " Telegram was using it to get around blocking from Russia. And then Russia said, hey, Amazon,"
    },
    {
      "Time_Start": 1266.6,
      "Time_End": 1271.26,
      "Text": " could you quit that? And Amazon said, why, yes, Russia, we will turn that off. Thank you,"
    },
    {
      "Time_Start": 1271.26,
      "Time_End": 1276.4,
      "Text": " Russia. And so Amazon stopped it. They convinced Google to stop it. They convinced Microsoft"
    },
    {
      "Time_Start": 1276.4,
      "Time_End": 1280.02,
      "Text": " to stop it. But Microsoft said they were going to stop it. And then they didn't, which is"
    },
    {
      "Time_Start": 1280.02,
      "Time_End": 1286.64,
      "Text": " pretty cool of them. But they're eventually going to. So some CDNs allow it. But many of"
    },
    {
      "Time_Start": 1286.64,
      "Time_End": 1292.0600000000002,
      "Text": " them don't these days. And it's one of the better working tricks, though you have to pay"
    },
    {
      "Time_Start": 1292.0600000000002,
      "Time_End": 1297.8200000000002,
      "Text": " cloud prices for the bandwidth you send across it. So some circumvention tools like Tor use"
    },
    {
      "Time_Start": 1297.8200000000002,
      "Time_End": 1302.44,
      "Text": " domain fronting not for all of the traffic, but just for the signaling in order to have a"
    },
    {
      "Time_Start": 1302.44,
      "Time_End": 1307.18,
      "Text": " reliable channel to set things up. And then you fall back to some other channel. But yes,"
    },
    {
      "Time_Start": 1307.18,
      "Time_End": 1314.0200000000002,
      "Text": " it's a trick that is closing down as the western huge companies change their mind about"
    },
    {
      "Time_Start": 1314.02,
      "Time_End": 1320.6399999999999,
      "Text": " letting it work. Right. And so no fight in the U.N. necessary. Right? That's how much we"
    },
    {
      "Time_Start": 1320.6399999999999,
      "Time_End": 1329.52,
      "Text": " really we care about these technologies and the rights that they can support. Right? ITF is"
    },
    {
      "Time_Start": 1329.52,
      "Time_End": 1336.18,
      "Text": " not racing to formalize it into a thing to support the human rights aspect. It's just"
    },
    {
      "Time_Start": 1336.18,
      "Time_End": 1342.56,
      "Text": " disappointing. Although participating in a lot of U.N. negotiations, getting consensus,"
    },
    {
      "Time_Start": 1343.48,
      "Time_End": 1347.8799999999999,
      "Text": " consensus is near impossible because all those repressive regimes are there. And just for"
    },
    {
      "Time_Start": 1347.8799999999999,
      "Time_End": 1351.52,
      "Text": " people's awareness. It's not even brought up. We're not even saying is there a letter from the"
    },
    {
      "Time_Start": 1351.52,
      "Time_End": 1357.9199999999998,
      "Text": " White House saying, hey, Google, don't worry about it. We got your back. Right? Or some, I"
    },
    {
      "Time_Start": 1357.9199999999998,
      "Time_End": 1364.56,
      "Text": " don't know, 50 states attorneys general saying don't worry about it. We'll tell Russia to go"
    },
    {
      "Time_Start": 1364.56,
      "Time_End": 1370.6799999999998,
      "Text": " stuff themselves. No. There's not like a state or local tribal territory. There's nothing. And"
    },
    {
      "Time_Start": 1370.68,
      "Time_End": 1375.3,
      "Text": " I don't know if it's because these are kind of technical things and it just doesn't reach"
    },
    {
      "Time_Start": 1375.3,
      "Time_End": 1380.64,
      "Text": " awareness of policymakers or is it actually like they thought it through and said, no, that's"
    },
    {
      "Time_Start": 1380.64,
      "Time_End": 1385.64,
      "Text": " not worth a fight. I suspect it's part of that. I suspect that the policymakers just don't"
    },
    {
      "Time_Start": 1385.64,
      "Time_End": 1389.8400000000001,
      "Text": " understand the technology and what it's doing. I suspect part of it, too, is when you go to"
    },
    {
      "Time_Start": 1389.8400000000001,
      "Time_End": 1396.5,
      "Text": " the companies, look, they're there for profits. Right? But it's much easier now with Russia for"
    },
    {
      "Time_Start": 1396.5,
      "Time_End": 1400.22,
      "Text": " them to say no than it is for China. So we have to kind of come over that. We have to figure"
    },
    {
      "Time_Start": 1400.22,
      "Time_End": 1406.34,
      "Text": " out how to disincentivize that conduct or incentivize the good conduct. And part of it's"
    },
    {
      "Time_Start": 1406.34,
      "Time_End": 1409.6000000000001,
      "Text": " government, what governments can do, including our government, but if it's just our"
    },
    {
      "Time_Start": 1409.6000000000001,
      "Time_End": 1414.76,
      "Text": " government, that's not going to do it either. And just again for people's awareness, there's a"
    },
    {
      "Time_Start": 1414.76,
      "Time_End": 1419.26,
      "Text": " lot of discussions in the U.N. now on all these different issues. One is they're now"
    },
    {
      "Time_Start": 1419.26,
      "Time_End": 1424.76,
      "Text": " negotiating a cybercrime treaty, which is pretty far in the negotiations. And these issues,"
    },
    {
      "Time_Start": 1424.76,
      "Time_End": 1429.26,
      "Text": " the procedural issues of cybercrime and how you get evidence, some of these issues are"
    },
    {
      "Time_Start": 1429.26,
      "Time_End": 1433.34,
      "Text": " being covered. Not in this technical detail, which is part of the problem, I think. But, you"
    },
    {
      "Time_Start": 1433.34,
      "Time_End": 1438.26,
      "Text": " know, this may be a way to push the more repressive regimes to have more things that"
    },
    {
      "Time_Start": 1438.26,
      "Time_End": 1444.3799999999999,
      "Text": " allow them to do stuff or not. And so I think the West is very concerned about enabling"
    },
    {
      "Time_Start": 1444.3799999999999,
      "Time_End": 1448.46,
      "Text": " repressive regimes to get more access, but at the same time trying to get law enforcement"
    },
    {
      "Time_Start": 1448.46,
      "Time_End": 1453.34,
      "Text": " access. And that's a difficult issue. So, you know, this community, I think, should follow"
    },
    {
      "Time_Start": 1453.34,
      "Time_End": 1456.92,
      "Text": " those kinds of things and make sure that you're at least aware of what's going on. Just like"
    },
    {
      "Time_Start": 1456.92,
      "Time_End": 1462.42,
      "Text": " you should comment on the documents that you talked about."
    },
    {
      "Time_Start": 1462.42,
      "Time_End": 1467.66,
      "Text": " One thing that I'll add is, so in March, there was a big event in D.C., a summit for"
    },
    {
      "Time_Start": 1467.66,
      "Time_End": 1474.2,
      "Text": " democracy, where countries around the world came together. There was one before. This"
    },
    {
      "Time_Start": 1474.2,
      "Time_End": 1479.46,
      "Text": " year, one of the focuses included countering the authoritarian misuse of technology. And"
    },
    {
      "Time_Start": 1479.46,
      "Time_End": 1483.0800000000002,
      "Text": " there was a call to action to the private sector that went out. Now, that did not talk"
    },
    {
      "Time_Start": 1483.08,
      "Time_End": 1487.24,
      "Text": " about any one specific protocol. It talked about things that is sort of slightly higher"
    },
    {
      "Time_Start": 1487.24,
      "Time_End": 1494.24,
      "Text": " layer of abstraction for a lot of reasons. But certainly there's an administration interest"
    },
    {
      "Time_Start": 1494.24,
      "Time_End": 1498.4399999999998,
      "Text": " in exactly this. And you are seeing press coming from the White House saying, we need"
    },
    {
      "Time_Start": 1498.4399999999998,
      "Time_End": 1502.84,
      "Text": " to figure out ways to counter this. There was specific discussion of things like VPN"
    },
    {
      "Time_Start": 1502.84,
      "Time_End": 1508.86,
      "Text": " and ensuring VPN availability and that you could connect securely and safely to things"
    },
    {
      "Time_Start": 1508.8600000000001,
      "Time_End": 1514.5400000000002,
      "Text": " like VPNs, along with some other things sort of explicitly identified and then otherwise"
    },
    {
      "Time_Start": 1514.5400000000002,
      "Time_End": 1519.8600000000001,
      "Text": " an invitation to engage primarily with our colleagues at the State Department on how"
    },
    {
      "Time_Start": 1519.8600000000001,
      "Time_End": 1526.5000000000002,
      "Text": " you could do this and how you could work collaboratively with the government to ensure that people"
    },
    {
      "Time_Start": 1526.5000000000002,
      "Time_End": 1530.9,
      "Text": " did have freedom to access securely and safely the real Internet."
    },
    {
      "Time_Start": 1530.9,
      "Time_End": 1536.7,
      "Text": " Do you think the government then could use sort of the power of the purse to sort of"
    },
    {
      "Time_Start": 1536.7,
      "Time_End": 1544.7,
      "Text": " set priorities? So like your cloud provider, I don't know, is in alignment with Russia"
    },
    {
      "Time_Start": 1544.7,
      "Time_End": 1550.8600000000001,
      "Text": " proposal 123 for censorship. So we're not buying from you until you are not in alignment"
    },
    {
      "Time_Start": 1550.8600000000001,
      "Time_End": 1556.4,
      "Text": " with authoritarian censorship model 123. And if the cloud provider wants to have a seal on"
    },
    {
      "Time_Start": 1556.4,
      "Time_End": 1561.7,
      "Text": " their home page that says, look, we comply with the ‑‑ we're not censorship friendly, you"
    },
    {
      "Time_Start": 1561.7,
      "Time_End": 1566.6200000000001,
      "Text": " know what I mean? It doesn't have to always be a policy. It can be a choice. It can be a"
    },
    {
      "Time_Start": 1566.6200000000001,
      "Time_End": 1571.1200000000001,
      "Text": " labeling regime. It can be a way of the government saying, hey, we only buy from, you know,"
    },
    {
      "Time_Start": 1571.1200000000001,
      "Time_End": 1576.94,
      "Text": " green energy providers. I don't feel like I have a fully established answer, but I'll say"
    },
    {
      "Time_Start": 1576.94,
      "Time_End": 1581.6200000000001,
      "Text": " microcosm of this that I think is pertinent does circle back to that executive order about"
    },
    {
      "Time_Start": 1581.6200000000001,
      "Time_End": 1586.2800000000002,
      "Text": " commercial spyware and certain commercial spyware entities that were taking actions that"
    },
    {
      "Time_Start": 1586.2800000000002,
      "Time_End": 1592.24,
      "Text": " were viewed as problematic, really divergent from our interest, enabling things like the"
    },
    {
      "Time_Start": 1592.24,
      "Time_End": 1597.52,
      "Text": " surveillance of journalists or dissidents. And the administration pushed out this"
    },
    {
      "Time_Start": 1597.52,
      "Time_End": 1603.24,
      "Text": " executive order saying, hey, we're no longer going to be using these technologies that"
    },
    {
      "Time_Start": 1603.24,
      "Time_End": 1607.9,
      "Text": " pose a national security risk, that pose these sort of broader risks to us. And I think"
    },
    {
      "Time_Start": 1607.9,
      "Time_End": 1613.86,
      "Text": " that is perhaps an example of this power of the purse of saying we're no longer playing"
    },
    {
      "Time_Start": 1613.86,
      "Time_End": 1619.86,
      "Text": " with these entities. And it was followed up with sort of more discreetly with some entity"
    },
    {
      "Time_Start": 1619.9,
      "Time_End": 1625.5600000000002,
      "Text": " listings. So the Department of Commerce labels certain entities making it very hard for"
    },
    {
      "Time_Start": 1625.5600000000002,
      "Time_End": 1630.6000000000001,
      "Text": " them to do business. That ends up being sort of export restrictions and really just sort of"
    },
    {
      "Time_Start": 1630.6000000000001,
      "Time_End": 1635.5600000000002,
      "Text": " gums up a business. The combined entities list or what do they call it now? It used to be"
    },
    {
      "Time_Start": 1635.5600000000002,
      "Time_End": 1641.5200000000002,
      "Text": " you had to watch two or three different lists to see if you were having a personal felony."
    },
    {
      "Time_Start": 1641.5200000000002,
      "Time_End": 1647.5200000000002,
      "Text": " Now there's a combined list, I think. I think that's right. Yeah. But your idea is that"
    },
    {
      "Time_Start": 1650.6000000000001,
      "Time_End": 1655.1000000000001,
      "Text": " there's two questions about this sort of labeling thing. The federal government just"
    },
    {
      "Time_Start": 1655.1000000000001,
      "Time_End": 1659.8600000000001,
      "Text": " recently, we've been talking about this for 30 years, maybe 20 years, moved this idea of"
    },
    {
      "Time_Start": 1659.8600000000001,
      "Time_End": 1665.48,
      "Text": " maybe a good housekeeping seal of approval for cyber security. Singapore has done that."
    },
    {
      "Time_Start": 1665.48,
      "Time_End": 1670.1000000000001,
      "Text": " It's happened in other parts of the world. The EU has an act. And the U.S. is moving"
    },
    {
      "Time_Start": 1670.1000000000001,
      "Time_End": 1673.8600000000001,
      "Text": " forward and there's been legislation and other things. So that may be a way to deal with"
    },
    {
      "Time_Start": 1673.8600000000001,
      "Time_End": 1679.1000000000001,
      "Text": " it. But I wonder how much that's going to actually affect the market. Are people going to"
    },
    {
      "Time_Start": 1679.1000000000001,
      "Time_End": 1683.22,
      "Text": " outside of a smaller group of people, are they going to value software more because they"
    },
    {
      "Time_Start": 1683.22,
      "Time_End": 1686.72,
      "Text": " say we're human rights compliant? Hopefully they would. I would hope they would. It's more"
    },
    {
      "Time_Start": 1686.72,
      "Time_End": 1692.3400000000001,
      "Text": " about signaling the values of the government. And look, no authoritarian cloud provider has"
    },
    {
      "Time_Start": 1692.3400000000001,
      "Time_End": 1698.42,
      "Text": " that seal. What a shocker. You've got to draw some bright lines between the difference"
    },
    {
      "Time_Start": 1698.42,
      "Time_End": 1702.96,
      "Text": " between team rule of law and team authoritarian. Because if you don't, they're just going to"
    },
    {
      "Time_Start": 1702.96,
      "Time_End": 1707.0600000000002,
      "Text": " be bled together. They're all sitting in the same room in the IETF. They're all sitting in"
    },
    {
      "Time_Start": 1707.06,
      "Time_End": 1712.8799999999999,
      "Text": " the same room wherever. They're all whistling when they have standards. So you need a way to"
    },
    {
      "Time_Start": 1712.8799999999999,
      "Time_End": 1719.46,
      "Text": " say look how we are different. I think labeling is an important step here. But more and more"
    },
    {
      "Time_Start": 1719.46,
      "Time_End": 1725.9199999999998,
      "Text": " we're seeing a shift in how the arms race goes. So it used to be western companies sell"
    },
    {
      "Time_Start": 1725.9199999999998,
      "Time_End": 1731.8799999999999,
      "Text": " deep packet inspection tools to repressive regimes and they use them to harm their citizens."
    },
    {
      "Time_Start": 1732.88,
      "Time_End": 1737.5400000000002,
      "Text": " So it would be a technology like they look for this header, we change it to this and go back and"
    },
    {
      "Time_Start": 1737.5400000000002,
      "Time_End": 1742.2,
      "Text": " forth. But here are two examples that we've seen recently where we're shifting how the arms"
    },
    {
      "Time_Start": 1742.2,
      "Time_End": 1747.1200000000001,
      "Text": " race goes. One of them is in Turkmenistan over the past few months. So the ministry of"
    },
    {
      "Time_Start": 1747.1200000000001,
      "Time_End": 1753.42,
      "Text": " censorship in Turkmenistan is basically block listing the whole internet. They block"
    },
    {
      "Time_Start": 1753.42,
      "Time_End": 1760.42,
      "Text": " Fastly, they block Cloudflare, they block Akamai, they block most hosting providers. So"
    },
    {
      "Time_Start": 1760.46,
      "Time_End": 1765.3400000000001,
      "Text": " we've been running some tour bridges on residential IP addresses and it kind of works sort of."
    },
    {
      "Time_Start": 1765.3400000000001,
      "Time_End": 1770.8400000000001,
      "Text": " But it turns out that they're taking bribes to unblock certain people in Turkmenistan. So if"
    },
    {
      "Time_Start": 1770.8400000000001,
      "Time_End": 1776.0,
      "Text": " you're a company or whatever, you pay them $1,000 U.S. and now you get real internet. So this"
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1779.88,
      "Text": " is not something I can solve at a technical level. Another challenge that we're seeing in"
    },
    {
      "Time_Start": 1779.88,
      "Time_End": 1786.0800000000002,
      "Text": " China recently, it is not, so China has a policy to censor the internet, sure. But they also"
    },
    {
      "Time_Start": 1786.12,
      "Time_End": 1793.12,
      "Text": " have accidental like economic byproducts of how they're growing. So there you are in"
    },
    {
      "Time_Start": 1793.12,
      "Time_End": 1798.0,
      "Text": " China. You want to use a website in China. Everybody wants to do that. So they buy more"
    },
    {
      "Time_Start": 1798.0,
      "Time_End": 1801.96,
      "Text": " bandwidth, they make the pipes bigger, they make the bandwidth inside China really good. But"
    },
    {
      "Time_Start": 1801.96,
      "Time_End": 1806.3799999999999,
      "Text": " nobody's adding pipes from China to the rest of the world. And that means that if you're in"
    },
    {
      "Time_Start": 1806.3799999999999,
      "Time_End": 1811.46,
      "Text": " China trying to get to Google, even if they didn't explicitly block it, you've got 15% packet"
    },
    {
      "Time_Start": 1811.46,
      "Time_End": 1817.08,
      "Text": " loss because too many people are trying to use too small pipes. And for economic reasons,"
    },
    {
      "Time_Start": 1817.08,
      "Time_End": 1822.58,
      "Text": " they're not bothering to add that bandwidth. So that's a case where it doesn't matter what"
    },
    {
      "Time_Start": 1822.58,
      "Time_End": 1827.54,
      "Text": " code I write. There's not enough bandwidth for people to do what they're trying to do. And"
    },
    {
      "Time_Start": 1827.54,
      "Time_End": 1835.54,
      "Text": " that goes back to the economic challenge. There was sort of a comment maybe, or maybe we can"
    },
    {
      "Time_Start": 1835.54,
      "Time_End": 1840.5,
      "Text": " look at it just briefly from the other lens. Who are the people that are being censored?"
    },
    {
      "Time_Start": 1840.5,
      "Time_End": 1845.5,
      "Text": " Because when we say that, we don't necessarily mean bad guys. What are these people just"
    },
    {
      "Time_Start": 1845.5,
      "Time_End": 1850.34,
      "Text": " exploring the Internet and the regimes are afraid they're going to learn about equal rights or"
    },
    {
      "Time_Start": 1850.34,
      "Time_End": 1855.3,
      "Text": " something? What is the danger in these conversations you're having that justify this"
    },
    {
      "Time_Start": 1855.3,
      "Time_End": 1861.84,
      "Text": " level of intervention and billions of dollars spent? What is the fear? I mean, there are"
    },
    {
      "Time_Start": 1861.84,
      "Time_End": 1865.8,
      "Text": " lots of vulnerable groups. And depending on the country, they could be religious groups or"
    },
    {
      "Time_Start": 1865.8,
      "Time_End": 1870.08,
      "Text": " often political groups that are being targeted. Back to what you said about the State"
    },
    {
      "Time_Start": 1870.12,
      "Time_End": 1873.9199999999998,
      "Text": " Department, part of the State Department, the Democracy and Human Rights Bureau has for a"
    },
    {
      "Time_Start": 1873.9199999999998,
      "Time_End": 1878.74,
      "Text": " long time funded a lot of projects, including yours, among others, to try to get around"
    },
    {
      "Time_Start": 1878.74,
      "Time_End": 1885.8799999999999,
      "Text": " censorship. And it is kind of country specific, but it's not just, you know, a lot of the"
    },
    {
      "Time_Start": 1885.8799999999999,
      "Time_End": 1889.6599999999999,
      "Text": " countries don't have the capability or the bandwidth to censor everything or to look at"
    },
    {
      "Time_Start": 1889.6599999999999,
      "Time_End": 1895.3799999999999,
      "Text": " everything. China may be a little different. So they target a lot of these groups who they"
    },
    {
      "Time_Start": 1895.38,
      "Time_End": 1900.14,
      "Text": " view as threats to their own political stability often. And those are the groups that are"
    },
    {
      "Time_Start": 1900.14,
      "Time_End": 1904.7600000000002,
      "Text": " most at risk. But not only those. I mean, it could be LGBT. There's a whole wide range of"
    },
    {
      "Time_Start": 1904.7600000000002,
      "Time_End": 1909.72,
      "Text": " groups, depending on the country, depending on the authoritarian regime you're in, that are"
    },
    {
      "Time_Start": 1909.72,
      "Time_End": 1916.2600000000002,
      "Text": " targeted. And, you know, people ‑‑ But they don't justify it that way. They justify it"
    },
    {
      "Time_Start": 1916.2600000000002,
      "Time_End": 1920.6000000000001,
      "Text": " using ‑‑ They justify it on the basis of security. It's the security of the state. That's"
    },
    {
      "Time_Start": 1920.6000000000001,
      "Time_End": 1924.88,
      "Text": " the overarching justification. One of the things they thought was a big advance at the"
    },
    {
      "Time_Start": 1924.88,
      "Time_End": 1929.42,
      "Text": " State Department when I was there, and it's continued in the new bureau they created, is to"
    },
    {
      "Time_Start": 1929.42,
      "Time_End": 1933.7600000000002,
      "Text": " integrate human rights with security. And a lot of times when we go to other countries and"
    },
    {
      "Time_Start": 1933.7600000000002,
      "Time_End": 1937.2600000000002,
      "Text": " talk about cybersecurity, they say, oh, that's great. That's a way for us now to control our"
    },
    {
      "Time_Start": 1937.2600000000002,
      "Time_End": 1940.7600000000002,
      "Text": " citizens. No, no, no. You have to think about the human rights aspect and you have to look at"
    },
    {
      "Time_Start": 1940.7600000000002,
      "Time_End": 1947.0600000000002,
      "Text": " them together rather than in silos. So, yeah, you know, I think it's ‑‑ And again, it goes"
    },
    {
      "Time_Start": 1947.0600000000002,
      "Time_End": 1951.38,
      "Text": " back to the point of, like, well, how do you change that? You can change it by using the"
    },
    {
      "Time_Start": 1951.38,
      "Time_End": 1955.8400000000001,
      "Text": " tools you have, economic and other tools, to try to change that country's view. Because"
    },
    {
      "Time_Start": 1955.8400000000001,
      "Time_End": 1960.68,
      "Text": " basically the regime that's in power kind of likes to stay in power. And so it's hard to tell"
    },
    {
      "Time_Start": 1960.68,
      "Time_End": 1965.7600000000002,
      "Text": " them don't do that. Because they're going to do it anyway. And so how can you exert pressure?"
    },
    {
      "Time_Start": 1965.7600000000002,
      "Time_End": 1969.3400000000001,
      "Text": " And some of it's commercial pressure. Some of it's not just governments but companies, too. As"
    },
    {
      "Time_Start": 1969.3400000000001,
      "Time_End": 1975.3000000000002,
      "Text": " we've seen with Russia. Yeah, so in our experience, it isn't that the censorship ministry"
    },
    {
      "Time_Start": 1975.3000000000002,
      "Time_End": 1980.72,
      "Text": " sits down and makes categories and goes to find websites that match the categories. It's more"
    },
    {
      "Time_Start": 1980.72,
      "Time_End": 1986.56,
      "Text": " about the job of the censorship ministry is to never get noticed by the authoritarian"
    },
    {
      "Time_Start": 1986.56,
      "Time_End": 1993.52,
      "Text": " leaders in charge. So every time something goes wrong, they're embarrassing the head dude. And"
    },
    {
      "Time_Start": 1993.52,
      "Time_End": 1997.8,
      "Text": " they need to react and start blocking the things that are embarrassing at that time. So it"
    },
    {
      "Time_Start": 1997.8,
      "Time_End": 2003.88,
      "Text": " grows organically where maybe some particular activity is in the news and then they have to"
    },
    {
      "Time_Start": 2003.88,
      "Time_End": 2009.48,
      "Text": " shut that down. And this same pattern happens not only in China where they have to guess what"
    },
    {
      "Time_Start": 2009.52,
      "Time_End": 2015.78,
      "Text": " they should try to block next. But it also ends up happening in Denmark and Australia and"
    },
    {
      "Time_Start": 2015.78,
      "Time_End": 2020.9,
      "Text": " Sweden and so on where they don't have a censorship ministry but whatever they call their"
    },
    {
      "Time_Start": 2020.9,
      "Time_End": 2027.52,
      "Text": " online security group ends up deciding that they need to block Pirate Bay or wherever it"
    },
    {
      "Time_Start": 2027.52,
      "Time_End": 2033.6,
      "Text": " starts. And then it bleeds into blocking more things based on reacting to whatever is"
    },
    {
      "Time_Start": 2033.6,
      "Time_End": 2038.02,
      "Text": " politically embarrassing at the time. But it's also the multiplying effect of not just the"
    },
    {
      "Time_Start": 2038.06,
      "Time_End": 2043.1399999999999,
      "Text": " state doing it, but creating policies that are so vague that the companies, the ISPs and"
    },
    {
      "Time_Start": 2043.1399999999999,
      "Time_End": 2047.36,
      "Text": " the others, and this is what China does, doesn't know where the line is so they overenforce."
    },
    {
      "Time_Start": 2047.36,
      "Time_End": 2051.44,
      "Text": " They go further than they need to do and it's even worse. And the state is fine with that"
    },
    {
      "Time_Start": 2051.44,
      "Time_End": 2054.44,
      "Text": " because they're like overenforcement is better than underenforcement."
    },
    {
      "Time_Start": 2054.44,
      "Time_End": 2064.44,
      "Text": " So then how do we, going forward then, I guess in your sort of utopian vision, give me a"
    },
    {
      "Time_Start": 2064.44,
      "Time_End": 2069.56,
      "Text": " where are we at in five years? Where are we at in ten years? I mean, if the team rule of"
    },
    {
      "Time_Start": 2069.56,
      "Time_End": 2075.06,
      "Text": " law undecided and authoritarian, if this continues to sort of metastasize, do we have sort"
    },
    {
      "Time_Start": 2075.06,
      "Time_End": 2081.56,
      "Text": " of, what, three buckets of the internet? Your model of where does this leave us? Because"
    },
    {
      "Time_Start": 2081.56,
      "Time_End": 2087.02,
      "Text": " what I don't see is any forces that are, oh, everybody is going to have to use the exact"
    },
    {
      "Time_Start": 2087.02,
      "Time_End": 2093.94,
      "Text": " same technology with no censorship built in. That's not a thing. So that means censorship"
    },
    {
      "Time_Start": 2093.94,
      "Time_End": 2100.94,
      "Text": " will continue to evolve and so it's important that we have policies to either make"
    },
    {
      "Time_Start": 2100.94,
      "Time_End": 2105.4,
      "Text": " technology instead of being neutral, let's make the technology, at least if the federal"
    },
    {
      "Time_Start": 2105.4,
      "Time_End": 2109.94,
      "Text": " government is going to buy it, it has a bias toward good, whatever good values are. It's"
    },
    {
      "Time_Start": 2109.94,
      "Time_End": 2117.86,
      "Text": " transparent or accountable. So maybe one side we have to shift the bias toward good"
    },
    {
      "Time_Start": 2117.86,
      "Time_End": 2122.98,
      "Text": " because we know the bad is going to continue. So when you look in your crystal ball, tell"
    },
    {
      "Time_Start": 2122.98,
      "Time_End": 2130.02,
      "Text": " me what you see. Do you want to start? Yeah, so I don't have as much optimism as Jeff"
    },
    {
      "Time_Start": 2130.02,
      "Time_End": 2136.6,
      "Text": " hopes I do. I'll bring you a bit more pessimism. So the Iran thing that I've been"
    },
    {
      "Time_Start": 2136.6,
      "Time_End": 2141.32,
      "Text": " watching, so Iran's goal is to build a halal internet. They want to isolate themselves, they"
    },
    {
      "Time_Start": 2141.32,
      "Time_End": 2145.56,
      "Text": " want to cut off all the outside internet connections and to do that they need their own"
    },
    {
      "Time_Start": 2145.56,
      "Time_End": 2149.86,
      "Text": " Facebook, they need their own Google, Gmail, their own everything. And they're not big"
    },
    {
      "Time_Start": 2149.86,
      "Time_End": 2155.02,
      "Text": " enough as a country, as an ecosystem, as a software ecosystem to have that. But it gets"
    },
    {
      "Time_Start": 2155.02,
      "Time_End": 2159.94,
      "Text": " worse than that. So for a while they would block Gmail and everybody in Iran would say"
    },
    {
      "Time_Start": 2159.94,
      "Time_End": 2166.28,
      "Text": " screw you, you block Gmail, I don't like you, stop blocking. And then a previous"
    },
    {
      "Time_Start": 2166.28,
      "Time_End": 2171.48,
      "Text": " administration in the U.S. called up Google and said hey, can you like sanction Iran, can"
    },
    {
      "Time_Start": 2171.48,
      "Time_End": 2175.94,
      "Text": " you like turn off all the Gmail accounts for people who speak Farsi? Anybody coming from"
    },
    {
      "Time_Start": 2175.94,
      "Time_End": 2180.6,
      "Text": " Iran, just shut them off. And that means that when people in Iran tried to get to their"
    },
    {
      "Time_Start": 2180.6,
      "Time_End": 2187.02,
      "Text": " Gmail, Google was the one that blocked them. And that was a sanction, but the result was it's"
    },
    {
      "Time_Start": 2187.02,
      "Time_End": 2193.06,
      "Text": " easier for Iran to end up with their isolated halal internet because there's nobody"
    },
    {
      "Time_Start": 2193.06,
      "Time_End": 2197.4,
      "Text": " complaining anymore. You blame Google for trying to turn off your Gmail account. You don't"
    },
    {
      "Time_Start": 2197.4,
      "Time_End": 2201.86,
      "Text": " blame your own government anymore. And we're seeing the same thing in Russia where various"
    },
    {
      "Time_Start": 2201.86,
      "Time_End": 2206.44,
      "Text": " telecommunication providers in the west are like we're going to sanction Russia, we're turning"
    },
    {
      "Time_Start": 2206.44,
      "Time_End": 2210.52,
      "Text": " off their telephone connections, we're turning off their ISP, their internet connections,"
    },
    {
      "Time_Start": 2210.52,
      "Time_End": 2215.7400000000002,
      "Text": " that'll show them, they'll have to stop the war now. And the result is that they're letting"
    },
    {
      "Time_Start": 2215.7400000000002,
      "Time_End": 2220.9,
      "Text": " Russia isolate itself in the same way. So are we going to end up with one amazing internet"
    },
    {
      "Time_Start": 2220.9,
      "Time_End": 2226.36,
      "Text": " that everybody's on? Or are we going to end up with each of these countries, China's doing great"
    },
    {
      "Time_Start": 2226.36,
      "Time_End": 2230.94,
      "Text": " at not building the rest of the bandwidth for people to get to the rest of the internet."
    },
    {
      "Time_Start": 2230.94,
      "Time_End": 2235.9,
      "Text": " Russia is going to try to isolate itself. Iran is excited to do so. They haven't succeeded"
    },
    {
      "Time_Start": 2235.9,
      "Time_End": 2241.68,
      "Text": " yet. So that's where we're going unless we figure out something at the not only technical"
    },
    {
      "Time_Start": 2241.68,
      "Time_End": 2248.02,
      "Text": " level to fix it. So I'm a recovering lawyer, so I'm usually a glass half full sort of person."
    },
    {
      "Time_Start": 2248.02,
      "Time_End": 2253.48,
      "Text": " But I think there's some good signs and bad signs. I agree with everything you said. If you"
    },
    {
      "Time_Start": 2253.48,
      "Time_End": 2259.44,
      "Text": " also look at the Freedom House report, it reports every year on the state of freedom on the"
    },
    {
      "Time_Start": 2259.44,
      "Time_End": 2262.9,
      "Text": " internet. And it's gotten progressively worse and continues to get worse. So that's not a"
    },
    {
      "Time_Start": 2262.9,
      "Time_End": 2269.44,
      "Text": " great sign. And I do think there's more and more countries who are turning to this more,"
    },
    {
      "Time_Start": 2269.44,
      "Time_End": 2276.2400000000002,
      "Text": " you know, there's also a lot of political churn where more right wing parties are winning"
    },
    {
      "Time_Start": 2276.2400000000002,
      "Time_End": 2281.9,
      "Text": " larger and they're more disposed, predisposed toward this kind of activity. So that's not good"
    },
    {
      "Time_Start": 2281.9,
      "Time_End": 2286.7400000000002,
      "Text": " either. And I do think you're seeing this kind of balkanization, which I wasn't allowed to use"
    },
    {
      "Time_Start": 2286.7400000000002,
      "Time_End": 2293.36,
      "Text": " that word state because I could say splinter net at the time. You're seeing this happen. I"
    },
    {
      "Time_Start": 2293.36,
      "Time_End": 2298.44,
      "Text": " think that's going to accelerate, too. The good things, though, the positive things, I think"
    },
    {
      "Time_Start": 2298.44,
      "Time_End": 2305.1600000000003,
      "Text": " there's more awareness of this trend now. I think there's more desire and ability and actual"
    },
    {
      "Time_Start": 2305.1600000000003,
      "Time_End": 2311.4,
      "Text": " political will to use tools that we wouldn't use before to try to counteract this. And that's"
    },
    {
      "Time_Start": 2311.44,
      "Time_End": 2316.48,
      "Text": " true both with cyber threats but also with these threats as well. I'm really heartened by the"
    },
    {
      "Time_Start": 2316.48,
      "Time_End": 2321.14,
      "Text": " executive order on commercial spyware. I'm heartened by the fact that a lot of countries"
    },
    {
      "Time_Start": 2321.14,
      "Time_End": 2324.28,
      "Text": " signed on to that. I'm heartened by the fact that a lot of those countries said we're going to"
    },
    {
      "Time_Start": 2324.28,
      "Time_End": 2328.2400000000002,
      "Text": " work together to promote this. When I go to these negotiations with the U.N. on the cyber"
    },
    {
      "Time_Start": 2328.2400000000002,
      "Time_End": 2331.86,
      "Text": " crime treaty, I'm heartened that there are lots of countries who are banding together and"
    },
    {
      "Time_Start": 2331.86,
      "Time_End": 2336.2400000000002,
      "Text": " saying human rights has to be a core part of this treaty. Now, there's other countries that say"
    },
    {
      "Time_Start": 2336.2400000000002,
      "Time_End": 2339.7400000000002,
      "Text": " no, enough with the human rights already. But it's good that you have these countries do that"
    },
    {
      "Time_Start": 2339.78,
      "Time_End": 2343.5400000000004,
      "Text": " because if it's a process where these countries are strong enough in pushing back, you're not"
    },
    {
      "Time_Start": 2343.5400000000004,
      "Time_End": 2349.36,
      "Text": " going to get the kind of repressive language and instrument that's global. But I acknowledge the"
    },
    {
      "Time_Start": 2349.36,
      "Time_End": 2355.7000000000003,
      "Text": " challenges. I wish it was going to get better. I think it's got a long way to go before we get"
    },
    {
      "Time_Start": 2355.7000000000003,
      "Time_End": 2359.32,
      "Text": " there. But I do think there's more policy awareness than there ever has been. And so that"
    },
    {
      "Time_Start": 2359.32,
      "Time_End": 2361.32,
      "Text": " will help."
    },
    {
      "Time_Start": 2361.32,
      "Time_End": 2366.2000000000003,
      "Text": " It's definitely going to be hard. There's no doubting that it's going to be hard. But I think"
    },
    {
      "Time_Start": 2366.2000000000003,
      "Time_End": 2371.28,
      "Text": " it's important that we start with the vision for where we want to go and that we aggressively"
    },
    {
      "Time_Start": 2371.28,
      "Time_End": 2375.6600000000003,
      "Text": " try to move towards that. And I think you're seeing some of that. The executive order, the"
    },
    {
      "Time_Start": 2375.6600000000003,
      "Time_End": 2380.82,
      "Text": " national cybersecurity strategy, if you just look at the introduction from President Biden, it"
    },
    {
      "Time_Start": 2380.82,
      "Time_End": 2385.32,
      "Text": " talks about this idea of an affirmative vision where everyone has access to this open, free,"
    },
    {
      "Time_Start": 2385.32,
      "Time_End": 2391.5400000000004,
      "Text": " secure Internet. You're seeing from the Summit for Democracy to all of these interactions in"
    },
    {
      "Time_Start": 2391.54,
      "Time_End": 2397.32,
      "Text": " the United States and with a cluster of allies around the world, a push towards saying, hold"
    },
    {
      "Time_Start": 2397.32,
      "Time_End": 2402.16,
      "Text": " on, we're realizing this is a big problem. We're seeing the trend line is in the wrong direction."
    },
    {
      "Time_Start": 2402.16,
      "Time_End": 2406.7,
      "Text": " And we need to do something as a government. We need to do something in partnership with the"
    },
    {
      "Time_Start": 2406.7,
      "Time_End": 2410.66,
      "Text": " people making the technology to stop it and reverse it."
    },
    {
      "Time_Start": 2410.66,
      "Time_End": 2415.12,
      "Text": " So, okay, I want to go back to something you said."
    },
    {
      "Time_Start": 2415.12,
      "Time_End": 2420.5,
      "Text": " One of the problems is if you try to restrict those countries, you're absolutely right. They"
    },
    {
      "Time_Start": 2420.5,
      "Time_End": 2424.5,
      "Text": " develop their own capability. They become more isolated. And that's true with the technology"
    },
    {
      "Time_Start": 2424.5,
      "Time_End": 2429.54,
      "Text": " generally. We've seen this with chips and other things where China is now developing this"
    },
    {
      "Time_Start": 2429.54,
      "Time_End": 2433.34,
      "Text": " stuff because they can't get it. So you have to figure out where that balance is and how you can"
    },
    {
      "Time_Start": 2433.34,
      "Time_End": 2434.5,
      "Text": " influence it."
    },
    {
      "Time_Start": 2434.5,
      "Time_End": 2440.74,
      "Text": " So you mentioned something about, oh, no, I'm totally forgetting it. What in the world? So the"
    },
    {
      "Time_Start": 2440.74,
      "Time_End": 2446.28,
      "Text": " companies are essentially saying, oh, we'll just disconnect Russia. We want to make life more"
    },
    {
      "Time_Start": 2446.32,
      "Time_End": 2450.9,
      "Text": " miserable for them. And partially that's because there's no kind of coordinated message from the"
    },
    {
      "Time_Start": 2450.9,
      "Time_End": 2456.32,
      "Text": " government saying, okay, IT providers, please help us block. They're doing it a lot of times"
    },
    {
      "Time_Start": 2456.32,
      "Time_End": 2461.28,
      "Text": " because they think it's the right thing. And so it seems like maybe there's a role for"
    },
    {
      "Time_Start": 2461.28,
      "Time_End": 2466.52,
      "Text": " government to say, no, we need very specific targeting against sanctioned individuals, not all"
    },
    {
      "Time_Start": 2466.52,
      "Time_End": 2471.86,
      "Text": " of us telecom, we just need to do it in these sort of net blocks or, you know, not the"
    },
    {
      "Time_Start": 2471.9,
      "Time_End": 2477.9,
      "Text": " education ministry or whatever, but the arms ministry. And so does it just mean you're going to"
    },
    {
      "Time_Start": 2477.9,
      "Time_End": 2484.02,
      "Text": " have to get more precise? Because the alternative is a giant blunt block or..."
    },
    {
      "Time_Start": 2484.02,
      "Time_End": 2490.1400000000003,
      "Text": " Yes, I know this isn't a perfectly satisfactory answer, but I think this is hitting on this"
    },
    {
      "Time_Start": 2490.1400000000003,
      "Time_End": 2495.36,
      "Text": " really important topic of how the government message is when we might want something"
    },
    {
      "Time_Start": 2495.36,
      "Time_End": 2500.32,
      "Text": " blocked or when we might want something enabled, even if that's counterintuitive to a"
    },
    {
      "Time_Start": 2500.32,
      "Time_End": 2505.56,
      "Text": " business. And so later this afternoon, you all here at DEF CON, the policy space, there's a"
    },
    {
      "Time_Start": 2505.56,
      "Time_End": 2510.52,
      "Text": " workshop. State department is going to be there along with ONCD, along with Roger and some"
    },
    {
      "Time_Start": 2510.52,
      "Time_End": 2516.44,
      "Text": " others, and we're going to be able to talk about that when there aren't cameras in some more"
    },
    {
      "Time_Start": 2516.44,
      "Time_End": 2520.94,
      "Text": " detail. And so I would encourage those of you who are interested in this very particular topic"
    },
    {
      "Time_Start": 2520.94,
      "Time_End": 2527.1400000000003,
      "Text": " to come down and we'll have more conversations about that. But it is certainly an area that"
    },
    {
      "Time_Start": 2527.14,
      "Time_End": 2531.0,
      "Text": " the government is actively thinking about and is actively sort of trying to work through"
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2537.7999999999997,
      "Text": " some of the nuances on, but where at this point there's not comfort talking to a camera."
    },
    {
      "Time_Start": 2537.7999999999997,
      "Time_End": 2543.2999999999997,
      "Text": " And that workshop is this afternoon at 2 o'clock in the policy at DEF CON area."
    },
    {
      "Time_Start": 2543.2999999999997,
      "Time_End": 2546.72,
      "Text": " Okay, we're rolling into the final four minutes, four or five minutes, so I'm going to start on my"
    },
    {
      "Time_Start": 2546.72,
      "Time_End": 2552.2599999999998,
      "Text": " right with Roger. For any final thoughts, anything you want to leave the audience with?"
    },
    {
      "Time_Start": 2552.2599999999998,
      "Time_End": 2556.64,
      "Text": " Yeah, so we gave you a bunch of pessimism today, but there's also optimism because here we are"
    },
    {
      "Time_Start": 2556.64,
      "Time_End": 2561.7599999999998,
      "Text": " all working on the project from the technical and the policy side, and here all of you are"
    },
    {
      "Time_Start": 2561.7599999999998,
      "Time_End": 2567.68,
      "Text": " learning about this. Please spread this all with your friends. I'm going to, after this session,"
    },
    {
      "Time_Start": 2567.68,
      "Time_End": 2572.64,
      "Text": " answer whatever Tor questions you may have over at the Tor booth in the vendor area. And as a"
    },
    {
      "Time_Start": 2572.64,
      "Time_End": 2579.1,
      "Text": " last thought, EFF launched a campaign a few days ago to try to get more Tor relays at"
    },
    {
      "Time_Start": 2579.1,
      "Time_End": 2584.22,
      "Text": " universities in particular. So it doesn't have to be an exit relay, could be a non-exit relay."
    },
    {
      "Time_Start": 2584.2200000000003,
      "Time_End": 2591.1000000000004,
      "Text": " So if you're connected to a university, please consider running a relay for EFF's campaign."
    },
    {
      "Time_Start": 2591.1000000000004,
      "Time_End": 2597.26,
      "Text": " And my positive thought is that, you know, like I said, there's more awareness of this. And I"
    },
    {
      "Time_Start": 2597.26,
      "Time_End": 2603.1400000000003,
      "Text": " really think that this debate needs all of you. I mean, it needs people to be weighing in to raise"
    },
    {
      "Time_Start": 2603.1400000000003,
      "Time_End": 2607.6400000000003,
      "Text": " these issues because a lot of times policymakers think, oh, that's too technical. I don't know"
    },
    {
      "Time_Start": 2607.6400000000003,
      "Time_End": 2612.0600000000004,
      "Text": " what the implication is. So explaining what the real implications of this are and what this is"
    },
    {
      "Time_Start": 2612.06,
      "Time_End": 2616.4,
      "Text": " going to mean is important because it flags this as an issue and that's the beginning of any"
    },
    {
      "Time_Start": 2616.4,
      "Time_End": 2617.52,
      "Text": " kind of real policy debate."
    },
    {
      "Time_Start": 2617.52,
      "Time_End": 2622.22,
      "Text": " But you can only be in that conversation if you're in the room. So it's really incumbent on the"
    },
    {
      "Time_Start": 2622.22,
      "Time_End": 2626.94,
      "Text": " people having that conversation to spit out these RFIs, right? Give us feedback."
    },
    {
      "Time_Start": 2626.94,
      "Time_End": 2630.22,
      "Text": " And I was going to say that. And that doesn't necessarily mean you being in the room, but it"
    },
    {
      "Time_Start": 2630.22,
      "Time_End": 2634.56,
      "Text": " means that the people who are having these conversations, and increasingly they are. We talk"
    },
    {
      "Time_Start": 2634.56,
      "Time_End": 2638.1,
      "Text": " about this multi-stakeholder model, which means, you know, not just government people, but they"
    },
    {
      "Time_Start": 2638.1,
      "Time_End": 2643.06,
      "Text": " should be talking to other stakeholders, including this community. And they're trying to"
    },
    {
      "Time_Start": 2643.06,
      "Time_End": 2647.22,
      "Text": " develop mechanisms. Some countries are better than others. The U.S. is trying to do a lot more"
    },
    {
      "Time_Start": 2647.22,
      "Time_End": 2650.7999999999997,
      "Text": " of that. And I think trying to take advantage of those. And frankly, a lot of the U.S. people are"
    },
    {
      "Time_Start": 2650.7999999999997,
      "Time_End": 2655.68,
      "Text": " here at DEF CON for exactly this purpose. So making sure that there's that connection and you're"
    },
    {
      "Time_Start": 2655.68,
      "Time_End": 2660.56,
      "Text": " at least aware of it. And then you can raise the alarm bells in your own circles, too. And I"
    },
    {
      "Time_Start": 2660.56,
      "Time_End": 2661.2999999999997,
      "Text": " think that helps."
    },
    {
      "Time_Start": 2662.3,
      "Time_End": 2668.54,
      "Text": " I think for me, one of the big points that I'd like to get across is the idea that security and"
    },
    {
      "Time_Start": 2668.54,
      "Time_End": 2674.38,
      "Text": " human rights are actually two sides of the same coin. That they are not opposite sides of a"
    },
    {
      "Time_Start": 2674.38,
      "Time_End": 2679.54,
      "Text": " scale. And if you are architecting a system, you're building something out, thinking about the"
    },
    {
      "Time_Start": 2679.54,
      "Time_End": 2686.1400000000003,
      "Text": " security is not just going to be good for your users here, but can potentially enable people"
    },
    {
      "Time_Start": 2686.14,
      "Time_End": 2691.3399999999997,
      "Text": " around the world to circumvent a censorship regime. That if you build and architect your"
    },
    {
      "Time_Start": 2691.3399999999997,
      "Time_End": 2696.46,
      "Text": " system with in the back of your mind the idea that an authoritarian may be looking at this, may"
    },
    {
      "Time_Start": 2696.46,
      "Time_End": 2701.42,
      "Text": " be trying to use it for a malicious purpose, but you might be able to build it or architect it in"
    },
    {
      "Time_Start": 2701.42,
      "Time_End": 2706.2999999999997,
      "Text": " a way that enables someone to reach out and report government corruption. That enables"
    },
    {
      "Time_Start": 2706.2999999999997,
      "Time_End": 2711.92,
      "Text": " someone to reach out and talk about human rights abuses going on in their country. That is good, I"
    },
    {
      "Time_Start": 2711.92,
      "Time_End": 2717.54,
      "Text": " think, for business and also good for all of us, for the world, for human rights. And that is"
    },
    {
      "Time_Start": 2717.54,
      "Time_End": 2722.7400000000002,
      "Text": " something that we can do as we ensure that our products are secure from the get-go. That"
    },
    {
      "Time_Start": 2722.7400000000002,
      "Time_End": 2728.62,
      "Text": " encryption is strong. That the protocols don't have a button to say, you know, mass"
    },
    {
      "Time_Start": 2728.62,
      "Time_End": 2733.54,
      "Text": " surveillance, click here. And you just click here. Those are things that we need to think about"
    },
    {
      "Time_Start": 2733.54,
      "Time_End": 2739.2000000000003,
      "Text": " from a technological perspective. And I know you all are in that space. We're in a policy"
    },
    {
      "Time_Start": 2739.2000000000003,
      "Time_End": 2742.9,
      "Text": " space. You all are actually building. And building with that idea of human rights in mind I"
    },
    {
      "Time_Start": 2742.9,
      "Time_End": 2748.0600000000004,
      "Text": " think is really important. All right. Thank you so much for being at our panel on internet"
    },
    {
      "Time_Start": 2748.0600000000004,
      "Time_End": 2751.4800000000005,
      "Text": " censorship. And I hope to see you around DEF CON. Thank you."
    }
  ]
}