{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n All right, hello and welcome everybody to our talk, Tetra Tour de Force, jailbreaking"
    },
    {
      "Time_Start": 7.68,
      "Time_End": 12.92,
      "Text": " digital radios and base stations for fun and secrets. I'm very excited to stand here today"
    },
    {
      "Time_Start": 12.92,
      "Time_End": 18.240000000000002,
      "Text": " and share this research with you after working on it for more than two years. My name is"
    },
    {
      "Time_Start": 18.240000000000002,
      "Time_End": 22.48,
      "Text": " Jules Wetzels and these are my colleagues, Carla Meyer and Wouter Bokslag, and together"
    },
    {
      "Time_Start": 22.48,
      "Time_End": 28.400000000000002,
      "Text": " we form Midnight Blue, a specialist security consultancy firm that specializes mainly in"
    },
    {
      "Time_Start": 28.400000000000002,
      "Time_End": 35.160000000000004,
      "Text": " embedded systems as well as critical infrastructure. So a little bit about Tetra, what is Tetra?"
    },
    {
      "Time_Start": 35.160000000000004,
      "Time_End": 39.400000000000006,
      "Text": " It's a globally used radio technology that competes with the likes of P25, which you"
    },
    {
      "Time_Start": 39.400000000000006,
      "Time_End": 45.52,
      "Text": " might know from being used by the United States police, DMR and the confusingly named Tetrapole."
    },
    {
      "Time_Start": 45.52,
      "Time_End": 52.400000000000006,
      "Text": " It was standardized in 1995 by ETSI, that's the European Telecommunication Standards Institute,"
    },
    {
      "Time_Start": 52.400000000000006,
      "Time_End": 57.24,
      "Text": " and they are known for also doing work on GSM, 3G, 4G and so on. It's used for voice"
    },
    {
      "Time_Start": 57.24,
      "Time_End": 61.86,
      "Text": " and data communications as well as machine to machine communications and it relies on"
    },
    {
      "Time_Start": 61.86,
      "Time_End": 67.44,
      "Text": " secret proprietary cryptography. That's why we're standing here today."
    },
    {
      "Time_Start": 67.44,
      "Time_End": 73.32000000000001,
      "Text": " So it's the vast majority of global police forces outside of the United States and France"
    },
    {
      "Time_Start": 73.32000000000001,
      "Time_End": 77.92,
      "Text": " use Tetra for their voice communications and this is countries like the Netherlands and"
    },
    {
      "Time_Start": 77.92,
      "Time_End": 83.56,
      "Text": " Germany and the United Kingdom, but also Scandinavian countries, Eastern Europe, large parts of"
    },
    {
      "Time_Start": 83.56,
      "Time_End": 89.04,
      "Text": " Asia and South America use this. In addition, it's used in military and intelligence"
    },
    {
      "Time_Start": 89.04,
      "Time_End": 93.56,
      "Text": " services contexts. Now, the countries that you see highlighted on the map here are the"
    },
    {
      "Time_Start": 93.56,
      "Time_End": 98.84,
      "Text": " ones where we could confirm military or intelligence users through open source intelligence, but"
    },
    {
      "Time_Start": 98.84,
      "Time_End": 102.32000000000001,
      "Text": " this is likely the tip of the iceberg, so there might be many more countries out there"
    },
    {
      "Time_Start": 102.32000000000001,
      "Time_End": 107.04,
      "Text": " that use it in this capacity. And on top of that, it's used by critical"
    },
    {
      "Time_Start": 107.04,
      "Time_End": 112.6,
      "Text": " infrastructure. So if you see private security forces at airports, harbors and train stations,"
    },
    {
      "Time_Start": 112.60000000000001,
      "Time_End": 117.28,
      "Text": " there's a good chance that their handheld radios are Tetra based. And on top of that,"
    },
    {
      "Time_Start": 117.28,
      "Time_End": 123.00000000000001,
      "Text": " it's also used as a radio link for wide area networks carrying SCADA communications in"
    },
    {
      "Time_Start": 123.00000000000001,
      "Time_End": 128.32000000000002,
      "Text": " order to do telecontrol and telemetry of high voltage substations, oil and gas pipelines"
    },
    {
      "Time_Start": 128.32000000000002,
      "Time_End": 135.28,
      "Text": " as well as railway signaling, so serious stuff. Now, a common misconception is that Tetra"
    },
    {
      "Time_Start": 135.28,
      "Time_End": 139.24,
      "Text": " is an open standard, but that's not true. Some parts of the standard are public, but"
    },
    {
      "Time_Start": 139.24,
      "Time_End": 143.4,
      "Text": " the cryptography within it is secret, and it's only available to you if you sign an"
    },
    {
      "Time_Start": 143.4,
      "Time_End": 147.48000000000002,
      "Text": " NDA, and I mean, in that case, you can't talk about it, and you're only allowed to sign"
    },
    {
      "Time_Start": 147.48000000000002,
      "Time_End": 152.28,
      "Text": " an NDA if you are what they call a bona fide party. And these bona fide parties are usually"
    },
    {
      "Time_Start": 152.28,
      "Time_End": 156.84,
      "Text": " manufacturers and these manufacturers have to ensure that the algorithms are protected,"
    },
    {
      "Time_Start": 156.84,
      "Time_End": 161.4,
      "Text": " either by implementing them in hardware or implementing them in software with extraction"
    },
    {
      "Time_Start": 161.4,
      "Time_End": 166.28,
      "Text": " countermeasures. Now, the first problem already is that there are lots of these bona fide"
    },
    {
      "Time_Start": 166.28,
      "Time_End": 170.84,
      "Text": " vendors and they are geographically dispersed, so every major country in the world essentially"
    },
    {
      "Time_Start": 170.84,
      "Time_End": 175.68,
      "Text": " has a domestic Tetra manufacturer. That's the United States, the United Kingdom, China,"
    },
    {
      "Time_Start": 175.68,
      "Time_End": 181.08,
      "Text": " Russia. So you can feel that top tier adversaries likely already have these specifications of"
    },
    {
      "Time_Start": 181.08,
      "Time_End": 185.48,
      "Text": " these algorithms, either through their in-country manufacturers or through just, you know, getting"
    },
    {
      "Time_Start": 185.48,
      "Time_End": 190.32,
      "Text": " them from a share point somewhere at a manufacturer. We, however, had to jump through a lot more"
    },
    {
      "Time_Start": 190.32,
      "Time_End": 195.96,
      "Text": " hoops in this case. So Tetra security has two main pillars, the first of which is the"
    },
    {
      "Time_Start": 195.96,
      "Time_End": 201.64000000000001,
      "Text": " TAA1 suite, which is the authentication, key management, and distribution suite. It's"
    },
    {
      "Time_Start": 201.64000000000001,
      "Time_End": 206.72,
      "Text": " also used for identity encryption. The second suite is the Tetra encryption algorithm suite,"
    },
    {
      "Time_Start": 206.72,
      "Time_End": 211.12,
      "Text": " which is used for voice and data encryption through the air interface encryption functionality."
    },
    {
      "Time_Start": 211.12,
      "Time_End": 216.32,
      "Text": " And this has four different flavors. The first of which is TAA1, which is readily exportable."
    },
    {
      "Time_Start": 216.32,
      "Time_End": 221.28,
      "Text": " Then you have TAA2, which is restricted in its use to European public safety organizations."
    },
    {
      "Time_Start": 221.28,
      "Time_End": 226.04,
      "Text": " Then you have TAA3, which is used for extra European public safety, for those countries"
    },
    {
      "Time_Start": 226.04,
      "Time_End": 230.24,
      "Text": " that have friendly relationships with the European Union. And then you have TAA4, which"
    },
    {
      "Time_Start": 230.24,
      "Time_End": 235.16,
      "Text": " is the same use case as TAA1, but it's hardly used in practice."
    },
    {
      "Time_Start": 235.16,
      "Time_End": 240.28,
      "Text": " Optionally, there are Tetra end-to-end solutions available, but these are only used by some"
    },
    {
      "Time_Start": 240.28,
      "Time_End": 245.36,
      "Text": " countries and only in special cases, in most of the cases. So think about special intervention"
    },
    {
      "Time_Start": 245.36,
      "Time_End": 250.6,
      "Text": " units, counterintelligence observation units. It's not a part of the Tetra standard. There"
    },
    {
      "Time_Start": 250.6,
      "Time_End": 254.6,
      "Text": " are some guidelines around it, but it's a vendor-specific proprietary solution that"
    },
    {
      "Time_Start": 254.6,
      "Time_End": 259.12,
      "Text": " you build on top of the air interface encryption. It's expensive and, again, very opaque as"
    },
    {
      "Time_Start": 259.12,
      "Time_End": 263.71999999999997,
      "Text": " well. It hasn't been looked into yet. So with this in mind, we undertook Project"
    },
    {
      "Time_Start": 263.71999999999997,
      "Time_End": 269.48,
      "Text": " ReTetra, which was the project to reverse engineer these algorithms. And you can find"
    },
    {
      "Time_Start": 269.48,
      "Time_End": 273.44,
      "Text": " all the details about this on this particular URL."
    },
    {
      "Time_Start": 273.44,
      "Time_End": 276.8,
      "Text": " We undertook this with Kirchhoff's principle in mind. Now, I probably don't have to explain"
    },
    {
      "Time_Start": 276.8,
      "Time_End": 281.40000000000003,
      "Text": " to you guys what Kirchhoff's principle is, but I'm still going to anyway. It says that"
    },
    {
      "Time_Start": 281.40000000000003,
      "Time_End": 286.2,
      "Text": " a crypto system should be secure even if everything about the system except for the key is public"
    },
    {
      "Time_Start": 286.2,
      "Time_End": 290.04,
      "Text": " knowledge. So no security through obscurity, right?"
    },
    {
      "Time_Start": 290.04,
      "Time_End": 293.64,
      "Text": " Violators of this principle have historically not done well. If you look at the history"
    },
    {
      "Time_Start": 293.64,
      "Time_End": 300.2,
      "Text": " of standards like GSM, GMR, GPRS, all Etsy standards, by the way, their secret cryptographic"
    },
    {
      "Time_Start": 300.2,
      "Time_End": 304.64,
      "Text": " algorithms either turned out to be broken or backdoored. And we had the suspicion that"
    },
    {
      "Time_Start": 304.64,
      "Time_End": 308.32,
      "Text": " this might be the case for Tetra as well. But in more than 20 years, nobody had looked"
    },
    {
      "Time_Start": 308.32,
      "Time_End": 312.68,
      "Text": " at this publicly. Now, Etsy thinks very differently about this."
    },
    {
      "Time_Start": 312.68,
      "Time_End": 317.0,
      "Text": " In an interview with the journalist Kim Zetter, Brian Murgatroyd, who's the chairman of the"
    },
    {
      "Time_Start": 317.0,
      "Time_End": 322.8,
      "Text": " Etsy technical committee on Tetra, said, well, obscurity is also a way of maintaining security."
    },
    {
      "Time_Start": 322.8,
      "Time_End": 328.64,
      "Text": " Well, let's see if that's actually the case. So the project was undertaken with funding"
    },
    {
      "Time_Start": 328.64,
      "Time_End": 334.2,
      "Text": " from Enelnet, which is a Dutch nonprofit organization that hands out money for open source initiatives."
    },
    {
      "Time_Start": 334.76,
      "Time_End": 337.92,
      "Text": " And they kindly supplied us with some money to undertake this research, and now we can"
    },
    {
      "Time_Start": 337.92,
      "Time_End": 343.2,
      "Text": " talk about Tetra for the first time in public. So let's break open a radio."
    },
    {
      "Time_Start": 343.2,
      "Time_End": 347.56,
      "Text": " Well, before we could break open a radio and see what's going on inside, we did a little"
    },
    {
      "Time_Start": 347.56,
      "Time_End": 351.68,
      "Text": " bit of analysis first, because you want to select the right kind of target, because if"
    },
    {
      "Time_Start": 351.68,
      "Time_End": 355.56,
      "Text": " you select a radio that is harder to reverse engineer, you might end up spending a lot"
    },
    {
      "Time_Start": 355.56,
      "Time_End": 360.4,
      "Text": " of time on dead ends. So we did some analysis of the internal architectures"
    },
    {
      "Time_Start": 360.40000000000003,
      "Time_End": 363.68,
      "Text": " of different kind of radios from different vendors by looking through the different data"
    },
    {
      "Time_Start": 363.68,
      "Time_End": 368.04,
      "Text": " sheets. And here you can see that, well, there's a variety of architectures, some of which"
    },
    {
      "Time_Start": 368.04,
      "Time_End": 372.8,
      "Text": " are quite esoteric, but also they implement different kind of security features. Like"
    },
    {
      "Time_Start": 372.8,
      "Time_End": 378.00000000000006,
      "Text": " certain radios will implement hardware-based ASICs that likely include the algorithms,"
    },
    {
      "Time_Start": 378.00000000000006,
      "Time_End": 382.96000000000004,
      "Text": " and we don't want to spend a lot of time with assets and scanning electron microscopes."
    },
    {
      "Time_Start": 382.96000000000004,
      "Time_End": 387.88000000000005,
      "Text": " So we went for the one that has a trusted execution environment in software. And that"
    },
    {
      "Time_Start": 387.88,
      "Time_End": 393.28,
      "Text": " turned out to be the Motorola MTM5400. This is a very common model. It's easily obtained"
    },
    {
      "Time_Start": 393.28,
      "Time_End": 399.32,
      "Text": " secondhand online on eBay. And it has a baseband system on chip that is by a manufacturer that"
    },
    {
      "Time_Start": 399.32,
      "Time_End": 403.52,
      "Text": " is not Motorola, but by Texas Instruments. And this likely hints at the fact that there's"
    },
    {
      "Time_Start": 403.52,
      "Time_End": 409.24,
      "Text": " no hardware implementation of these algorithms inside. Also, this SoC has software security"
    },
    {
      "Time_Start": 409.24,
      "Time_End": 414.2,
      "Text": " features and that are very suited for likely protecting this Tetra crypto from extraction."
    },
    {
      "Time_Start": 415.2,
      "Time_End": 419.8,
      "Text": " The architecture of the radio looks like something you see on the right of the slide. So if you"
    },
    {
      "Time_Start": 419.8,
      "Time_End": 423.56,
      "Text": " have the radio, you have a control head, which is where the microphone, the keyboard, and"
    },
    {
      "Time_Start": 423.56,
      "Time_End": 428.03999999999996,
      "Text": " the field configuration is. Then on the back of the radio, you have a rear connector, which"
    },
    {
      "Time_Start": 428.03999999999996,
      "Time_End": 433.2,
      "Text": " you use for depot programming, for configuring the radio, doing firmware updates and so on."
    },
    {
      "Time_Start": 433.2,
      "Time_End": 437.44,
      "Text": " And then inside you have the baseband chip. And the baseband chip, in this case the Freon"
    },
    {
      "Time_Start": 437.44,
      "Time_End": 444.0,
      "Text": " baseband, is based on the OMAP L138 architecture by Texas Instruments, which has a ARM core"
    },
    {
      "Time_Start": 444.0,
      "Time_End": 449.28,
      "Text": " for the high-level stuff and a digital signals processor for, well, processing the signals."
    },
    {
      "Time_Start": 449.28,
      "Time_End": 453.52,
      "Text": " And then inside the DSP, you have a trusted execution environment that likely includes"
    },
    {
      "Time_Start": 453.52,
      "Time_End": 459.8,
      "Text": " our magic sauce. So this OMAP L138, like I mentioned, it has an ARM core, but it also"
    },
    {
      "Time_Start": 459.8,
      "Time_End": 466.36,
      "Text": " has a DSP core that is based on a flavor of the TMS320 DSP architecture. There's very"
    },
    {
      "Time_Start": 466.36,
      "Time_End": 470.44,
      "Text": " limited reversing tooling available for this particular flavor, so we had to build a lot"
    },
    {
      "Time_Start": 470.44,
      "Time_End": 476.92,
      "Text": " of our own. And the DSP features an orthogonal security model. So you have a separation between"
    },
    {
      "Time_Start": 476.92,
      "Time_End": 481.71999999999997,
      "Text": " the regular user and supervisor mode, but you also have a separation between secure"
    },
    {
      "Time_Start": 481.71999999999997,
      "Time_End": 487.08,
      "Text": " and non-secure mode. And if you look at the supervisor secure mode, that is likely where"
    },
    {
      "Time_Start": 487.08,
      "Time_End": 492.76,
      "Text": " a lot of the interesting stuff is located. First thing we did is we bought a development"
    },
    {
      "Time_Start": 492.76,
      "Time_End": 497.08,
      "Text": " kit for this architecture. It was relatively low cost. Unfortunately, this didn't come"
    },
    {
      "Time_Start": 497.08,
      "Time_End": 501.15999999999997,
      "Text": " with a secure version of the chip, so we couldn't analyze it on a development board."
    },
    {
      "Time_Start": 501.15999999999997,
      "Time_End": 506.64,
      "Text": " However, it's useful for reversing, debugging, testing your shellcode, and so on. Now, we"
    },
    {
      "Time_Start": 506.64,
      "Time_End": 511.28,
      "Text": " wanted to confirm our assumptions, so we opened up the radio, and we saw that all the main"
    },
    {
      "Time_Start": 511.28,
      "Time_End": 517.48,
      "Text": " board was covered with shields. So in order to see what kind of chip is exactly used,"
    },
    {
      "Time_Start": 517.48,
      "Time_End": 522.36,
      "Text": " we took a rotary saw, we sawed off these shields, and we found out that, yes, it is indeed this"
    },
    {
      "Time_Start": 522.36,
      "Time_End": 527.52,
      "Text": " particular chip with the secure flavor. Then we took a look at the firmware. The firmware"
    },
    {
      "Time_Start": 527.52,
      "Time_End": 532.5600000000001,
      "Text": " comes as an RPK package, and the RPK package, well, it's essentially a zip archive, and"
    },
    {
      "Time_Start": 532.5600000000001,
      "Time_End": 538.2,
      "Text": " inside the zip archive, there's an encrypted Z-19 file. So, you know, these firmwares are"
    },
    {
      "Time_Start": 538.2,
      "Time_End": 544.02,
      "Text": " not personalized. They don't differ from radio to radio. They're general. And the engineering"
    },
    {
      "Time_Start": 544.02,
      "Time_End": 548.6800000000001,
      "Text": " software needs to have a way to load this firmware onto these radios, so likely it knows"
    },
    {
      "Time_Start": 548.72,
      "Time_End": 553.32,
      "Text": " the passwords to these encrypted files. It's written in .NET, so it's very easy reverse"
    },
    {
      "Time_Start": 553.32,
      "Time_End": 558.08,
      "Text": " engineering. With a little bit of effort, you get the two passwords, which are static."
    },
    {
      "Time_Start": 558.08,
      "Time_End": 562.5200000000001,
      "Text": " So then you're able to extract the zip archive. You get the Z-19 file. You decrypt it with"
    },
    {
      "Time_Start": 562.5200000000001,
      "Time_End": 566.84,
      "Text": " one password, and you get the S-19 files. You decrypt those with the second password,"
    },
    {
      "Time_Start": 566.84,
      "Time_End": 570.9200000000001,
      "Text": " and then you have what you're actually looking for, which is the file system of the application"
    },
    {
      "Time_Start": 570.9200000000001,
      "Time_End": 577.9200000000001,
      "Text": " processor and the DSP firmware. So is this trusted execution environment actually used"
    },
    {
      "Time_Start": 578.4,
      "Time_End": 584.4399999999999,
      "Text": " for the Tetra algorithms? Well, there's no proper DSP reversing tooling yet, so how do"
    },
    {
      "Time_Start": 584.4399999999999,
      "Time_End": 589.4,
      "Text": " we find this out? Well, by doing the entropic analysis of the DSP firmware. So you can see"
    },
    {
      "Time_Start": 589.4,
      "Time_End": 594.16,
      "Text": " on the left of the slide that in a particular area within the DSP firmware, there's a very"
    },
    {
      "Time_Start": 594.16,
      "Time_End": 599.1999999999999,
      "Text": " high entropy area, which likely indicates encrypted data, and then you can see the cross"
    },
    {
      "Time_Start": 599.1999999999999,
      "Time_End": 604.52,
      "Text": " references in the code to this particular area correspond with API call invocations"
    },
    {
      "Time_Start": 604.52,
      "Time_End": 610.4399999999999,
      "Text": " of this particular secure kernel API. So delving into a little bit more detail will"
    },
    {
      "Time_Start": 610.4399999999999,
      "Time_End": 615.4399999999999,
      "Text": " be my colleague, Carlo Meyer, who will take you on the rest of the journey."
    },
    {
      "Time_Start": 615.4399999999999,
      "Time_End": 622.4399999999999,
      "Text": " All right. So now that we have a pretty good idea of where to go, let's break it to you."
    },
    {
      "Time_Start": 623.64,
      "Time_End": 629.36,
      "Text": " So the first thing we have to do is get code execution obviously on the application processor,"
    },
    {
      "Time_Start": 629.4,
      "Time_End": 636.4,
      "Text": " and we identified three possible angles, the first one being the modem AT command interface,"
    },
    {
      "Time_Start": 636.4,
      "Time_End": 641.8000000000001,
      "Text": " the second being modifying the NAND flash, and the third one being targeting some peripheral"
    },
    {
      "Time_Start": 641.8000000000001,
      "Time_End": 648.8000000000001,
      "Text": " interface, for example, like the GPS module or the what have you. After that, we'd have"
    },
    {
      "Time_Start": 648.96,
      "Time_End": 655.52,
      "Text": " to move from the ARM core towards the DSP through either direct memory access or through"
    },
    {
      "Time_Start": 655.72,
      "Time_End": 660.1999999999999,
      "Text": " some DSP link library, which is the library used to pass messages back and forth from"
    },
    {
      "Time_Start": 660.1999999999999,
      "Time_End": 666.4399999999999,
      "Text": " the ARM core to the DSP and vice versa. And finally, once we obtain code execution on"
    },
    {
      "Time_Start": 666.4399999999999,
      "Time_End": 672.28,
      "Text": " the DSP, we'd have to find either a vulnerability or a side channel flaw in the trusted execution"
    },
    {
      "Time_Start": 672.28,
      "Time_End": 679.28,
      "Text": " environment. So this is basically the same thing, but then presented in a nicer way."
    },
    {
      "Time_Start": 680.28,
      "Time_End": 686.72,
      "Text": " Okay. So the MTM radio has a rear connector that exposes the AT modem command interface."
    },
    {
      "Time_Start": 686.72,
      "Time_End": 693.72,
      "Text": " With this interface, you can read, write parameters, for example. Analyzing the firmware gave us"
    },
    {
      "Time_Start": 694.48,
      "Time_End": 700.24,
      "Text": " a list of commands, and we immediately started looking for those with string parsing or variable"
    },
    {
      "Time_Start": 700.24,
      "Time_End": 707.24,
      "Text": " length handling. The commands used to set a talk group list entry and supplement the"
    },
    {
      "Time_Start": 710.24,
      "Time_End": 716.52,
      "Text": " enumerate them, we found a classic format string vulnerability, which allows us to write"
    },
    {
      "Time_Start": 716.52,
      "Time_End": 723.52,
      "Text": " arbitrary data to any pointer that's listed on the stack. So on the slide on the right,"
    },
    {
      "Time_Start": 723.64,
      "Time_End": 729.3199999999999,
      "Text": " you see our user input that contains percent P, and on the bottom, you see it interpreted"
    },
    {
      "Time_Start": 729.3199999999999,
      "Time_End": 736.3199999999999,
      "Text": " as a format string. So this is a classic vulnerability. So this means that we can write anything that"
    },
    {
      "Time_Start": 736.84,
      "Time_End": 741.44,
      "Text": " we'd like to anything that's listed onto the stack. So if we can influence what's on the"
    },
    {
      "Time_Start": 741.44,
      "Time_End": 748.44,
      "Text": " stack, we have a write anything anywhere primitive. Unfortunately, we don't. So how do we go about"
    },
    {
      "Time_Start": 748.48,
      "Time_End": 754.84,
      "Text": " that? So luckily, there's frame pointers in this firmware. Frame pointers have the nice"
    },
    {
      "Time_Start": 754.84,
      "Time_End": 760.0400000000001,
      "Text": " property that each frame pointer points to the next frame pointer. So in this particular"
    },
    {
      "Time_Start": 760.4399999999999,
      "Time_End": 766.92,
      "Text": " example, let's say that argument 55, that one contains a memory address, and it points"
    },
    {
      "Time_Start": 766.92,
      "Time_End": 773.92,
      "Text": " to argument 59, which in turn points to argument 71. Now, suppose that you write, let's say"
    },
    {
      "Time_Start": 774.3199999999999,
      "Time_End": 781.3199999999999,
      "Text": " 0x80 to argument 55, that will update argument 59, and in this particular example, it will"
    },
    {
      "Time_Start": 782.24,
      "Time_End": 788.12,
      "Text": " now not point to argument 79, but it will point to byte 0 of argument, not point to"
    },
    {
      "Time_Start": 788.12,
      "Time_End": 795.12,
      "Text": " argument 71, but in this particular example, it will point to byte 0 of argument 79. All"
    },
    {
      "Time_Start": 795.16,
      "Time_End": 802.16,
      "Text": " right. So now if we write anything to argument 59, it will update byte 0 of argument 79."
    },
    {
      "Time_Start": 804.24,
      "Time_End": 811.08,
      "Text": " Then we go back, and we update, then we write something to argument 55 again, for example,"
    },
    {
      "Time_Start": 811.08,
      "Time_End": 818.08,
      "Text": " 0x81, and therefore argument 59 now points to byte 1 of argument 79, and this way, we"
    },
    {
      "Time_Start": 819.12,
      "Time_End": 826.12,
      "Text": " go by continuing this route, we end up being argument number 79 being completely malleable"
    },
    {
      "Time_Start": 827.68,
      "Time_End": 833.28,
      "Text": " by us. We completely control its value, and this way, we have a pointer on the stack that"
    },
    {
      "Time_Start": 833.28,
      "Time_End": 838.92,
      "Text": " we completely control, and therefore we have a write anything anywhere primitive. Good."
    },
    {
      "Time_Start": 838.92,
      "Time_End": 845.8,
      "Text": " So it turns out that the heap actually has read, write, and execute permissions, so the"
    },
    {
      "Time_Start": 845.8000000000001,
      "Time_End": 850.84,
      "Text": " next steps would be just to write our shellcode onto the heap, overwrite some pointer that"
    },
    {
      "Time_Start": 850.84,
      "Time_End": 856.6,
      "Text": " points to executable code, and then trigger execution of that pointer, and boom. So that"
    },
    {
      "Time_Start": 856.6,
      "Time_End": 863.6,
      "Text": " got us a shell on the application processor. All right. So the next step is to move on"
    },
    {
      "Time_Start": 864.6,
      "Time_End": 871.6,
      "Text": " to the DSP, so to recap, this means exploiting vulnerability in this communication library"
    },
    {
      "Time_Start": 876.5600000000001,
      "Time_End": 883.5600000000001,
      "Text": " called DSP link, or exploit some misconfiguration in the MPUs configuration. Right. So this"
    },
    {
      "Time_Start": 884.9200000000001,
      "Time_End": 890.8000000000001,
      "Text": " thing contains two cores that need to communicate somehow, and they do this by having shared"
    },
    {
      "Time_Start": 890.8000000000001,
      "Time_End": 897.1600000000001,
      "Text": " internal RAM and some external DDR2 memory, and this could present an interesting avenue"
    },
    {
      "Time_Start": 897.1600000000001,
      "Time_End": 904.1600000000001,
      "Text": " for lateral movement via direct memory access. So now the SOC has in question has memory"
    },
    {
      "Time_Start": 904.44,
      "Time_End": 911.4000000000001,
      "Text": " protection features, which allow for the segmentation of memory areas between cores and within cores."
    },
    {
      "Time_Start": 911.4000000000001,
      "Time_End": 917.44,
      "Text": " So the plan would be to dump the MPU configuration, and then find a range that's used by both"
    },
    {
      "Time_Start": 917.48,
      "Time_End": 923.9200000000001,
      "Text": " the DSP and the application processor, and then identify and exploit an interface that"
    },
    {
      "Time_Start": 923.9200000000001,
      "Time_End": 930.5200000000001,
      "Text": " uses this shared memory range, such as DSP link, that's used in order to pass messages"
    },
    {
      "Time_Start": 930.5200000000001,
      "Time_End": 937.5200000000001,
      "Text": " back and forth. So when we dumped the configuration, we saw that there is essentially no segmentation"
    },
    {
      "Time_Start": 938.24,
      "Time_End": 945.24,
      "Text": " applied whatsoever, so basically this MPU poses zero problems for us. Like getting code"
    },
    {
      "Time_Start": 945.88,
      "Time_End": 950.88,
      "Text": " execution on the DSP is as straightforward as just modifying parts of the DSP firmware"
    },
    {
      "Time_Start": 950.88,
      "Time_End": 957.88,
      "Text": " in RAM. So the next thing we did is we implemented a framework for running code on the DSP. We"
    },
    {
      "Time_Start": 960.44,
      "Time_End": 967.44,
      "Text": " wrote multiple application processor kernel modules, which hijacks DSP control by allocating"
    },
    {
      "Time_Start": 967.76,
      "Time_End": 974.16,
      "Text": " shared memory, copying our payload over into the shared memory, and then redirect DSP execution"
    },
    {
      "Time_Start": 974.1999999999999,
      "Time_End": 980.4,
      "Text": " to our code, meanwhile ensuring that the watchdog, which is a hardware peripheral, was periodically"
    },
    {
      "Time_Start": 980.4,
      "Time_End": 986.92,
      "Text": " kicked in order to prevent the board from resetting. So all of this was kind of complicated"
    },
    {
      "Time_Start": 986.92,
      "Time_End": 993.7199999999999,
      "Text": " by the fact that the DSP architecture is pretty hellish. It has delayed branches, variable"
    },
    {
      "Time_Start": 993.7199999999999,
      "Time_End": 999.28,
      "Text": " degrees of concurrencies, lots of conditionals, and very limited IDA support. So we had to"
    },
    {
      "Time_Start": 999.3199999999999,
      "Time_End": 1004.12,
      "Text": " implement our own disassembler, and on top of that we also added support for the architecture"
    },
    {
      "Time_Start": 1004.12,
      "Time_End": 1010.0,
      "Text": " to the Red Deck decompiler, and both will be upstreamed in the course of the next few"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1017.0,
      "Text": " weeks. As you can see, the decompiler output reads a lot nicer than the disassembler."
    },
    {
      "Time_Start": 1018.0,
      "Time_End": 1025.0,
      "Text": " All right, and with that, we had reliable DSP code execution."
    },
    {
      "Time_Start": 1031.16,
      "Time_End": 1038.16,
      "Text": " So on to the final step, attacking the TEE. So at first we got our hands on a chip whisperer"
    },
    {
      "Time_Start": 1039.96,
      "Time_End": 1046.32,
      "Text": " to do some power side channel analysis. However, it quickly turned out that it wasn't the easiest"
    },
    {
      "Time_Start": 1046.32,
      "Time_End": 1053.32,
      "Text": " route at all. We had to find clock lines on the PCB, we then find the DSP power line,"
    },
    {
      "Time_Start": 1054.8799999999999,
      "Time_End": 1060.36,
      "Text": " decrease the DSP core clock speed, correlate measurements to the key, etc., etc., which"
    },
    {
      "Time_Start": 1060.36,
      "Time_End": 1064.08,
      "Text": " turned out to be a nightmare. We were quite sure that we were going to break the board"
    },
    {
      "Time_Start": 1064.08,
      "Time_End": 1071.08,
      "Text": " this way. So we took a step back and we looked at maybe we have other options here."
    },
    {
      "Time_Start": 1072.08,
      "Time_End": 1078.56,
      "Text": " So it turns out the TEE is implemented in ROM by a subsystem called the secure kernel."
    },
    {
      "Time_Start": 1078.56,
      "Time_End": 1085.56,
      "Text": " This code runs in DSP secure mode, and all non-secure code can do is perform a secure"
    },
    {
      "Time_Start": 1088.1599999999999,
      "Time_End": 1095.04,
      "Text": " kernel API call, which is very similar to a sys call on a regular PC. So there's this"
    },
    {
      "Time_Start": 1095.04,
      "Time_End": 1100.08,
      "Text": " thing called SK load, which is an API call which allows for runtime loading of encrypted"
    },
    {
      "Time_Start": 1100.48,
      "Time_End": 1106.08,
      "Text": " modules. For example, our Tetra module, which contains the Tetra algorithms, and it then"
    },
    {
      "Time_Start": 1106.08,
      "Time_End": 1112.96,
      "Text": " decrypts this module with AES and validates them using RSA and then loads them into the"
    },
    {
      "Time_Start": 1112.96,
      "Time_End": 1118.0,
      "Text": " trusted execution environment where they're invisible in non-secure mode. Then if you're"
    },
    {
      "Time_Start": 1118.0,
      "Time_End": 1124.72,
      "Text": " back into non-secure mode, you can invoke one of these algorithms through SK algo invoke,"
    },
    {
      "Time_Start": 1124.72,
      "Time_End": 1131.72,
      "Text": " which allows non-secure code to invoke these algorithms and get the result from one of"
    },
    {
      "Time_Start": 1132.56,
      "Time_End": 1137.64,
      "Text": " these functions that was previously loaded. These modules are encrypted with a customer"
    },
    {
      "Time_Start": 1137.64,
      "Time_End": 1144.64,
      "Text": " encryption key, so that's the factory set key. In this case, that key belongs to Motorola."
    },
    {
      "Time_Start": 1144.64,
      "Time_End": 1151.1200000000001,
      "Text": " So now for our tech, we got some inspiration. Modern computers use caches to speed up memory"
    },
    {
      "Time_Start": 1151.44,
      "Time_End": 1157.0400000000002,
      "Text": " accesses, and this introduces some timing differences during lookups. And this in turn"
    },
    {
      "Time_Start": 1157.0400000000002,
      "Time_End": 1163.2800000000002,
      "Text": " may leak some information on secrets involved. So in 2005 already, Daniel Bernstein wrote"
    },
    {
      "Time_Start": 1163.2800000000002,
      "Time_End": 1169.0600000000002,
      "Text": " an interesting paper on performing such attacks on AES, where you build a profile of timing"
    },
    {
      "Time_Start": 1169.0600000000002,
      "Time_End": 1174.24,
      "Text": " differences and then you observe the target's system characteristics. You correlate these"
    },
    {
      "Time_Start": 1174.24,
      "Time_End": 1180.92,
      "Text": " with the observation and then you derive which key fits best. Right. So for the DSP, we are"
    },
    {
      "Time_Start": 1181.3200000000002,
      "Time_End": 1186.44,
      "Text": " targeting, it has several caches. You have a level one data cache, you have a level one"
    },
    {
      "Time_Start": 1186.44,
      "Time_End": 1193.04,
      "Text": " code cache, and you have a level two cache. The level one data cache has a 64-byte line"
    },
    {
      "Time_Start": 1193.04,
      "Time_End": 1198.6000000000001,
      "Text": " where memory reads are fast and data that is already, for data that's already cached,"
    },
    {
      "Time_Start": 1198.6000000000001,
      "Time_End": 1205.6000000000001,
      "Text": " and otherwise it's slow. So we can evict addresses from cache in this 64-byte granularity, and"
    },
    {
      "Time_Start": 1206.6000000000001,
      "Time_End": 1213.6000000000001,
      "Text": " it turns out that doing so from non-secure mode also affects secure portions from the"
    },
    {
      "Time_Start": 1214.0000000000002,
      "Time_End": 1220.92,
      "Text": " address space that you cannot usually read from non-secure mode. Furthermore, there's"
    },
    {
      "Time_Start": 1220.92,
      "Time_End": 1227.6000000000001,
      "Text": " a feature called a cache freeze, which basically means the cache is turned into read-only state,"
    },
    {
      "Time_Start": 1227.6000000000001,
      "Time_End": 1232.2400000000002,
      "Text": " which means that whenever you get a cache hit, you get a performance increase. Whenever"
    },
    {
      "Time_Start": 1232.24,
      "Time_End": 1238.92,
      "Text": " you get a cache miss, you have to fetch it from main memory, but the cache isn't updated."
    },
    {
      "Time_Start": 1238.92,
      "Time_End": 1245.24,
      "Text": " So now that we have some control over the cache, which AES decryption step should we"
    },
    {
      "Time_Start": 1245.24,
      "Time_End": 1252.08,
      "Text": " target? Well, it turns out that inverse sub-bytes, we're decrypting AES, so inverse sub-bytes"
    },
    {
      "Time_Start": 1252.08,
      "Time_End": 1258.44,
      "Text": " uses an S-box, and that means a memory lookup, so we should probably target that. The thing"
    },
    {
      "Time_Start": 1258.44,
      "Time_End": 1263.92,
      "Text": " is, this S-box is located in some page in ROM, but it's not readable from non-secure"
    },
    {
      "Time_Start": 1263.92,
      "Time_End": 1268.28,
      "Text": " mode, so we don't really know where the S-box is. So the first thing we have to figure out"
    },
    {
      "Time_Start": 1268.28,
      "Time_End": 1273.96,
      "Text": " is figure out where the S-box is. So what we did is, we start by evicting the first"
    },
    {
      "Time_Start": 1273.96,
      "Time_End": 1280.96,
      "Text": " cache line, so the first 64 bytes of this ROM, invoke skload, and then measure the time"
    },
    {
      "Time_Start": 1281.8,
      "Time_End": 1286.4,
      "Text": " it took to run that code in terms of clock cycles, and then we do so for the second cache"
    },
    {
      "Time_Start": 1286.4,
      "Time_End": 1292.0,
      "Text": " line, and then the next, and so forth, and eventually we plot this. So we get something"
    },
    {
      "Time_Start": 1292.0,
      "Time_End": 1299.0,
      "Text": " like this. It seems quite obvious, the S-box is right over there. Okay, so let's dig a"
    },
    {
      "Time_Start": 1299.3200000000002,
      "Time_End": 1306.3200000000002,
      "Text": " bit deeper. We're going to prepare the cache as follows. We run skload so that the full"
    },
    {
      "Time_Start": 1308.0400000000002,
      "Time_End": 1315.0400000000002,
      "Text": " S-box will be in cache, and then we evict the first 32 entries, so this is what we refer"
    },
    {
      "Time_Start": 1315.28,
      "Time_End": 1319.68,
      "Text": " to as the first octant, because it's one-eighth of the S-box, and then we enable this cache"
    },
    {
      "Time_Start": 1319.68,
      "Time_End": 1326.68,
      "Text": " freeze feature. And now, whenever a timing penalty occurs, we know that this happens"
    },
    {
      "Time_Start": 1328.72,
      "Time_End": 1334.24,
      "Text": " due to the first octant of the S-box being hit. So we'll assume this setup for the remainder"
    },
    {
      "Time_Start": 1334.24,
      "Time_End": 1341.24,
      "Text": " of the presentation. So having evicted the first octant of the S-box from cache, we set"
    },
    {
      "Time_Start": 1341.44,
      "Time_End": 1348.44,
      "Text": " ct0, so that's the first ciphertext byte that we provide to skload. We set it to zero, and"
    },
    {
      "Time_Start": 1348.92,
      "Time_End": 1355.92,
      "Text": " we randomize the remainder of the ciphertext, and we measure average running times of skload,"
    },
    {
      "Time_Start": 1356.48,
      "Time_End": 1362.44,
      "Text": " and then we repeat that for other values of ct0 as well, and then we plot the results."
    },
    {
      "Time_Start": 1362.44,
      "Time_End": 1368.4,
      "Text": " So again, we set the first ciphertext byte to zero, we randomize the remainder, and we"
    },
    {
      "Time_Start": 1368.4,
      "Time_End": 1374.2,
      "Text": " get the average running time of skload. So that thing now, our controlled value, gets"
    },
    {
      "Time_Start": 1374.2,
      "Time_End": 1381.2,
      "Text": " put through the S-box. So when we plot that, we get something like this, which is quite"
    },
    {
      "Time_Start": 1382.2800000000002,
      "Time_End": 1389.2800000000002,
      "Text": " interesting. So we know by construction that the penalty is observed when our ciphertext"
    },
    {
      "Time_Start": 1389.8000000000002,
      "Time_End": 1396.8000000000002,
      "Text": " byte XOR a round key byte is less than 32, and in the above example, we find that this"
    },
    {
      "Time_Start": 1398.44,
      "Time_End": 1402.44,
      "Text": " leaks some information about the round key byte. So in this particular case, the round"
    },
    {
      "Time_Start": 1402.44,
      "Time_End": 1409.44,
      "Text": " key byte is located somewhere between 32 and 64. So that's great. We effectively leaked"
    },
    {
      "Time_Start": 1409.44,
      "Time_End": 1416.44,
      "Text": " three bits of this round key byte, so we repeat the same thing for the remaining 15 round"
    },
    {
      "Time_Start": 1417.1200000000001,
      "Time_End": 1424.1200000000001,
      "Text": " key bytes. We obtain a total of 48 bits of round key. However, this approach is inherently"
    },
    {
      "Time_Start": 1424.88,
      "Time_End": 1430.96,
      "Text": " limited, because after all, the other five bits of the round key do not influence which"
    },
    {
      "Time_Start": 1430.96,
      "Time_End": 1437.8400000000001,
      "Text": " S-box octant is hit, and therefore we cannot leak those. There's still 80 bits left to"
    },
    {
      "Time_Start": 1437.8400000000001,
      "Time_End": 1443.64,
      "Text": " brute force, so that's not really a viable approach either, so we have to dive in even"
    },
    {
      "Time_Start": 1443.64,
      "Time_End": 1450.64,
      "Text": " deeper. So suppose that we, instead of attacking the first S-box lookup, let's look at the"
    },
    {
      "Time_Start": 1451.64,
      "Time_End": 1458.64,
      "Text": " second S-box lookup. So round one S-box lookup has introduced some diffusion within the state"
    },
    {
      "Time_Start": 1463.16,
      "Time_End": 1469.44,
      "Text": " byte, so this now means that the least significant bits of this byte actually do influence which"
    },
    {
      "Time_Start": 1469.44,
      "Time_End": 1475.68,
      "Text": " octant is hit during the S-box lookup. So we now have to account for shifting of the"
    },
    {
      "Time_Start": 1475.8,
      "Time_End": 1481.8,
      "Text": " state bytes, the influence of the next round key, and the diffusion of mixed column step,"
    },
    {
      "Time_Start": 1481.8,
      "Time_End": 1487.64,
      "Text": " which was a step that's taken in between, and then we can extend our attack. And I won't"
    },
    {
      "Time_Start": 1487.64,
      "Time_End": 1492.88,
      "Text": " go into further details, because this probably goes, if I would explain to myself, it would"
    },
    {
      "Time_Start": 1492.88,
      "Time_End": 1499.88,
      "Text": " go way beyond my head, so I'll just demonstrate it."
    },
    {
      "Time_Start": 1506.68,
      "Time_End": 1513.68,
      "Text": " All right, so this is right after we got a shell on the radio, on the Encore, so this"
    },
    {
      "Time_Start": 1519.8400000000001,
      "Time_End": 1525.96,
      "Text": " is loading a kernel module that kicks the watchdog, and now we hijack code execution"
    },
    {
      "Time_Start": 1525.96,
      "Time_End": 1532.96,
      "Text": " on the DSP, and next thing we do is run the side channel attack. So this is the full thing,"
    },
    {
      "Time_Start": 1533.96,
      "Time_End": 1540.4,
      "Text": " I'm showing you this because we optimized it such that it's stupidly fast, so this only"
    },
    {
      "Time_Start": 1540.4,
      "Time_End": 1547.4,
      "Text": " takes a minute, and then it gives you the key."
    },
    {
      "Time_Start": 1547.4,
      "Time_End": 1554.4,
      "Text": " So all the bytes in between that you see, those are round key bytes."
    },
    {
      "Time_Start": 1578.4,
      "Time_End": 1585.4,
      "Text": " And there we go, that's the key."
    },
    {
      "Time_Start": 1586.4,
      "Time_End": 1593.4,
      "Text": " Now, clearly this isn't the actual Motorola key, it's just a mockup."
    },
    {
      "Time_Start": 1594.4,
      "Time_End": 1601.4,
      "Text": " Right, of course it wouldn't be fair if there weren't even more hurdles for us to jump over,"
    },
    {
      "Time_Start": 1601.4,
      "Time_End": 1608.4,
      "Text": " so it turned out there was an additional encryption layer for which we had to adapt"
    },
    {
      "Time_Start": 1622.72,
      "Time_End": 1628.5600000000002,
      "Text": " the attack to, then there was an additional obfuscation layer which stumped us for a bit,"
    },
    {
      "Time_Start": 1628.56,
      "Time_End": 1633.44,
      "Text": " but once we observed similarities between the loaded modules, it turns out that the"
    },
    {
      "Time_Start": 1633.44,
      "Time_End": 1640.44,
      "Text": " obfuscation was just a rolling XOR that incrementally calculated a checksum, and with that we could"
    },
    {
      "Time_Start": 1640.84,
      "Time_End": 1644.52,
      "Text": " now extract the customer encryption key in less than a minute, we reverse engineered"
    },
    {
      "Time_Start": 1644.52,
      "Time_End": 1649.04,
      "Text": " the remainder of the module format, decrypted our target module, reverse engineered it,"
    },
    {
      "Time_Start": 1649.04,
      "Time_End": 1653.2,
      "Text": " and finally got the secret algorithms."
    },
    {
      "Time_Start": 1653.2,
      "Time_End": 1658.04,
      "Text": " So a little recap for the journey so far, we found a format string vulnerability in"
    },
    {
      "Time_Start": 1658.04,
      "Time_End": 1664.92,
      "Text": " the AT interface on the rear connector of the radio, to get us code execution on the"
    },
    {
      "Time_Start": 1664.92,
      "Time_End": 1670.32,
      "Text": " baseband application processor, we then jumped to the DSP via shared memory, explored the"
    },
    {
      "Time_Start": 1670.32,
      "Time_End": 1674.88,
      "Text": " cache timing side channel on the TEE of the DSP to extract our secret algos, and now we"
    },
    {
      "Time_Start": 1674.88,
      "Time_End": 1679.4,
      "Text": " have them."
    },
    {
      "Time_Start": 1679.4,
      "Time_End": 1683.4,
      "Text": " So that brings us to the point that we can actually start doing what we wanted to do,"
    },
    {
      "Time_Start": 1683.4,
      "Time_End": 1690.4,
      "Text": " and that is analyze the cryptographic primitives underpinning the security of Tetra."
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1701.6000000000001,
      "Text": " We can now finally start doing what we came here for, and that is analyze the security"
    },
    {
      "Time_Start": 1701.6000000000001,
      "Time_End": 1705.44,
      "Text": " of Tetra. All the primitives are by the way public now, so you can get them off GitHub"
    },
    {
      "Time_Start": 1705.48,
      "Time_End": 1710.96,
      "Text": " if you want to take a look at it for yourselves. I will start by explaining some things and"
    },
    {
      "Time_Start": 1710.96,
      "Time_End": 1717.4,
      "Text": " explain some vulnerabilities that we found. So what you see here is how this authentication"
    },
    {
      "Time_Start": 1717.4,
      "Time_End": 1724.4,
      "Text": " is shown in the standards, you see some boxes, TA11, TA22, and those are like black boxes,"
    },
    {
      "Time_Start": 1725.8400000000001,
      "Time_End": 1731.48,
      "Text": " they don't tell you how it works. We are now able to actually inspect how these things"
    },
    {
      "Time_Start": 1731.48,
      "Time_End": 1735.84,
      "Text": " are implemented, and we saw that all the primitives that are marked TA-something are"
    },
    {
      "Time_Start": 1735.84,
      "Time_End": 1742.6,
      "Text": " based on a proprietary cipher named Hurdle, it's a 16-round FISO cipher which uses 64-bit"
    },
    {
      "Time_Start": 1742.6,
      "Time_End": 1749.6,
      "Text": " blocks and a 128-bit key, and the primitives called TB are based on very simple XOR and"
    },
    {
      "Time_Start": 1750.8,
      "Time_End": 1756.3600000000001,
      "Text": " addition operations. Also, interestingly, we found that some of these blocks are identical"
    },
    {
      "Time_Start": 1756.5200000000002,
      "Time_End": 1762.16,
      "Text": " or highly related, and that will help us later."
    },
    {
      "Time_Start": 1762.16,
      "Time_End": 1769.16,
      "Text": " So this is an overview of a part of Hurdle. Hurdle has an F function that combines half"
    },
    {
      "Time_Start": 1769.8000000000002,
      "Time_End": 1776.8000000000002,
      "Text": " of the states, so 32 bits, with 96 bits of round key information, and it has this really"
    },
    {
      "Time_Start": 1778.2400000000002,
      "Time_End": 1783.7600000000002,
      "Text": " extensive cascading structure, so it's quite interesting to look at, and I'm looking really"
    },
    {
      "Time_Start": 1783.76,
      "Time_End": 1787.92,
      "Text": " forward to some professional cryptanalytical insights."
    },
    {
      "Time_Start": 1787.92,
      "Time_End": 1792.8,
      "Text": " We could not break it. We could, however, find the function that originally generated"
    },
    {
      "Time_Start": 1792.8,
      "Time_End": 1799.8,
      "Text": " the S-box, it's based on the Nyberg S-box, just like AES, but we didn't get any further"
    },
    {
      "Time_Start": 1800.92,
      "Time_End": 1805.84,
      "Text": " with this, so we hope some of you guys maybe want to look into this."
    },
    {
      "Time_Start": 1805.84,
      "Time_End": 1810.72,
      "Text": " We will discuss, however, an attack we found on this authentication scheme. What you see"
    },
    {
      "Time_Start": 1810.76,
      "Time_End": 1817.76,
      "Text": " here is how the mobile station and the infrastructure perform mutual authentication, so they generate"
    },
    {
      "Time_Start": 1818.48,
      "Time_End": 1824.56,
      "Text": " some random numbers, and through a cryptographic dance, they prove knowledge of a shared secret"
    },
    {
      "Time_Start": 1824.56,
      "Time_End": 1831.56,
      "Text": " key, and if this authentication succeeds, it will also yield a session key, the DCK,"
    },
    {
      "Time_Start": 1832.72,
      "Time_End": 1837.4,
      "Text": " and below, on the bottom of this slide, you see how this DCK is constructed in terms of"
    },
    {
      "Time_Start": 1837.4,
      "Time_End": 1842.0400000000002,
      "Text": " these primitives. Now that we have obtained these primitives,"
    },
    {
      "Time_Start": 1842.0400000000002,
      "Time_End": 1848.92,
      "Text": " we can do some simplification. We found that TA21 is actually identical to TA11, except"
    },
    {
      "Time_Start": 1848.92,
      "Time_End": 1854.4,
      "Text": " that the RS, the random seed supplied by the infrastructure, has a reversed byte order."
    },
    {
      "Time_Start": 1854.4,
      "Time_End": 1861.4,
      "Text": " Additionally, TA22 is actually identical to TA12, and the TB4 function is nothing more"
    },
    {
      "Time_Start": 1861.6000000000001,
      "Time_End": 1868.2,
      "Text": " than an XOR, so the session key is generated by XORing together two half-session keys that"
    },
    {
      "Time_Start": 1868.2,
      "Time_End": 1873.44,
      "Text": " were generated previously. Now, this is interesting because this allows"
    },
    {
      "Time_Start": 1873.44,
      "Time_End": 1879.92,
      "Text": " for an attack. Let's assume that we impersonate the infrastructure and we target a mobile"
    },
    {
      "Time_Start": 1879.92,
      "Time_End": 1884.88,
      "Text": " station. Additionally, let's assume that we can predict the random number that is being"
    },
    {
      "Time_Start": 1884.88,
      "Time_End": 1889.24,
      "Text": " generated by the mobile station. This may seem like a bit of a stretch, but in embedded"
    },
    {
      "Time_Start": 1889.64,
      "Time_End": 1895.44,
      "Text": " systems, random number generation is really hard and quite often not fully unpredictable,"
    },
    {
      "Time_Start": 1895.44,
      "Time_End": 1899.0,
      "Text": " so this may be more feasible than you might initially think."
    },
    {
      "Time_Start": 1899.0,
      "Time_End": 1905.3,
      "Text": " We can provide the mobile station with an RS, a random seed, that is a palindrome, so"
    },
    {
      "Time_Start": 1905.3,
      "Time_End": 1910.94,
      "Text": " it's identical in the reversed byte order as in the forward byte order. And if we do"
    },
    {
      "Time_Start": 1910.94,
      "Time_End": 1916.92,
      "Text": " all that, then we can simplify the DCK derivation formula to something that has the same on"
    },
    {
      "Time_Start": 1916.92,
      "Time_End": 1922.7,
      "Text": " the left and on the right side of the XOR operation. And by nature of the XOR function,"
    },
    {
      "Time_Start": 1922.7,
      "Time_End": 1927.96,
      "Text": " we end up with a zero key. So what we have achieved in this case is an authenticated"
    },
    {
      "Time_Start": 1927.96,
      "Time_End": 1933.5600000000002,
      "Text": " channel with a mobile station with a known session key of all zeros, without even having"
    },
    {
      "Time_Start": 1933.5600000000002,
      "Time_End": 1940.5600000000002,
      "Text": " knowledge of the original shared secret key. So, next, let's talk about identity encryption."
    },
    {
      "Time_Start": 1941.56,
      "Time_End": 1947.9199999999998,
      "Text": " Identity encryption in Tetra is implemented in a primitive called TA61, and this is used"
    },
    {
      "Time_Start": 1947.9199999999998,
      "Time_End": 1954.9199999999998,
      "Text": " to encrypt 24-bit Tetra addresses, which you can compare to a phone number if you want."
    },
    {
      "Time_Start": 1955.6399999999999,
      "Time_End": 1962.12,
      "Text": " And these encrypted addresses are used for a while until a certain network key is changed."
    },
    {
      "Time_Start": 1962.12,
      "Time_End": 1967.32,
      "Text": " This won't happen very often, maybe every few weeks or so, so Tetra doesn't offer strong"
    },
    {
      "Time_Start": 1967.32,
      "Time_End": 1972.6799999999998,
      "Text": " anonymity but pseudonymity nonetheless. At this point, unfortunately, we cannot disclose"
    },
    {
      "Time_Start": 1972.6799999999998,
      "Time_End": 1979.1799999999998,
      "Text": " the implementation of TA61 due to some serious concerns from Tetra stakeholders. We will"
    },
    {
      "Time_Start": 1979.1799999999998,
      "Time_End": 1983.9199999999998,
      "Text": " publish them in December, but at this point, at least we can share with you the outline"
    },
    {
      "Time_Start": 1983.9199999999998,
      "Time_End": 1990.48,
      "Text": " of an attack so that we can have an informed discussion on the security of this primitive."
    },
    {
      "Time_Start": 1990.48,
      "Time_End": 1997.48,
      "Text": " The attack looks as follows. The CCK network key is first being used in a hurdle encryption"
    },
    {
      "Time_Start": 1997.64,
      "Time_End": 2004.64,
      "Text": " in order to generate a 64-bit intermediate secret, which is shown here as C. And only"
    },
    {
      "Time_Start": 2005.0,
      "Time_End": 2011.88,
      "Text": " then this intermediate secret is used in order to encrypt this 24-bit identity. And this"
    },
    {
      "Time_Start": 2011.88,
      "Time_End": 2018.88,
      "Text": " happens in a weird, two-round, lightweight crypto scheme. And this is vulnerable to a"
    },
    {
      "Time_Start": 2019.72,
      "Time_End": 2026.2,
      "Text": " meet-in-the-middle attack. As an attacker, we can try to gather a few pairs of unencrypted"
    },
    {
      "Time_Start": 2026.2,
      "Time_End": 2032.88,
      "Text": " identities together with their encrypted equivalents and start computing forward from the unencrypted"
    },
    {
      "Time_Start": 2032.88,
      "Time_End": 2039.88,
      "Text": " one and backward from the encrypted one and see at the meeting point which guess for the"
    },
    {
      "Time_Start": 2040.0,
      "Time_End": 2046.16,
      "Text": " intermediate secret C would make sense. And this attack has a complexity of 2 to the 48th,"
    },
    {
      "Time_Start": 2046.16,
      "Time_End": 2051.76,
      "Text": " which on a regular laptop runs in about a minute. And after you have computed this value"
    },
    {
      "Time_Start": 2051.76,
      "Time_End": 2058.76,
      "Text": " of C, you can instantly de-anonymize anything that comes past on the air interface. Also"
    },
    {
      "Time_Start": 2059.12,
      "Time_End": 2063.92,
      "Text": " it gives you an option to attack a hurdle encryption because you have C, which is the"
    },
    {
      "Time_Start": 2063.92,
      "Time_End": 2069.32,
      "Text": " output of a hurdle encryption. And if you can somehow break that encryption and derive"
    },
    {
      "Time_Start": 2069.32,
      "Time_End": 2073.76,
      "Text": " what the original CCK was, there is a very, very serious problem for Tetra. So that's"
    },
    {
      "Time_Start": 2073.76,
      "Time_End": 2079.84,
      "Text": " also something to investigate in the future. Now de-anonymization can be quite serious"
    },
    {
      "Time_Start": 2079.84,
      "Time_End": 2085.32,
      "Text": " depending on the use case of a Tetra network. Tetra identities are typically distributed"
    },
    {
      "Time_Start": 2085.32,
      "Time_End": 2091.5200000000004,
      "Text": " in ranges. So regular police forces will get one range while intervention teams get another"
    },
    {
      "Time_Start": 2091.5200000000004,
      "Time_End": 2096.6400000000003,
      "Text": " range and firefighters will get yet another range. So as an attacker, if you invest some"
    },
    {
      "Time_Start": 2096.6400000000003,
      "Time_End": 2101.96,
      "Text": " effort into identifying which ranges belong to which kind of services, you can have a"
    },
    {
      "Time_Start": 2102.04,
      "Time_End": 2108.56,
      "Text": " very interesting intelligence position. This can be used, for instance, in a counterintelligence"
    },
    {
      "Time_Start": 2108.56,
      "Time_End": 2114.88,
      "Text": " context when you may be able to notice when covert surveillance units are near you all"
    },
    {
      "Time_Start": 2114.88,
      "Time_End": 2121.36,
      "Text": " the time. Or it can serve as an early warning for organized crime when intervention teams"
    },
    {
      "Time_Start": 2121.36,
      "Time_End": 2126.92,
      "Text": " seem to pile up somewhere in the vicinity. The attack is fully passive and can be executed"
    },
    {
      "Time_Start": 2126.92,
      "Time_End": 2133.4,
      "Text": " with very cheap hardware. So it's very realistic that this can be done."
    },
    {
      "Time_Start": 2133.4,
      "Time_End": 2140.2000000000003,
      "Text": " So let's talk about the actual encryption algorithms. In Tetra, traffic is encrypted"
    },
    {
      "Time_Start": 2140.2000000000003,
      "Time_End": 2146.2000000000003,
      "Text": " with one of four key stream generators, as Jos pointed out previously. And we found that"
    },
    {
      "Time_Start": 2146.2000000000003,
      "Time_End": 2152.28,
      "Text": " all of them share a very similar structure. And depicted here is TA2. On the top you see"
    },
    {
      "Time_Start": 2152.28,
      "Time_End": 2157.42,
      "Text": " the key register, an 80-bit register that provides information to the state register"
    },
    {
      "Time_Start": 2157.42,
      "Time_End": 2163.44,
      "Text": " below and eventually the state register will output key stream which is then used for encryption"
    },
    {
      "Time_Start": 2163.44,
      "Time_End": 2170.4,
      "Text": " of Tetra traffic. To us, TA2 looks robust, but we are not cryptographers and more public"
    },
    {
      "Time_Start": 2170.4,
      "Time_End": 2176.44,
      "Text": " scrutiny is needed before we can finally decide that this is all good and safe to use."
    },
    {
      "Time_Start": 2176.44,
      "Time_End": 2181.8,
      "Text": " But this is where it gets real interesting, because we found a backdoor in the TA1 cipher."
    },
    {
      "Time_Start": 2181.8,
      "Time_End": 2187.32,
      "Text": " TA1 is intended for private use cases, commercial use cases like private security, but it's"
    },
    {
      "Time_Start": 2187.32,
      "Time_End": 2193.48,
      "Text": " also been distributed to, like, say, less friendly police and military forces that Europe"
    },
    {
      "Time_Start": 2193.48,
      "Time_End": 2199.48,
      "Text": " did not have very good footing with at the time these networks were originally conceived."
    },
    {
      "Time_Start": 2199.48,
      "Time_End": 2206.28,
      "Text": " TA1 is advertised as having an 80-bit key, but the first thing it does is apply a secret"
    },
    {
      "Time_Start": 2206.32,
      "Time_End": 2212.92,
      "Text": " reduction step that compresses this 80-bit key into a 32-bit register. And from then"
    },
    {
      "Time_Start": 2212.92,
      "Time_End": 2219.36,
      "Text": " on it will only use this 32-bit register for the generation of key stream. So obviously"
    },
    {
      "Time_Start": 2219.36,
      "Time_End": 2225.7200000000003,
      "Text": " this is trivial to attack nowadays. You will be able to crack such a key in a minute and"
    },
    {
      "Time_Start": 2225.7200000000003,
      "Time_End": 2231.0800000000004,
      "Text": " get a key that works for decryption of all traffic on that frequency. Additionally, you"
    },
    {
      "Time_Start": 2231.08,
      "Time_End": 2236.68,
      "Text": " could decide to actually start injecting traffic, which is especially worrisome when"
    },
    {
      "Time_Start": 2236.68,
      "Time_End": 2243.68,
      "Text": " Tetra is used in a data-carrying capacity such as SCADA1 telecontrol kind of traffic."
    },
    {
      "Time_Start": 2245.48,
      "Time_End": 2247.48,
      "Text": " So, small demonstration."
    },
    {
      "Time_Start": 2254.48,
      "Time_End": 2260.36,
      "Text": " Hi, we're Midnight Blue, a specialist security consultancy firm. In this video, we're going"
    },
    {
      "Time_Start": 2260.36,
      "Time_End": 2265.36,
      "Text": " to demonstrate a proof-of-concept attack from the Tetra Burst vulnerabilities recently"
    },
    {
      "Time_Start": 2265.36,
      "Time_End": 2271.7200000000003,
      "Text": " uncovered by our team. Terrestrial Trunked Radio, or Tetra, is a radio communication"
    },
    {
      "Time_Start": 2271.7200000000003,
      "Time_End": 2278.0,
      "Text": " standard used globally by law enforcement, emergency services, military operators, private"
    },
    {
      "Time_Start": 2278.0,
      "Time_End": 2283.52,
      "Text": " security, and harbor and airport personnel. In addition, Tetra is used in a wide area"
    },
    {
      "Time_Start": 2283.52,
      "Time_End": 2289.84,
      "Text": " network carrying capacity for SCADA telecontrol of oil and gas pipelines, electrical substations,"
    },
    {
      "Time_Start": 2289.84,
      "Time_End": 2295.92,
      "Text": " water management, and even railway signaling. Tetra offers confidential communication guaranteed"
    },
    {
      "Time_Start": 2295.92,
      "Time_End": 2301.32,
      "Text": " through its so-called Air Interface Encryption feature. This feature encrypts Tetra traffic"
    },
    {
      "Time_Start": 2301.32,
      "Time_End": 2311.1200000000003,
      "Text": " by means of one of four proprietary stream ciphers, TEA1, TEA2, TEA3, and TEA4. Of these"
    },
    {
      "Time_Start": 2311.1200000000003,
      "Time_End": 2317.04,
      "Text": " ciphers, TEA1 can be exported globally with appropriate export approval and can be used"
    },
    {
      "Time_Start": 2317.04,
      "Time_End": 2322.88,
      "Text": " by both commercial and government parties. As such, TEA1 is used to protect select law"
    },
    {
      "Time_Start": 2322.88,
      "Time_End": 2327.96,
      "Text": " enforcement, military and private security radio communications, as well as SCADA radio"
    },
    {
      "Time_Start": 2327.96,
      "Time_End": 2333.2,
      "Text": " links of global critical infrastructure. Tetra is used in many different sectors, ranging"
    },
    {
      "Time_Start": 2333.2,
      "Time_End": 2338.7599999999998,
      "Text": " from electrical and water utilities to oil and gas, transport, and mining. Since the"
    },
    {
      "Time_Start": 2338.7599999999998,
      "Time_End": 2343.96,
      "Text": " Tetra encryption algorithms have been kept secret for over 20 years, their security has"
    },
    {
      "Time_Start": 2343.96,
      "Time_End": 2350.04,
      "Text": " never been properly publicly evaluated until now. Midnight Blue researchers have reverse-engineered"
    },
    {
      "Time_Start": 2350.04,
      "Time_End": 2356.28,
      "Text": " the algorithms and uncovered several vulnerabilities in Tetra, including a backdoor in the TEA1"
    },
    {
      "Time_Start": 2356.28,
      "Time_End": 2362.56,
      "Text": " algorithm which reduces its advertised key strength of 80 bits to a mere 32 bits. This"
    },
    {
      "Time_Start": 2362.56,
      "Time_End": 2368.12,
      "Text": " backdoor, which has festered in global critical infrastructure for decades, enables the interception"
    },
    {
      "Time_Start": 2368.12,
      "Time_End": 2374.3199999999997,
      "Text": " and manipulation of TEA1-protected Tetra communications from anywhere within cell tower coverage,"
    },
    {
      "Time_Start": 2374.3199999999997,
      "Time_End": 2379.48,
      "Text": " which may be up to tens of kilometers. Due to the simplicity of the backdoor, even attackers"
    },
    {
      "Time_Start": 2379.48,
      "Time_End": 2385.48,
      "Text": " with limited resources, such as a $10 radio dongle, can crack TEA1 keys in a matter of"
    },
    {
      "Time_Start": 2385.48,
      "Time_End": 2390.52,
      "Text": " minutes. In this demonstration, carried out on a real network, the attacker captures traffic"
    },
    {
      "Time_Start": 2390.52,
      "Time_End": 2396.04,
      "Text": " and identifies messages on which to mount the attack. Now, the attacker computes the"
    },
    {
      "Time_Start": 2396.04,
      "Time_End": 2402.52,
      "Text": " key used on this frequency. This will take about a minute. Once the key has been cracked,"
    },
    {
      "Time_Start": 2402.52,
      "Time_End": 2407.56,
      "Text": " voice communications can be intercepted while the attack remains fully undetected, or data"
    },
    {
      "Time_Start": 2407.56,
      "Time_End": 2414.84,
      "Text": " can be actively injected. In the case of SCADA telecontrol communications being carried over"
    },
    {
      "Time_Start": 2414.84,
      "Time_End": 2420.2799999999997,
      "Text": " Tetra-wide area networks, attackers could use this vulnerability to obtain direct access"
    },
    {
      "Time_Start": 2420.2799999999997,
      "Time_End": 2425.08,
      "Text": " deep within the operational technology networks of critical infrastructure, allowing them"
    },
    {
      "Time_Start": 2425.08,
      "Time_End": 2430.92,
      "Text": " to intercept and manipulate network traffic-controlling equipment like switchgear, circuit breakers,"
    },
    {
      "Time_Start": 2430.92,
      "Time_End": 2436.64,
      "Text": " and valves at electrical substations or oil and gas pipelines. Due to the highly sensitive"
    },
    {
      "Time_Start": 2436.64,
      "Time_End": 2441.84,
      "Text": " nature of the uncovered issues, Midnight Blue has spent more than 1.5 years in a carefully"
    },
    {
      "Time_Start": 2441.84,
      "Time_End": 2447.04,
      "Text": " coordinated disclosure process with multiple government and industry stakeholders, guided"
    },
    {
      "Time_Start": 2447.04,
      "Time_End": 2454.04,
      "Text": " by the Dutch government's National Cyber Security Centre. During this process, detailed..."
    },
    {
      "Time_Start": 2454.04,
      "Time_End": 2469.68,
      "Text": " Thank you. Awesome, thank you. So, with a small recap and demonstration video, I think"
    },
    {
      "Time_Start": 2469.68,
      "Time_End": 2476.4,
      "Text": " we made a point, right? Well, Etsy has some interesting things to say about this. First,"
    },
    {
      "Time_Start": 2476.4,
      "Time_End": 2480.7200000000003,
      "Text": " they claim that we are using a very high-powered graphics card in order to be able to attack"
    },
    {
      "Time_Start": 2480.7200000000003,
      "Time_End": 2487.0,
      "Text": " this. Well, in my opinion, a 2016 consumer-grade graphics card is not that high-end, but, hey,"
    },
    {
      "Time_Start": 2487.0,
      "Time_End": 2492.4,
      "Text": " opinions may differ. Also, they state that 25 years ago, when Tetra was standardized,"
    },
    {
      "Time_Start": 2492.4,
      "Time_End": 2498.7200000000003,
      "Text": " 32 bits of key entropy was probably sufficient to withstand attack. And they state that you"
    },
    {
      "Time_Start": 2498.7200000000003,
      "Time_End": 2504.52,
      "Text": " need some pretty reasonable equipment in order to be able to attack TEA-1. Now, I don't think"
    },
    {
      "Time_Start": 2504.52,
      "Time_End": 2511.52,
      "Text": " I have to explain to you guys, thank you, that this just doesn't make sense. But, yeah,"
    },
    {
      "Time_Start": 2516.32,
      "Time_End": 2521.9,
      "Text": " you know, why would we make any assumptions on this? Why would we use reasonable equipment"
    },
    {
      "Time_Start": 2521.9,
      "Time_End": 2528.9,
      "Text": " in order to attack such a cipher? Let's see what this bad boy can do."
    },
    {
      "Time_Start": 2535.52,
      "Time_End": 2542.52,
      "Text": " Hi, we're Midnight Blue. About two weeks ago, we announced the Tetra Burst vulnerabilities,"
    },
    {
      "Time_Start": 2544.84,
      "Time_End": 2549.24,
      "Text": " consisting of five vulnerabilities in the Tetra Radio Standard, two of which are deemed"
    },
    {
      "Time_Start": 2549.24,
      "Time_End": 2554.72,
      "Text": " critical. Since then, Etsy, the standardization body responsible for Tetra, has made public"
    },
    {
      "Time_Start": 2554.72,
      "Time_End": 2559.72,
      "Text": " statements in which they downplay the seriousness of the vulnerabilities. In these statements,"
    },
    {
      "Time_Start": 2559.7200000000003,
      "Time_End": 2564.76,
      "Text": " they resorted to a semantic discussion, not calling a spade a spade, or, more specifically,"
    },
    {
      "Time_Start": 2564.76,
      "Time_End": 2570.2400000000002,
      "Text": " not calling a backdoor a backdoor. Furthermore, they made a number of evidently false statements,"
    },
    {
      "Time_Start": 2570.2400000000002,
      "Time_End": 2574.84,
      "Text": " such as claiming packet injection and TEA-1 encrypted networks would be impossible, and"
    },
    {
      "Time_Start": 2574.84,
      "Time_End": 2579.6800000000003,
      "Text": " that 32 bits of cryptographic strength would have been sufficient in the late 90s."
    },
    {
      "Time_Start": 2579.6800000000003,
      "Time_End": 2584.4,
      "Text": " To any information security expert, it's pretty clear that this is not the case. But to help"
    },
    {
      "Time_Start": 2584.4,
      "Time_End": 2589.2000000000003,
      "Text": " remove those few remaining doubts, we decided to take on the challenge of cracking TEA-1"
    },
    {
      "Time_Start": 2589.2000000000003,
      "Time_End": 2596.2000000000003,
      "Text": " on this beautiful machine produced in 1998, running good old Windows 95."
    },
    {
      "Time_Start": 2601.8,
      "Time_End": 2607.84,
      "Text": " Frankly, the hardware is so old that it wasn't easy to get our hands on. When we run the"
    },
    {
      "Time_Start": 2607.84,
      "Time_End": 2612.4,
      "Text": " cracking tool, we see it reports that it needs about 13 hours to go through the entire search"
    },
    {
      "Time_Start": 2612.4,
      "Time_End": 2619.4,
      "Text": " space. After 12 and a half hours, the key is found, demonstrating the feasibility of"
    },
    {
      "Time_Start": 2620.04,
      "Time_End": 2627.04,
      "Text": " cracking TEA-1 on 90s consumer hardware. Alright Etsy, now that we've cleared up this"
    },
    {
      "Time_Start": 2627.6,
      "Time_End": 2634.6,
      "Text": " issue, please let us know if you'd like us to demonstrate packet injection as well."
    },
    {
      "Time_Start": 2643.4,
      "Time_End": 2650.4,
      "Text": " Right, now, I think we've got that out of the way. So, we discussed TEA-1, it's backdoored,"
    },
    {
      "Time_Start": 2651.04,
      "Time_End": 2656.48,
      "Text": " it's trivially breakable. But the other encryption algorithms should be fine, right? There's"
    },
    {
      "Time_Start": 2656.48,
      "Time_End": 2661.44,
      "Text": " still TEA-2 and TEA-3, which are used generally by law enforcement and emergency services."
    },
    {
      "Time_Start": 2661.44,
      "Time_End": 2667.6,
      "Text": " Well, not really. Because we also found a protocol level vulnerability in Tetra. And"
    },
    {
      "Time_Start": 2667.6,
      "Time_End": 2671.88,
      "Text": " in order to understand that, we need to dive into the standard a little bit more."
    },
    {
      "Time_Start": 2671.88,
      "Time_End": 2677.2400000000002,
      "Text": " So in Tetra, signalling is encrypted and only the very first part, the MAC header,"
    },
    {
      "Time_Start": 2677.2400000000002,
      "Time_End": 2682.4,
      "Text": " is unencrypted. The MAC header contains some high level stuff like the length of the package"
    },
    {
      "Time_Start": 2682.4,
      "Time_End": 2688.2000000000003,
      "Text": " and the addressee of the message. And everything after that is encrypted with the keystream"
    },
    {
      "Time_Start": 2688.2000000000003,
      "Time_End": 2695.2000000000003,
      "Text": " generator. It's important to note that the Tetra messages have no authenticity or integrity"
    },
    {
      "Time_Start": 2695.8,
      "Time_End": 2702.6400000000003,
      "Text": " guarantees whatsoever. So there is a CRC on the MAC level, and you may optionally add"
    },
    {
      "Time_Start": 2702.6400000000003,
      "Time_End": 2709.6400000000003,
      "Text": " a CRC 32 in the data that's encrypted here. But that's not a cryptographic MAC in any"
    },
    {
      "Time_Start": 2709.92,
      "Time_End": 2716.92,
      "Text": " sense. So an attacker will be able to forge messages, and whenever such a message is decrypted,"
    },
    {
      "Time_Start": 2716.92,
      "Time_End": 2721.88,
      "Text": " the radio will just interpret it and parse it at face value."
    },
    {
      "Time_Start": 2721.88,
      "Time_End": 2728.7200000000003,
      "Text": " So the application of the keystream works as follows. The keystream generator function"
    },
    {
      "Time_Start": 2728.7200000000003,
      "Time_End": 2735.7200000000003,
      "Text": " gets two inputs. It gets a key, and it gets an IV. And this IV is intended to make sure"
    },
    {
      "Time_Start": 2736.48,
      "Time_End": 2743.48,
      "Text": " that for each message, a different keystream is being generated. And in Tetra, the IV mostly"
    },
    {
      "Time_Start": 2744.1600000000003,
      "Time_End": 2751.1600000000003,
      "Text": " consists of the network time. So the network time is a set of frame counters. There's"
    },
    {
      "Time_Start": 2751.92,
      "Time_End": 2758.44,
      "Text": " slot, frame, multi-frame, all kinds of frame counters. And these things must be known to"
    },
    {
      "Time_Start": 2758.44,
      "Time_End": 2762.52,
      "Text": " the radio whenever he wants to perform an encryption or a decryption. So how does he"
    },
    {
      "Time_Start": 2762.52,
      "Time_End": 2769.12,
      "Text": " know that? Well, because it's broadcast by the infrastructure in sync and sysinfo frames."
    },
    {
      "Time_Start": 2769.12,
      "Time_End": 2776.12,
      "Text": " And once more, these messages in Tetra have no further integrity guarantees whatsoever."
    },
    {
      "Time_Start": 2776.72,
      "Time_End": 2783.72,
      "Text": " So the attack starts to be clear to some of you maybe. An attacker can decide to overpower"
    },
    {
      "Time_Start": 2783.7599999999998,
      "Time_End": 2790.7599999999998,
      "Text": " the infrastructure and target a mobile station and alter its perception of the network time."
    },
    {
      "Time_Start": 2791.48,
      "Time_End": 2796.7599999999998,
      "Text": " And if you start playing with the sync and sysinfo frames with a targeted mobile station,"
    },
    {
      "Time_Start": 2796.7599999999998,
      "Time_End": 2803.24,
      "Text": " it will happily use those counters and start using keystream that was relevant at the time"
    },
    {
      "Time_Start": 2803.36,
      "Time_End": 2809.4,
      "Text": " you specified to it. And this works regardless of which keystream generator is used. So also"
    },
    {
      "Time_Start": 2809.4,
      "Time_End": 2816.4,
      "Text": " on TEA2 and TEA3. The attack outline would be as follows. Imagine we capture an interesting"
    },
    {
      "Time_Start": 2818.5600000000004,
      "Time_End": 2822.92,
      "Text": " message at some point in time. It's encrypted, but we decide that we would like to have the"
    },
    {
      "Time_Start": 2822.92,
      "Time_End": 2828.6400000000003,
      "Text": " plain text contents. Then at a later point in time, we identify a mobile station that"
    },
    {
      "Time_Start": 2828.64,
      "Time_End": 2834.12,
      "Text": " we want to attack. And it can be the same mobile station. It can also be another mobile"
    },
    {
      "Time_Start": 2834.12,
      "Time_End": 2840.64,
      "Text": " station as long as it has the same key material. We then overpower the legitimate infrastructure"
    },
    {
      "Time_Start": 2840.64,
      "Time_End": 2845.3199999999997,
      "Text": " signal, for instance, by use of directional antennas or just by being closer to it than"
    },
    {
      "Time_Start": 2845.3199999999997,
      "Time_End": 2851.7999999999997,
      "Text": " the regular cell tower is. And from that perspective, we can start messing with the perception of"
    },
    {
      "Time_Start": 2851.7999999999997,
      "Time_End": 2857.12,
      "Text": " time of this mobile station. So we can set the mobile station time all the way back to"
    },
    {
      "Time_Start": 2857.12,
      "Time_End": 2864.04,
      "Text": " time T when we originally captured our encrypted message. Now we will somehow need to be able"
    },
    {
      "Time_Start": 2864.04,
      "Time_End": 2869.7999999999997,
      "Text": " to extract the keystream from the mobile station that we need to decrypt our message. We'll"
    },
    {
      "Time_Start": 2869.7999999999997,
      "Time_End": 2876.16,
      "Text": " get into that later. But if we can do that, then we have one we will be able to decrypt."
    },
    {
      "Time_Start": 2876.16,
      "Time_End": 2882.96,
      "Text": " Now for the recovery of keystream, let's start out with an assumption that we already have"
    },
    {
      "Time_Start": 2882.96,
      "Time_End": 2889.6,
      "Text": " some keystream at our disposal. So we will construct a message that is of length n plus"
    },
    {
      "Time_Start": 2889.6,
      "Time_End": 2896.6,
      "Text": " 1, so one bit longer than the keystream we have, such that it has an FCS, a frame check"
    },
    {
      "Time_Start": 2896.6,
      "Time_End": 2902.8,
      "Text": " sequence, which is a checksum that is embedded in the encrypted part. And it needs an acknowledgement"
    },
    {
      "Time_Start": 2902.8,
      "Time_End": 2908.96,
      "Text": " from the mobile station upon receipt. We can encrypt this message with the keystream we"
    },
    {
      "Time_Start": 2908.96,
      "Time_End": 2914.0,
      "Text": " already have, and the last bit, which we don't have, we will just guess that the keystream"
    },
    {
      "Time_Start": 2914.0,
      "Time_End": 2919.56,
      "Text": " bit there is zero. We send it to the mobile station, and the mobile station will decrypt"
    },
    {
      "Time_Start": 2919.56,
      "Time_End": 2924.92,
      "Text": " the message, check the checksum, and if everything is good, send an acknowledgement. If that"
    },
    {
      "Time_Start": 2924.92,
      "Time_End": 2929.92,
      "Text": " happens, we know the keystream guess was correct, and we have now recovered one additional bit"
    },
    {
      "Time_Start": 2929.92,
      "Time_End": 2935.2400000000002,
      "Text": " of keystream. If we do not get an acknowledgement, we know our guess was wrong, and we have still"
    },
    {
      "Time_Start": 2935.2400000000002,
      "Time_End": 2940.84,
      "Text": " recovered a bit of keystream. You can repeat this, and each time you will recover an additional"
    },
    {
      "Time_Start": 2940.84,
      "Time_End": 2947.84,
      "Text": " bit of keystream up to the length you desire. Now, this assumption of having initial keystream"
    },
    {
      "Time_Start": 2948.84,
      "Time_End": 2953.6800000000003,
      "Text": " is nice, but we need more. We need to have something that actually works in order to"
    },
    {
      "Time_Start": 2953.6800000000003,
      "Time_End": 2960.6800000000003,
      "Text": " generate this initial keystream. And we are going to do that by sending 16 messages to"
    },
    {
      "Time_Start": 2960.7599999999998,
      "Time_End": 2967.48,
      "Text": " the mobile station, and the first four bits will all be tried, and we add the last zero."
    },
    {
      "Time_Start": 2967.48,
      "Time_End": 2974.48,
      "Text": " It doesn't matter what is there, but we will try 0, 0, 0, 0 up to 1, 1, 1, 1, 0. And given"
    },
    {
      "Time_Start": 2975.24,
      "Time_End": 2980.8799999999997,
      "Text": " how Tetra works, these four bits encode the message type on the LLC level. And what's"
    },
    {
      "Time_Start": 2980.8799999999997,
      "Time_End": 2986.9199999999996,
      "Text": " interesting is that for these 16 messages, there will be exactly one message that will"
    },
    {
      "Time_Start": 2986.92,
      "Time_End": 2993.2400000000002,
      "Text": " get an acknowledgement from the mobile station. And this is the BL data without FCS message"
    },
    {
      "Time_Start": 2993.2400000000002,
      "Time_End": 2998.28,
      "Text": " type. And all the other messages are either supposed to be way longer, and thus discarded"
    },
    {
      "Time_Start": 2998.28,
      "Time_End": 3004.7200000000003,
      "Text": " as being invalid, or will not require an acknowledgement to be sent in the first place. So we try these"
    },
    {
      "Time_Start": 3004.7200000000003,
      "Time_End": 3011.7200000000003,
      "Text": " 16 messages, we will get one acknowledgement, and that means that we will know how the mobile"
    },
    {
      "Time_Start": 3012.5200000000004,
      "Time_End": 3019.5200000000004,
      "Text": " station decrypted this. So we will know four bits of keystream. That's pretty cool, but"
    },
    {
      "Time_Start": 3020.36,
      "Time_End": 3024.5600000000004,
      "Text": " still we need a bit more, because the shortest message we can use for the first attack we"
    },
    {
      "Time_Start": 3024.5600000000004,
      "Time_End": 3031.5600000000004,
      "Text": " presented here is 37 bits long. So what we do is we recover these four bits for 10 consecutive"
    },
    {
      "Time_Start": 3032.36,
      "Time_End": 3039.36,
      "Text": " slots. And we then craft our 37 bits message with the checksum inside of it, and we use"
    },
    {
      "Time_Start": 3040.36,
      "Time_End": 3047.36,
      "Text": " MAC fragmentation, a fragmentation feature Tetra offers, in order to distribute our message"
    },
    {
      "Time_Start": 3048.6,
      "Time_End": 3055.1600000000003,
      "Text": " over all of these small slots where we have only four bits of keystream available. The"
    },
    {
      "Time_Start": 3055.1600000000003,
      "Time_End": 3060.48,
      "Text": " radio will then make sure that these things are stitched back together, will decrypt them,"
    },
    {
      "Time_Start": 3060.48,
      "Time_End": 3065.28,
      "Text": " will validate whether the checksum makes sense. If it makes sense, you get an acknowledgement,"
    },
    {
      "Time_Start": 3065.28,
      "Time_End": 3070.32,
      "Text": " the story we discussed. So in this way, you can easily choose for which slot you would"
    },
    {
      "Time_Start": 3070.32,
      "Time_End": 3076.96,
      "Text": " like to have an additional bit of keystream, make a guess on that keystream bit, and recover"
    },
    {
      "Time_Start": 3076.96,
      "Time_End": 3083.96,
      "Text": " an additional bit. So when we presented this to Etsy, they said that's an interesting and"
    },
    {
      "Time_Start": 3084.8,
      "Time_End": 3089.88,
      "Text": " valid theoretical attack, but it's quite serious because it affects all keystream generators."
    },
    {
      "Time_Start": 3089.88,
      "Time_End": 3095.0400000000004,
      "Text": " So we asked them, okay, understandable, but please provide us with a base station so we"
    },
    {
      "Time_Start": 3095.04,
      "Time_End": 3100.2,
      "Text": " can instrument it and validate whether this attack is actually practical. And they said,"
    },
    {
      "Time_Start": 3100.2,
      "Time_End": 3107.2,
      "Text": " lol no, maybe the wording was a little different. We tried more stakeholders, and they all responded"
    },
    {
      "Time_Start": 3107.56,
      "Time_End": 3114.12,
      "Text": " like this. So we had to go about this in another way. So what options do we have? We could"
    },
    {
      "Time_Start": 3114.12,
      "Time_End": 3119.2,
      "Text": " implement the Tetra infrastructure stack on a software-defined radio, and in that way"
    },
    {
      "Time_Start": 3119.2,
      "Time_End": 3124.8,
      "Text": " try to target our radio, but that sounds like an awful lot of work. It's very complex, painstaking,"
    },
    {
      "Time_Start": 3125.6800000000003,
      "Time_End": 3132.32,
      "Text": " not what we're here for, right? So what we did is get our own base station. Meet the"
    },
    {
      "Time_Start": 3132.32,
      "Time_End": 3138.92,
      "Text": " Motorola MBTS. It's old, it's heavy, I believe it's 75 kilos or something. It was a clear"
    },
    {
      "Time_Start": 3138.92,
      "Time_End": 3145.04,
      "Text": " text base station, so it doesn't support encryption, and it's cool as fuck. And we decided to transform"
    },
    {
      "Time_Start": 3145.04,
      "Time_End": 3152.04,
      "Text": " this thing into an attack platform. So short overview of the MBTS. It has two main components."
    },
    {
      "Time_Start": 3152.52,
      "Time_End": 3157.88,
      "Text": " It has a side controller, which does all the high-level stuff, and it also holds the firmwares"
    },
    {
      "Time_Start": 3157.88,
      "Time_End": 3163.64,
      "Text": " for both itself and for the base radio modules. And these base radio modules, you can have"
    },
    {
      "Time_Start": 3163.64,
      "Time_End": 3168.6,
      "Text": " one or multiple of them. They are actually connected to the antenna. They perform modulation"
    },
    {
      "Time_Start": 3168.6,
      "Time_End": 3174.4,
      "Text": " and demodulation, but they also perform the encryption. Both of these components are running"
    },
    {
      "Time_Start": 3174.4,
      "Time_End": 3181.4,
      "Text": " on PSOS Plus real-time operating system, and based on PowerPC CPUs. Also, the MBTS has"
    },
    {
      "Time_Start": 3182.92,
      "Time_End": 3187.12,
      "Text": " management consoles over a serial port, so you can connect to the serial port, enter"
    },
    {
      "Time_Start": 3187.12,
      "Time_End": 3192.56,
      "Text": " some passwords, and then you're allowed to enter commands for diagnostics and for debugging"
    },
    {
      "Time_Start": 3192.56,
      "Time_End": 3199.56,
      "Text": " purposes. Interestingly, both of these things use unsigned firmwares."
    },
    {
      "Time_Start": 3199.72,
      "Time_End": 3206.72,
      "Text": " So let's go do some base station hacking. We modified the firmwares in order to allow"
    },
    {
      "Time_Start": 3206.96,
      "Time_End": 3211.12,
      "Text": " for the implementation of a proof of concept, and the first thing we did was implement a"
    },
    {
      "Time_Start": 3211.12,
      "Time_End": 3216.2,
      "Text": " tinker command, which can be invoked from the command line. And our tinker command"
    },
    {
      "Time_Start": 3216.2,
      "Time_End": 3222.04,
      "Text": " allows raw memory access, so you can just enter a command, read memory, or with another"
    },
    {
      "Time_Start": 3222.04,
      "Time_End": 3226.7599999999998,
      "Text": " command write to memory. You can also execute memory by just jumping to a random memory"
    },
    {
      "Time_Start": 3226.7599999999998,
      "Time_End": 3231.64,
      "Text": " address as specified. And we also added malloc and free primitives so that you can allocate"
    },
    {
      "Time_Start": 3231.64,
      "Time_End": 3238.64,
      "Text": " blocks of memory for use for other stuff. Also, we added TEA support. We used our own"
    },
    {
      "Time_Start": 3239.16,
      "Time_End": 3244.72,
      "Text": " reference implementation for that, and what was very helpful was that this firmware already"
    },
    {
      "Time_Start": 3244.72,
      "Time_End": 3250.64,
      "Text": " supported almost the entire suite of cryptography that's required for Tetra, but it just had"
    },
    {
      "Time_Start": 3250.64,
      "Time_End": 3256.2,
      "Text": " an empty stop function for the keystream generator. So we replaced that, we did some more small"
    },
    {
      "Time_Start": 3256.2,
      "Time_End": 3262.48,
      "Text": " changes, and we had a functional encrypting base station on our hands."
    },
    {
      "Time_Start": 3262.48,
      "Time_End": 3268.4,
      "Text": " We wrote a framework that allows for the loading of modules into the memory of the base station"
    },
    {
      "Time_Start": 3269.0,
      "Time_End": 3273.4,
      "Text": " and for the placement of hooks on functions where we were either interested in debugging"
    },
    {
      "Time_Start": 3273.4,
      "Time_End": 3280.1600000000003,
      "Text": " or changing the behavior. So, making implants for this base station was kind of straightforward"
    },
    {
      "Time_Start": 3280.1600000000003,
      "Time_End": 3287.1600000000003,
      "Text": " actually. Right, so we then decided to continue and start working on our proof of concept,"
    },
    {
      "Time_Start": 3289.88,
      "Time_End": 3296.4,
      "Text": " for which we dedicated the .ksreuse command, which allows the base station to suddenly"
    },
    {
      "Time_Start": 3296.44,
      "Time_End": 3302.96,
      "Text": " change the network time as required in order to be able to mount the attack. And also it"
    },
    {
      "Time_Start": 3302.96,
      "Time_End": 3308.08,
      "Text": " implements the recovery mechanisms that I've just explained to you guys."
    },
    {
      "Time_Start": 3308.08,
      "Time_End": 3314.08,
      "Text": " Once we started messing with the network time, we saw that our radio rebooted, our mobile"
    },
    {
      "Time_Start": 3314.08,
      "Time_End": 3319.32,
      "Text": " radio rebooted, and we found that it was due to some synchronization issues in Tetra. Certain"
    },
    {
      "Time_Start": 3319.32,
      "Time_End": 3323.36,
      "Text": " messages are expected at certain times, and if you mess with the timing, then it will"
    },
    {
      "Time_Start": 3323.52,
      "Time_End": 3328.8,
      "Text": " start misinterpreting stuff. This can be resolved. We resolved it by making sure our time changes"
    },
    {
      "Time_Start": 3328.8,
      "Time_End": 3334.1600000000003,
      "Text": " aligned to four multi-frames. It can be done neater, it will get you a performance improvement,"
    },
    {
      "Time_Start": 3334.1600000000003,
      "Time_End": 3338.2400000000002,
      "Text": " but that's way beyond what a proof of concept should be. So, with some more tinkering, our"
    },
    {
      "Time_Start": 3338.2400000000002,
      "Time_End": 3344.1600000000003,
      "Text": " MTM radio gladly accepts any jump in network time, and we can start attacking."
    },
    {
      "Time_Start": 3344.1600000000003,
      "Time_End": 3349.6,
      "Text": " One last thing on the base station, we found several vulnerabilities. For instance, the"
    },
    {
      "Time_Start": 3349.6,
      "Time_End": 3355.2,
      "Text": " unauthenticated firmwares, which is quite an issue for mission-critical communications."
    },
    {
      "Time_Start": 3355.2,
      "Time_End": 3361.2,
      "Text": " An attacker could implant such a thing and gain permanent access to a base station, or"
    },
    {
      "Time_Start": 3361.2,
      "Time_End": 3367.36,
      "Text": " he can just exfiltrate keys and be on his way. Also, the firmwares of both the side"
    },
    {
      "Time_Start": 3367.36,
      "Time_End": 3373.52,
      "Text": " controller and the base radio have hard-coded, undocumented backdoor passwords. These passwords"
    },
    {
      "Time_Start": 3373.52,
      "Time_End": 3377.64,
      "Text": " give you an authentication level on the command line that's even higher than the system's"
    },
    {
      "Time_Start": 3377.68,
      "Time_End": 3384.3599999999997,
      "Text": " owner would normally have. Lastly, if you can crash the side controller by some kind"
    },
    {
      "Time_Start": 3384.3599999999997,
      "Time_End": 3390.16,
      "Text": " of unhandled exception, it will drop to a debug shell that allows you direct code execution"
    },
    {
      "Time_Start": 3390.16,
      "Time_End": 3397.16,
      "Text": " and memory access, once again allowing for key exfiltration."
    },
    {
      "Time_Start": 3397.16,
      "Time_End": 3401.4,
      "Text": " We have looked at multiple radios, multiple base stations, and mobile stations at this"
    },
    {
      "Time_Start": 3401.4,
      "Time_End": 3406.68,
      "Text": " point, and there seems to be some kind of industry-wide issue here. The software stacks"
    },
    {
      "Time_Start": 3406.6800000000003,
      "Time_End": 3411.9600000000005,
      "Text": " that are being used are really not up to standards, and we start wondering whether"
    },
    {
      "Time_Start": 3411.9600000000005,
      "Time_End": 3418.9600000000005,
      "Text": " anyone is actually pen-testing these things in any condition. In any case, here is a demonstration"
    },
    {
      "Time_Start": 3419.7400000000002,
      "Time_End": 3424.2400000000002,
      "Text": " video for the keystream recovery attack."
    },
    {
      "Time_Start": 3424.2400000000002,
      "Time_End": 3431.2400000000002,
      "Text": " Hi, we are Midnight Blue. We have uncovered several serious vulnerabilities in the Tetra"
    },
    {
      "Time_Start": 3432.2000000000003,
      "Time_End": 3437.6000000000004,
      "Text": " radio standard, dubbed Tetra Burst. We will first demonstrate a decryption oracle attack"
    },
    {
      "Time_Start": 3437.6000000000004,
      "Time_End": 3442.2000000000003,
      "Text": " to recover a text message, but the attack can also be applied to voice communication"
    },
    {
      "Time_Start": 3442.2000000000003,
      "Time_End": 3449.2000000000003,
      "Text": " and data. The demonstration takes place on our lab setup. The radio receives an encrypted"
    },
    {
      "Time_Start": 3449.28,
      "Time_End": 3456.28,
      "Text": " message which is also captured by the attacker. We see the message says secret."
    },
    {
      "Time_Start": 3462.2400000000002,
      "Time_End": 3466.76,
      "Text": " The attacker now needs to target the radio and impersonate the infrastructure and carry"
    },
    {
      "Time_Start": 3466.76,
      "Time_End": 3473.76,
      "Text": " out the attack to decrypt the previously captured message. We have sped up this process."
    },
    {
      "Time_Start": 3485.2000000000003,
      "Time_End": 3489.88,
      "Text": " The attacker has now recovered all he needs to decrypt the message. This attack applies"
    },
    {
      "Time_Start": 3489.88,
      "Time_End": 3495.46,
      "Text": " to all Tetra configurations, but can be resolved with a firmware update. Further details will"
    },
    {
      "Time_Start": 3495.46,
      "Time_End": 3502.46,
      "Text": " be disclosed on August 9th."
    },
    {
      "Time_Start": 3508.34,
      "Time_End": 3513.56,
      "Text": " So this is pretty concrete, right? So what would Etsy say about this? We presented our"
    },
    {
      "Time_Start": 3513.56,
      "Time_End": 3520.56,
      "Text": " proof of concept status and now in their public response on the vulnerabilities we"
    },
    {
      "Time_Start": 3521.16,
      "Time_End": 3527.68,
      "Text": " uncovered, all they have to say on this keystream recovery issue is that our research uncovered"
    },
    {
      "Time_Start": 3527.68,
      "Time_End": 3532.68,
      "Text": " some general areas for improvement in the Tetra protocol."
    },
    {
      "Time_Start": 3532.68,
      "Time_End": 3539.68,
      "Text": " Lastly, I would like to draw your attention to TA3. We have analyzed it and we have not"
    },
    {
      "Time_Start": 3540.4400000000005,
      "Time_End": 3546.32,
      "Text": " found it vulnerable, but there is something very weird going on. Now in the other TS there"
    },
    {
      "Time_Start": 3546.32,
      "Time_End": 3553.32,
      "Text": " is also an S-box, but these S-boxes look normal like an S-box should look. In TA3 the S-box"
    },
    {
      "Time_Start": 3554.0000000000005,
      "Time_End": 3560.4,
      "Text": " is not a permutation, so there is one entry that is there twice. This is highly irregular"
    },
    {
      "Time_Start": 3560.4,
      "Time_End": 3567.4,
      "Text": " and certainly not a positive thing for the security of this algorithm."
    },
    {
      "Time_Start": 3568.4,
      "Time_End": 3573.6,
      "Text": " It might be a mistake, right? Just some random bit-flip that occurred somewhere. Well at"
    },
    {
      "Time_Start": 3573.6,
      "Time_End": 3577.36,
      "Text": " least it has to be a mistake when the standard was drafted because if not our radio would"
    },
    {
      "Time_Start": 3577.36,
      "Time_End": 3584.36,
      "Text": " not be compatible with other radios in the field. And what makes it extra suspicious"
    },
    {
      "Time_Start": 3584.56,
      "Time_End": 3590.52,
      "Text": " is the fact that there is another small structural change to the feedback mechanism of the key"
    },
    {
      "Time_Start": 3590.52,
      "Time_End": 3596.88,
      "Text": " register that hides the issue. Usually you get state merges and in this case you don't."
    },
    {
      "Time_Start": 3596.88,
      "Time_End": 3603.88,
      "Text": " So there is another small difference from TA1 and TA2 that is here that kind of masks"
    },
    {
      "Time_Start": 3604.56,
      "Time_End": 3609.8,
      "Text": " that there is something weird going on. So at this point the impact is unclear, but we"
    },
    {
      "Time_Start": 3609.8,
      "Time_End": 3614.56,
      "Text": " are really asking anyone who knows his way around these kind of things to take a good"
    },
    {
      "Time_Start": 3614.56,
      "Time_End": 3619.28,
      "Text": " look at it and publish their findings."
    },
    {
      "Time_Start": 3619.28,
      "Time_End": 3623.8,
      "Text": " So let's discuss the Coordinated Vulnerability Disclosure process. We started working on"
    },
    {
      "Time_Start": 3623.8,
      "Time_End": 3629.52,
      "Text": " this project in January 2021 and it took us four months to get the secret cryptography"
    },
    {
      "Time_Start": 3629.52,
      "Time_End": 3636.52,
      "Text": " out of the radio. The rest of the year we spent on analysis of the ciphers, on analysis"
    },
    {
      "Time_Start": 3636.76,
      "Time_End": 3642.5600000000004,
      "Text": " of the protocol and on building some proof of concepts. At the end of 2021, in December,"
    },
    {
      "Time_Start": 3642.5600000000004,
      "Time_End": 3649.5600000000004,
      "Text": " we contacted the Dutch NCSC which then started enumerating stakeholders and in January 2022"
    },
    {
      "Time_Start": 3649.84,
      "Time_End": 3654.6,
      "Text": " we got our first meetings with the Dutch police, with ETSI, the standardisation body and with"
    },
    {
      "Time_Start": 3654.6,
      "Time_End": 3661.48,
      "Text": " the intelligence community. In February we distributed a preliminary advisory that was"
    },
    {
      "Time_Start": 3661.48,
      "Time_End": 3667.48,
      "Text": " to be distributed among stakeholders. The remainder of the year we were in touch with"
    },
    {
      "Time_Start": 3667.48,
      "Time_End": 3673.48,
      "Text": " various stakeholders like manufacturers, network operators, users in order to do our best"
    },
    {
      "Time_Start": 3673.48,
      "Time_End": 3677.6,
      "Text": " into helping them understand the vulnerabilities and understand mitigations that they could"
    },
    {
      "Time_Start": 3677.8399999999997,
      "Time_End": 3681.48,
      "Text": " take."
    },
    {
      "Time_Start": 3681.48,
      "Time_End": 3687.08,
      "Text": " Now let's talk mitigations. The keystream recovery attack can be resolved in firmware"
    },
    {
      "Time_Start": 3687.08,
      "Time_End": 3694.08,
      "Text": " because the radio can be told not to trust these weird changes in network time. It's"
    },
    {
      "Time_Start": 3694.08,
      "Time_End": 3698.7999999999997,
      "Text": " important, however, that these patches are properly validated because it's a tricky thing"
    },
    {
      "Time_Start": 3698.7999999999997,
      "Time_End": 3704.0,
      "Text": " to tackle and it's easy to get it wrong. Alternatively, end-to-end encryption can be used to have a"
    },
    {
      "Time_Start": 3704.0,
      "Time_End": 3709.4,
      "Text": " secondary layer of encryption on top of the air interface encryption and if you're using"
    },
    {
      "Time_Start": 3709.4,
      "Time_End": 3715.28,
      "Text": " a tetra radio in a data-carrying capacity, you can also consider TLS or IPSec to add"
    },
    {
      "Time_Start": 3715.28,
      "Time_End": 3722.28,
      "Text": " additional encryption. The TA1 backdoor obviously cannot be resolved with a firmware patch because"
    },
    {
      "Time_Start": 3723.08,
      "Time_End": 3728.64,
      "Text": " it's an essential part of the standard. So we would recommend TA1 users to migrate to"
    },
    {
      "Time_Start": 3728.72,
      "Time_End": 3735.72,
      "Text": " TA2 or alternatively, if that's not possible, use end-to-end encryption or TA3."
    },
    {
      "Time_Start": 3737.56,
      "Time_End": 3742.44,
      "Text": " The de-anonymization attack also cannot be resolved with a firmware update. These users"
    },
    {
      "Time_Start": 3742.44,
      "Time_End": 3749.3599999999997,
      "Text": " will have to migrate to TAA2 which is a new version of the standard that Etsy has drafted"
    },
    {
      "Time_Start": 3749.3599999999997,
      "Time_End": 3755.68,
      "Text": " and has been published last year. This implements a new encryption mechanism for identities"
    },
    {
      "Time_Start": 3755.6800000000003,
      "Time_End": 3762.2000000000003,
      "Text": " that should be better. Lastly, we have the DCK pinning attack, the session key pinning"
    },
    {
      "Time_Start": 3762.2000000000003,
      "Time_End": 3769.2000000000003,
      "Text": " attack. This can also be resolved with a firmware update."
    },
    {
      "Time_Start": 3770.9600000000005,
      "Time_End": 3776.1400000000003,
      "Text": " Thanks for that. So in the aftermath of disclosing these issues, there were some interesting"
    },
    {
      "Time_Start": 3776.1400000000003,
      "Time_End": 3782.8,
      "Text": " discussions with Etsy which we'd like to highlight. So in Kim Zetter's interview with the Etsy"
    },
    {
      "Time_Start": 3782.88,
      "Time_End": 3788.7200000000003,
      "Text": " Tetra chairman, he says a couple of interesting things. First of all, he says, well, TA1,"
    },
    {
      "Time_Start": 3788.7200000000003,
      "Time_End": 3792.96,
      "Text": " is it such a big deal, this backdoor? Because, you know, anyone in Europe who would need"
    },
    {
      "Time_Start": 3792.96,
      "Time_End": 3799.88,
      "Text": " high security would be using TA2. Well, I mean, this is not true. We look through various"
    },
    {
      "Time_Start": 3799.88,
      "Time_End": 3806.1200000000003,
      "Text": " standards and procurement documents and they show that TA1 equipment was procured by various"
    },
    {
      "Time_Start": 3806.1200000000003,
      "Time_End": 3811.1200000000003,
      "Text": " countries for police and military use in the last five years. And these are countries like"
    },
    {
      "Time_Start": 3811.2,
      "Time_End": 3818.2,
      "Text": " Poland, Bulgaria, Croatia, Montenegro, Moldova, all of which are either EU countries or candidate"
    },
    {
      "Time_Start": 3818.2,
      "Time_End": 3823.16,
      "Text": " EU countries. And some of these have been allowed to use TA2 according to Etsy's own"
    },
    {
      "Time_Start": 3823.16,
      "Time_End": 3829.08,
      "Text": " standards as far back as 2003 or 2008. Regardless, in the last five years they were supplied"
    },
    {
      "Time_Start": 3829.08,
      "Time_End": 3833.7599999999998,
      "Text": " with this backdoor algorithm within Europe. So what happened here, we don't know, but"
    },
    {
      "Time_Start": 3833.7599999999998,
      "Time_End": 3839.68,
      "Text": " it's not just limited to the outside of Europe. Secondly, when it comes to the use of TA1"
    },
    {
      "Time_Start": 3839.6800000000003,
      "Time_End": 3844.7200000000003,
      "Text": " in critical infrastructure, the chairman says, well, if you're using TA1, well, we"
    },
    {
      "Time_Start": 3844.7200000000003,
      "Time_End": 3848.32,
      "Text": " know that certainly a government actor could have a go at them in a short order because"
    },
    {
      "Time_Start": 3848.32,
      "Time_End": 3851.76,
      "Text": " that's what the researchers have proved. But he says, you know, you might be able to migrate"
    },
    {
      "Time_Start": 3851.76,
      "Time_End": 3857.6000000000004,
      "Text": " away or, you know, are high value targets actually using this? Well, the problem in"
    },
    {
      "Time_Start": 3857.6000000000004,
      "Time_End": 3862.6400000000003,
      "Text": " critical infrastructure is that you don't have a lot of choice. You can get TA1, 2,"
    },
    {
      "Time_Start": 3862.6400000000003,
      "Time_End": 3868.84,
      "Text": " or TA3. You're limited to TA1 due to the export controls. In many cases, there are no tetra"
    },
    {
      "Time_Start": 3868.88,
      "Time_End": 3874.84,
      "Text": " end-to-end solutions for the RTUs, the remote terminal units that you use in critical infrastructure."
    },
    {
      "Time_Start": 3874.84,
      "Time_End": 3879.1200000000003,
      "Text": " And some of the compensated controls that you might want to take, such as TLS or IPSAC"
    },
    {
      "Time_Start": 3879.1200000000003,
      "Time_End": 3885.32,
      "Text": " on top of tetra, might not be supported by these RTUs either. And even if you could migrate"
    },
    {
      "Time_Start": 3885.32,
      "Time_End": 3890.8,
      "Text": " away to TA2 or TA3, sometimes this is just not possible in field. As you can see on the"
    },
    {
      "Time_Start": 3890.8,
      "Time_End": 3896.08,
      "Text": " snippet from the manual from one of the popular tetra RTUs, you pick an algorithm and then"
    },
    {
      "Time_Start": 3896.08,
      "Time_End": 3899.48,
      "Text": " you stick with it. You can't update it in the field. So now you're stuck with this"
    },
    {
      "Time_Start": 3899.48,
      "Time_End": 3905.44,
      "Text": " 32 bits of security. But maybe all of the stuff we've covered, you know, maybe it doesn't"
    },
    {
      "Time_Start": 3905.44,
      "Time_End": 3910.08,
      "Text": " matter. Maybe it's a big nothing burger because nobody actually targets tetra networks. And"
    },
    {
      "Time_Start": 3910.08,
      "Time_End": 3915.84,
      "Text": " actually in Etsy's official statement, they say, Etsy and TCCA are not at this time aware"
    },
    {
      "Time_Start": 3915.84,
      "Time_End": 3920.7999999999997,
      "Text": " of any exploitations on operational networks. Well, that's interesting because two out of"
    },
    {
      "Time_Start": 3920.7999999999997,
      "Time_End": 3925.7599999999998,
      "Text": " five attacks are passive, so how are you going to notice that? And it's also not true because"
    },
    {
      "Time_Start": 3925.76,
      "Time_End": 3931.28,
      "Text": " we looked through the Snowden documents and we found that a joint NSA and Australian Signals"
    },
    {
      "Time_Start": 3931.28,
      "Time_End": 3937.2400000000002,
      "Text": " Directorate project was undertaken in 2007 against the United Nations Climate Change"
    },
    {
      "Time_Start": 3937.2400000000002,
      "Time_End": 3942.32,
      "Text": " Conference in Bali, where they targeted the networks of the Indonesian police and they"
    },
    {
      "Time_Start": 3942.32,
      "Time_End": 3946.76,
      "Text": " collected tetra communications describing demonstration routes, as well as the Bali"
    },
    {
      "Time_Start": 3946.76,
      "Time_End": 3951.82,
      "Text": " chief of police's private mobile phone number. Now, they don't go into the technical details,"
    },
    {
      "Time_Start": 3951.82,
      "Time_End": 3956.5,
      "Text": " so this is not proof of our vulnerabilities being exploited, might be, might not be,"
    },
    {
      "Time_Start": 3956.5,
      "Time_End": 3962.78,
      "Text": " but it does show that tetra networks are being actively targeted. We also found a second"
    },
    {
      "Time_Start": 3962.78,
      "Time_End": 3969.1000000000004,
      "Text": " reference in the Snowden documents where GCHQ mentions that in 2009 they undertook what"
    },
    {
      "Time_Start": 3969.1000000000004,
      "Time_End": 3975.54,
      "Text": " they call an effects operation called Operation Kido against Argentina around a conflict regarding"
    },
    {
      "Time_Start": 3975.54,
      "Time_End": 3980.92,
      "Text": " oil exploration rights tensions regarding the Falklands or Malvinas Isles. And here they"
    },
    {
      "Time_Start": 3980.92,
      "Time_End": 3985.76,
      "Text": " mentioned they were collecting high priority military and leadership communications and"
    },
    {
      "Time_Start": 3985.76,
      "Time_End": 3990.2400000000002,
      "Text": " that involved a number of tetra collects. So this shows again, you know, tetra networks"
    },
    {
      "Time_Start": 3990.2400000000002,
      "Time_End": 3996.92,
      "Text": " are being targeted. So, what's next? Well, Etsy announced an update to the standard."
    },
    {
      "Time_Start": 3996.92,
      "Time_End": 4001.96,
      "Text": " They're going to replace the TAA1 authentication suite with TAA2. They're going to update the"
    },
    {
      "Time_Start": 4001.96,
      "Time_End": 4008.48,
      "Text": " TAA1 to 3 algorithms with 5 to 7. They have some mitigations around the key stream recovery"
    },
    {
      "Time_Start": 4008.52,
      "Time_End": 4013.88,
      "Text": " attack and they're going to keep the new algorithms all secret again. So, in the interview with"
    },
    {
      "Time_Start": 4013.88,
      "Time_End": 4019.2,
      "Text": " the chairman, the journalist asked, you know, if you're saying the only reason these algorithms"
    },
    {
      "Time_Start": 4019.2,
      "Time_End": 4023.44,
      "Text": " are secret is because the government has advised it, can Etsy actually decide to make them"
    },
    {
      "Time_Start": 4023.44,
      "Time_End": 4027.96,
      "Text": " public on their own? And then they say, yes, we can make that decision, and then the journalist"
    },
    {
      "Time_Start": 4027.96,
      "Time_End": 4033.8,
      "Text": " asks, so why don't you? And the only answer is, well, I don't know. So, should we trust"
    },
    {
      "Time_Start": 4033.8,
      "Time_End": 4038.48,
      "Text": " TAA6 and 7, especially because these will be the new export controlled ones? What do"
    },
    {
      "Time_Start": 4038.48,
      "Time_End": 4045.48,
      "Text": " you think? No. Well, let's just ask Etsy themselves first. So, the journalist says, should we"
    },
    {
      "Time_Start": 4045.48,
      "Time_End": 4050.88,
      "Text": " trust Etsy algorithms going forward? And then the chairman says, well, we have no reason"
    },
    {
      "Time_Start": 4050.88,
      "Time_End": 4055.32,
      "Text": " to produce dodgy algorithms, if you like, you know, except for the ones that they did."
    },
    {
      "Time_Start": 4055.32,
      "Time_End": 4059.4,
      "Text": " And then he goes further and he says, well, these algorithms were just handed to us and"
    },
    {
      "Time_Start": 4059.4,
      "Time_End": 4063.48,
      "Text": " they were designed with some assistance from some government authorities. Let me put it"
    },
    {
      "Time_Start": 4063.48,
      "Time_End": 4067.48,
      "Text": " that way. And a little bit later he says, well, at the end of the day, it's down to"
    },
    {
      "Time_Start": 4067.48,
      "Time_End": 4072.2,
      "Text": " customer organizations to ensure that things are secure enough for them. I agree it's difficult"
    },
    {
      "Time_Start": 4072.2,
      "Time_End": 4076.28,
      "Text": " with a private algorithm, but the reason we have three different algorithms available"
    },
    {
      "Time_Start": 4076.28,
      "Time_End": 4080.44,
      "Text": " must be clear to someone that they're not all as secure as each other. So, you're going"
    },
    {
      "Time_Start": 4080.44,
      "Time_End": 4084.12,
      "Text": " to get three new different algorithms that are going to be private, so make up your own"
    },
    {
      "Time_Start": 4084.12,
      "Time_End": 4090.12,
      "Text": " mind about those ones. In conclusion, this has been the first public in-depth Tetra security"
    },
    {
      "Time_Start": 4090.12,
      "Time_End": 4095.48,
      "Text": " analysis in more than 20 years. It affects more than 100 countries, many different sectors"
    },
    {
      "Time_Start": 4095.48,
      "Time_End": 4100.32,
      "Text": " that are critical. We reverse engineered the secret cryptography algorithms, published"
    },
    {
      "Time_Start": 4100.32,
      "Time_End": 4104.5599999999995,
      "Text": " them on GitHub, so you can go take a look. Multiple vulnerabilities were uncovered, both"
    },
    {
      "Time_Start": 4104.5599999999995,
      "Time_End": 4109.8,
      "Text": " in the standard as well as equipment, including a backdoor in TEA-1. This has implications"
    },
    {
      "Time_Start": 4109.8,
      "Time_End": 4115.5199999999995,
      "Text": " for voice and data communications as well as SCADA telecontrol communications. Patches"
    },
    {
      "Time_Start": 4115.52,
      "Time_End": 4120.280000000001,
      "Text": " are available for some of the issues, while mitigations will be required for others. And"
    },
    {
      "Time_Start": 4120.280000000001,
      "Time_End": 4124.240000000001,
      "Text": " I'd like to finish this talk off with a call to action, because there's much more work"
    },
    {
      "Time_Start": 4124.240000000001,
      "Time_End": 4129.360000000001,
      "Text": " to be done on Tetra. First of all, people need to take a closer look at the TEA algorithms,"
    },
    {
      "Time_Start": 4129.360000000001,
      "Time_End": 4135.360000000001,
      "Text": " especially that very fishy S-box in TEA-3. See if you can get a handle on that one. Also"
    },
    {
      "Time_Start": 4135.360000000001,
      "Time_End": 4139.68,
      "Text": " take a closer look at Hurdle, the block cipher that forms the core of the authentication"
    },
    {
      "Time_Start": 4139.68,
      "Time_End": 4144.4400000000005,
      "Text": " suite, because an attack on Hurdle could be catastrophic for Tetra security due to our"
    },
    {
      "Time_Start": 4144.4800000000005,
      "Time_End": 4148.84,
      "Text": " attack on TEA-61, which gives you a little bit of a foothold to play around with that"
    },
    {
      "Time_Start": 4148.84,
      "Time_End": 4155.4800000000005,
      "Text": " cipher. Secondly, if you're more of a developer, we recommend to implement and extend the open"
    },
    {
      "Time_Start": 4155.4800000000005,
      "Time_End": 4160.240000000001,
      "Text": " Tetra stacks that are there. The people at Osmo.com have done some great work, and you"
    },
    {
      "Time_Start": 4160.240000000001,
      "Time_End": 4163.84,
      "Text": " can go talk to the Osmo.com people as well as the NLNet Foundation, who will happily"
    },
    {
      "Time_Start": 4163.84,
      "Time_End": 4170.360000000001,
      "Text": " help you around, extend these open implementations. And finally, stop doing secret cryptography,"
    },
    {
      "Time_Start": 4170.4,
      "Time_End": 4175.5199999999995,
      "Text": " please. It's a bad idea. It always ends in tears, and it's just not polite. Stop doing"
    },
    {
      "Time_Start": 4175.5199999999995,
      "Time_End": 4182.2,
      "Text": " that stuff. Finally, if you want to read more, white papers will be forthcoming on tetraburst.com."
    },
    {
      "Time_Start": 4182.2,
      "Time_End": 4187.0,
      "Text": " An overview of all the vulnerabilities in the radios and the base stations are on midnightblue.nl"
    },
    {
      "Time_Start": 4187.0,
      "Time_End": 4192.719999999999,
      "Text": " slash retetra. The algorithms are on GitHub. If you want to ask questions to us that you"
    },
    {
      "Time_Start": 4192.719999999999,
      "Time_End": 4198.28,
      "Text": " don't want to ask in public, you can always send us an email on one of the addresses below."
    },
    {
      "Time_Start": 4198.679999999999,
      "Time_End": 4201.599999999999,
      "Text": " If you do have questions that you want to ask in public, I'd like to open the floor"
    },
    {
      "Time_Start": 4201.599999999999,
      "Time_End": 4203.599999999999,
      "Text": " for that right now. And that's that."
    }
  ]
}