{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n you're doing a great job. Thanks jurist. You're amazing. Why hello everybody. It's so uh it's"
    },
    {
      "Time_Start": 10.88,
      "Time_End": 16.38,
      "Text": " so awesome to be here today. I'm excited to bring you uh one of my passion projects called"
    },
    {
      "Time_Start": 16.38,
      "Time_End": 22.36,
      "Text": " Private Keys in Public Places. Before we get started I'll let you know who I am. My name is"
    },
    {
      "Time_Start": 22.36,
      "Time_End": 28.7,
      "Text": " Tom Pohl. Um I'm the penetration testing team manager for LMG security out of Missoula"
    },
    {
      "Time_Start": 28.7,
      "Time_End": 33.7,
      "Text": " Montana. Uh I like to do things like play CTFs. Uh I I I'm a I you know a pen penetration"
    },
    {
      "Time_Start": 36.04,
      "Time_End": 41.58,
      "Text": " tester by day, dream crusher at night. Um I've won a few CTFs. Uh I've won black badge here"
    },
    {
      "Time_Start": 41.58,
      "Time_End": 47.68,
      "Text": " at DEF CON. I've uh won like gold badge at DOT CON and couple at Wild West Hackin' Fest."
    },
    {
      "Time_Start": 47.68,
      "Time_End": 54.42,
      "Text": " Three times at Circle City Camp. But uh I am an evil twin. I'd like to point out uh hi Andy."
    },
    {
      "Time_Start": 54.440000000000005,
      "Time_End": 59.18,
      "Text": " My twin brother is uh this is his first DEF CON. He is here in the audience tonight. So if you"
    },
    {
      "Time_Start": 59.18,
      "Time_End": 62.88,
      "Text": " see me around the con and I look like I don't know what I'm doing, it's probably him."
    },
    {
      "Time_Start": 62.88,
      "Time_End": 67.9,
      "Text": " Ha ha ha. At any rate um and this is me hard at work. My wife took a picture that just doesn't"
    },
    {
      "Time_Start": 70.3,
      "Time_End": 74.2,
      "Text": " exist uh of me uh in a hacker hoodie. I don't think I've ever worn a hoodie besides this"
    },
    {
      "Time_Start": 74.2,
      "Time_End": 80.44,
      "Text": " picture in my life. Uh at any rate I want to give a shout out. Uh greets to uh Sec KC and Sec"
    },
    {
      "Time_Start": 80.5,
      "Time_End": 87.5,
      "Text": " DSM as Juris said. You know in Des Moines we like to call ourselves uh Sec KC's little"
    },
    {
      "Time_Start": 87.5,
      "Time_End": 93.48,
      "Text": " brother cause we kick the we kick him in the shins. The last time I saw Juris I was uh"
    },
    {
      "Time_Start": 93.48,
      "Time_End": 99.42,
      "Text": " giving a talk at Sec KC and we had just deprived him of being able to mine cryptocurrency of"
    },
    {
      "Time_Start": 99.42,
      "Time_End": 104.42,
      "Text": " the Sec KC coin. And uh they used it to buy swag and and I gave him a paper wallet with 500"
    },
    {
      "Time_Start": 105.42,
      "Time_End": 110.42,
      "Text": " Sec KC coin in it so he could buy himself a little patch of swag at the Sec KC store. And"
    },
    {
      "Time_Start": 113.92,
      "Time_End": 118.32000000000001,
      "Text": " then I gave paper wallets to everybody in the room because they were taped under their"
    },
    {
      "Time_Start": 118.32000000000001,
      "Time_End": 123.86,
      "Text": " seats. It was great. Anyways. Love those guys. Greets to to Sec KC. And I want to give a"
    },
    {
      "Time_Start": 123.86,
      "Time_End": 130.34,
      "Text": " special thanks to my buddy Nick Stark, my partner in crime, thought crimes. Uh and he's"
    },
    {
      "Time_Start": 130.36,
      "Time_End": 134.86,
      "Text": " really the reason why I started looking for private keys. Uh we'll get into that in a little"
    },
    {
      "Time_Start": 134.86,
      "Time_End": 140.66,
      "Text": " bit. And also Sherry Davidoff. She couldn't be here today. My wife. Uh she's amazing. This"
    },
    {
      "Time_Start": 140.66,
      "Time_End": 145.2,
      "Text": " talk would not have existed without her because she's been urging me to create this for"
    },
    {
      "Time_Start": 145.2,
      "Time_End": 149.44,
      "Text": " years. Literally years cause I've been been at this for quite some time. Thank you so much"
    },
    {
      "Time_Start": 149.44,
      "Time_End": 154.22,
      "Text": " my love. I hope you're watching. Uh so the roadmap. So we're gonna talk a little bit of"
    },
    {
      "Time_Start": 154.22,
      "Time_End": 159.46,
      "Text": " background uh and then we're gonna get into three different uh examples of how I find"
    },
    {
      "Time_Start": 159.5,
      "Time_End": 165.48000000000002,
      "Text": " private keys in public places. And then we'll get at the very end into some recommendations."
    },
    {
      "Time_Start": 165.48000000000002,
      "Time_End": 172.08,
      "Text": " So first of all why do we care about private keys? Right? It's not you know the hot sexy"
    },
    {
      "Time_Start": 172.08,
      "Time_End": 176.68,
      "Text": " new uh vulnerability out there. In fact there's some really great projects out there that"
    },
    {
      "Time_Start": 176.68,
      "Time_End": 180.92000000000002,
      "Text": " are uh extracting private keys and and doing things. But I don't I don't think it gets as"
    },
    {
      "Time_Start": 180.92000000000002,
      "Time_End": 186.62,
      "Text": " much air time and publicity as as it as it needs because this is a systemic problem. And"
    },
    {
      "Time_Start": 186.62,
      "Time_End": 192.6,
      "Text": " it's happening in the real world. Right? As attackers uh get into your networks uh they're"
    },
    {
      "Time_Start": 192.6,
      "Time_End": 198.16,
      "Text": " looking for easy ways to gain more and more access. And this is in using keys especially in"
    },
    {
      "Time_Start": 198.16,
      "Time_End": 203.64000000000001,
      "Text": " the in cloud environments is definitely uh a a a way that people are do that the the bad"
    },
    {
      "Time_Start": 203.64000000000001,
      "Time_End": 209.74,
      "Text": " guys are doing it. Right? So we really need to raise awareness for this. So once upon a"
    },
    {
      "Time_Start": 209.74,
      "Time_End": 216.74,
      "Text": " time uh back in January 2020 imagine this is pre-COVID. Right? Nobody knew what COVID was"
    },
    {
      "Time_Start": 216.74,
      "Time_End": 221.78,
      "Text": " back then. I was at a a conference and my buddy Nick Stark he's over there in the audience. Hi"
    },
    {
      "Time_Start": 221.78,
      "Time_End": 228.08,
      "Text": " Nick. I love you. Uh he was he he texted I think he texted me. I think you were we were texting."
    },
    {
      "Time_Start": 228.08,
      "Time_End": 232.02,
      "Text": " We weren't talking that day. And he was angry at Netgear cause he found a bunch of"
    },
    {
      "Time_Start": 232.02,
      "Time_End": 237.12,
      "Text": " vulnerabilities. He's if you don't know Nick Stark look him up. He's like the hacker's"
    },
    {
      "Time_Start": 237.14000000000001,
      "Time_End": 242.44,
      "Text": " hacker. Like he is amazing. And uh he found a bunch of problems on Netgear and they're"
    },
    {
      "Time_Start": 242.44,
      "Time_End": 246.78,
      "Text": " trying to like bundle them all into one even though like it's totally different problems. Uh"
    },
    {
      "Time_Start": 246.78,
      "Time_End": 250.72,
      "Text": " and so he called me being angry about it. And I'm like trying to console him. I'm like you"
    },
    {
      "Time_Start": 250.72,
      "Time_End": 255.02,
      "Text": " know what? Here's how we're gonna do we're let's just go hack some shit. And I'm like you"
    },
    {
      "Time_Start": 255.02,
      "Time_End": 260.8,
      "Text": " know I'm like no idea. I'm like he's like what should we hack on? Hint hint. Netgear. Since"
    },
    {
      "Time_Start": 260.8,
      "Time_End": 265.46,
      "Text": " he was angry at Netgear like let's just go start pulling random firmware and let's start"
    },
    {
      "Time_Start": 265.47999999999996,
      "Time_End": 272.08,
      "Text": " exploring it and see if we can find anything. And uh we were about 3 firmwares in probably"
    },
    {
      "Time_Start": 272.08,
      "Time_End": 277.08,
      "Text": " before um uh looking and we found 2 different certificates that were publicly uh uh CA blast"
    },
    {
      "Time_Start": 280.06,
      "Time_End": 284.85999999999996,
      "Text": " certificates with their associated private keys. Both for routerlogin.net and the"
    },
    {
      "Time_Start": 284.85999999999996,
      "Time_End": 291.35999999999996,
      "Text": " mini app uh funjsq.com. Both from from reputable uh certificate authorities. Like the"
    },
    {
      "Time_Start": 291.36,
      "Time_End": 296.18,
      "Text": " certificate's there, it's not expired, and the private key's with it. Um and just to show"
    },
    {
      "Time_Start": 296.18,
      "Time_End": 301.28000000000003,
      "Text": " you uh I actually took those keys, put them on my own server, I you know controlled the DNS"
    },
    {
      "Time_Start": 301.28000000000003,
      "Time_End": 305.98,
      "Text": " for an environment, went to it, sure enough you get you know a happy lock icon, the"
    },
    {
      "Time_Start": 305.98,
      "Time_End": 311.28000000000003,
      "Text": " certificate's a valid, the whole deal. Because I controlled the cert the uh the DNS. And"
    },
    {
      "Time_Start": 311.28000000000003,
      "Time_End": 316.12,
      "Text": " it's like ok well you a lot of people are like whoa that's not a big deal is it? Uh and and"
    },
    {
      "Time_Start": 316.12,
      "Time_End": 319.5,
      "Text": " actually it is. There's a couple guys that went out there and and wrote some really good"
    },
    {
      "Time_Start": 319.5,
      "Time_End": 325.38,
      "Text": " articles about like actually this is a pretty big deal. You know and uh I am uh a"
    },
    {
      "Time_Start": 325.38,
      "Time_End": 330.04,
      "Text": " professional bad guy. Or a good guy. I'm helping you I'm out there helping people find"
    },
    {
      "Time_Start": 330.04,
      "Time_End": 333.88,
      "Text": " vulnerabilities on their network right? But I was kinda you know thinking about like if I"
    },
    {
      "Time_Start": 333.88,
      "Time_End": 339.36,
      "Text": " was to be a bad guy uh eh what what would I do right? Like say I was targeting an"
    },
    {
      "Time_Start": 339.36,
      "Time_End": 344.8,
      "Text": " individual and I went to the same coffee shop they were in right? I could set up you know my"
    },
    {
      "Time_Start": 344.8,
      "Time_End": 349.2,
      "Text": " fake routerlogin.net and if I knew they were running this Netgear product uh you know I"
    },
    {
      "Time_Start": 349.2,
      "Time_End": 354.03999999999996,
      "Text": " could uh fake the DNS, force their computer to come to my fake website and then if they"
    },
    {
      "Time_Start": 354.03999999999996,
      "Time_End": 358.74,
      "Text": " save their password when they log into their router I can get that password right? I can have"
    },
    {
      "Time_Start": 358.74,
      "Time_End": 363.08,
      "Text": " them autofill that password and then do a auto submit and then I'll get their password and"
    },
    {
      "Time_Start": 363.08,
      "Time_End": 369.41999999999996,
      "Text": " then uh uh if uh um uh if they have remote administration at home then I could go log into"
    },
    {
      "Time_Start": 369.41999999999996,
      "Time_End": 373.09999999999997,
      "Text": " their home router and play with them all day long. Or you know if they have the same"
    },
    {
      "Time_Start": 373.09999999999997,
      "Time_End": 376.76,
      "Text": " password say we're gonna do a credential stuffing attack I could go then maybe log into"
    },
    {
      "Time_Start": 376.76,
      "Time_End": 382.06,
      "Text": " some of their other services across the internet. Alright by the way I wanted to say if"
    },
    {
      "Time_Start": 382.06,
      "Time_End": 387.2,
      "Text": " anybody's got questions while I'm talking through this feel free to jump up I think there's a"
    },
    {
      "Time_Start": 387.2,
      "Time_End": 392.2,
      "Text": " mic in the middle in the back and interrupt me cause I love interaction. In fact I brought"
    },
    {
      "Time_Start": 392.2,
      "Time_End": 397.12,
      "Text": " with me some Montana hacker shot glasses so if you got a good question I will chuck these at"
    },
    {
      "Time_Start": 397.12,
      "Time_End": 402.12,
      "Text": " you for a good question. So there's a bounty on good questions here. Um alright so we tried"
    },
    {
      "Time_Start": 402.62,
      "Time_End": 407.62,
      "Text": " to tell Netgear right? Uh it was what January 14th so really early in January was when we"
    },
    {
      "Time_Start": 409.76,
      "Time_End": 413.46,
      "Text": " found it and we went you know we tried to contact Netgear actually in a couple different"
    },
    {
      "Time_Start": 413.46,
      "Time_End": 418.2,
      "Text": " ways. The most we had gotten was through their direct message on Twitter or X or whatever"
    },
    {
      "Time_Start": 418.2,
      "Time_End": 423.6,
      "Text": " it's called now. Um and then uh so we decided that was like kind of a no go they weren't"
    },
    {
      "Time_Start": 423.6,
      "Time_End": 426.88,
      "Text": " really wanting to talk to us so we reached out to Bug Crowd who ran their bug bounty"
    },
    {
      "Time_Start": 426.9,
      "Time_End": 431.71999999999997,
      "Text": " program to try to establish communications. And uh they came back and they would not"
    },
    {
      "Time_Start": 431.71999999999997,
      "Time_End": 438.46,
      "Text": " accept information about our vulnerability outside of their program. Which was really"
    },
    {
      "Time_Start": 438.46,
      "Time_End": 444.62,
      "Text": " frustrating because uh here's why. Uh they require what's called responsible disclosure."
    },
    {
      "Time_Start": 444.62,
      "Time_End": 448.26,
      "Text": " So anybody that's familiar with bug bounty programs there's a couple different ways you you"
    },
    {
      "Time_Start": 448.26,
      "Time_End": 453.04,
      "Text": " can uh disclose right? There's responsible disclosure and then there's coordinated"
    },
    {
      "Time_Start": 453.06,
      "Time_End": 459.84000000000003,
      "Text": " disclosure. Right? They didn't uh they're uh in in I've got people that are very familiar"
    },
    {
      "Time_Start": 459.84000000000003,
      "Time_End": 464.24,
      "Text": " with this where basically you go to the bug bounty program, you report the vulnerability,"
    },
    {
      "Time_Start": 464.24,
      "Time_End": 469.24,
      "Text": " they pay you the money and then they never fix it. And guess what? You can't ever talk about"
    },
    {
      "Time_Start": 469.24,
      "Time_End": 472.88,
      "Text": " it, you can't force the issue, you're bound by their terms and they never have to do"
    },
    {
      "Time_Start": 472.88,
      "Time_End": 478.76,
      "Text": " anything about it. Basically you report it and you have to walk away. Uh and uh so we we"
    },
    {
      "Time_Start": 478.76,
      "Time_End": 482.56,
      "Text": " didn't want to go that route. We wanted to do coordinated disclosure where we're basically"
    },
    {
      "Time_Start": 482.58,
      "Time_End": 486.32,
      "Text": " like hey we're going to talk about this, we want to set up a timeline, we want to talk with"
    },
    {
      "Time_Start": 486.32,
      "Time_End": 490.86,
      "Text": " you and and make sure it works with you. And they weren't having it. Uh so we went ahead"
    },
    {
      "Time_Start": 490.86,
      "Time_End": 495.46,
      "Text": " and uh publicly disclosed within a few days and they fixed it within like a week. Uh and"
    },
    {
      "Time_Start": 495.46,
      "Time_End": 500.1,
      "Text": " actually April of uh 2020 even Bruce Schneier came out and said that bug bounty programs"
    },
    {
      "Time_Start": 500.1,
      "Time_End": 505.86,
      "Text": " were being used to buy silence. So you know uh sorry if if uh this impacted you but you"
    },
    {
      "Time_Start": 505.86,
      "Time_End": 511.24,
      "Text": " know I think this is an important issue. I think more and more uh programs should do"
    },
    {
      "Time_Start": 511.26,
      "Time_End": 516.26,
      "Text": " coordinated disclosure instead of responsible disclosure just so that we're forcing these"
    },
    {
      "Time_Start": 516.26,
      "Time_End": 521.26,
      "Text": " vendors to fix their products. Alright. So what did we learn from Netgear? Uh number one uh"
    },
    {
      "Time_Start": 527.94,
      "Time_End": 533.08,
      "Text": " private keys can be trivially found. Uh I literally we just did grep on the file you know we"
    },
    {
      "Time_Start": 533.08,
      "Time_End": 537.88,
      "Text": " we extracted the file system into folders and we like recursively grepped for the word"
    },
    {
      "Time_Start": 537.88,
      "Time_End": 542.9,
      "Text": " private in all caps and out came some keys. So we started to wonder you know was this a"
    },
    {
      "Time_Start": 545.66,
      "Time_End": 550.66,
      "Text": " fluke? Was this just like this is the one product out there that's got private keys in it?"
    },
    {
      "Time_Start": 550.66,
      "Time_End": 556.48,
      "Text": " Uh and the answer oddly enough is no. This is this is not a this is not an isolated incident."
    },
    {
      "Time_Start": 556.48,
      "Time_End": 561.54,
      "Text": " Uh so we started to ask uh what else might have private keys? So let's take a look. At the"
    },
    {
      "Time_Start": 561.54,
      "Time_End": 566.88,
      "Text": " time I was working for a software as a for service company as I'd actually been spent most"
    },
    {
      "Time_Start": 566.88,
      "Time_End": 571.88,
      "Text": " of my career on the blue team side uh building software as a service uh platform and uh I"
    },
    {
      "Time_Start": 575.06,
      "Time_End": 580.66,
      "Text": " was a Fortinet customer and I'm like you know what let me go download the latest version of the"
    },
    {
      "Time_Start": 580.66,
      "Time_End": 586.4,
      "Text": " software that runs all of my firewalls just to take a look to see what I can find. Guess what I"
    },
    {
      "Time_Start": 586.4,
      "Time_End": 591.4,
      "Text": " found? Well first of all uh uh I was able to download the uh the the software and it was a"
    },
    {
      "Time_Start": 591.4,
      "Time_End": 596.4,
      "Text": " VMDK right right off their website and I extracted the file system and I found that most of"
    },
    {
      "Time_Start": 602.48,
      "Time_End": 607.48,
      "Text": " the stuff were there's uh most of the software is in these tar.xz files on the uh on the on the"
    },
    {
      "Time_Start": 609.52,
      "Time_End": 615.28,
      "Text": " firmware and I'm like okay cool so it's an xz exact you know nor normally people don't use"
    },
    {
      "Time_Start": 615.28,
      "Time_End": 621.12,
      "Text": " xz uh compression but that's cool I'll go with it uh and uh even if you ran file on it says"
    },
    {
      "Time_Start": 621.12,
      "Time_End": 626.48,
      "Text": " they're xz compressed data uh so look what happens when we go ahead and try to decompress it"
    },
    {
      "Time_Start": 626.48,
      "Time_End": 631.5,
      "Text": " right? Oh xz sorry compressed data is corrupt. Like that's interesting. Uh so uh it's I mean"
    },
    {
      "Time_Start": 635.1,
      "Time_End": 640.3,
      "Text": " it's brand new firmware I just downloaded from their website extracted I extracted it through"
    },
    {
      "Time_Start": 640.3,
      "Time_End": 646.24,
      "Text": " very solid techniques I knew this stuff wasn't corrupted and actually I intentionally uh"
    },
    {
      "Time_Start": 646.24,
      "Time_End": 653.04,
      "Text": " downloaded the x86 64 bit version of the software because uh uh I I knew I wouldn't have any"
    },
    {
      "Time_Start": 653.04,
      "Time_End": 658.94,
      "Text": " you know weird file system issues and and and things of that nature. Uh and so when I started"
    },
    {
      "Time_Start": 658.94,
      "Time_End": 665.36,
      "Text": " exploring this file system more I saw that they had a couple utilities outside of those xz"
    },
    {
      "Time_Start": 665.36,
      "Time_End": 671.0600000000001,
      "Text": " files and a bunch of libraries. They had one called ftar and they had another utility called"
    },
    {
      "Time_Start": 671.08,
      "Time_End": 676.08,
      "Text": " xz. I'm like this is interesting. You couldn't just run uh the uh the xz binaries or the ftar"
    },
    {
      "Time_Start": 679.7600000000001,
      "Time_End": 686.7600000000001,
      "Text": " binaries because they had their own libraries associated with it. But uh if I ran a chroot uh"
    },
    {
      "Time_Start": 686.7600000000001,
      "Time_End": 691.8000000000001,
      "Text": " if I ran their their uh firmware in a chroot environment mind you I had my virtual machine"
    },
    {
      "Time_Start": 691.8000000000001,
      "Time_End": 695.94,
      "Text": " I'm running this on is the same architecture as the version I downloaded that's really"
    },
    {
      "Time_Start": 695.96,
      "Time_End": 701.1,
      "Text": " important if you're gonna do this at home. Uh and so I ran their xz binaries and their ftar"
    },
    {
      "Time_Start": 701.1,
      "Time_End": 705.4000000000001,
      "Text": " binaries guess what happened? I was able to decompress and extract the rest of the file"
    },
    {
      "Time_Start": 705.4000000000001,
      "Time_End": 710.4000000000001,
      "Text": " system into files. For a shy class why do you think they did that? Anybody? Security by"
    },
    {
      "Time_Start": 714.7800000000001,
      "Time_End": 719.7800000000001,
      "Text": " security. Rick's in. Yes. Alright that's exactly right. Ha ha ha ha ha ha ha ha. Alright"
    },
    {
      "Time_Start": 726.0200000000001,
      "Time_End": 730.9200000000001,
      "Text": " so uh so you know now that we've extracted all these files out in the file system we're like"
    },
    {
      "Time_Start": 730.9200000000001,
      "Time_End": 734.1600000000001,
      "Text": " there's gotta be something good here cause they've hidden it. They've made it a little bit"
    },
    {
      "Time_Start": 734.1600000000001,
      "Time_End": 739.96,
      "Text": " hard. So I play a lot of CTFs so far we're at like maybe a level level 100 challenge right?"
    },
    {
      "Time_Start": 739.96,
      "Time_End": 744.96,
      "Text": " This stuff is not hard. So if if I wanna I wanna encourage everyone that if you do uh uh CTFs"
    },
    {
      "Time_Start": 748.58,
      "Time_End": 755.24,
      "Text": " and you know hacking in the real world is generally easier uh than than some of these CTF"
    },
    {
      "Time_Start": 755.24,
      "Time_End": 761.02,
      "Text": " challenges. Uh and I'm not I'm not joking. Uh I'm not doing anything that that is really"
    },
    {
      "Time_Start": 761.02,
      "Time_End": 765.52,
      "Text": " hard or complex but I think it's overlooked. I think there's there's uh there's things"
    },
    {
      "Time_Start": 765.52,
      "Time_End": 769.96,
      "Text": " that that people don't realize that if you even you know remotely try to go look at you're"
    },
    {
      "Time_Start": 769.96,
      "Time_End": 774.3,
      "Text": " gonna find some some pretty terrifying things. Alright so we're gonna use the same"
    },
    {
      "Time_Start": 774.3,
      "Time_End": 780.26,
      "Text": " technique before. Strings on a find maybe. Little bit of grep dash r. Yeah and guess what"
    },
    {
      "Time_Start": 780.26,
      "Time_End": 785.26,
      "Text": " we find? Two publicly blessed CA or certificates blessed by CAs. These this time one was"
    },
    {
      "Time_Start": 787.5,
      "Time_End": 792.5,
      "Text": " published by Apple. The other one from Google. Any idea what these were used for? Push"
    },
    {
      "Time_Start": 795.98,
      "Time_End": 800.38,
      "Text": " notifications hey here's a shot glass to the guy in the back. Oh wait that's my buddy Nick."
    },
    {
      "Time_Start": 800.38,
      "Time_End": 805.38,
      "Text": " Oh overshot. My uh NFL career is uh is not gonna take off. Uh yes we found some push"
    },
    {
      "Time_Start": 806.38,
      "Time_End": 811.38,
      "Text": " notification certificates in everyone's Fortinet firewall. Is that exciting or scary? It's pretty"
    },
    {
      "Time_Start": 817.62,
      "Time_End": 822.62,
      "Text": " excitingly scary. Yeah I know. Uh so just to show you so uh I'm like really? These are really"
    },
    {
      "Time_Start": 824.56,
      "Time_End": 830.94,
      "Text": " Apple certificates? And sure enough so here's the the output right here uh from uh looking at"
    },
    {
      "Time_Start": 830.96,
      "Time_End": 835.74,
      "Text": " the the PEM certificate the the public cert uh part of the key or part of public part of the"
    },
    {
      "Time_Start": 835.74,
      "Time_End": 841.34,
      "Text": " certificate and it's uh the CN from Apple Worldwide Developer Relations Certificate uh"
    },
    {
      "Time_Start": 841.34,
      "Time_End": 846.7800000000001,
      "Text": " Relations Certificate uh right there. Apple and uh and then so you can you know"
    },
    {
      "Time_Start": 846.7800000000001,
      "Time_End": 850.3800000000001,
      "Text": " cryptographically check to make sure that like okay I've got a public certificate and a"
    },
    {
      "Time_Start": 850.3800000000001,
      "Time_End": 855.3800000000001,
      "Text": " private key you can actually use open SSL uh it uh in order to uh look at look at the the"
    },
    {
      "Time_Start": 855.56,
      "Time_End": 860.56,
      "Text": " values from it and sure enough the the certificate matched the private key so it's a match."
    },
    {
      "Time_Start": 863.1,
      "Time_End": 868.64,
      "Text": " This is legit I've got a private key to a certificate that was issued by Apple that I extracted"
    },
    {
      "Time_Start": 868.64,
      "Time_End": 873.64,
      "Text": " from my Fortinet firewall software. Pretty exciting. Alright so what if I was an attacker?"
    },
    {
      "Time_Start": 875.28,
      "Time_End": 880.96,
      "Text": " Right so you know uh in their final response that will the the that they came out with uh they"
    },
    {
      "Time_Start": 880.96,
      "Time_End": 886.4000000000001,
      "Text": " acknowledged that uh these certificates are actually used for both their Apple and Google Cloud"
    },
    {
      "Time_Start": 886.4000000000001,
      "Time_End": 891.4000000000001,
      "Text": " messaging services. So does this mean I could send push notifications to people's phones from as a"
    },
    {
      "Time_Start": 894.1800000000001,
      "Time_End": 899.62,
      "Text": " as Fortinet? Yeah you know it when I figured this out pretty early on that's why at the point"
    },
    {
      "Time_Start": 899.62,
      "Time_End": 904.76,
      "Text": " that I'm like this is bad I had I went ahead and reported it to Fortinet. I'd actually never"
    },
    {
      "Time_Start": 904.76,
      "Time_End": 909.76,
      "Text": " worked with Fortinet and didn't know of anybody that had so I gave them the benefit of the doubt."
    },
    {
      "Time_Start": 909.76,
      "Time_End": 914.9399999999999,
      "Text": " Um and so uh what this is probably two weeks I it was literally two weeks after we had the"
    },
    {
      "Time_Start": 914.9399999999999,
      "Time_End": 919.9399999999999,
      "Text": " Netfigure thing go on is when I first reported this incident or this issue to uh to to Fortinet and"
    },
    {
      "Time_Start": 923.04,
      "Time_End": 927.78,
      "Text": " I also reached out to Apple. I mean I'm like hey Apple I've got the private key to a certificate"
    },
    {
      "Time_Start": 927.78,
      "Time_End": 932.98,
      "Text": " you guys issued. Uh I I felt that they should know uh also and actually it's it was interesting"
    },
    {
      "Time_Start": 932.98,
      "Time_End": 938.42,
      "Text": " Apple like responded back to me like we need to know whose key you've got access to. I mean"
    },
    {
      "Time_Start": 938.46,
      "Time_End": 944.2600000000001,
      "Text": " they were like tell us what you know tell me who your daddy is and what does he do right? Uh and"
    },
    {
      "Time_Start": 944.2600000000001,
      "Time_End": 950.4000000000001,
      "Text": " uh and I was a little uh luckily you know after I I told Fortinet that I'd reached out to Apple"
    },
    {
      "Time_Start": 950.4000000000001,
      "Time_End": 954.6400000000001,
      "Text": " as well. You know they self reported themselves to Apple and you know it was all all in a merry"
    },
    {
      "Time_Start": 954.6400000000001,
      "Time_End": 959.6400000000001,
      "Text": " way. Um and then um and then actually I was I issued a CVE uh in February of 2020-6645."
    },
    {
      "Time_Start": 960.64,
      "Time_End": 965.64,
      "Text": " Anybody ever heard that one? No if you still look it's still actually not even uh allocated."
    },
    {
      "Time_Start": 969.02,
      "Time_End": 974.02,
      "Text": " Um but they they told me in April, April 2020 that they're coming with a fix in 6.4.1 and"
    },
    {
      "Time_Start": 976.66,
      "Time_End": 980.96,
      "Text": " actually I think it ended up in 6.4.2 but they wanted me to wait. You know what's really"
    },
    {
      "Time_Start": 980.96,
      "Time_End": 986.0,
      "Text": " interesting is these this is more than just like I found a problem that you know firmware"
    },
    {
      "Time_Start": 986.0,
      "Time_End": 990.74,
      "Text": " update can kind of fix. This is like an architectural issue in their infrastructure right?"
    },
    {
      "Time_Start": 990.74,
      "Time_End": 995.24,
      "Text": " So no longer should you know should your firewall be able to talk directly to Apple and Google"
    },
    {
      "Time_Start": 995.24,
      "Time_End": 1000.08,
      "Text": " and send a push notification. No. They're um and so this is actually an architectural issue."
    },
    {
      "Time_Start": 1000.08,
      "Time_End": 1005.02,
      "Text": " So we you know we had discussions around they need to come up with a solution then they had"
    },
    {
      "Time_Start": 1005.02,
      "Time_End": 1010.62,
      "Text": " to push it out and then they wanted me to wait until um you know a sufficient enough time"
    },
    {
      "Time_Start": 1010.62,
      "Time_End": 1015.16,
      "Text": " had passed that enough customers had updated their firmware. I was like totally cool. I I'm"
    },
    {
      "Time_Start": 1015.16,
      "Time_End": 1018.5,
      "Text": " right on board with you. You know I'm a I was a Fortinet customer at the time. I'm like"
    },
    {
      "Time_Start": 1018.5,
      "Time_End": 1023.5,
      "Text": " totally on board with it. And then I waited. This was April 2020 when I kind of last talked"
    },
    {
      "Time_Start": 1025.6,
      "Time_End": 1030.6,
      "Text": " with them. Uh and then I waited and I waited and I waited. And three years later April of"
    },
    {
      "Time_Start": 1033.34,
      "Time_End": 1038.34,
      "Text": " 2023 or sorry February of 2023 um they finally issued the the uh the advisory. It wasn't"
    },
    {
      "Time_Start": 1039.1,
      "Time_End": 1044.1,
      "Text": " without pro- I I was poking and prodding them probably every um every you know three or"
    },
    {
      "Time_Start": 1048.4399999999998,
      "Time_End": 1054.3799999999999,
      "Text": " four months something like that. Uh and they uh they never they they kept uh being like oh"
    },
    {
      "Time_Start": 1054.3799999999999,
      "Time_End": 1060.4599999999998,
      "Text": " yeah I actually went through uh three PSIRT representatives. Like I ended up you know"
    },
    {
      "Time_Start": 1060.4599999999998,
      "Time_End": 1066.02,
      "Text": " every time you know every few months a a new person was running the program. Uh and uh but"
    },
    {
      "Time_Start": 1066.04,
      "Time_End": 1070.74,
      "Text": " they finally acknowledged it in February 2023. I think they actually it took them at least"
    },
    {
      "Time_Start": 1070.74,
      "Time_End": 1076.18,
      "Text": " two two and a half years to fix it. Uh but to acknowledge it it was uh February 16th"
    },
    {
      "Time_Start": 1076.18,
      "Time_End": 1080.58,
      "Text": " 2023. And you see it's got a different CVE number. So what they actually they were like"
    },
    {
      "Time_Start": 1080.58,
      "Time_End": 1085.02,
      "Text": " internal first internal reasons that are that I don't understand. They had to renumber the"
    },
    {
      "Time_Start": 1085.02,
      "Time_End": 1090.02,
      "Text": " CVE to 202222302 even though I reported it back in 2020. So that's an interesting story"
    },
    {
      "Time_Start": 1090.56,
      "Time_End": 1097.5,
      "Text": " that I'm sure I will never hear about. Um uh you know maybe it was too long between when it"
    },
    {
      "Time_Start": 1097.5,
      "Time_End": 1101.1399999999999,
      "Text": " was reported and when they reported the fix. I don't know. And they could only go back so"
    },
    {
      "Time_Start": 1101.1399999999999,
      "Time_End": 1106.1399999999999,
      "Text": " far. But wait that's not all. So uh fast forward I think it was actually January or February"
    },
    {
      "Time_Start": 1109.08,
      "Time_End": 1114.06,
      "Text": " of this year I was on I was helping one of my uh penetration testers on his external"
    },
    {
      "Time_Start": 1114.06,
      "Time_End": 1119.96,
      "Text": " penetration test. So we found a Fortinet firewall on the public internet that was acting"
    },
    {
      "Time_Start": 1119.96,
      "Time_End": 1124.96,
      "Text": " as a VPN server. Very common in a lot of people's organizations. Uh but we did a password"
    },
    {
      "Time_Start": 1124.96,
      "Time_End": 1130.58,
      "Text": " guessing attack. Uh and we found a username and password that worked. That let us uh kind"
    },
    {
      "Time_Start": 1130.58,
      "Time_End": 1136.14,
      "Text": " of get past that first door. But they had MFA turned on. Good for them. Uh and so we didn't"
    },
    {
      "Time_Start": 1136.14,
      "Time_End": 1142.88,
      "Text": " have a good way of bypassing their MFA. So I thought hey I we're we're FortiFriends. Uh we I"
    },
    {
      "Time_Start": 1142.88,
      "Time_End": 1147.26,
      "Text": " reached out and got the latest version of the software. The same same software that I used"
    },
    {
      "Time_Start": 1147.26,
      "Time_End": 1151.9,
      "Text": " to run. And I got the latest version. I was like uh because it was the software our our the"
    },
    {
      "Time_Start": 1151.9,
      "Time_End": 1156.9,
      "Text": " version our client was running. And I uh decided to look through the firmware to see if I"
    },
    {
      "Time_Start": 1156.9,
      "Time_End": 1161.44,
      "Text": " could find some kind of an MFA bypass right. You know what's great is since I I uh managed"
    },
    {
      "Time_Start": 1161.44,
      "Time_End": 1166.64,
      "Text": " the team I don't get my own engagements. So I get to jump into all my co-workers"
    },
    {
      "Time_Start": 1166.64,
      "Time_End": 1170.28,
      "Text": " engagements to kind of help them and I'll like sometimes swing from swing for the fences"
    },
    {
      "Time_Start": 1170.28,
      "Time_End": 1174.42,
      "Text": " and and sometimes it'll hit a home run. Sometimes I'll just do some interesting things. In"
    },
    {
      "Time_Start": 1174.42,
      "Time_End": 1179.5800000000002,
      "Text": " this particular case uh I got sidetracked because as I was looking through the firmware"
    },
    {
      "Time_Start": 1179.5800000000002,
      "Time_End": 1185.5,
      "Text": " looking at all the code I found the fix for the issue that I reported three years ago."
    },
    {
      "Time_Start": 1185.5,
      "Time_End": 1191.6000000000001,
      "Text": " Which is actually the preface uh preface to why they finally published uh the their advisory"
    },
    {
      "Time_Start": 1191.6000000000001,
      "Time_End": 1196.1000000000001,
      "Text": " is because I poked them I'm like hey I see you've got the fix in the software. I don't know"
    },
    {
      "Time_Start": 1196.1000000000001,
      "Time_End": 1201.04,
      "Text": " exactly when it came out. But hopefully it's been long enough since it's been three years"
    },
    {
      "Time_Start": 1201.06,
      "Time_End": 1207.94,
      "Text": " uh to go ahead and uh and talk about it. And uh and that's when uh but but then the fix was"
    },
    {
      "Time_Start": 1207.94,
      "Time_End": 1212.94,
      "Text": " really super interesting. So I go uh most of the the the firmware on Fortinet is in a giant"
    },
    {
      "Time_Start": 1215.58,
      "Time_End": 1221.52,
      "Text": " init file right. So it's kind of like BusyBox uh where you've got like a massive binary and"
    },
    {
      "Time_Start": 1221.52,
      "Time_End": 1226.82,
      "Text": " then you link to it with LS you link to it with RM and CP and bending on the file name that"
    },
    {
      "Time_Start": 1226.82,
      "Time_End": 1230.76,
      "Text": " you're running it as it'll hit that executable differently and run on a little bit different"
    },
    {
      "Time_Start": 1231.42,
      "Time_End": 1236.3799999999999,
      "Text": " version of the program. Well that's how Fortinet's firmware is mostly set up. And inside of"
    },
    {
      "Time_Start": 1236.3799999999999,
      "Time_End": 1243.4,
      "Text": " that that that init file I found uh a URL product API dot Fortinet dot com. And uh it's right"
    },
    {
      "Time_Start": 1243.4,
      "Time_End": 1249.3,
      "Text": " there highlighted in black. Uh and and right above it it says iOS iOS push data. And then"
    },
    {
      "Time_Start": 1249.3,
      "Time_End": 1254.3,
      "Text": " above that you see uh you see uh FGT dot CRT and FGT dot key. Guess what those are? Any"
    },
    {
      "Time_Start": 1254.96,
      "Time_End": 1259.96,
      "Text": " ideas? Organizational private key in the in the green shirt. Oh back there. Oh still not"
    },
    {
      "Time_Start": 1267.3999999999999,
      "Time_End": 1272.3999999999999,
      "Text": " gonna be an NFL player sorry. Nice work. Uh yeah so this time uh this time I discovered"
    },
    {
      "Time_Start": 1274.54,
      "Time_End": 1279.54,
      "Text": " that uh they have another private key. Uh and so I went ahead uh I went ahead and uh and uh"
    },
    {
      "Time_Start": 1279.8,
      "Time_End": 1284.8,
      "Text": " tried to talk to this product API dot Fortinet dot com. Um and it it gave me you know a"
    },
    {
      "Time_Start": 1289.0,
      "Time_End": 1293.8,
      "Text": " handshake failure right? So I just tried to curl against it uh and it's like nope not gonna"
    },
    {
      "Time_Start": 1293.8,
      "Time_End": 1299.8799999999999,
      "Text": " be able to talk to me. So then I'm like well this is probably a client certificate to do"
    },
    {
      "Time_Start": 1299.8799999999999,
      "Time_End": 1306.32,
      "Text": " client uh authentication against the URL. So sure enough do the curl again. Pass it in"
    },
    {
      "Time_Start": 1306.34,
      "Time_End": 1313.28,
      "Text": " the Fortinet uh issued certificate and private key and uh yep I can talk to the URL. So I"
    },
    {
      "Time_Start": 1313.28,
      "Time_End": 1319.1799999999998,
      "Text": " didn't dig any deeper than this so uh I I'll I don't have anything more to report here but"
    },
    {
      "Time_Start": 1319.1799999999998,
      "Time_End": 1323.86,
      "Text": " let's just hope that the authentication between your firewall and their push notification"
    },
    {
      "Time_Start": 1323.86,
      "Time_End": 1327.4199999999998,
      "Text": " proxy server has more authentication than just a private key that's on their firmware. I"
    },
    {
      "Time_Start": 1327.4199999999998,
      "Time_End": 1332.6599999999999,
      "Text": " don't know. So that's where I left that. Alright so what did we learn from Fortinet now"
    },
    {
      "Time_Start": 1332.68,
      "Time_End": 1337.8400000000001,
      "Text": " that uh for this example? You know I'm convinced private keys are everywhere and uh I'm"
    },
    {
      "Time_Start": 1337.8400000000001,
      "Time_End": 1342.98,
      "Text": " only showing you three different examples today. I've got so many more uh in my library it's"
    },
    {
      "Time_Start": 1342.98,
      "Time_End": 1349.8600000000001,
      "Text": " it's ridiculous. And um and I've also found that manufacturers may not prioritize this type"
    },
    {
      "Time_Start": 1349.8600000000001,
      "Time_End": 1353.72,
      "Text": " of an issue right? Especially when they're hard problems right? This is an in particular"
    },
    {
      "Time_Start": 1353.72,
      "Time_End": 1358.96,
      "Text": " an architect architectural issue. They had to now stand up an entire site on the internet"
    },
    {
      "Time_Start": 1358.96,
      "Time_End": 1363.5,
      "Text": " that all of their customers are now going to hit. I mean this is a this is kind of a this is"
    },
    {
      "Time_Start": 1363.5,
      "Time_End": 1368.18,
      "Text": " kind of a big change for them and it can take some time a really long time in this case to"
    },
    {
      "Time_Start": 1368.18,
      "Time_End": 1373.18,
      "Text": " actually address it. So we need to be careful. But then we kept finding private keys. So in"
    },
    {
      "Time_Start": 1376.1200000000001,
      "Time_End": 1382.26,
      "Text": " my line of business you know we go kind of the extra mile to uh to to find all the weaknesses"
    },
    {
      "Time_Start": 1382.26,
      "Time_End": 1387.9,
      "Text": " in your organization and private keys are very useful on penetration tests right? So let's"
    },
    {
      "Time_Start": 1387.9,
      "Time_End": 1394.0,
      "Text": " fast forward a little bit more to April of this year. Uh my team was uh conducting an internal"
    },
    {
      "Time_Start": 1394.0,
      "Time_End": 1399.3200000000002,
      "Text": " penetration test. Uh you know basically what happens on our internal penetration test is"
    },
    {
      "Time_Start": 1399.3200000000002,
      "Time_End": 1405.26,
      "Text": " we'll we'll take a box uh a server box that we run our own uh distribution Linux distribution"
    },
    {
      "Time_Start": 1405.26,
      "Time_End": 1410.66,
      "Text": " on and we'll send it to the customer and we'll have them plug it into the network you know and"
    },
    {
      "Time_Start": 1410.66,
      "Time_End": 1415.0600000000002,
      "Text": " get us either on a user subnet or as if it's like plugged into a conference room. Basically"
    },
    {
      "Time_Start": 1415.06,
      "Time_End": 1419.76,
      "Text": " no level of access and this thing will find its way out of their network, connect back to our"
    },
    {
      "Time_Start": 1419.76,
      "Time_End": 1425.1599999999999,
      "Text": " infrastructure and allow us to pivot in to do our work to to find vulnerabilities. And so you"
    },
    {
      "Time_Start": 1425.1599999999999,
      "Time_End": 1429.8,
      "Text": " know one of the first things that we do you know as part of discovery on your network in an"
    },
    {
      "Time_Start": 1429.8,
      "Time_End": 1434.54,
      "Text": " internal penetration test is look for for for low hanging fruit look for for vulnerabilities"
    },
    {
      "Time_Start": 1434.54,
      "Time_End": 1440.48,
      "Text": " right? We'll use a vulnerability scanner and uh uh my coworker who is running this internal"
    },
    {
      "Time_Start": 1440.5,
      "Time_End": 1446.08,
      "Text": " penetration test the uh he's like the next day he's like after he ran scans for a day he's"
    },
    {
      "Time_Start": 1446.08,
      "Time_End": 1451.08,
      "Text": " like hey uh I found I got access to what was reported as a uh Palo Alto firewall uh with"
    },
    {
      "Time_Start": 1454.78,
      "Time_End": 1458.52,
      "Text": " that with default credentials but I got into it and it does not look like a Palo Alto"
    },
    {
      "Time_Start": 1458.52,
      "Time_End": 1463.52,
      "Text": " firewall. And guess what credentials he used to get into it with? Hey who said admin admin?"
    },
    {
      "Time_Start": 1463.78,
      "Time_End": 1469.18,
      "Text": " Hey who said admin admin? That guy here we go. Sorry that was the one I drank out of you"
    },
    {
      "Time_Start": 1469.18,
      "Time_End": 1474.18,
      "Text": " might want to watch that one. My bad that was the last one. Uh yeah admin admin so that's"
    },
    {
      "Time_Start": 1477.28,
      "Time_End": 1481.62,
      "Text": " how we got into this thing and we didn't he didn't know what it was I didn't know what it was"
    },
    {
      "Time_Start": 1481.62,
      "Time_End": 1486.06,
      "Text": " um it was kind of a mysterious device it it looked like it was running some version of like"
    },
    {
      "Time_Start": 1486.06,
      "Time_End": 1493.06,
      "Text": " maybe a CentOS uh looking through process lists uh looking through uh file systems you know"
    },
    {
      "Time_Start": 1493.08,
      "Time_End": 1498.3799999999999,
      "Text": " we we found we found that this is an interesting thing. So uh first of all we started looking"
    },
    {
      "Time_Start": 1498.3799999999999,
      "Time_End": 1503.9199999999998,
      "Text": " through process lists and uh and you'll see here that where we uh we found the directory that"
    },
    {
      "Time_Start": 1503.9199999999998,
      "Time_End": 1509.32,
      "Text": " was uh labeled uh Dell Compellent. I'm like Dell Compellent that's the storage platform"
    },
    {
      "Time_Start": 1509.32,
      "Time_End": 1513.36,
      "Text": " on it am I in a Compellent? I've never seen a Compellent before but I've heard about"
    },
    {
      "Time_Start": 1513.36,
      "Time_End": 1517.7,
      "Text": " them. It it but it wasn't a Compellent. I'm like I'm looking like there's gotta be a giant"
    },
    {
      "Time_Start": 1517.7,
      "Time_End": 1521.2,
      "Text": " ass hard drive around here that's hosting like their their domain controller like that's"
    },
    {
      "Time_Start": 1521.24,
      "Time_End": 1525.04,
      "Text": " what I was looking for right? Like I'm hunting for a way that I can forensically grab all"
    },
    {
      "Time_Start": 1525.04,
      "Time_End": 1531.68,
      "Text": " your passwords or other user other other user credentials. But it wasn't and uh but I did"
    },
    {
      "Time_Start": 1531.68,
      "Time_End": 1536.56,
      "Text": " have some some directories I could start looking at and so in one of these directories I"
    },
    {
      "Time_Start": 1536.56,
      "Time_End": 1541.9,
      "Text": " found uh a properties file that was called VSP dot properties I had and then at the top it"
    },
    {
      "Time_Start": 1541.9,
      "Time_End": 1546.9,
      "Text": " gave me a hint it says Dell Compellent VM VMware vSphere plugin for VMware vCenter"
    },
    {
      "Time_Start": 1546.94,
      "Time_End": 1553.8000000000002,
      "Text": " configuration parameters. Like that sounds very fancy uh and they had a password and a"
    },
    {
      "Time_Start": 1553.8000000000002,
      "Time_End": 1560.48,
      "Text": " username and the username was vSphere dot local administrator. So this seemed like a"
    },
    {
      "Time_Start": 1560.48,
      "Time_End": 1565.8600000000001,
      "Text": " high value target to me um uh that that uh but that password looked real odd right? It was"
    },
    {
      "Time_Start": 1565.8600000000001,
      "Time_End": 1572.4,
      "Text": " all hex, uppercase, and numbers and I'm like that couldn't possibly be the password to"
    },
    {
      "Time_Start": 1572.4,
      "Time_End": 1577.5,
      "Text": " their vCenter could it? No. It wasn't. I went I went to their vCenter I tried to log in"
    },
    {
      "Time_Start": 1577.5,
      "Time_End": 1583.0,
      "Text": " with it and uh sure enough it was not the uh in I got invalid credentials. I'm like okay"
    },
    {
      "Time_Start": 1583.0,
      "Time_End": 1588.2800000000002,
      "Text": " that's cool. So that means that that password has to be able to be read by the"
    },
    {
      "Time_Start": 1588.2800000000002,
      "Time_End": 1593.1200000000001,
      "Text": " Compellent so you know it's like so this turns out it's a it appears to be some kind of a"
    },
    {
      "Time_Start": 1593.1200000000001,
      "Time_End": 1599.22,
      "Text": " connector between Dell Compellent storage platform and vCenter. So this kinda sits in"
    },
    {
      "Time_Start": 1599.22,
      "Time_End": 1603.28,
      "Text": " between I don't know what it does it probably like creates snapshots or provisions volumes I"
    },
    {
      "Time_Start": 1603.28,
      "Time_End": 1607.88,
      "Text": " have no idea but for some reason in the documentation it says you must give it"
    },
    {
      "Time_Start": 1607.88,
      "Time_End": 1613.82,
      "Text": " administrator level credentials to the Compellent connector in order to to man you know be"
    },
    {
      "Time_Start": 1613.82,
      "Time_End": 1620.04,
      "Text": " the the connector to your vSphere or your vCenter. And so I needed to figure out like"
    },
    {
      "Time_Start": 1620.04,
      "Time_End": 1623.84,
      "Text": " something's gotta write read and write that config let's figure this out. And so sure"
    },
    {
      "Time_Start": 1623.8600000000001,
      "Time_End": 1629.5000000000002,
      "Text": " enough I found uh the install script that was sitting on the box uh that referenced a"
    },
    {
      "Time_Start": 1629.5000000000002,
      "Time_End": 1634.5000000000002,
      "Text": " vspconfigutil.jar and they had a a a class name uh uh reference dell com.dell.compellentvsp.configutil"
    },
    {
      "Time_Start": 1640.2800000000002,
      "Time_End": 1644.88,
      "Text": " um you know there I I enlarged it so you can see it a little bit. So there's a a jar file that"
    },
    {
      "Time_Start": 1644.88,
      "Time_End": 1650.8200000000002,
      "Text": " we found uh and then uh there's the class file that gets run with that jar file. And I'm"
    },
    {
      "Time_Start": 1650.84,
      "Time_End": 1655.04,
      "Text": " like well that sounds like something that you'll get configuration data that thing's gotta"
    },
    {
      "Time_Start": 1655.04,
      "Time_End": 1661.4399999999998,
      "Text": " be able to somehow read that encrypted value and decrypt it right. So I uh I've actually"
    },
    {
      "Time_Start": 1661.4399999999998,
      "Time_End": 1666.62,
      "Text": " been a Java developer for most of my career I probably coded Java for about 25 years I'm"
    },
    {
      "Time_Start": 1666.62,
      "Time_End": 1671.52,
      "Text": " like I'm not I'm not shied away by this at all. And I've you know played a few CTS. I'm"
    },
    {
      "Time_Start": 1671.52,
      "Time_End": 1676.52,
      "Text": " like I uh you know understanding a jar file all it is is a zip file. Uh you can use a jar"
    },
    {
      "Time_Start": 1676.56,
      "Time_End": 1682.3,
      "Text": " util or in this particular case you just use I just used unzip unzip the jar file and it it"
    },
    {
      "Time_Start": 1682.3,
      "Time_End": 1689.3,
      "Text": " takes every so uh in Java everything's compiled into different classes. So uh in in those"
    },
    {
      "Time_Start": 1689.3,
      "Time_End": 1694.68,
      "Text": " classes are put into packages. All it is is fancy words for files and files and directories."
    },
    {
      "Time_Start": 1694.68,
      "Time_End": 1700.22,
      "Text": " Uh and I decided I'd just start going down the list. I started with the confutil.class I'm"
    },
    {
      "Time_Start": 1700.22,
      "Time_End": 1705.12,
      "Text": " like I can decompile that because it's an interpreted language or uh well it's a"
    },
    {
      "Time_Start": 1705.1200000000001,
      "Time_End": 1709.96,
      "Text": " compiled language that's interpreted by the Java uh interpreter. Uh so I uh you can get"
    },
    {
      "Time_Start": 1709.96,
      "Time_End": 1716.3000000000002,
      "Text": " decompilers and I I actually use so in a few different steps like I use the the benef uh"
    },
    {
      "Time_Start": 1716.3000000000002,
      "Time_End": 1722.74,
      "Text": " dot org uh decompiler. Uh it's pretty lightweight um easy to use uh and it gives you some"
    },
    {
      "Time_Start": 1722.74,
      "Time_End": 1729.14,
      "Text": " pretty nice looking output. So all I did was download the uh benef dot org uh decompiler"
    },
    {
      "Time_Start": 1729.14,
      "Time_End": 1734.14,
      "Text": " and I fed it that confutil.class and guess what I got? Private key. Who said that? I wish I"
    },
    {
      "Time_Start": 1737.14,
      "Time_End": 1741.6200000000001,
      "Text": " had another shot glass for you man. I would throw it right at you. I got a whiskey bottle but"
    },
    {
      "Time_Start": 1741.6200000000001,
      "Time_End": 1748.46,
      "Text": " it's empty. Um alright so sure enough it it's even commented like uh right above where it"
    },
    {
      "Time_Start": 1748.46,
      "Time_End": 1752.96,
      "Text": " says encryption key it says encrypted type AES. I'm like they're even giving me hints as"
    },
    {
      "Time_Start": 1752.96,
      "Time_End": 1757.96,
      "Text": " to what I need to do here. This is great. Uh and so uh sure enough there's a static AES key."
    },
    {
      "Time_Start": 1760.3,
      "Time_End": 1766.14,
      "Text": " So since this is in the compiled jar file that means this isn't a unique key by customer"
    },
    {
      "Time_Start": 1766.14,
      "Time_End": 1772.48,
      "Text": " right? Anybody that's got this product their v center passwords are stored in the VS in the in"
    },
    {
      "Time_Start": 1772.48,
      "Time_End": 1776.8400000000001,
      "Text": " this VSP properties file encrypted with the same key as any other customer. So it didn't"
    },
    {
      "Time_Start": 1776.8400000000001,
      "Time_End": 1781.28,
      "Text": " matter you know so as long as you can get access to that VSP properties file I'm gonna be"
    },
    {
      "Time_Start": 1781.3,
      "Time_End": 1786.8799999999999,
      "Text": " able to get your password out of that right? Well maybe. Well so let's let's uh step through"
    },
    {
      "Time_Start": 1786.8799999999999,
      "Time_End": 1793.12,
      "Text": " how I got it right? So I knew it was AES of some sort. Uh I got a key. I've got it out of the"
    },
    {
      "Time_Start": 1793.12,
      "Time_End": 1798.12,
      "Text": " properties file. So uh what I did was uh I used a very common uh CTF tool. Any any idea what"
    },
    {
      "Time_Start": 1800.26,
      "Time_End": 1806.36,
      "Text": " tool I might have used? Cyber Chef that's right. So I just went to Cyber Chef. I uh took the"
    },
    {
      "Time_Start": 1806.38,
      "Time_End": 1811.3200000000002,
      "Text": " AES key. I have it redacted here. I'm not that much of an asshole. I uh uh you if you guys"
    },
    {
      "Time_Start": 1811.3200000000002,
      "Time_End": 1816.5200000000002,
      "Text": " want the key you can go get it yourselves. Uh but uh so I put the the AES key uh into the"
    },
    {
      "Time_Start": 1816.5200000000002,
      "Time_End": 1822.44,
      "Text": " AES decrypt method of Cyber Chef and then I put the encrypted password in the input and then"
    },
    {
      "Time_Start": 1822.44,
      "Time_End": 1826.14,
      "Text": " I'm like wait I was digging through the source code what did they use for initial initialization"
    },
    {
      "Time_Start": 1826.14,
      "Time_End": 1830.94,
      "Text": " factor? In fact I was like maybe this is the secret sauce to their key private key because"
    },
    {
      "Time_Start": 1830.94,
      "Time_End": 1834.48,
      "Text": " they didn't actually have it in there. I was trying to figure out like okay how so I just put"
    },
    {
      "Time_Start": 1834.5,
      "Time_End": 1840.24,
      "Text": " in enough zeros until Cyber Chef was happy with it and guess what popped out? Cleartext"
    },
    {
      "Time_Start": 1840.24,
      "Time_End": 1845.24,
      "Text": " password. So now uh I'm armed with uh I'm armed with a uh uh with a cle- a cleartext username"
    },
    {
      "Time_Start": 1848.28,
      "Time_End": 1852.72,
      "Text": " and password. I go back to the vCenter and I'm in. Right? So at this point you do the happy"
    },
    {
      "Time_Start": 1852.72,
      "Time_End": 1858.66,
      "Text": " dance. You're like oh my god I've got access to their vCenter. Uh what ha- why is this"
    },
    {
      "Time_Start": 1858.68,
      "Time_End": 1863.68,
      "Text": " important? Why is it important that I have full admin access to your vCenter? You fucked it"
    },
    {
      "Time_Start": 1865.52,
      "Time_End": 1870.48,
      "Text": " up yeah you're running all the stuff right? This is where like your domain controllers live"
    },
    {
      "Time_Start": 1870.48,
      "Time_End": 1875.26,
      "Text": " and your servers and all the important infrastructure that runs your organization is generally"
    },
    {
      "Time_Start": 1875.26,
      "Time_End": 1881.3000000000002,
      "Text": " accessed through vCenter. That's how vCenter works. Uh so normally at this point like my"
    },
    {
      "Time_Start": 1881.3000000000002,
      "Time_End": 1886.0400000000002,
      "Text": " go to move when I get vCenter access so I've I've exploited vCenter in a lot of different"
    },
    {
      "Time_Start": 1886.08,
      "Time_End": 1892.06,
      "Text": " ways. Thank you Log4J you're the gift that keeps on giving. Um but normally what I'll do is I"
    },
    {
      "Time_Start": 1892.06,
      "Time_End": 1898.1599999999999,
      "Text": " will uh snapshot your domain controller uh and then I'll uh I'll download the uh the first"
    },
    {
      "Time_Start": 1898.1599999999999,
      "Time_End": 1902.86,
      "Text": " ten to twenty gigs of the C drive of your of the hard drive of your domain controller or"
    },
    {
      "Time_Start": 1902.86,
      "Time_End": 1907.1,
      "Text": " where where whatever hard drive is that you're storing the NTDS at it cause it doesn't"
    },
    {
      "Time_Start": 1907.1,
      "Time_End": 1913.8799999999999,
      "Text": " have to be your C drive. Uh and then I will forensically recover uh all the NTDLM hashes"
    },
    {
      "Time_Start": 1913.88,
      "Time_End": 1920.1200000000001,
      "Text": " from the NTDS.DIT uh using the system registry hives uh and and that file in order to get"
    },
    {
      "Time_Start": 1920.1200000000001,
      "Time_End": 1924.2,
      "Text": " all the hashes. And it's cool actually if people are interested I actually have a really"
    },
    {
      "Time_Start": 1924.2,
      "Time_End": 1929.2,
      "Text": " cool technique how I can use a partial hard drive download to then convert it to QCOW2"
    },
    {
      "Time_Start": 1931.4,
      "Time_End": 1937.38,
      "Text": " and then uh uh be able to mount it and and access it because uh often uh when I'm doing"
    },
    {
      "Time_Start": 1937.38,
      "Time_End": 1941.42,
      "Text": " these things uh you're not getting clean images right? Sometimes you're like do you want"
    },
    {
      "Time_Start": 1941.42,
      "Time_End": 1947.0600000000002,
      "Text": " a read only mount of an iSCSI or MFAS or something like that and like even the uh uh the"
    },
    {
      "Time_Start": 1947.0600000000002,
      "Time_End": 1951.5,
      "Text": " registry hives you're not they're not gonna be clean but some of them are like the last"
    },
    {
      "Time_Start": 1951.5,
      "Time_End": 1956.78,
      "Text": " known good boot so like I've like manually patched in packet so I can like go after the"
    },
    {
      "Time_Start": 1956.78,
      "Time_End": 1961.18,
      "Text": " last known good boot to get the the boot key from the previous boot it's likely still the"
    },
    {
      "Time_Start": 1961.18,
      "Time_End": 1967.28,
      "Text": " same key to decrypt your boot key. Um at any rate but that's not what we did here so we"
    },
    {
      "Time_Start": 1967.32,
      "Time_End": 1972.86,
      "Text": " took it a step farther. Uh so in this particular case uh it just you know people always love a"
    },
    {
      "Time_Start": 1972.86,
      "Time_End": 1978.7,
      "Text": " good pento story right? Uh I uh I went ahead and you know I passed on the access to to my"
    },
    {
      "Time_Start": 1978.7,
      "Time_End": 1982.66,
      "Text": " coworker who's working the the IPT and I decided I was gonna fuck around with some of their"
    },
    {
      "Time_Start": 1982.66,
      "Time_End": 1986.84,
      "Text": " other stuff. They had a certificate of authority on the network and so I was uh I was"
    },
    {
      "Time_Start": 1986.84,
      "Time_End": 1993.18,
      "Text": " working with you know we had another low level uh user on their network at this point and"
    },
    {
      "Time_Start": 1993.18,
      "Time_End": 1998.8200000000002,
      "Text": " I was uh I was uh you know messing with their certificate of authority and I definitely"
    },
    {
      "Time_Start": 1998.8200000000002,
      "Time_End": 2003.26,
      "Text": " set off some alarms but my coworker was in the console of vCenter and he's checking out"
    },
    {
      "Time_Start": 2003.26,
      "Time_End": 2008.4,
      "Text": " the consoles he's checking out what servers he had access to and apparently I must have"
    },
    {
      "Time_Start": 2008.4,
      "Time_End": 2014.3400000000001,
      "Text": " set off an alert because uh their their domain administrator went to the CA box and opened"
    },
    {
      "Time_Start": 2014.3400000000001,
      "Time_End": 2019.3400000000001,
      "Text": " up through vCenter the console that my buddy was sitting on and so the the he logged into"
    },
    {
      "Time_Start": 2020.14,
      "Time_End": 2026.38,
      "Text": " the console and he was looking around at the logs and seeing what was going on because I was"
    },
    {
      "Time_Start": 2026.38,
      "Time_End": 2031.7800000000002,
      "Text": " you know messing with the certificate authority my coworker was on the console of the same"
    },
    {
      "Time_Start": 2031.7800000000002,
      "Time_End": 2035.18,
      "Text": " certificate authority when the domain administrator logged in and then it stopped moving he"
    },
    {
      "Time_Start": 2035.18,
      "Time_End": 2041.46,
      "Text": " stopped typing stuff and it looked like he walked away. So guess what my coworker did? Popped"
    },
    {
      "Time_Start": 2041.46,
      "Time_End": 2045.3000000000002,
      "Text": " a PowerShell, created his own domain admin account and then closed it. So then we got domain"
    },
    {
      "Time_Start": 2045.32,
      "Time_End": 2050.36,
      "Text": " administrator without even downloading uh the domain controller. We had open access to a"
    },
    {
      "Time_Start": 2050.36,
      "Time_End": 2055.9,
      "Text": " a console and then from there then we went ahead and uh and we dumped the NTDS that did"
    },
    {
      "Time_Start": 2055.9,
      "Time_End": 2061.24,
      "Text": " across the network and then we we uh we won the day. That was the game over for that"
    },
    {
      "Time_Start": 2061.24,
      "Time_End": 2066.04,
      "Text": " organization. They learned a valuable lesson about uh managing consoles for sure. Um"
    },
    {
      "Time_Start": 2066.04,
      "Time_End": 2072.58,
      "Text": " anyways so in this attack you know uh there's definitely a multiple ways to exploit the"
    },
    {
      "Time_Start": 2072.66,
      "Time_End": 2076.84,
      "Text": " issue so getting back to the Dell issue uh they actually have a couple different user"
    },
    {
      "Time_Start": 2076.84,
      "Time_End": 2080.74,
      "Text": " accounts uh in fact Dell even came out and says oh well you need to change the credentials."
    },
    {
      "Time_Start": 2080.74,
      "Time_End": 2083.88,
      "Text": " Well there's actually two credentials on that box and they only talk about the root"
    },
    {
      "Time_Start": 2083.88,
      "Time_End": 2090.08,
      "Text": " credential and actually any level of access to their this Dell compellant uh connector uh"
    },
    {
      "Time_Start": 2090.08,
      "Time_End": 2095.7599999999998,
      "Text": " will actually let you go and and get this uh get everything that I did here today. Uh and as"
    },
    {
      "Time_Start": 2095.7599999999998,
      "Time_End": 2100.2999999999997,
      "Text": " well as if you ever if any company was doing any segregation of duties like maybe the"
    },
    {
      "Time_Start": 2100.32,
      "Time_End": 2103.76,
      "Text": " administrator had access to upgrade the software and do this but they didn't have access to"
    },
    {
      "Time_Start": 2103.76,
      "Time_End": 2107.1000000000004,
      "Text": " the vCenter password and they had somebody else put that in well the administrator then"
    },
    {
      "Time_Start": 2107.1000000000004,
      "Time_End": 2111.6600000000003,
      "Text": " could then go retrieve that. So if you're trying to do any kind of segregation of duties"
    },
    {
      "Time_Start": 2111.6600000000003,
      "Time_End": 2117.2000000000003,
      "Text": " with uh this connector piece it's it's it's a failed attempt. Um at any rate so that was"
    },
    {
      "Time_Start": 2117.2000000000003,
      "Time_End": 2122.5800000000004,
      "Text": " that. Uh so and then we reported to Dell right? So in April it was about the 11th of April"
    },
    {
      "Time_Start": 2122.5800000000004,
      "Time_End": 2127.7400000000002,
      "Text": " I emailed Dell actually I think it was at this point that Sherry's like you need to talk"
    },
    {
      "Time_Start": 2127.76,
      "Time_End": 2132.8,
      "Text": " about this. And I'm like and I'm like she's like Defcon and Black Hat are coming up uh she's"
    },
    {
      "Time_Start": 2132.8,
      "Time_End": 2138.0600000000004,
      "Text": " like you need to submit and it's more than 90 days so you need to report it and then you're"
    },
    {
      "Time_Start": 2138.0600000000004,
      "Time_End": 2143.0000000000005,
      "Text": " gonna talk about it. I'm like okay I'll do it finally talk about it. Uh and so I emailed uh"
    },
    {
      "Time_Start": 2143.0000000000005,
      "Time_End": 2148.3,
      "Text": " with Dell and and uh my first response back was from Dell was like oh well uh you need to"
    },
    {
      "Time_Start": 2148.3,
      "Time_End": 2152.1800000000003,
      "Text": " open a support ticket with your customer number and this is actually a configuration issue"
    },
    {
      "Time_Start": 2152.1800000000003,
      "Time_End": 2155.88,
      "Text": " on your part and have a nice day. And I'm like so does that mean you're cool with me talking"
    },
    {
      "Time_Start": 2155.92,
      "Time_End": 2160.56,
      "Text": " about this in August? And they're like whoa whoa whoa sorry we didn't mean to send you that"
    },
    {
      "Time_Start": 2160.56,
      "Time_End": 2166.2000000000003,
      "Text": " uh yeah we take security seriously uh and and we're going to we're going to look into this"
    },
    {
      "Time_Start": 2166.2000000000003,
      "Time_End": 2171.3,
      "Text": " and get back to you. Uh and you know and I gave them some more details in May you know a"
    },
    {
      "Time_Start": 2171.3,
      "Time_End": 2175.44,
      "Text": " little bit more back and forth and finally in the end of June I got an email update saying"
    },
    {
      "Time_Start": 2175.44,
      "Time_End": 2180.1800000000003,
      "Text": " that they're going to fix it. In November. And I'm like but I'm gonna talk about it in August"
    },
    {
      "Time_Start": 2180.1800000000003,
      "Time_End": 2184.52,
      "Text": " I told you in April I'm gonna talk about it in August and they uh they they've actually been"
    },
    {
      "Time_Start": 2184.52,
      "Time_End": 2189.2,
      "Text": " pretty decent to work with but uh that's why the other reason why I have a release key uh but"
    },
    {
      "Time_Start": 2189.2,
      "Time_End": 2192.9,
      "Text": " you can go get it I think I've given you enough of the of the road road map that you can go do"
    },
    {
      "Time_Start": 2192.9,
      "Time_End": 2198.0,
      "Text": " this if you've got this in your organization. Uh but uh yeah they're coming out with a fix"
    },
    {
      "Time_Start": 2198.0,
      "Time_End": 2203.1,
      "Text": " uh I think actually that whole storage platform is being uh deprecated but if how many"
    },
    {
      "Time_Start": 2203.1,
      "Time_End": 2208.94,
      "Text": " people in here run storage platforms as long as humanly possible? Right? Cause how hard is"
    },
    {
      "Time_Start": 2208.94,
      "Time_End": 2213.98,
      "Text": " it to move storage platforms? It sucks. So I you know imagine this is going to be not you"
    },
    {
      "Time_Start": 2213.98,
      "Time_End": 2217.68,
      "Text": " know the last time you know oh they deprecated it it's going away well it'll probably you"
    },
    {
      "Time_Start": 2217.68,
      "Time_End": 2221.88,
      "Text": " know you will probably get 5, 6 more years out of it until the thing's not usable anymore"
    },
    {
      "Time_Start": 2221.88,
      "Time_End": 2225.82,
      "Text": " uh cause so many people will use their storage platforms forever and ever. I know this cause"
    },
    {
      "Time_Start": 2225.82,
      "Time_End": 2232.9,
      "Text": " I used to be you. Uh and uh you know there's a lot more uh things out here. Like I just"
    },
    {
      "Time_Start": 2232.9,
      "Time_End": 2239.7400000000002,
      "Text": " gave you today these are just 3 examples of uh private keys in public places right? Um I"
    },
    {
      "Time_Start": 2239.7400000000002,
      "Time_End": 2244.4,
      "Text": " mean I I've found private keys in remote logging apps, in routers, cameras. My favorite I'm"
    },
    {
      "Time_Start": 2244.4,
      "Time_End": 2251.34,
      "Text": " not ready to talk about this one yet. Uh there's a camera out there that it has it doesn't"
    },
    {
      "Time_Start": 2251.34,
      "Time_End": 2256.6800000000003,
      "Text": " have a private key. It's got all the components to make a private key that they make the"
    },
    {
      "Time_Start": 2256.6800000000003,
      "Time_End": 2262.1600000000003,
      "Text": " private key on the fly and then use that uh to do the communication with their cloud"
    },
    {
      "Time_Start": 2262.16,
      "Time_End": 2269.68,
      "Text": " service. So if that's you guys I'm coming for ya. Uh and and also I you know also"
    },
    {
      "Time_Start": 2269.68,
      "Time_End": 2273.22,
      "Text": " printers. I get you know you can get keys out of printers. I actually have other ways other"
    },
    {
      "Time_Start": 2273.22,
      "Time_End": 2276.66,
      "Text": " than just going through firmware to get keys out of printers. I gave a talk actually on"
    },
    {
      "Time_Start": 2276.66,
      "Time_End": 2281.02,
      "Text": " Wednesday at B-Sides on how I met your printer. Uh go ahead and uh look that one up if you're"
    },
    {
      "Time_Start": 2281.02,
      "Time_End": 2286.2999999999997,
      "Text": " interested in in how I can elicit uh your printer just to give me it's password instead of"
    },
    {
      "Time_Start": 2286.3,
      "Time_End": 2292.34,
      "Text": " doing it forensically. But this is a systemic problem right? Uh private keys uh in these"
    },
    {
      "Time_Start": 2292.34,
      "Time_End": 2297.82,
      "Text": " public places like firmware is a is a big problem. Uh and uh I recommend you know"
    },
    {
      "Time_Start": 2297.82,
      "Time_End": 2304.02,
      "Text": " firmware software developers the private keys don't belong in the binaries of your software"
    },
    {
      "Time_Start": 2304.02,
      "Time_End": 2310.0600000000004,
      "Text": " right? This is a bad practice. You know if anything you know uniquely generated per device"
    },
    {
      "Time_Start": 2310.0600000000004,
      "Time_End": 2315.8,
      "Text": " or whatever uh and also you know regular security audits and and testing should be done to"
    },
    {
      "Time_Start": 2315.84,
      "Time_End": 2320.4,
      "Text": " look for these secrets right? There's tools out there that will look at your source code and"
    },
    {
      "Time_Start": 2320.4,
      "Time_End": 2325.0800000000004,
      "Text": " stop the build and your CICD process if you've got a private key hidden there. Cause"
    },
    {
      "Time_Start": 2325.0800000000004,
      "Time_End": 2329.7400000000002,
      "Text": " developers will do it. I've seen it. I've done I've audited code. I've been in software"
    },
    {
      "Time_Start": 2329.7400000000002,
      "Time_End": 2334.7200000000003,
      "Text": " development for most of my career. I know how you guys think. Uh and uh and also"
    },
    {
      "Time_Start": 2334.7200000000003,
      "Time_End": 2339.1600000000003,
      "Text": " coordinated disclosure programs should be adopted right? No more hush money programs"
    },
    {
      "Time_Start": 2339.1600000000003,
      "Time_End": 2343.7200000000003,
      "Text": " where it's like oh yeah we totally took care of that problem. We paid off the the guy that"
    },
    {
      "Time_Start": 2343.7200000000003,
      "Time_End": 2349.26,
      "Text": " found it. Right? Like no you should you should fix your problems and and come clean"
    },
    {
      "Time_Start": 2349.26,
      "Time_End": 2355.46,
      "Text": " about it in public releases. So any more questions? Any more comments? Uh if you want to"
    },
    {
      "Time_Start": 2355.46,
      "Time_End": 2360.0600000000004,
      "Text": " find me on the internet I'm uh creatively Tom Pohl actually it's funny I think my first"
    },
    {
      "Time_Start": 2360.0600000000004,
      "Time_End": 2364.94,
      "Text": " Defcon was Defcon 20 and I I came in I think fourth place in a competition that year and"
    },
    {
      "Time_Start": 2364.94,
      "Time_End": 2368.4800000000005,
      "Text": " that's when Dark Tangent called me out in front of 25,000 hackers for being the only guy"
    },
    {
      "Time_Start": 2368.4800000000005,
      "Time_End": 2372.42,
      "Text": " that goes to a hacker conference and uses his real name. Uh but you can find me very"
    },
    {
      "Time_Start": 2372.42,
      "Time_End": 2378.98,
      "Text": " creatively uh on social media as uh Tom Pohl. Uh I'm on both X or Twitter or whatever it"
    },
    {
      "Time_Start": 2378.98,
      "Time_End": 2384.9,
      "Text": " is now as well as uh the on Mastodon and you can find me on LinkedIn as well. Thank you"
    },
    {
      "Time_Start": 2384.9,
      "Time_End": 2386.0,
      "Text": " much for your time today."
    },
    {
      "Time_Start": 2386.0,
      "Time_End": 2393.0,
      "Text": " >>[applause and cheering from audience and audience members in the audience."
    },
    {
      "Time_Start": 2394.6,
      "Time_End": 2397.98,
      "Text": " If you want to if anybody wants to talk afterwards I'm totally cool like if you want to go"
    },
    {
      "Time_Start": 2397.98,
      "Time_End": 2402.04,
      "Text": " to like the chill out lounge or something and we you know sit and and uh have some beers"
    },
    {
      "Time_Start": 2402.04,
      "Time_End": 2404.1,
      "Text": " and and talk more I'd love to talk with you guys."
    }
  ]
}