{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 6.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Let's get started. So you are in one of the last sessions of the first day of DEF CON 31."
    },
    {
      "Time_Start": 6.0,
      "Time_End": 14.0,
      "Text": " And so the idea here is sort of a fireside chat. I mean, I'll be asking a lot of questions,"
    },
    {
      "Time_Start": 14.0,
      "Time_End": 20.0,
      "Text": " but it's really more of a fireside chat with the acting director of the Office of National"
    },
    {
      "Time_Start": 20.0,
      "Time_End": 28.0,
      "Text": " Cyber Security, ONCDNet. And so then it's my pleasure to introduce Kemba Walton, the"
    },
    {
      "Time_Start": 28.0,
      "Time_End": 32.0,
      "Text": " acting director."
    },
    {
      "Time_Start": 32.0,
      "Time_End": 40.0,
      "Text": " This is her first time at DEF CON. First time at DEF CON."
    },
    {
      "Time_Start": 40.0,
      "Time_End": 48.0,
      "Text": " What does it mean when it's your first time at DEF CON?"
    },
    {
      "Time_Start": 48.0,
      "Time_End": 54.0,
      "Text": " So what is it we have here?"
    },
    {
      "Time_Start": 54.0,
      "Time_End": 62.0,
      "Text": " And she's graciously accepted the challenge."
    },
    {
      "Time_Start": 78.0,
      "Time_End": 82.0,
      "Text": " Okay, so I'm going to invite Kemba to come up and say a couple of words."
    },
    {
      "Time_Start": 82.0,
      "Time_End": 86.0,
      "Text": " I was thinking of teasing out all these answers through all these questions."
    },
    {
      "Time_Start": 86.0,
      "Time_End": 90.0,
      "Text": " What is ONCD? What do you do? What is it like there?"
    },
    {
      "Time_Start": 90.0,
      "Time_End": 94.0,
      "Text": " And it's like, no, just come up and tell us, and we'll get through that quicker,"
    },
    {
      "Time_Start": 94.0,
      "Time_End": 98.0,
      "Text": " and we'll be more authentic, and then we can move on to the questions."
    },
    {
      "Time_Start": 98.0,
      "Time_End": 102.0,
      "Text": " So with that, it's my privilege to introduce Kemba Walton."
    },
    {
      "Time_Start": 102.0,
      "Time_End": 116.0,
      "Text": " I'm going to take this one around, if that's okay."
    },
    {
      "Time_Start": 116.0,
      "Time_End": 120.0,
      "Text": " Is it long enough? Oh, it's not long enough."
    },
    {
      "Time_Start": 120.0,
      "Time_End": 124.0,
      "Text": " So I'm vertically challenged. I'm trying to figure out a way to see you all."
    },
    {
      "Time_Start": 124.0,
      "Time_End": 130.0,
      "Text": " Can you see me? You can't? No, you can't see me, right?"
    },
    {
      "Time_Start": 130.0,
      "Time_End": 138.0,
      "Text": " Okay, I'm going to stand over here."
    },
    {
      "Time_Start": 138.0,
      "Time_End": 142.0,
      "Text": " Great, now I can see you all. You can see me. Okay, good."
    },
    {
      "Time_Start": 142.0,
      "Time_End": 152.0,
      "Text": " So I am Kemba Walton. I am the acting National Cyber Director in the White House."
    },
    {
      "Time_Start": 152.0,
      "Time_End": 156.0,
      "Text": " I want to tell you a little bit about what we do and who we are"
    },
    {
      "Time_Start": 156.0,
      "Time_End": 160.0,
      "Text": " and how lucky I am to be in the White House working with some incredible folks."
    },
    {
      "Time_Start": 160.0,
      "Time_End": 164.0,
      "Text": " Before I get started, I want to just point to the front row."
    },
    {
      "Time_Start": 164.0,
      "Time_End": 168.0,
      "Text": " Here at DEF CON, we have a whole staff here who are here to talk to you"
    },
    {
      "Time_Start": 168.0,
      "Time_End": 172.0,
      "Text": " to help us design better policy. So who are we?"
    },
    {
      "Time_Start": 172.0,
      "Time_End": 176.0,
      "Text": " Let's get this out of the way. We are the newest office in the White House."
    },
    {
      "Time_Start": 176.0,
      "Time_End": 180.0,
      "Text": " We were created by Congress in January of 2021."
    },
    {
      "Time_Start": 180.0,
      "Time_End": 184.0,
      "Text": " Our first National Cyber Director, thank you."
    },
    {
      "Time_Start": 184.0,
      "Time_End": 194.0,
      "Text": " Our first National Cyber Director..."
    },
    {
      "Time_Start": 194.0,
      "Time_End": 199.0,
      "Text": " Our first National Cyber Director was confirmed and appointed in July,"
    },
    {
      "Time_Start": 199.0,
      "Time_End": 205.0,
      "Text": " and we were appropriated, meaning that we got funding in November of 2021."
    },
    {
      "Time_Start": 205.0,
      "Time_End": 211.0,
      "Text": " I came into the office as second in command that following summer, in June of 2022."
    },
    {
      "Time_Start": 211.0,
      "Time_End": 215.0,
      "Text": " So we were stood up by Congress to do one thing, and that was to develop"
    },
    {
      "Time_Start": 215.0,
      "Time_End": 218.0,
      "Text": " national cybersecurity strategy and policy for the president"
    },
    {
      "Time_Start": 218.0,
      "Time_End": 221.0,
      "Text": " and to advise the president as the primary advisor in the White House."
    },
    {
      "Time_Start": 221.0,
      "Time_End": 225.0,
      "Text": " We are designed to be a durable presence in the White House,"
    },
    {
      "Time_Start": 225.0,
      "Time_End": 230.0,
      "Text": " no matter who the administration is, no matter what is going on in the White House at that time."
    },
    {
      "Time_Start": 230.0,
      "Time_End": 236.0,
      "Text": " We are designed to be there. So we will be there, hopefully, for years to come."
    },
    {
      "Time_Start": 236.0,
      "Time_End": 240.0,
      "Text": " So what have we been doing since we got there?"
    },
    {
      "Time_Start": 240.0,
      "Time_End": 247.0,
      "Text": " We first aligned all of the federal departments and agencies that have cybersecurity responsibility."
    },
    {
      "Time_Start": 247.0,
      "Time_End": 252.0,
      "Text": " So that is CISA, DHS, you've heard from Jen Easterly, she's a fantastic partner."
    },
    {
      "Time_Start": 252.0,
      "Time_End": 259.0,
      "Text": " That is the Office of Management and Budget, where the federal CIO sits and the federal CISO sits."
    },
    {
      "Time_Start": 259.0,
      "Time_End": 263.0,
      "Text": " That is the U.S. Secret Service, that's the FBI, that's the intelligence community."
    },
    {
      "Time_Start": 263.0,
      "Time_End": 269.0,
      "Text": " That is the Department of Energy, Health and Human Services, U.S. Department of Agriculture, and et cetera."
    },
    {
      "Time_Start": 269.0,
      "Time_End": 277.0,
      "Text": " We all have a role in cyber. So we were there to sort of orchestrate a common interest in cyber"
    },
    {
      "Time_Start": 277.0,
      "Time_End": 283.0,
      "Text": " and to develop a national strategy. We did that with the help of you, with researchers,"
    },
    {
      "Time_Start": 283.0,
      "Time_End": 291.0,
      "Text": " with civil society, with academia, with state and local entities, with my international partners."
    },
    {
      "Time_Start": 291.0,
      "Time_End": 294.0,
      "Text": " That was the first thing we did. We developed a national cybersecurity strategy."
    },
    {
      "Time_Start": 294.0,
      "Time_End": 301.0,
      "Text": " That was done and signed by President Biden in March of this year, March 2nd, 2023, this year."
    },
    {
      "Time_Start": 301.0,
      "Time_End": 308.0,
      "Text": " After we did that, we then had to make it go, right? So we were novel in developing this strategy."
    },
    {
      "Time_Start": 308.0,
      "Time_End": 313.0,
      "Text": " We decided that we were going to pursue something affirmative this time,"
    },
    {
      "Time_Start": 313.0,
      "Time_End": 320.0,
      "Text": " rather than sort of chasing after bad actors and having them define our agenda."
    },
    {
      "Time_Start": 320.0,
      "Time_End": 327.0,
      "Text": " And so we were going to decide, how do we want to build a defensible, resilient digital ecosystem"
    },
    {
      "Time_Start": 327.0,
      "Time_End": 331.0,
      "Text": " that's aligned with our values? And we discovered, after doing a lot of research"
    },
    {
      "Time_Start": 331.0,
      "Time_End": 336.0,
      "Text": " about what we've been doing for the last 20 years and whether that's worked or hasn't worked,"
    },
    {
      "Time_Start": 336.0,
      "Time_End": 340.0,
      "Text": " we figured out that we needed to make two major shifts."
    },
    {
      "Time_Start": 340.0,
      "Time_End": 348.0,
      "Text": " The first is recognizing that cybersecurity risk and responsibility is now devolved down to the least capable actors."
    },
    {
      "Time_Start": 349.0,
      "Time_End": 355.0,
      "Text": " You've heard me say before, if you were here at Black Hat yesterday, that if my children play Minecraft"
    },
    {
      "Time_Start": 355.0,
      "Time_End": 362.0,
      "Text": " and they click on an interesting link on some other application, they could cause a national security crisis."
    },
    {
      "Time_Start": 362.0,
      "Time_End": 365.0,
      "Text": " That's not fair, and it's inefficient, and that scares me as a mom."
    },
    {
      "Time_Start": 365.0,
      "Time_End": 370.0,
      "Text": " We need to upscale that so that those that are more capable of bearing cybersecurity risk do."
    },
    {
      "Time_Start": 370.0,
      "Time_End": 376.0,
      "Text": " And I include the federal government. I include large enterprises. I include producers in that story."
    },
    {
      "Time_Start": 376.0,
      "Time_End": 381.0,
      "Text": " We are more capable of building a defensible digital ecosystem."
    },
    {
      "Time_Start": 381.0,
      "Time_End": 387.0,
      "Text": " But we know, if you're in the risk business, that you don't get to zero risk. You get residual risk."
    },
    {
      "Time_Start": 387.0,
      "Time_End": 392.0,
      "Text": " And so what do we do with that? We need to figure out what the investments are that we need to make"
    },
    {
      "Time_Start": 392.0,
      "Time_End": 395.0,
      "Text": " in order to make cyberspace more resilient."
    },
    {
      "Time_Start": 395.0,
      "Time_End": 403.0,
      "Text": " And that is, if you take the proposition that cyberspace is technology, people, and doctrine, protocols,"
    },
    {
      "Time_Start": 403.0,
      "Time_End": 409.0,
      "Text": " you need to make it resilient all the way through, not just in technology, but in the people and the protocols."
    },
    {
      "Time_Start": 409.0,
      "Time_End": 417.0,
      "Text": " So we're looking for a defensible digital ecosystem and a resilient digital ecosystem. That's what we mean."
    },
    {
      "Time_Start": 417.0,
      "Time_End": 423.0,
      "Text": " And then we need to make sure it's aligned with our values. Technology by itself has no value."
    },
    {
      "Time_Start": 423.0,
      "Time_End": 427.0,
      "Text": " We put the value in it. People are a part of technology. We are in the internet."
    },
    {
      "Time_Start": 427.0,
      "Time_End": 431.0,
      "Text": " We are the users of the internet. We build the internet. It's unlike any other domain."
    },
    {
      "Time_Start": 431.0,
      "Time_End": 436.0,
      "Text": " It's not like land, space, sea, air. It is something that we've created."
    },
    {
      "Time_Start": 436.0,
      "Time_End": 443.0,
      "Text": " So we build values into cyberspace. And so what do we mean by that? How do we execute that?"
    },
    {
      "Time_Start": 443.0,
      "Time_End": 447.0,
      "Text": " So that was the first thing that we did, one of the major things that we did."
    },
    {
      "Time_Start": 447.0,
      "Time_End": 451.0,
      "Text": " Right after publishing the National Cybersecurity Strategy,"
    },
    {
      "Time_Start": 451.0,
      "Time_End": 455.0,
      "Text": " we worked with our counterparts in the Office of Management and Budget."
    },
    {
      "Time_Start": 455.0,
      "Time_End": 458.0,
      "Text": " Because if you don't have money, it's hard to make these things go."
    },
    {
      "Time_Start": 458.0,
      "Time_End": 462.0,
      "Text": " And we identified opportunities for federal departments and agencies."
    },
    {
      "Time_Start": 462.0,
      "Time_End": 465.0,
      "Text": " Because I can't really instruct what the role does."
    },
    {
      "Time_Start": 465.0,
      "Time_End": 469.0,
      "Text": " But federal departments and agencies, how are they spending their money in cyberspace?"
    },
    {
      "Time_Start": 469.0,
      "Time_End": 473.0,
      "Text": " So we helped them prioritize. We're able to crack open budgets."
    },
    {
      "Time_Start": 473.0,
      "Time_End": 477.0,
      "Text": " And this is the wonky side of me. This is the superpower that we have in our office."
    },
    {
      "Time_Start": 477.0,
      "Time_End": 483.0,
      "Text": " Able to crack open those budgets and figure out where to put the money so that we can make the strategy go."
    },
    {
      "Time_Start": 483.0,
      "Time_End": 487.0,
      "Text": " The other thing that we needed then is action."
    },
    {
      "Time_Start": 487.0,
      "Time_End": 491.0,
      "Text": " Because a strategy is only as good as its implementation."
    },
    {
      "Time_Start": 491.0,
      "Time_End": 496.0,
      "Text": " And so we produced, and the first time we did so in the White House, an action plan."
    },
    {
      "Time_Start": 496.0,
      "Time_End": 499.0,
      "Text": " That's transparent. It's on the website. You can go and look there now."
    },
    {
      "Time_Start": 499.0,
      "Time_End": 505.0,
      "Text": " We have identified across 27 objectives in our national strategy, what are we doing?"
    },
    {
      "Time_Start": 505.0,
      "Time_End": 509.0,
      "Text": " How are we going to implement this? There are 69 action items."
    },
    {
      "Time_Start": 509.0,
      "Time_End": 514.0,
      "Text": " We were thoughtful about it. We collaborated in order to figure out what those action items are."
    },
    {
      "Time_Start": 514.0,
      "Time_End": 518.0,
      "Text": " We identified departments and agencies that are leading on those action items."
    },
    {
      "Time_Start": 518.0,
      "Time_End": 525.0,
      "Text": " And the supporting entities. So ONCD, for example, my office, is responsible for 14 of them."
    },
    {
      "Time_Start": 525.0,
      "Time_End": 531.0,
      "Text": " CISA is responsible for 10. The FBI is responsible for several. DOJ, et cetera, et cetera."
    },
    {
      "Time_Start": 531.0,
      "Time_End": 536.0,
      "Text": " And we put a deadline, a timeline on that. So that we're held accountable."
    },
    {
      "Time_Start": 537.0,
      "Time_End": 541.0,
      "Text": " The thing I couldn't do is to compel all of you to plug in."
    },
    {
      "Time_Start": 541.0,
      "Time_End": 546.0,
      "Text": " But the reason I made it transparent is not just to hold us accountable so that you can measure our progress,"
    },
    {
      "Time_Start": 546.0,
      "Time_End": 551.0,
      "Text": " but so that you can tell us what we've missed or what will make it work better."
    },
    {
      "Time_Start": 551.0,
      "Time_End": 555.0,
      "Text": " This is a living document. The strategy is a durable document."
    },
    {
      "Time_Start": 555.0,
      "Time_End": 562.0,
      "Text": " It is there to sort of last for 10 years. It's technology agnostic."
    },
    {
      "Time_Start": 562.0,
      "Time_End": 565.0,
      "Text": " I think you might see the words AI in there once. Maybe quantum is in there."
    },
    {
      "Time_Start": 565.0,
      "Time_End": 570.0,
      "Text": " But it's technology agnostic. The living document is the action plan."
    },
    {
      "Time_Start": 570.0,
      "Time_End": 574.0,
      "Text": " How do we make this go? So that's the other piece we put forward."
    },
    {
      "Time_Start": 574.0,
      "Time_End": 583.0,
      "Text": " Now, personally, I'm a people person. I think that people are the most important element in cyberspace."
    },
    {
      "Time_Start": 583.0,
      "Time_End": 587.0,
      "Text": " Happy to take challenges and argue other ways."
    },
    {
      "Time_Start": 587.0,
      "Time_End": 592.0,
      "Text": " But I really do think people in that three-piece framework I just gave you"
    },
    {
      "Time_Start": 592.0,
      "Time_End": 595.0,
      "Text": " is the most important part of cyberspace."
    },
    {
      "Time_Start": 595.0,
      "Time_End": 599.0,
      "Text": " And so we executed the National Cyber Workforce and Education Strategy"
    },
    {
      "Time_Start": 599.0,
      "Time_End": 604.0,
      "Text": " in order to make sure that people are more resilient, that they have the foundational skills that they need"
    },
    {
      "Time_Start": 604.0,
      "Time_End": 610.0,
      "Text": " in order to be able to live in cyberspace in a good way."
    },
    {
      "Time_Start": 610.0,
      "Time_End": 613.0,
      "Text": " That is what I've been talking to many of you about."
    },
    {
      "Time_Start": 613.0,
      "Time_End": 618.0,
      "Text": " What are the cyber skills that we need? What are the skills that we need to make this a safer space?"
    },
    {
      "Time_Start": 619.0,
      "Time_End": 624.0,
      "Text": " How do we teach kids? How do we make sure the entire population has foundational cyber skills?"
    },
    {
      "Time_Start": 624.0,
      "Time_End": 627.0,
      "Text": " What does computational literacy look like? What does digital literacy look like?"
    },
    {
      "Time_Start": 627.0,
      "Time_End": 635.0,
      "Text": " But then, for the urgent need of the 700,000 or 800,000 or whatever tens of thousands of jobs that are unfilled,"
    },
    {
      "Time_Start": 635.0,
      "Time_End": 638.0,
      "Text": " what are the skills that we need in that space?"
    },
    {
      "Time_Start": 638.0,
      "Time_End": 644.0,
      "Text": " So I've been talking to several of you today about what does AI do to the digital workforce?"
    },
    {
      "Time_Start": 644.0,
      "Time_End": 647.0,
      "Text": " How do we recruit you? How do you think about this?"
    },
    {
      "Time_Start": 647.0,
      "Time_End": 652.0,
      "Text": " What do you do about federal workforce? How do we recruit you? How do we think about this?"
    },
    {
      "Time_Start": 652.0,
      "Time_End": 656.0,
      "Text": " So those are the big building blocks of the work that we've done."
    },
    {
      "Time_Start": 656.0,
      "Time_End": 660.0,
      "Text": " And then there are some other opportunities that we've identified."
    },
    {
      "Time_Start": 660.0,
      "Time_End": 664.0,
      "Text": " We've just published an RFI, meaning a request for information,"
    },
    {
      "Time_Start": 664.0,
      "Time_End": 668.0,
      "Text": " so that you can tell us how to do our jobs better."
    },
    {
      "Time_Start": 668.0,
      "Time_End": 671.0,
      "Text": " That's the bottom line. That's why I'm here."
    },
    {
      "Time_Start": 671.0,
      "Time_End": 673.0,
      "Text": " And that's why I'm talking to Jeff today."
    },
    {
      "Time_Start": 673.0,
      "Time_End": 676.0,
      "Text": " I just need to know from you how to do our jobs better."
    },
    {
      "Time_Start": 676.0,
      "Time_End": 678.0,
      "Text": " We are in the White House for a reason."
    },
    {
      "Time_Start": 678.0,
      "Time_End": 682.0,
      "Text": " And that is to provide strategic cybersecurity advice to the president."
    },
    {
      "Time_Start": 682.0,
      "Time_End": 686.0,
      "Text": " You need to help me do that. I would be grateful for it."
    },
    {
      "Time_Start": 686.0,
      "Time_End": 691.0,
      "Text": " And with that, Jeff, if we want to sit down and have a chat."
    },
    {
      "Time_Start": 700.0,
      "Time_End": 702.0,
      "Text": " See, wasn't that better?"
    },
    {
      "Time_Start": 702.0,
      "Time_End": 705.0,
      "Text": " Me trying to get that out of a Q&A."
    },
    {
      "Time_Start": 705.0,
      "Time_End": 708.0,
      "Text": " Yeah, so thank you for coming."
    },
    {
      "Time_Start": 708.0,
      "Time_End": 710.0,
      "Text": " It's a little bit like cheating."
    },
    {
      "Time_Start": 710.0,
      "Time_End": 713.0,
      "Text": " We ended up sitting next to each other at dinner last night."
    },
    {
      "Time_Start": 713.0,
      "Time_End": 716.0,
      "Text": " And so before we really get into the nitty-gritty,"
    },
    {
      "Time_Start": 716.0,
      "Time_End": 718.0,
      "Text": " maybe I will tease out of you."
    },
    {
      "Time_Start": 718.0,
      "Time_End": 721.0,
      "Text": " What did you do before this role, right?"
    },
    {
      "Time_Start": 721.0,
      "Time_End": 726.0,
      "Text": " I mean, you have chased bad guys and gone after some bad criminals, right?"
    },
    {
      "Time_Start": 726.0,
      "Time_End": 728.0,
      "Text": " Oh, yeah."
    },
    {
      "Time_Start": 728.0,
      "Time_End": 733.0,
      "Text": " So one of the things I love about what I do is I'm mission-oriented."
    },
    {
      "Time_Start": 733.0,
      "Time_End": 734.0,
      "Text": " Excuse me."
    },
    {
      "Time_Start": 734.0,
      "Time_End": 740.0,
      "Text": " So I was at Microsoft for a little while in what is known as a digital crimes unit."
    },
    {
      "Time_Start": 740.0,
      "Time_End": 747.0,
      "Text": " And I was asked to spin up a counter ransomware piece of that digital crimes unit,"
    },
    {
      "Time_Start": 747.0,
      "Time_End": 750.0,
      "Text": " find creative ways to go after the bad guys."
    },
    {
      "Time_Start": 750.0,
      "Time_End": 753.0,
      "Text": " How do we use our Microsoft tools to do that?"
    },
    {
      "Time_Start": 753.0,
      "Time_End": 755.0,
      "Text": " How do we use the court system to do that?"
    },
    {
      "Time_Start": 755.0,
      "Time_End": 757.0,
      "Text": " Right, because you were a lawyer."
    },
    {
      "Time_Start": 757.0,
      "Time_End": 758.0,
      "Text": " I'm a lawyer."
    },
    {
      "Time_Start": 758.0,
      "Time_End": 759.0,
      "Text": " Right, so you know how to."
    },
    {
      "Time_Start": 759.0,
      "Time_End": 760.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 760.0,
      "Time_End": 762.0,
      "Text": " So you're more like a lawyer, legal hacker."
    },
    {
      "Time_Start": 762.0,
      "Time_End": 764.0,
      "Text": " It's find yourself in the policy space."
    },
    {
      "Time_Start": 764.0,
      "Time_End": 766.0,
      "Text": " That's exactly right."
    },
    {
      "Time_Start": 766.0,
      "Time_End": 770.0,
      "Text": " And we're like the technology hackers finding ourselves in the policy space sometimes, right?"
    },
    {
      "Time_Start": 770.0,
      "Time_End": 772.0,
      "Text": " I like that, yeah."
    },
    {
      "Time_Start": 772.0,
      "Time_End": 776.0,
      "Text": " So, yeah, you said a lot of things that I respond to."
    },
    {
      "Time_Start": 776.0,
      "Time_End": 781.0,
      "Text": " And so people in the audience, what we're going to try to do is have a little bit of a conversation"
    },
    {
      "Time_Start": 781.0,
      "Time_End": 783.0,
      "Text": " so it's not just one-sided."
    },
    {
      "Time_Start": 783.0,
      "Time_End": 786.0,
      "Text": " So hopefully Kemp has got some questions for me."
    },
    {
      "Time_Start": 786.0,
      "Time_End": 789.0,
      "Text": " I have lots of questions."
    },
    {
      "Time_Start": 789.0,
      "Time_End": 790.0,
      "Text": " And so we'll work through it."
    },
    {
      "Time_Start": 790.0,
      "Time_End": 796.0,
      "Text": " So first, though, the last thing you were talking about, workforce."
    },
    {
      "Time_Start": 796.0,
      "Time_End": 798.0,
      "Text": " I mean, that is a really hard one."
    },
    {
      "Time_Start": 798.0,
      "Time_End": 801.0,
      "Text": " It's been hard for decades."
    },
    {
      "Time_Start": 801.0,
      "Time_End": 810.0,
      "Text": " You know, how do you attract, retain, compensate, help people through their career?"
    },
    {
      "Time_Start": 810.0,
      "Time_End": 815.0,
      "Text": " I was on this task force where we looked at cyber skills for the department."
    },
    {
      "Time_Start": 816.0,
      "Time_End": 820.0,
      "Text": " And we would find out that departments don't know the skill levels of their employees."
    },
    {
      "Time_Start": 820.0,
      "Time_End": 823.0,
      "Text": " So they're like, well, we've got people on antivirus."
    },
    {
      "Time_Start": 823.0,
      "Time_End": 826.0,
      "Text": " But we don't know if they're level one or level five or whatever."
    },
    {
      "Time_Start": 826.0,
      "Time_End": 831.0,
      "Text": " So we don't know if we need to hire more entry level or if we need to hire more experts."
    },
    {
      "Time_Start": 831.0,
      "Time_End": 836.0,
      "Text": " We don't know their skill level because we don't have a demonstration of skill like exam."
    },
    {
      "Time_Start": 836.0,
      "Time_End": 839.0,
      "Text": " We know they have a certification, but we don't really know how."
    },
    {
      "Time_Start": 839.0,
      "Time_End": 843.0,
      "Text": " And so it seems like to develop that workforce that you're talking about,"
    },
    {
      "Time_Start": 843.0,
      "Time_End": 846.0,
      "Text": " we need to calibrate, well, how many level ones do we have?"
    },
    {
      "Time_Start": 846.0,
      "Time_End": 848.0,
      "Text": " How many are needed in the market?"
    },
    {
      "Time_Start": 848.0,
      "Time_End": 850.0,
      "Text": " And so that was years ago."
    },
    {
      "Time_Start": 850.0,
      "Time_End": 854.0,
      "Text": " So I'm curious to see how has that evolved more from one department thinking about this"
    },
    {
      "Time_Start": 854.0,
      "Time_End": 859.0,
      "Text": " to the White House thinking about it, department and agency wide."
    },
    {
      "Time_Start": 859.0,
      "Time_End": 862.0,
      "Text": " And then what do you do about it?"
    },
    {
      "Time_Start": 862.0,
      "Time_End": 864.0,
      "Text": " You can't just throw money at this problem because you're the government"
    },
    {
      "Time_Start": 864.0,
      "Time_End": 866.0,
      "Text": " and you don't really have much money."
    },
    {
      "Time_Start": 866.0,
      "Time_End": 868.0,
      "Text": " No, but we have mission."
    },
    {
      "Time_Start": 868.0,
      "Time_End": 869.0,
      "Text": " That's important."
    },
    {
      "Time_Start": 869.0,
      "Time_End": 870.0,
      "Text": " And that's why I'm in the government."
    },
    {
      "Time_Start": 870.0,
      "Time_End": 871.0,
      "Text": " It's because of mission."
    },
    {
      "Time_Start": 871.0,
      "Time_End": 872.0,
      "Text": " It's certainly not for the pay."
    },
    {
      "Time_Start": 873.0,
      "Time_End": 876.0,
      "Text": " So if you think about it this way,"
    },
    {
      "Time_Start": 876.0,
      "Time_End": 882.0,
      "Text": " cybersecurity really facilitates everything we want society to bring us."
    },
    {
      "Time_Start": 882.0,
      "Time_End": 884.0,
      "Text": " We want a digital ecosystem."
    },
    {
      "Time_Start": 884.0,
      "Time_End": 887.0,
      "Text": " We want to, for some reason, we plug our refrigerators in."
    },
    {
      "Time_Start": 887.0,
      "Time_End": 888.0,
      "Text": " We plug our dishwashers in."
    },
    {
      "Time_Start": 888.0,
      "Time_End": 890.0,
      "Text": " We have smart homes."
    },
    {
      "Time_Start": 890.0,
      "Time_End": 895.0,
      "Text": " So we need it to make sure it's secure in order to enable everybody to do the things"
    },
    {
      "Time_Start": 895.0,
      "Time_End": 897.0,
      "Text": " that they want to be able to do."
    },
    {
      "Time_Start": 897.0,
      "Time_End": 900.0,
      "Text": " So we need to think bigger about skilling."
    },
    {
      "Time_Start": 901.0,
      "Time_End": 904.0,
      "Text": " Who are we bringing into this space?"
    },
    {
      "Time_Start": 904.0,
      "Time_End": 908.0,
      "Text": " We need different perspectives in order to be able to do this effectively."
    },
    {
      "Time_Start": 908.0,
      "Time_End": 913.0,
      "Text": " The one thing I worry about is if you have gatekeepers,"
    },
    {
      "Time_Start": 913.0,
      "Time_End": 918.0,
      "Text": " like you have a seal of approval, just what I was talking about,"
    },
    {
      "Time_Start": 918.0,
      "Time_End": 919.0,
      "Text": " you're the level one person."
    },
    {
      "Time_Start": 919.0,
      "Time_End": 922.0,
      "Text": " Well, whoever gets to assign the stamp is now the gatekeeper, right?"
    },
    {
      "Time_Start": 922.0,
      "Time_End": 924.0,
      "Text": " I mean, that's also a little dangerous."
    },
    {
      "Time_Start": 924.0,
      "Time_End": 928.0,
      "Text": " Or, yeah, but it's the five-year-old test and things are different now."
    },
    {
      "Time_Start": 928.0,
      "Time_End": 932.0,
      "Text": " And so it seems like it's more difficult than engineering,"
    },
    {
      "Time_Start": 932.0,
      "Time_End": 935.0,
      "Text": " where the physics of engineering don't change."
    },
    {
      "Time_Start": 935.0,
      "Time_End": 939.0,
      "Text": " Maybe the material science changes a little bit, but gravity is still gravity."
    },
    {
      "Time_Start": 939.0,
      "Time_End": 946.0,
      "Text": " But in the internet or the skills, the demand for AI or rust or something"
    },
    {
      "Time_Start": 946.0,
      "Time_End": 947.0,
      "Text": " are just changing."
    },
    {
      "Time_Start": 947.0,
      "Time_End": 949.0,
      "Text": " So how do you make this a living document?"
    },
    {
      "Time_Start": 949.0,
      "Time_End": 951.0,
      "Text": " How do you know?"
    },
    {
      "Time_Start": 951.0,
      "Time_End": 952.0,
      "Text": " What that is."
    },
    {
      "Time_Start": 952.0,
      "Time_End": 955.0,
      "Text": " So, first of all, we need to, there are two things in my mind."
    },
    {
      "Time_Start": 955.0,
      "Time_End": 958.0,
      "Text": " One, we need to figure out what barriers we've put upon ourselves"
    },
    {
      "Time_Start": 958.0,
      "Time_End": 960.0,
      "Text": " and how do we knock those down."
    },
    {
      "Time_Start": 960.0,
      "Time_End": 962.0,
      "Text": " Do we really need four-year degrees?"
    },
    {
      "Time_Start": 962.0,
      "Time_End": 963.0,
      "Text": " Oh, I see what you're saying."
    },
    {
      "Time_Start": 963.0,
      "Time_End": 966.0,
      "Text": " Do we need really expensive certification?"
    },
    {
      "Time_Start": 966.0,
      "Time_End": 969.0,
      "Text": " Or how do we get people trained and re-skilled and up-skilled"
    },
    {
      "Time_Start": 969.0,
      "Time_End": 971.0,
      "Text": " and meet them where they are?"
    },
    {
      "Time_Start": 971.0,
      "Time_End": 975.0,
      "Text": " Not everybody has whatever thousands of dollars to take a training course."
    },
    {
      "Time_Start": 975.0,
      "Time_End": 976.0,
      "Text": " Right."
    },
    {
      "Time_Start": 976.0,
      "Time_End": 978.0,
      "Text": " And how do we make it so it's sustainable?"
    },
    {
      "Time_Start": 978.0,
      "Time_End": 979.0,
      "Text": " Right."
    },
    {
      "Time_Start": 979.0,
      "Time_End": 981.0,
      "Text": " So one thing is to break down barriers."
    },
    {
      "Time_Start": 981.0,
      "Time_End": 985.0,
      "Text": " The other is to incentivize lifelong learning and feeding the pipeline."
    },
    {
      "Time_Start": 985.0,
      "Time_End": 986.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 986.0,
      "Time_End": 988.0,
      "Text": " So what are we doing for K-12?"
    },
    {
      "Time_Start": 988.0,
      "Time_End": 991.0,
      "Text": " What are we doing for lifelong learning?"
    },
    {
      "Time_Start": 991.0,
      "Time_End": 995.0,
      "Text": " I was just talking to a gentleman that went from IT to OT systems"
    },
    {
      "Time_Start": 995.0,
      "Time_End": 997.0,
      "Text": " and how he made the transition."
    },
    {
      "Time_Start": 997.0,
      "Time_End": 999.0,
      "Text": " And now he's training others to train others."
    },
    {
      "Time_Start": 999.0,
      "Time_End": 1000.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1000.0,
      "Time_End": 1001.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1005.0,
      "Text": " So how do we make that, how do we scale something like that?"
    },
    {
      "Time_Start": 1005.0,
      "Time_End": 1010.0,
      "Text": " And so in the federal government, are you finding particular barriers?"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1013.0,
      "Text": " Like things that we in the private sector or the market,"
    },
    {
      "Time_Start": 1013.0,
      "Time_End": 1015.0,
      "Text": " we don't have those problems."
    },
    {
      "Time_Start": 1015.0,
      "Time_End": 1019.0,
      "Text": " But are there uniquely federal barriers?"
    },
    {
      "Time_Start": 1019.0,
      "Time_End": 1024.0,
      "Text": " So, one, I'm finding that the private sector is suffering too."
    },
    {
      "Time_Start": 1024.0,
      "Time_End": 1026.0,
      "Text": " The one barrier that the private sector doesn't have,"
    },
    {
      "Time_Start": 1026.0,
      "Time_End": 1029.0,
      "Text": " that the government does have, is that you pay a lot more."
    },
    {
      "Time_Start": 1029.0,
      "Time_End": 1031.0,
      "Text": " But we have better mission."
    },
    {
      "Time_Start": 1031.0,
      "Time_End": 1032.0,
      "Text": " We have better mission."
    },
    {
      "Time_Start": 1032.0,
      "Time_End": 1033.0,
      "Text": " We really do."
    },
    {
      "Time_Start": 1033.0,
      "Time_End": 1036.0,
      "Text": " But in private sectors, they can smoke marijuana, I think."
    },
    {
      "Time_Start": 1036.0,
      "Time_End": 1045.0,
      "Text": " What do you think?"
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1048.0,
      "Text": " I mean, you say there's a quantitative lifestyle difference, right?"
    },
    {
      "Time_Start": 1048.0,
      "Time_End": 1049.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1049.0,
      "Time_End": 1052.0,
      "Text": " There's a, I mean, yes."
    },
    {
      "Time_Start": 1052.0,
      "Time_End": 1055.0,
      "Text": " People do smoke marijuana."
    },
    {
      "Time_Start": 1055.0,
      "Time_End": 1056.0,
      "Text": " That is true."
    },
    {
      "Time_Start": 1056.0,
      "Time_End": 1060.0,
      "Text": " I'm just thinking about, when I was at DHS, it was always about suitability."
    },
    {
      "Time_Start": 1060.0,
      "Time_End": 1063.0,
      "Text": " Well, we can't get the clearance because suitability precludes."
    },
    {
      "Time_Start": 1063.0,
      "Time_End": 1067.0,
      "Text": " And it's like you are just walking away from thousands of people"
    },
    {
      "Time_Start": 1067.0,
      "Time_End": 1069.0,
      "Text": " who otherwise would be qualified."
    },
    {
      "Time_Start": 1069.0,
      "Time_End": 1077.0,
      "Text": " And I'm seeing it play over again with legislation or legalization of marijuana."
    },
    {
      "Time_Start": 1077.0,
      "Time_End": 1081.0,
      "Text": " You're excluding yourself from all these workers."
    },
    {
      "Time_Start": 1081.0,
      "Time_End": 1083.0,
      "Text": " I know it's not your job to fix that."
    },
    {
      "Time_Start": 1083.0,
      "Time_End": 1084.0,
      "Text": " Hopefully Congress will fix that."
    },
    {
      "Time_Start": 1084.0,
      "Time_End": 1088.0,
      "Text": " But it's one of those things where it's like when you let people in the military"
    },
    {
      "Time_Start": 1088.0,
      "Time_End": 1089.0,
      "Text": " have tattoos all of a sudden."
    },
    {
      "Time_Start": 1089.0,
      "Time_End": 1092.0,
      "Text": " Well, all of a sudden, more people can join the military."
    },
    {
      "Time_Start": 1092.0,
      "Time_End": 1094.0,
      "Text": " And I just, like you're saying, what are the barriers?"
    },
    {
      "Time_Start": 1094.0,
      "Time_End": 1096.0,
      "Text": " It's more than pay."
    },
    {
      "Time_Start": 1096.0,
      "Time_End": 1099.0,
      "Text": " No, I think I actually agree with you."
    },
    {
      "Time_Start": 1099.0,
      "Time_End": 1104.0,
      "Text": " And I will tell you that we are thinking about how to evolve our policies."
    },
    {
      "Time_Start": 1104.0,
      "Time_End": 1108.0,
      "Text": " And for the most part, we have been evolving our policies around that"
    },
    {
      "Time_Start": 1108.0,
      "Time_End": 1111.0,
      "Text": " so we can meet people where they are."
    },
    {
      "Time_Start": 1111.0,
      "Time_End": 1117.0,
      "Text": " I would suggest that if you do smoke marijuana or have in the past,"
    },
    {
      "Time_Start": 1117.0,
      "Time_End": 1119.0,
      "Text": " that you can still apply for a job and see what happens."
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1123.0,
      "Text": " You know, that's what I would suggest."
    },
    {
      "Time_Start": 1123.0,
      "Time_End": 1126.0,
      "Text": " Okay, if you think it will work, give it a try."
    },
    {
      "Time_Start": 1126.0,
      "Time_End": 1127.0,
      "Text": " Could."
    },
    {
      "Time_Start": 1127.0,
      "Time_End": 1131.0,
      "Text": " So kind of along that line, it's interesting."
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1137.0,
      "Text": " Sometimes when I'm working on, say, a task force, it's U.S. citizens only."
    },
    {
      "Time_Start": 1137.0,
      "Time_End": 1142.0,
      "Text": " And other times, like for CISA, I'm chairing this technical advisory council."
    },
    {
      "Time_Start": 1142.0,
      "Time_End": 1144.0,
      "Text": " I can have people from any planet."
    },
    {
      "Time_Start": 1144.0,
      "Time_End": 1145.0,
      "Text": " I mean any part of the planet."
    },
    {
      "Time_Start": 1145.0,
      "Time_End": 1146.0,
      "Text": " Any planet."
    },
    {
      "Time_Start": 1146.0,
      "Time_End": 1147.0,
      "Text": " Any planet."
    },
    {
      "Time_Start": 1148.0,
      "Time_End": 1149.0,
      "Text": " Drink."
    },
    {
      "Time_Start": 1153.0,
      "Time_End": 1157.0,
      "Text": " Which is great because now I can tap into people in Germany and Japan."
    },
    {
      "Time_Start": 1157.0,
      "Time_End": 1162.0,
      "Text": " And if you think about it, our problems are these global problems."
    },
    {
      "Time_Start": 1162.0,
      "Time_End": 1164.0,
      "Text": " And where does education come in?"
    },
    {
      "Time_Start": 1164.0,
      "Time_End": 1166.0,
      "Text": " Where is the skills coming from?"
    },
    {
      "Time_Start": 1166.0,
      "Time_End": 1168.0,
      "Text": " It's a globally competitive environment."
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1173.0,
      "Text": " So again, also can you hire non-Americans?"
    },
    {
      "Time_Start": 1173.0,
      "Time_End": 1175.0,
      "Text": " Or like what are sort of the restrictions?"
    },
    {
      "Time_Start": 1175.0,
      "Time_End": 1178.0,
      "Text": " Or they can only be a contractor but not a full-time?"
    },
    {
      "Time_Start": 1178.0,
      "Time_End": 1183.0,
      "Text": " No, we can hire anybody with the right skills."
    },
    {
      "Time_Start": 1184.0,
      "Time_End": 1185.0,
      "Text": " Except Russians."
    },
    {
      "Time_Start": 1186.0,
      "Time_End": 1190.0,
      "Text": " Well, there have to be some criteria for hiring."
    },
    {
      "Time_Start": 1190.0,
      "Time_End": 1194.0,
      "Text": " Like you need to be able to lawfully work in the United States, right?"
    },
    {
      "Time_Start": 1194.0,
      "Time_End": 1195.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1195.0,
      "Time_End": 1200.0,
      "Text": " You have to be lawfully here or lawfully able to enter into the U.S. workforce."
    },
    {
      "Time_Start": 1201.0,
      "Time_End": 1208.0,
      "Text": " But we're not necessarily limited by U.S. citizenship, right?"
    },
    {
      "Time_Start": 1208.0,
      "Time_End": 1209.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1209.0,
      "Time_End": 1213.0,
      "Text": " Which means something very different than someone that's able to lawfully work with us."
    },
    {
      "Time_Start": 1215.0,
      "Time_End": 1218.0,
      "Text": " On all of my travels, I've been a lot of places."
    },
    {
      "Time_Start": 1218.0,
      "Time_End": 1219.0,
      "Text": " I've been in Northern Ireland."
    },
    {
      "Time_Start": 1219.0,
      "Time_End": 1221.0,
      "Text": " I've been to Germany a few times."
    },
    {
      "Time_Start": 1221.0,
      "Time_End": 1222.0,
      "Text": " I've been to Estonia."
    },
    {
      "Time_Start": 1222.0,
      "Time_End": 1225.0,
      "Text": " I've been a couple of other places."
    },
    {
      "Time_Start": 1226.0,
      "Time_End": 1229.0,
      "Text": " We are all having workforce challenges."
    },
    {
      "Time_Start": 1229.0,
      "Time_End": 1230.0,
      "Text": " Not just…"
    },
    {
      "Time_Start": 1230.0,
      "Time_End": 1231.0,
      "Text": " Not just us."
    },
    {
      "Time_Start": 1231.0,
      "Time_End": 1234.0,
      "Text": " So our system isn't the problem really."
    },
    {
      "Time_Start": 1234.0,
      "Time_End": 1235.0,
      "Text": " Really, yeah."
    },
    {
      "Time_Start": 1235.0,
      "Time_End": 1243.0,
      "Text": " It's finding opportunities to upskill, reskill, provide foundational skills for the pipeline."
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1245.0,
      "Text": " What are we teaching our kids?"
    },
    {
      "Time_Start": 1245.0,
      "Time_End": 1246.0,
      "Text": " You know, I've got a couple of kids."
    },
    {
      "Time_Start": 1246.0,
      "Time_End": 1247.0,
      "Text": " You've got a couple of kids, right?"
    },
    {
      "Time_Start": 1247.0,
      "Time_End": 1248.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1248.0,
      "Time_End": 1249.0,
      "Text": " You've got a couple more too."
    },
    {
      "Time_Start": 1249.0,
      "Time_End": 1250.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1250.0,
      "Time_End": 1251.0,
      "Text": " What are we teaching them?"
    },
    {
      "Time_Start": 1251.0,
      "Time_End": 1254.0,
      "Text": " How are we preparing them for this workforce, for this economy?"
    },
    {
      "Time_Start": 1254.0,
      "Time_End": 1257.0,
      "Text": " Most of our kids are app natives."
    },
    {
      "Time_Start": 1257.0,
      "Time_End": 1259.0,
      "Text": " They were born into this space."
    },
    {
      "Time_Start": 1259.0,
      "Time_End": 1260.0,
      "Text": " I wasn't, right?"
    },
    {
      "Time_Start": 1260.0,
      "Time_End": 1261.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1261.0,
      "Time_End": 1262.0,
      "Text": " But how are we training them?"
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1265.0,
      "Text": " How are we upskilling, reskilling, teaching foundational skills?"
    },
    {
      "Time_Start": 1265.0,
      "Time_End": 1269.0,
      "Text": " That is a common problem I'm finding across with my counterparts."
    },
    {
      "Time_Start": 1269.0,
      "Time_End": 1273.0,
      "Text": " Yeah, it's interesting because normally there's sort of market forces."
    },
    {
      "Time_Start": 1273.0,
      "Time_End": 1274.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1274.0,
      "Time_End": 1277.0,
      "Text": " And so if you need a lot of engineers, the price of engineers go up."
    },
    {
      "Time_Start": 1277.0,
      "Time_End": 1278.0,
      "Text": " You get a lot of engineers."
    },
    {
      "Time_Start": 1278.0,
      "Time_End": 1284.0,
      "Text": " But for decades, market forces for some reason are not filling the gap."
    },
    {
      "Time_Start": 1284.0,
      "Time_End": 1285.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1285.0,
      "Time_End": 1286.0,
      "Text": " I mean, I don't have the answer."
    },
    {
      "Time_Start": 1286.0,
      "Time_End": 1287.0,
      "Text": " I don't know if you have the answer."
    },
    {
      "Time_Start": 1287.0,
      "Time_End": 1288.0,
      "Text": " But it's just something to think about."
    },
    {
      "Time_Start": 1288.0,
      "Time_End": 1290.0,
      "Text": " Like, why is the market failing?"
    },
    {
      "Time_Start": 1290.0,
      "Time_End": 1291.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1291.0,
      "Time_End": 1292.0,
      "Text": " You know, it's…"
    },
    {
      "Time_Start": 1292.0,
      "Time_End": 1295.0,
      "Text": " Because if you could get at that maybe, or you could better understand,"
    },
    {
      "Time_Start": 1295.0,
      "Time_End": 1300.0,
      "Text": " is it that people feel that to get a higher, like you said, four-year college degree,"
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1305.0,
      "Text": " what I'm hearing is people say that it's hard to hire people with a four-year degree."
    },
    {
      "Time_Start": 1305.0,
      "Time_End": 1310.0,
      "Text": " They'll tell you, don't use this protocol."
    },
    {
      "Time_Start": 1310.0,
      "Time_End": 1311.0,
      "Text": " It's insecure."
    },
    {
      "Time_Start": 1311.0,
      "Time_End": 1314.0,
      "Text": " And then you ask them, well, can you go configure the router to do that?"
    },
    {
      "Time_Start": 1314.0,
      "Time_End": 1315.0,
      "Text": " And they're like, huh?"
    },
    {
      "Time_Start": 1315.0,
      "Time_End": 1316.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1316.0,
      "Time_End": 1318.0,
      "Text": " No, that's right."
    },
    {
      "Time_Start": 1318.0,
      "Time_End": 1320.0,
      "Text": " The four-year degrees, we need them."
    },
    {
      "Time_Start": 1320.0,
      "Time_End": 1321.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1321.0,
      "Time_End": 1322.0,
      "Text": " We need them."
    },
    {
      "Time_Start": 1322.0,
      "Time_End": 1325.0,
      "Text": " So I don't want to say that you should not go get a college degree, but you don't need to."
    },
    {
      "Time_Start": 1325.0,
      "Time_End": 1326.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1326.0,
      "Time_End": 1330.0,
      "Text": " I guess what I'm saying is it's particularly applied in our space."
    },
    {
      "Time_Start": 1330.0,
      "Time_End": 1331.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1331.0,
      "Time_End": 1332.0,
      "Text": " You either know how to configure the router or you don't."
    },
    {
      "Time_Start": 1332.0,
      "Time_End": 1333.0,
      "Text": " Or you don't."
    },
    {
      "Time_Start": 1333.0,
      "Time_End": 1334.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1334.0,
      "Time_End": 1335.0,
      "Text": " There's not a lot of faking it."
    },
    {
      "Time_Start": 1335.0,
      "Time_End": 1336.0,
      "Text": " Yeah, exactly."
    },
    {
      "Time_Start": 1336.0,
      "Time_End": 1340.0,
      "Text": " And so how do we motivate and encourage those skills?"
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1344.0,
      "Text": " How do we incentivize that work?"
    },
    {
      "Time_Start": 1344.0,
      "Time_End": 1349.0,
      "Text": " I've heard that engineers do hacker summer camp because they don't know how to configure a router."
    },
    {
      "Time_Start": 1349.0,
      "Time_End": 1350.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1350.0,
      "Time_End": 1357.0,
      "Text": " They're all in it so that they can become the CISO or the C-suite person."
    },
    {
      "Time_Start": 1357.0,
      "Time_End": 1361.0,
      "Text": " But there are so many other pieces to this that are skill-driven."
    },
    {
      "Time_Start": 1361.0,
      "Time_End": 1363.0,
      "Text": " And we need to figure out how to incentivize that."
    },
    {
      "Time_Start": 1363.0,
      "Time_End": 1366.0,
      "Text": " And I don't have all the answers."
    },
    {
      "Time_Start": 1366.0,
      "Time_End": 1367.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1367.0,
      "Time_End": 1369.0,
      "Text": " I'm the National Cyber Director, and I don't have all the answers."
    },
    {
      "Time_Start": 1369.0,
      "Time_End": 1370.0,
      "Text": " Let's make that clear."
    },
    {
      "Time_Start": 1370.0,
      "Time_End": 1373.0,
      "Text": " I need you to help me figure out what the answer is."
    },
    {
      "Time_Start": 1373.0,
      "Time_End": 1379.0,
      "Text": " Do you have the power to talk to some of your staff and say, hey, go do some research and find out what X, Y."
    },
    {
      "Time_Start": 1379.0,
      "Time_End": 1383.0,
      "Text": " And then when you do that research, is it sort of internal only?"
    },
    {
      "Time_Start": 1383.0,
      "Time_End": 1387.0,
      "Text": " Or can you share that and say, like, hey, we did a survey to figure out for America what to do."
    },
    {
      "Time_Start": 1387.0,
      "Time_End": 1391.0,
      "Text": " But in doing that, we realized here's this trend across 10 countries."
    },
    {
      "Time_Start": 1391.0,
      "Time_End": 1395.0,
      "Text": " So you can help our partners, you know, and allies."
    },
    {
      "Time_Start": 1395.0,
      "Time_End": 1401.0,
      "Text": " Because I have a feeling, since you said you're not the only one, we're not the only ones facing this."
    },
    {
      "Time_Start": 1401.0,
      "Time_End": 1402.0,
      "Text": " We're not the only ones, yeah."
    },
    {
      "Time_Start": 1402.0,
      "Time_End": 1409.0,
      "Text": " If our partners and allies and you're like, hey, Germany, you work on this problem, work on this problem, and all together we can challenge."
    },
    {
      "Time_Start": 1409.0,
      "Time_End": 1414.0,
      "Text": " Or is it everybody feels like, no, no, I need to keep this information to myself for an advantage."
    },
    {
      "Time_Start": 1414.0,
      "Time_End": 1415.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1415.0,
      "Time_End": 1418.0,
      "Text": " Or is it more of a shared sense of sort of we're all in this together?"
    },
    {
      "Time_Start": 1418.0,
      "Time_End": 1420.0,
      "Text": " There is definitely a shared sense of mission."
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1427.0,
      "Text": " One of the reasons I came back into government after leaving for a little while is I was excited about how we're sharing."
    },
    {
      "Time_Start": 1427.0,
      "Time_End": 1430.0,
      "Text": " It's no longer sort of give me, it's mine."
    },
    {
      "Time_Start": 1430.0,
      "Time_End": 1433.0,
      "Text": " It's more let's collaborate, let's figure out problems together."
    },
    {
      "Time_Start": 1433.0,
      "Time_End": 1437.0,
      "Text": " And that's true in this space as well."
    },
    {
      "Time_Start": 1437.0,
      "Time_End": 1446.0,
      "Text": " But one of the ways that we are studying these problems, we issue, I know it sounds wonky, but we issue these RFIs, these requests for information."
    },
    {
      "Time_Start": 1446.0,
      "Time_End": 1447.0,
      "Text": " We've done two so far."
    },
    {
      "Time_Start": 1447.0,
      "Time_End": 1449.0,
      "Text": " No, we've done three actually so far."
    },
    {
      "Time_Start": 1449.0,
      "Time_End": 1452.0,
      "Text": " We did one on workforce back in November."
    },
    {
      "Time_Start": 1452.0,
      "Time_End": 1455.0,
      "Text": " We did one yesterday on open source."
    },
    {
      "Time_Start": 1455.0,
      "Time_End": 1460.0,
      "Text": " And we did one I think that also dropped yesterday or today on regulatory harmonization."
    },
    {
      "Time_Start": 1460.0,
      "Time_End": 1472.0,
      "Text": " All of the responses are public, right, so that we can then use it, we can share it, and we can use it to have a policy conversation and make smart policies."
    },
    {
      "Time_Start": 1472.0,
      "Time_End": 1480.0,
      "Text": " Because I have a fabulous staff, I keep pointing to them in the front row, who are all here to pick your brains around all of our initiatives."
    },
    {
      "Time_Start": 1481.0,
      "Time_End": 1485.0,
      "Text": " But we need that input in order to be able to make effective policy."
    },
    {
      "Time_Start": 1485.0,
      "Time_End": 1487.0,
      "Text": " I mean, what other ways could we do that?"
    },
    {
      "Time_Start": 1487.0,
      "Time_End": 1490.0,
      "Text": " I mean, we have our standard RFI process."
    },
    {
      "Time_Start": 1490.0,
      "Time_End": 1491.0,
      "Text": " You could go hire Gartner."
    },
    {
      "Time_Start": 1491.0,
      "Time_End": 1496.0,
      "Text": " I'm sure they'd be happy to write a report for you for a few million."
    },
    {
      "Time_Start": 1496.0,
      "Time_End": 1501.0,
      "Text": " And so you mentioned two things."
    },
    {
      "Time_Start": 1501.0,
      "Time_End": 1506.0,
      "Text": " I have to remember to cover both open source and partners."
    },
    {
      "Time_Start": 1506.0,
      "Time_End": 1512.0,
      "Text": " And so there's a national cyber strategy."
    },
    {
      "Time_Start": 1512.0,
      "Time_End": 1515.0,
      "Text": " There's a United States strategy for internet."
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1517.0,
      "Text": " CISA announced their strategy."
    },
    {
      "Time_Start": 1517.0,
      "Time_End": 1522.0,
      "Text": " We've got a lot of strategies now, and we didn't a couple years ago."
    },
    {
      "Time_Start": 1522.0,
      "Time_End": 1526.0,
      "Text": " So you're in the audience, and you're like, oh, another strategy."
    },
    {
      "Time_Start": 1526.0,
      "Time_End": 1528.0,
      "Text": " There's a plan to all these strategies, right?"
    },
    {
      "Time_Start": 1528.0,
      "Time_End": 1529.0,
      "Text": " They all work."
    },
    {
      "Time_Start": 1529.0,
      "Time_End": 1531.0,
      "Text": " They all actually work together."
    },
    {
      "Time_Start": 1531.0,
      "Time_End": 1534.0,
      "Text": " Ben Easterly and I talk on a regular basis, right?"
    },
    {
      "Time_Start": 1535.0,
      "Time_End": 1540.0,
      "Text": " Nate Fick, who does our international work for the U.S. government, he's the ambassador at large,"
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1542.0,
      "Text": " and I talk on a regular basis."
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1546.0,
      "Text": " They are crafting, the State Department's crafting their international cyber security strategy."
    },
    {
      "Time_Start": 1546.0,
      "Time_End": 1548.0,
      "Text": " We built an API for that."
    },
    {
      "Time_Start": 1548.0,
      "Time_End": 1550.0,
      "Text": " So paint the picture."
    },
    {
      "Time_Start": 1550.0,
      "Time_End": 1555.0,
      "Text": " You've got the overarching United States strategy, and that's several years old."
    },
    {
      "Time_Start": 1555.0,
      "Time_End": 1557.0,
      "Text": " Yeah, so we have, here's the picture."
    },
    {
      "Time_Start": 1557.0,
      "Time_End": 1560.0,
      "Text": " We have the national security strategy."
    },
    {
      "Time_Start": 1560.0,
      "Time_End": 1565.0,
      "Text": " And I know I keep saying that cyber security is not just national security, and I mean it."
    },
    {
      "Time_Start": 1565.0,
      "Time_End": 1568.0,
      "Text": " It's also economic prosperity and tech innovation."
    },
    {
      "Time_Start": 1568.0,
      "Time_End": 1574.0,
      "Text": " But we are nested under the national security strategy as a national cyber security strategy."
    },
    {
      "Time_Start": 1574.0,
      "Time_End": 1578.0,
      "Text": " That is meant to be 10 years in duration, a shelf life of 10 years."
    },
    {
      "Time_Start": 1578.0,
      "Time_End": 1583.0,
      "Text": " And then nested in that, we have CISA has their operational strategy."
    },
    {
      "Time_Start": 1583.0,
      "Time_End": 1588.0,
      "Text": " So that operational strategy is basically how they're going to achieve the goals enumerated in."
    },
    {
      "Time_Start": 1588.0,
      "Time_End": 1590.0,
      "Text": " Right, and they're internally consistent."
    },
    {
      "Time_Start": 1590.0,
      "Time_End": 1591.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1591.0,
      "Time_End": 1596.0,
      "Text": " With the national, and it's not, it is not NCD's strategy."
    },
    {
      "Time_Start": 1596.0,
      "Time_End": 1598.0,
      "Text": " The President of the United States signed this."
    },
    {
      "Time_Start": 1598.0,
      "Time_End": 1601.0,
      "Text": " So the entire administration is plugged into it, right?"
    },
    {
      "Time_Start": 1601.0,
      "Time_End": 1603.0,
      "Text": " We just held the pen."
    },
    {
      "Time_Start": 1603.0,
      "Time_End": 1607.0,
      "Text": " But CISA's strategy that they just released has, plugs into this."
    },
    {
      "Time_Start": 1607.0,
      "Time_End": 1613.0,
      "Text": " You'll see a marriage of what their strategy says, and what the national cyber security strategy says,"
    },
    {
      "Time_Start": 1613.0,
      "Time_End": 1615.0,
      "Text": " and what the implementation plan says."
    },
    {
      "Time_Start": 1615.0,
      "Time_End": 1620.0,
      "Text": " So then when State Department has theirs, right, that's their version and it goes on and on"
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1624.0,
      "Text": " until everybody's sort of showing how they're part of this."
    },
    {
      "Time_Start": 1624.0,
      "Time_End": 1625.0,
      "Text": " This larger."
    },
    {
      "Time_Start": 1625.0,
      "Time_End": 1626.0,
      "Text": " And is there a level below that?"
    },
    {
      "Time_Start": 1626.0,
      "Time_End": 1631.0,
      "Text": " Or is it now once we get these in a couple years, now this is our game plan."
    },
    {
      "Time_Start": 1631.0,
      "Time_End": 1632.0,
      "Text": " This is what we're doing."
    },
    {
      "Time_Start": 1632.0,
      "Time_End": 1635.0,
      "Text": " No, this is our game plan now."
    },
    {
      "Time_Start": 1635.0,
      "Time_End": 1640.0,
      "Text": " It's the implementation plan that is the piece that nests under it."
    },
    {
      "Time_Start": 1640.0,
      "Time_End": 1641.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 1641.0,
      "Time_End": 1646.0,
      "Text": " That really articulates in a transparent way how we're getting to the norm."
    },
    {
      "Time_Start": 1646.0,
      "Time_End": 1649.0,
      "Text": " So if you were in the audience and you're like, okay, I sign on to this national security strategy."
    },
    {
      "Time_Start": 1649.0,
      "Time_End": 1651.0,
      "Text": " Okay, I'm kind of down with this implementation plan."
    },
    {
      "Time_Start": 1651.0,
      "Time_End": 1653.0,
      "Text": " Man, that seems like a cool problem to work on."
    },
    {
      "Time_Start": 1653.0,
      "Time_End": 1654.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1654.0,
      "Time_End": 1655.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1655.0,
      "Time_End": 1658.0,
      "Text": " So it's to the point now where you could sort of see where you could do your thing."
    },
    {
      "Time_Start": 1658.0,
      "Time_End": 1659.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1659.0,
      "Time_End": 1663.0,
      "Text": " And I want, it would be great if everybody in this room, or as many of you wants to,"
    },
    {
      "Time_Start": 1663.0,
      "Time_End": 1669.0,
      "Text": " will go to our website and look at it and figure out, okay, this is the thing that's interesting to me."
    },
    {
      "Time_Start": 1669.0,
      "Time_End": 1670.0,
      "Text": " This is the agency."
    },
    {
      "Time_Start": 1670.0,
      "Time_End": 1672.0,
      "Text": " So you can go contact that agency."
    },
    {
      "Time_Start": 1672.0,
      "Time_End": 1673.0,
      "Text": " You don't have to come through my office."
    },
    {
      "Time_Start": 1673.0,
      "Time_End": 1674.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1674.0,
      "Time_End": 1676.0,
      "Text": " If it's this, you go straight to Jen or Eric or someone else that's around."
    },
    {
      "Time_Start": 1676.0,
      "Time_End": 1677.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1677.0,
      "Time_End": 1678.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1679.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 1679.0,
      "Time_End": 1682.0,
      "Text": " And so the next thing I want to talk about is before open source is the values."
    },
    {
      "Time_Start": 1682.0,
      "Time_End": 1683.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1683.0,
      "Time_End": 1684.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1685.0,
      "Text": " You talked about the values."
    },
    {
      "Time_Start": 1685.0,
      "Time_End": 1689.0,
      "Text": " And so it's my turn to have a little rant on values."
    },
    {
      "Time_Start": 1689.0,
      "Time_End": 1696.0,
      "Text": " Because it really feels like, especially with what's been going on the last year with China and Iran and Russia for sure,"
    },
    {
      "Time_Start": 1696.0,
      "Time_End": 1701.0,
      "Text": " a couple years ago I was talking about how I feel that there's this sort of great sorting occurring"
    },
    {
      "Time_Start": 1701.0,
      "Time_End": 1705.0,
      "Text": " where it feels like maybe it's economic, maybe it's COVID,"
    },
    {
      "Time_Start": 1705.0,
      "Time_End": 1709.0,
      "Text": " but there's pressures on not just the United States, but countries worldwide,"
    },
    {
      "Time_Start": 1709.0,
      "Time_End": 1713.0,
      "Text": " like pick a team, pick a side, it feels like."
    },
    {
      "Time_Start": 1713.0,
      "Time_End": 1717.0,
      "Text": " And so mentally I've separated it into team rule of law."
    },
    {
      "Time_Start": 1717.0,
      "Time_End": 1722.0,
      "Text": " So team rule of law, we might not all agree on the same laws."
    },
    {
      "Time_Start": 1722.0,
      "Time_End": 1724.0,
      "Text": " Some might be for end-to-end encryption, some may not."
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1731.0,
      "Text": " But generally we believe in resolving our differences through a transparent or democratic rule of law."
    },
    {
      "Time_Start": 1731.0,
      "Time_End": 1734.0,
      "Text": " You've got team undecided in the middle."
    },
    {
      "Time_Start": 1734.0,
      "Time_End": 1738.0,
      "Text": " And they're being pressured by rule of law to, hey, come to our side."
    },
    {
      "Time_Start": 1738.0,
      "Time_End": 1740.0,
      "Text": " Or team authoritarian."
    },
    {
      "Time_Start": 1740.0,
      "Time_End": 1742.0,
      "Text": " Hey, it's so much easier on our side."
    },
    {
      "Time_Start": 1742.0,
      "Time_End": 1743.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1743.0,
      "Time_End": 1745.0,
      "Text": " And they're being pulled."
    },
    {
      "Time_Start": 1745.0,
      "Time_End": 1752.0,
      "Text": " And my contention is being strongly on team rule of law, yeah, we don't always make the right choices,"
    },
    {
      "Time_Start": 1752.0,
      "Time_End": 1760.0,
      "Text": " but can you imagine in China Apple suing the equivalent of their FBI to prevent the FBI from cracking their iPhone?"
    },
    {
      "Time_Start": 1760.0,
      "Time_End": 1763.0,
      "Text": " Like that would never happen in team authoritarian."
    },
    {
      "Time_Start": 1763.0,
      "Time_End": 1767.0,
      "Text": " But in team rule of law, you get to fight in public with your government."
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1768.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 1768.0,
      "Time_End": 1770.0,
      "Text": " That's really powerful."
    },
    {
      "Time_Start": 1770.0,
      "Time_End": 1779.0,
      "Text": " And so those distinctions that allow us to enumerate our values that are really bright lines between us and a team authoritarian,"
    },
    {
      "Time_Start": 1779.0,
      "Time_End": 1781.0,
      "Text": " it's like, hey, look, this is what we stand for."
    },
    {
      "Time_Start": 1781.0,
      "Time_End": 1782.0,
      "Text": " Bright line."
    },
    {
      "Time_Start": 1782.0,
      "Time_End": 1783.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1783.0,
      "Time_End": 1788.0,
      "Text": " You know, gives us more compelling arguments against team undecided."
    },
    {
      "Time_Start": 1788.0,
      "Time_End": 1793.0,
      "Text": " Hey, this is what it means to come up to a, you can see how we operate with law, people don't disappear in the middle of the night."
    },
    {
      "Time_Start": 1793.0,
      "Time_End": 1803.0,
      "Text": " You know, there's this, how do you take those kind of values and try to embed them into cyber policy or any policy to say,"
    },
    {
      "Time_Start": 1803.0,
      "Time_End": 1807.0,
      "Text": " you know, because like you were saying, technology is kind of agnostic, but it has human value."
    },
    {
      "Time_Start": 1807.0,
      "Time_End": 1808.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1808.0,
      "Time_End": 1813.0,
      "Text": " And so that means team rule of law's values, we need to bake those in to make it really clear what we stand for."
    },
    {
      "Time_Start": 1813.0,
      "Time_End": 1814.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1814.0,
      "Time_End": 1816.0,
      "Text": " And are those kind of conversations happening?"
    },
    {
      "Time_Start": 1816.0,
      "Time_End": 1817.0,
      "Text": " Are you thinking about that?"
    },
    {
      "Time_Start": 1817.0,
      "Time_End": 1824.0,
      "Text": " Those are the conversations I'm having right now, you know, here while I'm visiting with individuals in each of the villages."
    },
    {
      "Time_Start": 1824.0,
      "Time_End": 1826.0,
      "Text": " Sort of how do we do that better?"
    },
    {
      "Time_Start": 1826.0,
      "Time_End": 1837.0,
      "Text": " How do we, what are the incentives that we need to create in order to make sure that we're incentivizing the use of generative AI, for example,"
    },
    {
      "Time_Start": 1837.0,
      "Time_End": 1844.0,
      "Text": " or building generative, building the algorithms for generative AI so that they reflect the values that we want to achieve,"
    },
    {
      "Time_Start": 1844.0,
      "Time_End": 1850.0,
      "Text": " that we want to maintain, we want to sustain, which is really an interoperable, open, free internet"
    },
    {
      "Time_Start": 1850.0,
      "Time_End": 1858.0,
      "Text": " that will not allow authoritarian regimes to repress their society, but also preserve American privacy, right?"
    },
    {
      "Time_Start": 1858.0,
      "Time_End": 1859.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1859.0,
      "Time_End": 1861.0,
      "Text": " How do we, how do we do that better?"
    },
    {
      "Time_Start": 1861.0,
      "Time_End": 1866.0,
      "Text": " I don't have all the answers, but I do know that people are an integral part of cyber."
    },
    {
      "Time_Start": 1866.0,
      "Time_End": 1867.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1867.0,
      "Time_End": 1868.0,
      "Text": " It just is."
    },
    {
      "Time_Start": 1868.0,
      "Time_End": 1872.0,
      "Text": " And for that reason, that's the reason why I say people are the most important piece of this."
    },
    {
      "Time_Start": 1872.0,
      "Time_End": 1878.0,
      "Text": " So for generative AI, for example, how are we recruiting, training, retaining talent?"
    },
    {
      "Time_Start": 1878.0,
      "Time_End": 1882.0,
      "Text": " How do we incentivize talent to think about these values?"
    },
    {
      "Time_Start": 1882.0,
      "Time_End": 1889.0,
      "Text": " It seems if you're relying on sense of mission, then you need to be really clear on the mission and the values, right?"
    },
    {
      "Time_Start": 1889.0,
      "Time_End": 1890.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1891.0,
      "Time_End": 1899.0,
      "Text": " And so if I knew how to articulate it better, I would, but it just seems like that's one of our superpowers in Team Rule of Law."
    },
    {
      "Time_Start": 1899.0,
      "Time_End": 1904.0,
      "Text": " We have all this other messy stuff that authoritarians don't have, but we need to lean into our strengths"
    },
    {
      "Time_Start": 1904.0,
      "Time_End": 1910.0,
      "Text": " so that every time Team Undecided is trying to make a decision, our values are clear."
    },
    {
      "Time_Start": 1910.0,
      "Time_End": 1911.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1911.0,
      "Time_End": 1918.0,
      "Text": " And one of the things I worry about, well, not so much worry about, but going back to the Apple for an example,"
    },
    {
      "Time_Start": 1918.0,
      "Time_End": 1928.0,
      "Text": " companies, and I'm curious when you talk to companies, they don't necessarily want to be in the business of bumping heads with the U.S. government."
    },
    {
      "Time_Start": 1928.0,
      "Time_End": 1934.0,
      "Text": " So if they've built their technology in a certain way that means that the FBI is going to subpoena,"
    },
    {
      "Time_Start": 1934.0,
      "Time_End": 1937.0,
      "Text": " they're going to get subpoenas like every day of the week."
    },
    {
      "Time_Start": 1937.0,
      "Time_End": 1939.0,
      "Text": " They're like, well, my business model is not to hire 500 lawyers."
    },
    {
      "Time_Start": 1939.0,
      "Time_End": 1941.0,
      "Text": " My business model is to sell phones."
    },
    {
      "Time_Start": 1941.0,
      "Time_End": 1942.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1942.0,
      "Time_End": 1945.0,
      "Text": " So I want to tell my engineers, get me out of this problem."
    },
    {
      "Time_Start": 1945.0,
      "Time_End": 1947.0,
      "Text": " And the engineers say, end-to-end encryption."
    },
    {
      "Time_Start": 1947.0,
      "Time_End": 1949.0,
      "Text": " We have no information to give them."
    },
    {
      "Time_Start": 1949.0,
      "Time_End": 1952.0,
      "Text": " The business says, great, on to selling phones."
    },
    {
      "Time_Start": 1952.0,
      "Time_End": 1961.0,
      "Text": " And so it seems like you have to also be careful because if you push one way, the market might respond a different way, right?"
    },
    {
      "Time_Start": 1961.0,
      "Time_End": 1964.0,
      "Text": " Because they're not maybe so aligned with."
    },
    {
      "Time_Start": 1964.0,
      "Time_End": 1970.0,
      "Text": " So I also, do you get a lot of pushback from business or how do you think about this?"
    },
    {
      "Time_Start": 1971.0,
      "Time_End": 1979.0,
      "Text": " No, it's, I know we're talking about values, but I can give you a very specific example on regulations, right?"
    },
    {
      "Time_Start": 1979.0,
      "Time_End": 1980.0,
      "Text": " Regulatory harm."
    },
    {
      "Time_Start": 1980.0,
      "Time_End": 1981.0,
      "Text": " Because I am a lawyer after all."
    },
    {
      "Time_Start": 1981.0,
      "Time_End": 1982.0,
      "Text": " Right."
    },
    {
      "Time_Start": 1982.0,
      "Time_End": 1983.0,
      "Text": " Beating you to the line."
    },
    {
      "Time_Start": 1983.0,
      "Time_End": 1988.0,
      "Text": " You know, businesses don't like to be regulated."
    },
    {
      "Time_Start": 1988.0,
      "Time_End": 1990.0,
      "Text": " Obviously, I wouldn't if I were a business."
    },
    {
      "Time_Start": 1990.0,
      "Time_End": 1994.0,
      "Text": " Just for the sake of being regulated, we need to raise minimum cybersecurity requirements."
    },
    {
      "Time_Start": 1994.0,
      "Time_End": 2001.0,
      "Text": " But we worked with the U.S. Chamber of Commerce at the very beginning of the conversation about how do we do this?"
    },
    {
      "Time_Start": 2001.0,
      "Time_End": 2002.0,
      "Text": " How do we do this more effectively?"
    },
    {
      "Time_Start": 2002.0,
      "Time_End": 2007.0,
      "Text": " And that's how we came up with the idea together of, okay, we can't just regulate our way out of this."
    },
    {
      "Time_Start": 2007.0,
      "Time_End": 2011.0,
      "Text": " But we have to figure out how to harmonize existing regulations and find reciprocity."
    },
    {
      "Time_Start": 2011.0,
      "Time_End": 2012.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2012.0,
      "Time_End": 2017.0,
      "Text": " But it was, and so now the business community is very much aligned."
    },
    {
      "Time_Start": 2017.0,
      "Time_End": 2023.0,
      "Text": " And they see themselves in the national cybersecurity strategy in a way that was unexpected."
    },
    {
      "Time_Start": 2023.0,
      "Time_End": 2029.0,
      "Text": " But the reason that happened is because we were there having these conversations at the beginning while we were building it, right?"
    },
    {
      "Time_Start": 2029.0,
      "Time_End": 2032.0,
      "Text": " You hear Jen talk about secure by design."
    },
    {
      "Time_Start": 2032.0,
      "Time_End": 2034.0,
      "Text": " Well, strategy by design."
    },
    {
      "Time_Start": 2034.0,
      "Time_End": 2042.0,
      "Text": " Like at the end of the day, we really are, we need to talk to those that own and operate the technology."
    },
    {
      "Time_Start": 2042.0,
      "Time_End": 2045.0,
      "Text": " The private sector really is, they're the ones that build the tools."
    },
    {
      "Time_Start": 2045.0,
      "Time_End": 2050.0,
      "Text": " So, we have to have a conversation as they're building tools about what those values are."
    },
    {
      "Time_Start": 2050.0,
      "Time_End": 2054.0,
      "Text": " They said like a particular concern or something they're really worried about?"
    },
    {
      "Time_Start": 2054.0,
      "Time_End": 2055.0,
      "Text": " Well, I mean."
    },
    {
      "Time_Start": 2055.0,
      "Time_End": 2057.0,
      "Text": " Like you can do anything you want, but."
    },
    {
      "Time_Start": 2057.0,
      "Time_End": 2064.0,
      "Text": " The president just signed an executive order a few months ago that prohibits operational use of surveillance technology for national security reasons, right?"
    },
    {
      "Time_Start": 2064.0,
      "Time_End": 2066.0,
      "Text": " That's an example."
    },
    {
      "Time_Start": 2066.0,
      "Time_End": 2067.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2067.0,
      "Time_End": 2070.0,
      "Text": " So, you can start drawing these bright boundaries around."
    },
    {
      "Time_Start": 2070.0,
      "Time_End": 2072.0,
      "Text": " So, companies are like, oh, okay, good."
    },
    {
      "Time_Start": 2072.0,
      "Time_End": 2073.0,
      "Text": " You're not going to take my stuff."
    },
    {
      "Time_Start": 2073.0,
      "Time_End": 2074.0,
      "Text": " It's clearer now."
    },
    {
      "Time_Start": 2074.0,
      "Time_End": 2076.0,
      "Text": " I mean, it's not perfect."
    },
    {
      "Time_Start": 2076.0,
      "Time_End": 2078.0,
      "Text": " There's still conversations that need to take place."
    },
    {
      "Time_Start": 2078.0,
      "Time_End": 2080.0,
      "Text": " But it's clearer now what the value is."
    },
    {
      "Time_Start": 2080.0,
      "Time_End": 2083.0,
      "Text": " And the question is now how do we get there?"
    },
    {
      "Time_Start": 2083.0,
      "Time_End": 2084.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2084.0,
      "Time_End": 2086.0,
      "Text": " And so, you know, we have these conversations."
    },
    {
      "Time_Start": 2086.0,
      "Time_End": 2094.0,
      "Text": " This is why it's important for us to go and pick your brains so that we can make smart policies to get us from here to there."
    },
    {
      "Time_Start": 2094.0,
      "Time_End": 2095.0,
      "Text": " First, we agree on the value."
    },
    {
      "Time_Start": 2095.0,
      "Time_End": 2096.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2096.0,
      "Time_End": 2097.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 2097.0,
      "Time_End": 2099.0,
      "Text": " Then we have to figure out how do we get there?"
    },
    {
      "Time_Start": 2099.0,
      "Time_End": 2105.0,
      "Text": " How do we make sure that we are not operationalizing spyware to do harmful things?"
    },
    {
      "Time_Start": 2105.0,
      "Time_End": 2106.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2107.0,
      "Time_End": 2108.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2108.0,
      "Time_End": 2109.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2109.0,
      "Time_End": 2120.0,
      "Text": " And so, it's kind of refreshing and a little scary to hear the conversation around regulation because I don't know how many people have been in this field for like more than two decades."
    },
    {
      "Time_Start": 2120.0,
      "Time_End": 2121.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2121.0,
      "Time_End": 2122.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2122.0,
      "Time_End": 2123.0,
      "Text": " So, yeah."
    },
    {
      "Time_Start": 2123.0,
      "Time_End": 2134.0,
      "Text": " So, remember back when the market was going to solve our problems and we were going to have like a consumer report and tell people how insecure things were."
    },
    {
      "Time_Start": 2134.0,
      "Time_End": 2138.0,
      "Text": " And like Volvo, people would buy the more secure product."
    },
    {
      "Time_Start": 2138.0,
      "Time_End": 2139.0,
      "Text": " Remember that?"
    },
    {
      "Time_Start": 2139.0,
      "Time_End": 2141.0,
      "Text": " It didn't work out."
    },
    {
      "Time_Start": 2141.0,
      "Time_End": 2143.0,
      "Text": " People bought things that had more features."
    },
    {
      "Time_Start": 2143.0,
      "Time_End": 2147.0,
      "Text": " This is more things on the box."
    },
    {
      "Time_Start": 2147.0,
      "Time_End": 2148.0,
      "Text": " Bummer."
    },
    {
      "Time_Start": 2148.0,
      "Time_End": 2153.0,
      "Text": " Software shrink-wrapped license prevented public disclosure of problems."
    },
    {
      "Time_Start": 2153.0,
      "Time_End": 2154.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2155.0,
      "Text": " You couldn't even have a consumer report."
    },
    {
      "Time_Start": 2155.0,
      "Time_End": 2158.0,
      "Text": " It was against the software shrink-wrapped license terms."
    },
    {
      "Time_Start": 2158.0,
      "Time_End": 2159.0,
      "Text": " You couldn't even get your foot in."
    },
    {
      "Time_Start": 2159.0,
      "Time_End": 2160.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2160.0,
      "Time_End": 2161.0,
      "Text": " That's fine."
    },
    {
      "Time_Start": 2161.0,
      "Time_End": 2162.0,
      "Text": " Insurance companies."
    },
    {
      "Time_Start": 2162.0,
      "Time_End": 2167.0,
      "Text": " So, now if you've been around for like 10 or 15 years, right, insurance, cyber insurance is going to save the day."
    },
    {
      "Time_Start": 2167.0,
      "Time_End": 2170.0,
      "Text": " And the insurance companies will know what's more secure."
    },
    {
      "Time_Start": 2170.0,
      "Time_End": 2172.0,
      "Text": " The companies will lower the rates."
    },
    {
      "Time_Start": 2172.0,
      "Time_End": 2173.0,
      "Text": " They'll buy the product."
    },
    {
      "Time_Start": 2173.0,
      "Time_End": 2177.0,
      "Text": " Everybody will emulate those products because they're the clear winners."
    },
    {
      "Time_Start": 2177.0,
      "Time_End": 2180.0,
      "Text": " And then we'll all be driving Volvos a different way through insurance."
    },
    {
      "Time_Start": 2180.0,
      "Time_End": 2181.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2181.0,
      "Time_End": 2183.0,
      "Text": " And that didn't work out."
    },
    {
      "Time_Start": 2183.0,
      "Time_End": 2187.0,
      "Text": " And now we're looking around like we don't have any tools left."
    },
    {
      "Time_Start": 2187.0,
      "Time_End": 2190.0,
      "Text": " Like the only tool left in the tool belt is regulation."
    },
    {
      "Time_Start": 2190.0,
      "Time_End": 2191.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2191.0,
      "Time_End": 2193.0,
      "Text": " And sometimes that tool like hits you in the face."
    },
    {
      "Time_Start": 2193.0,
      "Time_End": 2197.0,
      "Text": " And so, but it's the only tool left."
    },
    {
      "Time_Start": 2197.0,
      "Time_End": 2201.0,
      "Text": " And so, knowing that, you've got to approach it."
    },
    {
      "Time_Start": 2201.0,
      "Time_End": 2204.0,
      "Text": " It sounds like what you're saying is you're approaching it very delicately."
    },
    {
      "Time_Start": 2204.0,
      "Time_End": 2206.0,
      "Text": " We're approaching it intentionally and thoughtfully."
    },
    {
      "Time_Start": 2206.0,
      "Time_End": 2211.0,
      "Text": " So, I think regulation is an important tool for sure."
    },
    {
      "Time_Start": 2211.0,
      "Time_End": 2215.0,
      "Text": " So, my quick follow-on was I don't know if in the strategy you talk about insurance."
    },
    {
      "Time_Start": 2215.0,
      "Time_End": 2217.0,
      "Text": " We do, actually."
    },
    {
      "Time_Start": 2217.0,
      "Time_End": 2222.0,
      "Text": " But we talk about in terms of how do we think about flood insurance, right?"
    },
    {
      "Time_Start": 2222.0,
      "Time_End": 2228.0,
      "Text": " How do we create a backstop to incentivize insurance companies to do better?"
    },
    {
      "Time_Start": 2228.0,
      "Time_End": 2230.0,
      "Text": " And then what are the tradeoffs, right?"
    },
    {
      "Time_Start": 2230.0,
      "Time_End": 2236.0,
      "Text": " So, if we create a backstop, then can we then have insurance companies be a part of the solution"
    },
    {
      "Time_Start": 2236.0,
      "Time_End": 2241.0,
      "Text": " for identifying appropriate security controls to lower your premiums, right?"
    },
    {
      "Time_Start": 2241.0,
      "Time_End": 2243.0,
      "Text": " So, how do we do better with that?"
    },
    {
      "Time_Start": 2244.0,
      "Time_End": 2248.0,
      "Text": " So, we partnered with the Department of Treasury, for example, to figure out, you know,"
    },
    {
      "Time_Start": 2248.0,
      "Time_End": 2252.0,
      "Text": " we had that terrorism backstop that existed."
    },
    {
      "Time_Start": 2252.0,
      "Time_End": 2254.0,
      "Text": " How do we import that here?"
    },
    {
      "Time_Start": 2254.0,
      "Time_End": 2256.0,
      "Text": " How do we take what worked there and…"
    },
    {
      "Time_Start": 2256.0,
      "Time_End": 2258.0,
      "Text": " And see, can it be applied in this…"
    },
    {
      "Time_Start": 2258.0,
      "Time_End": 2260.0,
      "Text": " Can it be applied in this domain, right?"
    },
    {
      "Time_Start": 2260.0,
      "Time_End": 2262.0,
      "Text": " So, there are a lot of tools."
    },
    {
      "Time_Start": 2262.0,
      "Time_End": 2267.0,
      "Text": " So, we don't want to throw away the baby with the bathwater, you know, as they say."
    },
    {
      "Time_Start": 2267.0,
      "Time_End": 2268.0,
      "Text": " Full disclosure, I drive a Volvo."
    },
    {
      "Time_Start": 2268.0,
      "Time_End": 2275.0,
      "Text": " But the reason why is because when I was a kid, I used to drive like a little stick shift"
    },
    {
      "Time_Start": 2275.0,
      "Time_End": 2279.0,
      "Text": " in a little red car, two doors, not thinking about kids."
    },
    {
      "Time_Start": 2279.0,
      "Time_End": 2283.0,
      "Text": " But then as soon as I had a kid, I remember as a kid being influenced by all those commercials."
    },
    {
      "Time_Start": 2283.0,
      "Time_End": 2284.0,
      "Text": " Remember the commercials?"
    },
    {
      "Time_Start": 2284.0,
      "Time_End": 2285.0,
      "Text": " Oh, yeah."
    },
    {
      "Time_Start": 2285.0,
      "Time_End": 2286.0,
      "Text": " They would crash dummies."
    },
    {
      "Time_Start": 2286.0,
      "Time_End": 2287.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2287.0,
      "Time_End": 2289.0,
      "Text": " So, in my head, I had a kid."
    },
    {
      "Time_Start": 2289.0,
      "Time_End": 2293.0,
      "Text": " I needed to make sure that if I go full speed into a wall, I'm not…"
    },
    {
      "Time_Start": 2293.0,
      "Time_End": 2294.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2294.0,
      "Time_End": 2295.0,
      "Text": " Right?"
    },
    {
      "Time_Start": 2295.0,
      "Time_End": 2296.0,
      "Text": " Like, it's a psychological thing."
    },
    {
      "Time_Start": 2296.0,
      "Time_End": 2299.0,
      "Text": " But, you know, it takes time, right?"
    },
    {
      "Time_Start": 2299.0,
      "Time_End": 2300.0,
      "Text": " That was a long time ago."
    },
    {
      "Time_Start": 2300.0,
      "Time_End": 2301.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2301.0,
      "Time_End": 2302.0,
      "Text": " It takes time."
    },
    {
      "Time_Start": 2302.0,
      "Time_End": 2303.0,
      "Text": " But regulation is another tool…"
    },
    {
      "Time_Start": 2303.0,
      "Time_End": 2304.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2304.0,
      "Time_End": 2305.0,
      "Text": " …that we can rely on."
    },
    {
      "Time_Start": 2305.0,
      "Time_End": 2308.0,
      "Text": " And it seems like we're starting to acknowledge it and embrace it."
    },
    {
      "Time_Start": 2308.0,
      "Time_End": 2310.0,
      "Text": " Companies don't push back as much against it, right?"
    },
    {
      "Time_Start": 2310.0,
      "Time_End": 2312.0,
      "Text": " So, now it's more like they're capitulating."
    },
    {
      "Time_Start": 2312.0,
      "Time_End": 2315.0,
      "Text": " It's like, okay, you're going to regulate me, but do it in this way."
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2316.0,
      "Text": " Well, do it in a thoughtful way."
    },
    {
      "Time_Start": 2316.0,
      "Time_End": 2317.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2317.0,
      "Time_End": 2318.0,
      "Text": " It's really the message that I've taken."
    },
    {
      "Time_Start": 2318.0,
      "Time_End": 2319.0,
      "Text": " So, you know, trust…"
    },
    {
      "Time_Start": 2319.0,
      "Time_End": 2321.0,
      "Text": " You talked a lot about trust earlier today."
    },
    {
      "Time_Start": 2321.0,
      "Time_End": 2326.0,
      "Text": " Trust, in my mind, is part capability and part character, right?"
    },
    {
      "Time_Start": 2326.0,
      "Time_End": 2327.0,
      "Text": " We're capable."
    },
    {
      "Time_Start": 2327.0,
      "Time_End": 2329.0,
      "Text": " We know how to regulate."
    },
    {
      "Time_Start": 2329.0,
      "Time_End": 2335.0,
      "Text": " It's the character piece that we're building better in partnership with the private sector,"
    },
    {
      "Time_Start": 2335.0,
      "Time_End": 2336.0,
      "Text": " those that will be regulated."
    },
    {
      "Time_Start": 2336.0,
      "Time_End": 2342.0,
      "Text": " We've acknowledged now that regulation, for the sake of regulation, doesn't really get us very far."
    },
    {
      "Time_Start": 2342.0,
      "Time_End": 2343.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2343.0,
      "Time_End": 2344.0,
      "Text": " So, we need to do better."
    },
    {
      "Time_Start": 2344.0,
      "Time_End": 2347.0,
      "Text": " And we need to do it in partnership with those that are regulated."
    },
    {
      "Time_Start": 2347.0,
      "Time_End": 2351.0,
      "Text": " And that's how we've come up with the idea of harmonizing."
    },
    {
      "Time_Start": 2351.0,
      "Time_End": 2352.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2352.0,
      "Time_End": 2353.0,
      "Text": " Finding reciprocity."
    },
    {
      "Time_Start": 2353.0,
      "Time_End": 2356.0,
      "Text": " So, do you…"
    },
    {
      "Time_Start": 2356.0,
      "Time_End": 2358.0,
      "Text": " I noticed you fly a lot."
    },
    {
      "Time_Start": 2358.0,
      "Time_End": 2359.0,
      "Text": " I do."
    },
    {
      "Time_Start": 2359.0,
      "Time_End": 2361.0,
      "Text": " And you fly to other countries."
    },
    {
      "Time_Start": 2361.0,
      "Time_End": 2362.0,
      "Text": " Yes."
    },
    {
      "Time_Start": 2362.0,
      "Time_End": 2363.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2363.0,
      "Time_End": 2366.0,
      "Text": " So, the National Cyber Director is not necessarily national."
    },
    {
      "Time_Start": 2366.0,
      "Time_End": 2369.0,
      "Text": " Maybe talk about, like, what's going on?"
    },
    {
      "Time_Start": 2369.0,
      "Time_End": 2375.0,
      "Text": " Is it just because the international nature of cyberspace requires not just harmonization inside the United States?"
    },
    {
      "Time_Start": 2375.0,
      "Time_End": 2378.0,
      "Text": " We've got to get with the EU and coordinate with there."
    },
    {
      "Time_Start": 2378.0,
      "Time_End": 2381.0,
      "Text": " So, when it comes time to hunt bad guys, it's easier to…"
    },
    {
      "Time_Start": 2381.0,
      "Time_End": 2383.0,
      "Text": " Like, what are the other challenges?"
    },
    {
      "Time_Start": 2383.0,
      "Time_End": 2384.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2384.0,
      "Time_End": 2386.0,
      "Text": " So, there are lots of challenges."
    },
    {
      "Time_Start": 2386.0,
      "Time_End": 2390.0,
      "Text": " We don't have an internet that just ends at the U.S. border."
    },
    {
      "Time_Start": 2390.0,
      "Time_End": 2391.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2391.0,
      "Time_End": 2392.0,
      "Text": " Neither does Canada."
    },
    {
      "Time_Start": 2392.0,
      "Time_End": 2393.0,
      "Text": " Neither does Germany."
    },
    {
      "Time_Start": 2393.0,
      "Time_End": 2394.0,
      "Text": " Neither does Mali."
    },
    {
      "Time_Start": 2394.0,
      "Time_End": 2395.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2395.0,
      "Time_End": 2401.0,
      "Text": " So, my security, our security here, is wholly dependent upon security of other countries."
    },
    {
      "Time_Start": 2401.0,
      "Time_End": 2408.0,
      "Text": " And so, I have conversations with my counterparts in other countries on a regular basis because we're in it together."
    },
    {
      "Time_Start": 2408.0,
      "Time_End": 2412.0,
      "Text": " You know, we have to make it work."
    },
    {
      "Time_Start": 2412.0,
      "Time_End": 2413.0,
      "Text": " And that's the only way we can make it work."
    },
    {
      "Time_Start": 2413.0,
      "Time_End": 2415.0,
      "Text": " So, yes, I am the National Cyber Director."
    },
    {
      "Time_Start": 2415.0,
      "Time_End": 2419.0,
      "Text": " But it turns out other countries have similar positions."
    },
    {
      "Time_Start": 2419.0,
      "Time_End": 2422.0,
      "Text": " And we're thinking about thinking through similar problems."
    },
    {
      "Time_Start": 2422.0,
      "Time_End": 2423.0,
      "Text": " And we have different perspectives."
    },
    {
      "Time_Start": 2423.0,
      "Time_End": 2424.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2424.0,
      "Time_End": 2425.0,
      "Text": " Because you're more of a strategic role."
    },
    {
      "Time_Start": 2425.0,
      "Time_End": 2426.0,
      "Text": " You're not a tactical role."
    },
    {
      "Time_Start": 2426.0,
      "Time_End": 2427.0,
      "Text": " No."
    },
    {
      "Time_Start": 2427.0,
      "Time_End": 2428.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2428.0,
      "Time_End": 2430.0,
      "Text": " You've got to give the President advice on the big picture."
    },
    {
      "Time_Start": 2430.0,
      "Time_End": 2431.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2431.0,
      "Time_End": 2432.0,
      "Text": " And that involves…"
    },
    {
      "Time_Start": 2432.0,
      "Time_End": 2435.0,
      "Text": " The actual picture, which is beyond the U.S. border."
    },
    {
      "Time_Start": 2435.0,
      "Time_End": 2436.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2436.0,
      "Time_End": 2437.0,
      "Text": " How do we do that better?"
    },
    {
      "Time_Start": 2437.0,
      "Time_End": 2440.0,
      "Text": " But you mentioned regulations."
    },
    {
      "Time_Start": 2440.0,
      "Time_End": 2443.0,
      "Text": " The other piece to that are standards, international standards."
    },
    {
      "Time_Start": 2443.0,
      "Time_End": 2445.0,
      "Text": " I'm, again, a wonky lawyer."
    },
    {
      "Time_Start": 2445.0,
      "Time_End": 2451.0,
      "Text": " And so, I have a pet rock around what are the EU standards, what are the ISO standards, what are our NIST standards."
    },
    {
      "Time_Start": 2451.0,
      "Time_End": 2452.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2452.0,
      "Time_End": 2453.0,
      "Text": " And how do they align?"
    },
    {
      "Time_Start": 2453.0,
      "Time_End": 2454.0,
      "Text": " ITU standards."
    },
    {
      "Time_Start": 2454.0,
      "Time_End": 2455.0,
      "Text": " ITU standards."
    },
    {
      "Time_Start": 2455.0,
      "Time_End": 2456.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2456.0,
      "Time_End": 2458.0,
      "Text": " And how do we make that work better so that it benefits all?"
    },
    {
      "Time_Start": 2459.0,
      "Time_End": 2460.0,
      "Text": " Are you seeing…"
    },
    {
      "Time_Start": 2460.0,
      "Time_End": 2461.0,
      "Text": " And I know we're about…"
    },
    {
      "Time_Start": 2461.0,
      "Time_End": 2462.0,
      "Text": " We're running out of time."
    },
    {
      "Time_Start": 2462.0,
      "Time_End": 2464.0,
      "Text": " So, this is your chance to get in any questions on me."
    },
    {
      "Time_Start": 2464.0,
      "Time_End": 2468.0,
      "Text": " But are you seeing countries that have sort of weaponized these processes?"
    },
    {
      "Time_Start": 2468.0,
      "Time_End": 2472.0,
      "Text": " Like, you know, well, we'll just throw a monkey wrench in the international standards body."
    },
    {
      "Time_Start": 2472.0,
      "Time_End": 2473.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2473.0,
      "Time_End": 2476.0,
      "Text": " And will that team rule of law just be broken for a while?"
    },
    {
      "Time_Start": 2476.0,
      "Time_End": 2478.0,
      "Text": " And we'll, you know…"
    },
    {
      "Time_Start": 2478.0,
      "Time_End": 2479.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2479.0,
      "Time_End": 2480.0,
      "Text": " There's some…"
    },
    {
      "Time_Start": 2480.0,
      "Time_End": 2481.0,
      "Text": " I mean, we covered that a little bit earlier."
    },
    {
      "Time_Start": 2481.0,
      "Time_End": 2483.0,
      "Text": " There's some attempts that way."
    },
    {
      "Time_Start": 2484.0,
      "Time_End": 2495.0,
      "Text": " But the U.S. is investing better in international standards bodies in order to be able to really help import some of the values that we all agree are appropriate, right?"
    },
    {
      "Time_Start": 2495.0,
      "Time_End": 2497.0,
      "Text": " A free, open, interoperable internet."
    },
    {
      "Time_Start": 2497.0,
      "Time_End": 2499.0,
      "Text": " How do we think that through when we think about standards?"
    },
    {
      "Time_Start": 2499.0,
      "Time_End": 2510.0,
      "Text": " How do we contribute to those conversations so that, you know, we don't have authoritarian regimes really influencing the values of those standards, which underpin the regulations and cybersecurity requirements?"
    },
    {
      "Time_Start": 2510.0,
      "Time_End": 2511.0,
      "Text": " But here's my question for you."
    },
    {
      "Time_Start": 2511.0,
      "Time_End": 2512.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2512.0,
      "Time_End": 2518.0,
      "Text": " I'm going to run out of time because I see my goon walking around trying to tell me it's time to wrap up."
    },
    {
      "Time_Start": 2518.0,
      "Time_End": 2531.0,
      "Text": " So, you talked this morning with Allie Maricus, who in our office has a great relationship with DHS, about sort of the government's role 20 years ago, 10 years ago, 5 years ago."
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2538.0,
      "Text": " I'm curious, how do you see this evolving in our partnership and DEF CON in the next 5, 10 years?"
    },
    {
      "Time_Start": 2538.0,
      "Time_End": 2541.0,
      "Text": " What's your vision?"
    },
    {
      "Time_Start": 2541.0,
      "Time_End": 2542.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2542.0,
      "Time_End": 2547.0,
      "Text": " So, how DEF CON has evolved in our relationship, I guess, with the government?"
    },
    {
      "Time_Start": 2547.0,
      "Time_End": 2548.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2548.0,
      "Time_End": 2549.0,
      "Text": " In the policy space."
    },
    {
      "Time_Start": 2549.0,
      "Time_End": 2550.0,
      "Text": " In the policy space."
    },
    {
      "Time_Start": 2550.0,
      "Time_End": 2551.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2551.0,
      "Time_End": 2557.0,
      "Text": " So, I guess when I started, when I was a crazy hacker, nothing of consequence was online."
    },
    {
      "Time_Start": 2557.0,
      "Time_End": 2560.0,
      "Text": " You couldn't hurt anybody or anything."
    },
    {
      "Time_Start": 2560.0,
      "Time_End": 2565.0,
      "Text": " And it was really hard to even figure out if you could steal anything beyond free telephone minutes."
    },
    {
      "Time_Start": 2566.0,
      "Time_End": 2571.0,
      "Text": " And as things got online, all of a sudden, there's consequences now, right?"
    },
    {
      "Time_Start": 2571.0,
      "Time_End": 2572.0,
      "Text": " People can get hurt."
    },
    {
      "Time_Start": 2572.0,
      "Time_End": 2581.0,
      "Text": " And that's kind of like the first reality wave, when it's like, yeah, it's still fun and games, but now there's consequences, right?"
    },
    {
      "Time_Start": 2581.0,
      "Time_End": 2585.0,
      "Text": " And that's when law enforcement, politicians, everybody started."
    },
    {
      "Time_Start": 2585.0,
      "Time_End": 2593.0,
      "Text": " And at the same time, people, the public started to realize there's these evil hackers out there, criminals."
    },
    {
      "Time_Start": 2593.0,
      "Time_End": 2598.0,
      "Text": " And they co-opted our hacking word, but people fear what they don't understand."
    },
    {
      "Time_Start": 2598.0,
      "Time_End": 2601.0,
      "Text": " And that's also true in policy."
    },
    {
      "Time_Start": 2601.0,
      "Time_End": 2609.0,
      "Text": " And so, you have to spend a bunch of time trying to educate policy folks to not be afraid, right?"
    },
    {
      "Time_Start": 2609.0,
      "Time_End": 2611.0,
      "Text": " These are solvable problems."
    },
    {
      "Time_Start": 2611.0,
      "Time_End": 2613.0,
      "Text": " Not everybody wearing a hoodie."
    },
    {
      "Time_Start": 2613.0,
      "Time_End": 2616.0,
      "Text": " If you're wearing a hoodie, raise your hand."
    },
    {
      "Time_Start": 2616.0,
      "Time_End": 2618.0,
      "Text": " See, there's not that many hoodies, right?"
    },
    {
      "Time_Start": 2618.0,
      "Time_End": 2621.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2621.0,
      "Time_End": 2623.0,
      "Text": " Where are my hoodies at?"
    },
    {
      "Time_Start": 2623.0,
      "Time_End": 2626.0,
      "Text": " I think my staff's wearing more hoodies than me."
    },
    {
      "Time_Start": 2626.0,
      "Time_End": 2627.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2627.0,
      "Time_End": 2631.0,
      "Text": " And so, DEF CON is largely a reflection of the hacking community."
    },
    {
      "Time_Start": 2631.0,
      "Time_End": 2634.0,
      "Text": " So, we are not what we were 10 years ago."
    },
    {
      "Time_Start": 2634.0,
      "Time_End": 2638.0,
      "Text": " Things at risk were not what they were 10 years ago."
    },
    {
      "Time_Start": 2638.0,
      "Time_End": 2643.0,
      "Text": " And the asks from government are completely different than they were 10 years ago."
    },
    {
      "Time_Start": 2643.0,
      "Time_End": 2647.0,
      "Text": " 10 years ago, governments would not be asking for our advice."
    },
    {
      "Time_Start": 2647.0,
      "Time_End": 2651.0,
      "Text": " Now, it's almost like they're tripping over themselves."
    },
    {
      "Time_Start": 2651.0,
      "Time_End": 2652.0,
      "Text": " And not just America."
    },
    {
      "Time_Start": 2652.0,
      "Time_End": 2653.0,
      "Text": " I mean, other countries."
    },
    {
      "Time_Start": 2653.0,
      "Time_End": 2655.0,
      "Text": " Everybody is trying to figure out what's going on."
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2657.0,
      "Text": " They want to know the consequences of technology."
    },
    {
      "Time_Start": 2657.0,
      "Time_End": 2663.0,
      "Text": " And they need help that's not a lobbyist or a trade association to give them another perspective."
    },
    {
      "Time_Start": 2663.0,
      "Time_End": 2666.0,
      "Text": " So, they can balance all these perspectives."
    },
    {
      "Time_Start": 2667.0,
      "Time_End": 2669.0,
      "Text": " And so, let me ask you."
    },
    {
      "Time_Start": 2669.0,
      "Time_End": 2671.0,
      "Text": " So, then, why are you here?"
    },
    {
      "Time_Start": 2671.0,
      "Time_End": 2672.0,
      "Text": " Oh, my gosh."
    },
    {
      "Time_Start": 2672.0,
      "Time_End": 2673.0,
      "Text": " Thank you for asking that."
    },
    {
      "Time_Start": 2673.0,
      "Time_End": 2678.0,
      "Text": " I'm here because I need this community to help me make smart policy."
    },
    {
      "Time_Start": 2678.0,
      "Time_End": 2681.0,
      "Text": " And that would have been five years ago."
    },
    {
      "Time_Start": 2681.0,
      "Time_End": 2685.0,
      "Text": " It's just we can't function without it."
    },
    {
      "Time_Start": 2685.0,
      "Time_End": 2688.0,
      "Text": " So, I teach on the side."
    },
    {
      "Time_Start": 2688.0,
      "Time_End": 2691.0,
      "Text": " And one of the things I teach is on cybersecurity risk."
    },
    {
      "Time_Start": 2691.0,
      "Time_End": 2695.0,
      "Text": " And so, risk is a function of threat, vulnerability, and consequence."
    },
    {
      "Time_Start": 2695.0,
      "Time_End": 2701.0,
      "Text": " So, the government, for the most part, has signals and things and can figure out threat pretty well."
    },
    {
      "Time_Start": 2701.0,
      "Time_End": 2706.0,
      "Text": " Where we need the help, mostly, is vulnerability."
    },
    {
      "Time_Start": 2706.0,
      "Time_End": 2708.0,
      "Text": " And, like, literally, vulnerability is in our technology."
    },
    {
      "Time_Start": 2708.0,
      "Time_End": 2709.0,
      "Text": " What are those?"
    },
    {
      "Time_Start": 2709.0,
      "Time_End": 2713.0,
      "Text": " And what's the impact of that vulnerability being exploited?"
    },
    {
      "Time_Start": 2713.0,
      "Time_End": 2719.0,
      "Text": " So, we can make smart policies and pull the right levers on that consequence and vulnerability piece."
    },
    {
      "Time_Start": 2719.0,
      "Time_End": 2722.0,
      "Text": " While, you know, we're arresting bad guys."
    },
    {
      "Time_Start": 2722.0,
      "Time_End": 2723.0,
      "Text": " Because we can do that."
    },
    {
      "Time_Start": 2723.0,
      "Time_End": 2724.0,
      "Text": " You can't do that."
    },
    {
      "Time_Start": 2724.0,
      "Time_End": 2729.0,
      "Text": " But that's what, you know, we're not the smartest people in the room."
    },
    {
      "Time_Start": 2729.0,
      "Time_End": 2733.0,
      "Text": " But together, we can come up with really smart policies."
    },
    {
      "Time_Start": 2733.0,
      "Time_End": 2737.0,
      "Text": " And I need, I crave your assistance in that."
    },
    {
      "Time_Start": 2737.0,
      "Time_End": 2744.0,
      "Text": " One of the reasons why I really like being in cyber is because I get to be around a lot of creative, thought-provoking people."
    },
    {
      "Time_Start": 2744.0,
      "Time_End": 2749.0,
      "Text": " And I've walked around several of the villages and have found creative, thought-provoking people."
    },
    {
      "Time_Start": 2749.0,
      "Time_End": 2752.0,
      "Text": " And had really specific policy conversations."
    },
    {
      "Time_Start": 2752.0,
      "Time_End": 2758.0,
      "Text": " And there are things that I think we're going to be able to do as a result of these conversations."
    },
    {
      "Time_Start": 2758.0,
      "Time_End": 2759.0,
      "Text": " And this has just been a day."
    },
    {
      "Time_Start": 2759.0,
      "Time_End": 2761.0,
      "Text": " And it's just, yeah, been a day."
    },
    {
      "Time_Start": 2761.0,
      "Time_End": 2767.0,
      "Text": " I mean, can you imagine what we can do together if we had constant, thoughtful conversation and interaction?"
    },
    {
      "Time_Start": 2767.0,
      "Time_End": 2769.0,
      "Text": " And that's what I'm here to try to encourage."
    },
    {
      "Time_Start": 2769.0,
      "Time_End": 2770.0,
      "Text": " We're in the White House."
    },
    {
      "Time_Start": 2770.0,
      "Time_End": 2772.0,
      "Text": " But we are just, like, you've seen me."
    },
    {
      "Time_Start": 2772.0,
      "Time_End": 2773.0,
      "Text": " I'm here."
    },
    {
      "Time_Start": 2773.0,
      "Time_End": 2776.0,
      "Text": " I'm not, like, six feet tall and scary."
    },
    {
      "Time_Start": 2776.0,
      "Time_End": 2778.0,
      "Text": " And I try not to be so wonky."
    },
    {
      "Time_Start": 2778.0,
      "Time_End": 2780.0,
      "Text": " But sometimes I can't help my quirks."
    },
    {
      "Time_Start": 2780.0,
      "Time_End": 2784.0,
      "Text": " But, you know, we're here because we need your input."
    },
    {
      "Time_Start": 2784.0,
      "Time_End": 2789.0,
      "Text": " And so I would love more thoughtfulness about how we can gather some of that."
    },
    {
      "Time_Start": 2789.0,
      "Time_End": 2794.0,
      "Text": " So then I guess to your question, if I had some master plan for DEF CON around policy,"
    },
    {
      "Time_Start": 2794.0,
      "Time_End": 2803.0,
      "Text": " it's find a path for hackers and researchers and academics that are interested in policy to learn more about policy."
    },
    {
      "Time_Start": 2803.0,
      "Time_End": 2806.0,
      "Text": " And then have interactions with policy."
    },
    {
      "Time_Start": 2807.0,
      "Time_End": 2812.0,
      "Text": " On the other side, people who are in policy, your staff that are interested in hacking, find a way to channel them in"
    },
    {
      "Time_Start": 2812.0,
      "Time_End": 2820.0,
      "Text": " and make those two communities meet in a, like, in a cooperative, like, environment that's not adversarial."
    },
    {
      "Time_Start": 2820.0,
      "Time_End": 2822.0,
      "Text": " It doesn't have to be on the main stage."
    },
    {
      "Time_Start": 2822.0,
      "Time_End": 2823.0,
      "Text": " It can be inside."
    },
    {
      "Time_Start": 2823.0,
      "Time_End": 2828.0,
      "Text": " But the idea is if we're fostering these communities that intentionally want to work together,"
    },
    {
      "Time_Start": 2828.0,
      "Time_End": 2835.0,
      "Text": " I have to kind of get my side going, right, and more thoughtful about the realities of the limitations of policy."
    },
    {
      "Time_Start": 2835.0,
      "Time_End": 2838.0,
      "Text": " And you got to just figure out, like, well, here's what you can actually really."
    },
    {
      "Time_Start": 2838.0,
      "Time_End": 2845.0,
      "Text": " And then together, you know, maybe if you're interested in this stuff, you can help improve policy."
    },
    {
      "Time_Start": 2845.0,
      "Time_End": 2846.0,
      "Text": " If not, that's great."
    },
    {
      "Time_Start": 2846.0,
      "Time_End": 2848.0,
      "Text": " Go hack something and fix the technology."
    },
    {
      "Time_Start": 2848.0,
      "Time_End": 2849.0,
      "Text": " No policy needed."
    },
    {
      "Time_Start": 2849.0,
      "Time_End": 2856.0,
      "Text": " But it seems like the way the global politics have changed, the consequences of technology, AI coming,"
    },
    {
      "Time_Start": 2856.0,
      "Time_End": 2860.0,
      "Text": " like, we can't always hide under, you know, in a bubble."
    },
    {
      "Time_Start": 2860.0,
      "Time_End": 2861.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2861.0,
      "Time_End": 2864.0,
      "Text": " No, and we can't make smart policy in a bubble."
    },
    {
      "Time_Start": 2864.0,
      "Time_End": 2866.0,
      "Text": " Like, it's just ridiculous."
    },
    {
      "Time_Start": 2866.0,
      "Time_End": 2870.0,
      "Text": " But coming here has been really helpful to me."
    },
    {
      "Time_Start": 2870.0,
      "Time_End": 2873.0,
      "Text": " We hosted a few months ago hackers in the White House."
    },
    {
      "Time_Start": 2873.0,
      "Time_End": 2874.0,
      "Text": " I think that was productive."
    },
    {
      "Time_Start": 2874.0,
      "Time_End": 2876.0,
      "Text": " I think we want to do that again."
    },
    {
      "Time_Start": 2876.0,
      "Time_End": 2878.0,
      "Text": " And maybe we want to do that in other areas."
    },
    {
      "Time_Start": 2878.0,
      "Time_End": 2879.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2879.0,
      "Time_End": 2885.0,
      "Text": " Like, go where you are so that we can develop thoughtful policy based in reality."
    },
    {
      "Time_Start": 2885.0,
      "Time_End": 2886.0,
      "Text": " What do you think about that?"
    },
    {
      "Time_Start": 2886.0,
      "Time_End": 2889.0,
      "Text": " Yeah, no, I'm really a big believer in diversity of opinion."
    },
    {
      "Time_Start": 2889.0,
      "Time_End": 2890.0,
      "Text": " Oh, yeah."
    },
    {
      "Time_Start": 2890.0,
      "Time_End": 2896.0,
      "Text": " Because so much technology has been built in a monoculture and rolled out to the globe."
    },
    {
      "Time_Start": 2896.0,
      "Time_End": 2902.0,
      "Text": " And so fixing that requires a very diverse set of experience, of life experience, right?"
    },
    {
      "Time_Start": 2902.0,
      "Time_End": 2903.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2903.0,
      "Time_End": 2904.0,
      "Text": " Perspectives."
    },
    {
      "Time_Start": 2904.0,
      "Time_End": 2908.0,
      "Text": " You know, we have a very active hackers with disabilities village."
    },
    {
      "Time_Start": 2908.0,
      "Time_End": 2914.0,
      "Text": " And you just, how many of you think about designing a room for wheelchair access, hearing impaired, vision?"
    },
    {
      "Time_Start": 2914.0,
      "Time_End": 2917.0,
      "Text": " You know, you have to take everybody into account."
    },
    {
      "Time_Start": 2917.0,
      "Time_End": 2920.0,
      "Text": " Because when you're fixing the problem for one person, all of a sudden you discover."
    },
    {
      "Time_Start": 2920.0,
      "Time_End": 2921.0,
      "Text": " There's another problem."
    },
    {
      "Time_Start": 2921.0,
      "Time_End": 2924.0,
      "Text": " Another problem for another group of people you hadn't even, you know."
    },
    {
      "Time_Start": 2924.0,
      "Time_End": 2929.0,
      "Text": " And I think the power of the technology of including everybody is, again, that's our super power, right?"
    },
    {
      "Time_Start": 2929.0,
      "Time_End": 2930.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2930.0,
      "Time_End": 2932.0,
      "Text": " We need to show our values."
    },
    {
      "Time_Start": 2932.0,
      "Time_End": 2934.0,
      "Text": " So, anyway, sorry to get all wound up on this."
    },
    {
      "Time_Start": 2934.0,
      "Time_End": 2935.0,
      "Text": " Good."
    },
    {
      "Time_Start": 2935.0,
      "Time_End": 2936.0,
      "Text": " Good."
    },
    {
      "Time_Start": 2936.0,
      "Time_End": 2938.0,
      "Text": " Well, I'm glad you mentioned your super power."
    },
    {
      "Time_Start": 2938.0,
      "Time_End": 2941.0,
      "Text": " And diversity of perspective, diversity of experience."
    },
    {
      "Time_Start": 2941.0,
      "Time_End": 2943.0,
      "Text": " Because that is something that we hold near and dear."
    },
    {
      "Time_Start": 2944.0,
      "Time_End": 2952.0,
      "Text": " I mean, in my office, we focus on, there are four values that I sort of talk about in our office."
    },
    {
      "Time_Start": 2952.0,
      "Time_End": 2956.0,
      "Text": " And, you know, we're an office full of wonks who are cyber people."
    },
    {
      "Time_Start": 2956.0,
      "Time_End": 2958.0,
      "Text": " One is inclusion."
    },
    {
      "Time_Start": 2958.0,
      "Time_End": 2960.0,
      "Text": " And equity and inclusion."
    },
    {
      "Time_Start": 2960.0,
      "Time_End": 2962.0,
      "Text": " Another is accountability."
    },
    {
      "Time_Start": 2962.0,
      "Time_End": 2964.0,
      "Text": " Another is innovation."
    },
    {
      "Time_Start": 2964.0,
      "Time_End": 2967.0,
      "Text": " We need to be innovative in how we do our work."
    },
    {
      "Time_Start": 2967.0,
      "Time_End": 2972.0,
      "Text": " And so if we get those things right, and if we work with this community, we can go a long way."
    },
    {
      "Time_Start": 2972.0,
      "Time_End": 2974.0,
      "Text": " And put transparency in there."
    },
    {
      "Time_Start": 2974.0,
      "Time_End": 2975.0,
      "Text": " Transparency, accountability."
    },
    {
      "Time_Start": 2975.0,
      "Time_End": 2976.0,
      "Text": " Accountability, okay."
    },
    {
      "Time_Start": 2976.0,
      "Time_End": 2977.0,
      "Text": " That's what that is, right?"
    },
    {
      "Time_Start": 2977.0,
      "Time_End": 2979.0,
      "Text": " That's why our action plan is on the website."
    },
    {
      "Time_Start": 2979.0,
      "Time_End": 2980.0,
      "Text": " Right."
    },
    {
      "Time_Start": 2980.0,
      "Time_End": 2983.0,
      "Text": " For anybody to come in and plug into, tell us what's missing."
    },
    {
      "Time_Start": 2983.0,
      "Time_End": 2984.0,
      "Text": " We will evolve it."
    },
    {
      "Time_Start": 2984.0,
      "Time_End": 2987.0,
      "Text": " We will update it based on what you have to tell us."
    },
    {
      "Time_Start": 2987.0,
      "Time_End": 2988.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2988.0,
      "Time_End": 2989.0,
      "Text": " You've got to talk to us."
    },
    {
      "Time_Start": 2989.0,
      "Time_End": 2994.0,
      "Text": " Yeah, my final thought is building the community, outreach to this community requires building trust."
    },
    {
      "Time_Start": 2994.0,
      "Time_End": 2996.0,
      "Text": " And building trust is that accountability and transparency."
    },
    {
      "Time_Start": 2996.0,
      "Time_End": 3001.0,
      "Text": " Even when you screw something up, like we've never screwed anything up, you own it."
    },
    {
      "Time_Start": 3001.0,
      "Time_End": 3002.0,
      "Text": " Yeah, of course."
    },
    {
      "Time_Start": 3002.0,
      "Time_End": 3003.0,
      "Text": " And you try to do better."
    },
    {
      "Time_Start": 3003.0,
      "Time_End": 3004.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3004.0,
      "Time_End": 3009.0,
      "Text": " And I think that's how you build bridges to this."
    },
    {
      "Time_Start": 3009.0,
      "Time_End": 3010.0,
      "Text": " I think so."
    },
    {
      "Time_Start": 3010.0,
      "Time_End": 3011.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3011.0,
      "Time_End": 3012.0,
      "Text": " That's right."
    },
    {
      "Time_Start": 3012.0,
      "Time_End": 3013.0,
      "Text": " All right."
    },
    {
      "Time_Start": 3013.0,
      "Time_End": 3014.0,
      "Text": " Well, thank you very much."
    },
    {
      "Time_Start": 3014.0,
      "Time_End": 3015.0,
      "Text": " Thank you for being in our session."
    },
    {
      "Time_Start": 3015.0,
      "Time_End": 3015.5,
      "Text": " Applause."
    }
  ]
}