{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.5,
      "Text": "This text was transcribed using whisper model: large-v2\n\n All right. Thank you, everyone. Yeah, as he mentioned, we're going to be talking about some"
    },
    {
      "Time_Start": 5.5,
      "Time_End": 11.5,
      "Text": " hacking of data center power equipment and components. So let's dive right in. My name is"
    },
    {
      "Time_Start": 14.34,
      "Time_End": 20.76,
      "Text": " Sam Quinn. I'm a lead senior security researcher at Trellix. You can find me at Twitter or X"
    },
    {
      "Time_Start": 20.76,
      "Time_End": 26.26,
      "Text": " or whatever they're going to call it next week at EIP. My core technical interests include"
    },
    {
      "Time_Start": 26.26,
      "Time_End": 32.260000000000005,
      "Text": " exploitation, hardware hacking, and embedded systems in IoT devices. And I'm Jesse Chick. I'm"
    },
    {
      "Time_Start": 34.02,
      "Time_End": 39.06,
      "Text": " a security researcher who does not have a company, AmEx. And you can find me on Twitter at"
    },
    {
      "Time_Start": 39.06,
      "Time_End": 45.34,
      "Text": " Ravenous Bytes. And I'm really into full system emulation, reverse engineering of all kinds. And"
    },
    {
      "Time_Start": 45.34,
      "Time_End": 51.92,
      "Text": " Sam and I share a passion for hacking IoT and embedded systems. All right. So let's dive"
    },
    {
      "Time_Start": 52.0,
      "Time_End": 58.0,
      "Text": " into what is a data center. Of course, this is the ideal picture everyone sees in their mind."
    },
    {
      "Time_Start": 58.0,
      "Time_End": 64.46000000000001,
      "Text": " However, it really actually just looks like a sterile environment with servers. The term data"
    },
    {
      "Time_Start": 64.46000000000001,
      "Time_End": 70.18,
      "Text": " center kind of referred to multiple things. It could be the facility itself that houses a lot of"
    },
    {
      "Time_Start": 70.18,
      "Time_End": 74.96000000000001,
      "Text": " these servers and cage spaces like this. Or an individual cage space kind of shown in this"
    },
    {
      "Time_Start": 75.00000000000001,
      "Time_End": 81.00000000000001,
      "Text": " picture. Or a co-located server rack that companies call their data center. For the context of"
    },
    {
      "Time_Start": 82.80000000000001,
      "Time_End": 88.76,
      "Text": " this talk, both utilize similar power equipment. So it's kind of interchangeable there. But it's"
    },
    {
      "Time_Start": 88.76,
      "Time_End": 94.54,
      "Text": " something to bring up. The next is why we chose to even hack data centers in the first place. For"
    },
    {
      "Time_Start": 94.54,
      "Time_End": 100.10000000000001,
      "Text": " one, there's a lot of company initiatives to go full cloud. Trellix, my company, is one of"
    },
    {
      "Time_Start": 100.10000000000001,
      "Time_End": 106.10000000000001,
      "Text": " those. There's also some national interest to improve cyber security. It's the number one item"
    },
    {
      "Time_Start": 107.98,
      "Time_End": 113.98,
      "Text": " in this national cyber security strategy. And then last year, I guess, there was some"
    },
    {
      "Time_Start": 113.98,
      "Time_End": 119.9,
      "Text": " bipartisan bill even. And I thought it was funny because they end quote, keep our data safe."
    },
    {
      "Time_Start": 119.9,
      "Time_End": 124.68,
      "Text": " They're trying to get more money to do that. So we wanted to check out how they're really doing"
    },
    {
      "Time_Start": 124.68,
      "Time_End": 130.44,
      "Text": " in that respect. So our approach was to actually like ask some industry experts in data"
    },
    {
      "Time_Start": 130.44,
      "Time_End": 137.48000000000002,
      "Text": " center configuration and like the people that actually run data centers like what would be good"
    },
    {
      "Time_Start": 137.48000000000002,
      "Time_End": 143.10000000000002,
      "Text": " attack vectors for us to research. And we asked them like what keeps them up at night. And one"
    },
    {
      "Time_Start": 143.10000000000002,
      "Time_End": 146.44,
      "Text": " of the things that they always mentioned was when there's no power, you really can't do"
    },
    {
      "Time_Start": 146.44,
      "Time_End": 151.98000000000002,
      "Text": " anything. So power is a big equipment or a big component of data centers that we definitely"
    },
    {
      "Time_Start": 152.01999999999998,
      "Time_End": 159.01999999999998,
      "Text": " wanted to look at. So that was kind of some inspiration for us. There's also quite a few"
    },
    {
      "Time_Start": 159.01999999999998,
      "Time_End": 165.01999999999998,
      "Text": " brands and unique devices that people use in their data centers. They have quite a variety"
    },
    {
      "Time_Start": 166.78,
      "Time_End": 171.39999999999998,
      "Text": " there. But they're all controlling critical stuff if you kind of think back to the data center"
    },
    {
      "Time_Start": 171.39999999999998,
      "Time_End": 177.32,
      "Text": " itself. And then lastly, there's little to none end to end vulnerability research that we"
    },
    {
      "Time_Start": 177.32,
      "Time_End": 182.9,
      "Text": " found in the field. So this is kind of the first step that our team is doing into trying to"
    },
    {
      "Time_Start": 182.9,
      "Time_End": 188.66,
      "Text": " figure out a kind of a holistic audit of data center security. And of course we started with"
    },
    {
      "Time_Start": 188.66,
      "Time_End": 194.78,
      "Text": " that power one from those industry experts. The first product or target I should say that we"
    },
    {
      "Time_Start": 194.78,
      "Time_End": 200.32,
      "Text": " looked at is this DSIM. It's a data center infrastructure management. I'll be saying DSIM"
    },
    {
      "Time_Start": 200.32,
      "Time_End": 206.7,
      "Text": " from here on out because that's quite a mouthful. A DSIM though is used to by IT"
    },
    {
      "Time_Start": 206.70000000000002,
      "Time_End": 212.20000000000002,
      "Text": " administrators to like manage, configure and monitor all of the components inside of a data"
    },
    {
      "Time_Start": 212.20000000000002,
      "Time_End": 218.62,
      "Text": " center. Even including like capacity planning or even like logging and of course"
    },
    {
      "Time_Start": 218.62,
      "Time_End": 224.28000000000003,
      "Text": " controlling some of the critical components like PDUs or power that is used in that data"
    },
    {
      "Time_Start": 224.28000000000003,
      "Time_End": 230.4,
      "Text": " center. This is in a way like a single pane of glass for a lot of these administrators to"
    },
    {
      "Time_Start": 230.4,
      "Time_End": 236.16000000000003,
      "Text": " manage the data center components. And of course because no one goes into data centers, no"
    },
    {
      "Time_Start": 236.16,
      "Time_End": 241.5,
      "Text": " one wants to at least, this also allows for remote management. Which is what we kind of"
    },
    {
      "Time_Start": 241.5,
      "Time_End": 246.5,
      "Text": " thought that this was juicy for. The kind of scenario we want to portray for the kind of our"
    },
    {
      "Time_Start": 249.7,
      "Time_End": 255.62,
      "Text": " talk here is how we envisioned this attack being like chained together in multiple"
    },
    {
      "Time_Start": 255.62,
      "Time_End": 260.82,
      "Text": " vulnerabilities of how you can as an attacker get into a data center. So if you can imagine"
    },
    {
      "Time_Start": 260.82,
      "Time_End": 267.48,
      "Text": " this DSIM software is running either on, in the cloud or even on a on prem server. Some on the"
    },
    {
      "Time_Start": 267.48,
      "Time_End": 273.98,
      "Text": " network, somewhere on that. The, from talking to like the experts in data center"
    },
    {
      "Time_Start": 273.98,
      "Time_End": 277.78,
      "Text": " configuration, they mentioned that a lot of the critical stuff that's inside the cage space or"
    },
    {
      "Time_Start": 277.78,
      "Time_End": 284.74,
      "Text": " data center itself would be on particular VLANs or fired off from the greater network. However"
    },
    {
      "Time_Start": 284.74,
      "Time_End": 290.53999999999996,
      "Text": " if you can imagine via this like blue arrow here, that if the DSIM is already set up to"
    },
    {
      "Time_Start": 290.54,
      "Time_End": 295.8,
      "Text": " manage those and get logs back and forth, that there are those communication channels already"
    },
    {
      "Time_Start": 295.8,
      "Time_End": 301.18,
      "Text": " in place. Meaning that if we can attack this DSIM, we could potentially utilize those"
    },
    {
      "Time_Start": 301.18,
      "Time_End": 305.68,
      "Text": " communication channels through those firewalls and management VLANs and what not. And gain"
    },
    {
      "Time_Start": 305.68,
      "Time_End": 311.38,
      "Text": " access to the devices inside the data center. The software that we ended up looking at first"
    },
    {
      "Time_Start": 311.38,
      "Time_End": 318.38,
      "Text": " was this CyberPower PowerPanel Enterprise, which is quite a mouthful there. This is one of"
    },
    {
      "Time_Start": 318.38,
      "Time_End": 325.34,
      "Text": " the software that would be able to manage the infrastructure in the data center. One reason"
    },
    {
      "Time_Start": 325.34,
      "Time_End": 330.8,
      "Text": " that we thought it was a good target was for one it's free. Second it has both Windows and"
    },
    {
      "Time_Start": 330.8,
      "Time_End": 336.8,
      "Text": " Linux support. But also that enterprise really caught our attention. At a glance it's a"
    },
    {
      "Time_Start": 336.8,
      "Time_End": 342.84,
      "Text": " typical web application, meaning that it's all of the good stuff is hidden behind a login"
    },
    {
      "Time_Start": 342.88000000000005,
      "Time_End": 348.38000000000005,
      "Text": " page and there's no other unauthenticated end point that you can get to without first getting"
    },
    {
      "Time_Start": 348.38000000000005,
      "Time_End": 354.38000000000005,
      "Text": " past this. It runs HTTP by default, so there's that. But it also uses C sharp as like the"
    },
    {
      "Time_Start": 356.64000000000004,
      "Time_End": 363.18,
      "Text": " server that runs the application. And then a SQL database back end. And those will kind of"
    },
    {
      "Time_Start": 363.18,
      "Time_End": 368.26000000000005,
      "Text": " make more sense a little bit further as we go through this initial recon stage. What we"
    },
    {
      "Time_Start": 368.3,
      "Time_End": 375.56,
      "Text": " ended up doing right off the bat is actually looking how the software sets up its database"
    },
    {
      "Time_Start": 375.56,
      "Time_End": 380.48,
      "Text": " initially through the installer scripts. And one thing we noticed here, highlighted in red, is"
    },
    {
      "Time_Start": 380.48,
      "Time_End": 385.8,
      "Text": " these two users that are actually kind of in there by default, they don't change later. So"
    },
    {
      "Time_Start": 385.8,
      "Time_End": 391.26,
      "Text": " these are like default users, CyberPower and SI. And they have these encrypted passwords"
    },
    {
      "Time_Start": 391.26,
      "Time_End": 396.34,
      "Text": " right next to them and then the salts for that encryption here. At first I definitely thought"
    },
    {
      "Time_Start": 396.34000000000003,
      "Time_End": 402.72,
      "Text": " it was base 64, but it is actually indeed an AES encrypted password and not even a hash of"
    },
    {
      "Time_Start": 402.72,
      "Time_End": 407.38000000000005,
      "Text": " the password, meaning that the password can be fully extracted out if those AES passwords"
    },
    {
      "Time_Start": 407.38000000000005,
      "Time_End": 413.76000000000005,
      "Text": " are, or that AES password is found. So that's exactly what we ended up trying to do. And C"
    },
    {
      "Time_Start": 413.76000000000005,
      "Time_End": 418.3,
      "Text": " sharp, if you don't compile it with extra protections, is practically open source if you use"
    },
    {
      "Time_Start": 418.3,
      "Time_End": 424.56000000000006,
      "Text": " the right tools. So we used DN spy and actually got this amount of detail out of just the"
    },
    {
      "Time_Start": 424.72,
      "Time_End": 430.18,
      "Text": " disassembly here. And looking through that, we found this decrypt AES function that had the"
    },
    {
      "Time_Start": 430.18,
      "Time_End": 436.32,
      "Text": " AES password it seems like here, but it slightly obfuscated. I'm sure we could have"
    },
    {
      "Time_Start": 436.32,
      "Time_End": 441.9,
      "Text": " figured out how to do it, but DN spy has a handy feature of being a debugger as well. So just"
    },
    {
      "Time_Start": 441.9,
      "Time_End": 446.56,
      "Text": " setting a break point on something that calls that, you can get the AES password out in plain"
    },
    {
      "Time_Start": 446.56,
      "Time_End": 451.56,
      "Text": " text, which is Wii U tech for some reason. The next bit is because the decompiled"
    },
    {
      "Time_Start": 456.6,
      "Time_End": 461.7,
      "Text": " representation of the application is so good, you can actually just copy it out and then run"
    },
    {
      "Time_Start": 461.7,
      "Time_End": 468.06,
      "Text": " it in its own C sharp function. So that's what I did. I just copied that decrypt AES function"
    },
    {
      "Time_Start": 468.06,
      "Time_End": 472.9,
      "Text": " out into its own file, passed in those encrypted values plus the salt, and we're able to get"
    },
    {
      "Time_Start": 472.90000000000003,
      "Time_End": 479.08000000000004,
      "Text": " these default credentials in plain text. So this was our first CVE that we filed against"
    },
    {
      "Time_Start": 479.08000000000004,
      "Time_End": 486.20000000000005,
      "Text": " cyber power here. However, it wasn't all sunshines and rainbows for using that as a means"
    },
    {
      "Time_Start": 486.20000000000005,
      "Time_End": 492.08000000000004,
      "Text": " to bypass authentication. When we passed those in, we actually were greeted with a login"
    },
    {
      "Time_Start": 492.08000000000004,
      "Time_End": 498.08000000000004,
      "Text": " failed. And looking deeper into why that happened was they have checks for that default"
    },
    {
      "Time_Start": 498.08,
      "Time_End": 504.08,
      "Text": " user and eventually will hit this failed to log in result. But kind of looking at that, one of"
    },
    {
      "Time_Start": 508.12,
      "Time_End": 514.16,
      "Text": " our researchers was kind of interested in seeing how strong that check is and actually"
    },
    {
      "Time_Start": 514.16,
      "Time_End": 521.38,
      "Text": " supplying a non ASCII value like hex 01 here was able to actually for the C sharp server,"
    },
    {
      "Time_Start": 521.38,
      "Time_End": 526.5,
      "Text": " those are indeed different strings. So that code block didn't get hit. However, when the"
    },
    {
      "Time_Start": 526.5,
      "Time_End": 530.88,
      "Text": " user name eventually gets passed down to the SQL database, somewhere in the line that got"
    },
    {
      "Time_Start": 530.88,
      "Time_End": 537.42,
      "Text": " stripped out and we were actually able to log in through that login page using these default"
    },
    {
      "Time_Start": 537.42,
      "Time_End": 545.42,
      "Text": " credentials. And during that, we actually found an even cooler way. So we'll kind of dive into"
    },
    {
      "Time_Start": 545.42,
      "Time_End": 551.54,
      "Text": " the second authentication bypass here now. So as I mentioned, there is this user name and"
    },
    {
      "Time_Start": 551.54,
      "Time_End": 556.16,
      "Text": " password method of logging into this DSIM software. There's also an active directory"
    },
    {
      "Time_Start": 556.16,
      "Time_End": 562.3399999999999,
      "Text": " component as it makes sense. It's an enterprise managed application. But also there was this"
    },
    {
      "Time_Start": 562.3399999999999,
      "Time_End": 566.88,
      "Text": " LDAP function that kind of caught our eye. And of course, this is probably way too small to"
    },
    {
      "Time_Start": 566.88,
      "Time_End": 572.66,
      "Text": " see. So I'll blow it up here. The LDAP function, when you supply an LDAP user, uses this"
    },
    {
      "Time_Start": 572.66,
      "Time_End": 579.54,
      "Text": " validate user function block here. And you can see that it is checking if the function"
    },
    {
      "Time_Start": 579.54,
      "Time_End": 584.12,
      "Text": " returns the string exception. For a long time I was actually reading that as returning an"
    },
    {
      "Time_Start": 584.12,
      "Time_End": 590.5799999999999,
      "Text": " exception. No, it's the string exception from this validate user. And if it doesn't return an"
    },
    {
      "Time_Start": 590.5799999999999,
      "Time_End": 598.5799999999999,
      "Text": " exception, then the status equals true and then you're logged in. However, looking at the code,"
    },
    {
      "Time_Start": 598.5799999999999,
      "Time_End": 605.4599999999999,
      "Text": " LDAP must have meant like lazily disabled access protocol because it actually shows this"
    },
    {
      "Time_Start": 605.46,
      "Time_End": 612.5,
      "Text": " function here. All it does is returns a blank string. And of course, that does not actually"
    },
    {
      "Time_Start": 612.5,
      "Time_End": 619.38,
      "Text": " equal exception. So any person that tries to log in using this LDAP method just automatically"
    },
    {
      "Time_Start": 619.38,
      "Time_End": 625.96,
      "Text": " gets authenticated. Which is pretty cool. So I'll go ahead and show that in a live demo here."
    },
    {
      "Time_Start": 625.96,
      "Time_End": 633.6600000000001,
      "Text": " Using the lead hacker tool of Firefox only. So you can see this is the login page. What we'll"
    },
    {
      "Time_Start": 633.6999999999999,
      "Time_End": 640.36,
      "Text": " do next is just right click and open the hacker menu. And then you search for LDAP. You see"
    },
    {
      "Time_Start": 640.36,
      "Time_End": 645.62,
      "Text": " that it says display none. We can go ahead and change that to block. And now just type in"
    },
    {
      "Time_Start": 645.62,
      "Time_End": 650.9,
      "Text": " admin. No password necessary. Choose LDAP as the authentication method. And now you're"
    },
    {
      "Time_Start": 650.9,
      "Time_End": 656.9,
      "Text": " fully logged in as admin. So at this point, that's actually quite a big thing. Now you can"
    },
    {
      "Time_Start": 657.9,
      "Time_End": 663.9,
      "Text": " actually read those logs. Manage the data center infrastructure. That's one step that we"
    },
    {
      "Time_Start": 671.4399999999999,
      "Time_End": 675.64,
      "Text": " really thought was pretty impactful. However, I'm going to pass it over to Jesse to see how"
    },
    {
      "Time_Start": 675.64,
      "Time_End": 681.64,
      "Text": " we took it even further. There we go. How's that? All right. So even though we were able to"
    },
    {
      "Time_Start": 682.34,
      "Time_End": 688.34,
      "Text": " now carry out actions on the admin console with administrator privileges, that wasn't enough"
    },
    {
      "Time_Start": 690.88,
      "Time_End": 695.14,
      "Text": " for us. We wanted to be able to go beneath the surface and start executing commands on the"
    },
    {
      "Time_Start": 695.14,
      "Time_End": 701.14,
      "Text": " underlying Windows or Linux operating system. So why might we want to do that? Well, as Sam"
    },
    {
      "Time_Start": 702.52,
      "Time_End": 707.18,
      "Text": " mentioned, once we compromise a DSIM, we now have the ability to, at least in theory,"
    },
    {
      "Time_Start": 707.1800000000001,
      "Time_End": 713.48,
      "Text": " control things like power management and network switches and that kind of thing using the"
    },
    {
      "Time_Start": 713.48,
      "Time_End": 720.0600000000001,
      "Text": " DSIM as an admin would. But we don't yet have the ability to pivot to that data center"
    },
    {
      "Time_Start": 720.0600000000001,
      "Time_End": 726.0600000000001,
      "Text": " environment and start executing our own code on other devices potentially. So that's our next"
    },
    {
      "Time_Start": 728.72,
      "Time_End": 732.3800000000001,
      "Text": " step is to be able to launch those kinds of attacks and we need operating system privileges"
    },
    {
      "Time_Start": 732.38,
      "Time_End": 738.38,
      "Text": " for that. So let's see how we went about doing that. Well, we were able to get a near perfect"
    },
    {
      "Time_Start": 740.22,
      "Time_End": 745.12,
      "Text": " decompilation from DN spy. So we started searching through for dangerous function calls."
    },
    {
      "Time_Start": 745.12,
      "Time_End": 749.96,
      "Text": " Things like the equivalent of system in C or exec or something like that. In this case, it's"
    },
    {
      "Time_Start": 749.96,
      "Time_End": 755.96,
      "Text": " this execute command function that you'll see at the bottom of that region boxed in red. And"
    },
    {
      "Time_Start": 755.96,
      "Time_End": 760.68,
      "Text": " what's being passed to it is this command that begins with net use, which is how you add a"
    },
    {
      "Time_Start": 760.6800000000001,
      "Time_End": 767.3800000000001,
      "Text": " new networking device in the Windows environment. So it looks like this command is being"
    },
    {
      "Time_Start": 767.3800000000001,
      "Time_End": 771.5200000000001,
      "Text": " constructed using several variables that are clearly assigned elsewhere. So our first"
    },
    {
      "Time_Start": 771.5200000000001,
      "Time_End": 776.96,
      "Text": " thought is, could this be a good spot for a command injection? Are these values user"
    },
    {
      "Time_Start": 776.96,
      "Time_End": 782.9000000000001,
      "Text": " controlled? And it turns out that three of them are. So when we traced back through the X"
    },
    {
      "Time_Start": 782.9000000000001,
      "Time_End": 788.84,
      "Text": " refs, all the way back to the front end, we realized that this particular block of code is"
    },
    {
      "Time_Start": 788.86,
      "Time_End": 795.2,
      "Text": " invoked when somebody tries to add a remote network storage device for backup purposes or"
    },
    {
      "Time_Start": 795.2,
      "Time_End": 800.6800000000001,
      "Text": " something like that. And so in order to test this hypothesis, we tried to inject our own"
    },
    {
      "Time_Start": 800.6800000000001,
      "Time_End": 806.82,
      "Text": " PowerShell command via the username parameter. And sure enough, as you can see from this"
    },
    {
      "Time_Start": 806.82,
      "Time_End": 812.2800000000001,
      "Text": " process explorer output here, not only did PowerShell spawn, but is running with system"
    },
    {
      "Time_Start": 812.2800000000001,
      "Time_End": 818.0600000000001,
      "Text": " privileges. So this was the fourth CVE that we discovered on this device, which is just your"
    },
    {
      "Time_Start": 818.08,
      "Time_End": 823.3800000000001,
      "Text": " classic OS command injection. So now we'll demonstrate how we can chain the first"
    },
    {
      "Time_Start": 823.3800000000001,
      "Time_End": 828.0600000000001,
      "Text": " authentication bypass that Sam mentioned with this command injection to achieve"
    },
    {
      "Time_Start": 828.0600000000001,
      "Time_End": 834.5600000000001,
      "Text": " unauthenticated code execution. So in the top left there, you'll see that we have a Python"
    },
    {
      "Time_Start": 834.5600000000001,
      "Time_End": 840.2,
      "Text": " server that's going to be serving a text file that contains our reverse shell in PowerShell,"
    },
    {
      "Time_Start": 840.2,
      "Time_End": 845.7800000000001,
      "Text": " of course. And in the top right, we have a Netcat listener that's going to catch that, excuse"
    },
    {
      "Time_Start": 845.8,
      "Time_End": 850.8,
      "Text": " me, reverse shell. And we'll be executing our exploit from at the bottom. So first off,"
    },
    {
      "Time_Start": 856.3,
      "Time_End": 861.18,
      "Text": " there's the auth bypass. It's the first of the two that Sam mentioned with that XL1"
    },
    {
      "Time_Start": 861.18,
      "Time_End": 867.12,
      "Text": " meta-character. And it's just going to save off the session ID into a local file called"
    },
    {
      "Time_Start": 867.12,
      "Time_End": 872.12,
      "Text": " cookie.txt. So there you go. Now we have our cookie. You can see what it looks like. It's"
    },
    {
      "Time_Start": 876.22,
      "Time_End": 881.22,
      "Text": " long and disgusting. And now here is our exploit. So as I said before, we're injecting by the"
    },
    {
      "Time_Start": 887.36,
      "Time_End": 892.6,
      "Text": " username parameter. Others would have worked, but we chose to stick with that one. And all"
    },
    {
      "Time_Start": 892.6,
      "Time_End": 899.5799999999999,
      "Text": " we're doing here is instructing PowerShell to query our Python server, download hack.txt, and"
    },
    {
      "Time_Start": 899.58,
      "Time_End": 904.58,
      "Text": " then execute its contents as PowerShell. So clearly Sam's run it there. Perfect. And we can"
    },
    {
      "Time_Start": 907.7800000000001,
      "Time_End": 912.1800000000001,
      "Text": " see that hack.txt was successfully downloaded. The command worked. And now we have an"
    },
    {
      "Time_Start": 912.1800000000001,
      "Time_End": 917.36,
      "Text": " interactive session on the underlying Windows operating system and are executing commands"
    },
    {
      "Time_Start": 917.36,
      "Time_End": 922.36,
      "Text": " with the highest possible privileges. Which brings us to our second target, which is a power"
    },
    {
      "Time_Start": 922.36,
      "Time_End": 927.36,
      "Text": " distribution unit, or PDU for the remainder of this talk. You can think of this as just a"
    },
    {
      "Time_Start": 935.9,
      "Time_End": 940.9,
      "Text": " glorified power strip for plugging in your rack servers or network switches, that kind of"
    },
    {
      "Time_Start": 943.34,
      "Time_End": 948.34,
      "Text": " thing. And the fancier ones actually get an IP on that local network and have a nice web-based"
    },
    {
      "Time_Start": 948.9,
      "Time_End": 953.9,
      "Text": " management interface for remote administration. So why might we want to target a PDU? Well, if"
    },
    {
      "Time_Start": 959.1800000000001,
      "Time_End": 966.12,
      "Text": " we're able to access it directly and start executing attacks against it, as we now are able"
    },
    {
      "Time_Start": 966.12,
      "Time_End": 973.0600000000001,
      "Text": " to, having compromised the DSIM, we can do all sorts of things. We can, for example, cut"
    },
    {
      "Time_Start": 973.08,
      "Time_End": 978.8800000000001,
      "Text": " power to core business resources. Or, if we're able to fully pwn the device, we can establish"
    },
    {
      "Time_Start": 978.8800000000001,
      "Time_End": 985.5000000000001,
      "Text": " persistence within that data center network and attempt to compromise other core services"
    },
    {
      "Time_Start": 985.5000000000001,
      "Time_End": 991.1600000000001,
      "Text": " inside of that data center. So now I'll just introduce you to the particular product that we"
    },
    {
      "Time_Start": 991.1600000000001,
      "Time_End": 997.1400000000001,
      "Text": " hacked, which is the Dataprobe iBoot PDU. This is most likely to be found either on-prem or"
    },
    {
      "Time_Start": 997.16,
      "Time_End": 1003.0,
      "Text": " in, like, small to mid-sized data centers. Maybe used for some niche purposes in another"
    },
    {
      "Time_Start": 1003.0,
      "Time_End": 1008.3,
      "Text": " setup. We discovered that ATMs are often hooked up to them, for example, interestingly"
    },
    {
      "Time_Start": 1008.3,
      "Time_End": 1014.04,
      "Text": " enough. But one other thing that we found really intriguing about this product in particular"
    },
    {
      "Time_Start": 1014.04,
      "Time_End": 1020.88,
      "Text": " is that Dataprobe offers this free cloud service, which acts as a reverse proxy directly to"
    },
    {
      "Time_Start": 1020.88,
      "Time_End": 1026.26,
      "Text": " the hardware device, meaning that if a user decided to enroll their device in this service,"
    },
    {
      "Time_Start": 1026.28,
      "Time_End": 1030.78,
      "Text": " they would be able to access their management interface from anywhere in the world without"
    },
    {
      "Time_Start": 1030.78,
      "Time_End": 1036.78,
      "Text": " having to have VPN access or be within some secure intranet at a randomly generated"
    },
    {
      "Time_Start": 1036.78,
      "Time_End": 1041.8,
      "Text": " subdomain under the iBoot web page. Website, rather. Another thing that made this a"
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1050.2,
      "Text": " particularly attractive target to us is that all of the models, and there are about 20 of"
    },
    {
      "Time_Start": 1050.2,
      "Time_End": 1055.08,
      "Text": " them for the U.S. and international markets, use the exact same publicly available"
    },
    {
      "Time_Start": 1055.1,
      "Time_End": 1060.86,
      "Text": " firmware image. So right off the bat, we were able to download it, unpack it, and have a"
    },
    {
      "Time_Start": 1060.86,
      "Time_End": 1065.58,
      "Text": " look around. And although static analysis got us a long way, we really wanted to have the"
    },
    {
      "Time_Start": 1065.58,
      "Time_End": 1071.08,
      "Text": " ability to interact with the device at the process level and really see what's going on,"
    },
    {
      "Time_Start": 1071.08,
      "Time_End": 1076.1799999999998,
      "Text": " read from memory and stuff like that. So that led us to full system emulation. And this"
    },
    {
      "Time_Start": 1076.1799999999998,
      "Time_End": 1081.96,
      "Text": " wound up being a very powerful technique for us in the course of researching this product."
    },
    {
      "Time_Start": 1081.96,
      "Time_End": 1086.54,
      "Text": " And in fact, all of the vulnerabilities that we are going to be disclosing today were"
    },
    {
      "Time_Start": 1086.54,
      "Time_End": 1092.2,
      "Text": " discovered and verified hand wavily in this emulated environment. I should mention that"
    },
    {
      "Time_Start": 1092.2,
      "Time_End": 1097.7,
      "Text": " eventually we did actually buy an iBoot PDU to make sure that they worked on the bare"
    },
    {
      "Time_Start": 1097.7,
      "Time_End": 1104.38,
      "Text": " metal, but we already knew that that was almost a sure bet from the emulation. And so just"
    },
    {
      "Time_Start": 1104.38,
      "Time_End": 1109.38,
      "Text": " for posterity's sake, I'm going to do a quick run through of how we were able to get that"
    },
    {
      "Time_Start": 1109.38,
      "Time_End": 1114.42,
      "Text": " emulated device set up. So let's just run through it really quickly. So we decided to use"
    },
    {
      "Time_Start": 1114.42,
      "Time_End": 1120.2600000000002,
      "Text": " Kimu, and given that there's an ARM chip on the device, we installed the full system"
    },
    {
      "Time_Start": 1120.2600000000002,
      "Time_End": 1127.38,
      "Text": " emulator for ARM and grabbed a fresh 32-bit VM off of a Debian web page that was just"
    },
    {
      "Time_Start": 1127.38,
      "Time_End": 1132.5400000000002,
      "Text": " hosted, already set up and configured on somebody's personal file space. So that was easy"
    },
    {
      "Time_Start": 1132.5400000000002,
      "Time_End": 1138.5800000000002,
      "Text": " enough. And then we got it spun up using the following arguments. You'll notice this will"
    },
    {
      "Time_Start": 1138.58,
      "Time_End": 1144.86,
      "Text": " appear in subsequent slides that we mapped port 80, which is what they're serving the"
    },
    {
      "Time_Start": 1144.86,
      "Time_End": 1152.86,
      "Text": " website on, to port 8080. Now once we were inside the VM, we first of all pulled down a fresh"
    },
    {
      "Time_Start": 1154.58,
      "Time_End": 1159.62,
      "Text": " firmware image, which turns out just to be a tar file, and extracted it and then"
    },
    {
      "Time_Start": 1159.62,
      "Time_End": 1164.86,
      "Text": " decompressed the root file system. This was the only component that was necessary to be"
    },
    {
      "Time_Start": 1164.8600000000001,
      "Time_End": 1170.94,
      "Text": " able to spin up all of the core services on the device. We then went through the rigmarole of"
    },
    {
      "Time_Start": 1170.94,
      "Time_End": 1174.9,
      "Text": " setting up the appropriate mount points in order to get this to work properly. That took a"
    },
    {
      "Time_Start": 1174.9,
      "Time_End": 1181.14,
      "Text": " little while. And finally, to root it into that root file system using the onboard bash"
    },
    {
      "Time_Start": 1181.14,
      "Time_End": 1186.7400000000002,
      "Text": " instance. At that point, we tried to mimic the sequence of commands that are actually"
    },
    {
      "Time_Start": 1186.7400000000002,
      "Time_End": 1191.5600000000002,
      "Text": " executed as the device is first booting up. Obviously some of them didn't work. This is"
    },
    {
      "Time_Start": 1191.56,
      "Time_End": 1198.34,
      "Text": " emulation. It's not a perfect science. But we were able to eventually run that RCS script and"
    },
    {
      "Time_Start": 1198.34,
      "Time_End": 1202.44,
      "Text": " have all of the core services up and running. And I should also mention that there were a"
    },
    {
      "Time_Start": 1202.44,
      "Time_End": 1206.6399999999999,
      "Text": " ton of them. We wound up targeting the web page exclusively because that got us what we"
    },
    {
      "Time_Start": 1206.6399999999999,
      "Time_End": 1213.1799999999998,
      "Text": " needed. But there were nearly ten, I believe, distinct attack vectors that we also could"
    },
    {
      "Time_Start": 1213.1799999999998,
      "Time_End": 1217.56,
      "Text": " have looked at. But they all seemed to support the functionality available from the web"
    },
    {
      "Time_Start": 1217.6,
      "Time_End": 1222.8,
      "Text": " page anyway. So that's where we started. And just to prove it to you all that we got this to"
    },
    {
      "Time_Start": 1222.8,
      "Time_End": 1228.8,
      "Text": " work, here's the login page running on local host, which made us very happy. And so now we're"
    },
    {
      "Time_Start": 1231.3,
      "Time_End": 1236.78,
      "Text": " going to talk about how we were able to get past that login page. But before we can"
    },
    {
      "Time_Start": 1236.78,
      "Time_End": 1242.62,
      "Text": " understand the root cause of the following vulnerability, we need to go over briefly what the"
    },
    {
      "Time_Start": 1242.64,
      "Time_End": 1249.5200000000002,
      "Text": " normal authentication process on this device looks like. So under normal circumstances, the"
    },
    {
      "Time_Start": 1249.5200000000002,
      "Time_End": 1256.46,
      "Text": " client will send their username and a shoddily obfuscated password to the device. And"
    },
    {
      "Time_Start": 1256.46,
      "Time_End": 1262.94,
      "Text": " assuming that it matches what the device has saved in its database, the set cookie header"
    },
    {
      "Time_Start": 1262.94,
      "Time_End": 1270.94,
      "Text": " will be returned. Instructing the client to set a cookie called iBoot PDU site off, which is"
    },
    {
      "Time_Start": 1271.24,
      "Time_End": 1278.74,
      "Text": " just a URL encoded string that has two parameters. One is USR, which in this case actually is an"
    },
    {
      "Time_Start": 1278.74,
      "Time_End": 1284.74,
      "Text": " abbreviation for user. And an MD5 hash of the corresponding password. So for any subsequent"
    },
    {
      "Time_Start": 1287.0800000000002,
      "Time_End": 1294.26,
      "Text": " request made to one of those privileged web pages, the client will include this cookie and the"
    },
    {
      "Time_Start": 1294.26,
      "Time_End": 1299.3200000000002,
      "Text": " device will then verify that those credentials are valid and assuming that they are,"
    },
    {
      "Time_Start": 1299.34,
      "Time_End": 1304.1399999999999,
      "Text": " restricted content is returned. But we still need to zoom in a little bit further on what's"
    },
    {
      "Time_Start": 1304.1399999999999,
      "Time_End": 1310.98,
      "Text": " going on here between steps three and four. So under normal circumstances, the client will"
    },
    {
      "Time_Start": 1310.98,
      "Time_End": 1317.1599999999999,
      "Text": " issue their request, including the cookie, and the PDU will query its own on board"
    },
    {
      "Time_Start": 1317.1599999999999,
      "Time_End": 1324.3,
      "Text": " Postgres database, which contains all of the user credential information. So assuming that"
    },
    {
      "Time_Start": 1324.3799999999999,
      "Time_End": 1330.12,
      "Text": " the credentials it finds in the cookie match what it has on the database, privileged content is"
    },
    {
      "Time_Start": 1330.12,
      "Time_End": 1336.82,
      "Text": " returned no problem. However, in a malicious use case, and this is something of a spoiler, but I"
    },
    {
      "Time_Start": 1336.82,
      "Time_End": 1342.1,
      "Text": " think that the 30,000 foot view here of what's happening is useful before we dive into the"
    },
    {
      "Time_Start": 1342.1,
      "Time_End": 1348.1,
      "Text": " technical details. An attacker can supply a malicious cookie to the device and direct it to"
    },
    {
      "Time_Start": 1348.64,
      "Time_End": 1354.64,
      "Text": " query not its own trusted database, but an arbitrary database at any IPv4 address of the"
    },
    {
      "Time_Start": 1359.18,
      "Time_End": 1363.3200000000002,
      "Text": " attacker's choice. And assuming that that attacker has set up their rogue database"
    },
    {
      "Time_Start": 1363.3200000000002,
      "Time_End": 1369.3200000000002,
      "Text": " correctly, then the passwords will match and that privileged content is returned. So before we"
    },
    {
      "Time_Start": 1371.42,
      "Time_End": 1375.8600000000001,
      "Text": " get to looking at the root cause of the vulnerability, we have to do a quick review of the"
    },
    {
      "Time_Start": 1375.8600000000001,
      "Time_End": 1382.0200000000002,
      "Text": " PHP function parser. I don't know about you, but I had never heard of it before. I'm not a"
    },
    {
      "Time_Start": 1382.0200000000002,
      "Time_End": 1387.8000000000002,
      "Text": " PHP programmer, so I'm sure that this won't be review for everybody. So here's the function"
    },
    {
      "Time_Start": 1387.8000000000002,
      "Time_End": 1395.2,
      "Text": " signature. It takes two parameters. The first is called string. This is a URL parameter"
    },
    {
      "Time_Start": 1395.2,
      "Time_End": 1400.0400000000002,
      "Text": " string, basically. Just key value pairs separated by ampersands. And then there's a second"
    },
    {
      "Time_Start": 1400.06,
      "Time_End": 1406.74,
      "Text": " argument called result, which is just an associative array to store those key value pairs. However,"
    },
    {
      "Time_Start": 1406.74,
      "Time_End": 1412.54,
      "Text": " in older versions of PHP, including the one that is used in the iBootPU product line to this"
    },
    {
      "Time_Start": 1412.54,
      "Time_End": 1418.54,
      "Text": " day, you don't have to give that result parameter. And if you don't, then all of those key"
    },
    {
      "Time_Start": 1420.54,
      "Time_End": 1427.56,
      "Text": " value pairs are instantiated as local variables in the current scope. So I'm sure I don't have"
    },
    {
      "Time_Start": 1427.58,
      "Time_End": 1433.96,
      "Text": " to tell an audience like this that that's rather dangerous. And as such, there is a huge"
    },
    {
      "Time_Start": 1433.96,
      "Time_End": 1439.96,
      "Text": " warning that appears on the PHP man page for this function that says, don't do this. Always put"
    },
    {
      "Time_Start": 1441.86,
      "Time_End": 1448.84,
      "Text": " that result parameter in there. And in fact, we're going to mandate that pretty soon. So problem"
    },
    {
      "Time_Start": 1448.84,
      "Time_End": 1454.84,
      "Text": " solved, right? No. So this is that automatic log in mechanism that I talked about before. So"
    },
    {
      "Time_Start": 1457.62,
      "Time_End": 1465.62,
      "Text": " this is the entire file. So let's just go through it line by line. After doing a couple of"
    },
    {
      "Time_Start": 1465.62,
      "Time_End": 1472.86,
      "Text": " checks to make sure that the cookie is actually there, it then drops it straight into parser"
    },
    {
      "Time_Start": 1472.86,
      "Time_End": 1477.96,
      "Text": " without that result parameter. Which means that all of these variables that I boxed here in"
    },
    {
      "Time_Start": 1477.96,
      "Time_End": 1484.98,
      "Text": " yellow can be user controlled. If they are included in that malicious cookie. Including the IP"
    },
    {
      "Time_Start": 1485.0,
      "Time_End": 1491.04,
      "Text": " address of the database to which the device establishes a session. Just for the record, get"
    },
    {
      "Time_Start": 1491.04,
      "Time_End": 1497.18,
      "Text": " new link is simply a wrapper for PG connect, which is a library function for establishing a"
    },
    {
      "Time_Start": 1497.18,
      "Time_End": 1503.18,
      "Text": " connection between a PHP server and a Postgres database. Next, we construct a SQL query, or the"
    },
    {
      "Time_Start": 1506.72,
      "Time_End": 1512.76,
      "Text": " developers did rather, to grab the user name or rather the password and the role associated"
    },
    {
      "Time_Start": 1512.78,
      "Time_End": 1518.78,
      "Text": " with the provided user. And once that's run against the database of our choice, the resulting"
    },
    {
      "Time_Start": 1521.68,
      "Time_End": 1527.72,
      "Text": " password is then MD5 hashed, which struck us as odd when we went to school. We were told that"
    },
    {
      "Time_Start": 1527.72,
      "Time_End": 1532.66,
      "Text": " you are never supposed to store unhashed passwords under any circumstances, but to each"
    },
    {
      "Time_Start": 1532.66,
      "Time_End": 1538.66,
      "Text": " their own. And is compared against the hash that's provided in the cookie. And assuming that"
    },
    {
      "Time_Start": 1539.4,
      "Time_End": 1545.1000000000001,
      "Text": " those match, which they should if the attacker has set this up correctly, then the user is"
    },
    {
      "Time_Start": 1545.1000000000001,
      "Time_End": 1551.28,
      "Text": " logged in with whatever privileges they gave themselves. Why not admin? So now let's pick"
    },
    {
      "Time_Start": 1551.28,
      "Time_End": 1556.18,
      "Text": " apart the payload just a little bit. For those interested, I've included the URL encoded"
    },
    {
      "Time_Start": 1556.18,
      "Time_End": 1562.18,
      "Text": " version up there at the top and also a breakdown of all of these different keys and values that"
    },
    {
      "Time_Start": 1562.3200000000002,
      "Time_End": 1568.3200000000002,
      "Text": " are required to do this properly. So the IP of the database and the credentials for that"
    },
    {
      "Time_Start": 1570.46,
      "Time_End": 1575.8,
      "Text": " database, those are arbitrary. I mean, they must match the attacker's setup, but those can"
    },
    {
      "Time_Start": 1575.8,
      "Time_End": 1581.8,
      "Text": " vary. And then the USR value has to be this hard coded user that was already included on the"
    },
    {
      "Time_Start": 1583.6000000000001,
      "Time_End": 1589.6000000000001,
      "Text": " device. And the hash just simply has to match the password for that user. So this was our first"
    },
    {
      "Time_Start": 1590.6000000000001,
      "Time_End": 1597.8400000000001,
      "Text": " CVE, which is deserialization of untrusted data leading to authentication bypass. So now we're"
    },
    {
      "Time_Start": 1597.8400000000001,
      "Time_End": 1603.14,
      "Text": " going to demonstrate how we can use this to dump the entire contents of the database that"
    },
    {
      "Time_Start": 1603.14,
      "Time_End": 1609.2800000000002,
      "Text": " exists on the device, including plain text passwords, emails that are used for alerts and"
    },
    {
      "Time_Start": 1609.2800000000002,
      "Time_End": 1615.66,
      "Text": " that kind of thing. So normally if an administrator wanted to do this, they would go to the"
    },
    {
      "Time_Start": 1615.68,
      "Time_End": 1622.26,
      "Text": " import export page on the management interface. They would select export as their action and"
    },
    {
      "Time_Start": 1622.26,
      "Time_End": 1628.26,
      "Text": " then hit run. When they do this, under the hood, this export.sh script is executed, which goes"
    },
    {
      "Time_Start": 1630.5400000000002,
      "Time_End": 1637.44,
      "Text": " through and does a select star on all of the tables in the device's onboard database and"
    },
    {
      "Time_Start": 1637.44,
      "Time_End": 1644.0800000000002,
      "Text": " stores them in CSV files with names corresponding to the table name. Once it's done this, it"
    },
    {
      "Time_Start": 1644.1399999999999,
      "Time_End": 1650.1399999999999,
      "Text": " then tars them all up and gives that tar file the file extension PDU.un, which in context we"
    },
    {
      "Time_Start": 1652.6799999999998,
      "Time_End": 1658.6799999999998,
      "Text": " figured out means PDU data unencrypted. Because very shortly thereafter, this secure PDU.binary"
    },
    {
      "Time_Start": 1660.56,
      "Time_End": 1666.56,
      "Text": " is run to encrypt that tar file. However, you'll notice that the unencrypted version is never"
    },
    {
      "Time_Start": 1667.02,
      "Time_End": 1673.02,
      "Text": " deleted. So when the client goes to download their encrypted database dump, all they have to do"
    },
    {
      "Time_Start": 1679.8999999999999,
      "Time_End": 1686.7,
      "Text": " is add UN to the file name that they want and they're able to get the unencrypted tar file"
    },
    {
      "Time_Start": 1686.7,
      "Time_End": 1691.1799999999998,
      "Text": " back. As a matter of fact, this mechanism could be used to download any file in the temp"
    },
    {
      "Time_Start": 1691.2,
      "Time_End": 1697.2,
      "Text": " directory, but that's another story. Now let's see this exploit in action. We're executing"
    },
    {
      "Time_Start": 1702.18,
      "Time_End": 1708.1200000000001,
      "Text": " this via the cloud interface, so we don't have to be adjacent on the network at this point. Now"
    },
    {
      "Time_Start": 1708.1200000000001,
      "Time_End": 1714.5600000000002,
      "Text": " we're going to generate that database dump and download it. As you can see, this is just a"
    },
    {
      "Time_Start": 1714.58,
      "Time_End": 1721.26,
      "Text": " normal unencrypted tar file containing a bunch of CSV files. Now we can dump them and we get"
    },
    {
      "Time_Start": 1721.26,
      "Time_End": 1728.26,
      "Text": " plain text user names, passwords, emails, the whole nine yards. Including the credentials for"
    },
    {
      "Time_Start": 1728.26,
      "Time_End": 1734.24,
      "Text": " emails that are used for automatic notifications and that kind of thing. So basically"
    },
    {
      "Time_Start": 1734.24,
      "Time_End": 1739.28,
      "Text": " everything that the device has on it saved, we now have access to. So now I'm going to turn"
    },
    {
      "Time_Start": 1739.3,
      "Time_End": 1745.5,
      "Text": " this back over to Sam to tell us all about how we were able to pwn this thing."
    },
    {
      "Time_Start": 1745.5,
      "Time_End": 1750.98,
      "Text": " Alright, thanks Jesse. So for one, we wanted to take it a little bit further as we always do as"
    },
    {
      "Time_Start": 1750.98,
      "Time_End": 1758.32,
      "Text": " hackers. So I'm going to start with a process that has worked for me very much in the past. So"
    },
    {
      "Time_Start": 1758.32,
      "Time_End": 1762.8999999999999,
      "Text": " this is kind of my idea of how I triage a lot of these embedded systems for command injection"
    },
    {
      "Time_Start": 1762.8999999999999,
      "Time_End": 1767.66,
      "Text": " opportunities here. The first thing I like to do is actually look for custom binaries that the"
    },
    {
      "Time_Start": 1767.72,
      "Time_End": 1773.96,
      "Text": " vendor is writing themselves. And for the data probe, they were stored in the user bin"
    },
    {
      "Time_Start": 1773.96,
      "Time_End": 1778.96,
      "Text": " folder. And a lot of them had a D at the end, probably for Damon. So that is why I'm"
    },
    {
      "Time_Start": 1778.96,
      "Time_End": 1784.66,
      "Text": " searching through the star dot D and then running strings on each of those files. Then I'm"
    },
    {
      "Time_Start": 1784.66,
      "Time_End": 1790.8000000000002,
      "Text": " searching using just grep for shell scripts. So you can see there's quite a few here. And"
    },
    {
      "Time_Start": 1790.8,
      "Time_End": 1796.8,
      "Text": " then the next step I like to do is look for potentially injectable format strings here. So a"
    },
    {
      "Time_Start": 1799.56,
      "Time_End": 1806.28,
      "Text": " lot, everything in red is fully command injectable. We have to verify that later. But"
    },
    {
      "Time_Start": 1806.28,
      "Time_End": 1811.98,
      "Text": " just from this initial triage, all of these look really promising. The yellow is injectable"
    },
    {
      "Time_Start": 1811.98,
      "Time_End": 1817.56,
      "Text": " as well, but it's a numerical value which kind of goes only so far. And then there is that"
    },
    {
      "Time_Start": 1817.58,
      "Time_End": 1824.26,
      "Text": " single green one there that is not susceptible to command injection. A single quote in a"
    },
    {
      "Time_Start": 1824.26,
      "Time_End": 1831.3999999999999,
      "Text": " shell program does not expand any variables or subprocesses. So this was a good sign for us."
    },
    {
      "Time_Start": 1831.3999999999999,
      "Time_End": 1836.48,
      "Text": " And then the next step that I like to do when I'm trying to triage these command injection"
    },
    {
      "Time_Start": 1836.48,
      "Time_End": 1844.48,
      "Text": " opportunities is now open up those binaries and a decompiler like IDA and look for calls to"
    },
    {
      "Time_Start": 1845.0,
      "Time_End": 1851.74,
      "Text": " see how those format strings are being generated and then how they are being run. Sometimes"
    },
    {
      "Time_Start": 1851.74,
      "Time_End": 1856.98,
      "Text": " people or developers will add sanitization and things like that. This is where you check for"
    },
    {
      "Time_Start": 1856.98,
      "Time_End": 1862.98,
      "Text": " that. So you can see here that there is none, this whole update Linux SNMP V3 user function"
    },
    {
      "Time_Start": 1865.9,
      "Time_End": 1872.9,
      "Text": " doesn't really have much sanitization. And then you kind of have to imagine what values an"
    },
    {
      "Time_Start": 1872.9,
      "Time_End": 1878.0800000000002,
      "Text": " attacker can control here. So if you can imagine updating your user, you can probably"
    },
    {
      "Time_Start": 1878.0800000000002,
      "Time_End": 1883.8400000000001,
      "Text": " control the user name and probably the password too. So the next step is to relate that back"
    },
    {
      "Time_Start": 1883.8400000000001,
      "Time_End": 1890.6000000000001,
      "Text": " to really validate that you actually do control those as malicious data. So looking at the"
    },
    {
      "Time_Start": 1890.6000000000001,
      "Time_End": 1897.4,
      "Text": " add new user, you can see the user name there as well as the SNMP V3 password. The last step"
    },
    {
      "Time_Start": 1897.4,
      "Time_End": 1901.6000000000001,
      "Text": " if you're doing a blind command injection is to always try to keep it as simple as"
    },
    {
      "Time_Start": 1901.6000000000001,
      "Time_End": 1907.44,
      "Text": " possible. Luckily enough, Jesse set up the emulator so I was able to run PS down there on"
    },
    {
      "Time_Start": 1907.44,
      "Time_End": 1912.64,
      "Text": " the bottom. But sleep is always a really good step to actually figure out if your command"
    },
    {
      "Time_Start": 1912.64,
      "Time_End": 1917.68,
      "Text": " injection is running properly. If the web page hangs for however long you told it to sleep"
    },
    {
      "Time_Start": 1917.68,
      "Time_End": 1922.98,
      "Text": " for, that's probably because it's executing in the background. So this was the second CVE"
    },
    {
      "Time_Start": 1923.02,
      "Time_End": 1930.6,
      "Text": " that we found on the PDU. And it also had its caveats. So the user name that we were able to"
    },
    {
      "Time_Start": 1930.6,
      "Time_End": 1937.06,
      "Text": " inject into there was limited to 20 characters. And during that initial triaging stage, we"
    },
    {
      "Time_Start": 1937.06,
      "Time_End": 1941.56,
      "Text": " realized that it's probably a database schema or something because every time we pass in 21"
    },
    {
      "Time_Start": 1941.56,
      "Time_End": 1948.84,
      "Text": " or more characters, it would return this unknown database error. So this is where the initial"
    },
    {
      "Time_Start": 1948.8400000000001,
      "Time_End": 1956.0000000000002,
      "Text": " triaging and trying to dive into all of the device's components is really useful. We"
    },
    {
      "Time_Start": 1956.0000000000002,
      "Time_End": 1961.5800000000002,
      "Text": " remembered we saw there's a pretty interesting end point really on in the stage at this"
    },
    {
      "Time_Start": 1961.5800000000002,
      "Time_End": 1966.0000000000002,
      "Text": " firmware upload end point. And the reason it stood out to us that we actually remembered to"
    },
    {
      "Time_Start": 1966.0000000000002,
      "Time_End": 1971.46,
      "Text": " use it potentially for this was that it was unauthenticated. So this is the entire PHP file"
    },
    {
      "Time_Start": 1971.46,
      "Time_End": 1977.38,
      "Text": " or file here. And the thing that really caught our eye was up here on the top, it's taking"
    },
    {
      "Time_Start": 1977.38,
      "Time_End": 1984.0,
      "Text": " post parameters as input and then directly writing them to this file in temp. So and it will"
    },
    {
      "Time_Start": 1984.0,
      "Time_End": 1989.5800000000002,
      "Text": " do this until it reaches an EOF, which is kind of a perfect script drop option with an"
    },
    {
      "Time_Start": 1989.5800000000002,
      "Time_End": 1994.5400000000002,
      "Text": " unlimited character count really. So at this point, all we had to do is send whatever code we"
    },
    {
      "Time_Start": 1994.5400000000002,
      "Time_End": 2001.0,
      "Text": " wanted to execute to this end point and then change our user name to this kind of gross"
    },
    {
      "Time_Start": 2001.0,
      "Time_End": 2005.5800000000002,
      "Text": " looking function here. But what it's really doing is just catting out everything in that file"
    },
    {
      "Time_Start": 2005.5800000000002,
      "Time_End": 2012.7400000000002,
      "Text": " contents and then running them as shell commands. So this was under 20 characters and was"
    },
    {
      "Time_Start": 2012.7400000000002,
      "Time_End": 2018.66,
      "Text": " able to run all of those commands that we wanted to pass into that file in temp. So I'll go"
    },
    {
      "Time_Start": 2018.66,
      "Time_End": 2023.5800000000002,
      "Text": " ahead and show this in action. It's kind of cool. The right side of the screen will be a"
    },
    {
      "Time_Start": 2023.5800000000002,
      "Time_End": 2028.5800000000002,
      "Text": " Netcat listener and then the left is where we're going to be executing the commands from. So"
    },
    {
      "Time_Start": 2028.5800000000002,
      "Time_End": 2033.3600000000001,
      "Text": " we'll go ahead and start off that Netcat listener. On the left here, we actually are using"
    },
    {
      "Time_Start": 2033.3600000000001,
      "Time_End": 2038.14,
      "Text": " that like cloud connection because it was actually running at Jesse's house for this. But we're"
    },
    {
      "Time_Start": 2038.14,
      "Time_End": 2043.44,
      "Text": " using the legit credentials that we just showed previously that we could dump and adding that"
    },
    {
      "Time_Start": 2043.44,
      "Time_End": 2048.44,
      "Text": " malicious user and now you can see our Netcat is already connected. We can run things as"
    },
    {
      "Time_Start": 2048.44,
      "Time_End": 2054.44,
      "Text": " root and really have full access to the Linux operating system on that PDU. All right. So now"
    },
    {
      "Time_Start": 2055.44,
      "Time_End": 2061.44,
      "Text": " what? We've hacked both of these devices. Let's zoom back out and re-envision our scenario"
    },
    {
      "Time_Start": 2067.64,
      "Time_End": 2075.02,
      "Text": " here. So there are potentially two devices in the cloud now. So there's the cyber power, which"
    },
    {
      "Time_Start": 2075.02,
      "Time_End": 2081.9,
      "Text": " is our initial idea of using it as a pivot point. However, there is that data probe cloud"
    },
    {
      "Time_Start": 2081.9,
      "Time_End": 2088.94,
      "Text": " connection thing, but we'll kind of just ignore that for now. The attacker can now get access"
    },
    {
      "Time_Start": 2088.94,
      "Time_End": 2094.7200000000003,
      "Text": " to either of those, but we'll just kind of focus on the cyber power for here. And now can"
    },
    {
      "Time_Start": 2094.7200000000003,
      "Time_End": 2100.14,
      "Text": " actually even get access to the operating system underneath that software. They can kind of"
    },
    {
      "Time_Start": 2100.14,
      "Time_End": 2105.82,
      "Text": " hang out on that network, wait for a good time to use the connections set up in place to"
    },
    {
      "Time_Start": 2105.82,
      "Time_End": 2111.56,
      "Text": " actually gain access to some of the devices in the data center or cage space. And now, of"
    },
    {
      "Time_Start": 2111.56,
      "Time_End": 2116.7599999999998,
      "Text": " course, we can use the admin panel because we actually can bypass that authentication of"
    },
    {
      "Time_Start": 2116.7599999999998,
      "Time_End": 2122.6,
      "Text": " the PDU to already just turn off power, do a DDoS or whatever. But as Jesse mentioned"
    },
    {
      "Time_Start": 2122.6,
      "Time_End": 2127.64,
      "Text": " earlier, this is a perfect spot to be as an attacker to pivot to other devices inside the"
    },
    {
      "Time_Start": 2127.64,
      "Time_End": 2134.44,
      "Text": " data center. Now we have a practically a Linux machine that we control inside of this"
    },
    {
      "Time_Start": 2134.44,
      "Time_End": 2139.44,
      "Text": " restricted environment that clearly would never run any virus or any sort of detections"
    },
    {
      "Time_Start": 2139.44,
      "Time_End": 2144.44,
      "Text": " really. And, of course, after that, we cause havoc. So, you know, you can switch over, you"
    },
    {
      "Time_Start": 2147.56,
      "Time_End": 2152.44,
      "Text": " can turn on and off power quite rapidly. That is known to cause hardware issues. You know,"
    },
    {
      "Time_Start": 2152.44,
      "Time_End": 2156.98,
      "Text": " so you really, you can kind of take this as far as you want. I'll pass it back on over to"
    },
    {
      "Time_Start": 2156.98,
      "Time_End": 2161.98,
      "Text": " Jesse to do some final takeaways, but, yeah."
    },
    {
      "Time_Start": 2162.98,
      "Time_End": 2167.98,
      "Text": " So what are our takeaways here? What have we learned? Well, the first thing that stood"
    },
    {
      "Time_Start": 2171.14,
      "Time_End": 2176.82,
      "Text": " out to us as we washed our hands of both of these products was that hard-coded credentials"
    },
    {
      "Time_Start": 2176.82,
      "Time_End": 2181.56,
      "Text": " are still everywhere. And this kind of makes sense from a developer's perspective. Like if"
    },
    {
      "Time_Start": 2181.56,
      "Time_End": 2186.6,
      "Text": " you're working with a Postgres database, for example, which kind of require that admin"
    },
    {
      "Time_Start": 2186.6,
      "Time_End": 2191.06,
      "Text": " username and password in the initial setup phase, it can be quite expeditious,"
    },
    {
      "Time_Start": 2191.06,
      "Time_End": 2195.98,
      "Text": " particularly if you're under a deadline, to just hard-code those credentials. But even if"
    },
    {
      "Time_Start": 2195.98,
      "Time_End": 2200.64,
      "Text": " they don't constitute vulnerabilities in and of themselves, because you've written some"
    },
    {
      "Time_Start": 2200.64,
      "Time_End": 2206.86,
      "Text": " logic around them or something like that, they can be still leveraged in addition to other"
    },
    {
      "Time_Start": 2206.86,
      "Time_End": 2213.2999999999997,
      "Text": " vulnerabilities to enhance the impact of an attacker's exploit. So they're still"
    },
    {
      "Time_Start": 2213.2999999999997,
      "Time_End": 2218.2599999999998,
      "Text": " dangerous. And from an attacker's perspective, from the offensive point of view, it's"
    },
    {
      "Time_Start": 2218.26,
      "Time_End": 2223.5400000000004,
      "Text": " always a good idea to check those database initialization scripts or to go through the"
    },
    {
      "Time_Start": 2223.5400000000004,
      "Time_End": 2228.38,
      "Text": " binaries for interesting-looking strings that might be some kind of special hard-coded"
    },
    {
      "Time_Start": 2228.38,
      "Time_End": 2233.38,
      "Text": " user and see if you can leverage those to enhance your exploit. Our second takeaway is that"
    },
    {
      "Time_Start": 2236.5400000000004,
      "Time_End": 2241.5400000000004,
      "Text": " much to our delight, we were able to find and achieve code execution through the results of"
    },
    {
      "Time_Start": 2242.54,
      "Time_End": 2247.54,
      "Text": " our first pass, looking for low-hanging fruit when we went after both of these different"
    },
    {
      "Time_Start": 2251.5,
      "Time_End": 2258.16,
      "Text": " products. As you can see, there was no unprecedented or particularly difficult exploitation"
    },
    {
      "Time_Start": 2258.16,
      "Time_End": 2264.58,
      "Text": " techniques in play here. It was just command injections. So it's always worth it, no matter"
    },
    {
      "Time_Start": 2264.58,
      "Time_End": 2269.58,
      "Text": " what, to go through those products and look for strings that might represent some kind of"
    },
    {
      "Time_Start": 2273.42,
      "Time_End": 2280.42,
      "Text": " operating system-level command, particularly if they have format strings, those percent S's,"
    },
    {
      "Time_Start": 2280.42,
      "Time_End": 2285.96,
      "Text": " and to look for those process-spawning function calls, like your systems, your execs, or"
    },
    {
      "Time_Start": 2285.96,
      "Time_End": 2290.96,
      "Text": " execute command if you're in a Windows-y environment. The other thing that kind of surprised"
    },
    {
      "Time_Start": 2294.66,
      "Time_End": 2299.62,
      "Text": " us, and it was a very pleasant surprise, all things considered, is that research doesn't have"
    },
    {
      "Time_Start": 2299.62,
      "Time_End": 2307.08,
      "Text": " to be expensive. We were able to download and set up the power panel enterprise, our DSIM,"
    },
    {
      "Time_Start": 2307.08,
      "Time_End": 2311.58,
      "Text": " without having to ever enter any kind of license key or pay for anything other than the VM in"
    },
    {
      "Time_Start": 2311.58,
      "Time_End": 2318.58,
      "Text": " which we hosted it. And similarly, with the PDU, we were able to conduct end-to-end vuln"
    },
    {
      "Time_Start": 2318.58,
      "Time_End": 2324.24,
      "Text": " research just by downloading the publicly available firmware and then emulating it. So in"
    },
    {
      "Time_Start": 2324.2400000000002,
      "Time_End": 2329.78,
      "Text": " that case, emulation turned out to really be our friend and is a nice thing to try,"
    },
    {
      "Time_Start": 2329.78,
      "Time_End": 2336.48,
      "Text": " especially if you're hacking on a budget. Moreover, there's this tremendous discrepancy that"
    },
    {
      "Time_Start": 2336.48,
      "Time_End": 2343.48,
      "Text": " we observed across these products and others between the criticality of these"
    },
    {
      "Time_Start": 2343.48,
      "Time_End": 2349.32,
      "Text": " applications to business operations, let's say, and the quality of the software that backs"
    },
    {
      "Time_Start": 2349.36,
      "Time_End": 2354.28,
      "Text": " them. So you might think that given that these are the kinds of devices that are going to end"
    },
    {
      "Time_Start": 2354.28,
      "Time_End": 2360.44,
      "Text": " up in data centers and trusted with the security of our information, that they might be a"
    },
    {
      "Time_Start": 2360.44,
      "Time_End": 2365.02,
      "Text": " little bit more locked down and the developers might have adhered to slightly better secure"
    },
    {
      "Time_Start": 2365.02,
      "Time_End": 2371.6800000000003,
      "Text": " design principles. But we find time and time again that this is simply not the case. So I"
    },
    {
      "Time_Start": 2371.6800000000003,
      "Time_End": 2377.32,
      "Text": " guess our final takeaway is something of a call to action to all of the talent here in the"
    },
    {
      "Time_Start": 2377.32,
      "Time_End": 2384.06,
      "Text": " room, which is to help us keep this industry accountable. So go for it. We won't take the"
    },
    {
      "Time_Start": 2384.06,
      "Time_End": 2391.56,
      "Text": " vulns from you. All right. So let's just close off by giving a huge thanks to a friend and a"
    },
    {
      "Time_Start": 2391.56,
      "Time_End": 2397.78,
      "Text": " colleague who's sitting right here, Philippe Lallere. He was in this research with us from the"
    },
    {
      "Time_Start": 2397.78,
      "Time_End": 2403.28,
      "Text": " start and made some huge contributions early on. And in fact, he's credited with, I don't know"
    },
    {
      "Time_Start": 2403.28,
      "Time_End": 2409.6000000000004,
      "Text": " about most, but probably, yeah, most. Let's go with most of the CVEs that we talked about in"
    },
    {
      "Time_Start": 2409.6000000000004,
      "Time_End": 2416.1000000000004,
      "Text": " this talk. And he's just overall a great guy. So come find him, say hi, buy him a beer. We love"
    },
    {
      "Time_Start": 2416.1000000000004,
      "Time_End": 2422.4,
      "Text": " you, Philippe. And we'll just finish off by also giving a shout out to Clarity's Team 82, who"
    },
    {
      "Time_Start": 2422.4,
      "Time_End": 2427.44,
      "Text": " first turned us on to the iBoot PDU as a potentially valuable target. They wrote an"
    },
    {
      "Time_Start": 2427.44,
      "Time_End": 2433.1,
      "Text": " interesting blog that tipped us off called Jumping Nat to Shut Down Electric Devices."
    },
    {
      "Time_Start": 2433.1,
      "Time_End": 2439.76,
      "Text": " Obviously they missed a spot. But nevertheless, a lot of great work. So well done, Team 82."
    },
    {
      "Time_Start": 2439.76,
      "Time_End": 2444.64,
      "Text": " We should also mention that we reported all of these vulnerabilities in adherence with"
    },
    {
      "Time_Start": 2444.64,
      "Time_End": 2451.1,
      "Text": " Trellix's responsible disclosure policy. We gave both vendors 90 days. And we worked with them"
    },
    {
      "Time_Start": 2451.1,
      "Time_End": 2455.64,
      "Text": " to make sure that patches were available before we went and gave the details of these"
    },
    {
      "Time_Start": 2455.64,
      "Time_End": 2461.8799999999997,
      "Text": " exploits to a bunch of hackers. So you can check out our blog for some more information"
    },
    {
      "Time_Start": 2461.8799999999997,
      "Time_End": 2465.8799999999997,
      "Text": " about the vulnerabilities, including the two that we had to gloss over just due to time"
    },
    {
      "Time_Start": 2465.8799999999997,
      "Time_End": 2471.8399999999997,
      "Text": " constraints. That's going to be dropping in the next couple of days if it hasn't already. And"
    },
    {
      "Time_Start": 2471.8399999999997,
      "Time_End": 2478.22,
      "Text": " I'll just close here by saying that this research is just part of a smaller or rather larger"
    },
    {
      "Time_Start": 2478.2200000000003,
      "Time_End": 2485.7200000000003,
      "Text": " effort on behalf of the vulnerability research team at Trellix to investigate the security of"
    },
    {
      "Time_Start": 2485.7200000000003,
      "Time_End": 2490.84,
      "Text": " data center products of all kinds. And we have a couple more disclosures that are still in"
    },
    {
      "Time_Start": 2490.84,
      "Time_End": 2496.42,
      "Text": " that 90 day period that we'll be hoping to drop before the end of the year. So stay tuned for"
    },
    {
      "Time_Start": 2496.42,
      "Time_End": 2503.88,
      "Text": " that. And well, comrades and friends, thank you very much for coming. We'll be hanging around"
    },
    {
      "Time_Start": 2503.88,
      "Time_End": 2505.38,
      "Text": " afterward if you want to come say hi."
    },
    {
      "Time_Start": 2508.2200000000003,
      "Time_End": 2510.88,
      "Text": " All right. Thanks, guys."
    }
  ]
}