{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hi everyone. This is turning my phone into a scheming device and post solutions. We'd like to"
    },
    {
      "Time_Start": 8.64,
      "Time_End": 14.48,
      "Text": " introduce ourselves briefly. I'm Ileana Barrionuevo. I'm a security engineer and security"
    },
    {
      "Time_Start": 14.48,
      "Time_End": 19.52,
      "Text": " researcher at UTN. I am from Cordoba, Argentina. And this is Dan Borgogno."
    },
    {
      "Time_Start": 19.52,
      "Time_End": 24.52,
      "Text": " Hi, uh, I'm a security engineer, uh, uh, security, security researcher. There are two tags if"
    },
    {
      "Time_Start": 25.32,
      "Time_End": 30.32,
      "Text": " you want to, to follow us. Uh, I work at Latus Seguros. We are trying to protect data and people"
    },
    {
      "Time_Start": 33.2,
      "Time_End": 38.16,
      "Text": " through a new type of risk, uh, risk management. Democratizing cyber insurance, saving"
    },
    {
      "Time_Start": 38.16,
      "Time_End": 43.16,
      "Text": " companies from bankruptcy after cyber attacks through advanced, uh, risk analysis. Uh,"
    },
    {
      "Time_Start": 44.6,
      "Time_End": 51.6,
      "Text": " this is the agenda. Well, we'll talk about why we chose these devices, these solutions. We"
    },
    {
      "Time_Start": 51.620000000000005,
      "Time_End": 58.06,
      "Text": " talked security concerns that we found and how we hack them by taking different paths such"
    },
    {
      "Time_Start": 58.06,
      "Time_End": 63.06,
      "Text": " as network traffic analysis, application analysis, Bluetooth, hardware, and so on. Go ahead."
    },
    {
      "Time_Start": 66.34,
      "Time_End": 71.38,
      "Text": " So, what are, uh, digital wallets and what, what's the impulse and how everything is"
    },
    {
      "Time_Start": 71.38,
      "Time_End": 76.92,
      "Text": " connected? Well, digital wallets are a way for you to have your money stored in your, in your"
    },
    {
      "Time_Start": 76.92,
      "Time_End": 81.12,
      "Text": " phone. Basically you can receive money, you can transfer money, or you can do operations with"
    },
    {
      "Time_Start": 81.14,
      "Time_End": 86.78,
      "Text": " your money. Uh, the problem comes when you have a business, you want to receive payments from"
    },
    {
      "Time_Start": 86.78,
      "Time_End": 91.48,
      "Text": " anyone. For example, you're sending things and you are trying to, to get payments from a guy"
    },
    {
      "Time_Start": 91.48,
      "Time_End": 96.52000000000001,
      "Text": " that doesn't have the same wallet or may have a credit debit card. So these devices basically"
    },
    {
      "Time_Start": 96.52000000000001,
      "Time_End": 100.82000000000001,
      "Text": " what they do is they allow you to interact with the credit card information and to receive the"
    },
    {
      "Time_Start": 100.82000000000001,
      "Time_End": 105.0,
      "Text": " data that you need to make a payment. And they're connected through Bluetooth. These"
    },
    {
      "Time_Start": 105.0,
      "Time_End": 110.5,
      "Text": " solutions are widely available in Argentina so that's why we try to, to analyze them. And as"
    },
    {
      "Time_Start": 110.52,
      "Time_End": 116.02,
      "Text": " you can see, they are pretty common. There are a lot of, of devices that are out there. Uh, we"
    },
    {
      "Time_Start": 116.02,
      "Time_End": 122.76,
      "Text": " have very different, uh, digital wallets and all these devices have, uh, different providers."
    },
    {
      "Time_Start": 122.76,
      "Time_End": 127.06,
      "Text": " You can see on the bottom that there is a lot of providers, VBoss, MagicBoss, Stripe,"
    },
    {
      "Time_Start": 127.06,
      "Time_End": 133.64,
      "Text": " Display, uh, amongst others. So, um, you need to keep in mind that you have the, the, the, the"
    },
    {
      "Time_Start": 133.64,
      "Time_End": 139.28,
      "Text": " manufacturer and the digital wallet implementator. And the one thing that you need to keep in"
    },
    {
      "Time_Start": 139.32,
      "Time_End": 145.1,
      "Text": " mind as well is that the attacker right now might be the digital wallet owner. So you have"
    },
    {
      "Time_Start": 145.1,
      "Time_End": 150.16,
      "Text": " this device, you have this business, you are trying to receive payments. When you are"
    },
    {
      "Time_Start": 150.16,
      "Time_End": 154.9,
      "Text": " receiving a payment you need to protect the client data from the guy that's paying and using"
    },
    {
      "Time_Start": 154.9,
      "Time_End": 160.68,
      "Text": " his credit card to, to give you money. So right now the attack surface, uh, it's a little"
    },
    {
      "Time_Start": 160.68,
      "Time_End": 166.22,
      "Text": " bit bigger and we would choose these devices to, to assess them. Is that in the first case"
    },
    {
      "Time_Start": 166.22,
      "Time_End": 170.35999999999999,
      "Text": " is that they are sending very critical information over Bluetooth, which is critical"
    },
    {
      "Time_Start": 170.35999999999999,
      "Time_End": 175.84,
      "Text": " information. So, uh, we might, you, you might know that Bluetooth, uh, 4.0 is very"
    },
    {
      "Time_Start": 175.84,
      "Time_End": 180.94,
      "Text": " vulnerable. You can do a shyhack attacks and you can do a lot of stuff with Bluetooth. So our"
    },
    {
      "Time_Start": 180.94,
      "Time_End": 186.48,
      "Text": " first question was, uh, how secure is this? It's really secure. You can really see the"
    },
    {
      "Time_Start": 186.48,
      "Time_End": 191.72,
      "Text": " critical information from the air or not. This is that difficult. On the other hand, uh, we"
    },
    {
      "Time_Start": 191.76,
      "Time_End": 196.76,
      "Text": " saw that, um, differently from the, the components or the, the inputs that have a specific"
    },
    {
      "Time_Start": 200.1,
      "Time_End": 206.3,
      "Text": " system embedded in it. When you're trying to use your mobile application with those devices,"
    },
    {
      "Time_Start": 206.3,
      "Time_End": 210.54,
      "Text": " you can control the, the data flow. You can control the payment process. And this is"
    },
    {
      "Time_Start": 210.54,
      "Time_End": 215.57999999999998,
      "Text": " really, uh, it's a big problem because right now you can try amongst other things to make a"
    },
    {
      "Time_Start": 215.57999999999998,
      "Time_End": 220.48,
      "Text": " reply attack. You can try a different payment. You can show the client, uh, one amount of"
    },
    {
      "Time_Start": 220.48000000000002,
      "Time_End": 225.28000000000003,
      "Text": " money and then charge it for a bigger amount or something like that. So we try to figure"
    },
    {
      "Time_Start": 225.28000000000003,
      "Time_End": 231.72000000000003,
      "Text": " out how vulnerable is that the, the, the critical owner, the, the digital owner can manipulate"
    },
    {
      "Time_Start": 231.72000000000003,
      "Time_End": 236.96,
      "Text": " the, the payment flow. And the third, third thing is that we have a really wide attack"
    },
    {
      "Time_Start": 236.96,
      "Time_End": 241.60000000000002,
      "Text": " surface. You can hack data entry. You can hack the hardware. You can hack the firmware. You"
    },
    {
      "Time_Start": 241.60000000000002,
      "Time_End": 246.10000000000002,
      "Text": " can hack the Bluetooth. You can do a shyhack over Bluetooth. You can have manipulation of"
    },
    {
      "Time_Start": 246.1,
      "Time_End": 252.2,
      "Text": " the application. You can reverse an SDK that, uh, uh, third parties provide to you to"
    },
    {
      "Time_Start": 252.2,
      "Time_End": 256.6,
      "Text": " integrate with your digital wallet. You can manipulate network traffic. There's a lot of"
    },
    {
      "Time_Start": 256.6,
      "Time_End": 260.78,
      "Text": " things you need to implement security measures on each one of those steps. So the attack"
    },
    {
      "Time_Start": 260.78,
      "Time_End": 266.62,
      "Text": " surface is really big. So as you can see this is a simple graphic, uh, all those are attack"
    },
    {
      "Time_Start": 266.62,
      "Time_End": 271.62,
      "Text": " points, right? So you can try to get the critical information for example in each one of"
    },
    {
      "Time_Start": 271.64,
      "Time_End": 277.62,
      "Text": " those points. So the other thing that you need to understand is what are the features that"
    },
    {
      "Time_Start": 277.62,
      "Time_End": 283.96,
      "Text": " these, those devices provide. Um, these devices, uh, allow you to read EMB which is the, the"
    },
    {
      "Time_Start": 283.96,
      "Time_End": 288.6,
      "Text": " chip from the credit card. You can read the MAC stripe information which is the black stripe"
    },
    {
      "Time_Start": 288.6,
      "Time_End": 294.6,
      "Text": " in the back of your credit card, your credit card. You can read NFC and receive NFC, NFC"
    },
    {
      "Time_Start": 294.6,
      "Time_End": 300.2,
      "Text": " payments. And those devices allow, uh, firmware update over the air. They receive over the air,"
    },
    {
      "Time_Start": 300.26,
      "Time_End": 306.02,
      "Text": " uh, key updates because I will explain later how the key system management works. And they"
    },
    {
      "Time_Start": 306.02,
      "Time_End": 311.44,
      "Text": " have Bluetooth, uh, low energy and EDR which is the 3.0. And they support pretty much"
    },
    {
      "Time_Start": 311.44,
      "Time_End": 317.09999999999997,
      "Text": " every, uh, payment standard. And you need to keep in mind that to understand, uh, what we've"
    },
    {
      "Time_Start": 317.09999999999997,
      "Time_End": 323.78,
      "Text": " done is that these devices encrypt critical information to be sent to the backend and the way"
    },
    {
      "Time_Start": 323.78,
      "Time_End": 329.62,
      "Text": " this is done is by a key management system, um, a protocol which is called the UKPT."
    },
    {
      "Time_Start": 329.64,
      "Time_End": 336.48,
      "Text": " Basically what this device, uh, have is a specific key. You have a, uh, um, uh, wallet"
    },
    {
      "Time_Start": 336.48,
      "Time_End": 340.68,
      "Text": " provided. You have a master key and for each one of the devices that are going to the market"
    },
    {
      "Time_Start": 340.68,
      "Time_End": 346.46,
      "Text": " you will generate a specific key which is called the EPEC. And this key will be embedded in"
    },
    {
      "Time_Start": 346.46,
      "Time_End": 352.12,
      "Text": " the firmware and then for each transaction that we'll try to do, you'll try to generate a"
    },
    {
      "Time_Start": 352.12,
      "Time_End": 357.34000000000003,
      "Text": " new key, a session key, to encrypt this information and when this information gets to the"
    },
    {
      "Time_Start": 357.36,
      "Time_End": 363.56000000000006,
      "Text": " backend, Cypher with, uh, triple S, the backend system will try to generate the same key"
    },
    {
      "Time_Start": 363.56000000000006,
      "Time_End": 369.04,
      "Text": " based on the device itself and the transaction that is occurring. So there is no interchange"
    },
    {
      "Time_Start": 369.04,
      "Time_End": 374.34000000000003,
      "Text": " of a key but this is a Cypher, uh, Cypher channel between the device and the backend. So"
    },
    {
      "Time_Start": 374.34000000000003,
      "Time_End": 379.28000000000003,
      "Text": " after that the best, the transaction when, uh, it's, it's, it's get done. And the other thing"
    },
    {
      "Time_Start": 379.28000000000003,
      "Time_End": 383.52000000000004,
      "Text": " that you didn't understand is that critical information provides a lot of stuff. Amongst"
    },
    {
      "Time_Start": 383.53999999999996,
      "Time_End": 390.44,
      "Text": " them you can read, uh, Maxstripe. You can, uh, the Maxstripe is, uh, a stan- uh, it's a fixed"
    },
    {
      "Time_Start": 390.44,
      "Time_End": 396.38,
      "Text": " data. You can clone it. It's not something that you can change. Um, you have AMB data, NFC"
    },
    {
      "Time_Start": 396.38,
      "Time_End": 400.91999999999996,
      "Text": " data which is, uh, a specific protocol that allows you to make payments but they have, uh,"
    },
    {
      "Time_Start": 400.91999999999996,
      "Time_End": 405.91999999999996,
      "Text": " another additional Cypher link over it. Uh, I won't get into details but you need to know"
    },
    {
      "Time_Start": 405.91999999999996,
      "Time_End": 410.46,
      "Text": " that there's a different protocols and stuff that you can get from a critical. So moving on"
    },
    {
      "Time_Start": 410.50000000000006,
      "Time_End": 415.88000000000005,
      "Text": " to network traffic. Well, we started analyzing one of the cases, one of the application"
    },
    {
      "Time_Start": 415.88000000000005,
      "Time_End": 420.88000000000005,
      "Text": " vendors that interacts with this device and well, we intercepted the traffic. We actually"
    },
    {
      "Time_Start": 423.78000000000003,
      "Time_End": 430.18000000000006,
      "Text": " realized that we can read and modify any data traveling on the request and the responses. We"
    },
    {
      "Time_Start": 430.18000000000006,
      "Time_End": 435.20000000000005,
      "Text": " use Frida, Objection, Meet and Proxy, Burp Suite and well, any proxy. And we can control the"
    },
    {
      "Time_Start": 435.47999999999996,
      "Time_End": 440.47999999999996,
      "Text": " whole payment flow and we capture, we can capture the encrypted information that comes from"
    },
    {
      "Time_Start": 444.08,
      "Time_End": 449.08,
      "Text": " this device and we can try different use cases such as reusing data, reconstructing"
    },
    {
      "Time_Start": 452.02,
      "Time_End": 457.02,
      "Text": " information. Well, we have to break the SSL pinning so we use Frida scripts and running"
    },
    {
      "Time_Start": 457.58,
      "Time_End": 462.58,
      "Text": " with Objection and a proxy. And here we have the first abuse case which is data"
    },
    {
      "Time_Start": 467.46,
      "Time_End": 472.46,
      "Text": " reconstruction. We have seen that this particular application was managing information. We"
    },
    {
      "Time_Start": 475.09999999999997,
      "Time_End": 482.2,
      "Text": " have obtained information from the backend that wasn't used at the front end so we have seen"
    },
    {
      "Time_Start": 482.2,
      "Time_End": 488.65999999999997,
      "Text": " that. That is the encrypted information, the credit card number and the CVV and"
    },
    {
      "Time_Start": 488.65999999999997,
      "Time_End": 493.65999999999997,
      "Text": " expiration et cetera. But the backend returns the same information and non-encrypted. So"
    },
    {
      "Time_Start": 496.34,
      "Time_End": 503.34,
      "Text": " there you see the first A numbers of the credit card number and the GNI and the last four"
    },
    {
      "Time_Start": 503.34,
      "Time_End": 508.34,
      "Text": " numbers and expiration date. So, well, that data wasn't being used at front end so we"
    },
    {
      "Time_Start": 512.22,
      "Time_End": 517.22,
      "Text": " should try to reconstruct the complete credit card number. So how many attempts should I"
    },
    {
      "Time_Start": 519.86,
      "Time_End": 524.86,
      "Text": " do? Nearly 9,000, right? But to get these four numbers that we are missing, we should do"
    },
    {
      "Time_Start": 529.84,
      "Time_End": 534.84,
      "Text": " only 999 attempts because the credit card number follows a specific structure that can be"
    },
    {
      "Time_Start": 534.96,
      "Time_End": 539.96,
      "Text": " validated with that script for example, right? So we should do brute force and then we get"
    },
    {
      "Time_Start": 547.1,
      "Time_End": 553.5400000000001,
      "Text": " these four missing numbers and then we have the whole picture to make payments, malicious"
    },
    {
      "Time_Start": 553.5400000000001,
      "Time_End": 558.5400000000001,
      "Text": " payments. So even though the credit card data was traveling ciphered when the response for"
    },
    {
      "Time_Start": 558.5799999999999,
      "Time_End": 563.5799999999999,
      "Text": " each one of the payments came through, you can get this data to reconstruct any credit"
    },
    {
      "Time_Start": 564.92,
      "Time_End": 569.92,
      "Text": " card information. Um, well, this is a next obvious case which consists of reusing data. To"
    },
    {
      "Time_Start": 573.76,
      "Time_End": 578.76,
      "Text": " you KPT states that the key, the transaction key should be used once and then should be"
    },
    {
      "Time_Start": 580.56,
      "Time_End": 585.56,
      "Text": " discarded. So, what if we resend a request that has the encrypted information with this"
    },
    {
      "Time_Start": 588.64,
      "Time_End": 594.14,
      "Text": " key traveling in the request? What if we resend the request after a valid payment? It should"
    },
    {
      "Time_Start": 594.14,
      "Time_End": 599.14,
      "Text": " fail following the standard but here we have the process, we initiate the transaction, the"
    },
    {
      "Time_Start": 604.42,
      "Time_End": 609.42,
      "Text": " customer makes a payment on the device, we capture by analyzing the traffic, we capture the"
    },
    {
      "Time_Start": 611.0,
      "Time_End": 616.0,
      "Text": " request, the transaction goes well, it's accepted but then when the customer leaves the store,"
    },
    {
      "Time_Start": 619.06,
      "Time_End": 624.9,
      "Text": " we start it, we trigger another payment with our cards but then we replace the request with"
    },
    {
      "Time_Start": 624.9,
      "Time_End": 630.68,
      "Text": " the credit card information that is encrypted but we have saved it previously. And then we"
    },
    {
      "Time_Start": 630.68,
      "Time_End": 635.0799999999999,
      "Text": " make another payment. So you should keep in mind that there is a grey area between the"
    },
    {
      "Time_Start": 635.0799999999999,
      "Time_End": 641.9599999999999,
      "Text": " responsibilities of the device provider and the cre- uh, and the digital wallet owner. So"
    },
    {
      "Time_Start": 641.9599999999999,
      "Time_End": 647.9599999999999,
      "Text": " these things comes to get in the grey area that no one wants to take responsibility about,"
    },
    {
      "Time_Start": 648.38,
      "Time_End": 652.98,
      "Text": " the things that you should do and you should not do, do with the, the grey data."
    },
    {
      "Time_Start": 652.98,
      "Time_End": 657.98,
      "Text": " And here we are positioned as merchants. We are the attacker merchants. So here's a demo of"
    },
    {
      "Time_Start": 664.26,
      "Time_End": 669.26,
      "Text": " the reply attack. So we have 2 phones with 2 different applications and we're trying to make a"
    },
    {
      "Time_Start": 669.3,
      "Time_End": 674.3,
      "Text": " payment from, on the first digital wallet, capture the data and then we open a second, uh,"
    },
    {
      "Time_Start": 679.9399999999999,
      "Time_End": 686.8199999999999,
      "Text": " digital wallet with a second device and we'll try to dummy, uh, credit card payment and then"
    },
    {
      "Time_Start": 686.8199999999999,
      "Time_End": 690.86,
      "Text": " we'll replace this credit card data, dummy data with the previous one and we'll, you will"
    },
    {
      "Time_Start": 690.86,
      "Time_End": 695.76,
      "Text": " see that we have a successful transaction. So right now, uh, everything's connected to"
    },
    {
      "Time_Start": 695.8,
      "Time_End": 700.8,
      "Text": " Meet and Proxy. Um, I already done a transaction. So the, the payment went through. So,"
    },
    {
      "Time_Start": 713.34,
      "Time_End": 718.02,
      "Text": " sorry, this is a first payment. Uh, already connected. I'm getting the traffic from Meet and"
    },
    {
      "Time_Start": 718.02,
      "Time_End": 723.02,
      "Text": " Proxy. I just received the encrypted credit card information from the first payment. And"
    },
    {
      "Time_Start": 725.76,
      "Time_End": 730.76,
      "Text": " again, don't bother about, uh, getting this data. Uh, it's all fixed so you won't be able to"
    },
    {
      "Time_Start": 737.34,
      "Time_End": 742.34,
      "Text": " use this data. But once the, right here I'm, I'm, uh, using a simple identification number"
    },
    {
      "Time_Start": 745.08,
      "Time_End": 751.62,
      "Text": " that you need in Argentina to make a payment. And you'll see that the transaction, it's"
    },
    {
      "Time_Start": 751.62,
      "Time_End": 756.62,
      "Text": " approved. So the client left the store, goes to their home, pretty happy. He paid 55 pesos."
    },
    {
      "Time_Start": 760.9,
      "Time_End": 765.9,
      "Text": " And I'll turn off the Wi-Fi and leave everything on the side. And I use a different, um,"
    },
    {
      "Time_Start": 769.46,
      "Time_End": 774.48,
      "Text": " account in another phone. I'm getting the information, the green information that shouldn't be"
    },
    {
      "Time_Start": 774.58,
      "Time_End": 779.58,
      "Text": " used to, to re-send, uh, for another payment. And saving this data, just in a text file. Uh,"
    },
    {
      "Time_Start": 786.32,
      "Time_End": 791.32,
      "Text": " that's cipher data. You can see the key SN which is a transaction key, which allows you to"
    },
    {
      "Time_Start": 791.32,
      "Time_End": 797.0,
      "Text": " generate on the back end the new key to service data. And right now I'm turning the phone, uh,"
    },
    {
      "Time_Start": 797.0,
      "Time_End": 801.86,
      "Text": " Wi-Fi to make another payment. That's a dummy card. This, uh, it's already expired. And I use"
    },
    {
      "Time_Start": 801.88,
      "Time_End": 806.88,
      "Text": " it to make another, uh, initial payment. So right now I'm intercepting the traffic. And I"
    },
    {
      "Time_Start": 813.5600000000001,
      "Time_End": 818.5600000000001,
      "Text": " will replace this data. So turn on the device. Make another payment for a bigger amount."
    },
    {
      "Time_Start": 822.64,
      "Time_End": 827.64,
      "Text": " That's about a dollar. And right now you'll see that I'll trigger the, the device. But I"
    },
    {
      "Time_Start": 832.24,
      "Time_End": 836.08,
      "Text": " will capture the information on traffic, on network traffic. I will replace the, the"
    },
    {
      "Time_Start": 836.08,
      "Time_End": 842.02,
      "Text": " information with the previous one. And I resume the, the traffic. And you'll see that right"
    },
    {
      "Time_Start": 842.02,
      "Time_End": 847.76,
      "Text": " now I need to, again, import all the data. This is not valid, so I just can input whatever I"
    },
    {
      "Time_Start": 847.76,
      "Time_End": 852.76,
      "Text": " want. And you'll see that the transaction went through. So. There, there are more things."
    },
    {
      "Time_Start": 853.52,
      "Time_End": 858.52,
      "Text": " Wait, wait, wait. So you can see that right here I, we have, uh, the, sorry I was trying to"
    },
    {
      "Time_Start": 868.8199999999999,
      "Time_End": 873.8199999999999,
      "Text": " show you. Oh man. It was the second transaction and the wallet from the customer with a, with a"
    },
    {
      "Time_Start": 874.0,
      "Time_End": 879.0,
      "Text": " valid payment. Yeah, you can see right here we have the two payments from the same client."
    },
    {
      "Time_Start": 884.0400000000001,
      "Time_End": 890.2800000000001,
      "Text": " And the second payment was never, never actually executed. It was, and it was charged. So,"
    },
    {
      "Time_Start": 890.2800000000001,
      "Time_End": 895.96,
      "Text": " going back to the presentation. Okay, well, let's move on to application analysis. We have"
    },
    {
      "Time_Start": 895.96,
      "Time_End": 900.96,
      "Text": " seen network traffic and now we are going to hook the methods from the SDK. It's the, the"
    },
    {
      "Time_Start": 904.2600000000001,
      "Time_End": 909.2600000000001,
      "Text": " SDK, sorry. And we have the SDK and the device interacting with the application. So, we try to"
    },
    {
      "Time_Start": 913.0600000000001,
      "Time_End": 917.94,
      "Text": " manipulate the objects, the instances related to the encrypted card information coming from"
    },
    {
      "Time_Start": 917.94,
      "Time_End": 922.94,
      "Text": " this. So, we are abusing TUKPT implemented here. And remember that we have this case in"
    },
    {
      "Time_Start": 923.6800000000001,
      "Time_End": 928.6800000000001,
      "Text": " which we cannot reuse the key because this was fixed. This was reported and fixed. We"
    },
    {
      "Time_Start": 934.62,
      "Time_End": 939.62,
      "Text": " shouldn't use again the same request. But encrypted card information shouldn't be used"
    },
    {
      "Time_Start": 942.86,
      "Time_End": 947.86,
      "Text": " again. So, we are the ones interacting with the SDK and the device. So, we can manipulate"
    },
    {
      "Time_Start": 948.46,
      "Time_End": 953.46,
      "Text": " and get as many keys and as many encrypted card information as we want. This was"
    },
    {
      "Time_Start": 955.7,
      "Time_End": 960.7,
      "Text": " theoretical. We thought about it last year. We tested this year and it worked. So, how it"
    },
    {
      "Time_Start": 965.84,
      "Time_End": 970.84,
      "Text": " works. We initiate a transaction. The customer is going to pay, taps the card on this device."
    },
    {
      "Time_Start": 970.84,
      "Time_End": 975.84,
      "Text": " We capture that card, encrypted card information, right? And we try to make the payment"
    },
    {
      "Time_Start": 983.7800000000001,
      "Time_End": 988.7800000000001,
      "Text": " fail. So, in the second attempt from the customer, we are sending to you the previous card"
    },
    {
      "Time_Start": 992.32,
      "Time_End": 997.32,
      "Text": " information. And in this second tap, this second attempt from the client, we are capturing"
    },
    {
      "Time_Start": 998.32,
      "Time_End": 1003.32,
      "Text": " also that information and we are saving it on memory. And then when the customer leaves, we"
    },
    {
      "Time_Start": 1005.1600000000001,
      "Time_End": 1010.1600000000001,
      "Text": " are going to pay again with this second tap that we captured. And the transaction will be"
    },
    {
      "Time_Start": 1012.7,
      "Time_End": 1017.7,
      "Text": " accepted. This is a little script that we developed to run with objection. We hooked the"
    },
    {
      "Time_Start": 1019.74,
      "Time_End": 1024.74,
      "Text": " method, the serializer that triggers the request that completes the operation, the payment."
    },
    {
      "Time_Start": 1025.74,
      "Time_End": 1030.74,
      "Text": " And we enumerate all the instances related to the objects, the credit card information that"
    },
    {
      "Time_Start": 1034.08,
      "Time_End": 1039.08,
      "Text": " comes from here. And, well, we can save on an array or send to a server. And in the first"
    },
    {
      "Time_Start": 1043.6200000000001,
      "Time_End": 1048.6200000000001,
      "Text": " attempt, we are sending data in order to make the payment fail. And, well, that method returns"
    },
    {
      "Time_Start": 1048.92,
      "Time_End": 1053.92,
      "Text": " this first instance. And then we are sending the previous card information that we are"
    },
    {
      "Time_Start": 1056.1200000000001,
      "Time_End": 1061.1200000000001,
      "Text": " saving in each tap. And, well, we are sending information to a server if we want. And, well,"
    },
    {
      "Time_Start": 1065.6000000000001,
      "Time_End": 1070.0400000000002,
      "Text": " in order to understand this process, we have two requests. The first one that initiates the"
    },
    {
      "Time_Start": 1070.0400000000002,
      "Time_End": 1076.0000000000002,
      "Text": " payment. And the second one that completes that operation with an operation ID that is got"
    },
    {
      "Time_Start": 1076.02,
      "Time_End": 1081.02,
      "Text": " from the first request. Now in the demo, we are showing you the requests and responses. But I"
    },
    {
      "Time_Start": 1083.76,
      "Time_End": 1089.34,
      "Text": " wanted to make it clear that we are not manipulating the traffic. We are only manipulating the"
    },
    {
      "Time_Start": 1089.34,
      "Time_End": 1094.34,
      "Text": " instances at run time. We are manipulating and hooking the methods of the SDK. So let's start"
    },
    {
      "Time_Start": 1097.54,
      "Time_End": 1102.54,
      "Text": " the demo. Well, we are starting the application. The customer is going to receive the"
    },
    {
      "Time_Start": 1106.86,
      "Time_End": 1111.86,
      "Text": " payment. The customer is going to pay. We are pairing the device. This is the first tap. We are"
    },
    {
      "Time_Start": 1113.96,
      "Time_End": 1118.96,
      "Text": " capturing the information. But we are sending data in order to make the payment fail. Well, we"
    },
    {
      "Time_Start": 1122.94,
      "Time_End": 1127.94,
      "Text": " are completing the DNI for legal reasons. And then we are triggering the first request, starting"
    },
    {
      "Time_Start": 1128.56,
      "Time_End": 1133.56,
      "Text": " the payment with valid data. But the second one is GME data. Because we want to make the"
    },
    {
      "Time_Start": 1138.74,
      "Time_End": 1143.74,
      "Text": " payment fail. Right? So then there's an error. And we say the customer, hey, let's try it"
    },
    {
      "Time_Start": 1149.38,
      "Time_End": 1154.38,
      "Text": " again. We have captured this valid information from the credit card. And in this second tap, we"
    },
    {
      "Time_Start": 1155.0,
      "Time_End": 1160.0,
      "Text": " are capturing also the credit card information. But we are sending the previous one from the"
    },
    {
      "Time_Start": 1162.64,
      "Time_End": 1167.64,
      "Text": " first tap that we have captured. So completing again. Legal data. And then we are sending"
    },
    {
      "Time_Start": 1173.2800000000002,
      "Time_End": 1177.92,
      "Text": " well, starting the payment again. Because this is a valid transaction. We get an operation ID"
    },
    {
      "Time_Start": 1177.92,
      "Time_End": 1182.92,
      "Text": " which is needed to complete the transaction later with this second request. And then we are"
    },
    {
      "Time_Start": 1184.46,
      "Time_End": 1189.46,
      "Text": " sending the previous card information that we have saved. And this wasn't used. Well, we have"
    },
    {
      "Time_Start": 1196.6000000000001,
      "Time_End": 1201.6000000000001,
      "Text": " triggered now the malicious payment. The customer leaves the store. Really, really happy. Then we"
    },
    {
      "Time_Start": 1205.3400000000001,
      "Time_End": 1210.3400000000001,
      "Text": " trigger another payment. As an attacker. As a merchant attacker. And we are sending the"
    },
    {
      "Time_Start": 1215.3200000000002,
      "Time_End": 1220.3200000000002,
      "Text": " payment. We start the operation. We get the operation ID from the first request. And then we are"
    },
    {
      "Time_Start": 1226.8200000000002,
      "Time_End": 1231.64,
      "Text": " sending this previous card information from the customer. Which is encrypted. I don't need to"
    },
    {
      "Time_Start": 1231.64,
      "Time_End": 1236.64,
      "Text": " know what the credit card number is. So we completed a payment. So here we have a valid"
    },
    {
      "Time_Start": 1236.88,
      "Time_End": 1241.88,
      "Text": " transaction. And the customer will see a second payment. But just to clarify, we tried to"
    },
    {
      "Time_Start": 1252.1200000000001,
      "Time_End": 1257.1200000000001,
      "Text": " manipulate the price. But this was validated at backend. So the price was the first one that the"
    },
    {
      "Time_Start": 1259.6000000000001,
      "Time_End": 1264.6000000000001,
      "Text": " customer paid previously. So that was the demo. And the second one."
    },
    {
      "Time_Start": 1266.64,
      "Time_End": 1271.64,
      "Text": " And well, just to, in order that you understand how the script is. This is a script running"
    },
    {
      "Time_Start": 1287.42,
      "Time_End": 1292.42,
      "Text": " with Objection. We are capturing the first tap. But we tamper the method. The situation."
    },
    {
      "Time_Start": 1296.64,
      "Time_End": 1301.64,
      "Text": " And we send the data. Yeah. We are saving card information. We are linking it to a server."
    },
    {
      "Time_Start": 1310.6200000000001,
      "Time_End": 1315.6200000000001,
      "Text": " And this is the second tap when the customer tries again. But we are sending the previous one."
    },
    {
      "Time_Start": 1316.8600000000001,
      "Time_End": 1321.8600000000001,
      "Text": " Right? The first one. Well, this is the attacker tap. And we are sending the first one."
    },
    {
      "Time_Start": 1327.14,
      "Time_End": 1333.5,
      "Text": " The second tap from the customer. It's a little, a little strange but we are sending previous"
    },
    {
      "Time_Start": 1333.5,
      "Time_End": 1338.5,
      "Text": " data. And the payment goes well. So, let's move on to Bluetooth. So, Bluetooth analysis. Uh, we"
    },
    {
      "Time_Start": 1342.5400000000002,
      "Time_End": 1348.26,
      "Text": " don't open all the devices. There are mainly 4. And all of them share pretty much the same"
    },
    {
      "Time_Start": 1348.26,
      "Time_End": 1353.26,
      "Text": " uh, Bluetooth chip. Which is the iChip YC1021. This, if you go to the data sheet, you'll see"
    },
    {
      "Time_Start": 1353.42,
      "Time_End": 1358.42,
      "Text": " that this device supports Bluetooth 3.0 and 5.0. And you might know that Bluetooth low"
    },
    {
      "Time_Start": 1361.12,
      "Time_End": 1366.86,
      "Text": " energy is quite vulnerable. You can do shy hacker attacks. You can do a lot of stuff. Uh, so,"
    },
    {
      "Time_Start": 1366.86,
      "Time_End": 1373.3,
      "Text": " we uh, we unloaded um, a test application that some of these providers uh, allowed you to"
    },
    {
      "Time_Start": 1373.3,
      "Time_End": 1379.48,
      "Text": " use. To interact with the device and to see if the device is working properly or not. Um, so"
    },
    {
      "Time_Start": 1379.5,
      "Time_End": 1385.04,
      "Text": " we hacked this application to make it work with Bluetooth uh, low energy. And we used"
    },
    {
      "Time_Start": 1385.04,
      "Time_End": 1391.54,
      "Text": " BiddleJack which is a tool that we love a lot. Using 3 micro bits connected to a USB hub. We"
    },
    {
      "Time_Start": 1391.54,
      "Time_End": 1398.38,
      "Text": " were able to sniff all the, the advertisement packets. And we tried to, we, we were able to"
    },
    {
      "Time_Start": 1398.38,
      "Time_End": 1404.66,
      "Text": " sniff uh, critical information from a payment. And you can see in the left there is the, the"
    },
    {
      "Time_Start": 1404.66,
      "Time_End": 1408.96,
      "Text": " application itself. Testing application. It will show you the same, the same information,"
    },
    {
      "Time_Start": 1409.68,
      "Time_End": 1414.08,
      "Text": " the same information that we sent to the backend. And will be deciphered at the end. And you can"
    },
    {
      "Time_Start": 1414.08,
      "Time_End": 1419.38,
      "Text": " see in the right, the wire shack analysis. And you can see the same information is being shown"
    },
    {
      "Time_Start": 1419.38,
      "Time_End": 1426.4,
      "Text": " on both sides. So we are, we, we are, uh, we are sniffing the same information that we've"
    },
    {
      "Time_Start": 1426.4,
      "Time_End": 1432.26,
      "Text": " been sent to uh, the backend. So the, the Bluetooth is not adding any uh, adding any"
    },
    {
      "Time_Start": 1432.26,
      "Time_End": 1437.7,
      "Text": " ciphering over the traffic. But, we will try to, to do the same attack against all the"
    },
    {
      "Time_Start": 1437.74,
      "Time_End": 1442.64,
      "Text": " digital wallets. We weren't able to it, to do it. Because, mostly because all of them use a"
    },
    {
      "Time_Start": 1442.64,
      "Time_End": 1448.32,
      "Text": " Bluetooth EDR which is the 3.0. And it's based on the pairing mesca- mechanism. So uh, to"
    },
    {
      "Time_Start": 1448.32,
      "Time_End": 1454.3600000000001,
      "Text": " see what is the, the data that is sending over Bluetooth EDR we were able to get the HCI"
    },
    {
      "Time_Start": 1454.3600000000001,
      "Time_End": 1460.76,
      "Text": " debug log from Android. And uh, doing, we run a lot of analysis over this traffic. And we"
    },
    {
      "Time_Start": 1460.76,
      "Time_End": 1466.9,
      "Text": " found out that the same data is traveling over the, the HCI. But, since a Bluetooth EDR is"
    },
    {
      "Time_Start": 1466.94,
      "Time_End": 1472.44,
      "Text": " adding another uh, layer of, of ciphering, you cannot get this information from just sniffing"
    },
    {
      "Time_Start": 1472.44,
      "Time_End": 1479.1200000000001,
      "Text": " Bluetooth uh, 3.0. And if you will, were able to do it, you'll need a really expensive tool"
    },
    {
      "Time_Start": 1479.1200000000001,
      "Time_End": 1485.02,
      "Text": " which we don't have. But doing just a little bit of research over these devices, uh, you'll"
    },
    {
      "Time_Start": 1485.02,
      "Time_End": 1490.8200000000002,
      "Text": " see that the first time you try to pair this device to your phone, you'll be uh, shown with a"
    },
    {
      "Time_Start": 1490.8200000000002,
      "Time_End": 1495.5600000000002,
      "Text": " numeric comparison. Numeric comparison is basically uh, a pairing method where you show"
    },
    {
      "Time_Start": 1495.56,
      "Time_End": 1501.96,
      "Text": " the same six digit number on the device and on the um, on the phone. And you need to"
    },
    {
      "Time_Start": 1501.96,
      "Time_End": 1506.44,
      "Text": " click accept on those devices. I don't know if you see what's the problem. You have, you"
    },
    {
      "Time_Start": 1506.44,
      "Time_End": 1511.7,
      "Text": " don't have any screen in those devices. You have no way to see or to know what are you"
    },
    {
      "Time_Start": 1511.7,
      "Time_End": 1516.72,
      "Text": " pairing to. So we tried to do a money to me attack. Uh, basically what we created is just a"
    },
    {
      "Time_Start": 1517.72,
      "Time_End": 1522.72,
      "Text": " very simple script where you, where you use a single Bluetooth adapter and basically doing a"
    },
    {
      "Time_Start": 1525.52,
      "Time_End": 1530.3,
      "Text": " Bluetooth analysis over the traffic. We found out that all the traffic information was sent"
    },
    {
      "Time_Start": 1530.3,
      "Time_End": 1535.3,
      "Text": " over Bluetooth with an SPP protocol which is basically serial over Bluetooth. It's just"
    },
    {
      "Time_Start": 1535.3,
      "Time_End": 1540.3,
      "Text": " transmit and send data. That's it. You need just one channel. So we emulated a channel and"
    },
    {
      "Time_Start": 1541.3,
      "Time_End": 1547.8999999999999,
      "Text": " we created a simple script which is trying to listen uh, based on a reg ex just to see if"
    },
    {
      "Time_Start": 1547.8999999999999,
      "Time_End": 1552.7,
      "Text": " there is a device that is turned on. Other thing that you need to keep in mind is that for"
    },
    {
      "Time_Start": 1552.7,
      "Time_End": 1557.78,
      "Text": " each transaction you need to turn on the device because it turns uh, off itself after three,"
    },
    {
      "Time_Start": 1557.78,
      "Time_End": 1562.4199999999998,
      "Text": " maybe five minutes. So for each transaction you need to turn it on and it accepts connection"
    },
    {
      "Time_Start": 1562.4199999999998,
      "Time_End": 1567.76,
      "Text": " from pretty much anyone because again, you don't have any way to pair it correctly with any"
    },
    {
      "Time_Start": 1567.8799999999999,
      "Time_End": 1573.28,
      "Text": " other, with any device. So uh, our script what it does is trying to start listening in the"
    },
    {
      "Time_Start": 1573.28,
      "Time_End": 1576.9,
      "Text": " air, it just connects as fast as it can to the device and then it starts emulating the same"
    },
    {
      "Time_Start": 1576.9,
      "Time_End": 1582.56,
      "Text": " device and provides the same SPP protocol. So that's the setup. It's pretty simple. You have"
    },
    {
      "Time_Start": 1582.56,
      "Time_End": 1587.84,
      "Text": " on one side the device turned on, uh Raspberry Pi with Python and then the device, the"
    },
    {
      "Time_Start": 1587.84,
      "Time_End": 1592.84,
      "Text": " mobile application will try to connect automatically to the device that we are emulating. So"
    },
    {
      "Time_Start": 1598.76,
      "Time_End": 1603.76,
      "Text": " this is demo. Um, this is one digital wallet. You can see right here that that's the, the"
    },
    {
      "Time_Start": 1608.52,
      "Time_End": 1614.66,
      "Text": " remote desktop for the, the Raspberry Pi. We try, we start the, the money in the attack. You"
    },
    {
      "Time_Start": 1614.66,
      "Time_End": 1619.94,
      "Text": " can see that it's already uh, saw the device, it's connected to itself and right now it's"
    },
    {
      "Time_Start": 1619.94,
      "Time_End": 1624.94,
      "Text": " emulating the same device. So I, I just uh, entered to the mobile application, uh, and"
    },
    {
      "Time_Start": 1628.22,
      "Time_End": 1633.22,
      "Text": " the digital wallet. I go to try to make a payment and right now those devices are paired but"
    },
    {
      "Time_Start": 1639.26,
      "Time_End": 1645.7,
      "Text": " you'll see that everything works pretty good. Right now you can see all the quick, the"
    },
    {
      "Time_Start": 1645.7,
      "Time_End": 1651.3,
      "Text": " drafting information between the application, the Raspberry Pi and the, the impulse"
    },
    {
      "Time_Start": 1651.3,
      "Time_End": 1656.6,
      "Text": " device. For now I'll try to make a payment and you can see all the, the information right"
    },
    {
      "Time_Start": 1656.6200000000001,
      "Time_End": 1661.6200000000001,
      "Text": " from here on the money in the attack. So, the payment mechanism doesn't allow you to know"
    },
    {
      "Time_Start": 1664.6200000000001,
      "Time_End": 1669.46,
      "Text": " what are you actually paying to. The device doesn't know who it's paying to and the mobile"
    },
    {
      "Time_Start": 1669.46,
      "Time_End": 1676.2,
      "Text": " application doesn't know. So what can we do with this? Um, with the money in the attack we"
    },
    {
      "Time_Start": 1676.2,
      "Time_End": 1681.2,
      "Text": " can do basically uh, create uh, max type, we can try to do a max type stealing. Uh, since"
    },
    {
      "Time_Start": 1682.14,
      "Time_End": 1687.04,
      "Text": " the device is connected from, from A1 you can try to do an over the air update or, or uh,"
    },
    {
      "Time_Start": 1687.04,
      "Time_End": 1692.06,
      "Text": " a back update which is the key that is itself. Or you can try to do a dual copy bypass which"
    },
    {
      "Time_Start": 1692.06,
      "Time_End": 1697.06,
      "Text": " is pretty much the same as Celiana shown but on Bluetooth level. You try to force a, a bad"
    },
    {
      "Time_Start": 1700.22,
      "Time_End": 1705.6000000000001,
      "Text": " payment, you try it again, you saw, save the data from the two, the, the two manipulations"
    },
    {
      "Time_Start": 1705.6000000000001,
      "Time_End": 1711.14,
      "Text": " and you send just one and the other it's already valid to make a second payment. But"
    },
    {
      "Time_Start": 1711.14,
      "Time_End": 1716.16,
      "Text": " I want to show you uh, a little big uh, a little thing of um, this is the second try that we've"
    },
    {
      "Time_Start": 1724.42,
      "Time_End": 1730.5600000000002,
      "Text": " done with money in the attack. This is another digital wallet and we tried just a, a small"
    },
    {
      "Time_Start": 1730.5600000000002,
      "Time_End": 1735.5600000000002,
      "Text": " payment and I know you, you might be able to see something quite interesting. Um, again, the"
    },
    {
      "Time_Start": 1741.5400000000002,
      "Time_End": 1745.7800000000002,
      "Text": " the car owner and the, the guys that run the store doesn't know that this is a guy in the"
    },
    {
      "Time_Start": 1745.7800000000002,
      "Time_End": 1752.7800000000002,
      "Text": " middle. So, right here you can see that everything is working properly. I used an NFC"
    },
    {
      "Time_Start": 1752.7800000000002,
      "Time_End": 1758.72,
      "Text": " payment and everything is working correctly. Uh, but it's just a little different, I tried the"
    },
    {
      "Time_Start": 1758.72,
      "Time_End": 1763.8000000000002,
      "Text": " max type. And again, this data from the max type, this card is already expired on the"
    },
    {
      "Time_Start": 1763.8000000000002,
      "Time_End": 1768.0,
      "Text": " wallet, but this information should be ciphered. There's no way this information is"
    },
    {
      "Time_Start": 1768.0,
      "Time_End": 1773.0,
      "Text": " traveling in plain text. Right? So, first another payment. And you can see right there,"
    },
    {
      "Time_Start": 1785.52,
      "Time_End": 1791.96,
      "Text": " this is the plain text uh, max type information from the air. So, basically you can go to any"
    },
    {
      "Time_Start": 1791.96,
      "Time_End": 1796.96,
      "Text": " site. You can go to any store in Argentina that you're using this uh, solution. Sit there and"
    },
    {
      "Time_Start": 1804.2,
      "Time_End": 1808.9,
      "Text": " start receiving critical information. You can go with this data and emulate a card with max"
    },
    {
      "Time_Start": 1808.9,
      "Time_End": 1813.92,
      "Text": " proof. That's pretty much it. So, uh, moving forward. Um, hardware analysis. Uh, we are not"
    },
    {
      "Time_Start": 1814.92,
      "Time_End": 1819.92,
      "Text": " hardware hackers, disclaimer. We're trying to be, uh, but these are the 4 devices that are"
    },
    {
      "Time_Start": 1823.26,
      "Time_End": 1829.26,
      "Text": " right now available in Argentina. We took them apart and we saw that they share the same"
    },
    {
      "Time_Start": 1829.26,
      "Time_End": 1834.4,
      "Text": " principles amongst all of them. You have the smaller ones which don't, doesn't support NFC"
    },
    {
      "Time_Start": 1834.4,
      "Time_End": 1840.14,
      "Text": " and the bigger one that supports NFC, basically. So, uh, what are the valuable points? I mean,"
    },
    {
      "Time_Start": 1840.16,
      "Time_End": 1846.68,
      "Text": " what can I get as a low level hardware hacker from this? Well, the first thing that I think is"
    },
    {
      "Time_Start": 1846.68,
      "Time_End": 1851.5400000000002,
      "Text": " really interesting to have is the critical information that is traveling on the devices. Um,"
    },
    {
      "Time_Start": 1851.5400000000002,
      "Time_End": 1858.5600000000002,
      "Text": " DMC or EMB tokens are also very data to make a payment. So, if I get this information, I could"
    },
    {
      "Time_Start": 1858.5600000000002,
      "Time_End": 1863.7,
      "Text": " go make payments. Uh, the freeware might be really interesting to find bugs and hack other"
    },
    {
      "Time_Start": 1863.7,
      "Time_End": 1869.4,
      "Text": " devices. Uh, the IP key which allow, will allow me to, uh, decipher my own data and they"
    },
    {
      "Time_Start": 1869.4,
      "Time_End": 1876.14,
      "Text": " may make, uh, another payment. Or maybe the UART logs will allow me to, to see a few logs."
    },
    {
      "Time_Start": 1876.14,
      "Time_End": 1881.3400000000001,
      "Text": " That might be, uh, leaking important information. But you can see right here, this is, uh,"
    },
    {
      "Time_Start": 1881.3400000000001,
      "Time_End": 1886.38,
      "Text": " really basic. Uh, this is the connectors and things that you might find in, in these devices."
    },
    {
      "Time_Start": 1886.38,
      "Time_End": 1890.66,
      "Text": " You have a Bluetooth connector, an EMB connector, we connect to a chip, a controller, um,"
    },
    {
      "Time_Start": 1890.68,
      "Time_End": 1896.3200000000002,
      "Text": " mag stripe which is pretty much a tape head connected to a level fire. And in the back, well,"
    },
    {
      "Time_Start": 1896.3200000000002,
      "Time_End": 1901.2,
      "Text": " you can see the level fire and the EMB front end. And of course the Bluetooth, um, I don't know"
    },
    {
      "Time_Start": 1901.2,
      "Time_End": 1906.8400000000001,
      "Text": " if I said it already. Uh, but in the bigger devices you might find, again, Bluetooth, a"
    },
    {
      "Time_Start": 1906.8400000000001,
      "Time_End": 1911.8400000000001,
      "Text": " microcontroller, uh, we found out that there's a flash memory. Uh, we suspect this, this is"
    },
    {
      "Time_Start": 1911.8400000000001,
      "Time_End": 1917.48,
      "Text": " where the firmware is stored. Uh, we have as well a tape head, a battery controller and an EFC"
    },
    {
      "Time_Start": 1917.5,
      "Time_End": 1922.3,
      "Text": " front end, of course, to interact with NFC. So this is something, this is a very basic"
    },
    {
      "Time_Start": 1922.3,
      "Time_End": 1929.32,
      "Text": " diagram on what are the, the main components that all these devices will have. So we went to"
    },
    {
      "Time_Start": 1929.32,
      "Time_End": 1935.42,
      "Text": " for the long-hauling fruit and after running a few analysis stuff later we found out the"
    },
    {
      "Time_Start": 1935.42,
      "Time_End": 1940.72,
      "Text": " device was still working, all open. So do you have any anti-tampering measures? And that's a"
    },
    {
      "Time_Start": 1940.72,
      "Time_End": 1945.46,
      "Text": " must. When you have a, a credit card or, or credit card reader or whatever payment system, you"
    },
    {
      "Time_Start": 1945.48,
      "Time_End": 1951.98,
      "Text": " need to have anti-tampering measures to avoid anyone to just hook in the data bus and start"
    },
    {
      "Time_Start": 1951.98,
      "Time_End": 1957.08,
      "Text": " stealing information. Why? Because you have clear text traffic between each one of the"
    },
    {
      "Time_Start": 1957.08,
      "Time_End": 1961.1200000000001,
      "Text": " cont- your, your components. You have the controller which provide, which provide you with a"
    },
    {
      "Time_Start": 1961.1200000000001,
      "Time_End": 1966.6200000000001,
      "Text": " little bit of, uh, cryptography but in the meanwhile, I mean, between the data is traveling"
    },
    {
      "Time_Start": 1966.6200000000001,
      "Time_End": 1971.66,
      "Text": " from the, the peripheral and the controller you have clear text traffic. So we went for the"
    },
    {
      "Time_Start": 1971.66,
      "Time_End": 1976.68,
      "Text": " long-hauling fruit and we tried to, to get the max-stripe information from a simple swipe,"
    },
    {
      "Time_Start": 1976.68,
      "Time_End": 1981.68,
      "Text": " which is pretty much like a common schemer. That's pretty much what it is. So, um, that's"
    },
    {
      "Time_Start": 1984.64,
      "Time_End": 1989.96,
      "Text": " the, um, that's the amplifier. It's connected to the tape head and we connected an oscilloscope"
    },
    {
      "Time_Start": 1989.96,
      "Time_End": 1994.96,
      "Text": " to the tape head and you can see in the right, in the left that you have a waveform which is"
    },
    {
      "Time_Start": 1994.96,
      "Time_End": 2000.9,
      "Text": " encoding for the credit card information from the, from the max-stripe and you can see that"
    },
    {
      "Time_Start": 2000.9,
      "Time_End": 2005.3400000000001,
      "Text": " the, the, the shape is very specific. So this is what we saw on the oscilloscope. Pretty much"
    },
    {
      "Time_Start": 2005.3400000000001,
      "Time_End": 2012.0400000000002,
      "Text": " the same shape. This data is on clear ta- text traffic. So, we got the data, we tried to"
    },
    {
      "Time_Start": 2012.0400000000002,
      "Time_End": 2017.46,
      "Text": " create a schemer. A schemer will try to get this data and transmit it over the air, whatever"
    },
    {
      "Time_Start": 2017.46,
      "Time_End": 2023.16,
      "Text": " we can. Disclaimer, this is overkill, of course. Don't, don't get angry. Uh, there's another"
    },
    {
      "Time_Start": 2023.16,
      "Time_End": 2029.0600000000002,
      "Text": " way to do this, I'll, I'll show you but, heh, we used, uh, BluePill which is an Arduino with a"
    },
    {
      "Time_Start": 2029.06,
      "Time_End": 2035.6,
      "Text": " specific chipset that allowed me to have really high rates of analog reads over the, the, the"
    },
    {
      "Time_Start": 2035.6,
      "Time_End": 2040.8999999999999,
      "Text": " data that is being sent between the tape head and the controller. And we were seeing all this"
    },
    {
      "Time_Start": 2040.8999999999999,
      "Time_End": 2047.08,
      "Text": " data on raw data over the Bluetooth which is again, overkill. And we were seeing this data"
    },
    {
      "Time_Start": 2047.08,
      "Time_End": 2052.82,
      "Text": " with, um, a Raspberry Pi connected to a Bombercat which is a device that amongst other"
    },
    {
      "Time_Start": 2052.82,
      "Time_End": 2057.56,
      "Text": " things allow you to emulate credit card information. So we created a little script for both"
    },
    {
      "Time_Start": 2057.56,
      "Time_End": 2062.06,
      "Text": " these things. Uh, Raspberry Pi will decode the data, will create, will create the, the"
    },
    {
      "Time_Start": 2062.06,
      "Time_End": 2067.04,
      "Text": " specific, uh, MaxPod data that need to be sent to the Bombercat over serial and the Bombercat"
    },
    {
      "Time_Start": 2067.04,
      "Time_End": 2072.04,
      "Text": " will emulate this data. So, uh, here's the demo. So, here's the test application. Here's the"
    },
    {
      "Time_Start": 2080.68,
      "Time_End": 2086.2599999999998,
      "Text": " open device. It's working right now as, as it is. Here's the, um, the hardware input"
    },
    {
      "Time_Start": 2086.26,
      "Time_End": 2091.96,
      "Text": " implant and that's the receiver. And that's another, uh, card, uh, credit card receiver."
    },
    {
      "Time_Start": 2091.96,
      "Time_End": 2095.9,
      "Text": " Basically to see that the same information that we have sent are the same one that we are"
    },
    {
      "Time_Start": 2095.9,
      "Time_End": 2100.9,
      "Text": " emulating. So right now I'll try to make a swipe. And you'll see that all this information"
    },
    {
      "Time_Start": 2103.34,
      "Time_End": 2109.48,
      "Text": " right now has been sent over Bluetooth. This is all the, the data points and right now you"
    },
    {
      "Time_Start": 2109.48,
      "Time_End": 2114.86,
      "Text": " can see that right at the bottom that's the track 2 of the decoded data. And this data is"
    },
    {
      "Time_Start": 2114.88,
      "Time_End": 2120.2200000000003,
      "Text": " being sent to the Bombercat that is in the bottom. You cannot see it right now. And right now"
    },
    {
      "Time_Start": 2120.2200000000003,
      "Time_End": 2124.1600000000003,
      "Text": " I'm emulating the data and you can see that pretty much it's the, the same. Uh, not pretty"
    },
    {
      "Time_Start": 2124.1600000000003,
      "Time_End": 2129.8,
      "Text": " much. It's the same data, this track 2 that we were able to send over here. Again, this"
    },
    {
      "Time_Start": 2129.8,
      "Time_End": 2135.1400000000003,
      "Text": " overkill, uh, this way, easier way to do this. But this is what, uh, worked for us. And this,"
    },
    {
      "Time_Start": 2135.1400000000003,
      "Time_End": 2142.08,
      "Text": " uh, just to show you, uh, that the device is still working by itself. Right now you can see"
    },
    {
      "Time_Start": 2142.1,
      "Time_End": 2146.5,
      "Text": " that the, the hardware input, again because we are not hardware hackers, is creating a lot of"
    },
    {
      "Time_Start": 2146.5,
      "Time_End": 2153.2799999999997,
      "Text": " noises. Um, so when I try to make a payment, uh, of course it, it will fail but if I"
    },
    {
      "Time_Start": 2153.2799999999997,
      "Time_End": 2158.2799999999997,
      "Text": " disconnected the hardware input, you'll see that everything will work. Um, I just"
    },
    {
      "Time_Start": 2161.66,
      "Time_End": 2165.96,
      "Text": " disconnected the, the device and you can see that you're receiving the same encrypt data."
    },
    {
      "Time_Start": 2165.96,
      "Time_End": 2169.86,
      "Text": " What this device is supposed to do when it's open, it should wipe out all the keys and you"
    },
    {
      "Time_Start": 2169.88,
      "Time_End": 2175.82,
      "Text": " shouldn't be able to cipher any data. So this is a big deal because, uh, you know if you're"
    },
    {
      "Time_Start": 2175.82,
      "Time_End": 2179.7200000000003,
      "Text": " paying, uh, even though the, the network traffic or the Bluetooth traffic might not be"
    },
    {
      "Time_Start": 2179.7200000000003,
      "Time_End": 2184.7200000000003,
      "Text": " tampered, you know if there is anything embedded in the device. Uh, so this is what the"
    },
    {
      "Time_Start": 2186.6,
      "Time_End": 2192.56,
      "Text": " schema implant looks like. It's quite big. Uh, it's huge. Uh, the receiver you can see on the"
    },
    {
      "Time_Start": 2192.56,
      "Time_End": 2197.2400000000002,
      "Text": " left and you can see the transmitter on the right. It's pretty big. But we found out that"
    },
    {
      "Time_Start": 2197.26,
      "Time_End": 2203.1200000000003,
      "Text": " there's another way to do it. We used a very simple 433, uh, RF transmitter. Connected"
    },
    {
      "Time_Start": 2203.1200000000003,
      "Time_End": 2209.76,
      "Text": " directly to the, the, the, the energy input of the, the same device. And we were able to, uh,"
    },
    {
      "Time_Start": 2209.76,
      "Time_End": 2215.3,
      "Text": " make a few swipes and transmit the same data over to our receiver. And you can see that's"
    },
    {
      "Time_Start": 2215.3,
      "Time_End": 2220.1400000000003,
      "Text": " quite small. The thing that we weren't able to decode this data correctly because there's a"
    },
    {
      "Time_Start": 2220.1400000000003,
      "Time_End": 2226.1400000000003,
      "Text": " lot of noises and these devices are not, uh, uh, not that good at transmitting, uh, uh,"
    },
    {
      "Time_Start": 2226.14,
      "Time_End": 2231.14,
      "Text": " really, uh, nice information over here. So the last thing that, uh, the last analysis, uh,"
    },
    {
      "Time_Start": 2234.12,
      "Time_End": 2239.3599999999997,
      "Text": " working on one of those, uh, digital wallet companies, we saw that using, you should, you"
    },
    {
      "Time_Start": 2239.3599999999997,
      "Time_End": 2244.4,
      "Text": " should keep in mind that it's a trust chain between the device and the backend. Because since"
    },
    {
      "Time_Start": 2244.4,
      "Time_End": 2250.3599999999997,
      "Text": " the same keys being generated on both ends, uh, all the data is trusted between each one of"
    },
    {
      "Time_Start": 2250.36,
      "Time_End": 2257.2000000000003,
      "Text": " the points. So, um, in most of digital wallets you have this, uh, fraud prevention systems"
    },
    {
      "Time_Start": 2257.2000000000003,
      "Time_End": 2262.06,
      "Text": " where you are trying to make a same payment over and over. And if it fails three, maybe four"
    },
    {
      "Time_Start": 2262.06,
      "Time_End": 2268.2400000000002,
      "Text": " times, your credit card might be blocked. So we were seeing that, that we, we, we heard, we"
    },
    {
      "Time_Start": 2268.2400000000002,
      "Time_End": 2273.84,
      "Text": " heard about a lot of clients complain about payments that they never had done. And we were"
    },
    {
      "Time_Start": 2273.86,
      "Time_End": 2280.6000000000004,
      "Text": " seeing that there was a lot of tryout payments for a bigger amount of money, um, and all"
    },
    {
      "Time_Start": 2280.6000000000004,
      "Time_End": 2285.6800000000003,
      "Text": " failed. And pretty much every payment was the same, the data from the payment, the credit card"
    },
    {
      "Time_Start": 2285.6800000000003,
      "Time_End": 2289.88,
      "Text": " was the same, but they were changing the CBV number which is a secure number embedded"
    },
    {
      "Time_Start": 2289.88,
      "Time_End": 2295.42,
      "Text": " inside the, the MaxStack information. So we tried to replicate this problem to see what the"
    },
    {
      "Time_Start": 2295.42,
      "Time_End": 2301.7200000000003,
      "Text": " fuck is, what is going on. And we found out that, uh, we, we created a MaxPoof, we didn't"
    },
    {
      "Time_Start": 2301.7400000000002,
      "Time_End": 2306.38,
      "Text": " have the, the bumper cut, uh, back then. And we tried the same, to do the same execution."
    },
    {
      "Time_Start": 2306.38,
      "Time_End": 2312.78,
      "Text": " Just trying to change the CBV number. And we find out that the application behaved really"
    },
    {
      "Time_Start": 2312.78,
      "Time_End": 2317.96,
      "Text": " differently even though the credit card was blocked. The, the, the application behaved"
    },
    {
      "Time_Start": 2317.96,
      "Time_End": 2324.1600000000003,
      "Text": " differently if the CBV was correct, uh, or if it's, it is not. So if the CBV was not correct,"
    },
    {
      "Time_Start": 2324.1600000000003,
      "Time_End": 2328.44,
      "Text": " uh, the application showed you something and if it was correct, it showed you a different"
    },
    {
      "Time_Start": 2328.5,
      "Time_End": 2335.0,
      "Text": " thing. So, uh, the attacker, once he gets to the right CBV number, he waited for the"
    },
    {
      "Time_Start": 2335.0,
      "Time_End": 2340.64,
      "Text": " client to unlock his card and then he will go up there and make another payment. So this is a"
    },
    {
      "Time_Start": 2340.64,
      "Time_End": 2346.18,
      "Text": " problem mostly related to, uh, the trust chain between the devices and the gray area"
    },
    {
      "Time_Start": 2346.18,
      "Time_End": 2351.28,
      "Text": " between the responsibilities of the, the, the device provider and the credit, and the"
    },
    {
      "Time_Start": 2351.28,
      "Time_End": 2355.82,
      "Text": " digital wallet, um, the vendor. So conclusion."
    },
    {
      "Time_Start": 2355.84,
      "Time_End": 2363.88,
      "Text": " Well, final thoughts. Companies should use encrypted end-to-end solutions that"
    },
    {
      "Time_Start": 2363.88,
      "Time_End": 2372.26,
      "Text": " implement anti-tampering measures. And it's important to read the manual to know how to"
    },
    {
      "Time_Start": 2372.26,
      "Time_End": 2381.7400000000002,
      "Text": " implement also the, the TUKPT standards in this, in this case. And reuse data should be"
    },
    {
      "Time_Start": 2381.7400000000002,
      "Time_End": 2391.96,
      "Text": " denied for no reasons. And it could be good if an expiration or a TTL could be added to, to"
    },
    {
      "Time_Start": 2391.96,
      "Time_End": 2398.6400000000003,
      "Text": " this encrypted card information in order that no one can reuse it later. So you, you have"
    },
    {
      "Time_Start": 2398.6400000000003,
      "Time_End": 2404.6800000000003,
      "Text": " seen that we can save the information on using another opportunity. And another way to"
    },
    {
      "Time_Start": 2404.68,
      "Time_End": 2411.8199999999997,
      "Text": " associate, um, with a signature or, uh, I don't know, something that associate the accounts"
    },
    {
      "Time_Start": 2411.8199999999997,
      "Time_End": 2416.8199999999997,
      "Text": " with the device and a device ID or the impulse information. And additional things that you can add."
    },
    {
      "Time_Start": 2420.0,
      "Time_End": 2425.8399999999997,
      "Text": " Okay, um, one thing, uh, we, we think that one of the most critical things, uh, is that you can"
    },
    {
      "Time_Start": 2425.8399999999997,
      "Time_End": 2431.72,
      "Text": " manipulate data. So as Ileana said, we thought, we think that you should, uh, digital sign"
    },
    {
      "Time_Start": 2431.7200000000003,
      "Time_End": 2435.86,
      "Text": " everything that you're saying to the backend to make sure that the client is not manipulating"
    },
    {
      "Time_Start": 2435.86,
      "Time_End": 2440.2000000000003,
      "Text": " the data. That's really difficult to do. Sometimes you might find in Android that you can do"
    },
    {
      "Time_Start": 2440.2000000000003,
      "Time_End": 2445.6400000000003,
      "Text": " pretty much whatever you want with your application. Um, on the other hand, uh, you should"
    },
    {
      "Time_Start": 2445.6400000000003,
      "Time_End": 2452.1000000000004,
      "Text": " have any auto-bounce pairing method. Because again, these devices, if they, they intend to be"
    },
    {
      "Time_Start": 2452.1000000000004,
      "Time_End": 2456.7200000000003,
      "Text": " chipped and you don't want to add screen, you need to provide another way, uh, to avoid"
    },
    {
      "Time_Start": 2456.7200000000003,
      "Time_End": 2461.32,
      "Text": " man in the middle attacks. So auto-bounce pairing might work with those devices because you"
    },
    {
      "Time_Start": 2461.32,
      "Time_End": 2466.32,
      "Text": " can pair them, uh, with NFC for example. So that might work and there is no, no way for me as"
    },
    {
      "Time_Start": 2468.1000000000004,
      "Time_End": 2474.1400000000003,
      "Text": " an attacker to make a, a man in the middle attack as, uh, as itself. Um, or you can add a"
    },
    {
      "Time_Start": 2474.1400000000003,
      "Time_End": 2478.5000000000005,
      "Text": " device, uh, screen to the devices to just to, to be sure that you're pairing to the right"
    },
    {
      "Time_Start": 2478.5000000000005,
      "Time_End": 2484.92,
      "Text": " device. We think that this problem is quite, uh, quite dumb. I mean, it's really easy to, to"
    },
    {
      "Time_Start": 2484.92,
      "Time_End": 2489.76,
      "Text": " fix it, but, uh, it might be related to the, the implementation and, and the design of the"
    },
    {
      "Time_Start": 2489.76,
      "Time_End": 2494.82,
      "Text": " solution by itself. So these are the repositories, uh, the man in the middle is called"
    },
    {
      "Time_Start": 2494.82,
      "Time_End": 2501.34,
      "Text": " Prettyado. Um, the post, the, the hardware implant, again, uh, we are not hardware hackers, so"
    },
    {
      "Time_Start": 2501.34,
      "Time_End": 2506.2000000000003,
      "Text": " sorry if you see things that you might not like. And the current injection, current injection is"
    },
    {
      "Time_Start": 2506.2000000000003,
      "Time_End": 2511.64,
      "Text": " the repository for the freedom and objection scripts. And we would like to thank a few"
    },
    {
      "Time_Start": 2511.66,
      "Time_End": 2516.54,
      "Text": " friends of ours, Adrien Perroneo, Marino Marino, CodeHackerspace, and Joaquin Marella for"
    },
    {
      "Time_Start": 2516.54,
      "Time_End": 2522.18,
      "Text": " helping us and giving us recommendation and tips to how to do certain things. So thank you,"
    },
    {
      "Time_Start": 2522.18,
      "Time_End": 2523.22,
      "Text": " we're open to questions."
    },
    {
      "Time_Start": 2523.22,
      "Time_End": 2530.22,
      "Text": " >>[applause and cheers from audience and audience members in the audience."
    }
  ]
}