{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.92,
      "Text": "This text was transcribed using whisper model: large-v2\n\n So, hi. Welcome to our talk. I'll introduce myself first. My name is Nick Saunders. I'm"
    },
    {
      "Time_Start": 14.92,
      "Time_End": 21.84,
      "Text": " responsible for cybersecurity for Viasat's government group. I am also an engineer. I've"
    },
    {
      "Time_Start": 21.84,
      "Time_End": 29.36,
      "Text": " worked in engineering for 15 years. I started in embedded systems. I recently got to launch"
    },
    {
      "Time_Start": 29.36,
      "Time_End": 35.88,
      "Text": " a boot loader that I wrote into space, which I was pretty proud of. More recently, I've"
    },
    {
      "Time_Start": 35.88,
      "Time_End": 40.12,
      "Text": " also kind of worked into upper layers of the stack. I wear a lot of different hats. In"
    },
    {
      "Time_Start": 40.12,
      "Time_End": 45.28,
      "Text": " this context, though, talking about these events, I'll be sharing my role as one of"
    },
    {
      "Time_Start": 45.28,
      "Time_End": 50.120000000000005,
      "Text": " the primary investigators for the KASAT attack. And so, we will be going through these different"
    },
    {
      "Time_Start": 50.120000000000005,
      "Time_End": 55.6,
      "Text": " series of attacks. And so, Mark, my colleague as well, will be going through and giving"
    },
    {
      "Time_Start": 55.6,
      "Time_End": 60.52,
      "Text": " us an introduction on these, and then I'll be taking it over for some technical investigation"
    },
    {
      "Time_Start": 60.52,
      "Time_End": 64.56,
      "Text": " and analysis and really telling our story for what this looks like."
    },
    {
      "Time_Start": 64.56,
      "Time_End": 70.52,
      "Text": " Thanks, Nick. Hi, everyone. I'm Mark Colaluca. I am a network and security engineer by trade."
    },
    {
      "Time_Start": 70.52,
      "Time_End": 76.08,
      "Text": " I did a lot of work on layer two packet processing on some of the design of our first and second"
    },
    {
      "Time_Start": 76.08,
      "Time_End": 82.52000000000001,
      "Text": " generation satellites. Now, I am the CISO at Viasat, which in this context meant one"
    },
    {
      "Time_Start": 82.52,
      "Time_End": 87.03999999999999,
      "Text": " of my great jobs was dealing with the outside world to kind of give a protective bubble"
    },
    {
      "Time_Start": 87.03999999999999,
      "Time_End": 92.28,
      "Text": " for all of our engineers and forensic responders' time and space to do what they needed to do."
    },
    {
      "Time_Start": 92.28,
      "Time_End": 97.6,
      "Text": " So, I'm going to go pretty quick through an overview of the satellite network itself just"
    },
    {
      "Time_Start": 97.6,
      "Time_End": 102.44,
      "Text": " to baseline everyone. I apologize if this is a level of knowledge many of you are familiar"
    },
    {
      "Time_Start": 102.44,
      "Time_End": 106.47999999999999,
      "Text": " with, but it's good to set the context so when we get into the detail of the two different"
    },
    {
      "Time_Start": 106.48,
      "Time_End": 109.48,
      "Text": " attack variants, you understand the parts of the network."
    },
    {
      "Time_Start": 109.48,
      "Time_End": 121.48,
      "Text": " So, with that, how do I make this? It's not moving. Okay. Sorry. Is that better? Sorry."
    },
    {
      "Time_Start": 121.48,
      "Time_End": 129.48000000000002,
      "Text": " Sorry, guys. And that's our talk. Yeah, it's not moving at all."
    },
    {
      "Time_Start": 129.48,
      "Time_End": 139.48,
      "Text": " We may need IT help. The arrow buttons, the space bar, and the..."
    },
    {
      "Time_Start": 159.48,
      "Time_End": 181.48,
      "Text": " Okay. There we go. Hey. So, what are we talking about?"
    },
    {
      "Time_Start": 181.48,
      "Time_End": 190.48,
      "Text": " February 24th, 2022. This is a graph of our terminals online on a particular section of"
    },
    {
      "Time_Start": 190.48,
      "Time_End": 198.51999999999998,
      "Text": " the CISAT network. The way the network is segmented, actually, we have kind of by geography"
    },
    {
      "Time_Start": 198.51999999999998,
      "Time_End": 202.2,
      "Text": " but also the load balance, we have different segments of the network. And you can see up"
    },
    {
      "Time_Start": 202.2,
      "Time_End": 210.88,
      "Text": " until about 0300 or so UTC, about 60,000 modems online. And the two arrows there represent"
    },
    {
      "Time_Start": 210.88,
      "Time_End": 214.88,
      "Text": " the two different attack vectors that we're going to talk about today. The first one,"
    },
    {
      "Time_Start": 214.88,
      "Time_End": 220.16,
      "Text": " you can see a gradual decline in the number of modems. This ended up being a result of"
    },
    {
      "Time_Start": 220.16,
      "Time_End": 223.96,
      "Text": " some network-based attacks that we're going to get into in detail. They commenced there,"
    },
    {
      "Time_Start": 223.96,
      "Time_End": 229.16,
      "Text": " but they went for several weeks intermittently in different fashions, and you'll see how"
    },
    {
      "Time_Start": 229.16,
      "Time_End": 234.51999999999998,
      "Text": " the attack actually morphed. And that ended up being a DHCP-based attack that manipulated"
    },
    {
      "Time_Start": 234.51999999999998,
      "Time_End": 238.88,
      "Text": " both the protocol and the packets and some other things. The second, which is probably"
    },
    {
      "Time_Start": 238.88,
      "Time_End": 243.2,
      "Text": " the more widely publicized and discussed, is the modem wiper event. So we're going to"
    },
    {
      "Time_Start": 243.2,
      "Time_End": 248.04,
      "Text": " talk about the reverse engineering of the malware strain and the toolkit that came with"
    },
    {
      "Time_Start": 248.04,
      "Time_End": 253.07999999999998,
      "Text": " it and kind of a little bit of the lateral movement that led to the deployment of that."
    },
    {
      "Time_Start": 253.07999999999998,
      "Time_End": 258.64,
      "Text": " But that resulted in somewhere in the 40,000, 45,000, 50,000 modems being affected. There"
    },
    {
      "Time_Start": 258.64,
      "Time_End": 262.44,
      "Text": " was a bit of a long tail on this as modems came back online. We had some instability"
    },
    {
      "Time_Start": 262.44,
      "Time_End": 269.44,
      "Text": " in the network because of the activity as well. This is what the network is. Each of"
    },
    {
      "Time_Start": 269.68,
      "Time_End": 273.52,
      "Text": " those are spot beams. Those are where the users live. So you can see it covers most"
    },
    {
      "Time_Start": 273.52,
      "Time_End": 278.2,
      "Text": " of eastern and western Europe and some of the Middle East. The satellite itself was"
    },
    {
      "Time_Start": 278.2,
      "Time_End": 285.2,
      "Text": " launched in 2010. It was used for both broadband and satellite TV access. And at the time of"
    },
    {
      "Time_Start": 286.52,
      "Time_End": 292.26,
      "Text": " the events, there was about 110,000 to 120,000 commercial modems on there. We also support"
    },
    {
      "Time_Start": 292.26,
      "Time_End": 298.98,
      "Text": " commercial aviation and government customers at the time in a separate partition."
    },
    {
      "Time_Start": 298.98,
      "Time_End": 304.5,
      "Text": " One of the messages I want to emphasize here as we go through this, the priority was and"
    },
    {
      "Time_Start": 304.5,
      "Time_End": 310.02,
      "Text": " is on the customer base that we have. If you notice from that graph, there were still 20,000"
    },
    {
      "Time_Start": 310.02,
      "Time_End": 314.48,
      "Text": " customers in the affected partitions still online, still using the service. The other"
    },
    {
      "Time_Start": 314.48,
      "Time_End": 321.48,
      "Text": " partition had upwards of 40,000 or 50,000 at any one time. So we had a pretty big focus"
    },
    {
      "Time_Start": 321.6,
      "Time_End": 326.68,
      "Text": " throughout the incident response and the forensic analysis on preserving the stability and availability"
    },
    {
      "Time_Start": 326.68,
      "Time_End": 332.48,
      "Text": " of the service. And that's a guiding point you'll see Nick highlight throughout. And"
    },
    {
      "Time_Start": 332.48,
      "Time_End": 336.44,
      "Text": " with that, I'm going to turn it over to Nick to talk a little bit about the background"
    },
    {
      "Time_Start": 336.44,
      "Time_End": 339.96000000000004,
      "Text": " and some of the things that we were seeing early days, and then he'll walk you through"
    },
    {
      "Time_Start": 339.96000000000004,
      "Time_End": 341.56,
      "Text": " both attacks."
    },
    {
      "Time_Start": 341.56,
      "Time_End": 347.64000000000004,
      "Text": " All right. So first word of warning, don't believe everything you read on the internet."
    },
    {
      "Time_Start": 347.64,
      "Time_End": 351.84,
      "Text": " We're going to go through a couple of things that as we went through this attack, we were"
    },
    {
      "Time_Start": 351.84,
      "Time_End": 357.52,
      "Text": " also reading the news as it was going out there. And for good reason, in some cases"
    },
    {
      "Time_Start": 357.52,
      "Time_End": 363.4,
      "Text": " we were not sharing information because there was information that was close. Our main priority"
    },
    {
      "Time_Start": 363.4,
      "Time_End": 369.32,
      "Text": " as Mark mentioned was keeping users online and ultimately patching any findings that"
    },
    {
      "Time_Start": 369.32,
      "Time_End": 374.4,
      "Text": " were out there. But one of the things that was going on simultaneously was a few different"
    },
    {
      "Time_Start": 374.52000000000004,
      "Time_End": 378.36,
      "Text": " pieces of reporting that we're also here to want to get information out, correct the records,"
    },
    {
      "Time_Start": 378.36,
      "Time_End": 383.96000000000004,
      "Text": " share, ultimately get the details around what this attack was and was not. So a couple of"
    },
    {
      "Time_Start": 383.96000000000004,
      "Time_End": 388.48,
      "Text": " things, one was that the attack was so effective that every one of the KASAT ground user terminals"
    },
    {
      "Time_Start": 388.48,
      "Time_End": 392.8,
      "Text": " that was turned on at the time shut itself off and could not be powered up. That is not"
    },
    {
      "Time_Start": 392.8,
      "Time_End": 397.8,
      "Text": " accurate. We'll go through why that's not accurate today. Also, attackers were able"
    },
    {
      "Time_Start": 397.8,
      "Time_End": 403.76000000000005,
      "Text": " to enter a ground-based satellite network in which KASAT users were running by exploiting"
    },
    {
      "Time_Start": 403.76,
      "Time_End": 408.96,
      "Text": " a vulnerability in the Fortinet VPN. There was no evidence that we found or that any"
    },
    {
      "Time_Start": 408.96,
      "Time_End": 415.36,
      "Text": " partner has found and forensic evidence directs us elsewhere. It was not a zero data or a"
    },
    {
      "Time_Start": 415.36,
      "Time_End": 420.71999999999997,
      "Text": " vulnerability that was known on the FortiGate. There was in fact a FortiGate VPN, we'll go"
    },
    {
      "Time_Start": 420.71999999999997,
      "Time_End": 426.12,
      "Text": " through that, but that was not a vector. And then the third one, malware was part of a"
    },
    {
      "Time_Start": 426.12,
      "Time_End": 430.88,
      "Text": " larger supply chain attack. Maybe if you define supply chain extremely, extremely liberally"
    },
    {
      "Time_Start": 430.88,
      "Time_End": 436.04,
      "Text": " then sure, anything could be a supply chain attack, but there was no evidence of any compromise"
    },
    {
      "Time_Start": 436.04,
      "Time_End": 440.4,
      "Text": " or tampering with a Viasat modem, software, firmware images, no evidence of any supply"
    },
    {
      "Time_Start": 440.4,
      "Time_End": 445.8,
      "Text": " chain interference for supply chain to Viasat, so I want to correct that. And then the last"
    },
    {
      "Time_Start": 445.8,
      "Time_End": 450.15999999999997,
      "Text": " one is that, you know, this is my favorite one, they deployed wiper malware to erase"
    },
    {
      "Time_Start": 450.15999999999997,
      "Time_End": 454.12,
      "Text": " the hard drives of the modems, disconnecting them from the KASAT network. Modems do not"
    },
    {
      "Time_Start": 454.12,
      "Time_End": 457.36,
      "Text": " have hard drives for the record. I actually kind of like this one because this is, you"
    },
    {
      "Time_Start": 457.52000000000004,
      "Time_End": 462.0,
      "Text": " know, to be fair, this is the more accurate one of these four, but modems do not have hard"
    },
    {
      "Time_Start": 462.0,
      "Time_End": 467.76,
      "Text": " drives within them for the record. Um, the, on a more kind of personal basis, my, my"
    },
    {
      "Time_Start": 467.76,
      "Time_End": 472.68,
      "Text": " experience as a, as an engineer on this and an investigator on this was, uh, I got a call"
    },
    {
      "Time_Start": 472.68,
      "Time_End": 477.68,
      "Text": " from my boss at 645 AM, so thanks a lot. Um, you know, uh, who here likes 7 AM daily standups?"
    },
    {
      "Time_Start": 480.68,
      "Time_End": 485.68,
      "Text": " Can you raise your hand? Woo! Yeah. Yeah, was that your idea? Unfortunately it was. Um,"
    },
    {
      "Time_Start": 488.12,
      "Time_End": 494.16,
      "Text": " we had a bit of European partner and time zone issues, so unfortunately I couldn't accommodate"
    },
    {
      "Time_Start": 494.16,
      "Time_End": 498.12,
      "Text": " everybody's request for a noon Pacific, so. Maybe next time it'll be different, I don't"
    },
    {
      "Time_Start": 498.12,
      "Time_End": 503.84000000000003,
      "Text": " know, if I publicly shame him. Um, but, you know, so as, as our teams, you know, a number"
    },
    {
      "Time_Start": 503.84000000000003,
      "Time_End": 507.0,
      "Text": " of different cyber security people got roped into that call because it was an apparent,"
    },
    {
      "Time_Start": 507.0,
      "Time_End": 511.68,
      "Text": " it appeared to be a cyber attack, so, you know, every, everybody was really eager to"
    },
    {
      "Time_Start": 511.68,
      "Time_End": 516.16,
      "Text": " help. Let's get involved, let's go dive in, figure out what was going on, and what we"
    },
    {
      "Time_Start": 516.16,
      "Time_End": 521.0,
      "Text": " found out very quickly on a practical basis was, you know, Mark mentioned the KASAT network,"
    },
    {
      "Time_Start": 521.0,
      "Time_End": 524.88,
      "Text": " you know, that was operated by, you know, a partner that was operating that network,"
    },
    {
      "Time_Start": 524.88,
      "Time_End": 530.0,
      "Text": " so on a practical basis, we as engineers and responders didn't even have access, you know,"
    },
    {
      "Time_Start": 530.0,
      "Time_End": 534.6,
      "Text": " we had to log into, we had to get access to log into that network, and that network was"
    },
    {
      "Time_Start": 534.6,
      "Time_End": 539.4,
      "Text": " actually through that partner operated, as we were later finding out, you know, operating"
    },
    {
      "Time_Start": 539.4,
      "Time_End": 543.4399999999999,
      "Text": " other networks as well through that same, the same data center, and so there was some"
    },
    {
      "Time_Start": 543.48,
      "Time_End": 547.5600000000001,
      "Text": " hurdles that had to be worked through, and our partner graciously did accommodate, you"
    },
    {
      "Time_Start": 547.5600000000001,
      "Time_End": 552.32,
      "Text": " know, bringing us in as an extended part of the team to investigate, and so, you know,"
    },
    {
      "Time_Start": 552.32,
      "Time_End": 556.9200000000001,
      "Text": " here's our hopefully chart, which is, you know, this is our wish list that we wrote"
    },
    {
      "Time_Start": 556.9200000000001,
      "Time_End": 560.44,
      "Text": " up on the whiteboard of like a couple other things, you know, later, but, you know, the"
    },
    {
      "Time_Start": 560.44,
      "Time_End": 563.96,
      "Text": " initial ones, we just wanted to get access to a jump box, get us into the network, you"
    },
    {
      "Time_Start": 563.96,
      "Time_End": 568.1600000000001,
      "Text": " know, get us port 22 access to terminals so that we can investigate, so we're talking"
    },
    {
      "Time_Start": 568.1600000000001,
      "Time_End": 571.9200000000001,
      "Text": " through, you know, we wanted to be able to connect to a terminal over the air, log into"
    },
    {
      "Time_Start": 571.9599999999999,
      "Time_End": 576.7199999999999,
      "Text": " it, and diagnose what was going on for some of the terminals that were online."
    },
    {
      "Time_Start": 576.7199999999999,
      "Time_End": 580.64,
      "Text": " If I can add there too, I was very unpopular with the engineers, because one of the first"
    },
    {
      "Time_Start": 580.64,
      "Time_End": 586.88,
      "Text": " actions we did was hit the giant red button, which only, not only severed all of our"
    },
    {
      "Time_Start": 586.88,
      "Time_End": 590.92,
      "Text": " management access to KASAT, but also to other Viasat networks around the world, because"
    },
    {
      "Time_Start": 590.92,
      "Time_End": 595.0799999999999,
      "Text": " we weren't sure if other ones were vulnerable, or at risk, or under attack, so I was"
    },
    {
      "Time_Start": 595.0799999999999,
      "Time_End": 599.56,
      "Text": " extremely unpopular with a large amount of the ops and the forensics teams, because I"
    },
    {
      "Time_Start": 599.6,
      "Time_End": 602.12,
      "Text": " made them crawl through broken glass to get access."
    },
    {
      "Time_Start": 602.12,
      "Time_End": 602.8000000000001,
      "Text": " No comment."
    },
    {
      "Time_Start": 602.8000000000001,
      "Time_End": 603.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 605.4000000000001,
      "Time_End": 608.08,
      "Text": " So, I'm going to take you through our knowledge."
    },
    {
      "Time_Start": 608.08,
      "Time_End": 609.32,
      "Text": " What happened initially?"
    },
    {
      "Time_Start": 609.32,
      "Time_End": 610.84,
      "Text": " So, what did we know?"
    },
    {
      "Time_Start": 610.84,
      "Time_End": 612.2,
      "Text": " What did we not know?"
    },
    {
      "Time_Start": 612.2,
      "Time_End": 614.4000000000001,
      "Text": " So, Mark shared that graph earlier."
    },
    {
      "Time_Start": 614.4000000000001,
      "Time_End": 616.8800000000001,
      "Text": " That was one of our initial pieces of knowledge."
    },
    {
      "Time_Start": 616.8800000000001,
      "Time_End": 621.12,
      "Text": " The next thing that we learned was that there were complaints from distributors that some"
    },
    {
      "Time_Start": 621.12,
      "Time_End": 625.8800000000001,
      "Text": " terminals would only light up with a solid white LED, which is not normal, and then the"
    },
    {
      "Time_Start": 625.88,
      "Time_End": 629.6,
      "Text": " second piece of knowledge was conflicting, which is that other terminals would light up"
    },
    {
      "Time_Start": 629.6,
      "Time_End": 634.52,
      "Text": " with a blinking blue LED, which was another abnormal case, but that they do not provide"
    },
    {
      "Time_Start": 634.52,
      "Time_End": 638.04,
      "Text": " communications or enter the network, and so, in both of those cases, those were not"
    },
    {
      "Time_Start": 638.04,
      "Time_End": 639.48,
      "Text": " normal conditions."
    },
    {
      "Time_Start": 639.48,
      "Time_End": 643.12,
      "Text": " I didn't know what these lights meant, and so, you know, first, RTFM."
    },
    {
      "Time_Start": 643.12,
      "Time_End": 647.04,
      "Text": " Like, let's take a look at the instruction manual and figure out what does it actually"
    },
    {
      "Time_Start": 647.04,
      "Time_End": 652.12,
      "Text": " mean when you get a blinking blue light, or like a solid white light, and so if you look"
    },
    {
      "Time_Start": 652.12,
      "Time_End": 655.4,
      "Text": " on here, solid white means initial power up."
    },
    {
      "Time_Start": 655.52,
      "Time_End": 656.9599999999999,
      "Text": " That's an early stage."
    },
    {
      "Time_Start": 656.9599999999999,
      "Time_End": 658.84,
      "Text": " That's not good, you know?"
    },
    {
      "Time_Start": 658.84,
      "Time_End": 662.8,
      "Text": " The other case that we reviewed was the pulsing blue case."
    },
    {
      "Time_Start": 662.8,
      "Time_End": 667.36,
      "Text": " The device is busy, but working normally, so that means it's booting up, I guess, but,"
    },
    {
      "Time_Start": 667.36,
      "Time_End": 672.48,
      "Text": " you know, it's busy, so we didn't really know more detail than that to begin with, and so"
    },
    {
      "Time_Start": 672.48,
      "Time_End": 676.8,
      "Text": " I'm going to step back a little bit before we go into a ton more, because one of the"
    },
    {
      "Time_Start": 676.8,
      "Time_End": 681.1999999999999,
      "Text": " things that we had to do, that I had to do, that other incident responders had to do,"
    },
    {
      "Time_Start": 681.2,
      "Time_End": 685.6,
      "Text": " is get familiar very quickly with a legacy network architecture."
    },
    {
      "Time_Start": 685.6,
      "Time_End": 689.4000000000001,
      "Text": " We've got multiple different generations of different network architectures, and so we"
    },
    {
      "Time_Start": 689.4000000000001,
      "Time_End": 690.4000000000001,
      "Text": " had to come up to speed."
    },
    {
      "Time_Start": 690.4000000000001,
      "Time_End": 691.4000000000001,
      "Text": " So I'm going to bring you up to speed."
    },
    {
      "Time_Start": 691.4000000000001,
      "Time_End": 694.0,
      "Text": " I knew a lot of this, but, you know, we all had to level set, and so we're going to level"
    },
    {
      "Time_Start": 694.0,
      "Time_End": 698.2,
      "Text": " set in this room together on a satellite communications network, kind of, this is a little bit biased"
    },
    {
      "Time_Start": 698.2,
      "Time_End": 702.1600000000001,
      "Text": " toward the way we do it, but in general, we're trying to stay a little bit, you know, provider"
    },
    {
      "Time_Start": 702.1600000000001,
      "Time_End": 707.0400000000001,
      "Text": " agnostic in this view, so typically, excuse me, typically you have, you know, customer"
    },
    {
      "Time_Start": 707.04,
      "Time_End": 712.28,
      "Text": " premise equipment, that's like an end user device that connects over hard wire or Wi-Fi"
    },
    {
      "Time_Start": 712.28,
      "Time_End": 718.56,
      "Text": " to a terminal or a modem, that interfaces usually with a home through a router that's"
    },
    {
      "Time_Start": 718.56,
      "Time_End": 723.56,
      "Text": " also coupled with that modem, then you have an antenna that communicates over RF to a"
    },
    {
      "Time_Start": 723.56,
      "Time_End": 724.56,
      "Text": " satellite."
    },
    {
      "Time_Start": 724.56,
      "Time_End": 728.28,
      "Text": " I like to think about a satellite as a big mirror, I mean, it basically does frequency"
    },
    {
      "Time_Start": 728.28,
      "Time_End": 732.52,
      "Text": " translation from one frequency to another, and then, you know, beams that back down over"
    },
    {
      "Time_Start": 732.52,
      "Time_End": 736.28,
      "Text": " a different frequency band, but really it's the same signal, and then it goes back down"
    },
    {
      "Time_Start": 736.3199999999999,
      "Time_End": 743.4,
      "Text": " to a ground gateway system, which then is responsible for converting RF into a MAC layer,"
    },
    {
      "Time_Start": 743.4,
      "Time_End": 747.1999999999999,
      "Text": " and then you end up with a core node that's often providing, depending on the network,"
    },
    {
      "Time_Start": 747.1999999999999,
      "Time_End": 750.88,
      "Text": " maybe layer two, layer three services, and then you have different sophistication levels"
    },
    {
      "Time_Start": 750.88,
      "Time_End": 757.16,
      "Text": " of your core node, as we call it, that include different things, and so going through those"
    },
    {
      "Time_Start": 757.16,
      "Time_End": 763.0,
      "Text": " different elements, you have a control plane, which is, you know, for us, a control plane"
    },
    {
      "Time_Start": 763.0,
      "Time_End": 768.72,
      "Text": " really means signaling to a device, you know, communicating with a device, getting the network"
    },
    {
      "Time_Start": 768.72,
      "Time_End": 774.52,
      "Text": " to function, making changes, that's controlling of a network, so that might be instructions"
    },
    {
      "Time_Start": 774.52,
      "Time_End": 778.36,
      "Text": " down to a terminal, that might be communication of a terminal to authenticate itself with"
    },
    {
      "Time_Start": 778.36,
      "Time_End": 783.2,
      "Text": " the network, and that's where you see our first bullet, AAA, so every single modem on"
    },
    {
      "Time_Start": 783.2,
      "Time_End": 787.68,
      "Text": " our network, on the KASAT network in this case, but on every network that we're running"
    },
    {
      "Time_Start": 787.68,
      "Time_End": 789.72,
      "Text": " has an identity."
    },
    {
      "Time_Start": 789.72,
      "Time_End": 793.72,
      "Text": " That identity, you know, terminals have their own private key, they have their own public"
    },
    {
      "Time_Start": 793.72,
      "Time_End": 799.12,
      "Text": " key, they authenticate with the network through AAA server that is responsible for making"
    },
    {
      "Time_Start": 799.12,
      "Time_End": 802.6800000000001,
      "Text": " sure that when entering the network, a terminal is authentic and has a service plan and all"
    },
    {
      "Time_Start": 802.6800000000001,
      "Time_End": 803.6800000000001,
      "Text": " of that."
    },
    {
      "Time_Start": 803.6800000000001,
      "Time_End": 809.52,
      "Text": " You also have DHCP, DHCP, as we know, is a protocol that's used for giving an IP address,"
    },
    {
      "Time_Start": 809.52,
      "Time_End": 813.88,
      "Text": " for example, but many other things as well, if needed, so you can do configuration of"
    },
    {
      "Time_Start": 813.88,
      "Time_End": 817.5600000000001,
      "Text": " different settings, and so there's a lot of different parameters around DHCP, that is"
    },
    {
      "Time_Start": 817.6400000000001,
      "Time_End": 822.6800000000001,
      "Text": " actually one of the areas we'll be diving into throughout this presentation, and then"
    },
    {
      "Time_Start": 822.6800000000001,
      "Time_End": 826.8800000000001,
      "Text": " on the management plane side, you have other things, so you've got device management, so"
    },
    {
      "Time_Start": 826.8800000000001,
      "Time_End": 831.44,
      "Text": " that might be things like pushing software images down to terminals through distribution"
    },
    {
      "Time_Start": 831.44,
      "Time_End": 834.44,
      "Text": " mechanisms through image servers and things like that."
    },
    {
      "Time_Start": 834.44,
      "Time_End": 839.1600000000001,
      "Text": " That also includes, you know, as I mentioned earlier, getting SSH access to terminals,"
    },
    {
      "Time_Start": 839.1600000000001,
      "Time_End": 845.1600000000001,
      "Text": " we were able to use SSH to servers, to terminals, things like that, to interface down with different"
    },
    {
      "Time_Start": 845.16,
      "Time_End": 849.64,
      "Text": " systems within this network, and then server router administration, typical things to"
    },
    {
      "Time_Start": 849.64,
      "Time_End": 853.88,
      "Text": " be able to manage the different systems that are involved in that core node and ground"
    },
    {
      "Time_Start": 853.88,
      "Time_End": 858.64,
      "Text": " network, and so that's kind of, what we call those is our ground network, is kind of the"
    },
    {
      "Time_Start": 858.64,
      "Time_End": 863.1999999999999,
      "Text": " summary of that little element, and then those connect a user to the internet, or in some"
    },
    {
      "Time_Start": 863.1999999999999,
      "Time_End": 868.8,
      "Text": " cases, maybe private networking setups, and so that's an overall topology."
    },
    {
      "Time_Start": 868.8,
      "Time_End": 874.04,
      "Text": " I will pivot toward the KASAT, more specific network layout, and so kind of knowing all"
    },
    {
      "Time_Start": 874.56,
      "Time_End": 878.16,
      "Text": " about, you know now what a data plane, what a control plane are, what a management plane"
    },
    {
      "Time_Start": 878.16,
      "Time_End": 882.24,
      "Text": " is, this network was made out of, you know, if you look at the left-hand side of this"
    },
    {
      "Time_Start": 882.24,
      "Time_End": 884.76,
      "Text": " diagram to orient you, again, are the users."
    },
    {
      "Time_Start": 884.76,
      "Time_End": 890.24,
      "Text": " There's users with modems or terminals, and those users in the KASAT example were served"
    },
    {
      "Time_Start": 890.24,
      "Time_End": 895.92,
      "Text": " by different partitions of a network, and so we call those bandwidth aggregation points"
    },
    {
      "Time_Start": 895.92,
      "Time_End": 897.36,
      "Text": " in the KASAT context."
    },
    {
      "Time_Start": 897.36,
      "Time_End": 904.16,
      "Text": " Those are BAP1, bandwidth aggregation point one, served a regional set of users shown"
    },
    {
      "Time_Start": 904.16,
      "Time_End": 905.16,
      "Text": " on the left."
    },
    {
      "Time_Start": 905.16,
      "Time_End": 906.16,
      "Text": " Those are commercial users."
    },
    {
      "Time_Start": 906.16,
      "Time_End": 912.04,
      "Text": " BAP2 was also a different set of users, and then BAP, the last one was a Viasat-operated"
    },
    {
      "Time_Start": 912.04,
      "Time_End": 916.04,
      "Text": " mobility core, which was also, it included, you know, different systems, and one of the"
    },
    {
      "Time_Start": 916.04,
      "Time_End": 922.36,
      "Text": " elements on this was there's a partner operation of that BAP1 and then BAP2, and then we were"
    },
    {
      "Time_Start": 922.36,
      "Time_End": 926.52,
      "Text": " responsible, and there was pretty much a different core node network that was assigned to that"
    },
    {
      "Time_Start": 926.8,
      "Time_End": 930.64,
      "Text": " management network of the Viasat-operated, one shown down on the bottom for mobility"
    },
    {
      "Time_Start": 930.64,
      "Time_End": 933.4,
      "Text": " and government cases."
    },
    {
      "Time_Start": 933.4,
      "Time_End": 940.68,
      "Text": " So how many people in this room know which side of the network the attack came from?"
    },
    {
      "Time_Start": 940.68,
      "Time_End": 945.24,
      "Text": " So I'm going to ask audience participation, raise your hand if you think that the attack"
    },
    {
      "Time_Start": 945.24,
      "Time_End": 950.16,
      "Text": " came in from the left-hand side of this diagram."
    },
    {
      "Time_Start": 950.16,
      "Time_End": 952.6,
      "Text": " Okay."
    },
    {
      "Time_Start": 952.6,
      "Time_End": 956.72,
      "Text": " Raise your hand if you think that it was on the right-hand side of this diagram."
    },
    {
      "Time_Start": 956.72,
      "Time_End": 958.4,
      "Text": " Okay."
    },
    {
      "Time_Start": 958.4,
      "Time_End": 961.52,
      "Text": " Everybody's wrong, because I didn't see the same people raise their hand from the second"
    },
    {
      "Time_Start": 961.52,
      "Time_End": 962.52,
      "Text": " one."
    },
    {
      "Time_Start": 962.52,
      "Time_End": 965.52,
      "Text": " Maybe one person, okay."
    },
    {
      "Time_Start": 965.52,
      "Time_End": 967.9200000000001,
      "Text": " So I'm going to go through first."
    },
    {
      "Time_Start": 967.9200000000001,
      "Time_End": 972.32,
      "Text": " Everybody's familiar, I think, generally with the reporting around the wiper attack."
    },
    {
      "Time_Start": 972.32,
      "Time_End": 975.44,
      "Text": " So we're going to call that method number one, the wiper attack."
    },
    {
      "Time_Start": 975.44,
      "Time_End": 977.48,
      "Text": " That's been very widely reported."
    },
    {
      "Time_Start": 977.48,
      "Time_End": 978.48,
      "Text": " So we'll go through this."
    },
    {
      "Time_Start": 978.48,
      "Time_End": 980.84,
      "Text": " We're going to go through our investigation of this."
    },
    {
      "Time_Start": 980.84,
      "Time_End": 987.84,
      "Text": " But the other side of this was a different view of crafted attacks that came from terminals."
    },
    {
      "Time_Start": 987.84,
      "Time_End": 991.0,
      "Text": " And we haven't gone through those widely, and so we're going to break those apart and"
    },
    {
      "Time_Start": 991.0,
      "Time_End": 995.4,
      "Text": " what those crafted attacks looked like, which were focused around denial-of-service activity"
    },
    {
      "Time_Start": 995.4,
      "Time_End": 999.6800000000001,
      "Text": " on the network."
    },
    {
      "Time_Start": 999.6800000000001,
      "Time_End": 1008.44,
      "Text": " So we didn't have, I'm going to be fully honest that, uh-oh, it's on this side."
    },
    {
      "Time_Start": 1008.44,
      "Time_End": 1009.44,
      "Text": " Okay."
    },
    {
      "Time_Start": 1009.44,
      "Time_End": 1010.44,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1010.44,
      "Time_End": 1011.44,
      "Text": " Okay."
    },
    {
      "Time_Start": 1011.44,
      "Time_End": 1013.44,
      "Text": " We'll deal with it."
    },
    {
      "Time_Start": 1013.44,
      "Time_End": 1014.44,
      "Text": " Sorry, guys."
    },
    {
      "Time_Start": 1014.44,
      "Time_End": 1018.44,
      "Text": " The right side of the room is now in the wrong."
    },
    {
      "Time_Start": 1018.44,
      "Time_End": 1023.44,
      "Text": " Okay, so I'm going to be fully honest."
    },
    {
      "Time_Start": 1023.44,
      "Time_End": 1027.92,
      "Text": " This team structure developed over time as we learned."
    },
    {
      "Time_Start": 1027.92,
      "Time_End": 1030.48,
      "Text": " So as I mentioned, we only knew a couple things at the very beginning."
    },
    {
      "Time_Start": 1030.48,
      "Time_End": 1032.3200000000002,
      "Text": " We knew the lights weren't turning on correctly, right?"
    },
    {
      "Time_Start": 1032.3200000000002,
      "Time_End": 1036.92,
      "Text": " So we had to create these teams dynamically on the fly."
    },
    {
      "Time_Start": 1036.92,
      "Time_End": 1042.4,
      "Text": " But I'm going to talk through these different efforts because there were a lot of subject"
    },
    {
      "Time_Start": 1042.4,
      "Time_End": 1046.92,
      "Text": " matter experts, engineers involved, that all deserve a ton of credit for the work that"
    },
    {
      "Time_Start": 1046.92,
      "Time_End": 1047.92,
      "Text": " they did."
    },
    {
      "Time_Start": 1047.92,
      "Time_End": 1050.48,
      "Text": " And so the analysis that we're going to go through, I'm going to represent the work of"
    },
    {
      "Time_Start": 1050.48,
      "Time_End": 1055.04,
      "Text": " a lot of others that were investigating on these different investigation efforts."
    },
    {
      "Time_Start": 1055.04,
      "Time_End": 1061.88,
      "Text": " And so that was our kind of typical high-level team layout for these different response efforts."
    },
    {
      "Time_Start": 1061.88,
      "Time_End": 1065.88,
      "Text": " So we're going to dive in to the wiper attack investigation first."
    },
    {
      "Time_Start": 1065.88,
      "Time_End": 1073.3600000000001,
      "Text": " And so the first step that we wanted to do was get terminals brought in from Europe and"
    },
    {
      "Time_Start": 1073.3600000000001,
      "Time_End": 1075.7600000000002,
      "Text": " into our Carlsbad labs."
    },
    {
      "Time_Start": 1075.7600000000002,
      "Time_End": 1076.8000000000002,
      "Text": " That was in California."
    },
    {
      "Time_Start": 1076.8000000000002,
      "Time_End": 1080.2,
      "Text": " We wanted to bring them in, ship them in from Europe, get them in."
    },
    {
      "Time_Start": 1080.2,
      "Time_End": 1081.2,
      "Text": " And so we shipped them."
    },
    {
      "Time_Start": 1081.2,
      "Time_End": 1083.2,
      "Text": " We had to get them through customs."
    },
    {
      "Time_Start": 1083.2,
      "Time_End": 1085.0800000000002,
      "Text": " Friday, we were supposed to get them."
    },
    {
      "Time_Start": 1085.0800000000002,
      "Time_End": 1088.0400000000002,
      "Text": " Customs attempt number one failed."
    },
    {
      "Time_Start": 1088.0400000000002,
      "Time_End": 1092.0,
      "Text": " Somebody got turned away through customs and, honestly, come back tomorrow was, I think,"
    },
    {
      "Time_Start": 1092.0,
      "Time_End": 1093.0800000000002,
      "Text": " the answer that happened."
    },
    {
      "Time_Start": 1093.1999999999998,
      "Time_End": 1098.9199999999998,
      "Text": " And so not knowing all the details, our first attempt to get these terminals into country"
    },
    {
      "Time_Start": 1098.9199999999998,
      "Time_End": 1099.9199999999998,
      "Text": " failed."
    },
    {
      "Time_Start": 1099.9199999999998,
      "Time_End": 1106.28,
      "Text": " And so we got them on Saturday and laid them out all on a conference table in a room."
    },
    {
      "Time_Start": 1106.28,
      "Time_End": 1110.4399999999998,
      "Text": " So what we did on this conference table was there were different sticky notes."
    },
    {
      "Time_Start": 1110.4399999999998,
      "Time_End": 1114.6399999999999,
      "Text": " There were different pieces of information kind of annotating these different terminals."
    },
    {
      "Time_Start": 1114.6399999999999,
      "Time_End": 1118.54,
      "Text": " You, Mark, had requested kind of—do you want to go through kind of what you requested"
    },
    {
      "Time_Start": 1118.54,
      "Time_End": 1120.32,
      "Text": " from the distributors?"
    },
    {
      "Time_Start": 1120.32,
      "Time_End": 1124.96,
      "Text": " So since we didn't really understand what was resident on them or what had talked to"
    },
    {
      "Time_Start": 1124.96,
      "Time_End": 1128.4399999999998,
      "Text": " them, we have similar type modems on other networks."
    },
    {
      "Time_Start": 1128.4399999999998,
      "Time_End": 1132.9199999999998,
      "Text": " Also this was a completely air-gapped room, but we wanted to make sure from a protocol"
    },
    {
      "Time_Start": 1132.9199999999998,
      "Time_End": 1138.36,
      "Text": " standpoint that we did not tamper with or adjust or inject anything that wasn't there"
    },
    {
      "Time_Start": 1138.36,
      "Time_End": 1139.96,
      "Text": " when we received the modem."
    },
    {
      "Time_Start": 1139.96,
      "Time_End": 1146.22,
      "Text": " So I required them to establish a protocol specifically, for example, of no transmission"
    },
    {
      "Time_Start": 1146.22,
      "Time_End": 1151.54,
      "Text": " pins were being enabled when we did the reverse engineering or the analysis, because we wanted"
    },
    {
      "Time_Start": 1151.54,
      "Time_End": 1156.42,
      "Text": " to make sure that what we were getting as output was exactly what was there and we hadn't"
    },
    {
      "Time_Start": 1156.42,
      "Time_End": 1159.78,
      "Text": " tampered with or altered it in any way."
    },
    {
      "Time_Start": 1159.78,
      "Time_End": 1160.8600000000001,
      "Text": " Cool."
    },
    {
      "Time_Start": 1160.8600000000001,
      "Time_End": 1164.94,
      "Text": " So as these modems were arriving, one of the things we were also doing was, what's our"
    },
    {
      "Time_Start": 1164.94,
      "Time_End": 1165.94,
      "Text": " plan of attack?"
    },
    {
      "Time_Start": 1165.94,
      "Time_End": 1167.78,
      "Text": " Like, what do we want to do when we first get these modems?"
    },
    {
      "Time_Start": 1167.78,
      "Time_End": 1172.58,
      "Text": " And we constructed a plan, wrote it up on a big wiki page, and then said, okay, here,"
    },
    {
      "Time_Start": 1172.58,
      "Time_End": 1175.06,
      "Text": " when we get these terminals, here's the very first thing we're going to do, here's the"
    },
    {
      "Time_Start": 1175.06,
      "Time_End": 1176.22,
      "Text": " second thing that we're going to do."
    },
    {
      "Time_Start": 1176.22,
      "Time_End": 1180.6599999999999,
      "Text": " And so the first thing that we decided to do was we want to engage with these modems"
    },
    {
      "Time_Start": 1180.6599999999999,
      "Time_End": 1181.6599999999999,
      "Text": " through console."
    },
    {
      "Time_Start": 1181.6599999999999,
      "Time_End": 1186.46,
      "Text": " We just want to pull logs, and so we had to do some hardware outfitting to change these"
    },
    {
      "Time_Start": 1186.46,
      "Time_End": 1189.46,
      "Text": " terminals so that we could connect to them through console."
    },
    {
      "Time_Start": 1189.46,
      "Time_End": 1197.74,
      "Text": " Shown on the video on the right is actually a modified version of a UART connection because"
    },
    {
      "Time_Start": 1197.74,
      "Time_End": 1201.3,
      "Text": " of one key constraint that we developed in our plan."
    },
    {
      "Time_Start": 1201.3,
      "Time_End": 1204.7,
      "Text": " We did not know any state about these terminals."
    },
    {
      "Time_Start": 1205.3400000000001,
      "Time_End": 1207.02,
      "Text": " There was no wiper write-ups on the internet."
    },
    {
      "Time_Start": 1207.02,
      "Time_End": 1208.1000000000001,
      "Text": " Nobody knew anything about this."
    },
    {
      "Time_Start": 1208.1000000000001,
      "Time_End": 1212.96,
      "Text": " So kind of putting yourself through our lens, we did not know if there was code on there"
    },
    {
      "Time_Start": 1212.96,
      "Time_End": 1220.38,
      "Text": " that as soon as you connect a TX pin, it might wake up and adjust the way that it's behaving,"
    },
    {
      "Time_Start": 1220.38,
      "Time_End": 1221.38,
      "Text": " wipe itself."
    },
    {
      "Time_Start": 1221.38,
      "Time_End": 1225.3,
      "Text": " You know, we did not know what was resident on these terminals that we got in, so we wanted"
    },
    {
      "Time_Start": 1225.3,
      "Time_End": 1229.5800000000002,
      "Text": " to be very careful not to lose any state because we all know how hard it was to get something"
    },
    {
      "Time_Start": 1229.5800000000002,
      "Time_End": 1230.5800000000002,
      "Text": " through custom."
    },
    {
      "Time_Start": 1230.5800000000002,
      "Time_End": 1231.9,
      "Text": " So we didn't want to mess that up."
    },
    {
      "Time_Start": 1232.38,
      "Time_End": 1237.18,
      "Text": " So that's a three-pin UART where you might otherwise see four."
    },
    {
      "Time_Start": 1237.18,
      "Time_End": 1241.9,
      "Text": " And so what we first did was we pulled logs, and this was one of the terminals where it"
    },
    {
      "Time_Start": 1241.9,
      "Time_End": 1243.96,
      "Text": " was a white light terminal."
    },
    {
      "Time_Start": 1243.96,
      "Time_End": 1247.7,
      "Text": " And so that white light terminal meant it was an early boot failure."
    },
    {
      "Time_Start": 1247.7,
      "Time_End": 1253.7,
      "Text": " What we saw in our experience was that on the left-hand side, the not working version"
    },
    {
      "Time_Start": 1253.7,
      "Time_End": 1259.74,
      "Text": " of a terminal actually did not spit out logs past a very early stage of the boot sequence."
    },
    {
      "Time_Start": 1259.74,
      "Time_End": 1262.94,
      "Text": " And so what we did was, okay, that informs the way that we're going to think about these"
    },
    {
      "Time_Start": 1262.94,
      "Time_End": 1263.94,
      "Text": " further."
    },
    {
      "Time_Start": 1263.94,
      "Time_End": 1267.66,
      "Text": " Our next step in the process that we had identified was we're going to look at JTAG."
    },
    {
      "Time_Start": 1267.66,
      "Time_End": 1270.1,
      "Text": " And so we're going to connect to these boards through JTAG."
    },
    {
      "Time_Start": 1270.1,
      "Time_End": 1271.1,
      "Text": " That's exactly what we did."
    },
    {
      "Time_Start": 1271.1,
      "Time_End": 1274.82,
      "Text": " We got our hardware teams to outfit these boards properly."
    },
    {
      "Time_Start": 1274.82,
      "Time_End": 1280.46,
      "Text": " There were a number of people that made some changes to properly get us a JTAG connection"
    },
    {
      "Time_Start": 1280.46,
      "Time_End": 1286.06,
      "Text": " so that we could do a boundary scan, do a JTAG connection to these boards, and to pull"
    },
    {
      "Time_Start": 1286.06,
      "Time_End": 1292.22,
      "Text": " the chain of what was actually there that was all connected to the JTAG chain."
    },
    {
      "Time_Start": 1292.22,
      "Time_End": 1294.1399999999999,
      "Text": " So we did that, connected."
    },
    {
      "Time_Start": 1294.1399999999999,
      "Time_End": 1296.22,
      "Text": " There are a couple of different versions of terminals."
    },
    {
      "Time_Start": 1296.22,
      "Time_End": 1299.98,
      "Text": " And so we'll talk about the different variants of those terminals later, but we had to do"
    },
    {
      "Time_Start": 1299.98,
      "Time_End": 1303.5,
      "Text": " some different outfitting for kind of the different versions of those terminals."
    },
    {
      "Time_Start": 1303.5,
      "Time_End": 1308.94,
      "Text": " But the approach that we took was to modify uBoot to dump Flash."
    },
    {
      "Time_Start": 1308.94,
      "Time_End": 1310.3799999999999,
      "Text": " We wanted to see what was in there."
    },
    {
      "Time_Start": 1310.3799999999999,
      "Time_End": 1314.94,
      "Text": " We wanted to get everything out of that terminal because we knew that the early stages, if"
    },
    {
      "Time_Start": 1315.02,
      "Time_End": 1319.1000000000001,
      "Text": " there's a boot failure, the boot sequence would ultimately read from Flash."
    },
    {
      "Time_Start": 1319.1000000000001,
      "Time_End": 1321.3400000000001,
      "Text": " We knew that we needed to pull Flash content."
    },
    {
      "Time_Start": 1321.3400000000001,
      "Time_End": 1325.1000000000001,
      "Text": " So that was the first thing that we decided to do from there."
    },
    {
      "Time_Start": 1325.1000000000001,
      "Time_End": 1330.06,
      "Text": " So after this, we started to pull content from Flash, and we were able to see, okay,"
    },
    {
      "Time_Start": 1330.06,
      "Time_End": 1333.74,
      "Text": " this is a little bit of a weird set of content."
    },
    {
      "Time_Start": 1333.74,
      "Time_End": 1339.98,
      "Text": " I don't know if the audio will be connected to this, so let's see."
    },
    {
      "Time_Start": 1340.06,
      "Time_End": 1346.94,
      "Text": " So I'm going to, there is a, on this side, this is the very first time where we compared"
    },
    {
      "Time_Start": 1346.94,
      "Time_End": 1351.82,
      "Text": " the content of Flash from a non-working and a working modem."
    },
    {
      "Time_Start": 1351.82,
      "Time_End": 1356.14,
      "Text": " And so what's shown on this is we're looking at the left-hand side computer that you'll"
    },
    {
      "Time_Start": 1356.14,
      "Time_End": 1357.1,
      "Text": " see here."
    },
    {
      "Time_Start": 1357.1,
      "Time_End": 1358.94,
      "Text": " On this screen is a working terminal."
    },
    {
      "Time_Start": 1358.94,
      "Time_End": 1364.54,
      "Text": " You can see there's multiple different bootloaders, and there's multiple different stages of bootloaders"
    },
    {
      "Time_Start": 1364.54,
      "Time_End": 1365.9,
      "Text": " in a different file system."
    },
    {
      "Time_Start": 1365.9,
      "Time_End": 1367.74,
      "Text": " So there's a bootloader file system."
    },
    {
      "Time_Start": 1367.74,
      "Time_End": 1373.5800000000002,
      "Text": " That bootloader file system included the contents, and so that would, those are images that UBoot"
    },
    {
      "Time_Start": 1373.5800000000002,
      "Time_End": 1377.8200000000002,
      "Text": " would ultimately boot into for a stage two and a stage three boot sequence."
    },
    {
      "Time_Start": 1377.8200000000002,
      "Time_End": 1383.02,
      "Text": " On the right-hand side, you can see the Flash content of the first stage bootloader, and"
    },
    {
      "Time_Start": 1383.02,
      "Time_End": 1387.18,
      "Text": " then you can see at the very end, you saw it before, but as we scroll through this,"
    },
    {
      "Time_Start": 1387.18,
      "Time_End": 1390.0600000000002,
      "Text": " you can see a decrementing value of the Flash content."
    },
    {
      "Time_Start": 1390.1399999999999,
      "Time_End": 1395.58,
      "Text": " So this was our initial, this is the first time that we ever saw Flash content on this"
    },
    {
      "Time_Start": 1395.58,
      "Time_End": 1399.98,
      "Text": " board, so that's a, that had a couple of unique things about that."
    },
    {
      "Time_Start": 1399.98,
      "Time_End": 1401.6599999999999,
      "Text": " That was a decrementing value."
    },
    {
      "Time_Start": 1401.6599999999999,
      "Time_End": 1405.1799999999998,
      "Text": " That's not just, you know, something that could have gone wrong."
    },
    {
      "Time_Start": 1405.1799999999998,
      "Time_End": 1409.1,
      "Text": " There was a decrementing value that was the content for the Flash, so that looked wrong."
    },
    {
      "Time_Start": 1409.1,
      "Time_End": 1412.46,
      "Text": " And then the last thing that you'll see as we scroll to the bottom here is there are"
    },
    {
      "Time_Start": 1412.46,
      "Time_End": 1416.3799999999999,
      "Text": " also no contents in the file systems."
    },
    {
      "Time_Start": 1416.38,
      "Time_End": 1421.1000000000001,
      "Text": " There's no partition table for either of the file systems that those should then read"
    },
    {
      "Time_Start": 1421.1000000000001,
      "Time_End": 1424.8600000000001,
      "Text": " from and then boot into the next stage of the bootloader."
    },
    {
      "Time_Start": 1424.8600000000001,
      "Time_End": 1429.18,
      "Text": " And so all of that looks wrong, so that was our first readout, and that happened, we learned"
    },
    {
      "Time_Start": 1429.18,
      "Time_End": 1434.46,
      "Text": " that on Sunday night, so the attack happened on February 24th for this wiper attack, and"
    },
    {
      "Time_Start": 1434.46,
      "Time_End": 1440.3000000000002,
      "Text": " then on February 27th, Sunday night, we worked through Saturday to Sunday."
    },
    {
      "Time_Start": 1440.3000000000002,
      "Time_End": 1443.94,
      "Text": " So many thank yous to every engineer that was involved over the weekend."
    },
    {
      "Time_Start": 1443.94,
      "Time_End": 1445.8600000000001,
      "Text": " People were diving in to help."
    },
    {
      "Time_Start": 1445.8600000000001,
      "Time_End": 1449.8600000000001,
      "Text": " But what we did was get a good understanding of the content of Flash."
    },
    {
      "Time_Start": 1449.8600000000001,
      "Time_End": 1454.9,
      "Text": " One thing just to note that Nick just mentioned, too, is the removal of both file systems."
    },
    {
      "Time_Start": 1454.9,
      "Time_End": 1459.7,
      "Text": " That's pretty typical of modems of that generation to have, like, last known good, so both of"
    },
    {
      "Time_Start": 1459.7,
      "Time_End": 1464.5800000000002,
      "Text": " those file systems appeared to be dropped such that if the modem rebooted, thought it"
    },
    {
      "Time_Start": 1464.5800000000002,
      "Time_End": 1468.22,
      "Text": " had a problem, if it had the ability to get past first stage, it would go back to a known"
    },
    {
      "Time_Start": 1468.22,
      "Time_End": 1469.22,
      "Text": " good image."
    },
    {
      "Time_Start": 1469.22,
      "Time_End": 1473.14,
      "Text": " So it appeared that both of those might have been removed or at least altered."
    },
    {
      "Time_Start": 1473.14,
      "Time_End": 1474.14,
      "Text": " Cool."
    },
    {
      "Time_Start": 1474.14,
      "Time_End": 1475.14,
      "Text": " Mark, do you want to take this one?"
    },
    {
      "Time_Start": 1475.14,
      "Time_End": 1478.9,
      "Text": " Yeah, I'll go really quick."
    },
    {
      "Time_Start": 1478.9,
      "Time_End": 1484.5400000000002,
      "Text": " So during the weekend while we're doing the hardware analysis on the modems, a toolkit"
    },
    {
      "Time_Start": 1484.5400000000002,
      "Time_End": 1488.9,
      "Text": " was found on one of the management servers, if you remember that management plane in the"
    },
    {
      "Time_Start": 1488.9,
      "Time_End": 1490.38,
      "Text": " core node."
    },
    {
      "Time_Start": 1490.38,
      "Time_End": 1495.8600000000001,
      "Text": " The toolkit was a, that's the actual name of the file if you see it, and it was dropped"
    },
    {
      "Time_Start": 1495.8600000000001,
      "Time_End": 1499.46,
      "Text": " to us on 3.42 a.m. Sunday morning."
    },
    {
      "Time_Start": 1499.46,
      "Time_End": 1502.3600000000001,
      "Text": " It was retrieved, that's central time."
    },
    {
      "Time_Start": 1502.3600000000001,
      "Time_End": 1507.3200000000002,
      "Text": " And that toolkit contained a number of scripts as well as some, I'll say, suspicious-looking"
    },
    {
      "Time_Start": 1507.3200000000002,
      "Time_End": 1513.5600000000002,
      "Text": " binary files, and so we ended up kicking off one of those other threads that Nick mentioned,"
    },
    {
      "Time_Start": 1513.5600000000002,
      "Time_End": 1515.7600000000002,
      "Text": " kind of the reverse engineering and analysis team."
    },
    {
      "Time_Start": 1515.7600000000002,
      "Time_End": 1520.0000000000002,
      "Text": " So Nick's going to walk you through what we did with the toolkit, which includes figuring"
    },
    {
      "Time_Start": 1520.0000000000002,
      "Time_End": 1525.3200000000002,
      "Text": " out the sequencing of the contents of the toolkit, reverse engineering the binary itself,"
    },
    {
      "Time_Start": 1525.3200000000002,
      "Time_End": 1530.48,
      "Text": " and then a detonation step to actually verify that it produced the same kind of outcome"
    },
    {
      "Time_Start": 1530.6,
      "Time_End": 1533.32,
      "Text": " that you just saw on there."
    },
    {
      "Time_Start": 1533.32,
      "Time_End": 1537.76,
      "Text": " In parallel, we actually, as part of our standard incident response, Mandy and our forensics"
    },
    {
      "Time_Start": 1537.76,
      "Time_End": 1544.76,
      "Text": " and investigation partner, they commenced on March, I believe, Monday, February 28th,"
    },
    {
      "Time_Start": 1544.76,
      "Time_End": 1548.76,
      "Text": " is when we engaged them, and I think the very next day is when we gave them contents of"
    },
    {
      "Time_Start": 1548.76,
      "Time_End": 1553.76,
      "Text": " that as well so they could start their investigation and forensic analysis."
    },
    {
      "Time_Start": 1554.04,
      "Time_End": 1558.24,
      "Text": " Cool."
    },
    {
      "Time_Start": 1558.24,
      "Time_End": 1563.32,
      "Text": " So as I mentioned, there are a couple of key questions, and we didn't know a ton in the"
    },
    {
      "Time_Start": 1563.32,
      "Time_End": 1564.48,
      "Text": " very beginning."
    },
    {
      "Time_Start": 1564.48,
      "Time_End": 1570.84,
      "Text": " So we had a number of different questions about the toolkit that was found, and we had"
    },
    {
      "Time_Start": 1570.84,
      "Time_End": 1574.62,
      "Text": " a lot of questions, and a lot of those questions affected the way that we were thinking."
    },
    {
      "Time_Start": 1574.62,
      "Time_End": 1578.2,
      "Text": " So some of those questions were, what other capabilities did the toolkit have?"
    },
    {
      "Time_Start": 1578.2,
      "Time_End": 1580.72,
      "Text": " Did it have evasion capabilities?"
    },
    {
      "Time_Start": 1580.72,
      "Time_End": 1583.6,
      "Text": " Was it selective over targets?"
    },
    {
      "Time_Start": 1583.6000000000001,
      "Time_End": 1585.4800000000002,
      "Text": " How did it erase flash?"
    },
    {
      "Time_Start": 1585.4800000000002,
      "Time_End": 1587.64,
      "Text": " Could anything be done to stop it?"
    },
    {
      "Time_Start": 1587.64,
      "Time_End": 1590.3600000000001,
      "Text": " Could walking dead modems be recovered?"
    },
    {
      "Time_Start": 1590.3600000000001,
      "Time_End": 1592.16,
      "Text": " Could it self-propagate?"
    },
    {
      "Time_Start": 1592.16,
      "Time_End": 1595.0400000000002,
      "Text": " There's a lot of different questions that we had about this toolkit, so we wanted to"
    },
    {
      "Time_Start": 1595.0400000000002,
      "Time_End": 1597.72,
      "Text": " understand what was actually there."
    },
    {
      "Time_Start": 1597.72,
      "Time_End": 1602.72,
      "Text": " So this was, we spun out our toolkit reverse engineering team, which consisted of a gentleman"
    },
    {
      "Time_Start": 1602.72,
      "Time_End": 1608.0000000000002,
      "Text": " I really do want to give credit for, credit to, Jonathan Wyatt, and a couple of his colleagues,"
    },
    {
      "Time_Start": 1608.0000000000002,
      "Time_End": 1609.68,
      "Text": " Andrew Lamarche."
    },
    {
      "Time_Start": 1609.68,
      "Time_End": 1617.6000000000001,
      "Text": " These gentlemen were able to quickly use an NSA open source tool, Ghidra, to investigate,"
    },
    {
      "Time_Start": 1617.6000000000001,
      "Time_End": 1622.88,
      "Text": " we'll go through the investigation that they did in a second, from that toolkit, but one"
    },
    {
      "Time_Start": 1622.88,
      "Time_End": 1628.0,
      "Text": " of the first things that they did before that was to do an emulation through KMU."
    },
    {
      "Time_Start": 1628.0,
      "Time_End": 1633.3200000000002,
      "Text": " And so they installed one of the key binaries that was found in this toolkit, I'll go, you'll"
    },
    {
      "Time_Start": 1633.3200000000002,
      "Time_End": 1638.3200000000002,
      "Text": " see an image of what was contained in that toolkit on the next slide, but they emulated"
    },
    {
      "Time_Start": 1638.32,
      "Time_End": 1644.28,
      "Text": " the way that this malware, or this binary, would actually behave through KMU, initially."
    },
    {
      "Time_Start": 1644.28,
      "Time_End": 1649.48,
      "Text": " And so they were able to see a distinct pattern, we recognized that pattern from before, from"
    },
    {
      "Time_Start": 1649.48,
      "Time_End": 1652.2,
      "Text": " what was actually recovered from the modems that were in the field."
    },
    {
      "Time_Start": 1652.2,
      "Time_End": 1657.84,
      "Text": " And so another key question that we had was, was this malware actually the toolkit, or"
    },
    {
      "Time_Start": 1657.84,
      "Time_End": 1658.9199999999998,
      "Text": " was that a decoy?"
    },
    {
      "Time_Start": 1658.9199999999998,
      "Time_End": 1660.0,
      "Text": " We didn't know."
    },
    {
      "Time_Start": 1660.0,
      "Time_End": 1664.86,
      "Text": " So we had to pair those two things together."
    },
    {
      "Time_Start": 1664.8600000000001,
      "Time_End": 1671.8200000000002,
      "Text": " So on this slide, this is a picture of what was in that toolkit from a summary perspective."
    },
    {
      "Time_Start": 1671.8200000000002,
      "Time_End": 1677.94,
      "Text": " So as you look at this toolkit, there are a series of files and scripts, all kind of"
    },
    {
      "Time_Start": 1677.94,
      "Time_End": 1688.2400000000002,
      "Text": " centering in around use of SSH and SSH credentials to distribute an executable down to a terminal."
    },
    {
      "Time_Start": 1688.2400000000002,
      "Time_End": 1692.2600000000002,
      "Text": " One of the key things that I want to highlight about what was in this toolkit was there were"
    },
    {
      "Time_Start": 1692.26,
      "Time_End": 1698.86,
      "Text": " a couple of different ways that these attackers were interacting with their scripts."
    },
    {
      "Time_Start": 1698.86,
      "Time_End": 1702.1,
      "Text": " There was a series of files, some of them had gotten changed."
    },
    {
      "Time_Start": 1702.1,
      "Time_End": 1706.26,
      "Text": " Initially it seemed like, and we're speculating, initially it seemed like there was a hardware"
    },
    {
      "Time_Start": 1706.26,
      "Time_End": 1707.26,
      "Text": " list."
    },
    {
      "Time_Start": 1707.26,
      "Time_End": 1712.14,
      "Text": " We don't know the order in which these scripts were executed, but there was a hardware list."
    },
    {
      "Time_Start": 1712.14,
      "Time_End": 1716.7,
      "Text": " On this network, based on what everybody in this room now has seen, there's a satellite"
    },
    {
      "Time_Start": 1716.7,
      "Time_End": 1720.34,
      "Text": " communications overview, this is not one layer two broadcast domain."
    },
    {
      "Time_Start": 1721.3400000000001,
      "Time_End": 1725.7400000000002,
      "Text": " Doing an ARP-based lookup for terminals doesn't actually even work on this network."
    },
    {
      "Time_Start": 1725.7400000000002,
      "Time_End": 1732.0200000000002,
      "Text": " So it looked like that attempt was then changed in favor of a different attempt."
    },
    {
      "Time_Start": 1732.0200000000002,
      "Time_End": 1736.9800000000002,
      "Text": " So there was a series of different scripts and files that were all centered around distribution"
    },
    {
      "Time_Start": 1736.9800000000002,
      "Time_End": 1739.8600000000001,
      "Text": " of this executable down to a terminal."
    },
    {
      "Time_Start": 1739.8600000000001,
      "Time_End": 1745.0600000000002,
      "Text": " So we wanted to figure out what was actually in that executable."
    },
    {
      "Time_Start": 1745.0600000000002,
      "Time_End": 1747.2600000000002,
      "Text": " So we wanted to figure out what was actually in that executable."
    },
    {
      "Time_Start": 1747.3,
      "Time_End": 1753.22,
      "Text": " So as I mentioned, we used the NSA tool, Ghidra, to understand what was actually in the executable,"
    },
    {
      "Time_Start": 1753.22,
      "Time_End": 1756.98,
      "Text": " what did it do, how did it work, does it make the same pattern?"
    },
    {
      "Time_Start": 1756.98,
      "Time_End": 1761.3799999999999,
      "Text": " And so one of the things that we quickly did was it takes, if anybody's used the tool before,"
    },
    {
      "Time_Start": 1761.3799999999999,
      "Time_End": 1766.22,
      "Text": " you have to spend a lot of time renaming functions, understanding syscalls, understanding numbers,"
    },
    {
      "Time_Start": 1766.22,
      "Time_End": 1772.54,
      "Text": " and so this is kind of the derived version of syscalls mapped back up into an understanding."
    },
    {
      "Time_Start": 1772.54,
      "Time_End": 1777.86,
      "Text": " This was created through an internal document by the, the internal document was finished"
    },
    {
      "Time_Start": 1777.86,
      "Time_End": 1783.06,
      "Text": " on March 2nd within our team, so really proud of that team for their work."
    },
    {
      "Time_Start": 1783.06,
      "Time_End": 1788.34,
      "Text": " The next thing that we did was we also, let's detonate it, let's take, let's get some sacrificial"
    },
    {
      "Time_Start": 1788.34,
      "Time_End": 1789.34,
      "Text": " terminals."
    },
    {
      "Time_Start": 1789.34,
      "Time_End": 1793.1,
      "Text": " And so one of the things that's really cool about this event was the way that the teams"
    },
    {
      "Time_Start": 1793.1,
      "Time_End": 1795.46,
      "Text": " rallied to be able to respond."
    },
    {
      "Time_Start": 1795.46,
      "Time_End": 1800.42,
      "Text": " We were able to quickly acquire terminals from a lab that we had on a shelf and detonate,"
    },
    {
      "Time_Start": 1800.42,
      "Time_End": 1805.7,
      "Text": " so sorry terminals, you guys are, you're the unlucky ones."
    },
    {
      "Time_Start": 1805.7,
      "Time_End": 1811.38,
      "Text": " Some of these terminals were then pulled into our lab, our response room, and we detonated,"
    },
    {
      "Time_Start": 1811.38,
      "Time_End": 1818.42,
      "Text": " we distributed the kit down, or just the executable down onto those terminals, it was a MIPS binary,"
    },
    {
      "Time_Start": 1818.42,
      "Time_End": 1822.26,
      "Text": " we executed that MIPS binary on the terminals and we're able to see that it does actually"
    },
    {
      "Time_Start": 1822.26,
      "Time_End": 1827.6200000000001,
      "Text": " have the same effect as what, so now we had three different independent signals that all"
    },
    {
      "Time_Start": 1827.6200000000001,
      "Time_End": 1831.7,
      "Text": " correlated together to understand that this toolkit was in fact the toolkit."
    },
    {
      "Time_Start": 1831.7,
      "Time_End": 1837.74,
      "Text": " That really did help us to understand what was actually there, what, what, what everything"
    },
    {
      "Time_Start": 1837.74,
      "Time_End": 1841.3400000000001,
      "Text": " was."
    },
    {
      "Time_Start": 1841.3400000000001,
      "Time_End": 1848.6200000000001,
      "Text": " So just to kind of summarize our initial attack conclusions, we went through and developed"
    },
    {
      "Time_Start": 1848.6200000000001,
      "Time_End": 1853.6200000000001,
      "Text": " an understanding of, you know, the attacks happened at 3 to 4 a.m. UTC, I'll go into"
    },
    {
      "Time_Start": 1853.6200000000001,
      "Time_End": 1858.7800000000002,
      "Text": " the other attack which happened around 3 a.m. UTC on Thursday, 2-24, modems arrived"
    },
    {
      "Time_Start": 1858.7800000000002,
      "Time_End": 1863.94,
      "Text": " on Saturday, Sunday night we had discovered flash content, we had read that flash content,"
    },
    {
      "Time_Start": 1863.94,
      "Time_End": 1868.9,
      "Text": " understood it, and then our teams then were also able to reverse engineer the toolkit"
    },
    {
      "Time_Start": 1868.9,
      "Time_End": 1869.9,
      "Text": " and understand it."
    },
    {
      "Time_Start": 1869.9,
      "Time_End": 1873.9,
      "Text": " Over the series of days they were kind of streaming in information on that, that reverse"
    },
    {
      "Time_Start": 1873.9,
      "Time_End": 1877.9,
      "Text": " engineering process because, oh cool, this is what I found, okay, it's really looking"
    },
    {
      "Time_Start": 1877.9,
      "Time_End": 1883.46,
      "Text": " similar to that, and that internal final publication of that document, or that final document was"
    },
    {
      "Time_Start": 1884.3,
      "Time_End": 1889.3,
      "Text": " was kind of created by the, the March 2nd time frame."
    },
    {
      "Time_Start": 1889.3,
      "Time_End": 1890.3,
      "Text": " Mark."
    },
    {
      "Time_Start": 1890.3,
      "Time_End": 1898.22,
      "Text": " So just to kind of put the conclusions to a picture for us, based on the forensic analysis"
    },
    {
      "Time_Start": 1898.22,
      "Time_End": 1903.38,
      "Text": " and a little bit that came afterwards, but essentially attacker through known TOR node"
    },
    {
      "Time_Start": 1903.38,
      "Time_End": 1910.06,
      "Text": " exit relays, unauthorized access to that VPN with compromised credentials, pivoted to a"
    },
    {
      "Time_Start": 1910.06,
      "Time_End": 1915.22,
      "Text": " management server, which actually a different set of compromised credentials, went to a"
    },
    {
      "Time_Start": 1915.22,
      "Time_End": 1920.74,
      "Text": " network ops server to do some recon during this time period, that's the stuff about trying"
    },
    {
      "Time_Start": 1920.74,
      "Time_End": 1926.62,
      "Text": " ARP and hey, what modems are alive, or can I reach which parts of the network, and then"
    },
    {
      "Time_Start": 1926.62,
      "Time_End": 1931.1399999999999,
      "Text": " pivoting to the place where we typically do distribute software images, but just using"
    },
    {
      "Time_Start": 1931.1399999999999,
      "Time_End": 1938.1,
      "Text": " that particular place to stage the toolkit, and this is it kind of pictorially, from a"
    },
    {
      "Time_Start": 1938.14,
      "Time_End": 1943.7800000000002,
      "Text": " timing perspective, what we saw actually, the first attempts were about five or six"
    },
    {
      "Time_Start": 1943.7800000000002,
      "Time_End": 1949.3400000000001,
      "Text": " o'clock in the evening, trying to get access to the VPN, had several failed logins, first"
    },
    {
      "Time_Start": 1949.3400000000001,
      "Time_End": 1956.3000000000002,
      "Text": " successful compromise with unauthorized access about eight o'clock in the evening, then took"
    },
    {
      "Time_Start": 1956.3000000000002,
      "Time_End": 1960.8600000000001,
      "Text": " about two hours, I don't know if the attacker or attackers needed dinner, put kids to bed,"
    },
    {
      "Time_Start": 1960.8600000000001,
      "Time_End": 1965.3400000000001,
      "Text": " whatever, went to a management server, hung out there for a little bit, then went ahead"
    },
    {
      "Time_Start": 1965.3400000000001,
      "Time_End": 1969.7400000000002,
      "Text": " and said I'm gonna go check out the network right around 10 or 11 o'clock that evening,"
    },
    {
      "Time_Start": 1969.7400000000002,
      "Time_End": 1978.3400000000001,
      "Text": " and then about 11.30 through 1 a.m. to 2 a.m. went to that server, started staging the toolkit,"
    },
    {
      "Time_Start": 1978.3400000000001,
      "Time_End": 1983.5400000000002,
      "Text": " and then started executing attempts, but it looked like about 04.15, as you saw the arrow"
    },
    {
      "Time_Start": 1983.5400000000002,
      "Time_End": 1989.3400000000001,
      "Text": " with the precipitous drop is when essentially sent out this over the satellite network,"
    },
    {
      "Time_Start": 1989.3400000000001,
      "Time_End": 1994.5400000000002,
      "Text": " just going modem to modem down the row, and sending the toolkit, placing it on the modem,"
    },
    {
      "Time_Start": 1994.54,
      "Time_End": 1996.22,
      "Text": " and then executing it."
    },
    {
      "Time_Start": 1996.22,
      "Time_End": 2001.1399999999999,
      "Text": " Once the binary was executed, it performed the flash memory overwrite that you saw with"
    },
    {
      "Time_Start": 2001.1399999999999,
      "Time_End": 2005.34,
      "Text": " that pattern, and then attempted to reboot the terminal, which would put it in an inoperable"
    },
    {
      "Time_Start": 2005.34,
      "Time_End": 2006.34,
      "Text": " state."
    },
    {
      "Time_Start": 2006.34,
      "Time_End": 2007.34,
      "Text": " Okay?"
    },
    {
      "Time_Start": 2007.34,
      "Time_End": 2011.1,
      "Text": " Now we're gonna talk about the other, the control plane attacks, and if you remember"
    },
    {
      "Time_Start": 2011.1,
      "Time_End": 2018.34,
      "Text": " these started at roughly 0300 UTC, and I wanna emphasize while they were going simultaneously,"
    },
    {
      "Time_Start": 2018.34,
      "Time_End": 2022.26,
      "Text": " throughout that morning, there was some intermittent behavior, and they also continued for several"
    },
    {
      "Time_Start": 2022.26,
      "Time_End": 2027.3799999999999,
      "Text": " weeks as some of the methods and means that were being used, we had mitigations deployed,"
    },
    {
      "Time_Start": 2027.3799999999999,
      "Time_End": 2033.5,
      "Text": " they would pivot to a new technique."
    },
    {
      "Time_Start": 2033.5,
      "Time_End": 2035.5,
      "Text": " So I think we've seen this slide already."
    },
    {
      "Time_Start": 2035.5,
      "Time_End": 2041.94,
      "Text": " Just to orient, now we're talking about the second method, and so this second method was"
    },
    {
      "Time_Start": 2041.94,
      "Time_End": 2045.1,
      "Text": " crafted attacks that came out of terminal, so we're gonna decompose that, and what were"
    },
    {
      "Time_Start": 2045.1,
      "Time_End": 2048.14,
      "Text": " those crafted attacks, and what can we learn from those?"
    },
    {
      "Time_Start": 2048.14,
      "Time_End": 2053.74,
      "Text": " We have since gotten the chance to apply all of these fixes onto our networks, and"
    },
    {
      "Time_Start": 2053.74,
      "Time_End": 2057.2599999999998,
      "Text": " then I've also been working to generalize the understanding to say, okay, what other"
    },
    {
      "Time_Start": 2057.2599999999998,
      "Time_End": 2061.5,
      "Text": " attacks could look like this, and so that's what we want to get out there and inform the"
    },
    {
      "Time_Start": 2061.5,
      "Time_End": 2062.5,
      "Text": " community of."
    },
    {
      "Time_Start": 2062.5,
      "Time_End": 2066.94,
      "Text": " And I'll add to that, this is one of the places through private sharing forums and direct"
    },
    {
      "Time_Start": 2066.94,
      "Time_End": 2072.1,
      "Text": " communications with other SATCOM and service provider, this is a more, I'll say a more"
    },
    {
      "Time_Start": 2072.1,
      "Time_End": 2076.7,
      "Text": " similar pattern that other service providers might use to provide control plane or signaling"
    },
    {
      "Time_Start": 2076.7,
      "Time_End": 2081.8599999999997,
      "Text": " or IP addresses, so even though these are specifically manipulating things we use in"
    },
    {
      "Time_Start": 2081.8599999999997,
      "Time_End": 2086.62,
      "Text": " our network, certain DHCP option fields, etc., we thought it's generalized enough that we"
    },
    {
      "Time_Start": 2086.62,
      "Time_End": 2091.24,
      "Text": " should share, so this was some of our earliest sharing, both directly with SATCOM operators"
    },
    {
      "Time_Start": 2091.24,
      "Time_End": 2094.8199999999997,
      "Text": " as well as through our government sharing partner."
    },
    {
      "Time_Start": 2094.8199999999997,
      "Time_End": 2099.8999999999996,
      "Text": " One thing also to call out on the prior slide is that this fell then into the other track"
    },
    {
      "Time_Start": 2099.8999999999996,
      "Time_End": 2104.06,
      "Text": " that we had formed as part of our incident response, which was the network and infrastructure"
    },
    {
      "Time_Start": 2104.06,
      "Time_End": 2108.22,
      "Text": " analysis and response teams, and so those teams were a series of subject matter experts"
    },
    {
      "Time_Start": 2108.22,
      "Time_End": 2113.18,
      "Text": " and security engineers that were all kind of responding ultimately to these network"
    },
    {
      "Time_Start": 2113.18,
      "Time_End": 2117.58,
      "Text": " based attacks, and so this was a distinct track from the others, but we were generalizing"
    },
    {
      "Time_Start": 2117.58,
      "Time_End": 2124.18,
      "Text": " the learnings and understanding and aggregating them into a composite picture the whole time."
    },
    {
      "Time_Start": 2124.18,
      "Time_End": 2129.56,
      "Text": " So as we go through this, we're going to look at this first attack example."
    },
    {
      "Time_Start": 2129.56,
      "Time_End": 2137.2,
      "Text": " So in this first attack example, we've attached a timeline to initial DHCP request volumetric"
    },
    {
      "Time_Start": 2137.2,
      "Time_End": 2145.56,
      "Text": " attacks that we saw starting at 3.02 a.m. UTC on February 24th."
    },
    {
      "Time_Start": 2145.56,
      "Time_End": 2150.72,
      "Text": " If you recall, the prior graph that Mark mentioned, you saw that initial drop-off and then you"
    },
    {
      "Time_Start": 2150.72,
      "Time_End": 2152.2799999999997,
      "Text": " saw a steep drop-off."
    },
    {
      "Time_Start": 2152.2799999999997,
      "Time_End": 2156.56,
      "Text": " This was around the same time of that initial drop-off of terminals when you started to"
    },
    {
      "Time_Start": 2156.56,
      "Time_End": 2163.2799999999997,
      "Text": " see that was due to effects to the network entry process that were caused by these crafted"
    },
    {
      "Time_Start": 2163.2799999999997,
      "Time_End": 2165.4,
      "Text": " attacks coming from terminals."
    },
    {
      "Time_Start": 2165.4,
      "Time_End": 2168.16,
      "Text": " And two other points I just want to make on this one."
    },
    {
      "Time_Start": 2168.16,
      "Time_End": 2172.12,
      "Text": " One, if you see the legend in the top right, I mean, these are legitimate modems with valid"
    },
    {
      "Time_Start": 2172.12,
      "Time_End": 2175.48,
      "Text": " subscriptions all throughout that beam pattern."
    },
    {
      "Time_Start": 2175.48,
      "Time_End": 2178.64,
      "Text": " There was no localization, like they were all in one place."
    },
    {
      "Time_Start": 2178.64,
      "Time_End": 2182.2799999999997,
      "Text": " These are just essentially random modems that appeared to be doing this."
    },
    {
      "Time_Start": 2182.28,
      "Time_End": 2186.8,
      "Text": " The second thing to note on there's that gap in the middle, it looks like it kind of"
    },
    {
      "Time_Start": 2186.8,
      "Time_End": 2187.8,
      "Text": " stopped."
    },
    {
      "Time_Start": 2187.8,
      "Time_End": 2192.98,
      "Text": " Well, part of that was due to the instability in our network because of the volumetric attacks."
    },
    {
      "Time_Start": 2192.98,
      "Time_End": 2197.32,
      "Text": " Some of the elements that Nick's going to describe stopped responding, crashed, reboot,"
    },
    {
      "Time_Start": 2197.32,
      "Time_End": 2200.88,
      "Text": " analyzed, take it offline, take a node out of service."
    },
    {
      "Time_Start": 2200.88,
      "Time_End": 2201.88,
      "Text": " Cool."
    },
    {
      "Time_Start": 2201.88,
      "Time_End": 2205.44,
      "Text": " So now I'm going to dive in."
    },
    {
      "Time_Start": 2205.44,
      "Time_End": 2209.28,
      "Text": " I'm going to decompose a control plane a little bit more than we have so far."
    },
    {
      "Time_Start": 2209.28,
      "Time_End": 2210.6400000000003,
      "Text": " So you have a customer premise equipment."
    },
    {
      "Time_Start": 2211.0,
      "Time_End": 2212.0,
      "Text": " Then you have a device of an end user."
    },
    {
      "Time_Start": 2212.0,
      "Time_End": 2214.04,
      "Text": " You have a terminal."
    },
    {
      "Time_Start": 2214.04,
      "Time_End": 2215.04,
      "Text": " Then you have a gateway."
    },
    {
      "Time_Start": 2215.04,
      "Time_End": 2218.16,
      "Text": " So that terminal communicates ultimately through the satellite through the gateway."
    },
    {
      "Time_Start": 2218.16,
      "Time_End": 2223.48,
      "Text": " And then that gateway makes a decision depending on whether that traffic is control plane or"
    },
    {
      "Time_Start": 2223.48,
      "Time_End": 2225.7999999999997,
      "Text": " data plane."
    },
    {
      "Time_Start": 2225.7999999999997,
      "Time_End": 2233.8399999999997,
      "Text": " And then that traffic ultimately flows through an ASN is a role within a system architecture"
    },
    {
      "Time_Start": 2233.8399999999997,
      "Time_End": 2234.8399999999997,
      "Text": " for the network."
    },
    {
      "Time_Start": 2234.8399999999997,
      "Time_End": 2237.48,
      "Text": " This is a virtualized ASN."
    },
    {
      "Time_Start": 2237.48,
      "Time_End": 2242.76,
      "Text": " That system then acts in the DHCP context as a DHCP relay."
    },
    {
      "Time_Start": 2242.76,
      "Time_End": 2245.56,
      "Text": " That's an extension to the DHCP RFC."
    },
    {
      "Time_Start": 2245.56,
      "Time_End": 2250.72,
      "Text": " And then there's DHCP servers that are facilitating DHCP requests and responses."
    },
    {
      "Time_Start": 2250.72,
      "Time_End": 2253.84,
      "Text": " There's a AAA, as I mentioned, for authentication and servicing of that."
    },
    {
      "Time_Start": 2253.84,
      "Time_End": 2256.4,
      "Text": " And then there's a couple other systems that are involved."
    },
    {
      "Time_Start": 2256.4,
      "Time_End": 2260.84,
      "Text": " So as we decompose this, this is a little bit small."
    },
    {
      "Time_Start": 2260.84,
      "Time_End": 2261.84,
      "Text": " It's an eye chart."
    },
    {
      "Time_Start": 2261.84,
      "Time_End": 2263.4,
      "Text": " But I'm going to talk you through this."
    },
    {
      "Time_Start": 2263.48,
      "Time_End": 2269.04,
      "Text": " So this is attack number 2.1 of three different attacks that I'm going to decompose that we"
    },
    {
      "Time_Start": 2269.04,
      "Time_End": 2273.1600000000003,
      "Text": " saw happen on our network that were these crafted attacks from terminals."
    },
    {
      "Time_Start": 2273.1600000000003,
      "Time_End": 2278.14,
      "Text": " So the precondition for this attack first is that a terminal must have valid access"
    },
    {
      "Time_Start": 2278.14,
      "Time_End": 2280.64,
      "Text": " and an identity within the network."
    },
    {
      "Time_Start": 2280.64,
      "Time_End": 2284.36,
      "Text": " So you must have a terminal specific private key."
    },
    {
      "Time_Start": 2284.36,
      "Time_End": 2286.36,
      "Text": " You have to be authenticated within the service."
    },
    {
      "Time_Start": 2286.36,
      "Time_End": 2287.36,
      "Text": " You're real."
    },
    {
      "Time_Start": 2287.36,
      "Time_End": 2288.36,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2288.36,
      "Time_End": 2290.6,
      "Text": " So the terminals that might have been stolen or haven't been provisioned yet, they don't"
    },
    {
      "Time_Start": 2290.6,
      "Time_End": 2292.6,
      "Text": " yet have that kind of key."
    },
    {
      "Time_Start": 2292.6,
      "Time_End": 2295.62,
      "Text": " And they go to a walled garden for an installer to go install it."
    },
    {
      "Time_Start": 2295.62,
      "Time_End": 2300.7999999999997,
      "Text": " So you can't get to this place in the network, if you will, unless you're a valid subscriber,"
    },
    {
      "Time_Start": 2300.7999999999997,
      "Time_End": 2303.3199999999997,
      "Text": " you know, a terminal with a valid subscription."
    },
    {
      "Time_Start": 2303.3199999999997,
      "Time_End": 2307.08,
      "Text": " Prior to that, if you hadn't paid your bill or the service was suspended, AAA would send"
    },
    {
      "Time_Start": 2307.08,
      "Time_End": 2308.08,
      "Text": " you somewhere else."
    },
    {
      "Time_Start": 2308.08,
      "Time_End": 2310.16,
      "Text": " So this is a pretty important point."
    },
    {
      "Time_Start": 2310.16,
      "Time_End": 2315.3199999999997,
      "Text": " This has authenticated itself to the network using its key, and it's got a valid subscription."
    },
    {
      "Time_Start": 2315.3199999999997,
      "Time_End": 2319.8399999999997,
      "Text": " So kind of from that precondition now, you see the next, you have a user device which"
    },
    {
      "Time_Start": 2319.84,
      "Time_End": 2322.84,
      "Text": " issues a DHCP request up to a terminal."
    },
    {
      "Time_Start": 2322.84,
      "Time_End": 2326.6400000000003,
      "Text": " And then that terminal then sends that DHCP request on."
    },
    {
      "Time_Start": 2326.6400000000003,
      "Time_End": 2330.88,
      "Text": " This is a terminal that, in this case, is not acting as a router."
    },
    {
      "Time_Start": 2330.88,
      "Time_End": 2334.08,
      "Text": " There are sometimes cases where if you've got a router involved, then the router might"
    },
    {
      "Time_Start": 2334.08,
      "Time_End": 2335.36,
      "Text": " act as a relay for that."
    },
    {
      "Time_Start": 2335.36,
      "Time_End": 2340.28,
      "Text": " So this is the case only where it's assigning an IP address, essentially, like think of"
    },
    {
      "Time_Start": 2340.28,
      "Time_End": 2341.56,
      "Text": " your home router, basically."
    },
    {
      "Time_Start": 2341.56,
      "Time_End": 2344.2000000000003,
      "Text": " The home router gets an ISP IP address."
    },
    {
      "Time_Start": 2344.2000000000003,
      "Time_End": 2345.2000000000003,
      "Text": " That is that request."
    },
    {
      "Time_Start": 2345.2000000000003,
      "Time_End": 2346.2000000000003,
      "Text": " Right?"
    },
    {
      "Time_Start": 2346.2000000000003,
      "Time_End": 2348.34,
      "Text": " So that DHCP request is then filled out."
    },
    {
      "Time_Start": 2348.34,
      "Time_End": 2349.56,
      "Text": " It's sent across to the gateway."
    },
    {
      "Time_Start": 2350.2799999999997,
      "Time_End": 2354.7599999999998,
      "Text": " The gateway then propagates that to a VASN, and then that ultimately then gets relayed"
    },
    {
      "Time_Start": 2354.7599999999998,
      "Time_End": 2356.36,
      "Text": " to a DHCP server."
    },
    {
      "Time_Start": 2356.36,
      "Time_End": 2364.66,
      "Text": " So in that DHCP request, in the DHCP RFC, I think 2131, it defines a client address"
    },
    {
      "Time_Start": 2364.66,
      "Time_End": 2371.04,
      "Text": " as really, like it's the CH adder field is essentially an opaque key."
    },
    {
      "Time_Start": 2371.04,
      "Time_End": 2376.5,
      "Text": " That opaque, excuse me, that opaque key can be anything that you want."
    },
    {
      "Time_Start": 2376.5,
      "Time_End": 2383.84,
      "Text": " It's essentially a hardware address in this context for a modem that then might include,"
    },
    {
      "Time_Start": 2383.84,
      "Time_End": 2387.02,
      "Text": " there's kind of two variants to this attack if you want to execute it."
    },
    {
      "Time_Start": 2387.02,
      "Time_End": 2394.36,
      "Text": " One would be to set your client hardware address to any, and then associate a requested IP"
    },
    {
      "Time_Start": 2394.36,
      "Time_End": 2398.48,
      "Text": " address, which is DHCP option 50, with the IP address of a target terminal."
    },
    {
      "Time_Start": 2398.48,
      "Time_End": 2402.92,
      "Text": " So this is what we saw from the attacker where there is IP addresses of target terminals"
    },
    {
      "Time_Start": 2402.92,
      "Time_End": 2404.96,
      "Text": " that were in these volumetric attacks."
    },
    {
      "Time_Start": 2404.96,
      "Time_End": 2408.44,
      "Text": " You could also, when we reviewed this, you could also do the reverse."
    },
    {
      "Time_Start": 2408.44,
      "Time_End": 2413.2400000000002,
      "Text": " And so when we have since then applied that into a patch, we've had to think about and"
    },
    {
      "Time_Start": 2413.2400000000002,
      "Time_End": 2417.48,
      "Text": " generalize what are the other cases that we didn't see but could also then be used."
    },
    {
      "Time_Start": 2417.48,
      "Time_End": 2423.28,
      "Text": " And then kind of winding ahead to the DHCP server, you can see a DHCP request to a DHCP"
    },
    {
      "Time_Start": 2423.28,
      "Time_End": 2425.92,
      "Text": " server that says the request is invalid."
    },
    {
      "Time_Start": 2425.92,
      "Time_End": 2428.12,
      "Text": " It doesn't match an active lease."
    },
    {
      "Time_Start": 2428.12,
      "Time_End": 2432.44,
      "Text": " And then a NAC is then sent from the DHCP server to the VASN."
    },
    {
      "Time_Start": 2432.44,
      "Time_End": 2437.28,
      "Text": " That VASN system then is responsive to that NAC."
    },
    {
      "Time_Start": 2437.28,
      "Time_End": 2439.7200000000003,
      "Text": " It shouldn't have been in this case."
    },
    {
      "Time_Start": 2439.7200000000003,
      "Time_End": 2440.7200000000003,
      "Text": " That was the problem."
    },
    {
      "Time_Start": 2440.7200000000003,
      "Time_End": 2448.2000000000003,
      "Text": " So the VASN takes an unsolicited NAC and then is confused into issuing a command on that"
    },
    {
      "Time_Start": 2448.2000000000003,
      "Time_End": 2451.96,
      "Text": " control plane to disconnect a terminal from the network and that ultimately would knock"
    },
    {
      "Time_Start": 2451.96,
      "Time_End": 2453.36,
      "Text": " a terminal offline."
    },
    {
      "Time_Start": 2453.36,
      "Time_End": 2459.56,
      "Text": " So it was a fairly sophisticated way to use multiple different, essentially DHCP system"
    },
    {
      "Time_Start": 2459.56,
      "Time_End": 2463.6,
      "Text": " roles to confuse multiple systems operating together."
    },
    {
      "Time_Start": 2463.6,
      "Time_End": 2470.4,
      "Text": " And so if you think about this within buzzword zero trust context, you have to think about"
    },
    {
      "Time_Start": 2470.4,
      "Time_End": 2478.68,
      "Text": " what are the ways that you might be able to confuse systems where the DHCP server is implicitly"
    },
    {
      "Time_Start": 2478.68,
      "Time_End": 2479.92,
      "Text": " trusted from a VASN."
    },
    {
      "Time_Start": 2479.92,
      "Time_End": 2484.24,
      "Text": " So you have to think about how might that affect something else and how can you ultimately"
    },
    {
      "Time_Start": 2484.24,
      "Time_End": 2485.44,
      "Text": " prevent that from happening."
    },
    {
      "Time_Start": 2485.44,
      "Time_End": 2488.7599999999998,
      "Text": " So I can wind pretty quickly through the rest of these."
    },
    {
      "Time_Start": 2488.76,
      "Time_End": 2494.44,
      "Text": " You have a second variant of this attack, which is a DHCP decline attack, which we saw,"
    },
    {
      "Time_Start": 2494.44,
      "Time_End": 2498.88,
      "Text": " which is ultimately issuing a DHCP decline for a target terminal."
    },
    {
      "Time_Start": 2498.88,
      "Time_End": 2501.88,
      "Text": " That then causes a DHCP server to really not care about that."
    },
    {
      "Time_Start": 2501.88,
      "Time_End": 2505.5600000000004,
      "Text": " That actually confuses a VASN to then disconnect the terminal."
    },
    {
      "Time_Start": 2505.5600000000004,
      "Time_End": 2510.84,
      "Text": " This was, we responded to this and then we're able to disable this request."
    },
    {
      "Time_Start": 2510.84,
      "Time_End": 2517.94,
      "Text": " And then lastly, same exact attack, but through a DHCP release method as well."
    },
    {
      "Time_Start": 2517.94,
      "Time_End": 2522.38,
      "Text": " So this is a bit of a cat and mouse game from a response standpoint."
    },
    {
      "Time_Start": 2522.38,
      "Time_End": 2528.5,
      "Text": " We saw one attack, we saw a DHCP request attack, we saw a DHCP decline attack, and then we"
    },
    {
      "Time_Start": 2528.5,
      "Time_End": 2530.02,
      "Text": " saw a DHCP release attack."
    },
    {
      "Time_Start": 2530.02,
      "Time_End": 2535.82,
      "Text": " Every time we would make a change, we would then see within days response and then within"
    },
    {
      "Time_Start": 2535.82,
      "Time_End": 2539.7400000000002,
      "Text": " hours as we got better at it, and then the responses would change over time."
    },
    {
      "Time_Start": 2539.7400000000002,
      "Time_End": 2543.18,
      "Text": " And then later we applied this into the threat modeling context and then ultimately hardening"
    },
    {
      "Time_Start": 2543.18,
      "Time_End": 2544.78,
      "Text": " of these different systems."
    },
    {
      "Time_Start": 2545.7000000000003,
      "Time_End": 2551.1800000000003,
      "Text": " I will say just the attacker or attackers also displayed similar responsiveness time"
    },
    {
      "Time_Start": 2551.1800000000003,
      "Time_End": 2555.86,
      "Text": " when they had definitely had ways of testing and viewing and observing what changes or"
    },
    {
      "Time_Start": 2555.86,
      "Time_End": 2559.46,
      "Text": " behaviors that we made and they responded pretty quickly."
    },
    {
      "Time_Start": 2559.46,
      "Time_End": 2563.38,
      "Text": " So what specifically did we do to defend?"
    },
    {
      "Time_Start": 2563.38,
      "Time_End": 2570.32,
      "Text": " Wouldn't an adversary like to know, but the things I will share here is that we quickly"
    },
    {
      "Time_Start": 2570.32,
      "Time_End": 2574.26,
      "Text": " applied filters to control plane systems to intervene, disable these requests."
    },
    {
      "Time_Start": 2574.26,
      "Time_End": 2576.46,
      "Text": " We set up a dedicated control plane slice."
    },
    {
      "Time_Start": 2576.46,
      "Time_End": 2581.5400000000004,
      "Text": " We had engineers dedicated to this to set up a dedicated slice that was a Ukraine-only"
    },
    {
      "Time_Start": 2581.5400000000004,
      "Time_End": 2586.34,
      "Text": " control plane slice to keep that segmented from the rest of the networks on the fly."
    },
    {
      "Time_Start": 2586.34,
      "Time_End": 2589.3,
      "Text": " And so the control planes were then separated at that point."
    },
    {
      "Time_Start": 2589.3,
      "Time_End": 2593.5800000000004,
      "Text": " That was a pretty prideful moment when we had that new control plane slice online and"
    },
    {
      "Time_Start": 2593.5800000000004,
      "Time_End": 2598.1400000000003,
      "Text": " dynamically responding to those addresses."
    },
    {
      "Time_Start": 2598.1400000000003,
      "Time_End": 2601.9,
      "Text": " And then lastly, I'm going to just kind of give a shout out."
    },
    {
      "Time_Start": 2601.94,
      "Time_End": 2606.1,
      "Text": " There have been a lot of different engineering teams that have been involved in RF attacks."
    },
    {
      "Time_Start": 2606.1,
      "Time_End": 2612.86,
      "Text": " This is not, so we've seen attacks from different cases of attackers that are out there around"
    },
    {
      "Time_Start": 2612.86,
      "Time_End": 2615.7000000000003,
      "Text": " RF attacks as well."
    },
    {
      "Time_Start": 2615.7000000000003,
      "Time_End": 2618.82,
      "Text": " That's not, it's not just these domains that we've had to worry about."
    },
    {
      "Time_Start": 2618.82,
      "Time_End": 2622.54,
      "Text": " And so this has been a very ongoing series of events for us."
    },
    {
      "Time_Start": 2622.54,
      "Time_End": 2625.98,
      "Text": " We've seen eight different changes of RF interference over the last year."
    },
    {
      "Time_Start": 2625.98,
      "Time_End": 2630.1800000000003,
      "Text": " So this has been a pretty active domain."
    },
    {
      "Time_Start": 2630.18,
      "Time_End": 2639.1,
      "Text": " So our ask, service provider networks, especially SATCOM, are especially complex."
    },
    {
      "Time_Start": 2639.1,
      "Time_End": 2642.02,
      "Text": " You know, Leo, Geo, whatever that is, right?"
    },
    {
      "Time_Start": 2642.02,
      "Time_End": 2643.66,
      "Text": " They're complex systems."
    },
    {
      "Time_Start": 2643.66,
      "Time_End": 2649.14,
      "Text": " So as you think about those, we know what complexity introduces in the community, right?"
    },
    {
      "Time_Start": 2649.14,
      "Time_End": 2650.66,
      "Text": " That introduces vulnerabilities."
    },
    {
      "Time_Start": 2650.66,
      "Time_End": 2654.22,
      "Text": " And so you have to think about the system complexities."
    },
    {
      "Time_Start": 2654.22,
      "Time_End": 2658.5,
      "Text": " And so one of the things that we want to share with this community is our ask."
    },
    {
      "Time_Start": 2658.5,
      "Time_End": 2660.82,
      "Text": " So our final kind of slide, our ask."
    },
    {
      "Time_Start": 2660.82,
      "Time_End": 2663.58,
      "Text": " We have a traditional bug bounty program through BugCrowd."
    },
    {
      "Time_Start": 2663.58,
      "Time_End": 2669.78,
      "Text": " We typically have campaigns that are kind of user-facing things like billing systems"
    },
    {
      "Time_Start": 2669.78,
      "Time_End": 2671.34,
      "Text": " or customer support portals."
    },
    {
      "Time_Start": 2671.34,
      "Time_End": 2674.42,
      "Text": " In some cases, it's our corporate infrastructure."
    },
    {
      "Time_Start": 2674.42,
      "Time_End": 2680.26,
      "Text": " So we're announcing an expansion for the research community, kind of if we get vetted researchers"
    },
    {
      "Time_Start": 2680.26,
      "Time_End": 2684.8,
      "Text": " through BugCrowd, we're going to ask for some help by providing terminal kits and service"
    },
    {
      "Time_Start": 2684.8,
      "Time_End": 2690.76,
      "Text": " to selected researchers to be able to test over-the-air methods and attacks for disrupting"
    },
    {
      "Time_Start": 2690.76,
      "Time_End": 2693.52,
      "Text": " a particular canary terminal in there."
    },
    {
      "Time_Start": 2693.52,
      "Time_End": 2696.86,
      "Text": " This is the kind of thing that we would love to engage the research community to think"
    },
    {
      "Time_Start": 2696.86,
      "Time_End": 2701.4,
      "Text": " of ways that maybe we haven't considered yet to manipulate or interact with a terminal."
    },
    {
      "Time_Start": 2701.4,
      "Time_End": 2707.1600000000003,
      "Text": " So basically, interest in resume portfolio for our Responsible Disclosure Program, we'll"
    },
    {
      "Time_Start": 2707.1600000000003,
      "Time_End": 2712.36,
      "Text": " take submissions in September, kind of review those and select some researchers, hopefully"
    },
    {
      "Time_Start": 2712.36,
      "Time_End": 2714.32,
      "Text": " to have some fun with our network."
    },
    {
      "Time_Start": 2714.32,
      "Time_End": 2717.32,
      "Text": " So I want to thank everybody for their time and attention today."
    },
    {
      "Time_Start": 2717.32,
      "Time_End": 2718.32,
      "Text": " I appreciate it."
    },
    {
      "Time_Start": 2718.32,
      "Time_End": 2719.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2719.32,
      "Time_End": 2720.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2720.32,
      "Time_End": 2721.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2721.32,
      "Time_End": 2722.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2722.32,
      "Time_End": 2723.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2723.32,
      "Time_End": 2724.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2724.32,
      "Time_End": 2724.34,
      "Text": " Thank you."
    }
  ]
}