{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.84,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay. Hi. This is kind of my first time on the stage. I was on the 101 panel yesterday"
    },
    {
      "Time_Start": 7.84,
      "Time_End": 14.92,
      "Text": " for just a minute. So I'll go into more detail about the badges. Yeah, I think maybe they're"
    },
    {
      "Time_Start": 14.92,
      "Time_End": 24.48,
      "Text": " bringing one. I'm not sure. Okay. So I'm Mar Williams. I designed the DEF CON badge this"
    },
    {
      "Time_Start": 24.48,
      "Time_End": 37.84,
      "Text": " year. And a little bit more. So I'll get into that. First off, we are on southern"
    },
    {
      "Time_Start": 37.84,
      "Time_End": 45.519999999999996,
      "Text": " Paiute land. And I wasn't speaking Paiute. But what I was speaking might help you later."
    },
    {
      "Time_Start": 45.52,
      "Time_End": 56.040000000000006,
      "Text": " All right. Oh, I can't see this very well. Is there a way I can how do I make this bigger"
    },
    {
      "Time_Start": 56.040000000000006,
      "Time_End": 67.08,
      "Text": " on my screen so I can read it? I'm going to squint. Let's try that. Okay. So you can see"
    },
    {
      "Time_Start": 67.08,
      "Time_End": 76.52,
      "Text": " my art around CON. It's on the signage. Oh, look, there's a whole thing right there. Okay."
    },
    {
      "Time_Start": 76.52,
      "Time_End": 90.28,
      "Text": " Yeah. So I've been doing art for DEF CON for a good number of years. And my first art that I"
    },
    {
      "Time_Start": 90.28,
      "Time_End": 97.68,
      "Text": " did for DEF CON was DEF CON 17. And I've been coming since whatever the last year at the"
    },
    {
      "Time_Start": 97.68,
      "Time_End": 107.52000000000001,
      "Text": " Alexis park was. If anybody knows the year for that. I think it was 13. I don't know. I've"
    },
    {
      "Time_Start": 107.52000000000001,
      "Time_End": 114.76,
      "Text": " chaired and been a founding member of two Denver hacker spaces. I've run a gallery. I've"
    },
    {
      "Time_Start": 114.76,
      "Time_End": 121.48,
      "Text": " painted murals all over the country. And even did one in Beijing for DEF CON China the"
    },
    {
      "Time_Start": 121.48,
      "Time_End": 134.76,
      "Text": " other year. I've had a Denver art museum residency in 2016 where I explored the interactions"
    },
    {
      "Time_Start": 134.76,
      "Time_End": 144.88,
      "Text": " between people and their data online. And yeah. So a lot of people made this badge project"
    },
    {
      "Time_Start": 144.88,
      "Time_End": 156.6,
      "Text": " happen. So I have nutmeg here. And Ada who is always my amazing helper. And Bonnie Finley is"
    },
    {
      "Time_Start": 156.6,
      "Time_End": 165.72,
      "Text": " out there in the audience. She did the 3D modeling of the badge. Okay. And then we have"
    },
    {
      "Time_Start": 165.72,
      "Time_End": 175.32,
      "Text": " polar, onk, trash robot, Kyle Kelly and Edison. So thanks to all these guys. Okay. So what are"
    },
    {
      "Time_Start": 175.32,
      "Time_End": 184.28,
      "Text": " the badges? The badges are actually pen rose tiles. So if you put them together, you can see"
    },
    {
      "Time_Start": 184.28,
      "Time_End": 192.92000000000002,
      "Text": " they kind of tile. So they're an example of a periodic tiling. And this can get kind of"
    },
    {
      "Time_Start": 192.92000000000002,
      "Time_End": 197.72,
      "Text": " complicated. And there's a Wikipedia article you can read about it if you're really curious"
    },
    {
      "Time_Start": 197.72,
      "Time_End": 204.76,
      "Text": " about how pen rose tiles work. But nutmeg here had a really good quote about it. It's the"
    },
    {
      "Time_Start": 204.76,
      "Time_End": 212.64,
      "Text": " most complex jigsaw puzzle you've ever done with just two pieces. And this specific example"
    },
    {
      "Time_Start": 212.64000000000001,
      "Time_End": 220.08,
      "Text": " of pen rose tiling. We've used two rhombi. One is a little fatter and one is a little skinnier."
    },
    {
      "Time_Start": 220.08,
      "Time_End": 227.76000000000002,
      "Text": " And you can see that the human badges are the fat rhombus. Rhombi. And the skinny one is the"
    },
    {
      "Time_Start": 227.76000000000002,
      "Time_End": 235.36,
      "Text": " inhuman. So in physical space, you can actually get a bunch of friends together and put them"
    },
    {
      "Time_Start": 235.36,
      "Time_End": 242.24,
      "Text": " together and you can make a mosaic. Which is kind of cool. So what I wanted to represent by"
    },
    {
      "Time_Start": 242.24,
      "Time_End": 248.96,
      "Text": " doing that was that the DEF CON attendees, we can connect and create these broad and"
    },
    {
      "Time_Start": 248.96,
      "Time_End": 260.40000000000003,
      "Text": " infinitely unique communities. In order to visualize that, we have a project online. If you"
    },
    {
      "Time_Start": 260.40000000000003,
      "Time_End": 267.52,
      "Text": " look on the back of your badge, there's a URL, spux.art. And if you look in your badge pack,"
    },
    {
      "Time_Start": 267.52,
      "Time_End": 274.56,
      "Text": " there's a UUID on the back of this little guy right here. And there's something that you can"
    },
    {
      "Time_Start": 274.56,
      "Time_End": 281.52,
      "Text": " type into the website. And that gives you your own unique tile that you can add and place as"
    },
    {
      "Time_Start": 281.52,
      "Time_End": 286.64,
      "Text": " many times as you want. So you can get together with friends or you can just kind of see how"
    },
    {
      "Time_Start": 286.64,
      "Time_End": 293.35999999999996,
      "Text": " this is evolving naturally over time. So check it out. It's going to be up and down because"
    },
    {
      "Time_Start": 293.36,
      "Time_End": 300.88,
      "Text": " it's DEF CON and we're all hackers and who knows what happens. But check back if it's down"
    },
    {
      "Time_Start": 300.88,
      "Time_End": 307.28000000000003,
      "Text": " for sure. So you'll be able to select your color, shape. You can put your handle in if you"
    },
    {
      "Time_Start": 307.28000000000003,
      "Time_End": 316.32,
      "Text": " choose or you can leave it anonymous. And yeah. We'll just see what it looks like. I'm not"
    },
    {
      "Time_Start": 316.32,
      "Time_End": 322.72,
      "Text": " sure the number of humans this year so far. But like 26,000, something like that, was the"
    },
    {
      "Time_Start": 322.72,
      "Time_End": 334.72,
      "Text": " last number that I was aware of. So let's see if it renders that many. So here's kind of what"
    },
    {
      "Time_Start": 334.72,
      "Time_End": 345.76000000000005,
      "Text": " it looks like last time we got a screen cap of it. So it's growing a little bit at a time."
    },
    {
      "Time_Start": 345.84,
      "Time_End": 351.84,
      "Text": " Okay. And yes, thank you to Nutmeg for the amazing front end development work creating this,"
    },
    {
      "Time_Start": 351.84,
      "Time_End": 362.48,
      "Text": " like, geez, how long? Yeah. Like six weeks. Like super fast project. Yeah. They're amazing."
    },
    {
      "Time_Start": 362.48,
      "Time_End": 371.12,
      "Text": " Okay. So physical badges. All right. So now we get to the part where half of you are very"
    },
    {
      "Time_Start": 371.12,
      "Time_End": 377.04,
      "Text": " upset that you didn't get the real badge. So I'm going to talk more about the manufacturing"
    },
    {
      "Time_Start": 377.04,
      "Time_End": 383.04,
      "Text": " issues and what happened there and what we're trying to do to make it right and what we've"
    },
    {
      "Time_Start": 383.04,
      "Time_End": 389.52,
      "Text": " been trying to do to make it right. But let me talk about what they are. So your human badge is"
    },
    {
      "Time_Start": 389.52,
      "Time_End": 397.36,
      "Text": " made of polycarbonate plastic and it's got a clear polycarbonate chamber on it. The reason I chose"
    },
    {
      "Time_Start": 397.36,
      "Time_End": 403.36,
      "Text": " this material is because I've been to so many cons where my badges are bumping around with my"
    },
    {
      "Time_Start": 403.36,
      "Time_End": 410.08000000000004,
      "Text": " badge life stuff and things are popping off and I'm losing LEDs and I just wanted something"
    },
    {
      "Time_Start": 410.08000000000004,
      "Time_End": 417.2,
      "Text": " really sturdy that wouldn't break. So I haven't seen a broken badge yet and hopefully we're still"
    },
    {
      "Time_Start": 417.2,
      "Time_End": 425.44,
      "Text": " good for a while. So it even has these little feet that pop off and on and it's nice that you"
    },
    {
      "Time_Start": 425.52,
      "Time_End": 433.52,
      "Text": " can just pop them off and on and they don't break. Knock on wood. So that's the badge as"
    },
    {
      "Time_Start": 433.52,
      "Time_End": 444.48,
      "Text": " intended. So because of manufacturing problems, we had to do a backup badge. And early on, we"
    },
    {
      "Time_Start": 444.48,
      "Time_End": 451.52,
      "Text": " decided to put out this shitty add on, right? It's the inserts for your badge and it's the"
    },
    {
      "Time_Start": 451.52,
      "Time_End": 458.88,
      "Text": " non-electronic shitty add on. So you can make it electronic. So we had released the specs for"
    },
    {
      "Time_Start": 458.88,
      "Time_End": 466.4,
      "Text": " the chamber on Defcon.org. If you caught that, maybe you made a cool PCB or something else that"
    },
    {
      "Time_Start": 466.4,
      "Time_End": 473.03999999999996,
      "Text": " fits into this chamber. So we didn't want the people who have created something to be out of"
    },
    {
      "Time_Start": 473.04,
      "Time_End": 482.72,
      "Text": " luck. So what I did was I made this other ‑‑ oh, let's see. Let's move forward a slide so you can"
    },
    {
      "Time_Start": 482.72,
      "Time_End": 491.36,
      "Text": " actually see what I'm talking about. There we go. So you can see the actual human badge there and"
    },
    {
      "Time_Start": 491.36,
      "Time_End": 500.72,
      "Text": " then the backup badges, which about half of you have, they're meant to hold an insert of any"
    },
    {
      "Time_Start": 500.72,
      "Time_End": 508.64000000000004,
      "Text": " size. So it's kind of like a floppy plastic material. It's flexible. I don't have one in me. I'll"
    },
    {
      "Time_Start": 508.64000000000004,
      "Time_End": 515.12,
      "Text": " show you on the stage here. But it will fit any thickness, right? So if you have a PCB with stuff"
    },
    {
      "Time_Start": 515.12,
      "Time_End": 519.84,
      "Text": " all over it, you can pop it in there. And you notice these two little tabs, there's some little"
    },
    {
      "Time_Start": 519.84,
      "Time_End": 526.4,
      "Text": " flanges basically. So you can also put a paper insert in there and it won't fall out. So that"
    },
    {
      "Time_Start": 527.12,
      "Time_End": 532.64,
      "Text": " was the solution for the last‑minute badges. So hopefully that's been working out for people."
    },
    {
      "Time_Start": 532.64,
      "Time_End": 544.88,
      "Text": " And, yeah, doing the best we can there. Okay. So, yeah, I'll talk about how ‑‑ what the design"
    },
    {
      "Time_Start": 544.88,
      "Time_End": 554.48,
      "Text": " process was for this badge. So we started way back in January. Was that right? Okay. Yeah,"
    },
    {
      "Time_Start": 554.48,
      "Time_End": 560.0,
      "Text": " January. And we were looking at all kinds of different concepts. Like we were trying to figure"
    },
    {
      "Time_Start": 560.0,
      "Time_End": 567.9200000000001,
      "Text": " out if we could do like blow molded badges and have like ferro fluid inside and you could interact"
    },
    {
      "Time_Start": 567.9200000000001,
      "Time_End": 573.6800000000001,
      "Text": " with magnets, you know, all kinds of stuff. And we just threw a bunch of ideas around. And"
    },
    {
      "Time_Start": 573.6800000000001,
      "Time_End": 579.28,
      "Text": " eventually kind of trimmed down and then land on something. So we landed on these Penrose tiles."
    },
    {
      "Time_Start": 580.24,
      "Time_End": 590.8,
      "Text": " So, yeah, from there ‑‑ I'll go to the next slide so you can see it. Yeah, so this was sort"
    },
    {
      "Time_Start": 590.8,
      "Time_End": 598.72,
      "Text": " of the sketching concept portion of it. Making our first mockups out of, you know, paper and"
    },
    {
      "Time_Start": 598.72,
      "Time_End": 610.72,
      "Text": " laser cutting stuff and 3D printing. So we hit a lot of challenges. But, you know, true hacker"
    },
    {
      "Time_Start": 610.72,
      "Time_End": 620.48,
      "Text": " fashion, we just go into stuff not really knowing what we're doing. But that's the point. So, you"
    },
    {
      "Time_Start": 620.48,
      "Time_End": 627.12,
      "Text": " know, there's some challenges there. We had to ‑‑ we had to create a 3D model that was set"
    },
    {
      "Time_Start": 627.12,
      "Time_End": 633.36,
      "Text": " up for injection molding. So you have to do very specific things there. Like make sure that ‑‑"
    },
    {
      "Time_Start": 633.36,
      "Time_End": 640.88,
      "Text": " where's my notes here? See, Bonnie should be up here because she could speak to it a little"
    },
    {
      "Time_Start": 640.88,
      "Time_End": 650.72,
      "Text": " better since she did the 3D model. But basically you have to make it so that it pops out of the"
    },
    {
      "Time_Start": 650.72,
      "Time_End": 655.92,
      "Text": " mold easily and the plastic flows around the way it's supposed to. So that was a whole learning"
    },
    {
      "Time_Start": 655.92,
      "Time_End": 665.04,
      "Text": " process there. More than that, manufacturing challenges. So let me take you on a little ride"
    },
    {
      "Time_Start": 665.04,
      "Time_End": 674.8,
      "Text": " here. So we started out trying to figure out how do we print on these in a way that the print"
    },
    {
      "Time_Start": 674.8,
      "Time_End": 679.76,
      "Text": " isn't just going to scrape off. Like we didn't initially want to use stickers because, you know,"
    },
    {
      "Time_Start": 679.76,
      "Time_End": 685.4399999999999,
      "Text": " then stickers come off and get put everywhere. So that kind of thing. Once we started getting"
    },
    {
      "Time_Start": 685.44,
      "Time_End": 692.24,
      "Text": " into the process and they're being actually produced, we ran into issues with custom"
    },
    {
      "Time_Start": 692.24,
      "Time_End": 698.4000000000001,
      "Text": " colorants. There's 11 of the inhuman badges and they all need to be a specific color and"
    },
    {
      "Time_Start": 698.4000000000001,
      "Time_End": 704.48,
      "Text": " manufacturers don't carry all those colors. So like I'm on the phone with manufacturers trying"
    },
    {
      "Time_Start": 704.48,
      "Time_End": 710.1600000000001,
      "Text": " to get, you know, just the colorant people, trying to get them to send colorant to places and"
    },
    {
      "Time_Start": 710.1600000000001,
      "Time_End": 714.08,
      "Text": " they're running out of colorant and then like we're having to do backup colors and all this"
    },
    {
      "Time_Start": 714.08,
      "Time_End": 720.8000000000001,
      "Text": " stuff. And then right as we're starting to get our badges in, the molds break, right? And these"
    },
    {
      "Time_Start": 720.8000000000001,
      "Time_End": 726.64,
      "Text": " are the permanent, they're made out of steel or something. They're not supposed to break. But"
    },
    {
      "Time_Start": 726.64,
      "Time_End": 734.4000000000001,
      "Text": " they broke. And they're like, that's okay. We'll repair that. And I'm like, well, do we need like"
    },
    {
      "Time_Start": 734.4000000000001,
      "Time_End": 739.76,
      "Text": " a backup mold? And they're like, no, no, no. Once you repair one of these things, it's like"
    },
    {
      "Time_Start": 739.76,
      "Time_End": 746.4,
      "Text": " setting a broken bone. Like it'll be even stronger the next time. Okay. We don't need a backup one."
    },
    {
      "Time_Start": 746.4,
      "Time_End": 752.16,
      "Text": " We'll keep going. And so we got the backup one going and popped out, you know, a couple thousand"
    },
    {
      "Time_Start": 752.16,
      "Time_End": 758.8,
      "Text": " badges and then it's down again. And what happened? Oh, my God. Oh, you know, this just happens"
    },
    {
      "Time_Start": 758.8,
      "Time_End": 763.68,
      "Text": " sometimes in manufacturing. So I've heard that story a lot. This is just how it happens. But"
    },
    {
      "Time_Start": 763.68,
      "Time_End": 768.8,
      "Text": " it's always like after the fact, right? So anyway, so they broke a second time. Takes more time to"
    },
    {
      "Time_Start": 768.8800000000001,
      "Time_End": 779.36,
      "Text": " get it going again. Third time. That was about a week ago. So the mold is currently backup repaired"
    },
    {
      "Time_Start": 779.36,
      "Time_End": 786.6400000000001,
      "Text": " again and in production. And if we all cross our fingers really tightly, there might be some badges"
    },
    {
      "Time_Start": 786.6400000000001,
      "Time_End": 791.2800000000001,
      "Text": " to trade over the weekend. And those of you with the floppy badges might be able to trade in."
    },
    {
      "Time_Start": 792.0799999999999,
      "Time_End": 801.76,
      "Text": " So we're working on that as best we can. All right. So some last minute hustles to try and get"
    },
    {
      "Time_Start": 801.76,
      "Time_End": 810.56,
      "Text": " these problems solved is we had Bonnie here fly to Chicago and rent a truck and put a bunch of badges"
    },
    {
      "Time_Start": 810.56,
      "Time_End": 819.92,
      "Text": " in the back and drive it over the weekend all the way down to Vegas. We had to swap some of our"
    },
    {
      "Time_Start": 819.9200000000001,
      "Time_End": 829.7600000000001,
      "Text": " pad printing for stickers. We actually were trying to make backup badges at home just for the"
    },
    {
      "Time_Start": 829.7600000000001,
      "Time_End": 835.84,
      "Text": " inhuman badges that we were missing. So we're like we got piles of silicone and polyurethane and"
    },
    {
      "Time_Start": 835.84,
      "Time_End": 840.6400000000001,
      "Text": " we're pouring badges and we actually have some cool artful badges that we made out of that"
    },
    {
      "Time_Start": 840.6400000000001,
      "Time_End": 847.2,
      "Text": " process. Luckily we didn't need those but we went to great measures to try and get all these badges"
    },
    {
      "Time_Start": 847.2,
      "Time_End": 857.2,
      "Text": " in here. All right. And so then the other ‑‑ oh, yeah, I have some photos here. There's like a"
    },
    {
      "Time_Start": 857.2,
      "Time_End": 864.72,
      "Text": " badge on a floor tile in Nebraska somewhere. Lincoln, Nebraska. Your badges visited Lincoln,"
    },
    {
      "Time_Start": 864.72,
      "Time_End": 875.12,
      "Text": " Nebraska on the way. All right. Yeah. So and then if we can't get you all badges, we're looking at a"
    },
    {
      "Time_Start": 875.2,
      "Time_End": 882.08,
      "Text": " plan, no promises for if you attend next year, bring your floppy plastic badge and then we can"
    },
    {
      "Time_Start": 882.08,
      "Time_End": 890.72,
      "Text": " trade it out for the real badge next year. So at least you have it then. Okay. So the lanyard"
    },
    {
      "Time_Start": 890.72,
      "Time_End": 898.08,
      "Text": " puzzle. If you've noticed on your lanyards there is some characters. I can't say much about what"
    },
    {
      "Time_Start": 898.08,
      "Time_End": 904.28,
      "Text": " it is but you have the weekend to try and figure it out. You won't find an Uber lanyard until"
    },
    {
      "Time_Start": 904.28,
      "Time_End": 911.88,
      "Text": " Sunday. So there's an image up of the Uber lanyard. So give it an eyeball if you're working on"
    },
    {
      "Time_Start": 911.88,
      "Time_End": 924.92,
      "Text": " the puzzle. All right. I have been a working artist for all of my adult life and one thing that"
    },
    {
      "Time_Start": 924.92,
      "Time_End": 931.8399999999999,
      "Text": " I know well is that good design is invisible. And I think they say the same thing about"
    },
    {
      "Time_Start": 931.88,
      "Time_End": 942.6800000000001,
      "Text": " sysadmins. So like an example that I can think of are logos are an art of subtraction. So it's"
    },
    {
      "Time_Start": 942.6800000000001,
      "Time_End": 948.72,
      "Text": " not immediately apparent what happens behind the scenes. There's just a lot of tweaking and"
    },
    {
      "Time_Start": 948.72,
      "Time_End": 956.72,
      "Text": " research and all of that until you get it pixel perfect. This is a non-electronic year. So"
    },
    {
      "Time_Start": 957.6,
      "Time_End": 965.0,
      "Text": " working with those unbounds, there's no bells and whistles to show off. You can't see all the"
    },
    {
      "Time_Start": 965.0,
      "Time_End": 970.84,
      "Text": " parts that are going into this. So we end up with something that is rather simplistic. And"
    },
    {
      "Time_Start": 970.84,
      "Time_End": 978.76,
      "Text": " then my hope there is that in interacting with these, they do what we want them to do is to"
    },
    {
      "Time_Start": 978.76,
      "Time_End": 986.0400000000001,
      "Text": " get you all to showcase who you are, to use these chambers, to basically repeat what"
    },
    {
      "Time_Start": 986.0400000000001,
      "Time_End": 992.0400000000001,
      "Text": " happens at DEF CON but give it a place. People show off their crews, their individuality,"
    },
    {
      "Time_Start": 992.0400000000001,
      "Time_End": 999.6600000000001,
      "Text": " they make art and put it in these badges, on the badges, on the lanyards, they give each"
    },
    {
      "Time_Start": 999.6600000000001,
      "Time_End": 1005.6600000000001,
      "Text": " other little tokens. So that's the point of this. There are so many artists in this crowd, it's"
    },
    {
      "Time_Start": 1006.66,
      "Time_End": 1012.66,
      "Text": " so adjacent to being a hacker. And I love to see it. So that's what I wanted to do there. So"
    },
    {
      "Time_Start": 1019.9,
      "Time_End": 1025.1599999999999,
      "Text": " thank you for allowing me to share this process with you. And thank you for being so"
    },
    {
      "Time_Start": 1025.1599999999999,
      "Time_End": 1031.28,
      "Text": " understanding the people that I've talked to about the badge issues. And I hope we can make"
    },
    {
      "Time_Start": 1031.28,
      "Time_End": 1035.28,
      "Text": " this right for everyone."
    },
    {
      "Time_Start": 1035.28,
      "Time_End": 1041.28,
      "Text": " Okay. So Yoko Key, shoot any questions at me. And after this talk, you can find me on"
    },
    {
      "Time_Start": 1053.3999999999999,
      "Time_End": 1060.52,
      "Text": " Instagram as Spuxo. Patreon.com Spux. If you like my work, I send stuff in the mail to"
    },
    {
      "Time_Start": 1060.52,
      "Time_End": 1065.72,
      "Text": " people monthly. And I've been doing that for some years. So it's pretty fun. And I'll also"
    },
    {
      "Time_Start": 1065.72,
      "Time_End": 1071.72,
      "Text": " be in the vendor area selling art and swag. So, yeah. I don't have my glasses on. So you're"
    },
    {
      "Time_Start": 1074.98,
      "Time_End": 1080.98,
      "Text": " going to have to wave yourself around if you want to ask me a question. Anybody?"
    },
    {
      "Time_Start": 1090.52,
      "Time_End": 1096.52,
      "Text": " All right. Well. Okay. Sounds like a plan. Yeah. That's good. All right. So this is"
    },
    {
      "Time_Start": 1114.1399999999999,
      "Time_End": 1119.4,
      "Text": " after the talk. Instead of before the talk because we ran out of time. But first time"
    },
    {
      "Time_Start": 1119.4,
      "Time_End": 1125.4,
      "Text": " speaker. Do a shot."
    }
  ]
}