{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 13.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good morning, everyone. Yeah, my name is Adrian Dabrowski. My colleague Gabriel Dabrowski."
    },
    {
      "Time_Start": 13.0,
      "Time_End": 20.76,
      "Text": " This is work together with Wilfred Meyer and Edgar Weipel. We will be talking about decoupling"
    },
    {
      "Time_Start": 20.76,
      "Time_End": 28.96,
      "Text": " the SIM card from the mobile phone or the modem to get all kinds of fancy measurements."
    },
    {
      "Time_Start": 28.96,
      "Time_End": 34.3,
      "Text": " And it's called cellular carriers hate this trick. I will explain it why. Using SIM tunnels"
    },
    {
      "Time_Start": 34.3,
      "Time_End": 41.42,
      "Text": " to travel at light speed. So for the motivational example, let's assume we have like three medieval"
    },
    {
      "Time_Start": 41.42,
      "Time_End": 49.34,
      "Text": " city states and they recently invested into technology and so they switched from land"
    },
    {
      "Time_Start": 49.34,
      "Time_End": 59.06,
      "Text": " line to wireless, to cellular networks. And we have like all this new mobile phone operators"
    },
    {
      "Time_Start": 59.06,
      "Time_End": 66.72,
      "Text": " popping up like night mobile or Afro and Excalibur with the sword in there and dragon phone and"
    },
    {
      "Time_Start": 66.72,
      "Time_End": 75.98,
      "Text": " all the others. And with that, we also had like an explosion of new social networks."
    },
    {
      "Time_Start": 75.98,
      "Time_End": 83.86,
      "Text": " And we have something like royal tweet and peasant post. And all these people are like"
    },
    {
      "Time_Start": 83.86,
      "Time_End": 89.42,
      "Text": " super hooked on social networks. So their mobile phone operators think, well, how do"
    },
    {
      "Time_Start": 89.42,
      "Time_End": 97.02000000000001,
      "Text": " we target some demographics that are like social networks? So they come up with this"
    },
    {
      "Time_Start": 97.02000000000001,
      "Time_End": 103.02000000000001,
      "Text": " new data plans where there is something already included like video streaming or messaging"
    },
    {
      "Time_Start": 103.1,
      "Time_End": 110.56,
      "Text": " or social network apps. And we have like, it's super transformative. It's very addictive."
    },
    {
      "Time_Start": 110.56,
      "Time_End": 118.56,
      "Text": " You have all these people spending hours and hours on the social networks. And I heard the"
    },
    {
      "Time_Start": 118.56,
      "Time_End": 125.44,
      "Text": " king over there got actually so much hooked on it, he's considering buying royal tweet and"
    },
    {
      "Time_Start": 125.44,
      "Time_End": 131.44,
      "Text": " renaming it to the Roman numeral of 10. And so, this is Archibald. He recently switched from"
    },
    {
      "Time_Start": 135.78,
      "Time_End": 141.78,
      "Text": " alchemy to cellular network research. And he also has a few friends abroad and he also"
    },
    {
      "Time_Start": 145.24,
      "Time_End": 151.44,
      "Text": " already found a few inconsistencies and maybe vulnerabilities in his local network. But"
    },
    {
      "Time_Start": 151.44,
      "Time_End": 157.44,
      "Text": " he's a prisoner of his own city state. When he can travel, he can do the measurements abroad"
    },
    {
      "Time_Start": 159.48,
      "Time_End": 166.12,
      "Text": " in another network. But also when he's visiting his friends, he actually would like to spend"
    },
    {
      "Time_Start": 166.12,
      "Time_End": 174.12,
      "Text": " time with the friends. And also it's getting very expensive. So why is roaming so complex? Or"
    },
    {
      "Time_Start": 174.12,
      "Time_End": 181.32,
      "Text": " why is it so interesting? The interesting thing with roaming is that you have your home"
    },
    {
      "Time_Start": 181.32,
      "Time_End": 187.32,
      "Text": " network operator on one side and your visiting mobile network operator that's using some"
    },
    {
      "Time_Start": 188.82,
      "Time_End": 194.82,
      "Text": " interconnection in between. Pretend to you as the customer that they're providing a"
    },
    {
      "Time_Start": 196.7,
      "Time_End": 203.4,
      "Text": " singular set of services and a consistent set of services. Although they're using completely"
    },
    {
      "Time_Start": 203.4,
      "Time_End": 209.4,
      "Text": " different configurations, hardware, software, manufacturers, what not. And so, the"
    },
    {
      "Time_Start": 211.9,
      "Time_End": 217.9,
      "Text": " closer look, we see that this picture of a consistent service pretty fast falls apart. And"
    },
    {
      "Time_Start": 221.94,
      "Time_End": 227.7,
      "Text": " you might wonder, well, when I'm abroad, how is my traffic actually routed? And there are"
    },
    {
      "Time_Start": 227.7,
      "Time_End": 234.74,
      "Text": " two ways. You can have either local breakout or you can have home routing. Interestingly,"
    },
    {
      "Time_Start": 234.74,
      "Time_End": 239.5,
      "Text": " depending on the service that you're using, it will either use one or the other. So for"
    },
    {
      "Time_Start": 239.5,
      "Time_End": 245.5,
      "Text": " example, if you're using data, that's usually home routed. So even if you're abroad, all your"
    },
    {
      "Time_Start": 247.08,
      "Time_End": 253.08,
      "Text": " data will exit with an IP address of your home network operator. So you can't use all the"
    },
    {
      "Time_Start": 254.38,
      "Time_End": 260.38,
      "Text": " fancy geo-locked services in another country. Unless you connect to the Wi-Fi. For other"
    },
    {
      "Time_Start": 262.16,
      "Time_End": 268.16,
      "Text": " services like voice, you have local breakout. Back in the 1980s when GSM was specified,"
    },
    {
      "Time_Start": 269.92,
      "Time_End": 275.92,
      "Text": " or even today, voice is considered as a time critical service. So you like to get it out"
    },
    {
      "Time_Start": 279.84,
      "Time_End": 286.62,
      "Text": " into the public networks as fast as possible with a route as short as possible. So"
    },
    {
      "Time_Start": 286.62,
      "Time_End": 292.62,
      "Text": " technically, for example, voice roaming works by the visiting network operator issuing you a"
    },
    {
      "Time_Start": 293.62,
      "Time_End": 299.62,
      "Text": " temporary phone number in that country that you're visiting. And your home network"
    },
    {
      "Time_Start": 303.2,
      "Time_End": 309.2,
      "Text": " operator then reroutes all the incoming calls to this new temporary phone number. So you"
    },
    {
      "Time_Start": 311.08,
      "Time_End": 317.08,
      "Text": " have like all the small differences in roaming. And so while Archibald likes to travel, it's"
    },
    {
      "Time_Start": 317.41999999999996,
      "Time_End": 323.41999999999996,
      "Text": " getting very expensive. And all this testing can be quite tedious. Let's look at an example."
    },
    {
      "Time_Start": 327.41999999999996,
      "Time_End": 333.41999999999996,
      "Text": " So whoever travels in internationally for DEF CON might have received that SMS. That's"
    },
    {
      "Time_Start": 335.91999999999996,
      "Time_End": 341.91999999999996,
      "Text": " because AT&T doesn't support voice roaming for most European carriers. However, it does"
    },
    {
      "Time_Start": 342.22,
      "Time_End": 348.22,
      "Text": " support data and SMS. So you might even get billed for voice traffic while in the U.S."
    },
    {
      "Time_Start": 353.84000000000003,
      "Time_End": 359.84000000000003,
      "Text": " without being able to use voice. And so you have all the small oddities. And let's see, can"
    },
    {
      "Time_Start": 362.0,
      "Time_End": 368.96000000000004,
      "Text": " we measure that in our toy example? So let's take one SIM card. We have like one home"
    },
    {
      "Time_Start": 368.96,
      "Time_End": 374.96,
      "Text": " operator plus three network operators in one other city state and in the other. However,"
    },
    {
      "Time_Start": 378.5,
      "Time_End": 384.5,
      "Text": " that's just one SIM card. Of course, there are multiple carriers within our home country. So"
    },
    {
      "Time_Start": 386.5,
      "Time_End": 392.5,
      "Text": " we'll have to buy multiple SIM cards. But there are also more than one data plan which"
    },
    {
      "Time_Start": 393.12,
      "Time_End": 399.12,
      "Text": " might be important because they support different services. So we'll have to multiply by"
    },
    {
      "Time_Start": 402.62,
      "Time_End": 407.5,
      "Text": " that. But then, of course, you have all the network operators in the other city states as"
    },
    {
      "Time_Start": 407.5,
      "Time_End": 413.5,
      "Text": " well. And we end up just in our toy example with 190 combinations. So clearly that doesn't"
    },
    {
      "Time_Start": 414.42,
      "Time_End": 420.42,
      "Text": " scale well. And what are the possibilities here for Archibald to continue his work? Well, he"
    },
    {
      "Time_Start": 425.54,
      "Time_End": 431.88,
      "Text": " could buy a lot of SIM cards and a lot of modems and position them everywhere in the"
    },
    {
      "Time_Start": 431.88,
      "Time_End": 437.88,
      "Text": " free countries. But the hardware costs, the monthly costs and soon after that, bankruptcy. So"
    },
    {
      "Time_Start": 438.88,
      "Time_End": 444.88,
      "Text": " that doesn't work. Well, you could have like one modem in each country and then ship SIM cards"
    },
    {
      "Time_Start": 447.18,
      "Time_End": 453.18,
      "Text": " around. But that has like large overhead and the shipping times and a lot of manual labor. Or"
    },
    {
      "Time_Start": 456.0,
      "Time_End": 462.04,
      "Text": " what we did is try to decouple the SIM card from the modem. So usually the SIM card and the"
    },
    {
      "Time_Start": 462.04,
      "Time_End": 468.88,
      "Text": " modem are like one unit. And they communicate with each other. But what if we can extend"
    },
    {
      "Time_Start": 468.88,
      "Time_End": 474.88,
      "Text": " this internal bus all around the globe? And so that's what Mobile Atlas does. The academic"
    },
    {
      "Time_Start": 478.54,
      "Time_End": 485.16,
      "Text": " name is Geographically Decoupling Cellular Measurements and Exploitation. And with that we"
    },
    {
      "Time_Start": 485.20000000000005,
      "Time_End": 492.08000000000004,
      "Text": " can now like solid state travel. We can connect SIM cards to different places all around, to"
    },
    {
      "Time_Start": 492.08000000000004,
      "Time_End": 499.0,
      "Text": " our modems all around the world. And pretend to the network operators that we are in that"
    },
    {
      "Time_Start": 499.0,
      "Time_End": 505.08000000000004,
      "Text": " country and do our measurements there and tests. So what were our goals with the project?"
    },
    {
      "Time_Start": 505.08000000000004,
      "Time_End": 511.28000000000003,
      "Text": " Well, of course, scalability, automatability. But also an important point is control the"
    },
    {
      "Time_Start": 511.28000000000003,
      "Time_End": 517.32,
      "Text": " background noise. If you use like an off the shelf cellular phone, then you have like a"
    },
    {
      "Time_Start": 517.32,
      "Time_End": 524.02,
      "Text": " full-blown operating system on it with all kinds of background tasks. And that might"
    },
    {
      "Time_Start": 524.02,
      "Time_End": 528.52,
      "Text": " interfere with the measurements you are doing or with the exploits you are testing."
    },
    {
      "Time_Start": 528.52,
      "Time_End": 534.52,
      "Text": " Depending on what you are precisely doing. And we also would like to have like the full feature"
    },
    {
      "Time_Start": 535.52,
      "Time_End": 540.52,
      "Text": " spectrum. So for those who know RIPE Atlas, so our name Mobile Atlas basically is an homage to"
    },
    {
      "Time_Start": 545.14,
      "Time_End": 550.14,
      "Text": " RIPE Atlas. RIPE Atlas is a probe system developed and maintained by the European internet"
    },
    {
      "Time_Start": 553.56,
      "Time_End": 561.06,
      "Text": " authorities or administration. And they have like the probes and you can do pings and trace"
    },
    {
      "Time_Start": 561.0600000000001,
      "Time_End": 567.44,
      "Text": " routes between different autonomous systems. However, in a cellular world, we have more than"
    },
    {
      "Time_Start": 567.44,
      "Time_End": 573.48,
      "Text": " just an internet or data connection. We also have like phone calls, we have USSDs, we have text"
    },
    {
      "Time_Start": 573.48,
      "Time_End": 579.48,
      "Text": " messaging. So we would like to ideally to test or have a test system that works on all these"
    },
    {
      "Time_Start": 581.86,
      "Time_End": 587.86,
      "Text": " features. So here's a short diagram. Traditional combinatorial explosion, you put in probes in"
    },
    {
      "Time_Start": 588.48,
      "Time_End": 594.48,
      "Text": " different countries and replicate all the SIM cards. Or you have something where you can"
    },
    {
      "Time_Start": 595.86,
      "Time_End": 601.86,
      "Text": " tunnel the SIM cards to one place and save a lot on costs. So basically that's what we did."
    },
    {
      "Time_Start": 605.78,
      "Time_End": 612.74,
      "Text": " We decoupled the SIM card, we can have a SIM card reader connected to a computer and we have"
    },
    {
      "Time_Start": 612.74,
      "Time_End": 618.74,
      "Text": " then a TCP tunnel to our measurement probes and replicate the SIM card there. And so like"
    },
    {
      "Time_Start": 622.12,
      "Time_End": 628.04,
      "Text": " add a management on top of it and you end up with a system on the left side you have the probes,"
    },
    {
      "Time_Start": 628.04,
      "Time_End": 632.74,
      "Text": " on the right you have the SIM cards. And you have a SIM provider which is basically just a"
    },
    {
      "Time_Start": 632.74,
      "Time_End": 638.74,
      "Text": " piece of software that connects to a PCSC or serial or even an Android phone and routes the SIM"
    },
    {
      "Time_Start": 639.74,
      "Time_End": 646.78,
      "Text": " card traffic to the probes. It needs to be an online connection because the SIM cards"
    },
    {
      "Time_Start": 646.78,
      "Time_End": 652.54,
      "Text": " produce all the cryptographic material that we need on the network side to authenticate and to"
    },
    {
      "Time_Start": 652.54,
      "Time_End": 658.54,
      "Text": " encrypt the traffic there. So this has been a project ongoing for 5 years now. So we have, you"
    },
    {
      "Time_Start": 659.54,
      "Time_End": 665.54,
      "Text": " can see our left probe which looks very crude. So we put in, we had like a Raspberry Pi and a"
    },
    {
      "Time_Start": 670.5,
      "Time_End": 676.5,
      "Text": " USB adapter and an M2 modem attached to this adapter and because everything was very loose in"
    },
    {
      "Time_Start": 678.3399999999999,
      "Time_End": 685.04,
      "Text": " the box we put in like this yellow piece of foam in there to like hold everything in place. But"
    },
    {
      "Time_Start": 685.04,
      "Time_End": 691.04,
      "Text": " the current version looks much more professional. It's a shield on top of the Raspberry Pi."
    },
    {
      "Time_Start": 693.54,
      "Time_End": 699.54,
      "Text": " And so then the only other thing you need is an Ethernet connection for the uplink. And so on"
    },
    {
      "Time_Start": 701.54,
      "Time_End": 706.3399999999999,
      "Text": " one side we have the SIM provider which is basically just this piece of software that works"
    },
    {
      "Time_Start": 706.3399999999999,
      "Time_End": 712.3399999999999,
      "Text": " with all the usual SIM providers, SIM card readers. You can use the more expensive PCSC"
    },
    {
      "Time_Start": 715.5,
      "Time_End": 721.92,
      "Text": " readers or the very cheap Chinese SIM readers that only speak a very crude serial protocol or"
    },
    {
      "Time_Start": 721.92,
      "Time_End": 727.92,
      "Text": " you can even use an Android phone. Oh, we didn't have the picture. Okay, maybe it's later in our"
    },
    {
      "Time_Start": 731.7199999999999,
      "Time_End": 737.7199999999999,
      "Text": " slides. So I briefly want to talk about the challenges that we faced and have to pick like 2"
    },
    {
      "Time_Start": 738.72,
      "Time_End": 744.72,
      "Text": " because of time. So let's talk about the SIM interface and the SIM protocol. So the SIM card"
    },
    {
      "Time_Start": 749.98,
      "Time_End": 757.4,
      "Text": " protocol is basically a smart card protocol but it's now 40 years old. So you have a lot of"
    },
    {
      "Time_Start": 757.4,
      "Time_End": 763.4,
      "Text": " different options, voltages, speeds and all kinds of that. And also it was designed to be, to"
    },
    {
      "Time_Start": 763.9399999999999,
      "Time_End": 769.9399999999999,
      "Text": " work within one device. So with very low latencies. When we stretch that over half of the"
    },
    {
      "Time_Start": 772.66,
      "Time_End": 778.66,
      "Text": " globe, we need a few techniques to cope with the latency. So you can see for example, this is"
    },
    {
      "Time_Start": 783.28,
      "Time_End": 789.28,
      "Text": " how we connected it to the SIM slot of the modem to the GPIO pins of the Raspberry Pi. We just"
    },
    {
      "Time_Start": 790.28,
      "Time_End": 796.28,
      "Text": " made a very small simple adapter that we slot in. Our first version was actually directly"
    },
    {
      "Time_Start": 798.5799999999999,
      "Time_End": 804.5799999999999,
      "Text": " soldered in. And you can see just one component on it and that's a short cut diode. Why is that?"
    },
    {
      "Time_Start": 806.62,
      "Time_End": 812.62,
      "Text": " Because the SIM card IO pin is actually an open collector bus. So on the Raspberry Pi side, we"
    },
    {
      "Time_Start": 813.08,
      "Time_End": 819.08,
      "Text": " need a short cut diode to split up the send and receive channels for the UART. And the pull"
    },
    {
      "Time_Start": 823.24,
      "Time_End": 829.24,
      "Text": " up resistor is already provided by the modem. Luckily for us, this reduces a lot of complexity"
    },
    {
      "Time_Start": 833.16,
      "Time_End": 839.16,
      "Text": " for us. We can negotiate speeds and voltages and other parameters independently on the SIM"
    },
    {
      "Time_Start": 840.16,
      "Time_End": 846.16,
      "Text": " provider side and on the modem side. We don't have to pass it one on one. So that eases much"
    },
    {
      "Time_Start": 851.5799999999999,
      "Time_End": 857.5799999999999,
      "Text": " of the problems. We can also add waiting time extensions and we tested it for latencies up to"
    },
    {
      "Time_Start": 859.66,
      "Time_End": 865.16,
      "Text": " 1,000 milliseconds. So this should be actually be good enough even for like Starlink"
    },
    {
      "Time_Start": 865.16,
      "Time_End": 871.78,
      "Text": " connections. And future work we'd like to also locally emulate some of the files that are"
    },
    {
      "Time_Start": 871.78,
      "Time_End": 877.78,
      "Text": " not necessary for the modem or for the measurements to work. The second problem that I like to"
    },
    {
      "Time_Start": 881.16,
      "Time_End": 887.16,
      "Text": " mention is traffic metering. And we need a way to control the background traffic. So let's"
    },
    {
      "Time_Start": 888.16,
      "Time_End": 894.16,
      "Text": " step back. So some of the tests we want to do is test the accounting, the data accounting of"
    },
    {
      "Time_Start": 897.28,
      "Time_End": 903.0,
      "Text": " network operators. So we need very precise measurements on what we are sending to the"
    },
    {
      "Time_Start": 903.0,
      "Time_End": 909.1999999999999,
      "Text": " network and what is then accounted. And so the background traffic is something that will mess"
    },
    {
      "Time_Start": 909.1999999999999,
      "Time_End": 915.5,
      "Text": " up with these measurements. And the other thing is that the call data records often are"
    },
    {
      "Time_Start": 915.54,
      "Time_End": 921.54,
      "Text": " shown on the operator website with a large delay. So domestically this can be like hours but"
    },
    {
      "Time_Start": 923.08,
      "Time_End": 929.08,
      "Text": " internationally this can be something around days. And also there is no standardized way to"
    },
    {
      "Time_Start": 931.2,
      "Time_End": 937.2,
      "Text": " check your account balance. So some operators use an app or web application. Some can use or"
    },
    {
      "Time_Start": 937.62,
      "Time_End": 943.62,
      "Text": " support USSD codes or SMS inquiries. So to eliminate background traffic we basically use"
    },
    {
      "Time_Start": 949.62,
      "Time_End": 955.62,
      "Text": " Linux network spaces. That's the same thing that Docker does. So our measurement process is"
    },
    {
      "Time_Start": 959.0400000000001,
      "Time_End": 965.0400000000001,
      "Text": " put into a separate name space that's then connected to the modem and only that one talks to"
    },
    {
      "Time_Start": 965.92,
      "Time_End": 972.42,
      "Text": " the modem. So all the traffic from that process group is routed through the modem and all the"
    },
    {
      "Time_Start": 972.42,
      "Time_End": 978.42,
      "Text": " other things like the management suite is all over the VPN. They're completely separated. How"
    },
    {
      "Time_Start": 982.1999999999999,
      "Time_End": 988.1999999999999,
      "Text": " do we deal with delayed traffic accounting? Well we came up with a binary encoding. So what"
    },
    {
      "Time_Start": 989.2,
      "Time_End": 995.2,
      "Text": " we do is like for example the first test is like one megabyte in size. The second test is two"
    },
    {
      "Time_Start": 996.9000000000001,
      "Time_End": 1002.9000000000001,
      "Text": " megabyte. The third one is four. And the fourth test is eight and so on. So one of these also"
    },
    {
      "Time_Start": 1005.86,
      "Time_End": 1012.36,
      "Text": " will be a control group so that at the end like maybe a day later when it finally shows up on"
    },
    {
      "Time_Start": 1012.4,
      "Time_End": 1018.0600000000001,
      "Text": " the accounting balance we can then distinguish exactly which test was accounted and which"
    },
    {
      "Time_Start": 1018.0600000000001,
      "Time_End": 1024.06,
      "Text": " wasn't. Like which traffic group. You might ask well you do all this thing to like tunnel"
    },
    {
      "Time_Start": 1028.06,
      "Time_End": 1034.56,
      "Text": " physical SIM cards across the globe. What's about e-SIMs? The problem with e-SIMs even though"
    },
    {
      "Time_Start": 1034.56,
      "Time_End": 1041.14,
      "Text": " for example in the US they're pretty prevalent. They're not widely available everywhere and"
    },
    {
      "Time_Start": 1041.18,
      "Time_End": 1047.18,
      "Text": " also it usually tends to only cover some data plans and not all. And they're not always easy"
    },
    {
      "Time_Start": 1050.1000000000001,
      "Time_End": 1056.1000000000001,
      "Text": " transferable between devices. So what we actually can do is we can use Bluetooth R sub protocol"
    },
    {
      "Time_Start": 1058.5200000000002,
      "Time_End": 1064.5200000000002,
      "Text": " to connect to an Android phone that then shares the SIM card over Bluetooth to our system."
    },
    {
      "Time_Start": 1064.94,
      "Time_End": 1070.94,
      "Text": " The SIM access profile was actually developed somewhere in the 90s to allow cars to connect"
    },
    {
      "Time_Start": 1078.1,
      "Time_End": 1083.86,
      "Text": " to your phone and then use the SIM card on your phone and the modem from the car. But today"
    },
    {
      "Time_Start": 1083.86,
      "Time_End": 1089.94,
      "Text": " this is rarely actually used. So the only thing you need to do on an Android is make the e-SIM"
    },
    {
      "Time_Start": 1089.94,
      "Time_End": 1095.94,
      "Text": " your primary SIM card and then you get the screen and you allow the usage. In the title we"
    },
    {
      "Time_Start": 1099.48,
      "Time_End": 1105.7,
      "Text": " said carriers hate this trick. That might be a little bit controversial. Why do we think"
    },
    {
      "Time_Start": 1105.7,
      "Time_End": 1112.74,
      "Text": " carriers hate this trick? Well SIM tunneling isn't exactly new. It has already been used for"
    },
    {
      "Time_Start": 1112.74,
      "Time_End": 1118.74,
      "Text": " over the top bypass fraud. So that's when you use batteries of SIMs that are connected to"
    },
    {
      "Time_Start": 1120.44,
      "Time_End": 1126.44,
      "Text": " SIM banks to terminate international calls within a country because usually local call rates"
    },
    {
      "Time_Start": 1129.52,
      "Time_End": 1135.94,
      "Text": " are cheaper than international interconnect fees. However we do actually the opposite. We"
    },
    {
      "Time_Start": 1135.94,
      "Time_End": 1141.94,
      "Text": " are tunneling from domestic to abroad to test all the other networks. So this might also"
    },
    {
      "Time_Start": 1142.94,
      "Time_End": 1148.94,
      "Text": " hint why this might be an opportunity for carriers to have such a system. Because nowadays"
    },
    {
      "Time_Start": 1155.4,
      "Time_End": 1160.98,
      "Text": " carriers have to rely on their roaming partners to deliver the services the way that they"
    },
    {
      "Time_Start": 1160.98,
      "Time_End": 1166.98,
      "Text": " wanted for their customers. But with a system like this the carriers can actually verify"
    },
    {
      "Time_Start": 1172.1000000000001,
      "Time_End": 1178.98,
      "Text": " the services and especially things like voice over LTE roaming which lacks a good"
    },
    {
      "Time_Start": 1178.98,
      "Time_End": 1184.98,
      "Text": " auto-configuration protocol and it causes a lot of trouble internationally. This might"
    },
    {
      "Time_Start": 1186.8600000000001,
      "Time_End": 1192.8600000000001,
      "Text": " actually help to test the different configurations. So what have we learned during the"
    },
    {
      "Time_Start": 1195.02,
      "Time_End": 1201.02,
      "Text": " implementation of our system? There are a few, well some surprising results. The first"
    },
    {
      "Time_Start": 1202.8600000000001,
      "Time_End": 1208.8600000000001,
      "Text": " is if you read almost any book on cellular networks they will basically say something"
    },
    {
      "Time_Start": 1211.56,
      "Time_End": 1217.56,
      "Text": " along the lines that the IMSI is basically the unique identifier of a SIM card. And that's"
    },
    {
      "Time_Start": 1219.8200000000002,
      "Time_End": 1225.8200000000002,
      "Text": " also used to find your home operator and stuff like that. However even in our small test"
    },
    {
      "Time_Start": 1226.82,
      "Time_End": 1232.82,
      "Text": " set we found several examples of SIM cards that can actually update the IMSI over the air or"
    },
    {
      "Time_Start": 1235.78,
      "Time_End": 1241.78,
      "Text": " change it dynamically. This is usually used for selecting a roaming network. So it's not"
    },
    {
      "Time_Start": 1245.62,
      "Time_End": 1251.62,
      "Text": " like you're not selecting the network that you're using as a visitor. You're selecting"
    },
    {
      "Time_Start": 1252.6200000000001,
      "Time_End": 1258.6200000000001,
      "Text": " someone that will then, that has all the contracts in place with all the operators in the"
    },
    {
      "Time_Start": 1261.74,
      "Time_End": 1268.46,
      "Text": " different countries so that they have just one place to do their accounting and to work"
    },
    {
      "Time_Start": 1268.46,
      "Time_End": 1274.46,
      "Text": " with. Another thing that we've learned is that theoretically there is a 127 device limit"
    },
    {
      "Time_Start": 1274.46,
      "Time_End": 1280.46,
      "Text": " on USB but practically it's hard to get over 20 or 30. That has to do with lousy hardware,"
    },
    {
      "Time_Start": 1286.38,
      "Time_End": 1293.08,
      "Text": " weak drivers, the power consumption even if you use active hubs. And we've tried several"
    },
    {
      "Time_Start": 1293.08,
      "Time_End": 1299.5,
      "Text": " things. Here are the pictures. So like on the left you can see like we bought like a box of"
    },
    {
      "Time_Start": 1299.5,
      "Time_End": 1305.5,
      "Text": " 100 SIM card readers on Aliexpress. And then we tried to run them like naively on all the"
    },
    {
      "Time_Start": 1308.96,
      "Time_End": 1314.96,
      "Text": " single USB hubs that turned out to be very error prone. And then we also tried this"
    },
    {
      "Time_Start": 1318.84,
      "Time_End": 1324.84,
      "Text": " professional USB hubs that are used by or have been used by miners for like this USB FPGA"
    },
    {
      "Time_Start": 1325.84,
      "Time_End": 1331.84,
      "Text": " boards. But this also didn't work well. Where do we stand today? So now our system is"
    },
    {
      "Time_Start": 1337.34,
      "Time_End": 1343.34,
      "Text": " deployed to 10 European countries and to North America. You can see Canada isn't fully"
    },
    {
      "Time_Start": 1344.76,
      "Time_End": 1350.76,
      "Text": " covered. That has to do with that in Canada not all the bare metal operators are available in"
    },
    {
      "Time_Start": 1351.76,
      "Time_End": 1357.76,
      "Text": " all the provinces. Our current probe in Canada is in the Yukon territory. So that's why it's"
    },
    {
      "Time_Start": 1360.56,
      "Time_End": 1366.56,
      "Text": " just half green. Ethical considerations. So there are some ethical considerations we have"
    },
    {
      "Time_Start": 1370.52,
      "Time_End": 1376.8799999999999,
      "Text": " to talk about. You might for example ask why do we use modems and don't use software"
    },
    {
      "Time_Start": 1376.88,
      "Time_End": 1382.46,
      "Text": " defined radios. I mean on the one side software defined radios give you much more"
    },
    {
      "Time_Start": 1382.46,
      "Time_End": 1387.8000000000002,
      "Text": " capabilities on the radio side. On the other side all the open source implementations"
    },
    {
      "Time_Start": 1387.8000000000002,
      "Time_End": 1394.6000000000001,
      "Text": " usually only focus on one access technology. So you can get like a GSM implementation or you"
    },
    {
      "Time_Start": 1394.6000000000001,
      "Time_End": 1400.2600000000002,
      "Text": " can get an LTE implementation. But you cannot get like one implementation that covers all"
    },
    {
      "Time_Start": 1400.2600000000002,
      "Time_End": 1406.6000000000001,
      "Text": " the access technologies. And the other thing is that it's a regulatory minefield. So we"
    },
    {
      "Time_Start": 1406.64,
      "Time_End": 1413.44,
      "Text": " give out or so far we gave out these probes to friends and family in different"
    },
    {
      "Time_Start": 1413.44,
      "Time_End": 1419.44,
      "Text": " countries. And we cannot like subject them to the risk of having a software defined"
    },
    {
      "Time_Start": 1421.3200000000002,
      "Time_End": 1427.3200000000002,
      "Text": " radio and all the radio regulatory problems that might come with that. So we rather opt for"
    },
    {
      "Time_Start": 1429.3200000000002,
      "Time_End": 1435.3200000000002,
      "Text": " unmodified globally certified modems that are safe to use in open source applications."
    },
    {
      "Time_Start": 1436.6000000000001,
      "Time_End": 1442.6000000000001,
      "Text": " In all the countries. The second thing that I want to mention is we do not enrich"
    },
    {
      "Time_Start": 1442.6000000000001,
      "Time_End": 1448.7800000000002,
      "Text": " ourselves with our tests. For example with the traffic accounting tests. So we made sure"
    },
    {
      "Time_Start": 1448.7800000000002,
      "Time_End": 1455.6000000000001,
      "Text": " that at the end of the month we let expire at least that amount of traffic that wasn't"
    },
    {
      "Time_Start": 1455.6000000000001,
      "Time_End": 1461.6000000000001,
      "Text": " accounted in our tests. And with that I'll switch over to Gabriel who will talk about the"
    },
    {
      "Time_Start": 1462.6000000000001,
      "Time_End": 1468.6000000000001,
      "Text": " results and what you can actually do with our system. Yeah. Thank you. So I would say let"
    },
    {
      "Time_Start": 1472.18,
      "Time_End": 1479.5200000000002,
      "Text": " the games begin. So let's take a look at what we can do with this fancy platform. I'll walk"
    },
    {
      "Time_Start": 1479.5200000000002,
      "Time_End": 1485.5200000000002,
      "Text": " you through a few showcases. Of course our platform has very versatile capabilities. But the"
    },
    {
      "Time_Start": 1486.52,
      "Time_End": 1493.52,
      "Text": " first one will be an internet related measurement case. So it will be about seriating"
    },
    {
      "Time_Start": 1493.52,
      "Time_End": 1499.52,
      "Text": " measurements. It will be billing measurements. And also after presenting the measurements"
    },
    {
      "Time_Start": 1499.52,
      "Time_End": 1505.94,
      "Text": " we will show some proof of concept. How you could abuse this seriating offers or how an"
    },
    {
      "Time_Start": 1505.94,
      "Time_End": 1511.94,
      "Text": " attacker could abuse this to gain some free internet traffic. So what is seriating?"
    },
    {
      "Time_Start": 1511.94,
      "Time_End": 1517.94,
      "Text": " Actually there are some providers that offers this kind of programs and offers. Usually"
    },
    {
      "Time_Start": 1521.94,
      "Time_End": 1528.06,
      "Text": " they provide several groups for applications. So in this screenshot example there is a group"
    },
    {
      "Time_Start": 1528.06,
      "Time_End": 1533.78,
      "Text": " for messaging application, for social media applications and also for video. So for example"
    },
    {
      "Time_Start": 1533.78,
      "Time_End": 1539.78,
      "Text": " for Netflix. And yeah they offer this. The customers can buy a package and then they can gain"
    },
    {
      "Time_Start": 1542.9,
      "Time_End": 1549.56,
      "Text": " by buying this package they gain unmetered access to this kind of applications. Of course from"
    },
    {
      "Time_Start": 1549.56,
      "Time_End": 1555.8200000000002,
      "Text": " a carrier perspective this data traffic, all the data traffic that passes the provider needs to"
    },
    {
      "Time_Start": 1555.8200000000002,
      "Time_End": 1561.8200000000002,
      "Text": " be classified. So they need to be, it needs to be separated. It needs to be classified into"
    },
    {
      "Time_Start": 1564.3200000000002,
      "Time_End": 1571.2,
      "Text": " bill traffic and also seriating traffic. And let's take a look at which possibilities there are"
    },
    {
      "Time_Start": 1571.5800000000002,
      "Time_End": 1577.5800000000002,
      "Text": " for the cellular carrier. So which metrics could be used for the classification. A very old"
    },
    {
      "Time_Start": 1578.8600000000001,
      "Time_End": 1584.8600000000001,
      "Text": " metric that has been used back in the days to classify and to then block BitTorrent traffic was"
    },
    {
      "Time_Start": 1586.78,
      "Time_End": 1592.78,
      "Text": " the TCP or UDP port. Nowadays it's mainly used in conjunction with some other metrics because"
    },
    {
      "Time_Start": 1594.82,
      "Time_End": 1601.04,
      "Text": " it's kind of vague. Most of the traffic anyway is web traffic so it might be using port 443."
    },
    {
      "Time_Start": 1602.0,
      "Time_End": 1608.96,
      "Text": " And yeah you could easily fake this port. Thereby it's not that reliable. However the IP"
    },
    {
      "Time_Start": 1608.96,
      "Time_End": 1614.96,
      "Text": " address is kind of accurate. Especially for those big services like WhatsApp. Usually the IP"
    },
    {
      "Time_Start": 1616.12,
      "Time_End": 1622.6599999999999,
      "Text": " address of the services is pretty static so it's a reliable classification metric. Some provider"
    },
    {
      "Time_Start": 1622.6599999999999,
      "Time_End": 1629.54,
      "Text": " might use some cloud hosting so some applications. But usually if it's a big application it's"
    },
    {
      "Time_Start": 1629.54,
      "Time_End": 1635.12,
      "Text": " pretty stable. So it's a good classification metric. Also some operators use the packet"
    },
    {
      "Time_Start": 1635.12,
      "Time_End": 1641.92,
      "Text": " inspection. So this is when the classification mechanism doesn't only look at the packet"
    },
    {
      "Time_Start": 1641.92,
      "Time_End": 1649.3,
      "Text": " setup but also at the content of the packets. So the classifier needs to be protocol aware. It"
    },
    {
      "Time_Start": 1649.3,
      "Time_End": 1656.5,
      "Text": " needs to understand what the fields of the protocol mean. And yeah this is also commonly"
    },
    {
      "Time_Start": 1656.5,
      "Time_End": 1662.5,
      "Text": " used. Also for our measurements we focused on IP address and on the packet inspection"
    },
    {
      "Time_Start": 1664.62,
      "Time_End": 1671.5,
      "Text": " classification. For the packet inspection we mainly focused on host name based"
    },
    {
      "Time_Start": 1671.5,
      "Time_End": 1676.04,
      "Text": " classification. But also there are some other metrics. So some operators for example"
    },
    {
      "Time_Start": 1676.04,
      "Time_End": 1682.04,
      "Text": " classify by the time to live to detect or to block mobile hotspots. And since this is kind of"
    },
    {
      "Time_Start": 1682.74,
      "Time_End": 1688.74,
      "Text": " popular with any problem there are also some people throwing machine learning at it. Let's"
    },
    {
      "Time_Start": 1691.74,
      "Time_End": 1698.0,
      "Text": " take a look for the packet inspection. So this is an example for host name based"
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1703.74,
      "Text": " classification. If the traffic is just HTTP free it's pretty straightforward because we do"
    },
    {
      "Time_Start": 1703.74,
      "Time_End": 1709.12,
      "Text": " not have any encryption. So the classifier can simply take a look at the host data of the"
    },
    {
      "Time_Start": 1709.1200000000001,
      "Time_End": 1715.1200000000001,
      "Text": " protocol. If it's an encrypted connection like HTTPS or HTTP free, the classifier"
    },
    {
      "Time_Start": 1717.0400000000002,
      "Time_End": 1724.0000000000002,
      "Text": " actually has to take a look at the TLS handshake and thereby take a look at the client"
    },
    {
      "Time_Start": 1724.0000000000002,
      "Time_End": 1729.2800000000002,
      "Text": " hello message that contains the server name indication. But yeah it's again pretty"
    },
    {
      "Time_Start": 1729.2800000000002,
      "Time_End": 1736.3600000000001,
      "Text": " similar. So just the host name is extracted and thereby the traffic is classified. Within"
    },
    {
      "Time_Start": 1736.3600000000001,
      "Time_End": 1741.2400000000002,
      "Text": " our study we've bought some SIM cards. We've measured seven operators of three different"
    },
    {
      "Time_Start": 1741.2400000000002,
      "Time_End": 1747.48,
      "Text": " countries. And within those SIM cards we've analyzed available applications, your rating"
    },
    {
      "Time_Start": 1747.48,
      "Time_End": 1752.5200000000002,
      "Text": " applications. And we figured that WhatsApp, Snapchat and Facebook and Facebook messenger"
    },
    {
      "Time_Start": 1752.5200000000002,
      "Time_End": 1758.5200000000002,
      "Text": " were the most popular applications. They are like any Android or IOS application they are"
    },
    {
      "Time_Start": 1758.68,
      "Time_End": 1764.68,
      "Text": " heavily communicating via web APIs, web end points. We got some traffic dumps from"
    },
    {
      "Time_Start": 1768.86,
      "Time_End": 1775.6,
      "Text": " those applications and also reverse engineered applications. And yeah we found some end"
    },
    {
      "Time_Start": 1775.6,
      "Time_End": 1782.9,
      "Text": " points that we could use for our measurements to probe this kind of web service. And for"
    },
    {
      "Time_Start": 1782.9,
      "Time_End": 1788.9,
      "Text": " the selected web end points we found that they support HTTP, HTTPS and HTTP free. And also"
    },
    {
      "Time_Start": 1790.8600000000001,
      "Time_End": 1796.8600000000001,
      "Text": " they are hosted by a dual stack so you could communicate to them via IPV4 or IPV6. Yeah"
    },
    {
      "Time_Start": 1799.8600000000001,
      "Time_End": 1805.8600000000001,
      "Text": " we've had two measurement campaigns and we've executed measurements in the domestic case"
    },
    {
      "Time_Start": 1806.8600000000001,
      "Time_End": 1813.8600000000001,
      "Text": " but also during roaming conditions. Basic methodology for this kind of seriating measurements"
    },
    {
      "Time_Start": 1813.8600000000001,
      "Time_End": 1819.9,
      "Text": " was to get the credits then to execute some experiments and then wait for the data to be"
    },
    {
      "Time_Start": 1819.9,
      "Time_End": 1827.9,
      "Text": " built and again get the credit and calculate the delta. And within the experiment we had some"
    },
    {
      "Time_Start": 1827.9,
      "Time_End": 1833.44,
      "Text": " payload that was potentially serrated and afterwards as Adrian already explained we also had"
    },
    {
      "Time_Start": 1833.48,
      "Time_End": 1839.48,
      "Text": " some control traffic that was acting as a marker so we knew when all the data units were"
    },
    {
      "Time_Start": 1841.3200000000002,
      "Time_End": 1847.24,
      "Text": " built. And for the serrating experiments we had three experiments. The first one was to"
    },
    {
      "Time_Start": 1847.24,
      "Time_End": 1853.24,
      "Text": " verify that the web end points that we selected are actually serrated and the other two were"
    },
    {
      "Time_Start": 1854.74,
      "Time_End": 1860.24,
      "Text": " to kind of learn more about the classification so to detect IP based or host name based"
    },
    {
      "Time_Start": 1860.24,
      "Time_End": 1866.24,
      "Text": " classification methods. So this is a chart for the very first experiment. We have our"
    },
    {
      "Time_Start": 1866.24,
      "Time_End": 1872.24,
      "Text": " mobile Atlas measurement probe on the left side and we have some web end points on the right"
    },
    {
      "Time_Start": 1872.24,
      "Time_End": 1878.24,
      "Text": " side. So in this case we are probing WhatsApp. So we are just repeatedly querying or"
    },
    {
      "Time_Start": 1879.5,
      "Time_End": 1885.5,
      "Text": " retrieving some web end points until our specified data units were retrieved. And then we"
    },
    {
      "Time_Start": 1891.0,
      "Time_End": 1897.0,
      "Text": " do the same with some control traffic that usually is bigger and when the control traffic is"
    },
    {
      "Time_Start": 1899.2,
      "Time_End": 1905.04,
      "Text": " built we know that the experiment is finished and we can say whether the first traffic was"
    },
    {
      "Time_Start": 1905.04,
      "Time_End": 1911.04,
      "Text": " subtracted from our data quota or whether or not. To detect IP based classification the test"
    },
    {
      "Time_Start": 1912.78,
      "Time_End": 1918.78,
      "Text": " case was pretty similar so the actors didn't change but we just spoofed the host header so"
    },
    {
      "Time_Start": 1920.66,
      "Time_End": 1926.16,
      "Text": " the data packets were still going to the WhatsApp web server but the host header didn't"
    },
    {
      "Time_Start": 1926.16,
      "Time_End": 1932.66,
      "Text": " match the WhatsApp end point anymore. And so if for this case the packets still were serrated"
    },
    {
      "Time_Start": 1932.66,
      "Time_End": 1939.54,
      "Text": " we knew that most probably some IP based classification is in place and we did a similar"
    },
    {
      "Time_Start": 1939.54,
      "Time_End": 1946.16,
      "Text": " thing to detect host name based classification but we needed to introduce another actor. So"
    },
    {
      "Time_Start": 1946.2,
      "Time_End": 1953.0800000000002,
      "Text": " in this test case we automatically spin up an AWS instance that just forwards all the necessary"
    },
    {
      "Time_Start": 1953.0800000000002,
      "Time_End": 1959.0800000000002,
      "Text": " ports to the WhatsApp application so to the WhatsApp web server and thereby the host"
    },
    {
      "Time_Start": 1961.24,
      "Time_End": 1967.24,
      "Text": " header didn't change because the content of the data packets was exactly the same but the IP"
    },
    {
      "Time_Start": 1969.24,
      "Time_End": 1974.46,
      "Text": " address changed. So when the traffic classifier is watching the data packets, is inspecting"
    },
    {
      "Time_Start": 1974.46,
      "Time_End": 1980.46,
      "Text": " the data packets, the host header is still WhatsApp but the IP address of our AWS instance"
    },
    {
      "Time_Start": 1983.88,
      "Time_End": 1990.8400000000001,
      "Text": " and thereby if the traffic is still serrated in this case we knew again that some host name"
    },
    {
      "Time_Start": 1990.8400000000001,
      "Time_End": 1996.8400000000001,
      "Text": " based classification is used. So let's come to some results. As you can see we found that"
    },
    {
      "Time_Start": 1997.38,
      "Time_End": 2003.38,
      "Text": " operators are using both IP based and host name based classification. Sometimes they even"
    },
    {
      "Time_Start": 2005.3000000000002,
      "Time_End": 2011.3000000000002,
      "Text": " combine it so in this case they serrated the traffic when either one of the rules applied."
    },
    {
      "Time_Start": 2013.8000000000002,
      "Time_End": 2020.3400000000001,
      "Text": " And interestingly for two operators actually we were not able to verify serrating so all"
    },
    {
      "Time_Start": 2020.3400000000001,
      "Time_End": 2026.3400000000001,
      "Text": " the tested packets were fully built although this operator promoted and sold some serrating"
    },
    {
      "Time_Start": 2028.96,
      "Time_End": 2035.92,
      "Text": " packages to their customers. We were very surprised by this and to make sure that this isn't"
    },
    {
      "Time_Start": 2035.92,
      "Time_End": 2041.92,
      "Text": " just a quirk of our measurement methodology we also simulated this on our smartphone so we"
    },
    {
      "Time_Start": 2044.3000000000002,
      "Time_End": 2049.5,
      "Text": " just verified it, we downloaded the Facebook application, we plugged our SIM cards, the"
    },
    {
      "Time_Start": 2049.54,
      "Time_End": 2055.08,
      "Text": " corresponding SIM cards and we again did some measurements and we could verify that a huge"
    },
    {
      "Time_Start": 2055.08,
      "Time_End": 2061.08,
      "Text": " portion so over 90% of the actual application traffic was wrongfully built. Additionally"
    },
    {
      "Time_Start": 2063.12,
      "Time_End": 2070.0,
      "Text": " some operators turned off serrating during roaming so this already was challenged by the"
    },
    {
      "Time_Start": 2070.0,
      "Time_End": 2076.96,
      "Text": " national regulators in some countries and nevertheless we found some operators still doing"
    },
    {
      "Time_Start": 2076.96,
      "Time_End": 2082.96,
      "Text": " this. Additionally we found one operator that was billing traffic when the end point was"
    },
    {
      "Time_Start": 2086.5,
      "Time_End": 2092.5,
      "Text": " retrieved by IPv6 so when IPv6 was used the packets again were wrongfully built. Similarly"
    },
    {
      "Time_Start": 2095.0,
      "Time_End": 2101.5,
      "Text": " for HTTP3 so when we were accessing the relevant end points, relevant application by"
    },
    {
      "Time_Start": 2102.12,
      "Time_End": 2109.0,
      "Text": " HTTP3 again the traffic was fully built and interestingly for one operator as I showed"
    },
    {
      "Time_Start": 2109.0,
      "Time_End": 2113.92,
      "Text": " earlier we had two measurement campaigns for one operator actually the packets got built in"
    },
    {
      "Time_Start": 2113.92,
      "Time_End": 2119.92,
      "Text": " the first period but then it got fixed and in the second period it was fine. So Archie is a"
    },
    {
      "Time_Start": 2123.7,
      "Time_End": 2130.24,
      "Text": " security researcher so he's not only interested in how those things work but also how he or"
    },
    {
      "Time_Start": 2130.48,
      "Time_End": 2136.48,
      "Text": " an attacker could exploit these kind of things. We have two cases so the first one is if host"
    },
    {
      "Time_Start": 2138.6600000000003,
      "Time_End": 2145.48,
      "Text": " name based classification was used. In this case for HTTP it's pretty straight forward, you"
    },
    {
      "Time_Start": 2145.48,
      "Time_End": 2149.78,
      "Text": " just would need to write some relaying script that fakes the host data. Sometimes the"
    },
    {
      "Time_Start": 2149.78,
      "Time_End": 2155.86,
      "Text": " provider during the classification even just uses a simple regex for the host string. If"
    },
    {
      "Time_Start": 2155.94,
      "Time_End": 2161.48,
      "Text": " HTTPS was used it's maybe a little more complex but still this is just content of the"
    },
    {
      "Time_Start": 2161.48,
      "Time_End": 2167.48,
      "Text": " packets so you can spoof that, you can change that and you could maybe implement something"
    },
    {
      "Time_Start": 2169.6,
      "Time_End": 2176.4,
      "Text": " on the top of open VPN and spoof the SNI to kind of pretend to be what's a traffic for"
    },
    {
      "Time_Start": 2176.4,
      "Time_End": 2181.86,
      "Text": " example. So this is similar to domain fronting, this technique if it's for TLS connections."
    },
    {
      "Time_Start": 2182.86,
      "Time_End": 2188.86,
      "Text": " For IP based classification this however is a little more complex so you would need to have a"
    },
    {
      "Time_Start": 2191.7400000000002,
      "Time_End": 2198.2400000000002,
      "Text": " server where you could spoof IP addresses. Also it would only work for the downlink because if"
    },
    {
      "Time_Start": 2198.2400000000002,
      "Time_End": 2205.44,
      "Text": " the client sends some packets to some Spotify IP obviously or some Whatsapp IP obviously the"
    },
    {
      "Time_Start": 2205.44,
      "Time_End": 2212.56,
      "Text": " packets will just land at Spotify or at Whatsapp. But for the downlink this is a feasible"
    },
    {
      "Time_Start": 2212.56,
      "Time_End": 2218.56,
      "Text": " thing to do so you could simply replace the source IP address at your relay point at your VPN"
    },
    {
      "Time_Start": 2222.36,
      "Time_End": 2228.82,
      "Text": " maybe and then pretend to be Spotify and then the packets will be classified as seriated"
    },
    {
      "Time_Start": 2228.82,
      "Time_End": 2234.82,
      "Text": " packets and you can get some free internet or an attacker could do that. For TCP it might be a"
    },
    {
      "Time_Start": 2237.02,
      "Time_End": 2241.32,
      "Text": " little more complex because we have this connection based approach and we have the freeway"
    },
    {
      "Time_Start": 2241.32,
      "Time_End": 2247.32,
      "Text": " handshake but for UDP this is totally feasible and this is what we did. We had a SIM card with"
    },
    {
      "Time_Start": 2249.7000000000003,
      "Time_End": 2255.7000000000003,
      "Text": " Spotify, we set up a VPN with wire guards on the server where we could spoof the packets and"
    },
    {
      "Time_Start": 2259.7000000000003,
      "Time_End": 2265.94,
      "Text": " then we wrote a kernel module, a kernel extension that rewrites the IP address of the outgoing"
    },
    {
      "Time_Start": 2265.94,
      "Time_End": 2271.94,
      "Text": " packets and for the provider these kind of packets look like Spotify and we already came up"
    },
    {
      "Time_Start": 2274.4,
      "Time_End": 2279.28,
      "Text": " with a nice name for this proof of concept and I hope you like it as well. So we called it"
    },
    {
      "Time_Start": 2279.28,
      "Time_End": 2285.28,
      "Text": " Spoofify. Now let's continue with some other showcases. The second one is a privacy related"
    },
    {
      "Time_Start": 2285.9,
      "Time_End": 2291.9,
      "Text": " showcase. It's location tracking with ringback tones. So what is the ringback tone? The"
    },
    {
      "Time_Start": 2293.82,
      "Time_End": 2298.2400000000002,
      "Text": " ringback tone is the tone you hear when you call somebody and when you basically wait for"
    },
    {
      "Time_Start": 2298.2400000000002,
      "Time_End": 2304.4,
      "Text": " them to pick up so it's this audio feedback that you get. The interesting thing is that this"
    },
    {
      "Time_Start": 2304.4,
      "Time_End": 2309.9,
      "Text": " is issued by the terminating operator so in case of roaming this is issued by the roaming"
    },
    {
      "Time_Start": 2309.9,
      "Time_End": 2316.06,
      "Text": " partner and the interesting thing as well is that we have different ringback tones for"
    },
    {
      "Time_Start": 2316.06,
      "Time_End": 2322.82,
      "Text": " different regions. So for example in the US operators use this dual ringing of 440 and 480"
    },
    {
      "Time_Start": 2322.82,
      "Time_End": 2330.02,
      "Text": " hertz and in Europe most operators use something around 425 hertz so for these two cases you"
    },
    {
      "Time_Start": 2330.02,
      "Time_End": 2336.14,
      "Text": " could even hear the difference with your bare ear but also we found that within Europe when"
    },
    {
      "Time_Start": 2336.18,
      "Time_End": 2342.22,
      "Text": " operators use very similar settings it's totally feasible to record this tone and to"
    },
    {
      "Time_Start": 2342.22,
      "Time_End": 2348.3799999999997,
      "Text": " differentiate between operators. So I'll show you some examples. This is from Vodafone in"
    },
    {
      "Time_Start": 2348.3799999999997,
      "Time_End": 2355.1,
      "Text": " Romania. We have a peak frequency of 440 hertz. This is the spectrum and also at the left we"
    },
    {
      "Time_Start": 2355.1,
      "Time_End": 2361.2999999999997,
      "Text": " see the amplitude. If we compare it to a German provider we see that another different"
    },
    {
      "Time_Start": 2361.34,
      "Time_End": 2368.2200000000003,
      "Text": " frequency is used and also the amplitude differs so it's louder for the German provider and if"
    },
    {
      "Time_Start": 2368.2200000000003,
      "Time_End": 2373.3,
      "Text": " we compare it to another German provider we see that the frequency stays the same but the"
    },
    {
      "Time_Start": 2373.3,
      "Time_End": 2378.3,
      "Text": " amplitude changes also like the signal is less clear, there are some side lobes. We did this"
    },
    {
      "Time_Start": 2382.1400000000003,
      "Time_End": 2387.8,
      "Text": " for all the available operators and then we printed a scatter plot with the amplitude and"
    },
    {
      "Time_Start": 2387.92,
      "Time_End": 2393.6000000000004,
      "Text": " the frequency and as you see this is kind of nice scattered, nice divided across the"
    },
    {
      "Time_Start": 2393.6000000000004,
      "Time_End": 2399.6000000000004,
      "Text": " diagram, the figure. So you can easily take those two metrics and determine the operator"
    },
    {
      "Time_Start": 2402.6400000000003,
      "Time_End": 2408.6400000000003,
      "Text": " that terminated the call and you can use this to kind of find out the country of the person"
    },
    {
      "Time_Start": 2411.2200000000003,
      "Time_End": 2417.46,
      "Text": " that you just called. So you just need one test call and then you know the country where"
    },
    {
      "Time_Start": 2417.46,
      "Time_End": 2422.58,
      "Text": " the person is in. Also you could of course use some other metrics like the overtones I"
    },
    {
      "Time_Start": 2422.58,
      "Time_End": 2428.58,
      "Text": " just showed you or some duty cycle. We also had differences in this. Or you could also use"
    },
    {
      "Time_Start": 2430.96,
      "Time_End": 2436.2200000000003,
      "Text": " some other call progress tones to fingerprint and this is also interesting from a tech"
    },
    {
      "Time_Start": 2436.2200000000003,
      "Time_End": 2443.42,
      "Text": " perspective for SIM swapping because you could also use this to find out the responsible"
    },
    {
      "Time_Start": 2443.46,
      "Time_End": 2450.96,
      "Text": " home operator and then you know whom you need to call to swap the SIM card maybe. Now let's"
    },
    {
      "Time_Start": 2450.96,
      "Time_End": 2456.96,
      "Text": " come to the last showcase. So this is some proactive SIM communication showcase. Since we"
    },
    {
      "Time_Start": 2458.92,
      "Time_End": 2465.12,
      "Text": " tunnel all this SIM communication we have full access to the communication, to the"
    },
    {
      "Time_Start": 2465.12,
      "Time_End": 2471.04,
      "Text": " payload that is sent between the modem and the SIM card. SIM cards are kind of mighty and"
    },
    {
      "Time_Start": 2471.04,
      "Time_End": 2476.96,
      "Text": " powerful microcontrollers so they can even run some Java. There is this instruction set of"
    },
    {
      "Time_Start": 2476.96,
      "Time_End": 2481.74,
      "Text": " proactive SIM commands where the SIM basically can take over control and can tell the"
    },
    {
      "Time_Start": 2481.74,
      "Time_End": 2486.2799999999997,
      "Text": " smartphone what to do. So the SIM could tell the smartphone to send an SMS message to"
    },
    {
      "Time_Start": 2486.2799999999997,
      "Time_End": 2492.2799999999997,
      "Text": " display some text on the handset. And since we have all this communication of our"
    },
    {
      "Time_Start": 2494.88,
      "Time_End": 2499.24,
      "Text": " measurements we can analyze it and for our measured SIM cards we found two SIM cards that"
    },
    {
      "Time_Start": 2499.28,
      "Time_End": 2506.1600000000003,
      "Text": " were phoning home so that were covertly sending some binary SMS messages and this is"
    },
    {
      "Time_Start": 2506.1600000000003,
      "Time_End": 2511.82,
      "Text": " pretty scary actually because it happens totally in the background. The smartphone user"
    },
    {
      "Time_Start": 2511.82,
      "Time_End": 2518.32,
      "Text": " doesn't know of it. Interestingly also we had some cases where this kind of binary SMS"
    },
    {
      "Time_Start": 2518.32,
      "Time_End": 2524.32,
      "Text": " were also built by the operator so during roaming these SMS's were even built. That's pretty"
    },
    {
      "Time_Start": 2525.32,
      "Time_End": 2531.32,
      "Text": " shit from a user perspective. We tried to analyze the content of this binary SMS and we"
    },
    {
      "Time_Start": 2533.9,
      "Time_End": 2540.9,
      "Text": " found out that there is some information about the user equipment so for example the"
    },
    {
      "Time_Start": 2540.9,
      "Time_End": 2546.9,
      "Text": " EMI but also from the SIM card so ECCC ID and MC were in there. If you're interested in"
    },
    {
      "Time_Start": 2547.7000000000003,
      "Time_End": 2553.78,
      "Text": " getting some more insights we've published two papers. The first one is about seriating"
    },
    {
      "Time_Start": 2553.78,
      "Time_End": 2558.6,
      "Text": " measurements. It's called Seriating One Big Mess and the second one is basically the white"
    },
    {
      "Time_Start": 2558.6,
      "Time_End": 2564.6,
      "Text": " paper of our platform. It was just presented at a USENIX conference some days ago."
    },
    {
      "Time_Start": 2568.48,
      "Time_End": 2576.48,
      "Text": " So for conclusion Archibald can now like when he's traveling spend more time with his"
    },
    {
      "Time_Start": 2576.52,
      "Time_End": 2583.4,
      "Text": " friends because for all the measurements like longitudinal measurements or exploit"
    },
    {
      "Time_Start": 2583.4,
      "Time_End": 2589.4,
      "Text": " testing and development he can now use a platform to do this from the comfort of his own. We"
    },
    {
      "Time_Start": 2594.36,
      "Time_End": 2600.56,
      "Text": " find roaming especially interesting because it's this special case where two operators"
    },
    {
      "Time_Start": 2600.6,
      "Time_End": 2607.7999999999997,
      "Text": " with completely different setup have to cooperate and pretend to be one. We showed you a"
    },
    {
      "Time_Start": 2607.7999999999997,
      "Time_End": 2613.7999999999997,
      "Text": " few use cases. You find more in our paper from two days ago from USENIX security about like"
    },
    {
      "Time_Start": 2615.64,
      "Time_End": 2621.64,
      "Text": " how to hide and dress up traffic as one of the free services so you don't have to pay for it."
    },
    {
      "Time_Start": 2621.8799999999997,
      "Time_End": 2627.8799999999997,
      "Text": " How you can locate other subscribers based on the ring back tone and some internals such"
    },
    {
      "Time_Start": 2632.68,
      "Time_End": 2639.8799999999997,
      "Text": " as proactive SIM communication. We'd like to thank all these institutions like LNET,"
    },
    {
      "Time_Start": 2639.8799999999997,
      "Time_End": 2646.7599999999998,
      "Text": " University of Vienna, Technical University of Vienna, SBA Research, CISPA and SSL Laboratory"
    },
    {
      "Time_Start": 2646.76,
      "Time_End": 2652.76,
      "Text": " from UCI for supporting us over this five years. You'll find the URL and our contact"
    },
    {
      "Time_Start": 2656.0400000000004,
      "Time_End": 2662.0400000000004,
      "Text": " information up here. The whole project is open sourced. If you are from a country that you"
    },
    {
      "Time_Start": 2663.76,
      "Time_End": 2671.34,
      "Text": " think that is interesting to us to host a probe, please get in contact with us. We have"
    },
    {
      "Time_Start": 2671.34,
      "Time_End": 2677.38,
      "Text": " actually brought some probes here to DEF CON. Thank you a lot."
    }
  ]
}