{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.8,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thanks for coming out. This is our talk, Unlocking Doors from Half a Continent Away. I hope you"
    },
    {
      "Time_Start": 7.8,
      "Time_End": 15.96,
      "Text": " have some fun. So, this isn't working. All right. My name is Trevor Stavato. I'm the"
    },
    {
      "Time_Start": 15.96,
      "Time_End": 20.0,
      "Text": " founder of a small cybersecurity company up in Canada called Loudmouth Security. I've"
    },
    {
      "Time_Start": 20.0,
      "Time_End": 24.400000000000002,
      "Text": " been doing offensive stuff for, I think, I counted about 15 years now, but I just stopped"
    },
    {
      "Time_Start": 24.400000000000002,
      "Time_End": 31.28,
      "Text": " counting and put 12 plus in the slides. My biggest personal or professional achievement,"
    },
    {
      "Time_Start": 31.28,
      "Time_End": 43.68000000000001,
      "Text": " it was winning a DEF CON Black Badge back at DEF CON 26. Thank you. Thank you."
    },
    {
      "Time_Start": 43.68000000000001,
      "Time_End": 50.040000000000006,
      "Text": " Hi. My name is Sam Haskins. I'm a hacker working for Loudmouth Security. I'm also a current"
    },
    {
      "Time_Start": 50.040000000000006,
      "Time_End": 53.760000000000005,
      "Text": " computer science student at Carleton University up in Ottawa in the computer and Internet"
    },
    {
      "Time_Start": 53.76,
      "Time_End": 59.92,
      "Text": " security stream. I've been hacking things since I was 12 at least. I have two CVEs from"
    },
    {
      "Time_Start": 59.92,
      "Time_End": 65.24,
      "Text": " ages 16 and 19. That was just last year. This is my second year at DEF CON, and I'm really"
    },
    {
      "Time_Start": 65.24,
      "Time_End": 68.32,
      "Text": " excited and happy to be here. I'm just a little bit scared."
    },
    {
      "Time_Start": 68.32,
      "Time_End": 78.47999999999999,
      "Text": " All right. So, we're going to be talking about physical access systems. So, just to give"
    },
    {
      "Time_Start": 78.47999999999999,
      "Time_End": 82.03999999999999,
      "Text": " you a quick background of all the components, you have a card that has the credential on"
    },
    {
      "Time_Start": 82.04,
      "Time_End": 86.24000000000001,
      "Text": " it, the reader that's going to read that credential off the card, send that information"
    },
    {
      "Time_Start": 86.24000000000001,
      "Time_End": 90.04,
      "Text": " back to a back-end access controller that will validate that credential, make sure it's"
    },
    {
      "Time_Start": 90.04,
      "Time_End": 95.0,
      "Text": " valid for the door it's trying to open. If it is, it'll send a signal to the lock, opens"
    },
    {
      "Time_Start": 95.0,
      "Time_End": 100.84,
      "Text": " the door, opens Sesame, you're golden. We're going to be focusing mostly, well, entirely"
    },
    {
      "Time_Start": 100.84,
      "Time_End": 106.80000000000001,
      "Text": " on the card-to-reader interactions. And in that space, there's quite a few technologies"
    },
    {
      "Time_Start": 106.80000000000001,
      "Time_End": 110.76,
      "Text": " that have been a part of this. And we'll go through some of them just for history's sake,"
    },
    {
      "Time_Start": 110.76,
      "Time_End": 115.60000000000001,
      "Text": " but our technology, our attack is going to be on some of the newest technologies, MyFairDestFire"
    },
    {
      "Time_Start": 115.60000000000001,
      "Time_End": 123.92,
      "Text": " and SeeUs. So, the purpose of physical access, what it's trying to do is it's trying to validate"
    },
    {
      "Time_Start": 123.92,
      "Time_End": 128.04000000000002,
      "Text": " that there's a physical presence of a credential at a specific time. So, that's what the reader"
    },
    {
      "Time_Start": 128.04000000000002,
      "Time_End": 134.36,
      "Text": " is trying to do. And so, because of that, there's some ways that we have come up with,"
    },
    {
      "Time_Start": 134.36,
      "Time_End": 139.16,
      "Text": " people have come up to attack it. The first one is the most basic card-cloning attack."
    },
    {
      "Time_Start": 139.32,
      "Time_End": 144.84,
      "Text": " If you can see a card, capture the data off of it, write that to a new card, present that"
    },
    {
      "Time_Start": 144.84,
      "Time_End": 150.12,
      "Text": " to a reader, it has no idea that it's a different card. So, you have a duplicate and you can"
    },
    {
      "Time_Start": 150.12,
      "Time_End": 155.84,
      "Text": " authenticate as the original card. A kind of offshoot of that one is a downgrade attack."
    },
    {
      "Time_Start": 155.84,
      "Time_End": 161.44,
      "Text": " So, if you have a technology that can't be cloned, but you can read it with a standard"
    },
    {
      "Time_Start": 161.44,
      "Time_End": 166.35999999999999,
      "Text": " reader, you can take the data that it's trying to send to the backend, encode that on a lower"
    },
    {
      "Time_Start": 166.36,
      "Time_End": 171.32000000000002,
      "Text": " frequency or lower security card and if the reader will accept both, then you've duplicated"
    },
    {
      "Time_Start": 171.32000000000002,
      "Time_End": 178.60000000000002,
      "Text": " the card just as effectively. The other category that I don't see very much in the physical"
    },
    {
      "Time_Start": 178.60000000000002,
      "Time_End": 182.8,
      "Text": " security space, but we just put it in for posterity, is the replay attack. So, if you"
    },
    {
      "Time_Start": 182.8,
      "Time_End": 187.36,
      "Text": " can capture a sequence of messages between a card and a reader and then replay that,"
    },
    {
      "Time_Start": 187.36,
      "Time_End": 192.44000000000003,
      "Text": " you may be able to trick a reader into thinking that there is a credential there at that time."
    },
    {
      "Time_Start": 192.44000000000003,
      "Time_End": 195.72000000000003,
      "Text": " And then the final one, the one that we're going to be talking most about in doing the"
    },
    {
      "Time_Start": 195.72,
      "Time_End": 201.2,
      "Text": " demos of today, is the relay attack. And you might be familiar with this in the space"
    },
    {
      "Time_Start": 201.2,
      "Time_End": 206.26,
      "Text": " of car thefts, where people are putting readers up next to your door and trying to relay the"
    },
    {
      "Time_Start": 206.26,
      "Time_End": 212.6,
      "Text": " signal from your key fobs to your car. The same kind of thing that we're doing with RFID"
    },
    {
      "Time_Start": 212.6,
      "Time_End": 219.6,
      "Text": " cards. We're going to try to relay an RFID card over a very long distance and just show"
    },
    {
      "Time_Start": 219.6,
      "Time_End": 225.88,
      "Text": " you how that can be done. So, to give you some context about how we got started down"
    },
    {
      "Time_Start": 225.88,
      "Time_End": 231.88,
      "Text": " this path of research, it's good to know what the history of access control technologies"
    },
    {
      "Time_Start": 231.88,
      "Time_End": 238.2,
      "Text": " are and what the flaws were that kind of led them to where they are today. So, one of the"
    },
    {
      "Time_Start": 238.2,
      "Time_End": 245.16,
      "Text": " original technologies, the HID prox, a very simplistic technology, once the card got energized,"
    },
    {
      "Time_Start": 245.16,
      "Time_End": 250.4,
      "Text": " it broadcasts its ID. Anybody around can listen to it. Super insecure. There's no encryption"
    },
    {
      "Time_Start": 250.4,
      "Time_End": 257.68,
      "Text": " on it. You can buy a reader from Amazon for very cheap. Fun fact, my very first DEF CON"
    },
    {
      "Time_Start": 257.68,
      "Time_End": 264.0,
      "Text": " was DEF CON 21. I went to go see the Bishop Fox talk on the Tastic RFID thief, where he"
    },
    {
      "Time_Start": 264.0,
      "Time_End": 269.28,
      "Text": " took a garage door reader, it was a high-powered garage door reader, and basically tagged on"
    },
    {
      "Time_Start": 269.28,
      "Time_End": 274.4,
      "Text": " to the data lines so he could record the card data. But that extended his read range from"
    },
    {
      "Time_Start": 274.40000000000003,
      "Time_End": 278.72,
      "Text": " a couple of inches to a couple of feet, and he would walk around with that in a briefcase"
    },
    {
      "Time_Start": 278.72,
      "Time_End": 283.84000000000003,
      "Text": " and collect cards. It's a pretty fun talk. I still have the piece that I got from it,"
    },
    {
      "Time_Start": 283.84000000000003,
      "Time_End": 290.96000000000004,
      "Text": " and it kind of inspired some of the stuff that moved me forward into this talk. So,"
    },
    {
      "Time_Start": 290.96000000000004,
      "Time_End": 295.00000000000006,
      "Text": " HID realized that that wasn't a good idea, so they came up with another version called"
    },
    {
      "Time_Start": 295.00000000000006,
      "Time_End": 300.52000000000004,
      "Text": " the HID iClass, and it was designed to protect card cloning replays. The way it did that"
    },
    {
      "Time_Start": 300.52,
      "Time_End": 305.96,
      "Text": " was it had a key between the card and the reader that was a shared key that only they"
    },
    {
      "Time_Start": 305.96,
      "Time_End": 313.08,
      "Text": " knew. HID created one shared key between the card and reader for most of the systems that"
    },
    {
      "Time_Start": 313.08,
      "Time_End": 318.2,
      "Text": " they released. If you wanted to have a special key, you had to ask HID to create a new one"
    },
    {
      "Time_Start": 318.2,
      "Time_End": 322.84,
      "Text": " for you, and they called that the elite key system, so only your readers and your cards"
    },
    {
      "Time_Start": 322.84,
      "Time_End": 328.71999999999997,
      "Text": " would use that shared key. And it was done through a proprietary cipher that they created,"
    },
    {
      "Time_Start": 328.72,
      "Time_End": 333.32000000000005,
      "Text": " which was then reverse-engineered by some researchers, and they came up with a key recovery"
    },
    {
      "Time_Start": 333.32000000000005,
      "Time_End": 339.16,
      "Text": " attack where you can recover the keys of any, not just the standard, but even the elite"
    },
    {
      "Time_Start": 339.16,
      "Time_End": 347.68,
      "Text": " keyed readers. So now it's trivially simple to create a copy of an iClass card using things"
    },
    {
      "Time_Start": 347.68,
      "Time_End": 355.8,
      "Text": " like the Proxmark. Another kind of entry in the mid-range RFID is the Mifare Classic."
    },
    {
      "Time_Start": 355.8,
      "Time_End": 360.44,
      "Text": " So we don't see this very often used in access control, but it's kind of the precursor to"
    },
    {
      "Time_Start": 360.44,
      "Time_End": 365.24,
      "Text": " the Desfire EV1 that sometimes does get into access control, so we thought we'd throw it"
    },
    {
      "Time_Start": 365.24,
      "Time_End": 371.40000000000003,
      "Text": " in as well. It uses a different mechanism. It has keys for each sector, and you can have"
    },
    {
      "Time_Start": 371.40000000000003,
      "Time_End": 375.92,
      "Text": " two keys that you can define as a read or a write key, but again, they used a proprietary"
    },
    {
      "Time_Start": 375.92,
      "Time_End": 380.68,
      "Text": " algorithm for that crypto, and again, it was reverse-engineered by a team of researchers."
    },
    {
      "Time_Start": 380.68,
      "Time_End": 388.28000000000003,
      "Text": " So very easy to copy and clone Mifare Classic cards. I think this is about the point where"
    },
    {
      "Time_Start": 388.28000000000003,
      "Time_End": 394.36,
      "Text": " both HID and NXP, who make the Mifare cards, kind of realized that maybe making proprietary"
    },
    {
      "Time_Start": 394.36,
      "Time_End": 399.72,
      "Text": " crypto was not a good idea, and you can see that in a lot of their marketing about the"
    },
    {
      "Time_Start": 399.72,
      "Time_End": 407.72,
      "Text": " new technology. So the new one for HID is CEOS, and NXP came out with the Mifare Desfire,"
    },
    {
      "Time_Start": 407.72,
      "Time_End": 413.40000000000003,
      "Text": " and there's a couple of variants of that, EV1, 2, and 3, and so they all use industry"
    },
    {
      "Time_Start": 413.40000000000003,
      "Time_End": 421.52000000000004,
      "Text": " standard ciphers, and the worthwhile thing to note is that EV1 came out in 2006, so 17"
    },
    {
      "Time_Start": 421.52000000000004,
      "Time_End": 428.76000000000005,
      "Text": " years since EV1 came out in CEOS after that in 2012, there's been no public techniques"
    },
    {
      "Time_Start": 428.76000000000005,
      "Time_End": 437.08000000000004,
      "Text": " disclosed to clone a CEOS card. The only attack that is currently known before what we're"
    },
    {
      "Time_Start": 437.08,
      "Time_End": 444.03999999999996,
      "Text": " going to show today, I guess, is the downgrade attack. So if you have a CEOS reader that"
    },
    {
      "Time_Start": 444.03999999999996,
      "Time_End": 448.52,
      "Text": " has a standard key set and your card is in the standard key set, you could read the data"
    },
    {
      "Time_Start": 448.52,
      "Time_End": 454.15999999999997,
      "Text": " off the back end, program that onto a low frequency or a lower security card, and create"
    },
    {
      "Time_Start": 454.15999999999997,
      "Time_End": 459.79999999999995,
      "Text": " a duplicate that way. But that can be easily defeated by using elite-keyed systems, because"
    },
    {
      "Time_Start": 459.79999999999995,
      "Time_End": 464.56,
      "Text": " then you would have to have a reader that has that same elite key, so if you're targeting"
    },
    {
      "Time_Start": 464.56,
      "Time_End": 467.76,
      "Text": " a facility, you'd have to go and rip that reader off the wall, and I'm pretty sure they're"
    },
    {
      "Time_Start": 467.76,
      "Time_End": 473.04,
      "Text": " going to notice that. Or the other thing they can do is they can configure their readers"
    },
    {
      "Time_Start": 473.04,
      "Time_End": 478.56,
      "Text": " to only accept the CEOS or Desfire cards, so if you clone it to a low frequency or a"
    },
    {
      "Time_Start": 478.56,
      "Time_End": 483.44,
      "Text": " lower security card, it's useless, because the reader won't accept it. Now, you might"
    },
    {
      "Time_Start": 483.44,
      "Time_End": 487.88,
      "Text": " come into situations where they have different configurations around the building. In a loading"
    },
    {
      "Time_Start": 487.88,
      "Time_End": 493.36,
      "Text": " bay, they might use a dual frequency reader, but most often, the secured, protected areas"
    },
    {
      "Time_Start": 493.36,
      "Time_End": 499.32,
      "Text": " of a high security building are going to be protected by elite-keyed CEOS or high"
    },
    {
      "Time_Start": 499.32,
      "Time_End": 504.84000000000003,
      "Text": " frequency only cards. So, and that was actually the scenario that we faced when we were doing"
    },
    {
      "Time_Start": 504.84000000000003,
      "Time_End": 511.72,
      "Text": " a red team engagement, so that's what led to the motivation. If we can't break the crypto,"
    },
    {
      "Time_Start": 511.72,
      "Time_End": 515.08,
      "Text": " we go for a relay attack instead, and I'm going to pass it to Sam to talk about how"
    },
    {
      "Time_Start": 515.08,
      "Time_End": 516.5600000000001,
      "Text": " we did that."
    },
    {
      "Time_Start": 516.5600000000001,
      "Time_End": 523.2,
      "Text": " Thank you. So, first, I'm just going to talk a bit about the relay attack scenario, so"
    },
    {
      "Time_Start": 523.2,
      "Time_End": 526.6,
      "Text": " what this would look like from an attacker deploying it. So, basically, you're going"
    },
    {
      "Time_Start": 526.6,
      "Time_End": 531.2,
      "Text": " to send one of your guys to stand beside a legitimate employee of the place you're trying"
    },
    {
      "Time_Start": 531.2,
      "Time_End": 535.44,
      "Text": " to access on public transit or some other environment like that, and then they can hold"
    },
    {
      "Time_Start": 535.44,
      "Time_End": 539.5600000000001,
      "Text": " a Proxmark fairly close to the guy's pass, and then you send one of your other guys right"
    },
    {
      "Time_Start": 539.5600000000001,
      "Time_End": 543.88,
      "Text": " up to the door and just badge in, and you need some way of communicating between the"
    },
    {
      "Time_Start": 543.88,
      "Time_End": 549.5600000000001,
      "Text": " two Proxmarks. We use the internet as a backbone, which is super convenient, because it's available"
    },
    {
      "Time_Start": 549.5600000000001,
      "Time_End": 555.0000000000001,
      "Text": " everywhere with cell networks and stuff, but it theoretically could be anything there."
    },
    {
      "Time_Start": 555.0000000000001,
      "Time_End": 561.72,
      "Text": " So here's the architecture of our original attack here. The first version used laptops"
    },
    {
      "Time_Start": 561.72,
      "Time_End": 566.0000000000001,
      "Text": " instead of mobile devices. We since migrated to that, but as you can see, we have the real"
    },
    {
      "Time_Start": 566.0000000000001,
      "Time_End": 570.84,
      "Text": " card and then two Proxmarks acting as a fake reader and a fake card, and then if you follow"
    },
    {
      "Time_Start": 570.84,
      "Time_End": 576.84,
      "Text": " that green line there, messages go from the real reader all the way to the real card,"
    },
    {
      "Time_Start": 576.88,
      "Time_End": 581.5600000000001,
      "Text": " and then responses go all the way back. You repeat that about 10 or 12 times or whatever,"
    },
    {
      "Time_Start": 581.5600000000001,
      "Time_End": 588.5600000000001,
      "Text": " and then the door opens. And even this original attack did use over the internet. We had a"
    },
    {
      "Time_Start": 588.84,
      "Time_End": 593.0400000000001,
      "Text": " web socket connection between the two laptops, and in this original attack, we also used"
    },
    {
      "Time_Start": 593.0400000000001,
      "Time_End": 597.72,
      "Text": " Bluetooth between the laptop and the phone, or sorry, between the laptop and the Proxmark"
    },
    {
      "Time_Start": 597.72,
      "Time_End": 603.82,
      "Text": " just to get them a bit further apart and not have to run wires. So because all of the messages"
    },
    {
      "Time_Start": 603.82,
      "Time_End": 608.5400000000001,
      "Text": " are generated by a real card and a real reader, the contents are guaranteed to be correct."
    },
    {
      "Time_Start": 608.5400000000001,
      "Time_End": 611.6600000000001,
      "Text": " If they weren't, the system wouldn't work in the first place, and legitimate cards would"
    },
    {
      "Time_Start": 611.6600000000001,
      "Time_End": 616.82,
      "Text": " not open the doors. So the only way that readers could detect our attacks is by detecting timing"
    },
    {
      "Time_Start": 616.82,
      "Time_End": 621.62,
      "Text": " variations, and that's because the round-trip time of request-response over about an inch"
    },
    {
      "Time_Start": 621.62,
      "Time_End": 627.86,
      "Text": " between the legitimate scenario versus auto to Vegas is significantly shorter. So we were"
    },
    {
      "Time_Start": 627.86,
      "Time_End": 633.4200000000001,
      "Text": " investigating, can we make the readers support longer than normal timings? And it turns out"
    },
    {
      "Time_Start": 633.42,
      "Time_End": 640.18,
      "Text": " that we can. There's a few mechanisms. So all of the high-frequency cards that we've"
    },
    {
      "Time_Start": 640.18,
      "Time_End": 647.18,
      "Text": " discussed so far, so the 13.56 megahertz ones are based on ISO 14443 type A, or just 14A"
    },
    {
      "Time_Start": 648.8199999999999,
      "Time_End": 655.14,
      "Text": " since that's a lot of letter soup, and most access controls would be based on the standards."
    },
    {
      "Time_Start": 655.14,
      "Time_End": 660.4599999999999,
      "Text": " There's a few that aren't, but most of them are, and this is analogous to how HTTP is"
    },
    {
      "Time_Start": 660.46,
      "Time_End": 665.7,
      "Text": " built on top of TCP. This provides a messaging layer that the application-specific data would"
    },
    {
      "Time_Start": 665.7,
      "Time_End": 671.86,
      "Text": " travel over, but before any application-layer data, so the CS protocol or the desk protocol,"
    },
    {
      "Time_Start": 671.86,
      "Time_End": 675.98,
      "Text": " before any of that happens, the card and the reader must exchange parameters in what we"
    },
    {
      "Time_Start": 675.98,
      "Time_End": 681.7800000000001,
      "Text": " call the 14A handshake, and this is both documented very nicely, it's an ISO standard, but it's"
    },
    {
      "Time_Start": 681.7800000000001,
      "Time_End": 687.0600000000001,
      "Text": " also not encrypted or authenticated at all. There's a 16-bit CRC on some parts, but the"
    },
    {
      "Time_Start": 687.0600000000001,
      "Time_End": 692.1400000000001,
      "Text": " details of that are public, so we can't mess with that. So let's have a quick look."
    },
    {
      "Time_Start": 692.1400000000001,
      "Time_End": 698.1,
      "Text": " So this diagram here shows a real handshake that we captured between a real CS card and"
    },
    {
      "Time_Start": 698.1,
      "Time_End": 702.98,
      "Text": " a real reader. You don't have to understand most of it, the spec is about 100 pages, but"
    },
    {
      "Time_Start": 702.98,
      "Time_End": 707.2600000000001,
      "Text": " there are a few parts I'd like to highlight here. So the first message I'd like to highlight"
    },
    {
      "Time_Start": 707.2600000000001,
      "Time_End": 714.2600000000001,
      "Text": " is this UID CLN message. Now, the standard actually has a mechanism for the card to give"
    },
    {
      "Time_Start": 714.5,
      "Time_End": 721.42,
      "Text": " a UID to the reader. CS doesn't use this, because it's completely unauthenticated, as"
    },
    {
      "Time_Start": 721.42,
      "Time_End": 726.9,
      "Text": " said earlier, but other mechanisms do, but CS actually just provides a random value each"
    },
    {
      "Time_Start": 726.9,
      "Time_End": 730.74,
      "Text": " time, so you can't even use this with readers who don't support the CS protocol just by"
    },
    {
      "Time_Start": 730.74,
      "Time_End": 734.02,
      "Text": " falling back to that number, and then the other thing I'd like to highlight is that"
    },
    {
      "Time_Start": 734.02,
      "Time_End": 740.9399999999999,
      "Text": " ATS message there, and specifically that blue byte, which is interface byte TB1. ATS here"
    },
    {
      "Time_Start": 740.94,
      "Time_End": 747.94,
      "Text": " is answer select, and the important bit of TB1 there is the frame waiting time integer,"
    },
    {
      "Time_Start": 748.0600000000001,
      "Time_End": 752.6600000000001,
      "Text": " which is coded in the high nibble, and that's the frame waiting time, and I'll explain what"
    },
    {
      "Time_Start": 752.6600000000001,
      "Time_End": 758.62,
      "Text": " that is in just a second, in accordance with that little equation there, and the FWT tells"
    },
    {
      "Time_Start": 758.62,
      "Time_End": 763.3800000000001,
      "Text": " the reader how long to wait between frames, so after the reader sends a request, it will"
    },
    {
      "Time_Start": 763.3800000000001,
      "Time_End": 769.0200000000001,
      "Text": " wait that amount of time before expecting a response from the card, and if it doesn't"
    },
    {
      "Time_Start": 769.02,
      "Time_End": 772.62,
      "Text": " receive one at that point, it will usually restart the entire authentication attempt"
    },
    {
      "Time_Start": 772.62,
      "Time_End": 778.5799999999999,
      "Text": " from the beginning, however, this is unauthenticated, it's sent by the card, which we are pretending"
    },
    {
      "Time_Start": 778.5799999999999,
      "Time_End": 783.54,
      "Text": " to be, and we can mess with it, and if you notice at just the end of that equation there,"
    },
    {
      "Time_Start": 783.54,
      "Time_End": 789.14,
      "Text": " there's that exponential term, we can make that go pretty high."
    },
    {
      "Time_Start": 789.14,
      "Time_End": 795.4399999999999,
      "Text": " So after the 14A handshake is complete, it goes into the CS protocol, which is a bunch"
    },
    {
      "Time_Start": 795.44,
      "Time_End": 802.44,
      "Text": " of random bytes, and I have no idea what they mean, but who cares, because these are"
    },
    {
      "Time_Start": 803.2,
      "Time_End": 807.1600000000001,
      "Text": " generated by a real card and a real reader, we know they're right, we just need to get"
    },
    {
      "Time_Start": 807.1600000000001,
      "Time_End": 814.1600000000001,
      "Text": " them from point A to point B. Yes, a lot of the messages in the 14A handshake"
    },
    {
      "Time_Start": 814.4000000000001,
      "Time_End": 820.6,
      "Text": " are sent before that ATS message, so the modified frame waiting time won't apply yet, and therefore"
    },
    {
      "Time_Start": 820.64,
      "Time_End": 825.84,
      "Text": " we can't relay them, the latency over any internet connection, even basic Ethernet will"
    },
    {
      "Time_Start": 825.84,
      "Time_End": 831.52,
      "Text": " be far too long, it's messed up by print statements in fact, so that initial 14A handshake does"
    },
    {
      "Time_Start": 831.52,
      "Time_End": 836.88,
      "Text": " have to be handled on the prox marks themselves, but thankfully it can really just be hard"
    },
    {
      "Time_Start": 836.88,
      "Time_End": 840.76,
      "Text": " coded for the most part, it doesn't really vary, but we'll get into a few more details"
    },
    {
      "Time_Start": 840.76,
      "Time_End": 846.1600000000001,
      "Text": " on that later. And as for how long we can get the reader"
    },
    {
      "Time_Start": 846.3199999999999,
      "Time_End": 851.88,
      "Text": " to wait between frames, if we set the FWI to its highest value of 14, we can make it"
    },
    {
      "Time_Start": 851.88,
      "Time_End": 857.88,
      "Text": " wait 4,949 milliseconds, which is almost five seconds, I'm not sure why that's supported"
    },
    {
      "Time_Start": 857.88,
      "Time_End": 864.88,
      "Text": " by the standard, because I don't see a real use case, but it's very convenient for us."
    },
    {
      "Time_Start": 865.48,
      "Time_End": 870.1999999999999,
      "Text": " There is another technique in the 14A standard that we can use to bypass the round trip time"
    },
    {
      "Time_Start": 870.36,
      "Time_End": 877.0400000000001,
      "Text": " check, which is waiting time extensions, and that's a mechanism that applies to just the"
    },
    {
      "Time_Start": 877.0400000000001,
      "Time_End": 882.24,
      "Text": " next message, not all subsequent messages, but it can also be repeated, which is nice,"
    },
    {
      "Time_Start": 882.24,
      "Time_End": 887.5600000000001,
      "Text": " so theoretically if you keep the fake card by the reader for 20 minutes and it just keeps"
    },
    {
      "Time_Start": 887.5600000000001,
      "Time_End": 893.22,
      "Text": " sending these, you could have 20 minutes of time, but in practice, at least with the readers"
    },
    {
      "Time_Start": 893.22,
      "Time_End": 898.9200000000001,
      "Text": " that we tested, we found it was less reliable, so we're mostly relying on modifying the FWT."
    },
    {
      "Time_Start": 898.96,
      "Time_End": 903.72,
      "Text": " I think a big problem with the WTX is it does need to be sent for each message, so if it's"
    },
    {
      "Time_Start": 903.72,
      "Time_End": 908.96,
      "Text": " missed once, the entire authentication attempt fails."
    },
    {
      "Time_Start": 908.96,
      "Time_End": 915.0000000000001,
      "Text": " So our original design was implemented as an extension to the already existing and open"
    },
    {
      "Time_Start": 915.0000000000001,
      "Time_End": 921.48,
      "Text": " source HF Replay Proxmark standalone mode, which was originally written by Salvador Mendoza,"
    },
    {
      "Time_Start": 921.48,
      "Time_End": 925.2,
      "Text": " that was to relay credit cards actually, which was pretty cool, and we made some changes"
    },
    {
      "Time_Start": 925.2,
      "Time_End": 931.0,
      "Text": " to allow vm.cs protocol, or really any protocol, instead of just credit cards, and also adding"
    },
    {
      "Time_Start": 931.0,
      "Time_End": 936.96,
      "Text": " the long-range internet component, instead of just over Bluetooth like it was originally,"
    },
    {
      "Time_Start": 936.96,
      "Time_End": 942.36,
      "Text": " and this original design was strongly coupled with the BlueShark Bluetooth add-on, messages"
    },
    {
      "Time_Start": 942.36,
      "Time_End": 946.6800000000001,
      "Text": " were conveyed from Proxmark to laptop and then sent over IP, and we did have a lot of"
    },
    {
      "Time_Start": 946.6800000000001,
      "Time_End": 951.44,
      "Text": " success with this design, the big highlight being unlocking a door in Ottawa with a card"
    },
    {
      "Time_Start": 951.44,
      "Time_End": 957.2,
      "Text": " in Florida, because my colleague over here has a vacation home in Florida, so we sent"
    },
    {
      "Time_Start": 957.2,
      "Time_End": 962.32,
      "Text": " him down with a card and just tried that out, and it worked after a few tries."
    },
    {
      "Time_Start": 962.32,
      "Time_End": 969.0400000000001,
      "Text": " There were, however, some fairly major reliability issues in this original design."
    },
    {
      "Time_Start": 969.0400000000001,
      "Time_End": 974.0,
      "Text": " So the BlueShark add-on does come with an integrated rechargeable battery, and we did"
    },
    {
      "Time_Start": 974.0,
      "Time_End": 979.0400000000001,
      "Text": " like that design at first, because it's a lot more convenient for, like, real deployments,"
    },
    {
      "Time_Start": 979.0799999999999,
      "Time_End": 982.92,
      "Text": " like actually standing beside someone on the bus and trying to relay their card, than running"
    },
    {
      "Time_Start": 982.92,
      "Time_End": 986.1999999999999,
      "Text": " a cable up their sleeve, you get to put it a bit further away, you don't have that whole"
    },
    {
      "Time_Start": 986.1999999999999,
      "Time_End": 991.68,
      "Text": " cable to deal with, but the ability of the Proxmark that's pretending to be a reader"
    },
    {
      "Time_Start": 991.68,
      "Time_End": 997.3399999999999,
      "Text": " to read the card, which is its job, is very dependent on the battery level."
    },
    {
      "Time_Start": 997.3399999999999,
      "Time_End": 999.9599999999999,
      "Text": " If it's too high, we get bad reads."
    },
    {
      "Time_Start": 999.9599999999999,
      "Time_End": 1002.88,
      "Text": " If it's too low, we also get bad reads."
    },
    {
      "Time_Start": 1002.88,
      "Time_End": 1005.86,
      "Text": " We're not entirely sure why that happens."
    },
    {
      "Time_Start": 1005.86,
      "Time_End": 1009.82,
      "Text": " We think it's related to, like, the voltage level being output by the battery, but we're"
    },
    {
      "Time_Start": 1009.82,
      "Time_End": 1012.1800000000001,
      "Text": " not 100% sure on that."
    },
    {
      "Time_Start": 1012.1800000000001,
      "Time_End": 1015.74,
      "Text": " It did prove very frustrating, like, while we were developing this, we developed little"
    },
    {
      "Time_Start": 1015.74,
      "Time_End": 1022.66,
      "Text": " rules of thumb, like, when it starts failing, plug it in for 12 minutes and try again, and"
    },
    {
      "Time_Start": 1022.66,
      "Time_End": 1027.9,
      "Text": " that kind of worked, but it wasn't very nice."
    },
    {
      "Time_Start": 1027.9,
      "Time_End": 1030.1,
      "Text": " The other problem was latency."
    },
    {
      "Time_Start": 1030.1,
      "Time_End": 1035.86,
      "Text": " So we can make the reader accept ridiculous amounts of latency, but on the card side,"
    },
    {
      "Time_Start": 1035.86,
      "Time_End": 1041.34,
      "Text": " real cards are designed under the assumption that the reader will respond within at most"
    },
    {
      "Time_Start": 1041.34,
      "Time_End": 1046.54,
      "Text": " a few milliseconds and typically much faster, and we blow that assumption out of the water"
    },
    {
      "Time_Start": 1046.54,
      "Time_End": 1051.1,
      "Text": " by several orders of magnitude when we're doing this over longer ranges."
    },
    {
      "Time_Start": 1051.1,
      "Time_End": 1055.1399999999999,
      "Text": " So we find that the card sometimes, like, forgets that it's supposed to be in the middle"
    },
    {
      "Time_Start": 1055.14,
      "Time_End": 1061.38,
      "Text": " of an authentication attempt, and this happens increasingly often as the latency increases."
    },
    {
      "Time_Start": 1061.38,
      "Time_End": 1065.66,
      "Text": " This isn't, like, necessarily a deal breaker by itself, because it just means you need"
    },
    {
      "Time_Start": 1065.66,
      "Time_End": 1069.22,
      "Text": " to retry from the beginning, so if your guy is still standing beside the guy in public"
    },
    {
      "Time_Start": 1069.22,
      "Time_End": 1073.74,
      "Text": " transit, you're good to go, but maybe it's a little suspicious if you're standing beside"
    },
    {
      "Time_Start": 1073.74,
      "Time_End": 1077.5,
      "Text": " a reader for two minutes waiting for the door to open."
    },
    {
      "Time_Start": 1077.5,
      "Time_End": 1079.1000000000001,
      "Text": " Not the best."
    },
    {
      "Time_Start": 1079.1000000000001,
      "Time_End": 1082.18,
      "Text": " And different cards could be more resilient to this."
    },
    {
      "Time_Start": 1082.18,
      "Time_End": 1086.3400000000001,
      "Text": " Most of our observations here were with CEOS cards in particular."
    },
    {
      "Time_Start": 1086.3400000000001,
      "Time_End": 1090.9,
      "Text": " We actually only tested with Deskfire for the first time earlier today before we went"
    },
    {
      "Time_Start": 1090.9,
      "Time_End": 1091.9,
      "Text": " to sleep."
    },
    {
      "Time_Start": 1091.9,
      "Time_End": 1094.8400000000001,
      "Text": " It was hard to source a card."
    },
    {
      "Time_Start": 1094.8400000000001,
      "Time_End": 1099.94,
      "Text": " So between that and the battery issues, the initial design was not reliable."
    },
    {
      "Time_Start": 1099.94,
      "Time_End": 1105.22,
      "Text": " It was usable, not really reliable, but usable within the same city, and even then, I'd say"
    },
    {
      "Time_Start": 1105.22,
      "Time_End": 1111.1000000000001,
      "Text": " this was a practical attack that higher security, higher value facilities would be more concerned"
    },
    {
      "Time_Start": 1111.1000000000001,
      "Time_End": 1116.42,
      "Text": " about, but it was much harder to make it work over longer distances, and even in the"
    },
    {
      "Time_Start": 1116.42,
      "Time_End": 1119.0600000000002,
      "Text": " same city, it wasn't perfectly reliable."
    },
    {
      "Time_Start": 1119.0600000000002,
      "Time_End": 1123.42,
      "Text": " So our revised design, we incorporated quite a few changes."
    },
    {
      "Time_Start": 1123.42,
      "Time_End": 1126.1000000000001,
      "Text": " So first off, we swapped laptops with phones."
    },
    {
      "Time_Start": 1126.1000000000001,
      "Time_End": 1131.0600000000002,
      "Text": " Laptop in your backpack is fine, but phone in your pocket is even better, and then more"
    },
    {
      "Time_Start": 1131.0600000000002,
      "Time_End": 1136.5000000000002,
      "Text": " importantly, we swapped that little Bluetooth link there with a serial link, and we're also"
    },
    {
      "Time_Start": 1136.5000000000002,
      "Time_End": 1139.8200000000002,
      "Text": " powering the Proxmark from the phone over that serial link."
    },
    {
      "Time_Start": 1139.82,
      "Time_End": 1143.22,
      "Text": " So we knocked out the battery, and we knocked out Bluetooth."
    },
    {
      "Time_Start": 1143.22,
      "Time_End": 1148.3,
      "Text": " Bluetooth was nice, but Bluetooth classic is a horrible protocol, and 15 milliseconds"
    },
    {
      "Time_Start": 1148.3,
      "Time_End": 1154.06,
      "Text": " of latency on each side, 100 milliseconds total, when Florida to Ottawa is only a 99-millisecond"
    },
    {
      "Time_Start": 1154.06,
      "Time_End": 1155.06,
      "Text": " ping."
    },
    {
      "Time_Start": 1155.06,
      "Time_End": 1159.9399999999998,
      "Text": " That's almost doubling it, and we didn't really want to eat that, and getting rid of that"
    },
    {
      "Time_Start": 1159.9399999999998,
      "Time_End": 1162.8999999999999,
      "Text": " really did increase our reliability."
    },
    {
      "Time_Start": 1162.8999999999999,
      "Time_End": 1168.4199999999998,
      "Text": " Additionally, just operated over a cell network where phones will not have public IPs, instead"
    },
    {
      "Time_Start": 1168.42,
      "Time_End": 1175.02,
      "Text": " of them connecting directly to each other, we have a little relay server just hosted"
    },
    {
      "Time_Start": 1175.02,
      "Time_End": 1179.24,
      "Text": " in DigitalOcean in between them."
    },
    {
      "Time_Start": 1179.24,
      "Time_End": 1185.78,
      "Text": " So the software in our revised design is called HFCardHopper, it's a new module for Iceman's"
    },
    {
      "Time_Start": 1185.78,
      "Time_End": 1190.7,
      "Text": " Proxmark 3 firmware, we're releasing it later this week whenever I get around to doing a"
    },
    {
      "Time_Start": 1190.7,
      "Time_End": 1192.5,
      "Text": " pull request."
    },
    {
      "Time_Start": 1192.5,
      "Time_End": 1199.1,
      "Text": " It's inspired by Salvador Mendoza's original design, but doesn't share any code, and it"
    },
    {
      "Time_Start": 1199.1,
      "Time_End": 1203.78,
      "Text": " has the code to trick readers into using a longer frame rating time."
    },
    {
      "Time_Start": 1203.78,
      "Time_End": 1212.94,
      "Text": " It can relay any ISO 14443A protocol, and it actually has support for relaying that"
    },
    {
      "Time_Start": 1212.94,
      "Time_End": 1218.46,
      "Text": " initial UID and DATS, that doesn't matter so much for CEOS, because the UID is random"
    },
    {
      "Time_Start": 1218.46,
      "Time_End": 1224.22,
      "Text": " each time, but for Deathfire, that UID actually contributes material to later cryptographic"
    },
    {
      "Time_Start": 1224.22,
      "Time_End": 1229.14,
      "Text": " operations, so to get it to match up on both sides, you do need to get that right."
    },
    {
      "Time_Start": 1229.14,
      "Time_End": 1234.18,
      "Text": " Now, because that's sent over DATS, we can't actually relay that in realtime, because the"
    },
    {
      "Time_Start": 1234.18,
      "Time_End": 1239.38,
      "Text": " modified frame rating time won't apply, but it doesn't actually change, like, well, for"
    },
    {
      "Time_Start": 1239.38,
      "Time_End": 1243.8600000000001,
      "Text": " when it matters, it doesn't change, so Deathfire codes always give the same UID, so if you"
    },
    {
      "Time_Start": 1243.8600000000001,
      "Time_End": 1248.3000000000002,
      "Text": " just read it once, then transmit it, then the Proxmark can set itself up to emulate"
    },
    {
      "Time_Start": 1248.3000000000002,
      "Time_End": 1252.9,
      "Text": " that specific card, and that doesn't have to happen in realtime, which is nice, and"
    },
    {
      "Time_Start": 1252.9,
      "Time_End": 1258.42,
      "Text": " it works with BlueShark and our custom hardware, which handles that CO link, which my colleague"
    },
    {
      "Time_Start": 1258.42,
      "Time_End": 1260.8600000000001,
      "Text": " Trevor will talk to you about."
    },
    {
      "Time_Start": 1260.8600000000001,
      "Time_End": 1267.6200000000001,
      "Text": " Yeah, so as Sam mentioned, we wanted to swap out the Bluetooth module, mainly because of"
    },
    {
      "Time_Start": 1267.6200000000001,
      "Time_End": 1276.46,
      "Text": " latency issues, so we came up with another module that is USB to UART bridge, basically."
    },
    {
      "Time_Start": 1276.46,
      "Time_End": 1282.38,
      "Text": " If you're familiar with things like the Shikra, it uses the FT232 chip that's in the Shikra,"
    },
    {
      "Time_Start": 1282.38,
      "Time_End": 1287.1000000000001,
      "Text": " we just modified the design to have a USB-C, which is much more convenient for connecting"
    },
    {
      "Time_Start": 1287.1000000000001,
      "Time_End": 1293.22,
      "Text": " to modern phones, and then a ribbon cable for connecting to the Proxmark."
    },
    {
      "Time_Start": 1293.22,
      "Time_End": 1297.9,
      "Text": " We chose to use a ribbon cable to connect to that interface on the Proxmark for a couple"
    },
    {
      "Time_Start": 1297.9,
      "Time_End": 1298.9,
      "Text": " of reasons."
    },
    {
      "Time_Start": 1298.9,
      "Time_End": 1304.3,
      "Text": " A, we think it's a little bit faster, we're directly connecting to the Proxmark over USART,"
    },
    {
      "Time_Start": 1304.3,
      "Time_End": 1308.46,
      "Text": " whereas if you're connecting to the USB on the side of the Proxmark, that's actually"
    },
    {
      "Time_Start": 1308.46,
      "Time_End": 1314.34,
      "Text": " an emulated modem, so that would add a little bit of latency, but also this makes it completely"
    },
    {
      "Time_Start": 1314.34,
      "Time_End": 1319.18,
      "Text": " interchangeable with the BlueShark add-on, so if you wanted to use the BlueShark for"
    },
    {
      "Time_Start": 1319.18,
      "Time_End": 1325.22,
      "Text": " wire-free, our emulator, the standalone mode will still work with the BlueShark and with"
    },
    {
      "Time_Start": 1325.22,
      "Time_End": 1327.38,
      "Text": " this interchangeably."
    },
    {
      "Time_Start": 1327.38,
      "Time_End": 1333.0600000000002,
      "Text": " We did have one little hiccup when creating these and ordering these for DEF CON, it turns"
    },
    {
      "Time_Start": 1333.0600000000002,
      "Time_End": 1339.1000000000001,
      "Text": " out that just casually mentioning that you need a 14-pin, 0.5-millimeter spaced ribbon"
    },
    {
      "Time_Start": 1339.1000000000001,
      "Time_End": 1344.14,
      "Text": " cable adapter is not enough to make sure it actually gets ordered properly, so, you know,"
    },
    {
      "Time_Start": 1344.14,
      "Time_End": 1345.6200000000001,
      "Text": " lessons learned."
    },
    {
      "Time_Start": 1345.6200000000001,
      "Time_End": 1353.3000000000002,
      "Text": " We managed to get it reordered, rebuilt, props to one of my colleagues who actually disassembled"
    },
    {
      "Time_Start": 1353.3000000000002,
      "Time_End": 1358.22,
      "Text": " half a dozen of these, and if you see one of these, if you come up, I'll show you, there's"
    },
    {
      "Time_Start": 1358.22,
      "Time_End": 1360.7800000000002,
      "Text": " a lot of tiny little components in here."
    },
    {
      "Time_Start": 1360.7800000000002,
      "Time_End": 1366.5,
      "Text": " He took every single component off and resoldered it onto a new board with the right pin header,"
    },
    {
      "Time_Start": 1366.5,
      "Time_End": 1369.94,
      "Text": " and that's the board that's being used in Ottawa right now for the other side of this"
    },
    {
      "Time_Start": 1369.94,
      "Time_End": 1372.26,
      "Text": " demo, so appreciate that."
    },
    {
      "Time_Start": 1372.26,
      "Time_End": 1376.78,
      "Text": " That was a lot of hard work, I know."
    },
    {
      "Time_Start": 1376.78,
      "Time_End": 1382.66,
      "Text": " And then the other thing we added is a custom Android app, so to make it easy to interface"
    },
    {
      "Time_Start": 1382.66,
      "Time_End": 1387.42,
      "Text": " with the Proxmark, we created an Android app that will bridge the communication between"
    },
    {
      "Time_Start": 1387.42,
      "Time_End": 1393.7,
      "Text": " the FTDI and, therefore, the Proxmark and the Relay server, and it supports card or"
    },
    {
      "Time_Start": 1393.7,
      "Time_End": 1394.7,
      "Text": " reader modes."
    },
    {
      "Time_Start": 1394.7,
      "Time_End": 1398.7,
      "Text": " You can alternate it, and it supports CLS and DESFire cards, and you can adjust the"
    },
    {
      "Time_Start": 1398.7,
      "Time_End": 1404.42,
      "Text": " frame rating values for your specific target, and it also will handle hardware resets, because"
    },
    {
      "Time_Start": 1404.42,
      "Time_End": 1408.46,
      "Text": " we came across a lot of those, so we needed to build that in to be able to quickly reset"
    },
    {
      "Time_Start": 1408.46,
      "Time_End": 1415.26,
      "Text": " and start over again, so it's quite easy to start over with that, but I will say it is"
    },
    {
      "Time_Start": 1415.26,
      "Time_End": 1418.64,
      "Text": " my first Android app, I've never done this before, and we kind of just went function"
    },
    {
      "Time_Start": 1418.64,
      "Time_End": 1419.64,
      "Text": " over style."
    },
    {
      "Time_Start": 1419.64,
      "Time_End": 1422.1000000000001,
      "Text": " I know it's pretty ugly, but it works."
    },
    {
      "Time_Start": 1422.1000000000001,
      "Time_End": 1427.98,
      "Text": " All right, so let's go over some of the results before we get into the demo."
    },
    {
      "Time_Start": 1427.98,
      "Time_End": 1435.14,
      "Text": " So we've tested this on a variety of different HID readers, so the first couple are older"
    },
    {
      "Time_Start": 1435.14,
      "Time_End": 1442.22,
      "Text": " generation HID multiclass readers, the RP40 and the RPK40, a couple of different models,"
    },
    {
      "Time_Start": 1442.22,
      "Time_End": 1448.26,
      "Text": " but these are ones that will accept both low frequency and high frequency cards, so there"
    },
    {
      "Time_Start": 1448.26,
      "Time_End": 1453.66,
      "Text": " is some requirement for them to adjust the frame rating time, because older cards are"
    },
    {
      "Time_Start": 1453.66,
      "Time_End": 1460.66,
      "Text": " a bit slower, so it makes sense that adjusting them was a successful attack, but the one"
    },
    {
      "Time_Start": 1460.66,
      "Time_End": 1465.7,
      "Text": " that was a little more surprising was the Signo readers from HID, which are their latest"
    },
    {
      "Time_Start": 1465.7,
      "Time_End": 1473.9,
      "Text": " and greatest readers, and there's three variants of them, 00, 01, 02, and the difference in"
    },
    {
      "Time_Start": 1473.9,
      "Time_End": 1478.3000000000002,
      "Text": " those is the protocols that it supports, so 01 is kind of like your multiclass, it will"
    },
    {
      "Time_Start": 1478.3,
      "Time_End": 1486.1,
      "Text": " support the low frequency and high frequency, sorry, that's the 00, the 01, I think, is"
    },
    {
      "Time_Start": 1486.1,
      "Time_End": 1495.8999999999999,
      "Text": " the only CEOS protocol, CEOS and Dezfire, and then 02 is CEOS, Dezfire, and smartphones."
    },
    {
      "Time_Start": 1495.8999999999999,
      "Time_End": 1500.6599999999999,
      "Text": " So that one's the one that to me is surprising that the frame rating time attack works on,"
    },
    {
      "Time_Start": 1500.6599999999999,
      "Time_End": 1505.1399999999999,
      "Text": " because especially for the 01 and 02, they're only talking to high frequency cards that"
    },
    {
      "Time_Start": 1505.14,
      "Time_End": 1511.74,
      "Text": " are, you know, fast, quick responding cards, there's really no need for them to have the,"
    },
    {
      "Time_Start": 1511.74,
      "Time_End": 1516.1000000000001,
      "Text": " to accept an increased waiting time."
    },
    {
      "Time_Start": 1516.1000000000001,
      "Time_End": 1520.22,
      "Text": " In terms of the card technologies, most of our research was focused on CEOS, because"
    },
    {
      "Time_Start": 1520.22,
      "Time_End": 1525.38,
      "Text": " as I said, this was motivated by a specific engagement we were trying to get into a building,"
    },
    {
      "Time_Start": 1525.38,
      "Time_End": 1532.94,
      "Text": " but we have since, as of last night at 1 a.m. in the morning, acquired an EV1 card and compatible"
    },
    {
      "Time_Start": 1532.94,
      "Time_End": 1538.06,
      "Text": " reader and we're able to test and it does work for EV1 cards as well."
    },
    {
      "Time_Start": 1538.06,
      "Time_End": 1544.26,
      "Text": " The other ones that we haven't tested with and we want to are the EV2 and EV3."
    },
    {
      "Time_Start": 1544.26,
      "Time_End": 1550.5,
      "Text": " The problem with that is, so EV cards are not super common in HID access control systems,"
    },
    {
      "Time_Start": 1550.5,
      "Time_End": 1557.66,
      "Text": " and so getting an EV1 card or an EV2 card that is programmed with an HID secure identity"
    },
    {
      "Time_Start": 1557.66,
      "Time_End": 1563.3400000000001,
      "Text": " object, which is the object that they write in the card to, for the reader to unpack and"
    },
    {
      "Time_Start": 1563.3400000000001,
      "Time_End": 1569.22,
      "Text": " pull the identification out of, so to get a code, a card coded for that is quite challenging"
    },
    {
      "Time_Start": 1569.22,
      "Time_End": 1573.94,
      "Text": " and quite expensive, so we haven't come across those cards yet."
    },
    {
      "Time_Start": 1573.94,
      "Time_End": 1579.5,
      "Text": " But the interesting thing about those is that NXP does have a patent for being able to do"
    },
    {
      "Time_Start": 1579.5,
      "Time_End": 1584.98,
      "Text": " the proximity check for communication devices, so based on that, these two technologies should"
    },
    {
      "Time_Start": 1584.98,
      "Time_End": 1590.38,
      "Text": " be immune to our relay attack because they should be able to detect the proximity of"
    },
    {
      "Time_Start": 1590.38,
      "Time_End": 1596.82,
      "Text": " the card, but it's something we would like to verify and try for ourselves."
    },
    {
      "Time_Start": 1596.82,
      "Time_End": 1602.94,
      "Text": " In terms of distances, we started out in our lab just across the room 12 feet, one of us"
    },
    {
      "Time_Start": 1602.94,
      "Time_End": 1609.02,
      "Text": " took the readers home, went back from our house to the office, tried that, and then"
    },
    {
      "Time_Start": 1609.02,
      "Time_End": 1613.66,
      "Text": " as Sam mentioned, when I went down to Florida, I took the card with me, we relayed it from"
    },
    {
      "Time_Start": 1613.66,
      "Time_End": 1619.8200000000002,
      "Text": " Florida back to Ottawa, which is about 1,400 miles of distance that we're going across,"
    },
    {
      "Time_Start": 1619.8200000000002,
      "Time_End": 1623.96,
      "Text": " and then earlier today in the green room, we finally got a successful test of doing"
    },
    {
      "Time_Start": 1623.96,
      "Time_End": 1628.78,
      "Text": " Vegas to Ottawa, and I say finally got a successful, we just didn't have an opportunity because"
    },
    {
      "Time_Start": 1628.78,
      "Time_End": 1633.1000000000001,
      "Text": " production issues on the card hoppers, it actually worked quite smoothly, quite well,"
    },
    {
      "Time_Start": 1633.1000000000001,
      "Time_End": 1639.74,
      "Text": " so that's about 2,400 miles now we've gone."
    },
    {
      "Time_Start": 1639.74,
      "Time_End": 1650.26,
      "Text": " Can we do it on stage, is that possible?"
    },
    {
      "Time_Start": 1650.26,
      "Time_End": 1657.74,
      "Text": " So I better text my colleague on the other side who's waiting for us to say we're ready,"
    },
    {
      "Time_Start": 1657.74,
      "Time_End": 1660.14,
      "Text": " so I'll tell them to join now."
    },
    {
      "Time_Start": 1660.14,
      "Time_End": 1663.66,
      "Text": " We also would like to test this further, so if there are people here that are interested"
    },
    {
      "Time_Start": 1663.66,
      "Time_End": 1670.3400000000001,
      "Text": " in collaborating with us, if you live farther away, Brazil or other places that we can try"
    },
    {
      "Time_Start": 1670.3400000000001,
      "Time_End": 1676.6200000000001,
      "Text": " this out and see how far we can push this distance, come chat with us afterwards."
    },
    {
      "Time_Start": 1676.6200000000001,
      "Time_End": 1695.0200000000002,
      "Text": " All right, so we are good to go, they're ready on their side, let's jump on."
    },
    {
      "Time_Start": 1695.0200000000002,
      "Time_End": 1703.1000000000001,
      "Text": " Hello, I don't think the sound is working."
    },
    {
      "Time_Start": 1703.1000000000001,
      "Time_End": 1715.2600000000002,
      "Text": " Welcome Noon and Liz to DEF CON, everyone say hello."
    },
    {
      "Time_Start": 1715.2600000000002,
      "Time_End": 1718.5400000000002,
      "Text": " All right, so Liz is just going to demonstrate right now that she can't get into the door,"
    },
    {
      "Time_Start": 1718.5400000000002,
      "Time_End": 1724.5800000000002,
      "Text": " it's locked, right, and just presenting the reader that she has to the door is not going"
    },
    {
      "Time_Start": 1724.5800000000002,
      "Time_End": 1727.8600000000001,
      "Text": " to work because we're not relaying a card at this point, so if she puts it up against"
    },
    {
      "Time_Start": 1727.8600000000001,
      "Time_End": 1735.5800000000002,
      "Text": " the door, if you put the thing up against the reader, yeah, exactly, it doesn't work"
    },
    {
      "Time_Start": 1735.5800000000002,
      "Time_End": 1737.3400000000001,
      "Text": " because we need to relay the card."
    },
    {
      "Time_Start": 1737.3400000000001,
      "Time_End": 1741.42,
      "Text": " All right, you ready to go, Sam?"
    },
    {
      "Time_Start": 1741.42,
      "Time_End": 1745.18,
      "Text": " Liz you ready to go, give me a thumbs up when you're ready."
    },
    {
      "Time_Start": 1745.18,
      "Time_End": 1756.94,
      "Text": " Thumbs up, let's see."
    },
    {
      "Time_Start": 1756.94,
      "Time_End": 1762.18,
      "Text": " I think we need to do a reset on her side, one sec, sorry."
    },
    {
      "Time_Start": 1762.18,
      "Time_End": 1769.5,
      "Text": " This is what happens when we do it live, right?"
    },
    {
      "Time_Start": 1769.5,
      "Time_End": 1775.3,
      "Text": " She's working with the pre-production version, the one that my colleague put together by"
    },
    {
      "Time_Start": 1775.3,
      "Time_End": 1786.6200000000001,
      "Text": " hand, so it's not the most, you know, production ready system, so we'll give her another second"
    },
    {
      "Time_Start": 1786.6200000000001,
      "Time_End": 1787.6200000000001,
      "Text": " here."
    },
    {
      "Time_Start": 1787.6200000000001,
      "Time_End": 1802.8600000000001,
      "Text": " All right, she's good to go, we're good to go, all right, go for it, Sam, put it closer"
    },
    {
      "Time_Start": 1802.8600000000001,
      "Time_End": 1816.14,
      "Text": " to the reader, yeah, all right, we're going to try it one more time, if not we'll switch,"
    },
    {
      "Time_Start": 1816.14,
      "Time_End": 1826.14,
      "Text": " just pull back Liz and cancel, we'll try again, give me a thumbs up when you're ready"
    },
    {
      "Time_Start": 1826.14,
      "Time_End": 1828.5400000000002,
      "Text": " to go."
    },
    {
      "Time_Start": 1828.5400000000002,
      "Time_End": 1831.42,
      "Text": " If this doesn't work, we'll switch to the video of us doing it previously in the green"
    },
    {
      "Time_Start": 1831.42,
      "Time_End": 1844.5800000000002,
      "Text": " room just to prove, okay, I think she's good, and it's not working, all right, well, I guess"
    },
    {
      "Time_Start": 1844.58,
      "Time_End": 1851.1,
      "Text": " that's where we're going to jump to video, demo gods prove too much for us."
    },
    {
      "Time_Start": 1851.1,
      "Time_End": 1862.6599999999999,
      "Text": " Thanks anyway, Liz, Noon, thank you, all right, so we kind of planned for this, that's fine,"
    },
    {
      "Time_Start": 1862.6599999999999,
      "Time_End": 1870.1799999999998,
      "Text": " so this is what it should have looked like, so when she puts it up to the reader, it does"
    },
    {
      "Time_Start": 1870.18,
      "Time_End": 1874.78,
      "Text": " take some time, because we're relaying these messages one at a time over the internet,"
    },
    {
      "Time_Start": 1874.78,
      "Time_End": 1879.46,
      "Text": " so it's not as quick as normally when you push it up against the reader, but after a"
    },
    {
      "Time_Start": 1879.46,
      "Time_End": 1893.9,
      "Text": " certain amount of time, it does work, and she can open the door."
    },
    {
      "Time_Start": 1893.9,
      "Time_End": 1899.1000000000001,
      "Text": " So on the phone side, this is what you would have seen if you were looking at the phone,"
    },
    {
      "Time_Start": 1899.1000000000001,
      "Time_End": 1905.42,
      "Text": " so we connect the card hopper, card hopper is the term we're giving this board, we connect"
    },
    {
      "Time_Start": 1905.42,
      "Time_End": 1911.8600000000001,
      "Text": " it to the phone, we put the phone into reader mode, we don't adjust the frame waiting time,"
    },
    {
      "Time_Start": 1911.8600000000001,
      "Time_End": 1918.14,
      "Text": " because it's fine, and then we start seeing all the messages flying back and forth, you"
    },
    {
      "Time_Start": 1918.14,
      "Time_End": 1921.1000000000001,
      "Text": " can see there's quite a few of them going back and forth, we don't really care what"
    },
    {
      "Time_Start": 1921.1000000000001,
      "Time_End": 1927.8600000000001,
      "Text": " they are, they're right, they're fine, and that's the, at that point, we're done, we've"
    },
    {
      "Time_Start": 1927.8600000000001,
      "Time_End": 1930.38,
      "Text": " opened the door."
    },
    {
      "Time_Start": 1930.38,
      "Time_End": 1935.5000000000002,
      "Text": " So yeah, I said we don't care about the waiting time, we default it to 14, which is the max,"
    },
    {
      "Time_Start": 1935.5000000000002,
      "Time_End": 1939.2600000000002,
      "Text": " so we're just leaving it at the max, and it's working fine."
    },
    {
      "Time_Start": 1939.2600000000002,
      "Time_End": 1944.18,
      "Text": " On our side here, this is what you would see, so this was us in the green room."
    },
    {
      "Time_Start": 1944.18,
      "Time_End": 1951.5400000000002,
      "Text": " So I put the card up against the reader, and wait, and it goes through that back and forth,"
    },
    {
      "Time_Start": 1951.54,
      "Time_End": 1961.54,
      "Text": " back and forth, back and forth, and then boom, we're done."
    },
    {
      "Time_Start": 1961.54,
      "Time_End": 1967.06,
      "Text": " So it does take more time, it is a little bit more conspicuous, it's not necessarily"
    },
    {
      "Time_Start": 1967.06,
      "Time_End": 1972.74,
      "Text": " the stealthiest of attack, but hey, being able to relay a card from here, 2400 miles"
    },
    {
      "Time_Start": 1972.74,
      "Time_End": 1977.06,
      "Text": " away I think is pretty good."
    },
    {
      "Time_Start": 1977.06,
      "Time_End": 1983.5,
      "Text": " So the other slide, a couple of other slides we wanted to show, the prevalence of the different"
    },
    {
      "Time_Start": 1983.5,
      "Time_End": 1984.5,
      "Text": " technologies."
    },
    {
      "Time_Start": 1984.5,
      "Time_End": 1988.74,
      "Text": " So unfortunately, there's a weird trend in the access control industry that they don't"
    },
    {
      "Time_Start": 1988.74,
      "Time_End": 1991.3799999999999,
      "Text": " necessarily move to the newest technologies right away."
    },
    {
      "Time_Start": 1991.3799999999999,
      "Time_End": 1997.98,
      "Text": " We're still using a lot of the old technologies, so the 125K HID proc stuff I mentioned still"
    },
    {
      "Time_Start": 1997.98,
      "Time_End": 2001.74,
      "Text": " has about 32% of the market."
    },
    {
      "Time_Start": 2001.74,
      "Time_End": 2008.7,
      "Text": " Pretty small market percentage for the CEOS, and even smaller for some of the MyFair cards"
    },
    {
      "Time_Start": 2008.7,
      "Time_End": 2011.5,
      "Text": " individually."
    },
    {
      "Time_Start": 2011.5,
      "Time_End": 2015.18,
      "Text": " But it's interesting to note that these technologies have been around for a while, like CEOS came"
    },
    {
      "Time_Start": 2015.18,
      "Time_End": 2025.94,
      "Text": " out in 2012, EV1 2006, so it's unfortunate that the industry has not adopted these as"
    },
    {
      "Time_Start": 2025.94,
      "Time_End": 2035.42,
      "Text": " quickly as they probably should have."
    },
    {
      "Time_Start": 2035.42,
      "Time_End": 2038.8600000000001,
      "Text": " So the other point that we wanted to make was that most of the ones that are currently"
    },
    {
      "Time_Start": 2038.8600000000001,
      "Time_End": 2045.26,
      "Text": " in use, aside from the EV2, EV3, are vulnerable to some sort of attack at this point."
    },
    {
      "Time_Start": 2045.26,
      "Time_End": 2049.66,
      "Text": " So most of the access control industry is still vulnerable."
    },
    {
      "Time_Start": 2049.66,
      "Time_End": 2052.62,
      "Text": " So I also want to talk a little bit about HID's response."
    },
    {
      "Time_Start": 2052.62,
      "Time_End": 2057.14,
      "Text": " So we did a responsible disclosure of this through BugCrowd."
    },
    {
      "Time_Start": 2057.14,
      "Time_End": 2061.06,
      "Text": " We disclosed it to BugCrowd on December 9th of 2022."
    },
    {
      "Time_Start": 2061.06,
      "Time_End": 2066.02,
      "Text": " It was triaged by HID on January 17th, and then we got their final response on March"
    },
    {
      "Time_Start": 2066.02,
      "Time_End": 2067.02,
      "Text": " 10th."
    },
    {
      "Time_Start": 2067.02,
      "Time_End": 2080.5,
      "Text": " I'm sorry, I'm just not showing the presentation mode, I should have switched back."
    },
    {
      "Time_Start": 2080.5,
      "Time_End": 2081.5,
      "Text": " That's why."
    },
    {
      "Time_Start": 2081.5,
      "Time_End": 2082.5,
      "Text": " All right."
    },
    {
      "Time_Start": 2083.38,
      "Time_End": 2087.22,
      "Text": " So one of the recommendations we made to HID was that they should limit that frame waiting"
    },
    {
      "Time_Start": 2087.22,
      "Time_End": 2093.18,
      "Text": " time integer, not accept values over what are strictly necessary."
    },
    {
      "Time_Start": 2093.18,
      "Time_End": 2096.22,
      "Text": " And they didn't like that idea because it would put them out of compliance with the"
    },
    {
      "Time_Start": 2096.22,
      "Time_End": 2102.62,
      "Text": " ISO spec, and it would impact their customers' needs for backward compatibility."
    },
    {
      "Time_Start": 2102.62,
      "Time_End": 2109.34,
      "Text": " I don't know any customer that needs a five-second waiting time for backward compatibility, but"
    },
    {
      "Time_Start": 2109.34,
      "Time_End": 2112.26,
      "Text": " that's what they felt like."
    },
    {
      "Time_Start": 2112.26,
      "Time_End": 2116.82,
      "Text": " The other comment that got to me a little bit was that the majority of their end users"
    },
    {
      "Time_Start": 2116.82,
      "Time_End": 2120.98,
      "Text": " do not see relay attacks as a viable threat."
    },
    {
      "Time_Start": 2120.98,
      "Time_End": 2124.5400000000004,
      "Text": " That was the motivation for coming here today, for doing the additional work of creating"
    },
    {
      "Time_Start": 2124.5400000000004,
      "Time_End": 2125.6600000000003,
      "Text": " the pieces."
    },
    {
      "Time_Start": 2125.6600000000003,
      "Time_End": 2130.86,
      "Text": " We wanted to show that this is a viable, feasible threat, something that could be done with"
    },
    {
      "Time_Start": 2130.86,
      "Time_End": 2138.1200000000003,
      "Text": " simple technology from the Proxmark, a small little add-on, and the relay server."
    },
    {
      "Time_Start": 2138.12,
      "Time_End": 2142.56,
      "Text": " The one comment that they did make, which has, I think, some good validity, is that"
    },
    {
      "Time_Start": 2142.56,
      "Time_End": 2149.72,
      "Text": " their end users that are concerned will typically add a second factor, PIN or biometric, and"
    },
    {
      "Time_Start": 2149.72,
      "Time_End": 2152.0,
      "Text": " some will use their mobile credentials."
    },
    {
      "Time_Start": 2152.0,
      "Time_End": 2157.08,
      "Text": " But the one problem that we see with this is, okay, now everybody has to enter a six-digit"
    },
    {
      "Time_Start": 2157.08,
      "Time_End": 2158.08,
      "Text": " PIN."
    },
    {
      "Time_Start": 2158.08,
      "Time_End": 2162.2799999999997,
      "Text": " Can you imagine the lineups going in and out of that building?"
    },
    {
      "Time_Start": 2162.2799999999997,
      "Time_End": 2167.44,
      "Text": " Six-digit PINs or biometrics are good, but they're not always the most usable or user-friendly"
    },
    {
      "Time_Start": 2168.0,
      "Time_End": 2172.0,
      "Text": " especially when you're trying to manage large amounts of people going in and coming out."
    },
    {
      "Time_Start": 2175.0,
      "Time_End": 2178.04,
      "Text": " All right, so that's the end of our presentation."
    },
    {
      "Time_Start": 2178.04,
      "Time_End": 2182.88,
      "Text": " We have some extra of the little boards, the Cardhopper boards that we printed, the correct"
    },
    {
      "Time_Start": 2182.88,
      "Time_End": 2186.04,
      "Text": " ones now."
    },
    {
      "Time_Start": 2186.04,
      "Time_End": 2192.68,
      "Text": " We also run the embedded CTF, so if you come play in the embedded Village CTF, the top"
    },
    {
      "Time_Start": 2192.68,
      "Time_End": 2196.92,
      "Text": " three teams will get one of those boards, so come and play."
    },
    {
      "Time_Start": 2197.4,
      "Time_End": 2201.76,
      "Text": " If you're interested in collaborating, if you want to try testing this at further distances,"
    },
    {
      "Time_Start": 2201.76,
      "Time_End": 2206.6,
      "Text": " we're happy to share with you a card and a board, and we can see how far we can push"
    },
    {
      "Time_Start": 2206.6,
      "Time_End": 2208.56,
      "Text": " this."
    },
    {
      "Time_Start": 2208.56,
      "Time_End": 2211.8,
      "Text": " Come chat with us at the site afterwards, and thank you very much."
    },
    {
      "Time_Start": 2211.8,
      "Time_End": 2212.8,
      "Text": " Any questions?"
    },
    {
      "Time_Start": 2212.8,
      "Time_End": 2215.1200000000003,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2242.8,
      "Time_End": 2244.1800000000003,
      "Text": " They turn it back on."
    },
    {
      "Time_Start": 2244.1800000000003,
      "Time_End": 2247.02,
      "Text": " OK, you asked whether there's a subset of protocols"
    },
    {
      "Time_Start": 2247.02,
      "Time_End": 2248.3,
      "Text": " that are supported by this."
    },
    {
      "Time_Start": 2248.3,
      "Time_End": 2254.26,
      "Text": " So basically, any ISO 14443A, any technology"
    },
    {
      "Time_Start": 2254.26,
      "Time_End": 2258.42,
      "Text": " that uses that, which is most high-frequency cards,"
    },
    {
      "Time_Start": 2258.42,
      "Time_End": 2260.6200000000003,
      "Text": " they would be vulnerable to this kind of relay attack"
    },
    {
      "Time_Start": 2260.6200000000003,
      "Time_End": 2262.98,
      "Text": " because of that."
    },
    {
      "Time_Start": 2262.98,
      "Time_End": 2265.48,
      "Text": " So the most common that we come across in access control"
    },
    {
      "Time_Start": 2265.48,
      "Time_End": 2268.46,
      "Text": " are CEOS and EV1, 2, and 3."
    },
    {
      "Time_Start": 2268.46,
      "Time_End": 2270.02,
      "Text": " But I'm sure there are other ones"
    },
    {
      "Time_Start": 2270.02,
      "Time_End": 2271.48,
      "Text": " we're just not super familiar with."
    },
    {
      "Time_Start": 2272.8,
      "Time_End": 2274.36,
      "Text": " Thank you."
    }
  ]
}