{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.640000000000001,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thank you very much. I appreciate this is the last talk of the day, so thank you very"
    },
    {
      "Time_Start": 7.640000000000001,
      "Time_End": 12.52,
      "Text": " much for coming. Can you hear me okay? I feel like this isn't close enough. There we go."
    },
    {
      "Time_Start": 12.52,
      "Time_End": 17.240000000000002,
      "Text": " Okay. So today I'm going to be talking about the ways in which we can make hacking of medical"
    },
    {
      "Time_Start": 17.240000000000002,
      "Time_End": 23.68,
      "Text": " protocols a lot simpler. If we can make the identification of the weaknesses in this protocol"
    },
    {
      "Time_Start": 23.68,
      "Time_End": 28.8,
      "Text": " a lot easier, we can ensure that the devices using this protocol are a lot more secure"
    },
    {
      "Time_Start": 28.8,
      "Time_End": 34.8,
      "Text": " in the long run. In an ideal world, the only hacking that should be going on in hospitals"
    },
    {
      "Time_Start": 34.8,
      "Time_End": 40.64,
      "Text": " is the one that comes with a cough, right? But unfortunately that is not the case. There"
    },
    {
      "Time_Start": 40.64,
      "Time_End": 47.16,
      "Text": " are still so many attacks going on in healthcare. In particular, Checkpoint recently released"
    },
    {
      "Time_Start": 47.16,
      "Time_End": 54.88,
      "Text": " a blog post that stated a total of 1,684 attacks were observed on healthcare systems in just"
    },
    {
      "Time_Start": 54.88,
      "Time_End": 59.760000000000005,
      "Text": " the first three months of this year. Therefore, it's still really important to make sure that"
    },
    {
      "Time_Start": 59.760000000000005,
      "Time_End": 64.92,
      "Text": " we continue to test these devices and medical systems to make sure they're as secure as"
    },
    {
      "Time_Start": 64.92,
      "Time_End": 73.4,
      "Text": " they possibly can be. Okay. Just to quickly introduce myself. So my name is Katie Innes."
    },
    {
      "Time_Start": 73.4,
      "Time_End": 79.48,
      "Text": " I'm from the U.K. and I'm a security consultant at Weave Secure. I actually specialize in"
    },
    {
      "Time_Start": 79.48,
      "Time_End": 84.60000000000001,
      "Text": " attack surface management. So this topic and this research project is definitely a"
    },
    {
      "Time_Start": 84.60000000000001,
      "Time_End": 88.32000000000001,
      "Text": " step outside of my comfort zone, but it is something that I've been working on for the"
    },
    {
      "Time_Start": 88.32000000000001,
      "Time_End": 94.92,
      "Text": " past year or so. So let's talk about tech in healthcare. So technology has actually"
    },
    {
      "Time_Start": 94.92,
      "Time_End": 99.36,
      "Text": " been used in the healthcare industry for quite a long time now. And in particular, if we"
    },
    {
      "Time_Start": 99.36,
      "Time_End": 105.56,
      "Text": " look at x-rays, they were first used all the way back in 1985. So a long, long time ago."
    },
    {
      "Time_Start": 105.56,
      "Time_End": 111.0,
      "Text": " But what we really care about here is protecting individuals and their data. So if we look"
    },
    {
      "Time_Start": 111.0,
      "Time_End": 115.88,
      "Text": " at the systems and mechanisms to communicate that data, in fact, the first medical record"
    },
    {
      "Time_Start": 115.88,
      "Time_End": 121.12,
      "Text": " systems were deployed all the way back in the 60s. So again, a long time ago. And let's"
    },
    {
      "Time_Start": 121.12,
      "Time_End": 127.24000000000001,
      "Text": " take a look at some of those systems. So this is just an example of the types of device"
    },
    {
      "Time_Start": 127.24000000000001,
      "Time_End": 131.96,
      "Text": " that you might find in a hospital environment. And each one of these is considered a potential"
    },
    {
      "Time_Start": 131.96,
      "Time_End": 137.72,
      "Text": " access vector for an attacker. If we think about the data flow here, just as an example,"
    },
    {
      "Time_Start": 137.72,
      "Time_End": 141.84,
      "Text": " we might have a patient that has been admitted to a hospital. They might be hooked up to"
    },
    {
      "Time_Start": 141.84,
      "Time_End": 146.92000000000002,
      "Text": " a number of medical systems. And for example, their heart rate might be getting recorded"
    },
    {
      "Time_Start": 146.92000000000002,
      "Time_End": 152.36,
      "Text": " and stored within the data center. That particular patient might have had a number of tests."
    },
    {
      "Time_Start": 152.36,
      "Time_End": 157.20000000000002,
      "Text": " So for example, they might have had some blood tests that might be recorded within the lab."
    },
    {
      "Time_Start": 157.20000000000002,
      "Time_End": 162.48000000000002,
      "Text": " And again, those records are then stored within the data center. The pharmacist might"
    },
    {
      "Time_Start": 162.48000000000002,
      "Time_End": 167.28000000000003,
      "Text": " also need to query these records. So they might need to access the data center as well."
    },
    {
      "Time_Start": 167.28000000000003,
      "Time_End": 173.08,
      "Text": " And they might need these records to be able to prescribe the correct drugs. So how exactly"
    },
    {
      "Time_Start": 173.08,
      "Time_End": 178.12,
      "Text": " is this data communicated? So these are just a few of the protocols that are commonly used"
    },
    {
      "Time_Start": 178.12,
      "Time_End": 182.92000000000002,
      "Text": " in healthcare to communicate different types of data. The most commonly used protocol is"
    },
    {
      "Time_Start": 183.00000000000003,
      "Time_End": 188.36,
      "Text": " called Health Level 7, or HL7. And this is actually the focus for my research today and"
    },
    {
      "Time_Start": 188.36,
      "Time_End": 194.08,
      "Text": " this talk. The reason why I decided to focus on this protocol is in fact that a lot of"
    },
    {
      "Time_Start": 194.08,
      "Time_End": 198.4,
      "Text": " healthcare systems and medical devices are still using this protocol today, even though"
    },
    {
      "Time_Start": 198.4,
      "Time_End": 204.76000000000002,
      "Text": " it's quite old. There is another key protocol to mention here called FHIR, or Fast Healthcare"
    },
    {
      "Time_Start": 204.76000000000002,
      "Time_End": 210.68,
      "Text": " Interoperability Resources. And this was kind of designed to be a replacement for HL7 in"
    },
    {
      "Time_Start": 210.68,
      "Time_End": 216.20000000000002,
      "Text": " the long run. It was designed to be a little bit more secure. But in fact, Alissonite published"
    },
    {
      "Time_Start": 216.20000000000002,
      "Time_End": 220.44,
      "Text": " some research a couple of years ago, and they were able to access around 4 million records"
    },
    {
      "Time_Start": 220.44,
      "Time_End": 227.44,
      "Text": " through the exploitation of this particular protocol. Okay, so HL7 is a mechanism to communicate"
    },
    {
      "Time_Start": 230.76000000000002,
      "Time_End": 236.84,
      "Text": " patient data in clear text. It was designed all the way back in 1979. And if you look"
    },
    {
      "Time_Start": 236.84,
      "Time_End": 240.96,
      "Text": " across different types of medical devices, the most common version you'll see is in fact"
    },
    {
      "Time_Start": 240.96,
      "Time_End": 246.62,
      "Text": " version 2. That is the version that I'm going to be talking about today. And in fact, if"
    },
    {
      "Time_Start": 246.62,
      "Time_End": 250.92000000000002,
      "Text": " you did want to look into version 3, there are some complications here. In fact, it's"
    },
    {
      "Time_Start": 250.92000000000002,
      "Time_End": 257.2,
      "Text": " not backwards compatible. So that's partly why I'm focusing on version 2 as well. The"
    },
    {
      "Time_Start": 257.2,
      "Time_End": 262.78000000000003,
      "Text": " most common way to transport HL7 messages is through the minimal lower layer protocol."
    },
    {
      "Time_Start": 262.78000000000003,
      "Time_End": 267.58000000000004,
      "Text": " But it's not uncommon to see other types of protocol used to communicate HL7 messages,"
    },
    {
      "Time_Start": 267.58000000000004,
      "Time_End": 272.58000000000004,
      "Text": " such as FTP, SMTP. And of course, you've got all of the weaknesses associated with those"
    },
    {
      "Time_Start": 272.58000000000004,
      "Time_End": 279.02000000000004,
      "Text": " protocols to consider here as well. But the main thing to mention is that HL7 messages"
    },
    {
      "Time_Start": 279.02000000000004,
      "Time_End": 286.02000000000004,
      "Text": " are communicated in clear text. So what do HL7 messages look like? So each message is"
    },
    {
      "Time_Start": 287.02,
      "Time_End": 292.78,
      "Text": " made up of different segments. And you can see these by the first three letters on each"
    },
    {
      "Time_Start": 292.78,
      "Time_End": 297.97999999999996,
      "Text": " new line. And each segment contains a number of fields, which are separated with a pipe"
    },
    {
      "Time_Start": 297.97999999999996,
      "Time_End": 304.97999999999996,
      "Text": " character. Most commonly, you'll see the first segment, which is the message header. And"
    },
    {
      "Time_Start": 305.46,
      "Time_End": 310.18,
      "Text": " this contains all the different fields that are associated with that particular message."
    },
    {
      "Time_Start": 310.18,
      "Time_End": 315.82,
      "Text": " For example, you've got the message type, which in this case is admissions, discharges,"
    },
    {
      "Time_Start": 315.82,
      "Time_End": 322.65999999999997,
      "Text": " and transfers. And in particular, this particular message is a standard admission. So maybe"
    },
    {
      "Time_Start": 322.65999999999997,
      "Time_End": 327.78,
      "Text": " Mickey Mouse has found himself in hospital for whatever reason, and he's been admitted"
    },
    {
      "Time_Start": 327.78,
      "Time_End": 333.18,
      "Text": " as a patient. Other types of messages that you might see are things like observation"
    },
    {
      "Time_Start": 333.18,
      "Time_End": 338.74,
      "Text": " results. So that might be if you are hooked up to a patient monitor and your heart rate"
    },
    {
      "Time_Start": 338.74,
      "Time_End": 344.5,
      "Text": " is getting recorded. Each message associated would be an observation result. You might"
    },
    {
      "Time_Start": 344.5,
      "Time_End": 351.5,
      "Text": " also see things like events, pharmacy dispenses. Okay, next you might find the event segment."
    },
    {
      "Time_Start": 353.06,
      "Time_End": 357.14,
      "Text": " So this is really important. And it actually states when and where the message was sent"
    },
    {
      "Time_Start": 357.14,
      "Time_End": 363.86,
      "Text": " from. You might also find the patient identifier. So some key information about the patient."
    },
    {
      "Time_Start": 363.86,
      "Time_End": 369.7,
      "Text": " You might also have their next of kin. And also potentially some allergen information."
    },
    {
      "Time_Start": 369.9,
      "Time_End": 376.65999999999997,
      "Text": " So what the allergy is and the potential reaction. Not all segments are required, but if a segment"
    },
    {
      "Time_Start": 376.65999999999997,
      "Time_End": 383.65999999999997,
      "Text": " is present, then there are specific fields within that segment that are required. Okay,"
    },
    {
      "Time_Start": 385.14,
      "Time_End": 390.14,
      "Text": " so the most common way to transfer HL7 messages is through the minimal lower layer protocol,"
    },
    {
      "Time_Start": 390.14,
      "Time_End": 397.14,
      "Text": " or MLLP, via TCP IP. Where messages are sent via MLLP, they'll be wrapped in a start block"
    },
    {
      "Time_Start": 400.21999999999997,
      "Time_End": 405.42,
      "Text": " that will also be, you'll see at the end, an end block and also a carriage return. So"
    },
    {
      "Time_Start": 405.42,
      "Time_End": 409.94,
      "Text": " in this particular example, you can see I've highlighted the start block in red, and then"
    },
    {
      "Time_Start": 409.94,
      "Time_End": 414.3,
      "Text": " at the end you've got the end block, which is one byte, and then a carriage return tacked"
    },
    {
      "Time_Start": 414.3,
      "Time_End": 419.5,
      "Text": " on to the end as well. And this is basically so that the server knows where the message"
    },
    {
      "Time_Start": 419.5,
      "Time_End": 426.5,
      "Text": " starts and where the message ends. Okay, so we're going to talk about some common"
    },
    {
      "Time_Start": 427.22,
      "Time_End": 434.22,
      "Text": " vulnerabilities in HL7. So there's been some really great research into vulnerabilities"
    },
    {
      "Time_Start": 438.98,
      "Time_End": 444.26,
      "Text": " affecting HL7 in the past. So if you did want to delve into these in a little bit more detail,"
    },
    {
      "Time_Start": 444.26,
      "Time_End": 448.7,
      "Text": " I've included a couple of links at the bottom, but I have got some links in my resources"
    },
    {
      "Time_Start": 448.7,
      "Time_End": 455.26,
      "Text": " slide as well. So typically HL7 doesn't require any kind of authentication to be able to send"
    },
    {
      "Time_Start": 455.26,
      "Time_End": 460.7,
      "Text": " messages. So in theory, John Doe could send any message he likes to any device, given"
    },
    {
      "Time_Start": 460.7,
      "Time_End": 466.86,
      "Text": " he's on the same network and given the format's correct as well. There is in fact a user authentication"
    },
    {
      "Time_Start": 466.86,
      "Time_End": 470.82,
      "Text": " credential segment that will allow you to configure authentication mechanisms such as"
    },
    {
      "Time_Start": 470.82,
      "Time_End": 475.58,
      "Text": " Kerberos and SAML authentication as well. But it's really important to mention here"
    },
    {
      "Time_Start": 475.58,
      "Time_End": 482.18,
      "Text": " that that segment is in fact optional. So in most cases, it's not implemented. John"
    },
    {
      "Time_Start": 482.22,
      "Time_End": 488.46,
      "Text": " Doe can also amend messages, given he's on the same network. And if he did amend the"
    },
    {
      "Time_Start": 488.46,
      "Time_End": 493.98,
      "Text": " message, the server would just accept it as if nothing's happened. It's also possible"
    },
    {
      "Time_Start": 493.98,
      "Time_End": 499.54,
      "Text": " to cause denial of service as well. So quite often on servers or middleware applications,"
    },
    {
      "Time_Start": 499.54,
      "Time_End": 504.22,
      "Text": " you'll see a maximum number of connections that is set. And that maximum number of connections"
    },
    {
      "Time_Start": 504.22,
      "Time_End": 509.3,
      "Text": " is usually quite low. So it's usually around something like 10. And therefore, if we can"
    },
    {
      "Time_Start": 509.3,
      "Time_End": 516.1,
      "Text": " exceed that number of connections, we can cause a denial of service attack. Then lastly,"
    },
    {
      "Time_Start": 516.1,
      "Time_End": 521.22,
      "Text": " of course, I've mentioned it already, but HL7 messages are communicated in clear text."
    },
    {
      "Time_Start": 521.22,
      "Time_End": 524.9,
      "Text": " This is obviously a massive problem, as it allows us to be able to perform person-in-the-middle"
    },
    {
      "Time_Start": 524.9,
      "Time_End": 531.9,
      "Text": " attacks or ARP spoofing to gain access to patient data. Okay. So I've been talking about"
    },
    {
      "Time_Start": 532.9,
      "Time_End": 539.9,
      "Text": " this quite lightheartedly up to this point. Yeah. But I feel like it's really important"
    },
    {
      "Time_Start": 541.38,
      "Time_End": 547.14,
      "Text": " to think about the impact here for just a second. These are just some of the examples"
    },
    {
      "Time_Start": 547.14,
      "Time_End": 552.02,
      "Text": " of different impacts that you might see. But in a worst-case scenario, we can cause severe"
    },
    {
      "Time_Start": 552.02,
      "Time_End": 558.18,
      "Text": " impact to individuals here. If we're able to position ourselves on the network and potentially"
    },
    {
      "Time_Start": 558.1800000000001,
      "Time_End": 562.98,
      "Text": " intercept traffic, which in theory is not unachievable given a lot of hospital networks"
    },
    {
      "Time_Start": 562.98,
      "Time_End": 569.0600000000001,
      "Text": " are quite flat, we can potentially change the records and messages that are being sent."
    },
    {
      "Time_Start": 569.0600000000001,
      "Time_End": 573.94,
      "Text": " That might look something like changing allergen information, which then could cause prescription"
    },
    {
      "Time_Start": 573.94,
      "Time_End": 579.22,
      "Text": " of incorrect drugs and then cause an allergic reaction. And then, of course, far, far worse,"
    },
    {
      "Time_Start": 579.22,
      "Time_End": 586.22,
      "Text": " as I'm sure you can imagine. This is obviously possible given the right conditions. Now you"
    },
    {
      "Time_Start": 587.1,
      "Time_End": 590.6600000000001,
      "Text": " can see just how important it is to make sure that we're testing these devices, to make"
    },
    {
      "Time_Start": 590.6600000000001,
      "Time_End": 595.74,
      "Text": " sure that we find the weaknesses and make sure that these devices are hardened. But,"
    },
    {
      "Time_Start": 595.74,
      "Time_End": 602.74,
      "Text": " of course, this comes with its own challenges. It's not easy to fingerprint the use of HL7."
    },
    {
      "Time_Start": 603.34,
      "Time_End": 608.34,
      "Text": " So by default, HL7 doesn't run on any specific port, and therefore it's hard to identify"
    },
    {
      "Time_Start": 608.34,
      "Time_End": 615.34,
      "Text": " when it's in use. There's also no real fingerprinting mechanisms in tools like NMAT to be able to"
    },
    {
      "Time_Start": 615.5400000000001,
      "Time_End": 621.38,
      "Text": " identify when a port is actually using HL7. We could, however, look at the default port"
    },
    {
      "Time_Start": 621.38,
      "Time_End": 627.62,
      "Text": " set by a device. However, I would not recommend port scanning a medical device. Quite a lot"
    },
    {
      "Time_Start": 627.62,
      "Time_End": 633.58,
      "Text": " of them are quite legacy and they just cannot handle it. And therefore you're likely to"
    },
    {
      "Time_Start": 633.58,
      "Time_End": 640.58,
      "Text": " cause denial of service in this case as well. It's worth me mentioning here that, in fact,"
    },
    {
      "Time_Start": 640.58,
      "Time_End": 647.58,
      "Text": " I would not recommend testing production devices in this case either for obvious reasons."
    },
    {
      "Time_Start": 647.58,
      "Time_End": 653.38,
      "Text": " Okay. So I've mentioned a few times, but HL7 messages are typically communicated in clear"
    },
    {
      "Time_Start": 653.38,
      "Time_End": 659.3000000000001,
      "Text": " text. You will see, however, in some cases the device will allow you to configure SSL"
    },
    {
      "Time_Start": 659.3000000000001,
      "Time_End": 663.1800000000001,
      "Text": " in the settings. So the device that I was using was a small patient monitor that you'll"
    },
    {
      "Time_Start": 663.1800000000001,
      "Time_End": 668.0200000000001,
      "Text": " see very shortly, and it did allow you to tick a check box in the settings to configure"
    },
    {
      "Time_Start": 668.06,
      "Time_End": 674.26,
      "Text": " encryption. But, of course, this is not enabled by default, so in most cases messages will"
    },
    {
      "Time_Start": 674.26,
      "Time_End": 680.78,
      "Text": " be sent in clear text. If we can find a way to amend the messages or access this data,"
    },
    {
      "Time_Start": 680.78,
      "Time_End": 685.38,
      "Text": " we can potentially cause some sort of impact here. Unfortunately, it's not easy to be able"
    },
    {
      "Time_Start": 685.38,
      "Time_End": 691.26,
      "Text": " to intercept the data. Obviously HL7 is quite nonstandard and also MLP is quite a nonstandard"
    },
    {
      "Time_Start": 691.26,
      "Time_End": 697.46,
      "Text": " protocol that we can't intercept with things like burp. We could, however, sit on the network"
    },
    {
      "Time_Start": 697.46,
      "Time_End": 702.94,
      "Text": " and intercept communications via something like Wireshark, which might look something"
    },
    {
      "Time_Start": 702.94,
      "Time_End": 709.4200000000001,
      "Text": " like this. But, in fact, let's see this in action. So I mentioned that I was using a"
    },
    {
      "Time_Start": 709.4200000000001,
      "Time_End": 715.4200000000001,
      "Text": " small patient monitor to do my testing, and this is the Philips SureSigns patient monitor."
    },
    {
      "Time_Start": 715.4200000000001,
      "Time_End": 719.46,
      "Text": " Philips actually provide a lot of healthcare equipment to the NHS in the UK, so that's"
    },
    {
      "Time_Start": 719.46,
      "Time_End": 725.9000000000001,
      "Text": " partly why I decided to choose this particular device. So we need to obviously get some readings,"
    },
    {
      "Time_Start": 725.9,
      "Time_End": 730.9399999999999,
      "Text": " so I decided to hook myself up to the patient monitor, and after a while, you should start"
    },
    {
      "Time_Start": 730.9399999999999,
      "Time_End": 737.9399999999999,
      "Text": " seeing some heart rate readings and some blood oxygen readings as well. After a while, we'll"
    },
    {
      "Time_Start": 738.5799999999999,
      "Time_End": 743.14,
      "Text": " start seeing the packets come in, and as you can see, we've got some HL7 communication"
    },
    {
      "Time_Start": 743.14,
      "Time_End": 749.54,
      "Text": " data here. Within that packet, we've got each of the different segments, and within the"
    },
    {
      "Time_Start": 749.54,
      "Time_End": 756.54,
      "Text": " segments, we've also got each of the different fields as well. Okay. Another challenge that"
    },
    {
      "Time_Start": 757.98,
      "Time_End": 764.98,
      "Text": " comes with testing HL7 is its readability. As you can see, HL7 messages are really easy"
    },
    {
      "Time_Start": 765.66,
      "Time_End": 771.74,
      "Text": " to read. They're not easy to read at all. And can you imagine if you were testing a"
    },
    {
      "Time_Start": 771.74,
      "Time_End": 776.26,
      "Text": " device that was spitting out messages just like this every minute? It's just not going"
    },
    {
      "Time_Start": 776.26,
      "Time_End": 783.26,
      "Text": " to be easy for you. Okay, so how can we overcome these challenges? There are a few tools that"
    },
    {
      "Time_Start": 784.9,
      "Time_End": 788.9399999999999,
      "Text": " have been released in the previous years that were designed to test medical protocols such"
    },
    {
      "Time_Start": 788.9399999999999,
      "Time_End": 795.3,
      "Text": " as HL7. There has been a tool named Pestilence that was actually created by Christian Demmef"
    },
    {
      "Time_Start": 795.3,
      "Time_End": 801.06,
      "Text": " and a few other guys, but they didn't actually release it. Another tool was created by Anirudh"
    },
    {
      "Time_Start": 801.06,
      "Time_End": 805.78,
      "Text": " Dugal called Medaudit, and this provided a nice graphical user interface and allowed"
    },
    {
      "Time_Start": 805.8199999999999,
      "Time_End": 811.62,
      "Text": " you to do things like intercept messages and fuzz different fields as well, which was quite"
    },
    {
      "Time_Start": 811.62,
      "Time_End": 818.62,
      "Text": " useful. But there was still a number of items missing on my checklist of tooling requirements."
    },
    {
      "Time_Start": 819.74,
      "Time_End": 826.74,
      "Text": " So what do we need? This is all personal preference, obviously, but the TLDR here is that I just"
    },
    {
      "Time_Start": 826.9,
      "Time_End": 831.54,
      "Text": " wanted a tool to be able to work with existing tools like Burp Suite. I wanted to be able"
    },
    {
      "Time_Start": 831.54,
      "Time_End": 838.54,
      "Text": " to test HL7 just like you test HTTP or web applications. And so I decided to create HL7Magic."
    },
    {
      "Time_Start": 840.9399999999999,
      "Time_End": 846.74,
      "Text": " HL7Magic was designed as a Burp Suite plugin, and this was basically to make use of the"
    },
    {
      "Time_Start": 846.74,
      "Time_End": 852.9399999999999,
      "Text": " existing functionality that Burp has to offer. It was designed also using the HL7 API Python"
    },
    {
      "Time_Start": 852.9399999999999,
      "Time_End": 857.5,
      "Text": " library which allows you to pass messages, and the original objectives for creating this"
    },
    {
      "Time_Start": 857.54,
      "Time_End": 864.1,
      "Text": " tool was basically to make the testing of HL7 a lot easier."
    },
    {
      "Time_Start": 864.1,
      "Time_End": 870.02,
      "Text": " So how does it work? So we've got the original communication here at the bottom. So a HL7"
    },
    {
      "Time_Start": 870.02,
      "Time_End": 875.06,
      "Text": " message is sent from a medical device and is accepted by the server. And where the magic"
    },
    {
      "Time_Start": 875.06,
      "Time_End": 880.34,
      "Text": " comes in is this communication in between. So I decided to use man in the middle relay"
    },
    {
      "Time_Start": 880.34,
      "Time_End": 885.54,
      "Text": " to be able to proxy the traffic through from the client to Burp. So that's sat between"
    },
    {
      "Time_Start": 885.54,
      "Time_End": 890.4599999999999,
      "Text": " the client and the server, and then it allowed us to be able to pass that traffic through"
    },
    {
      "Time_Start": 890.4599999999999,
      "Time_End": 897.4599999999999,
      "Text": " man in the middle relay and allowed us to intercept through Burp. Once it hit Burp,"
    },
    {
      "Time_Start": 897.66,
      "Time_End": 904.02,
      "Text": " the HL7 message is then passed, and the contents of that message are dynamically stored. So"
    },
    {
      "Time_Start": 904.02,
      "Time_End": 911.02,
      "Text": " that allows us to be able to intercept and send on any particular HL7 message with any"
    },
    {
      "Time_Start": 911.74,
      "Time_End": 916.86,
      "Text": " contents. At this point here as well, it allows us to be able to do all the cases where we've"
    },
    {
      "Time_Start": 916.86,
      "Time_End": 923.54,
      "Text": " got that MRP wrapper, and from that point onwards, the HL7 message is then converted"
    },
    {
      "Time_Start": 923.54,
      "Time_End": 930.34,
      "Text": " into a nice JSON format. This allows testers or attackers to be able to easily read the"
    },
    {
      "Time_Start": 930.34,
      "Time_End": 937.34,
      "Text": " message contents and also change the contents as well. Once testing is complete, the message"
    },
    {
      "Time_Start": 938.3000000000001,
      "Time_End": 945.3000000000001,
      "Text": " is then converted back into HL7 format and sent on to the server. Okay. So time for the"
    },
    {
      "Time_Start": 946.22,
      "Time_End": 953.02,
      "Text": " demos. Another quick disclaimer here. I am going to be open sourcing this tool after"
    },
    {
      "Time_Start": 953.02,
      "Time_End": 958.14,
      "Text": " the conference, so please do not use this tool against any production systems, just"
    },
    {
      "Time_Start": 958.14,
      "Time_End": 964.22,
      "Text": " as a warning. Okay. So I'm going to go through two types of demonstration here. So the first"
    },
    {
      "Time_Start": 964.22,
      "Time_End": 968.78,
      "Text": " is going to be using an example message which will be sent from a client, and this is basically"
    },
    {
      "Time_Start": 968.78,
      "Time_End": 975.14,
      "Text": " using an emulator to act as a medical device. The second demo will be using an actual medical"
    },
    {
      "Time_Start": 975.14,
      "Time_End": 979.1,
      "Text": " device, and so the message you will see will be coming straight from the patient monitor"
    },
    {
      "Time_Start": 979.1,
      "Time_End": 986.1,
      "Text": " that I featured earlier. Okay. So the first demo, we've got the test message. So we're"
    },
    {
      "Time_Start": 988.82,
      "Time_End": 993.5,
      "Text": " actually using the same message that was on the previous slide that you saw before. We"
    },
    {
      "Time_Start": 993.54,
      "Time_End": 998.3,
      "Text": " have our man in the middle relay command set out, so it's listening on any port, any IP"
    },
    {
      "Time_Start": 998.3,
      "Time_End": 1005.3,
      "Text": " address locally. We've got our client sending data on port 8880, and the server is"
    },
    {
      "Time_Start": 1005.3,
      "Time_End": 1010.3,
      "Text": " configured to listen on local host on port 8888. We've also got BERT listening on local"
    },
    {
      "Time_Start": 1013.46,
      "Time_End": 1018.46,
      "Text": " host on port 8081, just to confuse you with all the eights, as you can see. And so you"
    },
    {
      "Time_Start": 1023.54,
      "Time_End": 1028.54,
      "Text": " can see, if we go ahead and intercept, we set our server listening on port 8888, and"
    },
    {
      "Time_Start": 1032.34,
      "Time_End": 1036.5,
      "Text": " then we've got our man in the middle relay command, so that's going to be sending the"
    },
    {
      "Time_Start": 1036.5,
      "Time_End": 1041.5,
      "Text": " traffic through to BERT, and then if we send our message from our client. As you can see,"
    },
    {
      "Time_Start": 1044.54,
      "Time_End": 1050.58,
      "Text": " this has now been intercepted in BERT, standard HL7 message format, but if we go into HL7"
    },
    {
      "Time_Start": 1050.58,
      "Time_End": 1055.58,
      "Text": " magic, you can see it's converted into a nice JSON format. We've also got all of the"
    },
    {
      "Time_Start": 1057.98,
      "Time_End": 1063.3,
      "Text": " segments, and all of the fields within that segment as well, plus some additional"
    },
    {
      "Time_Start": 1063.3,
      "Time_End": 1069.6999999999998,
      "Text": " information that is gathered through the passing of these messages. If we wanted to"
    },
    {
      "Time_Start": 1069.6999999999998,
      "Time_End": 1074.6599999999999,
      "Text": " prove the impact here, we might decide to change some of the contents, so we might"
    },
    {
      "Time_Start": 1074.66,
      "Time_End": 1079.66,
      "Text": " change the patient name, potentially, from Mickey Mouse to Bob Mouse, and if we go"
    },
    {
      "Time_Start": 1084.74,
      "Time_End": 1089.74,
      "Text": " back, that is now converted back into HL7 format. If we go to our server, forward the"
    },
    {
      "Time_Start": 1093.38,
      "Time_End": 1097.94,
      "Text": " message on, and as you can see, the server has now received our new message with Bob"
    },
    {
      "Time_Start": 1097.94,
      "Time_End": 1102.94,
      "Text": " Mouse instead of Mickey Mouse. Okay, so seeing as we've got all of these messages"
    },
    {
      "Time_Start": 1104.66,
      "Time_End": 1109.66,
      "Text": " sent, we're going to do a second demo here. We are now using our patient monitor, and so"
    },
    {
      "Time_Start": 1109.66,
      "Time_End": 1114.9,
      "Text": " the message being received will be from the patient monitor. So the IP address here is"
    },
    {
      "Time_Start": 1114.9,
      "Time_End": 1120.8600000000001,
      "Text": " slightly different, so we're now using 192.168.0.10 IP, and therefore our man in the middle"
    },
    {
      "Time_Start": 1120.8600000000001,
      "Time_End": 1126.1000000000001,
      "Text": " relay command is going to be slightly different here as well. We're still listening on any IP"
    },
    {
      "Time_Start": 1126.1000000000001,
      "Time_End": 1131.1000000000001,
      "Text": " locally, but now our client is sending data on port 4000. We're listening on the 192.168"
    },
    {
      "Time_Start": 1131.3600000000001,
      "Time_End": 1136.3600000000001,
      "Text": " IP on port 8888. Burp is also listening on the same IP, but on the same port as before, so"
    },
    {
      "Time_Start": 1141.3000000000002,
      "Time_End": 1146.3000000000002,
      "Text": " 8081, as you can see. If we go ahead and intercept, we set our server listening as same as"
    },
    {
      "Time_Start": 1151.7,
      "Time_End": 1156.8400000000001,
      "Text": " before. We've got our man in the middle relay command going, and now we are waiting for the"
    },
    {
      "Time_Start": 1157.12,
      "Time_End": 1162.12,
      "Text": " message to be sent from our medical device, and there you go, we're intercepted. Same again,"
    },
    {
      "Time_Start": 1165.12,
      "Time_End": 1170.04,
      "Text": " HL7 magic, and you can see the contents of the message is now in a nice JSON readable"
    },
    {
      "Time_Start": 1170.04,
      "Time_End": 1175.04,
      "Text": " format. Again, if we wanted to prove the impact here, we might decide to change the contents."
    },
    {
      "Time_Start": 1180.6399999999999,
      "Time_End": 1186.04,
      "Text": " So same as before, we might decide to change the patient name, quite a benign example, but we"
    },
    {
      "Time_Start": 1186.04,
      "Time_End": 1191.04,
      "Text": " might change this from Donald Trump to Donald Duck. But if we wanted to really prove the"
    },
    {
      "Time_Start": 1193.22,
      "Time_End": 1198.92,
      "Text": " impact here, we could change some of the readings, like the blood oxygen reading, and"
    },
    {
      "Time_Start": 1198.92,
      "Time_End": 1203.42,
      "Text": " potentially the heart rate reading if we wanted to as well. Again, we've now converted this"
    },
    {
      "Time_Start": 1203.42,
      "Time_End": 1209.1599999999999,
      "Text": " back into normal HL7 format, go to our server, and the server has now received our new"
    },
    {
      "Time_Start": 1209.1599999999999,
      "Time_End": 1214.1599999999999,
      "Text": " message. Okay, so what can we take away from this? We can take away from this the fact that"
    },
    {
      "Time_Start": 1216.76,
      "Time_End": 1221.6599999999999,
      "Text": " HL7 is still the most commonly used protocol in the industry, and as we've seen, it's vulnerable to"
    },
    {
      "Time_Start": 1221.6599999999999,
      "Time_End": 1227.46,
      "Text": " a number of issues if not securely configured. HL7 is difficult to test from a security"
    },
    {
      "Time_Start": 1227.46,
      "Time_End": 1233.54,
      "Text": " perspective, it's difficult to read, difficult to fingerprint, and as we've seen, it's difficult to be"
    },
    {
      "Time_Start": 1233.54,
      "Time_End": 1239.84,
      "Text": " able to proxy the traffic through existing security tools. HL7 magic can provide testers with"
    },
    {
      "Time_Start": 1239.84,
      "Time_End": 1245.58,
      "Text": " an easy method of testing medical devices using this protocol. So in future, testers will be"
    },
    {
      "Time_Start": 1245.62,
      "Time_End": 1251.1599999999999,
      "Text": " able to proxy traffic through BERT, they'll be able to easily read these messages and also"
    },
    {
      "Time_Start": 1251.1599999999999,
      "Time_End": 1258.1599999999999,
      "Text": " amend messages on the fly as well. In terms of future plans, I intend to continue researching"
    },
    {
      "Time_Start": 1258.6,
      "Time_End": 1265.6,
      "Text": " medical protocols. I'll also intend to add support to HL7 magic for protocols such as fire,"
    },
    {
      "Time_Start": 1266.1999999999998,
      "Time_End": 1271.8,
      "Text": " potentially some fuzzing integration as well, and I'll also be open sourcing the tool after"
    },
    {
      "Time_Start": 1271.8,
      "Time_End": 1277.0,
      "Text": " this conference, so I'll welcome any collaborations and any potential feedback and improvements"
    },
    {
      "Time_Start": 1277.0,
      "Time_End": 1283.8799999999999,
      "Text": " to the tool. I just want to say thank you to anyone that supported me on this journey, and"
    },
    {
      "Time_Start": 1283.8799999999999,
      "Time_End": 1285.8799999999999,
      "Text": " thank you very much for joining me here."
    }
  ]
}