{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 8.46,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay. Maybe a little lower. Maybe not a little lower. Okay. I think we're good. So, good"
    },
    {
      "Time_Start": 8.46,
      "Time_End": 14.3,
      "Text": " morning, everyone. My name is Joe. I currently run CTI and a few other things for a company"
    },
    {
      "Time_Start": 14.3,
      "Time_End": 18.96,
      "Text": " called Huntress. They might not really like some of the stuff I'm talking about today, so"
    },
    {
      "Time_Start": 18.96,
      "Time_End": 23.22,
      "Text": " we'll just kind of leave it at that. I've been lots of other places, too, or whatever, but"
    },
    {
      "Time_Start": 23.22,
      "Time_End": 26.22,
      "Text": " this is the first time I've ever spoken at a main stage DEF CON, so I was really excited"
    },
    {
      "Time_Start": 26.22,
      "Time_End": 33.06,
      "Text": " about this, because I never thought I would. Because I am not the hacker type. I am more"
    },
    {
      "Time_Start": 33.06,
      "Time_End": 37.06,
      "Text": " of the defender type or whatever. But I think this talk on burrowing through the network"
    },
    {
      "Time_Start": 37.06,
      "Time_End": 41.68,
      "Text": " and really contextualizing something called the Vulcan leaks or Vulcan papers is something"
    },
    {
      "Time_Start": 41.68,
      "Time_End": 46.099999999999994,
      "Text": " that's not just really valuable for my community, talking like blue teamers and so forth, but"
    },
    {
      "Time_Start": 46.099999999999994,
      "Time_End": 52.26,
      "Text": " also provides a really good insight into how high level advanced stage cyber operations"
    },
    {
      "Time_Start": 52.3,
      "Time_End": 57.8,
      "Text": " work for our real high end state sponsored entities or adversaries, depending upon your"
    },
    {
      "Time_Start": 57.8,
      "Time_End": 62.8,
      "Text": " perspective. So with that, our agenda today is we're going to talk about what the fuck are"
    },
    {
      "Time_Start": 62.8,
      "Time_End": 65.64,
      "Text": " the Vulcan files or whatever. I showed up here or whatever. I don't even know what these"
    },
    {
      "Time_Start": 65.64,
      "Time_End": 70.3,
      "Text": " things are. So we'll level set on that and then get into how Vulcan relates to the"
    },
    {
      "Time_Start": 70.3,
      "Time_End": 76.25999999999999,
      "Text": " ecosystem of Russian cyber operations and then orient what Vulcan looks like within the"
    },
    {
      "Time_Start": 76.25999999999999,
      "Time_End": 81.6,
      "Text": " context of greater cyber history. Because I think as a relatively young discipline, we"
    },
    {
      "Time_Start": 81.60000000000001,
      "Time_End": 85.56,
      "Text": " still do a real shit job in understanding what has come before and how it all links"
    },
    {
      "Time_Start": 85.56,
      "Time_End": 91.64000000000001,
      "Text": " together and evolves over time. With that in mind, we'll then talk about what the future"
    },
    {
      "Time_Start": 91.64000000000001,
      "Time_End": 96.18,
      "Text": " looks like for cyber operations, offensive espionage and other, and close out with some"
    },
    {
      "Time_Start": 96.18,
      "Time_End": 99.18,
      "Text": " conclusions and hopefully I'm not over time at that point, because they will throw me off"
    },
    {
      "Time_Start": 99.18,
      "Time_End": 106.06,
      "Text": " the stage if I am. So the Vulcan files. What are the Vulcan files? So the Vulcan files"
    },
    {
      "Time_Start": 106.10000000000001,
      "Time_End": 111.10000000000001,
      "Text": " were a, are a cache of documents that were disclosed to primarily two German journalists,"
    },
    {
      "Time_Start": 113.64,
      "Time_End": 119.94,
      "Text": " Hakan Tanriwardy and Hannes Munzinger, who were both former at Suddeutsche Zeitung. They're"
    },
    {
      "Time_Start": 119.94,
      "Time_End": 123.44,
      "Text": " now working for the German state broadcaster and for this effort they worked with"
    },
    {
      "Time_Start": 123.44,
      "Time_End": 130.6,
      "Text": " Der Spiegel. Hundreds and hundreds of pages of project documentation, contracting documents"
    },
    {
      "Time_Start": 130.6,
      "Time_End": 137.56,
      "Text": " and similar, for a bunch of cyber operation tools and effects payloads sponsored by"
    },
    {
      "Time_Start": 137.56,
      "Time_End": 144.06,
      "Text": " various Russian agencies. It was really cool stuff. It was a pleasure to help out Hakan and"
    },
    {
      "Time_Start": 144.06,
      "Time_End": 148.48,
      "Text": " Hannes or whatever on this work, but there was also coverage in English in the Washington"
    },
    {
      "Time_Start": 148.48,
      "Time_End": 153.82,
      "Text": " Post. Ellen Nakashima and others published on this as well for American audiences. And you"
    },
    {
      "Time_Start": 153.82,
      "Time_End": 158.82,
      "Text": " had cyber firms or whatever, like Mandiant, now part of Google Cloud, part of something or"
    },
    {
      "Time_Start": 158.85999999999999,
      "Time_End": 163.73999999999998,
      "Text": " other, Alphabet, whatever that chain looks like, who did a deep dive on this as well. Some"
    },
    {
      "Time_Start": 163.73999999999998,
      "Time_End": 168.4,
      "Text": " really good contextualization from like, you know, the so what cyber defense perspective on"
    },
    {
      "Time_Start": 168.4,
      "Time_End": 172.73999999999998,
      "Text": " these things. So that was all pretty cool. We'll get back to like, well, why am I not"
    },
    {
      "Time_Start": 172.73999999999998,
      "Time_End": 177.54,
      "Text": " hearing about this until today or whatever for I'm guessing a non-trivial number of folks in"
    },
    {
      "Time_Start": 177.54,
      "Time_End": 182.4,
      "Text": " the room. But in looking at what the Vulcan leaks are, they involve a company called NTC"
    },
    {
      "Time_Start": 182.4,
      "Time_End": 187.35999999999999,
      "Text": " Vulcan, which is located in Russia. The leaks themselves, I've already said like hundreds and"
    },
    {
      "Time_Start": 187.78,
      "Time_End": 191.78,
      "Text": " hundreds of pages of materials or whatever, like primary source documents that I think for"
    },
    {
      "Time_Start": 191.78,
      "Time_End": 196.70000000000002,
      "Text": " historians will be quite interesting or whatever as we write the story of what cyber looked"
    },
    {
      "Time_Start": 196.70000000000002,
      "Time_End": 201.94000000000003,
      "Text": " like in the 2020s and 2010s. And then the significance of these things. So in looking at"
    },
    {
      "Time_Start": 201.94000000000003,
      "Time_End": 208.78000000000003,
      "Text": " NTC Vulcan, this is a computer technology firm that is owned and operated by Russian military"
    },
    {
      "Time_Start": 208.78000000000003,
      "Time_End": 213.74,
      "Text": " veterans with the approval or authorization to perform classified or sensitive work for"
    },
    {
      "Time_Start": 213.74,
      "Time_End": 218.28,
      "Text": " Russian state organizations. Not all that different for how many veteran owned businesses"
    },
    {
      "Time_Start": 218.28,
      "Time_End": 222.78,
      "Text": " you'll see scattered up and down, you know, the highway or whatever between say, Northern"
    },
    {
      "Time_Start": 222.78,
      "Time_End": 227.9,
      "Text": " Virginia and Southern Maryland and whatnot. So, you know, other folks have contractors or"
    },
    {
      "Time_Start": 227.9,
      "Time_End": 233.16000000000003,
      "Text": " whatever that are coming out of .gov space, .mil space and starting up their own .coms or"
    },
    {
      "Time_Start": 233.16000000000003,
      "Time_End": 237.66000000000003,
      "Text": " whatever for twice the salaries and so forth. The leaks themselves came from an unknown"
    },
    {
      "Time_Start": 237.66,
      "Time_End": 244.2,
      "Text": " entity. There is some discussion that this was an entity who was upset and disgusted"
    },
    {
      "Time_Start": 244.2,
      "Time_End": 249.28,
      "Text": " with his country's policies towards Ukraine and that this was an act of protest for some"
    },
    {
      "Time_Start": 249.28,
      "Time_End": 253.85999999999999,
      "Text": " of the capabilities that they were responsible for or linked to in development. But obviously"
    },
    {
      "Time_Start": 253.85999999999999,
      "Time_End": 258.08,
      "Text": " for their safety, they have not been revealed. Lord knows where they are right now or whatever,"
    },
    {
      "Time_Start": 258.08,
      "Time_End": 262.5,
      "Text": " hopefully somewhere far away from Russia at this point in time. But provided this documentation"
    },
    {
      "Time_Start": 262.54,
      "Time_End": 267.74,
      "Text": " to the journalist I mentioned earlier who then went through a consortium of paper cut"
    },
    {
      "Time_Start": 267.74,
      "Time_End": 273.12,
      "Text": " media in order to disseminate this to a variety of other news organizations, the Guardian,"
    },
    {
      "Time_Start": 273.12,
      "Time_End": 278.82,
      "Text": " I can't remember if it was Le Monde or Le Figaro, but anyway, French publications, Washington"
    },
    {
      "Time_Start": 278.82,
      "Time_End": 283.7,
      "Text": " Post, et cetera, to try to get this far and wide. And then the significance of these, like,"
    },
    {
      "Time_Start": 283.7,
      "Time_End": 288.62,
      "Text": " we don't see this kind of shit very often. We see it a lot when it comes to, say, the U.S."
    },
    {
      "Time_Start": 288.66,
      "Time_End": 293.78000000000003,
      "Text": " space, and I'll get to that a little later on, and some leaks that have come about from"
    },
    {
      "Time_Start": 293.78000000000003,
      "Time_End": 297.32,
      "Text": " Western sources or whatever. But other than things, like if you're familiar with the"
    },
    {
      "Time_Start": 297.32,
      "Time_End": 302.32,
      "Text": " Intrusion Truth Twitter account and some of the work that they've done in publicizing Chinese"
    },
    {
      "Time_Start": 302.32,
      "Time_End": 308.62,
      "Text": " nexus operations, seeing this sort of leak or disclosure or whatever from an insider"
    },
    {
      "Time_Start": 308.62,
      "Time_End": 312.28000000000003,
      "Text": " doesn't happen terribly often, and we haven't seen a whole lot of this coming from the"
    },
    {
      "Time_Start": 312.28000000000003,
      "Time_End": 317.08,
      "Text": " Russian space. And so really getting this view into the nuts and bolts of cyber network or"
    },
    {
      "Time_Start": 317.08,
      "Time_End": 323.0,
      "Text": " computer network operations is pretty cool and pretty interesting shit. So here's Vulcan. I"
    },
    {
      "Time_Start": 323.0,
      "Time_End": 326.12,
      "Text": " don't know if they're still in this building or not, but that's the Google Street View from"
    },
    {
      "Time_Start": 326.12,
      "Time_End": 332.62,
      "Text": " the address that was up to date as of, like, 2021. So hi, guys. I call them assholes because"
    },
    {
      "Time_Start": 332.62,
      "Time_End": 336.5,
      "Text": " we're all kind of in this together, and who among us has not provided, like, you know,"
    },
    {
      "Time_Start": 336.5,
      "Time_End": 340.08,
      "Text": " controversial tools to government agencies or whatever as part of our employment? Don't"
    },
    {
      "Time_Start": 340.08,
      "Time_End": 346.5,
      "Text": " answer that question, I suppose. Again, Vulcan files covering lots of stuff, but three"
    },
    {
      "Time_Start": 346.5,
      "Time_End": 351.34,
      "Text": " primary programs of interest, one of which we'll focus on today. So the one that we'll"
    },
    {
      "Time_Start": 351.34,
      "Time_End": 357.92,
      "Text": " focus and spend the most amount of time on is Scan or Scan V, which is a scanning suite,"
    },
    {
      "Time_Start": 357.92,
      "Time_End": 362.3,
      "Text": " but it's a lot more than that, and we'll get into the significance of that shortly. A information"
    },
    {
      "Time_Start": 362.3,
      "Time_End": 366.74,
      "Text": " operations platform called Amazit, which, while we're not going to spend too much time"
    },
    {
      "Time_Start": 366.74,
      "Time_End": 372.66,
      "Text": " on that, very interesting from a forward deployed information operations sort of capability"
    },
    {
      "Time_Start": 372.66,
      "Time_End": 376.78000000000003,
      "Text": " space, and then there was another tool called Crystal 2V, which we're not going to talk"
    },
    {
      "Time_Start": 376.78000000000003,
      "Time_End": 379.86,
      "Text": " about that much at all, because I frankly don't find it all that interesting other than"
    },
    {
      "Time_Start": 379.86,
      "Time_End": 385.94000000000005,
      "Text": " that it exists, that looks to be a sort of like a testing or a penetration testing platform"
    },
    {
      "Time_Start": 385.94000000000005,
      "Time_End": 391.06,
      "Text": " for industrial control environments and similar, but doesn't appear to be as concerning or"
    },
    {
      "Time_Start": 391.06,
      "Time_End": 400.06,
      "Text": " whatever as some of the malware we've seen coming out of Russia, like Triton, Indestroyer,"
    },
    {
      "Time_Start": 400.1,
      "Time_End": 405.14,
      "Text": " and similar. But to get back to Scan V, what we're talking about here is a really interesting"
    },
    {
      "Time_Start": 405.14,
      "Time_End": 410.9,
      "Text": " program combining multiple networks to set up a scanning enumeration exploitation and"
    },
    {
      "Time_Start": 410.9,
      "Time_End": 415.66,
      "Text": " data collection platform that goes across several different information domains. So"
    },
    {
      "Time_Start": 415.66,
      "Time_End": 419.98,
      "Text": " I don't have a pointer or anything here, but if you look at this, we go from the external"
    },
    {
      "Time_Start": 419.98,
      "Time_End": 425.88,
      "Text": " internet where systems that are set up with a bunch of publicly available and non-publicly"
    },
    {
      "Time_Start": 425.92,
      "Time_End": 431.68,
      "Text": " available exploits or knowledge of vulnerabilities and exploit payloads for those vulnerabilities,"
    },
    {
      "Time_Start": 431.68,
      "Time_End": 437.48,
      "Text": " being able to deploy those to victim nodes as well as extract information and task exploited"
    },
    {
      "Time_Start": 437.48,
      "Time_End": 441.56,
      "Text": " nodes to then move into a processing environment that if you can make it out, it's a little"
    },
    {
      "Time_Start": 441.56,
      "Time_End": 446.36,
      "Text": " small, you see on the right with that red network and the green network in the corner,"
    },
    {
      "Time_Start": 446.36,
      "Time_End": 452.24,
      "Text": " CD and CD, so talking true sneaker net operations and moving data into classified processing"
    },
    {
      "Time_Start": 452.24,
      "Time_End": 458.24,
      "Text": " platforms for further analysis and evaluation. This is cool shit. This is like how the sausage"
    },
    {
      "Time_Start": 458.24,
      "Time_End": 462.56,
      "Text": " gets made when it comes to state sponsored cyber operations. You'll notice I'm not saying"
    },
    {
      "Time_Start": 462.56,
      "Time_End": 466.32,
      "Text": " nation state because if you say nation state, it hits you in the head with a sock with a"
    },
    {
      "Time_Start": 466.32,
      "Time_End": 473.32,
      "Text": " bar of soap in it. But anyway, the idea here being is that Scan V, by design, is a distributed"
    },
    {
      "Time_Start": 474.16,
      "Time_End": 479.92,
      "Text": " multi-component system with various information boundaries, public internet, private internal"
    },
    {
      "Time_Start": 479.96000000000004,
      "Time_End": 484.84000000000003,
      "Text": " network that has internet connectivity, and then having out of band networks, not air"
    },
    {
      "Time_Start": 484.84000000000003,
      "Time_End": 490.04,
      "Text": " gaps because we are sneaker netting shit over there, to classified processing mechanisms."
    },
    {
      "Time_Start": 490.04,
      "Time_End": 494.6,
      "Text": " It's designed for the automated tasking and action within pre-programmed capabilities."
    },
    {
      "Time_Start": 494.6,
      "Time_End": 500.12,
      "Text": " So we're talking about basically standing up a platform to do exploitation and subversion"
    },
    {
      "Time_Start": 500.12,
      "Time_End": 505.96000000000004,
      "Text": " at scale. The purpose of this, while we can't really, there's not like an explicit purpose"
    },
    {
      "Time_Start": 505.96000000000004,
      "Time_End": 509.32,
      "Text": " document that I was able to find, at least in the Vulcan documents, which by the way"
    },
    {
      "Time_Start": 509.32,
      "Time_End": 513.24,
      "Text": " you can download if you want to look at them and read Russian. It's linked at the end of"
    },
    {
      "Time_Start": 513.24,
      "Time_End": 519.64,
      "Text": " this presentation. But really looks to combine external scanning functionality with a catalog"
    },
    {
      "Time_Start": 519.64,
      "Time_End": 524.16,
      "Text": " of vulnerable software and exploits. So like go after all of the Forta OS like everyone"
    },
    {
      "Time_Start": 524.16,
      "Time_End": 529.08,
      "Text": " else in the world, or here's your Citrix devices or whatever and pop those. We'll talk to how"
    },
    {
      "Time_Start": 529.08,
      "Time_End": 534.0,
      "Text": " this links to other Russian operations here in a little bit, but the main idea here is"
    },
    {
      "Time_Start": 534.0,
      "Time_End": 538.36,
      "Text": " automating or increasing the efficiency of cyber operations as well as infrastructure"
    },
    {
      "Time_Start": 538.4,
      "Time_End": 543.16,
      "Text": " harvesting. Not just identifying endpoints that are valuable in themselves as sources of"
    },
    {
      "Time_Start": 543.16,
      "Time_End": 548.64,
      "Text": " information or targets of disruption, but setting up the sort of network intermediaries that"
    },
    {
      "Time_Start": 548.64,
      "Time_End": 553.64,
      "Text": " could be used to tunnel and launder network traffic so it doesn't look as malicious. It's"
    },
    {
      "Time_Start": 553.64,
      "Time_End": 558.72,
      "Text": " coming from Susie's home router or whatever from their ISP and not directly from GRU"
    },
    {
      "Time_Start": 558.72,
      "Time_End": 565.96,
      "Text": " headquarters located on the outskirts of Moscow. Amazit is another program that I, again we're"
    },
    {
      "Time_Start": 566.0,
      "Time_End": 569.4000000000001,
      "Text": " not going to spend too much time on that here because again we only have 45 minutes and so"
    },
    {
      "Time_Start": 569.4000000000001,
      "Time_End": 573.5600000000001,
      "Text": " you know we have many miles to go before we sleep and such. But it is interesting in that it"
    },
    {
      "Time_Start": 573.5600000000001,
      "Time_End": 578.5600000000001,
      "Text": " provides a platform that by physically connecting to mobile and information networks, so"
    },
    {
      "Time_Start": 581.2800000000001,
      "Time_End": 586.8000000000001,
      "Text": " installing hardware in the switching center or at the BSC or BTS if we're talking cellular"
    },
    {
      "Time_Start": 586.8000000000001,
      "Time_End": 591.2,
      "Text": " networks and so forth, that it provides the ability of not just reading traffic and you can"
    },
    {
      "Time_Start": 591.2,
      "Time_End": 596.2,
      "Text": " see the panel on the left that we have Twitter, Vcontact live journal I think is up here, I"
    },
    {
      "Time_Start": 598.08,
      "Time_End": 603.5200000000001,
      "Text": " guess that's still popular in Russia, who the hell knows. But various posting and social"
    },
    {
      "Time_Start": 603.5200000000001,
      "Time_End": 606.96,
      "Text": " media platforms, not just for a collection perspective but also providing the"
    },
    {
      "Time_Start": 606.96,
      "Time_End": 612.2,
      "Text": " capabilities of injecting into and modifying those communication streams. That's pretty"
    },
    {
      "Time_Start": 612.2,
      "Time_End": 616.8000000000001,
      "Text": " interesting because it moves beyond espionage to being able to do things like modify or"
    },
    {
      "Time_Start": 616.8000000000001,
      "Time_End": 621.5200000000001,
      "Text": " send tweets impersonating individuals to influence conversations and do other sort of"
    },
    {
      "Time_Start": 621.5200000000001,
      "Time_End": 626.8000000000001,
      "Text": " info ops activities. So in looking at this we have Amazit as an information operations and"
    },
    {
      "Time_Start": 626.8000000000001,
      "Time_End": 631.5200000000001,
      "Text": " collections platform. There's also some like ICS OT shit or whatever related to that as"
    },
    {
      "Time_Start": 631.5200000000001,
      "Time_End": 634.9200000000001,
      "Text": " well. Dragos did a deep dive into that if you're curious, we're not going to get too much"
    },
    {
      "Time_Start": 634.9200000000001,
      "Time_End": 640.2800000000001,
      "Text": " into that here today. It's interesting because it's capable of capturing and processing"
    },
    {
      "Time_Start": 640.2800000000001,
      "Time_End": 645.44,
      "Text": " communication streams not just for collection but for that manipulation piece as well. And"
    },
    {
      "Time_Start": 645.44,
      "Time_End": 649.24,
      "Text": " that has potential applications because this is a mobile sort of system so it's not just"
    },
    {
      "Time_Start": 649.24,
      "Time_End": 653.84,
      "Text": " about deploying this in Dagestan or Chechnya or something like that for internal"
    },
    {
      "Time_Start": 653.84,
      "Time_End": 657.6,
      "Text": " communication monitoring but you could imagine although there has not been evidence of"
    },
    {
      "Time_Start": 657.6,
      "Time_End": 662.6,
      "Text": " this to date that we are aware of, of taking this into occupied areas of Ukraine or"
    },
    {
      "Time_Start": 662.6,
      "Time_End": 667.9200000000001,
      "Text": " similar in order to establish some degree of population influence or control through"
    },
    {
      "Time_Start": 667.9200000000001,
      "Time_End": 673.24,
      "Text": " capturing and manipulating social media streams. So scary shit or whatever, people"
    },
    {
      "Time_Start": 673.28,
      "Time_End": 678.72,
      "Text": " really getting their tentacles into these sorts of areas. So that's all cool and scary and"
    },
    {
      "Time_Start": 678.72,
      "Time_End": 684.04,
      "Text": " cybery and whatnot but the response to the Vulcan leaks was kind of meh. It was really"
    },
    {
      "Time_Start": 684.04,
      "Time_End": 687.44,
      "Text": " unfortunate because I thought this was some cool shit but after like the week that all this"
    },
    {
      "Time_Start": 687.44,
      "Time_End": 693.0,
      "Text": " came out, it seemed like no one really cared and I don't really know why that is. You know"
    },
    {
      "Time_Start": 693.0,
      "Time_End": 696.6,
      "Text": " certainly there's a lot going on in the world right now. You've seen the meme or whatever of"
    },
    {
      "Time_Start": 696.6,
      "Time_End": 700.0,
      "Text": " like aliens land on earth and like dude or whatever is in the corner smoking and it's like"
    },
    {
      "Time_Start": 700.0,
      "Time_End": 705.36,
      "Text": " dude I got a lot going on right now I can't do this. So like you know what else has been"
    },
    {
      "Time_Start": 705.36,
      "Time_End": 709.84,
      "Text": " going on? Well we've got this asshole getting indicted or whatever so you know stuff like"
    },
    {
      "Time_Start": 709.84,
      "Time_End": 715.0,
      "Text": " that. We've got you know Taylor Swift taking over the world you know so other things to"
    },
    {
      "Time_Start": 715.0,
      "Time_End": 718.84,
      "Text": " attract our attention and you know we've got UFOs out there so maybe people were just busy"
    },
    {
      "Time_Start": 718.84,
      "Time_End": 722.4,
      "Text": " I don't know. But that's one of the reasons why I thought this would be a useful"
    },
    {
      "Time_Start": 722.4,
      "Time_End": 728.0,
      "Text": " presentation to a wider audience because not just what was reported in the news but also"
    },
    {
      "Time_Start": 728.0,
      "Time_End": 732.68,
      "Text": " connecting Vulcan to the history of cyber operations which we'll get into here"
    },
    {
      "Time_Start": 732.68,
      "Time_End": 737.28,
      "Text": " momentarily. So in diving into the Vulcan leaks they represent a significant event in the"
    },
    {
      "Time_Start": 737.28,
      "Time_End": 741.84,
      "Text": " history of cyber operations. Now we just need to review what the hell is inside these"
    },
    {
      "Time_Start": 741.84,
      "Time_End": 747.4,
      "Text": " things after that short overview. So in looking at the Vulcan leaks we have NTC Vulcan as an"
    },
    {
      "Time_Start": 747.4,
      "Time_End": 754.08,
      "Text": " entity and then these programs, Scan V, Amazit, Crystal 2V, also MiniDuke which Google's"
    },
    {
      "Time_Start": 754.08,
      "Time_End": 759.5200000000001,
      "Text": " tag associated with Russian operations and linked it based upon the Vulcan leaks to"
    },
    {
      "Time_Start": 759.5200000000001,
      "Time_End": 765.5600000000001,
      "Text": " NTC Vulcan as well. So four software programs, one not explicitly documented in the leaks"
    },
    {
      "Time_Start": 765.5600000000001,
      "Time_End": 770.08,
      "Text": " themselves that link to this one organization. But more importantly these items also"
    },
    {
      "Time_Start": 770.08,
      "Time_End": 775.64,
      "Text": " directly link to various elements of Russian cyber operations. Scan V is associated quite"
    },
    {
      "Time_Start": 775.64,
      "Time_End": 780.6400000000001,
      "Text": " directly with the Russian military intelligence GRU unit 74455 also known as Sandworm."
    },
    {
      "Time_Start": 781.64,
      "Time_End": 788.64,
      "Text": " Which is a pretty gnarly actor that does lots of asshole-ish shit or whatever all across the"
    },
    {
      "Time_Start": 788.64,
      "Time_End": 793.4399999999999,
      "Text": " world and especially in Ukraine these days. Amazit as an information operations platform"
    },
    {
      "Time_Start": 793.4399999999999,
      "Time_End": 798.84,
      "Text": " was linked to the Radio Research Institute in Russia which is also associated with the"
    },
    {
      "Time_Start": 798.84,
      "Time_End": 804.4399999999999,
      "Text": " Russian Federal Security Service or FSB. So internal intelligence and security services but"
    },
    {
      "Time_Start": 804.4399999999999,
      "Time_End": 809.56,
      "Text": " certainly with an external mission as well. And then MiniDuke was linked back to SVR"
    },
    {
      "Time_Start": 809.5600000000001,
      "Time_End": 816.12,
      "Text": " operations. Our APT29 and whatever mess that is these days between Nobelium and throw a"
    },
    {
      "Time_Start": 816.12,
      "Time_End": 821.0400000000001,
      "Text": " bunch of other stupid names or whatever at the problem or whatever. But we're seeing NTC"
    },
    {
      "Time_Start": 821.0400000000001,
      "Time_End": 827.08,
      "Text": " Vulcan working with each leg of the Russian CNO tripod which is kind of interesting. Because"
    },
    {
      "Time_Start": 827.08,
      "Time_End": 832.2,
      "Text": " for various reasons especially between the civilian intelligence agencies like SVR and"
    },
    {
      "Time_Start": 832.2,
      "Time_End": 837.5200000000001,
      "Text": " FSB and then the GRU if you looked at something like Mark Galeotti's Russian Putin's"
    },
    {
      "Time_Start": 837.52,
      "Time_End": 841.28,
      "Text": " Cyber Hydra or whatever. A lot of these organizations don't get along very well and are"
    },
    {
      "Time_Start": 841.28,
      "Time_End": 847.28,
      "Text": " actually quite competitive with each other. Yet NTC Vulcan is doing work for all three"
    },
    {
      "Time_Start": 847.28,
      "Time_End": 853.28,
      "Text": " roughly simultaneously which is kind of interesting. It's not completely unique but it is"
    },
    {
      "Time_Start": 853.28,
      "Time_End": 858.48,
      "Text": " sort of rare to see that sort of spread across multiple facets of cyber operations instead"
    },
    {
      "Time_Start": 858.48,
      "Time_End": 864.68,
      "Text": " of having just one or two dedicated customers as part of this. So with that we see that"
    },
    {
      "Time_Start": 864.6800000000001,
      "Time_End": 869.5200000000001,
      "Text": " Russian cyber operations has a variety of links to the private sector. So one example that I"
    },
    {
      "Time_Start": 869.5200000000001,
      "Time_End": 877.4000000000001,
      "Text": " actually presented at Virus Bulletin last year is SNICOM, T-S-N-I-A-K-H-M, a research"
    },
    {
      "Time_Start": 877.4000000000001,
      "Time_End": 881.24,
      "Text": " institute associated with Russia's Ministry of Defence and an entity referred to as"
    },
    {
      "Time_Start": 881.24,
      "Time_End": 885.8800000000001,
      "Text": " Xenotime which we're not quite sure where it aligns with Russian cyber operations. It seems"
    },
    {
      "Time_Start": 885.8800000000001,
      "Time_End": 890.6400000000001,
      "Text": " GRU-ish but not necessarily so and there's some nuanced reasons for that that we can't get"
    },
    {
      "Time_Start": 890.68,
      "Time_End": 896.04,
      "Text": " into today for timing reasons. But we've also seen organizations like the SVA Institute, another"
    },
    {
      "Time_Start": 896.04,
      "Time_End": 902.8,
      "Text": " research organization in ties to the SVR. Or ODT, yet another public-private research"
    },
    {
      "Time_Start": 902.8,
      "Time_End": 908.72,
      "Text": " organization tied to the FSB's Fronton botnet that was used in disruptive operations."
    },
    {
      "Time_Start": 908.72,
      "Time_End": 913.76,
      "Text": " A Kvant Institute, another public-private research organization linked to the FSB in"
    },
    {
      "Time_Start": 913.76,
      "Time_End": 918.36,
      "Text": " supporting and enabling operations and sanctioned by the US Department of the Treasury. And"
    },
    {
      "Time_Start": 918.36,
      "Time_End": 922.44,
      "Text": " also InController and PipeDream. Wait a minute, no one linked InController and PipeDream to"
    },
    {
      "Time_Start": 922.44,
      "Time_End": 927.12,
      "Text": " Russia, right? We talked about that here I think in track 4 last year. A former colleague of"
    },
    {
      "Time_Start": 927.12,
      "Time_End": 931.36,
      "Text": " mine, Jimmy Wiley, did a deep dive into PipeDream and InController which was quite"
    },
    {
      "Time_Start": 931.36,
      "Time_End": 935.88,
      "Text": " fascinating. But if you look around enough or whatever you'll see that there are folks that"
    },
    {
      "Time_Start": 935.88,
      "Time_End": 939.84,
      "Text": " have tied InController or PipeDream, depending on which vendor you're going with a"
    },
    {
      "Time_Start": 939.84,
      "Time_End": 945.24,
      "Text": " naming schema, to an organization called Advanced System Technologies, a contracting"
    },
    {
      "Time_Start": 945.24,
      "Time_End": 950.52,
      "Text": " entity in Russia. So again, seeing this nexus of private sector organizations developing"
    },
    {
      "Time_Start": 950.52,
      "Time_End": 955.92,
      "Text": " and deploying tooling such as Drovorub, also associated with AST, and that was the subject"
    },
    {
      "Time_Start": 955.92,
      "Time_End": 961.44,
      "Text": " of a fairly lengthy malware analysis report released by the United States during COVID,"
    },
    {
      "Time_Start": 961.44,
      "Time_End": 966.64,
      "Text": " which again kind of floated off the radar a little bit. But the idea of this privatization"
    },
    {
      "Time_Start": 966.64,
      "Time_End": 972.52,
      "Text": " of cyberwarfare. Oh, I said it, I'm sorry. But the idea being is that we're maximizing on"
    },
    {
      "Time_Start": 972.52,
      "Time_End": 976.92,
      "Text": " capabilities by extending beyond the silos of government organizations to take advantage of"
    },
    {
      "Time_Start": 976.92,
      "Time_End": 981.48,
      "Text": " public-private relationships and research institutions, as well as outright commercial"
    },
    {
      "Time_Start": 981.48,
      "Time_End": 987.4,
      "Text": " entities to support state-directed efforts. So in looking at this, NTC Vulcan is both an"
    },
    {
      "Time_Start": 987.4,
      "Time_End": 992.52,
      "Text": " example and a pioneer in a way of increasingly outsourced cyber development and"
    },
    {
      "Time_Start": 992.52,
      "Time_End": 997.1999999999999,
      "Text": " engineering for state-directed operations. However, it's important to note, this is not"
    },
    {
      "Time_Start": 997.1999999999999,
      "Time_End": 1000.92,
      "Text": " just Russia. This is not just happening there by any stretch of the imagination, and there"
    },
    {
      "Time_Start": 1000.96,
      "Time_End": 1004.48,
      "Text": " are probably some people at that other event or whatever up the strip earlier today that"
    },
    {
      "Time_Start": 1004.48,
      "Time_End": 1009.5600000000001,
      "Text": " had booths that are just as involved in this space as well. So let's go into Scan-V and"
    },
    {
      "Time_Start": 1009.5600000000001,
      "Time_End": 1013.2400000000001,
      "Text": " SanWorm, because that's kind of the most interesting item from my perspective, especially"
    },
    {
      "Time_Start": 1013.2400000000001,
      "Time_End": 1017.1600000000001,
      "Text": " because I'm kind of an infrastructure analyst at heart when it comes to what I do in the"
    },
    {
      "Time_Start": 1017.1600000000001,
      "Time_End": 1022.6400000000001,
      "Text": " security space. So SanWorm historically leverages compromised legitimate infrastructure."
    },
    {
      "Time_Start": 1022.6400000000001,
      "Time_End": 1027.72,
      "Text": " They don't spin up their own like Hetzner or HostSailor or AWS Node. They'll go out and"
    },
    {
      "Time_Start": 1027.72,
      "Time_End": 1031.88,
      "Text": " compromise someone else's server or whatever and tunnel traffic through there as an"
    },
    {
      "Time_Start": 1031.88,
      "Time_End": 1038.32,
      "Text": " OPSEC mechanism and to try to break the trail going back to them and their organization."
    },
    {
      "Time_Start": 1038.32,
      "Time_End": 1042.92,
      "Text": " And there's multiple examples of this, going all the way back to like Indestroyer from"
    },
    {
      "Time_Start": 1042.92,
      "Time_End": 1049.68,
      "Text": " the 2016 Ukraine event, where they used what appeared to be compromised TOR exit nodes"
    },
    {
      "Time_Start": 1049.68,
      "Time_End": 1056.52,
      "Text": " as the last step command and control infrastructure before accessing the Ukrainian"
    },
    {
      "Time_Start": 1056.52,
      "Time_End": 1061.76,
      "Text": " infrastructure where Indestroyer was deployed. But also more recent items like VPN"
    },
    {
      "Time_Start": 1061.76,
      "Time_End": 1065.92,
      "Text": " filter and Cyclops blink. We'll get back to those here in a minute. But the important thing"
    },
    {
      "Time_Start": 1065.92,
      "Time_End": 1071.0,
      "Text": " is that what Scan-V represents is a way of getting this sort of burnable, deniable"
    },
    {
      "Time_Start": 1071.0,
      "Time_End": 1076.16,
      "Text": " infrastructure and doing it and tasking it at scale and in a semi-automated fashion. So"
    },
    {
      "Time_Start": 1076.16,
      "Time_End": 1080.76,
      "Text": " being able to hack the planet in a way that allows an operator to enter in some criteria and"
    },
    {
      "Time_Start": 1080.76,
      "Time_End": 1087.4,
      "Text": " then step off keyboard. So in looking at this, we can operationalize this sort of idea by"
    },
    {
      "Time_Start": 1087.4,
      "Time_End": 1091.8799999999999,
      "Text": " stockpiling vulnerabilities. And as anyone here who does any sort of red teaming knows, it"
    },
    {
      "Time_Start": 1091.8799999999999,
      "Time_End": 1095.56,
      "Text": " doesn't have to be a damn zero day. People don't pat shit for years, especially when it"
    },
    {
      "Time_Start": 1095.56,
      "Time_End": 1101.8799999999999,
      "Text": " comes to infrastructure crap. But coming up with a list of publicly known plus one day"
    },
    {
      "Time_Start": 1101.8799999999999,
      "Time_End": 1106.36,
      "Text": " vulnerabilities and then sprinkle in a couple of zero days if you really have to, I suppose,"
    },
    {
      "Time_Start": 1106.3600000000001,
      "Time_End": 1112.16,
      "Text": " and you have a quiver of arrows to launch at a variety of targets in order to get points of"
    },
    {
      "Time_Start": 1112.16,
      "Time_End": 1116.8000000000002,
      "Text": " presence in a variety of networks. Then I just need to identify vulnerable nodes. And what's"
    },
    {
      "Time_Start": 1116.8000000000002,
      "Time_End": 1123.4,
      "Text": " interesting is that Scan-V does have a showdown plug-in. So, yay. A little unfortunate, but"
    },
    {
      "Time_Start": 1123.4,
      "Time_End": 1127.3200000000002,
      "Text": " you can't avoid these sorts of things, I imagine. But also does its own scanning and"
    },
    {
      "Time_Start": 1127.3200000000002,
      "Time_End": 1131.0000000000002,
      "Text": " evaluation and so forth and looking for these vulnerabilities. And then through"
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1138.28,
      "Text": " exploitation, marshal victims into proxy chains for operations so that I can go from GRU HQ"
    },
    {
      "Time_Start": 1138.28,
      "Time_End": 1143.52,
      "Text": " where my operators are doing operations to some SOHO microteak or whatever that's out there in"
    },
    {
      "Time_Start": 1143.52,
      "Time_End": 1148.12,
      "Text": " the wild to my ultimate victim. And probably having multiple steps in the middle there so"
    },
    {
      "Time_Start": 1148.12,
      "Time_End": 1151.88,
      "Text": " that all my net flow analysis or whatever that scare the shit out of Ron Wyden and other"
    },
    {
      "Time_Start": 1151.88,
      "Time_End": 1157.88,
      "Text": " folks really kind of goes down the toilet because I'm doing chained communication or"
    },
    {
      "Time_Start": 1157.88,
      "Time_End": 1162.72,
      "Text": " whatever across multiple items along the way. And so what I get is this. Not like just some"
    },
    {
      "Time_Start": 1162.72,
      "Time_End": 1167.0400000000002,
      "Text": " creepy old man staring into the Palantir or whatever the hell this orb is or whatever, but"
    },
    {
      "Time_Start": 1167.0400000000002,
      "Time_End": 1171.8400000000001,
      "Text": " really, check out my orb. Operational relay boxes. People who say command and control nodes"
    },
    {
      "Time_Start": 1171.8400000000001,
      "Time_End": 1176.72,
      "Text": " and call them orbs, you can probably guess either they worked somewhere previously or they're"
    },
    {
      "Time_Start": 1176.72,
      "Time_End": 1182.0,
      "Text": " LARPing as someone that worked somewhere previously. The idea being is that you get"
    },
    {
      "Time_Start": 1182.0,
      "Time_End": 1186.88,
      "Text": " burnable, reusable infrastructure that's not directly linked to yourself in order to execute"
    },
    {
      "Time_Start": 1186.88,
      "Time_End": 1191.96,
      "Text": " operations to avoid tracing back and to also allow for you to burn that infrastructure"
    },
    {
      "Time_Start": 1191.96,
      "Time_End": 1196.8400000000001,
      "Text": " without losing something more valuable in the process. So what's the so what behind these"
    },
    {
      "Time_Start": 1196.8400000000001,
      "Time_End": 1199.96,
      "Text": " sorts of items? Like, okay, it's cool hacking programs that got leaked or whatever. Big"
    },
    {
      "Time_Start": 1199.96,
      "Time_End": 1205.6000000000001,
      "Text": " fucking deal, dude. Like, well, there's this focus on scalability and control of widespread"
    },
    {
      "Time_Start": 1205.6000000000001,
      "Time_End": 1209.68,
      "Text": " operations. If you want to be in an intelligence agency in the 21st century at this point,"
    },
    {
      "Time_Start": 1209.68,
      "Time_End": 1214.1200000000001,
      "Text": " there's a lot of shit out there in order to go after. And doing this on a very human scale"
    },
    {
      "Time_Start": 1214.1200000000001,
      "Time_End": 1218.8000000000002,
      "Text": " basis just doesn't scale all that effectively unless you can throw thousands of bodies at"
    },
    {
      "Time_Start": 1218.8000000000002,
      "Time_End": 1223.0000000000002,
      "Text": " it, which is what some people assume China is doing, which seems almost borderline racist"
    },
    {
      "Time_Start": 1223.0000000000002,
      "Time_End": 1227.68,
      "Text": " in a certain sort of way. But the idea being is that you either need lots and lots of"
    },
    {
      "Time_Start": 1227.68,
      "Time_End": 1232.5600000000002,
      "Text": " operators or you need to figure out a way to do this in an automated fashion. So getting"
    },
    {
      "Time_Start": 1232.5600000000002,
      "Time_End": 1237.2,
      "Text": " that greater efficiency and extent of cyber activity as enabled by a platform such as"
    },
    {
      "Time_Start": 1237.2,
      "Time_End": 1242.6000000000001,
      "Text": " Scan V gets you to that point where I can do more with less. This is the whole impetus"
    },
    {
      "Time_Start": 1242.6000000000001,
      "Time_End": 1247.5600000000002,
      "Text": " behind detection as code and DevSecOps and whatnot is that just like we are in the defender's"
    },
    {
      "Time_Start": 1247.5600000000002,
      "Time_End": 1252.1200000000001,
      "Text": " space trying to do more with less because, I don't know, we do have the people. Many"
    },
    {
      "Time_Start": 1252.1200000000001,
      "Time_End": 1255.3600000000001,
      "Text": " of them have unfortunately been laid off over the last eight months or whatever, which really"
    },
    {
      "Time_Start": 1255.3600000000001,
      "Time_End": 1259.2800000000002,
      "Text": " fucking sucks. But even still, anyone who worked their salt within this space knows"
    },
    {
      "Time_Start": 1259.2800000000002,
      "Time_End": 1263.2800000000002,
      "Text": " that we can't just continually throw bodies at security problems and expect good things."
    },
    {
      "Time_Start": 1263.2800000000002,
      "Time_End": 1267.68,
      "Text": " Well, it kind of works on the offensive side, too, is you have more and more stuff floating"
    },
    {
      "Time_Start": 1267.72,
      "Time_End": 1273.48,
      "Text": " into information space. So we're really talking about moving beyond one operator, one op"
    },
    {
      "Time_Start": 1273.48,
      "Time_End": 1279.04,
      "Text": " campaigns to massive distributed operations enabled by this platform of gathering"
    },
    {
      "Time_Start": 1279.04,
      "Time_End": 1284.4,
      "Text": " information, collecting infrastructure for use, and then doing a combination of unclassified"
    },
    {
      "Time_Start": 1284.4,
      "Time_End": 1289.72,
      "Text": " and classified network processing and tasking of what has been compromised. All right,"
    },
    {
      "Time_Start": 1289.72,
      "Time_End": 1295.1200000000001,
      "Text": " that's cool, but is this unique? What's Vulcan look like in cyber history? Well, is Vulcan"
    },
    {
      "Time_Start": 1295.1200000000001,
      "Time_End": 1299.24,
      "Text": " activity unique? I've already given you this answer, like, fuck no, it's not unique. This"
    },
    {
      "Time_Start": 1299.24,
      "Time_End": 1303.0400000000002,
      "Text": " sort of shit's been around for a bit. So what's it look like, though, previously? So have we"
    },
    {
      "Time_Start": 1303.0400000000002,
      "Time_End": 1307.5200000000002,
      "Text": " seen similar examples? Yes, we have. We've seen similar examples in Russia. We've seen"
    },
    {
      "Time_Start": 1307.5200000000002,
      "Time_End": 1313.1200000000001,
      "Text": " similar examples in China. Maybe we've seen similar examples in the U.S.? I don't know."
    },
    {
      "Time_Start": 1313.1200000000001,
      "Time_End": 1317.0800000000002,
      "Text": " We'll get to that here in a minute. But really, we can just choose our hacker. And by the"
    },
    {
      "Time_Start": 1317.0800000000002,
      "Time_End": 1322.0000000000002,
      "Text": " way, if anyone in the audience knows or is responsible for creating this image, please let"
    },
    {
      "Time_Start": 1322.0,
      "Time_End": 1325.2,
      "Text": " me know, because I wanted to make stickers or shirts of this for years, and I can't find the"
    },
    {
      "Time_Start": 1325.2,
      "Time_End": 1328.8,
      "Text": " original source for it. So, yeah, hit me up or whatever, because I want to make sure that"
    },
    {
      "Time_Start": 1328.8,
      "Time_End": 1332.2,
      "Text": " you get recognition and whatever else or whatever out of that, because I think that that"
    },
    {
      "Time_Start": 1332.2,
      "Time_End": 1337.16,
      "Text": " picture's frickin' awesome. Anyway, so as we're choosing our hackers here and figuring out,"
    },
    {
      "Time_Start": 1337.16,
      "Time_End": 1341.88,
      "Text": " like, who's been doing this sort of rationalization of cyber operations, we have to look"
    },
    {
      "Time_Start": 1341.88,
      "Time_End": 1345.8,
      "Text": " at Russia and cyber manipulation and where this aligns with Russian cyber operations"
    },
    {
      "Time_Start": 1345.8,
      "Time_End": 1351.88,
      "Text": " history. So we have two facets here, looking at Scandi and Amazit. We have building"
    },
    {
      "Time_Start": 1351.88,
      "Time_End": 1356.72,
      "Text": " compromised networks and monitoring and manipulating information. From those overall"
    },
    {
      "Time_Start": 1356.72,
      "Time_End": 1361.64,
      "Text": " mission profiles, we've seen previous examples of this. So we've seen VPN filter and"
    },
    {
      "Time_Start": 1361.64,
      "Time_End": 1367.1200000000001,
      "Text": " Cyclops Blink from an infrastructure perspective, and SORM, the system for domestic"
    },
    {
      "Time_Start": 1367.1200000000001,
      "Time_End": 1371.88,
      "Text": " monitoring within the Russian Federation when it comes to information collection and"
    },
    {
      "Time_Start": 1371.88,
      "Time_End": 1378.0400000000002,
      "Text": " operations. So in looking at this, VPN filter and Cyclops Blink are two capabilities"
    },
    {
      "Time_Start": 1378.04,
      "Time_End": 1382.36,
      "Text": " somewhat related that were network device targeting capabilities. Like, find a bunch of"
    },
    {
      "Time_Start": 1382.36,
      "Time_End": 1389.52,
      "Text": " vulnerable microteaks, knock them over, and rope these into network collections of nodes"
    },
    {
      "Time_Start": 1389.52,
      "Time_End": 1394.32,
      "Text": " that can be tasked for various purposes. In the case of VPN filter, it looked like this was"
    },
    {
      "Time_Start": 1394.32,
      "Time_End": 1399.96,
      "Text": " being built into a large distributed denial of service network, likely to target Ukrainian"
    },
    {
      "Time_Start": 1399.96,
      "Time_End": 1404.48,
      "Text": " entities, although it was disrupted by US authorities in conjunction with private sector"
    },
    {
      "Time_Start": 1404.52,
      "Time_End": 1409.28,
      "Text": " and some others before it could be used. But these could also be used to proxy traffic, and"
    },
    {
      "Time_Start": 1409.28,
      "Time_End": 1413.52,
      "Text": " that appears to be the case for Cyclops Blink when it was deployed as a similar capability"
    },
    {
      "Time_Start": 1413.52,
      "Time_End": 1418.6,
      "Text": " of, again, targeting network devices in order to take advantage of unpatched or vulnerable"
    },
    {
      "Time_Start": 1418.6,
      "Time_End": 1423.88,
      "Text": " systems to proxy traffic for follow-on operations. But there's also evidence that"
    },
    {
      "Time_Start": 1423.88,
      "Time_End": 1428.56,
      "Text": " there were further capabilities, at least in review, if not in outright use, such as a"
    },
    {
      "Time_Start": 1428.56,
      "Time_End": 1433.92,
      "Text": " Modbus protocol capability associated with VPN filter. It was only able to collect Modbus,"
    },
    {
      "Time_Start": 1433.92,
      "Time_End": 1439.88,
      "Text": " a OT-based traffic protocol for those unfamiliar. But if you're gathering that information,"
    },
    {
      "Time_Start": 1439.88,
      "Time_End": 1443.92,
      "Text": " presumably you're doing so for a reason that could lead to follow-on exploitation,"
    },
    {
      "Time_Start": 1443.92,
      "Time_End": 1450.0,
      "Text": " manipulation, man-in-the-middle-of-that-stuff, or similar. So as a result, Scan-V represents a"
    },
    {
      "Time_Start": 1450.0,
      "Time_End": 1454.64,
      "Text": " mechanism to automate, control, and manage these sorts of capabilities that Russian"
    },
    {
      "Time_Start": 1454.64,
      "Time_End": 1459.96,
      "Text": " organizations, principally Sandworm, have already deployed, but gaining that scalability"
    },
    {
      "Time_Start": 1459.96,
      "Time_End": 1465.08,
      "Text": " and efficiency to make these operations more realistic and essentially more efficient and"
    },
    {
      "Time_Start": 1465.08,
      "Time_End": 1470.1200000000001,
      "Text": " cheaper to run at scale. But from an information operations perspective, we've also seen"
    },
    {
      "Time_Start": 1470.1200000000001,
      "Time_End": 1475.08,
      "Text": " this with respect to SORM, which is related to a Russian law that allows for, well, requires"
    },
    {
      "Time_Start": 1475.08,
      "Time_End": 1480.76,
      "Text": " that the Russian security services bolt in some hardware into telco providers and similar"
    },
    {
      "Time_Start": 1480.76,
      "Time_End": 1485.76,
      "Text": " in order to gather up traffic and perform surveillance at scale. So this has been around"
    },
    {
      "Time_Start": 1485.76,
      "Time_End": 1491.24,
      "Text": " for over 10 years at this point, and has been documented by a variety of organizations,"
    },
    {
      "Time_Start": 1491.24,
      "Time_End": 1495.96,
      "Text": " whether we're talking about commercial press or things like the European Council of Human"
    },
    {
      "Time_Start": 1495.96,
      "Time_End": 1500.96,
      "Text": " Rights and so forth. But the thing is, is that SORM requires putting hardware into the"
    },
    {
      "Time_Start": 1500.96,
      "Time_End": 1506.08,
      "Text": " telco provider's network and then stepping away. Where SORM gives way to something like"
    },
    {
      "Time_Start": 1506.08,
      "Time_End": 1511.64,
      "Text": " Amazit is the ability to forward deploy that and allow for information influence operations"
    },
    {
      "Time_Start": 1511.64,
      "Time_End": 1515.92,
      "Text": " to move beyond just the network backbone that's already under direct physical and legal"
    },
    {
      "Time_Start": 1515.92,
      "Time_End": 1520.44,
      "Text": " control by the authorities in question, but they begin deploying that in, say, the occupied"
    },
    {
      "Time_Start": 1520.44,
      "Time_End": 1526.1200000000001,
      "Text": " areas of Ukraine or similar regions to sort of extend that sort of visibility and capability"
    },
    {
      "Time_Start": 1526.1200000000001,
      "Time_End": 1530.64,
      "Text": " into areas where it would otherwise take significantly more effort in order to try to rebuild and"
    },
    {
      "Time_Start": 1530.64,
      "Time_End": 1535.76,
      "Text": " re-architect the backbone behind the communication networks in such organizations. I can instead"
    },
    {
      "Time_Start": 1535.76,
      "Time_End": 1539.88,
      "Text": " take a suitcase, plug it into the base station controller of a given area, and boom, I start"
    },
    {
      "Time_Start": 1539.92,
      "Time_End": 1545.3600000000001,
      "Text": " collecting and manhandling information, especially across social media platforms. So okay, we've"
    },
    {
      "Time_Start": 1545.3600000000001,
      "Time_End": 1550.3600000000001,
      "Text": " picked on Russia a lot. All right, poor Russia, right? Actually, no, fuck them. But what about"
    },
    {
      "Time_Start": 1556.2,
      "Time_End": 1561.64,
      "Text": " China? What about China? China's out there too, right? Aren't they really active in this"
    },
    {
      "Time_Start": 1561.64,
      "Time_End": 1564.88,
      "Text": " space? Well, they certainly are, and one of the ways I think a lot of folks are familiar"
    },
    {
      "Time_Start": 1564.92,
      "Time_End": 1570.1200000000001,
      "Text": " with is the Great Firewall of China, one of several reasons why I will, as much as I would"
    },
    {
      "Time_Start": 1570.1200000000001,
      "Time_End": 1575.3600000000001,
      "Text": " love to go to China someday, I know it's not going to happen anytime soon, but why VPN"
    },
    {
      "Time_Start": 1575.3600000000001,
      "Time_End": 1580.92,
      "Text": " services are such a hot commodity for people in the Chinese ecosystem to try to evade Great"
    },
    {
      "Time_Start": 1580.92,
      "Time_End": 1586.44,
      "Text": " Firewall traffic control and traffic interception. Less heralded, but honestly more"
    },
    {
      "Time_Start": 1586.44,
      "Time_End": 1591.64,
      "Text": " interesting in my opinion, there was a capability that was disclosed by the folks at Citizen"
    },
    {
      "Time_Start": 1591.64,
      "Time_End": 1597.16,
      "Text": " Lab at the Munk School in Toronto about China's Great Cannon. So this was a capability that"
    },
    {
      "Time_Start": 1597.16,
      "Time_End": 1601.72,
      "Text": " almost took the same infrastructure behind the firewall of deep packet inspection and"
    },
    {
      "Time_Start": 1601.72,
      "Time_End": 1606.96,
      "Text": " traffic moderation and added on the ability to inject into traffic streams to deliver"
    },
    {
      "Time_Start": 1606.96,
      "Time_End": 1611.92,
      "Text": " exploitation payloads to targets of interest based upon the traffic recorded. Certainly"
    },
    {
      "Time_Start": 1611.92,
      "Time_End": 1616.64,
      "Text": " things like SSL are your friend in these sorts of cases, unless that is also being proxied as"
    },
    {
      "Time_Start": 1616.64,
      "Time_End": 1621.5600000000002,
      "Text": " part of the firewall operations, but the idea here is providing an effective means to"
    },
    {
      "Time_Start": 1621.5600000000002,
      "Time_End": 1626.72,
      "Text": " exploit individual users at scale based upon selectors identified in traffic to get"
    },
    {
      "Time_Start": 1626.72,
      "Time_End": 1632.68,
      "Text": " endpoints on, or compromised endpoints for dissidents, political opposition, commercial"
    },
    {
      "Time_Start": 1632.68,
      "Time_End": 1636.5200000000002,
      "Text": " organizations or whatever that might be opposed to the regime or present a risk of some"
    },
    {
      "Time_Start": 1636.5200000000002,
      "Time_End": 1642.3600000000001,
      "Text": " sort, and there's a desired need to monitor. So in looking at this, the Great Cannon, that"
    },
    {
      "Time_Start": 1642.3600000000001,
      "Time_End": 1647.4,
      "Text": " came out in 2015, that's almost 10 fricking years ago. Where was technology 10 years ago?"
    },
    {
      "Time_Start": 1647.4,
      "Time_End": 1650.8000000000002,
      "Text": " This is a lot different or whatever now or whatever, if nothing else we're on generation what"
    },
    {
      "Time_Start": 1650.8000000000002,
      "Time_End": 1656.7600000000002,
      "Text": " for iPhones, right? But the idea being is that shits change and as a result, presumably, and"
    },
    {
      "Time_Start": 1656.7600000000002,
      "Time_End": 1662.8000000000002,
      "Text": " we've seen this, that the PRC is continuing to invest and invest quite heavily in CNO"
    },
    {
      "Time_Start": 1662.8000000000002,
      "Time_End": 1667.68,
      "Text": " capabilities and other cyber operations. And we've seen this reflected in widespread intrusion"
    },
    {
      "Time_Start": 1667.68,
      "Time_End": 1674.0,
      "Text": " operations, like the proxy shell, proxy logon exploitation campaigns, going back to last"
    },
    {
      "Time_Start": 1674.0,
      "Time_End": 1678.16,
      "Text": " year to something that Orange Psy eventually presented at Black Cat, I believe, as well as"
    },
    {
      "Time_Start": 1678.16,
      "Time_End": 1683.2,
      "Text": " Defcon, but that was weaponized by Chinese threat actors for quite some time due to"
    },
    {
      "Time_Start": 1683.2,
      "Time_End": 1687.64,
      "Text": " mysterious items around the disclosure of those vulnerabilities to Microsoft, but also"
    },
    {
      "Time_Start": 1687.64,
      "Time_End": 1692.3200000000002,
      "Text": " more recent campaigns targeting Barracuda email security gateways and other infrastructure."
    },
    {
      "Time_Start": 1692.6,
      "Time_End": 1698.56,
      "Text": " China's going wild on popping infrastructure right now and we can see hints of the"
    },
    {
      "Time_Start": 1698.56,
      "Time_End": 1702.96,
      "Text": " automation aspect when it comes to something like the Great Cannon. So looking at the"
    },
    {
      "Time_Start": 1702.96,
      "Time_End": 1707.3999999999999,
      "Text": " combination of Great Firewall and Cannon functionality starts giving us glimpses of"
    },
    {
      "Time_Start": 1707.3999999999999,
      "Time_End": 1712.36,
      "Text": " similar ambitions and similar programs that we see in the Russian space, with the main"
    },
    {
      "Time_Start": 1712.36,
      "Time_End": 1716.6399999999999,
      "Text": " question being the scalability and management of these capabilities and how they would"
    },
    {
      "Time_Start": 1716.6399999999999,
      "Time_End": 1721.0,
      "Text": " link to more widespread intrusion campaigns. Could China build their own Scan-V,"
    },
    {
      "Time_Start": 1721.0,
      "Time_End": 1724.0,
      "Text": " essentially? My answer is like, yeah, they're pretty fucking smart. Of course they could"
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1728.08,
      "Text": " build it if they want to. And now that this information is out there, probably incentivized"
    },
    {
      "Time_Start": 1728.08,
      "Time_End": 1733.16,
      "Text": " to do so at some point in the future. But wait, there's more. Hey, remember the Snowden"
    },
    {
      "Time_Start": 1733.16,
      "Time_End": 1737.68,
      "Text": " leaks? Like that, that wasn't too long ago, right? That was only like, what, 15 years, 10"
    },
    {
      "Time_Start": 1737.68,
      "Time_End": 1745.2,
      "Text": " years, 10 years ago? Yeah. Yeah. 10 years ago, like a month ago. So note and obligatory"
    },
    {
      "Time_Start": 1745.2,
      "Time_End": 1748.76,
      "Text": " cover my ass or whatever statement here that the following slides are based on public"
    },
    {
      "Time_Start": 1748.76,
      "Time_End": 1753.24,
      "Text": " commentary and posting and neither confirm nor deny the accuracy or veracity of the items"
    },
    {
      "Time_Start": 1753.24,
      "Time_End": 1757.2,
      "Text": " discussed. These are all theoretical things that people have posted about that have"
    },
    {
      "Time_Start": 1757.2,
      "Time_End": 1762.8799999999999,
      "Text": " analyzed the Snowden files or Snowden leaks directly. Anyway, that out of the way, the"
    },
    {
      "Time_Start": 1762.8799999999999,
      "Time_End": 1766.68,
      "Text": " leaks and their implications is that we had a popular conception that mostly revolved"
    },
    {
      "Time_Start": 1766.68,
      "Time_End": 1772.68,
      "Text": " around the PRISM program. That was a questionable program for domestic surveillance"
    },
    {
      "Time_Start": 1772.68,
      "Time_End": 1777.0,
      "Text": " and so forth, targeting a variety of communication platforms and social media and so"
    },
    {
      "Time_Start": 1777.0,
      "Time_End": 1782.2,
      "Text": " forth. That was certainly important and arguably very, very bad. But that wasn't the"
    },
    {
      "Time_Start": 1782.2,
      "Time_End": 1786.84,
      "Text": " only thing leaked, which is why there's questions about Mr. Snowden's motivations and so"
    },
    {
      "Time_Start": 1786.84,
      "Time_End": 1793.24,
      "Text": " forth based upon the other things that were cast out into the world as well. Because"
    },
    {
      "Time_Start": 1793.24,
      "Time_End": 1798.12,
      "Text": " there were additional programs disclosed, including Snowden and potentially others,"
    },
    {
      "Time_Start": 1798.12,
      "Time_End": 1802.56,
      "Text": " because we've seen things like shadow brokers and other sorts of entities come along over"
    },
    {
      "Time_Start": 1802.56,
      "Time_End": 1808.8799999999999,
      "Text": " time, disclosing significant information on computer network operation capabilities such"
    },
    {
      "Time_Start": 1808.8799999999999,
      "Time_End": 1815.1599999999999,
      "Text": " as widespread automated exploitation and control frameworks that were being used by NSA"
    },
    {
      "Time_Start": 1815.1599999999999,
      "Time_End": 1820.56,
      "Text": " and 5i partners according to reporting prior to those leaks coming wild or coming into the"
    },
    {
      "Time_Start": 1820.56,
      "Time_End": 1826.48,
      "Text": " wild. So we can talk about a quantum of exploitation. So looking at Fox IT and other"
    },
    {
      "Time_Start": 1826.52,
      "Time_End": 1832.32,
      "Text": " organizations, there was an item in the Snowden leaks concerning a program called"
    },
    {
      "Time_Start": 1832.32,
      "Time_End": 1837.24,
      "Text": " quantum that essentially provided a man on the side capability of monitoring traffic"
    },
    {
      "Time_Start": 1837.24,
      "Time_End": 1842.32,
      "Text": " through various observation points and then when traffic of interest is identified, injecting"
    },
    {
      "Time_Start": 1842.32,
      "Time_End": 1847.3600000000001,
      "Text": " into that traffic stream and trying to then achieve exploitation based upon selectors."
    },
    {
      "Time_Start": 1847.3600000000001,
      "Time_End": 1851.68,
      "Text": " Sounding a little different because there's that man in the middle portion of events, but"
    },
    {
      "Time_Start": 1851.68,
      "Time_End": 1855.24,
      "Text": " from the automated exploitation and control perspective, this is looking a little bit like"
    },
    {
      "Time_Start": 1855.24,
      "Time_End": 1860.76,
      "Text": " Scan-V in certain aspects. And there were fun diagrams or whatever noting how the"
    },
    {
      "Time_Start": 1860.76,
      "Time_End": 1865.52,
      "Text": " internet or whatever was basically targeted or whatever in such a way to allow for"
    },
    {
      "Time_Start": 1865.52,
      "Time_End": 1869.76,
      "Text": " identification of traffic of interest that would then result in not just exploitation, but"
    },
    {
      "Time_Start": 1869.76,
      "Time_End": 1875.52,
      "Text": " then marshalling those exploited end nodes into intelligence agency controlled apparatus."
    },
    {
      "Time_Start": 1875.52,
      "Time_End": 1880.56,
      "Text": " So fun stuff there. The main thing with this sort of automated exploitation at scale is"
    },
    {
      "Time_Start": 1880.6,
      "Time_End": 1885.2,
      "Text": " that they represent automated exploit systems similar to what we're seeing with Scan-V."
    },
    {
      "Time_Start": 1885.2,
      "Time_End": 1890.56,
      "Text": " Disclosed publicly and certainly you started seeing articles in Wired and the Fox IT article"
    },
    {
      "Time_Start": 1890.56,
      "Time_End": 1895.2,
      "Text": " and some hacker forum posts and like how you can do this on your own, you know, started"
    },
    {
      "Time_Start": 1895.2,
      "Time_End": 1901.8799999999999,
      "Text": " popping up about 2012, 2013 or whatever. Not that long after, or 2013, 2014, not that long"
    },
    {
      "Time_Start": 1901.8799999999999,
      "Time_End": 1907.32,
      "Text": " after the leaks. But what's interesting is that what was 5i alleged state of the art almost"
    },
    {
      "Time_Start": 1907.32,
      "Time_End": 1912.8,
      "Text": " 15 years ago at this point, given the likely origin of when the documents actually"
    },
    {
      "Time_Start": 1912.8,
      "Time_End": 1918.8799999999999,
      "Text": " were emerged that Mr. Snowden then decided to yeet out to the world, we see artifacts of"
    },
    {
      "Time_Start": 1918.8799999999999,
      "Time_End": 1924.4399999999998,
      "Text": " this now reflected in Russian and Chinese operations. So the point is that if true, these"
    },
    {
      "Time_Start": 1924.4399999999998,
      "Time_End": 1928.9199999999998,
      "Text": " Snowden leaks were arguably a disaster for the United States related to CNO and SIGINT"
    },
    {
      "Time_Start": 1928.9199999999998,
      "Time_End": 1933.8799999999999,
      "Text": " capabilities by disclosing methodology. Like as an intelligence agency, that's very, very"
    },
    {
      "Time_Start": 1933.88,
      "Time_End": 1938.72,
      "Text": " fucking bad. However, it also appears that multiple other parties were paying attention and"
    },
    {
      "Time_Start": 1938.72,
      "Time_End": 1943.5200000000002,
      "Text": " taking notes on how to build similar or potentially even more ambitious programs based on"
    },
    {
      "Time_Start": 1943.5200000000002,
      "Time_End": 1948.1200000000001,
      "Text": " these disclosures. Disclosures, whether we're talking Snowden, Vulcan, or anything in"
    },
    {
      "Time_Start": 1948.1200000000001,
      "Time_End": 1951.96,
      "Text": " between, like Vault 7 or Shadow Brokers, and we've seen this with Shadow Brokers"
    },
    {
      "Time_Start": 1951.96,
      "Time_End": 1957.0,
      "Text": " eventually leading to WannaCry, this shit doesn't happen in a void. Just because some"
    },
    {
      "Time_Start": 1957.0,
      "Time_End": 1960.24,
      "Text": " researcher or journalist or whatever pushes this out there doesn't mean like, oh,"
    },
    {
      "Time_Start": 1960.24,
      "Time_End": 1964.64,
      "Text": " capabilities are burned, move on. Nope. Folks are taking notes and learning from each other and"
    },
    {
      "Time_Start": 1964.64,
      "Time_End": 1968.32,
      "Text": " making sure that they're trying to adapt to the state of the art of adversaries or even"
    },
    {
      "Time_Start": 1968.32,
      "Time_End": 1974.56,
      "Text": " allies as they may see fit or necessary to do so. So what's the future of offensive cyber"
    },
    {
      "Time_Start": 1974.56,
      "Time_End": 1981.04,
      "Text": " then, in light of all this sort of activity? Well, well, well. There's a popular conception of"
    },
    {
      "Time_Start": 1981.04,
      "Time_End": 1984.88,
      "Text": " cyber, of computer network operations, you've got one asshole on a keyboard or whatever"
    },
    {
      "Time_Start": 1984.88,
      "Time_End": 1990.48,
      "Text": " doing bad stuff, or like if you're a red teamer doing bad stuff for good reasons. And that's"
    },
    {
      "Time_Start": 1990.48,
      "Time_End": 1994.72,
      "Text": " cool and all, and maybe it encapsulates some of what still counts for red teaming and"
    },
    {
      "Time_Start": 1994.72,
      "Time_End": 1999.5200000000002,
      "Text": " pentesting or whatever operations, and maybe for some state-sponsored programs, but a"
    },
    {
      "Time_Start": 1999.5200000000002,
      "Time_End": 2005.0400000000002,
      "Text": " more realistic depiction of CNO these days? You're sitting in a frickin' cube farm, man."
    },
    {
      "Time_Start": 2005.0400000000002,
      "Time_End": 2011.8000000000002,
      "Text": " This is a discipline now that has evolved beyond like one individual executing a single"
    },
    {
      "Time_Start": 2011.8,
      "Time_End": 2018.04,
      "Text": " operation to trying to develop frameworks to do these sorts of operations at scale. And we've"
    },
    {
      "Time_Start": 2018.04,
      "Time_End": 2024.44,
      "Text": " seen this in multiple aspects at this point. So just looking at this slide, we have scan V, we"
    },
    {
      "Time_Start": 2024.44,
      "Time_End": 2030.68,
      "Text": " have the Snowden leaks items, and we have the great cannon, all representing attempts, some"
    },
    {
      "Time_Start": 2030.68,
      "Time_End": 2037.32,
      "Text": " successful, some still maybe notional. It's debatable if scan V actually went live or not. I've"
    },
    {
      "Time_Start": 2037.32,
      "Time_End": 2042.04,
      "Text": " been looking for a scan V node. If you find one, let me know. I'd be curious to take a look at it."
    },
    {
      "Time_Start": 2042.04,
      "Time_End": 2048.44,
      "Text": " But the idea being is that we're looking for a road to scalable cyber, and that applies across"
    },
    {
      "Time_Start": 2048.44,
      "Time_End": 2055.0,
      "Text": " personnel, targeting, and operational security. So from a personnel standpoint, cyber talent, while"
    },
    {
      "Time_Start": 2055.0,
      "Time_End": 2060.04,
      "Text": " it is available right now because VCs are laying people off and they suck, the talent is still"
    },
    {
      "Time_Start": 2060.04,
      "Time_End": 2063.96,
      "Text": " expensive, especially if you're working in the .gov or .mil space and have to compete with private"
    },
    {
      "Time_Start": 2063.96,
      "Time_End": 2070.44,
      "Text": " industry and so forth. So the ability to codify skills and capabilities in programs and in"
    },
    {
      "Time_Start": 2070.44,
      "Time_End": 2075.7200000000003,
      "Text": " applications becomes quite useful in extending and expanding programs. So you're not doing a,"
    },
    {
      "Time_Start": 2075.7200000000003,
      "Time_End": 2081.0,
      "Text": " you know, arithmetic expansion like one operator, one up, but rather a geometric expansion that I"
    },
    {
      "Time_Start": 2081.0,
      "Time_End": 2085.64,
      "Text": " get a couple of devs and I can get a, you know, exponential increase in the number of potential"
    },
    {
      "Time_Start": 2085.64,
      "Time_End": 2090.6,
      "Text": " operations and endpoints that I can exploit. That gets us to targeting, where if you are a"
    },
    {
      "Time_Start": 2090.6,
      "Time_End": 2096.36,
      "Text": " SIGINT authority or state-sponsored intelligence agency with any sort of ambition whatsoever,"
    },
    {
      "Time_Start": 2096.36,
      "Time_End": 2101.88,
      "Text": " global actions or global ambitions require global actions. Being able to successfully"
    },
    {
      "Time_Start": 2101.88,
      "Time_End": 2108.36,
      "Text": " target and manipulate networks at a vast scale and just throwing thousands of, you know, a million"
    },
    {
      "Time_Start": 2108.36,
      "Time_End": 2112.2799999999997,
      "Text": " monkeys on a million terminals or whatever can maybe exploit the internet or whatever in a"
    },
    {
      "Time_Start": 2112.2799999999997,
      "Time_End": 2118.04,
      "Text": " million years and so forth. But that's not realistic. So to really come up with a way to"
    },
    {
      "Time_Start": 2118.12,
      "Time_End": 2122.52,
      "Text": " hack the planet, so to speak, we need to figure out ways of automating and making that efficient."
    },
    {
      "Time_Start": 2122.52,
      "Time_End": 2127.72,
      "Text": " But also, top tier threat actors know that they don't just buy AWS nodes or something like that"
    },
    {
      "Time_Start": 2127.72,
      "Time_End": 2132.92,
      "Text": " these days. Some still do. And there are reasons to do so. But if you're really trying to do things"
    },
    {
      "Time_Start": 2132.92,
      "Time_End": 2138.2,
      "Text": " like conduct offensive cyber operations or disruptive operations, it behooves you to start"
    },
    {
      "Time_Start": 2138.2,
      "Time_End": 2144.12,
      "Text": " making the final hop to the victim network and where you're originally starting operations from"
    },
    {
      "Time_Start": 2144.12,
      "Time_End": 2149.7999999999997,
      "Text": " as far apart as technically feasible, both to maintain your own sources, methods, and"
    },
    {
      "Time_Start": 2149.7999999999997,
      "Time_End": 2153.7999999999997,
      "Text": " command and control frameworks, as well as to potentially muddy the waters around"
    },
    {
      "Time_Start": 2155.0,
      "Time_End": 2159.88,
      "Text": " thorny questions like attribution, but also more importantly, retaliation and response based upon"
    },
    {
      "Time_Start": 2159.88,
      "Time_End": 2166.12,
      "Text": " that. But importantly, the Vulcan leaks are now lagging indicators. This activity has already"
    },
    {
      "Time_Start": 2166.12,
      "Time_End": 2171.56,
      "Text": " taken place. We're looking at this now in the past tense. Thus, we need to anticipate even"
    },
    {
      "Time_Start": 2171.56,
      "Time_End": 2176.92,
      "Text": " greater degrees of automation, queuing, and reactive targeting emerging over time. Again,"
    },
    {
      "Time_Start": 2176.92,
      "Time_End": 2181.24,
      "Text": " Five Eyes were doing these over 10 years ago. China was doing a version of this about six or"
    },
    {
      "Time_Start": 2181.24,
      "Time_End": 2185.7999999999997,
      "Text": " seven years ago. Russia was doing something kind of like this or whatever with VPN filter and"
    },
    {
      "Time_Start": 2185.7999999999997,
      "Time_End": 2192.36,
      "Text": " Cyclops Blink. And then with Scan V, decided to go to 11 on the volume and really make this into"
    },
    {
      "Time_Start": 2192.36,
      "Time_End": 2196.68,
      "Text": " a much more widespread sort of capability. So this shit's going on, and it's been going on,"
    },
    {
      "Time_Start": 2196.68,
      "Time_End": 2201.08,
      "Text": " and it's only going to get better or worse depending on your perspective for things."
    },
    {
      "Time_Start": 2201.08,
      "Time_End": 2205.88,
      "Text": " So what should we expect? Well, I would argue that we should expect greater automation and"
    },
    {
      "Time_Start": 2205.88,
      "Time_End": 2210.52,
      "Text": " improved scalability. Just, you know, accountants and so forth or whatever, they want to try to"
    },
    {
      "Time_Start": 2210.52,
      "Time_End": 2215.64,
      "Text": " make you do more with less, and that applies in .gov.mil space as well, so it's going to happen."
    },
    {
      "Time_Start": 2215.64,
      "Time_End": 2220.6,
      "Text": " That's not a very sexy point, but more interesting is this marshalling of the neutral web for"
    },
    {
      "Time_Start": 2220.6,
      "Time_End": 2228.04,
      "Text": " offensive actions, where your unpatched SOHO router or whatever becomes a frontline article"
    },
    {
      "Time_Start": 2228.68,
      "Time_End": 2240.2799999999997,
      "Text": " in targeting critical infrastructure in Ukraine. So how do we start defending that? Do we start"
    },
    {
      "Time_Start": 2240.2799999999997,
      "Time_End": 2245.08,
      "Text": " doing things like automated remediation of vulnerable nodes or whatever that are in neutral"
    },
    {
      "Time_Start": 2245.08,
      "Time_End": 2249.24,
      "Text": " space? Can we do that? Is that legal? Will that piss people off? Yes, it will piss people off,"
    },
    {
      "Time_Start": 2249.24,
      "Time_End": 2254.2,
      "Text": " but it really becomes a thorny issue for how we start responding, reacting, and doing things like"
    },
    {
      "Time_Start": 2254.2000000000003,
      "Time_End": 2258.84,
      "Text": " takedowns against these sorts of capabilities. There's also, and this is actually kind of cool,"
    },
    {
      "Time_Start": 2258.84,
      "Time_End": 2264.1200000000003,
      "Text": " I think, less reliance on rock stars and more commoditization of capabilities. So we want to"
    },
    {
      "Time_Start": 2264.1200000000003,
      "Time_End": 2270.1200000000003,
      "Text": " talk about lowering the barriers to entry when it comes to cyber. This is one way that I don't need"
    },
    {
      "Time_Start": 2270.1200000000003,
      "Time_End": 2275.32,
      "Text": " to rely on, like, two or three top-tier hacksaws or whatever in order to execute all my operations."
    },
    {
      "Time_Start": 2275.32,
      "Time_End": 2281.5600000000004,
      "Text": " Rather, I just need to identify ways of getting that knowledge that is employed by those"
    },
    {
      "Time_Start": 2281.56,
      "Time_End": 2286.2799999999997,
      "Text": " individuals, putting it into code, and then deploying it in some way that scales effectively."
    },
    {
      "Time_Start": 2286.92,
      "Time_End": 2291.96,
      "Text": " And also, you know, I'll give all the AI vendors or whatever a lot of shit because there's so much"
    },
    {
      "Time_Start": 2291.96,
      "Time_End": 2296.68,
      "Text": " bullshit out there right now, but there are non-bullshit applications for artificial"
    },
    {
      "Time_Start": 2296.68,
      "Time_End": 2302.12,
      "Text": " intelligence when it comes to this sort of activity. So imagine, if you will, that in"
    },
    {
      "Time_Start": 2302.12,
      "Time_End": 2306.6,
      "Text": " addition to building, say, an automated fuzzing platform for vulnerability identification, you"
    },
    {
      "Time_Start": 2306.6,
      "Time_End": 2312.68,
      "Text": " extend that even a little bit further to a system that can do system scanning and classification"
    },
    {
      "Time_Start": 2312.68,
      "Time_End": 2316.8399999999997,
      "Text": " that, say, could identify, based upon the system type and vulnerability, what is a reasonable"
    },
    {
      "Time_Start": 2316.8399999999997,
      "Time_End": 2321.24,
      "Text": " vulnerability that I could exploit that minimizes my risk of detection, and then what follow-on"
    },
    {
      "Time_Start": 2321.24,
      "Time_End": 2327.08,
      "Text": " payload is most suitable for this device to ensure either it's a lasting node in my network or I can"
    },
    {
      "Time_Start": 2327.08,
      "Time_End": 2332.68,
      "Text": " use it as an immediately burnable item for, say, deploying a wiper against a system of interest"
    },
    {
      "Time_Start": 2332.68,
      "Time_End": 2338.8399999999997,
      "Text": " that I want to take out of the internet. I apologize. It's like day three of DEF CON. My voice is going."
    },
    {
      "Time_Start": 2341.8799999999997,
      "Time_End": 2350.12,
      "Text": " Yeah. Anyway, so where does that put us? It's like conclusions. Like, yeah,"
    },
    {
      "Time_Start": 2350.12,
      "Time_End": 2356.9199999999996,
      "Text": " adversaries innovate, man. Like, that's cool. But where are we now? Capability, inspiration,"
    },
    {
      "Time_Start": 2356.9199999999996,
      "Time_End": 2362.12,
      "Text": " and proliferation, basically. So adversaries learn from operations and open source research."
    },
    {
      "Time_Start": 2362.12,
      "Time_End": 2367.56,
      "Text": " Every action comes with some sort of response or reaction in some great Newtonian reflection"
    },
    {
      "Time_Start": 2367.56,
      "Time_End": 2372.68,
      "Text": " within the cyber ecosystem. And thus, today's leaker disclosure becomes the inspiration for,"
    },
    {
      "Time_Start": 2372.68,
      "Time_End": 2377.72,
      "Text": " or the, hey, why the fuck aren't we doing that, for some other party or whatever that happens"
    },
    {
      "Time_Start": 2377.72,
      "Time_End": 2383.64,
      "Text": " to be involved in this space. With that, computer network operations is not a static field, but a"
    },
    {
      "Time_Start": 2383.64,
      "Time_End": 2387.88,
      "Text": " constantly evolving one with multiple factors. You want to talk about three-body problems? We're"
    },
    {
      "Time_Start": 2387.88,
      "Time_End": 2393.48,
      "Text": " talking about like a five or six-body problem here in terms of adversary and defender reactions"
    },
    {
      "Time_Start": 2393.48,
      "Time_End": 2398.36,
      "Text": " and relationships, as well as other sort of factors that come into play. So what's our"
    },
    {
      "Time_Start": 2398.36,
      "Time_End": 2403.32,
      "Text": " guidance for defenders and decision makers? My community. Well, adversaries are constantly"
    },
    {
      "Time_Start": 2403.32,
      "Time_End": 2406.6800000000003,
      "Text": " evolving and learning. Like, no shit, Sherlock. Of course they fucking are. Otherwise they'll lose"
    },
    {
      "Time_Start": 2406.6800000000003,
      "Time_End": 2413.0,
      "Text": " their jobs. Well, legacy techniques and tradecraft for defense and identification will fail. If we're"
    },
    {
      "Time_Start": 2413.0,
      "Time_End": 2420.2,
      "Text": " relying on things like, you know, block listing or the IP addresses associated with C2 frameworks"
    },
    {
      "Time_Start": 2420.2,
      "Time_End": 2424.2,
      "Text": " or whatever, it's a losing game. Why? Because of a thing like scan B, it's like, oh, you block"
    },
    {
      "Time_Start": 2424.2,
      "Time_End": 2428.28,
      "Text": " this node? Well, I have 15 more or whatever over here for just this one op, and I can get a"
    },
    {
      "Time_Start": 2428.28,
      "Time_End": 2433.4,
      "Text": " hundred more if I want later on. It's playing whack-a-mole and it's a game that defenders are"
    },
    {
      "Time_Start": 2433.4,
      "Time_End": 2438.12,
      "Text": " going to lose. So instead, we need to start building an emphasis on things like behavioral"
    },
    {
      "Time_Start": 2438.12,
      "Time_End": 2443.48,
      "Text": " analysis of traffic patterns and anomaly enrichment are necessary items, which kind of"
    },
    {
      "Time_Start": 2443.48,
      "Time_End": 2447.64,
      "Text": " gets us into that creepy AI space a little bit, but again, if done well and done accurately without"
    },
    {
      "Time_Start": 2447.64,
      "Time_End": 2452.2,
      "Text": " the marketing bullshit around it, can actually be a viable way of trying to resolve some of these"
    },
    {
      "Time_Start": 2452.2,
      "Time_End": 2458.44,
      "Text": " problems. So the idea here is that defenders can't rely on just sort of statically addressing"
    },
    {
      "Time_Start": 2458.44,
      "Time_End": 2463.0,
      "Text": " individual threats, but trying to understand categories of threat action in order to then"
    },
    {
      "Time_Start": 2463.0,
      "Time_End": 2467.64,
      "Text": " take some sort of defensive response. Okay, that's my community. What about your community? For all"
    },
    {
      "Time_Start": 2467.64,
      "Time_End": 2471.96,
      "Text": " the red teamers and hackers and such out there, whatever. Well, in addition to, thank you for"
    },
    {
      "Time_Start": 2471.96,
      "Time_End": 2475.7999999999997,
      "Text": " letting me speak to you for a while, and I hope this was interesting. Really, what we're looking"
    },
    {
      "Time_Start": 2475.7999999999997,
      "Time_End": 2480.92,
      "Text": " for is that human-driven operations are rapidly being replaced by high-end threat actors. We're"
    },
    {
      "Time_Start": 2480.92,
      "Time_End": 2485.24,
      "Text": " not talking about like the elite hacker or whatever in the hoodie or whatever, or Mr. Robot tapping"
    },
    {
      "Time_Start": 2485.24,
      "Time_End": 2489.3199999999997,
      "Text": " away or whatever in the dark. It's like that shit just doesn't happen anymore. We're talking about"
    },
    {
      "Time_Start": 2489.3199999999997,
      "Time_End": 2494.2799999999997,
      "Text": " bureaucracies of dedicated developers, infrastructure teams, exploit development teams"
    },
    {
      "Time_Start": 2494.28,
      "Time_End": 2498.92,
      "Text": " working in concert in order to develop and deploy capabilities for whatever reason."
    },
    {
      "Time_Start": 2499.96,
      "Time_End": 2505.1600000000003,
      "Text": " As a result, actually emulating adversaries, while it's really, you know, depending on the"
    },
    {
      "Time_Start": 2505.1600000000003,
      "Time_End": 2507.96,
      "Text": " organization that you're working with, some of this goes out the window because it's like you"
    },
    {
      "Time_Start": 2507.96,
      "Time_End": 2515.1600000000003,
      "Text": " have single factor auth on your VPN. Like, please, you know, try harder. You know, for those organizations"
    },
    {
      "Time_Start": 2515.1600000000003,
      "Time_End": 2519.7200000000003,
      "Text": " they're already screwed. But if we're talking about trying to emulate adversaries for more"
    },
    {
      "Time_Start": 2519.7200000000003,
      "Time_End": 2525.32,
      "Text": " mature organizations as hackers, red teamers, pen testers, et cetera, we need to think at a"
    },
    {
      "Time_Start": 2525.32,
      "Time_End": 2529.7200000000003,
      "Text": " higher level of like, okay, how does this sort of operation scale? How can I start mimicking"
    },
    {
      "Time_Start": 2529.7200000000003,
      "Time_End": 2533.88,
      "Text": " this sort of activity in a meaningful way that I'm not just testing defenses but providing"
    },
    {
      "Time_Start": 2533.88,
      "Time_End": 2540.0400000000004,
      "Text": " opportunities for defenders to look at traffic and actions that are similar to what my adversaries"
    },
    {
      "Time_Start": 2540.0400000000004,
      "Time_End": 2544.84,
      "Text": " are doing? Less testing and probing will become more challenging. It's not just about spinning"
    },
    {
      "Time_Start": 2544.84,
      "Time_End": 2550.04,
      "Text": " up an AWS node and then brute forcing traffic on the single factor VPN anymore and then"
    },
    {
      "Time_Start": 2550.04,
      "Time_End": 2554.36,
      "Text": " migrating to the domain controller, pulling creds and game over. But really thinking about like,"
    },
    {
      "Time_Start": 2554.36,
      "Time_End": 2559.4,
      "Text": " okay, how do I start really emulating what we've seen over the last ten years in terms of"
    },
    {
      "Time_Start": 2559.4,
      "Time_End": 2564.84,
      "Text": " infrastructure deployment and then action on the part of high end threat actors? So where do we go"
    },
    {
      "Time_Start": 2564.84,
      "Time_End": 2570.1200000000003,
      "Text": " from here? Networks of various types will continue to be weaponized by threat actors, either as"
    },
    {
      "Time_Start": 2570.2,
      "Time_End": 2575.48,
      "Text": " end targets, so going direct to my victim, less likely for my high end threat actors but more"
    },
    {
      "Time_Start": 2575.48,
      "Time_End": 2581.56,
      "Text": " likely as means to reaching them. I'm going after and doing these exploited scale campaigns,"
    },
    {
      "Time_Start": 2581.56,
      "Time_End": 2585.16,
      "Text": " not because these targets are immediately of interest but because they provide me with a way"
    },
    {
      "Time_Start": 2585.16,
      "Time_End": 2590.2,
      "Text": " of tunneling my traffic to my ultimate victims and that neutral or third party web space in"
    },
    {
      "Time_Start": 2590.2,
      "Time_End": 2593.96,
      "Text": " between starts to become a very interesting battle ground where there's not a whole lot of"
    },
    {
      "Time_Start": 2593.96,
      "Time_End": 2598.7599999999998,
      "Text": " agreement on authorities to operate and what defenders, let alone law enforcement, can do to"
    },
    {
      "Time_Start": 2598.76,
      "Time_End": 2604.0400000000004,
      "Text": " respond to them. Like, if you hack back or whatever on the C2 server and it's an application"
    },
    {
      "Time_Start": 2604.0400000000004,
      "Time_End": 2608.5200000000004,
      "Text": " server for a university somewhere, what have you done? Have you committed a crime? Arguably yes."
    },
    {
      "Time_Start": 2609.2400000000002,
      "Time_End": 2613.5600000000004,
      "Text": " Is that a reasonable response or whatever for that node being used to send like some"
    },
    {
      "Time_Start": 2613.5600000000004,
      "Time_End": 2617.96,
      "Text": " LDOS based wiper or whatever on your network? Probably not, but how do we figure this out?"
    },
    {
      "Time_Start": 2617.96,
      "Time_End": 2621.8,
      "Text": " These are questions that policy people should be addressing but instead they're talking about"
    },
    {
      "Time_Start": 2621.8,
      "Time_End": 2625.1600000000003,
      "Text": " commercial threat attribution and naming schemas and other bullshit like that and not really"
    },
    {
      "Time_Start": 2625.16,
      "Time_End": 2630.52,
      "Text": " helping out. That's my world, I'm sorry. The idea though is that the increasing scale and"
    },
    {
      "Time_Start": 2630.52,
      "Time_End": 2634.7599999999998,
      "Text": " velocity of campaigns will make defense and response challenging but not impossible. We"
    },
    {
      "Time_Start": 2634.7599999999998,
      "Time_End": 2639.3199999999997,
      "Text": " just need to recognize the state of where things are and begin moving and adapting defensive"
    },
    {
      "Time_Start": 2639.3199999999997,
      "Time_End": 2644.3599999999997,
      "Text": " controls and countermeasures in tandem with that to come up with reasonable solutions. I have no"
    },
    {
      "Time_Start": 2644.3599999999997,
      "Time_End": 2651.3199999999997,
      "Text": " freaking idea where I am on time right now. I have two minutes, that's not enough time for"
    },
    {
      "Time_Start": 2651.32,
      "Time_End": 2655.48,
      "Text": " questions really. I'm happy to meet out in the hallway afterwards if anyone wants to discuss."
    },
    {
      "Time_Start": 2655.48,
      "Time_End": 2660.1200000000003,
      "Text": " I'll hang out like over there somewhere like by the windows or something. But this is available"
    },
    {
      "Time_Start": 2660.1200000000003,
      "Time_End": 2664.6800000000003,
      "Text": " on the media server. Bunch of references and resources related to these topics if you're"
    },
    {
      "Time_Start": 2664.6800000000003,
      "Time_End": 2668.84,
      "Text": " interested in going deeper into these since we really just cover things at a high level."
    },
    {
      "Time_Start": 2668.84,
      "Time_End": 2676.28,
      "Text": " But thank you so much. This was a lot of fun. I hope this was interesting for you."
    }
  ]
}