{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Guys, enjoy. Mmm breakfast. Alright. Morning DEF CON. Thanks for all coming. Thanks for"
    },
    {
      "Time_Start": 9.84,
      "Time_End": 15.42,
      "Text": " having us. Uh this is Badge of Shame. Uh hey I'm uh Dan Petro. I'm a senior security engineer"
    },
    {
      "Time_Start": 15.42,
      "Time_End": 20.92,
      "Text": " at Bishop Fox. Uh before that I was a long time pen tester here at Bishop Fox. Yeah hi"
    },
    {
      "Time_Start": 20.92,
      "Time_End": 25.1,
      "Text": " everyone. I'm the uh new speaker here. My name's David Vargas. I'm a senior consultant with"
    },
    {
      "Time_Start": 25.1,
      "Time_End": 29.900000000000002,
      "Text": " the red team at Bishop Fox. Cool and we're gonna be talking about breaking into secure"
    },
    {
      "Time_Start": 29.900000000000002,
      "Time_End": 35.800000000000004,
      "Text": " facilities. So uh this actually all came about as a part of a pen test um here at Bishop Fox."
    },
    {
      "Time_Start": 35.800000000000004,
      "Time_End": 40.54,
      "Text": " Breaking into secure facilities is easily one of the coolest things that we get to do. And uh"
    },
    {
      "Time_Start": 40.54,
      "Time_End": 45.34,
      "Text": " if you're already familiar with uh like breaking into uh facilities, there's like an ESP key."
    },
    {
      "Time_Start": 45.34,
      "Time_End": 48.980000000000004,
      "Text": " We'll kind of get into this a little bit more um as a tool and we tried using this on a pen"
    },
    {
      "Time_Start": 48.980000000000004,
      "Time_End": 53.06,
      "Text": " test one time. It just like wasn't working and we were super like curious as to why. It"
    },
    {
      "Time_Start": 53.080000000000005,
      "Time_End": 56.82,
      "Text": " turned out that we had an OSDP installation. Uh we hadn't actually seen one in the wild at"
    },
    {
      "Time_Start": 56.82,
      "Time_End": 61.82,
      "Text": " that uh point. And so like I've got a background in cryptographic protocols. Figure why not"
    },
    {
      "Time_Start": 61.82,
      "Time_End": 67.64,
      "Text": " take a look at this thing. And uh this presentation is the result of that. Cool so uh let's"
    },
    {
      "Time_Start": 67.64,
      "Time_End": 72.04,
      "Text": " get into it. So um one of the other things you should know about me is that I hate slides."
    },
    {
      "Time_Start": 72.04,
      "Time_End": 77.94,
      "Text": " Um but uh you can't just get away with not having slides so we made some authentic bespoke"
    },
    {
      "Time_Start": 77.94,
      "Time_End": 82.68,
      "Text": " one off slides. These slides are like organic. They are allowed to turn fully around in"
    },
    {
      "Time_Start": 83.34,
      "Time_End": 87.28,
      "Text": " PowerPoint before being exported. So suppose you're trying to break into a secure facility"
    },
    {
      "Time_Start": 87.28,
      "Time_End": 92.84,
      "Text": " right? Let's say some undisclosed location in Santa Fe, New Mexico. And you like really"
    },
    {
      "Time_Start": 92.84,
      "Time_End": 97.72000000000001,
      "Text": " want to get into this room right? It's like very important to you personally. And this"
    },
    {
      "Time_Start": 97.72000000000001,
      "Time_End": 102.86000000000001,
      "Text": " room like a lot of other rooms has an RFID badge reader that is protecting the entrance to"
    },
    {
      "Time_Start": 102.86000000000001,
      "Time_End": 106.56,
      "Text": " it. Even if you're not familiar with physical security I'm sure you've seen these things"
    },
    {
      "Time_Start": 106.56,
      "Time_End": 110.16000000000001,
      "Text": " right? You take a badge out you just beep it to the little thing and it lets you into the"
    },
    {
      "Time_Start": 110.17999999999999,
      "Time_End": 116.97999999999999,
      "Text": " room. Cool. So uh there's lots of ways of attacking these RFID badge reader systems. Um some"
    },
    {
      "Time_Start": 116.97999999999999,
      "Time_End": 121.46,
      "Text": " of which we've actually pioneered here at Bishop Fox. Um this is the TASIC RFID thief. Uh"
    },
    {
      "Time_Start": 121.46,
      "Time_End": 126.9,
      "Text": " this is a thing that uh my boss Fran made a while ago. It's basically like a long range RFID"
    },
    {
      "Time_Start": 126.9,
      "Time_End": 131.74,
      "Text": " reader. So it can like read badges from about like 5, 6 feet away. Um we developed this"
    },
    {
      "Time_Start": 131.74,
      "Time_End": 135.9,
      "Text": " cool little maneuver where you like uh put it into a briefcase and walk up to somebody at"
    },
    {
      "Time_Start": 135.92000000000002,
      "Time_End": 141.08,
      "Text": " Starbucks with like wearing their badge. And you like set it down and then kind of like pull"
    },
    {
      "Time_Start": 141.08,
      "Time_End": 144.16,
      "Text": " it up and then up onto your shoulder. Like the briefcase and what you're really what you're"
    },
    {
      "Time_Start": 144.16,
      "Time_End": 149.16,
      "Text": " doing is you're scanning the person from like toe to head. Um like so repetitiously. Um the"
    },
    {
      "Time_Start": 149.16,
      "Time_End": 154.14000000000001,
      "Text": " this was even featured on an episode of Mr. Robot. Actually 2 I think. Um and uh yeah that's"
    },
    {
      "Time_Start": 154.14000000000001,
      "Time_End": 159.14000000000001,
      "Text": " cool. Um so uh the the hacking tool my boss Fran made but the prop in the show I made. We"
    },
    {
      "Time_Start": 159.86,
      "Time_End": 165.76000000000002,
      "Text": " knew the the technical advisor for the show at the time and so uh they just needed a little"
    },
    {
      "Time_Start": 165.76000000000002,
      "Time_End": 169.4,
      "Text": " gizmo that says like no badge is detected. Like when you press the little button. It's just a"
    },
    {
      "Time_Start": 169.4,
      "Time_End": 173.84,
      "Text": " raspberry pie inside of a plastic case. But that's kind of cool. So that's what we're talking"
    },
    {
      "Time_Start": 173.84,
      "Time_End": 178.08,
      "Text": " about today. We're going to be going over uh let's let's talk a little bit about how RFID"
    },
    {
      "Time_Start": 178.08,
      "Time_End": 181.18,
      "Text": " badge reader systems work in general cause this is going to be pretty important. So on the"
    },
    {
      "Time_Start": 181.18,
      "Time_End": 185.72000000000003,
      "Text": " outside you're going to see 3 things. Uh you're going to see a door, a lock and a reader. So"
    },
    {
      "Time_Start": 185.8,
      "Time_End": 191.54,
      "Text": " the uh reader you present with a badge. So the badge is at least for passive cards is just"
    },
    {
      "Time_Start": 191.54,
      "Time_End": 195.44,
      "Text": " basically a number. It's got a number. Sometimes they're very short too. They're not like big"
    },
    {
      "Time_Start": 195.44,
      "Time_End": 199.74,
      "Text": " 128 bit numbers or whatever right? You present the badge to the reader and you're basically"
    },
    {
      "Time_Start": 199.74,
      "Time_End": 206.02,
      "Text": " just telling it this number. It says here's my badge number 1234. Now importantly the"
    },
    {
      "Time_Start": 206.02,
      "Time_End": 211.46,
      "Text": " reader does not perform authentication or authorization in this system. It's not the thing"
    },
    {
      "Time_Start": 211.46,
      "Time_End": 216.3,
      "Text": " that lets you into the door. In order to do that it has to talk to a back end controller. The"
    },
    {
      "Time_Start": 216.3,
      "Time_End": 220.48000000000002,
      "Text": " controller is the thing that actually like knows who you are and decides whether you're"
    },
    {
      "Time_Start": 220.48000000000002,
      "Time_End": 224.68,
      "Text": " allowed into this door or not. So the reader then forwards that badge number off to the"
    },
    {
      "Time_Start": 224.68,
      "Time_End": 230.86,
      "Text": " controller. The controller then says yeah sure this person's allowed into this door and sends"
    },
    {
      "Time_Start": 230.86,
      "Time_End": 235.36,
      "Text": " it a little like signal that says flash your green light that says that they're allowed in."
    },
    {
      "Time_Start": 235.36,
      "Time_End": 239.96,
      "Text": " Now importantly again the reader can't let you in. So it has to have a separate set of wires"
    },
    {
      "Time_Start": 239.96,
      "Time_End": 245.0,
      "Text": " that is not the same set of wires that like physically unlocks the door because the reader"
    },
    {
      "Time_Start": 245.0,
      "Time_End": 248.10000000000002,
      "Text": " can't control it. Because obviously if the reader controlled whether you could get in you"
    },
    {
      "Time_Start": 248.10000000000002,
      "Time_End": 251.74,
      "Text": " could just like hack the reader and let you in. It would be super easy. That is not how these"
    },
    {
      "Time_Start": 251.74,
      "Time_End": 258.84000000000003,
      "Text": " things work. Cool. Alright so let's take a look at how everything actually works um in the"
    },
    {
      "Time_Start": 258.84000000000003,
      "Time_End": 264.18,
      "Text": " back end. So currently it uses something called Wigan right? Everything's unencrypted um the"
    },
    {
      "Time_Start": 264.18,
      "Time_End": 269.90000000000003,
      "Text": " card numbers or whatever data just happens to go across the wire. What that means is we"
    },
    {
      "Time_Start": 269.9,
      "Time_End": 275.44,
      "Text": " can actually make a small device right now it's you know like an ESP key which you put into"
    },
    {
      "Time_Start": 275.44,
      "Time_End": 280.73999999999995,
      "Text": " the reader and now what happens is whenever somebody swipes a badge the ESP key can grab"
    },
    {
      "Time_Start": 280.73999999999995,
      "Time_End": 286.47999999999996,
      "Text": " the the plain text communication and then we can clone the card. Right and now we can also"
    },
    {
      "Time_Start": 286.47999999999996,
      "Time_End": 290.12,
      "Text": " replay it right? We can make our own cards we can do all sorts of things to gain access to"
    },
    {
      "Time_Start": 290.12,
      "Time_End": 295.12,
      "Text": " that facility. So that's a problem um and so now comes OSDP. So what's OSDP? Uh OSDP"
    },
    {
      "Time_Start": 296.08,
      "Time_End": 301.08,
      "Text": " stands for the Open Supervised Device Protocol and it's meant to replace Wigan. OSDP is"
    },
    {
      "Time_Start": 305.76,
      "Time_End": 309.46,
      "Text": " built as an encrypted protocol, a secure protocol. It has a couple of other benefits over"
    },
    {
      "Time_Start": 309.46,
      "Time_End": 315.0,
      "Text": " Wigan like it's uh it's over RS-485 which supports multiple readers on the same bus but"
    },
    {
      "Time_Start": 315.0,
      "Time_End": 318.54,
      "Text": " we'll get to that a little later. Mainly the big thing was that it's supposed to be"
    },
    {
      "Time_Start": 318.54,
      "Time_End": 324.44,
      "Text": " encrypted. So the same attack we just talked about won't work theoretically. So we started"
    },
    {
      "Time_Start": 324.46,
      "Time_End": 328.74,
      "Text": " reading about it right? We started looking into alright this sounds interesting what's"
    },
    {
      "Time_Start": 328.74,
      "Time_End": 333.3,
      "Text": " what's up with it and we came across some very interesting uh claims. Mainly that it was"
    },
    {
      "Time_Start": 333.3,
      "Time_End": 338.38,
      "Text": " unhackable as of 2020. So you know that piqued our interest so we were like alright let's take a"
    },
    {
      "Time_Start": 338.38,
      "Time_End": 344.52,
      "Text": " look at this. So we did a couple of things. To start off we made our own version of an ESP"
    },
    {
      "Time_Start": 344.52,
      "Time_End": 349.52,
      "Text": " key. A device we dubbed Melon um and so this device just like an ESP key plugs in between"
    },
    {
      "Time_Start": 349.68,
      "Time_End": 354.68,
      "Text": " the reader and the controller. We also got our hands. I I I David was allowed to call it"
    },
    {
      "Time_Start": 358.02,
      "Time_End": 363.02,
      "Text": " Melon as long as he said it like Gandalf at least one time. So Melon! Alright uh and so we"
    },
    {
      "Time_Start": 368.59999999999997,
      "Time_End": 374.79999999999995,
      "Text": " got the device and so we got a bunch of readers and we got an access A1001 controller. Now"
    },
    {
      "Time_Start": 374.82,
      "Time_End": 379.52000000000004,
      "Text": " everything that we have supports OSDP. So the controller which Dan has over here supports"
    },
    {
      "Time_Start": 379.52000000000004,
      "Time_End": 385.90000000000003,
      "Text": " OSDP. We got our eBay. We got some HID signal 20 readers. So what we expected to see was"
    },
    {
      "Time_Start": 385.90000000000003,
      "Time_End": 391.98,
      "Text": " basically encrypted traffic going across the wire. Let's see what we actually saw. I think"
    },
    {
      "Time_Start": 391.98,
      "Time_End": 396.98,
      "Text": " the name of the video kind of gives it away but. Uh yeah it did. Here we go. Cool. Yeah. Not"
    },
    {
      "Time_Start": 397.44,
      "Time_End": 403.44,
      "Text": " encrypted. So what's going on? It's supposed to be encrypted. Everything supports OSDP. Let's"
    },
    {
      "Time_Start": 411.28000000000003,
      "Time_End": 418.46000000000004,
      "Text": " see what happened. Well when we kept looking into it, it turns out OSDP supports but doesn't"
    },
    {
      "Time_Start": 418.46000000000004,
      "Time_End": 424.46000000000004,
      "Text": " actually require encryption. OSDP SC a secure channel extension added to OSDP is what's"
    },
    {
      "Time_Start": 427.0,
      "Time_End": 430.90000000000003,
      "Text": " takes care of the encryption. So what does that mean? It actually means that OSDP devices"
    },
    {
      "Time_Start": 430.90000000000003,
      "Time_End": 435.84000000000003,
      "Text": " that support OSDP both can choose to encrypt or not to encrypt traffic. And this is going to"
    },
    {
      "Time_Start": 435.84000000000003,
      "Time_End": 442.32,
      "Text": " come um play a role into this a little later on. Cool. So let's back up a minute and talk"
    },
    {
      "Time_Start": 442.32,
      "Time_End": 448.16,
      "Text": " about protocol and RS485 that is underneath um OSDP since this is going to be kind of"
    },
    {
      "Time_Start": 448.16,
      "Time_End": 454.46000000000004,
      "Text": " important. So RS485 is the underlying like physical layer underneath OSDP. It's serial but"
    },
    {
      "Time_Start": 454.48,
      "Time_End": 460.48,
      "Text": " it's not that serial. It's the other serial. Um in particular uh uh RS485 is multi drop. So"
    },
    {
      "Time_Start": 460.48,
      "Time_End": 464.66,
      "Text": " that means that you got a controller and a reader and you want to hook up additional readers"
    },
    {
      "Time_Start": 464.66,
      "Time_End": 468.50000000000006,
      "Text": " to this controller. You don't have to like put a separate line out to them. You can hook"
    },
    {
      "Time_Start": 468.50000000000006,
      "Time_End": 473.16,
      "Text": " them all up in like succession like this. You can all just sort of daisy chain the readers."
    },
    {
      "Time_Start": 473.16,
      "Time_End": 479.50000000000006,
      "Text": " And importantly in this scenario all messages are broadcast. So like this is a necessity"
    },
    {
      "Time_Start": 479.52,
      "Time_End": 484.22,
      "Text": " because of just like not like the laws of OSDP but just the laws of physics. Um like they're"
    },
    {
      "Time_Start": 484.22,
      "Time_End": 487.76,
      "Text": " all connected with the same copper wires and so necessarily if you're going to send a"
    },
    {
      "Time_Start": 487.76,
      "Time_End": 492.6,
      "Text": " message to like any of the devices it's going to send them uh to all of them. So if reader A"
    },
    {
      "Time_Start": 492.6,
      "Time_End": 497.84,
      "Text": " wants to send a message out to the controller um it has to necessarily also send them out to"
    },
    {
      "Time_Start": 497.84,
      "Time_End": 503.34,
      "Text": " readers B and C. So this is uh not necessarily a vulnerability. It's just like kind of a nice"
    },
    {
      "Time_Start": 503.34,
      "Time_End": 507.34,
      "Text": " to have. In fact this is really useful for um installers since you don't need to have a"
    },
    {
      "Time_Start": 507.36,
      "Time_End": 511.32000000000005,
      "Text": " separate wire out to every single reader in your entire building. You can kind of daisy"
    },
    {
      "Time_Start": 511.32000000000005,
      "Time_End": 516.12,
      "Text": " chain them around. It reduces the wiring. Makes it actually a lot nicer. Um this does have"
    },
    {
      "Time_Start": 516.12,
      "Time_End": 520.5,
      "Text": " the consequence though that if suppose we're back in our undisclosed location in Santa Fe,"
    },
    {
      "Time_Start": 520.5,
      "Time_End": 525.0,
      "Text": " New Mexico and there's like you know some guard out in front of a top secret door. Like"
    },
    {
      "Time_Start": 525.0,
      "Time_End": 528.34,
      "Text": " this is the door we really want to get into right? And there's some guy with a beard and"
    },
    {
      "Time_Start": 528.34,
      "Time_End": 533.34,
      "Text": " suspenders. Let's just call him George. That's in front of this room that like is preventing"
    },
    {
      "Time_Start": 533.34,
      "Time_End": 537.7800000000001,
      "Text": " us from getting in yelling something about Targaryens. Um there might be a second side"
    },
    {
      "Time_Start": 537.7800000000001,
      "Time_End": 542.48,
      "Text": " door that is like not especially secret. Um that like we wouldn't normally care about"
    },
    {
      "Time_Start": 542.48,
      "Time_End": 546.86,
      "Text": " getting into. But now you might actually attack this door anyway. Cause it could very well"
    },
    {
      "Time_Start": 546.86,
      "Time_End": 552.0600000000001,
      "Text": " be on the same bus as the secret door. And so if you could listen and sniff badges on this"
    },
    {
      "Time_Start": 552.0600000000001,
      "Time_End": 556.0600000000001,
      "Text": " one you might be sniffing badges to like the rest of the building. Or you know maybe just"
    },
    {
      "Time_Start": 556.0600000000001,
      "Time_End": 560.4000000000001,
      "Text": " the door that you really care about. So that's kind of a nice little um uh bonus there for"
    },
    {
      "Time_Start": 560.4,
      "Time_End": 565.3,
      "Text": " attackers. So if uh red teamers are trying to do this um just find any door and it might be"
    },
    {
      "Time_Start": 565.3,
      "Time_End": 571.3,
      "Text": " the one that you care about. Uh next is around the client server model of OSDP. This is just"
    },
    {
      "Time_Start": 571.3,
      "Time_End": 577.5799999999999,
      "Text": " kind of a practical thing um for the protocol. Which is that uh in OSDP there's uh clients"
    },
    {
      "Time_Start": 577.5799999999999,
      "Time_End": 582.52,
      "Text": " and servers. The uh controller is the client. All the readers are servers. So that means is"
    },
    {
      "Time_Start": 582.52,
      "Time_End": 589.12,
      "Text": " that uh readers if you wanted to send a message you can't just asynchronously send a message."
    },
    {
      "Time_Start": 589.14,
      "Time_End": 594.58,
      "Text": " Um it would just get ignored at least according to the spec it should. And uh in order to uh"
    },
    {
      "Time_Start": 594.58,
      "Time_End": 599.46,
      "Text": " send a message you have to reply to responses. So what this means is that uh controllers have"
    },
    {
      "Time_Start": 599.46,
      "Time_End": 604.12,
      "Text": " to constantly pull the readers. In practice this like happens like something on the order of"
    },
    {
      "Time_Start": 604.12,
      "Time_End": 608.4,
      "Text": " like a hundred hertz is pretty typical. Where you see the controller say hey you got anything"
    },
    {
      "Time_Start": 608.4,
      "Time_End": 612.74,
      "Text": " for me now? No. You got anything for me now? No. And that's how you like when you badge in"
    },
    {
      "Time_Start": 612.74,
      "Time_End": 617.74,
      "Text": " it knows about it immediately because it's like pulling constantly. So this brings us to"
    },
    {
      "Time_Start": 619.48,
      "Time_End": 624.48,
      "Text": " protocol WTF number one. Something I like to call what are we paying by the bit now? So one of the"
    },
    {
      "Time_Start": 628.52,
      "Time_End": 633.46,
      "Text": " core functions of a cryptographic protocol is to prevent against replay attacks. So even"
    },
    {
      "Time_Start": 633.46,
      "Time_End": 638.22,
      "Text": " though it's encrypted uh what keeps an attacker from just taking the encrypted packet that"
    },
    {
      "Time_Start": 638.22,
      "Time_End": 642.26,
      "Text": " has like our badge numbers when somebody badges in right? And just replaying that packet"
    },
    {
      "Time_Start": 642.26,
      "Time_End": 648.0,
      "Text": " just taking it and forwarding it off to the controller when we want to authenticate. So"
    },
    {
      "Time_Start": 648.02,
      "Time_End": 654.06,
      "Text": " normally uh normally protocols will do this by having your data um attaching a sequence"
    },
    {
      "Time_Start": 654.06,
      "Time_End": 659.56,
      "Text": " number to it. So the sequence number makes sure that every packet is fresh. It's live. So it"
    },
    {
      "Time_Start": 659.56,
      "Time_End": 663.7,
      "Text": " has to either just be monotonically increasing from the last one or it's like the number of"
    },
    {
      "Time_Start": 663.7,
      "Time_End": 668.7,
      "Text": " data TCP does this by having like the amount of data increasing the uh sequence number."
    },
    {
      "Time_Start": 668.7,
      "Time_End": 672.14,
      "Text": " There's lots of ways of doing this but basically the idea is that the receiver knows what the"
    },
    {
      "Time_Start": 672.14,
      "Time_End": 674.84,
      "Text": " sequence number should be and it's going to be different every time. Keeps you from"
    },
    {
      "Time_Start": 674.84,
      "Time_End": 679.9200000000001,
      "Text": " replaying things along with an HMAC that keeps the attacker from uh tampering with that"
    },
    {
      "Time_Start": 679.9200000000001,
      "Time_End": 683.5,
      "Text": " data. Cause obviously if the attacker could just like modify the sequence number to be the"
    },
    {
      "Time_Start": 683.5,
      "Time_End": 686.6600000000001,
      "Text": " correct one then that kind of defeats the whole purpose. So uh we don't have time to get"
    },
    {
      "Time_Start": 686.6600000000001,
      "Time_End": 691.26,
      "Text": " into like what an HMAC is. It's a keyed hash. If you're not familiar with the way they look"
    },
    {
      "Time_Start": 691.26,
      "Time_End": 697.08,
      "Text": " it up it's cool. So you might be wondering alright this sequence number uh how many bits does"
    },
    {
      "Time_Start": 697.08,
      "Time_End": 701.84,
      "Text": " that need to be? Like maybe like 128 bits like that would be cryptographically strong"
    },
    {
      "Time_Start": 701.84,
      "Time_End": 707.22,
      "Text": " right? You can't enumerate that. That'd be really good. Uh maybe 64 bits? Like that's that's"
    },
    {
      "Time_Start": 707.22,
      "Time_End": 711.32,
      "Text": " not bad. It's that's uh it's like the edge of enumeration. Like if you're trying to you"
    },
    {
      "Time_Start": 711.32,
      "Time_End": 715.1,
      "Text": " know brute force something off the line 64 bits is usually the area where you're like oh I"
    },
    {
      "Time_Start": 715.1,
      "Time_End": 721.5,
      "Text": " don't know if that's possible anymore. Um like 32 bits? Like that's fine maybe I guess."
    },
    {
      "Time_Start": 721.5,
      "Time_End": 728.5,
      "Text": " That's you know that's not great. How about 2 bits? Now I know what you're thinking. Now"
    },
    {
      "Time_Start": 728.6,
      "Time_End": 732.1,
      "Text": " I know what you're thinking. 2 bits? Those are rookie numbers. We can get that down. How"
    },
    {
      "Time_Start": 732.1,
      "Time_End": 737.1,
      "Text": " about 1 and a half bits? Cause uh OSDP actually skips 0 in their 2 bit um uh sequence number"
    },
    {
      "Time_Start": 741.02,
      "Time_End": 747.28,
      "Text": " scheme. Uh so you start with 0 but then everything going off there just goes 1 2 3 1 2 3. So"
    },
    {
      "Time_Start": 747.28,
      "Time_End": 751.82,
      "Text": " um this sequence number exists but for the purposes of security might as well not. Um in fact"
    },
    {
      "Time_Start": 751.82,
      "Time_End": 757.62,
      "Text": " I question whether it's useful even for non-security purposes. So let's talk about this"
    },
    {
      "Time_Start": 757.62,
      "Time_End": 762.62,
      "Text": " HMAC. So um OSDP has this system of IV chaining where the uh HMAC of the previous packet is"
    },
    {
      "Time_Start": 765.66,
      "Time_End": 771.4,
      "Text": " the IV of the current packet. Uh by the way we're running in a CBC mode encryption. I can"
    },
    {
      "Time_Start": 771.4,
      "Time_End": 774.96,
      "Text": " hear the collective groans of all the cryptographers in the room. Don't we don't have"
    },
    {
      "Time_Start": 774.96,
      "Time_End": 781.4,
      "Text": " time to go over it. It's in CBC mode don't question it. Um so the uh the IVs are sort of"
    },
    {
      "Time_Start": 781.4,
      "Time_End": 786.24,
      "Text": " chained down the line where uh every single HMAC is just going to be the IV of the next"
    },
    {
      "Time_Start": 786.24,
      "Time_End": 792.84,
      "Text": " packet. Um so uh this sort of has the effect of providing liveness because like the last"
    },
    {
      "Time_Start": 792.84,
      "Time_End": 797.88,
      "Text": " packet is going to kind of uh mutate your current one and so that sort of prevents replay"
    },
    {
      "Time_Start": 797.88,
      "Time_End": 802.42,
      "Text": " attacks in this kind of like uh uh uh janky sort of setup. But like in practice it sort of"
    },
    {
      "Time_Start": 802.42,
      "Time_End": 806.66,
      "Text": " kind of works. Um then we're going to have to come back to that. Um the problem with the HMAC"
    },
    {
      "Time_Start": 806.66,
      "Time_End": 813.0,
      "Text": " however is that we uh uh just take most of it and throw it in the trash. So the first 32"
    },
    {
      "Time_Start": 813.0,
      "Time_End": 818.0,
      "Text": " bits of the HMAC we keep. And then the last 96 bits we just throw away. The spec even says to"
    },
    {
      "Time_Start": 820.9,
      "Time_End": 826.44,
      "Text": " reduce the message size and transmission time overhead only the first 4 bytes are sent."
    },
    {
      "Time_Start": 826.44,
      "Time_End": 832.98,
      "Text": " Like like why would you do this? Like you can't just take like the bits and like reduce"
    },
    {
      "Time_Start": 832.98,
      "Time_End": 838.58,
      "Text": " the overhead. You know like those are important bits. Like we needed those bits. You can't"
    },
    {
      "Time_Start": 838.58,
      "Time_End": 845.58,
      "Text": " just do this. So if we do some back of the envelope math on like uh what this might look"
    },
    {
      "Time_Start": 845.58,
      "Time_End": 852.0200000000001,
      "Text": " like. So imagine you're just sending uh badging attempts with like random MACs right? Like how"
    },
    {
      "Time_Start": 852.0200000000001,
      "Time_End": 857.5600000000001,
      "Text": " long would this take us to enumerate um in practice? So that's 2 to the 31 attempts on"
    },
    {
      "Time_Start": 857.5600000000001,
      "Time_End": 864.2,
      "Text": " average. Uh uh let's assume that we're running at like 115200 baud which is around the top"
    },
    {
      "Time_Start": 864.22,
      "Time_End": 870.0600000000001,
      "Text": " end of what you can see I think in practice. Um technically RS-485 can run at 10 megabits. In"
    },
    {
      "Time_Start": 870.0600000000001,
      "Time_End": 875.5600000000001,
      "Text": " which case uh if you found some installation that's running that fast then like fuck. Uh but"
    },
    {
      "Time_Start": 875.5600000000001,
      "Time_End": 882.1400000000001,
      "Text": " the um uh this would be a success after like 35 days. Um which like is dangerous and sort of"
    },
    {
      "Time_Start": 882.1400000000001,
      "Time_End": 887.22,
      "Text": " scary like if you're a defender but I think as a red teamer we're unlikely to uh really exploit"
    },
    {
      "Time_Start": 887.22,
      "Time_End": 891.82,
      "Text": " this. Um I can imagine like sending David on a pen test we're like okay so we're going to give"
    },
    {
      "Time_Start": 891.84,
      "Time_End": 897.08,
      "Text": " you a sleeping bag and you're going to just like hang out in front of the door for 35 days on"
    },
    {
      "Time_Start": 897.08,
      "Time_End": 902.62,
      "Text": " average and uh at some point during that time you might be asleep. The door's going to beep"
    },
    {
      "Time_Start": 902.62,
      "Time_End": 908.0200000000001,
      "Text": " and you got to make a mad dash to it. Cause it's going to be open for like 3 seconds. Um uh we"
    },
    {
      "Time_Start": 908.0200000000001,
      "Time_End": 913.2600000000001,
      "Text": " have uh we have budgets and I don't think that's going to be within ours. Um so uh I think"
    },
    {
      "Time_Start": 913.2600000000001,
      "Time_End": 918.6,
      "Text": " in practice this is likely not a thing that uh you're going to see a ton of. Um unless the"
    },
    {
      "Time_Start": 918.62,
      "Time_End": 923.02,
      "Text": " speed changes like if you're running this over a different underlying protocol for some"
    },
    {
      "Time_Start": 923.02,
      "Time_End": 928.4,
      "Text": " reason that um runs at like 10 megabits or like if for some reason your RS-45 installation"
    },
    {
      "Time_Start": 928.4,
      "Time_End": 933.4,
      "Text": " really is that fast. Um then uh this could start getting really scary. Um uh next is uh there's"
    },
    {
      "Time_Start": 936.2,
      "Time_End": 941.5,
      "Text": " a birthday attack in this. Uh some of you might have already noticed. So um if if you just"
    },
    {
      "Time_Start": 941.5,
      "Time_End": 948.32,
      "Text": " ask the question like what are the chances that any of these IVs are the same right? Uh on"
    },
    {
      "Time_Start": 948.36,
      "Time_End": 953.7,
      "Text": " average with only a 32 bit Mac you're going to get it at about 77,000 packets on average. And"
    },
    {
      "Time_Start": 953.7,
      "Time_End": 958.1,
      "Text": " what that means is that if the data is always the same like if we're in this um uh like"
    },
    {
      "Time_Start": 958.1,
      "Time_End": 963.1800000000001,
      "Text": " polling hack loop, the data is always going to be the same. So our our data is just going to"
    },
    {
      "Time_Start": 963.1800000000001,
      "Time_End": 968.72,
      "Text": " loop back around. Um so like you can actually observe uh this happening in practice too."
    },
    {
      "Time_Start": 968.72,
      "Time_End": 973.36,
      "Text": " Which is just like bizarre and not a good look for a cryptographic protocol. This isn't a"
    },
    {
      "Time_Start": 973.36,
      "Time_End": 977.7,
      "Text": " vulnerability as far as I can tell. Cause anytime somebody does anything like if you badge"
    },
    {
      "Time_Start": 977.7,
      "Time_End": 982.6400000000001,
      "Text": " in it'll perturb the loop and escape you out of the loop and get you into a new loop. Um but"
    },
    {
      "Time_Start": 982.6400000000001,
      "Time_End": 986.0200000000001,
      "Text": " just like this is not a thing that a reasonable protocol should be doing. Where you're just"
    },
    {
      "Time_Start": 986.0200000000001,
      "Time_End": 991.1800000000001,
      "Text": " like actually sending the same exact bits looping back around and reusing IVs is like a"
    },
    {
      "Time_Start": 991.1800000000001,
      "Time_End": 996.1600000000001,
      "Text": " thing that has gotten other protocols into a lot of hot water. Um so like we should just not"
    },
    {
      "Time_Start": 996.1600000000001,
      "Time_End": 1001.1600000000001,
      "Text": " be doing this. Um oh and then uh lastly around this is uh the uh key ex- not key exchange,"
    },
    {
      "Time_Start": 1001.4599999999999,
      "Time_End": 1008.0,
      "Text": " um a key derivation for session keys. So we'll get a bit more into like a key hierarchy that"
    },
    {
      "Time_Start": 1008.0,
      "Time_End": 1014.1,
      "Text": " OSDB defines. But the uh session keys, the thing that's like actually used to encrypt data"
    },
    {
      "Time_Start": 1014.1,
      "Time_End": 1020.18,
      "Text": " um only uses 48 bits of entropy from the uh backend server. So uh session keys are derived by"
    },
    {
      "Time_Start": 1020.18,
      "Time_End": 1026.8799999999999,
      "Text": " having the controller send the reader a nonce. The uh controller then uh derives a session"
    },
    {
      "Time_Start": 1026.9,
      "Time_End": 1033.0800000000002,
      "Text": " key by taking 48 bits of that nonce for reasons unknown. Um and then encrypting that with the"
    },
    {
      "Time_Start": 1033.0800000000002,
      "Time_End": 1039.38,
      "Text": " base key, the higher level key. Um and that becomes the session key basically. And maybe"
    },
    {
      "Time_Start": 1039.38,
      "Time_End": 1043.1200000000001,
      "Text": " somebody in the audience is cleverer than us and can figure out a way to actually brute"
    },
    {
      "Time_Start": 1043.1200000000001,
      "Time_End": 1048.16,
      "Text": " force this offline cause if it were 48 bits you could. Um but because it's encrypted by the"
    },
    {
      "Time_Start": 1048.16,
      "Time_End": 1052.3600000000001,
      "Text": " base key which the attacker in this scenario presumably does not know. Um I don't, I"
    },
    {
      "Time_Start": 1052.38,
      "Time_End": 1057.38,
      "Text": " couldn't figure out a good way to enumerate this offline. So. Cool. Alright so let's"
    },
    {
      "Time_Start": 1061.5200000000002,
      "Time_End": 1066.8600000000001,
      "Text": " actually attack this thing. Alright we have some background, we know that OSDB supports uh"
    },
    {
      "Time_Start": 1066.8600000000001,
      "Time_End": 1073.8600000000001,
      "Text": " both encrypted and unencrypted connections. So we can do something called a replay attack."
    },
    {
      "Time_Start": 1073.8600000000001,
      "Time_End": 1078.8600000000001,
      "Text": " Or sorry a downgrade attack. Alright so uh let's uh let's uh let's go ahead and"
    },
    {
      "Time_Start": 1082.5800000000002,
      "Time_End": 1088.7800000000002,
      "Text": " pause it here. Explain what's going on. So on the right hand side we have our controller. So we"
    },
    {
      "Time_Start": 1088.7800000000002,
      "Time_End": 1094.6200000000001,
      "Text": " can see that um what it's seeing and we can see on the left hand side um the the"
    },
    {
      "Time_Start": 1094.6200000000001,
      "Time_End": 1100.3600000000001,
      "Text": " communication going between the controller and the reader. So there's a secure channel"
    },
    {
      "Time_Start": 1100.3600000000001,
      "Time_End": 1104.7600000000002,
      "Text": " setup. We can't see anything right? Everything's secure. We're going to swipe in. And"
    },
    {
      "Time_Start": 1104.7600000000002,
      "Time_End": 1110.2400000000002,
      "Text": " there's absolutely nothing that we can see. Okay but let's remember that again it supports"
    },
    {
      "Time_Start": 1110.28,
      "Time_End": 1116.56,
      "Text": " both right? So there's sure a way we can mess around with this. So we do it again. This"
    },
    {
      "Time_Start": 1116.56,
      "Time_End": 1122.86,
      "Text": " time we try to carry out a downgrade attack. We try to downgrade. And then we swipe in"
    },
    {
      "Time_Start": 1122.86,
      "Time_End": 1127.86,
      "Text": " again. And we can actually see the card data. Cool. Alright so let's see what we actually"
    },
    {
      "Time_Start": 1131.3,
      "Time_End": 1138.24,
      "Text": " did there to make that happen. To decide if it can establish encryption or not. There's a"
    },
    {
      "Time_Start": 1138.24,
      "Time_End": 1141.78,
      "Text": " couple of things that happen first. So the controller first asks the reader what it's"
    },
    {
      "Time_Start": 1141.78,
      "Time_End": 1147.28,
      "Text": " capabilities are. And the reader replies it's capabilities. The capabilities can be a"
    },
    {
      "Time_Start": 1147.28,
      "Time_End": 1151.92,
      "Text": " number of very interesting things to us. So it can say maybe we're talking to a fingerprint"
    },
    {
      "Time_Start": 1151.92,
      "Time_End": 1156.36,
      "Text": " reader right? Or an iris scanner. It supports biometrics. Maybe we're talking to a keypad as a"
    },
    {
      "Time_Start": 1156.36,
      "Time_End": 1162.3,
      "Text": " keypad entry. So the capabilities are keypad. The one we're interested in here is"
    },
    {
      "Time_Start": 1162.3,
      "Time_End": 1166.64,
      "Text": " communication security. So the communication security bit actually tells the controller"
    },
    {
      "Time_Start": 1166.64,
      "Time_End": 1172.98,
      "Text": " whether or not the reader supports encryption. So let's insert our device in the middle"
    },
    {
      "Time_Start": 1172.98,
      "Time_End": 1179.7800000000002,
      "Text": " here. And let's wait for that capabilities request. And now when we actually reply we're"
    },
    {
      "Time_Start": 1179.7800000000002,
      "Time_End": 1185.1200000000001,
      "Text": " going to switch that communication security bit from a 1 to a 0. And so the controller assumes"
    },
    {
      "Time_Start": 1185.1200000000001,
      "Time_End": 1189.22,
      "Text": " that there's no encryption set up. It doesn't support encryption and we can carry on with"
    },
    {
      "Time_Start": 1189.22,
      "Time_End": 1194.24,
      "Text": " everything unencrypted. Alright that brings us to protocol WTF number 2. So this is the"
    },
    {
      "Time_Start": 1196.8600000000001,
      "Time_End": 1202.94,
      "Text": " stop making null ciphers. So Dan explained a little bit about how what happens when a"
    },
    {
      "Time_Start": 1202.94,
      "Time_End": 1207.18,
      "Text": " secure channel is set up. There's basically a 4 step process in which the controller and the"
    },
    {
      "Time_Start": 1207.18,
      "Time_End": 1211.18,
      "Text": " reader mutually authenticate to each other to make sure that they each have the same"
    },
    {
      "Time_Start": 1211.18,
      "Time_End": 1217.46,
      "Text": " encryption key. Now as a result of this when everything works out there's 4 message types"
    },
    {
      "Time_Start": 1217.46,
      "Time_End": 1223.96,
      "Text": " that can be sent. SCS 15 and 17 which are command from the controller to the reader or"
    },
    {
      "Time_Start": 1223.96,
      "Time_End": 1229.96,
      "Text": " replies 16 and 18 which are you know replies from the reader to the controller. If you read"
    },
    {
      "Time_Start": 1231.96,
      "Time_End": 1239.1000000000001,
      "Text": " the spec, SCS 15 and 16 say that even though there's a MAC applied the data is still"
    },
    {
      "Time_Start": 1239.1000000000001,
      "Time_End": 1246.04,
      "Text": " unencrypted. Which is wild right? We're supposed to be having a secure channel set up with"
    },
    {
      "Time_Start": 1246.04,
      "Time_End": 1251.18,
      "Text": " encryption but yet the data fields are unencrypted. So that means that in a fully secured"
    },
    {
      "Time_Start": 1251.2,
      "Time_End": 1254.48,
      "Text": " session there is a possibility that the data is just going to go over the wire. Now it has a"
    },
    {
      "Time_Start": 1254.48,
      "Time_End": 1259.78,
      "Text": " MAC applied to it so we can't just replay it. But you know we can still just in the case of"
    },
    {
      "Time_Start": 1259.78,
      "Time_End": 1265.78,
      "Text": " car data watch it, clone it and just authenticate to the readers. Now to be fair the spec does"
    },
    {
      "Time_Start": 1267.66,
      "Time_End": 1273.26,
      "Text": " say that those message types are not meant to be used with any sort of data but then why"
    },
    {
      "Time_Start": 1273.26,
      "Time_End": 1278.76,
      "Text": " have them in the first place right? Alright this moves us to the next step which is the"
    },
    {
      "Time_Start": 1281.3600000000001,
      "Time_End": 1287.38,
      "Text": " demo number 3. Something we like to call the install mode attack. Ominous sounding. It's"
    },
    {
      "Time_Start": 1287.38,
      "Time_End": 1293.38,
      "Text": " going to already play. So what you're going to see here on the right is the controller"
    },
    {
      "Time_Start": 1296.1200000000001,
      "Time_End": 1300.5800000000002,
      "Text": " that's going to be running in a terminal. This is an intentionally vulnerable controller"
    },
    {
      "Time_Start": 1300.5800000000002,
      "Time_End": 1305.52,
      "Text": " software that we wrote. That's basically just the lib OSDP sample code basically actually."
    },
    {
      "Time_Start": 1305.52,
      "Time_End": 1309.7,
      "Text": " And on the left is an attack script that we're writing. We're going to be performing"
    },
    {
      "Time_Start": 1309.72,
      "Time_End": 1314.22,
      "Text": " something we call the install mode attack. So we're going to run this with just a dash dash"
    },
    {
      "Time_Start": 1314.22,
      "Time_End": 1320.3600000000001,
      "Text": " install flag. Run up our server. And this time we don't just capture a badge number we"
    },
    {
      "Time_Start": 1320.3600000000001,
      "Time_End": 1326.1000000000001,
      "Text": " actually steal the encryption key right out from underneath the server. So how the heck does"
    },
    {
      "Time_Start": 1326.1000000000001,
      "Time_End": 1332.1000000000001,
      "Text": " that work? Let's talk about it. So OSDP has something a bit like the SSH security model which"
    },
    {
      "Time_Start": 1332.92,
      "Time_End": 1337.92,
      "Text": " is like a one time insecure setup. This is not by itself in a vacuum a bad thing. We don't"
    },
    {
      "Time_Start": 1341.3000000000002,
      "Time_End": 1346.88,
      "Text": " care about SSH we don't mind SSH security model so much. The problem is that this has to"
    },
    {
      "Time_Start": 1346.88,
      "Time_End": 1352.46,
      "Text": " actually be a one time insecure setup. Like if somebody told you they found a way of hacking"
    },
    {
      "Time_Start": 1352.46,
      "Time_End": 1355.7600000000002,
      "Text": " SSH and you just all you have to do is man the middle of the initial connection and be like"
    },
    {
      "Time_Start": 1355.7600000000002,
      "Time_End": 1360.72,
      "Text": " yeah like that's kind of built into the model of like that's not clever or anything. The"
    },
    {
      "Time_Start": 1360.72,
      "Time_End": 1366.38,
      "Text": " problem is when this turns out to not be so one time. So controllers and readers in OSDP"
    },
    {
      "Time_Start": 1366.38,
      "Time_End": 1373.72,
      "Text": " have this kind of quasi-official install mode that is specified in the spec but its exact"
    },
    {
      "Time_Start": 1373.72,
      "Time_End": 1378.06,
      "Text": " semantics aren't exactly laid out like when you're supposed to do things and how are you"
    },
    {
      "Time_Start": 1378.06,
      "Time_End": 1383.3,
      "Text": " supposed to behave. A lot of that is just sort of left up to the individual implementers. And"
    },
    {
      "Time_Start": 1383.3,
      "Time_End": 1389.92,
      "Text": " so in this install mode as the name suggests the uh this is not the exact packets um the uh"
    },
    {
      "Time_Start": 1389.92,
      "Time_End": 1393.46,
      "Text": " but the the reader is able to ask it like hey what's the encryption key cause I'm just"
    },
    {
      "Time_Start": 1393.46,
      "Time_End": 1397.16,
      "Text": " trying to get set up here. And the reader the controller just goes here you go here's the"
    },
    {
      "Time_Start": 1397.16,
      "Time_End": 1402.16,
      "Text": " key. Um cause uh like that's what the install mode is supposed to do. The problem happens when"
    },
    {
      "Time_Start": 1404.66,
      "Time_End": 1410.7,
      "Text": " this install mode persists. If it happens to last more than just this like short ephemeral"
    },
    {
      "Time_Start": 1410.7,
      "Time_End": 1416.5,
      "Text": " moment when you're initially installing a reader. So if you happen to have a controller that"
    },
    {
      "Time_Start": 1416.52,
      "Time_End": 1421.3,
      "Text": " is just like hanging out in install mode persistently then an attacker can just show up on"
    },
    {
      "Time_Start": 1421.3,
      "Time_End": 1426.9,
      "Text": " the bus, ask the controller hey what's the encryption key? I'm a reader. And it'll just"
    },
    {
      "Time_Start": 1426.9,
      "Time_End": 1434.4,
      "Text": " respond to you and say here's the key. And uh the keys in in this case are uh unique per uh"
    },
    {
      "Time_Start": 1434.4,
      "Time_End": 1440.78,
      "Text": " reader controller pair. Um but uh that ID is just a public ID. In fact it's usually written"
    },
    {
      "Time_Start": 1440.78,
      "Time_End": 1446.18,
      "Text": " on the back of the reader itself. So like you could just lie about your uh ID and get the key"
    },
    {
      "Time_Start": 1446.2,
      "Time_End": 1451.2,
      "Text": " for any uh reader on the billing. So uh this brings us to this point of like where exactly do"
    },
    {
      "Time_Start": 1454.14,
      "Time_End": 1458.5800000000002,
      "Text": " these vulnerabilities lie? So uh we've been kind of picking on the protocol and I think"
    },
    {
      "Time_Start": 1458.5800000000002,
      "Time_End": 1463.5800000000002,
      "Text": " there's a fair number of things to pick about the protocol. Um but uh like there's lots of"
    },
    {
      "Time_Start": 1463.5800000000002,
      "Time_End": 1467.3600000000001,
      "Text": " other places depending on how you want to kind of squint and look at it that the"
    },
    {
      "Time_Start": 1467.3600000000001,
      "Time_End": 1472.3,
      "Text": " vulnerabilities could exist on. So you could think of this as a library bug some of these"
    },
    {
      "Time_Start": 1472.32,
      "Time_End": 1476.4199999999998,
      "Text": " like whatever the library does is probably what's going to be out there in practice right?"
    },
    {
      "Time_Start": 1476.4199999999998,
      "Time_End": 1481.6599999999999,
      "Text": " Like who is going to go out and roll their own library just for this? Um so like you could"
    },
    {
      "Time_Start": 1481.6599999999999,
      "Time_End": 1486.76,
      "Text": " argue that like the behavior of the popular libraries is the thing that needs to change"
    },
    {
      "Time_Start": 1486.76,
      "Time_End": 1489.8999999999999,
      "Text": " here. That's where the fault really lies. You could argue that this is a configuration"
    },
    {
      "Time_Start": 1489.8999999999999,
      "Time_End": 1495.0,
      "Text": " problem. A lot of these uh vulnerabilities can be fixed in configurations. Like you should"
    },
    {
      "Time_Start": 1495.0,
      "Time_End": 1501.44,
      "Text": " configure your controllers to not sit around persistently in install mode. Um and maybe"
    },
    {
      "Time_Start": 1501.48,
      "Time_End": 1506.26,
      "Text": " that's not crazy. You could argue that it's a documentation problem. That like like the"
    },
    {
      "Time_Start": 1506.26,
      "Time_End": 1510.8600000000001,
      "Text": " exact behaviors of how these things are supposed to work is like maybe not documented well"
    },
    {
      "Time_Start": 1510.8600000000001,
      "Time_End": 1514.7,
      "Text": " or maybe it is but nobody knows where that's at and so like maybe better documentation"
    },
    {
      "Time_Start": 1514.7,
      "Time_End": 1518.16,
      "Text": " could get out of uh us out of this problem. You could argue that this is an implementation"
    },
    {
      "Time_Start": 1518.16,
      "Time_End": 1524.2,
      "Text": " bug. That the individual uh like implementers of the controller hardware are responsible"
    },
    {
      "Time_Start": 1524.2,
      "Time_End": 1528.1000000000001,
      "Text": " for setting these things up properly and what admin is going to go out and tinker with the"
    },
    {
      "Time_Start": 1528.1000000000001,
      "Time_End": 1532.5400000000002,
      "Text": " settings at a fine grained level. Like whatever is out there in implementation is probably"
    },
    {
      "Time_Start": 1532.5400000000002,
      "Time_End": 1536.5400000000002,
      "Text": " what's going to be out there in practice. You could also argue that this is a marketing"
    },
    {
      "Time_Start": 1536.5400000000002,
      "Time_End": 1542.9800000000002,
      "Text": " problem. That uh a lot of devices uh such as our um access A1001 just say that they support"
    },
    {
      "Time_Start": 1542.9800000000002,
      "Time_End": 1548.9,
      "Text": " OSDP but uh that's not like a legally defensible like term. Uh whereas there's actually a"
    },
    {
      "Time_Start": 1548.9,
      "Time_End": 1554.4,
      "Text": " uh an OSDP verified uh like uh program. Where you can put your hardware into the people"
    },
    {
      "Time_Start": 1554.4,
      "Time_End": 1559.7800000000002,
      "Text": " that make the specification and they can like certify it as not like secure in some"
    },
    {
      "Time_Start": 1559.7800000000002,
      "Time_End": 1563.92,
      "Text": " abstract sense but at least that it like does the protocol and does all of the protocol"
    },
    {
      "Time_Start": 1563.92,
      "Time_End": 1570.38,
      "Text": " like the encryption parts. Um where like you might just uh have uh an entire OSDP set up"
    },
    {
      "Time_Start": 1570.38,
      "Time_End": 1576.0,
      "Text": " at uh at home. Probably not at home. At your office. And uh think like I'm all secure. Like"
    },
    {
      "Time_Start": 1576.0,
      "Time_End": 1579.9,
      "Text": " I bought all this stuff. I spent a whole bunch of money upgrading it and you could very"
    },
    {
      "Time_Start": 1579.9,
      "Time_End": 1583.24,
      "Text": " well go back to your office and discover that none of it's encrypted. It's all just plain"
    },
    {
      "Time_Start": 1583.24,
      "Time_End": 1588.38,
      "Text": " context. And uh that's not great. And that's also partly a marketing problem. So it's pretty"
    },
    {
      "Time_Start": 1588.38,
      "Time_End": 1593.58,
      "Text": " easy to see how these vulnerabilities could just pass by people. Cause no matter who you"
    },
    {
      "Time_Start": 1593.58,
      "Time_End": 1597.6200000000001,
      "Text": " are in this setup there's always somebody else you could possibly blame and think like well"
    },
    {
      "Time_Start": 1597.6200000000001,
      "Time_End": 1600.6200000000001,
      "Text": " it's not really my problem. It's whoever's going to configure this stupid thing."
    },
    {
      "Time_Start": 1605.26,
      "Time_End": 1610.06,
      "Text": " Okay let's step it up a bit. Let's look at what happens in uh when everything's set up"
    },
    {
      "Time_Start": 1610.06,
      "Time_End": 1616.72,
      "Text": " properly right. And how the secure channel is supposed uh to work. So this is protocol"
    },
    {
      "Time_Start": 1616.72,
      "Time_End": 1621.74,
      "Text": " what the fuck number three. Uh oops. Okay so this is what we expected of message 17 and 18. We"
    },
    {
      "Time_Start": 1626.04,
      "Time_End": 1631.58,
      "Text": " expected to see the header in plain text and then the command bytes and the data encrypted."
    },
    {
      "Time_Start": 1631.58,
      "Time_End": 1637.9199999999998,
      "Text": " But this is what we actually see. So the only thing that's encrypted in a fully secure uh"
    },
    {
      "Time_Start": 1637.98,
      "Time_End": 1644.1200000000001,
      "Text": " channel setup is the data. Now why does it matter? Why is the command byte important? Well"
    },
    {
      "Time_Start": 1644.1200000000001,
      "Time_End": 1649.38,
      "Text": " the command byte is what tells us what the message type is. It tells us what the command was,"
    },
    {
      "Time_Start": 1649.38,
      "Time_End": 1655.2,
      "Text": " what the reply is. So we know what kind of data is in that packet. Some of the interesting"
    },
    {
      "Time_Start": 1655.2,
      "Time_End": 1661.14,
      "Text": " ones we're in uh we want to look at are the OSDP raw. Alright this one contains raw card"
    },
    {
      "Time_Start": 1661.14,
      "Time_End": 1665.0,
      "Text": " data. So we see that going over the wire we might want to look at that packet a little more."
    },
    {
      "Time_Start": 1665.02,
      "Time_End": 1671.76,
      "Text": " There's the FMT packet which has formatted card data. The keypad, self explanatory. The"
    },
    {
      "Time_Start": 1671.76,
      "Time_End": 1676.0,
      "Text": " bio reader, I keep going back to bio uh the bio reader ones cause they're just very"
    },
    {
      "Time_Start": 1676.0,
      "Time_End": 1680.0,
      "Text": " interesting to me. I haven't had a chance to poke at them but hoping that's uh next step"
    },
    {
      "Time_Start": 1680.0,
      "Time_End": 1685.88,
      "Text": " here. Okay and then there's the OSDP key set message. So the key set message is the"
    },
    {
      "Time_Start": 1685.88,
      "Time_End": 1690.68,
      "Text": " command from the controller to the reader where the session base key is delivered. And"
    },
    {
      "Time_Start": 1690.7,
      "Time_End": 1695.04,
      "Text": " basically the then the uh encryption key for every message is derived from the session"
    },
    {
      "Time_Start": 1695.04,
      "Time_End": 1700.74,
      "Text": " base key. So we can get our hands on that base key, we can compromise the communications."
    },
    {
      "Time_Start": 1700.74,
      "Time_End": 1705.74,
      "Text": " Which brings us to the next demo. The wikis attack. Cool. So once again we have the controller"
    },
    {
      "Time_Start": 1714.26,
      "Time_End": 1720.66,
      "Text": " uh and our attack script here. And we're testing for wikis and we just found a wiki. Um so"
    },
    {
      "Time_Start": 1721.28,
      "Time_End": 1726.64,
      "Text": " we find the wiki, we can decrypt the the packets now and we can intercept that key set"
    },
    {
      "Time_Start": 1726.64,
      "Time_End": 1733.0800000000002,
      "Text": " message. Cool. So what happened? First off before I dive in, this is not a protocol specific"
    },
    {
      "Time_Start": 1733.0800000000002,
      "Time_End": 1736.6200000000001,
      "Text": " issue. This is something of an implementation issue that we've observed with a lot of"
    },
    {
      "Time_Start": 1736.6200000000001,
      "Time_End": 1742.0600000000002,
      "Text": " open source libraries. Um so again, doesn't have to do with OSDP but the people uh"
    },
    {
      "Time_Start": 1742.0600000000002,
      "Time_End": 1747.0600000000002,
      "Text": " writing um I guess the code for for it. Okay so there's uh there's a hierarchy of keys here."
    },
    {
      "Time_Start": 1750.74,
      "Time_End": 1753.9,
      "Text": " There's the master key which lives on the controller. The master key never leaves the"
    },
    {
      "Time_Start": 1753.9,
      "Time_End": 1757.9,
      "Text": " controller but it is used to derive the session base key which is the one we just spoke"
    },
    {
      "Time_Start": 1757.9,
      "Time_End": 1763.44,
      "Text": " about. And then there's the encryption key for all the actual messages which is derived"
    },
    {
      "Time_Start": 1763.44,
      "Time_End": 1769.02,
      "Text": " from the base key. Now in the newer implementations of OSDP the spec actually takes out the"
    },
    {
      "Time_Start": 1769.02,
      "Time_End": 1775.66,
      "Text": " master key and it recommends eliminating it and instead somehow uh generating and"
    },
    {
      "Time_Start": 1775.66,
      "Time_End": 1779.76,
      "Text": " delivering the session base key. Now it doesn't say how to do that. So we've seen things"
    },
    {
      "Time_Start": 1779.76,
      "Time_End": 1784.76,
      "Text": " like this. We've actually seen hard coded simple keys for the SCBK. And again this isn't"
    },
    {
      "Time_Start": 1787.1,
      "Time_End": 1792.08,
      "Text": " just one library. We've seen a number of these. So what does that mean from our attacker"
    },
    {
      "Time_Start": 1792.08,
      "Time_End": 1796.34,
      "Text": " perspective? Now we're not going to say we're going to brute force on the whole 128 bit"
    },
    {
      "Time_Start": 1796.34,
      "Time_End": 1802.76,
      "Text": " space. Um that'd be silly. But what we can do is try say about a thousand weak keys right?"
    },
    {
      "Time_Start": 1802.76,
      "Time_End": 1807.76,
      "Text": " We can try repeating characters. We can try increasing and decreasing characters and so on."
    },
    {
      "Time_Start": 1807.76,
      "Time_End": 1811.36,
      "Text": " If we manage to actually find a reader that's using these hard coded keys then we can"
    },
    {
      "Time_Start": 1811.36,
      "Time_End": 1818.36,
      "Text": " recover the encryption key and compromise that session. Alright this brings us to protocol"
    },
    {
      "Time_Start": 1818.36,
      "Time_End": 1824.2,
      "Text": " WTF number four. Encryption is not magic fairy dust which uh was also the uh very nearly"
    },
    {
      "Time_Start": 1824.2,
      "Time_End": 1829.72,
      "Text": " the title of this entire topic. Uh the another possible alternate title was just because"
    },
    {
      "Time_Start": 1829.72,
      "Time_End": 1836.26,
      "Text": " you did it on purpose doesn't mean it's not a vulnerability. Um so let's go back to this"
    },
    {
      "Time_Start": 1836.26,
      "Time_End": 1841.02,
      "Text": " uh some bold marketing claims about things being unhackable. Um while we can all get a good"
    },
    {
      "Time_Start": 1841.02,
      "Time_End": 1844.86,
      "Text": " laugh out of this. Um one thing that it said was true which is that it does in fact use"
    },
    {
      "Time_Start": 1844.86,
      "Time_End": 1850.76,
      "Text": " 128 bit AES encryption. That is in fact true. So good on them. Um the problem however is"
    },
    {
      "Time_Start": 1850.76,
      "Time_End": 1856.48,
      "Text": " that we only use AES. As in there's no asymmetric cryptography at all in the spec"
    },
    {
      "Time_Start": 1856.48,
      "Time_End": 1862.18,
      "Text": " whatsoever. So naturally you cryptographers amongst you are wondering so how do we do key"
    },
    {
      "Time_Start": 1862.2,
      "Time_End": 1867.24,
      "Text": " exchange exactly then right? So if there's no cryptography and then like how how do how do"
    },
    {
      "Time_Start": 1867.24,
      "Time_End": 1872.28,
      "Text": " the reader and the controller exchange keys? Ah dear listener this is made easier than you"
    },
    {
      "Time_Start": 1872.28,
      "Time_End": 1879.3600000000001,
      "Text": " think. You just send the key. Um no okay okay okay we can't just send the key unencrypted"
    },
    {
      "Time_Start": 1879.3600000000001,
      "Time_End": 1886.46,
      "Text": " right? That would be insecure so we encrypt the key. But cryptographers amongst you are"
    },
    {
      "Time_Start": 1886.46,
      "Time_End": 1891.26,
      "Text": " scratching their heads right now. With what do we encrypt the key if we are trying to send"
    },
    {
      "Time_Start": 1891.28,
      "Time_End": 1898.02,
      "Text": " the key? Ah that's a good question. We use the SCBKD which is the secure channel base key"
    },
    {
      "Time_Start": 1898.02,
      "Time_End": 1903.02,
      "Text": " default. Default meaning that's it. That's the key. It's just the ASCII number 0 to F um in"
    },
    {
      "Time_Start": 1906.16,
      "Time_End": 1912.8,
      "Text": " hex. Like this is not how encryption works. Like you can't just like sprinkle some like"
    },
    {
      "Time_Start": 1912.8,
      "Time_End": 1918.54,
      "Text": " crypto on something and say like we encrypted it boss. Like like like there's no point in"
    },
    {
      "Time_Start": 1918.56,
      "Time_End": 1923.96,
      "Text": " this whatsoever. It's just like a really fancy encoding mechanism that only serves to give"
    },
    {
      "Time_Start": 1923.96,
      "Time_End": 1927.8999999999999,
      "Text": " you a false sense of security and thinking like I don't know the thing says it's encrypted"
    },
    {
      "Time_Start": 1927.8999999999999,
      "Time_End": 1935.3999999999999,
      "Text": " right now and I can't read it so I guess it's good right? Like this is not the air bud rules"
    },
    {
      "Time_Start": 1935.3999999999999,
      "Time_End": 1939.24,
      "Text": " of cryptography where like you can't just like there ain't nothing in the rules that says"
    },
    {
      "Time_Start": 1939.24,
      "Time_End": 1944.74,
      "Text": " the default key can't be an encryption key. Cool. Okay so this brings us to our final"
    },
    {
      "Time_Start": 1948.62,
      "Time_End": 1954.62,
      "Text": " demo and actually my favorite one because um just what it actually means. Cool so again we're"
    },
    {
      "Time_Start": 1962.06,
      "Time_End": 1967.06,
      "Text": " tacking the controller and we managed to capture the encryption key. So how do we capture the"
    },
    {
      "Time_Start": 1969.6399999999999,
      "Time_End": 1975.28,
      "Text": " encryption key? Up to this point a lot of what we've discussed can be attributed to"
    },
    {
      "Time_Start": 1975.28,
      "Time_End": 1981.22,
      "Text": " misconfigurations right? Not so much like other than the WTFs a lot of it is the reader"
    },
    {
      "Time_Start": 1981.22,
      "Time_End": 1986.86,
      "Text": " being left in install mode or supporting both secure channel and unencrypted traffic. Um so"
    },
    {
      "Time_Start": 1986.86,
      "Time_End": 1991.54,
      "Text": " what happens if best practices are followed? Well first of all I think a lot of us know that"
    },
    {
      "Time_Start": 1991.54,
      "Time_End": 1996.28,
      "Text": " best practices usually aren't followed. But let's let let me walk you through a scenario of"
    },
    {
      "Time_Start": 1996.28,
      "Time_End": 2002.98,
      "Text": " how we would attack a completely secure setup. Number 1 we insert our listening device."
    },
    {
      "Time_Start": 2002.98,
      "Time_End": 2008.68,
      "Text": " Number 2 we need to break a reader. Number 3 we need to wait for IT to replace that"
    },
    {
      "Time_Start": 2008.68,
      "Time_End": 2013.96,
      "Text": " reader. And number 4 we capture the keyset command. So this is how it would actually work."
    },
    {
      "Time_Start": 2013.96,
      "Time_End": 2018.5,
      "Text": " So let's say we show up on a site where we want to break in right? We have the top secret"
    },
    {
      "Time_Start": 2018.5,
      "Time_End": 2022.56,
      "Text": " door we want to gain access to and we have maybe a side door that's not so well guarded."
    },
    {
      "Time_Start": 2022.56,
      "Time_End": 2026.94,
      "Text": " Everything is set up correctly there's no possibility for downgrade attack. Everything's"
    },
    {
      "Time_Start": 2026.94,
      "Time_End": 2033.5800000000002,
      "Text": " encrypted with a session base key. Well we're still going to go and insert our uh listening"
    },
    {
      "Time_Start": 2033.5800000000002,
      "Time_End": 2039.48,
      "Text": " device behind the not so very secret door. Again let's remember that OSDP on RS485 supports"
    },
    {
      "Time_Start": 2039.48,
      "Time_End": 2044.48,
      "Text": " multiple readers so that's that's kind of uh uh that's what's going to make the attack"
    },
    {
      "Time_Start": 2044.48,
      "Time_End": 2049.2200000000003,
      "Text": " practical. Practical for us. I'm going to go ahead and insert it on that same bus somewhere"
    },
    {
      "Time_Start": 2049.2200000000003,
      "Time_End": 2054.6,
      "Text": " where that's not well guarded. Now we need to break the reader we're interested in. How we"
    },
    {
      "Time_Start": 2054.62,
      "Time_End": 2060.06,
      "Text": " do that it's up to you. So uh you can either use an NFC app on your phone, go up to the"
    },
    {
      "Time_Start": 2060.06,
      "Time_End": 2064.6,
      "Text": " reader and mess around with it's settings which is actually something you can do with uh a"
    },
    {
      "Time_Start": 2064.6,
      "Time_End": 2069.64,
      "Text": " lot of readers we tested. Or you can literally go up and rip the reader off the wall. Doesn't"
    },
    {
      "Time_Start": 2069.64,
      "Time_End": 2074.44,
      "Text": " matter how you do it you just need to break it. Now what's going to happen? Well they're"
    },
    {
      "Time_Start": 2074.44,
      "Time_End": 2079.18,
      "Text": " going to need to replace that reader or they're going to need to repair it. And so they"
    },
    {
      "Time_Start": 2079.2,
      "Time_End": 2084.74,
      "Text": " need to deliver that key to that reader right? To set up the secure channel encryption. Well"
    },
    {
      "Time_Start": 2084.74,
      "Time_End": 2089.94,
      "Text": " if we're on the bus listening to everything we know that that keyset message is going to be"
    },
    {
      "Time_Start": 2089.94,
      "Time_End": 2093.94,
      "Text": " delivered with the default base key which means we're going to be in a position where we"
    },
    {
      "Time_Start": 2093.94,
      "Time_End": 2099.4199999999996,
      "Text": " can capture it. When the reader's being set up. Which means after everything is set up we"
    },
    {
      "Time_Start": 2099.4199999999996,
      "Time_End": 2103.3199999999997,
      "Text": " now have the session base key and we can decrypt all the traffic going to the top secret"
    },
    {
      "Time_Start": 2103.34,
      "Time_End": 2108.34,
      "Text": " door. Cool. Alright so what do we do? How do I uh defend? Let's let's look at what we can do"
    },
    {
      "Time_Start": 2112.1800000000003,
      "Time_End": 2117.2200000000003,
      "Text": " from the blue team side. First check your configuration. So we need to make sure that"
    },
    {
      "Time_Start": 2117.2200000000003,
      "Time_End": 2123.6600000000003,
      "Text": " encryption is actually enforced. We need to make sure that there is no possibility that we"
    },
    {
      "Time_Start": 2123.6600000000003,
      "Time_End": 2128.56,
      "Text": " can downgrade that. Um so the readers that support encryption usually or sorry the"
    },
    {
      "Time_Start": 2128.58,
      "Time_End": 2132.14,
      "Text": " controllers that support encryption usually have an option that just does not allow it to"
    },
    {
      "Time_Start": 2132.14,
      "Time_End": 2137.14,
      "Text": " be um to for communications to carry on unencrypted. And disable the install mode. Now"
    },
    {
      "Time_Start": 2138.88,
      "Time_End": 2144.48,
      "Text": " something that Dan failed to mention is when we were doing the the testing for this we"
    },
    {
      "Time_Start": 2144.48,
      "Time_End": 2150.02,
      "Text": " actually tested this on a production site where the install mode was and like left on. So"
    },
    {
      "Time_Start": 2150.02,
      "Time_End": 2154.1,
      "Text": " it's not um you know it's not a theoretical misconfiguration we've actually seen that in"
    },
    {
      "Time_Start": 2154.14,
      "Time_End": 2159.14,
      "Text": " production. So whenever it's set up make sure to disable the install mode. So this is a"
    },
    {
      "Time_Start": 2162.2799999999997,
      "Time_End": 2167.08,
      "Text": " recommendation that I'm going to give to you that you are definitely not going to do. But I'm"
    },
    {
      "Time_Start": 2167.08,
      "Time_End": 2173.06,
      "Text": " going to say it anyway. So uh to never uh configure a reader in production. Meaning uh this"
    },
    {
      "Time_Start": 2173.06,
      "Time_End": 2178.62,
      "Text": " is basically a way of inventing your own out of band key exchange mechanism. So uh rather"
    },
    {
      "Time_Start": 2178.62,
      "Time_End": 2184.0,
      "Text": " than ever using the production wires as in like the reader on the wall using the wires that"
    },
    {
      "Time_Start": 2184.0,
      "Time_End": 2190.18,
      "Text": " are in your building. Um since the entire point of putting encryption on this thing is"
    },
    {
      "Time_Start": 2190.18,
      "Time_End": 2194.58,
      "Text": " assuming that those wires are compromised. That there could be somebody listening. Um that"
    },
    {
      "Time_Start": 2194.58,
      "Time_End": 2199.08,
      "Text": " like doing an insecure key exchange over that mechanism is just hazardous. So what you could"
    },
    {
      "Time_Start": 2199.08,
      "Time_End": 2204.68,
      "Text": " do is if you need to install a reader to take the reader off the wall. Walk it over to the"
    },
    {
      "Time_Start": 2204.68,
      "Time_End": 2210.86,
      "Text": " controller with your feet. Plug it into the controller with like a two foot wire that you're"
    },
    {
      "Time_Start": 2210.86,
      "Time_End": 2215.7200000000003,
      "Text": " reasonably sure has no listening device on it. Do the key the configuration there. Do the"
    },
    {
      "Time_Start": 2215.7200000000003,
      "Time_End": 2221.1,
      "Text": " key exchange there. Take the reader. Walk it back to the door with your feet and then put it"
    },
    {
      "Time_Start": 2221.1,
      "Time_End": 2225.7400000000002,
      "Text": " back onto the wall. Um you have to do this every single time a reader has any kind of an"
    },
    {
      "Time_Start": 2225.7400000000002,
      "Time_End": 2231.44,
      "Text": " error or needs to be reconfigured or replaced. Um for a significantly large building this is"
    },
    {
      "Time_Start": 2231.44,
      "Time_End": 2236.92,
      "Text": " going to be utterly untenable. But nonetheless this is a thing you could do. Um that way"
    },
    {
      "Time_Start": 2236.94,
      "Time_End": 2241.58,
      "Text": " uh anytime the key exchange happens it's never done over the production wires where somebody"
    },
    {
      "Time_Start": 2241.58,
      "Time_End": 2245.96,
      "Text": " is actually listening. Um so if you're like extremely paranoid and this is a thing you want"
    },
    {
      "Time_Start": 2245.96,
      "Time_End": 2252.36,
      "Text": " to do then go ahead. It sort of defeats the purpose of like having this whole system uh but"
    },
    {
      "Time_Start": 2252.36,
      "Time_End": 2258.5,
      "Text": " it's a thing that you could do. Uh never ignore tamper alarms. Uh modern uh readers have a"
    },
    {
      "Time_Start": 2258.5,
      "Time_End": 2262.8,
      "Text": " little button on the back of them that is like a tamper alarm. And in practice when you are a"
    },
    {
      "Time_Start": 2262.8,
      "Time_End": 2266.2400000000002,
      "Text": " red teamer and you're going to be performing this attack you're likely to trip that tamper"
    },
    {
      "Time_Start": 2266.26,
      "Time_End": 2270.86,
      "Text": " alarm. It's literally just like a button that when you uh have the reader against the wall"
    },
    {
      "Time_Start": 2270.86,
      "Time_End": 2275.48,
      "Text": " it's pressed in and then when you like unscrew it with a Phillips head screwdriver to access"
    },
    {
      "Time_Start": 2275.48,
      "Time_End": 2279.94,
      "Text": " the wires behind it, it unpresses that button and then sends a little signal out to the"
    },
    {
      "Time_Start": 2279.94,
      "Time_End": 2285.34,
      "Text": " controller that says I've been tampered with. Um and uh like what happens on the controller"
    },
    {
      "Time_Start": 2285.34,
      "Time_End": 2290.42,
      "Text": " is kind of up to you as a blue team. Um maybe that just goes and gets into a log somewhere"
    },
    {
      "Time_Start": 2290.42,
      "Time_End": 2295.7200000000003,
      "Text": " that somebody will notice in several months. Uh don't let that happen. Uh there's uh often"
    },
    {
      "Time_Start": 2295.7400000000002,
      "Time_End": 2299.4,
      "Text": " other mitigating physical controls around these sorts of doors especially in physical"
    },
    {
      "Time_Start": 2299.4,
      "Time_End": 2304.28,
      "Text": " security systems for uh high secure facilities so like maybe you take a tamper alarm and"
    },
    {
      "Time_Start": 2304.28,
      "Time_End": 2308.28,
      "Text": " like record start recording with a camera when that happens or something if there's a camera"
    },
    {
      "Time_Start": 2308.28,
      "Time_End": 2312.28,
      "Text": " there. Like whatever you do don't ignore these things because uh if you're being attacked"
    },
    {
      "Time_Start": 2312.28,
      "Time_End": 2319.0600000000004,
      "Text": " for real you're likely to get one of these things. Um it is probably possible to um uh uh"
    },
    {
      "Time_Start": 2319.0600000000004,
      "Time_End": 2324.0600000000004,
      "Text": " like uh tamper to to get access to the wires behind a reader without triggering the tamper"
    },
    {
      "Time_Start": 2324.06,
      "Time_End": 2326.9,
      "Text": " alarm but that that's like a whole separate thing that we didn't bother getting into"
    },
    {
      "Time_Start": 2326.9,
      "Time_End": 2331.2999999999997,
      "Text": " because uh it's sort of its own rabbit hole. Um maybe there's a clever little like device"
    },
    {
      "Time_Start": 2331.2999999999997,
      "Time_End": 2334.74,
      "Text": " you could use to like insert behind it and press the button in and then pull it out. I"
    },
    {
      "Time_Start": 2334.74,
      "Time_End": 2341.7599999999998,
      "Text": " don't know. That's not me. Um buy OSDB verified devices. So uh if you're uh a blue teamer"
    },
    {
      "Time_Start": 2341.7599999999998,
      "Time_End": 2346.2599999999998,
      "Text": " or if you're setting up badge control systems for your work, um look for this little like"
    },
    {
      "Time_Start": 2346.2599999999998,
      "Time_End": 2351.1,
      "Text": " check box thing. Um don't just buy some random box off the internet that says it supports"
    },
    {
      "Time_Start": 2351.1,
      "Time_End": 2355.54,
      "Text": " OSDB because it might just like not even support encryption. Like we literally bought a"
    },
    {
      "Time_Start": 2355.54,
      "Time_End": 2361.3199999999997,
      "Text": " device on eBay for like $300 because we wanted to test OSDB encryption and it turned out to"
    },
    {
      "Time_Start": 2361.3199999999997,
      "Time_End": 2367.92,
      "Text": " not support encryption. So I made that mistake and I'm I bet you could too. Um and then"
    },
    {
      "Time_Start": 2367.92,
      "Time_End": 2372.36,
      "Text": " lastly uh don't trust things just because it's encrypted. Uh cryptographic protocols are"
    },
    {
      "Time_Start": 2372.36,
      "Time_End": 2377.04,
      "Text": " really hard and security is hard and just because it has encryption on it doesn't make it"
    },
    {
      "Time_Start": 2377.04,
      "Time_End": 2382.04,
      "Text": " like secure magically. And then uh that is all. Thanks a lot."
    },
    {
      "Time_Start": 2389.12,
      "Time_End": 2393.86,
      "Text": " I think that we have uh time for some questions. There is a microphone um right in the middle"
    },
    {
      "Time_Start": 2393.86,
      "Time_End": 2397.56,
      "Text": " here. If you'd like to ask a question you can uh go up to the microphone there."
    },
    {
      "Time_Start": 2397.56,
      "Time_End": 2402.86,
      "Text": " Alternatively um you can just shout really loud um and I could probably hear you if you do"
    },
    {
      "Time_Start": 2402.86,
      "Time_End": 2410.1,
      "Text": " that. Um if not then uh we'll just be kind of uh milling about here and then um. How am I"
    },
    {
      "Time_Start": 2410.1,
      "Time_End": 2414.0,
      "Text": " splicing 485s here? Oh yeah you can um you can basically just punch into it. So it's a"
    },
    {
      "Time_Start": 2414.0,
      "Time_End": 2417.54,
      "Text": " differential the question I'll ask the question uh repeat the question. How are we um"
    },
    {
      "Time_Start": 2417.54,
      "Time_End": 2423.38,
      "Text": " interfacing with the um RS-485? Um like from a physical perspective. Um and uh you can just"
    },
    {
      "Time_Start": 2423.38,
      "Time_End": 2427.56,
      "Text": " tap into it basically so it's a differential signal. Um and because it's multi-drop it's"
    },
    {
      "Time_Start": 2427.56,
      "Time_End": 2432.26,
      "Text": " like meant to be used in that kind of configuration basically. Um so yeah you can just kind"
    },
    {
      "Time_Start": 2432.26,
      "Time_End": 2437.46,
      "Text": " of like tap into it. And we're uh also uh for our device I'm uh tapping into the power line"
    },
    {
      "Time_Start": 2437.46,
      "Time_End": 2442.26,
      "Text": " as well. Um just to get power from it. So you you you get the data lines it's a differential"
    },
    {
      "Time_Start": 2442.26,
      "Time_End": 2447.34,
      "Text": " signal so you get like power in power out or uh like data and then negative data. And then"
    },
    {
      "Time_Start": 2447.34,
      "Time_End": 2451.6800000000003,
      "Text": " um you'll also have uh power lines. In theory you could use a battery um but we figured it"
    },
    {
      "Time_Start": 2451.6800000000003,
      "Time_End": 2457.48,
      "Text": " was just going to be easier to tap into the power lines as well. So yeah. Yes um all of our"
    },
    {
      "Time_Start": 2457.48,
      "Time_End": 2463.04,
      "Text": " uh the the tools are on our GitHub. It's uh github.com slash BishopFox. Um you'll find all"
    },
    {
      "Time_Start": 2463.04,
      "Time_End": 2467.08,
      "Text": " the code there. We have the hardware schematics for the um the hardware itself as well as"
    },
    {
      "Time_Start": 2467.08,
      "Time_End": 2472.72,
      "Text": " um um some code. Oh yeah we actually have a bunch of PCBs to give away. Um we have a"
    },
    {
      "Time_Start": 2472.72,
      "Time_End": 2478.62,
      "Text": " hundred uh uh uh like uh Melon uh PCBs if you want to uh nag one. It doesn't have the rest"
    },
    {
      "Time_Start": 2478.62,
      "Time_End": 2481.86,
      "Text": " of the components on them so you're going to have to do some soldering. But uh yeah we got"
    },
    {
      "Time_Start": 2481.86,
      "Time_End": 2488.1800000000003,
      "Text": " some PCBs if you want to get one. You have to uh bug this guy. He's got them. Yes question."
    },
    {
      "Time_Start": 2488.1800000000003,
      "Time_End": 2490.7200000000003,
      "Text": " People are going for the shouting option more than I thought they were going to. You have to"
    },
    {
      "Time_Start": 2490.7200000000003,
      "Time_End": 2495.7200000000003,
      "Text": " shout. Yes so the spec is open. Um in fact it's so open that anyone can purchase it for"
    },
    {
      "Time_Start": 2500.52,
      "Time_End": 2505.54,
      "Text": " two hundred dollars online. Um the that is uh the only official way of getting access to it."
    },
    {
      "Time_Start": 2506.5,
      "Time_End": 2511.5,
      "Text": " Yeah. Yeah. Uh so the question for those listening is uh like uh in one of the attacks the"
    },
    {
      "Time_Start": 2521.4,
      "Time_End": 2524.8,
      "Text": " downgrade attack we're going to modify the capabilities packet. Like how are we doing"
    },
    {
      "Time_Start": 2524.8,
      "Time_End": 2528.2,
      "Text": " that if we're just passively tapping? Um for that attack we're just not uh for the hardware"
    },
    {
      "Time_Start": 2528.2,
      "Time_End": 2532.74,
      "Text": " device. Um we have kind of like two versions of uh the code. There's one that's Python"
    },
    {
      "Time_Start": 2532.78,
      "Time_End": 2536.76,
      "Text": " that's like meant to run on a laptop with big RS45 adapters where you're in the middle. And"
    },
    {
      "Time_Start": 2536.76,
      "Time_End": 2540.38,
      "Text": " then for the initial version of our hardware device that's like miniaturized down into like a"
    },
    {
      "Time_Start": 2540.38,
      "Time_End": 2544.1200000000003,
      "Text": " one inch by one inch thing. We decided to just make it a passive tap. So we're not doing the"
    },
    {
      "Time_Start": 2544.1200000000003,
      "Time_End": 2547.46,
      "Text": " man in the middle attacks. Um and that would be one of them. So yeah that that one the"
    },
    {
      "Time_Start": 2547.46,
      "Time_End": 2551.1000000000004,
      "Text": " install mode attack is not part of the um hardware one at this point. Maybe we'll make a"
    },
    {
      "Time_Start": 2551.1000000000004,
      "Time_End": 2555.34,
      "Text": " separate one that has like a proper man in the middle. But you would have to like snip the"
    },
    {
      "Time_Start": 2555.34,
      "Time_End": 2560.2400000000002,
      "Text": " wire and then get it in the middle and then like uh I don't know that that seems like a lot"
    },
    {
      "Time_Start": 2560.2400000000002,
      "Time_End": 2565.2400000000002,
      "Text": " for red teaming. So we we just avoided it. Yeah."
    }
  ]
}