{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 13.200000000000001,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Am I doing my thing now? Yes? Wow. It's an honor being here. Hi, my name is Stöck. Oh, no. Hi, my name is Fredrik"
    },
    {
      "Time_Start": 13.200000000000001,
      "Time_End": 21.04,
      "Text": " Alexander. Most people actually know me more by my hackle hand as Stöck. And I'm gonna welcome all"
    },
    {
      "Time_Start": 21.04,
      "Time_End": 28.64,
      "Text": " you to my talk, Weaponizing Plain Text, Unseen Scape Sequences as a Forensic Nightmare. And"
    },
    {
      "Time_Start": 29.2,
      "Time_End": 34.56,
      "Text": " leading up to this talk, I was kind of told that you need to have this table of content that"
    },
    {
      "Time_Start": 34.56,
      "Time_End": 38.88,
      "Text": " explains things that are gonna happen because otherwise people get bored and really sad."
    },
    {
      "Time_Start": 39.92,
      "Time_End": 44.72,
      "Text": " But I figured that we got 281 slides to go through. So screw that other thing and just"
    },
    {
      "Time_Start": 44.72,
      "Time_End": 54.72,
      "Text": " head straight into it. Thank you. So I spent a good time of digging into this vulnerability"
    },
    {
      "Time_Start": 54.72,
      "Time_End": 61.2,
      "Text": " class CB150 that's been dormant for the last two decades or so. And that was real fun. And"
    },
    {
      "Time_Start": 61.2,
      "Time_End": 67.2,
      "Text": " that's what this talk is all about. But I used to travel the world to all these live hacking events"
    },
    {
      "Time_Start": 67.76,
      "Time_End": 75.84,
      "Text": " and create educational videos on YouTube. But nowadays I fight cybercrime over at TrueSec."
    },
    {
      "Time_Start": 75.84,
      "Time_End": 83.03999999999999,
      "Text": " And I also do shitloads of incident response. So I realized that I'm really passionate about"
    },
    {
      "Time_Start": 83.04,
      "Time_End": 87.52000000000001,
      "Text": " getting log files because that's kind of the whole part of creating a good timeline."
    },
    {
      "Time_Start": 87.52000000000001,
      "Time_End": 92.96000000000001,
      "Text": " So I figured that maybe I'm the only one, maybe some other people like log files too. So I went"
    },
    {
      "Time_Start": 92.96000000000001,
      "Time_End": 99.28,
      "Text": " on the application formerly known as Twitter and asked, are log files important? And I got a bunch"
    },
    {
      "Time_Start": 99.28,
      "Time_End": 107.84,
      "Text": " of really good answers coming back. And the short answer is kind of like, yes, log files are"
    },
    {
      "Time_Start": 107.84,
      "Time_End": 114.96000000000001,
      "Text": " important because logs are a vital component for maintaining application reliability, performance"
    },
    {
      "Time_Start": 114.96000000000001,
      "Time_End": 122.96000000000001,
      "Text": " and security. But it also seems like the common idea is that logs don't lie, people do. And"
    },
    {
      "Time_Start": 123.92,
      "Time_End": 130.8,
      "Text": " even though your log files might just not lie to you, do you still trust them? And what happens"
    },
    {
      "Time_Start": 130.8,
      "Time_End": 137.6,
      "Text": " if you don't? Because imagine this for a second. You are now the incident response lead of a"
    },
    {
      "Time_Start": 137.6,
      "Time_End": 142.79999999999998,
      "Text": " global logistics corporation. It's 4 o'clock in the morning and you're sound asleep in your bed,"
    },
    {
      "Time_Start": 143.76,
      "Time_End": 149.92,
      "Text": " dreaming about boats or maybe containers in the dockers and stuff. When you get this rude"
    },
    {
      "Time_Start": 149.92,
      "Time_End": 156.64,
      "Text": " awakening call from your manager that's pissed because you got breached. And since you are the"
    },
    {
      "Time_Start": 156.64,
      "Time_End": 162.32,
      "Text": " incident response lead, it's your responsibility to call up all those tired people that work in"
    },
    {
      "Time_Start": 162.32,
      "Time_End": 166.48,
      "Text": " the incident response team and get those starting with collecting all the logs that you need"
    },
    {
      "Time_Start": 167.2,
      "Time_End": 173.04,
      "Text": " to be able to create the timeline. You're a manager, so you don't do grunt work, so you log"
    },
    {
      "Time_Start": 173.04,
      "Time_End": 178.07999999999998,
      "Text": " into your big data app for a thousand. And since you're a professional, you log ship stuff already,"
    },
    {
      "Time_Start": 178.07999999999998,
      "Time_End": 186.07999999999998,
      "Text": " so you export the data, save it into a local file called everything.log. You're happy. But just to"
    },
    {
      "Time_Start": 186.07999999999998,
      "Time_End": 190.79999999999998,
      "Text": " verify that you got any data in there, you decided that maybe I should just cat the file and see"
    },
    {
      "Time_Start": 190.8,
      "Time_End": 195.60000000000002,
      "Text": " what's in there. In the beginning, everything looks just great. It contains the things that"
    },
    {
      "Time_Start": 195.60000000000002,
      "Time_End": 203.68,
      "Text": " you wanted, but then suddenly out of nowhere, boom, you're getting an ad for a restoring service"
    },
    {
      "Time_Start": 204.24,
      "Time_End": 210.88000000000002,
      "Text": " and they're nice enough to provide you with a calculator so you can do the math for how much"
    },
    {
      "Time_Start": 210.88000000000002,
      "Time_End": 216.48000000000002,
      "Text": " it's going to cost you. And that's kind of the situation where you're starting to realize that"
    },
    {
      "Time_Start": 217.44000000000003,
      "Time_End": 227.44000000000003,
      "Text": " shit. And the reason for all this is that it has to do with ANSI escape sequences. And what got"
    },
    {
      "Time_Start": 227.44000000000003,
      "Time_End": 233.52,
      "Text": " me all into this is this CVE here. And I was just going to read this straight out from my monitor"
    },
    {
      "Time_Start": 233.52,
      "Time_End": 239.12,
      "Text": " because I didn't remember it all. Effective version of this package are vulnerable to arbitrary"
    },
    {
      "Time_Start": 239.28,
      "Time_End": 247.76,
      "Text": " code injection. There we are interested, right? This is a possible shell escape sequence injection"
    },
    {
      "Time_Start": 247.76,
      "Time_End": 254.24,
      "Text": " when built in Racks, Lint, and Common Logger components. Carefully crafted requests can cause"
    },
    {
      "Time_Start": 254.24,
      "Time_End": 258.96,
      "Text": " shell escape sequences to be written to the terminal via Racks, Lint, Middleware, and"
    },
    {
      "Time_Start": 258.96,
      "Time_End": 266.0,
      "Text": " Common Logger. Middleware. Okay? These escape sequences can be leveraged to possibly execute"
    },
    {
      "Time_Start": 266.0,
      "Time_End": 274.16,
      "Text": " commands in the victim's terminal. Audio guy, are you with me? Excuse me, Tiny Sturck. What do you"
    },
    {
      "Time_Start": 274.16,
      "Time_End": 283.04,
      "Text": " mean possibly? Either you can or you cannot run arbitrary commands, right? Yeah. Thank you for"
    },
    {
      "Time_Start": 283.04,
      "Time_End": 289.36,
      "Text": " that, Giant Sturck, for pitching in and helping out here in the presentation. Well, you're actually"
    },
    {
      "Time_Start": 289.36,
      "Time_End": 296.32,
      "Text": " right. It depends. But it apparently depends on the terminal that you're using. And there's a"
    },
    {
      "Time_Start": 296.32,
      "Time_End": 301.76,
      "Text": " shitload of different terminals out there today. And some of them come built into the software"
    },
    {
      "Time_Start": 301.76,
      "Time_End": 306.72,
      "Text": " that you're using, like VS Code and Docker. Then you have third-party stuff like iTermKitty and"
    },
    {
      "Time_Start": 306.72,
      "Time_End": 311.04,
      "Text": " other ones and stuff that people built on their own. Then you have the ones that get shipped in"
    },
    {
      "Time_Start": 311.04,
      "Time_End": 317.76,
      "Text": " your operational system, like Windows Terminal, Terminal.app, GNOME, VTE, and other stuff. And"
    },
    {
      "Time_Start": 317.76,
      "Time_End": 323.28,
      "Text": " then you've got old stuff like Xterm. So we also got this when we were in the cloud. Maybe you"
    },
    {
      "Time_Start": 323.28,
      "Time_End": 328.64,
      "Text": " don't know this, but if you're going to try to use a digital ocean to connect to your droplet or"
    },
    {
      "Time_Start": 328.64,
      "Time_End": 334.71999999999997,
      "Text": " you're going to do some recovery console stuff, that is actually like an Xterm thingy. Connecting"
    },
    {
      "Time_Start": 334.71999999999997,
      "Time_End": 340.8,
      "Text": " to that over TTY, you're able to interact with it. It's a terminal. And I wasn't really interested"
    },
    {
      "Time_Start": 340.8,
      "Time_End": 349.6,
      "Text": " in the possibly part. I wanted to execute commands in the victim terminals. But I had no idea where"
    },
    {
      "Time_Start": 349.6,
      "Time_End": 355.6,
      "Text": " to begin. It sounded cool. So I did everything that every self-respecting researcher do. I"
    },
    {
      "Time_Start": 355.6,
      "Time_End": 362.24,
      "Text": " Googled what ANSI escape codes were. I had no idea. And I quickly realized that people actually"
    },
    {
      "Time_Start": 362.24,
      "Time_End": 369.04,
      "Text": " like to customize their terminals in the weirdest kind of ways, especially if you're using ARC. And"
    },
    {
      "Time_Start": 369.04,
      "Time_End": 373.36,
      "Text": " this is the thing that got me interested. Like, oh, cool, you can change colors and stuff. But I"
    },
    {
      "Time_Start": 373.36,
      "Time_End": 380.32,
      "Text": " also realized that in 1978, the Jillstrand boys dropped their Banger album, We're Going to Have"
    },
    {
      "Time_Start": 380.32,
      "Time_End": 388.48,
      "Text": " Some Fun Tonight. But even though it would release the same year, the VT100 terminal, and"
    },
    {
      "Time_Start": 388.48,
      "Time_End": 395.28000000000003,
      "Text": " connecting that using serial cables to a big VAX system is probably not what those guys thought"
    },
    {
      "Time_Start": 395.28000000000003,
      "Time_End": 401.52000000000004,
      "Text": " would be fun to do on a Saturday night, even though I personally would think that was kind of cool."
    },
    {
      "Time_Start": 401.52000000000004,
      "Time_End": 406.00000000000006,
      "Text": " But I also realized that ANSI escape sequences are the shit that puts stuff on your terminal that"
    },
    {
      "Time_Start": 406.00000000000006,
      "Time_End": 412.88000000000005,
      "Text": " you look at. And it can do stuff like you can move the cursor around. You can remap the keys"
    },
    {
      "Time_Start": 412.88000000000005,
      "Time_End": 421.76000000000005,
      "Text": " using these. And you can actually print stuff. Bing. Interesting. But you can also build whole UIs."
    },
    {
      "Time_Start": 422.08,
      "Time_End": 428.0,
      "Text": " All this UI here is built in ANSI escape codes, positioning of stuff, colors and output and all"
    },
    {
      "Time_Start": 428.0,
      "Time_End": 433.84,
      "Text": " that, refreshing, clearing screens. All that is part of something called the control sequences"
    },
    {
      "Time_Start": 433.84,
      "Time_End": 439.36,
      "Text": " standard. This is a standard for Xterm, and it's vast and it's super hard to understand. I know"
    },
    {
      "Time_Start": 439.36,
      "Time_End": 445.12,
      "Text": " you're all super smart. I wasn't. So I'm going to go through the basics with you. And the first"
    },
    {
      "Time_Start": 445.12,
      "Time_End": 449.76,
      "Text": " I started looking through the documentation, it said CSIPM character attribute something,"
    },
    {
      "Time_Start": 450.71999999999997,
      "Time_End": 457.36,
      "Text": " no idea what that meant, but it's this. So all it actually is is printing out something that"
    },
    {
      "Time_Start": 457.36,
      "Time_End": 463.44,
      "Text": " turns into green. Cool. And the reason why this works is due to this funny thing here called the"
    },
    {
      "Time_Start": 463.44,
      "Time_End": 468.88,
      "Text": " escape character. That's important to remember. And it's also a non-visible escape character."
    },
    {
      "Time_Start": 469.44,
      "Time_End": 474.96,
      "Text": " And it comes in many shapes and forms, because the reason why they didn't print out exactly the"
    },
    {
      "Time_Start": 474.96000000000004,
      "Time_End": 481.68000000000006,
      "Text": " command is because it depends if you're using octal, hex, unicode, decimal or ASCII. All of"
    },
    {
      "Time_Start": 481.68000000000006,
      "Time_End": 487.44000000000005,
      "Text": " these are the same sequences, different kind of ways to portrait it. And I also realized that"
    },
    {
      "Time_Start": 487.44000000000005,
      "Time_End": 493.76000000000005,
      "Text": " Bash likes octal, Python likes hex, Java and JavaScript likes unicode and PowerShell likes"
    },
    {
      "Time_Start": 493.76000000000005,
      "Time_End": 500.8,
      "Text": " decimal for some reason. And this escape character here is the one that starts the whole sequence."
    },
    {
      "Time_Start": 500.88,
      "Time_End": 507.04,
      "Text": " It needs to start with that. Then we have this control sequence introducer, which tells the"
    },
    {
      "Time_Start": 507.04,
      "Time_End": 513.52,
      "Text": " terminal to do shit. Next one is the parameter, the number. So we'll go with 32, which is green"
    },
    {
      "Time_Start": 513.52,
      "Time_End": 520.16,
      "Text": " here. M is to change whatever continues output turning that into green, which is the string we"
    },
    {
      "Time_Start": 520.16,
      "Time_End": 526.88,
      "Text": " have here. And then we're just going to close it off with another escape character, another control"
    },
    {
      "Time_Start": 526.96,
      "Time_End": 532.96,
      "Text": " sequence introducer. And this is the important part. Here we do zero M, and that means we're"
    },
    {
      "Time_Start": 532.96,
      "Time_End": 539.36,
      "Text": " resetting the terminal back. Because if you don't do that, apparently this is going to happen."
    },
    {
      "Time_Start": 539.36,
      "Time_End": 546.4,
      "Text": " Everything, the rest of your shit is going to be all green. Hulk smash. But we need to terminate"
    },
    {
      "Time_Start": 546.4,
      "Time_End": 553.92,
      "Text": " this using a ST or string terminator or bell character. And if you're like me and you accidentally"
    },
    {
      "Time_Start": 554.64,
      "Time_End": 561.4399999999999,
      "Text": " gripped something, and then your terminal starts like ding, ding, ding, that is being interpreted"
    },
    {
      "Time_Start": 561.4399999999999,
      "Time_End": 567.28,
      "Text": " as the bell character. So we got escape sequences being shoved in there. So I thought, okay, cool,"
    },
    {
      "Time_Start": 567.28,
      "Time_End": 573.68,
      "Text": " that's fun. I can put colors on my screen. Fancy. What happens if I put that in something called a"
    },
    {
      "Time_Start": 573.68,
      "Time_End": 578.8,
      "Text": " bad log and see what happens and then interact with it? Well, if I'm using Vim, it's going to"
    },
    {
      "Time_Start": 578.8800000000001,
      "Time_End": 586.5600000000001,
      "Text": " show exactly what the escape character is. It's this one here. And that's cool, because it's not"
    },
    {
      "Time_Start": 586.5600000000001,
      "Time_End": 592.96,
      "Text": " rendering. It just shows it. Same for Nano. If you're using that, you're cool. And if you're"
    },
    {
      "Time_Start": 592.96,
      "Time_End": 598.08,
      "Text": " using a browser, instead it's going to show it as Unicode. So that's also interesting to know."
    },
    {
      "Time_Start": 598.8800000000001,
      "Time_End": 602.1600000000001,
      "Text": " It's getting interpreted differently depending on the system you're using."
    },
    {
      "Time_Start": 603.12,
      "Time_End": 611.12,
      "Text": " But if you cut it, colors are going to get displayed. Grip, tail, the same thing. And even"
    },
    {
      "Time_Start": 611.12,
      "Time_End": 617.28,
      "Text": " if you curl it, boom, fun stuff is going to happen. Because all these systems interpret"
    },
    {
      "Time_Start": 617.8399999999999,
      "Time_End": 623.6,
      "Text": " the sequence and renders it. And at this stage, when I ran into curl, I'm like, shit, what just"
    },
    {
      "Time_Start": 623.6,
      "Time_End": 631.1999999999999,
      "Text": " happened? What just happened? And I started thinking, where can I stuff this? Where that"
    },
    {
      "Time_Start": 631.2800000000001,
      "Time_End": 636.24,
      "Text": " would interact with other people's stuff? So I figured, why not do it in a text record? Because"
    },
    {
      "Time_Start": 636.24,
      "Time_End": 646.72,
      "Text": " DNS is always the source for all evil. So I put it in there. And I ran NSLookup on OSX. Nothing"
    },
    {
      "Time_Start": 646.72,
      "Time_End": 651.44,
      "Text": " happened. You can see here, the extra slash in front of it means that it's escaped. It's"
    },
    {
      "Time_Start": 651.44,
      "Time_End": 656.1600000000001,
      "Text": " beautifully escaped. This is a real good thing. If you're doing that on Windows, though, it's a"
    },
    {
      "Time_Start": 656.24,
      "Time_End": 662.56,
      "Text": " different kind of story. So it depends on what kind of OS you're using. And big ups to David for"
    },
    {
      "Time_Start": 662.56,
      "Time_End": 667.52,
      "Text": " showing that. That was real cool. So I was starting to ask myself, okay, cool, that's fun."
    },
    {
      "Time_Start": 667.52,
      "Time_End": 673.8399999999999,
      "Text": " But is this even a security issue? Seriously? So this kind of feels like this self-access thing"
    },
    {
      "Time_Start": 673.8399999999999,
      "Time_End": 678.48,
      "Text": " where you're like, okay, I can put colors on my terminal fun times. I need to figure out,"
    },
    {
      "Time_Start": 678.48,
      "Time_End": 685.52,
      "Text": " who would this be an issue for? Where would this be an issue? How would this be an issue? And"
    },
    {
      "Time_Start": 685.6,
      "Time_End": 692.56,
      "Text": " what would be the consequences of this? Well, the weird one wasn't that hard to figure out."
    },
    {
      "Time_Start": 692.56,
      "Time_End": 698.64,
      "Text": " Apparently, since we had the common logger thing, log injection would be the way to go. And"
    },
    {
      "Time_Start": 699.52,
      "Time_End": 705.76,
      "Text": " who would it affect? I reckon DevOps, sysadmin, IR forensic people, or anyone that interacts"
    },
    {
      "Time_Start": 705.76,
      "Time_End": 711.1999999999999,
      "Text": " with a log file using a terminal. And we can take a quick break here. How many of you have ever"
    },
    {
      "Time_Start": 711.2,
      "Time_End": 718.48,
      "Text": " catted, gripped, or JQ'd a file that you parsed from some other software? I love you."
    },
    {
      "Time_Start": 721.5200000000001,
      "Time_End": 727.84,
      "Text": " So to do this, as the scientists we are, researchers, we're professionals. Logging"
    },
    {
      "Time_Start": 727.84,
      "Time_End": 731.44,
      "Text": " injection vulnerabilities occur according to OS when data enters an application from an"
    },
    {
      "Time_Start": 731.44,
      "Time_End": 736.5600000000001,
      "Text": " untrusted source. Yes. The data is written to an application or a system log file. Cool."
    },
    {
      "Time_Start": 737.5200000000001,
      "Time_End": 742.1600000000001,
      "Text": " I needed to adapt that. This is kind of written to do XSS stuff. So I figured that, okay, to"
    },
    {
      "Time_Start": 742.1600000000001,
      "Time_End": 750.32,
      "Text": " successfully have this as a measurement, I needed to be able to inject new log files or events by"
    },
    {
      "Time_Start": 750.32,
      "Time_End": 756.32,
      "Text": " forging a log. I needed to be able to inject an escape sequence. And I needed to in some way or"
    },
    {
      "Time_Start": 756.32,
      "Time_End": 763.2,
      "Text": " form make that run in someone's terminal emulator. And I also needed that injection to execute some"
    },
    {
      "Time_Start": 763.2,
      "Time_End": 770.8000000000001,
      "Text": " kind of stuff. And I figured, which would be the best test bench for this? And Docker, obviously."
    },
    {
      "Time_Start": 770.8000000000001,
      "Time_End": 776.96,
      "Text": " Because it loves to send whatever logs to standard out. It has this real live log that's running"
    },
    {
      "Time_Start": 776.96,
      "Time_End": 782.8000000000001,
      "Text": " through. They're actually terminal rendering stuff. And it comes with a really nifty getting"
    },
    {
      "Time_Start": 782.8000000000001,
      "Time_End": 791.2,
      "Text": " started kind of app. Good stuff. I'll go for that. And also, a way for you, if you want to attach"
    },
    {
      "Time_Start": 791.36,
      "Time_End": 796.6400000000001,
      "Text": " or work with Docker, you would use Docker attach inside a terminal, connect to it, or Docker logs"
    },
    {
      "Time_Start": 796.6400000000001,
      "Time_End": 802.96,
      "Text": " to do like a tail and see whatever happens inside your container. I'm like, seems tasty enough for"
    },
    {
      "Time_Start": 802.96,
      "Time_End": 807.76,
      "Text": " me. But I also realized that I couldn't just take this print F thing and stuff it in a browser"
    },
    {
      "Time_Start": 807.76,
      "Time_End": 813.6,
      "Text": " because, hey, shit, you can't do that. No, no, no. So I needed a URL encoded. And for good measure,"
    },
    {
      "Time_Start": 813.6,
      "Time_End": 818.8000000000001,
      "Text": " we added a new line in there because everyone knows that if you're triaging some kind of bugs,"
    },
    {
      "Time_Start": 818.8000000000001,
      "Time_End": 824.5600000000001,
      "Text": " new lines are very important to show that it's actually able to inject some kind of false log"
    },
    {
      "Time_Start": 824.5600000000001,
      "Time_End": 832.8800000000001,
      "Text": " entries. So I figured, why not see? Let's see what happens if I curl this and you send that straight"
    },
    {
      "Time_Start": 832.8800000000001,
      "Time_End": 840.32,
      "Text": " in. And I was really excited when I realized, oh, nothing came back. Then I started looking at the"
    },
    {
      "Time_Start": 840.32,
      "Time_End": 846.72,
      "Text": " log in over here. It's like, oh, nothing comes in return in the response. But new line has been"
    },
    {
      "Time_Start": 846.72,
      "Time_End": 852.08,
      "Text": " entered. The color has been rendered inside the log that's being displayed in real time, which"
    },
    {
      "Time_Start": 852.08,
      "Time_End": 857.9200000000001,
      "Text": " means on the first try, more or less, we checked all the boxes to prove a successful log injection"
    },
    {
      "Time_Start": 857.9200000000001,
      "Time_End": 863.52,
      "Text": " because we're injecting new lines. We are enabled to run escape sequences that will be viewed in a"
    },
    {
      "Time_Start": 863.52,
      "Time_End": 869.28,
      "Text": " terminal emulator, in this case Docker. And I'm able to inject commands that the terminal emulator"
    },
    {
      "Time_Start": 869.28,
      "Time_End": 875.52,
      "Text": " could execute. In this case, we're changing the color. Because remember, even though that was the"
    },
    {
      "Time_Start": 875.52,
      "Time_End": 881.92,
      "Text": " only line that I put in, we can create this. Because it's all about the limitations and creativity"
    },
    {
      "Time_Start": 881.92,
      "Time_End": 891.12,
      "Text": " of whoever decides to design this. And even though I'm like, fuck yeah, confirmed, the Yieldstrand"
    },
    {
      "Time_Start": 891.12,
      "Time_End": 899.76,
      "Text": " boys weren't that impressed. They wanted me to provide more impact. So I'm like, okay, I can do"
    },
    {
      "Time_Start": 899.84,
      "Time_End": 906.0,
      "Text": " that. I started once again Googling stuff. And then I stumbled upon this great research from 2003"
    },
    {
      "Time_Start": 906.0,
      "Time_End": 912.08,
      "Text": " by H.D. Moore. And he found a really, really interesting, cool way to just misuse the terminal"
    },
    {
      "Time_Start": 913.12,
      "Time_End": 919.28,
      "Text": " and use it against them in a way. So what happens here is that they were able to use something"
    },
    {
      "Time_Start": 919.28,
      "Time_End": 926.48,
      "Text": " called OSC 2 sequence, where you will actually put this on a command line, and that would change"
    },
    {
      "Time_Start": 926.48,
      "Time_End": 931.44,
      "Text": " the title of the terminal you're in. And if you're currently using a terminal and you're changing"
    },
    {
      "Time_Start": 931.44,
      "Time_End": 936.8000000000001,
      "Text": " directories and stuff, and it used updates there inside the title, I've seen that, or you're"
    },
    {
      "Time_Start": 936.8000000000001,
      "Time_End": 941.9200000000001,
      "Text": " connecting to a shell and changing it, that is actually the sequence doing that. But that wasn't"
    },
    {
      "Time_Start": 941.9200000000001,
      "Time_End": 949.04,
      "Text": " enough. They digged into the deeper parts of the whole documentation and realized that in this CSI"
    },
    {
      "Time_Start": 949.92,
      "Time_End": 957.92,
      "Text": " code here, 21T, you were actually able to report back whatever was put inside the title and push"
    },
    {
      "Time_Start": 960.24,
      "Time_End": 967.92,
      "Text": " that to the command line. That could only mean trouble. Because even if this stuff would be put"
    },
    {
      "Time_Start": 967.92,
      "Time_End": 972.88,
      "Text": " on the command line, and in this case, you needed to have a social interaction with the user. The"
    },
    {
      "Time_Start": 972.88,
      "Time_End": 978.8,
      "Text": " user needs to be fooled into pressing enter. It's still a cool way to just push something in"
    },
    {
      "Time_Start": 978.8800000000001,
      "Time_End": 987.2,
      "Text": " the title, read it back, and then boom, shit happens. But that's been fixed for ages. 2003, if you"
    },
    {
      "Time_Start": 987.2,
      "Time_End": 993.2,
      "Text": " want to feel old, is like two decades ago. So I started searching some more, and I found this"
    },
    {
      "Time_Start": 993.2,
      "Time_End": 1001.1200000000001,
      "Text": " really nice write-up from Evil Alive Jake Linasky that did some cool research on all these different"
    },
    {
      "Time_Start": 1001.1200000000001,
      "Time_End": 1006.5600000000001,
      "Text": " web servers back in 2010, where they're using the same kind of sequence here. But we know that's"
    },
    {
      "Time_Start": 1006.5600000000001,
      "Time_End": 1012.72,
      "Text": " been fixed, so can't do much with that. But then in 2022, Evitar Gursi released some, sorry for"
    },
    {
      "Time_Start": 1012.72,
      "Time_End": 1018.8800000000001,
      "Text": " crashing the name, don't know how to pronounce it, a cool way to create a DOS sequence when they"
    },
    {
      "Time_Start": 1018.8800000000001,
      "Time_End": 1026.56,
      "Text": " were able to read a bunch of stuff into the title and just creating crashes. And I'm just tasting"
    },
    {
      "Time_Start": 1026.56,
      "Time_End": 1033.3600000000001,
      "Text": " buffer overflows here for the future to come. But that's been fixed too. So here I am, feeling like"
    },
    {
      "Time_Start": 1033.3600000000001,
      "Time_End": 1038.4,
      "Text": " an epic fail. Can't do the arbitrary command injection. That seems so cool that the person"
    },
    {
      "Time_Start": 1038.4,
      "Time_End": 1045.2,
      "Text": " talked about in the CBE. So I did the thing. I think the end is the only thing you do. You reach out to"
    },
    {
      "Time_Start": 1045.2,
      "Time_End": 1051.92,
      "Text": " the original poster and ask them, can I ask the RC park? And the answer back, I didn't write any, I"
    },
    {
      "Time_Start": 1051.92,
      "Time_End": 1059.68,
      "Text": " used this paper as a reference, and that sucks because we know that's fixed. So here I am, super"
    },
    {
      "Time_Start": 1059.68,
      "Time_End": 1066.16,
      "Text": " excited, but all I got, old stuff. And speaking about old stuff, this is what I looked like in the"
    },
    {
      "Time_Start": 1066.16,
      "Time_End": 1074.24,
      "Text": " 80s. No, I'm kidding. I'm probably more like this badass here. And if you look at the angle of the"
    },
    {
      "Time_Start": 1074.24,
      "Time_End": 1079.92,
      "Text": " arm here, that's very important because it's exactly the same angle as this gentleman here in"
    },
    {
      "Time_Start": 1079.92,
      "Time_End": 1085.3600000000001,
      "Text": " this band poster. And that's pretty fucking darn cool because he was one of the first people to"
    },
    {
      "Time_Start": 1085.3600000000001,
      "Time_End": 1093.0400000000002,
      "Text": " sell Diab and Unix computers in Sweden. And not only that, he's my dad. So I'm very grateful to"
    },
    {
      "Time_Start": 1093.0400000000002,
      "Time_End": 1100.0000000000002,
      "Text": " him to put stuff and give me access to computers at an early age. Thank you."
    },
    {
      "Time_Start": 1103.7600000000002,
      "Time_End": 1107.2800000000002,
      "Text": " But I'm starting to look at this picture, I'm starting to realize that I'm actually,"
    },
    {
      "Time_Start": 1107.2800000000002,
      "Time_End": 1112.0800000000002,
      "Text": " maybe I'm looking more like Lasse that was on the same tour as my dad when he met my mom."
    },
    {
      "Time_Start": 1116.2400000000002,
      "Time_End": 1122.64,
      "Text": " Anyway, the standard is vast and it's deep, and it takes a lot of things to go through, but that"
    },
    {
      "Time_Start": 1122.64,
      "Time_End": 1128.2400000000002,
      "Text": " wasn't enough for the fine developers and users of terminals of today. No, they wanted more."
    },
    {
      "Time_Start": 1128.2400000000002,
      "Time_End": 1134.48,
      "Text": " Because all these different terminals have different kind of functionality, and you know,"
    },
    {
      "Time_Start": 1134.48,
      "Time_End": 1140.4,
      "Text": " with more features, we need more stuff. So they invited something called proprietary escape codes,"
    },
    {
      "Time_Start": 1140.96,
      "Time_End": 1146.88,
      "Text": " which is a local edition of the standard. And it works in certain terminals, not all of them."
    },
    {
      "Time_Start": 1146.88,
      "Time_End": 1152.5600000000002,
      "Text": " Some of them are being shared internally and some work over the whole bar. And what that does is"
    },
    {
      "Time_Start": 1152.5600000000002,
      "Time_End": 1160.4,
      "Text": " gives you the opportunity to make a fun twirly thing maybe in your title, get notifications and"
    },
    {
      "Time_Start": 1160.4,
      "Time_End": 1164.64,
      "Text": " all this other cool stuff that's in there. Maybe even change your background. Fancy stuff."
    },
    {
      "Time_Start": 1165.5200000000002,
      "Time_End": 1170.72,
      "Text": " But some thought that it was a great idea to always run some processes with arguments."
    },
    {
      "Time_Start": 1170.72,
      "Time_End": 1175.2,
      "Text": " Why not? Using escape sequences. I mean, that's a really bad idea."
    },
    {
      "Time_Start": 1177.0400000000002,
      "Time_End": 1182.5600000000002,
      "Text": " But luckily enough, it's rare to find stuff that runs a really bad idea too"
    },
    {
      "Time_Start": 1182.5600000000002,
      "Time_End": 1188.88,
      "Text": " nowadays because it's old and it's been fixed. So I needed to find something that was adapted"
    },
    {
      "Time_Start": 1188.88,
      "Time_End": 1193.6000000000001,
      "Text": " by everyone, everybody loved it and trusted it, and they thought it was nice."
    },
    {
      "Time_Start": 1194.72,
      "Time_End": 1200.5600000000002,
      "Text": " That we could weaponize. Why not? Because we are Trixie Hobbit sissies."
    },
    {
      "Time_Start": 1202.4,
      "Time_End": 1207.7600000000002,
      "Text": " And I found OSC 8. I'm like, cool. If you ever run PowerShell and you mess that up,"
    },
    {
      "Time_Start": 1207.7600000000002,
      "Time_End": 1212.0,
      "Text": " you'll get this prompt coming back that says, you suck. Click this link and somebody's going"
    },
    {
      "Time_Start": 1212.0,
      "Time_End": 1216.96,
      "Text": " to tell you how to do it. I'm like, cool. That seems doable. And the reason why that works is"
    },
    {
      "Time_Start": 1216.96,
      "Time_End": 1222.64,
      "Text": " because you have this ANSI escape sequence that gives you the HTTP thing and then it has the"
    },
    {
      "Time_Start": 1222.64,
      "Time_End": 1226.48,
      "Text": " title or whatever you want to print out and you close it off and it turns into this link"
    },
    {
      "Time_Start": 1226.48,
      "Time_End": 1234.32,
      "Text": " inside your terminal. And that's great. Initially, that was only allowed to use URI like HTTP and"
    },
    {
      "Time_Start": 1234.32,
      "Time_End": 1241.8400000000001,
      "Text": " HTTPS. But recently, the fine people over at Windows Terminal decided that we should allow"
    },
    {
      "Time_Start": 1241.9199999999998,
      "Time_End": 1248.9599999999998,
      "Text": " file 2. That's even a great idea. Because what could even happen if you typed in CMD there and"
    },
    {
      "Time_Start": 1248.9599999999998,
      "Time_End": 1256.8,
      "Text": " clicked it? I wonder. Fun things popping inside user space. And even though this is kind of"
    },
    {
      "Time_Start": 1256.8,
      "Time_End": 1262.8,
      "Text": " filtered in a way where you can start CMD but you can't use any parameters, I'm willing to guess"
    },
    {
      "Time_Start": 1262.8,
      "Time_End": 1267.36,
      "Text": " that some smart person in here is going to figure out how to bypass that, put a link in and pop"
    },
    {
      "Time_Start": 1267.3600000000001,
      "Time_End": 1274.64,
      "Text": " shells. It's definitely doable. And the fun thing with OC8 is if you don't terminate it correctly,"
    },
    {
      "Time_Start": 1274.64,
      "Time_End": 1280.64,
      "Text": " you remember what we did with the green when it all went hulk everywhere? If we don't terminate"
    },
    {
      "Time_Start": 1280.64,
      "Time_End": 1287.1200000000001,
      "Text": " it correctly, the rest of the output starting from that injection is going to be one big link."
    },
    {
      "Time_Start": 1287.1200000000001,
      "Time_End": 1291.44,
      "Text": " Everything is going to be a link. And if you click that, some terminals will be very nice for"
    },
    {
      "Time_Start": 1291.52,
      "Time_End": 1298.3200000000002,
      "Text": " you and just block that out with a warning. And I figure that, okay, that's cool. I wonder if I"
    },
    {
      "Time_Start": 1298.3200000000002,
      "Time_End": 1302.8,
      "Text": " can inject this somewhere. Because obviously me putting links on my own shit would be boring. So"
    },
    {
      "Time_Start": 1303.6000000000001,
      "Time_End": 1307.8400000000001,
      "Text": " what happens if I put that inside Docker? Well, everything is going to turn into one big link"
    },
    {
      "Time_Start": 1307.8400000000001,
      "Time_End": 1313.76,
      "Text": " there, too. And that one has a protection in. But it's not everywhere this turns into a protection"
    },
    {
      "Time_Start": 1313.76,
      "Time_End": 1318.4,
      "Text": " because injections can be put in different places and then suddenly you can click links and you can"
    },
    {
      "Time_Start": 1318.4,
      "Time_End": 1328.5600000000002,
      "Text": " imagine how fun this could be. But that wasn't enough for people. Because, you know, text is"
    },
    {
      "Time_Start": 1328.5600000000002,
      "Time_End": 1335.3600000000001,
      "Text": " cool, but inline image support, that's definitely something we need in text space. So the Windows"
    },
    {
      "Time_Start": 1335.3600000000001,
      "Time_End": 1340.4,
      "Text": " Terminal people, they decided to adapt the inline support for it in the recent build where you're"
    },
    {
      "Time_Start": 1340.4,
      "Time_End": 1347.92,
      "Text": " able to have six cell and inline support inside the terminal. And that's great. I see no problem"
    },
    {
      "Time_Start": 1347.92,
      "Time_End": 1352.48,
      "Text": " with that. I think that's great. I just wonder what's going to be inside this log file."
    },
    {
      "Time_Start": 1355.2,
      "Time_End": 1358.72,
      "Text": " So can I get a raise of hands of how many of you wants to see what's in that log file?"
    },
    {
      "Time_Start": 1360.88,
      "Time_End": 1366.4,
      "Text": " I love you. And it's not what you thought it would be. Shame on you!"
    },
    {
      "Time_Start": 1370.24,
      "Time_End": 1374.88,
      "Text": " Then we have OC52, which is great. If you ever used Tmarks or anything and back in the days"
    },
    {
      "Time_Start": 1374.88,
      "Time_End": 1382.0800000000002,
      "Text": " you weren't able to copy paste between shells, sucked. Now you can. The reason is OC52. And what"
    },
    {
      "Time_Start": 1382.0800000000002,
      "Time_End": 1388.0800000000002,
      "Text": " it does is that it takes this sequence, if you have something base 64 coded, it's going to put"
    },
    {
      "Time_Start": 1388.0800000000002,
      "Time_End": 1394.24,
      "Text": " that inside user space clipboard. Super sweet. Great. I wonder what happens if we do open a"
    },
    {
      "Time_Start": 1394.24,
      "Time_End": 1399.0400000000002,
      "Text": " something calculator app and a new line on the end because we need that new line. If you put that"
    },
    {
      "Time_Start": 1399.04,
      "Time_End": 1405.28,
      "Text": " into CSH and paste it, this is what's going to happen. It requires the users to do something."
    },
    {
      "Time_Start": 1405.92,
      "Time_End": 1411.52,
      "Text": " And you press that, boom, okay, it pops calc. But if you do the same thing in Bash, Bash honors the"
    },
    {
      "Time_Start": 1411.52,
      "Time_End": 1420.08,
      "Text": " new line. So if you just paste it straight in there, it fires it directly. There are room for"
    },
    {
      "Time_Start": 1420.08,
      "Time_End": 1425.44,
      "Text": " improvement here, though. So I figured I wonder how can I test this in different spaces. I did"
    },
    {
      "Time_Start": 1425.44,
      "Time_End": 1430.16,
      "Text": " this kind of base 64 string with these commands in it and said I'm curious what's going to happen."
    },
    {
      "Time_Start": 1430.16,
      "Time_End": 1434.88,
      "Text": " And I started to paste that in different places. Docker, that fired directly. That was nice. VS"
    },
    {
      "Time_Start": 1434.88,
      "Time_End": 1439.44,
      "Text": " code, it did it differently depending on what kind of shell you're using. And even in some cases"
    },
    {
      "Time_Start": 1439.44,
      "Time_End": 1445.52,
      "Text": " gave you this warning, which is super good. Of course with your own people. Terminal.app honors"
    },
    {
      "Time_Start": 1445.52,
      "Time_End": 1451.8400000000001,
      "Text": " it, runs it directly. And even, you know, inside Windows Terminal you will get even this preview"
    },
    {
      "Time_Start": 1451.84,
      "Time_End": 1456.56,
      "Text": " of showing things that are bad. And the reason for that is that if you wanted to run this command"
    },
    {
      "Time_Start": 1456.56,
      "Time_End": 1461.12,
      "Text": " 10 lines and do whom I, Windows Terminal is going to be nice of you to show the first lines and tell"
    },
    {
      "Time_Start": 1461.12,
      "Time_End": 1468.1599999999999,
      "Text": " you, yeah, you got your shit going on here. So why not just add seven lines of nothing and see"
    },
    {
      "Time_Start": 1468.1599999999999,
      "Time_End": 1474.0,
      "Text": " what happens? Well, it's nothing in there. And everybody knows that nobody is going to scroll"
    },
    {
      "Time_Start": 1474.0,
      "Time_End": 1479.76,
      "Text": " down. And what happens if you add 400 lines in there? Nobody ever going to scroll down. Or you"
    },
    {
      "Time_Start": 1479.84,
      "Time_End": 1484.96,
      "Text": " can even in this add some kind of those ULA things. Then people just press okay."
    },
    {
      "Time_Start": 1487.92,
      "Time_End": 1491.76,
      "Text": " So with that in there, it's going to be okay just running it. I think that's pretty cool. It's a"
    },
    {
      "Time_Start": 1491.76,
      "Time_End": 1495.52,
      "Text": " decent thing. So I think, okay, so I have this sort of thing for Windows Terminal. I've got one"
    },
    {
      "Time_Start": 1495.52,
      "Time_End": 1502.4,
      "Text": " for Bash. Let's create a polyglot and see what happens. So I figured that why not have a little"
    },
    {
      "Time_Start": 1502.4,
      "Time_End": 1508.16,
      "Text": " bit of an SVG in there. You stop that one off with a good old hash mark at the end. Do a curl"
    },
    {
      "Time_Start": 1508.16,
      "Time_End": 1512.8000000000002,
      "Text": " command. Obviously, we want this to run locally and not fuck around on the interwebs. And then"
    },
    {
      "Time_Start": 1512.8000000000002,
      "Time_End": 1517.8400000000001,
      "Text": " we do a PowerShell kind of mix where we're using CMD that calls PowerShell and stuff because we"
    },
    {
      "Time_Start": 1517.8400000000001,
      "Time_End": 1522.48,
      "Text": " want it to work in whatever kind of environment you end up in. And we want to exfiltrate stuff"
    },
    {
      "Time_Start": 1522.48,
      "Time_End": 1528.4,
      "Text": " to know what's happening. So here's the hash that's important. And then eventually this last"
    },
    {
      "Time_Start": 1528.4,
      "Time_End": 1536.4,
      "Text": " one here. Encode that into one big basic support thing and just send that to bad log, cat bad log,"
    },
    {
      "Time_Start": 1536.48,
      "Time_End": 1541.92,
      "Text": " and then start pasting it in places. Well, it obviously worked there. This removed all the"
    },
    {
      "Time_Start": 1541.92,
      "Time_End": 1547.0400000000002,
      "Text": " info in the beginning. It's going to pop here too. And if you go to the browser and you paste"
    },
    {
      "Time_Start": 1547.0400000000002,
      "Time_End": 1553.1200000000001,
      "Text": " that in, you have some JavaScript running, which is great. Then you can just refresh it here and"
    },
    {
      "Time_Start": 1553.1200000000001,
      "Time_End": 1558.3200000000002,
      "Text": " you'll see that, okay, it's running who am I and different other kind of stuff in there that's"
    },
    {
      "Time_Start": 1558.3200000000002,
      "Time_End": 1565.2,
      "Text": " just exfiltrating stuff for you inside the request. And this is just being dormant in some poor"
    },
    {
      "Time_Start": 1565.2,
      "Time_End": 1569.68,
      "Text": " bastard's clipboard by just interacting with the file. Because you can sit there and work, you"
    },
    {
      "Time_Start": 1569.68,
      "Time_End": 1576.0800000000002,
      "Text": " catch something, and you decide to paste and boom, it's all you. It's not limited there."
    },
    {
      "Time_Start": 1576.0800000000002,
      "Time_End": 1580.88,
      "Text": " Obviously you can exfiltrate stuff like sending things out and do reverse shells and all that. I"
    },
    {
      "Time_Start": 1580.88,
      "Time_End": 1586.0,
      "Text": " didn't go through that in this demo. You are smart people. You know what to do. But if we're"
    },
    {
      "Time_Start": 1586.0,
      "Time_End": 1592.0800000000002,
      "Text": " doing this, we might want to hide our tracks or just mess things up because we can. And there's"
    },
    {
      "Time_Start": 1592.1599999999999,
      "Time_End": 1596.6399999999999,
      "Text": " different ways to do this. You can use everything from just moving the cursor to a certain"
    },
    {
      "Time_Start": 1596.6399999999999,
      "Time_End": 1601.6,
      "Text": " position. You can clear the screen. You can erase stuff or clear the scroll buffer. And to"
    },
    {
      "Time_Start": 1601.6,
      "Time_End": 1606.48,
      "Text": " showcase this, I'm just putting like 15 lines here on the screen for you. And then we're just"
    },
    {
      "Time_Start": 1606.48,
      "Time_End": 1611.52,
      "Text": " going to run the command and it's empty. And that's perfect to have a proof of concept myself."
    },
    {
      "Time_Start": 1611.52,
      "Time_End": 1616.72,
      "Text": " But what happens if we run that inside, let's say, this Docker instance and we send in the"
    },
    {
      "Time_Start": 1616.72,
      "Time_End": 1622.16,
      "Text": " reset screen and you just go back? Well, this is what's going to happen. It empties the log"
    },
    {
      "Time_Start": 1622.16,
      "Time_End": 1629.3600000000001,
      "Text": " file for you. And every time you load it, all the way up to that's getting rendered, it's going"
    },
    {
      "Time_Start": 1629.3600000000001,
      "Time_End": 1634.96,
      "Text": " to clean it anyway for you. So you need to sanitize and clean that out. Fun. And that is"
    },
    {
      "Time_Start": 1634.96,
      "Time_End": 1640.64,
      "Text": " somewhat annoying. For anyone that's using that, that's really annoying. But it's not annoying"
    },
    {
      "Time_Start": 1640.72,
      "Time_End": 1647.1200000000001,
      "Text": " enough. We need to DOS and brick stuff to really be annoying. And why not use the standard? We"
    },
    {
      "Time_Start": 1647.1200000000001,
      "Time_End": 1651.68,
      "Text": " have this print screen functionality that gives us the opportunity, if we're typing that one in,"
    },
    {
      "Time_Start": 1651.68,
      "Time_End": 1658.8000000000002,
      "Text": " it will ping, sending the printer prompt for you. Imagine getting that every minute or so. It can"
    },
    {
      "Time_Start": 1658.8000000000002,
      "Time_End": 1666.0,
      "Text": " be annoying. But you can also do this cool thing. Instead of doing the 0i, you can do 5i. Because"
    },
    {
      "Time_Start": 1666.0,
      "Time_End": 1672.56,
      "Text": " back in the day, we used to have matrix printers next to our computers that were like, eh, eh, eh,"
    },
    {
      "Time_Start": 1672.56,
      "Time_End": 1677.6,
      "Text": " having a paper copy of said log. We don't have those anymore. So we can't send anything out to"
    },
    {
      "Time_Start": 1677.6,
      "Time_End": 1681.52,
      "Text": " this buffer that doesn't exist, which means, as you can see here, if you send it in, all the"
    },
    {
      "Time_Start": 1681.52,
      "Time_End": 1686.64,
      "Text": " commands are going to send it toopian and it's still going to render, but you can't see shit. So"
    },
    {
      "Time_Start": 1686.64,
      "Time_End": 1692.48,
      "Text": " that's really annoying. And the only way to get rid of that is to close the browser. But it's not"
    },
    {
      "Time_Start": 1692.48,
      "Time_End": 1698.08,
      "Text": " annoying enough. No, we need to be really annoying. And one way to do that is to use the"
    },
    {
      "Time_Start": 1698.08,
      "Time_End": 1702.64,
      "Text": " mouse tracking functionality, which was great. If you ever installed some kind of, I don't know,"
    },
    {
      "Time_Start": 1702.64,
      "Time_End": 1708.96,
      "Text": " Slackware or something or whatever, Debian, and you're in that CLI mode and you suddenly realize"
    },
    {
      "Time_Start": 1708.96,
      "Time_End": 1714.4,
      "Text": " my mouse works and I can click on stuff, that's cool. That is the reason because somebody's"
    },
    {
      "Time_Start": 1714.4,
      "Time_End": 1722.16,
      "Text": " tracking where your mouse are in that state. And if you run that on the terminal and move your"
    },
    {
      "Time_Start": 1722.16,
      "Time_End": 1725.44,
      "Text": " mouse around, it's going to report all that stuff all the time. And if you click, it's going to"
    },
    {
      "Time_Start": 1725.44,
      "Time_End": 1731.52,
      "Text": " execute whatever kind of happened there. And what's really interesting when doing this is that"
    },
    {
      "Time_Start": 1731.52,
      "Time_End": 1734.48,
      "Text": " imagine you're sneaking some other shit in there and somebody clicks stuff and then,"
    },
    {
      "Time_Start": 1734.48,
      "Time_End": 1741.2,
      "Text": " boop, it's going to pop it. Fun. And if you combine those, you see where I'm going, a bunch"
    },
    {
      "Time_Start": 1741.2,
      "Time_End": 1746.0800000000002,
      "Text": " of chains here. You can just combine those things together and just create a lot of interesting"
    },
    {
      "Time_Start": 1746.08,
      "Time_End": 1752.3999999999999,
      "Text": " stuff. But then I stumbled upon this one here. Looks so sweet. And it's perfect. Repeat the"
    },
    {
      "Time_Start": 1752.3999999999999,
      "Time_End": 1757.6799999999998,
      "Text": " preceding graphic character X amount of times. And that is perfect. You want to measure how"
    },
    {
      "Time_Start": 1757.6799999999998,
      "Time_End": 1763.76,
      "Text": " big the terminal screen are. And so in this case, let's see that we wanted to repeat this 10 times."
    },
    {
      "Time_Start": 1764.48,
      "Time_End": 1769.9199999999998,
      "Text": " It's going to do it 10 times for us in the output of the terminal. But one simply wonders."
    },
    {
      "Time_Start": 1769.92,
      "Time_End": 1779.6000000000001,
      "Text": " A billion times is a lot of fucking piece. And since this is not a single character,"
    },
    {
      "Time_Start": 1779.6000000000001,
      "Time_End": 1787.28,
      "Text": " this is Unicode, you get five characters for the price of one. And my recommendation to you is do"
    },
    {
      "Time_Start": 1787.28,
      "Time_End": 1795.04,
      "Text": " not run this in prod. Things will break. Like, I can't open this Docker container again without"
    },
    {
      "Time_Start": 1795.04,
      "Time_End": 1800.24,
      "Text": " it crashing. And when it crashes, it kills Docker desktops. I need to start it all over again."
    },
    {
      "Time_Start": 1801.44,
      "Time_End": 1815.12,
      "Text": " It can be somewhat annoying. Thank you. So it breaks most terminal. And some terminals,"
    },
    {
      "Time_Start": 1815.12,
      "Time_End": 1820.96,
      "Text": " even like the one I have on my phone here, it crashes that one. So once again, I'm starting"
    },
    {
      "Time_Start": 1820.96,
      "Time_End": 1825.76,
      "Text": " to think, okay, that's cool. I wonder what happens. What can I do to weaponize this?"
    },
    {
      "Time_Start": 1828.32,
      "Time_End": 1836.72,
      "Text": " Maybe if I put it in my service signature on a host and then request a let's encrypt certificate."
    },
    {
      "Time_Start": 1836.72,
      "Time_End": 1843.2,
      "Text": " I wonder if the bots will come running. I'm betting you there's a bunch of fucking"
    },
    {
      "Time_Start": 1843.2,
      "Time_End": 1846.88,
      "Text": " automation scripts that's going to scrape and look for kind of version I'm running"
    },
    {
      "Time_Start": 1846.88,
      "Time_End": 1850.48,
      "Text": " that's going to get dosed out whenever somebody decides to look at that entry."
    },
    {
      "Time_Start": 1851.3600000000001,
      "Time_End": 1865.6000000000001,
      "Text": " Real fun. Okay. You got a question, scary looking kid? No RCE? No. I know. I wasn't able to do any"
    },
    {
      "Time_Start": 1865.6000000000001,
      "Time_End": 1871.76,
      "Text": " kind of arbitrary command injection. Sucks. I got malicious stuff but not really bad stuff."
    },
    {
      "Time_Start": 1871.76,
      "Time_End": 1879.3600000000001,
      "Text": " So these were dark times in the middle of my research. The light came in the shape of David"
    },
    {
      "Time_Start": 1879.3600000000001,
      "Time_End": 1886.2400000000002,
      "Text": " Leadbeater. And he's an amazing fucking dog, sorry, part of my French, at Blue Hat 23 called"
    },
    {
      "Time_Start": 1886.2400000000002,
      "Time_End": 1893.6000000000001,
      "Text": " Houdini in the Terminal where he doesn't provide just one. No, he brings on six remote code"
    },
    {
      "Time_Start": 1893.6000000000001,
      "Time_End": 1900.96,
      "Text": " executions in terminals that are live today. I'm like, mm, tasty. David knows stuff. And he's"
    },
    {
      "Time_Start": 1900.96,
      "Time_End": 1904.88,
      "Text": " doing that, but I'll use kind of the same thing that I did more back in the days with this"
    },
    {
      "Time_Start": 1904.96,
      "Time_End": 1909.5200000000002,
      "Text": " CRLF injection. But he's using something called device control request string. I'm not going to"
    },
    {
      "Time_Start": 1909.5200000000002,
      "Time_End": 1916.4,
      "Text": " try to pronounce that. If you want to check out his Git repo, it's really, really good. He's got a"
    },
    {
      "Time_Start": 1916.4,
      "Time_End": 1924.4,
      "Text": " lot of cool stuff there. And he's speaking tomorrow here. So please go visit that talk. I'm"
    },
    {
      "Time_Start": 1924.4,
      "Time_End": 1930.5600000000002,
      "Text": " sure I'm going to be there. And the yield sign voice is definitely going to be there because he's"
    },
    {
      "Time_Start": 1930.56,
      "Time_End": 1936.1599999999999,
      "Text": " going to release some banger stuff, and you don't want to miss that. So this is all David's"
    },
    {
      "Time_Start": 1936.1599999999999,
      "Time_End": 1940.72,
      "Text": " work, but I'm going to show it now because, hey, why not? So I figured that he had this thing"
    },
    {
      "Time_Start": 1940.72,
      "Time_End": 1946.32,
      "Text": " provided. I needed to put that in a way that I could infiltrate others. So basics for the string"
    },
    {
      "Time_Start": 1946.32,
      "Time_End": 1951.44,
      "Text": " here, more or less this is kind of what it does. It sends in a bunch of control sequences and"
    },
    {
      "Time_Start": 1951.44,
      "Time_End": 1956.1599999999999,
      "Text": " stuff. I'm not going to bore you with that, but more or less what it does, it asks you what kind"
    },
    {
      "Time_Start": 1956.16,
      "Time_End": 1961.68,
      "Text": " of color you have on the screen, but we're feeding that with other stuff instead and then adding"
    },
    {
      "Time_Start": 1961.68,
      "Time_End": 1970.64,
      "Text": " new lines and voila, fun stuff. So if you're using version 3.17 of iTerm, which is not the newest"
    },
    {
      "Time_Start": 1970.64,
      "Time_End": 1977.6000000000001,
      "Text": " one, it's been patched now, and you're interacting with the logs using this docker, what's going to"
    },
    {
      "Time_Start": 1977.6000000000001,
      "Time_End": 1983.1200000000001,
      "Text": " happen if I paste that inside your terminal and you're running that live tail? I'm going to pop"
    },
    {
      "Time_Start": 1983.1200000000001,
      "Time_End": 1990.0000000000002,
      "Text": " calc for you. Why not? Super simple way to just make sure that things break. So update your iTerms,"
    },
    {
      "Time_Start": 1990.0000000000002,
      "Time_End": 1994.8000000000002,
      "Text": " people, if you're playing around with that. And the reason why this is working, and I love this,"
    },
    {
      "Time_Start": 1995.3600000000001,
      "Time_End": 2003.1200000000001,
      "Text": " is simply because what David figured out is that he could sneak in x03 here, which is control C"
    },
    {
      "Time_Start": 2003.1200000000001,
      "Time_End": 2008.0000000000002,
      "Text": " kind of thing, or control X. So you're escaping out of whatever thing that's running, and imagine"
    },
    {
      "Time_Start": 2008.08,
      "Time_End": 2013.44,
      "Text": " what happens if you're trying to escape out of a docker attach sequence. It's going to shut down"
    },
    {
      "Time_Start": 2013.44,
      "Time_End": 2020.8,
      "Text": " the docker. And after that, we're adding whatever command that we want to run, and then simply we're"
    },
    {
      "Time_Start": 2020.8,
      "Time_End": 2027.2,
      "Text": " going back again, and it tells the system, could you please report back for us whatever kind of"
    },
    {
      "Time_Start": 2027.2,
      "Time_End": 2032.16,
      "Text": " color that we're running? But we already tainted that with other stuff, so it's just going to boom,"
    },
    {
      "Time_Start": 2032.16,
      "Time_End": 2039.0400000000002,
      "Text": " which is great. And for me, David was this kind of Mike Metzger moment for me when he did that"
    },
    {
      "Time_Start": 2039.0400000000002,
      "Time_End": 2045.68,
      "Text": " stuff, because what Mike did for the motocross circuit was that just before he did the first"
    },
    {
      "Time_Start": 2045.68,
      "Time_End": 2050.8,
      "Text": " backflip in competition, it was like rumors and shit, and nobody thought it would even be remotely"
    },
    {
      "Time_Start": 2050.8,
      "Time_End": 2060.0,
      "Text": " possible. But as soon as he did that, today if you're not doing like a double flip, you suck."
    },
    {
      "Time_Start": 2060.96,
      "Time_End": 2067.2,
      "Text": " So that was kind of the opener. So I started to look at this, OSC 51.13, which I thought was like,"
    },
    {
      "Time_Start": 2067.2,
      "Time_End": 2072.56,
      "Text": " Kitty has this proprietary escape code. I wonder what that does. And what I figured out real fast"
    },
    {
      "Time_Start": 2072.56,
      "Time_End": 2080.64,
      "Text": " is that test here reflects back in the flow. So I'm starting to think, what happens if we add a new"
    },
    {
      "Time_Start": 2080.64,
      "Time_End": 2087.36,
      "Text": " line and open a bit of calculator there and send that away? Well, let's see what happens. What's"
    },
    {
      "Time_Start": 2087.44,
      "Time_End": 2091.2000000000003,
      "Text": " going to happen first is it's going to give you a request. Are you really sure you want to do this?"
    },
    {
      "Time_Start": 2091.2000000000003,
      "Time_End": 2104.7200000000003,
      "Text": " You said no, but you got a calculator. Because he's adding new lines and he's honoring them."
    },
    {
      "Time_Start": 2104.7200000000003,
      "Time_End": 2110.4,
      "Text": " Time is running out. Thanks, babe. The other one here, and I know you said, yeah, but you"
    },
    {
      "Time_Start": 2110.4,
      "Time_End": 2117.1200000000003,
      "Text": " pressed no. What happens if you press yes? Well, I can figure out it's the same. No escaping here."
    },
    {
      "Time_Start": 2118.1600000000003,
      "Time_End": 2124.6400000000003,
      "Text": " Yield time, boys. Fuck yeah. I thought that was sweet. So now I'm getting hyped and I'm all happy"
    },
    {
      "Time_Start": 2124.6400000000003,
      "Time_End": 2129.6,
      "Text": " about it. And this shows the whole proof of concept. Is it actually possible to execute"
    },
    {
      "Time_Start": 2129.6,
      "Time_End": 2136.56,
      "Text": " commands in the victim terminal? And the short answer to this is yes. But whose fault is it?"
    },
    {
      "Time_Start": 2137.52,
      "Time_End": 2143.2000000000003,
      "Text": " This conversation has been going on for like the last 10, 20 years. Because every 10 years or so,"
    },
    {
      "Time_Start": 2143.2000000000003,
      "Time_End": 2147.28,
      "Text": " somebody's going to poke around at this stuff. And the terminal developers are going to say,"
    },
    {
      "Time_Start": 2147.76,
      "Time_End": 2154.88,
      "Text": " it is the developer's fault. They need to do their shit. The app people say, no, it's the terminal"
    },
    {
      "Time_Start": 2154.88,
      "Time_End": 2161.92,
      "Text": " people. They need to stop using escape sequences at all. It's a terrible idea. But we all use them"
    },
    {
      "Time_Start": 2161.92,
      "Time_End": 2167.76,
      "Text": " all the time. And then there's the third part. It's these super angry old developers that are"
    },
    {
      "Time_Start": 2167.76,
      "Time_End": 2174.0,
      "Text": " sitting in the back ICU that thinks that everyone with a brain knows that you can't just cut the"
    },
    {
      "Time_Start": 2174.0,
      "Time_End": 2182.0,
      "Text": " file or click on an email link. But that's simply not true. Because we are cybersecurity"
    },
    {
      "Time_Start": 2182.0,
      "Time_End": 2188.0,
      "Text": " professional, some more malicious ones, and we need to protect our users, especially our shell"
    },
    {
      "Time_Start": 2188.0,
      "Time_End": 2193.84,
      "Text": " users, because they also are privileged users using these systems on a daily basis. And they"
    },
    {
      "Time_Start": 2193.84,
      "Time_End": 2199.76,
      "Text": " should be able to grab cat, ork, jq, whatever shit that's running inside the terminal without"
    },
    {
      "Time_Start": 2199.76,
      "Time_End": 2206.1600000000003,
      "Text": " any issues, especially if they're downloading files from a third party that took care of them."
    },
    {
      "Time_Start": 2206.1600000000003,
      "Time_End": 2211.76,
      "Text": " And the only way to do that is that we need to sanitize our input and escape our output. And if"
    },
    {
      "Time_Start": 2211.76,
      "Time_End": 2216.96,
      "Text": " we don't do that, it's going to be consequences. And I figured it would be kind of cool, what"
    },
    {
      "Time_Start": 2216.96,
      "Time_End": 2223.76,
      "Text": " happens if I took this web page and stuck a bunch of different kind of escape sequences in there"
    },
    {
      "Time_Start": 2223.76,
      "Time_End": 2228.96,
      "Text": " and see what happens? So I created this evil.terminalinjection.com site. So if you curl"
    },
    {
      "Time_Start": 2228.96,
      "Time_End": 2233.76,
      "Text": " that inside your terminal, any of them, you can see what happens. It's not going to do anything"
    },
    {
      "Time_Start": 2233.76,
      "Time_End": 2240.64,
      "Text": " bad stuff for you. It's going to pop a calc if you're vulnerable. But I'm not exfiltrating your"
    },
    {
      "Time_Start": 2240.64,
      "Time_End": 2245.76,
      "Text": " data. You can just right-click the source and see what's in there. It's cool. And if you run"
    },
    {
      "Time_Start": 2245.76,
      "Time_End": 2251.2,
      "Text": " that on some systems, it's going to be all right. On other systems, when you do it, it's not going"
    },
    {
      "Time_Start": 2251.2,
      "Time_End": 2257.52,
      "Text": " to be as such all right. So it's kind of trusted things, but they will break stuff. So if we're"
    },
    {
      "Time_Start": 2257.52,
      "Time_End": 2262.24,
      "Text": " doing black box testing on this, the whole game, if you're hunting for bugs, is going to 400,"
    },
    {
      "Time_Start": 2262.24,
      "Time_End": 2268.24,
      "Text": " 500 errors, because 200 errors usually ends up in access logs, and those are well sanitized and"
    },
    {
      "Time_Start": 2268.24,
      "Time_End": 2273.52,
      "Text": " nice and all. So the easiest way to do this, to break stuff, is to take whatever kind of thing"
    },
    {
      "Time_Start": 2273.52,
      "Time_End": 2278.4,
      "Text": " you have here. This is an API JSON request. You have a key and some value stuff, and you just"
    },
    {
      "Time_Start": 2278.4,
      "Time_End": 2284.16,
      "Text": " append shit on the end and see what happens. Sometimes it will break, and you will get some"
    },
    {
      "Time_Start": 2284.16,
      "Time_End": 2289.44,
      "Text": " information coming back. And if it does contain something like unescaped stuff, because this one"
    },
    {
      "Time_Start": 2289.44,
      "Time_End": 2295.12,
      "Text": " here is a big chance that it actually ended up in the error log, this one here, though, is"
    },
    {
      "Time_Start": 2295.12,
      "Time_End": 2303.04,
      "Text": " properly escaped. So it's a good job on the devs. Fuck yeah. But sometimes, you know, you put that"
    },
    {
      "Time_Start": 2303.04,
      "Time_End": 2308.3199999999997,
      "Text": " stuff in, and it's going to sanitize with a backslash. So why not put some invisible characters"
    },
    {
      "Time_Start": 2308.3199999999997,
      "Time_End": 2313.04,
      "Text": " and hex in there? The result is going to be really interesting, because then it might just render"
    },
    {
      "Time_Start": 2313.04,
      "Time_End": 2319.68,
      "Text": " anyway, because you're bypassing the whole backslash scenario. Okay. This is very prone to"
    },
    {
      "Time_Start": 2319.68,
      "Time_End": 2325.68,
      "Text": " false positives. So sometimes the developers are really good at just filtrating what kind of output"
    },
    {
      "Time_Start": 2325.68,
      "Time_End": 2330.24,
      "Text": " comes out, stripping the error message, and they're even not displaying any data. We saw that in"
    },
    {
      "Time_Start": 2330.24,
      "Time_End": 2336.08,
      "Text": " the beginning. It was an error, but nothing happened, but it smashed the log. Boom. So even though,"
    },
    {
      "Time_Start": 2336.08,
      "Time_End": 2342.16,
      "Text": " you know, you need to take that into consideration. And even though if you see like 400 errors,"
    },
    {
      "Time_Start": 2342.16,
      "Time_End": 2346.8799999999997,
      "Text": " they're rarely logged, so 500 errors is what you're going to be looking for. But this seems to"
    },
    {
      "Time_Start": 2346.8799999999997,
      "Time_End": 2354.8799999999997,
      "Text": " be everywhere. Everywhere I looked, it just pops and scrambles. And before you create this nuclei"
    },
    {
      "Time_Start": 2354.8799999999997,
      "Time_End": 2359.12,
      "Text": " template and go all brr all over the internet, hoping that it's going to end up in somebody's"
    },
    {
      "Time_Start": 2359.12,
      "Time_End": 2365.44,
      "Text": " log somewhere, to verify this, you will need to have access to the access logs and just dig into"
    },
    {
      "Time_Start": 2365.44,
      "Time_End": 2368.96,
      "Text": " that, because otherwise it would be a false positive, because if I wrote the logging system"
    },
    {
      "Time_Start": 2369.04,
      "Time_End": 2374.8,
      "Text": " and I didn't log any output, you can say that it renders, but it's not. So time's running out."
    },
    {
      "Time_Start": 2374.8,
      "Time_End": 2384.16,
      "Text": " Let's recap real fast on this. People forget. The old is the new new. There's way more things"
    },
    {
      "Time_Start": 2384.16,
      "Time_End": 2389.04,
      "Text": " that's going to come in this area. I hope you are intrigued now to start poking in this, and"
    },
    {
      "Time_Start": 2389.04,
      "Time_End": 2394.0,
      "Text": " let's create a community around this and see whatever fun stuff we can do. And it's like"
    },
    {
      "Time_Start": 2394.0,
      "Time_End": 2398.64,
      "Text": " everywhere. Like I told you, I created this nuclei template, and when I ran it, it rendered in there."
    },
    {
      "Time_Start": 2398.96,
      "Time_End": 2406.88,
      "Text": " That can be problematic. So if something's like meh today, it can easily turn into oh crap"
    },
    {
      "Time_Start": 2408.0,
      "Time_End": 2412.7200000000003,
      "Text": " by tomorrow if somebody decides to put a bunch of creativity in it."
    },
    {
      "Time_Start": 2414.96,
      "Time_End": 2420.4,
      "Text": " That means your log files, do you still trust them?"
    },
    {
      "Time_Start": 2420.4,
      "Time_End": 2425.84,
      "Text": " I'm stuck with all the social media. Thank you for attending my talk."
    }
  ]
}