{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hi, everyone. As Monkey mentioned, I've been here before. I think this is my fifth time"
    },
    {
      "Time_Start": 8.48,
      "Time_End": 14.200000000000001,
      "Text": " presenting here at DEF CON, and I'm pretty excited to be back. I'm getting to see some"
    },
    {
      "Time_Start": 14.200000000000001,
      "Time_End": 18.0,
      "Text": " friends I haven't seen in a long time. It's been about eight years since I've been to"
    },
    {
      "Time_Start": 18.0,
      "Time_End": 24.16,
      "Text": " DEF CON, but I've been coming since 1999, if you can figure out then how old I am, which"
    },
    {
      "Time_Start": 24.16,
      "Time_End": 28.6,
      "Text": " means it was a long time ago. But I continue coming back because I really love this crowd"
    },
    {
      "Time_Start": 28.6,
      "Time_End": 33.04,
      "Text": " and I love the skill set you all have, because I know the kind of amazing work you do, and"
    },
    {
      "Time_Start": 33.04,
      "Time_End": 38.68,
      "Text": " I'm going to talk to you about some stuff we're doing at UC Berkeley, and also with"
    },
    {
      "Time_Start": 38.68,
      "Time_End": 44.44,
      "Text": " a fantastic nonprofit. So before I start the slides, I met Austin at ShmooCon, and he got"
    },
    {
      "Time_Start": 44.44,
      "Time_End": 49.08,
      "Text": " up and gave this really great presentation. I'm not lying, it was good, and it was enough"
    },
    {
      "Time_Start": 49.08,
      "Time_End": 53.6,
      "Text": " to say, well, I want to volunteer for him, for his nonprofit, what he's doing. So he's"
    },
    {
      "Time_Start": 53.6,
      "Time_End": 59.52,
      "Text": " combating human trafficking using skill sets that you all have. Intel analysts, if you're"
    },
    {
      "Time_Start": 59.52,
      "Time_End": 65.08,
      "Text": " a red team type of person, the way that you solve problems, we know, is extraordinary."
    },
    {
      "Time_Start": 65.08,
      "Time_End": 71.48,
      "Text": " And we'd like to talk to you about some stuff that we do, both at UC Berkeley and his nonprofit."
    },
    {
      "Time_Start": 71.48,
      "Time_End": 75.52000000000001,
      "Text": " So let me get started. Yes, we're going to be talking about subverting authoritarian"
    },
    {
      "Time_Start": 75.52000000000001,
      "Time_End": 82.08,
      "Text": " regimes and getting to some of the organizers of human trafficking and some of the organizers"
    },
    {
      "Time_Start": 82.12,
      "Time_End": 87.56,
      "Text": " of, well, I'll show you. We have some interesting clients we've had at UC Berkeley's Citizen"
    },
    {
      "Time_Start": 87.56,
      "Time_End": 92.12,
      "Text": " Clinic. Now, a lot of you might have heard about Citizen Lab up in Toronto. We are different"
    },
    {
      "Time_Start": 92.12,
      "Time_End": 96.44,
      "Text": " at UC Berkeley. What we do is we take, I'll go through the slides and I'll show you a"
    },
    {
      "Time_Start": 96.44,
      "Time_End": 101.28,
      "Text": " little bit more about it, but we take nonprofits that are high risk, and I'll explain to you"
    },
    {
      "Time_Start": 101.28,
      "Time_End": 105.52,
      "Text": " what that means. And when I took over the class about three years ago, I kind of upped"
    },
    {
      "Time_Start": 105.52,
      "Time_End": 110.32,
      "Text": " the high, high risk that we take. I'm not sure Berkeley's always happy about that in"
    },
    {
      "Time_Start": 110.32000000000001,
      "Time_End": 116.2,
      "Text": " a sense, but we have done some work for very brave nonprofits to help the directors and"
    },
    {
      "Time_Start": 116.2,
      "Time_End": 121.52000000000001,
      "Text": " the volunteers continue to do the work that they do, because for most of our nonprofits,"
    },
    {
      "Time_Start": 121.52000000000001,
      "Time_End": 125.68,
      "Text": " security is not their thing. It is ours. So we step in and kind of take that burden off"
    },
    {
      "Time_Start": 125.68,
      "Time_End": 130.36,
      "Text": " of them so they can get back to doing stuff that matters and make big changes. So this"
    },
    {
      "Time_Start": 130.36,
      "Time_End": 135.32,
      "Text": " is me. Last time I was up here on the stage, I was talking about hacking industrial control"
    },
    {
      "Time_Start": 135.32,
      "Time_End": 142.07999999999998,
      "Text": " systems. In fact, Dora the Skater Explorer is here in the audience today. So we did some"
    },
    {
      "Time_Start": 142.07999999999998,
      "Time_End": 148.44,
      "Text": " skater hacking. But I do mostly car hacking work. In fact, my day job, I work for Berkeley"
    },
    {
      "Time_Start": 148.44,
      "Time_End": 154.0,
      "Text": " as a part‑time instructor, is I do contract work, sometimes for automobile manufacturers,"
    },
    {
      "Time_Start": 154.0,
      "Time_End": 157.72,
      "Text": " sometimes for the U.S. government. I do car hacking. And I started doing a lot of that"
    },
    {
      "Time_Start": 157.72,
      "Time_End": 163.88,
      "Text": " here at DEF CON. And so, Austin, do you want to come up and talk about your background?"
    },
    {
      "Time_Start": 164.2,
      "Time_End": 169.28,
      "Text": " No? Okay. Well, this is Austin. Awesome Austin. There we go. Maybe we can call him that for"
    },
    {
      "Time_Start": 169.28,
      "Time_End": 174.76,
      "Text": " the weekend. But he started this nonprofit, and I cared so much about what I heard. I'm"
    },
    {
      "Time_Start": 174.76,
      "Time_End": 180.28,
      "Text": " like, I can volunteer for this too. I have time to do this. And I was glad to. So what"
    },
    {
      "Time_Start": 180.28,
      "Time_End": 184.68,
      "Text": " is civil cyber defense? It's the first bit of the title in our very long title that we"
    },
    {
      "Time_Start": 184.68,
      "Time_End": 191.07999999999998,
      "Text": " have here at DEF CON. And this is what it is. And this term was actually coined by Craig"
    },
    {
      "Time_Start": 191.08,
      "Time_End": 198.08,
      "Text": " Newmark. Craig Newmark, he started Craigslist. And Craig has been found giving donations"
    },
    {
      "Time_Start": 198.16000000000003,
      "Time_End": 203.56,
      "Text": " to organizations, nonprofits, such as the Center for Long‑Term Cybersecurity at Berkeley."
    },
    {
      "Time_Start": 203.56,
      "Time_End": 209.04000000000002,
      "Text": " They fund my class, and he funds them. There are other places around the country, and I'm"
    },
    {
      "Time_Start": 209.04000000000002,
      "Time_End": 215.12,
      "Text": " going to reference another one that he funds, which is in New York, it's Columbia School"
    },
    {
      "Time_Start": 215.12,
      "Time_End": 219.28,
      "Text": " of Journalism, White Institute. And I'll tell you about a case that they have going on that's"
    },
    {
      "Time_Start": 219.28,
      "Time_End": 223.36,
      "Text": " tangentially related to something I'm going to tell you about that we saw too. So as I"
    },
    {
      "Time_Start": 223.36,
      "Time_End": 226.64000000000001,
      "Text": " mentioned, Citizen Clinic is different than Citizen Lab. We don't do forensics, but when"
    },
    {
      "Time_Start": 226.64000000000001,
      "Time_End": 230.48,
      "Text": " we do find stuff that's interesting, and I'll show you something in here that is, we give"
    },
    {
      "Time_Start": 230.48,
      "Time_End": 237.2,
      "Text": " them a call. But we are looking for people to volunteer, and I'll get to that too, that"
    },
    {
      "Time_Start": 237.2,
      "Time_End": 243.76,
      "Text": " have that type of background. So what we do is we do defense for these organizations."
    },
    {
      "Time_Start": 243.76,
      "Time_End": 248.24,
      "Text": " So this is how it goes. So if you were a student at UC Berkeley, and some of you are in here,"
    },
    {
      "Time_Start": 248.24,
      "Time_End": 254.24,
      "Text": " and I know you are, that have taken my class, I teach two there. One is Chris Hufnagel's"
    },
    {
      "Time_Start": 254.24,
      "Time_End": 257.84000000000003,
      "Text": " class, and he is here today as well, and that's an introduction to cybersecurity, and this"
    },
    {
      "Time_Start": 257.84000000000003,
      "Time_End": 262.24,
      "Text": " is in the MICS program at UC Berkeley, and it's a graduate program for cybersecurity,"
    },
    {
      "Time_Start": 262.24,
      "Time_End": 265.52,
      "Text": " and it's all remote. So I'm from the D.C. area, and I've only been to Berkeley's campus"
    },
    {
      "Time_Start": 265.52,
      "Time_End": 271.12,
      "Text": " once in three years. It's a really good program for cybersecurity, and it's a lot of fun."
    },
    {
      "Time_Start": 271.12,
      "Time_End": 275.32,
      "Text": " And the other class I teach is the one I'm talking about here too. I take two clients"
    },
    {
      "Time_Start": 275.32,
      "Time_End": 281.08,
      "Text": " per semester for Citizen Clinic, and I only like to take 14 students into my class, and"
    },
    {
      "Time_Start": 281.08,
      "Time_End": 286.59999999999997,
      "Text": " I do not just pick cybersecurity background students from the MICS program, which is the"
    },
    {
      "Time_Start": 286.59999999999997,
      "Time_End": 292.44,
      "Text": " master's program for cybersecurity. We've had journalists, we've had statisticians,"
    },
    {
      "Time_Start": 292.44,
      "Time_End": 296.92,
      "Text": " we've had people from the information sciences school, because sometimes we have a lot of"
    },
    {
      "Time_Start": 296.92,
      "Time_End": 300.24,
      "Text": " data to go through, and they're really good at doing that, maybe even more so than some"
    },
    {
      "Time_Start": 300.24,
      "Time_End": 306.16,
      "Text": " of us in cybersecurity. So I take students from all across the university, and not just"
    },
    {
      "Time_Start": 306.16,
      "Time_End": 309.96000000000004,
      "Text": " graduate students. I have about one or two undergraduate students I let into my class"
    },
    {
      "Time_Start": 309.96000000000004,
      "Time_End": 315.16,
      "Text": " every semester too. So what I do is I break the class in half, seven on one team, seven"
    },
    {
      "Time_Start": 315.16,
      "Time_End": 319.04,
      "Text": " on the other. Some students of mine, maybe they have a security clearance, and my high,"
    },
    {
      "Time_Start": 319.04,
      "Time_End": 323.36,
      "Text": " high-risk client is a little bit too much. It would be a lot of work for them to do reporting"
    },
    {
      "Time_Start": 323.36,
      "Time_End": 329.6,
      "Text": " and stuff, so they choose the lower risk. But still, a client that has had a need they"
    },
    {
      "Time_Start": 329.68,
      "Time_End": 334.96000000000004,
      "Text": " have faced threats, and that is a client usually as domestic. So it's someone in California"
    },
    {
      "Time_Start": 334.96000000000004,
      "Time_End": 341.04,
      "Text": " perhaps, has a non-profit, and it's for many different topics, and we choose one domestic"
    },
    {
      "Time_Start": 341.04,
      "Time_End": 345.76000000000005,
      "Text": " and international. And so the first six weeks of the class, because I have students who"
    },
    {
      "Time_Start": 345.76000000000005,
      "Time_End": 351.0,
      "Text": " don't do cybersecurity, they don't know what TOR is, things like that. We love Google,"
    },
    {
      "Time_Start": 351.0,
      "Time_End": 355.3,
      "Text": " and I'm going to tell you why I love Google in a few slides next, but we got them off"
    },
    {
      "Time_Start": 355.3,
      "Time_End": 358.8,
      "Text": " of Google for doing searches for clients, you know, because we teach them how to hide"
    },
    {
      "Time_Start": 358.8,
      "Time_End": 363.86,
      "Text": " online. It's very important for the protection of our clients, and also for their safety."
    },
    {
      "Time_Start": 363.86,
      "Time_End": 370.12,
      "Text": " So I teach the first six weeks, and I put them into sort of a crash course, is here's"
    },
    {
      "Time_Start": 370.12,
      "Time_End": 376.32,
      "Text": " how you hide online, and you cannot, please do not, I usually say do not make one mistake"
    },
    {
      "Time_Start": 376.32,
      "Time_End": 380.88,
      "Text": " one time, your alias is going to be blown if you just hop onto Google and start doing"
    },
    {
      "Time_Start": 380.88,
      "Time_End": 385.2,
      "Text": " some research. So with all of our clients, it's not quite this high risk, but I want"
    },
    {
      "Time_Start": 385.2,
      "Time_End": 388.78000000000003,
      "Text": " these students to know what it's like in case they ever do take some jobs where you do have"
    },
    {
      "Time_Start": 388.78000000000003,
      "Time_End": 393.38000000000005,
      "Text": " to work in the dark web using aliases. None of the clients know the names of my students,"
    },
    {
      "Time_Start": 393.38000000000005,
      "Time_End": 397.62,
      "Text": " and they don't know what they look like either. And we don't use Zoom. We do for our classes,"
    },
    {
      "Time_Start": 397.62,
      "Time_End": 400.82000000000005,
      "Text": " but not for meeting with the clients. The reason for that is we're assuming that most"
    },
    {
      "Time_Start": 400.82000000000005,
      "Time_End": 404.78000000000003,
      "Text": " of our clients have already been compromised. So we're making sure the students protect"
    },
    {
      "Time_Start": 404.78000000000003,
      "Time_End": 410.0,
      "Text": " themselves, because you see, some of the clients we take are, they're taking on organized crime,"
    },
    {
      "Time_Start": 410.0,
      "Time_End": 416.06000000000006,
      "Text": " and they're taking on governments that are adversarial to democratic interests. So first"
    },
    {
      "Time_Start": 416.06,
      "Time_End": 421.5,
      "Text": " six weeks they do that, the second six weeks, I run it like a company. So I'm the CEO, I"
    },
    {
      "Time_Start": 421.5,
      "Time_End": 425.18,
      "Text": " will manage every bit of the project they do. I'm not going to micromanage, but I do"
    },
    {
      "Time_Start": 425.18,
      "Time_End": 429.18,
      "Text": " watch to see if they're making recommendations, because ultimately when that final report"
    },
    {
      "Time_Start": 429.18,
      "Time_End": 434.46,
      "Text": " goes out, it's a representation of me, my professional licenses, and Berkeley. So the"
    },
    {
      "Time_Start": 434.46,
      "Time_End": 438.3,
      "Text": " second six weeks, they meet with the client, and it's like running a company, and we put"
    },
    {
      "Time_Start": 438.3,
      "Time_End": 444.14,
      "Text": " out a work product at the end. So as I mentioned, we use high security procedures. So I've done"
    },
    {
      "Time_Start": 444.14,
      "Time_End": 449.5,
      "Text": " this kind of work in the past with research. I've worked for a lot of companies where I"
    },
    {
      "Time_Start": 449.5,
      "Time_End": 454.97999999999996,
      "Text": " got to teach students how to use a VPN. And I'll show you the tools that we use in another"
    },
    {
      "Time_Start": 454.97999999999996,
      "Time_End": 461.09999999999997,
      "Text": " slide, but that's one of the basic things is teaching them how to do that. And as many,"
    },
    {
      "Time_Start": 461.09999999999997,
      "Time_End": 466.46,
      "Text": " most of the tools we use, because we do have a modest budget as well, we're a 501c3 as"
    },
    {
      "Time_Start": 466.46,
      "Time_End": 470.58,
      "Text": " well, at the Center for Long Term Cybersecurity. So sometimes the super expensive awesome tools"
    },
    {
      "Time_Start": 470.58,
      "Time_End": 475.46,
      "Text": " you all use for the companies and develop for the companies you work for, we can't quite"
    },
    {
      "Time_Start": 475.46,
      "Time_End": 480.14,
      "Text": " afford. So we do the best with what we have. So I gave this presentation a couple of days"
    },
    {
      "Time_Start": 480.14,
      "Time_End": 483.62,
      "Text": " ago, and someone came up and said, why are you using that VPN? And I'm like, it's what"
    },
    {
      "Time_Start": 483.62,
      "Time_End": 486.97999999999996,
      "Text": " we can afford right now, and it's the best we can do with what we have. And this is the"
    },
    {
      "Time_Start": 486.97999999999996,
      "Time_End": 490.18,
      "Text": " kind of mindset that students, some of them come from big companies, some of them are"
    },
    {
      "Time_Start": 490.18,
      "Time_End": 495.14,
      "Text": " at sea levels for big cybersecurity companies coming to get their master's degrees. They"
    },
    {
      "Time_Start": 495.14,
      "Time_End": 498.58,
      "Text": " feel a little uncomfortable at first, but if you're going to do work for a nonprofit,"
    },
    {
      "Time_Start": 498.58,
      "Time_End": 501.62,
      "Text": " one of the things that's respectful for us to do is say, hey, what's your budget? And"
    },
    {
      "Time_Start": 501.62,
      "Time_End": 506.74,
      "Text": " we need to work within that. And we do at Citizen Clinic as well. We have a budget too."
    },
    {
      "Time_Start": 506.74,
      "Time_End": 511.65999999999997,
      "Text": " So I have strict NDAs. If my students break any of them, I just kick them out of the class."
    },
    {
      "Time_Start": 511.65999999999997,
      "Time_End": 514.5,
      "Text": " My students who are here from Berkeley today can attest to this, that the first class,"
    },
    {
      "Time_Start": 514.5,
      "Time_End": 520.22,
      "Text": " I kind of scared them a little bit with the NDA, because I wrote it. And it's pretty important"
    },
    {
      "Time_Start": 520.22,
      "Time_End": 524.9399999999999,
      "Text": " to make sure that we protect, again, the client. Not all clients are like Austin's nonprofit."
    },
    {
      "Time_Start": 524.94,
      "Time_End": 529.2600000000001,
      "Text": " We don't want ever to be known that Berkeley helped them. Again, it's another vulnerability"
    },
    {
      "Time_Start": 529.2600000000001,
      "Time_End": 534.34,
      "Text": " to know where the researchers or the cyber defense came from. So some clients don't want"
    },
    {
      "Time_Start": 534.34,
      "Time_End": 538.7800000000001,
      "Text": " to be associated with Berkeley. So students can't ever talk about that. They can say,"
    },
    {
      "Time_Start": 538.7800000000001,
      "Time_End": 545.3000000000001,
      "Text": " we had a nonprofit we worked with in El Salvador. Great. Let's keep it broad. So we don't want"
    },
    {
      "Time_Start": 545.3000000000001,
      "Time_End": 548.98,
      "Text": " them being identified if they don't want to. And here's why."
    },
    {
      "Time_Start": 548.98,
      "Time_End": 553.7800000000001,
      "Text": " So I get a call in the middle of the night, and someone went from my class. I give out"
    },
    {
      "Time_Start": 553.78,
      "Time_End": 558.1,
      "Text": " my phone number for emergency purposes. And they're like, hey, our client just said they"
    },
    {
      "Time_Start": 558.1,
      "Time_End": 564.38,
      "Text": " have Pegasus on their phones. And I'm like, no way. For a nonprofit this size, they don't"
    },
    {
      "Time_Start": 564.38,
      "Time_End": 569.1,
      "Text": " have a big budget. That can't be right. Who did you hear it from? The nonprofit. And they"
    },
    {
      "Time_Start": 569.1,
      "Time_End": 572.9399999999999,
      "Text": " said, who did the nonprofit hear it from? Well, from Apple. I'm like, okay, let's take"
    },
    {
      "Time_Start": 572.9399999999999,
      "Time_End": 576.9,
      "Text": " a look at those emails. And in fact, it was legit. This was surprising to see, because"
    },
    {
      "Time_Start": 576.9,
      "Time_End": 581.1,
      "Text": " for those of you who don't know what Pegasus is, it's a very expensive surveillance tool."
    },
    {
      "Time_Start": 581.1,
      "Time_End": 587.0600000000001,
      "Text": " And it's supposed to only operate on phones that are not with a plus one like U.S. country"
    },
    {
      "Time_Start": 587.0600000000001,
      "Time_End": 593.74,
      "Text": " code. I won't comment on that. But it's interesting to see this on our nonprofit's, the director's"
    },
    {
      "Time_Start": 593.74,
      "Time_End": 598.5,
      "Text": " phones. And it was kind of concerning. So we did what we could to preserve the evidence"
    },
    {
      "Time_Start": 598.5,
      "Time_End": 602.14,
      "Text": " in case there was a very future case coming up. So my students got to learn about that"
    },
    {
      "Time_Start": 602.14,
      "Time_End": 606.78,
      "Text": " chain of custody. So it was an interesting experience. But it was kind of eye opening"
    },
    {
      "Time_Start": 606.78,
      "Time_End": 611.9399999999999,
      "Text": " to the students. Like, if we'd blown our alias, if our image had been shown, yeah,"
    },
    {
      "Time_Start": 611.9399999999999,
      "Time_End": 616.78,
      "Text": " you guys would all be in Pegasus. And I know I was. I'm up here talking about work I do."
    },
    {
      "Time_Start": 616.78,
      "Time_End": 622.66,
      "Text": " It's just part of the job. But not for my students. So they were protected. But there"
    },
    {
      "Time_Start": 622.66,
      "Time_End": 629.9399999999999,
      "Text": " is a similar lawsuit. We did not Berkeley did not join this lawsuit. But it is against"
    },
    {
      "Time_Start": 629.9399999999999,
      "Time_End": 634.9399999999999,
      "Text": " NSO group. There are a couple going on. I believe Apple has one against NSO. And also"
    },
    {
      "Time_Start": 635.46,
      "Time_End": 642.3000000000001,
      "Text": " Columbia University's Knight Institute, also funded by Craig by the way, puts some grant"
    },
    {
      "Time_Start": 642.3000000000001,
      "Time_End": 648.74,
      "Text": " money there. They are pursuing this against NSO. They're journalists from El Faro. Around"
    },
    {
      "Time_Start": 648.74,
      "Time_End": 655.74,
      "Text": " the same time that our client in El Salvador was got this infection, so did the journalists."
    },
    {
      "Time_Start": 656.0200000000001,
      "Time_End": 661.7,
      "Text": " And what our client did is they were helping people escape organized crime in El Salvador."
    },
    {
      "Time_Start": 661.7,
      "Time_End": 665.3000000000001,
      "Text": " So they were helping them migrate out of the country or hide in the country in safe"
    },
    {
      "Time_Start": 665.3000000000001,
      "Time_End": 670.82,
      "Text": " houses. So you can see how it was pretty serious when we heard about this. Because the kind"
    },
    {
      "Time_Start": 670.82,
      "Time_End": 675.0200000000001,
      "Text": " of work we do at Citizen Clinic, people's lives are on the line. And I'm sure there's"
    },
    {
      "Time_Start": 675.0200000000001,
      "Time_End": 679.1,
      "Text": " another example I have for some of the clients we've had without naming who they are. But"
    },
    {
      "Time_Start": 679.1,
      "Time_End": 682.94,
      "Text": " again, I take students from all of these. I haven't yet had one from law in Berkeley,"
    },
    {
      "Time_Start": 682.94,
      "Time_End": 687.5400000000001,
      "Text": " but I'm hoping. And I would love any attorneys in the audience to come help me with some"
    },
    {
      "Time_Start": 687.5400000000001,
      "Time_End": 690.82,
      "Text": " of that work if you're able to volunteer. I'll talk to you more about the volunteering"
    },
    {
      "Time_Start": 690.82,
      "Time_End": 696.94,
      "Text": " in a minute. But okay, so I also am intending this video perhaps will be watched by some"
    },
    {
      "Time_Start": 696.94,
      "Time_End": 701.46,
      "Text": " people that are going to start clinics in the future. And some universities. You do"
    },
    {
      "Time_Start": 701.46,
      "Time_End": 705.86,
      "Text": " it all. Okay, so if you are the instructor for this, you are starting up a company with"
    },
    {
      "Time_Start": 705.86,
      "Time_End": 710.82,
      "Text": " contracts, insurance, all that stuff that isn't as fun but is super important. You also"
    },
    {
      "Time_Start": 710.82,
      "Time_End": 714.8800000000001,
      "Text": " need to know stuff about PCI DSS. These are things that we've come across. I won't read"
    },
    {
      "Time_Start": 714.8800000000001,
      "Time_End": 719.3000000000001,
      "Text": " through all this, but you need to also keep an eye on all of this. Like you're managing"
    },
    {
      "Time_Start": 719.3000000000001,
      "Time_End": 724.6600000000001,
      "Text": " the company. You're helping clients from the past that you've worked with at Citizen"
    },
    {
      "Time_Start": 724.6600000000001,
      "Time_End": 729.0600000000001,
      "Text": " Clinic. I do that. I keep contact with clients in the past. Like how are you doing? Have"
    },
    {
      "Time_Start": 729.0600000000001,
      "Time_End": 734.3000000000001,
      "Text": " you had any incidences? Managing the clients that are current. And then looking to get"
    },
    {
      "Time_Start": 734.3000000000001,
      "Time_End": 738.0000000000001,
      "Text": " new clients for the future. Part of what I'm up here doing too is if there are nonprofits"
    },
    {
      "Time_Start": 738.0000000000001,
      "Time_End": 743.8000000000001,
      "Text": " that are high risk and would like some help, contact us at Citizen Clinic at UC Berkeley."
    },
    {
      "Time_Start": 743.8000000000001,
      "Time_End": 748.1800000000001,
      "Text": " So you're managing all the students. Sometimes they don't all get along, so you're kind of"
    },
    {
      "Time_Start": 748.1800000000001,
      "Time_End": 752.24,
      "Text": " doing HR stuff as well, but language translation is a big thing. When we put out a final work"
    },
    {
      "Time_Start": 752.24,
      "Time_End": 756.46,
      "Text": " product, if it's all in English, that's not going to be so useful for clients that need"
    },
    {
      "Time_Start": 756.46,
      "Time_End": 761.86,
      "Text": " it, for example, in Cambodian, in the camera. So these are some of the things that you got"
    },
    {
      "Time_Start": 761.86,
      "Time_End": 766.4200000000001,
      "Text": " to manage. So you run a company with 100% turnover every four months. So it's a lot"
    },
    {
      "Time_Start": 766.4200000000001,
      "Time_End": 771.0600000000001,
      "Text": " of fun. It's a lot of work. It is not at all like teaching another university class, but"
    },
    {
      "Time_Start": 771.0600000000001,
      "Time_End": 776.1400000000001,
      "Text": " it is so rewarding. That's why I'm up here talking about it. I mean, I've taught in the"
    },
    {
      "Time_Start": 776.14,
      "Time_End": 780.8199999999999,
      "Text": " university setting for 19 years, and I've never had a class this exciting, this dynamic,"
    },
    {
      "Time_Start": 780.8199999999999,
      "Time_End": 784.6999999999999,
      "Text": " and that takes us many hours. There's some weeks where I spend 20 hours on Citizen Clinic"
    },
    {
      "Time_Start": 784.6999999999999,
      "Time_End": 789.38,
      "Text": " work, but I love it. So here's some of the tools we use. And I know you're not going"
    },
    {
      "Time_Start": 789.38,
      "Time_End": 793.5,
      "Text": " to see this in the back in particular. I try to get as much in here. I was asking my students,"
    },
    {
      "Time_Start": 793.5,
      "Time_End": 798.18,
      "Text": " like, am I forgetting anything? This is just the start of a list that we don't really,"
    },
    {
      "Time_Start": 798.18,
      "Time_End": 802.04,
      "Text": " didn't really have a list, and we put it all together. But we do all kinds of research"
    },
    {
      "Time_Start": 802.04,
      "Time_End": 807.24,
      "Text": " online too, as you can imagine. We also make sure that if the students are communicating,"
    },
    {
      "Time_Start": 807.24,
      "Time_End": 812.24,
      "Text": " we use stuff like Signal. We're not a big fan of WhatsApp, but we tell our clients that"
    },
    {
      "Time_Start": 812.24,
      "Time_End": 815.48,
      "Text": " too. Please use Signal. So these are some of the recommendations. And if you're thinking"
    },
    {
      "Time_Start": 815.48,
      "Time_End": 819.36,
      "Text": " the recommendations we give for our clients are super technical, they're not. This is"
    },
    {
      "Time_Start": 819.36,
      "Time_End": 824.16,
      "Text": " stuff that the term is kind of, I don't really love this term, but it's cyber hygiene. It's"
    },
    {
      "Time_Start": 824.16,
      "Time_End": 828.9599999999999,
      "Text": " basic stuff. Use a password safe. This is some of the consulting we have to do. Others"
    },
    {
      "Time_Start": 829.0,
      "Time_End": 832.96,
      "Text": " gets a lot more technical, such as actually taking a look at, for example, what's on people's"
    },
    {
      "Time_Start": 832.96,
      "Time_End": 837.32,
      "Text": " phones if their phones have been compromised. But generally, a lot of the work we do is"
    },
    {
      "Time_Start": 837.32,
      "Time_End": 841.0,
      "Text": " very general. And teaching the students this stuff too, in particular ones that are not"
    },
    {
      "Time_Start": 841.0,
      "Time_End": 845.32,
      "Text": " in cybersecurity, is very important. Here's just some of the clients that we've had. And"
    },
    {
      "Time_Start": 845.32,
      "Time_End": 849.12,
      "Text": " I'm going to go through this really quickly. Some of the interesting ones that were really"
    },
    {
      "Time_Start": 849.12,
      "Time_End": 853.2800000000001,
      "Text": " important to me that I really enjoyed working with is there were migrants coming over on"
    },
    {
      "Time_Start": 853.2800000000001,
      "Time_End": 857.1600000000001,
      "Text": " boats from Africa and the Middle East, and they were landing in Greece, and they were"
    },
    {
      "Time_Start": 857.16,
      "Time_End": 862.76,
      "Text": " put into migrant tent cities. And in particular, women and children that have gone through"
    },
    {
      "Time_Start": 862.76,
      "Time_End": 868.1999999999999,
      "Text": " that process, a lot of them were survivors of sexual assault. And there was a health"
    },
    {
      "Time_Start": 868.1999999999999,
      "Time_End": 875.1999999999999,
      "Text": " care provider, both psychological care and health care, in the migrant tent city in Greece."
    },
    {
      "Time_Start": 875.64,
      "Time_End": 880.12,
      "Text": " The problem was, is that there were American psychologists volunteering, using their own"
    },
    {
      "Time_Start": 880.12,
      "Time_End": 885.72,
      "Text": " laptops, and that was medical information that was being collected by some physicians."
    },
    {
      "Time_Start": 885.72,
      "Time_End": 890.9200000000001,
      "Text": " It was not being protected as it needed to. So we had to do some HIPAA and GDPR, because"
    },
    {
      "Time_Start": 890.9200000000001,
      "Time_End": 895.24,
      "Text": " it touched some servers in Europe as well. So that was a very interesting client that"
    },
    {
      "Time_Start": 895.24,
      "Time_End": 900.2,
      "Text": " we had with that. There are others in here. Have you ever, if you work in physical security,"
    },
    {
      "Time_Start": 900.2,
      "Time_End": 906.28,
      "Text": " have you ever had to secure a tent? We did. So one of our clients had a tent in Tijuana."
    },
    {
      "Time_Start": 906.28,
      "Time_End": 909.8000000000001,
      "Text": " And one of the last weeks we were working with them, they called me up and they said,"
    },
    {
      "Time_Start": 909.8000000000001,
      "Time_End": 915.64,
      "Text": " we just found GPS tracking units on our vehicles. And these are two women who are American attorneys"
    },
    {
      "Time_Start": 915.88,
      "Time_End": 921.88,
      "Text": " that are down there taking business from the coyotes, which means also from organized crime,"
    },
    {
      "Time_Start": 921.88,
      "Time_End": 925.96,
      "Text": " and they're helping people through the legal migration process. Really amazing work they"
    },
    {
      "Time_Start": 925.96,
      "Time_End": 929.48,
      "Text": " were doing. Someone wanted to know where they lived and where they went after working in"
    },
    {
      "Time_Start": 929.48,
      "Time_End": 936.84,
      "Text": " the tent in Tijuana. So we helped to try to figure out, track where that GPS came from."
    },
    {
      "Time_Start": 936.84,
      "Time_End": 940.04,
      "Text": " We didn't have a lot of time to do that. We did have pictures of it, and that's about it."
    },
    {
      "Time_Start": 940.04,
      "Time_End": 944.28,
      "Text": " But we were securing how their documents were stored, because some of that was HIPAA too."
    },
    {
      "Time_Start": 944.28,
      "Time_End": 949.3199999999999,
      "Text": " They were also taking records, medical records from in particular women and children that were"
    },
    {
      "Time_Start": 949.3199999999999,
      "Time_End": 953.88,
      "Text": " victims of sexual assault as part of their migration process to the border. And that is"
    },
    {
      "Time_Start": 953.88,
      "Time_End": 960.76,
      "Text": " being used to create some of their case files for the refugee status. So we were doing all kinds of"
    },
    {
      "Time_Start": 960.76,
      "Time_End": 965.16,
      "Text": " stuff that's not just cybersecurity. I think you can see now why I accept a broad variety of"
    },
    {
      "Time_Start": 965.16,
      "Time_End": 970.92,
      "Text": " students from the university. So here's some examples. We recently had one also in Cambodia."
    },
    {
      "Time_Start": 970.9200000000001,
      "Time_End": 975.8000000000001,
      "Text": " They are an organization that are working for democratic government. If you know a lot"
    },
    {
      "Time_Start": 975.8000000000001,
      "Time_End": 979.0000000000001,
      "Text": " about Cambodia's history, they've had an authoritarian regime for a long time."
    },
    {
      "Time_Start": 979.6400000000001,
      "Time_End": 984.5200000000001,
      "Text": " And just as we were finishing up with them, they said that someone in their organization,"
    },
    {
      "Time_Start": 984.5200000000001,
      "Time_End": 988.7600000000001,
      "Text": " not a director, but one of their volunteers had been arrested. And this is difficult to hear"
    },
    {
      "Time_Start": 988.7600000000001,
      "Time_End": 994.1200000000001,
      "Text": " because it's nothing we can help with. But we knew that someone who had been on some of the meetings"
    },
    {
      "Time_Start": 994.84,
      "Time_End": 999.48,
      "Text": " was being held in detention because he was not supporting the current president."
    },
    {
      "Time_Start": 1000.04,
      "Time_End": 1007.48,
      "Text": " So again, the work we do is hard. It's very exciting. And as I mentioned, I love it. If you"
    },
    {
      "Time_Start": 1007.48,
      "Time_End": 1011.72,
      "Text": " do this kind of work, you're going to love it too. Let me tell you about some opportunities that you"
    },
    {
      "Time_Start": 1011.72,
      "Time_End": 1015.64,
      "Text": " can do. Are you here from academia? If you are, come find me at this conference because I want"
    },
    {
      "Time_Start": 1015.64,
      "Time_End": 1023.16,
      "Text": " to talk to you. There is a grant process that's out there. And Google has a very generous fund."
    },
    {
      "Time_Start": 1024.1200000000001,
      "Time_End": 1027.08,
      "Text": " And I'll tell you about what that is. But here it is actually. It's on this slide."
    },
    {
      "Time_Start": 1027.6399999999999,
      "Time_End": 1034.4399999999998,
      "Text": " About $1 million is going to be given to clinics that go through an application process. And I"
    },
    {
      "Time_Start": 1034.4399999999998,
      "Time_End": 1038.6,
      "Text": " think about maybe half a dozen or no, actually, it's more like a dozen are going to be chosen"
    },
    {
      "Time_Start": 1039.32,
      "Time_End": 1043.48,
      "Text": " to receive this grant. But you got to be a university to apply for these grants, I believe."
    },
    {
      "Time_Start": 1044.04,
      "Time_End": 1049.32,
      "Text": " And the Consortium for Cybersecurity Clinics at UC Berkeley is sort of organizing this process."
    },
    {
      "Time_Start": 1049.32,
      "Time_End": 1053.72,
      "Text": " But the grant comes from Google. So we are very appreciative of that. That is also some of that"
    },
    {
      "Time_Start": 1053.72,
      "Time_End": 1059.88,
      "Text": " funding is going to come to citizen clinics so we can buy some more tools. And it's wonderful."
    },
    {
      "Time_Start": 1059.88,
      "Time_End": 1064.52,
      "Text": " These are the clinics that exist in the United States right now. Not that many yet, right? I feel"
    },
    {
      "Time_Start": 1064.52,
      "Time_End": 1071.8,
      "Text": " like we can do better. We can get some more. So let's do that. If you want to start a clinic,"
    },
    {
      "Time_Start": 1072.3600000000001,
      "Time_End": 1077.24,
      "Text": " contact me here. And I know this is a large URL and I realize you can't click on it online because"
    },
    {
      "Time_Start": 1077.24,
      "Time_End": 1081.56,
      "Text": " you have a PDF. But I have a form that you can fill out and I'll get you to who you need to"
    },
    {
      "Time_Start": 1081.56,
      "Time_End": 1086.2,
      "Text": " talk to in the consortium that we have at Berkeley if you want to start one. And now let"
    },
    {
      "Time_Start": 1086.2,
      "Time_End": 1090.9199999999998,
      "Text": " me introduce Austin to come talk about his nonprofit and why they're going to be our"
    },
    {
      "Time_Start": 1090.9199999999998,
      "Time_End": 1093.8,
      "Text": " client at Citizen Clinic in the fall. Come on up, Austin."
    },
    {
      "Time_Start": 1098.6,
      "Time_End": 1099.0,
      "Text": " Morning."
    },
    {
      "Time_Start": 1101.56,
      "Time_End": 1107.6399999999999,
      "Text": " So Tiffany didn't mention that I absolutely hate public speaking. And at Black Hat, there was"
    },
    {
      "Time_Start": 1107.64,
      "Time_End": 1112.0400000000002,
      "Text": " these nice bright lights. I couldn't see anybody but the first row. And there's a lot of you in"
    },
    {
      "Time_Start": 1112.0400000000002,
      "Time_End": 1118.8400000000001,
      "Text": " here. So thanks for coming. All right. So I started this organization back in January. I've been in"
    },
    {
      "Time_Start": 1118.8400000000001,
      "Time_End": 1127.3200000000002,
      "Text": " the business for about 10 years. You know, an operation that we had last year was we rescued"
    },
    {
      "Time_Start": 1127.3200000000002,
      "Time_End": 1132.92,
      "Text": " 83 girls from Dominican Republic that were Venezuelan and Colombian, right? That sounds"
    },
    {
      "Time_Start": 1132.92,
      "Time_End": 1137.5600000000002,
      "Text": " really great. But in reality, 83 girls just gets replaced within a matter of weeks, right? And the"
    },
    {
      "Time_Start": 1137.5600000000002,
      "Time_End": 1142.2,
      "Text": " bad guys figure out our TTPs or tactics and techniques of how we found them and they just"
    },
    {
      "Time_Start": 1142.2,
      "Time_End": 1147.64,
      "Text": " adjust fire and move, you know. So just the whole cycle starts over. So I said we've got to do better"
    },
    {
      "Time_Start": 1147.64,
      "Time_End": 1154.1200000000001,
      "Text": " as an industry. You know, A to Z, this industry is not doing what it should be doing, right? And"
    },
    {
      "Time_Start": 1154.1200000000001,
      "Time_End": 1158.92,
      "Text": " law enforcement and the government are really handcuffed. They don't have the resources, the"
    },
    {
      "Time_Start": 1158.92,
      "Time_End": 1163.0800000000002,
      "Text": " funding. So, you know, nonprofits are really stepping in and kind of offering some of what"
    },
    {
      "Time_Start": 1163.72,
      "Time_End": 1169.8000000000002,
      "Text": " to local law enforcement and international law enforcement organizations what they don't have."
    },
    {
      "Time_Start": 1169.8000000000002,
      "Time_End": 1176.44,
      "Text": " Sorry, somebody's calling me. So this is our mission is to identify, map, and disrupt transnational"
    },
    {
      "Time_Start": 1176.44,
      "Time_End": 1181.3200000000002,
      "Text": " human trafficking networks with a nexus to the United States. And the reason that we want a"
    },
    {
      "Time_Start": 1181.3200000000002,
      "Time_End": 1185.96,
      "Text": " nexus to the United States is because in a lot of these countries, you can't get some sort of"
    },
    {
      "Time_Start": 1185.96,
      "Time_End": 1190.92,
      "Text": " prosecution or some sort of civil action against the bad guys, right? So we try to draw that back"
    },
    {
      "Time_Start": 1190.92,
      "Time_End": 1195.8,
      "Text": " to the United States so that, you know, law enforcement or prosecutor's office or international"
    },
    {
      "Time_Start": 1195.8,
      "Time_End": 1201.48,
      "Text": " organizations like the UN or organization of American states can take some sort of sanction"
    },
    {
      "Time_Start": 1201.48,
      "Time_End": 1207.24,
      "Text": " action against people that are trafficking human beings. These are some of our partners. Some"
    },
    {
      "Time_Start": 1207.24,
      "Time_End": 1212.52,
      "Text": " important ones to point out there, Skull Games. They are doing fantastic work. It's a group of"
    },
    {
      "Time_Start": 1212.52,
      "Time_End": 1219.72,
      "Text": " former special operations guys that just kind of gamified hunting traffickers, right? And the next"
    },
    {
      "Time_Start": 1219.72,
      "Time_End": 1224.84,
      "Text": " game is in October. So I definitely recommend you guys go and check out what they're doing."
    },
    {
      "Time_Start": 1224.84,
      "Time_End": 1229.48,
      "Text": " Another one is Collective Liberty. And then all of these folks here have, you see Berkeley's up"
    },
    {
      "Time_Start": 1229.48,
      "Time_End": 1237.8,
      "Text": " there, all of these folks here have done something to, you know, support us or give us tools or"
    },
    {
      "Time_Start": 1237.8,
      "Time_End": 1243.48,
      "Text": " Hackers for Charity, this guy in the front row here with the blue shirt, he's from Hackers for"
    },
    {
      "Time_Start": 1243.48,
      "Time_End": 1248.84,
      "Text": " Charity. My organization would not exist without him. So definitely come see them over at the"
    },
    {
      "Time_Start": 1248.84,
      "Time_End": 1255.48,
      "Text": " vendor section. They're near the pineapple. This is the fastest growing global crime, right?"
    },
    {
      "Time_Start": 1256.28,
      "Time_End": 1263.48,
      "Text": " It has bypassed arms trafficking. It has bypassed, I would say there's probably enough to say that"
    },
    {
      "Time_Start": 1263.48,
      "Time_End": 1268.68,
      "Text": " it's bypassed drugs at this point, narcotics trafficking. But, you know, all the data"
    },
    {
      "Time_Start": 1268.68,
      "Time_End": 1275.4,
      "Text": " out there is guesses at best, right? There's nobody, you know, these bad guys, they're not"
    },
    {
      "Time_Start": 1275.4,
      "Time_End": 1281.08,
      "Text": " submitting 990s or, you know, annual reports that we can pull up online. But I think the evidence"
    },
    {
      "Time_Start": 1281.08,
      "Time_End": 1287.24,
      "Text": " exists. And this is some of the numbers, right? 28 million victims in the category of labor"
    },
    {
      "Time_Start": 1287.24,
      "Time_End": 1295.4,
      "Text": " trafficking, which covers organ harvesting, sex trafficking, so on and so forth, right? 12% growth"
    },
    {
      "Time_Start": 1295.4,
      "Time_End": 1301.96,
      "Text": " since 2016. That is about the equivalent of the entire population of DC has been enslaved, and"
    },
    {
      "Time_Start": 1301.96,
      "Time_End": 1307.56,
      "Text": " that is the right term to use. They've been enslaved since 2016, right? And that's just growing larger"
    },
    {
      "Time_Start": 1307.56,
      "Time_End": 1316.04,
      "Text": " and larger every single year. So this is our strategy. We identify, map, and disrupt. We"
    },
    {
      "Time_Start": 1316.04,
      "Time_End": 1322.04,
      "Text": " look at patterns in a specific area, whatever that may be. And I'll talk about one of our"
    },
    {
      "Time_Start": 1322.04,
      "Time_End": 1327.0,
      "Text": " operations in a minute. But we look at all the data points, we try to put them together, and we"
    },
    {
      "Time_Start": 1327.0,
      "Time_End": 1332.2,
      "Text": " find those trends and those patterns. Once we've identified that there is some type of network,"
    },
    {
      "Time_Start": 1332.2,
      "Time_End": 1337.1599999999999,
      "Text": " we try to map it end to end. And then we work with, you know, a separate team to come up with"
    },
    {
      "Time_Start": 1337.1599999999999,
      "Time_End": 1343.3999999999999,
      "Text": " strategies to disrupt it. So there's an old Carver method of quantifying and disrupting."
    },
    {
      "Time_Start": 1343.8000000000002,
      "Time_End": 1354.6000000000001,
      "Text": " That's what we try to use. These are some of our metrics of how we identify success. You're going"
    },
    {
      "Time_Start": 1354.6000000000001,
      "Time_End": 1360.44,
      "Text": " to go to a ton of the websites out there for organizations and say, oh, we saved 10 billion"
    },
    {
      "Time_Start": 1360.44,
      "Time_End": 1365.0800000000002,
      "Text": " people this year. We rescued blah, blah, blah. You're never going to see that clicker on my"
    },
    {
      "Time_Start": 1365.0800000000002,
      "Time_End": 1369.24,
      "Text": " website, because I think it just kind of re-victimizes victims. We don't work with law"
    },
    {
      "Time_Start": 1369.24,
      "Time_End": 1376.2,
      "Text": " enforcement that arrests prostitutes. I just don't think that it's productive to arrest. It's"
    },
    {
      "Time_Start": 1376.2,
      "Time_End": 1381.64,
      "Text": " kind of like putting a bunch of drug addicts in prison. It doesn't really make sense. But we look"
    },
    {
      "Time_Start": 1381.64,
      "Time_End": 1388.44,
      "Text": " at how do we, how many target packages have we sent over to law enforcement? How many networks"
    },
    {
      "Time_Start": 1388.44,
      "Time_End": 1393.32,
      "Text": " have we mapped? How many victims have we identified and pushed into programs that will help them get"
    },
    {
      "Time_Start": 1393.32,
      "Time_End": 1400.6799999999998,
      "Text": " out of this lifestyle? And then arrests and prosecutions. So these are two of our projects."
    },
    {
      "Time_Start": 1400.6799999999998,
      "Time_End": 1405.08,
      "Text": " Operation West Keg, which is kind of a larger project and then we have smaller projects"
    },
    {
      "Time_Start": 1405.08,
      "Time_End": 1411.56,
      "Text": " underneath. That's essentially looking at networks operating within the state of Texas that have a"
    },
    {
      "Time_Start": 1411.56,
      "Time_End": 1419.32,
      "Text": " nexus to somewhere outside of Texas, whether it be internationally or not. Ideally we want to"
    },
    {
      "Time_Start": 1419.32,
      "Time_End": 1425.6399999999999,
      "Text": " map from Houston down to Peru and Guatemala and find where those networks are. Because if you"
    },
    {
      "Time_Start": 1425.6399999999999,
      "Time_End": 1432.4399999999998,
      "Text": " can't shut down the organizations themselves, the next best thing is to shut down the supply"
    },
    {
      "Time_Start": 1432.4399999999998,
      "Time_End": 1438.9199999999998,
      "Text": " networks. And then Project Key. Actually Project Key is this guy right here with the camera"
    },
    {
      "Time_Start": 1438.9199999999998,
      "Time_End": 1444.84,
      "Text": " waving. He came up with a great idea that, he's one of our analysts, he came up with a great idea"
    },
    {
      "Time_Start": 1444.84,
      "Time_End": 1451.48,
      "Text": " of getting the word out about sextortion. And if people aren't familiar with what sextortion is,"
    },
    {
      "Time_Start": 1452.1999999999998,
      "Time_End": 1457.1599999999999,
      "Text": " it's one of the biggest issues that our teenagers are dealing with in the United States."
    },
    {
      "Time_Start": 1457.8799999999999,
      "Time_End": 1464.04,
      "Text": " They're using over social media, they'll be using like the lover boy tactics. And most of the time"
    },
    {
      "Time_Start": 1464.04,
      "Time_End": 1470.6799999999998,
      "Text": " it's just a sock puppet account that they're getting young girls and young boys fall in love"
    },
    {
      "Time_Start": 1470.68,
      "Time_End": 1479.0,
      "Text": " with this anonymous person and then getting them to send sexual photos of them naked and then"
    },
    {
      "Time_Start": 1479.0,
      "Time_End": 1485.24,
      "Text": " extorting them for them. I think as of today there's been like 12 kids that have killed themselves"
    },
    {
      "Time_Start": 1485.24,
      "Time_End": 1490.3600000000001,
      "Text": " over this. So it's a really big issue and go to the website and take a look at both of these if"
    },
    {
      "Time_Start": 1490.3600000000001,
      "Time_End": 1496.3600000000001,
      "Text": " you're interested in more information on this. This is Houston for Operation West Keg. We looked"
    },
    {
      "Time_Start": 1497.2400000000002,
      "Time_End": 1504.92,
      "Text": " at everything from Yelp data to just everything and made a heat map. And this is what we're looking"
    },
    {
      "Time_Start": 1504.92,
      "Time_End": 1510.1200000000001,
      "Text": " at now of all these commercial industries or these commercial enterprises that are"
    },
    {
      "Time_Start": 1510.1200000000001,
      "Time_End": 1514.3600000000001,
      "Text": " networked together, whether it be money laundering or a variety of any other issues."
    },
    {
      "Time_Start": 1517.0000000000002,
      "Time_End": 1521.8000000000002,
      "Text": " I think that was quicker than last time. Sorry. So I'm going to hand it back over to Tiffany and"
    },
    {
      "Time_Start": 1521.8,
      "Time_End": 1525.56,
      "Text": " she's going to tell you about one thing. This email is not working, so just Austin"
    },
    {
      "Time_Start": 1525.56,
      "Time_End": 1530.04,
      "Text": " at Traverse Project. Just take my last name out of it. Yeah, that was my mistake. So"
    },
    {
      "Time_Start": 1531.8,
      "Time_End": 1536.04,
      "Text": " okay, so I can pick them, right? So this is one of the non-profits I was like, I want to show"
    },
    {
      "Time_Start": 1536.04,
      "Time_End": 1541.32,
      "Text": " what we, you know, the type of clients we have at UC Berkeley in the Citizen Clinic. And we're"
    },
    {
      "Time_Start": 1541.32,
      "Time_End": 1545.8799999999999,
      "Text": " so excited to work with Austin this fall. Which brings me to another thing is we're here to talk"
    },
    {
      "Time_Start": 1545.8799999999999,
      "Time_End": 1551.1599999999999,
      "Text": " about what you can do if you want to get involved in these topics to do some things with your skill"
    },
    {
      "Time_Start": 1551.16,
      "Time_End": 1558.0400000000002,
      "Text": " set. So I know many of you work for organizations where you get one to two weeks off of paid time"
    },
    {
      "Time_Start": 1558.0400000000002,
      "Time_End": 1563.96,
      "Text": " off for volunteering. Citizen Clinic via Center for Long-Term Cybersecurity is a non-profit,"
    },
    {
      "Time_Start": 1563.96,
      "Time_End": 1570.52,
      "Text": " 501c3, and so are they. So if you have time, they would love to have some volunteers. They're"
    },
    {
      "Time_Start": 1570.52,
      "Time_End": 1575.64,
      "Text": " looking for volunteers that perhaps have Intel analyst skills. Well, actually, anyone who's"
    },
    {
      "Time_Start": 1575.64,
      "Time_End": 1580.0400000000002,
      "Text": " interested in helping out, even if you're in marketing or sales, you know, getting word out"
    },
    {
      "Time_Start": 1580.04,
      "Time_End": 1586.2,
      "Text": " about what they do is what they're looking for. At UC Berkeley, for Citizen Clinic, we're looking"
    },
    {
      "Time_Start": 1586.2,
      "Time_End": 1592.68,
      "Text": " for subject matter experts. Can you come and guest lecture for our class? Can you volunteer? You may"
    },
    {
      "Time_Start": 1592.68,
      "Time_End": 1597.48,
      "Text": " not know the name of the client, depending on how the client wants the NDAs to be created."
    },
    {
      "Time_Start": 1598.2,
      "Time_End": 1603.8,
      "Text": " But know that if we pick them, they're awesome like Austin's non-profit, but they may not want"
    },
    {
      "Time_Start": 1603.8,
      "Time_End": 1607.56,
      "Text": " you to know their identity. But they do have some problems that some of you have the skill sets to"
    },
    {
      "Time_Start": 1607.56,
      "Time_End": 1613.8,
      "Text": " solve. So we'd very much like to have some volunteers. So if you're interested, you can"
    },
    {
      "Time_Start": 1613.8,
      "Time_End": 1618.6799999999998,
      "Text": " contact us here at Citizen Clinic as well. And we're creating a list. So I'm going to send you"
    },
    {
      "Time_Start": 1618.6799999999998,
      "Time_End": 1621.8799999999999,
      "Text": " a Google form. Then on the Google form, there's going to be some information about what"
    },
    {
      "Time_Start": 1621.8799999999999,
      "Time_End": 1626.28,
      "Text": " would you like to do? How much time do you have to volunteer? Do you want to come guest lecture?"
    },
    {
      "Time_Start": 1627.08,
      "Time_End": 1631.6399999999999,
      "Text": " So I'm going to tell you just a brief story. I was at Black Hat with Austin doing the same"
    },
    {
      "Time_Start": 1631.64,
      "Time_End": 1637.96,
      "Text": " presentation a couple days ago. And after the presentations, someone came up to us. And he said,"
    },
    {
      "Time_Start": 1639.0,
      "Time_End": 1644.76,
      "Text": " he might be here today. I'm not going to name him. But he said, I helped write Pegasus."
    },
    {
      "Time_Start": 1645.48,
      "Time_End": 1651.88,
      "Text": " And I'm like, oh, okay. Thank you for coming to our talk. I wasn't quite sure what to say. And he"
    },
    {
      "Time_Start": 1651.88,
      "Time_End": 1658.6000000000001,
      "Text": " said, I'd like to help volunteer. I'd like to talk to your students about how Pegasus was created."
    },
    {
      "Time_Start": 1658.6000000000001,
      "Time_End": 1664.6000000000001,
      "Text": " This is obviously public knowledge. Now, how the exploits were written. And I'd like to volunteer"
    },
    {
      "Time_Start": 1664.6000000000001,
      "Time_End": 1670.1200000000001,
      "Text": " my time to do some work for the clients that you have at Citizen Clinic. Hearing that was one of"
    },
    {
      "Time_Start": 1670.1200000000001,
      "Time_End": 1674.8400000000001,
      "Text": " these things, like, man, all those long hours. And our classes for me on the East Coast, classes"
    },
    {
      "Time_Start": 1674.8400000000001,
      "Time_End": 1679.64,
      "Text": " around West Coast time go to midnight for me. After working all day, and I do classes all night."
    },
    {
      "Time_Start": 1679.64,
      "Time_End": 1684.68,
      "Text": " It was like one of these things that if I had one of the developers for Pegasus coming to volunteer,"
    },
    {
      "Time_Start": 1684.76,
      "Time_End": 1691.4,
      "Text": " I'm like, that's great. I feel like it's my work. My work has been done in a way. So I'm,"
    },
    {
      "Time_Start": 1692.52,
      "Time_End": 1695.5600000000002,
      "Text": " you don't have to be a creator of Pegasus to come volunteer for us."
    },
    {
      "Time_Start": 1695.5600000000002,
      "Time_End": 1699.64,
      "Text": " But it's one of these things that if you have specialties, again, if you're an attorney,"
    },
    {
      "Time_Start": 1699.64,
      "Time_End": 1706.8400000000001,
      "Text": " if you do compliance, you do like PCI DSS, it really, we're looking for a broad range. Because"
    },
    {
      "Time_Start": 1706.8400000000001,
      "Time_End": 1714.04,
      "Text": " when we step into a client meeting, I don't know a lot about what the problems are until we start"
    },
    {
      "Time_Start": 1714.04,
      "Time_End": 1719.0,
      "Text": " taking a look. Network engineers are always useful because we do see some stuff like that."
    },
    {
      "Time_Start": 1719.0,
      "Time_End": 1723.56,
      "Text": " If you're like a master with Google Suites and how to lock all this stuff down, I got someone"
    },
    {
      "Time_Start": 1723.56,
      "Time_End": 1727.56,
      "Text": " from Apple come up to me at the last talk, and they're like, we can do a presentation on if they"
    },
    {
      "Time_Start": 1727.56,
      "Time_End": 1733.32,
      "Text": " have an iPhone, how we can enhance privacy. I'm like, great. Because I don't know all of this"
    },
    {
      "Time_Start": 1733.32,
      "Time_End": 1738.52,
      "Text": " stuff. It's hard to, I mean, you can imagine how much it is. And we would love to have some"
    },
    {
      "Time_Start": 1738.52,
      "Time_End": 1745.16,
      "Text": " volunteers to assist us with this. And with that, let me just say that we're really glad to be here"
    },
    {
      "Time_Start": 1745.16,
      "Time_End": 1752.28,
      "Text": " talking to you here at DEF CON. So if you want to reach out to us, please do. And we appreciate"
    },
    {
      "Time_Start": 1752.28,
      "Time_End": 1757.56,
      "Text": " your interest in coming to hear about the work at UC Berkeley Citizen Clinic and with Traverse"
    },
    {
      "Time_Start": 1757.56,
      "Time_End": 1761.4,
      "Text": " Project. Is there anything else you want to close with? If anybody has any questions, just come find"
    },
    {
      "Time_Start": 1761.4,
      "Time_End": 1767.56,
      "Text": " us. I'll be at the Hacker Security booth. And we'll be here if anybody wants to come talk."
    },
    {
      "Time_Start": 1767.56,
      "Time_End": 1771.48,
      "Text": " And if you are a student at UC Berkeley and have taken my class, I have challenge coins for you."
    },
    {
      "Time_Start": 1771.48,
      "Time_End": 1776.28,
      "Text": " You have earned them. And I'm like 20, but you have earned those. So come up and talk to me,"
    },
    {
      "Time_Start": 1776.28,
      "Time_End": 1789.6399999999999,
      "Text": " and I'll give those to you. All right. Thank you."
    }
  ]
}