{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hello, all. First of all, thank you very much for coming down to my talk. I know it's early"
    },
    {
      "Time_Start": 15.44,
      "Time_End": 21.5,
      "Text": " morning and we had some really good party yesterday evening, so I wasn't expecting a"
    },
    {
      "Time_Start": 21.5,
      "Time_End": 27.7,
      "Text": " lot of audience, honestly. Well, the topic I'll be delivering talk upon today is core"
    },
    {
      "Time_Start": 27.7,
      "Time_End": 37.48,
      "Text": " channels in IEEE 2.11 standards, or for that matter, regular Wi-Fi standards. So how I"
    },
    {
      "Time_Start": 37.48,
      "Time_End": 45.980000000000004,
      "Text": " actually did reach to this theme of research, or for that matter, theme of finding something."
    },
    {
      "Time_Start": 45.980000000000004,
      "Time_End": 50.58,
      "Text": " I can't call it as research for that matter because it may be available by many people,"
    },
    {
      "Time_Start": 50.58,
      "Time_End": 55.46,
      "Text": " may be received by many people already. The thing was, I was doing a lot of consulting"
    },
    {
      "Time_Start": 55.46,
      "Time_End": 60.620000000000005,
      "Text": " work, I was doing a lot of testing, both, sometimes red teaming, sometimes blue teaming."
    },
    {
      "Time_Start": 60.620000000000005,
      "Time_End": 67.14,
      "Text": " There, I used to consult with majority of my clients saying, okay, this is loophole in your"
    },
    {
      "Time_Start": 67.14,
      "Time_End": 71.38,
      "Text": " network, this is how you're supposed to patch it and all. But then, at the back of my mind,"
    },
    {
      "Time_Start": 71.38,
      "Time_End": 78.62,
      "Text": " there was something else going on. Why am I always supposed to, you know, face the attack,"
    },
    {
      "Time_Start": 78.62,
      "Time_End": 84.34,
      "Text": " or then mitigate the attack? Can there be some other way out so that we cannot actually be"
    },
    {
      "Time_Start": 84.46000000000001,
      "Time_End": 88.78,
      "Text": " available, or a victim will not be available for an attacker at all, at least in case of wireless"
    },
    {
      "Time_Start": 88.78,
      "Time_End": 96.22,
      "Text": " networks? So yes, so I was thinking on that particular lines, can we do something regarding"
    },
    {
      "Time_Start": 96.22,
      "Time_End": 104.34,
      "Text": " this situation? Meanwhile, one of my paper on wireless got declined in positive hack days,"
    },
    {
      "Time_Start": 104.34,
      "Time_End": 111.30000000000001,
      "Text": " and I consider that as one of very positive setback ever. Now, this is kind of contradictory"
    },
    {
      "Time_Start": 111.3,
      "Time_End": 115.74,
      "Text": " statement I'm making positive and setback, because, setback because obvious, declined,"
    },
    {
      "Time_Start": 115.74,
      "Time_End": 126.14,
      "Text": " nobody likes decline of a paper as such. Positive it was because that review gave me a lot of ideas"
    },
    {
      "Time_Start": 126.14,
      "Time_End": 134.18,
      "Text": " about how can I actually explore this area in little more detail. They had very specific set"
    },
    {
      "Time_Start": 134.18,
      "Time_End": 138.66,
      "Text": " of questions. Why exactly you're trying to do this all on application layer? Why not on some"
    },
    {
      "Time_Start": 138.66,
      "Time_End": 146.78,
      "Text": " other layers in your ISO-OSI model? There is where I came to know, I mean, there is where I"
    },
    {
      "Time_Start": 146.78,
      "Time_End": 152.01999999999998,
      "Text": " actually striked with one more idea where we know, in case of wireless networks, that is,"
    },
    {
      "Time_Start": 152.01999999999998,
      "Time_End": 158.9,
      "Text": " IEEE 802.11, and in case of wired networks, that is, most of the times IEEE 802.3, we have"
    },
    {
      "Time_Start": 158.9,
      "Time_End": 167.54,
      "Text": " difference on physical layer and data link layer. Rest of the layers are same. Considering the size"
    },
    {
      "Time_Start": 167.54,
      "Time_End": 175.94,
      "Text": " of one frame, a very average frame, in case of wired network, it is around, say, 12 bytes or"
    },
    {
      "Time_Start": 175.94,
      "Time_End": 182.18,
      "Text": " 16 bytes, somewhere around that. I may be wrong in figures, but this is somewhere near to that,"
    },
    {
      "Time_Start": 182.18,
      "Time_End": 187.66,
      "Text": " right? Same thing about wireless networks. It's somewhere around 200 plus bytes, just in case,"
    },
    {
      "Time_Start": 187.66,
      "Time_End": 195.29999999999998,
      "Text": " if we happen to exploit certain behavioral traits of wireless network frames, IEEE 802.11 frames."
    },
    {
      "Time_Start": 195.3,
      "Time_End": 202.86,
      "Text": " So, that is how both of these combinations clubbed well, and then we've started learning"
    },
    {
      "Time_Start": 202.86,
      "Time_End": 209.26000000000002,
      "Text": " up, learning about it. Yes, there was one more thing that happened. I was initially working on"
    },
    {
      "Time_Start": 209.26000000000002,
      "Time_End": 216.02,
      "Text": " Avel side, sorry, client-side Avel twin detection in case of wireless. Again, there was same"
    },
    {
      "Time_Start": 216.02,
      "Time_End": 222.18,
      "Text": " question. Why am I supposed to face attack? Can I not simply avoid that attack all the way? So,"
    },
    {
      "Time_Start": 222.18,
      "Time_End": 230.18,
      "Text": " these all boiled down to my some exploration in code channels in wireless. So, initially,"
    },
    {
      "Time_Start": 230.18,
      "Time_End": 237.06,
      "Text": " my state of mind was like this, honestly. I was reading, reading, reading. I have been reading"
    },
    {
      "Time_Start": 237.06,
      "Time_End": 244.5,
      "Text": " almost like few hundred pages per day into that IEEE 802.11 standard, which is like 6,000 pages"
    },
    {
      "Time_Start": 244.5,
      "Time_End": 252.02,
      "Text": " big and everything. That was a lot of clutter, but slowly, when I started concentrating on"
    },
    {
      "Time_Start": 252.38000000000002,
      "Time_End": 260.74,
      "Text": " things repetitively, things started getting sorted. So, yes, that is how I came to know"
    },
    {
      "Time_Start": 260.74,
      "Time_End": 266.06,
      "Text": " about few facts about wireless networks, which have never been documented. So, there are always"
    },
    {
      "Time_Start": 266.06,
      "Time_End": 271.94,
      "Text": " pieces of story you see, which have never been described in theory. Purposely, those things are"
    },
    {
      "Time_Start": 271.94,
      "Time_End": 277.14,
      "Text": " kept from disclosing. There would be operational limitations, or there would be something else"
    },
    {
      "Time_Start": 277.62,
      "Time_End": 281.06,
      "Text": " that is basically defeating the motive of that standard. That's the reason they could not,"
    },
    {
      "Time_Start": 281.06,
      "Time_End": 286.97999999999996,
      "Text": " or would not have been able to include that into the documentation per se."
    },
    {
      "Time_Start": 288.26,
      "Time_End": 293.62,
      "Text": " And for such all things, even IEEE 802.11 standards is not an exception as well."
    },
    {
      "Time_Start": 295.14,
      "Time_End": 302.18,
      "Text": " So, some basics. I assume that some of us may not be much aware of what exactly happens in case of"
    },
    {
      "Time_Start": 302.26,
      "Time_End": 308.98,
      "Text": " wireless networks. So, I'm giving a very, very brief introduction for what exactly is access"
    },
    {
      "Time_Start": 308.98,
      "Time_End": 313.7,
      "Text": " point. If you see the animation at the center, there is some circle that's access point,"
    },
    {
      "Time_Start": 313.7,
      "Time_End": 318.58,
      "Text": " which is basically making available a network, or for that matter, network connectivity to"
    },
    {
      "Time_Start": 320.1,
      "Time_End": 325.38,
      "Text": " host in the local radio periphery. And if you see that WNIC, I understand the image is a little"
    },
    {
      "Time_Start": 325.38,
      "Time_End": 331.22,
      "Text": " blurred, but please spare me for that. So, that WNIC is nothing but the receivers, which are"
    },
    {
      "Time_Start": 331.22,
      "Time_End": 339.62,
      "Text": " actually availing wireless networks from that access point per se. So, back to the basics again."
    },
    {
      "Time_Start": 341.70000000000005,
      "Time_End": 351.46000000000004,
      "Text": " So, what exactly is IEEE blamed for? Many of us know IEEE 802.11 has been targeted since 1998. If"
    },
    {
      "Time_Start": 351.46000000000004,
      "Time_End": 356.1,
      "Text": " I'm not wrong, there have been a lot of attacks, different types of attacks, variety of attacks,"
    },
    {
      "Time_Start": 356.1,
      "Time_End": 365.3,
      "Text": " like authorization or deauth, and then there was WEP crack. I mean, on privacy, on connectivity,"
    },
    {
      "Time_Start": 365.3,
      "Time_End": 370.82000000000005,
      "Text": " every type of attack, I mean, on every type of aspect, majority of attacks have been so far done."
    },
    {
      "Time_Start": 372.42,
      "Time_End": 376.5,
      "Text": " So, is that kind of a loose link in client security? Obviously, yes,"
    },
    {
      "Time_Start": 376.5,
      "Time_End": 381.94,
      "Text": " because rogue access points poses a lot of threat. Eavesdropping, yes, another issue."
    },
    {
      "Time_Start": 386.74,
      "Time_End": 393.86,
      "Text": " So, victims, who all are victims? Now, let me edit this thing with a little bit of IoT devices as"
    },
    {
      "Time_Start": 393.86,
      "Time_End": 400.82000000000005,
      "Text": " well, plus mobiles, cameras, printers, gaming consoles, laptops, desktops, and all your"
    },
    {
      "Time_Start": 400.82000000000005,
      "Time_End": 407.54,
      "Text": " medical devices and whatnot. So, they all are available for exploitation per se."
    },
    {
      "Time_Start": 408.18,
      "Time_End": 416.26000000000005,
      "Text": " So, some basics again on modes. So, in case of wireless networks, we have certain modes"
    },
    {
      "Time_Start": 416.26000000000005,
      "Time_End": 421.54,
      "Text": " assigned to the devices we use, or rather there are more than around 14 modes on which the device"
    },
    {
      "Time_Start": 421.54,
      "Time_End": 428.42,
      "Text": " can be operated according to the document. I'm using just four of them, because one of these"
    },
    {
      "Time_Start": 428.42,
      "Time_End": 436.66,
      "Text": " four would be of interest of us. So, managed mode is nothing but a station, which could be a host,"
    },
    {
      "Time_Start": 436.66,
      "Time_End": 442.58000000000004,
      "Text": " could be a host, or could be your access point in certain cases. So, this could be your"
    },
    {
      "Time_Start": 444.34000000000003,
      "Time_End": 451.3,
      "Text": " example of host, a managed host, we can say. And then ad hoc, where you basically try to"
    },
    {
      "Time_Start": 451.3,
      "Time_End": 456.58000000000004,
      "Text": " edit the protocol stack, and then you try to use that protocol stack, which is not"
    },
    {
      "Time_Start": 456.58000000000004,
      "Time_End": 463.14000000000004,
      "Text": " thoroughly abiding by IEEE 2.11 standards, but working almost like 90%"
    },
    {
      "Time_Start": 464.09999999999997,
      "Time_End": 468.97999999999996,
      "Text": " to the functionality which is present into the IEEE 2.11 standards. So, that is nothing but your"
    },
    {
      "Time_Start": 468.97999999999996,
      "Time_End": 476.41999999999996,
      "Text": " ad hoc station mode. Then there is master mode, which is like access point, and then there are"
    },
    {
      "Time_Start": 476.41999999999996,
      "Time_End": 482.26,
      "Text": " monitor mode. Now, this is the mode which we would be using in most of the experimentation here."
    },
    {
      "Time_Start": 482.26,
      "Time_End": 489.21999999999997,
      "Text": " So, monitor mode basically gives your station or your wireless network interface card a"
    },
    {
      "Time_Start": 489.22,
      "Time_End": 494.82000000000005,
      "Text": " capability to basically sniff all the traffic which is directed or non-directed to that"
    },
    {
      "Time_Start": 494.82000000000005,
      "Time_End": 501.78000000000003,
      "Text": " particular host, as well allows you injecting any type of traffic, which again is not meant"
    },
    {
      "Time_Start": 501.78000000000003,
      "Time_End": 508.18,
      "Text": " for that particular network, or maybe meant for that network. So, some bookish definition,"
    },
    {
      "Time_Start": 508.74,
      "Time_End": 515.22,
      "Text": " code channel is a type of security attack that creates a capability to transfer information,"
    },
    {
      "Time_Start": 515.22,
      "Time_End": 518.98,
      "Text": " objects between processes that are not supposed to be allowed to communicate by the computer"
    },
    {
      "Time_Start": 518.98,
      "Time_End": 528.98,
      "Text": " security policy. So, there have always been a way to basically smuggle data over many frames,"
    },
    {
      "Time_Start": 528.98,
      "Time_End": 536.58,
      "Text": " for that matter, because, oh yes, before going further, our concentration of discussion here"
    },
    {
      "Time_Start": 536.58,
      "Time_End": 544.26,
      "Text": " would be on data link layer, that too specifically on broadcast frames. I'll come to that point,"
    },
    {
      "Time_Start": 544.26,
      "Time_End": 549.86,
      "Text": " like why exactly broadcast frames? So, we have been focusing on some aspects of data link layer,"
    },
    {
      "Time_Start": 549.86,
      "Time_End": 555.54,
      "Text": " and that too specifically on beacons and probes. Yes, this attack, I mean, we can run these type"
    },
    {
      "Time_Start": 555.54,
      "Time_End": 562.02,
      "Text": " of code channels on almost any frame, provided we have certain connectivity established,"
    },
    {
      "Time_Start": 562.02,
      "Time_End": 565.22,
      "Text": " but in case of probes, beacons and probes, we don't even need that."
    },
    {
      "Time_Start": 566.74,
      "Time_End": 572.02,
      "Text": " So, some basic types, management frames, control frames, and data frames, we are interested only"
    },
    {
      "Time_Start": 572.1,
      "Time_End": 576.9,
      "Text": " in management frames. And that too, for our discussion, we would be considering probe"
    },
    {
      "Time_Start": 576.9,
      "Time_End": 584.8199999999999,
      "Text": " request, probe response, and beacon. For this whole experimentation, we have used"
    },
    {
      "Time_Start": 584.8199999999999,
      "Time_End": 592.74,
      "Text": " SCPI as an instrument, which actually allowed us manipulating packet, forging or crafting packet as"
    },
    {
      "Time_Start": 592.74,
      "Time_End": 597.9399999999999,
      "Text": " well. So, that actually allowed us crafting a packet, which was not according to the standard,"
    },
    {
      "Time_Start": 597.94,
      "Time_End": 602.2600000000001,
      "Text": " but still it allowed me crafting that packet and allowed me injecting that packet as well."
    },
    {
      "Time_Start": 605.46,
      "Time_End": 612.2600000000001,
      "Text": " So, how we can basically craft a frame in SCPI? So, there are like these four layers we use."
    },
    {
      "Time_Start": 612.2600000000001,
      "Time_End": 618.74,
      "Text": " So, radio tap, .11, .11 beacon, slash .11 probe request, either of one you want to select,"
    },
    {
      "Time_Start": 618.74,
      "Time_End": 624.1800000000001,
      "Text": " and then .11 ELT. .11 ELT actually stands for information element. This is where we are trying"
    },
    {
      "Time_Start": 624.1800000000001,
      "Time_End": 631.3000000000001,
      "Text": " to ship our data over. So, for those who are interested in little more theory, this is basic"
    },
    {
      "Time_Start": 631.3000000000001,
      "Time_End": 636.82,
      "Text": " structure of beacon frame. So, what exactly is a beacon frame? Beacon frame is nothing but that"
    },
    {
      "Time_Start": 636.82,
      "Time_End": 646.2600000000001,
      "Text": " advertisement frame, which has been propagated by an access point to convey its presence into"
    },
    {
      "Time_Start": 646.2600000000001,
      "Time_End": 652.58,
      "Text": " the local radio periphery. So, that is how our devices come to know, here we have that particular"
    },
    {
      "Time_Start": 652.6600000000001,
      "Time_End": 658.6600000000001,
      "Text": " network PPNT something. So, how our devices come to know that, okay, this particular wireless"
    },
    {
      "Time_Start": 658.6600000000001,
      "Time_End": 663.3000000000001,
      "Text": " network is present in the local radio periphery, it is through that beacon frame, which has been"
    },
    {
      "Time_Start": 663.3000000000001,
      "Time_End": 670.1,
      "Text": " emitted by that wireless network having SSID PPNT or something. Let me see if we can."
    },
    {
      "Time_Start": 670.1,
      "Time_End": 683.86,
      "Text": " So, these all are wireless networks, and these basically these names are nothing but SSID,"
    },
    {
      "Time_Start": 683.86,
      "Time_End": 694.26,
      "Text": " service set identifiers. So, having said this, beacon frame does not require you to authenticate"
    },
    {
      "Time_Start": 694.26,
      "Time_End": 701.22,
      "Text": " with any host or any other device, which is accepting or understanding a particular frame,"
    },
    {
      "Time_Start": 702.8199999999999,
      "Time_End": 707.06,
      "Text": " does not even require to have a connectivity established earlier,"
    },
    {
      "Time_Start": 708.1,
      "Time_End": 711.9399999999999,
      "Text": " and that is the reason we have chosen this particular frame."
    },
    {
      "Time_Start": 713.86,
      "Time_End": 719.22,
      "Text": " And again, this is broadcast. So, we do not need to worry about the volume of frames,"
    },
    {
      "Time_Start": 719.22,
      "Time_End": 722.58,
      "Text": " which are available into the local radio periphery. You understand,"
    },
    {
      "Time_Start": 722.58,
      "Time_End": 727.14,
      "Text": " we need to be a little more deeper. So, this is how we can basically craft"
    },
    {
      "Time_Start": 729.38,
      "Time_End": 738.98,
      "Text": " beacon frame per se into the into SCP. So, this one is kind of sorry."
    },
    {
      "Time_Start": 741.14,
      "Time_End": 744.74,
      "Text": " So, this one actually specifies the radio tap layer telling"
    },
    {
      "Time_Start": 744.74,
      "Time_End": 752.5,
      "Text": " SCP that yes, we are using data link layer frame of IEEE 2.11 standard or for that matter radio"
    },
    {
      "Time_Start": 754.58,
      "Time_End": 761.54,
      "Text": " device, then dot 11 in that in bracket address 1, which is nothing but your destination address."
    },
    {
      "Time_Start": 761.54,
      "Time_End": 766.42,
      "Text": " Here we are supposed to put that is destination MAC address, which is all F means we are"
    },
    {
      "Time_Start": 766.42,
      "Time_End": 772.58,
      "Text": " broadcasting the frame. Address 2 is nothing but BSSID, address 3 as well is a BSSID."
    },
    {
      "Time_Start": 773.3000000000001,
      "Time_End": 784.4200000000001,
      "Text": " Now, this dot 11 beacon, this actually allows you giving capability of beacon to the particular"
    },
    {
      "Time_Start": 784.4200000000001,
      "Time_End": 789.86,
      "Text": " frame or for that particular wireless frame we can say. So, here we have mentioned the"
    },
    {
      "Time_Start": 789.86,
      "Time_End": 796.9000000000001,
      "Text": " capability, which actually is nothing but set of certain hardware information or certain hardware"
    },
    {
      "Time_Start": 796.98,
      "Time_End": 803.06,
      "Text": " capabilities here and then the comes the real stuff that is dot 11 ELT, which is nothing but"
    },
    {
      "Time_Start": 803.06,
      "Time_End": 813.78,
      "Text": " information elements. So, ID 0 represents SSID and it is basically kind of key value pair we can say"
    },
    {
      "Time_Start": 813.78,
      "Time_End": 819.78,
      "Text": " where we have ID 0 and then value for that ID is nothing but info and the info is nothing but"
    },
    {
      "Time_Start": 819.78,
      "Time_End": 824.42,
      "Text": " demo, demo, demo. So, here the service set identifier for this beacon frame would be demo,"
    },
    {
      "Time_Start": 824.4200000000001,
      "Time_End": 833.94,
      "Text": " demo, demo. So, this is repetitive, fine. So, there could be lot of information stuffed inside"
    },
    {
      "Time_Start": 833.94,
      "Time_End": 838.82,
      "Text": " such frames. So, that example we can see live as well and we will be seeing that soon."
    },
    {
      "Time_Start": 839.8600000000001,
      "Time_End": 843.8600000000001,
      "Text": " So, how can we go ahead with that? Edit the fields, which have better lens in order to ship"
    },
    {
      "Time_Start": 843.8600000000001,
      "Time_End": 852.34,
      "Text": " the data, interesting elements such as SSID, DSSA, TIM, rates, ESR states, TPC request responses,"
    },
    {
      "Time_Start": 852.34,
      "Time_End": 861.38,
      "Text": " country, etcetera. Well, I have actually got this list of elements from again IEEE 802 dot 11"
    },
    {
      "Time_Start": 861.38,
      "Time_End": 867.94,
      "Text": " standard. Some of the elements are here. If you want to go deeper and see all the elements,"
    },
    {
      "Time_Start": 868.5,
      "Time_End": 870.82,
      "Text": " I have got that page available made for you."
    },
    {
      "Time_Start": 870.82,
      "Time_End": 884.34,
      "Text": " So, it is basically here element ID and then the length of indicated elements."
    },
    {
      "Time_Start": 886.1,
      "Time_End": 894.74,
      "Text": " So, element ID we are supposed to show in that particular dot 11 ELT format where ID is supposed"
    },
    {
      "Time_Start": 894.74,
      "Time_End": 902.66,
      "Text": " to be 67 for that matter and length could be anything between 4 to 28 octet for that matter."
    },
    {
      "Time_Start": 902.66,
      "Time_End": 914.02,
      "Text": " So, that is how you can craft a frame. So, obviously I wanted to ship more data. So, I chose"
    },
    {
      "Time_Start": 914.82,
      "Time_End": 923.78,
      "Text": " little bigger length fields here. So, again the same question I think we have answered this thing."
    },
    {
      "Time_Start": 923.78,
      "Time_End": 929.38,
      "Text": " Beacon probe frames does not require auth or association to themselves being broadcast. So,"
    },
    {
      "Time_Start": 929.38,
      "Time_End": 933.22,
      "Text": " no need to zero down on host selection reduces the pain a little bit. So, this could be more"
    },
    {
      "Time_Start": 933.22,
      "Time_End": 938.8199999999999,
      "Text": " of a broadcast attack. We are not pinpointing on a specific user per se. Presence of these frames"
    },
    {
      "Time_Start": 938.8199999999999,
      "Time_End": 944.9,
      "Text": " in multitude in local wireless periphery is a common phenomena. So, there would not be any"
    },
    {
      "Time_Start": 944.9,
      "Time_End": 950.8199999999999,
      "Text": " suspicion raised just because there are like some hundreds of beacon frames available for specific"
    },
    {
      "Time_Start": 950.82,
      "Time_End": 956.9000000000001,
      "Text": " SSID. Again the multitude will always facilitate the larger chunk of the data to ship. Yes,"
    },
    {
      "Time_Start": 956.9000000000001,
      "Time_End": 962.58,
      "Text": " that is another possibility. Some fields allow pushing more than 250 bytes of data in a single"
    },
    {
      "Time_Start": 962.58,
      "Time_End": 970.1800000000001,
      "Text": " frame. So, initially I was trying to stuff 250 bytes into one particular field which was not"
    },
    {
      "Time_Start": 970.1800000000001,
      "Time_End": 975.62,
      "Text": " some way practical. It was taking somewhere around 208 bytes or something like that, but then same"
    },
    {
      "Time_Start": 975.62,
      "Time_End": 980.6600000000001,
      "Text": " time we can use multiple elements IDs to club a lot of data into it and can send it over."
    },
    {
      "Time_Start": 980.66,
      "Time_End": 985.2199999999999,
      "Text": " For this experimentation we have tested text data. We have not tested something else apart"
    },
    {
      "Time_Start": 985.2199999999999,
      "Time_End": 989.3,
      "Text": " from that. So, 250 bytes are quite enough for malicious payload if you have seen shellcode."
    },
    {
      "Time_Start": 990.1,
      "Time_End": 993.4599999999999,
      "Text": " They usually come like 50 bytes, 90 bytes or something like that."
    },
    {
      "Time_Start": 996.02,
      "Time_End": 1002.18,
      "Text": " So, some representative example here. We have used a traffic indication map as one of the"
    },
    {
      "Time_Start": 1002.18,
      "Time_End": 1008.8199999999999,
      "Text": " fields where we can stuff the data. So, partial virtual bitmap field into the traffic indication"
    },
    {
      "Time_Start": 1008.82,
      "Time_End": 1014.58,
      "Text": " map actually allows you shipping around 250 bytes of data. At early stages it was easy,"
    },
    {
      "Time_Start": 1014.58,
      "Time_End": 1019.94,
      "Text": " really easy to fabricate as I was struggling a lot with KPE as well as trying to understand"
    },
    {
      "Time_Start": 1019.94,
      "Time_End": 1026.42,
      "Text": " the architecture and lot of things. So, is the reason we have chosen TIM initially and later"
    },
    {
      "Time_Start": 1026.42,
      "Time_End": 1033.94,
      "Text": " we have got like majority of frames working on the same. Is it visible in a? No, okay."
    },
    {
      "Time_Start": 1034.3400000000001,
      "Time_End": 1041.3,
      "Text": " I do not know if this could be assumed. Okay, I will share the slides plus the scripts would"
    },
    {
      "Time_Start": 1041.3,
      "Time_End": 1045.06,
      "Text": " be available online as well. So, that should not be a problem. This is just a representative"
    },
    {
      "Time_Start": 1045.06,
      "Time_End": 1051.54,
      "Text": " example. We will be having a demo now. So, here we have actually used a probe request"
    },
    {
      "Time_Start": 1051.54,
      "Time_End": 1059.6200000000001,
      "Text": " to basically ship a data over TIM into it and now is the demo time. So, we would be"
    },
    {
      "Time_Start": 1060.1000000000001,
      "Time_End": 1063.5400000000002,
      "Text": " we would be doing it live. So, I think that should help."
    },
    {
      "Time_Start": 1065.3000000000002,
      "Time_End": 1074.42,
      "Text": " So, we have used some basic instance of Kali Linux per se and some script here."
    },
    {
      "Time_Start": 1074.42,
      "Time_End": 1093.22,
      "Text": " Can I, is it, oh."
    },
    {
      "Time_Start": 1093.94,
      "Time_End": 1098.02,
      "Text": " So,"
    },
    {
      "Time_Start": 1104.1000000000001,
      "Time_End": 1112.02,
      "Text": " can somebody help me with bringing in the VM instance onto the screen?"
    },
    {
      "Time_Start": 1112.82,
      "Time_End": 1126.82,
      "Text": " Okay, probably change the mode of the from the extents to duplicate, but I do not know"
    },
    {
      "Time_Start": 1127.06,
      "Time_End": 1127.62,
      "Text": " shortcuts."
    },
    {
      "Time_Start": 1134.8999999999999,
      "Time_End": 1139.62,
      "Text": " Let us see if we can do it this way."
    },
    {
      "Time_Start": 1153.22,
      "Time_End": 1154.34,
      "Text": " That is not happening."
    },
    {
      "Time_Start": 1156.82,
      "Time_End": 1165.62,
      "Text": " Yeah,"
    },
    {
      "Time_Start": 1171.86,
      "Time_End": 1179.62,
      "Text": " yeah, probably it will work, yes."
    },
    {
      "Time_Start": 1180.5000000000002,
      "Time_End": 1191.5400000000002,
      "Text": " So, here is some set of scripts, same logic we have used there as well. I think"
    },
    {
      "Time_Start": 1194.98,
      "Time_End": 1204.42,
      "Text": " not maximizing either. What happened? Okay,"
    },
    {
      "Time_Start": 1204.42,
      "Time_End": 1223.0600000000002,
      "Text": " perfect. Okay. So, we have used the same old Airmon NG basically to tune on our wireless"
    },
    {
      "Time_Start": 1223.0600000000002,
      "Time_End": 1231.22,
      "Text": " network interface card on monitor mode and if you see the config here, it has already been"
    },
    {
      "Time_Start": 1231.78,
      "Time_End": 1237.06,
      "Text": " tuned on to monitor mode. Yeah."
    },
    {
      "Time_Start": 1242.74,
      "Time_End": 1252.02,
      "Text": " So, then, so this is basic script we have used. In SCP, we have imported SCP in Python and then"
    },
    {
      "Time_Start": 1252.02,
      "Time_End": 1257.38,
      "Text": " sys module as well and then the same thing that we have seen in the earlier slide, we have used"
    },
    {
      "Time_Start": 1257.38,
      "Time_End": 1272.98,
      "Text": " little more differently here we can say. So, so far, everything is good here."
    },
    {
      "Time_Start": 1273.8600000000001,
      "Time_End": 1286.5,
      "Text": " So, the SSID we have assigned as radioactive and the element, not 11 elements, we have used"
    },
    {
      "Time_Start": 1286.5,
      "Time_End": 1293.54,
      "Text": " is 36, which again is because it is giving me somewhere around like 255 bytes of data to be"
    },
    {
      "Time_Start": 1293.54,
      "Time_End": 1305.94,
      "Text": " shipped and that is the data that I have shipped into that particular frame. We have used sendp"
    },
    {
      "Time_Start": 1305.94,
      "Time_End": 1313.46,
      "Text": " because we are sending this particular frame. So, just make SCP instance understand that we"
    },
    {
      "Time_Start": 1313.46,
      "Time_End": 1319.06,
      "Text": " are doing or rather we are injecting a data link layer frame. It is a sendp"
    },
    {
      "Time_Start": 1319.3,
      "Time_End": 1327.3,
      "Text": " keyword that we use and then that is interface, which is like wlan0mon, which is nothing but your"
    },
    {
      "Time_Start": 1327.3,
      "Time_End": 1335.3799999999999,
      "Text": " monitor mode enabled interface and then count is someone 10,000, okay, 1 lakh. So, this could be"
    },
    {
      "Time_Start": 1335.3799999999999,
      "Time_End": 1339.86,
      "Text": " anything. So, it is just for the verbosity purpose, I have put it little bigger number here."
    },
    {
      "Time_Start": 1339.94,
      "Time_End": 1346.1000000000001,
      "Text": " So, now let us see if we can run this thing. Python,"
    },
    {
      "Time_Start": 1352.1000000000001,
      "Time_End": 1358.98,
      "Text": " okay. So, now let us enable Wireshark."
    },
    {
      "Time_Start": 1369.8600000000001,
      "Time_End": 1393.7,
      "Text": " I think, okay, yes. So, you can see into broadcast frame, it is SSID radioactive,"
    },
    {
      "Time_Start": 1393.7,
      "Time_End": 1398.3400000000001,
      "Text": " which is nothing but our cooked frame per se and if we go little deeper here,"
    },
    {
      "Time_Start": 1399.46,
      "Time_End": 1407.22,
      "Text": " just to see what exactly is data, we can easily find it here."
    },
    {
      "Time_Start": 1411.06,
      "Time_End": 1413.8600000000001,
      "Text": " So, this was our data altogether."
    },
    {
      "Time_Start": 1414.7400000000002,
      "Time_End": 1426.2600000000002,
      "Text": " So, this was element ID 36 we have fabricated here. Same thing we have, okay, yes. So,"
    },
    {
      "Time_Start": 1426.26,
      "Time_End": 1442.66,
      "Text": " I have couple of more IDs as well. So, say 2 to 1."
    },
    {
      "Time_Start": 1442.66,
      "Time_End": 1453.0600000000002,
      "Text": " So,"
    },
    {
      "Time_Start": 1453.0600000000002,
      "Time_End": 1467.0600000000002,
      "Text": " you can say same thing here as well."
    },
    {
      "Time_Start": 1467.06,
      "Time_End": 1477.46,
      "Text": " So,"
    },
    {
      "Time_Start": 1479.06,
      "Time_End": 1479.46,
      "Text": " okay."
    },
    {
      "Time_Start": 1479.46,
      "Time_End": 1487.8600000000001,
      "Text": " So,"
    },
    {
      "Time_Start": 1489.6200000000001,
      "Time_End": 1490.9,
      "Text": " and now see the data here."
    },
    {
      "Time_Start": 1497.38,
      "Time_End": 1501.8600000000001,
      "Text": " This is amount of data I was able to basically ship over broadcast frame."
    },
    {
      "Time_Start": 1503.22,
      "Time_End": 1508.74,
      "Text": " I honestly have not tested this executability of this particular data. Can we make it executable"
    },
    {
      "Time_Start": 1508.74,
      "Time_End": 1512.02,
      "Text": " onto the remote host or what? But if that happens, then definitely that could be"
    },
    {
      "Time_Start": 1513.38,
      "Time_End": 1521.06,
      "Text": " new mess of that could occur into the wireless network, IEEE 2.11 standard."
    },
    {
      "Time_Start": 1521.06,
      "Time_End": 1527.14,
      "Text": " So, why exactly I have opted for this data? It is because of, I mean, for this particular ID,"
    },
    {
      "Time_Start": 1528.02,
      "Time_End": 1533.94,
      "Text": " that is 2 to 6 and couple of more as well because while I was going through the document here,"
    },
    {
      "Time_Start": 1539.7,
      "Time_End": 1545.7,
      "Text": " okay."
    },
    {
      "Time_Start": 1555.7,
      "Time_End": 1562.66,
      "Text": " So, these reserved elements at the end actually caught my attention. So, they have no length"
    },
    {
      "Time_Start": 1562.66,
      "Time_End": 1568.02,
      "Text": " specified. Just to try like what exactly can be done with these no length specified fields,"
    },
    {
      "Time_Start": 1568.02,
      "Time_End": 1574.82,
      "Text": " I have showed in certain data which was very well accepted by each ID around 208 bytes of"
    },
    {
      "Time_Start": 1574.82,
      "Time_End": 1583.94,
      "Text": " data was accepted and that is how I have forced around like 4, 5 IDs starting to 222 to like 228,"
    },
    {
      "Time_Start": 1583.94,
      "Time_End": 1590.18,
      "Text": " 229 and it gave me like a chunk of data to be shipped over into the broadcast frame."
    },
    {
      "Time_Start": 1590.18,
      "Time_End": 1595.22,
      "Text": " So,"
    },
    {
      "Time_Start": 1601.8600000000001,
      "Time_End": 1605.54,
      "Text": " this is actually a recorded demo just in case somebody wants, he can refer to."
    },
    {
      "Time_Start": 1609.6200000000001,
      "Time_End": 1614.98,
      "Text": " So, issues with this approach, deep packet inspection firewall may prove of trouble here"
    },
    {
      "Time_Start": 1614.98,
      "Time_End": 1620.66,
      "Text": " just in case if they happen to investigate broadcast frames, that could be the scenario."
    },
    {
      "Time_Start": 1620.66,
      "Time_End": 1625.54,
      "Text": " Reordering the data at receiver end, yes, that is still not possible because this is"
    },
    {
      "Time_Start": 1625.54,
      "Time_End": 1629.38,
      "Text": " again a broadcast scenario and on the top of it, this is not reliable"
    },
    {
      "Time_Start": 1630.1,
      "Time_End": 1636.74,
      "Text": " connection that we are trying to establish. No retrieval of lost frames, yes, there is no"
    },
    {
      "Time_Start": 1636.74,
      "Time_End": 1642.5,
      "Text": " mechanism basically to retrieve lost frames. We are not keeping any account of the frames which"
    },
    {
      "Time_Start": 1642.5,
      "Time_End": 1652.02,
      "Text": " have been injected into the local radio periphery. While I was delivering same talk in DEFCON,"
    },
    {
      "Time_Start": 1652.74,
      "Time_End": 1656.74,
      "Text": " one researcher from audience, he gave me some clue about some of"
    },
    {
      "Time_Start": 1657.86,
      "Time_End": 1662.98,
      "Text": " ransomware using a similar technique basically to sequence data in some"
    },
    {
      "Time_Start": 1663.06,
      "Time_End": 1673.06,
      "Text": " in some not very standard connectivity mechanism and we are trying to implement same thing in case"
    },
    {
      "Time_Start": 1673.06,
      "Time_End": 1679.78,
      "Text": " of IEEE to 2.11 as well. Honestly, there are a lot of things we are yet to understand in"
    },
    {
      "Time_Start": 1679.78,
      "Time_End": 1684.1,
      "Text": " order to implement that thing in detail, but yes, that is still work in progress"
    },
    {
      "Time_Start": 1684.66,
      "Time_End": 1688.9800000000002,
      "Text": " and yes, that is much of my presentation here."
    },
    {
      "Time_Start": 1690.42,
      "Time_End": 1697.3000000000002,
      "Text": " Acknowledgement, I really thank my family inventors for supporting me in this. Vivek"
    },
    {
      "Time_Start": 1697.3000000000002,
      "Time_End": 1706.3400000000001,
      "Text": " Ramchandran specifically for his very informative and very practical literature on to wireless"
    },
    {
      "Time_Start": 1706.9800000000002,
      "Time_End": 1712.5800000000002,
      "Text": " security mega primer or rather wireless security as well as on to scripting,"
    },
    {
      "Time_Start": 1712.58,
      "Time_End": 1719.6999999999998,
      "Text": " Wi-Fi pentesting tools in Python as well and definitely for ZIFCON for allowing me and giving"
    },
    {
      "Time_Start": 1719.6999999999998,
      "Time_End": 1726.5,
      "Text": " me an opportunity to deliver my some small finding here. Thank you very much. These are"
    },
    {
      "Time_Start": 1727.86,
      "Time_End": 1734.1799999999998,
      "Text": " locations where I can be approached. If I can be of any help to make you understand what I"
    },
    {
      "Time_Start": 1734.1799999999998,
      "Time_End": 1740.02,
      "Text": " have learned in a better way, I would be more than happy to answer. Plus, if you have any queries of"
    },
    {
      "Time_Start": 1740.02,
      "Time_End": 1750.9,
      "Text": " now, I will be able to answer them if I can."
    }
  ]
}