{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 25.8,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hello, everyone. My name is Kuba Gretzky. Do we see the slides? Okay, I think it worked"
    },
    {
      "Time_Start": 25.8,
      "Time_End": 33.44,
      "Text": " before. Okay, nevermind. My name is Kuba Gretzky. I am an independent contractor. I do reverse"
    },
    {
      "Time_Start": 33.44,
      "Time_End": 40.36,
      "Text": " engineering, software developer, security researcher. Basically, I started around ten"
    },
    {
      "Time_Start": 40.36,
      "Time_End": 47.56,
      "Text": " years ago. I started by reverse engineering massive multiplayer online games. You know,"
    },
    {
      "Time_Start": 47.56,
      "Time_End": 53.760000000000005,
      "Text": " these ones where you hunt boars and sit in the forest and just hack one by one. So, basically,"
    },
    {
      "Time_Start": 53.76,
      "Time_End": 62.64,
      "Text": " I made an automation tool that allowed the player to move by himself. And then it collected"
    },
    {
      "Time_Start": 62.64,
      "Time_End": 69.96,
      "Text": " loot and everything like that. But today, I want to talk exactly about my Wi-Fi project,"
    },
    {
      "Time_Start": 69.96,
      "Time_End": 75.88,
      "Text": " which is basically a penetration testing device, something like the Pineapple but with a bit"
    },
    {
      "Time_Start": 75.88,
      "Time_End": 83.72,
      "Text": " of a twist. So, basically, the whole presentation will be a live demo, so there is nothing"
    },
    {
      "Time_Start": 83.72,
      "Time_End": 93.36,
      "Text": " that can go wrong. So, as you can see on the stage right over here, this is like a"
    },
    {
      "Time_Start": 93.36,
      "Time_End": 98.68,
      "Text": " spider-looking device. It's a proof of concept right now. I don't have like a custom case"
    },
    {
      "Time_Start": 98.68,
      "Time_End": 107.08,
      "Text": " for it. So, basically, it just looks what it looks like. So, this is like the main control"
    },
    {
      "Time_Start": 107.08,
      "Time_End": 114.32,
      "Text": " panel. So, this thing actually is for the red teamers. Probably there are a lot of penetration"
    },
    {
      "Time_Start": 114.32,
      "Time_End": 120.2,
      "Text": " testers around here that may be willing to use this kind of thing. And basically, you"
    },
    {
      "Time_Start": 120.2,
      "Time_End": 126.03999999999999,
      "Text": " keep this thing in your backpack or I don't know, in your, you keep it concealed on yourself"
    },
    {
      "Time_Start": 126.03999999999999,
      "Time_End": 131.56,
      "Text": " and you can access it through your mobile phone. So, basically, you create an access"
    },
    {
      "Time_Start": 131.56,
      "Time_End": 139.12,
      "Text": " point on your mobile phone, it connects back to you with the in-built wireless adapter"
    },
    {
      "Time_Start": 139.12,
      "Time_End": 144.56,
      "Text": " and then it allows you to SSH into it and control it from your phone. Of course, the"
    },
    {
      "Time_Start": 144.56,
      "Time_End": 152.68,
      "Text": " phone screen is a little small, so it's for the people with good eyesight mostly. So,"
    },
    {
      "Time_Start": 152.68,
      "Time_End": 159.48000000000002,
      "Text": " right now, it's connected to my PC and this is the interface. So, basically, what I will"
    },
    {
      "Time_Start": 159.48,
      "Time_End": 166.28,
      "Text": " try to do here is that the option 3 is scanning all the nearby networks. This is mainly for"
    },
    {
      "Time_Start": 166.28,
      "Time_End": 177.95999999999998,
      "Text": " doing some recon on-site. I press enter to refresh all the networks that are around."
    },
    {
      "Time_Start": 177.95999999999998,
      "Time_End": 184.72,
      "Text": " So, you can see there is a Salki, PPNT2, things like that that you have running on your phone."
    },
    {
      "Time_Start": 184.72,
      "Time_End": 191.68,
      "Text": " And here are also the clients below. So, the clients will also show up the probes as"
    },
    {
      "Time_Start": 191.68,
      "Time_End": 198.16,
      "Text": " well if you have like a device that is actively looking for networks. So, that can give you"
    },
    {
      "Time_Start": 198.16,
      "Time_End": 204.84,
      "Text": " an idea what is your, where is the phone that you actually want to hijack or things like"
    },
    {
      "Time_Start": 204.84,
      "Time_End": 212.32,
      "Text": " that. And from here, you can actually add the targets. So, for example, we pick the"
    },
    {
      "Time_Start": 212.32,
      "Time_End": 218.2,
      "Text": " targets from all the clients that we have managed to see. So, I don't know, probably"
    },
    {
      "Time_Start": 218.2,
      "Time_End": 225.12,
      "Text": " some of these are yours. Okay, let's maybe pick something, I don't know, number 7. Of"
    },
    {
      "Time_Start": 225.12,
      "Time_End": 234.48,
      "Text": " course, I was told to not do any actual hacking because probably of some legal reasons. Probably."
    },
    {
      "Time_Start": 234.48,
      "Time_End": 241.12,
      "Text": " Okay. So, yeah, basically, this is one feature. I'll try to keep it short because I don't"
    },
    {
      "Time_Start": 241.12,
      "Time_End": 247.48000000000002,
      "Text": " have much time. So, yeah, basically, you're able to scan for the devices, then you can"
    },
    {
      "Time_Start": 247.48000000000002,
      "Time_End": 254.52,
      "Text": " create your, you can connect to the network that you want by entering the password, of"
    },
    {
      "Time_Start": 254.52,
      "Time_End": 259.24,
      "Text": " course, and picking the SSID that you want to use. You can also create your own access"
    },
    {
      "Time_Start": 259.24,
      "Time_End": 266.16,
      "Text": " point that you will be using. So, here is the interesting part. I worked on the way"
    },
    {
      "Time_Start": 266.28000000000003,
      "Time_End": 271.88000000000005,
      "Text": " to tether the internet for all the users that connect back to your access point. So, basically,"
    },
    {
      "Time_Start": 271.88000000000005,
      "Time_End": 281.08000000000004,
      "Text": " you can share the internet connection either from your phone or through the wireless access"
    },
    {
      "Time_Start": 281.08000000000004,
      "Time_End": 289.24,
      "Text": " point that the other adapter is connected to. So, basically, one adapter is for monitoring,"
    },
    {
      "Time_Start": 289.24,
      "Time_End": 296.52,
      "Text": " so it uses scanning all the nearby networks. One is for active connection to any network"
    },
    {
      "Time_Start": 296.52,
      "Time_End": 302.36,
      "Text": " that you choose. And the third one is basically used for deauthentication. If you want to"
    },
    {
      "Time_Start": 302.36,
      "Time_End": 307.92,
      "Text": " deauthenticate any client and make them connect back to your network, which you have a password"
    },
    {
      "Time_Start": 307.92,
      "Time_End": 317.96000000000004,
      "Text": " for or not, then it's perfect. So, basically, here, yeah, I don't have actually any internet"
    },
    {
      "Time_Start": 317.96,
      "Time_End": 325.23999999999995,
      "Text": " connection on my PC, so I'll just control C from it. So, basically, the main, you may"
    },
    {
      "Time_Start": 325.23999999999995,
      "Time_End": 332.08,
      "Text": " say it's similar to Wi-Fi Pineapple, right? But the main, like, thing that is at the core"
    },
    {
      "Time_Start": 332.08,
      "Time_End": 339.4,
      "Text": " of this tool is the HTTP proxy that I wrote in C++, and I tried to make it as efficient"
    },
    {
      "Time_Start": 339.4,
      "Time_End": 346.24,
      "Text": " as possible because there were solutions like Ethercap before. There is Bettercap in Ruby,"
    },
    {
      "Time_Start": 346.24,
      "Time_End": 352.6,
      "Text": " but I wanted my own that is written in C++, which is fast, efficient, and actually is"
    },
    {
      "Time_Start": 352.6,
      "Time_End": 362.0,
      "Text": " able to pass all the requests and make them go through like in a blast. So, that thing"
    },
    {
      "Time_Start": 362.0,
      "Time_End": 367.04,
      "Text": " you actually can see, so I'll actually demonstrate how the attacks look like when you're already"
    },
    {
      "Time_Start": 367.04,
      "Time_End": 372.40000000000003,
      "Text": " on the network or you have clients connected back to you on your network that you have"
    },
    {
      "Time_Start": 372.48,
      "Time_End": 386.40000000000003,
      "Text": " hosted. So, okay, so this is the interface that was made just in case the live demo goes bad."
    },
    {
      "Time_Start": 386.40000000000003,
      "Time_End": 395.48,
      "Text": " Okay, so this is an active attack. You can make actually any computer that uses HTTP connection"
    },
    {
      "Time_Start": 395.48,
      "Time_End": 401.6,
      "Text": " to be redirected to the fake browser update page. This is like custom made for every browser,"
    },
    {
      "Time_Start": 401.92,
      "Time_End": 407.68,
      "Text": " Firefox, Chrome, Internet Explorer. You can see in the address bar there is download Google.com,"
    },
    {
      "Time_Start": 407.68,
      "Time_End": 415.36,
      "Text": " so it looks pretty legit except for the no HTTPS, naturally. This can be tricky to implement,"
    },
    {
      "Time_Start": 415.36,
      "Time_End": 420.84000000000003,
      "Text": " actually. I haven't found a way to do it, but then it automatically downloads an exe file,"
    },
    {
      "Time_Start": 420.84000000000003,
      "Time_End": 428.96000000000004,
      "Text": " then on Firefox looks like this, and basically, this is like a stub, this exe file. This is a"
    },
    {
      "Time_Start": 428.96000000000004,
      "Time_End": 438.20000000000005,
      "Text": " custom software that I wrote. This is simply a downloader which downloads the real update from"
    },
    {
      "Time_Start": 438.20000000000005,
      "Time_End": 445.28000000000003,
      "Text": " the Internet, and after it downloads, it executes PowerShell, so you can implement it with Empire"
    },
    {
      "Time_Start": 445.28000000000003,
      "Time_End": 453.84000000000003,
      "Text": " or something like that. It's pretty simple. And the other attack is this actually will redirect"
    },
    {
      "Time_Start": 453.84000000000003,
      "Time_End": 463.68,
      "Text": " every visitor to a fake Google login page, and you can see the domain is actually accounts.google.com.w"
    },
    {
      "Time_Start": 463.68,
      "Time_End": 470.28000000000003,
      "Text": " because it cannot be Google.com because of HSTS protection, which actually makes all modern"
    },
    {
      "Time_Start": 470.28000000000003,
      "Time_End": 479.84000000000003,
      "Text": " browser force HTTPS on known domains, like Google.com. It's like sent in the response"
    },
    {
      "Time_Start": 479.84000000000003,
      "Time_End": 488.48,
      "Text": " from the servers. So basically, I had to change the domain to make it look similar but still be"
    },
    {
      "Time_Start": 488.48,
      "Time_End": 498.08000000000004,
      "Text": " different, do the DNS spoofing, then SSL stripping, and it actually proxies the real Google sign-in"
    },
    {
      "Time_Start": 498.08000000000004,
      "Time_End": 505.84000000000003,
      "Text": " page back to the user, so actually, when they log in, put all their credentials, the credentials"
    },
    {
      "Time_Start": 505.96000000000004,
      "Time_End": 512.48,
      "Text": " are intercepted, and as well, the session token cookies. So then you have full control over the"
    },
    {
      "Time_Start": 512.48,
      "Time_End": 520.64,
      "Text": " person's account. So basically, you can even connect from a different IP address, and you can use the"
    },
    {
      "Time_Start": 520.64,
      "Time_End": 529.52,
      "Text": " account as its own. Yeah, so basically, I'll show maybe a bit more. How much time do we have still?"
    },
    {
      "Time_Start": 529.52,
      "Time_End": 540.04,
      "Text": " Okay. Okay, so do I have still something to show you? Sorry for a low quality of slides, but I had"
    },
    {
      "Time_Start": 540.04,
      "Time_End": 546.92,
      "Text": " like one hour before the party yesterday to prepare it. So yeah, basically, you can also plug in a modem"
    },
    {
      "Time_Start": 546.92,
      "Time_End": 554.16,
      "Text": " to it, so you can use the modem to actually share the internet connection. And right now, let's see"
    },
    {
      "Time_Start": 554.16,
      "Time_End": 574.8,
      "Text": " if it connects. It's using WVDial. Yep, seems it worked. Or not. Yeah, sometimes, unfortunately, I have an"
    },
    {
      "Time_Start": 575.0000000000001,
      "Time_End": 585.36,
      "Text": " issue with this feature. So basically, my idea is to present, I don't know still what to do with this tool."
    },
    {
      "Time_Start": 585.36,
      "Time_End": 594.36,
      "Text": " So I may release it at some point, or I may not. And basically, it will be to help to be used by penetration"
    },
    {
      "Time_Start": 594.36,
      "Time_End": 603.2400000000001,
      "Text": " testers to ease their job. And basically, I wanted to show it to you to get feedback from you, just so that you"
    },
    {
      "Time_Start": 603.24,
      "Time_End": 608.6,
      "Text": " can tell me what else would you like me to implement or things like that. Of course, I plan to add the"
    },
    {
      "Time_Start": 608.6,
      "Time_End": 618.24,
      "Text": " responder to it to intercept the SMB requests and things like that. But yeah, we have some time. Yeah, okay."
    },
    {
      "Time_Start": 618.24,
      "Time_End": 631.12,
      "Text": " Final slide. Oh yeah, and also important thing. There's the other project Evil Jinx that I released a couple of"
    },
    {
      "Time_Start": 631.12,
      "Time_End": 637.12,
      "Text": " weeks ago and made a big update the day before yesterday. This actually, the thing that I showed you for proxying"
    },
    {
      "Time_Start": 637.12,
      "Time_End": 644.52,
      "Text": " the real Google website and capturing the credentials and with the cookies, this is actually the method that uses"
    },
    {
      "Time_Start": 644.52,
      "Time_End": 652.32,
      "Text": " the NGINX server to do it remotely. So if you like, you can check it out. It's free and completely modular."
    },
    {
      "Time_Start": 652.32,
      "Time_End": 653.32,
      "Text": " So thank you."
    },
    {
      "Time_Start": 653.32,
      "Time_End": 664.32,
      "Text": " If you have any questions. Okay, first question here."
    },
    {
      "Time_Start": 664.32,
      "Time_End": 672.32,
      "Text": " Have you thought about or maybe already added a WPS query?"
    },
    {
      "Time_Start": 673.32,
      "Time_End": 683.32,
      "Text": " WPS. Yeah, actually, there is also, I haven't showed it, but there is a Wi-Fi cracker that is actually with my own"
    },
    {
      "Time_Start": 683.32,
      "Time_End": 692.32,
      "Text": " updates because it hasn't been updated for several years. And it actually does the reaver to crack the WPS things."
    },
    {
      "Time_Start": 692.32,
      "Time_End": 697.32,
      "Text": " Also, it captures the handshakes and things like that. So yeah, it basically does everything by itself."
    },
    {
      "Time_Start": 697.32,
      "Time_End": 700.32,
      "Text": " Yeah, unfortunately, too many people still have that carried on by default."
    },
    {
      "Time_Start": 700.32,
      "Time_End": 713.32,
      "Text": " Yeah, exactly. But it depends on what kind of router you have to make it exploitable."
    },
    {
      "Time_Start": 713.32,
      "Time_End": 718.32,
      "Text": " No more questions? Okay, thank you very much. I hope you enjoyed the presentation."
    },
    {
      "Time_Start": 718.32,
      "Time_End": 725.32,
      "Text": " And hit me up afterwards so that I can give you some feedback, probably."
    },
    {
      "Time_Start": 730.32,
      "Time_End": 733.32,
      "Text": " Thank you."
    }
  ]
}