{"segments": [{"Time_Start": 0.0, "Time_End": 17.0, "Text": " How's everyone here enjoying DefCon 11?"}, {"Time_Start": 17.0, "Time_End": 21.0, "Text": " Fucking A!"}, {"Time_Start": 21.0, "Time_End": 26.0, "Text": " See, this is DefCon, this is not Black Hat, so I can say fucking A."}, {"Time_Start": 26.0, "Time_End": 29.0, "Text": " Alright, so I'm here to fuck with your heads."}, {"Time_Start": 29.0, "Time_End": 30.0, "Text": " That's the job."}, {"Time_Start": 30.0, "Time_End": 32.0, "Text": " Work for Avaya now."}, {"Time_Start": 32.0, "Time_End": 33.0, "Text": " They don't give a fuck."}, {"Time_Start": 33.0, "Time_End": 35.0, "Text": " I'm still here to fuck with your heads."}, {"Time_Start": 35.0, "Time_End": 36.0, "Text": " There."}, {"Time_Start": 36.0, "Time_End": 38.0, "Text": " So what are we here to talk about?"}, {"Time_Start": 38.0, "Time_End": 41.0, "Text": " Peace through superior firepower."}, {"Time_Start": 41.0, "Time_End": 43.0, "Text": " That is my philosophy of security."}, {"Time_Start": 43.0, "Time_End": 45.0, "Text": " History."}, {"Time_Start": 45.0, "Time_End": 49.0, "Text": " Last year I came out here, talked about Black Ops at TCP IP."}, {"Time_Start": 49.0, "Time_End": 51.0, "Text": " This is sort of the sequel talk."}, {"Time_Start": 51.0, "Time_End": 52.0, "Text": " This is me saying great."}, {"Time_Start": 52.0, "Time_End": 54.0, "Text": " Found lots and lots of cool little primitives."}, {"Time_Start": 54.0, "Time_End": 56.0, "Text": " Let's go ahead and make some applied services."}, {"Time_Start": 56.0, "Time_End": 59.0, "Text": " Let's see what the result is of all the research from last year."}, {"Time_Start": 59.0, "Time_End": 60.0, "Text": " year."}, {"Time_Start": 60.0, "Time_End": 61.0, "Text": " It's kind of fun."}, {"Time_Start": 61.0, "Time_End": 64.0, "Text": " We didn't even have the collection of tools that implemented everything last year."}, {"Time_Start": 64.0, "Time_End": 67.0, "Text": " We didn't have this Paqueto Kiwetsu."}, {"Time_Start": 67.0, "Time_End": 73.0, "Text": " See, I have to pronounce this correctly, because if I don't, every time this very friendly Japanese"}, {"Time_Start": 73.0, "Time_End": 77.0, "Text": " person walks up and says, it's not Kairetsu."}, {"Time_Start": 77.0, "Time_End": 85.0, "Text": " So basically we had a collection of tools, really fast port scanner, implementations in that,"}, {"Time_Start": 85.0, "Time_End": 88.0, "Text": " implementations have made network access a lot easier."}, {"Time_Start": 88.0, "Time_End": 90.0, "Text": " lot easier, a bunch of toys."}, {"Time_Start": 90.0, "Time_End": 92.0, "Text": " So the goal is to bring new tools to the table."}, {"Time_Start": 92.0, "Time_End": 97.0, "Text": " To keep with the primary advantage of being a defender,"}, {"Time_Start": 97.0, "Time_End": 103.0, "Text": " which is you, and of course the irony being is off the screen, but you don't need to be stealthy."}, {"Time_Start": 103.0, "Time_End": 104.0, "Text": " You don't."}, {"Time_Start": 104.0, "Time_End": 105.0, "Text": " It's really funny."}, {"Time_Start": 105.0, "Time_End": 107.0, "Text": " Latest 2,600 actually mentioned ScanRand."}, {"Time_Start": 107.0, "Time_End": 113.0, "Text": " And it says, oh yeah, I showed up on this network, and I like scanned it stealthily with ScanRand."}, {"Time_Start": 113.0, "Time_End": 117.0, "Text": " This is code that like spews packets at tens of thousands."}, {"Time_Start": 117.0, "Time_End": 118.9, "Text": " at tens of thousands per second."}, {"Time_Start": 119.44, "Time_End": 121.04, "Text": " This not equal stealth."}, {"Time_Start": 121.44, "Time_End": 122.6, "Text": " Just so you all know."}, {"Time_Start": 123.24, "Time_End": 123.6, "Text": " Uh-uh."}, {"Time_Start": 124.24, "Time_End": 127.36, "Text": " So, Black Hat."}, {"Time_Start": 127.66, "Time_End": 130.66, "Text": " Well, the Black Hat guys actually went ahead and they have the reason the code's out."}, {"Time_Start": 131.06, "Time_End": 132.8, "Text": " So that link should work."}, {"Time_Start": 133.48, "Time_End": 134.32, "Text": " It could work."}, {"Time_Start": 134.7, "Time_End": 135.54, "Text": " It don't work."}, {"Time_Start": 135.9, "Time_End": 138.6, "Text": " Because that entire piece of the net is dead right now."}, {"Time_Start": 140.14, "Time_End": 142.96, "Text": " Sorry, you can blame someone for the fact that you don't get a live demo"}, {"Time_Start": 142.96, "Time_End": 145.62, "Text": " or the slides immediately or the code immediately."}, {"Time_Start": 146.04, "Time_End": 146.98, "Text": " But I'm sure if you have."}, {"Time_Start": 147.0, "Time_End": 150.82, "Text": " harassed me enough after this. I'll give it to you on CD or USB or something."}, {"Time_Start": 151.38, "Time_End": 155.76, "Text": " But the big thing is the code actually exists. As opposed to last year, it's like, hey, I'll"}, {"Time_Start": 155.76, "Time_End": 162.7, "Text": " go right in later. No, no, no, now the code actually exists. So, flipping the order around,"}, {"Time_Start": 163.7, "Time_End": 168.38, "Text": " we're going to start at the top of the stack. We're going to talk about a hack that I discovered,"}, {"Time_Start": 168.58, "Time_End": 172.82, "Text": " I don't know, two and a half years ago, and I've been keeping it silent because I kind of felt"}, {"Time_Start": 172.82, "Time_End": 176.2, "Text": " they were going to patch it right after I got it out."}, {"Time_Start": 177.0, "Time_End": 182.78, "Text": " So I've been playing with this myself for a while, and this sucks. This really does need the live demo for you guys to see it."}, {"Time_Start": 183.68, "Time_End": 189.24, "Text": " It turns out, ActiveX, you can use it for more than deploying Spyware."}, {"Time_Start": 189.74, "Time_End": 196.9, "Text": " Gator is not the only thing that you can do with ActiveX. You could actually deploy anything, any piece of code at all."}, {"Time_Start": 197.2, "Time_End": 201.84, "Text": " So I've got this great history. I'll go around, go to these talks, and I'll find an internet kiosk."}, {"Time_Start": 202.2, "Time_End": 206.94, "Text": " And I'm like, am I'm not using this web browser stuff. I want to SSA."}, {"Time_Start": 207.0, "Time_End": 213.76, "Text": " And usually at this point, I'd go ahead and I do my live demo and go to a web page and what pops up, an SSH client."}, {"Time_Start": 214.68, "Time_End": 225.98, "Text": " How did I do that? How does this work? Well, it turns out, normally ActiveX applications have to be specifically compiled to be, oh, this is for a web page, this is an OCX, this has been specially done."}, {"Time_Start": 226.18, "Time_End": 236.98, "Text": " It turns out none of it's necessary. You just sort of put in an executable and it just works. And OCXs have these things called GUIDs, their signatures. They say, ah, yes, this is."}, {"Time_Start": 237.0, "Time_End": 259.6, "Text": " is it's globally unique identifier. Yeah, IE. doesn't check it. That's it. Now, now you might think, now, Dan, this must be very hard to make an executable work to, you have to sign it. It needs to be signed. The signature doesn't need to be anything you can't generate in about two lines of code, but you need to sign it. Dan, how am I going to do this?"}, {"Time_Start": 264.8, "Time_End": 265.5, "Text": " I know."}, {"Time_Start": 267.0, "Time_End": 276.84, "Text": " 10 character commands, make your cert, convert it to an SPC, sign it, and then you"}, {"Time_Start": 276.84, "Time_End": 282.78, "Text": " have an object. And the object, instead of foe.Oc, or food out OcX or food.AX or whatever, food"}, {"Time_Start": 282.78, "Time_End": 288.36, "Text": " out of EXZ. And that class ID doesn't matter. It just needs to be some class ID. Now, this is"}, {"Time_Start": 288.36, "Time_End": 295.4, "Text": " interesting, but it's not cool. It's not awesome. Why? Because you could just sort of take an executable"}, {"Time_Start": 295.40000000000003, "Time_End": 298.94000000000005, "Text": " file and make it the H-Ref on a web link and it would just sort of work."}, {"Time_Start": 298.94000000000005, "Time_End": 303.74, "Text": " The I.E. says the user, that's a nice executable. Should I open it? I do this all"}, {"Time_Start": 303.74, "Time_End": 308.48, "Text": " the time for putty. So this is just sort of a stunt to make it an object. Now where it gets"}, {"Time_Start": 308.48, "Time_End": 315.74, "Text": " cool, you notice sometimes windows, executables are, well they're just not complete by"}, {"Time_Start": 315.74, "Time_End": 322.38000000000005, "Text": " themselves. They need some support files, some DLLs, some bitmats, and whatnot. Wouldn't it"}, {"Time_Start": 322.38000000000005, "Time_End": 325.38000000000005, "Text": " be nice if instead of having to run this really painful"}, {"Time_Start": 325.40000000000003, "Time_End": 331.02000000000004, "Text": " install procedure, you just went to a web page and everything just auto-unpacked and"}, {"Time_Start": 331.02000000000004, "Time_End": 339.36, "Text": " there you were, no problem, boss. You can also sign cab files. And you make your object"}, {"Time_Start": 339.36, "Time_End": 344.02000000000004, "Text": " a cab file and you sign it and in the cab, you put all your stuff. Now, you may be familiar"}, {"Time_Start": 344.02000000000004, "Time_End": 349.02000000000004, "Text": " with cabs, you know, also seen in Windows setup whenever it builds itself, it builds itself"}, {"Time_Start": 349.02000000000004, "Time_End": 355.08000000000004, "Text": " from cabs. And so you put a stupid little INF file inside. And the INF file is there, so the"}, {"Time_Start": 355.08, "Time_End": 360.32, "Text": " application knows how to do a setup, how to build itself. Well, you basically say, well,"}, {"Time_Start": 360.32, "Time_End": 365.8, "Text": " my installer, oh, my installer is just like the command that I want this thing to run. You don't"}, {"Time_Start": 365.8, "Time_End": 371.14, "Text": " install. You just run it from the setup directory. Now, what's great is not only do you run it"}, {"Time_Start": 371.14, "Time_End": 375.91999999999996, "Text": " from the setup directory, but after you're done, it goes ahead and clears itself off, usually."}, {"Time_Start": 377.36, "Time_End": 381.65999999999997, "Text": " So, I know it's really hard. You make a cab that has, you make an INF file that has that,"}, {"Time_Start": 382.14, "Time_End": 385.06, "Text": " and there doesn't need to be any INF file name will work. And then they'll"}, {"Time_Start": 385.08, "Time_End": 414.84, "Text": " you generate the cab using the command called cab arc. That's it. All you do is you take your cab instead of Fu.exe, it's foo.cc. Now, any Windows application you want right off a web page. That's how it works. And I'd show you this great demo. I mean, I've got this demo. You click a link and, oh look, packet sniffer. You click a link. Oh, look, S's H client. You click a link. Oh, look, I can push a person down the stairs. No, no, I'm serious. This is this great game called Poros Dorvot came out at Assembly O2 last year. Basically,"}, {"Time_Start": 415.08, "Time_End": 420.84, "Text": " you push a guy down the stairs. And that's how you say, screw you, all you flash applications that think you're so cool."}, {"Time_Start": 422.88, "Time_End": 433.44, "Text": " So, that's the high level. We're going to screw with stuff talk. Now we go ahead and we get into what's all good, the TCPIP stuff."}, {"Time_Start": 434.38, "Time_End": 445.06, "Text": " So how many people here were here at my talk last year? Got some loyalty going on. Thanks, guys. So last year I came out here with a,"}, {"Time_Start": 445.08, "Time_End": 449.94, "Text": " 12 pack of coronas, and by the time I got off stage, there were none left."}, {"Time_Start": 451.64, "Time_End": 460.03999999999996, "Text": " I'm sorry, you know, I worked for a company. I can't do that again. You know, I really wish there was some way"}, {"Time_Start": 460.03999999999996, "Time_End": 470.06, "Text": " this could still happen, you know. But I can't do it. I could have nothing to do with this, guys."}, {"Time_Start": 471.14, "Time_End": 474.65999999999997, "Text": " However, I will be very happy with people in the audience."}, {"Time_Start": 475.08, "Time_End": 477.71999999999997, "Text": " who happened to mess with my head."}, {"Time_Start": 478.38, "Time_End": 479.64, "Text": " So here's the deal, guys."}, {"Time_Start": 479.84, "Time_End": 481.15999999999997, "Text": " This is not a BS thing."}, {"Time_Start": 481.5, "Time_End": 484.4, "Text": " You are here to fuck with my head like I'm here to fuck with yours."}, {"Time_Start": 484.9, "Time_End": 487.71999999999997, "Text": " Write notes, take notes, like Fizz here last year,"}, {"Time_Start": 488.21999999999997, "Time_End": 491.64, "Text": " who I unfortunately totally forgot to give props to."}, {"Time_Start": 492.58, "Time_End": 493.9, "Text": " I've been bugging me all year."}, {"Time_Start": 495.0, "Time_End": 499.36, "Text": " So if I am happy, good things may occur."}, {"Time_Start": 505.08, "Time_End": 509.15999999999997, "Text": " Welcome to DefCon. So what are we talking about? Well, what pisses me off?"}, {"Time_Start": 509.15999999999997, "Time_End": 513.8, "Text": " What pisses me off is trying to get an IP address when there's no DHCP server to say,"}, {"Time_Start": 513.8, "Time_End": 519.72, "Text": " here you go, Dan. Go have one, have fun. So I started a little research. I'm like, how do we go ahead"}, {"Time_Start": 519.72, "Time_End": 525.3199999999999, "Text": " and we fix this problem? Well, what's the classic approach? Well, ARP goes ahead and it spews out all this"}, {"Time_Start": 525.3199999999999, "Time_End": 531.0799999999999, "Text": " traffic looking for IP to MAC address translations. Now, let me go ahead and take a second"}, {"Time_Start": 531.0799999999999, "Time_End": 535.06, "Text": " for the people in the audience who don't know, I don't know, the absolute precise mess."}, {"Time_Start": 535.08, "Time_End": 541.0, "Text": " mechanism of ARP. The way Ethernet works, it's a little like taking a taxi. If you're going"}, {"Time_Start": 541.0, "Time_End": 546.6, "Text": " somewhere in town, you're going to take a taxi. You're going to use local transport. But if you're"}, {"Time_Start": 546.6, "Time_End": 553.36, "Text": " traveling 3,000 miles to some random conference, well, you're still going to take a taxi, because you still"}, {"Time_Start": 553.36, "Time_End": 558.36, "Text": " need to get wherever you are, it ain't where you want to be. But you're going to take a taxi to the airport."}, {"Time_Start": 558.9200000000001, "Time_End": 564.6800000000001, "Text": " Now, this is very much how Ethernet works. In Ethernet, you look, okay, am I going somewhere"}, {"Time_Start": 564.6800000000001, "Time_End": 570.6, "Text": " on my network. If so, I tell the taxi driver, hey, you know, let's go to this address in"}, {"Time_Start": 570.6, "Time_End": 576.6200000000001, "Text": " wherever we are. And as is anything, anytime you want to go to a destination, you want to go to a store,"}, {"Time_Start": 577.0000000000001, "Time_End": 582.5000000000001, "Text": " you go to Yahoo, you get the address, you get the local address. That's what ARP does. It gets the"}, {"Time_Start": 582.5000000000001, "Time_End": 589.1200000000001, "Text": " local address. But let's say you want to go too far to go by taxi. Then you go to the airport. You take"}, {"Time_Start": 589.1200000000001, "Time_End": 594.44, "Text": " the address to the airport. Your destination is still really far away, but your address that you're taking"}, {"Time_Start": 594.44, "Time_End": 600.94, "Text": " the taxi to is the airport. Now let's talk about some new techniques. Well, router detection."}, {"Time_Start": 602.2600000000001, "Time_End": 609.2600000000001, "Text": " Turns out you can bounce packets, still talking locally, you can bounce packets off of routers."}, {"Time_Start": 609.8800000000001, "Time_End": 614.2600000000001, "Text": " That's how you decide, find out that they are routers. One of the things you need to do when"}, {"Time_Start": 614.2600000000001, "Time_End": 618.0400000000001, "Text": " you're on a network is you can find out, well, what's a router? So you can look at all the Mac addresses"}, {"Time_Start": 618.0400000000001, "Time_End": 623.82, "Text": " that are out there. And you just basically send them traffic. And you send them traffic in a way"}, {"Time_Start": 623.82, "Time_End": 628.7800000000001, "Text": " such that you see, hey, I need you to send this local packet ideally to me."}, {"Time_Start": 630.0600000000001, "Time_End": 636.5600000000001, "Text": " And you see if you get something back. It's the basic equivalent of going to the airport and picking up"}, {"Time_Start": 636.5600000000001, "Time_End": 641.1400000000001, "Text": " another taxi and going somewhere else local in town. That's how you know it's an airport because it's"}, {"Time_Start": 641.1400000000001, "Time_End": 647.94, "Text": " very easy to pick up taxis there. So the first new thing is you can send a packet to a Cisco"}, {"Time_Start": 647.94, "Time_End": 653.8000000000001, "Text": " on your land and you can detect that it's a router because if you basically back address to your"}, {"Time_Start": 653.82, "Time_End": 663.82, "Text": " In other words, you take an IP in its addressable range, like you know, you basically say, I'm still coming to the same city, it'll go ahead and it'll send traffic back to you."}, {"Time_Start": 663.82, "Time_End": 673.82, "Text": " Now it turns out you need to go ahead and when you're talking to the router and doing this spoofed local transaction, you need to actually be telling the router you're coming to somewhere local."}, {"Time_Start": 673.82, "Time_End": 683.8000000000001, "Text": " So you can actually figure out the ranges within which the router will route locally on your interface based off of what is the range of acceptable IP."}, {"Time_Start": 683.82, "Time_End": 690.82, "Text": " So you try a 10.0, a 10.1, 10.2, you see what is the range. You do what's called a binary search."}, {"Time_Start": 690.82, "Time_End": 693.82, "Text": " It's relatively straightforward. It works really quickly."}, {"Time_Start": 693.82, "Time_End": 697.82, "Text": " Now, here's where it gets really interesting. This is whatever."}, {"Time_Start": 697.82, "Time_End": 702.82, "Text": " What if all the IP addresses are taken? What if you just don't have anymore?"}, {"Time_Start": 702.82, "Time_End": 704.82, "Text": " And this is not a theoretical issue."}, {"Time_Start": 704.82, "Time_End": 708.82, "Text": " When I was at Black Hat, I'm like paying, you know, can I go ahead and have an IP? I've got some hacking to do."}, {"Time_Start": 708.82, "Time_End": 713.82, "Text": " And she's like, Dan, I'm sorry, you know, all the exhibitors have taken the IPs."}, {"Time_Start": 713.82, "Time_End": 715.82, "Text": " I'm like, well, that sucks."}, {"Time_Start": 715.82, "Time_End": 717.5200000000001, "Text": " Check this out."}, {"Time_Start": 717.5200000000001, "Time_End": 719.44, "Text": " How do we normally?"}, {"Time_Start": 719.44, "Time_End": 722.32, "Text": " Normally, how do we get new IP addresses?"}, {"Time_Start": 722.32, "Time_End": 723.82, "Text": " Well, we use NAT."}, {"Time_Start": 723.82, "Time_End": 727.82, "Text": " Nat means, you know, the net is only respecting one IP address."}, {"Time_Start": 727.82, "Time_End": 732.82, "Text": " Usually the IP address that you're getting from your DSL provider or something."}, {"Time_Start": 732.82, "Time_End": 735.82, "Text": " Usually, I don't do things usually."}, {"Time_Start": 735.82, "Time_End": 741.82, "Text": " So what this basically means, if you send a packet from this magic IP,"}, {"Time_Start": 741.82, "Time_End": 745.82, "Text": " packets will be returned to this magic IP."}, {"Time_Start": 745.82, "Time_End": 750.82, "Text": " Now, problem two, multiple hosts need to be networked."}, {"Time_Start": 750.82, "Time_End": 753.82, "Text": " You've got one address, you've got multiple hosts."}, {"Time_Start": 753.82, "Time_End": 758.82, "Text": " So what that does is it takes this one address that the outside world likes,"}, {"Time_Start": 758.82, "Time_End": 762.82, "Text": " and it uses a different range internally, and then it translates between the two."}, {"Time_Start": 762.82, "Time_End": 767.82, "Text": " So we've got here, what I just described, a problem, where the network is out of IP addresses."}, {"Time_Start": 767.82, "Time_End": 769.82, "Text": " They're all in use."}, {"Time_Start": 769.82, "Time_End": 770.82, "Text": " They're more hosts that one IPs is."}, {"Time_Start": 770.82, "Time_End": 772.82, "Text": " that want IPs and their IPs to give."}, {"Time_Start": 772.82, "Time_End": 774.82, "Text": " Well, we couldn't use NAT."}, {"Time_Start": 774.82, "Time_End": 776.82, "Text": " I mean, there's not even one IP, right?"}, {"Time_Start": 776.82, "Time_End": 778.82, "Text": " We don't have anything."}, {"Time_Start": 778.82, "Time_End": 782.82, "Text": " Anyone here ever heard of an art man in the middle attack?"}, {"Time_Start": 782.82, "Time_End": 786.82, "Text": " So you just sort of take someone else's IP."}, {"Time_Start": 786.82, "Time_End": 790.82, "Text": " And now you've got an IP that the outside world likes."}, {"Time_Start": 790.82, "Time_End": 793.82, "Text": " You tell the client, you're the router, the router, you're the client,"}, {"Time_Start": 793.82, "Time_End": 797.82, "Text": " you now control traffic for an externally respected IP address."}, {"Time_Start": 797.82, "Time_End": 799.82, "Text": " You NAT off of someone else's IP, guys."}, {"Time_Start": 799.82, "Time_End": 807.82, "Text": " guys. So this is relatively straightforward. You've taken someone's IP and, hang on, how am I going to do this?"}, {"Time_Start": 807.82, "Time_End": 812.82, "Text": " Usually I do this with a couple of hands. So, we're going to do this."}, {"Time_Start": 812.82, "Time_End": 817.82, "Text": " What's up? Can a go ahead and get this guy a mic?"}, {"Time_Start": 817.82, "Time_End": 824.82, "Text": " What if the router doesn't support gratuitous ARP?"}, {"Time_Start": 824.82, "Time_End": 829.82, "Text": " Ah. A, surprisingly rare. B."}, {"Time_Start": 829.82, "Time_End": 833.72, "Text": " you go ahead and you wait, and sooner or later, they will update their cache."}, {"Time_Start": 833.72, "Time_End": 836.82, "Text": " And when you try, basically you're stuck in a delay mode."}, {"Time_Start": 836.82, "Time_End": 841.82, "Text": " Because then you basically go ahead and try to find a silent node that is still out there,"}, {"Time_Start": 841.82, "Time_End": 846.82, "Text": " and you convince the router, because at this point it's expired from his cache."}, {"Time_Start": 846.82, "Time_End": 848.82, "Text": " At this point, you go ahead and you feed him."}, {"Time_Start": 848.82, "Time_End": 852.32, "Text": " So you might say, Dan, you know, how come you're a heck of a lot,"}, {"Time_Start": 852.32, "Time_End": 854.82, "Text": " you're going to beat the legitimate host?"}, {"Time_Start": 854.82, "Time_End": 859.32, "Text": " Well, because I use raw packets and I'm not messing around with kernels."}, {"Time_Start": 859.32, "Time_End": 861.72, "Text": " and I write really fast code."}, {"Time_Start": 861.72, "Time_End": 863.6800000000001, "Text": " But you're absolutely right."}, {"Time_Start": 863.7600000000001, "Time_End": 866.32, "Text": " If you have a router that is not respecting gratuitous ARPS"}, {"Time_Start": 866.32, "Time_End": 870.5, "Text": " and has a very small window in which is a willing to accept ARP cache updates,"}, {"Time_Start": 870.88, "Time_End": 874.2, "Text": " then you're not in a good place."}, {"Time_Start": 875.48, "Time_End": 876.08, "Text": " All right."}, {"Time_Start": 876.1600000000001, "Time_End": 877.2800000000001, "Text": " So basically what happens?"}, {"Time_Start": 877.58, "Time_End": 879.46, "Text": " You made in the middle against an existing IP."}, {"Time_Start": 881.1400000000001, "Time_End": 883.8800000000001, "Text": " So now you are passing someone else's traffic."}, {"Time_Start": 884.46, "Time_End": 884.8800000000001, "Text": " Legitimately."}, {"Time_Start": 885.84, "Time_End": 887.32, "Text": " Packer goes from the client to the router."}, {"Time_Start": 887.72, "Time_End": 888.5, "Text": " Package goes from the router."}, {"Time_Start": 888.5, "Time_End": 889.1600000000001, "Text": " You sent you."}, {"Time_Start": 889.32, "Time_End": 890.96, "Text": " manually move it back to the client."}, {"Time_Start": 891.48, "Time_End": 892.82, "Text": " But there's another possibility."}, {"Time_Start": 893.6400000000001, "Time_End": 900.6, "Text": " In this second magic network of yours, you are injecting traffic into this other person's IP."}, {"Time_Start": 901.0600000000001, "Time_End": 902.2, "Text": " And the traffic goes out."}, {"Time_Start": 902.6600000000001, "Time_End": 903.62, "Text": " Traffic comes back."}, {"Time_Start": 903.9200000000001, "Time_End": 905.0200000000001, "Text": " You say, hey, wait a second."}, {"Time_Start": 905.5200000000001, "Time_End": 906.8000000000001, "Text": " Do I recognize this?"}, {"Time_Start": 907.0400000000001, "Time_End": 912.6800000000001, "Text": " Does this correspond to a packet from an outgoing session that I went ahead initiated"}, {"Time_Start": 912.6800000000001, "Time_End": 913.98, "Text": " and not the legitimate client?"}, {"Time_Start": 914.7800000000001, "Time_End": 917.96, "Text": " Well, then I'm going to go ahead and I'm going to gnat it back where it was supposed to be."}, {"Time_Start": 918.46, "Time_End": 919.3000000000001, "Text": " And if it's not something,"}, {"Time_Start": 919.32, "Time_End": 924.6, "Text": " I recognize. That must be a package to the legitimate host. So basically, you get to splice in."}, {"Time_Start": 925.24, "Time_End": 929.62, "Text": " Now you might say, Dan, this is pretty black hat for you. You usually just mess with stuff."}, {"Time_Start": 929.7, "Time_End": 933.9200000000001, "Text": " You don't do anything that's just for attacks. Well, the day I do something that's just for"}, {"Time_Start": 933.9200000000001, "Time_End": 939.5, "Text": " attacks, the day I'm not very creative. Because it turns out this is a great, great way to migrate"}, {"Time_Start": 939.5, "Time_End": 944.5400000000001, "Text": " a server from one machine to another. Because think about this for a second. You can go ahead."}, {"Time_Start": 944.62, "Time_End": 949.3000000000001, "Text": " You start up a second server, and it handles all new sessions. The old."}, {"Time_Start": 949.32, "Time_End": 972.94, "Text": " old sessions, you keep moving back to the old host. And since you're keeping track of all the sessions you're moving, you know the moment the old host has no one else listening. So this goes ahead and lets you do a graceful migration. It lets you do a phased migration. It links in with change control and change management. These are all kind of really cool things in the, if you take the network down, I'm going to kick your ass world."}, {"Time_Start": 974.94, "Time_End": 977.6600000000001, "Text": " So, wait, wait, wait, get someone on the mic."}, {"Time_Start": 979.32, "Time_End": 994.84, "Text": " Ah, very, very little. I mean very, very little. I mean the code I'm doing, I cannot make it get past like 0.5% CPU on like a really weak processor."}, {"Time_Start": 994.84, "Time_End": 1009.3000000000001, "Text": " It turns out Nat is really, really low, low CPU. That's why idiot boxes can do it. So don't even worry about load. It does get a little bit questionable if you are starting to get into the thousands, tens of thousands."}, {"Time_Start": 1009.32, "Time_End": 1017.32, "Text": " hundreds of thousands of sessions model. Then you actually want to go ahead and you don't use some random proof of concept. You use a dedicated load balancer box."}, {"Time_Start": 1018.32, "Time_End": 1028.3200000000002, "Text": " All right. So, more tricks. Oh, yeah. So this little word of warning, this is the kind of thing that people have been discovering every three or four months for the past 10 years."}, {"Time_Start": 1029.1000000000001, "Time_End": 1039.3, "Text": " It turns out when there's a scan, Rand scan, or there's a big port flood or scanning flood, a router has to go ahead and it helps. It says, okay, what's the local address for all?"}, {"Time_Start": 1039.32, "Time_End": 1045.32, "Text": " all of these IP addresses. And some of them aren't there. So these requests are broadcast."}, {"Time_Start": 1045.32, "Time_End": 1053.32, "Text": " When you receive an incoming session or incoming scan, not only do you see the scan, you also see all these broadcasts."}, {"Time_Start": 1053.32, "Time_End": 1059.32, "Text": " So even on a switch network, your paranoia level can be increased because, oh, wait a second, not only am I getting flooded,"}, {"Time_Start": 1059.32, "Time_End": 1063.32, "Text": " but I see evidence everyone around me is getting flooded as well."}, {"Time_Start": 1063.32, "Time_End": 1069.3, "Text": " It's an additional thing we can do for paranoia. I'm serious. It's rediscovered every three or four months. I think"}, {"Time_Start": 1069.32, "Time_End": 1072.32, "Text": " I'm the latest guy since the P-CAP team."}, {"Time_Start": 1072.32, "Time_End": 1076.32, "Text": " Link Cat, neat little fun toy."}, {"Time_Start": 1076.32, "Time_End": 1080.32, "Text": " So, you know, packet coding is great. Packet coding is wonderful."}, {"Time_Start": 1080.32, "Time_End": 1084.32, "Text": " I'm actually working really hard to make it easier,"}, {"Time_Start": 1084.32, "Time_End": 1089.32, "Text": " working on Lipiketto to make it so you can just have a nice unified interface for the network."}, {"Time_Start": 1089.32, "Time_End": 1094.32, "Text": " You don't need to go through the misery that I did, you know, I code so you don't have to, all that stuff."}, {"Time_Start": 1094.32, "Time_End": 1098.32, "Text": " But that being said, at the end of the day, some of you just do not want to muck around with C."}, {"Time_Start": 1098.32, "Time_End": 1102.32, "Text": " around with C. You do not want to muck around with my language of toys, my library of choice,"}, {"Time_Start": 1102.32, "Time_End": 1107.32, "Text": " and whatnot. But you know what, I think anybody who's anyone who's even done any programming"}, {"Time_Start": 1107.32, "Time_End": 1114.32, "Text": " can handle moving around raw text. That's it. Like, raise your hand if you've ever used"}, {"Time_Start": 1114.32, "Time_End": 1121.32, "Text": " copy and paste in a clipboard. I'm here to support you."}, {"Time_Start": 1121.32, "Time_End": 1128.32, "Text": " So let's talk about some fun stuff we can do with Link Cat. First of all, we can run the net through strings."}, {"Time_Start": 1128.32, "Time_End": 1133.72, "Text": " Strings is a very simple tool that basically says, hey, does this look like something a human being could read?"}, {"Time_Start": 1134.12, "Time_End": 1136.62, "Text": " Oh, it is? Okay, I'll go ahead and I'll dump it to screen."}, {"Time_Start": 1137.32, "Time_End": 1138.9199999999998, "Text": " So it trashes all the headers."}, {"Time_Start": 1139.72, "Time_End": 1144.62, "Text": " But you actually get to see every single type of packet that's going on in the network that's human readable."}, {"Time_Start": 1145.72, "Time_End": 1148.98, "Text": " Unfortunately, the text on screen is not human readable because it's really tiny."}, {"Time_Start": 1150.1799999999998, "Time_End": 1156.6399999999999, "Text": " Damn. But basically what you're seeing there is, oh, there's a CDP packet, there's a C-2,900 Excel on that network."}, {"Time_Start": 1156.9399999999998, "Time_End": 1158.3, "Text": " Here's a web request to my web."}, {"Time_Start": 1158.32, "Time_End": 1163.78, "Text": " website and, you know, some other stuff, PhP, the Cisco identifying its interface and so on."}, {"Time_Start": 1164.04, "Time_End": 1165.82, "Text": " Turns out you don't even need LinkCat to do this."}, {"Time_Start": 1166.52, "Time_End": 1172.26, "Text": " You run TCP dump dash W and run dash saying go ahead and spit the output out to command,"}, {"Time_Start": 1172.4199999999998, "Time_End": 1173.6799999999998, "Text": " out to the standard outs."}, {"Time_Start": 1174.3, "Time_End": 1178.82, "Text": " The dash S-2000 says, give me the entire packet, and then you pipe that into strings."}, {"Time_Start": 1179.3, "Time_End": 1180.04, "Text": " And what do you see?"}, {"Time_Start": 1180.12, "Time_End": 1183.02, "Text": " Again, you see the raw packet data run through strings."}, {"Time_Start": 1183.02, "Time_End": 1187.56, "Text": " And so we see some UPMP traffic, some SSH traffic, and that thing down there,"}, {"Time_Start": 1187.56, "Time_End": 1190.6599999999999, "Text": " E-J-E-D-E-F-C-A's."}, {"Time_Start": 1191.1799999999998, "Time_End": 1196.0, "Text": " Yeah, that's how IBM decided it would be a good idea to encode the name B-S-D."}, {"Time_Start": 1197.48, "Time_End": 1206.82, "Text": " Yeah, so S-M-B, the spec was basically written in about 1984 by some very, very strange IBM engineers."}, {"Time_Start": 1207.56, "Time_End": 1209.84, "Text": " I someday must buy them a drink."}, {"Time_Start": 1211.06, "Time_End": 1211.98, "Text": " There's some strange folk."}, {"Time_Start": 1213.1799999999998, "Time_End": 1215.1599999999999, "Text": " So, ping over copy and paste."}, {"Time_Start": 1215.26, "Time_End": 1216.6799999999998, "Text": " This is me supporting you guys."}, {"Time_Start": 1217.1799999999998, "Time_End": 1217.54, "Text": " So I go over copy."}, {"Time_Start": 1217.56, "Time_End": 1220.62, "Text": " ahead and I go up there and I go ahead and I pingnews.com."}, {"Time_Start": 1221.32, "Time_End": 1223.28, "Text": " What happens at that link cat window?"}, {"Time_Start": 1223.74, "Time_End": 1225.52, "Text": " I see, and it's in the blue text."}, {"Time_Start": 1225.84, "Time_End": 1227.74, "Text": " Those are the bites that contain a ping."}, {"Time_Start": 1228.1799999999998, "Time_End": 1230.84, "Text": " And you'll see at the end, if you're really, really close to the string,"}, {"Time_Start": 1231.1799999999998, "Time_End": 1233.78, "Text": " 30, 3-1, 3-3-2, 3-33, 3-3, 3-4-35."}, {"Time_Start": 1233.98, "Time_End": 1236.9199999999998, "Text": " It's basically a stock little ICMP header."}, {"Time_Start": 1237.76, "Time_End": 1239.26, "Text": " Now I go ahead and..."}, {"Time_Start": 1240.1799999999998, "Time_End": 1243.4199999999998, "Text": " So when I do the ping, the blue thing is what was sent."}, {"Time_Start": 1243.72, "Time_End": 1247.12, "Text": " The green is the response from the internet, from news.com."}, {"Time_Start": 1247.56, "Time_End": 1249.8, "Text": " As you see, at the top, there's an actual response."}, {"Time_Start": 1250.5, "Time_End": 1252.8999999999999, "Text": " Now, we go ahead and we copied that."}, {"Time_Start": 1253.58, "Time_End": 1255.24, "Text": " Now we go and we put Link Hat in,"}, {"Time_Start": 1255.72, "Time_End": 1258.04, "Text": " not only do we receive packets, we also send them."}, {"Time_Start": 1258.34, "Time_End": 1262.12, "Text": " We take that same green string of bytes, and we paste it."}, {"Time_Start": 1262.1799999999998, "Time_End": 1262.52, "Text": " That's it."}, {"Time_Start": 1263.52, "Time_End": 1265.1399999999999, "Text": " And it shows up on the network in blue."}, {"Time_Start": 1265.56, "Time_End": 1266.84, "Text": " And in green is the reply."}, {"Time_Start": 1267.94, "Time_End": 1269.8, "Text": " Clippy just forged a ping."}, {"Time_Start": 1272.98, "Time_End": 1276.44, "Text": " All right, so let's move on to ScanRand, the toy that everyone loves."}, {"Time_Start": 1277.56, "Time_End": 1281.8, "Text": " Scanner and what is it? I'm not here to repeat the talk last year. Don't worry."}, {"Time_Start": 1281.8, "Time_End": 1286.6, "Text": " I'm a little more creative than that. Not much, but a little. Oh wait. Goon, can we get a mic over here?"}, {"Time_Start": 1288.6799999999998, "Time_End": 1290.28, "Text": " Oh, forget, I'm probably closer."}, {"Time_Start": 1292.44, "Time_End": 1297.96, "Text": " It's a stateless TCP port scanner that uses the concept of TCP sin cookies?"}, {"Time_Start": 1299.6399999999999, "Time_End": 1300.44, "Text": " Man's got it."}, {"Time_Start": 1307.56, "Time_End": 1307.96, "Text": " don't."}, {"Time_Start": 1309.8999999999999, "Time_End": 1314.8799999999999, "Text": " The cooler, one of the cooler things I didn't really talk about that much last year is"}, {"Time_Start": 1314.8799999999999, "Time_End": 1319.78, "Text": " scanner isn't just a really fast port scanner. It happens to be able to use the TTL value"}, {"Time_Start": 1319.78, "Time_End": 1324.3799999999999, "Text": " to estimate how far a packet is traveled. Now this has been done before. You know, notably"}, {"Time_Start": 1324.3799999999999, "Time_End": 1330.1599999999999, "Text": " Poff, the passive OS fingerprinter has a module that does this. But I go ahead and I'm using, I'm starting"}, {"Time_Start": 1330.1599999999999, "Time_End": 1334.8799999999999, "Text": " to point out, you know, we can go ahead and we can use TTLs. Let me give you a little bit of"}, {"Time_Start": 1334.8799999999999, "Time_End": 1337.54, "Text": " background. A TTL is a value that is"}, {"Time_Start": 1337.56, "Time_End": 1341.32, "Text": " decremented every time a packet hops once. Oh, by the way, what time do I have"}, {"Time_Start": 1341.32, "Time_End": 1348.48, "Text": " to finish this talk? I happen to need to know that. When do I have to?"}, {"Time_Start": 1348.48, "Time_End": 1356.34, "Text": " 30 minutes left? Okay. Zoom, no. So basically your TTL value will start at"}, {"Time_Start": 1356.34, "Time_End": 1363.36, "Text": " 32, 164, 128, or 255. Why? No other reason but programmers like powers of two. So"}, {"Time_Start": 1363.36, "Time_End": 1367.54, "Text": " the TTL is decremented every time a packet goes over a router. So,"}, {"Time_Start": 1367.56, "Time_End": 1371.6399999999999, "Text": " So if you get a packet with a TTL of 60, it was decremented four times."}, {"Time_Start": 1371.6399999999999, "Time_End": 1376.46, "Text": " Not necessarily there are evil people like Fizz here who might fuck with the Yannette."}, {"Time_Start": 1376.46, "Time_End": 1381.48, "Text": " But in general, if you receive a packet with a TTL of 50, it went 14 hops."}, {"Time_Start": 1381.48, "Time_End": 1386.8, "Text": " If you receive a packet, then when it has a TTL of 15, it went 17 hops?"}, {"Time_Start": 1386.8, "Time_End": 1387.8, "Text": " Yeah."}, {"Time_Start": 1387.8, "Time_End": 1392.44, "Text": " So, you know, you wonder why, when you ping a host, it shows you the TTL?"}, {"Time_Start": 1392.44, "Time_End": 1395.0, "Text": " Because this was realized no 10, 10, 15 years ago."}, {"Time_Start": 1395.0, "Time_End": 1397.54, "Text": " The only thing is, you can actually apply it to arbitrary travel."}, {"Time_Start": 1397.56, "Time_End": 1405.1599999999999, "Text": " If anyone here is working on P2P, please go ahead. Use the TTLs on the incoming traffic"}, {"Time_Start": 1405.1599999999999, "Time_End": 1409.8799999999999, "Text": " to cry, go ahead, and shrink the maximum number of hops that your virtual network that you've"}, {"Time_Start": 1409.8799999999999, "Time_End": 1415.56, "Text": " overlaid goes ahead and uses. Because you're connected and can you tell it like 40 or 50 machines."}, {"Time_Start": 1415.56, "Time_End": 1421.04, "Text": " Guess what, guys, you can go ahead and look at the TTLs and figure out which ones are close on the network"}, {"Time_Start": 1421.04, "Time_End": 1425.8, "Text": " and which ones are far away. And will it be a perfect optimization? No, but it'll be a heck"}, {"Time_Start": 1425.8, "Time_End": 1433.04, "Text": " of a lot better. So, some returns from ScanRand. One, we've got email hijacking."}, {"Time_Start": 1433.78, "Time_End": 1439.52, "Text": " This was at a Black Hatcom, and I'm testing ScanRand making sure I'm not about to look like an"}, {"Time_Start": 1439.52, "Time_End": 1445.8999999999999, "Text": " idiot. And I'm like, oh, okay, so I see, you know, it's 19 hops away for my web server, 19 hops away"}, {"Time_Start": 1445.8999999999999, "Time_End": 1452.6399999999999, "Text": " for my SSL server, but somehow my mail server has teleported to four hops away. Not the rest"}, {"Time_Start": 1452.6399999999999, "Time_End": 1454.9199999999998, "Text": " of my machine, just my mail process."}, {"Time_Start": 1455.8, "Time_End": 1460.34, "Text": " Yeah, so the hotel was hijacking all our outgoing email."}, {"Time_Start": 1461.6599999999999, "Time_End": 1467.3, "Text": " Busted. This is one of the problems with hijacking, guys. You go ahead and you screw with the TTL and"}, {"Time_Start": 1467.3, "Time_End": 1475.5, "Text": " it's not straightforward to figure out what it's supposed to be. So, this is an opportunity for"}, {"Time_Start": 1475.5, "Time_End": 1481.52, "Text": " someone to correct me, by the way. So, we went ahead and we detected that every single,"}, {"Time_Start": 1481.98, "Time_End": 1485.6599999999999, "Text": " all traffic to Port 25 anywhere on the internet was being routed."}, {"Time_Start": 1485.8, "Time_End": 1491.0, "Text": " through this hotel server. This lasted about five or 10 minutes after I discovered it"}, {"Time_Start": 1491.0, "Time_End": 1496.72, "Text": " because I mentioned it to the wrong person. That's one thing you can do with ScanRand. Look"}, {"Time_Start": 1496.72, "Time_End": 1501.12, "Text": " for differences in the TTLs when you do your scans. Another thing is we can go ahead, look at this"}, {"Time_Start": 1501.12, "Time_End": 1505.94, "Text": " thing. It's hard to see, but basically we have three different situations here. We have up ports"}, {"Time_Start": 1505.94, "Time_End": 1511.32, "Text": " that are 11 hops away. We have down ports that are 12 hops away. We have down ports that are 22"}, {"Time_Start": 1511.32, "Time_End": 1515.78, "Text": " hops away. What's going on here? Well, it turns out that the Picks Fire"}, {"Time_Start": 1515.8, "Time_End": 1523.6, "Text": " wall. When it blocks a packet, the packet decriments all the way to the PICS. And then the"}, {"Time_Start": 1523.6, "Time_End": 1528.72, "Text": " picks looks at and says, I'm supposed to block it. And it flips the addresses around. It flips the"}, {"Time_Start": 1528.72, "Time_End": 1534.94, "Text": " ports around. It sets the response to a reset act. And it sends it back out. Now, note, I did not say"}, {"Time_Start": 1534.94, "Time_End": 1542.8799999999999, "Text": " it sets the TTL back up to 255 or 128 or 64. So what happens is the packet decremented all the way there."}, {"Time_Start": 1543.18, "Time_End": 1545.72, "Text": " And it decrements all the way back."}, {"Time_Start": 1545.8, "Time_End": 1553.6, "Text": " That's why a legitimate up is 11 hops away, but somehow an illegitimate down is 22 hops away."}, {"Time_Start": 1553.76, "Time_End": 1555.62, "Text": " Because 11 times 2 is 22."}, {"Time_Start": 1558.6399999999999, "Time_End": 1560.9199999999998, "Text": " That's what I'm here for."}, {"Time_Start": 1562.12, "Time_End": 1567.02, "Text": " This doesn't work. This does not work nearly as much as I wish it still did."}, {"Time_Start": 1567.9199999999998, "Time_End": 1573.02, "Text": " Unfortunately, the problem with giving talks that a bunch of Nat vendors go to is they get a clue from you."}, {"Time_Start": 1574.22, "Time_End": 1575.78, "Text": " This is why I didn't talk about the active."}, {"Time_Start": 1575.8, "Time_End": 1581.44, "Text": " for so long. So yeah, so ICMP errors contain a full copy of the IP packet that"}, {"Time_Start": 1581.44, "Time_End": 1589.02, "Text": " elicited them. Yeah, on old Nats, they gnat the IP, but they do not at the IP inside of the NAP, inside"}, {"Time_Start": 1589.02, "Time_End": 1593.68, "Text": " of the ICMP error. So on this NAD here, where it's blue underlined,"}, {"Time_Start": 1594.32, "Time_End": 1600.54, "Text": " 17216, 197 is a private IP. We get two hops out. We get past the net, the ICMP error on the"}, {"Time_Start": 1600.54, "Time_End": 1605.78, "Text": " tracer out. Guess what, guys? 2137, 24, 206. Don't attack that, guys."}, {"Time_Start": 1605.8, "Time_End": 1610.3999999999999, "Text": " Multi-home node detection."}, {"Time_Start": 1610.56, "Time_End": 1611.48, "Text": " This was a dare."}, {"Time_Start": 1612.12, "Time_End": 1615.18, "Text": " This is one of my co-workers saying, I bet you can't do this."}, {"Time_Start": 1615.3799999999999, "Time_End": 1616.48, "Text": " That's not possible."}, {"Time_Start": 1617.7, "Time_End": 1620.56, "Text": " So I went ahead and, you know, nose bled for a while."}, {"Time_Start": 1622.72, "Time_End": 1624.94, "Text": " You have a firewall corporate network."}, {"Time_Start": 1625.58, "Time_End": 1628.32, "Text": " It's not supposed to be receiving port scans from the outside world."}, {"Time_Start": 1629.22, "Time_End": 1630.56, "Text": " So let me ask you something."}, {"Time_Start": 1630.56, "Time_End": 1635.78, "Text": " What happens if you get a port scan from the outside world just show up on your firewall?"}, {"Time_Start": 1635.8, "Time_End": 1639.62, "Text": " network. It's just there. Hello, how are you doing? Here's all these packets from this"}, {"Time_Start": 1639.62, "Time_End": 1646.8, "Text": " external net. Well, what should happen is it hits all these machines, and the machines reply"}, {"Time_Start": 1646.8, "Time_End": 1652.08, "Text": " the ports up or the ports down, and the replies, go ahead and go to go out your firewall, right?"}, {"Time_Start": 1653.5, "Time_End": 1659.0, "Text": " And your firewall looks at all these synax and reset acts, and it's like, um, who are you responding"}, {"Time_Start": 1659.0, "Time_End": 1663.6, "Text": " to? What is your point here? And it goes ahead and it kicks you out. I mean, it drops the packet."}, {"Time_Start": 1663.6, "Time_End": 1665.6, "Text": " This is not what I'm here to do."}, {"Time_Start": 1665.8, "Time_End": 1671.7, "Text": " Ah, but what if you've got a host on a DSL link that is only going in using the internal"}, {"Time_Start": 1671.7, "Time_End": 1675.94, "Text": " network to access internal network IPs? Well, then what it does is it goes ahead and looks"}, {"Time_Start": 1675.94, "Time_End": 1680.58, "Text": " at this routing table and says, oh, I've got a packet destined for the internet. I'm going"}, {"Time_Start": 1680.58, "Time_End": 1687.26, "Text": " to send it out of my illicit DSL line. You control the machine on the internet. And what happens"}, {"Time_Start": 1687.26, "Time_End": 1692.96, "Text": " is this machine, this packet, this outgoing response doesn't go through the firewall, goes"}, {"Time_Start": 1692.96, "Time_End": 1699.04, "Text": " out through the DSL line, shows up on the outside box with your corporate IP address. You've"}, {"Time_Start": 1699.04, "Time_End": 1703.6200000000001, "Text": " just gone ahead and found a node that was not going, that not have outgoing packets going through"}, {"Time_Start": 1703.6200000000001, "Time_End": 1711.66, "Text": " the firewall. Kind of cool. And this works, by the way. Someone got a mic over there. This works because"}, {"Time_Start": 1711.66, "Time_End": 1717.78, "Text": " ScanRand actually has completely separate scanning and receiving processes. And so you have"}, {"Time_Start": 1717.78, "Time_End": 1722.3400000000001, "Text": " a sender that's on the inside of your network. You have a receiver that's, you know, on a completely"}, {"Time_Start": 1722.3400000000001, "Time_End": 1726.88, "Text": " different network, but the two are able to communicate. Now, we had a question or comment over here."}, {"Time_Start": 1731.1000000000001, "Time_End": 1736.6200000000001, "Text": " Now, would that only work for the host that's dual-homed, or are you saying that the packets are"}, {"Time_Start": 1736.6200000000001, "Time_End": 1742.3600000000001, "Text": " going on to the internal network and then going back out via the dual-homed host? Any host that is"}, {"Time_Start": 1742.3600000000001, "Time_End": 1751.8000000000002, "Text": " routing, basically any host that does not end up routing through the firewalled exit, but is actually has its"}, {"Time_Start": 1751.8, "Time_End": 1763.5, "Text": " own way out, will when it looks at its route table to see where to send the reply, it's going to send it out towards its illicit default GAA way as opposed to the legitimate one."}, {"Time_Start": 1763.5, "Time_End": 1781.78, "Text": " Right? Or any of those non-fire wall or whatever is. Yeah. Okay. Now there's a little issue. What about if they've got a NAD? They've got a link system that's before the, that's before the fire"}, {"Time_Start": 1781.8, "Time_End": 1789.8, "Text": " So basically they're running their own firewall, but, I mean, before the DSL line, basically they're running their own firewall, but it's a crappy one."}, {"Time_Start": 1789.8, "Time_End": 1795.8, "Text": " It violates policy, but it's not as nasty of a situation, but you still want to try to find it."}, {"Time_Start": 1795.8, "Time_End": 1804.8, "Text": " This is problematic because TCP sins will elicit a sin act or a reset act, and even though they've got a crappy firewall, they've still got something there."}, {"Time_Start": 1804.8, "Time_End": 1806.8, "Text": " Well, you've got a couple options."}, {"Time_Start": 1806.8, "Time_End": 1811.78, "Text": " One, instead of sending out a bunch of sins, you send out paying packets, and you have"}, {"Time_Start": 1811.8, "Time_End": 1816.8, "Text": " hope that these machines go ahead and they send a ping reply out through the LYNCIS,"}, {"Time_Start": 1816.8, "Time_End": 1823.1, "Text": " and the LYNCIS is dumb enough just to send it out. This happens. Better, though, meaning by better,"}, {"Time_Start": 1823.22, "Time_End": 1828.34, "Text": " I mean it actually should work and is very difficult to patch about 20 minutes after this talk better,"}, {"Time_Start": 1828.94, "Time_End": 1834.24, "Text": " is to try to use some kind of UDP message that goes ahead and elicits, it's an echo, some kind of sending."}, {"Time_Start": 1834.84, "Time_End": 1839.84, "Text": " Basically, any kind of UDP service that if I send a packet to it, it sends a reply."}, {"Time_Start": 1839.8400000000001, "Time_End": 1842.2800000000002, "Text": " SMB can work."}, {"Time_Start": 1842.7800000000002, "Time_End": 1846.8600000000001, "Text": " This is just, you know, simple Windows file sharing, very widely deployed and whatnot."}, {"Time_Start": 1847.0200000000002, "Time_End": 1851.68, "Text": " The only problem is some DSL networks go ahead, and they specifically filter this."}, {"Time_Start": 1852.8200000000002, "Time_End": 1858.44, "Text": " UDP 161 also can work very, very well, but it's not nearly as widely deployed."}, {"Time_Start": 1858.8200000000002, "Time_End": 1862.0200000000002, "Text": " It's more deployed than you would think, but it's not nearly as widely deployed."}, {"Time_Start": 1862.5600000000002, "Time_End": 1865.14, "Text": " If there are suggestions for things to use, let me know."}, {"Time_Start": 1865.9800000000002, "Time_End": 1867.2200000000003, "Text": " Wait, what?"}, {"Time_Start": 1869.2800000000002, "Time_End": 1869.8200000000002, "Text": " Hang on."}, {"Time_Start": 1869.8400000000001, "Time_End": 1872.6000000000001, "Text": " Who's talking?"}, {"Time_Start": 1873.88, "Time_End": 1877.92, "Text": " Use 111 if it's Unix."}, {"Time_Start": 1878.5400000000002, "Time_End": 1880.0200000000002, "Text": " That's Portmapper, right?"}, {"Time_Start": 1882.0600000000002, "Time_End": 1885.94, "Text": " He's right. You'll go ahead and you'll find all the Unix machines that are multi-hosted,"}, {"Time_Start": 1886.14, "Time_End": 1894.0000000000002, "Text": " which has the nice little convenient feature of the smartest people will go ahead and be able to set up this multi-homing."}, {"Time_Start": 1894.46, "Time_End": 1895.2400000000002, "Text": " Go ahead, got up the mic."}, {"Time_Start": 1895.2400000000002, "Time_End": 1899.7200000000003, "Text": " You could do 135 in Windows boxes, which you can't turn off unless you're running a local firewall."}, {"Time_Start": 1899.8400000000001, "Time_End": 1901.3400000000001, "Text": " Ah, that's true."}, {"Time_Start": 1901.6000000000001, "Time_End": 1904.1200000000001, "Text": " The issue is that the DSL networks are shutting him."}, {"Time_Start": 1904.5400000000002, "Time_End": 1908.14, "Text": " Or could you do the ICMP port unreachables for UDP with the Feral Pasters?"}, {"Time_Start": 1908.7800000000002, "Time_End": 1914.44, "Text": " The only problem is an ICMP port unreachable would theoretically be, it would still be linked to the state table."}, {"Time_Start": 1915.3200000000002, "Time_End": 1917.3000000000002, "Text": " Okay, we've got to keep moving through this."}, {"Time_Start": 1919.44, "Time_End": 1920.9800000000002, "Text": " State, how am I doing for time?"}, {"Time_Start": 1925.0600000000002, "Time_End": 1926.44, "Text": " Okay, we're doing great, guys."}, {"Time_Start": 1927.44, "Time_End": 1929.2800000000002, "Text": " You all guys, everyone having fun here?"}, {"Time_Start": 1929.8400000000001, "Time_End": 1931.16, "Text": " Yeah."}, {"Time_Start": 1933.3200000000002, "Time_End": 1934.0000000000002, "Text": " All right."}, {"Time_Start": 1934.8000000000002, "Time_End": 1936.92, "Text": " ScanRand is really lazy code."}, {"Time_Start": 1937.4800000000002, "Time_End": 1938.7200000000003, "Text": " It is, especially 1-1."}, {"Time_Start": 1938.8200000000002, "Time_End": 1939.3200000000002, "Text": " It's crap."}, {"Time_Start": 1940.0800000000002, "Time_End": 1943.94, "Text": " So, yeah, that'll take the wind out of your sales."}, {"Time_Start": 1944.4800000000002, "Time_End": 1947.5800000000002, "Text": " No, ScanRand does not keep track of anything."}, {"Time_Start": 1947.88, "Time_End": 1950.4800000000002, "Text": " I mean, it sends a packet, it receives it,"}, {"Time_Start": 1950.7200000000003, "Time_End": 1953.5400000000002, "Text": " it dumps it to the next, dumps it the standard out, and that's it."}, {"Time_Start": 1954.3000000000002, "Time_End": 1956.1000000000001, "Text": " This happens to be good enough,"}, {"Time_Start": 1956.5800000000002, "Time_End": 1959.6000000000001, "Text": " because even though ScanRand is dumping it the standard out,"}, {"Time_Start": 1959.8400000000001, "Time_End": 1962.1200000000001, "Text": " We are people, and we have minds."}, {"Time_Start": 1962.42, "Time_End": 1965.16, "Text": " And though people keep saying users are dumb and people are dumb,"}, {"Time_Start": 1965.4, "Time_End": 1970.16, "Text": " it turns out we're really good at integrating data across multiple lines,"}, {"Time_Start": 1970.2600000000002, "Time_End": 1972.2, "Text": " across time, across space, and so on."}, {"Time_Start": 1972.5000000000002, "Time_End": 1974.7600000000002, "Text": " So basically, we see 10 replies from ScanRand,"}, {"Time_Start": 1974.8000000000002, "Time_End": 1977.18, "Text": " and we're able to analyze them as a group."}, {"Time_Start": 1977.4800000000002, "Time_End": 1981.7200000000003, "Text": " Even though ScanRand, as a program, has no idea that there's any relationship."}, {"Time_Start": 1982.2200000000003, "Time_End": 1986.7, "Text": " ScanRam doesn't know that, you know, the Port 25 was four hops away,"}, {"Time_Start": 1986.7, "Time_End": 1989.8200000000002, "Text": " and 443 was 19 hops away."}, {"Time_Start": 1989.8400000000001, "Time_End": 1994.8400000000001, "Text": " But as a user, you see it, you integrate the data, and you know, something ain't right."}, {"Time_Start": 1996.5000000000002, "Time_End": 1998.18, "Text": " Packets don't exist in isolation."}, {"Time_Start": 1998.66, "Time_End": 2001.96, "Text": " There's more data in packets than just one."}, {"Time_Start": 2002.8000000000002, "Time_End": 2003.7800000000002, "Text": " Let me give you an example."}, {"Time_Start": 2004.3400000000001, "Time_End": 2007.3600000000001, "Text": " So in TCP, TCP goes ahead and it does error correction."}, {"Time_Start": 2007.7600000000002, "Time_End": 2009.5600000000002, "Text": " If a packet is dropped, it'll retry."}, {"Time_Start": 2009.9800000000002, "Time_End": 2013.5000000000002, "Text": " You know, someone hangs up on a phone."}, {"Time_Start": 2013.5600000000002, "Time_End": 2015.5400000000002, "Text": " You're like, hello, hello?"}, {"Time_Start": 2017.18, "Time_End": 2017.42, "Text": " Hello?"}, {"Time_Start": 2018.0200000000002, "Time_End": 2019.5400000000002, "Text": " Well, how many times do you say hello?"}, {"Time_Start": 2019.8400000000001, "Time_End": 2023.2400000000002, "Text": " What is the exact delay you use between your hellos?"}, {"Time_Start": 2023.2400000000002, "Time_End": 2026.44, "Text": " Networks have the same thing, but it's not specified."}, {"Time_Start": 2026.44, "Time_End": 2031.5400000000002, "Text": " So each different operating system will go ahead, and when you just shut up in TCB,"}, {"Time_Start": 2031.5400000000002, "Time_End": 2037.14, "Text": " the other side tries in an unspecified amount of time to reestablish the connection."}, {"Time_Start": 2037.14, "Time_End": 2040.2400000000002, "Text": " I didn't discover this. This is discovered by Frank Vesit."}, {"Time_Start": 2040.2400000000002, "Time_End": 2043.3400000000001, "Text": " Veset. I don't know, a French guy, really cool guy."}, {"Time_Start": 2043.3400000000001, "Time_End": 2045.44, "Text": " Can we do this with ScanRand?"}, {"Time_Start": 2045.44, "Time_End": 2049.7400000000002, "Text": " Well, it turns out that we can, but we need to prevent the kernel from going ahead and resetting it."}, {"Time_Start": 2049.84, "Time_End": 2053.6400000000003, "Text": " Bug me later if you want the specifics, just trying to be quick on it."}, {"Time_Start": 2053.6400000000003, "Time_End": 2058.52, "Text": " But if you look, we're going ahead, we're allowing the other side to reply as many times as"}, {"Time_Start": 2058.52, "Time_End": 2059.52, "Text": " you want."}, {"Time_Start": 2059.52, "Time_End": 2061.7400000000002, "Text": " There's no resets going out."}, {"Time_Start": 2061.7400000000002, "Time_End": 2067.6000000000004, "Text": " First toast, we get a reply at 0.2 seconds, 3.2 seconds and 9.1 seconds."}, {"Time_Start": 2067.6000000000004, "Time_End": 2069.6000000000004, "Text": " That's a plus 3 and a plus 6."}, {"Time_Start": 2069.6000000000004, "Time_End": 2071.6000000000004, "Text": " This is a Windows machine."}, {"Time_Start": 2071.6000000000004, "Time_End": 2074.9, "Text": " Next toast, plus 3 and a plus 6, that's another Windows machine."}, {"Time_Start": 2074.9, "Time_End": 2079.82, "Text": " Next toast, we got one at 0.7, we got one at 4.5, we want to have a plus 6, we want to"}, {"Time_Start": 2079.84, "Time_End": 2087.84, "Text": " 10.5, 22.7, and 46.7. There's a plus 4, a plus 6, a plus 12, a plus 4, 46 seconds after"}, {"Time_Start": 2087.84, "Time_End": 2092.38, "Text": " we sent us to sin to this host, it's still sending us SynX. Guys, that's a Linux box."}, {"Time_Start": 2094.2200000000003, "Time_End": 2100.2000000000003, "Text": " There's nothing in the packet. Nothing special about the packets. This is bits of data"}, {"Time_Start": 2100.2000000000003, "Time_End": 2106.06, "Text": " that are outside anything in there. We cannot find this out without integrating data across"}, {"Time_Start": 2106.06, "Time_End": 2109.7400000000002, "Text": " packets. So what's been done, you know, this is all the hype."}, {"Time_Start": 2109.84, "Time_End": 2113.5, "Text": " guess what? I don't want to write a state management engine. I don't want to write yet another"}, {"Time_Start": 2113.5, "Time_End": 2118.7200000000003, "Text": " database. So ScanRand will now just output SQL. You just pipe it into MySQL, pipe it into Postgres,"}, {"Time_Start": 2118.82, "Time_End": 2124.56, "Text": " pipe it into whatever. Write your own stuff to go ahead and parse it out. That's the model that I'm"}, {"Time_Start": 2124.56, "Time_End": 2131.1400000000003, "Text": " looking at to see us being able to take the data from ScanRand and really make it useful for a large-scale"}, {"Time_Start": 2131.1400000000003, "Time_End": 2136.9, "Text": " analysis. Just dumping out SQL, pipe it into the database. It turns out you can even do this over"}, {"Time_Start": 2136.9, "Time_End": 2139.38, "Text": " SSH. So you have to a remote host."}, {"Time_Start": 2139.84, "Time_End": 2143.76, "Text": " and pipe the data back into your local database or the other way around."}, {"Time_Start": 2144.32, "Time_End": 2149.44, "Text": " Yes, I know, there are injection attacks, the patch to get around. That's going to happen soon."}, {"Time_Start": 2150.8, "Time_End": 2156.1800000000003, "Text": " So I got this strategy for OS fingerprinting. Let's focus on things where code actually exists."}, {"Time_Start": 2156.3, "Time_End": 2162.56, "Text": " But the summary, you go ahead and you send out a batch of packets that go ahead and uniquely identify a host."}, {"Time_Start": 2162.92, "Time_End": 2168.1200000000003, "Text": " Maybe it's what Fioter's using for NMAP or what Ofer is using for X probe. Maybe it's the temporal fingerprinting stuff."}, {"Time_Start": 2168.12, "Time_End": 2173.7, "Text": " You go ahead and you send out all the requests. Now you go ahead and you get a bunch of replies, right?"}, {"Time_Start": 2174.06, "Time_End": 2179.5, "Text": " There are three possibilities with your replies. A, you've got no reply for a given host at all."}, {"Time_Start": 2180.06, "Time_End": 2185.7599999999998, "Text": " B, you got some replies, but not all of them, meaning you need to go ahead and do a retry on that host."}, {"Time_Start": 2185.96, "Time_End": 2192.98, "Text": " Or C, you got all the necessary replies. You send the set of replies into NMAP's algorithm or X-Probes algorithm or whatnot."}, {"Time_Start": 2193.6, "Time_End": 2198.1, "Text": " What's cool about this? You know how ScanRAN lets you scan an entire network?"}, {"Time_Start": 2198.12, "Time_End": 2202.98, "Text": " for hosts in like four seconds, this will probably let you OS fingerprint them all in"}, {"Time_Start": 2202.98, "Time_End": 2213.9, "Text": " about a minute. So this is the worst joke here. Who's down with TCP? Yeah, you know me."}, {"Time_Start": 2215.3599999999997, "Time_End": 2220.12, "Text": " So let's talk about TCP for a moment. This is so you understand what I'm about to talk about"}, {"Time_Start": 2220.12, "Time_End": 2225.92, "Text": " in a bit. TCP creates a reliable communication medium over a somewhat unreliable"}, {"Time_Start": 2225.92, "Time_End": 2230.96, "Text": " unreliable path. Now errors are fixed at the endpoints. You can't have errors all the time."}, {"Time_Start": 2231.1, "Time_End": 2236.1, "Text": " If you have errors in every hop, wireless, there's a protocol called air hook. It's beautiful. It's"}, {"Time_Start": 2236.1, "Time_End": 2242.6800000000003, "Text": " genius. Go check it out. TCB is stream oriented. It doesn't care how many packets it took to get"}, {"Time_Start": 2242.6800000000003, "Time_End": 2247.38, "Text": " bites across. It is totally bite-oriented. When you're doing error recovery, it's like, hey, I got"}, {"Time_Start": 2247.38, "Time_End": 2255.34, "Text": " everything up to bite 1,000, 10,000, wait, 345, and that's too many coronas."}, {"Time_Start": 2255.92, "Time_End": 2259.66, "Text": " So you're on a certain byte, not a certain packet number."}, {"Time_Start": 2260.4, "Time_End": 2268.2200000000003, "Text": " Now, instead of expressing these bite offsets directly, they're represented at offsets from some initial value that's randomly generated."}, {"Time_Start": 2268.64, "Time_End": 2273.4, "Text": " Randomly now, because if it's not randomly, there's a bunch of great blind spoofing attacks we're not going to go into."}, {"Time_Start": 2273.9, "Time_End": 2282.52, "Text": " So you can think of it like, hey, we started at $1 million, and now I'm acknowledging $1,12,345."}, {"Time_Start": 2282.92, "Time_End": 2283.9, "Text": " Do a subtraction, gee."}, {"Time_Start": 2283.9, "Time_End": 2287.76, "Text": " Last thing I got good from you was the 12,345th byte."}, {"Time_Start": 2288.32, "Time_End": 2291.54, "Text": " Now, this is done, among other reasons, to prevent TCP spoofing."}, {"Time_Start": 2291.62, "Time_End": 2297.26, "Text": " Someone wants to send you a packet. They have to know where in this 32-bit range that you were last talking."}, {"Time_Start": 2297.54, "Time_End": 2299.8, "Text": " It's a little bit of window, but we won't go into that."}, {"Time_Start": 2300.64, "Time_End": 2302.42, "Text": " So you can't do TCP spoofing, right?"}, {"Time_Start": 2302.98, "Time_End": 2306.8, "Text": " Well, what if the server sends it to the spoofer intentionally?"}, {"Time_Start": 2307.8, "Time_End": 2309.04, "Text": " Let me give you a little story."}, {"Time_Start": 2310.36, "Time_End": 2313.14, "Text": " You are the President of the United States."}, {"Time_Start": 2313.9, "Time_End": 2315.1, "Text": " God bless our souls."}, {"Time_Start": 2316.96, "Time_End": 2318.52, "Text": " Hello to all the feds out there."}, {"Time_Start": 2318.56, "Time_End": 2319.12, "Text": " You guys rule."}, {"Time_Start": 2319.52, "Time_End": 2320.2200000000003, "Text": " So check it out."}, {"Time_Start": 2321.26, "Time_End": 2324.52, "Text": " Latsby, you're the president, and everyone wants to talk to you."}, {"Time_Start": 2325.2200000000003, "Time_End": 2327.9, "Text": " And you cannot manage talking to everyone."}, {"Time_Start": 2328.52, "Time_End": 2330.54, "Text": " But don't worry, it's Capitol Hill."}, {"Time_Start": 2330.78, "Time_End": 2336.06, "Text": " You've got no shortage interns out there to handle the public for you."}, {"Time_Start": 2336.6600000000003, "Time_End": 2337.98, "Text": " So basically, you're the president."}, {"Time_Start": 2338.12, "Time_End": 2343.4, "Text": " You receive letters, and you pass it off to one of this horde of engineers, or excuse me, of interns."}, {"Time_Start": 2343.9, "Time_End": 2347.98, "Text": " You do not scale, but an anonymous intern scale just fine."}, {"Time_Start": 2350.2200000000003, "Time_End": 2352.62, "Text": " And they go ahead, and when they reply, of course, they don't say,"}, {"Time_Start": 2352.9, "Time_End": 2354.92, "Text": " oh, hi, you know, I'm very nice to hear your opinion."}, {"Time_Start": 2355.1600000000003, "Time_End": 2357.1600000000003, "Text": " Thank you, anonymous intern number 345."}, {"Time_Start": 2357.8, "Time_End": 2359.92, "Text": " No, no, no, no, they say that the president of the United States."}, {"Time_Start": 2360.34, "Time_End": 2360.64, "Text": " Hallelujah."}, {"Time_Start": 2362.9, "Time_End": 2364.84, "Text": " Turns out we can do this with packets as well."}, {"Time_Start": 2365.88, "Time_End": 2371.32, "Text": " Is it possible for a single host to do load balancing across nearly arbitrary network boundaries"}, {"Time_Start": 2371.32, "Time_End": 2373.08, "Text": " without any special code on the client?"}, {"Time_Start": 2373.9, "Time_End": 2378.48, "Text": " Yeah, yeah, it turns out we can do load balancing without any kind of care for network boundaries."}, {"Time_Start": 2378.96, "Time_End": 2381.7000000000003, "Text": " By basically, client thinks it's talking to a server."}, {"Time_Start": 2382.54, "Time_End": 2383.6600000000003, "Text": " Server's actually a redirector."}, {"Time_Start": 2383.7400000000002, "Time_End": 2388.56, "Text": " Redirector goes ahead and sends the actual TCP packets, although it works for any IP service."}, {"Time_Start": 2389.1, "Time_End": 2390.64, "Text": " Any IP service."}, {"Time_Start": 2391.86, "Time_End": 2396.86, "Text": " It goes out to the anonymous servers by some kind of, I'll tell you how that works."}, {"Time_Start": 2397.38, "Time_End": 2401.2200000000003, "Text": " And when the servers reply, they spoof the source IP of the redirector."}, {"Time_Start": 2401.2200000000003, "Time_End": 2403.88, "Text": " So from the client's perspective, it sent a packet to a home."}, {"Time_Start": 2403.9, "Time_End": 2407.28, "Text": " and the host sends the packet back."}, {"Time_Start": 2408.08, "Time_End": 2409.64, "Text": " Now let's talk about some details here."}, {"Time_Start": 2410.14, "Time_End": 2418.26, "Text": " Again, redirector upon receiving a packet from a client, changes the IP destination, recalculates the checksums, sends the packet out the appropriate interface."}, {"Time_Start": 2418.7200000000003, "Time_End": 2420.14, "Text": " There are two session-based rules."}, {"Time_Start": 2420.28, "Time_End": 2424.58, "Text": " First of all, you have to keep the whatever rule you do has to be consistent by session,"}, {"Time_Start": 2425.58, "Time_End": 2430.52, "Text": " meaning, hey, you can use the TCP source port and do a mod based on the number of redirectors you have."}, {"Time_Start": 2430.52, "Time_End": 2433.88, "Text": " You can use the IP source, especially once you get into GEOP."}, {"Time_Start": 2433.9, "Time_End": 2439.42, "Text": " coding so you look at the database figure what IP is in what country or what area and you try"}, {"Time_Start": 2439.42, "Time_End": 2445.14, "Text": " to minimize the distance. There's all sorts of methods. There's a stateless. Stateful rules"}, {"Time_Start": 2445.14, "Time_End": 2450.2200000000003, "Text": " is you say, you know, I know who's talking where. I know I've sent this many hosts over here."}, {"Time_Start": 2450.2200000000003, "Time_End": 2454.6600000000003, "Text": " This guy's got some open slots. I'll send it there. Those are the stateful rules. They're harder"}, {"Time_Start": 2454.6600000000003, "Time_End": 2460.44, "Text": " to code, so I haven't done that yet. The anonymous server goes ahead. It receives this"}, {"Time_Start": 2460.44, "Time_End": 2463.88, "Text": " packet IP destined to it with some source of the legitimate source."}, {"Time_Start": 2463.9, "Time_End": 2469.7200000000003, "Text": " And so normal stock of code, normal applications, squid, shout cast proxy, whatever."}, {"Time_Start": 2470.46, "Time_End": 2475.4, "Text": " It goes ahead and it replies. But the last moment in the I, this Linux specific for the moment,"}, {"Time_Start": 2475.7200000000003, "Time_End": 2480.1800000000003, "Text": " last moment IP tables goes ahead and says, wait, wait, wait, wait, wait. If I send this reply from the"}, {"Time_Start": 2480.1800000000003, "Time_End": 2485.58, "Text": " anonymous server's IP, nobody's going to like it. Just like if the anonymous intern replies"}, {"Time_Start": 2485.58, "Time_End": 2489.3, "Text": " from the anonymous intern's name, people are going to be like, who the hell are you?"}, {"Time_Start": 2489.9, "Time_End": 2493.58, "Text": " So it fakes its IP to be that of the redirector."}, {"Time_Start": 2493.9, "Time_End": 2497.06, "Text": " And then the packet goes to the client, and the client's all happy."}, {"Time_Start": 2498.06, "Time_End": 2500.4, "Text": " Client can actually notice this because of TTL errors."}, {"Time_Start": 2501.56, "Time_End": 2505.12, "Text": " Now, what does it get you? First of all, global load distribution."}, {"Time_Start": 2505.6600000000003, "Time_End": 2509.36, "Text": " Anyone can go ahead and have a server go ahead and spoof something else's IP."}, {"Time_Start": 2510.1600000000003, "Time_End": 2514.7000000000003, "Text": " Somewhere, someone out there has extra bandwidth that they bought that they're not using."}, {"Time_Start": 2514.7000000000003, "Time_End": 2518.6600000000003, "Text": " I want to start being able to see this being used to serve our traffic."}, {"Time_Start": 2520.04, "Time_End": 2521.1600000000003, "Text": " But check it out."}, {"Time_Start": 2522.06, "Time_End": 2523.62, "Text": " There's more that's happening here."}, {"Time_Start": 2523.9, "Time_End": 2526.48, "Text": " Because the client, where is it acknowledging to?"}, {"Time_Start": 2526.58, "Time_End": 2532.86, "Text": " Is it acknowledging this great, nice data is getting to the anonymous server that's doing everything?"}, {"Time_Start": 2533.3, "Time_End": 2536.98, "Text": " No, it's saying, thank you for the 1,000 bytes to the redirector."}, {"Time_Start": 2537.02, "Time_End": 2539.52, "Text": " Thank you for 10,000 bytes to the redirector."}, {"Time_Start": 2539.76, "Time_End": 2541.08, "Text": " Thank you, thank you, thank you."}, {"Time_Start": 2541.2000000000003, "Time_End": 2544.96, "Text": " The redirector is receiving information on how much data the client's getting."}, {"Time_Start": 2544.96, "Time_End": 2553.82, "Text": " The redirector is receiving every couple of, you know, dozens of milliseconds updates on how much data it's getting from this anonymous"}, {"Time_Start": 2553.9, "Time_End": 2572.84, "Text": " server just by looking at the offset and the acts. This works today, this works now. You are able to measure the amount of traffic going on without even seeing it. And it's not even, you're not even being told, oh yeah, let me tell you something. I send, you know, 10,000 bytes to this guy. No, the guy's telling me, hey, this guy just sent me 10,000 bytes."}, {"Time_Start": 2574.56, "Time_End": 2583.88, "Text": " Advanced things you can do, which haven't been implemented yet. Theoretically, you can say, you know, that session over here is only getting 5K a second. This mirror sucks. By the way, have you gone any,"}, {"Time_Start": 2583.9, "Time_End": 2588.2200000000003, "Text": " your hand if you've gone to a site that said, which of these 50 mirrors would you like to download"}, {"Time_Start": 2588.2200000000003, "Time_End": 2595.9, "Text": " a file from? This, this sucks. Guys, the way it needs to work is you go to one redirector,"}, {"Time_Start": 2596.38, "Time_End": 2601.82, "Text": " you download from the redirector, and if it says, okay, this is way too slow, it just moves you somewhere else."}, {"Time_Start": 2602.14, "Time_End": 2607.46, "Text": " And it does all the application-specific negotiation for you, so you go ahead and you get the bite"}, {"Time_Start": 2607.46, "Time_End": 2613.88, "Text": " updated at the exact right point. That's how it should work. So this works for everything. Unfortunately, I have no net, so I can't"}, {"Time_Start": 2613.9, "Time_End": 2643.88, "Text": " do the live demo, but if I could do the live demo, I spent my time developing this, listening to digitally imported, and I was actually bouncing digitally imported off of this server, excuse me, of the network of around three servers that every time I connected it would come from a different source. Why is it great to do this? Because this means the music you're coding to is coming through your code. So if your code breaks, the music stops, and it sucks. So you're really motivated to fix it."}, {"Time_Start": 2643.9, "Time_End": 2644.9, "Text": " it."}, {"Time_Start": 2648.9, "Time_End": 2650.86, "Text": " Finally, this is the last thing I'm up to."}, {"Time_Start": 2650.96, "Time_End": 2653.1, "Text": " I am so happy to finally get this to work."}, {"Time_Start": 2654.2200000000003, "Time_End": 2656.7200000000003, "Text": " SSL versus IDS is the eternal conflict."}, {"Time_Start": 2657.38, "Time_End": 2658.44, "Text": " SSL annoys me."}, {"Time_Start": 2658.94, "Time_End": 2659.7000000000003, "Text": " Why does it annoy me?"}, {"Time_Start": 2659.76, "Time_End": 2662.08, "Text": " Because if your cert goes, oh, you're screwed."}, {"Time_Start": 2662.54, "Time_End": 2663.44, "Text": " Oh, my God."}, {"Time_Start": 2664.08, "Time_End": 2669.32, "Text": " Like, all the traffic you've ever sent, like, all your traffic from a year ago, exposed."}, {"Time_Start": 2669.88, "Time_End": 2672.0, "Text": " All your traffic year from now, exposed."}, {"Time_Start": 2672.6800000000003, "Time_End": 2673.8, "Text": " So one day they come in, they come in."}, {"Time_Start": 2673.9, "Time_End": 2679.92, "Text": " take a cert and you are screwed. This is like the only link-based protocol that has this flaw."}, {"Time_Start": 2680.3, "Time_End": 2685.88, "Text": " I went and I harassed one of the authors of SSL about this and he's like, Dan, we have like 1.5%"}, {"Time_Start": 2685.88, "Time_End": 2692.76, "Text": " of the available CPU power back then. Like, you got a point. That being said, SSL does some cool stuff."}, {"Time_Start": 2692.82, "Time_End": 2698.8, "Text": " I respect the people who like it. IDS also annoys me. Hey, look, we're under attack. Oh, that's nice."}, {"Time_Start": 2703.9, "Time_End": 2706.84, "Text": " Like, do you just not want to be able to sleep permanently?"}, {"Time_Start": 2708.1, "Time_End": 2710.64, "Text": " But that being said, I respect people who like both."}, {"Time_Start": 2711.38, "Time_End": 2712.7200000000003, "Text": " Here's the problem."}, {"Time_Start": 2713.98, "Time_End": 2720.2400000000002, "Text": " IDS says, I'm going to look on the network and see what's going on to make sure nothing bad gets through."}, {"Time_Start": 2720.96, "Time_End": 2728.32, "Text": " SSL says, I'm going to go ahead and encrypt anything that is on the network so that no one else can watch it."}, {"Time_Start": 2729.0, "Time_End": 2732.12, "Text": " You get one, you get the other, you don't get both."}, {"Time_Start": 2732.7200000000003, "Time_End": 2733.12, "Text": " Ouch."}, {"Time_Start": 2733.9, "Time_End": 2739.34, "Text": " Now, there are certain solutions. You can go ahead and you can transfer the cert, and your IDS can do RSA decryption."}, {"Time_Start": 2739.52, "Time_End": 2743.48, "Text": " And, you know, you know how IDSs are just busting at the seams with extra CPU cycles."}, {"Time_Start": 2744.56, "Time_End": 2744.88, "Text": " New."}, {"Time_Start": 2745.7200000000003, "Time_End": 2749.92, "Text": " You can go ahead and you can cut off SSL or release that your endpoints get plain text."}, {"Time_Start": 2750.54, "Time_End": 2756.4, "Text": " And, you know, now you've gone ahead and done all this work to end-to-end crypto in the last minute, you just switch out of it."}, {"Time_Start": 2756.78, "Time_End": 2758.84, "Text": " And you've got to do HTTP rewriting, and it's a pain."}, {"Time_Start": 2759.94, "Time_End": 2763.1, "Text": " So, God, that's a messy slide."}, {"Time_Start": 2763.9, "Time_End": 2768.34, "Text": " So it turns out SSL goes ahead and negotiates a session key."}, {"Time_Start": 2769.8, "Time_End": 2773.58, "Text": " In other words, each individual, you don't go ahead and use RSA for your mass encryption."}, {"Time_Start": 2773.76, "Time_End": 2776.9, "Text": " Use like triple desks, use RC4, lately use AES."}, {"Time_Start": 2777.06, "Time_End": 2778.2200000000003, "Text": " This is relatively fast."}, {"Time_Start": 2778.46, "Time_End": 2781.7000000000003, "Text": " And there's an individual key for each session that is used."}, {"Time_Start": 2782.5, "Time_End": 2783.26, "Text": " Here's an idea."}, {"Time_Start": 2783.38, "Time_End": 2786.08, "Text": " Let's send that key to the IDS and have it just, have it work."}, {"Time_Start": 2786.8, "Time_End": 2788.34, "Text": " This isn't just talked about it anymore."}, {"Time_Start": 2788.64, "Time_End": 2791.04, "Text": " As of about three days ago, it works."}, {"Time_Start": 2791.04, "Time_End": 2793.52, "Text": " Today, the key is transferred to the IDS over an S."}, {"Time_Start": 2793.9, "Time_End": 2799.34, "Text": " SSLDM actually asks you, what is the password of the host you would like to leak the keys to?"}, {"Time_Start": 2800.14, "Time_End": 2804.6800000000003, "Text": " Ah, but it gets cooler, because there's independent keys for each direction."}, {"Time_Start": 2804.98, "Time_End": 2808.14, "Text": " So there's a key from the client to the server, and there's a key from the server to the client."}, {"Time_Start": 2808.38, "Time_End": 2810.88, "Text": " You can tell the IDS a key for only a single direction."}, {"Time_Start": 2811.2000000000003, "Time_End": 2816.02, "Text": " You're a bank, you don't want the IDS to be able to read traffic from this really sensitive area"}, {"Time_Start": 2816.02, "Time_End": 2821.32, "Text": " inside your bank because regulations, but you don't trust traffic from the outside world."}, {"Time_Start": 2821.32, "Time_End": 2823.78, "Text": " How can the IDS go ahead and read the bad traffic?"}, {"Time_Start": 2823.9, "Time_End": 2827.78, "Text": " but not the trusted one, you just give it the key from the client to the server."}, {"Time_Start": 2828.2200000000003, "Time_End": 2829.78, "Text": " This works today."}, {"Time_Start": 2831.7000000000003, "Time_End": 2833.84, "Text": " It's also not entirely necessary, guys."}, {"Time_Start": 2834.52, "Time_End": 2838.38, "Text": " HTTP is a sucky protocol overall, but it turns out you can go ahead."}, {"Time_Start": 2838.44, "Time_End": 2844.36, "Text": " It takes everything you've gotten your request, it gives you a nice big batch that you toss off to your web application."}, {"Time_Start": 2845.1, "Time_End": 2850.7200000000003, "Text": " You take this nice big batch and you say, hey, IDS, is this a good thing or a bad thing?"}, {"Time_Start": 2851.12, "Time_End": 2853.88, "Text": " If it says it's a good thing, then you pass it to your application."}, {"Time_Start": 2853.9, "Time_End": 2859.2200000000003, "Text": " application. Guys, we need mod IDS for Apache. This would not be hard to write."}, {"Time_Start": 2860.54, "Time_End": 2865.28, "Text": " Disadvantage of this method, by the way. You know, yeah, it's so straightforward. It's totally"}, {"Time_Start": 2865.28, "Time_End": 2870.62, "Text": " immune to TCP attacks. You can like filter out bytes, you know, Excel passwords and numbers and"}, {"Time_Start": 2870.62, "Time_End": 2877.3, "Text": " whatnot. But it's not as cool. You don't mess with SSL in this really weird way. But it's really"}, {"Time_Start": 2877.3, "Time_End": 2883.88, "Text": " straightforward to write. Everyone here is a web developer could write it today. So guys, those are my toys."}, {"Time_Start": 2883.9, "Time_End": 2903.86, "Text": " All right, I don't know how much time we got for questions, but who here's got something. We got five minutes for questions. Who's got something? We got five minutes for questions. Who's got something that'll scare me? This guy over here. I'll mic them."}, {"Time_Start": 2903.86, "Time_End": 2909.58, "Text": " You have talked about network or director."}, {"Time_Start": 2911.34, "Time_End": 2917.2000000000003, "Text": " Wouldn't you get a problem of, when you're sending ARP, you're speaking ARP packets and sending them"}, {"Time_Start": 2917.2000000000003, "Time_End": 2922.94, "Text": " to the router, wouldn't, the original station would also respond sometimes with their ARP packets?"}, {"Time_Start": 2923.2400000000002, "Time_End": 2926.6, "Text": " Wouldn't the ARP conflicts be detected by router or by the hosts?"}, {"Time_Start": 2928.32, "Time_End": 2931.02, "Text": " So you're actually referring to the Nat in the middle case, right?"}, {"Time_Start": 2931.02, "Time_End": 2941.8, "Text": " So basically what he's saying is that every once in a while, you're going to gratuitously get your legitimate client going ahead and sending out ARPS."}, {"Time_Start": 2942.88, "Time_End": 2948.34, "Text": " Art man in the middle attacks work. They really do. As long as everybody thinks that everything is going through."}, {"Time_Start": 2948.64, "Time_End": 2953.56, "Text": " Now the legitimate client's going to go ahead and start sending out ARPS possibly if it's not getting traffic through."}, {"Time_Start": 2953.56, "Time_End": 2961.0, "Text": " So your big thing is make sure the legitimate guy who has the address gets his traffic through and then he's not going to go ahead and be spitting out."}, {"Time_Start": 2961.02, "Time_End": 2964.24, "Text": " too many ARPs gratuitously himself. But it is an issue with any"}, {"Time_Start": 2964.24, "Time_End": 2971.1, "Text": " Markman in the middle attack. Any other questions? Right over there. Hit me."}, {"Time_Start": 2971.9, "Time_End": 2977.28, "Text": " What about egress filtering and your redirector? Ah, yes, egress filtering. Security"}, {"Time_Start": 2977.28, "Time_End": 2983.68, "Text": " professionals saying, star's apologies are the best thing in the world. This is me saying when"}, {"Time_Start": 2983.68, "Time_End": 2987.72, "Text": " you turn on egress filtering, you actually do lose some significant functionality. You"}, {"Time_Start": 2987.7200000000003, "Time_End": 2994.7200000000003, "Text": " lose what is effectively a really good way to make load balancing distributed, truly distributed."}, {"Time_Start": 2994.7200000000003, "Time_End": 2998.7200000000003, "Text": " Other questions? Right there."}, {"Time_Start": 2998.7200000000003, "Time_End": 3009.7200000000003, "Text": " I was thinking about the IP redirection on the server."}, {"Time_Start": 3009.7200000000003, "Time_End": 3017.7000000000003, "Text": " Uh-huh. What am I missing when I'm thinking that that that would be an ideal way for peer-to-peer"}, {"Time_Start": 3017.7200000000003, "Time_End": 3020.7200000000003, "Text": " people serving up file to peer to be..."}, {"Time_Start": 3020.7200000000003, "Time_End": 3021.7200000000003, "Text": " You're missing that."}, {"Time_Start": 3021.7200000000003, "Time_End": 3027.7200000000003, "Text": " So many people are behind Nats now and you can't send a packet with a spoofed source IP behind a NAT."}, {"Time_Start": 3027.7200000000003, "Time_End": 3028.7200000000003, "Text": " That's the problem."}, {"Time_Start": 3028.7200000000003, "Time_End": 3035.7200000000003, "Text": " If you didn't have all the Nats out there, I mean, on the flip side, there are a lot of P2B users who aren't behind Nats."}, {"Time_Start": 3035.7200000000003, "Time_End": 3038.7200000000003, "Text": " And yes, in that situation, it's just fantastic."}, {"Time_Start": 3038.7200000000003, "Time_End": 3045.7200000000003, "Text": " In which case the problem becomes Windows doesn't have nearly the nice way to go ahead and intercept the packet"}, {"Time_Start": 3045.7200000000003, "Time_End": 3046.7200000000003, "Text": " right before it leaves."}, {"Time_Start": 3046.7200000000003, "Time_End": 3051.7200000000003, "Text": " and if someone here can tell me a good way to do it, like a case of this stuff is yours."}, {"Time_Start": 3051.7200000000003, "Time_End": 3054.7200000000003, "Text": " Well, but I'm not involved with that."}, {"Time_Start": 3054.7200000000003, "Time_End": 3058.7200000000003, "Text": " Any other questions or thoughts?"}, {"Time_Start": 3058.7200000000003, "Time_End": 3062.7200000000003, "Text": " If not, thank you. Oh wait, one more. This is the last question."}, {"Time_Start": 3062.7200000000003, "Time_End": 3070.7200000000003, "Text": " In reference to ARP updates, how would you deal with static ARP tables?"}, {"Time_Start": 3070.7200000000003, "Time_End": 3072.7200000000003, "Text": " You couldn't, but they're very rare."}, {"Time_Start": 3072.7200000000003, "Time_End": 3075.7200000000003, "Text": " Even at Black Hat where people are told, please, for the love of God,"}, {"Time_Start": 3075.7200000000003, "Time_End": 3078.2200000000003, "Text": " For the love of God, here's your ARP address."}, {"Time_Start": 3078.38, "Time_End": 3080.4800000000005, "Text": " Please, we're telling you, you're gonna get spoofed."}, {"Time_Start": 3080.5200000000004, "Time_End": 3081.86, "Text": " You're at the black hat briefings."}, {"Time_Start": 3082.5200000000004, "Time_End": 3082.96, "Text": " Everybody."}, {"Time_Start": 3083.8, "Time_End": 3085.9, "Text": " Okay, I got one last story to tell you guys."}, {"Time_Start": 3085.9800000000005, "Time_End": 3086.78, "Text": " This was last year."}, {"Time_Start": 3086.84, "Time_End": 3088.34, "Text": " This is my favorite event at Anycon."}, {"Time_Start": 3089.34, "Time_End": 3091.96, "Text": " So, by the way, so what happens is this guy is giving a talk"}, {"Time_Start": 3091.96, "Time_End": 3094.42, "Text": " about sniffing email passwords."}, {"Time_Start": 3095.1800000000003, "Time_End": 3097.4, "Text": " He goes ahead, and at the beginning of the talk,"}, {"Time_Start": 3097.44, "Time_End": 3100.6000000000004, "Text": " he says, here's a shirt, I'm going to be giving this out at the end of the talk."}, {"Time_Start": 3100.6000000000004, "Time_End": 3105.1000000000004, "Text": " He gives this entire talk about sniffing email passwords over wireless networks"}, {"Time_Start": 3105.1, "Time_End": 3109.02, "Text": " At the end, he says, all right, will Bob Dobbs please come up."}, {"Time_Start": 3109.22, "Time_End": 3110.3199999999997, "Text": " I don't remember what his real name was."}, {"Time_Start": 3110.44, "Time_End": 3111.74, "Text": " Bob Dobbs, please come up."}, {"Time_Start": 3112.24, "Time_End": 3114.58, "Text": " The guy comes up, how'd you know I was in this talk?"}, {"Time_Start": 3115.2999999999997, "Time_End": 3121.2999999999997, "Text": " Sir, you came to a sniffing email passwords talk, and you checked your email without encryption."}, {"Time_Start": 3121.7599999999998, "Time_End": 3122.4, "Text": " Thank you."}]}