{"segments": [{"Time_Start": 0.0, "Time_End": 14.0, "Text": " Welcome here. I'm very glad to see so many people in here and I'm also glad to see that"}, {"Time_Start": 14.0, "Time_End": 20.0, "Text": " there's not a lot of sunglasses on and not a lot of people holding their heads from last night."}, {"Time_Start": 20.0, "Time_End": 28.0, "Text": " So yeah, welcome. Okay, so what we're talking about today is cyber terrorism and cyber warfare kind of thing."}, {"Time_Start": 28.0, "Time_End": 34.4, "Text": " A lot of been said about cyber terrorism. There's a lot of stuff that can be said about it."}, {"Time_Start": 34.4, "Time_End": 41.24, "Text": " There's a lot of people that say cyber terrorism is not a reality today and that we don't really know that it can be effective."}, {"Time_Start": 42.24, "Time_End": 57.2, "Text": " So what we're trying to do here today is not answer that question, but rather find out if there's a way to build a little bit of a framework that we can use to make these kind of attacks more effective."}, {"Time_Start": 57.2, "Time_End": 59.2, "Text": " So let's go on to the next slide."}, {"Time_Start": 59.2, "Time_End": 63.2, "Text": " Okay, you know, people say, you know, packet can't fly a plane."}, {"Time_Start": 63.2, "Time_End": 69.2, "Text": " So cyber terrorism isn't really something that will instill terror in people."}, {"Time_Start": 69.2, "Time_End": 71.2, "Text": " And I tend to agree with it."}, {"Time_Start": 71.2, "Time_End": 77.2, "Text": " You know, it's easier to blow up a building than to have a nicely coordinated kind of attack."}, {"Time_Start": 77.2, "Time_End": 86.2, "Text": " Typically what we're seeing today with, when you start reading about cyber terrorism, that kind of thing,"}, {"Time_Start": 86.2, "Time_End": 87.2, "Text": " typically what you're seeing to do."}, {"Time_Start": 87.2, "Time_End": 97.2, "Text": " is people talking about denial of service attacks. So they're saying, yeah, you know, we can doce the whole network of the internet."}, {"Time_Start": 97.2, "Time_End": 117.18, "Text": " And the other kind of approach that they have is saying, well, we can break into, let's say, a power grid of a large energy provider and thereby disabling the power, or we can act in some way and do some stuff there, and effect"}, {"Time_Start": 117.2, "Time_End": 131.2, "Text": " critical kind of infrastructure. Now, to me, okay, now to me, that's kind of, I don't know, it's not really, it's not really that effective for a couple of reasons."}, {"Time_Start": 131.2, "Time_End": 143.2, "Text": " First of all, there's a lot of companies and manufacturers and sectors, business sectors, that kind of thing, that doesn't rely that much on the internet being up and running, correct?"}, {"Time_Start": 143.2, "Time_End": 146.78, "Text": " I mean, if you DOS, let's say, Ford,"}, {"Time_Start": 147.20000000000002, "Time_End": 155.20000000000002, "Text": " a motor car manufacturer, they're still going to have cars coming out of the production line if they're not connected to the internet."}, {"Time_Start": 155.20000000000002, "Time_End": 159.20000000000002, "Text": " They don't need to ping an IP address in order to generate a car."}, {"Time_Start": 159.20000000000002, "Time_End": 168.20000000000002, "Text": " So really, when you take their network down, you're really just only affecting maybe the fact that they can't send porn anymore around,"}, {"Time_Start": 168.20000000000002, "Time_End": 172.20000000000002, "Text": " and they can't chat to their friends on MSN."}, {"Time_Start": 172.20000000000002, "Time_End": 176.20000000000002, "Text": " You're not really affecting something internal to that company."}, {"Time_Start": 176.20000000000002, "Time_End": 182.20000000000002, "Text": " that's the first thing with denial of service attacks."}, {"Time_Start": 182.20000000000002, "Time_End": 186.20000000000002, "Text": " Whoa, dude, you're jumping ahead."}, {"Time_Start": 186.20000000000002, "Time_End": 195.20000000000002, "Text": " Okay, the second kind of attack that says we can break into a network and we can disable,"}, {"Time_Start": 195.20000000000002, "Time_End": 199.20000000000002, "Text": " let's say, the power grid for a specific area."}, {"Time_Start": 199.20000000000002, "Time_End": 203.20000000000002, "Text": " While I think that is, dude, you're jumping ahead."}, {"Time_Start": 203.20000000000002, "Time_End": 223.20000000000002, "Text": " So the problem with breaching the perimeter, I think it's possible to breach a perimeter, I think it's a critical kind of infrastructure perimeter"}, {"Time_Start": 223.20000000000002, "Time_End": 227.20000000000002, "Text": " and possibly disable some kind of power grid somewhere."}, {"Time_Start": 227.20000000000002, "Time_End": 232.20000000000002, "Text": " What you need to keep in mind there is that there's a lot of redundancy in these systems, okay?"}, {"Time_Start": 232.20000000000002, "Time_End": 238.20000000000002, "Text": " If you look at power providers in America, there's hundreds of electrical power supplies."}, {"Time_Start": 238.20000000000002, "Time_End": 243.20000000000002, "Text": " And they can switch between different kind of setups quite easily."}, {"Time_Start": 243.20000000000002, "Time_End": 250.20000000000002, "Text": " So the only way that you're going to make that effective is if you have like 6,000 hackers,"}, {"Time_Start": 250.20000000000002, "Time_End": 254.20000000000002, "Text": " and we have 6,000 people here at DefCon, so that's an interesting number,"}, {"Time_Start": 254.20000000000002, "Time_End": 261.20000000000005, "Text": " hack into all of these networks at the same time effectively and coordinated."}, {"Time_Start": 261.2, "Time_End": 265.2, "Text": " And I don't see that happening quite soon."}, {"Time_Start": 265.2, "Time_End": 274.2, "Text": " The, okay, all right, so I don't see that happening quite soon."}, {"Time_Start": 274.2, "Time_End": 281.2, "Text": " And what you must realize is in some cases, the control systems of these critical infrastructures"}, {"Time_Start": 281.2, "Time_End": 285.2, "Text": " is air-gapped from the rest of the IP network, okay?"}, {"Time_Start": 285.2, "Time_End": 287.2, "Text": " So they don't connect the two together."}, {"Time_Start": 287.2, "Time_End": 290.2, "Text": " So it starts to become a little bit difficult."}, {"Time_Start": 290.2, "Time_End": 299.2, "Text": " difficult to actually coordinate some kind of a strike that will really have an impact on the country as such."}, {"Time_Start": 299.2, "Time_End": 302.2, "Text": " So if we look at the, no, go back."}, {"Time_Start": 302.2, "Time_End": 307.2, "Text": " So if we look at the kind of attacks, the denial of service attack on the one end"}, {"Time_Start": 307.2, "Time_End": 311.2, "Text": " and the breaching of the perimeter and the other end, we see, first of all,"}, {"Time_Start": 311.2, "Time_End": 314.2, "Text": " it does not hurt enough if we do a denial of service attack,"}, {"Time_Start": 314.2, "Time_End": 319.2, "Text": " and if we breach the perimeter, it's not going to be that effective."}, {"Time_Start": 319.2, "Time_End": 323.2, "Text": " So, yeah, no, yeah."}, {"Time_Start": 327.2, "Time_End": 333.2, "Text": " So what we need, what we really need is attacks that are very focused"}, {"Time_Start": 333.2, "Time_End": 337.2, "Text": " towards a specific industry or a specific country,"}, {"Time_Start": 338.2, "Time_End": 340.2, "Text": " really nicely targeted."}, {"Time_Start": 340.2, "Time_End": 346.2, "Text": " It must be closely coordinated, which means we want to see all of this happening at the same time."}, {"Time_Start": 346.2, "Time_End": 348.2, "Text": " When you, if you blow up a building,"}, {"Time_Start": 348.2, "Time_End": 355.2, "Text": " blow up a building, it doesn't help if you want to destroy a building, it does not help if you take one brick every day and move it away."}, {"Time_Start": 355.2, "Time_End": 365.2, "Text": " And after a while, after a while, you know, people are going to like find out that you're taking away one brick at a time."}, {"Time_Start": 365.2, "Time_End": 370.2, "Text": " And after the couple of few days, they're going to say, you know, you can't take this building away."}, {"Time_Start": 370.2, "Time_End": 371.2, "Text": " You have to have it in one go."}, {"Time_Start": 371.2, "Time_End": 373.2, "Text": " You have to get the thing destroyed in one go."}, {"Time_Start": 373.2, "Time_End": 375.2, "Text": " And the same with this kind of thing."}, {"Time_Start": 375.2, "Time_End": 377.2, "Text": " You need to have something that is nicely coordinated."}, {"Time_Start": 377.2, "Time_End": 380.2, "Text": " is nicely coordinated and that happens at the same time."}, {"Time_Start": 380.2, "Time_End": 391.2, "Text": " You also want it wide enough so it can really cripple a country or have a make a dent in the economic kind of infrastructure in a country."}, {"Time_Start": 391.2, "Time_End": 397.2, "Text": " You need it to be effective, so it needs to run very kind of targeted, very quick."}, {"Time_Start": 397.2, "Time_End": 400.2, "Text": " It needs to work all the time."}, {"Time_Start": 400.2, "Time_End": 406.2, "Text": " And the last part that's very important for us, it needs to be very fast."}, {"Time_Start": 406.2, "Time_End": 412.2, "Text": " We don't want to have people being able to stop this thing once it started."}, {"Time_Start": 412.2, "Time_End": 414.2, "Text": " It needs to run real quick."}, {"Time_Start": 414.2, "Time_End": 420.2, "Text": " And the only way that we're going to get that working is by doing it automated."}, {"Time_Start": 420.2, "Time_End": 426.2, "Text": " So we're saying too fast for human intervention, we need it automated."}, {"Time_Start": 426.2, "Time_End": 430.2, "Text": " So when we're looking at something that's automated, the first thing that comes to mind is,"}, {"Time_Start": 430.2, "Time_End": 435.2, "Text": " okay, next slide, is a really nasty kind of worm."}, {"Time_Start": 435.2, "Time_End": 436.2, "Text": " Okay."}, {"Time_Start": 436.2, "Time_End": 439.64, "Text": " I want to talk about a worm quickly."}, {"Time_Start": 439.64, "Time_End": 447.08, "Text": " What we find is that external networks, parameters, are actually quite difficult to breach, right?"}, {"Time_Start": 447.08, "Time_End": 451.92, "Text": " There's firewalls in there, you've got IDS in there, there's all sorts of interesting technology that's"}, {"Time_Start": 451.92, "Time_End": 458.03999999999996, "Text": " available today that makes it very difficult to break through external network."}, {"Time_Start": 458.03999999999996, "Time_End": 462.96, "Text": " While if you look at the internal network, you find that normally the internal network is like"}, {"Time_Start": 462.96, "Time_End": 464.96, "Text": " soft and cozy, right?"}, {"Time_Start": 464.96, "Time_End": 465.96, "Text": " There's a whole lot of vulnerabilities around."}, {"Time_Start": 465.96000000000004, "Time_End": 470.20000000000005, "Text": " around there that we can find and that we can exploit."}, {"Time_Start": 470.20000000000005, "Time_End": 476.72, "Text": " And the reason for that is that system administrators tend to not patch machines that are internal."}, {"Time_Start": 476.72, "Time_End": 485.02000000000004, "Text": " They say we know about the, let's say, the RPC vulnerability that was found a couple of weeks ago,"}, {"Time_Start": 485.02000000000004, "Time_End": 488.22, "Text": " but we don't have anything that's internet facing."}, {"Time_Start": 488.22, "Time_End": 492.62000000000006, "Text": " So the vulnerability really does not matter to us that much."}, {"Time_Start": 492.62000000000006, "Time_End": 495.94000000000005, "Text": " And that's probably true for"}, {"Time_Start": 495.96000000000004, "Time_End": 499.96000000000004, "Text": " for a lot of the problems that you see nowadays."}, {"Time_Start": 499.96000000000004, "Time_End": 506.3, "Text": " What you find also is that when there's a vulnerability that affects a kind of a package"}, {"Time_Start": 506.3, "Time_End": 511.72, "Text": " that is internet-facing, system administrators tend to patch only the stuff that is internet-facing"}, {"Time_Start": 511.72, "Time_End": 513.84, "Text": " and the internal machines never get patched."}, {"Time_Start": 513.84, "Time_End": 516.9000000000001, "Text": " The second reason for this is that people add new machines."}, {"Time_Start": 516.9000000000001, "Time_End": 520.36, "Text": " So they add a whole lot of machines to the network."}, {"Time_Start": 520.36, "Time_End": 523.9000000000001, "Text": " Those machines never go through a proper QA process."}, {"Time_Start": 523.9000000000001, "Time_End": 525.94, "Text": " And so we're sitting with a whole lot of machines internal."}, {"Time_Start": 525.96, "Time_End": 528.44, "Text": " that are quite weak."}, {"Time_Start": 529.88, "Time_End": 534.1800000000001, "Text": " The other thing to realize that's very, very important is that an internal network is highly"}, {"Time_Start": 534.1800000000001, "Time_End": 538.24, "Text": " as likely not to be segmented."}, {"Time_Start": 538.94, "Time_End": 541.2, "Text": " Okay, so internal network on a network level is flat."}, {"Time_Start": 541.64, "Time_End": 544.1600000000001, "Text": " There's no firewalls in the internal network."}, {"Time_Start": 544.88, "Time_End": 547.9200000000001, "Text": " And later on we will see why that is really helping us a lot."}, {"Time_Start": 548.58, "Time_End": 554.52, "Text": " So what you're really looking for is that, what I'm really saying is that a worm that can carry"}, {"Time_Start": 554.52, "Time_End": 559.92, "Text": " a couple of different payloads in terms of exploits will really make a kind of a killing"}, {"Time_Start": 559.92, "Time_End": 560.92, "Text": " on an internal net."}, {"Time_Start": 562.0, "Time_End": 564.46, "Text": " So let's have a look and see what we have."}, {"Time_Start": 566.46, "Time_End": 567.18, "Text": " Thanks, Shal."}, {"Time_Start": 569.26, "Time_End": 576.74, "Text": " Okay, so we're looking at something like, and these are really kind of low-hanging fruit exploits"}, {"Time_Start": 576.74, "Time_End": 577.98, "Text": " and problems."}, {"Time_Start": 578.26, "Time_End": 582.88, "Text": " You're looking at something like your good old Unicode, Double-D-code, M-D-Code, MD-Code, MD,"}, {"Time_Start": 582.88, "Time_End": 584.5, "Text": " you're looking at dot-printer, dot-printer."}, {"Time_Start": 584.52, "Time_End": 588.96, "Text": " adi, web dev, and then some stupid stuff."}, {"Time_Start": 589.14, "Time_End": 591.56, "Text": " Like, it's not even a problem."}, {"Time_Start": 591.8199999999999, "Time_End": 595.46, "Text": " It's not a vulnerability in the software, but it's really a configuration problem."}, {"Time_Start": 596.66, "Time_End": 601.4399999999999, "Text": " So Microsoft SQL running with a blank SA password,"}, {"Time_Start": 601.9399999999999, "Time_End": 609.9, "Text": " local administrators that has a blank password and sharing C-Dolar out there."}, {"Time_Start": 610.9, "Time_End": 614.24, "Text": " We think of things like Slammer, which was the SQL,"}, {"Time_Start": 614.52, "Time_End": 620.12, "Text": " okay, it's a service problem in that, you've got the Apache chunk encoding stuff, OpenSSL."}, {"Time_Start": 620.3199999999999, "Time_End": 624.56, "Text": " You know, there's a whole lot of different exploits and a whole lot of different problems out there"}, {"Time_Start": 624.56, "Time_End": 629.84, "Text": " that we really know, we know how to code them, we know what they are, we know how they sit together."}, {"Time_Start": 631.48, "Time_End": 639.18, "Text": " But these problems have been to a large extent being solved on the internet and on the perimeters."}, {"Time_Start": 639.56, "Time_End": 644.5, "Text": " But in the internal networks, these kind of problems are quite big and large, and we're"}, {"Time_Start": 644.52, "Time_End": 645.52, "Text": " We know that they are there."}, {"Time_Start": 645.52, "Time_End": 651.92, "Text": " And anyone here that's an administrator that's got a large network will know that these"}, {"Time_Start": 651.92, "Time_End": 655.1999999999999, "Text": " are problems in your internal network."}, {"Time_Start": 655.1999999999999, "Time_End": 656.4, "Text": " Okay?"}, {"Time_Start": 656.4, "Time_End": 662.84, "Text": " Okay, so one of the things when you're writing a worm to look at is actually finding more food, what"}, {"Time_Start": 662.84, "Time_End": 669.1999999999999, "Text": " we call it, saying that we want to be able to find new machines to attack."}, {"Time_Start": 669.1999999999999, "Time_End": 674.5, "Text": " And so when you're looking at an internal network, it's quite another story to"}, {"Time_Start": 674.52, "Time_End": 679.0, "Text": " get IP addresses there than to get IP addresses on the internet."}, {"Time_Start": 679.0, "Time_End": 682.0799999999999, "Text": " And it's quite easier to find IP addresses on the internal network."}, {"Time_Start": 682.0799999999999, "Time_End": 691.4, "Text": " So we're quickly going to have a look and see what there's available to find more food."}, {"Time_Start": 691.4, "Time_End": 695.84, "Text": " First of all, the easiest thing that you can do is you can simply look at your IP address"}, {"Time_Start": 695.84, "Time_End": 697.4399999999999, "Text": " and then look at the net mask."}, {"Time_Start": 697.4399999999999, "Time_End": 703.8, "Text": " If you see your IP address being 10, 15, 17, 2 and your net mask 2, and your net mask 2-4-5-000-0, you"}, {"Time_Start": 703.8, "Time_End": 704.5, "Text": " know that you've got a hard-"}, {"Time_Start": 704.52, "Time_End": 709.88, "Text": " a network there that's just about, you know, all nice and flat, and you're immediately"}, {"Time_Start": 709.88, "Time_End": 713.04, "Text": " got a whole lot of targets that you can look at."}, {"Time_Start": 713.04, "Time_End": 719.98, "Text": " The second thing that we can do is we can start looking at, we can start looking at SNMP, and"}, {"Time_Start": 719.98, "Time_End": 725.22, "Text": " we can basically go through the ranges that we now found in the first instance, send SNMP"}, {"Time_Start": 725.22, "Time_End": 728.76, "Text": " queries to all of those machines, see you respond."}, {"Time_Start": 728.76, "Time_End": 734.02, "Text": " We tried with a community name of, let's say, public and Cisco and the company name or whatever."}, {"Time_Start": 734.02, "Time_End": 745.26, "Text": " and we extract the routes, or as you call it, the routes of these machines, and we easily find all the other networks that's sitting on that internal network."}, {"Time_Start": 745.96, "Time_End": 755.3, "Text": " The third thing we can do, and as we progress in here, you know, kind of the effectiveness of these methods is really kind of, you know, going down a bit."}, {"Time_Start": 755.86, "Time_End": 764.0, "Text": " We can do a trace route to the internet. We can record the routes and see, you know, what kind of hops we find there to"}, {"Time_Start": 764.02, "Time_End": 768.5, "Text": " find out networks that surrounding the net where we are at the moment."}, {"Time_Start": 769.0, "Time_End": 775.3199999999999, "Text": " And that is given that the IP address where we're executing from is really internal to the network."}, {"Time_Start": 775.46, "Time_End": 779.02, "Text": " So just now we're going to see how we're going to get this thing internal to the network."}, {"Time_Start": 779.34, "Time_End": 782.48, "Text": " I know it's annoying when this thing goes on and off. It's annoying to me as well."}, {"Time_Start": 784.34, "Time_End": 789.8, "Text": " Okay, the fourth thing that we can do is we can start just basically doing ping sweeps around the network"}, {"Time_Start": 789.8, "Time_End": 794.0, "Text": " and find out what's available. So we go one class or one class C higher, one class."}, {"Time_Start": 794.02, "Time_End": 799.5799999999999, "Text": " see lower. We do a pink sweep. We look at the response times going back. And from the response"}, {"Time_Start": 799.5799999999999, "Time_End": 803.3, "Text": " times, we can have a good indication if that machine is sitting on a local network or not."}, {"Time_Start": 804.1, "Time_End": 810.22, "Text": " And then last of all, if we're really, you know, if we're really getting desperate, then we can start"}, {"Time_Start": 810.22, "Time_End": 816.88, "Text": " doing a brute force and actually try to just run through a couple of IP numbers, ping them, and see what"}, {"Time_Start": 816.88, "Time_End": 821.4399999999999, "Text": " we come up. That's not really effective, but, you know, I thought it'd be nice if I put that in there."}, {"Time_Start": 823.28, "Time_End": 824.0, "Text": " Okay. So."}, {"Time_Start": 824.02, "Time_End": 830.72, "Text": " So let's look at the next thing. I don't know if you can see there on the screen quite nicely."}, {"Time_Start": 832.96, "Time_End": 839.0799999999999, "Text": " The one thing that's interesting for internal networks is when you look at denial of service attacks,"}, {"Time_Start": 839.74, "Time_End": 848.4399999999999, "Text": " the types of denial of service attacks that you can find on internal networks are very much more kind of sophisticated."}, {"Time_Start": 848.9, "Time_End": 853.5799999999999, "Text": " And there's a couple of more choices that you can have when you're doing denial of service on internal networks"}, {"Time_Start": 853.58, "Time_End": 855.38, "Text": " than on external networks."}, {"Time_Start": 855.86, "Time_End": 863.4000000000001, "Text": " Okay, so if I think about it real quick, you must realize that worms that you have on internal network"}, {"Time_Start": 863.4000000000001, "Time_End": 865.24, "Text": " propagate at wire speeds, okay?"}, {"Time_Start": 865.84, "Time_End": 870.7800000000001, "Text": " So you've seen what Slammer, for instance, does to your Cisco boxes, right?"}, {"Time_Start": 871.1600000000001, "Time_End": 880.0400000000001, "Text": " Slamer didn't have a dedicated denial of service payload, but because it propagated that quick"}, {"Time_Start": 880.0400000000001, "Time_End": 883.5600000000001, "Text": " and because it was sitting on an internal network, it was flooding your network to the"}, {"Time_Start": 883.58, "Time_End": 886.08, "Text": " the extent that some of the routes went down."}, {"Time_Start": 886.08, "Time_End": 892.34, "Text": " So when we're starting to build really denial of service attack tools that are dedicated"}, {"Time_Start": 892.34, "Time_End": 898.24, "Text": " to propagated wire speeds and really dedicated to do flooding on wire speeds, I think"}, {"Time_Start": 898.24, "Time_End": 904.0200000000001, "Text": " we can get some more interesting kind of numbers out there than with something that didn't"}, {"Time_Start": 904.0200000000001, "Time_End": 909.72, "Text": " have a dedicated denial of service payload."}, {"Time_Start": 909.72, "Time_End": 912.12, "Text": " Something else that we can do on internal networks that we can't do on."}, {"Time_Start": 912.12, "Time_End": 913.5600000000001, "Text": " External networks is ICMP."}, {"Time_Start": 913.58, "Time_End": 918.46, "Text": " route redirection. We can start playing with the"}, {"Time_Start": 918.46, "Time_End": 924.26, "Text": " the app tables of machines internal, something you can't do on the internet because you're"}, {"Time_Start": 924.26, "Time_End": 929.58, "Text": " not local to the network. You can start doing some trickery on the Mac addresses like assign"}, {"Time_Start": 929.58, "Time_End": 934.58, "Text": " every IP address to your Mac address. There's a couple of things we can do there."}, {"Time_Start": 934.58, "Time_End": 942.7, "Text": " We can do DHCP leased exhaustion attacks whereby we basically emulate the DHEP server until"}, {"Time_Start": 942.7, "Time_End": 944.1400000000001, "Text": " all the leases have expired."}, {"Time_Start": 944.1400000000001, "Time_End": 950.34, "Text": " And there's a couple of things that we can do on the internal network that's really bad, okay?"}, {"Time_Start": 950.88, "Time_End": 954.7800000000001, "Text": " You know what happens when you choose your IP address to be the same as your firewall."}, {"Time_Start": 955.9000000000001, "Time_End": 958.62, "Text": " You know, the whole damn subnet goes down."}, {"Time_Start": 959.6600000000001, "Time_End": 964.72, "Text": " We can even do something on a network where we can, if we can sniff the traffic that we can do"}, {"Time_Start": 964.72, "Time_End": 966.6800000000001, "Text": " hijacking of TCP connections."}, {"Time_Start": 967.2800000000001, "Time_End": 971.7, "Text": " That's not that effective, but an unswitched kind of network, it could do wonders."}, {"Time_Start": 972.7, "Time_End": 979.2800000000001, "Text": " And while we're there, while we're sitting on the machine itself, we can somehow start and delete files."}, {"Time_Start": 979.76, "Time_End": 982.98, "Text": " So we can corrupt all the dock files on the machine, all the XLS files."}, {"Time_Start": 983.5400000000001, "Time_End": 988.2, "Text": " We can look for zip files, insert some bytes into the zip pile thereby correcting it."}, {"Time_Start": 988.7, "Time_End": 997.22, "Text": " We can see if we can flash the BIOS of the machine so that when someone reboots the machine, all the bios settings are lost."}, {"Time_Start": 998.38, "Time_End": 1002.6800000000001, "Text": " We can do pop-up messages all around on all the machines that's,"}, {"Time_Start": 1002.7, "Time_End": 1008.88, "Text": " been effective, thereby, let's say with a pop-up message of something like, your machine"}, {"Time_Start": 1008.88, "Time_End": 1015.24, "Text": " has been infected, please contact your system administrator and read the following 25 characters"}, {"Time_Start": 1015.24, "Time_End": 1017.26, "Text": " to your system administrators."}, {"Time_Start": 1017.26, "Time_End": 1021.1400000000001, "Text": " And then you put in the A, zero, dollar, two, five, whatever."}, {"Time_Start": 1021.1400000000001, "Time_End": 1026.3600000000001, "Text": " The reason for that is that it's basically going to disable the help desk to the extent that"}, {"Time_Start": 1026.3600000000001, "Time_End": 1030.5800000000002, "Text": " the PABX will be flooded and you're really going to keep your administrators quite busy."}, {"Time_Start": 1032.7, "Time_End": 1038.7, "Text": " Something else that we can do is we can look at the routers that's surrounding the network."}, {"Time_Start": 1038.7, "Time_End": 1049.7, "Text": " Okay? And we can have a module that will try to log into the routers and thereby disable all the interfaces on the machine itself."}, {"Time_Start": 1049.7, "Time_End": 1059.7, "Text": " I know there's no default password for Cisco boxes, but, you know, some of the other three-com switches, some of that stuff, has got default passwords."}, {"Time_Start": 1059.7, "Time_End": 1062.68, "Text": " You can kind of guess passwords and see if you can actually have."}, {"Time_Start": 1062.7, "Time_End": 1067.16, "Text": " actually getting to the machine and disable the interfaces."}, {"Time_Start": 1067.16, "Time_End": 1071.5, "Text": " What will happen then is that your administrator won't be able to get to the affected machines"}, {"Time_Start": 1071.5, "Time_End": 1077.76, "Text": " at all, and they need to physically go to the router and, you know, plug a cable in there."}, {"Time_Start": 1077.76, "Time_End": 1081.56, "Text": " Now imagine, you know, it doesn't sound that bad, but if you think about a network with like"}, {"Time_Start": 1081.56, "Time_End": 1088.06, "Text": " 50,000 machines on there and let's say, you know, 1,000,000, 2,000 different routers, it"}, {"Time_Start": 1088.06, "Time_End": 1089.64, "Text": " starts to become a little bit of a nightmare."}, {"Time_Start": 1092.7, "Time_End": 1096.8600000000001, "Text": " Okay, so I know you can't see a lot there because it's a little bit too light in here."}, {"Time_Start": 1097.26, "Time_End": 1102.5, "Text": " But that's typically what a design of such an internal worm would look like."}, {"Time_Start": 1102.96, "Time_End": 1104.4, "Text": " We've got basically three modules."}, {"Time_Start": 1105.32, "Time_End": 1107.5, "Text": " The first module does the reconnaissance."}, {"Time_Start": 1108.76, "Time_End": 1116.7, "Text": " The second module does the actual exploitation, and the third module in there, does the denial of service."}, {"Time_Start": 1117.26, "Time_End": 1121.78, "Text": " Now, of course, the one thing to keep in mind here is that denial of service attacks"}, {"Time_Start": 1121.78, "Time_End": 1125.84, "Text": " and a kind of biological agent that propagates through the network"}, {"Time_Start": 1125.84, "Time_End": 1127.62, "Text": " does not match very well."}, {"Time_Start": 1127.98, "Time_End": 1131.66, "Text": " Okay, so if you have an instance of this worm starting off,"}, {"Time_Start": 1131.74, "Time_End": 1133.94, "Text": " doing denial-of-service stack straight away,"}, {"Time_Start": 1134.6, "Time_End": 1136.26, "Text": " you might disable the whole of the network,"}, {"Time_Start": 1136.36, "Time_End": 1139.02, "Text": " and it means you're not going to propagate into all the machines that you need to."}, {"Time_Start": 1139.1399999999999, "Time_End": 1140.26, "Text": " You can understand what I'm saying."}, {"Time_Start": 1140.5, "Time_End": 1142.8799999999999, "Text": " On the one end, you have someone that's killing everyone."}, {"Time_Start": 1143.24, "Time_End": 1144.84, "Text": " At the other end, you want to infect everyone."}, {"Time_Start": 1145.22, "Time_End": 1147.62, "Text": " Those two things that don't work together quite well."}, {"Time_Start": 1147.62, "Time_End": 1151.18, "Text": " So we worked out a kind of a model to"}, {"Time_Start": 1151.18, "Time_End": 1152.72, "Text": " to get that right."}, {"Time_Start": 1155.72, "Time_End": 1158.64, "Text": " We define something as a, we define a machine as a neighbor."}, {"Time_Start": 1158.8, "Time_End": 1161.0600000000002, "Text": " Now remember what I said, the network is flat, okay?"}, {"Time_Start": 1161.7, "Time_End": 1166.8200000000002, "Text": " So if the network is flat, we can get communications between different instances of this worm going."}, {"Time_Start": 1167.38, "Time_End": 1168.9, "Text": " And that makes it very interesting for us."}, {"Time_Start": 1170.54, "Time_End": 1174.98, "Text": " We'll put something on the website, well, at sensepost.com,"}, {"Time_Start": 1175.46, "Time_End": 1178.5600000000002, "Text": " that would explain exactly how we're going to do that."}, {"Time_Start": 1178.8600000000001, "Time_End": 1181.1000000000001, "Text": " I'm not going to go into too much detail of that now."}, {"Time_Start": 1181.18, "Time_End": 1182.5800000000002, "Text": " It's quite intricate."}, {"Time_Start": 1183.48, "Time_End": 1186.68, "Text": " If you're interested, you can ask me afterwards."}, {"Time_Start": 1187.16, "Time_End": 1188.52, "Text": " I'm just watching the time as well."}, {"Time_Start": 1188.66, "Time_End": 1190.16, "Text": " I've got a lot more that I want to show you."}, {"Time_Start": 1192.54, "Time_End": 1192.94, "Text": " Okay."}, {"Time_Start": 1192.94, "Time_End": 1196.94, "Text": " So now we talked about this thing, this Uber kind of worm,"}, {"Time_Start": 1197.6000000000001, "Time_End": 1201.6000000000001, "Text": " and if we run it somewhere, it's going to take out everything in its way."}, {"Time_Start": 1201.8400000000001, "Time_End": 1203.88, "Text": " But how do we get it into the internal network?"}, {"Time_Start": 1204.8, "Time_End": 1209.5600000000002, "Text": " Well, it's actually much, much easier than you think it is."}, {"Time_Start": 1210.44, "Time_End": 1211.16, "Text": " I'm not going to show."}, {"Time_Start": 1211.18, "Time_End": 1215.74, "Text": " show you any kind of zero-day silent delivery in Outlook or any of that."}, {"Time_Start": 1216.94, "Time_End": 1220.92, "Text": " What you do is you use the correct language."}, {"Time_Start": 1221.1200000000001, "Time_End": 1225.5, "Text": " So if you're attacking a French kind of company, you write your email in French."}, {"Time_Start": 1226.5600000000002, "Time_End": 1233.68, "Text": " And you mail it from marketing at and the company name that you have with a subject that says,"}, {"Time_Start": 1233.8400000000001, "Time_End": 1236.5600000000002, "Text": " new screen saver for company name, click here."}, {"Time_Start": 1237.6000000000001, "Time_End": 1240.76, "Text": " And then you don't really attach the..."}, {"Time_Start": 1241.18, "Time_End": 1246.98, "Text": " the EXE to the mail because your content level filter is going to pick it up"}, {"Time_Start": 1246.98, "Time_End": 1247.96, "Text": " and going to shut it out."}, {"Time_Start": 1248.7, "Time_End": 1257.1200000000001, "Text": " But you send a link to the actual EXE, and you make sure that that EXE is located on a site"}, {"Time_Start": 1257.1200000000001, "Time_End": 1261.18, "Text": " that supports HGPS, that's SSL enabled."}, {"Time_Start": 1261.76, "Time_End": 1263.1200000000001, "Text": " The reason for that is easy."}, {"Time_Start": 1263.8200000000002, "Time_End": 1271.14, "Text": " If we put something on a site that is setting up, well, what's going to happen, your browser is going to set up"}, {"Time_Start": 1271.18, "Time_End": 1276.8400000000001, "Text": " encrypted tunnel to, encrypted session to that web server, thereby all your content level"}, {"Time_Start": 1276.8400000000001, "Time_End": 1279.2, "Text": " stuff is not going to pick up what's going past the wide."}, {"Time_Start": 1279.3, "Time_End": 1283.94, "Text": " You could be surfing porn or you could be downloading this nasty EXE."}, {"Time_Start": 1285.0, "Time_End": 1291.1000000000001, "Text": " And what we do is we also put a, we kind of officicate the URL."}, {"Time_Start": 1291.5600000000002, "Time_End": 1294.7, "Text": " So we call it intranet.companic xX.com."}, {"Time_Start": 1295.3600000000001, "Time_End": 1300.74, "Text": " And then we have a little ad sign there, and then we put a in hex, we encode the rest of the"}, {"Time_Start": 1300.74, "Time_End": 1304.06, "Text": " or the rest of the URL, that's the actual URL."}, {"Time_Start": 1304.42, "Time_End": 1310.06, "Text": " Obviously, you know that the part in front of the ad sign is actually a username that's been passed on,"}, {"Time_Start": 1310.56, "Time_End": 1313.94, "Text": " and the part behind the ad sign is the real site."}, {"Time_Start": 1314.06, "Time_End": 1315.86, "Text": " Now, you know this, right?"}, {"Time_Start": 1316.64, "Time_End": 1319.92, "Text": " But your marketing department, they do not know this."}, {"Time_Start": 1320.22, "Time_End": 1326.42, "Text": " And you're in the kind of management department, management structure, they don't know it either."}, {"Time_Start": 1326.86, "Time_End": 1328.7, "Text": " And sales, oh shit, they don't know anything."}, {"Time_Start": 1330.74, "Time_End": 1339.1200000000001, "Text": " Okay, so you might say, well, this is really not that effective, and I don't see this really"}, {"Time_Start": 1339.1200000000001, "Time_End": 1340.1200000000001, "Text": " really working."}, {"Time_Start": 1340.1200000000001, "Time_End": 1347.72, "Text": " I'll ask you this, all of you get a whole lot of spam messages, you know, and you delete it, right?"}, {"Time_Start": 1347.72, "Time_End": 1350.82, "Text": " You delete it without even looking at the content, correct?"}, {"Time_Start": 1350.82, "Time_End": 1355.52, "Text": " But if you were to get an email that's coming from marketing at your company name, it's got"}, {"Time_Start": 1355.52, "Time_End": 1360.3, "Text": " your company name in there, coded perfectly in there, and it says new screensaver for your"}, {"Time_Start": 1360.3, "Time_End": 1364.74, "Text": " company name, perfectly spelled okay, and it's in your language that you speak,"}, {"Time_Start": 1365.24, "Time_End": 1367.0, "Text": " then you're probably going to have a look at it, right?"}, {"Time_Start": 1367.36, "Time_End": 1372.7, "Text": " You might not execute the stuff because you people here are more kind of security aware,"}, {"Time_Start": 1372.9199999999998, "Time_End": 1375.1599999999999, "Text": " but it's actually a nice way of getting it in there."}, {"Time_Start": 1375.36, "Time_End": 1376.46, "Text": " So let's look at stats."}, {"Time_Start": 1377.48, "Time_End": 1383.22, "Text": " So we wanted to do this and see what it would get to, and we couldn't really find someone"}, {"Time_Start": 1383.22, "Time_End": 1384.8799999999999, "Text": " that would let us test it."}, {"Time_Start": 1384.8799999999999, "Time_End": 1390.28, "Text": " So at the end of the day, we've got to."}, {"Time_Start": 1390.3, "Time_End": 1395.3, "Text": " We've got a bank in South Africa that allowed us to send it to their security team."}, {"Time_Start": 1395.3, "Time_End": 1399.3, "Text": " It's 13 people of the security team."}, {"Time_Start": 1399.3, "Time_End": 1401.3, "Text": " Now, here's the stat."}, {"Time_Start": 1401.3, "Time_End": 1411.3, "Text": " Because we, because we, because we, the payload that we sent in this case was a modified version"}, {"Time_Start": 1411.3, "Time_End": 1415.3, "Text": " of the Trojan that we talked about last year."}, {"Time_Start": 1415.3, "Time_End": 1420.28, "Text": " And what it basically did is it pulled out the username of the environmental"}, {"Time_Start": 1420.3, "Time_End": 1423.3, "Text": " and then it reported the username to us, okay?"}, {"Time_Start": 1423.3, "Time_End": 1426.3, "Text": " So we can see exactly who was downloading the thing,"}, {"Time_Start": 1426.3, "Time_End": 1429.3, "Text": " and we can exactly see who executed this thing."}, {"Time_Start": 1429.3, "Time_End": 1430.3, "Text": " So here's this that."}, {"Time_Start": 1430.3, "Time_End": 1433.3, "Text": " We mailed 13 people in the group."}, {"Time_Start": 1433.3, "Time_End": 1435.3, "Text": " Eight of them downloaded the EXE."}, {"Time_Start": 1435.3, "Time_End": 1438.3, "Text": " We can see that in our Apache logs, right, they clicked on the thing."}, {"Time_Start": 1438.3, "Time_End": 1440.3, "Text": " And five of them executed it."}, {"Time_Start": 1440.3, "Time_End": 1443.3, "Text": " Now, because we had this specialized payload,"}, {"Time_Start": 1443.3, "Time_End": 1444.3, "Text": " it didn't really do anything."}, {"Time_Start": 1444.3, "Time_End": 1448.3, "Text": " It was just like, you know, sending out the username back to us."}, {"Time_Start": 1448.3, "Time_End": 1450.3, "Text": " So the one guy, like, clicked on a three-time"}, {"Time_Start": 1450.3, "Time_End": 1452.3, "Text": " You really wanted that screen server."}, {"Time_Start": 1452.3, "Time_End": 1456.3, "Text": " Okay, now you appreciate that when we do this in a large company,"}, {"Time_Start": 1456.3, "Time_End": 1460.3, "Text": " we only need one person to be able to open that mail,"}, {"Time_Start": 1460.3, "Time_End": 1463.3, "Text": " well, to basically download that thing and open it, correct?"}, {"Time_Start": 1463.3, "Time_End": 1466.3, "Text": " And I know you're going to sell, you're going to say,"}, {"Time_Start": 1466.3, "Time_End": 1472.3, "Text": " well, you know, the EXE itself was sitting on a site that's SSL enabled,"}, {"Time_Start": 1472.3, "Time_End": 1475.3, "Text": " the browser is going to complain about this thing."}, {"Time_Start": 1475.3, "Time_End": 1479.3, "Text": " I know, but people go like, you know, the browser goes,"}, {"Time_Start": 1479.3, "Time_End": 1483.1399999999999, "Text": " The certificate that's presented to you are signed by an unknown authority."}, {"Time_Start": 1483.84, "Time_End": 1487.76, "Text": " Now, okay, you're going to download an EXE now, do you really want to run it?"}, {"Time_Start": 1488.06, "Time_End": 1488.44, "Text": " Yes."}, {"Time_Start": 1490.06, "Time_End": 1491.12, "Text": " That's the way it works."}, {"Time_Start": 1491.3, "Time_End": 1493.8999999999999, "Text": " So you don't need a zero day to get the stuff in there."}, {"Time_Start": 1494.0, "Time_End": 1495.76, "Text": " You simply need to sound convincing."}, {"Time_Start": 1498.26, "Time_End": 1503.26, "Text": " Okay, so now we got this way of basically, okay, I'm going to go through this real quick."}, {"Time_Start": 1503.6599999999999, "Time_End": 1507.6599999999999, "Text": " We've got a way to basically find male people at a company."}, {"Time_Start": 1507.6599999999999, "Time_End": 1509.1, "Text": " How do we find someone?"}, {"Time_Start": 1509.3, "Time_End": 1512.6, "Text": " at a company name. You have a friend, you don't know where they are."}, {"Time_Start": 1512.6, "Time_End": 1515.8, "Text": " You go to Google, right? You put in the company name in there,"}, {"Time_Start": 1515.8, "Time_End": 1519.8, "Text": " and you see if you can find if that person ever emailed anything."}, {"Time_Start": 1519.8, "Time_End": 1526.6, "Text": " So if we do, if we do a Google for at company xxx.com minus"}, {"Time_Start": 1526.6, "Time_End": 1534.3, "Text": " www.com and we scrape it, we basically take all the results coming back and we"}, {"Time_Start": 1534.3, "Time_End": 1537.1, "Text": " extract all the email addresses. It works really nice."}, {"Time_Start": 1537.1, "Time_End": 1539.28, "Text": " Now for example, I use the,"}, {"Time_Start": 1539.3, "Time_End": 1545.3, "Text": " some kind of newspaper, Hary Yet newspaper in Turkey, just as an example, you run it and you"}, {"Time_Start": 1545.3, "Time_End": 1548.3, "Text": " get 83 different email addresses of people."}, {"Time_Start": 1548.3, "Time_End": 1554.3, "Text": " Now, these are people that typically ever emailed any forum, ever mailed to a news group"}, {"Time_Start": 1554.3, "Time_End": 1559.3, "Text": " or to a mailing list or signed a guest book or this."}, {"Time_Start": 1559.3, "Time_End": 1561.3, "Text": " But those email addresses exist."}, {"Time_Start": 1561.3, "Time_End": 1563.3, "Text": " They sit there on the internet that can be mined."}, {"Time_Start": 1563.3, "Time_End": 1567.3, "Text": " This is how you get all your junk mail through people that does the same thing and then send you junk mail."}, {"Time_Start": 1567.3, "Time_End": 1568.3, "Text": " So we're basically just doing it."}, {"Time_Start": 1568.3, "Time_End": 1572.3, "Text": " We're basically just doing a kind of interesting spam exercise here."}, {"Time_Start": 1572.3, "Time_End": 1573.3, "Text": " Okay."}, {"Time_Start": 1573.3, "Time_End": 1577.3, "Text": " So now we want to make it a little bit more wider."}, {"Time_Start": 1577.3, "Time_End": 1581.3, "Text": " So we want to look at the, we want to look at the whole country, right?"}, {"Time_Start": 1581.3, "Time_End": 1582.3, "Text": " Okay?"}, {"Time_Start": 1582.3, "Time_End": 1586.3, "Text": " So what we do is, we said we can extract email addresses from companies."}, {"Time_Start": 1586.3, "Time_End": 1589.3, "Text": " Now what we need to do is we need to find the companies, correct?"}, {"Time_Start": 1589.3, "Time_End": 1591.3, "Text": " We need to find all these different companies."}, {"Time_Start": 1591.3, "Time_End": 1595.3, "Text": " And we're going to target the following sectors within a country."}, {"Time_Start": 1595.3, "Time_End": 1597.3, "Text": " We're going to look at telecom."}, {"Time_Start": 1597.3, "Time_End": 1598.3, "Text": " We're going to look at all the companies."}, {"Time_Start": 1598.3, "Time_End": 1603.54, "Text": " different energy providers, hydro, oil, nuclear, fossil fuel, that kind of thing."}, {"Time_Start": 1603.54, "Time_End": 1609.54, "Text": " We're going to look at government and military. We're going to look at media providers."}, {"Time_Start": 1609.54, "Time_End": 1611.54, "Text": " Why are we going to look at media providers?"}, {"Time_Start": 1611.54, "Time_End": 1616.7, "Text": " Reason we look at media providers is you all love the press, right? You do something small,"}, {"Time_Start": 1616.7, "Time_End": 1622.74, "Text": " they make it into something big. So as part of the kind of hysteria that we want to generate"}, {"Time_Start": 1622.74, "Time_End": 1628.26, "Text": " with this kind of attack, we're going to attack the press as well. And once the"}, {"Time_Start": 1628.3, "Time_End": 1640.3, "Text": " press is attack. They're going to say, you know, this is the end of the world, right? We can just, you know, go and hide in our bunkers because they kind of always make things bigger than it really is."}, {"Time_Start": 1640.3, "Time_End": 1646.3, "Text": " We're looking at the financial services, banks, insurance companies, that kind of thing."}, {"Time_Start": 1646.3, "Time_End": 1658.28, "Text": " We look at prominent businesses. And the reason we look at prominent businesses is that in some countries, the, the, let's say, 60 or 70 or 80 percent of that, of the country's GDP is, is, as, is, you know,"}, {"Time_Start": 1658.3, "Time_End": 1663.3, "Text": " generated by one company. So we want to find that one company and take it out as well."}, {"Time_Start": 1663.3, "Time_End": 1671.3, "Text": " And we look at emergency services in the online demo that we're showing you just now, we're not looking at emergency services, and we look at transport."}, {"Time_Start": 1671.3, "Time_End": 1674.3, "Text": " And for transport, we look at airlines and we look at railway."}, {"Time_Start": 1674.3, "Time_End": 1683.3, "Text": " Okay, so how do you find companies or departments within these different sectors?"}, {"Time_Start": 1683.3, "Time_End": 1688.28, "Text": " Well, let's put it up in private, the private sector and the private sector and the public sector,"}, {"Time_Start": 1688.3, "Time_End": 1695.3, "Text": " public sector. The private sector is actually quite difficult to find. You can't go to Google"}, {"Time_Start": 1695.3, "Time_End": 1701.3, "Text": " and say, give me all the top companies, give me all the telecom companies in this country."}, {"Time_Start": 1701.3, "Time_End": 1704.3, "Text": " The online directories just doesn't work that well."}, {"Time_Start": 1704.3, "Time_End": 1710.3, "Text": " So the way to go there is to actually find specialized directories. So you can go to Google,"}, {"Time_Start": 1710.3, "Time_End": 1717.3, "Text": " you type in there, give me a list of telecom companies in a certain country, and you will find that there"}, {"Time_Start": 1717.3, "Time_End": 1722.8, "Text": " you will find that there's one list that lists all the telecommunications companies in the world."}, {"Time_Start": 1722.8, "Time_End": 1727.3, "Text": " And there's another list that lists all the airlines in the world."}, {"Time_Start": 1727.3, "Time_End": 1730.3, "Text": " What we need is obviously we need the domain, right, the DNS domain."}, {"Time_Start": 1730.3, "Time_End": 1734.3, "Text": " So it would say this airline, the domain, that kind of thing."}, {"Time_Start": 1734.3, "Time_End": 1736.3, "Text": " Some you need to do online."}, {"Time_Start": 1736.3, "Time_End": 1741.3, "Text": " So you need to query them online because there's not one big page where you can get everything off."}, {"Time_Start": 1741.3, "Time_End": 1745.3, "Text": " So you basically have to go in, click on the thing, click on that thing,"}, {"Time_Start": 1745.3, "Time_End": 1749.3, "Text": " and at the end of the time, at the end of the day, you get the result back."}, {"Time_Start": 1749.3, "Time_End": 1753.3, "Text": " And for that, we need a little pull script that will interrogate the website as we go along."}, {"Time_Start": 1753.3, "Time_End": 1761.3, "Text": " For some of the others, we can have a nice situation where we have one big page"}, {"Time_Start": 1761.3, "Time_End": 1766.3, "Text": " with all the companies listed in the per country, and we basically take that,"}, {"Time_Start": 1766.3, "Time_End": 1769.3, "Text": " and we download it to our site, to build a little database."}, {"Time_Start": 1769.3, "Time_End": 1772.3, "Text": " There's pros and cons to both of them."}, {"Time_Start": 1772.3, "Time_End": 1775.28, "Text": " In terms of a static list, your, your, your, your, your, your,"}, {"Time_Start": 1775.3, "Time_End": 1782.3, "Text": " there are that if a new company starts doing business in the telecommunication sector in,"}, {"Time_Start": 1782.3, "Time_End": 1788.3, "Text": " let's say, Albania, you're not going to know about it, right, because you have a static list."}, {"Time_Start": 1788.3, "Time_End": 1794.3, "Text": " On the other end, the kind of more online lists have problems that if that list is down,"}, {"Time_Start": 1794.3, "Time_End": 1798.3, "Text": " then you can't get the information out there."}, {"Time_Start": 1798.3, "Time_End": 1803.3, "Text": " And it's basically a single point of failure for that particular sector."}, {"Time_Start": 1803.3, "Time_End": 1804.3, "Text": " So the challenge is,"}, {"Time_Start": 1804.3, "Time_End": 1811.3, "Text": " But the challenge is, in some cases you will find, let's say on Business Day or one of these kind of newspapers,"}, {"Time_Start": 1811.3, "Time_End": 1816.3, "Text": " you will find a list of the top 100 companies within a country."}, {"Time_Start": 1816.3, "Time_End": 1817.3, "Text": " Okay?"}, {"Time_Start": 1817.3, "Time_End": 1823.3, "Text": " But they only give the company name and you've got to map that to a domain name."}, {"Time_Start": 1823.3, "Time_End": 1825.3, "Text": " And to do that is quite difficult."}, {"Time_Start": 1825.3, "Time_End": 1829.3, "Text": " So you have company name and you have a country name and you want to have the domain name."}, {"Time_Start": 1829.3, "Time_End": 1833.3, "Text": " Now we basically figured out a way to do that with about, I would say, 75% actually,"}, {"Time_Start": 1833.3, "Time_End": 1835.3, "Text": " 75% accuracy."}, {"Time_Start": 1835.3, "Time_End": 1838.3, "Text": " It's in the paper."}, {"Time_Start": 1838.3, "Time_End": 1840.3, "Text": " I'm sure the paper is on the CD."}, {"Time_Start": 1840.3, "Time_End": 1842.3, "Text": " Did anyone have a look?"}, {"Time_Start": 1842.3, "Time_End": 1843.3, "Text": " Okay."}, {"Time_Start": 1843.3, "Time_End": 1844.3, "Text": " Is it?"}, {"Time_Start": 1844.3, "Time_End": 1845.3, "Text": " Okay, excellent."}, {"Time_Start": 1845.3, "Time_End": 1847.3, "Text": " Okay, the paper for this is on the CD as well."}, {"Time_Start": 1847.3, "Time_End": 1850.3, "Text": " And if you want to find out how we actually got to that,"}, {"Time_Start": 1850.3, "Time_End": 1854.3, "Text": " let's say, 75, 90% accuracy with that,"}, {"Time_Start": 1854.3, "Time_End": 1859.3, "Text": " the algorithm and all of that is right there in the paper."}, {"Time_Start": 1859.3, "Time_End": 1863.3, "Text": " Okay, when we look at the public sector, we're basically looking at"}, {"Time_Start": 1863.3, "Time_End": 1865.3, "Text": " government and military, right?"}, {"Time_Start": 1865.3, "Time_End": 1868.3, "Text": " And here's where it starts to become a little more interesting."}, {"Time_Start": 1868.3, "Time_End": 1875.3, "Text": " We all know that there's, that most of the countries have for government, let's say,"}, {"Time_Start": 1875.3, "Time_End": 1876.3, "Text": " .gov."}, {"Time_Start": 1876.3, "Time_End": 1877.3, "Text": " ."}, {"Time_Start": 1877.3, "Time_End": 1878.3, "Text": " Right?"}, {"Time_Start": 1878.3, "Time_End": 1884.3, "Text": " The problem here is that not all of the countries have actual .GOV,"}, {"Time_Start": 1884.3, "Time_End": 1887.3, "Text": " like France, for instance, have GOUV."}, {"Time_Start": 1887.3, "Time_End": 1892.3, "Text": " That's their sub-TLD for government."}, {"Time_Start": 1892.3, "Time_End": 1894.3, "Text": " for government."}, {"Time_Start": 1894.3, "Time_End": 1895.3, "Text": " Okay?"}, {"Time_Start": 1895.3, "Time_End": 1896.3, "Text": " So we can find that out."}, {"Time_Start": 1896.3, "Time_End": 1902.3, "Text": " It takes a while, but after a while you kind of find all the different government sub-telds that there are."}, {"Time_Start": 1902.3, "Time_End": 1904.3, "Text": " Some countries don't have it."}, {"Time_Start": 1904.3, "Time_End": 1908.3, "Text": " Germany, for instance, I don't think has it.gov.de as such."}, {"Time_Start": 1908.3, "Time_End": 1912.3, "Text": " Maybe you can help me out, all the German hackers that's in here."}, {"Time_Start": 1912.3, "Time_End": 1913.3, "Text": " Okay."}, {"Time_Start": 1913.3, "Time_End": 1919.3, "Text": " So what we can do now, remember we have this Google scraper that will basically go through the internet"}, {"Time_Start": 1919.3, "Time_End": 1922.3, "Text": " and find out email addresses within a specific"}, {"Time_Start": 1922.3, "Time_End": 1925.3, "Text": " department, within a specific domain."}, {"Time_Start": 1925.3, "Time_End": 1929.3, "Text": " So if we basically scrape, if we basically scrape,"}, {"Time_Start": 1929.3, "Time_End": 1933.3, "Text": " if we basically scrape gov.zda, for instance,"}, {"Time_Start": 1933.3, "Time_End": 1936.3, "Text": " okay, we're going to find a whole lot of different sub-departments"}, {"Time_Start": 1936.3, "Time_End": 1939.3, "Text": " sitting within gov.zda itself."}, {"Time_Start": 1939.3, "Time_End": 1941.3, "Text": " And we can then take those sub-departments,"}, {"Time_Start": 1941.3, "Time_End": 1944.3, "Text": " let's say it says energy, there's someone mailing from"}, {"Time_Start": 1944.3, "Time_End": 1948.3, "Text": " something, something, someone, let's make it,"}, {"Time_Start": 1948.3, "Time_End": 1951.3, "Text": " peat at server 1."}, {"Time_Start": 1951.3, "Time_End": 1952.3, "Text": " Energy."}, {"Time_Start": 1952.3, "Time_End": 1955.3, "Text": " What do we know about that email address?"}, {"Time_Start": 1955.3, "Time_End": 1961.3, "Text": " First of all, we know that energy is now department within gov.z."}, {"Time_Start": 1961.3, "Time_End": 1962.3, "Text": " Right?"}, {"Time_Start": 1962.3, "Time_End": 1965.3, "Text": " So now we can scrape for energy.gov.z."}, {"Time_Start": 1965.3, "Time_End": 1968.3, "Text": " Again, and find out all the different subdomains in there."}, {"Time_Start": 1968.3, "Time_End": 1974.3, "Text": " And this we can do recursively until we basically found out all the different blocks, all the"}, {"Time_Start": 1974.3, "Time_End": 1980.3, "Text": " different blobs of domain names within a specific TLD."}, {"Time_Start": 1980.3, "Time_End": 1981.3, "Text": " When we do the demo, you'll see how it works."}, {"Time_Start": 1981.3, "Time_End": 1984.3, "Text": " you'll see how it works. We can do the same for military as well."}, {"Time_Start": 1984.3, "Time_End": 1990.3, "Text": " The problem for military, though, is that a lot of the military domains"}, {"Time_Start": 1990.3, "Time_End": 1993.3, "Text": " are actually contained within government domains."}, {"Time_Start": 1993.3, "Time_End": 1999.3, "Text": " So we can't get, we have to, for instance, you will see a domain called"}, {"Time_Start": 1999.3, "Time_End": 2006.3, "Text": " MOD.com.m.y, which is Ministry of Defense for Malaysia."}, {"Time_Start": 2006.3, "Time_End": 2007.3, "Text": " Okay?"}, {"Time_Start": 2007.3, "Time_End": 2011.28, "Text": " Now, now that would be MOD.gov.gov."}, {"Time_Start": 2011.3, "Time_End": 2024.3, "Text": " MI.D.gov.m.m.m. And that's basically the whole of the defense department in terms of IP space being put into the government, the government sub TLD."}, {"Time_Start": 2024.3, "Time_End": 2030.3, "Text": " So what we've done at the end of this whole thing is we've also done a little bit of our footprinting algorithms."}, {"Time_Start": 2030.3, "Time_End": 2038.3, "Text": " Anyone was at Blackett, Seattle or in Blackett, Amsterdam, would know that we've been doing a whole lot of work on footprinting as well."}, {"Time_Start": 2038.3, "Time_End": 2041.28, "Text": " And basically converting these domains into IP addresses."}, {"Time_Start": 2041.3, "Time_End": 2047.3, "Text": " If you want to go for an external attack, you would want to have those IP addresses in there as well."}, {"Time_Start": 2047.3, "Time_End": 2052.3, "Text": " So as a kind of an afterthought, we also put a little module in there that once you have the domain,"}, {"Time_Start": 2052.3, "Time_End": 2055.3, "Text": " you can do the footprint in terms of the IP address."}, {"Time_Start": 2055.3, "Time_End": 2057.3, "Text": " Okay?"}, {"Time_Start": 2057.3, "Time_End": 2061.3, "Text": " And we know that people love GUIs."}, {"Time_Start": 2061.3, "Time_End": 2064.3, "Text": " So we got a graphical user interface for this thing."}, {"Time_Start": 2064.3, "Time_End": 2070.3, "Text": " We actually didn't want to do it, but then, you know, you know,"}, {"Time_Start": 2070.3, "Time_End": 2074.38, "Text": " But then, you know, at the end of the day, this is the thing that really sells."}, {"Time_Start": 2075.1400000000003, "Time_End": 2076.94, "Text": " So we're not selling this."}, {"Time_Start": 2077.82, "Time_End": 2085.2400000000002, "Text": " So what I want to show you quickly is the graphical user interface for this little thing that we built."}, {"Time_Start": 2086.0600000000004, "Time_End": 2091.78, "Text": " The first thing you can see there, if you scroll down, is that you have an updated kind of a sun map of the world."}, {"Time_Start": 2092.1800000000003, "Time_End": 2099.7400000000002, "Text": " And the reason for that is simply because if you are attacking a certain country, you want it to be daylight over there, right?"}, {"Time_Start": 2100.3, "Time_End": 2103.46, "Text": " Why? Because people tend to read more email during the day."}, {"Time_Start": 2104.1800000000003, "Time_End": 2108.38, "Text": " And now you can see exactly, you know, when the sun is coming up in your country of target,"}, {"Time_Start": 2108.6400000000003, "Time_End": 2112.2200000000003, "Text": " and you can say, okay, you know, now is a good time to start the attack."}, {"Time_Start": 2112.82, "Time_End": 2119.1400000000003, "Text": " And then at the bottom there, you would see there's a couple of continents that we can choose from."}, {"Time_Start": 2119.5800000000004, "Time_End": 2121.6600000000003, "Text": " So let's just go to North America."}, {"Time_Start": 2125.42, "Time_End": 2128.78, "Text": " Okay, and we got our little North American thing in there."}, {"Time_Start": 2128.78, "Time_End": 2133.96, "Text": " I want you to go to, oh, let's go to the United States for now."}, {"Time_Start": 2135.7400000000002, "Time_End": 2140.2000000000003, "Text": " And here you have different types of industries that you now can select."}, {"Time_Start": 2141.5800000000004, "Time_End": 2149.52, "Text": " What I want you to do, Shal, is I want you to go to prominent businesses, select prominent businesses for me,"}, {"Time_Start": 2150.1200000000003, "Time_End": 2153.0600000000004, "Text": " select government, and select military."}, {"Time_Start": 2158.78, "Time_End": 2180.1200000000003, "Text": " Okay, now what it's doing now is it's doing now is it's basically taking the prominent businesses out of the database."}, {"Time_Start": 2181.0400000000004, "Time_End": 2186.44, "Text": " And in terms of the, and what I want to show you there, I'm sure if you can scroll down a little bit,"}, {"Time_Start": 2186.44, "Time_End": 2191.8, "Text": " is that for some of the companies, we don't know exactly what that domain name is going to be, okay?"}, {"Time_Start": 2193.0, "Time_End": 2201.94, "Text": " Let's take, for instance, American International, if you go down a bit."}, {"Time_Start": 2203.94, "Time_End": 2209.16, "Text": " You'll see that there's a couple of domains that it tried to actually resolve that too."}, {"Time_Start": 2209.96, "Time_End": 2213.8, "Text": " Some of the stuff is more easier to find. Some of it is a little bit more difficult to find."}, {"Time_Start": 2214.44, "Time_End": 2215.9, "Text": " Okay, if you go down all the way."}, {"Time_Start": 2216.44, "Time_End": 2219.32, "Text": " So those are all the major businesses in America."}, {"Time_Start": 2220.06, "Time_End": 2225.16, "Text": " And we can select all of them, basically, with one little click, and it will go on."}, {"Time_Start": 2225.2000000000003, "Time_End": 2226.56, "Text": " I'm not going to do that right now."}, {"Time_Start": 2227.1, "Time_End": 2228.46, "Text": " Just go back. Just go back."}, {"Time_Start": 2228.6, "Time_End": 2233.12, "Text": " Okay, and there we see all the different government departments that we've now, that we now extracted."}, {"Time_Start": 2233.12, "Time_End": 2240.4, "Text": " So you see there, CDC.gov, D-E-D-Gov, D-E-D-O-E-D-Gv."}, {"Time_Start": 2240.52, "Time_End": 2244.78, "Text": " I don't even know what all those acronyms are, but we can extract them, right?"}, {"Time_Start": 2244.78, "Time_End": 2251.34, "Text": " We also got the embassies in there just for fun, all the American embassies and domains associated with them."}, {"Time_Start": 2252.34, "Time_End": 2259.02, "Text": " And if we go down to the bottom, you will see there we get to the military,"}, {"Time_Start": 2259.26, "Time_End": 2265.26, "Text": " and those are departments that we found in the military space, so that's a dot-mull space in there."}, {"Time_Start": 2266.34, "Time_End": 2273.0, "Text": " So you see AF, which I guess is Air Force, Defense Link, DZR, DL, whatever, Navy."}, {"Time_Start": 2273.0, "Time_End": 2274.76, "Text": " And you see that Pentagon."}, {"Time_Start": 2274.78, "Time_End": 2275.9, "Text": " dot mill as well."}, {"Time_Start": 2276.2400000000002, "Time_End": 2280.7000000000003, "Text": " So if you can click on Pentagon for me and click on email."}, {"Time_Start": 2281.9, "Time_End": 2286.8, "Text": " Okay, so what it's doing now, it's basically going through Google and extracting email addresses"}, {"Time_Start": 2286.8, "Time_End": 2292.1800000000003, "Text": " that's potential targets for people that's got an address at the pentagon.mol."}, {"Time_Start": 2293.28, "Time_End": 2299.1400000000003, "Text": " We can obviously do it with any of the domains that we want there."}, {"Time_Start": 2300.6600000000003, "Time_End": 2302.36, "Text": " It's taking a while, I see."}, {"Time_Start": 2302.36, "Time_End": 2304.76, "Text": " I was realized that on the back end, there's a whole lot of."}, {"Time_Start": 2304.78, "Time_End": 2309.1000000000004, "Text": " different things happening now. Okay, there we go. So there you see a whole lot of email"}, {"Time_Start": 2309.1000000000004, "Time_End": 2314.86, "Text": " addresses for people at Pentagon. What I want to show you there, which is interesting,"}, {"Time_Start": 2314.86, "Time_End": 2320.46, "Text": " is that you see there's subdomains within the Pentagon as well. So you have OSD, you have"}, {"Time_Start": 2320.46, "Time_End": 2332.7400000000002, "Text": " a F, you have HQDA dot army dot Pentagon, there's JS. Pentagon. Okay, so we can do that recursively."}, {"Time_Start": 2332.7400000000002, "Time_End": 2337.92, "Text": " and now again, zoom in onto that one little subdomain and see if we can extract email addresses from that again."}, {"Time_Start": 2339.36, "Time_End": 2339.6400000000003, "Text": " Okay."}, {"Time_Start": 2341.36, "Time_End": 2347.9, "Text": " So when we select these email addresses and we click on email at the bottom,"}, {"Time_Start": 2348.34, "Time_End": 2352.5600000000004, "Text": " it's now basically going to send a customized message to all of these people saying,"}, {"Time_Start": 2352.94, "Time_End": 2358.1600000000003, "Text": " you know, here's a little link, click on it, and you can install the new Pentagon screensaver."}, {"Time_Start": 2359.0200000000004, "Time_End": 2362.0600000000004, "Text": " And you actually just need one of them to click on it, and it will basically just need one of them to click on it,"}, {"Time_Start": 2362.0600000000004, "Time_End": 2362.7200000000003, "Text": " and it will basically."}, {"Time_Start": 2362.7400000000002, "Time_End": 2368.7400000000002, "Text": " basically then crawl within that space over there and try to do as much damage as possible."}, {"Time_Start": 2368.7400000000002, "Time_End": 2376.7400000000002, "Text": " If you can just click on back, no, you can just go back again, go back again, go"}, {"Time_Start": 2376.7400000000002, "Time_End": 2385.7400000000002, "Text": " back again, go down. If we can get South America up there."}, {"Time_Start": 2385.7400000000002, "Time_End": 2391.7400000000002, "Text": " South America, okay. Here's South America. If you can click on Venezuela."}, {"Time_Start": 2392.7400000000002, "Time_End": 2396.7400000000002, "Text": " Okay, we're going to go for telecom providers in Venezuela."}, {"Time_Start": 2400.7400000000002, "Time_End": 2405.7400000000002, "Text": " Okay, we see there's two main telecom providers there, Digital and something I can't pronounce."}, {"Time_Start": 2405.7400000000002, "Time_End": 2409.7400000000002, "Text": " If you go to Digital and you click on Footprint."}, {"Time_Start": 2409.7400000000002, "Time_End": 2414.7400000000002, "Text": " Okay, what it's going to do now, it's the backend, it's going to implement a couple of algorithms in there"}, {"Time_Start": 2414.7400000000002, "Time_End": 2421.7400000000002, "Text": " that's now going to try to determine what IP addresses are associated with Digitcel in Venezuela."}, {"Time_Start": 2421.7400000000002, "Time_End": 2428.7400000000002, "Text": " cell in Venezuela. Do we have anyone from Venezuela here? No. Okay. Cool."}, {"Time_Start": 2428.7400000000002, "Time_End": 2435.7400000000002, "Text": " What I want you to tell, what I want to tell you that's really important is that the stuff is not live, okay?"}, {"Time_Start": 2435.7400000000002, "Time_End": 2441.7400000000002, "Text": " It doesn't work. Just give it, give it, give it a bit."}, {"Time_Start": 2441.7400000000002, "Time_End": 2451.7200000000003, "Text": " Did it time out? Okay, it time, it actually timed out on the, it timed out on the, on the Mac, which is a, which is a pity because otherwise"}, {"Time_Start": 2451.7400000000002, "Time_End": 2456.7400000000002, "Text": " you would see exactly the DNS names and the different IP addresses associated with,"}, {"Time_Start": 2456.7400000000002, "Time_End": 2461.7400000000002, "Text": " okay, okay, now that, okay, guys, okay, stop attacking us."}, {"Time_Start": 2461.7400000000002, "Time_End": 2464.7400000000002, "Text": " Oh, there we go. Okay, so there we go."}, {"Time_Start": 2464.7400000000002, "Time_End": 2469.7400000000002, "Text": " So there you see, I think that screen is a little bit more clear than this screen."}, {"Time_Start": 2469.7400000000002, "Time_End": 2475.7400000000002, "Text": " There you see all the IP addresses associated with this particular organization"}, {"Time_Start": 2475.7400000000002, "Time_End": 2478.7400000000002, "Text": " and the DNS names."}, {"Time_Start": 2478.7400000000002, "Time_End": 2479.7400000000002, "Text": " So if you click on that IP address is associated with this particular organization and the, and the DNS names."}, {"Time_Start": 2479.7400000000002, "Time_End": 2481.7200000000003, "Text": " So if you click on that IP address,"}, {"Time_Start": 2481.7400000000002, "Time_End": 2482.7400000000002, "Text": " address over there?"}, {"Time_Start": 2482.7400000000002, "Time_End": 2484.7400000000002, "Text": " No, the other one."}, {"Time_Start": 2484.7400000000002, "Time_End": 2485.7400000000002, "Text": " It's okay."}, {"Time_Start": 2485.7400000000002, "Time_End": 2486.7400000000002, "Text": " That 90."}, {"Time_Start": 2486.7400000000002, "Time_End": 2487.7400000000002, "Text": " Yeah."}, {"Time_Start": 2491.7400000000002, "Time_End": 2492.7400000000002, "Text": " Oh, okay."}, {"Time_Start": 2492.7400000000002, "Time_End": 2494.7400000000002, "Text": " That's very interesting."}, {"Time_Start": 2494.7400000000002, "Time_End": 2497.7400000000002, "Text": " Okay, I see GigTools has just moved the thing,"}, {"Time_Start": 2497.7400000000002, "Time_End": 2502.7400000000002, "Text": " their little proxy, who's proxy in the matter of days yesterday,"}, {"Time_Start": 2502.7400000000002, "Time_End": 2504.7400000000002, "Text": " or two days ago it was still up."}, {"Time_Start": 2504.7400000000002, "Time_End": 2506.7400000000002, "Text": " But with these IP addresses, once you have them,"}, {"Time_Start": 2506.7400000000002, "Time_End": 2510.7400000000002, "Text": " you can actually then see exactly what block belongs to them."}, {"Time_Start": 2510.7400000000002, "Time_End": 2514.7400000000002, "Text": " If we can go back to the slide."}, {"Time_Start": 2514.7400000000002, "Time_End": 2522.7400000000002, "Text": " Okay, so in conclusion, I think focused kind of cyber attacks are quite possible."}, {"Time_Start": 2522.7400000000002, "Time_End": 2525.7400000000002, "Text": " I think it can happen."}, {"Time_Start": 2525.7400000000002, "Time_End": 2530.7400000000002, "Text": " I'm very scared to call it terrorism because there's a whole lot of words associated with terrorism"}, {"Time_Start": 2530.7400000000002, "Time_End": 2534.7400000000002, "Text": " that I don't think is really what we're going to achieve over here."}, {"Time_Start": 2534.7400000000002, "Time_End": 2539.7400000000002, "Text": " But at least the one thing we can say is that focus kind of attacks are seriously possible."}, {"Time_Start": 2539.7400000000002, "Time_End": 2546.7400000000002, "Text": " and that once we've implemented something like this, we would highly likely have a negative impact on that network."}, {"Time_Start": 2546.7400000000002, "Time_End": 2548.7400000000002, "Text": " How does it compare to real-life attacks?"}, {"Time_Start": 2548.7400000000002, "Time_End": 2557.7400000000002, "Text": " I don't know if this would instill as much terror as, you know, a kind of conventional attack, which is really horrible."}, {"Time_Start": 2557.7400000000002, "Time_End": 2560.7400000000002, "Text": " And what's the chances of this happening?"}, {"Time_Start": 2560.7400000000002, "Time_End": 2568.7400000000002, "Text": " The one thing I want to really press here is that everything that you've seen here today is not difficult to"}, {"Time_Start": 2568.7400000000002, "Time_End": 2573.7400000000002, "Text": " to put together, right? There's no zero-day in there. There's no kind of"}, {"Time_Start": 2573.7400000000002, "Time_End": 2579.7400000000002, "Text": " super technique in here to get this stuff running. So all of us is really quite easy"}, {"Time_Start": 2579.7400000000002, "Time_End": 2587.7400000000002, "Text": " to put together. And should we worry? Well, I think as networks and as critical systems"}, {"Time_Start": 2587.7400000000002, "Time_End": 2593.7400000000002, "Text": " are becoming more and more connected to the Internet and as control systems are becoming"}, {"Time_Start": 2593.7400000000002, "Time_End": 2598.7200000000003, "Text": " more connected to internal networks, this would be, you know, this becomes"}, {"Time_Start": 2598.7400000000002, "Time_End": 2604.86, "Text": " a much bigger problem for us. Nowadays we tend to say, well, let's air gap the critical"}, {"Time_Start": 2604.86, "Time_End": 2611.1200000000003, "Text": " systems with the internet, which is cool, right? We do that. But we don't air gap our internal"}, {"Time_Start": 2611.1200000000003, "Time_End": 2619.34, "Text": " systems with critical systems. People tend to think about cyberterrorism and cyber attacks"}, {"Time_Start": 2619.34, "Time_End": 2624.42, "Text": " more and more along the lines of we have to breach the perimeter and get through the perimeter,"}, {"Time_Start": 2624.42, "Time_End": 2628.46, "Text": " and then we can do stuff. And because our parameters are safe, it's all right."}, {"Time_Start": 2628.7400000000002, "Time_End": 2632.7400000000002, "Text": " while the internal networks suffer much."}, {"Time_Start": 2632.7400000000002, "Time_End": 2639.7400000000002, "Text": " I think the answer to this kind of problem at the end of the day would be five minutes."}, {"Time_Start": 2639.7400000000002, "Time_End": 2641.7400000000002, "Text": " Okay, I'm almost done here."}, {"Time_Start": 2641.7400000000002, "Time_End": 2648.7400000000002, "Text": " At the end of the day, the answer to this thing would be really to educate your users, right?"}, {"Time_Start": 2648.7400000000002, "Time_End": 2652.7400000000002, "Text": " If you throw more firewalls at this problem, the problem is not going to go away."}, {"Time_Start": 2652.7400000000002, "Time_End": 2655.7400000000002, "Text": " If you throw more technology to this, it's really not going to go to way."}, {"Time_Start": 2655.7400000000002, "Time_End": 2658.7200000000003, "Text": " But if you educate your users, not to click on a little bit."}, {"Time_Start": 2658.7400000000002, "Time_End": 2663.7400000000002, "Text": " little link, you know, then you're really solving the core of the problem."}, {"Time_Start": 2663.7400000000002, "Time_End": 2668.7400000000002, "Text": " I thank you for your time and I hope it was interesting."}, {"Time_Start": 2668.7400000000002, "Time_End": 2672.7400000000002, "Text": " Thanks."}]}