{"segments": [{"Time_Start": 0.0, "Time_End": 20.0, "Text": " Today, my name is Cindy Cohen and I'm the legal director of the Electronic Frontier Foundation."}, {"Time_Start": 20.0, "Time_End": 23.0, "Text": " Thank you."}, {"Time_Start": 23.0, "Time_End": 29.98, "Text": " This talk will be apparently talked to of what is an EFF trifecta"}, {"Time_Start": 30.0, "Time_End": 37.44, "Text": " here today at DEF CON because at 6 o'clock tonight with the kind approval of Agent X and"}, {"Time_Start": 37.44, "Time_End": 41.5, "Text": " the DEF CON folks we're going to hold a special session just to talk about the RIAA versus"}, {"Time_Start": 41.5, "Time_End": 45.36, "Text": " the people all the subpoenas that have been coming out we want to talk you know kind"}, {"Time_Start": 45.36, "Time_End": 49.24, "Text": " of give you guys some straight talk about what's been going on where we think things are going"}, {"Time_Start": 49.24, "Time_End": 54.28, "Text": " in the future what we're thinking that we can do about it at EFF but actually I think most"}, {"Time_Start": 54.28, "Time_End": 57.7, "Text": " importantly so let's start a brainstorm together to decide what we can all do about"}, {"Time_Start": 57.7, "Time_End": 59.980000000000004, "Text": " it together but today"}, {"Time_Start": 60.0, "Time_End": 62.0, "Text": " I'm going to talk about something different."}, {"Time_Start": 62.0, "Time_End": 69.0, "Text": " I want to talk about our dear friend Mr. Ashcroft and his friends up in Washington, D.C.,"}, {"Time_Start": 69.0, "Time_End": 75.6, "Text": " and what they've, what's been going on since September 11th, because one of the things that"}, {"Time_Start": 75.6, "Time_End": 83.4, "Text": " was most disturbing to us in the aftermath of the Two Towers attacks on September 11th is that"}, {"Time_Start": 83.4, "Time_End": 89.74000000000001, "Text": " suddenly we started seeing all sorts of legal changes that were aimed at hackers and, you know,"}, {"Time_Start": 89.74, "Time_End": 93.91999999999999, "Text": " hackers had nothing to do with the blowing up of those two buildings and the killing"}, {"Time_Start": 93.91999999999999, "Time_End": 100.3, "Text": " of those 3,000 people, but yet suddenly it seemed to be an extremely opportune time for some"}, {"Time_Start": 100.3, "Time_End": 106.24, "Text": " folks in the Justice Department to decide to ratchet up the situation facing people who"}, {"Time_Start": 106.24, "Time_End": 108.25999999999999, "Text": " are involved in hacking."}, {"Time_Start": 108.25999999999999, "Time_End": 112.56, "Text": " So I wanted to talk kind of about those kinds of changes and I think what hackers, the title"}, {"Time_Start": 112.56, "Time_End": 118.32, "Text": " of this is what hackers need to know about the law since September 11th. This is a talk"}, {"Time_Start": 118.32000000000001, "Time_End": 122.82000000000001, "Text": " that I give in a, this is a shorter version of a talk that I give in about a four-hour"}, {"Time_Start": 122.82000000000001, "Time_End": 129.4, "Text": " training session for all sorts of activists. And usually it is designed around a set of scenarios,"}, {"Time_Start": 129.4, "Time_End": 135.28, "Text": " which you'll find on the CD that you got, where we talk about, you know, some scenarios,"}, {"Time_Start": 135.28, "Time_End": 139.36, "Text": " you know, the police show up at your door, you know, you decide to do, you and your friends decide"}, {"Time_Start": 139.36, "Time_End": 143.42000000000002, "Text": " to do a denial service attack against somebody who you don't like, or you build a software"}, {"Time_Start": 143.42000000000002, "Time_End": 148.3, "Text": " tool to help build freedom, and talk about the law in those contexts. This is a much"}, {"Time_Start": 148.32, "Time_End": 152.7, "Text": " much shorter time frame. So I'm going to talk just about the legal changes. And then I want to"}, {"Time_Start": 152.7, "Time_End": 156.85999999999999, "Text": " answer your questions. I'm happy to talk a little more about the scenarios that are in the"}, {"Time_Start": 156.85999999999999, "Time_End": 162.06, "Text": " materials that folks want to. But I think with this crowd, getting over the overview and to the"}, {"Time_Start": 162.06, "Time_End": 166.54, "Text": " questions as soon as possible is more important than kind of the baseline. What do you do when"}, {"Time_Start": 166.54, "Time_End": 171.07999999999998, "Text": " the cop show up at your door stuff. So, you know, catch me in some other presentation, and you"}, {"Time_Start": 171.07999999999998, "Time_End": 178.01999999999998, "Text": " can hear the whole thing. It's a lot of fun. The U.S. the Patriot Act is the main thing I want to talk"}, {"Time_Start": 178.02, "Time_End": 185.60000000000002, "Text": " about because it did the major change to computer hacking offenses. The, you know, USA Patriot Act"}, {"Time_Start": 185.60000000000002, "Time_End": 189.86, "Text": " was passed a few weeks after the September 11th attack as the response to try to make us safer"}, {"Time_Start": 189.86, "Time_End": 195.70000000000002, "Text": " from terrorism. As I pointed out, hackers had nothing to do with the terrorist attacks. But"}, {"Time_Start": 195.70000000000002, "Time_End": 202.28, "Text": " nonetheless, we saw a whole raft of provisions in the law that changed in some pretty dramatic ways"}, {"Time_Start": 202.28, "Time_End": 207.22, "Text": " the legal landscape involving hacking offenses. Frankly, when the bill started out,"}, {"Time_Start": 208.02, "Time_End": 213.76000000000002, "Text": " it had even worse things in it. And due to some good work on behalf of my organization"}, {"Time_Start": 213.76000000000002, "Time_End": 217.36, "Text": " and several other organizations, and especially actually Kevin Paulson at Security"}, {"Time_Start": 217.36, "Time_End": 222.62, "Text": " Focus Magazine, we got some of the worst stuff out of the bill, frankly. But it's still"}, {"Time_Start": 222.62, "Time_End": 228.64000000000001, "Text": " pretty bad. The big, the major series of the changes happened to a law called the Computer"}, {"Time_Start": 228.64000000000001, "Time_End": 233.10000000000002, "Text": " Fraud and Abuse Act. And if you're a hacker at all, you should know about this law. It's the"}, {"Time_Start": 233.10000000000002, "Time_End": 238.0, "Text": " basic federal hacking law, and there are similar laws in almost every state in the"}, {"Time_Start": 238.02, "Time_End": 243.72, "Text": " country and they all follow a same pattern. They make it illegal to exceed the authority"}, {"Time_Start": 243.72, "Time_End": 251.88, "Text": " in a protected computer and cause more than $5,000 worth of damage. Again, the damages amount"}, {"Time_Start": 251.88, "Time_End": 256.44, "Text": " changes from state to state. But the keywords there are exceeding the authority in a protected"}, {"Time_Start": 256.44, "Time_End": 262.44, "Text": " computer. And what is exceeding the authority mean? Well, it's a little gray, but we've got"}, {"Time_Start": 262.44, "Time_End": 268.0, "Text": " some clear pictures about what it does mean. If you're tapping into a computer where you don't"}, {"Time_Start": 268.02, "Time_End": 272.56, "Text": " have authority to have access. Let's say you're going into a government computer or,"}, {"Time_Start": 272.56, "Time_End": 277.85999999999996, "Text": " you know, AT&T's computers and you don't have the authority to do that. You are exceeding the authority"}, {"Time_Start": 277.85999999999996, "Time_End": 283.2, "Text": " in a protected computer because you don't have any authority to begin with to be there. Similarly,"}, {"Time_Start": 283.2, "Time_End": 289.85999999999996, "Text": " if you've got an account that lets you do certain things on a computer and you decide instead that you"}, {"Time_Start": 289.85999999999996, "Time_End": 294.82, "Text": " want to become root and do a lot of other more interesting things, you are exceeding your authority"}, {"Time_Start": 294.82, "Time_End": 298.0, "Text": " in a protected computer. So that's the idea."}, {"Time_Start": 298.02, "Time_End": 303.88, "Text": " You know, what do you have permission to do? And if you're outside of those permission things, you're exceeding the authority."}, {"Time_Start": 304.0, "Time_End": 309.18, "Text": " Now, there's a lot of places in the law where this is really vague, and it's been applied in some pretty strange ways, in my opinion."}, {"Time_Start": 310.74, "Time_End": 313.21999999999997, "Text": " But that's the basic idea."}, {"Time_Start": 315.06, "Time_End": 324.56, "Text": " Protected computer, what does that mean? Well, that means any computer used in interstate commerce. That's the federal keywords for how can the feds rule make a law about this."}, {"Time_Start": 324.94, "Time_End": 328.0, "Text": " And what does that mean in practice? That means any computer connected to the internet."}, {"Time_Start": 328.02, "Time_End": 330.97999999999996, "Text": " There's no leeway in this. That's what it means."}, {"Time_Start": 331.21999999999997, "Time_End": 335.38, "Text": " So if you're using the internet, you're coming over the internet to get into somebody's computer"}, {"Time_Start": 335.38, "Time_End": 339.59999999999997, "Text": " and you don't have the authority to be there, you're under CFAA jurisdiction because that's a"}, {"Time_Start": 339.59999999999997, "Time_End": 345.21999999999997, "Text": " protected computer. There's a subset of computers that are called, that I'm trying to remember"}, {"Time_Start": 345.21999999999997, "Time_End": 350.26, "Text": " the name, I think it's called government computers that are any computer that's owned by or used by"}, {"Time_Start": 350.26, "Time_End": 354.65999999999997, "Text": " the government. And that can actually include people who are governmental contractors who are working"}, {"Time_Start": 354.65999999999997, "Time_End": 358.0, "Text": " on things as well. That's another subset of CFAA. And that's another subset of CFAA. And that's"}, {"Time_Start": 358.02, "Time_End": 363.09999999999997, "Text": " The penalties there are more severe. We'll talk about a little bit. But remember that even if it says protected computer,"}, {"Time_Start": 363.2, "Time_End": 366.08, "Text": " that doesn't mean a government computer. That means any computer on the internet."}, {"Time_Start": 366.24, "Time_End": 369.53999999999996, "Text": " There's another category for when you're going after the government's computers."}, {"Time_Start": 369.97999999999996, "Time_End": 373.47999999999996, "Text": " And both got worse under the Patriot Act. So that's the basic law."}, {"Time_Start": 374.28, "Time_End": 383.84, "Text": " And the law said before September 11th, it still does, that you have to cause about $5,000 worth of damage to meet the minimum threshold to be liable under the law."}, {"Time_Start": 383.91999999999996, "Time_End": 387.84, "Text": " It has both criminal and civil liability. So not only can the"}, {"Time_Start": 387.84000000000003, "Time_End": 392.44000000000005, "Text": " government come after you under CFAA. Private parties who you hurt, let's say you go into an"}, {"Time_Start": 392.44000000000005, "Time_End": 400.58000000000004, "Text": " AT&T computer, AT&T can sue you under CFAA as well. It has joint authority. So that's the kind"}, {"Time_Start": 400.58000000000004, "Time_End": 406.66, "Text": " of basic law. Now, what changed in the Patriot Act? Well, a lot of things changed after the Patriot Act."}, {"Time_Start": 406.66, "Time_End": 412.68, "Text": " The first thing is, it used to be if the government was believed that you were hacking into a computer,"}, {"Time_Start": 413.22, "Time_End": 417.82000000000005, "Text": " they couldn't go get a wiretap after you. Wiretaps are traditionally. Wiretaps are traditionally"}, {"Time_Start": 417.84000000000003, "Time_End": 423.24, "Text": " the kind of thing the government can only get for a small, select category of really serious offenses."}, {"Time_Start": 423.84000000000003, "Time_End": 427.74, "Text": " And CFAA offenses did not used to be on the list for wiretap offenses."}, {"Time_Start": 427.94000000000005, "Time_End": 433.56000000000006, "Text": " Well, thank you, Congress. They now are. So they can get a wiretap against you if they think you're doing CFAA things."}, {"Time_Start": 434.94000000000005, "Time_End": 443.76000000000005, "Text": " The law changed such that if you have an attempt to break into a protected computer, you are now punished as if you had succeeded."}, {"Time_Start": 445.06000000000006, "Time_End": 447.82000000000005, "Text": " So if you try and you still cause 5,000."}, {"Time_Start": 447.84000000000003, "Time_End": 449.3, "Text": " damage, that's still there."}, {"Time_Start": 450.06000000000006, "Time_End": 454.32000000000005, "Text": " Even if you don't actually succeed in what you're trying to do, you can be liable."}, {"Time_Start": 454.42, "Time_End": 458.92, "Text": " Now, how can you be liable? How can you get to $5,000 if you didn't actually succeed?"}, {"Time_Start": 459.00000000000006, "Time_End": 459.88000000000005, "Text": " Well, I'll tell you how."}, {"Time_Start": 460.14000000000004, "Time_End": 462.68, "Text": " It's because they've changed how they count the $5,000."}, {"Time_Start": 463.04, "Time_End": 465.26000000000005, "Text": " The $5,000 now is much easier."}, {"Time_Start": 465.92, "Time_End": 471.18, "Text": " It includes absolutely everything they could possibly think of to do to try to stop you."}, {"Time_Start": 471.18, "Time_End": 477.82000000000005, "Text": " So if they bring in one guy to try to figure out what those extra pings are, you know,"}, {"Time_Start": 477.84000000000003, "Time_End": 480.68, "Text": " And, you know, well, one guy might not get you $5,000."}, {"Time_Start": 481.02000000000004, "Time_End": 486.32000000000005, "Text": " Let's say, you know, a guy over a month, and it's their internal cost, not how much they pay the guy,"}, {"Time_Start": 486.82000000000005, "Time_End": 488.56000000000006, "Text": " they can get to $5,000."}, {"Time_Start": 489.1, "Time_End": 492.52000000000004, "Text": " If they take steps to close off their network because of something that you do,"}, {"Time_Start": 492.78000000000003, "Time_End": 494.76000000000005, "Text": " they can get to $5,000 with that."}, {"Time_Start": 495.20000000000005, "Time_End": 497.96000000000004, "Text": " And then they can get there with the easier, more traditional things,"}, {"Time_Start": 497.96000000000004, "Time_End": 501.1, "Text": " like if you actually hurt from data and they've got to reconstruct something"}, {"Time_Start": 501.1, "Time_End": 504.08000000000004, "Text": " or they lose something of value, then they can get to $5,000."}, {"Time_Start": 504.48, "Time_End": 507.52000000000004, "Text": " So $5,000 used to be a pretty low threshold now."}, {"Time_Start": 507.52000000000004, "Time_End": 514.98, "Text": " I think it's fair to say in most situations, it almost doesn't exist because you can get to $5,000 so easily."}, {"Time_Start": 515.1800000000001, "Time_End": 521.64, "Text": " And as we've seen in watching how corporations try to count their damages in technology hacking cases,"}, {"Time_Start": 522.0600000000001, "Time_End": 524.88, "Text": " they grossly overestimate how much everything costs."}, {"Time_Start": 525.1800000000001, "Time_End": 529.48, "Text": " And I think it's fair to say that that's not really much of a barrier anymore after the Patriot Act."}, {"Time_Start": 530.64, "Time_End": 537.5, "Text": " The other thing that changed about the $5,000 threshold is that you don't need to intend to cause $5,000 worth of damage."}, {"Time_Start": 537.52, "Time_End": 544.04, "Text": " There were some earlier decisions that said, well, you know, all he really, all this person really intended to do was go look around."}, {"Time_Start": 544.16, "Time_End": 547.12, "Text": " He was just a kid. He wanted to know how the system worked."}, {"Time_Start": 547.68, "Time_End": 550.5799999999999, "Text": " He was engaging in legitimate inquiry."}, {"Time_Start": 550.96, "Time_End": 554.26, "Text": " He may have caused $5,000 worth of damage, but that wasn't what he meant to do."}, {"Time_Start": 554.78, "Time_End": 559.62, "Text": " Well, the Justice Department took care of that one in the Patriot Act doesn't matter what your intent is."}, {"Time_Start": 559.62, "Time_End": 563.78, "Text": " If you get in and he caused it and they can qualify the damage, that's all it matters."}, {"Time_Start": 563.78, "Time_End": 567.5, "Text": " So they really took care of the, you know, sorry I didn't mean to."}, {"Time_Start": 567.52, "Time_End": 570.8, "Text": " you know the Robert Morris I didn't know the worm was going to take down the"}, {"Time_Start": 570.8, "Time_End": 578.1999999999999, "Text": " internet defense is no longer available per CFAA so that's change and then the other"}, {"Time_Start": 578.1999999999999, "Time_End": 582.34, "Text": " thing is that they've allowed them to aggregate damages so if you've gone it's"}, {"Time_Start": 582.34, "Time_End": 587.5, "Text": " not $5,000 to one computer anymore it's $5,000 to all the computers owned by a"}, {"Time_Start": 587.5, "Time_End": 591.68, "Text": " single system which as some folks may know you know in order to get to a system"}, {"Time_Start": 591.68, "Time_End": 593.98, "Text": " that you might be interested in looking at you may go through a couple"}, {"Time_Start": 593.98, "Time_End": 597.5, "Text": " computers on the way they can count all those to"}, {"Time_Start": 597.52, "Time_End": 603.22, "Text": " to get to their $5,000. So that's why I say, you know, I haven't seen a case since Patriot Act passed"}, {"Time_Start": 603.22, "Time_End": 610.68, "Text": " where 5,000 wasn't just passed in the wind. That was easy. So CFAA changed a lot. And I think"}, {"Time_Start": 610.68, "Time_End": 615.86, "Text": " it's really important for people who are doing that kind of exploration to think about, you know,"}, {"Time_Start": 615.86, "Time_End": 621.48, "Text": " that if you thought you were below the, below the threshold of the law now, chances are you might not be."}, {"Time_Start": 621.48, "Time_End": 627.36, "Text": " And it's important to at least figure that out before you go in. I mean, my basic position"}, {"Time_Start": 627.52, "Time_End": 631.9, "Text": " on this is that, you know, it's not my job to tell you whether to engage in civil disobedience"}, {"Time_Start": 631.9, "Time_End": 635.9399999999999, "Text": " or not. You're all adults. That's your decision. I think my job is to make sure you don't"}, {"Time_Start": 635.9399999999999, "Time_End": 641.56, "Text": " stumble into it. That you know the difference and that nobody gets caught and says, well, I didn't"}, {"Time_Start": 641.56, "Time_End": 648.56, "Text": " know that was actually illegal. That's kind of how I view my role in trying to give advice to"}, {"Time_Start": 648.56, "Time_End": 653.4, "Text": " folks on these issues. The other thing that we've seen is that computer crime is now a terrorist"}, {"Time_Start": 653.4, "Time_End": 657.06, "Text": " defense under USA Patriot Act, under certain situations."}, {"Time_Start": 657.52, "Time_End": 663.12, "Text": " If you, again, it didn't, terrorism offenses are a very small category of the law."}, {"Time_Start": 663.22, "Time_End": 665.76, "Text": " It used to involve things like blowing up buildings and things like that."}, {"Time_Start": 666.1, "Time_End": 671.34, "Text": " Now, suddenly, under Patriot Act, again, no connection to the September 11th bombings or, frankly,"}, {"Time_Start": 671.46, "Time_End": 674.18, "Text": " any other terrorist attack that we've been able to track in the history."}, {"Time_Start": 675.12, "Time_End": 679.76, "Text": " Suddenly, computer crime is on the short list of crimes that qualify as terrorist offenses."}, {"Time_Start": 680.6999999999999, "Time_End": 685.14, "Text": " Now, that's not any computer crime, and it's important to know the limits."}, {"Time_Start": 686.14, "Time_End": 687.5, "Text": " It's, it is, first,"}, {"Time_Start": 687.52, "Time_End": 690.64, "Text": " of all, an act that is calculated to influence the government. That's actually"}, {"Time_Start": 690.64, "Time_End": 696.46, "Text": " or the government by intimidation or coercion or to retaliate against"}, {"Time_Start": 696.46, "Time_End": 701.92, "Text": " governmental conduct. So if it's protest type activity or if it's retaliative"}, {"Time_Start": 701.92, "Time_End": 707.38, "Text": " activity, then you meet the first prong for getting into the terrorist provision. The"}, {"Time_Start": 707.38, "Time_End": 712.6, "Text": " second prong is that you either must be getting going after classified information or"}, {"Time_Start": 712.6, "Time_End": 717.5, "Text": " other kind of protected national security sort of information or, and this"}, {"Time_Start": 717.52, "Time_End": 723.1999999999999, "Text": " is the one that gets tricky, you have to cause damage that causes either a governmental"}, {"Time_Start": 723.1999999999999, "Time_End": 728.8, "Text": " computer system to go down or a medical problem or physical injury."}, {"Time_Start": 728.8, "Time_End": 732.96, "Text": " So it's not as bad as it would be if it was just flat any computer offense, but you could"}, {"Time_Start": 732.96, "Time_End": 737.76, "Text": " see that happening. If you were someone who was assisting, giving computer assistance to people"}, {"Time_Start": 737.76, "Time_End": 743.28, "Text": " who were involved in protest activities and somebody got hurt at the protest as a direct result"}, {"Time_Start": 743.28, "Time_End": 747.5, "Text": " of something you did, you could end up in a terrorist defense category. Why does that matter?"}, {"Time_Start": 747.52, "Time_End": 752.04, "Text": " Well, because terrorist defense category is kind of the mother load for punishments, right?"}, {"Time_Start": 752.4, "Time_End": 756.3199999999999, "Text": " It's what we've done with the drug war in terms of ramping up what happens."}, {"Time_Start": 756.74, "Time_End": 759.02, "Text": " What does that mean? That means they can seize your assets."}, {"Time_Start": 759.52, "Time_End": 762.9, "Text": " They can seize your assets first and ask questions later."}, {"Time_Start": 764.3, "Time_End": 771.22, "Text": " They can get pre-conviction forfeiture. That's what lawyers call seizing your assets."}, {"Time_Start": 771.6999999999999, "Time_End": 775.6999999999999, "Text": " Post-convictions. And it's an eight-year statute of limitations, which is much longer."}, {"Time_Start": 775.7, "Time_End": 782.26, "Text": " There are alternative maximum penalties which can go up to life imprisonment or the death penalty in certain situations."}, {"Time_Start": 783.94, "Time_End": 791.0200000000001, "Text": " And it allows asset seizure, not only of you, but of anybody who is planning, perpetrating,"}, {"Time_Start": 792.38, "Time_End": 796.22, "Text": " or a source of influence over someone engaging in a terrorist activity."}, {"Time_Start": 796.22, "Time_End": 803.84, "Text": " And as we've seen in the use of the terrorism laws in the non-computer context, that can include people pretty far away from the actual attack."}, {"Time_Start": 803.9200000000001, "Time_End": 805.6800000000001, "Text": " It can include people who maybe give"}, {"Time_Start": 805.7, "Time_End": 809.6400000000001, "Text": " funds, donates funds, or let you sleep on their couch while you're doing stuff."}, {"Time_Start": 809.8000000000001, "Time_End": 815.1400000000001, "Text": " So it's a pretty scary thing to suddenly have computer offenses, which I think we're already"}, {"Time_Start": 815.1400000000001, "Time_End": 820.82, "Text": " over-criminalized by the law, suddenly had the specter of potential treating as terrorist offenses"}, {"Time_Start": 820.82, "Time_End": 821.32, "Text": " now."}, {"Time_Start": 821.9200000000001, "Time_End": 827.22, "Text": " And again, it puzzles me completely because, again, the hackers didn't have anything to do with"}, {"Time_Start": 827.22, "Time_End": 829.0400000000001, "Text": " any terrorist attacks and haven't, ever."}, {"Time_Start": 830.38, "Time_End": 834.84, "Text": " The next category is material assistance to terrorists."}, {"Time_Start": 835.7, "Time_End": 844.0600000000001, "Text": " This is a category that existed before the Patriot Act but got beefed up a lot by the Patriot Act and furthered its reach."}, {"Time_Start": 844.98, "Time_End": 848.2800000000001, "Text": " It used to, it includes training of anyone."}, {"Time_Start": 848.5600000000001, "Time_End": 852.5400000000001, "Text": " So if you train somebody and then they go out and are involved in a terrorist act,"}, {"Time_Start": 852.5400000000001, "Time_End": 856.2, "Text": " you can be held liable as a material assistance to terrorism."}, {"Time_Start": 856.34, "Time_End": 860.32, "Text": " And by the way, if you're charged with this material assistance to terrorism,"}, {"Time_Start": 860.5200000000001, "Time_End": 864.84, "Text": " the offense carries the same penalties as terrorism itself."}, {"Time_Start": 864.84, "Time_End": 869.62, "Text": " So you're not, you know, you're not actually any better for that."}, {"Time_Start": 871.14, "Time_End": 877.34, "Text": " And someone who is a facilitator is what material supports terrorism calls a facilitator."}, {"Time_Start": 877.6600000000001, "Time_End": 880.62, "Text": " You can be culpable whether or not the underlying offense was committed."}, {"Time_Start": 881.14, "Time_End": 885.0, "Text": " And you don't have to have any intent for the specific underlying defense."}, {"Time_Start": 885.5, "Time_End": 890.3000000000001, "Text": " You only have to know that it's going to be used for a specific offense."}, {"Time_Start": 890.3000000000001, "Time_End": 894.82, "Text": " So you don't have to say, well, I wanted to blow up the thing, but if you know, but if you"}, {"Time_Start": 894.84, "Time_End": 898.62, "Text": " know that the person who your training is going to use it to do some kind of a legal activity,"}, {"Time_Start": 899.14, "Time_End": 903.46, "Text": " even if that wasn't your intent, you're still in the loop of this law."}, {"Time_Start": 904.5600000000001, "Time_End": 906.1600000000001, "Text": " And this all makes us very nervous."}, {"Time_Start": 906.4, "Time_End": 911.36, "Text": " It gives prosecutors, even if that isn't exactly what you did, it gives prosecutors so much more leeway"}, {"Time_Start": 911.36, "Time_End": 912.96, "Text": " to start charging people broadly."}, {"Time_Start": 914.26, "Time_End": 917.9, "Text": " And, you know, that's as big a problem as the people who they actually can convict."}, {"Time_Start": 918.02, "Time_End": 923.0600000000001, "Text": " And we've seen, again, since the Patriot Act has passed in the name of terrorism and protecting"}, {"Time_Start": 923.0600000000001, "Time_End": 924.82, "Text": " us from terrorists, the prosecutors are really."}, {"Time_Start": 924.84, "Time_End": 929.98, "Text": " willing to go far beyond what they would normally do in a rational situation about who"}, {"Time_Start": 929.98, "Time_End": 931.96, "Text": " they're going to charge and what they're going to charge them with."}, {"Time_Start": 932.2800000000001, "Time_End": 937.52, "Text": " There's a hysteria going on now, and I really worry that some hackers are going to get caught"}, {"Time_Start": 937.52, "Time_End": 938.12, "Text": " in the crossfire."}, {"Time_Start": 938.24, "Time_End": 943.32, "Text": " I should point out that, you know, while I'm scaring the hell out of all of you, that so far this"}, {"Time_Start": 943.32, "Time_End": 943.88, "Text": " hadn't happened."}, {"Time_Start": 944.34, "Time_End": 947.26, "Text": " I'm not aware of any hackers who've been charged under this law yet."}, {"Time_Start": 947.7, "Time_End": 949.52, "Text": " But it's disturbing that the law exists."}, {"Time_Start": 949.84, "Time_End": 954.8000000000001, "Text": " And frankly, it's not the case that we would necessarily know most of these kinds of"}, {"Time_Start": 954.84, "Time_End": 957.9200000000001, "Text": " investigations happen under all sorts of gag orders and protective orders."}, {"Time_Start": 958.0400000000001, "Time_End": 959.4200000000001, "Text": " And so it's very difficult to know."}, {"Time_Start": 961.1600000000001, "Time_End": 963.5600000000001, "Text": " But apparently that wasn't enough for the government."}, {"Time_Start": 963.6800000000001, "Time_End": 966.0400000000001, "Text": " They've got a new one that they're thinking about now."}, {"Time_Start": 966.0400000000001, "Time_End": 967.38, "Text": " It's called Patriot 2."}, {"Time_Start": 968.08, "Time_End": 972.82, "Text": " It's D-S-E-A, Defense Security, I don't remember the acronym, actually."}, {"Time_Start": 974.2800000000001, "Time_End": 977.1600000000001, "Text": " It has been floated and it has not been put forward."}, {"Time_Start": 977.26, "Time_End": 980.48, "Text": " And there was enough noise when it was floated that I'm not sure they're going to go forward"}, {"Time_Start": 980.48, "Time_End": 980.9200000000001, "Text": " with it."}, {"Time_Start": 981.22, "Time_End": 982.82, "Text": " So I don't want to scare you too much with it."}, {"Time_Start": 982.9200000000001, "Time_End": 984.26, "Text": " But it is on the horizon."}, {"Time_Start": 984.26, "Time_End": 988.86, "Text": " And certainly it gives a glimpse into what the Justice Department would like to do next."}, {"Time_Start": 989.42, "Time_End": 992.8, "Text": " And I think it's quite disturbing that they're already going back to Congress"}, {"Time_Start": 992.8, "Time_End": 995.48, "Text": " and starting to make noise about how the Patriot Act wasn't enough."}, {"Time_Start": 997.4399999999999, "Time_End": 999.9399999999999, "Text": " The first thing that it does, I call this in my thing,"}, {"Time_Start": 1000.02, "Time_End": 1003.36, "Text": " everyone rats on you whether they want to or not and they can't tell you about it."}, {"Time_Start": 1003.92, "Time_End": 1006.04, "Text": " These are things called administrative subpoenas."}, {"Time_Start": 1006.7, "Time_End": 1010.8, "Text": " This is something, again, that existed prior in the law that was very rarely used"}, {"Time_Start": 1010.8, "Time_End": 1013.3, "Text": " and gets beefed up a lot by Patriot, too."}, {"Time_Start": 1014.26, "Time_End": 1015.58, "Text": " They can be issued by the government."}, {"Time_Start": 1015.7, "Time_End": 1017.02, "Text": " They don't need any court approval."}, {"Time_Start": 1017.36, "Time_End": 1023.02, "Text": " They aren't even reviewed by the courts unless the person who receives the subpoena objects."}, {"Time_Start": 1024.22, "Time_End": 1027.62, "Text": " And so they just issue these administrative subpoenas to anybody,"}, {"Time_Start": 1027.8, "Time_End": 1030.8, "Text": " and that person has to turn over all the information about you that they have."}, {"Time_Start": 1031.2, "Time_End": 1033.3, "Text": " And they almost always come equipped with a gag order,"}, {"Time_Start": 1033.3, "Time_End": 1037.14, "Text": " so the person or entity who has to turn over all that information can't tell you."}, {"Time_Start": 1037.96, "Time_End": 1040.4, "Text": " I think these things are one of the scariest things around."}, {"Time_Start": 1041.06, "Time_End": 1043.64, "Text": " The next thing is called a national security letter."}, {"Time_Start": 1043.64, "Time_End": 1046.18, "Text": " It's another way to skin a cat for the government."}, {"Time_Start": 1046.3400000000001, "Time_End": 1050.44, "Text": " It's a way they can essentially do the same thing under national security grounds,"}, {"Time_Start": 1050.5200000000002, "Time_End": 1058.76, "Text": " which has required anybody without prior court approval to hand over any information about you that they have."}, {"Time_Start": 1059.3200000000002, "Time_End": 1062.3200000000002, "Text": " And the important thing to remember of all of this is, you know, in the digital age,"}, {"Time_Start": 1062.5200000000002, "Time_End": 1066.68, "Text": " people in this crowd know this, but when I talk to the non-techies, I always have to point this out."}, {"Time_Start": 1066.94, "Time_End": 1069.94, "Text": " You're leaving bits of data behind with every step online."}, {"Time_Start": 1070.5800000000002, "Time_End": 1073.46, "Text": " And so there are lots of people who know lots of things about you."}, {"Time_Start": 1073.64, "Time_End": 1080.3600000000001, "Text": " unless you're real, you know, crypto and anonymity junkie and you use those tools and you use them well,"}, {"Time_Start": 1080.66, "Time_End": 1082.94, "Text": " there are a lot of people there who do a lot about you."}, {"Time_Start": 1083.0600000000002, "Time_End": 1088.16, "Text": " And the idea that they can be required without any court review to just hand over that information"}, {"Time_Start": 1088.16, "Time_End": 1089.92, "Text": " to law enforcement, I find rather chilling."}, {"Time_Start": 1090.42, "Time_End": 1091.16, "Text": " You had a question?"}, {"Time_Start": 1099.3200000000002, "Time_End": 1103.4, "Text": " It's actually, in practice, it comes out of what entity issues it?"}, {"Time_Start": 1103.64, "Time_End": 1111.5400000000002, "Text": " national security letter comes out of the kind of the part of the FBI that does the nationals."}, {"Time_Start": 1111.5800000000002, "Time_End": 1112.74, "Text": " The FBI kind of has two pieces."}, {"Time_Start": 1112.94, "Time_End": 1118.0600000000002, "Text": " There's the domestic and then there's the international security cops, basically."}, {"Time_Start": 1118.5, "Time_End": 1119.5400000000002, "Text": " They don't look any different."}, {"Time_Start": 1119.64, "Time_End": 1122.48, "Text": " They don't have to wear any different insignia or anything, but they work in different divisions."}, {"Time_Start": 1122.94, "Time_End": 1127.18, "Text": " And generally, you'll see the administrative subpoenas coming out of the civil domestic side"}, {"Time_Start": 1127.18, "Time_End": 1131.6000000000001, "Text": " and the national security letters coming out of the other side."}, {"Time_Start": 1131.6000000000001, "Time_End": 1133.6200000000001, "Text": " So it really, for me, as a lawyer,"}, {"Time_Start": 1133.64, "Time_End": 1137.22, "Text": " It tells me more about who issued it than it does about the justification."}, {"Time_Start": 1137.8400000000001, "Time_End": 1144.94, "Text": " Now, in theory, before Patriot, the argument was that the national security people's jurisdiction"}, {"Time_Start": 1144.94, "Time_End": 1150.98, "Text": " is just national security sorts of issues and foreign governments and spy versus spy sorts of things."}, {"Time_Start": 1151.3600000000001, "Time_End": 1156.6000000000001, "Text": " And so they would only issue those, you know, when they're doing their work and their work is national"}, {"Time_Start": 1156.6000000000001, "Time_End": 1157.18, "Text": " security work."}, {"Time_Start": 1157.24, "Time_End": 1161.0200000000002, "Text": " So you could feel kind of safe that a national security letter was only going to be issued for a national"}, {"Time_Start": 1161.0200000000002, "Time_End": 1161.8200000000002, "Text": " security purpose."}, {"Time_Start": 1162.3400000000001, "Time_End": 1163.6200000000001, "Text": " This is another thing that the Patriotty."}, {"Time_Start": 1163.64, "Time_End": 1169.1000000000001, "Text": " Act did. It tore down all of those laws. Sorry about them. I'm using it for the,"}, {"Time_Start": 1169.1000000000001, "Time_End": 1174.7, "Text": " I'm using it for time. It tore down all of those rules that said that, well, the national"}, {"Time_Start": 1174.7, "Time_End": 1178.0200000000002, "Text": " security people can only be working on national security stuff and that domestic people"}, {"Time_Start": 1178.0200000000002, "Time_End": 1181.92, "Text": " can only be working on domestic stuff and they can't talk to each other unless there's a really"}, {"Time_Start": 1181.92, "Time_End": 1187.4, "Text": " high showing. They could always talk to each other a little. You know, these kind of walls came"}, {"Time_Start": 1187.4, "Time_End": 1193.6200000000001, "Text": " up in the 70s when it was revealed that the FBI kept dossiers on."}, {"Time_Start": 1193.64, "Time_End": 1198.7, "Text": " millions of Americans, just in case some of them might be criminals. And so there"}, {"Time_Start": 1198.7, "Time_End": 1205.5200000000002, "Text": " was a commission called the Church Commission, Senator Church put into place, and they put up all"}, {"Time_Start": 1205.5200000000002, "Time_End": 1210.24, "Text": " these walls between the national security and domestic security, because the reason the FBI"}, {"Time_Start": 1210.24, "Time_End": 1215.3200000000002, "Text": " said this was because they were going after communists. So they put up all these walls, and Patriot"}, {"Time_Start": 1215.3200000000002, "Time_End": 1221.5400000000002, "Text": " Act tore them largely down. So now you can't really be as sure that a national security letter"}, {"Time_Start": 1221.54, "Time_End": 1226.3999999999999, "Text": " is actually coming out of a national security purpose, as you could before September 11th,"}, {"Time_Start": 1226.3999999999999, "Time_End": 1230.3999999999999, "Text": " because the folks on the domestic side can say, you know what, we don't actually have enough"}, {"Time_Start": 1230.3999999999999, "Time_End": 1234.6599999999999, "Text": " authority under our laws to issue a subpoena in this process. And they do have limits and"}, {"Time_Start": 1234.6599999999999, "Time_End": 1239.62, "Text": " internal limits that they follow. So could you guys over there on the right hand side, just issue"}, {"Time_Start": 1239.62, "Time_End": 1244.8999999999999, "Text": " a subpoena for us and get the information? This is one of the issues that EFF and the ACLU and"}, {"Time_Start": 1244.8999999999999, "Time_End": 1250.48, "Text": " Epic and everyone has with the Patriot Act. It's kind of hard for ordinary people to get. But"}, {"Time_Start": 1250.48, "Time_End": 1255.34, "Text": " basically it gives the government a lot of different end runs around what used to be the limits"}, {"Time_Start": 1255.34, "Time_End": 1257.14, "Text": " on their jurisdiction and this is one of them."}, {"Time_Start": 1257.14, "Time_End": 1264.88, "Text": " What part of critical infrastructure?"}, {"Time_Start": 1264.88, "Time_End": 1273.38, "Text": " Well, basically government systems are defined as any system that aid the"}, {"Time_Start": 1273.38, "Time_End": 1277.48, "Text": " in any of its efforts. I could pull out the exact statute, but that's roughly it."}, {"Time_Start": 1277.48, "Time_End": 1280.46, "Text": " Telcos that are involved in that kind of"}, {"Time_Start": 1280.48, "Time_End": 1284.04, "Text": " work. It wouldn't be just general telco because the government uses the phone."}, {"Time_Start": 1284.44, "Time_End": 1290.48, "Text": " But it would be a defense contractor who's developing something for use. It would be somebody"}, {"Time_Start": 1290.48, "Time_End": 1294.8, "Text": " in Silicon Valley who's, you know, developing the next tool of surveillance for the NSA."}, {"Time_Start": 1299.04, "Time_End": 1303.2, "Text": " I don't think it'll go that far. It really does have to be for a specific governmental purpose."}, {"Time_Start": 1303.26, "Time_End": 1306.26, "Text": " Because otherwise, there'd be no limit to what a government computer is because the government"}, {"Time_Start": 1306.26, "Time_End": 1310.08, "Text": " buys services like the rest of us. There is actually a rational distinction in how it's, how it's"}, {"Time_Start": 1310.48, "Time_End": 1311.48, "Text": " it's defined."}, {"Time_Start": 1311.48, "Time_End": 1315.98, "Text": " And it's really people, I think it's fair to say that you can say it as people who are working"}, {"Time_Start": 1315.98, "Time_End": 1321.48, "Text": " under government contracts for things involving national security type stuff are protected."}, {"Time_Start": 1321.48, "Time_End": 1326.48, "Text": " But not just anybody who sell stuff to the government because that, you know, that would be everybody,"}, {"Time_Start": 1326.48, "Time_End": 1329.48, "Text": " you know, that would be every big entity, right?"}, {"Time_Start": 1329.48, "Time_End": 1331.48, "Text": " Every big entity would be covered."}, {"Time_Start": 1331.48, "Time_End": 1339.48, "Text": " Just earlier today I watched you talk about how you can use certain tools to steal authentication information."}, {"Time_Start": 1339.48, "Time_End": 1343.48, "Text": " information from unsuspected users with wireless networks."}, {"Time_Start": 1343.48, "Time_End": 1350.48, "Text": " Would that count as material assistance to potential terrorist members?"}, {"Time_Start": 1350.48, "Time_End": 1356.48, "Text": " So the question is, if somebody were to use, if somebody were to use,"}, {"Time_Start": 1356.48, "Time_End": 1360.48, "Text": " tell me if I'm right about this, but they've asked me to repeat the questions."}, {"Time_Start": 1360.48, "Time_End": 1368.48, "Text": " If somebody were to use a technique to sniff out passwords from a wireless system, that they learned here today,"}, {"Time_Start": 1368.48, "Time_End": 1369.48, "Text": " could the person who talked to."}, {"Time_Start": 1369.48, "Time_End": 1373.78, "Text": " them that, be liable if they then use that as part of a terrorist activity."}, {"Time_Start": 1373.78, "Time_End": 1375.48, "Text": " That's the fear."}, {"Time_Start": 1375.48, "Time_End": 1380.48, "Text": " I think, you know, I don't, I can't tell you it's completely likely."}, {"Time_Start": 1380.48, "Time_End": 1383.48, "Text": " But I think the person who does the teaching has to know that the persons who's learning"}, {"Time_Start": 1383.48, "Time_End": 1386.48, "Text": " is going to use it for that kind of offense."}, {"Time_Start": 1386.48, "Time_End": 1388.48, "Text": " I don't think it would reach just general teaching."}, {"Time_Start": 1388.48, "Time_End": 1392.48, "Text": " I think that would be really, that would be too far."}, {"Time_Start": 1392.48, "Time_End": 1396.48, "Text": " However, in a place like DefCon, you might have a hard time arguing that you didn't know"}, {"Time_Start": 1396.48, "Time_End": 1398.48, "Text": " that some of the people in your audience were going to use."}, {"Time_Start": 1398.48, "Time_End": 1402.48, "Text": " going to use the tools that you're teaching them for a nefarious purpose."}, {"Time_Start": 1402.48, "Time_End": 1405.98, "Text": " You know, thank God we haven't had to go through the kind of thing with DefCon that we did say"}, {"Time_Start": 1405.98, "Time_End": 1412.48, "Text": " with Slashdot in the DCSS case where, you know, the entertainment companies put the argument"}, {"Time_Start": 1412.48, "Time_End": 1417.48, "Text": " forward that, well, because something happened on Slashdot, you know, you knew a lot of things"}, {"Time_Start": 1417.48, "Time_End": 1421.48, "Text": " that I don't think made sense to anybody who was a reader Slashdot."}, {"Time_Start": 1421.48, "Time_End": 1428.46, "Text": " But we haven't done that with the DefCon sorts of conferences yet and, you know, hopefully, knock on wood every"}, {"Time_Start": 1428.48, "Time_End": 1435.48, "Text": " that will never happen. But I still think it's pretty remote. I think that you really have to have some level of knowledge."}, {"Time_Start": 1435.48, "Time_End": 1438.48, "Text": " You don't have to be a co-conspirator like you're working with them."}, {"Time_Start": 1438.48, "Time_End": 1444.48, "Text": " But you have to know that the person you're teaching has that kind of intent, I think, before the law is going to really reach you."}, {"Time_Start": 1444.48, "Time_End": 1446.48, "Text": " Yes."}, {"Time_Start": 1446.48, "Time_End": 1448.48, "Text": " What are the leaders in the draft?"}, {"Time_Start": 1448.48, "Time_End": 1451.48, "Text": " It's a lot of people that will affect on."}, {"Time_Start": 1451.48, "Time_End": 1455.48, "Text": " It's obviously a citizen, but we're not going to be there on."}, {"Time_Start": 1455.48, "Time_End": 1457.48, "Text": " I think we're a resident for."}, {"Time_Start": 1457.48, "Time_End": 1458.48, "Text": " They're originated from other countries."}, {"Time_Start": 1458.48, "Time_End": 1477.98, "Text": " outside of the U.S., which is now how these changes affect people who both"}, {"Time_Start": 1477.98, "Time_End": 1481.82, "Text": " who both aren't citizens or who launch whatever they're doing not from the U.S. The second one of the U.S."}, {"Time_Start": 1481.82, "Time_End": 1485.64, "Text": " The second one's an easier one, and it's one of the things I hate about the Patriot Act."}, {"Time_Start": 1485.64, "Time_End": 1488.46, "Text": " It extended the government's jurisdiction."}, {"Time_Start": 1488.48, "Time_End": 1491.3, "Text": " for these kinds of offenses to people outside the U.S."}, {"Time_Start": 1492.06, "Time_End": 1499.64, "Text": " So, you know how they swooped down and they got, you know, they've recently started really working."}, {"Time_Start": 1499.94, "Time_End": 1503.44, "Text": " Now, let me see if I could say this in a nicer way than I was just about to say it."}, {"Time_Start": 1504.08, "Time_End": 1510.28, "Text": " The government has been more aggressive in reaching out to non-citizens who are living in foreign countries"}, {"Time_Start": 1510.28, "Time_End": 1515.82, "Text": " and dragging them here to stand under U.S. laws for things."}, {"Time_Start": 1515.82, "Time_End": 1517.96, "Text": " And the jurisdictional basis for that,"}, {"Time_Start": 1518.48, "Time_End": 1521.46, "Text": " hasn't been fully litigated because frankly they didn't do it very often before,"}, {"Time_Start": 1521.56, "Time_End": 1523.94, "Text": " except for like Noriega and some high-profile cases."}, {"Time_Start": 1525.28, "Time_End": 1531.72, "Text": " So we'll see that litigated out, but they certainly have now got congressional authority to do that"}, {"Time_Start": 1531.72, "Time_End": 1535.42, "Text": " for hacking offenses, which is reach out, grab the guy in Russia who launched the attack,"}, {"Time_Start": 1535.52, "Time_End": 1539.3600000000001, "Text": " bring them here, and hold them responsible under U.S. laws on the grounds that the effect was here."}, {"Time_Start": 1539.94, "Time_End": 1544.1, "Text": " So that, unfortunately, is one of the things that I hate about the Patriot Act, and actually I think"}, {"Time_Start": 1544.1, "Time_End": 1546.24, "Text": " it's really bad law. I think jurisdiction ought to matter."}, {"Time_Start": 1546.24, "Time_End": 1552.22, "Text": " But the second question is, how would it affect people who aren't citizens?"}, {"Time_Start": 1552.42, "Time_End": 1553.96, "Text": " And the answer is it would affect you the same."}, {"Time_Start": 1554.0, "Time_End": 1555.52, "Text": " In some ways, I think it would affect you worse."}, {"Time_Start": 1556.24, "Time_End": 1560.7, "Text": " Because the other part of Patriot that we're not talking about now is all the changes to the immigration laws"}, {"Time_Start": 1560.7, "Time_End": 1563.94, "Text": " and the way that the immigration situation has changed now."}, {"Time_Start": 1564.14, "Time_End": 1571.96, "Text": " They could deport you for anything even remotely related to a Patriot Act defense or a computer crime thing."}, {"Time_Start": 1572.42, "Time_End": 1576.22, "Text": " So not only are you still subject to these laws, as long as you know,"}, {"Time_Start": 1576.24, "Time_End": 1581.78, "Text": " This is the basic Cindy theory of jurisdiction that I've taught to several hackers so far."}, {"Time_Start": 1581.86, "Time_End": 1583.76, "Text": " So let me just share it all with y'all right now."}, {"Time_Start": 1585.5, "Time_End": 1587.1200000000001, "Text": " Where do your feet touch the ground?"}, {"Time_Start": 1588.0, "Time_End": 1591.68, "Text": " If your feet touch the ground, they can get you there, always."}, {"Time_Start": 1592.8, "Time_End": 1596.7, "Text": " So unless you live in cyberspace and your feet never touch the ground,"}, {"Time_Start": 1597.02, "Time_End": 1599.08, "Text": " you're never outside of jurisdiction."}, {"Time_Start": 1599.64, "Time_End": 1605.1200000000001, "Text": " You're always under some jurisdiction, at least one, where your feet are touching the ground at that moment."}, {"Time_Start": 1605.54, "Time_End": 1606.22, "Text": " Now, you might also."}, {"Time_Start": 1606.24, "Time_End": 1608.04, "Text": " be subject to jurisdiction some other places."}, {"Time_Start": 1608.68, "Time_End": 1613.02, "Text": " But there is no quick fix that says, well, because it happened on the Internet and it was here"}, {"Time_Start": 1613.02, "Time_End": 1616.08, "Text": " and there and I bounced it off here, you know, they can never get me."}, {"Time_Start": 1616.16, "Time_End": 1617.1200000000001, "Text": " They may not be able to find you."}, {"Time_Start": 1617.18, "Time_End": 1618.08, "Text": " That's a different question."}, {"Time_Start": 1618.5, "Time_End": 1621.2, "Text": " But they can always get you where your feet touch the ground."}, {"Time_Start": 1621.42, "Time_End": 1624.92, "Text": " And that's where your feet touch the ground, where you live, or where your feet are happening"}, {"Time_Start": 1624.92, "Time_End": 1627.06, "Text": " to touch the ground when they catch you."}, {"Time_Start": 1628.14, "Time_End": 1632.76, "Text": " So if you've broken the British laws and you're not there when you break them, but later,"}, {"Time_Start": 1633.08, "Time_End": 1636.22, "Text": " you end up going to England and the statute of limitations hasn't passed, your feet,"}, {"Time_Start": 1636.24, "Time_End": 1638.48, "Text": " touch ground on British soil, they can get you there then."}, {"Time_Start": 1639.58, "Time_End": 1643.94, "Text": " It's a fundamental concept that I think was lost a bit in the early days of the Internet"}, {"Time_Start": 1643.94, "Time_End": 1647.7, "Text": " because there was this heady idea that, you know, you could be above the law."}, {"Time_Start": 1648.76, "Time_End": 1649.92, "Text": " It's not the case."}, {"Time_Start": 1650.02, "Time_End": 1652.6, "Text": " It wasn't the case then, and it's certainly not the case now."}, {"Time_Start": 1652.68, "Time_End": 1654.94, "Text": " We've got a lot of case law on that question."}, {"Time_Start": 1656.4, "Time_End": 1656.8, "Text": " So."}, {"Time_Start": 1666.24, "Time_End": 1681.8, "Text": " So I don't know if you're talking about it."}, {"Time_Start": 1681.8, "Time_End": 1684.2, "Text": " The opposite you're not going to try not."}, {"Time_Start": 1684.2, "Time_End": 1690.48, "Text": " And this is a person who is not being the person who is not being responsible to treat these people."}, {"Time_Start": 1692.88, "Time_End": 1694.26, "Text": " Ah, so this is a question."}, {"Time_Start": 1694.26, "Time_End": 1696.06, "Text": " This is a person who trains."}, {"Time_Start": 1696.24, "Time_End": 1702.2, "Text": " foreign nationals for working with, it sounds like, local governments, and he's concerned"}, {"Time_Start": 1702.2, "Time_End": 1705.84, "Text": " because he doesn't know what these people's motives are, and some of them are actually on the list"}, {"Time_Start": 1705.84, "Time_End": 1708.32, "Text": " come from countries that are on the bad lists."}, {"Time_Start": 1708.72, "Time_End": 1710.48, "Text": " What is your liability responsibility?"}, {"Time_Start": 1710.72, "Time_End": 1714.1, "Text": " Well, I think the first thing you ought to figure out is who's your boss and what's your arrangement"}, {"Time_Start": 1714.1, "Time_End": 1718.6, "Text": " for indemnity and responsibility for what you do."}, {"Time_Start": 1718.72, "Time_End": 1723.78, "Text": " If you're a freelancer, I think maybe talk to me afterwards, if you're working under somebody"}, {"Time_Start": 1723.78, "Time_End": 1726.22, "Text": " else's direction and they're telling you to teach these people."}, {"Time_Start": 1726.24, "Time_End": 1732.24, "Text": " then generally you have a degree of protection as long as you're acting within the scope of what they asked you to do."}, {"Time_Start": 1732.24, "Time_End": 1738.24, "Text": " So if you're training under orders from your bosses, it's your bosses who have to think about the effect."}, {"Time_Start": 1738.24, "Time_End": 1745.24, "Text": " Not that you're completely immune, but really, you know, again, you know, the other thing is, you know,"}, {"Time_Start": 1745.24, "Time_End": 1751.24, "Text": " once you know that they're going to use something for a bad purpose, then I think you need to stop and you need to take some action."}, {"Time_Start": 1751.24, "Time_End": 1756.22, "Text": " As long as you don't know, I think, again, you're acting under orders from superior,"}, {"Time_Start": 1756.24, "Time_End": 1758.16, "Text": " they're telling you to train these people."}, {"Time_Start": 1758.76, "Time_End": 1761.74, "Text": " I think that that's a pretty solid first line of defense."}, {"Time_Start": 1762.06, "Time_End": 1764.8, "Text": " It may not be complete, though, and you still might want to see me afterwards."}, {"Time_Start": 1766.36, "Time_End": 1766.56, "Text": " Yes."}, {"Time_Start": 1767.06, "Time_End": 1770.4, "Text": " The final line is off the law, so that the Peter Act sunsets."}, {"Time_Start": 1770.92, "Time_End": 1771.16, "Text": " Yes."}, {"Time_Start": 1771.3, "Time_End": 1771.78, "Text": " Is that true?"}, {"Time_Start": 1772.26, "Time_End": 1775.18, "Text": " Is it the entire act or just portions of it?"}, {"Time_Start": 1775.82, "Time_End": 1780.66, "Text": " The part that the, most of the CFAA stuff actually sunsets in 2005, not all of it."}, {"Time_Start": 1781.2, "Time_End": 1786.0, "Text": " And so one of the things that you'll start hearing from EFF, I hope you're all members, and you get the effector."}, {"Time_Start": 1786.24, "Time_End": 1791.86, "Text": " Because then you can watch and you can see when we say it's time for Patriot to expire,"}, {"Time_Start": 1792.48, "Time_End": 1797.7, "Text": " start putting pressure on your member of Congress to let it die and not reauthorize it."}, {"Time_Start": 1798.56, "Time_End": 1800.1, "Text": " This is going to be important."}, {"Time_Start": 1800.42, "Time_End": 1802.8, "Text": " The Patriot Act was passed in such a rush."}, {"Time_Start": 1804.46, "Time_End": 1810.4, "Text": " Congressman, I think, felt like they had to do something and looked like they were more like they had to look like they had to look like they were doing something to respond to terrorism."}, {"Time_Start": 1810.9, "Time_End": 1815.82, "Text": " But by 2005, hopefully that pressure will be off of most of them."}, {"Time_Start": 1816.24, "Time_End": 1820.22, "Text": " And news from their constituents that we think you went too far with the Patriot Act."}, {"Time_Start": 1820.52, "Time_End": 1826.14, "Text": " You know, it's time to let some of the stuff that we enacted in haste when there was an emergency just die off"}, {"Time_Start": 1826.14, "Time_End": 1827.8, "Text": " and go back to the way the things were before."}, {"Time_Start": 1828.1, "Time_End": 1828.66, "Text": " Really important."}, {"Time_Start": 1828.76, "Time_End": 1835.66, "Text": " I actually think there is a chance that it won't get reauthorized because one of the things about the sunset provisions is, you know, inaction means it goes away."}, {"Time_Start": 1836.2, "Time_End": 1841.48, "Text": " So it's easier to convince members of Congress to do nothing than it is to convince them to do something."}, {"Time_Start": 1841.96, "Time_End": 1845.0, "Text": " And we have the benefit here of being able to say, guess what?"}, {"Time_Start": 1845.0, "Time_End": 1846.34, "Text": " just do nothing."}, {"Time_Start": 1847.46, "Time_End": 1849.32, "Text": " And those situations are rare."}, {"Time_Start": 1849.5, "Time_End": 1852.5, "Text": " Since most of the time when the EFF is concerned about a law, we need it fixed."}, {"Time_Start": 1852.62, "Time_End": 1854.56, "Text": " This is one where we just got to let it die."}, {"Time_Start": 1854.78, "Time_End": 1855.62, "Text": " So that's a good point."}, {"Time_Start": 1855.7, "Time_End": 1856.44, "Text": " Thank you for asking."}, {"Time_Start": 1857.3, "Time_End": 1857.54, "Text": " Yes?"}, {"Time_Start": 1857.78, "Time_End": 1858.04, "Text": " In the front."}, {"Time_Start": 1859.14, "Time_End": 1862.26, "Text": " Are federal employees subject to the law as well?"}, {"Time_Start": 1863.12, "Time_End": 1866.6, "Text": " In general, the federal employees are subject to all the laws."}, {"Time_Start": 1866.74, "Time_End": 1870.72, "Text": " There's not a general federal employee exemption to most laws."}, {"Time_Start": 1870.72, "Time_End": 1874.88, "Text": " So a civilian could take this federal employee to a civil court or"}, {"Time_Start": 1875.0, "Time_End": 1881.4, "Text": " ask for being their home computer is passed more than $5,000 of loss."}, {"Time_Start": 1882.04, "Time_End": 1884.66, "Text": " If they, if they caused the damage, you probably could."}, {"Time_Start": 1884.74, "Time_End": 1887.7, "Text": " Although actually, frankly, I should be straighter about that."}, {"Time_Start": 1887.74, "Time_End": 1892.2, "Text": " There is no blanket immunity, but law enforcement purposes is probably one of the ways"}, {"Time_Start": 1892.2, "Time_End": 1895.02, "Text": " that they would be able to get out from under it."}, {"Time_Start": 1895.46, "Time_End": 1899.76, "Text": " It'd be interesting to try, depending if they really actually cause damage by prodding around in your computer."}, {"Time_Start": 1900.22, "Time_End": 1903.7, "Text": " Real damage, not the kind of phony made-up damage that they get to do,"}, {"Time_Start": 1903.7, "Time_End": 1904.98, "Text": " that the corporations,"}, {"Time_Start": 1905.0, "Time_End": 1910.2, "Text": " get to use. I think it would be an interesting case to try to bring an action against the"}, {"Time_Start": 1910.2, "Time_End": 1911.7, "Text": " government for that."}, {"Time_Start": 1915.7, "Time_End": 1920.2, "Text": " Well, it depends on what they're getting a warrant, it would be able to be a subpoena."}, {"Time_Start": 1920.2, "Time_End": 1923.98, "Text": " Well, it depends on what they're getting. I mean, it wouldn't have to be a warrant. It could be a"}, {"Time_Start": 1923.98, "Time_End": 1927.88, "Text": " subpoena, but you're right. It depends on how they're doing it, right? If they're just unauthorized"}, {"Time_Start": 1927.88, "Time_End": 1932.58, "Text": " pinging around, though, which they actually do a lot of, it'd be interesting, and they actually"}, {"Time_Start": 1932.58, "Time_End": 1934.98, "Text": " caused a bunch of damage. It'd be an interesting case to try to bring."}, {"Time_Start": 1935.0, "Time_End": 1939.82, "Text": " I wouldn't say I'm totally optimistic, but it's the kind of thing that might be fun to try and see what happens."}, {"Time_Start": 1940.16, "Time_End": 1940.74, "Text": " Right behind you?"}, {"Time_Start": 1941.12, "Time_End": 1942.7, "Text": " It's fun to be the EFF lawyer."}, {"Time_Start": 1943.46, "Time_End": 1944.42, "Text": " Let's try that."}, {"Time_Start": 1945.06, "Time_End": 1950.36, "Text": " I'd like to know where educational computers fall in the role of protected or comfortable"}, {"Time_Start": 1950.36, "Time_End": 1953.12, "Text": " or as there are some other..."}, {"Time_Start": 1953.12, "Time_End": 1955.6, "Text": " If they're connected to the Internet, they're protected computers."}, {"Time_Start": 1955.8, "Time_End": 1959.0, "Text": " Educational computers, I don't think, have any..."}, {"Time_Start": 1959.0, "Time_End": 1962.32, "Text": " They don't have any special federal protection that I'm aware of."}, {"Time_Start": 1962.32, "Time_End": 1963.66, "Text": " There may be some state laws."}, {"Time_Start": 1963.76, "Time_End": 1963.92, "Text": " What?"}, {"Time_Start": 1965.0, "Time_End": 1972.38, "Text": " Well, but they wouldn't qualify under protected computers for the Special Patriot Act,"}, {"Time_Start": 1972.38, "Time_End": 1978.02, "Text": " kind of, you know, seventh wall of Dante's, you know, Seventh Circle of Dante's Inferno, special penalties"}, {"Time_Start": 1978.02, "Time_End": 1979.76, "Text": " that when you go into a government computer."}, {"Time_Start": 1982.24, "Time_End": 1982.6, "Text": " Yeah."}, {"Time_Start": 1983.6, "Time_End": 1989.26, "Text": " Not unless, I mean, I suspect that there are actually a lot of computers, say, at Berkeley and the Lawrence Livermore Lab and stuff that would,"}, {"Time_Start": 1989.26, "Time_End": 1994.72, "Text": " because, but it's what is the computer doing, not where is it, that is the correct,"}, {"Time_Start": 1995.0, "Time_End": 1996.28, "Text": " analysis to start."}, {"Time_Start": 1998.74, "Time_End": 2002.12, "Text": " Libraries are getting around some of the provisions by deleting laws."}, {"Time_Start": 2002.24, "Time_End": 2003.48, "Text": " Oh, thank you for this question."}, {"Time_Start": 2003.86, "Time_End": 2007.76, "Text": " And I was curious if there's any other things like that that we can do."}, {"Time_Start": 2007.96, "Time_End": 2012.52, "Text": " Oh, you just lead me into my conclusion of my talk so well. Thank you. What can you do?"}, {"Time_Start": 2013.28, "Time_End": 2017.14, "Text": " One of the best things you can do, it's funny, I've been joking that EFF is becoming the"}, {"Time_Start": 2017.14, "Time_End": 2018.26, "Text": " Anti-Logging Society."}, {"Time_Start": 2020.62, "Time_End": 2024.98, "Text": " Really, one of the worst problems with a lot of this Patriot Act stuff, and it's the same problem"}, {"Time_Start": 2025.0, "Time_End": 2029.66, "Text": " now that the RIAA is taking account of, is that all the Sissimans I know are pack rats, right?"}, {"Time_Start": 2029.74, "Time_End": 2035.92, "Text": " They write all of these servers and systems to gather as much data as they can possibly gather."}, {"Time_Start": 2036.74, "Time_End": 2039.46, "Text": " I understand why Sysid Mons are like that."}, {"Time_Start": 2039.64, "Time_End": 2043.22, "Text": " I believe me, I've worked with computer people for a long time now."}, {"Time_Start": 2043.48, "Time_End": 2044.54, "Text": " We've got to break you that habit."}, {"Time_Start": 2044.94, "Time_End": 2051.04, "Text": " If you really care about freedom, you have to think about what information do you really need to get your work done,"}, {"Time_Start": 2051.5, "Time_End": 2053.34, "Text": " what information don't you need, and how long do you need?"}, {"Time_Start": 2053.34, "Time_End": 2055.38, "Text": " and how long do you need it for?"}, {"Time_Start": 2056.1400000000003, "Time_End": 2060.48, "Text": " Collect the information, only the information that you need, use it the way you need to use it,"}, {"Time_Start": 2060.54, "Time_End": 2061.42, "Text": " and then get rid of it."}, {"Time_Start": 2062.3, "Time_End": 2067.4, "Text": " Because one of the worst problems with Patriot, and I talked about the libraries are having this problem"}, {"Time_Start": 2067.4, "Time_End": 2073.28, "Text": " under, there's a Patriot Act section called 215 that was just challenged by the ACLU."}, {"Time_Start": 2073.7200000000003, "Time_End": 2073.94, "Text": " Yay."}, {"Time_Start": 2075.04, "Time_End": 2076.6600000000003, "Text": " But we'll see how they go with it."}, {"Time_Start": 2077.04, "Time_End": 2079.38, "Text": " That requires libraries to turn over this information."}, {"Time_Start": 2079.92, "Time_End": 2083.32, "Text": " But frankly, with these subpoenas, these various kinds of subpoenas and other tools,"}, {"Time_Start": 2083.34, "Time_End": 2088.34, "Text": " lots of people are being asked to turn over this kind of information that they have about other people."}, {"Time_Start": 2088.34, "Time_End": 2093.34, "Text": " And one of the things that the Patriot Act did was it made clear something that was unclear in the law."}, {"Time_Start": 2093.34, "Time_End": 2098.34, "Text": " It's clear that the government needs a warrant, which means the judge has actually looked at the situation"}, {"Time_Start": 2098.34, "Time_End": 2102.34, "Text": " in order to get the content of messages that you might have on your systems."}, {"Time_Start": 2102.34, "Time_End": 2107.34, "Text": " What was unclear in the law beforehand was what did the government need in order to get all the other stuff,"}, {"Time_Start": 2107.34, "Time_End": 2113.34, "Text": " the logging information, the login, all the other information that you have about it,"}, {"Time_Start": 2113.34, "Time_End": 2116.56, "Text": " transaction other than the actual content of the particular messages."}, {"Time_Start": 2117.1600000000003, "Time_End": 2122.42, "Text": " And there had been a fight between our side of this and the government about what the standard was."}, {"Time_Start": 2122.7200000000003, "Time_End": 2128.52, "Text": " Well, Patriot Act wasn't written by us, and it allows something called a pen trap order,"}, {"Time_Start": 2128.6000000000004, "Time_End": 2133.3, "Text": " which is one of the lowest kinds of governmental things where you basically they just run to a judge"}, {"Time_Start": 2133.3, "Time_End": 2135.32, "Text": " and say, here it's all filled out correctly, sign it."}, {"Time_Start": 2135.36, "Time_End": 2138.0, "Text": " And the judge can't even say, wait a minute, this looks crazy to me."}, {"Time_Start": 2138.28, "Time_End": 2140.96, "Text": " If it's filled out correctly, they have to sign it."}, {"Time_Start": 2140.96, "Time_End": 2143.32, "Text": " And then they can turn it over and they can get all sorts of."}, {"Time_Start": 2143.34, "Time_End": 2146.7000000000003, "Text": " logging information that includes your Google searches that can you know"}, {"Time_Start": 2146.7000000000003, "Time_End": 2152.04, "Text": " or any kind of searching you do any kind on any site if it's logged and it's"}, {"Time_Start": 2152.04, "Time_End": 2157.38, "Text": " available then you got to turn it over then the person who has it has to turn it"}, {"Time_Start": 2157.38, "Time_End": 2162.1800000000003, "Text": " over so the best and the easiest thing to do both in terms of your headache your"}, {"Time_Start": 2162.1800000000003, "Time_End": 2165.96, "Text": " time and other people's freedom is not to have it so that when they show up"}, {"Time_Start": 2165.96, "Time_End": 2170.6400000000003, "Text": " you don't have anything and you can explain why you don't have anything and"}, {"Time_Start": 2170.6400000000003, "Time_End": 2173.32, "Text": " and one of the things that we've seen"}, {"Time_Start": 2173.34, "Time_End": 2178.7400000000002, "Text": " with the RAA stuff, is that the ISPs are starting to put a dollar figure on how much it costs"}, {"Time_Start": 2178.7400000000002, "Time_End": 2182.7000000000003, "Text": " to recreate their records and go through all their backups and find all that stuff for people."}, {"Time_Start": 2182.94, "Time_End": 2183.88, "Text": " It's really expensive."}, {"Time_Start": 2184.42, "Time_End": 2188.9, "Text": " And I've worked with some individuals as well who've gotten subpoenas for archives of news feeds"}, {"Time_Start": 2188.9, "Time_End": 2190.1800000000003, "Text": " and other things that they have."}, {"Time_Start": 2190.92, "Time_End": 2194.1000000000004, "Text": " And it's darned expensive to go back and do that kind of forensic work,"}, {"Time_Start": 2194.4, "Time_End": 2196.58, "Text": " or if you do it yourself, it's a lot of time."}, {"Time_Start": 2196.6600000000003, "Time_End": 2199.06, "Text": " So you can save yourself a lot of hassle and a lot of time."}, {"Time_Start": 2199.44, "Time_End": 2203.32, "Text": " And you can protect the privacies of people who are using your system,"}, {"Time_Start": 2203.34, "Time_End": 2205.9, "Text": " If you just don't keep anything you don't need."}, {"Time_Start": 2206.78, "Time_End": 2217.28, "Text": " We do not. We do not."}, {"Time_Start": 2217.28, "Time_End": 2226.36, "Text": " The question is, in the UK, there is a bill that some folks in the UK have done a great job of trying to knock that thing down."}, {"Time_Start": 2226.46, "Time_End": 2228.82, "Text": " Although I'm not sure they're going to succeed, but we're rooting for them."}, {"Time_Start": 2229.7200000000003, "Time_End": 2233.32, "Text": " In the United States, we have no affirmative requirement."}, {"Time_Start": 2233.34, "Time_End": 2237.78, "Text": " that you keep logging information or any data about your users on your computers."}, {"Time_Start": 2241.08, "Time_End": 2247.82, "Text": " Yes, once you get an order from the court that says, or from a subpoena that says, we want this information."}, {"Time_Start": 2248.02, "Time_End": 2253.78, "Text": " If you thereafter go and destroy things, then you're tampering with evidence and you can be liable both civilly and criminally."}, {"Time_Start": 2254.1400000000003, "Time_End": 2259.28, "Text": " But before the request comes in, you've got no ongoing free-flowing duty to keep data."}, {"Time_Start": 2259.54, "Time_End": 2260.3, "Text": " There aren't any."}, {"Time_Start": 2260.3, "Time_End": 2263.32, "Text": " We're very concerned that the law enforcement is controlled."}, {"Time_Start": 2263.34, "Time_End": 2266.1400000000003, "Text": " try to get it, and now they're going to probably have the RAAAA's backing."}, {"Time_Start": 2266.46, "Time_End": 2271.88, "Text": " But in the meantime, we cannot log, you know, and we'll fight that battle and we'll fight it hard,"}, {"Time_Start": 2271.94, "Time_End": 2274.0, "Text": " and you'll all hear from us because we'll be screaming for help."}, {"Time_Start": 2287.9, "Time_End": 2290.2400000000002, "Text": " So the police can make you start logging user information in the UK."}, {"Time_Start": 2290.84, "Time_End": 2293.1600000000003, "Text": " You could probably get a specific sort of order to do that in the U.K."}, {"Time_Start": 2293.34, "Time_End": 2299.2200000000003, "Text": " U.S., but frankly, it is contrary to the general tide of the way the American law works."}, {"Time_Start": 2299.6800000000003, "Time_End": 2305.42, "Text": " American law in both civil side and frankly on the criminal side doesn't generally require"}, {"Time_Start": 2305.42, "Time_End": 2313.2400000000002, "Text": " affirmative acts of changing systems or doing anything in order to assist law enforcement or civil"}, {"Time_Start": 2313.2400000000002, "Time_End": 2313.86, "Text": " people."}, {"Time_Start": 2314.4, "Time_End": 2316.1600000000003, "Text": " We had this fight in the replay TV case."}, {"Time_Start": 2316.2200000000003, "Time_End": 2322.9, "Text": " Some of you may have followed the replay TV case where this is a situation where the TV"}, {"Time_Start": 2322.9, "Time_End": 2327.84, "Text": " studios and the movie studios were wanted to require Sonic Blue, the company that makes"}, {"Time_Start": 2327.84, "Time_End": 2333.04, "Text": " replay TVs, to affirmatively start tracking what their users were doing with the boxes to find"}, {"Time_Start": 2333.04, "Time_End": 2337.64, "Text": " out whether they were engaging in commercial skipping and sending shows around, which were the"}, {"Time_Start": 2337.64, "Time_End": 2339.34, "Text": " two main things that they were concerned about."}, {"Time_Start": 2339.82, "Time_End": 2343.2000000000003, "Text": " And the initial ruling from the court was very bad."}, {"Time_Start": 2343.6600000000003, "Time_End": 2346.94, "Text": " It was appealed to a higher judge."}, {"Time_Start": 2347.32, "Time_End": 2351.2200000000003, "Text": " We joined in the fight at that point, so did a bunch of other people, and we got the right"}, {"Time_Start": 2351.2200000000003, "Time_End": 2352.88, "Text": " ruling out of the second judge, which."}, {"Time_Start": 2352.9, "Time_End": 2359.2200000000003, "Text": " is there is no general duty, even under the discovery laws in the U.S., for you to create"}, {"Time_Start": 2359.2200000000003, "Time_End": 2365.62, "Text": " new information, create new data in order to assist in a discovery dispute."}, {"Time_Start": 2365.62, "Time_End": 2368.58, "Text": " And the same is generally true in criminal law, although they can get those orders a little"}, {"Time_Start": 2368.58, "Time_End": 2371.78, "Text": " easier in criminal law than they can in civil, but they have to get the order."}, {"Time_Start": 2371.78, "Time_End": 2374.78, "Text": " There is nothing, you have to go judge for that."}, {"Time_Start": 2374.78, "Time_End": 2376.14, "Text": " You can't just do that."}, {"Time_Start": 2376.14, "Time_End": 2380.62, "Text": " The best that they can do without going to a judge is to make you freeze and not get rid"}, {"Time_Start": 2380.62, "Time_End": 2382.88, "Text": " of anything that you already have at the time you get hit hit."}, {"Time_Start": 2382.9, "Time_End": 2389.3, "Text": " with the order. Yes. If they do that, can you give them a bill? Yes. If they do that,"}, {"Time_Start": 2389.34, "Time_End": 2393.98, "Text": " can you give you a bill? Can they give, if they do that, can you give them a bill? Generally, the answer"}, {"Time_Start": 2393.98, "Time_End": 2398.94, "Text": " is yes. The amount that you'll get paid per hour will be far below your hourly rate. I can guarantee"}, {"Time_Start": 2398.94, "Time_End": 2403.54, "Text": " it. And you might have to fight to get the money. But there are provisions in the law for third-party"}, {"Time_Start": 2403.54, "Time_End": 2410.54, "Text": " bystanders to get reimbursed for the costs that they incur in trying to comply with either civil or"}, {"Time_Start": 2410.54, "Time_End": 2411.38, "Text": " criminal orders."}, {"Time_Start": 2412.9, "Time_End": 2419.84, "Text": " Well, a general consultant will be $150 or more. You aren't going to get what you bill."}, {"Time_Start": 2420.2400000000002, "Time_End": 2426.7400000000002, "Text": " You're going to get what the court thinks is fair. And what the court thinks is fair, trust me, is not what you bill."}, {"Time_Start": 2427.48, "Time_End": 2432.1, "Text": " It's going to be significantly smaller. In the back."}, {"Time_Start": 2436.6, "Time_End": 2440.62, "Text": " There is nothing in Patriot 2 about document retention yet. The question is, is there anything"}, {"Time_Start": 2440.62, "Time_End": 2442.64, "Text": " in Patriot 2 about document retention? No."}, {"Time_Start": 2442.9, "Time_End": 2444.62, "Text": " It's not there yet."}, {"Time_Start": 2445.44, "Time_End": 2448.2400000000002, "Text": " And, you know, if it's by my way, it never will be there."}, {"Time_Start": 2449.6, "Time_End": 2454.52, "Text": " I want to just, I've got about 10 more minutes. I want to keep answering question, but I want to get through my what can you do stuff."}, {"Time_Start": 2454.6, "Time_End": 2459.88, "Text": " Because there are a couple things on there that this crowd actually, I think, can do and really ought to think about doing."}, {"Time_Start": 2460.34, "Time_End": 2463.94, "Text": " We've already talked about, you know, EFF anti-logging society."}, {"Time_Start": 2465.3, "Time_End": 2472.7000000000003, "Text": " Use crypto. I personally spent six years of my life fighting the federal government to free cryptography from governmental control"}, {"Time_Start": 2472.7000000000003, "Time_End": 2476.38, "Text": " in the Bernstein case. I wish that you would actually use it."}, {"Time_Start": 2478.34, "Time_End": 2480.6800000000003, "Text": " Please, you guys all know how to use crypto."}, {"Time_Start": 2480.88, "Time_End": 2483.1600000000003, "Text": " Find five people who don't and teach them."}, {"Time_Start": 2483.6200000000003, "Time_End": 2487.1400000000003, "Text": " I had a nice man help me yesterday, actually, figuring out how to do it better on OS10."}, {"Time_Start": 2487.86, "Time_End": 2492.7200000000003, "Text": " And those of you who write crypto, three words, actually two words three times,"}, {"Time_Start": 2492.84, "Time_End": 2495.0600000000004, "Text": " user interface, user interface, user interface, user interface."}, {"Time_Start": 2495.4800000000005, "Time_End": 2497.92, "Text": " Please help people who aren't lead to use this."}, {"Time_Start": 2497.92, "Time_End": 2500.3, "Text": " The more of us that use it, it's, you know, that crowds thing."}, {"Time_Start": 2500.5800000000004, "Time_End": 2502.6800000000003, "Text": " The people who actually need it can hide a little better."}, {"Time_Start": 2502.7000000000003, "Time_End": 2504.0200000000004, "Text": " if more people are using it."}, {"Time_Start": 2504.28, "Time_End": 2510.2000000000003, "Text": " And if it's limited to just this crowd or just Linux users or just people who can, you come to DefCon,"}, {"Time_Start": 2510.5800000000004, "Time_End": 2511.92, "Text": " it's not very useful to anybody."}, {"Time_Start": 2512.1200000000003, "Time_End": 2514.38, "Text": " So please, that's my own personal appeal."}, {"Time_Start": 2514.94, "Time_End": 2516.0200000000004, "Text": " Please use crypto."}, {"Time_Start": 2516.1800000000003, "Time_End": 2518.4600000000005, "Text": " Please teach other people how to use crypto."}, {"Time_Start": 2518.5400000000004, "Time_End": 2524.1600000000003, "Text": " And think about it both in terms of your communications with other folks, but using PGP disks."}, {"Time_Start": 2524.1600000000003, "Time_End": 2529.32, "Text": " So, you know, my view is nobody should travel across the national border unless they've got their data encrypted."}, {"Time_Start": 2529.6400000000003, "Time_End": 2532.6800000000003, "Text": " We've seen far too many people, especially in my work with the human rights community."}, {"Time_Start": 2532.7000000000003, "Time_End": 2535.2200000000003, "Text": " who get the laptop taken at the border, and they never see it again."}, {"Time_Start": 2536.6400000000003, "Time_End": 2538.32, "Text": " So use crypto."}, {"Time_Start": 2539.7200000000003, "Time_End": 2543.78, "Text": " Then what information, what footprints are you leaving?"}, {"Time_Start": 2544.0600000000004, "Time_End": 2546.28, "Text": " Think about, you know, where you're going, what are you doing?"}, {"Time_Start": 2546.4, "Time_End": 2547.6000000000004, "Text": " Think about using services."}, {"Time_Start": 2547.6000000000004, "Time_End": 2555.28, "Text": " Again, you know, I was in the anonymous remailer system meeting yesterday, and I think they're great."}, {"Time_Start": 2555.38, "Time_End": 2556.0800000000004, "Text": " They need more support."}, {"Time_Start": 2556.1800000000003, "Time_End": 2557.34, "Text": " They need more people to use them."}, {"Time_Start": 2557.6000000000004, "Time_End": 2558.28, "Text": " Please do that."}, {"Time_Start": 2558.38, "Time_End": 2559.2000000000003, "Text": " It's wonderful."}, {"Time_Start": 2559.4, "Time_End": 2562.6800000000003, "Text": " I think as a result of this, we're finally going to convince the EFF tech."}, {"Time_Start": 2562.7000000000003, "Time_End": 2565.5000000000005, "Text": " to let us put a remailer on our system so you can bounce off of us."}, {"Time_Start": 2565.7400000000002, "Time_End": 2569.3, "Text": " I see Dan Moniz back there, my tech guy nodding, so I know that's going to happen now."}, {"Time_Start": 2569.78, "Time_End": 2575.94, "Text": " See, you have to embarrass him in public, and then that's not his responsibility, actually."}, {"Time_Start": 2576.88, "Time_End": 2580.42, "Text": " And then if something happens and you hear from law enforcement, please come tell us."}, {"Time_Start": 2581.3, "Time_End": 2585.36, "Text": " Not only will we try to help you, we try to help people find lawyers all the time."}, {"Time_Start": 2585.44, "Time_End": 2586.5000000000005, "Text": " We can't always help everyone."}, {"Time_Start": 2586.6000000000004, "Time_End": 2587.92, "Text": " We're a very small organization."}, {"Time_Start": 2588.44, "Time_End": 2592.2000000000003, "Text": " But we do have a pretty impressive list of lawyers who have volunteered"}, {"Time_Start": 2592.2000000000003, "Time_End": 2596.0000000000005, "Text": " to take EFF cases, some of them for free, sometimes not."}, {"Time_Start": 2596.38, "Time_End": 2600.1400000000003, "Text": " But we will try to help you get connected with lawyers who actually understand enough about"}, {"Time_Start": 2600.1400000000003, "Time_End": 2601.5600000000004, "Text": " the Internet to be able to help you."}, {"Time_Start": 2601.9800000000005, "Time_End": 2605.0400000000004, "Text": " There aren't nearly as many of those as there needs to be, but we know a lot of them."}, {"Time_Start": 2605.76, "Time_End": 2609.88, "Text": " But also try to help them because what we're trying to do is gather evidence that we can use in the"}, {"Time_Start": 2609.88, "Time_End": 2610.2000000000003, "Text": " battles."}, {"Time_Start": 2610.3, "Time_End": 2615.78, "Text": " When the time comes that the Patriot Act comes up for renewal, I need some stories to tell Congress"}, {"Time_Start": 2615.78, "Time_End": 2619.2000000000003, "Text": " about why this should go away, why this was a bad thing."}, {"Time_Start": 2619.5200000000004, "Time_End": 2622.1800000000003, "Text": " And if we don't hear about them, if stuff happens and it goes away quite,"}, {"Time_Start": 2622.2000000000003, "Time_End": 2626.2000000000003, "Text": " I can't marshal that evidence to try to make it so the next person doesn't get hurt."}, {"Time_Start": 2626.2000000000003, "Time_End": 2628.2000000000003, "Text": " So if you hear about this kind of stuff, please let us know."}, {"Time_Start": 2628.2000000000003, "Time_End": 2633.2000000000003, "Text": " We're very easy to find, and we really do want to keep track of this."}, {"Time_Start": 2633.2000000000003, "Time_End": 2640.2000000000003, "Text": " We actually just recently received a fellowship to hire somebody to work full-time for the next two years,"}, {"Time_Start": 2640.2000000000003, "Time_End": 2649.2000000000003, "Text": " a wonderful lawyer that we stole from the ACLU, to work full-time on post-Patriate Civil Liberties issues."}, {"Time_Start": 2649.2000000000003, "Time_End": 2652.2000000000003, "Text": " So we've actually staffed up to be able to try to try to do that."}, {"Time_Start": 2652.2000000000003, "Time_End": 2656.2000000000003, "Text": " to help you and all of your friends if you run into these kinds of problems and we really want to do it."}, {"Time_Start": 2656.2000000000003, "Time_End": 2660.2000000000003, "Text": " I think, are we about done, Goon, or do I have some more time?"}, {"Time_Start": 2660.2000000000003, "Time_End": 2662.2000000000003, "Text": " Ten, five, a couple minutes, okay."}, {"Time_Start": 2662.2000000000003, "Time_End": 2663.2000000000003, "Text": " Yeah."}, {"Time_Start": 2663.2000000000003, "Time_End": 2676.2000000000003, "Text": " So being in a new position, how do you feel about being in a country which was once free and now turning into police state?"}, {"Time_Start": 2676.2000000000003, "Time_End": 2680.2000000000003, "Text": " How do I feel about being in a country that was once free and now is turning in a police state?"}, {"Time_Start": 2680.2000000000003, "Time_End": 2682.2000000000003, "Text": " Well, I haven't yet, but I probably will before."}, {"Time_Start": 2682.2000000000003, "Time_End": 2686.2000000000003, "Text": " the end of the day by the t-shirt out there that says I miss my freedom."}, {"Time_Start": 2686.2000000000003, "Time_End": 2689.2000000000003, "Text": " You know, this is, you know, I think it's horrible."}, {"Time_Start": 2689.2000000000003, "Time_End": 2692.2000000000003, "Text": " You know, I would much rather spend my time trying to make your world better"}, {"Time_Start": 2692.2000000000003, "Time_End": 2695.2000000000003, "Text": " rather than trying to stop it from becoming worse."}, {"Time_Start": 2695.2000000000003, "Time_End": 2698.2000000000003, "Text": " And I'd really love to get to that place."}, {"Time_Start": 2698.2000000000003, "Time_End": 2700.2000000000003, "Text": " Please, let me get to that place."}, {"Time_Start": 2700.2000000000003, "Time_End": 2703.2000000000003, "Text": " And it's awful. I think it's terrible."}, {"Time_Start": 2703.2000000000003, "Time_End": 2705.2000000000003, "Text": " I think we're really in a serious backslide."}, {"Time_Start": 2705.2000000000003, "Time_End": 2710.2000000000003, "Text": " I'm hopeful that there have been a few things, you know, that have started."}, {"Time_Start": 2710.2000000000003, "Time_End": 2711.2000000000003, "Text": " There is a growing consensus."}, {"Time_Start": 2711.2000000000003, "Time_End": 2715.2000000000003, "Text": " consensus in Congress that things have gone so far, too far."}, {"Time_Start": 2715.2000000000003, "Time_End": 2717.2000000000003, "Text": " We need to help support those people."}, {"Time_Start": 2717.2000000000003, "Time_End": 2722.2000000000003, "Text": " Frankly, there are as many, there are more of those almost on the right than there are on the left right now."}, {"Time_Start": 2722.2000000000003, "Time_End": 2726.2000000000003, "Text": " But we need to really push on both sides on that."}, {"Time_Start": 2726.2000000000003, "Time_End": 2731.2000000000003, "Text": " And, you know, I have to think, otherwise I couldn't get up every morning, that the pendulum swings"}, {"Time_Start": 2731.2000000000003, "Time_End": 2735.2000000000003, "Text": " and that we're over here now, but that if we work hard, we can bring it back here"}, {"Time_Start": 2735.2000000000003, "Time_End": 2739.2000000000003, "Text": " and I just hope one of these days it'll be over here, right?"}, {"Time_Start": 2739.2000000000003, "Time_End": 2740.2000000000003, "Text": " In the back?"}, {"Time_Start": 2740.2000000000003, "Time_End": 2745.2000000000003, "Text": " There was a fellow talked about once where the using of crypto in connection with a federal crime"}, {"Time_Start": 2745.2000000000003, "Time_End": 2748.6000000000004, "Text": " would provide a five-year additional chargeable crime on its own."}, {"Time_Start": 2748.6000000000004, "Time_End": 2749.6000000000004, "Text": " Did that ever pass?"}, {"Time_Start": 2749.6000000000004, "Time_End": 2750.8, "Text": " No, that's part of Patriot II."}, {"Time_Start": 2750.8, "Time_End": 2752.4, "Text": " You know, you guys started asking questions."}, {"Time_Start": 2752.4, "Time_End": 2754.6000000000004, "Text": " I didn't get the rest of Patriot 2, but that's part of Patriot 2,"}, {"Time_Start": 2754.6000000000004, "Time_End": 2756.1000000000004, "Text": " and it's one thing that we're very worried about."}, {"Time_Start": 2756.1000000000004, "Time_End": 2759.4, "Text": " It would be a mandatory sentence enhancement for the use of crypto,"}, {"Time_Start": 2759.9, "Time_End": 2762.1000000000004, "Text": " which is written so broadly that it appears to reach, you know,"}, {"Time_Start": 2762.1000000000004, "Time_End": 2763.4, "Text": " a lot of firewall activity."}, {"Time_Start": 2763.4, "Time_End": 2767.9, "Text": " It's not only one that can be charged, even if the original one can go through."}, {"Time_Start": 2767.9, "Time_End": 2770.1000000000004, "Text": " No, at least the one in Patriot 2 is a sentence enhancement."}, {"Time_Start": 2770.2000000000003, "Time_End": 2777.2000000000003, "Text": " So if you're convicted of one crime and there was crypto used, then you get a five-year ding on top."}, {"Time_Start": 2777.2000000000003, "Time_End": 2780.2000000000003, "Text": " It's not good, but it's not a separate crime anymore."}, {"Time_Start": 2780.2000000000003, "Time_End": 2790.2000000000003, "Text": " The thing that was floated right after September 11th that would have made crypto a separate crime died really fast."}, {"Time_Start": 2790.2000000000003, "Time_End": 2792.2000000000003, "Text": " And it did in large part because this community rose up."}, {"Time_Start": 2792.2000000000003, "Time_End": 2795.2000000000003, "Text": " I don't know if you know this, but lots of people rose up and said,"}, {"Time_Start": 2795.2000000000003, "Time_End": 2798.2000000000003, "Text": " don't, you know, over my dead body, you'll touch our crypto."}, {"Time_Start": 2798.2000000000003, "Time_End": 2799.2000000000003, "Text": " We work too hard to get it free."}, {"Time_Start": 2799.2000000000003, "Time_End": 2804.9600000000005, "Text": " So I think, you know, that makes me happy that, you know, we were able to stop that backslide."}, {"Time_Start": 2804.9600000000005, "Time_End": 2809.0000000000005, "Text": " And it makes me feel like crypto's on pretty solid ground now."}, {"Time_Start": 2809.0000000000005, "Time_End": 2812.4, "Text": " You know, there's still, sentence enhancements are bad, and we need to fight those."}, {"Time_Start": 2812.4, "Time_End": 2818.6000000000004, "Text": " But the dark days, I think, I think it's just not politically expedient to try to go back to those days right now."}, {"Time_Start": 2818.6000000000004, "Time_End": 2821.84, "Text": " And the fact that we survived a terrorist attack without that, it gives me hope."}, {"Time_Start": 2823.84, "Time_End": 2824.0000000000005, "Text": " Yes?"}, {"Time_Start": 2829.2000000000003, "Time_End": 2859.1400000000003, "Text": " Yes, you're right. He said, what about financial institutions and logging? And he's right. I should have made a small caveat to that. There are, you know, professional financial institutions have some requirements that are SEC requirements that they keep information about trades and shares and stuff. That still doesn't mean that they have to keep a lot of things, right? They don't have to keep everybody who just shows up on their website. But they do have to keep a certain amount of data. And they have some"}, {"Time_Start": 2859.2000000000003, "Time_End": 2861.6000000000004, "Text": " data retention requirements, but they're about the only ones."}, {"Time_Start": 2864.5400000000004, "Time_End": 2869.7000000000003, "Text": " Yes, they are for trades."}, {"Time_Start": 2869.82, "Time_End": 2873.4, "Text": " Anything trade related, they're supposed to track, and there was a recent ruling that"}, {"Time_Start": 2873.4, "Time_End": 2876.7400000000002, "Text": " they have to log instant messenger things for traders."}, {"Time_Start": 2876.86, "Time_End": 2877.5200000000004, "Text": " And the answer is yes."}, {"Time_Start": 2877.6400000000003, "Time_End": 2881.4800000000005, "Text": " Anything involving in financial trade has a data retention requirement."}, {"Time_Start": 2881.6000000000004, "Time_End": 2886.9600000000005, "Text": " There was a recent ruling out of the SEC that says it doesn't matter what technology you use."}, {"Time_Start": 2887.0200000000004, "Time_End": 2889.1800000000003, "Text": " If it's a communication about a trade, you need to track it."}, {"Time_Start": 2889.2000000000003, "Time_End": 2892.6200000000003, "Text": " it, you know, and that's the rule."}, {"Time_Start": 2893.38, "Time_End": 2899.76, "Text": " And it's really designed to try to stop the kind of cook-the-book sorts of things that we've seen with our corporate, our corporations right now."}, {"Time_Start": 2903.2000000000003, "Time_End": 2903.6000000000004, "Text": " Yes."}, {"Time_Start": 2904.92, "Time_End": 2906.1600000000003, "Text": " Is the rule effective now?"}, {"Time_Start": 2906.2400000000002, "Time_End": 2907.32, "Text": " I think it's effective now."}, {"Time_Start": 2907.38, "Time_End": 2909.1200000000003, "Text": " In fact, I think it was already effective in."}, {"Time_Start": 2909.8, "Time_End": 2913.6400000000003, "Text": " Yeah, it was already effective before the law passed."}, {"Time_Start": 2913.6400000000003, "Time_End": 2919.0000000000005, "Text": " And they just issued a clarifying ruling that said IMs are included in what the rule already said."}, {"Time_Start": 2919.2000000000003, "Time_End": 2926.86, "Text": " Are people treated differently in case that if you just act directly from the United States to another box,"}, {"Time_Start": 2926.9600000000005, "Time_End": 2931.94, "Text": " United States versus someone that bounces a few hosts around the world and then comes back to the United States?"}, {"Time_Start": 2932.1200000000003, "Time_End": 2935.8, "Text": " Are you treated differently if you go just from one box to another box in the U.S."}, {"Time_Start": 2935.8, "Time_End": 2938.9800000000005, "Text": " Or if you go bouncing around a bunch of hosts and then end up in the U.S.?"}, {"Time_Start": 2938.9800000000005, "Time_End": 2941.82, "Text": " Well, I think, I mean, there's a double-edged sword."}, {"Time_Start": 2941.9600000000005, "Time_End": 2945.7000000000003, "Text": " I mean, if you go bouncing around a bunch of hosts and then end up at the U.S., you might be harder to catch."}, {"Time_Start": 2946.32, "Time_End": 2948.92, "Text": " But I think that you could also engender potential liability."}, {"Time_Start": 2949.2000000000003, "Time_End": 2955.5600000000004, "Text": " all the other places. And so one of the things that we've seen the U.S. do in non-hacker context"}, {"Time_Start": 2955.5600000000004, "Time_End": 2961.9, "Text": " is kind of, you know, I don't know what you call that, jurisdiction washing, you know, where they'll send somebody to another jurisdiction"}, {"Time_Start": 2961.9, "Time_End": 2967.36, "Text": " where things are a little tougher if they don't qualify under U.S. laws."}, {"Time_Start": 2967.36, "Time_End": 2973.32, "Text": " Are they able to, like, grab logs? You know what I mean? Like, it depends on wherever you came from."}, {"Time_Start": 2973.32, "Time_End": 2978.0400000000004, "Text": " But, I mean, it's, are they getting more jurisdiction foreign-wise to grab logs?"}, {"Time_Start": 2978.1600000000003, "Time_End": 2978.36, "Text": " Yes."}, {"Time_Start": 2979.2000000000003, "Time_End": 2981.36, "Text": " Are they getting more jurisdiction to grab foreign logs?"}, {"Time_Start": 2981.44, "Time_End": 2981.7200000000003, "Text": " Yes."}, {"Time_Start": 2982.1400000000003, "Time_End": 2986.6000000000004, "Text": " They already had actually quite a bit of jurisdiction, but now Patriot Act makes that more explicit."}, {"Time_Start": 2986.7200000000003, "Time_End": 2990.6000000000004, "Text": " But more importantly, what they do is they have all sorts of friendship agreements with other governments,"}, {"Time_Start": 2990.6000000000004, "Time_End": 2995.5200000000004, "Text": " and they hand stuff off voluntarily to each other."}, {"Time_Start": 2995.6000000000004, "Time_End": 3001.76, "Text": " Yeah, those connections in the last couple of years have really got much more routine."}, {"Time_Start": 3001.9600000000005, "Time_End": 3005.1600000000003, "Text": " Talking to people in the Department of Justice to do this work,"}, {"Time_Start": 3005.5200000000004, "Time_End": 3009.0400000000004, "Text": " they have much tighter ties with overseas authorities."}, {"Time_Start": 3009.2000000000003, "Time_End": 3010.7000000000003, "Text": " that they did five years ago."}, {"Time_Start": 3010.8, "Time_End": 3014.7200000000003, "Text": " Yeah, that's Fred von Loman and our senior intellectual property attorney is pointing out that"}, {"Time_Start": 3014.7200000000003, "Time_End": 3021.82, "Text": " the ties between the U.S. Justice Department and their foreign compatriots in the last few years"}, {"Time_Start": 3021.82, "Time_End": 3024.4, "Text": " are much, much tighter than they used to be."}, {"Time_Start": 3025.0600000000004, "Time_End": 3029.92, "Text": " And it makes jurisdiction hopping much easier for them to track because they just call their"}, {"Time_Start": 3029.92, "Time_End": 3032.86, "Text": " friend Louis in Italy and get the information they need."}, {"Time_Start": 3033.2000000000003, "Time_End": 3033.5400000000004, "Text": " You on the end?"}, {"Time_Start": 3033.7400000000002, "Time_End": 3037.42, "Text": " You talked a little bit about people who trade people who end up committing terrorist tax."}, {"Time_Start": 3037.78, "Time_End": 3039.1400000000003, "Text": " What about people who write anonymous?"}, {"Time_Start": 3039.2000000000003, "Time_End": 3043.6800000000003, "Text": " censorship-resistant systems, which are intended to protect her sentence rights,"}, {"Time_Start": 3043.78, "Time_End": 3048.78, "Text": " but end up also, we know, could be used by terrorists to get away with things without getting caught."}, {"Time_Start": 3048.9, "Time_End": 3053.6200000000003, "Text": " Yeah, so the question is, what about people who build systems that protect people's anonymity"}, {"Time_Start": 3053.6200000000003, "Time_End": 3058.44, "Text": " and do other things that, you know, are used for legitimate purposes, but could also be misused"}, {"Time_Start": 3058.44, "Time_End": 3059.7000000000003, "Text": " for illegitimate purposes?"}, {"Time_Start": 3059.94, "Time_End": 3061.92, "Text": " That's actually one of my hypoes that I didn't get to."}, {"Time_Start": 3062.9600000000005, "Time_End": 3069.0800000000004, "Text": " But the answer is, I think, that as long as there are a lot of general purposes for your system,"}, {"Time_Start": 3069.2000000000003, "Time_End": 3071.5800000000004, "Text": " It's going to be hard for them to track back to you."}, {"Time_Start": 3071.78, "Time_End": 3073.4800000000005, "Text": " And it doesn't mean that they couldn't get to you, though."}, {"Time_Start": 3073.5400000000004, "Time_End": 3076.32, "Text": " I think the law is vague enough, and it hasn't been decided."}, {"Time_Start": 3077.32, "Time_End": 3080.4, "Text": " You know, that's exactly the kind of thing that you should call us."}, {"Time_Start": 3081.0200000000004, "Time_End": 3084.92, "Text": " But, you know, it's our position, and I think it would be, you know,"}, {"Time_Start": 3084.9600000000005, "Time_End": 3088.82, "Text": " I think we'd have a really good shot at it, that if you're running a general purpose anonymity tool,"}, {"Time_Start": 3088.82, "Time_End": 3092.5400000000004, "Text": " especially in the United States, you know, we have a First Amendment right to anonymous speech in this country"}, {"Time_Start": 3092.5400000000004, "Time_End": 3097.5800000000004, "Text": " that has been upheld over and over and over again, including just last year by our Supreme Court,"}, {"Time_Start": 3098.1400000000003, "Time_End": 3099.1800000000003, "Text": " I would go to the wall."}, {"Time_Start": 3099.2000000000003, "Time_End": 3104.2000000000003, "Text": " on that one. I think, I think the general purpose. The thing you want to think about is keep a general purpose."}, {"Time_Start": 3104.2000000000003, "Time_End": 3109.2000000000003, "Text": " If you're really, if you're really customizing something for a particular illegal purpose,"}, {"Time_Start": 3109.2000000000003, "Time_End": 3111.2000000000003, "Text": " you're going to have a much harder time."}, {"Time_Start": 3111.2000000000003, "Time_End": 3116.2000000000003, "Text": " And you'll hear this as a theme, I think, when you look through all of EFF stuff about technology,"}, {"Time_Start": 3116.2000000000003, "Time_End": 3127.2000000000003, "Text": " is really think about, you know, legal uses for whatever you're developing, develop such that they can happen and they do happen."}, {"Time_Start": 3127.2000000000003, "Time_End": 3131.88, "Text": " happen that you've got a really good argument that you're developing a tool and that the tool"}, {"Time_Start": 3131.88, "Time_End": 3136.44, "Text": " could be used for legal or illegal purposes. And if you're customizing it and aiming it,"}, {"Time_Start": 3136.44, "Time_End": 3140.9, "Text": " think about the difference between Napster, which only let you change MP3s and Morpheus, where"}, {"Time_Start": 3140.9, "Time_End": 3145.92, "Text": " we won the case due to a lot of different changes, but one of the big changes that was different"}, {"Time_Start": 3145.92, "Time_End": 3151.0600000000004, "Text": " between Napster and the cases that have survived is that the technology could be used for a lot"}, {"Time_Start": 3151.0600000000004, "Time_End": 3155.34, "Text": " more purposes and the argument that it could be used for a lot more purposes carried a lot more weight"}, {"Time_Start": 3155.34, "Time_End": 3159.6400000000003, "Text": " because in fact it was being used, it is being used for a lot of legal purposes."}, {"Time_Start": 3160.0, "Time_End": 3161.82, "Text": " I think the same is true on the criminal side."}, {"Time_Start": 3161.9, "Time_End": 3165.28, "Text": " If there's potential criminal liability for somebody misusing a tool that you make,"}, {"Time_Start": 3166.2000000000003, "Time_End": 3171.7400000000002, "Text": " you need to really think hard about making sure that there are legal uses to and that they're actually happening."}, {"Time_Start": 3172.28, "Time_End": 3175.5, "Text": " And you'll be in a much better place to stand up in front of a judge and say,"}, {"Time_Start": 3175.5, "Time_End": 3179.9, "Text": " this is the tool I made, and this is why I made it, and they won't be able to poke so many holes in you and say,"}, {"Time_Start": 3179.98, "Time_End": 3182.54, "Text": " well, yeah, actually, but you say that, but it was really about this."}, {"Time_Start": 3182.54, "Time_End": 3185.62, "Text": " The Goon is telling me that we're done."}, {"Time_Start": 3185.7799999999997, "Time_End": 3189.2599999999998, "Text": " I'm going to go out into the hallway, and I'm happy to continue talking to folks."}, {"Time_Start": 3189.62, "Time_End": 3191.08, "Text": " Also, please come at six."}, {"Time_Start": 3198.02, "Time_End": 3199.82, "Text": " What?"}, {"Time_Start": 3199.82, "Time_End": 3200.74, "Text": " You're down."}, {"Time_Start": 3201.38, "Time_End": 3203.7599999999998, "Text": " You stumble in and bumped your head."}, {"Time_Start": 3203.86, "Time_End": 3206.14, "Text": " If not for me, then you'd be dead."}, {"Time_Start": 3206.2599999999998, "Time_End": 3209.86, "Text": " I'd pick you up, put you back on the ground."}]}