{"segments": [{"Time_Start": 0.0, "Time_End": 18.0, "Text": " I guess so there's still more seats up front if anybody wants to grab them rather than stand in the back or anything"}, {"Time_Start": 18.0, "Time_End": 29.14, "Text": " Oh, is this a good mic placement and everything?"}, {"Time_Start": 29.380000000000003, "Time_End": 30.560000000000002, "Text": " I just tossed it on myself."}, {"Time_Start": 31.439999999999998, "Time_End": 31.740000000000002, "Text": " Excellent."}, {"Time_Start": 39.7, "Time_End": 42.32, "Text": " All right, so I, my name is Sean O'Toole,"}, {"Time_Start": 42.42, "Time_End": 44.7, "Text": " and I'm going to be speaking to you about metamorphic viruses."}, {"Time_Start": 45.56, "Time_End": 47.980000000000004, "Text": " And I wanted to stress that I know this whole."}, {"Time_Start": 48.0, "Time_End": 52.66, "Text": " conference is educational purposes only, but I want to stress that this one is definitely"}, {"Time_Start": 52.66, "Time_End": 57.36, "Text": " because I don't want to see anybody's grandmother not be able to access their email or something"}, {"Time_Start": 57.36, "Time_End": 59.0, "Text": " because I gave a speech."}, {"Time_Start": 59.6, "Time_End": 64.58, "Text": " You know, you guys are the computer guys of your families, so you know if they have a problem,"}, {"Time_Start": 64.7, "Time_End": 65.58, "Text": " you're going to hear about it."}, {"Time_Start": 70.68, "Time_End": 75.78, "Text": " And so, yeah, I'm going to, my speech on mammorphic viruses, I'm going to start off with"}, {"Time_Start": 75.78, "Time_End": 77.98, "Text": " going through like some superiors."}, {"Time_Start": 78.0, "Time_End": 80.9, "Text": " code on how the various modules work."}, {"Time_Start": 81.4, "Time_End": 84.8, "Text": " And then after that, I'll talk about some of the AV approaches to it."}, {"Time_Start": 85.98, "Time_End": 93.46000000000001, "Text": " And also, on the CD I wanted to mention, I, that I did have some misspellings, but, you know,"}, {"Time_Start": 93.5, "Time_End": 98.2, "Text": " it was a late-night presentation that I was putting together after a friend's birthday, so you know what happens."}, {"Time_Start": 100.78, "Time_End": 105.78, "Text": " So as we go on, I just wanted to give you a couple of the definitions, one from Peter Zor,"}, {"Time_Start": 105.78, "Time_End": 111.5, "Text": " who's a well-known antivirus person down to like your virus people."}, {"Time_Start": 111.6, "Time_End": 116.74000000000001, "Text": " And it goes from body polymorphics where they swear they've always been around in simpler techniques"}, {"Time_Start": 116.74000000000001, "Time_End": 120.22, "Text": " down to the extreme mutation."}, {"Time_Start": 120.66, "Time_End": 123.18, "Text": " So we got that going."}, {"Time_Start": 123.3, "Time_End": 128.82, "Text": " Now I'm going to give a brief description of all the various sections or the main sections"}, {"Time_Start": 128.82, "Time_End": 131.12, "Text": " that you'll see are theorized."}, {"Time_Start": 132.06, "Time_End": 135.5, "Text": " The first one is the disassembler, which mainly,"}, {"Time_Start": 135.78, "Time_End": 140.92, "Text": " usually has some way of putting something into a structure or something, a lot of reverse"}, {"Time_Start": 140.92, "Time_End": 147.94, "Text": " engineering tools and whatnot. Then the second is the depermutator, which takes the code that's"}, {"Time_Start": 147.94, "Time_End": 153.6, "Text": " been shuffled and connected by jumps and puts it straight down to the straightest code"}, {"Time_Start": 153.6, "Time_End": 160.06, "Text": " that the algorithm can put it back together with. And also the shrinker, which takes"}, {"Time_Start": 160.06, "Time_End": 165.6, "Text": " op codes and recombine, or clusters of op code and recombines them,"}, {"Time_Start": 165.78, "Time_End": 174.44, "Text": " like if you have a push EBX, pop ECX, it becomes a move ECX comma EBX type of thing."}, {"Time_Start": 174.64, "Time_End": 181.3, "Text": " So these two first, or two and three are mainly the ones that get you back down to the skeleton of your virus."}, {"Time_Start": 181.92000000000002, "Time_End": 190.1, "Text": " That it can be expanded on later with these ones, the expanders, which will do exactly the reverse of the shrinker."}, {"Time_Start": 190.9, "Time_End": 194.78, "Text": " And the permutator, which shuffles the code, links it with jumps, and so forth."}, {"Time_Start": 194.78, "Time_End": 203.82, "Text": " And also we get down to the reassembler, the reassembler, which places the virus back together, fixes, jumps, and so forth."}, {"Time_Start": 204.82, "Time_End": 209.06, "Text": " And these six are the main ones that you'll see are here theorized."}, {"Time_Start": 209.14, "Time_End": 210.56, "Text": " Like a shrinker is very rare."}, {"Time_Start": 211.56, "Time_End": 215.18, "Text": " Expander, permutator, those are ones that are more used."}, {"Time_Start": 216.3, "Time_End": 221.8, "Text": " And here's just one that I wanted to go over really quick, is when you're programming these viruses or looking at them,"}, {"Time_Start": 221.8, "Time_End": 224.76, "Text": " you've got to think in AI, very software engineer."}, {"Time_Start": 224.78, "Time_End": 230.38, "Text": " type of thinking towards it because, you know, you want to think in modules, everything's separate."}, {"Time_Start": 230.48, "Time_End": 236.4, "Text": " We just pass this information to this one, so you don't end up getting into this huge project that never finishes."}, {"Time_Start": 239.48, "Time_End": 242.3, "Text": " So we get down to the disassembler, we have two choices."}, {"Time_Start": 242.7, "Time_End": 248.64, "Text": " One is, I, one day I haven't really passed across, but it's heavily theorized to make a pseudo-language,"}, {"Time_Start": 248.64, "Time_End": 254.6, "Text": " so that you can change, like, say if you want to go from Elf to I, X-86,"}, {"Time_Start": 254.78, "Time_End": 260.7, "Text": " you can change a few things in there through your pseudo-language before you put it back down"}, {"Time_Start": 260.7, "Time_End": 263.72, "Text": " into the assembly language."}, {"Time_Start": 264.22, "Time_End": 269.74, "Text": " And also we have reverse engineering tools, which the zombie is the main person that puts those together."}, {"Time_Start": 270.46, "Time_End": 276.72, "Text": " The LDE was an earlier version of the ADE, which has a length list of structures, and the structures"}, {"Time_Start": 276.72, "Time_End": 282.82, "Text": " is actually inside with that module when you get it so you can look at kind of like the manual"}, {"Time_Start": 282.82, "Time_End": 286.48, "Text": " and it will tell you basically what you got to deal with after you run it."}, {"Time_Start": 287.86, "Time_End": 293.42, "Text": " Oh, and also that one of the things about the disassembler is also that it's not always able to"}, {"Time_Start": 293.42, "Time_End": 295.65999999999997, "Text": " reverse engineer all files."}, {"Time_Start": 295.9, "Time_End": 301.14, "Text": " It just has some, so it cuts out some of the selection process."}, {"Time_Start": 302.44, "Time_End": 307.21999999999997, "Text": " And here's one from the Demental Drills article, Practisan Metamorphism,"}, {"Time_Start": 307.21999999999997, "Time_End": 312.44, "Text": " that's a little example of how you can put together your pseudo-I language."}, {"Time_Start": 312.82, "Time_End": 320.21999999999997, "Text": " One is that you could, well, you have the op code, the instructions tell you, of course, which registers and whatnot."}, {"Time_Start": 320.78, "Time_End": 327.06, "Text": " LM, which is label marker, which tells you later if there's a label that points to that that maybe jump to."}, {"Time_Start": 327.6, "Time_End": 335.36, "Text": " And this is very important for shrinkers and so forth, because if you shrink an instruction and there's a label in between that cluster,"}, {"Time_Start": 335.92, "Time_End": 341.88, "Text": " then you've just basically screwed up the whole thing that is jumping to because you've added too much code into one area."}, {"Time_Start": 342.82, "Time_End": 347.88, "Text": " Also, we have, like, the idea of how to deal with the op code."}, {"Time_Start": 347.96, "Time_End": 350.46, "Text": " You can say that move is to 40."}, {"Time_Start": 350.7, "Time_End": 354.38, "Text": " If you're doing memory to register, it's plus two."}, {"Time_Start": 354.62, "Time_End": 358.1, "Text": " So move memory to register would become 42."}, {"Time_Start": 358.1, "Time_End": 365.26, "Text": " And there's also a full list of the idea of point pseudo op codes like this in the same article."}, {"Time_Start": 369.06, "Time_End": 372.65999999999997, "Text": " So now we get down to the de permutator because I,"}, {"Time_Start": 372.82, "Time_End": 379.68, "Text": " The other choice for the disassembler can be found in its manual pages."}, {"Time_Start": 380.42, "Time_End": 385.88, "Text": " And the de-permutator, as I said earlier, just dis-suffles the code, if you will."}, {"Time_Start": 386.44, "Time_End": 394.34, "Text": " And this can be put in its own module or can be included in the disassembly process, depending on which way you'd like to go."}, {"Time_Start": 395.98, "Time_End": 398.18, "Text": " And here's like the pseudo-code at the beginning."}, {"Time_Start": 398.18, "Time_End": 402.8, "Text": " You got the variables, like you start out with the end."}, {"Time_Start": 402.82, "Time_End": 406.7, "Text": " entry point of the I, which you're disassembling or de-permutating."}, {"Time_Start": 407.56, "Time_End": 412.18, "Text": " You have a path marker, which is your buffer for after your de-permutating code."}, {"Time_Start": 412.68, "Time_End": 414.52, "Text": " A label, which is two D-words."}, {"Time_Start": 414.65999999999997, "Time_End": 420.82, "Text": " One is the old address of the code and one is the new address of the code, which later on some of these"}, {"Time_Start": 420.82, "Time_End": 427.1, "Text": " won't have an old address, which will, I see, and this is very important for jump fixing later on"}, {"Time_Start": 427.1, "Time_End": 428.44, "Text": " as well as other things."}, {"Time_Start": 428.44, "Time_End": 432.8, "Text": " And the future jump label table, which has labels that you."}, {"Time_Start": 432.82, "Time_End": 435.02, "Text": " you don't want to deal with yet through the algorithm."}, {"Time_Start": 436.7, "Time_End": 442.06, "Text": " And you'll, of course, zero out the path markers so you don't end up hitting the random I"}, {"Time_Start": 442.06, "Time_End": 447.6, "Text": " op codes that are just somewhere, something that wasn't that buffer, so that you think that"}, {"Time_Start": 447.6, "Time_End": 450.28, "Text": " this could be a portion of what you're de-permutating."}, {"Time_Start": 451.1, "Time_End": 457.52, "Text": " And you translate the current instruction pointer into the ESI."}, {"Time_Start": 459.86, "Time_End": 462.58, "Text": " And then here's what you do for a jump."}, {"Time_Start": 462.82, "Time_End": 465.56, "Text": " If you have a jump, you've already de-permutated it."}, {"Time_Start": 466.06, "Time_End": 468.7, "Text": " Of course, you just jump it back to that."}, {"Time_Start": 468.8, "Time_End": 473.06, "Text": " And that's one of the things about this algorithm that makes you know that you cannot have"}, {"Time_Start": 473.06, "Time_End": 477.06, "Text": " the same de-permutated that virus every time."}, {"Time_Start": 477.06, "Time_End": 482.82, "Text": " You may have a jump from a couple generations back that the algorithm never really took out."}, {"Time_Start": 484.1, "Time_End": 488.0, "Text": " And then if you have not de-permutated yet, you put it in NOAAPOP,"}, {"Time_Start": 488.14, "Time_End": 490.53999999999996, "Text": " unless it's just in case if it's being pointed to."}, {"Time_Start": 491.68, "Time_End": 492.71999999999997, "Text": " And then you just go."}, {"Time_Start": 492.82, "Time_End": 496.52, "Text": " on from where the jump leads you."}, {"Time_Start": 496.52, "Time_End": 502.59999999999997, "Text": " And then you have the conditional jumps, which a lot of times are just kept in there, and they're"}, {"Time_Start": 502.59999999999997, "Time_End": 504.64, "Text": " putting the future label table and whatnot."}, {"Time_Start": 504.64, "Time_End": 508.88, "Text": " You can see everything here."}, {"Time_Start": 508.88, "Time_End": 514.42, "Text": " Calls, same as conditional jumps, returns, just goes to the future label table, so you move"}, {"Time_Start": 514.42, "Time_End": 519.88, "Text": " move one leaf up the code tree and get back to it."}, {"Time_Start": 522.82, "Time_End": 526.6600000000001, "Text": " And then here's the little note I wanted to make sure that we had on there,"}, {"Time_Start": 526.74, "Time_End": 530.1400000000001, "Text": " which is when getting a new EIP from the future label table,"}, {"Time_Start": 530.34, "Time_End": 534.0400000000001, "Text": " we check if the labels stored here are already been de-permuted."}, {"Time_Start": 534.5600000000001, "Time_End": 540.36, "Text": " If they are, then we insert the corresponding labels at the label table"}, {"Time_Start": 540.36, "Time_End": 543.5400000000001, "Text": " and eliminate the entry and future label tables."}, {"Time_Start": 543.94, "Time_End": 547.3800000000001, "Text": " If not, we get the new EIP continue."}, {"Time_Start": 549.82, "Time_End": 552.8000000000001, "Text": " And also I just had like a little note here for if you're,"}, {"Time_Start": 552.82, "Time_End": 557.0, "Text": " making it stand-alone and whatnot, you're going to have to do a lot of more list things"}, {"Time_Start": 557.0, "Time_End": 561.86, "Text": " if you're doing it standalone because in two buffers, so that's one of the reasons it's usually"}, {"Time_Start": 561.86, "Time_End": 564.6600000000001, "Text": " in the disassembler, it will take up less room."}, {"Time_Start": 566.2600000000001, "Time_End": 574.2600000000001, "Text": " And here's a little example here, and we see that the triple-Xs are the code that is meaningful,"}, {"Time_Start": 575.2, "Time_End": 578.98, "Text": " and the Y codes are the ones that are unreachable."}, {"Time_Start": 578.98, "Time_End": 582.8000000000001, "Text": " So this is another thing that your deep permutator will help you."}, {"Time_Start": 582.82, "Time_End": 588.7600000000001, "Text": " do. It'll allow you to put in worthless code that will never be reached so that it's"}, {"Time_Start": 588.7600000000001, "Time_End": 594.38, "Text": " just in there, makes it look different. We see this beforehand. We got the conditional jump."}, {"Time_Start": 594.38, "Time_End": 600.74, "Text": " We got some of the other jumps. After it runs, we got this. No more authorized are useless"}, {"Time_Start": 600.74, "Time_End": 606.32, "Text": " instructions. Once you get a jump, links you straight to where that code was, goes through"}, {"Time_Start": 606.32, "Time_End": 612.6400000000001, "Text": " there until you've hit it all and that's, it's there. And then we get to the shrinker."}, {"Time_Start": 612.82, "Time_End": 618.32, "Text": " which is extremely rare to find and will reappear in our AV section."}, {"Time_Start": 619.4000000000001, "Time_End": 624.22, "Text": " And this is basically the, like I was saying, the inverse of the expander."}, {"Time_Start": 625.1800000000001, "Time_End": 633.0600000000001, "Text": " And it's most, I haven't run upon it, so that's why it's not, and I don't have the examples of it anywhere."}, {"Time_Start": 634.1, "Time_End": 640.84, "Text": " And so we have the pseudocode for that right here, which we can see is basically looking through"}, {"Time_Start": 640.84, "Time_End": 642.8000000000001, "Text": " and seeing if we can find in code clusters."}, {"Time_Start": 642.82, "Time_End": 650.4200000000001, "Text": " and switching them back to their most simple ones, which I do it as if there's a list of"}, {"Time_Start": 650.4200000000001, "Time_End": 657.7600000000001, "Text": " these conversions, but many times it's just a whole function that just does one thing."}, {"Time_Start": 660.94, "Time_End": 666.44, "Text": " Then we get to the expander, which I is the inverse of the shrinker."}, {"Time_Start": 667.2800000000001, "Time_End": 672.8000000000001, "Text": " And I, basically, that's usually a standalone thing, and usually also those don't use."}, {"Time_Start": 672.82, "Time_End": 676.08, "Text": " use a list or anything to see what the conversions are."}, {"Time_Start": 676.5600000000001, "Time_End": 682.84, "Text": " Mainly, they're just functions that are already written out like the When 9X Ramon's virus"}, {"Time_Start": 682.84, "Time_End": 688.6400000000001, "Text": " will have some of these so that you can take a reference point to see how they're done."}, {"Time_Start": 689.74, "Time_End": 694.1, "Text": " And here's the pseudocode for that. We have, is expandable."}, {"Time_Start": 695.1400000000001, "Time_End": 702.3800000000001, "Text": " I forgot to switch it to an actual number rather than a bullion. But basically, the expandable question"}, {"Time_Start": 702.38, "Time_End": 705.64, "Text": " is how many times can we expand it?"}, {"Time_Start": 705.72, "Time_End": 709.54, "Text": " Three op codes, two op codes, or just switch op codes."}, {"Time_Start": 710.14, "Time_End": 715.3, "Text": " And it goes through and it says, okay, if we got this random number and we got this, we're going to do it."}, {"Time_Start": 716.4, "Time_End": 718.32, "Text": " And that's basically that pseudocode."}, {"Time_Start": 718.42, "Time_End": 723.36, "Text": " And that's just by it's telling you about how you can make an expandable or is expandable type of thing."}, {"Time_Start": 723.96, "Time_End": 727.66, "Text": " It shows zero, there's no way to expand it."}, {"Time_Start": 728.0, "Time_End": 730.42, "Text": " Seven, you expand it all three different ways."}, {"Time_Start": 730.42, "Time_End": 732.36, "Text": " And up and down the line with the."}, {"Time_Start": 732.38, "Time_End": 734.3, "Text": " various combinations."}, {"Time_Start": 735.32, "Time_End": 736.4, "Text": " That's on the same thing."}, {"Time_Start": 737.32, "Time_End": 744.74, "Text": " So we get to the I permutator, which you can see in the ghost virus, C-Perm, as well as in a lot of other zombie viruses."}, {"Time_Start": 746.3, "Time_End": 750.88, "Text": " And here's the pseudocode for that, which basically goes through."}, {"Time_Start": 751.58, "Time_End": 754.98, "Text": " Well, this one's when it's actually kind of shuffling beforehand."}, {"Time_Start": 756.02, "Time_End": 760.56, "Text": " So it just puts the code groups together, puts a jump in after that code group."}, {"Time_Start": 761.2, "Time_End": 762.36, "Text": " And then we come into the code."}, {"Time_Start": 762.38, "Time_End": 767.54, "Text": " this one, which goes to the jump, and it inserts the proper address to jump to the"}, {"Time_Start": 767.54, "Time_End": 770.32, "Text": " next code group in the sequence."}, {"Time_Start": 773.02, "Time_End": 778.26, "Text": " Oh, I also forgot to mention I changed my presentation a little bit, so it's different from the one"}, {"Time_Start": 778.26, "Time_End": 784.6, "Text": " on the CD, but I, yeah, it's just so if you're following you along on a computer, just so you"}, {"Time_Start": 784.6, "Time_End": 786.9, "Text": " don't get lost, I've made a lot of changes."}, {"Time_Start": 788.02, "Time_End": 791.94, "Text": " In the assembler section, the main thing that you have to worry about,"}, {"Time_Start": 792.38, "Time_End": 795.02, "Text": " rather than the whole, like, converting all the stuff,"}, {"Time_Start": 795.1, "Time_End": 798.0, "Text": " is the main thing is to do jump location fixes,"}, {"Time_Start": 799.04, "Time_End": 804.12, "Text": " which so I, your old sit pointer, or your old jump will go to the proper jump"}, {"Time_Start": 804.12, "Time_End": 807.32, "Text": " once it's reassembled in the new program."}, {"Time_Start": 808.8, "Time_End": 814.86, "Text": " And here we usually initialize a couple tables, one that's eight bytes long,"}, {"Time_Start": 814.96, "Time_End": 817.94, "Text": " four bytes for where the new instruction pointer is,"}, {"Time_Start": 818.46, "Time_End": 821.12, "Text": " four bytes for where the old instruction was located,"}, {"Time_Start": 821.92, "Time_End": 822.36, "Text": " and then we have."}, {"Time_Start": 822.38, "Time_End": 827.98, "Text": " have a jump table, which basically lists the offsets of our jumps, jump into the"}, {"Time_Start": 827.98, "Time_End": 832.74, "Text": " instructions so we can check, and they're the older jumps, so you can check these old jumps match."}, {"Time_Start": 833.54, "Time_End": 835.14, "Text": " Now we should change it to this new one."}, {"Time_Start": 837.2, "Time_End": 842.72, "Text": " And basically, that's what this four loop does with the if in it, checks to see, goes through"}, {"Time_Start": 842.72, "Time_End": 848.6, "Text": " if there's still a jump to be processed, it goes to the jump table, and goes through until it hits"}, {"Time_Start": 848.6, "Time_End": 852.36, "Text": " the end, and then an eye comes down and sees if the, the,"}, {"Time_Start": 852.38, "Time_End": 860.62, "Text": " old jump table address is the same as the old jump table address in the EIP table,"}, {"Time_Start": 860.9399999999999, "Time_End": 864.12, "Text": " and then assigns the new one if the old ones match."}, {"Time_Start": 866.0, "Time_End": 871.12, "Text": " Other ideas that have come up about this is one of them was that's been an extremely old"}, {"Time_Start": 871.12, "Time_End": 876.0, "Text": " idea that's been done a lot even, I can't think of any of the DOS viruses, but there have been"}, {"Time_Start": 876.0, "Time_End": 880.0, "Text": " ones that have done that, and it's register exchange."}, {"Time_Start": 881.26, "Time_End": 882.28, "Text": " One generation,"}, {"Time_Start": 882.38, "Time_End": 886.32, "Text": " you have EAX doing all these operations for you."}, {"Time_Start": 886.4399999999999, "Time_End": 890.02, "Text": " Next generation, you may have EBX doing it, which will change."}, {"Time_Start": 890.54, "Time_End": 893.02, "Text": " If you're doing a signature scan, it changes the op code."}, {"Time_Start": 894.04, "Time_End": 899.9, "Text": " Then we have entry point obscuring techniques, which have been fairly popular."}, {"Time_Start": 899.9, "Time_End": 909.42, "Text": " So basically that is when you put a I jump or a call at the host's entrance in the file,"}, {"Time_Start": 909.76, "Time_End": 912.36, "Text": " and then it jumps straight to the FIRIS code."}, {"Time_Start": 912.38, "Time_End": 913.62, "Text": " runs it, jumps back."}, {"Time_Start": 914.6, "Time_End": 919.48, "Text": " And then there was one that's only, I, I, have been seen in the Z-Mist virus, which is unknown"}, {"Time_Start": 919.48, "Time_End": 920.12, "Text": " entry point."}, {"Time_Start": 920.9399999999999, "Time_End": 927.58, "Text": " And what that does is it interjects the virus straight into the stream of code, which this can be done"}, {"Time_Start": 927.58, "Time_End": 934.04, "Text": " with your reassembler after disassembling both the host and the previous generation virus."}, {"Time_Start": 934.98, "Time_End": 940.6, "Text": " And then we have other modules that you see a lot of them, like trash code generation that was"}, {"Time_Start": 940.6, "Time_End": 942.28, "Text": " big during a lot of email."}, {"Time_Start": 942.38, "Time_End": 944.98, "Text": " spreading viruses and worms and whatnot."}, {"Time_Start": 945.36, "Time_End": 952.6, "Text": " And that one can be added, but there's a drawback that will be that your code will keep on"}, {"Time_Start": 952.6, "Time_End": 957.64, "Text": " growing throughout, which what always happens with the garbage code generator."}, {"Time_Start": 958.46, "Time_End": 965.72, "Text": " But also, this can be used to change, like, signatures, and we'll see why this might"}, {"Time_Start": 965.72, "Time_End": 970.68, "Text": " become important with a new type of AV technique that they're thinking of making."}, {"Time_Start": 971.24, "Time_End": 972.32, "Text": " And then we have encryption."}, {"Time_Start": 972.38, "Time_End": 977.08, "Text": " be it polymorphic, be it just regular encryption."}, {"Time_Start": 977.9, "Time_End": 982.2, "Text": " These things are, you can also include them, but you have to be careful how you do it."}, {"Time_Start": 982.2, "Time_End": 988.34, "Text": " So that, say, like, sometimes a flag will be thrown up because you're using a certain technique"}, {"Time_Start": 988.34, "Time_End": 991.86, "Text": " to polymorphically encrypt and decrypt to your virus."}, {"Time_Start": 992.46, "Time_End": 997.54, "Text": " But say a properly done one would be ZMIS is a great example of that one, too, which is one of the"}, {"Time_Start": 997.54, "Time_End": 998.72, "Text": " greater viruses out there."}, {"Time_Start": 999.74, "Time_End": 1002.36, "Text": " And what it does is it acts exactly."}, {"Time_Start": 1002.38, "Time_End": 1008.62, "Text": " like a file that will decompress at runtime when it uses its polymorphic engine."}, {"Time_Start": 1010.32, "Time_End": 1012.8, "Text": " So here comes the start of our AV section."}, {"Time_Start": 1013.34, "Time_End": 1020.86, "Text": " I just wanted to put up this quote from an article about ZMIST that says the metamorphism is something"}, {"Time_Start": 1020.86, "Time_End": 1024.34, "Text": " that's going to be pretty crazy and we need to find out something to do for it."}, {"Time_Start": 1026.66, "Time_End": 1032.36, "Text": " And since ZMIS and I, the I, unexpected entry point, have been raised."}, {"Time_Start": 1032.38, "Time_End": 1037.98, "Text": " written by zombie. I found an article by zombie that shows what the implications of doing"}, {"Time_Start": 1037.98, "Time_End": 1043.5, "Text": " this would be. And you have your variables, and this is basically saying if you're doing a signature"}, {"Time_Start": 1043.5, "Time_End": 1048.5800000000002, "Text": " scan, you have to run through it until you know you're definitely on the virus. You don't"}, {"Time_Start": 1048.5800000000002, "Time_End": 1049.8200000000002, "Text": " know how long that will take."}, {"Time_Start": 1055.18, "Time_End": 1061.18, "Text": " So while I've been mentioning signature scan, so just in case if people don't know, I had like a little slide"}, {"Time_Start": 1061.18, "Time_End": 1066.16, "Text": " to tell you about signature scans, which is basically the oldest technique for virus,"}, {"Time_Start": 1066.96, "Time_End": 1073.24, "Text": " finding viruses, and it's just to check a string of bytes or so forth to see if it matches a"}, {"Time_Start": 1073.24, "Time_End": 1080.1000000000001, "Text": " signature in a database. And if those match, then most likely you have a virus. And there's many other"}, {"Time_Start": 1080.1000000000001, "Time_End": 1087.14, "Text": " things. Say like ZMist is my major example, because that's the one that uses the most metamorphic"}, {"Time_Start": 1087.14, "Time_End": 1089.72, "Text": " techniques as a date that I've seen."}, {"Time_Start": 1089.72, "Time_End": 1098.76, "Text": " and in his, he puts the Z in the DOS header, and that is his mark for, I've infected"}, {"Time_Start": 1098.76, "Time_End": 1103.94, "Text": " that file. So, and these are, you need these marks so you don't constantly infect the same"}, {"Time_Start": 1103.94, "Time_End": 1109.6000000000001, "Text": " file and that's, I, but it's still a constant struggle in between will the virus recognize it,"}, {"Time_Start": 1109.68, "Time_End": 1115.96, "Text": " will the AVs recognize it? And one thing is this one's somewhat ambiguous because a Z is allowed"}, {"Time_Start": 1115.96, "Time_End": 1119.7, "Text": " in that portion of the header. And so that, you know, sometimes the"}, {"Time_Start": 1119.72, "Time_End": 1124.82, "Text": " virus may not infect every file it can, infecting ones that are already"}, {"Time_Start": 1124.82, "Time_End": 1131.46, "Text": " not infected. And at the same time, the AV will look at it and say we're really not sure"}, {"Time_Start": 1131.46, "Time_End": 1139.26, "Text": " this could be a legitimate Z or it could be a Z placed by the virus. And next we come"}, {"Time_Start": 1139.26, "Time_End": 1144.38, "Text": " on to geometric scanning, which I is one of the downfalls of like polymorphism."}, {"Time_Start": 1145.16, "Time_End": 1149.7, "Text": " And I, but we see with the Z-mist it was able to beat it by acting like a,"}, {"Time_Start": 1149.72, "Time_End": 1161.26, "Text": " runtime, I've self-decompressing file. And so in the basically what geometric scan does is"}, {"Time_Start": 1161.26, "Time_End": 1166.26, "Text": " check the size changes in the file so they can say, all right, this is acting like this,"}, {"Time_Start": 1166.32, "Time_End": 1170.78, "Text": " it's acting like that, because the initialized data section's grown this much."}, {"Time_Start": 1173.08, "Time_End": 1178.34, "Text": " And then we have the possible answers because we saw that ZMIST had beaten the previous ones."}, {"Time_Start": 1179.2, "Time_End": 1179.7, "Text": " And one of course."}, {"Time_Start": 1179.72, "Time_End": 1186.08, "Text": " them is to combine various techniques and use kind of a heuristic idea. But this"}, {"Time_Start": 1186.08, "Time_End": 1190.68, "Text": " fail is because it takes a lot of time and nobody's going to run anything if it takes a lot"}, {"Time_Start": 1190.68, "Time_End": 1196.6000000000001, "Text": " of time. And also there's always like anti-emulation debugging and all that type of stuff"}, {"Time_Start": 1196.6000000000001, "Time_End": 1203.0, "Text": " techniques coming out so that some of these techniques will fail, the AV techniques will fail"}, {"Time_Start": 1203.0, "Time_End": 1209.56, "Text": " if they try to use them with these other anti-star, whatever you want to call them techniques"}, {"Time_Start": 1209.56, "Time_End": 1215.9199999999998, "Text": " included. And the second, which is a fairly new one, and I actually was looking"}, {"Time_Start": 1215.9199999999998, "Time_End": 1219.72, "Text": " around the internet and I saw that there's somebody that might be talking about this at the"}, {"Time_Start": 1219.72, "Time_End": 1225.6599999999999, "Text": " virus bulletin conference. And it's to use a shrinker, like we were talking, one of the parts"}, {"Time_Start": 1225.6599999999999, "Time_End": 1232.56, "Text": " of the virus, the shrinker and the de-permutator, so that you can have this virus de-permutated and shrink"}, {"Time_Start": 1232.56, "Time_End": 1238.7, "Text": " to its skeleton. And that's where the executable trash generator being left in there could"}, {"Time_Start": 1238.7, "Time_End": 1245.38, "Text": " help it out because at its skeleton you'll still have op codes that weren't there a generation"}, {"Time_Start": 1245.38, "Time_End": 1252.5800000000002, "Text": " beforehand. And so, yeah, we see the flaws and the answers. They take too long. You're not"}, {"Time_Start": 1252.5800000000002, "Time_End": 1259.46, "Text": " able to do some techniques if they include various ways of programming. And I, but the"}, {"Time_Start": 1259.46, "Time_End": 1267.78, "Text": " shrinker is the closest one we have, so that's what they have to go with. And I, I, I just want"}, {"Time_Start": 1267.78, "Time_End": 1268.5800000000002, "Text": " to include a section."}, {"Time_Start": 1268.7, "Time_End": 1274.7, "Text": " that's why this might be stronger for, compared to other techniques. And trash generation,"}, {"Time_Start": 1274.82, "Time_End": 1280.9, "Text": " of course, you just have worthless code and the virus grows loads and loads every time"}, {"Time_Start": 1280.9, "Time_End": 1286.72, "Text": " it passes a generation. So after a while, a file will get big enough and they'll know that something's"}, {"Time_Start": 1286.72, "Time_End": 1293.26, "Text": " happened. And also in polymorphism, the body, usually, you can always take like a static picture"}, {"Time_Start": 1293.26, "Time_End": 1298.26, "Text": " of the body, or at least portions of the body at times throughout the running of the virus. So"}, {"Time_Start": 1298.7, "Time_End": 1304.54, "Text": " you can know that though it's decrypted now, it's encrypted now, it always has to decrypt itself."}, {"Time_Start": 1304.7, "Time_End": 1307.38, "Text": " So you have the same code once it's decrypted."}, {"Time_Start": 1310.3400000000001, "Time_End": 1317.42, "Text": " Well, I'm sorry, I'm kind of new to the speaking to large crowds, so I might have flew through that too fast."}, {"Time_Start": 1317.52, "Time_End": 1322.26, "Text": " But I just wanted to open the floor to question and answer or anything like that. Yes."}, {"Time_Start": 1322.26, "Time_End": 1327.28, "Text": " Wouldn't most of these viruses be small enough that if you took a snapshot of any part of the body,"}, {"Time_Start": 1327.48, "Time_End": 1328.68, "Text": " that could look the same?"}, {"Time_Start": 1328.7, "Time_End": 1330.7, "Text": " is like another program part?"}, {"Time_Start": 1331.4, "Time_End": 1334.8600000000001, "Text": " Are we talking about the, with the polymorphism?"}, {"Time_Start": 1336.8600000000001, "Time_End": 1339.28, "Text": " It's possible that this could happen,"}, {"Time_Start": 1340.16, "Time_End": 1344.82, "Text": " but I haven't really checked too much into polymorphism to tell you the truth."}, {"Time_Start": 1344.92, "Time_End": 1348.3, "Text": " I just looked at a few techniques and saw what they did,"}, {"Time_Start": 1348.3, "Time_End": 1351.24, "Text": " but I haven't really caught any, like,"}, {"Time_Start": 1351.6000000000001, "Time_End": 1355.56, "Text": " software stuff for doing the"}, {"Time_Start": 1355.56, "Time_End": 1358.68, "Text": " decryption methods for, like, brute forcing the detect."}, {"Time_Start": 1358.7, "Time_End": 1361.7, "Text": " I'm sorry. Yes?"}, {"Time_Start": 1361.7, "Time_End": 1369.7, "Text": " The standard part that files the process of the virus is, can it be detected as a signal,"}, {"Time_Start": 1369.7, "Time_End": 1375.7, "Text": " because you have to be a standard part which is not a drink, that is not the same."}, {"Time_Start": 1375.7, "Time_End": 1377.7, "Text": " Ah."}, {"Time_Start": 1377.7, "Time_End": 1382.7, "Text": " Can it be used to detect that is your virus provider?"}, {"Time_Start": 1382.7, "Time_End": 1385.7, "Text": " Which section were we talking about?"}, {"Time_Start": 1385.7, "Time_End": 1387.7, "Text": " I mean, the part that files the process of the process of the virus."}, {"Time_Start": 1387.7, "Time_End": 1392.14, "Text": " It's the process of the secretive virus during the patient."}, {"Time_Start": 1392.48, "Time_End": 1394.42, "Text": " That's the kind of the same nature of your virus."}, {"Time_Start": 1396.1200000000001, "Time_End": 1397.56, "Text": " I, it's, hmm."}, {"Time_Start": 1398.74, "Time_End": 1402.1000000000001, "Text": " I, I'm sorry, I can't really hear you too well up here,"}, {"Time_Start": 1402.2, "Time_End": 1404.14, "Text": " so I kind of miss pieces, and I think they're important."}, {"Time_Start": 1407.18, "Time_End": 1411.78, "Text": " There is a part that is common to all this, not encrypted,"}, {"Time_Start": 1412.0, "Time_End": 1416.48, "Text": " it's not polymorphic, which is the start of the virus."}, {"Time_Start": 1417.0, "Time_End": 1417.68, "Text": " Is that a secret."}, {"Time_Start": 1417.7, "Time_End": 1422.7, "Text": " that it can be easily recognized from the virus soft or digital."}, {"Time_Start": 1422.7, "Time_End": 1424.7, "Text": " I will, wait."}, {"Time_Start": 1424.7, "Time_End": 1428.7, "Text": " With the eyes, we have to be eyes."}, {"Time_Start": 1428.7, "Time_End": 1429.7, "Text": " Yeah?"}, {"Time_Start": 1429.7, "Time_End": 1430.7, "Text": " Keep the question."}, {"Time_Start": 1430.7, "Time_End": 1434.7, "Text": " I would."}, {"Time_Start": 1434.7, "Time_End": 1441.7, "Text": " Well, this question was, if I recognize it correctly,"}, {"Time_Start": 1441.7, "Time_End": 1445.7, "Text": " is there a static part in metamorphic viruses."}, {"Time_Start": 1445.7, "Time_End": 1446.7, "Text": " They can always be recognized."}, {"Time_Start": 1446.7, "Time_End": 1453.18, "Text": " recognized. And the thing is, is, since I, it can always be randomly expanded or"}, {"Time_Start": 1453.18, "Time_End": 1457.98, "Text": " I permutated, you could step through it, but of course you'll still have different"}, {"Time_Start": 1457.98, "Time_End": 1464.32, "Text": " op codes because of the expander or register exchange type of thing. So that's one,"}, {"Time_Start": 1464.32, "Time_End": 1469.8, "Text": " that's where the strength in is I with this, is that you can change like op"}, {"Time_Start": 1469.8, "Time_End": 1473.92, "Text": " codes, and that's where mainly signatures are strings of op codes."}, {"Time_Start": 1473.92, "Time_End": 1482.8000000000002, "Text": " Do you think that A.B. software is going to have to run down the road of dash tables like"}, {"Time_Start": 1482.8000000000002, "Time_End": 1485.68, "Text": " quick wire to be able to recognize changes?"}, {"Time_Start": 1486.28, "Time_End": 1492.48, "Text": " I'd recognize changes. I haven't looked too much into that, but that sounds like an interesting idea"}, {"Time_Start": 1492.48, "Time_End": 1498.98, "Text": " that could be tried. Because mainly why I've heard is the shrinker idea, which will give you the code skeleton."}, {"Time_Start": 1501.48, "Time_End": 1502.0, "Text": " Yes?"}, {"Time_Start": 1503.92, "Time_End": 1512.16, "Text": " This is how it shows how ridiculous viruses have gotten."}, {"Time_Start": 1512.38, "Time_End": 1519.6200000000001, "Text": " Say like if you have, not even all of the major six I was talking about, but maybe say four of them."}, {"Time_Start": 1520.42, "Time_End": 1527.3600000000001, "Text": " I say like the Z-Miss virus, I remember that being, I want to say around 70, 80 pages or so,"}, {"Time_Start": 1527.4, "Time_End": 1531.16, "Text": " and some of it's also done in C, so, you know, that makes it even bigger."}, {"Time_Start": 1531.8000000000002, "Time_End": 1533.4, "Text": " So it's, I'm sorry."}, {"Time_Start": 1533.92, "Time_End": 1534.88, "Text": " That's a very question."}, {"Time_Start": 1535.88, "Time_End": 1536.0800000000002, "Text": " Okay."}, {"Time_Start": 1537.38, "Time_End": 1538.3000000000002, "Text": " Oh, no, no, go ahead."}, {"Time_Start": 1538.94, "Time_End": 1541.76, "Text": " When you do this sort of, sort of"}, {"Time_Start": 1541.76, "Time_End": 1543.4, "Text": " software, you know,"}, {"Time_Start": 1543.4, "Time_End": 1546.7, "Text": " and the process, that's the extent of"}, {"Time_Start": 1546.7, "Time_End": 1549.44, "Text": " to see that's what you might as your code label."}, {"Time_Start": 1550.3600000000001, "Time_End": 1552.46, "Text": " You see an unoptimized viruses in the compiler?"}, {"Time_Start": 1553.16, "Time_End": 1554.5800000000002, "Text": " Just like what the compiler does."}, {"Time_Start": 1555.26, "Time_End": 1556.64, "Text": " Well, the thing is, is, is"}, {"Time_Start": 1557.3000000000002, "Time_End": 1560.46, "Text": " with this virus basically rewrote something,"}, {"Time_Start": 1560.66, "Time_End": 1561.92, "Text": " or with these viruses,"}, {"Time_Start": 1562.1200000000001, "Time_End": 1563.9, "Text": " the expander is basically an unoptimilar."}, {"Time_Start": 1563.92, "Time_End": 1566.6200000000001, "Text": " which is really funny because, like, you know,"}, {"Time_Start": 1567.8200000000002, "Time_End": 1571.66, "Text": " back, not too long ago, everything had to be optimized for a virus."}, {"Time_Start": 1572.38, "Time_End": 1574.98, "Text": " Nowadays, we're writing things to unoptimize them afterwards."}, {"Time_Start": 1575.28, "Time_End": 1577.5800000000002, "Text": " So it shows that you really don't need optimization"}, {"Time_Start": 1577.5800000000002, "Time_End": 1580.8400000000001, "Text": " because we have so much room to deal with."}, {"Time_Start": 1586.16, "Time_End": 1589.74, "Text": " I, the techniques, it's no specific technique,"}, {"Time_Start": 1589.8400000000001, "Time_End": 1591.8200000000002, "Text": " basically, just looks through, and I, well,"}, {"Time_Start": 1591.8200000000002, "Time_End": 1593.04, "Text": " most of them just look through,"}, {"Time_Start": 1593.04, "Time_End": 1593.9, "Text": " compare it."}, {"Time_Start": 1593.92, "Time_End": 1598.24, "Text": " op codes, because most of them are functions now, and they'll say, like, is this the op code?"}, {"Time_Start": 1598.74, "Time_End": 1600.3000000000002, "Text": " If yes, change it to this."}, {"Time_Start": 1604.3000000000002, "Time_End": 1605.54, "Text": " What about the shrinker?"}, {"Time_Start": 1607.7, "Time_End": 1612.16, "Text": " Yeah, well, yeah, the compression is basically, like, say for an easy example,"}, {"Time_Start": 1612.52, "Time_End": 1617.8200000000002, "Text": " I push EBX, pop ECX becomes, I move ECX,"}, {"Time_Start": 1617.8200000000002, "Time_End": 1619.22, "Text": " comma, EBX."}, {"Time_Start": 1623.92, "Time_End": 1629.16, "Text": " Basically, that's it."}, {"Time_Start": 1630.0800000000002, "Time_End": 1630.4, "Text": " Yes, sir."}, {"Time_Start": 1634.4, "Time_End": 1635.96, "Text": " Did you just give themselves a sample?"}, {"Time_Start": 1637.16, "Time_End": 1638.04, "Text": " Yes, sir."}, {"Time_Start": 1639.26, "Time_End": 1640.1000000000001, "Text": " There's 10."}, {"Time_Start": 1640.54, "Time_End": 1641.24, "Text": " There's 10?"}, {"Time_Start": 1641.68, "Time_End": 1642.16, "Text": " There's 10?"}, {"Time_Start": 1643.24, "Time_End": 1645.92, "Text": " Yeah, I haven't opened up the CD, so I..."}, {"Time_Start": 1645.92, "Time_End": 1646.8000000000002, "Text": " Wow."}, {"Time_Start": 1650.88, "Time_End": 1652.16, "Text": " Are there any other..."}, {"Time_Start": 1652.16, "Time_End": 1652.68, "Text": " Yes, sir."}, {"Time_Start": 1653.92, "Time_End": 1662.46, "Text": " I'm sorry, sir, can you stand up?"}, {"Time_Start": 1662.46, "Time_End": 1666.76, "Text": " Yeah, we tested with techniques and we talked about,"}, {"Time_Start": 1666.76, "Time_End": 1669.92, "Text": " can you have more or less incentive?"}, {"Time_Start": 1669.92, "Time_End": 1672.52, "Text": " What was behavior blockers?"}, {"Time_Start": 1672.52, "Time_End": 1673.92, "Text": " I don't..."}, {"Time_Start": 1673.92, "Time_End": 1674.92, "Text": " I don't..."}, {"Time_Start": 1674.92, "Time_End": 1678.92, "Text": " Like that in defense of the product or um, um,"}, {"Time_Start": 1678.92, "Time_End": 1682.92, "Text": " versus to say we can file this product as well."}, {"Time_Start": 1682.92, "Time_End": 1683.9, "Text": " Yeah, well, I, I would..."}, {"Time_Start": 1683.92, "Time_End": 1691.16, "Text": " The thing with, I, behavior scanners, is if the behavior is found, of course, anything,"}, {"Time_Start": 1691.88, "Time_End": 1695.0600000000002, "Text": " once you see what it will do, you'll know what's happening."}, {"Time_Start": 1695.18, "Time_End": 1700.8000000000002, "Text": " But a lot of times, that takes a lot of time, and then say, like, for emulation,"}, {"Time_Start": 1701.04, "Time_End": 1704.0800000000002, "Text": " sometimes there's ways that people have found to block emulation."}, {"Time_Start": 1704.0800000000002, "Time_End": 1711.46, "Text": " So, you'd be more of, like, a integrity scanner than an integrity scanner."}, {"Time_Start": 1711.9, "Time_End": 1713.9, "Text": " Basically, you're already infected, and that's why."}, {"Time_Start": 1713.92, "Time_End": 1717.1200000000001, "Text": " knows your eye being infected, have been infected."}, {"Time_Start": 1721.52, "Time_End": 1727.4, "Text": " Eye emulation, I, I, I, I don't have my notes on it right now, but there's a few ways to,"}, {"Time_Start": 1727.4, "Time_End": 1733.96, "Text": " if I remember correctly, it's, it's placement of, like, variables, I, below the call."}, {"Time_Start": 1735.42, "Time_End": 1738.68, "Text": " So they, I, and it's, like, one of the hard-coded ones."}, {"Time_Start": 1738.68, "Time_End": 1743.9, "Text": " Like, so if you do, I, I think it's like, usually if you put the address,"}, {"Time_Start": 1743.92, "Time_End": 1748.38, "Text": " you want to put in for your call or jump, and I think it's, if you put in the instruction"}, {"Time_Start": 1748.38, "Time_End": 1754.52, "Text": " to do, like, dollar minus four, so it throws it back up in the instruction, if I remember"}, {"Time_Start": 1754.52, "Time_End": 1760.38, "Text": " correctly, that was one of them. But I don't know, it's, it's been a while since I've read up"}, {"Time_Start": 1760.38, "Time_End": 1761.28, "Text": " too much on that."}, {"Time_Start": 1762.3200000000002, "Time_End": 1771.8200000000002, "Text": " Is there, a good reference? I, let's see, good references. I, I'd basically say, just reading through"}, {"Time_Start": 1771.82, "Time_End": 1778.02, "Text": " code is like the best reference. So sometimes, you know, usually you can find some as commented"}, {"Time_Start": 1778.02, "Time_End": 1783.08, "Text": " where they say this is, this technique being done type of thing. So that, that'd be the best"}, {"Time_Start": 1783.08, "Time_End": 1784.8999999999999, "Text": " start, I'd say, and best reference."}, {"Time_Start": 1785.1, "Time_End": 1793.98, "Text": " So what virus do you know? Currently, I know of some places where you can get, like, viruses that"}, {"Time_Start": 1793.98, "Time_End": 1800.62, "Text": " have the, I, comments in them and so forth, that use anti-emulation. I don't know if, they're still"}, {"Time_Start": 1800.6200000000001, "Time_End": 1805.92, "Text": " fairly new. And, well, usually you can go to the same websites that I access to some of my"}, {"Time_Start": 1805.92, "Time_End": 1815.6000000000001, "Text": " data off of for metamorphism, and they'll talk about that as well. So say, like, let's see,"}, {"Time_Start": 1815.74, "Time_End": 1826.72, "Text": " the zombies website, if you go to his, which is Z0M-B-I-Hose.S-K, and you go to some of his"}, {"Time_Start": 1826.72, "Time_End": 1832.78, "Text": " links, you'll probably find some on his page and some on some of his link pages that you can,"}, {"Time_Start": 1833.16, "Time_End": 1834.24, "Text": " I, look at."}, {"Time_Start": 1840.38, "Time_End": 1845.9, "Text": " Okay. Any more questions?"}, {"Time_Start": 1849.4, "Time_End": 1855.6200000000001, "Text": " Okay. Thank you for coming. Also, I'd like to thank my school, because they're going to, they're going to most"}, {"Time_Start": 1855.6200000000001, "Time_End": 1860.46, "Text": " likely help me pay for some of the trip over here, so I wanted to thank Regis University."}, {"Time_Start": 1861.5200000000002, "Time_End": 1861.92, "Text": " Thank you."}]}