{"segments": [{"Time_Start": 0.0, "Time_End": 16.68, "Text": " Please raise your hand if you're hung over."}, {"Time_Start": 18.88, "Time_End": 19.64, "Text": " Thank you."}, {"Time_Start": 19.96, "Time_End": 21.92, "Text": " Please raise your hand if you wish you were hung over."}, {"Time_Start": 23.92, "Time_End": 24.76, "Text": " Okay, thanks."}, {"Time_Start": 24.8, "Time_End": 25.92, "Text": " This is DefCon, baby."}, {"Time_Start": 26.48, "Time_End": 26.72, "Text": " Okay."}, {"Time_Start": 28.240000000000002, "Time_End": 29.98, "Text": " So I'm going to talk to you about"}, {"Time_Start": 30.0, "Time_End": 35.980000000000004, "Text": " locking down OSX. I've got an OSX machine. I'm only projecting, I've got two laptops, but"}, {"Time_Start": 35.980000000000004, "Time_End": 41.1, "Text": " one of them is on both projectors. So we're going to primarily stay on the slides, and I'll"}, {"Time_Start": 41.1, "Time_End": 47.46, "Text": " demo as we have time and energy and desire. So you guys can indicate desire by shouting"}, {"Time_Start": 47.46, "Time_End": 52.94, "Text": " at me, yelling at me, don't throw things because I know you will. But I'll tell you about"}, {"Time_Start": 52.94, "Time_End": 59.879999999999995, "Text": " basically locking down OSX. I got a nice little OSX machine a while ago, and"}, {"Time_Start": 60.0, "Time_End": 63.72, "Text": " and started playing around it and said, you know, it'd really be nice to have a machine"}, {"Time_Start": 63.72, "Time_End": 69.2, "Text": " that might, you know, I don't know, run word or something like that, or maybe just, you know,"}, {"Time_Start": 69.28, "Time_End": 72.92, "Text": " I could lend it to my girlfriend and it would, she'd like not break it. It'd still be easy"}, {"Time_Start": 72.92, "Time_End": 77.4, "Text": " to use, not the Linux box. But at the same time, wouldn't break itself, Windows style,"}, {"Time_Start": 77.5, "Time_End": 82.53999999999999, "Text": " just, you know, crashing every six to 12 hours like clockwork. So I got one of these"}, {"Time_Start": 82.53999999999999, "Time_End": 87.5, "Text": " things and tried it out, and the first thing I did was locked it down, and you'll see basically"}, {"Time_Start": 87.5, "Time_End": 89.98, "Text": " my experience is in locking it down right here."}, {"Time_Start": 90.0, "Time_End": 96.74, "Text": " Okay, so what I'm going to talk to you about is, first, auditing the operating system and then"}, {"Time_Start": 96.74, "Time_End": 101.48, "Text": " locking the sucker down, and I'll tell you about how we've made best deal Linux do some of this"}, {"Time_Start": 101.48, "Time_End": 107.46000000000001, "Text": " automatically for you. Okay, so what do you get in one hour of lockdown? Well, you don't get,"}, {"Time_Start": 107.9, "Time_End": 111.86, "Text": " you don't get something massively complete, but you do get something probably safe enough to bring"}, {"Time_Start": 111.86, "Time_End": 116.12, "Text": " to DefCon, provided you don't want to, like, use it as a web server. Like, you want to use it as a"}, {"Time_Start": 116.12, "Time_End": 123.74000000000001, "Text": " laptop. Okay. So what are we going to do? Basically, in terms of, in terms of quick lockdown"}, {"Time_Start": 123.74000000000001, "Time_End": 129.84, "Text": " pre-DefCon, and I understand this is post-Defcon, but you know, you still got a good six hours or so"}, {"Time_Start": 129.84, "Time_End": 134.9, "Text": " to get hacked here. What would you be doing? One is that you would stop somebody from coming and booting"}, {"Time_Start": 134.9, "Time_End": 139.36, "Text": " your laptop in a single user mode, starting out as route, changing on your passwords, copying all your"}, {"Time_Start": 139.36, "Time_End": 144.92000000000002, "Text": " data, and then deleting the drive if they feel like it. Okay, that's called boot security. The next thing"}, {"Time_Start": 144.92000000000002, "Time_End": 148.20000000000002, "Text": " you do is actually do what's called a demon audit, the network demon audit. That's"}, {"Time_Start": 148.20000000000002, "Time_End": 152.38000000000002, "Text": " where you're turning off, it's where you're turning off network demons in general and programs"}, {"Time_Start": 152.38000000000002, "Time_End": 156.9, "Text": " in general, that you're not using, that could turn out to be vulnerable later on, and get"}, {"Time_Start": 156.9, "Time_End": 162.86, "Text": " your laptop hacked. Other things you might look at, I'll tell you about these if we've got time,"}, {"Time_Start": 163.22000000000003, "Time_End": 167.74, "Text": " set UID audit, that's where you're looking at the programs on the system that an ordinary user can"}, {"Time_Start": 167.74, "Time_End": 172.52, "Text": " run, where it runs is root, where it gives them root privilege for a specific operation."}, {"Time_Start": 172.86, "Time_End": 174.42000000000002, "Text": " That's things like changing your password."}, {"Time_Start": 174.92000000000002, "Time_End": 191.78000000000003, "Text": " We'll talk about cron jobs, all the shit that runs automatically for you, and then actually talk about the last bit of stuff that we, you know, you don't have time for in one hour, which is actually going and taking the demons that are on the box, like a web server, like a DNS server, and going and configuring it for better security."}, {"Time_Start": 191.9, "Time_End": 196.9, "Text": " That's what you do in a lockdown if you want to do something very complete and comprehensive."}, {"Time_Start": 198.68, "Time_End": 200.34000000000003, "Text": " Okay, so OSX."}, {"Time_Start": 201.10000000000002, "Time_End": 203.46, "Text": " OSX seems to kind of be a hodgepodge of things to me."}, {"Time_Start": 203.46, "Time_End": 209.62, "Text": " I like it. It's useful. It feels like it's got this whole little free BSD infrastructure."}, {"Time_Start": 210.52, "Time_End": 215.06, "Text": " It's got this whole mock kernel going on. Basically, it feels like BSD Unix to me."}, {"Time_Start": 215.46, "Time_End": 225.92000000000002, "Text": " On the other hand, it's got some weird next stuff thrown in, and that seems to be because Apple bought next and brought Steve Jobs, and he was like, hi, we made some stuff. Can we put it in too?"}, {"Time_Start": 226.78, "Time_End": 229.52, "Text": " So you'll see that as we go through."}, {"Time_Start": 231.02, "Time_End": 231.34, "Text": " Okay."}, {"Time_Start": 231.34, "Time_End": 261.26, "Text": " Okay. The thing you need to understand, for the first part, in terms of how any kitty here is, you know, if you leave them with your laptop for 30 seconds, is rooting your laptops to understand how the boot process works. Okay? So basically what goes on is you got your machine and you turn it on and you've got a bootloader. Okay? That's like, that's like bio, it's like your BIOS on a PC machine. Sorry, you've got a, you've got a hardware loader. That's whatever, EPROM here, BIOS."}, {"Time_Start": 261.34000000000003, "Time_End": 265.24, "Text": " Eprom on sun, eProm here, bioson, Intel machines."}, {"Time_Start": 265.42, "Time_End": 268.50000000000006, "Text": " That starts a bootloader. That starts your kernel."}, {"Time_Start": 269.14000000000004, "Time_End": 274.02000000000004, "Text": " Your kernel on this thing is what's called your colonel, your colonel's going to start."}, {"Time_Start": 274.12, "Time_End": 277.48, "Text": " Your colonel's mock. And what mock starts is a process called mock and it."}, {"Time_Start": 278.62, "Time_End": 283.34000000000003, "Text": " Everyone know what an it is? Raise your hand if you know what an it is. Yes, mostly all the way."}, {"Time_Start": 283.44000000000005, "Time_End": 289.16, "Text": " Okay, cool. So mock in it is this weird little process. We're all used to like the kernel starting in it,"}, {"Time_Start": 289.16, "Time_End": 291.32000000000005, "Text": " not just being it. Well, Apple's like,"}, {"Time_Start": 291.34000000000003, "Time_End": 296.50000000000006, "Text": " making things a little weird. So the kernel starts mocking it. And mocking it actually goes and starts a knit."}, {"Time_Start": 297.20000000000005, "Time_End": 306.24, "Text": " And it's like the one, it's like in it's that process. We're all used to being like the first one, or at least it's number one and all the other stuff on the system like get started by an it."}, {"Time_Start": 306.68, "Time_End": 313.70000000000005, "Text": " So the way that works here is init starts, runs, runs RC, runs a script called RC dot boot and a script called RC."}, {"Time_Start": 314.50000000000006, "Time_End": 318.36, "Text": " And then RC dot boot's important for single user mode. We can take a look at it."}, {"Time_Start": 318.36, "Time_End": 322.16, "Text": " RC actually goes and runs a program called system starter."}, {"Time_Start": 322.66, "Time_End": 329.58000000000004, "Text": " And I'll show you that system starter is actually how OSX is kind of RC scripts."}, {"Time_Start": 329.8, "Time_End": 337.24, "Text": " It's, you know, it's the RC3, RC5 type stuff from SIS 5 or, you know, standard RC scripts from BSD."}, {"Time_Start": 337.90000000000003, "Time_End": 340.14, "Text": " Anyway, let's take a look at it."}, {"Time_Start": 340.90000000000003, "Time_End": 348.1, "Text": " What I would do with my Apple laptop if it was up here and you wanted me to and we had lots of time would be,"}, {"Time_Start": 348.36, "Time_End": 353.1, "Text": " I'd hold down that slide, in your slides, that little square box, that's an open apple."}, {"Time_Start": 353.54, "Time_End": 353.8, "Text": " Okay?"}, {"Time_Start": 353.98, "Time_End": 359.24, "Text": " If you take this system and it's turned off and you hold down Open Apple S and you turn it on,"}, {"Time_Start": 360.04, "Time_End": 362.18, "Text": " your system boots directly into single user mode."}, {"Time_Start": 362.84000000000003, "Time_End": 366.46000000000004, "Text": " Okay, this is, you know, if you've forgotten your root password, this is number one way to get it."}, {"Time_Start": 366.84000000000003, "Time_End": 371.42, "Text": " If you find somebody's OSX system sitting on a table, you know, maybe you're at root foo"}, {"Time_Start": 371.42, "Time_End": 374.88, "Text": " and somebody goes off and runs the bathroom, it's like, hey, watch my laptop."}, {"Time_Start": 375.28000000000003, "Time_End": 376.44, "Text": " You're like, sure."}, {"Time_Start": 377.54, "Time_End": 378.02000000000004, "Text": " Okay."}, {"Time_Start": 378.36, "Time_End": 386.72, "Text": " Open Apple S, boom, single user mode, change passwords, create yourself an account, you know, let the thing boot up normally, your buddy gets back."}, {"Time_Start": 386.78000000000003, "Time_End": 396.56, "Text": " It's probably all done in, yeah, two minutes or so. Okay, so this Open Apple S thing, that's not as much fun as you'd think if you're the guy who actually went to the bathroom."}, {"Time_Start": 397.46000000000004, "Time_End": 407.18, "Text": " So if you're the guy who went to the bathroom, what you'd want to do ahead of time was change this RC. boot script to require some kind of authentication before it just let's boot continue."}, {"Time_Start": 407.18, "Time_End": 411.98, "Text": " By the way, if you think this is kind of like a weird little Apple thing, a lot of operating systems do this."}, {"Time_Start": 412.1, "Time_End": 421.24, "Text": " Red Hat's been doing this for years. If you start up a machine and type Linux single, okay, you know, you're the Lilo prompt, you're the Grub prompt, you type Linux single and it drops you to single user mode."}, {"Time_Start": 421.62, "Time_End": 422.58, "Text": " Same basic thing."}, {"Time_Start": 423.08, "Time_End": 429.68, "Text": " And operating system vendor thinks this might be a useful way to handle those calls when somebody calls up and says, I lost my root password. What do I do?"}, {"Time_Start": 430.34000000000003, "Time_End": 432.56, "Text": " Can you all hear me back there? I'm a little hoarse."}, {"Time_Start": 434.04, "Time_End": 436.76, "Text": " In the back you can hear yes. Okay, cool."}, {"Time_Start": 437.18, "Time_End": 441.40000000000003, "Text": " So, what can you do?"}, {"Time_Start": 441.82, "Time_End": 453.86, "Text": " There is, for those of you who've got a machine in the room, something to test would be there is an Etsy TTI's file, and in the XCTY's file, you can find the console line and change it from insecure to secure."}, {"Time_Start": 454.46000000000004, "Time_End": 457.76, "Text": " And theoretically, from what the documentation says, that should fix this."}, {"Time_Start": 457.8, "Time_End": 461.04, "Text": " That should make single user mode inaccessible by that method."}, {"Time_Start": 461.64, "Time_End": 466.02, "Text": " On my build, that does not work, and so I went Googling, and what did I find?"}, {"Time_Start": 466.02, "Time_End": 468.91999999999996, "Text": " I found somebody wrote this script called Secure It."}, {"Time_Start": 469.44, "Time_End": 477.18, "Text": " And what Secureit does is you run this thing's install program, and it inserts a little thing into rc.boot."}, {"Time_Start": 477.47999999999996, "Time_End": 483.85999999999996, "Text": " It says, if this is a single user, if this is a single user boot, then run a program called password.com, which is a PerlScript."}, {"Time_Start": 484.29999999999995, "Time_End": 487.7, "Text": " And that PerlScript, basically, is just going to check a password."}, {"Time_Start": 488.2, "Time_End": 493.26, "Text": " And if you've got the right password, if you've got the right password, then you're allowed through."}, {"Time_Start": 493.34, "Time_End": 494.64, "Text": " And if you're not, it forces a reboot."}, {"Time_Start": 495.28, "Time_End": 495.56, "Text": " Okay."}, {"Time_Start": 496.02000000000004, "Time_End": 502.34000000000003, "Text": " So basically, the way password.PL works is when you install this, it asks you for a password."}, {"Time_Start": 502.78000000000003, "Time_End": 503.72, "Text": " You give it a password."}, {"Time_Start": 503.84000000000003, "Time_End": 504.94000000000005, "Text": " This should not be a root password."}, {"Time_Start": 505.02000000000004, "Time_End": 506.76000000000005, "Text": " It should just be an independent password."}, {"Time_Start": 507.40000000000003, "Time_End": 510.52000000000004, "Text": " It goes and crips the password and stores it."}, {"Time_Start": 510.94000000000005, "Time_End": 514.7800000000001, "Text": " And then whenever someone tries to boot in a single user mode, it asks for that boot password."}, {"Time_Start": 515.24, "Time_End": 517.4200000000001, "Text": " Okay, let's call it that your secure it password."}, {"Time_Start": 518.22, "Time_End": 520.86, "Text": " And so if you, you know, type the right one, you're in."}, {"Time_Start": 520.86, "Time_End": 522.2, "Text": " And if you don't, it reboots."}, {"Time_Start": 523.62, "Time_End": 523.86, "Text": " Okay."}, {"Time_Start": 526.02, "Time_End": 531.6999999999999, "Text": " There's another thing you could do, and I really don't like this so much, but I did find this when I was Googling."}, {"Time_Start": 531.96, "Time_End": 537.34, "Text": " You can actually replace your entire kernel with one that doesn't boot in the single user mode at all."}, {"Time_Start": 537.9399999999999, "Time_End": 542.0, "Text": " Okay, I haven't checked this out. My guess is it basically skips rc.comboot entirely."}, {"Time_Start": 542.9399999999999, "Time_End": 549.46, "Text": " Okay. Go for it if you want to. My problem is that, you know, I have to be assisted in sometimes,"}, {"Time_Start": 549.86, "Time_End": 555.5, "Text": " and having my first hardware failure come up and finding that single user mode is a little hard to get into, a little bit of a pain in the butt."}, {"Time_Start": 556.02, "Time_End": 561.6, "Text": " So I don't know if, you know, I don't know if you want to eradicate single user mode entirely."}, {"Time_Start": 562.0799999999999, "Time_End": 567.02, "Text": " If you're really paranoid mofo, when this is your laptop and you're really concerned, maybe that's something you want to do."}, {"Time_Start": 568.04, "Time_End": 570.48, "Text": " Are there any questions so far? Yeah."}, {"Time_Start": 573.3, "Time_End": 579.18, "Text": " Is there any way to boot disable booting from CD? You'd think I planted him there. Hey, Steve."}, {"Time_Start": 581.74, "Time_End": 582.72, "Text": " Gee, wow."}, {"Time_Start": 586.02, "Time_End": 600.42, "Text": " Thank you. Okay, so the nice thing is that, okay, that single-use mode, it's really great when you can just walk up to a machine, no CD in hand, nothing, no tools, nothing, and just grab root real quick while somebody runs up to the bathroom, even if they're, like, really fast, okay?"}, {"Time_Start": 601.1, "Time_End": 615.84, "Text": " Although the way they put the bathrooms in Lexus Park, it's going to take them 10 minutes to get out there and back. So, supposing that you did have that 10 minutes, and you were carrying around an Apple Boot CD in your pocket, it's kind of cool. You can take the CD, stick it in the drive,"}, {"Time_Start": 616.02, "Time_End": 617.8, "Text": " And what you do is you hold down the option key."}, {"Time_Start": 618.3, "Time_End": 620.18, "Text": " You hold down the option key and turn the machine on."}, {"Time_Start": 620.72, "Time_End": 625.38, "Text": " And what will happen is the Apple will come up, it'll take a little while, but the Apple will come up with a graphical menu."}, {"Time_Start": 625.68, "Time_End": 626.74, "Text": " It'll show your hard disk."}, {"Time_Start": 627.14, "Time_End": 628.34, "Text": " It'll show your CD-ROM."}, {"Time_Start": 628.88, "Time_End": 635.62, "Text": " And if you've got any firewire drives, if you've got any firewire drives plugged in, including, say, an iPod, it'll actually show you that."}, {"Time_Start": 635.68, "Time_End": 637.5, "Text": " Be like, hey, which of these do you want to boot from?"}, {"Time_Start": 638.1, "Time_End": 638.34, "Text": " Okay."}, {"Time_Start": 638.74, "Time_End": 644.9399999999999, "Text": " So the deal is, one of the cool things is that if you do that with the normal, with the install media,"}, {"Time_Start": 644.94, "Time_End": 647.72, "Text": " Okay, normally with install media, you have to have a clue, right?"}, {"Time_Start": 647.82, "Time_End": 648.94, "Text": " You, like, boot from install media."}, {"Time_Start": 649.0, "Time_End": 654.34, "Text": " You have to go and remount the drives, read, right, go and, you know, look at the right password file, et cetera,"}, {"Time_Start": 654.4200000000001, "Time_End": 656.4200000000001, "Text": " change the password file, et cetera."}, {"Time_Start": 656.5400000000001, "Time_End": 662.4000000000001, "Text": " You maybe have to, maybe you'll charute into the, you'll charute into slash mount slash CD and change password from there."}, {"Time_Start": 662.96, "Time_End": 663.36, "Text": " Whatever."}, {"Time_Start": 663.82, "Time_End": 665.0600000000001, "Text": " Here, it's actually nice and easy."}, {"Time_Start": 665.1600000000001, "Time_End": 666.7, "Text": " They actually include a password utility."}, {"Time_Start": 667.5, "Time_End": 671.24, "Text": " So you can take, when you boot from CD, you can go up to this little, nice little menu,"}, {"Time_Start": 672.0, "Time_End": 673.22, "Text": " and you can go to the password utility."}, {"Time_Start": 673.22, "Time_End": 674.9200000000001, "Text": " And it'll be like, hi, which drive do you want?"}, {"Time_Start": 674.94, "Time_End": 680.5200000000001, "Text": " to change the password on. And you're like, this one. And it says, which account? So it doesn't"}, {"Time_Start": 680.5200000000001, "Time_End": 683.34, "Text": " have to be a root account issue. It's like, which account would you like to change the password for?"}, {"Time_Start": 683.34, "Time_End": 688.08, "Text": " And you're like, no, that one. And it's like, okay, what's the new password? You type it in. And"}, {"Time_Start": 688.08, "Time_End": 692.74, "Text": " congratulations is the new password. Now, you could also just boot from CD and, you know, do all the normal"}, {"Time_Start": 692.74, "Time_End": 697.8800000000001, "Text": " food you normally do. But this kind of makes things nice and easy. Again, when you're looking for the 10-minute"}, {"Time_Start": 697.8800000000001, "Time_End": 704.6, "Text": " bathroom break attack, this is excellent. Okay, so what's the countermeasure? Well, the countermeasure. Well, the"}, {"Time_Start": 704.6, "Time_End": 709.5600000000001, "Text": " countermeasure is that the thing was, booting from CD is, you know, one of those pre-bootloader"}, {"Time_Start": 709.5600000000001, "Time_End": 713.5, "Text": " things. This is the firmware. So if the issue is that we were able to talk to the firmware and have it"}, {"Time_Start": 713.5, "Time_End": 718.4200000000001, "Text": " boot from CD or firewire or whatever the hell, then maybe what we want to do is we want to stick a password"}, {"Time_Start": 718.4200000000001, "Time_End": 723.62, "Text": " on firmware. So what you can do is you can boot into firmware. You just, as you're turning the machine on,"}, {"Time_Start": 723.82, "Time_End": 726.82, "Text": " this starts getting easier and easy. And this starts getting harder and harder. You're"}, {"Time_Start": 726.82, "Time_End": 733.5400000000001, "Text": " holding down the option key, the Apple, the open apple key, an O.F or open firmware. Okay. And then"}, {"Time_Start": 733.5400000000001, "Time_End": 734.58, "Text": " once that boots up, you get a"}, {"Time_Start": 734.6, "Time_End": 738.14, "Text": " prompt. And at that prompt, you type password, and it says, hey, what's your password?"}, {"Time_Start": 738.3000000000001, "Time_End": 743.12, "Text": " And you set a boot password. This could be the same one used for secure it. If you're like me,"}, {"Time_Start": 743.14, "Time_End": 747.66, "Text": " you probably use yet another password here, just in case somebody gets root access on the system and"}, {"Time_Start": 747.66, "Time_End": 753.5, "Text": " can read secure its file or whatever. I don't know. Okay. Type in a password. You typed in a password"}, {"Time_Start": 753.5, "Time_End": 760.24, "Text": " for the bootloader, and now you type set end security mode command. Okay. What command means is that"}, {"Time_Start": 760.24, "Time_End": 764.58, "Text": " allow the system to boot normally unless they want to boot from alternate media. And if they want to"}, {"Time_Start": 764.6, "Time_End": 770.4, "Text": " boot from alternate media require a password. Okay. On the other hand, if you want, you can also"}, {"Time_Start": 770.4, "Time_End": 775.12, "Text": " instead of command, you can write full. And what that means is don't freaking boot unless they know the"}, {"Time_Start": 775.12, "Time_End": 780.2, "Text": " password. Don't boot from anything. Just don't boot. Okay. How many people have set this on their"}, {"Time_Start": 780.2, "Time_End": 786.66, "Text": " sunboxes? Full? Full who set full? Okay. Of the people who raised their hands, there aren't that many"}, {"Time_Start": 786.66, "Time_End": 791.78, "Text": " people in the room who raised their hands. Has anybody forgotten both the root password and the EPROM password at the same"}, {"Time_Start": 791.78, "Time_End": 798.9, "Text": " time? Anybody? No one's going to admit to that, huh? You know, if you go on eBay,"}, {"Time_Start": 799.18, "Time_End": 805.0799999999999, "Text": " you will often find a very steady trade in replacement e-proms for sons, because if you forget both the"}, {"Time_Start": 805.0799999999999, "Time_End": 811.48, "Text": " root password and the e-prom password, you know, you might be in a, and you've set it to full,"}, {"Time_Start": 811.5799999999999, "Time_End": 815.68, "Text": " so it won't even boot to a hard drive without this. You're quite possibly going to be in the situation"}, {"Time_Start": 815.68, "Time_End": 820.18, "Text": " where you need to replace the e-prom. People have been doing this for years. eBay's selling tons of these."}, {"Time_Start": 820.56, "Time_End": 821.52, "Text": " Okay, whatever."}, {"Time_Start": 821.78, "Time_End": 826.6, "Text": " When you're done with this set end, either fuller command, type reset all, you reboot the system,"}, {"Time_Start": 826.88, "Time_End": 830.0, "Text": " congratulations, nobody gets to the disc without getting past the password."}, {"Time_Start": 830.52, "Time_End": 833.68, "Text": " Now, the next question is, well, Jay, what's the next, what's the next attack?"}, {"Time_Start": 834.24, "Time_End": 837.0799999999999, "Text": " What's the next attack on the boot process? You know, can you get past this?"}, {"Time_Start": 837.56, "Time_End": 843.76, "Text": " And my answer is, eh, I don't know. Okay, and you say, is he a lamer? And I'm like, yeah, I'm a lamer."}, {"Time_Start": 844.06, "Time_End": 849.16, "Text": " But no, no, no. The issue is, some of you are like, wait a second, how come there has to be an attack?"}, {"Time_Start": 849.28, "Time_End": 851.76, "Text": " And it's like, well, there always will be, right? They'll always."}, {"Time_Start": 851.78, "Time_End": 857.4, "Text": " be another way, there will always be potentially another way to, you know, violate the boot process"}, {"Time_Start": 857.4, "Time_End": 861.72, "Text": " and grab root. That's just, that's just part of operating system security. There's attacks,"}, {"Time_Start": 861.8199999999999, "Time_End": 864.92, "Text": " there's defenses, there's attacks, there's defenses, and somebody freaking clever is coming up"}, {"Time_Start": 864.92, "Time_End": 869.4399999999999, "Text": " with attacks. So when I hear about the next one, maybe I'll come up with a defense or someone else"}, {"Time_Start": 869.4399999999999, "Time_End": 876.66, "Text": " will come up with a defense. Um, what else? What else makes, what else makes apples easier, hard"}, {"Time_Start": 876.66, "Time_End": 878.24, "Text": " to break into? Yeah, question over there."}, {"Time_Start": 881.78, "Time_End": 911.76, "Text": " Sweet. Okay. We have a new, we have a new attack. Okay. I am told by my colleague over there with a nice shiny laptop that you can, you can change the open firmware password. If you just pop open the machine, pop open the machine, adding more RAM, pull out RAM. If you change the amount of RAM, you can change the open firmware password. That sucks."}, {"Time_Start": 911.78, "Time_End": 921.9, "Text": " Let rearrange the RAM."}, {"Time_Start": 921.9, "Time_End": 928.1, "Text": " Excellent."}, {"Time_Start": 928.1, "Time_End": 933.1, "Text": " So, part one, all you've got to do is rearrange the RAM."}, {"Time_Start": 933.1, "Time_End": 935.9, "Text": " Part 2, J, you ignorant slut."}, {"Time_Start": 935.9, "Time_End": 937.5, "Text": " You tried this in the wrong order."}, {"Time_Start": 937.5, "Time_End": 941.76, "Text": " You see, if you set an open firmware password when you try to boot into single user mode, you'll be required"}, {"Time_Start": 941.78, "Time_End": 944.42, "Text": " to submit the open firmware password. Thank you."}, {"Time_Start": 948.66, "Time_End": 952.5, "Text": " Ask these guys. Does this include taking the RAM out and popping it back in? My guess is no,"}, {"Time_Start": 952.66, "Time_End": 955.22, "Text": " but ask these guys. Anybody?"}, {"Time_Start": 959.62, "Time_End": 965.22, "Text": " I'll go over here first. No, you have to move the RAM. Question. Yeah."}, {"Time_Start": 969.78, "Time_End": 971.76, "Text": " Anybody know this? Are there any, oh, are there any, are there any, any, you have to move the RAM?"}, {"Time_Start": 971.78, "Time_End": 974.3399999999999, "Text": " user space tools for modifying open firmware well booted."}, {"Time_Start": 975.4599999999999, "Time_End": 981.78, "Text": " Either in, on any, on it, let's say, let's say, let's broaden the question on any, on any, on any, on any operating system that runs on this platform."}, {"Time_Start": 983.48, "Time_End": 984.3399999999999, "Text": " Now, you've been able to find?"}, {"Time_Start": 987.18, "Time_End": 989.68, "Text": " Right. You can set the password from user space tools."}, {"Time_Start": 991.0799999999999, "Time_End": 993.9599999999999, "Text": " Okay. So, no."}, {"Time_Start": 994.76, "Time_End": 997.36, "Text": " Okay, so what else can you do? What else?"}, {"Time_Start": 999.62, "Time_End": 1001.54, "Text": " So, in terms of boot security,"}, {"Time_Start": 1001.78, "Time_End": 1007.78, "Text": " Apple actually, my laptop came configured with this nice little option by default, and that was that the sucker just logged right in for me."}, {"Time_Start": 1008.04, "Time_End": 1014.42, "Text": " You know, I like, I like started up, I turned the machine on and asked me for a first user, first password, what do they do?"}, {"Time_Start": 1014.4399999999999, "Time_End": 1018.22, "Text": " It was like, okay, cool, and now whenever I turn the machine on, it auto logs in for me."}, {"Time_Start": 1018.52, "Time_End": 1029.46, "Text": " And that's kind of nice. But, you know, again, one of those things where it's like, if you leave this thing turned on, you lock your screen, you step away, somebody walks up, turns the machine off, turns it back on, it comes up, logs directly in as you."}, {"Time_Start": 1029.66, "Time_End": 1031.32, "Text": " That was an easy screen saver hack."}, {"Time_Start": 1031.78, "Time_End": 1041.1399999999999, "Text": " So in terms of turning that back off, in terms of turning auto login off, if you've had it, if you've never turned it off, you can actually do that with a GUI."}, {"Time_Start": 1041.3799999999999, "Time_End": 1050.96, "Text": " You just go to system preferences, accounts, users, and then you've got a little checkbox that says log in automatically as user, and you can specify a user."}, {"Time_Start": 1050.96, "Time_End": 1055.58, "Text": " So if you just turn that off, you're auto login's toast, which is good."}, {"Time_Start": 1056.5, "Time_End": 1061.76, "Text": " Okay. Restart and shut down. If you're out of login prompt, if you're out of login, if you're out of,"}, {"Time_Start": 1061.78, "Time_End": 1067.82, "Text": " if you're at the graphical login thing, okay, this thing will let you, it'll let you cleanly shut down the system and start it back up."}, {"Time_Start": 1067.92, "Time_End": 1071.42, "Text": " Some people think of that as, some people think of that as a weakness, some people don't."}, {"Time_Start": 1071.96, "Time_End": 1080.84, "Text": " Okay. So if you want to change that, system preferences, accounts, login options, and you can click on hide the restart and shut down buttons."}, {"Time_Start": 1081.84, "Time_End": 1086.58, "Text": " Okay. Additionally, there's another way to do this. You can change this in this Etsy TTI's file."}, {"Time_Start": 1086.58, "Time_End": 1091.28, "Text": " You find the console line, and you add in the parameter, power off disabled, yes."}, {"Time_Start": 1091.78, "Time_End": 1121.76, "Text": " Okay. So, doing okay on time. Okay, so in terms of the next thing, that's basically boot security. That's the quickie boot security audit. The next thing to do is to take a look at other programs that are running on the system, and then also network demons that are running on the system. And the network demons are really what's most important to me, because I want to have this, I want to have the, I want to have this system not listening on the network quite so much. Okay. So what I've got is that, remember, we had, we had, we had, we had,"}, {"Time_Start": 1121.78, "Time_End": 1127.74, "Text": " we had the kernel starting Machinit, Machinit started the NIT, and it started RC dot boot and RC."}, {"Time_Start": 1128.34, "Time_End": 1133.26, "Text": " And RC is normally what we think of, you know, as the script that's going to start everything else, okay?"}, {"Time_Start": 1134.3799999999999, "Time_End": 1143.82, "Text": " Parent is in it, but RC runs, RC runs RC.com, and it's going to run RC.com and to do some, to do some general stuff,"}, {"Time_Start": 1144.22, "Time_End": 1149.62, "Text": " and also, importantly to us, to host a file called, I mean, a source of file called Etsy host config."}, {"Time_Start": 1150.58, "Time_End": 1150.86, "Text": " Okay."}, {"Time_Start": 1150.8600000000001, "Time_End": 1153.3000000000002, "Text": " And then what RC does is it runs system starter."}, {"Time_Start": 1153.8600000000001, "Time_End": 1160.3600000000001, "Text": " And system starter is kind of, is kind of the replacement here for the BSD and SIS5 normal boot methods."}, {"Time_Start": 1160.8600000000001, "Time_End": 1161.68, "Text": " And I'll show you that."}, {"Time_Start": 1162.8200000000002, "Time_End": 1169.5600000000002, "Text": " What system starter does, and this kind of, this is, you know, this thing's very BSD, but system starter feels SIS5 to me."}, {"Time_Start": 1169.96, "Time_End": 1172.3200000000002, "Text": " What system starter does is it looks through two directories."}, {"Time_Start": 1172.72, "Time_End": 1176.9, "Text": " And let's just look at that, we're only going to look at the first one here, because the second one is something you're supposed to populate."}, {"Time_Start": 1177.46, "Time_End": 1180.44, "Text": " And that first directory has slash systems, slash library, slash,"}, {"Time_Start": 1180.44, "Time_End": 1185.3600000000001, "Text": " slash startup items, and inside that directory, inside that startup items directory, there'll be"}, {"Time_Start": 1185.3600000000001, "Time_End": 1191.02, "Text": " a script called, you know, say, it'll be a script called, you know, Apache slash Apache."}, {"Time_Start": 1191.26, "Time_End": 1195.3200000000002, "Text": " I mean, there'll be a directory called Apache, and in that directory, it'll be a script called Apache."}, {"Time_Start": 1196.6000000000001, "Time_End": 1201.38, "Text": " And what SystemStor is doing is it's looking at all those subdirectories for scripts of the same"}, {"Time_Start": 1201.38, "Time_End": 1205.94, "Text": " name, and then it's going to run all of them. And actually, you know, SIS 5, they all got run in the"}, {"Time_Start": 1205.94, "Time_End": 1209.0800000000002, "Text": " numerical order, BSD, they all got run in the order that they were in a long script."}, {"Time_Start": 1209.08, "Time_End": 1214.62, "Text": " Okay. Here, System Starter actually determines the order dynamically. And it's kind of cool."}, {"Time_Start": 1215.62, "Time_End": 1225.52, "Text": " Okay. So, basically, if we're looking at System Library, Startup items, Apache, Apache, that directory Apache has some other files in it."}, {"Time_Start": 1225.56, "Time_End": 1230.28, "Text": " And one of those files is startup parameters.p.P.List. And what Startup Parameters.P.L.L."}, {"Time_Start": 1231.32, "Time_End": 1236.08, "Text": " Is it's a bunch of stuff. Let me see if I've got a slide on this."}, {"Time_Start": 1237.22, "Time_End": 1239.06, "Text": " Yeah, I do. Okay. What's start up?"}, {"Time_Start": 1239.08, "Time_End": 1268.58, "Text": " Startupparameters.Pelist has is a bunch of stuff that says, that helps systems sort of decide what order to run this all in. Okay. So we've got a description, Apache Web Server. We've got provides and requires and uses. Provides is, you know, what's going to be, what service, you know, what thing is going to be there for the other things to require and use after we start, after this gets started, requires it's what is what's got to be running before this will go. Okay."}, {"Time_Start": 1269.08, "Time_End": 1299.06, "Text": " uses things that this uses that might be useful to be on, okay? Order preference. Order preference can be none. It can be first. It can be last. It can be early. I think the other one's late. Okay. And what that says is this is roughly when I'd like to go. I'd like to go first. System sort of doesn't have to actually obey any of that order preference stuff. Okay. It can at its own option. So when you're creating scripts of your own, this is kind of the way you're doing this. So in terms of"}, {"Time_Start": 1299.08, "Time_End": 1303.0, "Text": " what order things get run on. That's chosen. That's basically dynamically generated on each boot."}, {"Time_Start": 1304.8, "Time_End": 1313.34, "Text": " Okay. So if you want to start turning this off, like we said before, RC.common gets run by basically every single"}, {"Time_Start": 1313.34, "Time_End": 1318.98, "Text": " system starter script. And that, it does that. Each of the system starter scripts do that so that they can source"}, {"Time_Start": 1318.98, "Time_End": 1326.3799999999999, "Text": " that's, it's that they can source host config. So if you want to turn off demons, you can actually go and hack on the scripts"}, {"Time_Start": 1326.3799999999999, "Time_End": 1329.06, "Text": " yourself, but the preferable way, of course, vendor supported would be."}, {"Time_Start": 1329.08, "Time_End": 1331.08, "Text": " to go and modify Etsy host config."}, {"Time_Start": 1331.56, "Time_End": 1335.28, "Text": " Most of the time we can do that. Some of the stuff we want to turn off, we can't turn off through host config."}, {"Time_Start": 1336.28, "Time_End": 1344.8999999999999, "Text": " Okay. So if we look at, let me see if I've got a slide with this script listed, or whether this was something I was really hoping we had access for."}, {"Time_Start": 1345.9199999999998, "Time_End": 1351.1599999999999, "Text": " Okay. If we look at system library, startup items, NFS, NFS. It's one of the scripts."}, {"Time_Start": 1352.6599999999999, "Time_End": 1358.4399999999998, "Text": " It starts, one of the programs get started is called auto mount. Okay? Auto mount runs,"}, {"Time_Start": 1358.44, "Time_End": 1363.16, "Text": " auto mount is going to run by default, okay, but you can deactivate it by turning off"}, {"Time_Start": 1363.16, "Time_End": 1367.3, "Text": " auto mount, by setting auto mount equals no instead of auto mount equals yes. Okay,"}, {"Time_Start": 1367.64, "Time_End": 1373.52, "Text": " auto mount is just the, it's an NFS, it's an NFS client demon, and you use it if you want to have"}, {"Time_Start": 1373.52, "Time_End": 1380.06, "Text": " NFS, if you want to have given directories mounted remotely from NFS servers as your users use them"}, {"Time_Start": 1380.06, "Time_End": 1386.5800000000002, "Text": " and unmounted whenever they've been idle for a while, okay? So if we're an NFS client, we're going to,"}, {"Time_Start": 1386.5800000000002, "Time_End": 1388.42, "Text": " we might want to keep this on. If we're not an NFS"}, {"Time_Start": 1388.44, "Time_End": 1393.6200000000001, "Text": " client, I want it off, right? If we are an NFS client, I might use this, I might not, I have to"}, {"Time_Start": 1393.6200000000001, "Time_End": 1398.04, "Text": " decide. But in terms of locking it down, that's a good part of what locking down a system is,"}, {"Time_Start": 1398.04, "Time_End": 1406.38, "Text": " is deciding what the system is being used for and adjusting it accordingly. Okay, so what else?"}, {"Time_Start": 1406.7, "Time_End": 1414.3, "Text": " NFS, we've got this script, NFS, NFS, the NFS script. It starts the auto-mounter. It also"}, {"Time_Start": 1414.3, "Time_End": 1418.42, "Text": " starts NFSD and Mountie, but it only starts them if you've actually got,"}, {"Time_Start": 1418.44, "Time_End": 1422.22, "Text": " if you've actually got stuff listed in NCXports, if you're actually exporting directories."}, {"Time_Start": 1422.48, "Time_End": 1428.2, "Text": " That's kind of cool. It's a pretty smart script. Okay? So if you've got stuff in NCXports, or if you're"}, {"Time_Start": 1428.2, "Time_End": 1434.5800000000002, "Text": " actually, if, if NetO info, which we'll talk about later, says that you've got things, it says that you've"}, {"Time_Start": 1434.5800000000002, "Time_End": 1439.24, "Text": " got things that you're exporting and sharing with other systems, then these things run. If they don't,"}, {"Time_Start": 1439.3, "Time_End": 1444.76, "Text": " they don't run. The other weird thing, though, is there's another program that gets run by this"}, {"Time_Start": 1444.76, "Time_End": 1448.42, "Text": " script called NFS IOD. And basically, NFSIOD. And basically, NFS"}, {"Time_Start": 1448.44, "Time_End": 1478.42, "Text": " IOD demon runs whether you like it or not. It runs whether you're an NFS client or not. So you can turn off auto mount. And you can, you know, you can have nothing, you can not have no NFS to share out. But the club, but NFS IOD is a, is an NFS client demon. Okay? And that runs no matter what. There's no way to really turn that off through Etsy host config. Okay. So what we can do, what I do with that particular one is you're actually going to the script and you just"}, {"Time_Start": 1478.44, "Time_End": 1486.28, "Text": " comment the sucker out. Okay, does that, now, now, there's an obvious question if I'm going to go and, if I'm going to go and start modifying start scripts."}, {"Time_Start": 1486.8200000000002, "Time_End": 1488.16, "Text": " What's my obvious question?"}, {"Time_Start": 1490.16, "Time_End": 1494.88, "Text": " Is that goal? Anybody? Sissonman's in the room? What's that?"}, {"Time_Start": 1497.1200000000001, "Time_End": 1501.8, "Text": " What happens when I upgrade? Okay, what happens when I upgrade? The other thing I was looking for is what happens when I patch."}, {"Time_Start": 1502.44, "Time_End": 1508.3600000000001, "Text": " Okay? So when I patch, when I upgrade, there's some very good chance the vendor is going to go and smack"}, {"Time_Start": 1508.44, "Time_End": 1513.66, "Text": " you know, new or updated, or the original boot scripts right back on the system."}, {"Time_Start": 1514.2, "Time_End": 1517.3600000000001, "Text": " And if they do, well, then I'm kind of, you know, I'm kind of, yes."}, {"Time_Start": 1520.92, "Time_End": 1526.48, "Text": " NFS, demon is off by default. NFS client demon's on. NFS IOD. That's on. Right?"}, {"Time_Start": 1527.14, "Time_End": 1532.2, "Text": " If you, I'm sorry? Auto Mouter is."}, {"Time_Start": 1538.44, "Time_End": 1542.68, "Text": " mount is started by default. I know that. Hold on. Let me check my system. You could be right. Let's check."}, {"Time_Start": 1568.44, "Time_End": 1575.7, "Text": " So, on my, on my straight build, I've got auto mount set to yes by default."}, {"Time_Start": 1576.0, "Time_End": 1579.64, "Text": " So it gets started. It might close up. Like, we can go look at the script."}, {"Time_Start": 1598.44, "Time_End": 1615.72, "Text": " This is, this is, I can tell you this is a default install because I rebuilt it last night."}, {"Time_Start": 1616.64, "Time_End": 1617.18, "Text": " I can't."}, {"Time_Start": 1628.44, "Time_End": 1649.0, "Text": " Sorry? I'm sorry? No, 103, right? Which is the 103 is? And I've looked at 103 and actually I've got, I got an install of 103 on a system back at home."}, {"Time_Start": 1650.72, "Time_End": 1658.42, "Text": " This has changed in 1024. Okay, so your fair speaker has his default CD and his default CD. And"}, {"Time_Start": 1658.44, "Time_End": 1661.92, "Text": " And this is 1023. This is what Apple sold me."}, {"Time_Start": 1663.72, "Time_End": 1668.0, "Text": " And I didn't immediately update it. No, I didn't immediately update it because I was looking for issues."}, {"Time_Start": 1669.5, "Time_End": 1671.5800000000002, "Text": " No, I didn't immediately updated the 1024."}, {"Time_Start": 1672.88, "Time_End": 1673.2, "Text": " Okay."}, {"Time_Start": 1676.8, "Time_End": 1677.96, "Text": " Are you guys Apple?"}, {"Time_Start": 1679.24, "Time_End": 1680.48, "Text": " Okay, just checking."}, {"Time_Start": 1682.68, "Time_End": 1685.04, "Text": " Well, who shouted what? I didn't hear."}, {"Time_Start": 1688.44, "Time_End": 1690.0, "Text": " O F minus I."}, {"Time_Start": 1695.88, "Time_End": 1705.3400000000001, "Text": " Yeah, the gentlemen are saying that quite possibly, are you saying on 1024, that I won't have any system, that I won't have anything listening by default there?"}, {"Time_Start": 1705.8200000000002, "Time_End": 1708.3600000000001, "Text": " Or is it on 103 that I won't have anything listening there?"}, {"Time_Start": 1714.1000000000001, "Time_End": 1717.78, "Text": " Okay. I'm not going to argue this if I'm completely and totally wrong."}, {"Time_Start": 1718.44, "Time_End": 1725.8200000000002, "Text": " me after the talk and, you know, heck out, you know, but I don't want to, I've got a 50-minute talk that I've got 22 minutes left of."}, {"Time_Start": 1727.0, "Time_End": 1730.4, "Text": " Okay. Yeah. If I'm an ignorant slut, you can call me on it."}, {"Time_Start": 1735.1200000000001, "Time_End": 1744.46, "Text": " Okay. So, on my reference 1023 system, on a fresh install, NFSIOD starts whether I like it or not. I get multiple instances. I remember that."}, {"Time_Start": 1745.3, "Time_End": 1748.42, "Text": " So I can edit the script to turn this off."}, {"Time_Start": 1748.44, "Time_End": 1753.8200000000002, "Text": " but it's not accessible or it wasn't accessible. Let's stick with, I'll try to stick with past tense, guys."}, {"Time_Start": 1754.28, "Time_End": 1773.72, "Text": " Okay. It wasn't accessible via host config. Okay. I am not busting on the operating system here. I'm just telling you how to harden it. If they're going to come out of the gate, perfect for me, I mean, completely perfect for me, that's great. Okay. Some of them do, but, you know, I don't expect it to. I expect to have to do some amount of configuration on the system."}, {"Time_Start": 1775.88, "Time_End": 1778.26, "Text": " I don't know. I have stuff that I still do to Open VSD."}, {"Time_Start": 1778.44, "Time_End": 1781.96, "Text": " You know, and they've got, you know, they've got a pretty good attitude about this stuff."}, {"Time_Start": 1783.52, "Time_End": 1789.8, "Text": " Okay. If you really wanted to do a thorough audit, I mean, what I encourage, if you really want to do a thorough audit,"}, {"Time_Start": 1789.88, "Time_End": 1794.78, "Text": " you should read your boot script start to finish. I mean, you should just go through and basically trace what the"}, {"Time_Start": 1794.78, "Time_End": 1799.44, "Text": " system's starting, when it's starting, if it's starting, et cetera. Okay, if you want to do a thorough audit,"}, {"Time_Start": 1799.52, "Time_End": 1806.3200000000002, "Text": " that's what you do. Okay. What we're going to do is go and change Etsy host config, turn stuff off that we want off,"}, {"Time_Start": 1806.3200000000002, "Time_End": 1808.42, "Text": " and then go and look at, you know, if we're going to do."}, {"Time_Start": 1808.44, "Time_End": 1809.64, "Text": " you want it to reboot, whatever."}, {"Time_Start": 1811.04, "Time_End": 1816.8600000000001, "Text": " Look at what's still running at that point, and go and find out how that got started and turn that off."}, {"Time_Start": 1817.3600000000001, "Time_End": 1817.56, "Text": " Okay."}, {"Time_Start": 1817.72, "Time_End": 1820.16, "Text": " That's kind of the applied and quick audit."}, {"Time_Start": 1820.46, "Time_End": 1820.64, "Text": " Okay."}, {"Time_Start": 1820.8, "Time_End": 1824.42, "Text": " If I look at this file, what do I have it's on?"}, {"Time_Start": 1824.5, "Time_End": 1827.9, "Text": " Auto mounters, the auto mounters on by default in 1023."}, {"Time_Start": 1828.46, "Time_End": 1829.78, "Text": " Okay, I can turn that off."}, {"Time_Start": 1830.3400000000001, "Time_End": 1831.22, "Text": " What else is on?"}, {"Time_Start": 1831.6200000000001, "Time_End": 1836.46, "Text": " Okay, well, I'm just want to just show you, we've got cups on, we've got IPV6, so I'm going to turn that off."}, {"Time_Start": 1836.8, "Time_End": 1838.42, "Text": " Net Info server set to automatic."}, {"Time_Start": 1838.44, "Time_End": 1840.42, "Text": " RPC service sets automatic."}, {"Time_Start": 1840.5800000000002, "Time_End": 1842.14, "Text": " Time sync is set to yes."}, {"Time_Start": 1843.1000000000001, "Time_End": 1844.74, "Text": " So we can look at each of those."}, {"Time_Start": 1845.7, "Time_End": 1848.5800000000002, "Text": " So the first thing is we know we can set our automount to know."}, {"Time_Start": 1849.1000000000001, "Time_End": 1851.3, "Text": " We know we can set automount to know if we're not using that."}, {"Time_Start": 1852.38, "Time_End": 1852.5800000000002, "Text": " Okay."}, {"Time_Start": 1852.8, "Time_End": 1853.3200000000002, "Text": " What else?"}, {"Time_Start": 1853.44, "Time_End": 1857.94, "Text": " Well, we've got a variable called Cups, and what Cups does is it's actually controlling whether"}, {"Time_Start": 1857.94, "Time_End": 1861.18, "Text": " printing services, printing services runs Cups D by default or not."}, {"Time_Start": 1861.78, "Time_End": 1862.02, "Text": " Okay."}, {"Time_Start": 1863.1200000000001, "Time_End": 1866.4, "Text": " If we are not printing from this system, if we're not ever, you know,"}, {"Time_Start": 1866.4, "Time_End": 1868.42, "Text": " if this is a machine that's serving as a little,"}, {"Time_Start": 1868.44, "Time_End": 1873.16, "Text": " web server, you know, I know this is a laptop, but suppose for a second it's a little"}, {"Time_Start": 1873.16, "Time_End": 1876.92, "Text": " machine that's serving as a web server in my dorm room, you know, it's not doing anything else,"}, {"Time_Start": 1877.3, "Time_End": 1881.94, "Text": " I might turn off printing. If I want to turn off printing, that's easy enough. I can change the"}, {"Time_Start": 1881.94, "Time_End": 1887.26, "Text": " Cups variable. Okay, I can run that script. I can run the printing services, printing services"}, {"Time_Start": 1887.26, "Time_End": 1892.78, "Text": " with stop. Okay, and that'll stop. If I want, I can, what I really should do to make sure that"}, {"Time_Start": 1892.78, "Time_End": 1896.3600000000001, "Text": " it's really going to be off on the next boot is I should change that variable and I should pass it"}, {"Time_Start": 1896.3600000000001, "Time_End": 1898.24, "Text": " restart so that it stops."}, {"Time_Start": 1898.44, "Time_End": 1903.42, "Text": " Or I can pass it stop, make sure it's off, then run start, to make sure that when the script"}, {"Time_Start": 1903.42, "Time_End": 1906.48, "Text": " gets started, that COPSD doesn't actually run."}, {"Time_Start": 1907.1000000000001, "Time_End": 1909.14, "Text": " And that's what I'd say is the safest thing to do here."}, {"Time_Start": 1910.38, "Time_End": 1910.74, "Text": " Okay."}, {"Time_Start": 1913.5, "Time_End": 1919.6000000000001, "Text": " So I've got a typo on this slide, updated slides on the web, on the, on the, on the DefCon website."}, {"Time_Start": 1920.06, "Time_End": 1924.8200000000002, "Text": " NetInfo service is another variable, and I don't remember the script name that it's actually"}, {"Time_Start": 1924.8200000000002, "Time_End": 1927.94, "Text": " looking at, but basically controls web."}, {"Time_Start": 1928.44, "Time_End": 1930.78, "Text": " whether NI, basically, this,"}, {"Time_Start": 1931.8200000000002, "Time_End": 1934.6200000000001, "Text": " Net Info service is going to control whether N-I-Bind-D"}, {"Time_Start": 1934.6200000000001, "Time_End": 1938.3600000000001, "Text": " or Net-Info-D gets started, okay?"}, {"Time_Start": 1938.44, "Time_End": 1941.94, "Text": " And if it's set to automatic, it starts N-I-Bind-D,"}, {"Time_Start": 1943.26, "Time_End": 1945.44, "Text": " if I actually need to, if I actually need to offer net-in-if,"}, {"Time_Start": 1945.52, "Time_End": 1948.0800000000002, "Text": " if I actually need to get net-info information off the network,"}, {"Time_Start": 1948.9, "Time_End": 1951.74, "Text": " okay, and starts net-info-D if I don't."}, {"Time_Start": 1952.3400000000001, "Time_End": 1955.6000000000001, "Text": " Okay, if you've got an OSX system, to my knowledge,"}, {"Time_Start": 1955.6000000000001, "Time_End": 1958.04, "Text": " what you're doing is all your passive information,"}, {"Time_Start": 1958.04, "Time_End": 1960.1599999999999, "Text": " or shadow information, exports, et cetera."}, {"Time_Start": 1960.36, "Time_End": 1962.22, "Text": " This is all maintained through NetInfo."}, {"Time_Start": 1962.92, "Time_End": 1964.6599999999999, "Text": " Okay, I don't know tons about NetInfo."}, {"Time_Start": 1964.76, "Time_End": 1965.68, "Text": " I know it came from next."}, {"Time_Start": 1965.8, "Time_End": 1967.02, "Text": " I know it's a useful thing."}, {"Time_Start": 1967.28, "Time_End": 1968.84, "Text": " I know it smells like NIS to me."}, {"Time_Start": 1970.06, "Time_End": 1972.78, "Text": " I know that my system basically requires it."}, {"Time_Start": 1973.1599999999999, "Time_End": 1974.32, "Text": " Okay, I can't turn it off."}, {"Time_Start": 1978.3999999999999, "Time_End": 1979.12, "Text": " What else?"}, {"Time_Start": 1979.44, "Time_End": 1980.1, "Text": " Time sync."}, {"Time_Start": 1980.6599999999999, "Time_End": 1981.86, "Text": " Okay, that time sync variable."}, {"Time_Start": 1981.86, "Time_End": 1984.22, "Text": " It controls whether this system runs,"}, {"Time_Start": 1984.62, "Time_End": 1986.36, "Text": " whether this system runs NTP,"}, {"Time_Start": 1987.06, "Time_End": 1988.02, "Text": " and whether it's actually"}, {"Time_Start": 1988.04, "Time_End": 1991.1399999999999, "Text": " updating, whether it's actually updating time very precisely."}, {"Time_Start": 1991.86, "Time_End": 1994.72, "Text": " Okay, you might turn this off if you're really paranoid,"}, {"Time_Start": 1994.72, "Time_End": 1996.52, "Text": " if you're running around a hacker conference, whatever."}, {"Time_Start": 1997.3799999999999, "Time_End": 2002.04, "Text": " On the other hand, if you're, you know, if you're looking at IDS logs and firewall logs"}, {"Time_Start": 2002.04, "Time_End": 2005.26, "Text": " and machines that have been broken into and you want to correlate all the information you got"}, {"Time_Start": 2005.26, "Time_End": 2011.3799999999999, "Text": " out of that, okay, or even, you know, in the case of a penetration, or even you just want to see,"}, {"Time_Start": 2011.68, "Time_End": 2015.96, "Text": " hey, one of the, it looks like one of the servers is down and see what time and events happen"}, {"Time_Start": 2015.96, "Time_End": 2017.7, "Text": " and see that in multiple logs at different places."}, {"Time_Start": 2018.04, "Time_End": 2023.0, "Text": " You really may very much want time sync, and you may want time, you may want your time synchronized very closely."}, {"Time_Start": 2023.52, "Time_End": 2025.08, "Text": " So, it's kind of your call."}, {"Time_Start": 2025.48, "Time_End": 2029.1, "Text": " If I'm running around DefCon, you know, I probably shut this off."}, {"Time_Start": 2029.6399999999999, "Time_End": 2034.22, "Text": " If I'm not, you know, if I'm in my normal operational environment, I'd probably leave it on."}, {"Time_Start": 2034.34, "Time_End": 2035.72, "Text": " It's all depending on your paranoia."}, {"Time_Start": 2037.6, "Time_End": 2037.92, "Text": " Okay."}, {"Time_Start": 2038.48, "Time_End": 2042.24, "Text": " So if I'm going through and as I'm shutting these down, I can either do one of two things."}, {"Time_Start": 2042.32, "Time_End": 2045.7, "Text": " I can do, I can go and run the stop scripts or I can reboot the system."}, {"Time_Start": 2046.2, "Time_End": 2047.1599999999999, "Text": " Once I'm done,"}, {"Time_Start": 2048.04, "Time_End": 2053.04, "Text": " Once I'm done with that, what I want to do is start this thing back up and see what's left."}, {"Time_Start": 2053.54, "Time_End": 2053.7799999999997, "Text": " Okay?"}, {"Time_Start": 2053.94, "Time_End": 2058.32, "Text": " And I can run PS and look at all the processes that are left and start deciding whether I want them or not."}, {"Time_Start": 2058.82, "Time_End": 2059.04, "Text": " Okay."}, {"Time_Start": 2059.2, "Time_End": 2063.96, "Text": " The first one that caught my eye, when I looked at a PS listing on a 1023 system,"}, {"Time_Start": 2064.2599999999998, "Time_End": 2067.36, "Text": " and this will not show up, 1024, it went away, right?"}, {"Time_Start": 2068.1, "Time_End": 2069.3, "Text": " 1024 or 103?"}, {"Time_Start": 2069.7799999999997, "Time_End": 2071.02, "Text": " They stop INATD listening."}, {"Time_Start": 2072.0, "Time_End": 2072.3, "Text": " Okay."}, {"Time_Start": 2073.44, "Time_End": 2074.1, "Text": " That's cool."}, {"Time_Start": 2077.2, "Time_End": 2077.88, "Text": " Debating that?"}, {"Time_Start": 2078.04, "Time_End": 2081.58, "Text": " Still listening?"}, {"Time_Start": 2081.8, "Time_End": 2089.02, "Text": " Okay, well, so, INETD, if we look at the IP services script, IP services starts both INED and X-D and X-in-D."}, {"Time_Start": 2089.6, "Time_End": 2089.82, "Text": " Okay?"}, {"Time_Start": 2090.62, "Time_End": 2093.84, "Text": " X-in-D and X-N-D is a replacement for X-I-N-D."}, {"Time_Start": 2094.0, "Time_End": 2097.62, "Text": " They can both run at the same time on a system, as long as they listen on separate ports."}, {"Time_Start": 2098.3, "Time_End": 2101.62, "Text": " So Apple, by default, has a really nice defaults here."}, {"Time_Start": 2102.0, "Time_End": 2104.64, "Text": " In-N-D's got every single line commented out."}, {"Time_Start": 2104.64, "Time_End": 2106.86, "Text": " If you grep that file for non-commented lines,"}, {"Time_Start": 2106.86, "Time_End": 2109.54, "Text": " I don't think you even get any blank lines."}, {"Time_Start": 2109.6, "Time_End": 2110.88, "Text": " I think it's actually a perfect file."}, {"Time_Start": 2111.96, "Time_End": 2114.3, "Text": " Okay, but there's nothing in IND's configuration file."}, {"Time_Start": 2114.8, "Time_End": 2118.96, "Text": " And everything that XIND is supposed to listen for, that's all turned off by default, too."}, {"Time_Start": 2119.48, "Time_End": 2123.76, "Text": " It turns out that XINAD, you know, if it's got nothing to run, it immediately exits."}, {"Time_Start": 2124.2400000000002, "Time_End": 2129.48, "Text": " IND, if it's got nothing to run, it, you know, keeps running, but it's actually not listening"}, {"Time_Start": 2129.48, "Time_End": 2130.1200000000003, "Text": " on any ports."}, {"Time_Start": 2130.6800000000003, "Time_End": 2132.92, "Text": " So it's not that IND is listening."}, {"Time_Start": 2132.92, "Time_End": 2136.84, "Text": " It's just that it's kind of running, taking up a couple cycles here and there."}, {"Time_Start": 2136.86, "Time_End": 2142.1800000000003, "Text": " So this isn't, again, something that I can control through host config."}, {"Time_Start": 2142.78, "Time_End": 2147.96, "Text": " So the best thing I can think of as far as INATD goes, sorry, this is our slide."}, {"Time_Start": 2148.2400000000002, "Time_End": 2152.6800000000003, "Text": " The best thing I can do as far as INADD goes is to maybe write some shell code, and that shell code"}, {"Time_Start": 2152.6800000000003, "Time_End": 2157.1400000000003, "Text": " that's at the bottom of there, it's not the most, you know, it's not, you could do something"}, {"Time_Start": 2157.1400000000003, "Time_End": 2159.0, "Text": " that was a lot smarter than this, okay?"}, {"Time_Start": 2159.32, "Time_End": 2163.52, "Text": " But what I've done is basically, you know, you could wrap it in some shell code so that IND only"}, {"Time_Start": 2163.52, "Time_End": 2164.82, "Text": " only runs if there's something in the file."}, {"Time_Start": 2165.84, "Time_End": 2166.8, "Text": " Okay, that's a dee only runs if there's something in the file."}, {"Time_Start": 2166.86, "Time_End": 2171.58, "Text": " thing to do. If you know that you're going to be admitting this system, and, you know, you just"}, {"Time_Start": 2171.58, "Time_End": 2177.96, "Text": " want to, if you want to, what I would do is, you know, you could comment IND out entirely and turn"}, {"Time_Start": 2177.96, "Time_End": 2184.26, "Text": " it back on if you want to, you know, you could put an exit, you could put an exit to top of the script."}, {"Time_Start": 2184.9, "Time_End": 2188.96, "Text": " Again, did we ever solve the question of what we were going to do if our, if we ever solved"}, {"Time_Start": 2188.96, "Time_End": 2191.52, "Text": " the question of what we're going to do when we went in hand-ededited scripts that were possibly"}, {"Time_Start": 2191.52, "Time_End": 2196.7000000000003, "Text": " going to be replaced by the vendor on a patch or on an upgrade? And the patch is what I'm really"}, {"Time_Start": 2196.7000000000003, "Time_End": 2203.0400000000004, "Text": " concerned about because I, because, you know, I'm going to patch often, right? So, what's going on?"}, {"Time_Start": 2203.1200000000003, "Time_End": 2208.0200000000004, "Text": " Well, if I go and modify scripts and I want to make sure that my changes stay, when the vendor,"}, {"Time_Start": 2208.0200000000004, "Time_End": 2212.7000000000003, "Text": " when the vendor comes around and brings me patches, my best bet is I go and automate this."}, {"Time_Start": 2213.0600000000004, "Time_End": 2217.4, "Text": " I mean, you know, once you've locked down, once you've done this to one system, even if you only have one,"}, {"Time_Start": 2217.4600000000005, "Time_End": 2222.6000000000004, "Text": " you might put together a tiny script that you can run after you, after you apply patches that will"}, {"Time_Start": 2222.6000000000004, "Time_End": 2226.5400000000004, "Text": " go and make these, make your hand changes again. Okay? I would definitely,"}, {"Time_Start": 2226.7000000000003, "Time_End": 2230.9, "Text": " try to automate this. That's the best thing that I can think of. If you're using, you know,"}, {"Time_Start": 2230.92, "Time_End": 2235.4600000000005, "Text": " if you're using something at your site already like CF Engine, okay, or some other solution,"}, {"Time_Start": 2235.5600000000004, "Time_End": 2241.2000000000003, "Text": " you can use that, some kind of automation that brings you back after patches. If anybody else"}, {"Time_Start": 2241.2000000000003, "Time_End": 2246.8, "Text": " has any easy solutions for this, let me know. What's that? In the back?"}, {"Time_Start": 2256.7000000000003, "Time_End": 2258.82, "Text": " What's that?"}, {"Time_Start": 2261.7400000000002, "Time_End": 2265.2000000000003, "Text": " Binaries are placed on the patch. What if the binaries are placed on the patch? Good point."}, {"Time_Start": 2267.3, "Time_End": 2270.2000000000003, "Text": " So the install all overwrite your binary. I mean, it's, you know."}, {"Time_Start": 2272.5800000000004, "Time_End": 2273.1800000000003, "Text": " What's that?"}, {"Time_Start": 2279.26, "Time_End": 2280.1400000000003, "Text": " S-change."}, {"Time_Start": 2282.6200000000003, "Time_End": 2286.5400000000004, "Text": " Yeah, it's just like an immutable bed or a locked bit. Yeah. So, S-change bit. Yeah. So, S-change bit."}, {"Time_Start": 2286.7000000000003, "Time_End": 2289.1800000000003, "Text": " How does my installer react to that?"}, {"Time_Start": 2291.1400000000003, "Time_End": 2292.42, "Text": " Okay, so we don't know."}, {"Time_Start": 2294.34, "Time_End": 2295.76, "Text": " Okay, XinadD."}, {"Time_Start": 2296.0200000000004, "Time_End": 2298.7000000000003, "Text": " InadD.com was empty of anything."}, {"Time_Start": 2299.4, "Time_End": 2301.78, "Text": " If we want to look at XNADD and see the same thing,"}, {"Time_Start": 2302.32, "Time_End": 2305.92, "Text": " we just look at, this is a sample XINatD configuration file."}, {"Time_Start": 2306.34, "Time_End": 2308.9600000000005, "Text": " If you look at them all, they all have a disable line,"}, {"Time_Start": 2309.0400000000004, "Time_End": 2310.1800000000003, "Text": " and the disable line sets yes."}, {"Time_Start": 2310.26, "Time_End": 2312.5600000000004, "Text": " We know in IND.comf, if every line's commented out,"}, {"Time_Start": 2312.9600000000005, "Time_End": 2314.1200000000003, "Text": " nothing's going to get listened on."}, {"Time_Start": 2314.4, "Time_End": 2316.6800000000003, "Text": " With XINEDD, we're looking for disabled lines."}, {"Time_Start": 2316.7000000000003, "Time_End": 2318.92, "Text": " If there's no disable line, the service gets run."}, {"Time_Start": 2319.4600000000005, "Time_End": 2323.0800000000004, "Text": " If there is a disable line and it's yes, the service doesn't get run."}, {"Time_Start": 2323.6400000000003, "Time_End": 2330.6200000000003, "Text": " So if we look through on our reference system, we find that X-Inat-D has got every single thing"}, {"Time_Start": 2330.6200000000003, "Time_End": 2334.34, "Text": " in Etsy, X-NadD.D, every single file's got disabled equals yes,"}, {"Time_Start": 2334.42, "Time_End": 2336.7000000000003, "Text": " then we know it's off and we don't worry about it."}, {"Time_Start": 2339.7000000000003, "Time_End": 2340.5000000000005, "Text": " Next slide."}, {"Time_Start": 2340.9800000000005, "Time_End": 2341.1800000000003, "Text": " Okay."}, {"Time_Start": 2341.6800000000003, "Time_End": 2346.1800000000003, "Text": " So if we're looking at our PS listing, we look at what other programs are left."}, {"Time_Start": 2346.7000000000003, "Time_End": 2347.5600000000004, "Text": " We're doing something quick."}, {"Time_Start": 2348.2400000000002, "Time_End": 2351.3, "Text": " One of the other things that stands out is auto-disc mount."}, {"Time_Start": 2351.9, "Time_End": 2353.0200000000004, "Text": " Okay, what's auto-disc mount for?"}, {"Time_Start": 2353.1000000000004, "Time_End": 2354.6800000000003, "Text": " Auto-disc mount's actually pretty darn useful."}, {"Time_Start": 2355.2000000000003, "Time_End": 2359.6400000000003, "Text": " Okay, auto-disc mount is I take my CD-ROM, I stick it in the drive,"}, {"Time_Start": 2359.9800000000005, "Time_End": 2360.92, "Text": " it mounts up automatically."}, {"Time_Start": 2361.0600000000004, "Time_End": 2361.84, "Text": " It appears on there."}, {"Time_Start": 2362.28, "Time_End": 2363.9, "Text": " It appears on my screen."}, {"Time_Start": 2364.0000000000005, "Time_End": 2364.7200000000003, "Text": " I can click on it."}, {"Time_Start": 2364.7200000000003, "Time_End": 2367.36, "Text": " I can get a finder listing of it, et cetera."}, {"Time_Start": 2368.28, "Time_End": 2369.32, "Text": " What else is it for?"}, {"Time_Start": 2369.76, "Time_End": 2370.88, "Text": " Well, it's for floppies, yes."}, {"Time_Start": 2371.0400000000004, "Time_End": 2372.4800000000005, "Text": " But what else is it for on top of that?"}, {"Time_Start": 2372.8, "Time_End": 2375.9800000000005, "Text": " Well, if I'm downloading disk image files,"}, {"Time_Start": 2376.7000000000003, "Time_End": 2380.34, "Text": " Okay, one of the big ways you install softwares, you download a disk image file, you click on it,"}, {"Time_Start": 2380.5200000000004, "Time_End": 2385.4600000000005, "Text": " and it basically comes up as, you know, as if you were mounting a little, as if you were mounting an external hard drive,"}, {"Time_Start": 2385.5200000000004, "Time_End": 2387.1400000000003, "Text": " except it's not, it's just a disc image file."}, {"Time_Start": 2387.4600000000005, "Time_End": 2388.7200000000003, "Text": " It feels like an ISO to me."}, {"Time_Start": 2389.5600000000004, "Time_End": 2395.82, "Text": " But, you know, if I've got a disk image file, auto-disc mounts what's actually opening that up for me."}, {"Time_Start": 2396.26, "Time_End": 2401.1200000000003, "Text": " Okay, what's showing that as a, as a, what's mounting that for me,"}, {"Time_Start": 2401.1800000000003, "Time_End": 2404.4, "Text": " and so that I can just pop it up, see a directory and get, and have it nice and easy."}, {"Time_Start": 2404.7400000000002, "Time_End": 2405.1800000000003, "Text": " Okay."}, {"Time_Start": 2405.5800000000004, "Time_End": 2406.6800000000003, "Text": " Again, whether I lead that."}, {"Time_Start": 2406.7000000000003, "Time_End": 2411.2400000000002, "Text": " this on or not, depends on how I'm using the system. Okay, if this system is, you know,"}, {"Time_Start": 2411.2400000000002, "Time_End": 2415.6400000000003, "Text": " if I want to, I can turn off auto-disc mount between times when I'm using that functionality."}, {"Time_Start": 2416.42, "Time_End": 2423.94, "Text": " Okay, or I can leave it in place. What else? DNS responder, MDNS responder,"}, {"Time_Start": 2423.94, "Time_End": 2430.0400000000004, "Text": " multicaster. So, okay, we talked about auto-disc mount, and if you wanted to turn off auto-disc"}, {"Time_Start": 2430.0400000000004, "Time_End": 2436.6800000000003, "Text": " mount, okay, you can basically just go into disks, into the disk script and comment it out. Again,"}, {"Time_Start": 2436.7000000000003, "Time_End": 2440.9800000000005, "Text": " that's one of those things that's not host config accessible in 1023, okay?"}, {"Time_Start": 2442.1400000000003, "Time_End": 2448.9600000000005, "Text": " MDNS responder used for rendezvous, okay, rendezvous, what's rendezvous do? Who knows what rendezvous does?"}, {"Time_Start": 2449.2200000000003, "Time_End": 2454.1400000000003, "Text": " I know you guys do. Here, anybody? Anybody? Anybody? Yeah."}, {"Time_Start": 2466.7000000000003, "Time_End": 2479.5800000000004, "Text": " Okay, automatic coast discovery, it's basically his way of finding people to chat with, to do I-chat, okay, finding people who are on the local area land."}, {"Time_Start": 2481.7200000000003, "Time_End": 2482.94, "Text": " I'm sorry, I can't hear you."}, {"Time_Start": 2483.76, "Time_End": 2485.34, "Text": " Very nice for iTunes sharing."}, {"Time_Start": 2485.4600000000005, "Time_End": 2487.78, "Text": " Anybody else have favorite things they're doing with rendezvous?"}, {"Time_Start": 2489.6600000000003, "Time_End": 2490.34, "Text": " I'm sorry?"}, {"Time_Start": 2490.76, "Time_End": 2494.28, "Text": " Hydra. Hydra."}, {"Time_Start": 2495.4800000000005, "Time_End": 2496.6800000000003, "Text": " I didn't know about that one."}, {"Time_Start": 2496.7000000000003, "Time_End": 2499.7000000000003, "Text": " What's Hydra do? What's Hydro do?"}, {"Time_Start": 2501.7000000000003, "Time_End": 2504.84, "Text": " Everyone can work on the document at the same time. They're just on the local area land?"}, {"Time_Start": 2505.9600000000005, "Time_End": 2516.78, "Text": " Wow. Okay. So, as far as, as far as, as far as, as far as rendezvous goes, sounds like really useful functionality. I'm scared out of my, I'm scared on my, I'm scared on my wits having this on at DefCon."}, {"Time_Start": 2518.0000000000005, "Time_End": 2526.6800000000003, "Text": " So if you also are scared, thank you. If you also were scared, you can turn that off by comment."}, {"Time_Start": 2526.7000000000003, "Time_End": 2528.7000000000003, "Text": " or deleting it out of MDNS responder."}, {"Time_Start": 2528.7000000000003, "Time_End": 2530.7000000000003, "Text": " Again, this would be nice."}, {"Time_Start": 2530.7000000000003, "Time_End": 2534.7000000000003, "Text": " This is stuff where we're going to hope that it's all going to be in host config later on."}, {"Time_Start": 2534.7000000000003, "Time_End": 2536.7000000000003, "Text": " For now, we're just commenting it out."}, {"Time_Start": 2536.7000000000003, "Time_End": 2538.7000000000003, "Text": " Okay."}, {"Time_Start": 2538.7000000000003, "Time_End": 2543.7000000000003, "Text": " So, like I said, to do a thorough audit, you're going to read through all the start scripts and decide what to turn off."}, {"Time_Start": 2543.7000000000003, "Time_End": 2550.7000000000003, "Text": " I do a more thorough audit in this article that is, that I'm going to post up on my website, probably come Monday."}, {"Time_Start": 2554.7000000000003, "Time_End": 2555.7000000000003, "Text": " So in terms of where you go to go."}, {"Time_Start": 2555.7000000000003, "Time_End": 2559.7000000000003, "Text": " In terms of where you go from here, we've gone through, we've gone through some of the scripts."}, {"Time_Start": 2559.7000000000003, "Time_End": 2562.7000000000003, "Text": " In terms of where you go from here, the first thing I'm going to do is actually go and run"}, {"Time_Start": 2562.7000000000003, "Time_End": 2565.7000000000003, "Text": " NetStat and get a list of what's listening on different ports."}, {"Time_Start": 2565.7000000000003, "Time_End": 2568.7000000000003, "Text": " Okay, I'll use NetStat to get a list of what's listening."}, {"Time_Start": 2568.7000000000003, "Time_End": 2570.7000000000003, "Text": " I'll use LSOF to tell me what programs."}, {"Time_Start": 2570.7000000000003, "Time_End": 2572.7000000000003, "Text": " NetStack gives me a list of listening ports."}, {"Time_Start": 2572.7000000000003, "Time_End": 2577.7000000000003, "Text": " LSOF gives me, you know, for a given port, what's actually listening on it."}, {"Time_Start": 2577.7000000000003, "Time_End": 2578.7000000000003, "Text": " Okay?"}, {"Time_Start": 2578.7000000000003, "Time_End": 2584.7000000000003, "Text": " So what I might do is I might go and use NetStat and I see Port 1033 is listening on local host."}, {"Time_Start": 2584.7000000000003, "Time_End": 2589.7000000000003, "Text": " local host. And if I see that, I'll run LSOF, and it'll say net info is listening on that port,"}, {"Time_Start": 2589.7000000000003, "Time_End": 2595.7000000000003, "Text": " and I'll say that's okay, I need that, that's fine, I need net info, I can't turn it off, okay, that's fine with me."}, {"Time_Start": 2595.7000000000003, "Time_End": 2600.7000000000003, "Text": " And the fact that it only listens on loopback makes it a little less dangerous anyway."}, {"Time_Start": 2600.7000000000003, "Time_End": 2605.7000000000003, "Text": " Okay, UDP. If I'm going and doing a UDP audit, these are the ports that came up listening."}, {"Time_Start": 2605.7000000000003, "Time_End": 2607.7000000000003, "Text": " 1033 is also net info."}, {"Time_Start": 2607.7000000000003, "Time_End": 2613.7000000000003, "Text": " I can go through each port with LSOF, okay, and I see there are different pieces of, there are different pieces of the"}, {"Time_Start": 2613.7000000000003, "Time_End": 2615.7000000000003, "Text": " there are different pieces of the operating system."}, {"Time_Start": 2615.7000000000003, "Time_End": 2620.7000000000003, "Text": " And I can go and actually look at what each one is and decide whether I want to keep it or not."}, {"Time_Start": 2620.7000000000003, "Time_End": 2622.7000000000003, "Text": " Okay, I'm keeping lookup D."}, {"Time_Start": 2622.7000000000003, "Time_End": 2624.7000000000003, "Text": " I'm keeping NetInfoD."}, {"Time_Start": 2624.7000000000003, "Time_End": 2628.7000000000003, "Text": " I'm keeping CISLog, but why the heck is CISLog listening on the network?"}, {"Time_Start": 2628.7000000000003, "Time_End": 2629.7000000000003, "Text": " Okay?"}, {"Time_Start": 2629.7000000000003, "Time_End": 2634.7000000000003, "Text": " If I go and look at the man page for CISLog, and that's what we do time permitting,"}, {"Time_Start": 2634.7000000000003, "Time_End": 2639.7000000000003, "Text": " what I, if I look at the man page for CISLog, CISLog says you have to have, you have to have the minus T"}, {"Time_Start": 2639.7000000000003, "Time_End": 2642.7000000000003, "Text": " command line option to be listening on the network."}, {"Time_Start": 2642.7000000000003, "Time_End": 2643.7000000000003, "Text": " And it says, hey, this is, you know,"}, {"Time_Start": 2643.7000000000003, "Time_End": 2647.1000000000004, "Text": " kind of an old insecure thing and you're open a DOS attack."}, {"Time_Start": 2647.1000000000004, "Time_End": 2649.5000000000005, "Text": " And so then what do I do?"}, {"Time_Start": 2649.5000000000005, "Time_End": 2655.2400000000002, "Text": " Well, I notice that this, that if I do a PS, CIS log isn't being run with minus T."}, {"Time_Start": 2655.2400000000002, "Time_End": 2658.4, "Text": " If I look at the script, CIS log isn't being run with that option."}, {"Time_Start": 2658.4, "Time_End": 2661.2400000000002, "Text": " So, I'm sorry, minus you."}, {"Time_Start": 2661.2400000000002, "Time_End": 2662.4, "Text": " What do I do?"}, {"Time_Start": 2662.4, "Time_End": 2669.2000000000003, "Text": " I say, it's, it says that it's listening on the port, but my man page, my start script"}, {"Time_Start": 2669.2000000000003, "Time_End": 2673.6600000000003, "Text": " doesn't indicate that it's listening on the port, that it should be accepting remote"}, {"Time_Start": 2673.7000000000003, "Time_End": 2681.1000000000004, "Text": " logs. So, I'm sorry, what I do, I thought I had a slide on that. What I do is I fire off"}, {"Time_Start": 2681.1000000000004, "Time_End": 2686.8, "Text": " my CISLG client and just start firing off logs at the box. And I start firing them off"}, {"Time_Start": 2686.8, "Time_End": 2690.5800000000004, "Text": " from different IP addresses and seeing what happens, and I find, oh, hey, I can't get this thing"}, {"Time_Start": 2690.5800000000004, "Time_End": 2696.5800000000004, "Text": " to log, to log anything. Okay? It'd be nice if it didn't listen on the port, but it's going"}, {"Time_Start": 2696.5800000000004, "Time_End": 2701.2200000000003, "Text": " to. So is there anything, is there anything you guys can think of that I can do about it if I'm"}, {"Time_Start": 2701.2200000000003, "Time_End": 2702.42, "Text": " still paranoid about this?"}, {"Time_Start": 2703.7000000000003, "Time_End": 2710.38, "Text": " IPFW, exactly. So I can make sure that IPFW is currently blocking all access to the port."}, {"Time_Start": 2712.88, "Time_End": 2729.86, "Text": " Okay, what else? I find port 68 is listening. I find that's config D. Port 68, that's my DHCP client port. I need that there. That's okay. I might use IPFW to make sure that it only gets, I might use IPFW to make sure that it only gets communication from the known DHCP server on the network."}, {"Time_Start": 2731.38, "Time_End": 2733.6800000000003, "Text": " Otherwise, I need it because the system is doing DHCP server."}, {"Time_Start": 2733.7000000000003, "Time_End": 2739.6200000000003, "Text": " I can also go static route and not worry about it. Okay. From there, what are my next steps?"}, {"Time_Start": 2739.9800000000005, "Time_End": 2746.82, "Text": " My next steps are looking at doing a set UID audit, doing a set GID audit. Okay, my audit cron jobs, look at"}, {"Time_Start": 2746.82, "Time_End": 2752.9800000000005, "Text": " demon configurations, do a permissions audit. In terms of a set UID audit, these are the commands I'd use,"}, {"Time_Start": 2753.36, "Time_End": 2759.4600000000005, "Text": " and what I'm looking for, what I'm looking for are programs that let ordinary users and potentially every"}, {"Time_Start": 2759.4600000000005, "Time_End": 2762.84, "Text": " ordinary user on the system run as root. Am I really out of time?"}, {"Time_Start": 2763.7000000000003, "Time_End": 2767.94, "Text": " Okay, I'm out of time, so I'm going to show you the slides and stop."}, {"Time_Start": 2768.4800000000005, "Time_End": 2770.86, "Text": " Okay, so there's my commands for reset, you 80 audit."}, {"Time_Start": 2771.5600000000004, "Time_End": 2772.6400000000003, "Text": " I'll look at Cron jobs."}, {"Time_Start": 2773.82, "Time_End": 2780.36, "Text": " Cron runs periodic, periodic runs a bunch of stuff out of the directories, Etsy periodic daily, monthly, weekly."}, {"Time_Start": 2781.2400000000002, "Time_End": 2783.9600000000005, "Text": " I'll go through and actually look at demon configurations later on."}, {"Time_Start": 2784.0000000000005, "Time_End": 2788.2400000000002, "Text": " If I have time, any demons I actually still want to run, I'll make better configurations,"}, {"Time_Start": 2788.6400000000003, "Time_End": 2792.2000000000003, "Text": " read references on this, some of them are on my website, permissions audit."}, {"Time_Start": 2792.2000000000003, "Time_End": 2793.6800000000003, "Text": " I'll actually go and look at the system."}, {"Time_Start": 2793.7000000000003, "Time_End": 2797.88, "Text": " and see what somebody could do in terms of world writable files and directories replacing data"}, {"Time_Start": 2797.88, "Time_End": 2805.1600000000003, "Text": " or replacing executables. Okay? There's commands to do that. Bastille Linux. Fastio Linux is an increasingly"}, {"Time_Start": 2805.1600000000003, "Time_End": 2810.6600000000003, "Text": " misnamed program that is a hardening script that'll actually go through and do some lockdown."}, {"Time_Start": 2810.9, "Time_End": 2814.7200000000003, "Text": " You can do a much better job always by hand because you're a boatload smarter than a pearl script,"}, {"Time_Start": 2815.0600000000004, "Time_End": 2819.34, "Text": " but this might help you in terms of automation, in terms of getting a first start, in terms of doing"}, {"Time_Start": 2819.34, "Time_End": 2823.6800000000003, "Text": " this for lots of systems. Bastille Linux works on HPwax and OSX and 5 Linux distro."}, {"Time_Start": 2823.7000000000003, "Time_End": 2828.1000000000004, "Text": " I've got articles you might read on lockdown. There they are, and we're out of slides."}, {"Time_Start": 2829.0600000000004, "Time_End": 2831.7200000000003, "Text": " Is this useful, except for the people who are going to fillet me?"}]}