{"segments": [{"Time_Start": 0.0, "Time_End": 7.0, "Text": " Entitled Cracking Nets of Phone and other voice over IP technologies."}, {"Time_Start": 7.0, "Time_End": 14.0, "Text": " One difference about this particular slides that you have, so if you need to contact me or email me after this presentation,"}, {"Time_Start": 14.0, "Time_End": 20.0, "Text": " ask any questions, please Tmore at NetWitness.com."}, {"Time_Start": 20.0, "Time_End": 29.0, "Text": " Today, basically I'm going to show to you that even though we are going to extremely digital these days,"}, {"Time_Start": 29.0, "Time_End": 43.76, "Text": " these days. I mean, you probably have voice over IP in your home. The one thing you need to know is you're not safe from wiretap just because it's the latest and greatest technology. It's all digital. And one thing I'm going to show you today is actually you can capture"}, {"Time_Start": 43.76, "Time_End": 58.980000000000004, "Text": " over the network and you can also capture, reconstruct, reassemble, and replay voice over IP. We're going to try to do, I'm going to show you a good equation for doing it. We're going to try to do it anyway. I couldn't get the audio to exactly work."}, {"Time_Start": 59.0, "Time_End": 66.0, "Text": " I don't have a direct feed, but I'm going to try anyway to hold the mic up to the laptop and we'll see if that works or not."}, {"Time_Start": 66.0, "Time_End": 71.0, "Text": " Out of this presentation is if you're at home, you have voice over IP or maybe you're at work."}, {"Time_Start": 71.0, "Time_End": 78.0, "Text": " You might want to be scared if you see the unmarked white van parked outside because they're still going to be able to on."}, {"Time_Start": 78.0, "Time_End": 85.0, "Text": " This is Nettophone. When you dial out, this is from a packet capture."}, {"Time_Start": 85.0, "Time_End": 88.98, "Text": " When you hit the dial button on the Nets phone application, this is"}, {"Time_Start": 89.0, "Time_End": 99.0, "Text": " the packet that gets sent out. If you look in the red, part Martin red, that's actually the encoded phone number, so it's not passed in clear text."}, {"Time_Start": 99.0, "Time_End": 112.0, "Text": " And it's actually very easy to decode the phone number. It took me a few hours, but after doing a few operations, the phone number eventually popped out."}, {"Time_Start": 112.0, "Time_End": 115.0, "Text": " And I'm going to go ahead and present the equation for that."}, {"Time_Start": 119.0, "Time_End": 123.82, "Text": " Unfortunately, Nettophone got to me before I could present this."}, {"Time_Start": 123.82, "Time_End": 137.24, "Text": " So I was on the phone yesterday with Vice President of Architecture at Nettophone, and he informed me that this is proprietary information and therefore protected by law."}, {"Time_Start": 137.24, "Time_End": 145.66, "Text": " So we're not going to be able to show you this extremely simple operation to expose the phone number."}, {"Time_Start": 145.66, "Time_End": 146.5, "Text": " So moving on."}, {"Time_Start": 149.0, "Time_End": 155.0, "Text": " Oops."}, {"Time_Start": 155.0, "Time_End": 157.0, "Text": " I just had a PowerPoint malfunction."}, {"Time_Start": 157.0, "Time_End": 161.0, "Text": " I'm sorry."}, {"Time_Start": 161.0, "Time_End": 167.0, "Text": " So we're going to go right into how to capture and replay voice over IP."}, {"Time_Start": 167.0, "Time_End": 171.0, "Text": " Most voice over IP products do use what's called RTP."}, {"Time_Start": 171.0, "Time_End": 173.0, "Text": " That's a real-time protocol."}, {"Time_Start": 173.0, "Time_End": 174.0, "Text": " It's very simple."}, {"Time_Start": 174.0, "Time_End": 175.0, "Text": " You're looking at the header."}, {"Time_Start": 175.0, "Time_End": 178.0, "Text": " This is what's at the beginning of every RTP packet."}, {"Time_Start": 178.0, "Time_End": 179.0, "Text": " And you're looking at the header."}, {"Time_Start": 179.0, "Time_End": 182.46, "Text": " And there are two things that we are interested in."}, {"Time_Start": 182.54, "Time_End": 184.66, "Text": " The first one being the payload type."}, {"Time_Start": 184.96, "Time_End": 189.2, "Text": " The payload type is going to tell you what audio Kodak was used,"}, {"Time_Start": 189.7, "Time_End": 194.52, "Text": " and thusly, that's what you're going to use to uncompress and replay the audio."}, {"Time_Start": 194.9, "Time_End": 197.96, "Text": " Now, most of them are pretty standard these days."}, {"Time_Start": 198.32, "Time_End": 201.64, "Text": " I've seen on a lot of different products outside of Nettophone."}, {"Time_Start": 202.24, "Time_End": 207.06, "Text": " They use the common ones like ULA or ADPCM or G.723,"}, {"Time_Start": 207.06, "Time_End": 208.94, "Text": " and these have all been defined."}, {"Time_Start": 209.0, "Time_End": 213.12, "Text": " by the standard. They're all static mappings based on this payload type."}, {"Time_Start": 213.12, "Time_End": 220.34, "Text": " There are a dynamic range within the payload type that is only available to the vendor."}, {"Time_Start": 220.44, "Time_End": 222.36, "Text": " The vendor can use whatever they want to use."}, {"Time_Start": 222.96, "Time_End": 227.72, "Text": " In that case, you would just have to try various codex or go contact the vendor"}, {"Time_Start": 227.72, "Time_End": 232.84, "Text": " and be able to get their uncompression algorithm and apply it to it."}, {"Time_Start": 233.24, "Time_End": 238.56, "Text": " So, but usually they use, most of the products use some of the standard ones that are available to you."}, {"Time_Start": 239.0, "Time_End": 242.02, "Text": " Now, the other thing that's important is the timestamp."}, {"Time_Start": 242.38, "Time_End": 248.34, "Text": " Now, the timestamp's important because in voice over IP communications, you do not transmit silence."}, {"Time_Start": 248.98, "Time_End": 254.04, "Text": " So in order to actually do a replay of the conversation from packet capture,"}, {"Time_Start": 254.5, "Time_End": 258.12, "Text": " timestamp becomes important because we need to add the silence back in."}, {"Time_Start": 259.7, "Time_End": 265.74, "Text": " So there's five steps here to do this, and this can be done from any packet capture."}, {"Time_Start": 265.9, "Time_End": 268.2, "Text": " Maybe you're using TCP dump or something like that."}, {"Time_Start": 269.0, "Time_End": 273.9, "Text": " My demo today was done using wind dumps, since this is a Windows machine,"}, {"Time_Start": 274.02, "Time_End": 278.18, "Text": " and just capturing packets from a net-to-phone conversation."}, {"Time_Start": 279.08, "Time_End": 284.48, "Text": " These five steps are actually fairly generic in that they should work for any product"}, {"Time_Start": 284.48, "Time_End": 288.0, "Text": " that is not encrypting their RTP traffic."}, {"Time_Start": 288.0, "Time_End": 293.4, "Text": " And I've tested it on a lot of different applications as well as hardware devices,"}, {"Time_Start": 293.92, "Time_End": 295.3, "Text": " and it works fairly well."}, {"Time_Start": 295.72, "Time_End": 298.98, "Text": " So the first, the five steps are we need to reassemble."}, {"Time_Start": 299.0, "Time_End": 304.88, "Text": " the application streams. We need to decompress the audio. We need to fill in any"}, {"Time_Start": 304.88, "Time_End": 310.04, "Text": " silence gaps, adjust the starting time, and then we mix and we can play it back"}, {"Time_Start": 310.04, "Time_End": 315.68, "Text": " through our speakers. The original source being a packet capture, we can replay that and"}, {"Time_Start": 315.68, "Time_End": 318.96, "Text": " hear the conversation unfold. We're going to go into each five steps in detail."}, {"Time_Start": 318.96, "Time_End": 325.76, "Text": " The first one is reassembling the application stream. And this, since RTP is"}, {"Time_Start": 325.76, "Time_End": 328.98, "Text": " UDP based, we're going to reassemble the UDP stream."}, {"Time_Start": 329.0, "Time_End": 332.06, "Text": " based on the IP port, IP port combination."}, {"Time_Start": 332.56, "Time_End": 335.04, "Text": " I want to basically create two link lists."}, {"Time_Start": 335.46, "Time_End": 338.3, "Text": " I want to capture all the packets that are going to the server,"}, {"Time_Start": 338.78, "Time_End": 341.64, "Text": " and then likewise I want all the packs coming back from the server."}, {"Time_Start": 341.78, "Time_End": 347.18, "Text": " So I have both sides of the conversation there, and I can manipulate it."}, {"Time_Start": 347.22, "Time_End": 349.56, "Text": " So we're going to end up with two link lists, two streams."}, {"Time_Start": 350.48, "Time_End": 351.68, "Text": " And we're going to work from there."}, {"Time_Start": 351.68, "Time_End": 355.04, "Text": " And then the second step, once we have those link lists,"}, {"Time_Start": 355.68, "Time_End": 357.88, "Text": " we're going to decompress."}, {"Time_Start": 357.94, "Time_End": 358.98, "Text": " We're going to go through each package."}, {"Time_Start": 359.0, "Time_End": 364.24, "Text": " it in that list. We're going to look at that payload type to see what codec was used."}, {"Time_Start": 364.24, "Time_End": 371.76, "Text": " And then we're going to decompress it. Now, in this example, the payload type was four. So"}, {"Time_Start": 371.76, "Time_End": 378.5, "Text": " four means G.723. So we have called that code to do the decompression. And now our link lists,"}, {"Time_Start": 378.5, "Time_End": 382.5, "Text": " our two link lists are filled with uncompressed audio, and we can move on from there."}, {"Time_Start": 382.5, "Time_End": 388.98, "Text": " Now, if you're a Windows developer, they actually make it rather easy. You can just use the ACM,"}, {"Time_Start": 389.0, "Time_End": 394.34, "Text": " the audio codec manager and it'll you'll be able to query any codecs that are"}, {"Time_Start": 394.34, "Time_End": 401.24, "Text": " installed on your computer and be able to do this all right the next step is we need"}, {"Time_Start": 401.24, "Time_End": 406.34, "Text": " to fill in those silence gaps since voice over IP doesn't transmit the silence. Now"}, {"Time_Start": 406.34, "Time_End": 414.06, "Text": " the timestamp is a little kind of vendor specific because the RFC doesn't really"}, {"Time_Start": 414.06, "Time_End": 418.1, "Text": " tell you anything other than this is for the vendor to use as a timestamp."}, {"Time_Start": 419.0, "Time_End": 422.0, "Text": " It could be in any time interval."}, {"Time_Start": 422.0, "Time_End": 429.0, "Text": " In my example, I'm just choosing milliseconds, but it's up to the vendor to choose any time interval they want."}, {"Time_Start": 429.0, "Time_End": 434.0, "Text": " The first packet can start at any arbitrary number, so that doesn't really tell you anything either."}, {"Time_Start": 434.0, "Time_End": 439.0, "Text": " So really the only information you can get out of this is the differences between each packet,"}, {"Time_Start": 439.0, "Time_End": 443.0, "Text": " the differences in time between each packet, and that's important."}, {"Time_Start": 443.0, "Time_End": 448.0, "Text": " Then the first thing you need to do is you cycle through that link list and you find the link list,"}, {"Time_Start": 448.0, "Time_End": 452.0, "Text": " the minimum number, the minimum time interval."}, {"Time_Start": 452.0, "Time_End": 454.0, "Text": " And we're going to use that value."}, {"Time_Start": 454.0, "Time_End": 461.0, "Text": " And once we find it in this example, you see 300 milliseconds was the minimum time interval between packets."}, {"Time_Start": 461.0, "Time_End": 466.0, "Text": " And then if you look forward at the first packet, between the first and second packet,"}, {"Time_Start": 466.0, "Time_End": 469.0, "Text": " we notice that 600 was there."}, {"Time_Start": 469.0, "Time_End": 471.0, "Text": " So what we have there is a missing packet."}, {"Time_Start": 471.0, "Time_End": 475.0, "Text": " We either missed it or there was silence and it wasn't transmitted."}, {"Time_Start": 475.0, "Time_End": 477.98, "Text": " So based on to that, we know we need to add in"}, {"Time_Start": 478.0, "Time_End": 482.0, "Text": " one packet of silence. Likewise, between the second and third packet there,"}, {"Time_Start": 482.0, "Time_End": 487.0, "Text": " you see we have a time interval increase of 900, whatever 900 is,"}, {"Time_Start": 487.0, "Time_End": 491.0, "Text": " and that tells you, since 300 is the minimum between packets,"}, {"Time_Start": 491.0, "Time_End": 494.0, "Text": " and it's always a multiple, by the way, 300 is the minimum,"}, {"Time_Start": 494.0, "Time_End": 496.0, "Text": " that means we need to insert two more."}, {"Time_Start": 496.0, "Time_End": 503.0, "Text": " So the end result, in this example, is we're adding in those packets to put in the silence."}, {"Time_Start": 503.0, "Time_End": 507.0, "Text": " Otherwise, if you were to play back this stream,"}, {"Time_Start": 507.0, "Time_End": 510.0, "Text": " all you would hear is nonstop talking."}, {"Time_Start": 510.0, "Time_End": 512.0, "Text": " There would never be a break."}, {"Time_Start": 512.0, "Time_End": 515.0, "Text": " So that's important to do, especially when you're going to do what we're doing"}, {"Time_Start": 515.0, "Time_End": 519.0, "Text": " and mixing both sides, both streams together,"}, {"Time_Start": 519.0, "Time_End": 523.0, "Text": " so that you hear the full conversation."}, {"Time_Start": 523.0, "Time_End": 525.0, "Text": " We're not done yet."}, {"Time_Start": 525.0, "Time_End": 529.0, "Text": " Even though we have padded everything, we've got all the silence gaps filled in,"}, {"Time_Start": 529.0, "Time_End": 534.0, "Text": " we need to adjust the late sending stream."}, {"Time_Start": 534.0, "Time_End": 537.0, "Text": " And what I mean by that is in, if you do it,"}, {"Time_Start": 537.0, "Time_End": 544.0, "Text": " capture of RTP, typically you're going to see one side transmitting before you see the other side coming back to you."}, {"Time_Start": 544.0, "Time_End": 549.0, "Text": " So there is a time lag between those two streams, and we need to adjust for it."}, {"Time_Start": 549.0, "Time_End": 555.0, "Text": " Otherwise, when we do the mix of both streams to hear the conversation,"}, {"Time_Start": 555.0, "Time_End": 558.0, "Text": " you're going to find everything's out of sync."}, {"Time_Start": 558.0, "Time_End": 562.0, "Text": " The streams would be in sync individually played, but when you try to mix them together,"}, {"Time_Start": 562.0, "Time_End": 564.0, "Text": " you're going to find that people are talking over each other,"}, {"Time_Start": 564.0, "Time_End": 566.0, "Text": " and you're not going to be able to understand the conversation very well."}, {"Time_Start": 566.0, "Time_End": 567.0, "Text": " very well."}, {"Time_Start": 567.0, "Time_End": 572.0, "Text": " So what we do, in this example, you can see we have our stream one or stream two."}, {"Time_Start": 572.0, "Time_End": 581.0, "Text": " And we notice that the first packet we capture is two seconds, was seen two seconds after the first stream."}, {"Time_Start": 581.0, "Time_End": 589.0, "Text": " So what we need to do at that point is to fill in, put in a little silence at the beginning"}, {"Time_Start": 589.0, "Time_End": 595.0, "Text": " of the late starting stream, which is stream two, since we noticed the first packet was two seconds after."}, {"Time_Start": 595.0, "Time_End": 596.0, "Text": " So we compare those."}, {"Time_Start": 596.0, "Time_End": 601.5, "Text": " and we figure out how much silence we need to add and we go ahead and we add that to the second stream."}, {"Time_Start": 601.5, "Time_End": 608.5, "Text": " So where are we at right now? We've just, we've got our reassembly of all our packets."}, {"Time_Start": 608.5, "Time_End": 610.5, "Text": " We decompressed all the audio."}, {"Time_Start": 610.5, "Time_End": 615.0, "Text": " We filled in the silence gaps in between all the packets in our link list."}, {"Time_Start": 615.0, "Time_End": 621.5, "Text": " And now we've just adjusted the starting time of one of the streams so that both streams should now,"}, {"Time_Start": 621.5, "Time_End": 625.98, "Text": " theoretically, if I played them both at the same time, you should be able to hear the comment"}, {"Time_Start": 626.0, "Time_End": 639.0, "Text": " conversation unfold fairly well and you should be able to hear someone talking and then someone responding and it should mix together very well. And that's exactly what this final step is. We're going to just mix it."}, {"Time_Start": 639.0, "Time_End": 655.98, "Text": " Mixing two uncompressed audio streams together is a rather simple operation. In fact, you're just going to be adding either the 8-bit or 16-bit quantities together to produce one single stream that will play back either through your speakers or you could save it off to a whole stream."}, {"Time_Start": 656.0, "Time_End": 663.0, "Text": " file. Save it off as a wave file. It's just on compress audio at this point, and you could play that back."}, {"Time_Start": 663.0, "Time_End": 675.0, "Text": " So that's the entire algorithm how law enforcement could be sitting outside your house capturing your internet traffic, your voice over IP traffic,"}, {"Time_Start": 675.0, "Time_End": 679.0, "Text": " and then replaying it back later when they haul you off to court."}, {"Time_Start": 679.0, "Time_End": 682.0, "Text": " For whatever you guys did, I'm not asking."}, {"Time_Start": 682.0, "Time_End": 685.98, "Text": " But now I've got a demo of the actual equation."}, {"Time_Start": 686.0, "Time_End": 698.0, "Text": " I actually work for on a product called NetWitness and I'm going to show you basically how this was implemented and you can hear hopefully for yourself how it sounds."}, {"Time_Start": 698.0, "Time_End": 701.0, "Text": " Again, we didn't get the direct link."}, {"Time_Start": 701.0, "Time_End": 704.0, "Text": " So it's questionable."}, {"Time_Start": 704.0, "Time_End": 712.0, "Text": " Now the first thing I want to show you is not the RTP stream, but I'm going to show you the Nettophone dial-up connection."}, {"Time_Start": 712.0, "Time_End": 715.0, "Text": " This is when you click the dial button."}, {"Time_Start": 715.0, "Time_End": 716.0, "Text": " And right here."}, {"Time_Start": 716.0, "Time_End": 720.0, "Text": " here, you know, this is the block that I was pointing out before."}, {"Time_Start": 720.0, "Time_End": 724.0, "Text": " This is just a hex dump of the first two packets we see."}, {"Time_Start": 724.0, "Time_End": 727.0, "Text": " And that's actually where the encoded phone number was."}, {"Time_Start": 727.0, "Time_End": 731.0, "Text": " And you can see up here, that's the actual digits that I dialed."}, {"Time_Start": 731.0, "Time_End": 735.0, "Text": " So the equation I can't tell you about, it does work."}, {"Time_Start": 735.0, "Time_End": 737.0, "Text": " Please don't call that phone number."}, {"Time_Start": 737.0, "Time_End": 740.0, "Text": " It's some Jamaican guy. I just made it up."}, {"Time_Start": 740.0, "Time_End": 744.0, "Text": " Probably wouldn't be happy if everyone called them."}, {"Time_Start": 744.0, "Time_End": 751.0, "Text": " All right, now for the good stuff, hopefully."}, {"Time_Start": 751.0, "Time_End": 753.0, "Text": " This is the RTP stream."}, {"Time_Start": 753.0, "Time_End": 754.0, "Text": " This was step one."}, {"Time_Start": 754.0, "Time_End": 758.0, "Text": " This is where we had to reassemble the packets."}, {"Time_Start": 758.0, "Time_End": 762.0, "Text": " And you can see the two IP addresses involved here in the two port numbers."}, {"Time_Start": 762.0, "Time_End": 767.0, "Text": " And basically we have about 2,000 UDP packets"}, {"Time_Start": 767.0, "Time_End": 770.0, "Text": " that are in our link list that I was describing."}, {"Time_Start": 770.0, "Time_End": 773.0, "Text": " And now we're going to go ahead and perform the other operations"}, {"Time_Start": 773.0, "Time_End": 774.0, "Text": " and report."}, {"Time_Start": 774.0, "Time_End": 777.0, "Text": " play the audio. So let's hope it works."}, {"Time_Start": 777.0, "Time_End": 778.0, "Text": " Hello?"}, {"Time_Start": 778.0, "Time_End": 787.0, "Text": " Hey, Scott."}, {"Time_Start": 787.0, "Time_End": 790.0, "Text": " I'm calling you with Nettophone right now."}, {"Time_Start": 790.0, "Time_End": 793.0, "Text": " Oh, sounds like a regular phone to me."}, {"Time_Start": 793.0, "Time_End": 794.0, "Text": " Yeah."}, {"Time_Start": 794.0, "Time_End": 797.0, "Text": " I wanted to see if you're going to Defcom this year."}, {"Time_Start": 797.0, "Time_End": 800.0, "Text": " It's in Vegas, isn't it? Of course I'm going."}, {"Time_Start": 800.0, "Time_End": 801.0, "Text": " Well, guess what?"}, {"Time_Start": 801.0, "Time_End": 804.0, "Text": " I'm presenting this year, and I'm going to demo how to replay voice"}, {"Time_Start": 804.0, "Time_End": 805.0, "Text": " over IP."}, {"Time_Start": 805.0, "Time_End": 806.0, "Text": " Really?"}, {"Time_Start": 806.0, "Time_End": 808.0, "Text": " What conversation you're going to use to reply?"}, {"Time_Start": 808.0, "Time_End": 811.0, "Text": " I was going to use this one."}, {"Time_Start": 811.0, "Time_End": 813.0, "Text": " You're capturing this conversation right now?"}, {"Time_Start": 813.0, "Time_End": 814.0, "Text": " Yeah."}, {"Time_Start": 814.0, "Time_End": 816.0, "Text": " I got to go."}, {"Time_Start": 816.0, "Time_End": 817.0, "Text": " Hello?"}, {"Time_Start": 817.0, "Time_End": 820.0, "Text": " There you go. How'd that sound?"}, {"Time_Start": 820.0, "Time_End": 824.0, "Text": " Thank you, guys. That's all my time."}, {"Time_Start": 824.0, "Time_End": 828.0, "Text": " I'll be outside if I want to ask me any question."}, {"Time_Start": 828.0, "Time_End": 829.0, "Text": " Thanks again."}, {"Time_Start": 829.0, "Time_End": 830.0, "Text": " Thank you."}, {"Time_Start": 834.0, "Time_End": 836.0, "Text": " Thank you."}]}