{"segments": [{"Time_Start": 0.0, "Time_End": 28.48, "Text": " How it affects you and what it affects you and what you can do about it."}, {"Time_Start": 30.0, "Time_End": 32.04, "Text": " So what's a broadcast flag?"}, {"Time_Start": 32.82, "Time_End": 35.04, "Text": " Well, a few different definitions."}, {"Time_Start": 35.74, "Time_End": 41.44, "Text": " Legally, it's a rule that forces DRM onto free over-the-air digital television broadcasts."}, {"Time_Start": 41.44, "Time_End": 48.019999999999996, "Text": " Does that, it's a tech, buy a technology mandate on DTV tuners."}, {"Time_Start": 48.46, "Time_End": 57.82, "Text": " Anyone who manufactures a device capable of demodulating the HDTV signal must bake in DRM as of July 1st, 2005."}, {"Time_Start": 57.82, "Time_End": 71.74, "Text": " specifically, broadcast flag is metadata that goes along with the ATSC signal, telling you what you can or more likely can't do with that signal."}, {"Time_Start": 71.74, "Time_End": 87.74000000000001, "Text": " Every tuner device, again, has to watch for and recognize that flag and implement it in a temper-resistant, non-user-modifiable way, so that if the signal is flagged, do not copy, it can't let you copy it."}, {"Time_Start": 87.82000000000001, "Time_End": 94.82000000000001, "Text": " We have here a PC with an HDTV tuner card."}, {"Time_Start": 94.82000000000001, "Time_End": 101.82000000000001, "Text": " The display there is displaying HDTV that we captured over the air in our San Francisco office just last week."}, {"Time_Start": 101.82000000000001, "Time_End": 110.82000000000001, "Text": " I think it's showing CSI, one of the few but growing number of shows that's being broadcast in HDTV."}, {"Time_Start": 110.82000000000001, "Time_End": 116.82000000000001, "Text": " We captured that to a couple of big discs that we've got in this machine, and once we've got that file, it's uninterested."}, {"Time_Start": 116.82000000000001, "Time_End": 146.8, "Text": " file. It's unencrypted, MPEG 2. We can do what we want with it. We can pause live TV. We can play it back. We can store it for later viewing. We can take excerpts from it to use in our critical reviews. In other words, we've got complete flexibility to make fair uses of this content. Motion Picture Studios don't like that, and that's why we got to the broadcast flag. It affects digital over-the-air television. It doesn't affect premium"}, {"Time_Start": 146.82, "Time_End": 149.82, "Text": " cable or satellite television or analog television."}, {"Time_Start": 149.82, "Time_End": 158.82, "Text": " So this is one very specific class of the kinds of things you can receive on your television, but it is the class of"}, {"Time_Start": 158.82, "Time_End": 166.82, "Text": " the class of signals that Congress has said in the Telecommunications Act are the kinds of signals"}, {"Time_Start": 166.82, "Time_End": 175.82, "Text": " broadcasters should be transitioning to from the current analog broadcasts, and in order to encourage their transition,"}, {"Time_Start": 175.82, "Time_End": 183.22, "Text": " They've helped the motion picture studios along with these restrictions on what we as individuals can do with those signals."}, {"Time_Start": 183.98, "Time_End": 185.23999999999998, "Text": " Why should you care now?"}, {"Time_Start": 185.66, "Time_End": 189.84, "Text": " Well, the broadcast flight takes effect July 1st, 2005."}, {"Time_Start": 190.2, "Time_End": 197.68, "Text": " As at that point, it becomes unlawful to manufacture or import tuners that give access to the unencrypted digital signal."}, {"Time_Start": 198.26, "Time_End": 205.79999999999998, "Text": " So you have 334 days left for unencumbered digital television, but any tuner device you buy now will continue to work."}, {"Time_Start": 205.82, "Time_End": 210.66, "Text": " If it ignores the broadcast flag now, it'll ignore the broadcast flag 335 days later."}, {"Time_Start": 211.66, "Time_End": 212.82, "Text": " Buy tuna cards now."}, {"Time_Start": 216.82, "Time_End": 218.32, "Text": " Not all of those are shopping days."}, {"Time_Start": 221.06, "Time_End": 222.32, "Text": " How did we get here?"}, {"Time_Start": 222.92, "Time_End": 230.29999999999998, "Text": " Well, this is a cartoon from the time of the Sony Betamax case, when the Motion Picture Studios sued Sony"}, {"Time_Start": 230.29999999999998, "Time_End": 235.79999999999998, "Text": " for manufacturing the Betamax, this old style of VCR, that could record over the"}, {"Time_Start": 235.82, "Time_End": 238.42, "Text": " television, not digital, that time."}, {"Time_Start": 239.9, "Time_End": 246.22, "Text": " And the lower court ruled that the VCR was illegal because it could be used for copying without"}, {"Time_Start": 246.22, "Time_End": 247.95999999999998, "Text": " authorization of the copyright holder."}, {"Time_Start": 248.5, "Time_End": 251.26, "Text": " Cartoonist here asked, which one of these is illegal?"}, {"Time_Start": 255.5, "Time_End": 260.28, "Text": " And the Supreme Court, of course, later reversed that decision, telling us that because"}, {"Time_Start": 260.28, "Time_End": 265.8, "Text": " time shifting was non-infringing fair use, the VCR was capable of"}, {"Time_Start": 265.82, "Time_End": 271.5, "Text": " non-infringing uses, even if some people who used it were rank pirates, other people"}, {"Time_Start": 271.5, "Time_End": 276.14, "Text": " who used it were making non-infringing fair uses, we wouldn't doubt law the technology."}, {"Time_Start": 276.54, "Time_End": 282.14, "Text": " And that's been the spur that's allowed technologists to continue making not only VCRs,"}, {"Time_Start": 282.14, "Time_End": 288.96, "Text": " but TiVos and MP3 players, all sorts of devices confident that because they had substantial"}, {"Time_Start": 288.96, "Time_End": 294.42, "Text": " non-infringing uses, they could make their technologies without asking permission from the"}, {"Time_Start": 294.42, "Time_End": 295.58, "Text": " movie studios first."}, {"Time_Start": 295.82, "Time_End": 297.28, "Text": " Do you have a question in the back?"}, {"Time_Start": 297.56, "Time_End": 302.15999999999997, "Text": " I was wondering, if that's only the same case when you make it illegal, some of the challenge the law."}, {"Time_Start": 304.12, "Time_End": 307.96, "Text": " We are challenging the law, and we're getting toward that."}, {"Time_Start": 309.65999999999997, "Time_End": 319.28, "Text": " So Seth is going to explain a little bit of the history of how we got to the broadcast flag from that case 20 years ago when the Supreme Court said VCRs are good."}, {"Time_Start": 320.06, "Time_End": 324.9, "Text": " Yeah, I wanted to talk about the history, particularly because I've been working on the broadcast flag issue"}, {"Time_Start": 324.90000000000003, "Time_End": 326.94000000000005, "Text": " for about three years."}, {"Time_Start": 327.64000000000004, "Time_End": 331.76000000000005, "Text": " So it's really been, I've been with it for a while."}, {"Time_Start": 332.20000000000005, "Time_End": 336.76000000000005, "Text": " And I would be glad to talk about the history for much longer, if anyone is interested."}, {"Time_Start": 337.16, "Time_End": 340.26000000000005, "Text": " But I'm going to try to cram it down and give some of the highlights."}, {"Time_Start": 341.8, "Time_End": 347.8, "Text": " So in the good old days, in the heyday of user rights under copyright law,"}, {"Time_Start": 347.8, "Time_End": 354.48, "Text": " there were very few legal restrictions inspired by copyright on what kind of technology people could make"}, {"Time_Start": 354.48, "Time_End": 359.52000000000004, "Text": " can distribute. There were a series of excellent user rights cases that protected"}, {"Time_Start": 359.52000000000004, "Time_End": 366.52000000000004, "Text": " people's right to make and to sell copying technology, even protected their right to break"}, {"Time_Start": 366.52000000000004, "Time_End": 372.6, "Text": " encryption imposed by copyright holders, and protected their right to reverse engineer and"}, {"Time_Start": 372.6, "Time_End": 377.86, "Text": " interoperate with devices and media formats without prior permission. All of these things"}, {"Time_Start": 377.86, "Time_End": 383.88, "Text": " were in the past upheld by the courts. That doesn't mean that Congress, for example, can't change"}, {"Time_Start": 383.88, "Time_End": 389.44, "Text": " the law to add and create new restrictions. That is exactly what Congress did most"}, {"Time_Start": 389.44, "Time_End": 394.86, "Text": " famously with the Digital Millennium Copyright Act. The Digital Millennium Copyright Act"}, {"Time_Start": 394.86, "Time_End": 402.52, "Text": " changed the outcome of a number of those pro-user rights cases. There was a deal between the industries"}, {"Time_Start": 402.52, "Time_End": 408.48, "Text": " that were interested in the DMCA. The deal was called No Mandate. The theory was, if you have"}, {"Time_Start": 408.48, "Time_End": 413.76, "Text": " encryption or another technical measure that restricts how people can use something or how they can"}, {"Time_Start": 413.76, "Time_End": 419.7, "Text": " interoperate with something, it will be unlawful to defeat that encryption. But there will"}, {"Time_Start": 419.7, "Time_End": 425.48, "Text": " not be any new or additional regulation on how people can use open formats, even if they"}, {"Time_Start": 425.48, "Time_End": 431.2, "Text": " know or if they have reason to know that a copyright holder disapproves of how the open formats are being"}, {"Time_Start": 431.2, "Time_End": 436.09999999999997, "Text": " used. So the DMCA doesn't provide absolute control over technology in every situation."}, {"Time_Start": 436.8, "Time_End": 443.09999999999997, "Text": " It provides a very broad and powerful control over technology in the case where encryption is present"}, {"Time_Start": 443.1, "Time_End": 444.6, "Text": " and where technology is proprietary."}, {"Time_Start": 446.18, "Time_End": 450.06, "Text": " So in that sense, you could say that the DMCA had the effect of dividing the world"}, {"Time_Start": 450.06, "Time_End": 455.64000000000004, "Text": " into the proprietary world where you can't touch things without permission and the open standards"}, {"Time_Start": 455.64000000000004, "Time_End": 461.36, "Text": " world, where you can still do what you like. In the proprietary world, the theory is get a license"}, {"Time_Start": 461.36, "Time_End": 467.54, "Text": " if you want to interoperate. Go negotiate. Go get prior permission. In the open world, the protections"}, {"Time_Start": 467.54, "Time_End": 472.8, "Text": " of the prior court cases protecting technology are still effective, and even if copyright"}, {"Time_Start": 472.8, "Time_End": 477.68, "Text": " holders are unhappy with the scope of technology, with the scope of what it allows you to do,"}, {"Time_Start": 477.68, "Time_End": 483.24, "Text": " they don't get a veto over your design decisions within the open technology world."}, {"Time_Start": 483.24, "Time_End": 492.96000000000004, "Text": " That's the world of open standards like HTML, like text files, like MP2 files, like MP3 files."}, {"Time_Start": 492.96000000000004, "Time_End": 496.18, "Text": " So the industry has this private licensing ideal."}, {"Time_Start": 496.18, "Time_End": 500.98, "Text": " I have a lot of regret about this ideal because it's become so pervasive that it's hard"}, {"Time_Start": 500.98, "Time_End": 504.90000000000003, "Text": " to get people even to remember that there was a time when this was not the case."}, {"Time_Start": 505.40000000000003, "Time_End": 510.14000000000004, "Text": " The current theory under the DMCA is you can't get our content without agreeing to our"}, {"Time_Start": 510.14000000000004, "Time_End": 516.36, "Text": " rules about how it can be used. This is enforced with encryption. When the works are published,"}, {"Time_Start": 516.52, "Time_End": 522.14, "Text": " they're encrypted, triggering DMCA protection. And thus, if you choose to interoperate"}, {"Time_Start": 522.14, "Time_End": 526.4200000000001, "Text": " with the content, to interoperate with the medium, to interoperate with the technology without"}, {"Time_Start": 526.4200000000001, "Time_End": 530.46, "Text": " permission, you'll be a DMCA violator, as the courts have interpreted it."}, {"Time_Start": 530.98, "Time_End": 534.84, "Text": " The industry feels that DVD is the fundamental vindication of this approach,"}, {"Time_Start": 535.24, "Time_End": 537.86, "Text": " because DVD is a proprietary licensed technology,"}, {"Time_Start": 538.36, "Time_End": 542.94, "Text": " and people agreed contractually to various restrictions on the future set that they could implement"}, {"Time_Start": 542.94, "Time_End": 544.02, "Text": " when they implemented DVD."}, {"Time_Start": 545.14, "Time_End": 547.1, "Text": " A lot of people feel..."}, {"Time_Start": 547.1, "Time_End": 547.62, "Text": " There's a question?"}, {"Time_Start": 548.26, "Time_End": 549.22, "Text": " Yes, quickly."}, {"Time_Start": 549.22, "Time_End": 554.12, "Text": " What differentiates open versus proprietary in the purposes of this discussion?"}, {"Time_Start": 554.12, "Time_End": 559.74, "Text": " A legal term called effective, whether something in the ordinary course of its operation,"}, {"Time_Start": 560.22, "Time_End": 560.78, "Text": " a vague term."}, {"Time_Start": 560.98, "Time_End": 566.74, "Text": " effectively controls access or effectively protects the right of a copyright holder."}, {"Time_Start": 566.74, "Time_End": 573.22, "Text": " There are lots of court cases trying to define effective, and that's a complicated legal question."}, {"Time_Start": 573.22, "Time_End": 579.74, "Text": " But it basically, it's very important, they have to actually do something in order to prevent"}, {"Time_Start": 579.74, "Time_End": 585.9200000000001, "Text": " you from interoperating, and what they do has to be at least powerful enough that you would have"}, {"Time_Start": 585.9200000000001, "Time_End": 588.16, "Text": " to do something to get around it."}, {"Time_Start": 588.16, "Time_End": 590.96, "Text": " And that's very important because what we're going to see with the broadcast flag,"}, {"Time_Start": 590.98, "Time_End": 596.36, "Text": " is an erosion of that standard into, even if you don't have to do anything to get around it,"}, {"Time_Start": 596.4200000000001, "Time_End": 598.6800000000001, "Text": " people will try to impose additional regulations on you."}, {"Time_Start": 600.1, "Time_End": 602.24, "Text": " But the DMCA did not go that far."}, {"Time_Start": 602.9200000000001, "Time_End": 607.9200000000001, "Text": " So a lot of people in industry feel that DMCA was, I'm sorry, that DVD was this great vindication"}, {"Time_Start": 607.9200000000001, "Time_End": 611.74, "Text": " because DVD was this industry licensed thing."}, {"Time_Start": 612.3000000000001, "Time_End": 613.58, "Text": " It uses encryption."}, {"Time_Start": 614.22, "Time_End": 617.38, "Text": " As we discovered in the Quirley case, it triggers DMCA protection."}, {"Time_Start": 618.16, "Time_End": 620.8000000000001, "Text": " And it's popular with consumers."}, {"Time_Start": 620.98, "Time_End": 625.1, "Text": " And so they say, but if we didn't have the DMCA, we never could have done this."}, {"Time_Start": 625.88, "Time_End": 629.52, "Text": " And so this is, in the view of a lot of industry people, the new norm."}, {"Time_Start": 630.2, "Time_End": 634.72, "Text": " You want to interoperate, you go, you negotiate, you get a license, you get permission."}, {"Time_Start": 635.26, "Time_End": 637.14, "Text": " That's the way things are going to be in the future."}, {"Time_Start": 638.48, "Time_End": 641.0, "Text": " We don't really like that, but that's the industry view."}, {"Time_Start": 642.0, "Time_End": 648.54, "Text": " The Motion Picture Association feels that even this legal regime does not go far enough to protect its interests."}, {"Time_Start": 649.22, "Time_End": 650.96, "Text": " Because sometimes for very very much."}, {"Time_Start": 650.98, "Time_End": 656.6, "Text": " various reasons, primarily what they refer to as legacy reasons, movies might still"}, {"Time_Start": 656.6, "Time_End": 660.26, "Text": " be available to people in unregulated open technologies."}, {"Time_Start": 661.16, "Time_End": 666.1800000000001, "Text": " The recording industry is kind of conflicted over whether it wants more restrictions or not."}, {"Time_Start": 666.84, "Time_End": 672.26, "Text": " The Recording Industry Association signed a pledge not to seek any regulations of open technologies,"}, {"Time_Start": 672.76, "Time_End": 675.74, "Text": " and then it went back on that pledge and started advocating such restrictions."}, {"Time_Start": 676.1800000000001, "Time_End": 678.24, "Text": " So we're not sure exactly how they think about this."}, {"Time_Start": 678.74, "Time_End": 680.96, "Text": " The motion picture industry has never claimed that the motion picture industry has never claimed that"}, {"Time_Start": 680.98, "Time_End": 685.62, "Text": " the DMCA went far enough and has always claimed that additional regulations on top of"}, {"Time_Start": 685.62, "Time_End": 687.6800000000001, "Text": " the DMCA would be necessary from their point of view."}, {"Time_Start": 688.46, "Time_End": 693.12, "Text": " So I had a few examples of things that the DMCA does not control the feature set of"}, {"Time_Start": 693.12, "Time_End": 694.34, "Text": " implementations of."}, {"Time_Start": 694.9200000000001, "Time_End": 703.44, "Text": " Audio CDs, things like MP3 streams, analog recordings like VHS, television broadcasts, that's"}, {"Time_Start": 703.44, "Time_End": 710.52, "Text": " what we're going to be talking about today, analog outputs from DVD or satellite, and analog outputs from"}, {"Time_Start": 710.52, "Time_End": 712.38, "Text": " cable, even premium cable."}, {"Time_Start": 712.92, "Time_End": 718.12, "Text": " So all of these things are uncontrolled, meaning that regardless of what copyright works may be present,"}, {"Time_Start": 718.62, "Time_End": 722.96, "Text": " regardless of what indication people may have about what policies copyright holders prefer,"}, {"Time_Start": 723.5, "Time_End": 729.18, "Text": " the DMCA does not reach far enough to allow copyright holders to dictate to technology implementers"}, {"Time_Start": 729.18, "Time_End": 731.64, "Text": " what they may do with these sources."}, {"Time_Start": 732.6999999999999, "Time_End": 736.5, "Text": " So MPAA said there are three technologies that particularly worry them."}, {"Time_Start": 737.16, "Time_End": 740.5, "Text": " They want these technologies to be regulated because these technologies are particularly"}, {"Time_Start": 740.52, "Time_End": 745.02, "Text": " particularly threatening. The first is unencrypted digital television broadcast"}, {"Time_Start": 745.02, "Time_End": 752.4, "Text": " over the air. The second is analog captures, the so-called analog whole. We started to make"}, {"Time_Start": 752.4, "Time_End": 757.62, "Text": " fun of them over the term analog whole, so they renamed it the analog reconversion problem, or analog"}, {"Time_Start": 757.62, "Time_End": 763.1999999999999, "Text": " reconversion issue. The analog issue is a very fundamental issue. In order for something to be"}, {"Time_Start": 763.1999999999999, "Time_End": 769.46, "Text": " perceived by a person, it needs to be converted back into an analog form. At that point, it can be digitized"}, {"Time_Start": 769.46, "Time_End": 771.94, "Text": " by any device that can digitize an analog signal."}, {"Time_Start": 772.08, "Time_End": 775.34, "Text": " So, for example, you might have a DVD."}, {"Time_Start": 776.22, "Time_End": 780.48, "Text": " The DVD has to be converted into an analog format for you to perceive it."}, {"Time_Start": 780.9200000000001, "Time_End": 785.08, "Text": " If it's converted into an electrical analog format, like NTSC, like S-video,"}, {"Time_Start": 785.62, "Time_End": 790.36, "Text": " you can plug that into the input of an analog-to-digital converter, a video digitizer,"}, {"Time_Start": 790.9000000000001, "Time_End": 791.98, "Text": " and you can digitize it."}, {"Time_Start": 792.08, "Time_End": 794.86, "Text": " And regardless of the encryption that may have existed in the first place,"}, {"Time_Start": 795.62, "Time_End": 799.44, "Text": " the encryption will not serve to prevent it from being re-digitized as the industry."}, {"Time_Start": 799.46, "Time_End": 806.26, "Text": " says. And that can be done with very high quality. There's no theoretical amount of noise"}, {"Time_Start": 806.26, "Time_End": 811.08, "Text": " that will necessarily be there. You know that noise is added, but there's no law of physics"}, {"Time_Start": 811.08, "Time_End": 814.86, "Text": " that says that it has to be very much noise. And if you get good equipment, it may be very"}, {"Time_Start": 814.86, "Time_End": 819.1, "Text": " little. So they say there's this analog hole and it's a big problem, and they want to regulate"}, {"Time_Start": 819.1, "Time_End": 823.7, "Text": " analog to digital converters. And they are trying to do that and they haven't done it yet. And"}, {"Time_Start": 823.7, "Time_End": 828.7, "Text": " that's an interesting issue that's still alive. And finally, if people do decrypt or do use the"}, {"Time_Start": 828.7, "Time_End": 832.88, "Text": " analog hole to re-digitize something, they may use file sharing or other uncontrolled"}, {"Time_Start": 832.88, "Time_End": 837.6400000000001, "Text": " channels. And the motion picture industries say that they would like to be able to detect"}, {"Time_Start": 837.6400000000001, "Time_End": 844.5600000000001, "Text": " when that has occurred and after the fact apply some control upon detecting that this has"}, {"Time_Start": 844.5600000000001, "Time_End": 849.6400000000001, "Text": " occurred. And that means some kind of watermark detector inside PC is somewhere or inside PC"}, {"Time_Start": 849.6400000000001, "Time_End": 854.3000000000001, "Text": " displays somewhere. So when you decrypt the thing and you circulate it or you record it on some"}, {"Time_Start": 854.3000000000001, "Time_End": 858.6800000000001, "Text": " medium, they're going to notice, oh, this is actually some commercial"}, {"Time_Start": 858.7, "Time_End": 862.94, "Text": " visual work that has been decrypted. So now that we know that, we're going to"}, {"Time_Start": 862.94, "Time_End": 867.5600000000001, "Text": " reimpose restrictions on how it can be used. And MPAA has said very publicly and"}, {"Time_Start": 867.5600000000001, "Time_End": 872.5, "Text": " repeatedly, especially during the tenure of former MPAA president Jack Valenti, who recently"}, {"Time_Start": 872.5, "Time_End": 877.96, "Text": " retired in favor of Mr. Glickman, former Secretary of Agriculture, they've said they're going to seek"}, {"Time_Start": 877.96, "Time_End": 882.8000000000001, "Text": " these three additional regulations on top of the DMCA because all of those three"}, {"Time_Start": 882.8000000000001, "Time_End": 887.6800000000001, "Text": " technologies are essentially open standards or open formats that the DMCA regulation does"}, {"Time_Start": 887.6800000000001, "Time_End": 893.94, "Text": " not reach. So Fox, News Corporation, in 2001, invented something that they called the"}, {"Time_Start": 893.94, "Time_End": 900.6, "Text": " broadcast flag. Because U.S. digital television broadcast over the air is digital and unencrypted,"}, {"Time_Start": 901.1, "Time_End": 906.2800000000001, "Text": " there are no DMCA restrictions on what you can do with it when you receive it. So Fox said,"}, {"Time_Start": 906.2800000000001, "Time_End": 910.7600000000001, "Text": " well, there ought to be something in the headers, something in the metadata that would indicate"}, {"Time_Start": 910.7600000000001, "Time_End": 917.5000000000001, "Text": " that a copyright holder doesn't want something to be redistributed to the public. Once we've"}, {"Time_Start": 917.5, "Time_End": 921.38, "Text": " defined that metadata, we can seek legislation based on it. We can seek regulations"}, {"Time_Start": 921.38, "Time_End": 926.5, "Text": " based on it. So they invented this. They can indicate when they want a device to obey some"}, {"Time_Start": 926.5, "Time_End": 931.06, "Text": " kind of redistribution control rule, and then in their ideal world, devices will recognize it and"}, {"Time_Start": 931.06, "Time_End": 937.36, "Text": " comply. I asked one of the people who invented the broadcast flag back in 2001, why would a device"}, {"Time_Start": 937.36, "Time_End": 942.7, "Text": " maker comply with these restrictions? And his first answer was, well, they recognize that it's the"}, {"Time_Start": 942.7, "Time_End": 947.48, "Text": " right thing to do. His second answer was, they recognized that they have a show."}, {"Time_Start": 947.5, "Time_End": 951.22, "Text": " interest in the continuing viability of commercial audiovisual content"}, {"Time_Start": 951.22, "Time_End": 955.78, "Text": " distribution and his third answer was we might need to seek a little regulation of"}, {"Time_Start": 955.78, "Time_End": 960.76, "Text": " some sort the third answer turned out to be the most powerful answer of those"}, {"Time_Start": 960.76, "Time_End": 965.14, "Text": " three so the standards committee allocated them some space in the headers in a"}, {"Time_Start": 965.14, "Time_End": 970.6, "Text": " thing called the PCIP table which contains things that describe what's on like"}, {"Time_Start": 970.6, "Time_End": 975.22, "Text": " the program title or a program rating similar to where they have closed caption"}, {"Time_Start": 975.22, "Time_End": 977.48, "Text": " data so the standards committee says"}, {"Time_Start": 977.5, "Time_End": 982.32, "Text": " and you can have this flag indicating whether you want to claim redistribution control"}, {"Time_Start": 982.32, "Time_End": 987.1, "Text": " or not. But they didn't say that it meant anything or that anyone had to do anything about it."}, {"Time_Start": 987.16, "Time_End": 992.08, "Text": " They just said you can have this header. So then people went to the copy protection"}, {"Time_Start": 992.08, "Time_End": 996.32, "Text": " technical working group where we frequently participate and said, let's have a discussion"}, {"Time_Start": 996.32, "Time_End": 1002.5, "Text": " about what this flag should mean, what devices ought to do when they see the flag in this unencrypted"}, {"Time_Start": 1002.5, "Time_End": 1007.04, "Text": " stream. How should they react? So essentially it was a big negotiation where a bunch of people"}, {"Time_Start": 1007.0400000000001, "Time_End": 1010.5000000000001, "Text": " wrote some legislation, but they didn't call it that. They called it a technical"}, {"Time_Start": 1010.5000000000001, "Time_End": 1015.6200000000001, "Text": " discussion about what the right way for a device to respond would be. And it happened to include"}, {"Time_Start": 1015.6200000000001, "Time_End": 1019.8800000000001, "Text": " things like, well, the device should be hard for users to modify because they might remove this"}, {"Time_Start": 1019.8800000000001, "Time_End": 1024.64, "Text": " protection. So it actually read like legislation. It even had legislation section numbers."}, {"Time_Start": 1025.22, "Time_End": 1030.98, "Text": " They called it like x.2, you know, code section X, subsection one, code section X subsection"}, {"Time_Start": 1030.98, "Time_End": 1035.76, "Text": " two, but they didn't call legislation. And then they had a big political argument for the better part"}, {"Time_Start": 1035.76, "Time_End": 1041.42, "Text": " of a year about whether they had reached a consensus or not. And at the same time, a lot of"}, {"Time_Start": 1041.42, "Time_End": 1045.52, "Text": " people were lobbying Congress and saying, look, this industry group is coming up with this"}, {"Time_Start": 1045.52, "Time_End": 1051.52, "Text": " thing. You ought to make it the law that devices that receive TV should follow these rules"}, {"Time_Start": 1051.52, "Time_End": 1059.42, "Text": " that we in industry have written. The Congress flirted with this a bit and then kicked it over"}, {"Time_Start": 1059.42, "Time_End": 1063.4, "Text": " to the Federal Communications Commission, which opened up a docket, which went on for a long time,"}, {"Time_Start": 1063.4, "Time_End": 1065.74, "Text": " lots of comments, lots of arguments, about whether"}, {"Time_Start": 1065.76, "Time_End": 1071.42, "Text": " the FCC should impose these rules or some other rules on device manufacturers who make"}, {"Time_Start": 1071.42, "Time_End": 1075.82, "Text": " digital television devices. If they didn't do that, the devices would keep on ignoring"}, {"Time_Start": 1075.82, "Time_End": 1080.14, "Text": " the flag, because this is a standard that's been standardized, people are broadcasting in this"}, {"Time_Start": 1080.14, "Time_End": 1086.16, "Text": " format. There are devices out there that receive this. So in the absence of a law, as we found,"}, {"Time_Start": 1086.72, "Time_End": 1090.54, "Text": " devices would not obey this. They would not react to it. It would just be, oh, that's"}, {"Time_Start": 1090.54, "Time_End": 1095.66, "Text": " some interesting metadata. Okay, we don't care. My analogy is, imagine if your email,"}, {"Time_Start": 1095.76, "Time_End": 1101.06, "Text": " could have an X no forward header, indicating that you didn't want a message to be forwarded"}, {"Time_Start": 1101.06, "Time_End": 1107.06, "Text": " to anybody. And then you say, user agents ought to detect the presence of the no forward header"}, {"Time_Start": 1107.06, "Time_End": 1112.24, "Text": " in email and obey it. They ought to refuse to forward an email message that has the no forward"}, {"Time_Start": 1112.24, "Time_End": 1117.56, "Text": " header. So, of course, the only way you can do that is make it illegal to write a mail user agent"}, {"Time_Start": 1117.56, "Time_End": 1122.78, "Text": " that fails to respect the no forward header. There is the slight inconvenience that the email"}, {"Time_Start": 1122.78, "Time_End": 1125.74, "Text": " standards, RFC822 and so on, are public,"}, {"Time_Start": 1125.76, "Time_End": 1131.22, "Text": " standards with no encryption. So you have to rely on fining or imprisoning those"}, {"Time_Start": 1131.22, "Time_End": 1136.22, "Text": " people who choose to continue to implement the public email standards without respecting your"}, {"Time_Start": 1136.22, "Time_End": 1141.0, "Text": " no forward header. That is exactly what the Motion Picture Association successfully asked"}, {"Time_Start": 1141.0, "Time_End": 1146.8799999999999, "Text": " the Federal Communications Commission to do. Their main arguments were, it's not safe to have"}, {"Time_Start": 1146.8799999999999, "Time_End": 1151.82, "Text": " unencrypted HDTV programming because file sharing will destroy our markets and various"}, {"Time_Start": 1151.82, "Time_End": 1155.6, "Text": " things like this. They also said the industry is converging on DRM. Everyone in"}, {"Time_Start": 1155.6000000000001, "Time_End": 1161.0400000000002, "Text": " industry is agreed that DRM is the norm. So now it's kind of weird and retro and legacy"}, {"Time_Start": 1161.0400000000002, "Time_End": 1166.5600000000002, "Text": " to have an unencrypted media format. And at the very least, you can steer the content out of the"}, {"Time_Start": 1166.5600000000002, "Time_End": 1171.5200000000002, "Text": " unencrypted media format into the more modern DRM proprietary format, because that's where industry is"}, {"Time_Start": 1171.5200000000002, "Time_End": 1177.3600000000001, "Text": " going. They said this is just the beginning of a larger framework to control infringement. So if it's not"}, {"Time_Start": 1177.3600000000001, "Time_End": 1181.44, "Text": " complete in itself, you at least have to make your journey of a thousand miles begin with a single"}, {"Time_Start": 1181.44, "Time_End": 1185.0400000000002, "Text": " regulation. And finally, the most powerful argument was,"}, {"Time_Start": 1185.6000000000001, "Time_End": 1191.4800000000002, "Text": " We will not provide our content for digital television broadcast unless you adopt"}, {"Time_Start": 1191.4800000000002, "Time_End": 1197.68, "Text": " a rule. That was the key argument. The argument was we are going to boycott the digital"}, {"Time_Start": 1197.68, "Time_End": 1203.72, "Text": " television transition if you don't do this. And the digital television transition is very important"}, {"Time_Start": 1203.72, "Time_End": 1209.1000000000001, "Text": " to the FCC. From the point of view of Congress, it's perhaps the most important thing that"}, {"Time_Start": 1209.1000000000001, "Time_End": 1215.5800000000002, "Text": " the FCC is now undertaking. And so when essentially all of the major movie studios and"}, {"Time_Start": 1215.6000000000001, "Time_End": 1219.6000000000001, "Text": " And some of the networks that they owned and were friends with, said,"}, {"Time_Start": 1219.6000000000001, "Time_End": 1222.38, "Text": " we're going to start boycotting this transition."}, {"Time_Start": 1222.38, "Time_End": 1225.92, "Text": " We're going to have to withhold our high quality content."}, {"Time_Start": 1225.92, "Time_End": 1229.1200000000001, "Text": " Our joke was, hey, nice television format you've got here."}, {"Time_Start": 1229.1200000000001, "Time_End": 1231.92, "Text": " It'd be a real shame if something happened to it."}, {"Time_Start": 1234.42, "Time_End": 1237.0000000000002, "Text": " So that was a fairly persuasive argument."}, {"Time_Start": 1237.0000000000002, "Time_End": 1242.0400000000002, "Text": " We and some technology companies said, this is a bad idea."}, {"Time_Start": 1242.0400000000002, "Time_End": 1243.6000000000001, "Text": " First of all, these files are huge."}, {"Time_Start": 1243.6000000000001, "Time_End": 1245.5800000000002, "Text": " On here, there are about six gigableness."}, {"Time_Start": 1245.6000000000001, "Time_End": 1249.44, "Text": " per hour. So it's kind of hard to imagine that people are actually going to send them over"}, {"Time_Start": 1249.44, "Time_End": 1254.4, "Text": " file sharing networks. It's not like an MP3 track where you've got like two"}, {"Time_Start": 1254.4, "Time_End": 1258.6000000000001, "Text": " megabytes. If you record an hour show, it's going to be six gigabytes. That's kind of"}, {"Time_Start": 1258.6000000000001, "Time_End": 1263.3600000000001, "Text": " difficult to download for most people. So maybe that's not going to be such a big threat."}, {"Time_Start": 1263.3600000000001, "Time_End": 1268.66, "Text": " We also said as a policy matter, this is a really bad idea. It's going to make digital television"}, {"Time_Start": 1268.66, "Time_End": 1272.9800000000002, "Text": " technology cost more and do less. It's going to be bad for innovation because there will be these"}, {"Time_Start": 1272.9800000000002, "Time_End": 1275.3000000000002, "Text": " gatekeepers. You need to ask them permission."}, {"Time_Start": 1275.6000000000001, "Time_End": 1277.6000000000001, "Text": " That hasn't been the case before."}, {"Time_Start": 1277.6000000000001, "Time_End": 1281.6000000000001, "Text": " It will be bad for fair use because it will inevitably prevent people from doing some lawful"}, {"Time_Start": 1281.6000000000001, "Time_End": 1287.6000000000001, "Text": " things with their television programming, such as sending clips to family members or a lot of other things."}, {"Time_Start": 1287.6000000000001, "Time_End": 1293.6000000000001, "Text": " It will be bad for open source because you won't be able to implement it in open source because of these temper resistance requirements,"}, {"Time_Start": 1293.6000000000001, "Time_End": 1295.6000000000001, "Text": " these robustness requirements, euphemistically."}, {"Time_Start": 1295.6000000000001, "Time_End": 1303.6000000000001, "Text": " And it's a bad regulatory precedent because it suggests that any time an open standard scares entertainment copyright holders,"}, {"Time_Start": 1303.6000000000001, "Time_End": 1305.6000000000001, "Text": " they can just come in and see them."}, {"Time_Start": 1305.6000000000001, "Time_End": 1309.9, "Text": " set rules for how people can use that open standard, which goes far beyond the DMCA."}, {"Time_Start": 1310.42, "Time_End": 1313.1000000000001, "Text": " And if you let them do it this time, they'll keep coming back and saying,"}, {"Time_Start": 1313.4, "Time_End": 1316.3200000000002, "Text": " this technology is too big at risk, that technology is too big at risk."}, {"Time_Start": 1316.38, "Time_End": 1318.16, "Text": " You've got to regulate this and that and the other thing."}, {"Time_Start": 1318.7800000000002, "Time_End": 1320.88, "Text": " Finally, it won't work well because there are lots of holes."}, {"Time_Start": 1321.44, "Time_End": 1324.18, "Text": " One of our filings said, this isn't a solution, it's a sieve."}, {"Time_Start": 1325.4, "Time_End": 1329.5000000000002, "Text": " One of the holes we're advocating here today, which is the fact that devices manufactured"}, {"Time_Start": 1329.5000000000002, "Time_End": 1333.64, "Text": " before the regulation takes effect will continue to work because there's no change in the format."}, {"Time_Start": 1334.18, "Time_End": 1335.5800000000002, "Text": " That's the so-called legacy hole."}, {"Time_Start": 1335.6000000000001, "Time_End": 1341.8200000000002, "Text": " There's also the analog hole, software-defined radio, which I'll talk about, and the DVI grandfathering in,"}, {"Time_Start": 1342.0200000000002, "Time_End": 1345.18, "Text": " because a bunch of people had DVI monitors that don't do DRM,"}, {"Time_Start": 1345.4800000000002, "Time_End": 1348.5400000000002, "Text": " so they said if you give a slightly resolution-reduced DVI output,"}, {"Time_Start": 1348.68, "Time_End": 1351.22, "Text": " that doesn't need to be encrypted for legacy reasons forever."}, {"Time_Start": 1352.42, "Time_End": 1353.5600000000002, "Text": " So there are a lot of holes."}, {"Time_Start": 1353.9800000000002, "Time_End": 1357.7400000000002, "Text": " Also, it's a public standard with no crypto, so anybody can implement it."}, {"Time_Start": 1358.14, "Time_End": 1361.1000000000001, "Text": " Small numbers of people have gotten together and implemented this from scratch."}, {"Time_Start": 1361.64, "Time_End": 1365.4800000000002, "Text": " So it's not necessary, it's a harmful thing,"}, {"Time_Start": 1365.6000000000001, "Time_End": 1372.18, "Text": " it's not going to work well. The FCC adopted the rule. The pressure of the, we're going"}, {"Time_Start": 1372.18, "Time_End": 1376.66, "Text": " to boycott the digital television transition, was too politically difficult for them to resist,"}, {"Time_Start": 1376.8200000000002, "Time_End": 1383.0200000000002, "Text": " and they said, as of July 1st, 2005, less than one year from the date of our current presentation,"}, {"Time_Start": 1384.4, "Time_End": 1391.2600000000002, "Text": " devices that are manufactured that receive terrestrial digital television broadcast, as well as"}, {"Time_Start": 1391.2600000000002, "Time_End": 1395.5000000000002, "Text": " certain cable TV things that are still being argued about, and so we're not going to address that in"}, {"Time_Start": 1395.6000000000001, "Time_End": 1402.4800000000002, "Text": " presentation may only output or record digital television programs that have this flag"}, {"Time_Start": 1402.4800000000002, "Time_End": 1409.4800000000002, "Text": " to analog outputs, to government-approved DRM technologies, or to certain weird exceptions like this legacy"}, {"Time_Start": 1409.4800000000002, "Time_End": 1415.9800000000002, "Text": " DVI thing, and they must not be modifiable. The term is robustness by a user to do otherwise."}, {"Time_Start": 1417.0800000000002, "Time_End": 1423.1000000000001, "Text": " So all of your DTV receivers have to be tamper resistant. There is a court challenge led by public"}, {"Time_Start": 1423.1000000000001, "Time_End": 1428.44, "Text": " acknowledge, we are a party to the court challenge. A bunch of non-profit groups are saying"}, {"Time_Start": 1428.44, "Time_End": 1433.6000000000001, "Text": " that the FCC lacked authority to impose the broadcast flag rule. We heard yesterday that people"}, {"Time_Start": 1433.6000000000001, "Time_End": 1439.0800000000002, "Text": " in the movie industry are not giving us very good odds with this challenge. We're optimistic"}, {"Time_Start": 1439.0800000000002, "Time_End": 1443.7600000000002, "Text": " because we think that there's no precedent for the FCC doing something like this without express"}, {"Time_Start": 1443.7600000000002, "Time_End": 1449.3200000000002, "Text": " congressional authority. Congress didn't specifically say that they could do this, and the court"}, {"Time_Start": 1449.3200000000002, "Time_End": 1451.3200000000002, "Text": " challenge is just getting started. We'll see where it goes."}, {"Time_Start": 1451.32, "Time_End": 1457.1399999999999, "Text": " The broadcast flag is very strange because there's no encryption, there's"}, {"Time_Start": 1457.1399999999999, "Time_End": 1462.86, "Text": " just this legal regulation. It sends a really weird message. As we parse the message, it is,"}, {"Time_Start": 1463.12, "Time_End": 1468.6799999999998, "Text": " if your open standard is too threatening to copyright holders, it can be made proprietary retroactively"}, {"Time_Start": 1468.6799999999998, "Time_End": 1474.9399999999998, "Text": " through legislation or regulation. That's a scary message to us. And as we've seen copyright"}, {"Time_Start": 1474.9399999999998, "Time_End": 1480.32, "Text": " industries are also targeting other technologies, such as analog to digital converters, potentially"}, {"Time_Start": 1480.32, "Time_End": 1485.78, "Text": " digital to analog converters, file sharing software with legislation like the"}, {"Time_Start": 1485.78, "Time_End": 1490.82, "Text": " Induce Act, and recently digital radio, which like digital television is also unencrypted, and"}, {"Time_Start": 1490.82, "Time_End": 1495.26, "Text": " they've argued that that's an unreasonable risk, so that the receivers should be regulated and forced"}, {"Time_Start": 1495.26, "Time_End": 1500.46, "Text": " to apply DRM. So I'm going to go back to Wendy for a continuing discussion leading into"}, {"Time_Start": 1500.46, "Time_End": 1502.96, "Text": " our cool personal video recorder project."}, {"Time_Start": 1504.96, "Time_End": 1510.1799999999998, "Text": " Thanks, Seth. So if Seth was saying the broadcast flag is weird, broadcast flag is weird,"}, {"Time_Start": 1510.32, "Time_End": 1516.08, "Text": " technologically, because of all of the problems with implementation and the technical"}, {"Time_Start": 1516.08, "Time_End": 1520.5, "Text": " realities that it doesn't take account of, it's also weird from a copyright law perspective."}, {"Time_Start": 1521.1, "Time_End": 1526.78, "Text": " Traditionally, U.S. copyright law is to promote the progress of science and useful arts."}, {"Time_Start": 1527.2, "Time_End": 1532.3799999999999, "Text": " Copyright law gives a basket of exclusive rights to the copyright holder in order to promote"}, {"Time_Start": 1532.3799999999999, "Time_End": 1537.4399999999998, "Text": " public benefit, public access to those works, and after the expiration of the copyright,"}, {"Time_Start": 1538.1799999999998, "Time_End": 1540.2, "Text": " their entry into the public domain."}, {"Time_Start": 1540.32, "Time_End": 1547.32, "Text": " The copyright law started out at the founding, a fairly narrow bundle of rights,"}, {"Time_Start": 1547.32, "Time_End": 1554.32, "Text": " a narrow set of rights, and a narrow restriction on what the public could do."}, {"Time_Start": 1554.32, "Time_End": 1564.32, "Text": " You couldn't copy, vend, or distribute charts, maps, and books, and the founder's copyright."}, {"Time_Start": 1564.8, "Time_End": 1570.3, "Text": " Now you can't reproduce, distribute, distribute, make derivative works of publicly perform, publicly"}, {"Time_Start": 1570.32, "Time_End": 1576.32, "Text": " display or publicly digitally perform anything that a copyright holder has fixed"}, {"Time_Start": 1576.32, "Time_End": 1581.76, "Text": " in a tangible medium of expression and anything in everything and everything can be subject"}, {"Time_Start": 1581.76, "Time_End": 1586.6799999999998, "Text": " to copyright as soon as it is fixed as long as it's original but at the same time"}, {"Time_Start": 1586.6799999999998, "Time_End": 1594.6, "Text": " copyright is still fairly narrow copyright has been expanding though through"}, {"Time_Start": 1594.6, "Time_End": 1600.3, "Text": " anti-circumvention and a circumvention law says that if a copyright holder applies"}, {"Time_Start": 1600.32, "Time_End": 1605.8799999999999, "Text": " digital locks to a work, then it's a violation of the law to circumvent those copy"}, {"Time_Start": 1605.8799999999999, "Time_End": 1611.06, "Text": " controls, to break those digital locks, even if what you were doing would not be a violation"}, {"Time_Start": 1611.06, "Time_End": 1617.84, "Text": " of copyright. So copyright law has the fair use exception. It's a fair use and not an infringement"}, {"Time_Start": 1617.84, "Time_End": 1623.8799999999999, "Text": " of copyright to take an excerpt from a movie to use in your critical review or to take a quotation"}, {"Time_Start": 1623.8799999999999, "Time_End": 1630.04, "Text": " from a book and use it in your news report. Not a violation of copyright, but if the copyright"}, {"Time_Start": 1630.04, "Time_End": 1634.98, "Text": " holder has put a digital lock on the work and you need to break that digital lock in order"}, {"Time_Start": 1634.98, "Time_End": 1640.02, "Text": " to get the clip to make your fair use, you might be circumventing. So anti-circumvention"}, {"Time_Start": 1640.02, "Time_End": 1648.08, "Text": " covers much more than copyright and puts a layer of additional restrictions onto the public"}, {"Time_Start": 1648.08, "Time_End": 1654.52, "Text": " what we can do with copyrighted works. Well, take that expansion and go one greater. Technology"}, {"Time_Start": 1654.52, "Time_End": 1660.02, "Text": " mandates, like the broadcast flag, say it shall be unlawful to make a technology that"}, {"Time_Start": 1660.04, "Time_End": 1668.18, "Text": " that doesn't have DRM to protect the digital locks, to protect the copyrighted"}, {"Time_Start": 1668.18, "Time_End": 1674.06, "Text": " expression. You've now got digital locks and technologies. Anyone who makes a technology to deal"}, {"Time_Start": 1674.06, "Time_End": 1680.8, "Text": " with copyrighted works now has the government's finger in that design process. And the broadcast flag"}, {"Time_Start": 1680.8, "Time_End": 1689.8799999999999, "Text": " says anyone who makes a digital TV tuner has got to go through the FCC licensing process or use"}, {"Time_Start": 1689.88, "Time_End": 1694.6200000000001, "Text": " approved technologies. You can't just go to your garage and build what you think would work"}, {"Time_Start": 1694.6200000000001, "Time_End": 1702.2, "Text": " best for the public. You're, and you can't rely on the Sony's Beta Max standard of substantial"}, {"Time_Start": 1702.2, "Time_End": 1707.38, "Text": " non-infringing use to say that because most of what people can do with this technology"}, {"Time_Start": 1707.38, "Time_End": 1714.3200000000002, "Text": " or is non-infringing and fair, our technology is good. Instead, you're stuck with"}, {"Time_Start": 1714.3200000000002, "Time_End": 1719.8600000000001, "Text": " get approval first. And, uh, look,"}, {"Time_Start": 1719.88, "Time_End": 1725.2600000000002, "Text": " promising technologies are unlikely to see the light of day because of that kind of restriction."}, {"Time_Start": 1727.22, "Time_End": 1735.3000000000002, "Text": " And the way in which that process becomes political gives a very significant negotiating leverage to copyright holders."}, {"Time_Start": 1735.8400000000001, "Time_End": 1741.8600000000001, "Text": " Because now that there's a political approval or disapproval process, there's an opportunity for copyright holders to say,"}, {"Time_Start": 1742.5400000000002, "Time_End": 1745.5, "Text": " we don't trust that technology. We don't like that technology."}, {"Time_Start": 1746.18, "Time_End": 1749.8600000000001, "Text": " And their reason for doing that may be some kind of marketplace reason."}, {"Time_Start": 1749.88, "Time_End": 1751.74, "Text": " that's unrelated to their stated reason."}, {"Time_Start": 1752.1000000000001, "Time_End": 1753.7, "Text": " So that's an additional risk from this."}, {"Time_Start": 1756.24, "Time_End": 1758.22, "Text": " So what does this mean for the public?"}, {"Time_Start": 1758.74, "Time_End": 1759.5800000000002, "Text": " General public,"}, {"Time_Start": 1760.0800000000002, "Time_End": 1763.9, "Text": " Joe Q average, any tuner or digital video recorder you buy"}, {"Time_Start": 1763.9, "Time_End": 1765.8400000000001, "Text": " will have DRM baked in."}, {"Time_Start": 1766.8600000000001, "Time_End": 1769.0200000000002, "Text": " And can you record to a plain old DVD?"}, {"Time_Start": 1769.3000000000002, "Time_End": 1770.5, "Text": " Can you send a clip to your mother?"}, {"Time_Start": 1770.64, "Time_End": 1773.2800000000002, "Text": " Can you watch TV recorded in one place on the plane"}, {"Time_Start": 1773.2800000000002, "Time_End": 1777.5200000000002, "Text": " or at another house or lend a disc to your friend to watch?"}, {"Time_Start": 1778.18, "Time_End": 1779.5400000000002, "Text": " Those are questions that"}, {"Time_Start": 1779.54, "Time_End": 1784.92, "Text": " we don't know the answers to, but if the motion picture industry has its way in the various"}, {"Time_Start": 1784.92, "Time_End": 1789.1, "Text": " technologies that are approved, the answer to all of those will probably be no."}, {"Time_Start": 1790.3, "Time_End": 1795.1599999999999, "Text": " Legitimate, non-infringing uses of television will be blocked because you won't be able to buy"}, {"Time_Start": 1795.1599999999999, "Time_End": 1798.22, "Text": " the technological device you need to make those uses."}, {"Time_Start": 1799.04, "Time_End": 1803.62, "Text": " The average consumer who can't hack his machine will just be stuck."}, {"Time_Start": 1806.32, "Time_End": 1808.34, "Text": " So what does this mean for the geeks?"}, {"Time_Start": 1808.34, "Time_End": 1809.52, "Text": " You can't hack your machine."}, {"Time_Start": 1809.54, "Time_End": 1811.56, "Text": " why should you be concerned?"}, {"Time_Start": 1811.82, "Time_End": 1812.82, "Text": " Some may ask."}, {"Time_Start": 1813.12, "Time_End": 1818.2, "Text": " Well, it still means that any tune or digital video recorder you can buy will have the DRM baked in."}, {"Time_Start": 1818.54, "Time_End": 1822.28, "Text": " And maybe you can hack the hardware to build your own DVR,"}, {"Time_Start": 1822.48, "Time_End": 1826.1, "Text": " but no compliant device will work with open source drivers"}, {"Time_Start": 1826.1, "Time_End": 1829.46, "Text": " because open source is by definition not temper resistant."}, {"Time_Start": 1830.02, "Time_End": 1833.7, "Text": " And it is designed to be user modifiable."}, {"Time_Start": 1833.7, "Time_End": 1838.0, "Text": " Well, if you can comment out the if broadcast flag don't save,"}, {"Time_Start": 1838.0, "Time_End": 1841.06, "Text": " then broadcast flag doesn't do much good."}, {"Time_Start": 1841.14, "Time_End": 1844.6, "Text": " Well, the NPA may be politically stupid."}, {"Time_Start": 1845.04, "Time_End": 1848.1, "Text": " They're maybe opposed to us, but they're not stupid."}, {"Time_Start": 1848.4, "Time_End": 1851.64, "Text": " They recognize that, and they would clearly oppose anything"}, {"Time_Start": 1851.64, "Time_End": 1853.98, "Text": " that was implementable in open source"}, {"Time_Start": 1853.98, "Time_End": 1857.7, "Text": " and would likely be able to convince the FCC"}, {"Time_Start": 1857.7, "Time_End": 1859.6, "Text": " that that was not temper-resistant"}, {"Time_Start": 1859.6, "Time_End": 1863.0, "Text": " and that would not give them the protection"}, {"Time_Start": 1863.0, "Time_End": 1866.2, "Text": " that the FCC has already said it will give them."}, {"Time_Start": 1867.1, "Time_End": 1867.82, "Text": " So Brad Hunt,"}, {"Time_Start": 1868.0, "Time_End": 1872.86, "Text": " We recently had an article in Wired News talking about our digital television liberation front,"}, {"Time_Start": 1873.22, "Time_End": 1876.3, "Text": " and Brad Hunt, who's CTO of the MPAA, said,"}, {"Time_Start": 1876.3, "Time_End": 1880.2, "Text": " there are a lot of things that are still going to be allowed under the broadcast flag,"}, {"Time_Start": 1880.94, "Time_End": 1885.98, "Text": " as though that was a retort to all of the things that we said were problems with this technology."}, {"Time_Start": 1886.28, "Time_End": 1888.7, "Text": " Well, a lot of things doesn't mean everything."}, {"Time_Start": 1889.0, "Time_End": 1893.06, "Text": " It doesn't mean everything that copyright law permits will still be possible."}, {"Time_Start": 1893.32, "Time_End": 1897.8, "Text": " It means a lot of things that the Motion Picture Association doesn't deem too threatening."}, {"Time_Start": 1898.0, "Time_End": 1903.86, "Text": " And it's precisely that fringe class of uses that the motion picture industry deems threatening"}, {"Time_Start": 1903.86, "Time_End": 1908.34, "Text": " but are not infringements of copyright that it's most important to protect"}, {"Time_Start": 1908.34, "Time_End": 1912.06, "Text": " because it's in that fringe that the technological innovation happens."}, {"Time_Start": 1912.38, "Time_End": 1914.06, "Text": " It's there that we got the VCR."}, {"Time_Start": 1914.26, "Time_End": 1919.04, "Text": " It's there that we got TiVo because they didn't have to ask permission before they developed"}, {"Time_Start": 1919.04, "Time_End": 1924.06, "Text": " because they were allowed to develop the fair uses and then let the court rule on them"}, {"Time_Start": 1924.06, "Time_End": 1927.86, "Text": " that we got rulings that permitted time shifting."}, {"Time_Start": 1928.0, "Time_End": 1933.62, "Text": " that we got concessions from the movie industry that, well, they may not like TiVo."}, {"Time_Start": 1933.82, "Time_End": 1935.46, "Text": " They can't sue it out of existence."}, {"Time_Start": 1935.86, "Time_End": 1938.06, "Text": " They did sue replay TV out of existence."}, {"Time_Start": 1938.72, "Time_End": 1942.84, "Text": " However, for making technology that was slightly less friendly to them,"}, {"Time_Start": 1942.84, "Time_End": 1949.66, "Text": " like having the commercial skip feature instead of just go in through the back door to enable a 30-second advance."}, {"Time_Start": 1950.02, "Time_End": 1952.28, "Text": " But some good news, as we stated at the beginning,"}, {"Time_Start": 1953.26, "Time_End": 1957.98, "Text": " mandate doesn't take effect until July 1, 2005, and for the backwork."}, {"Time_Start": 1958.0, "Time_End": 1962.72, "Text": " it's compatibility and because this is an open standard, tuners built now continue"}, {"Time_Start": 1962.72, "Time_End": 1964.3, "Text": " to work unrestricted."}, {"Time_Start": 1964.84, "Time_End": 1972.2, "Text": " And HDTV tuners are available for PCs running Linux and Windows with drivers under"}, {"Time_Start": 1972.2, "Time_End": 1973.86, "Text": " both of those operating systems."}, {"Time_Start": 1974.36, "Time_End": 1982.48, "Text": " There is a tuner device that's either just became available or will shortly become available"}, {"Time_Start": 1982.48, "Time_End": 1983.8, "Text": " for Mac OS."}, {"Time_Start": 1984.6, "Time_End": 1986.4, "Text": " And again, buy it now."}, {"Time_Start": 1986.6, "Time_End": 1987.78, "Text": " It will continue to work."}, {"Time_Start": 1988.0, "Time_End": 1995.1, "Text": " continue to give you the unencrypted full digital output come July 2nd, 2005."}, {"Time_Start": 1996.78, "Time_End": 2005.78, "Text": " So this box that we've got sitting up here is a Pentium 4, 3 gigahertz machine with the PC"}, {"Time_Start": 2005.78, "Time_End": 2017.82, "Text": " DTV HD-2000 card that is a PC card that receives the digital signal, running on the digital signal."}, {"Time_Start": 2018.0, "Time_End": 2023.52, "Text": " Any flavor of Linux, this one happens to be running Debian, with the software package Myth TV."}, {"Time_Start": 2024.06, "Time_End": 2031.42, "Text": " Myth TV is a free, open source software package that's been developed collaboratively by a team of developers."}, {"Time_Start": 2031.58, "Time_End": 2033.58, "Text": " It was started by Isaac Richards."}, {"Time_Start": 2034.02, "Time_End": 2036.2, "Text": " You can find it online at mythtv.org."}, {"Time_Start": 2036.2, "Time_End": 2047.78, "Text": " And there's continuing development to integrate HDTV drivers and"}, {"Time_Start": 2047.78, "Time_End": 2056.16, "Text": " And improvements to use HDTV even better than it already is, but stock works"}, {"Time_Start": 2056.16, "Time_End": 2062.58, "Text": " well with HDTV projects like Knock Myth, making live CDs that you can boot off the CD"}, {"Time_Start": 2062.58, "Time_End": 2069.88, "Text": " and make a little front end machine or install from the CD to make the DTV recorder"}, {"Time_Start": 2069.88, "Time_End": 2070.88, "Text": " machine."}, {"Time_Start": 2070.88, "Time_End": 2074.08, "Text": " This machine here is a TiVo on steroids."}, {"Time_Start": 2074.58, "Time_End": 2077.7599999999998, "Text": " This machine can record live over the air."}, {"Time_Start": 2077.78, "Time_End": 2081.0800000000004, "Text": " HD TV or standard definition television."}, {"Time_Start": 2081.76, "Time_End": 2086.32, "Text": " It can pause live TV. It can schedule updates."}, {"Time_Start": 2087.46, "Time_End": 2089.98, "Text": " It has a programming guide."}, {"Time_Start": 2091.1200000000003, "Time_End": 2093.32, "Text": " So, MIF TV opening screen."}, {"Time_Start": 2107.78, "Time_End": 2110.02, "Text": " from that line up that you want to record a program."}, {"Time_Start": 2112.02, "Time_End": 2113.84, "Text": " Come into the program"}, {"Time_Start": 2113.84, "Time_End": 2115.3, "Text": " guide, watch the program."}, {"Time_Start": 2116.2400000000002, "Time_End": 2117.84, "Text": " Which is from other programs"}, {"Time_Start": 2117.84, "Time_End": 2121.1400000000003, "Text": " up there. A few screenshots from"}, {"Time_Start": 2121.1400000000003, "Time_End": 2123.1600000000003, "Text": " some HD TV content."}, {"Time_Start": 2125.3, "Time_End": 2127.7000000000003, "Text": " And Myth TV isn't limited"}, {"Time_Start": 2127.7000000000003, "Time_End": 2128.5, "Text": " to..."}, {"Time_Start": 2128.5, "Time_End": 2129.6400000000003, "Text": " I'm just..."}, {"Time_Start": 2129.6400000000003, "Time_End": 2129.9, "Text": " I'm just..."}, {"Time_Start": 2129.9, "Time_End": 2131.1000000000004, "Text": " Yeah, excellent."}, {"Time_Start": 2132.2200000000003, "Time_End": 2133.86, "Text": " Myth TV isn't limited to"}, {"Time_Start": 2133.86, "Time_End": 2136.0400000000004, "Text": " television."}, {"Time_Start": 2136.0400000000004, "Time_End": 2137.76, "Text": " You could make"}, {"Time_Start": 2137.78, "Time_End": 2139.6600000000003, "Text": " this box your home entertainment"}, {"Time_Start": 2139.6600000000003, "Time_End": 2141.5, "Text": " center by adding in music,"}, {"Time_Start": 2143.0, "Time_End": 2145.5600000000004, "Text": " by adding in weather modules,"}, {"Time_Start": 2146.1600000000003, "Time_End": 2147.7000000000003, "Text": " by changing the themes"}, {"Time_Start": 2147.7000000000003, "Time_End": 2148.96, "Text": " to match your preferences."}, {"Time_Start": 2160.7200000000003, "Time_End": 2163.5400000000004, "Text": " And if you want to see more of what you can do with"}, {"Time_Start": 2163.5400000000004, "Time_End": 2165.52, "Text": " MithTV, EFF has"}, {"Time_Start": 2165.52, "Time_End": 2167.76, "Text": " a live demo going at our"}, {"Time_Start": 2167.78, "Time_End": 2174.78, "Text": " although we don't seem to get enough reception inside to record the live TV."}, {"Time_Start": 2174.78, "Time_End": 2177.78, "Text": " You can see from any of our collection of stored programming."}, {"Time_Start": 2177.78, "Time_End": 2186.78, "Text": " All of this stuff is stuff that we recorded off the air in our San Francisco offices with either this antenna or an aerial on our roof."}, {"Time_Start": 2186.78, "Time_End": 2192.78, "Text": " No cable subscriptions, no monthly fees to a provider."}, {"Time_Start": 2192.78, "Time_End": 2196.78, "Text": " All of the data is available for you over the web."}, {"Time_Start": 2197.78, "Time_End": 2205.5, "Text": " And the beauty of this technology is that it is expandable by its users."}, {"Time_Start": 2206.42, "Time_End": 2210.5, "Text": " As an open source project, Myth TV is developed by the people who use it."}, {"Time_Start": 2210.8, "Time_End": 2215.36, "Text": " If you want a capability that's not in there, you can program it yourself."}, {"Time_Start": 2215.36, "Time_End": 2221.5400000000004, "Text": " You can work with friends or developers to add it in there."}, {"Time_Start": 2222.2000000000003, "Time_End": 2225.42, "Text": " So you don't have to ask permission from the motion picture industry."}, {"Time_Start": 2225.5600000000004, "Time_End": 2227.76, "Text": " You don't need to get a big consumer electronics coming."}, {"Time_Start": 2227.78, "Time_End": 2233.6400000000003, "Text": " on your side. You want to record to DVD? You can do it. That's in there now."}, {"Time_Start": 2233.6400000000003, "Time_End": 2239.6800000000003, "Text": " You want to compress the program so you can put it onto a smaller disk or store your backups"}, {"Time_Start": 2239.6800000000003, "Time_End": 2245.5400000000004, "Text": " more easily. You can do it. You want to combine the management of your television with the management"}, {"Time_Start": 2245.5400000000004, "Time_End": 2250.7200000000003, "Text": " of your music. You can do it. And if you want to take that clip when you were on television"}, {"Time_Start": 2250.7200000000003, "Time_End": 2257.76, "Text": " and send it to your mother and father, you can do that. And if you want to burn a show to"}, {"Time_Start": 2257.78, "Time_End": 2265.78, "Text": " to CD or DVD, share it with a friend. You can do that because this device does not have"}, {"Time_Start": 2265.78, "Time_End": 2275.5800000000004, "Text": " DRM built in, doesn't have DRM baked in, and we'll continue to operate broadcast flag free."}, {"Time_Start": 2276.6800000000003, "Time_End": 2285.46, "Text": " Good folks at PCHDTV.com have offered EFF and EFF listeners a discount on the"}, {"Time_Start": 2285.46, "Time_End": 2286.86, "Text": " PCHD TV card."}, {"Time_Start": 2287.78, "Time_End": 2290.02, "Text": " We're not endorsing any products."}, {"Time_Start": 2290.02, "Time_End": 2293.28, "Text": " This one works under Linux, and it works quite well."}, {"Time_Start": 2294.28, "Time_End": 2300.26, "Text": " And we thank them for their generous donations to EFF in conjunction with purchase of the card."}, {"Time_Start": 2300.36, "Time_End": 2303.0400000000004, "Text": " We have flyers describing that at our booth."}, {"Time_Start": 2304.84, "Time_End": 2310.7200000000003, "Text": " EFF is working to build public awareness of this."}, {"Time_Start": 2310.86, "Time_End": 2315.94, "Text": " We're working to build these machines as contrasts to what's likely to be coming out of"}, {"Time_Start": 2315.94, "Time_End": 2318.56, "Text": " The Consumer Electronics, Hollywood approved."}, {"Time_Start": 2320.12, "Time_End": 2330.84, "Text": " And we're working to get these out into the marketplace so that people like you who understand the technology"}, {"Time_Start": 2330.84, "Time_End": 2336.56, "Text": " can get broadcast flag unencumbered HDTV."}, {"Time_Start": 2336.56, "Time_End": 2342.96, "Text": " We're building up a cookbook to explain the installation process further and to help other people"}, {"Time_Start": 2342.96, "Time_End": 2346.86, "Text": " get their very own HDTV boxes running."}, {"Time_Start": 2348.58, "Time_End": 2350.58, "Text": " But this isn't the only issue."}, {"Time_Start": 2351.2400000000002, "Time_End": 2356.88, "Text": " It would be great from the point of view of something like Consumer Reports, perhaps not Consumer Reports itself,"}, {"Time_Start": 2357.36, "Time_End": 2363.86, "Text": " if you had the contrast of what the state of the art is with what the state of the licensed or authorized art is,"}, {"Time_Start": 2364.14, "Time_End": 2365.7400000000002, "Text": " because it can be a wide gap."}, {"Time_Start": 2366.14, "Time_End": 2371.82, "Text": " And that's one of the upsetting things about DVD, that paradigmatic example of industry cooperation and negotiation."}, {"Time_Start": 2372.44, "Time_End": 2372.94, "Text": " It's so very."}, {"Time_Start": 2372.96, "Time_End": 2376.44, "Text": " far behind the state of the art and anyone who wants to do something that might"}, {"Time_Start": 2376.44, "Time_End": 2380.88, "Text": " improve it unilaterally gets sued. So it's great to build up these contrasts"}, {"Time_Start": 2380.88, "Time_End": 2384.6, "Text": " between this thing and the functionality that the studios might approve."}, {"Time_Start": 2385.7200000000003, "Time_End": 2391.14, "Text": " Okay. The other thing is Gnew Radio. Gnew Radio has been the subject of an"}, {"Time_Start": 2391.14, "Time_End": 2397.02, "Text": " entire talk by its lead developer or by another developer, probably both, at previous"}, {"Time_Start": 2397.02, "Time_End": 2401.4, "Text": " def-cons. I hope that all of you were here then and heard the Gnu Radio talk. We're not"}, {"Time_Start": 2401.4, "Time_End": 2402.94, "Text": " going to try to repeat the entire Gnu"}, {"Time_Start": 2402.96, "Time_End": 2409.4, "Text": " radio talk in our remaining six or eight minutes. I'll tell you briefly how"}, {"Time_Start": 2409.4, "Time_End": 2416.06, "Text": " can you radio works. You have a frequency converter, like that in a cable modem tuner that allows"}, {"Time_Start": 2416.06, "Time_End": 2421.06, "Text": " you to select input frequencies from a wide range of input frequencies. You select a particular"}, {"Time_Start": 2421.06, "Time_End": 2426.48, "Text": " range and it will down convert that into an intermediate frequency range. You then have a really"}, {"Time_Start": 2426.48, "Time_End": 2431.64, "Text": " fast analog to digital converter. The one that new radio people have been using does 20 million"}, {"Time_Start": 2431.64, "Time_End": 2435.7999999999997, "Text": " samples per second, and you just digitize part of the radio frequency spectrum,"}, {"Time_Start": 2436.16, "Time_End": 2442.3199999999997, "Text": " because if you have a 10 megahertz radio wave, you can just use the analog to digital converter,"}, {"Time_Start": 2442.48, "Time_End": 2447.72, "Text": " take samples of the radio wave, and get a digital representation of the radio wave, and then you can"}, {"Time_Start": 2447.72, "Time_End": 2449.24, "Text": " save it without even interpreting it."}, {"Time_Start": 2450.14, "Time_End": 2454.8399999999997, "Text": " Good radio is then open-source software that can be used to interpret the spectrum sample after the fact."}, {"Time_Start": 2455.3399999999997, "Time_End": 2460.3599999999997, "Text": " You can essentially develop plugins that let you demodulate and interpret particular kinds of signals,"}, {"Time_Start": 2460.36, "Time_End": 2462.6400000000003, "Text": " and new plugins can be added all the time."}, {"Time_Start": 2462.7200000000003, "Time_End": 2464.2400000000002, "Text": " You can add one. It's an open source project."}, {"Time_Start": 2464.7400000000002, "Time_End": 2468.2200000000003, "Text": " So it can be extended over time and come to understand more kinds of signals."}, {"Time_Start": 2470.04, "Time_End": 2473.7400000000002, "Text": " The question of how the FCC feels about GUN Radio is very interesting."}, {"Time_Start": 2475.1200000000003, "Time_End": 2479.34, "Text": " The Gnew Radio is an example of a science called software-defined radio,"}, {"Time_Start": 2479.78, "Time_End": 2484.92, "Text": " in which software rather than hardware circuits define how a radio, receiver, or transmitter will behave."}, {"Time_Start": 2486.04, "Time_End": 2490.34, "Text": " The FCC, in its broadcast flag order, recognized,"}, {"Time_Start": 2490.36, "Time_End": 2494.58, "Text": " in response to our comments, that software-defined radios are an interesting issue."}, {"Time_Start": 2495.1400000000003, "Time_End": 2501.1800000000003, "Text": " I'm not sure if that was their term, but that's the spirit of it, for the broadcast flag."}, {"Time_Start": 2501.94, "Time_End": 2507.8, "Text": " Gnew Radio is intended to be modified by end users. It's published as source code to facilitate"}, {"Time_Start": 2507.8, "Time_End": 2513.26, "Text": " people's understanding and to facilitate modification. So we believe it's protected by the First Amendment."}, {"Time_Start": 2514.06, "Time_End": 2520.06, "Text": " And incidentally, canoe, much like that card, is capable of receiving ATSC,"}, {"Time_Start": 2520.36, "Time_End": 2522.98, "Text": " That's the digital television standard used here in the U.S."}, {"Time_Start": 2523.54, "Time_End": 2533.08, "Text": " It can demodulate it and save it as MPEG 2, much like that card, except a lot more expensive and a lot slower,"}, {"Time_Start": 2533.6, "Time_End": 2535.42, "Text": " but more scientifically interesting."}, {"Time_Start": 2537.48, "Time_End": 2541.82, "Text": " Gnew Radio is about 40 times below real time."}, {"Time_Start": 2542.56, "Time_End": 2545.5, "Text": " In other words, if you're using this card, you can watch live HDTV."}, {"Time_Start": 2545.98, "Time_End": 2550.34, "Text": " If you're using Gnew Radio, you save it, then you wait 40 hours while it does a lot of"}, {"Time_Start": 2550.36, "Time_End": 2555.78, "Text": " math and it calculates your digital radio, your digital television program out of the radio"}, {"Time_Start": 2555.78, "Time_End": 2561.34, "Text": " frequency sample. It does the math to calculate, hmm, which television program is it that"}, {"Time_Start": 2561.34, "Time_End": 2566.36, "Text": " would have given rise to this weird radio object. Well, this television program, of course."}, {"Time_Start": 2567.4, "Time_End": 2574.7200000000003, "Text": " So this is a famous slide similar to what you've seen up here. This was from a full motion"}, {"Time_Start": 2574.7200000000003, "Time_End": 2580.1600000000003, "Text": " MPEG stream that was calculated by new radio from an off-air broadcast."}, {"Time_Start": 2580.36, "Time_End": 2587.1200000000003, "Text": " on NDC. This is from law and order. So the way that STR will be treated by"}, {"Time_Start": 2587.1200000000003, "Time_End": 2592.06, "Text": " regulators is still quite unclear. There are other kinds of regulations on certain"}, {"Time_Start": 2592.06, "Time_End": 2597.28, "Text": " receivers and transmitters that may be harder to enforce in a software-defined"}, {"Time_Start": 2597.28, "Time_End": 2602.92, "Text": " radio environment. Canu radio has so far only been used to receive signals not to"}, {"Time_Start": 2602.92, "Time_End": 2609.1, "Text": " transmit them, but it could be used to transmit as well. The commercial software-defined"}, {"Time_Start": 2609.1, "Time_End": 2615.66, "Text": " radio industry says that the right way forward is to have tight control of the code"}, {"Time_Start": 2615.66, "Time_End": 2620.5, "Text": " that's used to form the waveforms that get transmitted by software-defined radio transmitters."}, {"Time_Start": 2621.06, "Time_End": 2625.58, "Text": " That wouldn't bode well for Gnu radio's use because Gnu radio is designed to be modified"}, {"Time_Start": 2625.58, "Time_End": 2632.46, "Text": " by end users. But this technology is not some magical thing or some obscure thing that only a few people"}, {"Time_Start": 2632.46, "Time_End": 2637.86, "Text": " know how to do or that only a few people have implemented. Any signal processing software, even Matlab, for"}, {"Time_Start": 2637.86, "Time_End": 2643.9, "Text": " example. MATLAB happens to come with code, sample code, that can demodulate,"}, {"Time_Start": 2644.36, "Time_End": 2650.34, "Text": " probably be 100 times below real time, but it has the technology to demodulate radio signals"}, {"Time_Start": 2650.34, "Time_End": 2657.6, "Text": " like digital cable using quam. Even sound cards for a sufficiently narrow band signal can be"}, {"Time_Start": 2657.6, "Time_End": 2662.44, "Text": " used for the analog-to-digital conversion. So this is not some esoteric thing. This is like"}, {"Time_Start": 2662.44, "Time_End": 2667.84, "Text": " MATLAB and the sound card, only a little faster. Really, software-defined radio,"}, {"Time_Start": 2667.86, "Time_End": 2673.2400000000002, "Text": " is just math, mathematics has been widely implemented, so it might be kind of difficult to regain"}, {"Time_Start": 2673.2400000000002, "Time_End": 2680.06, "Text": " proprietary control over it. Now, one approach to regulating it as a result would be to target"}, {"Time_Start": 2680.06, "Time_End": 2685.78, "Text": " the hardware, because to get the thing into your computer, if you can't regulate the math,"}, {"Time_Start": 2686.1600000000003, "Time_End": 2693.1400000000003, "Text": " you can regulate how the math talks to things, perhaps. So there are proposals to regulate"}, {"Time_Start": 2693.1400000000003, "Time_End": 2697.56, "Text": " both fast digital-to-analog converters and fast-analog to digital converters."}, {"Time_Start": 2697.86, "Time_End": 2703.46, "Text": " because of the flexibility that people can get with software-defined radio and anxieties about that."}, {"Time_Start": 2703.84, "Time_End": 2707.26, "Text": " There have not been any FCC rulings that I would call definitive in this area."}, {"Time_Start": 2708.06, "Time_End": 2716.9, "Text": " But there are so many pieces of software and so many pieces of hardware that perform the parts that make up a modern digital communication system."}, {"Time_Start": 2717.2000000000003, "Time_End": 2718.94, "Text": " It's quite difficult to regulate it."}, {"Time_Start": 2719.88, "Time_End": 2726.2200000000003, "Text": " I want to say FFT is not a crime so that we can add to the stickers, the Fast Fourier Transform, which new radio uses."}, {"Time_Start": 2727.86, "Time_End": 2730.06, "Text": " So we've come to the end."}, {"Time_Start": 2730.1200000000003, "Time_End": 2734.46, "Text": " We have a page about the broadcast flag, devices that don't react to it."}, {"Time_Start": 2734.78, "Time_End": 2739.48, "Text": " If you get those devices before July 1st, 2005, as Wendy has said, and I think it bears repeating,"}, {"Time_Start": 2739.9, "Time_End": 2745.38, "Text": " and it bears repeating to people beyond DefCon, for over-the-air, U.S. digital television,"}, {"Time_Start": 2745.54, "Time_End": 2750.6600000000003, "Text": " those devices will continue to work, and they will give you an unencrypted MPEG stream that you will not get"}, {"Time_Start": 2750.6600000000003, "Time_End": 2754.9, "Text": " from the devices lawfully manufactured within the U.S. for sale in the U.S. after that date."}, {"Time_Start": 2754.9, "Time_End": 2760.1600000000003, "Text": " So we encourage people to visit these URLs, to visit our booth for a demo,"}, {"Time_Start": 2760.36, "Time_End": 2764.2000000000003, "Text": " and I suppose we have two minutes for questions, three minutes for questions."}, {"Time_Start": 2764.32, "Time_End": 2767.7000000000003, "Text": " Sure, we'll take a couple of quick questions, and I saw one early over here."}, {"Time_Start": 2768.6600000000003, "Time_End": 2772.6, "Text": " Okay, when are the manufacturers not supposed to build anymore?"}, {"Time_Start": 2772.82, "Time_End": 2774.02, "Text": " You're saying they can't sell it."}, {"Time_Start": 2774.02, "Time_End": 2776.12, "Text": " No, that's actually a manufacturer date."}, {"Time_Start": 2776.62, "Time_End": 2781.58, "Text": " They can, any device lawfully manufactured under the rule can be resold."}, {"Time_Start": 2782.26, "Time_End": 2784.88, "Text": " That's actually a manufacturing cutoff date, July 1st, 2000."}, {"Time_Start": 2784.9, "Time_End": 2790.1, "Text": " So therefore, after July 2nd, whatever's an inventory, it's going to be sold."}, {"Time_Start": 2790.2400000000002, "Time_End": 2790.7400000000002, "Text": " That's correct."}, {"Time_Start": 2791.88, "Time_End": 2792.3, "Text": " Thank you."}, {"Time_Start": 2792.48, "Time_End": 2796.54, "Text": " Now, major manufacturers have a long design time and a long product cycle,"}, {"Time_Start": 2796.94, "Time_End": 2801.4, "Text": " so they may well start implementing the restricted devices earlier"}, {"Time_Start": 2801.4, "Time_End": 2804.1800000000003, "Text": " in order not to have to make the changeover abruptly."}, {"Time_Start": 2806.34, "Time_End": 2807.1, "Text": " Want to pick some?"}, {"Time_Start": 2807.1, "Time_End": 2812.8, "Text": " I think to remember that the open source code will not"}, {"Time_Start": 2812.8, "Time_End": 2832.3, "Text": " what to use open source? Presumably if you could get the technical information necessary"}, {"Time_Start": 2832.3, "Time_End": 2836.94, "Text": " to write the open source drivers, the manufacturer would be in violation of the regulation"}, {"Time_Start": 2836.94, "Time_End": 2840.2200000000003, "Text": " for having allowed that technical information to be released."}, {"Time_Start": 2840.2200000000003, "Time_End": 2848.9, "Text": " It's entirely possible that there will be no cards produced because they can't be robust against precisely the kind of attack."}, {"Time_Start": 2851.94, "Time_End": 2857.44, "Text": " It's also certainly likely that people will successfully attempt to defeat the regulation in that way,"}, {"Time_Start": 2857.84, "Time_End": 2860.78, "Text": " but their efforts and the products of their efforts may be unlawful,"}, {"Time_Start": 2861.2200000000003, "Time_End": 2865.82, "Text": " and the future generations of the cards may be legally required to take more countermeasures."}, {"Time_Start": 2867.44, "Time_End": 2868.96, "Text": " Okay, we're being told it's time."}, {"Time_Start": 2869.0400000000004, "Time_End": 2870.2000000000003, "Text": " I'm sorry we couldn't take more questions."}, {"Time_Start": 2870.2200000000003, "Time_End": 2874.2200000000003, "Text": " but we are continuing to demonstrate this at our booth today and tomorrow."}, {"Time_Start": 2874.2200000000003, "Time_End": 2880.2200000000003, "Text": " Please join the FF, help us continue this fight, and please buy your tuner cards while you can."}]}