{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 17.66,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Patrick Bares. I'm located in Munich, Germany. I'm working for the Senior Threat"
    },
    {
      "Time_Start": 17.66,
      "Time_End": 27.12,
      "Text": " Research Team for Splunk. My colleagues are mainly, yeah, are mainly located in the US."
    },
    {
      "Time_Start": 27.12,
      "Time_End": 33.480000000000004,
      "Text": " In my free, in my time, I really like to contribute to open source projects. Like you see a bunch"
    },
    {
      "Time_Start": 33.480000000000004,
      "Time_End": 40.56,
      "Text": " of them here. There's a tech range, security content, Sigma to Splunk Alert, Sigma hunting"
    },
    {
      "Time_Start": 40.56,
      "Time_End": 48.0,
      "Text": " app. During this difficult time, COVID, I start to play games a little bit again. That's"
    },
    {
      "Time_Start": 48.0,
      "Time_End": 53.32,
      "Text": " why I'm a hobby StarCraft 2 player in the moment. If you like to play, let me know."
    },
    {
      "Time_Start": 53.32,
      "Time_End": 59.08,
      "Text": " During the same time, we can talk about detections and so on. And you can follow me in Twitter"
    },
    {
      "Time_Start": 59.08,
      "Time_End": 68.52,
      "Text": " under at Bares underscore Patrick. I want to start a little bit with an introduction"
    },
    {
      "Time_Start": 68.52,
      "Time_End": 72.44,
      "Text": " because I don't know the skill set of all the people attending today. That's why we"
    },
    {
      "Time_Start": 72.44,
      "Time_End": 76.92,
      "Text": " just want to start. What is the detection? What are the challenges and why we need continuous"
    },
    {
      "Time_Start": 77.88,
      "Time_End": 87.16,
      "Text": " delivery? First of all, have a look into a simple attack. We probably all heard about"
    },
    {
      "Time_Start": 87.16,
      "Time_End": 93.48,
      "Text": " this attack back to credential dumping. Have a look in the short agenda. And sorry, that's"
    },
    {
      "Time_Start": 93.48,
      "Time_End": 99.48,
      "Text": " now another version, but we'll make it work. I will first talk about what is continuous"
    },
    {
      "Time_Start": 99.48,
      "Time_End": 105.16,
      "Text": " integration? What is continuous development? Then what are the challenges? And then we"
    },
    {
      "Time_Start": 105.16,
      "Time_End": 110.44,
      "Text": " take a look into the different stages like version control, continuous integration,"
    },
    {
      "Time_Start": 110.44,
      "Time_End": 129.96,
      "Text": " continuous delivery, and continuous deployment. Let's have a look into continuous integration,"
    },
    {
      "Time_Start": 129.96,
      "Time_End": 141.0,
      "Text": " continuous delivery, and continuous deployment. All this wording comes mainly from software"
    },
    {
      "Time_Start": 141.0,
      "Time_End": 146.44,
      "Text": " development. Software development had a similar challenge as we have it in the detection"
    },
    {
      "Time_Start": 146.44,
      "Time_End": 151.88,
      "Text": " development that they often had bugs in the code after release very often as we have to"
    },
    {
      "Time_Start": 151.88,
      "Time_End": 158.60000000000002,
      "Text": " release new detections. And that's why they build it on top of some kind of four pillars."
    },
    {
      "Time_Start": 158.6,
      "Time_End": 165.96,
      "Text": " The first one was the version control. They had software like GitHub and GitLab to control the"
    },
    {
      "Time_Start": 167.64,
      "Time_End": 173.64,
      "Text": " code and see the changes in the code and running some actions when there is new code."
    },
    {
      "Time_Start": 174.6,
      "Time_End": 182.04,
      "Text": " Then there was continuous integration. Continuous integration focusing on compiling, validating,"
    },
    {
      "Time_Start": 182.76,
      "Time_End": 188.28,
      "Text": " doing code review, doing unit testing. For example, when I built a bunch of new piece of code,"
    },
    {
      "Time_Start": 188.76,
      "Time_End": 198.28,
      "Text": " like a new feature, I will also develop some unit tests for it. And then I can test that specific"
    },
    {
      "Time_Start": 198.28,
      "Time_End": 205.16,
      "Text": " part of the code. And then there's also integration testing. Integration testing in this case is then"
    },
    {
      "Time_Start": 205.16,
      "Time_End": 210.28,
      "Text": " testing the complete software as a whole, which means not only the whole feature,"
    },
    {
      "Time_Start": 210.28,
      "Time_End": 224.36,
      "Text": " like the complete app. Then we have continuous delivery. Continuous delivery is when we have now"
    },
    {
      "Time_Start": 224.36,
      "Time_End": 229.32,
      "Text": " developed a new version of the code, we want to get them very fast into production. We don't"
    },
    {
      "Time_Start": 229.32,
      "Time_End": 234.76,
      "Text": " have to want to wait another three months until it is available for the whole customer base."
    },
    {
      "Time_Start": 235.72,
      "Time_End": 246.04,
      "Text": " That's why there is automation in place, which will directly put them into continuous testing,"
    },
    {
      "Time_Start": 246.04,
      "Time_End": 252.76,
      "Text": " test if everything works, perform user acceptance tests, and so on. And last but not least,"
    },
    {
      "Time_Start": 252.76,
      "Time_End": 257.0,
      "Text": " continuous deployment, which means it will be deployed into the production."
    },
    {
      "Time_Start": 257.56,
      "Time_End": 263.8,
      "Text": " And when we take a look in a very modern applications, they deploy a new version"
    },
    {
      "Time_Start": 265.0,
      "Time_End": 271.88,
      "Text": " couple of days. You probably will not notice it, but in the background, it will have a new"
    },
    {
      "Time_Start": 271.88,
      "Time_End": 282.84,
      "Text": " Facebook version and that multiple times a day. And when we have a look into a CICD,"
    },
    {
      "Time_Start": 282.92,
      "Time_End": 290.52000000000004,
      "Text": " there is the code. It always starts with the code. Then you do some commits and some work"
    },
    {
      "Time_Start": 290.52000000000004,
      "Time_End": 297.88000000000005,
      "Text": " on the code. Every new version of the code is a commit. And it's then divided into multiple"
    },
    {
      "Time_Start": 297.88000000000005,
      "Time_End": 304.92,
      "Text": " branches. We'll see it later. And then there is the CI pipeline, which focus on building code,"
    },
    {
      "Time_Start": 305.56,
      "Time_End": 308.2,
      "Text": " running unit tests, and running the integration tests."
    },
    {
      "Time_Start": 309.64000000000004,
      "Time_End": 315.72,
      "Text": " This is everything for testing and for development. And then the CD pipeline,"
    },
    {
      "Time_Start": 315.72,
      "Time_End": 321.8,
      "Text": " the continuous delivery or continuous deployment pipeline, is then putting that into a complete"
    },
    {
      "Time_Start": 321.8,
      "Time_End": 327.8,
      "Text": " staging environment to test it as a whole app. And of course, also pushing it to production."
    },
    {
      "Time_Start": 328.28000000000003,
      "Time_End": 332.12,
      "Text": " What are the challenge for us when we know how CICD works,"
    },
    {
      "Time_Start": 333.56,
      "Time_End": 337.96000000000004,
      "Text": " especially in software development? What are the challenge for us as detection developer?"
    },
    {
      "Time_Start": 339.96000000000004,
      "Time_End": 345.56,
      "Text": " First of all, what I see is like this threat landscape is changing very fast."
    },
    {
      "Time_Start": 346.44,
      "Time_End": 351.40000000000003,
      "Text": " Like if you then develop detection once a year, and then you say, like, I developed now"
    },
    {
      "Time_Start": 351.96000000000004,
      "Time_End": 358.92,
      "Text": " 50 detections. And then you work like the whole year. And then in the start of next year,"
    },
    {
      "Time_Start": 358.92,
      "Time_End": 365.32000000000005,
      "Text": " say you develop another 50 detection. I think this is not how it can work today. I think"
    },
    {
      "Time_Start": 365.32000000000005,
      "Time_End": 371.72,
      "Text": " the detections need to be continuously improved, continuously deployed, and so on. That's why we"
    },
    {
      "Time_Start": 371.72,
      "Time_End": 378.76000000000005,
      "Text": " need a very agile way of getting these detections, a very automated way into the product."
    },
    {
      "Time_Start": 378.76,
      "Time_End": 385.24,
      "Text": " A very automated way into the production and change it and adapt it and improve it."
    },
    {
      "Time_Start": 386.36,
      "Time_End": 392.59999999999997,
      "Text": " Then also infrastructure. In corporate environments, always new infrastructure comes up."
    },
    {
      "Time_Start": 394.2,
      "Time_End": 400.68,
      "Text": " And that's why false positives can be then come up later, which needs an improvement"
    },
    {
      "Time_Start": 400.68,
      "Time_End": 407.24,
      "Text": " in the detections and so on. And what we also want to do is improve the detection development"
    },
    {
      "Time_Start": 407.24,
      "Time_End": 415.0,
      "Text": " process. Because when it takes for us too long to develop new detections, then we are just too"
    },
    {
      "Time_Start": 415.0,
      "Time_End": 422.44,
      "Text": " slow. Then we already had a tech and we only can see that the tech happened, but we can't"
    },
    {
      "Time_Start": 422.44,
      "Time_End": 433.64,
      "Text": " see it directly when it happened and avoid it. Another few challenges is deployment."
    },
    {
      "Time_Start": 434.59999999999997,
      "Time_End": 441.32,
      "Text": " I don't know who already deployed some detections to a theme in a manual way."
    },
    {
      "Time_Start": 442.03999999999996,
      "Time_End": 449.71999999999997,
      "Text": " And that can take quite some time. You have to search itself, the detection itself,"
    },
    {
      "Time_Start": 449.71999999999997,
      "Time_End": 454.84,
      "Text": " but you also provide a lot of meta information around it, like what should happen when the"
    },
    {
      "Time_Start": 454.84,
      "Time_End": 462.76,
      "Text": " detection will trigger, how often it should run, like some kind of cron schedule and so on. There's"
    },
    {
      "Time_Start": 463.24,
      "Time_End": 467.08,
      "Text": " also a lot of meta information and manual deployment can take a lot of time."
    },
    {
      "Time_Start": 467.8,
      "Time_End": 474.36,
      "Text": " And then we have testing. I think three, four years ago, we didn't have that much detections"
    },
    {
      "Time_Start": 475.96,
      "Time_End": 482.84,
      "Text": " out there. Now we have a lot of cool projects, a lot of companies like Elastic, Splunk, Microsoft,"
    },
    {
      "Time_Start": 482.84,
      "Time_End": 488.59999999999997,
      "Text": " they're all open source, the detections. But now we need to really focus on that they all"
    },
    {
      "Time_Start": 488.6,
      "Time_End": 494.76000000000005,
      "Text": " have a high quality, that they are tested all the time, that they're tested with change parameters."
    },
    {
      "Time_Start": 494.76000000000005,
      "Time_End": 502.04,
      "Text": " That's why it's very important that we test the detections properly. And then the tuning can be"
    },
    {
      "Time_Start": 502.04,
      "Time_End": 506.52000000000004,
      "Text": " then done in the security operations center. And then we have version control. Often the"
    },
    {
      "Time_Start": 506.52000000000004,
      "Time_End": 510.52000000000004,
      "Text": " things that are not version controlled, that should be also changed, that they are version"
    },
    {
      "Time_Start": 510.52000000000004,
      "Time_End": 518.44,
      "Text": " controlled. We see the changes over time and so on. Now let's have a look into the different"
    },
    {
      "Time_Start": 518.44,
      "Time_End": 523.8800000000001,
      "Text": " pillars. The first one was version control. For version control, you have different software. You"
    },
    {
      "Time_Start": 523.8800000000001,
      "Time_End": 534.6800000000001,
      "Text": " have either GitHub or GitLab, and it works based on... The focus is that many different people"
    },
    {
      "Time_Start": 534.6800000000001,
      "Time_End": 539.1600000000001,
      "Text": " can work on the same project, which means in this case, like concurrent development."
    },
    {
      "Time_Start": 540.44,
      "Time_End": 545.8000000000001,
      "Text": " And you see then there's like this, all these different pieces here are the different branches."
    },
    {
      "Time_Start": 545.8,
      "Time_End": 550.68,
      "Text": " Everybody can work in his own branches, make his own changes, develop new detections."
    },
    {
      "Time_Start": 550.68,
      "Time_End": 556.76,
      "Text": " At one point, we make a pull request, which means we merge again to the main branch,"
    },
    {
      "Time_Start": 556.76,
      "Time_End": 562.68,
      "Text": " which is sometimes developed for development and the master then for release or productive."
    },
    {
      "Time_Start": 563.24,
      "Time_End": 570.52,
      "Text": " Then what we can also do very good with this version control platforms like GitHub and GitLab,"
    },
    {
      "Time_Start": 570.52,
      "Time_End": 580.6,
      "Text": " we can start to trigger some automation. We can start to trigger a continuous integration pipeline"
    },
    {
      "Time_Start": 580.6,
      "Time_End": 586.6,
      "Text": " when there is some change or some pull request opened, or when we have some new code in there,"
    },
    {
      "Time_Start": 586.6,
      "Time_End": 592.52,
      "Text": " we can test it for bugs and so on. It also helps very good in collaboration."
    },
    {
      "Time_Start": 594.1999999999999,
      "Time_End": 599.72,
      "Text": " It also tracks changes and some bad thing happened, there's error in there. You can go back"
    },
    {
      "Time_Start": 599.72,
      "Time_End": 607.48,
      "Text": " to a previous state and it should be fixed. And often that platforms are focused on high"
    },
    {
      "Time_Start": 607.48,
      "Time_End": 615.08,
      "Text": " availability, disaster recovery. GitHub is like probably you all know it, it's like owned by"
    },
    {
      "Time_Start": 615.08,
      "Time_End": 621.32,
      "Text": " Microsoft now, you can there have your own projects. And GitLab is like the same version,"
    },
    {
      "Time_Start": 621.32,
      "Time_End": 628.76,
      "Text": " but you can also deploy it in your own environment. I know some security operation centers"
    },
    {
      "Time_Start": 628.76,
      "Time_End": 633.8,
      "Text": " have a very strict, have no connections to the internet. If they want to use something"
    },
    {
      "Time_Start": 633.8,
      "Time_End": 637.96,
      "Text": " like continuous integration, continuous delivery, then GitLab can be the right choice."
    },
    {
      "Time_Start": 640.28,
      "Time_End": 646.04,
      "Text": " Then we have version control in detection development. In this case, you see the first"
    },
    {
      "Time_Start": 646.04,
      "Time_End": 651.88,
      "Text": " branch, which is the master branch. The master branch is normally that what you want to run in"
    },
    {
      "Time_Start": 651.88,
      "Time_End": 658.68,
      "Text": " production. At least that's how we do it. Then there is the develop branch. Develop branch is"
    },
    {
      "Time_Start": 658.68,
      "Time_End": 663.72,
      "Text": " like the starting point. You start normally from the develop branch, and then different people"
    },
    {
      "Time_Start": 663.72,
      "Time_End": 668.4399999999999,
      "Text": " create their own branches in order to develop their own detections. For example, here in this"
    },
    {
      "Time_Start": 668.4399999999999,
      "Time_End": 673.96,
      "Text": " case, when detection engineer one develops a new detection, he will create his own branch"
    },
    {
      "Time_Start": 674.6,
      "Time_End": 681.32,
      "Text": " from the develop branch. He's working on his changes. And then when he thinks he's ready,"
    },
    {
      "Time_Start": 682.36,
      "Time_End": 688.92,
      "Text": " he will then make a pull request, which then gets refuted by someone else. And that will be"
    },
    {
      "Time_Start": 688.92,
      "Time_End": 697.48,
      "Text": " merged back to develop. And then normally you want to put multiple changes, multiple new detections"
    },
    {
      "Time_Start": 697.48,
      "Time_End": 703.48,
      "Text": " together into one branch, and then merge it to master back. And then normally some automation"
    },
    {
      "Time_Start": 703.48,
      "Time_End": 711.4,
      "Text": " should run and push that to production. Continuous integration."
    },
    {
      "Time_Start": 714.6800000000001,
      "Time_End": 723.0,
      "Text": " Continuous integration needs, in detection development, focus on different aspects."
    },
    {
      "Time_Start": 723.0,
      "Time_End": 730.44,
      "Text": " In this case, we have like the oils when we branch, and then we have the merge, which I said"
    },
    {
      "Time_Start": 730.44,
      "Time_End": 736.44,
      "Text": " emerges in kind of a pull request. And then what should be done is peer review."
    },
    {
      "Time_Start": 737.96,
      "Time_End": 744.9200000000001,
      "Text": " Peer review means that somebody else takes a look over your detection. He needs to package"
    },
    {
      "Time_Start": 744.9200000000001,
      "Time_End": 751.5600000000001,
      "Text": " the detection, needs to validate the detections, needs to refute the detection rule, and perform"
    },
    {
      "Time_Start": 751.5600000000001,
      "Time_End": 757.8800000000001,
      "Text": " some unit testing, integration testing. One moment."
    },
    {
      "Time_Start": 765.0000000000001,
      "Time_End": 770.6,
      "Text": " And this, when we don't use automation, that needs to be done everything manually. You have"
    },
    {
      "Time_Start": 770.6,
      "Time_End": 779.24,
      "Text": " to do that with every new pull request. That's why this needs to be automated."
    },
    {
      "Time_Start": 779.24,
      "Time_End": 784.44,
      "Text": " What we use for our projects, for security content, for example, this is our open source"
    },
    {
      "Time_Start": 784.44,
      "Time_End": 792.28,
      "Text": " projects for detections, is CircleCI. CircleCI is one of the many platforms which you then can use"
    },
    {
      "Time_Start": 792.28,
      "Time_End": 799.24,
      "Text": " to run your automation chops. And for package detections and validate detections, we have a"
    },
    {
      "Time_Start": 799.24,
      "Time_End": 805.4,
      "Text": " chop, which will then turn, we describe our detections in a YAML format."
    },
    {
      "Time_Start": 807.96,
      "Time_End": 816.44,
      "Text": " Maybe I have an example later. And then turn it into a whole package which can be then used"
    },
    {
      "Time_Start": 816.44,
      "Time_End": 822.76,
      "Text": " with Splunk. In this case, it will validate the content. It will validate the content, which means"
    },
    {
      "Time_Start": 823.56,
      "Time_End": 832.2,
      "Text": " all the fields are in there, in the structure. Build the sources, which means take this YAML"
    },
    {
      "Time_Start": 832.2,
      "Time_End": 840.84,
      "Text": " format and build Splunk configuration files out of it. And then also test if everything was built,"
    },
    {
      "Time_Start": 840.84,
      "Time_End": 846.4399999999999,
      "Text": " that it's also some further checks based on this Splunk app."
    },
    {
      "Time_Start": 846.44,
      "Time_End": 858.0400000000001,
      "Text": " And then we have unit testing and integration testing. Unit testing, integration testing"
    },
    {
      "Time_Start": 859.48,
      "Time_End": 866.6,
      "Text": " is done with us, with one of our open source projects, which is Attack Range. And I will"
    },
    {
      "Time_Start": 866.6,
      "Time_End": 872.0400000000001,
      "Text": " want to give you a little bit more information. In case you missed the link, it's just like you"
    },
    {
      "Time_Start": 872.04,
      "Time_End": 876.68,
      "Text": " Google Attack Range GitHub, and you will come to our open source project."
    },
    {
      "Time_Start": 879.4,
      "Time_End": 889.3199999999999,
      "Text": " The open source project Attack Range has three main goals. First, it will focus on"
    },
    {
      "Time_Start": 890.28,
      "Time_End": 899.8,
      "Text": " building a lab infrastructure, then simulate some attacks with different engines. The best"
    },
    {
      "Time_Start": 899.8000000000001,
      "Time_End": 910.36,
      "Text": " support we have is Atomic Red Team. And then we can use the generated data to test detections,"
    },
    {
      "Time_Start": 910.9200000000001,
      "Time_End": 915.48,
      "Text": " because we don't want to test it with some data which is staying out, right? We want to really"
    },
    {
      "Time_Start": 915.48,
      "Time_End": 921.48,
      "Text": " see the real attacks and then provide proper detections for the real attacks. That's why we"
    },
    {
      "Time_Start": 921.48,
      "Time_End": 930.2,
      "Text": " need to run the real attacks. And that's why I also totally would highlight again what Vitaly"
    },
    {
      "Time_Start": 930.2,
      "Time_End": 936.84,
      "Text": " said in the keynote. As a detection developer, as a blue teamer, you also need to know the red"
    },
    {
      "Time_Start": 936.84,
      "Time_End": 942.2,
      "Text": " team side. You are able to know what kind of attacks they're using, how they achieve lateral"
    },
    {
      "Time_Start": 942.2,
      "Time_End": 946.84,
      "Text": " movement, how they achieve their goals. When you have a look into Atomic Red Team project,"
    },
    {
      "Time_Start": 946.84,
      "Time_End": 952.44,
      "Text": " there you see a lot of different possibilities, how they achieve the different goals of"
    },
    {
      "Time_Start": 952.44,
      "Time_End": 956.2800000000001,
      "Text": " initial compromise or lateral movement or credentialing."
    },
    {
      "Time_Start": 959.08,
      "Time_End": 966.2,
      "Text": " Then we have the Attack Range architecture. The Attack Range builds multiple systems."
    },
    {
      "Time_Start": 966.2,
      "Time_End": 971.88,
      "Text": " It's building a Windows domain controller, a Windows server, and a Windows 10 client."
    },
    {
      "Time_Start": 972.6,
      "Time_End": 977.4,
      "Text": " Everything is already pre-configured. It's also part of a whole domain."
    },
    {
      "Time_Start": 978.2,
      "Time_End": 984.28,
      "Text": " And all the configurations, all the logging is also already configured. You will get"
    },
    {
      "Time_Start": 984.28,
      "Time_End": 989.4,
      "Text": " the Sysmon logs. You will get Windows event logs. You will get PowerShell logs."
    },
    {
      "Time_Start": 990.76,
      "Time_End": 998.36,
      "Text": " In this case, use then Splunk as a theme. But there's also, in case you don't use Splunk,"
    },
    {
      "Time_Start": 998.36,
      "Time_End": 1003.32,
      "Text": " you'll use Elastic or Sentinel. There are a bunch of other projects out there who do"
    },
    {
      "Time_Start": 1004.04,
      "Time_End": 1010.6800000000001,
      "Text": " similar things. This is just as an example. And then we have multiple Universal Forwarder"
    },
    {
      "Time_Start": 1010.6800000000001,
      "Time_End": 1017.64,
      "Text": " in there, which send then the logs to Splunk. And Splunk using the so-called technical add-ons"
    },
    {
      "Time_Start": 1017.64,
      "Time_End": 1022.76,
      "Text": " to pass the logs that you get your key value pairs. And with the key value pairs,"
    },
    {
      "Time_Start": 1022.76,
      "Time_End": 1029.48,
      "Text": " you can build your detections. Then we also have Caldera deployed if you want to run a"
    },
    {
      "Time_Start": 1029.48,
      "Time_End": 1037.64,
      "Text": " complete attack scenario. As I already said, Atomic Red Team to run specific attacks,"
    },
    {
      "Time_Start": 1037.64,
      "Time_End": 1044.92,
      "Text": " what I like to name it as unit tests for detection development. And in case you want to test some"
    },
    {
      "Time_Start": 1044.92,
      "Time_End": 1050.12,
      "Text": " own exploits, some new exploits or a meta-exploit, you can use Kali Linux."
    },
    {
      "Time_Start": 1053.72,
      "Time_End": 1060.28,
      "Text": " The attack range, this is a little bit older diagram. Yeah, there was some confusion with"
    },
    {
      "Time_Start": 1060.28,
      "Time_End": 1068.2,
      "Text": " the slides. The attack range itself, there is now an attack range and an attack range local. We"
    },
    {
      "Time_Start": 1068.2,
      "Time_End": 1074.84,
      "Text": " split it up into two diagrams. But in this case, it still shows the one diagram. The attack range"
    },
    {
      "Time_Start": 1074.84,
      "Time_End": 1081.08,
      "Text": " local, which you see on the upper part, can be built with Vagrant and VirtualBox."
    },
    {
      "Time_Start": 1083.08,
      "Time_End": 1089.96,
      "Text": " And you just run that single command, you wait 20, 25 minutes, and you have a complete lab where"
    },
    {
      "Time_Start": 1089.96,
      "Time_End": 1096.36,
      "Text": " you can start to work. You can start to develop detection, the logs are coming to Splunk,"
    },
    {
      "Time_Start": 1096.36,
      "Time_End": 1102.12,
      "Text": " you can start to attack the environment and so on. And the other way, which is our preferred"
    },
    {
      "Time_Start": 1102.12,
      "Time_End": 1109.48,
      "Text": " way for the future is using Terraform and the AWS Cloud to build the attack range."
    },
    {
      "Time_Start": 1109.88,
      "Time_End": 1116.44,
      "Text": " The attack range is then leveraging Ansible for configuration management. It's leveraging Ansible"
    },
    {
      "Time_Start": 1116.44,
      "Time_End": 1123.72,
      "Text": " to provision the Windows servers and also to provision the Splunk server. You can either"
    },
    {
      "Time_Start": 1123.72,
      "Time_End": 1128.92,
      "Text": " install multiple servers, you can install all three servers, you can install also in Phantom,"
    },
    {
      "Time_Start": 1128.92,
      "Time_End": 1132.84,
      "Text": " which is like an enterprise security, everything what you need."
    },
    {
      "Time_Start": 1133.0,
      "Time_End": 1136.84,
      "Text": " Let's have a look into example. And as I said, it's a little bit older slides,"
    },
    {
      "Time_Start": 1136.84,
      "Time_End": 1141.24,
      "Text": " that's where you don't see the already new released sub-techniques of the MITRE ATT&CK"
    },
    {
      "Time_Start": 1141.24,
      "Time_End": 1148.1999999999998,
      "Text": " matrix. That's still the older versions with just the techniques. In case you didn't see it,"
    },
    {
      "Time_Start": 1148.1999999999998,
      "Time_End": 1155.1599999999999,
      "Text": " but probably most of you already saw the ATT&CK matrix. The MITRE ATT&CK matrix is a collection"
    },
    {
      "Time_Start": 1155.1599999999999,
      "Time_End": 1161.8,
      "Text": " of tactics, techniques, and procedures which attackers are using to attack the environment."
    },
    {
      "Time_Start": 1161.8,
      "Time_End": 1170.12,
      "Text": " Which attackers are using to achieve their goals. In the dark gray background,"
    },
    {
      "Time_Start": 1170.12,
      "Time_End": 1174.68,
      "Text": " probably you can't read it, you just can go to the MITRE ATT&CK website and you see it probably"
    },
    {
      "Time_Start": 1174.68,
      "Time_End": 1181.48,
      "Text": " better. With the dark gray background, you see the different adversary technical goals."
    },
    {
      "Time_Start": 1182.12,
      "Time_End": 1187.48,
      "Text": " For example, adversary in order to be successful needs to have some way of initial access,"
    },
    {
      "Time_Start": 1188.2,
      "Time_End": 1194.28,
      "Text": " completely on the left side. It needs some way of execute things. Then it wants to"
    },
    {
      "Time_Start": 1196.44,
      "Time_End": 1203.56,
      "Text": " gain persistence, privilege escalation, and so credential access. And then as the white boxes,"
    },
    {
      "Time_Start": 1203.56,
      "Time_End": 1209.72,
      "Text": " that are the different possibilities what an attacker can use to achieve that goal."
    },
    {
      "Time_Start": 1210.52,
      "Time_End": 1214.44,
      "Text": " For example, when we have a look into credential access,"
    },
    {
      "Time_Start": 1215.0,
      "Time_End": 1221.8,
      "Text": " one way of an attacker to get credentials is to use credential dumping."
    },
    {
      "Time_Start": 1223.88,
      "Time_End": 1231.96,
      "Text": " Credential dumping is a technique to dump the credentials and then afterwards your traffic"
    },
    {
      "Time_Start": 1232.52,
      "Time_End": 1240.1200000000001,
      "Text": " as an attacker when you move from one machine to other one. It's not that noisy anymore because"
    },
    {
      "Time_Start": 1240.1200000000001,
      "Time_End": 1247.48,
      "Text": " use valid credentials and differentiate. Then you misusing that credentials from a valid"
    },
    {
      "Time_Start": 1247.48,
      "Time_End": 1252.3600000000001,
      "Text": " administrator use the credentials is very difficult. That's why it's a very popular"
    },
    {
      "Time_Start": 1252.3600000000001,
      "Time_End": 1259.88,
      "Text": " technique of attackers to use the credentials. Credential dumping has them when we have a look"
    },
    {
      "Time_Start": 1259.88,
      "Time_End": 1268.6000000000001,
      "Text": " into Atomic Red Team for that specific technique has now 13 different possibilities to do it."
    },
    {
      "Time_Start": 1268.6000000000001,
      "Time_End": 1276.92,
      "Text": " Even now, it's a project which getting more and more contributions. I think now it's even more"
    },
    {
      "Time_Start": 1276.92,
      "Time_End": 1283.24,
      "Text": " tests, which means in this case, we have 13 different tests for Atomic Red Team from using"
    },
    {
      "Time_Start": 1283.24,
      "Time_End": 1289.56,
      "Text": " Mimikatz and PowerShell to create volume shadow copies and so on."
    },
    {
      "Time_Start": 1291.4,
      "Time_End": 1296.52,
      "Text": " With the Atomic Red Team, you can now simulate all the 13 different attacks."
    },
    {
      "Time_Start": 1297.16,
      "Time_End": 1303.16,
      "Text": " And then you can use, you start to develop detection that you see all the different variants"
    },
    {
      "Time_Start": 1303.16,
      "Time_End": 1308.04,
      "Text": " and you can start to focus what kind of logs do I need when I start to attack it and which kind of"
    },
    {
      "Time_Start": 1308.04,
      "Time_End": 1313.72,
      "Text": " logs do I see it in PowerShell logs, in Sysmon logs, or do I even see it in the Windows event logs."
    },
    {
      "Time_Start": 1318.68,
      "Time_End": 1325.6399999999999,
      "Text": " And now with the attack range, you can do that kind of unit testings for detection rules,"
    },
    {
      "Time_Start": 1325.6399999999999,
      "Time_End": 1331.3999999999999,
      "Text": " which means you build an attack range, like you configure it, you have half an hour,"
    },
    {
      "Time_Start": 1331.4,
      "Time_End": 1338.0400000000002,
      "Text": " it is running, and then you run the simulate command. And the simulate command you provide"
    },
    {
      "Time_Start": 1338.0400000000002,
      "Time_End": 1346.1200000000001,
      "Text": " with minus T is the similar, it's for target. You specify on which target you want to run that,"
    },
    {
      "Time_Start": 1346.1200000000001,
      "Time_End": 1353.0800000000002,
      "Text": " the credential dumping attack, and then it will run all that 13 different attacks on domain controller."
    },
    {
      "Time_Start": 1354.3600000000001,
      "Time_End": 1359.96,
      "Text": " In this case, it was then the domain controller. And then you can use Splunk or you can directly"
    },
    {
      "Time_Start": 1359.96,
      "Time_End": 1365.96,
      "Text": " jump into the Sysmon logs with the Windows event viewer to see what happened now with the"
    },
    {
      "Time_Start": 1365.96,
      "Time_End": 1373.32,
      "Text": " different attacks and what log sources can I leverage and how can I detect now these different attacks."
    },
    {
      "Time_Start": 1375.8,
      "Time_End": 1377.32,
      "Text": " And then we have continuous delivery."
    },
    {
      "Time_Start": 1383.24,
      "Time_End": 1389.08,
      "Text": " Continuous delivery is now focusing, we develop now our new detections,"
    },
    {
      "Time_Start": 1390.1200000000001,
      "Time_End": 1398.3600000000001,
      "Text": " with the attack range or with other projects. And now we need to get that detection into production."
    },
    {
      "Time_Start": 1402.2,
      "Time_End": 1406.1200000000001,
      "Text": " And before we do that, we want to do this kind of user acceptance test,"
    },
    {
      "Time_Start": 1406.1200000000001,
      "Time_End": 1412.2,
      "Text": " what I said, like we want to test everything together. Now, how we can do that? We have now,"
    },
    {
      "Time_Start": 1412.2,
      "Time_End": 1418.76,
      "Text": " for example, in this print, we developed 10 new detections. Now we have 20 detections in total."
    },
    {
      "Time_Start": 1419.96,
      "Time_End": 1426.1200000000001,
      "Text": " Now what we can do, we can leverage another open source project, which is also integrated"
    },
    {
      "Time_Start": 1426.1200000000001,
      "Time_End": 1434.28,
      "Text": " into a tech range called Aldera. It's also from the MITRE guys. And Caldera is now focusing"
    },
    {
      "Time_Start": 1434.28,
      "Time_End": 1441.08,
      "Text": " complete on attack simulation. And not only on the different smaller texts by itself,"
    },
    {
      "Time_Start": 1441.08,
      "Time_End": 1448.6000000000001,
      "Text": " it chains and complete attack together from initial access to some executions, to some persistence,"
    },
    {
      "Time_Start": 1448.6000000000001,
      "Time_End": 1453.64,
      "Text": " lateral movement, and so on. You can develop your own complete scenario."
    },
    {
      "Time_Start": 1454.68,
      "Time_End": 1461.0000000000002,
      "Text": " And you can then use the complete scenario to test the complete set of detections. In this case,"
    },
    {
      "Time_Start": 1461.0000000000002,
      "Time_End": 1469.2400000000002,
      "Text": " we can then test all our 20 detections and we can see at which points we saw that attack."
    },
    {
      "Time_Start": 1471.4,
      "Time_End": 1476.0400000000002,
      "Text": " It's also an open source project. You can also find it in GitHub."
    },
    {
      "Time_Start": 1477.0,
      "Time_End": 1485.08,
      "Text": " And it's also always changing. They are working heavily on it. And as I said, like Caldera can be"
    },
    {
      "Time_Start": 1485.08,
      "Time_End": 1491.24,
      "Text": " very good used for that complete attack chain when you want to test the whole detections together."
    },
    {
      "Time_Start": 1491.24,
      "Time_End": 1498.44,
      "Text": " And Atomic Red Team can be very good used if you want to test every detection by itself"
    },
    {
      "Time_Start": 1499.3200000000002,
      "Time_End": 1501.96,
      "Text": " with the corresponding attack."
    },
    {
      "Time_Start": 1505.24,
      "Time_End": 1511.48,
      "Text": " And then, yeah, as I said, you can then specify a whole complete scenario here. In this case,"
    },
    {
      "Time_Start": 1511.48,
      "Time_End": 1515.8,
      "Text": " there is, you can also divide it in different phases. You can also say that it should dump"
    },
    {
      "Time_Start": 1515.8,
      "Time_End": 1523.4,
      "Text": " the history of the command line. It should, yeah, it should have a look into the admin shares if"
    },
    {
      "Time_Start": 1523.8000000000002,
      "Time_End": 1531.0800000000002,
      "Text": " it finds further credentials and so on. Then we have continuous deployment."
    },
    {
      "Time_Start": 1532.3600000000001,
      "Time_End": 1539.3200000000002,
      "Text": " Now what we want to get is we have now all the detections in our version controlled GitHub"
    },
    {
      "Time_Start": 1539.3200000000002,
      "Time_End": 1544.44,
      "Text": " or GitHub. And now we want to get them somehow in our scene. And that is still,"
    },
    {
      "Time_Start": 1544.44,
      "Time_End": 1549.64,
      "Text": " we use Splunk here as an example, but that applies to all other different scene vendors."
    },
    {
      "Time_Start": 1550.5200000000002,
      "Time_End": 1555.8000000000002,
      "Text": " Often what we see is either they provide some kind of packaging that you provide,"
    },
    {
      "Time_Start": 1555.8000000000002,
      "Time_End": 1561.72,
      "Text": " you build a complete package, and then you install that package onto the scene."
    },
    {
      "Time_Start": 1562.92,
      "Time_End": 1568.6000000000001,
      "Text": " Or what is, in my opinion, more like modern approach is when a scene provides some kind"
    },
    {
      "Time_Start": 1568.6000000000001,
      "Time_End": 1576.92,
      "Text": " of REST API and you use a REST API to then put the detections into the scene."
    },
    {
      "Time_Start": 1579.64,
      "Time_End": 1585.16,
      "Text": " As I probably said, one of our projects which we use is Splunk Security Content. It's also"
    },
    {
      "Time_Start": 1585.16,
      "Time_End": 1593.0800000000002,
      "Text": " an open source project. You will find there more than 200 detections. If you need to have some new"
    },
    {
      "Time_Start": 1593.0800000000002,
      "Time_End": 1601.3200000000002,
      "Text": " ideas for new detections, have a look in there. We map everything to the MITRE ATT&CK matrix,"
    },
    {
      "Time_Start": 1601.3200000000002,
      "Time_End": 1609.3200000000002,
      "Text": " which is also our blueprint in terms of detection development, which means we use the ATT&CK matrix"
    },
    {
      "Time_Start": 1609.32,
      "Time_End": 1619.1599999999999,
      "Text": " in order to focus on the most used ATT&CK vectors. Then everything is mapped to the"
    },
    {
      "Time_Start": 1619.1599999999999,
      "Time_End": 1626.6799999999998,
      "Text": " common information data model, which is something in order to normalize data. You also see the"
    },
    {
      "Time_Start": 1626.6799999999998,
      "Time_End": 1632.6,
      "Text": " similar things for other scene vendors, which the idea behind is that when you have"
    },
    {
      "Time_Start": 1633.5600000000002,
      "Time_End": 1638.3600000000001,
      "Text": " different log sources, for example, from different firewall vendor, that at the end,"
    },
    {
      "Time_Start": 1638.3600000000001,
      "Time_End": 1644.68,
      "Text": " in your scene, you still can query it with the same key values, that you don't have a source IP,"
    },
    {
      "Time_Start": 1645.2400000000002,
      "Time_End": 1651.96,
      "Text": " which is spelled four times different, that you have one normalization of data,"
    },
    {
      "Time_Start": 1651.96,
      "Time_End": 1655.96,
      "Text": " which you then can query. That's called data normalization."
    },
    {
      "Time_Start": 1656.1200000000001,
      "Time_End": 1662.68,
      "Text": " And we are very open to contribution. If you have some new, cool ideas of detections,"
    },
    {
      "Time_Start": 1664.6000000000001,
      "Time_End": 1671.0,
      "Text": " please contribute it to our project. That would be very cool and everybody would benefit of it."
    },
    {
      "Time_Start": 1671.56,
      "Time_End": 1679.16,
      "Text": " I think we as Blue Teamer, as Defender, we need to work together and share our detections"
    },
    {
      "Time_Start": 1679.16,
      "Time_End": 1682.3600000000001,
      "Text": " in order to keep up with the speed of the adversaries."
    },
    {
      "Time_Start": 1686.04,
      "Time_End": 1693.4,
      "Text": " And how do we do it in the moment? It's like there is our security content project. And then,"
    },
    {
      "Time_Start": 1693.4,
      "Time_End": 1699.8,
      "Text": " as I said, we have this Circus CI tool, which is then running automation when we do a new pull"
    },
    {
      "Time_Start": 1699.8,
      "Time_End": 1706.8400000000001,
      "Text": " request or if we merge some new code to develop. It will then do all the steps, which I told you,"
    },
    {
      "Time_Start": 1706.8400000000001,
      "Time_End": 1713.32,
      "Text": " I package the detections, do some testing, validate the content, build our own app."
    },
    {
      "Time_Start": 1713.32,
      "Time_End": 1718.9199999999998,
      "Text": " This is for us, everything is automated, which means when we merge something to develop,"
    },
    {
      "Time_Start": 1718.9199999999998,
      "Time_End": 1724.84,
      "Text": " it will build for us a complete new Splunk app. And that Splunk app consists then of all the"
    },
    {
      "Time_Start": 1724.84,
      "Time_End": 1730.6799999999998,
      "Text": " detections. And in this case, it's a Splunk ES content update. And then you can just install it."
    },
    {
      "Time_Start": 1733.3999999999999,
      "Time_End": 1739.1599999999999,
      "Text": " And then what we also have, we have also all our detections"
    },
    {
      "Time_Start": 1739.96,
      "Time_End": 1747.4,
      "Text": " in using our available SRS API. And that's also changing all the time, but you can go"
    },
    {
      "Time_Start": 1747.4,
      "Time_End": 1753.88,
      "Text": " to docs.splunkresearch.com. And then you find all the detections, which you can then query over REST"
    },
    {
      "Time_Start": 1753.88,
      "Time_End": 1759.0,
      "Text": " API. And we try to provide more and more parameters, which means now you should also"
    },
    {
      "Time_Start": 1759.0,
      "Time_End": 1767.0,
      "Text": " be able to query them by MITRE technique. For example, you want to see what the Splunk"
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1772.28,
      "Text": " security research team can offer us in terms of detections for credential dumping,"
    },
    {
      "Time_Start": 1772.28,
      "Time_End": 1778.52,
      "Text": " then you use a parameter T1003, and then you get all the detections what we have for credential"
    },
    {
      "Time_Start": 1778.52,
      "Time_End": 1793.48,
      "Text": " dumping. It was a little bit faster. Thank you very much."
    }
  ]
}