{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 16.240000000000002,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good morning. Good evening, everyone. Hello, Zyfkon. Today, I'm going to take you to Africa"
    },
    {
      "Time_Start": 16.240000000000002,
      "Time_End": 21.28,
      "Text": " to talk about African financial threats. So about the threat groups that are targeting"
    },
    {
      "Time_Start": 21.36,
      "Time_End": 29.92,
      "Text": " banks to conduct cyber heists. Just to explain to you why such topic, why not another APT"
    },
    {
      "Time_Start": 30.560000000000002,
      "Time_End": 37.84,
      "Text": " topic about the cyber espionage intrusions. Mainly because last year,"
    },
    {
      "Time_Start": 40.0,
      "Time_End": 47.2,
      "Text": " I did a big change in my life. I left the military sector and I joined private sector"
    },
    {
      "Time_Start": 47.6,
      "Time_End": 55.28,
      "Text": " at the International Bank. And I was absolutely challenged with my knowledge about threat groups"
    },
    {
      "Time_Start": 55.28,
      "Time_End": 61.84,
      "Text": " that are financially motivated. And my current employer is present on many international"
    },
    {
      "Time_Start": 63.040000000000006,
      "Time_End": 69.92,
      "Text": " markets globally in Asia, Middle East, and also in Africa. So I decided to"
    },
    {
      "Time_Start": 70.72,
      "Time_End": 80.0,
      "Text": " understand more of the threats that are coming from that landscape. So today, I'm"
    },
    {
      "Time_Start": 81.28,
      "Time_End": 88.56,
      "Text": " taking you to Kenya, where most of those prolific groups come from, and we'll try to understand"
    },
    {
      "Time_Start": 89.12,
      "Time_End": 97.04,
      "Text": " their modus operandi and very unique kill chain of intrusions that's connected with"
    },
    {
      "Time_Start": 97.68,
      "Time_End": 108.80000000000001,
      "Text": " African origin threat groups. So for today's agenda, I prepared following points. At first,"
    },
    {
      "Time_Start": 108.80000000000001,
      "Time_End": 117.28,
      "Text": " we'll focus on these unique tactics from the past intrusions, the so-called African kill chain,"
    },
    {
      "Time_Start": 117.28,
      "Time_End": 125.76,
      "Text": " because this is quite unique for those groups and different from other operations globally."
    },
    {
      "Time_Start": 126.72,
      "Time_End": 133.20000000000002,
      "Text": " Later on, we'll focus on things that differentiate those groups. We'll try to understand the threat"
    },
    {
      "Time_Start": 133.20000000000002,
      "Time_End": 141.92000000000002,
      "Text": " landscape and the clustering of those groups, what differentiate them. And also, we'll talk"
    },
    {
      "Time_Start": 141.92000000000002,
      "Time_End": 150.88,
      "Text": " about some history and some developments of those groups. And the third point are two case studies"
    },
    {
      "Time_Start": 150.88,
      "Time_End": 158.16,
      "Text": " focus on analyzing the capabilities, for example, Python keyloggers, which are very common among"
    },
    {
      "Time_Start": 158.16,
      "Time_End": 164.88,
      "Text": " those groups. And we're trying to understand the origin and the development of those keyloggers."
    },
    {
      "Time_Start": 165.76,
      "Time_End": 171.84,
      "Text": " And lastly, we'll try to understand the capabilities and infrastructure of the"
    },
    {
      "Time_Start": 171.84,
      "Time_End": 180.64,
      "Text": " grab zone threat group. And we'll focus on one of the IPs that is associated with this group"
    },
    {
      "Time_Start": 180.64000000000001,
      "Time_End": 188.00000000000003,
      "Text": " in 2020. And we'll try to understand capabilities that were projected using that infrastructure."
    },
    {
      "Time_Start": 192.24,
      "Time_End": 200.64000000000001,
      "Text": " Just a few words about me. I served about 16 years in Polish Armed Forces. I started"
    },
    {
      "Time_Start": 201.28000000000003,
      "Time_End": 208.88000000000002,
      "Text": " in Polish Navy and ended in National Cyber Security Center Poland. And now I'm working"
    },
    {
      "Time_Start": 208.88,
      "Time_End": 213.28,
      "Text": " as a Senior Manager for Cyber Threat Intelligence at Standard Chartered."
    },
    {
      "Time_Start": 215.12,
      "Time_End": 224.56,
      "Text": " And probably some of you may ask who Threat Intel Analyst is. So this is generally somebody"
    },
    {
      "Time_Start": 224.56,
      "Time_End": 232.32,
      "Text": " who tries to connect the dots, who tries to understand the capabilities and tries to understand"
    },
    {
      "Time_Start": 232.32,
      "Time_End": 240.48,
      "Text": " threats, sometimes connecting the making, looking for the patterns, looking for the human"
    },
    {
      "Time_Start": 240.48,
      "Time_End": 249.6,
      "Text": " fingerprints that are left by adversaries. Often it is very similar to searching for a needle in"
    },
    {
      "Time_Start": 249.6,
      "Time_End": 257.2,
      "Text": " the haystack. Sometimes you get lost in a rabbit hole. But sometimes when you are successful, you"
    },
    {
      "Time_Start": 257.2,
      "Time_End": 264.47999999999996,
      "Text": " can try to find out the pattern. And the pattern can help you to understand those threat groups and"
    },
    {
      "Time_Start": 264.47999999999996,
      "Time_End": 276.8,
      "Text": " to proactively track them. And a disclaimer for this presentation is that those opinions are solely"
    },
    {
      "Time_Start": 276.8,
      "Time_End": 283.03999999999996,
      "Text": " my own and they do not represent my employer's position. And generally, the investigation,"
    },
    {
      "Time_Start": 283.92,
      "Time_End": 288.16,
      "Text": " especially the two case studies are based on publicly available data."
    },
    {
      "Time_Start": 289.44,
      "Time_End": 296.08000000000004,
      "Text": " And I have to underline the samples, the clustering of threat groups and the naming"
    },
    {
      "Time_Start": 296.08000000000004,
      "Time_End": 303.12,
      "Text": " convention is thanks to Honored Services. I will refer to this group, to this company"
    },
    {
      "Time_Start": 304.08000000000004,
      "Time_End": 312.40000000000003,
      "Text": " in several places during my presentation, because those are the people and the company"
    },
    {
      "Time_Start": 312.40000000000003,
      "Time_End": 319.68,
      "Text": " that inspired me to do that research when I decided to focus on Africa. It is a group of"
    },
    {
      "Time_Start": 319.68,
      "Time_End": 328.88000000000005,
      "Text": " people who support targeted organizations and they provide very unique services."
    },
    {
      "Time_Start": 329.44000000000005,
      "Time_End": 336.24,
      "Text": " Apart from incident response services, they are also authorized by government to conduct"
    },
    {
      "Time_Start": 336.32,
      "Time_End": 345.6,
      "Text": " offensive actions against those threat groups. And many of the samples, many of the threat data"
    },
    {
      "Time_Start": 345.6,
      "Time_End": 354.96000000000004,
      "Text": " also come from those offensive cyber-enabled operations. And I have to underline here that"
    },
    {
      "Time_Start": 355.68,
      "Time_End": 363.04,
      "Text": " they are very brave people because they are fighting those threats there locally,"
    },
    {
      "Time_Start": 363.04,
      "Time_End": 372.8,
      "Text": " often with close proximity to the threat groups that are very dangerous"
    },
    {
      "Time_Start": 374.88,
      "Time_End": 382.88,
      "Text": " and the risk is real for them. So let's begin with understanding the African threat"
    },
    {
      "Time_Start": 382.88,
      "Time_End": 390.16,
      "Text": " kill chain, because this is something very unique. And when most of the cyber intrusions that we know"
    },
    {
      "Time_Start": 390.16,
      "Time_End": 398.24,
      "Text": " globally are conducted remotely, often the intrusion vector is spear phishing. So this is"
    },
    {
      "Time_Start": 398.8,
      "Time_End": 406.16,
      "Text": " not the case for the African kill chain, because the initial foothold is gained using the"
    },
    {
      "Time_Start": 407.52000000000004,
      "Time_End": 414.8,
      "Text": " rogue devices that are attached by insiders, by bribed personnel, disgruntled people"
    },
    {
      "Time_Start": 414.8,
      "Time_End": 420.96000000000004,
      "Text": " who are instructed by the members of the cyber gangs to attach them somewhere"
    },
    {
      "Time_Start": 422.8,
      "Time_End": 429.04,
      "Text": " to the network of the targeted organization. So actually those intrusions are very targeted."
    },
    {
      "Time_Start": 430.16,
      "Time_End": 437.92,
      "Text": " People are instructed to attach those devices into those networks."
    },
    {
      "Time_Start": 438.8,
      "Time_End": 446.32,
      "Text": " And if you look to the MITRE ATT&CK matrix, there is such a technique in the initial access tactic."
    },
    {
      "Time_Start": 447.36,
      "Time_End": 453.84000000000003,
      "Text": " It is called hardware additions. But if you check there, there are not many examples."
    },
    {
      "Time_Start": 453.84000000000003,
      "Time_End": 460.56,
      "Text": " For example, there is only one threat group mentioned there, DarkViznia, which is an Eastern European"
    },
    {
      "Time_Start": 461.36,
      "Time_End": 469.04,
      "Text": " threat actor associated with intrusions in Europe against Eastern European banks."
    },
    {
      "Time_Start": 469.6,
      "Time_End": 480.24,
      "Text": " So we can see on this example that in public domain, we don't have many examples, usually because"
    },
    {
      "Time_Start": 480.8,
      "Time_End": 487.04,
      "Text": " remote intrusions is actually the beauty of cyber operations."
    },
    {
      "Time_Start": 488.64,
      "Time_End": 495.68,
      "Text": " It is very useful for espionage organizations because it is cheap."
    },
    {
      "Time_Start": 497.12,
      "Time_End": 507.2,
      "Text": " The risk of catching is very low. And that's why so many actors use those remote attacks."
    },
    {
      "Time_Start": 507.28,
      "Time_End": 516.56,
      "Text": " However, in Africa, most of the attacks are enabled by the rogue devices specially prepared."
    },
    {
      "Time_Start": 516.56,
      "Time_End": 523.28,
      "Text": " And that's the way how actors gain access to the victims."
    },
    {
      "Time_Start": 524.3199999999999,
      "Time_End": 534.4,
      "Text": " So we can also say that the intruders will get in. So the approach"
    },
    {
      "Time_Start": 535.28,
      "Time_End": 546.88,
      "Text": " that assumes breach is very actual there. And it means that threat hunting and proactive"
    },
    {
      "Time_Start": 547.6,
      "Time_End": 552.64,
      "Text": " searching for the threat actor that's already operating in our environment"
    },
    {
      "Time_Start": 552.64,
      "Time_End": 559.84,
      "Text": " is something that should be a priority for organizations that conduct business,"
    },
    {
      "Time_Start": 559.84,
      "Time_End": 567.2,
      "Text": " for example, financial institutions that are present in this region."
    },
    {
      "Time_Start": 567.2,
      "Time_End": 576.5600000000001,
      "Text": " The next step when the adversary attaches the laptop is, of course, the reconnaissance."
    },
    {
      "Time_Start": 576.5600000000001,
      "Time_End": 581.9200000000001,
      "Text": " Probably you are interested in what kind of laptop is this. So this is usually the"
    },
    {
      "Time_Start": 582.4799999999999,
      "Time_End": 589.68,
      "Text": " laptop with Windows operating system with commercially available commercial off-the-shelf"
    },
    {
      "Time_Start": 591.68,
      "Time_End": 596.64,
      "Text": " software for remote access tools. So it could be, for example, go to my PC."
    },
    {
      "Time_Start": 597.5999999999999,
      "Time_End": 604.24,
      "Text": " It could be TeamViewer. It could be AnyDesk. So they usually deploy them very easy to install"
    },
    {
      "Time_Start": 604.24,
      "Time_End": 611.92,
      "Text": " and easy to operate applications for remote access control with graphical interface."
    },
    {
      "Time_Start": 612.8,
      "Time_End": 619.36,
      "Text": " And usually those insiders are trained how to attach the laptop, how to troubleshoot."
    },
    {
      "Time_Start": 619.36,
      "Time_End": 627.28,
      "Text": " Those laptops usually have disabled suspension or hibernation mode so they never sleep."
    },
    {
      "Time_Start": 627.92,
      "Time_End": 634.0799999999999,
      "Text": " When they get access and there is a command control established with a quite simple mean,"
    },
    {
      "Time_Start": 635.12,
      "Time_End": 643.28,
      "Text": " the next step would be to go laterally. And apart from those command control software,"
    },
    {
      "Time_Start": 643.28,
      "Time_End": 650.64,
      "Text": " there is also a software to scan the network, to crack the passwords, to move laterally."
    },
    {
      "Time_Start": 651.6,
      "Time_End": 659.04,
      "Text": " And for example, if they get some passwords to move laterally, they use old good PSXX. So"
    },
    {
      "Time_Start": 659.04,
      "Time_End": 667.1999999999999,
      "Text": " in this case, they do not differ from prolific groups, espionage groups that also use that kind"
    },
    {
      "Time_Start": 667.1999999999999,
      "Time_End": 675.4399999999999,
      "Text": " of software. And when they move laterally, what else they do? Oh, for reconnaissance,"
    },
    {
      "Time_Start": 676.24,
      "Time_End": 684.1600000000001,
      "Text": " you have also the images of Bloodhound and CME. So the projects which are open source and are"
    },
    {
      "Time_Start": 684.72,
      "Time_End": 690.5600000000001,
      "Text": " freely available for reconnaissance and for attacking active directory environments."
    },
    {
      "Time_Start": 691.5200000000001,
      "Time_End": 699.6,
      "Text": " And if they find interesting stations, they install keyloggers. This is also something"
    },
    {
      "Time_Start": 699.6,
      "Time_End": 706.96,
      "Text": " very typical for them. I use that citation from Phineas Fisher, another thread actor,"
    },
    {
      "Time_Start": 707.6,
      "Time_End": 713.36,
      "Text": " that the reality is that Mimikatz and keyloggers view all passwords equally. And that's true."
    },
    {
      "Time_Start": 715.12,
      "Time_End": 722.5600000000001,
      "Text": " Usually, they do not focus on dumping passwords and those kinds of techniques. They usually"
    },
    {
      "Time_Start": 722.5600000000001,
      "Time_End": 729.0400000000001,
      "Text": " deploy keyloggers. And we'll focus on some details of those keyloggers later on during"
    },
    {
      "Time_Start": 729.0400000000001,
      "Time_End": 738.0000000000001,
      "Text": " the case studies. And those keyloggers are very popular for all the groups. And they were"
    },
    {
      "Time_Start": 738.8000000000001,
      "Time_End": 745.6,
      "Text": " invented years ago. And with really slight differences in the code, they are being"
    },
    {
      "Time_Start": 745.6,
      "Time_End": 756.08,
      "Text": " continuously used in the intrusions. So finally, when the actors get the passwords to the critical"
    },
    {
      "Time_Start": 756.08,
      "Time_End": 769.9200000000001,
      "Text": " systems, then they enable access. And they, for example, so the intrusions, here we focus on the"
    },
    {
      "Time_Start": 769.9200000000001,
      "Time_End": 776.8000000000001,
      "Text": " technical part. But actually, there is not only one insider during the cyber intrusion. Usually,"
    },
    {
      "Time_Start": 776.8000000000001,
      "Time_End": 785.84,
      "Text": " there are more. And for example, other insider threats could be people who have access to the"
    },
    {
      "Time_Start": 785.84,
      "Time_End": 792.8800000000001,
      "Text": " account systems. And they create account accounts. And closely before the intrusion begins,"
    },
    {
      "Time_Start": 793.76,
      "Time_End": 800.24,
      "Text": " some the ATM cards for those accounts are being taken out of the bank, and they are being delivered"
    },
    {
      "Time_Start": 800.24,
      "Time_End": 811.12,
      "Text": " to the money mules. So during the operations, intruders are focused to gain maximum access to"
    },
    {
      "Time_Start": 811.12,
      "Time_End": 820.56,
      "Text": " the critical system so they can allow transactions to those money mule accounts without the limits."
    },
    {
      "Time_Start": 820.5600000000001,
      "Time_End": 827.5200000000001,
      "Text": " So there is no alerts. And also, the cashouts from the ATMs could be done without the"
    },
    {
      "Time_Start": 827.5200000000001,
      "Time_End": 837.6,
      "Text": " limitations. Everything is organized. It could be like even hundreds or tens, hundreds of money"
    },
    {
      "Time_Start": 837.6,
      "Time_End": 845.2800000000001,
      "Text": " mules when the operators get the access. And the money mules operate in different regions. They go"
    },
    {
      "Time_Start": 845.28,
      "Time_End": 852.88,
      "Text": " to different cities. Sometimes, they cross borders, and they cash out the money mule accounts."
    },
    {
      "Time_Start": 857.76,
      "Time_End": 865.28,
      "Text": " It's really good to understand the history of those groups. For example, in 2014, the big cartel"
    },
    {
      "Time_Start": 865.28,
      "Time_End": 870.88,
      "Text": " was formed. It was called Fork Bombo Cartel. It was created in Kasarani, which is kind of a"
    },
    {
      "Time_Start": 871.52,
      "Time_End": 878.16,
      "Text": " cyber criminal Silicon Valley. This is a ghetto area of Nairobi when there are many people,"
    },
    {
      "Time_Start": 878.88,
      "Time_End": 887.36,
      "Text": " many criminals from Nigeria, from South Africa. And there was a man who was a former policeman,"
    },
    {
      "Time_Start": 887.36,
      "Time_End": 895.92,
      "Text": " a DCI, who formed this Fork Bombo Cartel from the smaller groups. And they were quite prolific for"
    },
    {
      "Time_Start": 895.9200000000001,
      "Time_End": 904.1600000000001,
      "Text": " years. Then they split due to some arrests. So generally, if we would take the diamond model"
    },
    {
      "Time_Start": 904.1600000000001,
      "Time_End": 912.48,
      "Text": " for this group, it was a group that was operated in East Africa. It was created by the policemen."
    },
    {
      "Time_Start": 912.48,
      "Time_End": 920.2400000000001,
      "Text": " And what is very important, those groups have often the support of the local governments,"
    },
    {
      "Time_Start": 920.24,
      "Time_End": 925.6800000000001,
      "Text": " of the police, of the corrupted policemen. So it's very hard for the defenders,"
    },
    {
      "Time_Start": 925.6800000000001,
      "Time_End": 933.44,
      "Text": " and for the targeted organizations to fight those threats. What kind of capabilities they used?"
    },
    {
      "Time_Start": 933.44,
      "Time_End": 940.48,
      "Text": " So they used commercial off-the-shell RADs like TeamViewer, GoToPC, Metasploit, PS Empire."
    },
    {
      "Time_Start": 940.48,
      "Time_End": 948.88,
      "Text": " They used C-Duke, which is a Python-based RAD. They used QuazaRAD, which is available on the"
    },
    {
      "Time_Start": 948.88,
      "Time_End": 956.88,
      "Text": " GitHub. Of course, they used the Python keyloggers. And they used insiders, mostly from the ICT"
    },
    {
      "Time_Start": 956.88,
      "Time_End": 964.4,
      "Text": " personnel. And very often, they used third-party infrastructure. For example, they exfiltrated"
    },
    {
      "Time_Start": 964.4,
      "Time_End": 974.48,
      "Text": " the keylogging to Gmail. And the victims, for example, banks, but also some SACOs,"
    },
    {
      "Time_Start": 974.48,
      "Time_End": 985.2,
      "Text": " other financial institutions. And they were very prolific until the arrest, which happened in 2017."
    },
    {
      "Time_Start": 985.2,
      "Time_End": 993.9200000000001,
      "Text": " And the big cartel was arrested, but many of the members managed to escape. So five smaller"
    },
    {
      "Time_Start": 993.9200000000001,
      "Time_End": 1001.28,
      "Text": " groups were created then, like Silent Cards, GrabZone, smaller version of Forkbombo, Forkbombo Group,"
    },
    {
      "Time_Start": 1001.8399999999999,
      "Time_End": 1007.8399999999999,
      "Text": " The Doctors, and The Telecode. And some of the groups were fighting each other, some were cooperating."
    },
    {
      "Time_Start": 1011.1999999999999,
      "Time_End": 1018.9599999999999,
      "Text": " For example, the GrabZone group was very close to the people that were connected"
    },
    {
      "Time_Start": 1019.76,
      "Time_End": 1026.56,
      "Text": " previously with Forkbombo cartel. Later on, some of the people from GrabZone and the old"
    },
    {
      "Time_Start": 1026.56,
      "Time_End": 1035.84,
      "Text": " money mills created the Forkbombo Group in 2018. On the other hand, there were Silent Cards that"
    },
    {
      "Time_Start": 1035.84,
      "Time_End": 1045.76,
      "Text": " were not cooperating that much with other groups that split with them. Later on, even Silent Cards"
    },
    {
      "Time_Start": 1045.76,
      "Time_End": 1052.72,
      "Text": " split to the consultants and to Rue Rue Shepherds. And for example, the person who created"
    },
    {
      "Time_Start": 1053.68,
      "Time_End": 1058.08,
      "Text": " Silent Cards, Forkbombo cartel, and the consultants is still the same person."
    },
    {
      "Time_Start": 1058.64,
      "Time_End": 1065.52,
      "Text": " So he managed to escape and created next groups consequently."
    },
    {
      "Time_Start": 1067.28,
      "Time_End": 1074.32,
      "Text": " And finally, the Forkbombo Group was terminated at the end of 2019. There was arrest"
    },
    {
      "Time_Start": 1074.96,
      "Time_End": 1081.04,
      "Text": " when they tried to hack one of the biggest banks in Eastern Central Europe, sorry, Africa."
    },
    {
      "Time_Start": 1082.0,
      "Time_End": 1090.96,
      "Text": " And it was a great operation from the defender's perspective, but also it was"
    },
    {
      "Time_Start": 1090.96,
      "Time_End": 1097.2,
      "Text": " quite a big event for the attackers because they even joined with Rue Rue Shepherds then,"
    },
    {
      "Time_Start": 1097.2,
      "Time_End": 1105.44,
      "Text": " and some members of the Rue Rue Shepherds were also arrested during this police action."
    },
    {
      "Time_Start": 1106.3200000000002,
      "Time_End": 1114.56,
      "Text": " How it looks in 2020. So many, nothing is stable. Those groups are mixing with each other. Rue Rue"
    },
    {
      "Time_Start": 1114.56,
      "Time_End": 1123.44,
      "Text": " grabs on, consultants are regrouping. And this is the East Africa threat landscape. However, on the"
    },
    {
      "Time_Start": 1123.44,
      "Time_End": 1129.6000000000001,
      "Text": " other hand, we have also groups from West Africa like Coruseta, and this is also a very interesting"
    },
    {
      "Time_Start": 1129.8400000000001,
      "Time_End": 1138.64,
      "Text": " story because there are some links that they operate with TA505, which is a very prolific"
    },
    {
      "Time_Start": 1138.64,
      "Time_End": 1147.5200000000002,
      "Text": " group. We could hear today Vitaly's presentation about the cooperation between this group and"
    },
    {
      "Time_Start": 1147.5200000000002,
      "Time_End": 1155.6000000000001,
      "Text": " Lazarus. Always those cooperations between different redactors is very interesting to research."
    },
    {
      "Time_Start": 1155.92,
      "Time_End": 1160.4,
      "Text": " And this is the timeline, and this timeline and this history also affected the"
    },
    {
      "Time_Start": 1161.92,
      "Time_End": 1167.92,
      "Text": " development and the modus operandi of those groups, and we'll show it on the example of the key loggers."
    },
    {
      "Time_Start": 1170.64,
      "Time_End": 1178.64,
      "Text": " Let's focus on some details about some of the groups, for example, Silent Cards."
    },
    {
      "Time_Start": 1179.2800000000002,
      "Time_End": 1188.16,
      "Text": " It has lots of members, also it's African gang capabilities. Again, they use GoToPC,"
    },
    {
      "Time_Start": 1188.16,
      "Time_End": 1195.6000000000001,
      "Text": " AnyPC, C-DUBE, but the new version, new updated version, and the key logger, which is called"
    },
    {
      "Time_Start": 1195.6000000000001,
      "Time_End": 1205.2800000000002,
      "Text": " LandCruiser, but very similar to the old key loggers of the Fork Bombo. In this case, so in the"
    },
    {
      "Time_Start": 1205.68,
      "Time_End": 1211.36,
      "Text": " case of Silent Cards, they use insiders, but it doesn't have to be an ICT personnel, it could be"
    },
    {
      "Time_Start": 1211.36,
      "Time_End": 1217.92,
      "Text": " anyone with access, and sometimes it happened that even a janitor could enable an access to"
    },
    {
      "Time_Start": 1217.92,
      "Time_End": 1227.28,
      "Text": " those groups and connect the laptop somewhere to the network. They have very fast operational"
    },
    {
      "Time_Start": 1227.36,
      "Time_End": 1234.56,
      "Text": " They have very fast operational tempo. They use also a lot of cloud services, like"
    },
    {
      "Time_Start": 1234.56,
      "Time_End": 1245.36,
      "Text": " exfiltrating key logging to FTP, DriveHQ, to Gmail. They have quite wide targeting, for example,"
    },
    {
      "Time_Start": 1245.36,
      "Time_End": 1250.8,
      "Text": " not only financial institutions, but also insurance sector, also hospitals."
    },
    {
      "Time_Start": 1251.36,
      "Time_End": 1258.1599999999999,
      "Text": " The group called The Consultants, so the next group created by the same guy who"
    },
    {
      "Time_Start": 1259.76,
      "Time_End": 1266.32,
      "Text": " united the Fork Bombo cartel. In their case, for example, apart from other tools, they also use"
    },
    {
      "Time_Start": 1266.32,
      "Time_End": 1275.84,
      "Text": " W-Agent, another commercial freely available software for remote access control,"
    },
    {
      "Time_Start": 1276.3999999999999,
      "Time_End": 1286.1599999999999,
      "Text": " and Python key logger called CocoLogger. They also connect the creditors, so whenever"
    },
    {
      "Time_Start": 1286.1599999999999,
      "Time_End": 1294.0,
      "Text": " they use W-Agent, they have to use the infrastructure from this service."
    },
    {
      "Time_Start": 1297.36,
      "Time_End": 1303.6799999999998,
      "Text": " And GrubZone, general description, but later on, after our case studies, we'll see how the GrubZone"
    },
    {
      "Time_Start": 1304.3200000000002,
      "Time_End": 1312.16,
      "Text": " cluster looks in 2020. So in general, they use backdoors like Matterpreter, PS Empire,"
    },
    {
      "Time_Start": 1312.16,
      "Time_End": 1321.2,
      "Text": " Caesarrat, Rotnetter, so they experiment. You can see that they do not attach to one of the tools,"
    },
    {
      "Time_Start": 1321.2,
      "Time_End": 1324.96,
      "Text": " they experiment, they mix the tools, probably because they want to"
    },
    {
      "Time_Start": 1325.52,
      "Time_End": 1335.8400000000001,
      "Text": " have very low AV detection. They do not focus that much on some obfuscations on evading AV in"
    },
    {
      "Time_Start": 1335.8400000000001,
      "Time_End": 1342.96,
      "Text": " a technical way. Rather, they seek for new tools that are not that well known, that they do not"
    },
    {
      "Time_Start": 1342.96,
      "Time_End": 1350.32,
      "Text": " have the signatures, and we'll see it later on during the case studies. Apart from freely available"
    },
    {
      "Time_Start": 1350.32,
      "Time_End": 1357.04,
      "Text": " RATs, they use also commercial software for remote access control like AnyDesk,"
    },
    {
      "Time_Start": 1357.04,
      "Time_End": 1364.8,
      "Text": " Root, Symbot, and again, they use the keylogger. So this is quite common for different groups,"
    },
    {
      "Time_Start": 1364.8,
      "Time_End": 1372.56,
      "Text": " they use Hail Mary keylogger, and they also target the financial sector, a very successful group."
    },
    {
      "Time_Start": 1372.72,
      "Time_End": 1379.9199999999998,
      "Text": " So let's go to the first case study about the Python keyloggers. So we'll also analyze the"
    },
    {
      "Time_Start": 1381.52,
      "Time_End": 1386.32,
      "Text": " initial, the origin of the keyloggers from the Fork Bombo cartel."
    },
    {
      "Time_Start": 1389.44,
      "Time_End": 1396.1599999999999,
      "Text": " And this is one origin, there is a main function, probably copied and pasted to the"
    },
    {
      "Time_Start": 1396.88,
      "Time_End": 1405.3600000000001,
      "Text": " original keylogger of the Fork Bombo cartel. That's how you utilize,"
    },
    {
      "Time_Start": 1406.8000000000002,
      "Time_End": 1414.3200000000002,
      "Text": " how you use keylogging in Python. Even the variables were not changed, and you could"
    },
    {
      "Time_Start": 1414.3200000000002,
      "Time_End": 1419.68,
      "Text": " see that the same variables are present in different keyloggers of different groups."
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1426.48,
      "Text": " Some parts are also not changed and are common among those keyloggers. For example,"
    },
    {
      "Time_Start": 1427.04,
      "Time_End": 1435.2,
      "Text": " the name of the file where the logs are stored, so all the keys that are pressed by the victim,"
    },
    {
      "Time_Start": 1435.2,
      "Time_End": 1445.28,
      "Text": " is usually named after the username, so after the victim username. And you can see also the"
    },
    {
      "Time_Start": 1445.36,
      "Time_End": 1452.16,
      "Text": " commented section in the green, where previously the Fork Bombo cartel used to exfiltrate"
    },
    {
      "Time_Start": 1452.8799999999999,
      "Time_End": 1461.36,
      "Text": " those logs to Gmail, and that's why the name of the cluster comes from, Fork Bombo."
    },
    {
      "Time_Start": 1462.8799999999999,
      "Time_End": 1472.72,
      "Text": " Later on, they decided to leave the archive with the locked keys on the machine,"
    },
    {
      "Time_Start": 1473.44,
      "Time_End": 1475.92,
      "Text": " and exfiltrated using the command control channel."
    },
    {
      "Time_Start": 1478.32,
      "Time_End": 1484.88,
      "Text": " And you could see on that picture, the comparison between the Cocoa Logger, which is a"
    },
    {
      "Time_Start": 1487.28,
      "Time_End": 1493.04,
      "Text": " tool from the consultants, and the Land Cruiser, which is a tool used by Silent Cards, that there"
    },
    {
      "Time_Start": 1493.2,
      "Time_End": 1503.76,
      "Text": " are many similarities, and the changes are very slight. Some parts are commented, some imports"
    },
    {
      "Time_Start": 1503.76,
      "Time_End": 1510.48,
      "Text": " are commented, because they don't use them anymore, or maybe they experiment with some"
    },
    {
      "Time_Start": 1510.48,
      "Time_End": 1520.24,
      "Text": " exfiltration to FTP. But generally, the way they lock the keystrokes, and the way they form the"
    },
    {
      "Time_Start": 1520.24,
      "Time_End": 1527.84,
      "Text": " log, they create the log, is the same among different versions of those African keyloggers."
    },
    {
      "Time_Start": 1530.4,
      "Time_End": 1539.1200000000001,
      "Text": " And those are common artifacts that I gathered for those AFTs. Those files are usually quite large,"
    },
    {
      "Time_Start": 1539.1200000000001,
      "Time_End": 1546.4,
      "Text": " because the Python scripts are compiled to exe files with PyInstaller. The filenames are"
    },
    {
      "Time_Start": 1546.4,
      "Time_End": 1553.44,
      "Text": " masquerading known software, like OneNote, Adobe Exe, and they are usually located by adversaries"
    },
    {
      "Time_Start": 1553.44,
      "Time_End": 1560.64,
      "Text": " in program data. However, the logs are saved to program data, but they could be also located in"
    },
    {
      "Time_Start": 1560.64,
      "Time_End": 1569.3600000000001,
      "Text": " user profile, or all users profile. And this is also a good threat hunting hint, that often"
    },
    {
      "Time_Start": 1569.3600000000001,
      "Time_End": 1576.4,
      "Text": " adversaries put files, they use those locations as their staging folders,"
    },
    {
      "Time_Start": 1578.0800000000002,
      "Time_End": 1584.0000000000002,
      "Text": " and this is a good also threat hunting rule, that you could try to detect if there are any files"
    },
    {
      "Time_Start": 1584.0000000000002,
      "Time_End": 1592.0800000000002,
      "Text": " created there, because usually there should be a folder structure, and not single files"
    },
    {
      "Time_Start": 1592.08,
      "Time_End": 1600.56,
      "Text": " located in those directories. And the filenames are often based on the username,"
    },
    {
      "Time_Start": 1600.56,
      "Time_End": 1607.12,
      "Text": " and the extensions are different. It could be in different archives, or renamed extensions to some"
    },
    {
      "Time_Start": 1607.76,
      "Time_End": 1616.6399999999999,
      "Text": " system files, like any sys. And those keyloggers usually have run keys persistence. So very simple,"
    },
    {
      "Time_Start": 1616.64,
      "Time_End": 1624.88,
      "Text": " not sophisticated persistence in the registry, and that's why those keyloggers are run after every"
    },
    {
      "Time_Start": 1626.0,
      "Time_End": 1635.5200000000002,
      "Text": " reboot of the operating system. Is it possible to easily detect such keyloggers?"
    },
    {
      "Time_Start": 1636.96,
      "Time_End": 1645.3600000000001,
      "Text": " Usually not, because they are compiled by the PyInstaller, so there is a runtime environment"
    },
    {
      "Time_Start": 1645.3600000000001,
      "Time_End": 1655.3600000000001,
      "Text": " for the script. So you cannot try to create the error rule for specific characters that you could"
    },
    {
      "Time_Start": 1655.3600000000001,
      "Time_End": 1662.8000000000002,
      "Text": " find after the compilation of this to this Python script. However, there are quite unique imports"
    },
    {
      "Time_Start": 1662.8000000000002,
      "Time_End": 1672.2400000000002,
      "Text": " in the script, and for example, I used them to hunt for those keyloggers. It's very hard to"
    },
    {
      "Time_Start": 1672.24,
      "Time_End": 1678.88,
      "Text": " find the keylogger for a specific group, but with this Yara, for example, you could find"
    },
    {
      "Time_Start": 1678.88,
      "Time_End": 1686.64,
      "Text": " a group of keyloggers that are with high confidence associated with the African threat groups,"
    },
    {
      "Time_Start": 1686.64,
      "Time_End": 1694.8,
      "Text": " and later on, after the compilation, analysts could gather more information, and apply a second"
    },
    {
      "Time_Start": 1694.96,
      "Time_End": 1701.28,
      "Text": " Yara rules to the decompiled script, and then cluster the malware."
    },
    {
      "Time_Start": 1705.12,
      "Time_End": 1713.6,
      "Text": " So you could see that the core, the origin of the keyloggers is unchanged, and usually there"
    },
    {
      "Time_Start": 1713.6,
      "Time_End": 1719.44,
      "Text": " are small differences, and also small differences how they use those keyloggers, how they choose the"
    },
    {
      "Time_Start": 1720.0800000000002,
      "Time_End": 1727.68,
      "Text": " directories. So this is quite common. Now we will focus on Grabson infrastructure,"
    },
    {
      "Time_Start": 1727.68,
      "Time_End": 1731.6000000000001,
      "Text": " and their capabilities from 2020."
    },
    {
      "Time_Start": 1734.24,
      "Time_End": 1741.6000000000001,
      "Text": " Actually, we'll try to analyze one of the IPs, and this IP was found in one of the public resources"
    },
    {
      "Time_Start": 1741.6000000000001,
      "Time_End": 1750.96,
      "Text": " from online services. If this topic also finds you interesting, I really recommend"
    },
    {
      "Time_Start": 1751.8400000000001,
      "Time_End": 1760.4800000000002,
      "Text": " visiting their web page, and reading their materials, which is often a fascinating story."
    },
    {
      "Time_Start": 1762.96,
      "Time_End": 1770.0800000000002,
      "Text": " So I found this IP, and I tried to analyze if there is any information that I could gather"
    },
    {
      "Time_Start": 1770.08,
      "Time_End": 1776.3999999999999,
      "Text": " more and reach about this IP. What are those new Python 3.0 capabilities of those groups?"
    },
    {
      "Time_Start": 1776.3999999999999,
      "Time_End": 1783.4399999999998,
      "Text": " That was my analytic question. So if we go to Shodan, and especially the beta version,"
    },
    {
      "Time_Start": 1783.4399999999998,
      "Time_End": 1792.08,
      "Text": " which offers the history in its GUI, and really recommends trying beta version of Shodan,"
    },
    {
      "Time_Start": 1792.3999999999999,
      "Time_End": 1801.36,
      "Text": " not the old one, because history of the previously indexed information is very useful during such"
    },
    {
      "Time_Start": 1801.36,
      "Time_End": 1810.48,
      "Text": " investigations. Is there anything interesting? For sure, ports like 3306, 3389 could be very"
    },
    {
      "Time_Start": 1810.48,
      "Time_End": 1821.1999999999998,
      "Text": " interesting, because those are ports connected with MySQL database, with RDP. So if we check"
    },
    {
      "Time_Start": 1821.2,
      "Time_End": 1829.2,
      "Text": " those unusual ports, we could learn more about infrastructure, about previous actions of this"
    },
    {
      "Time_Start": 1829.8400000000001,
      "Time_End": 1837.04,
      "Text": " threat group. Generally, this IP belongs to the hosting, which, as you can see on the screen,"
    },
    {
      "Time_Start": 1837.04,
      "Time_End": 1848.0800000000002,
      "Text": " very often offers some VPSs, VMs, focused on offensive security capabilities, like Kali Linux,"
    },
    {
      "Time_Start": 1848.08,
      "Time_End": 1855.84,
      "Text": " Parallel Security, Tor hidden service also, for example. So it is also very important to know that"
    },
    {
      "Time_Start": 1856.3999999999999,
      "Time_End": 1862.6399999999999,
      "Text": " such a group prefers this type of hosting, because whenever in later investigations,"
    },
    {
      "Time_Start": 1863.6799999999998,
      "Time_End": 1872.0,
      "Text": " we'll gather new data, this could help us to support our hypothesis, for example, if the next"
    },
    {
      "Time_Start": 1872.0,
      "Time_End": 1878.88,
      "Text": " IP belongs to that group, and if it is also the same hosting, that this could be an indicator for,"
    },
    {
      "Time_Start": 1879.52,
      "Time_End": 1886.4,
      "Text": " that could help us to support our hypothesis. So if we check the RDP on that"
    },
    {
      "Time_Start": 1888.24,
      "Time_End": 1896.32,
      "Text": " host that was served several weeks ago, we could find out that there is a message"
    },
    {
      "Time_Start": 1896.32,
      "Time_End": 1904.8,
      "Text": " related to the National Bank of Kenya. So probably what the adversary did was that"
    },
    {
      "Time_Start": 1904.8,
      "Time_End": 1914.96,
      "Text": " they tunneled out the access to the computer inside the National Bank of Kenya, and they accessed"
    },
    {
      "Time_Start": 1914.96,
      "Time_End": 1922.1599999999999,
      "Text": " that workstation after tunneling out this traffic. So this is one of the indicators that they"
    },
    {
      "Time_Start": 1922.16,
      "Time_End": 1926.88,
      "Text": " successfully breached this financial institution."
    },
    {
      "Time_Start": 1930.88,
      "Time_End": 1937.44,
      "Text": " And if we would like to analyze what was on port 8080, which was associated with this new Python"
    },
    {
      "Time_Start": 1937.44,
      "Time_End": 1943.2,
      "Text": " free backdoor capabilities, we could find out that there is not much information, something about"
    },
    {
      "Time_Start": 1944.48,
      "Time_End": 1951.1200000000001,
      "Text": " something from August, something from July, and probably not related to this backdoor."
    },
    {
      "Time_Start": 1952.96,
      "Time_End": 1958.0,
      "Text": " Because as far as I learned, this backdoor was used in the beginning of the year."
    },
    {
      "Time_Start": 1960.48,
      "Time_End": 1967.76,
      "Text": " So what kind of backdoor they are probably using? If you take the strings that are also available"
    },
    {
      "Time_Start": 1967.76,
      "Time_End": 1976.5600000000002,
      "Text": " on this website, you could easily find the project on Google. There are only seven"
    },
    {
      "Time_Start": 1977.52,
      "Time_End": 1986.48,
      "Text": " hits in Google, and there is an IJR shell project on GitHub. This is not a human resources project,"
    },
    {
      "Time_Start": 1986.48,
      "Time_End": 1993.28,
      "Text": " but a backdoor with a server component written in Python, Python free actually."
    },
    {
      "Time_Start": 1998.1599999999999,
      "Time_End": 2005.6799999999998,
      "Text": " And it could be used on many of the platforms like Linux, MacOS, Windows. It has the"
    },
    {
      "Time_Start": 2005.68,
      "Time_End": 2014.72,
      "Text": " capabilities also to validate the client, and you could also filter out the client. So maybe"
    },
    {
      "Time_Start": 2015.3600000000001,
      "Time_End": 2025.28,
      "Text": " there is not much information on this C2 that we analyze because there was a kind of a firewalling."
    },
    {
      "Time_Start": 2027.76,
      "Time_End": 2033.2,
      "Text": " But if you take the same string, which is quite unique, and there were only seven hits in Google,"
    },
    {
      "Time_Start": 2033.2,
      "Time_End": 2039.8400000000001,
      "Text": " and you check it on VirusTotal, there is also not much, only two files with those strings."
    },
    {
      "Time_Start": 2039.8400000000001,
      "Time_End": 2048.88,
      "Text": " But you could see also the detections, and have a look. There are only, after the compilation"
    },
    {
      "Time_Start": 2048.88,
      "Time_End": 2056.88,
      "Text": " of this Python scripts to exit file, there is only one AV detection using the static signature."
    },
    {
      "Time_Start": 2057.84,
      "Time_End": 2063.6,
      "Text": " So probably that's the reason why the GrubZone group tries to utilize new"
    },
    {
      "Time_Start": 2063.6,
      "Time_End": 2069.6,
      "Text": " capabilities and tries to find something that evades AV detection."
    },
    {
      "Time_Start": 2072.08,
      "Time_End": 2081.2000000000003,
      "Text": " So what about C2 server component? Can we learn something about it? Are there any traces on this IP"
    },
    {
      "Time_Start": 2081.2,
      "Time_End": 2088.24,
      "Text": " related to this project? So this is a Python-based HTTP server,"
    },
    {
      "Time_Start": 2090.3199999999997,
      "Time_End": 2097.04,
      "Text": " and I found only one indicator in January that this could be"
    },
    {
      "Time_Start": 2098.7999999999997,
      "Time_End": 2104.56,
      "Text": " the time when the project was deployed and was active, and you could see the header connected"
    },
    {
      "Time_Start": 2104.56,
      "Time_End": 2111.52,
      "Text": " with Python 3 and the project Werkzeug. So on the above pictures you have"
    },
    {
      "Time_Start": 2114.4,
      "Time_End": 2124.24,
      "Text": " parts from the source code, and below you have the HTTP response from the IP that we"
    },
    {
      "Time_Start": 2124.24,
      "Time_End": 2133.68,
      "Text": " analyzed and is attributed to GrubZone in this year. So I tried to play a little bit with this"
    },
    {
      "Time_Start": 2133.68,
      "Time_End": 2144.7999999999997,
      "Text": " project and try it out to find a way if there is any possibility to fingerprint this C2 server,"
    },
    {
      "Time_Start": 2144.7999999999997,
      "Time_End": 2152.24,
      "Text": " and maybe to find new instances, maybe to track if anybody on the internet is using that kind"
    },
    {
      "Time_Start": 2152.24,
      "Time_End": 2162.3199999999997,
      "Text": " of capabilities. So when I used curl for experiments, I received similar headers that I"
    },
    {
      "Time_Start": 2162.32,
      "Time_End": 2169.52,
      "Text": " saw on this IP that was belonging to GrubZone. Of course the version of Python was"
    },
    {
      "Time_Start": 2169.52,
      "Time_End": 2176.88,
      "Text": " different because I had different environment, but other headers were quite similar or almost the same."
    },
    {
      "Time_Start": 2180.0800000000004,
      "Time_End": 2187.52,
      "Text": " So just to check generally how many Werkzeug servers are deployed in the internet, there are like"
    },
    {
      "Time_Start": 2187.52,
      "Time_End": 2200.56,
      "Text": " 160,000 servers. If you look for this specific version, the number is quite lower"
    },
    {
      "Time_Start": 2200.56,
      "Time_End": 2204.08,
      "Text": " and quite manageable, it's about 300."
    },
    {
      "Time_Start": 2206.64,
      "Time_End": 2214.96,
      "Text": " However, if we take those headers which are quite unique to this project, the numbers"
    },
    {
      "Time_Start": 2214.96,
      "Time_End": 2224.16,
      "Text": " are being filtered out, and later on I also tried to analyze the source code of the C2"
    },
    {
      "Time_Start": 2224.16,
      "Time_End": 2231.6,
      "Text": " component, and there is one resource registered, the commander. So whenever you send the GET"
    },
    {
      "Time_Start": 2232.16,
      "Time_End": 2242.2400000000002,
      "Text": " to the commander URL, you receive the 308 permanent redirect, not very popular HTTP response,"
    },
    {
      "Time_Start": 2243.2000000000003,
      "Time_End": 2251.36,
      "Text": " and this permanent redirect redirects to the commander with slash at the end, and then you"
    },
    {
      "Time_Start": 2251.36,
      "Time_End": 2260.0000000000005,
      "Text": " receive HTTP response 200. So this kind of a behavior that when you send the GET commander"
    },
    {
      "Time_Start": 2260.0000000000005,
      "Time_End": 2268.96,
      "Text": " without slash, you get 308 permanent redirect, and then you send the right GET to the commander"
    },
    {
      "Time_Start": 2269.04,
      "Time_End": 2277.52,
      "Text": " with slash, and you receive HTTP response 200. This kind of a behavior is something very unique"
    },
    {
      "Time_Start": 2277.52,
      "Time_End": 2288.2400000000002,
      "Text": " to this Python C2 server, and with this knowledge, it is very possible to search in census, to search"
    },
    {
      "Time_Start": 2288.2400000000002,
      "Time_End": 2295.44,
      "Text": " in showdown for those servers, because in this case, I'm trying to find out what servers are"
    },
    {
      "Time_Start": 2295.44,
      "Time_End": 2304.88,
      "Text": " giving me the response 302, because this is the response when I said the simple GET to the root,"
    },
    {
      "Time_Start": 2306.0,
      "Time_End": 2316.48,
      "Text": " and I only focus on 302, and if I want to be 100% sure, I can then send the GET to the commander"
    },
    {
      "Time_Start": 2316.48,
      "Time_End": 2326.32,
      "Text": " URL, and be absolutely sure that there is a HR shell server behind."
    },
    {
      "Time_Start": 2328.32,
      "Time_End": 2335.84,
      "Text": " That was the example of a search for census. This is an example in the syntax that is used by showdown."
    },
    {
      "Time_Start": 2337.84,
      "Time_End": 2344.88,
      "Text": " So generally, I'm looking for the specific headers, but I'm not looking for the response 200."
    },
    {
      "Time_Start": 2344.88,
      "Time_End": 2351.2000000000003,
      "Text": " This response only happens when you send the correct URL, and in this case,"
    },
    {
      "Time_Start": 2351.2000000000003,
      "Time_End": 2357.28,
      "Text": " showdown census are sending just the most basic GETs to the root."
    },
    {
      "Time_Start": 2360.0,
      "Time_End": 2366.08,
      "Text": " What are other C2 fingerprints on this IP server? Can we learn more about the adversary?"
    },
    {
      "Time_Start": 2366.08,
      "Time_End": 2374.3199999999997,
      "Text": " What kind of services they used this year when they were operating with this server hosted"
    },
    {
      "Time_Start": 2376.24,
      "Time_End": 2382.4,
      "Text": " there? So there is quite a unique subject for the SSL certificate, and when you take"
    },
    {
      "Time_Start": 2382.4,
      "Time_End": 2387.52,
      "Text": " this subject and try to search the database for SSL certificates,"
    },
    {
      "Time_Start": 2388.08,
      "Time_End": 2395.2,
      "Text": " for example, in census, there are only two IPs that are currently hosting SSL certificates with"
    },
    {
      "Time_Start": 2395.2,
      "Time_End": 2405.12,
      "Text": " such a subject. One is our well-known IP that begins with 145, but there is also another one,"
    },
    {
      "Time_Start": 2405.68,
      "Time_End": 2414.72,
      "Text": " and hosted in the same IP address range of the OVH hosting, which rents place to the"
    },
    {
      "Time_Start": 2415.36,
      "Time_End": 2425.92,
      "Text": " second hosting company that offers VPSs. However, this second IP, I'm not sure if it is"
    },
    {
      "Time_Start": 2426.5600000000004,
      "Time_End": 2431.6800000000003,
      "Text": " related to GrubZone, but it's always worth for thread intel analysts to mark such information,"
    },
    {
      "Time_Start": 2431.6800000000003,
      "Time_End": 2438.88,
      "Text": " and maybe later on, when our investigations gather more data, we collect more information,"
    },
    {
      "Time_Start": 2439.28,
      "Time_End": 2447.76,
      "Text": " we collect more information, maybe later on, we could connect this new IP with GrubZone cluster."
    },
    {
      "Time_Start": 2449.12,
      "Time_End": 2457.52,
      "Text": " And in thread intel world, we also use very often markings with our confidence level,"
    },
    {
      "Time_Start": 2457.52,
      "Time_End": 2464.6400000000003,
      "Text": " so we could market with very low confidence level. This is the IP that possibly belongs"
    },
    {
      "Time_Start": 2465.2799999999997,
      "Time_End": 2471.04,
      "Text": " to GrubZone, and maybe later on, when we get more data, more confidence, we could change this"
    },
    {
      "Time_Start": 2471.04,
      "Time_End": 2483.52,
      "Text": " assessment. And there are also other interesting C2 fingerprints that I found related to this IP."
    },
    {
      "Time_Start": 2483.52,
      "Time_End": 2490.96,
      "Text": " Actually, on another port, there was another HTTP response with such a body,"
    },
    {
      "Time_Start": 2491.12,
      "Time_End": 2502.88,
      "Text": " get file not specified in URL. And when I took this string again into Google, I found only one"
    },
    {
      "Time_Start": 2505.2,
      "Time_End": 2513.52,
      "Text": " response. There was a blog post about a man who showed how to create a file server in Golang"
    },
    {
      "Time_Start": 2513.52,
      "Time_End": 2523.52,
      "Text": " language and to host files. So it looks that the adversary took the code and hosted this Golang"
    },
    {
      "Time_Start": 2523.52,
      "Time_End": 2533.6,
      "Text": " server just to serve the files. They only did small modification. They added some HTTP response"
    },
    {
      "Time_Start": 2533.6,
      "Time_End": 2543.2,
      "Text": " headers. And my opinion is that they added those headers because they use this server to download"
    },
    {
      "Time_Start": 2543.2000000000003,
      "Time_End": 2551.2000000000003,
      "Text": " files on the victim machines using their browsers, so not using the C2 channel. And those headers"
    },
    {
      "Time_Start": 2551.2000000000003,
      "Time_End": 2562.1600000000003,
      "Text": " are there to make sure that the browser does not send any warnings that there is a problem with"
    },
    {
      "Time_Start": 2562.1600000000003,
      "Time_End": 2570.32,
      "Text": " extension and the MIME type. And that's why those extension problems, file type problems are"
    },
    {
      "Time_Start": 2570.32,
      "Time_End": 2580.2400000000002,
      "Text": " neglected. So if you take this specific string, you can only find currently one IP address"
    },
    {
      "Time_Start": 2580.96,
      "Time_End": 2588.32,
      "Text": " well known to us. But whenever they decide to use it again, this type of service somewhere else,"
    },
    {
      "Time_Start": 2589.2000000000003,
      "Time_End": 2596.0,
      "Text": " probably it would be quite easy to find them if they decide to continue these capabilities"
    },
    {
      "Time_Start": 2596.0,
      "Time_End": 2604.32,
      "Text": " on different infrastructure. Using Showdown, there is a very convenient way to use the"
    },
    {
      "Time_Start": 2604.32,
      "Time_End": 2609.44,
      "Text": " hashes of the responses. Showdown hashes the responses and you could use the hash."
    },
    {
      "Time_Start": 2609.44,
      "Time_End": 2615.6,
      "Text": " And the result is also the same. So this service is served on two ports on this IP."
    },
    {
      "Time_Start": 2618.4,
      "Time_End": 2623.84,
      "Text": " Some other hints about hunting their tools. For example, the client part"
    },
    {
      "Time_Start": 2623.84,
      "Time_End": 2630.48,
      "Text": " of the HR shell, after the compilation with the Pi installer to Windows executable,"
    },
    {
      "Time_Start": 2631.1200000000003,
      "Time_End": 2638.88,
      "Text": " there is a manifest file in the resources. And when you try to look, try to find for other"
    },
    {
      "Time_Start": 2638.88,
      "Time_End": 2645.6000000000004,
      "Text": " samples that have the same manifest file in the resources, you only find the HR shell"
    },
    {
      "Time_Start": 2646.3199999999997,
      "Time_End": 2655.44,
      "Text": " samples. For example, it is that manifest file, very unique to this project. And when you"
    },
    {
      "Time_Start": 2656.96,
      "Time_End": 2663.92,
      "Text": " search for these resources, for example, in the virus total database, in the latest indices,"
    },
    {
      "Time_Start": 2663.92,
      "Time_End": 2674.48,
      "Text": " you get only 15 files and all those files are compiled HR shell client component."
    },
    {
      "Time_Start": 2676.56,
      "Time_End": 2682.16,
      "Text": " Is there anything else suspicious on this host? Yeah, there are some more interesting things"
    },
    {
      "Time_Start": 2682.72,
      "Time_End": 2690.7999999999997,
      "Text": " that were hosted on this IP. For example, in February, in March, April, there was such a"
    },
    {
      "Time_Start": 2690.7999999999997,
      "Time_End": 2699.6,
      "Text": " response, probably some of you that are familiar with offensive security frameworks, they know what"
    },
    {
      "Time_Start": 2700.24,
      "Time_End": 2708.64,
      "Text": " kind of tool that could be. So this is a default method pretty response."
    },
    {
      "Time_Start": 2712.08,
      "Time_End": 2719.52,
      "Text": " In January on this on the same IP, there was a PS Empire hosted. This is a very also very typical"
    },
    {
      "Time_Start": 2719.52,
      "Time_End": 2727.44,
      "Text": " default response from the PS Empire c2. However, I do not associate this activity with this"
    },
    {
      "Time_Start": 2728.0,
      "Time_End": 2736.96,
      "Text": " cluster. Why is that? Because the the fingerprint of the SSH. So we had today the presentation about"
    },
    {
      "Time_Start": 2736.96,
      "Time_End": 2744.88,
      "Text": " fingerprinting, very interesting, and fingerprinting is very useful in our daily job."
    },
    {
      "Time_Start": 2744.88,
      "Time_End": 2754.16,
      "Text": " So in this case, we we know that the fingerprint of the SSH service was changed on the 24th of"
    },
    {
      "Time_Start": 2754.16,
      "Time_End": 2765.2799999999997,
      "Text": " January. So and it was presence till now. And everything before 24 could be a different build"
    },
    {
      "Time_Start": 2765.2799999999997,
      "Time_End": 2775.04,
      "Text": " of the operating system, it could be same actor that reinstalled the software. But we can't have"
    },
    {
      "Time_Start": 2775.04,
      "Time_End": 2781.6,
      "Text": " even moderate confidence for that. So up to now, I do not include those information that"
    },
    {
      "Time_Start": 2781.6,
      "Time_End": 2787.92,
      "Text": " this is belong, this could be related to the African threads. It could be totally somebody"
    },
    {
      "Time_Start": 2787.92,
      "Time_End": 2795.6,
      "Text": " else, even the red team. In December, there was also something interesting. This is a typical"
    },
    {
      "Time_Start": 2795.6,
      "Time_End": 2801.92,
      "Text": " response from the cobalt strike is the same actor, we don't have hard evidence for clustering that"
    },
    {
      "Time_Start": 2802.7999999999997,
      "Time_End": 2807.12,
      "Text": " could be somebody else that that uses that one cloud hosting."
    },
    {
      "Time_Start": 2807.12,
      "Time_End": 2818.3199999999997,
      "Text": " So generally, what we learned about grabzone summary, so the capabilities they use, they use HR shell"
    },
    {
      "Time_Start": 2818.3199999999997,
      "Time_End": 2826.88,
      "Text": " from other samples from other knowledge, we know that they use RG, RG rat free, they use still"
    },
    {
      "Time_Start": 2826.88,
      "Time_End": 2834.64,
      "Text": " metal pretor, they use RDP tunneling with probably ng rock. So when they breach the"
    },
    {
      "Time_Start": 2835.12,
      "Time_End": 2837.44,
      "Text": " victim organization, they try to tunnel out"
    },
    {
      "Time_Start": 2839.6,
      "Time_End": 2846.56,
      "Text": " some protocols to have easier access to their infrastructure, they use tools downloaded via"
    },
    {
      "Time_Start": 2846.56,
      "Time_End": 2856.08,
      "Text": " victim browsers, because they use the file server written in go. They, we see that they prefer such"
    },
    {
      "Time_Start": 2856.64,
      "Time_End": 2861.6,
      "Text": " infrastructure created in the hosting company named cloud one host."
    },
    {
      "Time_Start": 2864.24,
      "Time_End": 2869.04,
      "Text": " They don't use domain based infrastructure, they use only IP based infrastructure,"
    },
    {
      "Time_Start": 2869.7599999999998,
      "Time_End": 2876.3199999999997,
      "Text": " and about something about the victim. So through the analysis of their infrastructure, we learned"
    },
    {
      "Time_Start": 2876.3199999999997,
      "Time_End": 2882.64,
      "Text": " that they were probably successful against breaching National Bank of Kenya, which was also"
    },
    {
      "Time_Start": 2883.2799999999997,
      "Time_End": 2891.6,
      "Text": " supported by later evidence and different other sources that yes, that the crabs and was successful"
    },
    {
      "Time_Start": 2891.6,
      "Time_End": 2900.24,
      "Text": " in in breaching them. If you also feel interested in in those subjects, I really recommend going to"
    },
    {
      "Time_Start": 2900.24,
      "Time_End": 2909.04,
      "Text": " on it services to this. So to the blog of the company that really fights those threats, and"
    },
    {
      "Time_Start": 2909.04,
      "Time_End": 2916.56,
      "Text": " they don't only support them with instant response. And you could see that Africa threat"
    },
    {
      "Time_Start": 2916.56,
      "Time_End": 2921.84,
      "Text": " landscape is quite unique. And you could meet many of the techniques that are not very popular"
    },
    {
      "Time_Start": 2921.84,
      "Time_End": 2927.92,
      "Text": " somewhere somewhere else, like this hardware additions. Now, on the other hand, and defenders"
    },
    {
      "Time_Start": 2927.92,
      "Time_End": 2934.88,
      "Text": " are also working the other way around, because people from on it services are often have often"
    },
    {
      "Time_Start": 2935.04,
      "Time_End": 2941.6800000000003,
      "Text": " the authorization from government to hack back and they also hack back the city infrastructure"
    },
    {
      "Time_Start": 2942.2400000000002,
      "Time_End": 2947.76,
      "Text": " of the adversaries and lots of the samples are gathered from the from such"
    },
    {
      "Time_Start": 2948.96,
      "Time_End": 2955.6800000000003,
      "Text": " offensive network operations. And I have to admit that they are very brave people because they are"
    },
    {
      "Time_Start": 2957.04,
      "Time_End": 2964.4,
      "Text": " fighting them locally. And the threats are and the risk is quite real. It's not like a simple"
    },
    {
      "Time_Start": 2964.4,
      "Time_End": 2972.64,
      "Text": " analysis of threats when you're sitting miles away. They conduct very close proximity operations"
    },
    {
      "Time_Start": 2972.64,
      "Time_End": 2980.48,
      "Text": " against those threats. And those those gangs have big support from the politicians from"
    },
    {
      "Time_Start": 2980.48,
      "Time_End": 2992.64,
      "Text": " corrupted policemen. So yeah, so very interesting and great shop about to those people who fight"
    },
    {
      "Time_Start": 2992.64,
      "Time_End": 3001.92,
      "Text": " AFT groups. And thank you all for for watching, for listening. Hope you're also interested in this"
    },
    {
      "Time_Start": 3001.92,
      "Time_End": 3014.64,
      "Text": " new threat landscape new for me maybe also for for you too. Thank you"
    }
  ]
}