{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 9.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome to the annual DEFCON convention. This meeting was held in exciting Las Vegas, Nevada from July 9th through the 11th, 1999."
    },
    {
      "Time_Start": 11.0,
      "Time_End": 16.0,
      "Text": " This is video tape number 26, Viruses on and off the Internet."
    },
    {
      "Time_Start": 16.0,
      "Time_End": 30.0,
      "Text": " You're starting to get a little close to each other, although the virus community I think lags quite a bit behind as far as how long they've been around actually developing."
    },
    {
      "Time_Start": 31.0,
      "Time_End": 39.0,
      "Text": " For those of you that don't know, in talking about information exchange and availability, back in 1992 when the hacking community was in full swing for a long time,"
    },
    {
      "Time_Start": 39.0,
      "Time_End": 46.0,
      "Text": " the virus writing community was just kind of getting started with a little fight on our bulletin board systems and virus writer networks."
    },
    {
      "Time_Start": 46.0,
      "Time_End": 54.0,
      "Text": " But people were doing a really good job of learning new things, but the availability of information just wasn't so widespread as it was in the hacking community,"
    },
    {
      "Time_Start": 54.0,
      "Time_End": 58.0,
      "Text": " because the virus writers weren't yet for the most part on the Internet, although some are starting to be."
    },
    {
      "Time_Start": 58.0,
      "Time_End": 65.0,
      "Text": " We've got people here representing a wide range of positions, and I'm going to read a little bit of what other people have said about these positions"
    },
    {
      "Time_Start": 65.0,
      "Time_End": 68.0,
      "Text": " before asking each panelist to answer some questions."
    },
    {
      "Time_Start": 68.0,
      "Time_End": 74.0,
      "Text": " I know what I'm going to let you do is ask questions of all these people, and then maybe we'll ask questions of you."
    },
    {
      "Time_Start": 74.0,
      "Time_End": 80.0,
      "Text": " The goal is kind of to get a perspective of what everybody thinks about the issues and look at the different perspectives"
    },
    {
      "Time_Start": 80.0,
      "Time_End": 84.0,
      "Text": " and get away from a lot of the stereotypes that we have in these kinds of discussions."
    },
    {
      "Time_Start": 84.0,
      "Time_End": 87.0,
      "Text": " So with that, I'll introduce the first person."
    },
    {
      "Time_Start": 87.0,
      "Time_End": 94.0,
      "Text": " I've got an email message that I'm using with permission from a former editor of a magazine dealing with viruses."
    },
    {
      "Time_Start": 94.0,
      "Time_End": 97.0,
      "Text": " Now, wait a minute. This is wrong. This is the second guy."
    },
    {
      "Time_Start": 97.0,
      "Time_End": 101.0,
      "Text": " Here's the first guy. We all know that only scum releases viruses on the Internet."
    },
    {
      "Time_Start": 101.0,
      "Time_End": 104.0,
      "Text": " Only scum would write a virus and put it out there infecting people."
    },
    {
      "Time_Start": 104.0,
      "Time_End": 108.0,
      "Text": " So with that, I'll introduce my scummy guest here, the attitude adjuster."
    },
    {
      "Time_Start": 108.0,
      "Time_End": 111.0,
      "Text": " Could you all clap for him? He's a good guy."
    },
    {
      "Time_Start": 111.0,
      "Time_End": 115.0,
      "Text": " Thank you. Thank you."
    },
    {
      "Time_Start": 115.0,
      "Time_End": 121.0,
      "Text": " He's going to be taking a position that people need to have their attitudes adjusted, and he's just the guy to do it."
    },
    {
      "Time_Start": 121.0,
      "Time_End": 129.0,
      "Text": " My next guest here is representing the point sort of that the bug track and anti-bug track people generally seem to take."
    },
    {
      "Time_Start": 129.0,
      "Time_End": 133.0,
      "Text": " I don't know how close it will be because they're not actually here to represent themselves."
    },
    {
      "Time_Start": 133.0,
      "Time_End": 135.0,
      "Text": " Has anybody seen Alaphon?"
    },
    {
      "Time_Start": 135.0,
      "Time_End": 139.0,
      "Text": " No. He said he would be here, but I guess he couldn't make it."
    },
    {
      "Time_Start": 139.0,
      "Time_End": 140.0,
      "Text": " He's still sleeping."
    },
    {
      "Time_Start": 140.0,
      "Time_End": 142.0,
      "Text": " Maybe he's still sleeping."
    },
    {
      "Time_Start": 142.0,
      "Time_End": 150.0,
      "Text": " Well, what we've said about this particular position is that we know what happens when people of inferior ethics or inferior integrity"
    },
    {
      "Time_Start": 150.0,
      "Time_End": 153.0,
      "Text": " are allowed to moderate mailing lists."
    },
    {
      "Time_Start": 153.0,
      "Time_End": 161.0,
      "Text": " These bug track and anti-bug track guys are no better than cyber terrorists who will stop at nothing to accomplish their goals."
    },
    {
      "Time_Start": 161.0,
      "Time_End": 166.0,
      "Text": " Now, before you all go, I didn't say this. This was said by somebody else, not me."
    },
    {
      "Time_Start": 166.0,
      "Time_End": 172.0,
      "Text": " But this fellow, Richard, is here to represent the position of the bug track and anti-bug track moderators,"
    },
    {
      "Time_Start": 172.0,
      "Time_End": 175.0,
      "Text": " which he's somewhat familiar with, having read lots of emails that they've sent,"
    },
    {
      "Time_Start": 176.0,
      "Time_End": 182.0,
      "Text": " working with us in a project to start having communications between the antivirus community and the general security community."
    },
    {
      "Time_Start": 182.0,
      "Time_End": 185.0,
      "Text": " The next position that will be represented..."
    },
    {
      "Time_Start": 185.0,
      "Time_End": 186.0,
      "Text": " Thank you."
    },
    {
      "Time_Start": 186.0,
      "Time_End": 190.0,
      "Text": " Oh yeah, clap for him too. He's really sweet."
    },
    {
      "Time_Start": 190.0,
      "Time_End": 193.0,
      "Text": " The next position here is..."
    },
    {
      "Time_Start": 193.0,
      "Time_End": 200.0,
      "Text": " What's been said about this position is that these close-minded antivirus product developers want to keep all of the cool information for themselves."
    },
    {
      "Time_Start": 200.0,
      "Time_End": 206.0,
      "Text": " They do not want the world, the community, the users at large to get information about viruses."
    },
    {
      "Time_Start": 206.0,
      "Time_End": 210.0,
      "Text": " They want to control the information. Only they can save you."
    },
    {
      "Time_Start": 210.0,
      "Time_End": 219.0,
      "Text": " And here representing the antivirus community is my colleague, Toral, who works for NAI, but is here representing himself."
    },
    {
      "Time_Start": 219.0,
      "Time_End": 223.0,
      "Text": " He is not here representing his company, and what he will present is his own opinion"
    },
    {
      "Time_Start": 223.0,
      "Time_End": 228.0,
      "Text": " and should not be construed for that of any organization of any type, blah, blah, blah, you know the deal."
    },
    {
      "Time_Start": 228.0,
      "Time_End": 230.0,
      "Text": " This is Toral."
    },
    {
      "Time_Start": 234.0,
      "Time_End": 241.0,
      "Text": " And finally, we have the position on the end, which was said that these guys all should be in jail."
    },
    {
      "Time_Start": 241.0,
      "Time_End": 245.0,
      "Text": " This sort of thing is illegal and immoral, and anybody who does it should be put in jail."
    },
    {
      "Time_Start": 245.0,
      "Time_End": 252.0,
      "Text": " We should make a martyr out of some of these virus writers and distributors, and then see how far they'll go to protect this kind of precious information."
    },
    {
      "Time_Start": 253.0,
      "Time_End": 260.0,
      "Text": " So representing the position that all the virus writers who have ever written a virus or even thought about writing a virus should be put in jail,"
    },
    {
      "Time_Start": 260.0,
      "Time_End": 265.0,
      "Text": " stopped from replicating, disconnected from all communicators and computers, is John."
    },
    {
      "Time_Start": 265.0,
      "Time_End": 268.0,
      "Text": " Let's hear it for John. Come on, John."
    },
    {
      "Time_Start": 270.0,
      "Time_End": 276.0,
      "Text": " Again, this may or may not be his real position, and they can disclose or not exactly what their real positions are."
    },
    {
      "Time_Start": 276.0,
      "Time_End": 281.0,
      "Text": " And if you haven't noticed, I don't have a real position. I just like to hear what everybody says and just think about it."
    },
    {
      "Time_Start": 281.0,
      "Time_End": 287.0,
      "Text": " And so if any of you have questions about any of this afterwards and don't get a chance to ask questions, please come talk to me."
    },
    {
      "Time_Start": 287.0,
      "Time_End": 291.0,
      "Text": " We're writing a paper on this topic of the two colliding worlds for virus bulletin conference."
    },
    {
      "Time_Start": 291.0,
      "Time_End": 295.0,
      "Text": " It will be in Vancouver, so I'm really interested to discuss with anybody."
    },
    {
      "Time_Start": 295.0,
      "Time_End": 303.0,
      "Text": " So the first question, oh yeah, viruses are irresponsible, unethical, damaging, should be illegal no matter what."
    },
    {
      "Time_Start": 303.0,
      "Time_End": 310.0,
      "Text": " We should give law enforcement some real teeth to arrest these guys and put them in jail, because they don't belong on the face of this earth."
    },
    {
      "Time_Start": 311.0,
      "Time_End": 319.0,
      "Text": " With that in mind, I'd like to ask, what do you think about the public availability of viruses and virus source code on BBSs and FTP sites?"
    },
    {
      "Time_Start": 319.0,
      "Time_End": 323.0,
      "Text": " And I'd like to ask that each panelist will have two minutes to answer that question."
    },
    {
      "Time_Start": 323.0,
      "Time_End": 326.0,
      "Text": " I'm going to start with my friend, Mr. Adjuster."
    },
    {
      "Time_Start": 328.0,
      "Time_End": 329.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 329.0,
      "Time_End": 330.0,
      "Text": " Can I take this out of here?"
    },
    {
      "Time_Start": 330.0,
      "Time_End": 332.0,
      "Text": " Yeah, all right."
    },
    {
      "Time_Start": 332.0,
      "Time_End": 336.0,
      "Text": " Availability of viruses on public websites and FTP sites."
    },
    {
      "Time_Start": 336.0,
      "Time_End": 344.0,
      "Text": " Well, first of all, I really don't care if they give the law enforcement more teeth to put us in jail or lock us up and throw away the key."
    },
    {
      "Time_Start": 344.0,
      "Time_End": 355.0,
      "Text": " The fundamental act of expression I see in virus programming is something that, sure, they can make a law against it, but nobody's going to stop."
    },
    {
      "Time_Start": 355.0,
      "Time_End": 360.0,
      "Text": " The people that they're going to stop are not the people that are the problem."
    },
    {
      "Time_Start": 360.0,
      "Time_End": 366.0,
      "Text": " As far as the public availability, there's nothing out there that's publicly available that's really anything to be all that afraid of."
    },
    {
      "Time_Start": 366.0,
      "Time_End": 375.0,
      "Text": " The stuff that is out there to be afraid of is to be afraid of for a week until the NAI guys, whoever, get their hands on it, and, ooh, they update their signatures, they can scan for it."
    },
    {
      "Time_Start": 375.0,
      "Time_End": 376.0,
      "Text": " It's not NAI."
    },
    {
      "Time_Start": 379.0,
      "Time_End": 382.0,
      "Text": " Well, he'll get your time."
    },
    {
      "Time_Start": 382.0,
      "Time_End": 383.0,
      "Text": " Yeah, yeah."
    },
    {
      "Time_Start": 384.0,
      "Time_End": 390.0,
      "Text": " The range of ultra-high effectiveness in time is not necessarily very long."
    },
    {
      "Time_Start": 390.0,
      "Time_End": 394.0,
      "Text": " The AV guys get their hands on it, and your great new technique is useless."
    },
    {
      "Time_Start": 394.0,
      "Time_End": 399.0,
      "Text": " Regardless, though, the availability really doesn't bother me."
    },
    {
      "Time_Start": 399.0,
      "Time_End": 401.0,
      "Text": " I'd rather see the information out there."
    },
    {
      "Time_Start": 401.0,
      "Time_End": 408.0,
      "Text": " I'd rather see the guy that, hey, wants to learn a little bit more about viruses and how they work to get his hands on them."
    },
    {
      "Time_Start": 408.0,
      "Time_End": 411.0,
      "Text": " At the same time, I want the researchers to be able to get their hands on them, too."
    },
    {
      "Time_Start": 411.0,
      "Time_End": 413.0,
      "Text": " I don't mind everybody seeing the techniques."
    },
    {
      "Time_Start": 416.0,
      "Time_End": 420.0,
      "Text": " I don't think wanton destruction is necessarily all that bad."
    },
    {
      "Time_Start": 423.0,
      "Time_End": 430.0,
      "Text": " And if the publicly available sites cause some people to do some wanton destruction, well, whoever got their data destroyed too bad."
    },
    {
      "Time_Start": 430.0,
      "Time_End": 432.0,
      "Text": " They didn't take good precautions."
    },
    {
      "Time_Start": 432.0,
      "Time_End": 434.0,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 434.0,
      "Time_End": 435.0,
      "Text": " That was your two minutes."
    },
    {
      "Time_Start": 435.0,
      "Time_End": 436.0,
      "Text": " Oh, damn."
    },
    {
      "Time_Start": 436.0,
      "Time_End": 449.0,
      "Text": " Now, we'll go on to the next representation."
    },
    {
      "Time_Start": 449.0,
      "Time_End": 453.0,
      "Text": " I don't know if you want to represent a moderate of nailing this position here or the wrong position."
    },
    {
      "Time_Start": 453.0,
      "Time_End": 456.0,
      "Text": " So could you please kind of state what position you're taking here?"
    },
    {
      "Time_Start": 456.0,
      "Time_End": 465.0,
      "Text": " Well, I think it's pretty close to my genuine position, which is that the availability of viruses is kind of a good thing and kind of a bad thing, which is very kind of lukewarm."
    },
    {
      "Time_Start": 465.0,
      "Time_End": 470.0,
      "Text": " I think the main thing with having these vast virus collections online is that they are such a waste of bandwidth."
    },
    {
      "Time_Start": 470.0,
      "Time_End": 478.0,
      "Text": " Every virus is pretty much a one-off of find first, find next, file open, append, close, you're done, find the next."
    },
    {
      "Time_Start": 478.0,
      "Time_End": 481.0,
      "Text": " There are actually very few viruses out there which seem to do anything new."
    },
    {
      "Time_Start": 481.0,
      "Time_End": 486.0,
      "Text": " The viruses which I did think had some good points about being online were Melissa."
    },
    {
      "Time_Start": 486.0,
      "Time_End": 488.0,
      "Text": " That was kind of interesting to see what was going on."
    },
    {
      "Time_Start": 489.0,
      "Time_End": 493.0,
      "Text": " Concept, the first XL virus, which has temporarily slipped my mind."
    },
    {
      "Time_Start": 493.0,
      "Time_End": 494.0,
      "Text": " Leru."
    },
    {
      "Time_Start": 494.0,
      "Time_End": 495.0,
      "Text": " Leru."
    },
    {
      "Time_Start": 495.0,
      "Time_End": 502.0,
      "Text": " Those things, because they were new, there was some interest in actually getting a hold of them and having people being able to take a look at them."
    },
    {
      "Time_Start": 502.0,
      "Time_End": 509.0,
      "Text": " In particular for Melissa, for example, rather than wait around for any antivirus vendor to fix the problem for us, we simply went in and patched the mail server."
    },
    {
      "Time_Start": 509.0,
      "Time_End": 516.0,
      "Text": " And suddenly Melissa wasn't really such a big deal, certainly not in my organization."
    },
    {
      "Time_Start": 516.0,
      "Time_End": 518.0,
      "Text": " So I think there's a middle ground."
    },
    {
      "Time_Start": 518.0,
      "Time_End": 520.0,
      "Text": " It's just the sheer boredom factor."
    },
    {
      "Time_Start": 520.0,
      "Time_End": 524.0,
      "Text": " I don't see why any of you would want to go out and download another 10,000 viruses."
    },
    {
      "Time_Start": 524.0,
      "Time_End": 526.0,
      "Text": " I don't take two minutes, but that's really all I've got to say."
    },
    {
      "Time_Start": 526.0,
      "Time_End": 527.0,
      "Text": " It's boring."
    },
    {
      "Time_Start": 527.0,
      "Time_End": 529.0,
      "Text": " Okay, thank you."
    },
    {
      "Time_Start": 529.0,
      "Time_End": 532.0,
      "Text": " And now our antivirus expert."
    },
    {
      "Time_Start": 532.0,
      "Time_End": 541.0,
      "Text": " Could you please comment on the public availability of virus source code and virus executables on bulletin boards, FTP sites, and websites?"
    },
    {
      "Time_Start": 542.0,
      "Time_End": 548.0,
      "Text": " Yes, you could guess I'm against the public availability of virus and virus source codes for several reasons."
    },
    {
      "Time_Start": 548.0,
      "Time_End": 558.0,
      "Text": " The main reason is I still have to find, well, say a good virus, say a virus that doesn't destroy anything involuntarily."
    },
    {
      "Time_Start": 558.0,
      "Time_End": 569.0,
      "Text": " And by making those viruses publicly available, those people who are, well, irresponsible, say kids, say people who try to damage someone,"
    },
    {
      "Time_Start": 569.0,
      "Time_End": 574.0,
      "Text": " are able to pull off a virus and play some tricks to their teacher, and maybe this gets out of bound."
    },
    {
      "Time_Start": 574.0,
      "Time_End": 582.0,
      "Text": " Remember, a virus, when once unleashed, and if it works, most don't really work, it replicates uncontrollably."
    },
    {
      "Time_Start": 582.0,
      "Time_End": 593.0,
      "Text": " And if a virus is online, put online or being distributed, well, it takes us only, well, a quarter of an hour to add detection and removal,"
    },
    {
      "Time_Start": 593.0,
      "Time_End": 599.0,
      "Text": " and until finally the definition updates are distributed within the company."
    },
    {
      "Time_Start": 599.0,
      "Time_End": 605.0,
      "Text": " This could take up to one month because of company internal procedures of quality assurance."
    },
    {
      "Time_Start": 605.0,
      "Time_End": 614.0,
      "Text": " So by putting them online, you're threatening the larger companies until they have the real protection in place."
    },
    {
      "Time_Start": 614.0,
      "Time_End": 619.0,
      "Text": " For a couple of viruses, like, for example, Melissa, it was possible to patch a mail server,"
    },
    {
      "Time_Start": 619.0,
      "Time_End": 624.0,
      "Text": " but it is easily, it would be fairly easy to have a virus where this is not possible,"
    },
    {
      "Time_Start": 624.0,
      "Time_End": 629.0,
      "Text": " and then releasing it or its full source code would be pretty irresponsible."
    },
    {
      "Time_Start": 629.0,
      "Time_End": 634.0,
      "Text": " Thank you very much. He's an AV guy, but you should clap for him, too."
    },
    {
      "Time_Start": 634.0,
      "Time_End": 638.0,
      "Text": " Thank you. Thank you."
    },
    {
      "Time_Start": 638.0,
      "Time_End": 646.0,
      "Text": " And finally, fourth panelist, I understand that you believe anybody who even thinks about writing a virus should be put in jail for the rest of their lives."
    },
    {
      "Time_Start": 646.0,
      "Time_End": 648.0,
      "Text": " Starting with Fred."
    },
    {
      "Time_Start": 648.0,
      "Time_End": 654.0,
      "Text": " So if you could please present your rationale and state whether or not this is really what, or irrational as that may be,"
    },
    {
      "Time_Start": 654.0,
      "Time_End": 659.0,
      "Text": " and state whether or not this is your real position or whether you're taking this position because you've heard people take it"
    },
    {
      "Time_Start": 659.0,
      "Time_End": 665.0,
      "Text": " and you want to make sure people understand what's going on out there in conversations about disclosure and availability of information."
    },
    {
      "Time_Start": 665.0,
      "Time_End": 667.0,
      "Text": " This is not my real position."
    },
    {
      "Time_Start": 667.0,
      "Time_End": 675.0,
      "Text": " However, I can argue it because I can argue either end of the spectrum, and there are valid reasons for all of it."
    },
    {
      "Time_Start": 675.0,
      "Time_End": 681.0,
      "Text": " For example, here, as Richard said, his company was able to take online information and help themselves."
    },
    {
      "Time_Start": 681.0,
      "Time_End": 687.0,
      "Text": " At the same time, the Internet has become a vital part of our everyday life, business and personal."
    },
    {
      "Time_Start": 687.0,
      "Time_End": 691.0,
      "Text": " I won't say it's as important as the telephone, but it's damn close."
    },
    {
      "Time_Start": 692.0,
      "Time_End": 697.0,
      "Text": " Viruses, all sorts of malicious code, undermine the reliability of the Internet,"
    },
    {
      "Time_Start": 697.0,
      "Time_End": 703.0,
      "Text": " and we are rapidly reaching a point whereby none of us will be able to connect to it if we have anything to lose."
    },
    {
      "Time_Start": 703.0,
      "Time_End": 711.0,
      "Text": " People who abuse the Internet, who do things that harm others, must be stopped."
    },
    {
      "Time_Start": 711.0,
      "Time_End": 716.0,
      "Text": " Otherwise, the Internet, within a year or two, will not be usable by any of us."
    },
    {
      "Time_Start": 716.0,
      "Time_End": 721.0,
      "Text": " The only way to do this is to keep them from doing it."
    },
    {
      "Time_Start": 721.0,
      "Time_End": 727.0,
      "Text": " You pass laws. If you find someone who does it, if you can get the laws to apply,"
    },
    {
      "Time_Start": 727.0,
      "Time_End": 733.0,
      "Text": " which is a totally different problem with international laws, you must make examples of these people."
    },
    {
      "Time_Start": 733.0,
      "Time_End": 736.0,
      "Text": " Everyone you catch, punish them severely."
    },
    {
      "Time_Start": 736.0,
      "Time_End": 743.0,
      "Text": " I'd say put them in jail, but I've got to qualify that by saying there can't be an Internet hookup in the cell."
    },
    {
      "Time_Start": 743.0,
      "Time_End": 747.0,
      "Text": " We can't let these people continue. They must be stopped."
    },
    {
      "Time_Start": 747.0,
      "Time_End": 749.0,
      "Text": " Thank you very much, John."
    },
    {
      "Time_Start": 753.0,
      "Time_End": 758.0,
      "Text": " I bet you guys never thought you'd be here clapping for somebody who's saying these people must be stopped, huh?"
    },
    {
      "Time_Start": 763.0,
      "Time_End": 770.0,
      "Text": " Okay, so the next thing we're going to look at is the posting of virus source code to mailing lists like BugTrack and NtBugTrack."
    },
    {
      "Time_Start": 770.0,
      "Time_End": 775.0,
      "Text": " I've been having some conversations with Alphron and Enos Cooper about this,"
    },
    {
      "Time_Start": 775.0,
      "Time_End": 780.0,
      "Text": " and I think that neither of the positions are really written in stone as far as what's the right thing to do,"
    },
    {
      "Time_Start": 780.0,
      "Time_End": 783.0,
      "Text": " what really benefits the users, what people really need."
    },
    {
      "Time_Start": 783.0,
      "Time_End": 786.0,
      "Text": " I have email from some members of the antivirus community."
    },
    {
      "Time_Start": 786.0,
      "Time_End": 790.0,
      "Text": " Hey, you're here! Come on out! Alphron made it!"
    },
    {
      "Time_Start": 790.0,
      "Time_End": 801.0,
      "Text": " You know what I'm going to do? I'm actually going to go back to the last question, because you weren't here to answer it."
    },
    {
      "Time_Start": 801.0,
      "Time_End": 806.0,
      "Text": " No, we want to know what you think about this, because it all kind of ties in."
    },
    {
      "Time_Start": 806.0,
      "Time_End": 813.0,
      "Text": " We were discussing the public availability of viruses and virus source code, not to mailing lists like you, moderator and minister,"
    },
    {
      "Time_Start": 813.0,
      "Time_End": 818.0,
      "Text": " but to virus bulletin boards, FTP sites, worldwide websites,"
    },
    {
      "Time_Start": 818.0,
      "Time_End": 825.0,
      "Text": " could you give us about two minutes of your impressions of the public availability of viruses on websites, FTP sites?"
    },
    {
      "Time_Start": 825.0,
      "Time_End": 832.0,
      "Text": " My impression, that it's always going to happen, regardless of our opinion,"
    },
    {
      "Time_Start": 832.0,
      "Time_End": 839.0,
      "Text": " so trying to say it's right or wrong is definitely not going to change anything that's done."
    },
    {
      "Time_Start": 839.0,
      "Time_End": 844.0,
      "Text": " So you might as well accept that fact and prepare for it."
    },
    {
      "Time_Start": 845.0,
      "Time_End": 848.0,
      "Text": " So you might as well accept that fact and just deal with it."
    },
    {
      "Time_Start": 848.0,
      "Time_End": 852.0,
      "Text": " It's going to be there, it's going to happen, people are going to write about it, it's going to publish it,"
    },
    {
      "Time_Start": 852.0,
      "Time_End": 856.0,
      "Text": " they're going to trade in, so that's pretty much it."
    },
    {
      "Time_Start": 856.0,
      "Time_End": 858.0,
      "Text": " Okay, that's pretty short and to the point."
    },
    {
      "Time_Start": 858.0,
      "Time_End": 860.0,
      "Text": " The next question, and you came just in time for it,"
    },
    {
      "Time_Start": 860.0,
      "Time_End": 867.0,
      "Text": " is what do you think about the posting of computer viruses to the mailing list like BugTrack and into BugTrack?"
    },
    {
      "Time_Start": 867.0,
      "Time_End": 870.0,
      "Text": " And we'll again have about two minutes."
    },
    {
      "Time_Start": 870.0,
      "Time_End": 875.0,
      "Text": " I've gotten some email from some antivirus developers who tell me that the supposed security experts"
    },
    {
      "Time_Start": 875.0,
      "Time_End": 880.0,
      "Text": " do not have a clue about how the virus writers think or work or how to do this stuff"
    },
    {
      "Time_Start": 880.0,
      "Time_End": 882.0,
      "Text": " and they should leave it to us, the experts."
    },
    {
      "Time_Start": 882.0,
      "Time_End": 886.0,
      "Text": " They shouldn't post this, they should never allow this kind of posting to happen."
    },
    {
      "Time_Start": 886.0,
      "Time_End": 889.0,
      "Text": " On the other hand, I have email from system administrators"
    },
    {
      "Time_Start": 889.0,
      "Time_End": 892.0,
      "Text": " that tell me these sorts of posts are essential for them to do their job,"
    },
    {
      "Time_Start": 892.0,
      "Time_End": 895.0,
      "Text": " they really need this information, they want this information,"
    },
    {
      "Time_Start": 895.0,
      "Time_End": 897.0,
      "Text": " and by God, they're going to have this information."
    },
    {
      "Time_Start": 898.0,
      "Time_End": 903.0,
      "Text": " So if we could just take about two minutes each, and I think we'll start down here this time"
    },
    {
      "Time_Start": 903.0,
      "Time_End": 911.0,
      "Text": " with your impression of the posting of virus source code to moderated mailing lists like BugTrack and into BugTrack."
    },
    {
      "Time_Start": 911.0,
      "Time_End": 915.0,
      "Text": " I'm sorry, do I have to jail all of them on this one, or can I just talk in general?"
    },
    {
      "Time_Start": 915.0,
      "Time_End": 918.0,
      "Text": " No, you have to be whoever you want to be."
    },
    {
      "Time_Start": 918.0,
      "Time_End": 919.0,
      "Text": " Oh, I have to imprison them?"
    },
    {
      "Time_Start": 919.0,
      "Time_End": 920.0,
      "Text": " No."
    },
    {
      "Time_Start": 920.0,
      "Time_End": 921.0,
      "Text": " Okay, all right."
    },
    {
      "Time_Start": 921.0,
      "Time_End": 923.0,
      "Text": " Put them in jail, that's all right."
    },
    {
      "Time_Start": 923.0,
      "Time_End": 933.0,
      "Text": " Just as a lot of system administrators may voluntarily and reasonably look to these moderated lists for sources of information,"
    },
    {
      "Time_Start": 933.0,
      "Time_End": 942.0,
      "Text": " many, many, many other types, script kiddies on down, look to them for information."
    },
    {
      "Time_Start": 942.0,
      "Time_End": 949.0,
      "Text": " By posting actual source code, you're not only making this information readily available,"
    },
    {
      "Time_Start": 949.0,
      "Time_End": 955.0,
      "Text": " but since the list is supposed to be a good guy list, you're actually endorsing it."
    },
    {
      "Time_Start": 955.0,
      "Time_End": 962.0,
      "Text": " This is, next to distributing it as a free diskette in PC mag is about the worst thing you could do,"
    },
    {
      "Time_Start": 962.0,
      "Time_End": 965.0,
      "Text": " and again, it must be stopped at all costs."
    },
    {
      "Time_Start": 965.0,
      "Time_End": 966.0,
      "Text": " Thank you."
    },
    {
      "Time_Start": 966.0,
      "Time_End": 970.0,
      "Text": " Could we have the impression of the antivirus developer?"
    },
    {
      "Time_Start": 970.0,
      "Time_End": 977.0,
      "Text": " Could you comment on the comments I made of people who think that this information should be kept just for the antivirus community?"
    },
    {
      "Time_Start": 977.0,
      "Time_End": 982.0,
      "Text": " Yeah, well, the main point is here, virus source code has got nothing to do in those mailing lists."
    },
    {
      "Time_Start": 982.0,
      "Time_End": 986.0,
      "Text": " They don't really hit the issue."
    },
    {
      "Time_Start": 986.0,
      "Time_End": 992.0,
      "Text": " Viruses are not bugs in an operating system to be exploited and to be fixed."
    },
    {
      "Time_Start": 992.0,
      "Time_End": 1000.0,
      "Text": " Viruses use features of operating systems or of programs, so there is nothing to fix by those lists."
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1010.0,
      "Text": " As an administrator, if you would have to look at each of 500 viruses a month, trying to fix down the system for yourself,"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1013.0,
      "Text": " you would end up doing nothing else."
    },
    {
      "Time_Start": 1020.0,
      "Time_End": 1025.0,
      "Text": " One of the most important things about publishing a source code, especially in such lists,"
    },
    {
      "Time_Start": 1026.0,
      "Time_End": 1031.0,
      "Text": " if you then use the source code to play around with, to compile it,"
    },
    {
      "Time_Start": 1031.0,
      "Time_End": 1035.0,
      "Text": " then you probably create a new variant of this virus."
    },
    {
      "Time_Start": 1035.0,
      "Time_End": 1041.0,
      "Text": " Because of the way antivirus software works, each slight modification adds in a new variant"
    },
    {
      "Time_Start": 1041.0,
      "Time_End": 1046.0,
      "Text": " that may prevent the antivirus software from fixing that problem immediately."
    },
    {
      "Time_Start": 1046.0,
      "Time_End": 1054.0,
      "Text": " So, it is more or less dangerous to be alert, especially in such lists with all the script reading this,"
    },
    {
      "Time_Start": 1054.0,
      "Time_End": 1059.0,
      "Text": " get those information leaked out, as it doesn't really help anyone."
    },
    {
      "Time_Start": 1059.0,
      "Time_End": 1063.0,
      "Text": " If you want to help anyone, then the information, for example for Melissa,"
    },
    {
      "Time_Start": 1063.0,
      "Time_End": 1068.0,
      "Text": " would be enough to filter for a certain X line in the message shadow."
    },
    {
      "Time_Start": 1068.0,
      "Time_End": 1071.0,
      "Text": " Very interesting, thank you."
    },
    {
      "Time_Start": 1071.0,
      "Time_End": 1079.0,
      "Text": " Now, since our friend is here, you can go ahead and play the role of the moderator of mailing lists."
    },
    {
      "Time_Start": 1079.0,
      "Time_End": 1082.0,
      "Text": " Tell me what you think, and tell the audience here what you think,"
    },
    {
      "Time_Start": 1082.0,
      "Time_End": 1086.0,
      "Text": " about the publication of the source code on the moderated mailing list."
    },
    {
      "Time_Start": 1086.0,
      "Time_End": 1089.0,
      "Text": " Does it help you as an administrator to do your job?"
    },
    {
      "Time_Start": 1089.0,
      "Time_End": 1093.0,
      "Text": " Do you think it's useful, or do you think it causes more harm than good?"
    },
    {
      "Time_Start": 1093.0,
      "Time_End": 1097.0,
      "Text": " I actually think that the publication of code on mailing lists has a place,"
    },
    {
      "Time_Start": 1097.0,
      "Time_End": 1100.0,
      "Text": " but a very limited place when it comes to viruses."
    },
    {
      "Time_Start": 1100.0,
      "Time_End": 1104.0,
      "Text": " For example, the publication of, and again we'll come back to Melissa because it's new,"
    },
    {
      "Time_Start": 1104.0,
      "Time_End": 1108.0,
      "Text": " was kind of useful because it was all over the place, and it was in the wild,"
    },
    {
      "Time_Start": 1108.0,
      "Time_End": 1111.0,
      "Text": " and if you wanted a copy of Melissa, well, you know, you probably just check your mail at one point,"
    },
    {
      "Time_Start": 1111.0,
      "Time_End": 1113.0,
      "Text": " and it worked pretty well."
    },
    {
      "Time_Start": 1113.0,
      "Time_End": 1116.0,
      "Text": " So when it's new, and it's got something new to say,"
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1119.0,
      "Text": " I actually don't have much of a problem with these things appearing on the list."
    },
    {
      "Time_Start": 1119.0,
      "Time_End": 1124.0,
      "Text": " The times that I do have a problem are when it's new, it's not spreading in the wild,"
    },
    {
      "Time_Start": 1124.0,
      "Time_End": 1128.0,
      "Text": " so nobody's actually getting this, and it's just like at that point, it's just a way of getting it out there."
    },
    {
      "Time_Start": 1128.0,
      "Time_End": 1131.0,
      "Text": " So I think it comes down to responsible disclosure,"
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1137.0,
      "Text": " and I think that's really the way that those lists are at their best."
    },
    {
      "Time_Start": 1137.0,
      "Time_End": 1141.0,
      "Text": " When something's causing a real problem, we can actually get the information out there,"
    },
    {
      "Time_Start": 1141.0,
      "Time_End": 1144.0,
      "Text": " but when something is kind of existing only in code form,"
    },
    {
      "Time_Start": 1144.0,
      "Time_End": 1147.0,
      "Text": " widebanding it out there is just going to make life worse."
    },
    {
      "Time_Start": 1147.0,
      "Time_End": 1150.0,
      "Text": " Viruses work because people trust computer programs."
    },
    {
      "Time_Start": 1150.0,
      "Time_End": 1153.0,
      "Text": " They don't generally work because they're some super secret trickery."
    },
    {
      "Time_Start": 1153.0,
      "Time_End": 1157.0,
      "Text": " It's really, you know, if you don't download this thing and run it, you're probably in pretty good shape."
    },
    {
      "Time_Start": 1157.0,
      "Time_End": 1159.0,
      "Text": " There is no new exploit in viruses."
    },
    {
      "Time_Start": 1159.0,
      "Time_End": 1162.0,
      "Text": " It's the same old, same old, time and time again."
    },
    {
      "Time_Start": 1162.0,
      "Time_End": 1165.0,
      "Text": " That said, when there's some new interesting factor,"
    },
    {
      "Time_Start": 1165.0,
      "Time_End": 1168.0,
      "Text": " then at that point, yes, I don't have any problem with those things going out,"
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1173.0,
      "Text": " but I hate to see BugTrack cut it up with, you know, my thousand UPS MPC viruses,"
    },
    {
      "Time_Start": 1173.0,
      "Time_End": 1176.0,
      "Text": " which I made today all on my own with my mom watching."
    },
    {
      "Time_Start": 1176.0,
      "Time_End": 1178.0,
      "Text": " That I wouldn't want to see."
    },
    {
      "Time_Start": 1178.0,
      "Time_End": 1180.0,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 1180.0,
      "Time_End": 1184.0,
      "Text": " Your position on the publication of virus source code on BugTrack, please."
    },
    {
      "Time_Start": 1184.0,
      "Time_End": 1186.0,
      "Text": " Sure. Let's see."
    },
    {
      "Time_Start": 1186.0,
      "Time_End": 1190.0,
      "Text": " We have an opinion that publishing viruses gives code to hackers."
    },
    {
      "Time_Start": 1190.0,
      "Time_End": 1196.0,
      "Text": " Well, I guess the posting of exploits and vulnerabilities is the same, so how is that any different?"
    },
    {
      "Time_Start": 1196.0,
      "Time_End": 1199.0,
      "Text": " Do not stick your head in the sand."
    },
    {
      "Time_Start": 1199.0,
      "Time_End": 1202.0,
      "Text": " It does not help, and it does not work."
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1206.0,
      "Text": " Then we have admins do not have the time to examine viruses."
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1209.0,
      "Text": " Well, how come they have the time to examine security exploits and vulnerabilities?"
    },
    {
      "Time_Start": 1209.0,
      "Time_End": 1211.0,
      "Text": " It's only they have the time."
    },
    {
      "Time_Start": 1211.0,
      "Time_End": 1213.0,
      "Text": " Some of them do. It's part of their job."
    },
    {
      "Time_Start": 1213.0,
      "Time_End": 1217.0,
      "Text": " Obviously, you can make the point that that's the security vendor's job,"
    },
    {
      "Time_Start": 1218.0,
      "Time_End": 1222.0,
      "Text": " to examine viruses and publish security scanners and IDSs,"
    },
    {
      "Time_Start": 1222.0,
      "Time_End": 1225.0,
      "Text": " but there's many admins that rather do that themselves,"
    },
    {
      "Time_Start": 1225.0,
      "Time_End": 1228.0,
      "Text": " or at least do it to the point where they have enough knowledge"
    },
    {
      "Time_Start": 1228.0,
      "Time_End": 1233.0,
      "Text": " to make sure the stuff that the vendors are selling them are not snake oil."
    },
    {
      "Time_Start": 1233.0,
      "Time_End": 1235.0,
      "Text": " And so I agree."
    },
    {
      "Time_Start": 1235.0,
      "Time_End": 1241.0,
      "Text": " I mean, publishing every day, you know, every single virus is not going to help at all."
    },
    {
      "Time_Start": 1241.0,
      "Time_End": 1246.0,
      "Text": " The idea that you mentioned, that viruses exploit the same hole, is completely correct most of the time."
    },
    {
      "Time_Start": 1246.0,
      "Time_End": 1249.0,
      "Text": " As a matter of fact, I mentioned this to Sarah over a private email,"
    },
    {
      "Time_Start": 1249.0,
      "Time_End": 1254.0,
      "Text": " and the difference between the virus community and the, as you call them, security experts,"
    },
    {
      "Time_Start": 1254.0,
      "Time_End": 1256.0,
      "Text": " which, from my point of view, they're all the same,"
    },
    {
      "Time_Start": 1256.0,
      "Time_End": 1261.0,
      "Text": " is that when an expert gets published on BotTrack, most of the time it gets fixed from the vendor."
    },
    {
      "Time_Start": 1261.0,
      "Time_End": 1262.0,
      "Text": " You receive a patch."
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1265.0,
      "Text": " Whereas with the antivirus vendors, you have never seen a patch."
    },
    {
      "Time_Start": 1265.0,
      "Time_End": 1272.0,
      "Text": " You spend so many years, you know, releasing scanners for viruses that exploit the same hole already,"
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1275.0,
      "Text": " and yet Microsoft or whomever does not fix the problem,"
    },
    {
      "Time_Start": 1275.0,
      "Time_End": 1283.0,
      "Text": " that you come to expect no solution whatsoever."
    },
    {
      "Time_Start": 1283.0,
      "Time_End": 1285.0,
      "Text": " I'd like to know, do you have a response to that?"
    },
    {
      "Time_Start": 1285.0,
      "Time_End": 1288.0,
      "Text": " Yes, I think we have a response to that over here."
    },
    {
      "Time_Start": 1288.0,
      "Time_End": 1294.0,
      "Text": " So before we go on down here to Mr. Adjuster, when you're torn off here, please."
    },
    {
      "Time_Start": 1294.0,
      "Time_End": 1298.0,
      "Text": " To respond directly on this, I mentioned before there's a major difference"
    },
    {
      "Time_Start": 1298.0,
      "Time_End": 1302.0,
      "Text": " between an exploit being posted on a list like BotTrack,"
    },
    {
      "Time_Start": 1302.0,
      "Time_End": 1309.0,
      "Text": " because an administrator could use, actually, this exploit to then really check if the vendor has fixed it or not."
    },
    {
      "Time_Start": 1309.0,
      "Time_End": 1313.0,
      "Text": " And exploits exploit vulnerabilities."
    },
    {
      "Time_Start": 1313.0,
      "Time_End": 1315.0,
      "Text": " Buffer overflow is done a lot in programs."
    },
    {
      "Time_Start": 1315.0,
      "Time_End": 1318.0,
      "Text": " Viruses don't exploit anything."
    },
    {
      "Time_Start": 1318.0,
      "Time_End": 1325.0,
      "Text": " They use bloody feature of the operating system or of the application they are running with."
    },
    {
      "Time_Start": 1325.0,
      "Time_End": 1327.0,
      "Text": " There is nothing to fix from that side."
    },
    {
      "Time_Start": 1327.0,
      "Time_End": 1331.0,
      "Text": " The only way to fix that would be to use another software."
    },
    {
      "Time_Start": 1331.0,
      "Time_End": 1332.0,
      "Text": " Yes, please."
    },
    {
      "Time_Start": 1332.0,
      "Time_End": 1334.0,
      "Text": " Okay, let's conduct a small poll here."
    },
    {
      "Time_Start": 1334.0,
      "Time_End": 1337.0,
      "Text": " How many of you use Microsoft Word and Excel?"
    },
    {
      "Time_Start": 1337.0,
      "Time_End": 1338.0,
      "Text": " I do."
    },
    {
      "Time_Start": 1338.0,
      "Time_End": 1339.0,
      "Text": " All right."
    },
    {
      "Time_Start": 1339.0,
      "Time_End": 1344.0,
      "Text": " How many of you use that application Macros and Microsoft Excel?"
    },
    {
      "Time_Start": 1344.0,
      "Time_End": 1345.0,
      "Text": " A couple."
    },
    {
      "Time_Start": 1345.0,
      "Time_End": 1350.0,
      "Text": " How many of you have used the feature to create a file from Visual Basic Macros?"
    },
    {
      "Time_Start": 1350.0,
      "Time_End": 1355.0,
      "Text": " So how many people do actually need that feature returned on by default all the time?"
    },
    {
      "Time_Start": 1355.0,
      "Time_End": 1360.0,
      "Text": " Can we produce a patch for Microsoft Visual Basic where that is turned off by default"
    },
    {
      "Time_Start": 1360.0,
      "Time_End": 1363.0,
      "Text": " and only unless you change your registry key, that feature is enabled?"
    },
    {
      "Time_Start": 1363.0,
      "Time_End": 1364.0,
      "Text": " It could."
    },
    {
      "Time_Start": 1364.0,
      "Time_End": 1366.0,
      "Text": " If you haven't, that's because you don't expect it."
    },
    {
      "Time_Start": 1366.0,
      "Time_End": 1376.0,
      "Text": " Yes, and finally, attitude to gesture."
    },
    {
      "Time_Start": 1376.0,
      "Time_End": 1381.0,
      "Text": " If we could hear your opinion on the publication of virus source codes to the moderated mailing list,"
    },
    {
      "Time_Start": 1381.0,
      "Time_End": 1382.0,
      "Text": " what do you think about that?"
    },
    {
      "Time_Start": 1382.0,
      "Time_End": 1383.0,
      "Text": " Sure."
    },
    {
      "Time_Start": 1383.0,
      "Time_End": 1385.0,
      "Text": " First of all, to the moderators of the mailing list,"
    },
    {
      "Time_Start": 1385.0,
      "Time_End": 1392.0,
      "Text": " I've got to feel sorry for the possible bullshit civil and criminal prosecution that could come to doing that"
    },
    {
      "Time_Start": 1392.0,
      "Time_End": 1398.0,
      "Text": " because I fully support the publication of virus source code on full disclosure mailing lists."
    },
    {
      "Time_Start": 1398.0,
      "Time_End": 1403.0,
      "Text": " I want to point out that I think every virus, not every,"
    },
    {
      "Time_Start": 1403.0,
      "Time_End": 1407.0,
      "Text": " but most viruses do exploit one kind of operating system flaw,"
    },
    {
      "Time_Start": 1407.0,
      "Time_End": 1412.0,
      "Text": " and that is a combination of user trust and user stupidity."
    },
    {
      "Time_Start": 1413.0,
      "Time_End": 1416.0,
      "Text": " Which are essentially the same thing."
    },
    {
      "Time_Start": 1416.0,
      "Time_End": 1421.0,
      "Text": " Some viruses actually do exploit real holes in operating systems, though,"
    },
    {
      "Time_Start": 1421.0,
      "Time_End": 1427.0,
      "Text": " and not to say those holes couldn't be exploited in and of themselves by an individual to penetrate a host or whatever,"
    },
    {
      "Time_Start": 1427.0,
      "Time_End": 1435.0,
      "Text": " but if a virus is using a penetration technique, it's just as valid if that virus is using an exploit as if it's just a stand-alone exploit,"
    },
    {
      "Time_Start": 1435.0,
      "Time_End": 1439.0,
      "Text": " and I can see the utility in posting that just for that utility."
    },
    {
      "Time_Start": 1440.0,
      "Time_End": 1448.0,
      "Text": " I take kind of the opposite view of my colleague besides you, the AV position, on the same thing."
    },
    {
      "Time_Start": 1448.0,
      "Time_End": 1457.0,
      "Text": " I don't mind viruses that maybe have novel or hard-to-defeat techniques being posted to full disclosure mailing lists"
    },
    {
      "Time_Start": 1457.0,
      "Time_End": 1459.0,
      "Text": " just because that causes them to replicate more,"
    },
    {
      "Time_Start": 1459.0,
      "Time_End": 1463.0,
      "Text": " and hey, if they're harder to fix, it's going to be a longer time between the day that virus is released"
    },
    {
      "Time_Start": 1463.0,
      "Time_End": 1467.0,
      "Text": " and the day that virus is no longer a threat to the users out there in the field."
    },
    {
      "Time_Start": 1468.0,
      "Time_End": 1471.0,
      "Text": " Helping to erode the user's trust in the computer."
    },
    {
      "Time_Start": 1471.0,
      "Time_End": 1476.0,
      "Text": " I think a lot of institutions are using computers for things that they really shouldn't be using them for"
    },
    {
      "Time_Start": 1476.0,
      "Time_End": 1480.0,
      "Text": " when they don't know how they work, what they're capable of."
    },
    {
      "Time_Start": 1480.0,
      "Time_End": 1483.0,
      "Text": " Wow, we put our data in this thing and now the data's gone."
    },
    {
      "Time_Start": 1483.0,
      "Time_End": 1485.0,
      "Text": " Whose fault is that but your own?"
    },
    {
      "Time_Start": 1485.0,
      "Time_End": 1487.0,
      "Text": " Hey, it's T!"
    },
    {
      "Time_Start": 1487.0,
      "Time_End": 1488.0,
      "Text": " Oh, right."
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1489.0,
      "Text": " Hey, Mr. T!"
    },
    {
      "Time_Start": 1489.0,
      "Time_End": 1490.0,
      "Text": " Thanks, Benji."
    },
    {
      "Time_Start": 1490.0,
      "Time_End": 1491.0,
      "Text": " You're welcome."
    },
    {
      "Time_Start": 1491.0,
      "Time_End": 1493.0,
      "Text": " I think Mr. T and I have our hands on this all."
    },
    {
      "Time_Start": 1493.0,
      "Time_End": 1494.0,
      "Text": " Yeah, T?"
    },
    {
      "Time_Start": 1494.0,
      "Time_End": 1495.0,
      "Text": " No."
    },
    {
      "Time_Start": 1496.0,
      "Time_End": 1498.0,
      "Text": " I don't really have a lot more to throw at it."
    },
    {
      "Time_Start": 1498.0,
      "Time_End": 1503.0,
      "Text": " Those mailing list moderators have, when they publish that source code in their list,"
    },
    {
      "Time_Start": 1503.0,
      "Time_End": 1510.0,
      "Text": " have some big brass balls to some extent because I really wouldn't want a torrent of lawyers jumping on me or anything like that."
    },
    {
      "Time_Start": 1510.0,
      "Time_End": 1512.0,
      "Text": " That's vile."
    },
    {
      "Time_Start": 1512.0,
      "Time_End": 1514.0,
      "Text": " They should put all the lawyers in jail."
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1526.0,
      "Text": " I guess this does bring up the point that lately there's been a lot of attention as far as viruses and virus writers"
    },
    {
      "Time_Start": 1526.0,
      "Time_End": 1534.0,
      "Text": " with arrests and servers being seized and a lot of attention from various authorities looking into the whole virus writing subculture."
    },
    {
      "Time_Start": 1534.0,
      "Time_End": 1540.0,
      "Text": " And with that in mind, I'd like to first ask the audience a question and ask the panelists."
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1544.0,
      "Text": " How many people that are here think that just writing viruses is a cool thing to do?"
    },
    {
      "Time_Start": 1544.0,
      "Time_End": 1546.0,
      "Text": " Do you think that's just a neat and cool thing to do?"
    },
    {
      "Time_Start": 1551.0,
      "Time_End": 1554.0,
      "Text": " Do you think it's a cool thing to do to keep Microsoft in check, would you say?"
    },
    {
      "Time_Start": 1554.0,
      "Time_End": 1556.0,
      "Text": " Keep stupidity in check."
    },
    {
      "Time_Start": 1557.0,
      "Time_End": 1561.0,
      "Text": " Can I ask a question to the guy who thinks it's keeping Microsoft in check?"
    },
    {
      "Time_Start": 1561.0,
      "Time_End": 1562.0,
      "Text": " Do you think it's working?"
    },
    {
      "Time_Start": 1562.0,
      "Time_End": 1563.0,
      "Text": " No."
    },
    {
      "Time_Start": 1563.0,
      "Time_End": 1569.0,
      "Text": " Well, I think there were two different questions, though."
    },
    {
      "Time_Start": 1569.0,
      "Time_End": 1571.0,
      "Text": " She asked about writing viruses, not distributing them."
    },
    {
      "Time_Start": 1571.0,
      "Time_End": 1573.0,
      "Text": " Yes, about writing viruses."
    },
    {
      "Time_Start": 1573.0,
      "Time_End": 1578.0,
      "Text": " About just writing viruses in general, that it's a cool thing to do and it's really interesting and you're really learning a lot from it."
    },
    {
      "Time_Start": 1578.0,
      "Time_End": 1581.0,
      "Text": " I'm just curious, who thinks that?"
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1584.0,
      "Text": " Not very many people."
    },
    {
      "Time_Start": 1584.0,
      "Time_End": 1585.0,
      "Text": " A few people do."
    },
    {
      "Time_Start": 1585.0,
      "Time_End": 1589.0,
      "Text": " I'd like to ask the panel for their impressions on just writing viruses in general."
    },
    {
      "Time_Start": 1590.0,
      "Time_End": 1593.0,
      "Text": " I'm interested in this because I talk with a lot of people that write viruses."
    },
    {
      "Time_Start": 1593.0,
      "Time_End": 1594.0,
      "Text": " It's an interesting topic."
    },
    {
      "Time_Start": 1594.0,
      "Time_End": 1598.0,
      "Text": " Everybody, I mean, we have these press people here and I want to know who writes viruses and how to do it."
    },
    {
      "Time_Start": 1598.0,
      "Time_End": 1602.0,
      "Text": " So, if the people on the panel could just kind of say, what do you think about writing viruses?"
    },
    {
      "Time_Start": 1602.0,
      "Time_End": 1604.0,
      "Text": " Do you think it's a cool thing to do?"
    },
    {
      "Time_Start": 1604.0,
      "Time_End": 1608.0,
      "Text": " And also, what do you think about just putting them up there and letting them go?"
    },
    {
      "Time_Start": 1608.0,
      "Time_End": 1609.0,
      "Text": " Start on this end?"
    },
    {
      "Time_Start": 1609.0,
      "Time_End": 1612.0,
      "Text": " Yes, start on this end with Mr. Attitude Adjuster."
    },
    {
      "Time_Start": 1612.0,
      "Time_End": 1617.0,
      "Text": " Well, it's not going to sound like the position I should be on necessarily."
    },
    {
      "Time_Start": 1617.0,
      "Time_End": 1620.0,
      "Text": " But this is some of me coming through and not the position."
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1622.0,
      "Text": " Yeah, I think viruses are pretty cool."
    },
    {
      "Time_Start": 1622.0,
      "Time_End": 1624.0,
      "Text": " And I think writing viruses is pretty cool."
    },
    {
      "Time_Start": 1624.0,
      "Time_End": 1633.0,
      "Text": " And I think sitting around with PSNPC and chugging out new, quote, viruses or being a micro-virus puppy is garbage he could say is not cool."
    },
    {
      "Time_Start": 1633.0,
      "Time_End": 1635.0,
      "Text": " I think it's just a pain in the ass."
    },
    {
      "Time_Start": 1636.0,
      "Time_End": 1642.0,
      "Text": " I think that you do not learn all about programming computers and computer science from writing viruses."
    },
    {
      "Time_Start": 1642.0,
      "Time_End": 1644.0,
      "Text": " That's a bunch of bullshit."
    },
    {
      "Time_Start": 1644.0,
      "Time_End": 1647.0,
      "Text": " You learn about how to write viruses when you write viruses."
    },
    {
      "Time_Start": 1647.0,
      "Time_End": 1651.0,
      "Text": " You can take viruses to do so many other things though."
    },
    {
      "Time_Start": 1651.0,
      "Time_End": 1654.0,
      "Text": " And I know somebody out there yelled out, what's an agent?"
    },
    {
      "Time_Start": 1654.0,
      "Time_End": 1659.0,
      "Text": " An intelligent agent and a virus are not all that different in my opinion."
    },
    {
      "Time_Start": 1659.0,
      "Time_End": 1664.0,
      "Text": " And making intelligent viruses that do intelligent things is where it gets really cool."
    },
    {
      "Time_Start": 1664.0,
      "Time_End": 1668.0,
      "Text": " A virus that calls home to mom and upgrades its own payload."
    },
    {
      "Time_Start": 1668.0,
      "Time_End": 1673.0,
      "Text": " Or viruses that are slowly penetrating a network and coming back up through the firewall or stuff like that."
    },
    {
      "Time_Start": 1673.0,
      "Time_End": 1678.0,
      "Text": " Taking viruses to do more than just the act of a virus, which is not that complicated."
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1680.0,
      "Text": " Like in code, self-replicating code."
    },
    {
      "Time_Start": 1680.0,
      "Time_End": 1682.0,
      "Text": " Yes, but make it do something cool."
    },
    {
      "Time_Start": 1682.0,
      "Time_End": 1684.0,
      "Text": " And I think that's a real problem."
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1687.0,
      "Text": " There's not enough viruses doing stuff cool."
    },
    {
      "Time_Start": 1687.0,
      "Time_End": 1689.0,
      "Text": " As far as just writing them, yeah, I don't mind."
    },
    {
      "Time_Start": 1689.0,
      "Time_End": 1690.0,
      "Text": " Go ahead and write them."
    },
    {
      "Time_Start": 1691.0,
      "Time_End": 1692.0,
      "Text": " I have a question for you."
    },
    {
      "Time_Start": 1692.0,
      "Time_End": 1693.0,
      "Text": " Sure."
    },
    {
      "Time_Start": 1693.0,
      "Time_End": 1695.0,
      "Text": " The programs can do things that are really cool."
    },
    {
      "Time_Start": 1695.0,
      "Time_End": 1698.0,
      "Text": " So if you're going to write programs that do things really cool, why put the replication in?"
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1699.0,
      "Text": " What's the point?"
    },
    {
      "Time_Start": 1699.0,
      "Time_End": 1702.0,
      "Text": " I think the replication is kind of the hook."
    },
    {
      "Time_Start": 1702.0,
      "Time_End": 1708.0,
      "Text": " That's really what takes it from just doing, oh, this is neat, to, oh wow, it's cool."
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1709.0,
      "Text": " It's spreading over this land."
    },
    {
      "Time_Start": 1709.0,
      "Time_End": 1711.0,
      "Text": " It's eating every piece of it."
    },
    {
      "Time_Start": 1711.0,
      "Time_End": 1713.0,
      "Text": " It's getting a lot of attention to our group."
    },
    {
      "Time_Start": 1713.0,
      "Time_End": 1715.0,
      "Text": " It's getting the feds to take it for steroids."
    },
    {
      "Time_Start": 1715.0,
      "Time_End": 1717.0,
      "Text": " It's getting all these things that may not harm them."
    },
    {
      "Time_Start": 1717.0,
      "Time_End": 1719.0,
      "Text": " The virus downloaded Salt Lake."
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1722.0,
      "Text": " Yeah, yeah, there you go."
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1728.0,
      "Text": " Gee, why is my dial-up connection going so slow?"
    },
    {
      "Time_Start": 1728.0,
      "Time_End": 1731.0,
      "Text": " Why did my hard drive repartition itself?"
    },
    {
      "Time_Start": 1731.0,
      "Time_End": 1735.0,
      "Text": " The one thing that I do need to qualify, and this is me coming out,"
    },
    {
      "Time_Start": 1735.0,
      "Time_End": 1739.0,
      "Text": " I really do think that computer viruses can cross the threshold of life."
    },
    {
      "Time_Start": 1739.0,
      "Time_End": 1742.0,
      "Text": " I really think, especially with macro viruses,"
    },
    {
      "Time_Start": 1742.0,
      "Time_End": 1747.0,
      "Text": " just because the machine language, assembly language viruses are so brittle."
    },
    {
      "Time_Start": 1747.0,
      "Time_End": 1750.0,
      "Text": " You change one bit, they're broken, they're dead."
    },
    {
      "Time_Start": 1750.0,
      "Time_End": 1754.0,
      "Text": " But we're going to see these macro and high-level viruses running into each other,"
    },
    {
      "Time_Start": 1754.0,
      "Time_End": 1757.0,
      "Text": " combining, making new amalgamated life forms."
    },
    {
      "Time_Start": 1757.0,
      "Time_End": 1760.0,
      "Text": " And the problem's open-ended."
    },
    {
      "Time_Start": 1760.0,
      "Time_End": 1762.0,
      "Text": " It's going to be really interesting to see what happens."
    },
    {
      "Time_Start": 1762.0,
      "Time_End": 1765.0,
      "Text": " Yeah, I have just a couple of minutes here before something else scheduled"
    },
    {
      "Time_Start": 1765.0,
      "Time_End": 1767.0,
      "Text": " that everybody's looking forward to."
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1769.0,
      "Text": " So I'm going to just take a couple of questions."
    },
    {
      "Time_Start": 1769.0,
      "Time_End": 1771.0,
      "Text": " I think we've heard from our virus writer."
    },
    {
      "Time_Start": 1771.0,
      "Time_End": 1774.0,
      "Text": " I'll take a question from this guy over here in the yellow circle on his shirt."
    },
    {
      "Time_Start": 1774.0,
      "Time_End": 1775.0,
      "Text": " Was he a threat?"
    },
    {
      "Time_Start": 1775.0,
      "Time_End": 1776.0,
      "Text": " Are you a threat?"
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1777.0,
      "Text": " Are you a threat?"
    },
    {
      "Time_Start": 1777.0,
      "Time_End": 1778.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 1778.0,
      "Time_End": 1781.0,
      "Text": " Why does the conservative side of the antivirus industry"
    },
    {
      "Time_Start": 1781.0,
      "Time_End": 1787.0,
      "Text": " and the security industry persist in confusing prosecution with prevention?"
    },
    {
      "Time_Start": 1787.0,
      "Time_End": 1791.0,
      "Text": " Why does the conservative side of the antivirus and security industry"
    },
    {
      "Time_Start": 1791.0,
      "Time_End": 1794.0,
      "Text": " insist on confusing prosecution with?"
    },
    {
      "Time_Start": 1794.0,
      "Time_End": 1795.0,
      "Text": " Prevention."
    },
    {
      "Time_Start": 1795.0,
      "Time_End": 1796.0,
      "Text": " With prevention."
    },
    {
      "Time_Start": 1796.0,
      "Time_End": 1798.0,
      "Text": " John, do you want to take that one?"
    },
    {
      "Time_Start": 1800.0,
      "Time_End": 1801.0,
      "Text": " Basically, it's..."
    },
    {
      "Time_Start": 1801.0,
      "Time_End": 1802.0,
      "Text": " Thirty seconds."
    },
    {
      "Time_Start": 1802.0,
      "Time_End": 1804.0,
      "Text": " First off, it's the only tool they have."
    },
    {
      "Time_Start": 1804.0,
      "Time_End": 1806.0,
      "Text": " Second off, they're not the ones doing it."
    },
    {
      "Time_Start": 1806.0,
      "Time_End": 1808.0,
      "Text": " They want it stopped."
    },
    {
      "Time_Start": 1808.0,
      "Time_End": 1809.0,
      "Text": " They go to their lawyers."
    },
    {
      "Time_Start": 1809.0,
      "Time_End": 1811.0,
      "Text": " Their lawyers go to the authorities."
    },
    {
      "Time_Start": 1811.0,
      "Time_End": 1813.0,
      "Text": " That's what the authorities have to do."
    },
    {
      "Time_Start": 1813.0,
      "Time_End": 1814.0,
      "Text": " Next question."
    },
    {
      "Time_Start": 1816.0,
      "Time_End": 1817.0,
      "Text": " Sunglasses."
    },
    {
      "Time_Start": 1817.0,
      "Time_End": 1821.0,
      "Text": " I wanted to ask a question that kind of goes back to it, though."
    },
    {
      "Time_Start": 1821.0,
      "Time_End": 1824.0,
      "Text": " If somebody's going to be doing it one way or the other,"
    },
    {
      "Time_Start": 1824.0,
      "Time_End": 1826.0,
      "Text": " and if you try to just suppress all of it,"
    },
    {
      "Time_Start": 1826.0,
      "Time_End": 1829.0,
      "Text": " then you make a lot of people really, really stupid."
    },
    {
      "Time_Start": 1829.0,
      "Time_End": 1832.0,
      "Text": " It's a very easy target for the ones who aren't going to get caught"
    },
    {
      "Time_Start": 1832.0,
      "Time_End": 1833.0,
      "Text": " and aren't going to do that stuff."
    },
    {
      "Time_Start": 1833.0,
      "Time_End": 1834.0,
      "Text": " Then you've got a bunch of sheep."
    },
    {
      "Time_Start": 1834.0,
      "Time_End": 1836.0,
      "Text": " Do you want to make all of them sheep?"
    },
    {
      "Time_Start": 1840.0,
      "Time_End": 1842.0,
      "Text": " We like sheep up here."
    },
    {
      "Time_Start": 1842.0,
      "Time_End": 1845.0,
      "Text": " Do you want to answer that question?"
    },
    {
      "Time_Start": 1845.0,
      "Time_End": 1846.0,
      "Text": " I just think, I just want to say,"
    },
    {
      "Time_Start": 1846.0,
      "Time_End": 1848.0,
      "Text": " I think the nature of a lot of the public using computers today"
    },
    {
      "Time_Start": 1848.0,
      "Time_End": 1850.0,
      "Text": " is they want to be sheep,"
    },
    {
      "Time_Start": 1850.0,
      "Time_End": 1853.0,
      "Text": " and that maybe the industry isn't forcing them that way,"
    },
    {
      "Time_Start": 1853.0,
      "Time_End": 1855.0,
      "Text": " but gosh, it's so easy to be a sheep."
    },
    {
      "Time_Start": 1856.0,
      "Time_End": 1859.0,
      "Text": " Also, another point is with Melissa, for example,"
    },
    {
      "Time_Start": 1859.0,
      "Time_End": 1861.0,
      "Text": " it was so widely distributed over the news"
    },
    {
      "Time_Start": 1861.0,
      "Time_End": 1864.0,
      "Text": " that it actually helped to educate people on viruses."
    },
    {
      "Time_Start": 1864.0,
      "Time_End": 1866.0,
      "Text": " So the wide distribution of that information"
    },
    {
      "Time_Start": 1866.0,
      "Time_End": 1868.0,
      "Text": " in the end ended up helping people,"
    },
    {
      "Time_Start": 1868.0,
      "Time_End": 1871.0,
      "Text": " even though it wasn't really damaging,"
    },
    {
      "Time_Start": 1871.0,
      "Time_End": 1873.0,
      "Text": " but it got so distributed."
    },
    {
      "Time_Start": 1873.0,
      "Time_End": 1875.0,
      "Text": " I found your logic a little bit strange, actually."
    },
    {
      "Time_Start": 1875.0,
      "Time_End": 1877.0,
      "Text": " I'd like to make an analogy."
    },
    {
      "Time_Start": 1877.0,
      "Time_End": 1879.0,
      "Text": " Given that we cannot catch all murderers,"
    },
    {
      "Time_Start": 1879.0,
      "Time_End": 1881.0,
      "Text": " does that mean we shouldn't try and suppress murder,"
    },
    {
      "Time_Start": 1881.0,
      "Time_End": 1884.0,
      "Text": " because we're just giving a hard time to the guys who are stupid"
    },
    {
      "Time_Start": 1884.0,
      "Time_End": 1886.0,
      "Text": " and get murdered?"
    },
    {
      "Time_Start": 1887.0,
      "Time_End": 1889.0,
      "Text": " Well, for the sheep factor,"
    },
    {
      "Time_Start": 1889.0,
      "Time_End": 1891.0,
      "Text": " to come with a virus,"
    },
    {
      "Time_Start": 1891.0,
      "Time_End": 1893.0,
      "Text": " you don't need to know how a virus is written."
    },
    {
      "Time_Start": 1893.0,
      "Time_End": 1895.0,
      "Text": " Those are entirely different things,"
    },
    {
      "Time_Start": 1895.0,
      "Time_End": 1897.0,
      "Text": " writing a virus and defeating it."
    },
    {
      "Time_Start": 1897.0,
      "Time_End": 1900.0,
      "Text": " It's like building a house and knocking it down."
    },
    {
      "Time_Start": 1901.0,
      "Time_End": 1903.0,
      "Text": " We're going to stop now."
    },
    {
      "Time_Start": 1903.0,
      "Time_End": 1905.0,
      "Text": " If anybody has questions for any of us,"
    },
    {
      "Time_Start": 1905.0,
      "Time_End": 1907.0,
      "Text": " we'll be around this next demonstration,"
    },
    {
      "Time_Start": 1907.0,
      "Time_End": 1909.0,
      "Text": " and we'll be happy to answer questions."
    },
    {
      "Time_Start": 1909.0,
      "Time_End": 1911.0,
      "Text": " Sorry I couldn't get to all of you."
    },
    {
      "Time_Start": 1911.0,
      "Time_End": 1913.0,
      "Text": " Thank you very much for coming. Bye."
    },
    {
      "Time_Start": 1917.0,
      "Time_End": 1919.0,
      "Text": " Actually, ladies and gentlemen,"
    },
    {
      "Time_Start": 1919.0,
      "Time_End": 1921.0,
      "Text": " ladies and gentlemen, if I can get your attention,"
    },
    {
      "Time_Start": 1921.0,
      "Time_End": 1923.0,
      "Text": " if these guys could be kind enough,"
    },
    {
      "Time_Start": 1923.0,
      "Time_End": 1925.0,
      "Text": " maybe they'll be in the main convention hall"
    },
    {
      "Time_Start": 1925.0,
      "Time_End": 1927.0,
      "Text": " or outside by the pool to answer questions for you."
    },
    {
      "Time_Start": 1927.0,
      "Time_End": 1929.0,
      "Text": " We've actually got to ask all of you,"
    },
    {
      "Time_Start": 1929.0,
      "Time_End": 1931.0,
      "Text": " and I know this is going to suck,"
    },
    {
      "Time_Start": 1931.0,
      "Time_End": 1933.0,
      "Text": " that you have to buy a beer and not come on."
    },
    {
      "Time_Start": 1933.0,
      "Time_End": 1935.0,
      "Text": " And filter out, please."
    },
    {
      "Time_Start": 1935.0,
      "Time_End": 1937.0,
      "Text": " We actually need to clear the auditorium"
    },
    {
      "Time_Start": 1937.0,
      "Time_End": 1940.0,
      "Text": " for about 15 minutes for the CDC presentation."
    },
    {
      "Time_Start": 1946.0,
      "Time_End": 1948.0,
      "Text": " Thank you."
    }
  ]
}