{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 13.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I'm also here with my colleague, Bill Riley. He's also with Dwayne Morrison Heckscher."
    },
    {
      "Time_Start": 13.0,
      "Time_End": 20.0,
      "Text": " He has a sophisticated technology and computer background. He founded the first online secure"
    },
    {
      "Time_Start": 20.0,
      "Time_End": 26.0,
      "Text": " website in Denmark in a prior life, and here we go. By the way, if you want to have any"
    },
    {
      "Time_Start": 26.0,
      "Time_End": 31.0,
      "Text": " further detailed information on us or some of our work, we recently published a law review"
    },
    {
      "Time_Start": 31.0,
      "Time_End": 38.0,
      "Text": " article on cybercrime legal issues. You can find that at my website, synrodlaw.com."
    },
    {
      "Time_Start": 38.0,
      "Time_End": 46.0,
      "Text": " That's S-I-N-R-O-D-L-A-W.com. The article is there, along with the weekly cyber law column"
    },
    {
      "Time_Start": 46.0,
      "Time_End": 51.0,
      "Text": " that I write, as well as other information. Today we're going to provide you with an overview"
    },
    {
      "Time_Start": 51.0,
      "Time_End": 57.0,
      "Text": " of the Computer Fraud and Abuse Act. That is the primary statute in this country that"
    },
    {
      "Time_Start": 57.0,
      "Time_End": 64.0,
      "Text": " deals with computer criminal issues. We've also brought along 200 handouts, which obviously"
    },
    {
      "Time_Start": 64.0,
      "Time_End": 68.0,
      "Text": " are not enough. They're the blue handouts that give you the most relevant portions of"
    },
    {
      "Time_Start": 68.0,
      "Time_End": 73.0,
      "Text": " the statute. By the way, you can find out more information about this statute at the"
    },
    {
      "Time_Start": 73.0,
      "Time_End": 80.0,
      "Text": " website I gave you a moment ago. This statute was enacted in 1986. Computer crime was"
    },
    {
      "Time_Start": 80.0,
      "Time_End": 87.0,
      "Text": " perceived as a growing issue in the mid-1980s, and Congress essentially had a choice. Congress"
    },
    {
      "Time_Start": 87.0,
      "Time_End": 93.0,
      "Text": " either could have attempted to update traditional criminal laws, such as burglary, while"
    },
    {
      "Time_Start": 93.0,
      "Time_End": 99.0,
      "Text": " engrafting onto them computer crime provisions, or it could write an entirely new statute,"
    },
    {
      "Time_Start": 99.0,
      "Time_End": 105.0,
      "Text": " which it decided to do, as I mentioned in 1986. This turned out to be a wise choice,"
    },
    {
      "Time_Start": 105.0,
      "Time_End": 112.0,
      "Text": " at least in the view of Congress and lawyers, because the statute flexibly can be amended"
    },
    {
      "Time_Start": 112.0,
      "Time_End": 118.0,
      "Text": " over time, and frankly has been amended several times since 1986, for example, relating to"
    },
    {
      "Time_Start": 118.0,
      "Time_End": 125.0,
      "Text": " issues of criminal intent and the like. The statute was most recently amended in 1996,"
    },
    {
      "Time_Start": 125.0,
      "Time_End": 131.0,
      "Text": " and there are some further proposed amendments currently pending in Congress that Bill will"
    },
    {
      "Time_Start": 131.0,
      "Time_End": 138.0,
      "Text": " be speaking with you about shortly. There are seven major features of the statute in"
    },
    {
      "Time_Start": 138.0,
      "Time_End": 144.0,
      "Text": " terms of creating potential criminal liability, and I'll go through these in a little more"
    },
    {
      "Time_Start": 144.0,
      "Time_End": 148.0,
      "Text": " detail in a moment, but let me just tick them off for you, and these are also contained"
    },
    {
      "Time_Start": 148.0,
      "Time_End": 153.0,
      "Text": " in the handouts, which some of you have. The first potential item of criminal activity"
    },
    {
      "Time_Start": 153.0,
      "Time_End": 160.0,
      "Text": " has to do with espionage. The next is improperly obtaining information. Next is improper"
    },
    {
      "Time_Start": 161.0,
      "Time_End": 168.0,
      "Text": " access to government computers. That's a biggie. Next has to do with fraud. The next one is"
    },
    {
      "Time_Start": 168.0,
      "Time_End": 174.0,
      "Text": " transmission of a program, information, code, or a command which causes damage, and we'll"
    },
    {
      "Time_Start": 174.0,
      "Time_End": 178.0,
      "Text": " be talking about the definition of damage, because that's important as to whether or"
    },
    {
      "Time_Start": 178.0,
      "Time_End": 183.0,
      "Text": " not you've actually committed a crime. When I say you, I use that term loosely and generically."
    },
    {
      "Time_Start": 183.0,
      "Time_End": 189.0,
      "Text": " I'm not looking at anybody in particular out here. And then we also have extortion."
    },
    {
      "Time_Start": 189.0,
      "Time_End": 195.0,
      "Text": " The statute also creates potential civil liability. If someone is guilty of a statutory violation,"
    },
    {
      "Time_Start": 195.0,
      "Time_End": 200.0,
      "Text": " they also can be sued for that conduct in court, and they can be hit with economic damages"
    },
    {
      "Time_Start": 200.0,
      "Time_End": 209.0,
      "Text": " and requests for injunctive relief. As a side note, at times it is perceived that some perpetrators"
    },
    {
      "Time_Start": 209.0,
      "Time_End": 215.0,
      "Text": " of cybercrime don't have deep pockets. They don't have financial resources. So what do"
    },
    {
      "Time_Start": 215.0,
      "Time_End": 221.0,
      "Text": " victims do in terms of getting recompense? For example, in the context of distributed"
    },
    {
      "Time_Start": 221.0,
      "Time_End": 229.0,
      "Text": " denial of service attacks, some of the attacks were perpetrated through zombie sites, and"
    },
    {
      "Time_Start": 229.0,
      "Time_End": 235.0,
      "Text": " now that there's been quite a bit of publicity regarding the massive DDOS attacks in February,"
    },
    {
      "Time_Start": 235.0,
      "Time_End": 241.0,
      "Text": " an argument could be made against a zombie site for not having taken reasonable protective"
    },
    {
      "Time_Start": 241.0,
      "Time_End": 247.0,
      "Text": " measures to protect its systems. And the extent an attack travels through a zombie site, that"
    },
    {
      "Time_Start": 247.0,
      "Time_End": 253.0,
      "Text": " zombie site might be on the receiving end of a civil lawsuit under the theory of negligence."
    },
    {
      "Time_Start": 253.0,
      "Time_End": 260.0,
      "Text": " I also want to mention that there are now being written special Internet-related insurance"
    },
    {
      "Time_Start": 260.0,
      "Time_End": 266.0,
      "Text": " policies. Traditional insurance policies generally cover losses to tangible physical"
    },
    {
      "Time_Start": 266.0,
      "Time_End": 272.0,
      "Text": " property. That's not normally the case when you have losses of data in cyberspace, and"
    },
    {
      "Time_Start": 272.0,
      "Time_End": 278.0,
      "Text": " these new policies are being written to cover cybercrimes and other issues on the Internet."
    },
    {
      "Time_Start": 278.0,
      "Time_End": 285.0,
      "Text": " Interestingly, a federal judge in Arizona recently held that pure data loss can be covered"
    },
    {
      "Time_Start": 285.0,
      "Time_End": 289.0,
      "Text": " under traditional insurance policies because the Computer Fraud and Abuse Act, which I'm"
    },
    {
      "Time_Start": 289.0,
      "Time_End": 295.0,
      "Text": " talking about today, equates data loss with damage to property, and that was an interesting"
    },
    {
      "Time_Start": 295.0,
      "Time_End": 300.0,
      "Text": " decision because it was an insurance case that followed a criminal statute as opposed"
    },
    {
      "Time_Start": 300.0,
      "Time_End": 308.0,
      "Text": " to an insurance coverage precedent. It's not entirely clear yet how or whether Congress"
    },
    {
      "Time_Start": 308.0,
      "Time_End": 314.0,
      "Text": " wanted the statute to apply to commercial enterprises, and I'll just point out one quick"
    },
    {
      "Time_Start": 314.0,
      "Time_End": 322.0,
      "Text": " example. Real Jukebox was just sued in a class action lawsuit. The allegation is that"
    },
    {
      "Time_Start": 322.0,
      "Time_End": 329.0,
      "Text": " the Real Jukebox software, which plays music on a computer, snooped on the plaintiffs once"
    },
    {
      "Time_Start": 329.0,
      "Time_End": 334.0,
      "Text": " they installed the software on their computers. The allegation is that each time someone ran"
    },
    {
      "Time_Start": 334.0,
      "Time_End": 340.0,
      "Text": " the Real Jukebox software program, information allegedly was sent surreptitiously to Real"
    },
    {
      "Time_Start": 340.0,
      "Time_End": 346.0,
      "Text": " Network's computers. Such information allegedly included, one, the type of computer format"
    },
    {
      "Time_Start": 346.0,
      "Time_End": 353.0,
      "Text": " the music is stored in, two, the quality level of the recordings, three, the class member's"
    },
    {
      "Time_Start": 353.0,
      "Time_End": 359.0,
      "Text": " musical preferences, and four, the type of portable music player, if any, the class member"
    },
    {
      "Time_Start": 359.0,
      "Time_End": 365.0,
      "Text": " has connected to the computer. The plaintiffs are claiming that Real Network's violated"
    },
    {
      "Time_Start": 365.0,
      "Time_End": 369.0,
      "Text": " a certain section of the statute, and I'll be going through this in a moment, by taking"
    },
    {
      "Time_Start": 369.0,
      "Time_End": 376.0,
      "Text": " information from their computers that exceeded Real Network's proper authorization. We will"
    },
    {
      "Time_Start": 376.0,
      "Time_End": 381.0,
      "Text": " see how this one plays out. Pardon the pun. So let's get down to the real meat of the"
    },
    {
      "Time_Start": 381.0,
      "Time_End": 388.0,
      "Text": " statute, and you can see this in the handout, but the first provision is section A1, having"
    },
    {
      "Time_Start": 388.0,
      "Time_End": 394.0,
      "Text": " to do with espionage. And this part of the statute is triggered if someone knowingly"
    },
    {
      "Time_Start": 394.0,
      "Time_End": 400.0,
      "Text": " accesses a computer and obtains information that the United States government has deemed"
    },
    {
      "Time_Start": 400.0,
      "Time_End": 405.0,
      "Text": " highly sensitive, such as information relating to national defense and foreign relations"
    },
    {
      "Time_Start": 405.0,
      "Time_End": 411.0,
      "Text": " issues, and then willfully communicates that information to somebody else who does not"
    },
    {
      "Time_Start": 411.0,
      "Time_End": 416.0,
      "Text": " have authorization to have that information, or willfully fails to give the information"
    },
    {
      "Time_Start": 416.0,
      "Time_End": 423.0,
      "Text": " back to the federal government upon request. What's the penalty? Up to ten years in prison"
    },
    {
      "Time_Start": 423.0,
      "Time_End": 429.0,
      "Text": " for a first offense, and up to 20 years if it's a repeat offense. So Congress obviously"
    },
    {
      "Time_Start": 429.0,
      "Time_End": 434.0,
      "Text": " takes this one fairly seriously. The next prong that I mention has to do with wrongfully"
    },
    {
      "Time_Start": 434.0,
      "Time_End": 440.0,
      "Text": " obtaining information, and this is subsection A2 of the statute. This part of the statute"
    },
    {
      "Time_Start": 440.0,
      "Time_End": 446.0,
      "Text": " is triggered if someone intentionally accesses a computer without authorization, or exceeds"
    },
    {
      "Time_Start": 447.0,
      "Time_End": 454.0,
      "Text": " authorized access, and thereby obtains information. It's fairly open. The penalty for this is"
    },
    {
      "Time_Start": 454.0,
      "Time_End": 462.0,
      "Text": " up to one year in prison, and up to ten years for repeat offender. If this was done for"
    },
    {
      "Time_Start": 462.0,
      "Time_End": 468.0,
      "Text": " purposes of commercial advantage or private financial gain, the first offense can be up"
    },
    {
      "Time_Start": 468.0,
      "Time_End": 475.0,
      "Text": " to five years in prison, as opposed to one year. Section A3 deals with accessing a government"
    },
    {
      "Time_Start": 475.0,
      "Time_End": 481.0,
      "Text": " computer. Here the statute is triggered if someone intentionally, without authorization,"
    },
    {
      "Time_Start": 481.0,
      "Time_End": 486.0,
      "Text": " simply accesses a United States computer. There's no further requirement. You don't"
    },
    {
      "Time_Start": 486.0,
      "Time_End": 490.0,
      "Text": " have to obtain information or do anything with it. You simply gain access to a government"
    },
    {
      "Time_Start": 490.0,
      "Time_End": 496.0,
      "Text": " computer. So this one is triggered like a hair trigger. And the first offense can be"
    },
    {
      "Time_Start": 496.0,
      "Time_End": 502.0,
      "Text": " up to one year in prison, and a repeat offense can be up to ten years in prison. Next is"
    },
    {
      "Time_Start": 502.0,
      "Time_End": 508.0,
      "Text": " subsection A4 under the statute. This has to do with fraud. And this part of the statute"
    },
    {
      "Time_Start": 508.0,
      "Time_End": 515.0,
      "Text": " is triggered if someone with intent to defraud accesses a protected computer and furthers"
    },
    {
      "Time_Start": 515.0,
      "Time_End": 521.0,
      "Text": " the intended fraud by obtaining anything of value unless, and this part is carved out"
    },
    {
      "Time_Start": 521.0,
      "Time_End": 529.0,
      "Text": " of the statute, this activity consists only of the use of the computer, and the value"
    },
    {
      "Time_Start": 529.0,
      "Time_End": 535.0,
      "Text": " of such use is not more than $5,000 in a one-year period. So minor activity, if you"
    },
    {
      "Time_Start": 535.0,
      "Time_End": 541.0,
      "Text": " will, is not part of the triggering aspect of this part of the statute. Next is subsection"
    },
    {
      "Time_Start": 541.0,
      "Time_End": 544.0,
      "Text": " A5, and I know I'm going through a laundry list here. I'm almost done. Thank you for"
    },
    {
      "Time_Start": 544.0,
      "Time_End": 551.0,
      "Text": " bearing with me. It has to do with hacking, viruses, and denial of service. And this part"
    },
    {
      "Time_Start": 551.0,
      "Time_End": 557.0,
      "Text": " of the statute is triggered by someone knowingly causing the transmission of a program, information,"
    },
    {
      "Time_Start": 557.0,
      "Time_End": 564.0,
      "Text": " code, or a command which intentionally causes damage to a protected computer. This can land"
    },
    {
      "Time_Start": 564.0,
      "Time_End": 570.0,
      "Text": " you in jail for five years on a first offense or ten years if it's a repeat offense. Moving"
    },
    {
      "Time_Start": 570.0,
      "Time_End": 577.0,
      "Text": " down a level, this part of the statute creates a penalty for doing the same thing but recklessly"
    },
    {
      "Time_Start": 577.0,
      "Time_End": 582.0,
      "Text": " causing damage as opposed to intentionally causing damage. Same penalty, however, five"
    },
    {
      "Time_Start": 582.0,
      "Time_End": 589.0,
      "Text": " years or ten years for a repeat offense. And then finally, the same type of conduct,"
    },
    {
      "Time_Start": 589.0,
      "Time_End": 593.0,
      "Text": " whether it's intentional, reckless, or not. If you just happen to do it with no intent"
    },
    {
      "Time_Start": 593.0,
      "Time_End": 599.0,
      "Text": " whatsoever and you do cause damage, you still can find yourself in jail up to one year for"
    },
    {
      "Time_Start": 599.0,
      "Time_End": 606.0,
      "Text": " a first offense and again ten years for a repeat offense. Section A6 of the statute"
    },
    {
      "Time_Start": 606.0,
      "Time_End": 613.0,
      "Text": " is triggered when someone knowingly and with the intent to defraud traffics in passwords."
    },
    {
      "Time_Start": 613.0,
      "Time_End": 619.0,
      "Text": " This can create a prison term of one year for a first offense and ten years for a repeat"
    },
    {
      "Time_Start": 619.0,
      "Time_End": 625.0,
      "Text": " offense. And then last but not least is part of the statute dealing with extortion. And"
    },
    {
      "Time_Start": 625.0,
      "Time_End": 634.0,
      "Text": " if someone with the intent to extort anything of value communicates any sort of a message"
    },
    {
      "Time_Start": 634.0,
      "Time_End": 640.0,
      "Text": " which contains a threat to cause damage to a protected computer, you're in the hot seat"
    },
    {
      "Time_Start": 640.0,
      "Time_End": 646.0,
      "Text": " five years for a first offense, ten years for a repeat offense. Now, the provision dealing"
    },
    {
      "Time_Start": 646.0,
      "Time_End": 654.0,
      "Text": " with hacking, viruses, denial of service, and extortion keys off on the word damage."
    },
    {
      "Time_Start": 654.0,
      "Time_End": 660.0,
      "Text": " And I mentioned that a moment ago. Damage is defined in the statute as $5,000 in losses"
    },
    {
      "Time_Start": 660.0,
      "Time_End": 667.0,
      "Text": " in a given year or harm to the provision of medical care, creating physical injury,"
    },
    {
      "Time_Start": 667.0,
      "Time_End": 673.0,
      "Text": " or threatening public health or safety. So if you're not dealing with medical care, physical"
    },
    {
      "Time_Start": 673.0,
      "Time_End": 680.0,
      "Text": " injury, or health or safety, you're not causing statutory damage if the harm you cause, again"
    },
    {
      "Time_Start": 680.0,
      "Time_End": 687.0,
      "Text": " generically you, is less than $5,000. So the quantification of a loss is quite important"
    },
    {
      "Time_Start": 687.0,
      "Time_End": 691.0,
      "Text": " under the statute. And as Bill will discuss later on, there are some proposed amendments"
    },
    {
      "Time_Start": 691.0,
      "Time_End": 696.0,
      "Text": " to touch on that particular issue. All right. So where do we go from here in this discussion?"
    },
    {
      "Time_Start": 696.0,
      "Time_End": 700.0,
      "Text": " You've heard all the legal gobbledygook from the statute. We thought we'd try to bring"
    },
    {
      "Time_Start": 700.0,
      "Time_End": 705.0,
      "Text": " it on home with some hypothetical examples. We're first going to discuss three different"
    },
    {
      "Time_Start": 705.0,
      "Time_End": 711.0,
      "Text": " types of hacks that could trigger different parts of the statute. The first one is a basic"
    },
    {
      "Time_Start": 711.0,
      "Time_End": 715.0,
      "Text": " root level hack. And by the way, I'll do a little footnote right now. I don't purport"
    },
    {
      "Time_Start": 715.0,
      "Time_End": 720.0,
      "Text": " to be a technical expert like many of you are here. I'm a lawyer, but I'll do the best"
    },
    {
      "Time_Start": 720.0,
      "Time_End": 724.0,
      "Text": " I can. Bill has somewhat more expertise than I do on the technical matters. But again,"
    },
    {
      "Time_Start": 724.0,
      "Time_End": 729.0,
      "Text": " he said to me, it's not absolutely perfect as a matter of technology. Please forgive"
    },
    {
      "Time_Start": 729.0,
      "Time_End": 735.0,
      "Text": " us. We were trained elsewhere. The first one is a basic root level hack. Here the perpetrator"
    },
    {
      "Time_Start": 735.0,
      "Time_End": 744.0,
      "Text": " plants a sniffer, browses private files, erases log tracks, places a back door, and gives"
    },
    {
      "Time_Start": 744.0,
      "Time_End": 748.0,
      "Text": " passwords to friends. So we're setting up a few hurdles here, and we'll see how they"
    },
    {
      "Time_Start": 748.0,
      "Time_End": 753.0,
      "Text": " trigger the statute. The second hack we're going to look at, you have someone creating"
    },
    {
      "Time_Start": 753.0,
      "Time_End": 760.0,
      "Text": " a web page that contains code that can exploit, for example, vulnerabilities in ActiveX. And"
    },
    {
      "Time_Start": 760.0,
      "Time_End": 765.0,
      "Text": " then the third hack we're going to look at deals with someone who is authorized but exceeds"
    },
    {
      "Time_Start": 765.0,
      "Time_End": 771.0,
      "Text": " his authorization, penetrates a system, encrypts some files, and then tries to extort money"
    },
    {
      "Time_Start": 771.0,
      "Time_End": 777.0,
      "Text": " from corporate management for the decrypting key. Then, if time permits, we're going to"
    },
    {
      "Time_Start": 777.0,
      "Time_End": 782.0,
      "Text": " look at criminal liability for distributed denial of service attacks and the launch of"
    },
    {
      "Time_Start": 782.0,
      "Time_End": 788.0,
      "Text": " malicious worms. Finally, we're going to touch on the legislative proposals to amend the"
    },
    {
      "Time_Start": 788.0,
      "Time_End": 793.0,
      "Text": " statute, and we're going to talk about what's happening legally in the rest of the world"
    },
    {
      "Time_Start": 793.0,
      "Time_End": 797.0,
      "Text": " on the cybercrime front. Without further ado, I'm now going to turn it over to Bill, and"
    },
    {
      "Time_Start": 798.0,
      "Time_End": 801.0,
      "Text": " he's going to spin the first factual hypothetical for you. Thank you."
    },
    {
      "Time_Start": 801.0,
      "Time_End": 811.0,
      "Text": " I'm going to set up the basic techniques that Bob, our hypothetical perpetrator, for lack"
    },
    {
      "Time_Start": 811.0,
      "Time_End": 816.0,
      "Text": " of a better word, uses to get himself into all kinds of trouble. And I'm not going to"
    },
    {
      "Time_Start": 816.0,
      "Time_End": 820.0,
      "Text": " go into the real details of exploits. You guys are going to hear enough about that throughout"
    },
    {
      "Time_Start": 820.0,
      "Time_End": 825.0,
      "Text": " the other breakout sessions throughout the weekend. But I want to walk you quickly through"
    },
    {
      "Time_Start": 825.0,
      "Time_End": 830.0,
      "Text": " the various things that trigger the different areas of this dynamic statute, because it"
    },
    {
      "Time_Start": 830.0,
      "Time_End": 835.0,
      "Text": " really is. It's actually very broad and encompassing, and it's actually going to get much more that"
    },
    {
      "Time_Start": 835.0,
      "Time_End": 841.0,
      "Text": " way if they pass the intended legislation that's going on in Washington. Some of the"
    },
    {
      "Time_Start": 841.0,
      "Time_End": 845.0,
      "Text": " things that he's doing in this way, maybe they're not the most realistic way, but I"
    },
    {
      "Time_Start": 845.0,
      "Time_End": 849.0,
      "Text": " just want to be able, just for illustration purposes, to be able to show you what different"
    },
    {
      "Time_Start": 849.0,
      "Time_End": 854.0,
      "Text": " parts of the statute are triggered. Also, on my part, you don't have to take notes, because"
    },
    {
      "Time_Start": 854.0,
      "Time_End": 859.0,
      "Text": " I'm just going to cover the exact same points the way that I do it."
    },
    {
      "Time_Start": 859.0,
      "Time_End": 863.0,
      "Text": " So the first one, as Eric mentioned, is the traditional hack, which is remote penetration"
    },
    {
      "Time_Start": 863.0,
      "Time_End": 870.0,
      "Text": " of a third party's computer. And so in this hack, what Bob, he's going to exploit an old"
    },
    {
      "Time_Start": 870.0,
      "Time_End": 878.0,
      "Text": " SendMail883 bug. And so he's going to sign on for a trial shell account at an ISP. And"
    },
    {
      "Time_Start": 878.0,
      "Time_End": 882.0,
      "Text": " with the shell access, he's going to tell them that into the shell account and enter"
    },
    {
      "Time_Start": 882.0,
      "Time_End": 889.0,
      "Text": " a series of commands to exploit the SendMail program. He's going to create a link to the"
    },
    {
      "Time_Start": 889.0,
      "Time_End": 895.0,
      "Text": " ETC slash password directory, and he's going to get, hopefully for Bob, a password-free"
    },
    {
      "Time_Start": 895.0,
      "Time_End": 904.0,
      "Text": " account. And once he has root access, his next objective is to download any passwords"
    },
    {
      "Time_Start": 904.0,
      "Time_End": 908.0,
      "Text": " that might be located on the system. And then, of course, the next thing he's going to do"
    },
    {
      "Time_Start": 908.0,
      "Time_End": 913.0,
      "Text": " is he's going to plant a sniffer. And he's going to plant a sniffer to listen to all"
    },
    {
      "Time_Start": 913.0,
      "Time_End": 918.0,
      "Text": " the TCP IP network traffic. And so in this scenario, Bob's going to get about 5,000 web"
    },
    {
      "Time_Start": 918.0,
      "Time_End": 924.0,
      "Text": " accesses. And within that, he's going to be able to get some UU encoded passwords."
    },
    {
      "Time_Start": 924.0,
      "Time_End": 929.0,
      "Text": " And then, so once he's on root access, he decides to take a tour through the server."
    },
    {
      "Time_Start": 929.0,
      "Time_End": 933.0,
      "Text": " And he starts looking to see if anyone on the server might have been dumb enough to"
    },
    {
      "Time_Start": 933.0,
      "Time_End": 938.0,
      "Text": " be able to leave credit card information, for example, like in a CGI PIM directory."
    },
    {
      "Time_Start": 938.0,
      "Time_End": 941.0,
      "Text": " And he's also looking around for hidden files and hidden directories."
    },
    {
      "Time_Start": 941.0,
      "Time_End": 946.0,
      "Text": " Then, of course, he's going to want to, he doesn't want to leave the digital footprints"
    },
    {
      "Time_Start": 946.0,
      "Time_End": 951.0,
      "Text": " all over the server, so he's going to locate the real log file and carefully erase his"
    },
    {
      "Time_Start": 951.0,
      "Time_End": 955.0,
      "Text": " tracks. And, of course, he doesn't want all of his hard work to go to waste, so he's going"
    },
    {
      "Time_Start": 955.0,
      "Time_End": 961.0,
      "Text": " to plant a backdoor on the system. And then finally, Bob has the passwords, he's going"
    },
    {
      "Time_Start": 961.0,
      "Time_End": 967.0,
      "Text": " to decrypt them, and he's going to email them to several of his friends free of charge."
    },
    {
      "Time_Start": 967.0,
      "Time_End": 972.0,
      "Text": " So Eric's going to explain now about the trouble that Bob just got himself into."
    },
    {
      "Time_Start": 975.0,
      "Time_End": 981.0,
      "Text": " The trouble with Bob? Okay. Let's talk about Bob and what he's done. Has Bob been a bad"
    },
    {
      "Time_Start": 981.0,
      "Time_End": 990.0,
      "Text": " boy? We'll find out. All right. If the computer that Bob accessed is private or a protected"
    },
    {
      "Time_Start": 991.0,
      "Time_End": 996.0,
      "Text": " computer, which essentially in the statute is defined as any computer that is used in"
    },
    {
      "Time_Start": 996.0,
      "Time_End": 1001.0,
      "Text": " interstate or foreign commerce, basically any computer hooked up to the Internet, then"
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1006.0,
      "Text": " Bob could have some criminal liability. If he gained the information for commercial advantage"
    },
    {
      "Time_Start": 1006.0,
      "Time_End": 1012.0,
      "Text": " or if the information is part of a larger criminal act, or if the value of the information"
    },
    {
      "Time_Start": 1012.0,
      "Time_End": 1018.0,
      "Text": " exceeded $5,000, then good old Bob could be liable for a felony and up to five years in"
    },
    {
      "Time_Start": 1018.0,
      "Time_End": 1025.0,
      "Text": " the slammer. Otherwise, Bob still might face misdemeanor liability. If we're dealing with"
    },
    {
      "Time_Start": 1025.0,
      "Time_End": 1034.0,
      "Text": " Bob and a governmental computer, he certainly is likely, certainly likely, he is certainly"
    },
    {
      "Time_Start": 1034.0,
      "Time_End": 1039.0,
      "Text": " liable for a misdemeanor at least, even if he does not obtain any information. And I"
    },
    {
      "Time_Start": 1039.0,
      "Time_End": 1045.0,
      "Text": " went over that a little bit earlier. If Bob obtained the information from a computer that"
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1051.0,
      "Text": " was operated by a financial institution, then he also is most likely criminally liable"
    },
    {
      "Time_Start": 1051.0,
      "Time_End": 1057.0,
      "Text": " for a misdemeanor. There are special protections put into the statute for financial institutions."
    },
    {
      "Time_Start": 1057.0,
      "Time_End": 1064.0,
      "Text": " Everybody hear me okay? All right. Now let's talk about Bob and planting a sniffer. This"
    },
    {
      "Time_Start": 1064.0,
      "Time_End": 1072.0,
      "Text": " probably is a serious violation of Section A5A if the damage caused is over $5,000. The"
    },
    {
      "Time_Start": 1072.0,
      "Time_End": 1076.0,
      "Text": " damage can be calculated a number of ways. It could include the amount of engineering"
    },
    {
      "Time_Start": 1076.0,
      "Time_End": 1082.0,
      "Text": " time needed to deal with the situation, down time, and harm to the sniffer, excuse me,"
    },
    {
      "Time_Start": 1082.0,
      "Time_End": 1088.0,
      "Text": " to the system, not to the sniffer. Finally, at a minimum, it is a misdemeanor to plant"
    },
    {
      "Time_Start": 1088.0,
      "Time_End": 1093.0,
      "Text": " a sniffer because the information was obtained without, because information was obtained"
    },
    {
      "Time_Start": 1093.0,
      "Time_End": 1098.0,
      "Text": " without authorization. Now let's talk about Bob's browsing of private files. Again, if"
    },
    {
      "Time_Start": 1098.0,
      "Time_End": 1102.0,
      "Text": " we're dealing with a government computer and sensitive information, there are some"
    },
    {
      "Time_Start": 1102.0,
      "Time_End": 1109.0,
      "Text": " harsh penalties in place. Congress did not take lightly the issue of tampering with government"
    },
    {
      "Time_Start": 1109.0,
      "Time_End": 1115.0,
      "Text": " secrets. And if this is the case, old Bob could have a prison term of up to 10 years"
    },
    {
      "Time_Start": 1115.0,
      "Time_End": 1120.0,
      "Text": " if with knowledge he transmitted governmental secret information to others or he refused"
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1126.0,
      "Text": " to give back the information upon demand. If the information is not sensitive, but Bob"
    },
    {
      "Time_Start": 1126.0,
      "Time_End": 1131.0,
      "Text": " nevertheless went ahead and browsed files, he's likely committed a misdemeanor unless"
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1138.0,
      "Text": " the value of the information exceeds $5,000 or he did this for commercial gain. Then he's"
    },
    {
      "Time_Start": 1138.0,
      "Time_End": 1144.0,
      "Text": " in the realm of felonies, excuse me. This is all in the governmental computer context."
    },
    {
      "Time_Start": 1144.0,
      "Time_End": 1151.0,
      "Text": " In terms of a private computer, Bob is going to find himself criminally liable if his activities"
    },
    {
      "Time_Start": 1151.0,
      "Time_End": 1157.0,
      "Text": " furthered an intended fraud or if he obtained anything of value. Now it's sometimes worthwhile"
    },
    {
      "Time_Start": 1157.0,
      "Time_End": 1162.0,
      "Text": " to look at some of the cases that have interpreted the statute to see how the statutes were playing"
    },
    {
      "Time_Start": 1162.0,
      "Time_End": 1170.0,
      "Text": " out in real life. One case I point to is called United States v. Zubinsky. It's C-Z-U-B-I-N-S-K-Y."
    },
    {
      "Time_Start": 1170.0,
      "Time_End": 1177.0,
      "Text": " And this case deals with what constitutes anything of value under the fraud section"
    },
    {
      "Time_Start": 1177.0,
      "Time_End": 1185.0,
      "Text": " of the statute, section A-4. In that particular case, Zubinsky worked for an IRS office. He"
    },
    {
      "Time_Start": 1185.0,
      "Time_End": 1192.0,
      "Text": " then conducted numerous unauthorized searches of IRS files in his spare time. The court"
    },
    {
      "Time_Start": 1192.0,
      "Time_End": 1197.0,
      "Text": " held, not surprisingly, that this exceeded the scope of his authorized access. However,"
    },
    {
      "Time_Start": 1197.0,
      "Time_End": 1202.0,
      "Text": " the court concluded that Zubinsky did not obtain anything of value because he merely"
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1207.0,
      "Text": " viewed the information and he did nothing with it. Therefore, in this particular case,"
    },
    {
      "Time_Start": 1207.0,
      "Time_End": 1211.0,
      "Text": " his felony conviction was reversed and this was one client that was happy with his attorney."
    },
    {
      "Time_Start": 1211.0,
      "Time_End": 1219.0,
      "Text": " It does happen once in a while. Another case I want to point to is AOL v. LCGM. Now remember"
    },
    {
      "Time_Start": 1219.0,
      "Time_End": 1227.0,
      "Text": " under section G of the statute, private civil lawsuits can be filed against people alleged"
    },
    {
      "Time_Start": 1228.0,
      "Time_End": 1234.0,
      "Text": " to have violated the Computer Fraud and Abuse Act. In this particular case, AOL used section"
    },
    {
      "Time_Start": 1234.0,
      "Time_End": 1241.0,
      "Text": " A-2-C of the statute having to do with improper access and gaining of information against"
    },
    {
      "Time_Start": 1241.0,
      "Time_End": 1248.0,
      "Text": " LCGM. LCGM was alleged to have sent unsolicited bulk email, otherwise known affectionately"
    },
    {
      "Time_Start": 1248.0,
      "Time_End": 1256.0,
      "Text": " as spam, to AOL subscribers. LCGM admitted to maintaining an AOL membership and using"
    },
    {
      "Time_Start": 1256.0,
      "Time_End": 1264.0,
      "Text": " the membership to harvest AOL email messages. As such, LCGM violated the terms of service"
    },
    {
      "Time_Start": 1264.0,
      "Time_End": 1272.0,
      "Text": " and exceeded the scope of its authorization. The court held that LCGM did violate the statute"
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1277.0,
      "Text": " by obtaining information from AOL's protected computer system. AOL did not get damages in"
    },
    {
      "Time_Start": 1277.0,
      "Time_End": 1282.0,
      "Text": " that case but did receive injunctive relief preventing this type of practice from going"
    },
    {
      "Time_Start": 1282.0,
      "Time_End": 1287.0,
      "Text": " forward in the future. Okay, now getting back to Bill's hypothetical, what about erasing"
    },
    {
      "Time_Start": 1287.0,
      "Time_End": 1294.0,
      "Text": " log tracks and placing a backdoor? If the erasing of the log tracks and placing a backdoor"
    },
    {
      "Time_Start": 1294.0,
      "Time_End": 1300.0,
      "Text": " was part of a fraudulent scheme, then Bob probably is looking at a felony and time in"
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1307.0,
      "Text": " prison. When Bob erased the server access logs, he's damaged the system and then the"
    },
    {
      "Time_Start": 1307.0,
      "Time_End": 1312.0,
      "Text": " question comes down to whether the damage caused was over $5,000 and we talked about"
    },
    {
      "Time_Start": 1312.0,
      "Time_End": 1317.0,
      "Text": " that monetary threshold before. One more case here which I think you might find interesting"
    },
    {
      "Time_Start": 1317.0,
      "Time_End": 1325.0,
      "Text": " is U.S. v. Sablon, S-A-B-L-O-N. This was a mid-1990s case which explored issues of intent"
    },
    {
      "Time_Start": 1325.0,
      "Time_End": 1331.0,
      "Text": " under the statute. Sablon worked for a bank in Guam and had been recently dismissed from"
    },
    {
      "Time_Start": 1331.0,
      "Time_End": 1336.0,
      "Text": " her employment. After a night on the town, she left a bar, entered the bank through an"
    },
    {
      "Time_Start": 1336.0,
      "Time_End": 1341.0,
      "Text": " unlocked door, and using her old password, she entered onto the system and destroyed"
    },
    {
      "Time_Start": 1341.0,
      "Time_End": 1348.0,
      "Text": " some files. She argued that she didn't intend to cause any damage to the files and therefore"
    },
    {
      "Time_Start": 1348.0,
      "Time_End": 1355.0,
      "Text": " did not meet the intent element of Section A-5. How many people here think that she succeeded"
    },
    {
      "Time_Start": 1355.0,
      "Time_End": 1366.0,
      "Text": " with this argument? Well, let's see what happened. The court held that intent refers"
    },
    {
      "Time_Start": 1366.0,
      "Time_End": 1374.0,
      "Text": " to intent to access, not intent to damage and therefore she was off the hook. This part"
    },
    {
      "Time_Start": 1374.0,
      "Time_End": 1379.0,
      "Text": " of the statute has since been amended and it does require intent to cause damage to"
    },
    {
      "Time_Start": 1380.0,
      "Time_End": 1386.0,
      "Text": " the files and the like. Now what about giving passwords to friends? Here Bob will be liable"
    },
    {
      "Time_Start": 1386.0,
      "Time_End": 1392.0,
      "Text": " if the court finds that he knowingly and with intent to defraud trafficked in passwords."
    },
    {
      "Time_Start": 1392.0,
      "Time_End": 1398.0,
      "Text": " The term traffic simply means that Bob or anyone else has passed on passwords to somebody"
    },
    {
      "Time_Start": 1398.0,
      "Time_End": 1403.0,
      "Text": " else. All right, now let's turn to the next hypothetical and I turn it over to Bill."
    },
    {
      "Time_Start": 1404.0,
      "Time_End": 1411.0,
      "Text": " Okay, this has never been litigated before and the government hasn't brought the actions"
    },
    {
      "Time_Start": 1411.0,
      "Time_End": 1416.0,
      "Text": " against us, so it's purely hypothetical. But in this scenario, we're going to look at the"
    },
    {
      "Time_Start": 1416.0,
      "Time_End": 1422.0,
      "Text": " criminal liability for posting an exploitive webpage that can allow the webpage author"
    },
    {
      "Time_Start": 1422.0,
      "Time_End": 1430.0,
      "Text": " to execute local files on a visitor's computer. And it's a really neat look at the flexibility"
    },
    {
      "Time_Start": 1430.0,
      "Time_End": 1436.0,
      "Text": " of 1030 because you know what happens if you post a website and with the malicious"
    },
    {
      "Time_Start": 1436.0,
      "Time_End": 1442.0,
      "Text": " code and somebody goes to you, it's kind of like a reverse hack. So what's the liability?"
    },
    {
      "Time_Start": 1442.0,
      "Time_End": 1448.0,
      "Text": " It's because the hacker doesn't specifically target his victim and nor does he directly"
    },
    {
      "Time_Start": 1448.0,
      "Time_End": 1453.0,
      "Text": " penetrate the victim's computer, but rather the victim visits the webpage himself and"
    },
    {
      "Time_Start": 1453.0,
      "Time_End": 1459.0,
      "Text": " downloads the file if several conditions are met, then it can potentially violate the integrity"
    },
    {
      "Time_Start": 1459.0,
      "Time_End": 1464.0,
      "Text": " of the victim's computer. So the way this one works is the hacker constructs a malicious"
    },
    {
      "Time_Start": 1464.0,
      "Time_End": 1471.0,
      "Text": " help file and places it in a location that's accessible by the victim, which causes the"
    },
    {
      "Time_Start": 1471.0,
      "Time_End": 1478.0,
      "Text": " help file to be loaded and then embedded shortcuts execute without interaction from the victim,"
    },
    {
      "Time_Start": 1478.0,
      "Time_End": 1484.0,
      "Text": " the guy who visited the website. So the hacker causes the compiled HTML help file to be opened"
    },
    {
      "Time_Start": 1485.0,
      "Time_End": 1491.0,
      "Text": " through the ActiveX scripting show help column in the Internet Explorer. And so by using"
    },
    {
      "Time_Start": 1491.0,
      "Time_End": 1496.0,
      "Text": " the show help ActiveScripting column in conjunction with the shortcuts that are embedded in the"
    },
    {
      "Time_Start": 1496.0,
      "Time_End": 1503.0,
      "Text": " malicious help file, Bob here is able to execute all the programs and ActiveX controls of his"
    },
    {
      "Time_Start": 1503.0,
      "Time_End": 1507.0,
      "Text": " choice. So what's the liability, Eric?"
    },
    {
      "Time_Start": 1508.0,
      "Time_End": 1517.0,
      "Text": " There's a sage wobbler in the office in the audience right now. Could you please come"
    },
    {
      "Time_Start": 1517.0,
      "Time_End": 1521.0,
      "Text": " up for an important message? Thanks."
    },
    {
      "Time_Start": 1521.0,
      "Time_End": 1526.0,
      "Text": " You heard about the terrorists that hijacked a plane full of lawyers and they were sitting"
    },
    {
      "Time_Start": 1526.0,
      "Time_End": 1530.0,
      "Text": " on the tarmac and the terrorists said, if you don't meet my demand for $5 million, I'm"
    },
    {
      "Time_Start": 1530.0,
      "Time_End": 1533.0,
      "Text": " going to start releasing the attorneys."
    },
    {
      "Time_Start": 1534.0,
      "Time_End": 1536.0,
      "Text": " Thought I'd break things up a little bit."
    },
    {
      "Time_Start": 1536.0,
      "Time_End": 1542.0,
      "Text": " All right, we're back to Bob. Bob, in terms of the scenario that Bill just painted, Bob"
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1551.0,
      "Text": " may be liable for the mere, well, Bob may not be liable simply for the mere passive"
    },
    {
      "Time_Start": 1551.0,
      "Time_End": 1557.0,
      "Text": " posting of a malicious website because what if nobody visits the site? The statute primarily"
    },
    {
      "Time_Start": 1557.0,
      "Time_End": 1563.0,
      "Text": " concerns itself with the unauthorized acquisition of information, damage to computer systems"
    },
    {
      "Time_Start": 1563.0,
      "Time_End": 1568.0,
      "Text": " or fraudulent activity where something of value has been obtained. A passive website"
    },
    {
      "Time_Start": 1568.0,
      "Time_End": 1575.0,
      "Text": " does none of these things. But what if the site is no longer passive and it's visited"
    },
    {
      "Time_Start": 1575.0,
      "Time_End": 1581.0,
      "Text": " and a file is secretly placed on a victim's computer? Access of a government computer,"
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1586.0,
      "Text": " as we've seen, is enough to trigger the statute. So, if someone in the government"
    },
    {
      "Time_Start": 1586.0,
      "Time_End": 1591.0,
      "Text": " goes to the website and then something is secretly placed on a government computer,"
    },
    {
      "Time_Start": 1591.0,
      "Time_End": 1597.0,
      "Text": " Bob's got trouble. If we're dealing with a non-governmental computer, there is still"
    },
    {
      "Time_Start": 1597.0,
      "Time_End": 1601.0,
      "Text": " potential criminal liability and even tort liability. There's what's called the"
    },
    {
      "Time_Start": 1601.0,
      "Time_End": 1607.0,
      "Text": " trespass to chattels civil theory, which basically is a common form of a trespass where"
    },
    {
      "Time_Start": 1607.0,
      "Time_End": 1613.0,
      "Text": " this guy right here takes my notebook and I've got valuable information there. That's"
    },
    {
      "Time_Start": 1613.0,
      "Time_End": 1621.0,
      "Text": " a trespass. The theory of trespass is now becoming part of cyber law. I don't know"
    },
    {
      "Time_Start": 1621.0,
      "Time_End": 1625.0,
      "Text": " how many people here are familiar with the eBay versus Bidder's Edge case that was"
    },
    {
      "Time_Start": 1625.0,
      "Time_End": 1631.0,
      "Text": " recently decided in San Jose. But Bidder's Edge is an aggregator auction site that brings"
    },
    {
      "Time_Start": 1631.0,
      "Time_End": 1636.0,
      "Text": " together multiple auction sites in one place so that people can bid simultaneously at these"
    },
    {
      "Time_Start": 1636.0,
      "Time_End": 1643.0,
      "Text": " different sites. And eBay sued Bidder's Edge, arguing that the way Bidder's Edge crawled"
    },
    {
      "Time_Start": 1643.0,
      "Time_End": 1648.0,
      "Text": " onto the eBay servers and extracted information was essentially a trespass. And the court"
    },
    {
      "Time_Start": 1648.0,
      "Time_End": 1655.0,
      "Text": " agreed. That case is shooting up like a rocket on appeal. Getting back to Bob, if the malicious"
    },
    {
      "Time_Start": 1655.0,
      "Time_End": 1661.0,
      "Text": " code affects a medically oriented computer or threatens public safety, then irrespective"
    },
    {
      "Time_Start": 1661.0,
      "Time_End": 1667.0,
      "Text": " of dollar amount of damage, Bob could find himself guilty of a felony and in prison for"
    },
    {
      "Time_Start": 1667.0,
      "Time_End": 1674.0,
      "Text": " five years. By launching malicious code from the website, as Bill's pointed out, you can't"
    },
    {
      "Time_Start": 1674.0,
      "Time_End": 1680.0,
      "Text": " necessarily reduce your risk by choosing which computers are affected. As we previously"
    },
    {
      "Time_Start": 1680.0,
      "Time_End": 1684.0,
      "Text": " discussed, the owner of a computer often affects the criminal liability, whether you're dealing"
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1693.0,
      "Text": " with the government or not, for example. So there you have it. If information is obtained"
    },
    {
      "Time_Start": 1693.0,
      "Time_End": 1700.0,
      "Text": " from a private computer as part of this practice, again, Bob could face at least a misdemeanor"
    },
    {
      "Time_Start": 1700.0,
      "Time_End": 1704.0,
      "Text": " based on the sections we previously discussed. All right. Now let's go to the scenario where"
    },
    {
      "Time_Start": 1704.0,
      "Time_End": 1708.0,
      "Text": " someone has authorized access but exceeded that authorization."
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1716.0,
      "Text": " Okay. This is one of the most common things that happens. They said 60 to 70 percent of"
    },
    {
      "Time_Start": 1716.0,
      "Time_End": 1723.0,
      "Text": " all corporate intrusions are done by people who exceed their authority. So Bob here now"
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1728.0,
      "Text": " is an employee at a large consulting company, and the consulting company uses Nobel Network"
    },
    {
      "Time_Start": 1728.0,
      "Time_End": 1736.0,
      "Text": " network. And so, however, the network security is really lax, and the Nobel's intruder detection"
    },
    {
      "Time_Start": 1736.0,
      "Time_End": 1742.0,
      "Text": " system has not been turned on. So what Hacker does, he goes to a terminal that's in an unoccupied"
    },
    {
      "Time_Start": 1742.0,
      "Time_End": 1749.0,
      "Text": " office, and he's going to use a program called Nobel BFH, and he's going to try and run a"
    },
    {
      "Time_Start": 1749.0,
      "Time_End": 1756.0,
      "Text": " series of passwords, A-A-A-B-A-C, until eventually, with Bob's luck, he's going to be able to"
    },
    {
      "Time_Start": 1756.0,
      "Time_End": 1761.0,
      "Text": " at least eventually get a password he can access the system. And so once he logs on"
    },
    {
      "Time_Start": 1761.0,
      "Time_End": 1765.0,
      "Text": " under a different name, then he's going to place a keystroke logger in the workstation's"
    },
    {
      "Time_Start": 1765.0,
      "Time_End": 1773.0,
      "Text": " path and collect the passwords in the logger funnel. And so once he has access to several"
    },
    {
      "Time_Start": 1773.0,
      "Time_End": 1777.0,
      "Text": " different passwords, then things are going to be pretty interesting to start combing"
    },
    {
      "Time_Start": 1777.0,
      "Time_End": 1782.0,
      "Text": " through the personal emails of his coworkers. And then he thinks, well, you know, I can"
    },
    {
      "Time_Start": 1782.0,
      "Time_End": 1788.0,
      "Text": " actually make some money here. So using his Nobel hacking skills, and so he's going to"
    },
    {
      "Time_Start": 1788.0,
      "Time_End": 1795.0,
      "Text": " access critical files and encrypt the directories, and he wants to be able to sell the decrypting"
    },
    {
      "Time_Start": 1795.0,
      "Time_End": 1802.0,
      "Text": " key to management for $50,000 in this case. So to do this, he has to get a sysadmin access,"
    },
    {
      "Time_Start": 1802.0,
      "Time_End": 1807.0,
      "Text": " and he's going to use a program called nwhack to execute a really blunt attack. Of course,"
    },
    {
      "Time_Start": 1807.0,
      "Time_End": 1813.0,
      "Text": " it's not to make the changes at this point, but he just wants to be able to get administrator"
    },
    {
      "Time_Start": 1813.0,
      "Time_End": 1820.0,
      "Text": " access. And what he's going to do is he's going to just briefly plant a backdoor so"
    },
    {
      "Time_Start": 1820.0,
      "Time_End": 1824.0,
      "Text": " he can come back later. And so a few days later, he's going to go back into the system,"
    },
    {
      "Time_Start": 1824.0,
      "Time_End": 1830.0,
      "Text": " and he's going to encrypt the directories, and he's going to send surprise management"
    },
    {
      "Time_Start": 1830.0,
      "Time_End": 1837.0,
      "Text": " a demand for $50,000 for the decrypting key. So Eric's going to explain all the trouble"
    },
    {
      "Time_Start": 1837.0,
      "Time_End": 1840.0,
      "Text": " that Bob has gotten himself into now."
    },
    {
      "Time_Start": 1840.0,
      "Time_End": 1844.0,
      "Text": " Should I leave with one more lawyer joke? Should we go straight to Bob?"
    },
    {
      "Time_Start": 1844.0,
      "Time_End": 1851.0,
      "Text": " Okay. Lawyer dies. I know. You're sad. Very sad. Let's all hang our heads. Lawyer dies."
    },
    {
      "Time_Start": 1851.0,
      "Time_End": 1859.0,
      "Text": " He doesn't go to heaven. What a shock. Lawyer's in that nether region, very warm down there,"
    },
    {
      "Time_Start": 1859.0,
      "Time_End": 1863.0,
      "Text": " and he meets Satan, and Satan says, well, you know, the bad news is, yes, you're in"
    },
    {
      "Time_Start": 1863.0,
      "Time_End": 1869.0,
      "Text": " hell, but you have three choices. You can go into cave number one, cave number two,"
    },
    {
      "Time_Start": 1869.0,
      "Time_End": 1873.0,
      "Text": " or cave number three for eternity. Lawyer says, well, I don't know anything about the"
    },
    {
      "Time_Start": 1873.0,
      "Time_End": 1877.0,
      "Text": " caves. Will you show me around? Sure, I'll give you a guided tour. Lawyer's shown the"
    },
    {
      "Time_Start": 1877.0,
      "Time_End": 1882.0,
      "Text": " first cave, and in the first cave, you have a lawyer that's being drawn and quartered"
    },
    {
      "Time_Start": 1882.0,
      "Time_End": 1886.0,
      "Text": " repeatedly indefinitely, limbs being torn apart, put back together. Doesn't look very"
    },
    {
      "Time_Start": 1886.0,
      "Time_End": 1890.0,
      "Text": " pleasant. Lawyer says, I've got to take a pass on cave number one. I don't like that"
    },
    {
      "Time_Start": 1890.0,
      "Time_End": 1895.0,
      "Text": " action at all. Cave number two, he looks in, and there's a lawyer who's being incinerated"
    },
    {
      "Time_Start": 1895.0,
      "Time_End": 1900.0,
      "Text": " constantly, over and over again, being burned up. Lawyer's not too pleased with that prospect"
    },
    {
      "Time_Start": 1900.0,
      "Time_End": 1904.0,
      "Text": " and takes a pass on cave number two and crosses his fingers and just hopes and prays that"
    },
    {
      "Time_Start": 1904.0,
      "Time_End": 1908.0,
      "Text": " cave number three will be a little bit better. I won't go into any graphic detail here, but"
    },
    {
      "Time_Start": 1908.0,
      "Time_End": 1913.0,
      "Text": " in cave number three, there's a lawyer with Monica Lewinsky, and our lawyer, we'll call"
    },
    {
      "Time_Start": 1913.0,
      "Time_End": 1918.0,
      "Text": " him Bob, says, well, cave number three looks okay. Satan, please, put me into cave number"
    },
    {
      "Time_Start": 1918.0,
      "Time_End": 1923.0,
      "Text": " three. And so Satan says, okay, fine. Monica, it turns out, come on in, lawyer, take a place."
    },
    {
      "Time_Start": 1923.0,
      "Time_End": 1933.0,
      "Text": " Get what you pay for. All right, we are back to Bob. Bill makes a very good point, and"
    },
    {
      "Time_Start": 1933.0,
      "Time_End": 1940.0,
      "Text": " that is insider threats to computer security really are the greatest threats. I'm not sure"
    },
    {
      "Time_Start": 1940.0,
      "Time_End": 1944.0,
      "Text": " corporate America is fully aware of that yet. There's so much concern about outsiders"
    },
    {
      "Time_Start": 1944.0,
      "Time_End": 1948.0,
      "Text": " hacking in, but studies have shown, recent studies, and these were actually cited in"
    },
    {
      "Time_Start": 1948.0,
      "Time_End": 1955.0,
      "Text": " the Law Review article that Bill and I wrote, that most actual cybercrime is committed by"
    },
    {
      "Time_Start": 1955.0,
      "Time_End": 1960.0,
      "Text": " insiders. Let's go back to the Lewinsky case with reference to Bob. If the employee is"
    },
    {
      "Time_Start": 1960.0,
      "Time_End": 1966.0,
      "Text": " only looking at files, the employee may not face liability under the section of the statute"
    },
    {
      "Time_Start": 1966.0,
      "Time_End": 1972.0,
      "Text": " that deals with loss of something of value, and remember how the court decided that particular"
    },
    {
      "Time_Start": 1972.0,
      "Time_End": 1979.0,
      "Text": " case. However, if an employee is looking at private e-mails, this could be deemed obtaining"
    },
    {
      "Time_Start": 1979.0,
      "Time_End": 1985.0,
      "Text": " information under one of the subsections that I read to you, and that could be enough to"
    },
    {
      "Time_Start": 1985.0,
      "Time_End": 1991.0,
      "Text": " trigger criminal liability. This particular legal theory hasn't played out fully, and"
    },
    {
      "Time_Start": 1991.0,
      "Time_End": 1997.0,
      "Text": " we'll see where that goes. In terms of Bob changing passwords to critical data, that"
    },
    {
      "Time_Start": 1997.0,
      "Time_End": 2002.0,
      "Text": " appears to fall squarely within the statute that I read to you earlier, and Bob could"
    },
    {
      "Time_Start": 2002.0,
      "Time_End": 2008.0,
      "Text": " have a felony violation there in a prison term of up to five years. If Bob changes password"
    },
    {
      "Time_Start": 2008.0,
      "Time_End": 2014.0,
      "Text": " access on a computer that could threaten public safety or medical services, then the prosecution"
    },
    {
      "Time_Start": 2014.0,
      "Time_End": 2021.0,
      "Text": " in that particular instance would not need to meet the $5,000 damage threshold. However,"
    },
    {
      "Time_Start": 2021.0,
      "Time_End": 2027.0,
      "Text": " in this particular scenario, it is likely that the $5,000 requirement is met because"
    },
    {
      "Time_Start": 2027.0,
      "Time_End": 2033.0,
      "Text": " of the amount of ransom money that's being asked for here. There's got to be some sort"
    },
    {
      "Time_Start": 2033.0,
      "Time_End": 2038.0,
      "Text": " of, how do you say, a linkage between the dollar amounts. In terms of demanding the"
    },
    {
      "Time_Start": 2038.0,
      "Time_End": 2043.0,
      "Text": " $50,000 in exchange for the password, this could be a violation, very likely a violation"
    },
    {
      "Time_Start": 2043.0,
      "Time_End": 2049.0,
      "Text": " of subsection A-7 of the statute. Again, that talks about acting with the intent to"
    },
    {
      "Time_Start": 2049.0,
      "Time_End": 2054.0,
      "Text": " extort from any person any money or thing of value by threatening to cause damage to"
    },
    {
      "Time_Start": 2054.0,
      "Time_End": 2060.0,
      "Text": " a protected computer. And now we're on to DDoS attacks, and Mr. Bill Reilly."
    },
    {
      "Time_Start": 2061.0,
      "Time_End": 2067.0,
      "Text": " Let's do that one and skip over the worms. Do it quickly."
    },
    {
      "Time_Start": 2070.0,
      "Time_End": 2074.0,
      "Text": " I'll just deal with this really quickly. You guys are probably pretty familiar with the"
    },
    {
      "Time_Start": 2074.0,
      "Time_End": 2078.0,
      "Text": " distributed denial of service attacks that happened in that February, but the question"
    },
    {
      "Time_Start": 2078.0,
      "Time_End": 2082.0,
      "Text": " is, what's the criminal liability then for distributed denial of service? And so what"
    },
    {
      "Time_Start": 2082.0,
      "Time_End": 2086.0,
      "Text": " Bob wants to do is he just wants to be able to say to large scale, distributed denial"
    },
    {
      "Time_Start": 2086.0,
      "Time_End": 2091.0,
      "Text": " of service attack, and using, for example, this one, Stacheldraht, which I'm sure everybody"
    },
    {
      "Time_Start": 2091.0,
      "Time_End": 2097.0,
      "Text": " in this room is familiar with. And so in the mass intrusion phase, he's going to use tools"
    },
    {
      "Time_Start": 2097.0,
      "Time_End": 2102.0,
      "Text": " to be able to put, to re-compromise the large numbers of computers for the daemons, and"
    },
    {
      "Time_Start": 2102.0,
      "Time_End": 2106.0,
      "Text": " then he's going to control several of the masters using those encrypting clients. And"
    },
    {
      "Time_Start": 2106.0,
      "Time_End": 2112.0,
      "Text": " so what he's going to do is, he's basically going to use the daemons to launch a large"
    },
    {
      "Time_Start": 2112.0,
      "Time_End": 2116.0,
      "Text": " number of packets flooding against the targeted victims."
    },
    {
      "Time_Start": 2121.0,
      "Time_End": 2129.0,
      "Text": " I'll make this very simple and short. In terms of employing a typical denial of service"
    },
    {
      "Time_Start": 2129.0,
      "Time_End": 2135.0,
      "Text": " attack and planting the masters and daemons, at this stage the hacker's penetration has"
    },
    {
      "Time_Start": 2135.0,
      "Time_End": 2140.0,
      "Text": " satisfied part of the elements of Section A5 of the statute because he's caused the"
    },
    {
      "Time_Start": 2140.0,
      "Time_End": 2145.0,
      "Text": " transmission of a program. But again, we need to see some damage being caused in this"
    },
    {
      "Time_Start": 2145.0,
      "Time_End": 2151.0,
      "Text": " part of the statute, and that hasn't happened yet. However, once the daemons launch a large"
    },
    {
      "Time_Start": 2151.0,
      "Time_End": 2156.0,
      "Text": " number of packet flooding or other attacks against the targeted victims, then the damage"
    },
    {
      "Time_Start": 2156.0,
      "Time_End": 2163.0,
      "Text": " ensues and can be quite phenomenal, and the statute is there and criminal liability can"
    },
    {
      "Time_Start": 2163.0,
      "Time_End": 2168.0,
      "Text": " follow. We're going to skip over worm launches. I know you're terribly disappointed, but what"
    },
    {
      "Time_Start": 2168.0,
      "Time_End": 2174.0,
      "Text": " can we do? We have some time constraints here. We're next going to talk about proposed"
    },
    {
      "Time_Start": 2174.0,
      "Time_End": 2178.0,
      "Text": " changes to the statute. Bill's going to go over that quickly, then I will tell you what's"
    },
    {
      "Time_Start": 2178.0,
      "Time_End": 2181.0,
      "Text": " going on in the rest of the world quickly, and then we'll wrap up."
    },
    {
      "Time_Start": 2185.0,
      "Time_End": 2190.0,
      "Text": " Whether the Bob is in Iraq. That's a very good question, and that's going to go to a"
    },
    {
      "Time_Start": 2190.0,
      "Time_End": 2195.0,
      "Text": " comment made in a moment about the harmonization of laws internationally. So if I can hold"
    },
    {
      "Time_Start": 2195.0,
      "Time_End": 2198.0,
      "Text": " on and get to that in a moment. Thank you."
    },
    {
      "Time_Start": 2201.0,
      "Time_End": 2205.0,
      "Text": " I don't know if you heard from what's going on in Washington right now, but there's two"
    },
    {
      "Time_Start": 2205.0,
      "Time_End": 2209.0,
      "Text": " major bills that are working its way through the Senate, and actually they're in the House"
    },
    {
      "Time_Start": 2209.0,
      "Time_End": 2217.0,
      "Text": " Judiciary Committee right now, that will dramatically change the way 1030A is being played out."
    },
    {
      "Time_Start": 2217.0,
      "Time_End": 2223.0,
      "Text": " One is, I don't know if you want the numbers, but it's S2448 by Orrin Hatch, and the other"
    },
    {
      "Time_Start": 2223.0,
      "Time_End": 2231.0,
      "Text": " one is S2092 by John Kyle. And I think one of the major changes that they're making to"
    },
    {
      "Time_Start": 2231.0,
      "Time_End": 2236.0,
      "Text": " the code here is, if you can look on this little thing here, underneath the hacking"
    },
    {
      "Time_Start": 2236.0,
      "Time_End": 2241.0,
      "Text": " and the virus and denial of service, what the thing is, is that they have the definition"
    },
    {
      "Time_Start": 2241.0,
      "Time_End": 2246.0,
      "Text": " here, it has to be intentionally causes damage in order to be able to invoke, and the damage"
    },
    {
      "Time_Start": 2246.0,
      "Time_End": 2253.0,
      "Text": " is $5,000 for the liability. But damage, a lot of times if you're just accessing information,"
    },
    {
      "Time_Start": 2253.0,
      "Time_End": 2257.0,
      "Text": " the courts have had a difficult time trying to determine what is damage. So what they're"
    },
    {
      "Time_Start": 2257.0,
      "Time_End": 2262.0,
      "Text": " doing here, actually the first part that they're changing here is a little bit strange, but"
    },
    {
      "Time_Start": 2262.0,
      "Time_End": 2268.0,
      "Text": " one is if the defendant used or attempted to use a person less than 18 years of age"
    },
    {
      "Time_Start": 2268.0,
      "Time_End": 2275.0,
      "Text": " to commit the offense, and that's a felony, it's going to be very serious. But also, here's"
    },
    {
      "Time_Start": 2275.0,
      "Time_End": 2280.0,
      "Text": " what they've done, they've changed the definition from damage to loss. So if the offense causes"
    },
    {
      "Time_Start": 2280.0,
      "Time_End": 2286.0,
      "Text": " a loss as opposed to damage, and to one or more people during the one-year period, it"
    },
    {
      "Time_Start": 2286.0,
      "Time_End": 2292.0,
      "Text": " causes $5,000 of damage. And that's the same thing, but the definition for loss is really"
    },
    {
      "Time_Start": 2292.0,
      "Time_End": 2298.0,
      "Text": " broad. It says that it means that any reasonable cost to any victim, which is obviously wide"
    },
    {
      "Time_Start": 2298.0,
      "Time_End": 2304.0,
      "Text": " open, including the cost of responding to the offense, conducting a damage assessment,"
    },
    {
      "Time_Start": 2304.0,
      "Time_End": 2309.0,
      "Text": " and restoring the data, program, system, or information to its condition prior to the"
    },
    {
      "Time_Start": 2309.0,
      "Time_End": 2315.0,
      "Text": " offense, and any revenue lost, costs incurred, or other consequential damages incurred because"
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2319.0,
      "Text": " of the interruption of the service. Obviously you can see it's going to be very easy to"
    },
    {
      "Time_Start": 2319.0,
      "Time_End": 2327.0,
      "Text": " meet the $5,000 threshold now if these bills go through. And another interesting part is,"
    },
    {
      "Time_Start": 2327.0,
      "Time_End": 2331.0,
      "Text": " and this is pretty controversial, and only one of the two bills have this thing, and"
    },
    {
      "Time_Start": 2331.0,
      "Time_End": 2336.0,
      "Text": " it's about, they're trying to liberalize the trap and trace orders. And the way it"
    },
    {
      "Time_Start": 2336.0,
      "Time_End": 2342.0,
      "Text": " works right now is if the Fed is going to start investigating and working upstream trying"
    },
    {
      "Time_Start": 2342.0,
      "Time_End": 2347.0,
      "Text": " to find out who did what, and within each jurisdiction they have to go to the court"
    },
    {
      "Time_Start": 2347.0,
      "Time_End": 2352.0,
      "Text": " and they have to apply for a trap and trace order. And of course, if you're going through"
    },
    {
      "Time_Start": 2352.0,
      "Time_End": 2357.0,
      "Text": " multiple jurisdictions, then it really, really impedes the investigation because by the time"
    },
    {
      "Time_Start": 2357.0,
      "Time_End": 2361.0,
      "Text": " they get all the way upstream, the information might be gone. It could be a delay of a week"
    },
    {
      "Time_Start": 2361.0,
      "Time_End": 2367.0,
      "Text": " or so. So what they want to do is they want to be able to have sort of like a one-stop"
    },
    {
      "Time_Start": 2367.0,
      "Time_End": 2373.0,
      "Text": " shop. So if the FBI or the federal investigators, all they have to do is just go to one judge,"
    },
    {
      "Time_Start": 2373.0,
      "Time_End": 2378.0,
      "Text": " bam, you get a blanket trap and trace order to run anywhere within the jurisdiction of"
    },
    {
      "Time_Start": 2378.0,
      "Time_End": 2384.0,
      "Text": " the U.S. And that's a pretty big one. And also what they've done is they're recommending"
    },
    {
      "Time_Start": 2384.0,
      "Time_End": 2389.0,
      "Text": " for the damage threshold of, you know, the $5,000, what they're recommending is that"
    },
    {
      "Time_Start": 2389.0,
      "Time_End": 2394.0,
      "Text": " if it's $5,000 or more, it's a felony. But if it's $5,000 or less, they're still going"
    },
    {
      "Time_Start": 2394.0,
      "Time_End": 2399.0,
      "Text": " to be able to get you with a misdemeanor. So even though they have a much easier definition"
    },
    {
      "Time_Start": 2399.0,
      "Time_End": 2405.0,
      "Text": " for the term loss, it's going to be a lot easier to be able to prosecute. And another"
    },
    {
      "Time_Start": 2405.0,
      "Time_End": 2411.0,
      "Text": " thing here that under current federal law, the federal authorities are not able to prosecute"
    },
    {
      "Time_Start": 2411.0,
      "Time_End": 2418.0,
      "Text": " juveniles under any computer crime, including, well, underneath 1030. And what this would"
    },
    {
      "Time_Start": 2418.0,
      "Time_End": 2423.0,
      "Text": " do is that the proposed bills is they would allow, at the discretion of the Attorney General,"
    },
    {
      "Time_Start": 2423.0,
      "Time_End": 2429.0,
      "Text": " to allow juveniles to be prosecuted for the more serious offenses. And the one thing to"
    },
    {
      "Time_Start": 2429.0,
      "Time_End": 2436.0,
      "Text": " consider with this is, as Eric showed, that the recidivist or the repeat offenders can"
    },
    {
      "Time_Start": 2437.0,
      "Time_End": 2443.0,
      "Text": " really, can get a boost, for example, if it's a one-year penalty. If they're a repeat offender,"
    },
    {
      "Time_Start": 2443.0,
      "Time_End": 2450.0,
      "Text": " it goes up to 10 years. But what they're doing with the juveniles is that it will count,"
    },
    {
      "Time_Start": 2450.0,
      "Time_End": 2454.0,
      "Text": " if you commit a crime when you're 14 years old, and then you commit another one at 20,"
    },
    {
      "Time_Start": 2454.0,
      "Time_End": 2457.0,
      "Text": " that's going to be considered, your juvenile crimes are going to be considered as part"
    },
    {
      "Time_Start": 2457.0,
      "Time_End": 2464.0,
      "Text": " of the repeat sentencing. And let's see, oh, then another one, this is pretty important,"
    },
    {
      "Time_Start": 2464.0,
      "Time_End": 2470.0,
      "Text": " is they're allowing, they're allowing the feds basically to confiscate any equipment"
    },
    {
      "Time_Start": 2470.0,
      "Time_End": 2474.0,
      "Text": " that was used in the attack, so they don't even have to get any warrant for that, it's"
    },
    {
      "Time_Start": 2474.0,
      "Time_End": 2476.0,
      "Text": " just part of the statute."
    },
    {
      "Time_Start": 2481.0,
      "Time_End": 2485.0,
      "Text": " Okay, and this final part of the talk has to do with what's going on in the rest of"
    },
    {
      "Time_Start": 2485.0,
      "Time_End": 2490.0,
      "Text": " the world, and we'll get to what if Bob is in Iraq, strange name, Bob, living in Iraq,"
    },
    {
      "Time_Start": 2490.0,
      "Time_End": 2497.0,
      "Text": " but it could happen. There have been efforts to harmonize cybercrime laws internationally."
    },
    {
      "Time_Start": 2497.0,
      "Time_End": 2503.0,
      "Text": " The G8 nations met in Paris about a month or two ago, and this was toward the top of"
    },
    {
      "Time_Start": 2503.0,
      "Time_End": 2509.0,
      "Text": " their agenda, creating consistent laws from one country to the next, assisting one another"
    },
    {
      "Time_Start": 2509.0,
      "Time_End": 2514.0,
      "Text": " in terms of tracking down cybercriminals, trying to make it such that there aren't any"
    },
    {
      "Time_Start": 2514.0,
      "Time_End": 2520.0,
      "Text": " digital safe havens in the world, that is the goal there, whether you like it or not."
    },
    {
      "Time_Start": 2520.0,
      "Time_End": 2525.0,
      "Text": " We all saw what happened with the love bug emanating out of the Philippines, and at the"
    },
    {
      "Time_Start": 2525.0,
      "Time_End": 2531.0,
      "Text": " time, the Philippines did not have any cyber laws to deal with that particular crime, and"
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2536.0,
      "Text": " that caused quite a bit of attention among nations, and they've now been discussing things."
    },
    {
      "Time_Start": 2536.0,
      "Time_End": 2542.0,
      "Text": " This supposedly is going to be discussed further in Okinawa, as the G8 is meeting right now."
    },
    {
      "Time_Start": 2542.0,
      "Time_End": 2550.0,
      "Text": " The Council of Europe is drafting a convention on cybercrime, trying to create uniformity"
    },
    {
      "Time_Start": 2550.0,
      "Time_End": 2556.0,
      "Text": " between European countries on this front, and there should be a report on December 31st."
    },
    {
      "Time_Start": 2556.0,
      "Time_End": 2562.0,
      "Text": " But if Bob is in Iraq, and Iraq doesn't have laws that deal with activities we've discussed"
    },
    {
      "Time_Start": 2562.0,
      "Time_End": 2568.0,
      "Text": " today, possibly Bob walks, and as long as he doesn't show up in this country, he's not"
    },
    {
      "Time_Start": 2568.0,
      "Time_End": 2571.0,
      "Text": " governed by the Computer Fraud and Abuse Act."
    },
    {
      "Time_Start": 2571.0,
      "Time_End": 2575.0,
      "Text": " Interestingly, I just read a couple of blurbs this morning worthy of note."
    },
    {
      "Time_Start": 2575.0,
      "Time_End": 2580.0,
      "Text": " U.S. law enforcement officials, I believe yesterday, told the House panel that more"
    },
    {
      "Time_Start": 2580.0,
      "Time_End": 2584.0,
      "Text": " than 100 countries currently still do not have any cybercrime laws."
    },
    {
      "Time_Start": 2584.0,
      "Time_End": 2587.0,
      "Text": " So these are the digital safe havens."
    },
    {
      "Time_Start": 2587.0,
      "Time_End": 2591.0,
      "Text": " Also, you've been hearing about Carnivore and the FBI."
    },
    {
      "Time_Start": 2591.0,
      "Time_End": 2597.0,
      "Text": " Well, in some ways, Carnivore has just been legalized and legitimated in the United Kingdom."
    },
    {
      "Time_Start": 2598.0,
      "Time_End": 2605.0,
      "Text": " Legislation allowing the British government to track emails and to seize encrypted Internet"
    },
    {
      "Time_Start": 2605.0,
      "Time_End": 2610.0,
      "Text": " communications just passed the final hurdle in Parliament this week."
    },
    {
      "Time_Start": 2610.0,
      "Time_End": 2615.0,
      "Text": " So, summing up, you need to be careful out there, no matter which side you're on."
    },
    {
      "Time_Start": 2615.0,
      "Time_End": 2620.0,
      "Text": " As a lawyer, again, I apologize for that, but I have to say that this does not constitute"
    },
    {
      "Time_Start": 2620.0,
      "Time_End": 2621.0,
      "Text": " specific legal advice."
    },
    {
      "Time_Start": 2621.0,
      "Time_End": 2626.0,
      "Text": " If you have any particular questions that pertain to yourself or others, please do seek"
    },
    {
      "Time_Start": 2626.0,
      "Time_End": 2630.0,
      "Text": " counsel from somebody with expertise in your particular area of concern."
    },
    {
      "Time_Start": 2630.0,
      "Time_End": 2633.0,
      "Text": " Thank you very much for having us today."
    }
  ]
}