{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n She is responsible for the Department of the Army's Information Assurance Program for the tactical force."
    },
    {
      "Time_Start": 14.0,
      "Time_End": 24.0,
      "Text": " So next time that you think about a tank driving down range and shooting targets and stuff, or a helicopter, all the unit security stuff, she's the one that does that."
    },
    {
      "Time_Start": 24.0,
      "Time_End": 28.0,
      "Text": " So if you didn't identify her, you all missed a sure good bet."
    },
    {
      "Time_Start": 28.0,
      "Time_End": 34.0,
      "Text": " And she's also skilled in hand-to-hand, so I wouldn't mess with her."
    },
    {
      "Time_Start": 34.0,
      "Time_End": 38.0,
      "Text": " Anyway, my name is Phil. I work for the Department of the Army."
    },
    {
      "Time_Start": 38.0,
      "Time_End": 42.0,
      "Text": " I'm the Operations Officer for Information Assurance for the program for the Big Army."
    },
    {
      "Time_Start": 42.0,
      "Time_End": 46.0,
      "Text": " And I'm also the Director for the Department of Defense for biometrics."
    },
    {
      "Time_Start": 46.0,
      "Time_End": 54.0,
      "Text": " And what I'm here to do today is just kind of talk to you all about biometrics and the reason that the Department of Defense, your Department of Defense, is making an investment in that."
    },
    {
      "Time_Start": 54.0,
      "Time_End": 58.0,
      "Text": " I would like to stand up here and tell you that we are leading the way. We are not."
    },
    {
      "Time_Start": 58.0,
      "Time_End": 63.0,
      "Text": " We are following commercial industry. We are following commercial practices."
    },
    {
      "Time_Start": 63.0,
      "Time_End": 69.0,
      "Text": " I don't know the last time anybody went to Disney World, Disneyland, but they've got that implemented at their gates."
    },
    {
      "Time_Start": 70.0,
      "Time_End": 73.0,
      "Text": " And as you leave for the day, a little message comes up and says,"
    },
    {
      "Time_Start": 73.0,
      "Time_End": 76.0,
      "Text": " Gee, I hope you had a good time. See you later, Phil."
    },
    {
      "Time_Start": 76.0,
      "Time_End": 81.0,
      "Text": " Now, they don't get that in the system by accident. It's by the registration process and when you come in and pay for your tickets."
    },
    {
      "Time_Start": 81.0,
      "Time_End": 84.0,
      "Text": " Let me talk to you a little bit about this."
    },
    {
      "Time_Start": 84.0,
      "Time_End": 87.0,
      "Text": " This is the purpose of the presentation today."
    },
    {
      "Time_Start": 87.0,
      "Time_End": 95.0,
      "Text": " If you were here last year, you know, I stood up here and talked about all the patriotic things that we should be doing and what hackers are doing to us."
    },
    {
      "Time_Start": 96.0,
      "Time_End": 100.0,
      "Text": " My concern about the erosion of the infrastructure from the inside."
    },
    {
      "Time_Start": 100.0,
      "Time_End": 102.0,
      "Text": " I haven't changed those views."
    },
    {
      "Time_Start": 102.0,
      "Time_End": 109.0,
      "Text": " I still think that even many of you tell me that you're hacking to show me how to improve my business."
    },
    {
      "Time_Start": 109.0,
      "Time_End": 115.0,
      "Text": " I'll perhaps misguide it a little bit because when you're hitting the system that we're responsible for,"
    },
    {
      "Time_Start": 115.0,
      "Time_End": 118.0,
      "Text": " look around and look at each other because you're hitting each other."
    },
    {
      "Time_Start": 118.0,
      "Time_End": 125.0,
      "Text": " You know, you're the girl next door, the guy next door, your aunts, your uncles, your cousins because they're operating on those systems."
    },
    {
      "Time_Start": 125.0,
      "Time_End": 131.0,
      "Text": " So we looked at the past three years and what was causing a lot of our penetrations and so forth."
    },
    {
      "Time_Start": 131.0,
      "Time_End": 133.0,
      "Text": " I'm going to show you some real life stats."
    },
    {
      "Time_Start": 133.0,
      "Time_End": 141.0,
      "Text": " This is the first time I've been released on the incidences and intrusions that are going on in at least one department in the Department of Defense."
    },
    {
      "Time_Start": 141.0,
      "Time_End": 153.0,
      "Text": " We found out that a lot of this is caused by poor password management, no password management, redundant passwords across systems."
    },
    {
      "Time_Start": 153.0,
      "Time_End": 158.0,
      "Text": " And I appreciate the many speakers who have spoken over the last several days here."
    },
    {
      "Time_Start": 158.0,
      "Time_End": 166.0,
      "Text": " But I will tell you that our level of complexity is probably greater than General Motors."
    },
    {
      "Time_Start": 166.0,
      "Time_End": 171.0,
      "Text": " And I've seen, and I've worked with General Motors, they have a pretty robust system across the entire infrastructure"
    },
    {
      "Time_Start": 171.0,
      "Time_End": 177.0,
      "Text": " to include multiple contractors and subcontractors and suppliers and so forth."
    },
    {
      "Time_Start": 177.0,
      "Time_End": 184.0,
      "Text": " But they're very rigid and they're based on a very straight line philosophy and it's a bottom line."
    },
    {
      "Time_Start": 184.0,
      "Time_End": 188.0,
      "Text": " They're also working in environments where you have a lot of commonality in their structures."
    },
    {
      "Time_Start": 188.0,
      "Time_End": 192.0,
      "Text": " Unfortunately for the Department of Defense that cannot happen, that's by law."
    },
    {
      "Time_Start": 192.0,
      "Time_End": 197.0,
      "Text": " I cannot even be part of a discussion that says we ought to get nothing but Linux."
    },
    {
      "Time_Start": 197.0,
      "Time_End": 199.0,
      "Text": " Or we ought to get nothing but Unix."
    },
    {
      "Time_Start": 199.0,
      "Time_End": 201.0,
      "Text": " And it ought to be two dot something."
    },
    {
      "Time_Start": 201.0,
      "Time_End": 205.0,
      "Text": " By law I can't do that because that would interfere with free and open competition."
    },
    {
      "Time_Start": 205.0,
      "Time_End": 211.0,
      "Text": " I must advertise out there to say I need an automation capability that's XYZ."
    },
    {
      "Time_Start": 211.0,
      "Time_End": 214.0,
      "Text": " And we go with best practice, best price, etc."
    },
    {
      "Time_Start": 214.0,
      "Time_End": 216.0,
      "Text": " And we integrate that."
    },
    {
      "Time_Start": 216.0,
      "Time_End": 223.0,
      "Text": " The consequence of that is we end up with systems of systems that are at times not as interoperable as we'd like them to be."
    },
    {
      "Time_Start": 223.0,
      "Time_End": 228.0,
      "Text": " And certainly at times from a security perspective very contradictory to each other."
    },
    {
      "Time_Start": 228.0,
      "Time_End": 234.0,
      "Text": " So we try to find from an information assurance perspective a common thread that can overlay the entire infrastructure"
    },
    {
      "Time_Start": 234.0,
      "Time_End": 237.0,
      "Text": " to improve the security of access."
    },
    {
      "Time_Start": 237.0,
      "Time_End": 239.0,
      "Text": " So we looked at this."
    },
    {
      "Time_Start": 239.0,
      "Time_End": 244.0,
      "Text": " We were given a challenge some time ago to take a look at a technology under the IA umbrella"
    },
    {
      "Time_Start": 244.0,
      "Time_End": 246.0,
      "Text": " that would do a couple things for us."
    },
    {
      "Time_Start": 246.0,
      "Time_End": 250.0,
      "Text": " One, would give us a better reliance on identification and authentication."
    },
    {
      "Time_Start": 250.0,
      "Time_End": 257.0,
      "Text": " In other words, if I logged in, something in that process would say, without a doubt, that's Phil."
    },
    {
      "Time_Start": 257.0,
      "Time_End": 262.0,
      "Text": " That's not someone else that's captured his password and mimicking or his user ID."
    },
    {
      "Time_Start": 262.0,
      "Time_End": 265.0,
      "Text": " That's Phil and it can be proven."
    },
    {
      "Time_Start": 265.0,
      "Time_End": 271.0,
      "Text": " And then we wanted something that, and you can appreciate this if you've never served a day in the military"
    },
    {
      "Time_Start": 271.0,
      "Time_End": 274.0,
      "Text": " or watched one decent military movie."
    },
    {
      "Time_Start": 274.0,
      "Time_End": 280.0,
      "Text": " You can appreciate what our soldiers, sailors and airmen go through on a daily basis deployed at any given time."
    },
    {
      "Time_Start": 280.0,
      "Time_End": 286.0,
      "Text": " The last thing I want to give any of those young men and young women is another thing to memorize,"
    },
    {
      "Time_Start": 286.0,
      "Time_End": 291.0,
      "Text": " another thing to carry, another thing to take a chance at losing."
    },
    {
      "Time_Start": 291.0,
      "Time_End": 296.0,
      "Text": " Password, user IDs, tokens, pins, fall in that category."
    },
    {
      "Time_Start": 296.0,
      "Time_End": 299.0,
      "Text": " They're busy enough as it is."
    },
    {
      "Time_Start": 299.0,
      "Time_End": 301.0,
      "Text": " They're on the line."
    },
    {
      "Time_Start": 301.0,
      "Time_End": 304.0,
      "Text": " So we want to make their lives easier."
    },
    {
      "Time_Start": 304.0,
      "Time_End": 307.0,
      "Text": " Now, that understood, also understood in this."
    },
    {
      "Time_Start": 307.0,
      "Time_End": 313.0,
      "Text": " Unlike corporate America, when we deploy, and we are deployed on your behalf in 70 to 80 countries"
    },
    {
      "Time_Start": 313.0,
      "Time_End": 319.0,
      "Text": " at any given time, any given day, any given week of the year."
    },
    {
      "Time_Start": 319.0,
      "Time_End": 324.0,
      "Text": " When we deploy for our command and control, and that means we're able to reach out, touch Dick and Jane,"
    },
    {
      "Time_Start": 324.0,
      "Time_End": 327.0,
      "Text": " make sure they're still there, make sure they're still safe,"
    },
    {
      "Time_Start": 327.0,
      "Time_End": 330.0,
      "Text": " make sure they can still eat, still defend, still communicate,"
    },
    {
      "Time_Start": 330.0,
      "Time_End": 335.0,
      "Text": " we turn on their systems and we do not turn them off until the end of that mission."
    },
    {
      "Time_Start": 335.0,
      "Time_End": 338.0,
      "Text": " A lot of people come through the process."
    },
    {
      "Time_Start": 338.0,
      "Time_End": 343.0,
      "Text": " Obviously, we don't ask any of our war fighters to stay up 24 hours a day, seven days a week."
    },
    {
      "Time_Start": 343.0,
      "Time_End": 346.0,
      "Text": " We do run shifts out there."
    },
    {
      "Time_Start": 346.0,
      "Time_End": 352.0,
      "Text": " So how do you maintain the integrity of your system, positive, definite identification,"
    },
    {
      "Time_Start": 352.0,
      "Time_End": 357.0,
      "Text": " so it's not a bad person on that system, and still maintain continuity of operation?"
    },
    {
      "Time_Start": 357.0,
      "Time_End": 359.0,
      "Text": " Those are big challenges."
    },
    {
      "Time_Start": 359.0,
      "Time_End": 362.0,
      "Text": " And I appreciate all the things that I've heard about many speakers here."
    },
    {
      "Time_Start": 362.0,
      "Time_End": 366.0,
      "Text": " But the truth of the matter is, we're not there yet."
    },
    {
      "Time_Start": 366.0,
      "Time_End": 370.0,
      "Text": " This is why we looked at biometrics, to try to help us solve a lot of those problems."
    },
    {
      "Time_Start": 370.0,
      "Time_End": 375.0,
      "Text": " Now, I will tell you, being a security geek, like many of you all in here,"
    },
    {
      "Time_Start": 375.0,
      "Time_End": 379.0,
      "Text": " I am not going to tell you today that biometrics is a security solution,"
    },
    {
      "Time_Start": 379.0,
      "Time_End": 381.0,
      "Text": " because I'm not convinced that it is."
    },
    {
      "Time_Start": 381.0,
      "Time_End": 388.0,
      "Text": " But it should be better, certainly better, than using your mom's name as a password into a system."
    },
    {
      "Time_Start": 388.0,
      "Time_End": 390.0,
      "Text": " There's no question about that."
    },
    {
      "Time_Start": 390.0,
      "Time_End": 396.0,
      "Text": " So let me take you through about the 60,000 foot level of what we're trying to do and why."
    },
    {
      "Time_Start": 396.0,
      "Time_End": 398.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 398.0,
      "Time_End": 404.0,
      "Text": " These here are a little bit of war stories that were caused by hopefully no one here in the audience,"
    },
    {
      "Time_Start": 404.0,
      "Time_End": 408.0,
      "Text": " but I'm going to go through some of these things because this is a threat that we look at."
    },
    {
      "Time_Start": 408.0,
      "Time_End": 411.0,
      "Text": " Of course, there's some up here today, all unclassified."
    },
    {
      "Time_Start": 411.0,
      "Time_End": 413.0,
      "Text": " I'm not going to talk anything classified at all."
    },
    {
      "Time_Start": 413.0,
      "Time_End": 421.0,
      "Text": " I will tell you that if you want to find a belly button that contributed to the Attorney General's swing"
    },
    {
      "Time_Start": 421.0,
      "Time_End": 431.0,
      "Text": " on changing laws for hackers and crackers and freakers and general people going to mess up the infrastructure"
    },
    {
      "Time_Start": 431.0,
      "Time_End": 433.0,
      "Text": " in places they don't want to."
    },
    {
      "Time_Start": 433.0,
      "Time_End": 437.0,
      "Text": " It occurred, quite frankly, take a look at the swastika up there."
    },
    {
      "Time_Start": 437.0,
      "Time_End": 441.0,
      "Text": " That was the Attorney General's homepage."
    },
    {
      "Time_Start": 441.0,
      "Time_End": 446.0,
      "Text": " Now, I've been privileged because I've traveled with her and she is absolutely a super, super lady."
    },
    {
      "Time_Start": 446.0,
      "Time_End": 449.0,
      "Text": " I've never met a better stand-up American, I assure you."
    },
    {
      "Time_Start": 449.0,
      "Time_End": 453.0,
      "Text": " She is dedicated to the country like no one's business."
    },
    {
      "Time_Start": 453.0,
      "Time_End": 457.0,
      "Text": " She took this as a personal attack."
    },
    {
      "Time_Start": 457.0,
      "Time_End": 463.0,
      "Text": " Now, if you've not seen this, it's archived and you all know where to go when all the pages get archived."
    },
    {
      "Time_Start": 463.0,
      "Time_End": 470.0,
      "Text": " This one here was kind of an affront to any American because someone here totally rewrote the Constitution."
    },
    {
      "Time_Start": 470.0,
      "Time_End": 474.0,
      "Text": " Rewrote the First, Fourth, Fifth Amendment and a bunch of other stuff."
    },
    {
      "Time_Start": 474.0,
      "Time_End": 481.0,
      "Text": " The Assistant Administrator who was on duty at that time, because this was displayed for about 72 hours,"
    },
    {
      "Time_Start": 481.0,
      "Time_End": 485.0,
      "Text": " long weekend, didn't survive past Tuesday in Understandably Correct."
    },
    {
      "Time_Start": 485.0,
      "Time_End": 490.0,
      "Text": " My understanding is the new Assistant Administrator is a nice guy."
    },
    {
      "Time_Start": 491.0,
      "Time_End": 495.0,
      "Text": " The map up here, you see Texas and India."
    },
    {
      "Time_Start": 495.0,
      "Time_End": 498.0,
      "Text": " You guys remember a fellow by the name of Tech Nine?"
    },
    {
      "Time_Start": 498.0,
      "Time_End": 501.0,
      "Text": " At the time, 15 years old, got a lot of credit for this hack."
    },
    {
      "Time_Start": 501.0,
      "Time_End": 506.0,
      "Text": " Was upset about all the loop testing going on in that part of the world."
    },
    {
      "Time_Start": 506.0,
      "Time_End": 509.0,
      "Text": " Well, maybe the rest of the story you don't know."
    },
    {
      "Time_Start": 509.0,
      "Time_End": 517.0,
      "Text": " From an international incident perspective, Tech Nine caused us, the U.S. Army,"
    },
    {
      "Time_Start": 517.0,
      "Time_End": 522.0,
      "Text": " it looked like we had launched an attack on both India and Afghanistan."
    },
    {
      "Time_Start": 522.0,
      "Time_End": 524.0,
      "Text": " And how could that be?"
    },
    {
      "Time_Start": 524.0,
      "Time_End": 525.0,
      "Text": " We're not in that business."
    },
    {
      "Time_Start": 525.0,
      "Time_End": 529.0,
      "Text": " We don't attack nations from a computer basis."
    },
    {
      "Time_Start": 529.0,
      "Time_End": 534.0,
      "Text": " But what happened is one of the servers in San Antonio, Texas,"
    },
    {
      "Time_Start": 534.0,
      "Time_End": 538.0,
      "Text": " home to the U.S. Army's medical command, had been captured."
    },
    {
      "Time_Start": 538.0,
      "Time_End": 544.0,
      "Text": " Tech Nine used that server to launch all those attacks to those particular two countries."
    },
    {
      "Time_Start": 544.0,
      "Time_End": 547.0,
      "Text": " From the distant end, it certainly looked like we had, in the U.S. Army,"
    },
    {
      "Time_Start": 547.0,
      "Time_End": 552.0,
      "Text": " some of the baddest dentists in the world when it came to cyber attack."
    },
    {
      "Time_Start": 554.0,
      "Time_End": 560.0,
      "Text": " By the way, the only thing that server had on there was thousands of dental records for our service people."
    },
    {
      "Time_Start": 564.0,
      "Time_End": 568.0,
      "Text": " We work with banks and industry now a lot closer than we ever have,"
    },
    {
      "Time_Start": 568.0,
      "Time_End": 571.0,
      "Text": " so we're able to see what's happening in that business as well."
    },
    {
      "Time_Start": 571.0,
      "Time_End": 575.0,
      "Text": " Credit card fraud, bill exploitation, and so forth."
    },
    {
      "Time_Start": 575.0,
      "Time_End": 578.0,
      "Text": " We're very concerned about what goes on there."
    },
    {
      "Time_Start": 578.0,
      "Time_End": 584.0,
      "Text": " We don't do a whole lot in that area, but I will tell you the reason we're into that area,"
    },
    {
      "Time_Start": 584.0,
      "Time_End": 588.0,
      "Text": " into the commercial world, working with Visa, Massive Charge, AT&T,"
    },
    {
      "Time_Start": 588.0,
      "Time_End": 591.0,
      "Text": " is because the same equipment they have, we have."
    },
    {
      "Time_Start": 591.0,
      "Time_End": 596.0,
      "Text": " The same problems we have, if it's a crap operating system, guess what?"
    },
    {
      "Time_Start": 596.0,
      "Time_End": 597.0,
      "Text": " We bought it too."
    },
    {
      "Time_Start": 597.0,
      "Time_End": 599.0,
      "Text": " If it's got holes, guess what?"
    },
    {
      "Time_Start": 599.0,
      "Time_End": 600.0,
      "Text": " We got it as well."
    },
    {
      "Time_Start": 600.0,
      "Time_End": 606.0,
      "Text": " So we have teamed with some of the brightest and best minds out there in industry"
    },
    {
      "Time_Start": 606.0,
      "Time_End": 609.0,
      "Text": " to fix it on a mutual perspective."
    },
    {
      "Time_Start": 609.0,
      "Time_End": 611.0,
      "Text": " And it's working well for us."
    },
    {
      "Time_Start": 614.0,
      "Time_End": 615.0,
      "Text": " First time ever."
    },
    {
      "Time_Start": 615.0,
      "Time_End": 619.0,
      "Text": " This is what it looks like from one of the services in the Department of Defense."
    },
    {
      "Time_Start": 619.0,
      "Time_End": 622.0,
      "Text": " FY, by the way, stands for a year."
    },
    {
      "Time_Start": 622.0,
      "Time_End": 627.0,
      "Text": " So you see 97, 98, 99, and the current FY, 2000."
    },
    {
      "Time_Start": 627.0,
      "Time_End": 630.0,
      "Text": " Incidences to tolls by color code."
    },
    {
      "Time_Start": 630.0,
      "Time_End": 634.0,
      "Text": " Now I may look to you at first shot if you look at the incidences and number of intrusions."
    },
    {
      "Time_Start": 634.0,
      "Time_End": 638.0,
      "Text": " And by the way, we classify an intrusion as someone actually got into our system,"
    },
    {
      "Time_Start": 638.0,
      "Time_End": 640.0,
      "Text": " mucked around, caused some damage."
    },
    {
      "Time_Start": 640.0,
      "Time_End": 643.0,
      "Text": " The other thing you ought to know is we also catch you."
    },
    {
      "Time_Start": 643.0,
      "Time_End": 646.0,
      "Text": " So we're getting much, much better at that as well."
    },
    {
      "Time_Start": 646.0,
      "Time_End": 650.0,
      "Text": " It may look to you like we're increasing or the threat is getting worse"
    },
    {
      "Time_Start": 650.0,
      "Time_End": 652.0,
      "Text": " or the attacks are getting worse."
    },
    {
      "Time_Start": 652.0,
      "Time_End": 655.0,
      "Text": " Well, I personally believe that's not the case."
    },
    {
      "Time_Start": 655.0,
      "Time_End": 658.0,
      "Text": " I believe we're just getting better at detecting."
    },
    {
      "Time_Start": 658.0,
      "Time_End": 662.0,
      "Text": " We have layer upon layer of detection capability out there now."
    },
    {
      "Time_Start": 662.0,
      "Time_End": 667.0,
      "Text": " And we're doing some significant technology advancements in the areas of data reduction"
    },
    {
      "Time_Start": 667.0,
      "Time_End": 672.0,
      "Text": " and data correlation across multitude of sensors."
    },
    {
      "Time_Start": 672.0,
      "Time_End": 675.0,
      "Text": " Who would have ever thought that HP OpenView would be a security sensor?"
    },
    {
      "Time_Start": 675.0,
      "Time_End": 679.0,
      "Text": " It is when you marry it up with Tivoli, when you marry it up with RealSecure,"
    },
    {
      "Time_Start": 680.0,
      "Time_End": 685.0,
      "Text": " when you marry it up with Accent and a few other tools that we developed on the side."
    },
    {
      "Time_Start": 685.0,
      "Time_End": 688.0,
      "Text": " So we're using all these sensors, bringing them all together,"
    },
    {
      "Time_Start": 688.0,
      "Time_End": 695.0,
      "Text": " and we're able now to look at indications, not just one box or one state or one part of the world,"
    },
    {
      "Time_Start": 695.0,
      "Time_End": 698.0,
      "Text": " but collectively, and that's helping us a lot."
    },
    {
      "Time_Start": 698.0,
      "Time_End": 701.0,
      "Text": " And quite frankly, we did it with the help of industry and many of you in this room,"
    },
    {
      "Time_Start": 701.0,
      "Time_End": 704.0,
      "Text": " which I know personally have been instrumental in making that happen."
    },
    {
      "Time_Start": 704.0,
      "Time_End": 706.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 706.0,
      "Time_End": 712.0,
      "Text": " Let's talk a little bit about still in the war story category of things that recently happened."
    },
    {
      "Time_Start": 712.0,
      "Time_End": 715.0,
      "Text": " Now, most of you, I'm sure, are aware of these things,"
    },
    {
      "Time_Start": 715.0,
      "Time_End": 721.0,
      "Text": " but you may not be aware of the final outcome when it comes to the identification of cost"
    },
    {
      "Time_Start": 721.0,
      "Time_End": 726.0,
      "Text": " against some of these events and some of these well-publicized incidences."
    },
    {
      "Time_Start": 726.0,
      "Time_End": 731.0,
      "Text": " Yahoo, 45 million web pages hit."
    },
    {
      "Time_Start": 731.0,
      "Time_End": 732.0,
      "Text": " Now, why would we care?"
    },
    {
      "Time_Start": 732.0,
      "Time_End": 735.0,
      "Text": " Why would the Department of Defense, Department of Army care what's happening in Yahoo?"
    },
    {
      "Time_Start": 735.0,
      "Time_End": 736.0,
      "Text": " Well, guess what?"
    },
    {
      "Time_Start": 736.0,
      "Time_End": 738.0,
      "Text": " We're a customer of that like everybody else."
    },
    {
      "Time_Start": 738.0,
      "Time_End": 744.0,
      "Text": " And we care about it because we're web-based from a command and control perspective as well."
    },
    {
      "Time_Start": 744.0,
      "Time_End": 746.0,
      "Text": " It's not something you just use on the commercial world."
    },
    {
      "Time_Start": 746.0,
      "Time_End": 749.0,
      "Text": " We use it for management of our business as well."
    },
    {
      "Time_Start": 749.0,
      "Time_End": 752.0,
      "Text": " A gigabit at a time incoming."
    },
    {
      "Time_Start": 752.0,
      "Time_End": 755.0,
      "Text": " What a denial of service that was."
    },
    {
      "Time_Start": 755.0,
      "Time_End": 756.0,
      "Text": " FBI mobilized?"
    },
    {
      "Time_Start": 756.0,
      "Time_End": 758.0,
      "Text": " You bet."
    },
    {
      "Time_Start": 759.0,
      "Time_End": 764.0,
      "Text": " On the government side, if you remember President Clinton's PDD-63,"
    },
    {
      "Time_Start": 764.0,
      "Time_End": 768.0,
      "Text": " where he stood up the critical infrastructure protection,"
    },
    {
      "Time_Start": 768.0,
      "Time_End": 771.0,
      "Text": " FBI automatically becomes involved."
    },
    {
      "Time_Start": 771.0,
      "Time_End": 774.0,
      "Text": " Seventeen offices were mobilized."
    },
    {
      "Time_Start": 774.0,
      "Time_End": 780.0,
      "Text": " Yahoo lost millions, and it also caused a ripple through the continuum of operation"
    },
    {
      "Time_Start": 780.0,
      "Time_End": 783.0,
      "Text": " on some of our bigger service providers out there."
    },
    {
      "Time_Start": 783.0,
      "Time_End": 784.0,
      "Text": " We worry about that."
    },
    {
      "Time_Start": 784.0,
      "Time_End": 785.0,
      "Text": " Little mafia boy."
    },
    {
      "Time_Start": 785.0,
      "Time_End": 787.0,
      "Text": " A lot of press."
    },
    {
      "Time_Start": 787.0,
      "Time_End": 789.0,
      "Text": " Was going to be convicted, wasn't going to be convicted."
    },
    {
      "Time_Start": 789.0,
      "Time_End": 792.0,
      "Text": " Finally was."
    },
    {
      "Time_Start": 792.0,
      "Time_End": 793.0,
      "Text": " A couple years in jail."
    },
    {
      "Time_Start": 793.0,
      "Time_End": 795.0,
      "Text": " A little bitty fine."
    },
    {
      "Time_Start": 795.0,
      "Time_End": 799.0,
      "Text": " But that was a rude awakening for this particular kind of attack."
    },
    {
      "Time_Start": 799.0,
      "Time_End": 800.0,
      "Text": " We worry about these things."
    },
    {
      "Time_Start": 800.0,
      "Time_End": 802.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 802.0,
      "Time_End": 806.0,
      "Text": " I love you virus."
    },
    {
      "Time_Start": 806.0,
      "Time_End": 811.0,
      "Text": " I got here with that on my own box of work."
    },
    {
      "Time_Start": 811.0,
      "Time_End": 815.0,
      "Text": " I opened it up."
    },
    {
      "Time_Start": 815.0,
      "Time_End": 820.0,
      "Text": " I passed it on."
    },
    {
      "Time_Start": 820.0,
      "Time_End": 822.0,
      "Text": " And I wasn't fired."
    },
    {
      "Time_Start": 822.0,
      "Time_End": 826.0,
      "Text": " In fact, they gave me biometrics and said make it work."
    },
    {
      "Time_Start": 826.0,
      "Time_End": 829.0,
      "Text": " But the impact here."
    },
    {
      "Time_Start": 829.0,
      "Time_End": 833.0,
      "Text": " I contend that we are now in the era of super viruses."
    },
    {
      "Time_Start": 833.0,
      "Time_End": 835.0,
      "Text": " I really believe that."
    },
    {
      "Time_Start": 836.0,
      "Time_End": 841.0,
      "Text": " And if this one here wasn't a wake-up call that said you have made the grade,"
    },
    {
      "Time_Start": 841.0,
      "Time_End": 843.0,
      "Text": " then I don't know what else."
    },
    {
      "Time_Start": 843.0,
      "Time_End": 848.0,
      "Text": " This combined a lot of really interesting things in a combined package."
    },
    {
      "Time_Start": 848.0,
      "Time_End": 851.0,
      "Text": " There have been a lot of copycats, a lot of add-ons since then,"
    },
    {
      "Time_Start": 851.0,
      "Time_End": 855.0,
      "Text": " but not to the damage and not to the level that this particular attack was."
    },
    {
      "Time_Start": 855.0,
      "Time_End": 858.0,
      "Text": " Look at the dollar figure on this."
    },
    {
      "Time_Start": 858.0,
      "Time_End": 860.0,
      "Text": " This is not your Saturday allowance here."
    },
    {
      "Time_Start": 860.0,
      "Time_End": 862.0,
      "Text": " Ten billion dollars."
    },
    {
      "Time_Start": 862.0,
      "Time_End": 863.0,
      "Text": " And that's not exaggerated."
    },
    {
      "Time_Start": 863.0,
      "Time_End": 866.0,
      "Text": " I think it's underestimated, actually."
    },
    {
      "Time_Start": 866.0,
      "Time_End": 868.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 868.0,
      "Time_End": 872.0,
      "Text": " Now, counter-hacking programs are something we're always interested in."
    },
    {
      "Time_Start": 872.0,
      "Time_End": 876.0,
      "Text": " This is the ultimate counter-hacking program out of China."
    },
    {
      "Time_Start": 876.0,
      "Time_End": 879.0,
      "Text": " You hack in that country, they line you up and shoot you."
    },
    {
      "Time_Start": 879.0,
      "Time_End": 883.0,
      "Text": " I am not saying that's what we ought to do in the United States."
    },
    {
      "Time_Start": 883.0,
      "Time_End": 886.0,
      "Text": " But we're not the only ones now that are very concerned about hacking."
    },
    {
      "Time_Start": 886.0,
      "Time_End": 888.0,
      "Text": " And the sad thing about this case, if you read the details,"
    },
    {
      "Time_Start": 888.0,
      "Time_End": 891.0,
      "Text": " these fellows never even enjoyed one single penny."
    },
    {
      "Time_Start": 891.0,
      "Time_End": 894.0,
      "Text": " They moved it from one column to the next."
    },
    {
      "Time_Start": 894.0,
      "Time_End": 897.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 897.0,
      "Time_End": 902.0,
      "Text": " I mentioned the commonality in some of the justifications for moving out of biometrics,"
    },
    {
      "Time_Start": 902.0,
      "Time_End": 905.0,
      "Text": " and it is based on the weakest link."
    },
    {
      "Time_Start": 905.0,
      "Time_End": 909.0,
      "Text": " Quite frankly, it's embarrassing to me to have to report to my leadership"
    },
    {
      "Time_Start": 909.0,
      "Time_End": 911.0,
      "Text": " as to why a system was broken into,"
    },
    {
      "Time_Start": 911.0,
      "Time_End": 916.0,
      "Text": " especially when it's something as easy to fix as a password file."
    },
    {
      "Time_Start": 916.0,
      "Time_End": 918.0,
      "Text": " And you may be thinking out there, well, why the hell don't you do that?"
    },
    {
      "Time_Start": 918.0,
      "Time_End": 921.0,
      "Text": " You live in an organization where you can issue an order,"
    },
    {
      "Time_Start": 921.0,
      "Time_End": 923.0,
      "Text": " and everybody has to obey it or not."
    },
    {
      "Time_Start": 923.0,
      "Time_End": 925.0,
      "Text": " Or if they don't, they're in trouble."
    },
    {
      "Time_Start": 925.0,
      "Time_End": 930.0,
      "Text": " Well, imagine, I don't know how many computers you guys work on."
    },
    {
      "Time_Start": 930.0,
      "Time_End": 935.0,
      "Text": " I'm into seven separate systems myself as a manager."
    },
    {
      "Time_Start": 935.0,
      "Time_End": 940.0,
      "Text": " My rules that I have to comply with, the policy in my particular service,"
    },
    {
      "Time_Start": 940.0,
      "Time_End": 945.0,
      "Text": " is that each password must be eight-digit, alphanumeric, randomly generated."
    },
    {
      "Time_Start": 945.0,
      "Time_End": 948.0,
      "Text": " Do not write it down anywhere."
    },
    {
      "Time_Start": 948.0,
      "Time_End": 951.0,
      "Text": " I've got a pretty good memory,"
    },
    {
      "Time_Start": 951.0,
      "Time_End": 954.0,
      "Text": " but I've got to tell you it becomes a challenge after the fourth password,"
    },
    {
      "Time_Start": 954.0,
      "Time_End": 957.0,
      "Text": " especially if I'm not in there on a regular basis."
    },
    {
      "Time_Start": 957.0,
      "Time_End": 961.0,
      "Text": " That's about the level and number of passwords our soldiers"
    },
    {
      "Time_Start": 961.0,
      "Time_End": 964.0,
      "Text": " and our civilians are expected to memorize."
    },
    {
      "Time_Start": 964.0,
      "Time_End": 965.0,
      "Text": " Quite a challenge."
    },
    {
      "Time_Start": 965.0,
      "Time_End": 969.0,
      "Text": " So therefore, is it a big reason why people might cheat on that construct"
    },
    {
      "Time_Start": 969.0,
      "Time_End": 971.0,
      "Text": " or against that policy?"
    },
    {
      "Time_Start": 971.0,
      "Time_End": 973.0,
      "Text": " Well, if you've ever been in that environment,"
    },
    {
      "Time_Start": 973.0,
      "Time_End": 975.0,
      "Text": " the answer is obviously no."
    },
    {
      "Time_Start": 975.0,
      "Time_End": 979.0,
      "Text": " So one of the biggest weaknesses that we have, obviously, is passwords."
    },
    {
      "Time_Start": 979.0,
      "Time_End": 982.0,
      "Text": " So I'm briefing this to the secretary, the undersecretary,"
    },
    {
      "Time_Start": 982.0,
      "Time_End": 983.0,
      "Text": " and he looks at me and says,"
    },
    {
      "Time_Start": 983.0,
      "Time_End": 987.0,
      "Text": " well, duh, replace passwords."
    },
    {
      "Time_Start": 987.0,
      "Time_End": 988.0,
      "Text": " I'm going, well, wait a minute."
    },
    {
      "Time_Start": 988.0,
      "Time_End": 992.0,
      "Text": " Now, we built the infrastructure based on heavy metal,"
    },
    {
      "Time_Start": 992.0,
      "Time_End": 993.0,
      "Text": " mainframe kind of stuff."
    },
    {
      "Time_Start": 993.0,
      "Time_End": 996.0,
      "Text": " We brought it forward as we went decentralized desktop,"
    },
    {
      "Time_Start": 996.0,
      "Time_End": 1000.0,
      "Text": " and we'll never change the security access login architecture."
    },
    {
      "Time_Start": 1000.0,
      "Time_End": 1001.0,
      "Text": " We just brought it forward."
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1004.0,
      "Text": " We're still treating very smart terminals like dump terminals"
    },
    {
      "Time_Start": 1004.0,
      "Time_End": 1007.0,
      "Text": " that we think are connected directly to our frame."
    },
    {
      "Time_Start": 1007.0,
      "Time_End": 1010.0,
      "Text": " So there's a real cultural change that has to occur here"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1013.0,
      "Text": " in a technology chase as well."
    },
    {
      "Time_Start": 1013.0,
      "Time_End": 1017.0,
      "Text": " This, I think, will be one of the greatest challenges in technologies"
    },
    {
      "Time_Start": 1017.0,
      "Time_End": 1021.0,
      "Text": " from an information assurance perspective as far as the department is concerned."
    },
    {
      "Time_Start": 1021.0,
      "Time_End": 1024.0,
      "Text": " And I will tell you also, in addition to all of my other jobs,"
    },
    {
      "Time_Start": 1024.0,
      "Time_End": 1028.0,
      "Text": " I now chair the Federal Committee for Biometrics."
    },
    {
      "Time_Start": 1028.0,
      "Time_End": 1030.0,
      "Text": " So we're not just talking Department of the Army anymore,"
    },
    {
      "Time_Start": 1030.0,
      "Time_End": 1031.0,
      "Text": " Department of Defense."
    },
    {
      "Time_Start": 1031.0,
      "Time_End": 1034.0,
      "Text": " We're talking across the government."
    },
    {
      "Time_Start": 1034.0,
      "Time_End": 1036.0,
      "Text": " Next chart, please."
    },
    {
      "Time_Start": 1036.0,
      "Time_End": 1038.0,
      "Text": " What is biometrics?"
    },
    {
      "Time_Start": 1038.0,
      "Time_End": 1041.0,
      "Text": " Well, I'm sure this group here, if any group I've ever spoken to,"
    },
    {
      "Time_Start": 1041.0,
      "Time_End": 1044.0,
      "Text": " probably understands it probably even better than I do."
    },
    {
      "Time_Start": 1044.0,
      "Time_End": 1047.0,
      "Text": " But I nonetheless got to put a little tutorial chart up here"
    },
    {
      "Time_Start": 1047.0,
      "Time_End": 1049.0,
      "Text": " to get everybody on the same baseline."
    },
    {
      "Time_Start": 1049.0,
      "Time_End": 1052.0,
      "Text": " Now, the pictures I put around here are the biometrics technologies"
    },
    {
      "Time_Start": 1052.0,
      "Time_End": 1055.0,
      "Text": " that I think are the most mature in the technologies"
    },
    {
      "Time_Start": 1055.0,
      "Time_End": 1058.0,
      "Text": " that we're currently chasing in a sense of test and evaluation,"
    },
    {
      "Time_Start": 1058.0,
      "Time_End": 1062.0,
      "Text": " possible procurement, possible integration, and confined pilots."
    },
    {
      "Time_Start": 1062.0,
      "Time_End": 1065.0,
      "Text": " And I'll talk to pilots on that as well."
    },
    {
      "Time_Start": 1065.0,
      "Time_End": 1069.0,
      "Text": " From the upper left-hand corner around, I'll just take you for a quick tour."
    },
    {
      "Time_Start": 1069.0,
      "Time_End": 1073.0,
      "Text": " What I personally believe to be the most mature biometrics capability today,"
    },
    {
      "Time_Start": 1073.0,
      "Time_End": 1077.0,
      "Text": " whether it be for IT access or for physical access"
    },
    {
      "Time_Start": 1077.0,
      "Time_End": 1081.0,
      "Text": " or for what we're trying to do with the National Security Council"
    },
    {
      "Time_Start": 1081.0,
      "Time_End": 1084.0,
      "Text": " to put on handguns so kids quit killing kids,"
    },
    {
      "Time_Start": 1084.0,
      "Time_End": 1088.0,
      "Text": " we think it's related around fingerprints."
    },
    {
      "Time_Start": 1088.0,
      "Time_End": 1092.0,
      "Text": " It's been around for about 25 years, believe it or not."
    },
    {
      "Time_Start": 1092.0,
      "Time_End": 1095.0,
      "Text": " It's not been around to be used as a security device."
    },
    {
      "Time_Start": 1095.0,
      "Time_End": 1098.0,
      "Text": " It's been around to be used as an identification device,"
    },
    {
      "Time_Start": 1098.0,
      "Time_End": 1102.0,
      "Text": " predominantly by a little organization with the letters FBI."
    },
    {
      "Time_Start": 1102.0,
      "Time_End": 1105.0,
      "Text": " The next one down is signature."
    },
    {
      "Time_Start": 1105.0,
      "Time_End": 1107.0,
      "Text": " Everybody signs their name differently."
    },
    {
      "Time_Start": 1107.0,
      "Time_End": 1112.0,
      "Text": " The best forgers in the world cannot replicate this biometric trait."
    },
    {
      "Time_Start": 1112.0,
      "Time_End": 1117.0,
      "Text": " Facial recognition, iris scan, veins."
    },
    {
      "Time_Start": 1117.0,
      "Time_End": 1120.0,
      "Text": " Did you all know your veins on your wrists and your hands are uniquely yours?"
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1124.0,
      "Text": " And we can identify that to you and only you."
    },
    {
      "Time_Start": 1124.0,
      "Time_End": 1126.0,
      "Text": " No one else can replicate that."
    },
    {
      "Time_Start": 1126.0,
      "Time_End": 1128.0,
      "Text": " DNA, of course."
    },
    {
      "Time_Start": 1128.0,
      "Time_End": 1131.0,
      "Text": " Hand geometry."
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1134.0,
      "Text": " Now you'll notice I didn't mention rectum scan."
    },
    {
      "Time_Start": 1134.0,
      "Time_End": 1137.0,
      "Text": " That would be a tough thing to back into anyway, wouldn't it?"
    },
    {
      "Time_Start": 1140.0,
      "Time_End": 1142.0,
      "Text": " Those are the things we're looking at."
    },
    {
      "Time_Start": 1142.0,
      "Time_End": 1147.0,
      "Text": " Those are the technology, functional areas that we think have the best capability"
    },
    {
      "Time_Start": 1147.0,
      "Time_End": 1152.0,
      "Text": " and success or fundamental to succeed, if you will."
    },
    {
      "Time_Start": 1152.0,
      "Time_End": 1154.0,
      "Text": " Next chart, please."
    },
    {
      "Time_Start": 1154.0,
      "Time_End": 1156.0,
      "Text": " Why will I talk to that?"
    },
    {
      "Time_Start": 1156.0,
      "Time_End": 1160.0,
      "Text": " Just to recap the necessity."
    },
    {
      "Time_Start": 1160.0,
      "Time_End": 1162.0,
      "Text": " Multitude of systems."
    },
    {
      "Time_Start": 1162.0,
      "Time_End": 1165.0,
      "Text": " Across a systems of systems environment."
    },
    {
      "Time_Start": 1165.0,
      "Time_End": 1171.0,
      "Text": " Password, ID user is a prime access mechanism."
    },
    {
      "Time_Start": 1171.0,
      "Time_End": 1174.0,
      "Text": " And here you go on the bottom."
    },
    {
      "Time_Start": 1174.0,
      "Time_End": 1177.0,
      "Text": " You forget them, you lose them, etc., etc."
    },
    {
      "Time_Start": 1177.0,
      "Time_End": 1179.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 1179.0,
      "Time_End": 1181.0,
      "Text": " Now where do I get my authority?"
    },
    {
      "Time_Start": 1181.0,
      "Time_End": 1183.0,
      "Text": " I didn't just wake up one day and say I'm going to do this."
    },
    {
      "Time_Start": 1183.0,
      "Time_End": 1188.0,
      "Text": " I will tell you that the Congress is very concerned about the security of our systems."
    },
    {
      "Time_Start": 1188.0,
      "Time_End": 1193.0,
      "Text": " They're very concerned about finding the right solutions."
    },
    {
      "Time_Start": 1193.0,
      "Time_End": 1198.0,
      "Text": " And in this year's defense appropriation bill, this is where we got our tasking to march out."
    },
    {
      "Time_Start": 1198.0,
      "Time_End": 1202.0,
      "Text": " And if you look at the wording in here, I know it's hard to read,"
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1204.0,
      "Text": " so I'll just point out a couple things."
    },
    {
      "Time_Start": 1204.0,
      "Time_End": 1208.0,
      "Text": " We were tasked by the Congress, the 106, the one in current session right now,"
    },
    {
      "Time_Start": 1208.0,
      "Time_End": 1214.0,
      "Text": " to combine activities of biometric sensors in templates, develop a repository,"
    },
    {
      "Time_Start": 1214.0,
      "Time_End": 1217.0,
      "Text": " pursue biometrics security technology,"
    },
    {
      "Time_Start": 1217.0,
      "Time_End": 1223.0,
      "Text": " and you will see in the context of this they're looking at it from an information assurance perspective."
    },
    {
      "Time_Start": 1223.0,
      "Time_End": 1225.0,
      "Text": " And that's the way we first started out."
    },
    {
      "Time_Start": 1225.0,
      "Time_End": 1231.0,
      "Text": " In fact, last October when we started hearing that Congress was going to ask us to do that,"
    },
    {
      "Time_Start": 1231.0,
      "Time_End": 1234.0,
      "Text": " it was IA-centric."
    },
    {
      "Time_Start": 1234.0,
      "Time_End": 1237.0,
      "Text": " In a short period of almost less than a year,"
    },
    {
      "Time_Start": 1237.0,
      "Time_End": 1241.0,
      "Text": " we found out that IA is a big customer of biometrics,"
    },
    {
      "Time_Start": 1241.0,
      "Time_End": 1244.0,
      "Text": " and they're just greater than IA."
    },
    {
      "Time_Start": 1244.0,
      "Time_End": 1247.0,
      "Text": " Next chart, please."
    },
    {
      "Time_Start": 1247.0,
      "Time_End": 1253.0,
      "Text": " This was first supplemented a few months ago,"
    },
    {
      "Time_Start": 1253.0,
      "Time_End": 1258.0,
      "Text": " and I've got definitely three mission statements to do here."
    },
    {
      "Time_Start": 1258.0,
      "Time_End": 1262.0,
      "Text": " One was to go out and manage T&E, stands for test and evaluation,"
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1265.0,
      "Text": " of COTS biometric software and hardware."
    },
    {
      "Time_Start": 1265.0,
      "Time_End": 1269.0,
      "Text": " And that is now my marching order is to go out there to industry"
    },
    {
      "Time_Start": 1269.0,
      "Time_End": 1273.0,
      "Text": " and interface with the providers of biometrics application"
    },
    {
      "Time_Start": 1273.0,
      "Time_End": 1276.0,
      "Text": " and start bringing those things under laboratory control"
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1281.0,
      "Text": " and test and evaluate these things for not only for what they're advertised to do,"
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1286.0,
      "Text": " but how they may be best integrated and sustained in our systems-to-systems environment,"
    },
    {
      "Time_Start": 1286.0,
      "Time_End": 1288.0,
      "Text": " and not just in IT."
    },
    {
      "Time_Start": 1288.0,
      "Time_End": 1294.0,
      "Text": " Because if I just do IT, the major French here can't satisfy the information assurance requirements she has"
    },
    {
      "Time_Start": 1294.0,
      "Time_End": 1297.0,
      "Text": " in her weapon systems and her tactical deployments as well."
    },
    {
      "Time_Start": 1297.0,
      "Time_End": 1300.0,
      "Text": " So across the spectrum."
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1303.0,
      "Text": " I was also asked to define requirements on equipment."
    },
    {
      "Time_Start": 1303.0,
      "Time_End": 1305.0,
      "Text": " This is a big one."
    },
    {
      "Time_Start": 1305.0,
      "Time_End": 1308.0,
      "Text": " It's how much of the stuff you need, where does it need to go,"
    },
    {
      "Time_Start": 1308.0,
      "Time_End": 1311.0,
      "Text": " to what level of technology, how quick, how soon,"
    },
    {
      "Time_Start": 1311.0,
      "Time_End": 1314.0,
      "Text": " and by the way, can we afford it?"
    },
    {
      "Time_Start": 1314.0,
      "Time_End": 1317.0,
      "Text": " And then the thing that I think is very important,"
    },
    {
      "Time_Start": 1317.0,
      "Time_End": 1320.0,
      "Text": " I was formally tasked by the Congress to develop standards."
    },
    {
      "Time_Start": 1320.0,
      "Time_End": 1324.0,
      "Text": " Now that's a biggie because we're going to talk about bio-API in just a few minutes,"
    },
    {
      "Time_Start": 1324.0,
      "Time_End": 1328.0,
      "Text": " but not having standards will kill my organization"
    },
    {
      "Time_Start": 1328.0,
      "Time_End": 1332.0,
      "Text": " because I have to be intraoperable wherever I am,"
    },
    {
      "Time_Start": 1332.0,
      "Time_End": 1336.0,
      "Text": " at any given time, in any given place."
    },
    {
      "Time_Start": 1336.0,
      "Time_End": 1340.0,
      "Text": " So standards are very important to us."
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1344.0,
      "Text": " As a result of that, this is what we built."
    },
    {
      "Time_Start": 1344.0,
      "Time_End": 1347.0,
      "Text": " Now I call them muscle groups because it's a nice military term,"
    },
    {
      "Time_Start": 1347.0,
      "Time_End": 1352.0,
      "Text": " but basically it's large chunks of what we're trying to do here."
    },
    {
      "Time_Start": 1352.0,
      "Time_End": 1355.0,
      "Text": " And very quickly, on muscle group one is a program office,"
    },
    {
      "Time_Start": 1355.0,
      "Time_End": 1357.0,
      "Text": " a program management office."
    },
    {
      "Time_Start": 1357.0,
      "Time_End": 1359.0,
      "Text": " That's where we do the policy, the doctrine, develop the funding,"
    },
    {
      "Time_Start": 1359.0,
      "Time_End": 1363.0,
      "Text": " develop the acquisition strategies, test and evaluation,"
    },
    {
      "Time_Start": 1363.0,
      "Time_End": 1368.0,
      "Text": " interface with the international community on standards and specification characteristics."
    },
    {
      "Time_Start": 1368.0,
      "Time_End": 1370.0,
      "Text": " All that's going to happen up there."
    },
    {
      "Time_Start": 1370.0,
      "Time_End": 1372.0,
      "Text": " That is currently open."
    },
    {
      "Time_Start": 1372.0,
      "Time_End": 1374.0,
      "Text": " This is really new news."
    },
    {
      "Time_Start": 1374.0,
      "Time_End": 1377.0,
      "Text": " We've been in business officially two weeks."
    },
    {
      "Time_Start": 1377.0,
      "Time_End": 1382.0,
      "Text": " I go back next Monday to my office and that will start the third week of this operation."
    },
    {
      "Time_Start": 1382.0,
      "Time_End": 1385.0,
      "Text": " So you're getting some really cool and first-hand news here."
    },
    {
      "Time_Start": 1385.0,
      "Time_End": 1391.0,
      "Text": " Muscle groups two and three will be located outside the military district of Washington."
    },
    {
      "Time_Start": 1391.0,
      "Time_End": 1394.0,
      "Text": " And for you, that translates to outside Washington, D.C.,"
    },
    {
      "Time_Start": 1394.0,
      "Time_End": 1400.0,
      "Text": " into one of the states in which we will set up a couple of things that are significant."
    },
    {
      "Time_Start": 1400.0,
      "Time_End": 1406.0,
      "Text": " One is going to be a national and international laboratory for biometrics."
    },
    {
      "Time_Start": 1406.0,
      "Time_End": 1409.0,
      "Text": " All biometrics that are going to come into the Department of Defense"
    },
    {
      "Time_Start": 1409.0,
      "Time_End": 1412.0,
      "Text": " will go through this laboratory for test and evaluation."
    },
    {
      "Time_Start": 1412.0,
      "Time_End": 1415.0,
      "Text": " And that's very important because I will tell you something you already know,"
    },
    {
      "Time_Start": 1415.0,
      "Time_End": 1417.0,
      "Text": " but I will say it anyway."
    },
    {
      "Time_Start": 1417.0,
      "Time_End": 1420.0,
      "Text": " Software delivered in a shrink-wrapped package is not pure."
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1423.0,
      "Text": " There's all kinds of little things in there."
    },
    {
      "Time_Start": 1423.0,
      "Time_End": 1427.0,
      "Text": " Or there's all kinds of opportunities to drop little things in there."
    },
    {
      "Time_Start": 1427.0,
      "Time_End": 1434.0,
      "Text": " My bottom line is to make sure I provide the best product to the warfighter."
    },
    {
      "Time_Start": 1434.0,
      "Time_End": 1436.0,
      "Text": " And that's the things that we will do to do that."
    },
    {
      "Time_Start": 1436.0,
      "Time_End": 1444.0,
      "Text": " The third group is built of a repository for the safeguarding and protection of templates"
    },
    {
      "Time_Start": 1444.0,
      "Time_End": 1450.0,
      "Text": " and other biometrics capabilities as well as a recovery site for any other minor database"
    },
    {
      "Time_Start": 1450.0,
      "Time_End": 1455.0,
      "Text": " that may have biometrics as an access mechanism."
    },
    {
      "Time_Start": 1455.0,
      "Time_End": 1459.0,
      "Text": " You met this fellow here, Assistant Secretary of Defense for C3I."
    },
    {
      "Time_Start": 1459.0,
      "Time_End": 1461.0,
      "Text": " He was on the Fed panel for biometrics."
    },
    {
      "Time_Start": 1461.0,
      "Time_End": 1463.0,
      "Text": " He's the guy I report to."
    },
    {
      "Time_Start": 1463.0,
      "Time_End": 1465.0,
      "Text": " He's the number three guy in the Department of Defense."
    },
    {
      "Time_Start": 1465.0,
      "Time_End": 1468.0,
      "Text": " That was Mr. Secretary Art Money."
    },
    {
      "Time_Start": 1468.0,
      "Time_End": 1471.0,
      "Text": " This is his marching orders and my mission statement"
    },
    {
      "Time_Start": 1471.0,
      "Time_End": 1474.0,
      "Text": " to get biometrics going in the Department of Defense."
    },
    {
      "Time_Start": 1474.0,
      "Time_End": 1478.0,
      "Text": " I've got a couple acronyms on there because if I had taken them off,"
    },
    {
      "Time_Start": 1478.0,
      "Time_End": 1482.0,
      "Text": " you would be questioning that this was really a military briefing."
    },
    {
      "Time_Start": 1482.0,
      "Time_End": 1484.0,
      "Text": " So I left them on there."
    },
    {
      "Time_Start": 1484.0,
      "Time_End": 1486.0,
      "Text": " But I'll tell you what's really important in the first bullet."
    },
    {
      "Time_Start": 1486.0,
      "Time_End": 1488.0,
      "Text": " It says DEVOLVE DODI."
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1491.0,
      "Text": " That stands for Department of Defense Instruction Directors."
    },
    {
      "Time_Start": 1491.0,
      "Time_End": 1496.0,
      "Text": " Those are the things that our tablets, if you will, are what we shall and shall not do"
    },
    {
      "Time_Start": 1496.0,
      "Time_End": 1499.0,
      "Text": " and who shall and shall not do it."
    },
    {
      "Time_Start": 1499.0,
      "Time_End": 1502.0,
      "Text": " Biometrics is going to be driven from top down."
    },
    {
      "Time_Start": 1502.0,
      "Time_End": 1505.0,
      "Text": " The other really important, very important acronym up there"
    },
    {
      "Time_Start": 1505.0,
      "Time_End": 1507.0,
      "Text": " is three letters on the end called JTA."
    },
    {
      "Time_Start": 1507.0,
      "Time_End": 1509.0,
      "Text": " That is the Joint Technical Architecture."
    },
    {
      "Time_Start": 1509.0,
      "Time_End": 1515.0,
      "Text": " Now how important is that and why am I wasting your time explaining three letters to you?"
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1519.0,
      "Text": " The Joint Technical Architecture is an architecture that has been negotiated,"
    },
    {
      "Time_Start": 1519.0,
      "Time_End": 1524.0,
      "Text": " accepted, and integrated in our design of our command and control systems"
    },
    {
      "Time_Start": 1524.0,
      "Time_End": 1527.0,
      "Text": " and many of our weapons systems and target acquisition systems"
    },
    {
      "Time_Start": 1527.0,
      "Time_End": 1532.0,
      "Text": " that has been accepted by our NATO partners, coalition partners, and allies."
    },
    {
      "Time_Start": 1532.0,
      "Time_End": 1536.0,
      "Text": " That is the thrust of our interoperability."
    },
    {
      "Time_Start": 1536.0,
      "Time_End": 1542.0,
      "Text": " And that's where biometric is going to be integrated, right in there."
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1547.0,
      "Text": " The other piece that was very important was to start a market survey"
    },
    {
      "Time_Start": 1547.0,
      "Time_End": 1549.0,
      "Text": " of the products of the BioAPI."
    },
    {
      "Time_Start": 1549.0,
      "Time_End": 1553.0,
      "Text": " Let me explain to you how we feel about the BioAPI."
    },
    {
      "Time_Start": 1553.0,
      "Time_End": 1557.0,
      "Text": " Number one, we are members of the Biometrics Consortium."
    },
    {
      "Time_Start": 1557.0,
      "Time_End": 1562.0,
      "Text": " That's 600 independent organizations belong to that internationally."
    },
    {
      "Time_Start": 1562.0,
      "Time_End": 1570.0,
      "Text": " That bio consortium owns and operates the BioAPI lower level."
    },
    {
      "Time_Start": 1570.0,
      "Time_End": 1575.0,
      "Text": " If we've got already 600 major entities across the globe"
    },
    {
      "Time_Start": 1575.0,
      "Time_End": 1581.0,
      "Text": " that have agreed on a baseline standard, we're certainly going to hop on that bandwagon."
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1584.0,
      "Text": " When we do the test and evaluation on the products,"
    },
    {
      "Time_Start": 1584.0,
      "Time_End": 1586.0,
      "Text": " we're going to find out what else we need to add to it."
    },
    {
      "Time_Start": 1586.0,
      "Time_End": 1591.0,
      "Text": " We have just stood up a government and industry panel, an IPT,"
    },
    {
      "Time_Start": 1591.0,
      "Time_End": 1598.0,
      "Text": " to pursue the lower level of the API in the development of this particular technology."
    },
    {
      "Time_Start": 1598.0,
      "Time_End": 1600.0,
      "Text": " That's pretty significant."
    },
    {
      "Time_Start": 1600.0,
      "Time_End": 1602.0,
      "Text": " It's an action that normally does not occur."
    },
    {
      "Time_Start": 1602.0,
      "Time_End": 1604.0,
      "Text": " We wait for something to be delivered on the shelf,"
    },
    {
      "Time_Start": 1604.0,
      "Time_End": 1606.0,
      "Text": " and then we buy it off the shelf and bring it in."
    },
    {
      "Time_Start": 1606.0,
      "Time_End": 1610.0,
      "Text": " In this case here, we're going to partner with industry and many of the developers"
    },
    {
      "Time_Start": 1610.0,
      "Time_End": 1613.0,
      "Text": " to mutually come up with something that is beneficial to all."
    },
    {
      "Time_Start": 1613.0,
      "Time_End": 1616.0,
      "Text": " Now we realize we can't drive the market."
    },
    {
      "Time_Start": 1616.0,
      "Time_End": 1620.0,
      "Text": " You know, 20 years ago, the Department of Defense pretty much drove the IT market."
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1622.0,
      "Text": " That's not the way it is today."
    },
    {
      "Time_Start": 1622.0,
      "Time_End": 1625.0,
      "Text": " We are a commercial user like everybody else."
    },
    {
      "Time_Start": 1625.0,
      "Time_End": 1630.0,
      "Text": " So we partner with everybody else."
    },
    {
      "Time_Start": 1630.0,
      "Time_End": 1637.0,
      "Text": " The fourth bullet down, legal, privacy, social, cultural, religious issues around biometrics"
    },
    {
      "Time_Start": 1637.0,
      "Time_End": 1641.0,
      "Text": " is an issue or a set of issues we've taken very seriously."
    },
    {
      "Time_Start": 1641.0,
      "Time_End": 1643.0,
      "Text": " And why?"
    },
    {
      "Time_Start": 1643.0,
      "Time_End": 1649.0,
      "Text": " Well, we still have groups of people, autonomous and recognizable,"
    },
    {
      "Time_Start": 1649.0,
      "Time_End": 1654.0,
      "Text": " who feel that simply taking their picture steals their soul."
    },
    {
      "Time_Start": 1654.0,
      "Time_End": 1660.0,
      "Text": " You have to respect that, especially in a global community."
    },
    {
      "Time_Start": 1660.0,
      "Time_End": 1662.0,
      "Text": " There may be some religions."
    },
    {
      "Time_Start": 1662.0,
      "Time_End": 1667.0,
      "Text": " There may be some personal desires that biometrics will not work"
    },
    {
      "Time_Start": 1667.0,
      "Time_End": 1669.0,
      "Text": " or is not desired to work."
    },
    {
      "Time_Start": 1669.0,
      "Time_End": 1672.0,
      "Text": " We have to respect that as well."
    },
    {
      "Time_Start": 1672.0,
      "Time_End": 1675.0,
      "Text": " And we've conducted a fairly extensive study on that,"
    },
    {
      "Time_Start": 1675.0,
      "Time_End": 1678.0,
      "Text": " and I'll talk about that in a minute."
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1682.0,
      "Text": " Before we even launched this program, that's the thing that we did."
    },
    {
      "Time_Start": 1682.0,
      "Time_End": 1684.0,
      "Text": " We looked at the first, fourth, fifth amendments."
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1691.0,
      "Text": " We looked at religious issues, cultural issues, social issues around biometrics."
    },
    {
      "Time_Start": 1691.0,
      "Time_End": 1694.0,
      "Text": " Now, again, not what I said when I first stood up here."
    },
    {
      "Time_Start": 1694.0,
      "Time_End": 1700.0,
      "Text": " I'd like to tell you we're driving the field in this technology, but we are not."
    },
    {
      "Time_Start": 1700.0,
      "Time_End": 1703.0,
      "Text": " We're a step behind what industry is doing today."
    },
    {
      "Time_Start": 1703.0,
      "Time_End": 1707.0,
      "Text": " And you may or may not be aware of some of these, but I'll give you some examples."
    },
    {
      "Time_Start": 1707.0,
      "Time_End": 1711.0,
      "Text": " Next time you fly through Charlotte's airport, be advised."
    },
    {
      "Time_Start": 1711.0,
      "Time_End": 1713.0,
      "Text": " Biometrics is in the airport."
    },
    {
      "Time_Start": 1713.0,
      "Time_End": 1716.0,
      "Text": " It is watching passengers' facial recognition."
    },
    {
      "Time_Start": 1716.0,
      "Time_End": 1720.0,
      "Text": " Next time you go to Chicago or O'Hara, look outside while you're waiting for your plane."
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1723.0,
      "Text": " All those trucks moving around out there are being controlled."
    },
    {
      "Time_Start": 1723.0,
      "Time_End": 1727.0,
      "Text": " The trucks and the drivers are being controlled by biometrics."
    },
    {
      "Time_Start": 1727.0,
      "Time_End": 1729.0,
      "Text": " Anybody here from Texas?"
    },
    {
      "Time_Start": 1729.0,
      "Time_End": 1732.0,
      "Text": " Do you have an ATM card?"
    },
    {
      "Time_Start": 1732.0,
      "Time_End": 1737.0,
      "Text": " Do you bank at the bank that scans your eyeball because they don't use the card anymore?"
    },
    {
      "Time_Start": 1737.0,
      "Time_End": 1742.0,
      "Text": " The major bank in Texas has done away with ATM cards, PIN numbers."
    },
    {
      "Time_Start": 1742.0,
      "Time_End": 1748.0,
      "Text": " You walk up to the machine, you go smile, and then you poke in the amount of money you want."
    },
    {
      "Time_Start": 1748.0,
      "Time_End": 1755.0,
      "Text": " It does your iris, brings it back, validates it, and hands you the money."
    },
    {
      "Time_Start": 1755.0,
      "Time_End": 1758.0,
      "Text": " California."
    },
    {
      "Time_Start": 1759.0,
      "Time_End": 1767.0,
      "Text": " The government there is using biometrics to control fraud in financial assistance programs."
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1770.0,
      "Text": " Same thing in New York."
    },
    {
      "Time_Start": 1770.0,
      "Time_End": 1776.0,
      "Text": " Many of the states are using biometrics as a thumbprint on the driver's licenses."
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1780.0,
      "Text": " So those things are already going on."
    },
    {
      "Time_Start": 1780.0,
      "Time_End": 1783.0,
      "Text": " Next chart, please."
    },
    {
      "Time_Start": 1783.0,
      "Time_End": 1788.0,
      "Text": " This is probably the only time you ever see what the Department of Defense is looking at"
    },
    {
      "Time_Start": 1788.0,
      "Time_End": 1794.0,
      "Text": " in specification or characteristics of a commercial product for biometrics across the functional areas."
    },
    {
      "Time_Start": 1794.0,
      "Time_End": 1797.0,
      "Text": " Whether it be printing, voice, body odor."
    },
    {
      "Time_Start": 1797.0,
      "Time_End": 1801.0,
      "Text": " Anybody know we've got now an application that will smell you?"
    },
    {
      "Time_Start": 1801.0,
      "Time_End": 1804.0,
      "Text": " And if you smell right to them, it will turn on your computer."
    },
    {
      "Time_Start": 1804.0,
      "Time_End": 1810.0,
      "Text": " We're not pursuing that technology, but it is there nonetheless."
    },
    {
      "Time_Start": 1810.0,
      "Time_End": 1817.0,
      "Text": " Remember I said we deploy for weeks in the field?"
    },
    {
      "Time_Start": 1817.0,
      "Time_End": 1826.0,
      "Text": " The low cost up here, we talk about very, very low cost for each seat in which this application will be put into."
    },
    {
      "Time_Start": 1826.0,
      "Time_End": 1831.0,
      "Text": " My customer base just in the Army is over 1.2 million across the Department of Defense,"
    },
    {
      "Time_Start": 1831.0,
      "Time_End": 1836.0,
      "Text": " including civil servants, support contractors, in excess of 5 million."
    },
    {
      "Time_Start": 1836.0,
      "Time_End": 1840.0,
      "Text": " Now as a taxpayer, and every one of us is, I hope you appreciate that what we're trying to do here"
    },
    {
      "Time_Start": 1840.0,
      "Time_End": 1844.0,
      "Text": " is to reduce the cost on this and reduce the intrusion penetrations."
    },
    {
      "Time_Start": 1844.0,
      "Time_End": 1846.0,
      "Text": " Little overhead."
    },
    {
      "Time_Start": 1846.0,
      "Time_End": 1850.0,
      "Text": " That, ladies and gentlemen, to us means bandwidth."
    },
    {
      "Time_Start": 1850.0,
      "Time_End": 1856.0,
      "Text": " If I have one single requirement in IT today, it is bandwidth, bandwidth, bandwidth."
    },
    {
      "Time_Start": 1856.0,
      "Time_End": 1857.0,
      "Text": " Why is that?"
    },
    {
      "Time_Start": 1857.0,
      "Time_End": 1863.0,
      "Text": " Because right down to the weapons system, to the Humvee, to the shooting platform,"
    },
    {
      "Time_Start": 1863.0,
      "Time_End": 1869.0,
      "Text": " we provide our soldiers, our war fighters, a visual picture of where they are,"
    },
    {
      "Time_Start": 1869.0,
      "Time_End": 1874.0,
      "Text": " where their buddies are, and where the enemy is."
    },
    {
      "Time_Start": 1874.0,
      "Time_End": 1877.0,
      "Text": " To do that requires a tremendous amount of bandwidth."
    },
    {
      "Time_Start": 1877.0,
      "Time_End": 1882.0,
      "Text": " I'm not going to add anything else to that infrastructure that eats up that bandwidth."
    },
    {
      "Time_Start": 1882.0,
      "Time_End": 1884.0,
      "Text": " I want them to know where the enemy is."
    },
    {
      "Time_Start": 1884.0,
      "Time_End": 1890.0,
      "Text": " I want them to know where they are, and I'm not going to add anything that will degradate that at all."
    },
    {
      "Time_Start": 1890.0,
      "Time_End": 1893.0,
      "Text": " CBT. Yes, that is computer-based training."
    },
    {
      "Time_Start": 1893.0,
      "Time_End": 1896.0,
      "Text": " We use the same terminology across the universe."
    },
    {
      "Time_Start": 1896.0,
      "Time_End": 1899.0,
      "Text": " The other thing that I don't want to do in fielding this new technology"
    },
    {
      "Time_Start": 1899.0,
      "Time_End": 1905.0,
      "Text": " is tie up a whole bunch of people in a whole bunch of training when they're not doing their actual missions."
    },
    {
      "Time_Start": 1905.0,
      "Time_End": 1911.0,
      "Text": " So the requirement for this is the training for this new technology at the user level"
    },
    {
      "Time_Start": 1911.0,
      "Time_End": 1916.0,
      "Text": " cannot be any more complicated than the instructions to load it into the system."
    },
    {
      "Time_Start": 1916.0,
      "Time_End": 1918.0,
      "Text": " Simple as that."
    },
    {
      "Time_Start": 1918.0,
      "Time_End": 1921.0,
      "Text": " If it requires more than that, it won't meet the test and we won't buy it."
    },
    {
      "Time_Start": 1921.0,
      "Time_End": 1925.0,
      "Text": " MOP-4. How many of you all know what MOP-4 is?"
    },
    {
      "Time_Start": 1925.0,
      "Time_End": 1928.0,
      "Text": " Ex-military guys, right?"
    },
    {
      "Time_Start": 1928.0,
      "Time_End": 1932.0,
      "Text": " For those of you that don't know, it is a military posturing position"
    },
    {
      "Time_Start": 1932.0,
      "Time_End": 1940.0,
      "Text": " in which we get dressed up in to protect ourselves from nuclear, biological, and chemical environments."
    },
    {
      "Time_Start": 1940.0,
      "Time_End": 1945.0,
      "Text": " In a full MOP-4 environment, head to toe, we are covered in a plastic suit,"
    },
    {
      "Time_Start": 1945.0,
      "Time_End": 1950.0,
      "Text": " boots, gloves, full facial gas mask on the shoulders, etc."
    },
    {
      "Time_Start": 1950.0,
      "Time_End": 1956.0,
      "Text": " It is a living environment inside a plastic bubble, if you will."
    },
    {
      "Time_Start": 1956.0,
      "Time_End": 1959.0,
      "Text": " Now imagine this little challenge that's thrown at me."
    },
    {
      "Time_Start": 1959.0,
      "Time_End": 1963.0,
      "Text": " And by the way, Phil, you've got to operate biometrics in that environment."
    },
    {
      "Time_Start": 1963.0,
      "Time_End": 1965.0,
      "Text": " So how do you do that?"
    },
    {
      "Time_Start": 1965.0,
      "Time_End": 1968.0,
      "Text": " Well, okay, you're going to log in, take your glove off."
    },
    {
      "Time_Start": 1968.0,
      "Time_End": 1971.0,
      "Text": " I know a lot of chemicals out here, but take your glove off and put your fingerprint down."
    },
    {
      "Time_Start": 1971.0,
      "Time_End": 1974.0,
      "Text": " Well, the answer is no."
    },
    {
      "Time_Start": 1974.0,
      "Time_End": 1979.0,
      "Text": " So you'll be interested to know that we have found a technology, Biometrics Pure,"
    },
    {
      "Time_Start": 1979.0,
      "Time_End": 1985.0,
      "Text": " that allows the user to be identified, access to be gained,"
    },
    {
      "Time_Start": 1985.0,
      "Time_End": 1988.0,
      "Text": " and functions on that particular system to be executed."
    },
    {
      "Time_Start": 1988.0,
      "Time_End": 1990.0,
      "Text": " It is called Iris Scan."
    },
    {
      "Time_Start": 1990.0,
      "Time_End": 1993.0,
      "Text": " We've been able to, at least in the laboratory right now,"
    },
    {
      "Time_Start": 1993.0,
      "Time_End": 1997.0,
      "Text": " take an Iris Scan product, read it through a gas mask,"
    },
    {
      "Time_Start": 1997.0,
      "Time_End": 2002.0,
      "Text": " and we've got little plastic eye holes, or the aviator's got a full shield,"
    },
    {
      "Time_Start": 2003.0,
      "Time_End": 2010.0,
      "Text": " through a pair of glasses, and still be able to affect a positive reaction on the AT system."
    },
    {
      "Time_Start": 2010.0,
      "Time_End": 2012.0,
      "Text": " This is good news."
    },
    {
      "Time_Start": 2012.0,
      "Time_End": 2014.0,
      "Text": " So we're very pleased about that,"
    },
    {
      "Time_Start": 2014.0,
      "Time_End": 2019.0,
      "Text": " because we certainly didn't want anybody to get undressed in a Mont-Pour environment for biometrics."
    },
    {
      "Time_Start": 2019.0,
      "Time_End": 2021.0,
      "Text": " Because had that been the case,"
    },
    {
      "Time_Start": 2021.0,
      "Time_End": 2025.0,
      "Text": " we simply would have not deployed biometrics in those environments."
    },
    {
      "Time_Start": 2025.0,
      "Time_End": 2027.0,
      "Text": " The next one is Brain-Dead."
    },
    {
      "Time_Start": 2027.0,
      "Time_End": 2029.0,
      "Text": " It's also going to operate in an office environment."
    },
    {
      "Time_Start": 2029.0,
      "Time_End": 2032.0,
      "Text": " So you take it off the shelf and you rock with it, no big deal."
    },
    {
      "Time_Start": 2032.0,
      "Time_End": 2035.0,
      "Text": " The other two are absolute non-negotiables."
    },
    {
      "Time_Start": 2035.0,
      "Time_End": 2037.0,
      "Text": " COTS means it's got to be commercial."
    },
    {
      "Time_Start": 2037.0,
      "Time_End": 2040.0,
      "Text": " I am not doing any RDT&E."
    },
    {
      "Time_Start": 2040.0,
      "Time_End": 2046.0,
      "Text": " So I don't have labs and a bunch of engineers developing something from scratch."
    },
    {
      "Time_Start": 2046.0,
      "Time_End": 2048.0,
      "Text": " We will take the COTS."
    },
    {
      "Time_Start": 2048.0,
      "Time_End": 2052.0,
      "Text": " We will put engineers and consultants and other smart folks against it"
    },
    {
      "Time_Start": 2052.0,
      "Time_End": 2055.0,
      "Text": " for integration of that COTS into our existing systems."
    },
    {
      "Time_Start": 2055.0,
      "Time_End": 2058.0,
      "Text": " But we will not develop anything from scratch."
    },
    {
      "Time_Start": 2058.0,
      "Time_End": 2062.0,
      "Text": " And a bio-API is, again, non-negotiable."
    },
    {
      "Time_Start": 2062.0,
      "Time_End": 2065.0,
      "Text": " If you're not bio-API and you're selling these kind of products,"
    },
    {
      "Time_Start": 2065.0,
      "Time_End": 2069.0,
      "Text": " don't come to Washington to talk to me, because I simply will not."
    },
    {
      "Time_Start": 2069.0,
      "Time_End": 2072.0,
      "Text": " That's the baseline requirement for the international agreement that we have."
    },
    {
      "Time_Start": 2072.0,
      "Time_End": 2073.0,
      "Text": " Next slide."
    },
    {
      "Time_Start": 2077.0,
      "Time_End": 2080.0,
      "Text": " I didn't see one single architecture chart the whole conference,"
    },
    {
      "Time_Start": 2080.0,
      "Time_End": 2082.0,
      "Text": " so I said I'm going to find one last night,"
    },
    {
      "Time_Start": 2082.0,
      "Time_End": 2085.0,
      "Text": " and I brought one here, so there it is."
    },
    {
      "Time_Start": 2085.0,
      "Time_End": 2087.0,
      "Text": " These represent our gateways."
    },
    {
      "Time_Start": 2087.0,
      "Time_End": 2089.0,
      "Text": " Our DMZs."
    },
    {
      "Time_Start": 2089.0,
      "Time_End": 2092.0,
      "Text": " Mr. Mojo here talked about a DMZ very briefly."
    },
    {
      "Time_Start": 2092.0,
      "Time_End": 2096.0,
      "Text": " This is where we will integrate biometrics."
    },
    {
      "Time_Start": 2096.0,
      "Time_End": 2101.0,
      "Text": " Our DMZs are structured as single points, egress to egress, into our enclaves."
    },
    {
      "Time_Start": 2101.0,
      "Time_End": 2103.0,
      "Text": " We have to do that."
    },
    {
      "Time_Start": 2103.0,
      "Time_End": 2107.0,
      "Text": " It's the whole part of the reconstructuring of the IA architecture"
    },
    {
      "Time_Start": 2107.0,
      "Time_End": 2109.0,
      "Text": " that we put together in a department."
    },
    {
      "Time_Start": 2109.0,
      "Time_End": 2114.0,
      "Text": " Where you see the routers, where you see the firewalls,"
    },
    {
      "Time_Start": 2114.0,
      "Time_End": 2119.0,
      "Text": " and by the way, we don't always recommend a firewall at a gateway,"
    },
    {
      "Time_Start": 2119.0,
      "Time_End": 2123.0,
      "Text": " because there are certain things that we do in a stateful inspection,"
    },
    {
      "Time_Start": 2123.0,
      "Time_End": 2125.0,
      "Text": " and certain things that we don't."
    },
    {
      "Time_Start": 2125.0,
      "Time_End": 2128.0,
      "Text": " In certain ways that we can construct the two routers"
    },
    {
      "Time_Start": 2128.0,
      "Time_End": 2130.0,
      "Text": " that are always found at our gateways,"
    },
    {
      "Time_Start": 2130.0,
      "Time_End": 2133.0,
      "Text": " to do IP filtering for us and some of these other things."
    },
    {
      "Time_Start": 2133.0,
      "Time_End": 2137.0,
      "Text": " And we do pursue things that are collectively integrated,"
    },
    {
      "Time_Start": 2137.0,
      "Time_End": 2142.0,
      "Text": " such as Cisco's router capability with an IDS module on the inside."
    },
    {
      "Time_Start": 2142.0,
      "Time_End": 2144.0,
      "Text": " This is cool stuff to us."
    },
    {
      "Time_Start": 2144.0,
      "Time_End": 2151.0,
      "Text": " We will put biometrics on these major pieces inside our nodes as well."
    },
    {
      "Time_Start": 2151.0,
      "Time_End": 2154.0,
      "Text": " So not just a user platform."
    },
    {
      "Time_Start": 2159.0,
      "Time_End": 2163.0,
      "Text": " I told you we completed a couple of studies before we started bending metal on this project."
    },
    {
      "Time_Start": 2163.0,
      "Time_End": 2166.0,
      "Text": " These are the two stories, or two studies I should say."
    },
    {
      "Time_Start": 2166.0,
      "Time_End": 2168.0,
      "Text": " One was a feasibility study."
    },
    {
      "Time_Start": 2168.0,
      "Time_End": 2169.0,
      "Text": " First of all, could you do this?"
    },
    {
      "Time_Start": 2169.0,
      "Time_End": 2171.0,
      "Text": " If you could, what would it look like?"
    },
    {
      "Time_Start": 2171.0,
      "Time_End": 2174.0,
      "Text": " What would the whole engineering teams look like?"
    },
    {
      "Time_Start": 2174.0,
      "Time_End": 2176.0,
      "Text": " What would the integrators look like?"
    },
    {
      "Time_Start": 2176.0,
      "Time_End": 2181.0,
      "Text": " What would the facilities be required to function like?"
    },
    {
      "Time_Start": 2181.0,
      "Time_End": 2185.0,
      "Text": " What kind of computing power would you need, etc., etc.?"
    },
    {
      "Time_Start": 2185.0,
      "Time_End": 2189.0,
      "Text": " Is it even possible to do and execute those three muscle groups"
    },
    {
      "Time_Start": 2189.0,
      "Time_End": 2192.0,
      "Text": " that we've been given tasks to do?"
    },
    {
      "Time_Start": 2192.0,
      "Time_End": 2194.0,
      "Text": " And we did that."
    },
    {
      "Time_Start": 2194.0,
      "Time_End": 2196.0,
      "Text": " And we took part of that, and we think it is possible,"
    },
    {
      "Time_Start": 2196.0,
      "Time_End": 2198.0,
      "Text": " and we've started on it obviously."
    },
    {
      "Time_Start": 2198.0,
      "Time_End": 2202.0,
      "Text": " The other one is a social legal study done by a bunch of lawyers."
    },
    {
      "Time_Start": 2202.0,
      "Time_End": 2208.0,
      "Text": " Until this particular project, I didn't have a terrible amount of use for lawyers,"
    },
    {
      "Time_Start": 2208.0,
      "Time_End": 2210.0,
      "Text": " but I do now."
    },
    {
      "Time_Start": 2210.0,
      "Time_End": 2215.0,
      "Text": " Because if they've done nothing else for us on this particular technology,"
    },
    {
      "Time_Start": 2215.0,
      "Time_End": 2217.0,
      "Text": " they have showed us over and over again"
    },
    {
      "Time_Start": 2217.0,
      "Time_End": 2221.0,
      "Text": " that we must protect the civil rights and privacy issues"
    },
    {
      "Time_Start": 2221.0,
      "Time_End": 2224.0,
      "Text": " of all people who come across this technology."
    },
    {
      "Time_Start": 2224.0,
      "Time_End": 2226.0,
      "Text": " Got to do that."
    },
    {
      "Time_Start": 2226.0,
      "Time_End": 2228.0,
      "Text": " I've got lawyers on my staff."
    },
    {
      "Time_Start": 2228.0,
      "Time_End": 2231.0,
      "Text": " And I'm there, I'm told, because they're here to help me."
    },
    {
      "Time_Start": 2231.0,
      "Time_End": 2233.0,
      "Text": " Or maybe they're watching, I don't know."
    },
    {
      "Time_Start": 2241.0,
      "Time_End": 2244.0,
      "Text": " This is what we're doing to pursue the strategy."
    },
    {
      "Time_Start": 2244.0,
      "Time_End": 2246.0,
      "Text": " I think you might be interested."
    },
    {
      "Time_Start": 2246.0,
      "Time_End": 2248.0,
      "Text": " I've mentioned it once or twice."
    },
    {
      "Time_Start": 2248.0,
      "Time_End": 2252.0,
      "Text": " Starting going after cost products, and we have a bunch of those coming in."
    },
    {
      "Time_Start": 2252.0,
      "Time_End": 2255.0,
      "Text": " We're going to test these products in existing systems."
    },
    {
      "Time_Start": 2255.0,
      "Time_End": 2260.0,
      "Text": " Again, to validate the vendors' bragging rights on them,"
    },
    {
      "Time_Start": 2260.0,
      "Time_End": 2262.0,
      "Text": " and also their integration capability."
    },
    {
      "Time_Start": 2263.0,
      "Time_End": 2267.0,
      "Text": " We're going to front load this, I will tell you from the very beginning, to succeed."
    },
    {
      "Time_Start": 2267.0,
      "Time_End": 2270.0,
      "Text": " So we're not going to put any biometric technology"
    },
    {
      "Time_Start": 2270.0,
      "Time_End": 2273.0,
      "Text": " that we think is going to be risky into the system,"
    },
    {
      "Time_Start": 2273.0,
      "Time_End": 2276.0,
      "Text": " because these are live systems that people are using today,"
    },
    {
      "Time_Start": 2276.0,
      "Time_End": 2277.0,
      "Text": " wherever they may be deployed."
    },
    {
      "Time_Start": 2277.0,
      "Time_End": 2279.0,
      "Text": " So watch that very carefully."
    },
    {
      "Time_Start": 2280.0,
      "Time_End": 2282.0,
      "Text": " The National Information Assurance Program."
    },
    {
      "Time_Start": 2282.0,
      "Time_End": 2284.0,
      "Text": " How many of you have heard about that?"
    },
    {
      "Time_Start": 2286.0,
      "Time_End": 2290.0,
      "Text": " I will tell you that this program not only encompasses biometrics,"
    },
    {
      "Time_Start": 2290.0,
      "Time_End": 2291.0,
      "Text": " but any other product."
    },
    {
      "Time_Start": 2291.0,
      "Time_End": 2296.0,
      "Text": " Firewalls, guards, IDSs, mapping tools, scanning tools."
    },
    {
      "Time_Start": 2296.0,
      "Time_End": 2300.0,
      "Text": " Any product that helps us manage or improve the security"
    },
    {
      "Time_Start": 2300.0,
      "Time_End": 2304.0,
      "Text": " of any of our networks or other systems goes through NIAP."
    },
    {
      "Time_Start": 2305.0,
      "Time_End": 2309.0,
      "Text": " It doesn't come into the government without getting a certification from NIAP."
    },
    {
      "Time_Start": 2309.0,
      "Time_End": 2311.0,
      "Text": " That will be on the front end of this as well."
    },
    {
      "Time_Start": 2312.0,
      "Time_End": 2316.0,
      "Text": " Working on commercial standards and developing the approach and strategy on this."
    },
    {
      "Time_Start": 2316.0,
      "Time_End": 2317.0,
      "Text": " Next chart, please."
    },
    {
      "Time_Start": 2319.0,
      "Time_End": 2320.0,
      "Text": " What is a pilot?"
    },
    {
      "Time_Start": 2320.0,
      "Time_End": 2322.0,
      "Text": " I told you that I would come back and explain to you"
    },
    {
      "Time_Start": 2322.0,
      "Time_End": 2326.0,
      "Text": " how we come around and define what we're going to do in our pilots."
    },
    {
      "Time_Start": 2326.0,
      "Time_End": 2328.0,
      "Text": " Basically, two environments."
    },
    {
      "Time_Start": 2328.0,
      "Time_End": 2332.0,
      "Text": " One is basically get some equipment, put it on the shelf, and roll with it."
    },
    {
      "Time_Start": 2332.0,
      "Time_End": 2336.0,
      "Text": " The other is actually putting it online, integrating it into systems,"
    },
    {
      "Time_Start": 2336.0,
      "Time_End": 2338.0,
      "Text": " with training, with people."
    },
    {
      "Time_Start": 2339.0,
      "Time_End": 2345.0,
      "Text": " And we do this in an environment in which we can control."
    },
    {
      "Time_Start": 2347.0,
      "Time_End": 2350.0,
      "Text": " We may go to a headquarters, for example,"
    },
    {
      "Time_Start": 2350.0,
      "Time_End": 2355.0,
      "Text": " and find biometrics integrated in command land, if you will."
    },
    {
      "Time_Start": 2355.0,
      "Time_End": 2357.0,
      "Text": " Maybe not any further than that."
    },
    {
      "Time_Start": 2357.0,
      "Time_End": 2360.0,
      "Text": " Because, again, we've got an awful lot to learn."
    },
    {
      "Time_Start": 2360.0,
      "Time_End": 2362.0,
      "Text": " And that's pretty much the way we do business"
    },
    {
      "Time_Start": 2362.0,
      "Time_End": 2364.0,
      "Text": " whenever we bring something in on COTS environment"
    },
    {
      "Time_Start": 2364.0,
      "Time_End": 2366.0,
      "Text": " and integrate it into our backbone."
    },
    {
      "Time_Start": 2367.0,
      "Time_End": 2369.0,
      "Text": " We don't want to break something that's already working."
    },
    {
      "Time_Start": 2369.0,
      "Time_End": 2370.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 2371.0,
      "Time_End": 2374.0,
      "Text": " This is the process that we go through in deciding what a pilot is,"
    },
    {
      "Time_Start": 2374.0,
      "Time_End": 2379.0,
      "Text": " who should get it, how we should run it, and the next steps"
    },
    {
      "Time_Start": 2379.0,
      "Time_End": 2383.0,
      "Text": " to finally get a product that we can come out and say,"
    },
    {
      "Time_Start": 2383.0,
      "Time_End": 2386.0,
      "Text": " this is good enough for DOD consumers."
    },
    {
      "Time_Start": 2387.0,
      "Time_End": 2392.0,
      "Text": " Now, for those of you who watch the high-end R&D centers in the government,"
    },
    {
      "Time_Start": 2392.0,
      "Time_End": 2394.0,
      "Text": " such as DARPA and others,"
    },
    {
      "Time_Start": 2394.0,
      "Time_End": 2396.0,
      "Text": " and if you've ever done a workflow on them,"
    },
    {
      "Time_Start": 2396.0,
      "Time_End": 2398.0,
      "Text": " you will find that this is a pretty similar model."
    },
    {
      "Time_Start": 2398.0,
      "Time_End": 2400.0,
      "Text": " Because it is."
    },
    {
      "Time_Start": 2400.0,
      "Time_End": 2402.0,
      "Text": " Although we're getting COTS,"
    },
    {
      "Time_Start": 2402.0,
      "Time_End": 2408.0,
      "Text": " although we're showing an approach or a strategy of simple integration,"
    },
    {
      "Time_Start": 2408.0,
      "Time_End": 2411.0,
      "Text": " the process here is sustainment at the far end"
    },
    {
      "Time_Start": 2411.0,
      "Time_End": 2416.0,
      "Text": " if we approve the product, if the product proves itself to be value-added."
    },
    {
      "Time_Start": 2416.0,
      "Time_End": 2418.0,
      "Text": " So, we take it through the entire system,"
    },
    {
      "Time_Start": 2418.0,
      "Time_End": 2420.0,
      "Text": " finally down to transition."
    },
    {
      "Time_Start": 2420.0,
      "Time_End": 2423.0,
      "Text": " Transition to us is O&M, Operating and Maintaining,"
    },
    {
      "Time_Start": 2423.0,
      "Time_End": 2426.0,
      "Text": " and then it comes into the department."
    },
    {
      "Time_Start": 2426.0,
      "Time_End": 2428.0,
      "Text": " These are big-time issues, folks,"
    },
    {
      "Time_Start": 2428.0,
      "Time_End": 2432.0,
      "Text": " because once a decision has been made to transition it from a pilot"
    },
    {
      "Time_Start": 2432.0,
      "Time_End": 2435.0,
      "Text": " into full integration, you're making, or we're making,"
    },
    {
      "Time_Start": 2435.0,
      "Time_End": 2441.0,
      "Text": " a 10- to 15-year commitment that we will have this into the infrastructure."
    },
    {
      "Time_Start": 2443.0,
      "Time_End": 2445.0,
      "Text": " That's the way most of this stuff works."
    },
    {
      "Time_Start": 2445.0,
      "Time_End": 2448.0,
      "Text": " It is not by accident, by the way, at the very top there,"
    },
    {
      "Time_Start": 2448.0,
      "Time_End": 2450.0,
      "Text": " you see that legal block?"
    },
    {
      "Time_Start": 2450.0,
      "Time_End": 2452.0,
      "Text": " So, you're going to look at that."
    },
    {
      "Time_Start": 2452.0,
      "Time_End": 2456.0,
      "Text": " On the security block, I have another agency working for me on this,"
    },
    {
      "Time_Start": 2456.0,
      "Time_End": 2458.0,
      "Text": " as a partner, a three-letter agency."
    },
    {
      "Time_Start": 2458.0,
      "Time_End": 2461.0,
      "Text": " Once the products go through the NIAP process"
    },
    {
      "Time_Start": 2461.0,
      "Time_End": 2463.0,
      "Text": " and they get that NIAP certification seal,"
    },
    {
      "Time_Start": 2463.0,
      "Time_End": 2466.0,
      "Text": " I will take some number of those products,"
    },
    {
      "Time_Start": 2466.0,
      "Time_End": 2468.0,
      "Text": " give it to that agency,"
    },
    {
      "Time_Start": 2468.0,
      "Time_End": 2470.0,
      "Text": " and they will tell me whether I should invest anymore"
    },
    {
      "Time_Start": 2470.0,
      "Time_End": 2474.0,
      "Text": " in pursuing this as a product for DOD consumers."
    },
    {
      "Time_Start": 2474.0,
      "Time_End": 2477.0,
      "Text": " And I think you can appreciate that."
    },
    {
      "Time_Start": 2477.0,
      "Time_End": 2481.0,
      "Text": " I can get a good commercial certification in waiting on a product,"
    },
    {
      "Time_Start": 2481.0,
      "Time_End": 2486.0,
      "Text": " but if there is a group, an activity, a host nation,"
    },
    {
      "Time_Start": 2486.0,
      "Time_End": 2489.0,
      "Text": " that can export that product,"
    },
    {
      "Time_Start": 2489.0,
      "Time_End": 2490.0,
      "Text": " and I need to know that,"
    },
    {
      "Time_Start": 2490.0,
      "Time_End": 2494.0,
      "Text": " and I certainly don't need to put it into our command and control systems."
    },
    {
      "Time_Start": 2494.0,
      "Time_End": 2498.0,
      "Text": " So, all these things are embedded in here in the whole thinking process."
    },
    {
      "Time_Start": 2500.0,
      "Time_End": 2503.0,
      "Text": " On the tactical piece,"
    },
    {
      "Time_Start": 2503.0,
      "Time_End": 2506.0,
      "Text": " on the tactical piece,"
    },
    {
      "Time_Start": 2506.0,
      "Time_End": 2509.0,
      "Text": " and what Major French up here is responsible for,"
    },
    {
      "Time_Start": 2509.0,
      "Time_End": 2512.0,
      "Text": " these are the technologies we're looking at."
    },
    {
      "Time_Start": 2512.0,
      "Time_End": 2515.0,
      "Text": " The iris scan, and I know it's a hard picture to see,"
    },
    {
      "Time_Start": 2515.0,
      "Time_End": 2520.0,
      "Text": " but if you looked at the first block in the middle of the picture,"
    },
    {
      "Time_Start": 2520.0,
      "Time_End": 2522.0,
      "Text": " on the left,"
    },
    {
      "Time_Start": 2522.0,
      "Time_End": 2525.0,
      "Text": " that's what a MOP4 individual looks like, by the way."
    },
    {
      "Time_Start": 2527.0,
      "Time_End": 2531.0,
      "Text": " That is a lab version of an iris scan,"
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2535.0,
      "Text": " and that is the process that we'll go through to put it right down to the tank."
    },
    {
      "Time_Start": 2535.0,
      "Time_End": 2539.0,
      "Text": " Now, what we particularly like in some of this technology here"
    },
    {
      "Time_Start": 2539.0,
      "Time_End": 2541.0,
      "Text": " is things like a tank."
    },
    {
      "Time_Start": 2541.0,
      "Time_End": 2543.0,
      "Text": " I put a picture of it here."
    },
    {
      "Time_Start": 2543.0,
      "Time_End": 2548.0,
      "Text": " In a tank, these fellows do not get in a full MOP4 environment"
    },
    {
      "Time_Start": 2548.0,
      "Time_End": 2549.0,
      "Text": " once they close their hatch,"
    },
    {
      "Time_Start": 2549.0,
      "Time_End": 2552.0,
      "Text": " because the tank itself is a MOP4 environment."
    },
    {
      "Time_Start": 2553.0,
      "Time_End": 2555.0,
      "Text": " So, what we think we'll do there,"
    },
    {
      "Time_Start": 2555.0,
      "Time_End": 2558.0,
      "Text": " inside the cupola or inside the turret,"
    },
    {
      "Time_Start": 2558.0,
      "Time_End": 2562.0,
      "Text": " is put a biometric sensor that can sense the team."
    },
    {
      "Time_Start": 2562.0,
      "Time_End": 2564.0,
      "Text": " Now, why is that important?"
    },
    {
      "Time_Start": 2565.0,
      "Time_End": 2569.0,
      "Text": " Well, for the same reason that I want to positively identify"
    },
    {
      "Time_Start": 2569.0,
      "Time_End": 2573.0,
      "Text": " and recognize that the user of that desktop is really who it is,"
    },
    {
      "Time_Start": 2573.0,
      "Time_End": 2576.0,
      "Text": " I want to do the same thing in weapon systems."
    },
    {
      "Time_Start": 2576.0,
      "Time_End": 2579.0,
      "Text": " Imagine, if you will,"
    },
    {
      "Time_Start": 2579.0,
      "Time_End": 2583.0,
      "Text": " a crew of four, which is what it takes to run an M1,"
    },
    {
      "Time_Start": 2583.0,
      "Time_End": 2587.0,
      "Text": " is captured, taken out of commission for one reason or another,"
    },
    {
      "Time_Start": 2587.0,
      "Time_End": 2592.0,
      "Text": " but the weapon platform, a 60-ton tank capable of vast destruction,"
    },
    {
      "Time_Start": 2592.0,
      "Time_End": 2594.0,
      "Text": " is left in full operational condition."
    },
    {
      "Time_Start": 2594.0,
      "Time_End": 2596.0,
      "Text": " What stops it?"
    },
    {
      "Time_Start": 2596.0,
      "Time_End": 2600.0,
      "Text": " What stops a bad guy of taking that tank,"
    },
    {
      "Time_Start": 2600.0,
      "Time_End": 2602.0,
      "Text": " pushing the start button,"
    },
    {
      "Time_Start": 2602.0,
      "Time_End": 2604.0,
      "Text": " hitting the collectives,"
    },
    {
      "Time_Start": 2604.0,
      "Time_End": 2605.0,
      "Text": " turning the turret around,"
    },
    {
      "Time_Start": 2605.0,
      "Time_End": 2611.0,
      "Text": " and jamming around an HE-1 down the tube back on us?"
    },
    {
      "Time_Start": 2612.0,
      "Time_End": 2615.0,
      "Text": " The truth of the matter today is nothing does."
    },
    {
      "Time_Start": 2616.0,
      "Time_End": 2620.0,
      "Text": " The truth of the matter, in a few years, biometrics will."
    },
    {
      "Time_Start": 2621.0,
      "Time_End": 2623.0,
      "Text": " Because if you're not that tank crew,"
    },
    {
      "Time_Start": 2623.0,
      "Time_End": 2627.0,
      "Text": " and the biosystem doesn't recognize you as being an authorized driver,"
    },
    {
      "Time_Start": 2627.0,
      "Time_End": 2630.0,
      "Text": " shooter, target acquisition, ammo handler,"
    },
    {
      "Time_Start": 2630.0,
      "Time_End": 2633.0,
      "Text": " that tank will be 60 tons of dead weight."
    },
    {
      "Time_Start": 2634.0,
      "Time_End": 2636.0,
      "Text": " And that's exactly what we want."
    },
    {
      "Time_Start": 2637.0,
      "Time_End": 2638.0,
      "Text": " Next chart."
    },
    {
      "Time_Start": 2639.0,
      "Time_End": 2641.0,
      "Text": " Okay, so what?"
    },
    {
      "Time_Start": 2641.0,
      "Time_End": 2644.0,
      "Text": " Well, since this is a hacker convention here,"
    },
    {
      "Time_Start": 2644.0,
      "Time_End": 2647.0,
      "Text": " or I should say an information assurance conference,"
    },
    {
      "Time_Start": 2650.0,
      "Time_End": 2652.0,
      "Text": " this is what we think,"
    },
    {
      "Time_Start": 2652.0,
      "Time_End": 2655.0,
      "Text": " that at the highest, on the higher levels of this analysis,"
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2657.0,
      "Text": " biometrics will do for us."
    },
    {
      "Time_Start": 2657.0,
      "Time_End": 2661.0,
      "Text": " I do want to put kitty scripters and kitty hackers out of business."
    },
    {
      "Time_Start": 2661.0,
      "Time_End": 2663.0,
      "Text": " You irritate the hell out of me."
    },
    {
      "Time_Start": 2663.0,
      "Time_End": 2666.0,
      "Text": " And you cause more damage than you can ever think about."
    },
    {
      "Time_Start": 2667.0,
      "Time_End": 2670.0,
      "Text": " But I know that you're not my biggest threat."
    },
    {
      "Time_Start": 2671.0,
      "Time_End": 2673.0,
      "Text": " I know from a national security perspective"
    },
    {
      "Time_Start": 2673.0,
      "Time_End": 2676.0,
      "Text": " that there are probably better qualified, better trained people,"
    },
    {
      "Time_Start": 2676.0,
      "Time_End": 2678.0,
      "Text": " probably better resourced,"
    },
    {
      "Time_Start": 2678.0,
      "Time_End": 2681.0,
      "Text": " who would like to have access to some of the same things"
    },
    {
      "Time_Start": 2681.0,
      "Time_End": 2684.0,
      "Text": " that we want to hold secure and protected."
    },
    {
      "Time_Start": 2684.0,
      "Time_End": 2687.0,
      "Text": " Target acquisition, intelligence systems, logistic systems,"
    },
    {
      "Time_Start": 2687.0,
      "Time_End": 2689.0,
      "Text": " weapons systems, etc."
    },
    {
      "Time_Start": 2689.0,
      "Time_End": 2692.0,
      "Text": " So we're going to remove the easiest way of getting into the system,"
    },
    {
      "Time_Start": 2692.0,
      "Time_End": 2694.0,
      "Text": " that's the whole password mechanism,"
    },
    {
      "Time_Start": 2694.0,
      "Time_End": 2696.0,
      "Text": " to replace it with biometrics."
    },
    {
      "Time_Start": 2699.0,
      "Time_End": 2701.0,
      "Text": " The other thing I really, really, really want to do,"
    },
    {
      "Time_Start": 2701.0,
      "Time_End": 2703.0,
      "Text": " because I will tell you,"
    },
    {
      "Time_Start": 2703.0,
      "Time_End": 2707.0,
      "Text": " that our soldiers, our war fighters, have enough things to do,"
    },
    {
      "Time_Start": 2707.0,
      "Time_End": 2710.0,
      "Text": " is get rid of the password and the things that they have to memorize,"
    },
    {
      "Time_Start": 2710.0,
      "Time_End": 2712.0,
      "Text": " the things they have to carry with them."
    },
    {
      "Time_Start": 2712.0,
      "Time_End": 2715.0,
      "Text": " Shouldn't have to worry about a pin or a password or anything else."
    },
    {
      "Time_Start": 2715.0,
      "Time_End": 2717.0,
      "Text": " Worry about staying alive,"
    },
    {
      "Time_Start": 2717.0,
      "Time_End": 2719.0,
      "Text": " and worry about executing the mission."
    },
    {
      "Time_Start": 2719.0,
      "Time_End": 2721.0,
      "Text": " That's their primary functions."
    },
    {
      "Time_Start": 2721.0,
      "Time_End": 2723.0,
      "Text": " So we'll take that away."
    },
    {
      "Time_Start": 2723.0,
      "Time_End": 2725.0,
      "Text": " And of course, if the password ain't there,"
    },
    {
      "Time_Start": 2725.0,
      "Time_End": 2727.0,
      "Text": " then the compromise is reduced,"
    },
    {
      "Time_Start": 2727.0,
      "Time_End": 2732.0,
      "Text": " and life is more better for us and our systems as well."
    },
    {
      "Time_Start": 2733.0,
      "Time_End": 2735.0,
      "Text": " Next slide."
    },
    {
      "Time_Start": 2735.0,
      "Time_End": 2737.0,
      "Text": " So if you want to know more,"
    },
    {
      "Time_Start": 2737.0,
      "Time_End": 2740.0,
      "Text": " within the constraints of public information,"
    },
    {
      "Time_Start": 2740.0,
      "Time_End": 2742.0,
      "Text": " here's a website."
    },
    {
      "Time_Start": 2742.0,
      "Time_End": 2745.0,
      "Text": " Obviously, there's a lot of aspects to this program"
    },
    {
      "Time_Start": 2745.0,
      "Time_End": 2747.0,
      "Text": " that we will, on your behalf,"
    },
    {
      "Time_Start": 2747.0,
      "Time_End": 2750.0,
      "Text": " maintain, close, hold, and protect"
    },
    {
      "Time_Start": 2750.0,
      "Time_End": 2752.0,
      "Text": " to ensure that technology doesn't fall into the wrong hands,"
    },
    {
      "Time_Start": 2752.0,
      "Time_End": 2755.0,
      "Text": " or our implementation of it doesn't fall into the wrong hands"
    },
    {
      "Time_Start": 2755.0,
      "Time_End": 2757.0,
      "Text": " for exploitations."
    },
    {
      "Time_Start": 2757.0,
      "Time_End": 2760.0,
      "Text": " Anyway, I appreciate the opportunity to come up here today"
    },
    {
      "Time_Start": 2760.0,
      "Time_End": 2762.0,
      "Text": " and share some of these latest things with you,"
    },
    {
      "Time_Start": 2762.0,
      "Time_End": 2764.0,
      "Text": " and yes, I will take questions."
    },
    {
      "Time_Start": 2764.0,
      "Time_End": 2766.0,
      "Text": " Go ahead."
    },
    {
      "Time_Start": 2766.0,
      "Time_End": 2770.0,
      "Text": " There's a conference on biometrics in D.C. in September."
    },
    {
      "Time_Start": 2770.0,
      "Time_End": 2771.0,
      "Text": " Is it like that?"
    },
    {
      "Time_Start": 2771.0,
      "Time_End": 2773.0,
      "Text": " Are you all going to be part of that?"
    },
    {
      "Time_Start": 2773.0,
      "Time_End": 2775.0,
      "Text": " Yeah, the question was, well, actually it was a comment."
    },
    {
      "Time_Start": 2775.0,
      "Time_End": 2778.0,
      "Text": " He said there's an international biometrics conference"
    },
    {
      "Time_Start": 2778.0,
      "Time_End": 2780.0,
      "Text": " in September in Washington, D.C."
    },
    {
      "Time_Start": 2780.0,
      "Time_End": 2781.0,
      "Text": " Are we going to be part of that?"
    },
    {
      "Time_Start": 2781.0,
      "Time_End": 2783.0,
      "Text": " The answer is absolutely."
    },
    {
      "Time_Start": 2784.0,
      "Time_End": 2786.0,
      "Text": " How do you plan on defeating the insertion"
    },
    {
      "Time_Start": 2786.0,
      "Time_End": 2789.0,
      "Text": " of a digital representation of biometrics"
    },
    {
      "Time_Start": 2789.0,
      "Time_End": 2792.0,
      "Text": " in between the reading device and the authenticating device?"
    },
    {
      "Time_Start": 2792.0,
      "Time_End": 2794.0,
      "Text": " Are you going to be able to do that at all?"
    },
    {
      "Time_Start": 2794.0,
      "Time_End": 2796.0,
      "Text": " I'm not going to tell you the method."
    },
    {
      "Time_Start": 2796.0,
      "Time_End": 2798.0,
      "Text": " The answer is yes, we've addressed that."
    },
    {
      "Time_Start": 2798.0,
      "Time_End": 2802.0,
      "Text": " We've got some courses of action."
    },
    {
      "Time_Start": 2802.0,
      "Time_End": 2805.0,
      "Text": " The question was, how are we going to address"
    },
    {
      "Time_Start": 2805.0,
      "Time_End": 2808.0,
      "Text": " possible exploitation of the biometric template?"
    },
    {
      "Time_Start": 2808.0,
      "Time_End": 2811.0,
      "Text": " In this case, really what he's asking is the initial points"
    },
    {
      "Time_Start": 2811.0,
      "Time_End": 2815.0,
      "Text": " between the reader and the file or the database"
    },
    {
      "Time_Start": 2815.0,
      "Time_End": 2818.0,
      "Text": " that would have the template for correlation."
    },
    {
      "Time_Start": 2818.0,
      "Time_End": 2820.0,
      "Text": " We have recognized that to be an issue,"
    },
    {
      "Time_Start": 2820.0,
      "Time_End": 2825.0,
      "Text": " especially if it's not in a PDS environment"
    },
    {
      "Time_Start": 2825.0,
      "Time_End": 2827.0,
      "Text": " and we have a number of courses of action"
    },
    {
      "Time_Start": 2827.0,
      "Time_End": 2828.0,
      "Text": " that we're exploring today."
    },
    {
      "Time_Start": 2828.0,
      "Time_End": 2830.0,
      "Text": " Right there."
    },
    {
      "Time_Start": 2831.0,
      "Time_End": 2834.0,
      "Text": " You mentioned putting biometrics into tanks"
    },
    {
      "Time_Start": 2834.0,
      "Time_End": 2837.0,
      "Text": " so that it would become an operational team"
    },
    {
      "Time_Start": 2837.0,
      "Time_End": 2840.0,
      "Text": " rather than a reauthorized person."
    },
    {
      "Time_Start": 2840.0,
      "Time_End": 2842.0,
      "Text": " But if the tank were actually to get captured,"
    },
    {
      "Time_Start": 2842.0,
      "Time_End": 2845.0,
      "Text": " chances are whoever captured it would be able to look at it"
    },
    {
      "Time_Start": 2845.0,
      "Time_End": 2849.0,
      "Text": " at a later time, probably after it's time being detected."
    },
    {
      "Time_Start": 2849.0,
      "Time_End": 2853.0,
      "Text": " In any system where the tank will destroy itself,"
    },
    {
      "Time_Start": 2853.0,
      "Time_End": 2857.0,
      "Text": " would it be able to find the person who captured it?"
    },
    {
      "Time_Start": 2857.0,
      "Time_End": 2858.0,
      "Text": " That's a good question."
    },
    {
      "Time_Start": 2858.0,
      "Time_End": 2861.0,
      "Text": " I'll repeat the question in less words than you used."
    },
    {
      "Time_Start": 2861.0,
      "Time_End": 2864.0,
      "Text": " The question was, when I mentioned the example of the tank"
    },
    {
      "Time_Start": 2864.0,
      "Time_End": 2866.0,
      "Text": " and putting biometric templates in there"
    },
    {
      "Time_Start": 2866.0,
      "Time_End": 2868.0,
      "Text": " and then becoming basically a paperweight"
    },
    {
      "Time_Start": 2868.0,
      "Time_End": 2870.0,
      "Text": " when the true crew was extracted,"
    },
    {
      "Time_Start": 2870.0,
      "Time_End": 2872.0,
      "Text": " his comments were, I believe,"
    },
    {
      "Time_Start": 2872.0,
      "Time_End": 2875.0,
      "Text": " what prevents the people who now own the tank"
    },
    {
      "Time_Start": 2875.0,
      "Time_End": 2879.0,
      "Text": " from putting their own stuff in there?"
    },
    {
      "Time_Start": 2879.0,
      "Time_End": 2881.0,
      "Text": " A lot."
    },
    {
      "Time_Start": 2881.0,
      "Time_End": 2883.0,
      "Text": " Let me see the best way I can describe this."
    },
    {
      "Time_Start": 2883.0,
      "Time_End": 2886.0,
      "Text": " In our battlefield visualization capability,"
    },
    {
      "Time_Start": 2886.0,
      "Time_End": 2889.0,
      "Text": " all of the weapons systems are interconnected."
    },
    {
      "Time_Start": 2889.0,
      "Time_End": 2891.0,
      "Text": " Upon a failure to authenticate"
    },
    {
      "Time_Start": 2891.0,
      "Time_End": 2896.0,
      "Text": " or a failure to re-recognize a team or a team component,"
    },
    {
      "Time_Start": 2896.0,
      "Time_End": 2899.0,
      "Text": " that system can be remotely decommissioned."
    },
    {
      "Time_Start": 2899.0,
      "Time_End": 2901.0,
      "Text": " Turn off the fuel system."
    },
    {
      "Time_Start": 2901.0,
      "Time_End": 2903.0,
      "Text": " Do all kinds of other things."
    },
    {
      "Time_Start": 2903.0,
      "Time_End": 2905.0,
      "Text": " So there's still stuff there."
    },
    {
      "Time_Start": 2905.0,
      "Time_End": 2907.0,
      "Text": " Ma'am?"
    },
    {
      "Time_Start": 2907.0,
      "Time_End": 2916.0,
      "Text": " You must be a sci-fi fan."
    },
    {
      "Time_Start": 2916.0,
      "Time_End": 2917.0,
      "Text": " I like that."
    },
    {
      "Time_Start": 2917.0,
      "Time_End": 2918.0,
      "Text": " The question was,"
    },
    {
      "Time_Start": 2918.0,
      "Time_End": 2921.0,
      "Text": " what prevents the enemy from cutting off fingers and eyeballs?"
    },
    {
      "Time_Start": 2921.0,
      "Time_End": 2922.0,
      "Text": " And I will tell you,"
    },
    {
      "Time_Start": 2922.0,
      "Time_End": 2925.0,
      "Text": " it brings a lot of chuckles to the audience,"
    },
    {
      "Time_Start": 2925.0,
      "Time_End": 2927.0,
      "Text": " but your elected officials on Capitol Hill"
    },
    {
      "Time_Start": 2927.0,
      "Time_End": 2929.0,
      "Text": " asked me the same question."
    },
    {
      "Time_Start": 2929.0,
      "Time_End": 2932.0,
      "Text": " And the answer at that time was, nothing."
    },
    {
      "Time_Start": 2932.0,
      "Time_End": 2934.0,
      "Text": " That was two years ago."
    },
    {
      "Time_Start": 2934.0,
      "Time_End": 2937.0,
      "Text": " And we refused to do anything in biometrics two years ago"
    },
    {
      "Time_Start": 2937.0,
      "Time_End": 2940.0,
      "Text": " because the state of the technology would, at that time,"
    },
    {
      "Time_Start": 2940.0,
      "Time_End": 2942.0,
      "Text": " allow you to cut off a finger"
    },
    {
      "Time_Start": 2942.0,
      "Time_End": 2944.0,
      "Text": " and go back in and poke it in and let you in."
    },
    {
      "Time_Start": 2944.0,
      "Time_End": 2947.0,
      "Text": " The state of technology today does not."
    },
    {
      "Time_Start": 2947.0,
      "Time_End": 2948.0,
      "Text": " It's got to be alive."
    },
    {
      "Time_Start": 2948.0,
      "Time_End": 2950.0,
      "Text": " There's got to be blood flow."
    },
    {
      "Time_Start": 2950.0,
      "Time_End": 2952.0,
      "Text": " So you can't pull out an eyeball and stick it up front"
    },
    {
      "Time_Start": 2952.0,
      "Time_End": 2954.0,
      "Text": " or take a finger."
    },
    {
      "Time_Start": 2954.0,
      "Time_End": 2957.0,
      "Text": " And that's why we didn't take biometrics that seriously"
    },
    {
      "Time_Start": 2957.0,
      "Time_End": 2959.0,
      "Text": " a couple of years ago."
    },
    {
      "Time_Start": 2959.0,
      "Time_End": 2961.0,
      "Text": " So we don't expect to see a lot of soldiers"
    },
    {
      "Time_Start": 2961.0,
      "Time_End": 2964.0,
      "Text": " with missing fingers and eyeballs on the battlefield."
    },
    {
      "Time_Start": 2978.0,
      "Time_End": 2980.0,
      "Text": " Well, I think the question was,"
    },
    {
      "Time_Start": 2980.0,
      "Time_End": 2981.0,
      "Text": " or the comment was,"
    },
    {
      "Time_Start": 2981.0,
      "Time_End": 2984.0,
      "Text": " no one can force me to give up the password,"
    },
    {
      "Time_Start": 2984.0,
      "Time_End": 2988.0,
      "Text": " but someone can force me to put my finger on a sensor."
    },
    {
      "Time_Start": 2989.0,
      "Time_End": 2991.0,
      "Text": " I think that in that environment,"
    },
    {
      "Time_Start": 2991.0,
      "Time_End": 2993.0,
      "Text": " if you're there and they're putting a gun up your nose,"
    },
    {
      "Time_Start": 2993.0,
      "Time_End": 2995.0,
      "Text": " you'll probably do whatever they tell you."
    },
    {
      "Time_Start": 3006.0,
      "Time_End": 3008.0,
      "Text": " I'm sorry, you're going to have to say the question again."
    },
    {
      "Time_Start": 3008.0,
      "Time_End": 3011.0,
      "Text": " What is the significance of using biometrics"
    },
    {
      "Time_Start": 3011.0,
      "Time_End": 3013.0,
      "Text": " when you're standing out of the window?"
    },
    {
      "Time_Start": 3017.0,
      "Time_End": 3019.0,
      "Text": " Go ahead, go ahead."
    },
    {
      "Time_Start": 3019.0,
      "Time_End": 3020.0,
      "Text": " The question was, why are you doing this"
    },
    {
      "Time_Start": 3020.0,
      "Time_End": 3022.0,
      "Text": " if you're still using windows?"
    },
    {
      "Time_Start": 3025.0,
      "Time_End": 3027.0,
      "Text": " We've got your name and picture now, sir."
    },
    {
      "Time_Start": 3031.0,
      "Time_End": 3035.0,
      "Text": " I've noticed that you kind of glossed over"
    },
    {
      "Time_Start": 3035.0,
      "Time_End": 3038.0,
      "Text": " whether it's a study lab or a command center"
    },
    {
      "Time_Start": 3038.0,
      "Time_End": 3042.0,
      "Text": " or a social and legal aspect."
    },
    {
      "Time_Start": 3045.0,
      "Time_End": 3048.0,
      "Text": " Who, in the end, is going to be able to develop"
    },
    {
      "Time_Start": 3048.0,
      "Time_End": 3052.0,
      "Text": " and own this information that's being gathered"
    },
    {
      "Time_Start": 3052.0,
      "Time_End": 3054.0,
      "Text": " on each individual person?"
    },
    {
      "Time_Start": 3054.0,
      "Time_End": 3058.0,
      "Text": " And what kinds of safeties are there in terms of"
    },
    {
      "Time_Start": 3058.0,
      "Time_End": 3060.0,
      "Text": " the individual?"
    },
    {
      "Time_Start": 3061.0,
      "Time_End": 3062.0,
      "Text": " Good question."
    },
    {
      "Time_Start": 3062.0,
      "Time_End": 3064.0,
      "Text": " Let me sum up her comment and question."
    },
    {
      "Time_Start": 3064.0,
      "Time_End": 3067.0,
      "Text": " In the end, she says I kind of glanced over"
    },
    {
      "Time_Start": 3067.0,
      "Time_End": 3070.0,
      "Text": " the whole issue of ownership of the template,"
    },
    {
      "Time_Start": 3070.0,
      "Time_End": 3073.0,
      "Text": " protection of the template, and privacy and so forth."
    },
    {
      "Time_Start": 3073.0,
      "Time_End": 3075.0,
      "Text": " Remember I said the first thing we do"
    },
    {
      "Time_Start": 3075.0,
      "Time_End": 3077.0,
      "Text": " is a social and legal study."
    },
    {
      "Time_Start": 3077.0,
      "Time_End": 3080.0,
      "Text": " In there, before we got the marching orders to move on,"
    },
    {
      "Time_Start": 3080.0,
      "Time_End": 3084.0,
      "Text": " we committed very strongly to a couple of principles on here."
    },
    {
      "Time_Start": 3084.0,
      "Time_End": 3086.0,
      "Text": " Number one, you run the template."
    },
    {
      "Time_Start": 3086.0,
      "Time_End": 3089.0,
      "Text": " We would only use the template upon a written agreement"
    },
    {
      "Time_Start": 3089.0,
      "Time_End": 3091.0,
      "Text": " in other conditions that we have mutually agreed upon."
    },
    {
      "Time_Start": 3091.0,
      "Time_End": 3093.0,
      "Text": " Therefore, if you give up your template"
    },
    {
      "Time_Start": 3093.0,
      "Time_End": 3096.0,
      "Text": " or your fingerprint for access to a restricted area,"
    },
    {
      "Time_Start": 3096.0,
      "Time_End": 3098.0,
      "Text": " that's all I'm going to use it for."
    },
    {
      "Time_Start": 3098.0,
      "Time_End": 3100.0,
      "Text": " It doesn't matter to us at this point"
    },
    {
      "Time_Start": 3100.0,
      "Time_End": 3102.0,
      "Text": " if they come in and give us a federal warrant."
    },
    {
      "Time_Start": 3102.0,
      "Time_End": 3104.0,
      "Text": " They're not going to get that template."
    },
    {
      "Time_Start": 3104.0,
      "Time_End": 3107.0,
      "Text": " We're doing the same security oversight and protection"
    },
    {
      "Time_Start": 3107.0,
      "Time_End": 3110.0,
      "Text": " as currently is enjoyed by the DNA repository."
    },
    {
      "Time_Start": 3110.0,
      "Time_End": 3113.0,
      "Text": " I'm going to take about two more questions"
    },
    {
      "Time_Start": 3113.0,
      "Time_End": 3115.0,
      "Text": " and then I've got to get off the stage."
    },
    {
      "Time_Start": 3115.0,
      "Time_End": 3117.0,
      "Text": " I've got to get on this side."
    },
    {
      "Time_Start": 3117.0,
      "Time_End": 3120.0,
      "Text": " This actually goes back to the tanks in the AO."
    },
    {
      "Time_Start": 3120.0,
      "Time_End": 3123.0,
      "Text": " If you have a woman crew and the crew is secure,"
    },
    {
      "Time_Start": 3123.0,
      "Time_End": 3126.0,
      "Text": " I don't know if you can take out an entire tank"
    },
    {
      "Time_Start": 3126.0,
      "Time_End": 3129.0,
      "Text": " by killing your own member with the tons of bullets"
    },
    {
      "Time_Start": 3129.0,
      "Time_End": 3132.0,
      "Text": " or if you can put bullets in the hull of the vehicle"
    },
    {
      "Time_Start": 3132.0,
      "Time_End": 3134.0,
      "Text": " so she won't be able to walk out of there."
    },
    {
      "Time_Start": 3134.0,
      "Time_End": 3137.0,
      "Text": " Do you have something to say about that?"
    },
    {
      "Time_Start": 3137.0,
      "Time_End": 3140.0,
      "Text": " Roger, the question was if one member of a tank,"
    },
    {
      "Time_Start": 3140.0,
      "Time_End": 3143.0,
      "Text": " using the tank example, is killed or out of commission,"
    },
    {
      "Time_Start": 3143.0,
      "Time_End": 3145.0,
      "Text": " because that one member is missing,"
    },
    {
      "Time_Start": 3145.0,
      "Time_End": 3148.0,
      "Text": " what's the consequence to the remaining team members"
    },
    {
      "Time_Start": 3148.0,
      "Time_End": 3150.0,
      "Text": " and the operation of the tank?"
    },
    {
      "Time_Start": 3150.0,
      "Time_End": 3153.0,
      "Text": " The operational concept on this is that right now"
    },
    {
      "Time_Start": 3153.0,
      "Time_End": 3156.0,
      "Text": " each tank member is physically cross-trained to"
    },
    {
      "Time_Start": 3156.0,
      "Time_End": 3159.0,
      "Text": " a driver can shoot, a shooter can do acquisition, etc."
    },
    {
      "Time_Start": 3159.0,
      "Time_End": 3161.0,
      "Text": " It's the same kind of piece."
    },
    {
      "Time_Start": 3161.0,
      "Time_End": 3165.0,
      "Text": " The TC who is God in that tank determines what that tank will do"
    },
    {
      "Time_Start": 3165.0,
      "Time_End": 3168.0,
      "Text": " or the acting TC or the backup TC."
    },
    {
      "Time_Start": 3168.0,
      "Time_End": 3170.0,
      "Text": " Do you still have that?"
    },
    {
      "Time_Start": 3170.0,
      "Time_End": 3172.0,
      "Text": " No, you do not need all four members."
    },
    {
      "Time_Start": 3172.0,
      "Time_End": 3174.0,
      "Text": " Right in the back there."
    },
    {
      "Time_Start": 3175.0,
      "Time_End": 3178.0,
      "Text": " It surprised me a little bit when you talked about"
    },
    {
      "Time_Start": 3178.0,
      "Time_End": 3183.0,
      "Text": " using biometrics and replacing passwords or security tokens."
    },
    {
      "Time_Start": 3183.0,
      "Time_End": 3186.0,
      "Text": " Obviously, you must be confident because you've got this money and things,"
    },
    {
      "Time_Start": 3186.0,
      "Time_End": 3190.0,
      "Text": " but do you think that you can really get enough success rate"
    },
    {
      "Time_Start": 3190.0,
      "Time_End": 3195.0,
      "Text": " under combat conditions to do away with passwords or security tokens?"
    },
    {
      "Time_Start": 3197.0,
      "Time_End": 3200.0,
      "Text": " Okay, let me see if I can sum up your question."
    },
    {
      "Time_Start": 3200.0,
      "Time_End": 3203.0,
      "Text": " Do we really think we can do away with passwords"
    },
    {
      "Time_Start": 3203.0,
      "Time_End": 3206.0,
      "Text": " in a combat environment with this technology?"
    },
    {
      "Time_Start": 3206.0,
      "Time_End": 3208.0,
      "Text": " Yes."
    },
    {
      "Time_Start": 3208.0,
      "Time_End": 3210.0,
      "Text": " That's what the commercial drives."
    },
    {
      "Time_Start": 3210.0,
      "Time_End": 3212.0,
      "Text": " Roger."
    },
    {
      "Time_Start": 3212.0,
      "Time_End": 3214.0,
      "Text": " One more, ma'am."
    },
    {
      "Time_Start": 3214.0,
      "Time_End": 3216.0,
      "Text": " All right, sir."
    },
    {
      "Time_Start": 3220.0,
      "Time_End": 3222.0,
      "Text": " Where are they, URL? Okay."
    },
    {
      "Time_Start": 3222.0,
      "Time_End": 3224.0,
      "Text": " All right, ladies and gentlemen."
    },
    {
      "Time_Start": 3224.0,
      "Time_End": 3226.0,
      "Text": " I'm out of my time and there's other people coming,"
    },
    {
      "Time_Start": 3226.0,
      "Time_End": 3228.0,
      "Text": " so thank you very much."
    }
  ]
}