{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 28.28,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Michael Martinez. I am a technology reporter for abcnews.com. That's the online"
    },
    {
      "Time_Start": 28.28,
      "Time_End": 32.72,
      "Text": " version of the News Network. Yes, mainstream media has found you guys and we're not gonna"
    },
    {
      "Time_Start": 32.72,
      "Time_End": 37.120000000000005,
      "Text": " let go at this point. For the past year and a half I've had the distinct pleasure of covering"
    },
    {
      "Time_Start": 37.120000000000005,
      "Time_End": 42.120000000000005,
      "Text": " the hacker community. It's not to say that it's always been a laugh, but I've learned"
    },
    {
      "Time_Start": 42.120000000000005,
      "Time_End": 49.84,
      "Text": " more as I've done the beat and it's been a lot of fun. And I'm here mostly out of enlightened"
    },
    {
      "Time_Start": 49.84,
      "Time_End": 58.720000000000006,
      "Text": " self-interest to talk a little bit about who we are, what we do, and to try to give"
    },
    {
      "Time_Start": 58.720000000000006,
      "Time_End": 63.88,
      "Text": " you guys some hints for when the next clueless reporter comes up and says, hey man, what's"
    },
    {
      "Time_Start": 63.88,
      "Time_End": 71.72,
      "Text": " it like to be a hacker? You may not have read all my stories on abcnews.com, mostly because"
    },
    {
      "Time_Start": 71.72,
      "Time_End": 79.76,
      "Text": " they're not written for you guys. I hate saying that, but when I write it is for average folks."
    },
    {
      "Time_Start": 80.72,
      "Time_End": 86.52000000000001,
      "Text": " I'm trying to explain this stuff basically to your mom and your grandma. And sometimes"
    },
    {
      "Time_Start": 86.52000000000001,
      "Time_End": 92.36,
      "Text": " it's a little hard and definitely sometimes things get lost in translation. I had a PowerPoint"
    },
    {
      "Time_Start": 92.36,
      "Time_End": 95.52000000000001,
      "Text": " presentation, but I think the Cult of the Dead Cow set up a lot of stuff so I don't"
    },
    {
      "Time_Start": 95.52000000000001,
      "Time_End": 99.16000000000001,
      "Text": " want to mess with it too much. Apparently it's gonna be a heck of a show. I feel like"
    },
    {
      "Time_Start": 99.16000000000001,
      "Time_End": 109.72,
      "Text": " the opening act. Covering an underground community such as you guys is tough. It is tough to"
    },
    {
      "Time_Start": 109.72,
      "Time_End": 117.03999999999999,
      "Text": " find you out there unless you're at a conference like this. It's tough to know who is a credible"
    },
    {
      "Time_Start": 117.03999999999999,
      "Time_End": 124.56,
      "Text": " hacker, who is somebody who just hangs out in IRC with a funky name. So there are ways"
    },
    {
      "Time_Start": 124.56,
      "Time_End": 129.07999999999998,
      "Text": " we can help each other. One of the biggest complaints I get is that we don't get anything"
    },
    {
      "Time_Start": 129.07999999999998,
      "Time_End": 135.44,
      "Text": " right. One of the biggest complaints I have is, well, where do I find the information?"
    },
    {
      "Time_Start": 135.44,
      "Time_End": 140.84,
      "Text": " So I want to start with a story. Last month in the wake of that Explorer zip worm, which"
    },
    {
      "Time_Start": 140.84,
      "Time_End": 146.24,
      "Text": " was a lot of fun, I got an email from a reader. I get a lot of reader email. I like having"
    },
    {
      "Time_Start": 146.24,
      "Time_End": 150.76,
      "Text": " that conversation with the reader because you don't get that in newspapers or television"
    },
    {
      "Time_Start": 150.76,
      "Time_End": 154.36,
      "Text": " or anything else. The readers can tell you exactly what they want, exactly what they"
    },
    {
      "Time_Start": 154.36,
      "Time_End": 159.64,
      "Text": " think of you. Sometimes that's good, sometimes not. But this one was interesting. He wrote"
    },
    {
      "Time_Start": 159.64000000000001,
      "Time_End": 165.8,
      "Text": " after the worm story, how is it that you reporters don't get it? Isn't it obvious that"
    },
    {
      "Time_Start": 165.8,
      "Time_End": 172.4,
      "Text": " this virus writer is punishing users of Microsoft software? Probably because he hates Microsoft."
    },
    {
      "Time_Start": 172.4,
      "Time_End": 177.84,
      "Text": " The only thing I can say about people who report on viruses is, duh. Followed by a lot"
    },
    {
      "Time_Start": 177.84,
      "Time_End": 186.44000000000003,
      "Text": " of H's. The reader might be right. I don't know why the person who wrote Explorer zip"
    },
    {
      "Time_Start": 186.68,
      "Time_End": 192.68,
      "Text": " wrote that virus. And to expect that I would is kind of difficult. If the virus writer"
    },
    {
      "Time_Start": 192.68,
      "Time_End": 196.76,
      "Text": " would love to come forward, I'd love to get him for an interview. We don't know why. And"
    },
    {
      "Time_Start": 196.76,
      "Time_End": 201.8,
      "Text": " that's one of the things that I think sometimes when dealing with you folks doesn't get understood."
    },
    {
      "Time_Start": 201.8,
      "Time_End": 206.88,
      "Text": " We have rules. There's stuff that we have to do. We have to get the other side of the"
    },
    {
      "Time_Start": 206.88,
      "Time_End": 211.28,
      "Text": " story. When something like a back orifice comes out, we have to talk to people who are"
    },
    {
      "Time_Start": 211.28,
      "Time_End": 217.44,
      "Text": " going to get affected by it and who are going to get royally screwed. That's going to make"
    },
    {
      "Time_Start": 217.44,
      "Time_End": 224.12,
      "Text": " you guys look a little bad. Especially when you get out there and use it. So anyway, next"
    },
    {
      "Time_Start": 224.12,
      "Time_End": 229.44,
      "Text": " time you guys deal with us, we'll give you a little information here. So that would be"
    },
    {
      "Time_Start": 229.44,
      "Time_End": 234.32,
      "Text": " a little less painful. So who covers hacking? For the longest time you had folks in the"
    },
    {
      "Time_Start": 234.32,
      "Time_End": 243.95999999999998,
      "Text": " tech press. You had CNET, ZDNet, Wired, TechWeb, obviously your own publications like 2600,"
    },
    {
      "Time_Start": 243.95999999999998,
      "Time_End": 249.4,
      "Text": " Hacker News Network, and Attrition. I've been skewered by HNN and Attrition in the past."
    },
    {
      "Time_Start": 249.4,
      "Time_End": 255.76,
      "Text": " It keeps me honest. And recently, I would say probably in the last two years, you've"
    },
    {
      "Time_Start": 255.76,
      "Time_End": 260.56,
      "Text": " had mainstream press. You're talking about me, abcnews.com. You're talking about some"
    },
    {
      "Time_Start": 260.56,
      "Time_End": 265.08,
      "Text": " of the folks that I've met here at this conference. And you'd be surprised. 60 Minutes is here."
    },
    {
      "Time_Start": 265.08,
      "Time_End": 270.44,
      "Text": " The Wall Street Journal. New York Times Magazine. Millions and millions of people are going"
    },
    {
      "Time_Start": 270.44,
      "Time_End": 275.52,
      "Text": " to be hearing about you. Sometimes some of them for the first time. But the scary thing"
    },
    {
      "Time_Start": 275.52,
      "Time_End": 282.08,
      "Text": " is we're not going to go away. Now that everybody is getting more wired into the internet and"
    },
    {
      "Time_Start": 282.08,
      "Time_End": 286.52,
      "Text": " to everything else, mainstream reporters are going to get into it and are going to notice"
    },
    {
      "Time_Start": 286.52,
      "Time_End": 291.03999999999996,
      "Text": " the next time a mill site goes down. They're going to notice the next time the Keebler"
    },
    {
      "Time_Start": 291.03999999999996,
      "Time_End": 299.28,
      "Text": " elves pull something. Got some elves here today? And the scary thing is that these mainstream"
    },
    {
      "Time_Start": 299.28,
      "Time_End": 304.28,
      "Text": " reporters are not tech press. A little bit of my background, I've only been covering"
    },
    {
      "Time_Start": 304.28,
      "Time_End": 310.15999999999997,
      "Text": " technology for a year and a half. Before that, I was covering politics for the Associated"
    },
    {
      "Time_Start": 310.16,
      "Time_End": 315.88000000000005,
      "Text": " Press in Albany, New York. I figure if I can handle New York politics, this is not"
    },
    {
      "Time_Start": 315.88000000000005,
      "Time_End": 322.84000000000003,
      "Text": " too bad. If I can handle Al D'Amato on a bad day. So they're generalists. And the knowledge"
    },
    {
      "Time_Start": 322.84000000000003,
      "Time_End": 330.16,
      "Text": " of technology is scatter shot. You're going to get reporters who are very, very knowledgeable."
    },
    {
      "Time_Start": 330.16,
      "Time_End": 336.0,
      "Text": " I know some of my colleagues here are extremely knowledgeable. You're going to get reporters"
    },
    {
      "Time_Start": 336.0,
      "Time_End": 340.36,
      "Text": " who, the only reason they're a tech writer at their particular publication or television"
    },
    {
      "Time_Start": 340.36,
      "Time_End": 347.68,
      "Text": " station is because they can surf the web really, really well. That's it. And then there are"
    },
    {
      "Time_Start": 347.68,
      "Time_End": 354.04,
      "Text": " the preconceptions. Especially for reporters tackling this for the first time, their perception"
    },
    {
      "Time_Start": 354.04,
      "Time_End": 365.68,
      "Text": " of a hacker is war games. Maybe the Matrix. I actually saw that last night in the hotel."
    },
    {
      "Time_Start": 366.36,
      "Time_End": 371.0,
      "Text": " And with those preconceptions in mind, they may not even realize that they can contact"
    },
    {
      "Time_Start": 371.0,
      "Time_End": 375.32,
      "Text": " a hacking group. They might not realize that there is a Cult of the Dead Cow website with"
    },
    {
      "Time_Start": 375.32,
      "Time_End": 383.72,
      "Text": " a press at cultdeddcow.com. And the initial reporting is going to be very, very one-sided."
    },
    {
      "Time_Start": 383.72,
      "Time_End": 388.6,
      "Text": " The resources aren't out there. Where do I find some hackers? I remember the first time"
    },
    {
      "Time_Start": 388.6,
      "Time_End": 393.14,
      "Text": " I had to cover a story like that. I went to the web and I actually printed out some search"
    },
    {
      "Time_Start": 393.18,
      "Time_End": 400.9,
      "Text": " engine results, which will probably surprise you. Probably shock you. So, well, some of"
    },
    {
      "Time_Start": 400.9,
      "Time_End": 407.18,
      "Text": " them did say sex. Absolutely. Probably some hacker who really just wanted to have a really"
    },
    {
      "Time_Start": 407.18,
      "Time_End": 412.38,
      "Text": " good sexy image. I don't know. Some of the hacking sites on Yahoo, for example, that"
    },
    {
      "Time_Start": 412.38,
      "Time_End": 414.18,
      "Text": " have come up with a search. What's that?"
    },
    {
      "Time_Start": 414.18,
      "Time_End": 422.42,
      "Text": " What did you put in the search engine? Hacker. Pretty simple. You get the Hacker's Defense"
    },
    {
      "Time_Start": 422.42,
      "Time_End": 432.94,
      "Text": " Fund. You get some Kevin Mitnick sites. You get the Happy Hacker. You get ANSI Online."
    },
    {
      "Time_Start": 432.94,
      "Time_End": 437.14,
      "Text": " Actually in this one, you don't get attrition.org. You don't get Hacker News Network. You don't"
    },
    {
      "Time_Start": 437.14,
      "Time_End": 441.1,
      "Text": " get Cult of the Dead Cow. You don't get The Loft. You don't get these things. And for"
    },
    {
      "Time_Start": 441.1,
      "Time_End": 446.58000000000004,
      "Text": " a reporter who's doing this for the first time, where are you going to go? ANSI Online,"
    },
    {
      "Time_Start": 446.58000000000004,
      "Time_End": 450.86,
      "Text": " an archive of hacking-related materials. Everything from file archives to its very own zine. Well,"
    },
    {
      "Time_Start": 450.86,
      "Time_End": 456.42,
      "Text": " you know, that sounds good. I'm not going to comment on what that site has been up to"
    },
    {
      "Time_Start": 456.42,
      "Time_End": 462.70000000000005,
      "Text": " lately, but I know that it's kind of waned in popularity as seen by this little wanted"
    },
    {
      "Time_Start": 462.7,
      "Time_End": 471.38,
      "Text": " poster here. So, obviously, finding you guys is tough. Then the next problem is how do"
    },
    {
      "Time_Start": 471.38,
      "Time_End": 478.65999999999997,
      "Text": " I confirm who they are and how good they are? Say I go, actually, I'm a reporter who actually"
    },
    {
      "Time_Start": 478.65999999999997,
      "Time_End": 485.62,
      "Text": " knows about IRC, and I go to Pound Hack Freak or Pound Hack or something. And I get somebody"
    },
    {
      "Time_Start": 485.62,
      "Time_End": 492.3,
      "Text": " who, you know, uses a lot of threes when he spells. And I think, ooh, that's kind of"
    },
    {
      "Time_Start": 492.3,
      "Time_End": 497.58,
      "Text": " funky. Maybe he's a hacker. Maybe he's a script kitty who has, you know, maybe two layers"
    },
    {
      "Time_Start": 497.58,
      "Time_End": 503.62,
      "Text": " on his hard drive. I don't know. How do I confirm you guys? How do I know who you are"
    },
    {
      "Time_Start": 503.62,
      "Time_End": 507.1,
      "Text": " and what your skill level is and whether or not you guys are a credible source for the"
    },
    {
      "Time_Start": 507.1,
      "Time_End": 513.3,
      "Text": " story I'm working on? And then, finally, where do I go to get a counterpoint to balance whatever"
    },
    {
      "Time_Start": 513.3,
      "Time_End": 518.06,
      "Text": " hacking comment I get? And, again, that's just as hit and miss. Obviously, if I'm covering"
    },
    {
      "Time_Start": 518.06,
      "Time_End": 523.02,
      "Text": " a story on a site that's been hacked, I'm going to go to the person whose site was hacked."
    },
    {
      "Time_Start": 523.02,
      "Time_End": 528.5799999999999,
      "Text": " And I'm going to say, how did it feel? And they're going to say it sucked. What did you"
    },
    {
      "Time_Start": 528.5799999999999,
      "Time_End": 534.3399999999999,
      "Text": " do wrong? I don't know. We're still working on it. The counterpoint will be there. That's"
    },
    {
      "Time_Start": 534.3399999999999,
      "Time_End": 540.3,
      "Text": " not the hard part. It's just getting your guys, your viewpoints, your ethics, your idea"
    },
    {
      "Time_Start": 540.3,
      "Time_End": 546.26,
      "Text": " of what happened and why into the stories. So say I actually find that. Say I actually"
    },
    {
      "Time_Start": 546.26,
      "Time_End": 552.54,
      "Text": " have my facts straight. Say I didn't go to ANSI Online or anything else like that. There's"
    },
    {
      "Time_Start": 552.54,
      "Time_End": 558.6999999999999,
      "Text": " still a lot of room for error. Something called the editing process, which I hate. In print,"
    },
    {
      "Time_Start": 558.6999999999999,
      "Time_End": 562.06,
      "Text": " the story goes from the reporter, who did all the fact gathering and the writing, to"
    },
    {
      "Time_Start": 562.06,
      "Time_End": 567.6999999999999,
      "Text": " the editor. The editor changes things. It goes from the editor back to the reporter"
    },
    {
      "Time_Start": 567.7,
      "Time_End": 571.26,
      "Text": " and then back to the editor a couple times, depending on how good the reporter was the"
    },
    {
      "Time_Start": 571.26,
      "Time_End": 576.6600000000001,
      "Text": " first time. And then it goes to the fact checker. Then it goes to the copy editor. Then it"
    },
    {
      "Time_Start": 576.6600000000001,
      "Time_End": 581.0200000000001,
      "Text": " goes to the layout editor. And at each stage, this story has changed. And it's kind of like"
    },
    {
      "Time_Start": 581.0200000000001,
      "Time_End": 584.86,
      "Text": " that game of telephone when you were a kid and you pass a phrase around, whispering in"
    },
    {
      "Time_Start": 584.86,
      "Time_End": 590.9000000000001,
      "Text": " your ear. By the end, and I've seen it happen, you're going to get something that can look"
    },
    {
      "Time_Start": 590.9000000000001,
      "Time_End": 594.98,
      "Text": " really different from what you intended. And in broadcast, of course, there's all that."
    },
    {
      "Time_Start": 594.98,
      "Time_End": 598.9,
      "Text": " Plus then you add video, graphics, sound mixing, additional writing for the stand-up,"
    },
    {
      "Time_Start": 598.9,
      "Time_End": 604.78,
      "Text": " additional writing for the anchor. You can see why this may be just a little difficult"
    },
    {
      "Time_Start": 604.78,
      "Time_End": 609.62,
      "Text": " to get the facts straight sometimes. So why are we covering hacking? Why do we do all"
    },
    {
      "Time_Start": 609.62,
      "Time_End": 617.0600000000001,
      "Text": " this stuff? To make money. That's a very good answer. Hacking is, to reporters and to the"
    },
    {
      "Time_Start": 617.0600000000001,
      "Time_End": 624.5,
      "Text": " public, it is a cool topic. It is sexy. It will sell papers. You didn't think of yourselves"
    },
    {
      "Time_Start": 624.5,
      "Time_End": 637.26,
      "Text": " as sexy, did you? It's true. Well, yes, you are, sir. It is almost guaranteed readership."
    },
    {
      "Time_Start": 637.26,
      "Time_End": 643.34,
      "Text": " I look at the site stats for my stories and whenever I hit something on hacking, you know,"
    },
    {
      "Time_Start": 643.34,
      "Time_End": 647.26,
      "Text": " I get 50% more hits on these stories just because people are like, ooh, it's dangerous."
    },
    {
      "Time_Start": 647.26,
      "Time_End": 651.3,
      "Text": " Is my computer in trouble? You know, the next time I play Quake, am I going to have an erased"
    },
    {
      "Time_Start": 651.3000000000001,
      "Time_End": 658.0600000000001,
      "Text": " hard drive? Who knows? Plus, you have people calling themselves hackers. Whether or not"
    },
    {
      "Time_Start": 658.0600000000001,
      "Time_End": 663.46,
      "Text": " you guys consider them hackers, they're going in, they're defacing websites. They're calling"
    },
    {
      "Time_Start": 663.46,
      "Time_End": 668.94,
      "Text": " themselves hackers. They're calling what they do hacks. And we gotta cover it when you hit"
    },
    {
      "Time_Start": 668.94,
      "Time_End": 673.7800000000001,
      "Text": " a big site. When you hit the New York Times, you know, jeez, I gotta call those folks up"
    },
    {
      "Time_Start": 673.7800000000001,
      "Time_End": 679.46,
      "Text": " because that's huge. When you hit government sites, when you hit senate.gov, well, I mean,"
    },
    {
      "Time_Start": 679.46,
      "Time_End": 686.46,
      "Text": " I gotta stand up and do a story. So, that of course leads to certain preconceptions"
    },
    {
      "Time_Start": 686.46,
      "Time_End": 691.4200000000001,
      "Text": " of what you guys think of us. What do you guys think of the media? When you get, when"
    },
    {
      "Time_Start": 691.4200000000001,
      "Time_End": 699.14,
      "Text": " you read stories, well, all right, let me rephrase that. Because he really, he doesn't"
    },
    {
      "Time_Start": 699.14,
      "Time_End": 710.18,
      "Text": " hack a lot. Well, not on computers. More of a slash or a, ew. What do you guys think"
    },
    {
      "Time_Start": 710.18,
      "Time_End": 713.1,
      "Text": " of reporting that is done on hackers? What are the big problems there?"
    },
    {
      "Time_Start": 713.1,
      "Time_End": 723.3,
      "Text": " Isn't ABC the one owned by Disney now? Yes. We are all going to answer to the mouse. Yes."
    },
    {
      "Time_Start": 723.3,
      "Time_End": 729.12,
      "Text": " I will let you know that in my case and of course in, for example, other news sites owned"
    },
    {
      "Time_Start": 729.12,
      "Time_End": 738.68,
      "Text": " by large companies like MSNBC. They are, we are editorially independent. I have never"
    },
    {
      "Time_Start": 738.68,
      "Time_End": 745.4,
      "Text": " ever gotten a call from anybody other than an editor saying this is not a good story"
    },
    {
      "Time_Start": 745.4,
      "Time_End": 748.92,
      "Text": " or this is a good story or you need to do this or you don't need to do this. There is"
    },
    {
      "Time_Start": 748.92,
      "Time_End": 755.28,
      "Text": " no one out there telling us what to cover, how to cover it. If there was, I would walk"
    },
    {
      "Time_Start": 755.28,
      "Time_End": 757.6,
      "Text": " away. Because I'm not doing this for the money. That's for sure."
    },
    {
      "Time_Start": 757.6,
      "Time_End": 758.6,
      "Text": " In graduate seminars and journalism purposes, you often talk about it's just enough to be"
    },
    {
      "Time_Start": 758.6,
      "Time_End": 759.6,
      "Text": " owned by these big guys to influence people. Do I spin the story this way? You know, the"
    },
    {
      "Time_Start": 759.6,
      "Time_End": 774.6,
      "Text": " big mouse. If anything else, at least from the reporters I've talked to, for example,"
    },
    {
      "Time_Start": 774.6,
      "Time_End": 780.24,
      "Text": " MSNBC, I have found their coverage of Microsoft antitrust trial excellent. And I think that"
    },
    {
      "Time_Start": 780.24,
      "Time_End": 783.8,
      "Text": " when you're dealing with that, I wrote a review of the Go Network, for example, the new little"
    },
    {
      "Time_Start": 783.8000000000001,
      "Time_End": 787.9200000000001,
      "Text": " portal, you know, family friendly Disney portal. And in the review, I kind of slammed"
    },
    {
      "Time_Start": 787.9200000000001,
      "Time_End": 792.0400000000001,
      "Text": " it. I thought when you have Yahoo and AOL and everybody else in that market, it's not"
    },
    {
      "Time_Start": 792.0400000000001,
      "Time_End": 796.36,
      "Text": " worth it. If anything, I find that reporters actually go after stuff more because it's"
    },
    {
      "Time_Start": 796.36,
      "Time_End": 800.6400000000001,
      "Text": " the parent company. Because in a way, we're a little like you guys in that we really like"
    },
    {
      "Time_Start": 800.6400000000001,
      "Time_End": 810.2,
      "Text": " to tweak people. And if I could twist some tails at Disney, no pun there, if I can go"
    },
    {
      "Time_Start": 810.2,
      "Time_End": 816.6,
      "Text": " and be brutally honest about these things, I will. You know? What else do you think?"
    },
    {
      "Time_Start": 816.6,
      "Time_End": 820.72,
      "Text": " Think about recent stories about hacking. What was your reaction?"
    },
    {
      "Time_Start": 820.72,
      "Time_End": 829.84,
      "Text": " You could change something about the way you reported like GH, that won't take down stuff."
    },
    {
      "Time_Start": 829.84,
      "Time_End": 830.84,
      "Text": " What would you do different about the way you reported that?"
    },
    {
      "Time_Start": 830.84,
      "Time_End": 831.84,
      "Text": " What would I do different about GH?"
    },
    {
      "Time_Start": 831.84,
      "Time_End": 832.84,
      "Text": " Just that."
    },
    {
      "Time_Start": 832.84,
      "Time_End": 838.2,
      "Text": " Just, it's tough. I mean, you know, how do you, I know you guys, for example, are really"
    },
    {
      "Time_Start": 838.2,
      "Time_End": 841.84,
      "Text": " big on first amendment rights. You know, freedom of speech, information must be free,"
    },
    {
      "Time_Start": 841.84,
      "Time_End": 844.84,
      "Text": " that whole nine yards. So why are you hacking somebody's freedom of speech?"
    },
    {
      "Time_Start": 844.84,
      "Time_End": 848.08,
      "Text": " Because they're stupid."
    },
    {
      "Time_Start": 848.08,
      "Time_End": 852.44,
      "Text": " That's your opinion, sir. You know? Just because they're stupid doesn't mean they don't have"
    },
    {
      "Time_Start": 852.44,
      "Time_End": 856.32,
      "Text": " the right to do stuff. So, I mean, you know, you're faced with that quandary. And when"
    },
    {
      "Time_Start": 856.32,
      "Time_End": 861.6400000000001,
      "Text": " I report on your hack, I know what you're trying to say. I'm not stupid. I've been following"
    },
    {
      "Time_Start": 861.6400000000001,
      "Time_End": 866.8000000000001,
      "Text": " this for a while. I know you did it for a reason. And in my story, I'm going to say"
    },
    {
      "Time_Start": 866.8000000000001,
      "Time_End": 870.2800000000001,
      "Text": " that reason. But when you put it up against someone's basic right to say what they want"
    },
    {
      "Time_Start": 870.2800000000001,
      "Time_End": 877.2800000000001,
      "Text": " on any, you know, website, on any publication anywhere, it's not going to look good. You"
    },
    {
      "Time_Start": 877.2800000000001,
      "Time_End": 878.2800000000001,
      "Text": " know?"
    },
    {
      "Time_Start": 878.2800000000001,
      "Time_End": 881.96,
      "Text": " There are a couple things, actually this goes ahead in my speech, but I'm just winging this"
    },
    {
      "Time_Start": 881.96,
      "Time_End": 888.5200000000001,
      "Text": " here. There are a couple things that are going to get you bad press, no matter what you do."
    },
    {
      "Time_Start": 888.5200000000001,
      "Time_End": 892.5600000000001,
      "Text": " For example, hacking a site. You know, you've taken off somebody's site, you're causing"
    },
    {
      "Time_Start": 892.5600000000001,
      "Time_End": 897.12,
      "Text": " them loss of their right to free speech. You're causing them loss of revenue in some"
    },
    {
      "Time_Start": 897.12,
      "Time_End": 903.32,
      "Text": " cases. You're interfering with their business. And unless you can go ahead and show, like,"
    },
    {
      "Time_Start": 903.32,
      "Time_End": 909.0400000000001,
      "Text": " you know, for example, give a better reason besides they're stupid, that's not going to"
    },
    {
      "Time_Start": 909.0400000000001,
      "Time_End": 913.72,
      "Text": " fly with a lot of mainstream folks. That's not going to fly with your mom. She's going"
    },
    {
      "Time_Start": 913.72,
      "Time_End": 914.72,
      "Text": " to whack you upside the head."
    },
    {
      "Time_Start": 914.72,
      "Time_End": 918.2,
      "Text": " What about politically motivated hacks?"
    },
    {
      "Time_Start": 918.9200000000001,
      "Time_End": 928.32,
      "Text": " That's a very good question. Is hacktivism a form of social expression? It's a good question."
    },
    {
      "Time_Start": 928.32,
      "Time_End": 932.4000000000001,
      "Text": " I would report it as such. Absolutely. If that's the reason and you're hacking in the"
    },
    {
      "Time_Start": 932.4000000000001,
      "Time_End": 938.6800000000001,
      "Text": " name of the Chiapas or anything else, then yeah, I would definitely report it that way."
    },
    {
      "Time_Start": 938.6800000000001,
      "Time_End": 943.48,
      "Text": " On the other hand, I do have a responsibility to get the other side of the story. I do have"
    },
    {
      "Time_Start": 943.48,
      "Time_End": 950.48,
      "Text": " to go to whoever you hacked. And I have to let them say, this really sucked. We weren't,"
    },
    {
      "Time_Start": 950.48,
      "Time_End": 957.36,
      "Text": " you know, especially on a hack, for instance, like, say you go in and hack my site to complain"
    },
    {
      "Time_Start": 957.36,
      "Time_End": 963.2,
      "Text": " about something completely unrelated to it. And don't try that, please."
    },
    {
      "Time_Start": 963.2,
      "Time_End": 969.36,
      "Text": " You know, when you go in and do that, you hacked me. And I'm like, I didn't do this."
    },
    {
      "Time_Start": 969.36,
      "Time_End": 976.0,
      "Text": " I didn't oppress Mexicans. I didn't do any of that stuff. And that's fine. I mean, you"
    },
    {
      "Time_Start": 976.0,
      "Time_End": 981.08,
      "Text": " know, if you are going to do this, and I don't condone it in any way, shape, or form, you"
    },
    {
      "Time_Start": 981.08,
      "Time_End": 987.08,
      "Text": " know, personally, and it's certainly not the views of ABC slash Disney, you know, I would"
    },
    {
      "Time_Start": 987.08,
      "Time_End": 992.08,
      "Text": " say pick your target. If you're going to hacktivism and go in and get somebody for that reason,"
    },
    {
      "Time_Start": 992.08,
      "Time_End": 993.08,
      "Text": " you know, choose your targets."
    },
    {
      "Time_Start": 993.08,
      "Time_End": 1005.8000000000001,
      "Text": " My job is just to report. If any reporter comes up and tells you that their reporting"
    },
    {
      "Time_Start": 1005.8000000000001,
      "Time_End": 1012.2,
      "Text": " is 100% unbiased, you may feel free to kick them. Actually, I can't advocate violence"
    },
    {
      "Time_Start": 1012.2,
      "Time_End": 1017.32,
      "Text": " either. That's bad. Don't kick them. But you can feel free to tell them off. That's your"
    },
    {
      "Time_Start": 1017.32,
      "Time_End": 1022.6800000000001,
      "Text": " First Amendment right? Anybody, you know, I can't go to a story and say I'm completely"
    },
    {
      "Time_Start": 1022.6800000000001,
      "Time_End": 1028.4,
      "Text": " unbiased. I may not care. My job is to report to news. And I'm going to do that the best"
    },
    {
      "Time_Start": 1028.4,
      "Time_End": 1033.6000000000001,
      "Text": " way possible. I'm going to go and say, you know, this is one side of the story, this"
    },
    {
      "Time_Start": 1033.6000000000001,
      "Time_End": 1036.72,
      "Text": " is the other side, this is the other side. But who's going to choose the sides of the"
    },
    {
      "Time_Start": 1036.72,
      "Time_End": 1042.92,
      "Text": " story? You know, I'm doing that based on my own experience, based on what I think is good."
    },
    {
      "Time_Start": 1042.92,
      "Time_End": 1048.3200000000002,
      "Text": " That's a bias right there. So what you may perceive as a bias in a large bit of mainstream"
    },
    {
      "Time_Start": 1048.3200000000002,
      "Time_End": 1054.0800000000002,
      "Text": " media can equal out to, as I was saying earlier, ignorance. We don't know where to go. So we"
    },
    {
      "Time_Start": 1054.0800000000002,
      "Time_End": 1058.96,
      "Text": " go to the best place we can under the deadlines that we can. Or just the fact that I think"
    },
    {
      "Time_Start": 1058.96,
      "Time_End": 1063.68,
      "Text": " person A is a better source than person B. That may create a bias right there. Once you"
    },
    {
      "Time_Start": 1063.68,
      "Time_End": 1066.92,
      "Text": " start talking down this road, it's a slippery slope because there is no such thing as a"
    },
    {
      "Time_Start": 1066.92,
      "Time_End": 1073.92,
      "Text": " completely 100% unbiased story. That's my own personal opinion. And, well, you know,"
    },
    {
      "Time_Start": 1073.92,
      "Time_End": 1076.92,
      "Text": " there you go."
    },
    {
      "Time_Start": 1076.92,
      "Time_End": 1080.92,
      "Text": " The side you go to, like the corporate side, they all have public relations representing"
    },
    {
      "Time_Start": 1080.92,
      "Time_End": 1084.92,
      "Text": " them. And we're just a bunch of people who speak for ourselves."
    },
    {
      "Time_Start": 1084.92,
      "Time_End": 1089.92,
      "Text": " That's right. And that comes to an interesting thing which you may want to consider. And"
    },
    {
      "Time_Start": 1089.92,
      "Time_End": 1094.92,
      "Text": " again, I'm not in the business of recommending what you guys do. But there could definitely"
    },
    {
      "Time_Start": 1094.92,
      "Time_End": 1099.92,
      "Text": " be a better clearing house, a better way of contacting you, a better way of finding"
    },
    {
      "Time_Start": 1099.92,
      "Time_End": 1103.92,
      "Text": " you, a better way of someone saying, this is a credible source, this is not. And some"
    },
    {
      "Time_Start": 1103.92,
      "Time_End": 1109.92,
      "Text": " of those things exist. But they don't exactly advertise. Not like the person who's hacked"
    },
    {
      "Time_Start": 1109.92,
      "Time_End": 1114.92,
      "Text": " who is part of mega corporation A and who has 200 PR flunkies."
    },
    {
      "Time_Start": 1114.92,
      "Time_End": 1123.92,
      "Text": " So, and of course, then again, we also have, and I lost my place here, we also have our"
    },
    {
      "Time_Start": 1123.92,
      "Time_End": 1128.92,
      "Text": " own misconceptions and biases about hackers. It happens. They're hard to find. We can't"
    },
    {
      "Time_Start": 1128.92,
      "Time_End": 1133.92,
      "Text": " confirm those credible sources. When we deal with them, they give us attitude like you"
    },
    {
      "Time_Start": 1133.92,
      "Time_End": 1138.92,
      "Text": " wouldn't believe. And sometimes, you know, we're very independent. We're very independent"
    },
    {
      "Time_Start": 1138.92,
      "Time_End": 1143.92,
      "Text": " minded. We don't even like our own editors. And when some 15-year-old decides to flame"
    },
    {
      "Time_Start": 1143.92,
      "Time_End": 1146.92,
      "Text": " us, I'm not happy about that, man. I don't care."
    },
    {
      "Time_Start": 1146.92,
      "Time_End": 1151.92,
      "Text": " Oh, no, I don't feel singled out at all. I know that for every five flames I get, the"
    },
    {
      "Time_Start": 1151.92,
      "Time_End": 1156.92,
      "Text": " guy's getting at least that many. A lot of times, you folks, when I'm talking with you,"
    },
    {
      "Time_Start": 1156.92,
      "Time_End": 1163.92,
      "Text": " will assume that I have as much knowledge as you do. I'm not a hacker. I don't know"
    },
    {
      "Time_Start": 1163.92,
      "Time_End": 1168.92,
      "Text": " how to get into a TCP IP stack. I'm not even sure if I'm saying that right. And then once"
    },
    {
      "Time_Start": 1168.92,
      "Time_End": 1174.92,
      "Text": " a story is written, you guys, if you don't like it, will flame me back to the Stone Age."
    },
    {
      "Time_Start": 1174.92,
      "Time_End": 1179.92,
      "Text": " I will get emails sometimes that are longer than the original story."
    },
    {
      "Time_Start": 1179.92,
      "Time_End": 1187.92,
      "Text": " And I'm a little less inclined to read them, because I'm like, why are you doing this to"
    },
    {
      "Time_Start": 1187.92,
      "Time_End": 1194.92,
      "Text": " me? You know, I like the give and take between me and my readers. I really do. I think they"
    },
    {
      "Time_Start": 1194.92,
      "Time_End": 1201.92,
      "Text": " bring up good points. I think they give valid criticism. And if I drop the ball, I will"
    },
    {
      "Time_Start": 1201.92,
      "Time_End": 1208.92,
      "Text": " tell them. Because it's not like I don't make mistakes. I just try to make them twice."
    },
    {
      "Time_Start": 1208.92,
      "Time_End": 1216.92,
      "Text": " But when I get an email that basically says, you know, you suck. I'm not interested in"
    },
    {
      "Time_Start": 1216.92,
      "Time_End": 1222.92,
      "Text": " learning more about that person. No. With hackers, I actually have responded occasionally"
    },
    {
      "Time_Start": 1222.92,
      "Time_End": 1226.92,
      "Text": " to the you sucks if there is a little bit of truth that I perceive that this person"
    },
    {
      "Time_Start": 1226.92,
      "Time_End": 1230.92,
      "Text": " may know something about the subject. And that is how I have built relationships with"
    },
    {
      "Time_Start": 1230.92,
      "Time_End": 1234.92,
      "Text": " many of the people at this conference. By responding back and saying, you know, let's"
    },
    {
      "Time_Start": 1234.92,
      "Time_End": 1239.92,
      "Text": " talk about this further because you may know your stuff. And then in the future, I build"
    },
    {
      "Time_Start": 1239.92,
      "Time_End": 1244.92,
      "Text": " up a relationship and can go to them as credible sources after I've talked with them, repeatedly"
    },
    {
      "Time_Start": 1244.92,
      "Time_End": 1250.92,
      "Text": " learned who they are, etc. I actually have a couple of tips for you. How to get the story"
    },
    {
      "Time_Start": 1250.92,
      "Time_End": 1256.92,
      "Text": " straight when dealing with mainstream media. Somebody from some, you know, daily newspaper"
    },
    {
      "Time_Start": 1257.92,
      "Time_End": 1263.92,
      "Text": " in Virginia gives you a call or, you know, sends you an email. You, for whatever reason,"
    },
    {
      "Time_Start": 1263.92,
      "Time_End": 1269.92,
      "Text": " have been targeted as a hacker. And the media wants to pick your brain. So what can you"
    },
    {
      "Time_Start": 1269.92,
      "Time_End": 1274.92,
      "Text": " do? I think the first thing you can do is stress that not all of you go around defacing"
    },
    {
      "Time_Start": 1274.92,
      "Time_End": 1280.92,
      "Text": " web pages. That is not like your primary concern as a hacker. If it is, say so. Be prepared"
    },
    {
      "Time_Start": 1280.92,
      "Time_End": 1286.92,
      "Text": " for the rest of your friends and neighbors to take down your server. Reference the reporter"
    },
    {
      "Time_Start": 1286.92,
      "Time_End": 1290.92,
      "Text": " to reputable information sources online and off. You know, somebody goes and says, I've"
    },
    {
      "Time_Start": 1290.92,
      "Time_End": 1294.92,
      "Text": " been talking with so and so about hacking and I want to get your opinion. And if you"
    },
    {
      "Time_Start": 1294.92,
      "Time_End": 1298.92,
      "Text": " believe that the person they've been talking with has no clue, you need to tell them. You"
    },
    {
      "Time_Start": 1298.92,
      "Time_End": 1301.92,
      "Text": " need to say, this is not a credible source. This person doesn't know about hacking. They"
    },
    {
      "Time_Start": 1301.92,
      "Time_End": 1307.92,
      "Text": " couldn't hack their way out of a paper bag. Don't do it. Go to someone else that you feel"
    },
    {
      "Time_Start": 1307.92,
      "Time_End": 1311.92,
      "Text": " is very credible. Point the reporter in the right direction. On the other hand, don't"
    },
    {
      "Time_Start": 1311.92,
      "Time_End": 1315.92,
      "Text": " give out email or phone numbers to people who may not want that information spread around"
    },
    {
      "Time_Start": 1315.92,
      "Time_End": 1319.92,
      "Text": " to the media. But at the same, you know, if you know of people who are credible, who are"
    },
    {
      "Time_Start": 1319.92,
      "Time_End": 1323.92,
      "Text": " smart, who know about hacking and would be willing to talk to reporters, you need to"
    },
    {
      "Time_Start": 1323.92,
      "Time_End": 1327.92,
      "Text": " reference them to us. It just helps immensely. Helps get the story straight and that helps"
    },
    {
      "Time_Start": 1327.92,
      "Time_End": 1333.92,
      "Text": " both of us. Discuss a little bit why you guys hack. Why you do what you do. I think it's"
    },
    {
      "Time_Start": 1333.92,
      "Time_End": 1339.92,
      "Text": " an interesting perspective that doesn't get talked about a lot. You know, we have, again,"
    },
    {
      "Time_Start": 1339.92,
      "Time_End": 1343.92,
      "Text": " our own preconceptions of the 16 year old wearing black t-shirts in a darkened room"
    },
    {
      "Time_Start": 1343.92,
      "Time_End": 1347.92,
      "Text": " when the sun is out and all they're doing is playing on the computer for 24 hours straight."
    },
    {
      "Time_Start": 1347.92,
      "Time_End": 1352.92,
      "Text": " That actually may be some of you. I don't know. I do see some black t-shirts here and"
    },
    {
      "Time_Start": 1352.92,
      "Time_End": 1361.92,
      "Text": " they look wonderful. It could be white. Yours is a very nice one too. But the thing of it"
    },
    {
      "Time_Start": 1361.92,
      "Time_End": 1367.92,
      "Text": " is, obviously we have that preconceived notion and by talking about who you are and what"
    },
    {
      "Time_Start": 1367.92,
      "Time_End": 1372.92,
      "Text": " you do, if you can help break that, you'll help the reporter give a fuller story and"
    },
    {
      "Time_Start": 1372.92,
      "Time_End": 1381.92,
      "Text": " a better story. Tell them what you're proudest of. As long as it's legal. That does bring"
    },
    {
      "Time_Start": 1381.92,
      "Time_End": 1387.92,
      "Text": " up another point which is, don't do anything that's going to get you busted. Okay? I have"
    },
    {
      "Time_Start": 1387.92,
      "Time_End": 1393.92,
      "Text": " seen stories that a reporter says, hey, I hooked up with these guys and I went on IRC"
    },
    {
      "Time_Start": 1393.92,
      "Time_End": 1398.92,
      "Text": " with them while they were hacking. And it was so cool. And this is what they did. And"
    },
    {
      "Time_Start": 1398.92,
      "Time_End": 1402.92,
      "Text": " then you can bet that within 48 hours of that story being published, the FBI called that"
    },
    {
      "Time_Start": 1402.92,
      "Time_End": 1408.92,
      "Text": " reporter and said, we need to know everything. And no matter what a reporter tells you, when"
    },
    {
      "Time_Start": 1408.92,
      "Time_End": 1414.92,
      "Text": " you're dealing with something that could be perceived to be illegal, they have to. You"
    },
    {
      "Time_Start": 1414.92,
      "Time_End": 1419.92,
      "Text": " know, the protection of anonymity and the protections that we can afford you only apply"
    },
    {
      "Time_Start": 1419.92,
      "Time_End": 1425.92,
      "Text": " to our stories. When you all do something wrong and somebody knocks on my door and says"
    },
    {
      "Time_Start": 1425.92,
      "Time_End": 1428.92,
      "Text": " we need to know about it and if they're the police, I have to tell them. There's no legal"
    },
    {
      "Time_Start": 1428.92,
      "Time_End": 1434.92,
      "Text": " reason why I can't. The protection of sources only goes so far. So don't do anything that"
    },
    {
      "Time_Start": 1434.92,
      "Time_End": 1438.92,
      "Text": " gets you busted. It's common sense. You were here yesterday when Kevin Polson and Jennifer"
    },
    {
      "Time_Start": 1438.92,
      "Time_End": 1443.92,
      "Text": " Granik were talking about your rights. The same thing goes with us. Don't, you can give"
    },
    {
      "Time_Start": 1443.92,
      "Time_End": 1447.92,
      "Text": " as much proof of your identity as you feel comfortable with, but if you feel that that"
    },
    {
      "Time_Start": 1447.92,
      "Time_End": 1450.92,
      "Text": " would endanger you in other ways, don't. Don't tell us anything that you perhaps would not"
    },
    {
      "Time_Start": 1450.92,
      "Time_End": 1456.92,
      "Text": " want the police to know. Don't try to exaggerate your knowledge. I have talked to people who"
    },
    {
      "Time_Start": 1456.92,
      "Time_End": 1462.92,
      "Text": " are a little more, now that I know, they are a little more than script kiddies. At the"
    },
    {
      "Time_Start": 1462.92,
      "Time_End": 1469.92,
      "Text": " time they came off to me as hackers and I was dumb and didn't know any better. And that"
    },
    {
      "Time_Start": 1469.92,
      "Time_End": 1475.92,
      "Text": " not only hurts my readers because I am trying to provide them the best information possible,"
    },
    {
      "Time_Start": 1475.92,
      "Time_End": 1479.92,
      "Text": " but if you fake your knowledge and you give incorrect information to a reporter and that"
    },
    {
      "Time_Start": 1479.92,
      "Time_End": 1484.92,
      "Text": " gets into print, your name is trashed and your colleagues are going to find out and"
    },
    {
      "Time_Start": 1484.92,
      "Time_End": 1491.92,
      "Text": " they are going to kill you, at least metaphorically. Don't give the reporter wares. Don't give"
    },
    {
      "Time_Start": 1491.92,
      "Time_End": 1494.92,
      "Text": " him tools. Don't give him URLs. Don't give him email addresses that you wouldn't want"
    },
    {
      "Time_Start": 1494.92,
      "Time_End": 1503.92,
      "Text": " published. When giving feedback, give feedback. Give lots of feedback. Make it smart feedback."
    },
    {
      "Time_Start": 1503.92,
      "Time_End": 1509.92,
      "Text": " Don't write 2,000 words. I'm not going to read it. I get like 300 emails a day. I'm"
    },
    {
      "Time_Start": 1509.92,
      "Time_End": 1514.92,
      "Text": " not going to read some diatribe, but if you've got something smart to say, say it. Say it"
    },
    {
      "Time_Start": 1514.92,
      "Time_End": 1524.92,
      "Text": " intentionally and move on. What can the community as a whole do to get better press? Again,"
    },
    {
      "Time_Start": 1524.92,
      "Time_End": 1530.92,
      "Text": " some sort of clearing house would be nice. Some sort of way, you know, to let us know"
    },
    {
      "Time_Start": 1530.92,
      "Time_End": 1538.92,
      "Text": " who's good and who's not. Conventions like this are great for that. Do a better job of"
    },
    {
      "Time_Start": 1538.92,
      "Time_End": 1544.92,
      "Text": " explaining the why. We know the how you do these things. We know the where, the when."
    },
    {
      "Time_Start": 1544.92,
      "Time_End": 1551.92,
      "Text": " But the how is the stickiest thing, I'm sorry, the why is the stickiest thing that we have"
    },
    {
      "Time_Start": 1551.92,
      "Time_End": 1556.92,
      "Text": " trouble with and you'll probably agree that that's where the preconceptions come from."
    },
    {
      "Time_Start": 1556.92,
      "Time_End": 1562.92,
      "Text": " So the next time a reporter says, why did you release Bad Color of This to 15,000 people,"
    },
    {
      "Time_Start": 1563.92,
      "Time_End": 1570.92,
      "Text": " you should have an answer for it and hopefully it will be a really good one. You know, that is"
    },
    {
      "Time_Start": 1570.92,
      "Time_End": 1578.92,
      "Text": " one of the areas where you will still get bad press. I understand creating an exploit to show"
    },
    {
      "Time_Start": 1578.92,
      "Time_End": 1586.92,
      "Text": " that there's a security problem, that's admirable in my opinion. To put it out there for other"
    },
    {
      "Time_Start": 1586.92,
      "Time_End": 1590.92,
      "Text": " people to see, that's great. Microsoft will hear about it and they've already heard about"
    },
    {
      "Time_Start": 1590.92,
      "Time_End": 1596.92,
      "Text": " Bad Color of This 2000 and they are, I'm sure somebody's here from them. I don't see them."
    },
    {
      "Time_Start": 1596.92,
      "Time_End": 1598.92,
      "Text": " You from Microsoft, sir?"
    },
    {
      "Time_Start": 1598.92,
      "Time_End": 1600.92,
      "Text": " No, but I like it 10 to D."
    },
    {
      "Time_Start": 1600.92,
      "Time_End": 1608.92,
      "Text": " Oh. Well, then you need to get out more, man. So, I mean, you know, they're here and I can"
    },
    {
      "Time_Start": 1608.92,
      "Time_End": 1612.92,
      "Text": " understand that and I can understand why you've done it, but when you make it open source"
    },
    {
      "Time_Start": 1612.92,
      "Time_End": 1617.92,
      "Text": " and you put it out to everybody in the audience, the perception is that it just looks mean."
    },
    {
      "Time_Start": 1617.92,
      "Time_End": 1621.92,
      "Text": " Well, isn't it mean to release buggy operating systems?"
    },
    {
      "Time_Start": 1621.92,
      "Time_End": 1627.92,
      "Text": " Well, very well. I knew you'd get some applause from that. I'm not going to debate whether"
    },
    {
      "Time_Start": 1627.92,
      "Time_End": 1631.92,
      "Text": " or not it is morally acceptable to put out a buggy operating system. I have my own personal"
    },
    {
      "Time_Start": 1631.92,
      "Time_End": 1638.92,
      "Text": " opinions and in the interest of continuing a hopefully unbiased reporting tradition, I'm"
    },
    {
      "Time_Start": 1638.92,
      "Time_End": 1643.92,
      "Text": " going to stay that way. I'm not going to comment on it. It is, you know, and if you can point"
    },
    {
      "Time_Start": 1643.92,
      "Time_End": 1647.92,
      "Text": " out flaws in security that will affect thousands of people, I think it's an admirable thing"
    },
    {
      "Time_Start": 1647.92,
      "Time_End": 1653.92,
      "Text": " and you're helping people, but then distributing to someone, you know, if I gave a gun to everybody"
    },
    {
      "Time_Start": 1653.92,
      "Time_End": 1660.92,
      "Text": " in this room, I am taking a chance that, and I don't, you were at the shoot this morning,"
    },
    {
      "Time_Start": 1660.92,
      "Time_End": 1665.92,
      "Text": " weren't you? I am taking a chance that one of you is going to get ripped enough to use"
    },
    {
      "Time_Start": 1665.92,
      "Time_End": 1672.92,
      "Text": " that gun on somebody else. I am putting a weapon of destruction in your hands and I'm"
    },
    {
      "Time_Start": 1672.92,
      "Time_End": 1677.92,
      "Text": " just going to cross my fingers that it doesn't get used in a bad way and cost people their"
    },
    {
      "Time_Start": 1677.92,
      "Time_End": 1682.92,
      "Text": " rights to free speech, their right to commerce, that sort of thing. Their life, you know,"
    },
    {
      "Time_Start": 1682.92,
      "Time_End": 1688.92,
      "Text": " in the case of the gun. I was more addressing the wares, but, you know, those are very sticky"
    },
    {
      "Time_Start": 1688.92,
      "Time_End": 1693.92,
      "Text": " issues and sometimes when I talk to hackers, I don't think that whole thing has been thought"
    },
    {
      "Time_Start": 1693.92,
      "Time_End": 1697.92,
      "Text": " through unless I get, you know, well Microsoft shouldn't put out buggy software and then"
    },
    {
      "Time_Start": 1697.92,
      "Time_End": 1701.92,
      "Text": " I can obviously go to somebody using the buggy software and saying, I bought it in good faith,"
    },
    {
      "Time_Start": 1701.92,
      "Time_End": 1709.92,
      "Text": " why do these people hate me? I just want to run my website. Just in a brief conclusion"
    },
    {
      "Time_Start": 1709.92,
      "Time_End": 1715.92,
      "Text": " that I do want to answer all your questions, we can work together. You guys complain that"
    },
    {
      "Time_Start": 1715.92,
      "Time_End": 1721.92,
      "Text": " we don't get it, we complain that you don't let us, because we don't know enough about"
    },
    {
      "Time_Start": 1721.92,
      "Time_End": 1724.92,
      "Text": " you, we don't know where to find you half the time, especially if we're starting out"
    },
    {
      "Time_Start": 1724.92,
      "Time_End": 1732.92,
      "Text": " on the beat for the first time, like I did. Just by opening things up a little more, being"
    },
    {
      "Time_Start": 1732.92,
      "Time_End": 1738.92,
      "Text": " forthright, being honest, being smart about things, we can get better stories. You guys"
    },
    {
      "Time_Start": 1738.92,
      "Time_End": 1743.92,
      "Text": " can look better in those stories and we can get something approaching the truth. I don't"
    },
    {
      "Time_Start": 1743.92,
      "Time_End": 1749.92,
      "Text": " know what that might be, but we can get pretty close. It's just a question of being honest"
    },
    {
      "Time_Start": 1749.92,
      "Time_End": 1755.92,
      "Text": " with us. And we will do our best to be honest with you guys. All right, questions? And this"
    },
    {
      "Time_Start": 1755.92,
      "Time_End": 1757.92,
      "Text": " man has held his arm up for like five minutes."
    },
    {
      "Time_Start": 1757.92,
      "Time_End": 1767.92,
      "Text": " You typically just respond to stories that haven't actually occurred or you do investigative"
    },
    {
      "Time_Start": 1767.92,
      "Time_End": 1768.92,
      "Text": " on them, right?"
    },
    {
      "Time_Start": 1768.92,
      "Time_End": 1772.92,
      "Text": " We do, you know, speaking for myself, I do investigative on my own. You know, I have"
    },
    {
      "Time_Start": 1772.92,
      "Time_End": 1778.92,
      "Text": " to be fairly comfortable with that beat to be doing it. I did do a story back in February"
    },
    {
      "Time_Start": 1778.92,
      "Time_End": 1784.92,
      "Text": " that had nothing to do with a hack, but had very much to do with hacker culture, whatever"
    },
    {
      "Time_Start": 1784.92,
      "Time_End": 1789.92,
      "Text": " you'd like to term that as. And a lot of the stories that I'm going to produce out of here,"
    },
    {
      "Time_Start": 1789.92,
      "Time_End": 1795.92,
      "Text": " I am writing about DEF CON. It's up on the site now, www.abcnews.com. Give me hits."
    },
    {
      "Time_Start": 1795.92,
      "Time_End": 1803.92,
      "Text": " You know, it is about the culture here. We do respond and we have to respond to a lot"
    },
    {
      "Time_Start": 1803.92,
      "Time_End": 1808.92,
      "Text": " of hacks, but hopefully that gives us enough information to help us dig deeper."
    },
    {
      "Time_Start": 1808.92,
      "Time_End": 1818.92,
      "Text": " Do you typically focus on the individual or domestic group hacks or do you also do like"
    },
    {
      "Time_Start": 1818.92,
      "Time_End": 1821.92,
      "Text": " company espionage and international?"
    },
    {
      "Time_Start": 1821.92,
      "Time_End": 1829.92,
      "Text": " Well, yeah, I mean, as far as the malicious hack, it is fairly common knowledge that most"
    },
    {
      "Time_Start": 1829.92,
      "Time_End": 1835.92,
      "Text": " of them do come from the inside of companies and we've reported that. You know, whenever"
    },
    {
      "Time_Start": 1835.92,
      "Time_End": 1840.92,
      "Text": " there is a computer security issue that is big enough to warrant abcnews.com doing it,"
    },
    {
      "Time_Start": 1840.92,
      "Time_End": 1846.92,
      "Text": " to warrant the mainstream press doing it, then fine. I mean, if somebody's little site"
    },
    {
      "Time_Start": 1846.92,
      "Time_End": 1850.92,
      "Text": " gets hacked, I mean, I'm sorry, I've got a lot to do. That's the other thing about reporters"
    },
    {
      "Time_Start": 1850.92,
      "Time_End": 1856.92,
      "Text": " covering this beat. We don't do it full time. I've got a Microsoft antitrust trial I've"
    },
    {
      "Time_Start": 1856.92,
      "Time_End": 1862.92,
      "Text": " got to deal with. I've got Microsoft I've got to deal with. There's a lot of stuff I do"
    },
    {
      "Time_Start": 1862.92,
      "Time_End": 1866.92,
      "Text": " as a technology reporter. This is a small part of it and you're going to find reporters"
    },
    {
      "Time_Start": 1866.92,
      "Time_End": 1869.92,
      "Text": " very busy on it."
    },
    {
      "Time_Start": 1869.92,
      "Time_End": 1870.92,
      "Text": " Okay."
    },
    {
      "Time_Start": 1870.92,
      "Time_End": 1875.92,
      "Text": " If a credible source tells you about an exploit that's going to happen, if you're going to"
    },
    {
      "Time_Start": 1875.92,
      "Time_End": 1877.92,
      "Text": " do it, what are you going to do?"
    },
    {
      "Time_Start": 1877.92,
      "Time_End": 1885.92,
      "Text": " Yeah, you're putting me in a hellish position there. It gets into all sorts of legal, ethical,"
    },
    {
      "Time_Start": 1885.92,
      "Time_End": 1893.92,
      "Text": " moral issues. If somebody says so and so site is going to be hacked on July 12th, what"
    },
    {
      "Time_Start": 1893.92,
      "Time_End": 1899.92,
      "Text": " do I do? That hasn't happened to me yet, thank God. I don't want it to happen to me. If you"
    },
    {
      "Time_Start": 1899.92,
      "Time_End": 1904.92,
      "Text": " know something that's going to happen, don't tell me. Because I don't know how I would"
    },
    {
      "Time_Start": 1904.92,
      "Time_End": 1912.92,
      "Text": " have to react. My responsibility as a citizen, and I'm sure our folks from the feds and law"
    },
    {
      "Time_Start": 1912.92,
      "Time_End": 1918.92,
      "Text": " enforcement would agree with me, my responsibility as a citizen may override my professional"
    },
    {
      "Time_Start": 1918.92,
      "Time_End": 1923.92,
      "Text": " and corporate interest in putting out a story. I mean, we're in it to make money. We're in"
    },
    {
      "Time_Start": 1923.92,
      "Time_End": 1929.92,
      "Text": " it to gain readers and make money. But if you tell me about something, I may very well"
    },
    {
      "Time_Start": 1929.92,
      "Time_End": 1936.92,
      "Text": " have to go and tell somebody. Otherwise, I could get into trouble and I don't want that."
    },
    {
      "Time_Start": 1936.92,
      "Time_End": 1938.92,
      "Text": " Over here."
    },
    {
      "Time_Start": 1938.92,
      "Time_End": 1943.92,
      "Text": " A lot of the people that are here at this show make a semantic distinction between the"
    },
    {
      "Time_Start": 1943.92,
      "Time_End": 1953.92,
      "Text": " term hackers and crackers. But in the mainstream media, we don't see a whole lot of this distinction."
    },
    {
      "Time_Start": 1953.92,
      "Time_End": 1958.92,
      "Text": " We don't talk about hackers as being the bad guys. Why is that?"
    },
    {
      "Time_Start": 1958.92,
      "Time_End": 1967.92,
      "Text": " And that's because in a lot of ways, what you guys use internally as a community to"
    },
    {
      "Time_Start": 1967.92,
      "Time_End": 1975.92,
      "Text": " describe your various levels of niceness, if you will, sometimes do not apply to the"
    },
    {
      "Time_Start": 1975.92,
      "Time_End": 1980.92,
      "Text": " rest of the world. Especially when your own people who are doing malicious stuff are still"
    },
    {
      "Time_Start": 1980.92,
      "Time_End": 1988.92,
      "Text": " calling themselves hackers. I cracked open a website that says, I'm a hacker. I downloaded"
    },
    {
      "Time_Start": 1988.92,
      "Time_End": 1996.92,
      "Text": " the wares and I used it right and I feel very good about myself. I'm a hacker. When we see"
    },
    {
      "Time_Start": 1996.92,
      "Time_End": 2002.92,
      "Text": " that confusion within your ranks, it's simplicity's sake that we go with hacker. I try to use"
    },
    {
      "Time_Start": 2002.92,
      "Time_End": 2008.92,
      "Text": " it as much as possible. I say malicious hacker, known in the community as cracker in my stories."
    },
    {
      "Time_Start": 2008.92,
      "Time_End": 2016.92,
      "Text": " And that takes up a lot of space and my editor's likely to cut it. It's been called hacking"
    },
    {
      "Time_Start": 2016.92,
      "Time_End": 2023.92,
      "Text": " ever since war games. We're used to it. It's part of the larger culture. And that's why."
    },
    {
      "Time_Start": 2023.92,
      "Time_End": 2029.92,
      "Text": " I mean, yes, is it factually incorrect? For you guys, that is a factual mistake. And I've"
    },
    {
      "Time_Start": 2029.92,
      "Time_End": 2033.92,
      "Text": " gotten flamed on hacker versus cracker ad nauseum."
    },
    {
      "Time_Start": 2033.92,
      "Time_End": 2039.92,
      "Text": " Then why aren't you, as a conduit to the general public, acting responsibly and saying"
    },
    {
      "Time_Start": 2039.92,
      "Time_End": 2041.92,
      "Text": " they are hackers? Stop calling them hackers."
    },
    {
      "Time_Start": 2041.92,
      "Time_End": 2046.92,
      "Text": " And we do. In a lot of the more recent stories that I've published, and again, I'm speaking"
    },
    {
      "Time_Start": 2046.92,
      "Time_End": 2053.92,
      "Text": " for myself at this point. I cannot speak for the rest of the press. We put in this distinction."
    },
    {
      "Time_Start": 2053.92,
      "Time_End": 2058.92,
      "Text": " I took the definitions right out of Eric Raymond's jargon file. And that is a great resource,"
    },
    {
      "Time_Start": 2058.92,
      "Time_End": 2067.92,
      "Text": " by the way, to point a reporter to. You put the distinction up and you use it, but, you know,"
    },
    {
      "Time_Start": 2067.92,
      "Time_End": 2073.92,
      "Text": " you may have convinced me, but you've got every other place to convince. You've got my own"
    },
    {
      "Time_Start": 2073.92,
      "Time_End": 2079.92,
      "Text": " editors to convince. Making a semantic change like that in not only language, but culture,"
    },
    {
      "Time_Start": 2079.92,
      "Time_End": 2085.92,
      "Text": " is a huge effort. And you've just got to continue to send those mails, continue to say it's"
    },
    {
      "Time_Start": 2085.92,
      "Time_End": 2091.92,
      "Text": " cracker, dammit, not hacker. And maybe the change will happen, but I'll tell you right now,"
    },
    {
      "Time_Start": 2091.92,
      "Time_End": 2094.92,
      "Text": " it's not going to happen overnight. It's too ingrained in the larger culture."
    },
    {
      "Time_Start": 2094.92,
      "Time_End": 2098.92,
      "Text": " Web page hacking gets a lot of media."
    },
    {
      "Time_Start": 2098.92,
      "Time_End": 2099.92,
      "Text": " It certainly does."
    },
    {
      "Time_Start": 2099.92,
      "Time_End": 2104.92,
      "Text": " That furthers the people who are hacking the web pages. They're doing it so they can be"
    },
    {
      "Time_Start": 2104.92,
      "Time_End": 2105.92,
      "Text": " media whores."
    },
    {
      "Time_Start": 2105.92,
      "Time_End": 2106.92,
      "Text": " Yes."
    },
    {
      "Time_Start": 2106.92,
      "Time_End": 2112.92,
      "Text": " And do you feel like you're, do you feel that you're giving in to what they want to happen?"
    },
    {
      "Time_Start": 2112.92,
      "Time_End": 2116.92,
      "Text": " I'm not pleased when somebody goes and, especially after having covered this community for a"
    },
    {
      "Time_Start": 2116.92,
      "Time_End": 2121.92,
      "Text": " while, you know, I'm not pleased when a big website gets hit and I have to cover it, but I have"
    },
    {
      "Time_Start": 2121.92,
      "Time_End": 2127.92,
      "Text": " an obligation, you know. I can write in that story, you know, this is not considered normal"
    },
    {
      "Time_Start": 2127.92,
      "Time_End": 2135.92,
      "Text": " hacker culture. This is considered, you know, weird and odd and not good. But I still have to,"
    },
    {
      "Time_Start": 2135.92,
      "Time_End": 2140.92,
      "Text": " especially when you pick a target that I just can't ignore, you know. Rumors of eBay getting"
    },
    {
      "Time_Start": 2140.92,
      "Time_End": 2145.92,
      "Text": " hacked. God. I mean, that's one of the top ten sites on the web. I'm going to have to."
    },
    {
      "Time_Start": 2145.92,
      "Time_End": 2149.92,
      "Text": " And of course, now all the kiddies here know which sites that I'm going to have to cover and now"
    },
    {
      "Time_Start": 2149.92,
      "Time_End": 2150.92,
      "Text": " they know which ones to target."
    },
    {
      "Time_Start": 2150.92,
      "Time_End": 2154.92,
      "Text": " Is that any different than releasing back Orifice though? I mean, they're doing it only because"
    },
    {
      "Time_Start": 2154.92,
      "Time_End": 2156.92,
      "Text": " they feel they have to because there's an exploit there."
    },
    {
      "Time_Start": 2156.92,
      "Time_End": 2161.92,
      "Text": " I know, I know why the Cult of the Dead Cow is releasing back Orifice. I've talked with them."
    },
    {
      "Time_Start": 2161.92,
      "Time_End": 2166.92,
      "Text": " I talked with them last year. I'm going to talk with them after their light show."
    },
    {
      "Time_Start": 2167.92,
      "Time_End": 2172.92,
      "Text": " So is that any different than being honest about it and trying to encourage other people to do it?"
    },
    {
      "Time_Start": 2172.92,
      "Time_End": 2179.92,
      "Text": " You know, it gets back to the argument, why do you tell bad news all the time because then"
    },
    {
      "Time_Start": 2179.92,
      "Time_End": 2182.92,
      "Text": " other people are going to do it? If you cover a murder, will somebody else go and murder?"
    },
    {
      "Time_Start": 2182.92,
      "Time_End": 2189.92,
      "Text": " You know, I think the greater good in letting someone know that something like a back Orifice"
    },
    {
      "Time_Start": 2189.92,
      "Time_End": 2195.92,
      "Text": " is out there far outweighs the fact that somebody may read about it, download it, and use it."
    },
    {
      "Time_Start": 2195.92,
      "Time_End": 2202.92,
      "Text": " I would rather warn as many readers as possible about this thing's potential and talk about"
    },
    {
      "Time_Start": 2202.92,
      "Time_End": 2209.92,
      "Text": " the reasoning behind it and talk to Microsoft about why indeed they do build functionality"
    },
    {
      "Time_Start": 2209.92,
      "Time_End": 2211.92,
      "Text": " into this that can be exploited."
    },
    {
      "Time_Start": 2211.92,
      "Time_End": 2217.92,
      "Text": " That to me is more important than somebody coming up and reading it or trying to copycat it."
    },
    {
      "Time_Start": 2217.92,
      "Time_End": 2219.92,
      "Text": " I hope that answers your question."
    },
    {
      "Time_Start": 2219.92,
      "Time_End": 2222.92,
      "Text": " You sir."
    },
    {
      "Time_Start": 2222.92,
      "Time_End": 2227.92,
      "Text": " Yeah, you seem to be sort of making a suggestion that we want to sort of shift towards"
    },
    {
      "Time_Start": 2227.92,
      "Time_End": 2232.92,
      "Text": " the hacker community so to speak to help inform the journalists."
    },
    {
      "Time_Start": 2232.92,
      "Time_End": 2236.92,
      "Text": " You don't have to do a thing. But you know, you're an underground community."
    },
    {
      "Time_Start": 2236.92,
      "Time_End": 2242.92,
      "Text": " You don't have PR flacks and you don't have to deal with us."
    },
    {
      "Time_Start": 2242.92,
      "Time_End": 2245.92,
      "Text": " But quite frankly, we're here and we're going to publish stories."
    },
    {
      "Time_Start": 2245.92,
      "Time_End": 2251.92,
      "Text": " That sounds crappy. It sounds like we're being mean and I apologize in advance."
    },
    {
      "Time_Start": 2251.92,
      "Time_End": 2253.92,
      "Text": " But we're going to do it anyway because the public interest is out there."
    },
    {
      "Time_Start": 2253.92,
      "Time_End": 2257.92,
      "Text": " And because things like back Orifice is being released, sites are being hacked."
    },
    {
      "Time_Start": 2257.92,
      "Time_End": 2264.92,
      "Text": " And if you guys want to clear your good name, if you will, you're going to have to help us"
    },
    {
      "Time_Start": 2264.92,
      "Time_End": 2267.92,
      "Text": " get some of this information."
    },
    {
      "Time_Start": 2267.92,
      "Time_End": 2271.92,
      "Text": " You know, we dig. We dig a lot. We dig hard."
    },
    {
      "Time_Start": 2271.92,
      "Time_End": 2274.92,
      "Text": " We try to find you as best we can."
    },
    {
      "Time_Start": 2274.92,
      "Time_End": 2278.92,
      "Text": " But it's really hard, man. You guys know how to hide."
    },
    {
      "Time_Start": 2278.92,
      "Time_End": 2283.92,
      "Text": " But my actual question is, why is it that when you cover hackers,"
    },
    {
      "Time_Start": 2283.92,
      "Time_End": 2286.92,
      "Text": " you sort of would like the hackers to tell you more about their community"
    },
    {
      "Time_Start": 2286.92,
      "Time_End": 2288.92,
      "Text": " and shift that on to the hackers."
    },
    {
      "Time_Start": 2288.92,
      "Time_End": 2292.92,
      "Text": " But for example, if you were covering politics, you wouldn't expect politicians to help."
    },
    {
      "Time_Start": 2292.92,
      "Time_End": 2297.92,
      "Text": " I would like more hackers to talk about their community because in some ways,"
    },
    {
      "Time_Start": 2297.92,
      "Time_End": 2300.92,
      "Text": " and again, this is a personal opinion. It has nothing to do with ABC slash Disney."
    },
    {
      "Time_Start": 2301.92,
      "Time_End": 2307.92,
      "Text": " In some ways, what you guys do is very cool and it helps people point out"
    },
    {
      "Time_Start": 2307.92,
      "Time_End": 2310.92,
      "Text": " the problems in Microsoft software or anybody else's software."
    },
    {
      "Time_Start": 2310.92,
      "Time_End": 2316.92,
      "Text": " You know, it's a different situation to equate covering an underground community"
    },
    {
      "Time_Start": 2316.92,
      "Time_End": 2320.92,
      "Text": " like you guys to covering Congress where everybody is out in the open."
    },
    {
      "Time_Start": 2320.92,
      "Time_End": 2326.92,
      "Text": " I heard that."
    },
    {
      "Time_Start": 2327.92,
      "Time_End": 2330.92,
      "Text": " It's a very different thing."
    },
    {
      "Time_Start": 2330.92,
      "Time_End": 2337.92,
      "Text": " And again, you know, the more you can help us, the better the stories will be,"
    },
    {
      "Time_Start": 2337.92,
      "Time_End": 2341.92,
      "Text": " the better your image will be, and everybody walks away happy."
    },
    {
      "Time_Start": 2341.92,
      "Time_End": 2344.92,
      "Text": " Go ahead."
    },
    {
      "Time_Start": 2344.92,
      "Time_End": 2347.92,
      "Text": " Why do we have more colleagues that are trying to learn how to hack"
    },
    {
      "Time_Start": 2347.92,
      "Time_End": 2350.92,
      "Text": " rather than hackers trying to learn how to hack?"
    },
    {
      "Time_Start": 2350.92,
      "Time_End": 2354.92,
      "Text": " Are you asking me, do I want to learn how to hack?"
    },
    {
      "Time_Start": 2354.92,
      "Time_End": 2358.92,
      "Text": " Why do news services hire hackers?"
    },
    {
      "Time_Start": 2358.92,
      "Time_End": 2361.92,
      "Text": " Kind of like what Kevin was able to do."
    },
    {
      "Time_Start": 2361.92,
      "Time_End": 2364.92,
      "Text": " It's a very good question."
    },
    {
      "Time_Start": 2364.92,
      "Time_End": 2367.92,
      "Text": " Basically, what news services are looking for,"
    },
    {
      "Time_Start": 2367.92,
      "Time_End": 2370.92,
      "Text": " and I'm not going to, this is again my opinion,"
    },
    {
      "Time_Start": 2370.92,
      "Time_End": 2373.92,
      "Text": " I can't speak for every news service who's hiring anybody to cover hacking."
    },
    {
      "Time_Start": 2373.92,
      "Time_End": 2377.92,
      "Text": " We are conduits and translators."
    },
    {
      "Time_Start": 2377.92,
      "Time_End": 2381.92,
      "Text": " The idea is that we take information,"
    },
    {
      "Time_Start": 2381.92,
      "Time_End": 2384.92,
      "Text": " and we break it down into something that everybody can understand and we publish it."
    },
    {
      "Time_Start": 2384.92,
      "Time_End": 2387.92,
      "Text": " And that is a skill, as much as hacking is a skill."
    },
    {
      "Time_Start": 2387.92,
      "Time_End": 2390.92,
      "Text": " If you can find somebody who can do both,"
    },
    {
      "Time_Start": 2390.92,
      "Time_End": 2393.92,
      "Text": " then more power to you, because that's very cool."
    },
    {
      "Time_Start": 2393.92,
      "Time_End": 2396.92,
      "Text": " But the fact is, it's very tough to do,"
    },
    {
      "Time_Start": 2396.92,
      "Time_End": 2402.92,
      "Text": " and I will certainly admit there is a preconceived notion that hackers are bad."
    },
    {
      "Time_Start": 2402.92,
      "Time_End": 2406.92,
      "Text": " You know, there are still some security companies out there"
    },
    {
      "Time_Start": 2406.92,
      "Time_End": 2409.92,
      "Text": " that won't hire anybody who says they are a hacker,"
    },
    {
      "Time_Start": 2409.92,
      "Time_End": 2412.92,
      "Text": " which kind of blows my mind."
    },
    {
      "Time_Start": 2412.92,
      "Time_End": 2415.92,
      "Text": " But in much the same way,"
    },
    {
      "Time_Start": 2415.92,
      "Time_End": 2422.92,
      "Text": " there is some perception that we are hiring a fox to cover the chicken coop."
    },
    {
      "Time_Start": 2422.92,
      "Time_End": 2425.92,
      "Text": " So, you've been raising your hand a lot."
    },
    {
      "Time_Start": 2425.92,
      "Time_End": 2427.92,
      "Text": " Can you go ahead?"
    },
    {
      "Time_Start": 2427.92,
      "Time_End": 2430.92,
      "Text": " Do you have the full resources of ATC behind you,"
    },
    {
      "Time_Start": 2430.92,
      "Time_End": 2433.92,
      "Text": " in terms of the physical source, like Mojart and Microsoft?"
    },
    {
      "Time_Start": 2433.92,
      "Time_End": 2436.92,
      "Text": " It depends on the story."
    },
    {
      "Time_Start": 2437.92,
      "Time_End": 2444.92,
      "Text": " We are a joint venture between ABC and Infoseek."
    },
    {
      "Time_Start": 2444.92,
      "Time_End": 2448.92,
      "Text": " ABC is owned by Disney, and Disney owns 43% of Infoseek."
    },
    {
      "Time_Start": 2448.92,
      "Time_End": 2451.92,
      "Text": " We're all going to get married at some point."
    },
    {
      "Time_Start": 2451.92,
      "Time_End": 2453.92,
      "Text": " We do our own thing, though."
    },
    {
      "Time_Start": 2453.92,
      "Time_End": 2456.92,
      "Text": " We are the 24-hour news service for ABC."
    },
    {
      "Time_Start": 2456.92,
      "Time_End": 2459.92,
      "Text": " We don't have a cable station, which we did."
    },
    {
      "Time_Start": 2459.92,
      "Time_End": 2463.92,
      "Text": " So we do a lot more stuff than they have the resources to."
    },
    {
      "Time_Start": 2464.92,
      "Time_End": 2467.92,
      "Text": " We do cooperate on stories, and if it's considered big enough,"
    },
    {
      "Time_Start": 2467.92,
      "Time_End": 2469.92,
      "Text": " they will call me, or I will call them,"
    },
    {
      "Time_Start": 2469.92,
      "Time_End": 2471.92,
      "Text": " and we will work on it together."
    },
    {
      "Time_Start": 2471.92,
      "Time_End": 2474.92,
      "Text": " But it doesn't happen as often as you'd think."
    },
    {
      "Time_Start": 2474.92,
      "Time_End": 2476.92,
      "Text": " You in the back."
    },
    {
      "Time_Start": 2476.92,
      "Time_End": 2480.92,
      "Text": " Yeah, why does the media keep labeling people,"
    },
    {
      "Time_Start": 2480.92,
      "Time_End": 2482.92,
      "Text": " like that's all unrelatable,"
    },
    {
      "Time_Start": 2482.92,
      "Time_End": 2485.92,
      "Text": " that's doing pretty counterfeit money on Liza Turner,"
    },
    {
      "Time_Start": 2485.92,
      "Time_End": 2489.92,
      "Text": " and they were being denoted by the media as super hackers?"
    },
    {
      "Time_Start": 2489.92,
      "Time_End": 2492.92,
      "Text": " It seems like everyone who is a big head team,"
    },
    {
      "Time_Start": 2492.92,
      "Time_End": 2495.92,
      "Text": " everyone who gets their mouth wrong,"
    },
    {
      "Time_Start": 2495.92,
      "Time_End": 2498.92,
      "Text": " gets buzzed about it not being a super hacker."
    },
    {
      "Time_Start": 2498.92,
      "Time_End": 2502.92,
      "Text": " I can't even begin to defend that one, man."
    },
    {
      "Time_Start": 2502.92,
      "Time_End": 2505.92,
      "Text": " I can't."
    },
    {
      "Time_Start": 2505.92,
      "Time_End": 2508.92,
      "Text": " I cannot, you know, and there are specific instances"
    },
    {
      "Time_Start": 2508.92,
      "Time_End": 2510.92,
      "Text": " of some media getting some things wrong,"
    },
    {
      "Time_Start": 2510.92,
      "Time_End": 2513.92,
      "Text": " but that goes back to the preconceptions that exist"
    },
    {
      "Time_Start": 2513.92,
      "Time_End": 2515.92,
      "Text": " and that are alive and well today."
    },
    {
      "Time_Start": 2515.92,
      "Time_End": 2518.92,
      "Text": " If you use a computer to do a bad thing, you're a hacker."
    },
    {
      "Time_Start": 2518.92,
      "Time_End": 2522.92,
      "Text": " And I know different, many other reporters know different,"
    },
    {
      "Time_Start": 2522.92,
      "Time_End": 2524.92,
      "Text": " but many other reporters don't."
    },
    {
      "Time_Start": 2524.92,
      "Time_End": 2528.92,
      "Text": " And that just means more education needs to be done,"
    },
    {
      "Time_Start": 2528.92,
      "Time_End": 2531.92,
      "Text": " and quite frankly, some folks will never get a clue,"
    },
    {
      "Time_Start": 2531.92,
      "Time_End": 2534.92,
      "Text": " and I don't know the story that you're referring to,"
    },
    {
      "Time_Start": 2534.92,
      "Time_End": 2536.92,
      "Text": " but if it happens..."
    },
    {
      "Time_Start": 2536.92,
      "Time_End": 2540.92,
      "Text": " I have no comment on that."
    },
    {
      "Time_Start": 2540.92,
      "Time_End": 2546.92,
      "Text": " All right, actually, we're getting pretty close"
    },
    {
      "Time_Start": 2547.92,
      "Time_End": 2549.92,
      "Text": " to where the next speaker needs to get up here,"
    },
    {
      "Time_Start": 2549.92,
      "Time_End": 2550.92,
      "Text": " so I'm going to go."
    },
    {
      "Time_Start": 2550.92,
      "Time_End": 2551.92,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 2551.92,
      "Time_End": 2552.92,
      "Text": " You've been great."
    },
    {
      "Time_Start": 2552.92,
      "Time_End": 2557.92,
      "Text": " applause"
    }
  ]
}