{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 27.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Identity Theft, got a brand new book out on this, here you go, please contact me if you"
    },
    {
      "Time_Start": 28.0,
      "Time_End": 36.0,
      "Text": " want to buy it, guys. In any case, identity theft now has become the hot crime because"
    },
    {
      "Time_Start": 36.0,
      "Time_End": 41.0,
      "Text": " as more and more of our personal particulars get into kind of different databases, and"
    },
    {
      "Time_Start": 41.0,
      "Time_End": 47.0,
      "Text": " I'll talk about that, a person's identity is only what the computer says it is. And"
    },
    {
      "Time_Start": 47.0,
      "Time_End": 52.0,
      "Text": " it's now become very profitable to steal somebody's identity. You might wonder, well, why might"
    },
    {
      "Time_Start": 52.0,
      "Time_End": 56.0,
      "Text": " you want to steal somebody's identity? Well, of course, the big obvious thing is, well,"
    },
    {
      "Time_Start": 56.0,
      "Time_End": 61.0,
      "Text": " we can use our identity to reap financial benefits by getting credit cards and bank"
    },
    {
      "Time_Start": 61.0,
      "Time_End": 65.0,
      "Text": " accounts and whatever. But there are other reasons you might want to steal a person's"
    },
    {
      "Time_Start": 65.0,
      "Time_End": 69.0,
      "Text": " identity. Maybe you're somebody who, when they went to college the first time, didn't"
    },
    {
      "Time_Start": 69.0,
      "Time_End": 73.0,
      "Text": " take it seriously and, you know, they flunked out and whatever. And, you know, hey, a lot"
    },
    {
      "Time_Start": 73.0,
      "Time_End": 78.0,
      "Text": " of you guys here, basically, I always say, if you come to DEF CON, most of you guys could"
    },
    {
      "Time_Start": 78.0,
      "Time_End": 83.0,
      "Text": " have PhDs in computer science or computer engineering. Well, maybe you don't want to"
    },
    {
      "Time_Start": 83.0,
      "Time_End": 87.0,
      "Text": " go to school for eight years to get a PhD. So maybe you steal the identity of somebody"
    },
    {
      "Time_Start": 87.0,
      "Time_End": 93.0,
      "Text": " who has a PhD in computer engineering so you can then go get the 100K in your job, you"
    },
    {
      "Time_Start": 93.0,
      "Time_End": 97.0,
      "Text": " know? That's another reason you do it. Or maybe you just screwed things up, bounced"
    },
    {
      "Time_Start": 97.0,
      "Time_End": 102.0,
      "Text": " a lot of checks, got kicked out of apartments, you know, during your ratty-hatty days, and"
    },
    {
      "Time_Start": 102.0,
      "Time_End": 107.0,
      "Text": " now you can't even rent an apartment or open a checking account. Well, that's another reason"
    },
    {
      "Time_Start": 107.0,
      "Time_End": 111.0,
      "Text": " you can steal somebody's identity because then you can become that person so you can"
    },
    {
      "Time_Start": 111.0,
      "Time_End": 119.0,
      "Text": " live a decent life. In a way, the powers that be, meaning those who insist upon cataloging"
    },
    {
      "Time_Start": 119.0,
      "Time_End": 125.0,
      "Text": " our personal identifiers in data banks and then using that data to deny or give us certain"
    },
    {
      "Time_Start": 125.0,
      "Time_End": 130.0,
      "Text": " services, they're the ones to blame for the Growth in Identities Act. Ten years ago, it"
    },
    {
      "Time_Start": 130.0,
      "Time_End": 134.0,
      "Text": " didn't matter if you closed a bank account because of bounced checks, you could open"
    },
    {
      "Time_Start": 134.0,
      "Time_End": 139.0,
      "Text": " a new one. If you've tried that lately, you'll find out it's virtually impossible because"
    },
    {
      "Time_Start": 139.0,
      "Time_End": 145.0,
      "Text": " of check services like Check System, Telecheck, there's a bunch of them, but they all do"
    },
    {
      "Time_Start": 145.0,
      "Time_End": 150.0,
      "Text": " the same thing. And you can even be entered into those services, not even if you've"
    },
    {
      "Time_Start": 150.0,
      "Time_End": 154.0,
      "Text": " cost the bank any money, but they just didn't like the way you handled your account. So"
    },
    {
      "Time_Start": 154.0,
      "Time_End": 160.0,
      "Text": " the thing of it is that this is why Identity Theft has grown because basically the computer"
    },
    {
      "Time_Start": 160.0,
      "Time_End": 166.0,
      "Text": " age has made it difficult for Americans to get that proverbial fresh start. Something"
    },
    {
      "Time_Start": 166.0,
      "Time_End": 170.0,
      "Text": " that this country was based on, you screwed up back east, you're headed out west. Maybe"
    },
    {
      "Time_Start": 170.0,
      "Time_End": 174.0,
      "Text": " that's why DEFCON's in Las Vegas, I don't know, they're not in New York or Atlantic"
    },
    {
      "Time_Start": 174.0,
      "Time_End": 179.0,
      "Text": " City. You know, we're out west, you can start over out here. In any case, I met a guy in"
    },
    {
      "Time_Start": 179.0,
      "Time_End": 187.0,
      "Text": " the United Kingdom who is a professional Identity Thief, every year or twice a year in the United"
    },
    {
      "Time_Start": 187.0,
      "Time_End": 194.0,
      "Text": " States, and he comes here for about six weeks and goes home about $40,000 to $50,000 richer."
    },
    {
      "Time_Start": 194.0,
      "Time_End": 199.0,
      "Text": " And I'm like, hey, how do you do this? Well, he agreed to talk to me, provided that I didn't"
    },
    {
      "Time_Start": 199.0,
      "Time_End": 203.0,
      "Text": " reveal who he was. So we're going to talk about exactly how he does it, and he does"
    },
    {
      "Time_Start": 203.0,
      "Time_End": 210.0,
      "Text": " almost all of it via the internet. And I am going to play his role in doing this. Step"
    },
    {
      "Time_Start": 210.0,
      "Time_End": 217.0,
      "Text": " one, you want to take somebody's identity. You find somebody whose identity is of value"
    },
    {
      "Time_Start": 217.0,
      "Time_End": 222.0,
      "Text": " to you. What does that mean? It means that you probably don't want to take a rhino's"
    },
    {
      "Time_Start": 222.0,
      "Time_End": 228.0,
      "Text": " identity, or take the identity of Rafael Resendez Ramirez, who's wanted for all these"
    },
    {
      "Time_Start": 228.0,
      "Time_End": 235.0,
      "Text": " murders riding the rails. Stealing his identity is a sure way to have a lot of trouble. Okay?"
    },
    {
      "Time_Start": 235.0,
      "Time_End": 240.0,
      "Text": " Basically, you want to take the identity of the people that are your parents, you know,"
    },
    {
      "Time_Start": 240.0,
      "Time_End": 245.0,
      "Text": " the people who go to work every day, live in the suburban home, that kind of stuff."
    },
    {
      "Time_Start": 245.0,
      "Time_End": 249.0,
      "Text": " Those are the kind of people whose identities that you want to take, because they generally"
    },
    {
      "Time_Start": 249.0,
      "Time_End": 255.0,
      "Text": " tend to have good incomes, they have good credit histories, and a stable employment"
    },
    {
      "Time_Start": 255.0,
      "Time_End": 262.0,
      "Text": " background and personal background. So step one is, you have to define who the category"
    },
    {
      "Time_Start": 262.0,
      "Time_End": 267.0,
      "Text": " of victim is that you want. And so we define that. We want people who basically are professionals"
    },
    {
      "Time_Start": 267.0,
      "Time_End": 272.0,
      "Text": " with good earning potential, who have stable lifestyles, who aren't going to be on Jerry"
    },
    {
      "Time_Start": 272.0,
      "Time_End": 279.0,
      "Text": " Springer. Okay? The people you see on Jerry Springer. Put it that way. Anybody on Jerry"
    },
    {
      "Time_Start": 279.0,
      "Time_End": 286.0,
      "Text": " Springer might be okay. So, step two. How in the hell do we define these people? I mean,"
    },
    {
      "Time_Start": 286.0,
      "Time_End": 289.0,
      "Text": " it's not like they're all out there saying, hey, come here, steal my identity, steal my"
    },
    {
      "Time_Start": 289.0,
      "Time_End": 295.0,
      "Text": " identity. You know what? It may not seem like that, but they're almost doing that. Okay."
    },
    {
      "Time_Start": 295.0,
      "Time_End": 300.0,
      "Text": " Let's look at one class of people's identities you might want to take. A doctor. Hey, you"
    },
    {
      "Time_Start": 300.0,
      "Time_End": 308.0,
      "Text": " can go to the ANA database on the web, and you can get the educational background and"
    },
    {
      "Time_Start": 308.0,
      "Time_End": 314.0,
      "Text": " the practice address of almost every licensed physician in this country. That's a place"
    },
    {
      "Time_Start": 314.0,
      "Time_End": 320.0,
      "Text": " to start. Or maybe medicine isn't your thing. I mean, it's kind of hard to say, yeah, I'm"
    },
    {
      "Time_Start": 320.0,
      "Time_End": 326.0,
      "Text": " Joseph Jones, MD, and you don't know, I don't know where the appendix is and everything."
    },
    {
      "Time_Start": 326.0,
      "Time_End": 331.0,
      "Text": " So, maybe you decide, you know, the people who work in academia, that's a pretty good"
    },
    {
      "Time_Start": 331.0,
      "Time_End": 335.0,
      "Text": " place to start. And you know why it's a good place to start? Because every college publishes"
    },
    {
      "Time_Start": 335.0,
      "Time_End": 342.0,
      "Text": " a college catalog. So, I decided, okay, I'm going to follow this guy's step. You know,"
    },
    {
      "Time_Start": 342.0,
      "Time_End": 346.0,
      "Text": " I always had a nice thing for Colorado. Lived there for a few years as a kid. You know,"
    },
    {
      "Time_Start": 346.0,
      "Time_End": 350.0,
      "Text": " University of Colorado at Colorado Springs has a real good electrical engineering computer"
    },
    {
      "Time_Start": 350.0,
      "Time_End": 356.0,
      "Text": " science program. So, let's see if there's somebody there who I might like to become."
    },
    {
      "Time_Start": 356.0,
      "Time_End": 361.0,
      "Text": " So, what do I do? I go through the faculty listing, which, of course, you can do right"
    },
    {
      "Time_Start": 361.0,
      "Time_End": 368.0,
      "Text": " online. Now, you see some names up here. Now, first of all, if the guy has a name like Smith"
    },
    {
      "Time_Start": 368.0,
      "Time_End": 373.0,
      "Text": " or Johnson, we don't want to mess with that, because when we have to go do the next step"
    },
    {
      "Time_Start": 373.0,
      "Time_End": 377.0,
      "Text": " of getting the personal identifiers, there might be hundreds of them that we have to"
    },
    {
      "Time_Start": 377.0,
      "Time_End": 383.0,
      "Text": " sift through. So, we want to find somebody who meets our criteria, but has a relatively"
    },
    {
      "Time_Start": 383.0,
      "Time_End": 389.0,
      "Text": " unique or different name. Okay? John Newman might not be the guy to go looking for, because"
    },
    {
      "Time_Start": 389.0,
      "Time_End": 393.0,
      "Text": " there might be a lot of Newmans in the phone book. And if you live in Los Angeles, somebody"
    },
    {
      "Time_Start": 393.0,
      "Time_End": 397.0,
      "Text": " with the last name of Alvarez might not be the place to start. So, you know, use some"
    },
    {
      "Time_Start": 397.0,
      "Time_End": 404.0,
      "Text": " sense here. Okay. Well, I look through here, and it's like, hey, wait a minute. Down toward"
    },
    {
      "Time_Start": 404.0,
      "Time_End": 411.0,
      "Text": " the bottom, I see a number of good candidates, but I kind of like this guy here. Gerald"
    },
    {
      "Time_Start": 411.0,
      "Time_End": 417.0,
      "Text": " Olasek. And I think that that looks like a good place to start. Now, isn't this wonderful?"
    },
    {
      "Time_Start": 417.0,
      "Time_End": 423.0,
      "Text": " I know it's a little out of focus here, but if you notice, it tells me that he has, where"
    },
    {
      "Time_Start": 423.0,
      "Time_End": 430.0,
      "Text": " he got his education, BS in Wayne State, Masters and PhD, Syracuse University. So, now I start"
    },
    {
      "Time_Start": 430.0,
      "Time_End": 436.0,
      "Text": " building a file. Not only now do I have this man's full name, but I also have his background."
    },
    {
      "Time_Start": 436.0,
      "Time_End": 442.0,
      "Text": " I know where he got his undergraduate degree, his graduate degrees. I also have his work"
    },
    {
      "Time_Start": 442.0,
      "Time_End": 448.0,
      "Text": " telephone number, his work email. So, now I start creating, either on a separate screen"
    },
    {
      "Time_Start": 448.0,
      "Time_End": 453.0,
      "Text": " on my computer, or the old fashioned one, with pen and paper, I start making up a list"
    },
    {
      "Time_Start": 453.0,
      "Time_End": 459.0,
      "Text": " of this man's identifiers. First thing is the name. I've got his work telephone number."
    },
    {
      "Time_Start": 459.0,
      "Time_End": 466.0,
      "Text": " I have his educational background. So, now I'm well on my way to taking this man's identity"
    },
    {
      "Time_Start": 466.0,
      "Time_End": 472.0,
      "Text": " over, and he doesn't have a clue about it. Okay. Now, you don't necessarily just have"
    },
    {
      "Time_Start": 472.0,
      "Time_End": 477.0,
      "Text": " to do things like with faculty members. The point I'm making here is anybody who works"
    },
    {
      "Time_Start": 477.0,
      "Time_End": 482.0,
      "Text": " in a licensed profession or works where a directory is published of people who work"
    },
    {
      "Time_Start": 482.0,
      "Time_End": 487.0,
      "Text": " at a particular company and put in certain functions, if you can get a hold of that information,"
    },
    {
      "Time_Start": 487.0,
      "Time_End": 494.0,
      "Text": " which now many times is posted on the internet, you now have that first kernel of data that"
    },
    {
      "Time_Start": 494.0,
      "Time_End": 500.0,
      "Text": " you need to take this person's identity over. So, that's where we begin. Now, you can say,"
    },
    {
      "Time_Start": 500.0,
      "Time_End": 504.0,
      "Text": " but wait a minute, John, that's not enough. Well, of course it's not enough, but we're"
    },
    {
      "Time_Start": 504.0,
      "Time_End": 510.0,
      "Text": " not finished yet. The next step is, is we're going to try to find out this man's address"
    },
    {
      "Time_Start": 510.0,
      "Time_End": 516.0,
      "Text": " on home phone. The reason we need that is because once I've got that, I can then get"
    },
    {
      "Time_Start": 516.0,
      "Time_End": 522.0,
      "Text": " all of his other records. So, what do I do? I go to AOL. Look, I use AOL. Like I told"
    },
    {
      "Time_Start": 522.0,
      "Time_End": 529.0,
      "Text": " you, I haven't been around long. Okay. But I go to AOL's search page, and guess what?"
    },
    {
      "Time_Start": 529.0,
      "Time_End": 535.0,
      "Text": " I want to search for a Gerald Olasek in Colorado Springs, and I know there's only going to"
    },
    {
      "Time_Start": 535.0,
      "Time_End": 543.0,
      "Text": " be one. And guess what? One of one match. Gerald M. Olasek, 15th and Big Valley Drive,"
    },
    {
      "Time_Start": 543.0,
      "Time_End": 550.0,
      "Text": " Colorado Springs, Colorado, 80919, and there's his home phone number. Boom. I am into this"
    },
    {
      "Time_Start": 550.0,
      "Time_End": 555.0,
      "Text": " guy. Now, let me stop and give you the disclaimer I always give you. You know I believe in the"
    },
    {
      "Time_Start": 555.0,
      "Time_End": 561.0,
      "Text": " First Amendment. That's why I don't come up here and redact out his address or whatever."
    },
    {
      "Time_Start": 561.0,
      "Time_End": 567.0,
      "Text": " This guy is just a working guy. He's a professor. He's not a bad guy, whatever. But I can't"
    },
    {
      "Time_Start": 567.0,
      "Time_End": 573.0,
      "Text": " come up here and say I believe in free information and then censor what I give to you guys. I've"
    },
    {
      "Time_Start": 573.0,
      "Time_End": 578.0,
      "Text": " never censored anything I've presented to you guys. All I ask is don't screw this guy"
    },
    {
      "Time_Start": 578.0,
      "Time_End": 584.0,
      "Text": " over. Okay? Don't go steal his identity. You guys don't need to. He's an okay guy. If he"
    },
    {
      "Time_Start": 584.0,
      "Time_End": 590.0,
      "Text": " was a jerk, I'd be the first guy to say go for it. But don't. Okay? I trust you guys."
    },
    {
      "Time_Start": 590.0,
      "Time_End": 597.0,
      "Text": " You adults use good judgment. Okay. So now I have got the next set of identifiers I need."
    },
    {
      "Time_Start": 597.0,
      "Time_End": 603.0,
      "Text": " What all do I know about Mr. Olasek? I know his name. I know his home address. I know"
    },
    {
      "Time_Start": 603.0,
      "Time_End": 610.0,
      "Text": " his work phone and address. I know his educational background for undergraduate and graduate"
    },
    {
      "Time_Start": 610.0,
      "Time_End": 615.0,
      "Text": " studies, and I have his home telephone number. So what do I need to do now? Now I need to"
    },
    {
      "Time_Start": 615.0,
      "Time_End": 622.0,
      "Text": " start getting those all critical numerical identifiers about this man. One, the social"
    },
    {
      "Time_Start": 622.0,
      "Time_End": 629.0,
      "Text": " security number, and two, his birth date. That isn't that hard to do. When I got the"
    },
    {
      "Time_Start": 629.0,
      "Time_End": 635.0,
      "Text": " name and address of an individual, if any time in the last ten years he has had a credit"
    },
    {
      "Time_Start": 635.0,
      "Time_End": 642.0,
      "Text": " report pulled on him at that address, I can go and get his social security number. This"
    },
    {
      "Time_Start": 642.0,
      "Time_End": 646.0,
      "Text": " search goes by a number of names. It can be called either a social security lookup"
    },
    {
      "Time_Start": 646.0,
      "Time_End": 653.0,
      "Text": " search or a national identifier search or an unknown address search. Now, can I do this"
    },
    {
      "Time_Start": 653.0,
      "Time_End": 659.0,
      "Text": " legally? Yes. As I mentioned to you guys when I spoke two or three years ago, back in 1989,"
    },
    {
      "Time_Start": 659.0,
      "Time_End": 664.0,
      "Text": " the Bush administration, head of the Federal Trade Commission, eroded all of our privacy"
    },
    {
      "Time_Start": 664.0,
      "Time_End": 670.0,
      "Text": " by saying, from now on, the only part of your credit report that has any privacy protection"
    },
    {
      "Time_Start": 670.0,
      "Time_End": 676.0,
      "Text": " is the actual payment history. Everything else on your credit report, your name, your"
    },
    {
      "Time_Start": 676.0,
      "Time_End": 682.0,
      "Text": " birth date, your address, your former address, your social security number, where you work,"
    },
    {
      "Time_Start": 682.0,
      "Time_End": 690.0,
      "Text": " all of that is considered to be public record. And this information, although the bureaus,"
    },
    {
      "Time_Start": 690.0,
      "Time_End": 695.0,
      "Text": " the three credit bureaus themselves, do not sell it directly to the public, you can access"
    },
    {
      "Time_Start": 695.0,
      "Time_End": 701.0,
      "Text": " it by using an information broker. There are many information brokers on the Internet."
    },
    {
      "Time_Start": 701.0,
      "Time_End": 706.0,
      "Text": " One of them is DocuSearch. Another one is American Information Network. They also go"
    },
    {
      "Time_Start": 706.0,
      "Time_End": 712.0,
      "Text": " by the name the Internet Department of Motor Vehicles. Anyone can pay these services between"
    },
    {
      "Time_Start": 712.0,
      "Time_End": 720.0,
      "Text": " $20 and $50 and run this search to get a social security number on a person if you have the"
    },
    {
      "Time_Start": 721.0,
      "Time_End": 726.0,
      "Text": " person's name and an address that's ten years, at least, that they've lived at in the last"
    },
    {
      "Time_Start": 726.0,
      "Time_End": 731.0,
      "Text": " ten years and they've had any type of credit report activity done on. So that's the next"
    },
    {
      "Time_Start": 731.0,
      "Time_End": 738.0,
      "Text": " step. You can do that over the Internet, pay via credit card, and the beauty is a header"
    },
    {
      "Time_Start": 738.0,
      "Time_End": 745.0,
      "Text": " search does not leave any trace on the individual's credit report that it was done. So even later"
    },
    {
      "Time_Start": 745.0,
      "Time_End": 749.0,
      "Text": " on, after this guy's identity has been ripped off and he's reported it to the police and"
    },
    {
      "Time_Start": 749.0,
      "Time_End": 756.0,
      "Text": " done all of that stuff, there will be no trace that you actually filled this man's"
    },
    {
      "Time_Start": 756.0,
      "Time_End": 761.0,
      "Text": " header data. There won't be any trace of it whatsoever. And if you want more anonymity,"
    },
    {
      "Time_Start": 761.0,
      "Time_End": 766.0,
      "Text": " there are many information brokers who can set up a cash account and run your searches"
    },
    {
      "Time_Start": 766.0,
      "Time_End": 770.0,
      "Text": " that way and then just deduct it. You can do that in any name that you want to. But"
    },
    {
      "Time_Start": 770.0,
      "Time_End": 777.0,
      "Text": " the point of it is, header searches do not leave any notation in the inquiry section"
    },
    {
      "Time_Start": 777.0,
      "Time_End": 782.0,
      "Text": " of the credit report that they were run. So you can be invading this man's deepest"
    },
    {
      "Time_Start": 782.0,
      "Time_End": 787.0,
      "Text": " privacy and he'll have no idea that it's done. But also remember, that's how somebody can"
    },
    {
      "Time_Start": 787.0,
      "Time_End": 792.0,
      "Text": " do it to you and I. So you run this search, you're going to get back his Social Security"
    },
    {
      "Time_Start": 792.0,
      "Time_End": 798.0,
      "Text": " number. Many times you'll also get back his current address, his two previous addresses,"
    },
    {
      "Time_Start": 798.0,
      "Time_End": 803.0,
      "Text": " and you'll get some employer information. Well, now you're barely cooking with gas because"
    },
    {
      "Time_Start": 803.0,
      "Time_End": 809.0,
      "Text": " you pretty much got the identifiers that you need to take him over. But you don't"
    },
    {
      "Time_Start": 809.0,
      "Time_End": 815.0,
      "Text": " want to move just yet because part of my British friend's modus operandi is that he wants to"
    },
    {
      "Time_Start": 815.0,
      "Time_End": 822.0,
      "Text": " go and max this guy's credit out over a short few week period. So the next search he runs"
    },
    {
      "Time_Start": 822.0,
      "Time_End": 827.0,
      "Text": " is what's called a creditor search. Not many people know about this, but did you realize"
    },
    {
      "Time_Start": 827.0,
      "Time_End": 834.0,
      "Text": " that the actual listing of creditors that you have is not privacy protected? In other"
    },
    {
      "Time_Start": 834.0,
      "Time_End": 841.0,
      "Text": " words, if you have a Bank of America Visa card account with a $700 balance and a $2,000"
    },
    {
      "Time_Start": 841.0,
      "Time_End": 847.0,
      "Text": " limit, your payment history on that account is privacy protected and the account number"
    },
    {
      "Time_Start": 847.0,
      "Time_End": 855.0,
      "Text": " is. But the fact that you have that account with Bank of America Visa is not privacy protected."
    },
    {
      "Time_Start": 855.0,
      "Time_End": 862.0,
      "Text": " So we now go back to our information broker and we run a list of creditors search. So"
    },
    {
      "Time_Start": 862.0,
      "Time_End": 869.0,
      "Text": " then we'll get back all of the places that he has credit history. Why is that important?"
    },
    {
      "Time_Start": 869.0,
      "Time_End": 875.0,
      "Text": " Because we don't want to apply for a card at a bank that he already has an outstanding"
    },
    {
      "Time_Start": 875.0,
      "Time_End": 882.0,
      "Text": " credit card with. So now what do we know about Mr. Olizek? We know his name. We know his"
    },
    {
      "Time_Start": 882.0,
      "Time_End": 889.0,
      "Text": " birth date. We know his social security number. We know his home address, his home telephone"
    },
    {
      "Time_Start": 889.0,
      "Time_End": 896.0,
      "Text": " number, his work address, his work telephone number, his two previous addresses, and maybe"
    },
    {
      "Time_Start": 896.0,
      "Time_End": 902.0,
      "Text": " even his previous employer, and we know who he owes money to. What don't we know about"
    },
    {
      "Time_Start": 902.0,
      "Time_End": 908.0,
      "Text": " this guy? That's the question. And we've done it all sitting at a computer screen halfway"
    },
    {
      "Time_Start": 908.0,
      "Time_End": 915.0,
      "Text": " around the world from his little hatch in Colorado Springs. So we are now ready to enter"
    },
    {
      "Time_Start": 915.0,
      "Time_End": 921.0,
      "Text": " phase two. We have all the information that we need now to take over his identity. The"
    },
    {
      "Time_Start": 921.0,
      "Time_End": 928.0,
      "Text": " next step is to become him. Well, part one of phase two involves before we leave for"
    },
    {
      "Time_Start": 928.0,
      "Time_End": 933.0,
      "Text": " the United States or shortly after we leave for the U.S., we arrive in the United States."
    },
    {
      "Time_Start": 933.0,
      "Time_End": 938.0,
      "Text": " The first thing that we need to do is get some identification in Mr. Olizek's name."
    },
    {
      "Time_Start": 938.0,
      "Time_End": 947.0,
      "Text": " Well, guess what? I am now Gerald M. Olizek. And you know what? That's a damn good looking"
    },
    {
      "Time_Start": 947.0,
      "Time_End": 953.0,
      "Text": " Colorado ID card. Okay? Damn good looking. I'll tell you something. You can go open a"
    },
    {
      "Time_Start": 953.0,
      "Time_End": 959.0,
      "Text": " bank account with this, rent an apartment with this, get credit cards with this. This"
    },
    {
      "Time_Start": 959.0,
      "Time_End": 966.0,
      "Text": " is the best quality fake ID you can buy. So that's the step, part one of step two,"
    },
    {
      "Time_Start": 966.0,
      "Time_End": 973.0,
      "Text": " is we get a high quality fake ID in the name of the identity theft victim. Of course, this"
    },
    {
      "Time_Start": 973.0,
      "Time_End": 979.0,
      "Text": " card came from our friends at the ID shop dot com. And like I told you, if the place"
    },
    {
      "Time_Start": 979.0,
      "Time_End": 985.0,
      "Text": " makes good stuff, I'm right there to tell you, this is the very best that you can get."
    },
    {
      "Time_Start": 985.0,
      "Time_End": 989.0,
      "Text": " They will be having smart chips, because some of the new IDs will have smart chips"
    },
    {
      "Time_Start": 989.0,
      "Time_End": 993.0,
      "Text": " in a couple of years. They'll be doing that. They'll do the holographic laminates and the"
    },
    {
      "Time_Start": 993.0,
      "Time_End": 997.0,
      "Text": " ultraviolet markings. They're not doing those things here, but if you buy a card, you can"
    },
    {
      "Time_Start": 997.0,
      "Time_End": 1003.0,
      "Text": " send it to them and they'll add it. The point is, with this ID and his name, I now have"
    },
    {
      "Time_Start": 1003.0,
      "Time_End": 1009.0,
      "Text": " the ability to be him. So what's my next step? Well, the next step is I've got to get an"
    },
    {
      "Time_Start": 1009.0,
      "Time_End": 1018.0,
      "Text": " address on this man so that I can now begin to clean his clock out. Well, with this ID,"
    },
    {
      "Time_Start": 1018.0,
      "Time_End": 1026.0,
      "Text": " I go to an apartment complex, maybe in Colorado Springs, maybe nearby in Pueblo or Denver,"
    },
    {
      "Time_Start": 1026.0,
      "Time_End": 1032.0,
      "Text": " or someplace in between, and I say, yeah, I'd like to rent an apartment. And the woman"
    },
    {
      "Time_Start": 1032.0,
      "Time_End": 1039.0,
      "Text": " will say, well, here's the tenancy agreement and the all-important application to rent."
    },
    {
      "Time_Start": 1039.0,
      "Time_End": 1045.0,
      "Text": " Guess what? She's going to ask for some ID. Well, I've got the ID. When I fill out the"
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1051.0,
      "Text": " application to rent, the information on that application is collected so that the owner"
    },
    {
      "Time_Start": 1051.0,
      "Time_End": 1055.0,
      "Text": " of the apartment complex can run a credit check on me. That's why they have you fill"
    },
    {
      "Time_Start": 1055.0,
      "Time_End": 1060.0,
      "Text": " that out. Thirty years ago, that's not how it worked, but that's how it works now. So"
    },
    {
      "Time_Start": 1060.0,
      "Time_End": 1067.0,
      "Text": " I put the address of my new apartment that I want to live in on my application to rent."
    },
    {
      "Time_Start": 1067.0,
      "Time_End": 1073.0,
      "Text": " They then go and run my credit history at one of the bureaus, or sometimes at two, or"
    },
    {
      "Time_Start": 1073.0,
      "Time_End": 1079.0,
      "Text": " sometimes even three. Guess what happens? Two things happen. Number one, I now get approved"
    },
    {
      "Time_Start": 1079.0,
      "Time_End": 1084.0,
      "Text": " to rent this apartment, which means I now have a mailing address that won't flag on"
    },
    {
      "Time_Start": 1084.0,
      "Time_End": 1091.0,
      "Text": " a computer system that it's not a residential address. And number two, I have now changed"
    },
    {
      "Time_Start": 1091.0,
      "Time_End": 1098.0,
      "Text": " the address on this man's credit report to the address of my new apartment as Gerald"
    },
    {
      "Time_Start": 1098.0,
      "Time_End": 1105.0,
      "Text": " M. Ozek. That'll become very important later on. So now I've got an address. Now, my British"
    },
    {
      "Time_Start": 1105.0,
      "Time_End": 1110.0,
      "Text": " friend, he never actually even moves in the apartment, because he doesn't want to leave"
    },
    {
      "Time_Start": 1110.0,
      "Time_End": 1116.0,
      "Text": " any evidence later on. The point is, he now has a legit address. So what do we do next?"
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1123.0,
      "Text": " Well, next is what's called the build-up. The next thing we do is we know where he has"
    },
    {
      "Time_Start": 1123.0,
      "Time_End": 1129.0,
      "Text": " credit. So then we go and we say, where can we get credit the easiest? Well, we know if"
    },
    {
      "Time_Start": 1129.0,
      "Time_End": 1136.0,
      "Text": " a bank is offering a 7.9% Visa card, they're going to have a much more stringent credit"
    },
    {
      "Time_Start": 1136.0,
      "Time_End": 1143.0,
      "Text": " qualification process than one that charges 18 or 19%. So our friend has done his research"
    },
    {
      "Time_Start": 1143.0,
      "Time_End": 1150.0,
      "Text": " once again via the lovely internet to find out who offers high-rate cards. And guess"
    },
    {
      "Time_Start": 1150.0,
      "Time_End": 1155.0,
      "Text": " what? That's where he makes his applications. And the high-rate card issuers are going to"
    },
    {
      "Time_Start": 1155.0,
      "Time_End": 1159.0,
      "Text": " issue them because they're going to pull this guy's credit report and go, well, damn, I"
    },
    {
      "Time_Start": 1159.0,
      "Time_End": 1163.0,
      "Text": " don't know why he wants our card, but hey, if he wants to pay 19 or 20%, sure, we'll"
    },
    {
      "Time_Start": 1163.0,
      "Time_End": 1170.0,
      "Text": " send it to him with a huge limit. Okay? That's what he does. So he knows the higher the interest"
    },
    {
      "Time_Start": 1170.0,
      "Time_End": 1176.0,
      "Text": " rate, the more earners, the fees, the easier the application process. So over a short period"
    },
    {
      "Time_Start": 1176.0,
      "Time_End": 1183.0,
      "Text": " of time, he will lodge 15 or 20 credit applications. But wait a minute, he does something else"
    },
    {
      "Time_Start": 1183.0,
      "Time_End": 1189.0,
      "Text": " too. There's three bureaus. Generally, if you have three inquiries within a short period"
    },
    {
      "Time_Start": 1189.0,
      "Time_End": 1193.0,
      "Text": " of time, once you get that third inquiry, you won't be able to get any more credit."
    },
    {
      "Time_Start": 1193.0,
      "Time_End": 1199.0,
      "Text": " So he makes sure he knows what bureau each particular credit card company pulls from."
    },
    {
      "Time_Start": 1199.0,
      "Time_End": 1205.0,
      "Text": " How does he find this out? You just ask them. They'll tell you. It's no big secret. Half"
    },
    {
      "Time_Start": 1205.0,
      "Time_End": 1210.0,
      "Text": " of the key to getting sensitive information that you want a lot of times is picking up"
    },
    {
      "Time_Start": 1210.0,
      "Time_End": 1216.0,
      "Text": " the telephone and speaking in a nice voice and saying, yeah, I've been having some credit"
    },
    {
      "Time_Start": 1216.0,
      "Time_End": 1220.0,
      "Text": " problems. I need to know what bureau you pull off of. You know, a little social engineering."
    },
    {
      "Time_Start": 1220.0,
      "Time_End": 1224.0,
      "Text": " If the guy doesn't want to tell you, say, well, look, I think I've been the victim of"
    },
    {
      "Time_Start": 1224.0,
      "Time_End": 1229.0,
      "Text": " credit fraud, so I need to know because I need to make sure that my bureau is okay."
    },
    {
      "Time_Start": 1229.0,
      "Time_End": 1233.0,
      "Text": " I'll tell you right away, the person will go, oh, sure, we use TransUnion or don't worry,"
    },
    {
      "Time_Start": 1233.0,
      "Time_End": 1237.0,
      "Text": " we use Experian. That was the old TRW. Or don't worry, we use, you know, whatever. They'll"
    },
    {
      "Time_Start": 1237.0,
      "Time_End": 1243.0,
      "Text": " tell you without any difficulty. Social engineering is a key part. Sometimes when you're building"
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1248.0,
      "Text": " this dossier, you might have trouble sometimes getting a whole birthdate. That'll happen"
    },
    {
      "Time_Start": 1248.0,
      "Time_End": 1252.0,
      "Text": " frequently because a credit report won't have a whole birthdate. If that happens because"
    },
    {
      "Time_Start": 1252.0,
      "Time_End": 1257.0,
      "Text": " you need the birthdate, what can you do? It's real simple. You call Gerald and Olazek. You"
    },
    {
      "Time_Start": 1257.0,
      "Time_End": 1262.0,
      "Text": " call them up and you say, hi, my name's Jeffrey Jones. I'm with the American Physics Society"
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1269.0,
      "Text": " and we're updating our faculty list and I'd like to know now, are you still teaching at"
    },
    {
      "Time_Start": 1269.0,
      "Time_End": 1276.0,
      "Text": " UCCS? Are your interests still plasma physics and artificial intelligence, blah, blah, blah?"
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1281.0,
      "Text": " He goes, yeah. He says, okay, now, where did you go to college at because we've got BS"
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1285.0,
      "Text": " from here and your master's from here and is your birthdate still, is your birthdate"
    },
    {
      "Time_Start": 1285.0,
      "Time_End": 1289.0,
      "Text": " such and such? And he goes, oh, no, no, it's actually whatever. Boom, you got the birthdate."
    },
    {
      "Time_Start": 1289.0,
      "Time_End": 1294.0,
      "Text": " And then you tell him something like, look, we'll send you a copy of the entry that we're"
    },
    {
      "Time_Start": 1295.0,
      "Time_End": 1299.0,
      "Text": " going to put in our new directory of American physicists in a couple of weeks. When you"
    },
    {
      "Time_Start": 1299.0,
      "Time_End": 1304.0,
      "Text": " get it, simply initial it if everything's okay and send it back. That'll put him totally"
    },
    {
      "Time_Start": 1304.0,
      "Time_End": 1309.0,
      "Text": " at ease because everybody likes to be stroked, okay? You know, some big agent from William"
    },
    {
      "Time_Start": 1309.0,
      "Time_End": 1313.0,
      "Text": " Lewis calls me. You know, he says, blah, blah, blah. I'm going to tell him whatever he wants."
    },
    {
      "Time_Start": 1313.0,
      "Time_End": 1318.0,
      "Text": " Social engineering works on other people. It also works on us, okay? The point is, generally,"
    },
    {
      "Time_Start": 1318.0,
      "Time_End": 1322.0,
      "Text": " like I said, sometimes you have trouble getting that whole birthdate, but if you do, it's"
    },
    {
      "Time_Start": 1322.0,
      "Time_End": 1328.0,
      "Text": " very easy to get that. And professional people are used to being asked these kind of questions."
    },
    {
      "Time_Start": 1328.0,
      "Time_End": 1332.0,
      "Text": " The other thing is there are various directories, like the National Faculty Directory that will"
    },
    {
      "Time_Start": 1332.0,
      "Time_End": 1338.0,
      "Text": " a lot of times have the birthdates of everybody that's in it. For your information, National"
    },
    {
      "Time_Start": 1338.0,
      "Time_End": 1343.0,
      "Text": " Faculty Directory, it's a huge set of three or four volumes that list the faculty member"
    },
    {
      "Time_Start": 1343.0,
      "Time_End": 1349.0,
      "Text": " of every accredited college of higher learning in the United States and Canada. Generally,"
    },
    {
      "Time_Start": 1349.0,
      "Time_End": 1354.0,
      "Text": " the entry will have the person's full name, their birthdate, their department, all of"
    },
    {
      "Time_Start": 1354.0,
      "Time_End": 1358.0,
      "Text": " that kind of stuff. And it's available at most libraries. I don't know if it's online"
    },
    {
      "Time_Start": 1358.0,
      "Time_End": 1364.0,
      "Text": " yet, but most university libraries will have a copy of it. In any case, so now we've got"
    },
    {
      "Time_Start": 1364.0,
      "Time_End": 1369.0,
      "Text": " the apartment and this guy's name. And we now know where we want to apply for credit."
    },
    {
      "Time_Start": 1369.0,
      "Time_End": 1375.0,
      "Text": " So the next step is to apply for credit. But you want to do it all rapidly because you"
    },
    {
      "Time_Start": 1375.0,
      "Time_End": 1380.0,
      "Text": " want all of these applications to go in. So he makes a stack. Three credit card applications"
    },
    {
      "Time_Start": 1380.0,
      "Time_End": 1385.0,
      "Text": " that clear through Experian. Three that clear through TransUnion. And gosh, what's that"
    },
    {
      "Time_Start": 1385.0,
      "Time_End": 1389.0,
      "Text": " other bureau? I forget right now. It's right up here, but I can't remember."
    },
    {
      "Time_Start": 1389.0,
      "Time_End": 1393.0,
      "Text": " Yeah, three, thank you. Three from our good friends at Equifax. Three that clear through"
    },
    {
      "Time_Start": 1393.0,
      "Time_End": 1400.0,
      "Text": " Equifax. Okay, so he fills all of these out. He mails them all out all at once."
    },
    {
      "Time_Start": 1400.0,
      "Time_End": 1406.0,
      "Text": " And of course, they've all got the address of his apartment. Now, odds are a couple,"
    },
    {
      "Time_Start": 1406.0,
      "Time_End": 1412.0,
      "Text": " two or three of them will get declined because their address on the other bureaus might not"
    },
    {
      "Time_Start": 1412.0,
      "Time_End": 1417.0,
      "Text": " have been changed yet. But most of the others will actually probably go through because"
    },
    {
      "Time_Start": 1417.0,
      "Time_End": 1422.0,
      "Text": " by the time you're processed, that new address will show up on the credit bureau. Okay?"
    },
    {
      "Time_Start": 1422.0,
      "Time_End": 1427.0,
      "Text": " So a few weeks later, he's going to get a fistful of cards. Now, whilst he's waiting"
    },
    {
      "Time_Start": 1427.0,
      "Time_End": 1431.0,
      "Text": " for those, he goes out and gets instant credit. You know, Best Buy charges something like"
    },
    {
      "Time_Start": 1431.0,
      "Time_End": 1436.0,
      "Text": " 22%. You know why? That's why they give you instant credit in the store. Because they"
    },
    {
      "Time_Start": 1436.0,
      "Time_End": 1443.0,
      "Text": " charge so much in interest. So he walks into places like Best Buy or Circuit City or whatever"
    },
    {
      "Time_Start": 1443.0,
      "Time_End": 1447.0,
      "Text": " and applies for their store cards. He gets them. And then, of course, he goes and buys"
    },
    {
      "Time_Start": 1447.0,
      "Time_End": 1452.0,
      "Text": " whatever he wants to buy later on. The point is, in a short period of time, he will have"
    },
    {
      "Time_Start": 1452.0,
      "Time_End": 1459.0,
      "Text": " amassed a massive ability to access money. But he's not quite ready yet. The next thing"
    },
    {
      "Time_Start": 1459.0,
      "Time_End": 1465.0,
      "Text": " is to open a bank account. Well, that's real easy to do. Once again, I have to tell you,"
    },
    {
      "Time_Start": 1465.0,
      "Time_End": 1472.0,
      "Text": " our friends at theIDshop.com offer the very best. He walks into a bank, Pike's Peak Savings"
    },
    {
      "Time_Start": 1472.0,
      "Time_End": 1476.0,
      "Text": " Bank, and says, yeah, I'd like to open a checking and a savings account. And they might say,"
    },
    {
      "Time_Start": 1476.0,
      "Time_End": 1479.0,
      "Text": " would you like overdraft protection? And of course, he'll say, yes, I would. Because"
    },
    {
      "Time_Start": 1479.0,
      "Time_End": 1484.0,
      "Text": " we know that means they're going to run a credit report. So he opens his account. They"
    },
    {
      "Time_Start": 1484.0,
      "Time_End": 1488.0,
      "Text": " check with Telecheck. Yeah, he's a good guy. They check with one of the bureaus. Yeah,"
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1493.0,
      "Text": " he's a good guy. Ten minutes later, he's walking out of the bank with a new checkbook, maybe"
    },
    {
      "Time_Start": 1493.0,
      "Time_End": 1498.0,
      "Text": " overdraft protection of $1,000 on his new account. But most importantly, he now has"
    },
    {
      "Time_Start": 1498.0,
      "Time_End": 1505.0,
      "Text": " a place to put the proceeds of the next step of the plan. Step three is what we call the"
    },
    {
      "Time_Start": 1505.0,
      "Time_End": 1510.0,
      "Text": " bust-out. The bust-out is now we've got a stack of credit cards, we have a stack of"
    },
    {
      "Time_Start": 1510.0,
      "Time_End": 1516.0,
      "Text": " instant credit, and we've got a new bank account. So we want to now go and max this stuff out"
    },
    {
      "Time_Start": 1516.0,
      "Time_End": 1521.0,
      "Text": " and turn it into cash as rapidly as possible. Well, most credit cards come with convenience"
    },
    {
      "Time_Start": 1521.0,
      "Time_End": 1526.0,
      "Text": " checks. We've got a bank account now. So we fill out those convenience checks for as much"
    },
    {
      "Time_Start": 1526.0,
      "Time_End": 1532.0,
      "Text": " as possible to move that money into that bank account. So we fill those out. And the thing"
    },
    {
      "Time_Start": 1532.0,
      "Time_End": 1538.0,
      "Text": " is, that looks better to a bank. For example, they send you a Visa card with an $8,000 limit."
    },
    {
      "Time_Start": 1538.0,
      "Time_End": 1544.0,
      "Text": " It looks bad if you go to a bank five days in a row and take a $500 cash advance out"
    },
    {
      "Time_Start": 1544.0,
      "Time_End": 1549.0,
      "Text": " of an ATM or at the teller window. It looks better if you just write one of those convenience"
    },
    {
      "Time_Start": 1549.0,
      "Time_End": 1555.0,
      "Text": " checks for $3,000. That's a process without any problem. So over the next couple of weeks,"
    },
    {
      "Time_Start": 1555.0,
      "Time_End": 1561.0,
      "Text": " he writes convenience checks against the cash advance limit, or in some cases, the entire"
    },
    {
      "Time_Start": 1561.0,
      "Time_End": 1566.0,
      "Text": " credit limit of the cards he's set up. The reason he does this concurrently is because"
    },
    {
      "Time_Start": 1566.0,
      "Time_End": 1570.0,
      "Text": " remember, at the end of the month, all of those creditors are going to report to the"
    },
    {
      "Time_Start": 1570.0,
      "Time_End": 1576.0,
      "Text": " Bureau the balance on those accounts. If all of a sudden, all of those accounts show up"
    },
    {
      "Time_Start": 1576.0,
      "Time_End": 1581.0,
      "Text": " with a huge balance, that's going to set off a warning bell. But by the time that happens,"
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1588.0,
      "Text": " our buddy is long gone. So he writes the convenience checks, puts them in. Checks clear pretty"
    },
    {
      "Time_Start": 1588.0,
      "Time_End": 1593.0,
      "Text": " quickly now. Generally within four business days, the funds will actually have gone from"
    },
    {
      "Time_Start": 1593.0,
      "Time_End": 1599.0,
      "Text": " the credit card company into the account. Then for the stuff that he can't use, he buys"
    },
    {
      "Time_Start": 1599.0,
      "Time_End": 1605.0,
      "Text": " items that he might want. A computer, television, VCR, whatever else he wants. That kind of"
    },
    {
      "Time_Start": 1605.0,
      "Time_End": 1613.0,
      "Text": " stuff. Then a week later, he goes to the bank. He takes his money out that he wants. He closes"
    },
    {
      "Time_Start": 1613.0,
      "Time_End": 1620.0,
      "Text": " the bust out. Takes the cash out in the form of, you know, he either takes cash out, then"
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1625.0,
      "Text": " goes and buys money orders somewhere else, whatever else. But the point is, when he's"
    },
    {
      "Time_Start": 1625.0,
      "Time_End": 1633.0,
      "Text": " done, he has now converted all of that credit into cash in a way that can't really be traced."
    },
    {
      "Time_Start": 1633.0,
      "Time_End": 1637.0,
      "Text": " Now, what happens? Generally everything will go just..."
    },
    {
      "Time_Start": 1640.0,
      "Time_End": 1642.0,
      "Text": " Ladies and gentlemen, we have some..."
    },
    {
      "Time_Start": 1642.0,
      "Time_End": 1646.0,
      "Text": " 60 days later, because none of these bills have been paid, he's going to start getting"
    },
    {
      "Time_Start": 1646.0,
      "Time_End": 1652.0,
      "Text": " phone calls. And he's not going to know a damn thing about it. Well, by the time he"
    },
    {
      "Time_Start": 1652.0,
      "Time_End": 1657.0,
      "Text": " puts it all together, our friend has moved on. But guess where our friend goes next?"
    },
    {
      "Time_Start": 1657.0,
      "Time_End": 1662.0,
      "Text": " He goes to another city in the United States and does the same thing. He generally does"
    },
    {
      "Time_Start": 1662.0,
      "Time_End": 1668.0,
      "Text": " three or four U.S. cities the same way. Now, because he uses different creditors, they're"
    },
    {
      "Time_Start": 1668.0,
      "Time_End": 1673.0,
      "Text": " in different cities, whatever, the thugs never really get involved. Because you see, the"
    },
    {
      "Time_Start": 1673.0,
      "Time_End": 1677.0,
      "Text": " thing of it is, the Secret Service generally only gets involved. Secret Service is the"
    },
    {
      "Time_Start": 1677.0,
      "Time_End": 1684.0,
      "Text": " lead agency for this type of crime. But in general, they only get involved if the individual"
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1691.0,
      "Text": " loss is very, very substantial, like over $15,000 or $20,000 to one creditor. And also"
    },
    {
      "Time_Start": 1691.0,
      "Time_End": 1698.0,
      "Text": " if it seems to be part of an organized ring. But the problem is, nobody realizes that for"
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1703.0,
      "Text": " a very, very long time. Because initially it just seems, oh, somebody got a hold of"
    },
    {
      "Time_Start": 1703.0,
      "Time_End": 1708.0,
      "Text": " your account number and whatever. It doesn't seem like, oh, wait a minute, this is a big"
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1714.0,
      "Text": " operation that's underway. And so by the time that the thugs might actually get involved,"
    },
    {
      "Time_Start": 1714.0,
      "Time_End": 1720.0,
      "Text": " the smart identity thief like this guy has moved way on. But in general, what happens"
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1727.0,
      "Text": " is, the card companies have a profit loss guideline. That's why there's annual fees,"
    },
    {
      "Time_Start": 1727.0,
      "Time_End": 1731.0,
      "Text": " the bounced check fees. If any of you have bounced a check lately to a credit card company,"
    },
    {
      "Time_Start": 1731.0,
      "Time_End": 1735.0,
      "Text": " you know they're very expensive now. Someone charging $29. You're one day late with your"
    },
    {
      "Time_Start": 1735.0,
      "Time_End": 1741.0,
      "Text": " payment, $29. Why do you think all those fees are so high? Because they've said, okay, credit"
    },
    {
      "Time_Start": 1741.0,
      "Time_End": 1747.0,
      "Text": " card lending is the single most profitable item banks and financial institutions do."
    },
    {
      "Time_Start": 1747.0,
      "Time_End": 1753.0,
      "Text": " But it's also vulnerable to being penetrated by fraud. So all they've simply done is increase"
    },
    {
      "Time_Start": 1753.0,
      "Time_End": 1759.0,
      "Text": " the cost to us in terms of those fees to cover what they lose. So many times the bank is"
    },
    {
      "Time_Start": 1759.0,
      "Time_End": 1764.0,
      "Text": " not all that concerned because as long as their losses for the year don't exceed what"
    },
    {
      "Time_Start": 1764.0,
      "Time_End": 1770.0,
      "Text": " they expect to lose, then they're not too concerned about it. Now, there was a guy in"
    },
    {
      "Time_Start": 1770.0,
      "Time_End": 1776.0,
      "Text": " New York, a Nigerian, and they called him the Duke of New York. He did about $8 million"
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1781.0,
      "Text": " in credit card fraud this way. It's said he even bought a Mercedes automobile and shipped"
    },
    {
      "Time_Start": 1781.0,
      "Time_End": 1787.0,
      "Text": " it back to Africa this way. They took him down because he was doing so much so rapidly"
    },
    {
      "Time_Start": 1787.0,
      "Time_End": 1793.0,
      "Text": " it was obvious this is an organized operation that's going on and the banks were hit hard"
    },
    {
      "Time_Start": 1793.0,
      "Time_End": 1797.0,
      "Text": " again and again and again and again over a short period of time, which took them out"
    },
    {
      "Time_Start": 1797.0,
      "Time_End": 1803.0,
      "Text": " of their profit loss guidelines, which means they then want to go after the person. And"
    },
    {
      "Time_Start": 1803.0,
      "Time_End": 1807.0,
      "Text": " once in a while they decide they want to make an example of someone. But the general"
    },
    {
      "Time_Start": 1807.0,
      "Time_End": 1812.0,
      "Text": " thing of it is here, and this is what my British friend has learned, is that this is a crime"
    },
    {
      "Time_Start": 1812.0,
      "Time_End": 1819.0,
      "Text": " that if you strike hard and know how to strike and move on, that you can do this and make,"
    },
    {
      "Time_Start": 1819.0,
      "Time_End": 1825.0,
      "Text": " you know, he probably makes $100,000 to $200,000 a year doing this. Why can you do this? Because"
    },
    {
      "Time_Start": 1825.0,
      "Time_End": 1833.0,
      "Text": " America is the only industrialized democracy that allows this wholesale trafficking and"
    },
    {
      "Time_Start": 1833.0,
      "Time_End": 1839.0,
      "Text": " personal identifiers. Credit bureaus will tell you we couldn't have our files without"
    },
    {
      "Time_Start": 1839.0,
      "Time_End": 1844.0,
      "Text": " social security numbers. That's bullshit. In Canada, when you apply for credit now,"
    },
    {
      "Time_Start": 1844.0,
      "Time_End": 1850.0,
      "Text": " providing your social insurance number is optional because there is so much bitching"
    },
    {
      "Time_Start": 1850.0,
      "Time_End": 1855.0,
      "Text": " in Canada about the fact that SINs, the Canadian equivalent of our social security number,"
    },
    {
      "Time_Start": 1855.0,
      "Time_End": 1860.0,
      "Text": " could be used to uniquely identify people. The Canadian government insisted that the"
    },
    {
      "Time_Start": 1860.0,
      "Time_End": 1866.0,
      "Text": " Canadian credit bureaus come up with a file retrieval system that did not depend on social"
    },
    {
      "Time_Start": 1866.0,
      "Time_End": 1872.0,
      "Text": " insurance numbers. In the United Kingdom and Holland, they do not use their equivalent"
    },
    {
      "Time_Start": 1872.0,
      "Time_End": 1880.0,
      "Text": " of RSS number to pull credit reports. So you do not have to use social security numbers"
    },
    {
      "Time_Start": 1880.0,
      "Time_End": 1886.0,
      "Text": " as a file indexing tool. It's absolute bullshit. The reason the credit bureaus like it is because"
    },
    {
      "Time_Start": 1886.0,
      "Time_End": 1892.0,
      "Text": " one, it's a very handy and unique identifier because in theory, each person's number belongs"
    },
    {
      "Time_Start": 1892.0,
      "Time_End": 1898.0,
      "Text": " only to them, and number two, it allows them, if they need to, to access many other databases"
    },
    {
      "Time_Start": 1898.0,
      "Time_End": 1904.0,
      "Text": " that contain information about you. The other problem that makes us all vulnerable to identity"
    },
    {
      "Time_Start": 1904.0,
      "Time_End": 1910.0,
      "Text": " theft is the fact that so many other reasons that have nothing to do with social security"
    },
    {
      "Time_Start": 1910.0,
      "Time_End": 1916.0,
      "Text": " use this number. Many states, such as Hawaii, the driver's license number is a social security"
    },
    {
      "Time_Start": 1916.0,
      "Time_End": 1922.0,
      "Text": " number. Many states that even if they don't use the SS number as their license number,"
    },
    {
      "Time_Start": 1922.0,
      "Time_End": 1927.0,
      "Text": " they still take it and put it into their database. A few states don't. One of them is Washington"
    },
    {
      "Time_Start": 1927.0,
      "Time_End": 1933.0,
      "Text": " State. But most states do. Either if they don't put the number on the card, they request it when"
    },
    {
      "Time_Start": 1933.0,
      "Time_End": 1939.0,
      "Text": " you apply for the card. What in the hell does social security, when I retire, have to do with me"
    },
    {
      "Time_Start": 1939.0,
      "Time_End": 1945.0,
      "Text": " driving a car? The answer is it has absolutely nothing to do with it. But what it is is the"
    },
    {
      "Time_Start": 1945.0,
      "Time_End": 1952.0,
      "Text": " government wanted to create a national identifier that they knew the American people would never"
    },
    {
      "Time_Start": 1952.0,
      "Time_End": 1958.0,
      "Text": " stand for it if they tried to do it above board. Do you remember in the old days, the little white"
    },
    {
      "Time_Start": 1958.0,
      "Time_End": 1964.0,
      "Text": " social security cards had a disclaimer at the bottom? And what did that disclaimer say? Not for"
    },
    {
      "Time_Start": 1964.0,
      "Time_End": 1970.0,
      "Text": " identification purposes. If you've gotten a social security card any time in the last 15 years, it doesn't"
    },
    {
      "Time_Start": 1970.0,
      "Time_End": 1977.0,
      "Text": " say that anymore. But your parents' card does. Why? Because the government decided, wait a minute,"
    },
    {
      "Time_Start": 1977.0,
      "Time_End": 1984.0,
      "Text": " this is a way to create that national identity card. Why do states ask for it? For driver's licenses."
    },
    {
      "Time_Start": 1984.0,
      "Time_End": 1990.0,
      "Text": " The only real purposes of social security is one, your employer needs it because they're paying SS"
    },
    {
      "Time_Start": 1990.0,
      "Time_End": 1998.0,
      "Text": " benefits. Two, it's on your tax return to uniquely identify it because a lot of people do have the same"
    },
    {
      "Time_Start": 1998.0,
      "Time_End": 2004.0,
      "Text": " first, middle, and last name and birth date. And for tax purposes, you can argue it should be on the"
    },
    {
      "Time_Start": 2004.0,
      "Time_End": 2014.0,
      "Text": " return. But beyond that, there is no real reason that social security numbers need to be commonly used"
    },
    {
      "Time_Start": 2014.0,
      "Time_End": 2022.0,
      "Text": " as an identification tool in this country. And this has been pulled on the American people without any"
    },
    {
      "Time_Start": 2022.0,
      "Time_End": 2029.0,
      "Text": " sort of public debate. It was done by bureaucratic fiat. And it never had to happen. One of the reasons"
    },
    {
      "Time_Start": 2029.0,
      "Time_End": 2035.0,
      "Text": " it's happened because when people ask for something on a form, we as sheep say sure. Cable company wants"
    },
    {
      "Time_Start": 2035.0,
      "Time_End": 2042.0,
      "Text": " the SS number? Sure. The bank wants it? Sure. They ask for it, we'll provide it. Nobody said, wait a minute,"
    },
    {
      "Time_Start": 2042.0,
      "Time_End": 2049.0,
      "Text": " why do you need my SS number to hook me up for cable TV or to give me electricity? Why do you need it?"
    },
    {
      "Time_Start": 2049.0,
      "Time_End": 2056.0,
      "Text": " But we gave it anyway. So what happened was once they got used to collecting it, then they kept on"
    },
    {
      "Time_Start": 2056.0,
      "Time_End": 2064.0,
      "Text": " collecting it. And things like the Privacy Act of 75 don't specifically prohibit them from collecting it."
    },
    {
      "Time_Start": 2064.0,
      "Time_End": 2070.0,
      "Text": " They say that they have no right necessarily to ask for it, but it also says they don't have to give you"
    },
    {
      "Time_Start": 2070.0,
      "Time_End": 2079.0,
      "Text": " service if you don't provide it. So that's how we've gotten into this phase. Now, I have a book on this"
    },
    {
      "Time_Start": 2079.0,
      "Time_End": 2086.0,
      "Text": " called Identity Theft, The Cybercrime of the Millennium. This is a detailed look, even more so in various ways"
    },
    {
      "Time_Start": 2086.0,
      "Time_End": 2093.0,
      "Text": " people steal someone else's identity, the various types of identity thieves, because not every identity thief,"
    },
    {
      "Time_Start": 2093.0,
      "Time_End": 2099.0,
      "Text": " as you're saying, some like our friend from the United Kingdom, are people that want to go and take your"
    },
    {
      "Time_Start": 2099.0,
      "Time_End": 2105.0,
      "Text": " identity and ruin your financial rating. There are other people who take your identity and live under it"
    },
    {
      "Time_Start": 2105.0,
      "Time_End": 2110.0,
      "Text": " for many, many years. And that can be even worse, because what if somebody takes your identity and fathers"
    },
    {
      "Time_Start": 2110.0,
      "Time_End": 2116.0,
      "Text": " children and then doesn't pay child support? Then all of a sudden the government comes and garnishes your wage"
    },
    {
      "Time_Start": 2116.0,
      "Time_End": 2123.0,
      "Text": " to pay for somebody else's children. But you say, but they're not my children. And he says, no, wait a minute."
    },
    {
      "Time_Start": 2123.0,
      "Time_End": 2129.0,
      "Text": " Is your name Gerald Olusek? Yes. Is your birth date such and such? Yes. Is your social security? Yes."
    },
    {
      "Time_Start": 2129.0,
      "Time_End": 2135.0,
      "Text": " Well, they're your kids. But wait a minute. I'm black. Those kids are white. It doesn't matter."
    },
    {
      "Time_Start": 2140.0,
      "Time_End": 2147.0,
      "Text": " In fact, you guys laugh, but let me tell you something. In Los Angeles County, home of the O.J. Simpson trial"
    },
    {
      "Time_Start": 2147.0,
      "Time_End": 2154.0,
      "Text": " and many other interesting modern day occurrences, they have the absolute worst child support enforcement unit."
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2161.0,
      "Text": " They will go after somebody even if they know the person is not the father of these children."
    },
    {
      "Time_Start": 2161.0,
      "Time_End": 2167.0,
      "Text": " Because what they do, if your identifiers just happen to match the person they're looking for,"
    },
    {
      "Time_Start": 2167.0,
      "Time_End": 2173.0,
      "Text": " they'll send you a summons to appear in court. God forbid if you don't show up in court, because if you don't,"
    },
    {
      "Time_Start": 2173.0,
      "Time_End": 2179.0,
      "Text": " they'll get a default judgment for that child support. And then they come after you."
    },
    {
      "Time_Start": 2179.0,
      "Time_End": 2189.0,
      "Text": " Even later, if you go to them and say, wait a minute. I'm not this kid's father. I can document I was in Timbuktu when little Johnny was born."
    },
    {
      "Time_Start": 2189.0,
      "Time_End": 2193.0,
      "Text": " They'll still say, no, no, we have a court order. You're paying the child support."
    },
    {
      "Time_Start": 2193.0,
      "Time_End": 2199.0,
      "Text": " They make people, many of them who are poor, and that's why they can't show up for their court hearing,"
    },
    {
      "Time_Start": 2199.0,
      "Time_End": 2205.0,
      "Text": " or the summons goes to a wrong address, they'll insist that these people still pay."
    },
    {
      "Time_Start": 2205.0,
      "Time_End": 2213.0,
      "Text": " And if they can't get a lawyer, you have men and some women who pay child support because of this for years for kids they don't owe,"
    },
    {
      "Time_Start": 2213.0,
      "Time_End": 2222.0,
      "Text": " because they can't get out of the system. A lot of assistant district attorneys in L.A. County have resigned over this policy of theirs."
    },
    {
      "Time_Start": 2222.0,
      "Time_End": 2231.0,
      "Text": " So you see, this isn't just an academic issue. The problem is, as our personal identifiers get loaded into more and more databases,"
    },
    {
      "Time_Start": 2231.0,
      "Time_End": 2238.0,
      "Text": " and there's almost no regulation of the sale, transfer, and exchange of personal information,"
    },
    {
      "Time_Start": 2238.0,
      "Time_End": 2247.0,
      "Text": " the opportunity for our identities to be stolen or for us to fall victim to somebody else's malfeasance increases."
    },
    {
      "Time_Start": 2247.0,
      "Time_End": 2250.0,
      "Text": " The worst thing that can happen to identity theft, let me tell you about this."
    },
    {
      "Time_Start": 2250.0,
      "Time_End": 2256.0,
      "Text": " There was a motor vehicle clerk named Nan Farnell up in Washington State. I love Washington. That's where Limpanics is."
    },
    {
      "Time_Start": 2256.0,
      "Time_End": 2259.0,
      "Text": " Beautiful state. But they got a problem at the DMV, or they did."
    },
    {
      "Time_Start": 2259.0,
      "Time_End": 2267.0,
      "Text": " Women would come in to get driver's licenses, and she wouldn't notice if a woman just met her general similarities."
    },
    {
      "Time_Start": 2267.0,
      "Time_End": 2272.0,
      "Text": " Same eye color, hair color, same general build, and of course the same race."
    },
    {
      "Time_Start": 2272.0,
      "Time_End": 2277.0,
      "Text": " Then she'd make a duplicate of that individual's license."
    },
    {
      "Time_Start": 2277.0,
      "Time_End": 2283.0,
      "Text": " Then she would go out and open checking accounts and whatever in the victim's names."
    },
    {
      "Time_Start": 2283.0,
      "Time_End": 2288.0,
      "Text": " Well, she would write big checks like for thousands of dollars for jewelry or whatever else."
    },
    {
      "Time_Start": 2288.0,
      "Time_End": 2294.0,
      "Text": " Because until the checks start bouncing, Pellet Check and all those places are going to approve the checks."
    },
    {
      "Time_Start": 2294.0,
      "Time_End": 2299.0,
      "Text": " So the checks bounce. They then go after the real woman who she victimized."
    },
    {
      "Time_Start": 2299.0,
      "Time_End": 2303.0,
      "Text": " They arrested her. But the woman says, wait a minute, I'm not this woman."
    },
    {
      "Time_Start": 2303.0,
      "Time_End": 2310.0,
      "Text": " Well, they do a lineup. The woman in the store who saw her for maybe three minutes writing a check said, yeah, that looks like her."
    },
    {
      "Time_Start": 2310.0,
      "Time_End": 2315.0,
      "Text": " You think about it. If I give you a check, you see me for a couple of minutes."
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2325.0,
      "Text": " Two weeks later, if you come do a lineup, you might pick any black male that meets my general outline as, oh yeah, that's the person who gave me the check."
    },
    {
      "Time_Start": 2325.0,
      "Time_End": 2330.0,
      "Text": " Because there's not a lot of in-depth identification of this person."
    },
    {
      "Time_Start": 2330.0,
      "Time_End": 2335.0,
      "Text": " So when the woman identified her in the lineup, the cops said, oh, you're guilty."
    },
    {
      "Time_Start": 2335.0,
      "Time_End": 2342.0,
      "Text": " The woman was convicted of the felony check forgery. Because this was big money. We're talking $15,000, $20,000."
    },
    {
      "Time_Start": 2342.0,
      "Time_End": 2345.0,
      "Text": " Because she bought jewelry, expensive furniture, all sorts of other stuff."
    },
    {
      "Time_Start": 2345.0,
      "Time_End": 2351.0,
      "Text": " She was convicted. She was waiting to be sent to the Washington State Penitentiary for Women."
    },
    {
      "Time_Start": 2351.0,
      "Time_End": 2357.0,
      "Text": " When finally Nan Farnell struck again. Same modus operandi, same bit."
    },
    {
      "Time_Start": 2357.0,
      "Time_End": 2363.0,
      "Text": " Then the detective goes, oh my God, I put the victim in jail. The real woman is still out there."
    },
    {
      "Time_Start": 2363.0,
      "Time_End": 2366.0,
      "Text": " Well, it does have a happy ending of sorts."
    },
    {
      "Time_Start": 2366.0,
      "Time_End": 2371.0,
      "Text": " Now, of course, the victim now can't use her own name. She has a criminal record."
    },
    {
      "Time_Start": 2371.0,
      "Time_End": 2375.0,
      "Text": " She has to carry a copy of the police report with her. All that stuff."
    },
    {
      "Time_Start": 2375.0,
      "Time_End": 2379.0,
      "Text": " But they did catch up with Nan Farnell last year in Mexico."
    },
    {
      "Time_Start": 2379.0,
      "Time_End": 2383.0,
      "Text": " Hey, now she's back home in Washington. I think she got three to five years."
    },
    {
      "Time_Start": 2383.0,
      "Time_End": 2386.0,
      "Text": " But I worry, what's she going to do when she gets out?"
    },
    {
      "Time_Start": 2386.0,
      "Time_End": 2391.0,
      "Text": " Because, I mean, does she have some identities we don't know about that she squirreled away?"
    },
    {
      "Time_Start": 2391.0,
      "Time_End": 2399.0,
      "Text": " The point of it is, this all happens because the number of databases with personal information continues to grow."
    },
    {
      "Time_Start": 2399.0,
      "Time_End": 2404.0,
      "Text": " Did you know there is now a new database called the National New Hire Database?"
    },
    {
      "Time_Start": 2404.0,
      "Time_End": 2414.0,
      "Text": " And this is a perfect example of how our privacy gets destroyed in a massive way to accomplish what seems to be a societally useful goal."
    },
    {
      "Time_Start": 2414.0,
      "Time_End": 2418.0,
      "Text": " We all know there's a problem with parents who don't pay child support."
    },
    {
      "Time_Start": 2418.0,
      "Time_End": 2422.0,
      "Text": " I'm the first one to agree with you. Kids deserve their child support."
    },
    {
      "Time_Start": 2422.0,
      "Time_End": 2427.0,
      "Text": " So the government said, well, wait a minute. How can we catch all of these child support scofflaws?"
    },
    {
      "Time_Start": 2427.0,
      "Time_End": 2431.0,
      "Text": " So they said, I know. Everybody's got to work to eat, right?"
    },
    {
      "Time_Start": 2431.0,
      "Time_End": 2438.0,
      "Text": " So let's create a database of every person that either changes jobs or is rehired."
    },
    {
      "Time_Start": 2438.0,
      "Time_End": 2443.0,
      "Text": " And that database we'll call the National New Hire Database."
    },
    {
      "Time_Start": 2443.0,
      "Time_End": 2455.0,
      "Text": " And in that database we will have the name, the birth date, the social security number, the sex and race, and some other identifiers that vary state to state of every person who works."
    },
    {
      "Time_Start": 2455.0,
      "Time_End": 2463.0,
      "Text": " And when you change a job, your employer, through his payroll filings, will send this information to the federal government."
    },
    {
      "Time_Start": 2463.0,
      "Time_End": 2470.0,
      "Text": " And then they will run this against a master list of child support scofflaws in all 50 states."
    },
    {
      "Time_Start": 2470.0,
      "Time_End": 2477.0,
      "Text": " So once again, your data is now making another trip into another database."
    },
    {
      "Time_Start": 2477.0,
      "Time_End": 2484.0,
      "Text": " Because we've decided to catch the relatively few people who don't live up to their obligations."
    },
    {
      "Time_Start": 2484.0,
      "Time_End": 2489.0,
      "Text": " We're going to take everybody's privacy and throw it down the trash can."
    },
    {
      "Time_Start": 2489.0,
      "Time_End": 2491.0,
      "Text": " And that's exactly what they're doing."
    },
    {
      "Time_Start": 2491.0,
      "Time_End": 2496.0,
      "Text": " This also means that some clerk who has access to that data, and it's a lot of people."
    },
    {
      "Time_Start": 2496.0,
      "Time_End": 2498.0,
      "Text": " Because it's the employer who files it."
    },
    {
      "Time_Start": 2498.0,
      "Time_End": 2503.0,
      "Text": " It's the various contractors that compile the databases for each state."
    },
    {
      "Time_Start": 2503.0,
      "Time_End": 2506.0,
      "Text": " Then the people that forward it on to the federal government."
    },
    {
      "Time_Start": 2506.0,
      "Time_End": 2510.0,
      "Text": " It's a lot of people that can stick their fingers in and get a hold of your name and number."
    },
    {
      "Time_Start": 2510.0,
      "Time_End": 2514.0,
      "Text": " And that increases the chance of somebody committing identity theft."
    },
    {
      "Time_Start": 2514.0,
      "Time_End": 2515.0,
      "Text": " Then there's the problem."
    },
    {
      "Time_Start": 2515.0,
      "Time_End": 2525.0,
      "Text": " Anytime you match millions and millions of names and personal identifiers against a database, you will inevitably create mismatches."
    },
    {
      "Time_Start": 2525.0,
      "Time_End": 2527.0,
      "Text": " It just happens."
    },
    {
      "Time_Start": 2527.0,
      "Time_End": 2531.0,
      "Text": " That's one of the reasons the SS number has the long structure it has."
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2537.0,
      "Text": " Because many people have the same first name, middle initial, last name, and even birth date."
    },
    {
      "Time_Start": 2537.0,
      "Time_End": 2544.0,
      "Text": " There may be 150 other people in a country of 270 million that share those same identifiers with you."
    },
    {
      "Time_Start": 2544.0,
      "Time_End": 2549.0,
      "Text": " What happens if one of those guys owes child support and you get a new job?"
    },
    {
      "Time_Start": 2549.0,
      "Time_End": 2553.0,
      "Text": " Well, all of a sudden your boss tells you, hey, look, John, we've got to let you go."
    },
    {
      "Time_Start": 2553.0,
      "Time_End": 2555.0,
      "Text": " Because, look, they're going to garnish your wages."
    },
    {
      "Time_Start": 2555.0,
      "Time_End": 2561.0,
      "Text": " Because, look, you didn't tell us you've got three kids back in Oklahoma that you haven't been supporting for ten years."
    },
    {
      "Time_Start": 2561.0,
      "Time_End": 2562.0,
      "Text": " So, goodbye."
    },
    {
      "Time_Start": 2562.0,
      "Time_End": 2564.0,
      "Text": " And, look, you say that it's not you."
    },
    {
      "Time_Start": 2564.0,
      "Time_End": 2566.0,
      "Text": " But, look, the government says it is you."
    },
    {
      "Time_Start": 2566.0,
      "Time_End": 2568.0,
      "Text": " So, goodbye."
    },
    {
      "Time_Start": 2568.0,
      "Time_End": 2569.0,
      "Text": " Okay?"
    },
    {
      "Time_Start": 2569.0,
      "Time_End": 2572.0,
      "Text": " This is the kind of stuff that can happen and does happen."
    },
    {
      "Time_Start": 2573.0,
      "Time_End": 2576.0,
      "Text": " Now, I've got a book coming out in the fall of this year."
    },
    {
      "Time_Start": 2580.0,
      "Time_End": 2582.0,
      "Text": " Oh, well, that doesn't look too good."
    },
    {
      "Time_Start": 2582.0,
      "Time_End": 2583.0,
      "Text": " There we go."
    },
    {
      "Time_Start": 2583.0,
      "Time_End": 2586.0,
      "Text": " It's called Big Brother's Secret Databases."
    },
    {
      "Time_Start": 2586.0,
      "Time_End": 2589.0,
      "Text": " Because, remember, Big Brother, he's not just watching you."
    },
    {
      "Time_Start": 2589.0,
      "Time_End": 2591.0,
      "Text": " He's taking some notes, buddy."
    },
    {
      "Time_Start": 2591.0,
      "Time_End": 2592.0,
      "Text": " Now."
    },
    {
      "Time_Start": 2596.0,
      "Time_End": 2597.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2597.0,
      "Time_End": 2608.0,
      "Text": " This book is going to be the first book of its kind where I will inventory and explain to you all of the so-called secret databases that the government and the private sector runs."
    },
    {
      "Time_Start": 2608.0,
      "Time_End": 2613.0,
      "Text": " For example, everybody's heard of NCIC, the National Crime Information Center."
    },
    {
      "Time_Start": 2613.0,
      "Time_End": 2621.0,
      "Text": " But that's nothing compared to the Treasury Enforcement Computer System that your name gets put into every time you cross a border."
    },
    {
      "Time_Start": 2621.0,
      "Time_End": 2630.0,
      "Text": " Did you know the Treasury Enforcement Computer System, depending on answers to certain questions, can conclude that you fit the profile of a drug smuggler?"
    },
    {
      "Time_Start": 2630.0,
      "Time_End": 2634.0,
      "Text": " They keep a list of every time you cross the border from Canada or Mexico in your car."
    },
    {
      "Time_Start": 2634.0,
      "Time_End": 2636.0,
      "Text": " That gets recorded."
    },
    {
      "Time_Start": 2636.0,
      "Time_End": 2646.0,
      "Text": " They can then go check that information years later against motor vehicle registration records to determine, hey, how many times did John cross the border to Canada in the last ten years?"
    },
    {
      "Time_Start": 2646.0,
      "Time_End": 2650.0,
      "Text": " They can create a profile of your foreign travel habits."
    },
    {
      "Time_Start": 2650.0,
      "Time_End": 2653.0,
      "Text": " The problem is, that's the Treasury Department."
    },
    {
      "Time_Start": 2653.0,
      "Time_End": 2655.0,
      "Text": " Who else is in the Treasury Department?"
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2657.0,
      "Text": " Something like IRS?"
    },
    {
      "Time_Start": 2657.0,
      "Time_End": 2658.0,
      "Text": " Hmm."
    },
    {
      "Time_Start": 2658.0,
      "Time_End": 2663.0,
      "Text": " Well, they have a database called FIMSIN, the Financial Crimes Enforcement Network."
    },
    {
      "Time_Start": 2663.0,
      "Time_End": 2665.0,
      "Text": " Now, FIMSIN is interesting."
    },
    {
      "Time_Start": 2665.0,
      "Time_End": 2668.0,
      "Text": " Go buy $3,000 worth of money orders."
    },
    {
      "Time_Start": 2668.0,
      "Time_End": 2671.0,
      "Text": " There's a currency transaction report that gets filed."
    },
    {
      "Time_Start": 2671.0,
      "Time_End": 2685.0,
      "Text": " FIMSIN collates data from banks, currency transaction reports, property, valuations, all sorts of other things to determine if you're somebody that the IRS should be more interested in."
    },
    {
      "Time_Start": 2685.0,
      "Time_End": 2694.0,
      "Text": " Did you know if you own a car worth more than $60,000, that that's potentially enough to get you to come under the scrutiny of FIMSIN?"
    },
    {
      "Time_Start": 2694.0,
      "Time_End": 2696.0,
      "Text": " There's all sorts of secret databases."
    },
    {
      "Time_Start": 2696.0,
      "Time_End": 2701.0,
      "Text": " There's now what are called excluded persons lists that government agencies create."
    },
    {
      "Time_Start": 2701.0,
      "Time_End": 2711.0,
      "Text": " Like when a fraud happens or whatever, the people who are participating in it, their names get put on a list of people that can no longer do business with a particular government agency."
    },
    {
      "Time_Start": 2711.0,
      "Time_End": 2718.0,
      "Text": " The problem is, if your name matches that of somebody who's on there, you might find yourself unable to do certain things."
    },
    {
      "Time_Start": 2718.0,
      "Time_End": 2727.0,
      "Text": " I also explain how the Interstate Identification Index works that the FBI maintains of criminal record information all over the country."
    },
    {
      "Time_Start": 2727.0,
      "Time_End": 2731.0,
      "Text": " How the instant background check when you buy a gun, how it actually works."
    },
    {
      "Time_Start": 2731.0,
      "Time_End": 2735.0,
      "Text": " That's part one of the book, and there's all sorts of databases that I explain."
    },
    {
      "Time_Start": 2735.0,
      "Time_End": 2744.0,
      "Text": " Part two, I set out a plan that you can enact to get your name and number removed out of as many of those databases as possible."
    },
    {
      "Time_Start": 2744.0,
      "Time_End": 2748.0,
      "Text": " And to lower your profile so that you can have privacy."
    },
    {
      "Time_Start": 2748.0,
      "Time_End": 2754.0,
      "Text": " Alright, look, I've gone on enough. Are there any questions?"
    },
    {
      "Time_Start": 2754.0,
      "Time_End": 2756.0,
      "Text": " Yeah, you."
    },
    {
      "Time_Start": 2756.0,
      "Time_End": 2759.0,
      "Text": " What can you do to prevent somebody from taking your profile?"
    },
    {
      "Time_Start": 2759.0,
      "Time_End": 2761.0,
      "Text": " What can you do to what?"
    },
    {
      "Time_Start": 2761.0,
      "Time_End": 2764.0,
      "Text": " To prevent it, buy this book."
    },
    {
      "Time_Start": 2764.0,
      "Time_End": 2766.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2766.0,
      "Time_End": 2770.0,
      "Text": " Buy my book, read it, and then take some of the steps."
    },
    {
      "Time_Start": 2770.0,
      "Time_End": 2774.0,
      "Text": " For example, one step is, don't write personal checks at merchants anymore."
    },
    {
      "Time_Start": 2774.0,
      "Time_End": 2781.0,
      "Text": " Every time you write a personal check, places like Telecheck and check systems, they don't just verify that your check is okay."
    },
    {
      "Time_Start": 2781.0,
      "Time_End": 2783.0,
      "Text": " That you're not part of the bad database."
    },
    {
      "Time_Start": 2783.0,
      "Time_End": 2785.0,
      "Text": " You know what those guys do? They say, hey, wait a minute."
    },
    {
      "Time_Start": 2785.0,
      "Time_End": 2788.0,
      "Text": " And that's how they started doing this a few years ago."
    },
    {
      "Time_Start": 2788.0,
      "Time_End": 2790.0,
      "Text": " They say, wait a minute, this guy's writing a check, right?"
    },
    {
      "Time_Start": 2790.0,
      "Time_End": 2793.0,
      "Text": " He's showing his driver's license, so let's capture that data."
    },
    {
      "Time_Start": 2793.0,
      "Time_End": 2796.0,
      "Text": " Because now we've got his license number."
    },
    {
      "Time_Start": 2796.0,
      "Time_End": 2797.0,
      "Text": " It's expiration date."
    },
    {
      "Time_Start": 2797.0,
      "Time_End": 2798.0,
      "Text": " It's state of issue."
    },
    {
      "Time_Start": 2798.0,
      "Time_End": 2802.0,
      "Text": " His bank account number and where and how you spend your money."
    },
    {
      "Time_Start": 2802.0,
      "Time_End": 2808.0,
      "Text": " They take that data, it goes into their database, so then can resell that to marketing companies and credit card issuers."
    },
    {
      "Time_Start": 2808.0,
      "Time_End": 2813.0,
      "Text": " They can say, I know John K. Newman spends $300 a month at the porno store."
    },
    {
      "Time_Start": 2813.0,
      "Time_End": 2818.0,
      "Text": " All of a sudden, I'm wondering, I was wondering, why am I getting all of those brown envelopes in the mail?"
    },
    {
      "Time_Start": 2818.0,
      "Time_End": 2819.0,
      "Text": " Well, that's how."
    },
    {
      "Time_Start": 2819.0,
      "Time_End": 2821.0,
      "Text": " Because I paid for it by a check."
    },
    {
      "Time_Start": 2821.0,
      "Time_End": 2823.0,
      "Text": " Hey, Jerry Springer, he paid his hooker with a check."
    },
    {
      "Time_Start": 2823.0,
      "Time_End": 2824.0,
      "Text": " You know?"
    },
    {
      "Time_Start": 2824.0,
      "Time_End": 2827.0,
      "Text": " The point of it is, sure, that's what these companies do."
    },
    {
      "Time_Start": 2827.0,
      "Time_End": 2829.0,
      "Text": " So there's a way to lower your profile."
    },
    {
      "Time_Start": 2829.0,
      "Time_End": 2834.0,
      "Text": " It doesn't mean you've got to live like a hermit and eat wild nuts and berries and all that stuff."
    },
    {
      "Time_Start": 2834.0,
      "Time_End": 2835.0,
      "Text": " Not at all."
    },
    {
      "Time_Start": 2835.0,
      "Time_End": 2842.0,
      "Text": " There's simple, practical steps you can take that will give you back most of your personal privacy."
    },
    {
      "Time_Start": 2842.0,
      "Time_End": 2844.0,
      "Text": " And like I said, it doesn't mean live like a hermit."
    },
    {
      "Time_Start": 2844.0,
      "Time_End": 2845.0,
      "Text": " Sure, you."
    },
    {
      "Time_Start": 2845.0,
      "Time_End": 2850.0,
      "Text": " We were discussing your friend from England and the fact that he went to banks to open a bank account."
    },
    {
      "Time_Start": 2850.0,
      "Time_End": 2858.0,
      "Text": " How does he avoid being pinched by African fingerprints or whatever when that guy in California is inquiring?"
    },
    {
      "Time_Start": 2858.0,
      "Time_End": 2860.0,
      "Text": " So you're from the great state of California."
    },
    {
      "Time_Start": 2860.0,
      "Time_End": 2861.0,
      "Text": " Most places."
    },
    {
      "Time_Start": 2861.0,
      "Time_End": 2862.0,
      "Text": " We're calling."
    },
    {
      "Time_Start": 2862.0,
      "Time_End": 2863.0,
      "Text": " We're calling."
    },
    {
      "Time_Start": 2863.0,
      "Time_End": 2865.0,
      "Text": " The other thing is, look, you can open bank accounts over the internet."
    },
    {
      "Time_Start": 2865.0,
      "Time_End": 2868.0,
      "Text": " I recently opened a new bank account over the internet."
    },
    {
      "Time_Start": 2868.0,
      "Time_End": 2872.0,
      "Text": " And the thing is, you open it over the internet, they send you out your signature cards,"
    },
    {
      "Time_Start": 2873.0,
      "Time_End": 2875.0,
      "Text": " and then they send you out your ATM card and your checks."
    },
    {
      "Time_Start": 2875.0,
      "Time_End": 2877.0,
      "Text": " You can do that all over the internet."
    },
    {
      "Time_Start": 2877.0,
      "Time_End": 2878.0,
      "Text": " You."
    },
    {
      "Time_Start": 2882.0,
      "Time_End": 2884.0,
      "Text": " You know, that's overblown."
    },
    {
      "Time_Start": 2888.0,
      "Time_End": 2890.0,
      "Text": " He said, what about video surveillance at the bank?"
    },
    {
      "Time_Start": 2890.0,
      "Time_End": 2894.0,
      "Text": " I mean, the thing is, you can wear disguises, that kind of stuff."
    },
    {
      "Time_Start": 2894.0,
      "Time_End": 2899.0,
      "Text": " Or, the thing of it is, one shot at this guy, that's not going to be enough."
    },
    {
      "Time_Start": 2899.0,
      "Time_End": 2901.0,
      "Text": " And the thing is, look, you can grow a beard."
    },
    {
      "Time_Start": 2901.0,
      "Time_End": 2908.0,
      "Text": " If I grew a huge beard and cut my hair way down and lost 50 pounds, you wouldn't recognize me."
    },
    {
      "Time_Start": 2908.0,
      "Time_End": 2909.0,
      "Text": " Same thing here."
    },
    {
      "Time_Start": 2909.0,
      "Time_End": 2913.0,
      "Text": " Because the transaction that you're making is only for a short period of time."
    },
    {
      "Time_Start": 2913.0,
      "Time_End": 2915.0,
      "Text": " So those people end up running."
    },
    {
      "Time_Start": 2915.0,
      "Time_End": 2916.0,
      "Text": " You, ma'am."
    },
    {
      "Time_Start": 2920.0,
      "Time_End": 2921.0,
      "Text": " How what?"
    },
    {
      "Time_Start": 2923.0,
      "Time_End": 2925.0,
      "Text": " It's not as hard as you might think."
    },
    {
      "Time_Start": 2925.0,
      "Time_End": 2926.0,
      "Text": " In a lot of states."
    },
    {
      "Time_Start": 2928.0,
      "Time_End": 2933.0,
      "Text": " If you wanted to know how hard it is to get someone's mother's maiden name, because that's used as passwords on a lot of things."
    },
    {
      "Time_Start": 2933.0,
      "Time_End": 2935.0,
      "Text": " It's not as hard to get as you might think."
    },
    {
      "Time_Start": 2935.0,
      "Time_End": 2938.0,
      "Text": " For example, I talked about social engineering this guy."
    },
    {
      "Time_Start": 2938.0,
      "Time_End": 2939.0,
      "Text": " You can call him up."
    },
    {
      "Time_Start": 2939.0,
      "Time_End": 2948.0,
      "Text": " Because once you've got all of his information, you can call this guy up and say, look, as a password for your listing, can we have your mother's maiden name?"
    },
    {
      "Time_Start": 2948.0,
      "Time_End": 2950.0,
      "Text": " That way nobody else can make any changes to it."
    },
    {
      "Time_Start": 2950.0,
      "Time_End": 2954.0,
      "Text": " You'd be amazed at how most of the time people are diverted."
    },
    {
      "Time_Start": 2954.0,
      "Time_End": 2959.0,
      "Text": " In some states, birth certificates are still public records, like California."
    },
    {
      "Time_Start": 2959.0,
      "Time_End": 2964.0,
      "Text": " You order the long form of the birth certificate, you've got the person's mother's maiden name."
    },
    {
      "Time_Start": 2964.0,
      "Time_End": 2967.0,
      "Text": " Massachusetts is the same way."
    },
    {
      "Time_Start": 2967.0,
      "Time_End": 2968.0,
      "Text": " There are ways of getting it."
    },
    {
      "Time_Start": 2968.0,
      "Time_End": 2970.0,
      "Text": " It's not a secure password."
    },
    {
      "Time_Start": 2970.0,
      "Time_End": 2971.0,
      "Text": " That's one thing I say."
    },
    {
      "Time_Start": 2971.0,
      "Time_End": 2975.0,
      "Text": " Never use the last four digits of your SSN as a password."
    },
    {
      "Time_Start": 2975.0,
      "Time_End": 2978.0,
      "Text": " And never use your mother's maiden name as a password."
    },
    {
      "Time_Start": 2978.0,
      "Time_End": 2981.0,
      "Text": " Because both of those things can potentially be accessed."
    },
    {
      "Time_Start": 2981.0,
      "Time_End": 2982.0,
      "Text": " You."
    },
    {
      "Time_Start": 2984.0,
      "Time_End": 2991.0,
      "Text": " What countries do you think have taken the best steps so far to protect personal information privacy?"
    },
    {
      "Time_Start": 2991.0,
      "Time_End": 2998.0,
      "Text": " Okay, he's asking what countries in the world do I think have taken the best steps for protecting personal information privacy."
    },
    {
      "Time_Start": 2998.0,
      "Time_End": 3000.0,
      "Text": " Most definitely I would say the Netherlands."
    },
    {
      "Time_Start": 3000.0,
      "Time_End": 3002.0,
      "Text": " I would certainly say Sweden."
    },
    {
      "Time_Start": 3002.0,
      "Time_End": 3004.0,
      "Text": " And actually the EU as a whole."
    },
    {
      "Time_Start": 3004.0,
      "Time_End": 3007.0,
      "Text": " There's a debate now going on between the European Union and the United States."
    },
    {
      "Time_Start": 3007.0,
      "Time_End": 3012.0,
      "Text": " Because they're worried that our protection of personal privacy is so lax."
    },
    {
      "Time_Start": 3012.0,
      "Time_End": 3025.0,
      "Text": " As you've seen, that they are saying that we will not allow companies in the EU to do data exchange with American companies on personal information until you change the protection of personal data."
    },
    {
      "Time_Start": 3025.0,
      "Time_End": 3027.0,
      "Text": " So this is an ongoing debate."
    },
    {
      "Time_Start": 3034.0,
      "Time_End": 3040.0,
      "Text": " If you want it to disappear in a week, well first read my book Reborn in the USA."
    },
    {
      "Time_Start": 3040.0,
      "Time_End": 3042.0,
      "Text": " That will teach you what you need to know."
    },
    {
      "Time_Start": 3042.0,
      "Time_End": 3048.0,
      "Text": " Now, if you're disappearing because the feds are after you, you better read my book The Heavy Duty New Identity."
    },
    {
      "Time_Start": 3048.0,
      "Time_End": 3051.0,
      "Text": " If you read those two books, you'll be able to disappear in a week."
    },
    {
      "Time_Start": 3057.0,
      "Time_End": 3058.0,
      "Text": " You over there."
    },
    {
      "Time_Start": 3058.0,
      "Time_End": 3061.0,
      "Text": " I'm wondering if you've heard of a database called UD Registry."
    },
    {
      "Time_Start": 3061.0,
      "Time_End": 3063.0,
      "Text": " Unlawful Detainer Registry, yeah."
    },
    {
      "Time_Start": 3063.0,
      "Time_End": 3064.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3064.0,
      "Time_End": 3069.0,
      "Text": " This is one, and if he's asked have I heard of a database called UD Registry."
    },
    {
      "Time_Start": 3069.0,
      "Time_End": 3076.0,
      "Text": " Landlords are trying to compile as much data about potential tenants as they can."
    },
    {
      "Time_Start": 3076.0,
      "Time_End": 3080.0,
      "Text": " There's a new registry called UD Registry, which stands for Unlawful Detainer."
    },
    {
      "Time_Start": 3080.0,
      "Time_End": 3090.0,
      "Text": " When it actually gets to the point where you stay with your partner, you haven't paid rent, and the landlord goes and files the eviction papers, that's known as an unlawful detainer at that point."
    },
    {
      "Time_Start": 3090.0,
      "Time_End": 3094.0,
      "Text": " There is now a company that's compiled a database of all of these."
    },
    {
      "Time_Start": 3094.0,
      "Time_End": 3096.0,
      "Text": " But you think that's bad."
    },
    {
      "Time_Start": 3096.0,
      "Time_End": 3101.0,
      "Text": " But you know there's one company called Avert, and they're not the only one, that landlords use."
    },
    {
      "Time_Start": 3101.0,
      "Time_End": 3105.0,
      "Text": " And I mention this in my book How to Investigate Your Friends, Enemies, and Lovers."
    },
    {
      "Time_Start": 3105.0,
      "Time_End": 3113.0,
      "Text": " But they will also check a potential future tenant if there's any criminal history on them, and if there's any wants and warrants on them."
    },
    {
      "Time_Start": 3113.0,
      "Time_End": 3123.0,
      "Text": " Now I ask you, when did landlords get the right to check to see if you have some criminal conviction ten years ago, and to see if you're a wanted person?"
    },
    {
      "Time_Start": 3123.0,
      "Time_End": 3125.0,
      "Text": " I mean where do we draw the line?"
    },
    {
      "Time_Start": 3125.0,
      "Time_End": 3128.0,
      "Text": " The landlord would say, oh, we're just doing it to make our community safe."
    },
    {
      "Time_Start": 3128.0,
      "Time_End": 3133.0,
      "Text": " But at that point you could say at some point, well, you're going to have to give fingerprints and a DNA sample."
    },
    {
      "Time_Start": 3133.0,
      "Time_End": 3135.0,
      "Text": " I mean where do you draw the line?"
    },
    {
      "Time_Start": 3135.0,
      "Time_End": 3139.0,
      "Text": " You see this is a problem that I call security via database."
    },
    {
      "Time_Start": 3139.0,
      "Time_End": 3152.0,
      "Text": " We're trying to eliminate threats to us as a society by saying all we have to do is keep creating more and more databases that contain the names of more and more people that we consider undesirable."
    },
    {
      "Time_Start": 3152.0,
      "Time_End": 3156.0,
      "Text": " So we make a database of pedophiles, which is probably a good thing to do."
    },
    {
      "Time_Start": 3156.0,
      "Time_End": 3161.0,
      "Text": " Then we make a database, I don't know, of people whose noses are too big, or people who do whatever."
    },
    {
      "Time_Start": 3161.0,
      "Time_End": 3169.0,
      "Text": " But before you know it, you can have a hundred databases that everybody has to clear before you can rent a car, rent an apartment, whatever."
    },
    {
      "Time_Start": 3169.0,
      "Time_End": 3172.0,
      "Text": " The question is, where do you draw the line?"
    },
    {
      "Time_Start": 3172.0,
      "Time_End": 3181.0,
      "Text": " Because if we are not careful, it is conceivable that 50 years from now to rent an apartment, you may have to give fingerprints and a DNA sample."
    },
    {
      "Time_Start": 3181.0,
      "Time_End": 3194.0,
      "Text": " Who would have thought to rent an apartment in 1999 that they would check you through three credit bureaus, check to see if you have a criminal record, check to see if you're a wanted person, and check to see if you've ever skipped out on rent somewhere else?"
    },
    {
      "Time_Start": 3194.0,
      "Time_End": 3197.0,
      "Text": " 30 years ago, you would have said, well, that's crazy."
    },
    {
      "Time_Start": 3197.0,
      "Time_End": 3200.0,
      "Text": " But we're here with no public debate."
    },
    {
      "Time_Start": 3200.0,
      "Time_End": 3202.0,
      "Text": " That's the question that I raise."
    },
    {
      "Time_Start": 3202.0,
      "Time_End": 3204.0,
      "Text": " Who said we can do this?"
    },
    {
      "Time_Start": 3204.0,
      "Time_End": 3206.0,
      "Text": " You in the back there."
    },
    {
      "Time_Start": 3206.0,
      "Time_End": 3229.0,
      "Text": " Okay, let me say what this man said."
    },
    {
      "Time_Start": 3229.0,
      "Time_End": 3231.0,
      "Text": " He applied for insurance lately."
    },
    {
      "Time_Start": 3231.0,
      "Time_End": 3238.0,
      "Text": " Years ago, insurance companies are another big user of the SSN, because many insurance companies access your credit history."
    },
    {
      "Time_Start": 3238.0,
      "Time_End": 3241.0,
      "Text": " Why? I don't know, because insurance is not a credit contract."
    },
    {
      "Time_Start": 3241.0,
      "Time_End": 3247.0,
      "Text": " He asked a guy if he could not disclose his SSN or use a different number."
    },
    {
      "Time_Start": 3247.0,
      "Time_End": 3251.0,
      "Text": " The man told him, oh no, it's a felony if you don't disclose it."
    },
    {
      "Time_Start": 3251.0,
      "Time_End": 3253.0,
      "Text": " That is pure bullshit, my friend."
    },
    {
      "Time_Start": 3253.0,
      "Time_End": 3260.0,
      "Text": " Nothing under federal law says you must give a private company your SSN."
    },
    {
      "Time_Start": 3260.0,
      "Time_End": 3263.0,
      "Text": " You cannot be prosecuted for not providing it."
    },
    {
      "Time_Start": 3263.0,
      "Time_End": 3269.0,
      "Text": " Now, as far as being prosecuted for providing another number, that's a gray area."
    },
    {
      "Time_Start": 3269.0,
      "Time_End": 3273.0,
      "Text": " It's simply a mistake, and maybe your hand just slipped."
    },
    {
      "Time_Start": 3274.0,
      "Time_End": 3283.0,
      "Text": " Nobody can say that you are purposefully appropriating somebody else's social security number to get a benefit."
    },
    {
      "Time_Start": 3283.0,
      "Time_End": 3292.0,
      "Text": " As a practical matter, very few people have ever been prosecuted for the fact that they got insurance but used a different SS number to get it."
    },
    {
      "Time_Start": 3292.0,
      "Time_End": 3294.0,
      "Text": " I would not worry about it."
    },
    {
      "Time_Start": 3294.0,
      "Time_End": 3301.0,
      "Text": " In fact, if you read some of my books, I tell you how you can make up SS numbers that are potentially valid,"
    },
    {
      "Time_Start": 3301.0,
      "Time_End": 3309.0,
      "Text": " but either have not, or if they have been issued, they belong to infants right now who aren't in any insurance or credit system."
    },
    {
      "Time_Start": 3309.0,
      "Time_End": 3311.0,
      "Text": " I talk about that."
    },
    {
      "Time_Start": 3311.0,
      "Time_End": 3315.0,
      "Text": " I don't recommend that you do it, but you have to take steps for your privacy."
    },
    {
      "Time_Start": 3316.0,
      "Time_End": 3317.0,
      "Text": " You."
    },
    {
      "Time_Start": 3336.0,
      "Time_End": 3338.0,
      "Text": " Oh, I think it's definitely possible."
    },
    {
      "Time_Start": 3338.0,
      "Time_End": 3339.0,
      "Text": " So the problem is..."
    },
    {
      "Time_Start": 3339.0,
      "Time_End": 3345.0,
      "Text": " It's a possibility."
    },
    {
      "Time_Start": 3345.0,
      "Time_End": 3348.0,
      "Text": " I mean, nobody can say how rapidly technology..."
    },
    {
      "Time_Start": 3348.0,
      "Time_End": 3359.0,
      "Text": " Oh, he's asking if it's possible instead of 50 years, maybe 10 or 20 years, that by using urine samples or blood samples, that's what we provide to establish identity."
    },
    {
      "Time_Start": 3359.0,
      "Time_End": 3360.0,
      "Text": " And certainly it's possible."
    },
    {
      "Time_Start": 3360.0,
      "Time_End": 3366.0,
      "Text": " You see, these things seem like they're not feasible, but because they're done in gradual steps."
    },
    {
      "Time_Start": 3366.0,
      "Time_End": 3375.0,
      "Text": " For example, the police chief in New York City, he said if he could, he would take DNA samples from anyone arrested for anything."
    },
    {
      "Time_Start": 3375.0,
      "Time_End": 3381.0,
      "Text": " And he feels that all people should have their DNA samples entered into a data bank."
    },
    {
      "Time_Start": 3381.0,
      "Time_End": 3385.0,
      "Text": " Now, the problem is with small incremental steps."
    },
    {
      "Time_Start": 3385.0,
      "Time_End": 3389.0,
      "Text": " First we say, we only take the DNA of sex offenders."
    },
    {
      "Time_Start": 3389.0,
      "Time_End": 3395.0,
      "Text": " Because you can say there's a useful reason for this because of the nature of the evidence."
    },
    {
      "Time_Start": 3395.0,
      "Time_End": 3401.0,
      "Text": " Then you go a little bit further and say, well, not just sex offenders, but anybody who does a violent felony."
    },
    {
      "Time_Start": 3401.0,
      "Time_End": 3406.0,
      "Text": " Then maybe you move the bar a little further and say, not just a violent felony, but any violent crime."
    },
    {
      "Time_Start": 3406.0,
      "Time_End": 3411.0,
      "Text": " You see, all of a sudden, before you know it, everybody who's arrested is given a DNA sample."
    },
    {
      "Time_Start": 3414.0,
      "Time_End": 3419.0,
      "Text": " Yeah, that's one of the proposals, is that he says everybody who's born should have to provide a DNA sample."
    },
    {
      "Time_Start": 3419.0,
      "Time_End": 3420.0,
      "Text": " You."
    },
    {
      "Time_Start": 3425.0,
      "Time_End": 3426.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3429.0,
      "Time_End": 3430.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3436.0,
      "Time_End": 3437.0,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3438.0,
      "Time_End": 3445.0,
      "Text": " Well, because at first, for example, when they look for child-support scofflaws, at first they want to match name and SSN."
    },
    {
      "Time_Start": 3445.0,
      "Time_End": 3449.0,
      "Text": " If they don't match those two, then they look for name and birthdate."
    },
    {
      "Time_Start": 3449.0,
      "Time_End": 3452.0,
      "Text": " And that's how a lot of people can get falsely tagged."
    },
    {
      "Time_Start": 3452.0,
      "Time_End": 3456.0,
      "Text": " Or if somebody else either writes their SS number down wrong."
    },
    {
      "Time_Start": 3456.0,
      "Time_End": 3462.0,
      "Text": " Or, for example, with my SS number, three different women decided they would start using it."
    },
    {
      "Time_Start": 3462.0,
      "Time_End": 3466.0,
      "Text": " A woman in California, in Fonterra, California, she uses it."
    },
    {
      "Time_Start": 3466.0,
      "Time_End": 3469.0,
      "Text": " Because when I pulled my TRW, there she is."
    },
    {
      "Time_Start": 3469.0,
      "Time_End": 3472.0,
      "Text": " And two women in Colorado are also using it."
    },
    {
      "Time_Start": 3472.0,
      "Time_End": 3474.0,
      "Text": " So I had to get a new SS number."
    },
    {
      "Time_Start": 3474.0,
      "Time_End": 3478.0,
      "Text": " Because once somebody else has started appropriating it, there's not much you can do."
    },
    {
      "Time_Start": 3479.0,
      "Time_End": 3482.0,
      "Text": " All right, hey, look."
    },
    {
      "Time_Start": 3482.0,
      "Time_End": 3483.0,
      "Text": " Time is up, but listen."
    },
    {
      "Time_Start": 3483.0,
      "Time_End": 3486.0,
      "Text": " I'm going to be at the Limpanics table when this is over."
    },
    {
      "Time_Start": 3486.0,
      "Time_End": 3487.0,
      "Text": " Two things."
    },
    {
      "Time_Start": 3487.0,
      "Time_End": 3490.0,
      "Text": " Big Brother's secret databases will be out in the fall."
    },
    {
      "Time_Start": 3490.0,
      "Time_End": 3493.0,
      "Text": " I have a website, privacypower.com."
    },
    {
      "Time_Start": 3493.0,
      "Time_End": 3497.0,
      "Text": " I have business cards I'm giving away out there and a flyer about the site."
    },
    {
      "Time_Start": 3497.0,
      "Time_End": 3502.0,
      "Text": " I provide consulting if you're interested in topics covered in more detail."
    },
    {
      "Time_Start": 3502.0,
      "Time_End": 3506.0,
      "Text": " I urge you to please patronize the Limpanics table."
    },
    {
      "Time_Start": 3507.0,
      "Time_End": 3511.0,
      "Text": " And once again, if you're in the market for a fake ID, I'll tell you."
    },
    {
      "Time_Start": 3511.0,
      "Time_End": 3513.0,
      "Text": " This is the very best out here."
    },
    {
      "Time_Start": 3513.0,
      "Time_End": 3515.0,
      "Text": " You can get instant satisfaction."
    },
    {
      "Time_Start": 3515.0,
      "Time_End": 3519.0,
      "Text": " And like I said, you can use this for a lot of purposes, not just this."
    },
    {
      "Time_Start": 3519.0,
      "Time_End": 3522.0,
      "Text": " So if you're looking for one, and maybe you want a little privacy."
    },
    {
      "Time_Start": 3522.0,
      "Time_End": 3530.0,
      "Text": " Maybe you want a second identity or a second ID just to have something to show that's not your real name and birthday."
    },
    {
      "Time_Start": 3530.0,
      "Time_End": 3532.0,
      "Text": " Maybe you want to get a second bank account or something."
    },
    {
      "Time_Start": 3532.0,
      "Time_End": 3533.0,
      "Text": " Well, here's a way to do it."
    },
    {
      "Time_Start": 3533.0,
      "Time_End": 3535.0,
      "Text": " Right here, this guy's for real."
    },
    {
      "Time_Start": 3535.0,
      "Time_End": 3536.0,
      "Text": " He's legit."
    },
    {
      "Time_Start": 3536.0,
      "Time_End": 3538.0,
      "Text": " Unfortunately, he's leaving tomorrow."
    },
    {
      "Time_Start": 3538.0,
      "Time_End": 3540.0,
      "Text": " So if you want one, you need to go get one today."
    },
    {
      "Time_Start": 3540.0,
      "Time_End": 3546.0,
      "Text": " If Limpanics is always looking for new writers, go to the Limpanics.com website."
    },
    {
      "Time_Start": 3546.0,
      "Time_End": 3549.0,
      "Text": " It will tell you the submission guidelines."
    },
    {
      "Time_Start": 3549.0,
      "Time_End": 3551.0,
      "Text": " We work with the written word."
    },
    {
      "Time_Start": 3551.0,
      "Time_End": 3552.0,
      "Text": " Go to the website."
    },
    {
      "Time_Start": 3552.0,
      "Time_End": 3553.0,
      "Text": " Put together your proposal."
    },
    {
      "Time_Start": 3553.0,
      "Time_End": 3554.0,
      "Text": " Send it in."
    },
    {
      "Time_Start": 3554.0,
      "Time_End": 3556.0,
      "Text": " If they're interested, they'll get back to you."
    },
    {
      "Time_Start": 3556.0,
      "Time_End": 3557.0,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 3557.0,
      "Time_End": 3559.0,
      "Text": " I'll be at the Limpanics table."
    }
  ]
}