{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 16.22,
      "Text": "This text was transcribed using whisper model: large-v2\n\n It was okay being able to set a private password, which, of course, can be bypassed. It was"
    },
    {
      "Time_Start": 16.22,
      "Time_End": 20.8,
      "Text": " okay not to offer encryption in the memo pad, not to put a password on any of your memos."
    },
    {
      "Time_Start": 20.8,
      "Time_End": 25.2,
      "Text": " They really haven't changed things, so a lot of third‑party applications have come about"
    },
    {
      "Time_Start": 25.2,
      "Time_End": 29.759999999999998,
      "Text": " that allow you to encrypt and set your Palm Pilot so it's more secure."
    },
    {
      "Time_Start": 29.759999999999998,
      "Time_End": 36.56,
      "Text": " For the last three years, different groups have not changed the security of the Palm"
    },
    {
      "Time_Start": 36.56,
      "Time_End": 43.120000000000005,
      "Text": " Pilots, but have kind of brought the software to a different audience of people, maybe including"
    },
    {
      "Time_Start": 43.120000000000005,
      "Time_End": 47.4,
      "Text": " you guys, and the first thing I've asked when I've given this talk before, talked to people"
    },
    {
      "Time_Start": 47.4,
      "Time_End": 52.64,
      "Text": " before, is if you guys have your beam, your infrared beam set to on, does everyone have"
    },
    {
      "Time_Start": 52.64,
      "Time_End": 58.4,
      "Text": " it set to on by default or is it off? Okay. Let's check real quickly right now."
    },
    {
      "Time_Start": 58.4,
      "Time_End": 64.08,
      "Text": " So you go into your Palm Pilot and go into preferences, and inside preferences in the"
    },
    {
      "Time_Start": 64.08,
      "Time_End": 69.36,
      "Text": " general preferences, you'll find at the bottom it says your beam received is either on or"
    },
    {
      "Time_Start": 69.36,
      "Time_End": 73.68,
      "Text": " off. I always leave mine set to off, which kind"
    },
    {
      "Time_Start": 73.68,
      "Time_End": 76.88,
      "Text": " of sounds antisocial to a lot of people because it means I don't get all the little business"
    },
    {
      "Time_Start": 76.88,
      "Time_End": 82.0,
      "Text": " cards, you know, and the little programs. I've got six different memo pad sketching"
    },
    {
      "Time_Start": 82.0,
      "Time_End": 86.92,
      "Text": " programs, things like that. I recommend turning it to off, and that's kind of the first step"
    },
    {
      "Time_Start": 86.92,
      "Time_End": 93.4,
      "Text": " because that's an automatic way for people to be able to send you applications."
    },
    {
      "Time_Start": 93.4,
      "Time_End": 98.28,
      "Text": " Most of you are saying, oh, well, when they send me the application right now, I get to"
    },
    {
      "Time_Start": 98.28,
      "Time_End": 103.24000000000001,
      "Text": " choose whether or not I want to use it. Well, if anyone sat through any of the other"
    },
    {
      "Time_Start": 103.24000000000001,
      "Time_End": 108.48,
      "Text": " talks, people know about buffer overflows and how you can send commands to the TCP IP"
    },
    {
      "Time_Start": 108.48,
      "Time_End": 111.52000000000001,
      "Text": " stack, and then maybe it fails but it actually executes the command."
    },
    {
      "Time_Start": 111.52000000000001,
      "Time_End": 114.60000000000001,
      "Text": " We're going to go into it later. I'm going to show you guys the schematic"
    },
    {
      "Time_Start": 114.60000000000001,
      "Time_End": 118.72,
      "Text": " and how it works, but the infrared channel is just a TCP IP stack."
    },
    {
      "Time_Start": 118.72,
      "Time_End": 125.72,
      "Text": " It's just as acceptable to buffer overflows, just as acceptable to sending information,"
    },
    {
      "Time_Start": 125.72,
      "Time_End": 129.8,
      "Text": " and it's only probably a week or two weeks before someone realizes that you can reset"
    },
    {
      "Time_Start": 129.8,
      "Time_End": 135.32,
      "Text": " one bit and get people to automatically accept an application via infrared."
    },
    {
      "Time_Start": 135.32,
      "Time_End": 139.4,
      "Text": " So what I'm going to talk about today is an educational talk."
    },
    {
      "Time_Start": 139.4,
      "Time_End": 142.51999999999998,
      "Text": " That's always the disclaimer at the beginning of it."
    },
    {
      "Time_Start": 142.51999999999998,
      "Time_End": 146.35999999999999,
      "Text": " I want you guys to know that as we step through it towards the end of the class, we're going"
    },
    {
      "Time_Start": 146.35999999999999,
      "Time_End": 152.95999999999998,
      "Text": " to be looking at some code from a commercial application, and I only show you this so you"
    },
    {
      "Time_Start": 152.95999999999998,
      "Time_End": 156.12,
      "Text": " can kind of understand a little bit of the background about the differences between the"
    },
    {
      "Time_Start": 156.12,
      "Time_End": 161.72,
      "Text": " way PalmPilot executes a program and works and the way a Windows program, for example,"
    },
    {
      "Time_Start": 161.72,
      "Time_End": 166.8,
      "Text": " works or a Linux program. With 6 million users, like I mentioned before,"
    },
    {
      "Time_Start": 166.8,
      "Time_End": 172.28,
      "Text": " most people say, why would you exploit? Why would you even try to protect your PalmPilot?"
    },
    {
      "Time_Start": 172.28,
      "Time_End": 175.84,
      "Text": " I know you guys out there have your phone numbers in it, and we're thinking that if"
    },
    {
      "Time_Start": 175.84,
      "Time_End": 179.6,
      "Text": " people get a list of your phone numbers, that's not going to be that big of a deal."
    },
    {
      "Time_Start": 179.6,
      "Time_End": 184.4,
      "Text": " Well, maybe that won't be that big of a deal, that they can know who your friends are, know"
    },
    {
      "Time_Start": 184.4,
      "Time_End": 189.4,
      "Text": " whom the people are that you associate with. But what about those passwords that you might"
    },
    {
      "Time_Start": 189.4,
      "Time_End": 194.52,
      "Text": " have stored in that memo pad file that's marked private, for example?"
    },
    {
      "Time_Start": 194.52,
      "Time_End": 198.32,
      "Text": " Anyone can sit a PalmPilot down if they have a hot sink cradle and you can go get one for"
    },
    {
      "Time_Start": 198.32,
      "Time_End": 203.72,
      "Text": " $19 from good guys, put it in their computer in a hot sink, then your information is on"
    },
    {
      "Time_Start": 203.72,
      "Time_End": 209.52,
      "Text": " their computer. That's it. There's no password. There's nothing you can do. That information"
    },
    {
      "Time_Start": 209.52,
      "Time_End": 214.64000000000001,
      "Text": " is completely public inside of your application and where the PalmPilot stores its databases."
    },
    {
      "Time_Start": 214.88000000000002,
      "Time_End": 221.4,
      "Text": " There are different input output options for the Palm. With the 3X and above, you have"
    },
    {
      "Time_Start": 221.4,
      "Time_End": 224.16000000000003,
      "Text": " the infrared port. We're going to go over that. We're going to go over the hot sink"
    },
    {
      "Time_Start": 224.16000000000003,
      "Time_End": 229.92000000000002,
      "Text": " port, which is really just a serial port, a DB9 port. And also, we're going to go over"
    },
    {
      "Time_Start": 229.92000000000002,
      "Time_End": 235.64000000000001,
      "Text": " some techniques that we can use to actually go and look inside and look how your PalmPilot"
    },
    {
      "Time_Start": 235.64000000000001,
      "Time_End": 241.4,
      "Text": " protects your information. This is Palm Data Security, not Windows 2000, also, if anyone's"
    },
    {
      "Time_Start": 241.4,
      "Time_End": 248.4,
      "Text": " in here for that adventure. Why exploit and protect PalmPilots? Exploit PalmPilots because"
    },
    {
      "Time_Start": 250.0,
      "Time_End": 256.08,
      "Text": " Palm users still have a false sense of security and because of the device simplicity. According"
    },
    {
      "Time_Start": 256.08,
      "Time_End": 261.72,
      "Text": " to Palm, for the first 600,000 users, those are the people that were adopters of the Newton."
    },
    {
      "Time_Start": 261.72,
      "Time_End": 268.08,
      "Text": " People who actually used old devices that offered handwriting recognition, let you store"
    },
    {
      "Time_Start": 268.12,
      "Time_End": 273.59999999999997,
      "Text": " your information, let you use a keyboard with it, these things. So we're the experts, maybe,"
    },
    {
      "Time_Start": 273.59999999999997,
      "Time_End": 279.28,
      "Text": " among the PDA category. Now, with Microsoft moving into it with Windows CE, of course,"
    },
    {
      "Time_Start": 279.28,
      "Time_End": 283.59999999999997,
      "Text": " there's a lot of different competitors for it, but the PalmPilot still outsells the CE"
    },
    {
      "Time_Start": 283.59999999999997,
      "Time_End": 290.59999999999997,
      "Text": " machine by, I think the last factor is 6 to 1. So this is the predominant platform. And"
    },
    {
      "Time_Start": 291.91999999999996,
      "Time_End": 296.88,
      "Text": " because of that, you have people using it like the person I saw at Best Buy the other"
    },
    {
      "Time_Start": 296.88,
      "Time_End": 301.68,
      "Text": " day who walked in and said, oh, can I get a Palm? And the guy's like, yeah, you want"
    },
    {
      "Time_Start": 301.68,
      "Time_End": 306.56,
      "Text": " to go ahead and get the 5XE? And he's thinking commission on the side. You know, he's thinking,"
    },
    {
      "Time_Start": 306.56,
      "Time_End": 310.24,
      "Text": " go ahead and get the 5XE. And they go, oh, that's great. I'm going to store in there"
    },
    {
      "Time_Start": 310.24,
      "Time_End": 315.88,
      "Text": " all my birthdays. I'm going to store in there all my important numbers. And I'm thinking,"
    },
    {
      "Time_Start": 315.88,
      "Time_End": 320.44,
      "Text": " wow, you're taking this around with you everywhere. So you've got all your important information"
    },
    {
      "Time_Start": 320.44,
      "Time_End": 324.32,
      "Text": " with you right there in your pocket. And the one time that you leave it sitting there in"
    },
    {
      "Time_Start": 324.32,
      "Time_End": 328.36,
      "Text": " the restaurant and that person goes and they know your maiden name because you have your"
    },
    {
      "Time_Start": 328.36,
      "Time_End": 333.48,
      "Text": " mom's name in there. So they know all your information. Also going to exploit it because"
    },
    {
      "Time_Start": 333.48,
      "Time_End": 340.24,
      "Text": " the developers don't put time into their protection. This is a really sensitive area. The PalmPilot"
    },
    {
      "Time_Start": 340.24,
      "Time_End": 347.03999999999996,
      "Text": " community has, at last count, over 70,000 developers of applications. That's people"
    },
    {
      "Time_Start": 347.03999999999996,
      "Time_End": 352.8,
      "Text": " all over the world. It's a really simple platform to write for. It's a really transparent platform"
    },
    {
      "Time_Start": 352.8,
      "Time_End": 359.8,
      "Text": " to write for. It's kind of like a whole language developed around forms. It's kind of like"
    },
    {
      "Time_Start": 360.68,
      "Time_End": 365.24,
      "Text": " HTML forms in its most basic sense. And because of that, everyone develops with it. You can"
    },
    {
      "Time_Start": 365.24,
      "Time_End": 371.04,
      "Text": " get free development kits. You can get Darren Messina's free alternative development kit."
    },
    {
      "Time_Start": 371.04,
      "Time_End": 377.44,
      "Text": " You can get a lot of information on 3Com's website about the software. One particular"
    },
    {
      "Time_Start": 377.44,
      "Time_End": 381.16,
      "Text": " example that I always cite is there's this company named Standalone. I don't know if"
    },
    {
      "Time_Start": 381.16,
      "Time_End": 386.28000000000003,
      "Text": " anyone has super names on their computer. You know, they have Workout Tracker or Casino."
    },
    {
      "Time_Start": 386.28000000000003,
      "Time_End": 391.8,
      "Text": " This company, Standalone, makes good applications and they made three of them. And then they"
    },
    {
      "Time_Start": 391.8,
      "Time_End": 396.64000000000004,
      "Text": " decided that they were going to go buy other people's applications and bring them in under"
    },
    {
      "Time_Start": 396.64000000000004,
      "Time_End": 401.32000000000005,
      "Text": " the Standalone banner. Well, people really like super names because it takes your address"
    },
    {
      "Time_Start": 401.32000000000005,
      "Time_End": 405.64000000000004,
      "Text": " book and it organizes it into tabs and you can set up different groups and you can set"
    },
    {
      "Time_Start": 405.64,
      "Time_End": 412.4,
      "Text": " up different things. Well, the program costs $20. And as we know, just like Linux and everything"
    },
    {
      "Time_Start": 412.4,
      "Time_End": 418.47999999999996,
      "Text": " else, people want free. People want free software. And because 75% of the PalmPilot software"
    },
    {
      "Time_Start": 418.47999999999996,
      "Time_End": 424.44,
      "Text": " is free and only 25% of it is commercial applications, this eventually found its way to someone who"
    },
    {
      "Time_Start": 424.44,
      "Time_End": 429.68,
      "Text": " wanted to look inside of it and make super names free. Well, Standalone became really"
    },
    {
      "Time_Start": 429.68,
      "Time_End": 434.24,
      "Text": " upset at the whole developers community and they threatened to pull all of their applications"
    },
    {
      "Time_Start": 434.24,
      "Time_End": 439.32,
      "Text": " at this issue. What they didn't tell you is their protection inside of the application"
    },
    {
      "Time_Start": 439.32,
      "Time_End": 446.40000000000003,
      "Text": " was as simple as check register key. It says that in the middle of their code, check register"
    },
    {
      "Time_Start": 446.40000000000003,
      "Time_End": 452.36,
      "Text": " key. They made no reasonable effort to protect their application. They took it for granted"
    },
    {
      "Time_Start": 452.36,
      "Time_End": 458.44,
      "Text": " that everyone was a simple user or that everyone didn't want a level of protection. Well, unfortunately,"
    },
    {
      "Time_Start": 458.44,
      "Time_End": 462.96000000000004,
      "Text": " we store all of our names inside super names. So they also have a section that's marked"
    },
    {
      "Time_Start": 462.96000000000004,
      "Time_End": 468.52000000000004,
      "Text": " check password. And you can patch one byte of that password and you hot sync and you"
    },
    {
      "Time_Start": 468.52000000000004,
      "Time_End": 472.48,
      "Text": " replace the version of super names that's in your computer and you can view every single"
    },
    {
      "Time_Start": 472.48,
      "Time_End": 478.44000000000005,
      "Text": " private record in the program. They made no reasonable effort to try to protect it."
    },
    {
      "Time_Start": 478.44000000000005,
      "Time_End": 481.64000000000004,
      "Text": " The last part is we have to protect our own PalmPilots. It's not going to seem like a"
    },
    {
      "Time_Start": 481.64000000000004,
      "Time_End": 487.00000000000006,
      "Text": " big deal yet, maybe. Maybe everyone has gotten that application that turns all your PalmPilot"
    },
    {
      "Time_Start": 487.00000000000006,
      "Time_End": 492.76000000000005,
      "Text": " characters set into elite characters, fills it with the Es and the 3s and the 4s. That's"
    },
    {
      "Time_Start": 492.76,
      "Time_End": 501.68,
      "Text": " probably the first example of someone taking advantage of the simplicity of the Palm platform."
    },
    {
      "Time_Start": 501.68,
      "Time_End": 505.96,
      "Text": " So I think it's important to understand that in addition to exploiting it, one of the main"
    },
    {
      "Time_Start": 505.96,
      "Time_End": 510.52,
      "Text": " goals is to try to get people to protect their applications. Has anyone in here played or"
    },
    {
      "Time_Start": 510.52,
      "Time_End": 516.4399999999999,
      "Text": " seen the Game Boy emulator Liberty for the PalmPilot? Okay. That's an example of an application"
    },
    {
      "Time_Start": 516.44,
      "Time_End": 521.1600000000001,
      "Text": " that's protected very heavily. We're going to go into that later with respect to the"
    },
    {
      "Time_Start": 521.1600000000001,
      "Time_End": 528.5600000000001,
      "Text": " author. We're going to go into that later, but I'm also going to talk about how there"
    },
    {
      "Time_Start": 528.5600000000001,
      "Time_End": 532.7600000000001,
      "Text": " needs to be a balance between the protection that you use on a PalmPilot and the simplicity"
    },
    {
      "Time_Start": 532.7600000000001,
      "Time_End": 540.2,
      "Text": " we expect from the applications that we use."
    },
    {
      "Time_Start": 540.2,
      "Time_End": 546.72,
      "Text": " Your PalmPilot serial port here is a lot like your computer serial port. It's 3.3 volts,"
    },
    {
      "Time_Start": 546.72,
      "Time_End": 553.72,
      "Text": " it's low power, it's DB9, standard RS232. This presentation will be available online"
    },
    {
      "Time_Start": 554.24,
      "Time_End": 559.36,
      "Text": " by the way, but you can see a link here. This is a really great technical link on the layout"
    },
    {
      "Time_Start": 559.36,
      "Time_End": 564.44,
      "Text": " of the PalmPilot. I know it might be hard to see from the back there, but basically"
    },
    {
      "Time_Start": 564.44,
      "Time_End": 568.1600000000001,
      "Text": " you have one pin that's responsible for hot syncing, and actually that will turn on the"
    },
    {
      "Time_Start": 568.16,
      "Time_End": 573.12,
      "Text": " device too. So when you make external devices, like I don't know if anyone has the PalmPilot"
    },
    {
      "Time_Start": 573.12,
      "Time_End": 580.12,
      "Text": " foldable keyboard here or the Go type, that's what they do. They send a signal to pin 4,"
    },
    {
      "Time_Start": 580.6999999999999,
      "Time_End": 584.92,
      "Text": " they turn on your PalmPilot and it's ready to go. Once you're in the hot sync, once you"
    },
    {
      "Time_Start": 584.92,
      "Time_End": 591.1999999999999,
      "Text": " have it on and once you have it in a cradle or any kind of DB9 RS232 device, it can completely"
    },
    {
      "Time_Start": 591.24,
      "Time_End": 598.24,
      "Text": " control your PalmPilot. It can reset it, which it can use by sending an on-off to pin 7,"
    },
    {
      "Time_Start": 599.2800000000001,
      "Time_End": 603.84,
      "Text": " and they can also transfer information back, and they have three different methods to do"
    },
    {
      "Time_Start": 603.84,
      "Time_End": 608.72,
      "Text": " it. They can do it with standard PalmPilot hot syncing, you can do it with a direct data"
    },
    {
      "Time_Start": 608.72,
      "Time_End": 613.36,
      "Text": " stream to the PalmPilot and to the computer, or you can do it with a custom conduit and"
    },
    {
      "Time_Start": 613.36,
      "Time_End": 620.36,
      "Text": " we'll go a little bit into that. The second option you have is an IRC port, and this is"
    },
    {
      "Time_Start": 621.24,
      "Time_End": 628.24,
      "Text": " our DA port. It uses a modified TCP IP stack. It reacts to many common TCP IP commands,"
    },
    {
      "Time_Start": 629.88,
      "Time_End": 636.88,
      "Text": " you can set up sessions, you can set up streams of information, it uses a standard TCP IP header,"
    },
    {
      "Time_Start": 637.44,
      "Time_End": 643.32,
      "Text": " and it lets you communicate very effectively. Of course your beam bit must be set to on,"
    },
    {
      "Time_Start": 643.32,
      "Time_End": 649.84,
      "Text": " which is a lock on your PalmPilot. What 3Com didn't plan for, and this is another example"
    },
    {
      "Time_Start": 649.84,
      "Time_End": 654.52,
      "Text": " of how, as the platform grew, they didn't enhance the security of the PalmPilot, is"
    },
    {
      "Time_Start": 654.52,
      "Time_End": 661.52,
      "Text": " that, again, it's one single byte inside of your application that's on or off that allows"
    },
    {
      "Time_Start": 661.76,
      "Time_End": 666.4,
      "Text": " you to beam. So they thought that they could lock people out of beaming copyrighted information."
    },
    {
      "Time_Start": 666.4,
      "Time_End": 671.24,
      "Text": " It definitely gives a false sense of security to the developers. You can do a standard buffer"
    },
    {
      "Time_Start": 671.24,
      "Time_End": 675.6,
      "Text": " overflow. If you guys want to see more details of it over at this website, you'll get to"
    },
    {
      "Time_Start": 675.6,
      "Time_End": 681.5600000000001,
      "Text": " see the operating system interacts here with the upper layer API, and you get to go through"
    },
    {
      "Time_Start": 681.5600000000001,
      "Time_End": 685.6800000000001,
      "Text": " the application and it works with the user, and here's the driver mode. PalmPilot's use"
    },
    {
      "Time_Start": 685.6800000000001,
      "Time_End": 691.84,
      "Text": " of virtual driver system, but it's tied to the serial port. So basically if you write"
    },
    {
      "Time_Start": 691.84,
      "Time_End": 698.28,
      "Text": " a driver for the PalmPilot to drive the keyboard, if you drive a modem, if you have a minstrel,"
    },
    {
      "Time_Start": 698.28,
      "Time_End": 701.84,
      "Text": " if you have something else, it actually interacts just like it's a serial port. You need to"
    },
    {
      "Time_Start": 701.84,
      "Time_End": 708.84,
      "Text": " emulate the serial port inside of the driver. Some of the techniques that we can use to"
    },
    {
      "Time_Start": 710.6800000000001,
      "Time_End": 716.0,
      "Text": " protect our PalmPilot include some operating system level tricks that you can use, some"
    },
    {
      "Time_Start": 716.0,
      "Time_End": 721.6800000000001,
      "Text": " attacks against applications, and we're going to go over some future ideas for exploit,"
    },
    {
      "Time_Start": 721.6800000000001,
      "Time_End": 726.12,
      "Text": " because I think probably, and I'm just going to venture to guess, that in the next six"
    },
    {
      "Time_Start": 726.12,
      "Time_End": 732.76,
      "Text": " months you're going to see a major PalmPilot Trojan horse most likely that's passed to"
    },
    {
      "Time_Start": 732.76,
      "Time_End": 738.48,
      "Text": " the PalmPilot, because it's open right now. Once it hits 10 million users, and 10 million"
    },
    {
      "Time_Start": 738.48,
      "Time_End": 741.92,
      "Text": " users who are walking around at the local restaurants beaming everyone their business"
    },
    {
      "Time_Start": 741.92,
      "Time_End": 748.0,
      "Text": " cards, it's going to seem like a good option for someone to write this code, and to understand"
    },
    {
      "Time_Start": 748.0,
      "Time_End": 755.0,
      "Text": " how the PalmPilot works is going to help you protect yourself and others against it."
    },
    {
      "Time_Start": 757.12,
      "Time_End": 764.12,
      "Text": " This is the new Palm logo. The operating system processes applications in a very specific"
    },
    {
      "Time_Start": 764.76,
      "Time_End": 769.36,
      "Text": " manner. All developers are tied to making their applications work the exact same way."
    },
    {
      "Time_Start": 769.36,
      "Time_End": 774.72,
      "Text": " It is a main event loop inside of it. It parses every time you choose from the menu, every"
    },
    {
      "Time_Start": 774.72,
      "Time_End": 780.16,
      "Text": " time you choose from a button. It's all coded as strings, and it's all hard-coded in the"
    },
    {
      "Time_Start": 780.9599999999999,
      "Time_End": 786.68,
      "Text": " application. You also have system shortcuts, which can redirect your beam, and can set"
    },
    {
      "Time_Start": 786.68,
      "Time_End": 791.4,
      "Text": " up debug modes, and there's some notorious hacks into it that let you see and dump the"
    },
    {
      "Time_Start": 791.4,
      "Time_End": 796.8399999999999,
      "Text": " registers live while you're using it. There's one key one, actually. We're going to go over"
    },
    {
      "Time_Start": 796.8399999999999,
      "Time_End": 803.36,
      "Text": " a method to redirect your infrared out through your serial port. Basically, you can learn"
    },
    {
      "Time_Start": 803.36,
      "Time_End": 809.56,
      "Text": " about how that application sends itself over the modified TCP IP stack. You can dump it"
    },
    {
      "Time_Start": 809.5600000000001,
      "Time_End": 816.5600000000001,
      "Text": " to a file, you can look at the entire session, and you can see how the infrared port works."
    },
    {
      "Time_Start": 816.5600000000001,
      "Time_End": 823.5600000000001,
      "Text": " PalmPilot has limited developers' information on the infrared port, because they actually"
    },
    {
      "Time_Start": 825.48,
      "Time_End": 832.48,
      "Text": " used an implementation from a third-party company. This third-party company, they've"
    },
    {
      "Time_Start": 832.72,
      "Time_End": 838.2,
      "Text": " been around for, I'd say, eight years, and this stack technology they use in the infrared"
    },
    {
      "Time_Start": 838.2800000000001,
      "Time_End": 843.2800000000001,
      "Text": " port is about four to five years old, so it predates the 3X pretty significantly. We're"
    },
    {
      "Time_Start": 843.2800000000001,
      "Time_End": 848.2800000000001,
      "Text": " also going to get into, in this section, some of the applications that let you view your"
    },
    {
      "Time_Start": 848.2800000000001,
      "Time_End": 853.2800000000001,
      "Text": " databases, let you view the status of your databases, and let you look inside the registers"
    },
    {
      "Time_Start": 853.2800000000001,
      "Time_End": 860.2800000000001,
      "Text": " and memory parts of your Palm. Should I yell real loud to wake people up?"
    },
    {
      "Time_Start": 861.28,
      "Time_End": 868.28,
      "Text": " All right, PalmPilot, how the operating system processes your application. All Palm apps"
    },
    {
      "Time_Start": 872.0,
      "Time_End": 878.4399999999999,
      "Text": " save their state. They actually have what 3Com calls a static state, which means that"
    },
    {
      "Time_Start": 878.4399999999999,
      "Time_End": 883.68,
      "Text": " at every point the application progresses, it has a pointer in memory to pick up exactly"
    },
    {
      "Time_Start": 883.6800000000001,
      "Time_End": 890.36,
      "Text": " where it is. It also doesn't run background processes, so you don't really have a multitasking"
    },
    {
      "Time_Start": 890.36,
      "Time_End": 894.72,
      "Text": " operating system, which means that your PalmPilot's very stable, actually, since it's not trying"
    },
    {
      "Time_Start": 894.72,
      "Time_End": 899.32,
      "Text": " to do a lot of stuff with the Dragon Ball processor."
    },
    {
      "Time_Start": 899.32,
      "Time_End": 904.48,
      "Text": " Hackmaster is an exception. Does anyone have Hackmaster hacks on their computer, like,"
    },
    {
      "Time_Start": 904.48,
      "Time_End": 909.32,
      "Text": " you know, like BeamEdit and those kinds of things that you have? The way they get around"
    },
    {
      "Time_Start": 909.32,
      "Time_End": 913.96,
      "Text": " it is, we're going to go into it a little bit, but every PalmPilot application works"
    },
    {
      "Time_Start": 913.96,
      "Time_End": 919.96,
      "Text": " through something called system traps, and each system trap can be mapped just like the"
    },
    {
      "Time_Start": 919.96,
      "Time_End": 925.24,
      "Text": " Windows API. You can actually hook into every single one of them, so that's what the Hackmasters"
    },
    {
      "Time_Start": 925.24,
      "Time_End": 928.0400000000001,
      "Text": " do, is they hook into each of those system traps."
    },
    {
      "Time_Start": 928.0400000000001,
      "Time_End": 933.5200000000001,
      "Text": " When we talk about best practices, we're going to talk about why leaving your Hackmaster"
    },
    {
      "Time_Start": 933.5200000000001,
      "Time_End": 939.12,
      "Text": " extensions, probably not the best idea, because 3Com never really intended for anyone to pass"
    },
    {
      "Time_Start": 939.48,
      "Time_End": 945.84,
      "Text": " their own system traps. It's just that need arose, especially for modifying the little"
    },
    {
      "Time_Start": 945.84,
      "Time_End": 950.28,
      "Text": " pen keyboard that you have and doing spell check and those types of things."
    },
    {
      "Time_Start": 950.28,
      "Time_End": 955.16,
      "Text": " It's actually really, really dangerous on a PalmPilot, because the Hackmaster runs inside"
    },
    {
      "Time_Start": 955.16,
      "Time_End": 961.0,
      "Text": " your ROM and can run inside your RAM and kernel space, actually, as opposed to other operating"
    },
    {
      "Time_Start": 961.0,
      "Time_End": 965.78,
      "Text": " systems that take the API and run it on top of the kernel, not like Windows, but more"
    },
    {
      "Time_Start": 965.8199999999999,
      "Time_End": 967.86,
      "Text": " like Windows 2000."
    },
    {
      "Time_Start": 967.86,
      "Time_End": 971.1,
      "Text": " Technically one app is running at a time in the PalmPilot, the memory is initialized"
    },
    {
      "Time_Start": 971.1,
      "Time_End": 976.26,
      "Text": " at start, and it stays allocated until your soft reset. That means that if you've used"
    },
    {
      "Time_Start": 976.26,
      "Time_End": 980.9,
      "Text": " your PalmPilot for three weeks now and you keep switching back and forth from applications"
    },
    {
      "Time_Start": 980.9,
      "Time_End": 984.6999999999999,
      "Text": " and you wrote this and you've deleted this and you've set this up, if you were to three"
    },
    {
      "Time_Start": 984.6999999999999,
      "Time_End": 989.54,
      "Text": " weeks later, use an application like Insider to look inside the memory inside your PalmPilot,"
    },
    {
      "Time_Start": 989.5400000000001,
      "Time_End": 993.7400000000001,
      "Text": " all your information, your state, is still in there."
    },
    {
      "Time_Start": 993.7400000000001,
      "Time_End": 997.6600000000001,
      "Text": " That's something that you don't have in the Windows environment, because basically when"
    },
    {
      "Time_Start": 997.6600000000001,
      "Time_End": 1003.1400000000001,
      "Text": " you shut down and restart, everything's gone and it starts again. Or if you're forced to"
    },
    {
      "Time_Start": 1003.1400000000001,
      "Time_End": 1006.9000000000001,
      "Text": " shut down and restart."
    },
    {
      "Time_Start": 1006.9000000000001,
      "Time_End": 1011.22,
      "Text": " PalmPilot supports hidden windows, which can exchange information with on screen. Not a"
    },
    {
      "Time_Start": 1011.22,
      "Time_End": 1015.1000000000001,
      "Text": " lot of developers know this, but there's a few developers out there who've used this,"
    },
    {
      "Time_Start": 1015.1,
      "Time_End": 1021.02,
      "Text": " which is a great way to protect your information. Because actually, everything we see is a form"
    },
    {
      "Time_Start": 1021.02,
      "Time_End": 1025.9,
      "Text": " on screen, and you can create off screen alerts and forms, the popups and the static pieces"
    },
    {
      "Time_Start": 1025.9,
      "Time_End": 1030.74,
      "Text": " of static input that you see on your screen."
    },
    {
      "Time_Start": 1030.74,
      "Time_End": 1035.6200000000001,
      "Text": " You can actually use, for example, your register, when you register your PalmPilot application,"
    },
    {
      "Time_Start": 1035.6200000000001,
      "Time_End": 1041.1,
      "Text": " we'll use standalone for an example. In the latest version of their protection, they got"
    },
    {
      "Time_Start": 1041.1,
      "Time_End": 1046.86,
      "Text": " somewhat wise to the fact that they had documented in their source code their entire protection"
    },
    {
      "Time_Start": 1046.86,
      "Time_End": 1051.54,
      "Text": " scheme. Now they use a method where they write some of the information to an off screen window"
    },
    {
      "Time_Start": 1051.54,
      "Time_End": 1055.3,
      "Text": " that you can't see when you do your registration."
    },
    {
      "Time_Start": 1055.3,
      "Time_End": 1060.36,
      "Text": " It actually contains the hash for, if you use a special command, you can see the hot"
    },
    {
      "Time_Start": 1060.36,
      "Time_End": 1066.86,
      "Text": " sync ID turned into hex, which is what they use to generate your unique code."
    },
    {
      "Time_Start": 1066.86,
      "Time_End": 1070.6999999999998,
      "Text": " There's several shortcuts. Everyone knows the shortcut stroke looks like an L, a lower"
    },
    {
      "Time_Start": 1070.7,
      "Time_End": 1077.7,
      "Text": " case L, plus dot and these commands. These commands were used by 3Com support to let"
    },
    {
      "Time_Start": 1078.02,
      "Time_End": 1083.46,
      "Text": " you actually debug programs and things that are going on inside your PalmPilot, or your"
    },
    {
      "Time_Start": 1083.46,
      "Time_End": 1085.14,
      "Text": " Palm."
    },
    {
      "Time_Start": 1085.14,
      "Time_End": 1089.3,
      "Text": " If you use dot I, it starts your beam receive. That's automatic. It doesn't matter whether"
    },
    {
      "Time_Start": 1089.3,
      "Time_End": 1093.78,
      "Text": " your beam receive is on. It doesn't matter whether it's off. It just starts it. And basically,"
    },
    {
      "Time_Start": 1093.78,
      "Time_End": 1099.7,
      "Text": " it sends a flow of any information you want out through your PalmPilot."
    },
    {
      "Time_Start": 1099.7,
      "Time_End": 1106.7,
      "Text": " If you use dot S with the shortcut stroke, you get to redirect your beaming. It redirects"
    },
    {
      "Time_Start": 1106.7,
      "Time_End": 1108.8600000000001,
      "Text": " your beaming to a serial port."
    },
    {
      "Time_Start": 1108.8600000000001,
      "Time_End": 1114.1000000000001,
      "Text": " This is actually a really interesting use, I think, of the Palm. You stick it in your"
    },
    {
      "Time_Start": 1114.1000000000001,
      "Time_End": 1119.38,
      "Text": " hot sync cradle. You do use dot S to redirect your beaming to your serial port and you can"
    },
    {
      "Time_Start": 1119.38,
      "Time_End": 1123.5800000000002,
      "Text": " view what applications are beaming in and out. For example, I don't know, does anyone"
    },
    {
      "Time_Start": 1123.58,
      "Time_End": 1130.4199999999998,
      "Text": " play IR chess here or any of the great IR games that you battle ship stuff? One experiment"
    },
    {
      "Time_Start": 1130.4199999999998,
      "Time_End": 1134.82,
      "Text": " that I did was to set my beam to my serial port and then read the information that it"
    },
    {
      "Time_Start": 1134.82,
      "Time_End": 1141.62,
      "Text": " was sending back via IR. And actually, to show you an example of a little bit of I would"
    },
    {
      "Time_Start": 1141.62,
      "Time_End": 1146.3799999999999,
      "Text": " say laziness maybe with the PalmPilot developers, every single time that you send something"
    },
    {
      "Time_Start": 1146.3799999999999,
      "Time_End": 1151.26,
      "Text": " via IR, it re-syncs and sends all your registration information to the other person."
    },
    {
      "Time_Start": 1151.46,
      "Time_End": 1154.94,
      "Text": " Basically, it shares and encrypts it back and forth between the program. It's a nice"
    },
    {
      "Time_Start": 1154.94,
      "Time_End": 1156.3799999999999,
      "Text": " program, though."
    },
    {
      "Time_Start": 1156.3799999999999,
      "Time_End": 1162.62,
      "Text": " Dot T is an IR loopback. This was used so that you could actually record the information"
    },
    {
      "Time_Start": 1162.62,
      "Time_End": 1168.58,
      "Text": " that's being shot out of your IR port back inside your PalmPilot."
    },
    {
      "Time_Start": 1168.58,
      "Time_End": 1172.26,
      "Text": " Dot 1 is a debug mode. It lets you go in and view the registers of your PalmPilot. It's"
    },
    {
      "Time_Start": 1172.26,
      "Time_End": 1177.02,
      "Text": " not very robust. It was mostly intended to find out what the last error message was by"
    },
    {
      "Time_Start": 1177.02,
      "Time_End": 1179.74,
      "Text": " 3Com support."
    },
    {
      "Time_Start": 1179.74,
      "Time_End": 1183.74,
      "Text": " Dot 2 is open the serial port in debug mode. And this is really, really interesting and"
    },
    {
      "Time_Start": 1183.74,
      "Time_End": 1190.74,
      "Text": " really useful. There's no documentation on this one. The reason is when the first PalmPilot"
    },
    {
      "Time_Start": 1191.42,
      "Time_End": 1196.38,
      "Text": " was released, 3Com told everyone this is for hot syncing. That's all this does."
    },
    {
      "Time_Start": 1196.38,
      "Time_End": 1199.86,
      "Text": " And then we realized there are all these great peripherals that you can add on to it. You"
    },
    {
      "Time_Start": 1199.86,
      "Time_End": 1204.9,
      "Text": " can put your modem on it. You can put your GSM on it. You can put the new Govox voice"
    },
    {
      "Time_Start": 1204.9,
      "Time_End": 1210.3400000000001,
      "Text": " recorder on it. So they didn't actually document it as well as they should have."
    },
    {
      "Time_Start": 1210.3400000000001,
      "Time_End": 1214.22,
      "Text": " So what happened was Landware, the company that makes the Go type keyboard, decided to"
    },
    {
      "Time_Start": 1214.22,
      "Time_End": 1219.3600000000001,
      "Text": " use this shortcut and read the information from the serial port and watch the communication"
    },
    {
      "Time_Start": 1219.3600000000001,
      "Time_End": 1223.7,
      "Text": " of it because they have the hardware specs. They didn't have the software communication"
    },
    {
      "Time_Start": 1223.7,
      "Time_End": 1224.8600000000001,
      "Text": " specs."
    },
    {
      "Time_Start": 1224.8600000000001,
      "Time_End": 1230.1000000000001,
      "Text": " So I don't think 3Com intended for someone that was a commercial developer to actually"
    },
    {
      "Time_Start": 1230.1000000000001,
      "Time_End": 1234.38,
      "Text": " hack their own PalmPilot, but it happened."
    },
    {
      "Time_Start": 1234.38,
      "Time_End": 1238.5400000000002,
      "Text": " Dot 3 is to disable the auto off. I actually really like that one because it really makes"
    },
    {
      "Time_Start": 1238.5400000000002,
      "Time_End": 1243.7800000000002,
      "Text": " me angry when I'm taking notes. All of a sudden the thing turns off. Yeah, it turns on automatically,"
    },
    {
      "Time_Start": 1243.7800000000002,
      "Time_End": 1247.6200000000001,
      "Text": " but then I got to get the shortcut out and get my stylus out."
    },
    {
      "Time_Start": 1247.6200000000001,
      "Time_End": 1254.6200000000001,
      "Text": " You also have dot 4. Dot 4 flashes your user name and unique number inside your PalmPilot."
    },
    {
      "Time_Start": 1254.66,
      "Time_End": 1259.9,
      "Text": " This one's a little dangerous. This one actually gets rid of your PalmPilot's user name, which"
    },
    {
      "Time_Start": 1259.9,
      "Time_End": 1265.14,
      "Text": " is a randomly assigned name, and also some random numbers in there. Basically when you"
    },
    {
      "Time_Start": 1265.14,
      "Time_End": 1271.1000000000001,
      "Text": " do that, your PalmPilot can't identify itself and you're going to have to do a hard reset."
    },
    {
      "Time_Start": 1271.1000000000001,
      "Time_End": 1277.5800000000002,
      "Text": " Dot 5 removes your user configuration, your hot sync. The PalmPilot registry is called"
    },
    {
      "Time_Start": 1277.5800000000002,
      "Time_End": 1282.8200000000002,
      "Text": " save preferences dot PDB. It's a database. It's not encrypted. It doesn't have any special"
    },
    {
      "Time_Start": 1282.8200000000002,
      "Time_End": 1287.98,
      "Text": " information in it, except that it contains most of your shareware usernames and passwords"
    },
    {
      "Time_Start": 1288.14,
      "Time_End": 1290.94,
      "Text": " that you use."
    },
    {
      "Time_Start": 1290.94,
      "Time_End": 1296.26,
      "Text": " It's bad to reset your user configuration and your hot sync ID. Basically when you use"
    },
    {
      "Time_Start": 1296.26,
      "Time_End": 1300.8600000000001,
      "Text": " this trick and you re-sync your Palm, everything comes out in duplicate because it doesn't"
    },
    {
      "Time_Start": 1300.8600000000001,
      "Time_End": 1307.18,
      "Text": " know what your record is. This is another example of where 3Com actually, I think they"
    },
    {
      "Time_Start": 1307.18,
      "Time_End": 1310.94,
      "Text": " were hedging their bets. They wanted to make the hot sync application quick and easy to"
    },
    {
      "Time_Start": 1310.94,
      "Time_End": 1317.18,
      "Text": " use, when in truth what they ended up doing with it is making it very poorly unrobust."
    },
    {
      "Time_Start": 1317.8600000000001,
      "Time_End": 1322.18,
      "Text": " There's a program called backup buddy that lets you backup all your databases and everything."
    },
    {
      "Time_Start": 1322.18,
      "Time_End": 1329.18,
      "Text": " That kind of takes advantage of the fact that the PalmPilot hot sync is a little bit simplistic."
    },
    {
      "Time_Start": 1329.3,
      "Time_End": 1334.8600000000001,
      "Text": " Dot 6 displays your ROM date. Very, very cool. Go into Best Buy sometimes and run a few dot"
    },
    {
      "Time_Start": 1334.8600000000001,
      "Time_End": 1341.8600000000001,
      "Text": " 6 shortcuts on the things. You'll find out how old their inventory is."
    },
    {
      "Time_Start": 1342.8600000000001,
      "Time_End": 1347.8600000000001,
      "Text": " Dot 7 lets you toggle your battery meter. Even though 3Com said that they weren't going"
    },
    {
      "Time_Start": 1347.8600000000001,
      "Time_End": 1354.7400000000002,
      "Text": " to allow you to use actual rechargeable batteries with the PalmPilot, a lot of us do. I used"
    },
    {
      "Time_Start": 1354.7400000000002,
      "Time_End": 1358.8600000000001,
      "Text": " to. One thing that you should do, if you do, is use the dot 7 shortcut because it will"
    },
    {
      "Time_Start": 1358.8600000000001,
      "Time_End": 1362.7800000000002,
      "Text": " change your battery meter to reflect the fact that you have rechargeables. It will more"
    },
    {
      "Time_Start": 1362.7800000000002,
      "Time_End": 1369.22,
      "Text": " accurately reflect the state of your battery."
    },
    {
      "Time_Start": 1369.22,
      "Time_End": 1375.1000000000001,
      "Text": " Every PalmPilot program is a dot PRC file. You see those things running around. You see"
    },
    {
      "Time_Start": 1375.1000000000001,
      "Time_End": 1381.66,
      "Text": " every application uses a PalmResource file to run itself. It's a collection of forms,"
    },
    {
      "Time_Start": 1381.66,
      "Time_End": 1387.42,
      "Text": " which for example, the form in your date book is the listing of the lines in your current"
    },
    {
      "Time_Start": 1387.42,
      "Time_End": 1391.94,
      "Text": " appointment information. It uses alerts, which is when it pops up and says you have to register"
    },
    {
      "Time_Start": 1391.94,
      "Time_End": 1398.06,
      "Text": " this shareware application. It uses strings, which you can actually hard code inside the"
    },
    {
      "Time_Start": 1398.06,
      "Time_End": 1404.3,
      "Text": " machine. A lot of developers who are using assembly language, and about 80% are, place"
    },
    {
      "Time_Start": 1404.3,
      "Time_End": 1411.3,
      "Text": " a lot of strings within their applications, such as a check register key."
    },
    {
      "Time_Start": 1419.3,
      "Time_End": 1425.54,
      "Text": " The PalmPilot uses a Dragon Ball processor. It's a Motorola M68K processor. It's the same"
    },
    {
      "Time_Start": 1425.54,
      "Time_End": 1432.54,
      "Text": " one that was in your Commodore 64, just modified for power consumption. Loft offers a Dragon"
    },
    {
      "Time_Start": 1432.98,
      "Time_End": 1438.3,
      "Text": " Balls app to view your M68K registers. That's what it's called. It's a very clever name"
    },
    {
      "Time_Start": 1438.3,
      "Time_End": 1444.3799999999999,
      "Text": " with a Z. It actually lets you look inside of all the registers inside your PalmPilot"
    },
    {
      "Time_Start": 1444.3799999999999,
      "Time_End": 1451.26,
      "Text": " while it's running. It's actually really useful because an application like Afterburner, which"
    },
    {
      "Time_Start": 1451.3799999999999,
      "Time_End": 1458.3799999999999,
      "Text": " is a Palm accelerator and overclocking application, the developer of it used this to actually"
    },
    {
      "Time_Start": 1459.02,
      "Time_End": 1463.1,
      "Text": " go inside and look at why his application was crashing so often. I find it much more"
    },
    {
      "Time_Start": 1463.1,
      "Time_End": 1468.14,
      "Text": " stable. What you can use it for is to see exactly what's going on in that slow program."
    },
    {
      "Time_Start": 1468.14,
      "Time_End": 1472.86,
      "Text": " I don't know if anyone uses Datebook 4, but I assume almost everyone uses the Datebook"
    },
    {
      "Time_Start": 1472.86,
      "Time_End": 1478.7,
      "Text": " alternative. That application is so slow and so sloth-like because of its programming that"
    },
    {
      "Time_Start": 1478.74,
      "Time_End": 1482.74,
      "Text": " you can actually go in and see what it's doing. Basically, every two lines of code, it's making"
    },
    {
      "Time_Start": 1482.74,
      "Time_End": 1489.74,
      "Text": " a direct memory call. There's a program by Sylvain Beulieu, I think, called Insider."
    },
    {
      "Time_Start": 1491.02,
      "Time_End": 1495.8600000000001,
      "Text": " This program actually lets you view your memory location inside your PalmPilot. It lets you"
    },
    {
      "Time_Start": 1495.8600000000001,
      "Time_End": 1500.98,
      "Text": " disassemble inside your PalmPilot. It lets you copy sections of memory from your PalmPilot,"
    },
    {
      "Time_Start": 1500.98,
      "Time_End": 1507.6200000000001,
      "Text": " both live and in storage. This is a really amazing application. It's free unless you"
    },
    {
      "Time_Start": 1507.6200000000001,
      "Time_End": 1514.6200000000001,
      "Text": " get the Pro version. To get the Pro version, it costs you about, I think it's about $59."
    },
    {
      "Time_Start": 1514.66,
      "Time_End": 1520.5800000000002,
      "Text": " I don't have the Pro version. I use the regular version. There's also a program called PalmDisassembler."
    },
    {
      "Time_Start": 1520.5800000000002,
      "Time_End": 1525.5400000000002,
      "Text": " You can get these programs from PalmGear, of course. It actually lets you disassemble"
    },
    {
      "Time_Start": 1525.5400000000002,
      "Time_End": 1530.18,
      "Text": " your PalmPilot applications in memory. I think probably the best way that you can learn programming"
    },
    {
      "Time_Start": 1530.18,
      "Time_End": 1534.98,
      "Text": " if anyone wants to be a PalmPilot developer because it's a great community of people developing"
    },
    {
      "Time_Start": 1535.54,
      "Time_End": 1541.42,
      "Text": " applications, is to actually use the PalmDisassembler to look inside. The only weakness of it is"
    },
    {
      "Time_Start": 1541.42,
      "Time_End": 1546.66,
      "Text": " it doesn't let you view the system traps, which are something else that you have to"
    },
    {
      "Time_Start": 1546.66,
      "Time_End": 1553.66,
      "Text": " contend with when you're programming for the PalmPilot."
    },
    {
      "Time_Start": 1554.94,
      "Time_End": 1561.2,
      "Text": " Next section is on application attacks. By attack, I don't mean guy beating up the application,"
    },
    {
      "Time_Start": 1561.2,
      "Time_End": 1566.6000000000001,
      "Text": " taking advantage of it, blue hair running around. What I mean is actually looking at"
    },
    {
      "Time_Start": 1566.6000000000001,
      "Time_End": 1571.2,
      "Text": " the way the PalmPilot runs and the way a program runs. This is the PalmDisassembler program"
    },
    {
      "Time_Start": 1571.2,
      "Time_End": 1576.92,
      "Text": " that I talked about before. This is live on your PalmPilot. You can actually see the code"
    },
    {
      "Time_Start": 1576.92,
      "Time_End": 1583.92,
      "Text": " that each application is running in here. Your user interface is a physical layer. It's"
    },
    {
      "Time_Start": 1584.92,
      "Time_End": 1591.92,
      "Text": " what you see on the front of your Palm screen. When you turn it on, every app is made up"
    },
    {
      "Time_Start": 1591.92,
      "Time_End": 1596.72,
      "Text": " of forms, which is your input section, alerts, which is your pop‑up section, and strings,"
    },
    {
      "Time_Start": 1596.72,
      "Time_End": 1603.1200000000001,
      "Text": " which is your text section. When the resources are extracted, you get these little binary"
    },
    {
      "Time_Start": 1603.1200000000001,
      "Time_End": 1608.76,
      "Text": " files and they're actually in plain text. So you can actually view the resources that"
    },
    {
      "Time_Start": 1608.76,
      "Time_End": 1615.32,
      "Text": " each PalmPilot application uses. If you have TF or if you have F, you've extracted a form."
    },
    {
      "Time_Start": 1615.32,
      "Time_End": 1620.8,
      "Text": " If you have A, you've extracted an alert. If you have STI, you've extracted a string."
    },
    {
      "Time_Start": 1620.8,
      "Time_End": 1626.84,
      "Text": " The rest are all code segments. Most PalmPilot programs and most PalmPilot developers use"
    },
    {
      "Time_Start": 1626.84,
      "Time_End": 1632.0,
      "Text": " two code segments. They use the application initialization segment and then they'll run"
    },
    {
      "Time_Start": 1632.0,
      "Time_End": 1636.08,
      "Text": " all of their main events and their main programming off it."
    },
    {
      "Time_Start": 1636.08,
      "Time_End": 1641.52,
      "Text": " You also have stylish actions. So in addition to all the resources that we see, you also"
    },
    {
      "Time_Start": 1641.52,
      "Time_End": 1646.1999999999998,
      "Text": " have your stylish actions, your button actions, and your keyboard input. That's actually the"
    },
    {
      "Time_Start": 1646.1999999999998,
      "Time_End": 1652.08,
      "Text": " digital keyboard, not actually the Go type there that I'm referring to. So all those"
    },
    {
      "Time_Start": 1652.08,
      "Time_End": 1655.8799999999999,
      "Text": " methods together let you interact with the forms, and that's what it is. It isn't an"
    },
    {
      "Time_Start": 1655.8799999999999,
      "Time_End": 1659.6799999999998,
      "Text": " application that's running all the time and using up memory and using resources. That's"
    },
    {
      "Time_Start": 1659.6799999999998,
      "Time_End": 1663.24,
      "Text": " why I like the PalmPilot, because it's basic and straightforward and lets you do what you"
    },
    {
      "Time_Start": 1663.24,
      "Time_End": 1670.64,
      "Text": " want to do."
    },
    {
      "Time_Start": 1670.64,
      "Time_End": 1675.48,
      "Text": " The M68K processor is Motorola's processor. You have two versions. You have the Dragonball"
    },
    {
      "Time_Start": 1675.48,
      "Time_End": 1683.68,
      "Text": " and you have the Dragonball EZ, which is in the Palm 3X and the Palm 5X and 5XE. It's"
    },
    {
      "Time_Start": 1683.68,
      "Time_End": 1691.8,
      "Text": " pretty simple, but we'll go over it. Basically, everything in the application works linearly."
    },
    {
      "Time_Start": 1691.8,
      "Time_End": 1695.9199999999998,
      "Text": " It goes from beginning to end. It has a few subroutines that it uses. Most programs run"
    },
    {
      "Time_Start": 1695.9199999999998,
      "Time_End": 1700.52,
      "Text": " in a straight line fashion. So the way they get around, did you do it right or did you"
    },
    {
      "Time_Start": 1700.52,
      "Time_End": 1704.6399999999999,
      "Text": " do it wrong, is with simple instructions that you might, if you've done any assembly language"
    },
    {
      "Time_Start": 1704.6399999999999,
      "Time_End": 1711.28,
      "Text": " program, you recognize. These are the PalmPilot opcodes, the equivalents of branch all the"
    },
    {
      "Time_Start": 1711.28,
      "Time_End": 1717.36,
      "Text": " time, which is opcode 60, B and E, branch if not equal, which is opcode 66, branch if"
    },
    {
      "Time_Start": 1718.3200000000002,
      "Time_End": 1725.3200000000002,
      "Text": " equal, which is 67, branch if greater than and branch if less than, and then debuffer."
    },
    {
      "Time_Start": 1725.3200000000002,
      "Time_End": 1733.16,
      "Text": " 3Com released a Palm debugger, and then they made it so that CodeWarrior, one of the major"
    },
    {
      "Time_Start": 1733.16,
      "Time_End": 1737.64,
      "Text": " development platforms for the PalmPilot, could then continue the development of the debugger."
    },
    {
      "Time_Start": 1737.64,
      "Time_End": 1743.3200000000002,
      "Text": " They kind of left it in a state where it only has information up to version 3.0 and 3.1"
    },
    {
      "Time_Start": 1743.32,
      "Time_End": 1749.04,
      "Text": " of the operating system. So someone developed and named it after his dog, this program called"
    },
    {
      "Time_Start": 1749.04,
      "Time_End": 1754.3999999999999,
      "Text": " Debuffer, which is a full-featured debugging application for your PalmPilot. This application"
    },
    {
      "Time_Start": 1754.3999999999999,
      "Time_End": 1761.3999999999999,
      "Text": " uses a system trap, 4E48, that was reserved as unused by 3Com to actually control the"
    },
    {
      "Time_Start": 1762.12,
      "Time_End": 1765.72,
      "Text": " execution of the program. That will come into play a little bit later when we're talking"
    },
    {
      "Time_Start": 1765.72,
      "Time_End": 1770.72,
      "Text": " about Liberty and how they protect their application."
    },
    {
      "Time_Start": 1771.72,
      "Time_End": 1781.72,
      "Text": " A few other opcodes. Instead of SEQ, set if equal, you set to 50 automatically sets it to any number you want."
    },
    {
      "Time_Start": 1781.72,
      "Time_End": 1791.72,
      "Text": " You also have NOP, which is 4E71, which is no instruction. You also have RTS, which is return."
    },
    {
      "Time_Start": 1791.72,
      "Time_End": 1797.72,
      "Text": " Every PalmPilot subroutine has to follow the exact same specification. It starts with the"
    },
    {
      "Time_Start": 1798.72,
      "Time_End": 1805.72,
      "Text": " memory in, processes it, and it has to return it in one register, D0. Just like when you're"
    },
    {
      "Time_Start": 1805.72,
      "Time_End": 1812.72,
      "Text": " using 16-bit Windows applications, actually. CLEAR is, I'm sorry, yes. CLEAR equals 42,"
    },
    {
      "Time_Start": 1812.72,
      "Time_End": 1819.72,
      "Text": " which lets you reset memory locations. And MOV number 1 or MOV number 0 is, MOVQ number"
    },
    {
      "Time_Start": 1819.72,
      "Time_End": 1826.72,
      "Text": " 0, MOVQ number 1, 7, 0, and 0, 1. It's a two byte operation code."
    },
    {
      "Time_Start": 1827.72,
      "Time_End": 1838.72,
      "Text": " All your PalmPilot applications work with System Traps. This is the API. It's transparent"
    },
    {
      "Time_Start": 1838.72,
      "Time_End": 1844.72,
      "Text": " to the application. It doesn't know, of course, whether it's calling a patched section of"
    },
    {
      "Time_Start": 1844.72,
      "Time_End": 1848.72,
      "Text": " it, whether it's calling a hacked section of it, or what you're doing. This is how you"
    },
    {
      "Time_Start": 1848.72,
      "Time_End": 1855.72,
      "Text": " can extend the usefulness of your PalmPilot. SystemTrapDLKGetSyncInfo. That's what it's"
    },
    {
      "Time_Start": 1855.72,
      "Time_End": 1860.72,
      "Text": " called. Anyone can run this. There's no restrictions on it. Anyone can view all of your hot sync"
    },
    {
      "Time_Start": 1860.72,
      "Time_End": 1865.72,
      "Text": " information. That's how an application that's shareware will often get your hot sync ID."
    },
    {
      "Time_Start": 1865.72,
      "Time_End": 1869.72,
      "Text": " There's two other methods to do it. They require mem locks, and they require you to lock the"
    },
    {
      "Time_Start": 1869.72,
      "Time_End": 1875.72,
      "Text": " memory, or they require you to read the default database in your PalmPilot. Thus far, no developer"
    },
    {
      "Time_Start": 1875.72,
      "Time_End": 1880.72,
      "Text": " has begun to use that, although that would be a better protection method for your application."
    },
    {
      "Time_Start": 1880.72,
      "Time_End": 1885.72,
      "Text": " SysTrapSTR compare. That's pretty straightforward. Compare two strings together in your PalmPilot."
    },
    {
      "Time_Start": 1885.72,
      "Time_End": 1890.72,
      "Text": " Return the result. Are they equal? Are they not equal? It usually will end a key routine"
    },
    {
      "Time_Start": 1890.72,
      "Time_End": 1896.72,
      "Text": " from an actual shareware developer. The shareware community, like I mentioned, is really robust."
    },
    {
      "Time_Start": 1896.72,
      "Time_End": 1905.72,
      "Text": " There's 70,000 shareware developers. And companies like Standalone, Lanware, Iambic"
    },
    {
      "Time_Start": 1905.72,
      "Time_End": 1912.72,
      "Text": " software that creates action names and also creates the all money application."
    },
    {
      "Time_Start": 1912.72,
      "Time_End": 1921.72,
      "Text": " They actually, to give you an example, let's use Datebook. Datebook is, I think the latest"
    },
    {
      "Time_Start": 1921.72,
      "Time_End": 1928.72,
      "Text": " version is like 380K, and your PalmPilot has in it, if you have the 5X, if you have the"
    },
    {
      "Time_Start": 1928.72,
      "Time_End": 1934.72,
      "Text": " 5, rather, because it's really cool looking, you have two megs of memory in it, of RAM."
    },
    {
      "Time_Start": 1934.72,
      "Time_End": 1939.72,
      "Text": " So that takes up one quarter of your memory. That's because they've left in there their"
    },
    {
      "Time_Start": 1939.72,
      "Time_End": 1945.72,
      "Text": " old string compares and old data and old code inside of your application, because it's too"
    },
    {
      "Time_Start": 1945.72,
      "Time_End": 1951.72,
      "Text": " much of a pain to recompile it sometimes. Apparently, for about probably 20% of the"
    },
    {
      "Time_Start": 1951.72,
      "Time_End": 1956.72,
      "Text": " applications out there, they'd run much faster if they went in and dug out that old code."
    },
    {
      "Time_Start": 1956.72,
      "Time_End": 1962.72,
      "Text": " You also have, which is the closest a PalmPilot has to an encrypted string, which is CRC16"
    },
    {
      "Time_Start": 1962.72,
      "Time_End": 1968.72,
      "Text": " calc block. It calculates a 16-bit CRC of information and memory."
    },
    {
      "Time_Start": 1968.72,
      "Time_End": 1974.72,
      "Text": " This is smarter than this for a developer to use if you want to use it. This is a one-to-one"
    },
    {
      "Time_Start": 1974.72,
      "Time_End": 1981.72,
      "Text": " comparison. Most people don't know that CRC16 calc returns the result not only of the 16-bit"
    },
    {
      "Time_Start": 1981.72,
      "Time_End": 1986.72,
      "Text": " CRC, but also the result of the comparison of the two pieces of information, which is"
    },
    {
      "Time_Start": 1986.72,
      "Time_End": 1991.72,
      "Text": " a really important distinction between itself and string compare, and it's a different way"
    },
    {
      "Time_Start": 1991.72,
      "Time_End": 1998.72,
      "Text": " to check your applications if you're a developer."
    },
    {
      "Time_Start": 1998.72,
      "Time_End": 2004.72,
      "Text": " Since the PalmPilot came out, there have been free tools that let you assemble and disassemble"
    },
    {
      "Time_Start": 2004.72,
      "Time_End": 2010.72,
      "Text": " code for your PalmPilot. One of the most popular is Pilot Disassembler. It's very quick and"
    },
    {
      "Time_Start": 2010.72,
      "Time_End": 2014.72,
      "Text": " functional. It has some switches, and it runs in DOS, and I'm going to show you an example of it"
    },
    {
      "Time_Start": 2014.72,
      "Time_End": 2022.72,
      "Text": " in a little bit. It's very, very fast. It's very functional. It lets you look at what's going on"
    },
    {
      "Time_Start": 2022.72,
      "Time_End": 2028.72,
      "Text": " inside of a PalmPilot application. You also have PRC2bin, which takes all PalmPilot resources,"
    },
    {
      "Time_Start": 2028.72,
      "Time_End": 2032.72,
      "Text": " dumps them to the binary files, and lets you look at the forms and the elements of your"
    },
    {
      "Time_Start": 2032.72,
      "Time_End": 2038.72,
      "Text": " application. And then you have my favorite program, UltraEdit, which is this fantastic editor"
    },
    {
      "Time_Start": 2038.72,
      "Time_End": 2044.72,
      "Text": " that lets you do things in hex or in plain text mode. That's at ultraedit.com. I get nothing."
    },
    {
      "Time_Start": 2044.72,
      "Time_End": 2054.7200000000003,
      "Text": " I wear, you know, their name on my shirt, whatever. They don't give me anything."
    },
    {
      "Time_Start": 2054.7200000000003,
      "Time_End": 2060.7200000000003,
      "Text": " This is the most amazing thing that was written for the PalmPilot world that wasn't written"
    },
    {
      "Time_Start": 2060.7200000000003,
      "Time_End": 2067.7200000000003,
      "Text": " by 3Com. The PalmPilot OS emulator lets you emulate your PalmPilot on your PC. Some people"
    },
    {
      "Time_Start": 2067.7200000000003,
      "Time_End": 2072.7200000000003,
      "Text": " may know about this. Some people don't. This is a great way, actually, to test programs to see"
    },
    {
      "Time_Start": 2072.7200000000003,
      "Time_End": 2077.7200000000003,
      "Text": " if it's going to crash your current configuration. What you do is you run the emulator, and you"
    },
    {
      "Time_Start": 2077.7200000000003,
      "Time_End": 2081.7200000000003,
      "Text": " seed it with a ROM for your different operating systems. You get this off 3Com's development"
    },
    {
      "Time_Start": 2081.7200000000003,
      "Time_End": 2088.7200000000003,
      "Text": " site, which is palmos.com slash dev. It lets you use your Palm3 ROM, your Palm3X, the different"
    },
    {
      "Time_Start": 2088.7200000000003,
      "Time_End": 2093.7200000000003,
      "Text": " versions of your operating system, basically, and test how the application is going to run on it."
    },
    {
      "Time_Start": 2093.7200000000003,
      "Time_End": 2098.7200000000003,
      "Text": " You can set your hot sync ID in it, which I think is actually really neat to see if"
    },
    {
      "Time_Start": 2098.7200000000003,
      "Time_End": 2102.7200000000003,
      "Text": " your program is going to crash because it has some kind of obscure characters, capitals,"
    },
    {
      "Time_Start": 2102.7200000000003,
      "Time_End": 2106.7200000000003,
      "Text": " numbers, letters in your hot sync ID. It comes with a ROM extract utility, or you can find"
    },
    {
      "Time_Start": 2106.7200000000003,
      "Time_End": 2111.7200000000003,
      "Text": " ROMs on the Internet. And it lets you research and test your applications. So in the example"
    },
    {
      "Time_Start": 2111.7200000000003,
      "Time_End": 2116.7200000000003,
      "Text": " of Liberty, you're supposed to run all your games on this before your entire PalmPilot"
    },
    {
      "Time_Start": 2116.7200000000003,
      "Time_End": 2127.7200000000003,
      "Text": " crashes. We're going to go into a simple protection, an application called LaunchM."
    },
    {
      "Time_Start": 2127.7200000000003,
      "Time_End": 2135.7200000000003,
      "Text": " LaunchM is demo-ware. It lets you demo your applications for 15 days. It's a special screen."
    },
    {
      "Time_Start": 2135.7200000000003,
      "Time_End": 2139.7200000000003,
      "Text": " It changes, basically, your view of your operating system. It's got nice tabs, and you organize"
    },
    {
      "Time_Start": 2139.7200000000003,
      "Time_End": 2144.7200000000003,
      "Text": " your applications. You've got a trash can. You've got all these great different resources."
    },
    {
      "Time_Start": 2145.7200000000003,
      "Time_End": 2152.7200000000003,
      "Text": " It's by a company called Syn Solutions, and they actually charge a lot for their shareware."
    },
    {
      "Time_Start": 2152.7200000000003,
      "Time_End": 2157.7200000000003,
      "Text": " I don't know how you guys feel, but when you buy your PalmPilot and you get it online, it's"
    },
    {
      "Time_Start": 2157.7200000000003,
      "Time_End": 2165.7200000000003,
      "Text": " like $150 for your PalmPilot now. It's respectable that the development time they've put into"
    },
    {
      "Time_Start": 2165.7200000000003,
      "Time_End": 2169.7200000000003,
      "Text": " making an application like this, other than the fact that this is based on a freeware"
    },
    {
      "Time_Start": 2169.7200000000003,
      "Time_End": 2174.7200000000003,
      "Text": " application, this particular program, actually goes into creating new versions of the program."
    },
    {
      "Time_Start": 2174.7200000000003,
      "Time_End": 2180.7200000000003,
      "Text": " And I think it's important to always keep in mind that if you're going to develop a"
    },
    {
      "Time_Start": 2180.7200000000003,
      "Time_End": 2184.7200000000003,
      "Text": " PalmPilot application, that you should make sure to make it reasonable for the community"
    },
    {
      "Time_Start": 2184.7200000000003,
      "Time_End": 2191.7200000000003,
      "Text": " of users out there who rely on it every day. So we're going to go over how this application"
    },
    {
      "Time_Start": 2191.7200000000003,
      "Time_End": 2199.7200000000003,
      "Text": " protects itself. Why don't you guys go ahead and, if you're taking notes, take down the"
    },
    {
      "Time_Start": 2199.7200000000003,
      "Time_End": 2203.7200000000003,
      "Text": " right section of the screen and the discovery section of the screen, because I'm going to"
    },
    {
      "Time_Start": 2203.7200000000003,
      "Time_End": 2206.7200000000003,
      "Text": " be switching back and forth inside of my computer."
    },
    {
      "Time_Start": 2207.7200000000003,
      "Time_End": 2223.7200000000003,
      "Text": " The first part of understanding the protection of PalmPilot programs is to understand the"
    },
    {
      "Time_Start": 2223.7200000000003,
      "Time_End": 2230.7200000000003,
      "Text": " intent of the developer. If you are a developer, I think demoware is a good idea, but the only"
    },
    {
      "Time_Start": 2230.7200000000003,
      "Time_End": 2233.7200000000003,
      "Text": " true protection that you're going to have for your program and all the time and effort"
    },
    {
      "Time_Start": 2233.7200000000003,
      "Time_End": 2237.7200000000003,
      "Text": " you put into writing your program is to actually make it feature limited and not include the"
    },
    {
      "Time_Start": 2237.7200000000003,
      "Time_End": 2244.7200000000003,
      "Text": " features in the program. Because the truth is that a simple alert that anyone can see that"
    },
    {
      "Time_Start": 2244.7200000000003,
      "Time_End": 2248.7200000000003,
      "Text": " says demo is something that people can take advantage of. And when you put all that time"
    },
    {
      "Time_Start": 2248.7200000000003,
      "Time_End": 2253.7200000000003,
      "Text": " and effort into programming an application, and it's protected in a simplistic way, you're"
    },
    {
      "Time_Start": 2253.7200000000003,
      "Time_End": 2258.7200000000003,
      "Text": " not going to see, you're not going to go see the benefits of all your work."
    },
    {
      "Time_Start": 2259.7200000000003,
      "Time_End": 2264.7200000000003,
      "Text": " Okay, the first step is we'll start up the PalmPilot operating system emulator here."
    },
    {
      "Time_Start": 2272.7200000000003,
      "Time_End": 2277.7200000000003,
      "Text": " The PalmPilot emulator looks like this. You start it up, it asks you if you want to stick it on"
    },
    {
      "Time_Start": 2277.7200000000003,
      "Time_End": 2283.7200000000003,
      "Text": " your start menu, which is fancy and nice. You get to create a new session in it. You choose the"
    },
    {
      "Time_Start": 2283.7200000000003,
      "Time_End": 2289.7200000000003,
      "Text": " device you want to emulate. In this case, we'll do the Palm 3 because it doesn't make you go"
    },
    {
      "Time_Start": 2289.7200000000003,
      "Time_End": 2294.7200000000003,
      "Text": " through your graffiti sync when you start it. We're going to choose a generic skin for it, and"
    },
    {
      "Time_Start": 2294.7200000000003,
      "Time_End": 2300.7200000000003,
      "Text": " we're going to choose to use two megs of memory for it. You choose a ROM file, one that you've"
    },
    {
      "Time_Start": 2300.7200000000003,
      "Time_End": 2309.7200000000003,
      "Text": " extracted off of your PalmPilot, and you start up the emulator. That looks familiar. It looks"
    },
    {
      "Time_Start": 2309.7200000000003,
      "Time_End": 2316.7200000000003,
      "Text": " exactly like your PalmPilot. It acts exactly like your PalmPilot. And if you notice, the"
    },
    {
      "Time_Start": 2316.7200000000003,
      "Time_End": 2324.7200000000003,
      "Text": " beep is sent off by default. Okay, we're going to load in the application. The way you load"
    },
    {
      "Time_Start": 2324.7200000000003,
      "Time_End": 2332.7200000000003,
      "Text": " an application is you right click on the interface, you install an application database, and we're"
    },
    {
      "Time_Start": 2332.7200000000003,
      "Time_End": 2339.7200000000003,
      "Text": " going to go ahead and install a version of LaunchM by Sync Solutions."
    },
    {
      "Time_Start": 2347.7200000000003,
      "Time_End": 2353.7200000000003,
      "Text": " All right, the application is loaded. Much quicker than hot syncing. You use this interface just"
    },
    {
      "Time_Start": 2353.7200000000003,
      "Time_End": 2359.7200000000003,
      "Text": " like you would use your PalmPilot. Your arrow is your stylus, and you can interact with it"
    },
    {
      "Time_Start": 2359.7200000000003,
      "Time_End": 2366.7200000000003,
      "Text": " directly. You can see LaunchM is over here. LaunchM is an editor. When you start LaunchM, it"
    },
    {
      "Time_Start": 2366.7200000000003,
      "Time_End": 2372.7200000000003,
      "Text": " says, welcome to your LaunchM demo. If you like LaunchM, you can purchase it at Synergy Solutions"
    },
    {
      "Time_Start": 2372.7200000000003,
      "Time_End": 2377.7200000000003,
      "Text": " website, SyncSolutions.com. Unfortunately, one thing they didn't realize is because this is a"
    },
    {
      "Time_Start": 2377.7200000000003,
      "Time_End": 2382.7200000000003,
      "Text": " demo, you actually have to delete the application, which deletes your preferences for it when you"
    },
    {
      "Time_Start": 2382.7200000000003,
      "Time_End": 2388.7200000000003,
      "Text": " buy it, and then reinstall it. Actually a very frustrating solution for a lot of people. You can"
    },
    {
      "Time_Start": 2388.7200000000003,
      "Time_End": 2393.7200000000003,
      "Text": " set it to be your default launcher. So that's it. During the discovery phase of understanding how"
    },
    {
      "Time_Start": 2393.7200000000003,
      "Time_End": 2400.7200000000003,
      "Text": " the application protects itself, we found out that a NAG flash is welcome to demo at startup. The"
    },
    {
      "Time_Start": 2400.7200000000003,
      "Time_End": 2405.7200000000003,
      "Text": " about says demo, so you can see that by going to the about of the application, just like you're"
    },
    {
      "Time_Start": 2405.7200000000003,
      "Time_End": 2413.7200000000003,
      "Text": " running it on your PalmPilot. It says demo across the top right there. And that's what we figured"
    },
    {
      "Time_Start": 2413.7200000000003,
      "Time_End": 2419.7200000000003,
      "Text": " out it uses to protect itself. Now this is actually a very basic protection. I really want everyone"
    },
    {
      "Time_Start": 2419.7200000000003,
      "Time_End": 2425.7200000000003,
      "Text": " to understand before I begin this part that this is a really good application, and it's worth buying,"
    },
    {
      "Time_Start": 2425.7200000000003,
      "Time_End": 2431.7200000000003,
      "Text": " even though it's a little bit expensive. However, I think it should be protected much more strongly"
    },
    {
      "Time_Start": 2431.7200000000003,
      "Time_End": 2438.7200000000003,
      "Text": " because it's a very good application. So after you've looked at that, you go inside of the method of"
    },
    {
      "Time_Start": 2438.7200000000003,
      "Time_End": 2444.7200000000003,
      "Text": " it, and the method we're going to use is to disassemble it. We're going to use the PalmPilot"
    },
    {
      "Time_Start": 2444.7200000000003,
      "Time_End": 2449.7200000000003,
      "Text": " disassembly program. It's a DOS application, so we run the DOS and hope that the computer doesn't"
    },
    {
      "Time_Start": 2449.7200000000003,
      "Time_End": 2459.7200000000003,
      "Text": " crash. You'll see the directory of information here. I've got the tools, DIS, which is PalmPilot"
    },
    {
      "Time_Start": 2459.7200000000003,
      "Time_End": 2467.7200000000003,
      "Text": " disassembler, PRC to bin, and I've got high note launch and my walkthroughs for this. You run"
    },
    {
      "Time_Start": 2467.7200000000003,
      "Time_End": 2474.7200000000003,
      "Text": " DOS, and you run question mark. There we go. Actually, you run it without the question mark, and"
    },
    {
      "Time_Start": 2474.7200000000003,
      "Time_End": 2479.7200000000003,
      "Text": " you can look at all the command line options for it. It has help. It lets you set the offset you"
    },
    {
      "Time_Start": 2479.7200000000003,
      "Time_End": 2484.7200000000003,
      "Text": " disassemble by, and it lets you set the instructions you use. You can use a custom traps file to view"
    },
    {
      "Time_Start": 2484.7200000000003,
      "Time_End": 2496.7200000000003,
      "Text": " the system traps, but mostly it just works by doing DOS in the application's name. And because"
    },
    {
      "Time_Start": 2496.7200000000003,
      "Time_End": 2506.7200000000003,
      "Text": " they're very tiny programs on the PalmPilot, it actually works rather quickly. Yeah, see, it's"
    },
    {
      "Time_Start": 2506.7200000000003,
      "Time_End": 2512.7200000000003,
      "Text": " working really quickly. It's the quality of Windows right here. There you go. All right."
    },
    {
      "Time_Start": 2512.7200000000003,
      "Time_End": 2520.7200000000003,
      "Text": " Treating all that sophisticated code. While that's working, we'll go back to this side of things."
    },
    {
      "Time_Start": 2520.7200000000003,
      "Time_End": 2527.7200000000003,
      "Text": " Oh, there we go. It's done. Okay. So we're left with the disassembled code in this directory that we"
    },
    {
      "Time_Start": 2527.7200000000003,
      "Time_End": 2534.7200000000003,
      "Text": " can look at. That's the source file right here. Now we're going to go into the method that you would"
    },
    {
      "Time_Start": 2534.7200000000003,
      "Time_End": 2541.7200000000003,
      "Text": " use to view this application's code. The first thing is, you have to take a PalmPilot application"
    },
    {
      "Time_Start": 2541.7200000000003,
      "Time_End": 2547.7200000000003,
      "Text": " and divide it into its resources. So you go ahead and go back to your MS-DOS prompt, and you use"
    },
    {
      "Time_Start": 2548.7200000000003,
      "Time_End": 2557.7200000000003,
      "Text": " which lets you separate out the resources that you see in your PalmPilot, and you use launch them."
    },
    {
      "Time_Start": 2557.7200000000003,
      "Time_End": 2564.7200000000003,
      "Text": " And it just extracts an entire text file of all the resources inside your Palm. So now you can see we"
    },
    {
      "Time_Start": 2564.7200000000003,
      "Time_End": 2572.7200000000003,
      "Text": " have here alerts in this section. We have bitmaps in this section, and then we also have forms and"
    },
    {
      "Time_Start": 2572.7200000000003,
      "Time_End": 2578.7200000000003,
      "Text": " strings that make up the application. So what you would normally do in this application is you'd search"
    },
    {
      "Time_Start": 2578.7200000000003,
      "Time_End": 2588.7200000000003,
      "Text": " it for the form that's your about. The about nag is number 270. Everything in the PalmPilot is very"
    },
    {
      "Time_Start": 2588.7200000000003,
      "Time_End": 2593.7200000000003,
      "Text": " specific, very documented, very viewable, and very public, which makes it an easy platform to learn to"
    },
    {
      "Time_Start": 2593.7200000000003,
      "Time_End": 2603.7200000000003,
      "Text": " program on. So we'll look at alert number 270 here, which is this one at the top. We'll use UltraEdit."
    },
    {
      "Time_Start": 2603.7200000000003,
      "Time_End": 2610.7200000000003,
      "Text": " Highly recommended. And we'll see that this is exactly what we saw on our screen. Launch them demo."
    },
    {
      "Time_Start": 2610.7200000000003,
      "Time_End": 2615.7200000000003,
      "Text": " Welcome to the demo of launch them. If you like launch them, you can purchase it. It's in solutions."
    },
    {
      "Time_Start": 2615.7200000000003,
      "Time_End": 2619.7200000000003,
      "Text": " That's the way the PalmPilot works. Everything's embedded in the PRC file, and everything can be"
    },
    {
      "Time_Start": 2619.7200000000003,
      "Time_End": 2628.7200000000003,
      "Text": " extracted. In the interest of time, you search the application for that. The application, you can"
    },
    {
      "Time_Start": 2628.7200000000003,
      "Time_End": 2633.7200000000003,
      "Text": " actually see that it occurs at address 376A. You can actually see that it shows the form, and it"
    },
    {
      "Time_Start": 2633.7200000000003,
      "Time_End": 2639.7200000000003,
      "Text": " uses a knit form to display the about. It actually displays the alert in the same manner. And you can"
    },
    {
      "Time_Start": 2639.7200000000003,
      "Time_End": 2646.7200000000003,
      "Text": " skip the nag, and you can modify one byte to do that. This is a good commercial application, like I"
    },
    {
      "Time_Start": 2646.7200000000003,
      "Time_End": 2653.7200000000003,
      "Text": " emphasized. That's very simple protection for your PalmPilot. There's an intermediate protection for"
    },
    {
      "Time_Start": 2653.7200000000003,
      "Time_End": 2658.7200000000003,
      "Text": " your PalmPilot. I'll also point this out as an example. HighNote uses a great protection scheme."
    },
    {
      "Time_Start": 2658.7200000000003,
      "Time_End": 2665.7200000000003,
      "Text": " It doesn't slow down your PalmPilot. It doesn't slow down application. It uses a three-section key,"
    },
    {
      "Time_Start": 2665.7200000000003,
      "Time_End": 2671.7200000000003,
      "Text": " and it not only checks it during the registration, it also checks it midway through using the program"
    },
    {
      "Time_Start": 2671.7200000000003,
      "Time_End": 2677.7200000000003,
      "Text": " and forbids you from using it if there's not the letter H at this one particular place inside your code."
    },
    {
      "Time_Start": 2677.7200000000003,
      "Time_End": 2683.7200000000003,
      "Text": " That, to me, is a good example of the balance between the sophistication of the protection and the"
    },
    {
      "Time_Start": 2683.7200000000003,
      "Time_End": 2691.7200000000003,
      "Text": " simplicity of the protection and the fact that we like our programs to run quickly."
    },
    {
      "Time_Start": 2691.7200000000003,
      "Time_End": 2697.7200000000003,
      "Text": " It's by a company called Cyclos. It's a great application. It's an alternative to BrainFarce. It lets you"
    },
    {
      "Time_Start": 2697.7200000000003,
      "Time_End": 2703.7200000000003,
      "Text": " put text and pictures into the same outlines that you do. It has a nag. It asks you to register."
    },
    {
      "Time_Start": 2703.7200000000003,
      "Time_End": 2710.7200000000003,
      "Text": " If you register bad, it tells you invalid entry. It has the invalid entry alert inside of it."
    },
    {
      "Time_Start": 2710.7200000000003,
      "Time_End": 2715.7200000000003,
      "Text": " It also has a form that you see at startup, and it also has a registration form."
    },
    {
      "Time_Start": 2715.7200000000003,
      "Time_End": 2721.7200000000003,
      "Text": " Like I mentioned, this is a very smart protection. You take your key in, and about eight lines later,"
    },
    {
      "Time_Start": 2721.7200000000003,
      "Time_End": 2727.7200000000003,
      "Text": " it says, oh, CRC 16 calc block. Let's see if the two codes match. It says yes."
    },
    {
      "Time_Start": 2727.7200000000003,
      "Time_End": 2732.7200000000003,
      "Text": " It's only actually checking the first segment of your code until later when you try to run the program,"
    },
    {
      "Time_Start": 2732.7200000000003,
      "Time_End": 2738.7200000000003,
      "Text": " and it actually checks the second segment, won't let you create any new items if your code's not proper."
    },
    {
      "Time_Start": 2738.7200000000003,
      "Time_End": 2744.7200000000003,
      "Text": " So basically, in terms of preventing people from cracking the application and matching the security"
    },
    {
      "Time_Start": 2744.7200000000003,
      "Time_End": 2749.7200000000003,
      "Text": " and the functionality of shareware with it, this actually is a good protection because people think"
    },
    {
      "Time_Start": 2749.7200000000003,
      "Time_End": 2754.7200000000003,
      "Text": " they've patched it. Suddenly, the thing doesn't work. They think it's ruined."
    },
    {
      "Time_Start": 2754.7200000000003,
      "Time_End": 2761.7200000000003,
      "Text": " It's quite effective to obfuscate, actually, your code and the intent of it."
    },
    {
      "Time_Start": 2761.7200000000003,
      "Time_End": 2767.7200000000003,
      "Text": " I want to go over protection ideas. There's a tradeoff between complexity and speed, which I've been talking about."
    },
    {
      "Time_Start": 2767.7200000000003,
      "Time_End": 2772.7200000000003,
      "Text": " Palm pilot programs need good protection. They don't need protection like Liberty is,"
    },
    {
      "Time_Start": 2772.7200000000003,
      "Time_End": 2778.7200000000003,
      "Text": " which actually prevents you from running the program at its peak need."
    },
    {
      "Time_Start": 2778.7200000000003,
      "Time_End": 2784.7200000000003,
      "Text": " To give you an example of the way Liberty, the Palm pilot Game Boy emulator, is protected,"
    },
    {
      "Time_Start": 2784.7200000000003,
      "Time_End": 2792.7200000000003,
      "Text": " it uses seven code segments. It uses four encrypted segments. It encrypts it against its own key database."
    },
    {
      "Time_Start": 2792.7200000000003,
      "Time_End": 2798.7200000000003,
      "Text": " And then, just to prevent you from doing what we've just done up here on screen and disassembling it,"
    },
    {
      "Time_Start": 2798.7200000000003,
      "Time_End": 2806.7200000000003,
      "Text": " it actually uses an illegal instruction by 3Com, a two-byte instruction, to prevent you from disassembling it."
    },
    {
      "Time_Start": 2806.7200000000003,
      "Time_End": 2813.7200000000003,
      "Text": " But it uses it 1,100 times inside of its code. So you can imagine the heft that it's added to the application"
    },
    {
      "Time_Start": 2813.7200000000003,
      "Time_End": 2818.7200000000003,
      "Text": " and to the actual function of it."
    },
    {
      "Time_Start": 2818.7200000000003,
      "Time_End": 2824.7200000000003,
      "Text": " Future exploits for the Palm pilot, things to watch out for. This is nice. This is from the 3Com website."
    },
    {
      "Time_Start": 2824.7200000000003,
      "Time_End": 2829.7200000000003,
      "Text": " I thought it was good because it's like we've all graduated."
    },
    {
      "Time_Start": 2829.7200000000003,
      "Time_End": 2834.7200000000003,
      "Text": " People will exploit conduits. Anyone can write a conduit. A conduit sits in your hot sink"
    },
    {
      "Time_Start": 2834.7200000000003,
      "Time_End": 2841.7200000000003,
      "Text": " and it coordinates data from your Palm pilot to any executable. Anything. You can write any executable."
    },
    {
      "Time_Start": 2841.7200000000003,
      "Time_End": 2847.7200000000003,
      "Text": " If you use Pocket Quicken or if you use Ultrasoft Money, that's what it does."
    },
    {
      "Time_Start": 2847.7200000000003,
      "Time_End": 2852.7200000000003,
      "Text": " It puts a custom conduit in there. When you hot sink your Palm pilot, it transfers that information to its executable"
    },
    {
      "Time_Start": 2852.7200000000003,
      "Time_End": 2858.7200000000003,
      "Text": " and it writes it to a database. In the case of Ultrasoft Money, it writes it to your Microsoft Money database."
    },
    {
      "Time_Start": 2859.7200000000003,
      "Time_End": 2864.7200000000003,
      "Text": " Conduit is an executable that translates or alters Palm databases during hot sink."
    },
    {
      "Time_Start": 2864.7200000000003,
      "Time_End": 2871.7200000000003,
      "Text": " When you install a conduit, it doesn't ask you. Conduits are DLL files that are hooked into your hot sink."
    },
    {
      "Time_Start": 2871.7200000000003,
      "Time_End": 2877.7200000000003,
      "Text": " It adds the DLL to your Palm directory and makes a registry entry and it uses what's called the notifier DLL"
    },
    {
      "Time_Start": 2877.7200000000003,
      "Time_End": 2881.7200000000003,
      "Text": " for conflict resolution. This is required by 3Com."
    },
    {
      "Time_Start": 2881.7200000000003,
      "Time_End": 2889.7200000000003,
      "Text": " This is where it is actually really weak in that anyone can reset the notifier DLL part of a conduit"
    },
    {
      "Time_Start": 2889.7200000000003,
      "Time_End": 2895.7200000000003,
      "Text": " to make it do anything that it wants. You can take that information, you can dump it out to CCIP,"
    },
    {
      "Time_Start": 2895.7200000000003,
      "Time_End": 2900.7200000000003,
      "Text": " you can put an email in someone's directory that sends all of your Palm pilot information to someone."
    },
    {
      "Time_Start": 2900.7200000000003,
      "Time_End": 2905.7200000000003,
      "Text": " It can interact at the system level of Windows, so you can make it execute a Visual Basic script"
    },
    {
      "Time_Start": 2905.7200000000003,
      "Time_End": 2908.7200000000003,
      "Text": " every time you start up your Internet Explorer window."
    },
    {
      "Time_Start": 2908.7200000000003,
      "Time_End": 2914.7200000000003,
      "Text": " It's dangerous. There's absolutely zero way to protect against it other than being diligent."
    },
    {
      "Time_Start": 2914.7200000000003,
      "Time_End": 2916.7200000000003,
      "Text": " We'll talk about that real quick."
    },
    {
      "Time_Start": 2916.7200000000003,
      "Time_End": 2919.7200000000003,
      "Text": " Write contents to a network location for monitoring."
    },
    {
      "Time_Start": 2921.7200000000003,
      "Time_End": 2926.7200000000003,
      "Text": " Second idea is Trojans. Your Palm pilot, we all love the applications, they're all free."
    },
    {
      "Time_Start": 2926.7200000000003,
      "Time_End": 2931.7200000000003,
      "Text": " Palm users will load almost anything if it's free on their Palm pilots."
    },
    {
      "Time_Start": 2931.7200000000003,
      "Time_End": 2936.7200000000003,
      "Text": " Little dancing bugs and taxi cabs and everything else you can imagine."
    },
    {
      "Time_Start": 2937.7200000000003,
      "Time_End": 2943.7200000000003,
      "Text": " If you have Hackmaster on your machine, every time you reset your Palm pilot, it reloads all your hacks."
    },
    {
      "Time_Start": 2943.7200000000003,
      "Time_End": 2946.7200000000003,
      "Text": " Everything hooks in at the system level."
    },
    {
      "Time_Start": 2946.7200000000003,
      "Time_End": 2952.7200000000003,
      "Text": " Basically, if you hot-synced and you tell the Palm pilot that it needs to reset after hot-sync"
    },
    {
      "Time_Start": 2952.7200000000003,
      "Time_End": 2958.7200000000003,
      "Text": " and then you reset it, whatever you just put in is loaded in your Palm and working at the system level."
    },
    {
      "Time_Start": 2958.7200000000003,
      "Time_End": 2963.7200000000003,
      "Text": " You can alter the built-in database types, which is published in the SDK."
    },
    {
      "Time_Start": 2963.7200000000003,
      "Time_End": 2967.7200000000003,
      "Text": " And you can put custom keys in there to track information that people don't see"
    },
    {
      "Time_Start": 2967.7200000000003,
      "Time_End": 2973.7200000000003,
      "Text": " because the PDB files are only viewable by the exact routine inside the PRC file."
    },
    {
      "Time_Start": 2973.7200000000003,
      "Time_End": 2975.7200000000003,
      "Text": " So you can store anything you want in there."
    },
    {
      "Time_Start": 2975.7200000000003,
      "Time_End": 2982.7200000000003,
      "Text": " That's a great idea if you guys want to really protect your information, is to write raw data to a PDB database."
    },
    {
      "Time_Start": 2982.7200000000003,
      "Time_End": 2984.7200000000003,
      "Text": " And you can store your data in someone else's Palm."
    },
    {
      "Time_Start": 2984.7200000000003,
      "Time_End": 2987.7200000000003,
      "Text": " Every database is linked by a creator ID."
    },
    {
      "Time_Start": 2987.7200000000003,
      "Time_End": 2993.7200000000003,
      "Text": " Every time you synchronize, every piece of information is shared with the hot-sync application."
    },
    {
      "Time_Start": 2993.7200000000003,
      "Time_End": 2998.7200000000003,
      "Text": " So you can grab a creator ID off another application, put it on your custom database,"
    },
    {
      "Time_Start": 2998.7200000000003,
      "Time_End": 3000.7200000000003,
      "Text": " write anything you want to that database."
    },
    {
      "Time_Start": 3000.7200000000003,
      "Time_End": 3003.7200000000003,
      "Text": " And when you synchronize next time, it will be available to you on the computer."
    },
    {
      "Time_Start": 3003.7200000000003,
      "Time_End": 3006.7200000000003,
      "Text": " These are how you protect yourself."
    },
    {
      "Time_Start": 3006.7200000000003,
      "Time_End": 3007.7200000000003,
      "Text": " Turn your beam off."
    },
    {
      "Time_Start": 3007.7200000000003,
      "Time_End": 3009.7200000000003,
      "Text": " It's not going to happen now."
    },
    {
      "Time_Start": 3009.7200000000003,
      "Time_End": 3011.7200000000003,
      "Text": " It may not happen next month, but it will happen soon."
    },
    {
      "Time_Start": 3011.7200000000003,
      "Time_End": 3013.7200000000003,
      "Text": " And so we'll take advantage of that."
    },
    {
      "Time_Start": 3014.7200000000003,
      "Time_End": 3016.7200000000003,
      "Text": " And you can imagine walking around DEF CON,"
    },
    {
      "Time_Start": 3016.7200000000003,
      "Time_End": 3019.7200000000003,
      "Text": " you're walking around, all of a sudden everyone's Palm pilots are being reset."
    },
    {
      "Time_Start": 3019.7200000000003,
      "Time_End": 3023.7200000000003,
      "Text": " Some guy's kind of hiding his face in the corner."
    },
    {
      "Time_Start": 3023.7200000000003,
      "Time_End": 3025.7200000000003,
      "Text": " Monitor your hot-sync log."
    },
    {
      "Time_Start": 3025.7200000000003,
      "Time_End": 3029.7200000000003,
      "Text": " All you have to do to monitor your hot-sync log is go to,"
    },
    {
      "Time_Start": 3029.7200000000003,
      "Time_End": 3031.7200000000003,
      "Text": " I won't be able to get it up with the presentation,"
    },
    {
      "Time_Start": 3031.7200000000003,
      "Time_End": 3034.7200000000003,
      "Text": " is to right-click on your hot-sync and say View Log."
    },
    {
      "Time_Start": 3034.7200000000003,
      "Time_End": 3038.7200000000003,
      "Text": " Make sure that nothing's being installed in your directory."
    },
    {
      "Time_Start": 3038.7200000000003,
      "Time_End": 3042.7200000000003,
      "Text": " You can test your applications by using it on the Palm emulator."
    },
    {
      "Time_Start": 3042.7200000000003,
      "Time_End": 3043.7200000000003,
      "Text": " Anyone can get that."
    },
    {
      "Time_Start": 3043.7200000000003,
      "Time_End": 3044.7200000000003,
      "Text": " Go to 3Com's site."
    },
    {
      "Time_Start": 3044.7200000000003,
      "Time_End": 3046.7200000000003,
      "Text": " Search for POSC."
    },
    {
      "Time_Start": 3046.7200000000003,
      "Time_End": 3051.7200000000003,
      "Text": " And you should check your hot-sync properties for rogue conduits."
    },
    {
      "Time_Start": 3051.7200000000003,
      "Time_End": 3054.7200000000003,
      "Text": " Conduits, again, can pass any information anywhere."
    },
    {
      "Time_Start": 3054.7200000000003,
      "Time_End": 3057.7200000000003,
      "Text": " They pass to a Windows executable."
    },
    {
      "Time_Start": 3057.7200000000003,
      "Time_End": 3062.7200000000003,
      "Text": " In the future, you're going to see Palm viruses,"
    },
    {
      "Time_Start": 3062.7200000000003,
      "Time_End": 3065.7200000000003,
      "Text": " which will actually be Trojans and which will be taking information"
    },
    {
      "Time_Start": 3065.7200000000003,
      "Time_End": 3071.7200000000003,
      "Text": " and transporting around using conduits and using the hot-sync vulnerabilities."
    },
    {
      "Time_Start": 3071.7200000000003,
      "Time_End": 3076.7200000000003,
      "Text": " SanTech has a Palm virus protection that they were supposed to release a month ago."
    },
    {
      "Time_Start": 3076.7200000000003,
      "Time_End": 3077.7200000000003,
      "Text": " I've seen a beta of it."
    },
    {
      "Time_Start": 3077.7200000000003,
      "Time_End": 3079.7200000000003,
      "Text": " It's not out yet, but it's really nice."
    },
    {
      "Time_Start": 3079.7200000000003,
      "Time_End": 3083.7200000000003,
      "Text": " It lets you actually watch what's being hot-synced back and forth between your Palm."
    },
    {
      "Time_Start": 3083.7200000000003,
      "Time_End": 3087.7200000000003,
      "Text": " It lets you authorize conduits that are to be hot-synced."
    },
    {
      "Time_Start": 3087.7200000000003,
      "Time_End": 3091.7200000000003,
      "Text": " If you want to write up this, some of the programs we've talked about,"
    },
    {
      "Time_Start": 3091.7200000000003,
      "Time_End": 3094.7200000000003,
      "Text": " like Pilot Disassembler, which is a free disassembler,"
    },
    {
      "Time_Start": 3094.7200000000003,
      "Time_End": 3097.7200000000003,
      "Text": " are available here at this website."
    },
    {
      "Time_Start": 3097.7200000000003,
      "Time_End": 3099.7200000000003,
      "Text": " Thank you guys very, very much for sitting in this."
    },
    {
      "Time_Start": 3099.7200000000003,
      "Time_End": 3103.7200000000003,
      "Text": " I want to take questions for about three minutes, if anyone has any,"
    },
    {
      "Time_Start": 3103.7200000000003,
      "Time_End": 3105.7200000000003,
      "Text": " and go over some of the different Palm aspects."
    },
    {
      "Time_Start": 3105.7200000000003,
      "Time_End": 3107.7200000000003,
      "Text": " Yes, sir?"
    },
    {
      "Time_Start": 3107.7200000000003,
      "Time_End": 3111.7200000000003,
      "Text": " This will be emailed to Dark Tangent afterwards."
    },
    {
      "Time_Start": 3111.7200000000003,
      "Time_End": 3115.7200000000003,
      "Text": " It will be on the DEF CON site, and it will also be here later this evening,"
    },
    {
      "Time_Start": 3115.7200000000003,
      "Time_End": 3117.7200000000003,
      "Text": " so you'll be able to get it tomorrow morning if you want to get it."
    },
    {
      "Time_Start": 3117.7200000000003,
      "Time_End": 3120.7200000000003,
      "Text": " Yes?"
    },
    {
      "Time_Start": 3120.7200000000003,
      "Time_End": 3123.7200000000003,
      "Text": " I recommend using a program called JAWS Memo."
    },
    {
      "Time_Start": 3124.7200000000003,
      "Time_End": 3128.7200000000003,
      "Text": " It's 4,096-bit encryption."
    },
    {
      "Time_Start": 3128.7200000000003,
      "Time_End": 3132.7200000000003,
      "Text": " I also tend to be, and Bruce and I talked the other day,"
    },
    {
      "Time_Start": 3132.7200000000003,
      "Time_End": 3136.7200000000003,
      "Text": " a fan of Blowfish Encryption, and you can use..."
    },
    {
      "Time_Start": 3136.7200000000003,
      "Time_End": 3139.7200000000003,
      "Text": " What's the name of the application?"
    },
    {
      "Time_Start": 3139.7200000000003,
      "Time_End": 3145.7200000000003,
      "Text": " Oh, CryptPad, which actually is an encrypted memo pad that uses Blowfish Encryption."
    },
    {
      "Time_Start": 3145.7200000000003,
      "Time_End": 3147.7200000000003,
      "Text": " Both of them are really good."
    },
    {
      "Time_Start": 3147.7200000000003,
      "Time_End": 3152.7200000000003,
      "Text": " Don't choose something like SAM, which is by a Swedish developer."
    },
    {
      "Time_Start": 3152.7200000000003,
      "Time_End": 3155.7200000000003,
      "Text": " It can use up to a one-bit key, so you're thinking,"
    },
    {
      "Time_Start": 3155.7200000000003,
      "Time_End": 3159.7200000000003,
      "Text": " oh, I want one byte to protect my information."
    },
    {
      "Time_Start": 3159.7200000000003,
      "Time_End": 3162.7200000000003,
      "Text": " I recommend something stronger like the Blowfish Encryption."
    },
    {
      "Time_Start": 3162.7200000000003,
      "Time_End": 3164.7200000000003,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 3164.7200000000003,
      "Time_End": 3167.7200000000003,
      "Text": " All right, thank you guys very, very much, and have a good day."
    },
    {
      "Time_Start": 3167.7200000000003,
      "Time_End": 3168.7200000000003,
      "Text": " Look for the information up there."
    },
    {
      "Time_Start": 3168.7200000000003,
      "Time_End": 3170.7200000000003,
      "Text": " Thank you."
    },
    {
      "Time_Start": 3170.7200000000003,
      "Time_End": 3172.7200000000003,
      "Text": " Thank you."
    }
  ]
}