{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n It's too much. It's too much. In any case, first of all, I've got to say it's great to be back, but I have to give my own sly attempt at humor here."
    },
    {
      "Time_Start": 15.0,
      "Time_End": 32.0,
      "Text": " Okay, they got rid of the Marlboro Man, they got rid of, oh god, what's the, they got rid of the Marlboro Man, Spuds McKenzie died last year, and of course, the guy there, Joe Camel is gone, and now the Taco Bell dog. I mean, what's going on? I mean, come on."
    },
    {
      "Time_Start": 32.0,
      "Time_End": 50.0,
      "Text": " You know, look, that was my weak attempt at humor. Okay, as I always preface my comments, you guys know, when it comes to being a software, hardware expert, I know nothing. I just learned how to attach files to my email, okay? So I'm thinking I'm a hot shit now on the computer, okay?"
    },
    {
      "Time_Start": 50.0,
      "Time_End": 72.0,
      "Text": " So you guys know I am not the guy to ask the technical sort of questions about. My specialty is information use and information abuse. Previous years, last year, we showed how you can steal somebody's identity. The year before that, we took apart an actress, if you guys remember, we put her whole life up on the screen."
    },
    {
      "Time_Start": 72.0,
      "Time_End": 95.0,
      "Text": " And I've got to say something. Every time I've come to speak on these things, because you know me, I put up the unvarnished information. I always think, well, maybe I should etch out two digits of the SSN or hide the phone number, whatever. And I always tell you, well, I don't believe in censorship, so how can I come here at DEF CON and then censor my own talk?"
    },
    {
      "Time_Start": 95.0,
      "Time_End": 113.0,
      "Text": " And I've always asked you guys, don't go mess these people's lives up, because they're not bad people. They're public figures. That's why we use them. And I want to say, to DEF CON's credit, and you guys' credit, I have never gotten any reports that anybody I've used as an example up here, you guys have not messed their lives up."
    },
    {
      "Time_Start": 113.0,
      "Time_End": 125.0,
      "Text": " So I want law enforcement and whoever else to understand that most of you guys are solid citizens. You just are interested in things being open and keeping them open. But I appreciate that."
    },
    {
      "Time_Start": 126.0,
      "Time_End": 153.0,
      "Text": " Okay. I've stroked you guys enough. So what am I here talking about right now? First, the other thing before I begin, the book I'm about to talk to you about, the excerpt about ten steps you can take to protect your privacy, I need to consult with some people who are bona fide experts on using the Internet and particularly on protecting privacy on the Internet."
    },
    {
      "Time_Start": 153.0,
      "Time_End": 171.0,
      "Text": " I need somebody who's got expertise. It might be somebody at Cult of the Dead Cow. It might be one of you out here. I need to consult with you on that chapter. I will give you credit in the book, either under your hacking name or your real name if you want. And this will be a real opportunity because this will be a big mainstream book."
    },
    {
      "Time_Start": 171.0,
      "Time_End": 187.0,
      "Text": " But I need somebody who is an expert on that. I would appreciate it if you could come to the author table either later today or tomorrow and talk to me about your credentials and whatever because I really need that. Because like I said, I am not the detail expert on that."
    },
    {
      "Time_Start": 187.0,
      "Time_End": 205.0,
      "Text": " Okay. Let's go to what I want to talk about. That is ten steps you can take to increase your privacy. I have a book that will be coming out early next year called Privacy Power, How to Drop Out and Stay Out of Big Brother's Databases, A Guide to Privacy Protection in the Information Age."
    },
    {
      "Time_Start": 205.0,
      "Time_End": 227.0,
      "Text": " And let me just give you the concept statement of the book because this frames our whole talk here today. America has become a surveillance society. Private database collectors relentlessly build files on every person and government agencies use our daily activities as a pretext to monitor unsuspecting citizens."
    },
    {
      "Time_Start": 227.0,
      "Time_End": 256.0,
      "Text": " The role awaits the individual who falls outside the norm. The result can be a tax audit, the denial of credit and insurance, or even the scrutiny of law enforcement officials. Privacy Power, How to Drop Out and Stay Out of Big Brother's Databases is the first comprehensive guide to personal privacy protection in the information age. It strips away the veil of secrecy surrounding the database collectors and reveals how they do their dirty work."
    },
    {
      "Time_Start": 256.0,
      "Time_End": 273.0,
      "Text": " The book then outlines a step-by-step plan individuals can follow to reclaim their privacy. Essentially, what I'm going to try to do in this book and give you a taste of in this talk is a way that you can build what we would call privacy firewalls in your own life."
    },
    {
      "Time_Start": 273.0,
      "Time_End": 289.0,
      "Text": " The problem is that at the dawn of the 21st century, there is no way to have absolute privacy. You can have absolute privacy one of two ways. You can go out to the Yukon or head out to Africa and live off the land in a hut, which I don't find to be too appealing."
    },
    {
      "Time_Start": 289.0,
      "Time_End": 313.0,
      "Text": " Or you can go the other extreme, as some of my other books I've written on creating a new identity, and you can create a brand new identity. And then, of course, you have ultimate privacy because the person the computers think you are ain't who you are. But that has a price, too, because it's like your mom says, well, I don't understand, James. Why are you getting mail in the name of Robert P. Yukum? Well, it's hard to explain that."
    },
    {
      "Time_Start": 313.0,
      "Time_End": 333.0,
      "Text": " What happens if Robert P. Yukum gets married? Is it a valid marriage? Whatever. Those are the extremes. Now, for those who are interested in that extreme of the new identity method, when I speak tomorrow, I will be talking in detail about two new books to deal with that, the ID Forger and Fake ID by Mail and Loan."
    },
    {
      "Time_Start": 333.0,
      "Time_End": 354.0,
      "Text": " But what I'm talking about today is we want to live in the 21st century, use our computers, eat at McDonald's, have sex with women who know our name, or men for that matter. To do that requires that we have a certain level of interaction into the society we live in."
    },
    {
      "Time_Start": 355.0,
      "Time_End": 382.0,
      "Text": " So unless we want to go live off the land in Africa or an Indian reservation, and even on an Indian reservation you have documents, or live under a new identity, we have to try to say, is there a way that we can carve out a zone of privacy for ourselves that will allow us to still do all the things we have to do, hold a job, pay taxes, all that stuff, but still keep some personal privacy."
    },
    {
      "Time_Start": 383.0,
      "Time_End": 392.0,
      "Text": " Luckily, as of now, the answer is still yes. And that's what I aim to give you some insight on how to do."
    },
    {
      "Time_Start": 393.0,
      "Time_End": 402.0,
      "Text": " The first step, though, is to know thine enemy. In other words, where is the data, who collects it, who can use it and abuse it, and what's going on?"
    },
    {
      "Time_Start": 402.0,
      "Time_End": 410.0,
      "Text": " Well, let's talk about why has the collection of data expanded so much here lately."
    },
    {
      "Time_Start": 411.0,
      "Time_End": 417.0,
      "Text": " Well, private industry has one reason they want your personal information. The government has a different reason."
    },
    {
      "Time_Start": 417.0,
      "Time_End": 425.0,
      "Text": " With private industry, the more I know about you, the easier it is for me to sell you things, for me to make a profit."
    },
    {
      "Time_Start": 426.0,
      "Time_End": 434.0,
      "Text": " So private industry's sole interest in your personal data is profit. Simple as that."
    },
    {
      "Time_Start": 435.0,
      "Time_End": 443.0,
      "Text": " Look, even me, I'm a writer. I want you to buy my books. The more I know about you, the more easier it might be for me to get you to buy one of my books."
    },
    {
      "Time_Start": 443.0,
      "Time_End": 447.0,
      "Text": " Well, scale that up a million fold, that's what big, bad corporation does."
    },
    {
      "Time_Start": 448.0,
      "Time_End": 457.0,
      "Text": " Now, all corporations aren't bad, most of them are big, but I'm not saying big, bad corporation means the company's bad, meaning their data collection and protection procedures might be very bad."
    },
    {
      "Time_Start": 458.0,
      "Time_End": 466.0,
      "Text": " That is why the corporations have an interest in you having as little privacy protection for your personal information as possible,"
    },
    {
      "Time_Start": 466.0,
      "Time_End": 475.0,
      "Text": " because their goal is to know as much as they can about you, use that to make their sale, then take that very data about you,"
    },
    {
      "Time_Start": 476.0,
      "Time_End": 480.0,
      "Text": " and make a second killing by selling it to somebody else, who then will use it to sell you something."
    },
    {
      "Time_Start": 481.0,
      "Time_End": 486.0,
      "Text": " So that's private industry. Private industry's interest in you having no privacy is profit."
    },
    {
      "Time_Start": 487.0,
      "Time_End": 490.0,
      "Text": " What is the government's interest? Well, what does the government do?"
    },
    {
      "Time_Start": 490.0,
      "Time_End": 496.0,
      "Text": " Well, what does the government do? It does two things. It regulates and it controls."
    },
    {
      "Time_Start": 497.0,
      "Time_End": 508.0,
      "Text": " Control is meaning they won't let us riot in here, because if we riot in here, the Las Vegas Metropolitan Police will come in very quickly and will have us spend the night someplace other than the hotel."
    },
    {
      "Time_Start": 509.0,
      "Time_End": 518.0,
      "Text": " So that is control. Control can be law enforcement, it can be anything that curtails your ability to do whatever it is that you want to do."
    },
    {
      "Time_Start": 518.0,
      "Time_End": 527.0,
      "Text": " The second motive that government has for having your personal data, as much of it as possible, is to regulate you."
    },
    {
      "Time_Start": 528.0,
      "Time_End": 533.0,
      "Text": " Regulation can be anything from, you want a driver's license, you must do X, Y, and Z."
    },
    {
      "Time_Start": 534.0,
      "Time_End": 536.0,
      "Text": " If you want to build a house, you must get a building permit."
    },
    {
      "Time_Start": 537.0,
      "Time_End": 542.0,
      "Text": " You will be allowed, remember there was a time when American citizens, private citizens, couldn't own gold."
    },
    {
      "Time_Start": 542.0,
      "Time_End": 548.0,
      "Text": " I mean, it made no sense. Why can't I own gold? Gold is a rock. If I can buy gold or find it, shouldn't I be able to own it?"
    },
    {
      "Time_Start": 549.0,
      "Time_End": 558.0,
      "Text": " For some reason, the big bad government said, you can't have gold. That was actually a crime, to have private ownership of gold until, I think, the late 1960s or early 1970s."
    },
    {
      "Time_Start": 559.0,
      "Time_End": 562.0,
      "Text": " So the government's interest is control and regulation."
    },
    {
      "Time_Start": 563.0,
      "Time_End": 576.0,
      "Text": " To that end, then the government wants to expand its knowledge of your activities through any method it can to get more information, to enable it to control and regulate you more."
    },
    {
      "Time_Start": 577.0,
      "Time_End": 582.0,
      "Text": " So these are the two forces that drive why they want to collect the data."
    },
    {
      "Time_Start": 582.0,
      "Time_End": 592.0,
      "Text": " And so you have to understand that each agency, meaning be they a government agency or a private agency, they have a different reason why they want to destroy your privacy."
    },
    {
      "Time_Start": 593.0,
      "Time_End": 596.0,
      "Text": " But in the end, the net result is the same."
    },
    {
      "Time_Start": 597.0,
      "Time_End": 603.0,
      "Text": " So let's talk about how this changes the playing field before we start talking about who knows what."
    },
    {
      "Time_Start": 604.0,
      "Time_End": 607.0,
      "Text": " You could go in to buy a car, and I always use this as an example."
    },
    {
      "Time_Start": 608.0,
      "Time_End": 616.0,
      "Text": " Usually one of two things. Car dealers have gotten in a lot of trouble with the law over this, but this is what they do, and unfortunately the law is kind of murky."
    },
    {
      "Time_Start": 617.0,
      "Time_End": 624.0,
      "Text": " You go in to buy a car, so you're talking to the guy, whatever, he sees you drive up, and he's like, well, we're having a contest, we're giving away such and such, would you like to enter?"
    },
    {
      "Time_Start": 625.0,
      "Time_End": 628.0,
      "Text": " So he gives you a little slip of paper, and you fill out your name and address and whatever."
    },
    {
      "Time_Start": 629.0,
      "Time_End": 632.0,
      "Text": " And then he takes that, he says, okay, thanks, and then he says, well, would you like to take a test drive?"
    },
    {
      "Time_Start": 633.0,
      "Time_End": 636.0,
      "Text": " Of course, to do that, you've got to show him your license, and usually they write something down."
    },
    {
      "Time_Start": 637.0,
      "Time_End": 642.0,
      "Text": " You're out test driving a car, whatever, well, whilst you're out test driving a car, they're back there pulling your credit report."
    },
    {
      "Time_Start": 643.0,
      "Time_End": 647.0,
      "Text": " They're finding out, one, can this guy buy a car if he wants to buy a car?"
    },
    {
      "Time_Start": 648.0,
      "Time_End": 651.0,
      "Text": " Can he finance a car if he wants to finance a car?"
    },
    {
      "Time_Start": 652.0,
      "Time_End": 656.0,
      "Text": " And how much is he in hock, and how much might I be able to sell him?"
    },
    {
      "Time_Start": 657.0,
      "Time_End": 661.0,
      "Text": " So then you come back, and you're thinking, yeah, I might like this car, but blah, blah, blah."
    },
    {
      "Time_Start": 661.0,
      "Time_End": 665.0,
      "Text": " Well, the problem is, now when you come back, the playing field has been changed."
    },
    {
      "Time_Start": 666.0,
      "Time_End": 674.0,
      "Text": " Because unlike when you walked in, where he didn't know anything about your wants and desires and needs until you told him,"
    },
    {
      "Time_Start": 675.0,
      "Time_End": 682.0,
      "Text": " now he knows, hey, Joe College makes $65,000 a year, he has four gold visa accounts,"
    },
    {
      "Time_Start": 683.0,
      "Time_End": 690.0,
      "Text": " he just paid off his previous car loan, and he owns a home, and is married, and his wife works."
    },
    {
      "Time_Start": 691.0,
      "Time_End": 696.0,
      "Text": " Now he's got information that he can use to manipulate your buying behavior."
    },
    {
      "Time_Start": 697.0,
      "Time_End": 700.0,
      "Text": " In other words, the playing field has been changed."
    },
    {
      "Time_Start": 701.0,
      "Time_End": 704.0,
      "Text": " This is the danger that we face."
    },
    {
      "Time_Start": 705.0,
      "Time_End": 710.0,
      "Text": " And how did he do that? Because he was able to access deeply personal information,"
    },
    {
      "Time_Start": 711.0,
      "Time_End": 715.0,
      "Text": " some of the most sensitive information about you, your credit report, without your authorization."
    },
    {
      "Time_Start": 716.0,
      "Time_End": 719.0,
      "Text": " You came in and took a test drive. I'll give you a little experience I had."
    },
    {
      "Time_Start": 719.0,
      "Time_End": 724.0,
      "Text": " I went to the dentist in California when I was visiting somebody there a few months ago,"
    },
    {
      "Time_Start": 725.0,
      "Time_End": 733.0,
      "Text": " and the dentist was a dentist who pulled a credit report on every patient who walked in the office."
    },
    {
      "Time_Start": 734.0,
      "Time_End": 738.0,
      "Text": " You know, when you go to a medical office, and look, I'm not immune to it any more than anybody else is."
    },
    {
      "Time_Start": 739.0,
      "Time_End": 742.0,
      "Text": " You fill out a sheet with your name, your SSN, all that stuff."
    },
    {
      "Time_Start": 743.0,
      "Time_End": 747.0,
      "Text": " I'm standing at the counter, of course, they didn't know that I was John Q. Newman,"
    },
    {
      "Time_Start": 747.0,
      "Time_End": 750.0,
      "Text": " because you guys probably realize that's not the name on the stuff in my wallet."
    },
    {
      "Time_Start": 751.0,
      "Time_End": 755.0,
      "Text": " All of a sudden, I see TransUnion come up on the receptionist screen."
    },
    {
      "Time_Start": 756.0,
      "Time_End": 758.0,
      "Text": " And I said, wait a minute, that's my credit report you just pulled."
    },
    {
      "Time_Start": 759.0,
      "Time_End": 761.0,
      "Text": " And I said, what the hell are you doing?"
    },
    {
      "Time_Start": 762.0,
      "Time_End": 766.0,
      "Text": " And she said, oh, well, it's our policy of our office that we pull the credit report of any new patient."
    },
    {
      "Time_Start": 767.0,
      "Time_End": 769.0,
      "Text": " I said, wait a minute, I'm paying cash for this visit."
    },
    {
      "Time_Start": 770.0,
      "Time_End": 773.0,
      "Text": " She said, well, it's our policy, blah, blah, blah."
    },
    {
      "Time_Start": 773.0,
      "Time_End": 774.0,
      "Text": " And I'm like, wait a minute."
    },
    {
      "Time_Start": 775.0,
      "Time_End": 779.0,
      "Text": " One, you've put a wrong address now on my credit report, which I'm going to have to try to get off,"
    },
    {
      "Time_Start": 780.0,
      "Time_End": 782.0,
      "Text": " which is a, if you'll pardon my French, a bitch to do."
    },
    {
      "Time_Start": 783.0,
      "Time_End": 790.0,
      "Text": " And two, this is, just because you put this boilerplate in the thing I signed, that is not enough."
    },
    {
      "Time_Start": 791.0,
      "Time_End": 792.0,
      "Text": " Because I am paying cash."
    },
    {
      "Time_Start": 793.0,
      "Time_End": 795.0,
      "Text": " You did not ask me, are you going to be financing this?"
    },
    {
      "Time_Start": 796.0,
      "Time_End": 797.0,
      "Text": " Therefore, we have a right to do this."
    },
    {
      "Time_Start": 798.0,
      "Time_End": 802.0,
      "Text": " Well, to make a long story short, you know me, I'm not going to walk away without satisfaction."
    },
    {
      "Time_Start": 803.0,
      "Time_End": 806.0,
      "Text": " Well, I showed the, I told the dentist, I said, let me talk to your boss."
    },
    {
      "Time_Start": 807.0,
      "Time_End": 808.0,
      "Text": " And I explained to him, you know, I could go sue you over this."
    },
    {
      "Time_Start": 809.0,
      "Time_End": 813.0,
      "Text": " Because I said, you violated a bunch of laws, Fair Credit Reporting Act, a bunch of other things."
    },
    {
      "Time_Start": 814.0,
      "Time_End": 817.0,
      "Text": " And then I showed him, because I happened to have a copy of Forbes magazine,"
    },
    {
      "Time_Start": 818.0,
      "Time_End": 822.0,
      "Text": " where I worked with Adam Penenberg, who's here today, on what we can uncover with just his name."
    },
    {
      "Time_Start": 823.0,
      "Time_End": 825.0,
      "Text": " And I showed him this article, and then he was kind of surprised."
    },
    {
      "Time_Start": 826.0,
      "Time_End": 827.0,
      "Text": " I said, well, I'll be back tomorrow."
    },
    {
      "Time_Start": 828.0,
      "Time_End": 832.0,
      "Text": " Tomorrow I came back with his credit report, this 12 pages long."
    },
    {
      "Time_Start": 833.0,
      "Time_End": 839.0,
      "Text": " This is not the credit report on him that is the second kind of credit report, the kind that contains everything."
    },
    {
      "Time_Start": 840.0,
      "Time_End": 842.0,
      "Text": " If you're borrowing over $50,000."
    },
    {
      "Time_Start": 843.0,
      "Time_End": 848.0,
      "Text": " Not only did I have his name in SSN, I had the name in SSN of his wife, of his children,"
    },
    {
      "Time_Start": 849.0,
      "Time_End": 850.0,
      "Text": " of the people who lived in the house before he did."
    },
    {
      "Time_Start": 851.0,
      "Time_End": 852.0,
      "Text": " I had his mortgage balance."
    },
    {
      "Time_Start": 853.0,
      "Time_End": 857.0,
      "Text": " I had how much he owed on his cars, how much he owed on the loans, on his professional practice."
    },
    {
      "Time_Start": 858.0,
      "Time_End": 859.0,
      "Text": " Quite frankly, he was flabbergasted."
    },
    {
      "Time_Start": 859.0,
      "Time_End": 862.0,
      "Text": " Then he said to me, oh, I guess I will have to talk to my accountant about this."
    },
    {
      "Time_Start": 863.0,
      "Time_End": 864.0,
      "Text": " He was quite concerned that I found all this out."
    },
    {
      "Time_Start": 865.0,
      "Time_End": 866.0,
      "Text": " I said, why?"
    },
    {
      "Time_Start": 867.0,
      "Time_End": 868.0,
      "Text": " You didn't care about my privacy."
    },
    {
      "Time_Start": 869.0,
      "Time_End": 870.0,
      "Text": " Why should you worry about yours?"
    },
    {
      "Time_Start": 871.0,
      "Time_End": 872.0,
      "Text": " Okay, so this is my point."
    },
    {
      "Time_Start": 873.0,
      "Time_End": 874.0,
      "Text": " So first, thank you."
    },
    {
      "Time_Start": 881.0,
      "Time_End": 886.0,
      "Text": " So, step one, in any war, because it is a battle for personal privacy,"
    },
    {
      "Time_Start": 886.0,
      "Time_End": 890.0,
      "Text": " because they will sell out your data to the cheapest bidder."
    },
    {
      "Time_Start": 891.0,
      "Time_End": 898.0,
      "Text": " Prisoners in Texas process, who have been convicted of rape, process catalog orders, book airline reservations."
    },
    {
      "Time_Start": 899.0,
      "Time_End": 903.0,
      "Text": " Murderers right now could be reconciling your credit card charges."
    },
    {
      "Time_Start": 904.0,
      "Time_End": 908.0,
      "Text": " Because the generals in the war for personal privacy have one goal."
    },
    {
      "Time_Start": 909.0,
      "Time_End": 911.0,
      "Text": " Maximize profits at any cost."
    },
    {
      "Time_Start": 912.0,
      "Time_End": 922.0,
      "Text": " And if that means I use somebody who has been convicted of rape to process a woman's health clinic's billing records, I'll damn well do so."
    },
    {
      "Time_Start": 923.0,
      "Time_End": 928.0,
      "Text": " So the first step in building a privacy firewall is to understand, this is a battle."
    },
    {
      "Time_Start": 929.0,
      "Time_End": 930.0,
      "Text": " It's a battle you have to join."
    },
    {
      "Time_Start": 931.0,
      "Time_End": 935.0,
      "Text": " If you want some privacy, you have to say, I am going to seize my privacy and take it."
    },
    {
      "Time_Start": 936.0,
      "Time_End": 940.0,
      "Text": " So let's talk about, like I said, the first step is to know thine enemy."
    },
    {
      "Time_Start": 941.0,
      "Time_End": 942.0,
      "Text": " In any war, know who your enemy is."
    },
    {
      "Time_Start": 943.0,
      "Time_End": 944.0,
      "Text": " So let's talk about who the enemy is."
    },
    {
      "Time_Start": 945.0,
      "Time_End": 953.0,
      "Text": " In the book, I go through all of the major databases, but I also go through some of the ones you might be surprised exist or don't know too much about."
    },
    {
      "Time_Start": 954.0,
      "Time_End": 959.0,
      "Text": " We all know about the credit bureaus, that kind of stuff, but what about the check verification services?"
    },
    {
      "Time_Start": 960.0,
      "Time_End": 973.0,
      "Text": " In the current supplement to the Limpanis catalog, which we'll have here tomorrow, I have written a catalog piece talking about how check approval services are the new scarlet letter in the 21st century."
    },
    {
      "Time_Start": 974.0,
      "Time_End": 981.0,
      "Text": " At my website, privacypower.com, I have so many people who come to me and say, John, I can't open a bank account any place in this country."
    },
    {
      "Time_Start": 982.0,
      "Time_End": 986.0,
      "Text": " I have to go to check cashing agencies because I can't open an account."
    },
    {
      "Time_Start": 986.0,
      "Time_End": 992.0,
      "Text": " And the reason they can't open an account is because five, ten, three years ago, they had trouble with an account."
    },
    {
      "Time_Start": 993.0,
      "Time_End": 1000.0,
      "Text": " It got closed, and now, that is now reported to a place like Telecheck, Check Verification Incorporated."
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1003.0,
      "Text": " There's a bunch of them, Telecheck, and they can't open a bank account."
    },
    {
      "Time_Start": 1004.0,
      "Time_End": 1005.0,
      "Text": " And it's like, well, wait a minute."
    },
    {
      "Time_Start": 1006.0,
      "Time_End": 1008.0,
      "Text": " This was four or five years ago, sometimes even ten years ago."
    },
    {
      "Time_Start": 1009.0,
      "Time_End": 1012.0,
      "Text": " Well, it's because these now have become the new gatekeepers."
    },
    {
      "Time_Start": 1012.0,
      "Time_End": 1018.0,
      "Text": " If you can't even have a deposit-taking relationship with a bank, we're not talking about credit."
    },
    {
      "Time_Start": 1019.0,
      "Time_End": 1022.0,
      "Text": " We're talking about just being able to deposit and cash paychecks."
    },
    {
      "Time_Start": 1023.0,
      "Time_End": 1028.0,
      "Text": " It's very difficult to exist in this society because essentially, you have to live on a cash basis."
    },
    {
      "Time_Start": 1029.0,
      "Time_End": 1034.0,
      "Text": " Well, now, there are millions of people in this country who now have this scarlet brand on them."
    },
    {
      "Time_Start": 1035.0,
      "Time_End": 1040.0,
      "Text": " So that's one of the new database groups that you don't hear a whole lot about."
    },
    {
      "Time_Start": 1040.0,
      "Time_End": 1044.0,
      "Text": " But they're just as big and potentially even worse than the credit bureaus."
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1051.0,
      "Text": " You can open a bank account with bad credit, but if you have bad stuff at the check verification services,"
    },
    {
      "Time_Start": 1052.0,
      "Time_End": 1057.0,
      "Text": " you may not be able to open a bank account at all and try living on a cash basis."
    },
    {
      "Time_Start": 1058.0,
      "Time_End": 1059.0,
      "Text": " It's difficult and dangerous."
    },
    {
      "Time_Start": 1060.0,
      "Time_End": 1062.0,
      "Text": " Okay, so that's one of the things we talk about."
    },
    {
      "Time_Start": 1063.0,
      "Time_End": 1065.0,
      "Text": " We also go into the law enforcement computer system."
    },
    {
      "Time_Start": 1065.0,
      "Time_End": 1072.0,
      "Text": " When you get pulled over by that cop, do you ever wonder why he takes a few minutes to bring you the ticket back?"
    },
    {
      "Time_Start": 1073.0,
      "Time_End": 1076.0,
      "Text": " Well, that's because he's checking you out 10 ways to Sunday."
    },
    {
      "Time_Start": 1077.0,
      "Time_End": 1082.0,
      "Text": " First of all, most people know that when you get pulled over, you're checked for warrants."
    },
    {
      "Time_Start": 1083.0,
      "Time_End": 1089.0,
      "Text": " Before the cop pulls you over, he checks your license plate against a national stolen vehicle database"
    },
    {
      "Time_Start": 1090.0,
      "Time_End": 1094.0,
      "Text": " and also to see if the car itself is warranted in connection with the crime."
    },
    {
      "Time_Start": 1095.0,
      "Time_End": 1098.0,
      "Text": " That will determine whether or not he comes up to your window nicely"
    },
    {
      "Time_Start": 1099.0,
      "Time_End": 1103.0,
      "Text": " or whether or not it's like, sir, could you turn off the engine and please step outside of the vehicle."
    },
    {
      "Time_Start": 1104.0,
      "Time_End": 1106.0,
      "Text": " It's what we call the felony traffic stop."
    },
    {
      "Time_Start": 1107.0,
      "Time_End": 1110.0,
      "Text": " When that happens and he hasn't come up to you yet,"
    },
    {
      "Time_Start": 1111.0,
      "Time_End": 1114.0,
      "Text": " that means the license plate on your car has got some real bad history to it."
    },
    {
      "Time_Start": 1115.0,
      "Time_End": 1120.0,
      "Text": " Then after he comes up to you and takes your license, he goes back to his car."
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1125.0,
      "Text": " Ever notice why they make it so very clear on a driver's license your birth date?"
    },
    {
      "Time_Start": 1126.0,
      "Time_End": 1132.0,
      "Text": " That's why, because he goes back to his car and the first files he checks are the NCIC Wanted Persons Index."
    },
    {
      "Time_Start": 1133.0,
      "Time_End": 1140.0,
      "Text": " At any given time, there's anywhere from 600,000 to 750,000 people in this country who are wanted for serious crimes."
    },
    {
      "Time_Start": 1141.0,
      "Time_End": 1144.0,
      "Text": " The only warrants that get listed there are misdemeanor and felony warrants"
    },
    {
      "Time_Start": 1145.0,
      "Time_End": 1148.0,
      "Text": " where the issuing jurisdiction will actually pay to have the person brought back."
    },
    {
      "Time_Start": 1148.0,
      "Time_End": 1152.0,
      "Text": " So in other words, unpaid parking tickets may get you a local warrant,"
    },
    {
      "Time_Start": 1153.0,
      "Time_End": 1157.0,
      "Text": " but it won't get you arrested here in Vegas if you've got unpaid parking tickets in San Diego."
    },
    {
      "Time_Start": 1158.0,
      "Time_End": 1160.0,
      "Text": " So those of you guys who are worried about that, chill, okay?"
    },
    {
      "Time_Start": 1161.0,
      "Time_End": 1162.0,
      "Text": " It's not going to happen. Not this weekend."
    },
    {
      "Time_Start": 1163.0,
      "Time_End": 1167.0,
      "Text": " In any case, so he then checks you on the Wanted Persons Index."
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1171.0,
      "Text": " And if there's a match, then he calls up the whole warrant file"
    },
    {
      "Time_Start": 1172.0,
      "Time_End": 1174.0,
      "Text": " to make sure that you actually are the person they want."
    },
    {
      "Time_Start": 1174.0,
      "Time_End": 1179.0,
      "Text": " That's when he comes back and then he's a little less friendly and asks you to please step out the vehicle."
    },
    {
      "Time_Start": 1180.0,
      "Time_End": 1183.0,
      "Text": " But you might think, and that's okay, most of us would agree,"
    },
    {
      "Time_Start": 1184.0,
      "Time_End": 1188.0,
      "Text": " a policeman doing a traffic stop on the street should be able to check if somebody's wanted."
    },
    {
      "Time_Start": 1189.0,
      "Time_End": 1190.0,
      "Text": " That's what we consider a legitimate use."
    },
    {
      "Time_Start": 1191.0,
      "Time_End": 1195.0,
      "Text": " But did you also know, if he wants, he can see if you have a criminal record"
    },
    {
      "Time_Start": 1196.0,
      "Time_End": 1198.0,
      "Text": " of any consequence any place in the United States."
    },
    {
      "Time_Start": 1199.0,
      "Time_End": 1202.0,
      "Text": " There's something called the Interstate Identification Index"
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1206.0,
      "Text": " brought to us, or III as it's known in the law enforcement business,"
    },
    {
      "Time_Start": 1207.0,
      "Time_End": 1209.0,
      "Text": " brought to us by our good friends at the FBI."
    },
    {
      "Time_Start": 1210.0,
      "Time_End": 1214.0,
      "Text": " The FBI about 25 years ago said, you know what, what we need is a central repository"
    },
    {
      "Time_Start": 1215.0,
      "Time_End": 1219.0,
      "Text": " of all criminal conviction information from everywhere within the United States."
    },
    {
      "Time_Start": 1220.0,
      "Time_End": 1223.0,
      "Text": " So we're going to give each state money so that they can create a system"
    },
    {
      "Time_Start": 1224.0,
      "Time_End": 1227.0,
      "Text": " where they forward to us conviction information on a regular basis."
    },
    {
      "Time_Start": 1228.0,
      "Time_End": 1230.0,
      "Text": " Now understand, this is separate and apart from a warrant."
    },
    {
      "Time_Start": 1230.0,
      "Time_End": 1235.0,
      "Text": " This is were you convicted of something 5, 10, 15, 20 years ago."
    },
    {
      "Time_Start": 1236.0,
      "Time_End": 1239.0,
      "Text": " So now we have what's called III, the Interstate Identification Index."
    },
    {
      "Time_Start": 1240.0,
      "Time_End": 1246.0,
      "Text": " In many states, officers on the street can check that to see if you have a criminal record."
    },
    {
      "Time_Start": 1247.0,
      "Time_End": 1248.0,
      "Text": " This is where I have a problem."
    },
    {
      "Time_Start": 1249.0,
      "Time_End": 1253.0,
      "Text": " If you're pulled over for just a traffic stop, for a speeding or a broken taillight or whatever,"
    },
    {
      "Time_Start": 1254.0,
      "Time_End": 1262.0,
      "Text": " should that police officer be able to get into your life to the point of finding out if you have a record?"
    },
    {
      "Time_Start": 1263.0,
      "Time_End": 1265.0,
      "Text": " Or is that an invasion of your privacy?"
    },
    {
      "Time_Start": 1266.0,
      "Time_End": 1271.0,
      "Text": " If you had a record for pot possession or for even selling drugs 20 years ago,"
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1275.0,
      "Text": " now you're an upstanding middle-aged man with kids and you get pulled over,"
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1279.0,
      "Text": " should that cop be able to put that back in your face like it happened yesterday?"
    },
    {
      "Time_Start": 1279.0,
      "Time_End": 1280.0,
      "Text": " I say no."
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1289.0,
      "Text": " But this is part of the battle now that's been created with creating this national database of criminal record."
    },
    {
      "Time_Start": 1290.0,
      "Time_End": 1295.0,
      "Text": " As an aside, you know the Brady Law that allows you to buy a gun with the instant background check?"
    },
    {
      "Time_Start": 1296.0,
      "Time_End": 1298.0,
      "Text": " They never intended it, but if you want to create a new identity,"
    },
    {
      "Time_Start": 1299.0,
      "Time_End": 1305.0,
      "Text": " this allows you to actually make sure that the name and birthdate you've created has no criminal history."
    },
    {
      "Time_Start": 1306.0,
      "Time_End": 1307.0,
      "Text": " Go try to buy a gun."
    },
    {
      "Time_Start": 1307.0,
      "Time_End": 1310.0,
      "Text": " Because right there in the store, if you can buy a gun,"
    },
    {
      "Time_Start": 1311.0,
      "Time_End": 1316.0,
      "Text": " they will have checked III and your state's law enforcement database,"
    },
    {
      "Time_Start": 1317.0,
      "Time_End": 1320.0,
      "Text": " and if it comes back clean, that means the name and birthdate you've created"
    },
    {
      "Time_Start": 1321.0,
      "Time_End": 1324.0,
      "Text": " don't have any warrants out and don't have any serious criminal history."
    },
    {
      "Time_Start": 1325.0,
      "Time_End": 1330.0,
      "Text": " So in a way, by trying to take our privacy away, they've made it easier to create a new identity."
    },
    {
      "Time_Start": 1331.0,
      "Time_End": 1335.0,
      "Text": " I talk about this in Reborn in the USA, the third edition, and a couple of my other books."
    },
    {
      "Time_Start": 1335.0,
      "Time_End": 1339.0,
      "Text": " In any case, that's an aside, but this is how I talk about how things grow."
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1345.0,
      "Text": " Well, state and local police agencies have a similar database like III for what happens in their states."
    },
    {
      "Time_Start": 1346.0,
      "Time_End": 1351.0,
      "Text": " There's also something called the Treasury Enforcement Computer System, or TECS."
    },
    {
      "Time_Start": 1352.0,
      "Time_End": 1356.0,
      "Text": " And I can thank a nameless custom service agent who was here one year"
    },
    {
      "Time_Start": 1357.0,
      "Time_End": 1360.0,
      "Text": " who actually let me go on to TECS and see what TECS can do."
    },
    {
      "Time_Start": 1361.0,
      "Time_End": 1364.0,
      "Text": " If you think NCIC is bad, TECS is even worse."
    },
    {
      "Time_Start": 1365.0,
      "Time_End": 1368.0,
      "Text": " As the customs officer said to me, TECS really is Big Brother."
    },
    {
      "Time_Start": 1369.0,
      "Time_End": 1375.0,
      "Text": " Any time you enter the United States, under the law, because you are technically not inside of the United States,"
    },
    {
      "Time_Start": 1376.0,
      "Time_End": 1378.0,
      "Text": " the Constitution does not apply to you."
    },
    {
      "Time_Start": 1379.0,
      "Time_End": 1383.0,
      "Text": " Ever wonder why customs agents at the border act like they have no fear?"
    },
    {
      "Time_Start": 1384.0,
      "Time_End": 1387.0,
      "Text": " Well, that's because basically, and it's the border or its functional equivalents,"
    },
    {
      "Time_Start": 1388.0,
      "Time_End": 1393.0,
      "Text": " that means if you come back on a flight from London and land at LAX or New York City JFK or SeaTac,"
    },
    {
      "Time_Start": 1393.0,
      "Time_End": 1396.0,
      "Text": " that is the functional equivalent of the border."
    },
    {
      "Time_Start": 1397.0,
      "Time_End": 1402.0,
      "Text": " Because until you pass through customs and immigration, you are technically not in the United States."
    },
    {
      "Time_Start": 1403.0,
      "Time_End": 1405.0,
      "Text": " Which means the Constitution doesn't protect you yet."
    },
    {
      "Time_Start": 1406.0,
      "Time_End": 1410.0,
      "Text": " Now it doesn't mean they can shoot you to death, but I'll tell you, it allows them to do almost anything else they want to do."
    },
    {
      "Time_Start": 1411.0,
      "Time_End": 1416.0,
      "Text": " TECS accesses NCIC, which is run by the FBI."
    },
    {
      "Time_Start": 1417.0,
      "Time_End": 1419.0,
      "Text": " Remember, the customs service is Treasury."
    },
    {
      "Time_Start": 1419.0,
      "Time_End": 1424.0,
      "Text": " IRS, Treasury, Customs, you're crossing the border, you get where I'm going here."
    },
    {
      "Time_Start": 1425.0,
      "Time_End": 1431.0,
      "Text": " Okay, they can check all the records in NCIC, but they can also do a lot of other things."
    },
    {
      "Time_Start": 1432.0,
      "Time_End": 1436.0,
      "Text": " For example, when you drive across the border from Mexico or Canada, if you notice, they're optical readers."
    },
    {
      "Time_Start": 1437.0,
      "Time_End": 1440.0,
      "Text": " They record your license plate number and state."
    },
    {
      "Time_Start": 1441.0,
      "Time_End": 1447.0,
      "Text": " If they wanted to find out, for example, they say, you know what, let's see how many times has John K. Newman crossed the border going to Tijuana."
    },
    {
      "Time_Start": 1447.0,
      "Time_End": 1449.0,
      "Text": " Because maybe I've got a thing for TJ."
    },
    {
      "Time_Start": 1450.0,
      "Time_End": 1453.0,
      "Text": " Well, they could say, well first we need to find out, does he have a car?"
    },
    {
      "Time_Start": 1454.0,
      "Time_End": 1458.0,
      "Text": " So they go and say, well let's see if there are any cars in California, Nevada, Arizona registered to John K. Newman."
    },
    {
      "Time_Start": 1459.0,
      "Time_End": 1461.0,
      "Text": " Or they could check the whole damn country if they wanted to."
    },
    {
      "Time_Start": 1462.0,
      "Time_End": 1464.0,
      "Text": " And then they get a list of cars registered to John K. Newman."
    },
    {
      "Time_Start": 1465.0,
      "Time_End": 1467.0,
      "Text": " Then they could put in my birth date to narrow that down."
    },
    {
      "Time_Start": 1468.0,
      "Time_End": 1472.0,
      "Text": " So now, with just my name, they found that I own a car."
    },
    {
      "Time_Start": 1472.0,
      "Time_End": 1475.0,
      "Text": " Then they can then say, okay, this is the license plate number."
    },
    {
      "Time_Start": 1476.0,
      "Time_End": 1482.0,
      "Text": " Let's run that against text and see how many times we've recorded this car coming across the border."
    },
    {
      "Time_Start": 1483.0,
      "Time_End": 1488.0,
      "Text": " They'll get a printout that'll tell them when and where and what border crossings I've used."
    },
    {
      "Time_Start": 1489.0,
      "Time_End": 1498.0,
      "Text": " So understand, any time you enter the United States, you are put under a level of surveillance that no other free society does."
    },
    {
      "Time_Start": 1498.0,
      "Time_End": 1502.0,
      "Text": " And this is maybe the key thrust I'm trying to make here."
    },
    {
      "Time_Start": 1503.0,
      "Time_End": 1507.0,
      "Text": " As Americans, we still have more rights than almost any other country."
    },
    {
      "Time_Start": 1508.0,
      "Time_End": 1510.0,
      "Text": " But we are the most surveilled and monitored society."
    },
    {
      "Time_Start": 1511.0,
      "Time_End": 1516.0,
      "Text": " There's also another treasury database called FinCEN, Financial Crimes Enforcement Network."
    },
    {
      "Time_Start": 1517.0,
      "Time_End": 1518.0,
      "Text": " Go to their website."
    },
    {
      "Time_Start": 1519.0,
      "Time_End": 1521.0,
      "Text": " They make it clear. They say, we follow the money."
    },
    {
      "Time_Start": 1522.0,
      "Time_End": 1525.0,
      "Text": " Well, I've written a little piece explaining what FinCEN does."
    },
    {
      "Time_Start": 1525.0,
      "Time_End": 1529.0,
      "Text": " Basically, there is always something called the Bank Secrecy Act."
    },
    {
      "Time_Start": 1530.0,
      "Time_End": 1533.0,
      "Text": " And understand, your bank records, there is no expectation of privacy."
    },
    {
      "Time_Start": 1534.0,
      "Time_End": 1542.0,
      "Text": " When they were up here before, in a legal sense, what defines whether an action is private or not is if you have expectation of privacy."
    },
    {
      "Time_Start": 1543.0,
      "Time_End": 1551.0,
      "Text": " And the Supreme Court ruled back in the 70s that when you fill out things like deposit slips, withdrawal orders, write checks, whatever,"
    },
    {
      "Time_Start": 1551.0,
      "Time_End": 1555.0,
      "Text": " there is no expectation of privacy in your banking records."
    },
    {
      "Time_Start": 1556.0,
      "Time_End": 1557.0,
      "Text": " Keep that in mind."
    },
    {
      "Time_Start": 1558.0,
      "Time_End": 1561.0,
      "Text": " Well, the Bank Secrecy Act was updated a couple of years ago."
    },
    {
      "Time_Start": 1562.0,
      "Time_End": 1568.0,
      "Text": " And part of it says that if a bank is used as a dupe for laundering drug money or whatever,"
    },
    {
      "Time_Start": 1569.0,
      "Time_End": 1575.0,
      "Text": " the bank can be held civilly and criminally liable if they have not taken due diligence steps to prevent it."
    },
    {
      "Time_Start": 1576.0,
      "Time_End": 1579.0,
      "Text": " This has led to something called the Suspicious Activity Report."
    },
    {
      "Time_Start": 1579.0,
      "Time_End": 1584.0,
      "Text": " Suspicious Activity Report can be filed by the bank on you for any number of reasons."
    },
    {
      "Time_Start": 1585.0,
      "Time_End": 1586.0,
      "Text": " Maybe they think you take out too much cash."
    },
    {
      "Time_Start": 1587.0,
      "Time_End": 1590.0,
      "Text": " Maybe you bring in a bunch of small bills and exchange them into large bills."
    },
    {
      "Time_Start": 1591.0,
      "Time_End": 1593.0,
      "Text": " Whatever. All they need is to think something is suspicious."
    },
    {
      "Time_Start": 1594.0,
      "Time_End": 1599.0,
      "Text": " To cover their ass, the IRS wants them, the Treasury Department wants them to file the report."
    },
    {
      "Time_Start": 1600.0,
      "Time_End": 1603.0,
      "Text": " That report goes to FinCEN in Detroit."
    },
    {
      "Time_Start": 1604.0,
      "Time_End": 1607.0,
      "Text": " And at that point, all sorts of bad stuff can start happening."
    },
    {
      "Time_Start": 1607.0,
      "Time_End": 1614.0,
      "Text": " By law, you can't be told that report was sent to FinCEN, the Financial Crimes Enforcement Network."
    },
    {
      "Time_Start": 1615.0,
      "Time_End": 1617.0,
      "Text": " When they get that report, a bunch of stuff can start happening."
    },
    {
      "Time_Start": 1618.0,
      "Time_End": 1621.0,
      "Text": " One, your bank accounts and credit accounts and everything else will be put under scrutiny."
    },
    {
      "Time_Start": 1622.0,
      "Time_End": 1623.0,
      "Text": " That's number one."
    },
    {
      "Time_Start": 1624.0,
      "Time_End": 1626.0,
      "Text": " Best case scenario, you might get a tax audit."
    },
    {
      "Time_Start": 1627.0,
      "Time_End": 1634.0,
      "Text": " Worst case scenario, you might find your funds all of a sudden are the subject of a lien or an embargo"
    },
    {
      "Time_Start": 1634.0,
      "Time_End": 1637.0,
      "Text": " because they think you might be somebody that you're not."
    },
    {
      "Time_Start": 1638.0,
      "Time_End": 1641.0,
      "Text": " All of this is done with no due process of law."
    },
    {
      "Time_Start": 1642.0,
      "Time_End": 1643.0,
      "Text": " So that's a new database now."
    },
    {
      "Time_Start": 1644.0,
      "Time_End": 1647.0,
      "Text": " Let's put it this way. The first year they had to do these reports, about 20,000 were filed."
    },
    {
      "Time_Start": 1648.0,
      "Time_End": 1649.0,
      "Text": " Second year, about 50,000."
    },
    {
      "Time_Start": 1650.0,
      "Time_End": 1651.0,
      "Text": " Last year, about 200,000."
    },
    {
      "Time_Start": 1652.0,
      "Time_End": 1654.0,
      "Text": " What do you think is going to happen as time goes on?"
    },
    {
      "Time_Start": 1655.0,
      "Time_End": 1660.0,
      "Text": " Finally, the last new database I'll talk about is something called the National New Hire Database."
    },
    {
      "Time_Start": 1660.0,
      "Time_End": 1663.0,
      "Text": " Bet you guys didn't even hear of that database, but you know what?"
    },
    {
      "Time_Start": 1664.0,
      "Time_End": 1669.0,
      "Text": " Unless you all are independently wealthy in here, most of you are working as wage slaves someplace."
    },
    {
      "Time_Start": 1670.0,
      "Time_End": 1677.0,
      "Text": " Guess what? Starting last year, there was a federal database that all states must contribute at a minimum"
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1681.0,
      "Text": " your name, your birth date, and your SSN to."
    },
    {
      "Time_Start": 1682.0,
      "Time_End": 1690.0,
      "Text": " They then match this data against a list of about a quarter million people who owe seriously overdue child support."
    },
    {
      "Time_Start": 1691.0,
      "Time_End": 1693.0,
      "Text": " Now, here's my problem."
    },
    {
      "Time_Start": 1694.0,
      "Time_End": 1698.0,
      "Text": " Here we have created a brand new database that basically will contain everybody"
    },
    {
      "Time_Start": 1699.0,
      "Time_End": 1702.0,
      "Text": " because most everybody must work to support themselves"
    },
    {
      "Time_Start": 1703.0,
      "Time_End": 1706.0,
      "Text": " to catch a quarter million people who don't pay their child support."
    },
    {
      "Time_Start": 1707.0,
      "Time_End": 1709.0,
      "Text": " I have no children. Never have."
    },
    {
      "Time_Start": 1709.0,
      "Time_End": 1714.0,
      "Text": " But my records are sent there as are my father's who's 65"
    },
    {
      "Time_Start": 1715.0,
      "Time_End": 1718.0,
      "Text": " and certainly he doesn't have to pay child support anymore."
    },
    {
      "Time_Start": 1719.0,
      "Time_End": 1721.0,
      "Text": " Yeah, Dad, I appreciate the money, but you know, the point of it is"
    },
    {
      "Time_Start": 1722.0,
      "Time_End": 1723.0,
      "Text": " his records are being sent there."
    },
    {
      "Time_Start": 1724.0,
      "Time_End": 1726.0,
      "Text": " You think that's the worst part of it? Oh, no."
    },
    {
      "Time_Start": 1727.0,
      "Time_End": 1728.0,
      "Text": " Here's the second part of it."
    },
    {
      "Time_Start": 1729.0,
      "Time_End": 1732.0,
      "Text": " At the same time, part of this law was, and here's how they sold it to you."
    },
    {
      "Time_Start": 1733.0,
      "Time_End": 1735.0,
      "Text": " They said, but it's for the children."
    },
    {
      "Time_Start": 1735.0,
      "Time_End": 1738.0,
      "Text": " Don't you want children to get their overdue child support?"
    },
    {
      "Time_Start": 1739.0,
      "Time_End": 1743.0,
      "Text": " There's $50 billion in unpaid child support out there."
    },
    {
      "Time_Start": 1744.0,
      "Time_End": 1747.0,
      "Text": " Don't you want hungry children to get what they need?"
    },
    {
      "Time_Start": 1748.0,
      "Time_End": 1751.0,
      "Text": " Well, of course I do, but does that mean you have to go rape my privacy to do it?"
    },
    {
      "Time_Start": 1752.0,
      "Time_End": 1756.0,
      "Text": " Okay. The second part of this is banks must search their records"
    },
    {
      "Time_Start": 1757.0,
      "Time_End": 1758.0,
      "Text": " and I believe it's twice a year"
    },
    {
      "Time_Start": 1759.0,
      "Time_End": 1763.0,
      "Text": " to look for matches, account holders who match the people on this list."
    },
    {
      "Time_Start": 1763.0,
      "Time_End": 1769.0,
      "Text": " If they find the match, they're supposed to notify the federal new hire database"
    },
    {
      "Time_Start": 1770.0,
      "Time_End": 1772.0,
      "Text": " and then they will go in and institute garnishment proceedings"
    },
    {
      "Time_Start": 1773.0,
      "Time_End": 1777.0,
      "Text": " and by law they can't tell you for a period of time to give them time to get the money."
    },
    {
      "Time_Start": 1778.0,
      "Time_End": 1782.0,
      "Text": " Well, that's bad enough, but a lot of smaller banks have decided,"
    },
    {
      "Time_Start": 1783.0,
      "Time_End": 1785.0,
      "Text": " you know what, we don't want to go to the expense of hiring people,"
    },
    {
      "Time_Start": 1786.0,
      "Time_End": 1788.0,
      "Text": " installing the screening software and all this stuff. It's time consuming."
    },
    {
      "Time_Start": 1789.0,
      "Time_End": 1792.0,
      "Text": " So instead, we use the provision of the law that just lets us"
    },
    {
      "Time_Start": 1793.0,
      "Time_End": 1795.0,
      "Text": " take the magnetic tape with all our bank account records"
    },
    {
      "Time_Start": 1796.0,
      "Time_End": 1798.0,
      "Text": " and give it to the state child support agency."
    },
    {
      "Time_Start": 1799.0,
      "Time_End": 1802.0,
      "Text": " So as of this moment, depending with whom you bank,"
    },
    {
      "Time_Start": 1803.0,
      "Time_End": 1808.0,
      "Text": " your account records, the balances, the withdrawal history,"
    },
    {
      "Time_Start": 1809.0,
      "Time_End": 1813.0,
      "Text": " all of that stuff is at your state's child support enforcement division"
    },
    {
      "Time_Start": 1814.0,
      "Time_End": 1817.0,
      "Text": " because many of the banks have said, well, we'd just rather let them do it."
    },
    {
      "Time_Start": 1818.0,
      "Time_End": 1820.0,
      "Text": " So, this is how, here's what we have done."
    },
    {
      "Time_Start": 1821.0,
      "Time_End": 1824.0,
      "Text": " We have said, we want to have what I call security via database,"
    },
    {
      "Time_Start": 1825.0,
      "Time_End": 1829.0,
      "Text": " which means we expand how many databases we create on people"
    },
    {
      "Time_Start": 1830.0,
      "Time_End": 1832.0,
      "Text": " so that we can weed out the bad people."
    },
    {
      "Time_Start": 1833.0,
      "Time_End": 1837.0,
      "Text": " When you rent an apartment, there was a time when you rented an apartment,"
    },
    {
      "Time_Start": 1838.0,
      "Time_End": 1840.0,
      "Text": " you told them where you used to live, they called, they asked your landlord,"
    },
    {
      "Time_Start": 1841.0,
      "Time_End": 1842.0,
      "Text": " yeah, he paid his rent on time, blah, blah, blah."
    },
    {
      "Time_Start": 1843.0,
      "Time_End": 1844.0,
      "Text": " They wanted to know you were working."
    },
    {
      "Time_Start": 1845.0,
      "Time_End": 1846.0,
      "Text": " They were like, welcome to the neighborhood."
    },
    {
      "Time_Start": 1846.0,
      "Time_End": 1847.0,
      "Text": " Now what happens?"
    },
    {
      "Time_Start": 1848.0,
      "Time_End": 1851.0,
      "Text": " Well, you fill out a credit report, essentially they pull a credit report,"
    },
    {
      "Time_Start": 1852.0,
      "Time_End": 1856.0,
      "Text": " then they go to a second place that checks for people who have a bad rental history"
    },
    {
      "Time_Start": 1857.0,
      "Time_End": 1860.0,
      "Text": " and now some of the places that screen renters even check to see"
    },
    {
      "Time_Start": 1861.0,
      "Time_End": 1863.0,
      "Text": " if you have a criminal record and have wants and warrants."
    },
    {
      "Time_Start": 1864.0,
      "Time_End": 1867.0,
      "Text": " And they say, but this makes the community safer."
    },
    {
      "Time_Start": 1868.0,
      "Time_End": 1871.0,
      "Text": " Well, of course it makes the community safer, but my God, at what price?"
    },
    {
      "Time_Start": 1872.0,
      "Time_End": 1873.0,
      "Text": " This is the question."
    },
    {
      "Time_Start": 1873.0,
      "Time_End": 1879.0,
      "Text": " If we have security via database, the ultimate part of this could be we all get mail."
    },
    {
      "Time_Start": 1880.0,
      "Time_End": 1885.0,
      "Text": " What if the post office said, look, the mails are used to transact a lot of illegal business."
    },
    {
      "Time_Start": 1886.0,
      "Time_End": 1887.0,
      "Text": " We all know that."
    },
    {
      "Time_Start": 1888.0,
      "Time_End": 1892.0,
      "Text": " So starting the 1st of January 2001, all envelopes, mailing containers and packages"
    },
    {
      "Time_Start": 1893.0,
      "Time_End": 1899.0,
      "Text": " must be transparent and anything inside of them must be wrapped in transparent paper."
    },
    {
      "Time_Start": 1900.0,
      "Time_End": 1901.0,
      "Text": " Don't think it can happen."
    },
    {
      "Time_Start": 1901.0,
      "Time_End": 1907.0,
      "Text": " My point up here is, yeah, if they tried to do that tomorrow, the American people would balk."
    },
    {
      "Time_Start": 1908.0,
      "Time_End": 1913.0,
      "Text": " But when you take privacy away inch by inch, here we've got a national new hire database."
    },
    {
      "Time_Start": 1914.0,
      "Time_End": 1921.0,
      "Text": " Here we've got your bank records being given over to bureaucrats with no warrant for no reason."
    },
    {
      "Time_Start": 1922.0,
      "Time_End": 1928.0,
      "Text": " How much further is it before we reach a point where we are sold that for the common good,"
    },
    {
      "Time_Start": 1928.0,
      "Time_End": 1930.0,
      "Text": " we're willing to give up all of our privacy?"
    },
    {
      "Time_Start": 1931.0,
      "Time_End": 1933.0,
      "Text": " So that's, like I said, you've got to know your enemy."
    },
    {
      "Time_Start": 1934.0,
      "Time_End": 1937.0,
      "Text": " Now, the part two of the book is privacy protection strategies."
    },
    {
      "Time_Start": 1938.0,
      "Time_End": 1941.0,
      "Text": " And because I've been running over a little bit, I'm going to be brief on this,"
    },
    {
      "Time_Start": 1942.0,
      "Time_End": 1946.0,
      "Text": " but I will be at the table all tonight and all tomorrow if you want to talk to me about this."
    },
    {
      "Time_Start": 1947.0,
      "Time_End": 1952.0,
      "Text": " Number one, your SSN is the key to all the records about you."
    },
    {
      "Time_Start": 1952.0,
      "Time_End": 1960.0,
      "Text": " So step one on protecting your privacy is you have to make a conscious decision that I control where this number goes."
    },
    {
      "Time_Start": 1961.0,
      "Time_End": 1965.0,
      "Text": " Now, in the book I talk about how the numbers are created, how they started, what they became."
    },
    {
      "Time_Start": 1966.0,
      "Time_End": 1972.0,
      "Text": " But the fact is, any of you who are over 35 in here who still have your original SS cards you got in the 70s or earlier,"
    },
    {
      "Time_Start": 1973.0,
      "Time_End": 1976.0,
      "Text": " that card specifically said not for identification."
    },
    {
      "Time_Start": 1977.0,
      "Time_End": 1981.0,
      "Text": " Because the number on that card is supposed to identify a pension account."
    },
    {
      "Time_Start": 1982.0,
      "Time_End": 1983.0,
      "Text": " Not a person."
    },
    {
      "Time_Start": 1984.0,
      "Time_End": 1987.0,
      "Text": " But because it's a unique identifier, everybody glommed onto that."
    },
    {
      "Time_Start": 1988.0,
      "Time_End": 1991.0,
      "Text": " So it started showing up on driver's licenses, insurance policies, whatever."
    },
    {
      "Time_Start": 1992.0,
      "Time_End": 1996.0,
      "Text": " The first step in getting some of your privacy back is to open your wallet up."
    },
    {
      "Time_Start": 1997.0,
      "Time_End": 2000.0,
      "Text": " If your SS card is in there, you take it out and you leave it at home."
    },
    {
      "Time_Start": 2001.0,
      "Time_End": 2002.0,
      "Text": " That's step one."
    },
    {
      "Time_Start": 2003.0,
      "Time_End": 2008.0,
      "Text": " Step number two is if you're from a state that puts the SSN on the license,"
    },
    {
      "Time_Start": 2009.0,
      "Time_End": 2011.0,
      "Text": " most of those states now will allow you not to have it on there."
    },
    {
      "Time_Start": 2012.0,
      "Time_End": 2020.0,
      "Text": " Some states that use the SSN as the license number will now allow you to get that change to just a nine digit number they create."
    },
    {
      "Time_Start": 2021.0,
      "Time_End": 2023.0,
      "Text": " If you're in one of those states, go do that."
    },
    {
      "Time_Start": 2024.0,
      "Time_End": 2030.0,
      "Text": " No one should be able to know your SSN just from looking at your driver's license or from going through something in your wallet."
    },
    {
      "Time_Start": 2031.0,
      "Time_End": 2032.0,
      "Text": " This is critical."
    },
    {
      "Time_Start": 2033.0,
      "Time_End": 2037.0,
      "Text": " Number two, you need to compartmentalize."
    },
    {
      "Time_Start": 2038.0,
      "Time_End": 2043.0,
      "Text": " That means people only should know about you what they need to know about you."
    },
    {
      "Time_Start": 2044.0,
      "Time_End": 2050.0,
      "Text": " Does your dentist, does Radio Shack, because God, you can't buy a battery at Radio Shack without giving a name and address."
    },
    {
      "Time_Start": 2051.0,
      "Time_End": 2056.0,
      "Text": " Do these people really need to know where you live?"
    },
    {
      "Time_Start": 2057.0,
      "Time_End": 2058.0,
      "Text": " I say no, they don't."
    },
    {
      "Time_Start": 2058.0,
      "Time_End": 2067.0,
      "Text": " Your home address where you actually lay your head at night is something that should be privileged information to people who are really close to you."
    },
    {
      "Time_Start": 2068.0,
      "Time_End": 2070.0,
      "Text": " Even your boss doesn't need to know where you live."
    },
    {
      "Time_Start": 2071.0,
      "Time_End": 2073.0,
      "Text": " He needs an address and a way to contact you."
    },
    {
      "Time_Start": 2074.0,
      "Time_End": 2081.0,
      "Text": " So part two of taking some of your privacy back is you get a mailing address at either mailboxes, et cetera, or secretarial service,"
    },
    {
      "Time_Start": 2081.0,
      "Time_End": 2095.0,
      "Text": " and that is the address of record you give to banks, to your dentist, to anybody who doesn't actually need to know where you live."
    },
    {
      "Time_Start": 2096.0,
      "Time_End": 2099.0,
      "Text": " So anytime you fill out a form or somebody asks you for your name and address,"
    },
    {
      "Time_Start": 2100.0,
      "Time_End": 2105.0,
      "Text": " the first question if you're building a privacy firewall is, is this a person who needs to really know where I live?"
    },
    {
      "Time_Start": 2106.0,
      "Time_End": 2108.0,
      "Text": " Your mother needs to know where you really live."
    },
    {
      "Time_Start": 2108.0,
      "Time_End": 2111.0,
      "Text": " But the guys at Radio Shack sure as hell don't."
    },
    {
      "Time_Start": 2112.0,
      "Time_End": 2115.0,
      "Text": " Next step on as far as this, fell telephone."
    },
    {
      "Time_Start": 2116.0,
      "Time_End": 2118.0,
      "Text": " With caller ID, because you know those 800 numbers."
    },
    {
      "Time_Start": 2119.0,
      "Time_End": 2123.0,
      "Text": " Man, I bought a house a year ago, I got a non-listed, non-published number."
    },
    {
      "Time_Start": 2124.0,
      "Time_End": 2127.0,
      "Text": " I get this call, hi, it's Colligan Water Treatment."
    },
    {
      "Time_Start": 2128.0,
      "Time_End": 2129.0,
      "Text": " It's like, wait a minute, how the hell did you get this number?"
    },
    {
      "Time_Start": 2130.0,
      "Time_End": 2131.0,
      "Text": " Oh, we got it from the builder."
    },
    {
      "Time_Start": 2132.0,
      "Time_End": 2134.0,
      "Text": " It's like, oh, well, isn't that special."
    },
    {
      "Time_Start": 2134.0,
      "Time_End": 2137.0,
      "Text": " Okay, my point is here, and I'm Mr. Privacy."
    },
    {
      "Time_Start": 2138.0,
      "Time_End": 2139.0,
      "Text": " Okay, and they're calling me."
    },
    {
      "Time_Start": 2140.0,
      "Time_End": 2143.0,
      "Text": " I move in a new house, I do all the stuff I'm telling you to do, and here they are."
    },
    {
      "Time_Start": 2144.0,
      "Time_End": 2145.0,
      "Text": " Here's the deal on telephone privacy."
    },
    {
      "Time_Start": 2146.0,
      "Time_End": 2151.0,
      "Text": " One, get a voicemail number linked to a pager, because the point is most people who call you,"
    },
    {
      "Time_Start": 2152.0,
      "Time_End": 2153.0,
      "Text": " they don't really need to talk to you."
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2157.0,
      "Text": " What they need to do is give you information or reach you in a timely manner."
    },
    {
      "Time_Start": 2158.0,
      "Time_End": 2162.0,
      "Text": " So those people don't need to know the number of the phone sitting on your desk at home."
    },
    {
      "Time_Start": 2162.0,
      "Time_End": 2166.0,
      "Text": " What they need is a phone number so that they can reach you."
    },
    {
      "Time_Start": 2167.0,
      "Time_End": 2169.0,
      "Text": " That does exactly that."
    },
    {
      "Time_Start": 2170.0,
      "Time_End": 2173.0,
      "Text": " This is the number you give all of those other people."
    },
    {
      "Time_Start": 2174.0,
      "Time_End": 2178.0,
      "Text": " Like we have a saying in the ID business, share the spurious with the curious."
    },
    {
      "Time_Start": 2179.0,
      "Time_End": 2183.0,
      "Text": " Okay, so that's if you're buying something and you've got to give a phone number and an address,"
    },
    {
      "Time_Start": 2184.0,
      "Time_End": 2186.0,
      "Text": " and you're doing something where you have to, that's what you give out."
    },
    {
      "Time_Start": 2187.0,
      "Time_End": 2189.0,
      "Text": " Now, the hardwired phone."
    },
    {
      "Time_Start": 2189.0,
      "Time_End": 2191.0,
      "Text": " Phone companies can be real bad."
    },
    {
      "Time_Start": 2192.0,
      "Time_End": 2196.0,
      "Text": " We need to name your SSN, blah, blah, blah, this kind of stuff."
    },
    {
      "Time_Start": 2197.0,
      "Time_End": 2201.0,
      "Text": " But, thanks to deregulation now in most markets, there are alternative phone companies"
    },
    {
      "Time_Start": 2202.0,
      "Time_End": 2203.0,
      "Text": " that will give you local phone service."
    },
    {
      "Time_Start": 2204.0,
      "Time_End": 2208.0,
      "Text": " These companies frequently advertise no ID, no credit checks, whatever."
    },
    {
      "Time_Start": 2209.0,
      "Time_End": 2210.0,
      "Text": " That's who you go with."
    },
    {
      "Time_Start": 2211.0,
      "Time_End": 2213.0,
      "Text": " You get the phone in a completely spurious name."
    },
    {
      "Time_Start": 2214.0,
      "Time_End": 2216.0,
      "Text": " My dog, Sarah, appears on many legal accounts."
    },
    {
      "Time_Start": 2217.0,
      "Time_End": 2219.0,
      "Text": " Sarah's a very well-off dog, let me tell you."
    },
    {
      "Time_Start": 2220.0,
      "Time_End": 2221.0,
      "Text": " She does well for herself."
    },
    {
      "Time_Start": 2222.0,
      "Time_End": 2223.0,
      "Text": " Sarah has frequent flyer miles."
    },
    {
      "Time_Start": 2224.0,
      "Time_End": 2226.0,
      "Text": " Sarah is something else, let me tell you."
    },
    {
      "Time_Start": 2227.0,
      "Time_End": 2228.0,
      "Text": " That dog, I just don't know."
    },
    {
      "Time_Start": 2229.0,
      "Time_End": 2233.0,
      "Text": " But, in any case, the point of it is, is that you can do the same thing."
    },
    {
      "Time_Start": 2234.0,
      "Time_End": 2236.0,
      "Text": " I say, that's who you get your phone service with."
    },
    {
      "Time_Start": 2237.0,
      "Time_End": 2239.0,
      "Text": " You get the phone service with that company in a totally spurious name,"
    },
    {
      "Time_Start": 2240.0,
      "Time_End": 2243.0,
      "Text": " in Rover's name, or if you've got a cat in the cat's name, or the gerbil's name,"
    },
    {
      "Time_Start": 2243.0,
      "Time_End": 2248.0,
      "Text": " or make up a name, and then, it's a non-published number,"
    },
    {
      "Time_Start": 2249.0,
      "Time_End": 2250.0,
      "Text": " then you've dropped out."
    },
    {
      "Time_Start": 2251.0,
      "Time_End": 2254.0,
      "Text": " Now, credit cards, banks, whatever,"
    },
    {
      "Time_Start": 2255.0,
      "Time_End": 2258.0,
      "Text": " you have your statements and accounts and whatever,"
    },
    {
      "Time_Start": 2259.0,
      "Time_End": 2260.0,
      "Text": " go to the mailing address."
    },
    {
      "Time_Start": 2261.0,
      "Time_End": 2264.0,
      "Text": " You can't establish credit with most mailing addresses now."
    },
    {
      "Time_Start": 2265.0,
      "Time_End": 2267.0,
      "Text": " There are some ways around that, which I'll talk about tomorrow."
    },
    {
      "Time_Start": 2268.0,
      "Time_End": 2270.0,
      "Text": " But, you can cut the data trail."
    },
    {
      "Time_Start": 2270.0,
      "Time_End": 2274.0,
      "Text": " Because, then, what happens is, their address of record is over there at mailboxes, etc.,"
    },
    {
      "Time_Start": 2275.0,
      "Time_End": 2276.0,
      "Text": " at the secretarial service."
    },
    {
      "Time_Start": 2277.0,
      "Time_End": 2280.0,
      "Text": " Especially, so then, if you move, they have no idea where you really are."
    },
    {
      "Time_Start": 2281.0,
      "Time_End": 2282.0,
      "Text": " Utilities."
    },
    {
      "Time_Start": 2283.0,
      "Time_End": 2285.0,
      "Text": " Now, that can be a problem, or if you move into an apartment."
    },
    {
      "Time_Start": 2286.0,
      "Time_End": 2289.0,
      "Text": " Well, I have a client, because I also advise people at my website,"
    },
    {
      "Time_Start": 2290.0,
      "Time_End": 2292.0,
      "Text": " privacypower.com, how to create new identities."
    },
    {
      "Time_Start": 2293.0,
      "Time_End": 2294.0,
      "Text": " This guy set up a new identity,"
    },
    {
      "Time_Start": 2295.0,
      "Time_End": 2296.0,
      "Text": " and he wanted to live in a nice apartment complex."
    },
    {
      "Time_Start": 2297.0,
      "Time_End": 2298.0,
      "Text": " Well, he goes in, and of course, you said,"
    },
    {
      "Time_Start": 2298.0,
      "Time_End": 2299.0,
      "Text": " well, fill out this form, this form, this form."
    },
    {
      "Time_Start": 2300.0,
      "Time_End": 2302.0,
      "Text": " We want your fingerprints, your firstborn,"
    },
    {
      "Time_Start": 2303.0,
      "Time_End": 2304.0,
      "Text": " title to your firstborn, or whatever,"
    },
    {
      "Time_Start": 2305.0,
      "Time_End": 2306.0,
      "Text": " and we'll consider you."
    },
    {
      "Time_Start": 2307.0,
      "Time_End": 2308.0,
      "Text": " And then he said, well, look,"
    },
    {
      "Time_Start": 2309.0,
      "Time_End": 2310.0,
      "Text": " what if I just pay the whole first year's rent up front?"
    },
    {
      "Time_Start": 2311.0,
      "Time_End": 2314.0,
      "Text": " And he took out a cashier's check out of his wallet for $11,000."
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2316.0,
      "Text": " She said, oh, no problem whatsoever, sir."
    },
    {
      "Time_Start": 2317.0,
      "Time_End": 2318.0,
      "Text": " Here you go."
    },
    {
      "Time_Start": 2319.0,
      "Time_End": 2322.0,
      "Text": " My point being, when you're dealing with places like cable TV, utility companies, whatever,"
    },
    {
      "Time_Start": 2323.0,
      "Time_End": 2326.0,
      "Text": " if you're willing to pay for the service for six months or a year in advance,"
    },
    {
      "Time_Start": 2326.0,
      "Time_End": 2332.0,
      "Text": " it's amazing how green makes all those little formalities disappear."
    },
    {
      "Time_Start": 2333.0,
      "Time_End": 2334.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2335.0,
      "Time_End": 2338.0,
      "Text": " Another thing, never ever use your SSN or any part of it"
    },
    {
      "Time_Start": 2339.0,
      "Time_End": 2341.0,
      "Text": " as a password on any account that you have."
    },
    {
      "Time_Start": 2342.0,
      "Time_End": 2343.0,
      "Text": " Last year, I showed you,"
    },
    {
      "Time_Start": 2344.0,
      "Time_End": 2346.0,
      "Text": " we had, all we had was a professor's name."
    },
    {
      "Time_Start": 2347.0,
      "Time_End": 2349.0,
      "Text": " And when we were done, we had his SSN and the whole bit."
    },
    {
      "Time_Start": 2350.0,
      "Time_End": 2352.0,
      "Text": " If he banked at Bank of America, or Bank One,"
    },
    {
      "Time_Start": 2353.0,
      "Time_End": 2354.0,
      "Text": " or a bunch of other places,"
    },
    {
      "Time_Start": 2354.0,
      "Time_End": 2356.0,
      "Text": " we could have called up and I could have said,"
    },
    {
      "Time_Start": 2357.0,
      "Time_End": 2359.0,
      "Text": " hi, yes, my name is Lester Molester,"
    },
    {
      "Time_Start": 2360.0,
      "Time_End": 2363.0,
      "Text": " and I don't have my account book here, but I need my account."
    },
    {
      "Time_Start": 2364.0,
      "Time_End": 2365.0,
      "Text": " They'd say, well, what's your name?"
    },
    {
      "Time_Start": 2366.0,
      "Time_End": 2367.0,
      "Text": " What's your address? What's your birthdate?"
    },
    {
      "Time_Start": 2368.0,
      "Time_End": 2369.0,
      "Text": " And now, to make sure it's really you, Mr. Molester,"
    },
    {
      "Time_Start": 2370.0,
      "Time_End": 2371.0,
      "Text": " I need to know the last four digits of your SSN."
    },
    {
      "Time_Start": 2372.0,
      "Time_End": 2373.0,
      "Text": " One, two, seven, one."
    },
    {
      "Time_Start": 2374.0,
      "Time_End": 2375.0,
      "Text": " How can I do for you, sir?"
    },
    {
      "Time_Start": 2376.0,
      "Time_End": 2377.0,
      "Text": " Well, your balance is $8,500."
    },
    {
      "Time_Start": 2378.0,
      "Time_End": 2379.0,
      "Text": " Your account number is such and such, and blah, blah, blah."
    },
    {
      "Time_Start": 2380.0,
      "Time_End": 2383.0,
      "Text": " Well, I'd like you to change the mailing address of my debit card to such and such."
    },
    {
      "Time_Start": 2384.0,
      "Time_End": 2385.0,
      "Text": " Give me another one, because I lost it."
    },
    {
      "Time_Start": 2386.0,
      "Time_End": 2387.0,
      "Text": " No problem, Mr. Molester."
    },
    {
      "Time_Start": 2388.0,
      "Time_End": 2389.0,
      "Text": " Go right out and mail tomorrow."
    },
    {
      "Time_Start": 2390.0,
      "Time_End": 2391.0,
      "Text": " Boom. I've emptied this guy's bank account."
    },
    {
      "Time_Start": 2392.0,
      "Time_End": 2393.0,
      "Text": " He's like, hey, what's going on here?"
    },
    {
      "Time_Start": 2394.0,
      "Time_End": 2395.0,
      "Text": " He's on vacation in Hawaii, and they're like,"
    },
    {
      "Time_Start": 2396.0,
      "Time_End": 2397.0,
      "Text": " sir, I'm sorry, but we'd like to talk to you."
    },
    {
      "Time_Start": 2398.0,
      "Time_End": 2399.0,
      "Text": " Your credit card was declined, sir."
    },
    {
      "Time_Start": 2400.0,
      "Time_End": 2401.0,
      "Text": " You're a scumbag. Please leave the hotel."
    },
    {
      "Time_Start": 2402.0,
      "Time_End": 2403.0,
      "Text": " It's like, well, I don't know what happened."
    },
    {
      "Time_Start": 2404.0,
      "Time_End": 2405.0,
      "Text": " So, this is my whole point."
    },
    {
      "Time_Start": 2406.0,
      "Time_End": 2409.0,
      "Text": " Many agencies use part of your SSN as a password."
    },
    {
      "Time_Start": 2410.0,
      "Time_End": 2412.0,
      "Text": " I showed you, you can get anybody's SSN in this country"
    },
    {
      "Time_Start": 2412.0,
      "Time_End": 2415.0,
      "Text": " for $50, and if you have an address on them."
    },
    {
      "Time_Start": 2416.0,
      "Time_End": 2421.0,
      "Text": " Do not use SSNs, or for that matter, your mother's maiden name, as an identifier."
    },
    {
      "Time_Start": 2422.0,
      "Time_End": 2425.0,
      "Text": " There was an identity theft ring that preyed on people"
    },
    {
      "Time_Start": 2426.0,
      "Time_End": 2428.0,
      "Text": " who were born in California and Massachusetts,"
    },
    {
      "Time_Start": 2429.0,
      "Time_End": 2432.0,
      "Text": " because in those states, birth certificates are open records, completely."
    },
    {
      "Time_Start": 2433.0,
      "Time_End": 2436.0,
      "Text": " What they would do is find people who were born in those states"
    },
    {
      "Time_Start": 2437.0,
      "Time_End": 2438.0,
      "Text": " that had decent incomes."
    },
    {
      "Time_Start": 2439.0,
      "Time_End": 2440.0,
      "Text": " They'd get their birth certificates."
    },
    {
      "Time_Start": 2440.0,
      "Time_End": 2441.0,
      "Text": " Then they had their mother's maiden names."
    },
    {
      "Time_Start": 2442.0,
      "Time_End": 2443.0,
      "Text": " And then they would take over their bank accounts"
    },
    {
      "Time_Start": 2444.0,
      "Time_End": 2445.0,
      "Text": " and do all sorts of other stuff."
    },
    {
      "Time_Start": 2446.0,
      "Time_End": 2447.0,
      "Text": " And the guy would say, but it had to be you,"
    },
    {
      "Time_Start": 2448.0,
      "Time_End": 2449.0,
      "Text": " because not only did he know your SSN,"
    },
    {
      "Time_Start": 2450.0,
      "Time_End": 2451.0,
      "Text": " but he knew your mother's maiden name."
    },
    {
      "Time_Start": 2452.0,
      "Time_End": 2453.0,
      "Text": " Remember something."
    },
    {
      "Time_Start": 2454.0,
      "Time_End": 2455.0,
      "Text": " Your mother's maiden name is actually a public record,"
    },
    {
      "Time_Start": 2456.0,
      "Time_End": 2457.0,
      "Text": " because it's on your damn birth certificate."
    },
    {
      "Time_Start": 2458.0,
      "Time_End": 2459.0,
      "Text": " Keep these things in mind."
    },
    {
      "Time_Start": 2460.0,
      "Time_End": 2461.0,
      "Text": " Okay?"
    },
    {
      "Time_Start": 2462.0,
      "Time_End": 2464.0,
      "Text": " Some states are worse to live in than others."
    },
    {
      "Time_Start": 2465.0,
      "Time_End": 2466.0,
      "Text": " Some states are better."
    },
    {
      "Time_Start": 2467.0,
      "Time_End": 2468.0,
      "Text": " Washington State, I love. Here's why."
    },
    {
      "Time_Start": 2468.0,
      "Time_End": 2470.0,
      "Text": " It's where Limpanics is, and they pay good royalties."
    },
    {
      "Time_Start": 2471.0,
      "Time_End": 2473.0,
      "Text": " But more so than that, in Washington State,"
    },
    {
      "Time_Start": 2474.0,
      "Time_End": 2475.0,
      "Text": " unless you're getting a commercial driver's license,"
    },
    {
      "Time_Start": 2476.0,
      "Time_End": 2477.0,
      "Text": " you must not provide an SSN."
    },
    {
      "Time_Start": 2478.0,
      "Time_End": 2481.0,
      "Text": " It is not asked for nor required in the licensing process,"
    },
    {
      "Time_Start": 2482.0,
      "Time_End": 2485.0,
      "Text": " because they create a unique identifying number for you for the license."
    },
    {
      "Time_Start": 2486.0,
      "Time_End": 2490.0,
      "Text": " And Washington State has very good, strong privacy protection laws."
    },
    {
      "Time_Start": 2491.0,
      "Time_End": 2494.0,
      "Text": " Some states, like Ohio, can be very bad."
    },
    {
      "Time_Start": 2495.0,
      "Time_End": 2497.0,
      "Text": " Because in Ohio, until recently, and I still think it's true,"
    },
    {
      "Time_Start": 2498.0,
      "Time_End": 2500.0,
      "Text": " auto registrations have your SSN on them."
    },
    {
      "Time_Start": 2501.0,
      "Time_End": 2502.0,
      "Text": " This is the registration form in your car."
    },
    {
      "Time_Start": 2503.0,
      "Time_End": 2506.0,
      "Text": " They have your SSN on them, and your driver's license number."
    },
    {
      "Time_Start": 2507.0,
      "Time_End": 2508.0,
      "Text": " Identity thieves know in Ohio,"
    },
    {
      "Time_Start": 2509.0,
      "Time_End": 2512.0,
      "Text": " oh, you don't have to go do any hacking or breaking in or dumpster diving."
    },
    {
      "Time_Start": 2513.0,
      "Time_End": 2515.0,
      "Text": " Just go break in somebody's car and take the auto registration."
    },
    {
      "Time_Start": 2516.0,
      "Time_End": 2517.0,
      "Text": " If the guy's got a Lexus,"
    },
    {
      "Time_Start": 2518.0,
      "Time_End": 2519.0,
      "Text": " and it means this guy's got some money,"
    },
    {
      "Time_Start": 2520.0,
      "Time_End": 2521.0,
      "Text": " he's driving a Lexus unless he stole the damn thing,"
    },
    {
      "Time_Start": 2522.0,
      "Time_End": 2523.0,
      "Text": " break in, hey, I've got the auto."
    },
    {
      "Time_Start": 2524.0,
      "Time_End": 2525.0,
      "Text": " In fact, if you can open the door"
    },
    {
      "Time_Start": 2525.0,
      "Time_End": 2529.0,
      "Text": " and just write down the stuff off the vehicle registration and put it back,"
    },
    {
      "Time_Start": 2530.0,
      "Time_End": 2531.0,
      "Text": " you don't even have to steal anything."
    },
    {
      "Time_Start": 2532.0,
      "Time_End": 2533.0,
      "Text": " They've made it very easy."
    },
    {
      "Time_Start": 2534.0,
      "Time_End": 2537.0,
      "Text": " I ask you, what the hell do SSNs and driver's license numbers"
    },
    {
      "Time_Start": 2538.0,
      "Time_End": 2540.0,
      "Text": " have to do with the registration of a car?"
    },
    {
      "Time_Start": 2541.0,
      "Time_End": 2543.0,
      "Text": " But this is what we call data creep."
    },
    {
      "Time_Start": 2544.0,
      "Time_End": 2545.0,
      "Text": " It grills."
    },
    {
      "Time_Start": 2546.0,
      "Time_End": 2548.0,
      "Text": " Finally, like I said, you see how your bank can be a snitch on you,"
    },
    {
      "Time_Start": 2549.0,
      "Time_End": 2550.0,
      "Text": " other things like that."
    },
    {
      "Time_Start": 2551.0,
      "Time_End": 2552.0,
      "Text": " There are other steps you can take,"
    },
    {
      "Time_Start": 2553.0,
      "Time_End": 2554.0,
      "Text": " like you can use a corporation."
    },
    {
      "Time_Start": 2555.0,
      "Time_End": 2558.0,
      "Text": " It's important because the only thing Nevada knows about the offices of a corporation"
    },
    {
      "Time_Start": 2559.0,
      "Time_End": 2560.0,
      "Text": " are their name and mailing address."
    },
    {
      "Time_Start": 2561.0,
      "Time_End": 2562.0,
      "Text": " So you could create a Nevada corporation,"
    },
    {
      "Time_Start": 2563.0,
      "Time_End": 2564.0,
      "Text": " a totally spurious name,"
    },
    {
      "Time_Start": 2565.0,
      "Time_End": 2567.0,
      "Text": " that corporation under U.S. common law,"
    },
    {
      "Time_Start": 2568.0,
      "Time_End": 2569.0,
      "Text": " a corporation is like a person."
    },
    {
      "Time_Start": 2570.0,
      "Time_End": 2572.0,
      "Text": " It can own property, open bank accounts, everything else."
    },
    {
      "Time_Start": 2573.0,
      "Time_End": 2575.0,
      "Text": " A company can provide you with wraparound privacy."
    },
    {
      "Time_Start": 2576.0,
      "Time_End": 2577.0,
      "Text": " If you're driving a car registered in a corporation,"
    },
    {
      "Time_Start": 2578.0,
      "Time_End": 2580.0,
      "Text": " auto plates are public record."
    },
    {
      "Time_Start": 2581.0,
      "Time_End": 2582.0,
      "Text": " If somebody runs your plate,"
    },
    {
      "Time_Start": 2582.0,
      "Time_End": 2584.0,
      "Text": " all they're going to get back is XYZ corporation."
    },
    {
      "Time_Start": 2585.0,
      "Time_End": 2586.0,
      "Text": " They're not going to get your name and address."
    },
    {
      "Time_Start": 2587.0,
      "Time_End": 2589.0,
      "Text": " A corporation can open a bank account, have an EIN."
    },
    {
      "Time_Start": 2590.0,
      "Time_End": 2591.0,
      "Text": " A lot of you guys who are techies"
    },
    {
      "Time_Start": 2592.0,
      "Time_End": 2595.0,
      "Text": " can work on contract for short periods of time at companies"
    },
    {
      "Time_Start": 2596.0,
      "Time_End": 2597.0,
      "Text": " because you don't want to be, you know,"
    },
    {
      "Time_Start": 2598.0,
      "Time_End": 2599.0,
      "Text": " beholden to one company."
    },
    {
      "Time_Start": 2600.0,
      "Time_End": 2601.0,
      "Text": " You can work for the corporation,"
    },
    {
      "Time_Start": 2602.0,
      "Time_End": 2603.0,
      "Text": " can sign the contract,"
    },
    {
      "Time_Start": 2604.0,
      "Time_End": 2605.0,
      "Text": " let's say if you work on a temporary project"
    },
    {
      "Time_Start": 2606.0,
      "Time_End": 2607.0,
      "Text": " with a computer services firm,"
    },
    {
      "Time_Start": 2608.0,
      "Time_End": 2609.0,
      "Text": " the corporation signs the contract,"
    },
    {
      "Time_Start": 2609.0,
      "Time_End": 2613.0,
      "Text": " the payments are made to the corporation's EIN,"
    },
    {
      "Time_Start": 2614.0,
      "Time_End": 2615.0,
      "Text": " not to your SS number,"
    },
    {
      "Time_Start": 2616.0,
      "Time_End": 2617.0,
      "Text": " but as an officer of the corporation,"
    },
    {
      "Time_Start": 2618.0,
      "Time_End": 2620.0,
      "Text": " you can access the corporate funds to pay your bill."
    },
    {
      "Time_Start": 2621.0,
      "Time_End": 2622.0,
      "Text": " So a corporation can give you"
    },
    {
      "Time_Start": 2623.0,
      "Time_End": 2625.0,
      "Text": " what we call wraparound privacy"
    },
    {
      "Time_Start": 2626.0,
      "Time_End": 2627.0,
      "Text": " because it can act, as we say,"
    },
    {
      "Time_Start": 2628.0,
      "Time_End": 2630.0,
      "Text": " in loco parentis for you"
    },
    {
      "Time_Start": 2631.0,
      "Time_End": 2632.0,
      "Text": " as if it was you."
    },
    {
      "Time_Start": 2633.0,
      "Time_End": 2635.0,
      "Text": " So I highly recommend the use of a personal corporation."
    },
    {
      "Time_Start": 2636.0,
      "Time_End": 2637.0,
      "Text": " Finally, for banking privacy,"
    },
    {
      "Time_Start": 2637.0,
      "Time_End": 2639.0,
      "Text": " there is no way if you maintain"
    },
    {
      "Time_Start": 2640.0,
      "Time_End": 2641.0,
      "Text": " bank accounts in the United States,"
    },
    {
      "Time_Start": 2642.0,
      "Time_End": 2643.0,
      "Text": " as you have seen from the child support people,"
    },
    {
      "Time_Start": 2644.0,
      "Time_End": 2646.0,
      "Text": " the suspicious activity reports, whatever."
    },
    {
      "Time_Start": 2647.0,
      "Time_End": 2648.0,
      "Text": " If you have a bank account in the United States,"
    },
    {
      "Time_Start": 2649.0,
      "Time_End": 2650.0,
      "Text": " there is no expectation of privacy."
    },
    {
      "Time_Start": 2651.0,
      "Time_End": 2654.0,
      "Text": " Those records are available to all sorts of people."
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2657.0,
      "Text": " I highly recommend as an ultimate step"
    },
    {
      "Time_Start": 2658.0,
      "Time_End": 2661.0,
      "Text": " that you open offshore accounts like in Switzerland."
    },
    {
      "Time_Start": 2662.0,
      "Time_End": 2663.0,
      "Text": " Switzerland, even though there's been"
    },
    {
      "Time_Start": 2664.0,
      "Time_End": 2666.0,
      "Text": " some destruction of the privacy there,"
    },
    {
      "Time_Start": 2667.0,
      "Time_End": 2668.0,
      "Text": " if you're not a drug dealer"
    },
    {
      "Time_Start": 2669.0,
      "Time_End": 2670.0,
      "Text": " and you don't have $50 million over there"
    },
    {
      "Time_Start": 2671.0,
      "Time_End": 2672.0,
      "Text": " that shows up over one night,"
    },
    {
      "Time_Start": 2673.0,
      "Time_End": 2675.0,
      "Text": " Switzerland still offers security,"
    },
    {
      "Time_Start": 2676.0,
      "Time_End": 2678.0,
      "Text": " knowing that your money is safe and will be there,"
    },
    {
      "Time_Start": 2679.0,
      "Time_End": 2680.0,
      "Text": " and it still offers a great deal of privacy."
    },
    {
      "Time_Start": 2681.0,
      "Time_End": 2682.0,
      "Text": " You do not need a million dollars"
    },
    {
      "Time_Start": 2683.0,
      "Time_End": 2684.0,
      "Text": " to open a Swiss bank account."
    },
    {
      "Time_Start": 2685.0,
      "Time_End": 2686.0,
      "Text": " You don't even need $10,000."
    },
    {
      "Time_Start": 2687.0,
      "Time_End": 2688.0,
      "Text": " They will issue you an ATM debit card"
    },
    {
      "Time_Start": 2689.0,
      "Time_End": 2691.0,
      "Text": " so you can access your funds here."
    },
    {
      "Time_Start": 2692.0,
      "Time_End": 2693.0,
      "Text": " You can even get a checkbook."
    },
    {
      "Time_Start": 2694.0,
      "Time_End": 2695.0,
      "Text": " Of course, you should never be writing checks"
    },
    {
      "Time_Start": 2695.0,
      "Time_End": 2696.0,
      "Text": " on this account here,"
    },
    {
      "Time_Start": 2697.0,
      "Time_End": 2698.0,
      "Text": " but they'll even give you a multi-currency checkbook."
    },
    {
      "Time_Start": 2699.0,
      "Time_End": 2700.0,
      "Text": " Swiss bank accounts are an ideal way"
    },
    {
      "Time_Start": 2701.0,
      "Time_End": 2702.0,
      "Text": " to reclaim some privacy."
    },
    {
      "Time_Start": 2703.0,
      "Time_End": 2704.0,
      "Text": " But here's the rub."
    },
    {
      "Time_Start": 2705.0,
      "Time_End": 2706.0,
      "Text": " You open up an overseas bank account."
    },
    {
      "Time_Start": 2707.0,
      "Time_End": 2708.0,
      "Text": " The Treasury Department says"
    },
    {
      "Time_Start": 2709.0,
      "Time_End": 2710.0,
      "Text": " you must file this special form."
    },
    {
      "Time_Start": 2711.0,
      "Time_End": 2712.0,
      "Text": " And it doesn't just go in with your tax return."
    },
    {
      "Time_Start": 2713.0,
      "Time_End": 2714.0,
      "Text": " It goes to the Treasury's Department"
    },
    {
      "Time_Start": 2715.0,
      "Time_End": 2716.0,
      "Text": " of Foreign Asset Control."
    },
    {
      "Time_Start": 2717.0,
      "Time_End": 2718.0,
      "Text": " And they say if you have over,"
    },
    {
      "Time_Start": 2719.0,
      "Time_End": 2720.0,
      "Text": " I think it's $1,000 in that account"
    },
    {
      "Time_Start": 2721.0,
      "Time_End": 2722.0,
      "Text": " when you do your taxes,"
    },
    {
      "Time_Start": 2723.0,
      "Time_End": 2724.0,
      "Text": " you're supposed to file this."
    },
    {
      "Time_Start": 2725.0,
      "Time_End": 2726.0,
      "Text": " And that's up to you."
    },
    {
      "Time_Start": 2727.0,
      "Time_End": 2728.0,
      "Text": " Maybe you forgot to file the form."
    },
    {
      "Time_Start": 2729.0,
      "Time_End": 2730.0,
      "Text": " I'm not telling anybody,"
    },
    {
      "Time_Start": 2731.0,
      "Time_End": 2732.0,
      "Text": " so please don't get on me."
    },
    {
      "Time_Start": 2733.0,
      "Time_End": 2734.0,
      "Text": " My mother's best friend retired from the IRS."
    },
    {
      "Time_Start": 2735.0,
      "Time_End": 2736.0,
      "Text": " But the point of it is"
    },
    {
      "Time_Start": 2737.0,
      "Time_End": 2738.0,
      "Text": " that what I'm saying is that many people"
    },
    {
      "Time_Start": 2739.0,
      "Time_End": 2740.0,
      "Text": " who decide they're willing to go"
    },
    {
      "Time_Start": 2741.0,
      "Time_End": 2742.0,
      "Text": " all the way for privacy"
    },
    {
      "Time_Start": 2743.0,
      "Time_End": 2744.0,
      "Text": " do so with foreign bank accounts."
    },
    {
      "Time_Start": 2745.0,
      "Time_End": 2746.0,
      "Text": " Here's my point as I close"
    },
    {
      "Time_Start": 2747.0,
      "Time_End": 2748.0,
      "Text": " because I know I'm run over a little bit."
    },
    {
      "Time_Start": 2749.0,
      "Time_End": 2750.0,
      "Text": " We are in a surveillance society."
    },
    {
      "Time_Start": 2751.0,
      "Time_End": 2752.0,
      "Text": " The United States,"
    },
    {
      "Time_Start": 2753.0,
      "Time_End": 2754.0,
      "Text": " although we are a democracy"
    },
    {
      "Time_Start": 2755.0,
      "Time_End": 2756.0,
      "Text": " a secure industrial democracy,"
    },
    {
      "Time_Start": 2757.0,
      "Time_End": 2758.0,
      "Text": " we are also the most monitored people"
    },
    {
      "Time_Start": 2759.0,
      "Time_End": 2760.0,
      "Text": " of any democracy"
    },
    {
      "Time_Start": 2761.0,
      "Time_End": 2762.0,
      "Text": " because the government"
    },
    {
      "Time_Start": 2763.0,
      "Time_End": 2764.0,
      "Text": " is increasingly saying"
    },
    {
      "Time_Start": 2765.0,
      "Time_End": 2766.0,
      "Text": " we are going to take"
    },
    {
      "Time_Start": 2767.0,
      "Time_End": 2768.0,
      "Text": " your everyday activities"
    },
    {
      "Time_Start": 2769.0,
      "Time_End": 2770.0,
      "Text": " like using a bank account,"
    },
    {
      "Time_Start": 2771.0,
      "Time_End": 2772.0,
      "Text": " lurking and whatever"
    },
    {
      "Time_Start": 2773.0,
      "Time_End": 2774.0,
      "Text": " and use it as a way"
    },
    {
      "Time_Start": 2775.0,
      "Time_End": 2776.0,
      "Text": " to monitor what you are doing"
    },
    {
      "Time_Start": 2777.0,
      "Time_End": 2778.0,
      "Text": " to make sure you're not"
    },
    {
      "Time_Start": 2779.0,
      "Time_End": 2780.0,
      "Text": " one of the bad people."
    },
    {
      "Time_Start": 2781.0,
      "Time_End": 2782.0,
      "Text": " The problem is we are the ones"
    },
    {
      "Time_Start": 2783.0,
      "Time_End": 2784.0,
      "Text": " who allow this to happen"
    },
    {
      "Time_Start": 2785.0,
      "Time_End": 2786.0,
      "Text": " because of our privacy"
    },
    {
      "Time_Start": 2787.0,
      "Time_End": 2788.0,
      "Text": " by saying, well,"
    },
    {
      "Time_Start": 2789.0,
      "Time_End": 2790.0,
      "Text": " shouldn't those children"
    },
    {
      "Time_Start": 2791.0,
      "Time_End": 2792.0,
      "Text": " get their child support?"
    },
    {
      "Time_Start": 2793.0,
      "Time_End": 2794.0,
      "Text": " Yes, but there's 270 million people"
    },
    {
      "Time_Start": 2795.0,
      "Time_End": 2796.0,
      "Text": " in this country."
    },
    {
      "Time_Start": 2797.0,
      "Time_End": 2798.0,
      "Text": " Should we take the privacy away"
    },
    {
      "Time_Start": 2799.0,
      "Time_End": 2800.0,
      "Text": " of all of those people"
    },
    {
      "Time_Start": 2801.0,
      "Time_End": 2802.0,
      "Text": " to get a quarter million people"
    },
    {
      "Time_Start": 2803.0,
      "Time_End": 2804.0,
      "Text": " who won't honor the obligations"
    },
    {
      "Time_Start": 2805.0,
      "Time_End": 2806.0,
      "Text": " to their children?"
    },
    {
      "Time_Start": 2807.0,
      "Time_End": 2808.0,
      "Text": " This is the fundamental challenge"
    },
    {
      "Time_Start": 2809.0,
      "Time_End": 2810.0,
      "Text": " of a democracy."
    },
    {
      "Time_Start": 2811.0,
      "Time_End": 2812.0,
      "Text": " A few of the guilty,"
    },
    {
      "Time_Start": 2813.0,
      "Time_End": 2814.0,
      "Text": " so to speak,"
    },
    {
      "Time_Start": 2815.0,
      "Time_End": 2816.0,
      "Text": " must be protected"
    },
    {
      "Time_Start": 2817.0,
      "Time_End": 2818.0,
      "Text": " even if the protection"
    },
    {
      "Time_Start": 2819.0,
      "Time_End": 2820.0,
      "Text": " of that privacy"
    },
    {
      "Time_Start": 2821.0,
      "Time_End": 2822.0,
      "Text": " allows some people"
    },
    {
      "Time_Start": 2823.0,
      "Time_End": 2824.0,
      "Text": " to escape societal sanction."
    },
    {
      "Time_Start": 2825.0,
      "Time_End": 2826.0,
      "Text": " This is the challenge"
    },
    {
      "Time_Start": 2827.0,
      "Time_End": 2828.0,
      "Text": " that we face"
    },
    {
      "Time_Start": 2829.0,
      "Time_End": 2830.0,
      "Text": " because if we're not careful"
    },
    {
      "Time_Start": 2831.0,
      "Time_End": 2832.0,
      "Text": " we might be here"
    },
    {
      "Time_Start": 2833.0,
      "Time_End": 2834.0,
      "Text": " at DEFCON 20"
    },
    {
      "Time_Start": 2835.0,
      "Time_End": 2836.0,
      "Text": " where I'll have a lot more"
    },
    {
      "Time_Start": 2837.0,
      "Time_End": 2838.0,
      "Text": " gray hair and you guys will too"
    },
    {
      "Time_Start": 2839.0,
      "Time_End": 2840.0,
      "Text": " and it is where I say"
    },
    {
      "Time_Start": 2841.0,
      "Time_End": 2842.0,
      "Text": " thank you for the letters"
    },
    {
      "Time_Start": 2843.0,
      "Time_End": 2844.0,
      "Text": " you've sent me."
    },
    {
      "Time_Start": 2845.0,
      "Time_End": 2846.0,
      "Text": " That could actually happen."
    },
    {
      "Time_Start": 2847.0,
      "Time_End": 2848.0,
      "Text": " So this is why I say"
    },
    {
      "Time_Start": 2849.0,
      "Time_End": 2850.0,
      "Text": " what this will give you"
    },
    {
      "Time_Start": 2851.0,
      "Time_End": 2852.0,
      "Text": " the ability to do"
    },
    {
      "Time_Start": 2853.0,
      "Time_End": 2854.0,
      "Text": " is to carve out a zone of privacy"
    },
    {
      "Time_Start": 2855.0,
      "Time_End": 2856.0,
      "Text": " so that if somebody wants"
    },
    {
      "Time_Start": 2857.0,
      "Time_End": 2858.0,
      "Text": " to know all about you"
    },
    {
      "Time_Start": 2859.0,
      "Time_End": 2860.0,
      "Text": " they better be willing"
    },
    {
      "Time_Start": 2861.0,
      "Time_End": 2862.0,
      "Text": " to spend a lot of money"
    },
    {
      "Time_Start": 2863.0,
      "Time_End": 2864.0,
      "Text": " and go through a lot of effort"
    },
    {
      "Time_Start": 2865.0,
      "Time_End": 2866.0,
      "Text": " to do so."
    },
    {
      "Time_Start": 2867.0,
      "Time_End": 2868.0,
      "Text": " That's what I can give you"
    },
    {
      "Time_Start": 2869.0,
      "Time_End": 2870.0,
      "Text": " the tools to do,"
    },
    {
      "Time_Start": 2871.0,
      "Time_End": 2872.0,
      "Text": " the weapons to do."
    },
    {
      "Time_Start": 2873.0,
      "Time_End": 2874.0,
      "Text": " And if more of us do that"
    },
    {
      "Time_Start": 2875.0,
      "Time_End": 2876.0,
      "Text": " that's what we do"
    },
    {
      "Time_Start": 2877.0,
      "Time_End": 2878.0,
      "Text": " all of the time."
    },
    {
      "Time_Start": 2879.0,
      "Time_End": 2880.0,
      "Text": " And a backlash is starting"
    },
    {
      "Time_Start": 2881.0,
      "Time_End": 2882.0,
      "Text": " and if more people"
    },
    {
      "Time_Start": 2883.0,
      "Time_End": 2884.0,
      "Text": " will hear the call"
    },
    {
      "Time_Start": 2885.0,
      "Time_End": 2886.0,
      "Text": " privacy is not lost yet"
    },
    {
      "Time_Start": 2887.0,
      "Time_End": 2888.0,
      "Text": " but it's up to us"
    },
    {
      "Time_Start": 2889.0,
      "Time_End": 2890.0,
      "Text": " to protect it and to take it back"
    },
    {
      "Time_Start": 2891.0,
      "Time_End": 2892.0,
      "Text": " and to keep what we have."
    },
    {
      "Time_Start": 2893.0,
      "Time_End": 2894.0,
      "Text": " Thank you very much."
    }
  ]
}