{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Convention. This meeting was held in exciting Las Vegas, Nevada from July 9th through the 11th, 1999."
    },
    {
      "Time_Start": 8.0,
      "Time_End": 13.0,
      "Text": " This has been the Entertainment Report 47, Crypto Tales."
    },
    {
      "Time_Start": 13.0,
      "Time_End": 22.0,
      "Text": " Okay. So, that's a bit loud I think."
    },
    {
      "Time_Start": 23.0,
      "Time_End": 29.0,
      "Text": " Okay. So, I'm Samir. I've been doing crypto stuff for a few years now."
    },
    {
      "Time_Start": 29.0,
      "Time_End": 32.0,
      "Text": " So, I'm going to tell a bunch of stories about stuff in the crypto industry."
    },
    {
      "Time_Start": 32.0,
      "Time_End": 35.0,
      "Text": " Stuff that I've done with my company in the past."
    },
    {
      "Time_Start": 35.0,
      "Time_End": 37.0,
      "Text": " Stuff that other people have done in the crypto industry."
    },
    {
      "Time_Start": 37.0,
      "Time_End": 39.0,
      "Text": " Some amazing stories you might not have heard before."
    },
    {
      "Time_Start": 39.0,
      "Time_End": 46.0,
      "Text": " If anyone has a specific story they'd like to hear that I might know, feel free to request a story."
    },
    {
      "Time_Start": 46.0,
      "Time_End": 50.0,
      "Text": " Because I might know the story and I could tell it, and so that could be fun."
    },
    {
      "Time_Start": 50.0,
      "Time_End": 55.0,
      "Text": " So, I mean, to start off, does anyone have any specific requests to begin with?"
    },
    {
      "Time_Start": 55.0,
      "Time_End": 59.0,
      "Text": " Or should I just come up with my own list of stories to start with?"
    },
    {
      "Time_Start": 59.0,
      "Time_End": 64.0,
      "Text": " Requests? Okay. So, let me come up with a story."
    },
    {
      "Time_Start": 64.0,
      "Time_End": 66.0,
      "Text": " Oh, you do? Okay."
    },
    {
      "Time_Start": 70.0,
      "Time_End": 72.0,
      "Text": " Okay, I don't know that story very well because I wasn't there."
    },
    {
      "Time_Start": 72.0,
      "Time_End": 74.0,
      "Text": " But I can tell that story."
    },
    {
      "Time_Start": 74.0,
      "Time_End": 78.0,
      "Text": " So, I can make it up too."
    },
    {
      "Time_Start": 78.0,
      "Time_End": 81.0,
      "Text": " So, apparently, the story is this."
    },
    {
      "Time_Start": 81.0,
      "Time_End": 84.0,
      "Text": " It's not a very long story because I wasn't there."
    },
    {
      "Time_Start": 84.0,
      "Time_End": 87.0,
      "Text": " So, Jim Boots asked me to talk to some NSA people."
    },
    {
      "Time_Start": 87.0,
      "Time_End": 88.0,
      "Text": " This was actually a long time ago."
    },
    {
      "Time_Start": 88.0,
      "Time_End": 91.0,
      "Text": " This was probably in 92 or 93 or something like that."
    },
    {
      "Time_Start": 91.0,
      "Time_End": 94.0,
      "Text": " A long time ago on the grand scale of things, of course."
    },
    {
      "Time_Start": 94.0,
      "Time_End": 98.0,
      "Text": " And, of course, RSA has had an interesting relationship with the NSA"
    },
    {
      "Time_Start": 98.0,
      "Time_End": 100.0,
      "Text": " because, of course, they always get export license."
    },
    {
      "Time_Start": 100.0,
      "Time_End": 106.0,
      "Text": " They've already made a lot of money for their cryptography and stuff."
    },
    {
      "Time_Start": 106.0,
      "Time_End": 108.0,
      "Text": " So, they have to maintain a good relationship with the NSA."
    },
    {
      "Time_Start": 108.0,
      "Time_End": 113.0,
      "Text": " But, of course, they also have to maintain a good relationship with the crypto community"
    },
    {
      "Time_Start": 113.0,
      "Time_End": 119.0,
      "Text": " and claim and have a very antagonistic attitude with the NSA in the public eye."
    },
    {
      "Time_Start": 119.0,
      "Time_End": 125.0,
      "Text": " So, it creates an interesting perspective because RSA has to kiss NSA ass on one side"
    },
    {
      "Time_Start": 125.0,
      "Time_End": 127.0,
      "Text": " and they also have to kick their ass on the other side."
    },
    {
      "Time_Start": 127.0,
      "Time_End": 132.0,
      "Text": " So, I'm not sure if this was actually the case back when this happened."
    },
    {
      "Time_Start": 132.0,
      "Time_End": 138.0,
      "Text": " But, apparently, Jim Boots also likes to tell this story of how when, at one point,"
    },
    {
      "Time_Start": 138.0,
      "Time_End": 141.0,
      "Text": " he was talking to some NSA guys and they were being assholes to him"
    },
    {
      "Time_Start": 141.0,
      "Time_End": 143.0,
      "Text": " and he was being an asshole to them."
    },
    {
      "Time_Start": 144.0,
      "Time_End": 150.0,
      "Text": " And, then they just said, rather casually, that they could just fix this out in the parking lot"
    },
    {
      "Time_Start": 150.0,
      "Time_End": 152.0,
      "Text": " with a car running over him."
    },
    {
      "Time_Start": 152.0,
      "Time_End": 155.0,
      "Text": " And, so, he didn't appreciate that very much."
    },
    {
      "Time_Start": 155.0,
      "Time_End": 159.0,
      "Text": " And, so, he started telling lots of people and people were kind of amused by that."
    },
    {
      "Time_Start": 159.0,
      "Time_End": 164.0,
      "Text": " And, it was kind of hard to say whether or not that was an actual death threat from the NSA,"
    },
    {
      "Time_Start": 164.0,
      "Time_End": 168.0,
      "Text": " whether or not Jim Boots just invented that story for his own personal amusement"
    },
    {
      "Time_Start": 168.0,
      "Time_End": 173.0,
      "Text": " or for his own personal advantage, or if they were just joking."
    },
    {
      "Time_Start": 173.0,
      "Time_End": 176.0,
      "Text": " And, just like, whatever, we're really not going to kill you."
    },
    {
      "Time_Start": 176.0,
      "Time_End": 179.0,
      "Text": " You're just a dumbass if you think we're going to kill you kind of thing."
    },
    {
      "Time_Start": 179.0,
      "Time_End": 183.0,
      "Text": " So, that was the Jim Boots ass story."
    },
    {
      "Time_Start": 183.0,
      "Time_End": 186.0,
      "Text": " So, okay, let's see."
    },
    {
      "Time_Start": 186.0,
      "Time_End": 195.0,
      "Text": " So, I started my company, C2Net, in 1994 as an internet service provider, internet privacy company."
    },
    {
      "Time_Start": 195.0,
      "Time_End": 202.0,
      "Text": " So, what I was doing then was, I started a company in 1994 because I was living in California."
    },
    {
      "Time_Start": 202.0,
      "Time_End": 206.0,
      "Text": " I had been living in California for about a year and I was going to all the cypherpunks meetings"
    },
    {
      "Time_Start": 206.0,
      "Time_End": 211.0,
      "Text": " and all of these people were saying, oh, we're going to implement anonymous technology"
    },
    {
      "Time_Start": 211.0,
      "Time_End": 214.0,
      "Text": " and the government's going to be irrelevant and we're all going to have a lovely anarchy"
    },
    {
      "Time_Start": 214.0,
      "Time_End": 219.0,
      "Text": " and life will be great and everything will be hunky-dory and we won't have to pay taxes"
    },
    {
      "Time_Start": 219.0,
      "Time_End": 221.0,
      "Text": " and it will all be good."
    },
    {
      "Time_Start": 221.0,
      "Time_End": 224.0,
      "Text": " But, all of these people were like, okay, this is all going to happen."
    },
    {
      "Time_Start": 224.0,
      "Time_End": 228.0,
      "Text": " And they said, oh, all this cryptography technology is going to make all of this stuff happen."
    },
    {
      "Time_Start": 228.0,
      "Time_End": 235.0,
      "Text": " But, they thought that angels from the sky were going to come down and just tap their magic wand"
    },
    {
      "Time_Start": 235.0,
      "Time_End": 239.0,
      "Text": " and then all this technology would exist and it would be deployed and people would use it"
    },
    {
      "Time_Start": 239.0,
      "Time_End": 242.0,
      "Text": " and people would make money and they wouldn't have to pay taxes and it would be all good."
    },
    {
      "Time_Start": 242.0,
      "Time_End": 246.0,
      "Text": " But, of course, I knew that that was never going to happen."
    },
    {
      "Time_Start": 246.0,
      "Time_End": 249.0,
      "Text": " There were no angels who were going to come down from the sky to solve all our problems for us."
    },
    {
      "Time_Start": 249.0,
      "Time_End": 256.0,
      "Text": " So, I started my company in 94 to solve those problems, hopefully."
    },
    {
      "Time_Start": 256.0,
      "Time_End": 264.0,
      "Text": " So, I started out in 94 and it was kind of fun."
    },
    {
      "Time_Start": 264.0,
      "Time_End": 277.0,
      "Text": " We did anonymous web hosting, anonymous site, anonymous mail, anonymous web hosting,"
    },
    {
      "Time_Start": 277.0,
      "Time_End": 279.0,
      "Text": " anonymous pseudonyms."
    },
    {
      "Time_Start": 279.0,
      "Time_End": 289.0,
      "Text": " The pseudonym stuff is very similar in design to the mail services done by Zero Knowledge today."
    },
    {
      "Time_Start": 289.0,
      "Time_End": 294.0,
      "Text": " They're actually doing a company which will make some money at it as opposed to my company which didn't."
    },
    {
      "Time_Start": 294.0,
      "Time_End": 303.0,
      "Text": " But, the basic idea is that your mail gets forwarded to a bunch of different hops so that it can't be traced."
    },
    {
      "Time_Start": 303.0,
      "Time_End": 314.0,
      "Text": " Now, I built this system because the traditional anonymous servers, such as anon.peanut.fi,"
    },
    {
      "Time_Start": 314.0,
      "Time_End": 317.0,
      "Text": " were built with a very single point of failure in them."
    },
    {
      "Time_Start": 317.0,
      "Time_End": 324.0,
      "Text": " If you had an account in anon.peanut.fi and, say, someone like the Scientologists wanted to find out who you were,"
    },
    {
      "Time_Start": 324.0,
      "Time_End": 328.0,
      "Text": " all they had to do was go to Finland, spend lots of money and bribe the Finnish government"
    },
    {
      "Time_Start": 328.0,
      "Time_End": 330.0,
      "Text": " or whatever you have to do in Finland to get your way."
    },
    {
      "Time_Start": 331.0,
      "Time_End": 339.0,
      "Text": " And then what they end up doing is getting access to your real identity because all of the actual sensitive information"
    },
    {
      "Time_Start": 339.0,
      "Time_End": 345.0,
      "Text": " is actually stored in one place and all you have to do is break into the computer or subpoena the computer or whatever"
    },
    {
      "Time_Start": 345.0,
      "Time_End": 348.0,
      "Text": " and you get all the sensitive information and that's not very safe."
    },
    {
      "Time_Start": 348.0,
      "Time_End": 351.0,
      "Text": " So, I set up the system so that even if my server was subpoenaed,"
    },
    {
      "Time_Start": 351.0,
      "Time_End": 358.0,
      "Text": " I wouldn't actually be revealing the real identities of the anonymous users."
    },
    {
      "Time_Start": 358.0,
      "Time_End": 362.0,
      "Text": " So, I set up the system and people started using it and it was all good."
    },
    {
      "Time_Start": 364.0,
      "Time_End": 368.0,
      "Text": " And people were using the anon.peanut.fi system because it was a lot easier to use."
    },
    {
      "Time_Start": 368.0,
      "Time_End": 375.0,
      "Text": " So, my system was being used by the ultra paranoid and the anon.peanut.fi system was being used by the less paranoid."
    },
    {
      "Time_Start": 375.0,
      "Time_End": 380.0,
      "Text": " And so it was all good. It was a nice marketplace for anonymity in the community."
    },
    {
      "Time_Start": 380.0,
      "Time_End": 386.0,
      "Text": " But then the Scientologists actually did spend a lot of money and they went to anon.peanut.fi"
    },
    {
      "Time_Start": 386.0,
      "Time_End": 390.0,
      "Text": " and they convinced the Finnish government to,"
    },
    {
      "Time_Start": 390.0,
      "Time_End": 396.0,
      "Text": " at first they wanted to get the entire database of all the anonymous identities mapped to real identities."
    },
    {
      "Time_Start": 396.0,
      "Time_End": 400.0,
      "Text": " And the Finnish government has much stronger protections for privacy than the US government has"
    },
    {
      "Time_Start": 400.0,
      "Time_End": 406.0,
      "Text": " so they actually, it was actually very difficult for the Scientologists to get that information."
    },
    {
      "Time_Start": 406.0,
      "Time_End": 410.0,
      "Text": " They had to go to court many times and spend lots of money on legal bills."
    },
    {
      "Time_Start": 410.0,
      "Time_End": 415.0,
      "Text": " I'm sure the Scientologist lawyers were happy with that situation because they made lots of money off the deal."
    },
    {
      "Time_Start": 415.0,
      "Time_End": 421.0,
      "Text": " But, so it was a lot of work and in the end the Finnish government did end up caving."
    },
    {
      "Time_Start": 421.0,
      "Time_End": 425.0,
      "Text": " But they didn't reveal, they didn't want to give up the entire database."
    },
    {
      "Time_Start": 425.0,
      "Time_End": 432.0,
      "Text": " They said, well you're only looking for two guys so we're just going to force peanut.fi to reveal the two guys."
    },
    {
      "Time_Start": 432.0,
      "Time_End": 435.0,
      "Text": " So, the Finnish government eventually caved in."
    },
    {
      "Time_Start": 435.0,
      "Time_End": 445.0,
      "Text": " And Johan Ulf, who was running peanut.fi was pretty much devastated by this."
    },
    {
      "Time_Start": 445.0,
      "Time_End": 452.0,
      "Text": " He had previously thought that his security model was going to work because the Finnish government was on his side."
    },
    {
      "Time_Start": 452.0,
      "Time_End": 455.0,
      "Text": " He later learned, of course, that the Finnish government wasn't on his side."
    },
    {
      "Time_Start": 455.0,
      "Time_End": 461.0,
      "Text": " They only had these laws because there was one level of protection against the attack."
    },
    {
      "Time_Start": 461.0,
      "Time_End": 467.0,
      "Text": " And, of course, the Scientologist managed to breach that level of protection, the Finnish laws he was relying upon."
    },
    {
      "Time_Start": 467.0,
      "Time_End": 471.0,
      "Text": " So, because he was so upset over this, he shut down the peanut.fi server."
    },
    {
      "Time_Start": 471.0,
      "Time_End": 473.0,
      "Text": " And now no one can use the peanut.fi server."
    },
    {
      "Time_Start": 473.0,
      "Time_End": 476.0,
      "Text": " Because he didn't want to give people a false sense of security."
    },
    {
      "Time_Start": 476.0,
      "Time_End": 481.0,
      "Text": " What I was saying, what I was doing in order to try to market my product was, of course, saying this."
    },
    {
      "Time_Start": 481.0,
      "Time_End": 483.0,
      "Text": " He was giving people a false sense of security."
    },
    {
      "Time_Start": 483.0,
      "Time_End": 488.0,
      "Text": " But, in fact, as long as it's marketed right, it's not a false sense of security."
    },
    {
      "Time_Start": 488.0,
      "Time_End": 490.0,
      "Text": " You just know how much security you're getting."
    },
    {
      "Time_Start": 490.0,
      "Time_End": 493.0,
      "Text": " And you can either go to peanut.fi if you want something that's easy to use,"
    },
    {
      "Time_Start": 493.0,
      "Time_End": 502.0,
      "Text": " or you go to my server running at alpha.c2.org if you want actual security that can withstand a Scientology attack."
    },
    {
      "Time_Start": 502.0,
      "Time_End": 506.0,
      "Text": " So, it was shut down. Everyone was upset."
    },
    {
      "Time_Start": 506.0,
      "Time_End": 507.0,
      "Text": " There was all sorts of clamoring."
    },
    {
      "Time_Start": 507.0,
      "Time_End": 509.0,
      "Text": " Oh no, it's being shut down. The Scientologists suck."
    },
    {
      "Time_Start": 509.0,
      "Time_End": 512.0,
      "Text": " We should kick their asses. You know, whatever."
    },
    {
      "Time_Start": 512.0,
      "Time_End": 516.0,
      "Text": " Ulf eventually got an EFF Pioneer Award, which was all good."
    },
    {
      "Time_Start": 516.0,
      "Time_End": 518.0,
      "Text": " We're all very proud of him for that."
    },
    {
      "Time_Start": 518.0,
      "Time_End": 522.0,
      "Text": " And then things eventually slowly died down."
    },
    {
      "Time_Start": 522.0,
      "Time_End": 526.0,
      "Text": " My company changed focus, which I'll get to later."
    },
    {
      "Time_Start": 526.0,
      "Time_End": 532.0,
      "Text": " But after about three years or so, according to Finnish law,"
    },
    {
      "Time_Start": 532.0,
      "Time_End": 536.0,
      "Text": " after three years the records for an investigation need to be opened up."
    },
    {
      "Time_Start": 536.0,
      "Time_End": 539.0,
      "Text": " So the Finnish government released the records for the investigation."
    },
    {
      "Time_Start": 539.0,
      "Time_End": 545.0,
      "Text": " And the records included the real identities of the people the Scientologists spent a lot of money"
    },
    {
      "Time_Start": 545.0,
      "Time_End": 547.0,
      "Text": " trying to get."
    },
    {
      "Time_Start": 547.0,
      "Time_End": 552.0,
      "Text": " And it turns out that the so-called real identities hidden by the peanut.fi service"
    },
    {
      "Time_Start": 552.0,
      "Time_End": 554.0,
      "Text": " were actually pointing at my pseudonymous server,"
    },
    {
      "Time_Start": 554.0,
      "Time_End": 558.0,
      "Text": " which there would have been no way the Scientologists would have gotten at that."
    },
    {
      "Time_Start": 558.0,
      "Time_End": 559.0,
      "Text": " They could have tried to sue me."
    },
    {
      "Time_Start": 559.0,
      "Time_End": 563.0,
      "Text": " They never actually contacted me, so I figure they knew that they would have had no hope"
    },
    {
      "Time_Start": 563.0,
      "Time_End": 566.0,
      "Text": " if they tried contacting me, because I actually probably wouldn't have even"
    },
    {
      "Time_Start": 566.0,
      "Time_End": 568.0,
      "Text": " needed a subpoena at that point."
    },
    {
      "Time_Start": 568.0,
      "Time_End": 571.0,
      "Text": " I would have just given them some cipher text, which they couldn't decrypt."
    },
    {
      "Time_Start": 571.0,
      "Time_End": 574.0,
      "Text": " I probably would have asked for a subpoena, because it would have cost them more money,"
    },
    {
      "Time_Start": 574.0,
      "Time_End": 576.0,
      "Text": " but it's always good to make the Scientologists pay."
    },
    {
      "Time_Start": 576.0,
      "Time_End": 581.0,
      "Text": " So that was pretty cool."
    },
    {
      "Time_Start": 581.0,
      "Time_End": 583.0,
      "Text": " Because we knew that the Scientologists spent huge amounts of money"
    },
    {
      "Time_Start": 583.0,
      "Time_End": 586.0,
      "Text": " trying to get that information, and then they couldn't get it."
    },
    {
      "Time_Start": 586.0,
      "Time_End": 589.0,
      "Text": " So on to another Scientology story."
    },
    {
      "Time_Start": 589.0,
      "Time_End": 591.0,
      "Text": " This one's kind of amusing."
    },
    {
      "Time_Start": 591.0,
      "Time_End": 594.0,
      "Text": " It's not really crypto-related, but it's still kind of cool."
    },
    {
      "Time_Start": 594.0,
      "Time_End": 600.0,
      "Text": " A friend of mine was working as a network engineer at Ariel's Internet on the East Coast."
    },
    {
      "Time_Start": 600.0,
      "Time_End": 603.0,
      "Text": " And they had a customer the Scientologists didn't like."
    },
    {
      "Time_Start": 603.0,
      "Time_End": 606.0,
      "Text": " So they called him up."
    },
    {
      "Time_Start": 606.0,
      "Time_End": 610.0,
      "Text": " And he was just the guy who answered the phone at the time, because it's a small company."
    },
    {
      "Time_Start": 610.0,
      "Time_End": 615.0,
      "Text": " They didn't have huge banks of tech support people answering the phone or anything like that back then."
    },
    {
      "Time_Start": 615.0,
      "Time_End": 618.0,
      "Text": " So anyway, he answers the phone."
    },
    {
      "Time_Start": 618.0,
      "Time_End": 620.0,
      "Text": " They say to the Scientologists,"
    },
    {
      "Time_Start": 620.0,
      "Time_End": 622.0,
      "Text": " Oh, well, you have to talk to our legal department."
    },
    {
      "Time_Start": 622.0,
      "Time_End": 624.0,
      "Text": " And then they go to the legal department."
    },
    {
      "Time_Start": 624.0,
      "Time_End": 626.0,
      "Text": " The Scientologists eventually sue Ariel's Internet."
    },
    {
      "Time_Start": 626.0,
      "Time_End": 629.0,
      "Text": " And they, of course, name my friend as one of the plaintiffs in the lawsuit,"
    },
    {
      "Time_Start": 629.0,
      "Time_End": 631.0,
      "Text": " because he picked up the phone."
    },
    {
      "Time_Start": 631.0,
      "Time_End": 634.0,
      "Text": " And so anyway, whatever, they sue Ariel's Internet."
    },
    {
      "Time_Start": 634.0,
      "Time_End": 636.0,
      "Text": " The case gets dropped, or whatever."
    },
    {
      "Time_Start": 636.0,
      "Time_End": 638.0,
      "Text": " They settle on exactly what happened."
    },
    {
      "Time_Start": 638.0,
      "Time_End": 641.0,
      "Text": " But then, a few years later, my friend stops working for Ariel's Internet."
    },
    {
      "Time_Start": 641.0,
      "Time_End": 643.0,
      "Text": " He's working for a company in San Francisco."
    },
    {
      "Time_Start": 643.0,
      "Time_End": 648.0,
      "Text": " He's walking around San Francisco one day, and he sees a Scientology store in San Francisco."
    },
    {
      "Time_Start": 648.0,
      "Time_End": 654.0,
      "Text": " He's like, ah, cool, I'm going to go into the Scientology store and see what I can do."
    },
    {
      "Time_Start": 654.0,
      "Time_End": 656.0,
      "Text": " Like, buy Dianetics or something similar like that."
    },
    {
      "Time_Start": 656.0,
      "Time_End": 659.0,
      "Text": " So he goes into the Scientology store, and this guy, this person at the counter,"
    },
    {
      "Time_Start": 659.0,
      "Time_End": 663.0,
      "Text": " she looks at him, and she's like, hey, aren't you that ISP guy?"
    },
    {
      "Time_Start": 663.0,
      "Time_End": 667.0,
      "Text": " And so then, he gets really scared and he turns around and runs away."
    },
    {
      "Time_Start": 671.0,
      "Time_End": 675.0,
      "Text": " Okay, so, so let's see."
    },
    {
      "Time_Start": 675.0,
      "Time_End": 679.0,
      "Text": " So I was running an Internet service."
    },
    {
      "Time_Start": 679.0,
      "Time_End": 682.0,
      "Text": " And so people would get accounts and all this sort of thing."
    },
    {
      "Time_Start": 682.0,
      "Time_End": 686.0,
      "Text": " And in 1996, I came out with a product called Stronghold,"
    },
    {
      "Time_Start": 686.0,
      "Time_End": 691.0,
      "Text": " which is a web server based on Apache, which adds SSL capabilities."
    },
    {
      "Time_Start": 691.0,
      "Time_End": 694.0,
      "Text": " At the time, the only value was that it added SSL capabilities."
    },
    {
      "Time_Start": 694.0,
      "Time_End": 698.0,
      "Text": " Now, there's like lots of marketing literature about what other value it adds."
    },
    {
      "Time_Start": 698.0,
      "Time_End": 702.0,
      "Text": " But at the time, all we did was adding SSL to Apache."
    },
    {
      "Time_Start": 702.0,
      "Time_End": 709.0,
      "Text": " And so the company, at that point, the company wasn't really making any money"
    },
    {
      "Time_Start": 709.0,
      "Time_End": 713.0,
      "Text": " off the web hosting and the anonymous mail services and that sort of thing."
    },
    {
      "Time_Start": 714.0,
      "Time_End": 718.0,
      "Text": " I still had a day job. I was contracting at SGI and all sorts of things."
    },
    {
      "Time_Start": 718.0,
      "Time_End": 723.0,
      "Text": " So, so I knew that the software business was going to make lots of money"
    },
    {
      "Time_Start": 723.0,
      "Time_End": 725.0,
      "Text": " and the services business wasn't making lots of money."
    },
    {
      "Time_Start": 725.0,
      "Time_End": 727.0,
      "Text": " I would have had to invest heavily into that."
    },
    {
      "Time_Start": 727.0,
      "Time_End": 729.0,
      "Text": " The margins were low, all sorts of things like that."
    },
    {
      "Time_Start": 729.0,
      "Time_End": 732.0,
      "Text": " So I wanted, I was migrating off of that."
    },
    {
      "Time_Start": 732.0,
      "Time_End": 735.0,
      "Text": " And then November 1996 rolls around."
    },
    {
      "Time_Start": 735.0,
      "Time_End": 738.0,
      "Text": " And I go to this conference in Florida or whatever."
    },
    {
      "Time_Start": 738.0,
      "Time_End": 739.0,
      "Text": " It was a pretty boring conference."
    },
    {
      "Time_Start": 739.0,
      "Time_End": 742.0,
      "Text": " But by the time I'm done with the conference, I'd gotten all these business leads."
    },
    {
      "Time_Start": 742.0,
      "Time_End": 744.0,
      "Text": " I was really hyped. I was really psyched about doing business."
    },
    {
      "Time_Start": 744.0,
      "Time_End": 748.0,
      "Text": " I had set up, by that point, offshore development centers all over the world."
    },
    {
      "Time_Start": 748.0,
      "Time_End": 752.0,
      "Text": " And I was thinking, well, what could the NSA do to shut me down?"
    },
    {
      "Time_Start": 752.0,
      "Time_End": 756.0,
      "Text": " And I realized that since I was still doing web hosting,"
    },
    {
      "Time_Start": 756.0,
      "Time_End": 759.0,
      "Text": " they could just plant some child porn on my site and, you know,"
    },
    {
      "Time_Start": 759.0,
      "Time_End": 762.0,
      "Text": " go after me for child porn and that would suck."
    },
    {
      "Time_Start": 762.0,
      "Time_End": 766.0,
      "Text": " So I'm thinking, okay, I really need to finish that whole migration away"
    },
    {
      "Time_Start": 766.0,
      "Time_End": 769.0,
      "Text": " from web hosting because that's sort of a liability."
    },
    {
      "Time_Start": 769.0,
      "Time_End": 771.0,
      "Text": " And then I get home."
    },
    {
      "Time_Start": 771.0,
      "Time_End": 774.0,
      "Text": " I'm in the office on Monday."
    },
    {
      "Time_Start": 774.0,
      "Time_End": 777.0,
      "Text": " And we just moved into a new office."
    },
    {
      "Time_Start": 777.0,
      "Time_End": 780.0,
      "Text": " And so the office is all still in shambles, you know."
    },
    {
      "Time_Start": 780.0,
      "Time_End": 782.0,
      "Text": " I'm still putting together my desk and all of this."
    },
    {
      "Time_Start": 782.0,
      "Time_End": 785.0,
      "Text": " And some guy walks in. He hands me a sheet of papers and he says,"
    },
    {
      "Time_Start": 785.0,
      "Time_End": 786.0,
      "Text": " you are served."
    },
    {
      "Time_Start": 786.0,
      "Time_End": 788.0,
      "Text": " I'm like, hmm, what's this?"
    },
    {
      "Time_Start": 788.0,
      "Time_End": 794.0,
      "Text": " And it turns out that we'd been sued for contributory copyright infringement"
    },
    {
      "Time_Start": 794.0,
      "Time_End": 801.0,
      "Text": " by Adobe Traveling Software and one other company whose name escapes me."
    },
    {
      "Time_Start": 801.0,
      "Time_End": 807.0,
      "Text": " But anyway, they sued me and my company for contributory copyright infringement,"
    },
    {
      "Time_Start": 807.0,
      "Time_End": 812.0,
      "Text": " which is not child porn, but it was based on the fact that we had some customers"
    },
    {
      "Time_Start": 812.0,
      "Time_End": 819.0,
      "Text": " hosting web pages on our site that had allegedly material which the SPA,"
    },
    {
      "Time_Start": 819.0,
      "Time_End": 821.0,
      "Text": " the Software Publishers Association,"
    },
    {
      "Time_Start": 821.0,
      "Time_End": 824.0,
      "Text": " considered to be contributory copyright infringement."
    },
    {
      "Time_Start": 824.0,
      "Time_End": 830.0,
      "Text": " So those three things were serial numbers for wares,"
    },
    {
      "Time_Start": 830.0,
      "Time_End": 834.0,
      "Text": " information about how to get, how to crack copy protection,"
    },
    {
      "Time_Start": 834.0,
      "Time_End": 836.0,
      "Text": " and links to sites which host wares."
    },
    {
      "Time_Start": 836.0,
      "Time_End": 840.0,
      "Text": " They didn't actually claim that we had any wares on our site."
    },
    {
      "Time_Start": 840.0,
      "Time_End": 843.0,
      "Text": " They only claimed that we had links and information."
    },
    {
      "Time_Start": 843.0,
      "Time_End": 849.0,
      "Text": " So, and of course, the reason they had sued me, which I later learned,"
    },
    {
      "Time_Start": 849.0,
      "Time_End": 854.0,
      "Text": " is that a few months prior to this, they had sent out an email"
    },
    {
      "Time_Start": 854.0,
      "Time_End": 858.0,
      "Text": " to a large number of Internet providers who apparently they knew"
    },
    {
      "Time_Start": 858.0,
      "Time_End": 863.0,
      "Text": " had some sort of wares or links to wares or whatever on their site."
    },
    {
      "Time_Start": 863.0,
      "Time_End": 867.0,
      "Text": " And their email basically said, please give us a call and we will sue you."
    },
    {
      "Time_Start": 867.0,
      "Time_End": 869.0,
      "Text": " So I never got that email apparently."
    },
    {
      "Time_Start": 869.0,
      "Time_End": 871.0,
      "Text": " My mail server was flaky or whatever."
    },
    {
      "Time_Start": 871.0,
      "Time_End": 873.0,
      "Text": " I didn't know what was going on."
    },
    {
      "Time_Start": 873.0,
      "Time_End": 877.0,
      "Text": " But anyway, all the ISPs who did get that email, they all called up the SPA,"
    },
    {
      "Time_Start": 877.0,
      "Time_End": 882.0,
      "Text": " and then the SPA's response was, sign this code of conduct and we won't sue you."
    },
    {
      "Time_Start": 882.0,
      "Time_End": 887.0,
      "Text": " And this code of conduct the SPA wanted people to sign was pretty heinous."
    },
    {
      "Time_Start": 887.0,
      "Time_End": 891.0,
      "Text": " It basically would have required that the Internet providers"
    },
    {
      "Time_Start": 891.0,
      "Time_End": 894.0,
      "Text": " monitor everything every one of their users did."
    },
    {
      "Time_Start": 894.0,
      "Time_End": 901.0,
      "Text": " And at that point, the various lawsuits had been resolved,"
    },
    {
      "Time_Start": 901.0,
      "Time_End": 905.0,
      "Text": " which showed that an ISP is not liable as long as they don't monitor"
    },
    {
      "Time_Start": 905.0,
      "Time_End": 908.0,
      "Text": " and moderate their traffic."
    },
    {
      "Time_Start": 908.0,
      "Time_End": 913.0,
      "Text": " So by monitoring traffic and agreeing to this code of conduct,"
    },
    {
      "Time_Start": 913.0,
      "Time_End": 917.0,
      "Text": " ISPs were actually signing up for more liability than they had in the first place."
    },
    {
      "Time_Start": 917.0,
      "Time_End": 925.0,
      "Text": " So people actually, most of the providers who received that comment from the SPA,"
    },
    {
      "Time_Start": 925.0,
      "Time_End": 928.0,
      "Text": " please sign this code of conduct and we won't sue you,"
    },
    {
      "Time_Start": 928.0,
      "Time_End": 932.0,
      "Text": " did decide to sign the code of conduct because they were afraid of the SPA."
    },
    {
      "Time_Start": 932.0,
      "Time_End": 936.0,
      "Text": " Two providers, GeoCities and Tripod, didn't sign."
    },
    {
      "Time_Start": 936.0,
      "Time_End": 939.0,
      "Text": " They were like, this is bogus, we're not going to sign this."
    },
    {
      "Time_Start": 939.0,
      "Time_End": 941.0,
      "Text": " And so they didn't sign."
    },
    {
      "Time_Start": 941.0,
      "Time_End": 943.0,
      "Text": " And I of course didn't sign because I had no clue"
    },
    {
      "Time_Start": 943.0,
      "Time_End": 946.0,
      "Text": " that they wanted me to sign this stupid code of conduct."
    },
    {
      "Time_Start": 946.0,
      "Time_End": 950.0,
      "Text": " So GeoCities, Tripod, and CTNet all received this lawsuit."
    },
    {
      "Time_Start": 950.0,
      "Time_End": 955.0,
      "Text": " And it was very clear from their announcements from their tactics"
    },
    {
      "Time_Start": 955.0,
      "Time_End": 961.0,
      "Text": " that the lawsuit was not meant in any way to actually go to court"
    },
    {
      "Time_Start": 961.0,
      "Time_End": 966.0,
      "Text": " or actually be concerned with the fact that we allegedly had"
    },
    {
      "Time_Start": 966.0,
      "Time_End": 968.0,
      "Text": " contributory copyright material on our sites."
    },
    {
      "Time_Start": 968.0,
      "Time_End": 972.0,
      "Text": " They just sued because they wanted us to settle, sign the code of conduct,"
    },
    {
      "Time_Start": 972.0,
      "Time_End": 975.0,
      "Text": " and then they would drop the lawsuit."
    },
    {
      "Time_Start": 975.0,
      "Time_End": 978.0,
      "Text": " And so they dropped the lawsuit on GeoCities and Tripod,"
    },
    {
      "Time_Start": 978.0,
      "Time_End": 982.0,
      "Text": " and GeoCities and Tripod both decided to settle."
    },
    {
      "Time_Start": 982.0,
      "Time_End": 987.0,
      "Text": " They were in the course of negotiating with investors and things along those lines"
    },
    {
      "Time_Start": 987.0,
      "Time_End": 991.0,
      "Text": " and they didn't want the investors to be afraid of the lawsuit and all that sort of thing."
    },
    {
      "Time_Start": 991.0,
      "Time_End": 997.0,
      "Text": " And so they negotiated with the SPA and settled by signing a code of conduct"
    },
    {
      "Time_Start": 997.0,
      "Time_End": 999.0,
      "Text": " which actually wasn't heinous."
    },
    {
      "Time_Start": 999.0,
      "Time_End": 1002.0,
      "Text": " So they did settle, which I think was kind of lame,"
    },
    {
      "Time_Start": 1002.0,
      "Time_End": 1008.0,
      "Text": " but they didn't actually sign a code of conduct which actually restricted them in any way."
    },
    {
      "Time_Start": 1008.0,
      "Time_End": 1011.0,
      "Text": " The code of conduct basically said we will obey the law."
    },
    {
      "Time_Start": 1011.0,
      "Time_End": 1012.0,
      "Text": " Well, duh."
    },
    {
      "Time_Start": 1012.0,
      "Time_End": 1014.0,
      "Text": " So it wasn't anything new."
    },
    {
      "Time_Start": 1014.0,
      "Time_End": 1019.0,
      "Text": " But I was kind of frustrated that they did settle because, of course, the SPA could then claim the victory."
    },
    {
      "Time_Start": 1019.0,
      "Time_End": 1022.0,
      "Text": " I, of course, didn't settle."
    },
    {
      "Time_Start": 1022.0,
      "Time_End": 1029.0,
      "Text": " I called up my friend Mike Godwin at the EFF and was like, help, what do I do?"
    },
    {
      "Time_Start": 1029.0,
      "Time_End": 1032.0,
      "Text": " And so he referred me to a very good attorney in San Francisco"
    },
    {
      "Time_Start": 1032.0,
      "Time_End": 1040.0,
      "Text": " and we told the SPA that they were smoking crack."
    },
    {
      "Time_Start": 1040.0,
      "Time_End": 1046.0,
      "Text": " First, they wouldn't even tell us which ones of our customers had the allegedly contributory copyright material."
    },
    {
      "Time_Start": 1046.0,
      "Time_End": 1054.0,
      "Text": " So the first thing is that what they claimed was contributory copyright was, in fact, protected speech."
    },
    {
      "Time_Start": 1054.0,
      "Time_End": 1058.0,
      "Text": " So if they wanted to take this to court, and if we did, in fact, have what they claimed was on the site,"
    },
    {
      "Time_Start": 1058.0,
      "Time_End": 1061.0,
      "Text": " we would have taken it to court and we would have won."
    },
    {
      "Time_Start": 1061.0,
      "Time_End": 1064.0,
      "Text": " And they probably knew this."
    },
    {
      "Time_Start": 1064.0,
      "Time_End": 1066.0,
      "Text": " But, of course, they weren't interested in going to court."
    },
    {
      "Time_Start": 1066.0,
      "Time_End": 1071.0,
      "Text": " They were interested in getting some press and having a bunch of people sign their stupid little code of conduct."
    },
    {
      "Time_Start": 1071.0,
      "Time_End": 1080.0,
      "Text": " So it wasn't actually the SPA that sued us, of course, because the SPA itself is just a trade organization that has no standing."
    },
    {
      "Time_Start": 1080.0,
      "Time_End": 1086.0,
      "Text": " What the SPA does is they have a bunch of member organizations"
    },
    {
      "Time_Start": 1086.0,
      "Time_End": 1090.0,
      "Text": " and many of their member organizations sign over power of attorney to the SPA"
    },
    {
      "Time_Start": 1090.0,
      "Time_End": 1094.0,
      "Text": " so that the SPA can sue other people on their behalf."
    },
    {
      "Time_Start": 1094.0,
      "Time_End": 1099.0,
      "Text": " So the fact was Adobe and Traveling Software didn't even know that they had sued me."
    },
    {
      "Time_Start": 1099.0,
      "Time_End": 1102.0,
      "Text": " So we called up Adobe and were like, why are you suing us?"
    },
    {
      "Time_Start": 1102.0,
      "Time_End": 1104.0,
      "Text": " This is so anti-internet."
    },
    {
      "Time_Start": 1104.0,
      "Time_End": 1107.0,
      "Text": " And Adobe was all into this web publishing thing, so we're not anti-internet."
    },
    {
      "Time_Start": 1107.0,
      "Time_End": 1109.0,
      "Text": " We didn't know about this lawsuit."
    },
    {
      "Time_Start": 1109.0,
      "Time_End": 1111.0,
      "Text": " We avow all knowledge of this lawsuit."
    },
    {
      "Time_Start": 1111.0,
      "Time_End": 1113.0,
      "Text": " The SPA sucks."
    },
    {
      "Time_Start": 1113.0,
      "Time_End": 1115.0,
      "Text": " They didn't say that."
    },
    {
      "Time_Start": 1115.0,
      "Time_End": 1123.0,
      "Text": " And we didn't actually get significant contacts at Traveling Software or the third company, which name I don't recall."
    },
    {
      "Time_Start": 1123.0,
      "Time_End": 1128.0,
      "Text": " Actually, they misspelled Traveling Software's name in the lawsuit, which I thought was pretty funny."
    },
    {
      "Time_Start": 1128.0,
      "Time_End": 1136.0,
      "Text": " So we didn't even know which one of our customers had the allegedly contributory copyright material on the site."
    },
    {
      "Time_Start": 1136.0,
      "Time_End": 1144.0,
      "Text": " So my attorney calls him up and he's like, well, you know, you claim that they've got contributory copyright infringement material on the site."
    },
    {
      "Time_Start": 1144.0,
      "Time_End": 1147.0,
      "Text": " Why don't you tell us which customers..."
    },
    {
      "Time_Start": 1147.0,
      "Time_End": 1154.0,
      "Text": " At first they alleged that I and my company were actually engaged in contributory copyright infringement, because that's actually what the lawsuit said."
    },
    {
      "Time_Start": 1154.0,
      "Time_End": 1163.0,
      "Text": " It didn't say that I was liable for the acts of my customers, which they implied, which they meant to say, but they actually said I was doing contributory copyright infringement."
    },
    {
      "Time_Start": 1163.0,
      "Time_End": 1174.0,
      "Text": " So anyway, my attorney gave him a call and said, well, which one of these customers are doing the contributory copyright infringement?"
    },
    {
      "Time_Start": 1174.0,
      "Time_End": 1182.0,
      "Text": " And the person, the attorney who actually sued me on this case was like, hmm, I don't know. Let me get back to you on that."
    },
    {
      "Time_Start": 1182.0,
      "Time_End": 1190.0,
      "Text": " So after much harassment, they eventually told us who it was, these two random customers of ours."
    },
    {
      "Time_Start": 1190.0,
      "Time_End": 1198.0,
      "Text": " And so then I went to go look at the website, and all I found on those websites was the alt binary as well as FAQ."
    },
    {
      "Time_Start": 1198.0,
      "Time_End": 1204.0,
      "Text": " And so that was clearly protected speech, so we told them, you guys are on crack, this is all protected speech."
    },
    {
      "Time_Start": 1204.0,
      "Time_End": 1207.0,
      "Text": " You guys need to drop the lawsuit."
    },
    {
      "Time_Start": 1207.0,
      "Time_End": 1220.0,
      "Text": " And then it was about, they'd sued us, they'd filed for the lawsuit and served notice to me on one day, and I believe we had 21 days to file a response."
    },
    {
      "Time_Start": 1220.0,
      "Time_End": 1227.0,
      "Text": " And of course, filing a response would have been pretty expensive, and I didn't want to spend the money, so I didn't actually tell our attorney to actually start writing the response."
    },
    {
      "Time_Start": 1227.0,
      "Time_End": 1231.0,
      "Text": " So it was about five days before we had to file the response."
    },
    {
      "Time_Start": 1231.0,
      "Time_End": 1237.0,
      "Text": " And our attorney was just telling them, well, you know, you guys really need to drop the lawsuit, because if I start working on filing the response,"
    },
    {
      "Time_Start": 1237.0,
      "Time_End": 1242.0,
      "Text": " and then we counter-sue you, you guys are going to be liable for my legal fees, and it's not going to be cheap."
    },
    {
      "Time_Start": 1242.0,
      "Time_End": 1252.0,
      "Text": " So they dropped the lawsuit, but they dropped the lawsuit without prejudice, which basically means that they reserved the right to file it again."
    },
    {
      "Time_Start": 1253.0,
      "Time_End": 1259.0,
      "Text": " They claimed that they dropped the lawsuit because there was confusion over whether or not I had received that initial email."
    },
    {
      "Time_Start": 1259.0,
      "Time_End": 1264.0,
      "Text": " Not because they had no case and they were total dumbasses."
    },
    {
      "Time_Start": 1264.0,
      "Time_End": 1272.0,
      "Text": " But they claimed that, okay, we're dropping this lawsuit as a good faith measure, but we still want you to sign the Code of Conduct."
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1275.0,
      "Text": " And if you don't sign the Code of Conduct, we might file the lawsuit again."
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1282.0,
      "Text": " And I told them that they needed to apologize and recover my legal fees before I would even answer their telephone calls."
    },
    {
      "Time_Start": 1282.0,
      "Time_End": 1289.0,
      "Text": " And they didn't apologize, they didn't give me my legal fees back, and of course they didn't sue me again because they had no case."
    },
    {
      "Time_Start": 1290.0,
      "Time_End": 1300.0,
      "Text": " So it turned out, after this lovely adventure, I learned that of all of the SPA members,"
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1306.0,
      "Text": " the only three SPA members that had given the SPA power of attorney were those three companies that had sued me."
    },
    {
      "Time_Start": 1306.0,
      "Time_End": 1310.0,
      "Text": " So I'm not going to go into the details of the SPA, but..."
    },
    {
      "Time_Start": 1310.0,
      "Time_End": 1312.0,
      "Text": " Did they sue you and give you money back?"
    },
    {
      "Time_Start": 1312.0,
      "Time_End": 1315.0,
      "Text": " No, they didn't. They didn't apologize and they didn't give me any money."
    },
    {
      "Time_Start": 1315.0,
      "Time_End": 1322.0,
      "Text": " I would have preferred, if I had to pick one or the other, the apology or the money, I would have picked the apology because it wasn't a whole lot of money."
    },
    {
      "Time_Start": 1322.0,
      "Time_End": 1324.0,
      "Text": " And I got a lot of press out of it, so I thought it was cool."
    },
    {
      "Time_Start": 1324.0,
      "Time_End": 1334.0,
      "Text": " But I really thought that, because they didn't apologize, that other internet providers were at risk of them doing the same thing to them."
    },
    {
      "Time_Start": 1334.0,
      "Time_End": 1337.0,
      "Text": " And that was just clearly a bad situation."
    },
    {
      "Time_Start": 1337.0,
      "Time_End": 1341.0,
      "Text": " So if they apologized and acknowledged the fact that what they did was wrong,"
    },
    {
      "Time_Start": 1341.0,
      "Time_End": 1346.0,
      "Text": " that they sued me just because they wanted me to sign a code of conduct and it was just a total bullying tactic,"
    },
    {
      "Time_Start": 1346.0,
      "Time_End": 1352.0,
      "Text": " then I thought, okay, these people maybe will see the light of day and will talk to them on a reasonable basis as a human to a human,"
    },
    {
      "Time_Start": 1352.0,
      "Time_End": 1357.0,
      "Text": " as opposed to treating them like the scum they are."
    },
    {
      "Time_Start": 1357.0,
      "Time_End": 1361.0,
      "Text": " So anyway, that was the..."
    },
    {
      "Time_Start": 1361.0,
      "Time_End": 1369.0,
      "Text": " So I later learned that the only three companies that now, that at that point, had given the SPA power of attorney to sue were those three companies."
    },
    {
      "Time_Start": 1369.0,
      "Time_End": 1375.0,
      "Text": " They are sort of losing respectability within their customer base, which is a good thing."
    },
    {
      "Time_Start": 1375.0,
      "Time_End": 1379.0,
      "Text": " Because, of course, software piracy isn't such a good thing."
    },
    {
      "Time_Start": 1379.0,
      "Time_End": 1383.0,
      "Text": " I've made a significant amount of money selling software and I don't like my software pirates."
    },
    {
      "Time_Start": 1383.0,
      "Time_End": 1394.0,
      "Text": " So the SPA not being the organization to protect against privacy is a good...piracy is a good thing."
    },
    {
      "Time_Start": 1394.0,
      "Time_End": 1401.0,
      "Text": " But it was kind of amusing because I was a privacy company, so I'd always say piracy, but I'd say privacy by mistake and it would be all very confusing."
    },
    {
      "Time_Start": 1401.0,
      "Time_End": 1405.0,
      "Text": " So anyway, that's the SPA story."
    },
    {
      "Time_Start": 1405.0,
      "Time_End": 1409.0,
      "Text": " Let's see, more stories."
    },
    {
      "Time_Start": 1409.0,
      "Time_End": 1413.0,
      "Text": " Fourth of July, what's the Fourth of July story?"
    },
    {
      "Time_Start": 1413.0,
      "Time_End": 1417.0,
      "Text": " Oh yeah, okay, I'll throw that story. That story's kind of fun."
    },
    {
      "Time_Start": 1417.0,
      "Time_End": 1430.0,
      "Text": " So anyway, this is 1997 and I'll tell the earlier 97 media story first because it's kind of funny."
    },
    {
      "Time_Start": 1430.0,
      "Time_End": 1444.0,
      "Text": " So in May 96 and early 97, I and a bunch of friends and a bunch of people from C2, we would always go to a breakfast brunch at the Thai Temple in Berkeley every Sunday morning."
    },
    {
      "Time_Start": 1444.0,
      "Time_End": 1464.0,
      "Text": " So I was there and one day a bunch of new people who I'd never met before from Japan were there and they were all chatting and they were apparently from the press and they were doing a documentary on cryptography."
    },
    {
      "Time_Start": 1464.0,
      "Time_End": 1468.0,
      "Text": " So I was like, okay, cool, I got their name and all of this stuff."
    },
    {
      "Time_Start": 1468.0,
      "Time_End": 1474.0,
      "Text": " And then they went back to Japan, did some more research, came back, and then they decided they wanted to cover C2Net and PGP."
    },
    {
      "Time_Start": 1474.0,
      "Time_End": 1478.0,
      "Text": " So they allocated two weeks to cover PGP and two weeks to cover C2Net."
    },
    {
      "Time_Start": 1478.0,
      "Time_End": 1484.0,
      "Text": " And the first two weeks they allocated was the first two weeks of February and that was PGP, so they covered PGP during that time."
    },
    {
      "Time_Start": 1484.0,
      "Time_End": 1494.0,
      "Text": " And then the second two weeks was they were covering C2Net."
    },
    {
      "Time_Start": 1495.0,
      "Time_End": 1504.0,
      "Text": " But we told them, well, if you're covering us, that's not going to work so well because the first week is fine because we're going to be in the office and you can film us and whatever and we can take interviews and all this."
    },
    {
      "Time_Start": 1504.0,
      "Time_End": 1507.0,
      "Text": " But the next week, we're going to a conference in Angola."
    },
    {
      "Time_Start": 1507.0,
      "Time_End": 1511.0,
      "Text": " Angola is a small island three miles from St. Martin in the Eastern Caribbean."
    },
    {
      "Time_Start": 1511.0,
      "Time_End": 1513.0,
      "Text": " It takes 15 hours to get there."
    },
    {
      "Time_Start": 1513.0,
      "Time_End": 1515.0,
      "Text": " You have to take a small little plane to get there."
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1517.0,
      "Text": " There's only about 8,000 people who live there."
    },
    {
      "Time_Start": 1517.0,
      "Time_End": 1519.0,
      "Text": " They have no taxes."
    },
    {
      "Time_Start": 1519.0,
      "Time_End": 1521.0,
      "Text": " We were going to a conference there."
    },
    {
      "Time_Start": 1521.0,
      "Time_End": 1525.0,
      "Text": " We told them, well, you know, it would be great if you film us and all, but we're going to this conference."
    },
    {
      "Time_Start": 1525.0,
      "Time_End": 1527.0,
      "Text": " So they call back to the home office."
    },
    {
      "Time_Start": 1527.0,
      "Time_End": 1529.0,
      "Text": " They're like, can we go to Angola?"
    },
    {
      "Time_Start": 1529.0,
      "Time_End": 1531.0,
      "Text": " The home office says yes."
    },
    {
      "Time_Start": 1531.0,
      "Time_End": 1536.0,
      "Text": " So they fly to Angola before we do."
    },
    {
      "Time_Start": 1536.0,
      "Time_End": 1538.0,
      "Text": " But I didn't know this."
    },
    {
      "Time_Start": 1538.0,
      "Time_End": 1540.0,
      "Text": " I just thought, okay, they're back in their hotel."
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1541.0,
      "Text": " They'll be in Angola."
    },
    {
      "Time_Start": 1541.0,
      "Time_End": 1542.0,
      "Text": " They'll be filming us."
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1543.0,
      "Text": " It'll be all good."
    },
    {
      "Time_Start": 1543.0,
      "Time_End": 1545.0,
      "Text": " So we're getting off the plane in Angola."
    },
    {
      "Time_Start": 1545.0,
      "Time_End": 1549.0,
      "Text": " It's a small little plane, so we have to climb down the stairs under the tarmac."
    },
    {
      "Time_Start": 1549.0,
      "Time_End": 1553.0,
      "Text": " I look out at the terminal, and there's this really bright light flashing in my face."
    },
    {
      "Time_Start": 1553.0,
      "Time_End": 1554.0,
      "Text": " I'm like, what's that?"
    },
    {
      "Time_Start": 1554.0,
      "Time_End": 1555.0,
      "Text": " Oh, it's a camera."
    },
    {
      "Time_Start": 1555.0,
      "Time_End": 1557.0,
      "Text": " Oh, it's the NHK guys."
    },
    {
      "Time_Start": 1557.0,
      "Time_End": 1561.0,
      "Text": " So we were filmed walking off the plane, a total crypto rock star experience."
    },
    {
      "Time_Start": 1561.0,
      "Time_End": 1564.0,
      "Text": " So that was a lot of fun."
    },
    {
      "Time_Start": 1564.0,
      "Time_End": 1569.0,
      "Text": " And so then they were hanging out with us over the course of the next week, filming us in Angola."
    },
    {
      "Time_Start": 1569.0,
      "Time_End": 1570.0,
      "Text": " And it was really cool."
    },
    {
      "Time_Start": 1570.0,
      "Time_End": 1575.0,
      "Text": " I was interviewed while sitting on a porch with St. Martin in the back, and my hair was blowing."
    },
    {
      "Time_Start": 1576.0,
      "Time_End": 1581.0,
      "Text": " It was just a total lush crypto interview."
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1589.0,
      "Text": " And they showed that eventually on Japanese television, the national PBS equivalent in Japan."
    },
    {
      "Time_Start": 1589.0,
      "Time_End": 1591.0,
      "Text": " So then we were on a meal."
    },
    {
      "Time_Start": 1591.0,
      "Time_End": 1595.0,
      "Text": " We were continuing to do public relations and build trust."
    },
    {
      "Time_Start": 1595.0,
      "Time_End": 1602.0,
      "Text": " And there was this guy from Forbes who at first was supposed to be doing an article on electronic commerce and Visa and SCT and all this."
    },
    {
      "Time_Start": 1602.0,
      "Time_End": 1605.0,
      "Text": " So he started talking to a bunch of people in the crypto community."
    },
    {
      "Time_Start": 1605.0,
      "Time_End": 1611.0,
      "Text": " And he realized after talking to a bunch of people in the crypto community that SCT and Visa and electronic commerce were all really boring."
    },
    {
      "Time_Start": 1611.0,
      "Time_End": 1613.0,
      "Text": " And the really interesting thing is tax evasion."
    },
    {
      "Time_Start": 1613.0,
      "Time_End": 1615.0,
      "Text": " Tax avoidance, sorry."
    },
    {
      "Time_Start": 1615.0,
      "Time_End": 1620.0,
      "Text": " So he's like, oh, I'm going to talk to all these cypherpunks who are really interested in tax avoidance."
    },
    {
      "Time_Start": 1620.0,
      "Time_End": 1625.0,
      "Text": " And by that point, I had grown old and jaded, and I wasn't really interested in tax avoidance."
    },
    {
      "Time_Start": 1625.0,
      "Time_End": 1627.0,
      "Text": " I just wanted to make lots of money."
    },
    {
      "Time_Start": 1628.0,
      "Time_End": 1632.0,
      "Text": " But he wanted to do an article on tax avoidance."
    },
    {
      "Time_Start": 1632.0,
      "Time_End": 1635.0,
      "Text": " But of course, I was still an anarchist libertarian."
    },
    {
      "Time_Start": 1635.0,
      "Time_End": 1638.0,
      "Text": " I just realized that there was no way I was ever going to win."
    },
    {
      "Time_Start": 1640.0,
      "Time_End": 1643.0,
      "Text": " So anyway, he talked to a bunch of people in the crypto community."
    },
    {
      "Time_Start": 1643.0,
      "Time_End": 1644.0,
      "Text": " And they were like, oh, you should talk to Samir."
    },
    {
      "Time_Start": 1644.0,
      "Time_End": 1645.0,
      "Text": " So he's like, okay."
    },
    {
      "Time_Start": 1645.0,
      "Time_End": 1646.0,
      "Text": " He comes and talks to me."
    },
    {
      "Time_Start": 1646.0,
      "Time_End": 1649.0,
      "Text": " So he talks to me on Friday, July 3rd at the office."
    },
    {
      "Time_Start": 1649.0,
      "Time_End": 1651.0,
      "Text": " And we chat."
    },
    {
      "Time_Start": 1651.0,
      "Time_End": 1652.0,
      "Text": " And we have a good time."
    },
    {
      "Time_Start": 1652.0,
      "Time_End": 1654.0,
      "Text": " We talk for like two, three hours or something like that."
    },
    {
      "Time_Start": 1654.0,
      "Time_End": 1656.0,
      "Text": " And it's time to go home because I have a meeting or whatever."
    },
    {
      "Time_Start": 1656.0,
      "Time_End": 1660.0,
      "Text": " And so he's like, oh, I still need to talk to you some more."
    },
    {
      "Time_Start": 1660.0,
      "Time_End": 1661.0,
      "Text": " Can we talk tomorrow?"
    },
    {
      "Time_Start": 1661.0,
      "Time_End": 1663.0,
      "Text": " So we get together in a cafe in Berkeley."
    },
    {
      "Time_Start": 1663.0,
      "Time_End": 1665.0,
      "Text": " And something came out."
    },
    {
      "Time_Start": 1665.0,
      "Time_End": 1666.0,
      "Text": " It's July 4th."
    },
    {
      "Time_Start": 1666.0,
      "Time_End": 1667.0,
      "Text": " Cool."
    },
    {
      "Time_Start": 1667.0,
      "Time_End": 1668.0,
      "Text": " It's a holiday."
    },
    {
      "Time_Start": 1668.0,
      "Time_End": 1669.0,
      "Text": " So anyway, so we go."
    },
    {
      "Time_Start": 1669.0,
      "Time_End": 1670.0,
      "Text": " We meet in this cafe."
    },
    {
      "Time_Start": 1670.0,
      "Time_End": 1671.0,
      "Text": " And we're sitting down."
    },
    {
      "Time_Start": 1671.0,
      "Time_End": 1673.0,
      "Text": " And we're like, oh, I like this holiday."
    },
    {
      "Time_Start": 1673.0,
      "Time_End": 1675.0,
      "Text": " You get to celebrate overthrowing the government."
    },
    {
      "Time_Start": 1675.0,
      "Time_End": 1677.0,
      "Text": " And I thought, okay."
    },
    {
      "Time_Start": 1677.0,
      "Time_End": 1678.0,
      "Text": " So he interviewed me."
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1679.0,
      "Text": " And it was all good."
    },
    {
      "Time_Start": 1679.0,
      "Time_End": 1687.0,
      "Text": " And a few weeks later, actually, yeah, a few weeks later, a photographer came."
    },
    {
      "Time_Start": 1687.0,
      "Time_End": 1688.0,
      "Text": " And he took my picture."
    },
    {
      "Time_Start": 1688.0,
      "Time_End": 1690.0,
      "Text": " He took pictures of other cypherpunks."
    },
    {
      "Time_Start": 1690.0,
      "Time_End": 1693.0,
      "Text": " And, you know, it was all good."
    },
    {
      "Time_Start": 1693.0,
      "Time_End": 1698.0,
      "Text": " And then I got an e-mail from him sometime in early September or late August"
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1704.0,
      "Text": " saying the final issues of the magazine, the first pressing was off the press or whatever."
    },
    {
      "Time_Start": 1704.0,
      "Time_End": 1706.0,
      "Text": " I'm sending it to you by next e-mail."
    },
    {
      "Time_Start": 1706.0,
      "Time_End": 1708.0,
      "Text": " I think you'll get a kick out of it."
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1709.0,
      "Text": " He sent it to me on Friday."
    },
    {
      "Time_Start": 1709.0,
      "Time_End": 1713.0,
      "Text": " I was actually in the office on Saturday because I was working on some webpages or whatever."
    },
    {
      "Time_Start": 1713.0,
      "Time_End": 1715.0,
      "Text": " And I show up at the office."
    },
    {
      "Time_Start": 1715.0,
      "Time_End": 1717.0,
      "Text": " One of my coworkers had already been there."
    },
    {
      "Time_Start": 1717.0,
      "Time_End": 1723.0,
      "Text": " And then he throws this magazine on my desk, which has this picture of me on it."
    },
    {
      "Time_Start": 1723.0,
      "Time_End": 1726.0,
      "Text": " And it says, this guy wants to overthrow the government."
    },
    {
      "Time_Start": 1726.0,
      "Time_End": 1732.0,
      "Text": " So I'm thinking, wow, that's wild."
    },
    {
      "Time_Start": 1732.0,
      "Time_End": 1734.0,
      "Text": " So I open up the magazine."
    },
    {
      "Time_Start": 1734.0,
      "Time_End": 1735.0,
      "Text": " I'm like, oh, where's the article?"
    },
    {
      "Time_Start": 1735.0,
      "Time_End": 1736.0,
      "Text": " This is really weird."
    },
    {
      "Time_Start": 1736.0,
      "Time_End": 1740.0,
      "Text": " And I look at the article and it starts out saying, I like this holiday."
    },
    {
      "Time_Start": 1740.0,
      "Time_End": 1743.0,
      "Text": " You get to celebrate overthrowing the government."
    },
    {
      "Time_Start": 1743.0,
      "Time_End": 1746.0,
      "Text": " And so that was pretty cool."
    },
    {
      "Time_Start": 1746.0,
      "Time_End": 1750.0,
      "Text": " And the article was just an excellent article."
    },
    {
      "Time_Start": 1750.0,
      "Time_End": 1757.0,
      "Text": " It talked about how tax avoidance was the patriotic thing to do and all sorts of things like that."
    },
    {
      "Time_Start": 1757.0,
      "Time_End": 1763.0,
      "Text": " It had a really good page layout system because every spread,"
    },
    {
      "Time_Start": 1763.0,
      "Time_End": 1767.0,
      "Text": " on the left there would be a picture of a cypherpunk who talked about how tax avoidance was a good thing."
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1771.0,
      "Text": " And on the right there was a picture of some bigwig banker, like the head of Citibank,"
    },
    {
      "Time_Start": 1771.0,
      "Time_End": 1773.0,
      "Text": " talking about how tax avoidance was a good thing."
    },
    {
      "Time_Start": 1773.0,
      "Time_End": 1776.0,
      "Text": " So it was a really balanced perspective."
    },
    {
      "Time_Start": 1776.0,
      "Time_End": 1779.0,
      "Text": " You've got the radical whackos like us."
    },
    {
      "Time_Start": 1779.0,
      "Time_End": 1783.0,
      "Text": " And then you've got the straight conservative people who are all into it as well."
    },
    {
      "Time_Start": 1783.0,
      "Time_End": 1786.0,
      "Text": " So it was a pretty good article."
    },
    {
      "Time_Start": 1786.0,
      "Time_End": 1787.0,
      "Text": " I had a lot of fun."
    },
    {
      "Time_Start": 1787.0,
      "Time_End": 1789.0,
      "Text": " Everyone made a lot of fun."
    },
    {
      "Time_Start": 1789.0,
      "Time_End": 1791.0,
      "Text": " Well, it looks like I'm out of time."
    },
    {
      "Time_Start": 1791.0,
      "Time_End": 1794.0,
      "Text": " So, thank you."
    }
  ]
}