{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome to the annual DEFCON convention. This meeting was held in exciting Las Vegas, Nevada"
    },
    {
      "Time_Start": 7.0,
      "Time_End": 16.0,
      "Text": " from July 9th through the 11th, 1999. This is videotape number 23, The Myths of Hiring"
    },
    {
      "Time_Start": 16.0,
      "Time_End": 17.0,
      "Text": " Hackers."
    },
    {
      "Time_Start": 17.0,
      "Time_End": 28.8,
      "Text": " What's going on is this is about hiring, the myth of hiring hackers, because what I found"
    },
    {
      "Time_Start": 28.8,
      "Time_End": 33.56,
      "Text": " is that everybody wants to go out and hire a hacker, and as the presentation before just"
    },
    {
      "Time_Start": 33.56,
      "Time_End": 38.120000000000005,
      "Text": " started to discuss, sort of like, you don't know what you get when you hire a hacker."
    },
    {
      "Time_Start": 38.120000000000005,
      "Time_End": 41.44,
      "Text": " You know, you could get somebody like Mudge, or on the other hand, you could get somebody"
    },
    {
      "Time_Start": 41.44,
      "Time_End": 45.92,
      "Text": " like the people that are out there trying to figure out that kill minus nine is actually"
    },
    {
      "Time_Start": 45.92,
      "Time_End": 48.8,
      "Text": " a Unix command and are trying to do that on Windows 95."
    },
    {
      "Time_Start": 48.8,
      "Time_End": 54.92,
      "Text": " So, we're going around and again, trying to figure out what's going on and talk about"
    },
    {
      "Time_Start": 54.92,
      "Time_End": 55.92,
      "Text": " this."
    },
    {
      "Time_Start": 55.92,
      "Time_End": 58.800000000000004,
      "Text": " And again, what I'm trying to do is a few things. First of all, distinguish what is"
    },
    {
      "Time_Start": 58.800000000000004,
      "Time_End": 63.24,
      "Text": " actually the myth of hiring hackers, what is a hacker, what are real hackers, then go"
    },
    {
      "Time_Start": 63.24,
      "Time_End": 67.24000000000001,
      "Text": " ahead and define skill sets, because part of the issue, I don't think I have a, well,"
    },
    {
      "Time_Start": 67.24000000000001,
      "Time_End": 69.56,
      "Text": " it doesn't matter whether or not I have a slide for it, because you're never going to"
    },
    {
      "Time_Start": 69.56,
      "Time_End": 73.52000000000001,
      "Text": " see it anyway, apparently, but what's going to go on is, what you're trying to hire when"
    },
    {
      "Time_Start": 73.52000000000001,
      "Time_End": 76.56,
      "Text": " you hire somebody is a skill set, not an identity."
    },
    {
      "Time_Start": 76.56,
      "Time_End": 80.68,
      "Text": " Saying you're hiring a hacker is like hiring, oh, hire me, because I wear like an earring"
    },
    {
      "Time_Start": 80.68,
      "Time_End": 85.96000000000001,
      "Text": " and black t-shirts all the time, and I'll work for free for pizza, you know, that's"
    },
    {
      "Time_Start": 85.96000000000001,
      "Time_End": 87.84,
      "Text": " the thing we want to address."
    },
    {
      "Time_Start": 87.84,
      "Time_End": 91.56,
      "Text": " First of all, again, the main issue is that the companies and government try to make you"
    },
    {
      "Time_Start": 91.56,
      "Time_End": 96.12,
      "Text": " believe that hackers have some sort of unique skills and abilities that can't be picked"
    },
    {
      "Time_Start": 96.12,
      "Time_End": 100.80000000000001,
      "Text": " up by other people, and we'll talk about that in a little bit, and since it was just after"
    },
    {
      "Time_Start": 100.80000000000001,
      "Time_End": 106.52000000000001,
      "Text": " ABC.com, another issue is the media feeds off the issue and lets everybody know what,"
    },
    {
      "Time_Start": 106.52,
      "Time_End": 108.67999999999999,
      "Text": " you know, they let people know the impressions."
    },
    {
      "Time_Start": 108.67999999999999,
      "Time_End": 112.8,
      "Text": " Honestly, the government wants you to think that there is a major computer problem with"
    },
    {
      "Time_Start": 112.8,
      "Time_End": 115.88,
      "Text": " hackers and that hackers are just the tip of the iceberg."
    },
    {
      "Time_Start": 115.88,
      "Time_End": 119.88,
      "Text": " In some ways that is true, but in other ways, honestly, what it is is a way to justify things"
    },
    {
      "Time_Start": 119.88,
      "Time_End": 120.88,
      "Text": " to Congress."
    },
    {
      "Time_Start": 120.88,
      "Time_End": 126.28,
      "Text": " I would somehow like to assume that Solar Sunrise, you know, what is it, the Cloverdale"
    },
    {
      "Time_Start": 126.28,
      "Time_End": 130.44,
      "Text": " teen Solar Sunrise, whatever you want to call it, it's just ironic that they started building"
    },
    {
      "Time_Start": 130.44,
      "Time_End": 135.2,
      "Text": " it up, that's the most coordinated attack they saw to date, right before they asked"
    },
    {
      "Time_Start": 135.2,
      "Time_End": 138.16,
      "Text": " for 63 million dollars for the NIPC."
    },
    {
      "Time_Start": 138.16,
      "Time_End": 142.07999999999998,
      "Text": " So again, you know, just a few things going on there."
    },
    {
      "Time_Start": 142.07999999999998,
      "Time_End": 147.95999999999998,
      "Text": " The underlying issue is that being called a hacker is an identity that people take on"
    },
    {
      "Time_Start": 147.95999999999998,
      "Time_End": 148.95999999999998,
      "Text": " themselves."
    },
    {
      "Time_Start": 148.95999999999998,
      "Time_End": 153.88,
      "Text": " You know, all of a sudden you walk around, you call yourself a hacker, and 60 minutes"
    },
    {
      "Time_Start": 153.88,
      "Time_End": 156.56,
      "Text": " is putting a camera in front of your face these days."
    },
    {
      "Time_Start": 156.56,
      "Time_End": 161.12,
      "Text": " You know, that's just not the right way, and again, there's no criteria, there's no skill"
    },
    {
      "Time_Start": 161.12,
      "Time_End": 162.12,
      "Text": " set."
    },
    {
      "Time_Start": 162.12,
      "Time_End": 165.44,
      "Text": " I was going to say there's no certification like for security professionals, but even"
    },
    {
      "Time_Start": 165.44,
      "Time_End": 169.12,
      "Text": " that isn't saying anything either, but what you're doing is, you know, again, there's"
    },
    {
      "Time_Start": 169.12,
      "Time_End": 173.32,
      "Text": " no way of knowing you're a hacker, you're a where's kitty, tool puppy, whatever you"
    },
    {
      "Time_Start": 173.32,
      "Time_End": 178.84,
      "Text": " want to call yourself, and again, it's kind of like there are the good and skilled hackers"
    },
    {
      "Time_Start": 178.84,
      "Time_End": 181.24,
      "Text": " that meet what you would call what I say the myth is."
    },
    {
      "Time_Start": 181.24,
      "Time_End": 184.88,
      "Text": " Again, when you look at the people like the loft, the CDC, a bunch of other people going"
    },
    {
      "Time_Start": 184.88,
      "Time_End": 190.0,
      "Text": " around, these people are people who actually could do everything the press says."
    },
    {
      "Time_Start": 190.0,
      "Time_End": 194.52,
      "Text": " Unfortunately, that's about, you know, half percent of the hacker population, and when"
    },
    {
      "Time_Start": 194.52,
      "Time_End": 199.44,
      "Text": " you go out to hire a hacker, figure the odds, 99.5 percent of the time, you're not going"
    },
    {
      "Time_Start": 199.44,
      "Time_End": 203.76,
      "Text": " to get somebody with much as capability, and that's it."
    },
    {
      "Time_Start": 203.76,
      "Time_End": 205.72,
      "Text": " Okay, let's talk about identities."
    },
    {
      "Time_Start": 205.72,
      "Time_End": 209.76,
      "Text": " You know, this is a little bit of an esoteric thing, because some people tend to like it."
    },
    {
      "Time_Start": 209.76,
      "Time_End": 212.16,
      "Text": " How many people are here from Penn State?"
    },
    {
      "Time_Start": 212.16,
      "Time_End": 219.96,
      "Text": " No, nobody, oh, well, one person, actually, oh, okay, but anyway, people from Penn State"
    },
    {
      "Time_Start": 219.96,
      "Time_End": 223.32000000000002,
      "Text": " they wear that on their license plates, if you ever work with them, they have those little"
    },
    {
      "Time_Start": 223.32000000000002,
      "Time_End": 226.36,
      "Text": " mugs on their desks, you go places."
    },
    {
      "Time_Start": 226.36,
      "Time_End": 230.36,
      "Text": " People from the military, a lot of people like it, anybody here a Marine?"
    },
    {
      "Time_Start": 230.36,
      "Time_End": 236.20000000000002,
      "Text": " You know, you go there, you play proud to be an American, and they line up, they stand"
    },
    {
      "Time_Start": 236.20000000000002,
      "Time_End": 241.88,
      "Text": " up, you know, they love to be a Marines, Marines are in their identity, they just want to take"
    },
    {
      "Time_Start": 241.88,
      "Time_End": 244.08,
      "Text": " on that identity and live with it."
    },
    {
      "Time_Start": 244.08,
      "Time_End": 248.72,
      "Text": " Then the worst one I ever saw is fraternities and sororities, anybody in a fraternity or"
    },
    {
      "Time_Start": 248.72,
      "Time_End": 249.72,
      "Text": " sorority?"
    },
    {
      "Time_Start": 249.72,
      "Time_End": 253.8,
      "Text": " Those people join fraternities, or were in a fraternity or sorority, those people join"
    },
    {
      "Time_Start": 253.8,
      "Time_End": 257.28,
      "Text": " those things because they have to be with a group of people."
    },
    {
      "Time_Start": 257.28,
      "Time_End": 261.6,
      "Text": " When you go around with them, they are no longer them, they are now Zeta Psi or whatever"
    },
    {
      "Time_Start": 261.6,
      "Time_End": 266.32,
      "Text": " it is, and again, they go through a period of brainwashing, for the most part, you know,"
    },
    {
      "Time_Start": 266.32,
      "Time_End": 270.76,
      "Text": " you go through Hell Week, again, some of the African American fraternities are really bad"
    },
    {
      "Time_Start": 270.76,
      "Time_End": 275.36,
      "Text": " because you take on the identity, and that's a big thing, getting the identity of those"
    },
    {
      "Time_Start": 275.36,
      "Time_End": 277.4,
      "Text": " people is key to them."
    },
    {
      "Time_Start": 277.40000000000003,
      "Time_End": 285.88000000000005,
      "Text": " Also, sometimes, anybody here from the D.C. area, yeah, Fed, no, anyway, yeah, I was a"
    },
    {
      "Time_Start": 285.88000000000005,
      "Time_End": 291.04,
      "Text": " Fed, anyway, but you know, what you have there are Redskin fans, I mean, everybody is like"
    },
    {
      "Time_Start": 291.04,
      "Time_End": 295.36,
      "Text": " cheering Redskins, Redskins, Redskins, it's like built into their identity, people have"
    },
    {
      "Time_Start": 295.36,
      "Time_End": 301.6,
      "Text": " tattoos with Redskins, you can't get anywhere around the Redskin day, some radio personalities"
    },
    {
      "Time_Start": 301.6,
      "Time_End": 306.20000000000005,
      "Text": " were making fun of Redskins and they got death threats, but again, it's the concept, you"
    },
    {
      "Time_Start": 306.2,
      "Time_End": 310.92,
      "Text": " call yourself a hacker, it doesn't mean you're good, you call yourself a diehard Redskin"
    },
    {
      "Time_Start": 310.92,
      "Time_End": 315.47999999999996,
      "Text": " fan, it doesn't mean you're like Daryl Green or something like that, but that's what people"
    },
    {
      "Time_Start": 315.47999999999996,
      "Time_End": 319.76,
      "Text": " in the hacker community tend to want, because again, Daryl Green is obviously a football"
    },
    {
      "Time_Start": 319.76,
      "Time_End": 324.48,
      "Text": " player that gets on the field, the hacker identity is, you just take it on and you,"
    },
    {
      "Time_Start": 324.48,
      "Time_End": 327.84,
      "Text": " you know, it's like there is no real field, everybody could claim they're on the field"
    },
    {
      "Time_Start": 327.84,
      "Time_End": 333.2,
      "Text": " and nobody knows the difference, let's talk about why people want identities for the most"
    },
    {
      "Time_Start": 333.2,
      "Time_End": 338.76,
      "Text": " part, it makes them part of something bigger, again, it's not just their little existence,"
    },
    {
      "Time_Start": 338.76,
      "Time_End": 342.12,
      "Text": " now they are part of something, they could go to a bar and cheer with people they don't"
    },
    {
      "Time_Start": 342.12,
      "Time_End": 345.8,
      "Text": " know, but they're one of the gang, because they're Redskin fans or something like that,"
    },
    {
      "Time_Start": 345.8,
      "Time_End": 352.2,
      "Text": " or again, Penn State fans, God forbid, and again, the reality is no matter how red and"
    },
    {
      "Time_Start": 352.2,
      "Time_End": 357.52,
      "Text": " gold you paint your face, you're never going to be a Redskin, you know, maybe the difference"
    },
    {
      "Time_Start": 357.52,
      "Time_End": 362.34,
      "Text": " is if you start learning computer skills, maybe you could actually become that identity"
    },
    {
      "Time_Start": 362.34000000000003,
      "Time_End": 367.22,
      "Text": " of being a hacker, so there is somewhat of a difference here, and also, this, people"
    },
    {
      "Time_Start": 367.22,
      "Time_End": 371.70000000000005,
      "Text": " might appreciate this, no matter what your business card says, that doesn't automatically"
    },
    {
      "Time_Start": 371.70000000000005,
      "Time_End": 376.18,
      "Text": " guarantee you're a quote unquote security expert either, and that's a big issue these"
    },
    {
      "Time_Start": 376.18,
      "Time_End": 380.86,
      "Text": " days, because again, I tend to think, I'm more concerned about security people going"
    },
    {
      "Time_Start": 380.86,
      "Time_End": 385.34000000000003,
      "Text": " around calling themselves security experts, as opposed to hackers calling themselves hackers"
    },
    {
      "Time_Start": 385.34000000000003,
      "Time_End": 391.02000000000004,
      "Text": " these days, so about the hacker identity first, the hacker identity, that's a really cool"
    },
    {
      "Time_Start": 391.02,
      "Time_End": 394.9,
      "Text": " identity, you know, first of all, let's think of where it started, the first time, at least"
    },
    {
      "Time_Start": 394.9,
      "Time_End": 399.74,
      "Text": " the first time I found the term hacker used, was the people at MIT, these were like the"
    },
    {
      "Time_Start": 399.74,
      "Time_End": 404.7,
      "Text": " super cool first hackers, these were people for whom hacking actually meant something,"
    },
    {
      "Time_Start": 404.7,
      "Time_End": 409.02,
      "Text": " and really had, you know, computers were just a part of it, they were looking for really"
    },
    {
      "Time_Start": 409.02,
      "Time_End": 414.18,
      "Text": " cool things to do, for example, you know how you got those big, you know, marble buildings"
    },
    {
      "Time_Start": 414.18,
      "Time_End": 418.58,
      "Text": " and everything like that, with the, what do you call those things, brain dead columns"
    },
    {
      "Time_Start": 418.58,
      "Time_End": 424.44,
      "Text": " in front of there, they decided to rename buildings, so what they did was, they went"
    },
    {
      "Time_Start": 424.44,
      "Time_End": 429.94,
      "Text": " out and got styrofoam, and engraved into the styrofoam letters, just like the letters that"
    },
    {
      "Time_Start": 429.94,
      "Time_End": 433.58,
      "Text": " were up on the building, you know, like Boone Hall or whatever it is over there, and they"
    },
    {
      "Time_Start": 433.58,
      "Time_End": 438.58,
      "Text": " engraved, you know, Hall of Computer Science Majors, and actually went ahead, in the middle"
    },
    {
      "Time_Start": 438.58,
      "Time_End": 443.58,
      "Text": " of the night, and put these styrofoam things up on the wall, then the next morning, people"
    },
    {
      "Time_Start": 443.58,
      "Time_End": 448.26,
      "Text": " were trying to figure out if somebody actually defaced the building, or they went ahead and"
    },
    {
      "Time_Start": 448.26,
      "Time_End": 452.5,
      "Text": " did something cool, and yes, they did something cool, it was non-destructive, and it was cool."
    },
    {
      "Time_Start": 452.5,
      "Time_End": 455.78,
      "Text": " At the same time, though, these people got state-of-the-art computers, because MIT got"
    },
    {
      "Time_Start": 455.78,
      "Time_End": 460.34,
      "Text": " really good stuff, however, the reality was, they got really cool computers that they didn't"
    },
    {
      "Time_Start": 460.34,
      "Time_End": 464.65999999999997,
      "Text": " know what to do with them, because they never had any good user manuals, because documentation"
    },
    {
      "Time_Start": 464.65999999999997,
      "Time_End": 468.26,
      "Text": " wasn't a part of building a computer back then, so they went ahead and had to figure"
    },
    {
      "Time_Start": 468.26,
      "Time_End": 471.78,
      "Text": " out how to use computers, they figured out how to fix the problems that they found and"
    },
    {
      "Time_Start": 471.78,
      "Time_End": 477.65999999999997,
      "Text": " stuff like that, so the hackers at MIT were really true hackers in the sense of the word,"
    },
    {
      "Time_Start": 477.66,
      "Time_End": 481.70000000000005,
      "Text": " they had to do computers, and again, it was the same thing for people who were hacking"
    },
    {
      "Time_Start": 481.70000000000005,
      "Time_End": 486.78000000000003,
      "Text": " kind of up to like the, about, I'd say starting in the 1990s, if you really wanted to learn"
    },
    {
      "Time_Start": 486.78000000000003,
      "Time_End": 491.06,
      "Text": " about computers, you had to teach yourself, you know, there weren't any books out there,"
    },
    {
      "Time_Start": 491.06,
      "Time_End": 494.98,
      "Text": " I mean, now you have like a thousand, what is it, a thousand books on Windows NT in some"
    },
    {
      "Time_Start": 494.98,
      "Time_End": 498.58000000000004,
      "Text": " way, shape, or another, it doesn't take a lot of effort, you don't have to go ahead"
    },
    {
      "Time_Start": 498.58000000000004,
      "Time_End": 503.1,
      "Text": " and play with the software anymore if you want to learn about it, so again, the same"
    },
    {
      "Time_Start": 503.1,
      "Time_End": 506.98,
      "Text": " thing, the internet made information out there, you don't have to find the information out"
    },
    {
      "Time_Start": 506.98,
      "Time_End": 512.3000000000001,
      "Text": " for your own, you know, for yourself, so these people are it, now, the identity started"
    },
    {
      "Time_Start": 512.3000000000001,
      "Time_End": 516.1800000000001,
      "Text": " taking on, it's like, well, you know, because of those first people, and again, Kevin Poulsen"
    },
    {
      "Time_Start": 516.1800000000001,
      "Time_End": 521.66,
      "Text": " is one of the classic examples, doing stuff with computers from way back when, however,"
    },
    {
      "Time_Start": 521.66,
      "Time_End": 526.02,
      "Text": " you know, they got the impression of computer geniuses, but now these days, because a lot"
    },
    {
      "Time_Start": 526.02,
      "Time_End": 531.1800000000001,
      "Text": " of people are really computer literate, anybody that knows how to use Microsoft Word and knows"
    },
    {
      "Time_Start": 531.1800000000001,
      "Time_End": 535.74,
      "Text": " what a macro is, is considered a computer genius these days, and now hackers are trying"
    },
    {
      "Time_Start": 535.74,
      "Time_End": 540.0600000000001,
      "Text": " to jump on this, because they know a little bit more than Microsoft Word, they start going"
    },
    {
      "Time_Start": 540.0600000000001,
      "Time_End": 543.62,
      "Text": " on, it's like, hey, I know there's this operating system called Linux, which is kind of better"
    },
    {
      "Time_Start": 543.62,
      "Time_End": 548.42,
      "Text": " than Windows, and they say, well, let's push that, and the identity also says that they"
    },
    {
      "Time_Start": 548.42,
      "Time_End": 553.3,
      "Text": " push the limits of technology, they're pushing the edge, they have the answers to all things"
    },
    {
      "Time_Start": 553.3,
      "Time_End": 557.58,
      "Text": " technical, again, I was breaking into a company once, it was really bizarre, because here"
    },
    {
      "Time_Start": 557.58,
      "Time_End": 561.94,
      "Text": " I was, I was under the guise of a clerical worker, I was just a file clerk, and people"
    },
    {
      "Time_Start": 561.94,
      "Time_End": 566.6600000000001,
      "Text": " thought I had some concept of computer security, well, not computer security, but just, you"
    },
    {
      "Time_Start": 566.6600000000001,
      "Time_End": 571.3800000000001,
      "Text": " know, I knew how to use their applications, like Meeting Maker, and the word processor"
    },
    {
      "Time_Start": 571.3800000000001,
      "Time_End": 574.62,
      "Text": " stuff, and people started coming to me, even though I was a file clerk, do you know how"
    },
    {
      "Time_Start": 574.62,
      "Time_End": 577.74,
      "Text": " to do this, do you know how to do that, and they started giving me, you know, it's like,"
    },
    {
      "Time_Start": 577.74,
      "Time_End": 582.0600000000001,
      "Text": " I knew much more than them, and they wanted to reassign me, it's like, you know, I left"
    },
    {
      "Time_Start": 582.0600000000001,
      "Time_End": 586.98,
      "Text": " the company in five minutes, but that was okay, I still, they still wanted me back,"
    },
    {
      "Time_Start": 587.1,
      "Time_End": 594.1,
      "Text": " for the computer stuff, anyway, clueless government makes it a lot worse, also the media kind"
    },
    {
      "Time_Start": 594.1,
      "Time_End": 599.3000000000001,
      "Text": " of feeds off the clueless government stuff, again, who remembers the quote, the most coordinated"
    },
    {
      "Time_Start": 599.3000000000001,
      "Time_End": 606.3000000000001,
      "Text": " and sophisticated attack seen to date, who was that by, John Hamrey, secretary of defense,"
    },
    {
      "Time_Start": 606.98,
      "Time_End": 612.54,
      "Text": " or assistant secretary of defense, what was this in reaction to, this was in reaction"
    },
    {
      "Time_Start": 612.54,
      "Time_End": 618.8199999999999,
      "Text": " to 250 government websites attacked, right, they thought this was a national effort, they"
    },
    {
      "Time_Start": 618.8199999999999,
      "Time_End": 622.9,
      "Text": " thought the North Koreans, the Russians, whoever was involved, and then lo and behold, you"
    },
    {
      "Time_Start": 622.9,
      "Time_End": 626.86,
      "Text": " know, they start saying, this is why we need millions of dollars, and three days later,"
    },
    {
      "Time_Start": 626.86,
      "Time_End": 631.02,
      "Text": " they arrested, you know, the two kids from Cloverdale, the analyzer, and a bunch of other"
    },
    {
      "Time_Start": 631.02,
      "Time_End": 635.9,
      "Text": " people, and think about it this way, you know, it's really hard to get caught over international"
    },
    {
      "Time_Start": 635.9,
      "Time_End": 640.0999999999999,
      "Text": " lines, and this guy was caught over international lines, so could this guy have actually launched"
    },
    {
      "Time_Start": 640.1,
      "Time_End": 645.14,
      "Text": " the most coordinated and sophisticated attack seen to date, but no, but what happened was"
    },
    {
      "Time_Start": 645.14,
      "Time_End": 650.1800000000001,
      "Text": " the media painted themselves as doing this, and again, they exploit the RSTATD vulnerability,"
    },
    {
      "Time_Start": 650.1800000000001,
      "Time_End": 654.98,
      "Text": " which was published by the certs, seven months before that, so what happened, these people"
    },
    {
      "Time_Start": 654.98,
      "Time_End": 659.94,
      "Text": " who were attacked, who were totally clueless, I'm sorry, they were totally clueless, by"
    },
    {
      "Time_Start": 659.94,
      "Time_End": 665.46,
      "Text": " the way, because they didn't fix known problems, then they had relatively clueless people attacking"
    },
    {
      "Time_Start": 665.46,
      "Time_End": 670.62,
      "Text": " them with something very preventable, and they painted them as the hackers, to be the"
    },
    {
      "Time_Start": 670.62,
      "Time_End": 675.3000000000001,
      "Text": " world's, you know, super people, and what happened, Benjamin Netanyahu, the Israeli"
    },
    {
      "Time_Start": 675.3000000000001,
      "Time_End": 681.7,
      "Text": " prime minister, called the analyzer a misguided genius, I like that one, and now, just in"
    },
    {
      "Time_Start": 681.7,
      "Time_End": 685.62,
      "Text": " case you think, oh yeah, by the way, they also said it was a wake up call for them,"
    },
    {
      "Time_Start": 685.62,
      "Time_End": 689.1,
      "Text": " you know, I have to stop and think, how many people remember the Hanover hackers, the cuckoo's"
    },
    {
      "Time_Start": 689.1,
      "Time_End": 694.86,
      "Text": " egg, you know, people were stealing military secrets, real secret nuclear stuff, then you"
    },
    {
      "Time_Start": 694.86,
      "Time_End": 700.1,
      "Text": " had kind of like the telephone systems falling apart towards like the early 1990s, you know,"
    },
    {
      "Time_Start": 700.1,
      "Time_End": 703.38,
      "Text": " should that have been a wake up call, then you had like all those other things, like"
    },
    {
      "Time_Start": 703.38,
      "Time_End": 707.5,
      "Text": " the eligible receiver exercises, going on for five years up to that, where they took"
    },
    {
      "Time_Start": 707.5,
      "Time_End": 711.46,
      "Text": " down the whole Pacific military command, and a few other things along the way, they did"
    },
    {
      "Time_Start": 711.46,
      "Time_End": 715.9,
      "Text": " those things once a year, they had GAO reports saying the government's wide open, and then"
    },
    {
      "Time_Start": 715.9,
      "Time_End": 720.14,
      "Text": " all of a sudden, these teenagers here were a wake up call, but actually, compared to"
    },
    {
      "Time_Start": 720.14,
      "Time_End": 724.26,
      "Text": " the last army hack that went on, I think about a week ago, you know, for the first time,"
    },
    {
      "Time_Start": 724.26,
      "Time_End": 728.7,
      "Text": " the press said, which is good, is something hacked because of widely preventable things,"
    },
    {
      "Time_Start": 728.7,
      "Time_End": 733.7,
      "Text": " but anyway, that's one aspect of the government driving this hacker myth. Who here heard of"
    },
    {
      "Time_Start": 733.7,
      "Time_End": 739.9,
      "Text": " the cyber core? Anybody hear Jeffrey Hunker talk about that? He has this concept because"
    },
    {
      "Time_Start": 739.9,
      "Time_End": 745.26,
      "Text": " he read a bad science fiction novel, let's hire teenagers right out of high school, and"
    },
    {
      "Time_Start": 745.26,
      "Time_End": 750.22,
      "Text": " we'll train them our way to be like the information warriors of the future, again, bad science"
    },
    {
      "Time_Start": 750.22,
      "Time_End": 754.74,
      "Text": " fiction novel story. So what's happening? Really, when you stop and think about it,"
    },
    {
      "Time_Start": 754.74,
      "Time_End": 759.1,
      "Text": " he's hiring people, and 70% of people who go to the college change their majors, so"
    },
    {
      "Time_Start": 759.1,
      "Time_End": 762.9,
      "Text": " they might, you know, 70% of them are not going to be good computer people, so that's"
    },
    {
      "Time_Start": 762.9,
      "Time_End": 767.0600000000001,
      "Text": " one thing, and then also, it's an insult to the people inside the government, because"
    },
    {
      "Time_Start": 767.0600000000001,
      "Time_End": 771.22,
      "Text": " again, he says he wants people on the edge, or, I'm sorry, maybe it was Richard Clarke"
    },
    {
      "Time_Start": 771.22,
      "Time_End": 775.98,
      "Text": " instead of him, but they want people on the edge. But really, look at the eligible receiver"
    },
    {
      "Time_Start": 775.98,
      "Time_End": 780.1800000000001,
      "Text": " exercises where those people took over the government. You know, again, those people"
    },
    {
      "Time_Start": 780.1800000000001,
      "Time_End": 784.26,
      "Text": " are very good, and no, they were not living on the edge, they were making $30,000 in the"
    },
    {
      "Time_Start": 784.26,
      "Time_End": 789.82,
      "Text": " government, and they were very good. And the list of government planes keeps going on."
    },
    {
      "Time_Start": 789.82,
      "Time_End": 794.58,
      "Text": " Also the media. Honestly, this conference makes great visuals for them. That was their"
    },
    {
      "Time_Start": 794.58,
      "Time_End": 798.22,
      "Text": " quote. I mean, they love people with earrings, they love people with spiked hair and stuff"
    },
    {
      "Time_Start": 798.22,
      "Time_End": 802.1,
      "Text": " like that, and they want to help drive some of this stuff. They want to show this, they"
    },
    {
      "Time_Start": 802.1,
      "Time_End": 806.1800000000001,
      "Text": " want to show people popping around. They would love to see, at this conference, they"
    },
    {
      "Time_Start": 806.1800000000001,
      "Time_End": 811.02,
      "Text": " would love to film people breaking into computers. You know, the capture the flag doesn't really"
    },
    {
      "Time_Start": 811.02,
      "Time_End": 814.9,
      "Text": " work for them, because that kind of shows real skills, but it's a set up environment."
    },
    {
      "Time_Start": 814.9,
      "Time_End": 817.94,
      "Text": " They would rather see people, ooh, come on, let's go up to your room and, you know, if"
    },
    {
      "Time_Start": 817.94,
      "Time_End": 822.02,
      "Text": " you're going to hack something, please let us film it type of stuff."
    },
    {
      "Time_Start": 822.02,
      "Time_End": 826.0600000000001,
      "Text": " Let's talk about the reality of the things. First of all, there are many hackers who fit"
    },
    {
      "Time_Start": 826.0600000000001,
      "Time_End": 831.62,
      "Text": " the real identity, you know, but again, there are many more that don't. An acclaimed identity"
    },
    {
      "Time_Start": 831.62,
      "Time_End": 835.98,
      "Text": " really doesn't indicate skills, and that's the issue. What you want to hire, again, if"
    },
    {
      "Time_Start": 835.98,
      "Time_End": 840.38,
      "Text": " you're hiring people or you're looking to get a job, maybe you might work for some moron"
    },
    {
      "Time_Start": 840.38,
      "Time_End": 844.62,
      "Text": " who says, ooh, you're a hacker, let me hire you. But the reality is that they're not very"
    },
    {
      "Time_Start": 844.62,
      "Time_End": 847.66,
      "Text": " smart and they're probably not going to pay you what you're worth if you're good anyway."
    },
    {
      "Time_Start": 847.66,
      "Time_End": 850.3,
      "Text": " If you're not good, you might as well take anything you could get though, let's face"
    },
    {
      "Time_Start": 850.3,
      "Time_End": 855.54,
      "Text": " it. And again, the only issue is that only skills can indicate skills, and that's the"
    },
    {
      "Time_Start": 855.54,
      "Time_End": 859.9,
      "Text": " question. You've got to find people who, if you claim to be an identity, that means you"
    },
    {
      "Time_Start": 859.9,
      "Time_End": 863.42,
      "Text": " don't have the skills. Because I know people, if they say they're a hacker, they're not"
    },
    {
      "Time_Start": 863.42,
      "Time_End": 866.66,
      "Text": " going to tell you about hacking. You know, they're not going to say, I'm a hacker. They're"
    },
    {
      "Time_Start": 866.66,
      "Time_End": 871.78,
      "Text": " going to say, I know Sendmail, I know NT, I know Nobel, blah, blah, blah, blah, blah."
    },
    {
      "Time_Start": 871.78,
      "Time_End": 874.74,
      "Text": " Although some people argue if you say you're a hacker and you say you know NT, you're not"
    },
    {
      "Time_Start": 874.74,
      "Time_End": 880.6999999999999,
      "Text": " a real hacker. So, then there are also, the real story is there are many non-hackers who"
    },
    {
      "Time_Start": 880.6999999999999,
      "Time_End": 885.06,
      "Text": " have those skills as well. Again, when you look at people who don't consider themselves"
    },
    {
      "Time_Start": 885.06,
      "Time_End": 888.66,
      "Text": " to be hackers, like for example, I guess Bill Cheswick spoke at the Black Hat Conference"
    },
    {
      "Time_Start": 888.66,
      "Time_End": 893.3,
      "Text": " last week. I don't think he calls himself a hacker, but by God, he's a genius. You know,"
    },
    {
      "Time_Start": 893.3,
      "Time_End": 897.3399999999999,
      "Text": " he puts many of the, even the better people that we could name to shame. But he doesn't"
    },
    {
      "Time_Start": 897.3399999999999,
      "Time_End": 901.06,
      "Text": " call himself a hacker. The people who did Eligible Receiver for the government, they're"
    },
    {
      "Time_Start": 901.06,
      "Time_End": 905.14,
      "Text": " not technically, quote unquote, hackers like you would expect with the earrings. You know,"
    },
    {
      "Time_Start": 905.14,
      "Time_End": 908.8199999999999,
      "Text": " again, a lot of people are the feds you might point out or whatever. You know, you wouldn't"
    },
    {
      "Time_Start": 908.8199999999999,
      "Time_End": 913.18,
      "Text": " know it. But again, Eligible Receiver proves that you can take people. Why don't these"
    },
    {
      "Time_Start": 913.18,
      "Time_End": 916.78,
      "Text": " people do it though? Why aren't these people, you know, you could say, quote unquote, they"
    },
    {
      "Time_Start": 916.78,
      "Time_End": 922.3399999999999,
      "Text": " have a real life. Nobody asks them to go ahead and learn how to break into a computer."
    },
    {
      "Time_Start": 922.3399999999999,
      "Time_End": 924.74,
      "Text": " Because again, where I'm going to go into this a little bit when we start talking about"
    },
    {
      "Time_Start": 924.74,
      "Time_End": 929.9399999999999,
      "Text": " skill sets, the people who know how to break into computers best are the really good system"
    },
    {
      "Time_Start": 929.9399999999999,
      "Time_End": 934.54,
      "Text": " and network administrators. Those are the people who know the systems, you know, in"
    },
    {
      "Time_Start": 934.54,
      "Time_End": 939.38,
      "Text": " their soul. They know if something goes wrong. They could tweak send mail if they have to"
    },
    {
      "Time_Start": 939.38,
      "Time_End": 943.74,
      "Text": " to make it a relatively secure thing. But the deal is, nobody ever says, hey, by the"
    },
    {
      "Time_Start": 943.74,
      "Time_End": 948.1800000000001,
      "Text": " way, can you break into systems? Can you learn more how to break into systems? So that's"
    },
    {
      "Time_Start": 948.1800000000001,
      "Time_End": 952.14,
      "Text": " why you don't see a lot of the, you know, quote unquote, computer professionals call"
    },
    {
      "Time_Start": 952.14,
      "Time_End": 955.66,
      "Text": " themselves, you know, or get into security as much because nobody ever asks them to learn"
    },
    {
      "Time_Start": 955.66,
      "Time_End": 961.22,
      "Text": " those issues. So let's talk about a little, who are the hackers as a group? People who"
    },
    {
      "Time_Start": 961.22,
      "Time_End": 965.38,
      "Text": " love to call themselves hackers. First of all, you got the real geniuses. And again,"
    },
    {
      "Time_Start": 965.38,
      "Time_End": 971.02,
      "Text": " these are people like Loft, CDC, etc. These are people who find problems. These are people"
    },
    {
      "Time_Start": 971.02,
      "Time_End": 975.5,
      "Text": " who go out, they reverse engineer software. They do software engineering and testing."
    },
    {
      "Time_Start": 975.5,
      "Time_End": 980.02,
      "Text": " I mean, honestly, I don't call them hackers because I think it's an insult, you know,"
    },
    {
      "Time_Start": 980.02,
      "Time_End": 983.78,
      "Text": " that kind of belittles their skills. They are highly skilled software engineers and"
    },
    {
      "Time_Start": 983.78,
      "Time_End": 987.5,
      "Text": " testers. That's the way I look at it because that's their technical skills that they're"
    },
    {
      "Time_Start": 987.5,
      "Time_End": 991.5,
      "Text": " demonstrating. Then you also have another group of people who aren't as good as like"
    },
    {
      "Time_Start": 991.5,
      "Time_End": 995.54,
      "Text": " the real geniuses, but they're also highly skilled computer people. And again, these"
    },
    {
      "Time_Start": 995.54,
      "Time_End": 999.26,
      "Text": " are the quiet ones that know how to use tools very well. They might use the little scripts"
    },
    {
      "Time_Start": 999.26,
      "Time_End": 1003.42,
      "Text": " that everybody else writes, but what they do is they combine it with their own skills."
    },
    {
      "Time_Start": 1003.42,
      "Time_End": 1008.1,
      "Text": " You know, if they're actually performing a penetration test under contract, they'll use"
    },
    {
      "Time_Start": 1008.1,
      "Time_End": 1013.46,
      "Text": " the same tools the tools puppies use, but also what they'll do is they'll go to manual"
    },
    {
      "Time_Start": 1013.46,
      "Time_End": 1018.22,
      "Text": " techniques after that if the tools don't work. They will get in eventually. They're not out"
    },
    {
      "Time_Start": 1018.22,
      "Time_End": 1021.98,
      "Text": " there looking for the problems, analyzing the stuff, but they know networks and computers"
    },
    {
      "Time_Start": 1021.98,
      "Time_End": 1025.7,
      "Text": " well. Then you got the group of people that are out there that the press loves because"
    },
    {
      "Time_Start": 1025.7,
      "Time_End": 1030.42,
      "Text": " there tend to be good visuals are the script kiddies and where's puppies. And these are"
    },
    {
      "Time_Start": 1030.42,
      "Time_End": 1034.5,
      "Text": " people that spend most of their time calling themselves computer hackers as opposed to"
    },
    {
      "Time_Start": 1034.5,
      "Time_End": 1037.22,
      "Text": " being in front of a computer. Or when they are in front of a computer, they're surfing"
    },
    {
      "Time_Start": 1037.22,
      "Time_End": 1042.38,
      "Text": " websites trying to just like, you know, run R stat D against people at random. And these"
    },
    {
      "Time_Start": 1042.38,
      "Time_End": 1047.14,
      "Text": " are people who really demonstrate no real skills in computers. And let me first of all"
    },
    {
      "Time_Start": 1047.14,
      "Time_End": 1050.7,
      "Text": " say it takes, well, I'm kind of famous for this, but it takes no real skills to break"
    },
    {
      "Time_Start": 1050.7,
      "Time_End": 1055.0800000000002,
      "Text": " into computers. And I got to, I should say that I will no longer say I can teach a monkey"
    },
    {
      "Time_Start": 1055.08,
      "Time_End": 1061.6399999999999,
      "Text": " to hack a computer in a few hours. Thank you. I found out there are very talented people"
    },
    {
      "Time_Start": 1061.6399999999999,
      "Time_End": 1065.24,
      "Text": " who take offense at this. And I didn't mean to offend them, but I don't consider what"
    },
    {
      "Time_Start": 1065.24,
      "Time_End": 1068.9199999999998,
      "Text": " they do hacking. You know, but again, the wrong population was offended, so I'm not"
    },
    {
      "Time_Start": 1068.9199999999998,
      "Time_End": 1073.6399999999999,
      "Text": " going to say I could train a monkey to hack a computer. But anyway, but anyway, just breaking"
    },
    {
      "Time_Start": 1073.6399999999999,
      "Time_End": 1079.32,
      "Text": " into a computer, an installed computer doesn't take any skill at all, especially when you"
    },
    {
      "Time_Start": 1079.32,
      "Time_End": 1083.3999999999999,
      "Text": " look at how systems are maintained. And again, the script kiddies don't really know anything."
    },
    {
      "Time_Start": 1083.8400000000001,
      "Time_End": 1087.8400000000001,
      "Text": " Okay, as far as this, it would have been a great visual. I still need some quote, by"
    },
    {
      "Time_Start": 1087.8400000000001,
      "Time_End": 1091.16,
      "Text": " the way, on how to, you know, as opposed to how to train, you know, I can train monkeys"
    },
    {
      "Time_Start": 1091.16,
      "Time_End": 1095.3200000000002,
      "Text": " to hack computers. And actually, I'm giving a presentation to about 100, like Fortune,"
    },
    {
      "Time_Start": 1095.3200000000002,
      "Time_End": 1099.52,
      "Text": " like 1,000 CIOs. And I'm going to say, I'm rephrasing, I can train a monkey to hack a"
    },
    {
      "Time_Start": 1099.52,
      "Time_End": 1103.72,
      "Text": " computer in a few hours, so I can teach a CIO to break into a computer in a few hours."
    },
    {
      "Time_Start": 1103.72,
      "Time_End": 1114.96,
      "Text": " Honestly, though, I'm not sure if that's less insulting. But in the meantime, I need"
    },
    {
      "Time_Start": 1114.96,
      "Time_End": 1119.32,
      "Text": " something better. It doesn't catch the attention of people. Because again, when I say that"
    },
    {
      "Time_Start": 1119.32,
      "Time_End": 1123.08,
      "Text": " quote, I mean to get the attention of the press that you don't look at like those damn"
    },
    {
      "Time_Start": 1123.08,
      "Time_End": 1127.72,
      "Text": " website hacks that people keep doing, and saying that this took computer genius. And"
    },
    {
      "Time_Start": 1127.72,
      "Time_End": 1131.44,
      "Text": " then honestly, you know, Kevin, in my opinion, Kevin Mitnick did crimes. He deserves to go"
    },
    {
      "Time_Start": 1131.44,
      "Time_End": 1136.28,
      "Text": " to jail. But they are honestly making a martyr out of him for people. And that's an issue."
    },
    {
      "Time_Start": 1136.28,
      "Time_End": 1139.6000000000001,
      "Text": " You know, they wouldn't have to make a martyr out of him if there weren't all these little"
    },
    {
      "Time_Start": 1139.6000000000001,
      "Time_End": 1144.72,
      "Text": " script kiddies who are perceived to be geniuses as Kevin Mitnick as the modern-day Fagin."
    },
    {
      "Time_Start": 1144.72,
      "Time_End": 1150.28,
      "Text": " So again, just help me get some, you know, think of something. I'm willing to take ideas."
    },
    {
      "Time_Start": 1150.28,
      "Time_End": 1154.4,
      "Text": " Anyway, script kiddies aren't the answers I've already mentioned. Because it's much"
    },
    {
      "Time_Start": 1154.4,
      "Time_End": 1158.56,
      "Text": " more difficult to protect a computer than to break into it. How many people here are"
    },
    {
      "Time_Start": 1158.56,
      "Time_End": 1164.56,
      "Text": " system admins? How many people here who are system admins have like previously tried to"
    },
    {
      "Time_Start": 1164.56,
      "Time_End": 1171.3999999999999,
      "Text": " break into systems at some point in their life? Which is harder? Does it take, is there"
    },
    {
      "Time_Start": 1171.3999999999999,
      "Time_End": 1176.8,
      "Text": " any question as to which is harder? There are so many ways in, but there's just very,"
    },
    {
      "Time_Start": 1176.8,
      "Time_End": 1180.0,
      "Text": " you know, there are so many ways in and you have to think of all of them. And again, the"
    },
    {
      "Time_Start": 1180.0,
      "Time_End": 1184.72,
      "Text": " example I tend to give people, maybe the press likes things simplified, is arsonists cannot"
    },
    {
      "Time_Start": 1184.72,
      "Time_End": 1190.2,
      "Text": " put out fires or engineer fire-safe buildings. They know how to take a bunch of papers together,"
    },
    {
      "Time_Start": 1190.2,
      "Time_End": 1194.48,
      "Text": " take gasoline, spread it around, light everything up. It's the same thing with script kiddies."
    },
    {
      "Time_Start": 1194.48,
      "Time_End": 1198.4,
      "Text": " They know how to take a bunch of tools, you know, shoot it off at the websites and do"
    },
    {
      "Time_Start": 1198.4,
      "Time_End": 1202.16,
      "Text": " it. But if you ever say, it's like, damn, the quote I really hate, it's like, well,"
    },
    {
      "Time_Start": 1202.16,
      "Time_End": 1206.0,
      "Text": " they broke in, let them fix, hire them to fix it. It's like, first of all, that's kind"
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1210.6000000000001,
      "Text": " of extortion in some ways. And the second place, the skill set doesn't fit. Knowing"
    },
    {
      "Time_Start": 1210.68,
      "Time_End": 1216.44,
      "Text": " how to run a send-mail hack or a loft crack doesn't make you figure out how to make MT"
    },
    {
      "Time_Start": 1216.44,
      "Time_End": 1219.8000000000002,
      "Text": " secure, which is hard to do even if you have an incredible amount of clue."
    },
    {
      "Time_Start": 1219.8000000000002,
      "Time_End": 1226.7600000000002,
      "Text": " The next thing is, people, the script kiddies also tend to get frustrated and give up. If"
    },
    {
      "Time_Start": 1226.7600000000002,
      "Time_End": 1232.0400000000002,
      "Text": " you hire a script kiddie, now protect my computer, they'll go, oh, well, here's how you break"
    },
    {
      "Time_Start": 1232.0400000000002,
      "Time_End": 1235.68,
      "Text": " into it, blah, blah, blah, blah, blah. It's like, wait a second, you know, then you do,"
    },
    {
      "Time_Start": 1235.68,
      "Time_End": 1238.5600000000002,
      "Text": " it's like, damn, somebody broke in. It's like, then they'll try to fix, damn, somebody broke"
    },
    {
      "Time_Start": 1238.56,
      "Time_End": 1242.44,
      "Text": " in again, damn, somebody broke in, oh, screw it, and then they'll do something else. And"
    },
    {
      "Time_Start": 1242.44,
      "Time_End": 1246.08,
      "Text": " again, it tends to get old after a while, because, you know, I was talking, Kevin Poulsen"
    },
    {
      "Time_Start": 1246.08,
      "Time_End": 1249.8799999999999,
      "Text": " was talking upstairs afterwards, after he spoke down here, and again, he was saying"
    },
    {
      "Time_Start": 1249.8799999999999,
      "Time_End": 1254.54,
      "Text": " by the time he was caught, quote unquote, he was about, you know, he was giving up computers"
    },
    {
      "Time_Start": 1254.54,
      "Time_End": 1258.04,
      "Text": " except for the fact he was on the run, because it just got old."
    },
    {
      "Time_Start": 1258.04,
      "Time_End": 1262.9199999999998,
      "Text": " And Kevin is honestly one of the best people there ever was for doing what he did. And"
    },
    {
      "Time_Start": 1262.9199999999998,
      "Time_End": 1267.8799999999999,
      "Text": " again, it got old to him. And honestly, script kiddies give real hackers a bad name, just"
    },
    {
      "Time_Start": 1267.88,
      "Time_End": 1272.2800000000002,
      "Text": " like, you know, the guy was saying before me, because again, every time some websites"
    },
    {
      "Time_Start": 1272.2800000000002,
      "Time_End": 1276.96,
      "Text": " hack, anybody that calls himself the hacker for the right reason gets a black eye."
    },
    {
      "Time_Start": 1276.96,
      "Time_End": 1281.72,
      "Text": " Okay, let's look at chess first, because again, here's where maybe even script kiddies can"
    },
    {
      "Time_Start": 1281.72,
      "Time_End": 1286.72,
      "Text": " be useful. There was a study done about the game of chess. They wanted to find out what"
    },
    {
      "Time_Start": 1286.72,
      "Time_End": 1291.16,
      "Text": " differentiates a master from a grandmaster. And they went ahead and they looked at all"
    },
    {
      "Time_Start": 1291.16,
      "Time_End": 1296.3200000000002,
      "Text": " facets of behavioral skills, cognitive abilities, and the like, just to find out how they can"
    },
    {
      "Time_Start": 1296.32,
      "Time_End": 1302.0,
      "Text": " find a good grandmaster as opposed to a master. And the only difference they found is that"
    },
    {
      "Time_Start": 1302.0,
      "Time_End": 1309.08,
      "Text": " grandmasters have more passion for it. Grandmasters love chess more than masters do. And it's"
    },
    {
      "Time_Start": 1309.08,
      "Time_End": 1312.56,
      "Text": " the same thing. Let's look at it this way. If you're here at this conference, you know,"
    },
    {
      "Time_Start": 1312.56,
      "Time_End": 1316.48,
      "Text": " you're paying $50, you're paying your own way or whatever. Some of you honestly don't"
    },
    {
      "Time_Start": 1316.48,
      "Time_End": 1320.1599999999999,
      "Text": " have the money, which is more impressive to come. You're not on corporate budgets. What's"
    },
    {
      "Time_Start": 1320.1599999999999,
      "Time_End": 1324.72,
      "Text": " happening is you have some sort of passion for the industry. You have some sort of passion"
    },
    {
      "Time_Start": 1324.72,
      "Time_End": 1329.2,
      "Text": " for hopefully not breaking into computers, but computers as a whole. So maybe the thought"
    },
    {
      "Time_Start": 1329.2,
      "Time_End": 1334.84,
      "Text": " is that that could make you a better computer professional who knows security. You know,"
    },
    {
      "Time_Start": 1334.84,
      "Time_End": 1339.16,
      "Text": " you're just kind of, if you're a script kitty, you're just off doing the way bad things,"
    },
    {
      "Time_Start": 1339.16,
      "Time_End": 1343.32,
      "Text": " which could get you in jail. But again, they have the right passion, they're just putting"
    },
    {
      "Time_Start": 1343.32,
      "Time_End": 1347.1200000000001,
      "Text": " it in the wrong place. So what I'm going to try to do now is kind of like say where you"
    },
    {
      "Time_Start": 1347.1200000000001,
      "Time_End": 1352.28,
      "Text": " can fit in and maybe where you can direct your passion if you have one. And again, you"
    },
    {
      "Time_Start": 1352.28,
      "Time_End": 1355.92,
      "Text": " have to see how well, in order to see if somebody's like a script kitty who's going"
    },
    {
      "Time_Start": 1355.92,
      "Time_End": 1361.08,
      "Text": " to go away or somebody who's like really passionate for it. When a script kitty doesn't get in"
    },
    {
      "Time_Start": 1361.08,
      "Time_End": 1365.92,
      "Text": " using his tools, they'll give up hacking if they're not passionate. They'll go away and"
    },
    {
      "Time_Start": 1365.92,
      "Time_End": 1369.84,
      "Text": " say, damn, that little script didn't work. I'll go find another one. And then when that"
    },
    {
      "Time_Start": 1369.84,
      "Time_End": 1373.36,
      "Text": " one doesn't work, they'll go find another one. And after like the third or fourth script,"
    },
    {
      "Time_Start": 1373.36,
      "Time_End": 1380.8799999999999,
      "Text": " they'll, who knows, hopefully find out women exist. And then maybe the people who do keep"
    },
    {
      "Time_Start": 1380.88,
      "Time_End": 1384.68,
      "Text": " going on who don't get in, you know, those are the people who can eventually do the things"
    },
    {
      "Time_Start": 1384.68,
      "Time_End": 1389.1200000000001,
      "Text": " that Loft does, like going ahead, finding computer programs and stuff like that, finding"
    },
    {
      "Time_Start": 1389.1200000000001,
      "Time_End": 1394.64,
      "Text": " flaws within software that gets developed. Another problem, and this is one of my big"
    },
    {
      "Time_Start": 1394.64,
      "Time_End": 1400.0800000000002,
      "Text": " pet peeves, is the security professional identity. Also, let's put in this, the intelligence"
    },
    {
      "Time_Start": 1400.0800000000002,
      "Time_End": 1406.1200000000001,
      "Text": " professional identity. Because I worked at NSA or CIA and therefore I know about security."
    },
    {
      "Time_Start": 1406.1200000000001,
      "Time_End": 1411.48,
      "Text": " I would remind you that NSA and CIA still have janitors and they don't know much about"
    },
    {
      "Time_Start": 1411.48,
      "Time_End": 1416.44,
      "Text": " security usually either. So the deal is that security professionals, they also have to"
    },
    {
      "Time_Start": 1416.44,
      "Time_End": 1420.7600000000002,
      "Text": " figure out why they're in the profession too. And again, most security professionals become"
    },
    {
      "Time_Start": 1420.7600000000002,
      "Time_End": 1424.3600000000001,
      "Text": " one when their employer tells them they're a security professional, when they have to"
    },
    {
      "Time_Start": 1424.3600000000001,
      "Time_End": 1429.5600000000002,
      "Text": " show up at a customer site. And typically, unfortunately, I found you get a lot of auditors"
    },
    {
      "Time_Start": 1429.5600000000002,
      "Time_End": 1434.5200000000002,
      "Text": " who are handed ISS and say, please run the ISS safe suite against our customers and remember"
    },
    {
      "Time_Start": 1434.52,
      "Time_End": 1437.92,
      "Text": " to tell them that you're a security expert who's studied the industry for years."
    },
    {
      "Time_Start": 1437.92,
      "Time_End": 1442.96,
      "Text": " Okay, let's talk about what can hackers do if you really want to learn about computers"
    },
    {
      "Time_Start": 1442.96,
      "Time_End": 1446.16,
      "Text": " and you want to go into the profession and you want to actually do some good somewhere"
    },
    {
      "Time_Start": 1446.16,
      "Time_End": 1451.6399999999999,
      "Text": " along the way. First of all, learn about computers. That's what hacking in its true form is supposed"
    },
    {
      "Time_Start": 1451.6399999999999,
      "Time_End": 1456.24,
      "Text": " to be. It's not about breaking into computers. But if you want to break into computers, go"
    },
    {
      "Time_Start": 1456.24,
      "Time_End": 1461.0,
      "Text": " ahead, break into your own computers. And again, remember, why is the Loft called the"
    },
    {
      "Time_Start": 1461.0,
      "Time_End": 1464.68,
      "Text": " Loft? Because they have a loft with a lot of computer equipment. It was kind of a joke."
    },
    {
      "Time_Start": 1464.68,
      "Time_End": 1469.44,
      "Text": " You know, the Loft was not called the Internet. These are people who break into their own"
    },
    {
      "Time_Start": 1469.44,
      "Time_End": 1474.56,
      "Text": " computers, not the Internet's computers. And again, also, study business reality because"
    },
    {
      "Time_Start": 1474.56,
      "Time_End": 1478.44,
      "Text": " people tend to forget about that and saying let's just get rid of Windows NT and that'll"
    },
    {
      "Time_Start": 1478.44,
      "Time_End": 1483.96,
      "Text": " solve everything is not a business reality. Now let's look at another example, you know,"
    },
    {
      "Time_Start": 1483.96,
      "Time_End": 1488.0,
      "Text": " another analogy quickly. Let's look at the martial arts. Anybody ever studied karate"
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1491.44,
      "Text": " or something like that? You know, everybody takes it when you're like four years old or"
    },
    {
      "Time_Start": 1491.44,
      "Time_End": 1497.84,
      "Text": " something. Anyway, what is a karate master, a martial arts master? Those are people who"
    },
    {
      "Time_Start": 1497.84,
      "Time_End": 1502.6,
      "Text": " have perfected the art. But what have they really perfected when you look at it? They've"
    },
    {
      "Time_Start": 1502.6,
      "Time_End": 1509.8,
      "Text": " perfected about a dozen to two dozen basic moves. They know how to do the basics perfectly"
    },
    {
      "Time_Start": 1509.8,
      "Time_End": 1513.68,
      "Text": " and then they can combine the basics to do the right things. It's not like you're a fourth"
    },
    {
      "Time_Start": 1513.68,
      "Time_End": 1516.96,
      "Text": " degree black belt and all of a sudden they teach you something that you've never seen"
    },
    {
      "Time_Start": 1516.96,
      "Time_End": 1521.1200000000001,
      "Text": " before. They teach you how to just, you can do more advanced things because you've got"
    },
    {
      "Time_Start": 1521.1200000000001,
      "Time_End": 1526.24,
      "Text": " the basics perfected. And again, perfecting the basics is the key. So let's look at the"
    },
    {
      "Time_Start": 1526.24,
      "Time_End": 1533.72,
      "Text": " basics. First basic is software engineering. This is the concept of writing well-engineered"
    },
    {
      "Time_Start": 1533.72,
      "Time_End": 1538.88,
      "Text": " and maintainable software. How many people know the term complexity? Software complexity?"
    },
    {
      "Time_Start": 1538.88,
      "Time_End": 1543.92,
      "Text": " Honestly, in this group I would have hoped a few more. What software complexity is, it's"
    },
    {
      "Time_Start": 1543.92,
      "Time_End": 1548.4,
      "Text": " how well software is engineered. The lower the complexity, the more compact it is, the"
    },
    {
      "Time_Start": 1548.4,
      "Time_End": 1552.96,
      "Text": " more narrow it is, the less likely there are to be bugs inside that software. When you"
    },
    {
      "Time_Start": 1552.96,
      "Time_End": 1556.8000000000002,
      "Text": " learn how to do that, you can learn to be a software developer. You can also learn how"
    },
    {
      "Time_Start": 1556.8000000000002,
      "Time_End": 1561.72,
      "Text": " to be better white box software testers. Because again, when you know how to engineer software,"
    },
    {
      "Time_Start": 1561.72,
      "Time_End": 1567.0800000000002,
      "Text": " you look at things in a more specific way. And also making software upgrades. You know,"
    },
    {
      "Time_Start": 1567.0800000000002,
      "Time_End": 1571.48,
      "Text": " you see some software, you go in and improve it. And I want to remind you that Microsoft"
    },
    {
      "Time_Start": 1571.48,
      "Time_End": 1577.6,
      "Text": " really needs this and they pay really well. So keep that in mind too. Also, Y2K modifications"
    },
    {
      "Time_Start": 1577.6,
      "Time_End": 1581.3600000000001,
      "Text": " are a good source of income possibly because I know a lot of people say they fixed the"
    },
    {
      "Time_Start": 1581.3600000000001,
      "Time_End": 1585.44,
      "Text": " problem. Chances are a lot haven't. So, you know, just start thinking of that as a potential"
    },
    {
      "Time_Start": 1585.44,
      "Time_End": 1590.4,
      "Text": " way to go next month. Also, systems administration. And when you talk about information warfare,"
    },
    {
      "Time_Start": 1590.4,
      "Time_End": 1594.84,
      "Text": " systems administrators are on the front line of what I call the real information warfare."
    },
    {
      "Time_Start": 1594.84,
      "Time_End": 1598.68,
      "Text": " I mean, these are the people who are down in the trenches. And again, when you look"
    },
    {
      "Time_Start": 1598.68,
      "Time_End": 1603.44,
      "Text": " at it and if you know the profession, I think of good security as really only being good"
    },
    {
      "Time_Start": 1603.44,
      "Time_End": 1608.1200000000001,
      "Text": " systems administration. Because I don't consider that you should have a special person who"
    },
    {
      "Time_Start": 1608.1200000000001,
      "Time_End": 1613.3200000000002,
      "Text": " has to know, gee, there's a Microsoft hot fix. You know, that's a security professional."
    },
    {
      "Time_Start": 1613.3200000000002,
      "Time_End": 1617.0800000000002,
      "Text": " I mean, systems administrators should be aware of this just as well as they should be aware"
    },
    {
      "Time_Start": 1617.0800000000002,
      "Time_End": 1621.3600000000001,
      "Text": " of Unix patches and stuff like that and update it. They should be aware of good configuration"
    },
    {
      "Time_Start": 1621.3600000000001,
      "Time_End": 1628.04,
      "Text": " issues. That's not a security issue. That's just basic systems administration. Next attitude"
    },
    {
      "Time_Start": 1628.04,
      "Time_End": 1632.84,
      "Text": " is, our next aspect is systems integration. And that's choosing the right systems for"
    },
    {
      "Time_Start": 1632.84,
      "Time_End": 1637.48,
      "Text": " the right jobs. These are people who put computers together, design networks and whatever. And"
    },
    {
      "Time_Start": 1637.48,
      "Time_End": 1641.8799999999999,
      "Text": " again, if you really want to get rid of Microsoft, that's the profession to go into. Because"
    },
    {
      "Time_Start": 1641.8799999999999,
      "Time_End": 1645.96,
      "Text": " this is the people who design the computer systems and they decide what components go"
    },
    {
      "Time_Start": 1645.96,
      "Time_End": 1650.68,
      "Text": " in there. They design how the network looks and stuff like that. And they can design,"
    },
    {
      "Time_Start": 1650.68,
      "Time_End": 1654.3999999999999,
      "Text": " if you know what you're doing, you can design security and from the start, you know, engineer"
    },
    {
      "Time_Start": 1654.4,
      "Time_End": 1658.68,
      "Text": " network choke points, user zones, things like that. Next aspect, if you don't want"
    },
    {
      "Time_Start": 1658.68,
      "Time_End": 1661.92,
      "Text": " to get into the nitty gritty technical stuff, is you could do requirements analysis and"
    },
    {
      "Time_Start": 1661.92,
      "Time_End": 1667.48,
      "Text": " test definition. And again, you can set security requirements up front. Not, gee, you know,"
    },
    {
      "Time_Start": 1667.48,
      "Time_End": 1672.1200000000001,
      "Text": " we should have, let's make sure nobody can log in after your system's installed. You"
    },
    {
      "Time_Start": 1672.1200000000001,
      "Time_End": 1675.48,
      "Text": " know, go ahead and design that from the start and make it a requirement and test for the"
    },
    {
      "Time_Start": 1675.48,
      "Time_End": 1680.6000000000001,
      "Text": " requirements existing. Key thing is understand the business issues and that you've got to"
    },
    {
      "Time_Start": 1680.6000000000001,
      "Time_End": 1685.2800000000002,
      "Text": " understand that security is a business risk issue. Again, there's always functionality"
    },
    {
      "Time_Start": 1685.2800000000002,
      "Time_End": 1689.5600000000002,
      "Text": " versus security. And if you're good in an organization, you have to balance it off."
    },
    {
      "Time_Start": 1689.5600000000002,
      "Time_End": 1692.96,
      "Text": " And if you want to make a, you know, if you want to actually be useful, make sure you"
    },
    {
      "Time_Start": 1692.96,
      "Time_End": 1697.7600000000002,
      "Text": " can balance it off. And again, I want to point out that if you go into your boss and say,"
    },
    {
      "Time_Start": 1697.7600000000002,
      "Time_End": 1702.0400000000002,
      "Text": " let's get rid of Microsoft, because that'll solve all our security problems. In the first"
    },
    {
      "Time_Start": 1702.0400000000002,
      "Time_End": 1704.8000000000002,
      "Text": " place, you're going to look like an idiot to him because you don't understand the business"
    },
    {
      "Time_Start": 1704.8000000000002,
      "Time_End": 1709.2400000000002,
      "Text": " issues. In the second place, if you think that Microsoft is the only system, if you"
    },
    {
      "Time_Start": 1709.24,
      "Time_End": 1713.52,
      "Text": " get rid of that and that's, Microsoft is the only software that has problems, then"
    },
    {
      "Time_Start": 1713.52,
      "Time_End": 1717.4,
      "Text": " you're an idiot from a security perspective, too. It will make it easier not to use some"
    },
    {
      "Time_Start": 1717.4,
      "Time_End": 1721.2,
      "Text": " of their systems, but again, just because you use an operating system, a good operating"
    },
    {
      "Time_Start": 1721.2,
      "Time_End": 1726.48,
      "Text": " system, doesn't mean you configure it well. Okay, quick test for are you clueless for"
    },
    {
      "Time_Start": 1726.48,
      "Time_End": 1729.8,
      "Text": " security professionals, too. Does anybody want that or not?"
    },
    {
      "Time_Start": 1729.8,
      "Time_End": 1730.8,
      "Text": " No."
    },
    {
      "Time_Start": 1730.8,
      "Time_End": 1731.8,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1731.8,
      "Time_End": 1736.72,
      "Text": " Yeah. Okay, basic issues. And again, if you do well on this test, this is just saying"
    },
    {
      "Time_Start": 1736.72,
      "Time_End": 1739.64,
      "Text": " you know the basics. It doesn't mean you're a real expert. It just means you're not clueless"
    },
    {
      "Time_Start": 1739.64,
      "Time_End": 1750.48,
      "Text": " with the subject. Do you use PGP? One for yes. If you say, what is PGP, stop counting."
    },
    {
      "Time_Start": 1750.48,
      "Time_End": 1756.96,
      "Text": " Next one, what is your password? If your password is seven or more characters with at least"
    },
    {
      "Time_Start": 1756.96,
      "Time_End": 1761.64,
      "Text": " one special character, it's not a dictionary word, blah, blah, blah, add one. And even"
    },
    {
      "Time_Start": 1761.64,
      "Time_End": 1765.44,
      "Text": " if you just say a special character is a number, I'll still give you it. If you were ready"
    },
    {
      "Time_Start": 1765.44,
      "Time_End": 1772.48,
      "Text": " to blurt out your password or you don't have a password, again, stop counting."
    },
    {
      "Time_Start": 1772.48,
      "Time_End": 1778.3600000000001,
      "Text": " Is your laptop boot password protected? Again, one for yes. What is a boot password minus"
    },
    {
      "Time_Start": 1778.3600000000001,
      "Time_End": 1785.1200000000001,
      "Text": " two in this case? What is a buffer overflow? One point for if you know it's an abnormal"
    },
    {
      "Time_Start": 1785.1200000000001,
      "Time_End": 1791.0800000000002,
      "Text": " software condition that results in, you know, sorry, long day. But anyway, it's an abnormal"
    },
    {
      "Time_Start": 1791.08,
      "Time_End": 1795.56,
      "Text": " software condition that can result in a session with access privileges or something close."
    },
    {
      "Time_Start": 1795.56,
      "Time_End": 1799.6,
      "Text": " Give yourself a point. If you thought that it had something to do with plumbing, subtract"
    },
    {
      "Time_Start": 1799.6,
      "Time_End": 1806.4399999999998,
      "Text": " one. When was the last time you updated your antivirus software? If it was any later than"
    },
    {
      "Time_Start": 1806.4399999999998,
      "Time_End": 1812.36,
      "Text": " mid-June, add one. If you never did it again, stop counting. How frequently do you perform"
    },
    {
      "Time_Start": 1812.36,
      "Time_End": 1819.24,
      "Text": " backups? If it's at least once a month, and that's being generous, add one point. What"
    },
    {
      "Time_Start": 1819.24,
      "Time_End": 1823.84,
      "Text": " version is your web browser? If it's the latest version, add one point. If you have"
    },
    {
      "Time_Start": 1823.84,
      "Time_End": 1830.44,
      "Text": " no clue, subtract two. Do you have the most recent hot fixes on Windows Service Pack loaded"
    },
    {
      "Time_Start": 1830.44,
      "Time_End": 1832.44,
      "Text": " on your system? Add one."
    },
    {
      "Time_Start": 1832.44,
      "Time_End": 1837.04,
      "Text": " What if you don't have Microsoft?"
    },
    {
      "Time_Start": 1837.04,
      "Time_End": 1838.04,
      "Text": " Add five."
    },
    {
      "Time_Start": 1838.04,
      "Time_End": 1846.24,
      "Text": " Do you know what BugTrack is?"
    },
    {
      "Time_Start": 1846.24,
      "Time_End": 1847.24,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1848.24,
      "Time_End": 1853.04,
      "Text": " One point for yes. And again, if you actually thought it had something to do with insects,"
    },
    {
      "Time_Start": 1853.04,
      "Time_End": 1862.24,
      "Text": " subtract two. Do you have your hard drive with you or locked up?"
    },
    {
      "Time_Start": 1862.24,
      "Time_End": 1867.64,
      "Text": " One point for yes. If you answered no and you are staying in the conference hotel, subtract"
    },
    {
      "Time_Start": 1867.64,
      "Time_End": 1875.64,
      "Text": " five. And again, that was the question. Again, those were ten simple things, and those are"
    },
    {
      "Time_Start": 1875.64,
      "Time_End": 1880.8400000000001,
      "Text": " just the basics, and that's an indication as if you know the basic issues of the profession."
    },
    {
      "Time_Start": 1880.8400000000001,
      "Time_End": 1886.64,
      "Text": " It doesn't mean you're any expert. It means you know the basics. And also see, because"
    },
    {
      "Time_Start": 1886.64,
      "Time_End": 1890.64,
      "Text": " you should be preaching those things to your customers. If you're not practicing what you"
    },
    {
      "Time_Start": 1890.64,
      "Time_End": 1894.64,
      "Text": " preach, you don't deserve to be in the profession. At least that's my opinion."
    },
    {
      "Time_Start": 1894.64,
      "Time_End": 1899.0400000000002,
      "Text": " Okay, let me close up quickly by the Wizard of Oz. Anybody hear my Wizard of Oz thing"
    },
    {
      "Time_Start": 1899.0400000000002,
      "Time_End": 1905.0400000000002,
      "Text": " before? Okay, one or two people. Basically, this is a philosophy of security that I like,"
    },
    {
      "Time_Start": 1905.04,
      "Time_End": 1909.04,
      "Text": " hope people pick up. Because the Wizard of Oz says an awful lot about a lot of things"
    },
    {
      "Time_Start": 1909.04,
      "Time_End": 1914.04,
      "Text": " besides a Pink Floyd, I think it was. In the first place, let's look at how the Wizard"
    },
    {
      "Time_Start": 1914.04,
      "Time_End": 1918.04,
      "Text": " of Oz starts. Some bad woman wants to take Dorothy's dog, so Dorothy runs away from home,"
    },
    {
      "Time_Start": 1918.04,
      "Time_End": 1923.04,
      "Text": " goes to some snake oil salesman, and he convinces her to go home, and she runs back to the thing."
    },
    {
      "Time_Start": 1923.04,
      "Time_End": 1927.04,
      "Text": " But then a tornado comes up, she gets hit in the back of the head, then she falls on"
    },
    {
      "Time_Start": 1927.04,
      "Time_End": 1930.6399999999999,
      "Text": " the couch, and she wakes up, and she's in the land of Oz. Then she's walking around"
    },
    {
      "Time_Start": 1930.6399999999999,
      "Time_End": 1934.44,
      "Text": " and everything like that with Toto following her, and she's like, we're not in Kansas"
    },
    {
      "Time_Start": 1934.44,
      "Time_End": 1938.24,
      "Text": " anymore. So they go around, and then all of a sudden, a big pink bubble comes floating"
    },
    {
      "Time_Start": 1938.24,
      "Time_End": 1942.44,
      "Text": " down from the sky. And it turns into the good witch, and the good witch goes, are you a"
    },
    {
      "Time_Start": 1942.44,
      "Time_End": 1945.8400000000001,
      "Text": " good witch or a bad witch? And she's like, well, I'm not a witch. The witch goes, you"
    },
    {
      "Time_Start": 1945.8400000000001,
      "Time_End": 1950.44,
      "Text": " must be a witch, you killed a witch. And it's like, oh, no, I didn't kill anybody. And then"
    },
    {
      "Time_Start": 1950.44,
      "Time_End": 1954.44,
      "Text": " it's like, oh, look over there. And they look, and they see the feet sticking out from, oh,"
    },
    {
      "Time_Start": 1954.44,
      "Time_End": 1959.44,
      "Text": " I didn't mean to kill her. Oh, no, killing a bad witch is good, yay you. So yay me, ding"
    },
    {
      "Time_Start": 1959.44,
      "Time_End": 1963.94,
      "Text": " dong, the witch is dead. And they all skip around, right? So then what happens, after"
    },
    {
      "Time_Start": 1963.94,
      "Time_End": 1968.04,
      "Text": " the song is over, because this is a musical, big black puff of smoke, or somebody said"
    },
    {
      "Time_Start": 1968.04,
      "Time_End": 1972.04,
      "Text": " it was red, big red puff of smoke, and all of a sudden, who killed my sister? And she's"
    },
    {
      "Time_Start": 1972.04,
      "Time_End": 1975.94,
      "Text": " chasing them all around. And first of all, Dorothy admits it, much like Kevin Poulsen"
    },
    {
      "Time_Start": 1975.94,
      "Time_End": 1984.94,
      "Text": " did stupidly. You know, I didn't mean to kill her. And it's like, oh, what do you, oh, you"
    },
    {
      "Time_Start": 1984.94,
      "Time_End": 1990.74,
      "Text": " killed my sister. Oh, I'm gonna get you and your little dog, too. And it's like, good,"
    },
    {
      "Time_Start": 1990.74,
      "Time_End": 1997.04,
      "Text": " thank you, I'll need you. So then she's, then the good witch goes, wait a second, what about"
    },
    {
      "Time_Start": 1997.04,
      "Time_End": 2000.74,
      "Text": " the ruby red slippers? And she's, yeah, the ruby red slippers. She goes, gets them. And"
    },
    {
      "Time_Start": 2000.74,
      "Time_End": 2004.74,
      "Text": " all of a sudden, the ruby red slippers disappear, the legs shrivel up and, you know, go away."
    },
    {
      "Time_Start": 2004.74,
      "Time_End": 2008.44,
      "Text": " And then what happens? They're on Dorothy's slippers, you know, Dorothy's feet. And Dorothy,"
    },
    {
      "Time_Start": 2008.44,
      "Time_End": 2011.74,
      "Text": " you know, she goes to get it, poof, you know, can't get away or anything like that. And"
    },
    {
      "Time_Start": 2011.74,
      "Time_End": 2018.74,
      "Text": " she's like, please. Once again? Yeah, once again. I'll get you, my pretty. Right, and"
    },
    {
      "Time_Start": 2018.74,
      "Time_End": 2022.54,
      "Text": " then she goes off in another big black puff of smoke. Now, Dorothy is really in a shit"
    },
    {
      "Time_Start": 2022.54,
      "Time_End": 2026.94,
      "Text": " load of trouble. She's really, you know, she's there, she killed this woman's sister, now"
    },
    {
      "Time_Start": 2026.94,
      "Time_End": 2030.94,
      "Text": " she has the only inheritance she wanted. And she's like, I just want to go home. And the"
    },
    {
      "Time_Start": 2030.94,
      "Time_End": 2034.44,
      "Text": " good witch is like, oh, I can't help you, but go see the wizard, because the wizard"
    },
    {
      "Time_Start": 2034.44,
      "Time_End": 2038.04,
      "Text": " can do everything. So they go up, follow the Elber Crow, follow the Elber Crow. Go off"
    },
    {
      "Time_Start": 2038.04,
      "Time_End": 2041.54,
      "Text": " along the way, they meet the Scarecrow. He's once a brain. And Dorothy's like, well, I"
    },
    {
      "Time_Start": 2041.54,
      "Time_End": 2044.54,
      "Text": " never met this guy, but what the hell, you're sitting here in a field with no brain, you"
    },
    {
      "Time_Start": 2044.54,
      "Time_End": 2047.6399999999999,
      "Text": " might as well come with me. And he's like, okay. Then they go ahead and find the Tin"
    },
    {
      "Time_Start": 2047.6399999999999,
      "Time_End": 2052.24,
      "Text": " Man. You know, Tin Man's like, hey, if he's getting a brain, I want a heart, major organs,"
    },
    {
      "Time_Start": 2052.24,
      "Time_End": 2056.54,
      "Text": " same thing, okay, let's go with him. Then you got the Cowardly Lion. Cowardly Lion comes"
    },
    {
      "Time_Start": 2056.54,
      "Time_End": 2060.74,
      "Text": " along, what happens? Oh, brain, heart, courage, no brainer, I'm going with him. So they go"
    },
    {
      "Time_Start": 2060.74,
      "Time_End": 2064.34,
      "Text": " along the way, and like the bad witch is doing stuff, the good witch is doing stuff, and"
    },
    {
      "Time_Start": 2064.34,
      "Time_End": 2068.24,
      "Text": " finally they get to the Land of Oz. They get to the Land of Oz, and what happens? You know,"
    },
    {
      "Time_Start": 2068.2400000000002,
      "Time_End": 2071.84,
      "Text": " they ask, tell a sob story, they get in the gates, and then all of a sudden, they see"
    },
    {
      "Time_Start": 2071.84,
      "Time_End": 2076.6400000000003,
      "Text": " Surrender Dorothy being written in the sky. This is key, remember this. They see Surrender"
    },
    {
      "Time_Start": 2076.6400000000003,
      "Time_End": 2080.44,
      "Text": " Dorothy, and they're like, who's Dorothy? I'm Dorothy. Go to the wizard. You know, so"
    },
    {
      "Time_Start": 2080.44,
      "Time_End": 2084.5400000000004,
      "Text": " they go to the wizard, what happens? The wizard's like, what the hell am I gonna do? I can't"
    },
    {
      "Time_Start": 2084.5400000000004,
      "Time_End": 2089.44,
      "Text": " do a damn thing. I'm a sham. Everybody knows I'm a sham, so therefore, well, nobody knows"
    },
    {
      "Time_Start": 2089.44,
      "Time_End": 2092.84,
      "Text": " I'm a sham. If I can't do anything for them, they'll think I'm a sham. I want her to get"
    },
    {
      "Time_Start": 2092.84,
      "Time_End": 2096.7400000000002,
      "Text": " the hell out of here. So anyway, somehow, you know, tell another sob story, and like"
    },
    {
      "Time_Start": 2096.7400000000002,
      "Time_End": 2099.94,
      "Text": " the guy lets them in, and they see the wizard. The wizard's like, I'll give you everything"
    },
    {
      "Time_Start": 2099.94,
      "Time_End": 2104.84,
      "Text": " you want. But what's he really thinking? The witch said, Surrender Dorothy, right? I'm"
    },
    {
      "Time_Start": 2104.84,
      "Time_End": 2107.94,
      "Text": " gonna surrender Dorothy and send her on a suicide mission right to the witch, because"
    },
    {
      "Time_Start": 2107.94,
      "Time_End": 2112.34,
      "Text": " think about it. He said, get me the witch's broomstick. So he's like, and he sends them"
    },
    {
      "Time_Start": 2112.34,
      "Time_End": 2115.5400000000004,
      "Text": " right to the witch's castle. So the witch sends the flying monkeys. The flying monkeys"
    },
    {
      "Time_Start": 2115.5400000000004,
      "Time_End": 2119.44,
      "Text": " come, take her away, literally kick the stuffing out of the scarecrow. I like that part. And"
    },
    {
      "Time_Start": 2119.44,
      "Time_End": 2124.2400000000002,
      "Text": " then, then they go ahead, and like Dorothy's trapped in the thing, and like the witch wants"
    },
    {
      "Time_Start": 2124.2400000000002,
      "Time_End": 2128.0400000000004,
      "Text": " to blow her up. So the witch tries to blow her up, and all of a sudden, you know, like"
    },
    {
      "Time_Start": 2128.0400000000004,
      "Time_End": 2132.34,
      "Text": " Toto jumps out the back door and runs down and gets everybody. And then the tin man finally"
    },
    {
      "Time_Start": 2132.34,
      "Time_End": 2137.1400000000003,
      "Text": " realizes he, oh, I'm sorry, let me, key thing I almost missed. What happens? They get to"
    },
    {
      "Time_Start": 2137.1400000000003,
      "Time_End": 2141.94,
      "Text": " the castle, you know, the three stooges or whatever, and they're standing outside, and"
    },
    {
      "Time_Start": 2141.94,
      "Time_End": 2146.7400000000002,
      "Text": " what happens? You know, the scarecrow thinks of an idea. Let's go ahead and, you know,"
    },
    {
      "Time_Start": 2146.7400000000002,
      "Time_End": 2150.7400000000002,
      "Text": " they jump the guys, let's follow them in, follow those oleobiolum guys in there. And"
    },
    {
      "Time_Start": 2150.7400000000002,
      "Time_End": 2154.34,
      "Text": " they follow the oleobiolum guys in, and then they get Dorothy with the axe, cause this,"
    },
    {
      "Time_Start": 2154.34,
      "Time_End": 2159.44,
      "Text": " the tin man finally realizes he has a weapon with him. So he goes ahead and breaks it down."
    },
    {
      "Time_Start": 2159.44,
      "Time_End": 2163.1400000000003,
      "Text": " And they get Dorothy out. But then again, this is the evil witch, and she's really one"
    },
    {
      "Time_Start": 2163.1400000000003,
      "Time_End": 2167.34,
      "Text": " of the all-time classic movie witches, cause she's evil to the core, and always seems to"
    },
    {
      "Time_Start": 2167.34,
      "Time_End": 2170.5400000000004,
      "Text": " know what she's doing. Anyway, they chase him, get him, you know, follow him up, get"
    },
    {
      "Time_Start": 2170.5400000000004,
      "Time_End": 2174.5400000000004,
      "Text": " to the tower. And then what happens? They're in the tower, and all of a sudden, you know,"
    },
    {
      "Time_Start": 2174.5400000000004,
      "Time_End": 2178.5400000000004,
      "Text": " witch has him trapped, and he's like, now Dorothy, I'm still gonna get you. However,"
    },
    {
      "Time_Start": 2178.64,
      "Time_End": 2182.04,
      "Text": " since I have this wonderful opportunity, you're gonna watch all your friends die a horrible"
    },
    {
      "Time_Start": 2182.04,
      "Time_End": 2187.64,
      "Text": " death in the meantime. So, let's set the scarecrow on fire. Dorothy, oh my goodness, she picks"
    },
    {
      "Time_Start": 2187.64,
      "Time_End": 2191.74,
      "Text": " up a bucket of water, throws it on the scarecrow, accidentally, and remember, it wasn't accidentally,"
    },
    {
      "Time_Start": 2191.74,
      "Time_End": 2195.64,
      "Text": " hits the witch, and yeah, melting, melting, melting, she's dead. Then they go around,"
    },
    {
      "Time_Start": 2195.64,
      "Time_End": 2199.24,
      "Text": " and all of a sudden, you know, it's like one of the oleobiolum guys comes up, it's like,"
    },
    {
      "Time_Start": 2199.24,
      "Time_End": 2203.34,
      "Text": " you've killed the witch. And Dorothy goes, I didn't mean to, and like, she never got"
    },
    {
      "Time_Start": 2203.34,
      "Time_End": 2207.84,
      "Text": " a clue yet. But then what happens is they're like, no, that's a good thing. And she's like,"
    },
    {
      "Time_Start": 2207.84,
      "Time_End": 2211.54,
      "Text": " oh, can I have the broomstick? Yeah, go ahead, take it, get out. So they go, then they're"
    },
    {
      "Time_Start": 2211.54,
      "Time_End": 2215.94,
      "Text": " back to the wizard. The wizard's like, what the hell am I gonna do? Cause he's saying"
    },
    {
      "Time_Start": 2215.94,
      "Time_End": 2220.7400000000002,
      "Text": " that, I tried to get rid of her, I can't send her back to Kansas any more than anybody else."
    },
    {
      "Time_Start": 2220.7400000000002,
      "Time_End": 2224.1400000000003,
      "Text": " So he goes ahead, and he says, go away. But Toto, the only creature in Oz that doesn't"
    },
    {
      "Time_Start": 2224.1400000000003,
      "Time_End": 2227.6400000000003,
      "Text": " seem to have a rational thought in his head, is the only one that looks behind the curtain."
    },
    {
      "Time_Start": 2227.6400000000003,
      "Time_End": 2231.44,
      "Text": " He looks behind the curtain, and what happens? They see it's like this guy there. And all"
    },
    {
      "Time_Start": 2231.44,
      "Time_End": 2235.94,
      "Text": " of a sudden, they're getting really pissed, right? So, and they realize that the Tin Man"
    },
    {
      "Time_Start": 2236.04,
      "Time_End": 2239.44,
      "Text": " has an axe, but it's like, he doesn't, hasn't shot me up yet, so that's a good thing. So"
    },
    {
      "Time_Start": 2239.44,
      "Time_End": 2243.7400000000002,
      "Text": " what does the wizard do? He goes ahead and thinks, wait a second, okay, Scarecrow, you"
    },
    {
      "Time_Start": 2243.7400000000002,
      "Time_End": 2247.84,
      "Text": " want a brain? You've been showing intelligence throughout this whole time. You've had a brain"
    },
    {
      "Time_Start": 2247.84,
      "Time_End": 2251.34,
      "Text": " the whole time, you just don't have something to prove to yourself you have it. So here's"
    },
    {
      "Time_Start": 2251.34,
      "Time_End": 2255.44,
      "Text": " a worthless piece of paper. Then he goes, then he goes to the lion, you want courage?"
    },
    {
      "Time_Start": 2255.44,
      "Time_End": 2258.7400000000002,
      "Text": " Well, you've had courage the whole time. You went on that charade, you know, that suicide"
    },
    {
      "Time_Start": 2258.7400000000002,
      "Time_End": 2261.7400000000002,
      "Text": " mission. The only thing you don't have is a medal. Here's a worthless piece of tin."
    },
    {
      "Time_Start": 2261.7400000000002,
      "Time_End": 2264.64,
      "Text": " Now you can say you have courage. Tin Man, you want a heart? You have, you know, you've"
    },
    {
      "Time_Start": 2264.64,
      "Time_End": 2269.54,
      "Text": " been crying the whole time. Get with the program. You have a heart. Go ahead and use"
    },
    {
      "Time_Start": 2269.54,
      "Time_End": 2274.04,
      "Text": " this stuff. You know, here, here's a, here's a watch. And it's like, oh. And somebody says"
    },
    {
      "Time_Start": 2274.04,
      "Time_End": 2278.54,
      "Text": " he is a wizard. Why is he a wizard? Because he showed them they had what they were looking"
    },
    {
      "Time_Start": 2278.54,
      "Time_End": 2282.94,
      "Text": " for and needed the whole time. Then Dorothy says, well, there's nothing in there for me,"
    },
    {
      "Time_Start": 2282.94,
      "Time_End": 2286.8399999999997,
      "Text": " even though you might still claim to be a wizard. And she goes, well, my gig here is"
    },
    {
      "Time_Start": 2286.8399999999997,
      "Time_End": 2290.94,
      "Text": " up. I'm gonna go back to Kansas in my balloon. Why don't you come with me? So anyway, what"
    },
    {
      "Time_Start": 2291.04,
      "Time_End": 2294.84,
      "Text": " happens? He gets in the balloon. Toto jumps out just at the wrong moment in time. The"
    },
    {
      "Time_Start": 2294.84,
      "Time_End": 2299.54,
      "Text": " balloon starts taking off. And then all of a sudden, you know, the security, well, the"
    },
    {
      "Time_Start": 2299.54,
      "Time_End": 2303.04,
      "Text": " wizard, like most security professionals, doesn't know how to use the things he has."
    },
    {
      "Time_Start": 2303.04,
      "Time_End": 2306.64,
      "Text": " Like the balloon can't turn it around. So he goes floating off. And then Dorothy's all"
    },
    {
      "Time_Start": 2306.64,
      "Time_End": 2310.7400000000002,
      "Text": " depressed. And all of a sudden, you know, they're all talking. And then all of a sudden,"
    },
    {
      "Time_Start": 2310.7400000000002,
      "Time_End": 2315.14,
      "Text": " a big pink bubble comes floating down from the sky. And what's the first thing that was"
    },
    {
      "Time_Start": 2315.14,
      "Time_End": 2320.04,
      "Text": " said? Those ruby red slippers could have taken you home any time. Think about it. I would"
    },
    {
      "Time_Start": 2320.04,
      "Time_End": 2328.64,
      "Text": " have smacked the bitch. Here she is. She gets them. She honestly gets them sent on"
    },
    {
      "Time_Start": 2328.64,
      "Time_End": 2333.64,
      "Text": " a suicide mission just to teach Dorothy a lesson. No, it's to get a good movie. You"
    },
    {
      "Time_Start": 2333.64,
      "Time_End": 2336.74,
      "Text": " know, let's face it. If she got to the other end of Oz and it was like, you know, here's"
    },
    {
      "Time_Start": 2336.74,
      "Time_End": 2340.34,
      "Text": " the ruby red slippers, go home. Five minutes of black and white, 37 seconds of color, two"
    },
    {
      "Time_Start": 2340.34,
      "Time_End": 2343.74,
      "Text": " minutes of black and white, the movie's over. It would have been like Bambi versus Godzilla,"
    },
    {
      "Time_Start": 2343.74,
      "Time_End": 2349.94,
      "Text": " if anybody's ever seen that. But anyway, you know, think about this. What's the real moral"
    },
    {
      "Time_Start": 2349.94,
      "Time_End": 2353.34,
      "Text": " of The Wizard of Oz? The real moral of The Wizard of Oz is that you have what you need."
    },
    {
      "Time_Start": 2353.34,
      "Time_End": 2356.84,
      "Text": " And it's the same thing in the security profession. You have things like bug track out there."
    },
    {
      "Time_Start": 2356.84,
      "Time_End": 2360.7400000000002,
      "Text": " You have a lot of resources. The vendors usually have fixes for all the problems. You have"
    },
    {
      "Time_Start": 2360.7400000000002,
      "Time_End": 2365.14,
      "Text": " internal scanning tools. You have SAINT. You have COPS, Tiger, Tripwire. Some of the commercial"
    },
    {
      "Time_Start": 2365.14,
      "Time_End": 2370.04,
      "Text": " things are also good and things like that. But, you know, also just remember one thing."
    },
    {
      "Time_Start": 2370.04,
      "Time_End": 2376.84,
      "Text": " Who were the only two people killed in The Wizard of Oz? The two bad witches. First witch"
    },
    {
      "Time_Start": 2376.94,
      "Time_End": 2383.2400000000002,
      "Text": " was killed how? Wicked Witch of the East. Tornado, a natural disaster. How was the Wicked"
    },
    {
      "Time_Start": 2383.2400000000002,
      "Time_End": 2390.44,
      "Text": " Witch of the West killed? Accidental water damage. And those are the real problems. So"
    },
    {
      "Time_Start": 2390.44,
      "Time_End": 2393.7400000000002,
      "Text": " before you start trying to protect yourself from hackers, make sure you take care of the"
    },
    {
      "Time_Start": 2393.7400000000002,
      "Time_End": 2397.6400000000003,
      "Text": " real two problems that are in the, you know, real disaster recovery things. And anyway,"
    },
    {
      "Time_Start": 2397.6400000000003,
      "Time_End": 2401.94,
      "Text": " if you have, I don't know if I'm out of time or whatever, but, I'm out of time. Okay, he"
    },
    {
      "Time_Start": 2401.94,
      "Time_End": 2404.44,
      "Text": " says I'm out of time. So anyway, thanks."
    }
  ]
}