{"segments": [{"Time_Start": 0.0, "Time_End": 13.0, "Text": " Freedom of speech."}, {"Time_Start": 13.0, "Time_End": 16.0, "Text": " Freedom of speech."}, {"Time_Start": 16.0, "Time_End": 21.0, "Text": " As Americans, freedom of speech is one of our most coveted and cherished rights."}, {"Time_Start": 21.0, "Time_End": 24.0, "Text": " However, certain things are better left unsaid."}, {"Time_Start": 24.0, "Time_End": 27.0, "Text": " This is bad."}, {"Time_Start": 27.0, "Time_End": 29.0, "Text": " Certain things are better left unsaid."}, {"Time_Start": 29.0, "Time_End": 33.0, "Text": " said. This project is definitely one of those."}, {"Time_Start": 33.0, "Time_End": 37.0, "Text": " My name is Keith."}, {"Time_Start": 37.0, "Time_End": 41.0, "Text": " And standing to my immediate left, this is Argus."}, {"Time_Start": 41.0, "Time_End": 45.0, "Text": " And again, next to him, that is DJ over there."}, {"Time_Start": 45.0, "Time_End": 48.0, "Text": " Collectively, we are known as Chung's Donut Shop."}, {"Time_Start": 48.0, "Time_End": 51.0, "Text": " And today we're presenting on the Luna Correspondence Protocol."}, {"Time_Start": 51.0, "Time_End": 53.0, "Text": " Okay."}, {"Time_Start": 53.0, "Time_End": 55.0, "Text": " We're going to ask at this point that you reserve all questions"}, {"Time_Start": 55.0, "Time_End": 58.0, "Text": " to the end of the presentation. Time permitting, we will have a Q&A session."}, {"Time_Start": 58.0, "Time_End": 59.0, "Text": " If we do our question, if we do our question,"}, {"Time_Start": 59.0, "Time_End": 64.0, "Text": " out of time, then you're more than welcome to approach us at any time during the con with any questions you may have."}, {"Time_Start": 64.0, "Time_End": 66.0, "Text": " We're going to ask that you pay."}, {"Time_Start": 66.0, "Time_End": 68.0, "Text": " Okay, I'm sorry these mics suck."}, {"Time_Start": 68.0, "Time_End": 69.0, "Text": " Okay."}, {"Time_Start": 69.0, "Time_End": 73.0, "Text": " We're going to ask that you pay particular attention to the methodologies behind the actual software"}, {"Time_Start": 73.0, "Time_End": 77.0, "Text": " as they're not only applicable to our own implementation, but any one of your own."}, {"Time_Start": 77.0, "Time_End": 79.0, "Text": " This is a flexible security scheme."}, {"Time_Start": 79.0, "Time_End": 81.0, "Text": " It's not any particular tool."}, {"Time_Start": 81.0, "Time_End": 84.0, "Text": " It's not, it doesn't require client's server software."}, {"Time_Start": 84.0, "Time_End": 88.0, "Text": " It's basically a collection of methodologies used to achieve anonymity and security over public."}, {"Time_Start": 88.0, "Time_End": 90.0, "Text": " anybody in security over a public network."}, {"Time_Start": 90.0, "Time_End": 93.0, "Text": " Can everybody here?"}, {"Time_Start": 93.0, "Time_End": 96.0, "Text": " I'm getting a lot of blank stairs."}, {"Time_Start": 96.0, "Time_End": 98.0, "Text": " Like, okay."}, {"Time_Start": 98.0, "Time_End": 100.0, "Text": " All right, most of you are probably wondering why we're in fact here today."}, {"Time_Start": 100.0, "Time_End": 103.0, "Text": " Well, the security of our world, as we know it, is at stake."}, {"Time_Start": 103.0, "Time_End": 105.0, "Text": " The Luna Correspondence protocol will help to..."}, {"Time_Start": 105.0, "Time_End": 108.0, "Text": " Hello?"}, {"Time_Start": 108.0, "Time_End": 112.0, "Text": " Can we just use that one and pass it?"}, {"Time_Start": 112.0, "Time_End": 115.0, "Text": " I think that's the best way to do it."}, {"Time_Start": 115.0, "Time_End": 117.0, "Text": " I think that's the best way to do it."}, {"Time_Start": 117.0, "Time_End": 119.0, "Text": " Technical difficulties."}, {"Time_Start": 119.0, "Time_End": 122.0, "Text": " I don't know why that it just worked."}, {"Time_Start": 122.0, "Time_End": 123.0, "Text": " It just worked."}, {"Time_Start": 123.0, "Time_End": 125.0, "Text": " Maybe it needs..."}, {"Time_Start": 125.0, "Time_End": 131.0, "Text": " It doesn't interfere with 2.4, right?"}, {"Time_Start": 131.0, "Time_End": 132.0, "Text": " No."}, {"Time_Start": 132.0, "Time_End": 133.0, "Text": " Making sure."}, {"Time_Start": 133.0, "Time_End": 137.0, "Text": " They have blue teeth going."}, {"Time_Start": 137.0, "Time_End": 142.0, "Text": " Okay."}, {"Time_Start": 142.0, "Time_End": 144.0, "Text": " The security of our world as we know it is at stake."}, {"Time_Start": 144.0, "Time_End": 147.0, "Text": " Luna Correspondence will help to safeguard your constitutional"}, {"Time_Start": 147.0, "Time_End": 151.0, "Text": " right to freedom of speech under the mounting pressure of an ever-increasing governmental bureaucracy,"}, {"Time_Start": 151.0, "Time_End": 155.0, "Text": " poising itself to become the big brother of tomorrow."}, {"Time_Start": 155.0, "Time_End": 159.0, "Text": " However, our project..."}, {"Time_Start": 159.0, "Time_End": 164.0, "Text": " The nature of our project may lend itself to possible abuse by malicious users,"}, {"Time_Start": 164.0, "Time_End": 167.0, "Text": " industrial saboteurs, and perhaps even terrorists."}, {"Time_Start": 167.0, "Time_End": 171.0, "Text": " That stated, we are still confident that the pros of our project"}, {"Time_Start": 171.0, "Time_End": 174.0, "Text": " far outweigh the cons in providing three key features."}, {"Time_Start": 174.0, "Time_End": 176.0, "Text": " Those features are secure communication."}, {"Time_Start": 176.0, "Time_End": 182.0, "Text": " communication and anonymous communication."}, {"Time_Start": 182.0, "Time_End": 187.0, "Text": " Abstractly, the Luna Correspondence Protocol is a revolutionary new protocol used to anonymously transmit"}, {"Time_Start": 187.0, "Time_End": 190.0, "Text": " and receive data securely across the Internet."}, {"Time_Start": 190.0, "Time_End": 194.0, "Text": " The Luna Correspondence Protocol is based on the finite improbabilities of vast random data dispersal"}, {"Time_Start": 194.0, "Time_End": 199.0, "Text": " and exploits properties in IP to accomplish a portion of its goals."}, {"Time_Start": 199.0, "Time_End": 202.0, "Text": " Essentially, that means we're using the Internet as is."}, {"Time_Start": 202.0, "Time_End": 205.98, "Text": " No special client server software is required for full implementation of the Luna"}, {"Time_Start": 206.0, "Time_End": 208.0, "Text": " correspondence protocol."}, {"Time_Start": 208.0, "Time_End": 211.0, "Text": " Finally, when coupled with the latest encryption technologies"}, {"Time_Start": 211.0, "Time_End": 215.0, "Text": " and our in-house Chung's Donut Shop developed advanced permutation engine,"}, {"Time_Start": 215.0, "Time_End": 219.0, "Text": " the Luna Correspondence Protocol, achieves a level of security unsurpassed by any other protocol"}, {"Time_Start": 219.0, "Time_End": 221.0, "Text": " or privacy scheme."}, {"Time_Start": 221.0, "Time_End": 225.0, "Text": " Okay, first off, I'm going to apologize for any technical difficulties with sound."}, {"Time_Start": 225.0, "Time_End": 228.0, "Text": " If you can't hear me, just yell, I'll talk louder, hold the mic closer."}, {"Time_Start": 228.0, "Time_End": 230.0, "Text": " Okay, first thing we're discussed is a tool called Loki."}, {"Time_Start": 230.0, "Time_End": 233.0, "Text": " Okay, during the initial stages of Luna's development,"}, {"Time_Start": 233.0, "Time_End": 235.0, "Text": " we're often asked if it was just a revamp with a Loki tool."}, {"Time_Start": 235.0, "Time_End": 236.0, "Text": " For those things we're just a little bit of the local tool."}, {"Time_Start": 236.0, "Time_End": 238.0, "Text": " you that don't know what Loki is."}, {"Time_Start": 238.0, "Time_End": 243.0, "Text": " Loki is a tool which claims to use ICMP to create a stealth channel to communicate through firewalls."}, {"Time_Start": 243.0, "Time_End": 247.0, "Text": " That's really the only similarity between our implementation and Loki."}, {"Time_Start": 247.0, "Time_End": 249.0, "Text": " We chose to use ICMP traffic."}, {"Time_Start": 249.0, "Time_End": 252.0, "Text": " The reason for this is a lot of the same reasons they chose to use it for Loki."}, {"Time_Start": 252.0, "Time_End": 256.0, "Text": " It easily passes through a lot of consumer firewalls."}, {"Time_Start": 256.0, "Time_End": 258.0, "Text": " Not all, but many."}, {"Time_Start": 258.0, "Time_End": 262.0, "Text": " Secondly, it's a connectionless protocol, which aids in our anonymity."}, {"Time_Start": 262.0, "Time_End": 265.0, "Text": " And third, and most importantly, it's blindly relayed by,"}, {"Time_Start": 265.0, "Time_End": 269.0, "Text": " by the vast majority of public hosts on the internet, and that's just the way the ICMP works."}, {"Time_Start": 269.0, "Time_End": 275.0, "Text": " So start off, we show you a typical ping transmission, or ICMP transmission."}, {"Time_Start": 275.0, "Time_End": 281.0, "Text": " Basically, you have your packet, the data of this packet contains, say, a system time, ticks, whatever."}, {"Time_Start": 281.0, "Time_End": 289.0, "Text": " You're going to use this data in a calculation to determine the round trip it took for your data to get from one point of the internet to another."}, {"Time_Start": 289.0, "Time_End": 292.0, "Text": " So we send it out into our network, it goes off into the internet,"}, {"Time_Start": 292.0, "Time_End": 294.0, "Text": " and it goes to our first arbitrary host."}, {"Time_Start": 294.0, "Time_End": 295.0, "Text": " We'll call it host."}, {"Time_Start": 295.0, "Time_End": 303.0, "Text": " Okay, now the only thing that HostA can do to validate where this packet came from is it trusts the source address in the header."}, {"Time_Start": 303.0, "Time_End": 306.0, "Text": " It's connectionless protocol. Therefore, there's no validation performed."}, {"Time_Start": 306.0, "Time_End": 308.0, "Text": " So all it does is it looks at the source address."}, {"Time_Start": 308.0, "Time_End": 314.0, "Text": " It says, okay, this came from here, and it sends it right back to, in this case, transmitters network."}, {"Time_Start": 314.0, "Time_End": 315.0, "Text": " Okay."}, {"Time_Start": 315.0, "Time_End": 321.0, "Text": " To accomplish the anonymity portion of our implementation, we're actually going to deceive the Internet."}, {"Time_Start": 321.0, "Time_End": 324.0, "Text": " And the way we're doing this is we're making use of that flaw in ICMPB."}, {"Time_Start": 324.0, "Time_End": 331.0, "Text": " that flaw in ICMP, the lack of a validation scheme. Instead of putting our source address for it to reply to,"}, {"Time_Start": 331.0, "Time_End": 341.0, "Text": " we're going to put the target host address. Okay? So we'll show you here. Our data is at our transmitting host. It's all ready to go. It's prepared. It's been ordered."}, {"Time_Start": 341.0, "Time_End": 346.0, "Text": " We're going to get a lot more into what we're doing to prepare this data later on, but I need to understand now that's ready to go."}, {"Time_Start": 346.0, "Time_End": 350.0, "Text": " First thing we do is we send off into our own network, and you know it's one packet staying behind."}, {"Time_Start": 350.0, "Time_End": 353.98, "Text": " The reason for this is to show a delay, which we're going to get into later, just take the"}, {"Time_Start": 354.0, "Time_End": 358.56, "Text": " know of it now. So it's going from our network, you know, firewalls and egress filtering"}, {"Time_Start": 358.56, "Time_End": 363.28, "Text": " permitting, out into the Internet, where it's routed to two separate hosts. We're choosing"}, {"Time_Start": 363.28, "Time_End": 368.36, "Text": " to use unique hosts, spread this data all over the Internet to aid and avoiding the creation"}, {"Time_Start": 368.36, "Time_End": 372.24, "Text": " of a pattern. That's what we're really what we're trying to do here. Now, as far as they're concerned,"}, {"Time_Start": 373.16, "Time_End": 377.36, "Text": " these packets came from the receiver network because that's all they have to go by is that source"}, {"Time_Start": 377.36, "Time_End": 383.38, "Text": " header. So what it does, it says, you know, good enough, it sends this data intact right back to"}, {"Time_Start": 383.38, "Time_End": 386.32, "Text": " the receiver's network. Now, you notice it's not going to the receiver's computer itself."}, {"Time_Start": 387.0, "Time_End": 392.56, "Text": " This is because, number one, a lot of masqueraded routing systems will not allow it to go to a host"}, {"Time_Start": 392.56, "Time_End": 398.2, "Text": " that didn't put the requesting queue. Secondly, if you got a lot of ICMP traffic going to one host"}, {"Time_Start": 398.2, "Time_End": 402.48, "Text": " on your local network segment, you're going to know something's up. It's going to set off a flag."}, {"Time_Start": 402.54, "Time_End": 405.32, "Text": " It's going to create a pattern that's going to be traced and notice. We want to avoid that at all"}, {"Time_Start": 405.32, "Time_End": 410.52, "Text": " cost. So what we're doing is our receiving host is actually promiscuously sniffing all ICMP traffic on the network"}, {"Time_Start": 410.52, "Time_End": 413.36, "Text": " during this particular session. It's going to be used. It's going to be used."}, {"Time_Start": 413.38, "Time_End": 416.98, "Text": " collected and parsed later, but right now it's just sniffing everything."}, {"Time_Start": 418.1, "Time_End": 421.28, "Text": " Okay, we've got our last packet coming into the network. It goes back in. It's"}, {"Time_Start": 421.28, "Time_End": 425.26, "Text": " reordered at the other laptop, and we basically sent our data across the internet."}, {"Time_Start": 425.98, "Time_End": 431.3, "Text": " To do this, we're realizing two layers of spoofing. Now, obviously, there's going to be"}, {"Time_Start": 431.3, "Time_End": 434.46, "Text": " situations where you can't spoof the MAC address, you can't spoof the IP address, wherever."}, {"Time_Start": 434.58, "Time_End": 439.26, "Text": " This is all applicable to any particular scenario. You can add or move any component of this"}, {"Time_Start": 439.26, "Time_End": 443.36, "Text": " scheme as needed per your situation. Okay? You can't say you can just break."}, {"Time_Start": 443.38, "Time_End": 446.8, "Text": " it by filtering out MAC addresses because you could simply remove that component, use"}, {"Time_Start": 446.8, "Time_End": 451.12, "Text": " everything else, and remain relatively anonymous. So what we're doing is we're actually"}, {"Time_Start": 451.12, "Time_End": 454.24, "Text": " changing the hardware address to the card. Again, if somebody's looking at our local network,"}, {"Time_Start": 454.7, "Time_End": 458.71999999999997, "Text": " and they see all this traffic going to all these different hosts on the internet, and they're coming"}, {"Time_Start": 458.71999999999997, "Time_End": 462.9, "Text": " from different addresses, everything else not on our network, but it's coming from the same"}, {"Time_Start": 462.9, "Time_End": 467.15999999999997, "Text": " Mac address. You're able to pinpoint what card or what boxes came from. It's also going to create"}, {"Time_Start": 467.15999999999997, "Time_End": 471.3, "Text": " a pattern. You've now flagged all these packets with your Mac address, and now you know which"}, {"Time_Start": 471.3, "Time_End": 472.5, "Text": " packets are part of this scheme."}, {"Time_Start": 473.38, "Time_End": 477.1, "Text": " Second, we already touched on it is the IP address spoofing. This, again, facilitates"}, {"Time_Start": 477.1, "Time_End": 482.84, "Text": " a relay and makes it, makes us able to basically remain anonymous on the transmitting end."}, {"Time_Start": 484.92, "Time_End": 488.3, "Text": " Now we're going to get into inefficiency. Now, why wouldn't we want to be efficient? Why wouldn't"}, {"Time_Start": 488.3, "Time_End": 492.64, "Text": " you want to transmit your data across the Internet and the quickest, most efficient method"}, {"Time_Start": 492.64, "Time_End": 497.74, "Text": " possible? Well, we've added this relay, and that's already out of level of inefficiency, everything."}, {"Time_Start": 497.86, "Time_End": 503.36, "Text": " It's not a quick protocol at all. It can be, but in the most implicit,"}, {"Time_Start": 503.38, "Time_End": 507.5, "Text": " implementation, it's not. Secondly, when you send data from point A to point B, let's say,"}, {"Time_Start": 508.02, "Time_End": 513.1, "Text": " I am in Southern California, and our goon back here is in New York, and we want to communicate"}, {"Time_Start": 513.1, "Time_End": 517.78, "Text": " back and forth. Yeah, he's not looking at me, okay. And we want to communicate back and forth."}, {"Time_Start": 518.7, "Time_End": 523.38, "Text": " Somebody who thinks that we might be talking to each other could easily pick a note along this"}, {"Time_Start": 523.38, "Time_End": 526.86, "Text": " path, predict where our data is going to go through. We're giving these people a lot of credit. We're"}, {"Time_Start": 526.86, "Time_End": 530.84, "Text": " not assuming it's just your average jackass trying to sniff our traffic. So what we're going to do is,"}, {"Time_Start": 530.84, "Time_End": 533.02, "Text": " again, with that relay, we're avoiding the creations of patterns."}, {"Time_Start": 533.38, "Time_End": 537.88, "Text": " And we're making a lot more inefficient for this to go across, and a lot less reliable as well."}, {"Time_Start": 538.28, "Time_End": 540.26, "Text": " But again, we're going to get to reliability later."}, {"Time_Start": 542.22, "Time_End": 546.38, "Text": " What we've been to prepare our data before we send it out is we've done several things."}, {"Time_Start": 546.46, "Time_End": 551.92, "Text": " Now, again, you could probably encrypt your data send out through the relay 90% of the time you're now anonymous and relatively secure."}, {"Time_Start": 552.46, "Time_End": 554.5, "Text": " But we're going to give these people a lot of credit."}, {"Time_Start": 554.6, "Time_End": 559.54, "Text": " We're going to say our snooping party is a paranoid military, a government, a country, whatever,"}, {"Time_Start": 560.5, "Time_End": 563.36, "Text": " that has unlimited resources in deciphering."}, {"Time_Start": 563.38, "Time_End": 566.34, "Text": " collecting our data. We're going to give them a lot of credit because we want true anonymity."}, {"Time_Start": 566.46, "Time_End": 571.38, "Text": " We don't want an anonymity to the point of the knowledge of the person snooping our traffic."}, {"Time_Start": 571.9, "Time_End": 573.98, "Text": " So what we're going to do first thing is we're going to reorder the data."}, {"Time_Start": 574.46, "Time_End": 577.32, "Text": " We're going to take our packets in our sequence, shuffle up, put it out of order."}, {"Time_Start": 578.2, "Time_End": 580.36, "Text": " The reason for this is we're trying to avoid the creation of patterns."}, {"Time_Start": 581.62, "Time_End": 586.48, "Text": " If you send data across the network in order, and it gets, even if you send over the period of a year"}, {"Time_Start": 586.48, "Time_End": 591.62, "Text": " and a half with this delay, if somebody can guess when you started and when it ended, they're going to be"}, {"Time_Start": 591.62, "Time_End": 592.88, "Text": " able to at least assemble these in sequence. It's going to aid."}, {"Time_Start": 592.88, "Time_End": 596.42, "Text": " it's going to aid in the deciphering and reordering these packets, so we want to avoid that."}, {"Time_Start": 597.18, "Time_End": 599.32, "Text": " Second thing we're doing is we're going to inject false positives."}, {"Time_Start": 599.56, "Time_End": 603.4399999999999, "Text": " Even with reordering and delay and everything else, in a scenario where all data is valid,"}, {"Time_Start": 604.24, "Time_End": 608.08, "Text": " laws of probability state it will eventually be reordered and deciphered."}, {"Time_Start": 608.16, "Time_End": 612.48, "Text": " So we're going to inject false positives into the thing, and the engine that we're going to use to do this"}, {"Time_Start": 612.48, "Time_End": 613.22, "Text": " we're going to assess later."}, {"Time_Start": 614.28, "Time_End": 617.8, "Text": " And third, that data delay that we already discussed before."}, {"Time_Start": 618.3, "Time_End": 621.2, "Text": " Now, in our implementation, we chose to have two values."}, {"Time_Start": 622.0, "Time_End": 622.86, "Text": " A minimum and maximum."}, {"Time_Start": 622.88, "Time_End": 626.88, "Text": " So that could be anywhere from like one millisecond to five years."}, {"Time_Start": 626.88, "Time_End": 628.88, "Text": " So the first packet obviously goes off instantly."}, {"Time_Start": 628.88, "Time_End": 632.88, "Text": " The next packet may come 30 seconds, the next one may go a year, the next one may go in a week."}, {"Time_Start": 632.88, "Time_End": 637.88, "Text": " Obviously this isn't feasible for most communications, but it's just an example of how it works."}, {"Time_Start": 637.88, "Time_End": 642.88, "Text": " It's going to send anywhere in between these times, not at a random set interval, but a truly random value."}, {"Time_Start": 642.88, "Time_End": 645.88, "Text": " Again, all this is doing is avoiding the creation of the patterns."}, {"Time_Start": 645.88, "Time_End": 648.88, "Text": " On top of this, we're applying cryptography."}, {"Time_Start": 648.88, "Time_End": 652.86, "Text": " Now, again, with unlimited resources and a company or"}, {"Time_Start": 652.88, "Time_End": 656.88, "Text": " government that has a time and sufficient power to do this,"}, {"Time_Start": 656.88, "Time_End": 659.88, "Text": " cryptography eventually will be cracked."}, {"Time_Start": 659.88, "Time_End": 660.88, "Text": " Doesn't mean it's going to happen anytime soon."}, {"Time_Start": 660.88, "Time_End": 663.88, "Text": " It doesn't mean it's going to happen in a year, but eventually it's going to be cracked."}, {"Time_Start": 663.88, "Time_End": 665.88, "Text": " We want true security and anonymity."}, {"Time_Start": 665.88, "Time_End": 670.88, "Text": " So what we're doing is we're saying crypto isn't valid as a primary means of"}, {"Time_Start": 670.88, "Time_End": 674.88, "Text": " securing communication, as a sole means of securing communication."}, {"Time_Start": 674.88, "Time_End": 678.88, "Text": " However, it's far from trivial because when applied over the whole scheme,"}, {"Time_Start": 678.88, "Time_End": 681.88, "Text": " it severely complicates the efforts to reorder and decipher the data."}, {"Time_Start": 681.88, "Time_End": 684.88, "Text": " you have encrypted garbage coming across the network."}, {"Time_Start": 684.88, "Time_End": 690.88, "Text": " It's going to be real difficult for you to figure out how it's coming across and how it's being deciphered."}, {"Time_Start": 690.88, "Time_End": 693.88, "Text": " And all of this, we use in our implementation, a variety of ways we'll get into that later."}, {"Time_Start": 693.88, "Time_End": 699.88, "Text": " But all these methods applied, adding or subtracting any of them, could be applied to any security scheme."}, {"Time_Start": 699.88, "Time_End": 700.88, "Text": " This is how you're going to remain anonymous."}, {"Time_Start": 700.88, "Time_End": 705.88, "Text": " You're going to avoid these creation of patterns, regardless of how you're implementing it."}, {"Time_Start": 705.88, "Time_End": 710.88, "Text": " Okay, and we're moving on to security with Keith here."}, {"Time_Start": 710.88, "Time_End": 711.88, "Text": " Yes."}, {"Time_Start": 711.88, "Time_End": 718.88, "Text": " Okay. As Argus just so eloquently stated, we're basically trying to avoid the creation of patterns"}, {"Time_Start": 718.88, "Time_End": 722.88, "Text": " and complicate all efforts to reorder and collect our data."}, {"Time_Start": 722.88, "Time_End": 727.88, "Text": " Now we're going to do this by using a mathematical permutation function P,"}, {"Time_Start": 727.88, "Time_End": 733.88, "Text": " accepting two arguments and the total number of packets and are the set of packets composing real data."}, {"Time_Start": 733.88, "Time_End": 736.88, "Text": " That is eliminating bogus packets."}, {"Time_Start": 736.88, "Time_End": 741.88, "Text": " As was discussed earlier, we're also injecting bogus packets across the network to figure"}, {"Time_Start": 741.88, "Time_End": 745.04, "Text": " the number of bogus packets, one would just take R and subtract it from N."}, {"Time_Start": 746.4, "Time_End": 749.64, "Text": " Now, I'm not going to get into the nitty-gritty mathematical details behind this function,"}, {"Time_Start": 749.64, "Time_End": 751.92, "Text": " as that's far beyond the scope of this lecture here."}, {"Time_Start": 752.46, "Time_End": 754.86, "Text": " But what I will explain is the result of this function."}, {"Time_Start": 755.18, "Time_End": 760.86, "Text": " See, the result of function P is, or the number as a result of inputting two variables,"}, {"Time_Start": 760.98, "Time_End": 769.82, "Text": " N and R, is the total number of permutations required scenario to reorder our data effectively."}, {"Time_Start": 770.4, "Time_End": 771.86, "Text": " So let's go ahead and plug some..."}, {"Time_Start": 771.88, "Time_End": 773.72, "Text": " plug and chug some numbers through this function."}, {"Time_Start": 774.48, "Time_End": 775.88, "Text": " We'll start with 60 and 10."}, {"Time_Start": 777.26, "Time_End": 781.58, "Text": " 60 packets total and 10 packet composing real data."}, {"Time_Start": 781.76, "Time_End": 785.24, "Text": " That leaves us with 50 bogus packets being injected across the network."}, {"Time_Start": 785.76, "Time_End": 790.56, "Text": " We end up with a number 2.73589-8472 times 10 race to the 17th power."}, {"Time_Start": 791.02, "Time_End": 794.62, "Text": " That's an extremely large number for just a relatively small set of packets."}, {"Time_Start": 795.0, "Time_End": 797.02, "Text": " Again, we injected 60 packets over the network."}, {"Time_Start": 797.32, "Time_End": 801.86, "Text": " That's a total number of permutations required given the worst-case scenario to correctly order our"}, {"Time_Start": 801.88, "Time_End": 804.78, "Text": " data. This function, as you can see here, is exponentially growing."}, {"Time_Start": 805.7, "Time_End": 809.24, "Text": " We'll go ahead and up the ante just a little bit, and we'll inject 100 packets total across the network."}, {"Time_Start": 809.84, "Time_End": 813.32, "Text": " 80 packets consisting of real data. That leaves us with 20 bogus packets."}, {"Time_Start": 813.9, "Time_End": 817.96, "Text": " Well, my trustee, T. I.83, can't even comprehend the total number of possible permutations for that sort of"}, {"Time_Start": 817.96, "Time_End": 824.08, "Text": " data. A hundred packets, just to put this in perspective, 100 packets could be easily sent"}, {"Time_Start": 824.08, "Time_End": 828.44, "Text": " in maybe a paragraph, maybe four or five sentences. Again, very easy to do."}, {"Time_Start": 830.32, "Time_End": 831.68, "Text": " For simplistic form here, we've just to do."}, {"Time_Start": 831.88, "Time_End": 836.76, "Text": " gone ahead for the visual owners and represented this. And basically what we've done here,"}, {"Time_Start": 836.76, "Time_End": 842.12, "Text": " just to show how insanely difficult this is to do, we're going to assume a relatively bare network"}, {"Time_Start": 842.12, "Time_End": 846.92, "Text": " that is a pristine network, basically blank and devoid of any traffic. We're going to go ahead"}, {"Time_Start": 846.92, "Time_End": 851.4, "Text": " and inject packets across the network, eliminating all the bogus packets. We're just going"}, {"Time_Start": 851.4, "Time_End": 856.2, "Text": " to send the real data here. We'll send one packet, one character, the letter L. That leaves us"}, {"Time_Start": 856.2, "Time_End": 860.92, "Text": " one possible permutation, again, just the letter L. Two packets, two characters, the letters,"}, {"Time_Start": 860.9200000000001, "Time_End": 866.7400000000001, "Text": " or the letters L and U, that leads us with two permutations, LU, or U and L."}, {"Time_Start": 867.7, "Time_End": 874.2600000000001, "Text": " Three packets, three characters, LU and N, six total permutations possible between those three"}, {"Time_Start": 874.2600000000001, "Time_End": 879.08, "Text": " characters. Four packets, four characters, four letters, L, U, N, and A, and now you're looking"}, {"Time_Start": 879.08, "Time_End": 882.44, "Text": " at 24 different permutations. Again, it's exponentially increasing."}, {"Time_Start": 884.6, "Time_End": 890.84, "Text": " Okay, so if prying eyes are unable to correctly order our data here, you're probably wondering how"}, {"Time_Start": 890.9200000000001, "Time_End": 896.5600000000001, "Text": " receiver is able to do this. Well, the receiver and the transmitter both have random"}, {"Time_Start": 896.5600000000001, "Time_End": 901.5200000000001, "Text": " number generators, seated by the same value, basically meaning that they're able to generate"}, {"Time_Start": 901.5200000000001, "Time_End": 907.1200000000001, "Text": " the same random numbers in succession one after another on either side. Now, how the"}, {"Time_Start": 907.1200000000001, "Time_End": 911.1400000000001, "Text": " seat is transmitted between the two is solely up to the communicating parties. A very"}, {"Time_Start": 911.1400000000001, "Time_End": 916.58, "Text": " elaborate schemes, such as perhaps writing that seed down on an index card, passing it physically"}, {"Time_Start": 916.58, "Time_End": 920.9000000000001, "Text": " where the other party then memorizes it, burns it, ingest it. It's all up to you. Or"}, {"Time_Start": 920.9200000000001, "Time_End": 926.84, "Text": " even more overt methods such as, you know, PGP, like, private, public key passing, or even,"}, {"Time_Start": 927.6400000000001, "Time_End": 932.82, "Text": " you know, like any other handshaking. But those are all susceptible to, like, man in the middle style"}, {"Time_Start": 932.82, "Time_End": 937.0600000000001, "Text": " attacks. And what we're going to do is we'll line all of our data here up at the receiving order."}, {"Time_Start": 937.2600000000001, "Time_End": 942.2400000000001, "Text": " We've got our start sequence, our stop sequence, and then three packets CD and S. We're going to push"}, {"Time_Start": 942.2400000000001, "Time_End": 949.2800000000001, "Text": " them across the network. We've got CDS and two bogus packets along with the start and stop sequence."}, {"Time_Start": 949.28, "Time_End": 954.36, "Text": " We're doing this at random intervals, random times, and completely out of order across the network."}, {"Time_Start": 954.66, "Time_End": 960.04, "Text": " What the receiver is going to do now is sit back, receive all the data as it comes in, and wait for two packets."}, {"Time_Start": 960.8399999999999, "Time_End": 963.78, "Text": " The receiver is going to look for the start sequence and the stop sequence."}, {"Time_Start": 963.9, "Time_End": 970.3, "Text": " Once the start and stop sequence have been received, it's then possible for the receiver to take all the data in between those,"}, {"Time_Start": 970.6, "Time_End": 975.1999999999999, "Text": " figure out where it needs to go, and start applying it where necessary to fill in the entire datum as a whole,"}, {"Time_Start": 975.6, "Time_End": 978.92, "Text": " and then flush it out to a disk, write it to a file, email it."}, {"Time_Start": 979.28, "Time_End": 980.52, "Text": " It's really up to the user implementation."}, {"Time_Start": 980.9399999999999, "Time_End": 986.06, "Text": " But again, three, the seed is used basically for three primary purposes,"}, {"Time_Start": 986.18, "Time_End": 989.72, "Text": " that is to generate the start sequence, to generate the stop sequence,"}, {"Time_Start": 989.72, "Time_End": 994.3399999999999, "Text": " and then to apply that random number as a sequence number for any of these packets"}, {"Time_Start": 994.3399999999999, "Time_End": 995.5799999999999, "Text": " that are traversing the network here."}, {"Time_Start": 997.4399999999999, "Time_End": 1001.4, "Text": " Okay, so moving on, data filters are basically filter plugins that can range from anything,"}, {"Time_Start": 1002.02, "Time_End": 1007.22, "Text": " encryption ciphers, to any sort of data encoding such as, you know, Base 64, mime encoding,"}, {"Time_Start": 1007.6, "Time_End": 1009.26, "Text": " or perhaps just a relatively simple."}, {"Time_Start": 1009.28, "Time_End": 1013.4599999999999, "Text": " simple ASCY translation. Data filters are not necessary. We've gone ahead and implemented"}, {"Time_Start": 1013.4599999999999, "Time_End": 1018.28, "Text": " them in our version of the protocol, just as a matter of upping the ante here, upping the security."}, {"Time_Start": 1019.06, "Time_End": 1022.9399999999999, "Text": " Data filters are actually applied over the entire datum before it's chunked into packets."}, {"Time_Start": 1023.1999999999999, "Time_End": 1026.32, "Text": " So if you've got three packets CDNS, what we're going to do is package them together,"}, {"Time_Start": 1027.02, "Time_End": 1031.92, "Text": " and then we're going to filter them wholly. Now, the only exception to this is the start and stop"}, {"Time_Start": 1031.92, "Time_End": 1036.12, "Text": " sequence. For simplicity purposes, so that the receiver is more able to recognize these packets"}, {"Time_Start": 1036.12, "Time_End": 1039.26, "Text": " as they come in, we're going to go ahead and filter the start and stop sequence."}, {"Time_Start": 1039.28, "Time_End": 1044.1, "Text": " separately. They're actually filtered on their own merit. Again, that just makes it easier on our part"}, {"Time_Start": 1044.1, "Time_End": 1050.6399999999999, "Text": " to notice them as they are coming in on the receiving side. And finally, the LUNA"}, {"Time_Start": 1050.6399999999999, "Time_End": 1055.24, "Text": " Correspondence Protocol is multi-tiered security. That is to say, even if the LUNA Correspondence Protocol"}, {"Time_Start": 1055.24, "Time_End": 1061.86, "Text": " is cracked, flawed, or some way rendered useless, your data is still protected by the lowest grade of"}, {"Time_Start": 1061.86, "Time_End": 1067.36, "Text": " encryption used in your data filter cipher here. So let's say we wanted to use like RSA 496-bit"}, {"Time_Start": 1067.36, "Time_End": 1068.66, "Text": " keys as our data filter."}, {"Time_Start": 1069.28, "Time_End": 1072.78, "Text": " you're going to send this data over the network using our protocol. We're guaranteeing you"}, {"Time_Start": 1072.78, "Time_End": 1078.46, "Text": " at least that security, folks. That means if our project is completely irrelevant here, your data"}, {"Time_Start": 1078.46, "Time_End": 1083.98, "Text": " is still encoded, you're still relatively secure. Data filters can be used to incorporate any"}, {"Time_Start": 1083.98, "Time_End": 1089.16, "Text": " kind of encryption filter. It could be RSA, blowfish, two fish, one fish, could help"}, {"Time_Start": 1089.16, "Time_End": 1096.36, "Text": " fish. It's really up to you. So summarize what we're doing here as far as the anonymity and"}, {"Time_Start": 1096.36, "Time_End": 1099.0, "Text": " efficiency is concerned. We're basically taking data."}, {"Time_Start": 1099.28, "Time_End": 1103.48, "Text": " We're trying to use the entire internet spread out as wide as possible to distribute this data"}, {"Time_Start": 1103.48, "Time_End": 1105.72, "Text": " and have it collected back at a particular source."}, {"Time_Start": 1106.26, "Time_End": 1109.32, "Text": " We're having to go to a pool as opposed to a specific source."}, {"Time_Start": 1109.84, "Time_End": 1113.04, "Text": " Again, because we want both parties sending and receiving to remain anonymous."}, {"Time_Start": 1113.8, "Time_End": 1116.0, "Text": " Again, you don't need special client server software."}, {"Time_Start": 1116.16, "Time_End": 1119.22, "Text": " Ours is actually a packet parsing and creation engine."}, {"Time_Start": 1120.62, "Time_End": 1123.1399999999999, "Text": " And again, you're using these methods."}, {"Time_Start": 1123.24, "Time_End": 1125.56, "Text": " A lot of other things uses why I might be familiar with,"}, {"Time_Start": 1125.56, "Time_End": 1128.48, "Text": " the spoofing, the reeling, and then the host level transmission,"}, {"Time_Start": 1128.48, "Time_End": 1133.5, "Text": " using the permutation engine and some of the other stuff we've incorporated as well as the filters."}, {"Time_Start": 1134.58, "Time_End": 1137.96, "Text": " Okay, and then finally we discussed achieving security via the Luna correspondence protocol."}, {"Time_Start": 1139.18, "Time_End": 1143.7, "Text": " The mathematical permutation function, packet level transmission, which actually happens over OSA,"}, {"Time_Start": 1144.18, "Time_End": 1148.2, "Text": " layer five, OSI layer five, I'm sorry, for those of you familiar with the OSI model."}, {"Time_Start": 1148.4, "Time_End": 1153.2, "Text": " And then we finished up with covering data filters, encryption filters, and encoding filters."}, {"Time_Start": 1158.48, "Time_End": 1162.6, "Text": " Okay, well, you guys are probably wondering,"}, {"Time_Start": 1162.8, "Time_End": 1167.14, "Text": " this sounds pretty complicated and stuff like that or whatever,"}, {"Time_Start": 1167.56, "Time_End": 1169.08, "Text": " or where's the proof?"}, {"Time_Start": 1169.2, "Time_End": 1171.52, "Text": " We have working software that proves this,"}, {"Time_Start": 1172.16, "Time_End": 1174.4, "Text": " and sometime shortly after the conference,"}, {"Time_Start": 1174.6, "Time_End": 1177.9, "Text": " we're going to post it on SourceForge once they get their act together,"}, {"Time_Start": 1178.54, "Time_End": 1182.66, "Text": " and you guys will be able to download it from there and see how it works."}, {"Time_Start": 1183.38, "Time_End": 1186.02, "Text": " Just another note, our software is completely open source."}, {"Time_Start": 1186.16, "Time_End": 1187.82, "Text": " It is released under the GNU public license."}, {"Time_Start": 1188.48, "Time_End": 1189.28, "Text": " installment is our hero."}, {"Time_Start": 1192.32, "Time_End": 1197.56, "Text": " Okay, so where are we actually going to use such a complicated scheme in our own communication?"}, {"Time_Start": 1198.08, "Time_End": 1202.3, "Text": " We'll start with a really extreme example and a purposely patriotic example."}, {"Time_Start": 1203.98, "Time_End": 1208.34, "Text": " Let's say we have a CIA or American operative in China, Afghanistan, or wherever,"}, {"Time_Start": 1209.44, "Time_End": 1212.74, "Text": " and he needs to get mission-critical sensitive data through a network,"}, {"Time_Start": 1213.44, "Time_End": 1218.3, "Text": " through a hostile, paranoid military network, back."}, {"Time_Start": 1218.48, "Time_End": 1220.16, "Text": " to either U.S. or some arbitrary host,"}, {"Time_Start": 1220.52, "Time_End": 1224.34, "Text": " where it can be used to prevent something from happening or, you know, complete a mission."}, {"Time_Start": 1225.6, "Time_End": 1230.66, "Text": " Well, obviously, he's going to incorporate the most extreme values"}, {"Time_Start": 1230.66, "Time_End": 1237.6200000000001, "Text": " and extreme implementations of these methods here to avoid all costs, like life and death situation,"}, {"Time_Start": 1237.72, "Time_End": 1239.94, "Text": " not just for himself, but possibly millions of other people."}, {"Time_Start": 1240.6, "Time_End": 1242.5, "Text": " Of course, he's going to encrypt this data."}, {"Time_Start": 1242.6, "Time_End": 1243.42, "Text": " He's going to reorder it."}, {"Time_Start": 1243.52, "Time_End": 1245.6200000000001, "Text": " He's going to permeate it with the false data,"}, {"Time_Start": 1245.92, "Time_End": 1248.46, "Text": " sent it across the network at any random delay."}, {"Time_Start": 1248.48, "Time_End": 1251.8, "Text": " that is going to be feasible to the particular scenario."}, {"Time_Start": 1251.94, "Time_End": 1255.14, "Text": " So obviously, if it has to get across in a week, something's going to happen a week from now,"}, {"Time_Start": 1255.34, "Time_End": 1260.68, "Text": " and he needs to warn us about it, he can't set the delay to happen over a period of years."}, {"Time_Start": 1261.08, "Time_End": 1266.3600000000001, "Text": " There's not many situations where you could, but that's going to be the most anonymous,"}, {"Time_Start": 1266.52, "Time_End": 1268.0, "Text": " most likely to go and notice."}, {"Time_Start": 1268.7, "Time_End": 1271.0, "Text": " So what we're going to do is, again, he's going to apply all the message here,"}, {"Time_Start": 1271.08, "Time_End": 1274.3600000000001, "Text": " put it on a delay that's pertinent to the time frame in which he needs to operate under."}, {"Time_Start": 1275.46, "Time_End": 1278.46, "Text": " Now, more dated example, something that some of you might want to use."}, {"Time_Start": 1278.48, "Time_End": 1285.48, "Text": " or average person, a scenario where you need, you have a problem with, say, an employer,"}, {"Time_Start": 1285.9, "Time_End": 1289.74, "Text": " something else you need to go over their head, you need to communicate anonymously to complain"}, {"Time_Start": 1289.74, "Time_End": 1291.3, "Text": " while they're monitoring your network."}, {"Time_Start": 1292.64, "Time_End": 1299.84, "Text": " There's a lot of other applications, like anonymous Dropbox, relays to specific servers"}, {"Time_Start": 1299.84, "Time_End": 1300.96, "Text": " of our collection data forms."}, {"Time_Start": 1301.34, "Time_End": 1304.66, "Text": " There's a lot of them that we're going to get into a little bit later on,"}, {"Time_Start": 1304.66, "Time_End": 1307.4, "Text": " and also on the data that's going to be posted on a storage forge site."}, {"Time_Start": 1308.48, "Time_End": 1314.5, "Text": " However, you can make this as secure or, you know, again, as overt and insecure as you need it to be."}, {"Time_Start": 1315.04, "Time_End": 1319.2, "Text": " You can add or remove any one of these components to complete your transmission."}, {"Time_Start": 1320.76, "Time_End": 1325.04, "Text": " Our software can implement everything, but you can do it, again, at your own pace."}, {"Time_Start": 1325.16, "Time_End": 1328.46, "Text": " There's not any way to sit down in a terminal and be anonymous if you don't know what you're doing."}, {"Time_Start": 1329.28, "Time_End": 1331.84, "Text": " You can't, you know, anonymous and stupid don't go together."}, {"Time_Start": 1331.94, "Time_End": 1333.52, "Text": " You have to understand how the network works."}, {"Time_Start": 1333.84, "Time_End": 1336.54, "Text": " There's no tool that makes up for a lack of knowledge of poor implementation."}, {"Time_Start": 1336.54, "Time_End": 1341.52, "Text": " So using our software intelligently or devising a plan of your own,"}, {"Time_Start": 1341.82, "Time_End": 1345.92, "Text": " intelligently implemented with the 30s brand in here, you will remain anonymous on the network."}, {"Time_Start": 1346.92, "Time_End": 1350.28, "Text": " And now for some more creative implementations that we've come up with."}, {"Time_Start": 1351.72, "Time_End": 1356.5, "Text": " All right, so basically, I'd just like to let you know we at Chung's Donut Shop,"}, {"Time_Start": 1356.6, "Time_End": 1359.22, "Text": " believe, and you're right to have privacy."}, {"Time_Start": 1359.72, "Time_End": 1364.86, "Text": " And I don't know about you, but I don't like when I'm trying to talk to my friend about something important"}, {"Time_Start": 1364.86, "Time_End": 1366.3, "Text": " and then some of these eavesdropping."}, {"Time_Start": 1366.54, "Time_End": 1368.48, "Text": " or something that you don't want somebody to know."}, {"Time_Start": 1369.12, "Time_End": 1370.46, "Text": " This applies to everybody."}, {"Time_Start": 1370.96, "Time_End": 1375.32, "Text": " So we believe that you should be able to stay anonymous and have freedom of speech."}, {"Time_Start": 1375.74, "Time_End": 1378.12, "Text": " So this protocol implements that and keeps it going."}, {"Time_Start": 1379.06, "Time_End": 1382.8799999999999, "Text": " Here's an example of how you could use our protocol."}, {"Time_Start": 1383.54, "Time_End": 1387.6599999999999, "Text": " Basically, let's say, for instance, you want to go to an area coffee shop,"}, {"Time_Start": 1387.78, "Time_End": 1392.56, "Text": " one that may provide wireless internet, either paid or free,"}, {"Time_Start": 1393.1599999999999, "Time_End": 1396.42, "Text": " you would be able to implement our software on that network,"}, {"Time_Start": 1396.54, "Time_End": 1399.1, "Text": " without having to have an IP address."}, {"Time_Start": 1399.62, "Time_End": 1403.68, "Text": " This, basically, what you can do is when you're on the network,"}, {"Time_Start": 1403.86, "Time_End": 1406.86, "Text": " you can passively sniff the packets."}, {"Time_Start": 1406.98, "Time_End": 1409.7, "Text": " As long as you're on the network, that's all you need to know."}, {"Time_Start": 1409.84, "Time_End": 1412.18, "Text": " So if you're on the network, you have our software,"}, {"Time_Start": 1412.72, "Time_End": 1415.0, "Text": " your communication is possible, no IP address,"}, {"Time_Start": 1415.7, "Time_End": 1417.74, "Text": " your identity is hopefully kept a secret."}, {"Time_Start": 1418.3999999999999, "Time_End": 1421.76, "Text": " And if that fails, you always have the cryptography on top of that,"}, {"Time_Start": 1422.1599999999999, "Time_End": 1423.74, "Text": " whatever level of encryption you have."}, {"Time_Start": 1424.44, "Time_End": 1426.52, "Text": " So just to let you know, I'm going to pass it over to this."}, {"Time_Start": 1426.54, "Time_End": 1428.56, "Text": " the key for another aspect of that."}, {"Time_Start": 1429.56, "Time_End": 1429.76, "Text": " Okay."}, {"Time_Start": 1430.46, "Time_End": 1434.7, "Text": " Finally, and we're almost in somewhat way, shape, or form ashamed of this,"}, {"Time_Start": 1434.8, "Time_End": 1438.28, "Text": " but due to the vast random data dispersal nature of our project,"}, {"Time_Start": 1439.76, "Time_End": 1442.8, "Text": " Luna Correspondence Protocol can be used to distribute a nasty,"}, {"Time_Start": 1443.06, "Time_End": 1444.52, "Text": " na-denial service attack."}, {"Time_Start": 1444.78, "Time_End": 1447.26, "Text": " So for packet kitties out there like you,"}, {"Time_Start": 1448.28, "Time_End": 1450.62, "Text": " you, and packet parentheses such as you,"}, {"Time_Start": 1451.44, "Time_End": 1454.1599999999999, "Text": " please do not affiliate our software with any sort of these attacks."}, {"Time_Start": 1454.1599999999999, "Time_End": 1456.52, "Text": " It was not the original device meaning."}, {"Time_Start": 1456.54, "Time_End": 1459.6599999999999, "Text": " or basically what we intended to use this project for."}, {"Time_Start": 1460.04, "Time_End": 1466.98, "Text": " So, again, we'd just like to emphasize that it is possible to launch a massively distributed DDoS attack."}, {"Time_Start": 1467.3, "Time_End": 1468.32, "Text": " However, don't do it."}, {"Time_Start": 1469.12, "Time_End": 1469.56, "Text": " Please."}, {"Time_Start": 1470.18, "Time_End": 1471.1, "Text": " We like the Internet."}, {"Time_Start": 1471.22, "Time_End": 1471.98, "Text": " Please don't break it."}, {"Time_Start": 1476.34, "Time_End": 1476.8999999999999, "Text": " All right."}, {"Time_Start": 1476.94, "Time_End": 1480.34, "Text": " There's some other talks going on today and the rest of the con."}, {"Time_Start": 1480.5, "Time_End": 1484.92, "Text": " Basically, today you've got government IP tapping happening with Jay Ballou."}, {"Time_Start": 1485.02, "Time_End": 1486.26, "Text": " I'm probably going to check that out."}, {"Time_Start": 1486.54, "Time_End": 1490.22, "Text": " It should be pretty good. It has to do somewhat with this concept."}, {"Time_Start": 1490.6399999999999, "Time_End": 1496.0, "Text": " Tomorrow, on Saturday, we have Air Snarf with Beetle and Bruce Potter."}, {"Time_Start": 1496.44, "Time_End": 1500.78, "Text": " And then on Sunday, we have Jeffrey Pruson presenting technical security."}, {"Time_Start": 1501.3, "Time_End": 1508.86, "Text": " So these are all things that have to do with your right to be anonymous and your privacy"}, {"Time_Start": 1508.86, "Time_End": 1512.34, "Text": " and how you can do things. So I recommend that you check those out."}, {"Time_Start": 1513.34, "Time_End": 1516.04, "Text": " Also, we're going to add the Airjack projects."}, {"Time_Start": 1516.54, "Time_End": 1520.46, "Text": " want to check it out. Air Jack's actually been used in some of our testing, and it makes"}, {"Time_Start": 1520.46, "Time_End": 1525.8999999999999, "Text": " a lot of very interesting things possible. It's a really great subject, and you guys should check"}, {"Time_Start": 1525.8999999999999, "Time_End": 1527.1, "Text": " it out by Abandon."}, {"Time_Start": 1529.3999999999999, "Time_End": 1534.3999999999999, "Text": " Finally, we'd like to make some acknowledgements here. We'd like to acknowledge the infamous Mr. Tank,"}, {"Time_Start": 1534.48, "Time_End": 1538.6399999999999, "Text": " which is a mathematical genius guidance. Unfortunately, he was unable to join us today, so he's not"}, {"Time_Start": 1538.6399999999999, "Time_End": 1542.8799999999999, "Text": " sitting in an audience per se, but he is vicariously watching us somehow through a closed"}, {"Time_Start": 1542.8799999999999, "Time_End": 1543.98, "Text": " circuit television somewhere."}, {"Time_Start": 1544.98, "Time_End": 1546.44, "Text": " Second, we'd like to acknowledge Douglas."}, {"Time_Start": 1546.54, "Time_End": 1551.1399999999999, "Text": " Adams and the meeting of Life 42. Please rest in peace. We use some of his concepts,"}, {"Time_Start": 1551.6, "Time_End": 1557.28, "Text": " strikingly, believe it or not, like the finite improbabilities, yada, yada. And then most"}, {"Time_Start": 1557.28, "Time_End": 1559.8999999999999, "Text": " importantly, thank you all for the support. Thank you very much for showing up today. We really"}, {"Time_Start": 1559.8999999999999, "Time_End": 1560.58, "Text": " appreciate it."}, {"Time_Start": 1566.26, "Time_End": 1570.46, "Text": " Okay, now we've come to the Q&A portion. So this man right here."}, {"Time_Start": 1576.54, "Time_End": 1584.04, "Text": " Okay. For those you couldn't hear, a gentleman here, we're asking how the software"}, {"Time_Start": 1584.04, "Time_End": 1588.26, "Text": " deals with ICMP packets being lost or lost packets going across the network."}, {"Time_Start": 1589.18, "Time_End": 1594.08, "Text": " And it's much extreme implementation, it doesn't. However, there's a filter and there's a set of rules"}, {"Time_Start": 1594.08, "Time_End": 1598.72, "Text": " that you can apply to any one of these. One of them being a pseudo-TCP that has sins and acts."}, {"Time_Start": 1599.42, "Time_End": 1603.92, "Text": " And this is encapsulated within the encrypted data. This is part of the payload of the packet that's"}, {"Time_Start": 1603.92, "Time_End": 1605.8, "Text": " already been anonymously sent via Luna."}, {"Time_Start": 1606.54, "Time_End": 1611.1599999999999, "Text": " However, if you're doing Sins and Acts, it exponentially increases the amount of traffic"}, {"Time_Start": 1611.1599999999999, "Time_End": 1615.02, "Text": " going across the network and across the relays. And you're going to have the same packets going"}, {"Time_Start": 1615.02, "Time_End": 1619.8999999999999, "Text": " across back and forth several times. And they may be flagged as, you know, suspicious traffic."}, {"Time_Start": 1620.8999999999999, "Time_End": 1625.24, "Text": " But that's why we chose not to address it here and in software, but you can do it with the data"}, {"Time_Start": 1625.24, "Time_End": 1625.58, "Text": " filters."}, {"Time_Start": 1625.8799999999999, "Time_End": 1630.8999999999999, "Text": " Luna by itself does not deal with the issue of dropped, lost, or somehow corrupt packet."}, {"Time_Start": 1631.32, "Time_End": 1636.52, "Text": " We do not have like a TCP-style protocol wrapped around it. So in S&A, in SEP."}, {"Time_Start": 1636.54, "Time_End": 1642.04, "Text": " Since, we base this, we call it like finite in probabilities, there's really no way for me to know that you did receive all the data."}, {"Time_Start": 1642.36, "Time_End": 1647.1, "Text": " I mean, that is the downfall of the basic Luna correspondence protocol in its own."}, {"Time_Start": 1647.36, "Time_End": 1648.54, "Text": " There really is no way."}, {"Time_Start": 1648.74, "Time_End": 1651.36, "Text": " I mean, you may never receive the data, for all I know."}, {"Time_Start": 1654.54, "Time_End": 1658.72, "Text": " That's true. That's very true. One lost packet could very well invalidate all the packets."}, {"Time_Start": 1659.18, "Time_End": 1664.02, "Text": " There's no way for us to know if you did receive the packets, therefore there's no way of me retransmitting it,"}, {"Time_Start": 1664.02, "Time_End": 1665.8999999999999, "Text": " and therefore the receiver will just be."}, {"Time_Start": 1666.54, "Time_End": 1669.34, "Text": " listening and waiting for this packet to arrive."}, {"Time_Start": 1669.58, "Time_End": 1674.42, "Text": " And again, that's under the most extreme, anonymous, secure implementation of what you'd want to do."}, {"Time_Start": 1675.42, "Time_End": 1679.52, "Text": " You can, again, when we've tested and it works, the CIN-ACC scenario with,"}, {"Time_Start": 1679.72, "Time_End": 1682.52, "Text": " tunneling basically a pseudo-ICP within the Luna packet."}, {"Time_Start": 1683.1599999999999, "Time_End": 1686.28, "Text": " And you can, thereby guarantee that it came from one source of the other."}, {"Time_Start": 1687.06, "Time_End": 1687.56, "Text": " But yeah, that's right."}, {"Time_Start": 1687.6399999999999, "Time_End": 1692.12, "Text": " For anybody that has any questions, please come up here and just ask on the mic so that everybody can hear."}, {"Time_Start": 1692.3799999999999, "Time_End": 1693.46, "Text": " Yeah, I'd probably expedite things."}, {"Time_Start": 1693.46, "Time_End": 1694.58, "Text": " Actually, sure."}, {"Time_Start": 1695.32, "Time_End": 1695.8799999999999, "Text": " Both of you, actually."}, {"Time_Start": 1696.54, "Time_End": 1699.78, "Text": " You guys can just all come, whoever has questions, and come and ask and we'll answer."}, {"Time_Start": 1699.78, "Time_End": 1705.98, "Text": " With some of the features of IPV6, is this going to be able to work over that?"}, {"Time_Start": 1706.8, "Time_End": 1715.32, "Text": " I mean, the security, it's by IPV6, the encryption, the, you know, it doesn't, it limits on doing the spoofing techniques you can do an IPV4."}, {"Time_Start": 1716.54, "Time_End": 1725.96, "Text": " As far to address that question right there, it's, we haven't been able to really test it over IPV6 distributed over the entire Internet, because it's not really implemented yet."}, {"Time_Start": 1726.54, "Time_End": 1727.28, "Text": " It hasn't been tested."}, {"Time_Start": 1727.54, "Time_End": 1728.48, "Text": " It hasn't been tested yet."}, {"Time_Start": 1729.18, "Time_End": 1731.36, "Text": " But basically, software can be modified."}, {"Time_Start": 1731.8999999999999, "Time_End": 1736.22, "Text": " And ICMP, again, to address this, ICMP is not the most critical component of this."}, {"Time_Start": 1736.3, "Time_End": 1737.02, "Text": " It's just the relay."}, {"Time_Start": 1737.1399999999999, "Time_End": 1738.2, "Text": " It's anonymizing your host."}, {"Time_Start": 1738.74, "Time_End": 1743.42, "Text": " One center that was brought up was on a local network, a streaming network from box to box,"}, {"Time_Start": 1743.42, "Time_End": 1750.24, "Text": " like a local network segment, to hide the data in, like, a UDP packet for masks as syncing"}, {"Time_Start": 1750.24, "Time_End": 1750.96, "Text": " your time servers."}, {"Time_Start": 1751.8, "Time_End": 1755.6599999999999, "Text": " Or even somebody mentioned hiding in shoutcast, a lot of different implementations."}, {"Time_Start": 1756.54, "Time_End": 1765.56, "Text": " If you have an organization like the NSA or echelon, somebody who has access to maybe all of the routers on the Internet or most of the routers on the Internet,"}, {"Time_Start": 1766.1599999999999, "Time_End": 1772.26, "Text": " if they were to implement something where, I mean, there's been things suggested where they would start logging every packet,"}, {"Time_Start": 1772.3799999999999, "Time_End": 1775.3999999999999, "Text": " which is ridiculous because they'd need a hard drive, the size of a football field."}, {"Time_Start": 1775.8999999999999, "Time_End": 1782.1, "Text": " But if they started implementing something like logging the CRC or checksum of every packet,"}, {"Time_Start": 1782.1, "Time_End": 1786.52, "Text": " it seems like it would be possible to back trace simply by, even if the packet,"}, {"Time_Start": 1786.54, "Time_End": 1788.1399999999999, "Text": " are encrypted and out of order."}, {"Time_Start": 1788.58, "Time_End": 1795.3999999999999, "Text": " If you know that this meant that a bunch of anomalous packets went to this destination subnet"}, {"Time_Start": 1795.3999999999999, "Time_End": 1801.08, "Text": " and that they all had the following checksums, you could just match up the checksums across the"}, {"Time_Start": 1801.08, "Time_End": 1804.0, "Text": " network until you narrow down to the originating subnet."}, {"Time_Start": 1804.0, "Time_End": 1809.04, "Text": " And that would at least tell you perhaps what subnet originally came from, not necessarily"}, {"Time_Start": 1809.04, "Time_End": 1814.8999999999999, "Text": " who sent it, but it seems like you could narrow down the origin that way if you had that much information."}, {"Time_Start": 1814.9, "Time_End": 1816.9, "Text": " To answer it, that's a very good question."}, {"Time_Start": 1817.0, "Time_End": 1821.42, "Text": " It's one that we've actually been asked several times before for people who discussed this with."}, {"Time_Start": 1821.7800000000002, "Time_End": 1828.02, "Text": " The main goal of creating anonymous communication is not that we don't want to have something that's a standard Luna packet"}, {"Time_Start": 1828.02, "Time_End": 1829.94, "Text": " or something to be flagged as a Luna packet."}, {"Time_Start": 1830.8600000000001, "Time_End": 1833.14, "Text": " That's kind of where the permutation routine."}, {"Time_Start": 1833.14, "Time_End": 1835.72, "Text": " Wait, hey, let me cut in."}, {"Time_Start": 1835.8400000000001, "Time_End": 1841.3600000000001, "Text": " I think what he was saying was all the packets going through through one subnet."}, {"Time_Start": 1841.3600000000001, "Time_End": 1844.88, "Text": " But the thing about Luna correspondence protocol is that when you see,"}, {"Time_Start": 1844.9, "Time_End": 1849.66, "Text": " send the packets, you're using multiple relay hosts, which are multiple subnets."}, {"Time_Start": 1850.0800000000002, "Time_End": 1854.24, "Text": " So even if you did have, like, what he said, the NSA and everybody logging everything,"}, {"Time_Start": 1855.24, "Time_End": 1860.0, "Text": " it would be hard because your packets could be spread across a period of, like, a hundred"}, {"Time_Start": 1860.0, "Time_End": 1860.64, "Text": " subnets."}, {"Time_Start": 1860.9, "Time_End": 1865.42, "Text": " So even if you were logging everything, you have to go to those 100 subnets, log everything on the"}, {"Time_Start": 1865.42, "Time_End": 1868.1000000000001, "Text": " hundred subnets, and then try to order the packets in the right order."}, {"Time_Start": 1868.2800000000002, "Time_End": 1872.0800000000002, "Text": " Then after you get out the packets in the correct order, then you have to decrypt them."}, {"Time_Start": 1872.8400000000001, "Time_End": 1874.6200000000001, "Text": " So basically,"}, {"Time_Start": 1874.9, "Time_End": 1876.18, "Text": " I think that's what we was talking about."}, {"Time_Start": 1876.42, "Time_End": 1877.94, "Text": " So we have more relay hosts."}, {"Time_Start": 1878.7, "Time_End": 1882.74, "Text": " And that's, that's, so to answer this question, it's almost impossible."}, {"Time_Start": 1883.2800000000002, "Time_End": 1885.16, "Text": " And also if it's anomalous package you're looking for."}, {"Time_Start": 1886.0, "Time_End": 1888.8200000000002, "Text": " Again, a lot of ICMP traffic is anomalous by nature."}, {"Time_Start": 1889.46, "Time_End": 1894.9, "Text": " Arbitory applications create arbitrary data within the ICMP packets to calculate what's going on in the network."}, {"Time_Start": 1895.0400000000002, "Time_End": 1899.7800000000002, "Text": " We have yet, we offer you to download this stuff to try it, see if you can filter out your Luna packets."}, {"Time_Start": 1900.42, "Time_End": 1901.2800000000002, "Text": " We haven't been able to."}, {"Time_Start": 1903.0800000000002, "Time_End": 1904.8200000000002, "Text": " And again, this is through good practices."}, {"Time_Start": 1904.9, "Time_End": 1908.3400000000001, "Text": " of doing it, you're not keeping the same seed, you're not keeping the same values"}, {"Time_Start": 1908.3400000000001, "Time_End": 1911.94, "Text": " on the session by session basis if you're doing your screen yourself, just as if you're using"}, {"Time_Start": 1911.94, "Time_End": 1913.8400000000001, "Text": " the same relays and a lot of the same stuff."}, {"Time_Start": 1913.88, "Time_End": 1914.94, "Text": " You want to keep it moving."}, {"Time_Start": 1915.74, "Time_End": 1916.46, "Text": " Yeah, to address the next question."}, {"Time_Start": 1916.46, "Time_End": 1916.6200000000001, "Text": " All right."}, {"Time_Start": 1917.0, "Time_End": 1923.0400000000002, "Text": " So you said that the packets go out in kind of a random order, but there's also the start and end sequence"}, {"Time_Start": 1923.0400000000002, "Time_End": 1926.0600000000002, "Text": " that the listening host looks for."}, {"Time_Start": 1926.26, "Time_End": 1929.76, "Text": " So do those have to be in, received in order, like the start sequence?"}, {"Time_Start": 1930.68, "Time_End": 1934.2800000000002, "Text": " No, in fact, the start and stop sequence can be sent anywhere within the order,"}, {"Time_Start": 1934.6000000000001, "Time_End": 1934.8000000000002, "Text": " because the start and stop sequence can be sent anywhere within the order, because"}, {"Time_Start": 1934.9, "Time_End": 1938.48, "Text": " The receiving host is left just receiving all traffic as it comes in."}, {"Time_Start": 1938.68, "Time_End": 1939.92, "Text": " He's looking for these two packets."}, {"Time_Start": 1940.2, "Time_End": 1943.5400000000002, "Text": " When they do arrive, be it the first two, the last two, anywhere in the sequence."}, {"Time_Start": 1944.44, "Time_End": 1949.18, "Text": " When he does have them, it's then possible for him to set them up, see where they exist in the"}, {"Time_Start": 1949.18, "Time_End": 1953.2, "Text": " sequence of random numbers, and then figure out where packets need to be injected in between."}, {"Time_Start": 1953.5600000000002, "Time_End": 1953.68, "Text": " See?"}, {"Time_Start": 1953.92, "Time_End": 1959.24, "Text": " So the receiver is unable to order them until he has received both of them, but they can be sent"}, {"Time_Start": 1959.24, "Time_End": 1960.3400000000001, "Text": " anywhere within the stream."}, {"Time_Start": 1961.5400000000002, "Time_End": 1963.3200000000002, "Text": " But he might have to keep listening."}, {"Time_Start": 1963.72, "Time_End": 1964.74, "Text": " But he would have to keep listing."}, {"Time_Start": 1964.9, "Time_End": 1967.5, "Text": " That's correct. If there was a delay or they were sent last."}, {"Time_Start": 1967.88, "Time_End": 1968.18, "Text": " Thank you."}, {"Time_Start": 1968.42, "Time_End": 1972.4, "Text": " This protocol is on the other end when you receive, it's very passive."}, {"Time_Start": 1972.52, "Time_End": 1978.0, "Text": " That's why you can use UDP packets on a local network without even having to use any relay hosts."}, {"Time_Start": 1980.0600000000002, "Time_End": 1981.0400000000002, "Text": " All right, two questions."}, {"Time_Start": 1981.44, "Time_End": 1981.6000000000001, "Text": " Okay."}, {"Time_Start": 1981.7, "Time_End": 1990.72, "Text": " The first, you said that even if the protocol is flawed, that the encryption done through one of the data filters over the data"}, {"Time_Start": 1990.72, "Time_End": 1993.16, "Text": " will still be the absolute minimum security."}, {"Time_Start": 1993.42, "Time_End": 1994.88, "Text": " How do you deal with key distribution?"}, {"Time_Start": 1994.9, "Time_End": 1997.4, "Text": " How do you deal with key distribution?"}, {"Time_Start": 1997.8000000000002, "Time_End": 2002.0400000000002, "Text": " The key distribution basically is transmitted in the same way that the seed initially was."}, {"Time_Start": 2002.14, "Time_End": 2003.1000000000001, "Text": " It's up to the two parties."}, {"Time_Start": 2003.4, "Time_End": 2010.3400000000001, "Text": " You see, our protocol is basically interested in keeping a, we call them like host key files."}, {"Time_Start": 2010.5400000000002, "Time_End": 2017.14, "Text": " But if you have to do key negotiation before you can send data, how do you do the anonymous data transfer?"}, {"Time_Start": 2017.5, "Time_End": 2018.14, "Text": " Well, that's what I'm saying."}, {"Time_Start": 2018.3200000000002, "Time_End": 2023.2800000000002, "Text": " Beforehand, it would be maybe a matter of you and I physically meeting, and we'd write down our keys or we'd transmit them,"}, {"Time_Start": 2023.44, "Time_End": 2024.3400000000001, "Text": " and then we both have them."}, {"Time_Start": 2024.3400000000001, "Time_End": 2028.2800000000002, "Text": " So that when we separate or when you're in Europe and I'm over in Asia somewhere,"}, {"Time_Start": 2028.6200000000001, "Time_End": 2030.3000000000002, "Text": " we then have them and we are able to communicate."}, {"Time_Start": 2030.44, "Time_End": 2033.0600000000002, "Text": " You see, it's truly up to the two communicating parties."}, {"Time_Start": 2033.5200000000002, "Time_End": 2037.92, "Text": " It could very well be that maybe we have some sort of a challenge response protocol to send the keys,"}, {"Time_Start": 2038.0800000000002, "Time_End": 2041.0400000000002, "Text": " but those are all susceptible to man in the middle style attacks, and it's not very secure."}, {"Time_Start": 2041.2800000000002, "Time_End": 2044.9, "Text": " Well, any key exchange protocol will be susceptible to man in the middle."}, {"Time_Start": 2045.2800000000002, "Time_End": 2048.6000000000004, "Text": " So are you basically just saying key distribution is not part of our protocol?"}, {"Time_Start": 2048.7200000000003, "Time_End": 2049.5, "Text": " It's not part of our protocol."}, {"Time_Start": 2049.7000000000003, "Time_End": 2052.2400000000002, "Text": " It's implemented on however you wish to do so."}, {"Time_Start": 2052.2400000000002, "Time_End": 2052.34, "Text": " Okay."}, {"Time_Start": 2052.44, "Time_End": 2054.32, "Text": " Actually, encryption as a whole is part of a data."}, {"Time_Start": 2054.34, "Time_End": 2057.6400000000003, "Text": " filter set that we chose to implement in the software, and it's a really good idea for, again,"}, {"Time_Start": 2057.7200000000003, "Time_End": 2062.88, "Text": " you don't need, you know, PGP for a POP3 to work correctly, but it's a really good thing"}, {"Time_Start": 2062.88, "Time_End": 2068.5, "Text": " to have in your client. Now, obviously, if you've got to do session per session keys,"}, {"Time_Start": 2068.8, "Time_End": 2072.1800000000003, "Text": " it's not feasible to call you up on the phone, say, here's my key, hang up, and then start"}, {"Time_Start": 2072.1800000000003, "Time_End": 2073.08, "Text": " transmitting it over the network."}, {"Time_Start": 2073.08, "Time_End": 2078.6400000000003, "Text": " But if you're trying to transmit it transmit data anonymously to somebody, how do you do any form of"}, {"Time_Start": 2078.6400000000003, "Time_End": 2079.84, "Text": " key negotiation beforehand?"}, {"Time_Start": 2081.58, "Time_End": 2084.32, "Text": " Again, this is going to be up to the individual hope."}, {"Time_Start": 2084.34, "Time_End": 2089.38, "Text": " No, no, no, I think you're trying to ask, if I don't know you, and we both have the software,"}, {"Time_Start": 2089.6200000000003, "Time_End": 2093.6000000000004, "Text": " how do we communicate? Well, we don't. I would have to know you first, and we would have"}, {"Time_Start": 2093.6000000000004, "Time_End": 2098.5, "Text": " to establish beforehand, you know, the keys, the seeds, and whatever else is necessary to decrypt"}, {"Time_Start": 2098.5, "Time_End": 2101.88, "Text": " the data. We would have to, it all have to be established at some point first."}, {"Time_Start": 2101.88, "Time_End": 2104.84, "Text": " Yeah, that's what I was going to say. It doesn't have any negotiation like SSH or anything"}, {"Time_Start": 2104.84, "Time_End": 2108.46, "Text": " like that. It's not like a chat client in the sense that I can search for other learning users."}, {"Time_Start": 2109.06, "Time_End": 2112.0, "Text": " But that's a really good idea. That's a great question. Thank you."}, {"Time_Start": 2112.0, "Time_End": 2114.32, "Text": " Saying the ICMP to people who weren't expecting it is,"}, {"Time_Start": 2114.34, "Time_End": 2119.1000000000004, "Text": " more of a denial of service attack than communication. So you kind of want to know"}, {"Time_Start": 2119.1000000000004, "Time_End": 2121.46, "Text": " what's going on between the two parties."}, {"Time_Start": 2122.1800000000003, "Time_End": 2126.2400000000002, "Text": " Now, you've said that you have problems if there's egress filters. Have you considered"}, {"Time_Start": 2126.2400000000002, "Time_End": 2130.2000000000003, "Text": " any kind of implementation of a client and server, a server on the internet, where"}, {"Time_Start": 2130.2000000000003, "Time_End": 2134.42, "Text": " would, in essence, be able to overcome that because you know the servers connected"}, {"Time_Start": 2134.42, "Time_End": 2138.34, "Text": " to somewhere where they're not ingress filters or egress filters? Basically, if"}, {"Time_Start": 2138.34, "Time_End": 2142.46, "Text": " you're in a situation where you cannot spoof your IP address to get across your network or even"}, {"Time_Start": 2142.46, "Time_End": 2144.32, "Text": " your Mac address, there is. There is a number."}, {"Time_Start": 2144.34, "Time_End": 2148.1600000000003, "Text": " and that's kind of how the, it's probably going to run out of time before we can really discuss it in-depth"}, {"Time_Start": 2148.1600000000003, "Time_End": 2151.6400000000003, "Text": " how the HTTP relay works and, you know, for Internet access."}, {"Time_Start": 2151.92, "Time_End": 2155.88, "Text": " Basically, you don't have to have anything besides these parsing engines on either end"}, {"Time_Start": 2155.88, "Time_End": 2158.92, "Text": " and know what this initial value is to use Luna in its base form."}, {"Time_Start": 2159.1600000000003, "Time_End": 2160.7000000000003, "Text": " But you can implement whatever you want over it."}, {"Time_Start": 2160.7200000000003, "Time_End": 2165.84, "Text": " We have a situation where you can actually have a second host, maybe your home computer."}, {"Time_Start": 2165.94, "Time_End": 2169.2400000000002, "Text": " You want free wireless at some coffee shop that's all over the country."}, {"Time_Start": 2170.0, "Time_End": 2174.32, "Text": " And you basically can send this data out to listening party at your own network."}, {"Time_Start": 2174.34, "Time_End": 2178.5, "Text": " work, they can go and execute commands on your behalf, relay this data back to you."}, {"Time_Start": 2179.78, "Time_End": 2182.92, "Text": " Really, in situations where you can't spoof, you could have another host do it."}, {"Time_Start": 2183.08, "Time_End": 2186.4, "Text": " But again, that host is just implementing Luna, and you might as well just tell net into it"}, {"Time_Start": 2186.4, "Time_End": 2189.38, "Text": " or shell into it, SSH in, and run Luna from that local server."}, {"Time_Start": 2189.6600000000003, "Time_End": 2193.28, "Text": " There is a non-spooping option for our protocol, our software implementation."}, {"Time_Start": 2197.48, "Time_End": 2197.92, "Text": " Hi."}, {"Time_Start": 2198.42, "Time_End": 2204.32, "Text": " So given a shared key and a common set of random number generators, two parties can,"}, {"Time_Start": 2204.34, "Time_End": 2208.0, "Text": " and communicate, scrambling the data and the data stream in a deterministic manner."}, {"Time_Start": 2208.2400000000002, "Time_End": 2208.86, "Text": " That's great."}, {"Time_Start": 2209.08, "Time_End": 2213.76, "Text": " So why is this any more secure than using the same random number generators and the same"}, {"Time_Start": 2213.76, "Time_End": 2215.56, "Text": " shared key to just generate a one-time pad?"}, {"Time_Start": 2216.7400000000002, "Time_End": 2217.42, "Text": " A one-time."}, {"Time_Start": 2217.58, "Time_End": 2218.34, "Text": " A one-time pad."}, {"Time_Start": 2219.08, "Time_End": 2223.06, "Text": " Use your random number generator, generate a long stream of random numbers."}, {"Time_Start": 2223.6800000000003, "Time_End": 2224.28, "Text": " Yeah, exactly."}, {"Time_Start": 2224.54, "Time_End": 2226.2400000000002, "Text": " And X-O or that with your data stream."}, {"Time_Start": 2226.84, "Time_End": 2229.3, "Text": " Why is Luna any more secure than a one-time pad?"}, {"Time_Start": 2229.96, "Time_End": 2231.1800000000003, "Text": " Well, we don't have to do that."}, {"Time_Start": 2231.1800000000003, "Time_End": 2234.28, "Text": " In effect, we are doing that, but we're generating them off the"}, {"Time_Start": 2234.34, "Time_End": 2236.02, "Text": " seed and then matching up later."}, {"Time_Start": 2236.1400000000003, "Time_End": 2239.44, "Text": " It seems like you're doing a lot of extra work for not much extra security."}, {"Time_Start": 2239.86, "Time_End": 2246.48, "Text": " I mean, the rent, the protocol, certainly is great."}, {"Time_Start": 2246.54, "Time_End": 2247.0, "Text": " That's great."}, {"Time_Start": 2247.1000000000004, "Time_End": 2250.92, "Text": " But the actual scrambling of the data doesn't seem to be any more, doesn't give you"}, {"Time_Start": 2250.92, "Time_End": 2252.7000000000003, "Text": " any more effect than a one-time pad."}, {"Time_Start": 2253.42, "Time_End": 2257.88, "Text": " What we can answer to this is how you actually implement the reordering."}, {"Time_Start": 2258.1000000000004, "Time_End": 2260.7400000000002, "Text": " Basically, we're telling how our software does it, but you can actually"}, {"Time_Start": 2260.7400000000002, "Time_End": 2263.86, "Text": " reorder it just that same way, as long as the data is not coming in order,"}, {"Time_Start": 2263.86, "Time_End": 2268.28, "Text": " as long as you're applying the methods behind it, the logic behind how you're doing it."}, {"Time_Start": 2268.3, "Time_End": 2269.26, "Text": " You can implement it however you want."}, {"Time_Start": 2269.3, "Time_End": 2270.84, "Text": " You can implement it with a one-way pad."}, {"Time_Start": 2271.58, "Time_End": 2272.3, "Text": " You're correct."}, {"Time_Start": 2272.6200000000003, "Time_End": 2276.8, "Text": " I mean, basically, you know, of course, which I totally see what you're saying."}, {"Time_Start": 2277.1400000000003, "Time_End": 2280.48, "Text": " The thing about Luna is that it's very passive, so you can be on a subnet,"}, {"Time_Start": 2280.58, "Time_End": 2281.9, "Text": " send from one subnet to another."}, {"Time_Start": 2282.26, "Time_End": 2283.3, "Text": " That's the thing about Luna."}, {"Time_Start": 2283.42, "Time_End": 2287.7200000000003, "Text": " It's not just the idea of reordering the packets because that would be the same as like"}, {"Time_Start": 2287.7200000000003, "Time_End": 2288.6200000000003, "Text": " cryptography, right?"}, {"Time_Start": 2289.1, "Time_End": 2292.36, "Text": " So the thing about it is you're on a sub, two different subnets."}, {"Time_Start": 2292.36, "Time_End": 2293.84, "Text": " You're able to communicate to each other."}, {"Time_Start": 2293.86, "Time_End": 2296.26, "Text": " and then you have the different relay hosts you can bounce from."}, {"Time_Start": 2297.06, "Time_End": 2298.78, "Text": " So that just adds on top of that."}, {"Time_Start": 2299.02, "Time_End": 2302.6600000000003, "Text": " But even if that's, you know, done, then you still have the cryptography."}, {"Time_Start": 2302.94, "Time_End": 2306.08, "Text": " Just briefly, rather than store all of the random numbers,"}, {"Time_Start": 2306.54, "Time_End": 2309.0, "Text": " in other words, like generate a pad, as you called it, of random numbers."}, {"Time_Start": 2309.3, "Time_End": 2312.5, "Text": " We're just storing the seed and then generating the random numbers later."}, {"Time_Start": 2316.6600000000003, "Time_End": 2320.6600000000003, "Text": " Right, it can happen either way, but we're storing less initially to generate more later,"}, {"Time_Start": 2320.96, "Time_End": 2323.2400000000002, "Text": " if that makes sense, rather than store everything now."}, {"Time_Start": 2323.2400000000002, "Time_End": 2328.28, "Text": " And then at least with the seed, we can now say, instead of giving me this set of 10 random numbers,"}, {"Time_Start": 2328.88, "Time_End": 2333.96, "Text": " let's, you know, evaluate this function 20 times and then give me this set."}, {"Time_Start": 2334.1600000000003, "Time_End": 2335.6800000000003, "Text": " So they can always change, see?"}, {"Time_Start": 2335.92, "Time_End": 2341.44, "Text": " And we could do like a roundabout thing or we could just, you know, for simplicity's sake, never reuse the same random number"}, {"Time_Start": 2341.44, "Time_End": 2347.0200000000004, "Text": " and just keep going down the stream, but keep a placeholder and know where we are every time by storing one piece."}, {"Time_Start": 2347.86, "Time_End": 2352.0600000000004, "Text": " Can you go into a little more detail about how exactly you do the reordering of packets?"}, {"Time_Start": 2352.06, "Time_End": 2356.2, "Text": " Are they somehow marked in some way, or are you just depending on the order in which they're received"}, {"Time_Start": 2356.2, "Time_End": 2361.16, "Text": " so that if they were scrambled somehow in time when you received them, that would hose the encryption?"}, {"Time_Start": 2362.22, "Time_End": 2364.36, "Text": " The packets are reordered based on the sequence number."}, {"Time_Start": 2364.54, "Time_End": 2370.68, "Text": " The sequence number is set to the random generated number coming out of the random function, basically."}, {"Time_Start": 2371.52, "Time_End": 2374.74, "Text": " So we have a seed."}, {"Time_Start": 2375.04, "Time_End": 2377.22, "Text": " We stick the seed in through the random number generator."}, {"Time_Start": 2377.36, "Time_End": 2377.56, "Text": " Right."}, {"Time_Start": 2377.7599999999998, "Time_End": 2382.04, "Text": " And on both parties, both parties are then generating the same random number."}, {"Time_Start": 2382.06, "Time_End": 2383.52, "Text": " numbers in succession, one after another."}, {"Time_Start": 2383.7599999999998, "Time_End": 2383.98, "Text": " Right."}, {"Time_Start": 2384.4, "Time_End": 2388.98, "Text": " These numbers that are being generated are affixed as the sequence ID in all of the packets."}, {"Time_Start": 2390.2599999999998, "Time_End": 2392.5, "Text": " The sequence ID, I'm sorry."}, {"Time_Start": 2392.56, "Time_End": 2394.66, "Text": " It's part of the IP header in the packets."}, {"Time_Start": 2394.86, "Time_End": 2398.56, "Text": " So we're setting the sequence ID as that field in the IP header."}, {"Time_Start": 2398.7999999999997, "Time_End": 2402.42, "Text": " So when the packets come in on the other end, he's able to then match it with the same"}, {"Time_Start": 2402.42, "Time_End": 2404.64, "Text": " seeds or with the same random numbers that he's generated."}, {"Time_Start": 2404.7799999999997, "Time_End": 2405.32, "Text": " The IP ID?"}, {"Time_Start": 2406.02, "Time_End": 2406.68, "Text": " Just to sound clear."}, {"Time_Start": 2407.44, "Time_End": 2408.7799999999997, "Text": " Because sequence numbers are part of TCP."}, {"Time_Start": 2409.18, "Time_End": 2410.2999999999997, "Text": " So I'm wondering, is it the IP ID?"}, {"Time_Start": 2410.56, "Time_End": 2410.82, "Text": " Oh, no."}, {"Time_Start": 2410.82, "Time_End": 2411.42, "Text": " We're using it."}, {"Time_Start": 2412.06, "Time_End": 2415.68, "Text": " We're writing straight IP, straight to the link layer."}, {"Time_Start": 2415.96, "Time_End": 2419.56, "Text": " This is the sequence number in the IP datagram, the IP header field."}, {"Time_Start": 2419.7599999999998, "Time_End": 2420.2999999999997, "Text": " The IP ID."}, {"Time_Start": 2421.1, "Time_End": 2421.46, "Text": " Right."}, {"Time_Start": 2421.68, "Time_End": 2421.84, "Text": " Yeah."}, {"Time_Start": 2422.0, "Time_End": 2422.38, "Text": " That's it."}, {"Time_Start": 2426.52, "Time_End": 2427.68, "Text": " Hey, oh, yeah."}, {"Time_Start": 2428.72, "Time_End": 2429.4, "Text": " I was thinking, hold the mic closer."}, {"Time_Start": 2429.64, "Time_End": 2435.56, "Text": " Oh, your protocol seems like it would make a lot more sense if it were implemented in like a many-to-many sort of thing,"}, {"Time_Start": 2435.62, "Time_End": 2437.7999999999997, "Text": " where you have many source hosts."}, {"Time_Start": 2437.7999999999997, "Time_End": 2441.44, "Text": " The data is physically broken up across all of them."}, {"Time_Start": 2442.06, "Time_End": 2444.84, "Text": " and, you know, you have many receiving hosts."}, {"Time_Start": 2445.34, "Time_End": 2449.2, "Text": " Because other than that, you still have a single endpoint on the other end."}, {"Time_Start": 2449.7, "Time_End": 2455.36, "Text": " We are doing the multiple sending portion of that by basically spoofing various networks."}, {"Time_Start": 2455.82, "Time_End": 2462.88, "Text": " However, in a sense, we're doing the multiple receiving because we're spoofing various targets as well."}, {"Time_Start": 2462.88, "Time_End": 2469.84, "Text": " See, so if we can say that the receiving end can reliably sniff on an entire Class B network,"}, {"Time_Start": 2470.16, "Time_End": 2472.04, "Text": " then what we can do at the sending end, the transatlant end, the transnational."}, {"Time_Start": 2472.06, "Time_End": 2477.12, "Text": " is we can spoof all of that. And it is quite possible that if you had two machines set up,"}, {"Time_Start": 2477.32, "Time_End": 2482.72, "Text": " they can both sniff that same Class B network, and they both were aware of your user credentials,"}, {"Time_Start": 2483.18, "Time_End": 2488.32, "Text": " the seed and everything else, that both parties could sniff that traffic. So it could very well be a many-to-many"}, {"Time_Start": 2488.32, "Time_End": 2493.7999999999997, "Text": " relationship. Does that make sense? Yeah, yeah. And in the base implementation, we basically want to avoid a"}, {"Time_Start": 2493.7999999999997, "Time_End": 2497.7799999999997, "Text": " scenario where you had to have client service software or have one, you know, an extra machine out there"}, {"Time_Start": 2497.7799999999997, "Time_End": 2501.6, "Text": " to do your dirty work for you. You're using the internet as-is to do your workload."}, {"Time_Start": 2502.06, "Time_End": 2508.02, "Text": " want people to, you know, be able to communicate individually without the need of a third"}, {"Time_Start": 2508.02, "Time_End": 2511.1, "Text": " party or third box that they may have a shell account on, whatever. You want to avoid"}, {"Time_Start": 2511.1, "Time_End": 2513.94, "Text": " creating that pattern. You want to avoid that third host. Because again, if you're constantly"}, {"Time_Start": 2513.94, "Time_End": 2517.46, "Text": " going everything through this third host, you're creating another pattern, another point for"}, {"Time_Start": 2517.46, "Time_End": 2523.54, "Text": " which you can be traced. And again, you can apply these to anything. Any means of communication"}, {"Time_Start": 2523.54, "Time_End": 2527.2599999999998, "Text": " doesn't have to be ICMP. You know, it could be UDP. You know, somebody even talked about embedding"}, {"Time_Start": 2527.2599999999998, "Time_End": 2532.04, "Text": " it like a shout cast server, a lot of different ways to do it. But the main thing you need to, the main"}, {"Time_Start": 2532.06, "Time_End": 2535.94, "Text": " point you need to touch on is you want to avoid the creation of patterns and you want to look"}, {"Time_Start": 2535.94, "Time_End": 2539.24, "Text": " logically at every step along the way. If you've created, you've got this server that's an"}, {"Time_Start": 2539.24, "Time_End": 2542.92, "Text": " intermediary or a bunch of different servers across internet that you log into, show into,"}, {"Time_Start": 2542.92, "Time_End": 2546.92, "Text": " whatever, you're creating another point for them to find where you were from. You know, it's another"}, {"Time_Start": 2546.92, "Time_End": 2552.12, "Text": " box that has your information on it and you don't want that. So I think we've got time for"}, {"Time_Start": 2552.12, "Time_End": 2556.64, "Text": " one more question. We got the five-minute signal. So anybody else? Any for the questions?"}, {"Time_Start": 2556.64, "Time_End": 2561.7599999999998, "Text": " Here we go. Okay. So you're bouncing the ICMP packets across something on the internet."}, {"Time_Start": 2562.06, "Time_End": 2564.06, "Text": " that have to be something you set up or can it be anyone?"}, {"Time_Start": 2564.06, "Time_End": 2572.06, "Text": " Basically, we're relaying it through an ICMP echo message. We can relay through anyone."}, {"Time_Start": 2572.06, "Time_End": 2578.06, "Text": " Anyone relaying ICMP echo traffic, whether it's Google.com, MSN.com, Yahoo.com, and the slew of other"}, {"Time_Start": 2578.06, "Time_End": 2586.06, "Text": " hooks, we can all relay over them. There is no, there's no, you know, hacking or owning of machines out there on the network to establish relay host."}, {"Time_Start": 2586.06, "Time_End": 2592.04, "Text": " Really, whether it be your personal Windows machine at home, you know, your Cox relay at home, you know, your Cox relay at home,"}, {"Time_Start": 2592.06, "Time_End": 2594.6, "Text": " or your business line. We can relay over it."}, {"Time_Start": 2596.7, "Time_End": 2599.68, "Text": " Okay, so that brings us to the end of everything. Thank you guys very much once again."}, {"Time_Start": 2599.88, "Time_End": 2601.48, "Text": " Yeah, check out SourceWorge."}, {"Time_Start": 2601.9, "Time_End": 2603.86, "Text": " SourceForge. Again, SourceForge right now, some of you may know."}, {"Time_Start": 2603.98, "Time_End": 2609.64, "Text": " SourceForge is currently upgrading some servers and some hardware and doing a couple things"}, {"Time_Start": 2609.64, "Time_End": 2614.56, "Text": " that aren't allowing us to upload the software at this time. And again, a lot of this, we all work,"}, {"Time_Start": 2614.56, "Time_End": 2618.44, "Text": " and it's a spare time kind of project. So it's going to be released in a timely manner."}, {"Time_Start": 2619.06, "Time_End": 2622.04, "Text": " But, again, it's not going to be a constant process."}, {"Time_Start": 2622.06, "Time_End": 2624.6, "Text": " project. We're going to be updating it as we can."}, {"Time_Start": 2625.82, "Time_End": 2628.24, "Text": " He just asked if it's Windows or Linux-based?"}, {"Time_Start": 2628.9, "Time_End": 2634.22, "Text": " Right now, it's Unix-based. However, there is a plan to export it out to a DOL"}, {"Time_Start": 2634.22, "Time_End": 2638.82, "Text": " to be able to be used by the Windows layer. But right now, we just want to make sure we had"}, {"Time_Start": 2638.82, "Time_End": 2642.7999999999997, "Text": " everything done and working in the Unix implementation because that's what we all run"}, {"Time_Start": 2642.7999999999997, "Time_End": 2644.2799999999997, "Text": " and we want to use it ourselves."}, {"Time_Start": 2648.12, "Time_End": 2650.22, "Text": " Yeah. Thank you guys very much. Enjoy the next."}]}