{"segments": [{"Time_Start": 0.0, "Time_End": 8.0, "Text": " Staying for the next to last talk on the last day."}, {"Time_Start": 8.0, "Time_End": 14.0, "Text": " Putting up with the fire marshal and the Jesus freaks in there and all that."}, {"Time_Start": 14.0, "Time_End": 18.0, "Text": " I'm inertia and I'm here to talk about IntermarCOS."}, {"Time_Start": 18.0, "Time_End": 25.0, "Text": " It's a distribution of Linux that the Nomad Mobile Research Center developed."}, {"Time_Start": 25.0, "Time_End": 29.0, "Text": " Nomad started this project a long time ago."}, {"Time_Start": 29.0, "Time_End": 41.0, "Text": " It never really got off the ground, but we've been working pretty hard on it after the events that Nomads talked about yesterday at our panel."}, {"Time_Start": 41.0, "Time_End": 49.0, "Text": " Overall goals for the project, we want to stable, secure, trusted system."}, {"Time_Start": 49.0, "Time_End": 58.0, "Text": " Users, initially we were going to make this kind of like as hard to install as we possibly could."}, {"Time_Start": 58.0, "Time_End": 67.0, "Text": " You know, we'd basically provide you with a floppy and you'd get a shell and then, you know, tell you to untar this file or some shit like that."}, {"Time_Start": 67.0, "Time_End": 87.56, "Text": " We changed that when we realized that we wanted to target, we wanted to make it more accessible to people that weren't really that knowledgeable about security so that it, you know, it comes up, locked down, and you don't, so that the, you don't, so that the, the, you know,"}, {"Time_Start": 87.56, "Time_End": 98.66, "Text": " the administrator just has to unlock things in order to get access to the internet and everything so that it's more security."}, {"Time_Start": 99.26, "Time_End": 106.46000000000001, "Text": " Intended uses, things like, you know, human rights activists and stuff like that."}, {"Time_Start": 106.46000000000001, "Time_End": 116.02000000000001, "Text": " Although if you heard Philip Zimmerman's talk at Black Hat, I probably shouldn't say that because now I can't use that in court to get out of shit."}, {"Time_Start": 116.02, "Time_End": 122.28, "Text": " So, anyway, like I said, Nomad came up with this idea."}, {"Time_Start": 122.28, "Time_End": 129.12, "Text": " His first idea was to use a slackware install and kind of hack through things and hodgepodge it together."}, {"Time_Start": 129.12, "Time_End": 131.38, "Text": " It never really got off the ground."}, {"Time_Start": 133.51999999999998, "Time_End": 141.82, "Text": " What I think what the problem was is that it was a little, it was like too, there's too much overhead required to get it out the door."}, {"Time_Start": 143.42, "Time_End": 145.78, "Text": " So when I came on, I said, well, what I was a little, it was a little, it was like too, there's too much overhead required to get it out the door."}, {"Time_Start": 146.02, "Time_End": 148.06, "Text": " hey, why don't we start with something else?"}, {"Time_Start": 150.10000000000002, "Time_End": 155.92000000000002, "Text": " And we talked about several different distributions, you know, Red Hat and Debian and stuff like that."}, {"Time_Start": 155.98000000000002, "Time_End": 157.72, "Text": " We ended up going with Debian."}, {"Time_Start": 159.02, "Time_End": 166.02, "Text": " And the reason why we decided to do that was because I've had several problems with Red Hat's,"}, {"Time_Start": 166.64000000000001, "Time_End": 174.76000000000002, "Text": " red hat, and the quality of Debian just seemed to be far and above the best of any distribution that I could find."}, {"Time_Start": 176.02, "Time_End": 178.16, "Text": " their documentation was up to date."}, {"Time_Start": 178.82000000000002, "Time_End": 182.12, "Text": " They had everything about how to make a derivative CD."}, {"Time_Start": 184.12, "Time_End": 186.32000000000002, "Text": " It was just a really high-quality distribution."}, {"Time_Start": 187.16000000000003, "Time_End": 189.08, "Text": " And so we decided to go with that."}, {"Time_Start": 191.16000000000003, "Time_End": 198.28, "Text": " Now, the other thing is, you know, why not just start from scratch and do a completely new distribution."}, {"Time_Start": 198.82000000000002, "Time_End": 200.04000000000002, "Text": " We thought about that as well."}, {"Time_Start": 200.04000000000002, "Time_End": 206.0, "Text": " But in the end, you know, the only real rationale for that would be,"}, {"Time_Start": 206.02, "Time_End": 208.10000000000002, "Text": " just, you know, bragging rights."}, {"Time_Start": 209.08, "Time_End": 211.62, "Text": " You know, we would have to, we'd have to rank our own installer,"}, {"Time_Start": 211.84, "Time_End": 216.98000000000002, "Text": " would have to make our own, you know, CD creation, you know, system and everything."}, {"Time_Start": 217.22, "Time_End": 229.06, "Text": " And so it just really didn't seem to be that big of a problem to, you know, to take one that already"}, {"Time_Start": 229.06, "Time_End": 229.38, "Text": " exists."}, {"Time_Start": 229.48000000000002, "Time_End": 231.18, "Text": " I mean, that's one of the hacker tenants."}, {"Time_Start": 231.28, "Time_End": 232.32000000000002, "Text": " Use what's out there, right?"}, {"Time_Start": 232.32000000000002, "Time_End": 233.44, "Text": " So that's what we did."}, {"Time_Start": 236.02, "Time_End": 239.22, "Text": " All right, so we got a Debian-based OS."}, {"Time_Start": 239.64000000000001, "Time_End": 243.54000000000002, "Text": " We got a tweaked kernel that's still running kernel 2.2."}, {"Time_Start": 243.72, "Time_End": 245.26000000000002, "Text": " That's how old this project is."}, {"Time_Start": 246.74, "Time_End": 251.78, "Text": " Nomad is, you know, I didn't do everything on the project, took all of us to do it."}, {"Time_Start": 252.46, "Time_End": 255.72, "Text": " Nomad was the guy that did most of the kernel work."}, {"Time_Start": 258.22, "Time_End": 260.26, "Text": " So I'll talk about that here."}, {"Time_Start": 260.90000000000003, "Time_End": 263.98, "Text": " We got 2.2.2.25 right now."}, {"Time_Start": 263.98, "Time_End": 265.40000000000003, "Text": " I think we got an update to that."}, {"Time_Start": 266.02, "Time_End": 268.29999999999995, "Text": " The open wall patch, the AppLenix pass,"}, {"Time_Start": 269.0, "Time_End": 272.96, "Text": " trusted path and forest, and we got random IP IDs."}, {"Time_Start": 277.29999999999995, "Time_End": 284.53999999999996, "Text": " We didn't go with the GR security patch because Nomad thought that it would be a little more,"}, {"Time_Start": 285.41999999999996, "Time_End": 290.0, "Text": " they had some cool stuff in there, but Nomad thought that it was more difficult to set up."}, {"Time_Start": 290.29999999999995, "Time_End": 296.0, "Text": " So we ought to stay with what we got here, and later on, move on to that to that if we could."}, {"Time_Start": 296.02, "Time_End": 303.96, "Text": " could. Now I should note that I should note that this isn't the idea for this coming out now"}, {"Time_Start": 303.96, "Time_End": 309.06, "Text": " with a 1.0 release, there's certainly going to be a lot of problems and I'm sure you, I mean,"}, {"Time_Start": 309.06, "Time_End": 316.03999999999996, "Text": " you guys, you're going to find a lot, I'm sure. But the idea is kind of like why we're releasing"}, {"Time_Start": 316.03999999999996, "Time_End": 324.76, "Text": " encrypt and in covert, you know, to get you guys to think and to try and come up with new ideas"}, {"Time_Start": 324.76, "Time_End": 329.42, "Text": " that maybe, you know, avenues we haven't even thought of, of how to lock the box down, how to do things."}, {"Time_Start": 330.82, "Time_End": 341.65999999999997, "Text": " So when I talk about things like why we, for instance, we, let me see here,"}, {"Time_Start": 344.15999999999997, "Time_End": 348.06, "Text": " but why we, one of the goals of the project is we're trying to enforce not just to help not just the"}, {"Time_Start": 348.06, "Time_End": 354.7, "Text": " goal of the project is we're trying to enforce not, to help not just the security of the"}, {"Time_Start": 354.76, "Time_End": 359.26, "Text": " but the security of the users, the privacy of the users as well. That's why we have"}, {"Time_Start": 359.26, "Time_End": 365.76, "Text": " encrypt on there. We're planning on having cryptographic file systems. We don't have it yet."}, {"Time_Start": 365.76, "Time_End": 370.76, "Text": " We want to get this out to you guys so that you can use it, see what's wrong, see what you think can be improved,"}, {"Time_Start": 370.76, "Time_End": 381.76, "Text": " get it back to us, and, you know, away we go. We have some customized applications. Pine, I think, is it still 4.5,6?"}, {"Time_Start": 381.76, "Time_End": 384.76, "Text": " It might have been updated, but we tweaked that."}, {"Time_Start": 384.76, "Time_End": 414.74, "Text": " so that the headers come back all screwy so you you don't know what's sending it and send mail 8 that 12.9 we went with that that if you're familiar with Debbie and they have three mini distributions within itself it's stable testing and unstable currently at the time of this writing send mail 8 that 12 that 9 was an unstable so you may ask why do we use unstable in our shipped shipped version well we found a couple problems with"}, {"Time_Start": 414.76, "Time_End": 423.76, "Text": " security problems with it and nomad felt safer going with send mail 8.12.9 as opposed to what's currently in Debian's."}, {"Time_Start": 423.76, "Time_End": 424.76, "Text": " Yeah."}, {"Time_Start": 428.76, "Time_End": 433.76, "Text": " That's right. The question was why did we use send mail as opposed to something else?"}, {"Time_Start": 433.76, "Time_End": 441.76, "Text": " Debian by default installs EXIM I think and so why do we why do we even bother selling semile by default?"}, {"Time_Start": 441.76, "Time_End": 443.76, "Text": " Well the reason for that is"}, {"Time_Start": 443.76, "Time_End": 448.76, "Text": " because it came down from the mountain on a tablet from a nomad."}, {"Time_Start": 448.76, "Time_End": 450.76, "Text": " He said, we're going to install send mail."}, {"Time_Start": 450.76, "Time_End": 453.76, "Text": " So if you don't like send mail, blame him."}, {"Time_Start": 453.76, "Time_End": 459.76, "Text": " We also, that's what he's most familiar with and I haven't really,"}, {"Time_Start": 459.76, "Time_End": 463.76, "Text": " I'm not really a mailer guy, so I said, you know, what the fuck?"}, {"Time_Start": 463.76, "Time_End": 465.76, "Text": " We'll do that."}, {"Time_Start": 465.76, "Time_End": 473.74, "Text": " The other thing we do is we auto run Bastille by default during the second"}, {"Time_Start": 473.76, "Time_End": 477.76, "Text": " stage install, assuming that you choose to install Bastille at auto runs."}, {"Time_Start": 477.76, "Time_End": 483.76, "Text": " I think we're the only distribution that does that on install by default."}, {"Time_Start": 483.76, "Time_End": 489.76, "Text": " The other things that we got going on is installs and boots up in a lockdown state."}, {"Time_Start": 489.76, "Time_End": 493.76, "Text": " We've done the tests where we install the operating system."}, {"Time_Start": 493.76, "Time_End": 496.76, "Text": " We have another system hooked up. We run NMAP against it repeatedly."}, {"Time_Start": 496.76, "Time_End": 499.76, "Text": " Make sure that everything's locked down and it comes back."}, {"Time_Start": 499.76, "Time_End": 502.76, "Text": " Everything's clean. Lockdown by default. You open a system."}, {"Time_Start": 502.76, "Time_End": 509.76, "Text": " by default, you open it, the administrator opens it up if they feel like they want to have a particular application running."}, {"Time_Start": 509.76, "Time_End": 514.76, "Text": " We have a snort on there that's also installed."}, {"Time_Start": 514.76, "Time_End": 518.76, "Text": " If you go through the task selection and select that."}, {"Time_Start": 518.76, "Time_End": 526.76, "Text": " As I mentioned before, we have Encrypt and Encovert, which Nomad talked about yesterday."}, {"Time_Start": 526.76, "Time_End": 532.74, "Text": " I was going to do this, and I'm really sorry I can't do it, but I was timing it and I was timing it and I"}, {"Time_Start": 532.76, "Time_End": 538.26, "Text": " I would go way over if I tried to do this and explain every step to you guys."}, {"Time_Start": 538.26, "Time_End": 544.76, "Text": " And I'm really sorry, there's just no time to do a live demonstration of it."}, {"Time_Start": 548.76, "Time_End": 552.76, "Text": " Now, you may be wondering, like, how do we maintain that?"}, {"Time_Start": 552.76, "Time_End": 557.76, "Text": " Well, we have a package repository set up, just like Debian."}, {"Time_Start": 557.76, "Time_End": 559.76, "Text": " The system is NMRCOS."}, {"Time_Start": 559.76, "Time_End": 569.76, "Text": " That is also set up in your app set up whenever you install the system."}, {"Time_Start": 569.76, "Time_End": 572.76, "Text": " It should automatically go out there and look for package updates."}, {"Time_Start": 572.76, "Time_End": 574.76, "Text": " We don't have anything out there yet."}, {"Time_Start": 574.76, "Time_End": 580.76, "Text": " When we get back, we're going to throw in encrypt and then convert and a few other goodies."}, {"Time_Start": 580.76, "Time_End": 583.76, "Text": " The thing about AAPT, it lets us graft on to Debian."}, {"Time_Start": 583.76, "Time_End": 588.76, "Text": " We don't have to customize every single application by providing our own app server."}, {"Time_Start": 588.76, "Time_End": 592.76, "Text": " server you can read Debian's version of X windows even though we don't provide it,"}, {"Time_Start": 592.76, "Time_End": 598.26, "Text": " even though we don't may not support it, you know, essentially you have X windows and all the"}, {"Time_Start": 598.26, "Time_End": 600.76, "Text": " associated garbage that goes along with it."}, {"Time_Start": 604.76, "Time_End": 610.76, "Text": " Developing for NM or COS, if you want to develop for EMSCOS, creating a non-cernal package is really simple."}, {"Time_Start": 610.76, "Time_End": 618.74, "Text": " And it's actually already taken, again, by basing it off of Debian, you can already, you can just go to the Debian website and check out"}, {"Time_Start": 618.76, "Time_End": 625.16, "Text": " the Debian developers reference, which tells you exactly how to make a package."}, {"Time_Start": 625.16, "Time_End": 630.52, "Text": " If I had time to do the demonstration, and I'm really sorry, I would have shown you briefly"}, {"Time_Start": 630.52, "Time_End": 632.76, "Text": " how to do that."}, {"Time_Start": 632.76, "Time_End": 635.88, "Text": " Creating the kernel package is very similar."}, {"Time_Start": 635.88, "Time_End": 637.88, "Text": " It's also very easy."}, {"Time_Start": 637.88, "Time_End": 645.3199999999999, "Text": " What you do is you use a Debian supplied tool, a kernel package, that will tell you how to build it"}, {"Time_Start": 645.3199999999999, "Time_End": 648.28, "Text": " and install it and creates a deviant for you."}, {"Time_Start": 648.28, "Time_End": 650.28, "Text": " there's really not a whole lot you got to do."}, {"Time_Start": 650.28, "Time_End": 652.28, "Text": " It's, they made it really easy."}, {"Time_Start": 652.28, "Time_End": 656.28, "Text": " When you distribute your package, you can either send it to us"}, {"Time_Start": 656.28, "Time_End": 662.28, "Text": " or FDP it to the, to your own website."}, {"Time_Start": 662.28, "Time_End": 667.28, "Text": " There's documents out there that tell you how to set up your own app repository if you want,"}, {"Time_Start": 667.28, "Time_End": 672.28, "Text": " so you can have yours, ours, then Debian's,"}, {"Time_Start": 672.28, "Time_End": 675.28, "Text": " and kind of graft onto ours that way."}, {"Time_Start": 675.28, "Time_End": 678.28, "Text": " Grading your own distro, we have,"}, {"Time_Start": 678.28, "Time_End": 684.78, "Text": " actually, the Debian included tools to create a CD require that you have an entire mirror"}, {"Time_Start": 684.78, "Time_End": 691.78, "Text": " of the Debian archive, or at least a section of it, which makes it kind of, makes it extremely"}, {"Time_Start": 691.78, "Time_End": 693.78, "Text": " actually disc intensive."}, {"Time_Start": 693.78, "Time_End": 699.28, "Text": " It's like, I don't know, 80 gig for the whole thing, I think, right now."}, {"Time_Start": 699.28, "Time_End": 705.78, "Text": " We created some tools that allow you to create a CD using a very minimal amount of disk space."}, {"Time_Start": 705.78, "Time_End": 707.78, "Text": " I think currently we're using like,"}, {"Time_Start": 707.78, "Time_End": 712.78, "Text": " maybe 150 meg total for the creation of the C and everything."}, {"Time_Start": 712.78, "Time_End": 715.78, "Text": " That's on there as an NMRC dash CD package."}, {"Time_Start": 715.78, "Time_End": 721.78, "Text": " So when you install that, you can basically learn how to create your own"}, {"Time_Start": 721.78, "Time_End": 726.78, "Text": " NMRCOS based CDs and kind of do what we did to Debian."}, {"Time_Start": 726.78, "Time_End": 729.78, "Text": " Let's see."}, {"Time_Start": 729.78, "Time_End": 731.78, "Text": " Now, there's a lot of future plans for this thing."}, {"Time_Start": 731.78, "Time_End": 736.78, "Text": " Like I said, we're going to implement a lot of things regarding"}, {"Time_Start": 736.78, "Time_End": 743.78, "Text": " of things regarding privacy for the user, not just privacy and security for the admin."}, {"Time_Start": 743.78, "Time_End": 755.78, "Text": " There's been a recent talk in the Red Hat community about opening up the development process for Red Hat Linux."}, {"Time_Start": 755.78, "Time_End": 763.78, "Text": " And I've been playing around with that and I've got a semi-working copy of an RPM Red Hat-based version of this."}, {"Time_Start": 763.78, "Time_End": 766.78, "Text": " And so we were talking about having, you know,"}, {"Time_Start": 766.78, "Time_End": 773.78, "Text": " are out there so that people that want to use an RPM or Red Hat-based distro can do that as well."}, {"Time_Start": 773.78, "Time_End": 782.78, "Text": " And now I'm going to open this up to questions and follow-up because I'm sure you guys have quite a few."}, {"Time_Start": 782.78, "Time_End": 786.78, "Text": " Anything?"}, {"Time_Start": 786.78, "Time_End": 790.78, "Text": " Yeah."}, {"Time_Start": 796.78, "Time_End": 798.78, "Text": " I'm sorry, I can't hear you."}, {"Time_Start": 798.78, "Time_End": 801.78, "Text": " Let me go back there."}, {"Time_Start": 801.78, "Time_End": 807.78, "Text": " Oh, yeah."}, {"Time_Start": 807.78, "Time_End": 811.78, "Text": " Can I get a bit more specific about trusted path and other kernel mods?"}, {"Time_Start": 811.78, "Time_End": 819.78, "Text": " As I said, Nomad was the primary developer on kernel mods and stuff like that, so I'm going to let him answer that, if that's all right."}, {"Time_Start": 819.78, "Time_End": 821.78, "Text": " Hey."}, {"Time_Start": 821.78, "Time_End": 825.78, "Text": " Basically on the trusted path when essentially what it does is in the kernel and enforcing."}, {"Time_Start": 825.78, "Time_End": 832.78, "Text": " in the kernel that enforces that when you run an executable, it has to be owned by root."}, {"Time_Start": 832.78, "Time_End": 837.78, "Text": " It has to not be world or group writable. It has to be in a directory owned by roots that"}, {"Time_Start": 837.78, "Time_End": 842.78, "Text": " is not world or group writable. And this applies even to root. That way as someone gets on your"}, {"Time_Start": 842.78, "Time_End": 848.78, "Text": " box and puts some code in there and for some reason you've altered your path to actually execute"}, {"Time_Start": 848.78, "Time_End": 853.78, "Text": " from your current directory first, for example, which would be stupid. But if you did that,"}, {"Time_Start": 853.78, "Time_End": 855.76, "Text": " the thing has to be owned by route."}, {"Time_Start": 855.78, "Time_End": 862.78, "Text": " whole idea is that if someone pops an account on the system, then they're going to have to,"}, {"Time_Start": 862.78, "Time_End": 865.78, "Text": " they're going to have to get routes to get their executable to run."}, {"Time_Start": 865.78, "Time_End": 869.78, "Text": " That doesn't kill everything. I know someone's going to say, does it handle the,"}, {"Time_Start": 869.78, "Time_End": 873.78, "Text": " like say, a Pearl Dash E and then put your gobbledygook in there."}, {"Time_Start": 873.78, "Time_End": 879.78, "Text": " No, it doesn't take care of that, but it does at least kind of, you know, raise the bar a little bit."}, {"Time_Start": 879.78, "Time_End": 884.78, "Text": " As far as the other mods go, the main thing is the open wall patch as well as, um, the open wall patch,"}, {"Time_Start": 884.78, "Time_End": 890.78, "Text": " as well as, I don't know how many people are familiar with the HAP Linux patch. Those are the two main things."}, {"Time_Start": 890.78, "Time_End": 900.78, "Text": " The HAP Linux patch mainly does some stuff for charrooting and a little bit better like logging during a P tracing and stuff like that."}, {"Time_Start": 900.78, "Time_End": 903.78, "Text": " A little more control over what's going on there."}, {"Time_Start": 907.78, "Time_End": 910.78, "Text": " The HAP Linux patch, where is it from?"}, {"Time_Start": 910.78, "Time_End": 913.78, "Text": " From some guy named Hank."}, {"Time_Start": 913.78, "Time_End": 914.78, "Text": " I can't."}, {"Time_Start": 914.78, "Time_End": 931.78, "Text": " remember the URL off the top of my head. Google is your friend. If you look for HAPLinix, you'll find the patch. I can't, it's like Amesgroup.com slash something or other. I can't remember the URL at top my head."}, {"Time_Start": 931.78, "Time_End": 932.78, "Text": " So."}, {"Time_Start": 940.78, "Time_End": 944.76, "Text": " Yeah, we looked at the trusted Debbie project. There's other secure versions of"}, {"Time_Start": 944.78, "Time_End": 947.66, "Text": " Debian out there, trusted, and some other things like that."}, {"Time_Start": 947.72, "Time_End": 948.56, "Text": " Let me go up here."}, {"Time_Start": 949.14, "Time_End": 953.68, "Text": " And we looked at that, and yeah, you may wonder, why didn't we just, you know, why didn't we just,"}, {"Time_Start": 954.06, "Time_End": 956.36, "Text": " you know, join the Debian project and contribute that way?"}, {"Time_Start": 956.4399999999999, "Time_End": 959.04, "Text": " Why do we have to create our own distribution?"}, {"Time_Start": 960.26, "Time_End": 964.72, "Text": " Well, the reason for that is, a couple reasons."}, {"Time_Start": 964.9599999999999, "Time_End": 971.16, "Text": " A, a lot of us are extremely paranoid, and we don't want to join any other project."}, {"Time_Start": 971.56, "Time_End": 974.76, "Text": " Debian, I think, if I remember correctly, requires that you actually."}, {"Time_Start": 974.78, "Time_End": 980.1, "Text": " actually physically meet someone in order to get your key signed and everything."}, {"Time_Start": 980.9, "Time_End": 985.5, "Text": " There's a lot of us that just really frightens us."}, {"Time_Start": 987.4599999999999, "Time_End": 991.66, "Text": " The other thing is, the reason why is because there's been some differences."}, {"Time_Start": 992.5799999999999, "Time_End": 999.92, "Text": " One of the things I talked about yesterday, I forgot to mention today, is that something as simple as clearing the screen"}, {"Time_Start": 999.92, "Time_End": 1004.76, "Text": " whenever you log out was a difference between what we wanted and what"}, {"Time_Start": 1004.78, "Time_End": 1010.9599999999999, "Text": " that Debian wanted. The latest Debian list, the mailing list archive that I saw"}, {"Time_Start": 1010.9599999999999, "Time_End": 1016.88, "Text": " was that they decided that by default, BAS should not clear the screen upon logout."}, {"Time_Start": 1017.5799999999999, "Time_End": 1023.6999999999999, "Text": " Now, I agree that, you know, security through obscurity never works. However, you know, if we're"}, {"Time_Start": 1023.6999999999999, "Time_End": 1028.72, "Text": " targeting this for people that may not know a lot about security, it's just helps. You know,"}, {"Time_Start": 1028.76, "Time_End": 1033.42, "Text": " it doesn't hurt. You know, if they don't know what they're doing when they leave and they leave"}, {"Time_Start": 1033.42, "Time_End": 1038.0600000000002, "Text": " all the crap that they've been doing, they could leave something there that could later on"}, {"Time_Start": 1038.0600000000002, "Time_End": 1044.76, "Text": " be used to break into the system. So something as simple as that allows, you know, made us kind of"}, {"Time_Start": 1044.76, "Time_End": 1053.3000000000002, "Text": " think, you know, why don't we just go our own way? We'll graft on the Debian and we'll have"}, {"Time_Start": 1053.3000000000002, "Time_End": 1057.8600000000001, "Text": " complete control over what we want to override and how we want to produce this."}, {"Time_Start": 1063.42, "Time_End": 1069.3400000000001, "Text": " What are we used for a firewall? That's currently IP chains, 2-2 kernel, IP chains."}, {"Time_Start": 1070.0600000000002, "Time_End": 1075.18, "Text": " So that's what we're using there. And in the, in the install, there's an actual thing where it's"}, {"Time_Start": 1075.18, "Time_End": 1077.42, "Text": " where it sets it up and all that for you."}, {"Time_Start": 1079.42, "Time_End": 1080.0600000000002, "Text": " Yeah."}, {"Time_Start": 1093.42, "Time_End": 1098.66, "Text": " G.S. Variant? Okay. Well, cool. Thanks, man. I appreciate it. We'll take a look at that."}, {"Time_Start": 1102.38, "Time_End": 1113.88, "Text": " Okay. Well, let me talk to you after this, and we'll get, we'll get. Okay. Okay. Cool. Thanks."}, {"Time_Start": 1116.04, "Time_End": 1123.4, "Text": " He was saying that there's a Gen 2 kernel that has most of the features that we have in there,"}, {"Time_Start": 1123.42, "Time_End": 1132.0, "Text": " and it's a lot faster, the 01 batch scheduler, a whole bunch of other shit, so."}, {"Time_Start": 1136.0, "Time_End": 1138.8400000000001, "Text": " So take a look at Gen 2. All right. Yeah. Cool. We'll do that."}, {"Time_Start": 1144.1200000000001, "Time_End": 1153.0600000000002, "Text": " Really? I am not aware of that. I'm sorry. I didn't know. We have some CDs to give out. We have some CDs to give out."}, {"Time_Start": 1153.42, "Time_End": 1161.18, "Text": " and I think we tested every single one of them to make sure they boot. So I'll make sure to get you one, okay?"}, {"Time_Start": 1165.26, "Time_End": 1170.92, "Text": " Do we provide source packages?"}, {"Time_Start": 1173.8000000000002, "Time_End": 1177.76, "Text": " Deb source packages? Do we provide Deb source packages? Do we provide Deb source packages?"}, {"Time_Start": 1178.5600000000002, "Time_End": 1183.4, "Text": " They are not on the CD. We're uploading them to NMR."}, {"Time_Start": 1183.42, "Time_End": 1189.46, "Text": " www.org so you can app get them just like all the other stuff. So that that should be done."}, {"Time_Start": 1189.46, "Time_End": 1193.8000000000002, "Text": " We tried we had some problems accessing it from here, so we're going to do it when we get back."}, {"Time_Start": 1195.72, "Time_End": 1196.14, "Text": " Yes?"}, {"Time_Start": 1200.46, "Time_End": 1202.02, "Text": " Stag in the file system?"}, {"Time_Start": 1204.9, "Time_End": 1206.22, "Text": " Like a rubber hose."}, {"Time_Start": 1213.42, "Time_End": 1217.74, "Text": " Why not? I mean, if I don't stand right, the end, that should be right?"}]}