{"segments": [{"Time_Start": 0.0, "Time_End": 3.2, "Text": " The Rock!"}, {"Time_Start": 30.0, "Time_End": 36.0, "Text": " Email."}, {"Time_Start": 60.0, "Time_End": 63.66, "Text": " addresses up. Somebody asked me if I accept emails. I love emails. So if you have any"}, {"Time_Start": 63.66, "Time_End": 66.42, "Text": " question when talking about anything, feel free. I mean I enjoy it. I like this"}, {"Time_Start": 66.42, "Time_End": 72.3, "Text": " stuff. I enjoy what I do. So this is styled. Cybercrime"}, {"Time_Start": 72.3, "Time_End": 77.94, "Text": " challenges for law enforcement. This is something that that I've been"}, {"Time_Start": 77.94, "Time_End": 82.68, "Text": " working on quite a bit, several things I've been working on, and basically I guess"}, {"Time_Start": 82.68, "Time_End": 89.98, "Text": " the theme is that cybercrime is different. It's different in certain ways. It's"}, {"Time_Start": 90.0, "Time_End": 95.4, "Text": " different kind of tricky, intangible ways. And the tricky intangible ways pose problems for"}, {"Time_Start": 95.4, "Time_End": 100.06, "Text": " the way we have conducted law enforcement and the criminal law. And I want to talk about that"}, {"Time_Start": 100.06, "Time_End": 104.88, "Text": " and illustrate some of the ways that it's different. In doing that, I really don't have an"}, {"Time_Start": 104.88, "Time_End": 110.76, "Text": " agenda. I mean, what I find interesting is how technology impacts on a lot of our assumptions"}, {"Time_Start": 110.76, "Time_End": 117.06, "Text": " in law. Law tends to be conservative. It's traditional. And I think that of all the areas of"}, {"Time_Start": 117.06, "Time_End": 119.9, "Text": " law, criminal law is probably the most primitive, the oldest,"}, {"Time_Start": 120.0, "Time_End": 124.18, "Text": " because if you think about it, it deals with, it has dealt, used to deal with."}, {"Time_Start": 124.56, "Time_End": 127.72, "Text": " You know, really basic things. I walk up to you and hurt you, something like that."}, {"Time_Start": 127.76, "Time_End": 131.48, "Text": " And that's going to do with all these technological things, and we've got a lot of lawyers and judges"}, {"Time_Start": 131.48, "Time_End": 136.24, "Text": " who aren't particularly adept with it, and so we're trying to sort it out. So let's talk."}, {"Time_Start": 137.78, "Time_End": 138.92000000000002, "Text": " Well, that's what you just said."}, {"Time_Start": 140.18, "Time_End": 149.88, "Text": " That what you have for criminal law is you have a system that evolved to deal with bank robberies and murders and homicides and rapes and thefts"}, {"Time_Start": 150.0, "Time_End": 153.98, "Text": " those kinds of things, you know, what I call real-world crime, which is certain characteristics"}, {"Time_Start": 153.98, "Time_End": 157.84, "Text": " that we'll talk about that you don't necessarily have in cybercrime. So we'll get to that."}, {"Time_Start": 158.94, "Time_End": 164.88, "Text": " Cybercrime, computer-mediated crime, technologically mediated crime, technological"}, {"Time_Start": 164.88, "Time_End": 169.9, "Text": " crime, whatever you want to call it, is different. It doesn't operate under some of the same"}, {"Time_Start": 169.9, "Time_End": 176.02, "Text": " constraints, and that can cause issues. And we're going to do an illustration here, and we'll progress on"}, {"Time_Start": 176.02, "Time_End": 179.42000000000002, "Text": " to some more. Here's one. Fept. This is such a simple one."}, {"Time_Start": 180.0, "Time_End": 186.7, "Text": " Fept. Real-world theft. Possession of property shifts completely from A to B. A had it, B now has it. I take your laptop."}, {"Time_Start": 187.2, "Time_End": 192.96, "Text": " Real world theft. I walk up to you. I take your laptop. I have it. You don't. It's a zero-sum concept."}, {"Time_Start": 193.44, "Time_End": 194.42, "Text": " Yeah, that's the way it's always been."}, {"Time_Start": 196.38, "Time_End": 205.58, "Text": " Cyber theft can happen like that, but it can also happen that property data is copied. It's not everybody has it. Both people have it."}, {"Time_Start": 205.58, "Time_End": 209.26, "Text": " And that can raise issues in terms of the legal system. Here's a case from Oregon."}, {"Time_Start": 210.0, "Time_End": 212.84, "Text": " A gentleman named Randall Schwartz worked for Intel."}, {"Time_Start": 212.84, "Time_End": 218.12, "Text": " And for reasons I really don't know, he became aggravated with Intel."}, {"Time_Start": 218.12, "Time_End": 223.04, "Text": " And of course, of being aggravated with his employer, he apparently copied a file that"}, {"Time_Start": 223.04, "Time_End": 224.96, "Text": " contained passwords."}, {"Time_Start": 224.96, "Time_End": 229.0, "Text": " He was charged with computer theft for copying the file that contained passwords."}, {"Time_Start": 229.0, "Time_End": 232.0, "Text": " And he said, come on now."}, {"Time_Start": 232.0, "Time_End": 234.96, "Text": " Theft is defining someone of the possession use of their property."}, {"Time_Start": 234.96, "Time_End": 237.88, "Text": " Theft is taking away the laptop. I didn't take anything away."}, {"Time_Start": 237.88, "Time_End": 239.72, "Text": " Intel still has the password file."}, {"Time_Start": 240.0, "Time_End": 246.56, "Text": " There's no theft, which is true in terms of traditional legal principles, but we've had to, we've had to expand that out."}, {"Time_Start": 246.66, "Time_End": 252.64, "Text": " Now in this country, we've done a pretty good job at state and federal level of expanding out on some things like that."}, {"Time_Start": 252.72, "Time_End": 254.4, "Text": " Intangible property, this kind of theft."}, {"Time_Start": 254.94, "Time_End": 263.64, "Text": " You still have problems with that in some other countries, which is something I'll get to, because cybercrime is international, and that creates issues."}, {"Time_Start": 265.14, "Time_End": 267.72, "Text": " Here, this is the flip side of what I just did."}, {"Time_Start": 269.18, "Time_End": 269.98, "Text": " First issue."}, {"Time_Start": 270.0, "Time_End": 272.14, "Text": " is copying files theft?"}, {"Time_Start": 272.44, "Time_End": 274.92, "Text": " Randall Schwartz copying the password file a theft."}, {"Time_Start": 275.06, "Time_End": 278.24, "Text": " It's not theft in that sense, but it's..."}, {"Time_Start": 278.24, "Time_End": 282.16, "Text": " The idea being that Intel lost something, that there's a dilution of their property,"}, {"Time_Start": 282.3, "Time_End": 283.88, "Text": " dilution of the value that they lost something."}, {"Time_Start": 284.34, "Time_End": 287.5, "Text": " Here's another place where copying files comes up."}, {"Time_Start": 287.62, "Time_End": 287.96, "Text": " Seizure."}, {"Time_Start": 288.54, "Time_End": 290.22, "Text": " Fourth Amendment, you probably know."}, {"Time_Start": 290.32, "Time_End": 293.64, "Text": " Fourth Amendment, you have a right to be free from unreasonable searches and seizures."}, {"Time_Start": 294.4, "Time_End": 296.98, "Text": " If you don't have a search or seizure, you don't have a Fourth Amendment."}, {"Time_Start": 296.98, "Time_End": 299.98, "Text": " It's not a Fourth Amendment search for police officer to drive down the..."}, {"Time_Start": 300.0, "Time_End": 301.86, "Text": " street and videotaping because it's not private."}, {"Time_Start": 302.0, "Time_End": 303.64, "Text": " It's not a search. All right."}, {"Time_Start": 304.14, "Time_End": 307.6, "Text": " You've got to have a search or seizure to get into the window, and that means that if you get in"}, {"Time_Start": 307.6, "Time_End": 310.32, "Text": " the window, then they have to use a warrant. They have to comply with the Fourth Amendment."}, {"Time_Start": 310.44, "Time_End": 312.58, "Text": " If you're outside the Fourth Amendment, no warrant, no nothing."}, {"Time_Start": 312.72, "Time_End": 315.1, "Text": " You videotape on the street. You don't need a warrant. It's not a search."}, {"Time_Start": 315.84, "Time_End": 320.16, "Text": " Here, copying files. A question that is not resolved."}, {"Time_Start": 321.06, "Time_End": 324.22, "Text": " That's been addressed in a federal case. I'm going to talk about a little bit later,"}, {"Time_Start": 324.22, "Time_End": 326.28, "Text": " but I think that federal case is really wrong."}, {"Time_Start": 327.7, "Time_End": 329.98, "Text": " The question that has not been resolved is whether or not"}, {"Time_Start": 330.0, "Time_End": 333.28, "Text": " copying files is a seizure, and that's important."}, {"Time_Start": 334.0, "Time_End": 337.84, "Text": " Because if copying files is a seizure, it means the Fourth Amendment is implicated,"}, {"Time_Start": 337.96, "Time_End": 343.02, "Text": " it means the government can't do it without a warrant or an exception to the warrant requirement."}, {"Time_Start": 343.54, "Time_End": 349.44, "Text": " If it's not, if it's not a seizure, none of that kicks in."}, {"Time_Start": 350.02, "Time_End": 354.44, "Text": " There is a federal case that I'll talk about in a bit that handled this issue badly."}, {"Time_Start": 355.0, "Time_End": 359.98, "Text": " This is an issue that's on appeal in a case out of Illinois, where a fellow took his"}, {"Time_Start": 360.0, "Time_End": 364.66, "Text": " computer into the repair shop to have something done. They were authorized to look at"}, {"Time_Start": 364.66, "Time_End": 368.2, "Text": " one file. They looked at one file. They saw something that looked like child porn. They called"}, {"Time_Start": 368.2, "Time_End": 374.32, "Text": " the cops. The cops came in. The cops copied everything on the hard drive. On the"}, {"Time_Start": 374.32, "Time_End": 377.16, "Text": " motion to understand that the motion was suppressed and the officer was asked, why"}, {"Time_Start": 377.16, "Time_End": 384.44, "Text": " did you get a warrant? He said, I don't like to do that. It takes time. Oh, of course. Why would you"}, {"Time_Start": 384.44, "Time_End": 389.34, "Text": " do that? Question being, which becomes critical there, they copied the files and they did other"}, {"Time_Start": 389.34000000000003, "Time_End": 394.34000000000003, "Text": " things. It comes up in the other case. If copying the files is a nothing, if it's not a seizure, it's okay."}, {"Time_Start": 395.22, "Time_End": 399.48, "Text": " I think it has to be a seizure. I think we have to bring that within the Fourth Amendment,"}, {"Time_Start": 399.58000000000004, "Time_End": 406.06000000000006, "Text": " which why I've done some work on the case in Illinois. But it is an example. It is another example of how"}, {"Time_Start": 406.06000000000006, "Time_End": 412.12, "Text": " the law has to figure out how to deal with these technical issues, and most lawyers are not technical people."}, {"Time_Start": 413.66, "Time_End": 419.32000000000005, "Text": " Someone laughed. I mean, this is just a version of that. This is the same kind of thing. Nikki Scarf, I don't know if you"}, {"Time_Start": 419.34000000000003, "Time_End": 426.22, "Text": " You know, Nikki Scarf, a low-level gangster, New Jersey, comes from an eminent prime family."}, {"Time_Start": 426.86, "Time_End": 431.42, "Text": " The FBI executed a warrant in his office. They seized files from his computers. They went through"}, {"Time_Start": 431.42, "Time_End": 435.3, "Text": " the files in his computers. They found one that was encrypted. They were very suspicious about what"}, {"Time_Start": 435.3, "Time_End": 441.02000000000004, "Text": " was in the encrypted file. They used a keystroke wager, pursuant to a warrant to go in and get his"}, {"Time_Start": 441.02000000000004, "Time_End": 445.48, "Text": " passphrase so they can go into the file. I mean, in one of the issues there in their application for"}, {"Time_Start": 445.48, "Time_End": 448.90000000000003, "Text": " the warrant, they basically concede that copying is a seizure."}, {"Time_Start": 449.34000000000003, "Time_End": 450.3, "Text": " Let us move on."}, {"Time_Start": 451.8, "Time_End": 461.92, "Text": " Now, this, this, the way lawyers think about, we talk about cyber crimes."}, {"Time_Start": 462.42, "Time_End": 465.20000000000005, "Text": " You will typically see them divided into three categories."}, {"Time_Start": 465.34000000000003, "Time_End": 466.96000000000004, "Text": " Crimes for the computer is the target."}, {"Time_Start": 467.50000000000006, "Time_End": 468.92, "Text": " Crimes through the computer is a tool."}, {"Time_Start": 469.36, "Time_End": 471.96000000000004, "Text": " Primes where the computer plays an incidental role."}, {"Time_Start": 472.46000000000004, "Time_End": 478.16, "Text": " This distinction comes from the Department of Justice has a, on their website,"}, {"Time_Start": 478.16, "Time_End": 478.90000000000003, "Text": " the C-Sips."}, {"Time_Start": 479.34000000000003, "Time_End": 482.68, "Text": " which is the Computer Crime, Intellectual Property Section, has guidelines for searching"}, {"Time_Start": 482.68, "Time_End": 483.58000000000004, "Text": " and seizing computers."}, {"Time_Start": 483.68, "Time_End": 486.12, "Text": " If you haven't looked at it, you might want to look at it sometime because they're pretty"}, {"Time_Start": 486.12, "Time_End": 490.88000000000005, "Text": " instructive, because in the Department of Justice talking about what you have to do to be able"}, {"Time_Start": 490.88000000000005, "Time_End": 494.6, "Text": " to search and seize computers pursuant to the Fourth Amendment Act for other things."}, {"Time_Start": 495.46000000000004, "Time_End": 499.54, "Text": " This comes from those guidelines, and I think it's not a bad way to talk about it."}, {"Time_Start": 499.54, "Time_End": 503.86, "Text": " It's not a really great distinction because sometimes you can have these things intermingled."}, {"Time_Start": 504.3, "Time_End": 508.64000000000004, "Text": " But I like to use it because I think it illustrates, I can use it to illustrate some differences in"}, {"Time_Start": 508.64, "Time_End": 510.84, "Text": " legal issues and cyber crime."}, {"Time_Start": 512.8, "Time_End": 514.98, "Text": " Now, the computer is target."}, {"Time_Start": 516.04, "Time_End": 521.74, "Text": " First up, what I've done is put some kinds of ways computers can be targets up there,"}, {"Time_Start": 521.8199999999999, "Time_End": 523.68, "Text": " and I'm using two words, I'm using hacking and cracking,"}, {"Time_Start": 524.04, "Time_End": 525.04, "Text": " because I don't know what else to use."}, {"Time_Start": 526.24, "Time_End": 529.14, "Text": " I'm not using hacking pejoratively."}, {"Time_Start": 529.4399999999999, "Time_End": 531.46, "Text": " If you notice in parentheses, I've got trespass."}, {"Time_Start": 531.84, "Time_End": 533.7, "Text": " Hacking for the law is a form of trespass."}, {"Time_Start": 533.8, "Time_End": 535.78, "Text": " Hacking means that you've gone somewhere you're not supposed to be."}, {"Time_Start": 536.08, "Time_End": 538.42, "Text": " You've been physically gone there, but you've accessed it."}, {"Time_Start": 538.64, "Time_End": 542.3199999999999, "Text": " And so, for lack of a better term, I'm using hacking for that."}, {"Time_Start": 542.42, "Time_End": 544.06, "Text": " Cracking, which could be aggravated hacking."}, {"Time_Start": 544.16, "Time_End": 545.8199999999999, "Text": " You'll see that in some criminal statutes."}, {"Time_Start": 546.3, "Time_End": 549.72, "Text": " I'm using that as, it is the equivalent of real-world burglary."}, {"Time_Start": 549.84, "Time_End": 552.4399999999999, "Text": " Burglary is you break in somewhere to do something bad."}, {"Time_Start": 552.9399999999999, "Time_End": 555.9, "Text": " You break into steel, you break into hurt, you break in to do something."}, {"Time_Start": 556.0, "Time_End": 556.84, "Text": " So it's kind of like burglary."}, {"Time_Start": 558.1, "Time_End": 562.88, "Text": " Malicious code, we don't quite have anything analog to that."}, {"Time_Start": 562.98, "Time_End": 565.6, "Text": " Website deface, much kind of like vandalism, denial of service attacks,"}, {"Time_Start": 565.6, "Time_End": 568.62, "Text": " which doesn't have anything after it because it doesn't have any analog in real estate."}, {"Time_Start": 568.64, "Time_End": 569.3, "Text": " real-world crime."}, {"Time_Start": 569.38, "Time_End": 574.08, "Text": " Let me talk a little bit about targets, which are the less interesting."}, {"Time_Start": 574.5, "Time_End": 578.4399999999999, "Text": " Oh, this is a guy who worked for a company called Lance."}, {"Time_Start": 578.54, "Time_End": 579.72, "Text": " They make little snacks."}, {"Time_Start": 581.22, "Time_End": 583.78, "Text": " He was supposed to develop a software program for them, like Randall Schwartz."}, {"Time_Start": 583.84, "Time_End": 584.4, "Text": " They did something."}, {"Time_Start": 584.5, "Time_End": 585.3199999999999, "Text": " They had a misunderstanding."}, {"Time_Start": 585.42, "Time_End": 586.5, "Text": " He got unhappy with them."}, {"Time_Start": 587.08, "Time_End": 590.52, "Text": " And because of that, he planted a logic bomb in the program."}, {"Time_Start": 590.88, "Time_End": 591.6, "Text": " He triggered it."}, {"Time_Start": 591.6, "Time_End": 594.14, "Text": " It shut down handheld computers cost them over $100,000."}, {"Time_Start": 594.68, "Time_End": 595.84, "Text": " I do this one a lot."}, {"Time_Start": 596.4, "Time_End": 598.62, "Text": " If you're not something, you would be surprised."}, {"Time_Start": 598.64, "Time_End": 604.58, "Text": " that often people that I talk to law enforcement government private sector people"}, {"Time_Start": 604.58, "Time_End": 608.96, "Text": " don't think about the insider threat they think about threats coming from outside so"}, {"Time_Start": 608.96, "Time_End": 617.88, "Text": " this is a classic insider threat this one I use it denial of services you know"}, {"Time_Start": 617.88, "Time_End": 622.22, "Text": " this is the classic one we have Mafia boy taking the rap for this pleading"}, {"Time_Start": 622.22, "Time_End": 628.42, "Text": " guilty for this attack it's a denial service it's an example denial service doesn't fit in any of our"}, {"Time_Start": 628.64, "Time_End": 632.6, "Text": " categories denial of services not theft it's not extortion it's not trespass it"}, {"Time_Start": 632.6, "Time_End": 637.56, "Text": " doesn't fit it doesn't fit nicely into any of our categories so it's a new crime it's"}, {"Time_Start": 637.56, "Time_End": 641.54, "Text": " something we have to come up with a new offense for the other reason I do this one"}, {"Time_Start": 641.54, "Time_End": 647.54, "Text": " estimated $1.7 billion in damage we don't have any idea about damage assessments"}, {"Time_Start": 647.54, "Time_End": 651.92, "Text": " we're really this is this is something that's fluid you see a lot of these assessments I put"}, {"Time_Start": 651.92, "Time_End": 656.4, "Text": " to figure up that's the figure that was reported we have a lot of I do a bit more"}, {"Time_Start": 656.4, "Time_End": 658.62, "Text": " with this later we have a lot in terms of cybercrime statistics"}, {"Time_Start": 658.64, "Time_End": 668.36, "Text": " we have a lot of uncertainty to the ones these are the ones now computers"}, {"Time_Start": 668.36, "Time_End": 672.92, "Text": " target we've got the break-ins that the denial service we've got malicious code"}, {"Time_Start": 672.92, "Time_End": 678.3199999999999, "Text": " we've got those kinds of things you're going at the computer denial service is"}, {"Time_Start": 678.3199999999999, "Time_End": 681.08, "Text": " different those are a little different you know we can make them sound like"}, {"Time_Start": 681.08, "Time_End": 685.88, "Text": " trespass and burg look a little different this this is where this is the growth"}, {"Time_Start": 685.88, "Time_End": 688.62, "Text": " industry this is where we see a lot of things"}, {"Time_Start": 688.64, "Time_End": 692.12, "Text": " happening the computer being used as a tool to commit all kinds of"}, {"Time_Start": 692.12, "Time_End": 696.98, "Text": " neat kinds of crime we have not maybe you have I have not yet discovered a"}, {"Time_Start": 696.98, "Time_End": 700.64, "Text": " documented case of cyber homicide but computers are used to commit fraud theft"}, {"Time_Start": 700.64, "Time_End": 706.02, "Text": " extortion stalking child porn forgery etc etc etc just like a gun"}, {"Time_Start": 706.02, "Time_End": 713.3, "Text": " computers used as a weapon to commit the crimes now on the one hand on the one hand that"}, {"Time_Start": 713.3, "Time_End": 717.92, "Text": " may not cause problems sometimes it doesn't cause problems on the other hand sometimes"}, {"Time_Start": 717.92, "Time_End": 722.88, "Text": " it can cause us real problems in the legal system at this point I'm just"}, {"Time_Start": 722.88, "Time_End": 726.66, "Text": " talking about us figuring out what the heck is the crime was there a crime what was the"}, {"Time_Start": 726.66, "Time_End": 732.3399999999999, "Text": " crime we're going to talk about procedural issues in a minute so here it's just used as a tool"}, {"Time_Start": 732.3399999999999, "Time_End": 741.14, "Text": " to commit an existing crime when I see cybercrime is different there's a few"}, {"Time_Start": 741.14, "Time_End": 745.5, "Text": " differences on the targets these are just people doing the same things they've done"}, {"Time_Start": 745.5, "Time_End": 747.78, "Text": " to people for years and years and years but they're using the computer"}, {"Time_Start": 747.92, "Time_End": 751.9399999999999, "Text": " going to continue to see this I think perhaps morphing into new forms I"}, {"Time_Start": 751.9399999999999, "Time_End": 756.38, "Text": " think we may see some different varieties here the only reason I do this one"}, {"Time_Start": 756.38, "Time_End": 761.36, "Text": " Levin took responsibility for siphoning money out of Citibank and putting it in"}, {"Time_Start": 761.36, "Time_End": 764.5999999999999, "Text": " foreign accounts he's sentenced this is computer theft but it's not like Randall"}, {"Time_Start": 764.5999999999999, "Time_End": 769.9399999999999, "Text": " Schwartz this is the old zero-sum kind of theft this is transferring money out of an"}, {"Time_Start": 769.9399999999999, "Time_End": 772.92, "Text": " account this is using the computer"}, {"Time_Start": 772.92, "Time_End": 777.9, "Text": " those problems worth in terms of the substance of the law"}, {"Time_Start": 777.9200000000001, "Time_End": 781.3600000000001, "Text": " but it's going to get us into procedural issues which we'll do in a minute."}, {"Time_Start": 783.3600000000001, "Time_End": 787.46, "Text": " Identity theft, this one you probably, I'm sure you read about the Abraham"}, {"Time_Start": 787.46, "Time_End": 793.4000000000001, "Text": " Abdallah stole in quotes identities of various people and steal them. Identity"}, {"Time_Start": 793.4000000000001, "Time_End": 797.84, "Text": " theft, I don't take your identity and you don't have it anymore so now I'm you and you're"}, {"Time_Start": 797.84, "Time_End": 803.84, "Text": " just not really anybody. It's a form of fraud and it's not a new crime. I mean it's a"}, {"Time_Start": 803.84, "Time_End": 807.9000000000001, "Text": " different way of doing but it's not a new kind of it's not a new kind of crime."}, {"Time_Start": 807.9200000000001, "Time_End": 812.72, "Text": " rhyme. And you know, you can use public library doesn't require a lot of"}, {"Time_Start": 812.72, "Time_End": 820.1600000000001, "Text": " sophistication. This one I like. Some of these slides are up here just because I"}, {"Time_Start": 820.1600000000001, "Time_End": 826.1600000000001, "Text": " like them. Just because I think it's funny. This is a dentist named Bruce Leschou."}, {"Time_Start": 826.1600000000001, "Time_End": 831.6800000000001, "Text": " It was a very trusting person. Bruce Lechow wanted to buy some kind of a BMW. I don't"}, {"Time_Start": 831.6800000000001, "Time_End": 835.4000000000001, "Text": " know anything about BMWs, but it's a special BMWs, and you can only buy it, I guess, in"}, {"Time_Start": 835.4000000000001, "Time_End": 837.9000000000001, "Text": " Germany. And Bruce really, really, really wanted this B.M."}, {"Time_Start": 837.9200000000001, "Time_End": 842.3000000000001, "Text": " and so he was dealing with someone in Germany to buy the BMW and they said hey"}, {"Time_Start": 842.3000000000001, "Time_End": 848.48, "Text": " Bruce you're going to have to send us 55,000 for the BMW and Bruce said oh sure where"}, {"Time_Start": 848.48, "Time_End": 851.48, "Text": " should I send it basically and they said we should send it to this website this"}, {"Time_Start": 851.48, "Time_End": 855.08, "Text": " escrow site they'll take good care of it and Bruce sends it to the escrow site and what"}, {"Time_Start": 855.08, "Time_End": 864.7400000000001, "Text": " happens BMW no BMW no 55,000 we have a sadder but hopefully a wiser Bruce who's going to"}, {"Time_Start": 864.7400000000001, "Time_End": 867.5600000000001, "Text": " have to fill a lot of teeth to get his money back"}, {"Time_Start": 867.9200000000001, "Time_End": 872.2400000000001, "Text": " This one is another one I like."}, {"Time_Start": 873.3600000000001, "Time_End": 874.3000000000001, "Text": " This was a year or so ago."}, {"Time_Start": 875.2800000000001, "Time_End": 879.1, "Text": " Somebody hacks into an online casino and fixes it so that everybody became crap since"}, {"Time_Start": 879.1, "Time_End": 879.8600000000001, "Text": " the last couldn't lose."}, {"Time_Start": 882.48, "Time_End": 883.3000000000001, "Text": " Isn't that great?"}, {"Time_Start": 884.32, "Time_End": 888.5000000000001, "Text": " I call this one the Robin Hood. I mean, Robin Hood just drops in the casino and says,"}, {"Time_Start": 888.8600000000001, "Time_End": 890.2600000000001, "Text": " hey, everybody, have a good time."}, {"Time_Start": 892.9000000000001, "Time_End": 897.7600000000001, "Text": " During the time that the fix was in, that the thing was working, players won $1.9 million."}, {"Time_Start": 897.9200000000001, "Time_End": 899.2, "Text": " and they actually paid up."}, {"Time_Start": 899.32, "Time_End": 903.1600000000001, "Text": " And when I do this one for law enforcement or government people, I say, so is that a crime?"}, {"Time_Start": 905.6800000000001, "Time_End": 906.44, "Text": " What's the crime?"}, {"Time_Start": 909.7600000000001, "Time_End": 914.6800000000001, "Text": " You're stealing their system in the way they wanted it?"}, {"Time_Start": 916.3600000000001, "Time_End": 917.7600000000001, "Text": " Like, the theft of services?"}, {"Time_Start": 921.7600000000001, "Time_End": 923.1600000000001, "Text": " You're stealing the money too, yeah."}, {"Time_Start": 923.5400000000001, "Time_End": 924.58, "Text": " Well, but see, stealing the money."}, {"Time_Start": 924.6800000000001, "Time_End": 927.5200000000001, "Text": " So the way we think of that stealing, we're just the law."}, {"Time_Start": 927.9200000000001, "Time_End": 932.9200000000001, "Text": " What we think of stealing in the law is I take, I get it. I steal it for me."}, {"Time_Start": 932.9200000000001, "Time_End": 937.9200000000001, "Text": " But if you went to every teller in the bank and said to them, when someone comes in to"}, {"Time_Start": 937.9200000000001, "Time_End": 941.9200000000001, "Text": " take $100,000 because of $1,000, it's no difference."}, {"Time_Start": 941.9200000000001, "Time_End": 942.9200000000001, "Text": " That's what you've done the same thing."}, {"Time_Start": 942.9200000000001, "Time_End": 944.9200000000001, "Text": " I'm sorry, yes, sir."}, {"Time_Start": 944.9200000000001, "Time_End": 947.9200000000001, "Text": " I don't think it's a crime because the same thing as"}, {"Time_Start": 947.9200000000001, "Time_End": 951.9200000000001, "Text": " like the cashier obeying up your bill along you and just to walk away."}, {"Time_Start": 951.9200000000001, "Time_End": 955.9200000000001, "Text": " Well, yeah, I mean, obviously the players, the players didn't commit any crime, right?"}, {"Time_Start": 955.9200000000001, "Time_End": 956.9200000000001, "Text": " I mean, they didn't."}, {"Time_Start": 956.9200000000001, "Time_End": 957.9200000000001, "Text": " They're just gold."}, {"Time_Start": 957.9200000000001, "Time_End": 961.2600000000001, "Text": " They didn't do anything."}, {"Time_Start": 961.2600000000001, "Time_End": 962.9200000000001, "Text": " They were like, woohoo."}, {"Time_Start": 962.9200000000001, "Time_End": 966.9200000000001, "Text": " No, no, I don't."}, {"Time_Start": 966.9200000000001, "Time_End": 967.9200000000001, "Text": " I don't think so."}, {"Time_Start": 967.9200000000001, "Time_End": 970.9200000000001, "Text": " See, I mean, because then, if you can do it, we can fit it into it."}, {"Time_Start": 970.9200000000001, "Time_End": 971.9200000000001, "Text": " That's why I like this."}, {"Time_Start": 971.9200000000001, "Time_End": 972.9200000000001, "Text": " We can fit it into our case."}, {"Time_Start": 972.9200000000001, "Time_End": 975.9200000000001, "Text": " I just think it was somebody having, and I, you know, I shouldn't say this."}, {"Time_Start": 975.9200000000001, "Time_End": 976.9200000000001, "Text": " Right."}, {"Time_Start": 976.9200000000001, "Time_End": 977.9200000000001, "Text": " But I mean, having a good time."}, {"Time_Start": 977.9200000000001, "Time_End": 978.9200000000001, "Text": " I think it's kind of fun."}, {"Time_Start": 978.9200000000001, "Time_End": 979.9200000000001, "Text": " Reallocation of wealth."}, {"Time_Start": 979.9200000000001, "Time_End": 980.9200000000001, "Text": " Yes."}, {"Time_Start": 980.9200000000001, "Time_End": 982.9200000000001, "Text": " I've got to see if there's somebody going into a bank"}, {"Time_Start": 982.9200000000001, "Time_End": 984.9200000000001, "Text": " relating to like an ordinary crime."}, {"Time_Start": 984.9200000000001, "Time_End": 986.9200000000001, "Text": " Someone going into a bank"}, {"Time_Start": 986.9200000000001, "Time_End": 987.9200000000001, "Text": " and throwing."}, {"Time_Start": 987.9200000000001, "Time_End": 990.9200000000001, "Text": " money out on the street or whatever walked by."}, {"Time_Start": 990.9200000000001, "Time_End": 991.9200000000001, "Text": " Ah?"}, {"Time_Start": 991.9200000000001, "Time_End": 992.9200000000001, "Text": " That's a crime."}, {"Time_Start": 992.9200000000001, "Time_End": 994.9200000000001, "Text": " That's a crime that could keep that money."}, {"Time_Start": 994.9200000000001, "Time_End": 995.9200000000001, "Text": " Well, he robbed the bank."}, {"Time_Start": 995.9200000000001, "Time_End": 996.9200000000001, "Text": " Oh, it's a crime to keep the money."}, {"Time_Start": 996.9200000000001, "Time_End": 998.9200000000001, "Text": " But these people didn't know."}, {"Time_Start": 998.9200000000001, "Time_End": 1000.9200000000001, "Text": " Those people knew it was, he knew he was a bank robbery."}, {"Time_Start": 1000.9200000000001, "Time_End": 1002.9200000000001, "Text": " He's got a mask and the gun, right?"}, {"Time_Start": 1002.9200000000001, "Time_End": 1003.9200000000001, "Text": " They're figuring out that he's a robbery."}, {"Time_Start": 1003.9200000000001, "Time_End": 1006.9200000000001, "Text": " Yeah, but they just see the money to find out of the street."}, {"Time_Start": 1006.9200000000001, "Time_End": 1007.9200000000001, "Text": " I don't think those..."}, {"Time_Start": 1007.9200000000001, "Time_End": 1008.9200000000001, "Text": " But they didn't win it."}, {"Time_Start": 1008.9200000000001, "Time_End": 1009.9200000000001, "Text": " They didn't..."}, {"Time_Start": 1009.9200000000001, "Time_End": 1011.9200000000001, "Text": " The guy throwing the money out there and, you know,"}, {"Time_Start": 1011.9200000000001, "Time_End": 1014.9200000000001, "Text": " robbing against one, he's the one."}, {"Time_Start": 1014.9200000000001, "Time_End": 1015.9200000000001, "Text": " He's the trouble."}, {"Time_Start": 1015.9200000000001, "Time_End": 1016.9200000000001, "Text": " The trouble here."}, {"Time_Start": 1016.9200000000001, "Time_End": 1017.9200000000001, "Text": " There he robs it."}, {"Time_Start": 1017.9200000000001, "Time_End": 1018.9200000000001, "Text": " He takes the laptop."}, {"Time_Start": 1018.9200000000001, "Time_End": 1019.9200000000001, "Text": " He takes it."}, {"Time_Start": 1019.9200000000001, "Time_End": 1020.9200000000001, "Text": " And then he gives it away."}, {"Time_Start": 1020.9200000000001, "Time_End": 1021.9200000000001, "Text": " I'm sorry."}, {"Time_Start": 1021.9200000000001, "Time_End": 1022.9200000000001, "Text": " The policy."}, {"Time_Start": 1022.9200000000001, "Time_End": 1023.9200000000001, "Text": " The policy."}, {"Time_Start": 1023.9200000000001, "Time_End": 1025.92, "Text": " In terms of..."}, {"Time_Start": 1025.92, "Time_End": 1027.92, "Text": " Do they have any policies"}, {"Time_Start": 1027.92, "Time_End": 1028.92, "Text": " dating?"}, {"Time_Start": 1028.92, "Time_End": 1029.92, "Text": " They have any glitches of some or"}, {"Time_Start": 1029.92, "Time_End": 1030.92, "Text": " or amount."}, {"Time_Start": 1030.92, "Time_End": 1031.92, "Text": " They don't know."}, {"Time_Start": 1031.92, "Time_End": 1035.92, "Text": " I know that they paid up because they figured that it"}, {"Time_Start": 1035.92, "Time_End": 1037.92, "Text": " apparently was their fault and it was easier"}, {"Time_Start": 1037.92, "Time_End": 1039.92, "Text": " to pay up on that one than not."}, {"Time_Start": 1039.92, "Time_End": 1040.92, "Text": " I don't know."}, {"Time_Start": 1040.92, "Time_End": 1043.92, "Text": " But as I say, the reason I use this one"}, {"Time_Start": 1043.92, "Time_End": 1045.92, "Text": " is when I do it for like..."}, {"Time_Start": 1045.92, "Time_End": 1046.92, "Text": " Actually, when I do it for one,"}, {"Time_Start": 1046.92, "Time_End": 1048.92, "Text": " might get a, they kind of think it's funny too."}, {"Time_Start": 1048.92, "Time_End": 1053.92, "Text": " But, you know, it's not theft."}, {"Time_Start": 1053.92, "Time_End": 1054.92, "Text": " I mean, I'm sorry."}, {"Time_Start": 1054.92, "Time_End": 1056.92, "Text": " I don't, you know, with all respect to your opinions,"}, {"Time_Start": 1056.92, "Time_End": 1058.92, "Text": " it's not the way we think of it."}, {"Time_Start": 1058.92, "Time_End": 1060.92, "Text": " If I fix a slot machine at Caesar,"}, {"Time_Start": 1060.92, "Time_End": 1062.92, "Text": " so they'd pay off everyone."}, {"Time_Start": 1062.92, "Time_End": 1065.92, "Text": " Wouldn't that be the end of one?"}, {"Time_Start": 1065.92, "Time_End": 1068.92, "Text": " Well, you see, we can do it, we can do it"}, {"Time_Start": 1068.92, "Time_End": 1071.92, "Text": " consequentially. I mean, I can do this one"}, {"Time_Start": 1071.92, "Time_End": 1073.92, "Text": " consequently. I can do it a lower level."}, {"Time_Start": 1073.92, "Time_End": 1076.92, "Text": " I can charge you with, you know, destruction"}, {"Time_Start": 1076.92, "Time_End": 1078.92, "Text": " property, what have you done to the slot machine?"}, {"Time_Start": 1078.92, "Time_End": 1081.92, "Text": " So I can get you for that, which you can get here, right?"}, {"Time_Start": 1081.92, "Time_End": 1085.92, "Text": " I mean, one crime you can get here is breaking into the system, right?"}, {"Time_Start": 1085.92, "Time_End": 1087.92, "Text": " And altering, and altering."}, {"Time_Start": 1087.92, "Time_End": 1093.92, "Text": " But the question is, see, you know, criminal law is supposed to be about harm."}, {"Time_Start": 1093.92, "Time_End": 1097.92, "Text": " And each crime is supposed to address a particular level of harm."}, {"Time_Start": 1097.92, "Time_End": 1098.92, "Text": " This is what you did."}, {"Time_Start": 1098.92, "Time_End": 1100.92, "Text": " You did this bad thing and this is the crime."}, {"Time_Start": 1100.92, "Time_End": 1104.92, "Text": " All right, well, we can clearly here do the break into the system, right?"}, {"Time_Start": 1104.92, "Time_End": 1105.92, "Text": " All right."}, {"Time_Start": 1105.92, "Time_End": 1106.92, "Text": " All right."}, {"Time_Start": 1106.92, "Time_End": 1108.92, "Text": " 1.9 million."}, {"Time_Start": 1108.92, "Time_End": 1109.92, "Text": " Do you play the game?"}, {"Time_Start": 1109.92, "Time_End": 1110.92, "Text": " Pardon?"}, {"Time_Start": 1110.92, "Time_End": 1112.92, "Text": " Do you play the game after you think this?"}, {"Time_Start": 1112.92, "Time_End": 1113.92, "Text": " I don't think so."}, {"Time_Start": 1113.92, "Time_End": 1115.92, "Text": " I don't think so on this one."}, {"Time_Start": 1115.92, "Time_End": 1117.92, "Text": " Apparently this one is straight Robin Hood."}, {"Time_Start": 1117.92, "Time_End": 1119.92, "Text": " Now there are different versions of this."}, {"Time_Start": 1119.92, "Time_End": 1121.92, "Text": " Did they catch the map?"}, {"Time_Start": 1121.92, "Time_End": 1123.92, "Text": " I don't think so."}, {"Time_Start": 1123.92, "Time_End": 1125.92, "Text": " Robin, you don't catch Robin Hood."}, {"Time_Start": 1125.92, "Time_End": 1126.92, "Text": " Come on."}, {"Time_Start": 1126.92, "Time_End": 1127.92, "Text": " Yes."}, {"Time_Start": 1127.92, "Time_End": 1130.92, "Text": " I'm sorry."}, {"Time_Start": 1130.92, "Time_End": 1133.92, "Text": " Would they still be liable in tort laws?"}, {"Time_Start": 1133.92, "Time_End": 1135.92, "Text": " Oh yeah, yeah, yeah, yes."}, {"Time_Start": 1135.92, "Time_End": 1136.92, "Text": " I don't do torts."}, {"Time_Start": 1136.92, "Time_End": 1137.92, "Text": " I'm purely criminal."}, {"Time_Start": 1137.92, "Time_End": 1138.92, "Text": " Crime is my interest."}, {"Time_Start": 1138.92, "Time_End": 1140.92, "Text": " Oh, yes, you can always do."}, {"Time_Start": 1140.92, "Time_End": 1147.42, "Text": " See, and on this kind of thing, actually I've had people ask that before, on this kind of thing, yes,"}, {"Time_Start": 1147.42, "Time_End": 1152.92, "Text": " you could always do, you can always do a civil suit, tort law, breach of contract, if you have"}, {"Time_Start": 1152.92, "Time_End": 1153.92, "Text": " agreement, whatever."}, {"Time_Start": 1153.92, "Time_End": 1154.92, "Text": " You can always do that."}, {"Time_Start": 1154.92, "Time_End": 1156.92, "Text": " And a casino would have money so you could get damages."}, {"Time_Start": 1156.92, "Time_End": 1161.42, "Text": " Problem is on some of these cases, which we're going to talk about in a minute, they're"}, {"Time_Start": 1161.42, "Time_End": 1163.42, "Text": " what if the law calls judgment proof."}, {"Time_Start": 1163.42, "Time_End": 1164.42, "Text": " You can bring a civil suit."}, {"Time_Start": 1164.42, "Time_End": 1165.42, "Text": " I can bring a civil suit."}, {"Time_Start": 1165.42, "Time_End": 1166.42, "Text": " I can bring a civil suit."}, {"Time_Start": 1166.42, "Time_End": 1171.46, "Text": " lawyer, take the whole damn thing through court, and I have somebody who's got no money."}, {"Time_Start": 1173.2, "Time_End": 1174.16, "Text": " Now, I could do that."}, {"Time_Start": 1174.24, "Time_End": 1175.76, "Text": " I'm really bound and determined."}, {"Time_Start": 1176.52, "Time_End": 1180.64, "Text": " I was in France about six weeks ago, and somebody told me about someone who'd pursued a suit"}, {"Time_Start": 1180.64, "Time_End": 1185.3200000000002, "Text": " through for a couple of years and got $1 in an ammages and was quite happy because they vindicated"}, {"Time_Start": 1185.3200000000002, "Time_End": 1185.68, "Text": " themselves."}, {"Time_Start": 1185.88, "Time_End": 1188.4, "Text": " I don't, I'm an American, we're mercenary."}, {"Time_Start": 1188.5600000000002, "Time_End": 1191.3200000000002, "Text": " I don't think I quite see doing that."}, {"Time_Start": 1191.78, "Time_End": 1192.0600000000002, "Text": " Yes."}, {"Time_Start": 1192.0600000000002, "Time_End": 1196.2, "Text": " If this was like an onshore casino, I don't know if it was enough, but who can have been a baby?"}, {"Time_Start": 1196.42, "Time_End": 1198.54, "Text": " Ah, oh, yes, we're going to get there."}, {"Time_Start": 1199.2, "Time_End": 1200.04, "Text": " See, that's another whole."}, {"Time_Start": 1200.16, "Time_End": 1201.1200000000001, "Text": " That's another whole thing."}, {"Time_Start": 1201.5600000000002, "Time_End": 1205.8200000000002, "Text": " I mean, in terms of where is it, who's jurisdiction, where is it, who's got jurisdiction,"}, {"Time_Start": 1206.0, "Time_End": 1210.0600000000002, "Text": " whose laws applied, you know, were the laws that were there, did they reach the conduct?"}, {"Time_Start": 1210.16, "Time_End": 1211.28, "Text": " That's just another whole thing."}, {"Time_Start": 1211.28, "Time_End": 1216.14, "Text": " This is just a real simple, little conceptual part of it, which is somebody plays a trick."}, {"Time_Start": 1216.46, "Time_End": 1221.76, "Text": " You want to prosecute, you can clearly prosecute for the, you can clearly prosecute for the intrusion,"}, {"Time_Start": 1222.22, "Time_End": 1225.4, "Text": " going into the system, but then there's, that's what I mean about consequential."}, {"Time_Start": 1225.5, "Time_End": 1226.0800000000002, "Text": " You're going in."}, {"Time_Start": 1226.42, "Time_End": 1228.52, "Text": " You're breaking in plus."}, {"Time_Start": 1228.9, "Time_End": 1231.7, "Text": " You're breaking in, plus you're just handing out $1.9 million."}, {"Time_Start": 1233.46, "Time_End": 1235.76, "Text": " A fellow prosecutor tell me that there's ought to be wire fraud."}, {"Time_Start": 1237.1000000000001, "Time_End": 1238.5600000000002, "Text": " I'm not sure that you could make it."}, {"Time_Start": 1238.68, "Time_End": 1239.78, "Text": " I'm not sure you can make it wire fraud."}, {"Time_Start": 1239.8400000000001, "Time_End": 1240.76, "Text": " I don't think it fits."}, {"Time_Start": 1241.2, "Time_End": 1242.42, "Text": " I don't think it fits there."}, {"Time_Start": 1244.9, "Time_End": 1245.3400000000001, "Text": " To..."}, {"Time_Start": 1245.3400000000001, "Time_End": 1248.24, "Text": " Yeah, you have to show intent that you..."}, {"Time_Start": 1248.24, "Time_End": 1252.24, "Text": " Yeah, you have to show that you willfully acted, that your conduct acted,"}, {"Time_Start": 1252.3200000000002, "Time_End": 1254.74, "Text": " using the wires in furtherance of the scheme to defraud."}, {"Time_Start": 1254.74, "Time_End": 1254.76, "Text": " And one of the problems I have with this is scheme to defraud."}, {"Time_Start": 1254.76, "Time_End": 1256.4, "Text": " And one of the problems I have with this is scheme to..."}, {"Time_Start": 1256.42, "Time_End": 1257.46, "Text": " to fraud who out of what?"}, {"Time_Start": 1258.64, "Time_End": 1259.8200000000002, "Text": " Skim through to fraud, who out of what?"}, {"Time_Start": 1260.3600000000001, "Time_End": 1260.42, "Text": " Huh?"}, {"Time_Start": 1260.42, "Time_End": 1264.48, "Text": " I invite me to come in to win money."}, {"Time_Start": 1266.8000000000002, "Time_End": 1269.92, "Text": " Yeah, I mean, I, I, you know, this is why..."}, {"Time_Start": 1269.92, "Time_End": 1272.1200000000001, "Text": " You would have got the money, then yes."}, {"Time_Start": 1272.26, "Time_End": 1272.6200000000001, "Text": " Oh, yes."}, {"Time_Start": 1276.5800000000002, "Time_End": 1282.6000000000001, "Text": " Yeah, because, see, and again, see, you're all right"}, {"Time_Start": 1282.6000000000001, "Time_End": 1285.2, "Text": " absolutely right, and the reason I do it is, you know,"}, {"Time_Start": 1285.2, "Time_End": 1286.4, "Text": " we've just got this theory."}, {"Time_Start": 1286.42, "Time_End": 1288.72, "Text": " that because it's the way people do things in the real world."}, {"Time_Start": 1289.0600000000002, "Time_End": 1294.0600000000002, "Text": " Very seldom do people go rob banks in the real world and go out and go, yippee, take the money."}, {"Time_Start": 1294.5600000000002, "Time_End": 1295.24, "Text": " It's mine."}, {"Time_Start": 1295.7, "Time_End": 1296.92, "Text": " You know, theft is mine."}, {"Time_Start": 1298.24, "Time_End": 1299.0600000000002, "Text": " You don't have it here."}, {"Time_Start": 1299.14, "Time_End": 1302.4, "Text": " You can play a trick here, and it doesn't quite fit into our categories."}, {"Time_Start": 1302.46, "Time_End": 1303.02, "Text": " Let me try some more."}, {"Time_Start": 1304.5800000000002, "Time_End": 1306.0800000000002, "Text": " This one, this one's fun."}, {"Time_Start": 1308.2, "Time_End": 1309.3200000000002, "Text": " This one is bizarre."}, {"Time_Start": 1309.88, "Time_End": 1313.22, "Text": " 1999, October 1999, April 1999 is Columbine."}, {"Time_Start": 1313.22, "Time_End": 1316.3400000000001, "Text": " October 1999, something happened in a Massachusetts middle school."}, {"Time_Start": 1316.42, "Time_End": 1320.6200000000001, "Text": " The kids at the Massachusetts middle school would go home from school every day"}, {"Time_Start": 1320.6200000000001, "Time_End": 1324.38, "Text": " and chat in an AOL chat room about what happened, you know,"}, {"Time_Start": 1324.44, "Time_End": 1327.5, "Text": " who sat with who or, you know, whatever kids in middle school chat about."}, {"Time_Start": 1329.76, "Time_End": 1332.04, "Text": " And they noticed at one point that there was a lurker."}, {"Time_Start": 1332.14, "Time_End": 1333.1000000000001, "Text": " There was somebody there listening."}, {"Time_Start": 1333.22, "Time_End": 1334.98, "Text": " I didn't pay much attention if there was another kid."}, {"Time_Start": 1336.16, "Time_End": 1338.0600000000002, "Text": " And then the lurker started to talk."}, {"Time_Start": 1338.0600000000002, "Time_End": 1345.74, "Text": " And as this evolves, it's clear to them, clear to them that this person is at the school"}, {"Time_Start": 1345.74, "Time_End": 1347.1, "Text": " because this person knows things."}, {"Time_Start": 1347.14, "Time_End": 1350.6, "Text": " This person says things like, oh, Janie, you look truly neat in that purple sweater today."}, {"Time_Start": 1351.1200000000001, "Time_End": 1355.24, "Text": " And oh, I saw you and, you know, so-and-so and so-and-so sat together in the cafeteria."}, {"Time_Start": 1357.36, "Time_End": 1359.8, "Text": " So there's another kid in the chat room."}, {"Time_Start": 1361.5, "Time_End": 1362.8, "Text": " And it starts to get weird."}, {"Time_Start": 1364.3, "Time_End": 1366.14, "Text": " And it starts to get really weird."}, {"Time_Start": 1367.36, "Time_End": 1371.64, "Text": " And the person starts to become angry and the kids start to be upset."}, {"Time_Start": 1371.64, "Time_End": 1373.48, "Text": " It starts to get strange."}, {"Time_Start": 1373.98, "Time_End": 1375.22, "Text": " It ultimately."}, {"Time_Start": 1375.74, "Time_End": 1380.18, "Text": " progresses to the point where, for example, that entrance of the school,"}, {"Time_Start": 1380.56, "Time_End": 1384.64, "Text": " a person sends a picture of the entrance to the school with the, you know,"}, {"Time_Start": 1384.66, "Time_End": 1390.58, "Text": " the gun site superimposed over it, sends a picture of the principal with bullet holes throughout,"}, {"Time_Start": 1390.84, "Time_End": 1392.78, "Text": " starts making ominous things."}, {"Time_Start": 1393.76, "Time_End": 1396.1200000000001, "Text": " And now what has happened is that kids have told their parents"}, {"Time_Start": 1396.1200000000001, "Time_End": 1397.6, "Text": " and everybody's nuts."}, {"Time_Start": 1397.78, "Time_End": 1400.3, "Text": " Everybody's going crazy because everybody believes, dear God,"}, {"Time_Start": 1400.56, "Time_End": 1402.82, "Text": " we're going to have another Columbine here, and who is it?"}, {"Time_Start": 1402.82, "Time_End": 1405.68, "Text": " It's got to be somebody in the school because they know everything that's going"}, {"Time_Start": 1405.74, "Time_End": 1408.64, "Text": " on. And this person is still, as this is going on, is still manipulating."}, {"Time_Start": 1409.56, "Time_End": 1411.08, "Text": " So everybody's trying to sort it out."}, {"Time_Start": 1411.18, "Time_End": 1413.6200000000001, "Text": " Parents are like, do I send the kids to school? Do I not send the kids to school?"}, {"Time_Start": 1413.7, "Time_End": 1415.42, "Text": " The parents are like, what do we do? Do we have security?"}, {"Time_Start": 1415.64, "Time_End": 1419.7, "Text": " Who do we have security from? Maybe it's one of us. How do we deal with this?"}, {"Time_Start": 1421.36, "Time_End": 1427.8, "Text": " It goes on and on. At one point, I'm a serious lurker. The kids go back in the chat room and they say,"}, {"Time_Start": 1428.6, "Time_End": 1433.1, "Text": " we think you're Bobby Smith. Are you Bobby Smith? Because nobody liked Bobby Smith."}, {"Time_Start": 1433.8, "Time_End": 1435.38, "Text": " And he said, yeah, I'm Bobby Smith."}, {"Time_Start": 1435.74, "Time_End": 1437.14, "Text": " And so they beat the hell out of Bobby Smith."}, {"Time_Start": 1438.72, "Time_End": 1442.06, "Text": " Of course, it wasn't Bobby Smith. I mean, Bobby just got in the way."}, {"Time_Start": 1443.0, "Time_End": 1451.54, "Text": " It tracks on, and actually they're very fortunate, very fortunate, by some kind of chance,"}, {"Time_Start": 1451.6200000000001, "Time_End": 1454.86, "Text": " some good luck, they find out who's doing it."}, {"Time_Start": 1454.94, "Time_End": 1459.34, "Text": " And it's Christian Hunold, who's 20 years old, who is understandably, I mean, you know,"}, {"Time_Start": 1459.54, "Time_End": 1460.42, "Text": " he'd feel sorry for him."}, {"Time_Start": 1460.86, "Time_End": 1462.98, "Text": " He'd been in an auto accident a couple years before."}, {"Time_Start": 1462.98, "Time_End": 1465.38, "Text": " He'd been an athlete. He's now a paraplegic. He's bitter."}, {"Time_Start": 1465.74, "Time_End": 1467.42, "Text": " And he's in Missouri."}, {"Time_Start": 1470.14, "Time_End": 1476.26, "Text": " So Christian Hunold, a 20-year-old, a paraplegic from Missouri, is terrorizing a town in Massachusetts, playing with them."}, {"Time_Start": 1476.26, "Time_End": 1480.1, "Text": " I'm kind of like Sim City, called me distorted, weird, whacked out, Sin City."}, {"Time_Start": 1480.34, "Time_End": 1481.24, "Text": " Sim City goes vicious."}, {"Time_Start": 1482.48, "Time_End": 1486.24, "Text": " He's playing with these people, and, I mean, they were terrorized."}, {"Time_Start": 1486.34, "Time_End": 1491.46, "Text": " And one of the things I find most interesting about this is that when they caught it, well,"}, {"Time_Start": 1491.46, "Time_End": 1493.42, "Text": " there's another division we'll talk about it, is it when they caught him."}, {"Time_Start": 1494.06, "Time_End": 1495.7, "Text": " He's getting ready to do it to another school."}, {"Time_Start": 1495.74, "Time_End": 1496.1, "Text": " in Georgia."}, {"Time_Start": 1498.92, "Time_End": 1500.58, "Text": " Well, that was part of the problem."}, {"Time_Start": 1500.92, "Time_End": 1501.94, "Text": " They found him."}, {"Time_Start": 1503.0, "Time_End": 1508.72, "Text": " Massachusetts couldn't really prosecute him because they'd have cyber crime code."}, {"Time_Start": 1508.78, "Time_End": 1511.96, "Text": " They still had traditional criminal law, and they do now."}, {"Time_Start": 1512.14, "Time_End": 1513.58, "Text": " I mean, they dealt with that."}, {"Time_Start": 1513.92, "Time_End": 1515.1, "Text": " They can really prosecute him."}, {"Time_Start": 1515.74, "Time_End": 1520.36, "Text": " Missouri could prosecute him because one of the things he did, he said the children, child porn."}, {"Time_Start": 1520.92, "Time_End": 1522.36, "Text": " He wasn't prosecuted on the federal level."}, {"Time_Start": 1522.36, "Time_End": 1525.5, "Text": " You could possibly get him on the federal level for transmitting threats."}, {"Time_Start": 1525.74, "Time_End": 1531.6, "Text": " prosecuted there I think I know why. Missouri prosecuted him. He pled, you know,"}, {"Time_Start": 1531.66, "Time_End": 1537.82, "Text": " and then part of the problem is, what do you do with him? Our penal systems are not set up to deal"}, {"Time_Start": 1537.82, "Time_End": 1543.88, "Text": " with people who are in Christian, who knows, situation. I mean, we don't really have the facilities."}, {"Time_Start": 1544.0, "Time_End": 1548.26, "Text": " I think that's probably why the feds did not want to go after him. So, I mean, he went away for a while."}, {"Time_Start": 1548.36, "Time_End": 1553.16, "Text": " He's been let out the usual restrictions on computers and all that. But look, this is one of the thing,"}, {"Time_Start": 1553.16, "Time_End": 1558.88, "Text": " One second. One second. This is one of the things that I like to talk about. I mean, the power."}, {"Time_Start": 1560.3400000000001, "Time_End": 1564.0, "Text": " Christian Hunoz couldn't have ever done this before. You can stalk a town before."}, {"Time_Start": 1564.72, "Time_End": 1568.5, "Text": " You get this kid halfway across the country sitting this whole town into panic."}, {"Time_Start": 1568.96, "Time_End": 1571.3000000000002, "Text": " He isn't prosecuted in Massachusetts. They fix their laws."}, {"Time_Start": 1572.68, "Time_End": 1577.5600000000002, "Text": " He is prosecuted Missouri, but for not very much. Presumably he won't be a recidivist."}, {"Time_Start": 1578.6000000000001, "Time_End": 1583.14, "Text": " They are, as I say, I think, pretty lucky that they caught him before he went after Georgia because you have to"}, {"Time_Start": 1583.16, "Time_End": 1589.5, "Text": " understand. Everybody in Massachusetts thought he was in this town. They weren't looking"}, {"Time_Start": 1589.5, "Time_End": 1593.2, "Text": " anywhere else because how could it be some guy off in Missouri? Yes, sir?"}, {"Time_Start": 1597.8000000000002, "Time_End": 1604.46, "Text": " No, it was not. It was not then. We were not, we were not as sensitive to terrorists. Now,"}, {"Time_Start": 1604.5, "Time_End": 1608.76, "Text": " there's the thing you'll find in most states, there's an official find in most states that's been around"}, {"Time_Start": 1608.76, "Time_End": 1613.14, "Text": " for God knows how many long years. It's called making terroristic threats. And it's usually"}, {"Time_Start": 1613.16, "Time_End": 1618.48, "Text": " pretty small, pretty low level, pretty low level of fence. You could use it, but it doesn't get you much."}, {"Time_Start": 1618.5400000000002, "Time_End": 1623.1200000000001, "Text": " I mean, it goes back to this thing about harm. I mean, in Massachusetts, they wanted to get this guy because"}, {"Time_Start": 1623.1200000000001, "Time_End": 1627.3600000000001, "Text": " they are not happy about what had happened, but their laws really did not, really did not work."}, {"Time_Start": 1627.66, "Time_End": 1635.8600000000001, "Text": " I'm calling it stalking, for lack of a better term. You know, he did, he did make threats,"}, {"Time_Start": 1637.3600000000001, "Time_End": 1642.52, "Text": " which can make it a little different from some other kinds of cases. How am I doing that time?"}, {"Time_Start": 1643.16, "Time_End": 1647.16, "Text": " 29? Oh, good. Can I tell a story?"}, {"Time_Start": 1648.92, "Time_End": 1654.76, "Text": " This one, a variation of this one, he made threats. There's a case. Do you know the Jake Baker case out of Michigan, the University of Michigan?"}, {"Time_Start": 1656.16, "Time_End": 1659.0800000000002, "Text": " Anybody know that one? Somebody knows that one."}, {"Time_Start": 1660.4, "Time_End": 1663.94, "Text": " Jake Baker, you can correct me if I get anything wrong."}, {"Time_Start": 1664.8400000000001, "Time_End": 1668.0400000000002, "Text": " Simplifying, Jake Baker is a student in Michigan. He was corresponding with another person."}, {"Time_Start": 1669.88, "Time_End": 1673.0, "Text": " Slightly, I'm going to oversimplify and make it a little bit more."}, {"Time_Start": 1673.16, "Time_End": 1677.8000000000002, "Text": " internet, public related than it is. Of course, money with another person. Jake Baker lived in a dorm,"}, {"Time_Start": 1677.9, "Time_End": 1681.42, "Text": " the University of Michigan, and across the hall from him, for example, lived a woman for whom he"}, {"Time_Start": 1681.42, "Time_End": 1688.26, "Text": " conceived, as some people do, a very weird passion. And Jake Baker, in the course of his email,"}, {"Time_Start": 1688.38, "Time_End": 1692.3000000000002, "Text": " described what he would like to do to her. And if you'd like to read what he'd like to do to her,"}, {"Time_Start": 1692.44, "Time_End": 1696.96, "Text": " send me an email, and I'll send you the case. Among other things that he would like to do to her"}, {"Time_Start": 1696.96, "Time_End": 1703.14, "Text": " would be to strip her naked, hang her upside down by her feet, slash her with a knife, laugh,"}, {"Time_Start": 1703.16, "Time_End": 1709.3200000000002, "Text": " while she screamed. Pour gasoline over her laughing while she screamed. And then do what?"}, {"Time_Start": 1710.72, "Time_End": 1719.76, "Text": " Light a fire. Laughing as she screamed and died. Through a weird course of events somehow,"}, {"Time_Start": 1720.26, "Time_End": 1723.3600000000001, "Text": " this apparently came to the attention. And there's a couple of things. There's a couple of women"}, {"Time_Start": 1723.3600000000001, "Time_End": 1726.3200000000002, "Text": " going on. There's a couple of dimensions. I mean, I'm simplifying as I don't have much time."}, {"Time_Start": 1727.18, "Time_End": 1733.0, "Text": " Came to the attention of the woman. It's my understanding that the President of the University of Michigan just"}, {"Time_Start": 1733.0, "Time_End": 1735.32, "Text": " through Jake Baker off campus after two hours."}, {"Time_Start": 1736.6, "Time_End": 1737.0, "Text": " Pardon?"}, {"Time_Start": 1738.82, "Time_End": 1739.5, "Text": " Now now."}, {"Time_Start": 1742.66, "Time_End": 1747.44, "Text": " And then I think there was, like this, I think there was a discussion about, well, what do we do?"}, {"Time_Start": 1747.52, "Time_End": 1750.44, "Text": " We should charge him with something. We should prosecute him for something. What are we charge him with?"}, {"Time_Start": 1750.9, "Time_End": 1755.22, "Text": " He was prosecuted for what this one wasn't. He was prosecuted in the federal level for"}, {"Time_Start": 1755.22, "Time_End": 1760.62, "Text": " 18 U.S.C. Section 875C, which is using an instrumentality of interstate commerce to send threats."}, {"Time_Start": 1763.0, "Time_End": 1764.24, "Text": " Did Joe Baker send threats?"}, {"Time_Start": 1767.04, "Time_End": 1770.6, "Text": " This guy did. I think this guy did with the bullet holes and the, you know."}, {"Time_Start": 1770.94, "Time_End": 1772.12, "Text": " He just expressed his fantasy."}, {"Time_Start": 1772.54, "Time_End": 1775.32, "Text": " Yes. It's art."}, {"Time_Start": 1777.84, "Time_End": 1779.66, "Text": " Yeah, he just expressed a fantasy, right?"}, {"Time_Start": 1779.96, "Time_End": 1783.36, "Text": " He never meant, I mean, I don't think he ever meant for her to see it."}, {"Time_Start": 1783.44, "Time_End": 1787.92, "Text": " They're talking back and forth. It bleeds off into the, into the Internet, and she sees it."}, {"Time_Start": 1788.12, "Time_End": 1790.56, "Text": " I thought she was scared of death."}, {"Time_Start": 1790.84, "Time_End": 1791.24, "Text": " Right."}, {"Time_Start": 1792.0, "Time_End": 1792.98, "Text": " But he didn't."}, {"Time_Start": 1793.0, "Time_End": 1796.5, "Text": " You have to be a jury with convict based on..."}, {"Time_Start": 1796.5, "Time_End": 1799.2, "Text": " Ah, but you see, you see, this is why you hire..."}, {"Time_Start": 1799.2, "Time_End": 1801.18, "Text": " I've never been a prosecutor. I've been a defense lawyer."}, {"Time_Start": 1801.28, "Time_End": 1804.74, "Text": " You hire defense lawyers, sneaky defense lawyers."}, {"Time_Start": 1806.9, "Time_End": 1808.7, "Text": " And you get yourself charged with..."}, {"Time_Start": 1808.7, "Time_End": 1809.74, "Text": " You get yourself charged with this."}, {"Time_Start": 1809.78, "Time_End": 1810.68, "Text": " You represent Jake Baker."}, {"Time_Start": 1810.78, "Time_End": 1813.44, "Text": " Jake Baker comes in and you say, dear God, I don't want to go to a jury."}, {"Time_Start": 1813.64, "Time_End": 1814.38, "Text": " This would not be good."}, {"Time_Start": 1814.82, "Time_End": 1815.94, "Text": " Let's not go to a jury."}, {"Time_Start": 1816.06, "Time_End": 1817.6, "Text": " Let's try to give this thing from going to a jury."}, {"Time_Start": 1817.68, "Time_End": 1820.2, "Text": " So you found a motion to dismiss the charges saying they're no good legally."}, {"Time_Start": 1821.54, "Time_End": 1822.66, "Text": " Which in this case would be,"}, {"Time_Start": 1823.0, "Time_End": 1824.48, "Text": " I'm the defense lawyer. I filed a motion."}, {"Time_Start": 1824.58, "Time_End": 1825.88, "Text": " Say, what threat? Right?"}, {"Time_Start": 1827.22, "Time_End": 1828.06, "Text": " Did he threaten anybody?"}, {"Time_Start": 1829.5, "Time_End": 1830.94, "Text": " I think that's not a jury."}, {"Time_Start": 1831.48, "Time_End": 1832.74, "Text": " No, no, you can't get there."}, {"Time_Start": 1832.84, "Time_End": 1836.1, "Text": " If I can convince the judge in the district court, the federal district court said,"}, {"Time_Start": 1836.64, "Time_End": 1838.88, "Text": " boy, I don't like this stuff, but he didn't threaten her."}, {"Time_Start": 1840.88, "Time_End": 1842.2, "Text": " And the Sixth Circuit said,"}, {"Time_Start": 1843.4, "Time_End": 1846.7, "Text": " boy, I don't like this stuff, was not a threat."}, {"Time_Start": 1847.66, "Time_End": 1851.24, "Text": " He didn't say to her, I am going to do this to you."}, {"Time_Start": 1851.24, "Time_End": 1852.42, "Text": " He fantasized, and he put him."}, {"Time_Start": 1853.0, "Time_End": 1857.6, "Text": " fantasies featuring a real person out where she could find it."}, {"Time_Start": 1858.36, "Time_End": 1858.66, "Text": " Yes."}, {"Time_Start": 1862.06, "Time_End": 1862.78, "Text": " Oh, sure."}, {"Time_Start": 1862.98, "Time_End": 1864.22, "Text": " You'd have to prove intent to threat."}, {"Time_Start": 1864.28, "Time_End": 1868.06, "Text": " But see, really, you don't want to take this kind of case to a jury."}, {"Time_Start": 1872.7, "Time_End": 1877.78, "Text": " Well, I mean, you hope, if you were to take a case like to the jury, you would hope they would"}, {"Time_Start": 1877.78, "Time_End": 1882.02, "Text": " do it right, you know, and parse through and say that he didn't intend to when it wasn't a threat"}, {"Time_Start": 1882.02, "Time_End": 1882.3, "Text": " and all that."}, {"Time_Start": 1882.34, "Time_End": 1882.96, "Text": " But you're much safer."}, {"Time_Start": 1883.0, "Time_End": 1889.5, "Text": " with a judge. And so this one, I mean, it's not up there, but the Baker one, I personally think very correctly,"}, {"Time_Start": 1890.06, "Time_End": 1893.5, "Text": " it wasn't a threat. I don't see how you could prosecute the guy for threatening. Yes."}, {"Time_Start": 1906.1, "Time_End": 1908.88, "Text": " How about more like, I like it more? I think it would be"}, {"Time_Start": 1908.88, "Time_End": 1912.94, "Text": " I think it would be interesting. I had a cop several years ago asked me this scenario."}, {"Time_Start": 1913.0, "Time_End": 1914.38, "Text": " So it's kind of a variation."}, {"Time_Start": 1915.4, "Time_End": 1919.86, "Text": " What if a guy, I have my weird passions being conceived again here, and I'm sorry, thinking"}, {"Time_Start": 1919.86, "Time_End": 1922.26, "Text": " on the guy as other people can conceive weird passions, but whatever."}, {"Time_Start": 1922.68, "Time_End": 1927.16, "Text": " A guy conceives a weird passion of this woman who lives in his apartment complex, and she doesn't"}, {"Time_Start": 1927.16, "Time_End": 1927.68, "Text": " like him."}, {"Time_Start": 1928.74, "Time_End": 1931.26, "Text": " You know, there's a lot of stalking cases where you get this kind of behavior."}, {"Time_Start": 1932.36, "Time_End": 1938.5, "Text": " And so what he does is, if she walks back and forth, back and forth to her apartment, he videotapes"}, {"Time_Start": 1938.5, "Time_End": 1942.7, "Text": " her, and the officer's example, and I don't know if this was real or he made it off."}, {"Time_Start": 1943.0, "Time_End": 1948.74, "Text": " The officer's example was that he morphs her head onto a videotape of somebody being raped."}, {"Time_Start": 1950.2, "Time_End": 1951.3, "Text": " It puts it on the Internet."}, {"Time_Start": 1952.7, "Time_End": 1953.16, "Text": " It's arts."}, {"Time_Start": 1954.36, "Time_End": 1955.32, "Text": " It's my creation."}, {"Time_Start": 1956.18, "Time_End": 1957.14, "Text": " It's my homage."}, {"Time_Start": 1958.28, "Time_End": 1959.12, "Text": " You're a star."}, {"Time_Start": 1960.04, "Time_End": 1960.62, "Text": " Tune on."}, {"Time_Start": 1961.16, "Time_End": 1961.62, "Text": " Come on."}, {"Time_Start": 1961.72, "Time_End": 1963.26, "Text": " You can watch yourself being raped every day."}, {"Time_Start": 1963.66, "Time_End": 1964.2, "Text": " Ain't that cool?"}, {"Time_Start": 1968.96, "Time_End": 1970.28, "Text": " E-taped in public."}, {"Time_Start": 1970.86, "Time_End": 1972.06, "Text": " It's not a commercial use."}, {"Time_Start": 1972.06, "Time_End": 1976.5, "Text": " By the way, this leads me to something which I wasn't going to get into today, but just as an aside,"}, {"Time_Start": 1976.6, "Time_End": 1978.48, "Text": " and at some point here, I probably should get back on track."}, {"Time_Start": 1980.78, "Time_End": 1986.22, "Text": " Invasion of privacy, I mean, we don't really treat, and I'm going to do this, I have a case on this in a minute."}, {"Time_Start": 1986.32, "Time_End": 1991.24, "Text": " We've not really treated a lot of things about ourselves and our identities, our privacy."}, {"Time_Start": 1991.3799999999999, "Time_End": 1995.04, "Text": " We've not really taken that seriously."}, {"Time_Start": 1995.58, "Time_End": 1999.06, "Text": " I mean, my question on that one with the, if you just take it on the straight criminal law perspective,"}, {"Time_Start": 1999.06, "Time_End": 2002.04, "Text": " if you did that and you put the videotape up, and there's a videotape, and now it shows her,"}, {"Time_Start": 2002.06, "Time_End": 2007.24, "Text": " her and it's characterized as art, is that different from Jake Baker, which isn't a threat."}, {"Time_Start": 2007.32, "Time_End": 2009.28, "Text": " So let me, let me, bear with me, okay?"}, {"Time_Start": 2009.48, "Time_End": 2012.84, "Text": " Let me struggle on something else that's vaguely related."}, {"Time_Start": 2012.86, "Time_End": 2013.3799999999999, "Text": " You know this one?"}, {"Time_Start": 2014.1399999999999, "Time_End": 2014.76, "Text": " Do you know this site?"}, {"Time_Start": 2016.02, "Time_End": 2017.94, "Text": " Oh, this is such an interesting site."}, {"Time_Start": 2018.56, "Time_End": 2019.84, "Text": " It's called the Nuremberg files."}, {"Time_Start": 2019.94, "Time_End": 2022.26, "Text": " If you can see it here, visualize abortion is on trial."}, {"Time_Start": 2022.56, "Time_End": 2023.36, "Text": " It's a website."}, {"Time_Start": 2023.6, "Time_End": 2025.44, "Text": " There's the thingy, the address."}, {"Time_Start": 2026.58, "Time_End": 2031.8799999999999, "Text": " It focuses, it posts the names, addresses, home and business, other information about,"}, {"Time_Start": 2032.06, "Time_End": 2040.46, "Text": " performing abortions. It doesn't say, go hurt them. But it does post that information."}, {"Time_Start": 2041.1799999999998, "Time_End": 2045.46, "Text": " And in the section of the site, it lists the names of doctors, and if your name is listed in black"}, {"Time_Start": 2045.46, "Time_End": 2052.04, "Text": " font, you are alive and working. If your name is in a gray font, you've been wounded. If your"}, {"Time_Start": 2052.04, "Time_End": 2058.4, "Text": " name is struck through, you've been killed. This caused consternation to doctors who were"}, {"Time_Start": 2058.4, "Time_End": 2062.04, "Text": " listed on the site. You know, they thought, gee, I don't feel comfortable."}, {"Time_Start": 2062.06, "Time_End": 2069.06, "Text": " with this. And so they brought a civil suit, the contours of which we don't worry about,"}, {"Time_Start": 2069.06, "Time_End": 2073.06, "Text": " but they're trying to get the site shut down, and they're saying that basically this is, what is this?"}, {"Time_Start": 2073.06, "Time_End": 2080.06, "Text": " Exactly. They're saying that it's a, they're saying two things. They're saying it's a threat."}, {"Time_Start": 2080.06, "Time_End": 2084.06, "Text": " Threat. Threat. How am I doing that? I throw on my time."}, {"Time_Start": 2092.06, "Time_End": 2099.96, "Text": " happen if I don't stay on time. What you get here in terms of the issues, whether or not"}, {"Time_Start": 2099.96, "Time_End": 2103.7, "Text": " it's a threat. Part of the argument was that it's threatening, that it's implicitly saying,"}, {"Time_Start": 2104.14, "Time_End": 2110.18, "Text": " hi, you know, that that is implicitly saying, we're threatening you. Another part of it is"}, {"Time_Start": 2110.18, "Time_End": 2113.66, "Text": " what's called aiding and abetting, which is somebody wants to rob a liquor store, I give them a gun,"}, {"Time_Start": 2114.38, "Time_End": 2119.6, "Text": " you know, I'm helping, I'm contributing. You know, the idea being that they're helping by saying,"}, {"Time_Start": 2119.6, "Time_End": 2122.04, "Text": " this is where you can find, this is where you can find the abortion."}, {"Time_Start": 2122.06, "Time_End": 2124.56, "Text": " Case goes to the Ninth Circuit Court of Appeals."}, {"Time_Start": 2124.56, "Time_End": 2128.82, "Text": " It comes out of Washington and goes the Ninth Circuit Court of Appeals."}, {"Time_Start": 2128.82, "Time_End": 2137.06, "Text": " Ninth Circuit Court of Appeals says the rest of it, just the information that's posted, no problem."}, {"Time_Start": 2137.06, "Time_End": 2144.06, "Text": " You can put up to the abortion doctor's home address, work address, license plate number, spouse name, all those kinds of things."}, {"Time_Start": 2144.06, "Time_End": 2145.06, "Text": " No problem."}, {"Time_Start": 2145.06, "Time_End": 2147.06, "Text": " This, they said, was getting close to a threat."}, {"Time_Start": 2147.06, "Time_End": 2152.04, "Text": " Now, here's a really cool clone of that one called Justice Files."}, {"Time_Start": 2152.06, "Time_End": 2159.06, "Text": " The front page of this website, this is some justice files. This is, what it does is it provides"}, {"Time_Start": 2159.06, "Time_End": 2166.36, "Text": " name, salary, social security number, home address, spouses' names, kids' names, information"}, {"Time_Start": 2166.36, "Time_End": 2174.56, "Text": " about police officers. Well, now they started in Washington, and I'll tell you in a minute,"}, {"Time_Start": 2174.56, "Time_End": 2177.7599999999998, "Text": " they just won a court case, and I was looking at it this morning, and they say that by December"}, {"Time_Start": 2177.7599999999998, "Time_End": 2182.04, "Text": " they will have 23 million entries in their databases. Searchable data."}, {"Time_Start": 2182.06, "Time_End": 2185.56, "Text": " databases for law enforcement personnel, basically."}, {"Time_Start": 2185.56, "Time_End": 2191.66, "Text": " The front page of the website says, we are not encouraging anything."}, {"Time_Start": 2191.66, "Time_End": 2193.36, "Text": " No, no, no, no."}, {"Time_Start": 2193.36, "Time_End": 2197.96, "Text": " We don't believe in anything bad happening to anyone, please."}, {"Time_Start": 2197.96, "Time_End": 2201.2599999999998, "Text": " But we want police to know that any time they have an encounter with a citizen, they can"}, {"Time_Start": 2201.2599999999998, "Time_End": 2204.02, "Text": " be held accountable."}, {"Time_Start": 2204.02, "Time_End": 2207.06, "Text": " We think the public has the right to certain information about police so that if they"}, {"Time_Start": 2207.06, "Time_End": 2209.42, "Text": " haven't encountered, they can be held accountable."}, {"Time_Start": 2209.42, "Time_End": 2212.04, "Text": " I don't know what that means, but they're not encouraging anything."}, {"Time_Start": 2212.06, "Time_End": 2217.56, "Text": " wrong. This is from the site. Philip C. Goughlin is a Kirkland police officer. This is"}, {"Time_Start": 2217.56, "Time_End": 2222.06, "Text": " straight from the site. This is a picture of his house. There's a map to his home. You can find"}, {"Time_Start": 2222.06, "Time_End": 2225.06, "Text": " him. This causes police on discomfort."}, {"Time_Start": 2225.06, "Time_End": 2230.06, "Text": " Not happy with this. You know, they just don't like this."}, {"Time_Start": 2230.06, "Time_End": 2238.06, "Text": " So, what happened is that Washington adopted a statute that said you could bring a civil suit"}, {"Time_Start": 2238.06, "Time_End": 2241.06, "Text": " if somebody posted information about law enforcement officers with intent to harm or intimidate."}, {"Time_Start": 2241.06, "Time_End": 2248.06, "Text": " intimidate. About two weeks ago, a federal court struck that down, just like the"}, {"Time_Start": 2248.06, "Time_End": 2253.06, "Text": " Nuremberg files, and said that violates the First Amendment. They said it's not a threat."}, {"Time_Start": 2253.06, "Time_End": 2259.06, "Text": " And so now our friend says he's going to have 23 million, he's going to have 23 million entries in it by the end of the year,"}, {"Time_Start": 2259.06, "Time_End": 2262.06, "Text": " and you can search and find you member. He would like to take it national."}, {"Time_Start": 2262.06, "Time_End": 2263.06, "Text": " Yes."}, {"Time_Start": 2271.06, "Time_End": 2280.06, "Text": " In Washington, and we're bleeding about civil stuff, I don't do."}, {"Time_Start": 2280.06, "Time_End": 2284.06, "Text": " In Washington, you can get the names of police officers."}, {"Time_Start": 2284.06, "Time_End": 2286.06, "Text": " You get the names of police officers."}, {"Time_Start": 2286.06, "Time_End": 2288.06, "Text": " You find out the officer's name, you find out the officer's name, you find out the rank,"}, {"Time_Start": 2288.06, "Time_End": 2289.06, "Text": " you find out some other things."}, {"Time_Start": 2289.06, "Time_End": 2291.06, "Text": " That is the other thing in the site."}, {"Time_Start": 2291.06, "Time_End": 2292.06, "Text": " Everything here is public domain."}, {"Time_Start": 2292.06, "Time_End": 2294.06, "Text": " Everything is public information."}, {"Time_Start": 2294.06, "Time_End": 2295.06, "Text": " Everything is publicly gathered."}, {"Time_Start": 2295.06, "Time_End": 2299.06, "Text": " He says now, with his 23 million, his database of 23 million entries,"}, {"Time_Start": 2299.06, "Time_End": 2300.06, "Text": " he wants to have a searchable database."}, {"Time_Start": 2300.06, "Time_End": 2301.06, "Text": " He wants to have a searchable database."}, {"Time_Start": 2301.06, "Time_End": 2305.22, "Text": " on various parameters so that you could find out anything you wanted to find."}, {"Time_Start": 2305.2999999999997, "Time_End": 2308.66, "Text": " Well, not anything, but you could find out a lot about the people and somebody."}, {"Time_Start": 2308.66, "Time_End": 2308.92, "Text": " Yes."}, {"Time_Start": 2311.82, "Time_End": 2312.42, "Text": " It did."}, {"Time_Start": 2313.88, "Time_End": 2315.9, "Text": " They were taken down."}, {"Time_Start": 2316.2, "Time_End": 2320.66, "Text": " There was a county court challenge to the whole thing."}, {"Time_Start": 2320.7999999999997, "Time_End": 2323.24, "Text": " And that judge said, not social security numbers."}, {"Time_Start": 2323.34, "Time_End": 2324.7599999999998, "Text": " Basically, it's kind of an odd theory."}, {"Time_Start": 2325.18, "Time_End": 2326.72, "Text": " But that they are not, you know, this is speech."}, {"Time_Start": 2326.86, "Time_End": 2327.74, "Text": " The information is speech."}, {"Time_Start": 2327.74, "Time_End": 2329.94, "Text": " But the social security numbers are more like a tool."}, {"Time_Start": 2330.06, "Time_End": 2330.98, "Text": " They're not really speech."}, {"Time_Start": 2331.06, "Time_End": 2332.94, "Text": " You know, I don't write these opinions."}, {"Time_Start": 2335.1, "Time_End": 2341.62, "Text": " Now, with this, he says he's going to put social security numbers back up because he says he's cleared."}, {"Time_Start": 2342.7, "Time_End": 2349.9, "Text": " So this is, one of my themes here, you know, power of different things happening, is this is a very passive kind of thing."}, {"Time_Start": 2349.9, "Time_End": 2356.14, "Text": " But I don't know that we can do much about this with our First Amendment, that it causes consternation."}, {"Time_Start": 2356.2599999999998, "Time_End": 2356.98, "Text": " And somebody had a hand up?"}, {"Time_Start": 2361.06, "Time_End": 2368.58, "Text": " State Bill of 1386, which restricts the publishing of type of personal information on the web."}, {"Time_Start": 2369.08, "Time_End": 2370.6, "Text": " We've got like to our decisions in California."}, {"Time_Start": 2371.04, "Time_End": 2373.74, "Text": " Well, you know, that takes us to another thing, which was that,"}, {"Time_Start": 2373.94, "Time_End": 2377.7799999999997, "Text": " and that interim when there was the Washington statute and they were trying to shut him down in Washington?"}, {"Time_Start": 2378.44, "Time_End": 2378.98, "Text": " What did he do?"}, {"Time_Start": 2380.32, "Time_End": 2381.02, "Text": " What did he do?"}, {"Time_Start": 2381.82, "Time_End": 2382.84, "Text": " He took it elsewhere."}, {"Time_Start": 2383.92, "Time_End": 2386.74, "Text": " I mean, at that point, you would go to the Washington site and there wasn't anything on it."}, {"Time_Start": 2387.16, "Time_End": 2388.4, "Text": " They'd say go to one of our mirror sites."}, {"Time_Start": 2388.4, "Time_End": 2389.94, "Text": " And by the way, if you'd like to mirror it, get in touch with it."}, {"Time_Start": 2389.94, "Time_End": 2391.26, "Text": " Get in touch with me."}, {"Time_Start": 2391.94, "Time_End": 2393.9, "Text": " I mean, before that, he'd been threatening to take it to Kuwait."}, {"Time_Start": 2393.96, "Time_End": 2394.92, "Text": " So he takes it to Kuwait."}, {"Time_Start": 2395.96, "Time_End": 2397.28, "Text": " Takes it to Kuwait now, what do we do?"}, {"Time_Start": 2397.88, "Time_End": 2398.68, "Text": " He takes it to Kuwait."}, {"Time_Start": 2398.76, "Time_End": 2399.7000000000003, "Text": " He left Washington."}, {"Time_Start": 2400.06, "Time_End": 2402.44, "Text": " I don't know if he went to Kuwait, but he took it to Kuwait."}, {"Time_Start": 2402.52, "Time_End": 2403.34, "Text": " So now it's in Kuwait."}, {"Time_Start": 2403.64, "Time_End": 2404.36, "Text": " Okay, great."}, {"Time_Start": 2404.44, "Time_End": 2405.34, "Text": " What do we do about that?"}, {"Time_Start": 2405.46, "Time_End": 2407.36, "Text": " Let me struggle onward here."}, {"Time_Start": 2408.18, "Time_End": 2410.08, "Text": " Because at some point they're going to hold up their hands."}, {"Time_Start": 2411.7200000000003, "Time_End": 2413.7200000000003, "Text": " Oh, yeah, this one, it's kind of a parenthetical,"}, {"Time_Start": 2413.88, "Time_End": 2415.4, "Text": " because this kind of fits in with that."}, {"Time_Start": 2415.48, "Time_End": 2417.64, "Text": " Okay, let me do this because it really is relevant."}, {"Time_Start": 2418.2400000000002, "Time_End": 2419.92, "Text": " Council of Europe, which is a cybercrime convention,"}, {"Time_Start": 2419.94, "Time_End": 2426.94, "Text": " which is the big attempts now to try to give consensus in laws across, cyber crime"}, {"Time_Start": 2426.94, "Time_End": 2428.94, "Text": " laws across countries."}, {"Time_Start": 2428.94, "Time_End": 2437.94, "Text": " Last year, adopted a protocol that criminalizes using computers to disseminate racist and xenophobic material."}, {"Time_Start": 2437.94, "Time_End": 2440.94, "Text": " It's material that targets race, ethnic, or national origins."}, {"Time_Start": 2440.94, "Time_End": 2444.94, "Text": " I like the fact that it doesn't include gender or gender of preference, but okay."}, {"Time_Start": 2444.94, "Time_End": 2447.94, "Text": " It has this, and it's a crime."}, {"Time_Start": 2447.94, "Time_End": 2452.94, "Text": " specifically intended to target, for example, Holocaust denial sites, Nazi sites,"}, {"Time_Start": 2452.94, "Time_End": 2453.94, "Text": " things like that."}, {"Time_Start": 2453.94, "Time_End": 2455.94, "Text": " This is going to be the flip side of Kuwait."}, {"Time_Start": 2455.94, "Time_End": 2457.94, "Text": " So let me do this and we'll come back to Kuwait."}, {"Time_Start": 2457.94, "Time_End": 2460.94, "Text": " We can't do this."}, {"Time_Start": 2460.94, "Time_End": 2462.94, "Text": " We oppose this."}, {"Time_Start": 2462.94, "Time_End": 2465.94, "Text": " We didn't want this in the Council of Europe Convention at the first place."}, {"Time_Start": 2465.94, "Time_End": 2468.94, "Text": " It is now in the, there's now a separate protocol,"}, {"Time_Start": 2468.94, "Time_End": 2470.94, "Text": " and we can't do this because of our First Amendment."}, {"Time_Start": 2470.94, "Time_End": 2474.94, "Text": " The same reason we have to let the Nuremberg files up and the Justice files up"}, {"Time_Start": 2474.94, "Time_End": 2475.94, "Text": " and other things."}, {"Time_Start": 2475.94, "Time_End": 2476.94, "Text": " We host, you know,"}, {"Time_Start": 2476.94, "Time_End": 2482.94, "Text": " you know, Holocaust denial sites, Nazi sites, different kinds of sites that people around the world find aggravating."}, {"Time_Start": 2482.94, "Time_End": 2487.94, "Text": " And that causes a great deal of tension, has caused, is causing, a great deal of tension with other countries,"}, {"Time_Start": 2487.94, "Time_End": 2492.94, "Text": " with Europe in terms of this because they say, and this is something I always emphasize."}, {"Time_Start": 2492.94, "Time_End": 2494.94, "Text": " You know, we're sheltering these people."}, {"Time_Start": 2494.94, "Time_End": 2497.94, "Text": " I say there's talking about cybercrime havens."}, {"Time_Start": 2497.94, "Time_End": 2501.94, "Text": " There is one cybercrime haven in the world right now, and it's us."}, {"Time_Start": 2501.94, "Time_End": 2504.94, "Text": " And it's us in terms of this."}, {"Time_Start": 2504.94, "Time_End": 2505.94, "Text": " Because we have to protect speech."}, {"Time_Start": 2505.94, "Time_End": 2509.94, "Text": " to protect speech, right? We have to allow this."}, {"Time_Start": 2509.94, "Time_End": 2512.94, "Text": " I mean, in one point, I don't know if you saw it was about a year ago."}, {"Time_Start": 2512.94, "Time_End": 2513.94, "Text": " Year ago?"}, {"Time_Start": 2513.94, "Time_End": 2514.94, "Text": " A year and a half ago?"}, {"Time_Start": 2514.94, "Time_End": 2518.94, "Text": " Ocho Schiele, who's a German minister of justice, for God's sake,"}, {"Time_Start": 2518.94, "Time_End": 2523.94, "Text": " was proposing denial of service attacks on Nazi websites in our country"}, {"Time_Start": 2523.94, "Time_End": 2525.94, "Text": " to shut them down."}, {"Time_Start": 2525.94, "Time_End": 2526.94, "Text": " Because of course we don't extradite."}, {"Time_Start": 2526.94, "Time_End": 2527.94, "Text": " We can't extradite."}, {"Time_Start": 2527.94, "Time_End": 2528.94, "Text": " It's not a crime here."}, {"Time_Start": 2528.94, "Time_End": 2531.94, "Text": " So you get these tensions, which is leading me into."}, {"Time_Start": 2531.94, "Time_End": 2534.94, "Text": " Oh, yes, that's just people."}, {"Time_Start": 2534.94, "Time_End": 2536.94, "Text": " That's just people store records and things."}, {"Time_Start": 2536.94, "Time_End": 2538.94, "Text": " I'm going to have to move on."}, {"Time_Start": 2538.94, "Time_End": 2539.94, "Text": " Let me move on."}, {"Time_Start": 2539.94, "Time_End": 2540.94, "Text": " All right."}, {"Time_Start": 2540.94, "Time_End": 2541.94, "Text": " Quickly."}, {"Time_Start": 2541.94, "Time_End": 2545.94, "Text": " Real rule crime, where our law enforcement system is set up,"}, {"Time_Start": 2545.94, "Time_End": 2546.94, "Text": " four assumptions."}, {"Time_Start": 2546.94, "Time_End": 2548.94, "Text": " Physical proximity, I've got to be there to take your laptop."}, {"Time_Start": 2548.94, "Time_End": 2549.94, "Text": " Number one."}, {"Time_Start": 2549.94, "Time_End": 2550.94, "Text": " Livided scale."}, {"Time_Start": 2550.94, "Time_End": 2552.94, "Text": " I take one laptop."}, {"Time_Start": 2552.94, "Time_End": 2553.94, "Text": " I take another laptop."}, {"Time_Start": 2553.94, "Time_End": 2555.94, "Text": " I can only do so much crime."}, {"Time_Start": 2555.94, "Time_End": 2556.94, "Text": " Physical constraints."}, {"Time_Start": 2556.94, "Time_End": 2557.94, "Text": " I take your laptop."}, {"Time_Start": 2557.94, "Time_End": 2558.94, "Text": " You see me."}, {"Time_Start": 2558.94, "Time_End": 2559.94, "Text": " I leave physical evidence."}, {"Time_Start": 2559.94, "Time_End": 2561.94, "Text": " I can be traced."}, {"Time_Start": 2561.94, "Time_End": 2562.94, "Text": " Patterns."}, {"Time_Start": 2562.94, "Time_End": 2564.94, "Text": " You can organize crimes into patterns."}, {"Time_Start": 2564.94, "Time_End": 2567.94, "Text": " None of that's going to work for cybercrime."}, {"Time_Start": 2567.94, "Time_End": 2571.94, "Text": " Our model of law enforcement is based on the idea that we have a transaction."}, {"Time_Start": 2571.94, "Time_End": 2572.94, "Text": " You can identify that."}, {"Time_Start": 2572.94, "Time_End": 2573.94, "Text": " You can find me."}, {"Time_Start": 2573.94, "Time_End": 2574.94, "Text": " You're going to capture me."}, {"Time_Start": 2574.94, "Time_End": 2575.94, "Text": " You're going to lock me up."}, {"Time_Start": 2575.94, "Time_End": 2576.94, "Text": " I'm going to be locked up."}, {"Time_Start": 2576.94, "Time_End": 2577.94, "Text": " All as well."}, {"Time_Start": 2577.94, "Time_End": 2578.94, "Text": " Nobody else will ever do that again."}, {"Time_Start": 2578.94, "Time_End": 2580.94, "Text": " Things will work nicely."}, {"Time_Start": 2580.94, "Time_End": 2582.94, "Text": " Cybercrime doesn't work like that, as you know."}, {"Time_Start": 2582.94, "Time_End": 2584.94, "Text": " Quote I like."}, {"Time_Start": 2584.94, "Time_End": 2586.94, "Text": " In the network world, no island is an island."}, {"Time_Start": 2586.94, "Time_End": 2587.94, "Text": " It doesn't make any difference."}, {"Time_Start": 2587.94, "Time_End": 2589.94, "Text": " Kuwait."}, {"Time_Start": 2589.94, "Time_End": 2591.94, "Text": " Put the website in Kuwait."}, {"Time_Start": 2591.94, "Time_End": 2593.94, "Text": " The Kuwaitis say, fine by us."}, {"Time_Start": 2593.94, "Time_End": 2594.94, "Text": " We don't like those American."}, {"Time_Start": 2594.94, "Time_End": 2595.94, "Text": " law enforcement people."}, {"Time_Start": 2595.94, "Time_End": 2596.94, "Text": " It's not our problem."}, {"Time_Start": 2596.94, "Time_End": 2597.94, "Text": " We don't have any laws on this."}, {"Time_Start": 2597.94, "Time_End": 2598.94, "Text": " This isn't a crime here."}, {"Time_Start": 2598.94, "Time_End": 2602.94, "Text": " Kind of the reverse of what we do with some of the German sites."}, {"Time_Start": 2602.94, "Time_End": 2604.94, "Text": " Guzman, you know Guzman."}, {"Time_Start": 2604.94, "Time_End": 2605.94, "Text": " I'm going to skip on."}, {"Time_Start": 2605.94, "Time_End": 2606.94, "Text": " Whoa."}, {"Time_Start": 2606.94, "Time_End": 2609.94, "Text": " You know this case, right?"}, {"Time_Start": 2609.94, "Time_End": 2611.94, "Text": " Gorshkov and Ivanov."}, {"Time_Start": 2611.94, "Time_End": 2613.94, "Text": " Gorshkov and Ivanov, the invite thing."}, {"Time_Start": 2613.94, "Time_End": 2614.94, "Text": " I don't imagine."}, {"Time_Start": 2614.94, "Time_End": 2615.94, "Text": " I have to go through the facts."}, {"Time_Start": 2615.94, "Time_End": 2617.94, "Text": " You know, the whole, you know, they put the case stroke logger on."}, {"Time_Start": 2617.94, "Time_End": 2621.94, "Text": " They get the password, username and password."}, {"Time_Start": 2621.94, "Time_End": 2623.94, "Text": " The FBI goes into the Russian computer, download."}, {"Time_Start": 2623.94, "Time_End": 2629.94, "Text": " computer downloads files for quite a long period of time and don't get a warrant."}, {"Time_Start": 2629.94, "Time_End": 2637.94, "Text": " So it's sucking information from a computer in another country back here with no warrant."}, {"Time_Start": 2637.94, "Time_End": 2639.94, "Text": " Now, then they hold on to it and they get a warrant."}, {"Time_Start": 2639.94, "Time_End": 2644.94, "Text": " And then of course the question becomes, these guys are going to move to suppress,"}, {"Time_Start": 2644.94, "Time_End": 2646.94, "Text": " I'm here."}, {"Time_Start": 2646.94, "Time_End": 2652.94, "Text": " They move to suppress and they say, hey, going into that computer and pulling those files back,"}, {"Time_Start": 2652.94, "Time_End": 2655.94, "Text": " pulling those files, copying those files. Remember my seizure?"}, {"Time_Start": 2655.94, "Time_End": 2662.94, "Text": " Copying those files, that's a seizure, and you had to have a warrant to do that."}, {"Time_Start": 2662.94, "Time_End": 2665.94, "Text": " Oh, and by the way, you violated Russian law."}, {"Time_Start": 2665.94, "Time_End": 2666.94, "Text": " Okay?"}, {"Time_Start": 2666.94, "Time_End": 2671.94, "Text": " The district court, which is not a model decision, is not a great decision,"}, {"Time_Start": 2671.94, "Time_End": 2674.94, "Text": " but we get decisions that aren't great sometimes."}, {"Time_Start": 2674.94, "Time_End": 2675.94, "Text": " We have to keep trying."}, {"Time_Start": 2675.94, "Time_End": 2679.94, "Text": " First of all, the court said the Fourth Amendment doesn't apply, and that's true."}, {"Time_Start": 2679.94, "Time_End": 2682.94, "Text": " Our Supreme Court has said a long time ago that our Fourth Amendment is"}, {"Time_Start": 2682.94, "Time_End": 2684.94, "Text": " It's for we the people, not those people."}, {"Time_Start": 2684.94, "Time_End": 2686.94, "Text": " We don't care about those people, okay?"}, {"Time_Start": 2686.94, "Time_End": 2688.94, "Text": " Just go do what you want to do."}, {"Time_Start": 2688.94, "Time_End": 2691.94, "Text": " Our Fourth Amendment applies for us within our territorial boundaries,"}, {"Time_Start": 2691.94, "Time_End": 2694.94, "Text": " so the FBI could go into that Russian computer."}, {"Time_Start": 2694.94, "Time_End": 2696.94, "Text": " It doesn't violate the Fourth Amendment."}, {"Time_Start": 2696.94, "Time_End": 2698.94, "Text": " I don't think that's a way to run a cyber world."}, {"Time_Start": 2698.94, "Time_End": 2702.94, "Text": " That's an editorial, but that's where we are with the traditional."}, {"Time_Start": 2702.94, "Time_End": 2705.94, "Text": " The court said there's no Russian law issue because,"}, {"Time_Start": 2705.94, "Time_End": 2709.94, "Text": " basically, hey, it's not a basis to suppress here, right?"}, {"Time_Start": 2709.94, "Time_End": 2711.94, "Text": " Not our law."}, {"Time_Start": 2711.94, "Time_End": 2715.66, "Text": " also said, this is another one I don't, I don't like any of this."}, {"Time_Start": 2716.66, "Time_End": 2721.8, "Text": " Even if the Fourth Amendment applied copying files is not a seizure because, hey, the stuff was still on Russia."}, {"Time_Start": 2722.88, "Time_End": 2724.54, "Text": " So they lose on all of those."}, {"Time_Start": 2724.64, "Time_End": 2727.92, "Text": " Now, I assume you know the next installment."}, {"Time_Start": 2730.18, "Time_End": 2734.06, "Text": " Now, the FBI said the reason we did this is we went to the Russians and they wouldn't help us"}, {"Time_Start": 2734.06, "Time_End": 2738.02, "Text": " because there was no mutual legal assistance treaty in effect that encompassed it"}, {"Time_Start": 2738.02, "Time_End": 2741.92, "Text": " so they wouldn't do anything for us when we had no choice because these guys are victimizing America."}, {"Time_Start": 2741.94, "Time_End": 2745.56, "Text": " and businesses, but we had to do something, we had to use what the law called self-help."}, {"Time_Start": 2747.12, "Time_End": 2751.26, "Text": " Did you see this last August, the Russians charged one of the FBI agents with hacking?"}, {"Time_Start": 2753.76, "Time_End": 2762.26, "Text": " Charged in August and the Russians said he's been charged with hacking and he's been charged with hacking and send him on down."}, {"Time_Start": 2764.18, "Time_End": 2765.02, "Text": " Now what do?"}, {"Time_Start": 2768.2200000000003, "Time_End": 2768.92, "Text": " Right, what?"}, {"Time_Start": 2768.92, "Time_End": 2769.0, "Text": " What?"}, {"Time_Start": 2769.96, "Time_End": 2770.4, "Text": " What?"}, {"Time_Start": 2771.0, "Time_End": 2771.44, "Text": " Who?"}, {"Time_Start": 2771.94, "Time_End": 2777.7200000000003, "Text": " And then in November, they said, hello, we're waiting."}, {"Time_Start": 2779.06, "Time_End": 2780.12, "Text": " He broke our law."}, {"Time_Start": 2781.46, "Time_End": 2782.8, "Text": " He went into a computer system."}, {"Time_Start": 2782.88, "Time_End": 2783.88, "Text": " He wasn't authorized to go into."}, {"Time_Start": 2784.32, "Time_End": 2784.98, "Text": " That's a crime."}, {"Time_Start": 2786.14, "Time_End": 2787.04, "Text": " I can show you the statute."}, {"Time_Start": 2787.16, "Time_End": 2787.78, "Text": " He broke the law."}, {"Time_Start": 2788.66, "Time_End": 2789.48, "Text": " And that was in November."}, {"Time_Start": 2789.6, "Time_End": 2790.2400000000002, "Text": " And what has happened?"}, {"Time_Start": 2792.54, "Time_End": 2793.98, "Text": " What are we going to do?"}, {"Time_Start": 2796.04, "Time_End": 2798.42, "Text": " Just, not not us."}, {"Time_Start": 2799.18, "Time_End": 2800.64, "Text": " I mean, it, huh?"}, {"Time_Start": 2801.94, "Time_End": 2809.2000000000003, "Text": " Well, there may be, see, what we're really doing is I understand it is we're just not thinking about it."}, {"Time_Start": 2809.3, "Time_End": 2813.56, "Text": " We're just kind of not, it's, we'll someday, maybe, we'll get to that."}, {"Time_Start": 2813.94, "Time_End": 2820.5, "Text": " My point on this, and I need to wrap up, my point on this, and I'm sorry, I didn't get through, which I should go to."}, {"Time_Start": 2823.56, "Time_End": 2823.96, "Text": " Where?"}, {"Time_Start": 2824.12, "Time_End": 2825.62, "Text": " See, I didn't get through many things."}, {"Time_Start": 2825.7200000000003, "Time_End": 2826.06, "Text": " There we go."}, {"Time_Start": 2826.54, "Time_End": 2827.56, "Text": " This is my email address."}, {"Time_Start": 2828.44, "Time_End": 2831.88, "Text": " My point is, these in many other respects, I didn't get to."}, {"Time_Start": 2831.94, "Time_End": 2833.7000000000003, "Text": " cybercrime causes problems."}, {"Time_Start": 2833.82, "Time_End": 2836.44, "Text": " This cross-border stuff, you have difficulties with the cross-border."}, {"Time_Start": 2836.54, "Time_End": 2838.1, "Text": " We have trouble figuring out what our crimes are."}, {"Time_Start": 2838.48, "Time_End": 2840.28, "Text": " We have problems figuring out crimes in different countries."}, {"Time_Start": 2840.38, "Time_End": 2841.56, "Text": " We have cultural conflicts."}, {"Time_Start": 2841.96, "Time_End": 2842.86, "Text": " We allow speech."}, {"Time_Start": 2842.98, "Time_End": 2844.2200000000003, "Text": " Other countries criminalize."}, {"Time_Start": 2845.04, "Time_End": 2846.2000000000003, "Text": " And it's difficult."}, {"Time_Start": 2846.4, "Time_End": 2847.2000000000003, "Text": " And I think that's enough."}, {"Time_Start": 2847.82, "Time_End": 2848.02, "Text": " Right?"}, {"Time_Start": 2848.82, "Time_End": 2849.66, "Text": " Okay, we're done."}, {"Time_Start": 2861.94, "Time_End": 2862.64, "Text": " I don't know."}]}