{"segments": [{"Time_Start": 0.0, "Time_End": 17.0, "Text": " I'll use the working keyboard."}, {"Time_Start": 17.0, "Time_End": 27.0, "Text": " I have a hobbled laptop due to the internal keyboard sparing the inside parts from a glass of orange juice two days ago."}, {"Time_Start": 27.0, "Time_End": 32.0, "Text": " And the talk had to be rewritten subsequently, so here we go."}, {"Time_Start": 32.0, "Time_End": 35.0, "Text": " So the title obviously is fashionably late."}, {"Time_Start": 35.0, "Time_End": 36.0, "Text": " I'll explain."}, {"Time_Start": 36.0, "Time_End": 43.0, "Text": " Actually, you probably will figure out over time what I mean by fashionably late with regards to round trip times."}, {"Time_Start": 43.0, "Time_End": 51.0, "Text": " But in any case, this is a discussion mostly of what's going on in the murky underwaters of networks"}, {"Time_Start": 51.0, "Time_End": 56.0, "Text": " that actually have real load on them and experience real problems."}, {"Time_Start": 56.0, "Time_End": 72.0, "Text": " I found through a couple of discussions with folks at school that generally the research crowd in the world doesn't regard analyzing round-trip times and anything more than doing fancy histograms, smoothing, that sort of thing, isn't a very interesting thing."}, {"Time_Start": 72.0, "Time_End": 79.6, "Text": " I thought it was more interesting than a lot of folks did, so I decided to sit down, get some gear, and start pinging stuff really fast."}, {"Time_Start": 79.6, "Time_End": 85.98, "Text": " So we're going to talk today about something I would just colloquially refer to as"}, {"Time_Start": 86.0, "Time_End": 91.3, "Text": " active probes, kind of an entire field, if you will, of ways to analyze what's going"}, {"Time_Start": 91.3, "Time_End": 92.5, "Text": " on on a network."}, {"Time_Start": 92.5, "Time_End": 97.26, "Text": " That is, when you don't have something you can continuously observe, you need to go and get the"}, {"Time_Start": 97.26, "Time_End": 100.66, "Text": " measurements routinely over and over and over again."}, {"Time_Start": 100.66, "Time_End": 103.76, "Text": " Hence the name active probe."}, {"Time_Start": 103.76, "Time_End": 108.94, "Text": " Okay, so generally, I think I kind of almost talked to halfway through this."}, {"Time_Start": 108.94, "Time_End": 114.3, "Text": " We're going to talk about, I'm going to go quickly over the concepts behind active probing."}, {"Time_Start": 114.3, "Time_End": 121.3, "Text": " what you can expect from it, things that you have to be aware of, things that you just can't do with it."}, {"Time_Start": 121.3, "Time_End": 127.3, "Text": " Basically, known problems that are just understood, but I want to communicate before I display any kind of real data."}, {"Time_Start": 127.3, "Time_End": 137.3, "Text": " I also wanted to discuss the operational aspect and the practical aspect of doing this kind of analysis work and data gathering."}, {"Time_Start": 137.3, "Time_End": 143.3, "Text": " We'll also talk about how to identify, looking at some graphs, from an enterprise network, basically my school."}, {"Time_Start": 143.3, "Time_End": 149.3, "Text": " school, what features you want to look for in your own graphs if you do some sampling and what"}, {"Time_Start": 149.3, "Time_End": 155.3, "Text": " these things really mean to maybe network administrators or network engineers."}, {"Time_Start": 155.3, "Time_End": 163.3, "Text": " We will also, I'll basically kind of broach the topic, but this entire talk kind of is a, kind of"}, {"Time_Start": 163.3, "Time_End": 169.3, "Text": " a reason why we should look at something that we sample on a routine basis, like network delay,"}, {"Time_Start": 169.3, "Time_End": 170.3, "Text": " as a signal."}, {"Time_Start": 170.3, "Time_End": 172.3, "Text": " It's not just a datum."}, {"Time_Start": 172.3, "Time_End": 173.3, "Text": " It is a signal."}, {"Time_Start": 173.3, "Time_End": 175.3, "Text": " so to speak, a data set."}, {"Time_Start": 175.3, "Time_End": 179.3, "Text": " And if we interpret it as such, we find that there's a lot more interesting things, or at least I find"}, {"Time_Start": 179.3, "Time_End": 182.3, "Text": " there's a lot more interesting things to be seen than any other way."}, {"Time_Start": 182.3, "Time_End": 190.3, "Text": " And we'll of course have the required conclusion slide, which is useless."}, {"Time_Start": 190.3, "Time_End": 193.3, "Text": " So what are active probes really?"}, {"Time_Start": 193.3, "Time_End": 199.3, "Text": " Essentially we want, in this case, to determine the round trip delay between hosts."}, {"Time_Start": 199.3, "Time_End": 201.3, "Text": " Why is that important?"}, {"Time_Start": 201.3, "Time_End": 203.3, "Text": " Why that's important is what we'll see later."}, {"Time_Start": 203.3, "Time_End": 209.3, "Text": " essentially we have to actively probe the network itself to determine the state over and over again."}, {"Time_Start": 209.3, "Time_End": 213.3, "Text": " We could look at a couple things, like try to infer that."}, {"Time_Start": 213.3, "Time_End": 219.3, "Text": " We could look at a web server chained through routers to a dozen or so client machines"}, {"Time_Start": 219.3, "Time_End": 223.3, "Text": " and ramp TCP between the server and the clients like transferring FTP and that sort of thing,"}, {"Time_Start": 223.3, "Time_End": 228.3, "Text": " and maybe try to gauge between each packet the gap that exists,"}, {"Time_Start": 228.3, "Time_End": 232.3, "Text": " or the time it takes to see eight packets go out, one act back,"}, {"Time_Start": 232.3, "Time_End": 234.3, "Text": " if we know the congestion window we're operating,"}, {"Time_Start": 234.3, "Time_End": 239.3, "Text": " and basically using existing sessions, infer the delay between hosts."}, {"Time_Start": 239.3, "Time_End": 241.3, "Text": " Those methods can certainly work."}, {"Time_Start": 241.3, "Time_End": 245.3, "Text": " I don't think they can reveal the delay state 300 times a second,"}, {"Time_Start": 245.3, "Time_End": 249.3, "Text": " maybe two times a second, you could determine this by watching TCP."}, {"Time_Start": 249.3, "Time_End": 253.3, "Text": " So I want to know more rapidly what the delay state, inclusive,"}, {"Time_Start": 253.3, "Time_End": 256.3, "Text": " all the hops between me and an N node, would be."}, {"Time_Start": 256.3, "Time_End": 259.3, "Text": " So doing an inferential kind of flow-based,"}, {"Time_Start": 259.3, "Time_End": 262.3, "Text": " or looking at pairs of hosts,"}, {"Time_Start": 262.3, "Time_End": 266.3, "Text": " communicating, I don't think it's a real appropriate way to go."}, {"Time_Start": 266.3, "Time_End": 271.3, "Text": " Another problem is, in this condition, we want to look at specific characteristics between"}, {"Time_Start": 271.3, "Time_End": 276.3, "Text": " a source host and a destination or collection of destination nodes, and flows in the real world"}, {"Time_Start": 276.3, "Time_End": 280.3, "Text": " don't work the way we would necessarily want our experiment to go."}, {"Time_Start": 280.3, "Time_End": 286.3, "Text": " We wouldn't necessarily know that a person is ever going to be downloading an ISO for the entire time."}, {"Time_Start": 286.3, "Time_End": 290.3, "Text": " They may start it and the transfer may subsequently error out."}, {"Time_Start": 290.3, "Time_End": 291.3, "Text": " They may time out."}, {"Time_Start": 291.3, "Time_End": 292.3, "Text": " They may go away off."}, {"Time_Start": 292.3, "Time_End": 298.3, "Text": " the internet entirely. We can't really base any kind of routine experiment or routine measurement"}, {"Time_Start": 298.3, "Time_End": 305.3, "Text": " on looking at those types of traffic flows for more than just maybe ancillary data gathering."}, {"Time_Start": 305.3, "Time_End": 308.3, "Text": " We also want to know that we will have enough data to look at."}, {"Time_Start": 308.3, "Time_End": 314.3, "Text": " We may see that if on any average pipe from an ISP or a dial provider, the time,"}, {"Time_Start": 314.3, "Time_End": 320.3, "Text": " the transfer time for anyone person's TCP activity or maybe web surfing activity is"}, {"Time_Start": 320.3, "Time_End": 322.3, "Text": " 200 milliseconds, 300 milliseconds."}, {"Time_Start": 322.3, "Time_End": 325.3, "Text": " that may involve a couple hundred packets or three or four."}, {"Time_Start": 325.3, "Time_End": 330.3, "Text": " There's just really no way to know that we're going to have enough long-lived traffic to make any use of."}, {"Time_Start": 330.3, "Time_End": 338.3, "Text": " As far as things I like, pros about active probes is the sampling is very straightforward and very easy."}, {"Time_Start": 338.3, "Time_End": 344.3, "Text": " You write a program or use existing ones that just spew packets out and you wait for the replies,"}, {"Time_Start": 344.3, "Time_End": 346.3, "Text": " at least in this case."}, {"Time_Start": 346.3, "Time_End": 352.3, "Text": " Relatively low overhead, you're not hoping the TCP stack can do its segmentation, can do"}, {"Time_Start": 352.3, "Time_End": 357.3, "Text": " it's math to increment sequence numbers and all sorts of algorithmic overhead"}, {"Time_Start": 357.3, "Time_End": 361.3, "Text": " that just sending an ICMP echo request doesn't have."}, {"Time_Start": 361.3, "Time_End": 365.3, "Text": " You also can't control the probe characteristics necessarily."}, {"Time_Start": 365.3, "Time_End": 369.3, "Text": " If you, I'm sorry, you can control them yourself,"}, {"Time_Start": 369.3, "Time_End": 371.3, "Text": " that's what I meant to say."}, {"Time_Start": 371.3, "Time_End": 374.3, "Text": " You will be able to control the rate of sending,"}, {"Time_Start": 374.3, "Time_End": 376.3, "Text": " unless you make modifications to TCP,"}, {"Time_Start": 376.3, "Time_End": 379.3, "Text": " it will attempt to ferry the data between its buffer and the far-hosts buffer"}, {"Time_Start": 379.3, "Time_End": 381.3, "Text": " as quickly as possible,"}, {"Time_Start": 381.3, "Time_End": 382.3, "Text": " without,"}, {"Time_Start": 382.3, "Time_End": 385.90000000000003, "Text": " course incurring too much loss. We don't want that. We want a committed information rate,"}, {"Time_Start": 385.90000000000003, "Time_End": 394.2, "Text": " not a maximum information right between hosts. Downsides, of course, would certainly, excuse me,"}, {"Time_Start": 394.2, "Time_End": 402.2, "Text": " I can't even read my text. My laptop display does not work this way. So if we were to probe quickly,"}, {"Time_Start": 402.2, "Time_End": 405.3, "Text": " we'd obviously see that there's an additional load in the link. We would have to basically make sure"}, {"Time_Start": 405.3, "Time_End": 410.3, "Text": " that we gauge our own probing in respects to how much bandwidth we know to be available between the"}, {"Time_Start": 410.3, "Time_End": 412.28000000000003, "Text": " hosts, or can at least reasonably guess, is available between the hosts,"}, {"Time_Start": 412.3, "Time_End": 417.3, "Text": " the two hosts we care about. We could very easily overrun a constrained link"}, {"Time_Start": 417.3, "Time_End": 422.3, "Text": " and get useless samples as a result or cause undue amounts of errors in our results"}, {"Time_Start": 422.3, "Time_End": 426.3, "Text": " unless we can carefully gauge this. I found that in just generic testing,"}, {"Time_Start": 426.3, "Time_End": 430.3, "Text": " 100 packets to 200 packets per second is not all that damaging, especially if they're"}, {"Time_Start": 430.3, "Time_End": 435.3, "Text": " containing maybe 8 byte ICMP echo request payloads."}, {"Time_Start": 435.3, "Time_End": 441.3, "Text": " So we don't see more than 5 or 6K a second, typically on a link when I do any kind of tests like these."}, {"Time_Start": 442.3, "Time_End": 451.3, "Text": " One last issue is certainly when you want to send packets on a known interval,"}, {"Time_Start": 451.3, "Time_End": 459.3, "Text": " it's not necessarily true that your host's IP stack will honor those requests to send data."}, {"Time_Start": 459.3, "Time_End": 462.3, "Text": " Generally, ICMP is the best out of TCP or UDP."}, {"Time_Start": 462.3, "Time_End": 468.3, "Text": " There could be plenty of good things going on that buffer up enough data to send a much larger chunk to be more efficient."}, {"Time_Start": 468.3, "Time_End": 471.3, "Text": " There could be much of algorithms in the way of you."}, {"Time_Start": 471.3, "Time_End": 476.7, "Text": " With ICMP you are at the resolution of the user land process dumping some data somewhere,"}, {"Time_Start": 476.7, "Time_End": 481.5, "Text": " which on an unloaded machine with recent kernels, as I've noticed really isn't too bad."}, {"Time_Start": 481.5, "Time_End": 486.2, "Text": " So we don't have to go to extremes and lengths of constructing real-time OSs or even"}, {"Time_Start": 486.2, "Time_End": 490.92, "Text": " configuring a real-time OS to run our sampling applications, although certainly those should"}, {"Time_Start": 490.92, "Time_End": 495.52, "Text": " provide even more accurate results."}, {"Time_Start": 495.52, "Time_End": 501.28000000000003, "Text": " So the talk also, I want to focus a little bit on something akin to what a fear"}, {"Time_Start": 501.3, "Time_End": 506.3, "Text": " earlier was referring to in terms of how he's using ICMP details in the headers now"}, {"Time_Start": 506.3, "Time_End": 511.3, "Text": " to nail a host or fingerprint a host's characteristics, that is."}, {"Time_Start": 511.3, "Time_End": 517.3, "Text": " In terms of the way of machine replies to these rapid fire pings, so to speak,"}, {"Time_Start": 517.3, "Time_End": 525.3, "Text": " you can definitely find that in a lot of systems, replying to ICMP is not a big priority."}, {"Time_Start": 525.3, "Time_End": 531.28, "Text": " That's actually a very good trait, but that is the very trait that is the very trait that is worth looking"}, {"Time_Start": 531.3, "Time_End": 537.8599999999999, "Text": " for. So if you had five router vendors, different engineers in each camp, certainly they're"}, {"Time_Start": 537.8599999999999, "Time_End": 543.9799999999999, "Text": " not going to decide how to reply to ICMP differently, lower prioritized the same way five"}, {"Time_Start": 543.9799999999999, "Time_End": 548.9599999999999, "Text": " times. You may see some runners use a scheduler on a specific interval to always reply to management"}, {"Time_Start": 548.9599999999999, "Time_End": 555.02, "Text": " traffic, which may include pinging ICMP, or basically ICMP messages to be sent at that time, routing"}, {"Time_Start": 555.02, "Time_End": 560.18, "Text": " messages, that sort of thing. The main focus obviously on a router is to pass user data are things that"}, {"Time_Start": 560.1800000000001, "Time_End": 564.4200000000001, "Text": " make the ISP money. Pinging a router doesn't make an ISP money. Transiting customer data does."}, {"Time_Start": 565.0400000000001, "Time_End": 570.1200000000001, "Text": " So between Cisco and Foundry and Juniper, there's certainly going to be differences in how they handle"}, {"Time_Start": 570.1200000000001, "Time_End": 576.1400000000001, "Text": " management traffic. And while some may say that's the very reason we don't want to look at this data,"}, {"Time_Start": 576.44, "Time_End": 580.98, "Text": " I think the opposite. I think it should be very unique to each router vendor and possibly within"}, {"Time_Start": 580.98, "Time_End": 582.98, "Text": " a classification or category of router as well."}, {"Time_Start": 587.3800000000001, "Time_End": 589.96, "Text": " Okay, so when you look at network delay,"}, {"Time_Start": 590.1800000000001, "Time_End": 603.6200000000001, "Text": " What you'll see is, upon sampling a path between, say, yourself and Yahoo.com, you'll find most of the values come back on some sort of low, random noise, like a background noise of sorts."}, {"Time_Start": 604.0600000000001, "Time_End": 608.5400000000001, "Text": " And you'll see these, for example, larger items that are spikes in delay."}, {"Time_Start": 609.0400000000001, "Time_End": 617.0600000000001, "Text": " I would generally categorically split these kinds of measurements, or at least these measurements you observe, into two groups."}, {"Time_Start": 617.0600000000001, "Time_End": 622.6, "Text": " one that involves small-scale events that contribute to the average delay you see, the background noise,"}, {"Time_Start": 623.0400000000001, "Time_End": 629.7, "Text": " and then large-scale events that contribute to the actual peak delay you may observe the spikes you see throughout your sample set."}, {"Time_Start": 630.1, "Time_End": 635.7600000000001, "Text": " And those are two elements that are present in the same sample data, but come from distinct sources."}, {"Time_Start": 636.5400000000001, "Time_End": 639.2600000000001, "Text": " So I always would separate those two, certainly."}, {"Time_Start": 641.6400000000001, "Time_End": 647.0400000000001, "Text": " I think I discussed a little bit how we're doing this, but here's just some example coming."}, {"Time_Start": 647.0600000000001, "Time_End": 650.0600000000001, "Text": " that I've found work reliably well."}, {"Time_Start": 650.0600000000001, "Time_End": 652.0600000000001, "Text": " Time."}, {"Time_Start": 652.0600000000001, "Time_End": 657.0600000000001, "Text": " Time is a great command to see how long some subsequent arguments take to execute."}, {"Time_Start": 657.0600000000001, "Time_End": 661.0600000000001, "Text": " And generally, on anything a gigahertz or faster,"}, {"Time_Start": 661.0600000000001, "Time_End": 667.0600000000001, "Text": " you can find that waiting 8 milliseconds really means about 10 milliseconds reliably between ping reps."}, {"Time_Start": 667.0600000000001, "Time_End": 669.0600000000001, "Text": " Now, this takes some guesswork to nail."}, {"Time_Start": 669.0600000000001, "Time_End": 676.0600000000001, "Text": " You just need to basically ping a set-known packet set payload count, say 1,000 and 2,000 packets."}, {"Time_Start": 676.0600000000001, "Time_End": 680.0600000000001, "Text": " thousand packets and time how long it takes."}, {"Time_Start": 680.0600000000001, "Time_End": 686.0600000000001, "Text": " The rate at which each packet is sent, I found it has noise below 10 or 12 microseconds."}, {"Time_Start": 686.0600000000001, "Time_End": 693.0600000000001, "Text": " And those measurements, that noise of the self-scheduling on the system is very, very, very far below"}, {"Time_Start": 693.0600000000001, "Time_End": 697.0600000000001, "Text": " the actual noise you'll see from a router with less CPU than you or a link that's busy."}, {"Time_Start": 697.0600000000001, "Time_End": 704.0600000000001, "Text": " So I can, I would say to anyone wondering about whether or not your own local machines impact is going to be present in the data,"}, {"Time_Start": 704.0600000000001, "Time_End": 705.0600000000001, "Text": " that it probably is a very small point."}, {"Time_Start": 705.0600000000001, "Time_End": 708.0600000000001, "Text": " probably is a very small portion of anything."}, {"Time_Start": 708.0600000000001, "Time_End": 714.0600000000001, "Text": " Once you then know what kind of interval will get you the samples you want,"}, {"Time_Start": 714.0600000000001, "Time_End": 717.0600000000001, "Text": " how many packets per second you want for a sampling rate,"}, {"Time_Start": 717.0600000000001, "Time_End": 719.0600000000001, "Text": " you can just take and drop the data to a text file,"}, {"Time_Start": 719.0600000000001, "Time_End": 721.0600000000001, "Text": " and then parse out the stuff you don't want."}, {"Time_Start": 721.0600000000001, "Time_End": 725.0600000000001, "Text": " I just run it through Ock, say, give me the value times 100"}, {"Time_Start": 725.0600000000001, "Time_End": 728.0600000000001, "Text": " so I have microseconds instead of milliseconds."}, {"Time_Start": 728.0600000000001, "Time_End": 730.0600000000001, "Text": " Pretty simple, or was it a thousand?"}, {"Time_Start": 730.0600000000001, "Time_End": 732.0600000000001, "Text": " Yeah, thousand, thanks."}, {"Time_Start": 732.0600000000001, "Time_End": 735.0400000000001, "Text": " So then once we have data,"}, {"Time_Start": 735.0600000000001, "Time_End": 737.0600000000001, "Text": " and make some use of it."}, {"Time_Start": 737.0600000000001, "Time_End": 743.0600000000001, "Text": " So we immediately jump into kind of an operational setting here."}, {"Time_Start": 743.0600000000001, "Time_End": 747.0600000000001, "Text": " We will look specifically in whatever graphing application we have,"}, {"Time_Start": 747.0600000000001, "Time_End": 752.0600000000001, "Text": " to look at a time series, that is just a time and amplitude graph,"}, {"Time_Start": 752.0600000000001, "Time_End": 758.0600000000001, "Text": " to pick apart the high, with the large-scale events from the small-scale events."}, {"Time_Start": 758.0600000000001, "Time_End": 764.0600000000001, "Text": " And we'll also spend time then looking for other events that we can basically find similar"}, {"Time_Start": 764.0600000000001, "Time_End": 766.0600000000001, "Text": " find similar across all of our samples."}, {"Time_Start": 766.0600000000001, "Time_End": 768.0600000000001, "Text": " So if you try to determine, say,"}, {"Time_Start": 768.0600000000001, "Time_End": 772.0600000000001, "Text": " a path impairment somewhere between yourself and some other customer"}, {"Time_Start": 772.0600000000001, "Time_End": 774.0600000000001, "Text": " that you don't manage the routers in between,"}, {"Time_Start": 774.0600000000001, "Time_End": 777.0600000000001, "Text": " you may find that you can go to each router's IP stack,"}, {"Time_Start": 777.0600000000001, "Time_End": 780.0600000000001, "Text": " ping it rapidly, and spot the consistencies between the routers"}, {"Time_Start": 780.0600000000001, "Time_End": 782.0600000000001, "Text": " if they're all the same vendor, for example,"}, {"Time_Start": 782.0600000000001, "Time_End": 785.0600000000001, "Text": " and then find any differences quite obviously."}, {"Time_Start": 785.0600000000001, "Time_End": 788.0600000000001, "Text": " Some things you'll find in typical data that are"}, {"Time_Start": 788.0600000000001, "Time_End": 791.0600000000001, "Text": " of great importance and great telling are shark fins,"}, {"Time_Start": 791.0600000000001, "Time_End": 794.0600000000001, "Text": " or something that a researcher at University of us"}, {"Time_Start": 794.0600000000001, "Time_End": 797.96, "Text": " Wisconsin-Madison called Shark Finns."}, {"Time_Start": 797.96, "Time_End": 801.2600000000001, "Text": " He did a lot of, this person I'm referring to, his name is Jim Gast."}, {"Time_Start": 801.2600000000001, "Time_End": 805.5200000000001, "Text": " He hasn't published his thesis yet, so I couldn't reference anything."}, {"Time_Start": 805.5200000000001, "Time_End": 812.6, "Text": " But he basically piled through something called the surveyer data set, which was a project"}, {"Time_Start": 812.6, "Time_End": 818.6600000000001, "Text": " that lasted from, I believe, 1998 to late 2001, 2002, which involves 60 machines on the public"}, {"Time_Start": 818.6600000000001, "Time_End": 822.5600000000001, "Text": " internet, pinging each other two times a second, and trace writing every five minutes."}, {"Time_Start": 822.5600000000001, "Time_End": 823.5600000000001, "Text": " And it was a full match."}, {"Time_Start": 823.5600000000001, "Time_End": 826.5600000000001, "Text": " match for each of the 60 nodes at ping every other node."}, {"Time_Start": 826.5600000000001, "Time_End": 829.5600000000001, "Text": " And with all this cross-sectional data through the network,"}, {"Time_Start": 829.5600000000001, "Time_End": 831.5600000000001, "Text": " for the public internet at large,"}, {"Time_Start": 831.5600000000001, "Time_End": 835.5600000000001, "Text": " you could find similar events that kind of gave you the impression that"}, {"Time_Start": 835.5600000000001, "Time_End": 839.5600000000001, "Text": " at some point in the network, some interface or some link got seriously overloaded,"}, {"Time_Start": 839.5600000000001, "Time_End": 842.5600000000001, "Text": " and you saw the ripple effect, so to speak."}, {"Time_Start": 842.5600000000001, "Time_End": 846.5600000000001, "Text": " You saw congestion that link, and you saw other links that reacted to it,"}, {"Time_Start": 846.5600000000001, "Time_End": 849.5600000000001, "Text": " they became congestion, and so on and so forth."}, {"Time_Start": 849.5600000000001, "Time_End": 852.5600000000001, "Text": " The effect was kind of like dropping a pebble on a water surface,"}, {"Time_Start": 852.5600000000001, "Time_End": 855.5600000000001, "Text": " surface and watching the waves propagate."}, {"Time_Start": 855.5600000000001, "Time_End": 860.5600000000001, "Text": " So the characteristic that Jim named these events where the drillet would rise"}, {"Time_Start": 860.5600000000001, "Time_End": 863.5600000000001, "Text": " significantly quickly and then trail off quickly were shark fins."}, {"Time_Start": 863.5600000000001, "Time_End": 865.5600000000001, "Text": " That's what they look like."}, {"Time_Start": 865.5600000000001, "Time_End": 868.5600000000001, "Text": " The second characteristic you'll find is when you're looking at"}, {"Time_Start": 868.5600000000001, "Time_End": 871.5600000000001, "Text": " a frequency-decomposed version of the time series data,"}, {"Time_Start": 871.5600000000001, "Time_End": 876.5600000000001, "Text": " is you'll see specific rings, ringing tones, so to speak,"}, {"Time_Start": 876.5600000000001, "Time_End": 879.5600000000001, "Text": " in the way the delay varies over time."}, {"Time_Start": 879.5600000000001, "Time_End": 882.5400000000001, "Text": " And to visualize these things are two packages that are"}, {"Time_Start": 882.5600000000001, "Time_End": 885.1600000000001, "Text": " I commonly use are Bodline and SigVu."}, {"Time_Start": 885.1600000000001, "Time_End": 887.5600000000001, "Text": " BaudLine's a much better Unix package,"}, {"Time_Start": 887.5600000000001, "Time_End": 891.46, "Text": " works on anything I've tried for FreeBSD in Linux kernels,"}, {"Time_Start": 891.46, "Time_End": 894.46, "Text": " runs an X beautifully well, has 24-bit visual output"}, {"Time_Start": 894.46, "Time_End": 899.72, "Text": " so that FFT results look pretty decent, aren't very aliased."}, {"Time_Start": 899.72, "Time_End": 902.1400000000001, "Text": " Sig view for Windows is a little bit less useful,"}, {"Time_Start": 902.1400000000001, "Time_End": 905.84, "Text": " but is also free, for limited time at least."}, {"Time_Start": 905.84, "Time_End": 908.72, "Text": " And can essentially do the same things that Baudline does"}, {"Time_Start": 908.72, "Time_End": 911.32, "Text": " in terms of viewing just time data or frequency data."}, {"Time_Start": 912.5600000000001, "Time_End": 916.5600000000001, "Text": " Okay, so long awaited."}, {"Time_Start": 916.5600000000001, "Time_End": 921.5600000000001, "Text": " Here is the effects, actually, of pinging a foundry big iron."}, {"Time_Start": 921.5600000000001, "Time_End": 926.5600000000001, "Text": " This is 100 packets a second, and the time scales you see in the bottom is pretty condensed."}, {"Time_Start": 926.5600000000001, "Time_End": 932.5600000000001, "Text": " We're running through about 10 seconds, 12 seconds with the time."}, {"Time_Start": 932.5600000000001, "Time_End": 936.5600000000001, "Text": " And the staircase patterns, as you can see, I wish I had a laser pointer to point these features out."}, {"Time_Start": 936.5600000000001, "Time_End": 940.5600000000001, "Text": " You'll see the staircase pattern is heavy towards the left side."}, {"Time_Start": 940.5600000000001, "Time_End": 942.5600000000001, "Text": " It becomes lighter and lighter and lighter as we go through time."}, {"Time_Start": 942.5600000000001, "Time_End": 949.5600000000001, "Text": " time and tends to shift downward again in terms of the random values that we tend to have delay focus on as we sample."}, {"Time_Start": 949.5600000000001, "Time_End": 957.5600000000001, "Text": " That edge is where the decision point presumably in the router is whether or not to reply during this interval or the next interval."}, {"Time_Start": 957.5600000000001, "Time_End": 965.5600000000001, "Text": " Again, as I was alluding to before, it seems as though this router vendor has a specific interval at which they will reply to management traffic."}, {"Time_Start": 965.5600000000001, "Time_End": 967.5600000000001, "Text": " And so this reveals it."}, {"Time_Start": 967.5600000000001, "Time_End": 970.5600000000001, "Text": " Now this is zoomed in."}, {"Time_Start": 970.5600000000001, "Time_End": 976.5600000000001, "Text": " The rate of delay that we see is pretty consistent minus the random noise and whatnot,"}, {"Time_Start": 976.5600000000001, "Time_End": 980.5600000000001, "Text": " but the previous feature, if you see the very center,"}, {"Time_Start": 980.5600000000001, "Time_End": 983.5600000000001, "Text": " there's an upward-going peak and a downward-going peak and downward-going peak,"}, {"Time_Start": 983.5600000000001, "Time_End": 990.5600000000001, "Text": " you can spot that exact same feature in almost the left third of the graph"}, {"Time_Start": 990.5600000000001, "Time_End": 993.5600000000001, "Text": " at that point as well."}, {"Time_Start": 993.5600000000001, "Time_End": 999.5600000000001, "Text": " So another router that had a chance to test was a Cisco 7513,"}, {"Time_Start": 999.5600000000001, "Time_End": 1006.5600000000001, "Text": " So 7513, this one is basically handling 3 or 400 segments of lane that come in over multiple"}, {"Time_Start": 1006.5600000000001, "Time_End": 1012.12, "Text": " OC3s from all over the campus."}, {"Time_Start": 1012.12, "Time_End": 1018.22, "Text": " And recently a feature was enabled to export all the S-flow data, or net flow data rather,"}, {"Time_Start": 1018.22, "Time_End": 1024.24, "Text": " and the spikes you see on a second interval presumably are for that, are that activity on the"}, {"Time_Start": 1024.24, "Time_End": 1029.54, "Text": " router CPU, some sort of scheduled event every second to free memory, push things across"}, {"Time_Start": 1029.56, "Time_End": 1034.86, "Text": " the management interfaces out to a sample receiving machine, so forth."}, {"Time_Start": 1035.32, "Time_End": 1039.36, "Text": " But if you were just to look at this data set without examining any other finer details,"}, {"Time_Start": 1039.72, "Time_End": 1043.72, "Text": " you may think that that staircase pattern or any kind of real interesting content isn't there."}, {"Time_Start": 1044.2, "Time_End": 1047.7, "Text": " Because of the large deviation in delay, that's hidden."}, {"Time_Start": 1048.1599999999999, "Time_End": 1053.84, "Text": " But if you were to magnify the graph, you'd see that the Cisco has a similar staircase pattern to the foundries."}, {"Time_Start": 1055.46, "Time_End": 1059.54, "Text": " So, again, there's a notion of a scheduler here."}, {"Time_Start": 1059.56, "Time_End": 1065.8, "Text": " in the router that would give us the impression at least to my eye that there's an interval"}, {"Time_Start": 1065.8, "Time_End": 1070.36, "Text": " at which you can emit a packet, but you will always get a response either that sample or the next one"}, {"Time_Start": 1070.36, "Time_End": 1078.12, "Text": " through time, or the next interval in time. And as my sending clock slowly drifts or changes through"}, {"Time_Start": 1078.12, "Time_End": 1081.96, "Text": " time or doesn't quite harmonize with the receiving clock and the reply clock in the router,"}, {"Time_Start": 1081.96, "Time_End": 1088.12, "Text": " I will see a strange, maybe a variation of where I'm hitting it on the money and then, so to speak,"}, {"Time_Start": 1088.1200000000001, "Time_End": 1092.38, "Text": " a few degrees later, off the money, and I wait exactly one more interval for reply."}, {"Time_Start": 1092.88, "Time_End": 1096.5200000000002, "Text": " So as I harmonize with the router, I can see that this staircase pattern grows and then"}, {"Time_Start": 1096.5200000000002, "Time_End": 1102.2800000000002, "Text": " almost immediately decays into this noise, and that could be very well the noise of my own sending"}, {"Time_Start": 1102.2800000000002, "Time_End": 1110.14, "Text": " clock. Going back a slide, ideally that I wouldn't have that grass, so to speak, up and above and below"}, {"Time_Start": 1110.14, "Time_End": 1116.42, "Text": " the trend line, but that could be caused easily enough by a random delay in the link, a fuller cue somewhere else,"}, {"Time_Start": 1116.42, "Time_End": 1122.22, "Text": " or my own sending clock, the sending interval, my system being a little bit ahead or a little bit behind"}, {"Time_Start": 1122.22, "Time_End": 1125.38, "Text": " and missing that interval just enough to see a deviation above or below."}, {"Time_Start": 1128.6200000000001, "Time_End": 1132.0800000000002, "Text": " And here's another example, a T1 connected router."}, {"Time_Start": 1132.2, "Time_End": 1136.0600000000002, "Text": " I was curious in general whether or not these harmonics I was observing were only something"}, {"Time_Start": 1136.0600000000002, "Time_End": 1141.38, "Text": " that somebody sitting on top of a large pipe, like a giggee to a university core switch,"}, {"Time_Start": 1141.98, "Time_End": 1146.3000000000002, "Text": " could see. I was curious whether or not low-speed, lower-speed links, that is,"}, {"Time_Start": 1146.42, "Time_End": 1151.38, "Text": " would still have enough, what's the word, temporal openness or temporal resolution,"}, {"Time_Start": 1151.88, "Time_End": 1153.66, "Text": " to convey these fine detail changes."}, {"Time_Start": 1154.18, "Time_End": 1157.4, "Text": " And certainly enough, another friend of mine who's a Savas customer,"}, {"Time_Start": 1158.8000000000002, "Time_End": 1164.6000000000001, "Text": " bless his heart, or maybe outpouring of sympathy,"}, {"Time_Start": 1165.64, "Time_End": 1168.68, "Text": " he has a 2624 on a T1 from them,"}, {"Time_Start": 1168.68, "Time_End": 1175.48, "Text": " and the same kind of harmonization with, presumably that router's timer to reply to management traffic,"}, {"Time_Start": 1175.5800000000002, "Time_End": 1176.3600000000001, "Text": " it also exists."}, {"Time_Start": 1176.42, "Time_End": 1179.8400000000001, "Text": " So it seems that this method, even though it's noisy,"}, {"Time_Start": 1180.4, "Time_End": 1182.98, "Text": " or that this sample is very noisy because of the T1,"}, {"Time_Start": 1183.1000000000001, "Time_End": 1188.5600000000002, "Text": " possibly having more traffic on it than a large, fast-y pipe at school,"}, {"Time_Start": 1189.02, "Time_End": 1192.48, "Text": " we may find that the trend lines still exist."}, {"Time_Start": 1194.98, "Time_End": 1199.2, "Text": " Okay, well, so that was the first interesting observation I made while doing these kinds of samples."}, {"Time_Start": 1200.02, "Time_End": 1206.4, "Text": " The second ones, after a hint from another research agent gassed, was that, well, if I'm"}, {"Time_Start": 1206.42, "Time_End": 1210.16, "Text": " sampling quickly, I mean, the test that he, the data that he was looking at for these,"}, {"Time_Start": 1210.42, "Time_End": 1213.22, "Text": " or found that these other anomalies occurred in, were at much lower rate."}, {"Time_Start": 1213.48, "Time_End": 1214.3200000000002, "Text": " Two samples a second."}, {"Time_Start": 1214.74, "Time_End": 1219.66, "Text": " I'm sampling at 100 or 200 a second, so I figured that maybe I should be looking for something else in the data."}, {"Time_Start": 1220.26, "Time_End": 1226.66, "Text": " And sure enough, the same kinds of spikes and delay would occur at these high-rate samples."}, {"Time_Start": 1227.3400000000001, "Time_End": 1232.9, "Text": " As you can see in this graph, we have two of these elements kind of zoomed in on,"}, {"Time_Start": 1232.9, "Time_End": 1236.22, "Text": " and the leading one contains a little bit of noise,"}, {"Time_Start": 1236.42, "Time_End": 1241.8000000000002, "Text": " a significant rise in delay and then fall off and then some additional noise and"}, {"Time_Start": 1241.8000000000002, "Time_End": 1249.6200000000001, "Text": " another event similar to the first and looking in closer we can see a bit a very"}, {"Time_Start": 1249.6200000000001, "Time_End": 1254.66, "Text": " interesting feature of these graphs now I didn't really explain what was going on in"}, {"Time_Start": 1254.66, "Time_End": 1260.24, "Text": " why the delay spikes like this but my my best theory on this occurrence is"}, {"Time_Start": 1260.24, "Time_End": 1266.4, "Text": " that in the typical communication of a bunch of hosts accessing some resources"}, {"Time_Start": 1266.42, "Time_End": 1271.1000000000001, "Text": " through a constrained pipe, you have the effect of TCP multiplexing happening on a narrower bandwidth."}, {"Time_Start": 1271.26, "Time_End": 1276.0, "Text": " That is the amount of transit you could see from all the nodes in your local network"}, {"Time_Start": 1276.0, "Time_End": 1281.3000000000002, "Text": " probably vastly exceeds the connectivity you have to your ISP, like say, fast-eathenet over a T1."}, {"Time_Start": 1281.88, "Time_End": 1287.0, "Text": " So TCP, if it's active on, say, 10, 20, 30 hosts, or maybe even a couple hundred from a larger campus,"}, {"Time_Start": 1287.68, "Time_End": 1293.66, "Text": " you may find that the rates each customer, each person would see on their machine to a far host is dynamic."}, {"Time_Start": 1294.04, "Time_End": 1296.18, "Text": " TCP is always going to try to ramp up and get more bandwidth."}, {"Time_Start": 1296.42, "Time_End": 1298.8000000000002, "Text": " until it sees losses and then fall off quickly."}, {"Time_Start": 1299.2, "Time_End": 1305.5, "Text": " That's the goal of the congestion window in TCP is not to denial of service yourself,"}, {"Time_Start": 1305.8000000000002, "Time_End": 1309.8000000000002, "Text": " but to get as much as you can up to the ceiling or as near as the ceiling as you can approach."}, {"Time_Start": 1310.8600000000001, "Time_End": 1316.0, "Text": " The interesting dynamics, though, in TCP, if you observe the delay through the same lengths"}, {"Time_Start": 1316.0, "Time_End": 1320.8200000000002, "Text": " that TCP is communicating over, is that right on the onset of that queue filling,"}, {"Time_Start": 1321.02, "Time_End": 1322.64, "Text": " certain special things happen in a router."}, {"Time_Start": 1322.64, "Time_End": 1328.5, "Text": " Qing in routers is an interesting discipline that I haven't spent more than a few months"}, {"Time_Start": 1328.5, "Time_End": 1332.3600000000001, "Text": " researching, but from what I understand, a lot of people these days implement something called"}, {"Time_Start": 1332.3600000000001, "Time_End": 1339.0400000000002, "Text": " random early detection, which is a method or a discipline to say on a router's output interface,"}, {"Time_Start": 1339.74, "Time_End": 1344.0200000000002, "Text": " that if more data than I can stuff on my link bandwidth or my link rate comes in in a certain"}, {"Time_Start": 1344.0200000000002, "Time_End": 1349.9, "Text": " interval, we should sense that threshold before the queue fills and then drop data from the queue"}, {"Time_Start": 1349.9, "Time_End": 1351.16, "Text": " in a certain percentage."}, {"Time_Start": 1351.6000000000001, "Time_End": 1355.3000000000002, "Text": " So if you had, say, a 16-kilobite cue onto a fast-ecentet pipe,"}, {"Time_Start": 1355.88, "Time_End": 1360.3200000000002, "Text": " you might want, not you might want, but if your router were to sense that a delta came through,"}, {"Time_Start": 1360.42, "Time_End": 1364.64, "Text": " some sort of additional data came through in a large burst that put the cue over the edge,"}, {"Time_Start": 1365.0400000000002, "Time_End": 1371.6000000000001, "Text": " and may try to drop packets randomly within that 16 kilobytes to introduce uniform loss to all the speakers."}, {"Time_Start": 1372.16, "Time_End": 1375.5, "Text": " The goal of which is to make the TCP people quiet down a little bit"}, {"Time_Start": 1375.5, "Time_End": 1379.68, "Text": " and not fill the queue up and not experience huge jitter or huge delay."}, {"Time_Start": 1379.9, "Time_End": 1387.64, "Text": " Well, the problem is that that works, but it takes at least around trip time and then some for the senders to back off."}, {"Time_Start": 1388.3600000000001, "Time_End": 1395.64, "Text": " So while that queue doesn't fill tremendously, it doesn't feel greatly, it still fills a little bit more than it usually is."}, {"Time_Start": 1396.14, "Time_End": 1397.2800000000002, "Text": " And we observe that here."}, {"Time_Start": 1397.52, "Time_End": 1404.2, "Text": " If I'm pinging an end host 100 times a second, that's a packet every 10 milliseconds that I'm going to send out and hopefully receive."}, {"Time_Start": 1404.68, "Time_End": 1409.5600000000002, "Text": " So every 10 milliseconds, I'm getting an idea of the state of some collection of buffers in this network."}, {"Time_Start": 1409.9, "Time_End": 1416.5, "Text": " And the interesting result of that is when that cue becomes nearly full,"}, {"Time_Start": 1417.0, "Time_End": 1424.94, "Text": " I miss samples for a brief window of time, say 100s, some milliseconds or whatever round-trip time those senders have between themselves."}, {"Time_Start": 1425.5, "Time_End": 1427.66, "Text": " And then I get my reply back at a very, very high delay."}, {"Time_Start": 1427.8200000000002, "Time_End": 1430.6000000000001, "Text": " In this case, it's 1.4 times 10 to the fifth."}, {"Time_Start": 1431.2, "Time_End": 1433.7800000000002, "Text": " That's pretty high delay for that one sample."}, {"Time_Start": 1436.0, "Time_End": 1439.88, "Text": " And so as the cue gradually becomes less, well,"}, {"Time_Start": 1439.9, "Time_End": 1444.76, "Text": " full as a TCP senders get it, that they should back off, they saw some loss, then the delay"}, {"Time_Start": 1444.76, "Time_End": 1451.1200000000001, "Text": " apparently drops again. So by looking for these shark fins, one could probably assume that"}, {"Time_Start": 1451.1200000000001, "Time_End": 1456.6200000000001, "Text": " indeed you saw a congestion event, you can maybe characterize what kind of event it was, whether it was"}, {"Time_Start": 1456.6200000000001, "Time_End": 1461.74, "Text": " on a drop tail queue or a randomly detection queue, which are just two different heads of the same coin."}, {"Time_Start": 1463.26, "Time_End": 1468.3600000000001, "Text": " That is a way to make TCP centers back off. Or you might be able to say something about how"}, {"Time_Start": 1468.3600000000001, "Time_End": 1470.42, "Text": " aggressively the queuing disciplines have been tuned."}, {"Time_Start": 1473.5800000000002, "Time_End": 1481.46, "Text": " The artifact that this graph shows, interestingly enough, is on the rising, leading edge of the shark fin,"}, {"Time_Start": 1482.66, "Time_End": 1490.18, "Text": " that has been also affectionately called by Jim Stutter Up, and that is where a few of the senders"}, {"Time_Start": 1490.18, "Time_End": 1493.5200000000002, "Text": " get it initially, because they may have lower round-trip time."}, {"Time_Start": 1493.64, "Time_End": 1498.3400000000001, "Text": " You may have a mix of traffic that involves 10 or 20 or 30 customers on cable."}, {"Time_Start": 1498.3600000000001, "Time_End": 1504.18, "Text": " or DSL who are 10 and 15 milliseconds away and they may realize loss or see it or notice it"}, {"Time_Start": 1504.18, "Time_End": 1509.2800000000002, "Text": " quicker the rest of your customers may not customers but users may be much further away"}, {"Time_Start": 1509.2800000000002, "Time_End": 1514.68, "Text": " 300 milliseconds or 400 milliseconds away and they don't get it just yet so what you might see"}, {"Time_Start": 1514.68, "Time_End": 1519.8400000000001, "Text": " is in the presence of that kind of mix of traffic that the delay temporarily goes back"}, {"Time_Start": 1519.8400000000001, "Time_End": 1525.18, "Text": " down for a sample or two after the initial rising edge but the other centers haven't"}, {"Time_Start": 1525.18, "Time_End": 1528.3400000000001, "Text": " backed off yet and the queue then fills over the brim once more and"}, {"Time_Start": 1528.3600000000001, "Time_End": 1529.5800000000002, "Text": " you have to induce more loss."}, {"Time_Start": 1530.0000000000002, "Time_End": 1535.0000000000002, "Text": " And then we see again another significant rise, in this case from about four milliseconds,"}, {"Time_Start": 1535.46, "Time_End": 1537.3400000000001, "Text": " all the way up to our peak value."}, {"Time_Start": 1537.88, "Time_End": 1542.8000000000002, "Text": " And then, of course, as the queue finally becomes less abused by the senders backing off,"}, {"Time_Start": 1542.8600000000001, "Time_End": 1545.2, "Text": " they got the message this time, the delay goes back down."}, {"Time_Start": 1546.7800000000002, "Time_End": 1554.7400000000002, "Text": " That stutter up can indeed reveal a very interesting dynamic mix of hosts at whatever buffer"}, {"Time_Start": 1554.7400000000002, "Time_End": 1556.0800000000002, "Text": " had the heavy overrun."}, {"Time_Start": 1556.08, "Time_End": 1564.62, "Text": " Some other stutter examples, you can see that the top left graph has a stutter down."}, {"Time_Start": 1565.4199999999998, "Time_End": 1571.26, "Text": " And this could be, again, another condition where you may have aggressively tuned red that induced loss non-uniformly."}, {"Time_Start": 1571.26, "Time_End": 1581.24, "Text": " And most of the communications level out quickly, but a few didn't get any loss, but still were able to ramp up enough to cause an additional small rampant delay."}, {"Time_Start": 1582.26, "Time_End": 1584.8999999999999, "Text": " The other graphs show other variations in the theme."}, {"Time_Start": 1584.9, "Time_End": 1591.96, "Text": " The bottom right shows what I would call key resonance where several, maybe 100 or 1,000 hosts"}, {"Time_Start": 1591.96, "Time_End": 1600.1200000000001, "Text": " were active over that same pipe and were to all wrap up uniformly after the Q event occurred,"}, {"Time_Start": 1600.42, "Time_End": 1607.22, "Text": " but then hit the ceiling one more time, but to a lesser degree, and eventually settled back out over a few seconds."}, {"Time_Start": 1610.74, "Time_End": 1614.88, "Text": " Okay, so looking at the time series data,"}, {"Time_Start": 1614.9, "Time_End": 1621.3400000000001, "Text": " just sampling, delay, and graphing it sample over time is a pretty straightforward way to kind of pick out some elements of what's going on."}, {"Time_Start": 1621.5800000000002, "Time_End": 1632.52, "Text": " But a bit more interesting angle on that analysis is the motivation to try to find a better way to visualize what's going on in that small-scale event category."}, {"Time_Start": 1633.02, "Time_End": 1644.0, "Text": " The large-scale events are pretty obvious and pretty visually self-described, but the random changes in delay that are always there are maybe full of a few more interesting characteristics."}, {"Time_Start": 1644.0, "Time_End": 1647.36, "Text": " that maybe can be tied to the host site piece deck a bit more closely."}, {"Time_Start": 1648.6, "Time_End": 1655.22, "Text": " So it's basically, it's worth the effort, worth the time to look at the data through the eyes of maybe Fourier transforms."}, {"Time_Start": 1657.68, "Time_End": 1664.94, "Text": " And inside of trying to analyze this delay in terms of a spectral breakdown,"}, {"Time_Start": 1665.44, "Time_End": 1671.1, "Text": " we also want to make sure that we're not doing a couple bad things."}, {"Time_Start": 1671.1, "Time_End": 1673.84, "Text": " We're not sampling too slowly to catch important events."}, {"Time_Start": 1674.0, "Time_End": 1678.64, "Text": " And if we are sampling too slowly, is the rapidly changing event being missed by our sampling,"}, {"Time_Start": 1678.94, "Time_End": 1682.54, "Text": " giving us the false impression that the event happens at an even lower frequency."}, {"Time_Start": 1683.46, "Time_End": 1689.6, "Text": " Much like sampling a signal too slowly, you hear some weird machine robot-like tones,"}, {"Time_Start": 1689.7, "Time_End": 1693.56, "Text": " maybe on AM radio, you've heard this before, but you don't quite match the carrier's beat."}, {"Time_Start": 1694.46, "Time_End": 1698.38, "Text": " The same kind of thing can happen in sampling network events, presumably."}, {"Time_Start": 1699.02, "Time_End": 1703.98, "Text": " But we'll see that it's not, and I can show a couple graphs that kind of support the notice."}, {"Time_Start": 1704.0, "Time_End": 1707.38, "Text": " that we indeed aren't really aliasing ourselves by sampling slowly."}, {"Time_Start": 1710.14, "Time_End": 1717.58, "Text": " So the first graph we see here is basically a run of 900 seconds going from left to right."}, {"Time_Start": 1717.88, "Time_End": 1720.34, "Text": " The reason these aren't scales is related to SigVue."}, {"Time_Start": 1720.5, "Time_End": 1723.52, "Text": " It's for Windows, and apparently you don't want actual information in your graphs,"}, {"Time_Start": 1723.9, "Time_End": 1724.94, "Text": " so you can't turn on labels."}, {"Time_Start": 1727.04, "Time_End": 1730.96, "Text": " And so left to right is about 900 seconds."}, {"Time_Start": 1730.96, "Time_End": 1733.56, "Text": " It comes down to about 250."}, {"Time_Start": 1734.0, "Time_End": 1739.68, "Text": " samples of delay per pixel on the screen, and that's about 1024 wide, so you can get an idea of it."}, {"Time_Start": 1740.24, "Time_End": 1746.36, "Text": " Vertically, the top line in the purple line is near zero hertz or near no frequency change,"}, {"Time_Start": 1746.7, "Time_End": 1751.5, "Text": " and the bottom of the graph is near 50 hertz. And looking through time left to right,"}, {"Time_Start": 1751.5, "Time_End": 1757.2, "Text": " the color of the graph, from the darker yellow to the brighter red to the bright blue purple,"}, {"Time_Start": 1757.4, "Time_End": 1763.42, "Text": " is intensity. Yellow is the background lowest intensity. Purple is the hot, hot signal we found,"}, {"Time_Start": 1763.42, "Time_End": 1764.76, "Text": " or we are seeing on the network."}, {"Time_Start": 1765.66, "Time_End": 1771.3000000000002, "Text": " And as we go through time, the random change in delay sample between this machine that I had"}, {"Time_Start": 1771.3000000000002, "Time_End": 1775.64, "Text": " and the router named, or at least the characteristic of it named, I tend to keep things like"}, {"Time_Start": 1775.64, "Time_End": 1777.28, "Text": " that anonymous from the campus's point of view."}, {"Time_Start": 1777.94, "Time_End": 1784.74, "Text": " And you'll see that approximately 10, 20, and 30 hertz are frequencies or rates of change"}, {"Time_Start": 1784.74, "Time_End": 1787.2, "Text": " for that sample delay consistently through time."}, {"Time_Start": 1788.3000000000002, "Time_End": 1793.4, "Text": " You'll also see some spread, spreads or bursts of harmonics that go."}, {"Time_Start": 1793.42, "Time_End": 1795.44, "Text": " from near zero hertz all the way up to 50."}, {"Time_Start": 1795.6000000000001, "Time_End": 1798.78, "Text": " There's just some random junk caused by cues being filled,"}, {"Time_Start": 1799.54, "Time_End": 1801.8400000000001, "Text": " a few bars in the graph."}, {"Time_Start": 1802.8200000000002, "Time_End": 1807.48, "Text": " Presumably, if one were to characterize saturating traffic load conditions"}, {"Time_Start": 1807.48, "Time_End": 1813.96, "Text": " enough with, say, a mix of FTP, NFS, AFS, a host of common protocols,"}, {"Time_Start": 1814.4, "Time_End": 1819.74, "Text": " you might find that the way the delay changes and produces those bursts of spectra"}, {"Time_Start": 1819.74, "Time_End": 1822.96, "Text": " is different and characteristic of the transfers that are going on."}, {"Time_Start": 1823.42, "Time_End": 1826.3400000000001, "Text": " So if 100 packets a second, you could maybe see if your cues are tuned properly,"}, {"Time_Start": 1826.76, "Time_End": 1831.24, "Text": " what kind of traffic is causing real outages or real service losses or service problems in your network,"}, {"Time_Start": 1831.66, "Time_End": 1837.38, "Text": " and at the same time, see what is occurring in terms of the response rates from IP stacks that you care about."}, {"Time_Start": 1837.96, "Time_End": 1842.3600000000001, "Text": " So at least in this graph, we can see those three clear harmonics through time"}, {"Time_Start": 1842.3600000000001, "Time_End": 1846.48, "Text": " and the dynamics that change as you were sampling for those 900 seconds."}, {"Time_Start": 1849.5600000000002, "Time_End": 1852.68, "Text": " And for the next graph, it couldn't fit on in one slide with text,"}, {"Time_Start": 1852.68, "Time_End": 1854.94, "Text": " but the description is the same as the first,"}, {"Time_Start": 1855.3200000000002, "Time_End": 1858.04, "Text": " but I sampled that 200 hertz, and used the Sigview program,"}, {"Time_Start": 1858.5800000000002, "Time_End": 1862.96, "Text": " not SigVie, but baldline on Unix to do the decomposition of the graph."}, {"Time_Start": 1865.8600000000001, "Time_End": 1869.68, "Text": " And those top three lines, again, are the 10, 20, 30, 30-hertz components,"}, {"Time_Start": 1869.92, "Time_End": 1871.26, "Text": " but now we have twice the headroom."}, {"Time_Start": 1871.64, "Time_End": 1876.5800000000002, "Text": " The bottom of the graph is 100 hertz of energy, so to speak, in the delay."}, {"Time_Start": 1876.78, "Time_End": 1878.7, "Text": " And we see two new components this time."}, {"Time_Start": 1879.1000000000001, "Time_End": 1882.66, "Text": " Whisby lines around 60 and maybe around 75 or 8."}, {"Time_Start": 1882.68, "Time_End": 1886.94, "Text": " You can kind of see them towards the middle and the bottom sixth of the graph."}, {"Time_Start": 1887.8400000000001, "Time_End": 1889.76, "Text": " And I'm not sure what those are from."}, {"Time_Start": 1890.42, "Time_End": 1894.26, "Text": " This is a pretty fast router, but those certainly weren't there before."}, {"Time_Start": 1894.88, "Time_End": 1900.22, "Text": " So with more sampling, presumably this should be able to build a library, so to speak,"}, {"Time_Start": 1900.64, "Time_End": 1905.3600000000001, "Text": " of commonly known harmonics from IP stacks on devices that are in operation."}, {"Time_Start": 1907.9, "Time_End": 1912.64, "Text": " So the time series, the time over frequency breakdowns are interesting, are interesting to look"}, {"Time_Start": 1912.68, "Time_End": 1914.18, "Text": " at dynamics through a sample period."}, {"Time_Start": 1914.6000000000001, "Time_End": 1917.3200000000002, "Text": " But what if you just want to look at pure characteristics of the schedulers"}, {"Time_Start": 1917.3200000000002, "Time_End": 1921.74, "Text": " or the characteristics per packet for a long run of samples all at once?"}, {"Time_Start": 1922.3200000000002, "Time_End": 1925.64, "Text": " That's the place for a two-dimensional, just standard 4A decomposition."}, {"Time_Start": 1927.1200000000001, "Time_End": 1933.8, "Text": " This graph is a Windows box sitting on the same lab network on 100 megabit switch,"}, {"Time_Start": 1934.54, "Time_End": 1938.96, "Text": " and we see that the rate of reply, or the variations in the rate of reply,"}, {"Time_Start": 1939.26, "Time_End": 1942.16, "Text": " for this Windows machine are very, very characteristic and interesting."}, {"Time_Start": 1942.68, "Time_End": 1947.88, "Text": " There's rises and peaks everywhere in the graph that you don't see for other specific kinds of samples."}, {"Time_Start": 1950.5800000000002, "Time_End": 1956.28, "Text": " That's another Cisco router on campus, looked at through the same medium up to the interface"}, {"Time_Start": 1956.28, "Time_End": 1960.1200000000001, "Text": " and the same, essentially the same processor as the previous two routers."}, {"Time_Start": 1960.68, "Time_End": 1965.3600000000001, "Text": " But we see strong components at 10, 20, and 30 hertz, and a combination of components"}, {"Time_Start": 1965.3600000000001, "Time_End": 1972.66, "Text": " on at every single frequency interval, 109, 8, 765, 4, 321, going down."}, {"Time_Start": 1972.68, "Time_End": 1974.18, "Text": " down the bottom of the graph."}, {"Time_Start": 1974.18, "Time_End": 1977.52, "Text": " That again is repeatable, very characteristic of Cisco,"}, {"Time_Start": 1977.52, "Time_End": 1978.92, "Text": " harbor of that era."}, {"Time_Start": 1982.0600000000002, "Time_End": 1984.66, "Text": " Now, as far as host OS's that aren't Windows goes,"}, {"Time_Start": 1984.66, "Time_End": 1987.66, "Text": " the Unixes are a lot quieter in terms of the harmonics"}, {"Time_Start": 1987.66, "Time_End": 1991.0600000000002, "Text": " they produce and the consistency with which they reply to ICMP."}, {"Time_Start": 1992.3, "Time_End": 1993.9, "Text": " This is a FreeBSD4A box."}, {"Time_Start": 1993.9, "Time_End": 1997.8400000000001, "Text": " I believe it was actually running stable, if I recall."}, {"Time_Start": 1997.8400000000001, "Time_End": 2001.4, "Text": " And it is unlike the Windows hosts and the routers"}, {"Time_Start": 2001.4, "Time_End": 2002.4, "Text": " in the way that it responds."}, {"Time_Start": 2002.4, "Time_End": 2007.1000000000001, "Text": " it seems to reply as quickly as it can afford to, barring other activity on the machine,"}, {"Time_Start": 2007.2, "Time_End": 2009.0400000000002, "Text": " maybe interrupt activity, that sort of thing."}, {"Time_Start": 2011.52, "Time_End": 2013.0400000000002, "Text": " Linux was very dirty."}, {"Time_Start": 2016.64, "Time_End": 2019.2, "Text": " Very characteristic harmonics, excuse me."}, {"Time_Start": 2019.8200000000002, "Time_End": 2025.8400000000001, "Text": " And again, unlike other previous examples of routers or other host OSs,"}, {"Time_Start": 2026.3600000000001, "Time_End": 2028.7800000000002, "Text": " this seems to be a robust general fingerprint."}, {"Time_Start": 2029.44, "Time_End": 2031.44, "Text": " This is actually an average of two different hosts."}, {"Time_Start": 2031.44, "Time_End": 2033.16, "Text": " behind that same T1."}, {"Time_Start": 2034.06, "Time_End": 2041.7, "Text": " So the characteristics you see there are relatively representations of 2, 420 on an average"}, {"Time_Start": 2041.7, "Time_End": 2043.3200000000002, "Text": " fast use in that environment behind a T1."}, {"Time_Start": 2046.38, "Time_End": 2055.08, "Text": " So the general takeaway, I think, from the research, from those sorts of sample or those sorts of methods"}, {"Time_Start": 2055.08, "Time_End": 2061.32, "Text": " would certainly be that the hosts you sample and the devices that you sample and the devices that you"}, {"Time_Start": 2061.44, "Time_End": 2065.94, "Text": " at your testing, indeed create interesting and I would what I would"}, {"Time_Start": 2065.94, "Time_End": 2067.84, "Text": " call, dare to call, rich harmonics."}, {"Time_Start": 2067.84, "Time_End": 2073.04, "Text": " That is the way that the delay you'd experience per sample is not just a consistent random function."}, {"Time_Start": 2073.04, "Time_End": 2074.68, "Text": " It's very, very deterministic."}, {"Time_Start": 2074.68, "Time_End": 2080.84, "Text": " Also that links and cues will create generally bursts of harmonics versus"}, {"Time_Start": 2080.84, "Time_End": 2082.2400000000002, "Text": " hosts creating consistency."}, {"Time_Start": 2082.2400000000002, "Time_End": 2086.68, "Text": " Links and cues react differently to dynamicisms than hosts ever would."}, {"Time_Start": 2086.68, "Time_End": 2091.42, "Text": " A host would still try to reply to ICMP as quickly as it could if it was transiting 20 megabits or"}, {"Time_Start": 2091.44, "Time_End": 2093.56, "Text": " 40 megabits, the best of my ability to test."}, {"Time_Start": 2094.2000000000003, "Time_End": 2095.38, "Text": " It's just how it seems to be."}, {"Time_Start": 2095.7000000000003, "Time_End": 2099.26, "Text": " Routers are completely different, and Q's and whatnot"}, {"Time_Start": 2099.26, "Time_End": 2101.64, "Text": " are as well. They would certainly,"}, {"Time_Start": 2101.88, "Time_End": 2104.18, "Text": " Q would certainly look the same at 20 megabits and 30"}, {"Time_Start": 2104.18, "Time_End": 2106.18, "Text": " megabits, but it would certainly look a lot different at 80"}, {"Time_Start": 2106.18, "Time_End": 2109.18, "Text": " megabits if the link it were emptying into were just 79"}, {"Time_Start": 2109.18, "Time_End": 2111.7400000000002, "Text": " megabits in bandwidth. Very, very"}, {"Time_Start": 2111.7400000000002, "Time_End": 2113.08, "Text": " interesting observation from that."}, {"Time_Start": 2114.0, "Time_End": 2116.56, "Text": " And we can probably"}, {"Time_Start": 2116.56, "Time_End": 2119.7000000000003, "Text": " certainly argue that to take this"}, {"Time_Start": 2119.7000000000003, "Time_End": 2121.42, "Text": " kind of research, this kind of observation,"}, {"Time_Start": 2121.44, "Time_End": 2125.32, "Text": " method forward, we'll need a lot of hosts in a controlled environment to really separate"}, {"Time_Start": 2125.32, "Time_End": 2129.94, "Text": " what's happening on a link layer, the large-scale events, from the consistency of the small-scale"}, {"Time_Start": 2129.94, "Time_End": 2135.84, "Text": " events. Right now, I'm working in Whale at the University of Wisconsin, and it's basically"}, {"Time_Start": 2135.84, "Time_End": 2141.04, "Text": " on an invitational basis at this point, to use their equipment to eventually characterize how a GSR"}, {"Time_Start": 2141.04, "Time_End": 2147.0, "Text": " 12,000 looks, how a VXR looks, how Doxus equipment looks in terms of high-rate active"}, {"Time_Start": 2147.0, "Time_End": 2151.28, "Text": " probes hitting its management interface. Eventually, we should be able to find between categories"}, {"Time_Start": 2151.28, "Time_End": 2155.76, "Text": " of routers, classes of routers in between vendors, pretty consistent types of"}, {"Time_Start": 2155.76, "Time_End": 2156.82, "Text": " replies from these devices."}, {"Time_Start": 2157.44, "Time_End": 2161.78, "Text": " But even more interestingly, I think, is that even if you change how the ICMP implementation"}, {"Time_Start": 2161.78, "Time_End": 2167.1400000000003, "Text": " happens, what fields are set, what flags are set in the packets, the way the schedule works"}, {"Time_Start": 2167.1400000000003, "Time_End": 2169.2000000000003, "Text": " probably will not change drastically."}, {"Time_Start": 2169.5, "Time_End": 2171.0800000000004, "Text": " You could change the cosmetics."}, {"Time_Start": 2171.38, "Time_End": 2176.7000000000003, "Text": " As Ophir referred to, the packet, the individual packet attributes, or what he's basing a lot of his"}, {"Time_Start": 2176.7000000000003, "Time_End": 2177.28, "Text": " decisions on."}, {"Time_Start": 2177.76, "Time_End": 2181.26, "Text": " I'm basing mine on, or in this case, the rate."}, {"Time_Start": 2181.28, "Time_End": 2184.1200000000003, "Text": " the delay rates are based on something a lot more fixed."}, {"Time_Start": 2184.5600000000004, "Time_End": 2188.6400000000003, "Text": " It's doubtful that Cisco would ever change a scheduler, they may simply change the way ICMP replies."}, {"Time_Start": 2189.1000000000004, "Time_End": 2196.32, "Text": " This should prove to be a longer term, a long-term robust method if we can sample enough devices to really test that."}, {"Time_Start": 2198.6400000000003, "Time_End": 2211.2200000000003, "Text": " And as just general conclusions, I would certainly say that the internal state of devices is certainly the thing we're measuring."}, {"Time_Start": 2211.28, "Time_End": 2215.92, "Text": " here. But we also measure the combination of its self-business, if you will, the internal"}, {"Time_Start": 2215.92, "Time_End": 2221.7400000000002, "Text": " state of a router, and the combination of the effect of that with its scheduler. The way the links"}, {"Time_Start": 2221.7400000000002, "Time_End": 2230.0, "Text": " themselves appear is obviously different, and that those two categories of influence, or those"}, {"Time_Start": 2230.0, "Time_End": 2237.5800000000004, "Text": " two spheres of influence are certainly separate. And also that, when we see a congestion"}, {"Time_Start": 2237.5800000000004, "Time_End": 2241.2200000000003, "Text": " event, Q, basically delay rapidly rising and falling off again."}, {"Time_Start": 2241.28, "Time_End": 2248.2200000000003, "Text": " The rate at which the fall off occurs should tell us something else about the path between that congestion vent in your machine."}, {"Time_Start": 2248.6800000000003, "Time_End": 2257.52, "Text": " And that is that edge rate of the rate of decay on that delay spike should be equal to the bandwidth at the most constrained link between you and that hop."}, {"Time_Start": 2258.26, "Time_End": 2265.2200000000003, "Text": " If you were to have a queue fill up with data back-to-back for you, it says if you emitted the packets with zero seconds of delay between them,"}, {"Time_Start": 2265.5, "Time_End": 2268.76, "Text": " even though I emitted them with 10 milliseconds of delay between them."}, {"Time_Start": 2269.1000000000004, "Time_End": 2271.0600000000004, "Text": " So if they were back-to-back-to-back at a queue,"}, {"Time_Start": 2271.28, "Time_End": 2274.32, "Text": " because they weren't sent yet, and the queue finally empties,"}, {"Time_Start": 2274.48, "Time_End": 2277.32, "Text": " it should be played back on the wire, nearly back-to-back,"}, {"Time_Start": 2277.88, "Time_End": 2281.6400000000003, "Text": " and that rate of, that slope of the fall-off I see off that queue"}, {"Time_Start": 2281.6400000000003, "Time_End": 2287.46, "Text": " would be steeper if the bandwidth were higher or much more gradual if the bandwidth were lower."}, {"Time_Start": 2288.0, "Time_End": 2293.6400000000003, "Text": " So over time again, we should be able to determine the dynamic systems between myself and the queuing events"}, {"Time_Start": 2293.6400000000003, "Time_End": 2296.84, "Text": " based on link bandwidth that we know or link bandwidth that we want to detect."}, {"Time_Start": 2297.6400000000003, "Time_End": 2301.26, "Text": " Ideally, if we could make one hop get really, really busy, say hitting it from the other"}, {"Time_Start": 2301.28, "Time_End": 2306.02, "Text": " path into it, you would maybe be able to determine based on the fall-off rate"}, {"Time_Start": 2306.02, "Time_End": 2309.88, "Text": " from that router being busy how much bandwidth they had to the router upstream from them"}, {"Time_Start": 2309.88, "Time_End": 2313.88, "Text": " and so on and so forth until you could disambiguate the path pretty cleanly."}, {"Time_Start": 2313.88, "Time_End": 2320.48, "Text": " Other programs like PICAR and packet pair dispersion utilities like path rate"}, {"Time_Start": 2320.48, "Time_End": 2326.42, "Text": " don't really, you list, don't really, don't really go per link detailed enough at this point"}, {"Time_Start": 2326.42, "Time_End": 2329.2200000000003, "Text": " to really tell you necessarily what the interconnection bandwidths are."}, {"Time_Start": 2329.2200000000003, "Time_End": 2334.0200000000004, "Text": " watching Q emptying rates should be dang near close to what the true link bandwidth would be."}, {"Time_Start": 2335.5000000000005, "Time_End": 2341.1000000000004, "Text": " And the last point would be that by using 4A decomposition techniques,"}, {"Time_Start": 2341.1000000000004, "Time_End": 2346.7400000000002, "Text": " we can see the richness in the variations that are in the small-scale time domain or the small-scale"}, {"Time_Start": 2346.7400000000002, "Time_End": 2352.94, "Text": " amplitude domains and have those exposed and be a bit more uniform and a bit more specific to the host"}, {"Time_Start": 2352.94, "Time_End": 2356.84, "Text": " we're targeting than just the time scale limit, the time decompositions."}, {"Time_Start": 2356.84, "Time_End": 2361.88, "Text": " So that would probably be anything that I wanted to say about the topic."}, {"Time_Start": 2362.34, "Time_End": 2364.76, "Text": " Is there any questions or commentary on this?"}, {"Time_Start": 2365.4, "Time_End": 2365.6000000000004, "Text": " Yes."}, {"Time_Start": 2369.5, "Time_End": 2381.56, "Text": " Sure. So the question was, I think you probably all heard of the hurdles in the way of this,"}, {"Time_Start": 2381.56, "Time_End": 2385.7200000000003, "Text": " that would mostly be access to equipment at this point at this point?"}, {"Time_Start": 2386.84, "Time_End": 2397.38, "Text": " There's basically the results that you see here are things that we tried Sunday morning at 3 a.m., Saturday at 6, Monday at 1.30 in the afternoon,"}, {"Time_Start": 2397.92, "Time_End": 2401.08, "Text": " and the same sorts of harmonics were seen outside of the burst usages."}, {"Time_Start": 2401.26, "Time_End": 2405.56, "Text": " That is, we'd see periods of near saturation, that sort of thing, but the general trends were still there."}, {"Time_Start": 2406.1200000000003, "Time_End": 2410.34, "Text": " So really at this point, I think the sampling methods and the analysis techniques are pretty solid."}, {"Time_Start": 2410.84, "Time_End": 2415.7200000000003, "Text": " I would need more access to gear, plain and simple, to basically build a good enough characterization."}, {"Time_Start": 2416.1600000000003, "Time_End": 2416.8, "Text": " There's a lot of things."}, {"Time_Start": 2416.84, "Time_End": 2420.94, "Text": " need to be toggled. On Cisco gear, I don't even know if these devices were running"}, {"Time_Start": 2420.94, "Time_End": 2426.6200000000003, "Text": " Cephyr or not. Cisco Express forwarding could change very, very, very drastically the types of"}, {"Time_Start": 2426.6200000000003, "Time_End": 2433.1400000000003, "Text": " replies I'm seeing. So really, this needs to be looked at quite thoroughly to base, to make a large"}, {"Time_Start": 2433.1400000000003, "Time_End": 2436.6200000000003, "Text": " enough sample, or to even generate a large enough dictionary to name a host, so to speak,"}, {"Time_Start": 2437.1000000000004, "Time_End": 2444.2200000000003, "Text": " in future probes. But that certainly isn't impossible. So that would be a high one, but at least in"}, {"Time_Start": 2444.2200000000003, "Time_End": 2446.82, "Text": " this lab, the gear exists. I basically need to"}, {"Time_Start": 2446.84, "Time_End": 2448.84, "Text": " do the work."}, {"Time_Start": 2448.84, "Time_End": 2449.84, "Text": " Yes?"}, {"Time_Start": 2449.84, "Time_End": 2461.84, "Text": " I have not tested that scenario specifically yet."}, {"Time_Start": 2461.84, "Time_End": 2466.84, "Text": " I have only used Linux in terms of it being an end host."}, {"Time_Start": 2466.84, "Time_End": 2474.84, "Text": " I'm not sure how it would, I wouldn't even know where to begin in engaging how its IP stack would look temporally on the wire."}, {"Time_Start": 2474.84, "Time_End": 2475.84, "Text": " That's a good question."}, {"Time_Start": 2475.84, "Time_End": 2479.84, "Text": " That's a good question. Thank you."}, {"Time_Start": 2479.84, "Time_End": 2480.84, "Text": " Yes?"}, {"Time_Start": 2480.84, "Time_End": 2497.84, "Text": " What was the method?"}, {"Time_Start": 2497.84, "Time_End": 2501.84, "Text": " What was the method?"}, {"Time_Start": 2501.84, "Time_End": 2502.84, "Text": " So the first question?"}, {"Time_Start": 2502.84, "Time_End": 2504.84, "Text": " So the first question was, do you think, what was the method?"}, {"Time_Start": 2504.84, "Time_End": 2505.84, "Text": " Yes."}, {"Time_Start": 2505.84, "Time_End": 2509.84, "Text": " the action of someone changing the type of service field in the IP packet."}, {"Time_Start": 2509.84, "Time_End": 2515.84, "Text": " I'm not sure that it would be revealed at this point in a lot of the core writers in the United States,"}, {"Time_Start": 2515.84, "Time_End": 2518.84, "Text": " however, don't honor the type of service bid anymore."}, {"Time_Start": 2518.84, "Time_End": 2523.84, "Text": " They forward the packet as it came in, and they probably drop it just the same if it has to."}, {"Time_Start": 2523.84, "Time_End": 2530.84, "Text": " I can't see that the invoice over IP tests that I've done with trunks from California to New York and back and forth,"}, {"Time_Start": 2530.84, "Time_End": 2534.84, "Text": " the user impact of honoring type of service hasn't been to my experience."}, {"Time_Start": 2534.84, "Time_End": 2536.84, "Text": " my experience yet, very great."}, {"Time_Start": 2536.84, "Time_End": 2538.84, "Text": " I know within a lot of enterprises,"}, {"Time_Start": 2538.84, "Time_End": 2540.84, "Text": " diffs serve and things that tag"}, {"Time_Start": 2540.84, "Time_End": 2543.84, "Text": " port packets on Ingris at borders through the core"}, {"Time_Start": 2543.84, "Time_End": 2544.84, "Text": " can be acted on and are done."}, {"Time_Start": 2544.84, "Time_End": 2546.84, "Text": " I can't say that on the public area at large."}, {"Time_Start": 2546.84, "Time_End": 2549.84, "Text": " I've seen that action and then"}, {"Time_Start": 2549.84, "Time_End": 2553.84, "Text": " and consequently, I'm not sure that a high-rate probe"}, {"Time_Start": 2553.84, "Time_End": 2555.84, "Text": " would review that unless you were maybe modulating"}, {"Time_Start": 2555.84, "Time_End": 2557.84, "Text": " the type of service bit per packet"}, {"Time_Start": 2557.84, "Time_End": 2561.84, "Text": " and then doing tests with type of service 0, 1, 2, 3, 4, 5"}, {"Time_Start": 2561.84, "Time_End": 2563.84, "Text": " to see if there's any distinct difference."}, {"Time_Start": 2563.84, "Time_End": 2564.84, "Text": " That would probably be a great"}, {"Time_Start": 2564.84, "Time_End": 2567.84, "Text": " analysis method, I haven't yet tried them on the back button yet,"}, {"Time_Start": 2567.84, "Time_End": 2570.84, "Text": " just probably based on, as I just mentioned,"}, {"Time_Start": 2570.84, "Time_End": 2573.84, "Text": " some silly assumptions, but they may not be true, so thank you."}, {"Time_Start": 2573.84, "Time_End": 2576.84, "Text": " And the second question was,"}, {"Time_Start": 2576.84, "Time_End": 2580.84, "Text": " oh, I'm sorry, refresh my memory."}, {"Time_Start": 2580.84, "Time_End": 2589.84, "Text": " Sure."}, {"Time_Start": 2589.84, "Time_End": 2593.84, "Text": " So switching methods, I have seen some minimal differences"}, {"Time_Start": 2593.84, "Time_End": 2594.82, "Text": " between T1s that are"}, {"Time_Start": 2594.84, "Time_End": 2598.84, "Text": " frame relay that I know about somewhere between the end host that I'm sampling"}, {"Time_Start": 2598.84, "Time_End": 2600.84, "Text": " and the link between my machine."}, {"Time_Start": 2600.84, "Time_End": 2603.84, "Text": " A lot of times it's ATM to some aggregate router,"}, {"Time_Start": 2603.84, "Time_End": 2606.84, "Text": " breaks out the frame, then to the customer's equipment."}, {"Time_Start": 2606.84, "Time_End": 2610.84, "Text": " So the combination of ATM and frame as a media access method,"}, {"Time_Start": 2610.84, "Time_End": 2614.84, "Text": " I think that the links effects on temporal or time ski"}, {"Time_Start": 2614.84, "Time_End": 2617.84, "Text": " are pretty minimal. I think it's got a lot more to do with cues"}, {"Time_Start": 2617.84, "Time_End": 2619.84, "Text": " and a lot more to do with the IPSEC itself."}, {"Time_Start": 2619.84, "Time_End": 2621.84, "Text": " So I'm not sure that you could cleanly detect it"}, {"Time_Start": 2621.84, "Time_End": 2624.82, "Text": " and anything more than maybe seeing if you have multiple"}, {"Time_Start": 2624.84, "Time_End": 2629.84, "Text": " paths. Specifically, if you had CDDI or FDDI between Cisco riders,"}, {"Time_Start": 2629.84, "Time_End": 2634.84, "Text": " I've found that on certain protocols, IPX being one, you don't get perfect sequencing."}, {"Time_Start": 2634.84, "Time_End": 2638.84, "Text": " Some packets are transposed, or three packets are transposed."}, {"Time_Start": 2638.84, "Time_End": 2643.84, "Text": " If you're looking at that kind of thing on this graph, you should see a very, very, very noisy output."}, {"Time_Start": 2643.84, "Time_End": 2648.84, "Text": " I haven't yet tested the robustness of those methods with CDDI or FDDI,"}, {"Time_Start": 2648.84, "Time_End": 2650.84, "Text": " namely because you don't have the gear anymore."}, {"Time_Start": 2650.84, "Time_End": 2654.82, "Text": " But I would think that knowing a lot about the Macs that are out there, you probably"}, {"Time_Start": 2654.84, "Time_End": 2658.84, "Text": " should see some large differences between them."}, {"Time_Start": 2658.84, "Time_End": 2669.84, "Text": " Yes."}, {"Time_Start": 2669.84, "Time_End": 2672.84, "Text": " Generally, Ethernet switches, by and large,"}, {"Time_Start": 2672.84, "Time_End": 2676.84, "Text": " are the quietest devices I've passed traffic through."}, {"Time_Start": 2676.84, "Time_End": 2679.84, "Text": " A flip cable doesn't look much different."}, {"Time_Start": 2679.84, "Time_End": 2681.84, "Text": " How much time do we have left?"}, {"Time_Start": 2681.84, "Time_End": 2682.84, "Text": " Five?"}, {"Time_Start": 2682.84, "Time_End": 2683.84, "Text": " Hit me after the show."}, {"Time_Start": 2683.84, "Time_End": 2684.84, "Text": " I can show you some other."}, {"Time_Start": 2684.84, "Time_End": 2687.84, "Text": " graphs online."}, {"Time_Start": 2687.84, "Time_End": 2691.84, "Text": " I was more interested, can you tell the switch right now?"}, {"Time_Start": 2691.84, "Time_End": 2696.84, "Text": " Based on some of the software?"}, {"Time_Start": 2696.84, "Time_End": 2697.84, "Text": " Sure."}, {"Time_Start": 2697.84, "Time_End": 2700.84, "Text": " As far as knowing what type of switch you'd have in place,"}, {"Time_Start": 2700.84, "Time_End": 2703.84, "Text": " you'd have to have a good enough sample set"}, {"Time_Start": 2703.84, "Time_End": 2705.84, "Text": " with actual cross traffic on the backbone of the switch"}, {"Time_Start": 2705.84, "Time_End": 2707.84, "Text": " to disambiguate that."}, {"Time_Start": 2707.84, "Time_End": 2709.84, "Text": " I found that if a switch has just two hosts on it,"}, {"Time_Start": 2709.84, "Time_End": 2711.84, "Text": " that's the most ideal condition,"}, {"Time_Start": 2711.84, "Time_End": 2713.84, "Text": " and you get pretty darn near wire rate with a few microseconds of forwarding"}, {"Time_Start": 2713.84, "Time_End": 2715.84, "Text": " microseconds of forwarding delay."}, {"Time_Start": 2715.84, "Time_End": 2716.84, "Text": " And that's pretty consistent."}, {"Time_Start": 2716.84, "Time_End": 2717.84, "Text": " But if you have cross-traffic,"}, {"Time_Start": 2717.84, "Time_End": 2719.84, "Text": " that's where things get very, very interesting"}, {"Time_Start": 2719.84, "Time_End": 2722.84, "Text": " because how a vendor multiplexes access"}, {"Time_Start": 2722.84, "Time_End": 2726.84, "Text": " to the backbone bus, even if it's a virtualized matrix"}, {"Time_Start": 2726.84, "Time_End": 2728.84, "Text": " on a core or an ASIC somewhere,"}, {"Time_Start": 2728.84, "Time_End": 2730.84, "Text": " is still per clock cycle, still a rigid function"}, {"Time_Start": 2730.84, "Time_End": 2732.84, "Text": " that's going to be exposed by high frequency"}, {"Time_Start": 2732.84, "Time_End": 2735.84, "Text": " variations, by high frequency samples."}, {"Time_Start": 2735.84, "Time_End": 2737.84, "Text": " So with testing, it should be visible."}, {"Time_Start": 2737.84, "Time_End": 2739.84, "Text": " I would go on the limb and say,"}, {"Time_Start": 2739.84, "Time_End": 2742.84, "Text": " have I done more than Cisco and Ally Tellson?"}, {"Time_Start": 2742.84, "Time_End": 2743.84, "Text": " Unfortunately not."}, {"Time_Start": 2743.84, "Time_End": 2746.84, "Text": " a lot of gear. It would be very interesting to go through"}, {"Time_Start": 2746.84, "Time_End": 2749.84, "Text": " Xiland, Bay,"}, {"Time_Start": 2749.84, "Time_End": 2752.84, "Text": " Lucent, all the big names who've had actual switches in"}, {"Time_Start": 2752.84, "Time_End": 2755.84, "Text": " maybe COLA facilities or core environments"}, {"Time_Start": 2755.84, "Time_End": 2758.84, "Text": " and do a good cross-sectional study of, you know,"}, {"Time_Start": 2758.84, "Time_End": 2761.84, "Text": " what are the effects of port pairs and then cross-traffic present,"}, {"Time_Start": 2761.84, "Time_End": 2762.84, "Text": " but not yet."}, {"Time_Start": 2762.84, "Time_End": 2764.84, "Text": " So there was one more."}, {"Time_Start": 2764.84, "Time_End": 2766.84, "Text": " It was over here."}, {"Time_Start": 2766.84, "Time_End": 2769.84, "Text": " The photo discussion was a metaphor is"}, {"Time_Start": 2769.84, "Time_End": 2771.84, "Text": " Yes."}, {"Time_Start": 2771.84, "Time_End": 2772.84, "Text": " Sure."}, {"Time_Start": 2772.84, "Time_End": 2773.84, "Text": " So the reason that is a lot of discussion."}, {"Time_Start": 2773.84, "Time_End": 2775.84, "Text": " got in there was when I was writing my presentation,"}, {"Time_Start": 2775.84, "Time_End": 2777.84, "Text": " we had a 29, I'm sorry,"}, {"Time_Start": 2777.84, "Time_End": 2779.84, "Text": " a 3550 with layer 3."}, {"Time_Start": 2779.84, "Time_End": 2781.84, "Text": " And with layer 3 enabled specifically"}, {"Time_Start": 2781.84, "Time_End": 2783.84, "Text": " that device induces"}, {"Time_Start": 2783.84, "Time_End": 2785.84, "Text": " different types of variations at high frequencies"}, {"Time_Start": 2785.84, "Time_End": 2789.84, "Text": " when you have those ports you're testing through"}, {"Time_Start": 2789.84, "Time_End": 2791.84, "Text": " in the span group. I had originally"}, {"Time_Start": 2791.84, "Time_End": 2793.84, "Text": " not disambigrated that. The problem was"}, {"Time_Start": 2793.84, "Time_End": 2795.84, "Text": " I thought any port with the"}, {"Time_Start": 2795.84, "Time_End": 2797.84, "Text": " chassis with the span port configured for any traffic"}, {"Time_Start": 2797.84, "Time_End": 2800.84, "Text": " was revealed by a pair of hosts communicating through it."}, {"Time_Start": 2800.84, "Time_End": 2803.84, "Text": " It turns out it's only the pair of that if you have the port you're on,"}, {"Time_Start": 2803.84, "Time_End": 2806.84, "Text": " being spanned. But the effects are basically"}, {"Time_Start": 2806.84, "Time_End": 2809.84, "Text": " higher frequency variations, some wispy noises, so to speak,"}, {"Time_Start": 2809.84, "Time_End": 2811.84, "Text": " 70 to 80 hertz typically."}, {"Time_Start": 2811.84, "Time_End": 2815.84, "Text": " That is detectable, so to speak. It's not robust,"}, {"Time_Start": 2815.84, "Time_End": 2818.84, "Text": " and that's why I didn't include it in my presentation."}, {"Time_Start": 2818.84, "Time_End": 2821.84, "Text": " You have to really have a quiet, quiet environment"}, {"Time_Start": 2821.84, "Time_End": 2824.84, "Text": " to see the two sides of it being on and off."}, {"Time_Start": 2824.84, "Time_End": 2827.84, "Text": " Unfortunately, it's not detectable really from, say,"}, {"Time_Start": 2827.84, "Time_End": 2831.84, "Text": " OC3 to aggregate router, some larger center"}, {"Time_Start": 2831.84, "Time_End": 2832.84, "Text": " through a colo to that device."}, {"Time_Start": 2832.84, "Time_End": 2833.84, "Text": " device?"}, {"Time_Start": 2833.84, "Time_End": 2834.84, "Text": " Yes?"}, {"Time_Start": 2834.84, "Time_End": 2846.84, "Text": " Well, we couldn't turn it on and turn it off in the core routers on"}, {"Time_Start": 2846.84, "Time_End": 2854.84, "Text": " and the university, but we, in the lab, we, I've seen on our Telasin specifically on the alternative"}, {"Time_Start": 2854.84, "Time_End": 2855.84, "Text": " routers."}, {"Time_Start": 2855.84, "Time_End": 2860.84, "Text": " They typically will have these rough things on a second or minute intervals that kind of do some"}, {"Time_Start": 2860.84, "Time_End": 2861.84, "Text": " cleanup work."}, {"Time_Start": 2861.84, "Time_End": 2866.84, "Text": " work. The Cisco that I showed with the big spikes, orders of magnitude above the average low latency,"}, {"Time_Start": 2866.84, "Time_End": 2870.84, "Text": " samples from them, were presumably from net flow export."}, {"Time_Start": 2870.84, "Time_End": 2876.84, "Text": " The other elements that I didn't show, but I could welcome to see as we're done,"}, {"Time_Start": 2876.84, "Time_End": 2880.84, "Text": " show minutely intervals of something happening on the management interface."}, {"Time_Start": 2880.84, "Time_End": 2886.84, "Text": " And it turns out that something was OSPF calculations on a Riverstone."}, {"Time_Start": 2886.84, "Time_End": 2891.84, "Text": " There's a bigger one every hour, too, that even drops packets to port that other folks at"}, {"Time_Start": 2891.84, "Time_End": 2897.84, "Text": " other networks have reported, and I haven't observed that myself, but certainly that would show up in these samples as well."}, {"Time_Start": 2897.84, "Time_End": 2900.84, "Text": " But yes, depending on how the CPU and how the router is architected,"}, {"Time_Start": 2900.84, "Time_End": 2905.84, "Text": " each individual ICMP probe could be a new flow, and if that's a heavyweight operation,"}, {"Time_Start": 2905.84, "Time_End": 2909.84, "Text": " it's going to compete for CPU with the routing protocol that should have more priority, you think."}, {"Time_Start": 2909.84, "Time_End": 2914.84, "Text": " So that should be visible in a very interesting way, but it needs to be disambiguated more."}, {"Time_Start": 2914.84, "Time_End": 2918.84, "Text": " Just haven't had the opportunity to turn this protocol on, that one on, this one off,"}, {"Time_Start": 2918.84, "Time_End": 2920.84, "Text": " do this redistribution with this protocol, that's what we're going."}, {"Time_Start": 2920.84, "Time_End": 2922.4, "Text": " with this protocol, that sort of thing yet."}, {"Time_Start": 2922.48, "Time_End": 2923.82, "Text": " But that's certainly in the works."}, {"Time_Start": 2923.92, "Time_End": 2924.98, "Text": " Maybe next year we'll have it."}, {"Time_Start": 2926.78, "Time_End": 2927.4, "Text": " Any others?"}, {"Time_Start": 2928.7000000000003, "Time_End": 2929.7400000000002, "Text": " Thank you very much for coming."}]}