{"segments": [{"Time_Start": 0.0, "Time_End": 4.0, "Text": " We're going through the many"}, {"Time_Start": 30.0, "Time_End": 39.9, "Text": " particular order, I would prefer to hear your ideas and your questions because much of what"}, {"Time_Start": 39.9, "Time_End": 48.82, "Text": " you see up here derives from all the good ideas that have been discussed throughout this"}, {"Time_Start": 48.82, "Time_End": 53.1, "Text": " conference in the talks and in the conversations."}, {"Time_Start": 53.1, "Time_End": 59.980000000000004, "Text": " In fact, a lot of what you see up here is a result of those things happening at"}, {"Time_Start": 60.0, "Time_End": 70.34, "Text": " this conference because I rewrote the slides this morning."}, {"Time_Start": 70.34, "Time_End": 76.0, "Text": " So we're going to talk about a couple of things related to host-based intrusion prevention"}, {"Time_Start": 76.0, "Time_End": 78.22, "Text": " on Windows and Unix."}, {"Time_Start": 78.22, "Time_End": 82.32, "Text": " And I'm not going to try and define what those are."}, {"Time_Start": 82.32, "Time_End": 89.98, "Text": " I think the community, by developing the intellectual property will,"}, {"Time_Start": 90.0, "Time_End": 99.76, "Text": " define what these are as we make advances. And I want to recognize several people for the"}, {"Time_Start": 99.76, "Time_End": 105.44, "Text": " contributions that they've made. Niels Provost is at the University of Michigan. He's a graduate"}, {"Time_Start": 105.44, "Time_End": 111.64, "Text": " student. And he's published several tools, one of them's CIS trace that we're going to look at closely."}, {"Time_Start": 112.84, "Time_End": 119.98, "Text": " And those are currently in OpenBSD and NetBSD. And there's code on your conference"}, {"Time_Start": 120.0, "Time_End": 125.46, "Text": " CD to support free BSD 5.1."}, {"Time_Start": 125.46, "Time_End": 131.62, "Text": " And there's more code on his website to support FreeBSD 4.8."}, {"Time_Start": 131.62, "Time_End": 134.82, "Text": " And we'll look closer at that."}, {"Time_Start": 134.82, "Time_End": 147.0, "Text": " T7 with the Razor team has a similar components for Windows that"}, {"Time_Start": 147.0, "Time_End": 154.4, "Text": " provide intrusion prevention. Slightly different approach in terms of the way it integrates"}, {"Time_Start": 154.4, "Time_End": 163.12, "Text": " with the system, but very similar functionality. I'd like to thank D.T. for suggesting this thread"}, {"Time_Start": 163.12, "Time_End": 171.24, "Text": " last year in his call for papers. There was a call for talks on how to harden free BSD."}, {"Time_Start": 171.24, "Time_End": 176.6, "Text": " Last year I gave that and the gap analysis of that."}, {"Time_Start": 177.0, "Time_End": 184.0, "Text": " showed a real need for something that increases the integrity of the system"}, {"Time_Start": 184.0, "Time_End": 189.0, "Text": " that all of the rest of the security architecture depends on."}, {"Time_Start": 189.0, "Time_End": 195.0, "Text": " I'd like to thank Greg Hoglin for many insights about application security"}, {"Time_Start": 195.0, "Time_End": 200.0, "Text": " and looking at application state and the code at the binary level."}, {"Time_Start": 200.0, "Time_End": 206.0, "Text": " MD5 at the ghetto hackers reviewed a lot of this material and contributed to the data."}, {"Time_Start": 206.0, "Time_End": 213.0, "Text": " and contributed comments about how intrusion prevention looks like firewalls in some ways."}, {"Time_Start": 213.0, "Time_End": 216.0, "Text": " That was a great metaphor."}, {"Time_Start": 216.0, "Time_End": 224.0, "Text": " Got root.net helped me find exploits such as SHS for the demo."}, {"Time_Start": 224.0, "Time_End": 231.0, "Text": " And finally, free VSD mall for all the free stuff that we just gave away."}, {"Time_Start": 231.0, "Time_End": 235.0, "Text": " So more about Niels Provost."}, {"Time_Start": 235.0, "Time_End": 236.0, "Text": " He's written."}, {"Time_Start": 236.0, "Time_End": 243.0, "Text": " a tool called CIS trace. What it does is it catches system calls and alters their behavior."}, {"Time_Start": 243.0, "Time_End": 249.4, "Text": " It supports open BSD and net BSD. He's also written something called HoneyNet that supports"}, {"Time_Start": 249.4, "Time_End": 260.0, "Text": " the HoneyPipe Project. And all these tools you can find on his home page is listed right there."}, {"Time_Start": 260.0, "Time_End": 265.98, "Text": " Okay, so in the abstract for the talk, I mentioned a couple of things. Why should we"}, {"Time_Start": 266.0, "Time_End": 288.0, "Text": " care about intrusion prevention. What does it do for us? And we'll look at how it works and how it is consistent across the platform because of architectural constraints of the way kernels are put together."}, {"Time_Start": 288.0, "Time_End": 294.0, "Text": " We'll look at some common features and talk about what's missing."}, {"Time_Start": 294.0, "Time_End": 300.0, "Text": " So why should we care about intrusion prevention?"}, {"Time_Start": 300.0, "Time_End": 308.0, "Text": " One way to think about this is to look at an analogy of the network, layers of network security."}, {"Time_Start": 308.0, "Time_End": 320.0, "Text": " So if you look at layered network security, you'll find rules in routers and firewalls and services at the"}, {"Time_Start": 320.0, "Time_End": 327.0, "Text": " at the router level, firewall, and INITD or TCP wrappers."}, {"Time_Start": 327.0, "Time_End": 340.0, "Text": " And each has a distinctive performance in advantage because of the kind of objects it's dealing with at the router level,"}, {"Time_Start": 340.0, "Time_End": 347.0, "Text": " dealing with lower layers of the protocols, and doing a lot of filtering at the firewall."}, {"Time_Start": 347.0, "Time_End": 349.0, "Text": " If you have those rules in the router,"}, {"Time_Start": 349.0, "Time_End": 356.0, "Text": " You're dealing with higher layers, things that are more specific to individual sessions."}, {"Time_Start": 356.0, "Time_End": 369.0, "Text": " And at INETD, you're looking at services that have successfully connected and a context of where they're coming from and who they're coming from."}, {"Time_Start": 369.0, "Time_End": 377.0, "Text": " So each of those has a different specificity in terms of the context of information."}, {"Time_Start": 377.0, "Time_End": 384.0, "Text": " and each has something that contributes to the performance of the next layer."}, {"Time_Start": 384.0, "Time_End": 397.0, "Text": " So if we look at the host side, there's a parallel structure there of information flowing through the app, through the kernel to disk."}, {"Time_Start": 397.0, "Time_End": 406.0, "Text": " And applications explicitly use authentication explicitly use authentication methods,"}, {"Time_Start": 406.0, "Time_End": 413.0, "Text": " have rules for when to allow access and when not to."}, {"Time_Start": 413.0, "Time_End": 419.0, "Text": " The kernel does the same thing. Enforcing permissions and the file system does as well."}, {"Time_Start": 419.0, "Time_End": 427.0, "Text": " And at each layer, you have different performance advantages depending on the kind of messages that are coming through."}, {"Time_Start": 427.0, "Time_End": 430.0, "Text": " And each has a distinctive advantage."}, {"Time_Start": 430.0, "Time_End": 435.0, "Text": " At the disk, at the file system layer, you've got access to individual objects."}, {"Time_Start": 435.0, "Time_End": 438.0, "Text": " individual objects and permissions specific to the object."}, {"Time_Start": 442.0, "Time_End": 446.0, "Text": " So in terms of specificity of rules,"}, {"Time_Start": 446.0, "Time_End": 452.0, "Text": " the application you have rules that can be specific to the session or the connection"}, {"Time_Start": 452.0, "Time_End": 456.0, "Text": " and the kernel, rules that are specific per system call,"}, {"Time_Start": 456.0, "Time_End": 463.0, "Text": " and a file system per file or other object."}, {"Time_Start": 463.0, "Time_End": 465.0, "Text": " Each of these layers depends on"}, {"Time_Start": 465.0, "Time_End": 470.0, "Text": " In a lot of cases, the integrity of the other layers."}, {"Time_Start": 470.0, "Time_End": 480.0, "Text": " The file system permission assumes integrity of the application and kernel."}, {"Time_Start": 480.0, "Time_End": 487.0, "Text": " The granularity of system call permissions affects what you can do in an application."}, {"Time_Start": 487.0, "Time_End": 494.0, "Text": " So you depend on the granularity of the semantics of system calls to decide how you're going to"}, {"Time_Start": 494.0, "Time_End": 498.0, "Text": " enforce security in your application."}, {"Time_Start": 501.0, "Time_End": 511.0, "Text": " The problem is all of this depends on the integrity of the layers around a particular layer."}, {"Time_Start": 511.0, "Time_End": 518.0, "Text": " And it's very often that applications or services run as root."}, {"Time_Start": 518.0, "Time_End": 522.0, "Text": " And if that integrity is not held,"}, {"Time_Start": 522.0, "Time_End": 529.0, "Text": " the architecture doesn't do you that much."}, {"Time_Start": 529.0, "Time_End": 545.0, "Text": " And this is compounded by, you know, advances in the various layers, encryption, fragmentation, re-encoding."}, {"Time_Start": 545.0, "Time_End": 551.0, "Text": " All of these can prevent application layer filtering on the wire."}, {"Time_Start": 551.0, "Time_End": 558.0, "Text": " And that's why we're going to look at this in terms of the kernel being a gap"}, {"Time_Start": 558.0, "Time_End": 565.0, "Text": " and the ability to preserve integrity of the system and the application."}, {"Time_Start": 565.0, "Time_End": 568.0, "Text": " Why would we do that there?"}, {"Time_Start": 568.0, "Time_End": 576.0, "Text": " It's through the application that, well, your data is going to reside there"}, {"Time_Start": 576.0, "Time_End": 580.0, "Text": " in memory and exploits are going to go through there."}, {"Time_Start": 580.0, "Time_End": 585.0, "Text": " are going to go through there to get to the disk."}, {"Time_Start": 585.0, "Time_End": 591.3, "Text": " So visibility in the application layer also provides the ability for better contextual"}, {"Time_Start": 591.3, "Time_End": 594.2, "Text": " discrimination."}, {"Time_Start": 594.2, "Time_End": 602.3, "Text": " When you have an incoming connection, you have IP address of the client, maybe a domain"}, {"Time_Start": 602.3, "Time_End": 604.7, "Text": " name."}, {"Time_Start": 604.7, "Time_End": 609.98, "Text": " Once you're inside the application, the application is likely going to be collect"}, {"Time_Start": 610.0, "Time_End": 616.0, "Text": " other kinds of information about the session, about what permissions have been"}, {"Time_Start": 616.0, "Time_End": 630.0, "Text": " authenticated. And you can leverage that contextual information about what the application has established"}, {"Time_Start": 630.0, "Time_End": 634.0, "Text": " to enhance what you can do to block exploits."}, {"Time_Start": 634.0, "Time_End": 639.0, "Text": " So why would we need another tool to do this when we have all the other layers already?"}, {"Time_Start": 639.0, "Time_End": 640.0, "Text": " already."}, {"Time_Start": 640.0, "Time_End": 652.0, "Text": " We can think about this kernel level system call filtering as like we do about firewalls,"}, {"Time_Start": 652.0, "Time_End": 663.0, "Text": " as an application level firewall that enhances, you know, what you do at the router and downstream"}, {"Time_Start": 663.0, "Time_End": 667.0, "Text": " what you do in TCP wrappers."}, {"Time_Start": 667.0, "Time_End": 674.0, "Text": " A lot of exploits are going to attack through service and demons."}, {"Time_Start": 674.0, "Time_End": 684.0, "Text": " And without enhancing the protection against, you know, buffer overflows and everything you do inside applications,"}, {"Time_Start": 684.0, "Time_End": 692.0, "Text": " the system is going to look crunchy on the outside, soft on the inside."}, {"Time_Start": 692.0, "Time_End": 696.0, "Text": " The problem is application state is very complex."}, {"Time_Start": 696.0, "Time_End": 703.0, "Text": " state is very complex in terms of the state of memory, disk, clients."}, {"Time_Start": 703.0, "Time_End": 709.0, "Text": " On the other hand, all that counts textual information allows you to write signatures that are"}, {"Time_Start": 709.0, "Time_End": 716.0, "Text": " application state-specific, specific to the state of the US, you know."}, {"Time_Start": 716.0, "Time_End": 725.0, "Text": " Within the context of a process, there's all sorts of system information that you can rely on that should be made."}, {"Time_Start": 725.0, "Time_End": 732.0, "Text": " that should be made, perhaps should be consistent each time in application runs or for each session."}, {"Time_Start": 732.0, "Time_End": 747.0, "Text": " And these contextual clues that, if they are consistent from run to run, allows you, can allow you to block from the inside of the system, inside the application."}, {"Time_Start": 747.0, "Time_End": 753.0, "Text": " So let's look at a specific example on FreeBSD."}, {"Time_Start": 753.0, "Time_End": 754.0, "Text": " How it works."}, {"Time_Start": 754.0, "Time_End": 755.0, "Text": " How it works."}, {"Time_Start": 755.0, "Time_End": 759.0, "Text": " and what's the motivation for doing this?"}, {"Time_Start": 759.0, "Time_End": 761.0, "Text": " We're going to look at an SSH exploit."}, {"Time_Start": 761.0, "Time_End": 766.0, "Text": " It's an off-I-1 and channel lookup in SSH 2.9."}, {"Time_Start": 766.0, "Time_End": 771.0, "Text": " And it was current in all the BSDs at the time the exploit occurred."}, {"Time_Start": 771.0, "Time_End": 777.0, "Text": " And the gap analysis for this was that"}, {"Time_Start": 777.0, "Time_End": 782.0, "Text": " if we can't rely on something, a hard, relatively hard,"}, {"Time_Start": 782.0, "Time_End": 785.0, "Text": " application like SSH, what can we rely on?"}, {"Time_Start": 785.0, "Time_End": 796.0, "Text": " and what can we do to prevent exploits on something we would usually trust?"}, {"Time_Start": 796.0, "Time_End": 801.0, "Text": " So in this example, the stuff being done by root is at the top of this green,"}, {"Time_Start": 801.0, "Time_End": 807.0, "Text": " the stuff being done by a client user, it's at the bottom."}, {"Time_Start": 807.0, "Time_End": 815.0, "Text": " So this is an example of setting up sys trace to filter system called"}, {"Time_Start": 815.0, "Time_End": 817.0, "Text": " for the SSH demon."}, {"Time_Start": 817.0, "Time_End": 824.0, "Text": " At the very top, you see a directory that CIS trace looks in to find all the rules,"}, {"Time_Start": 824.0, "Time_End": 830.0, "Text": " the rules that specify whether to permit or deny system calls."}, {"Time_Start": 830.0, "Time_End": 839.0, "Text": " In the second panel, we've invoked CIS trace with a capital A in order to gather all the system calls."}, {"Time_Start": 839.0, "Time_End": 844.0, "Text": " And it'll watch those system calls and spit out a list of what's"}, {"Time_Start": 844.0, "Time_End": 847.0, "Text": " what the application does."}, {"Time_Start": 851.0, "Time_End": 855.0, "Text": " So here on the bottom, we're locked in as a user."}, {"Time_Start": 855.0, "Time_End": 862.0, "Text": " We've got SSH demon running, and we run an exploit here."}, {"Time_Start": 862.0, "Time_End": 868.0, "Text": " The exploit uses, exploits this channel lookup."}, {"Time_Start": 868.0, "Time_End": 870.0, "Text": " up."}, {"Time_Start": 870.0, "Time_End": 882.0, "Text": " The exploit payload listens on port 11520 for a connection."}, {"Time_Start": 882.0, "Time_End": 885.0, "Text": " So that's what the payload is doing."}, {"Time_Start": 885.0, "Time_End": 891.0, "Text": " Then the client side connects to that port"}, {"Time_Start": 891.0, "Time_End": 896.0, "Text": " and the payload folks say root shell."}, {"Time_Start": 896.0, "Time_End": 903.0, "Text": " And there's a message from the authors as part of the source for the exploit."}, {"Time_Start": 903.0, "Time_End": 915.0, "Text": " So just to make sure what our context is, execute, execute ID, and we see we're root, wheel group."}, {"Time_Start": 915.0, "Time_End": 920.0, "Text": " And PWD shows us we're in the root of the file system."}, {"Time_Start": 920.0, "Time_End": 925.0, "Text": " So what can we do to modify this, to block that exploit?"}, {"Time_Start": 925.0, "Time_End": 926.0, "Text": " exploit."}, {"Time_Start": 926.0, "Time_End": 929.0, "Text": " Well, here we stop SSHD."}, {"Time_Start": 929.0, "Time_End": 936.0, "Text": " And when it exits, CIST trace generates a file containing all the rules."}, {"Time_Start": 936.0, "Time_End": 938.0, "Text": " So there's the file right there."}, {"Time_Start": 938.0, "Time_End": 942.0, "Text": " User bin SSHD."}, {"Time_Start": 942.0, "Time_End": 946.0, "Text": " And we'll look at what it contains here."}, {"Time_Start": 946.0, "Time_End": 949.0, "Text": " What we'll see is a list of system calls."}, {"Time_Start": 949.0, "Time_End": 954.0, "Text": " These are all the system calls that SSHD invoked."}, {"Time_Start": 954.0, "Time_End": 958.0, "Text": " invoked. You see all names of all libraries."}, {"Time_Start": 958.0, "Time_End": 964.0, "Text": " So it gives you all the file names that it needs access to to to run."}, {"Time_Start": 964.0, "Time_End": 968.0, "Text": " And down at the bottom of all the permissions, you see something interesting."}, {"Time_Start": 968.0, "Time_End": 972.0, "Text": " It's invoked bin SH."}, {"Time_Start": 972.0, "Time_End": 977.0, "Text": " So that's something that's that SHHHD,"}, {"Time_Start": 977.0, "Time_End": 982.0, "Text": " you know, fundamentally normally does."}, {"Time_Start": 982.0, "Time_End": 983.0, "Text": " But we can tell you know,"}, {"Time_Start": 983.0, "Time_End": 987.0, "Text": " But we can tune it a little bit by adding a condition."}, {"Time_Start": 987.0, "Time_End": 995.0, "Text": " Let's change it so that it can fork a shell only if it's not root."}, {"Time_Start": 995.0, "Time_End": 999.0, "Text": " So what happens when we change that rule?"}, {"Time_Start": 999.0, "Time_End": 1003.0, "Text": " We'll invoke SSHD again with a minus little A."}, {"Time_Start": 1003.0, "Time_End": 1007.0, "Text": " That means apply these rules with a default deny policy."}, {"Time_Start": 1007.0, "Time_End": 1012.0, "Text": " So any system call that it hadn't made the first time is going to return an error."}, {"Time_Start": 1012.0, "Time_End": 1029.0, "Text": " error. So invoke the exploit again. The client side binds to port, I'm sorry, the payload binds to port 11, 520."}, {"Time_Start": 1029.0, "Time_End": 1040.0, "Text": " A client side connects to it. It tries to fork a shell as root, and a system call returns an error, and they close the connection."}, {"Time_Start": 1042.0, "Time_End": 1050.0, "Text": " So that's the fundamental motivation for doing something like this,"}, {"Time_Start": 1050.0, "Time_End": 1055.0, "Text": " to add another layer to the security inside the host."}, {"Time_Start": 1055.0, "Time_End": 1058.0, "Text": " And that does a couple of things."}, {"Time_Start": 1058.0, "Time_End": 1066.0, "Text": " In this context, we're looking at SHD that's normally one of the most trusted applications."}, {"Time_Start": 1066.0, "Time_End": 1071.98, "Text": " In this instance, it's an off-by-one error in Channel Lookup that's buffered"}, {"Time_Start": 1072.0, "Time_End": 1079.0, "Text": " overflow and elevates an user to root. It was in all the BSDs, as we just mentioned before the demo."}, {"Time_Start": 1079.0, "Time_End": 1087.0, "Text": " What can we do if we can't rely on something as trusted as H-S-S-S-H?"}, {"Time_Start": 1087.0, "Time_End": 1090.0, "Text": " What can we do to prevent this?"}, {"Time_Start": 1090.0, "Time_End": 1098.0, "Text": " As we see and saw in the example, we're doing something there that's specific to the payload, not the injection method."}, {"Time_Start": 1098.0, "Time_End": 1107.0, "Text": " And that's slightly different than what's happening at other layers."}, {"Time_Start": 1107.0, "Time_End": 1115.0, "Text": " It's a unique way to recognize what's going on in the exploit, rather than being unique to"}, {"Time_Start": 1115.0, "Time_End": 1118.0, "Text": " unique to aspects of the injection."}, {"Time_Start": 1118.0, "Time_End": 1127.0, "Text": " But for each of those, if there's contextual information that's usually consistent,"}, {"Time_Start": 1127.0, "Time_End": 1139.0, "Text": " we can use that to form rules that narrow the footprint of the exposure of the system."}, {"Time_Start": 1139.0, "Time_End": 1145.0, "Text": " What kind of contextual information do we have inside the application?"}, {"Time_Start": 1145.0, "Time_End": 1153.0, "Text": " We've got network identity of the client, the IP address of the source of the connection."}, {"Time_Start": 1153.0, "Time_End": 1156.0, "Text": " A lot of times we have user identity."}, {"Time_Start": 1156.0, "Time_End": 1165.0, "Text": " either on the client system or user identity inside the application."}, {"Time_Start": 1165.0, "Time_End": 1168.0, "Text": " We've got application state."}, {"Time_Start": 1168.0, "Time_End": 1173.0, "Text": " We've got information about what was done to authenticate the connection."}, {"Time_Start": 1173.0, "Time_End": 1175.0, "Text": " We've got information about workflow."}, {"Time_Start": 1175.0, "Time_End": 1182.0, "Text": " We're in the state of the processing we are."}, {"Time_Start": 1182.0, "Time_End": 1185.0, "Text": " And we've got the advantage of being orthogonal."}, {"Time_Start": 1185.0, "Time_End": 1192.0, "Text": " being orthogonal to methods that are applied in other layers."}, {"Time_Start": 1196.0, "Time_End": 1202.0, "Text": " So MD5 suggested I look at firewall wizards discussion."}, {"Time_Start": 1202.0, "Time_End": 1206.0, "Text": " And they were saying that intrusion prevention basically looks like a firewall."}, {"Time_Start": 1206.0, "Time_End": 1210.0, "Text": " At first I thought, you know, that's a lot like a kid with a hammer."}, {"Time_Start": 1210.0, "Time_End": 1212.0, "Text": " Everything looks like a nail."}, {"Time_Start": 1212.0, "Time_End": 1214.0, "Text": " But they have a good point."}, {"Time_Start": 1214.0, "Time_End": 1223.0, "Text": " You got messages that come in, messages that go out and rules that decide what gets discarded."}, {"Time_Start": 1223.0, "Time_End": 1227.0, "Text": " In a firewall, that's packets and sessions."}, {"Time_Start": 1227.0, "Time_End": 1232.0, "Text": " And the host-based side is analogous to that."}, {"Time_Start": 1232.0, "Time_End": 1235.0, "Text": " You can look at it as API calls."}, {"Time_Start": 1235.0, "Time_End": 1239.0, "Text": " But even more fundamentally, when you make a system trap,"}, {"Time_Start": 1239.0, "Time_End": 1243.0, "Text": " when the trap occurs, you've just got data sitting there."}, {"Time_Start": 1243.0, "Time_End": 1249.24, "Text": " This is a number. You've got a bunch of arguments seeing there in memory."}, {"Time_Start": 1249.24, "Time_End": 1255.76, "Text": " So you've got a packet of information."}, {"Time_Start": 1255.76, "Time_End": 1262.16, "Text": " So where for the network you have packets, IP packets and signatures on those."}, {"Time_Start": 1262.16, "Time_End": 1267.64, "Text": " On the host-based side, when you have a trap, you've got packets of Cisco information."}, {"Time_Start": 1273.0, "Time_End": 1283.0, "Text": " So you probably wouldn't consider running on this network without a firewall, would you?"}, {"Time_Start": 1283.0, "Time_End": 1287.0, "Text": " And it's not that firewalls are the only essential thing."}, {"Time_Start": 1287.0, "Time_End": 1295.0, "Text": " It's that they allow you together with the other parts of the security architecture"}, {"Time_Start": 1295.0, "Time_End": 1301.0, "Text": " to mount an effective defense."}, {"Time_Start": 1301.0, "Time_End": 1302.0, "Text": " So I would look at..."}, {"Time_Start": 1302.0, "Time_End": 1308.0, "Text": " I would look at intrusion prevention in the same way, that it's not a solution in itself,"}, {"Time_Start": 1308.0, "Time_End": 1316.0, "Text": " but it's a way to tune all the layers together to provide something effective."}, {"Time_Start": 1326.0, "Time_End": 1331.0, "Text": " So where is intrusion prevention going and how is it different?"}, {"Time_Start": 1331.0, "Time_End": 1336.0, "Text": " The firewall wizards distinguish intrusion prevention from other kinds of firewalls"}, {"Time_Start": 1336.0, "Time_End": 1340.0, "Text": " and that they use signatures rather than rules."}, {"Time_Start": 1340.0, "Time_End": 1345.0, "Text": " Take a lot more state into consideration."}, {"Time_Start": 1345.0, "Time_End": 1351.0, "Text": " But these aren't the same kind of rules that you might run in an intrusion detection system."}, {"Time_Start": 1351.0, "Time_End": 1360.0, "Text": " There are more, in more cases, they're signatures as forms of access control."}, {"Time_Start": 1360.0, "Time_End": 1362.0, "Text": " of access control."}, {"Time_Start": 1366.0, "Time_End": 1371.0, "Text": " So consider hort and snort with hogwash."}, {"Time_Start": 1371.0, "Time_End": 1375.0, "Text": " That's the sort of signature-based firewall they're talking about."}, {"Time_Start": 1375.0, "Time_End": 1379.0, "Text": " And the ID&S vendors call this and Gateway IDS."}, {"Time_Start": 1379.0, "Time_End": 1384.0, "Text": " Some people look at it as intrusion prevention."}, {"Time_Start": 1384.0, "Time_End": 1389.0, "Text": " And again, that's why I don't necessarily want to try and give you a definition."}, {"Time_Start": 1389.0, "Time_End": 1395.0, "Text": " There's a lot of creativity going on out there, and I think it's up to the community to decide"}, {"Time_Start": 1395.0, "Time_End": 1404.0, "Text": " what the effective boundaries between the layers are and what the effective architecture is."}, {"Time_Start": 1404.0, "Time_End": 1408.0, "Text": " And what the effective architecture is."}, {"Time_Start": 1408.0, "Time_End": 1417.0, "Text": " So firewalls are complementary to routers and identity."}, {"Time_Start": 1417.0, "Time_End": 1424.0, "Text": " Intrusion prevention can be complementary to antivirus, sending out of the file system layer."}, {"Time_Start": 1424.0, "Time_End": 1432.0, "Text": " The intrusion prevention filters messages is basically data staying on the stack or memory."}, {"Time_Start": 1432.0, "Time_End": 1437.0, "Text": " When you do a trap interrupt."}, {"Time_Start": 1437.0, "Time_End": 1444.0, "Text": " And the intrusion prevention can use signatures to recognize,"}, {"Time_Start": 1444.0, "Time_End": 1452.0, "Text": " rather than the ejection method, the payload, the behavior of the payload."}, {"Time_Start": 1452.0, "Time_End": 1458.0, "Text": " So how does this work?"}, {"Time_Start": 1458.0, "Time_End": 1465.0, "Text": " Let's take a look at some architectural layering in Windows and Unix."}, {"Time_Start": 1465.0, "Time_End": 1466.0, "Text": " So here's windows."}, {"Time_Start": 1466.0, "Time_End": 1467.0, "Text": " Windows."}, {"Time_Start": 1467.0, "Time_End": 1472.0, "Text": " kernel architecture, user land."}, {"Time_Start": 1472.0, "Time_End": 1480.0, "Text": " It's a little bit different from Unix than that they have microcarnal architecture and a few more layers."}, {"Time_Start": 1480.0, "Time_End": 1489.0, "Text": " At the top you've got executive services. That's where most of the SISC calls land first."}, {"Time_Start": 1489.0, "Time_End": 1496.0, "Text": " That takes the traps, routes the messages, and you've got an NTDLL."}, {"Time_Start": 1496.0, "Time_End": 1503.0, "Text": " In some ways, kind of like Lib C, that takes an API call, turns it into a trap."}, {"Time_Start": 1503.0, "Time_End": 1508.0, "Text": " It turns it into a trap."}, {"Time_Start": 1508.0, "Time_End": 1514.0, "Text": " Oh, that's basically what I just said."}, {"Time_Start": 1514.0, "Time_End": 1518.0, "Text": " You've got in the bottom half, executive services at the top."}, {"Time_Start": 1518.0, "Time_End": 1523.0, "Text": " A bunch of top level services"}, {"Time_Start": 1523.0, "Time_End": 1530.0, "Text": " that abstract away the hardware for various objects."}, {"Time_Start": 1530.0, "Time_End": 1536.0, "Text": " At the bottom, hardware abstraction layers."}, {"Time_Start": 1536.0, "Time_End": 1539.0, "Text": " Oh, dang."}, {"Time_Start": 1539.0, "Time_End": 1546.0, "Text": " End and home are right next to page up and page down."}, {"Time_Start": 1546.0, "Time_End": 1552.0, "Text": " Okay, so this is a example of Linux system architecture architecture."}, {"Time_Start": 1552.0, "Time_End": 1553.0, "Text": " architecture."}, {"Time_Start": 1553.0, "Time_End": 1562.0, "Text": " It's similar in some ways, especially the boundary between the user land and kernel."}, {"Time_Start": 1562.0, "Time_End": 1572.34, "Text": " So they've got LibC up there between the applications and the trap, which is represented"}, {"Time_Start": 1572.34, "Time_End": 1573.5, "Text": " by the dotted line."}, {"Time_Start": 1573.5, "Time_End": 1580.7, "Text": " Below that, you've got the system call interface that interprets it interprets the information associated"}, {"Time_Start": 1580.7, "Time_End": 1581.3, "Text": " with a trap."}, {"Time_Start": 1581.3, "Time_End": 1586.3, "Text": " turns it into access to the various modules there."}, {"Time_Start": 1586.3, "Time_End": 1600.3, "Text": " And you've got some layers, but most of the layers are specific to certain kinds of resources in the case of Linux."}, {"Time_Start": 1600.3, "Time_End": 1610.3, "Text": " And this is simply a fact of the architectural decision to use a macro kernel architecture."}, {"Time_Start": 1610.3, "Time_End": 1617.3, "Text": " So what are the common abstractions here?"}, {"Time_Start": 1621.3, "Time_End": 1627.3, "Text": " We've got a common abstraction in a layer between applications in the layer between applications"}, {"Time_Start": 1627.3, "Time_End": 1638.3, "Text": " in the kernel and between most of the kernel and the upper side above the trap."}, {"Time_Start": 1638.3, "Time_End": 1639.3, "Text": " Each of these layers provides some of the trap."}, {"Time_Start": 1639.3, "Time_End": 1640.3, "Text": " Each of these layers provides some."}, {"Time_Start": 1640.3, "Time_End": 1642.3, "Text": " unique contextual information."}, {"Time_Start": 1642.3, "Time_End": 1647.3, "Text": " So we're going to look closer at this particular boundary."}, {"Time_Start": 1647.3, "Time_End": 1653.3, "Text": " You can apply this principle to all the other layers."}, {"Time_Start": 1653.3, "Time_End": 1663.3, "Text": " This just happens to be a convenient place to do it because the method is very consistent"}, {"Time_Start": 1663.3, "Time_End": 1667.3, "Text": " across the various OS's."}, {"Time_Start": 1667.3, "Time_End": 1669.3, "Text": " So to compare them"}, {"Time_Start": 1669.3, "Time_End": 1673.3, "Text": " This highlights the similarities."}, {"Time_Start": 1673.3, "Time_End": 1686.3, "Text": " You get a C library on top and something on bottom that interprets the traps and turns them back into calls to services in the kernel."}, {"Time_Start": 1686.3, "Time_End": 1699.22, "Text": " So even if we consider the application of black box, even if we consider the application of black box, even if we"}, {"Time_Start": 1699.3, "Time_End": 1704.3, "Text": " don't look at contextual information specific to an application."}, {"Time_Start": 1704.3, "Time_End": 1710.3, "Text": " We still have contextual information at these various levels."}, {"Time_Start": 1710.3, "Time_End": 1716.3, "Text": " Contextual information in API calls in Lips C,"}, {"Time_Start": 1716.3, "Time_End": 1722.3, "Text": " where we can trap contextual information when the system calls invoked and we have trap"}, {"Time_Start": 1722.3, "Time_End": 1725.3, "Text": " into the system call interface."}, {"Time_Start": 1725.3, "Time_End": 1728.3, "Text": " And lastly, at the instruction level,"}, {"Time_Start": 1728.3, "Time_End": 1729.3, "Text": " level."}, {"Time_Start": 1729.3, "Time_End": 1735.6599999999999, "Text": " And all of these are, all these have distinct advantages."}, {"Time_Start": 1735.6599999999999, "Time_End": 1741.5, "Text": " So what's being done today is really something that's the tip of the iceberg."}, {"Time_Start": 1741.5, "Time_End": 1751.74, "Text": " We're looking at the most convenient place to apply these principles."}, {"Time_Start": 1751.74, "Time_End": 1757.98, "Text": " So as exploits are advancing in terms of capabilities, there's a lot of focus on escaping"}, {"Time_Start": 1757.98, "Time_End": 1764.22, "Text": " IDS or using exceptional behavior to get in."}, {"Time_Start": 1764.22, "Time_End": 1770.22, "Text": " And I'm somewhat delusioned with IDS."}, {"Time_Start": 1770.22, "Time_End": 1773.98, "Text": " And so what I'm, I'm somewhat delusioned with IDS."}, {"Time_Start": 1773.98, "Time_End": 1786.02, "Text": " And so what I'm, this provides a way to take an entirely different approach."}, {"Time_Start": 1786.02, "Time_End": 1797.02, "Text": " And it's a unique approach because it's independent of the transport, can be independent of the transport, and independent of the method of objection."}, {"Time_Start": 1797.02, "Time_End": 1805.02, "Text": " And it can be specific to the state or behavior of the application and the behavior of the exploit payload."}, {"Time_Start": 1805.02, "Time_End": 1815.02, "Text": " So in terms of gap analysis, when you"}, {"Time_Start": 1815.02, "Time_End": 1818.02, "Text": " implement layered security."}, {"Time_Start": 1818.02, "Time_End": 1823.02, "Text": " A lot of the host security depends on the integrity of the OS."}, {"Time_Start": 1823.02, "Time_End": 1830.02, "Text": " And this assumption is made even we have very complex or vulnerable or untrusted applications."}, {"Time_Start": 1830.02, "Time_End": 1836.02, "Text": " Things like Netscape, I.E, binds, and mail, even SSH."}, {"Time_Start": 1836.02, "Time_End": 1841.02, "Text": " Exploits are advancing just as rapidly as the defense is."}, {"Time_Start": 1841.02, "Time_End": 1844.02, "Text": " And those advances,"}, {"Time_Start": 1844.02, "Time_End": 1863.62, "Text": " Those advances are often gaining capability to circumvent existing layers, you know, using encryption, fragmentation, reencoding."}, {"Time_Start": 1863.62, "Time_End": 1872.78, "Text": " So added layers is a common way to enhance protection."}, {"Time_Start": 1872.78, "Time_End": 1881.78, "Text": " The system call rules have a distinct advantage in terms of being specific to individual system calls."}, {"Time_Start": 1881.78, "Time_End": 1890.78, "Text": " And you can use them to enforce permissions, but you can also use rules to alter system call semantics,"}, {"Time_Start": 1890.78, "Time_End": 1897.3799999999999, "Text": " alter what the system call does and how it does it."}, {"Time_Start": 1897.3799999999999, "Time_End": 1902.76, "Text": " So what we saw in the example was we first invoked the SSH demon to generate a set of"}, {"Time_Start": 1902.78, "Time_End": 1908.46, "Text": " rules to allow or disallow individual system calls."}, {"Time_Start": 1908.46, "Time_End": 1916.62, "Text": " So by default, we invoked it once and got a list of what it normally invokes."}, {"Time_Start": 1916.62, "Time_End": 1920.72, "Text": " And this narrows the footprint of interaction with the system."}, {"Time_Start": 1920.72, "Time_End": 1926.8, "Text": " So that later on, if we invoke it again and does something different that's outside"}, {"Time_Start": 1926.8, "Time_End": 1929.96, "Text": " of that footprint, it's blocked."}, {"Time_Start": 1932.78, "Time_End": 1942.78, "Text": " And we can refine that in consideration with the other layers to reduce the dependence of the other layers."}, {"Time_Start": 1946.78, "Time_End": 1956.28, "Text": " In fact, we can reduce the dependence of the other layers on the permissions they need."}, {"Time_Start": 1956.28, "Time_End": 1959.78, "Text": " For example, you can rewrite the..."}, {"Time_Start": 1962.78, "Time_End": 1969.78, "Text": " bind call, bind to a socket, so that you can open a low-numbered port without"}, {"Time_Start": 1969.78, "Time_End": 1975.78, "Text": " being root and then perhaps not have to run a service as route."}, {"Time_Start": 1975.78, "Time_End": 1985.78, "Text": " So being out, changing the semantics so that the application needs less resources"}, {"Time_Start": 1985.78, "Time_End": 1991.78, "Text": " is one way to move the specificity to move the specificity."}, {"Time_Start": 1991.78, "Time_End": 1996.94, "Text": " of the rules to the layer that best supports it."}, {"Time_Start": 2000.7, "Time_End": 2003.96, "Text": " We can also rewrite system call arguments."}, {"Time_Start": 2007.02, "Time_End": 2008.72, "Text": " We'll talk about that a bit more."}, {"Time_Start": 2013.72, "Time_End": 2017.8799999999999, "Text": " Some of the implementations use pop-up dialogue, similar to what a firewall does."}, {"Time_Start": 2017.8799999999999, "Time_End": 2021.76, "Text": " So you, and this is a big advantage in terms of being able to,"}, {"Time_Start": 2021.78, "Time_End": 2031.08, "Text": " to generate a first draft of your rules and not have to close all the gaps immediately."}, {"Time_Start": 2033.48, "Time_End": 2037.96, "Text": " And it takes advantage of a default ask policy."}, {"Time_Start": 2039.16, "Time_End": 2042.3, "Text": " So rather than just permit, deny, you've got default and ask."}, {"Time_Start": 2043.42, "Time_End": 2045.3, "Text": " I mean, you've got ask."}, {"Time_Start": 2046.3999999999999, "Time_End": 2051.74, "Text": " This allows gaps in the rules, allows you to incrementally develop the rules."}, {"Time_Start": 2051.78, "Time_End": 2053.5400000000004, "Text": " as you observe behavior."}, {"Time_Start": 2055.6800000000003, "Time_End": 2059.5800000000004, "Text": " It allows you to interactively, iteratively tune the specificity."}, {"Time_Start": 2066.1800000000003, "Time_End": 2076.1800000000003, "Text": " Furthermore, in addition to permit and deny and ask, you can log exceptions, exceptional calls or"}, {"Time_Start": 2076.1800000000003, "Time_End": 2081.5400000000004, "Text": " or interesting calls, divine calls, divine rules for interesting calls like Fort Benes"}, {"Time_Start": 2081.54, "Time_End": 2085.98, "Text": " BNS's route, and this permits improved reporting."}, {"Time_Start": 2089.22, "Time_End": 2095.3, "Text": " Also permits logging interesting contextual information."}, {"Time_Start": 2095.3, "Time_End": 2103.66, "Text": " So when FFNSH occurs as route, grab the client user IP domain and application state."}, {"Time_Start": 2111.54, "Time_End": 2114.96, "Text": " So the next couple of slides talk about how this works in practice."}, {"Time_Start": 2116.2599999999998, "Time_End": 2125.4, "Text": " For a lot of applications, things like LS, find, a lot of other core components,"}, {"Time_Start": 2127.06, "Time_End": 2131.24, "Text": " a lot of them use around 25 system calls."}, {"Time_Start": 2132.08, "Time_End": 2139.72, "Text": " And relatively heavyweight applications like browsers, email clients, you know, with"}, {"Time_Start": 2139.72, "Time_End": 2140.6, "Text": " with rich interaction."}, {"Time_Start": 2141.54, "Time_End": 2142.7799999999997, "Text": " They can use up to 60."}, {"Time_Start": 2142.9, "Time_End": 2148.44, "Text": " And this is out of a total, let's say, 250 for Unix."}, {"Time_Start": 2150.7, "Time_End": 2154.06, "Text": " And I don't even know how many there are in Windows, a couple thousand."}, {"Time_Start": 2157.4, "Time_End": 2168.96, "Text": " And as it stands, most of the current implementations are generating and using rules for file names."}, {"Time_Start": 2169.38, "Time_End": 2171.52, "Text": " And in some way, this duplicates file systems."}, {"Time_Start": 2171.54, "Time_End": 2179.02, "Text": " And what this suggests is that there needs to be more consideration of cross-layer"}, {"Time_Start": 2179.02, "Time_End": 2184.86, "Text": " architecture and interaction of the file system productions and the syscall."}, {"Time_Start": 2188.82, "Time_End": 2195.2799999999997, "Text": " What it also means in terms of performance impact that is that typically there's a high"}, {"Time_Start": 2195.2799999999997, "Time_End": 2201.52, "Text": " performance impact on applications that make a lot of open system calls in terms of using"}, {"Time_Start": 2201.54, "Time_End": 2205.54, "Text": " rules that do a string match or rules that use regular expressions."}, {"Time_Start": 2207.3, "Time_End": 2214.3, "Text": " And with the current implementations, you see relatively low impact on anything that's CPU bound."}, {"Time_Start": 2223.16, "Time_End": 2230.04, "Text": " What this means in terms, well, let's look at how this fits into the rest of the system."}, {"Time_Start": 2230.04, "Time_End": 2236.9, "Text": " One advantage of this is that the system call filtering is completely transparent to the application."}, {"Time_Start": 2238.24, "Time_End": 2246.72, "Text": " So the application doesn't have to know anything about or recognize anything about the system call filtering."}, {"Time_Start": 2247.7799999999997, "Time_End": 2251.52, "Text": " So you can use third-party applications, untrusted applications."}, {"Time_Start": 2254.44, "Time_End": 2259.6, "Text": " Caviardiat is that is that rule creation isn't,"}, {"Time_Start": 2260.04, "Time_End": 2265.04, "Text": " fully automated yet. It's not completely transparent to the user."}, {"Time_Start": 2265.04, "Time_End": 2269.04, "Text": " And that's where it's really important for things to be transparent."}, {"Time_Start": 2269.04, "Time_End": 2280.04, "Text": " And lastly, that as it stands, most of the tools generate rules by observing application behavior."}, {"Time_Start": 2280.04, "Time_End": 2289.04, "Text": " And in general, it's large part of the advantage is being able to reduce the dependence in other layers."}, {"Time_Start": 2289.04, "Time_End": 2290.04, "Text": " and other layers."}, {"Time_Start": 2290.04, "Time_End": 2302.04, "Text": " So, zero-day code."}, {"Time_Start": 2302.04, "Time_End": 2308.04, "Text": " There's patches for free BSD 5.1 on the conference CD."}, {"Time_Start": 2308.04, "Time_End": 2312.04, "Text": " Niels Provost has all these."}, {"Time_Start": 2312.04, "Time_End": 2316.04, "Text": " They are differences between the CISD"}, {"Time_Start": 2316.04, "Time_End": 2318.04, "Text": " and NetBSD and OpenBSD current."}, {"Time_Start": 2318.04, "Time_End": 2328.54, "Text": " BSD current for kernel and user land in free BSD 5.1."}, {"Time_Start": 2328.54, "Time_End": 2331.04, "Text": " It's on the conference CD."}, {"Time_Start": 2331.04, "Time_End": 2333.54, "Text": " It's on Neal's Provost's homepage."}, {"Time_Start": 2333.54, "Time_End": 2337.54, "Text": " And hopefully we'll be in PrebSD current soon."}, {"Time_Start": 2337.54, "Time_End": 2347.54, "Text": " So here's what I believe of the current advantage is."}, {"Time_Start": 2347.54, "Time_End": 2350.1, "Text": " of these tools."}, {"Time_Start": 2351.9, "Time_End": 2355.4, "Text": " You've got things like CHRoot and J.O."}, {"Time_Start": 2356.4, "Time_End": 2357.4, "Text": " for sandboxing."}, {"Time_Start": 2358.82, "Time_End": 2364.24, "Text": " System call filtering does some of the same kind of thing in terms of being able to"}, {"Time_Start": 2364.24, "Time_End": 2370.54, "Text": " reduce the footprint of an application's interaction with the system"}, {"Time_Start": 2370.54, "Time_End": 2374.38, "Text": " and can be tuned for the footprint of each application."}, {"Time_Start": 2376.12, "Time_End": 2377.52, "Text": " The current tools are you."}, {"Time_Start": 2377.54, "Time_End": 2383.86, "Text": " allow iterative and interactive rule generation a lot very similar to what"}, {"Time_Start": 2383.86, "Time_End": 2385.3, "Text": " firewalls do."}, {"Time_Start": 2385.3, "Time_End": 2392.2599999999998, "Text": " It's got some limited automated rule generation in terms of tracing past"}, {"Time_Start": 2392.2599999999998, "Time_End": 2394.42, "Text": " indication of the application."}, {"Time_Start": 2394.42, "Time_End": 2405.06, "Text": " It's transparent to the application and allows you to tune system call permissions, but"}, {"Time_Start": 2405.06, "Time_End": 2407.52, "Text": " more importantly, system call semantics."}, {"Time_Start": 2407.54, "Time_End": 2413.48, "Text": " you can change the system called semantics to reduce the dependency of other layers"}, {"Time_Start": 2413.48, "Time_End": 2419.96, "Text": " on the security architecture, on their ability to enforce permissions."}, {"Time_Start": 2421.04, "Time_End": 2425.58, "Text": " So it's available for FreeBSD 4.8 and 5.1 right now."}, {"Time_Start": 2426.6, "Time_End": 2433.7, "Text": " And you can find updated versions on my website, on Neal's Provost's website,"}, {"Time_Start": 2434.04, "Time_End": 2436.22, "Text": " hopefully in FreeBSD soon."}, {"Time_Start": 2437.54, "Time_End": 2443.54, "Text": " The slides that you're looking at now are slightly different than what's on the CD."}, {"Time_Start": 2443.54, "Time_End": 2451.54, "Text": " And the updated slides will be on the DefCon sites archives and on my sites."}, {"Time_Start": 2451.54, "Time_End": 2454.54, "Text": " And if you like, you can contact me at this email address."}, {"Time_Start": 2454.54, "Time_End": 2456.54, "Text": " I think that's about it."}, {"Time_Start": 2467.54, "Time_End": 2469.54, "Text": " Wow, we're way early."}, {"Time_Start": 2474.54, "Time_End": 2479.54, "Text": " So there's a couple other things I can talk about."}, {"Time_Start": 2482.54, "Time_End": 2485.54, "Text": " Before the questions, let me make a couple more comments."}, {"Time_Start": 2485.54, "Time_End": 2488.54, "Text": " We looked at the system architecture."}, {"Time_Start": 2492.54, "Time_End": 2494.54, "Text": " There's a common architecture."}, {"Time_Start": 2494.54, "Time_End": 2496.54, "Text": " There's a common architecture."}, {"Time_Start": 2496.54, "Time_End": 2497.54, "Text": " There's a common architecture."}, {"Time_Start": 2497.54, "Time_End": 2499.54, "Text": " the layer between users and a kernel."}, {"Time_Start": 2502.54, "Time_End": 2508.54, "Text": " And this is similar at the source code level for the BSDs."}, {"Time_Start": 2508.54, "Time_End": 2514.54, "Text": " And similar at the binary level for Windows."}, {"Time_Start": 2514.54, "Time_End": 2525.54, "Text": " So for these tools in general across all these systems platforms, there's a lot of"}, {"Time_Start": 2525.54, "Time_End": 2532.54, "Text": " commonality in the architecture of how you implement system call filtering."}, {"Time_Start": 2532.54, "Time_End": 2539.54, "Text": " You've got to have a device that allows you to set rules."}, {"Time_Start": 2539.54, "Time_End": 2543.54, "Text": " So something in slash dev that'll, you can write rules to."}, {"Time_Start": 2543.54, "Time_End": 2549.54, "Text": " You've got to get the module into the kernel somehow."}, {"Time_Start": 2549.54, "Time_End": 2554.54, "Text": " And when the module is invoked on a kernel somehow."}, {"Time_Start": 2554.54, "Time_End": 2555.54, "Text": " And when the module is invoked on a..."}, {"Time_Start": 2555.54, "Time_End": 2562.54, "Text": " particular application that's got to have hooks to start up, grab the rules,"}, {"Time_Start": 2562.54, "Time_End": 2571.54, "Text": " wait for an application to be invoked, and it's got to catch the application as it starts up."}, {"Time_Start": 2571.54, "Time_End": 2577.54, "Text": " You know, between when fork is called and when the application starts up,"}, {"Time_Start": 2577.54, "Time_End": 2580.54, "Text": " do things like fill out the system call table."}, {"Time_Start": 2580.54, "Time_End": 2584.54, "Text": " And there are a couple of methods of how you do the hooking."}, {"Time_Start": 2584.54, "Time_End": 2594.54, "Text": " But it's always going to occur between when you create the process and when it begins to execute."}, {"Time_Start": 2594.54, "Time_End": 2598.54, "Text": " And there are a couple of different implementations out there."}, {"Time_Start": 2598.54, "Time_End": 2600.54, "Text": " Are we close?"}, {"Time_Start": 2600.54, "Time_End": 2601.54, "Text": " Okay."}, {"Time_Start": 2601.54, "Time_End": 2604.54, "Text": " I can just have you announced the award ceremony."}, {"Time_Start": 2604.54, "Time_End": 2606.54, "Text": " I'm going to be in Apollo and not here."}, {"Time_Start": 2606.54, "Time_End": 2609.54, "Text": " I've had about 15 people in last two minutes asking that."}, {"Time_Start": 2609.54, "Time_End": 2613.54, "Text": " So awards in Apollo, not here in the 10, we're going to get to go off."}, {"Time_Start": 2613.54, "Time_End": 2614.54, "Text": " I'm told you."}, {"Time_Start": 2614.54, "Time_End": 2618.9, "Text": " award ceremony is going to be held in the Apollo room rather than here."}, {"Time_Start": 2618.9, "Time_End": 2623.7, "Text": " And that's at 4 o'clock."}, {"Time_Start": 2623.7, "Time_End": 2626.7799999999997, "Text": " It's about 3.40?"}, {"Time_Start": 2626.7799999999997, "Time_End": 2628.7799999999997, "Text": " 345?"}, {"Time_Start": 2628.7799999999997, "Time_End": 2629.7799999999997, "Text": " 35."}, {"Time_Start": 2629.7799999999997, "Time_End": 2630.86, "Text": " 35."}, {"Time_Start": 2630.86, "Time_End": 2633.16, "Text": " Okay."}, {"Time_Start": 2633.16, "Time_End": 2641.04, "Text": " So the similarities here across all these platforms are those, those junction points I just mentioned,"}, {"Time_Start": 2641.04, "Time_End": 2644.52, "Text": " between startup of the application, or between"}, {"Time_Start": 2644.54, "Time_End": 2651.54, "Text": " creating the application, filling out the process structure, and starting the application,"}, {"Time_Start": 2651.54, "Time_End": 2658.54, "Text": " something that happens when the modules loaded, and some kind of architecture for a device that"}, {"Time_Start": 2658.54, "Time_End": 2664.54, "Text": " applications can read or write rules to."}, {"Time_Start": 2664.54, "Time_End": 2671.54, "Text": " There's a couple different instances or implementations of system called tracing."}, {"Time_Start": 2671.54, "Time_End": 2673.54, "Text": " We looked at one, systrace."}, {"Time_Start": 2673.54, "Time_End": 2678.54, "Text": " There is another for free BST called SERP NG, Serb Next Generation."}, {"Time_Start": 2678.54, "Time_End": 2689.54, "Text": " They, that varies from CIST trace in a couple of ways."}, {"Time_Start": 2689.54, "Time_End": 2695.54, "Text": " It's a loadable kernel module."}, {"Time_Start": 2695.54, "Time_End": 2702.54, "Text": " But they both have to do the same kinds of things in terms of where they hook in."}, {"Time_Start": 2702.54, "Time_End": 2703.54, "Text": " Whether it's module."}, {"Time_Start": 2703.54, "Time_End": 2712.08, "Text": " load or if it's a static, statically compiled, in the case of CIS trace, there's a start-up"}, {"Time_Start": 2712.08, "Time_End": 2716.54, "Text": " routine that gets called."}, {"Time_Start": 2716.54, "Time_End": 2721.3, "Text": " So for each of these implementations, they may plug in different, but they're basically going"}, {"Time_Start": 2721.3, "Time_End": 2726.7599999999998, "Text": " in in the same place, same place."}, {"Time_Start": 2726.7599999999998, "Time_End": 2732.86, "Text": " Startup of the module, startup of the application."}, {"Time_Start": 2732.86, "Time_End": 2737.6, "Text": " and something that happens at the SISCOL, at the time of the SISC call."}, {"Time_Start": 2738.86, "Time_End": 2741.86, "Text": " And because we've got a couple of implementations out there,"}, {"Time_Start": 2744.86, "Time_End": 2753.02, "Text": " I have a feeling that these things are going to evolve a lot like the way the firewalls are evolving and other tools."}, {"Time_Start": 2753.02, "Time_End": 2761.46, "Text": " And that there was a statement by Linux, Linus Torvalds, recently about"}, {"Time_Start": 2761.46, "Time_End": 2767.78, "Text": " people lobbying to put in other firewall implementations."}, {"Time_Start": 2767.78, "Time_End": 2774.52, "Text": " And he basically said, I'm not convinced which one is the best or where we go to, where"}, {"Time_Start": 2774.52, "Time_End": 2775.08, "Text": " we're going to go."}, {"Time_Start": 2775.18, "Time_End": 2780.64, "Text": " So what I want to do is create an API and let them all sort it out."}, {"Time_Start": 2784.6, "Time_End": 2791.42, "Text": " So I think that's what I'm going to try to pursue next is create a first draft of an API."}, {"Time_Start": 2791.46, "Time_End": 2803.46, "Text": " I get CIS trace and serve next generation to plug in and then hopefully let them fight it out."}, {"Time_Start": 2803.46, "Time_End": 2811.46, "Text": " How are we doing on time?"}, {"Time_Start": 2811.46, "Time_End": 2817.46, "Text": " Okay. Why don't we take questions?"}, {"Time_Start": 2817.46, "Time_End": 2820.46, "Text": " Right here."}, {"Time_Start": 2820.46, "Time_End": 2821.46, "Text": " Oh wait?"}, {"Time_Start": 2821.46, "Time_End": 2821.94, "Text": " Mark?"}, {"Time_Start": 2828.7400000000002, "Time_End": 2831.38, "Text": " Is there a port for this, for Windows?"}, {"Time_Start": 2831.78, "Time_End": 2832.14, "Text": " Yes."}, {"Time_Start": 2832.34, "Time_End": 2832.54, "Text": " Okay."}, {"Time_Start": 2832.54, "Time_End": 2836.8, "Text": " Yeah, that was, there's a reference to it in the acknowledgments."}, {"Time_Start": 2838.26, "Time_End": 2841.6, "Text": " And it was written by one of the guys at Bindview with the Razor team."}, {"Time_Start": 2845.56, "Time_End": 2846.7, "Text": " I'm sorry, two up."}, {"Time_Start": 2847.7400000000002, "Time_End": 2850.64, "Text": " There's two implementations for BSTs."}, {"Time_Start": 2850.64, "Time_End": 2851.44, "Text": " There's two implementations for BST."}, {"Time_Start": 2851.46, "Time_End": 2860.46, "Text": " there aren't any yet for Linux, but if we use the same kernel abstraction"}, {"Time_Start": 2860.46, "Time_End": 2867.46, "Text": " for these modules, there's no reason we can't use the same implementations in Linux."}, {"Time_Start": 2867.46, "Time_End": 2875.46, "Text": " Windows, we don't have the opportunity to implement those interfaces at source level."}, {"Time_Start": 2875.46, "Time_End": 2880.46, "Text": " But the Windows, we don't have the interfaces at source level."}, {"Time_Start": 2880.46, "Time_End": 2881.46, "Text": " The Windows."}, {"Time_Start": 2881.46, "Time_End": 2886.46, "Text": " It plugs in at the same places, but it's got to muck with the kernel directly to hook in."}, {"Time_Start": 2886.46, "Time_End": 2888.46, "Text": " I mean, muck with the binary."}, {"Time_Start": 2888.46, "Time_End": 2895.46, "Text": " So T-Sabin with the Razor team at Bindview has a tool called SISTRace again."}, {"Time_Start": 2895.46, "Time_End": 2898.46, "Text": " I think the current version is 0.3."}, {"Time_Start": 2898.46, "Time_End": 2903.46, "Text": " So same name, but it's four windows and it's on Bindview's site."}, {"Time_Start": 2903.46, "Time_End": 2908.46, "Text": " And I believe it's more or less open source license."}, {"Time_Start": 2911.46, "Time_End": 2923.46, "Text": " I was going to ask you, in the next version of Windows in Longhorn, they have something called Next Generation Windows Protection Services,"}, {"Time_Start": 2923.46, "Time_End": 2927.46, "Text": " which is Palladium, which is actually exactly this."}, {"Time_Start": 2927.46, "Time_End": 2934.46, "Text": " Actually, Microsoft is trapping all API calls and generating rules for them based on whether they have,"}, {"Time_Start": 2934.46, "Time_End": 2939.46, "Text": " like a signature or something like that, unique processor ID or something of that nature."}, {"Time_Start": 2939.46, "Time_End": 2947.46, "Text": " But what happens when a version of the software changes and they change the API calls that they do?"}, {"Time_Start": 2947.46, "Time_End": 2951.46, "Text": " How does the BSD tools react to that? Do you have to regenerate all the rules?"}, {"Time_Start": 2951.46, "Time_End": 2965.46, "Text": " Um, if you're extremely paranoid, you probably would, because you'd want to close, reduce as much of the footprint as possible."}, {"Time_Start": 2965.46, "Time_End": 2966.46, "Text": " But with Windows..."}, {"Time_Start": 2966.46, "Time_End": 2969.46, "Text": " You know, in practice, I would imagine you would do,"}, {"Time_Start": 2969.46, "Time_End": 2974.46, "Text": " exactly what you do with a firewall. If you upgrade a client or a service,"}, {"Time_Start": 2974.46, "Time_End": 2981.46, "Text": " you continue applying the same rules and you catch any exceptions,"}, {"Time_Start": 2981.46, "Time_End": 2985.46, "Text": " decide on the per exception basis whether to add rules."}, {"Time_Start": 2985.46, "Time_End": 2991.46, "Text": " So with the Windows tool, does it plug into the NTdll.dll or does it sit above it?"}, {"Time_Start": 2991.46, "Time_End": 2996.46, "Text": " It, no, it plugs into system trap."}, {"Time_Start": 2996.46, "Time_End": 2997.46, "Text": " Okay."}, {"Time_Start": 2997.46, "Time_End": 3004.46, "Text": " Any more questions?"}, {"Time_Start": 3004.46, "Time_End": 3010.46, "Text": " No, the Microsoft research has detours library,"}, {"Time_Start": 3010.46, "Time_End": 3015.46, "Text": " which allows you to insert trampoline functions into CIS calls."}, {"Time_Start": 3015.46, "Time_End": 3016.46, "Text": " Cool."}, {"Time_Start": 3016.46, "Time_End": 3018.46, "Text": " For the system."}, {"Time_Start": 3018.46, "Time_End": 3026.46, "Text": " And the latest messaging vulnerabilities everybody's talking about, I think,"}, {"Time_Start": 3026.46, "Time_End": 3033.46, "Text": " about, I think one guy had a proof of concept using McAfee and how he could send, you know, this to this window and, you know,"}, {"Time_Start": 3033.46, "Time_End": 3037.46, "Text": " does this take care of that problem?"}, {"Time_Start": 3037.46, "Time_End": 3038.46, "Text": " Yeah, would let you make sense."}, {"Time_Start": 3038.46, "Time_End": 3044.46, "Text": " Um, a lot of the windowing is in the kernel and windows."}, {"Time_Start": 3044.46, "Time_End": 3048.46, "Text": " But that's not the case in Unix."}, {"Time_Start": 3048.46, "Time_End": 3054.46, "Text": " So imagine that would be very different, implemented very differently on Unix."}, {"Time_Start": 3054.46, "Time_End": 3061.46, "Text": " So maybe they're trying to fix it with this long horn implementation."}, {"Time_Start": 3061.46, "Time_End": 3077.46, "Text": " So I would imagine a lot of that would be on rather than assist call filtering and library call filtering for X Windows."}, {"Time_Start": 3077.46, "Time_End": 3082.46, "Text": " Any other questions?"}, {"Time_Start": 3082.46, "Time_End": 3083.46, "Text": " We're good."}, {"Time_Start": 3083.46, "Time_End": 3083.96, "Text": " All right."}, {"Time_Start": 3083.96, "Time_End": 3085.96, "Text": " have fun at the award ceremony."}]}