{"segments": [{"Time_Start": 0.0, "Time_End": 16.0, "Text": " We have sound."}, {"Time_Start": 16.0, "Time_End": 18.0, "Text": " I think we're ready to get out."}, {"Time_Start": 18.0, "Time_End": 29.0, "Text": " So discussion here, the titled presentation was the Internet's private cops, protecting your rights against corporate vigilantes."}, {"Time_Start": 29.0, "Time_End": 37.0, "Text": " And the concern, I'm Wendy Seltzer, a staff attorney with the Electronic Frontier Foundation, and..."}, {"Time_Start": 37.0, "Time_End": 44.24, "Text": " Thank you very much, thrilled to be here."}, {"Time_Start": 47.36, "Time_End": 58.980000000000004, "Text": " So our concern in this discussion is that you've heard a lot about, and we'll be hearing a lot about the public cops, the government, the,"}, {"Time_Start": 59.0, "Time_End": 67.28, "Text": " law enforcement and the steps that you should take to keep your activities safe from them."}, {"Time_Start": 67.78, "Time_End": 74.5, "Text": " And my concern in this presentation is to draw your attention to another set of threats to online activity,"}, {"Time_Start": 74.5, "Time_End": 82.0, "Text": " and that's the threats from the private law enforcement, the corporations and private actors"}, {"Time_Start": 82.0, "Time_End": 88.98, "Text": " who are also interested in stifling some of your online services."}, {"Time_Start": 89.0, "Time_End": 96.0, "Text": " speech in stopping some of your activities and whose activities and enforcement"}, {"Time_Start": 96.0, "Time_End": 102.0, "Text": " pose threats to the Internet itself because of the way they're trying to crack down"}, {"Time_Start": 102.0, "Time_End": 105.0, "Text": " on activities."}, {"Time_Start": 105.0, "Time_End": 112.66, "Text": " So the early view in the famous words of EFF co-founder John Gilmore, the Internet views"}, {"Time_Start": 112.66, "Time_End": 118.98, "Text": " censorship as damage and routes around it. The thought was that"}, {"Time_Start": 119.0, "Time_End": 123.7, "Text": " Hackers didn't need to worry about the law, because if the law stepped in in one place,"}, {"Time_Start": 124.04, "Time_End": 131.74, "Text": " the network would move in a different direction and would just evade the law enforcement."}, {"Time_Start": 133.2, "Time_End": 140.22, "Text": " Avoid the pressures of the East Coast Code with the West Coast Code."}, {"Time_Start": 140.36, "Time_End": 144.18, "Text": " Simply beat them by playing a different game."}, {"Time_Start": 146.22, "Time_End": 148.98, "Text": " The question that comes up is,"}, {"Time_Start": 149.0, "Time_End": 157.0, "Text": " though, as we see more and more pressure from Washington to change the law, pressure"}, {"Time_Start": 157.0, "Time_End": 164.0, "Text": " from companies to crack down on online activity, is will the law break the law break the"}, {"Time_Start": 164.0, "Time_End": 170.0, "Text": " internet before we manage to route around the bad law?"}, {"Time_Start": 170.0, "Time_End": 178.0, "Text": " Because even without understanding the technology, we find lawyers and regulators attempting"}, {"Time_Start": 178.0, "Time_End": 179.0, "Text": " to regulate it."}, {"Time_Start": 179.0, "Time_End": 184.9, "Text": " And they're dangerous because they don't understand the technology, because they regulate to demand the impossible,"}, {"Time_Start": 185.44, "Time_End": 192.8, "Text": " trying to impose, require, for example, that we put watermark detectors into every analog-to-digital converter"}, {"Time_Start": 192.8, "Time_End": 200.48, "Text": " to stop the threat of digital copyrighted material, possibly leaking out onto the Internet."}, {"Time_Start": 201.24, "Time_End": 208.84, "Text": " And if they regulate to demand the impossible, then everybody becomes a lawbreaker and everybody becomes"}, {"Time_Start": 208.84, "Time_End": 210.12, "Text": " a potential target."}, {"Time_Start": 210.72, "Time_End": 215.6, "Text": " So our goal is to understand the law and the technology."}, {"Time_Start": 216.18, "Time_End": 222.54, "Text": " If the regulators won't understand the tech, then the technologists have to understand the law"}, {"Time_Start": 222.54, "Time_End": 229.68, "Text": " and how to work with it in order to change it and in order to protect yourself from the legal"}, {"Time_Start": 229.68, "Time_End": 230.24, "Text": " threats."}, {"Time_Start": 230.98000000000002, "Time_End": 238.38, "Text": " So, a case that many of you may be aware of in this private enforcement context,"}, {"Time_Start": 238.84, "Time_End": 241.24, "Text": " is the RIA versus Verizon."}, {"Time_Start": 241.9, "Time_End": 247.92000000000002, "Text": " And funny to be saying to this crowd that we're on Verizon's side in this matter,"}, {"Time_Start": 248.04, "Time_End": 256.5, "Text": " but the Recording Industry Association of America went to court and got the clerk's stamp"}, {"Time_Start": 256.5, "Time_End": 262.74, "Text": " on some subpoenas demanding the identity from some alleged file shares on Kazah."}, {"Time_Start": 263.48, "Time_End": 268.12, "Text": " Verizon standing up for its user's privacy and anonymity rights."}, {"Time_Start": 268.84000000000003, "Time_End": 271.48, "Text": " in their online activity, withheld the names,"}, {"Time_Start": 271.96000000000004, "Time_End": 274.84000000000003, "Text": " and went to court with a motion to quash the subpoena,"}, {"Time_Start": 275.54, "Time_End": 280.26000000000005, "Text": " saying it had a right to keep its subscriber records private,"}, {"Time_Start": 280.38000000000005, "Time_End": 285.34000000000003, "Text": " and its subscribers, more importantly, had a right to keep their activities safe"}, {"Time_Start": 285.34000000000003, "Time_End": 287.70000000000005, "Text": " from the prying of the recording industry."}, {"Time_Start": 288.52000000000004, "Time_End": 294.70000000000005, "Text": " The D.C. District Court ordered them to reveal the names,"}, {"Time_Start": 295.32000000000005, "Time_End": 297.58000000000004, "Text": " and although that decision is currently on appeal, the appeals court,"}, {"Time_Start": 298.00000000000006, "Time_End": 298.82000000000005, "Text": " the appeals court."}, {"Time_Start": 298.84000000000003, "Time_End": 304.34000000000003, "Text": " also ordered Verizon to turn over the names even before the appeal was heard."}, {"Time_Start": 305.00000000000006, "Time_End": 317.58000000000004, "Text": " So we've now, since then we've seen a spate of subpoenas from the recording industry to tens of ISPs"}, {"Time_Start": 317.58000000000004, "Time_End": 323.98, "Text": " and hundreds for the identities of hundreds of additional users, and the recording industry"}, {"Time_Start": 323.98, "Time_End": 328.08000000000004, "Text": " tells us they're sending these things out at a rate of about 75 a day,"}, {"Time_Start": 328.08, "Time_End": 332.12, "Text": " demanding identities of individual users."}, {"Time_Start": 332.46, "Time_End": 337.56, "Text": " And later on this evening, at 6 o'clock in the Apollo room, EFF,"}, {"Time_Start": 337.56, "Time_End": 344.34, "Text": " a group of us going to have a session specifically on this RIA versus the people"}, {"Time_Start": 344.34, "Time_End": 350.26, "Text": " tried to discuss this onslaught on individuals and on file sharing."}, {"Time_Start": 350.36, "Time_End": 351.65999999999997, "Text": " Sure, do you have a question right now?"}, {"Time_Start": 351.65999999999997, "Time_End": 357.62, "Text": " I have the precedent known this, that ISPs were not responsible by the content traveling on their networks."}, {"Time_Start": 358.08, "Time_End": 368.3, "Text": " Yes, very much the ISPs have taken the position that they are just neutral intermediaries"}, {"Time_Start": 368.3, "Time_End": 372.94, "Text": " and not responsible for what their users are posting."}, {"Time_Start": 372.94, "Time_End": 378.79999999999995, "Text": " And then they have a safe harbor written into the law as part of the Digital Millennium"}, {"Time_Start": 378.79999999999995, "Time_End": 385.71999999999997, "Text": " Copyright Act that says that they're not responsible for the content their users are"}, {"Time_Start": 385.72, "Time_End": 391.42, "Text": " posting or transmitting via the network."}, {"Time_Start": 391.42, "Time_End": 399.66, "Text": " But another part of that safe harbor contains this subpoena provision, and one of the challenges"}, {"Time_Start": 399.66, "Time_End": 407.24, "Text": " right now is whether it's even constitutional to allow the recording industry to"}, {"Time_Start": 407.24, "Time_End": 413.26000000000005, "Text": " subpoena information from ISPs without any pending lawsuits."}, {"Time_Start": 413.74, "Time_End": 415.54, "Text": " But here the recording industry was saying, but here the recording industry was"}, {"Time_Start": 415.54, "Time_End": 420.44, "Text": " saying we're not trying to hold Verizon liable, but we need to go through Verizon and"}, {"Time_Start": 420.44, "Time_End": 424.88, "Text": " the other ISPs to get to the end users' information."}, {"Time_Start": 426.68, "Time_End": 434.26, "Text": " So part of the story behind this case is that the peer-to-peer services were initially thought"}, {"Time_Start": 434.26, "Time_End": 435.74, "Text": " to be unstoppable."}, {"Time_Start": 436.38, "Time_End": 442.46000000000004, "Text": " Napster went down, but then people thought, well, that was because they had a centralized"}, {"Time_Start": 442.46000000000004, "Time_End": 443.1, "Text": " server."}, {"Time_Start": 443.26, "Time_End": 445.3, "Text": " Napster itself was the target, and"}, {"Time_Start": 445.54, "Time_End": 452.28000000000003, "Text": " Once Kazah and Grokster and other networks came up with decentralized services,"}, {"Time_Start": 452.70000000000005, "Time_End": 462.94, "Text": " then it would be harder to go after them and this file sharing, this network activity would always be free."}, {"Time_Start": 462.94, "Time_End": 475.52000000000004, "Text": " And EFF recently won in the Central District of California on behalf of Grokster arguing that the newer peer-to-peer file share,"}, {"Time_Start": 475.54, "Time_End": 481.1, "Text": " services software manufacturers should not be liable for the content that their users"}, {"Time_Start": 481.1, "Time_End": 490.18, "Text": " were posting. That because the peer-to-peer software was decentralized and available for use"}, {"Time_Start": 490.18, "Time_End": 499.70000000000005, "Text": " in all sorts of ways that Grokster and the peer-to-peer software manufacturer shouldn't be"}, {"Time_Start": 499.70000000000005, "Time_End": 505.18, "Text": " liable for their users' activities, but that doesn't"}, {"Time_Start": 505.54, "Time_End": 512.22, "Text": " solve the problem because the recording industry says, fine, we can't go after the software companies."}, {"Time_Start": 512.46, "Time_End": 518.86, "Text": " We'll find other targets. We'll find the ISPs and we'll find through them the end users."}, {"Time_Start": 519.78, "Time_End": 527.66, "Text": " So we've got law enforcement is not just the government, but law enforcement is also the private companies"}, {"Time_Start": 527.66, "Time_End": 535.0600000000001, "Text": " who are able to use the mechanisms of government, namely the courts, to enforce the laws"}, {"Time_Start": 535.0600000000001, "Time_End": 542.94, "Text": " that they say protect them. And the government is then called in as a backup when the corporations"}, {"Time_Start": 542.94, "Time_End": 546.7800000000001, "Text": " go to court demanding enforcement of their legal rights."}, {"Time_Start": 549.1800000000001, "Time_End": 559.1200000000001, "Text": " And the Internet architectures facilitate this control, even amid the decentralization, there are"}, {"Time_Start": 559.1200000000001, "Time_End": 565.0400000000001, "Text": " still choke points. There are still Internet service providers and backbone providers and domain names"}, {"Time_Start": 565.0600000000001, "Time_End": 572.2800000000001, "Text": " service and places in the network that can be targeted. Even if you are speaking,"}, {"Time_Start": 572.48, "Time_End": 578.98, "Text": " even if you're participating in what looks like a private forum, all of the connections are"}, {"Time_Start": 578.98, "Time_End": 586.6400000000001, "Text": " through private networks. The servers are private, and there are lots of different places in this"}, {"Time_Start": 586.6400000000001, "Time_End": 594.6400000000001, "Text": " network that can be targeted. So we see that while the Internet, you know, we see that while the Internet"}, {"Time_Start": 594.64, "Time_End": 602.6999999999999, "Text": " enables more people to publish. It also enables more people and corporations"}, {"Time_Start": 602.6999999999999, "Time_End": 610.54, "Text": " to monitor that speech. The bots and enforcement mechanisms that the recording"}, {"Time_Start": 610.54, "Time_End": 615.34, "Text": " industry uses to search out songs. Now, these are on the public network. This is using"}, {"Time_Start": 615.34, "Time_End": 621.02, "Text": " the peer-to-peer networks, the recording industry argues, as they were designed to be used."}, {"Time_Start": 621.02, "Time_End": 624.62, "Text": " Similarly, corporate copyright holders and trademark"}, {"Time_Start": 624.64, "Time_End": 630.08, "Text": " holders send out search bots that are accessing public websites in the same manner"}, {"Time_Start": 630.08, "Time_End": 635.54, "Text": " that a visitor is accessing those websites and in the same manner that a browser whom you would"}, {"Time_Start": 635.54, "Time_End": 642.1999999999999, "Text": " invite in would be accessing them, but they're specifically on the lookout for their"}, {"Time_Start": 642.1999999999999, "Time_End": 649.7, "Text": " copyrighted material, their trademarks, and when they see those, they come back with legal"}, {"Time_Start": 649.7, "Time_End": 653.58, "Text": " claims. They claim that because your work is inspired by"}, {"Time_Start": 653.58, "Time_End": 658.86, "Text": " something that they have a copyright in, that it's a copyright infringement."}, {"Time_Start": 659.1600000000001, "Time_End": 664.3000000000001, "Text": " Or if you've developed the technology that interoperates with a proprietary protocol,"}, {"Time_Start": 664.3000000000001, "Time_End": 669.72, "Text": " they may claim that you're circumventing technological protection measures and falling foul"}, {"Time_Start": 669.72, "Time_End": 674.5600000000001, "Text": " of the Digital Millennium Copyright Act's anti-circumvention provisions."}, {"Time_Start": 674.5600000000001, "Time_End": 682.4000000000001, "Text": " We were hearing earlier about ways, creative ways to record streaming media,"}, {"Time_Start": 683.58, "Time_End": 692.88, "Text": " We've seen lawsuits where street media players that can mimic the so-called secret"}, {"Time_Start": 692.88, "Time_End": 700.98, "Text": " handshake of a real audio player, been sued for circumventing technological measures"}, {"Time_Start": 700.98, "Time_End": 707.58, "Text": " protecting, claimed to protect the copyrighted material that's being streamed."}, {"Time_Start": 707.58, "Time_End": 713.1400000000001, "Text": " And because of the way the safe harbor works in the DMC,"}, {"Time_Start": 713.14, "Time_End": 725.92, "Text": " MCA. When an ISP gets a takedown request, its strong incentive is to take down the material"}, {"Time_Start": 725.92, "Time_End": 731.52, "Text": " that's claimed to be infringing a copyright, even if there's no copyright infringement."}, {"Time_Start": 731.52, "Time_End": 738.58, "Text": " And although you as a user, if you've posted something, have a right to file a counter-notification,"}, {"Time_Start": 738.58, "Time_End": 746.96, "Text": " we often see that the process ends with a takedown notice to an ISP."}, {"Time_Start": 747.9200000000001, "Time_End": 753.1, "Text": " The material goes down, and there's never a judicial determination,"}, {"Time_Start": 753.6, "Time_End": 756.82, "Text": " whether there's been a violation of copyright or not."}, {"Time_Start": 758.0400000000001, "Time_End": 765.9200000000001, "Text": " We also see claims of trademark infringement because you may be commenting on or criticizing a company's product."}, {"Time_Start": 765.9200000000001, "Time_End": 774.7600000000001, "Text": " parodying their logo, they may claim that that infringes their trademarks."}, {"Time_Start": 775.2600000000001, "Time_End": 782.44, "Text": " We see claims of trade secret misappropriation frequently from companies claiming that employees"}, {"Time_Start": 782.44, "Time_End": 787.7600000000001, "Text": " have stolen their material and posted it on bulletin boards or disgruntled employees are"}, {"Time_Start": 789.82, "Time_End": 795.1600000000001, "Text": " misappropriating trade secrets or trying to give out inside information."}, {"Time_Start": 795.16, "Time_End": 805.3399999999999, "Text": " We see all sorts of legal claims, and the tools that lawyers use in these cases are a fairly basic set."}, {"Time_Start": 805.3399999999999, "Time_End": 816.6, "Text": " They start out with the cease and desist letter, a nasty gram on fancy letterhead claiming that you've done something that violates the law."}, {"Time_Start": 817.02, "Time_End": 824.88, "Text": " If you don't respond within some very short period of time, 10 days, then we will pursue all."}, {"Time_Start": 825.16, "Time_End": 826.76, "Text": " available legal remedies."}, {"Time_Start": 827.68, "Time_End": 834.42, "Text": " And they'll often spell out in great detail all of the injunctions and statutory damages that they'll seek."}, {"Time_Start": 835.42, "Time_End": 846.3, "Text": " Often these things overstate the law, but it's often a cheap way to get material taken down from the net."}, {"Time_Start": 847.98, "Time_End": 854.62, "Text": " Subpoena is a step up from the cease and desist letter that the lawyer, the lawyer, as officer of the court,"}, {"Time_Start": 855.16, "Time_End": 863.76, "Text": " It still doesn't have to get a judge's signature on the subpoena, but does have to bring a few forms to the court clerk,"}, {"Time_Start": 864.4399999999999, "Time_End": 874.1999999999999, "Text": " get those things stamped and issued from the court, and those are a formal demand from the court to turn over information."}, {"Time_Start": 874.8199999999999, "Time_End": 884.02, "Text": " Going further, they can file a lawsuit, file a complaint, and things get a bit more expensive for both sides."}, {"Time_Start": 885.16, "Time_End": 887.8399999999999, "Text": " at that point."}, {"Time_Start": 888.8399999999999, "Time_End": 898.1, "Text": " But a lawsuit gives further range of private investigation through various discovery mechanisms."}, {"Time_Start": 899.02, "Time_End": 906.78, "Text": " And finally, private corporations can work in cooperation with federal and state prosecutors."}, {"Time_Start": 906.78, "Time_End": 911.9, "Text": " If they see something that appears to be a criminal violation, they can see something that appears to be a criminal"}, {"Time_Start": 911.9, "Time_End": 922.54, "Text": " a violation they can suggest to a district attorney or federal agent that this looks"}, {"Time_Start": 922.54, "Time_End": 925.92, "Text": " like a case ripe for prosecution."}, {"Time_Start": 927.34, "Time_End": 928.22, "Text": " Well, there."}, {"Time_Start": 930.62, "Time_End": 936.54, "Text": " So, how can we respond?"}, {"Time_Start": 936.54, "Time_End": 941.88, "Text": " Well, the Chilling Effects Project, which is a..."}, {"Time_Start": 941.9, "Time_End": 950.8, "Text": " joint effort of Electronic Frontier Foundation and several law school clinics around the country, Harvard, Stanford, Berkeley."}, {"Time_Start": 950.8, "Time_End": 959.36, "Text": " It's working to combat the chill that comes from these legal effects that over, legal threats that overstate the case,"}, {"Time_Start": 959.9, "Time_End": 971.88, "Text": " trying to help people to understand their legal rights and so that they're not deterred merely by the language in some of these cease and"}, {"Time_Start": 971.9, "Time_End": 979.14, "Text": " And so chilling effects, chilling effects.org invites people to submit their"}, {"Time_Start": 979.14, "Time_End": 988.86, "Text": " cease and desist letters to the chilling effects project and have them analyzed, the law students"}, {"Time_Start": 988.86, "Time_End": 995.4599999999999, "Text": " at our various clinics we work with, will analyze the cease and desist letters and pull out key"}, {"Time_Start": 995.4599999999999, "Time_End": 1001.8, "Text": " phrases from the letters and link those to explanations."}, {"Time_Start": 1001.9, "Time_End": 1007.9, "Text": " of the law. So somebody who's made a claim of copyright will get a link to explaining"}, {"Time_Start": 1007.9, "Time_End": 1014.8199999999999, "Text": " what copyright protects, and then again to the defenses to a claim of copyright infringement,"}, {"Time_Start": 1014.8199999999999, "Time_End": 1024.92, "Text": " the fair use exceptions, and the kinds of activity that might constitute fair use rather than"}, {"Time_Start": 1024.92, "Time_End": 1031.8799999999999, "Text": " copyright infringement to help the recipients understand that although some lawyer is claiming that there's"}, {"Time_Start": 1031.9, "Time_End": 1036.0, "Text": " copyright infringement going on, that's not necessarily the case."}, {"Time_Start": 1037.3000000000002, "Time_End": 1040.8400000000001, "Text": " So we had the story of Davezilla.com."}, {"Time_Start": 1041.2800000000002, "Time_End": 1043.76, "Text": " Who's going to come sue over this?"}, {"Time_Start": 1044.18, "Time_End": 1048.96, "Text": " Well, the owners of Godzilla, Japanese company, Toho."}, {"Time_Start": 1050.2800000000002, "Time_End": 1053.74, "Text": " Unfortunately, they're not so good with the Internet, and this is the page that you get to"}, {"Time_Start": 1053.74, "Time_End": 1059.14, "Text": " when you search for Godzilla, but nonetheless, they thought that this Davezilla page was a threat"}, {"Time_Start": 1059.14, "Time_End": 1060.4, "Text": " to their online brand."}, {"Time_Start": 1061.9, "Time_End": 1069.7800000000002, "Text": " sent a C-Sy-sindicist letter claiming that that little dragon was an infringement of their trademark,"}, {"Time_Start": 1070.3200000000002, "Time_End": 1075.0, "Text": " demanding that you removed the objectionable imagery in reference to Godzilla from your website."}, {"Time_Start": 1075.24, "Time_End": 1077.5, "Text": " To eliminate any likelihood of confusion."}, {"Time_Start": 1077.66, "Time_End": 1082.96, "Text": " Now, likelihood of confusion is the key test for trademark infringement, and if you look at that little dragon,"}, {"Time_Start": 1083.3400000000001, "Time_End": 1091.48, "Text": " there's not a whole lot of likelihood of confusion with Godzilla, but that's the claim."}, {"Time_Start": 1091.9, "Time_End": 1096.6200000000001, "Text": " what can you do? You get one of these? Well, one thing, submit the letter to"}, {"Time_Start": 1096.6200000000001, "Time_End": 1103.66, "Text": " chilling effects, and then think about how you know how to use the internet far better than some of the"}, {"Time_Start": 1103.66, "Time_End": 1109.6000000000001, "Text": " companies who are sending these threats. So in response to this claim that God, that"}, {"Time_Start": 1109.6000000000001, "Time_End": 1116.5800000000002, "Text": " Dave Zilla confuses consumers in the public, we see a quiz that asks, is it Godzilla? Can you figure out"}, {"Time_Start": 1116.58, "Time_End": 1123.6799999999998, "Text": " Whether these things are Godzilla."}, {"Time_Start": 1123.6799999999998, "Time_End": 1132.6799999999998, "Text": " And all sorts of free Dave Zilla, everybody became the Quizilla and the Zilla and the Zilla liberation front."}, {"Time_Start": 1133.3799999999999, "Time_End": 1141.3799999999999, "Text": " And we didn't hear very much more from Toho, their nasty Graham, notwithstanding,"}, {"Time_Start": 1141.84, "Time_End": 1146.36, "Text": " Dave Zilla is still there, and the Dragon logo remains."}, {"Time_Start": 1146.58, "Time_End": 1152.96, "Text": " What else do we see?"}, {"Time_Start": 1153.02, "Time_End": 1161.48, "Text": " We see Sony claiming about their Ibo that somebody who called himself IBOPET and developed"}, {"Time_Start": 1161.48, "Time_End": 1169.6799999999998, "Text": " electronic dances for the Ibo was circumventing the copyright protection mechanisms that Sony"}, {"Time_Start": 1169.6799999999998, "Time_End": 1175.82, "Text": " had put in place on this $2,000 robot's memory stick."}, {"Time_Start": 1176.58, "Time_End": 1183.1799999999998, "Text": " And he got a cease and desist letter, demanding that he removed the programs,"}, {"Time_Start": 1183.8799999999999, "Time_End": 1186.12, "Text": " stop teaching his dog new tricks."}, {"Time_Start": 1190.06, "Time_End": 1198.6399999999999, "Text": " claimed unauthorized distribution of copyrighted software, circumventing the copywriting protection."}, {"Time_Start": 1200.08, "Time_End": 1202.82, "Text": " And so, he submitted to chilling effects."}, {"Time_Start": 1203.56, "Time_End": 1205.78, "Text": " This is our submission form."}, {"Time_Start": 1206.58, "Time_End": 1217.4399999999998, "Text": " get a little explanation of what circumvention is and how, unfortunately, the anti-circumvention"}, {"Time_Start": 1217.4399999999998, "Time_End": 1223.1799999999998, "Text": " law is a pretty steep barrier to reverse engineering, and although it's supposed to have an"}, {"Time_Start": 1223.1799999999998, "Time_End": 1231.1399999999999, "Text": " exception for reverse engineering for interoperability, that hasn't worked out so well in practice,"}, {"Time_Start": 1231.26, "Time_End": 1236.1799999999998, "Text": " it hasn't given people protection from these kinds of threats, and the threats of, the threats of"}, {"Time_Start": 1236.18, "Time_End": 1252.26, "Text": " lawsuit can be rather frightening. But here to an internet protest, a show of support for this kind of"}, {"Time_Start": 1252.26, "Time_End": 1259.38, "Text": " creative programming was enough to get Sony to turn around and realize that, you know, in order"}, {"Time_Start": 1259.38, "Time_End": 1266.16, "Text": " to use these programs at all, somebody's got to buy a $2,000 piece of hardware from Sony, it's hard"}, {"Time_Start": 1266.18, "Time_End": 1274.5600000000002, "Text": " to see how this circumvention is really harming Sony's market. And swayed by that, Sony"}, {"Time_Start": 1274.5600000000002, "Time_End": 1282.4, "Text": " allowed IBOPET to put up slightly modified software that made them a little bit more comfortable"}, {"Time_Start": 1282.4, "Time_End": 1289.02, "Text": " that it wasn't threatening their intellectual property, but still let people do creative"}, {"Time_Start": 1289.02, "Time_End": 1295.94, "Text": " things with their hardware. So we've got the legit IMUT program that's now online."}, {"Time_Start": 1296.18, "Time_End": 1308.6200000000001, "Text": " And now available, meanwhile, Ibo is going to law school to learn to read the end user license agreements."}, {"Time_Start": 1309.72, "Time_End": 1318.46, "Text": " And there now, all sorts of other, all sorts of people who might think to sue over these pages,"}, {"Time_Start": 1318.46, "Time_End": 1325.8400000000001, "Text": " but have wisely decided so far, at least, that it's not harming them, and they'll let it go."}, {"Time_Start": 1326.18, "Time_End": 1334.8200000000002, "Text": " Meanwhile, the American Kennel Club inexplicably decided that the IBO Kennel Club was infringing their mark."}, {"Time_Start": 1334.8200000000002, "Time_End": 1342.9, "Text": " And moreover, it ensures a known lineage for your Ibo, but the robots do not produce offspring, so there is no lineage to record."}, {"Time_Start": 1345.94, "Time_End": 1349.46, "Text": " Corporations with no sense of humor don't get very far on the web."}, {"Time_Start": 1352.18, "Time_End": 1355.74, "Text": " And Ibo Kennel Club still seems to be around as well."}, {"Time_Start": 1356.18, "Time_End": 1363.18, "Text": " Finally, one last example from the Chilling Effect site."}, {"Time_Start": 1363.18, "Time_End": 1372.18, "Text": " Another step we've been able to take is in conjunction with Google, which as a search engine,"}, {"Time_Start": 1372.18, "Time_End": 1376.18, "Text": " gets a lot of DMCA takedown requests."}, {"Time_Start": 1376.18, "Time_End": 1383.18, "Text": " These are claims that by linking to pages that infringe copyright through its search engine,"}, {"Time_Start": 1383.18, "Time_End": 1387.8400000000001, "Text": " Google is contributing to the copyright infringement."}, {"Time_Start": 1387.8400000000001, "Time_End": 1398.3, "Text": " And because the DMCA spells out an exception or a category in its safe harbor for information location tools"}, {"Time_Start": 1398.3, "Time_End": 1405.44, "Text": " and describes the safe harbor that they can seek if they remove the links from their search engine,"}, {"Time_Start": 1406.3, "Time_End": 1413.16, "Text": " leaving open the possibility that they could at least be sued for a contributory infringement."}, {"Time_Start": 1413.18, "Time_End": 1416.18, "Text": " if they refused to take those links out."}, {"Time_Start": 1416.18, "Time_End": 1424.18, "Text": " Google thought it was safer when demanded to remove the links from its search engine."}, {"Time_Start": 1424.18, "Time_End": 1433.18, "Text": " So our friend, the Scientologists were among the first to use DMCA take down notices this way."}, {"Time_Start": 1433.18, "Time_End": 1438.18, "Text": " They found Operation Clambake, a site that they've never particularly liked,"}, {"Time_Start": 1438.18, "Time_End": 1443.18, "Text": " that's critical of Scientology, that reposts pieces of the Scientology,"}, {"Time_Start": 1443.18, "Time_End": 1450.18, "Text": " doctrines in the context of criticizing Scientology and explaining problems they see."}, {"Time_Start": 1455.18, "Time_End": 1465.18, "Text": " So Scientology sent Google a series of DMCA takedown notices demanding that Google remove links"}, {"Time_Start": 1465.18, "Time_End": 1468.18, "Text": " from its search engine results."}, {"Time_Start": 1468.18, "Time_End": 1472.18, "Text": " Well, rather than remove them silently, leave them silently,"}, {"Time_Start": 1472.18, "Time_End": 1476.18, "Text": " leave people wondering what's happened to the criticism."}, {"Time_Start": 1476.18, "Time_End": 1480.18, "Text": " Has Scientology triumphed over all its critics?"}, {"Time_Start": 1480.18, "Time_End": 1486.18, "Text": " Google decided it needed, it wanted to take advantage of the safe harbor."}, {"Time_Start": 1486.18, "Time_End": 1493.18, "Text": " It wanted to get this protection from possible liability by removing the links,"}, {"Time_Start": 1493.18, "Time_End": 1496.18, "Text": " but it didn't want them to disappear completely,"}, {"Time_Start": 1496.18, "Time_End": 1501.18, "Text": " so it added this link at the bottom of a search page that links over to chilling effects."}, {"Time_Start": 1501.18, "Time_End": 1509.18, "Text": " killing effects and both explains the DMCA policy and gives a link to the DMCA complaint."}, {"Time_Start": 1509.18, "Time_End": 1515.18, "Text": " And if you click on that link, at the bottom of the search results,"}, {"Time_Start": 1515.18, "Time_End": 1521.18, "Text": " you head over to chilling effects where you see the demand that Google remove search results."}, {"Time_Start": 1521.18, "Time_End": 1526.18, "Text": " You see why it is that Google's results can't be complete."}, {"Time_Start": 1526.18, "Time_End": 1531.16, "Text": " And on the attached chart, you see the listing"}, {"Time_Start": 1531.18, "Time_End": 1534.18, "Text": " of those search results that Google was asked to remove."}, {"Time_Start": 1538.18, "Time_End": 1545.18, "Text": " Well, with a few extra steps, you can still find them."}, {"Time_Start": 1545.18, "Time_End": 1558.18, "Text": " And so we hope that this gives people a way to understand what's happening"}, {"Time_Start": 1558.18, "Time_End": 1560.18, "Text": " with the DMCA and a way to understand what's happening with the DMCA and a way to understand that this gives people,"}, {"Time_Start": 1560.18, "Time_End": 1564.18, "Text": " and a way to express frustration."}, {"Time_Start": 1564.18, "Time_End": 1569.18, "Text": " If you think that Google's results are less useful because they're forced to remove"}, {"Time_Start": 1569.18, "Time_End": 1575.18, "Text": " results on a mere claim that the material is infringing,"}, {"Time_Start": 1575.18, "Time_End": 1579.18, "Text": " the complaint shouldn't be with Google, the complaint should be with Congress,"}, {"Time_Start": 1579.18, "Time_End": 1584.18, "Text": " with your lawmakers who have seen fit to enact this provision into law"}, {"Time_Start": 1584.18, "Time_End": 1590.16, "Text": " law that makes Google think that their only reasonable response is to remove"}, {"Time_Start": 1590.18, "Time_End": 1593.18, "Text": " links from their search index."}, {"Time_Start": 1593.18, "Time_End": 1597.18, "Text": " So resisting the jail, legal threats, as we've seen,"}, {"Time_Start": 1597.18, "Time_End": 1603.18, "Text": " are often used against obnoxious but not illegal activities."}, {"Time_Start": 1603.18, "Time_End": 1607.18, "Text": " Corporations think often rightly that"}, {"Time_Start": 1607.18, "Time_End": 1613.18, "Text": " paying their lawyers for an hour or so of sending off a nasty gram on fancy letterhead"}, {"Time_Start": 1613.18, "Time_End": 1619.18, "Text": " will get down 90% of what's bothering them, and if they don't go after the 10%"}, {"Time_Start": 1619.18, "Time_End": 1623.18, "Text": " to the 10% that stay up, that's still good enough."}, {"Time_Start": 1623.18, "Time_End": 1629.18, "Text": " But in order to resist the chill, helps both to know the law."}, {"Time_Start": 1629.18, "Time_End": 1632.18, "Text": " And as part of the chilling effect site,"}, {"Time_Start": 1632.18, "Time_End": 1638.18, "Text": " we've got background and frequently asked questions in the various subject areas,"}, {"Time_Start": 1638.18, "Time_End": 1641.18, "Text": " trademark, copyright, patent law, defamation,"}, {"Time_Start": 1641.18, "Time_End": 1645.18, "Text": " some of the legality questions around linking,"}, {"Time_Start": 1645.18, "Time_End": 1648.18, "Text": " and invite you if you"}, {"Time_Start": 1648.18, "Time_End": 1655.18, "Text": " if you get a cease and desist letter or have questions about the law, come see what"}, {"Time_Start": 1655.18, "Time_End": 1664.18, "Text": " the general background information is, and submit the letter to chilling effects."}, {"Time_Start": 1664.18, "Time_End": 1668.18, "Text": " And think about this fighting back out of band."}, {"Time_Start": 1668.18, "Time_End": 1672.18, "Text": " Corporations know their legal remedies,"}, {"Time_Start": 1672.18, "Time_End": 1678.18, "Text": " but they don't necessarily stop to think about the bad publicity that they can get for making"}, {"Time_Start": 1678.18, "Time_End": 1687.18, "Text": " silly legal claims, and chilling effects helps to expose that, and you who are doing things on the web and on the net"}, {"Time_Start": 1687.18, "Time_End": 1694.18, "Text": " can also help to expose the silliness that people are invoking in the name of the law."}, {"Time_Start": 1694.18, "Time_End": 1703.18, "Text": " And finally, when the law itself is broken, we need people to become activists and work to fix the law."}, {"Time_Start": 1703.18, "Time_End": 1707.98, "Text": " If copyright law is truly criminalizing the activities of millions of people,"}, {"Time_Start": 1708.18, "Time_End": 1714.18, "Text": " it's time for those millions of us to go to Congress and demand that"}, {"Time_Start": 1714.18, "Time_End": 1720.18, "Text": " we get a more sensible copyright law that allows us to do the things that we like."}, {"Time_Start": 1720.18, "Time_End": 1726.18, "Text": " So, of course, EFF has resources on these issues."}, {"Time_Start": 1726.18, "Time_End": 1731.18, "Text": " Chilling Effects has some resources."}, {"Time_Start": 1731.18, "Time_End": 1737.18, "Text": " And I always like to close with this."}, {"Time_Start": 1737.18, "Time_End": 1744.18, "Text": " Judge Kaczynski in the Ninth Circuit in a case brought by Mattel against Aqua"}, {"Time_Start": 1744.18, "Time_End": 1752.18, "Text": " for the song Barbie Girl, closed by concluding that Barbie Girl was not an infringement of Mattel's trademarks"}, {"Time_Start": 1752.18, "Time_End": 1756.18, "Text": " and the parties are advised to chill."}, {"Time_Start": 1756.18, "Time_End": 1764.18, "Text": " And of course, as chilling effects, we advise you not to be chilled at the same time."}, {"Time_Start": 1767.18, "Time_End": 1777.18, "Text": " So I'm happy to take questions."}, {"Time_Start": 1777.18, "Time_End": 1779.18, "Text": " Sure."}, {"Time_Start": 1779.18, "Time_End": 1791.18, "Text": " Does the effect have any information regarding the investigation by the central forums in Congress regarding RRA, RIA's subpoenas against ICE, please?"}, {"Time_Start": 1791.18, "Time_End": 1796.18, "Text": " Senator Coleman has just announced."}, {"Time_Start": 1796.18, "Time_End": 1802.18, "Text": " announced that he's interested in doing some investigation into the RIA subpoenas,"}, {"Time_Start": 1802.18, "Time_End": 1809.18, "Text": " and we strongly support that investigation and will be very interested and hopeful that"}, {"Time_Start": 1809.18, "Time_End": 1814.18, "Text": " he will be able to get more information out of the recording industry than the public has so far"}, {"Time_Start": 1814.18, "Time_End": 1823.18, "Text": " about what they're doing and what they're trying to achieve by subpoenaing 75 people a day."}, {"Time_Start": 1826.18, "Time_End": 1832.0800000000002, "Text": " What is any remedies you have for nasty grounds that don't carry much to the way?"}, {"Time_Start": 1832.0800000000002, "Time_End": 1837.3400000000001, "Text": " But suppose you are sued and you would, can you counter suit?"}, {"Time_Start": 1837.3400000000001, "Time_End": 1840.74, "Text": " You have a little bit as for a professor at Penn State."}, {"Time_Start": 1840.74, "Time_End": 1844.6200000000001, "Text": " That's absolutely definitely not your problem."}, {"Time_Start": 1846.48, "Time_End": 1855.24, "Text": " That's one of the real challenges in this area that the defendants that the defendants in a lawsuit don't have."}, {"Time_Start": 1855.24, "Time_End": 1861.54, "Text": " in the American system often don't have great remedies against the other side."}, {"Time_Start": 1861.54, "Time_End": 1868.64, "Text": " In a copyright suit, the successful defendant can win costs and attorneys' fees from the other side."}, {"Time_Start": 1868.64, "Time_End": 1881.84, "Text": " Otherwise, and particularly if it's non-commercial activity, it's hard to counter sue with some of the traditional interference with business relations or interference with contract."}, {"Time_Start": 1881.8400000000001, "Time_End": 1889.6000000000001, "Text": " It's hard to get money back for the harassment that these things are causing."}, {"Time_Start": 1889.6000000000001, "Time_End": 1902.7800000000002, "Text": " Another piece of our aim with this project is to get some creative thinking going about what we need to bring these laws back into balance."}, {"Time_Start": 1911.8400000000001, "Time_End": 1919.8400000000001, "Text": " Do you talk us more about exactly what the process is for these RIA subpoenas as far as they don't require a judge's signature?"}, {"Time_Start": 1919.8400000000001, "Time_End": 1923.8400000000001, "Text": " What exactly do they require to actually file these from the eyes mean?"}, {"Time_Start": 1923.8400000000001, "Time_End": 1933.8400000000001, "Text": " Well, we're going to get into that in more detail later this evening, but in short, they require a good faith allegation of copyright infringement."}, {"Time_Start": 1941.8400000000001, "Time_End": 1948.8400000000001, "Text": " The only information is that there's a file of certain names on this case."}, {"Time_Start": 1948.8400000000001, "Time_End": 1957.8400000000001, "Text": " I have a good faith allegation based on your subject clause of perjury or this person was violated copyright."}, {"Time_Start": 1957.8400000000001, "Time_End": 1960.8400000000001, "Text": " You basically had no information about what he didn't file."}, {"Time_Start": 1960.8400000000001, "Time_End": 1963.8400000000001, "Text": " How can the employee be in charge of the first."}, {"Time_Start": 1963.8400000000001, "Time_End": 1964.8400000000001, "Text": " I don't like it."}, {"Time_Start": 1964.8400000000001, "Time_End": 1970.8400000000001, "Text": " One of the things we'd like to see out of this, call them an investigation or others, is,"}, {"Time_Start": 1970.8400000000001, "Time_End": 1976.8400000000001, "Text": " others is exactly what they're doing. They may be downloading files. They may at least be"}, {"Time_Start": 1976.8400000000001, "Time_End": 1983.8400000000001, "Text": " looking at hashes. In the case of Usher, they clearly weren't. Unfortunately, all they're swearing"}, {"Time_Start": 1983.8400000000001, "Time_End": 1988.8400000000001, "Text": " under penalty of perjury is that they are acting with authorization of the copyright holder."}, {"Time_Start": 1988.8400000000001, "Time_End": 1992.8400000000001, "Text": " All the rest is just stuff they're saying."}, {"Time_Start": 1992.8400000000001, "Time_End": 1995.8400000000001, "Text": " So, either one."}, {"Time_Start": 1995.8400000000001, "Time_End": 1997.8400000000001, "Text": " Just a question."}, {"Time_Start": 1997.8400000000001, "Time_End": 2000.8200000000002, "Text": " So if they are, if they are in fact downloading files, they get a little bit,"}, {"Time_Start": 2000.8400000000001, "Time_End": 2003.8400000000001, "Text": " file is not the file they're expected aren't they in fact breaking so long?"}, {"Time_Start": 2005.8400000000001, "Time_End": 2013.8400000000001, "Text": " If they're downloading somebody else's copyrighted file and without authorization,"}, {"Time_Start": 2013.8400000000001, "Time_End": 2022.8400000000001, "Text": " and I suppose they could be, it's going to be very difficult to get a judge to"}, {"Time_Start": 2022.8400000000001, "Time_End": 2029.8400000000001, "Text": " find against them because of the whole context in which they're engaging in this activity."}, {"Time_Start": 2029.8400000000001, "Time_End": 2033.8400000000001, "Text": " They will say, we need to do this to protect our rights."}, {"Time_Start": 2033.8400000000001, "Time_End": 2035.8400000000001, "Text": " But they're not law enforcement."}, {"Time_Start": 2035.8400000000001, "Time_End": 2038.8400000000001, "Text": " I don't understand why they should be about to do that."}, {"Time_Start": 2038.8400000000001, "Time_End": 2045.8400000000001, "Text": " They would probably make a fair use claim that they weren't doing it to listen to the song"}, {"Time_Start": 2045.8400000000001, "Time_End": 2050.84, "Text": " or to get a market replacement for the song, but to try to enforce their rights."}, {"Time_Start": 2050.84, "Time_End": 2052.84, "Text": " Did you have a question there?"}, {"Time_Start": 2052.84, "Time_End": 2053.84, "Text": " Do you have a question there?"}, {"Time_Start": 2053.84, "Time_End": 2056.84, "Text": " Do you have how many people are actually defending themselves would get?"}, {"Time_Start": 2056.84, "Time_End": 2059.84, "Text": " They're kind of letters to mail or threats?"}, {"Time_Start": 2059.84, "Time_End": 2062.2400000000002, "Text": " or like what kind of the same?"}, {"Time_Start": 2062.2400000000002, "Time_End": 2067.6400000000003, "Text": " How are you actually saying about me and actually doing something like putting on chilling effects or depending on something?"}, {"Time_Start": 2067.6400000000003, "Time_End": 2069.2400000000002, "Text": " and how many people just slightly."}, {"Time_Start": 2069.2400000000002, "Time_End": 2072.6400000000003, "Text": " It's very hard to know."}, {"Time_Start": 2072.6400000000003, "Time_End": 2077.2400000000002, "Text": " Obviously the things that we don't see on chilling effects and don't see"}, {"Time_Start": 2077.2400000000002, "Time_End": 2081.2400000000002, "Text": " publicized are hard to count."}, {"Time_Start": 2081.2400000000002, "Time_End": 2089.7400000000002, "Text": " And another, a part of the genesis of the chilling effects project was our frustration at seeing websites that,"}, {"Time_Start": 2089.84, "Time_End": 2094.54, "Text": " you'd see one day and the next day you'd see the front page replaced by a cease and desist letter."}, {"Time_Start": 2094.54, "Time_End": 2097.84, "Text": " And a few days after that, you'd see nothing at all."}, {"Time_Start": 2097.84, "Time_End": 2103.84, "Text": " This is at least a way to track the ones who do submit information to our site"}, {"Time_Start": 2103.84, "Time_End": 2106.34, "Text": " and to follow up on those stories."}, {"Time_Start": 2106.34, "Time_End": 2110.84, "Text": " And in some cases, we see people who are able to resist the chill."}, {"Time_Start": 2110.84, "Time_End": 2117.84, "Text": " Others, unfortunately, feel that they have to take down at the back."}, {"Time_Start": 2119.84, "Time_End": 2136.84, "Text": " Well, part of the problem is in the way that they're doing on it."}, {"Time_Start": 2136.84, "Time_End": 2142.84, "Text": " That's when they're going on the ISP."}, {"Time_Start": 2142.84, "Time_End": 2146.84, "Text": " there's been no copyright infringement going on."}, {"Time_Start": 2146.84, "Time_End": 2147.84, "Text": " and so on the copyright infringement going on."}, {"Time_Start": 2147.84, "Time_End": 2148.84, "Text": " And so on the mere good faith allegation."}, {"Time_Start": 2148.84, "Time_End": 2149.84, "Text": " And so on the mere good faith allegation."}, {"Time_Start": 2149.84, "Time_End": 2159.84, "Text": " that there's an infringement, they can breach any privacy that the user might have thought he had in online activities."}, {"Time_Start": 2159.84, "Time_End": 2167.84, "Text": " Unfortunately, a lot of the activity underneath may be copyright infringement,"}, {"Time_Start": 2167.84, "Time_End": 2172.84, "Text": " but there are people using the networks for other purposes,"}, {"Time_Start": 2172.84, "Time_End": 2178.84, "Text": " and they shouldn't be subject to having their identities revealed on the mere claim."}, {"Time_Start": 2178.84, "Time_End": 2182.84, "Text": " on the mere claim that something unlawful is going on."}, {"Time_Start": 2182.84, "Time_End": 2193.84, "Text": " Yeah, it's an issue for them to look at them to look at them to look at all that and all the IRC."}, {"Time_Start": 2193.84, "Time_End": 2201.84, "Text": " Yeah, it's an issue of low-hanging fruit right now."}, {"Time_Start": 2201.84, "Time_End": 2207.84, "Text": " The ones that are easiest for them to look at and easiest for them to get into will be the ones that they go after first."}, {"Time_Start": 2207.84, "Time_End": 2215.84, "Text": " first. They seem to be trying a scare tactic where they make enough noise and bluster"}, {"Time_Start": 2215.84, "Time_End": 2224.84, "Text": " to scare people away from using the networks. But I get the bigger picture that I'm trying to give,"}, {"Time_Start": 2224.84, "Time_End": 2230.84, "Text": " though, is that it's not enough for us to think, well, the smart ones among us can just go to"}, {"Time_Start": 2230.84, "Time_End": 2237.82, "Text": " the better hidden peer-to-peer networks. We should also to really be working to change the law so that if"}, {"Time_Start": 2237.84, "Time_End": 2243.84, "Text": " there's a better way of addressing the problems of getting artists paid for the music"}, {"Time_Start": 2243.84, "Time_End": 2249.84, "Text": " and getting the music that we want to listen to, let's think about how to reform the law to answer those questions."}, {"Time_Start": 2249.84, "Time_End": 2250.84, "Text": " Sure."}, {"Time_Start": 2267.84, "Time_End": 2278.84, "Text": " Yeah, we've just started up a big Let the Music Play campaign trying to help people to understand the impact of the law, trying to,"}, {"Time_Start": 2278.84, "Time_End": 2287.84, "Text": " we work with organizations like the Creative Commons that are thinking about creative alternative licensing mechanisms"}, {"Time_Start": 2287.84, "Time_End": 2295.84, "Text": " and that show people, sort of the kinds of creativity that can flourish when copyright isn't used to lock works up."}, {"Time_Start": 2295.84, "Time_End": 2297.84, "Text": " And basically, yes, try to work."}, {"Time_Start": 2297.84, "Time_End": 2306.84, "Text": " to show people the range of options that could work better than the system that's locking things up for 95 years."}, {"Time_Start": 2306.84, "Time_End": 2312.84, "Text": " Are these subpoenas that be, are they public?"}, {"Time_Start": 2312.84, "Time_End": 2321.84, "Text": " They, through the court's pacer system, they have all been made public to anybody who registers for a password."}, {"Time_Start": 2321.84, "Time_End": 2326.84, "Text": " And so far, EFF has been taking, and as court records, they have all been made public to anybody who registered for a password."}, {"Time_Start": 2326.84, "Time_End": 2327.84, "Text": " And so far EFF has been taking, and as court records,"}, {"Time_Start": 2327.84, "Time_End": 2331.6000000000004, "Text": " they're all public also to anyone who walks into the D.C. District Court."}, {"Time_Start": 2332.08, "Time_End": 2339.7200000000003, "Text": " So we've been trying to keep up database lookup to help people see whether they've been fingered yet."}, {"Time_Start": 2339.7200000000003, "Time_End": 2346.4, "Text": " Right now, they're all being filed in the D.C. District Court, District of Columbia."}, {"Time_Start": 2346.7000000000003, "Time_End": 2357.82, "Text": " And a few people so far have challenged that as a court that doesn't have jurisdiction over Boston College or MIT in Boston and at SBC out in California."}, {"Time_Start": 2357.84, "Time_End": 2361.84, "Text": " has challenged that as well."}, {"Time_Start": 2361.84, "Time_End": 2366.84, "Text": " How do the claims against trade secret works?"}, {"Time_Start": 2366.84, "Time_End": 2369.84, "Text": " Or how do they typically instruct?"}, {"Time_Start": 2369.84, "Time_End": 2376.84, "Text": " A lot of those start out as subpoenas to ISPs for user information"}, {"Time_Start": 2376.84, "Time_End": 2380.84, "Text": " because a lot of the claims are for postings on bulletin boards."}, {"Time_Start": 2380.84, "Time_End": 2384.84, "Text": " A lot of people put information up there, thinking that they've got a pseudonym"}, {"Time_Start": 2384.84, "Time_End": 2386.84, "Text": " that nobody will trace."}, {"Time_Start": 2386.84, "Time_End": 2397.38, "Text": " And so the employer then subpoenas, the ISP, or the host, for the user information."}, {"Time_Start": 2397.92, "Time_End": 2405.2400000000002, "Text": " And we've been helping some of those users to file John Doe lawsuits or motions to quash the subpoenas,"}, {"Time_Start": 2405.2400000000002, "Time_End": 2411.6600000000003, "Text": " where, in fact, there's no trade secret, and it really appears to be an attempt to harass an employee"}, {"Time_Start": 2411.6600000000003, "Time_End": 2414.86, "Text": " who's saying something that he's got a lawful right to say."}, {"Time_Start": 2416.84, "Time_End": 2419.84, "Text": " out with claims against NDA or..."}, {"Time_Start": 2419.84, "Time_End": 2422.6000000000004, "Text": " Some of them, some of them do."}, {"Time_Start": 2422.7000000000003, "Time_End": 2428.78, "Text": " Some of them get dropped at the motion to quash stage because the court finds there was really"}, {"Time_Start": 2428.78, "Time_End": 2432.34, "Text": " no lawful basis for the subpoena in the first place."}, {"Time_Start": 2432.84, "Time_End": 2436.84, "Text": " And even if you found the identity, you wouldn't have a reason to go after the person."}, {"Time_Start": 2437.34, "Time_End": 2440.4, "Text": " So there's no reason to give up the identity."}, {"Time_Start": 2442.88, "Time_End": 2443.4, "Text": " Sure."}, {"Time_Start": 2446.84, "Time_End": 2463.7200000000003, "Text": " it's an awfully good question for it. It's an awfully good question."}, {"Time_Start": 2463.7200000000003, "Time_End": 2472.0, "Text": " It shows the lack of proportion in a lot of the lack of proportion in a lot of these laws that"}, {"Time_Start": 2472.0, "Time_End": 2476.6800000000003, "Text": " that copyright holders successfully argued to Congress that"}, {"Time_Start": 2476.84, "Time_End": 2481.46, "Text": " Our digital assets are so valuable that without extraordinarily harsh penalties,"}, {"Time_Start": 2481.6600000000003, "Time_End": 2483.3, "Text": " we won't be able to keep them safe."}, {"Time_Start": 2483.8, "Time_End": 2486.7000000000003, "Text": " Congress said, sure, that sounds reasonable to us."}, {"Time_Start": 2487.2200000000003, "Time_End": 2495.26, "Text": " And we got the No Electronic Thief Act, and we're hearing proposals now to lower the limit"}, {"Time_Start": 2495.26, "Time_End": 2501.7400000000002, "Text": " to make uploading of a single, or offering for upload of a single song, a felony."}, {"Time_Start": 2502.2400000000002, "Time_End": 2506.0, "Text": " And again, that's what we need the public to speak out against."}, {"Time_Start": 2506.84, "Time_End": 2509.02, "Text": " to make that very claim."}, {"Time_Start": 2509.1200000000003, "Time_End": 2515.3, "Text": " It's ridiculous against this kind of market to be calling this a criminal act."}, {"Time_Start": 2515.98, "Time_End": 2517.44, "Text": " I see a couple of people in the back."}, {"Time_Start": 2536.84, "Time_End": 2546.6200000000003, "Text": " We're going to try and get more of this discussion going later this evening, if you can get back for that."}, {"Time_Start": 2546.82, "Time_End": 2552.0, "Text": " We can't, in short, we don't know the strategy that they're going to use."}, {"Time_Start": 2552.0, "Time_End": 2554.4, "Text": " A lot of it seems to be scare."}, {"Time_Start": 2566.84, "Time_End": 2577.06, "Text": " I guess that's a strategic that's a strategic that's not a"}, {"Time_Start": 2577.06, "Time_End": 2588.1600000000003, "Text": " strategic judgment that maybe the person demanding removal should be making."}, {"Time_Start": 2592.1600000000003, "Time_End": 2595.86, "Text": " They might be wise not to they might be wise not to demand if they think that they might be wise not to demand"}, {"Time_Start": 2595.86, "Time_End": 2599.7000000000003, "Text": " if they think that that's just going to make it more interesting."}, {"Time_Start": 2600.98, "Time_End": 2601.86, "Text": " It's not really."}, {"Time_Start": 2603.44, "Time_End": 2604.46, "Text": " All right, one last question."}, {"Time_Start": 2604.46, "Time_End": 2607.1, "Text": " And then I'll be headed outside for anyone else."}, {"Time_Start": 2620.1, "Time_End": 2623.36, "Text": " Well, some of the silliest we've seen from the company that's come from your business now."}, {"Time_Start": 2623.36, "Time_End": 2625.84, "Text": " Have come from the company that owns Barney."}, {"Time_Start": 2625.86, "Time_End": 2630.94, "Text": " who sends out claims whenever anyone puts up the Barney song with different words"}, {"Time_Start": 2630.94, "Time_End": 2633.38, "Text": " or puts devil's horns on the dinosaur."}, {"Time_Start": 2636.42, "Time_End": 2638.6600000000003, "Text": " We see a lot from Scientology."}, {"Time_Start": 2642.9, "Time_End": 2644.34, "Text": " All right, thanks very much."}, {"Time_Start": 2655.86, "Time_End": 2656.86, "Text": " I don't know."}]}