{"segments": [{"Time_Start": 0.0, "Time_End": 8.0, "Text": " I'm Daniel Burroughs and I'm giving my talk on correlating network attacks from distributed."}, {"Time_Start": 8.0, "Time_End": 20.0, "Text": " Is that better?"}, {"Time_Start": 20.0, "Time_End": 24.0, "Text": " Is that better?"}, {"Time_Start": 30.0, "Time_End": 32.0, "Text": " Okay."}, {"Time_Start": 32.0, "Time_End": 49.0, "Text": " Well, I say I'm Daniel Burroughs and I'm going to be talking a little bit, a little bit less than I thought, about correlating information gathered from distributed intrusion detection systems."}, {"Time_Start": 49.0, "Time_End": 56.0, "Text": " This work I've been doing while at the Institute for Security Technology Studies at Dartmouth College."}, {"Time_Start": 56.0, "Time_End": 59.0, "Text": " So first I'm just going to give a little bit of back."}, {"Time_Start": 59.0, "Time_End": 64.0, "Text": " I'm just going to give a little bit of background on ISTS where I work right now."}, {"Time_Start": 64.0, "Time_End": 73.0, "Text": " It's a security and counterterrorism research center that's funded by the NIH, which is the research arm of the Department of Justice."}, {"Time_Start": 73.0, "Time_End": 77.0, "Text": " Its main focus is on computer security."}, {"Time_Start": 77.0, "Time_End": 82.0, "Text": " And the group that I work in is the investigative research for infrastructure assurance,"}, {"Time_Start": 82.0, "Time_End": 88.0, "Text": " which is mainly an engineering-based group, which is done jointly with the Thayer School of Engineering up at Dartmouth College."}, {"Time_Start": 88.0, "Time_End": 89.0, "Text": " with college."}, {"Time_Start": 89.0, "Time_End": 100.0, "Text": " So, kind of, just to give an overview of what we're trying to do with this system, talk about the needs and the goals of it a bit."}, {"Time_Start": 100.0, "Time_End": 106.0, "Text": " In general, just to give like a kind of a nutshell picture of the internet and what's going on out there."}, {"Time_Start": 106.0, "Time_End": 112.0, "Text": " We have some systems that are connected out there that have little or no defense on them."}, {"Time_Start": 112.0, "Time_End": 117.98, "Text": " Some people that might be a little more concerned with their security, they put up firewalls, various"}, {"Time_Start": 118.0, "Time_End": 122.0, "Text": " types of defensive mechanisms, and then you've got others that are out there running a bit more"}, {"Time_Start": 122.0, "Time_End": 127.0, "Text": " information gathering systems, either IDS or other types of network sensors that are gathering"}, {"Time_Start": 127.0, "Time_End": 129.0, "Text": " a bit of information about what's going on out there."}, {"Time_Start": 129.0, "Time_End": 134.0, "Text": " And of course, we've got the people that are out there trying to get into everything."}, {"Time_Start": 134.0, "Time_End": 141.0, "Text": " So we might see alerts occurring on some of these systems distributed across many networks,"}, {"Time_Start": 141.0, "Time_End": 147.0, "Text": " and we're trying to gather this information and find out if it's related and rearrange the information"}, {"Time_Start": 147.0, "Time_End": 154.0, "Text": " the information gathered from these distributed systems to make the job of the security analyst a little bit easier."}, {"Time_Start": 154.0, "Time_End": 159.0, "Text": " So the first thing we're trying to detect are distributed and coordinated attacks."}, {"Time_Start": 159.0, "Time_End": 165.0, "Text": " Either an attack coming in from many places or many people trying to attack"}, {"Time_Start": 165.0, "Time_End": 171.0, "Text": " trying to attack one site simultaneously or possibly a single group or single person"}, {"Time_Start": 171.0, "Time_End": 176.0, "Text": " that is going after multiple sites that have some sort of relationship between them."}, {"Time_Start": 176.0, "Time_End": 180.0, "Text": " So these have been, of course, increasing in rate and sophistication."}, {"Time_Start": 180.0, "Time_End": 187.0, "Text": " These are, whether they're the, sort of the more automated ones like the worms, like some of the"}, {"Time_Start": 187.0, "Time_End": 193.0, "Text": " like the curb red and them that we saw last summer, or other similar types of attacks."}, {"Time_Start": 193.0, "Time_End": 199.0, "Text": " Also, we're interested in looking at infrastructure protection, and this is part of the mission of ISTS,"}, {"Time_Start": 199.0, "Time_End": 202.0, "Text": " in particular the group that I work in."}, {"Time_Start": 202.0, "Time_End": 205.56, "Text": " They're wanting to detect either"}, {"Time_Start": 205.56, "Time_End": 211.32, "Text": " a coordinated attack against infrastructure or attacks against multiple infrastructure components."}, {"Time_Start": 211.32, "Time_End": 218.16, "Text": " And this is something like where a group or individual may try to take out a particular sector"}, {"Time_Start": 218.16, "Time_End": 222.56, "Text": " of infrastructure, whether this is power generation, emergency response, communication"}, {"Time_Start": 222.56, "Time_End": 229.56, "Text": " systems, or either one sector on a wide scale or multiple sectors of infrastructure within"}, {"Time_Start": 229.56, "Time_End": 235.54, "Text": " one local geographic area. Also, we want to try and reduce"}, {"Time_Start": 235.56, "Time_End": 239.56, "Text": " the overwhelming amount of data that's being produced by intrusion detection systems"}, {"Time_Start": 239.56, "Time_End": 246.56, "Text": " and reduce the requirements in the workload on the security analyst to analyze this data"}, {"Time_Start": 246.56, "Time_End": 254.56, "Text": " and pull out what's really interesting out of all the noise that's being generated on the systems."}, {"Time_Start": 254.56, "Time_End": 261.56, "Text": " So we're interested in taking data that's already being generated out there and reorganizing it"}, {"Time_Start": 261.56, "Time_End": 264.56, "Text": " so it produces a clearer picture of what's going on."}, {"Time_Start": 264.56, "Time_End": 270.56, "Text": " We're not trying to build a better intrusion detection system or even build a new type of sensor,"}, {"Time_Start": 270.56, "Time_End": 274.56, "Text": " but just make better use of information that's already out there on the systems"}, {"Time_Start": 274.56, "Time_End": 277.56, "Text": " and bring together information from various types of IDS,"}, {"Time_Start": 277.56, "Time_End": 279.56, "Text": " other types of network sensors as well,"}, {"Time_Start": 279.56, "Time_End": 285.56, "Text": " and use this along with some other knowledge about the relationships between these types of events"}, {"Time_Start": 285.56, "Time_End": 291.56, "Text": " and what we're seeing to be able to track the activities of individual attackers on the system."}, {"Time_Start": 291.56, "Time_End": 293.56, "Text": " So, kind of the..."}, {"Time_Start": 293.56, "Time_End": 302.56, "Text": " The traditional sort of view of a network is kind of a very self-centered defensive position,"}, {"Time_Start": 302.56, "Time_End": 306.56, "Text": " a defensive viewpoint where we're interested in keeping people out of our network,"}, {"Time_Start": 306.56, "Time_End": 311.56, "Text": " keeping a big wall around the castle, keeping the barbarians outside,"}, {"Time_Start": 311.56, "Time_End": 315.56, "Text": " trying to just keep people outside."}, {"Time_Start": 315.56, "Time_End": 322.56, "Text": " But we're gathering only a partial, only part of the information of what's available in regards to each person."}, {"Time_Start": 322.56, "Time_End": 325.06, "Text": " regards to each person attacking the network."}, {"Time_Start": 325.06, "Time_End": 330.56, "Text": " This gives us, this makes sense from the defensive point of view, but it doesn't give us very much"}, {"Time_Start": 330.56, "Time_End": 338.56, "Text": " information about the overall goals of someone whose attacks spread across multiple networks."}, {"Time_Start": 338.56, "Time_End": 344.56, "Text": " So, it also, there's also weaknesses in this because there are certain types of attacks, such"}, {"Time_Start": 344.56, "Time_End": 352.54, "Text": " as a distributed denial of service, where the actual victim of the attack need not"}, {"Time_Start": 352.56, "Time_End": 355.24, "Text": " be part of any of the preparation stages."}, {"Time_Start": 355.24, "Time_End": 359.7, "Text": " Well, we've got someone, in the little scenarios shown here,"}, {"Time_Start": 359.78000000000003, "Time_End": 362.34, "Text": " where we've got a number of systems out there."}, {"Time_Start": 362.42, "Time_End": 364.78000000000003, "Text": " A couple of them were protected, a few of them are not."}, {"Time_Start": 365.16, "Time_End": 366.7, "Text": " And we've got someone that's attacking them."}, {"Time_Start": 366.76, "Time_End": 370.22, "Text": " They're only able to get into the systems that are unprotected."}, {"Time_Start": 370.7, "Time_End": 374.46, "Text": " But then later on, they're able to use these to launch a Denali service type attack"}, {"Time_Start": 374.46, "Time_End": 378.38, "Text": " against someone who is actually sitting behind some amount of protection."}, {"Time_Start": 379.3, "Time_End": 382.28, "Text": " So this person,"}, {"Time_Start": 382.28000000000003, "Time_End": 386.04, "Text": " may not have seen or may not have been bothered by the initial stages,"}, {"Time_Start": 386.16, "Time_End": 390.08000000000004, "Text": " so sort of setting up the preparation of the zombie collection for the deniative service,"}, {"Time_Start": 390.20000000000005, "Time_End": 392.50000000000006, "Text": " but they still can be vulnerable to that type of attack."}, {"Time_Start": 393.06, "Time_End": 397.58000000000004, "Text": " So we want to change the view to more than a wider view,"}, {"Time_Start": 397.78000000000003, "Time_End": 401.70000000000005, "Text": " to where we can get more information about each attacker out there"}, {"Time_Start": 401.70000000000005, "Time_End": 405.40000000000003, "Text": " and try and figure out what their goals are and what they're going after,"}, {"Time_Start": 405.90000000000003, "Time_End": 408.08000000000004, "Text": " and get more of an attacker-centered viewpoint."}, {"Time_Start": 408.74, "Time_End": 412.26000000000005, "Text": " This requires, of course, one gathering the data,"}, {"Time_Start": 412.28000000000003, "Time_End": 417.78000000000003, "Text": " from the various systems, and then also being able to fuse it and correlate it in a meaningful fashion."}, {"Time_Start": 420.1, "Time_End": 428.18, "Text": " So we're using techniques that come out of the realm of radar tracking system, which is in some ways"}, {"Time_Start": 428.18, "Time_End": 430.08000000000004, "Text": " are very similar to what we're doing with IDES."}, {"Time_Start": 430.08000000000004, "Time_End": 435.28000000000003, "Text": " We have multiple sensors, multiple types of sensors, we have multiple targets out there,"}, {"Time_Start": 435.28000000000003, "Time_End": 437.98, "Text": " and we're trying to do this tracking and correlation in real time."}, {"Time_Start": 442.28000000000003, "Time_End": 444.94000000000005, "Text": " Yes, and I had a nice little sound effect there."}, {"Time_Start": 446.46000000000004, "Time_End": 459.24, "Text": " So we're taking this model and trying to apply it to one where the different types of intrusion detection systems are our sensors and the targets that we're trying to track or the people attacking our networks."}, {"Time_Start": 460.68, "Time_End": 462.94000000000005, "Text": " So, as I said, there are two stages to this."}, {"Time_Start": 463.02000000000004, "Time_End": 465.18, "Text": " The first is gathering data, collecting it."}, {"Time_Start": 466.22, "Time_End": 470.58000000000004, "Text": " There's a lot of work that's been done in this area in the past and is currently being done."}, {"Time_Start": 470.58, "Time_End": 478.26, "Text": " It was, well, a couple of the talks, other talks here at DEFCON this year, or focus on this."}, {"Time_Start": 480.26, "Time_End": 487.38, "Text": " So we're concentrating more on the correlation aspect, trying to tell how various events are related."}, {"Time_Start": 488.03999999999996, "Time_End": 497.03999999999996, "Text": " And we're doing this by the basic assumption that the attacker's goals are going to determine their behavior,"}, {"Time_Start": 497.03999999999996, "Time_End": 499.94, "Text": " and different attackers with different goals are going to have different behavior."}, {"Time_Start": 500.58, "Time_End": 502.68, "Text": " they'll be recognizable for one another."}, {"Time_Start": 503.4, "Time_End": 515.46, "Text": " And we're doing this through the use of multiple hypotheses tracking, which, just to give an overview of what multiple hypotheses tracking is,"}, {"Time_Start": 515.9, "Time_End": 523.26, "Text": " if we look at the radar tracking analogy again, at each time we do a radar sweep, we see two targets out there,"}, {"Time_Start": 523.26, "Time_End": 528.98, "Text": " and we see them moving in a certain fashion as they go through the space that we're looking at."}, {"Time_Start": 528.98, "Time_End": 541.98, "Text": " But we're not sure exactly what's going on here, because we can see what happens at each sort of sweep every time we get information from the sensors, but we're trying to now relate events from one sweep to another."}, {"Time_Start": 542.64, "Time_End": 548.32, "Text": " So in these two cases, there are two possibilities that the targets could have followed these two paths."}, {"Time_Start": 548.82, "Time_End": 556.9200000000001, "Text": " We're trying to do a similar thing in determining the paths that an attacker is taken while going after multiple systems."}, {"Time_Start": 556.92, "Time_End": 567.24, "Text": " So in our system, we have the tracking system, and it analyzes events that are being collected from various IDS,"}, {"Time_Start": 567.24, "Time_End": 572.68, "Text": " as whether they be distributed across many networks or different types of IDS on a single network."}, {"Time_Start": 573.16, "Time_End": 574.8399999999999, "Text": " And as these events arrived, they're analyzed."}, {"Time_Start": 574.8399999999999, "Time_End": 578.52, "Text": " And for example, in this, initially we get a port scan."}, {"Time_Start": 579.0, "Time_End": 586.68, "Text": " That's all we've seen so far, so we know that the only possible scenario so far is that there is one attack occurring,"}, {"Time_Start": 586.92, "Time_End": 591.9, "Text": " consists of that port scan. In the future, we also see a buffer overflow attack."}, {"Time_Start": 592.26, "Time_End": 596.18, "Text": " Now there are two possibilities for what's going on out there. There could either be one person"}, {"Time_Start": 596.18, "Time_End": 601.36, "Text": " that's doing both of these, doing this recon scan and then trying to break into the system,"}, {"Time_Start": 601.76, "Time_End": 607.4599999999999, "Text": " or they could be two unrelated attacks that just happen to be occurring at the same time."}, {"Time_Start": 607.4599999999999, "Time_End": 612.1999999999999, "Text": " And we're trying to figure out, these are all multiple hypotheses. Now we're trying to figure out"}, {"Time_Start": 612.1999999999999, "Time_End": 614.66, "Text": " which one of these is most likely the case."}, {"Time_Start": 616.92, "Time_End": 622.7199999999999, "Text": " So we do this by evaluating the hypotheses based both on the behavior of the attacker,"}, {"Time_Start": 623.3199999999999, "Time_End": 625.8, "Text": " of the target, and of the sensor."}, {"Time_Start": 627.16, "Time_End": 633.9599999999999, "Text": " The, we want to know what real-world event caused the reading that we're saying off of our intrusion"}, {"Time_Start": 633.9599999999999, "Time_End": 639.24, "Text": " detection system, what actually happened out there to cause it to go off and give us an alert."}, {"Time_Start": 639.74, "Time_End": 646.3199999999999, "Text": " And we also want to know how likely is it that someone would have done this event and"}, {"Time_Start": 646.32, "Time_End": 651.5600000000001, "Text": " then how likely is it that someone that we saw before in our intrusion detection systems"}, {"Time_Start": 651.5600000000001, "Time_End": 653.7800000000001, "Text": " would have caused this event to occur?"}, {"Time_Start": 654.5400000000001, "Time_End": 656.72, "Text": " So I'll skip over the math for now."}, {"Time_Start": 661.4200000000001, "Time_End": 669.62, "Text": " So for modeling the sensors, we're looking at the two basic methods of intrusion detection system,"}, {"Time_Start": 669.62, "Time_End": 675.4200000000001, "Text": " either the signature detection or the statistical anomaly detection system."}, {"Time_Start": 675.9200000000001, "Time_End": 676.3000000000001, "Text": " Of course, this is a system."}, {"Time_Start": 676.32, "Time_End": 681.4200000000001, "Text": " signature has a very, a little false positive, but it has a weakness of detecting only known attacks."}, {"Time_Start": 681.7800000000001, "Time_End": 687.1600000000001, "Text": " The anomaly detection, higher false positive, but it has the chance of detecting a wider range of attacks."}, {"Time_Start": 687.7600000000001, "Time_End": 692.36, "Text": " And we use these both on, of course, the host and network-based systems."}, {"Time_Start": 693.88, "Time_End": 697.7800000000001, "Text": " So for modeling the sensors with signature detection, it's fairly easy."}, {"Time_Start": 697.7800000000001, "Time_End": 704.34, "Text": " If a known attack occurs in an observable area, the probability of detection is one. Otherwise, you're not going to see it."}, {"Time_Start": 704.6400000000001, "Time_End": 706.3000000000001, "Text": " The anomaly detection is a bit more different."}, {"Time_Start": 706.32, "Time_End": 712.08, "Text": " difficult. The type of attack, it's very, whether it detect something is very dependent on the type of attack."}, {"Time_Start": 712.5600000000001, "Time_End": 719.32, "Text": " Noisier or unusual attacks are likely to be seen, things like denocious, sports scams, someone accessing unused services."}, {"Time_Start": 719.94, "Time_End": 729.9000000000001, "Text": " Other types of attacks may be missed more often by these, whether they'd be something that involves non-form web requests, some types of buffer overflows, things that look more like normal traffic."}, {"Time_Start": 732.0400000000001, "Time_End": 734.7800000000001, "Text": " So, when we, so."}, {"Time_Start": 736.32, "Time_End": 743.32, "Text": " Also, when we're looking at the sense of we're interested in the information that it's giving us, the measurements it's making about the particular event."}, {"Time_Start": 743.86, "Time_End": 749.98, "Text": " And we try to look at a sort of a minimal feature set from the various IDS that we're using currently."}, {"Time_Start": 750.6400000000001, "Time_End": 756.5400000000001, "Text": " This consists of the source destination IP, the ports, the type of the attack, and the time that the attack is occurring."}, {"Time_Start": 757.6400000000001, "Time_End": 766.3000000000001, "Text": " These various measurements that we're taking about each attack are then used to describe a space through which the attacker is moving."}, {"Time_Start": 766.32, "Time_End": 772.5400000000001, "Text": " as they go through either various types of attacks against one system or attacking multiple systems out there."}, {"Time_Start": 774.0400000000001, "Time_End": 783.36, "Text": " So, in order to evaluate, use this information to evaluate the response of the sensor, we're using Bayesian inference."}, {"Time_Start": 783.9000000000001, "Time_End": 786.3000000000001, "Text": " And this is used to solve the problem."}, {"Time_Start": 786.5, "Time_End": 796.1, "Text": " Basically, when we have a sensor and IDS out there, we know the forward response to it very well, meaning that we know that if a particular event, X, occurs out there."}, {"Time_Start": 796.32, "Time_End": 800.3000000000001, "Text": " there. Someone tries a particular attack. We know what the sensor is going to tell us."}, {"Time_Start": 800.34, "Time_End": 804.5400000000001, "Text": " That's how they're designed. They're designed to respond to their stimuli."}, {"Time_Start": 805.2, "Time_End": 810.3000000000001, "Text": " But our problem is that we have to go through this backwards because our only view of the world"}, {"Time_Start": 810.3000000000001, "Time_End": 816.08, "Text": " is through the sensors. So we only see their output and we're trying to infer the input that"}, {"Time_Start": 816.08, "Time_End": 820.32, "Text": " caused that. So given the output, what was the real world event that occurred?"}, {"Time_Start": 821.1400000000001, "Time_End": 825.7800000000001, "Text": " So to do this, we look at both the forward response, which is known."}, {"Time_Start": 826.32, "Time_End": 833.7600000000001, "Text": " and the prior distribution events, meaning what's the likelihood of getting this sensor response we saw, given a particular real-world event?"}, {"Time_Start": 834.1600000000001, "Time_End": 837.98, "Text": " And also, what's the probability of that real-world event actually having existed?"}, {"Time_Start": 838.1400000000001, "Time_End": 843.7, "Text": " What's the chance of that attack really happened occurred, or is it more likely that this was a false positive?"}, {"Time_Start": 843.82, "Time_End": 847.44, "Text": " Something that probably wasn't occurring right now, or at least wasn't significant."}, {"Time_Start": 850.0, "Time_End": 852.0, "Text": " So, modeling the attackers."}, {"Time_Start": 852.6, "Time_End": 855.36, "Text": " They're not as easy to observe or model as the sensors."}, {"Time_Start": 856.32, "Time_End": 859.7600000000001, "Text": " mainly because we build and design the sensors, and we can look at how they operate."}, {"Time_Start": 860.2600000000001, "Time_End": 865.48, "Text": " And oftentimes, these are all we can ever use to look at the people attacking the networks."}, {"Time_Start": 866.58, "Time_End": 869.6600000000001, "Text": " So we have a very limited view of what's going on there at times."}, {"Time_Start": 870.1600000000001, "Time_End": 877.5400000000001, "Text": " It's also very difficult to describe the state of the attack, which I'll discuss briefly in a moment."}, {"Time_Start": 878.96, "Time_End": 885.4200000000001, "Text": " So far, with modeling the attackers, we've got used three sources of data in this work."}, {"Time_Start": 885.4200000000001, "Time_End": 892.5400000000001, "Text": " One is from simulation that we have designed, another is from local networks that we have under our control,"}, {"Time_Start": 892.94, "Time_End": 895.8600000000001, "Text": " and also from the capture the flag game here at DefCon."}, {"Time_Start": 897.32, "Time_End": 902.6200000000001, "Text": " So for the simulation, we use, this is, there's a couple ways that we use simulation."}, {"Time_Start": 902.6200000000001, "Time_End": 904.2, "Text": " One is in purely generated data."}, {"Time_Start": 904.5000000000001, "Time_End": 905.7800000000001, "Text": " We just have a complete simulation."}, {"Time_Start": 906.08, "Time_End": 909.6800000000001, "Text": " It simulates the network noise out there and the attacks occurring."}, {"Time_Start": 910.48, "Time_End": 913.84, "Text": " This is, of course, highly controllable, good for the development stages."}, {"Time_Start": 913.84, "Time_End": 925.24, "Text": " We also have generated attacks, where it's a simulated attack that's inserted into normal network background noise that we record off of live networks."}, {"Time_Start": 926.0400000000001, "Time_End": 930.5600000000001, "Text": " And this is a little more realistic and a bit more interesting for testing purposes."}, {"Time_Start": 931.52, "Time_End": 938.74, "Text": " So this is just a diagram of one of our testing systems we've got on the network at the engineering school."}, {"Time_Start": 940.22, "Time_End": 942.08, "Text": " We've got the main line coming into it."}, {"Time_Start": 942.08, "Time_End": 943.82, "Text": " It goes through numbers of..."}, {"Time_Start": 943.84, "Time_End": 952.6600000000001, "Text": " And we've got IDS sat at various locations on the inside, where we can either view these together or in isolation from one another."}, {"Time_Start": 952.6600000000001, "Time_End": 964.52, "Text": " And we're taking this to take the different segments of the network to pretend like the distributed system to try and gather information on each one and then correlate it together to see if we can pick up the big picture."}, {"Time_Start": 964.52, "Time_End": 973.6600000000001, "Text": " We also have another system out of a location at ISTS and another one with a company nearby in TOTS."}, {"Time_Start": 973.84, "Time_End": 977.84, "Text": " to kind of get a wider picture of what's going on out there."}, {"Time_Start": 977.84, "Time_End": 987.84, "Text": " So, and of course, like I said, we also use the DefCon Capture the Flag information."}, {"Time_Start": 987.84, "Time_End": 998.84, "Text": " This data is unrealistic in some aspects because there's a general lack of stealth, lack of network defenses, et cetera, on the system."}, {"Time_Start": 998.84, "Time_End": 1003.82, "Text": " But what's great about it for our purposes is there's many, many attacks and many scenarios."}, {"Time_Start": 1003.84, "Time_End": 1018.88, "Text": " A lot of the more traditional data sets for testing and evaluating IDS, such as the Lawrence Livermore data sets, they only have single event attacks in them."}, {"Time_Start": 1019.1800000000001, "Time_End": 1026.3400000000001, "Text": " They don't have sequences of events like someone coming in doing recon and then coming back and attacking particular systems."}, {"Time_Start": 1026.64, "Time_End": 1029.4, "Text": " They're trying to attack one system and go to another."}, {"Time_Start": 1029.4, "Time_End": 1033.48, "Text": " They're just individual events, so they're not very, it doesn't help us for."}, {"Time_Start": 1033.84, "Time_End": 1035.84, "Text": " trying to develop correlation techniques."}, {"Time_Start": 1035.84, "Time_End": 1038.84, "Text": " But of course, the capture the flag cam does have this."}, {"Time_Start": 1038.84, "Time_End": 1050.84, "Text": " For example, and this is from the, from two years ago, in a 2.5 hour time slice of the network data,"}, {"Time_Start": 1050.84, "Time_End": 1054.84, "Text": " there was played back against network intrusion detection systems."}, {"Time_Start": 1054.84, "Time_End": 1058.84, "Text": " There were over 16,000 events registered on it."}, {"Time_Start": 1058.84, "Time_End": 1062.84, "Text": " These were Oliver Dane and Robert Cunningham from Lincoln Labs."}, {"Time_Start": 1062.84, "Time_End": 1063.84, "Text": " from Lincoln Labs."}, {"Time_Start": 1063.84, "Time_End": 1065.84, "Text": " I think all over day, mainly."}, {"Time_Start": 1065.84, "Time_End": 1070.84, "Text": " Hand classified these into scenarios, went through all these events and figured out what was really going on."}, {"Time_Start": 1070.84, "Time_End": 1076.84, "Text": " And there were about 89 individual scenarios in this two and a half hour time slides."}, {"Time_Start": 1076.84, "Time_End": 1082.84, "Text": " So the state problem of the attack, basically, without getting into too much detail about this,"}, {"Time_Start": 1082.84, "Time_End": 1087.84, "Text": " in the traditional tracking system, you want to be able to describe the state that the attack"}, {"Time_Start": 1087.84, "Time_End": 1092.82, "Text": " is in in as simple terms as possible, like for an airplane, give it its, you know, X"}, {"Time_Start": 1092.84, "Time_End": 1094.84, "Text": " y and z position and its velocities."}, {"Time_Start": 1094.84, "Time_End": 1099.84, "Text": " It's a little more difficult to do this with an attack because the space that the attack's moving through"}, {"Time_Start": 1099.84, "Time_End": 1102.84, "Text": " is nonlinear and non-contiguous."}, {"Time_Start": 1102.84, "Time_End": 1106.84, "Text": " So there's no simple method for describing the state."}, {"Time_Start": 1106.84, "Time_End": 1113.84, "Text": " So what we do is we use a small history of events in each track to describe the state of the attack"}, {"Time_Start": 1113.84, "Time_End": 1119.84, "Text": " and to see whether a new event coming in fits in with this short history that we keep."}, {"Time_Start": 1119.84, "Time_End": 1121.84, "Text": " So we use a new event coming in,"}, {"Time_Start": 1121.84, "Time_End": 1129.84, "Text": " we use a sort of a windowed history of previous events and look at the relationship between"}, {"Time_Start": 1129.84, "Time_End": 1133.84, "Text": " the new event we're trying to fit into this track to see if it fits in there."}, {"Time_Start": 1133.84, "Time_End": 1137.84, "Text": " Compare it to the previous event and the event before that and the event before that."}, {"Time_Start": 1137.84, "Time_End": 1142.84, "Text": " We have a waiting function so we can give more weight to the more recent events."}, {"Time_Start": 1142.84, "Time_End": 1146.84, "Text": " So we calculate the relationships between the pairs and sequences of events here"}, {"Time_Start": 1146.84, "Time_End": 1150.84, "Text": " to see if the new event makes sense with what has come before it."}, {"Time_Start": 1150.84, "Time_End": 1152.84, "Text": " before it."}, {"Time_Start": 1152.84, "Time_End": 1156.84, "Text": " So one thing that's important to keep in mind here is,"}, {"Time_Start": 1156.84, "Time_End": 1160.84, "Text": " is that for describing the state of an attack,"}, {"Time_Start": 1160.84, "Time_End": 1164.84, "Text": " we don't really care how they got to this state,"}, {"Time_Start": 1164.84, "Time_End": 1166.84, "Text": " how they got how the attack got to this point."}, {"Time_Start": 1166.84, "Time_End": 1169.84, "Text": " We just care which state it's in."}, {"Time_Start": 1169.84, "Time_End": 1172.84, "Text": " We don't need to know the entire sequence just enough"}, {"Time_Start": 1172.84, "Time_End": 1175.84, "Text": " so we can differentiate one from another."}, {"Time_Start": 1175.84, "Time_End": 1179.84, "Text": " In doing, to do this, we use"}, {"Time_Start": 1179.84, "Time_End": 1185.84, "Text": " we use some, we need some predictive model that can give us an idea based on what we've seen before,"}, {"Time_Start": 1185.84, "Time_End": 1190.84, "Text": " what's likely to happen in the future, what's unlikely to happen in the future."}, {"Time_Start": 1190.84, "Time_End": 1193.84, "Text": " And this is where the different types of attacks, the different things someone's going after,"}, {"Time_Start": 1193.84, "Time_End": 1200.84, "Text": " are going to have a different distribution, different probability distribution of what's occurring."}, {"Time_Start": 1200.84, "Time_End": 1208.84, "Text": " For example, in these two, in the two graphs here, one is, one shows a probability distribution,"}, {"Time_Start": 1208.84, "Time_End": 1214.84, "Text": " distribution for events on someone that's scanning a network, that's doing some sort of reconnaissance,"}, {"Time_Start": 1214.84, "Time_End": 1216.84, "Text": " and the other is for a denial of service."}, {"Time_Start": 1216.84, "Time_End": 1222.84, "Text": " On these graphs, basically, the further over to the right, something is, that's the faster the events"}, {"Time_Start": 1222.84, "Time_End": 1223.84, "Text": " are arriving."}, {"Time_Start": 1223.84, "Time_End": 1227.84, "Text": " So in a denial of service, things occur very quickly, otherwise it wouldn't be much of a"}, {"Time_Start": 1227.84, "Time_End": 1228.84, "Text": " denial of service."}, {"Time_Start": 1228.84, "Time_End": 1238.84, "Text": " On the, on the, going back into the graph, kind of along these axis, this shows, this shows,"}, {"Time_Start": 1238.84, "Time_End": 1243.84, "Text": " the sort of spread and source IP addresses that we're seeing,"}, {"Time_Start": 1243.84, "Time_End": 1245.84, "Text": " something like a distributed non-service,"}, {"Time_Start": 1245.84, "Time_End": 1249.84, "Text": " we're going to obviously see things coming from many different IP addresses,"}, {"Time_Start": 1249.84, "Time_End": 1251.84, "Text": " something from a scanning attack, chances are,"}, {"Time_Start": 1251.84, "Time_End": 1255.84, "Text": " in most cases, they're all going to be coming from a similar area"}, {"Time_Start": 1255.84, "Time_End": 1259.84, "Text": " of the internet, if it's the same person."}, {"Time_Start": 1259.84, "Time_End": 1267.84, "Text": " So, this is, these, this chart, this shows just a couple feature sets,"}, {"Time_Start": 1267.84, "Time_End": 1268.84, "Text": " sort of the IP series."}, {"Time_Start": 1268.84, "Time_End": 1273.84, "Text": " source spread and the arrival rate of the events."}, {"Time_Start": 1273.84, "Time_End": 1279.84, "Text": " So we're interested in trying to figure out what features out of what we're measuring give good information."}, {"Time_Start": 1279.84, "Time_End": 1287.84, "Text": " So we've been looking at the historical data sets from either what we've captured off of the"}, {"Time_Start": 1287.84, "Time_End": 1293.84, "Text": " network or from the capture of the flag game to see what makes good differentiating features for these events."}, {"Time_Start": 1298.84, "Time_End": 1307.84, "Text": " Well, so basically, this is just, all this is showing here is it's looking at those two graphs that we saw on the previous chart."}, {"Time_Start": 1307.84, "Time_End": 1310.84, "Text": " Now they're plotted against each other, looking at one axis at a time."}, {"Time_Start": 1310.84, "Time_End": 1312.84, "Text": " Over on the left is the arrival rate."}, {"Time_Start": 1312.84, "Time_End": 1316.84, "Text": " Over on the right, we're looking at the spread on the source IP address."}, {"Time_Start": 1316.84, "Time_End": 1324.84, "Text": " And there's significant, you can see there's significant more overlap on the arrival weight than there is on the spread on the source note mask."}, {"Time_Start": 1324.84, "Time_End": 1327.84, "Text": " This means that looking at the,"}, {"Time_Start": 1327.84, "Time_End": 1330.84, "Text": " if the IP source that things are coming from,"}, {"Time_Start": 1330.84, "Time_End": 1335.84, "Text": " is much more likely to be able to differentiate between different types of attacks"}, {"Time_Start": 1335.84, "Time_End": 1337.84, "Text": " than they roll away for these two scenarios."}, {"Time_Start": 1337.84, "Time_End": 1341.84, "Text": " When we look at this against historical data that we have,"}, {"Time_Start": 1341.84, "Time_End": 1347.84, "Text": " and what this is showing is the numbers are showing"}, {"Time_Start": 1347.84, "Time_End": 1352.84, "Text": " the amount of overlap between the various types of attacks"}, {"Time_Start": 1352.84, "Time_End": 1355.84, "Text": " depending on how fine of the"}, {"Time_Start": 1355.84, "Time_End": 1360.84, "Text": " well, I'm not going to get into the great thing."}, {"Time_Start": 1360.84, "Time_End": 1366.84, "Text": " It takes too long to explain right now, but it's showing basically this is showing"}, {"Time_Start": 1366.84, "Time_End": 1372.84, "Text": " how much overlap there is between the various combinations of feature sets."}, {"Time_Start": 1372.84, "Time_End": 1380.84, "Text": " This was taken from the capture the flag data from last year's game."}, {"Time_Start": 1380.84, "Time_End": 1384.84, "Text": " So, let me..."}, {"Time_Start": 1384.84, "Time_End": 1388.84, "Text": " Let me time purposes just skip ahead a bit."}, {"Time_Start": 1392.84, "Time_End": 1401.84, "Text": " As, well, just the stuff I skipped over was just basically explaining that after we determine what are good feature sets,"}, {"Time_Start": 1401.84, "Time_End": 1407.84, "Text": " we've been using a machine learning approach to then classify the events."}, {"Time_Start": 1407.84, "Time_End": 1414.82, "Text": " We feed the various relationships between, and the feature sets, how well they match up on this, on a particular"}, {"Time_Start": 1414.84, "Time_End": 1421.34, "Text": " set of features feeds into a machine learning system using neural nets to try and then"}, {"Time_Start": 1421.34, "Time_End": 1426.04, "Text": " differentiate the events as they come in and separate them off into the various tracks."}, {"Time_Start": 1426.04, "Time_End": 1434.3799999999999, "Text": " As in the multiple hypothesis tracking method, as new events come in, we make all the possible"}, {"Time_Start": 1434.3799999999999, "Time_End": 1438.6999999999998, "Text": " hypothesis of what could have happened and then try to evaluate them to determine which one"}, {"Time_Start": 1438.6999999999998, "Time_End": 1439.54, "Text": " is the most likely."}, {"Time_Start": 1439.54, "Time_End": 1444.82, "Text": " In the brute force approach, the number of hypothesis we have to maintain,"}, {"Time_Start": 1444.84, "Time_End": 1446.84, "Text": " doubles every time we have an event arrive."}, {"Time_Start": 1446.84, "Time_End": 1450.84, "Text": " So it grows very quickly if we don't prune back very aggressively."}, {"Time_Start": 1450.84, "Time_End": 1457.84, "Text": " So in traditional hypothesis tracking, you create all the hypothesis and then"}, {"Time_Start": 1457.84, "Time_End": 1459.84, "Text": " prune away the ones that don't seem very likely."}, {"Time_Start": 1459.84, "Time_End": 1464.84, "Text": " We have to be a little more aggressive in ours where we have a more selective branching,"}, {"Time_Start": 1464.84, "Time_End": 1469.84, "Text": " where if we look at something and it's clearly a winner, if it clearly fits in with a scenario"}, {"Time_Start": 1469.84, "Time_End": 1473.84, "Text": " that already exists, we don't bother branching on other possibilities."}, {"Time_Start": 1473.84, "Time_End": 1477.84, "Text": " possibilities. We just put it in the one we think it is and go on from there."}, {"Time_Start": 1477.84, "Time_End": 1484.3999999999999, "Text": " If there's no clear winner in the, for this particular event, if it's not, if it's not"}, {"Time_Start": 1484.3999999999999, "Time_End": 1488.6999999999998, "Text": " absolutely clear which scenario occurs in, then we branch and maintain this hypothesis"}, {"Time_Start": 1488.6999999999998, "Time_End": 1493.6399999999999, "Text": " for a while until there's more events in them and there's more evidence to try and determine"}, {"Time_Start": 1493.6399999999999, "Time_End": 1499.4399999999998, "Text": " which one is the most likely, which one appears to be the real set of events that occurred."}, {"Time_Start": 1503.84, "Time_End": 1510.84, "Text": " In order to cut down on some of the data and to cut down on the number of hypothesis,"}, {"Time_Start": 1510.84, "Time_End": 1515.84, "Text": " we do some pre-processing where some sequences of events that are simply related are pulled out"}, {"Time_Start": 1515.84, "Time_End": 1518.84, "Text": " and turn into single meta events immediately either."}, {"Time_Start": 1518.84, "Time_End": 1523.84, "Text": " Things like port scans where it's very obvious are all coming from the same place."}, {"Time_Start": 1523.84, "Time_End": 1527.84, "Text": " These are very noisy, you know, they generate lots of events,"}, {"Time_Start": 1527.84, "Time_End": 1533.82, "Text": " would cause the system to get bogged down, but by pulling these out and turning them a number of events"}, {"Time_Start": 1533.8400000000001, "Time_End": 1537.8400000000001, "Text": " into a single event, we reduce some of the computational workload on the system."}, {"Time_Start": 1537.8400000000001, "Time_End": 1543.8400000000001, "Text": " Let me skip this."}, {"Time_Start": 1543.8400000000001, "Time_End": 1550.8400000000001, "Text": " With the, a bit about the testing and evaluation, we've done this on both the data collected"}, {"Time_Start": 1550.8400000000001, "Time_End": 1556.8400000000001, "Text": " from the Thayer and ISTS networks that we have light data on and from some of the DefCon"}, {"Time_Start": 1556.8400000000001, "Time_End": 1558.8400000000001, "Text": " data sets over the past few years."}, {"Time_Start": 1558.8400000000001, "Time_End": 1563.8200000000002, "Text": " On these, we use the Thayer sets."}, {"Time_Start": 1563.8400000000001, "Time_End": 1570.8400000000001, "Text": " earlier with the probability distribution method and now the machine learning approach is when applied to the DEFCOM data sets."}, {"Time_Start": 1570.8400000000001, "Time_End": 1577.8400000000001, "Text": " On the third data, we had a set of data had about 1,500 events."}, {"Time_Start": 1577.8400000000001, "Time_End": 1582.8400000000001, "Text": " These are actual intrusion sensor, intrusion texture system, the notes on here."}, {"Time_Start": 1582.8400000000001, "Time_End": 1587.8400000000001, "Text": " They consisted of about 20 scenarios and a bunch, about 50% of the events."}, {"Time_Start": 1587.8400000000001, "Time_End": 1592.8400000000001, "Text": " We're all similar events unrelated to other things going on."}, {"Time_Start": 1592.8400000000001, "Time_End": 1599.8400000000001, "Text": " When we, this chart shows the accuracy of the system and placing events into scenarios"}, {"Time_Start": 1599.8400000000001, "Time_End": 1604.8400000000001, "Text": " based on the number of hypotheses the system is allowed to maintain."}, {"Time_Start": 1604.8400000000001, "Time_End": 1609.8400000000001, "Text": " When we had a very low number of hypotheses, it doesn't do very well because it's,"}, {"Time_Start": 1609.8400000000001, "Time_End": 1615.8400000000001, "Text": " you're not looking as many possibilities, as many possibilities."}, {"Time_Start": 1615.8400000000001, "Time_End": 1622.8200000000002, "Text": " So if a mistake is made in the hypothesis early on, it's corrupted and it's corrupted and it's"}, {"Time_Start": 1622.8400000000001, "Time_End": 1640.8400000000001, "Text": " not going to give you, you're not going to have the right, when you make the limited number of hypotheses, if the correct one isn't in the set that you decide to keep and promote on to the next generation for future evaluation, it's going to be corrected forever and you're never going to get the right answer out of this."}, {"Time_Start": 1640.8400000000001, "Time_End": 1651.8400000000001, "Text": " So as we let the number of hypotheses grow, we got up to about, it was about an 89% accuracy on placing events and scenarios with the third set."}, {"Time_Start": 1651.8400000000001, "Time_End": 1658.8400000000001, "Text": " On the DEFCON set, this is a, from the DEFCOM 9, capture the flag, which was interesting."}, {"Time_Start": 1658.8400000000001, "Time_End": 1665.8400000000001, "Text": " Last year at DEFCOM, they changed the way the data was collected a little bit,"}, {"Time_Start": 1665.8400000000001, "Time_End": 1669.8400000000001, "Text": " and that it was collected from multiple points on the network, which was more interesting from us,"}, {"Time_Start": 1669.8400000000001, "Time_End": 1674.8400000000001, "Text": " because that gave us essentially different IDS to try and correlate events in between."}, {"Time_Start": 1674.8400000000001, "Time_End": 1681.8200000000002, "Text": " On this one, and this is using the machine learning approach, it's a little, it's less stable earlier on,"}, {"Time_Start": 1681.8400000000001, "Time_End": 1689.66, "Text": " But eventually we got up to about a 95% accuracy with enough hypotheses allowed to maintain."}, {"Time_Start": 1690.92, "Time_End": 1698.96, "Text": " One issue with this is this shows the number, this is based on evaluating how many of the actual events in the scenario did it get."}, {"Time_Start": 1699.7, "Time_End": 1706.5800000000002, "Text": " A lot of the hypotheses also had extra garbage events in them, but that's something that we're, well, it's an area for improvement."}, {"Time_Start": 1706.5800000000002, "Time_End": 1711.5200000000002, "Text": " It's something we're not that concerned with right now because if we can pull out the scenarios and the actual"}, {"Time_Start": 1711.52, "Time_End": 1714.52, "Text": " sequences of events that are related and put those together."}, {"Time_Start": 1714.52, "Time_End": 1721.52, "Text": " Even if there's some noise in those, it still creates a much clearer picture than what we had prior to that."}, {"Time_Start": 1721.52, "Time_End": 1731.52, "Text": " So, just give a quick summary here."}, {"Time_Start": 1731.52, "Time_End": 1737.52, "Text": " What we're doing with this is reorganizing data that's out there."}, {"Time_Start": 1737.52, "Time_End": 1740.52, "Text": " We're trying to look at what's already being generated and make better use of it."}, {"Time_Start": 1740.52, "Time_End": 1744.52, "Text": " of it, make the job of the system analyst a bit easier."}, {"Time_Start": 1744.52, "Time_End": 1753.52, "Text": " Provide a higher level view, kind of a, kind of like the overhead view, to see what's going on on each network,"}, {"Time_Start": 1753.52, "Time_End": 1760.52, "Text": " see what each attacker is trying to do across multiple networks, reduce the work and security analysts,"}, {"Time_Start": 1760.52, "Time_End": 1768.52, "Text": " and through the application of some techniques out of radar tracking systems."}, {"Time_Start": 1768.52, "Time_End": 1770.52, "Text": " systems."}, {"Time_Start": 1770.52, "Time_End": 1775.76, "Text": " Some of the future and now current work as well on this is to incorporate a wide-of-the-vali"}, {"Time_Start": 1775.76, "Time_End": 1782.12, "Text": " sensor, some more host-based IDS system logs, things such as that, to try and get multiple views"}, {"Time_Start": 1782.12, "Time_End": 1787.16, "Text": " of the same sort of attacks and help try and reduce the false positive rate on the system,"}, {"Time_Start": 1787.16, "Time_End": 1793.44, "Text": " that if you can correlate what your network IDS is telling you is an attack that's out there on the"}, {"Time_Start": 1793.44, "Time_End": 1798.32, "Text": " wire with what the hosts are actually seeing on themselves, to know whether it was actually a"}, {"Time_Start": 1798.32, "Time_End": 1802.32, "Text": " successful attack or not, whether it's something that you need to be worried about or not."}, {"Time_Start": 1802.32, "Time_End": 1805.32, "Text": " And also, innovation with other network analysis tools."}, {"Time_Start": 1805.32, "Time_End": 1811.32, "Text": " And also we're interested in incorporating this with a few other of the projects out at ISTS."}, {"Time_Start": 1811.32, "Time_End": 1820.32, "Text": " One of these is a, the distributed ICMP backscatter, which this is a system where they've"}, {"Time_Start": 1820.32, "Time_End": 1827.32, "Text": " modified the kernels and certain routers to, to, you know, we've modified the kernels and certain routers to,"}, {"Time_Start": 1827.32, "Time_End": 1836.6599999999999, "Text": " to report back to a central logging facility when they're seeing large amounts of ICMP data"}, {"Time_Start": 1836.6599999999999, "Time_End": 1841.06, "Text": " air packets coming back through them that would be seen when you have a worm that's going"}, {"Time_Start": 1841.06, "Time_End": 1847.3999999999999, "Text": " out there and scanning large portions of the internet and hitting many places, trying to scan"}, {"Time_Start": 1847.3999999999999, "Time_End": 1854.1599999999999, "Text": " for many hosts that don't actually exist out there, you get this sort of this flood of ICMP traffic"}, {"Time_Start": 1854.1599999999999, "Time_End": 1857.08, "Text": " coming back to the source of the source."}, {"Time_Start": 1857.32, "Time_End": 1858.56, "Text": " of the scan."}, {"Time_Start": 1858.56, "Time_End": 1864.52, "Text": " And by looking at this over on a wide scale and try and correlate this from many areas,"}, {"Time_Start": 1864.52, "Time_End": 1871.32, "Text": " we hope to try and sort of pinpoint where the worm is coming from very early on in its scanning stages."}, {"Time_Start": 1871.32, "Time_End": 1880.04, "Text": " Another thing is in the BGP border gateway protocol routing analysis, we're looking at the information"}, {"Time_Start": 1880.04, "Time_End": 1886.8799999999999, "Text": " being passed back and forth by the border gateways, where they, as they propagate their known"}, {"Time_Start": 1886.88, "Time_End": 1893.88, "Text": " routes around the system that we're gathering information from these scattered around the world"}, {"Time_Start": 1893.88, "Time_End": 1898.5800000000002, "Text": " and trying to determine when certain systems are being routed around when there are problems in certain"}, {"Time_Start": 1898.5800000000002, "Time_End": 1904.88, "Text": " parts of the internet to try and identify it by the updates to the routing tables."}, {"Time_Start": 1904.88, "Time_End": 1910.38, "Text": " And of course, as always, you know, larger scale of implementation and address all the scaling"}, {"Time_Start": 1910.38, "Time_End": 1915.88, "Text": " and timing communications issues that would occur with that."}, {"Time_Start": 1915.88, "Time_End": 1918.74, "Text": " So that about does it."}, {"Time_Start": 1919.0200000000002, "Time_End": 1926.0600000000002, "Text": " So if there's any questions now, I can't hear you."}, {"Time_Start": 1926.0600000000002, "Time_End": 1932.2600000000002, "Text": " Okay, the question was, how do I get a copy?"}, {"Time_Start": 1932.96, "Time_End": 1943.3000000000002, "Text": " And, well, it's not available right now, but it, within the next few months, we're hoping the next few months,"}, {"Time_Start": 1943.3000000000002, "Time_End": 1945.8600000000001, "Text": " we're hoping to have something that's up and available right now."}, {"Time_Start": 1945.88, "Time_End": 1952.88, "Text": " and it'll be at www.ishts.d Dartmouth.edu."}, {"Time_Start": 1952.88, "Time_End": 1963.88, "Text": " This, I think there's a bit of information about this, it's in the version of the top that's on the CD that you were given about the location."}, {"Time_Start": 1963.88, "Time_End": 1967.88, "Text": " I saw some other question."}, {"Time_Start": 1967.88, "Time_End": 1970.88, "Text": " Maybe it was the same question."}, {"Time_Start": 1970.88, "Time_End": 1971.88, "Text": " Yes."}, {"Time_Start": 1975.88, "Time_End": 1990.88, "Text": " The question was in the DEFCON analysis, if we used what the guys from Lincoln Lotz provided as the correct set of scenarios to evaluate ours against."}, {"Time_Start": 1990.88, "Time_End": 1997.88, "Text": " We did that with what they did, which was that two and a half hour time slides as a starting point."}, {"Time_Start": 1997.88, "Time_End": 2002.88, "Text": " Actually, what was shown in the graph here was actually from DEF CON, that was from two years ago."}, {"Time_Start": 2002.88, "Time_End": 2005.8600000000001, "Text": " From last year, we went through and had"}, {"Time_Start": 2005.88, "Time_End": 2008.5800000000002, "Text": " and did sections of it by ourselves."}, {"Time_Start": 2008.5800000000002, "Time_End": 2015.88, "Text": " We classified the, we took the data from the capture flight game last year and went through it by hand,"}, {"Time_Start": 2015.88, "Time_End": 2023.88, "Text": " like the guys that Lincoln Labs did, and made our own judgments as to what we think it was the correct scenario."}, {"Time_Start": 2027.88, "Time_End": 2028.88, "Text": " Answer?"}, {"Time_Start": 2028.88, "Time_End": 2034.88, "Text": " The question was, how does the system deal with data set poisoning?"}, {"Time_Start": 2034.88, "Time_End": 2038.88, "Text": " And that was something that we haven't really,"}, {"Time_Start": 2038.88, "Time_End": 2040.88, "Text": " that was something we haven't really addressed yet."}, {"Time_Start": 2040.88, "Time_End": 2047.88, "Text": " But certainly, if you know that this thing is out there looking at what you're doing,"}, {"Time_Start": 2047.88, "Time_End": 2056.88, "Text": " you could, you could damage its evaluation by giving a lot of garbage data out there."}, {"Time_Start": 2056.88, "Time_End": 2064.88, "Text": " But in a lot of cases, the sort of traditional methods of trying to cause that sort of garbage data,"}, {"Time_Start": 2064.88, "Time_End": 2066.88, "Text": " and to create a lot of noise."}, {"Time_Start": 2066.88, "Time_End": 2070.88, "Text": " Or one of the things that this tries to correlate and pull out of the system."}, {"Time_Start": 2070.88, "Time_End": 2077.88, "Text": " So it's, I wouldn't go as far to say that it's safe or does well against that"}, {"Time_Start": 2077.88, "Time_End": 2079.88, "Text": " because we didn't really test it against that."}, {"Time_Start": 2079.88, "Time_End": 2084.88, "Text": " But it's, it's, by the nature of the system, it should be able to handle that,"}, {"Time_Start": 2084.88, "Time_End": 2089.88, "Text": " at least with some, perhaps some modification from how it operates now."}, {"Time_Start": 2089.88, "Time_End": 2090.88, "Text": " Yes."}, {"Time_Start": 2094.88, "Time_End": 2099.88, "Text": " Yes, the question is, is the traffic capture from the Capture the Flag available?"}, {"Time_Start": 2099.88, "Time_End": 2105.88, "Text": " And it is, it's the Schmoo Group, which is, www."}, {"Time_Start": 2105.88, "Time_End": 2111.88, "Text": " S-H-M-O-O-O, and I think it's the .org, but it might be .com, a .org?"}, {"Time_Start": 2111.88, "Time_End": 2112.88, "Text": " Yeah, dot-org."}, {"Time_Start": 2112.88, "Time_End": 2115.88, "Text": " And they've made the Capture the Flag data."}, {"Time_Start": 2115.88, "Time_End": 2119.88, "Text": " They record the raw network data off the Capture the Flag Game,"}, {"Time_Start": 2119.88, "Time_End": 2121.88, "Text": " and it's a lot of data."}, {"Time_Start": 2121.88, "Time_End": 2123.88, "Text": " But they make it publicly available for research purposes."}, {"Time_Start": 2123.88, "Time_End": 2124.88, "Text": " for research purposes."}, {"Time_Start": 2136.88, "Time_End": 2138.88, "Text": " The question was, do we take into account sensors running"}, {"Time_Start": 2138.88, "Time_End": 2141.88, "Text": " into account sensors running different"}, {"Time_Start": 2141.88, "Time_End": 2147.88, "Text": " policies on them, and how does that affect what we're seeing?"}, {"Time_Start": 2147.88, "Time_End": 2152.88, "Text": " But that's taken into effect in the sensor modeling stage that"}, {"Time_Start": 2152.88, "Time_End": 2159.88, "Text": " that there's a part we talked about if, when you're looking like, say it's a signature base in IDS,"}, {"Time_Start": 2159.88, "Time_End": 2167.88, "Text": " that its probability of detecting something is based on, one, what it's looking for in the area that it looks in."}, {"Time_Start": 2167.88, "Time_End": 2176.88, "Text": " And basically, what it's looking for is directly correlated to how you have it configured."}, {"Time_Start": 2176.88, "Time_End": 2179.88, "Text": " So that is taken into account there."}, {"Time_Start": 2179.88, "Time_End": 2181.88, "Text": " And it's mainly..."}, {"Time_Start": 2181.88, "Time_End": 2186.88, "Text": " Mainly, it's important to kind of know what you're not looking for."}, {"Time_Start": 2186.88, "Time_End": 2193.88, "Text": " So if something's missing in the scenario, it can be explained away as not being seen,"}, {"Time_Start": 2193.88, "Time_End": 2198.88, "Text": " because we should have seen it, but the reason we didn't see it is because we weren't looking for it."}, {"Time_Start": 2198.88, "Time_End": 2206.88, "Text": " The question was, what's the minimum number of events is the sequence that it takes to accurate correlation?"}, {"Time_Start": 2206.88, "Time_End": 2210.88, "Text": " The question was, what's the minimum number of sequences in event it takes to accurate correlation?"}, {"Time_Start": 2210.88, "Time_End": 2218.88, "Text": " or accurate correlation, and that's very dependent on what the sequence is, what type of attack it is."}, {"Time_Start": 2218.88, "Time_End": 2228.88, "Text": " With certain types of attacks, when you have, if you have, it's highly dependent on that,"}, {"Time_Start": 2228.88, "Time_End": 2236.88, "Text": " that it's something like when you see a recon coming in and then attacks that are going after what was reconed,"}, {"Time_Start": 2236.88, "Time_End": 2239.88, "Text": " it doesn't, it doesn't take much because they're very similar on a lot."}, {"Time_Start": 2239.88, "Time_End": 2241.88, "Text": " similar on a lot of feature sets."}, {"Time_Start": 2241.88, "Time_End": 2245.88, "Text": " The things that are a little more out there and separated,"}, {"Time_Start": 2245.88, "Time_End": 2255.88, "Text": " it gets more difficult quickly and it's a really hard thing to answer because it depends on"}, {"Time_Start": 2255.88, "Time_End": 2262.88, "Text": " with the type of attack how many, what's kind of like the event rate of the attack,"}, {"Time_Start": 2262.88, "Time_End": 2264.88, "Text": " things like scans, high events."}, {"Time_Start": 2264.88, "Time_End": 2269.86, "Text": " If it's just a single buffed overflow attack sort of coming in and then not much else"}, {"Time_Start": 2269.88, "Time_End": 2276.88, "Text": " happening, oftentimes there's not enough information in that to do accurate correlation."}, {"Time_Start": 2280.88, "Time_End": 2285.88, "Text": " Well, I think if that's about it, it looks like it's all about 2 o'clock."}]}