{"segments": [{"Time_Start": 0.0, "Time_End": 5.0, "Text": " Start and end of my talk."}, {"Time_Start": 5.0, "Time_End": 11.0, "Text": " The next session in here, this is the parking lot tent in case you're confused, will be gobbles, the wolves among us."}, {"Time_Start": 11.0, "Time_End": 16.0, "Text": " Right now you're here for selling out for fun and profit."}, {"Time_Start": 21.0, "Time_End": 25.0, "Text": " Before I even get started, I'm coming back to MMRC."}, {"Time_Start": 25.0, "Time_End": 27.0, "Text": " I want to have a little disclaimer here."}, {"Time_Start": 27.0, "Time_End": 29.0, "Text": " I'm not coming up here to stir any shit pots."}, {"Time_Start": 29.0, "Time_End": 33.0, "Text": " shitpots. I've got kind of here to piss anyone off."}, {"Time_Start": 33.0, "Time_End": 37.0, "Text": " For any of you that are here to hear me bitch about security focus,"}, {"Time_Start": 37.0, "Time_End": 40.0, "Text": " you can probably leave now because that's not going to happen."}, {"Time_Start": 40.0, "Time_End": 43.0, "Text": " This talk was kind of thought up and during it before all that happened,"}, {"Time_Start": 43.0, "Time_End": 45.0, "Text": " and I've got my own opinions on that anyways."}, {"Time_Start": 45.0, "Time_End": 47.0, "Text": " I don't necessarily consider them to be selling out."}, {"Time_Start": 47.0, "Time_End": 50.0, "Text": " You know, they've always been a business, and they sold their business."}, {"Time_Start": 50.0, "Time_End": 52.0, "Text": " You know, that can't really be selling out."}, {"Time_Start": 54.0, "Time_End": 57.0, "Text": " So as I said, I'm Helen back from NMRC,"}, {"Time_Start": 57.0, "Time_End": 59.0, "Text": " and as some of you also know,"}, {"Time_Start": 59.0, "Time_End": 64.12, "Text": " During the day, I'm Steve Manzik, moderator of phone watch, among a few other things."}, {"Time_Start": 64.92, "Time_End": 74.0, "Text": " The whole reason I've had the NMRC handle, basically I used to work for We Don't Hire Hackers-type companies like IBM and Ernest and Young,"}, {"Time_Start": 74.0, "Time_End": 79.24000000000001, "Text": " so having the handle is a nice place to hide when I would do my recreational stuff."}, {"Time_Start": 80.18, "Time_End": 83.56, "Text": " As far as what I do for NMRC, it's actually pretty fun."}, {"Time_Start": 84.03999999999999, "Time_End": 88.98, "Text": " Right now I get to wash Nomad's car, Moa's Lawn, you know, that kind of cool stuff."}, {"Time_Start": 89.0, "Time_End": 94.5, "Text": " He says if I drop about 100 pounds, I can be his cool boy next year, so I'm..."}, {"Time_Start": 94.5, "Time_End": 95.82, "Text": " I've got a goal to work for, right?"}, {"Time_Start": 99.9, "Time_End": 105.0, "Text": " Okay, this talk I'm basing on that this is why people hack, okay?"}, {"Time_Start": 109.0, "Time_End": 115.0, "Text": " Traditionally hackers, at least, you know, my idea of it, have hacked to gain knowledge, to get into stuff that, you know,"}, {"Time_Start": 115.0, "Time_End": 118.92, "Text": " maybe you shouldn't be into, but no one else can get into, you know, that's always kind of cool."}, {"Time_Start": 119.0, "Time_End": 122.08, "Text": " And, of course, lately, right, everyone wants to be an internet rock star, right?"}, {"Time_Start": 122.16, "Time_End": 126.56, "Text": " You know, it's kind of cool to, you know, go places and everyone knows who you are just based on your hacking."}, {"Time_Start": 129.64, "Time_End": 132.14, "Text": " Here's a post that addresses selling out."}, {"Time_Start": 132.64, "Time_End": 135.4, "Text": " This was posted by a guy by the name of Haiku Hacker."}, {"Time_Start": 135.7, "Time_End": 137.5, "Text": " Not sure if he was here for the con or not."}, {"Time_Start": 137.94, "Time_End": 139.86, "Text": " This was on the full disclosure mailing list."}, {"Time_Start": 140.3, "Time_End": 142.14, "Text": " It was directed at a specific person."}, {"Time_Start": 142.26, "Time_End": 145.54, "Text": " I won't go into that, but there's a bit of a little flame word going on."}, {"Time_Start": 146.3, "Time_End": 148.98, "Text": " Essentially, he was saying that, you know, selling out's a bad thing, and,"}, {"Time_Start": 149.0, "Time_End": 153.74, "Text": " And, you know, all of us bastards that do it are, you know, horrible people because we're, you know,"}, {"Time_Start": 153.8, "Time_End": 159.02, "Text": " exploiting the true hackers of the world by taking their research and their tools and making"}, {"Time_Start": 159.02, "Time_End": 159.64, "Text": " money off it."}, {"Time_Start": 162.12, "Time_End": 167.28, "Text": " And we have another quote, which illustrates probably the other side of the argument, from someone"}, {"Time_Start": 167.28, "Time_End": 168.76, "Text": " that's probably fairly well known."}, {"Time_Start": 172.9, "Time_End": 177.38, "Text": " And just to get out of the way, I'm a bit biased, I actually do fall into this category of people."}, {"Time_Start": 177.38, "Time_End": 181.06, "Text": " because, you know, if someone wants to accuse me that, that's fine, I sell out."}, {"Time_Start": 181.32, "Time_End": 182.35999999999999, "Text": " I am a security consultant."}, {"Time_Start": 182.48, "Time_End": 183.44, "Text": " That's what I do for a living."}, {"Time_Start": 184.14, "Time_End": 184.88, "Text": " Oh, wow, right?"}, {"Time_Start": 187.01999999999998, "Time_End": 193.72, "Text": " What I am going to do today, I'm just going to go through some examples of different so-called"}, {"Time_Start": 193.72, "Time_End": 198.54, "Text": " sellouts, you know, how they did it, the wrong way to try and sell out, and, you know,"}, {"Time_Start": 198.56, "Time_End": 202.54, "Text": " probably some better ways to sell out and actually still hang on to, you know, what little dignity"}, {"Time_Start": 202.54, "Time_End": 203.14, "Text": " you may have."}, {"Time_Start": 205.78, "Time_End": 207.35999999999999, "Text": " The whole media hiring."}, {"Time_Start": 207.38, "Time_End": 213.1, "Text": " thing. You know, there's a talk done by Guides at H2K2, where, you know, he basically said"}, {"Time_Start": 213.1, "Time_End": 217.6, "Text": " that bug track is a tool now for people to get famous and get good jobs. I think he even, you know,"}, {"Time_Start": 217.6, "Time_End": 221.57999999999998, "Text": " said that certistic works from Microsoft, which was probably one of the best jokes I heard this year"}, {"Time_Start": 221.57999999999998, "Time_End": 227.48, "Text": " anyways. You know, and he was going on about, you know, how vendors use FUD and, you know, blah, blah,"}, {"Time_Start": 227.68, "Time_End": 233.14, "Text": " blah, which, you know, some of the stuff he said, he did have a point, you know, especially the FUD thing"}, {"Time_Start": 233.14, "Time_End": 236.24, "Text": " and the media-horring thing. You know, we see that all over the place."}, {"Time_Start": 237.38, "Time_End": 241.1, "Text": " So that's one I'm going through is, you know, just some specific examples of, actually,"}, {"Time_Start": 241.1, "Time_End": 245.78, "Text": " I think I have three, an example of someone who you can consider, you know, a hacker slash"}, {"Time_Start": 245.78, "Time_End": 254.56, "Text": " script kitty, a security vendor, and then just a generic example. So this is my first case study."}, {"Time_Start": 255.48, "Time_End": 259.46, "Text": " Robert Little, pimches. Don't know if you're here, don't rush the stage or anything. You can talk"}, {"Time_Start": 259.46, "Time_End": 266.52, "Text": " to me later if you got a problem. So how do you sell out in this case? You know, you pick something"}, {"Time_Start": 266.52, "Time_End": 272.28, "Text": " that everyone is worried about, say, oh, Napster being shut down by RIA, start to face"}, {"Time_Start": 272.28, "Time_End": 278.79999999999995, "Text": " in a few websites in support of Napster, but be sure to leave your email address behind so"}, {"Time_Start": 278.79999999999995, "Time_End": 283.62, "Text": " then the media can contact you and interview the hell out of you. After you get caught and"}, {"Time_Start": 283.62, "Time_End": 289.32, "Text": " everyone knows who you are, launch a security company. Business might be a little slow, so start"}, {"Time_Start": 289.32, "Time_End": 294.18, "Text": " again, pick a new issue, maybe, I don't know, terrorism or something like that, and start"}, {"Time_Start": 294.18, "Time_End": 299.92, "Text": " nailing websites again, hoping to generate business. Probably not the smartest way to do things."}, {"Time_Start": 303.0, "Time_End": 309.90000000000003, "Text": " My next case study is just basically security vendors in general, and this one I am a bit biased. I did"}, {"Time_Start": 309.90000000000003, "Time_End": 314.94, "Text": " at one point in my career to work for BindView Razor, so I'm not necessarily saying this is a bad thing."}, {"Time_Start": 315.36, "Time_End": 319.14, "Text": " There are some areas where security vendors do definitely go wrong, though."}, {"Time_Start": 321.42, "Time_End": 324.16, "Text": " So the basic premise behind, you know, we've got our next question."}, {"Time_Start": 324.18, "Time_End": 330.74, "Text": " We've got a razor, we've got, I don't know, probably another dozen or so vendor research groups."}, {"Time_Start": 331.24, "Time_End": 338.02, "Text": " You know, they'll go and they'll hire as many big name, you know, black hat, white hats, you know, if you're smart, you know, that kind of stuff."}, {"Time_Start": 338.06, "Time_End": 339.6, "Text": " They'll go and hire as many of those guys as they can."}, {"Time_Start": 340.98, "Time_End": 343.68, "Text": " Then they'll just start pumping out as many advisories as they can."}, {"Time_Start": 343.98, "Time_End": 348.44, "Text": " And, of course, in those advisories, you've got all the web links and, you know, all that stuff for their products."}, {"Time_Start": 348.7, "Time_End": 350.5, "Text": " That's not necessarily a bad thing, really."}, {"Time_Start": 351.44, "Time_End": 354.16, "Text": " Where they seem to go wrong is when they seem to go wrong is when they say."}, {"Time_Start": 354.18, "Time_End": 359.56, "Text": " start putting press releases and PR in front of actual research and working with vendors."}, {"Time_Start": 360.06, "Time_End": 364.92, "Text": " We've seen cases of that. You know, we can use X-Forces Apache thing. You know, I know there's two sides"}, {"Time_Start": 364.92, "Time_End": 370.24, "Text": " to that argument as well, but the bottom line is they didn't work with Apache. You know, they rush an advisory out."}, {"Time_Start": 370.32, "Time_End": 373.42, "Text": " Some say they did it for the marketing. I would tend to agree with that."}, {"Time_Start": 377.0, "Time_End": 384.16, "Text": " I'm going to go faster. So I'm calling this one a better way to sell out. I would say it's a better way, but I figure"}, {"Time_Start": 384.18, "Time_End": 389.32, "Text": " this is probably the way, if you are going to sell out, you should do it because there's a lot of good reasons to sell out."}, {"Time_Start": 389.72, "Time_End": 390.78000000000003, "Text": " You know, a job is one of them."}, {"Time_Start": 391.1, "Time_End": 395.98, "Text": " You know, I'd definitely rather be working in security than flipping burgers for, you know, eight bucks an hour."}, {"Time_Start": 399.58, "Time_End": 401.06, "Text": " So probably the good way to do it."}, {"Time_Start": 401.58, "Time_End": 403.2, "Text": " You know, just do what you already do."}, {"Time_Start": 403.28000000000003, "Time_End": 405.44, "Text": " Go out, do your advisories, publish white papers."}, {"Time_Start": 406.52, "Time_End": 408.54, "Text": " You know, don't get caught doing anything wrong."}, {"Time_Start": 408.54, "Time_End": 410.42, "Text": " You know, don't get your criminal record."}, {"Time_Start": 410.9, "Time_End": 413.98, "Text": " You know, we can all remember the case a while back."}, {"Time_Start": 414.18, "Time_End": 417.6, "Text": " I remember the guy's name, but he was trying to get a job with one of the new boutique firms,"}, {"Time_Start": 417.72, "Time_End": 421.18, "Text": " and they turned him down when they found he had a record, and so, of course, he went to the press,"}, {"Time_Start": 421.28000000000003, "Time_End": 421.98, "Text": " pitching about that."}, {"Time_Start": 422.08, "Time_End": 423.88, "Text": " But really, you know, what do you expect, dude?"}, {"Time_Start": 423.94, "Time_End": 425.06, "Text": " You know, they do a background check."}, {"Time_Start": 425.42, "Time_End": 426.42, "Text": " You've got a criminal record."}, {"Time_Start": 427.26, "Time_End": 431.06, "Text": " None of their clients who also will ask for background checks are going to want to touch you."}, {"Time_Start": 431.72, "Time_End": 433.86, "Text": " You know, that's just kind of common sense there."}, {"Time_Start": 434.66, "Time_End": 439.8, "Text": " You know, and sure, sellout, take your job, you know, make your money, but continue to do what you're doing"}, {"Time_Start": 439.8, "Time_End": 444.06, "Text": " and continue to, you know, support the community and release your tools and release your exploits."}, {"Time_Start": 444.18, "Time_End": 447.14, "Text": " I think that's where the real difference between selling out and not selling out is,"}, {"Time_Start": 447.46, "Time_End": 453.38, "Text": " is, you know, you'll see guys who I would call true sellouts go and try to be something they're not, right?"}, {"Time_Start": 453.42, "Time_End": 456.1, "Text": " They'll all of a sudden go from being, you know, hacker to, what you're talking about."}, {"Time_Start": 456.14, "Time_End": 460.88, "Text": " I don't know what hacking is, you know, and keeping all of their tools and exploits and research to themselves."}, {"Time_Start": 461.42, "Time_End": 463.42, "Text": " You know, sure, you know, you can call those guys sellouts."}, {"Time_Start": 463.72, "Time_End": 469.28000000000003, "Text": " You know, the guys that continue to support the community and continue to, you know, dump their exploits in and things like that,"}, {"Time_Start": 469.64, "Time_End": 471.18, "Text": " I don't consider themselves at all."}, {"Time_Start": 471.24, "Time_End": 473.0, "Text": " They're just using something they're good at to make money."}, {"Time_Start": 473.3, "Time_End": 474.16, "Text": " And really, what's wrong with that?"}, {"Time_Start": 474.18, "Time_End": 482.96, "Text": " The real reason I think, anyways, you know, this is mostly my opinion and probably"}, {"Time_Start": 482.96, "Time_End": 488.74, "Text": " a few other people's opinion, but I think the real reason that we see guys like, you know, me and, you know,"}, {"Time_Start": 488.74, "Time_End": 492.88, "Text": " you can lump the loft guys or all kinds of guys like that into this category being accused"}, {"Time_Start": 492.88, "Time_End": 499.18, "Text": " of being sellouts is we've got groups, you know, like Guides talk, right, and the EL8 guys, I don't"}, {"Time_Start": 499.18, "Time_End": 501.3, "Text": " think the anti-security guys really belong on this slide."}, {"Time_Start": 502.5, "Time_End": 504.16, "Text": " They, uh, they're more."}, {"Time_Start": 504.18, "Time_End": 507.98, "Text": " anti-full disclosure, you know, because they think they're supplying script kitty munitions,"}, {"Time_Start": 508.14, "Time_End": 510.84000000000003, "Text": " then, you know, they are anti-sellout."}, {"Time_Start": 511.62, "Time_End": 517.7, "Text": " But, you know, you've got a lot of guys that don't want guys like us who actually know how to research"}, {"Time_Start": 517.7, "Time_End": 521.98, "Text": " and actually know how to hack, they don't want us to go out and secure networks."}, {"Time_Start": 522.28, "Time_End": 524.16, "Text": " They don't want us to go out release our research."}, {"Time_Start": 524.48, "Time_End": 528.32, "Text": " However, there's zero days going to be effective when they're going up against some guy that can,"}, {"Time_Start": 528.32, "Time_End": 530.12, "Text": " is just as good, if not better than they are."}, {"Time_Start": 534.1800000000001, "Time_End": 539.7800000000001, "Text": " Media, I do want to address the media a little bit because they seem to feed into this whole thing."}, {"Time_Start": 540.6800000000001, "Time_End": 541.0400000000001, "Text": " Hi, Thomas."}, {"Time_Start": 543.24, "Time_End": 548.6600000000001, "Text": " This is a quote that I took off of an email that I had a few others received."}, {"Time_Start": 548.96, "Time_End": 551.3000000000001, "Text": " I'm not attributing it to anybody because it was a private email."}, {"Time_Start": 553.44, "Time_End": 559.2, "Text": " But I think this is probably valid for all media organizations at one time or another."}, {"Time_Start": 559.2, "Time_End": 563.82, "Text": " I think we could probably accuse almost everybody in the media of"}, {"Time_Start": 563.82, "Time_End": 569.9000000000001, "Text": " at one time or the other saying or doing something that they, that was wrong, that they"}, {"Time_Start": 569.9000000000001, "Time_End": 570.5600000000001, "Text": " didn't research."}, {"Time_Start": 571.0, "Time_End": 577.62, "Text": " So I do have a few pointers or guidelines for the media to consider when they're reporting on stories."}, {"Time_Start": 578.4000000000001, "Time_End": 579.5200000000001, "Text": " You got a pen pound on it?"}, {"Time_Start": 582.94, "Time_End": 587.7800000000001, "Text": " The bottom line is, right, is that the media seems to grab what's sexy, what's cool,"}, {"Time_Start": 588.0600000000001, "Time_End": 589.7, "Text": " and they don't like to research it, right?"}, {"Time_Start": 589.7600000000001, "Time_End": 593.8000000000001, "Text": " Like, they'll just go on, oh man, man, this guy just said that, you know, simple, no, that's a"}, {"Time_Start": 593.82, "Time_End": 597.58, "Text": " Fed, quick, get that on the front page, you know, of whatever website."}, {"Time_Start": 598.0, "Time_End": 601.0600000000001, "Text": " You know, and really, you need to, you know, research that kind of stuff."}, {"Time_Start": 605.32, "Time_End": 606.96, "Text": " Sorry, I need to mention Simple Nomad."}, {"Time_Start": 607.12, "Time_End": 607.74, "Text": " He is not a Fed."}, {"Time_Start": 610.7800000000001, "Time_End": 615.0600000000001, "Text": " You know, essentially, you know, this is, I'm not going to sit here and read slides to you guys,"}, {"Time_Start": 615.1400000000001, "Time_End": 620.1400000000001, "Text": " but essentially this is what the media can do or, you know, should be doing."}, {"Time_Start": 620.1400000000001, "Time_End": 621.82, "Text": " And the big thing is don't spread fun."}, {"Time_Start": 622.22, "Time_End": 623.58, "Text": " You know, check your sources."}, {"Time_Start": 623.82, "Time_End": 624.96, "Text": " reveal your sources."}, {"Time_Start": 625.4200000000001, "Time_End": 629.0200000000001, "Text": " You know, there's this thing called anonymous source that, you know, I've been an anonymous source"}, {"Time_Start": 629.0200000000001, "Time_End": 633.6, "Text": " many times that I've had to be, and I know a lot of people probably have, and many media guys"}, {"Time_Start": 633.6, "Time_End": 637.9000000000001, "Text": " are pretty good at protecting their sources and still proving a point or proving their story."}, {"Time_Start": 639.44, "Time_End": 642.0, "Text": " The last one is probably my biggest pet peeve."}, {"Time_Start": 642.32, "Time_End": 646.2600000000001, "Text": " Just because somebody uses a computer to commit a crime doesn't mean they were a hacker."}, {"Time_Start": 646.84, "Time_End": 651.46, "Text": " You know, yet the media, oh my God, you know, there's a palm pilot in this guy's pocket when he robbed"}, {"Time_Start": 651.46, "Time_End": 651.82, "Text": " the bank."}, {"Time_Start": 651.8800000000001, "Time_End": 652.6600000000001, "Text": " He must be a hacker."}, {"Time_Start": 653.82, "Time_End": 654.74, "Text": " It's just getting out of hand."}, {"Time_Start": 659.2800000000001, "Time_End": 664.82, "Text": " I wanted to address hacktivism a little too, and I call it the lone gunman myth."}, {"Time_Start": 665.2600000000001, "Time_End": 668.5400000000001, "Text": " And the reason I say that isn't because I'm against activism."}, {"Time_Start": 668.74, "Time_End": 670.48, "Text": " I'm actually all for it."}, {"Time_Start": 672.32, "Time_End": 675.0400000000001, "Text": " It's just the real problem is, is we're not seeing it yet."}, {"Time_Start": 675.1800000000001, "Time_End": 678.22, "Text": " You know, we're not seeing any real hacktivism yet, at least in the media."}, {"Time_Start": 678.22, "Time_End": 682.5200000000001, "Text": " You know, all we're seeing in the media is website defacements and, you know,"}, {"Time_Start": 682.52, "Time_End": 686.56, "Text": " denial of service attacks and, you know, silly stuff that no one really cares about."}, {"Time_Start": 686.98, "Time_End": 691.66, "Text": " You know, I would probably say that most of the web defecements probably aren't really read by anybody."}, {"Time_Start": 692.56, "Time_End": 695.48, "Text": " And if they are, I don't think they're getting the point across."}, {"Time_Start": 696.4, "Time_End": 702.96, "Text": " I think it would be real cool to, you know, see things like, you know, there have been a few talks this,"}, {"Time_Start": 702.96, "Time_End": 707.04, "Text": " you know, this weekend about hacktivism and some of the things you can do, helping to build tools,"}, {"Time_Start": 707.38, "Time_End": 709.26, "Text": " helping to secure not-for-profit boxes."}, {"Time_Start": 709.86, "Time_End": 712.5, "Text": " You know, why not have, you know, why couldn't someone have hacked into?"}, {"Time_Start": 712.52, "Time_End": 715.0799999999999, "Text": " to Enron a year ago and exposed what they were doing."}, {"Time_Start": 715.5799999999999, "Time_End": 718.04, "Text": " I think a lot of us, or a lot of people, would have saved a lot of money."}, {"Time_Start": 721.42, "Time_End": 723.42, "Text": " Yeah, that slide's basically what I just said."}, {"Time_Start": 723.48, "Time_End": 728.1, "Text": " Anyways, you know, like, we're all sitting around arguing, you know, with the EL8 guys or"}, {"Time_Start": 728.1, "Time_End": 733.16, "Text": " Guides or whoever, when really most of those guys actually, you know, know their stuff"}, {"Time_Start": 733.16, "Time_End": 733.8199999999999, "Text": " and are pretty good."}, {"Time_Start": 734.12, "Time_End": 738.22, "Text": " So instead of sitting here, you know, fighting amongst ourselves, you know, let's, you know,"}, {"Time_Start": 738.22, "Time_End": 742.5, "Text": " let's start doing something, you know, like building the cool tools or helping them off or"}, {"Time_Start": 742.52, "Time_End": 743.52, "Text": " and stuff like that."}, {"Time_Start": 747.52, "Time_End": 749.52, "Text": " I'm going through this pretty quick."}, {"Time_Start": 749.52, "Time_End": 754.52, "Text": " Okay, we're going to go to something that kind of doesn't fit in here at all."}, {"Time_Start": 754.52, "Time_End": 757.52, "Text": " You guys want to..."}, {"Time_Start": 757.52, "Time_End": 760.52, "Text": " You guys all coming up here, are we?"}, {"Time_Start": 760.52, "Time_End": 762.52, "Text": " Yeah, I'll see you guys."}, {"Time_Start": 772.52, "Time_End": 774.52, "Text": " Hello?"}, {"Time_Start": 774.52, "Time_End": 789.52, "Text": " No, just like you're right?"}, {"Time_Start": 789.52, "Time_End": 791.52, "Text": " And of course I went through a presentation way too fast."}, {"Time_Start": 791.52, "Time_End": 793.52, "Text": " We're actually already getting close to the end."}, {"Time_Start": 793.52, "Time_End": 799.52, "Text": " I brought all these guys up because during Black Hat and yesterday during DefCon, we did announce something new."}, {"Time_Start": 799.52, "Time_End": 800.52, "Text": " We did announce something new."}, {"Time_Start": 800.52, "Time_End": 802.52, "Text": " And so I thought, you know, bring these guys up."}, {"Time_Start": 802.52, "Time_End": 804.52, "Text": " to talk about it a little bit as well."}, {"Time_Start": 804.52, "Time_End": 807.52, "Text": " It doesn't really fit with the whole selling out thing."}, {"Time_Start": 810.52, "Time_End": 815.52, "Text": " But essentially what we announced a block hat was the Internetwork Secure Information Services Initiative."}, {"Time_Start": 815.52, "Time_End": 823.52, "Text": " And what that is, is it's going to be an open source, volunteer-supported, centralized information source."}, {"Time_Start": 823.52, "Time_End": 827.52, "Text": " You know, the data is going to be free, not freal."}, {"Time_Start": 827.52, "Time_End": 828.52, "Text": " Oops."}, {"Time_Start": 828.52, "Time_End": 831.52, "Text": " Well, it's probably supposed to be an explanation mark."}, {"Time_Start": 831.52, "Time_End": 833.52, "Text": " supposed to be an explanation mark a little bit."}, {"Time_Start": 833.52, "Time_End": 838.52, "Text": " And, you know, we announced a new discussion list called Fallen Discuss."}, {"Time_Start": 838.52, "Time_End": 844.52, "Text": " As far as volunteers involved with ISIS, we have the guys from Pakistan Storm, who you see a lot of them up here,"}, {"Time_Start": 844.52, "Time_End": 852.52, "Text": " and the open source vulnerability database project, which Sharle is going to say a couple words about."}, {"Time_Start": 852.52, "Time_End": 854.52, "Text": " Hello?"}, {"Time_Start": 854.52, "Time_End": 859.52, "Text": " Hi, everyone, I'm Schall, I'm from Saints Post."}, {"Time_Start": 859.52, "Time_End": 860.52, "Text": " I was also just to say a few words about."}, {"Time_Start": 860.52, "Time_End": 865.52, "Text": " us just to say a few words about the open source vulnerability database project."}, {"Time_Start": 865.52, "Time_End": 869.52, "Text": " Basically what happened is the guys from Digital Defense and some of the guys from SensePost."}, {"Time_Start": 869.52, "Time_End": 875.52, "Text": " We've been building databases of known vulnerabilities essentially based on the NES signature IDs"}, {"Time_Start": 875.52, "Time_End": 877.52, "Text": " over the last few years."}, {"Time_Start": 877.52, "Time_End": 882.52, "Text": " And Digital Defense and SensePost have come together to launch a project together with these guys"}, {"Time_Start": 882.52, "Time_End": 884.52, "Text": " to make that database publicly available."}, {"Time_Start": 884.52, "Time_End": 889.52, "Text": " So we'll be moving it off our infrastructure into public domain."}, {"Time_Start": 889.52, "Time_End": 890.52, "Text": " It will be run under the trust."}, {"Time_Start": 890.52, "Time_End": 892.52, "Text": " charter of the rest of the project."}, {"Time_Start": 892.52, "Time_End": 895.52, "Text": " So it's going to be completely open source, completely free."}, {"Time_Start": 895.52, "Time_End": 898.52, "Text": " It will be moderated, so it's not a discussion list."}, {"Time_Start": 898.52, "Time_End": 903.52, "Text": " It's an idea is to have a high quality database of really accurate, up-to-date information."}, {"Time_Start": 903.52, "Time_End": 907.52, "Text": " And what we'll be doing is we'll be making it available in such a way that you can do complete,"}, {"Time_Start": 907.52, "Time_End": 910.52, "Text": " probably CVS dumps of the database."}, {"Time_Start": 910.52, "Time_End": 916.52, "Text": " So anybody who wants access to it, you'll be able to connect to the service and pull the whole thing down."}, {"Time_Start": 916.52, "Time_End": 919.52, "Text": " So that's pretty much it."}, {"Time_Start": 919.52, "Time_End": 923.52, "Text": " visit the website, maybe just a quick note on where we are."}, {"Time_Start": 923.52, "Time_End": 925.52, "Text": " The website is up."}, {"Time_Start": 925.52, "Time_End": 930.52, "Text": " We're busy forming, call it the coalition and establishing the charter and stuff like that."}, {"Time_Start": 930.52, "Time_End": 934.52, "Text": " We're also busy finalizing the technical details of the database structure,"}, {"Time_Start": 934.52, "Time_End": 937.52, "Text": " exactly how we're going to murder it, how we're going to push the data down."}, {"Time_Start": 937.52, "Time_End": 940.52, "Text": " And as soon as we do that, we'll go live with the data."}, {"Time_Start": 940.52, "Time_End": 947.52, "Text": " And we expect to have a database in the region, I think, for about a thousand or so entries when we start."}, {"Time_Start": 947.52, "Time_End": 948.52, "Text": " So there's going to be a lot of good stuff there."}, {"Time_Start": 948.52, "Time_End": 954.52, "Text": " good stuff there. And the rest of it really depend on you guys. So drop in, visit the site,"}, {"Time_Start": 954.52, "Time_End": 957.52, "Text": " and support us in what we're doing."}, {"Time_Start": 957.52, "Time_End": 959.52, "Text": " Thanks."}, {"Time_Start": 959.52, "Time_End": 971.52, "Text": " So I just realized I blew through my entire talk in about 20 minutes."}, {"Time_Start": 971.52, "Time_End": 976.52, "Text": " So I'll probably win an award for the worst talk at DevCon, but that's cool."}, {"Time_Start": 976.52, "Time_End": 983.52, "Text": " They do have gobbles coming up next to do is Wolves Among Us talk."}, {"Time_Start": 983.52, "Time_End": 989.52, "Text": " My talk's not really geared too much for questions, probably geared more for flames."}, {"Time_Start": 989.52, "Time_End": 993.52, "Text": " Yeah."}, {"Time_Start": 993.52, "Time_End": 996.52, "Text": " And actually that's one thing that these guys missed to cover."}, {"Time_Start": 996.52, "Time_End": 1002.52, "Text": " The ISIS project is looking for volunteers, especially if you have a vulnerability database"}, {"Time_Start": 1002.52, "Time_End": 1005.52, "Text": " laying around somewhere that you don't want or you'd like to release to everybody."}, {"Time_Start": 1005.52, "Time_End": 1012.52, "Text": " to everybody. Since Post and Digital Defense already donated a couple. I think there's something like over 1,000 records. Is that right, guys in there?"}, {"Time_Start": 1012.52, "Time_End": 1015.52, "Text": " But hey, the more help, the better."}, {"Time_Start": 1015.52, "Time_End": 1018.52, "Text": " Um, um..."}, {"Time_Start": 1018.52, "Time_End": 1021.52, "Text": " Oh, I don't know."}, {"Time_Start": 1021.52, "Time_End": 1026.52, "Text": " Ah, crap. Um, I really didn't want to have to go up here and talk."}, {"Time_Start": 1026.52, "Time_End": 1032.52, "Text": " Um, we at Packetstone, all the Packetstone guys, you know, raise your hands and wave at the crowd."}, {"Time_Start": 1032.52, "Time_End": 1034.52, "Text": " Say hi. That's Christian."}, {"Time_Start": 1034.52, "Time_End": 1037.52, "Text": " That's Christian and Alan and I'm Emerson."}, {"Time_Start": 1037.52, "Time_End": 1045.52, "Text": " At the moment what we're trying to do is we have a whole bunch of files which don't have descriptions."}, {"Time_Start": 1045.52, "Time_End": 1048.52, "Text": " There are a few, more than just a few files."}, {"Time_Start": 1048.52, "Time_End": 1053.52, "Text": " There are a few thousand files that don't have descriptions, the old stuff."}, {"Time_Start": 1053.52, "Time_End": 1056.52, "Text": " And we need some help classifying it all."}, {"Time_Start": 1056.52, "Time_End": 1061.52, "Text": " So at some point in the near future, you know, we'll be sticking something on the site."}, {"Time_Start": 1061.52, "Time_End": 1063.52, "Text": " And we need your help, basically."}, {"Time_Start": 1063.52, "Time_End": 1065.52, "Text": " Basically, you know, like if you can read..."}, {"Time_Start": 1065.52, "Time_End": 1067.52, "Text": " Hands up here, who can read C?"}, {"Time_Start": 1067.52, "Time_End": 1069.52, "Text": " Stick your hands in the air."}, {"Time_Start": 1069.52, "Time_End": 1071.52, "Text": " Okay, give yourself a part in the back."}, {"Time_Start": 1071.52, "Time_End": 1073.52, "Text": " You've got yourself a job."}, {"Time_Start": 1073.52, "Time_End": 1075.52, "Text": " So, you know, we'll be doing that."}, {"Time_Start": 1075.52, "Time_End": 1079.52, "Text": " And of course, we'll be busy, you know,"}, {"Time_Start": 1079.52, "Time_End": 1083.52, "Text": " we'll also be helping support the open source vulnerability database guys"}, {"Time_Start": 1083.52, "Time_End": 1086.52, "Text": " and all the other bits and pieces that go along with this."}, {"Time_Start": 1086.52, "Time_End": 1088.52, "Text": " And of course, you know, all the people out there"}, {"Time_Start": 1088.52, "Time_End": 1091.52, "Text": " who are busy developing your tools and like,"}, {"Time_Start": 1091.52, "Time_End": 1092.52, "Text": " you know, send us your staff."}, {"Time_Start": 1092.52, "Time_End": 1094.52, "Text": " send us your stuff."}, {"Time_Start": 1094.52, "Time_End": 1096.52, "Text": " You know, we want us our friends, Romans, citizens."}, {"Time_Start": 1096.52, "Time_End": 1098.52, "Text": " Send us your wares."}, {"Time_Start": 1098.52, "Time_End": 1101.52, "Text": " So, you know, bring it on."}, {"Time_Start": 1101.52, "Time_End": 1103.52, "Text": " That's basically it."}, {"Time_Start": 1103.52, "Time_End": 1105.52, "Text": " Yeah, back to Steve."}, {"Time_Start": 1105.52, "Time_End": 1106.52, "Text": " Thank you."}, {"Time_Start": 1110.52, "Time_End": 1114.52, "Text": " Yeah, so essentially ISIS is going to be, you know, volunteer rent."}, {"Time_Start": 1114.52, "Time_End": 1115.52, "Text": " It's going to be free."}, {"Time_Start": 1115.52, "Time_End": 1119.52, "Text": " I think the key point behind this is that the data will remain free."}, {"Time_Start": 1119.52, "Time_End": 1121.52, "Text": " It's going to be a not-for-profit and"}, {"Time_Start": 1121.52, "Time_End": 1125.52, "Text": " and you'll be able to dump all the data in a way you want."}, {"Time_Start": 1125.52, "Time_End": 1126.52, "Text": " There's a lot of people."}, {"Time_Start": 1126.52, "Time_End": 1128.52, "Text": " Yeah, sorry, never for profit. Thanks, Emerson."}, {"Time_Start": 1128.52, "Time_End": 1132.52, "Text": " So yeah, so like I said, I'd probably get the word for the shittiest talk to DefCon"}, {"Time_Start": 1132.52, "Time_End": 1134.52, "Text": " because I blew through that real quick."}, {"Time_Start": 1134.52, "Time_End": 1137.52, "Text": " I'm not going to take questions, because I know you guys are probably going to,"}, {"Time_Start": 1137.52, "Time_End": 1138.52, "Text": " or some of you are probably going to flame me."}, {"Time_Start": 1138.52, "Time_End": 1140.52, "Text": " So if you do want to come up and talk to me,"}, {"Time_Start": 1140.52, "Time_End": 1143.52, "Text": " feel free, come out here and talk to me at the end of the talk."}, {"Time_Start": 1143.52, "Time_End": 1145.52, "Text": " What to me?"}, {"Time_Start": 1145.52, "Time_End": 1148.52, "Text": " Okay."}, {"Time_Start": 1148.52, "Time_End": 1150.52, "Text": " Someone want this? Come get it."}, {"Time_Start": 1150.52, "Time_End": 1153.52, "Text": " It's free."}, {"Time_Start": 1153.52, "Time_End": 1159.52, "Text": " Okay, I'll take a question here, and then you can take some free hardware."}, {"Time_Start": 1180.52, "Time_End": 1184.52, "Text": " Okay, that's such a really good question. I'm glad I took that one."}, {"Time_Start": 1184.52, "Time_End": 1189.52, "Text": " Essentially, he was asking, you know, say you're an Enron employee, you're making six figures."}, {"Time_Start": 1189.52, "Time_End": 1194.52, "Text": " How do you fight not selling out, you know, to expose that there's something bad going on?"}, {"Time_Start": 1194.52, "Time_End": 1197.52, "Text": " You know, I think that's a tough one, right?"}, {"Time_Start": 1197.52, "Time_End": 1201.52, "Text": " And I think everyone will make their own personal decision on that."}, {"Time_Start": 1201.52, "Time_End": 1204.52, "Text": " And one of the questions to ask yourself is, what do you do?"}, {"Time_Start": 1204.52, "Time_End": 1208.52, "Text": " You know, you're a sysadminor security guy of a corporation, and you know they're doing something wrong."}, {"Time_Start": 1208.52, "Time_End": 1209.52, "Text": " Do you protect that data?"}, {"Time_Start": 1209.52, "Time_End": 1210.52, "Text": " Do you not?"}, {"Time_Start": 1210.52, "Time_End": 1212.52, "Text": " protect it or do you expose it?"}, {"Time_Start": 1212.52, "Time_End": 1214.52, "Text": " You know, that's, I think that's a personal question."}, {"Time_Start": 1214.52, "Time_End": 1215.52, "Text": " Everyone has to ask them."}, {"Time_Start": 1215.52, "Time_End": 1217.52, "Text": " Obviously, I'd encourage you to expose them."}, {"Time_Start": 1217.52, "Time_End": 1221.52, "Text": " I know in the U.S., I'm a Canadian, so I'm not completely familiar with a lot of the U.S. laws,"}, {"Time_Start": 1221.52, "Time_End": 1225.52, "Text": " but I know some of the states have, like, whistleblower laws and, you know, and things like that,"}, {"Time_Start": 1225.52, "Time_End": 1227.52, "Text": " that you can protect yourself."}, {"Time_Start": 1227.52, "Time_End": 1230.52, "Text": " Or do it and honestly, you know, find a guy in the press that you trust"}, {"Time_Start": 1230.52, "Time_End": 1234.52, "Text": " and feed him all the information anonymously, hoping that he'll protect your identity."}, {"Time_Start": 1240.52, "Time_End": 1247.52, "Text": " It is a HP hub plus."}, {"Time_Start": 1247.52, "Time_End": 1249.52, "Text": " Yeah."}, {"Time_Start": 1249.52, "Time_End": 1254.52, "Text": " I don't think I'm going to know what those connectors are in the back, so."}, {"Time_Start": 1254.52, "Time_End": 1260.52, "Text": " So yeah, like I said, next up, we've got goggles talking about the Worlds Among Us."}, {"Time_Start": 1260.52, "Time_End": 1265.52, "Text": " If anyone does have any questions or comments or, you know, want to come punch me in the nose, feel free coming up."}, {"Time_Start": 1265.52, "Time_End": 1267.52, "Text": " Thank you."}]}