{"segments": [{"Time_Start": 0.0, "Time_End": 3.92, "Text": " I'm not going to get up on this stage."}, {"Time_Start": 3.92, "Time_End": 10.28, "Text": " I do a little bit better when I'm wondering around and able to hold a massive phallic symbol"}, {"Time_Start": 10.28, "Time_End": 13.120000000000001, "Text": " up to my face for some reason."}, {"Time_Start": 13.120000000000001, "Time_End": 14.120000000000001, "Text": " Thank you."}, {"Time_Start": 14.120000000000001, "Time_End": 15.120000000000001, "Text": " Thank you."}, {"Time_Start": 15.120000000000001, "Time_End": 19.76, "Text": " Even though I, well, never mind, I could go off on a whole thing on that."}, {"Time_Start": 19.76, "Time_End": 27.38, "Text": " Last year I did do a talk that had lots of flashy graphics and I did music, soundtrack, and"}, {"Time_Start": 27.38, "Time_End": 28.38, "Text": " the whole bit."}, {"Time_Start": 28.38, "Time_End": 34.26, "Text": " I'm not doing as much of that as I did last year."}, {"Time_Start": 34.26, "Time_End": 37.26, "Text": " I'm not doing that much this year."}, {"Time_Start": 37.26, "Time_End": 41.76, "Text": " And, well, just a couple of quick things about me."}, {"Time_Start": 41.76, "Time_End": 50.14, "Text": " I'm with a affiliate with the group known as MRC, and that's roughly what you could say,"}, {"Time_Start": 50.14, "Time_End": 53.76, "Text": " the speaking capacity."}, {"Time_Start": 53.76, "Time_End": 58.36, "Text": " That's who I'm speaking as, as an MRC person, as opposed to my, in the interest of full"}, {"Time_Start": 58.38, "Time_End": 61.760000000000005, "Text": " disclosure of my daytime employer Bindview."}, {"Time_Start": 61.760000000000005, "Time_End": 65.32000000000001, "Text": " As you see through, as we go through on some of the slides, some of the images may be somewhat"}, {"Time_Start": 65.32000000000001, "Time_End": 72.06, "Text": " questionable for a corporate type talk, so I'm not going to be speaking as that, but I do work"}, {"Time_Start": 72.06, "Time_End": 74.9, "Text": " for a Bind View on the Razor team."}, {"Time_Start": 74.9, "Time_End": 82.22, "Text": " The skills you'll need for this to be able to understand what's going on in this talk, basically"}, {"Time_Start": 82.22, "Time_End": 87.68, "Text": " what you're going to need to know is hopefully a little bit about computer security, you know what"}, {"Time_Start": 87.68, "Time_End": 89.64, "Text": " my P address is, that kind of stuff."}, {"Time_Start": 89.64, "Time_End": 95.58000000000001, "Text": " I am going to cover some areas that do get somewhat technical, and if you have technical questions"}, {"Time_Start": 95.58000000000001, "Time_End": 99.24000000000001, "Text": " that you didn't quite understand that you want to talk to me about later, then feel free"}, {"Time_Start": 99.24000000000001, "Time_End": 101.52000000000001, "Text": " to grab me later."}, {"Time_Start": 101.52000000000001, "Time_End": 110.44000000000001, "Text": " I am going to cover a lot of social and political related issues as we go through this as well,"}, {"Time_Start": 110.44000000000001, "Time_End": 111.44000000000001, "Text": " though."}, {"Time_Start": 111.44000000000001, "Time_End": 116.04, "Text": " And also we're going to have a few, I wouldn't really call them, surprise this, but just some interesting"}, {"Time_Start": 116.04, "Time_End": 117.64000000000001, "Text": " things that will..."}, {"Time_Start": 117.68, "Time_End": 120.74000000000001, "Text": " let you know that kind of go along with the entire theme."}, {"Time_Start": 122.24000000000001, "Time_End": 128.04000000000002, "Text": " Oh, and also, if there are any questions during this, I must ask one, the question, it must be"}, {"Time_Start": 128.04000000000002, "Time_End": 129.8, "Text": " in the form of an answer, okay?"}, {"Time_Start": 130.16, "Time_End": 135.88, "Text": " Because that really, really simplifies, you know, my job here, okay?"}, {"Time_Start": 140.78, "Time_End": 144.96, "Text": " First off, I wanted to talk a little bit about what's going on in the past year."}, {"Time_Start": 146.46, "Time_End": 147.66, "Text": " Of course, the..."}, {"Time_Start": 147.68, "Time_End": 154.24, "Text": " DMCA muscle was flexed about a year ago as it stands."}, {"Time_Start": 154.24, "Time_End": 160.34, "Text": " Poor Dmitri was grabbed up after giving a speech, not exactly after, not right after."}, {"Time_Start": 160.34, "Time_End": 164.8, "Text": " They didn't just like pump him in handcuffs, as he said, thank you or anything."}, {"Time_Start": 164.8, "Time_End": 171.84, "Text": " But nonetheless, it was that muscle was flexed and we saw a little bit of an example of"}, {"Time_Start": 171.84, "Time_End": 177.66, "Text": " what DMCA was all about for whatever it's worth."}, {"Time_Start": 177.68, "Time_End": 187.88, "Text": " That was kind of a frightening thing for a lot of people, simply because of the implications for security and security research."}, {"Time_Start": 188.78, "Time_End": 196.04000000000002, "Text": " There are a lot of provisions in there that say, okay, researchers are exempt from this or that or the other,"}, {"Time_Start": 196.16, "Time_End": 203.60000000000002, "Text": " but then there's not a lot of clarifications as to exactly what entails research, what entails reverse engineering."}, {"Time_Start": 204.14000000000001, "Time_End": 205.64000000000001, "Text": " So there's some scary things there."}, {"Time_Start": 205.64000000000001, "Time_End": 219.08, "Text": " Another one was something that absolutely ruined my birthday, which is September 11th, an event that happened that just really screwed things up."}, {"Time_Start": 221.48000000000002, "Time_End": 235.42000000000002, "Text": " That has resulted in a whole bunch of emphasis on security. But again, what's happening with our legislation, our leaders, and whatnot, if you want to call them that, the supposed people."}, {"Time_Start": 235.64000000000001, "Time_End": 238.14000000000001, "Text": " that are running the government."}, {"Time_Start": 238.14000000000001, "Time_End": 248.14000000000001, "Text": " It led them to pass a whole series of what I would call, you know, basic Nidra type legislation."}, {"Time_Start": 248.14000000000001, "Time_End": 253.64000000000001, "Text": " The primary one that I would bring up would be a USA Patriot."}, {"Time_Start": 253.64000000000001, "Time_End": 254.64000000000001, "Text": " Okay?"}, {"Time_Start": 254.64000000000001, "Time_End": 261.64, "Text": " That was, and I hope everyone here saw Jennifer Granik's talk yesterday."}, {"Time_Start": 261.64, "Time_End": 264.64, "Text": " Did everyone see that?"}, {"Time_Start": 264.64, "Time_End": 265.14, "Text": " Okay."}, {"Time_Start": 265.14, "Time_End": 270.9, "Text": " That was a very, very good and interesting talk."}, {"Time_Start": 271.0, "Time_End": 277.34, "Text": " I was very pleased that she did that, and I was somewhat rather frightened."}, {"Time_Start": 278.26, "Time_End": 284.58, "Text": " I know she tried to give a real balanced thing, but I mean, there are some serious implications for some of that."}, {"Time_Start": 284.68, "Time_End": 289.15999999999997, "Text": " She also talked a little bit about some upcoming laws."}, {"Time_Start": 289.26, "Time_End": 292.8, "Text": " The one in particular is the Cybersecurity Enhancement Act."}, {"Time_Start": 293.3, "Time_End": 295.12, "Text": " This is the one which basically takes me."}, {"Time_Start": 295.14, "Time_End": 300.18, "Text": " most of your penalties for cyber-related crimes and doubles them, and has some interesting"}, {"Time_Start": 300.18, "Time_End": 308.74, "Text": " provisions so that if you were busted on some type of hacking-related thing, and then you go out"}, {"Time_Start": 308.74, "Time_End": 315.53999999999996, "Text": " and you have like a whole lot of elite skills, the higher your skill set, the higher your"}, {"Time_Start": 315.53999999999996, "Time_End": 321.64, "Text": " sentence is the way I read it, and I may be reading it incorrectly, but that's how it looks to me."}, {"Time_Start": 321.64, "Time_End": 325.12, "Text": " More skills involved in doing the attack, and then that increases your..."}, {"Time_Start": 325.14, "Time_End": 331.82, "Text": " it increases your length of time in with Bubba in a jail, which is kind of sad."}, {"Time_Start": 332.86, "Time_End": 338.96, "Text": " Other ones that are coming up that are kind of scary, you've got this stuff going on in Europe"}, {"Time_Start": 338.96, "Time_End": 346.96, "Text": " where you're talking about retention of communications, internet communications."}, {"Time_Start": 348.15999999999997, "Time_End": 349.56, "Text": " This one's kind of creepy."}, {"Time_Start": 349.68, "Time_End": 352.32, "Text": " I can't remember the exact one."}, {"Time_Start": 352.32, "Time_End": 355.12, "Text": " This one is really, really, really bad because."}, {"Time_Start": 355.14, "Time_End": 358.36, "Text": " apparently they're all proponents within our government."}, {"Time_Start": 358.56, "Time_End": 361.59999999999997, "Text": " They actually think it's really, really, really good."}, {"Time_Start": 361.9, "Time_End": 363.21999999999997, "Text": " The premise is this."}, {"Time_Start": 363.74, "Time_End": 368.7, "Text": " Basically, go out there and let's save all communications."}, {"Time_Start": 369.78, "Time_End": 373.84, "Text": " That's kind of a vague term, but what they're meaning is they're meaning email, they're meaning web,"}, {"Time_Start": 375.44, "Time_End": 379.34, "Text": " probably something along the lines of instant messaging or whatever."}, {"Time_Start": 379.34, "Time_End": 385.12, "Text": " But basically, grab that information and then store it so that it's a very very."}, {"Time_Start": 385.14, "Time_End": 390.0, "Text": " in case someone needs to go back and do, you know, subpoenas and searches and whatnot."}, {"Time_Start": 390.52, "Time_End": 394.12, "Text": " This actually is starting, this idea is starting to gain some momentum."}, {"Time_Start": 395.18, "Time_End": 397.4, "Text": " I believe it's the house that has been suggesting."}, {"Time_Start": 397.59999999999997, "Time_End": 399.74, "Text": " I don't know, I don't know the latest on this."}, {"Time_Start": 400.74, "Time_End": 404.08, "Text": " The house has been kind of toying with this whole idea."}, {"Time_Start": 404.2, "Time_End": 406.3, "Text": " I'll try to speak over the planes as they go over."}, {"Time_Start": 408.34, "Time_End": 414.47999999999996, "Text": " And it's, uh, where they want to retain, let's say, email for 90 days."}, {"Time_Start": 415.14, "Time_End": 416.8, "Text": " Okay, now think about that."}, {"Time_Start": 416.88, "Time_End": 421.36, "Text": " Copies of all your email retained by your ISP for 90 days."}, {"Time_Start": 421.91999999999996, "Time_End": 425.88, "Text": " Of course, I would think that most of the ISPs would be extremely pissed off at that"}, {"Time_Start": 425.88, "Time_End": 431.18, "Text": " because that means they're going to have to have, you know, more storage, more backups and everything else."}, {"Time_Start": 432.18, "Time_End": 440.8, "Text": " I have a somewhat interesting solution for it would be to, for every one of us that runs a mail server,"}, {"Time_Start": 441.3, "Time_End": 444.28, "Text": " if this does come into law, for every one of us who runs a mail server,"}, {"Time_Start": 444.28000000000003, "Time_End": 454.34000000000003, "Text": " Just go in there and open up relaying to go to House.gov and Senate.gov, and that way they can get all the spam, and they can have it."}, {"Time_Start": 454.34000000000003, "Time_End": 462.6, "Text": " And if you want to be really aggressive, just bounce all your spam to those systems, and then you can just say, hey, man, retain that, you motherfuckers."}, {"Time_Start": 462.66, "Time_End": 464.78000000000003, "Text": " You go ahead and just have that, okay?"}, {"Time_Start": 470.70000000000005, "Time_End": 474.26000000000005, "Text": " Now, what would, of course, be interesting is then you start doing your freedom of"}, {"Time_Start": 474.28000000000003, "Time_End": 481.44000000000005, "Text": " information requests and say, I want to know all the senators who are getting"}, {"Time_Start": 481.44000000000005, "Time_End": 483.38000000000005, "Text": " bestiality porn email."}, {"Time_Start": 485.82000000000005, "Time_End": 488.02000000000004, "Text": " Well, that's just kind of a fantasy there."}, {"Time_Start": 492.16, "Time_End": 496.72, "Text": " Anyway, so there's bad stuff, okay?"}, {"Time_Start": 496.88000000000005, "Time_End": 498.70000000000005, "Text": " There's bad stuff on the way."}, {"Time_Start": 499.3, "Time_End": 502.92, "Text": " There are things you can do, and I'll kind of go into that at the end."}, {"Time_Start": 503.40000000000003, "Time_End": 504.1, "Text": " That's the other thing."}, {"Time_Start": 504.28000000000003, "Time_End": 511.74, "Text": " trying not to be cynical. I've been talking a lot. This is why, basically, just so you know,"}, {"Time_Start": 511.82000000000005, "Time_End": 516.88, "Text": " I had a whole speech all typed out for this. And I've been wondering around, I've been talking with lots"}, {"Time_Start": 516.88, "Time_End": 524.14, "Text": " of people here. I see some people here that I've been talking with. And they say, you know,"}, {"Time_Start": 524.1800000000001, "Time_End": 528.44, "Text": " what are you going to be talking about? And I tell them, and I just threw out all my notes. I"}, {"Time_Start": 528.44, "Time_End": 534.26, "Text": " wrote a few down, but I've thrown out all my notes because it's just, everything is,"}, {"Time_Start": 534.28, "Time_End": 539.92, "Text": " is changing so fast. Everything is happening so fast and we have so many odd things"}, {"Time_Start": 539.92, "Time_End": 551.62, "Text": " going on. The big criticism I had from last year's talk was that, and I heard this from probably"}, {"Time_Start": 551.62, "Time_End": 557.14, "Text": " the people that have helped put on security conferences on down. They said, this is a security"}, {"Time_Start": 557.14, "Time_End": 564.26, "Text": " conference. This is a hacking conference. Why are you bringing up politics? What does politics"}, {"Time_Start": 564.28, "Time_End": 570.76, "Text": " have to do with any of this. Someone said everything. That's exactly true."}, {"Time_Start": 570.86, "Time_End": 577.98, "Text": " Now, it may not have been true before, but it is true now. There are now extremely serious"}, {"Time_Start": 577.98, "Time_End": 587.4599999999999, "Text": " consequences for your actions, much more serious than before. Okay? Well, let me give you some"}, {"Time_Start": 587.4599999999999, "Time_End": 593.14, "Text": " examples. Let's take full disclosure, all right, or just the concept of full disclosure. What are we talking"}, {"Time_Start": 593.14, "Time_End": 597.74, "Text": " about here. We're talking about, let's say you're going to put a post out on, put a post"}, {"Time_Start": 597.74, "Time_End": 602.8199999999999, "Text": " out on bug track. You found a vulnerability. We're going to put a post out on Volwatch. You've got"}, {"Time_Start": 602.8199999999999, "Time_End": 610.04, "Text": " an advisory that's going out. Okay, let's say, did you give the vendor enough time? Okay?"}, {"Time_Start": 610.38, "Time_End": 615.42, "Text": " That's debatable as to what that amount of time is. Did you give the vendor any time at all?"}, {"Time_Start": 615.8, "Time_End": 621.04, "Text": " If you didn't give the vendor enough time, there are people that will flame you, the press will come down"}, {"Time_Start": 621.04, "Time_End": 628.9599999999999, "Text": " on you. There be bad things that are said about you. Okay, that's one area. If you wait too long,"}, {"Time_Start": 629.12, "Time_End": 634.8, "Text": " it says I notified the vendor 35 months ago and now they're ready to go to the patch. Okay?"}, {"Time_Start": 635.36, "Time_End": 639.98, "Text": " Then you will be, oh, you waited too long. You left us vulnerable for too long or time."}, {"Time_Start": 640.92, "Time_End": 650.9599999999999, "Text": " All right. If the patch isn't available in a timely fashion, I mean, you know, there's, the workarounds don't work. There's all"}, {"Time_Start": 651.04, "Time_End": 661.38, "Text": " kinds of ramifications that are tied to that, okay? And it doesn't really, it doesn't really"}, {"Time_Start": 661.38, "Time_End": 668.6999999999999, "Text": " help when you've got various governmental type agencies and various software vendors who seem"}, {"Time_Start": 668.6999999999999, "Time_End": 675.54, "Text": " to be trying to work together to at least limit the disclosure itself and using what weaknesses"}, {"Time_Start": 675.54, "Time_End": 681.02, "Text": " they can find in the whole argument to go ahead and meet around agenda. Let me give you a"}, {"Time_Start": 681.04, "Time_End": 685.68, "Text": " a very quick example of that that's happening right here at this conference."}, {"Time_Start": 687.4399999999999, "Time_End": 693.38, "Text": " There's a panel. I don't know if it's happened yet or not. I really didn't pay attention to the schedule."}, {"Time_Start": 694.48, "Time_End": 711.02, "Text": " Something to do with disclosure. What the feds think? That's today? Okay. What the feds think? Why the feds think? Why the hell is Steve Littner of Microsoft up on a panel telling me what the federal"}, {"Time_Start": 711.04, "Time_End": 719.24, "Text": " government thinks. I really want to know that. I want to know. Someone asked that. I can't go to the talk. I'll end up in, you know, trying to"}, {"Time_Start": 719.24, "Time_End": 741.02, "Text": " inside a riot or something. So, but I mean, but that's a very, very telling sign when you think about it. All right? You have a major corporation who's got a vested interest in the control of disclosure and they're sitting on a panel with the feds. The same, maybe not the exact feds, but"}, {"Time_Start": 741.04, "Time_End": 745.12, "Text": " the same federal government they had gone after them previously on antitrust."}, {"Time_Start": 746.1999999999999, "Time_End": 749.78, "Text": " And they're sitting there and they're saying this is what we think the policy should be."}, {"Time_Start": 751.02, "Time_End": 760.38, "Text": " I want to know when the government says we've contacted security experts and industry experts about this kind of stuff,"}, {"Time_Start": 760.38, "Time_End": 766.4399999999999, "Text": " saying we need to come up with a policy on such things as disclosure or in such things as"}, {"Time_Start": 766.44, "Time_End": 772.84, "Text": " some of their various tenants of the Cybersecurity Enhancement Act and whatnot,"}, {"Time_Start": 773.0400000000001, "Time_End": 779.22, "Text": " why they're continually going to such groups as, you know, the major software vendors who have"}, {"Time_Start": 779.22, "Time_End": 783.84, "Text": " their interest in it is purely financial in the outcome of that."}, {"Time_Start": 784.1400000000001, "Time_End": 787.74, "Text": " Someone needs to, well, I guess we are, raising that question."}, {"Time_Start": 788.4200000000001, "Time_End": 790.6600000000001, "Text": " Someone go there and ask them that at that top."}, {"Time_Start": 796.44, "Time_End": 807.44, "Text": " There's another thing with why things are political, sorry."}, {"Time_Start": 807.44, "Time_End": 811.44, "Text": " Or pitiful or whatever you want to do."}, {"Time_Start": 811.44, "Time_End": 818.94, "Text": " Releasing a vulnerability 10 years ago really didn't seem to have nearly as much of an impact"}, {"Time_Start": 818.94, "Time_End": 821.36, "Text": " as it does now."}, {"Time_Start": 821.36, "Time_End": 826.4200000000001, "Text": " The amount of computers and network devices is rapidly increasing."}, {"Time_Start": 826.44, "Time_End": 830.44, "Text": " and it's just a highly accelerated rate."}, {"Time_Start": 830.44, "Time_End": 837.44, "Text": " So now if you release some type of vulnerability information that affects 10% of all systems,"}, {"Time_Start": 837.44, "Time_End": 844.44, "Text": " 10 years ago you would have attracted, you know, a fair amount of attention, probably nothing mainstream."}, {"Time_Start": 844.44, "Time_End": 851.44, "Text": " Now you're bringing down large corporations who have basically, they're doing that whole B2B thing"}, {"Time_Start": 851.44, "Time_End": 855.44, "Text": " and you've got peer-to-peer stuff happening here and there."}, {"Time_Start": 855.44, "Time_End": 856.4200000000001, "Text": " You've got interest."}, {"Time_Start": 856.44, "Time_End": 862.44, "Text": " Internet, wireless, all kinds of open access points to all kinds of technology."}, {"Time_Start": 862.44, "Time_End": 864.44, "Text": " All right?"}, {"Time_Start": 864.44, "Time_End": 870.44, "Text": " So whenever you release vulnerability information, not even necessarily a vulnerability"}, {"Time_Start": 870.44, "Time_End": 875.44, "Text": " code itself, but just details, and then someone writes a worm that goes out there,"}, {"Time_Start": 875.44, "Time_End": 879.44, "Text": " you're having a massive impact as a result of your actions."}, {"Time_Start": 879.44, "Time_End": 883.44, "Text": " And so you have to rethink this."}, {"Time_Start": 883.44, "Time_End": 885.44, "Text": " An example would be code red."}, {"Time_Start": 885.44, "Time_End": 886.44, "Text": " Okay?"}, {"Time_Start": 886.44, "Time_End": 891.44, "Text": " especially now since some of these laws we've been talking about,"}, {"Time_Start": 891.44, "Time_End": 898.44, "Text": " with Code Red when it came out, you were a fuck nut, basically."}, {"Time_Start": 898.44, "Time_End": 899.44, "Text": " You know, who ever did that?"}, {"Time_Start": 899.44, "Time_End": 900.44, "Text": " One of an idiot."}, {"Time_Start": 900.44, "Time_End": 903.44, "Text": " You know, I had to patch a bunch of servers who's O-S."}, {"Time_Start": 903.44, "Time_End": 905.44, "Text": " I don't even run."}, {"Time_Start": 905.44, "Time_End": 906.44, "Text": " Okay?"}, {"Time_Start": 906.44, "Time_End": 908.44, "Text": " So this is really sad."}, {"Time_Start": 908.44, "Time_End": 909.44, "Text": " Okay."}, {"Time_Start": 909.44, "Time_End": 912.44, "Text": " Now you're a cyber terrorist."}, {"Time_Start": 912.44, "Time_End": 914.44, "Text": " Okay?"}, {"Time_Start": 914.44, "Time_End": 915.44, "Text": " That's the big difference."}, {"Time_Start": 915.44, "Time_End": 923.44, "Text": " You can go ahead and say, well, the exploit code that I wrote, that someone adapted into a worm,"}, {"Time_Start": 923.44, "Time_End": 929.44, "Text": " it was intended to show people, to demonstrate to people that things were vulnerable, someone will come back"}, {"Time_Start": 929.44, "Time_End": 934.44, "Text": " and say, I was able to use this in a worm and go and damage all these systems."}, {"Time_Start": 934.44, "Time_End": 936.44, "Text": " Therefore, I got it from you."}, {"Time_Start": 936.44, "Time_End": 939.44, "Text": " You are somewhat held accountable, potentially."}, {"Time_Start": 939.44, "Time_End": 941.44, "Text": " This is still all unclear."}, {"Time_Start": 941.44, "Time_End": 943.44, "Text": " It may not come to that."}, {"Time_Start": 943.44, "Time_End": 944.44, "Text": " I hope it doesn't, but it's headed."}, {"Time_Start": 944.44, "Time_End": 946.44, "Text": " it's heading in that direction."}, {"Time_Start": 946.44, "Time_End": 952.44, "Text": " If you're planning on doing anything, and I don't do this anymore, I haven't done this since"}, {"Time_Start": 952.44, "Time_End": 956.44, "Text": " USA Patriot, just out of paranoia notice."}, {"Time_Start": 956.44, "Time_End": 960.44, "Text": " How many people here scan on the internet?"}, {"Time_Start": 960.44, "Time_End": 965.44, "Text": " Okay, a few brave people will go ahead and admit they do, even though probably most of you do."}, {"Time_Start": 965.44, "Time_End": 972.44, "Text": " The idea is that, I mean, I do, or I did, as part of research."}, {"Time_Start": 972.44, "Time_End": 973.44, "Text": " Okay?"}, {"Time_Start": 973.44, "Time_End": 980.44, "Text": " It's interesting when you can do fun things like, say, scan the entire address space of China"}, {"Time_Start": 980.44, "Time_End": 987.44, "Text": " and then look to see how many vulnerable web servers they have, which by the way is pretty much all of them, all right?"}, {"Time_Start": 987.44, "Time_End": 991.44, "Text": " It's interesting to do that."}, {"Time_Start": 991.44, "Time_End": 999.44, "Text": " It's wondrous when you find a box to say, I had no idea that a single server could have 14 different CGI vulnerabilities on it,"}, {"Time_Start": 999.44, "Time_End": 1002.44, "Text": " but somehow someone managed to do that."}, {"Time_Start": 1002.44, "Time_End": 1005.6400000000001, "Text": " But you can't be going around doing that kind of stuff anymore."}, {"Time_Start": 1005.6400000000001, "Time_End": 1016.44, "Text": " You really can't because you might be interpreted as someone performing some type of hostile action."}, {"Time_Start": 1016.44, "Time_End": 1022.44, "Text": " Particularly if we're involved with some, when I say we, I mean the United States,"}, {"Time_Start": 1022.44, "Time_End": 1028.94, "Text": " are involved with some type of political, diplomatic craziness going on with them."}, {"Time_Start": 1028.94, "Time_End": 1032.42, "Text": " Maybe we're getting ready to go, you know, bomb them in our, you know,"}, {"Time_Start": 1032.44, "Time_End": 1036.38, "Text": " war on whatever that we're warring on that week."}, {"Time_Start": 1039.5, "Time_End": 1043.88, "Text": " See, basically, I want to bring with the point that hacking is political."}, {"Time_Start": 1044.92, "Time_End": 1045.16, "Text": " Okay?"}, {"Time_Start": 1045.52, "Time_End": 1047.56, "Text": " That's the main thing I wanted to get across to everyone."}, {"Time_Start": 1048.3200000000002, "Time_End": 1054.28, "Text": " The other criticism I had from last year was that I gave a lot of theory."}, {"Time_Start": 1056.0800000000002, "Time_End": 1061.1200000000001, "Text": " Sorry, the dangers of having a long hair."}, {"Time_Start": 1062.44, "Time_End": 1068.44, "Text": " I gave a lot of theory, but I really didn't point anyone in any particular direction."}, {"Time_Start": 1068.44, "Time_End": 1072.44, "Text": " I just said, things are bad, go get him."}, {"Time_Start": 1072.44, "Time_End": 1076.44, "Text": " You know, and that was, that really didn't help much."}, {"Time_Start": 1076.44, "Time_End": 1083.44, "Text": " So, because, really, I mean, a technical audience, it's like, okay, it's fine to talk in theory and"}, {"Time_Start": 1083.44, "Time_End": 1091.44, "Text": " everything, and hopefully most of you are not still drunk enough from the previous night that some of this is sinking in."}, {"Time_Start": 1091.44, "Time_End": 1096.5800000000002, "Text": " If you are still drunk and it's not sinking in, then I can just go up here and just say bullshit."}, {"Time_Start": 1096.94, "Time_End": 1102.26, "Text": " And you don't know, that makes my job easier, but nonetheless, I've got to think that at least some of you are sober."}, {"Time_Start": 1103.92, "Time_End": 1106.64, "Text": " I'm going to propose a problem, okay?"}, {"Time_Start": 1107.8, "Time_End": 1114.02, "Text": " And I don't know if you can read the red tie, if I keep forgetting that I may end up on the roof."}, {"Time_Start": 1114.38, "Time_End": 1116.94, "Text": " Even though I do enjoy it, I like, does everyone like the sauna?"}, {"Time_Start": 1117.9, "Time_End": 1118.5, "Text": " What's going on?"}, {"Time_Start": 1118.6200000000001, "Time_End": 1119.2, "Text": " Is everyone I like it?"}, {"Time_Start": 1119.2, "Time_End": 1119.44, "Text": " Yeah."}, {"Time_Start": 1121.44, "Time_End": 1126.9, "Text": " And by the way, that's really, the sauna tent thing, that's really Jeff's way of saying,"}, {"Time_Start": 1127.02, "Time_End": 1132.1000000000001, "Text": " look, all you white pasty, overweight hackers, we're going to take a couple of pounds off of you"}, {"Time_Start": 1132.1000000000001, "Time_End": 1137.68, "Text": " because DefCon believes in, you know, giving back, making people healthy."}, {"Time_Start": 1138.6000000000001, "Time_End": 1145.18, "Text": " In 95, there was a paper written called Programming Satan's Computer."}, {"Time_Start": 1146.26, "Time_End": 1151.42, "Text": " Okay, and in this basically it said, how can you, I'm just summarizing, if I get the"}, {"Time_Start": 1151.44, "Time_End": 1154.64, "Text": " the summary wrong, you know, piss on you. I'm trying to make a point."}, {"Time_Start": 1156.06, "Time_End": 1160.78, "Text": " But basically, how can you trust the code that you're running if you don't control the underlying"}, {"Time_Start": 1160.78, "Time_End": 1168.46, "Text": " operating system itself? Okay. How do you try and provide safe code on a, on Satan's computer?"}, {"Time_Start": 1169.22, "Time_End": 1174.44, "Text": " The problem that I'll propose today is I call it packeteering Satan's network."}, {"Time_Start": 1175.68, "Time_End": 1181.42, "Text": " Okay? How do we move packets from point A to point B on the Internet without,"}, {"Time_Start": 1181.44, "Time_End": 1190.94, "Text": " private communications and then make sure that Satan and in this example I'll be using"}, {"Time_Start": 1190.94, "Time_End": 1197.42, "Text": " and by the way, I'd like to say a letter to all of my NSA friends that are here, in this example I will be using"}, {"Time_Start": 1197.42, "Time_End": 1201.74, "Text": " a, I'd probably be for the most part using the NSA in the role of Satan."}, {"Time_Start": 1202.54, "Time_End": 1210.3200000000002, "Text": " And in spite of the fact that many of you will agree and you can go ahead and fill in"}, {"Time_Start": 1210.32, "Time_End": 1218.0, "Text": " and fill in your own evil organization, such as the government of the People's Republic of China"}, {"Time_Start": 1218.0, "Time_End": 1227.9199999999998, "Text": " or some other repressive regime such as that. And just while I'm at it, while I'm staying up here,"}, {"Time_Start": 1227.9199999999998, "Time_End": 1232.58, "Text": " since we do have, I mean, we do have representatives from the U.S. government here, I do want to"}, {"Time_Start": 1232.58, "Time_End": 1238.84, "Text": " make clear that I do really think that the U.S. does have a pretty good thing going. If I had to"}, {"Time_Start": 1238.84, "Time_End": 1242.82, "Text": " pick and I did actually go through the whole list of countries that signed the WIPO treaty"}, {"Time_Start": 1242.82, "Time_End": 1247.34, "Text": " deciding where I could live and with my MP3s in peace somewhere and couldn't find a country"}, {"Time_Start": 1247.34, "Time_End": 1251.4599999999998, "Text": " on a planet. I decided, well, I might as well just live here then because I'm already here. And it is"}, {"Time_Start": 1251.4599999999998, "Time_End": 1256.52, "Text": " pretty good. They pay well here and everything. But to the representatives of the intelligence"}, {"Time_Start": 1256.52, "Time_End": 1261.8799999999999, "Text": " communities of some of those foreign governments who had been rumored to be here, including"}, {"Time_Start": 1261.8799999999999, "Time_End": 1267.9599999999998, "Text": " people like, you know, Israel and China and France and whatnot, who, you know, you know, Israel and China and France and whatnot, who"}, {"Time_Start": 1268.84, "Time_End": 1272.34, "Text": " a lot of that stuff against their people, fuck you, okay?"}, {"Time_Start": 1273.34, "Time_End": 1274.02, "Text": " Fuck you."}, {"Time_Start": 1275.22, "Time_End": 1283.4199999999998, "Text": " All right, let's move on to happier things now."}, {"Time_Start": 1285.6399999999999, "Time_End": 1286.84, "Text": " Hold on. Let me get a drink."}, {"Time_Start": 1298.84, "Time_End": 1314.08, "Text": " What can Satan sniff? All right. If we're going to be packeteering on Satan's"}, {"Time_Start": 1314.08, "Time_End": 1328.78, "Text": " network, what can Satan sniff? I'm not going to be packeteering on Satan's network. What can Satan sniff? I'm not going to read these slides because I hate presentations where you get some Boso up there that has an outline and just basically reads the slides to the audience. So these are on the, uh, this"}, {"Time_Start": 1328.84, "Time_End": 1333.9199999999998, "Text": " presentation is supposed to be on the CD that you got when you signed it unless, of course,"}, {"Time_Start": 1334.0, "Time_End": 1337.4399999999998, "Text": " you social engineered your way into DefCon and didn't pay anything."}, {"Time_Start": 1339.28, "Time_End": 1343.06, "Text": " Basically, this is, and see, that's the other thing that's kind of interesting with this talk."}, {"Time_Start": 1343.1399999999999, "Time_End": 1345.8999999999999, "Text": " I keep referring to things that are really old, all right?"}, {"Time_Start": 1345.98, "Time_End": 1349.22, "Text": " Think about that, paper 95, and then I'll refer to stuff even older than that later on."}, {"Time_Start": 1351.06, "Time_End": 1358.78, "Text": " In 1996, a presentation was made regarding anonymous re-mailers,"}, {"Time_Start": 1358.84, "Time_End": 1366.6, "Text": " by a man named Paul Strassman, National Defense University, and a gentleman named William Marlow,"}, {"Time_Start": 1367.22, "Time_End": 1369.78, "Text": " who also had some impressive credential of some kind."}, {"Time_Start": 1370.32, "Time_End": 1375.02, "Text": " Anyway, these guys, during the question and answer session of their talk,"}, {"Time_Start": 1376.1599999999999, "Time_End": 1382.72, "Text": " did mention that our government, and I believe it was the CIA that they possibly referred to,"}, {"Time_Start": 1383.48, "Time_End": 1387.36, "Text": " and you can go back and I put it in the web addresses of where these posts are,"}, {"Time_Start": 1388.84, "Time_End": 1390.82, "Text": " We can find out more information on this."}, {"Time_Start": 1390.9199999999998, "Time_End": 1394.86, "Text": " Did say the CIA is running remailers, okay?"}, {"Time_Start": 1395.02, "Time_End": 1395.9199999999998, "Text": " Anonymous re-mailers."}, {"Time_Start": 1395.9199999999998, "Time_End": 1403.36, "Text": " You remember that whole anonymous remailer thing that hardly anyone uses for various reasons."}, {"Time_Start": 1403.54, "Time_End": 1406.72, "Text": " I think probably just had a laziness, myself included."}, {"Time_Start": 1406.8799999999999, "Time_End": 1413.62, "Text": " But nonetheless, they also mentioned that the NSA had successfully developed technology"}, {"Time_Start": 1413.62, "Time_End": 1418.82, "Text": " to break crypto below a thousand bit on the key side."}, {"Time_Start": 1418.84, "Time_End": 1423.4399999999998, "Text": " and that they themselves personally used at least 1024 bit."}, {"Time_Start": 1423.4399999999998, "Time_End": 1425.6599999999999, "Text": " Okay, now that's an interesting thing."}, {"Time_Start": 1425.74, "Time_End": 1426.26, "Text": " Think about that."}, {"Time_Start": 1426.32, "Time_End": 1429.6799999999998, "Text": " That's 96 that they made that statement."}, {"Time_Start": 1429.8, "Time_End": 1435.22, "Text": " Of course, once the press found out about the statements that were made at this presentation,"}, {"Time_Start": 1437.8799999999999, "Time_End": 1439.56, "Text": " everyone denied everything."}, {"Time_Start": 1439.74, "Time_End": 1441.98, "Text": " Everyone denied these questions were even asked,"}, {"Time_Start": 1442.4399999999998, "Time_End": 1444.8, "Text": " and that these answers were even given at that presentation."}, {"Time_Start": 1444.8, "Time_End": 1448.1799999999998, "Text": " But nonetheless, you had stuff like that that kind of leaked out."}, {"Time_Start": 1448.84, "Time_End": 1455.84, "Text": " So let's just assume, just for the sake of argument, because we're cautious, paranoid people, okay?"}, {"Time_Start": 1455.84, "Time_End": 1458.84, "Text": " That it might possibly be true."}, {"Time_Start": 1458.84, "Time_End": 1461.84, "Text": " Now, moving on."}, {"Time_Start": 1461.84, "Time_End": 1466.84, "Text": " Come on."}, {"Time_Start": 1466.84, "Time_End": 1469.84, "Text": " Come on."}, {"Time_Start": 1469.84, "Time_End": 1471.84, "Text": " The heat may be getting to this."}, {"Time_Start": 1471.84, "Time_End": 1473.84, "Text": " Hopefully it won't freeze up."}, {"Time_Start": 1473.84, "Time_End": 1476.84, "Text": " Because I got really pretty graphics here."}, {"Time_Start": 1478.84, "Time_End": 1480.84, "Text": " There you go."}, {"Time_Start": 1480.84, "Time_End": 1483.84, "Text": " Hopefully it won't jump ahead another slide."}, {"Time_Start": 1483.84, "Time_End": 1488.84, "Text": " Email from a private email from a former spook."}, {"Time_Start": 1488.84, "Time_End": 1497.84, "Text": " Quoted some stuff, said PGP, and basically pretty much every available crypto that's available to us as individuals is breakable."}, {"Time_Start": 1497.84, "Time_End": 1507.84, "Text": " And roughly between that and a few other informal sources that I've heard, anything that's out there can either be broken through something."}, {"Time_Start": 1507.84, "Time_End": 1515.84, "Text": " to be broken through some type of brute force or through some type of flaw in the implementation of the crypto itself."}, {"Time_Start": 1515.84, "Time_End": 1516.84, "Text": " Okay?"}, {"Time_Start": 1516.84, "Time_End": 1519.84, "Text": " I'm not calling this proof."}, {"Time_Start": 1519.84, "Time_End": 1522.84, "Text": " I'm just letting you know what I heard, all right?"}, {"Time_Start": 1522.84, "Time_End": 1524.84, "Text": " So all I'm doing."}, {"Time_Start": 1524.84, "Time_End": 1532.84, "Text": " And the thing is is that there's been other times in informal communications with me."}, {"Time_Start": 1532.84, "Time_End": 1536.84, "Text": " I had a very interesting conversation last year with a"}, {"Time_Start": 1536.8400000000001, "Time_End": 1540.8400000000001, "Text": " with three gentlemen who at the time they said they were NSA,"}, {"Time_Start": 1540.8400000000001, "Time_End": 1546.8400000000001, "Text": " now I don't know who they were, but who confirmed some of this type of stuff to me."}, {"Time_Start": 1546.8400000000001, "Time_End": 1548.8400000000001, "Text": " But of course then they were saying,"}, {"Time_Start": 1548.8400000000001, "Time_End": 1550.8400000000001, "Text": " but of course we could be lying and you'll never know"}, {"Time_Start": 1550.8400000000001, "Time_End": 1553.8400000000001, "Text": " and you'll waste all your time trying to figure out"}, {"Time_Start": 1553.8400000000001, "Time_End": 1555.8400000000001, "Text": " whether we were telling the truth or not."}, {"Time_Start": 1555.8400000000001, "Time_End": 1557.8400000000001, "Text": " And no one will believe you anyway."}, {"Time_Start": 1557.8400000000001, "Time_End": 1559.8400000000001, "Text": " So I've heard that."}, {"Time_Start": 1559.8400000000001, "Time_End": 1563.8400000000001, "Text": " I've heard it from other researchers who I wanted to name their names"}, {"Time_Start": 1563.8400000000001, "Time_End": 1565.8400000000001, "Text": " but they don't want their name associated with it."}, {"Time_Start": 1565.8400000000001, "Time_End": 1568.8400000000001, "Text": " associated with this type of information?"}, {"Time_Start": 1568.8400000000001, "Time_End": 1572.8400000000001, "Text": " So let's just say that every once in a while in circles,"}, {"Time_Start": 1572.8400000000001, "Time_End": 1577.8400000000001, "Text": " you run into someone who's heard some of the same type of rumors."}, {"Time_Start": 1577.8400000000001, "Time_End": 1583.8400000000001, "Text": " What are they monitoring?"}, {"Time_Start": 1583.8400000000001, "Time_End": 1584.8400000000001, "Text": " All right?"}, {"Time_Start": 1584.8400000000001, "Time_End": 1585.8400000000001, "Text": " What?"}, {"Time_Start": 1585.8400000000001, "Time_End": 1589.8400000000001, "Text": " Let's talk about the types of, and how are they monitoring?"}, {"Time_Start": 1589.8400000000001, "Time_End": 1591.8400000000001, "Text": " What are the techniques that are used?"}, {"Time_Start": 1591.8400000000001, "Time_End": 1593.8400000000001, "Text": " This is leading up to some points, by the way."}, {"Time_Start": 1593.8400000000001, "Time_End": 1595.8400000000001, "Text": " So I scare you what they can, they can,"}, {"Time_Start": 1595.8400000000001, "Time_End": 1599.8400000000001, "Text": " crack everything. Now let's talk about how we're going to monitor those packets"}, {"Time_Start": 1599.8400000000001, "Time_End": 1605.8400000000001, "Text": " that are flying across the network. You've got basically three types of monitoring."}, {"Time_Start": 1605.8400000000001, "Time_End": 1611.8400000000001, "Text": " You've got invasive, you've got non-invasive, and then we're all called stealth."}, {"Time_Start": 1611.8400000000001, "Time_End": 1618.8400000000001, "Text": " Non-invasive is extremely obvious where the monitoring nodes are."}, {"Time_Start": 1618.8400000000001, "Time_End": 1622.8400000000001, "Text": " Okay, you're going through a proxy server and it slows to a crawl."}, {"Time_Start": 1622.8400000000001, "Time_End": 1624.8400000000001, "Text": " Okay?"}, {"Time_Start": 1624.8400000000001, "Time_End": 1631.8400000000001, "Text": " There's, it's, actually, I think I skipped the whole slide."}, {"Time_Start": 1631.8400000000001, "Time_End": 1638.8400000000001, "Text": " This should be the invasive one that's up and not the non-invasive."}, {"Time_Start": 1638.8400000000001, "Time_End": 1641.8400000000001, "Text": " But invasive things slow to a crawl."}, {"Time_Start": 1641.8400000000001, "Time_End": 1644.8400000000001, "Text": " Very easy to spot this stuff and you can get around."}, {"Time_Start": 1644.8400000000001, "Time_End": 1652.8400000000001, "Text": " Non-invasive, of course, so there's a minimal amount of impact to what's going on."}, {"Time_Start": 1652.8400000000001, "Time_End": 1653.8400000000001, "Text": " Okay."}, {"Time_Start": 1653.8400000000001, "Time_End": 1654.8400000000001, "Text": " But they had a rapture."}, {"Time_Start": 1654.8400000000001, "Time_End": 1659.8400000000001, "Text": " a certain way to make sure that they can sniff traffic."}, {"Time_Start": 1659.8400000000001, "Time_End": 1662.8400000000001, "Text": " You know, they've got to put, you know, maybe you know what I'm talking about."}, {"Time_Start": 1662.8400000000001, "Time_End": 1666.8400000000001, "Text": " This also has to do with, like, say, you know, cash servers and proxies and whatnot."}, {"Time_Start": 1666.8400000000001, "Time_End": 1670.8400000000001, "Text": " But, and those things are actually fairly easy to avoid."}, {"Time_Start": 1670.8400000000001, "Time_End": 1674.8400000000001, "Text": " The one that's tough to avoid is the stuff monitoring."}, {"Time_Start": 1674.8400000000001, "Time_End": 1677.8400000000001, "Text": " And we all know, you know, the power of a sniffer."}, {"Time_Start": 1677.8400000000001, "Time_End": 1682.8400000000001, "Text": " Okay, you put a sniffer in the right place, and you're going to get all the traffic."}, {"Time_Start": 1682.8400000000001, "Time_End": 1683.8400000000001, "Text": " And that's one of the reasons why we do things like we do."}, {"Time_Start": 1683.8400000000001, "Time_End": 1687.8400000000001, "Text": " we do things like we encrypt when we send stuff."}, {"Time_Start": 1687.8400000000001, "Time_End": 1691.8400000000001, "Text": " And it's fairly hard to avoid."}, {"Time_Start": 1691.8400000000001, "Time_End": 1697.8400000000001, "Text": " Types of communication, man, you cannot see the text on that screen in the back, I'm betting."}, {"Time_Start": 1697.8400000000001, "Time_End": 1702.8400000000001, "Text": " Or in the front, in the very front row."}, {"Time_Start": 1702.8400000000001, "Time_End": 1707.8400000000001, "Text": " Basically, there's not much text in these slides, by the way."}, {"Time_Start": 1707.8400000000001, "Time_End": 1709.8400000000001, "Text": " Just look at the pictures, okay?"}, {"Time_Start": 1709.8400000000001, "Time_End": 1712.8400000000001, "Text": " I'll, I do that on purpose."}, {"Time_Start": 1712.8400000000001, "Time_End": 1717.8400000000001, "Text": " purpose. That's why I'm down here so I can see people's reactions and I can know how to"}, {"Time_Start": 1717.8400000000001, "Time_End": 1720.8400000000001, "Text": " roughly adjust as I go along."}, {"Time_Start": 1720.8400000000001, "Time_End": 1725.8400000000001, "Text": " There's a point-to-point communications such as email."}, {"Time_Start": 1725.8400000000001, "Time_End": 1728.8400000000001, "Text": " I think we all understand that."}, {"Time_Start": 1728.8400000000001, "Time_End": 1734.8400000000001, "Text": " There's also broadcast. Usenet is a good example of that."}, {"Time_Start": 1734.8400000000001, "Time_End": 1739.8400000000001, "Text": " Pressing to a news group is a real good example of that type of communication."}, {"Time_Start": 1739.8400000000001, "Time_End": 1741.8400000000001, "Text": " You do have the anonymous sender."}, {"Time_Start": 1741.8400000000001, "Time_End": 1746.8400000000001, "Text": " and that's a type of communication where you're going through one of those"}, {"Time_Start": 1746.8400000000001, "Time_End": 1752.3400000000001, "Text": " re-mailers that we mentioned earlier where the CIA peels off a private copy."}, {"Time_Start": 1752.3400000000001, "Time_End": 1757.3400000000001, "Text": " And then you have another thing I call a traffic pattern masking."}, {"Time_Start": 1757.3400000000001, "Time_End": 1763.8400000000001, "Text": " And this is like, a quick example is Loki that came out in Frack."}, {"Time_Start": 1763.8400000000001, "Time_End": 1767.8400000000001, "Text": " Google is your friend, look it up if you're curious."}, {"Time_Start": 1769.8400000000001, "Time_End": 1771.8200000000002, "Text": " To avoid our stealth,"}, {"Time_Start": 1771.8400000000001, "Time_End": 1780.8400000000001, "Text": " monitoring is going on by Satan, we're going to have to use some stealth communication"}, {"Time_Start": 1780.8400000000001, "Time_End": 1786.8400000000001, "Text": " techniques ourselves, okay? And this stealth communication, that's what, basically"}, {"Time_Start": 1786.8400000000001, "Time_End": 1791.46, "Text": " that we want to be able to use for the sender and the receiver are unknown, or close to"}, {"Time_Start": 1791.46, "Time_End": 1796.8400000000001, "Text": " being unknown, that the communication is not going to be particularly obvious. It's going"}, {"Time_Start": 1796.8400000000001, "Time_End": 1800.8400000000001, "Text": " to look like a regular part of traffic. Or if it is obvious, it is obvious, it's going to be a regular part of traffic."}, {"Time_Start": 1800.8400000000001, "Time_End": 1805.8400000000001, "Text": " obvious, it is so obscured that you're not going to be able to determine what"}, {"Time_Start": 1805.8400000000001, "Time_End": 1807.8400000000001, "Text": " in the hell you're actually looking at."}, {"Time_Start": 1807.8400000000001, "Time_End": 1813.8400000000001, "Text": " I'm going to talk about several different types of concepts."}, {"Time_Start": 1813.8400000000001, "Time_End": 1817.8400000000001, "Text": " Some of these are real-world examples and adaptations."}, {"Time_Start": 1817.8400000000001, "Time_End": 1819.8400000000001, "Text": " I'm going to go through four of them."}, {"Time_Start": 1819.8400000000001, "Time_End": 1822.8400000000001, "Text": " One of them I'm going to have someone come up and give me some help on."}, {"Time_Start": 1822.8400000000001, "Time_End": 1825.8400000000001, "Text": " But I want to go through and give you some examples."}, {"Time_Start": 1825.8400000000001, "Time_End": 1829.8400000000001, "Text": " And actually only one of them I'm actually officially writing code on."}, {"Time_Start": 1829.8400000000001, "Time_End": 1833.3400000000001, "Text": " But I want to go into a little bit of detail into some of these."}, {"Time_Start": 1833.3400000000001, "Time_End": 1835.8400000000001, "Text": " And this is where I'm talking about direction."}, {"Time_Start": 1835.8400000000001, "Time_End": 1840.8400000000001, "Text": " Instead of saying, go get her, here's some things that maybe we can work on as a community,"}, {"Time_Start": 1840.8400000000001, "Time_End": 1842.8400000000001, "Text": " all right, that might help."}, {"Time_Start": 1842.8400000000001, "Time_End": 1849.8400000000001, "Text": " And hopefully it just doesn't help force some evil legislation down upon us."}, {"Time_Start": 1849.8400000000001, "Time_End": 1854.8400000000001, "Text": " But nonetheless, maybe we should go ahead and do that anyway and just, you know,"}, {"Time_Start": 1854.8400000000001, "Time_End": 1856.8400000000001, "Text": " poke the beast and see what happens."}, {"Time_Start": 1856.8400000000001, "Time_End": 1858.8400000000001, "Text": " First one, digital dropbox."}, {"Time_Start": 1858.8400000000001, "Time_End": 1866.8400000000001, "Text": " drop box. Does everyone understand what a drop box is as far as, you know, that spooks by stuff?"}, {"Time_Start": 1866.8400000000001, "Time_End": 1873.8400000000001, "Text": " You know, you've got a, you get the spot under the bridge. I'm going to hide my package for the other guy."}, {"Time_Start": 1873.8400000000001, "Time_End": 1878.8400000000001, "Text": " Yeah, a dead drop is a good example. Yeah, that's essentially the same type of thing."}, {"Time_Start": 1878.8400000000001, "Time_End": 1881.8400000000001, "Text": " Okay, so I'm talking about a digital version."}, {"Time_Start": 1881.8400000000001, "Time_End": 1885.8400000000001, "Text": " What would be a good way to do a digital version of this?"}, {"Time_Start": 1885.8400000000001, "Time_End": 1887.8400000000001, "Text": " To give an example of this."}, {"Time_Start": 1887.8400000000001, "Time_End": 1894.8400000000001, "Text": " For example of this, let me explain a piece of software called Whole Punch."}, {"Time_Start": 1894.8400000000001, "Time_End": 1900.8400000000001, "Text": " A colleague I work with at Bindview named Paul Ashton, who I don't know if he's here or not,"}, {"Time_Start": 1900.8400000000001, "Time_End": 1906.8400000000001, "Text": " in the room, but if he is, he's probably going to be pissed off because he hasn't released the software yet."}, {"Time_Start": 1906.8400000000001, "Time_End": 1910.8400000000001, "Text": " It's not quite ready, but maybe this will help push him along."}, {"Time_Start": 1910.8400000000001, "Time_End": 1914.8400000000001, "Text": " And send Paul some emails saying, Paul, where the hell is Whole Punch?"}, {"Time_Start": 1914.8400000000001, "Time_End": 1917.8400000000001, "Text": " You know, a simple moment I told me all about it, said you're getting ready to come out with it any day now."}, {"Time_Start": 1917.8400000000001, "Time_End": 1921.6000000000001, "Text": " and maybe he'll get going on it."}, {"Time_Start": 1921.6000000000001, "Time_End": 1928.0400000000002, "Text": " What whole punch does essentially, and this is a good idea, good things to think about,"}, {"Time_Start": 1929.42, "Time_End": 1938.0800000000002, "Text": " is let's say you have a system set up with no ports open, okay, but you have something running on there,"}, {"Time_Start": 1938.14, "Time_End": 1947.4, "Text": " a demon listening, you send in a packet, it's got some, you know, crypto-type material in there that's going to identify it as, you know, I'm the one that's going to do this thing,"}, {"Time_Start": 1947.4, "Time_End": 1951.4, "Text": " this thing and inside it in the command structure, of course, all this is all encrypted"}, {"Time_Start": 1951.4, "Time_End": 1954.4, "Text": " and everything, and you have to be authenticated as you go in there."}, {"Time_Start": 1954.4, "Time_End": 1967.4, "Text": " It says, open up port 22 from this IP address in your built-in IP tables type rules for 60 seconds, starting now."}, {"Time_Start": 1967.4, "Time_End": 1969.4, "Text": " You'll receive this packet."}, {"Time_Start": 1969.4, "Time_End": 1976.4, "Text": " So it's a really clever way of saying, okay, boom, I'm in, and then, you know, with the packet,"}, {"Time_Start": 1976.4, "Time_End": 1977.4, "Text": " and then I find it up with the packet."}, {"Time_Start": 1977.4, "Time_End": 2007.16, "Text": " connection. He's added some extra features in it, including methods of being able to trigger another instance of whole punch to route to yet another system. So if you're out somewhere on the internet, and you can send a package in this packet, it'll go through a firewall to a box, but then goes over and then reboots some system that needs to be rebooted or whatever the commanders you need to have done. So it's a cool thing. Hit up Paul, tell him that he needs to get this thing going."}, {"Time_Start": 2007.4, "Time_End": 2014.4, "Text": " and certainly hopefully it'll help inspire a few others as well."}, {"Time_Start": 2014.4, "Time_End": 2017.4, "Text": " Steg."}, {"Time_Start": 2017.4, "Time_End": 2022.4, "Text": " Stegonography. This is going to be a fun one. I love talking about this stuff."}, {"Time_Start": 2022.4, "Time_End": 2025.4, "Text": " This stuff is cool. And you know who else likes talking about it?"}, {"Time_Start": 2025.4, "Time_End": 2030.4, "Text": " The press. The press loves Stegg. It's so cool. It's so cool. It's so sexy."}, {"Time_Start": 2030.4, "Time_End": 2035.4, "Text": " Okay? Why? Because they don't like to admit it, but because we can talk about porn."}, {"Time_Start": 2035.4, "Time_End": 2037.7, "Text": " when we talk about Stegonography."}, {"Time_Start": 2039.0, "Time_End": 2041.26, "Text": " And that's the example I'm going to use right now."}, {"Time_Start": 2041.5, "Time_End": 2044.0400000000002, "Text": " I'm going to use an example of porn."}, {"Time_Start": 2044.5800000000002, "Time_End": 2047.42, "Text": " I'm assuming everyone knows what Stegg is."}, {"Time_Start": 2047.94, "Time_End": 2057.62, "Text": " Basically, I take a message and I hide it in some of the unused bits in a, say, a graphic file or a sound file or something."}, {"Time_Start": 2058.26, "Time_End": 2059.7400000000002, "Text": " So I can hide a message in there."}, {"Time_Start": 2059.82, "Time_End": 2061.06, "Text": " It's all encrypted and hidden."}, {"Time_Start": 2061.6, "Time_End": 2065.38, "Text": " Into the naked eye or naked ear, depending on what the type of file is."}, {"Time_Start": 2065.4, "Time_End": 2068.04, "Text": " you don't know if there's actually a message in there."}, {"Time_Start": 2069.46, "Time_End": 2075.0, "Text": " The example I'll give for stress communications is one that has been theorized,"}, {"Time_Start": 2075.06, "Time_End": 2080.3, "Text": " yet it hasn't been proven yet by various media outlets."}, {"Time_Start": 2081.5, "Time_End": 2085.1800000000003, "Text": " We're going to talk about, like say, if I was some evil guy,"}, {"Time_Start": 2085.62, "Time_End": 2089.58, "Text": " wanted to communicate to my minion out there, and I got a copy of Abgas."}, {"Time_Start": 2090.7200000000003, "Time_End": 2095.38, "Text": " Again, Google is your friend, so you can find out."}, {"Time_Start": 2095.4, "Time_End": 2101.52, "Text": " guess. If I was going to send out a message to all of my evil minion to go do the evil"}, {"Time_Start": 2101.52, "Time_End": 2109.56, "Text": " things, such as, you know, it's time where we saw the Microsoft source code, you know, it's, you know,"}, {"Time_Start": 2109.56, "Time_End": 2114.7200000000003, "Text": " whatever the evil thing is we're going to do. And when you think about it, that would be evil,"}, {"Time_Start": 2114.92, "Time_End": 2120.26, "Text": " you know? That would be evil. That would be evil. That would probably such ugly code to look at."}, {"Time_Start": 2120.26, "Time_End": 2124.3, "Text": " I mean, oh my God, that'd be terrible to have to be subjected to that."}, {"Time_Start": 2125.4, "Time_End": 2128.46, "Text": " Yeah, yeah, the whole thing is in Visual Basic."}, {"Time_Start": 2129.58, "Time_End": 2133.02, "Text": " Yeah, tell it. I just, oh my God."}, {"Time_Start": 2133.14, "Time_End": 2135.84, "Text": " Okay, anyway, that's a comment from someone over there, yell."}, {"Time_Start": 2135.96, "Time_End": 2139.36, "Text": " Ye'll not encourage me. Thank you. If you can provide jokes, especially in front, I'll pass them on."}, {"Time_Start": 2143.1600000000003, "Time_End": 2154.58, "Text": " I get some porn, all right? I get some porn. I put my message in the porn, okay? And believe it or not, and believe it or not, I've actually done."}, {"Time_Start": 2155.4, "Time_End": 2162.78, "Text": " research into this. I know you're shocked, but in the interest of science, in the interest of you,"}, {"Time_Start": 2163.32, "Time_End": 2168.08, "Text": " I've gone out and I've collected a shitload of porn. Okay? Okay?"}, {"Time_Start": 2173.28, "Time_End": 2177.06, "Text": " No, someone asked what's available on the CD."}, {"Time_Start": 2179.52, "Time_End": 2184.34, "Text": " For Christ's sake, we've got a room full of hackers, is you guys can't figure out how to get free porn."}, {"Time_Start": 2185.4, "Time_End": 2196.54, "Text": " Anyway, so you go grab your porn, and you put your message in it, you post it to Usenet,"}, {"Time_Start": 2197.82, "Time_End": 2208.28, "Text": " and then there's this phenomena that happens, okay, where people grab stuff out of Usenet and then put it on their pay site."}, {"Time_Start": 2209.58, "Time_End": 2212.38, "Text": " Someone else grabs it and puts it on their pay site."}, {"Time_Start": 2213.34, "Time_End": 2215.38, "Text": " And I'm sure no one is."}, {"Time_Start": 2215.4, "Time_End": 2220.52, "Text": " No one has ever done this, but there's spots where they've got preview sections"}, {"Time_Start": 2220.52, "Time_End": 2222.92, "Text": " on those pay sides, right?"}, {"Time_Start": 2223.02, "Time_End": 2226.14, "Text": " Where you can go and get a preview of the porn to come."}, {"Time_Start": 2227.2400000000002, "Time_End": 2232.6, "Text": " So, then all of a sudden, some of your image may start appearing in preview type stuff."}, {"Time_Start": 2233.1800000000003, "Time_End": 2239.28, "Text": " Now, if you had done some sophisticated research, such as myself, into this phenomenon,"}, {"Time_Start": 2240.28, "Time_End": 2245.02, "Text": " you'd notice that there's certain types of porn that have a repostrate that's higher than others."}, {"Time_Start": 2245.4, "Time_End": 2252.4, "Text": " Okay? Asian porn, for example, has an extremely high repost rate."}, {"Time_Start": 2252.4, "Time_End": 2264.4, "Text": " And all you got to do is make sure that your porn ends up being listed on asianthums.org, and it's everywhere."}, {"Time_Start": 2264.4, "Time_End": 2268.4, "Text": " Everywhere. That's all you got to do."}, {"Time_Start": 2268.4, "Time_End": 2273.4, "Text": " Throw away GeoCity's thing set up, and bingo, you've got your porn everywhere."}, {"Time_Start": 2273.4, "Time_End": 2277.32, "Text": " So that's how you get the message out."}, {"Time_Start": 2277.44, "Time_End": 2286.1600000000003, "Text": " And then you're even minion, just never look at, you know, Asian porn being listed on asianthums.org, and bingo, we got the message out."}, {"Time_Start": 2286.2200000000003, "Time_End": 2287.64, "Text": " And you'll get it in a timely fashion."}, {"Time_Start": 2288.04, "Time_End": 2289.4, "Text": " It actually is very quick."}, {"Time_Start": 2289.48, "Time_End": 2290.04, "Text": " I've done this."}, {"Time_Start": 2290.12, "Time_End": 2299.78, "Text": " I posted porn on newsnet, and it's on, you know, in an Asian news group, and bingo."}, {"Time_Start": 2299.78, "Time_End": 2301.6600000000003, "Text": " It's just within a couple of days."}, {"Time_Start": 2301.66, "Time_End": 2308.7, "Text": " it ends up being on Asian thumbs. Interesting. So there you go. You got a distribution method."}, {"Time_Start": 2309.8999999999996, "Time_End": 2315.74, "Text": " For those of you in the audience who are, of course, offended by pornography, and I will address"}, {"Time_Start": 2315.74, "Time_End": 2325.66, "Text": " all three of you now, let me give you a different scenario, okay? These couple of slides are not"}, {"Time_Start": 2325.66, "Time_End": 2329.8199999999997, "Text": " in your presentation, but I think you'll find them interesting."}, {"Time_Start": 2331.66, "Time_End": 2333.0, "Text": " Oh, I love this woman."}, {"Time_Start": 2334.12, "Time_End": 2335.48, "Text": " I love her to death."}, {"Time_Start": 2337.56, "Time_End": 2340.3199999999997, "Text": " Sandra Bullock. You can't see this down here at the bottom."}, {"Time_Start": 2341.2999999999997, "Time_End": 2344.08, "Text": " It says desktop wallpapers.net."}, {"Time_Start": 2345.2, "Time_End": 2345.54, "Text": " Okay?"}, {"Time_Start": 2347.42, "Time_End": 2349.72, "Text": " Oh, yeah, I love Sandra."}, {"Time_Start": 2349.8999999999996, "Time_End": 2356.46, "Text": " So I went out, and this is like a couple of years ago, I downloaded some backgrounds for my computer."}, {"Time_Start": 2357.42, "Time_End": 2357.8599999999997, "Text": " Oh, Sandra."}, {"Time_Start": 2357.92, "Time_End": 2358.8399999999997, "Text": " Let me get another one up."}, {"Time_Start": 2359.3999999999996, "Time_End": 2360.7599999999998, "Text": " Because I just love her to death."}, {"Time_Start": 2361.66, "Time_End": 2365.66, "Text": " Oh, yeah. There we go. That's the sweet stuff."}, {"Time_Start": 2365.66, "Time_End": 2374.66, "Text": " You know the thing is, is that I actually send her an invitation to my birthday party, and she didn't come."}, {"Time_Start": 2374.66, "Time_End": 2378.66, "Text": " It really made you upset because, you know, I went to a lot of trouble."}, {"Time_Start": 2378.66, "Time_End": 2388.66, "Text": " I mean, you know, her name and address were on a bell computer system on an FTP server that was wide open to anonymous access."}, {"Time_Start": 2388.66, "Time_End": 2390.66, "Text": " I just downloaded the data files and looked through there in bingo."}, {"Time_Start": 2390.66, "Time_End": 2395.7, "Text": " Bingo found all kinds of people's names and addresses, including Sandra and even Michelle"}, {"Time_Start": 2395.7, "Time_End": 2399.46, "Text": " Pfeiffer. And you know what? They didn't even show up after I sent them an invitation directly to"}, {"Time_Start": 2399.46, "Time_End": 2404.44, "Text": " their house. I can't understand it. But nonetheless, I still care about her, okay?"}, {"Time_Start": 2406.72, "Time_End": 2409.0, "Text": " So, you're a stalker, yeah."}, {"Time_Start": 2412.48, "Time_End": 2417.5, "Text": " No, I'm going to try to lump it into research, is what I'm going to do."}, {"Time_Start": 2420.66, "Time_End": 2422.66, "Text": " stalking techniques online."}, {"Time_Start": 2426.3399999999997, "Time_End": 2435.16, "Text": " What's interesting about this image was, I was using Nils Provost's StegDetect and decided,"}, {"Time_Start": 2435.8399999999997, "Time_End": 2441.2799999999997, "Text": " you know, I'm looking at all my porn and like him, and I've actually found things I thought might"}, {"Time_Start": 2441.2799999999997, "Time_End": 2445.3799999999997, "Text": " be questionable, and I've sent him some of my porn and said, hey dude, and of course he wasn't"}, {"Time_Start": 2445.3799999999997, "Time_End": 2449.3399999999997, "Text": " bothered at all by it, I don't know why, because, you know, you know, you normally get irritated"}, {"Time_Start": 2449.3399999999997, "Time_End": 2450.54, "Text": " when people keep sending you an email."}, {"Time_Start": 2450.66, "Time_End": 2454.1, "Text": " all that stuff and asking stupid questions about your software, but he seemed to enjoy it, okay."}, {"Time_Start": 2454.94, "Time_End": 2460.2999999999997, "Text": " He was a good sport. But nonetheless, I didn't find anything in any porn. He hasn't found anything"}, {"Time_Start": 2460.2999999999997, "Time_End": 2469.12, "Text": " in any porn. Guess what? This image right here, there's Steg in it. The one previous, too."}, {"Time_Start": 2471.06, "Time_End": 2478.7999999999997, "Text": " If you don't believe me, go ahead and download Steg Detect, go to, while it still remains up,"}, {"Time_Start": 2478.8, "Time_End": 2482.7000000000003, "Text": " Go ahead and go to desktop wallpapers.net. Go find"}, {"Time_Start": 2482.7000000000003, "Time_End": 2486.2400000000002, "Text": " Sandra Bullock in there. Download these images."}, {"Time_Start": 2487.36, "Time_End": 2493.44, "Text": " I believe this one on there is like Sandra Bullock underscore 3, whatever, and the other one's, this one's"}, {"Time_Start": 2493.44, "Time_End": 2497.52, "Text": " this one's, uh, uh, uh, uh, this is number five, okay?"}, {"Time_Start": 2498.32, "Time_End": 2502.6400000000003, "Text": " But they're there. Outguess is the one that's detected as being in there."}, {"Time_Start": 2503.32, "Time_End": 2507.4, "Text": " Okay? Now, I don't know if you've done a lot of work trying to crack stuff with Steadbreak,"}, {"Time_Start": 2507.4, "Time_End": 2508.78, "Text": " which is now included."}, {"Time_Start": 2508.8, "Time_End": 2510.4, "Text": " with Stubutek."}, {"Time_Start": 2510.5, "Time_End": 2516.1200000000003, "Text": " I've thrown a 40-meg dictionary at both of these things."}, {"Time_Start": 2516.2200000000003, "Time_End": 2521.34, "Text": " I haven't been able to find out what the passphrases, maybe someone else fell."}, {"Time_Start": 2521.42, "Time_End": 2526.42, "Text": " I didn't include it in your, it's not included in the CD, mainly because for all I know,"}, {"Time_Start": 2526.5, "Time_End": 2529.6200000000003, "Text": " it's got some type of top secret things going on in there."}, {"Time_Start": 2529.7000000000003, "Time_End": 2531.42, "Text": " Of course, it may just have nothing in it."}, {"Time_Start": 2531.44, "Time_End": 2531.96, "Text": " I don't know."}, {"Time_Start": 2532.6800000000003, "Time_End": 2535.94, "Text": " But, but nonetheless, this actually turned up as a hit."}, {"Time_Start": 2535.94, "Time_End": 2542.44, "Text": " I don't know what to make of that, but we'll just see what, uh, we'll just see what, uh, happens."}, {"Time_Start": 2543.08, "Time_End": 2549.18, "Text": " Uh, so as a side project, when you're not scanning your porn for stag, go ahead and feel free"}, {"Time_Start": 2549.18, "Time_End": 2552.86, "Text": " to throw a few CPU cycles at, uh, at, uh, Sandra here."}, {"Time_Start": 2556.14, "Time_End": 2558.16, "Text": " Um, now we're going to move on, let me see what I'm going to do on time."}, {"Time_Start": 2558.52, "Time_End": 2559.88, "Text": " Uh, we're going to have to speed things up."}, {"Time_Start": 2561.48, "Time_End": 2563.44, "Text": " Uh, stealth traffic pattern masking."}, {"Time_Start": 2564.82, "Time_End": 2565.92, "Text": " And the example, I'm going to see what I'm going to do on time."}, {"Time_Start": 2565.94, "Time_End": 2569.7000000000003, "Text": " I'm going to give here is something I'm working on called masquerades. This is where you take"}, {"Time_Start": 2569.7000000000003, "Time_End": 2576.8, "Text": " um, and I got the crypto part done. It's now trying to make the thing OFC compliant, which"}, {"Time_Start": 2576.8, "Time_End": 2583.86, "Text": " is a pain in the ass. What I'm trying to do is by taking crypto material and I'm shoving it into"}, {"Time_Start": 2583.86, "Time_End": 2590.9, "Text": " the header of email, okay, uh, the message ID in particular, shoving it through there into there,"}, {"Time_Start": 2590.9, "Time_End": 2595.92, "Text": " and then, um, uh, having it go across that way. And I'm trying to design it to where you have"}, {"Time_Start": 2595.94, "Time_End": 2599.64, "Text": " have a client that can run on, uh, not his route."}, {"Time_Start": 2599.64, "Time_End": 2601.34, "Text": " The stuff gets sniffed and picked up."}, {"Time_Start": 2601.34, "Time_End": 2605.64, "Text": " And I'm trying to add the option of having it fail, uh,"}, {"Time_Start": 2605.64, "Time_End": 2611.64, "Text": " during the transmission of the email, so that it fails in a way to where things don't get"}, {"Time_Start": 2611.64, "Time_End": 2612.04, "Text": " logged."}, {"Time_Start": 2612.04, "Time_End": 2613.64, "Text": " It doesn't get logged on an exchange server."}, {"Time_Start": 2613.64, "Time_End": 2617.34, "Text": " It will get logged on a, uh, on send mail, but it looks like an error."}, {"Time_Start": 2617.34, "Time_End": 2619.94, "Text": " And so I'm trying to make everything compliant on that."}, {"Time_Start": 2619.94, "Time_End": 2622.2400000000002, "Text": " Another idea, throwing stuff into headers."}, {"Time_Start": 2622.2400000000002, "Time_End": 2625.7000000000003, "Text": " There's been some presentations that both blackout and DefCon that I think they've"}, {"Time_Start": 2625.7000000000003, "Time_End": 2627.7000000000003, "Text": " covered some of this stuff."}, {"Time_Start": 2627.7000000000003, "Time_End": 2629.7000000000003, "Text": " Hey dude, how are you doing?"}, {"Time_Start": 2629.7000000000003, "Time_End": 2631.7000000000003, "Text": " Done good? All right."}, {"Time_Start": 2631.7000000000003, "Time_End": 2633.7000000000003, "Text": " Okay."}, {"Time_Start": 2633.7000000000003, "Time_End": 2637.7000000000003, "Text": " I'm getting ready to bring someone up here."}, {"Time_Start": 2637.7000000000003, "Time_End": 2639.7000000000003, "Text": " I'm going to explain this real quickly."}, {"Time_Start": 2639.7000000000003, "Time_End": 2642.7000000000003, "Text": " This is something that's interesting, very interesting."}, {"Time_Start": 2642.7000000000003, "Time_End": 2645.7000000000003, "Text": " I don't know how many people are familiar with the paper"}, {"Time_Start": 2645.7000000000003, "Time_End": 2648.7000000000003, "Text": " from 86, I believe. Is that correct?"}, {"Time_Start": 2648.7000000000003, "Time_End": 2650.7000000000003, "Text": " I think so."}, {"Time_Start": 2650.7000000000003, "Time_End": 2652.7000000000003, "Text": " The Dining cryptographer's problem."}, {"Time_Start": 2652.7000000000003, "Time_End": 2655.6800000000003, "Text": " Dying cryptographer's problem is you have three cryptography"}, {"Time_Start": 2655.7000000000003, "Time_End": 2658.7000000000003, "Text": " They've gone to a, they're going out to a dinner."}, {"Time_Start": 2658.7000000000003, "Time_End": 2660.7000000000003, "Text": " And again, I'm summarizing quickly."}, {"Time_Start": 2660.7000000000003, "Time_End": 2662.7000000000003, "Text": " I get it wrong."}, {"Time_Start": 2662.7000000000003, "Time_End": 2663.7000000000003, "Text": " Sorry."}, {"Time_Start": 2663.7000000000003, "Time_End": 2668.7000000000003, "Text": " They want, one of them is going to pay for dinner."}, {"Time_Start": 2668.7000000000003, "Time_End": 2673.7000000000003, "Text": " But they don't want to know which one of them paid for dinner,"}, {"Time_Start": 2673.7000000000003, "Time_End": 2677.7000000000003, "Text": " because they're, I guess, financially shy, at least some of them."}, {"Time_Start": 2677.7000000000003, "Time_End": 2680.7000000000003, "Text": " But they want to make sure if the NSA didn't pay for dinner,"}, {"Time_Start": 2680.7000000000003, "Time_End": 2682.7000000000003, "Text": " because the NSA picking up your dinner,"}, {"Time_Start": 2682.7000000000003, "Time_End": 2684.7000000000003, "Text": " that's just, apparently a bad thing, at least in this paper."}, {"Time_Start": 2684.7000000000003, "Time_End": 2686.7000000000003, "Text": " thing, at least in this paper it was."}, {"Time_Start": 2686.7000000000003, "Time_End": 2691.7000000000003, "Text": " So they need to devise a method of being able to communicate between the three of them"}, {"Time_Start": 2691.7000000000003, "Time_End": 2695.7000000000003, "Text": " to ensure that one of them actually paid for dinner."}, {"Time_Start": 2695.7000000000003, "Time_End": 2700.7000000000003, "Text": " So here's how, this is how the solution works, and that is you flip a coin,"}, {"Time_Start": 2700.7000000000003, "Time_End": 2706.7000000000003, "Text": " and you look at it, and you only look at it yourself, and then you show up to the person on your right."}, {"Time_Start": 2706.7000000000003, "Time_End": 2707.7000000000003, "Text": " Okay?"}, {"Time_Start": 2707.7000000000003, "Time_End": 2709.7000000000003, "Text": " You're with me so far?"}, {"Time_Start": 2709.7000000000003, "Time_End": 2712.7000000000003, "Text": " I'll do a quick example at the end."}, {"Time_Start": 2712.7000000000003, "Time_End": 2713.7000000000003, "Text": " Now what happens is,"}, {"Time_Start": 2713.7000000000003, "Time_End": 2718.7000000000003, "Text": " is once the three have done that, and they've shown it to the person on the right,"}, {"Time_Start": 2718.7000000000003, "Time_End": 2719.7000000000003, "Text": " everyone does that."}, {"Time_Start": 2719.7000000000003, "Time_End": 2723.7000000000003, "Text": " So three people, they've each seen two of the coin tosses."}, {"Time_Start": 2723.7000000000003, "Time_End": 2726.7000000000003, "Text": " They notice where there's heads or tails,"}, {"Time_Start": 2726.7000000000003, "Time_End": 2729.7000000000003, "Text": " and what they're going to do is from the two coin tosses that they saw,"}, {"Time_Start": 2729.7000000000003, "Time_End": 2733.7000000000003, "Text": " they're going to say either same or different."}, {"Time_Start": 2733.7000000000003, "Time_End": 2735.7000000000003, "Text": " Okay?"}, {"Time_Start": 2735.7000000000003, "Time_End": 2736.7000000000003, "Text": " And they all say it out loud."}, {"Time_Start": 2736.7000000000003, "Time_End": 2740.7000000000003, "Text": " They say whether the two coin tosses were same or different."}, {"Time_Start": 2740.7000000000003, "Time_End": 2742.7000000000003, "Text": " If you have an odd number of people saying different,"}, {"Time_Start": 2742.7000000000003, "Time_End": 2748.7000000000003, "Text": " different because the person that paid for dinner is going to lie."}, {"Time_Start": 2748.7000000000003, "Time_End": 2749.7000000000003, "Text": " Okay?"}, {"Time_Start": 2749.7000000000003, "Time_End": 2752.7000000000003, "Text": " If you have an odd number of people saying different,"}, {"Time_Start": 2752.7000000000003, "Time_End": 2755.7000000000003, "Text": " then it means that someone at the table paid for dinner."}, {"Time_Start": 2755.7000000000003, "Time_End": 2760.7000000000003, "Text": " If it's an even amount, it means no one at the table paid for dinner"}, {"Time_Start": 2760.7000000000003, "Time_End": 2763.7000000000003, "Text": " in the NSA must pick up the tab."}, {"Time_Start": 2763.7000000000003, "Time_End": 2769.7000000000003, "Text": " To give you the real example of this is all three of them flip heads."}, {"Time_Start": 2769.7000000000003, "Time_End": 2770.7000000000003, "Text": " Okay?"}, {"Time_Start": 2770.7000000000003, "Time_End": 2771.7000000000003, "Text": " One of the people lie."}, {"Time_Start": 2771.7000000000003, "Time_End": 2775.7000000000003, "Text": " lies, when it comes time to say same and different."}, {"Time_Start": 2775.7000000000003, "Time_End": 2777.7000000000003, "Text": " They say different."}, {"Time_Start": 2777.7000000000003, "Time_End": 2779.7000000000003, "Text": " You got one person that said different,"}, {"Time_Start": 2779.7000000000003, "Time_End": 2782.7000000000003, "Text": " that means that one person at that table"}, {"Time_Start": 2782.7000000000003, "Time_End": 2785.7000000000003, "Text": " paid for dinner. Now, you might be saying,"}, {"Time_Start": 2785.7000000000003, "Time_End": 2787.7000000000003, "Text": " oh yeah, well, they can determine"}, {"Time_Start": 2787.7000000000003, "Time_End": 2789.7000000000003, "Text": " their heads or tails. No, we're just saying same or different."}, {"Time_Start": 2789.7000000000003, "Time_End": 2791.7000000000003, "Text": " We didn't say, I saw two heads, I saw two tails."}, {"Time_Start": 2791.7000000000003, "Time_End": 2794.7000000000003, "Text": " Nothing like that. The premise behind the paper,"}, {"Time_Start": 2794.7000000000003, "Time_End": 2796.7000000000003, "Text": " and it goes into a lot more detail, is that"}, {"Time_Start": 2796.7000000000003, "Time_End": 2800.7000000000003, "Text": " you have a no"}, {"Time_Start": 2800.7000000000003, "Time_End": 2804.7000000000003, "Text": " no way with outside taking a rubber hose and beating people"}, {"Time_Start": 2804.7000000000003, "Time_End": 2807.7000000000003, "Text": " to determine, to do any type of traffic analysis on this."}, {"Time_Start": 2807.7000000000003, "Time_End": 2810.7000000000003, "Text": " Now what's interesting is when you start applying this"}, {"Time_Start": 2810.7000000000003, "Time_End": 2814.7000000000003, "Text": " on a larger scale, let me know when I reach a good spot."}, {"Time_Start": 2814.7000000000003, "Time_End": 2815.7000000000003, "Text": " Okay."}, {"Time_Start": 2815.7000000000003, "Time_End": 2816.7000000000003, "Text": " Okay."}, {"Time_Start": 2816.7000000000003, "Time_End": 2819.7000000000003, "Text": " So applying this on a larger scale because with computers,"}, {"Time_Start": 2819.7000000000003, "Time_End": 2822.7000000000003, "Text": " I can start doing things like, you know,"}, {"Time_Start": 2822.7000000000003, "Time_End": 2827.7000000000003, "Text": " 256 or 512 coin flips at a single time."}, {"Time_Start": 2827.7000000000003, "Time_End": 2830.7000000000003, "Text": " And when I'm transmitting my coin flips to the person on my right,"}, {"Time_Start": 2830.7000000000003, "Time_End": 2834.7000000000003, "Text": " I can encrypt them, you know, using RSA or some other thing."}, {"Time_Start": 2834.7000000000003, "Time_End": 2838.7000000000003, "Text": " That's referred to as a DC net."}, {"Time_Start": 2838.7000000000003, "Time_End": 2843.7000000000003, "Text": " Okay."}, {"Time_Start": 2843.7000000000003, "Time_End": 2848.7000000000003, "Text": " Sorry, I was distracted."}, {"Time_Start": 2852.7000000000003, "Time_End": 2855.7000000000003, "Text": " The referred to as a DC net."}, {"Time_Start": 2855.7000000000003, "Time_End": 2860.7000000000003, "Text": " Some of the scaling issues were addressed in a paper that was not too"}, {"Time_Start": 2860.7000000000003, "Time_End": 2864.7000000000003, "Text": " long ago, oh by the way there's an extension because I know some of you're probably thinking,"}, {"Time_Start": 2864.7000000000003, "Time_End": 2869.7000000000003, "Text": " what if I purposely participate in that dinner and I, even though I didn't pay for dinner, I lie"}, {"Time_Start": 2869.7000000000003, "Time_End": 2870.7000000000003, "Text": " and say that I did."}, {"Time_Start": 2870.7000000000003, "Time_End": 2875.7000000000003, "Text": " There's another paper that came out of a year two after that called The Dining Cryptographers"}, {"Time_Start": 2875.7000000000003, "Time_End": 2879.7000000000003, "Text": " at the disco, which dealing with being interrupted."}, {"Time_Start": 2879.7000000000003, "Time_End": 2881.7000000000003, "Text": " Now this, folks, this is stuff from the 80s, okay?"}, {"Time_Start": 2881.7000000000003, "Time_End": 2884.7000000000003, "Text": " The stuff from the 80s that we're talking about here."}, {"Time_Start": 2884.7000000000003, "Time_End": 2890.7000000000003, "Text": " Now, somewhat fairly recently, some people at Cornell try to"}, {"Time_Start": 2890.7000000000003, "Time_End": 2896.38, "Text": " to implement a DC net and ran to some scaling issues and tried to solve it using something"}, {"Time_Start": 2896.38, "Time_End": 2898.0200000000004, "Text": " called ClickNet."}, {"Time_Start": 2898.0200000000004, "Time_End": 2903.0200000000004, "Text": " And I advise everyone to do a Google search for ClickNet and check that out."}, {"Time_Start": 2903.0200000000004, "Time_End": 2908.26, "Text": " And that says, if you can't read it in the back, that's C-O-I-Q-U-E net."}, {"Time_Start": 2908.26, "Time_End": 2913.38, "Text": " Meaning you have small clusters of, you know, let's say, seven people or so or five, whatever"}, {"Time_Start": 2913.38, "Time_End": 2918.6200000000003, "Text": " they put the cutout point out, and some of them are adjoining notes and then you create this."}, {"Time_Start": 2918.6200000000003, "Time_End": 2920.26, "Text": " Now, you can do some pretty, uh,"}, {"Time_Start": 2920.26, "Time_End": 2923.26, "Text": " pretty cool things with this."}, {"Time_Start": 2923.26, "Time_End": 2926.26, "Text": " Why don't we, I'm going to go and bring up a friend of mine,"}, {"Time_Start": 2926.26, "Time_End": 2931.26, "Text": " his name is Jason Larsen, he's worked on the hogwash project,"}, {"Time_Start": 2931.26, "Time_End": 2934.26, "Text": " and he's going to talk to you just briefly."}, {"Time_Start": 2934.26, "Time_End": 2940.26, "Text": " I'll try to keep this short, but we're probably going to go over anyway,"}, {"Time_Start": 2940.26, "Time_End": 2945.26, "Text": " but nonetheless, he's going to talk a little bit about this one more detail."}, {"Time_Start": 2945.26, "Time_End": 2968.26, "Text": " Okay, we're checking for an adapter since he's using a, uh, actually that's a pretty nice Mac there."}, {"Time_Start": 2968.26, "Time_End": 2973.26, "Text": " Okay, well, people in like the first two rows can actually see part of it now."}, {"Time_Start": 2973.26, "Time_End": 2980.26, "Text": " Let's think about things that you could put on top of this if you perfect a DC net."}, {"Time_Start": 2980.26, "Time_End": 2982.26, "Text": " Okay?"}, {"Time_Start": 2982.26, "Time_End": 2984.26, "Text": " Think about things you could put on top of this."}, {"Time_Start": 2984.26, "Time_End": 2988.26, "Text": " That's going to become really critical when I ask some questions here at the end of the audience"}, {"Time_Start": 2988.26, "Time_End": 2990.26, "Text": " instead of you asking questions of me."}, {"Time_Start": 3003.26, "Time_End": 3017.0, "Text": " This is somewhat unrehearsed, okay, folks? So, so bear with this."}, {"Time_Start": 3017.0, "Time_End": 3020.86, "Text": " But I thought it would be fun to get up a couple of people up here besides myself to talk about stuff."}, {"Time_Start": 3033.26, "Time_End": 3036.26, "Text": " You want to just go and just talk about it without slides?"}, {"Time_Start": 3036.26, "Time_End": 3037.26, "Text": " Yeah."}, {"Time_Start": 3037.26, "Time_End": 3040.26, "Text": " So can everybody hear me?"}, {"Time_Start": 3040.26, "Time_End": 3042.26, "Text": " Okay, how about now?"}, {"Time_Start": 3042.26, "Time_End": 3045.26, "Text": " Okay, simple win over most of it."}, {"Time_Start": 3045.26, "Time_End": 3050.26, "Text": " But basically when you're doing coin flips, that's basically an XOR."}, {"Time_Start": 3050.26, "Time_End": 3055.26, "Text": " So I don't know how many of you guys are familiar with what in crypto and whatnot,"}, {"Time_Start": 3055.26, "Time_End": 3062.26, "Text": " but when you start doing coin flips and XORs, that's commonly known as a one-time pad."}, {"Time_Start": 3062.26, "Time_End": 3066.26, "Text": " pad, and a one-time pad is theoretically unbreakable."}, {"Time_Start": 3066.26, "Time_End": 3075.26, "Text": " So the basis of a Danyu cryptogamous network is, yeah, everybody generates a one-time pad, passes it to the guy"}, {"Time_Start": 3075.26, "Time_End": 3079.26, "Text": " on the right, and exhores them together."}, {"Time_Start": 3079.26, "Time_End": 3083.26, "Text": " The guy that wants to put in his message, also XORs in his message."}, {"Time_Start": 3083.26, "Time_End": 3086.26, "Text": " And then everybody reveals their pads."}, {"Time_Start": 3086.26, "Time_End": 3090.26, "Text": " So when you reveal your pads, everybody exhores the pads together, and since all the pads"}, {"Time_Start": 3090.26, "Time_End": 3092.26, "Text": " has been put in twice, they exhort back out."}, {"Time_Start": 3092.26, "Time_End": 3094.0600000000004, "Text": " and what you're left with is a message."}, {"Time_Start": 3094.36, "Time_End": 3100.26, "Text": " And since it's mathematically impossible to tell the difference between two pads exhort together and three pads exhort together,"}, {"Time_Start": 3100.26, "Time_End": 3104.26, "Text": " it's mathematically impossible to tell who sent the message."}, {"Time_Start": 3104.26, "Time_End": 3110.26, "Text": " So if you really want to give the NSA and the Holbein Defense or whoever else heartburn,"}, {"Time_Start": 3110.26, "Time_End": 3114.26, "Text": " then a dynamic network is a really good way to go about it."}, {"Time_Start": 3114.26, "Time_End": 3117.26, "Text": " There are a couple more cool things you can do with it."}, {"Time_Start": 3117.26, "Time_End": 3120.26, "Text": " So, especially in the future, if"}, {"Time_Start": 3120.26, "Time_End": 3133.5600000000004, "Text": " if publishing exploits gets to be illegal, then we're going to need a better system to publish with."}, {"Time_Start": 3134.36, "Time_End": 3141.26, "Text": " So let's say that we have a group of people together, and I want to send an exploit to bug track anonymously."}, {"Time_Start": 3142.0600000000004, "Time_End": 3145.1000000000004, "Text": " And I don't want anybody else to be able to play with it."}, {"Time_Start": 3145.1000000000004, "Time_End": 3148.5, "Text": " Or let's just say I want to send it to one other person anonymously."}, {"Time_Start": 3148.5, "Time_End": 3155.8, "Text": " a cool side effect of dining cryptographers networks is that you can exchange one-time pads anonymously,"}, {"Time_Start": 3156.5, "Time_End": 3158.4, "Text": " which is basically perfect crypto."}, {"Time_Start": 3159.14, "Time_End": 3160.56, "Text": " The algorithm is pretty simple."}, {"Time_Start": 3160.86, "Time_End": 3168.76, "Text": " All you do is get everybody together in circle and have two people agree to put in messages on the same round."}, {"Time_Start": 3169.3, "Time_End": 3174.08, "Text": " So we take me, nomad, a couple other people, and we all generate one-time pads,"}, {"Time_Start": 3174.52, "Time_End": 3178.48, "Text": " throw them to the right, and then me and whoever I,"}, {"Time_Start": 3178.5, "Time_End": 3182.66, "Text": " I don't, whoever else I don't know, sticks in our one-time pads."}, {"Time_Start": 3183.5, "Time_End": 3186.72, "Text": " When you stick in your one-time pad and you X-O everybody's pads together,"}, {"Time_Start": 3187.04, "Time_End": 3189.92, "Text": " you get the simple XOR of the two pads back out."}, {"Time_Start": 3190.46, "Time_End": 3194.42, "Text": " Well, since both pads are masked by another pad,"}, {"Time_Start": 3194.52, "Time_End": 3197.9, "Text": " then it's mathematically impossible to pull out either of the pads"}, {"Time_Start": 3197.9, "Time_End": 3200.44, "Text": " because every possibility is equally likely."}, {"Time_Start": 3201.3, "Time_End": 3204.52, "Text": " So, but there are two people that can make sense of the noise."}, {"Time_Start": 3204.96, "Time_End": 3208.34, "Text": " The owners of the original two pads because they know the pads."}, {"Time_Start": 3208.5, "Time_End": 3212.68, "Text": " So you can always XO back out your own pad and get the other person's pad."}, {"Time_Start": 3213.42, "Time_End": 3220.42, "Text": " So if we want to publish an exploit and we know the NSA or whoever else is listening,"}, {"Time_Start": 3221.16, "Time_End": 3223.44, "Text": " then we just get a bunch of people together."}, {"Time_Start": 3224.8, "Time_End": 3232.14, "Text": " We exchange pads, XOR in two pads, throw away one of them, and now I have a pad."}, {"Time_Start": 3232.4, "Time_End": 3235.08, "Text": " I can send a message to everybody with impunity,"}, {"Time_Start": 3235.24, "Time_End": 3237.16, "Text": " because no matter how many CPU cycles they have,"}, {"Time_Start": 3237.16, "Time_End": 3241.3199999999997, "Text": " no matter how much research they can throw at it, is mathematically impossible to figure out the message."}, {"Time_Start": 3241.7599999999998, "Time_End": 3248.52, "Text": " I just take my new pad, XOR in my exploit, send it over to Nomad, and nobody can break it."}, {"Time_Start": 3250.12, "Time_End": 3256.2999999999997, "Text": " So one-time pads can be, or nine cryptographer's rings can be fairly fun if you want to play with them."}, {"Time_Start": 3257.2799999999997, "Time_End": 3260.8799999999997, "Text": " So another message that you can combine with it."}, {"Time_Start": 3261.2799999999997, "Time_End": 3264.8599999999997, "Text": " One of the problems with the one-time pads is there's a finite number of participants."}, {"Time_Start": 3264.8599999999997, "Time_End": 3266.96, "Text": " Say you only have a thousand people."}, {"Time_Start": 3267.16, "Time_End": 3273.7599999999998, "Text": " sitting around together, exchanging messages, you know, theoretically they can come and knock"}, {"Time_Start": 3273.7599999999998, "Time_End": 3277.24, "Text": " on a thousand doors and take your computers and life isn't good."}, {"Time_Start": 3278.56, "Time_End": 3284.2, "Text": " So one method to get around that is just to solicit participants from other countries."}, {"Time_Start": 3284.7, "Time_End": 3288.94, "Text": " So one of the nice things is the NSAs of the world don't usually talk to each other,"}, {"Time_Start": 3288.94, "Time_End": 3294.6, "Text": " and they don't like people picking on each other's citizens."}, {"Time_Start": 3294.6, "Time_End": 3296.72, "Text": " So to get a few guys from Russia, a few guys from Russia,"}, {"Time_Start": 3296.7200000000003, "Time_End": 3300.0800000000004, "Text": " you guys from China, then you can be reasonably secure."}, {"Time_Start": 3301.76, "Time_End": 3304.6000000000004, "Text": " So, actually, let's have some slides here."}, {"Time_Start": 3308.32, "Time_End": 3309.46, "Text": " Okay, thanks, Jason."}, {"Time_Start": 3309.6200000000003, "Time_End": 3310.5200000000004, "Text": " I want to give Jason a hand."}, {"Time_Start": 3310.6000000000004, "Time_End": 3311.1600000000003, "Text": " I appreciate it."}, {"Time_Start": 3315.6600000000003, "Time_End": 3317.7000000000003, "Text": " We can, go ahead and stay up here for a bit."}, {"Time_Start": 3317.7000000000003, "Time_End": 3320.2000000000003, "Text": " But we concocted this idea."}, {"Time_Start": 3320.36, "Time_End": 3323.94, "Text": " He had personally at D.C. Ness, and I was talking about stuff of communications at Kansak-West."}, {"Time_Start": 3324.86, "Time_End": 3326.7000000000003, "Text": " And we had the smallest, um,"}, {"Time_Start": 3326.7200000000003, "Time_End": 3329.84, "Text": " boff ever at a con, just the two of us talking with paper up."}, {"Time_Start": 3330.6400000000003, "Time_End": 3334.32, "Text": " I've got some questions for you guys. We're getting towards the end. I want you to think about"}, {"Time_Start": 3334.32, "Time_End": 3342.42, "Text": " some things here. These are what you call rhetorical or questions without really an answer here."}, {"Time_Start": 3343.34, "Time_End": 3353.28, "Text": " If you do develop unbreakable crypto, how long do you think, good God, I haven't fallen on me."}, {"Time_Start": 3353.9, "Time_End": 3356.0600000000004, "Text": " How long do you think that that unbreakable crypto, how long do you think that that unbreakable crypto, how long do you think that"}, {"Time_Start": 3356.06, "Time_End": 3358.94, "Text": " that unbreakable crypto is going to remain legal."}, {"Time_Start": 3360.94, "Time_End": 3361.64, "Text": " Think about it."}, {"Time_Start": 3363.2, "Time_End": 3365.38, "Text": " I didn't have to speculate on that."}, {"Time_Start": 3366.74, "Time_End": 3375.88, "Text": " If you open source perfect crypto and it gets you into trouble,"}, {"Time_Start": 3378.62, "Time_End": 3381.92, "Text": " I'm wondering if under the Cybersecurity Enhancement Act,"}, {"Time_Start": 3382.56, "Time_End": 3385.56, "Text": " if you could be put in jail for life as aiding and abetting cybertelling cybertaic"}, {"Time_Start": 3385.56, "Time_End": 3391.7799999999997, "Text": " cyber terrorism. I mean, the applications of this are obvious. I mean, you could have dissonance"}, {"Time_Start": 3391.7799999999997, "Time_End": 3397.42, "Text": " living inside of, you know, oppressed countries being able to get messages out to people"}, {"Time_Start": 3397.42, "Time_End": 3402.54, "Text": " and people able to get messages into them using various combinations of all these techniques"}, {"Time_Start": 3402.54, "Time_End": 3410.58, "Text": " we've been talking about. But if bad guys can use it and it's unbreakable, and we talked about"}, {"Time_Start": 3410.58, "Time_End": 3415.2999999999997, "Text": " what they were possibly capable of breaking. If you've got stuff that you can't break,"}, {"Time_Start": 3415.56, "Time_End": 3417.56, "Text": " How much trouble you're going to get into?"}, {"Time_Start": 3417.56, "Time_End": 3421.06, "Text": " A couple of other things I want to bring up, just while I'm thinking about it."}, {"Time_Start": 3421.06, "Time_End": 3429.56, "Text": " There's a movement right now to push forward the government version of, it's kind of like a cyber corps."}, {"Time_Start": 3429.56, "Time_End": 3431.56, "Text": " Is people heard about this?"}, {"Time_Start": 3431.56, "Time_End": 3433.56, "Text": " A few people are not in their heads."}, {"Time_Start": 3433.56, "Time_End": 3437.56, "Text": " Cybercore, you know, there's some kind of government-sponsored program on this."}, {"Time_Start": 3437.56, "Time_End": 3444.56, "Text": " I want to know, is it possible for me to form a cyber militia in response to that?"}, {"Time_Start": 3444.56, "Time_End": 3446.56, "Text": " Something to ponder."}, {"Time_Start": 3446.56, "Time_End": 3449.56, "Text": " A few people seem to like that one."}, {"Time_Start": 3449.56, "Time_End": 3454.56, "Text": " I got a question involving free speech for you to think about."}, {"Time_Start": 3454.56, "Time_End": 3462.56, "Text": " It's always been questionable whether crypto or code is actually considered free speech."}, {"Time_Start": 3462.56, "Time_End": 3468.56, "Text": " There's been some people say yes, some people say no, there's court rulings and whatnot."}, {"Time_Start": 3468.56, "Time_End": 3473.56, "Text": " Would it make speeches like this illegal if crypto,"}, {"Time_Start": 3473.56, "Time_End": 3479.56, "Text": " if crypto and code was not considered free speech."}, {"Time_Start": 3479.56, "Time_End": 3483.56, "Text": " And also one other question, this one I think there is an answer for."}, {"Time_Start": 3483.56, "Time_End": 3490.56, "Text": " If I'm busted on any charge, could someone please call Jennifer Granick on my behalf?"}, {"Time_Start": 3490.56, "Time_End": 3495.56, "Text": " Just, you know, just in case."}, {"Time_Start": 3495.56, "Time_End": 3500.56, "Text": " That's pretty much all I have. I've gone over on time."}, {"Time_Start": 3500.56, "Time_End": 3502.56, "Text": " I've got one thing I want to do."}, {"Time_Start": 3502.56, "Time_End": 3503.56, "Text": " I need to give."}, {"Time_Start": 3503.56, "Time_End": 3506.56, "Text": " I need to get one volunteer."}, {"Time_Start": 3506.56, "Time_End": 3510.56, "Text": " Okay, you right here. Come here."}, {"Time_Start": 3510.56, "Time_End": 3515.56, "Text": " See, some of these times, a volunteer."}, {"Time_Start": 3515.56, "Time_End": 3518.56, "Text": " There you go. You get a free computer."}, {"Time_Start": 3518.56, "Time_End": 3522.56, "Text": " There's your computer. I was told to give one away."}, {"Time_Start": 3522.56, "Time_End": 3524.56, "Text": " That's it?"}, {"Time_Start": 3524.56, "Time_End": 3525.56, "Text": " That's it."}, {"Time_Start": 3525.56, "Time_End": 3527.56, "Text": " Go sit down, don't it."}, {"Time_Start": 3533.56, "Time_End": 3539.56, "Text": " Yes, I know. It's made out of fine steel."}, {"Time_Start": 3539.56, "Time_End": 3542.56, "Text": " That's before we got really good on it."}, {"Time_Start": 3542.56, "Time_End": 3547.56, "Text": " There's a few shirts here, though, is when I wanted to give away to some of the people here."}, {"Time_Start": 3547.56, "Time_End": 3554.56, "Text": " This is kind of what I consider this talk and everything else this actually to be about."}, {"Time_Start": 3554.56, "Time_End": 3555.56, "Text": " Okay?"}, {"Time_Start": 3555.56, "Time_End": 3558.56, "Text": " Hactivism is not defacing web servers."}, {"Time_Start": 3558.56, "Time_End": 3560.56, "Text": " That's not what it's about."}, {"Time_Start": 3560.56, "Time_End": 3562.56, "Text": " That doesn't get your message out across to anybody."}, {"Time_Start": 3562.56, "Time_End": 3565.56, "Text": " to anybody in a real positive way."}, {"Time_Start": 3565.56, "Time_End": 3569.56, "Text": " It's trying to do some of the things that we've been talking about here in these directions."}, {"Time_Start": 3569.56, "Time_End": 3574.56, "Text": " A lot of people out there, like I said, I've done only a very little bit of work myself."}, {"Time_Start": 3574.56, "Time_End": 3579.56, "Text": " A lot of people out there who have done this, are doing work like this,"}, {"Time_Start": 3579.56, "Time_End": 3581.56, "Text": " there needs to be encouraged."}, {"Time_Start": 3581.56, "Time_End": 3585.56, "Text": " And so we'll just throw one out there for someone to grab."}, {"Time_Start": 3585.56, "Time_End": 3589.56, "Text": " I just want to make the point."}, {"Time_Start": 3589.56, "Time_End": 3591.56, "Text": " I was talking with someone from the end."}, {"Time_Start": 3591.56, "Time_End": 3595.56, "Text": " Someone from the EFF over at Hard Rock."}, {"Time_Start": 3595.56, "Time_End": 3598.56, "Text": " There's another one out there."}, {"Time_Start": 3598.56, "Time_End": 3602.56, "Text": " I was talking to someone at the EFF, and I was telling a little bit about my talking."}, {"Time_Start": 3602.56, "Time_End": 3604.56, "Text": " I said, you're sounding..."}, {"Time_Start": 3604.56, "Time_End": 3607.56, "Text": " Asshole."}, {"Time_Start": 3607.56, "Time_End": 3610.56, "Text": " You sound cynical."}, {"Time_Start": 3610.56, "Time_End": 3615.56, "Text": " And I said, well, yeah, I probably do come across as cynical when it comes to this kind of stuff,"}, {"Time_Start": 3615.56, "Time_End": 3616.56, "Text": " and I don't mean to."}, {"Time_Start": 3616.56, "Time_End": 3620.56, "Text": " I mean to try to be somewhat positive in this and whatnot."}, {"Time_Start": 3620.56, "Time_End": 3621.56, "Text": " And so I was told you."}, {"Time_Start": 3621.56, "Time_End": 3624.56, "Text": " to pass on this message from the EFF."}, {"Time_Start": 3624.56, "Time_End": 3627.56, "Text": " And by the way, the organizations like EFF and EPEC"}, {"Time_Start": 3627.56, "Time_End": 3629.56, "Text": " really deserve our support."}, {"Time_Start": 3629.56, "Time_End": 3631.56, "Text": " And they actually deserve a round of applause."}, {"Time_Start": 3631.56, "Time_End": 3634.56, "Text": " They do actually try to do a lot of good for us."}, {"Time_Start": 3638.56, "Time_End": 3641.56, "Text": " How many people here have access to $100?"}, {"Time_Start": 3643.56, "Time_End": 3646.56, "Text": " Do you think you could probably get to $100?"}, {"Time_Start": 3646.56, "Time_End": 3650.56, "Text": " It would be really interesting if every single DefCon attendee"}, {"Time_Start": 3650.56, "Time_End": 3655.56, "Text": " was able to give the EFF $100."}, {"Time_Start": 3655.56, "Time_End": 3656.56, "Text": " Okay?"}, {"Time_Start": 3656.56, "Time_End": 3659.56, "Text": " Because that adds up to like a whole bunch of dollars."}, {"Time_Start": 3659.56, "Time_End": 3660.56, "Text": " All right?"}, {"Time_Start": 3660.56, "Time_End": 3662.56, "Text": " I don't know how many attendees."}, {"Time_Start": 3662.56, "Time_End": 3664.56, "Text": " I've heard of anywhere from 3,000 to 5,000 this year."}, {"Time_Start": 3664.56, "Time_End": 3666.56, "Text": " Which is just phenomenal."}, {"Time_Start": 3666.56, "Time_End": 3670.56, "Text": " Imagine what can be done with that type of money there."}, {"Time_Start": 3670.56, "Time_End": 3673.56, "Text": " Another thing, and I really do encourage you to do this,"}, {"Time_Start": 3673.56, "Time_End": 3677.56, "Text": " it makes a huge difference whether you believe it or not."}, {"Time_Start": 3677.56, "Time_End": 3679.56, "Text": " It really just make a difference."}, {"Time_Start": 3679.56, "Time_End": 3680.56, "Text": " Write a letter."}, {"Time_Start": 3680.56, "Time_End": 3683.56, "Text": " with your thoughts. Don't do this in email."}, {"Time_Start": 3683.56, "Time_End": 3687.56, "Text": " Do this by hand. That really gets their attention."}, {"Time_Start": 3687.56, "Time_End": 3690.56, "Text": " Write it out by hand to your congressperson,"}, {"Time_Start": 3690.56, "Time_End": 3694.56, "Text": " if you've got a problem with one of the laws that is being proposed,"}, {"Time_Start": 3694.56, "Time_End": 3696.56, "Text": " or even a law this past."}, {"Time_Start": 3696.56, "Time_End": 3698.56, "Text": " Because all those Congress people,"}, {"Time_Start": 3698.56, "Time_End": 3701.56, "Text": " they're all worried about the people that elected them,"}, {"Time_Start": 3701.56, "Time_End": 3703.56, "Text": " and they all want to make sure they remain in office."}, {"Time_Start": 3703.56, "Time_End": 3706.56, "Text": " And they've done all kinds of mathematical statistics on the fact"}, {"Time_Start": 3706.56, "Time_End": 3709.56, "Text": " that for every one letter, there's a thousand people who are"}, {"Time_Start": 3709.56, "Time_End": 3711.56, "Text": " if, you know, a thousand people that think this way,"}, {"Time_Start": 3711.56, "Time_End": 3713.56, "Text": " oh my gosh, I'm going to pay attention to it."}, {"Time_Start": 3713.56, "Time_End": 3715.56, "Text": " Those letters do matter,"}, {"Time_Start": 3715.56, "Time_End": 3719.56, "Text": " and if they start coming in volume over some of these things you're concerned about,"}, {"Time_Start": 3719.56, "Time_End": 3721.56, "Text": " then we can do something."}, {"Time_Start": 3721.56, "Time_End": 3724.56, "Text": " Now, I know a lot of you would prefer to code."}, {"Time_Start": 3724.56, "Time_End": 3725.56, "Text": " Okay?"}, {"Time_Start": 3725.56, "Time_End": 3728.56, "Text": " And I know some of you have probably never licked a stamp."}, {"Time_Start": 3728.56, "Time_End": 3730.56, "Text": " And let me tell you, don't lick the stamps,"}, {"Time_Start": 3730.56, "Time_End": 3733.56, "Text": " because they've got sticky stuff in the back now, and it tastes like,"}, {"Time_Start": 3733.56, "Time_End": 3734.56, "Text": " shit."}, {"Time_Start": 3734.56, "Time_End": 3737.56, "Text": " But, I mean, you know, and see, I caught some of you saying,"}, {"Time_Start": 3737.56, "Time_End": 3738.56, "Text": " yeah, yeah, look a stamp."}, {"Time_Start": 3738.56, "Time_End": 3739.56, "Text": " He's like, no, no."}, {"Time_Start": 3739.56, "Time_End": 3740.66, "Text": " No, they don't do that anymore."}, {"Time_Start": 3740.74, "Time_End": 3741.5, "Text": " That's a long time ago."}, {"Time_Start": 3743.1, "Time_End": 3751.48, "Text": " So you've got to, you know, do a few things, you know, give, you know, try to give back a little bit."}, {"Time_Start": 3752.4, "Time_End": 3755.32, "Text": " And I think we'll make a pretty big difference."}, {"Time_Start": 3756.42, "Time_End": 3760.48, "Text": " And that's pretty much, but wait, there's more."}, {"Time_Start": 3760.84, "Time_End": 3762.52, "Text": " They're going to kill me for going over on this."}, {"Time_Start": 3762.6, "Time_End": 3765.86, "Text": " It's just, can you do this in like, like, three or four minutes?"}, {"Time_Start": 3767.12, "Time_End": 3768.42, "Text": " Yeah, or maybe two."}, {"Time_Start": 3769.56, "Time_End": 3776.56, "Text": " One other thing that's going on that I'm going to have Steve come up here and give you a quick synopsis"}, {"Time_Start": 3776.56, "Time_End": 3783.56, "Text": " on yet another little thing that's going on, and he promises to the people running the place, I'll be quick."}, {"Time_Start": 3784.56, "Time_End": 3789.56, "Text": " Okay, we announced this at Black Hat, so you know any of you guys that were there, probably I already know about it."}, {"Time_Start": 3790.2599999999998, "Time_End": 3796.32, "Text": " But Vonwatch, in conjunction with Packet Storm, the open source vulnerability database project,"}, {"Time_Start": 3796.88, "Time_End": 3799.16, "Text": " and a few other open source free."}, {"Time_Start": 3799.56, "Time_End": 3803.22, "Text": " information sources have announced kind of a little bit of an alliance."}, {"Time_Start": 3803.64, "Time_End": 3808.4, "Text": " Basically what we're going to do is we're going to work together to pool our resources and give a centralized spot."}, {"Time_Start": 3808.88, "Time_End": 3814.38, "Text": " I think probably the key part of the whole thing is we are going to have an open source vulnerability database"}, {"Time_Start": 3814.38, "Time_End": 3819.7799999999997, "Text": " that everyone can contribute to, everyone can add to it, everyone can access it, everyone can use it."}, {"Time_Start": 3820.1, "Time_End": 3824.84, "Text": " It's going to be completely free, it's not-for-profit, you know, it'll never be sold, all that kind of fun stuff."}, {"Time_Start": 3825.6, "Time_End": 3828.62, "Text": " Pretty much it. The website's is-is-is-I-org."}, {"Time_Start": 3829.56, "Time_End": 3831.1, "Text": " Thank you."}, {"Time_Start": 3834.2999999999997, "Time_End": 3837.52, "Text": " Because truthfully, information really does want to be free."}, {"Time_Start": 3837.84, "Time_End": 3844.38, "Text": " And when he says free, I mean, if you're a commercial vendor out there, you can grab the data, pull it in, resell it, do whatever you want to do."}, {"Time_Start": 3844.7, "Time_End": 3846.68, "Text": " But the raw source of it's going to be free."}, {"Time_Start": 3847.14, "Time_End": 3848.24, "Text": " Just keep that in mind."}, {"Time_Start": 3848.88, "Time_End": 3856.24, "Text": " Normally, I would take questions on this, and you're probably going to wonder, because I really don't, a couple of things."}, {"Time_Start": 3856.24, "Time_End": 3859.54, "Text": " Deaddreamers.com for all the graphics, which was where I was right."}, {"Time_Start": 3859.56, "Time_End": 3860.4, "Text": " I nabbed them from."}, {"Time_Start": 3860.48, "Time_End": 3864.66, "Text": " Hopefully I didn't violate any, the DMCA by putting them up here in front of you today."}, {"Time_Start": 3865.96, "Time_End": 3868.02, "Text": " I did give him credit, which is what he asked for, though."}, {"Time_Start": 3869.32, "Time_End": 3875.24, "Text": " To kind of tie this together, the last thought that I want to leave you with, okay?"}, {"Time_Start": 3875.7, "Time_End": 3881.72, "Text": " And this says, again, we get back to a little bit of politics here."}, {"Time_Start": 3881.72, "Time_End": 3883.52, "Text": " Our government, okay?"}, {"Time_Start": 3884.34, "Time_End": 3889.54, "Text": " Our government has gone to great lengths to try to protect."}, {"Time_Start": 3889.56, "Time_End": 3894.1, "Text": " us and they do a variety of things in their efforts to try to protect us."}, {"Time_Start": 3894.7, "Time_End": 3900.82, "Text": " And those are appreciated by a lot of us, but sometimes in their effort, they're a little bit"}, {"Time_Start": 3900.82, "Time_End": 3901.6, "Text": " overzealous."}, {"Time_Start": 3902.86, "Time_End": 3906.2999999999997, "Text": " And we have to keep that kind of stuff in check."}, {"Time_Start": 3907.1, "Time_End": 3914.54, "Text": " Now, you currently have a government that is declaring war on concepts."}, {"Time_Start": 3915.7799999999997, "Time_End": 3916.06, "Text": " Okay?"}, {"Time_Start": 3916.86, "Time_End": 3918.36, "Text": " They're declaring war on concepts."}, {"Time_Start": 3918.36, "Time_End": 3919.54, "Text": " Remember the war on."}, {"Time_Start": 3919.56, "Time_End": 3924.7999999999997, "Text": " drugs. What was that one? Wow. That was a really good war, wasn't it?"}, {"Time_Start": 3925.7999999999997, "Time_End": 3929.42, "Text": " Wasn't that successful? What was the big thing? Don't say no?"}, {"Time_Start": 3930.52, "Time_End": 3940.04, "Text": " Or just say no. That was it. Or yeah, don't say no. There you go. Ooh. Yeah. Just say no."}, {"Time_Start": 3940.22, "Time_End": 3945.02, "Text": " What the hell does that mean? That's like going up to a homeless person saying,"}, {"Time_Start": 3945.02, "Time_End": 3949.54, "Text": " just get a house. You know? I mean, this is the kind of"}, {"Time_Start": 3949.56, "Time_End": 3954.82, "Text": " you know, wondrous thinking we got coming from our government. Now we have a war on terrorism."}, {"Time_Start": 3955.74, "Time_End": 3961.88, "Text": " Okay? We're not officially and technically, constitutionally at war with anyone."}, {"Time_Start": 3963.02, "Time_End": 3967.2599999999998, "Text": " We have a, in anything else, there's a war on terrorism."}, {"Time_Start": 3968.94, "Time_End": 3975.6, "Text": " Now, with the whole rise of these transnational conglomerate corporations that are essentially running everything,"}, {"Time_Start": 3976.44, "Time_End": 3979.38, "Text": " and the continued fall of the nation-state,"}, {"Time_Start": 3979.56, "Time_End": 3984.56, "Text": " As things continue to fall down and the borders start disappearing, in large part"}, {"Time_Start": 3984.56, "Time_End": 3986.56, "Text": " to technology."}, {"Time_Start": 3986.56, "Time_End": 3987.56, "Text": " Okay?"}, {"Time_Start": 3987.56, "Time_End": 3997.56, "Text": " The Hacker Nation, us, we're increasingly becoming subject to an unspoken war, all right?"}, {"Time_Start": 3997.56, "Time_End": 4002.56, "Text": " You want to be able to communicate securely from one person to another."}, {"Time_Start": 4002.56, "Time_End": 4009.54, "Text": " You want to be able to do that whether you're talking about recipes for cracking"}, {"Time_Start": 4009.56, "Time_End": 4016.48, "Text": " some service running on a system or recipes for cookies."}, {"Time_Start": 4017.44, "Time_End": 4018.88, "Text": " And I'm talking about the kind you eat."}, {"Time_Start": 4019.42, "Time_End": 4024.4, "Text": " Okay? It doesn't matter. If you want that conversation to be private, then it should be."}, {"Time_Start": 4024.7999999999997, "Time_End": 4029.06, "Text": " Okay? So I want you able to think about that. If people have got questions, do you want to"}, {"Time_Start": 4029.06, "Time_End": 4033.48, "Text": " try to grab me later? That's great. Well, I'm not going to take questions now. I went way over"}, {"Time_Start": 4033.48, "Time_End": 4038.68, "Text": " and I'm sorry on that. But there you, Howard. Thanks a lot for carrying. Thank you very much."}, {"Time_Start": 4039.56, "Time_End": 4041.56, "Text": " Thank you."}]}