{"segments": [{"Time_Start": 0.0, "Time_End": 12.0, "Text": " Welcome to my talk on the trusted computing platform alliance, the motherboard of all big brothers."}, {"Time_Start": 12.0, "Time_End": 18.0, "Text": " I'm Lucky Green. Some of you may have seen me some talks here before in years past."}, {"Time_Start": 18.0, "Time_End": 27.0, "Text": " This one will be a somewhat unusual talk. The reason why it will be unusual is because you will hear a tale of epic proportions."}, {"Time_Start": 27.0, "Time_End": 30.94, "Text": " You will hear about conspiracies and deceit."}, {"Time_Start": 30.94, "Time_End": 39.64, "Text": " You will hear details about conspiracies that, some certainly would say are conspiracies that have been going on in some cases for as much as seven years."}, {"Time_Start": 40.56, "Time_End": 52.24, "Text": " I'm quite glad that I've been scheduled after this very interesting talk by a scholar of attorneys which had certainly addressed some of the details of the DMCA."}, {"Time_Start": 53.24, "Time_End": 56.980000000000004, "Text": " Because this talk, too, will, by necessity, even though it's mostly a technicalist,"}, {"Time_Start": 57.0, "Time_End": 67.0, "Text": " technical talk have to address some of the issues that DMCA is raising probably the most of us that are interested in how our equipment works."}, {"Time_Start": 67.0, "Time_End": 79.0, "Text": " Some of you may have heard since of Microsoft's Palladium initiative, which is very much related to the initiatives of the Trusted Computing Platform Alliance."}, {"Time_Start": 79.0, "Time_End": 86.0, "Text": " I won't talk about Palladium specifically, except that Palladium is really a"}, {"Time_Start": 86.0, "Time_End": 95.0, "Text": " is really a subsection of the TCPA with some slide modifications."}, {"Time_Start": 95.0, "Time_End": 98.0, "Text": " The Palladium effort grew out of the TCP effort."}, {"Time_Start": 98.0, "Time_End": 102.0, "Text": " Microsoft has made some minor changes to the underlying architecture,"}, {"Time_Start": 102.0, "Time_End": 106.0, "Text": " but many of the components and most importantly all the conclusions remain intact."}, {"Time_Start": 106.0, "Time_End": 112.0, "Text": " So, first of all, what is the TCPA and what are its business objectives?"}, {"Time_Start": 112.0, "Time_End": 115.0, "Text": " The TCPA's business objective that..."}, {"Time_Start": 115.0, "Time_End": 124.0, "Text": " the objectives are fairly straightforward. Its members wish to prevent the use of unlicensed software,"}, {"Time_Start": 124.0, "Time_End": 142.0, "Text": " such as, say, copies of Microsoft Word licensing fees, or that could be copies of an operating system, but naturally it also will be copies of digital content."}, {"Time_Start": 142.0, "Time_End": 148.7, "Text": " A key component of TCPA is to mandate and make stick."}, {"Time_Start": 148.7, "Time_End": 155.5, "Text": " From a technical perspective, not just from the legal perspective that the DMCA allows you to make copy protection stick."}, {"Time_Start": 155.5, "Time_End": 159.5, "Text": " From a technical perspective, make it stick that you will not be able to rip CDs,"}, {"Time_Start": 159.5, "Time_End": 161.5, "Text": " you will not be able to create divixes."}, {"Time_Start": 161.5, "Time_End": 166.5, "Text": " It will plug the analog hole, and I will later get into what the analog hole is all about,"}, {"Time_Start": 166.5, "Time_End": 170.0, "Text": " and why Senator Hollings is very much interested in the analog hole."}, {"Time_Start": 170.0, "Time_End": 175.0, "Text": " It will, which is probably the most insidious aspect of the TCPA,"}, {"Time_Start": 175.0, "Time_End": 181.0, "Text": " enable a truly Orwellian information flow control scheme that is so far unthinkable"}, {"Time_Start": 181.0, "Time_End": 185.0, "Text": " because the technology is until the TCPA simply hasn't existed."}, {"Time_Start": 185.0, "Time_End": 194.0, "Text": " Lastly, perhaps not lastly, an additional objective of the TCPA is to grow the market for the PCs."}, {"Time_Start": 194.0, "Time_End": 196.0, "Text": " Here's why."}, {"Time_Start": 196.0, "Time_End": 199.0, "Text": " One of the TCPA's founding members is Intel Corporation."}, {"Time_Start": 199.0, "Time_End": 206.0, "Text": " Intel, as most of you know, makes most a fair chunk of its money from PC microprocessors."}, {"Time_Start": 206.0, "Time_End": 212.0, "Text": " Intel owns most of the market of the PC microprocessor, really AMD is only left as a competitor,"}, {"Time_Start": 212.0, "Time_End": 214.0, "Text": " not a very big one from Intel's perspective."}, {"Time_Start": 214.0, "Time_End": 217.0, "Text": " So how does Intel grow the company?"}, {"Time_Start": 217.0, "Time_End": 222.0, "Text": " As far as Intel is concerned, the way to grow the company is by growing the market for PCs."}, {"Time_Start": 222.0, "Time_End": 228.98, "Text": " One market niche that has been identified are home entertainment center PCs, such as many"}, {"Time_Start": 229.0, "Time_End": 233.76, "Text": " folks already have set up their own video servers and MP3 servers at home."}, {"Time_Start": 233.76, "Time_End": 238.24, "Text": " It's quite clear that there's a consumer market for such a product. Intel intends to be providing"}, {"Time_Start": 238.24, "Time_End": 246.0, "Text": " the chips. And then an issue that, of course, can never be forgotten. Whenever you see these"}, {"Time_Start": 246.0, "Time_End": 250.96, "Text": " large industry initiatives, they cannot be pulled off without government cooperation or perhaps"}, {"Time_Start": 250.96, "Time_End": 256.0, "Text": " one should say government collusion. The government too has some objectives. They wish to see"}, {"Time_Start": 256.0, "Time_End": 258.98, "Text": " their operational needs met. That could be the end."}, {"Time_Start": 259.0, "Time_End": 270.0, "Text": " FBI that could be the Office of Homeland Security, the NSA, and let's not forget about non-U.S. law enforcement agencies, which have needs of their own that are perhaps some are different from the needs of those in the US."}, {"Time_Start": 270.0, "Time_End": 274.0, "Text": " How does TCP accomplish these business objectives?"}, {"Time_Start": 274.0, "Time_End": 281.0, "Text": " It does so to sum it up in one sentence by preventing the owner of a computer from obtaining route access."}, {"Time_Start": 281.0, "Time_End": 282.0, "Text": " That is you."}, {"Time_Start": 282.0, "Time_End": 288.0, "Text": " By taking away a route from the owner and giving root to"}, {"Time_Start": 288.0, "Time_End": 294.24, "Text": " to third parties, such as those mentioned on the previous slide, and making it stick"}, {"Time_Start": 294.24, "Time_End": 298.76, "Text": " from a technical perspective, the members of the TCPA believe that they can finally do away with"}, {"Time_Start": 298.76, "Time_End": 306.0, "Text": " all these pescy cracks and hacks and serial numbers and binary patches to MSO.DLL"}, {"Time_Start": 306.0, "Time_End": 309.8, "Text": " that will make the registration codes go away and all these other things that they feel"}, {"Time_Start": 309.8, "Time_End": 311.64, "Text": " are costing them money."}, {"Time_Start": 311.64, "Time_End": 312.88, "Text": " How is this accomplished?"}, {"Time_Start": 312.88, "Time_End": 317.98, "Text": " It's accomplished by adding a whole new mode to either the chipset, or"}, {"Time_Start": 318.0, "Time_End": 319.0, "Text": " or the CPU."}, {"Time_Start": 319.0, "Time_End": 321.4, "Text": " There will be three levels of access."}, {"Time_Start": 321.4, "Time_End": 328.0, "Text": " Privileged access, which is available to TCPA members only and their clientele."}, {"Time_Start": 328.0, "Time_End": 333.14, "Text": " Underprivileged access, which will be available to you."}, {"Time_Start": 333.14, "Time_End": 339.88, "Text": " And unprivileged access, which will be available to TCPA, to non-TCPA applications, basically"}, {"Time_Start": 339.88, "Time_End": 344.68, "Text": " general code that you simply don't trust."}, {"Time_Start": 344.68, "Time_End": 346.6, "Text": " Where is all of this coming from?"}, {"Time_Start": 346.6, "Time_End": 350.82000000000005, "Text": " The trusted computing platform alliance has a somewhat interesting history."}, {"Time_Start": 350.82000000000005, "Time_End": 355.92, "Text": " It grew out of a number of efforts, certainly process idea at Intel, big failure, big public"}, {"Time_Start": 355.92, "Time_End": 362.26000000000005, "Text": " failure in 1998, but just because Intel was crucified by the press, and at the time by its competitor"}, {"Time_Start": 362.26000000000005, "Time_End": 365.16, "Text": " AMD does not mean that the ideas have gone away."}, {"Time_Start": 365.16, "Time_End": 370.96000000000004, "Text": " It simply means that the ideas have somewhat changed and the implementation cycles have lengthened."}, {"Time_Start": 370.96000000000004, "Time_End": 374.28000000000003, "Text": " The implementation is still very much on track."}, {"Time_Start": 374.28000000000003, "Time_End": 376.58000000000004, "Text": " The concept of encrypted CPU instruction sets."}, {"Time_Start": 376.6, "Time_End": 382.6, "Text": " When I first heard about encrypted CPU instruction sets coming out of Intel, I think it was in 1995."}, {"Time_Start": 382.6, "Time_End": 390.6, "Text": " At the time, Intel fully intended to roll out encrypted CPU instruction sets as the second phase after the processor ID."}, {"Time_Start": 390.6, "Time_End": 401.6, "Text": " When the processor ID went down in flames, Intel decided that perhaps now might not be such a good idea to roll out encrypted instructions sets or suffer the same fate."}, {"Time_Start": 401.6, "Time_End": 404.6, "Text": " So encrypted instructions sets again have been put on the back burner."}, {"Time_Start": 404.6, "Time_End": 405.6, "Text": " They have not gone away."}, {"Time_Start": 405.6, "Time_End": 406.6, "Text": " away."}, {"Time_Start": 406.6, "Time_End": 412.36, "Text": " The international cryptography framework by HP, a few people remember, it was a fairly big initiative."}, {"Time_Start": 412.36, "Time_End": 416.36, "Text": " And then of course, smart cars on the motherboard, which IBM is working on, and a few other initiatives"}, {"Time_Start": 416.36, "Time_End": 418.92, "Text": " that I don't really want to get into at this point."}, {"Time_Start": 418.92, "Time_End": 421.36, "Text": " Who is the TCPA?"}, {"Time_Start": 421.36, "Time_End": 428.12, "Text": " The TCPA was founded in 1996 by Intel, Microsoft, HP, Compa, and IBM."}, {"Time_Start": 428.12, "Time_End": 432.92, "Text": " There are many DRM initiatives out there."}, {"Time_Start": 432.92, "Time_End": 435.58000000000004, "Text": " Some of them are far happening."}, {"Time_Start": 435.6, "Time_End": 439.6, "Text": " founded by the content owners. This is a different initiative."}, {"Time_Start": 439.6, "Time_End": 445.6, "Text": " Intel, obviously, Microsoft is the largest operating system and application vendor on the planet."}, {"Time_Start": 445.6, "Time_End": 453.6, "Text": " HP Compact and IMBM, between them, on a fair share of certainly the business side of the platform market."}, {"Time_Start": 453.6, "Time_End": 458.6, "Text": " And Intel, of course, provides the CPUs to the vast majority of these PCs."}, {"Time_Start": 458.6, "Time_End": 463.6, "Text": " So really, the TCPA is a form of platform product vendors."}, {"Time_Start": 463.6, "Time_End": 465.58000000000004, "Text": " Who has, since the initial,"}, {"Time_Start": 465.6, "Time_End": 468.6, "Text": " members joined the TCPA actively."}, {"Time_Start": 468.6, "Time_End": 473.6, "Text": " On the CPU side, we have Intel, advanced micro devices in Motorola."}, {"Time_Start": 473.6, "Time_End": 480.6, "Text": " Hands up here who has, for their daily primary computer, is using a PC that is not using a CPU"}, {"Time_Start": 480.6, "Time_End": 482.6, "Text": " by one of these three operating system vendors."}, {"Time_Start": 482.6, "Time_End": 486.6, "Text": " One, two, three, four, okay, we have a few."}, {"Time_Start": 486.6, "Time_End": 487.6, "Text": " Not very many."}, {"Time_Start": 487.6, "Time_End": 492.6, "Text": " The bias and chips set vendors, or as I'd say, the bias vendors and some specialized chip vendors,"}, {"Time_Start": 492.6, "Time_End": 494.6, "Text": " Phoenix slash award, they have merged."}, {"Time_Start": 494.6, "Time_End": 501.6, "Text": " AMI, a national semiconductor, which again, amongst them, accounts to the overwhelming"}, {"Time_Start": 501.6, "Time_End": 503.6, "Text": " majority of the buyer's market."}, {"Time_Start": 503.6, "Time_End": 508.6, "Text": " On the security side, perennial favorites, VeriSyne, wave systems, RSA security,"}, {"Time_Start": 508.6, "Time_End": 514.6, "Text": " checkpoints, certain, micro, semantic, clipwire, and the Swiss crypto AG,"}, {"Time_Start": 514.6, "Time_End": 520.6, "Text": " which is probably best known for the fact that they actually put our NSA traps into their equipment"}, {"Time_Start": 520.6, "Time_End": 524.58, "Text": " for many years, one of their sales folks was arrested by the Iranian"}, {"Time_Start": 524.6, "Time_End": 529.6, "Text": " government must have been at least 10 years ago for selling the Iranian government,"}, {"Time_Start": 529.6, "Time_End": 532.6, "Text": " NSA spiked equipment."}, {"Time_Start": 532.6, "Time_End": 538.6, "Text": " Crypto AG immediately fired the poor guy who was rotting in an Iranian jail, even though he was"}, {"Time_Start": 538.6, "Time_End": 542.6, "Text": " their best-selling salesman of the company, had been so for many years."}, {"Time_Start": 542.6, "Time_End": 547.6, "Text": " Not really, as is it, it's essentially the European vendor branch of the NSA."}, {"Time_Start": 547.6, "Time_End": 554.6, "Text": " On the application side, we have Microsoft little surprise there, and Adobe, very little surprise"}, {"Time_Start": 554.6, "Time_End": 559.1, "Text": " There, the Scarletoff case that you heard about just in the presentation earlier, of course, was all about Adobe."}, {"Time_Start": 559.1, "Time_End": 564.6, "Text": " Adobe called the FBI to ask the FBI to please pick up Scalov on criminal charges."}, {"Time_Start": 564.6, "Time_End": 570.6, "Text": " Adobe later on distanced themselves from their activities, but the bottom line is it was Adobe who got it all started."}, {"Time_Start": 570.6, "Time_End": 579.6, "Text": " System site, again, you have seen these names, HP, IBM, Dell, Gateway, Fujitsu, Samsung, to Shiva."}, {"Time_Start": 579.6, "Time_End": 584.6, "Text": " All the major platform vendors, all the major, uh, laptop."}, {"Time_Start": 584.6, "Time_End": 587.6, "Text": " of Venice, except Sony, which is a different story I'll are addressed it later."}, {"Time_Start": 587.6, "Time_End": 591.6, "Text": " All in all, the TCPAS has 170 member companies."}, {"Time_Start": 591.6, "Time_End": 594.6, "Text": " I know the font's too small to read."}, {"Time_Start": 594.6, "Time_End": 598.6, "Text": " Suffice to say, it's the who's who of the platform market."}, {"Time_Start": 598.6, "Time_End": 601.6, "Text": " All right, how does TCPA work?"}, {"Time_Start": 601.6, "Time_End": 603.6, "Text": " Let's talk about the technology."}, {"Time_Start": 603.6, "Time_End": 606.6, "Text": " There are two phases of, let's talk about phase one."}, {"Time_Start": 606.6, "Time_End": 611.6, "Text": " In phase one of the TCPA, a trusted platform module,"}, {"Time_Start": 611.6, "Time_End": 614.6, "Text": " or TPM, which was Anderson and his,"}, {"Time_Start": 614.6, "Time_End": 621.6, "Text": " FAQ about the TCPA lovingly calls the Fritz chip after Senator Fritz Hollings,"}, {"Time_Start": 621.6, "Time_End": 628.6, "Text": " who has currently a bill pending in Congress, that I'll talk about it in more detail later."}, {"Time_Start": 628.6, "Time_End": 630.6, "Text": " What's the Fritz chip?"}, {"Time_Start": 630.6, "Time_End": 636.6, "Text": " The Fritz chip is a tamper-resistant chip that will be included on all future motherboards."}, {"Time_Start": 636.6, "Time_End": 643.6, "Text": " A little while from now as to how long is unclear, you should see the first such motherboards"}, {"Time_Start": 643.6, "Time_End": 648.6, "Text": " probably showing up on the store shelves, according to an analyst at Gardner Group"}, {"Time_Start": 648.6, "Time_End": 653.6, "Text": " that I've discussed this with, about in the first or second quarter of next year."}, {"Time_Start": 653.6, "Time_End": 656.6, "Text": " At that time, not all your motherboards will have the chips,"}, {"Time_Start": 656.6, "Time_End": 660.6, "Text": " but the first motherboards with these chips will start shipping about Q1, Q2, 2003."}, {"Time_Start": 660.6, "Time_End": 662.6, "Text": " That's according to the Gardner Group."}, {"Time_Start": 662.6, "Time_End": 664.6, "Text": " The chip will be surface mount."}, {"Time_Start": 664.6, "Time_End": 667.6, "Text": " It can either be a separate part on the motherboard,"}, {"Time_Start": 667.6, "Time_End": 670.6, "Text": " or it might be integrated with the existing chipset on your motherboard."}, {"Time_Start": 670.6, "Time_End": 672.6, "Text": " It really is up to the chipset manufacturers and the manufacturer."}, {"Time_Start": 672.6, "Time_End": 675.6, "Text": " manufacturers and the motherboard manufacturers."}, {"Time_Start": 675.6, "Time_End": 682.6, "Text": " The chip will be a common criteria EAL evaluated to EAL level 3 augmented, which is really the most,"}, {"Time_Start": 682.6, "Time_End": 688.6, "Text": " the best, the highest security evaluation level you can do for a part at the cost constraints"}, {"Time_Start": 688.6, "Time_End": 691.6, "Text": " that the manufacturers were under."}, {"Time_Start": 691.6, "Time_End": 692.6, "Text": " You can do certainly better."}, {"Time_Start": 692.6, "Time_End": 695.6, "Text": " You can get a device, say, one of the boxes from inside for etc."}, {"Time_Start": 695.6, "Time_End": 697.6, "Text": " But now we're talking of thousands of dollars."}, {"Time_Start": 697.6, "Time_End": 701.6, "Text": " You can't add thousands of dollars to the cost of a motherboard, or you will no longer sell any."}, {"Time_Start": 701.6, "Time_End": 702.6, "Text": " The cost of the cost of the motherboard."}, {"Time_Start": 702.6, "Time_End": 707.6, "Text": " of the part, realistically, has to be down somewhere in the dollar range."}, {"Time_Start": 707.6, "Time_End": 715.9, "Text": " What does the TPM do? It has two major areas of functionality. One is measurement, which I like"}, {"Time_Start": 715.9, "Time_End": 726.6, "Text": " to think of as snooping, and the other one is reporting, which is probably best thought of as snitching."}, {"Time_Start": 726.6, "Time_End": 731.0, "Text": " Let's look at the measurement side. On the measurement side, you have the components that you would expect."}, {"Time_Start": 731.0, "Time_End": 736.0, "Text": " You have an engine that supports basic cryptographic operations."}, {"Time_Start": 736.0, "Time_End": 739.0, "Text": " You have a secure cryptographic key store."}, {"Time_Start": 739.0, "Time_End": 744.0, "Text": " And I'm speaking here, I'm using terms such as trusted and secure."}, {"Time_Start": 744.0, "Time_End": 749.0, "Text": " They used in this presentation and by the TCP and its members somewhat differently than most of you probably would,"}, {"Time_Start": 749.0, "Time_End": 751.0, "Text": " and most of its customers would."}, {"Time_Start": 751.0, "Time_End": 756.0, "Text": " Trusted here means trusted by Microsoft to prevent you from copying their software"}, {"Time_Start": 756.0, "Time_End": 761.0, "Text": " and trusted by Disney to prevent you from watching their movies without,"}, {"Time_Start": 761.0, "Time_End": 768.0, "Text": " giving them a dollar. Secure here means inevitably secure from the owner that is secure from you."}, {"Time_Start": 768.0, "Time_End": 776.0, "Text": " This secure key store allows the applications that make use of the TPM to securely store"}, {"Time_Start": 776.0, "Time_End": 781.0, "Text": " keys that the user and the applications will necessarily be able to read out."}, {"Time_Start": 781.0, "Time_End": 787.2, "Text": " There is the expected key management primitives, and there is something that I call the boot process"}, {"Time_Start": 787.2, "Time_End": 790.98, "Text": " hashing because one of the measurements that the TCP that the TPM engages,"}, {"Time_Start": 791.0, "Time_End": 796.0, "Text": " and is measuring all the components of the PC boot process."}, {"Time_Start": 796.0, "Time_End": 800.0, "Text": " I will show you later as to how this works and what these components are."}, {"Time_Start": 800.0, "Time_End": 804.0, "Text": " Let's look at the cryptographic operations."}, {"Time_Start": 804.0, "Time_End": 805.0, "Text": " What would you expect?"}, {"Time_Start": 805.0, "Time_End": 809.0, "Text": " There is a built-in support for hashing, Xia1 and H-Mack."}, {"Time_Start": 809.0, "Time_End": 814.0, "Text": " There is a random number generator built into the TPM."}, {"Time_Start": 814.0, "Time_End": 820.0, "Text": " Yet again, much to my dismay, just as we saw with the random number generated by Intel,"}, {"Time_Start": 820.0, "Time_End": 823.0, "Text": " are only given access to the post-widening output."}, {"Time_Start": 823.0, "Time_End": 828.0, "Text": " The cryptographers amongst you will know that what this means is that you have absolutely no assurance"}, {"Time_Start": 828.0, "Time_End": 835.0, "Text": " that this random number generally is actually good or, in fact, is fully deterministic with just"}, {"Time_Start": 835.0, "Time_End": 837.0, "Text": " a 20-bit seat."}, {"Time_Start": 837.0, "Time_End": 842.0, "Text": " You simply have no knowledge and no way with determining the quality of these random numbers."}, {"Time_Start": 842.0, "Time_End": 845.0, "Text": " This is not accidental."}, {"Time_Start": 845.0, "Time_End": 850.0, "Text": " The TCPA Common Criteria Evaluation Specifications mandate that the"}, {"Time_Start": 850.0, "Time_End": 855.0, "Text": " that the user will not be given access to the wall bits or anything pre-widening."}, {"Time_Start": 855.0, "Time_End": 857.0, "Text": " Why, I'll leave it to your imagination."}, {"Time_Start": 857.0, "Time_End": 859.0, "Text": " The bottom line is that you will not,"}, {"Time_Start": 859.0, "Time_End": 863.0, "Text": " neither you or anybody else will be able to determine whether this random member generator actually has random"}, {"Time_Start": 863.0, "Time_End": 866.0, "Text": " numbers or is spitting out predictable values."}, {"Time_Start": 866.0, "Time_End": 871.0, "Text": " You have your expected asymmetric key generation, it's 2048 bit RSA,"}, {"Time_Start": 871.0, "Time_End": 875.0, "Text": " which is actually one of the few changes that the design has seen in the last few years."}, {"Time_Start": 875.0, "Time_End": 880.0, "Text": " It initially was specified at 1024 bit, but Microsoft,"}, {"Time_Start": 880.0, "Time_End": 889.0, "Text": " and Disney apparently failed it, and Intel felt it insufficient to protect their next copies of snow whites, so they moved up to 24-8-bit."}, {"Time_Start": 889.0, "Time_End": 895.0, "Text": " You have the expected asymmetric key encrypt decrypt, and semantic encrypt decrypt,"}, {"Time_Start": 895.0, "Time_End": 900.0, "Text": " initially the specs called for triple dose because AES had not yet been specified,"}, {"Time_Start": 900.0, "Time_End": 904.0, "Text": " but with AES specified, probably what you will see is the use of AES."}, {"Time_Start": 904.0, "Time_End": 909.0, "Text": " And then, as I mentioned earlier, there is a tamper-resistant hash and key store."}, {"Time_Start": 909.0, "Time_End": 912.0, "Text": " All right, let's look at the key management."}, {"Time_Start": 912.0, "Time_End": 913.0, "Text": " Am I going too fast?"}, {"Time_Start": 913.0, "Time_End": 914.0, "Text": " Can you guys hear me?"}, {"Time_Start": 914.0, "Time_End": 915.0, "Text": " All right."}, {"Time_Start": 915.0, "Time_End": 918.0, "Text": " There's a lot of ground to cover, and we only have an hour."}, {"Time_Start": 918.0, "Time_End": 922.0, "Text": " We're actually one and I have 45 minutes, so I'm trying to rush through this talk a bit,"}, {"Time_Start": 922.0, "Time_End": 923.0, "Text": " but there's a lot of information."}, {"Time_Start": 923.0, "Time_End": 927.0, "Text": " They've been working on this for a long time and I've thought about it very hard."}, {"Time_Start": 927.0, "Time_End": 931.0, "Text": " You may wonder, how do I actually know about this?"}, {"Time_Start": 931.0, "Time_End": 934.0, "Text": " I initially found out about it quite a few years ago,"}, {"Time_Start": 934.0, "Time_End": 938.0, "Text": " but I must confess, in public, that I spent an entire year sitting on a"}, {"Time_Start": 938.0, "Time_End": 942.0, "Text": " entire year sitting on a TCPA working group."}, {"Time_Start": 942.0, "Time_End": 948.0, "Text": " I sat in the working group because at the time I believed that this might be a marvelous technology"}, {"Time_Start": 948.0, "Time_End": 951.0, "Text": " to secure what's sitting underneath my operating system."}, {"Time_Start": 951.0, "Time_End": 954.0, "Text": " I don't trust the hardware that my OS is running on."}, {"Time_Start": 954.0, "Time_End": 959.0, "Text": " And I thought that TCP was the way to give me the assurance that I can trust my hardware."}, {"Time_Start": 959.0, "Time_End": 962.0, "Text": " I ultimately realized it was unable to do that."}, {"Time_Start": 962.0, "Time_End": 967.0, "Text": " And moreover, it was able to do other things that I by no means wanted to see done."}, {"Time_Start": 967.0, "Time_End": 968.0, "Text": " Learn a few things."}, {"Time_Start": 968.0, "Time_End": 972.0, "Text": " And just for the record, all this information is public information."}, {"Time_Start": 972.0, "Time_End": 975.0, "Text": " I'm not violating any NDAs."}, {"Time_Start": 975.0, "Time_End": 981.0, "Text": " The TPM is at the factory equipped with a TPM unique,"}, {"Time_Start": 981.0, "Time_End": 985.0, "Text": " which means motherboard unique, endorsement key."}, {"Time_Start": 985.0, "Time_End": 989.0, "Text": " This is an RSA key that's signed by the TPM manufacturer's key,"}, {"Time_Start": 989.0, "Time_End": 993.0, "Text": " which in turn is signed by the TCPM Master Key."}, {"Time_Start": 993.0, "Time_End": 996.0, "Text": " It's a key hierarchy that goes back to the TCP Master Key."}, {"Time_Start": 996.0, "Time_End": 997.0, "Text": " We do not know."}, {"Time_Start": 997.0, "Time_End": 998.0, "Text": " I do not know."}, {"Time_Start": 998.0, "Time_End": 1003.0, "Text": " Nobody that I know that's able to talk about it knows who holds this TCP a master key."}, {"Time_Start": 1003.0, "Time_End": 1007.0, "Text": " It would be a marvelous topic to determine."}, {"Time_Start": 1007.0, "Time_End": 1010.0, "Text": " This key is used to determine that the TPM is genuine,"}, {"Time_Start": 1010.0, "Time_End": 1014.0, "Text": " and it's not just something that pretends to be a TPM and then later on the league all the keys"}, {"Time_Start": 1014.0, "Time_End": 1018.0, "Text": " and therefore allow it to not pay for Microsoft Word."}, {"Time_Start": 1018.0, "Time_End": 1023.0, "Text": " Once the user takes possession of the TPM, the user then uses,"}, {"Time_Start": 1023.0, "Time_End": 1027.0, "Text": " the user then generates key pairs, multiple key pairs if they wish,"}, {"Time_Start": 1027.0, "Time_End": 1032.0, "Text": " submits those to a CA for certification and signs,"}, {"Time_Start": 1032.0, "Time_End": 1036.0, "Text": " the TPM signs this certificate request with the TPM"}, {"Time_Start": 1036.0, "Time_End": 1039.0, "Text": " endorsement key thus proving to the CA"}, {"Time_Start": 1039.0, "Time_End": 1043.0, "Text": " that the keys were generated by a real TPM and that the user, in fact,"}, {"Time_Start": 1043.0, "Time_End": 1046.0, "Text": " does not have access to the private keys."}, {"Time_Start": 1046.0, "Time_End": 1048.0, "Text": " Let's look at the hashing."}, {"Time_Start": 1048.0, "Time_End": 1052.0, "Text": " I don't know where you can see this graph, but I'll try to run you through it."}, {"Time_Start": 1052.0, "Time_End": 1056.0, "Text": " Let's take a look at a trusted computing platform pre-operative"}, {"Time_Start": 1056.0, "Time_End": 1058.0, "Text": " pre-operating system boot process."}, {"Time_Start": 1058.0, "Time_End": 1062.0, "Text": " This is really just the standard PC platform boot process"}, {"Time_Start": 1062.0, "Time_End": 1064.0, "Text": " with some enhancement."}, {"Time_Start": 1064.0, "Time_End": 1066.0, "Text": " In the top left, we have the root of trust."}, {"Time_Start": 1066.0, "Time_End": 1069.0, "Text": " You have to start trusting somewhere from something."}, {"Time_Start": 1069.0, "Time_End": 1071.0, "Text": " That's called the root of trust."}, {"Time_Start": 1071.0, "Time_End": 1075.0, "Text": " In the TCPAs case, you have to trust the buyer's bootblock."}, {"Time_Start": 1075.0, "Time_End": 1078.0, "Text": " If the bias bootblock is compromised,"}, {"Time_Start": 1078.0, "Time_End": 1080.0, "Text": " all bets are off."}, {"Time_Start": 1080.0, "Time_End": 1084.0, "Text": " However, it's, if there are various reasons why it's hard to replace the"}, {"Time_Start": 1084.0, "Time_End": 1085.0, "Text": " bias boot block in this case."}, {"Time_Start": 1085.0, "Time_End": 1086.0, "Text": " in this case."}, {"Time_Start": 1086.0, "Time_End": 1090.0, "Text": " The bias boot block loads the bias."}, {"Time_Start": 1090.0, "Time_End": 1094.0, "Text": " The bias, after the bias, you have the various option arms load"}, {"Time_Start": 1094.0, "Time_End": 1097.0, "Text": " for example, your Ethernet cards, your SCSI cards,"}, {"Time_Start": 1097.0, "Time_End": 1101.0, "Text": " whatever option arms might be loaded after the bias is loaded."}, {"Time_Start": 1101.0, "Time_End": 1105.0, "Text": " If you look at the right side, you see in the gray area that's the TPM"}, {"Time_Start": 1105.0, "Time_End": 1109.0, "Text": " and its associated storage area, which, by the way, is unlimited."}, {"Time_Start": 1109.0, "Time_End": 1113.0, "Text": " The TPM, very similar to what Encipher is doing with the key blobs,"}, {"Time_Start": 1113.0, "Time_End": 1115.0, "Text": " the TPM simply,"}, {"Time_Start": 1115.0, "Time_End": 1120.0, "Text": " A, as a triple does, encrypts the data, and then stores it as an opaque file and disk."}, {"Time_Start": 1120.0, "Time_End": 1126.0, "Text": " Thus, the potential protected storage area behind the TPM is as big as your hard drive."}, {"Time_Start": 1126.0, "Time_End": 1130.0, "Text": " TPM stores the hash, option rooms are being hashed."}, {"Time_Start": 1130.0, "Time_End": 1133.0, "Text": " The hash is loaded, option rooms are loaded."}, {"Time_Start": 1133.0, "Time_End": 1137.0, "Text": " Then you load the digital rights management, digital rights management bootloader."}, {"Time_Start": 1137.0, "Time_End": 1142.0, "Text": " The hash of that is stored, which finally loads the digital rights management kernel."}, {"Time_Start": 1142.0, "Time_End": 1144.0, "Text": " The digital rights management kernel is what might have been."}, {"Time_Start": 1144.0, "Time_End": 1148.0, "Text": " kernel is what Microsoft in the Palladium Initiative calls the nub."}, {"Time_Start": 1148.0, "Time_End": 1150.0, "Text": " I don't know why they call it the nab."}, {"Time_Start": 1150.0, "Time_End": 1152.0, "Text": " Or trusted operating route."}, {"Time_Start": 1152.0, "Time_End": 1158.0, "Text": " The trusted operating route is essentially, it's very similar to a micro kernel that gets loaded"}, {"Time_Start": 1158.0, "Time_End": 1164.0, "Text": " before your existing kernel, be that Linux or NT, your existing ring zero supervisor,"}, {"Time_Start": 1164.0, "Time_End": 1172.0, "Text": " before your existing ring zero supervisor mode code ever gets loaded, you're already running on top of a DRM micro kernel."}, {"Time_Start": 1172.0, "Time_End": 1178.0, "Text": " After the DRM micro kernel loads, it loads the operating system."}, {"Time_Start": 1178.0, "Time_End": 1182.0, "Text": " The TPM again stores the hash."}, {"Time_Start": 1182.0, "Time_End": 1185.0, "Text": " There may be an additional step."}, {"Time_Start": 1185.0, "Time_End": 1187.0, "Text": " When I'm speaking here for an operating system load,"}, {"Time_Start": 1187.0, "Time_End": 1189.0, "Text": " this is a generic operating system."}, {"Time_Start": 1189.0, "Time_End": 1191.0, "Text": " These are operating system."}, {"Time_Start": 1191.0, "Time_End": 1195.0, "Text": " This is what TCP allows an operating system vendor to implement."}, {"Time_Start": 1195.0, "Time_End": 1198.0, "Text": " Not all operating system vendors will implement all features."}, {"Time_Start": 1198.0, "Time_End": 1201.0, "Text": " This is the sum total of the features that you can put in."}, {"Time_Start": 1201.0, "Time_End": 1212.0, "Text": " What you'll find is that either the entire operating system or critical parts of the operating system will be encrypted on disk."}, {"Time_Start": 1212.0, "Time_End": 1219.0, "Text": " So what happens is the TPM loads the machine-specific decryption key of the operating system binary,"}, {"Time_Start": 1219.0, "Time_End": 1222.0, "Text": " decrypts the operating system encrypted on the drive,"}, {"Time_Start": 1222.0, "Time_End": 1226.0, "Text": " so you don't actually know what the operating system does anymore because it's AES encrypted,"}, {"Time_Start": 1226.0, "Time_End": 1230.0, "Text": " so there's no more reverse engineering or patching an operating system without permission."}, {"Time_Start": 1230.0, "Time_End": 1234.0, "Text": " The operating system gets decrypted,"}, {"Time_Start": 1234.0, "Time_End": 1239.0, "Text": " and the OSBliner gets decrypted, loaded, and loaded as usual."}, {"Time_Start": 1239.0, "Time_End": 1246.0, "Text": " In phase one, the decryption of the symmetric decryption is actually taking place outside the TPM."}, {"Time_Start": 1246.0, "Time_End": 1256.0, "Text": " So the TPM decrypts, the DPA-TPM provides an internal RSA key, which decrypts the OS AES key."}, {"Time_Start": 1256.0, "Time_End": 1259.0, "Text": " But that's not initially done in hardware because it was too expensive."}, {"Time_Start": 1259.0, "Time_End": 1265.0, "Text": " expensive, which of course means that there's an avenue for attack in future versions of the TCPA"}, {"Time_Start": 1265.0, "Time_End": 1268.0, "Text": " and of course in the proposed Microsoft Palladium."}, {"Time_Start": 1268.0, "Time_End": 1273.0, "Text": " This would actually be done at the CPU level, thus requiring you to go through some"}, {"Time_Start": 1273.0, "Time_End": 1276.0, "Text": " fairly invasive measures to actually get the declared text."}, {"Time_Start": 1276.0, "Time_End": 1280.0, "Text": " The operating system gets loaded and initially the operating system will load"}, {"Time_Start": 1280.0, "Time_End": 1286.0, "Text": " a approved hardware list, which I will just call here on HCL, and the initial serial number revocation list,"}, {"Time_Start": 1286.0, "Time_End": 1287.0, "Text": " an SRL."}, {"Time_Start": 1287.0, "Time_End": 1289.0, "Text": " You may wonder what the heck is a serial number revocation list."}, {"Time_Start": 1289.0, "Time_End": 1291.0, "Text": " I've never heard of that. We'll get to that."}, {"Time_Start": 1291.0, "Time_End": 1298.0, "Text": " The TCP, the trusted computing platform operating system is, are you getting scared yet?"}, {"Time_Start": 1298.0, "Time_End": 1300.0, "Text": " Yeah, you should."}, {"Time_Start": 1300.0, "Time_End": 1305.0, "Text": " The trusted computing platform operating system is now in a known initial state."}, {"Time_Start": 1305.0, "Time_End": 1311.0, "Text": " What do we know? We know that BIOS has TCP approved, as far as these approvals are concerned,"}, {"Time_Start": 1311.0, "Time_End": 1316.0, "Text": " if you think you can get an approval for your distribution of Linux, your home distribution, then you're out of your mind."}, {"Time_Start": 1316.0, "Time_End": 1327.0, "Text": " The BIOS is TCP approved and signed, the PCI cards or TCP approved and signed, or at least their expansion rooms are."}, {"Time_Start": 1327.0, "Time_End": 1332.0, "Text": " Of course, who would get signatures for the devices?"}, {"Time_Start": 1332.0, "Time_End": 1339.0, "Text": " Well, certainly nobody who cannot certify that the DMA channels used by the devices do not enable unapproved access to operating RAM."}, {"Time_Start": 1339.0, "Time_End": 1345.0, "Text": " Because with DMA, of course, you can just go straight to the operating RAM without ever go into the CPU and its DRM micro kernel."}, {"Time_Start": 1345.0, "Time_End": 1346.0, "Text": " Hence,"}, {"Time_Start": 1346.0, "Time_End": 1356.0, "Text": " you need to know that the hardware is not instrumented to allow you to do that, hence no assurance that you don't use DRM to get at Snowwide, no signature for you."}, {"Time_Start": 1356.0, "Time_End": 1361.0, "Text": " You also will know that no kernel level debugger is loaded because the operating system binary is hashed."}, {"Time_Start": 1361.0, "Time_End": 1363.0, "Text": " You have a hash of all the modules."}, {"Time_Start": 1363.0, "Time_End": 1367.0, "Text": " You know for fact that there is no way for the user to get at the wall bits."}, {"Time_Start": 1367.0, "Time_End": 1373.0, "Text": " You have an initial list of undesirable applications that you are not allowed to run."}, {"Time_Start": 1373.0, "Time_End": 1375.0, "Text": " That's our serial number of vocation list."}, {"Time_Start": 1375.0, "Time_End": 1376.0, "Text": " list."}, {"Time_Start": 1376.0, "Time_End": 1380.0, "Text": " And let's give some examples of TCP or TCP like operating systems."}, {"Time_Start": 1380.0, "Time_End": 1382.0, "Text": " This is of course Microsoft's Palladium."}, {"Time_Start": 1382.0, "Time_End": 1387.0, "Text": " Take a look at the DRM or its pattern that we'll go into some of details as to how, what this is all about."}, {"Time_Start": 1387.0, "Time_End": 1392.0, "Text": " And HP, what didn't need on this slide, both HP and IBM are coming out or planning to come out"}, {"Time_Start": 1392.0, "Time_End": 1398.6, "Text": " and are actively working on TCPA evaluated versions of Linux that actually will have been subjected"}, {"Time_Start": 1398.6, "Time_End": 1400.0, "Text": " to security evaluation."}, {"Time_Start": 1400.0, "Time_End": 1404.0, "Text": " Again, I will talk about these a little bit more later."}, {"Time_Start": 1404.0, "Time_End": 1408.0, "Text": " What does the trusted computing platform operating system initially do?"}, {"Time_Start": 1408.0, "Time_End": 1411.0, "Text": " It first starts a secure time counter."}, {"Time_Start": 1411.0, "Time_End": 1413.0, "Text": " There will be no turning back to system clock."}, {"Time_Start": 1413.0, "Time_End": 1415.0, "Text": " Why is that important?"}, {"Time_Start": 1415.0, "Time_End": 1418.0, "Text": " Well, if you say a rent a video for a week,"}, {"Time_Start": 1418.0, "Time_End": 1421.0, "Text": " we certainly wouldn't want you to watch this after 10 days."}, {"Time_Start": 1421.0, "Time_End": 1426.0, "Text": " Or if your Microsoft Word license, it will be for the period of a year,"}, {"Time_Start": 1426.0, "Time_End": 1429.0, "Text": " then you certainly should not be able to run it after a year and a half."}, {"Time_Start": 1429.0, "Time_End": 1434.0, "Text": " The operating system then synchronizes against an NPP system."}, {"Time_Start": 1434.0, "Time_End": 1441.0, "Text": " server and finally goes to the over the internet obtains a new hardware control list"}, {"Time_Start": 1441.0, "Time_End": 1445.0, "Text": " and a new serial number of vocationalists."}, {"Time_Start": 1445.0, "Time_End": 1448.0, "Text": " This doesn't have to happen every time the OS boots up."}, {"Time_Start": 1448.0, "Time_End": 1452.0, "Text": " There will be metrics that will allow you to work in an offline mode."}, {"Time_Start": 1452.0, "Time_End": 1454.0, "Text": " You don't have to always be connected."}, {"Time_Start": 1454.0, "Time_End": 1458.0, "Text": " But say if you don't connect for a week, your DVD made a longer play,"}, {"Time_Start": 1458.0, "Time_End": 1462.0, "Text": " and if you don't connect for a month, then perhaps your work process is no longer work."}, {"Time_Start": 1462.0, "Time_End": 1463.0, "Text": " The exact times of TBD."}, {"Time_Start": 1463.0, "Time_End": 1466.0, "Text": " times of TBD."}, {"Time_Start": 1466.0, "Time_End": 1471.0, "Text": " Now in the pre-application load, there will be two primary,"}, {"Time_Start": 1471.0, "Time_End": 1474.0, "Text": " two primary application load of protection modes."}, {"Time_Start": 1474.0, "Time_End": 1477.0, "Text": " The first one is mandatory."}, {"Time_Start": 1477.0, "Time_End": 1480.0, "Text": " In a mandatory mode, the operating system will simply flat out refuse"}, {"Time_Start": 1480.0, "Time_End": 1482.0, "Text": " to load any non-TCP approved applications,"}, {"Time_Start": 1482.0, "Time_End": 1485.0, "Text": " or applications that are on the serial number of application list"}, {"Time_Start": 1485.0, "Time_End": 1489.0, "Text": " or just otherwise deemed undesirable."}, {"Time_Start": 1489.0, "Time_End": 1492.0, "Text": " There will also be a voluntary mode in which the operating system will load"}, {"Time_Start": 1492.0, "Time_End": 1497.5, "Text": " operating system will load a non-approved application, sending a signal to all running applications"}, {"Time_Start": 1497.5, "Time_End": 1503.0, "Text": " that the system has been compromised by its owner and to please clean up after itself."}, {"Time_Start": 1503.0, "Time_End": 1508.0, "Text": " As a result, and I actually have a little graph here, a little table how this works,"}, {"Time_Start": 1508.0, "Time_End": 1515.0, "Text": " if you're running in voluntary mode, you can load an unapproved application,"}, {"Time_Start": 1515.0, "Time_End": 1521.0, "Text": " but all your applications that are expecting the DRM micro kernel to guard them against the user"}, {"Time_Start": 1521.0, "Time_End": 1523.5, "Text": " will then simply shut down, zeroize out their memory,"}, {"Time_Start": 1523.5, "Time_End": 1526.0, "Text": " and ask the operating system to clean up after themselves"}, {"Time_Start": 1526.0, "Time_End": 1530.0, "Text": " before your application ever gets I.O. on the memory."}, {"Time_Start": 1530.0, "Time_End": 1534.0, "Text": " What will the application do after it's been loaded?"}, {"Time_Start": 1534.0, "Time_End": 1540.0, "Text": " Well, the application, of course, verifies the hashes that are stored in the TPM that we stored earlier."}, {"Time_Start": 1540.0, "Time_End": 1545.0, "Text": " It verifies that it, in fact, is licensed for the particular platform."}, {"Time_Start": 1545.0, "Time_End": 1550.98, "Text": " As I mentioned earlier, each platform owner will have keys that are specific"}, {"Time_Start": 1551.0, "Time_End": 1554.5, "Text": " to the platform, so you will know for the fact that this copy of office is licensed"}, {"Time_Start": 1554.5, "Time_End": 1558.44, "Text": " to this particular motherboard and no other motherboard."}, {"Time_Start": 1558.44, "Time_End": 1562.88, "Text": " It will verify the license duration, say if you have a license that's time-limited, which under"}, {"Time_Start": 1562.88, "Time_End": 1568.1, "Text": " that scheme, most licenses probably will be, because you can now actually finally make time-limit"}, {"Time_Start": 1568.1, "Time_End": 1570.4, "Text": " license stick."}, {"Time_Start": 1570.4, "Time_End": 1573.12, "Text": " It will obtain a first serial number of application list from the net."}, {"Time_Start": 1573.12, "Time_End": 1576.5, "Text": " It will verify that mandatory applications are running."}, {"Time_Start": 1576.5, "Time_End": 1580.98, "Text": " One example is there are a number of application vendors out there that are nowadays, you know,"}, {"Time_Start": 1581.0, "Time_End": 1586.0, "Text": " subsidizing the application by means of spyware, be that gator or whatever, there's"}, {"Time_Start": 1586.0, "Time_End": 1587.0, "Text": " a bunch of them out there."}, {"Time_Start": 1587.0, "Time_End": 1589.0, "Text": " You folks have seen them."}, {"Time_Start": 1589.0, "Time_End": 1594.0, "Text": " But what they found is that there are users out there that will just simply uninstall the spyware"}, {"Time_Start": 1594.0, "Time_End": 1600.0, "Text": " that's running on their PCs when, and that's getting the benefits of the free software without"}, {"Time_Start": 1600.0, "Time_End": 1602.0, "Text": " the drawbacks of the spyware."}, {"Time_Start": 1602.0, "Time_End": 1607.0, "Text": " Under the scheme, you can guarantee that an application that you deem necessary for the application"}, {"Time_Start": 1607.0, "Time_End": 1610.0, "Text": " to run such a spyware is in fact loaded operation operating."}, {"Time_Start": 1610.0, "Time_End": 1615.0, "Text": " operating and unpatched or otherwise disabled."}, {"Time_Start": 1615.0, "Time_End": 1621.0, "Text": " Then the application in some cases will obtain a fresh document revocation list from a number of"}, {"Time_Start": 1621.0, "Time_End": 1623.0, "Text": " document revocation servers."}, {"Time_Start": 1623.0, "Time_End": 1627.0, "Text": " I will explain to you what documented revocation servers are again on the later slide."}, {"Time_Start": 1627.0, "Time_End": 1634.0, "Text": " Only at this point the application will actually accept user input or do anything with your documents."}, {"Time_Start": 1634.0, "Time_End": 1639.0, "Text": " Why?"}, {"Time_Start": 1639.0, "Time_End": 1640.0, "Text": " What can..."}, {"Time_Start": 1640.0, "Time_End": 1643.0, "Text": " Why are the application that is so keen on it?"}, {"Time_Start": 1643.0, "Time_End": 1647.0, "Text": " Well, as I mentioned earlier, there's a revenue enhancement issue."}, {"Time_Start": 1647.0, "Time_End": 1654.0, "Text": " There is a, it allows, at least the belief it allows them to grow the market."}, {"Time_Start": 1654.0, "Time_End": 1656.0, "Text": " Here we have some good quotes."}, {"Time_Start": 1656.0, "Time_End": 1662.0, "Text": " Bill Gates says, we came thinking about music, but then, as in digital rights management for music,"}, {"Time_Start": 1662.0, "Time_End": 1667.0, "Text": " but then we realized that email and documents were far more interesting domains."}, {"Time_Start": 1667.0, "Time_End": 1670.0, "Text": " Why are email and documents for more interesting domains?"}, {"Time_Start": 1670.0, "Time_End": 1676.0, "Text": " And Stephen Levy wrote in the article that in the Expoise about Microsoft's"}, {"Time_Start": 1676.0, "Time_End": 1678.0, "Text": " Palladium on Microsoft NBC, he wrote,"}, {"Time_Start": 1678.0, "Time_End": 1682.0, "Text": " you could create word documents that could be read only in the next week."}, {"Time_Start": 1682.0, "Time_End": 1685.0, "Text": " So we go to the first quiz."}, {"Time_Start": 1685.0, "Time_End": 1690.0, "Text": " How will the law help the TCPA and its members start for competition?"}, {"Time_Start": 1690.0, "Time_End": 1692.0, "Text": " Here's why."}, {"Time_Start": 1692.0, "Time_End": 1695.0, "Text": " The application vendors, such as Microsoft,"}, {"Time_Start": 1695.0, "Time_End": 1698.0, "Text": " and Bill Gates said so as much in the interview,"}, {"Time_Start": 1698.0, "Time_End": 1699.0, "Text": " intent on wrapping all their file forms."}, {"Time_Start": 1699.0, "Time_End": 1702.0, "Text": " all their file formats in digital rights management."}, {"Time_Start": 1702.0, "Time_End": 1705.24, "Text": " Those of you who were here for the previous talk will know the answer."}, {"Time_Start": 1705.24, "Time_End": 1706.16, "Text": " So what's the question here?"}, {"Time_Start": 1706.16, "Time_End": 1710.84, "Text": " The question is, what does a federal prosecutor call an application that is compatible with"}, {"Time_Start": 1710.84, "Time_End": 1714.0, "Text": " a proprietary DRM wrap file format?"}, {"Time_Start": 1714.0, "Time_End": 1715.0, "Text": " Any takers?"}, {"Time_Start": 1715.0, "Time_End": 1718.0, "Text": " A circumvention device!"}, {"Time_Start": 1718.0, "Time_End": 1719.0, "Text": " Exactly!"}, {"Time_Start": 1719.0, "Time_End": 1722.0, "Text": " It's an illegal infringement device!"}, {"Time_Start": 1722.0, "Time_End": 1724.0, "Text": " That's correct."}, {"Time_Start": 1724.0, "Time_End": 1726.0, "Text": " An illegal infringement device."}, {"Time_Start": 1726.0, "Time_End": 1728.0, "Text": " What does it mean if you're..."}, {"Time_Start": 1728.0, "Time_End": 1732.0, "Text": " if you're compatible application with an illegal infringement device,"}, {"Time_Start": 1732.0, "Time_End": 1735.0, "Text": " it means that the software author who wrote this application"}, {"Time_Start": 1735.0, "Time_End": 1739.0, "Text": " is subject to $500,000 fine and five years in prison,"}, {"Time_Start": 1739.0, "Time_End": 1742.0, "Text": " double that for each subsequent offense,"}, {"Time_Start": 1742.0, "Time_End": 1746.0, "Text": " for writing a compatible application."}, {"Time_Start": 1746.0, "Time_End": 1750.0, "Text": " That doesn't even require any more laws that law is already in the book."}, {"Time_Start": 1750.0, "Time_End": 1753.0, "Text": " It's called the Digital Millennium Copyright Act."}, {"Time_Start": 1753.0, "Time_End": 1757.0, "Text": " So that leaves software authors with two very simple choices."}, {"Time_Start": 1757.0, "Time_End": 1758.0, "Text": " The moment."}, {"Time_Start": 1758.0, "Time_End": 1761.0, "Text": " If you have file formats are wrapped in DRM, you have two choices."}, {"Time_Start": 1761.0, "Time_End": 1766.0, "Text": " You cannot create interoperable software, or you can spend five years in prison."}, {"Time_Start": 1766.0, "Time_End": 1768.0, "Text": " That's assuming that you only have one user."}, {"Time_Start": 1768.0, "Time_End": 1771.0, "Text": " If you have more user that adds another 10 for each additional user,"}, {"Time_Start": 1771.0, "Time_End": 1774.0, "Text": " which is not to say that they'll put you away for 100 years,"}, {"Time_Start": 1774.0, "Time_End": 1778.0, "Text": " which they could, but probably wouldn't, they will simply come to you and say,"}, {"Time_Start": 1778.0, "Time_End": 1780.0, "Text": " well, we can put you away."}, {"Time_Start": 1780.0, "Time_End": 1784.0, "Text": " There's about an 80% chance that we can put you away for a very, very long time."}, {"Time_Start": 1784.0, "Time_End": 1787.0, "Text": " Are you willing to take the chance, or will you just simply plead guilty?"}, {"Time_Start": 1787.0, "Time_End": 1791.0, "Text": " guilty and take the five, six, ten years that we're offering you."}, {"Time_Start": 1791.0, "Time_End": 1795.0, "Text": " Your attorney will probably tell you, and I'm not an attorney, but I hope there may"}, {"Time_Start": 1795.0, "Time_End": 1801.0, "Text": " there are some attorneys in the courtroom, in the courtroom, but your attorney will, I believe"}, {"Time_Start": 1801.0, "Time_End": 1805.0, "Text": " in all likelihood, tell you that you're better off to take the deal."}, {"Time_Start": 1805.0, "Time_End": 1807.0, "Text": " And you probably would fill the same way."}, {"Time_Start": 1807.0, "Time_End": 1811.0, "Text": " We talked about measurement. Let's talk about reporting."}, {"Time_Start": 1811.0, "Time_End": 1815.0, "Text": " So we have the snooping. Let's get under the snitching."}, {"Time_Start": 1815.0, "Time_End": 1819.0, "Text": " TPM reporting is about reporting state to challenges."}, {"Time_Start": 1819.0, "Time_End": 1821.0, "Text": " Challenges can be the local operating system."}, {"Time_Start": 1821.0, "Time_End": 1823.0, "Text": " It can be the application."}, {"Time_Start": 1823.0, "Time_End": 1826.0, "Text": " In most cases, though, it will be a remote challenger."}, {"Time_Start": 1826.0, "Time_End": 1830.0, "Text": " A remote challenger is a challenger that requests state via the Internet."}, {"Time_Start": 1830.0, "Time_End": 1833.0, "Text": " Digital content servers, secure time servers,"}, {"Time_Start": 1833.0, "Time_End": 1836.0, "Text": " and information authorization servers."}, {"Time_Start": 1836.0, "Time_End": 1843.0, "Text": " Looking at reporting to remote entities,"}, {"Time_Start": 1843.0, "Time_End": 1845.0, "Text": " the remote challenger,"}, {"Time_Start": 1845.0, "Time_End": 1848.0, "Text": " which could be any of the above entities,"}, {"Time_Start": 1848.0, "Time_End": 1851.0, "Text": " can determine that the platform is in an approved state."}, {"Time_Start": 1851.0, "Time_End": 1855.0, "Text": " The owner of the machine does not have privileged access to the CPU."}, {"Time_Start": 1855.0, "Time_End": 1860.0, "Text": " The operating system and application software are fully licensed to that machine"}, {"Time_Start": 1860.0, "Time_End": 1863.0, "Text": " with maintenance fees paid."}, {"Time_Start": 1863.0, "Time_End": 1867.0, "Text": " The operating system and applications are completely utterly unpatched and modified"}, {"Time_Start": 1867.0, "Time_End": 1869.0, "Text": " because otherwise they have a hash written checkout."}, {"Time_Start": 1869.0, "Time_End": 1874.0, "Text": " And, of course, only approved applications are loaded if that is of interest"}, {"Time_Start": 1874.0, "Time_End": 1875.0, "Text": " to the application."}, {"Time_Start": 1875.0, "Time_End": 1877.0, "Text": " vendor or content provider."}, {"Time_Start": 1877.0, "Time_End": 1880.0, "Text": " What features does TCPA enable?"}, {"Time_Start": 1880.0, "Time_End": 1885.0, "Text": " It enables, first and foremost, to secure an ongoing revenue stream."}, {"Time_Start": 1885.0, "Time_End": 1890.0, "Text": " TCPA makes it trivial to enforce annual licensing fees."}, {"Time_Start": 1890.0, "Time_End": 1898.0, "Text": " It allows you to stifle competition, which we've discussed."}, {"Time_Start": 1898.0, "Time_End": 1902.0, "Text": " What else does it allow you to do?"}, {"Time_Start": 1902.0, "Time_End": 1904.0, "Text": " It allows you to defeat the GPL."}, {"Time_Start": 1904.0, "Time_End": 1905.0, "Text": " It allows you to defeat the GPL."}, {"Time_Start": 1905.0, "Time_End": 1912.0, "Text": " allows the vendors to enable the inventors and the courts and intelligence to enable information"}, {"Time_Start": 1912.0, "Time_End": 1918.0, "Text": " and validation. It facilitates intelligence collection and, of course, it meets the needs of law enforcement,"}, {"Time_Start": 1918.0, "Time_End": 1919.0, "Text": " and many, many more."}, {"Time_Start": 1919.0, "Time_End": 1921.0, "Text": " We've talked about the first two."}, {"Time_Start": 1921.0, "Time_End": 1922.0, "Text": " Let's talk about the next one."}, {"Time_Start": 1922.0, "Time_End": 1927.0, "Text": " Let's talk about how does the TCPA allow an application vendor to defeat the GPL."}, {"Time_Start": 1927.0, "Time_End": 1932.0, "Text": " On HP and IBM are developing a TCP compliant version of Linux."}, {"Time_Start": 1932.0, "Time_End": 1935.0, "Text": " Now, a question that has a question"}, {"Time_Start": 1935.0, "Time_End": 1943.5, "Text": " has been raised by was Anderson, a researcher of UC Cambridge University in the UK,"}, {"Time_Start": 1943.5, "Time_End": 1949.0, "Text": " was how do they plan on making money of this? After all, the GPL requires that their result"}, {"Time_Start": 1949.0, "Time_End": 1954.0, "Text": " is covered by the GPL is just as much open source code. They have to give it away for free."}, {"Time_Start": 1954.0, "Time_End": 1963.0, "Text": " The evaluation process, an E3 evaluation process for an operating system, requires literally stacks of documents this high."}, {"Time_Start": 1963.0, "Time_End": 1966.0, "Text": " It is a bureaucratic nightmare."}, {"Time_Start": 1966.0, "Time_End": 1968.0, "Text": " It requires many months."}, {"Time_Start": 1968.0, "Time_End": 1972.0, "Text": " And if you get away with $500,000 for the process,"}, {"Time_Start": 1972.0, "Time_End": 1974.0, "Text": " you get away cheaply."}, {"Time_Start": 1974.0, "Time_End": 1977.0, "Text": " So how do they make money of it?"}, {"Time_Start": 1977.0, "Time_End": 1978.0, "Text": " It's simple."}, {"Time_Start": 1978.0, "Time_End": 1982.0, "Text": " Yes, neither IBM, no HP, or anybody else going through the process"}, {"Time_Start": 1982.0, "Time_End": 1984.0, "Text": " will deny that the result is covered by the GPL."}, {"Time_Start": 1984.0, "Time_End": 1985.0, "Text": " They fully will admit it."}, {"Time_Start": 1985.0, "Time_End": 1987.0, "Text": " You will be able to download the source code."}, {"Time_Start": 1987.0, "Time_End": 1989.0, "Text": " You will be able to download it."}, {"Time_Start": 1989.0, "Time_End": 1990.0, "Text": " You will be able to compile it."}, {"Time_Start": 1990.0, "Time_End": 1991.0, "Text": " You will be able to patch it."}, {"Time_Start": 1991.0, "Time_End": 1993.0, "Text": " You can't do absolutely anything except run it"}, {"Time_Start": 1993.0, "Time_End": 1999.0, "Text": " trusted mode. Your operating system will do anything, it just won't run as in supervisor mode,"}, {"Time_Start": 1999.0, "Time_End": 2003.0, "Text": " which said it does away with some of the utility of that operating system."}, {"Time_Start": 2003.0, "Time_End": 2005.0, "Text": " Why will it not run in supervisor mode?"}, {"Time_Start": 2005.0, "Time_End": 2008.0, "Text": " It won't run in supervisor mode because you don't have the right certificate."}, {"Time_Start": 2008.0, "Time_End": 2016.0, "Text": " You will need a motherboard-specific certificate in order for the operating system to access privileged mode"}, {"Time_Start": 2016.0, "Time_End": 2017.0, "Text": " on the new motherboards."}, {"Time_Start": 2017.0, "Time_End": 2019.0, "Text": " Well, you don't have that certificate."}, {"Time_Start": 2019.0, "Time_End": 2022.0, "Text": " Even if H.P."}, {"Time_Start": 2022.0, "Time_End": 2022.98, "Text": " Even if H."}, {"Time_Start": 2023.0, "Time_End": 2026.0, "Text": " and IBM were to publish their own certificate."}, {"Time_Start": 2026.0, "Time_End": 2027.0, "Text": " It only works on their motherboard."}, {"Time_Start": 2027.0, "Time_End": 2029.0, "Text": " It doesn't do you any good."}, {"Time_Start": 2029.0, "Time_End": 2032.0, "Text": " So there were some suggested fixes to the GPL."}, {"Time_Start": 2032.0, "Time_End": 2033.0, "Text": " I'll go over a couple of them."}, {"Time_Start": 2033.0, "Time_End": 2035.0, "Text": " The first one is to require software office"}, {"Time_Start": 2035.0, "Time_End": 2037.0, "Text": " to provide whichever service is necessary"}, {"Time_Start": 2037.0, "Time_End": 2041.0, "Text": " to enable an application to operate as to user desires."}, {"Time_Start": 2041.0, "Time_End": 2045.0, "Text": " First and foremost, it would kill the GPL."}, {"Time_Start": 2045.0, "Time_End": 2050.0, "Text": " It violates Richard Stallman's free speech versus free beer principle"}, {"Time_Start": 2050.0, "Time_End": 2053.0, "Text": " because it would require the application vendor"}, {"Time_Start": 2053.0, "Time_End": 2057.0, "Text": " to create a certificate for each user, they may not be able to do that."}, {"Time_Start": 2057.0, "Time_End": 2061.0, "Text": " At any rate, they would have to provide a service to each user."}, {"Time_Start": 2061.0, "Time_End": 2065.0, "Text": " I say the user sends them a key, they would have to send them back a cert."}, {"Time_Start": 2065.0, "Time_End": 2069.0, "Text": " That's no longer permitting free speech that's providing free beer."}, {"Time_Start": 2069.0, "Time_End": 2075.0, "Text": " Furthermore, the application vendors can't just provide you with a master key"}, {"Time_Start": 2075.0, "Time_End": 2081.0, "Text": " because the TPM, of course, does not just secure HP or IBM's version of Linux."}, {"Time_Start": 2081.0, "Time_End": 2082.0, "Text": " It also secures Snow White."}, {"Time_Start": 2082.0, "Time_End": 2086.0, "Text": " snow white. If the, if IBM and H.P were to provide it with a master key,"}, {"Time_Start": 2086.0, "Time_End": 2091.0, "Text": " chances are you would be able to decrypt other digital rights management encrypted software"}, {"Time_Start": 2091.0, "Time_End": 2096.0, "Text": " and thus, and thus that would be a violation of the MCA."}, {"Time_Start": 2096.0, "Time_End": 2100.0, "Text": " Lastly, in many cases, you will have third-party vendors such as very signed, sign these certificates."}, {"Time_Start": 2100.0, "Time_End": 2107.0, "Text": " You can't conceivably mandate that a third-party vendor provide a service that isn't even parted or a contract."}, {"Time_Start": 2107.0, "Time_End": 2110.0, "Text": " What did Richard Stallman have to say about this?"}, {"Time_Start": 2110.0, "Time_End": 2111.0, "Text": " I talked with him about it."}, {"Time_Start": 2111.0, "Time_End": 2117.0, "Text": " about it, his reply was, treacherous computing is a major threat to our freedom. I think I would agree."}, {"Time_Start": 2117.0, "Time_End": 2124.5, "Text": " And it is treacherous computing. Let's look at information and validation. As I mentioned earlier,"}, {"Time_Start": 2124.5, "Time_End": 2129.0, "Text": " applications will be able to query document revocation lists service for the latest document"}, {"Time_Start": 2129.0, "Time_End": 2134.0, "Text": " verification lists. Not all applications will implement that. So far, there is, so far there"}, {"Time_Start": 2134.0, "Time_End": 2140.98, "Text": " are no TCP enabled applications. However, some application vendors have already begun."}, {"Time_Start": 2141.0, "Time_End": 2145.0, "Text": " at looking at additional digitalized management,"}, {"Time_Start": 2145.0, "Time_End": 2148.0, "Text": " not just time-based, but also revocation-based."}, {"Time_Start": 2148.0, "Time_End": 2151.0, "Text": " For example, you may wish to be able,"}, {"Time_Start": 2151.0, "Time_End": 2155.0, "Text": " in a company to implement mandatory access control."}, {"Time_Start": 2155.0, "Time_End": 2157.0, "Text": " Only employees can access the data."}, {"Time_Start": 2157.0, "Time_End": 2162.0, "Text": " But even after that, you as the generator of a document"}, {"Time_Start": 2162.0, "Time_End": 2165.0, "Text": " may wish to have the ability to at some point"}, {"Time_Start": 2165.0, "Time_End": 2169.0, "Text": " enforce that the document will be superseded with a new version."}, {"Time_Start": 2169.0, "Time_End": 2170.0, "Text": " For that, you need to be able to recall the document"}, {"Time_Start": 2170.0, "Time_End": 2175.0, "Text": " to recall the document that you have written, but you don't know who has that copy of the word document."}, {"Time_Start": 2175.0, "Time_End": 2177.0, "Text": " It could have spread anywhere."}, {"Time_Start": 2177.0, "Time_End": 2185.0, "Text": " Consequently, what you need is our servers that allow you to invalidate and revoke documents."}, {"Time_Start": 2185.0, "Time_End": 2189.0, "Text": " There are a number of reasons why a document might be placed on the DRL."}, {"Time_Start": 2189.0, "Time_End": 2193.0, "Text": " Application vendors could, though I suspect they will not,"}, {"Time_Start": 2193.0, "Time_End": 2197.0, "Text": " because I believe they do not wish to take the heat for such a step."}, {"Time_Start": 2197.0, "Time_End": 2199.98, "Text": " Application vendors could invalidate a document, generally,"}, {"Time_Start": 2200.0, "Time_End": 2202.0, "Text": " by a specific application."}, {"Time_Start": 2202.0, "Time_End": 2205.0, "Text": " If it comes out that your application was cracked, was hacked,"}, {"Time_Start": 2205.0, "Time_End": 2210.0, "Text": " was stolen, and the application vendor finds out which of these federal numbers has been spread"}, {"Time_Start": 2210.0, "Time_End": 2212.0, "Text": " all over to tell out the application"}, {"Time_Start": 2212.0, "Time_End": 2215.0, "Text": " could revoke all documents ever generated by the application."}, {"Time_Start": 2215.0, "Time_End": 2217.0, "Text": " So not only will the applications stop working,"}, {"Time_Start": 2217.0, "Time_End": 2221.0, "Text": " but any document you've ever generated with it will no longer display on anybody's computer."}, {"Time_Start": 2221.0, "Time_End": 2223.0, "Text": " I don't think the application vendors will do that."}, {"Time_Start": 2223.0, "Time_End": 2227.0, "Text": " I think it's too ambitious, I believe the legal ramifications are too sketchy"}, {"Time_Start": 2227.0, "Time_End": 2229.0, "Text": " even for the application vendors."}, {"Time_Start": 2229.0, "Time_End": 2232.0, "Text": " It could be mandated by a court order."}, {"Time_Start": 2232.0, "Time_End": 2238.0, "Text": " For example, the document in question might contain the horsemen of the Infocalypse."}, {"Time_Start": 2238.0, "Time_End": 2245.0, "Text": " Instructions for narcotics trafficking, child pornography, the next version of DCSS."}, {"Time_Start": 2245.0, "Time_End": 2248.0, "Text": " Whatever the case may be, whatever the government doesn't want you to see,"}, {"Time_Start": 2248.0, "Time_End": 2250.0, "Text": " whatever the vendors don't want you to see,"}, {"Time_Start": 2250.0, "Time_End": 2256.0, "Text": " if they can take their case to a court and the court will issue injunction,"}, {"Time_Start": 2256.0, "Time_End": 2258.0, "Text": " that the following leaked document, the following information is,"}, {"Time_Start": 2258.0, "Time_End": 2264.0, "Text": " information is not in the best interest of, or is against the law, I should say,"}, {"Time_Start": 2264.0, "Time_End": 2269.0, "Text": " then your documents could be invalided globally."}, {"Time_Start": 2269.0, "Time_End": 2271.0, "Text": " It could be local illegal content."}, {"Time_Start": 2271.0, "Time_End": 2275.0, "Text": " Pictures of women without veils are illegal in Muslim countries, as I mentioned, copy control,"}, {"Time_Start": 2275.0, "Time_End": 2281.0, "Text": " ciphers or illegal, or at least the content providers claim are illegal to be republished"}, {"Time_Start": 2281.0, "Time_End": 2287.0, "Text": " in the US as the DCSS, DVD CCA case showed."}, {"Time_Start": 2287.0, "Time_End": 2290.0, "Text": " The list of reasons is essentially unlimited,"}, {"Time_Start": 2290.0, "Time_End": 2293.0, "Text": " as it is for censorship."}, {"Time_Start": 2293.0, "Time_End": 2297.0, "Text": " It facilitates intelligence collection, documents signed by user keys"}, {"Time_Start": 2297.0, "Time_End": 2301.0, "Text": " very much simplified activity correlation."}, {"Time_Start": 2301.0, "Time_End": 2304.0, "Text": " Yes, you can have multiple keys, but how many keys are you going to have?"}, {"Time_Start": 2304.0, "Time_End": 2307.0, "Text": " Two, three, five, ten."}, {"Time_Start": 2307.0, "Time_End": 2308.0, "Text": " You won't have a hundred."}, {"Time_Start": 2308.0, "Time_End": 2312.0, "Text": " And even if you had a hundred, how do you keep track of a hundred keys?"}, {"Time_Start": 2312.0, "Time_End": 2314.0, "Text": " Especially not if it comes out."}, {"Time_Start": 2314.0, "Time_End": 2316.0, "Text": " You have to pay per key because, of course, very signed."}, {"Time_Start": 2316.0, "Time_End": 2320.8, "Text": " sign, probably, will not sign your keys for free."}, {"Time_Start": 2320.8, "Time_End": 2325.4, "Text": " Initially, sure, you may not have to pay, but do not believe for one moment that the service"}, {"Time_Start": 2325.4, "Time_End": 2327.9, "Text": " will be free in perpetuity."}, {"Time_Start": 2327.9, "Time_End": 2332.6, "Text": " A global unique document ideas, of course, obviously, facility traffic analysis, and this"}, {"Time_Start": 2332.6, "Time_End": 2337.8, "Text": " preemptive information validation greatly simplifies information flow control."}, {"Time_Start": 2337.8, "Time_End": 2343.9, "Text": " If information has leaked out, say, by a disgruntled government employee who decides that they"}, {"Time_Start": 2343.9, "Time_End": 2345.98, "Text": " wish to share with the public some of the"}, {"Time_Start": 2346.0, "Time_End": 2351.0, "Text": " that the government was up to, they can just take the document and invalidate it."}, {"Time_Start": 2351.0, "Time_End": 2358.0, "Text": " Law enforcement needs, the moment you have DLM, the moment you have digital signatures on documents,"}, {"Time_Start": 2358.0, "Time_End": 2364.0, "Text": " the moment this key is being kept in hardware and can be proven to have never left the hardware because it's a hardware security module,"}, {"Time_Start": 2364.0, "Time_End": 2367.0, "Text": " you have undeniable proof of authorship."}, {"Time_Start": 2367.0, "Time_End": 2370.0, "Text": " Law enforcement likes undeniable proof of authorship,"}, {"Time_Start": 2370.0, "Time_End": 2373.0, "Text": " courts like undeniable proof of authorship,"}, {"Time_Start": 2373.0, "Time_End": 2375.0, "Text": " opposing parties like undeniable proof of authorship."}, {"Time_Start": 2375.0, "Time_End": 2379.0, "Text": " proof of authorship. You have the document in the tracking I've talked about."}, {"Time_Start": 2379.0, "Time_End": 2386.0, "Text": " Now, what happens if a document gets invalidated? Let's say there's a document that contains"}, {"Time_Start": 2386.0, "Time_End": 2395.0, "Text": " what the NPA asserts is illegal decryption software. Let's say the document gets invalidated."}, {"Time_Start": 2395.0, "Time_End": 2399.0, "Text": " You still need to be able to access the document in court to prove that this guy, in fact,"}, {"Time_Start": 2399.0, "Time_End": 2404.0, "Text": " was trafficking in a mathematical equation that could be used to decrypt."}, {"Time_Start": 2404.0, "Time_End": 2406.0, "Text": " curbed snow white."}, {"Time_Start": 2406.0, "Time_End": 2412.0, "Text": " Well, needless to say, there will be special versions for special people"}, {"Time_Start": 2412.0, "Time_End": 2415.0, "Text": " that have different rules of access control,"}, {"Time_Start": 2415.0, "Time_End": 2418.0, "Text": " that law enforcement purpose, evidentiary purposes,"}, {"Time_Start": 2418.0, "Time_End": 2422.0, "Text": " that these special versions, however, will never leak out into the public"}, {"Time_Start": 2422.0, "Time_End": 2425.0, "Text": " because just as the applications I mentioned earlier,"}, {"Time_Start": 2425.0, "Time_End": 2429.0, "Text": " they're key to a specific motherboard, they simply won't run on another motherboard."}, {"Time_Start": 2429.0, "Time_End": 2432.0, "Text": " Will the TCP meet governmental requirements?"}, {"Time_Start": 2432.0, "Time_End": 2433.0, "Text": " Let's ask Microsoft."}, {"Time_Start": 2433.0, "Time_End": 2438.0, "Text": " Marty Huarez, the Microsoft Palladium, which is the TCP variant product manager,"}, {"Time_Start": 2438.0, "Time_End": 2444.0, "Text": " said, we're talking to the government because there are governments in the world and not just the US governments,"}, {"Time_Start": 2444.0, "Time_End": 2449.0, "Text": " all of which needs need to be met for a global initiative such as this to actually take off."}, {"Time_Start": 2449.0, "Time_End": 2452.0, "Text": " Let's quickly look at Fritz Hollings' bill."}, {"Time_Start": 2452.0, "Time_End": 2454.0, "Text": " I was mentioned briefly earlier."}, {"Time_Start": 2454.0, "Time_End": 2458.0, "Text": " Fritz Hollings' bill's objective is to pluck the analog hole."}, {"Time_Start": 2458.0, "Time_End": 2462.98, "Text": " Fritz is a senator in the U.S. Senate with 2048 bit R.S."}, {"Time_Start": 2463.0, "Time_End": 2468.76, "Text": " What does this mean? Encrypt monitor out, encrypt video out, encrypt audio out."}, {"Time_Start": 2468.76, "Time_End": 2479.0, "Text": " Do not give the user an ability to get at the clear text the raw analog data coming out of a mini-dent jack."}, {"Time_Start": 2479.0, "Time_End": 2484.8, "Text": " In Microsoft's case, they also plan to additionally encrypt the keyboard."}, {"Time_Start": 2484.8, "Time_End": 2490.5, "Text": " This bill would make it illegal in the United States, if passed, would make it illegal in the United States"}, {"Time_Start": 2490.5, "Time_End": 2492.98, "Text": " to not, to sell in the future cell motherboard."}, {"Time_Start": 2493.0, "Time_End": 2496.0, "Text": " that are not equipped with TCPA compliant computers."}, {"Time_Start": 2496.0, "Time_End": 2498.0, "Text": " Earlier you may have thought, this is just insane."}, {"Time_Start": 2498.0, "Time_End": 2500.0, "Text": " Nobody will buy this stuff."}, {"Time_Start": 2500.0, "Time_End": 2501.0, "Text": " You won't be given a choice."}, {"Time_Start": 2501.0, "Time_End": 2504.0, "Text": " You will buy it, or what else could happen?"}, {"Time_Start": 2504.0, "Time_End": 2506.0, "Text": " Let's take another quiz."}, {"Time_Start": 2506.0, "Time_End": 2510.0, "Text": " What is the penalty a person selling a non-TCP approved computer"}, {"Time_Start": 2510.0, "Time_End": 2512.0, "Text": " will face under the Hollings bill?"}, {"Time_Start": 2512.0, "Time_End": 2514.0, "Text": " Answering a fix-it ticket."}, {"Time_Start": 2514.0, "Time_End": 2516.0, "Text": " Anybody here believe it's going to be a fix-it ticket?"}, {"Time_Start": 2516.0, "Time_End": 2518.0, "Text": " All right, we have a few."}, {"Time_Start": 2518.0, "Time_End": 2521.0, "Text": " You guys, they lay off these drugs."}, {"Time_Start": 2521.0, "Time_End": 2522.0, "Text": " I know it's DEFCOM, but still."}, {"Time_Start": 2522.0, "Time_End": 2524.0, "Text": " have come, but still."}, {"Time_Start": 2524.0, "Time_End": 2526.0, "Text": " We have six months in jail."}, {"Time_Start": 2526.0, "Time_End": 2528.0, "Text": " Who thinks it's six months in jail?"}, {"Time_Start": 2528.0, "Time_End": 2529.0, "Text": " Nobody."}, {"Time_Start": 2529.0, "Time_End": 2533.0, "Text": " And then answer, C, a $500,000 fine and five years in prison"}, {"Time_Start": 2533.0, "Time_End": 2536.0, "Text": " for the first computer you're selling that doesn't comply to the TCPA."}, {"Time_Start": 2536.0, "Time_End": 2539.0, "Text": " Double that for each subsequent offense."}, {"Time_Start": 2539.0, "Time_End": 2542.0, "Text": " All right, all right, we're making progress here."}, {"Time_Start": 2542.0, "Time_End": 2543.0, "Text": " That's correct."}, {"Time_Start": 2543.0, "Time_End": 2546.0, "Text": " The correct answer is C, $500,000 fine,"}, {"Time_Start": 2546.0, "Time_End": 2549.0, "Text": " and five year in present for the first computer you're selling"}, {"Time_Start": 2549.0, "Time_End": 2552.0, "Text": " and potentially 10 years and a million dollars for."}, {"Time_Start": 2552.0, "Time_End": 2557.0, "Text": " each subsequent computer you're selling."}, {"Time_Start": 2557.0, "Time_End": 2559.0, "Text": " Bob Palladium will release is open source."}, {"Time_Start": 2559.0, "Time_End": 2561.0, "Text": " We have good news."}, {"Time_Start": 2561.0, "Time_End": 2564.0, "Text": " Microsoft announced that Palladium's source code will be published."}, {"Time_Start": 2564.0, "Time_End": 2566.0, "Text": " The group VP for Windows says,"}, {"Time_Start": 2566.0, "Time_End": 2569.0, "Text": " we're trying to be transparent in all of this."}, {"Time_Start": 2569.0, "Time_End": 2570.0, "Text": " Uh-huh."}, {"Time_Start": 2570.0, "Time_End": 2574.0, "Text": " Some take this as proof that Microsoft has changed its business practices."}, {"Time_Start": 2574.0, "Time_End": 2578.0, "Text": " Now there's continue to remain skeptical."}, {"Time_Start": 2578.0, "Time_End": 2580.0, "Text": " Yet on to another quiz."}, {"Time_Start": 2580.0, "Time_End": 2582.0, "Text": " Why is Microsoft releasing their source?"}, {"Time_Start": 2582.0, "Time_End": 2583.0, "Text": " code."}, {"Time_Start": 2583.0, "Time_End": 2586.0, "Text": " That just seems out of character, some would think."}, {"Time_Start": 2586.0, "Time_End": 2588.0, "Text": " Here are the answers."}, {"Time_Start": 2588.0, "Time_End": 2589.0, "Text": " Answer A."}, {"Time_Start": 2589.0, "Time_End": 2594.0, "Text": " Microsoft intends to place Microsoft Office under the GPL in 2003."}, {"Time_Start": 2594.0, "Time_End": 2596.0, "Text": " Answer B."}, {"Time_Start": 2596.0, "Time_End": 2602.0, "Text": " Microsoft will release the Windows source code under the BSD license in 2004."}, {"Time_Start": 2602.0, "Time_End": 2604.0, "Text": " All right, all right."}, {"Time_Start": 2604.0, "Time_End": 2605.0, "Text": " Yeah, BSD."}, {"Time_Start": 2605.0, "Time_End": 2606.0, "Text": " Go BSD."}, {"Time_Start": 2606.0, "Time_End": 2609.0, "Text": " I'm a big free BSD in my fan myself, said."}, {"Time_Start": 2609.0, "Time_End": 2611.0, "Text": " Answer C, Microsoft has little choice."}, {"Time_Start": 2611.0, "Time_End": 2616.2, "Text": " has little choice but released Palladium as open source because the hauling spill requires it."}, {"Time_Start": 2616.2, "Time_End": 2619.8, "Text": " Yeah, yeah, yeah, yeah, all right."}, {"Time_Start": 2619.8, "Time_End": 2623.0, "Text": " Answer C S28 requires that, and I quote,"}, {"Time_Start": 2623.0, "Time_End": 2631.0, "Text": " the security system standards shall ensure that any software proportion of such standards is based on open source code."}, {"Time_Start": 2631.0, "Time_End": 2638.0, "Text": " So maybe we'll have to wait for the, for NT under the GPL or longer."}, {"Time_Start": 2638.0, "Time_End": 2639.0, "Text": " Use of TPMs is voluntary."}, {"Time_Start": 2639.0, "Time_End": 2640.0, "Text": " You'll hear that all over the place."}, {"Time_Start": 2640.0, "Time_End": 2644.88, "Text": " over the place. One thing that Stuart Orkin's security officer from Microsoft will guarantee"}, {"Time_Start": 2644.88, "Time_End": 2649.56, "Text": " is the Palladium will be off by default. Absolutely true. You don't need to run it. You don't need"}, {"Time_Start": 2649.56, "Time_End": 2656.48, "Text": " to boot your computer. Using gasoline, that car is an opt-in technology. What I found here"}, {"Time_Start": 2656.48, "Time_End": 2663.24, "Text": " is a rare piece of history. It's a wood gas carburetor. After Germany in World War II had been"}, {"Time_Start": 2663.24, "Time_End": 2669.48, "Text": " cut up from its oil reserves, they mounted these wood, basically it's like a big oven,"}, {"Time_Start": 2670.0, "Time_End": 2676.0, "Text": " stove that gets fired from below, you put wood in it, if heated dry, it generates flammable gas"}, {"Time_Start": 2676.0, "Time_End": 2678.0, "Text": " that you can then feed into your carb."}, {"Time_Start": 2678.0, "Time_End": 2682.0, "Text": " You don't get much performance out of the car, but it will move the car forward."}, {"Time_Start": 2682.0, "Time_End": 2685.5, "Text": " If that's all the functionality you want out, if your computer is absolutely correct,"}, {"Time_Start": 2685.5, "Time_End": 2690.0, "Text": " you will not need to use palladiums. It's totally voluntary, absolutely, no doubt about it."}, {"Time_Start": 2690.0, "Time_End": 2695.0, "Text": " Now, some people say, lucky you're an alarmist."}, {"Time_Start": 2695.0, "Time_End": 2699.98, "Text": " Nobody would ever do such an evil thing. No operating system vendor would ever dare to"}, {"Time_Start": 2700.0, "Time_End": 2703.68, "Text": " to block undesirable applications from running on a computer."}, {"Time_Start": 2703.68, "Time_End": 2706.84, "Text": " Well, let's ask Microsoft."}, {"Time_Start": 2706.84, "Time_End": 2711.96, "Text": " Let's quote Microsoft's Windows Media Players' End-user Licensing Agreement."}, {"Time_Start": 2711.96, "Time_End": 2717.04, "Text": " Microsoft may provide security-related updates to the operating system components that will be automatically"}, {"Time_Start": 2717.04, "Time_End": 2719.24, "Text": " downloaded onto your computer."}, {"Time_Start": 2719.24, "Time_End": 2725.08, "Text": " These security-related updates may disable your ability to copy and or place secure content"}, {"Time_Start": 2725.08, "Time_End": 2728.24, "Text": " and use other software on your computer."}, {"Time_Start": 2728.24, "Time_End": 2729.88, "Text": " It's in the end-use licensing agreement."}, {"Time_Start": 2730.0, "Time_End": 2735.0, "Text": " right now. So would they disable applications running on your computer?"}, {"Time_Start": 2735.0, "Time_End": 2740.0, "Text": " Once they can, I think some might say they will."}, {"Time_Start": 2740.0, "Time_End": 2742.0, "Text": " Microsoft says they will."}, {"Time_Start": 2742.0, "Time_End": 2746.0, "Text": " Let's take a quick look at the digital holes in phase one."}, {"Time_Start": 2746.0, "Time_End": 2749.0, "Text": " The upcodes are in plaintext on the bus, meaning you can mic, broke them off."}, {"Time_Start": 2749.0, "Time_End": 2752.0, "Text": " The solution is bleeding obvious."}, {"Time_Start": 2752.0, "Time_End": 2757.0, "Text": " In phase two, the encrypted CPU instruction sets will not be decrypted until they hit the CPU"}, {"Time_Start": 2757.0, "Time_End": 2759.0, "Text": " CPU, in which now you get a decryptive."}, {"Time_Start": 2759.0, "Time_End": 2766.8, "Text": " which now you get to decap, now you get to decap a P5, you get to work down your layers, it gets nasty, it gets hideously expensive."}, {"Time_Start": 2767.9, "Time_End": 2771.6, "Text": " Users can select non-tCP approved operating system for minimum functionality."}, {"Time_Start": 2772.28, "Time_End": 2776.44, "Text": " Obvious solution prevent the nano-approved OS from accessing CPU supervisor mode."}, {"Time_Start": 2777.24, "Time_End": 2780.68, "Text": " Jeffrey Stronging, with AMD, who is very much in on this,"}, {"Time_Start": 2781.24, "Time_End": 2788.76, "Text": " there will be new modes and new instructions, a whole new class of microprocessors, not differentiated by"}, {"Time_Start": 2789.0, "Time_End": 2796.0, "Text": " but by security. They're adding a mode to the CPU. This new hardware architecture"}, {"Time_Start": 2796.0, "Time_End": 2801.64, "Text": " involves some changes to CPUs, which are significant from a functional perspective, said Mario"}, {"Time_Start": 2801.64, "Time_End": 2807.0, "Text": " Juarez with Microsoft, whom we quoted earlier. Yes, it will be significant from a functional perspective."}, {"Time_Start": 2807.0, "Time_End": 2811.0, "Text": " If you don't have one of the certificates, you will have no functionality."}, {"Time_Start": 2811.0, "Time_End": 2818.0, "Text": " Well, you can always run a real mode. Nothing will prevent you from running the CPU in real mode."}, {"Time_Start": 2818.0, "Time_End": 2818.98, "Text": " You are certainly welcome to do that."}, {"Time_Start": 2819.0, "Time_End": 2822.0, "Text": " The TCPA may not succeed."}, {"Time_Start": 2822.0, "Time_End": 2827.38, "Text": " In fact, I believe it will not succeed because there are people like Los Ross Anderson's writing"}, {"Time_Start": 2827.38, "Time_End": 2830.68, "Text": " facts and people like me giving talks."}, {"Time_Start": 2830.68, "Time_End": 2832.32, "Text": " But it might succeed."}, {"Time_Start": 2832.32, "Time_End": 2838.24, "Text": " If it will succeed, process ID, let's take a look at that, big strategic mistake, Intel went"}, {"Time_Start": 2838.24, "Time_End": 2842.8, "Text": " alone, AMD saw an ECPR victory, publicly rejected it."}, {"Time_Start": 2842.8, "Time_End": 2845.5, "Text": " There was another reason it wouldn't actually have done what they wanted to do."}, {"Time_Start": 2845.5, "Time_End": 2848.34, "Text": " TCPA and my process ID just wasn't aggressive enough."}, {"Time_Start": 2848.34, "Time_End": 2851.1600000000003, "Text": " And the online privacy groups were completely ignored."}, {"Time_Start": 2851.1600000000003, "Time_End": 2853.7200000000003, "Text": " Intel thought they could just steamroll over everybody."}, {"Time_Start": 2854.08, "Time_End": 2855.1400000000003, "Text": " It blew up with their faces."}, {"Time_Start": 2855.48, "Time_End": 2857.86, "Text": " They've learned, now that they're coming around for round two,"}, {"Time_Start": 2858.42, "Time_End": 2862.2000000000003, "Text": " they are a bit more savvy, they've learned their lessons."}, {"Time_Start": 2862.76, "Time_End": 2865.88, "Text": " They've built a broad consensus, Intel, AMD, monolroller,"}, {"Time_Start": 2866.2000000000003, "Time_End": 2867.92, "Text": " all the BIOS vendors that have ever mattered."}, {"Time_Start": 2868.42, "Time_End": 2872.02, "Text": " The system vendors and the application vendors that matter are all on board."}, {"Time_Start": 2873.1200000000003, "Time_End": 2876.32, "Text": " That makes it a lot easier to pull things off."}, {"Time_Start": 2877.32, "Time_End": 2878.32, "Text": " There's a two-privileged."}, {"Time_Start": 2878.34, "Time_End": 2881.34, "Text": " technical and legal initiatives."}, {"Time_Start": 2881.34, "Time_End": 2885.02, "Text": " As I mentioned, the TCPA, Palladium, et cetera, is on one side."}, {"Time_Start": 2885.02, "Time_End": 2888.6200000000003, "Text": " Senator Hollings and his bills are on the other side."}, {"Time_Start": 2888.6200000000003, "Time_End": 2891.7400000000002, "Text": " There's in fact, there's a companion bill in the house."}, {"Time_Start": 2891.7400000000002, "Time_End": 2894.6600000000003, "Text": " And the online privacy groups, at least according to the TCPA,"}, {"Time_Start": 2894.6600000000003, "Time_End": 2896.94, "Text": " were briefed early."}, {"Time_Start": 2896.94, "Time_End": 2899.2200000000003, "Text": " Which platforms will be enabled by TCPA?"}, {"Time_Start": 2899.2200000000003, "Time_End": 2902.38, "Text": " I took this from the website, the banner that is."}, {"Time_Start": 2902.38, "Time_End": 2904.6200000000003, "Text": " If you look at the image, you will see laptops, servers,"}, {"Time_Start": 2904.6200000000003, "Time_End": 2906.1400000000003, "Text": " PDAs, and mobile phones."}, {"Time_Start": 2906.1400000000003, "Time_End": 2908.32, "Text": " Mobile phones are actually the next big thing for the"}, {"Time_Start": 2908.34, "Time_End": 2912.58, "Text": " TCPA, which is what my Motorola is involved so actively."}, {"Time_Start": 2913.6200000000003, "Time_End": 2917.98, "Text": " In future versions, games, digital content, streaming MP3,"}, {"Time_Start": 2918.1000000000004, "Time_End": 2921.1600000000003, "Text": " all this stuff will be streamed down to the device on the 3G."}, {"Time_Start": 2921.7400000000002, "Time_End": 2926.7200000000003, "Text": " They don't want the user to be able to copy their music off the handheld device,"}, {"Time_Start": 2926.84, "Time_End": 2930.82, "Text": " to copy the games of the handheld device, hence we need TCPA on their mobile."}, {"Time_Start": 2931.86, "Time_End": 2933.04, "Text": " What will be the end result?"}, {"Time_Start": 2933.7200000000003, "Time_End": 2938.32, "Text": " According to John Manfredelli, the general manager for the Microw"}, {"Time_Start": 2938.34, "Time_End": 2943.78, "Text": " Microsoft Palladium Business Unit, the end result is a system with security similar"}, {"Time_Start": 2943.78, "Time_End": 2952.58, "Text": " to a closed architecture system, but with the flexibility of the open Windows platform."}, {"Time_Start": 2952.58, "Time_End": 2956.92, "Text": " I read this and I was wondering, what is he trying to say?"}, {"Time_Start": 2956.92, "Time_End": 2961.7200000000003, "Text": " And I think what he's trying to say is that you will have about as much control over your PC,"}, {"Time_Start": 2961.7200000000003, "Time_End": 2965.58, "Text": " be that operating system, be that applications, be that content, as if you were running"}, {"Time_Start": 2965.58, "Time_End": 2968.1400000000003, "Text": " on a timeshare system from behind a dumb terminal."}, {"Time_Start": 2968.34, "Time_End": 2975.34, "Text": " But they will make you maintain the system by all the equipment."}, {"Time_Start": 2975.34, "Time_End": 2980.34, "Text": " So pay for the equipment, pay for the maintenance,"}, {"Time_Start": 2980.34, "Time_End": 2986.34, "Text": " without them actually being required to provide all the infrastructure that a timeshare system would."}, {"Time_Start": 2986.34, "Time_End": 2992.34, "Text": " In some sense, Palladium and the TCPA are the offline version of .net."}, {"Time_Start": 2992.34, "Time_End": 2998.32, "Text": " All the security benefits for not allowing the user access to their own applications and their own platform."}, {"Time_Start": 2998.34, "Time_End": 3000.34, "Text": " without any of the costs."}, {"Time_Start": 3000.34, "Time_End": 3006.34, "Text": " At this time, I would like, I'm sorry, I've tried to run through this as quickly as possible, but we're low on time here."}, {"Time_Start": 3006.34, "Time_End": 3011.34, "Text": " I'm willing to take any questions you have, or at least try to take any question you have."}, {"Time_Start": 3011.34, "Time_End": 3013.34, "Text": " If you email me, I'm not reading email during DEF CON."}, {"Time_Start": 3013.34, "Time_End": 3016.34, "Text": " I know it's a HackerCon, but folks there have better things to do."}, {"Time_Start": 3016.34, "Time_End": 3019.34, "Text": " At DEF CON, I'll answer later or talk to me during the CON."}, {"Time_Start": 3019.34, "Time_End": 3020.34, "Text": " Find me somewhere."}, {"Time_Start": 3020.34, "Time_End": 3021.34, "Text": " There's some questions."}, {"Time_Start": 3021.34, "Time_End": 3023.34, "Text": " I see one right here. Yes, sir."}, {"Time_Start": 3023.34, "Time_End": 3024.34, "Text": " Yes, sir."}, {"Time_Start": 3028.34, "Time_End": 3030.34, "Text": " Quick, come up. I can't hear you."}, {"Time_Start": 3030.34, "Time_End": 3031.34, "Text": " Yes, the whole thing is morning."}, {"Time_Start": 3031.34, "Time_End": 3037.34, "Text": " You're going to do against the terrorist smashing the master key servers?"}, {"Time_Start": 3037.34, "Time_End": 3041.34, "Text": " Oh, what are they going to do against the terrorists smashing the key servers?"}, {"Time_Start": 3041.34, "Time_End": 3045.34, "Text": " I think the belief is that the key servers will be replicated."}, {"Time_Start": 3045.34, "Time_End": 3053.34, "Text": " The system that the key servers will be replicated that the network is sufficiently rigid at this point in time"}, {"Time_Start": 3053.34, "Time_End": 3057.34, "Text": " to not be subjected to terrorist attack."}, {"Time_Start": 3057.34, "Time_End": 3063.1400000000003, "Text": " What are they doing currently for you not being able to install Microsoft Office unless you contact back to Microsoft?"}, {"Time_Start": 3063.1400000000003, "Time_End": 3071.44, "Text": " The answer is during 9-1-1, people couldn't install Office, but terrorists, whether or not you can use your software is not a concern to Microsoft's business model."}, {"Time_Start": 3071.44, "Time_End": 3073.34, "Text": " There was somebody on the left."}, {"Time_Start": 3073.34, "Time_End": 3074.34, "Text": " Yes."}, {"Time_Start": 3077.34, "Time_End": 3080.34, "Text": " Come up a little bit if you have a question. I can't hear you if you further back."}, {"Time_Start": 3080.34, "Time_End": 3083.34, "Text": " What happens if the root key becomes compromised?"}, {"Time_Start": 3083.34, "Time_End": 3086.34, "Text": " I don't know because I don't even know who holds the root key."}, {"Time_Start": 3086.34, "Time_End": 3092.04, "Text": " Presumably the same thing that would happen if a major CA root key becomes compromised."}, {"Time_Start": 3092.04, "Time_End": 3094.04, "Text": " The odds of that happening are extremely low."}, {"Time_Start": 3094.04, "Time_End": 3098.84, "Text": " If you look at various science bunkers, if you look at some of the other major commercial CAs,"}, {"Time_Start": 3098.84, "Time_End": 3103.04, "Text": " the security measurements they put in place, the change of compromise is low."}, {"Time_Start": 3103.04, "Time_End": 3104.84, "Text": " I don't know what the strategy is."}, {"Time_Start": 3104.84, "Time_End": 3105.84, "Text": " Yes, sir."}, {"Time_Start": 3105.84, "Time_End": 3108.84, "Text": " Where is Apple computer and all of this?"}, {"Time_Start": 3108.84, "Time_End": 3109.84, "Text": " Where is Apple computer?"}, {"Time_Start": 3109.84, "Time_End": 3112.84, "Text": " Apple computer is watching."}, {"Time_Start": 3112.84, "Time_End": 3115.84, "Text": " Apple computer is not to be able to be able to do."}, {"Time_Start": 3115.84, "Time_End": 3118.84, "Text": " to my knowledge, on board."}, {"Time_Start": 3118.84, "Time_End": 3120.84, "Text": " But Motorola is."}, {"Time_Start": 3120.84, "Time_End": 3128.84, "Text": " And when Microsoft decides someday that Microsoft Office requires these features in the CPU,"}, {"Time_Start": 3128.84, "Time_End": 3133.84, "Text": " or it will not display documents generate on the Windows platform, which they intend to."}, {"Time_Start": 3133.84, "Time_End": 3136.84, "Text": " And Microsoft will simply go to Apple and says,"}, {"Time_Start": 3136.84, "Time_End": 3138.84, "Text": " Apple, you have two very simple choices."}, {"Time_Start": 3138.84, "Time_End": 3143.84, "Text": " You can implement DRM by using Motorola's CPUs with DRM capabilities built in,"}, {"Time_Start": 3143.84, "Time_End": 3145.84, "Text": " or we will no longer release Office on."}, {"Time_Start": 3145.84, "Time_End": 3149.84, "Text": " the Mac OS10 platform. I don't think Apple can afford that."}, {"Time_Start": 3149.84, "Time_End": 3155.84, "Text": " Come up, if you have any questions. I can't hear you if you more than a few lines, rose down."}, {"Time_Start": 3155.84, "Time_End": 3156.84, "Text": " Yes."}, {"Time_Start": 3156.84, "Time_End": 3169.84, "Text": " How about the government handle situations for the political systems that are not possible computers, but are capable of processing programs because they want FPGA?"}, {"Time_Start": 3169.84, "Time_End": 3175.82, "Text": " That, of course, is a question, only to be left for the courts during litigation, after the"}, {"Time_Start": 3175.84, "Time_End": 3183.84, "Text": " after the laws have been bill, my understanding is certainly from reading the Hollings Bill, and I'm not an attorney, I'll defer this to some of the attorneys in the audience,"}, {"Time_Start": 3183.84, "Time_End": 3197.84, "Text": " on that the Hollings Bill is by no means, just limited general purpose computers such as motherboards, but essentially covers any in all digital devices that the content holders feel may infringe on the copyright, yes, Seth. You were next."}, {"Time_Start": 3201.84, "Time_End": 3205.84, "Text": " Yes, I should mention that my apologies. The Hollings bill does not mention TCPA."}, {"Time_Start": 3205.84, "Time_End": 3223.84, "Text": " by name anywhere. In fact, it makes absolutely no reference to any technology, any specific technology by name, it just happens to describe if a capability that would need to be implemented, that as it so happens, simultaneously has become available out of the marketplace. What a marvelous coincidence."}, {"Time_Start": 3226.84, "Time_End": 3227.84, "Text": " I beg your pardon?"}, {"Time_Start": 3227.84, "Time_End": 3235.82, "Text": " How can you fight this? You can fight this by speaking up. You can fight this by educating people about some of the"}, {"Time_Start": 3235.84, "Time_End": 3239.84, "Text": " You will hear a lot about the positive consequences of TCP and Palladium."}, {"Time_Start": 3239.84, "Time_End": 3246.84, "Text": " You will hear how it will protect your computer from viruses and wares and worms and all these other promises."}, {"Time_Start": 3246.84, "Time_End": 3253.84, "Text": " At that time, I think it's helpful to point out what some of the potential negative consequences are."}, {"Time_Start": 3253.84, "Time_End": 3260.84, "Text": " Perhaps you can come up with a solution that will give us all of the, or at least much of the positive, without enabling all these negatives."}, {"Time_Start": 3260.84, "Time_End": 3265.82, "Text": " Because nobody is standing up there, so as far as the vendors are concerned, oh, we plan on revoking you"}, {"Time_Start": 3265.84, "Time_End": 3269.84, "Text": " documents. Now, you have to read through the lines as to what's going on. So,"}, {"Time_Start": 3269.84, "Time_End": 3272.84, "Text": " pointed out, yes."}, {"Time_Start": 3272.84, "Time_End": 3273.84, "Text": " Where can we get your slides?"}, {"Time_Start": 3273.84, "Time_End": 3279.84, "Text": " My slides, there is a version on the CD that is a couple weeks out of date."}, {"Time_Start": 3279.84, "Time_End": 3282.84, "Text": " The slides will show up on Cyphopunks Tonga."}, {"Time_Start": 3282.84, "Time_End": 3288.84, "Text": " As soon as I've had a chance to upload them, I unfortunately had a hardware failure a few days ago that I'm still recovering from."}, {"Time_Start": 3288.84, "Time_End": 3293.84, "Text": " But it will be on Cyphop Punk's Tonga, if not today, if not tomorrow, then certainly by next week."}, {"Time_Start": 3293.84, "Time_End": 3294.84, "Text": " Yes."}, {"Time_Start": 3294.84, "Time_End": 3300.84, "Text": " EPEC and EFF, where are they in terms of lobbying the U.S. government on the"}, {"Time_Start": 3300.84, "Time_End": 3311.84, "Text": " I don't presume to speak for the EFF or EPEC, but it's my understanding that they're currently investigating Palladium and TCPA to determine what their position should be."}, {"Time_Start": 3311.84, "Time_End": 3313.84, "Text": " Yes."}, {"Time_Start": 3313.84, "Time_End": 3324.82, "Text": " From an antitrust, and again I'm not an attorney and a trust typically only applies if you have some, if you have some, if it's just a trust."}, {"Time_Start": 3324.84, "Time_End": 3329.84, "Text": " typically only successful if you don't have a broad ability by the application vendors to join."}, {"Time_Start": 3329.84, "Time_End": 3331.84, "Text": " Anybody can join the TCPA."}, {"Time_Start": 3331.84, "Time_End": 3336.84, "Text": " You can, if you're a legitimate application vendor, you can get the application signed."}, {"Time_Start": 3336.84, "Time_End": 3341.84, "Text": " And the DMCA specifically says that you should not be able to read somebody else's"}, {"Time_Start": 3341.84, "Time_End": 3344.84, "Text": " digital rights management wrapped file formats,"}, {"Time_Start": 3344.84, "Time_End": 3348.84, "Text": " which I believe, but again, I'm not an attorney,"}, {"Time_Start": 3348.84, "Time_End": 3352.84, "Text": " essentially explicitly exempts it from antitrust."}, {"Time_Start": 3352.84, "Time_End": 3354.84, "Text": " Let's take somebody from over the yesterday."}, {"Time_Start": 3354.84, "Time_End": 3361.84, "Text": " Yes, ma'am."}, {"Time_Start": 3361.84, "Time_End": 3363.84, "Text": " Oh, yes, I probably should point this out."}, {"Time_Start": 3363.84, "Time_End": 3368.84, "Text": " The new mode that will be added will be, it will effectively do,"}, {"Time_Start": 3368.84, "Time_End": 3371.84, "Text": " play the role of what today is done by ring zero,"}, {"Time_Start": 3371.84, "Time_End": 3373.84, "Text": " but it will really be a ring minus one."}, {"Time_Start": 3373.84, "Time_End": 3375.84, "Text": " So your existing ring zero,"}, {"Time_Start": 3375.84, "Time_End": 3378.84, "Text": " in ring zero code will run in ring zero being numberizer,"}, {"Time_Start": 3378.84, "Time_End": 3380.84, "Text": " thinking it's in ring zero."}, {"Time_Start": 3380.84, "Time_End": 3384.84, "Text": " However, above it is a ring minus one that determined"}, {"Time_Start": 3384.84, "Time_End": 3391.84, "Text": " which memory space your ring zero code then can sub-allocated to your ring one, two, and three code."}, {"Time_Start": 3391.84, "Time_End": 3394.84, "Text": " So it's, so from a compatibility of perspective,"}, {"Time_Start": 3394.84, "Time_End": 3399.84, "Text": " you will still be able to run all the existing operating systems and all the existing applications."}, {"Time_Start": 3399.84, "Time_End": 3402.84, "Text": " It's just they will not be able to get any of the protected storage"}, {"Time_Start": 3402.84, "Time_End": 3405.84, "Text": " or any of the other information that's protected by the TPM."}, {"Time_Start": 3405.84, "Time_End": 3410.84, "Text": " From your OS perspective, what's happening and above it is totally transparent."}, {"Time_Start": 3410.84, "Time_End": 3411.84, "Text": " Yes."}, {"Time_Start": 3411.84, "Time_End": 3412.84, "Text": " Yes."}, {"Time_Start": 3412.84, "Time_End": 3413.84, "Text": " Oh, so it's a special case."}, {"Time_Start": 3413.84, "Time_End": 3415.84, "Text": " Oh, Sony is a special case."}, {"Time_Start": 3415.84, "Time_End": 3417.84, "Text": " Sony, of course, is both..."}, {"Time_Start": 3417.84, "Time_End": 3420.84, "Text": " Microsoft is somewhat of a small content provider."}, {"Time_Start": 3420.84, "Time_End": 3424.84, "Text": " They have Microsoft NBC in a few, but they're not so much in the content game."}, {"Time_Start": 3424.84, "Time_End": 3428.84, "Text": " Sony is both heavily in the content and heavily in the computer game."}, {"Time_Start": 3428.84, "Time_End": 3435.84, "Text": " If you look at the membership lists of the various groups fighting for"}, {"Time_Start": 3435.84, "Time_End": 3441.84, "Text": " legal protection of the copyrighted work by means of vaconian technical means,"}, {"Time_Start": 3441.84, "Time_End": 3442.84, "Text": " you will find that there's very..."}, {"Time_Start": 3442.84, "Time_End": 3444.84, "Text": " will find that there is very little overlap."}, {"Time_Start": 3444.84, "Time_End": 3450.84, "Text": " It appears that the vendors made a decision to choose"}, {"Time_Start": 3450.84, "Time_End": 3456.84, "Text": " one of the fora to fight in, be that either the content provider for or the technologist's"}, {"Time_Start": 3456.84, "Time_End": 3461.84, "Text": " for a Sony is very heavily involved in the content technology list, content technology"}, {"Time_Start": 3461.84, "Time_End": 3465.84, "Text": " forest, not so much in the content forest, not so much in the technology for us."}, {"Time_Start": 3465.84, "Time_End": 3469.84, "Text": " It appears they've chosen to fight the fight to fight in the content forest"}, {"Time_Start": 3469.84, "Time_End": 3471.84, "Text": " in the content forest rather than technology forest."}, {"Time_Start": 3471.84, "Time_End": 3472.84, "Text": " Sorry."}, {"Time_Start": 3472.84, "Time_End": 3473.84, "Text": " long-winded answer."}, {"Time_Start": 3473.84, "Time_End": 3474.84, "Text": " Yes."}, {"Time_Start": 3474.84, "Time_End": 3475.84, "Text": " Yes."}, {"Time_Start": 3475.84, "Time_End": 3476.84, "Text": " Yes."}, {"Time_Start": 3476.84, "Time_End": 3491.84, "Text": " Again, that's a question for your attorney only after the law has been passed by Congress and signed"}, {"Time_Start": 3491.84, "Time_End": 3492.84, "Text": " by the President."}, {"Time_Start": 3492.84, "Time_End": 3496.84, "Text": " And even then the question probably can't be answered until there's been some case law."}, {"Time_Start": 3496.84, "Time_End": 3497.84, "Text": " I'm running over time."}, {"Time_Start": 3497.84, "Time_End": 3499.84, "Text": " I'll take one more question after U.S."}, {"Time_Start": 3499.84, "Time_End": 3504.84, "Text": " I don't know if this is the answer."}, {"Time_Start": 3504.84, "Time_End": 3509.84, "Text": " I choose to believe that it's not a digitalized management,"}, {"Time_Start": 3509.84, "Time_End": 3512.84, "Text": " the requirement does not come into play"}, {"Time_Start": 3512.84, "Time_End": 3515.84, "Text": " unless there's actually some digital rights management"}, {"Time_Start": 3515.84, "Time_End": 3516.84, "Text": " that can take place."}, {"Time_Start": 3516.84, "Time_End": 3519.84, "Text": " So for, say, if you have a new file format"}, {"Time_Start": 3519.84, "Time_End": 3521.84, "Text": " in which none of the content providers"}, {"Time_Start": 3521.84, "Time_End": 3525.84, "Text": " publish their digitally right managed content,"}, {"Time_Start": 3525.84, "Time_End": 3527.84, "Text": " then you're probably okay."}, {"Time_Start": 3527.84, "Time_End": 3528.84, "Text": " If you have a general purpose,"}, {"Time_Start": 3528.84, "Time_End": 3530.84, "Text": " If you have a general purpose computing platform,"}, {"Time_Start": 3530.84, "Time_End": 3532.84, "Text": " things might get dicey."}, {"Time_Start": 3532.84, "Time_End": 3533.84, "Text": " One more questions."}, {"Time_Start": 3533.84, "Time_End": 3534.84, "Text": " And the other question that I said,"}, {"Time_Start": 3534.84, "Time_End": 3536.84, "Text": " find met the con, send me some email."}, {"Time_Start": 3536.84, "Time_End": 3538.84, "Text": " Let's take some in the back, but you have to step up"}, {"Time_Start": 3538.84, "Time_End": 3540.84, "Text": " because I will not be able to hear from where you stand."}, {"Time_Start": 3540.84, "Time_End": 3542.84, "Text": " Most of the negative impact means nothing"}, {"Time_Start": 3542.84, "Time_End": 3545.84, "Text": " to the average user with the majority of the marketplace."}, {"Time_Start": 3545.84, "Time_End": 3547.84, "Text": " How do we make this feel to the"}, {"Time_Start": 3547.84, "Time_End": 3549.84, "Text": " the application?"}, {"Time_Start": 3549.84, "Time_End": 3553.84, "Text": " The question was, most of the average users couldn't care less"}, {"Time_Start": 3553.84, "Time_End": 3555.84, "Text": " as to whether they can compile their own operating systems"}, {"Time_Start": 3555.84, "Time_End": 3557.84, "Text": " or their own applications."}, {"Time_Start": 3557.84, "Time_End": 3558.82, "Text": " In fact, most average"}, {"Time_Start": 3558.84, "Time_End": 3565.84, "Text": " users probably would be, would happily entrust the security of their computer to the FBI and the Office of Homeland Security readily."}, {"Time_Start": 3565.84, "Time_End": 3569.84, "Text": " And many average users actually probably would support a mandate for the Office of Homeland"}, {"Time_Start": 3569.84, "Time_End": 3573.84, "Text": " Homeland Security to remotely administer computers for security."}, {"Time_Start": 3573.84, "Time_End": 3581.84, "Text": " How do you, how do you address it by users like content?"}, {"Time_Start": 3581.84, "Time_End": 3586.84, "Text": " Yeah, thank you. That's a good example. Users like content."}, {"Time_Start": 3586.84, "Time_End": 3593.84, "Text": " Even non-hackers, non-sophisticated computer users have been bitten at one point by the Napster,"}, {"Time_Start": 3593.84, "Time_End": 3602.84, "Text": " but Napster did a model his job in bringing out, in bringing to the user the promise of getting content for free with the user interface they could use."}, {"Time_Start": 3602.84, "Time_End": 3609.84, "Text": " And having thus become addicted, I believe one can perhaps educate them that the supply is about to be cut off."}, {"Time_Start": 3609.84, "Time_End": 3611.84, "Text": " All right, thanks for your time."}, {"Time_Start": 3611.84, "Time_End": 3613.84, "Text": " I don't want to take too much time with the next speaker."}, {"Time_Start": 3616.84, "Time_End": 3618.84, "Text": " Thank you."}]}