{"segments": [{"Time_Start": 0.0, "Time_End": 26.0, "Text": " This is not about text files.com at all, so sorry, this is actually about a second site that I put up for fun, which resulted in a lawsuit against me."}, {"Time_Start": 26.0, "Time_End": 35.56, "Text": " And this is mostly a discussion, a narrative, a story about my personal experience about it, possibly with the idea of you guys getting some, I don't know, some advice."}, {"Time_Start": 35.9, "Time_End": 38.120000000000005, "Text": " I do want to know, who here has been sued?"}, {"Time_Start": 41.68, "Time_End": 44.900000000000006, "Text": " Have you guys sued by a corporation or an individual?"}, {"Time_Start": 47.08, "Time_End": 47.36, "Text": " Corporation."}, {"Time_Start": 48.06, "Time_End": 48.64, "Text": " And you're in both?"}, {"Time_Start": 49.6, "Time_End": 50.72, "Text": " Traffic problem, huh?"}, {"Time_Start": 52.08, "Time_End": 52.480000000000004, "Text": " Okay."}, {"Time_Start": 52.84, "Time_End": 55.980000000000004, "Text": " Well, anyway, so I do want to actually forward this with, since it's being recruited."}, {"Time_Start": 56.0, "Time_End": 61.62, "Text": " recorded with a disclaimer. I am not a lawyer. I once dated a legal secretary."}, {"Time_Start": 62.76, "Time_End": 84.7, "Text": " The relationship didn't work out. So what you're hearing may or may not be real or not. I may have forgotten events. It was a very traumatic experience, so I may be, you know, kind of glossing things over. And I don't want anyone to think that this is an exact photographic documentary of what happened."}, {"Time_Start": 84.7, "Time_End": 91.66, "Text": " The site that this is about is still up and will eventually have all of the really funny legal stuff that happened with it."}, {"Time_Start": 92.60000000000001, "Time_End": 98.82000000000001, "Text": " So, the site that I ran was called harvardnet sucks.com."}, {"Time_Start": 101.2, "Time_End": 114.60000000000001, "Text": " This, about a couple years ago, I was looking for a job while still having one, and I saw this place called HarvardNet, a headhunter found for me and said, hey, you know, good,"}, {"Time_Start": 114.7, "Time_End": 144.22, "Text": " company, good people. Looks like it's going to go IPO. You might be able to make some bucks, you know, exciting and everything else. So I said that's great, got interviewed, got a job, Unix guy, and I went to go work there. And I was there for about a year. Ended up going back to my old place. During that year, it was just like any other place. It had its triumphs. It had its sadness. There was a guy I hated because he did this wrong. And there was this person who impressed me who had been there forever."}, {"Time_Start": 144.70000000000002, "Time_End": 146.9, "Text": " you know, the usual ups and downs of a company."}, {"Time_Start": 147.02, "Time_End": 151.28000000000003, "Text": " This wasn't some little, you know, short one-week thing that I was there."}, {"Time_Start": 151.3, "Time_End": 155.20000000000002, "Text": " I was there for a year and I made friends and I made enemies and it was a generally good life."}, {"Time_Start": 156.20000000000002, "Time_End": 161.86, "Text": " Towards the end, things didn't, uh, things stopped being very enjoyable."}, {"Time_Start": 162.58, "Time_End": 167.44000000000003, "Text": " So after a while, you start to get that great bunker mentality where it's just, yep,"}, {"Time_Start": 167.88000000000002, "Time_End": 171.94000000000003, "Text": " our company is doing it, so it must really be bad."}, {"Time_Start": 171.94000000000003, "Time_End": 174.68, "Text": " You know, and after a while, you've built up this negative thing."}, {"Time_Start": 174.70000000000002, "Time_End": 179.9, "Text": " And you've got to say to yourself, am I here just because I'm being paid or do I want to go look somewhere else?"}, {"Time_Start": 179.94000000000003, "Time_End": 183.76000000000002, "Text": " Because I'm not going to do anything by anybody. So I finally said that I was leaving."}, {"Time_Start": 185.36, "Time_End": 190.58, "Text": " And, you know, there were tears all around and sadness and everyone else, and it was horrible."}, {"Time_Start": 191.48000000000002, "Time_End": 198.86, "Text": " And so I left under a less than bright cloud. I actually left."}, {"Time_Start": 200.32000000000002, "Time_End": 203.54000000000002, "Text": " Are you just coming up to touch me? Oh, you want your hat back?"}, {"Time_Start": 204.70000000000002, "Time_End": 209.02, "Text": " I left under a less than beautiful white cloud."}, {"Time_Start": 209.56000000000003, "Time_End": 213.22000000000003, "Text": " Basically, one of the reasons I left was because there was a guy I hated."}, {"Time_Start": 214.18, "Time_End": 216.18, "Text": " And I forwarded a letter."}, {"Time_Start": 216.28000000000003, "Time_End": 219.76000000000002, "Text": " This actually does have some relevance to the legal case."}, {"Time_Start": 220.70000000000002, "Time_End": 233.46, "Text": " Basically, I was asked to impart information to his team and the letter included in the letter his letter to my manager,"}, {"Time_Start": 233.96, "Time_End": 234.68, "Text": " which, in which, in which, in which, in which, in which."}, {"Time_Start": 234.70000000000002, "Time_End": 240.58, "Text": " Which he claimed that I had done nothing, that I was a complete incompetent, that I, you know, in other words, the letter I shouldn't have seen."}, {"Time_Start": 240.66000000000003, "Time_End": 241.68, "Text": " I would have done the thing."}, {"Time_Start": 242.12, "Time_End": 246.76000000000002, "Text": " So I started to write a letter back to my manager in which I said, you know, that's just not true."}, {"Time_Start": 246.92000000000002, "Time_End": 249.56, "Text": " I've been doing my best."}, {"Time_Start": 249.76000000000002, "Time_End": 255.48000000000002, "Text": " And, you know, when the company, when I think of the company, I get so angry because we could have done this, and we could."}, {"Time_Start": 255.48000000000002, "Time_End": 258.36, "Text": " And so I'm basically doing the beginning of Jerry McGuire."}, {"Time_Start": 258.48, "Time_End": 261.52000000000004, "Text": " I've got this whole thing where I'm just writing this paragraph after paragraph."}, {"Time_Start": 261.64000000000004, "Time_End": 264.58000000000004, "Text": " And I'm like, you know, this isn't good enough for my manager."}, {"Time_Start": 264.7, "Time_End": 266.9, "Text": " The whole company needs to share this experience."}, {"Time_Start": 270.46, "Time_End": 276.26, "Text": " So I fire that bastard off, and I did this at home."}, {"Time_Start": 276.34, "Time_End": 278.52, "Text": " I was working at that time, it was the last week."}, {"Time_Start": 278.64, "Time_End": 281.98, "Text": " I was, last two weeks I was working there, and so I was kind of coming at 11 and leaving at 1."}, {"Time_Start": 282.59999999999997, "Time_End": 287.2, "Text": " And I, so, you know, it was like 1 o'clock in the afternoon, and I was like, you know,"}, {"Time_Start": 287.2, "Time_End": 294.68, "Text": " I had to go in and clean out my desk now, because I don't, if, you know, I can't have."}, {"Time_Start": 294.7, "Time_End": 297.88, "Text": " imagine they'd be so unhappy as to get rid of me because of a letter."}, {"Time_Start": 298.4, "Time_End": 303.82, "Text": " But I, you know, I don't want a situation where I go, I'm so sorry, you know, even with all your crap, hung around."}, {"Time_Start": 303.92, "Time_End": 305.56, "Text": " You know, horrible way to go."}, {"Time_Start": 305.84, "Time_End": 307.76, "Text": " So I went in and quietly cleaned out my desk that night."}, {"Time_Start": 308.15999999999997, "Time_End": 310.58, "Text": " Came in the next day, smiling at noon."}, {"Time_Start": 310.96, "Time_End": 313.26, "Text": " And, you know, smiling, everything else."}, {"Time_Start": 313.32, "Time_End": 318.58, "Text": " And, you know, my manager, flunky guy comes and like, oh, we got to talk with you man."}, {"Time_Start": 318.64, "Time_End": 319.52, "Text": " And he's like, it's about the letter."}, {"Time_Start": 319.56, "Time_End": 320.44, "Text": " I'm like, isn't it a great letter?"}, {"Time_Start": 320.62, "Time_End": 321.68, "Text": " It was a great letter, wasn't it?"}, {"Time_Start": 322.15999999999997, "Time_End": 323.8, "Text": " I was sure I was going to get in trouble for it."}, {"Time_Start": 323.8, "Time_End": 324.68, "Text": " And he's like, well, you're going to talk with you."}, {"Time_Start": 324.7, "Time_End": 330.92, "Text": " kind of did. We're not going to fire you. We're just going to ask you not to show up for your"}, {"Time_Start": 330.92, "Time_End": 339.08, "Text": " last week. So I said, okay. You know, they're getting paid for it. Called up my other company,"}, {"Time_Start": 339.08, "Time_End": 345.41999999999996, "Text": " said, I can start early. So I was getting two paychecks. And they actually said, you know, hey, you, you"}, {"Time_Start": 345.41999999999996, "Time_End": 351.0, "Text": " you, we'll pay you, you don't have to come in yet, but we'll officially start you now. So I was getting"}, {"Time_Start": 351.0, "Time_End": 354.58, "Text": " two paychecks while sitting at home. So that definitely took the edge off the experience."}, {"Time_Start": 354.7, "Time_End": 358.12, "Text": " And, you know, I got to do the high fives on the way out and all the things anyway."}, {"Time_Start": 358.28, "Time_End": 363.21999999999997, "Text": " So that was that. And I left that. And I was like, well, that wasn't a very, that wasn't great."}, {"Time_Start": 363.34, "Time_End": 367.94, "Text": " That wasn't a great experience. My feelings on it were actually somewhat neutral. I had some anger,"}, {"Time_Start": 368.02, "Time_End": 375.65999999999997, "Text": " but I wasn't really crushed, as you might say. So I'd hang out with the old operator, the old operation staff and the old engineering staff."}, {"Time_Start": 375.74, "Time_End": 379.38, "Text": " And one by one, they were leaving, and they were, oh, man, place sucks, place sucks."}, {"Time_Start": 379.91999999999996, "Time_End": 384.46, "Text": " And the guy who I didn't like, I did some research into, um,"}, {"Time_Start": 384.7, "Time_End": 390.7, "Text": " group of us actually did a research into hiring one of those planes that has the banner that it drags behind it."}, {"Time_Start": 393.46, "Time_End": 402.34, "Text": " So that one lunch hour, it would just say, Andrea sucks on this banner going over the company."}, {"Time_Start": 403.0, "Time_End": 406.91999999999996, "Text": " And then just make a few key phone calls in various departments say, look out your window."}, {"Time_Start": 408.02, "Time_End": 414.64, "Text": " We didn't go with that. And we all laughed about it. It's $1,500, and I can tell you the guy who does it. And he is a great guy. He's like the one guy who does it. He's like the one guy who"}, {"Time_Start": 414.7, "Time_End": 420.7, "Text": " those. And he said to me, why don't you find out where he lives so we can fly over his house after we're finished with his work?"}, {"Time_Start": 420.7, "Time_End": 426.7, "Text": " So I think he would definitely be open to anything that you guys might want to suggest."}, {"Time_Start": 426.7, "Time_End": 430.7, "Text": " He's like, you know, I was like, do you have a problem with sucks flying over Boston?"}, {"Time_Start": 430.7, "Time_End": 433.7, "Text": " And he was like, we're the guys who flew condoms over Long Island."}, {"Time_Start": 433.7, "Time_End": 441.7, "Text": " Anyway, so, so this group of friends of mine and I were all, you know, kind of bitter having a little melon list and yada, yada, yada."}, {"Time_Start": 441.7, "Time_End": 443.7, "Text": " And I was like, I'm kind of a domain."}, {"Time_Start": 443.7, "Time_End": 453.62, "Text": " I'm kind of a domain pig. I kind of like to buy domains just for fun. I had an inappropriately dressed.com for a while and hall of mirrors.org."}, {"Time_Start": 453.7, "Time_End": 461.14, "Text": " It's open. Let's register. What the hell? Let's have fun. And I checked and Harvardnet sucks.com was open."}, {"Time_Start": 461.14, "Time_End": 472.15999999999997, "Text": " And to give you an idea of how completely non-anything I was with this, I didn't even buy it then. I kind of said, hey, guys, it's open. Wouldn't it be funny? Didn't do anything with it."}, {"Time_Start": 472.16, "Time_End": 475.78000000000003, "Text": " A couple weeks later, people were like, you know, it'd be kind of funny if you got it."}, {"Time_Start": 475.78000000000003, "Time_End": 480.0, "Text": " And I'd go like, yeah, if you all put money in for it, I'll host it, I'll give you mail forwarding."}, {"Time_Start": 480.04, "Time_End": 481.92, "Text": " You can be the CEO at Harvard NetSucks."}, {"Time_Start": 483.78000000000003, "Time_End": 488.0, "Text": " And so they each did that. They each gave me like $10 or something."}, {"Time_Start": 488.12, "Time_End": 493.76000000000005, "Text": " And I went off and registered Harvard NetSack, set up a mail forwarder. Ooh, I'm a, I'm a, I'm a protester."}, {"Time_Start": 495.44000000000005, "Time_End": 499.24, "Text": " I kind of left it like that for a while, you know, about a month. I was like, well, that was fun."}, {"Time_Start": 499.24, "Time_End": 503.66, "Text": " And I thought, you know, I'd hear things going out at the company."}, {"Time_Start": 503.76, "Time_End": 508.66, "Text": " I'd be like, that kind of sucks there still, and they're still doing this, and wouldn't it be kind of fun to put up a site?"}, {"Time_Start": 509.6, "Time_End": 513.52, "Text": " I had already registered Harvard NetSucks under the company's own address and name."}, {"Time_Start": 514.8, "Time_End": 519.88, "Text": " So there was already some sort of a, you know, you have this initial defense thing."}, {"Time_Start": 519.92, "Time_End": 528.78, "Text": " I do want to mention that to people, you know, when you make an action like that, when you do things like you register with something or you do something, I mean, this sounds blatantly obvious,"}, {"Time_Start": 528.78, "Time_End": 533.88, "Text": " but you would be surprised about if you're going to register a domain that makes horrendous fun of someone,"}, {"Time_Start": 534.0, "Time_End": 535.72, "Text": " don't give them your home name and address."}, {"Time_Start": 537.02, "Time_End": 537.78, "Text": " Don't do that."}, {"Time_Start": 538.66, "Time_End": 540.8399999999999, "Text": " So I had it under their name."}, {"Time_Start": 541.1, "Time_End": 544.8399999999999, "Text": " The billing department was incorrect billing at their place,"}, {"Time_Start": 544.9399999999999, "Time_End": 547.38, "Text": " and it was a little protest all there."}, {"Time_Start": 547.68, "Time_End": 551.04, "Text": " I also registered not with Network Solutions."}, {"Time_Start": 551.16, "Time_End": 556.06, "Text": " I registered with Easy DNS up in Toronto, and I'll explain why I like them so much."}, {"Time_Start": 556.4, "Time_End": 558.22, "Text": " They're a very fun little place up there."}, {"Time_Start": 558.22, "Time_End": 566.1, "Text": " They're related with two cows, and they let you administer your DNS remotely, and they run it, and they have their own anyway, if you like that kind of thing."}, {"Time_Start": 566.5, "Time_End": 577.0, "Text": " So I registered with this, and then I put up a site, and it was kind of a, I, everything I did on it was in the Wii form."}, {"Time_Start": 577.24, "Time_End": 587.86, "Text": " You know, we here at Harvard NetSucks or our staff, or, you know, in other words, you're using that classic terrorist or guerrilla technique where you're a guy named we who, who,"}, {"Time_Start": 588.22, "Time_End": 590.7, "Text": " We believe this shall be done."}, {"Time_Start": 590.9, "Time_End": 592.12, "Text": " Our spies are everywhere."}, {"Time_Start": 592.64, "Time_End": 601.78, "Text": " Now, technically, I did have spies everywhere because, you know, people would call, but they, the site was a little harsh, unpleasant."}, {"Time_Start": 603.5400000000001, "Time_End": 607.44, "Text": " You'll see me refer to my notes occasionally because I just want to make sure I'm mentioning everything."}, {"Time_Start": 608.08, "Time_End": 615.58, "Text": " I kind of made fun of, I kind of made fun of the people who had been problems,"}, {"Time_Start": 615.58, "Time_End": 618.2, "Text": " and I hinted that there were things were not going to."}, {"Time_Start": 618.22, "Time_End": 624.22, "Text": " quite right there, and I got a really nice coup at the second day."}, {"Time_Start": 624.22, "Time_End": 631.22, "Text": " I got a letter from the founder of Harvard Net who had been driven out a number of years earlier,"}, {"Time_Start": 631.22, "Time_End": 637.22, "Text": " in which he apologized to everyone currently at Harvard Net at how much the company now sucked."}, {"Time_Start": 640.22, "Time_End": 643.22, "Text": " I think that's what initially got their attention."}, {"Time_Start": 643.22, "Time_End": 647.22, "Text": " Because remember, this was a pre-IPO company, so, you know, very unpleasant."}, {"Time_Start": 647.22, "Time_End": 654.22, "Text": " And I got the other founder of Harvard Net, who mailed in next day going, hey, he mailed in."}, {"Time_Start": 654.22, "Time_End": 655.22, "Text": " Yeah, I too agree."}, {"Time_Start": 655.22, "Time_End": 657.22, "Text": " It really bites there."}, {"Time_Start": 657.22, "Time_End": 661.22, "Text": " If I could, I would just wipe out who's there and just, you know, put in a totally new team."}, {"Time_Start": 661.22, "Time_End": 662.22, "Text": " We'd get it right."}, {"Time_Start": 662.22, "Time_End": 664.22, "Text": " I'm sorry and everything else."}, {"Time_Start": 664.22, "Time_End": 667.22, "Text": " I was getting an awful lot of hits from HarvardNet."}, {"Time_Start": 667.22, "Time_End": 672.22, "Text": " You know, I run logs and Webelizer, you know of Webelizer, right?"}, {"Time_Start": 672.22, "Time_End": 674.22, "Text": " Everyone here, by the way, and this is vital."}, {"Time_Start": 674.22, "Time_End": 676.22, "Text": " Does everyone here know what a firewall is?"}, {"Time_Start": 676.22, "Time_End": 678.22, "Text": " is?"}, {"Time_Start": 678.22, "Time_End": 680.22, "Text": " Okay, good."}, {"Time_Start": 680.22, "Time_End": 682.22, "Text": " I don't want to lose you."}, {"Time_Start": 682.22, "Time_End": 687.22, "Text": " I got a lot of hits from some site."}, {"Time_Start": 687.22, "Time_End": 692.22, "Text": " And I want to be a bastard and say the name again, but I forgot it."}, {"Time_Start": 692.22, "Time_End": 696.22, "Text": " But it was something, you know, wallkeeper, blah, something."}, {"Time_Start": 696.22, "Time_End": 697.22, "Text": " .harvard."}, {"Time_Start": 697.22, "Time_End": 700.22, "Text": " Hundreds of hits from that, nothing else at HarvardNet."}, {"Time_Start": 700.22, "Time_End": 705.22, "Text": " On Tuesday, no, sorry, Wednesday, I get a call from someone who's like,"}, {"Time_Start": 705.22, "Time_End": 706.22, "Text": " hey, man, your site."}, {"Time_Start": 706.22, "Time_End": 709.22, "Text": " went down, someone browsing from within."}, {"Time_Start": 709.22, "Time_End": 711.22, "Text": " And my site's not down."}, {"Time_Start": 711.22, "Time_End": 714.22, "Text": " And the hits from this machine have stopped."}, {"Time_Start": 714.22, "Time_End": 716.22, "Text": " And I'm like, oh."}, {"Time_Start": 716.22, "Time_End": 718.22, "Text": " So I put up a little thing,"}, {"Time_Start": 718.22, "Time_End": 720.22, "Text": " it looks like they're blocking me at their firewall."}, {"Time_Start": 720.22, "Time_End": 722.22, "Text": " What are you afraid of?"}, {"Time_Start": 722.22, "Time_End": 724.22, "Text": " By Thursday, I'm pretty damn cocky."}, {"Time_Start": 724.22, "Time_End": 728.22, "Text": " I'm getting, I'd also taken out HarvardNetSucks at hotmail.com"}, {"Time_Start": 728.22, "Time_End": 732.22, "Text": " for the email, another blind."}, {"Time_Start": 732.22, "Time_End": 734.22, "Text": " So I was getting quite a bit of hate."}, {"Time_Start": 734.22, "Time_End": 735.22, "Text": " Not at me, of course."}, {"Time_Start": 735.22, "Time_End": 739.38, "Text": " course. But a lot of hate at people, you know, like, you're right. I'm glad someone"}, {"Time_Start": 739.38, "Time_End": 743.22, "Text": " stood up and spoke for us. Because, you know, in every company like this, people come and go,"}, {"Time_Start": 743.22, "Time_End": 748.34, "Text": " and they just take their little pain and move on. And that's the end of it. And now these people are"}, {"Time_Start": 748.34, "Time_End": 756.82, "Text": " like, hey, someone's getting pissed, mob. And the, the, basically they, they were starting to look"}, {"Time_Start": 756.82, "Time_End": 762.98, "Text": " at me as some sort of an interesting figure. Someone, they could go, you, my handle was broken"}, {"Time_Start": 762.98, "Time_End": 765.2, "Text": " promises at HarvardnetSucks."}, {"Time_Start": 765.22, "Time_End": 777.46, "Text": " So my little site, I find out that the CEO is on a rampage, who the hell is this guy?"}, {"Time_Start": 777.46, "Time_End": 783.78, "Text": " Doesn't know who it is. Just going nuts. He's accusing his head of engineering, like, you must be it."}, {"Time_Start": 783.78, "Time_End": 787.6600000000001, "Text": " You're him. You're him. You're him. Who is broke? Could you imagine this? Just a big, fat guy running down."}, {"Time_Start": 787.6600000000001, "Time_End": 792.22, "Text": " Who is broken promises? I will destroy."}, {"Time_Start": 795.22, "Time_End": 800.22, "Text": " like on Friday. So on Friday, I ended up calling him."}, {"Time_Start": 800.22, "Time_End": 807.4, "Text": " Um, we're talking five days. Friday, I call him up. He never answers his phone, you know."}, {"Time_Start": 807.8000000000001, "Time_End": 811.64, "Text": " So I left the message, hey, Mark, next time, pick up your phone."}, {"Time_Start": 812.84, "Time_End": 818.86, "Text": " Um, so as you can see, I was flying high. And he picked up the phone next call. And he was like,"}, {"Time_Start": 819.12, "Time_End": 823.32, "Text": " Jason, you have to speak to my lawyer. Click. I was like, me, me."}, {"Time_Start": 825.22, "Time_End": 832.5600000000001, "Text": " Most people, when they're used to the, what they think of now is the current process of the law is, you put up heinous thing that's really bad."}, {"Time_Start": 833.1800000000001, "Time_End": 836.76, "Text": " Company that you did this to sends a thing that says, please stop it, we're really angry."}, {"Time_Start": 837.2, "Time_End": 841.0600000000001, "Text": " You either choose to put up the letter and go, fuck them, or you take it down."}, {"Time_Start": 841.6, "Time_End": 842.52, "Text": " Running like a little baby."}, {"Time_Start": 844.36, "Time_End": 846.28, "Text": " But that's not how it was."}, {"Time_Start": 846.64, "Time_End": 850.24, "Text": " I was invited to a nice party of some of the ex-arvernet employees."}, {"Time_Start": 850.34, "Time_End": 851.98, "Text": " I'm already making connections."}, {"Time_Start": 852.08, "Time_End": 853.24, "Text": " I'm making friends now."}, {"Time_Start": 853.24, "Time_End": 858.52, "Text": " So that next Tuesday, hey, come on down. We'll have some food. It'll be great. You'll love it."}, {"Time_Start": 859.1800000000001, "Time_End": 860.04, "Text": " So I'm there."}, {"Time_Start": 861.4, "Time_End": 867.82, "Text": " While I'm there, I get a call from my, my girlfriend, who is not in the best emotional shape,"}, {"Time_Start": 868.02, "Time_End": 876.88, "Text": " letting me know that a man has come to the house with a pack of papers from a law firm and made her sign it and gone away."}, {"Time_Start": 877.62, "Time_End": 883.22, "Text": " And by the way, the guys who's, there are guys whose job is to deliver that stuff who aren't really"}, {"Time_Start": 883.24, "Time_End": 889.54, "Text": " affiliated with anything. They're just like guys willing to get screamed at in the face"}, {"Time_Start": 889.54, "Time_End": 897.52, "Text": " for however many bucks. But they are neither aware of your case, cognizant of you or anything else."}, {"Time_Start": 897.82, "Time_End": 902.3, "Text": " They don't even care. I mean, you know, I'm the guy mentioned on it. The girlfriend signed for it."}, {"Time_Start": 902.5, "Time_End": 909.38, "Text": " Good enough for Bobo. He was gone. And we're at the thing, we're at the party. You know, she's not"}, {"Time_Start": 909.38, "Time_End": 913.22, "Text": " going to open it. She wants me to read it. And we're all like, ha, ha, season to sis. Got the fuckers run."}, {"Time_Start": 913.24, "Time_End": 919.6800000000001, "Text": " So I get home and that's not exactly the case. That's not exactly the case. The exact"}, {"Time_Start": 919.6800000000001, "Time_End": 926.58, "Text": " letter that was waiting for me, you are hereby summoned to require to serve a plaintiffant's"}, {"Time_Start": 926.58, "Time_End": 931.38, "Text": " attorney in answer to a complaint which is herewith served upon you between 20 days."}, {"Time_Start": 931.38, "Time_End": 936.96, "Text": " If you failed to do so, judgment by default will be taken against you. And I'm looking at it like,"}, {"Time_Start": 936.96, "Time_End": 942.52, "Text": " that doesn't sound like a cease and desist letter. We also notify you that application has been"}, {"Time_Start": 942.52, "Time_End": 946.86, "Text": " made in said action, as appears in complaint, for a preliminary injunction. They got what's called"}, {"Time_Start": 946.86, "Time_End": 953.4399999999999, "Text": " an ex parte restraining order against me. In the meantime, until such hearing, we command you,"}, {"Time_Start": 953.54, "Time_End": 958.26, "Text": " said Jason Scott, and your agent's attorneys and counselors, and each and every one of them,"}, {"Time_Start": 958.62, "Time_End": 963.52, "Text": " to deceasease and refrain from using or making any further disclosures of any Harvard net proprietary"}, {"Time_Start": 963.52, "Time_End": 972.28, "Text": " information in a form substantially similar to the order attached as Exhibit 1. Now, the Exhibit 1,"}, {"Time_Start": 972.52, "Time_End": 975.76, "Text": " was an actual court-ordered restraining order."}, {"Time_Start": 977.18, "Time_End": 981.66, "Text": " It's what's called an ex parte restraining order, which I did not understand at the time."}, {"Time_Start": 982.02, "Time_End": 982.98, "Text": " I'll jump out of sequence."}, {"Time_Start": 983.3, "Time_End": 984.86, "Text": " My lawyer explained to me what this is."}, {"Time_Start": 985.28, "Time_End": 988.54, "Text": " Basically, usually what happens is guy beats the shit out of his wife."}, {"Time_Start": 989.48, "Time_End": 994.3, "Text": " Then his wife says, I would not like him to be near me anymore, for he beats the shit out of me."}, {"Time_Start": 995.66, "Time_End": 1001.24, "Text": " She goes to the court with her lawyer who says, we would like the court to ask this man not to beat the shit out of her."}, {"Time_Start": 1002.52, "Time_End": 1005.6999999999999, "Text": " The man says, what does he have to say about this?"}, {"Time_Start": 1005.84, "Time_End": 1007.26, "Text": " Let's bring him in and have a chat."}, {"Time_Start": 1007.9, "Time_End": 1011.5799999999999, "Text": " So he sends a notice to wife-beater and says,"}, {"Time_Start": 1011.6999999999999, "Time_End": 1016.04, "Text": " please come to the courthouse in a week where we will see if you should have a restraining order."}, {"Time_Start": 1016.4399999999999, "Time_End": 1024.1399999999999, "Text": " But knowing you, you are at the bar drinking Yeagermeister and you will not show up and it will be given to you in your absence."}, {"Time_Start": 1024.58, "Time_End": 1026.28, "Text": " That's usually how restraining orders work."}, {"Time_Start": 1026.3799999999999, "Time_End": 1030.06, "Text": " There's a notification to the two parties are like, we'd like to do a restraining order party."}, {"Time_Start": 1030.06, "Time_End": 1030.94, "Text": " Come on down."}, {"Time_Start": 1031.34, "Time_End": 1032.5, "Text": " And they go down and they are."}, {"Time_Start": 1032.52, "Time_End": 1036.5, "Text": " or one of them just says, bite me, have your fun with your lawyers, and it's given."}, {"Time_Start": 1037.12, "Time_End": 1040.94, "Text": " The next party restraining order is the guy beats up the girl really well."}, {"Time_Start": 1041.9, "Time_End": 1045.3, "Text": " And she shows up in such a horrifying state that her lawyer says,"}, {"Time_Start": 1045.54, "Time_End": 1051.12, "Text": " we can't wait the week for her to sit around, waiting for, you know,"}, {"Time_Start": 1051.72, "Time_End": 1054.68, "Text": " Jaws 3 to come back from wherever the hell he is and kill her."}, {"Time_Start": 1054.98, "Time_End": 1061.12, "Text": " So they say, fine, the restraining order is now down now, and in a week he gets to fight it."}, {"Time_Start": 1061.1200000000001, "Time_End": 1063.2600000000002, "Text": " very special case."}, {"Time_Start": 1063.48, "Time_End": 1064.96, "Text": " They got it for me."}, {"Time_Start": 1065.68, "Time_End": 1066.44, "Text": " For what?"}, {"Time_Start": 1066.7, "Time_End": 1067.5200000000002, "Text": " That's the question."}, {"Time_Start": 1067.94, "Time_End": 1070.64, "Text": " Of all the horrifying things I had said that week,"}, {"Time_Start": 1071.2800000000002, "Time_End": 1073.3200000000002, "Text": " what thing was it that it was so horrible?"}, {"Time_Start": 1073.3400000000001, "Time_End": 1074.1000000000001, "Text": " What had I done?"}, {"Time_Start": 1074.16, "Time_End": 1075.1000000000001, "Text": " What were they going to sue me for?"}, {"Time_Start": 1075.16, "Time_End": 1075.66, "Text": " How much?"}, {"Time_Start": 1076.0600000000002, "Time_End": 1079.68, "Text": " And when I started to read through the actual lawsuit,"}, {"Time_Start": 1080.1200000000001, "Time_End": 1082.2600000000002, "Text": " I started to, you know, the actual thing,"}, {"Time_Start": 1082.3000000000002, "Time_End": 1084.22, "Text": " which I started to read and sweat a little more and more."}, {"Time_Start": 1084.5000000000002, "Time_End": 1087.22, "Text": " They were suing me for $120,000."}, {"Time_Start": 1088.9, "Time_End": 1090.5800000000002, "Text": " They were suing me for"}, {"Time_Start": 1090.58, "Time_End": 1098.28, "Text": " violating my employee non-disclosure agreement and printing information of a proprietary nature"}, {"Time_Start": 1098.28, "Time_End": 1109.08, "Text": " such that could bring down Harvard Net's network, expose their company secrets, trade information,"}, {"Time_Start": 1109.46, "Time_End": 1115.02, "Text": " financial information to the Internet at large, make them a guided target for hackers,"}, {"Time_Start": 1115.4399999999998, "Time_End": 1118.6399999999999, "Text": " in quotes, and generally destroy them."}, {"Time_Start": 1119.34, "Time_End": 1120.56, "Text": " It took quite a while to figure out."}, {"Time_Start": 1120.58, "Time_End": 1122.0, "Text": " what the fuck they were talking about."}, {"Time_Start": 1122.86, "Time_End": 1124.58, "Text": " I'm a newsletter, for God's sake."}, {"Time_Start": 1125.24, "Time_End": 1129.02, "Text": " Well, it turned out I had published the firewall name."}, {"Time_Start": 1130.02, "Time_End": 1133.58, "Text": " And their indication was, by printing the firewall name,"}, {"Time_Start": 1134.28, "Time_End": 1137.22, "Text": " I had breached the security of HarvardNet"}, {"Time_Start": 1137.22, "Time_End": 1140.58, "Text": " and revealed to everyone how to get in."}, {"Time_Start": 1142.58, "Time_End": 1145.1799999999998, "Text": " Now, you sit there and you trottle with your little fucking giggles."}, {"Time_Start": 1147.98, "Time_End": 1149.1799999999998, "Text": " Dude, doesn't you understand?"}, {"Time_Start": 1149.62, "Time_End": 1150.54, "Text": " It's a firewall."}, {"Time_Start": 1150.58, "Time_End": 1152.4399999999998, "Text": " No, he does not understand."}, {"Time_Start": 1152.8, "Time_End": 1153.98, "Text": " He doesn't understand at all."}, {"Time_Start": 1154.06, "Time_End": 1155.76, "Text": " He's near retirement, in my case."}, {"Time_Start": 1156.1599999999999, "Time_End": 1158.6, "Text": " He doesn't give a shit about this computer crap."}, {"Time_Start": 1159.12, "Time_End": 1161.98, "Text": " He's got a nephew probably tells him that computers are fun."}, {"Time_Start": 1162.58, "Time_End": 1166.6399999999999, "Text": " The initial response is,"}, {"Time_Start": 1166.76, "Time_End": 1168.9399999999998, "Text": " I can beat this wrap in no time."}, {"Time_Start": 1169.6, "Time_End": 1173.78, "Text": " The hard part is, how do you tell a 64-year-old judge"}, {"Time_Start": 1173.78, "Time_End": 1177.8, "Text": " that a firewall host name is perfectly okay to know about"}, {"Time_Start": 1177.8, "Time_End": 1179.52, "Text": " because it's not going to breach the security?"}, {"Time_Start": 1180.02, "Time_End": 1180.1599999999999, "Text": " And then you've got to tell a 64-year-old judge."}, {"Time_Start": 1180.58, "Time_End": 1187.58, "Text": " into what network maps? Here's my problem. So now I'm in a panic. I'm in an absolute"}, {"Time_Start": 1187.58, "Time_End": 1193.3799999999999, "Text": " panic. I don't have a lawyer. That was probably the roughest night I've had in recent memory"}, {"Time_Start": 1193.3799999999999, "Time_End": 1202.58, "Text": " that didn't include kidney stones. I was just wrecked. I mean, you know, $120,000 was way more"}, {"Time_Start": 1202.58, "Time_End": 1206.5, "Text": " than they had paid me even in a year. The number, by the way, in case you're wondering where"}, {"Time_Start": 1206.5, "Time_End": 1210.4199999999998, "Text": " is the $120,000. It cost them $60,000 to set up the firewall."}, {"Time_Start": 1210.58, "Time_End": 1214.26, "Text": " and purchased the software and the hardware, and they were doubling it."}, {"Time_Start": 1214.26, "Time_End": 1218.74, "Text": " The theory being that by publishing the host name, the, you know, I don't know, the firewall turned"}, {"Time_Start": 1218.74, "Time_End": 1220.58, "Text": " into a Sega Genesis, and that was the end of that."}, {"Time_Start": 1224.26, "Time_End": 1226.58, "Text": " Sonic going, come on in, we're open."}, {"Time_Start": 1228.58, "Time_End": 1232.02, "Text": " So that was, I guess, the theoretical concept."}, {"Time_Start": 1232.02, "Time_End": 1234.34, "Text": " So I had to find a lawyer."}, {"Time_Start": 1234.34, "Time_End": 1240.02, "Text": " Now, I'm going to say something which takes a little bit of the edge off my experience, or you might think so."}, {"Time_Start": 1240.58, "Time_End": 1246.76, "Text": " I had an individual, who I will not name, who mailed me, and said, and this, this is like having"}, {"Time_Start": 1246.76, "Time_End": 1249.8799999999999, "Text": " close to a religious experience as one can have, I suppose."}, {"Time_Start": 1250.3999999999999, "Time_End": 1256.06, "Text": " I hate Harvard Net so much, I will pay all your legal fees until you are exonerated."}, {"Time_Start": 1265.06, "Time_End": 1268.3999999999999, "Text": " Yeah, that was, he's a very pleasant fellow."}, {"Time_Start": 1270.58, "Time_End": 1277.3, "Text": " That took a little bit of the edge off, obviously, so, you know, I could fight this."}, {"Time_Start": 1277.6999999999998, "Time_End": 1282.08, "Text": " Now, most people would go, ah, and, you know, now what do you do?"}, {"Time_Start": 1282.1599999999999, "Time_End": 1285.8799999999999, "Text": " And I don't know, there aren't as many, well, there's a good number of youth here."}, {"Time_Start": 1286.06, "Time_End": 1288.84, "Text": " It's a little bit different when you're young and you're middle-aged and you're old,"}, {"Time_Start": 1288.8999999999999, "Time_End": 1293.02, "Text": " and it all depends on your perspective on things."}, {"Time_Start": 1293.34, "Time_End": 1297.8, "Text": " What a company suing you for, the experience of having a company say,"}, {"Time_Start": 1298.3999999999999, "Time_End": 1300.56, "Text": " we'd like to take a damn good shot at grabbing a..."}, {"Time_Start": 1300.58, "Time_End": 1308.46, "Text": " house out of you. You know, some, when you're young, fuck all. Dad'll cover it."}, {"Time_Start": 1310.86, "Time_End": 1315.8999999999999, "Text": " Dad, I got so much shit. Look what I did. You know, and so on. And the older ones are like,"}, {"Time_Start": 1315.8999999999999, "Time_End": 1321.8, "Text": " I must settle immediately. And, you know, and other people are like, you know, I'm going to eat"}, {"Time_Start": 1321.8, "Time_End": 1330.12, "Text": " a Remington right now. The, the, you know, see, you have different opinions. Mine was, I must fight this."}, {"Time_Start": 1330.58, "Time_End": 1338.72, "Text": " I am right. I'm completely right. So, a week had gone by. The hearing was in a week after that."}, {"Time_Start": 1339.08, "Time_End": 1345.32, "Text": " Now, normally in the hearing, we might go, fine, you're right, whatever. We're not going to fight this."}, {"Time_Start": 1345.6799999999998, "Time_End": 1354.0, "Text": " Not put up the firewall host name information. And, you know, go for the trial. But we didn't want to do that."}, {"Time_Start": 1354.28, "Time_End": 1360.52, "Text": " I was given a lawyer. She's a very nice later. Her name is Lucy Lovery, and I will plug her because she was very"}, {"Time_Start": 1360.58, "Time_End": 1368.4399999999998, "Text": " good for my purposes. And she, you know, she was, she was very communicative. She was friendly."}, {"Time_Start": 1368.6799999999998, "Time_End": 1373.96, "Text": " She thought about the stuff. She wanted to learn. She knew nothing about networks. Period."}, {"Time_Start": 1374.56, "Time_End": 1382.72, "Text": " And initially, you'd think, you know, that's really bad. But actually, it's one thing when you have, like, slick hacker lawyer,"}, {"Time_Start": 1382.72, "Time_End": 1390.5, "Text": " a horrifying mutant I will hope I never meet. The hacker lawyer. We have no valid. We have no"}, {"Time_Start": 1390.58, "Time_End": 1398.58, "Text": " vaccine. The, the, but, you know, you'd have a slick vac. You know, yeah, your judge, look, go on. I mean, look at this. It's a firewall"}, {"Time_Start": 1398.58, "Time_End": 1420.56, "Text": " host name. Who gives this shit? You know, she was like, what is this thing? Tell me what it is. What is it like? What is it for? How does it work? Where are the problems? And I have to sit there and I have to enunciate out my entire defense instead of is going for shorthand, going, you know, whatever. So I met with her and she immediately said, we have to get affidavits. We have to find people who will say that this is not a big deal."}, {"Time_Start": 1420.58, "Time_End": 1423.6799999999998, "Text": " We have to get people to show that you couldn't have known this information."}, {"Time_Start": 1424.1799999999998, "Time_End": 1429.6999999999998, "Text": " We'll show things where you will, you know, you'll say yourself, how innocent you are and everything else."}, {"Time_Start": 1429.74, "Time_End": 1434.96, "Text": " And we will present all these on that day in a week where we will make this happen."}, {"Time_Start": 1435.3799999999999, "Time_End": 1439.6799999999998, "Text": " Now, my lawyers was what, you know, my lawyer was a lawyer."}, {"Time_Start": 1440.3, "Time_End": 1444.82, "Text": " Their lawyer was Hale and Door. Does anyone know Hale and Door?"}, {"Time_Start": 1445.6399999999999, "Time_End": 1447.3799999999999, "Text": " No. One day you will."}, {"Time_Start": 1447.38, "Time_End": 1452.16, "Text": " Hale and door are"}, {"Time_Start": 1452.16, "Time_End": 1455.24, "Text": " No, they're not the McDonald's of law"}, {"Time_Start": 1455.24, "Time_End": 1457.3000000000002, "Text": " because that would probably be that Jacoby and Myers thing."}, {"Time_Start": 1459.96, "Time_End": 1461.42, "Text": " They're not the McDonald's of law."}, {"Time_Start": 1461.5600000000002, "Time_End": 1464.9, "Text": " They're like the old style."}, {"Time_Start": 1465.1200000000001, "Time_End": 1466.8400000000001, "Text": " No, they're the Microsoft of law."}, {"Time_Start": 1466.94, "Time_End": 1467.5600000000002, "Text": " They really are."}, {"Time_Start": 1468.0200000000002, "Time_End": 1469.42, "Text": " I hate that. What a shorthand."}, {"Time_Start": 1469.46, "Time_End": 1469.92, "Text": " But they are."}, {"Time_Start": 1470.2800000000002, "Time_End": 1473.1000000000001, "Text": " They have, they were Nixon's lawyers."}, {"Time_Start": 1475.0200000000002, "Time_End": 1476.14, "Text": " No, no, no, it's okay."}, {"Time_Start": 1476.18, "Time_End": 1477.0200000000002, "Text": " He's erasing everything."}, {"Time_Start": 1477.38, "Time_End": 1478.2800000000002, "Text": " Those guys."}, {"Time_Start": 1479.14, "Time_End": 1481.0600000000002, "Text": " They're fucking huge."}, {"Time_Start": 1481.3400000000001, "Time_End": 1484.14, "Text": " They have hundreds, hundreds of lawyers."}, {"Time_Start": 1484.7, "Time_End": 1485.9, "Text": " They have powerful lawyers."}, {"Time_Start": 1486.3200000000002, "Time_End": 1492.48, "Text": " They are a bunch of rabid fucking wolf bastards who will eat each other alive to get to the top,"}, {"Time_Start": 1492.5400000000002, "Time_End": 1496.2, "Text": " meaning that the person that you are going up against, in my case, they tried to get a top guy,"}, {"Time_Start": 1496.44, "Time_End": 1504.8200000000002, "Text": " is some tarnished, some tarnished, modeled, angry sword of a man who is just going to destroy you."}, {"Time_Start": 1506.2800000000002, "Time_End": 1507.24, "Text": " I love them."}, {"Time_Start": 1507.38, "Time_End": 1510.96, "Text": " I must repeat my disclaimer now."}, {"Time_Start": 1512.5400000000002, "Time_End": 1520.7800000000002, "Text": " Anyway, so, um, so basically, um, the Hale and Door people said several things in their letter."}, {"Time_Start": 1521.0200000000002, "Time_End": 1525.72, "Text": " Now, if I want to, if I'm worried about my heart rate, you know, if I need my exercise backup,"}, {"Time_Start": 1525.72, "Time_End": 1527.8000000000002, "Text": " I just go back and read anything they wrote."}, {"Time_Start": 1529.24, "Time_End": 1537.3600000000001, "Text": " You know, you know, Mr. Scott was privy to every machine name, password, application, network."}, {"Time_Start": 1537.38, "Time_End": 1539.92, "Text": " that I was a Unix guy."}, {"Time_Start": 1541.0200000000002, "Time_End": 1545.8600000000001, "Text": " And their thing indicates that I was the Uber man who ran everything,"}, {"Time_Start": 1546.46, "Time_End": 1552.2800000000002, "Text": " who quietly went away and began his terror campaign to destroy them from within."}, {"Time_Start": 1554.3000000000002, "Time_End": 1558.1200000000001, "Text": " And, you know, this was just simply not the case."}, {"Time_Start": 1558.18, "Time_End": 1562.3400000000001, "Text": " For instance, the host name of the firewall had not been set till a month and a half after I'd left."}, {"Time_Start": 1563.44, "Time_End": 1567.3600000000001, "Text": " Little things like that that just didn't quite work out that we had to put into the affidavit."}, {"Time_Start": 1567.38, "Time_End": 1578.14, "Text": " We got a firewall guy to go, you know, it takes, oh, 20 minutes, let's say an hour to set the new IP address for the firewall."}, {"Time_Start": 1578.14, "Time_End": 1585.5800000000002, "Text": " And it will cost if I charge $300 an hour, so it's not a $60,000 process."}, {"Time_Start": 1586.38, "Time_End": 1588.24, "Text": " You know, and so on, all these things."}, {"Time_Start": 1588.7, "Time_End": 1596.4, "Text": " And my boss, and this is something, my old boss, who was not privy to my being dismissed, by the way,"}, {"Time_Start": 1596.7, "Time_End": 1597.3600000000001, "Text": " the manager."}, {"Time_Start": 1597.38, "Time_End": 1603.8600000000001, "Text": " over my boss dismissed me. He wasn't even in the office that day. He came in to find out he"}, {"Time_Start": 1603.8600000000001, "Time_End": 1611.68, "Text": " was down a guy. That's how connected he felt by the end. He submitted an affidavit. Now he is"}, {"Time_Start": 1611.68, "Time_End": 1618.4, "Text": " working for the company, and he submitted an affidavit going, the company is lying to you."}, {"Time_Start": 1622.2800000000002, "Time_End": 1626.2600000000002, "Text": " The company is not telling the truth. They are attempting to screw him. It is not telling the truth. They are attempting to screw him."}, {"Time_Start": 1627.38, "Time_End": 1657.3600000000001, "Text": " true. He wasn't really feeling all that secure anyway. But the thing about that little action, though, was the next day, well, okay, let's say, at the hearing, when the hearing finally showed up, I didn't actually testify. When you're at a hearing like this, your lawyer generally does all the talking for you. I didn't even sit inside that stupid little fence. I actually sat out in the audience. The little sad look at my face and a big suit and just, oh, they made me wear a suit. And you, you, you, you, you, you,"}, {"Time_Start": 1657.38, "Time_End": 1666.74, "Text": " you had this guy, Daniel W. Hulston, the Esquire, who was their guy with his little"}, {"Time_Start": 1666.74, "Time_End": 1681.0800000000002, "Text": " toadie, Jeffrey, who, because, you know, one of the things they do is they have, they have Primo lawyer and they have, you know, lawyer, you know, the little dog in Hack, basically, who kind of follows him and could be there, if there's a problem."}, {"Time_Start": 1682.0600000000002, "Time_End": 1687.3600000000001, "Text": " It costs them. I think we were, we estimate it cost them $45,000."}, {"Time_Start": 1687.38, "Time_End": 1693.88, "Text": " $1,000 to have these two guys in the courtroom for four hours, including waiting time, and set things up."}, {"Time_Start": 1694.6200000000001, "Time_End": 1699.4, "Text": " An enormous amount of money on their case to do this, to get me."}, {"Time_Start": 1701.92, "Time_End": 1706.7600000000002, "Text": " Things came out. My ISP called me, and hey, I heard you're having some legal trouble."}, {"Time_Start": 1707.5600000000002, "Time_End": 1713.7800000000002, "Text": " Turned out they had called him the day before they filed the lawsuit to tell him to shut my machine off."}, {"Time_Start": 1713.78, "Time_End": 1721.5, "Text": " trading in on the fact the CEO had worked with the guy, had been an old business partner with him,"}, {"Time_Start": 1721.78, "Time_End": 1727.28, "Text": " and said, hey, my old buddy, look, can you just kind of shut this machine off that's in your machine room?"}, {"Time_Start": 1727.86, "Time_End": 1730.72, "Text": " Which, by the way, is unbelievably illegal in Massachusetts."}, {"Time_Start": 1731.18, "Time_End": 1733.82, "Text": " It's called, like, restriction of someone's trade or something."}, {"Time_Start": 1733.94, "Time_End": 1738.22, "Text": " It's actually a, you know, if you're in a case like this, like, have your lawyer look, everything that they did,"}, {"Time_Start": 1738.3999999999999, "Time_End": 1739.8999999999999, "Text": " because it just came out of nowhere."}, {"Time_Start": 1739.98, "Time_End": 1741.12, "Text": " That was going to be one of our things."}, {"Time_Start": 1741.96, "Time_End": 1743.76, "Text": " Well, the guy remembered that, hey, he'd"}, {"Time_Start": 1743.78, "Time_End": 1747.78, "Text": " business with this guy, he didn't remember he'd really fucked him over."}, {"Time_Start": 1749.78, "Time_End": 1750.78, "Text": " He'd forgotten."}, {"Time_Start": 1750.78, "Time_End": 1752.78, "Text": " Oh, my old buddy."}, {"Time_Start": 1752.78, "Time_End": 1757.78, "Text": " Yeah, the one who desperately needed bandwidth at one point, and I wouldn't even return his phone calls."}, {"Time_Start": 1757.78, "Time_End": 1761.78, "Text": " And he went off and got his business up running anyway."}, {"Time_Start": 1761.78, "Time_End": 1766.78, "Text": " So, you know, basically, that came out that they were doing that."}, {"Time_Start": 1766.78, "Time_End": 1773.78, "Text": " I called up my EZDNS people because one of the things they had said that I always said that I always"}, {"Time_Start": 1773.78, "Time_End": 1777.78, "Text": " Harvardnet sucks.com, Harvardnet sucks.org, and Harvardnet sucks.net sucks."}, {"Time_Start": 1777.78, "Time_End": 1781.78, "Text": " Other people owned it. They had gone, it looks like a lot of fun to do."}, {"Time_Start": 1781.78, "Time_End": 1786.78, "Text": " You know, they put up like a big picture of a pile of garbage and said, look at their machine room and so on."}, {"Time_Start": 1786.78, "Time_End": 1792.78, "Text": " And ECDNS said, you know, some guys called up wondering about your address."}, {"Time_Start": 1792.78, "Time_End": 1797.78, "Text": " I was like, really? What'd you tell him? He goes, well, we told him the fuck off."}, {"Time_Start": 1797.78, "Time_End": 1803.76, "Text": " And I said, oh, and I said, oh, and I"}, {"Time_Start": 1803.78, "Time_End": 1806.28, "Text": " I said, hey, could I, could you put that in the letter for me?"}, {"Time_Start": 1806.28, "Time_End": 1808.78, "Text": " And he went, hmm, no, fuck you."}, {"Time_Start": 1808.78, "Time_End": 1812.58, "Text": " You're going through your stupid American shit."}, {"Time_Start": 1812.58, "Time_End": 1814.28, "Text": " We don't care whatsoever."}, {"Time_Start": 1814.28, "Time_End": 1816.28, "Text": " You show up in Canada with something, we'll talk to you."}, {"Time_Start": 1816.28, "Time_End": 1820.28, "Text": " He's like, we're not talking to nobody, nothing, nowhere about anything."}, {"Time_Start": 1820.28, "Time_End": 1821.78, "Text": " I like that attitude."}, {"Time_Start": 1821.78, "Time_End": 1824.78, "Text": " So easy dns.com, very nice guys."}, {"Time_Start": 1824.78, "Time_End": 1829.28, "Text": " I started to notice that I was getting a lot of hits to my site."}, {"Time_Start": 1829.28, "Time_End": 1832.28, "Text": " One important thing was I did not shut down my site."}, {"Time_Start": 1832.28, "Time_End": 1832.78, "Text": " I did not shut down my site."}, {"Time_Start": 1832.78, "Time_End": 1833.68, "Text": " I did not"}, {"Time_Start": 1833.78, "Time_End": 1853.78, "Text": " stop printing information. I did not start putting things up. That was the important thing, because what they wanted to do was they wanted to shut off my dumb little site while they tried to go for the little IPO. And I was just not going to have that. I started to put up really funny pictures. I found anytime someone said anything bad about them and put it up, I was a muck raker."}, {"Time_Start": 1853.78, "Time_End": 1862.78, "Text": " And a muck raker can be a really fun thing. It's the thing that most companies are really scared of because muck rakers find all the, most companies, I'll get in trouble for this."}, {"Time_Start": 1862.78, "Time_End": 1869.78, "Text": " for this. One or two companies always have skeletons in their closet because"}, {"Time_Start": 1869.78, "Time_End": 1873.78, "Text": " it is almost impossible to do business in America without doing something illegal."}, {"Time_Start": 1873.78, "Time_End": 1877.78, "Text": " There is always something where you're supposed to sign this, do this, you were supposed to talk to this guy,"}, {"Time_Start": 1877.78, "Time_End": 1881.78, "Text": " you were supposed to open this up to the public, you were supposed to do this and you didn't because you had to get it in,"}, {"Time_Start": 1881.78, "Time_End": 1885.78, "Text": " and Murphy got his $15,000 bonus and he, oh, screw it."}, {"Time_Start": 1885.78, "Time_End": 1887.78, "Text": " No one's, who's going to give a shit? That was two years ago."}, {"Time_Start": 1887.78, "Time_End": 1889.78, "Text": " It was a network connection who gives a shit."}, {"Time_Start": 1889.78, "Time_End": 1892.76, "Text": " Well, I give a shit now. I'm going to go find out. I'm going to print it."}, {"Time_Start": 1892.78, "Time_End": 1898.78, "Text": " it. That was probably that probably didn't actually enthuse them all that much."}, {"Time_Start": 1898.78, "Time_End": 1904.78, "Text": " So I found out looking at my logs, I started to take a real interest in my logs, that there"}, {"Time_Start": 1904.78, "Time_End": 1909.58, "Text": " were a lot of connections from a machine that came in twice a day whose browser was listed"}, {"Time_Start": 1909.58, "Time_End": 1918.3799999999999, "Text": " as Mozilla Halendor. Fuckers had put it in their browser tag. They must have had like some,"}, {"Time_Start": 1918.3799999999999, "Time_End": 1922.76, "Text": " from my point of view, I think they must have had some sort of customized browser they paid."}, {"Time_Start": 1922.78, "Time_End": 1952.28, "Text": " for that was the special Hayland Door Browser with a little like you know sue the fuck button or something I don't know so you know big big judgment hammer or something sue the bastard and they you know basically I noticed this and now they've submitted a second order believe it or not they submitted a second order I'm still not even off that first week although it is a pretty tough week just before they submitted a second order because I put up a thing going we are being sued"}, {"Time_Start": 1952.78, "Time_End": 1954.78, "Text": " Everything must go."}, {"Time_Start": 1954.78, "Time_End": 1966.78, "Text": " And I put the domain name up on eBay at like, with like a, like a $300,000, you know, secret minimum thing."}, {"Time_Start": 1966.78, "Time_End": 1969.78, "Text": " So it was like, it was a joke, but it was just to prove a point."}, {"Time_Start": 1969.78, "Time_End": 1970.78, "Text": " Ha ha ha!"}, {"Time_Start": 1970.78, "Time_End": 1972.78, "Text": " And hey, 300,000, I could do something with that."}, {"Time_Start": 1972.78, "Time_End": 1975.78, "Text": " Pay those bastards off, go home."}, {"Time_Start": 1975.78, "Time_End": 1982.76, "Text": " Anyway, they submitted a thing going according to Mr.'s, you know, because I said, you know, I wrote in a style which you might,"}, {"Time_Start": 1982.78, "Time_End": 1991.78, "Text": " might find surprising to be funny, of, you know, all of our assets is pretty much our domain name and a few JPEGs."}, {"Time_Start": 1991.78, "Time_End": 1994.78, "Text": " You know, so we've got to make money for these bastards who are suing us."}, {"Time_Start": 1994.78, "Time_End": 2001.78, "Text": " And they submitted that in a court owner and said, as is proven here, Mr. Scott has no known assets."}, {"Time_Start": 2001.78, "Time_End": 2009.78, "Text": " Therefore, we need, you know, we will not allow him to sell off this asset of his domain name because we expect to receive it in a judgment."}, {"Time_Start": 2012.78, "Time_End": 2014.98, "Text": " That's what I knew I had to make them stop browsing my site."}, {"Time_Start": 2016.18, "Time_End": 2019.48, "Text": " So, you know, there's this great thing in, I started doing a lot of research."}, {"Time_Start": 2019.58, "Time_End": 2021.78, "Text": " I knew this had to be possible in Apache."}, {"Time_Start": 2022.44, "Time_End": 2026.24, "Text": " You can do things based on what comes to you."}, {"Time_Start": 2026.28, "Time_End": 2030.3, "Text": " In other words, like, you can go, oh, this, how do I say it?"}, {"Time_Start": 2030.44, "Time_End": 2034.7, "Text": " You know, like this IP address is coming in, so give him this kind of page."}, {"Time_Start": 2034.7, "Time_End": 2039.94, "Text": " Or if somebody's going to do, if someone connects with this referer, send them to this page, and so on and so on."}, {"Time_Start": 2040.3799999999999, "Time_End": 2042.76, "Text": " If anyone from Hale and Door browsed in, I'd say,"}, {"Time_Start": 2042.78, "Time_End": 2043.78, "Text": " them to the ACLU."}, {"Time_Start": 2043.78, "Time_End": 2054.2799999999997, "Text": " You know, they come in, the ACLU."}, {"Time_Start": 2054.2799999999997, "Time_End": 2057.7799999999997, "Text": " The hit stopped after a while."}, {"Time_Start": 2057.7799999999997, "Time_End": 2062.2799999999997, "Text": " They kind of come back, like once a month or something just to check."}, {"Time_Start": 2062.2799999999997, "Time_End": 2065.7799999999997, "Text": " That's how I knew when the checks had stopped coming to them because I could see when it, you know,"}, {"Time_Start": 2065.7799999999997, "Time_End": 2067.7799999999997, "Text": " they stopped even trying."}, {"Time_Start": 2067.7799999999997, "Time_End": 2070.7799999999997, "Text": " But that kind of stopped them for a while, and I was all Mr. Proud of myself."}, {"Time_Start": 2070.78, "Time_End": 2074.78, "Text": " Um, their humorlessness is unbelievable."}, {"Time_Start": 2074.78, "Time_End": 2078.6200000000003, "Text": " But you, you know, that's the thing you have to realize is that the minute of hackerdom is very"}, {"Time_Start": 2078.6200000000003, "Time_End": 2080.78, "Text": " actually similar to the minutee of lawyerdom."}, {"Time_Start": 2080.78, "Time_End": 2083.1600000000003, "Text": " And lawyers have these funny little things they do."}, {"Time_Start": 2083.1600000000003, "Time_End": 2090.7000000000003, "Text": " For instance, my lawyer would give the other guys my entire defense an hour and a half before"}, {"Time_Start": 2090.7000000000003, "Time_End": 2092.48, "Text": " the court case."}, {"Time_Start": 2092.48, "Time_End": 2095.1000000000004, "Text": " This was something that was done."}, {"Time_Start": 2095.1000000000004, "Time_End": 2096.1000000000004, "Text": " And they did the same."}, {"Time_Start": 2096.1000000000004, "Time_End": 2097.5, "Text": " They're like, here's your defense."}, {"Time_Start": 2097.5, "Time_End": 2099.5400000000004, "Text": " They got an hour and a half to do it."}, {"Time_Start": 2099.5400000000004, "Time_End": 2100.6000000000004, "Text": " And the thing I will call"}, {"Time_Start": 2100.6, "Time_End": 2106.12, "Text": " No credit, Mr. Hallstead, the modeled sword guy, is he would produce out of his flaming"}, {"Time_Start": 2106.12, "Time_End": 2109.16, "Text": " ass the most amazing things up on the stand."}, {"Time_Start": 2109.16, "Time_End": 2111.58, "Text": " He would just go, based on what I just read."}, {"Time_Start": 2111.58, "Time_End": 2116.46, "Text": " For instance, we said, we had said, just as a small example, I don't want to get too much into"}, {"Time_Start": 2116.46, "Time_End": 2123.0, "Text": " the minute of that, because it's just typical, you know, minds bigger."}, {"Time_Start": 2123.0, "Time_End": 2129.22, "Text": " And one of the things that we said was, was, you know, the non-disclosure agreement doesn't"}, {"Time_Start": 2129.22, "Time_End": 2130.58, "Text": " cover the firewall."}, {"Time_Start": 2130.6, "Time_End": 2134.14, "Text": " name because it's public information."}, {"Time_Start": 2134.14, "Time_End": 2140.52, "Text": " And they said, Mr. Scott does not dispute the legality and validity of our nondisclosure agreement."}, {"Time_Start": 2140.52, "Time_End": 2142.48, "Text": " Well, yes, technically that's true."}, {"Time_Start": 2142.48, "Time_End": 2146.02, "Text": " Your non-relevant document is probably really sound."}, {"Time_Start": 2146.02, "Time_End": 2147.52, "Text": " But that's what, you know, and what do you do?"}, {"Time_Start": 2147.52, "Time_End": 2150.18, "Text": " You want to scream that from the back and you can't."}, {"Time_Start": 2150.18, "Time_End": 2155.72, "Text": " So we had our hearing, and at our hearing, we presented our affidavits and this guy stood up and"}, {"Time_Start": 2155.72, "Time_End": 2159.2, "Text": " just tried to slam us and said, you know, your honor, this thing."}, {"Time_Start": 2159.2, "Time_End": 2160.58, "Text": " And this guy, the judge."}, {"Time_Start": 2160.6, "Time_End": 2166.66, "Text": " Judge Julian was just so, he was an older gentleman, he was nearing retirement, this was"}, {"Time_Start": 2166.66, "Time_End": 2171.7, "Text": " the last thing he went on this plate, but I got to hear a beautiful old baritone go, so tell"}, {"Time_Start": 2171.7, "Time_End": 2173.66, "Text": " me more about this, Harvard Net sucks."}, {"Time_Start": 2177.16, "Time_End": 2179.06, "Text": " What sort of sight is this?"}, {"Time_Start": 2180.1, "Time_End": 2182.44, "Text": " And he actually even got a little, like, ringer off at one point."}, {"Time_Start": 2182.5, "Time_End": 2186.74, "Text": " My lawyer was like, this is a total, you know, this is a total prior restraint of his First"}, {"Time_Start": 2186.74, "Time_End": 2187.04, "Text": " Amendment."}, {"Time_Start": 2187.2, "Time_End": 2190.4, "Text": " And he's like, I'm well aware of First Amendment defenses."}, {"Time_Start": 2190.6, "Time_End": 2196.74, "Text": " Anyway, he, I'm well aware of the First Amendment."}, {"Time_Start": 2196.74, "Time_End": 2204.3199999999997, "Text": " The, the, the, in the case, he took all of our stuff and he does, it's not like TV."}, {"Time_Start": 2204.48, "Time_End": 2209.74, "Text": " They don't just go, thanks, Matt Locke, here is my slam credits."}, {"Time_Start": 2209.86, "Time_End": 2210.64, "Text": " No, it's not like that."}, {"Time_Start": 2211.04, "Time_End": 2213.44, "Text": " They said, we'll take this under consideration."}, {"Time_Start": 2213.68, "Time_End": 2219.0, "Text": " You'll get the decision in the mail, at which point it will happen at some point."}, {"Time_Start": 2219.86, "Time_End": 2220.58, "Text": " So I was in a time."}, {"Time_Start": 2220.6, "Time_End": 2225.94, "Text": " Twilight Zone for about a month. The next day, Fucked Company took a very big interest in this"}, {"Time_Start": 2225.94, "Time_End": 2232.52, "Text": " because my boss, my ex-boss, had done this and PUD thought this was the greatest thing"}, {"Time_Start": 2232.52, "Time_End": 2239.9, "Text": " in the world. Does everyone here aware of FuckedCompany.com? Well, that explains the 15,000 different"}, {"Time_Start": 2239.9, "Time_End": 2247.12, "Text": " sites that came to me the next day. Now everyone knew that Harvard NetSucks. They, you know,"}, {"Time_Start": 2247.62, "Time_End": 2250.58, "Text": " everybody was in on this. Now I was getting contact."}, {"Time_Start": 2250.6, "Time_End": 2256.58, "Text": " from the Boston, Boston, Harold wanted to talk to me. I got other people who wanted to,"}, {"Time_Start": 2256.58, "Time_End": 2260.48, "Text": " like, go, hey, you know, I can't believe this. I haven't worked that company a year. There's still"}, {"Time_Start": 2260.48, "Time_End": 2266.3399999999997, "Text": " fuckers. Holy shit. I hate them and so on. I became this, you know, broken promises. And I had"}, {"Time_Start": 2266.3399999999997, "Time_End": 2270.04, "Text": " set it up so that all mail addresses came to me. So, of course, every time I published a story,"}, {"Time_Start": 2270.04, "Time_End": 2274.42, "Text": " I'd give a different email address. You know, like the correction site was you fucked up at Harvard"}, {"Time_Start": 2274.42, "Time_End": 2280.02, "Text": " NetSucks. And, you know, I'd go like, hey, you know, like, write to me if you know of the good lawyers."}, {"Time_Start": 2280.02, "Time_End": 2282.36, "Text": " and I would say lies, lies, lies at Harvard NetSucks."}, {"Time_Start": 2282.44, "Time_End": 2285.4, "Text": " And, you know, I was a very funny little revolutionary."}, {"Time_Start": 2285.98, "Time_End": 2291.66, "Text": " So for that three weeks, I was kind of publishing things, kind of in this, you know,"}, {"Time_Start": 2292.6, "Time_End": 2296.3, "Text": " just basically floating, waiting for the decision."}, {"Time_Start": 2296.46, "Time_End": 2299.6, "Text": " Will I get the decision? Will they deny it? Now, keep in mind, this is not the trial."}, {"Time_Start": 2299.6, "Time_End": 2303.84, "Text": " This is just my response to them trying to get a temporary restraining order against me"}, {"Time_Start": 2303.84, "Time_End": 2306.8, "Text": " for publishing the host name before they sue me for $120,000."}, {"Time_Start": 2308.44, "Time_End": 2310.0, "Text": " So we're already."}, {"Time_Start": 2310.02, "Time_End": 2320.84, "Text": " like nine grand in the hole. Just doing that. Just saying, no, chiching. That's why when"}, {"Time_Start": 2320.84, "Time_End": 2326.84, "Text": " someone goes, I'm going to sue your ass, he better be a lawyer or sleeping with one, because he"}, {"Time_Start": 2326.84, "Time_End": 2333.58, "Text": " is going to cost him a lot of money. Now, there are a breed of lawyers who will make a deal, a very"}, {"Time_Start": 2333.58, "Time_End": 2338.36, "Text": " interesting deal. I will do your case for free and take half of what you win."}, {"Time_Start": 2340.02, "Time_End": 2341.68, "Text": " Get away from those guys."}, {"Time_Start": 2342.4, "Time_End": 2346.0, "Text": " They're like the thing that comes at the end of a video game level to make you stop playing that level"}, {"Time_Start": 2346.0, "Time_End": 2347.16, "Text": " because you've been playing over too long."}, {"Time_Start": 2347.7599999999998, "Time_End": 2351.82, "Text": " They're not going to give up because they're going to come up with everything."}, {"Time_Start": 2352.06, "Time_End": 2356.56, "Text": " But most times when you go to a lawyer or a lawyer, I don't even think you should be taking this case on."}, {"Time_Start": 2356.6, "Time_End": 2358.06, "Text": " You're just suing the guy because you hate him."}, {"Time_Start": 2358.98, "Time_End": 2363.08, "Text": " Well, our guy, Harvard Net, was funded by Fidelity Investments."}, {"Time_Start": 2364.58, "Time_End": 2368.18, "Text": " And Fidelity Investments doesn't care about money."}, {"Time_Start": 2368.28, "Time_End": 2369.8, "Text": " I mean, other than it's coming in a lot."}, {"Time_Start": 2370.02, "Time_End": 2377.32, "Text": " But they weren't really all hurt by, you know, 45 grand, whatever, you know. It's just retainer."}, {"Time_Start": 2377.42, "Time_End": 2382.94, "Text": " It's like, go ahead, whatever you got to do, make it happen. I don't care. So there was a lot of money"}, {"Time_Start": 2382.94, "Time_End": 2389.0, "Text": " behind it. However, they were a little bit displeased that this Harvard Net Sucks site was starting to get"}, {"Time_Start": 2389.0, "Time_End": 2394.32, "Text": " some publicity, even though it was web publicity, which they don't really acknowledge. But then the"}, {"Time_Start": 2394.32, "Time_End": 2400.0, "Text": " interviews started. I got into an interview with Tom Kirchhoffer at the Boston Herald. I actually"}, {"Time_Start": 2400.02, "Time_End": 2404.66, "Text": " had my lawyer in the office. I was submitting stories, but each time I submitted a story,"}, {"Time_Start": 2404.88, "Time_End": 2409.52, "Text": " I submitted it to my lawyer. My lawyer would look at it and go, yeah, you probably won't get suit."}, {"Time_Start": 2409.52, "Time_End": 2417.28, "Text": " Sorry, it doesn't look all that actionable. And then up it would go. So I'm funny, you know,"}, {"Time_Start": 2417.36, "Time_End": 2424.7, "Text": " after it goes through my team of lawyer. And she also became our legal staff, by the way, so"}, {"Time_Start": 2424.7, "Time_End": 2430.0, "Text": " got to keep that up. And so, you know, those three weeks,"}, {"Time_Start": 2430.02, "Time_End": 2433.56, "Text": " were pretty unpleasant. I mean, it's nice that I'm being covered and all that stuff,"}, {"Time_Start": 2433.64, "Time_End": 2437.78, "Text": " but I mean, it's a very unpleasant experience when you just know there's this thing hanging over"}, {"Time_Start": 2437.78, "Time_End": 2441.22, "Text": " your head. And I do want to say, if you ever do get into one of these things, they are long, drawn"}, {"Time_Start": 2441.22, "Time_End": 2447.36, "Text": " out, stupid-ass things that last for like an hour and a half every six months and can go on for"}, {"Time_Start": 2447.36, "Time_End": 2451.58, "Text": " years and years and years, unless somebody pulls an amazing amount of strings, at which point"}, {"Time_Start": 2451.58, "Time_End": 2455.7, "Text": " you've probably got other problems anyway. They're probably going to come to, if they're pulling strings"}, {"Time_Start": 2455.7, "Time_End": 2459.48, "Text": " that fast, they probably want to talk to you and you're going to talk to them. So you can't let"}, {"Time_Start": 2459.48, "Time_End": 2466.16, "Text": " yourself, just put your life into a parking break and just hope and go, oh, life is horrible,"}, {"Time_Start": 2466.28, "Time_End": 2470.9, "Text": " because you just, they're winning. They're killing you. They're actually killing you."}, {"Time_Start": 2472.14, "Time_End": 2478.14, "Text": " So one piece of advice I have, just don't do that. Don't fall into that trap of letting them crush you"}, {"Time_Start": 2478.14, "Time_End": 2488.8, "Text": " like that. The, the actual hearing that, that. That, the, the actual hearing that, that, that,"}, {"Time_Start": 2489.48, "Time_End": 2494.68, "Text": " I'm talking about, sorry, I've lost my, completely lost my train of thought."}, {"Time_Start": 2495.02, "Time_End": 2500.26, "Text": " Basically, three weeks later, he came back with a response, the judge, in which he said,"}, {"Time_Start": 2500.56, "Time_End": 2502.28, "Text": " they are completely denied."}, {"Time_Start": 2503.28, "Time_End": 2506.06, "Text": " Basically, he looked at all the stuff we'd written, he said, you're right."}, {"Time_Start": 2506.36, "Time_End": 2508.02, "Text": " This host name stuff is bullshit."}, {"Time_Start": 2509.02, "Time_End": 2511.08, "Text": " You shouldn't have a restraining order against you."}, {"Time_Start": 2511.72, "Time_End": 2514.4, "Text": " So I'd won."}, {"Time_Start": 2515.52, "Time_End": 2518.94, "Text": " And everyone who looked at it, right, they were like, you won."}, {"Time_Start": 2518.94, "Time_End": 2526.28, "Text": " I'm like, yes, in the process of flung off a cliff, I was able to pull up my pants so I had some dignity."}, {"Time_Start": 2529.5, "Time_End": 2535.3, "Text": " The, you know, I put up the host name, like, I didn't not put up the host name actually the next day."}, {"Time_Start": 2535.34, "Time_End": 2538.58, "Text": " I said, you know, we could put up their stupid-ass host name, but it's lame and it's stupid."}, {"Time_Start": 2538.94, "Time_End": 2540.06, "Text": " So we're not going to do that."}, {"Time_Start": 2540.32, "Time_End": 2545.14, "Text": " It actually had, I remember this now, it had the brand name of the firewall product as the host name."}, {"Time_Start": 2547.02, "Time_End": 2548.42, "Text": " That's right, assholes."}, {"Time_Start": 2548.94, "Time_End": 2554.02, "Text": " You kind of block that little, those little, dumb details out."}, {"Time_Start": 2554.02, "Time_End": 2557.92, "Text": " One other thing, they fired my ex-boss two days later."}, {"Time_Start": 2557.92, "Time_End": 2563.68, "Text": " So basically they brought him into a little room and said, what did you do?"}, {"Time_Start": 2563.68, "Time_End": 2570.34, "Text": " As I understood it, you know, at this point now, I am the lightning rod for all hate of Harvard"}, {"Time_Start": 2570.34, "Time_End": 2572.26, "Text": " Net that has ever been."}, {"Time_Start": 2572.26, "Time_End": 2577.7400000000002, "Text": " I am getting phone calls and emails from people just going, here's what they're doing today."}, {"Time_Start": 2577.7400000000002, "Time_End": 2578.7400000000002, "Text": " Here's what they're up to."}, {"Time_Start": 2578.7400000000002, "Time_End": 2579.7400000000002, "Text": " Here's what they said."}, {"Time_Start": 2579.7400000000002, "Time_End": 2580.7400000000002, "Text": " This letter went by."}, {"Time_Start": 2580.7400000000002, "Time_End": 2582.7400000000002, "Text": " I couldn't print half the stuff."}, {"Time_Start": 2582.7400000000002, "Time_End": 2587.46, "Text": " And I'm not going to say it here because it may or may not be true, but horrible things were implied,"}, {"Time_Start": 2587.46, "Time_End": 2591.2400000000002, "Text": " and horrible things happened, and laws were broken and yada, yada, yada."}, {"Time_Start": 2591.2400000000002, "Time_End": 2593.5000000000005, "Text": " There was, I was getting a lot of info."}, {"Time_Start": 2593.5000000000005, "Time_End": 2597.6200000000003, "Text": " I was the gossip man, but I just couldn't print some of it because it was just impossible."}, {"Time_Start": 2597.6200000000003, "Time_End": 2599.42, "Text": " I also did not have a message base."}, {"Time_Start": 2599.42, "Time_End": 2601.26, "Text": " That's also a mistake to me."}, {"Time_Start": 2601.26, "Time_End": 2605.5000000000005, "Text": " A message base is just an invitation for everybody else to go to the windows of your house"}, {"Time_Start": 2605.5000000000005, "Time_End": 2607.5000000000005, "Text": " and moon everybody that goes by."}, {"Time_Start": 2607.5, "Time_End": 2611.5, "Text": " You know, they know where you are."}, {"Time_Start": 2611.5, "Time_End": 2613.5, "Text": " You know, they don't know where Dark Ninja is."}, {"Time_Start": 2613.5, "Time_End": 2616.5, "Text": " Or CEO sucks cock."}, {"Time_Start": 2616.5, "Time_End": 2618.5, "Text": " You know, they don't know where he is."}, {"Time_Start": 2618.5, "Time_End": 2621.5, "Text": " Which is why, in a way, I was kind of delighted about fucked company."}, {"Time_Start": 2621.5, "Time_End": 2626.5, "Text": " Because Fucked Company had just put in a new feature where you could post messages."}, {"Time_Start": 2626.5, "Time_End": 2633.5, "Text": " And they had got an average of 100 to 200 messages per fuck, as he puts it."}, {"Time_Start": 2633.5, "Time_End": 2635.5, "Text": " 15 to 30, whatever."}, {"Time_Start": 2635.5, "Time_End": 2636.5, "Text": " We got 3,000."}, {"Time_Start": 2636.5, "Time_End": 2640.66, "Text": " And it was enough where PUD came in at like 2000."}, {"Time_Start": 2640.76, "Time_End": 2642.24, "Text": " It went, holy shit, this thing's flying."}, {"Time_Start": 2645.8, "Time_End": 2649.26, "Text": " And there was so much vitro."}, {"Time_Start": 2649.6, "Time_End": 2655.0, "Text": " There was so much, you know, people were like, hey, you know, we didn't get our bonus checks this year."}, {"Time_Start": 2655.12, "Time_End": 2661.04, "Text": " So better go to the CEO's house at this, you know, address, ask for your checks, and call ahead."}, {"Time_Start": 2661.28, "Time_End": 2663.4, "Text": " Here's his home phone number and his cell phone."}, {"Time_Start": 2664.2, "Time_End": 2666.48, "Text": " And I'm like, I never."}, {"Time_Start": 2666.5, "Time_End": 2670.94, "Text": " posted on that board, ever, ever. I thought it was just too much danger for me to do."}, {"Time_Start": 2671.16, "Time_End": 2675.1, "Text": " But I took great delight in sometimes taking some of the classics and putting them up on my"}, {"Time_Start": 2675.1, "Time_End": 2678.1, "Text": " site. So I was kind of using it as a filter going, look what that guy's doing over there."}, {"Time_Start": 2678.2, "Time_End": 2683.02, "Text": " But, you know, I mean, PUD, to me, is just on the edge. The man is going to get whacked."}, {"Time_Start": 2683.32, "Time_End": 2689.38, "Text": " It's just a matter of when. Not whack, bang, but, you know, whack. Letters, letters from, I'm sure"}, {"Time_Start": 2689.38, "Time_End": 2694.68, "Text": " he does already. But they're usually cease and desist letters, which by now hackers and web people are"}, {"Time_Start": 2694.68, "Time_End": 2699.3199999999997, "Text": " becoming so inured to because they're just this pathetic little whatever. By the way,"}, {"Time_Start": 2699.3599999999997, "Time_End": 2704.44, "Text": " if somebody emails you a cease and desist, fuck them. Okay, so that's not, it's nothing real."}, {"Time_Start": 2704.56, "Time_End": 2707.94, "Text": " I mean, it's really funny when you talk to a lawyer and you start presenting them the things that you"}, {"Time_Start": 2707.94, "Time_End": 2712.46, "Text": " know, they, they will like look at stuff that you were like, man, I'm really, you're like,"}, {"Time_Start": 2712.7799999999997, "Time_End": 2720.0, "Text": " where's the notary? Where's the signature? Did you have to sign for your email? No?"}, {"Time_Start": 2720.3599999999997, "Time_End": 2724.66, "Text": " Fuck them. You got a random email from God,"}, {"Time_Start": 2724.68, "Time_End": 2732.3799999999997, "Text": " who about God knows what to lead it. So, you know, that, a lawyer who's on your side can"}, {"Time_Start": 2732.3799999999997, "Time_End": 2736.7999999999997, "Text": " give you a very good perspective. One other important thing, the lawyer on the other side,"}, {"Time_Start": 2736.7999999999997, "Time_End": 2743.9199999999996, "Text": " under no circumstances in any situation is your friend. And people forget that. That the"}, {"Time_Start": 2743.9199999999996, "Time_End": 2750.74, "Text": " guy really, really, really wants to win his case, under any circumstance whatsoever. Prosecute,"}, {"Time_Start": 2750.74, "Time_End": 2754.66, "Text": " public defenders are a whole other deal. That's a whole other weird, wacky thing. You're 12."}, {"Time_Start": 2754.68, "Time_End": 2757.02, "Text": " you knocked over a headstone, you're whatever."}, {"Time_Start": 2757.14, "Time_End": 2760.1, "Text": " The guy might go, look, we'll, whatever, we'll negotiate it down."}, {"Time_Start": 2760.22, "Time_End": 2767.12, "Text": " But lawyer hired by big company, under no circumstance, wants the other guy to feel good about anything."}, {"Time_Start": 2767.54, "Time_End": 2773.2999999999997, "Text": " They wanted me, when they saw this $120,000 number to come crying into their little area,"}, {"Time_Start": 2773.3399999999997, "Time_End": 2775.1, "Text": " and they go, you've been a bad little man."}, {"Time_Start": 2776.9199999999996, "Time_End": 2781.8999999999996, "Text": " Together, I think we can work something out and make me sign everything."}, {"Time_Start": 2781.8999999999996, "Time_End": 2784.66, "Text": " It was sign away the life of myself and everyone around."}, {"Time_Start": 2784.68, "Time_End": 2788.44, "Text": " me, you know, because that's what the CEO wanted."}, {"Time_Start": 2789.64, "Time_End": 2793.8999999999996, "Text": " Now, when it was denied, now I'm still now technically sued."}, {"Time_Start": 2794.3199999999997, "Time_End": 2803.08, "Text": " I'm just loose, free. And that's when my friend started trying to get different newspapers to interview me."}, {"Time_Start": 2803.62, "Time_End": 2807.48, "Text": " The Boston Herald interviewed me, like I said, with my lawyer right next to me."}, {"Time_Start": 2808.08, "Time_End": 2811.8799999999997, "Text": " And, you know, I'd be like blah, blah, blah, blah, blah, blah, that they suck."}, {"Time_Start": 2812.3399999999997, "Time_End": 2813.98, "Text": " And she's like, shh, don't say that."}, {"Time_Start": 2814.68, "Time_End": 2821.2, "Text": " really weird. It's like having the angriest angel on your shoulder. No, no, no. You know,"}, {"Time_Start": 2821.3199999999997, "Time_End": 2825.3399999999997, "Text": " she's trying to do right by me, but you got to kind of, you know, you got to kind of dig it, or they're"}, {"Time_Start": 2825.3399999999997, "Time_End": 2830.02, "Text": " just going to go, oh, look, it's another bland lawyer-filtered press conference. So it was this"}, {"Time_Start": 2830.02, "Time_End": 2836.2, "Text": " weird balance I had to stick in my own mind. The first, um, the first article was finally published."}, {"Time_Start": 2836.2, "Time_End": 2844.08, "Text": " Um, where was it the, uh, uh, yeah, there we go. All right in the book, Harvard Net Su's site owner."}, {"Time_Start": 2844.68, "Time_End": 2846.7999999999997, "Text": " A quote from my lawyer, which was kind of freaky, wasn't it?"}, {"Time_Start": 2847.56, "Time_End": 2849.2999999999997, "Text": " You know, it's like, here's a guy who's being sued."}, {"Time_Start": 2849.3799999999997, "Time_End": 2850.44, "Text": " Here's what his lawyer has to say."}, {"Time_Start": 2851.46, "Time_End": 2852.96, "Text": " I always think that's kind of wacky."}, {"Time_Start": 2853.7999999999997, "Time_End": 2858.7, "Text": " One aspect of this that did come out, by the way, was that I started becoming a source."}, {"Time_Start": 2859.62, "Time_End": 2861.3199999999997, "Text": " They went, he knows a lot about Harvard Nets."}, {"Time_Start": 2861.3799999999997, "Time_End": 2863.8999999999996, "Text": " They all started calling me up and going, hey, what's going on over there?"}, {"Time_Start": 2863.94, "Time_End": 2864.64, "Text": " I wouldn't know."}, {"Time_Start": 2865.3199999999997, "Time_End": 2866.22, "Text": " Oh, it's horrible."}, {"Time_Start": 2866.48, "Time_End": 2867.3199999999997, "Text": " Things are rotten."}, {"Time_Start": 2868.7, "Time_End": 2869.06, "Text": " Fire."}, {"Time_Start": 2870.1, "Time_End": 2873.8599999999997, "Text": " And, you know, they go, sources said fire."}, {"Time_Start": 2874.68, "Time_End": 2879.8599999999997, "Text": " I was going to get this big shirt as sources said, I am the source."}, {"Time_Start": 2881.64, "Time_End": 2884.08, "Text": " And then the real killer came in."}, {"Time_Start": 2884.12, "Time_End": 2886.8999999999996, "Text": " That's when, by the way, I found out nobody reads the goddamn Boston Herald."}, {"Time_Start": 2888.52, "Time_End": 2890.04, "Text": " I really thought that wasn't the case."}, {"Time_Start": 2890.68, "Time_End": 2892.1, "Text": " But nobody reads the Boston Herald."}, {"Time_Start": 2892.2, "Time_End": 2892.7999999999997, "Text": " No reaction."}, {"Time_Start": 2893.2999999999997, "Time_End": 2893.54, "Text": " Nothing."}, {"Time_Start": 2893.72, "Time_End": 2896.22, "Text": " Nobody gave a damn shit about the Boston Herald."}, {"Time_Start": 2896.5, "Time_End": 2897.48, "Text": " I was like, ooh, I'm in the paper."}, {"Time_Start": 2897.94, "Time_End": 2901.8399999999997, "Text": " But no, nobody called and went, oh my God, oh my God, now you're hit the big time."}, {"Time_Start": 2902.14, "Time_End": 2902.8799999999997, "Text": " You're into Boston Herald."}, {"Time_Start": 2903.72, "Time_End": 2904.66, "Text": " So we were really trying to."}, {"Time_Start": 2904.68, "Time_End": 2910.5, "Text": " for the Globe, who's like, if you're not about Boston newspaper set up, you know,"}, {"Time_Start": 2910.56, "Time_End": 2914.72, "Text": " like every other place there's the Boston Globe, which is known by the New York Times, Boston"}, {"Time_Start": 2914.72, "Time_End": 2920.3599999999997, "Text": " Herald, which is the, yeah, Southie kind of place, and then there's everybody else, including"}, {"Time_Start": 2920.3599999999997, "Time_End": 2924.3599999999997, "Text": " like, and every other one else has to give themselves away for free and stick themselves in"}, {"Time_Start": 2924.3599999999997, "Time_End": 2927.3999999999996, "Text": " doorways, so you'll trip over them and maybe read the headline or something."}, {"Time_Start": 2928.2799999999997, "Time_End": 2930.04, "Text": " So it's basically Globe."}, {"Time_Start": 2930.6, "Time_End": 2932.6, "Text": " The Globe was hosted at Harvard Net."}, {"Time_Start": 2934.68, "Time_End": 2938.3399999999997, "Text": " I'm not giving away any secret because they had made a deal with Harvard."}, {"Time_Start": 2938.5, "Time_End": 2944.3399999999997, "Text": " Harvard Net lost money on the globe because the globe, they put ads for themselves."}, {"Time_Start": 2944.62, "Time_End": 2948.7999999999997, "Text": " They got to put free ads on the web pages that were being served by this newspaper."}, {"Time_Start": 2948.94, "Time_End": 2949.8799999999997, "Text": " Never on a story."}, {"Time_Start": 2950.48, "Time_End": 2953.04, "Text": " It was a weird rule, but when they showed a story, you didn't see it."}, {"Time_Start": 2953.1, "Time_End": 2954.8999999999996, "Text": " But like, you know, here's the stories that are up here."}, {"Time_Start": 2955.06, "Time_End": 2956.2599999999998, "Text": " We're hosted by HarvardNet."}, {"Time_Start": 2956.7799999999997, "Time_End": 2959.64, "Text": " You know, so that was, we were like, we really want to get in that paper."}, {"Time_Start": 2960.18, "Time_End": 2961.06, "Text": " And we did."}, {"Time_Start": 2961.56, "Time_End": 2964.44, "Text": " I got a call from a guy named Alex Beam, who was a columnist."}, {"Time_Start": 2964.68, "Time_End": 2969.3199999999997, "Text": " And Alex Beam called me up, and I was in San Francisco on a business trip,"}, {"Time_Start": 2969.8999999999996, "Time_End": 2972.5, "Text": " and we get the call like, hey, he wants to talk to you."}, {"Time_Start": 2972.54, "Time_End": 2977.24, "Text": " So I'm talking to the guy on a cell phone in the hallway during a training session"}, {"Time_Start": 2977.24, "Time_End": 2985.18, "Text": " with my lawyer on the line out of a three-way call who was like, wait, wait, he said."}, {"Time_Start": 2986.14, "Time_End": 2988.7, "Text": " And he was, I talked, no, that was right."}, {"Time_Start": 2988.8399999999997, "Time_End": 2989.62, "Text": " No, I'm wrong."}, {"Time_Start": 2989.8799999999997, "Time_End": 2990.56, "Text": " I'm wrong."}, {"Time_Start": 2990.66, "Time_End": 2993.62, "Text": " That's the one where I talk to him first, then talk to her."}, {"Time_Start": 2994.68, "Time_End": 2995.98, "Text": " So what did you say when they said this?"}, {"Time_Start": 2996.3599999999997, "Time_End": 2998.98, "Text": " I said it was something like, what exactly did you say?"}, {"Time_Start": 3000.12, "Time_End": 3001.8799999999997, "Text": " Jason, you're going to destroy everything."}, {"Time_Start": 3002.16, "Time_End": 3005.44, "Text": " Ah, ah, ah, I didn't go into that training session and learn very much that day."}, {"Time_Start": 3006.48, "Time_End": 3011.2999999999997, "Text": " But let me tell you, Alex Beam printed the nastiest fucking column."}, {"Time_Start": 3011.74, "Time_End": 3014.2, "Text": " It was called Stuck in the Web of Bad Publicity."}, {"Time_Start": 3014.66, "Time_End": 3017.0, "Text": " And it was up on like the fourth, fifth page."}, {"Time_Start": 3017.0, "Time_End": 3024.64, "Text": " And it was like, how could, you know, like, how could HarvardNet be so goddamn stupid as to sue a guy"}, {"Time_Start": 3024.68, "Time_End": 3028.14, "Text": " for nothing because they think they want to shut him up."}, {"Time_Start": 3028.24, "Time_End": 3029.48, "Text": " Haven't they heard of the First Amendment?"}, {"Time_Start": 3029.66, "Time_End": 3030.14, "Text": " Congratulations."}, {"Time_Start": 3030.74, "Time_End": 3033.52, "Text": " You've turned Jason Scott into a First Amendment martyr."}, {"Time_Start": 3034.22, "Time_End": 3036.64, "Text": " You know, what kind of place is this?"}, {"Time_Start": 3036.72, "Time_End": 3038.8199999999997, "Text": " And it was, of course, hosted by Harvard Net."}, {"Time_Start": 3040.02, "Time_End": 3040.3399999999997, "Text": " Woo!"}, {"Time_Start": 3044.68, "Time_End": 3047.18, "Text": " The next day, they dropped the case."}, {"Time_Start": 3048.18, "Time_End": 3050.3399999999997, "Text": " Next day, we get a letter."}, {"Time_Start": 3051.14, "Time_End": 3054.14, "Text": " And the letter, by the way, the lawyers gave up nothing."}, {"Time_Start": 3054.14, "Time_End": 3062.52, "Text": " They gave it, they, they, um, they, um, this is, this is the entire letter I got."}, {"Time_Start": 3063.3199999999997, "Time_End": 3066.9, "Text": " Whereas the defendant is no longer posting any firewall information on his website,"}, {"Time_Start": 3067.2, "Time_End": 3070.66, "Text": " HarvardNet Incorporated, hereby voluntarily dismisses the above captioned action"}, {"Time_Start": 3070.66, "Time_End": 3072.8599999999997, "Text": " without prejudice pursuant to this law."}, {"Time_Start": 3073.74, "Time_End": 3076.48, "Text": " What they've said was, they dismissed it without prejudice."}, {"Time_Start": 3076.66, "Time_End": 3077.3199999999997, "Text": " What the fuck is that?"}, {"Time_Start": 3077.56, "Time_End": 3082.8399999999997, "Text": " I found out that without prejudice means we're just dropping it because we feel like it."}, {"Time_Start": 3083.3199999999997, "Time_End": 3084.12, "Text": " We're not in."}, {"Time_Start": 3084.14, "Time_End": 3090.7, "Text": " We're not admitting we were wrong. We're not admitting we were right. We were just, we were doing it. You know, we were dating and now we're not."}, {"Time_Start": 3094.06, "Time_End": 3098.66, "Text": " What it means is that they are allowed to start it up on a moment's notice anytime they want to."}, {"Time_Start": 3099.2599999999998, "Time_End": 3113.92, "Text": " There's this thing hanging over your head. They weren't going to, um, as it turns out, but they did this to, you know, they basically, they did, this is Hale and Door. This is Hale and Door going, no, no, no, don't just give up. Give up kicking their ass all the way out the door."}, {"Time_Start": 3114.14, "Time_End": 3116.54, "Text": " So that's what the kind of places they work at."}, {"Time_Start": 3116.92, "Time_End": 3119.14, "Text": " So they dropped the case immediately."}, {"Time_Start": 3119.7799999999997, "Time_End": 3124.54, "Text": " Now, the Boston Globe, the way I found out that people read the Boston Globe was I got a call from my dad."}, {"Time_Start": 3125.44, "Time_End": 3127.22, "Text": " I hadn't told my parents about this shit."}, {"Time_Start": 3130.2599999999998, "Time_End": 3134.5, "Text": " I got two letters. My parents had to divorce. One from my mother, one for my father."}, {"Time_Start": 3134.94, "Time_End": 3139.92, "Text": " My father said, hey, someone wrote to me and said you were in the Boston Globe for something."}, {"Time_Start": 3140.56, "Time_End": 3143.22, "Text": " He said you were a chip off the old block. What's up with that?"}, {"Time_Start": 3144.14, "Time_End": 3146.14, "Text": " Oops."}, {"Time_Start": 3146.14, "Time_End": 3153.14, "Text": " Um, and my mother said, I heard you were sued or something, but that you're a First Amendment martyr."}, {"Time_Start": 3153.14, "Time_End": 3155.14, "Text": " So I guess that's okay."}, {"Time_Start": 3155.14, "Time_End": 3158.14, "Text": " Complete different thing."}, {"Time_Start": 3158.14, "Time_End": 3165.14, "Text": " So, so then I finally, it's nicer to be able to tell your parents about the lawsuit that just happened as opposed to the one that's about to happen."}, {"Time_Start": 3165.14, "Time_End": 3166.14, "Text": " So that was nice."}, {"Time_Start": 3166.14, "Time_End": 3168.14, "Text": " Now, they dropped it."}, {"Time_Start": 3168.14, "Time_End": 3172.14, "Text": " Now we're out, by that time, I think we're out $19,000."}, {"Time_Start": 3172.14, "Time_End": 3174.12, "Text": " Um,"}, {"Time_Start": 3174.14, "Time_End": 3177.64, "Text": " for this action, all these sets of actions."}, {"Time_Start": 3177.64, "Time_End": 3181.2599999999998, "Text": " So, you know, people were like, yeah, dude, you won, and everything."}, {"Time_Start": 3181.2599999999998, "Time_End": 3183.1, "Text": " It's like, I didn't really win."}, {"Time_Start": 3183.1, "Time_End": 3186.14, "Text": " I bought a suburban minivan and drove it off a cliff."}, {"Time_Start": 3190.14, "Time_End": 3194.14, "Text": " You know, I mean, it was hardly a great, you know, a great, wondrous thing."}, {"Time_Start": 3194.14, "Time_End": 3201.14, "Text": " A month later, oh, two days later, they allow access to my site again."}, {"Time_Start": 3201.14, "Time_End": 3203.14, "Text": " They open it up, the firewall."}, {"Time_Start": 3203.14, "Time_End": 3207.14, "Text": " up the firewall because they had never changed the host name since this happened."}, {"Time_Start": 3207.14, "Time_End": 3209.14, "Text": " They opened it up."}, {"Time_Start": 3209.14, "Time_End": 3212.14, "Text": " The next day, they also, I use the thing called domain surfer, type in a word,"}, {"Time_Start": 3212.14, "Time_End": 3213.14, "Text": " and see every domain with that word."}, {"Time_Start": 3213.14, "Time_End": 3214.14, "Text": " I happen to type in HarvardNet."}, {"Time_Start": 3214.14, "Time_End": 3217.14, "Text": " They had registered 36 anti-HarvardNet names."}, {"Time_Start": 3217.14, "Time_End": 3218.14, "Text": " H-net is a joke."}, {"Time_Start": 3218.14, "Time_End": 3221.14, "Text": " H-net sucks, H-net blows, H-net, whatever."}, {"Time_Start": 3221.14, "Time_End": 3224.14, "Text": " Like they'd registered, you know, comnet org of everything."}, {"Time_Start": 3224.14, "Time_End": 3228.14, "Text": " They spent like three, four grand registering every anti-Harvard net name"}, {"Time_Start": 3228.14, "Time_End": 3229.14, "Text": " they could come up with."}, {"Time_Start": 3229.14, "Time_End": 3231.14, "Text": " That was kind of odd."}, {"Time_Start": 3231.14, "Time_End": 3232.14, "Text": " Um..."}, {"Time_Start": 3232.14, "Time_End": 3233.14, "Text": " And..."}, {"Time_Start": 3233.14, "Time_End": 3241.7999999999997, "Text": " And, let's see, two weeks later, they laid off 200 people, which we all knew was going to happen."}, {"Time_Start": 3242.08, "Time_End": 3243.14, "Text": " They were a DSL company."}, {"Time_Start": 3243.74, "Time_End": 3248.94, "Text": " And they did it, laying everyone off going, you know, everything's going, you know, the DSO company is going downhill as opposed to do."}, {"Time_Start": 3248.98, "Time_End": 3249.44, "Text": " Everything sucks."}, {"Time_Start": 3249.48, "Time_End": 3249.8799999999997, "Text": " What's up, man?"}, {"Time_Start": 3250.48, "Time_End": 3251.24, "Text": " Got to wrap it up?"}, {"Time_Start": 3251.3399999999997, "Time_End": 3251.56, "Text": " Okay."}, {"Time_Start": 3253.0, "Time_End": 3256.94, "Text": " Basically, when I came, what I came away from this thing was bitter."}, {"Time_Start": 3257.94, "Time_End": 3262.74, "Text": " I came away from this not really enjoying the entire experience, but one thing I did learn was"}, {"Time_Start": 3262.7400000000002, "Time_End": 3268.84, "Text": " every action you do, there is a certain group of people out there who have no humor,"}, {"Time_Start": 3269.2000000000003, "Time_End": 3274.1000000000004, "Text": " who are paid to make you unhappy, who will do anything a large corporation tells them to."}, {"Time_Start": 3274.4, "Time_End": 3279.1200000000003, "Text": " So when you do an action, you're not just, what's the word, you're not just working in a vacuum"}, {"Time_Start": 3279.1200000000003, "Time_End": 3279.84, "Text": " and isn't it funny?"}, {"Time_Start": 3280.28, "Time_End": 3282.26, "Text": " And the other thing is, you got to lose the myopia."}, {"Time_Start": 3282.6400000000003, "Time_End": 3285.9, "Text": " You got to go, they're going to know, I'm just sending a few pings out through UDP."}, {"Time_Start": 3285.9, "Time_End": 3286.92, "Text": " Who gives this shit?"}, {"Time_Start": 3287.7200000000003, "Time_End": 3291.6200000000003, "Text": " You know, they're going to go, what are you talking about?"}, {"Time_Start": 3291.78, "Time_End": 3292.7200000000003, "Text": " Why are you not in jail?"}, {"Time_Start": 3292.7400000000002, "Time_End": 3296.46, "Text": " now? And the thing that really most bothered me was a couple people I'd say, yeah, I ran"}, {"Time_Start": 3296.46, "Time_End": 3300.78, "Text": " HarvardNetSucks.com, and they go, and I go, I got sued, and people go, yeah, of course."}, {"Time_Start": 3301.9, "Time_End": 3307.0800000000004, "Text": " You know, and on a certain level, it's like, you know, people just go, well, of course you said they"}, {"Time_Start": 3307.0800000000004, "Time_End": 3312.1200000000003, "Text": " sucks. Of course they should sue you. You know, and that kind of opinion was something I had to"}, {"Time_Start": 3312.1200000000003, "Time_End": 3316.2000000000003, "Text": " heavily, heavily fight against. And one last thing I did want to mention, because I didn't mention"}, {"Time_Start": 3316.2000000000003, "Time_End": 3322.28, "Text": " it during the thing. My entire court case, as a result of its technical aspects, was fought as a"}, {"Time_Start": 3322.28, "Time_End": 3352.26, "Text": " metaphor. And that is the most frustrating aspect of my entire case. I had to sit as two lawyers, my lawyer and their lawyer, talked in metaphors. They never said the firewall. The firewall is like putting the home address of HarvardNet up on a billboard for everyone to see as they drive by. And my lawyer had to respond with her metaphor. And then they would immediately respond in highly technical fashions to the metaphor. You know, well, bulletin boards by their very nature,"}, {"Time_Start": 3352.28, "Time_End": 3358.7200000000003, "Text": " our set as advertising. No. What we said was the fire, this is, this was our defense in case you need it."}, {"Time_Start": 3359.7200000000003, "Time_End": 3364.76, "Text": " The firewall, publishing the host name of a firewall is like telling people where Fort Knox is."}, {"Time_Start": 3367.02, "Time_End": 3372.6600000000003, "Text": " They'd rather you not know, but you're not going to get the gold bars based on that."}, {"Time_Start": 3374.44, "Time_End": 3379.48, "Text": " So just, you know, this is, this was us sweating for hours trying to come up with, how do you say it like that?"}, {"Time_Start": 3379.48, "Time_End": 3386.6, "Text": " And, you know, the courts are nowhere near where we are in terms of, like, technical knowledge, which, in fact, is a good thing."}, {"Time_Start": 3386.8, "Time_End": 3392.1, "Text": " Because if you ever, one of the things you do when you're sitting in the court case is you get to sit through a highly technical plumbing case."}, {"Time_Start": 3393.12, "Time_End": 3396.9, "Text": " I don't give a shit about plumbing or contracting. That was one."}, {"Time_Start": 3396.98, "Time_End": 3403.8, "Text": " There was one that was like the fifth year of an accident. This woman had been in. Her husband hadn't even shown up to this one."}, {"Time_Start": 3403.86, "Time_End": 3408.66, "Text": " He'd broken a leg five years ago. They were trying to get four grand. They were settling for one."}, {"Time_Start": 3408.66, "Time_End": 3414.24, "Text": " after five years, and of that, no, they had, no, it was they had 12 grand that was coming to them,"}, {"Time_Start": 3414.3199999999997, "Time_End": 3416.2999999999997, "Text": " of which 11,000 was going to legal fees."}, {"Time_Start": 3417.3799999999997, "Time_End": 3421.02, "Text": " You know, so this kind of crap is happening to everyone, not just us."}, {"Time_Start": 3421.42, "Time_End": 3425.02, "Text": " Anyway, so there's my entire legal narrative."}, {"Time_Start": 3425.8199999999997, "Time_End": 3427.02, "Text": " Don't go to court with it."}, {"Time_Start": 3427.52, "Time_End": 3428.8999999999996, "Text": " Just think about it."}, {"Time_Start": 3429.02, "Time_End": 3430.0, "Text": " Anyway, there you go."}]}