{"segments": [{"Time_Start": 0.0, "Time_End": 21.0, "Text": " I'm proud to see as many people as I do here."}, {"Time_Start": 21.0, "Time_End": 25.5, "Text": " You are obviously the hardcore who are both awake and have not left after checkout time."}, {"Time_Start": 25.5, "Time_End": 29.5, "Text": " So thank you for coming."}, {"Time_Start": 29.5, "Time_End": 34.4, "Text": " So basically, my talk today is on 8-bit microcontrollers."}, {"Time_Start": 34.4, "Time_End": 36.9, "Text": " I'll be going over a bunch of different aspects of them."}, {"Time_Start": 36.9, "Time_End": 38.9, "Text": " It's kind of a shotgun presentation."}, {"Time_Start": 38.9, "Time_End": 44.0, "Text": " I am Phil King, and the reason I might have something useful to say about this is because"}, {"Time_Start": 44.0, "Time_End": 48.8, "Text": " I'm a hardware engineer who's been designing with these things on and off for over a decade now."}, {"Time_Start": 48.8, "Time_End": 53.2, "Text": " I am also an enthusiast who's building all sorts of weird things at any given time,"}, {"Time_Start": 53.2, "Time_End": 59.0, "Text": " and I actually have taught a course on this stuff, so I picked up some idea of what to present."}, {"Time_Start": 59.0, "Time_End": 66.0, "Text": " The forum here is really different than I'm used to, so there will be glitches and I ask you to indulge me."}, {"Time_Start": 66.0, "Time_End": 69.0, "Text": " If there's anything you need to know, please raise your hand."}, {"Time_Start": 69.0, "Time_End": 73.0, "Text": " I will be taking questions throughout, but I also have a Q&A period at the end."}, {"Time_Start": 73.0, "Time_End": 81.0, "Text": " And the reason you should be, you should be interesting what I have to say is because we've got some really neat stuff you can do with 8-bit systems, 8-bit microcontrollers,"}, {"Time_Start": 81.0, "Time_End": 83.0, "Text": " and of course free stuff."}, {"Time_Start": 83.0, "Time_End": 85.0, "Text": " Since that's always, yeah."}, {"Time_Start": 85.0, "Time_End": 88.98, "Text": " I'll be getting, he asks over the notes and notes and"}, {"Time_Start": 89.0, "Time_End": 94.32, "Text": " slides available online. They aren't yet, they will be, and the URL is at the end of the presentation."}, {"Time_Start": 94.32, "Time_End": 99.26, "Text": " So they will be available. You don't need to write all this crap down."}, {"Time_Start": 99.26, "Time_End": 102.18, "Text": " With regard to getting free stuff, since that's what you're all wondering about since I mentioned"}, {"Time_Start": 102.18, "Time_End": 110.5, "Text": " that last. The free stuff specifically is an ATML STK 100 starter kit. They are these things, this"}, {"Time_Start": 110.5, "Time_End": 115.0, "Text": " is the hardware that I have developed this presentation around. They're a really slick little kit."}, {"Time_Start": 115.0, "Time_End": 118.98, "Text": " I don't even know off the top of my head what the price of these things is. Retail, I think they're about"}, {"Time_Start": 119.0, "Time_End": 123.14, "Text": " 150, but I've got some of them to give away, and there's two different ways to get one."}, {"Time_Start": 123.14, "Time_End": 129.12, "Text": " You can either suggest a project idea during the Q&A period, in which case we will be prepared"}, {"Time_Start": 129.12, "Time_End": 136.08, "Text": " to elaborate and I'd like to discuss ideas, and I may or may not invoke the audience to give you"}, {"Time_Start": 136.08, "Time_End": 141.66, "Text": " the thumbs up or thumbs down on whether your idea merits a starter kit. And then the other way"}, {"Time_Start": 141.66, "Time_End": 146.0, "Text": " is to get a starter kit by submitting a feedback form with a project idea, and this is if you're"}, {"Time_Start": 146.0, "Time_End": 148.98, "Text": " not willing to hold your project up to public humiliation,"}, {"Time_Start": 149.0, "Time_End": 152.44, "Text": " feel free to write down the feedback information at the end."}, {"Time_Start": 152.44, "Time_End": 158.04, "Text": " This is basically the way I bribe my audience to give me recommendations on how to make these talks better."}, {"Time_Start": 158.04, "Time_End": 162.0, "Text": " I've been doing variations on this for a while now and hopefully it's evolving and getting better,"}, {"Time_Start": 162.0, "Time_End": 167.8, "Text": " but if it sucks, I need to know that."}, {"Time_Start": 167.8, "Time_End": 169.56, "Text": " So specifically what am I going to hit on?"}, {"Time_Start": 169.56, "Time_End": 171.16, "Text": " I'm going to hit on what are microcontrollers."}, {"Time_Start": 171.16, "Time_End": 176.2, "Text": " Presumably if you're here, you have a pretty good idea what that is, so I'm not going to dwell on that real long."}, {"Time_Start": 176.2, "Time_End": 178.52, "Text": " Why am I focusing on the tiny ones?"}, {"Time_Start": 178.52, "Time_End": 183.3, "Text": " talk title is eight pins and eight bits and I'll get into what exactly that means in terms"}, {"Time_Start": 183.3, "Time_End": 187.92000000000002, "Text": " of the starter kit shortly. What can they do? What exactly functionality do you have in"}, {"Time_Start": 187.92000000000002, "Time_End": 191.64000000000001, "Text": " these things? What are the development tools, both what am I using and what if you want"}, {"Time_Start": 191.64000000000001, "Time_End": 196.92000000000002, "Text": " to be using something else? And then I'll do a bunch of application examples. I don't have"}, {"Time_Start": 196.92000000000002, "Time_End": 201.36, "Text": " specific demonstrations of most of the application examples because a lot of them are derived from"}, {"Time_Start": 201.36, "Time_End": 205.0, "Text": " other people's projects, application notes, things like that, and instead I look at them"}, {"Time_Start": 205.0, "Time_End": 208.5, "Text": " in terms of putting them on this hardware and what you would want to do to do to do to do to"}, {"Time_Start": 208.52, "Time_End": 215.14000000000001, "Text": " adapt them to your needs. And then finally, the Q&A period at the end. Always got to have"}, {"Time_Start": 215.14000000000001, "Time_End": 222.66000000000003, "Text": " one of those. Okay, so what exactly is a microintroller? Some of you are actually old enough"}, {"Time_Start": 222.66000000000003, "Time_End": 232.20000000000002, "Text": " to have started out working like I did on 8-bit computers before Intel ruled the world."}, {"Time_Start": 232.20000000000002, "Time_End": 238.5, "Text": " Was that a 4? A 4-bit? Impressive. But there was a time when 8-bit was what you"}, {"Time_Start": 238.52, "Time_End": 245.28, "Text": " got, at least in anything that had a single-piece processor. Now most 8-bit"}, {"Time_Start": 245.28, "Time_End": 250.62, "Text": " processors, which by the way still represent the largest market share in terms of number"}, {"Time_Start": 250.62, "Time_End": 255.62, "Text": " of CPU core shipping, are found almost entirely in microcontrollers, which is an 8-bit CPU"}, {"Time_Start": 255.62, "Time_End": 261.8, "Text": " core together with a bunch of resources stuck around it. And the common canonical examples are"}, {"Time_Start": 261.8, "Time_End": 267.62, "Text": " memory, for example, some ROM or Flash or E-Prom ports, which are programmable I.O."}, {"Time_Start": 267.62, "Time_End": 272.56, "Text": " where they've generally taken all of the internal busing to the processor, kept it in the chip,"}, {"Time_Start": 272.56, "Time_End": 276.82, "Text": " and then they give you some ports out to PIN so you can twiddle individual electrical connections"}, {"Time_Start": 276.82, "Time_End": 284.02, "Text": " as I.O. ports rather than dealing with them as memory mapped I.O. And then a variety of peripherals,"}, {"Time_Start": 284.02, "Time_End": 290.74, "Text": " depending on what you're using. I mentioned timer, interrupt controller. These are sort of the basic ones."}, {"Time_Start": 290.74, "Time_End": 294.78000000000003, "Text": " Larger microcontrollers will have more. I'm dealing with really, really small ones."}, {"Time_Start": 294.78000000000003, "Time_End": 297.26, "Text": " And then generally a microcontroller is a self-contained architecture,"}, {"Time_Start": 297.26, "Time_End": 301.15999999999997, "Text": " requiring only a few other components, or in the case of some of these parts, literally"}, {"Time_Start": 301.15999999999997, "Time_End": 307.08, "Text": " no other components to build a system. So why am I so obsessed with the tiny ones, little"}, {"Time_Start": 307.08, "Time_End": 312.65999999999997, "Text": " eight-pin, eight-bit jobbies? First of all, because we can, it's really cool to see what you"}, {"Time_Start": 312.65999999999997, "Time_End": 317.65999999999997, "Text": " can do with a part that has only eight wires coming out of it. Also, learning to make use of minimal"}, {"Time_Start": 317.65999999999997, "Time_End": 322.03999999999996, "Text": " resources. There are some folks in the demo crowd who know that 1K has a lot of program"}, {"Time_Start": 322.03999999999996, "Time_End": 327.24, "Text": " space, but there are a lot of people who have gotten away from the roots, and it's, and it's"}, {"Time_Start": 327.26, "Time_End": 332.38, "Text": " it's fun to see what you can do in a very small, very small package, both in terms of physically"}, {"Time_Start": 332.38, "Time_End": 336.96, "Text": " and in terms of code space. And then minimal wiring, and I put that up kind of as a joke,"}, {"Time_Start": 336.96, "Time_End": 341.02, "Text": " but when you've only got eight pins, there's just not that much wire you're going to need."}, {"Time_Start": 341.02, "Time_End": 344.76, "Text": " And if you hate soldering things together, or you hate wire wrapping, this is a good way to keep"}, {"Time_Start": 344.76, "Time_End": 351.82, "Text": " the wire count down. So what are some of these interesting minimal systems? And one category"}, {"Time_Start": 351.82, "Time_End": 355.94, "Text": " I sort of synthetically lumped a lot of them into is implants, which are things you want it to be"}, {"Time_Start": 355.94, "Time_End": 359.94, "Text": " small enough that you can put it places, people won't notice it, that it's unobtrusive,"}, {"Time_Start": 359.94, "Time_End": 364.94, "Text": " or that it fits inside some existing system. So bugs or portable stuff."}, {"Time_Start": 364.94, "Time_End": 370.94, "Text": " Another, essentially, arguably an implant also, but a separate category is mod chips."}, {"Time_Start": 370.94, "Time_End": 375.94, "Text": " And I will sort of glance over that, but I know that's of interest to at least some of this crowd."}, {"Time_Start": 375.94, "Time_End": 380.94, "Text": " And then telemetry devices, one of the things that came out in the project discussions last year,"}, {"Time_Start": 380.94, "Time_End": 385.88, "Text": " is a lot of people said, I want to build a telemetry widget for blah. And so that's a"}, {"Time_Start": 385.94, "Time_End": 392.94, "Text": " really good application for a really small controller where you want to collect a few bits of data and either log it or send it off over a link somehow."}, {"Time_Start": 392.94, "Time_End": 396.94, "Text": " And so what are the 8-pin microcontrollers?"}, {"Time_Start": 396.94, "Time_End": 402.94, "Text": " If you look at the whole family, the ones that I have been able to track down, there may be others I have overlooked."}, {"Time_Start": 402.94, "Time_End": 405.94, "Text": " If so, I apologize, and feel free to add them to the heap."}, {"Time_Start": 405.94, "Time_End": 411.94, "Text": " But the common ones available now are the Atmel, AT Tiny Series, and a couple of the other AT series."}, {"Time_Start": 411.94, "Time_End": 415.92, "Text": " And then the microchip pick, 12C, and I believe,"}, {"Time_Start": 415.94, "Time_End": 419.94, "Text": " they've just come out with an 8-pin version of either the 14 or the 16C."}, {"Time_Start": 419.94, "Time_End": 422.94, "Text": " There are also, that's why I said there's a few other picks."}, {"Time_Start": 422.94, "Time_End": 425.94, "Text": " I'm going to be focusing on the ATML AVRs."}, {"Time_Start": 425.94, "Time_End": 430.94, "Text": " Like so many things in this world, your choice of processor, your choice of microcontroller,"}, {"Time_Start": 430.94, "Time_End": 432.94, "Text": " rapidly becomes a religious topic."}, {"Time_Start": 432.94, "Time_End": 438.94, "Text": " I like the AVR because it's got some neat features and because I can get free development hardware for him."}, {"Time_Start": 438.94, "Time_End": 441.94, "Text": " Yeah, the pick is also a good part."}, {"Time_Start": 441.94, "Time_End": 444.94, "Text": " A lot of people have a lot of experience with the pick, but I'm just going to be here."}, {"Time_Start": 444.94, "Time_End": 450.94, "Text": " but I'm just going to be running off on the AVR and showing you what you can do with this board."}, {"Time_Start": 450.94, "Time_End": 454.94, "Text": " So the common features to the AVR architecture, whether they're the APN or not,"}, {"Time_Start": 454.94, "Time_End": 457.94, "Text": " are that it's a risk instruction set."}, {"Time_Start": 457.94, "Time_End": 462.94, "Text": " The closest you may have run into if you haven't done microcontroller development is MIPS,"}, {"Time_Start": 462.94, "Time_End": 465.94, "Text": " the MIPS risk instruction set."}, {"Time_Start": 465.94, "Time_End": 470.94, "Text": " It's a Harvard architecture, meaning that you have separate code and data space."}, {"Time_Start": 470.94, "Time_End": 474.94, "Text": " There's 32 general purpose registers, although as with most,"}, {"Time_Start": 474.94, "Time_End": 478.94, "Text": " 32 general purpose register sets, they're not all quite general."}, {"Time_Start": 478.94, "Time_End": 481.94, "Text": " And then there's a status register, and then there's a set of I.O."}, {"Time_Start": 481.94, "Time_End": 483.94, "Text": " Registers that vary from part to part."}, {"Time_Start": 483.94, "Time_End": 487.94, "Text": " But every one of them has a block of IOS space."}, {"Time_Start": 487.94, "Time_End": 491.94, "Text": " Some of the features of the risk instruction set that make it really good,"}, {"Time_Start": 491.94, "Time_End": 496.94, "Text": " even for a small application like this, is simple fixed-length instructions."}, {"Time_Start": 496.94, "Time_End": 501.94, "Text": " In the AVR instruction set, virtually everything is a 16-bit word,"}, {"Time_Start": 501.94, "Time_End": 504.94, "Text": " which means that when you get the pipeline, the application,"}, {"Time_Start": 504.94, "Time_End": 510.82, "Text": " execution pipeline full, they're able to click along at one cycle per instruction."}, {"Time_Start": 510.82, "Time_End": 514.48, "Text": " If you've done any development with, say, in 8051, depending on the implementation, the"}, {"Time_Start": 514.48, "Time_End": 519.6, "Text": " 8051 will run up to 12 cycles per instruction, which really starts to bog it down."}, {"Time_Start": 519.6, "Time_End": 527.02, "Text": " It's nice that you can run an AVR at 1 megahertz and get, in the best possible case, one"}, {"Time_Start": 527.02, "Time_End": 529.06, "Text": " MIPS out of it."}, {"Time_Start": 529.06, "Time_End": 532.02, "Text": " And then it's a load store architecture, meaning that anything you want to manipulate, you"}, {"Time_Start": 532.02, "Time_End": 534.92, "Text": " drag into a register, you twiddle it, you shove it back out, there are no direct"}, {"Time_Start": 534.94, "Time_End": 538.3800000000001, "Text": " direct operations on memory."}, {"Time_Start": 538.3800000000001, "Time_End": 543.2600000000001, "Text": " Some of the general purpose register oddities, I mentioned that they're not all quite equal."}, {"Time_Start": 543.2600000000001, "Time_End": 549.2600000000001, "Text": " If you do a load from data in program space, and that may sound a lot, but there's a special"}, {"Time_Start": 549.2600000000001, "Time_End": 554.84, "Text": " instruction called LPM for loading constants that you've stored in your flash code space,"}, {"Time_Start": 554.84, "Time_End": 558.4000000000001, "Text": " they get explicitly loaded to R0, that's hardwired into it."}, {"Time_Start": 558.4000000000001, "Time_End": 562.0, "Text": " If you do a load immediate, because of the way the instruction is set up, if you think about"}, {"Time_Start": 562.0, "Time_End": 564.9200000000001, "Text": " it, you've got 16 bits for this instruction word."}, {"Time_Start": 564.94, "Time_End": 569.5, "Text": " If you're doing a load immediate, eight of them are taken up with the immediate value, and some"}, {"Time_Start": 569.5, "Time_End": 570.98, "Text": " of them have to be for the op."}, {"Time_Start": 570.98, "Time_End": 574.7600000000001, "Text": " They wanted four of them for the app, which means they've only got four bits left over for"}, {"Time_Start": 574.7600000000001, "Time_End": 579.7600000000001, "Text": " the register description, which means that you can actually only address 16 registers for immediate"}, {"Time_Start": 579.7600000000001, "Time_End": 582.2600000000001, "Text": " instruction, so they arbitrarily chose the upper half of the register set."}, {"Time_Start": 582.2600000000001, "Time_End": 585.6600000000001, "Text": " So you get R16 to R31 if you want to do a load immediate."}, {"Time_Start": 585.6600000000001, "Time_End": 588.84, "Text": " You cannot load immediate into R0 to R15."}, {"Time_Start": 588.84, "Time_End": 593.8000000000001, "Text": " And then there are several two register indices that are set up."}, {"Time_Start": 593.8000000000001, "Time_End": 594.9200000000001, "Text": " In the case of the"}, {"Time_Start": 594.94, "Time_End": 600.0400000000001, "Text": " the small parts, the only one that they implement is the Z index, which is the concatenation"}, {"Time_Start": 600.0400000000001, "Time_End": 603.6600000000001, "Text": " of R30 and R31."}, {"Time_Start": 603.6600000000001, "Time_End": 609.5400000000001, "Text": " To give you an idea of how this stuff all maps together, there is data space which has the"}, {"Time_Start": 609.5400000000001, "Time_End": 615.74, "Text": " register file also at the top of data space, which means you can access registers by doing"}, {"Time_Start": 615.74, "Time_End": 620.3000000000001, "Text": " memory access, and you can treat the registers as a block of S-RAM, which is useful because some"}, {"Time_Start": 620.3000000000001, "Time_End": 624.8800000000001, "Text": " of the parts have no other S-RAM, and in fact you've only got 32 bytes of S-RAM in the"}, {"Time_Start": 624.94, "Time_End": 626.94, "Text": " register file."}, {"Time_Start": 626.94, "Time_End": 629.58, "Text": " You can also, and then they also map the I.O."}, {"Time_Start": 629.58, "Time_End": 632.7, "Text": " Registers, which have their own sort of pseudo I.O."}, {"Time_Start": 632.7, "Time_End": 635.0, "Text": " space immediately after the register file."}, {"Time_Start": 635.0, "Time_End": 642.1800000000001, "Text": " So on all of the AVR parts, the data address space is known to be the first,"}, {"Time_Start": 642.1800000000001, "Time_End": 647.7800000000001, "Text": " the first 0 to 1F is going to be your register file, and 20 to 5F is going to be your IO space."}, {"Time_Start": 647.7800000000001, "Time_End": 650.6400000000001, "Text": " If SRM, if there is any, begins after that."}, {"Time_Start": 650.6400000000001, "Time_End": 654.9200000000001, "Text": " External SRAM, if the chip supports any, and none of these do, some of the larger ones"}, {"Time_Start": 654.94, "Time_End": 658.94, "Text": " happens after that."}, {"Time_Start": 658.94, "Time_End": 665.0600000000001, "Text": " So the specific features of the AT Tiny 11, the part that we're looking at, are it's an 8-pin"}, {"Time_Start": 665.0600000000001, "Time_End": 667.74, "Text": " dip or SOIC package."}, {"Time_Start": 667.74, "Time_End": 670.08, "Text": " I don't, I have some pictures later on."}, {"Time_Start": 670.08, "Time_End": 672.86, "Text": " I don't know if everyone here is familiar with an 8-pin dip."}, {"Time_Start": 672.86, "Time_End": 675.0600000000001, "Text": " It's a really standard package."}, {"Time_Start": 675.0600000000001, "Time_End": 676.5200000000001, "Text": " It's relatively small."}, {"Time_Start": 676.5200000000001, "Time_End": 680.22, "Text": " If you want it smaller, you can go to the surface mount SOIC."}, {"Time_Start": 680.22, "Time_End": 684.2600000000001, "Text": " There are six I-O lines available, or actually I should say 5 I-O and one input if you disable the"}, {"Time_Start": 684.26, "Time_End": 689.34, "Text": " you disable the reset. If you think about it, that means you've got 6 I.O. and power and ground."}, {"Time_Start": 689.34, "Time_End": 694.58, "Text": " So it's making good use of its pins. And then in this particular part, you've got 1K byte"}, {"Time_Start": 694.58, "Time_End": 699.96, "Text": " of code flash because it's a 16-bit instruction word, that's 512 instruction words. And some"}, {"Time_Start": 699.96, "Time_End": 703.5, "Text": " of you are thinking, what can you possibly do with 512 words? Some of you are probably thinking,"}, {"Time_Start": 703.5, "Time_End": 709.3199999999999, "Text": " why? Well, that's a ton of space. The truth lies somewhere in the middle, and I'll touch on"}, {"Time_Start": 709.3199999999999, "Time_End": 713.86, "Text": " some of the cool things you can do in a relatively small space when I'm talking about the feature,"}, {"Time_Start": 713.86, "Time_End": 721.3000000000001, "Text": " applications. More features. There's a variety of speed grades available"}, {"Time_Start": 721.3000000000001, "Time_End": 728.44, "Text": " for the AT Tiny 11 and you can sort of map into a space of what power and speed"}, {"Time_Start": 728.44, "Time_End": 733.24, "Text": " performance you want. You can run them up to 6 megahertz. The AT Tiny 11 specifically"}, {"Time_Start": 733.24, "Time_End": 738.82, "Text": " comes in speed grades up to 6 megahertz at 5 volts and then in lower voltage versions that"}, {"Time_Start": 738.82, "Time_End": 743.84, "Text": " run for example down to 2.7 volts at 2 megahertz. Another nice thing about this is"}, {"Time_Start": 743.86, "Time_End": 748.2, "Text": " is it's a fully static CMOS implementation, meaning that you can actually run the clock"}, {"Time_Start": 748.2, "Time_End": 753.36, "Text": " all the way down to zero. It's got a couple of standby power modes that will turn itself off,"}, {"Time_Start": 753.36, "Time_End": 759.84, "Text": " and it can also be set to wake on interrupt, which means you can, if you know the next behavior"}, {"Time_Start": 759.84, "Time_End": 763.22, "Text": " the system wants to respond to is something outside of itself, it can actually just put itself"}, {"Time_Start": 763.22, "Time_End": 767.26, "Text": " to sleep, and it will wake up on an external interrupt, and you can drop the power consumption"}, {"Time_Start": 767.26, "Time_End": 773.84, "Text": " down to a few microamps. And then even when it's running relatively fast, it's fairly"}, {"Time_Start": 773.86, "Time_End": 793.86, "Text": " low power. And then I quote the data sheet at less than 5 milliams at 1 megahertz at 5 volts. If you bring the voltage down, you can bring the power down within reason. There's some other implications to running the voltage at different levels, and I'll touch on those briefly later."}, {"Time_Start": 795.86, "Time_End": 803.84, "Text": " It also has a whole bunch of different clocking options, and this is kind of cool as well, because when you're building a minimal system, you don't want to have to hang an oscillator off this thing. You can't"}, {"Time_Start": 803.86, "Time_End": 810.1, "Text": " You can externally clock it. You can stick an external crystal, and it actually has an oscillator amplifier circuit built into it."}, {"Time_Start": 810.62, "Time_End": 815.74, "Text": " In that case, you burn two of your eight pins just sticking a crystal on it. If you only need four, that's fine."}, {"Time_Start": 817.1, "Time_End": 823.26, "Text": " If you want to hook an external oscillator up to it, you can do it with only one pin. In that case, it's just the input, the clock input."}, {"Time_Start": 823.72, "Time_End": 826.92, "Text": " You can also do it with zero pins with the onboard RC oscillatorator."}, {"Time_Start": 827.64, "Time_End": 833.4200000000001, "Text": " The upside is it takes zero pins, and it runs at one megahertz at five volts, although it runs at 300,"}, {"Time_Start": 833.86, "Time_End": 859.54, "Text": " 150 kilohertz at 3 volts, it runs at 110 kilohertz at 2 volts, it runs at 1.1 megahertz at 0 degrees Celsius, it runs at 900 kilohertz at 70 degrees Celsius. In other words, it's not regulated. It's going to drift all over the place. If you've got an application where you're only interacting with people, this is okay. If you've got an application where you're doing asynchronous serial communication, you may want a more stable clock."}, {"Time_Start": 860.1, "Time_End": 863.54, "Text": " The AT12 part, for example, has a calibrated."}, {"Time_Start": 863.86, "Time_End": 870.3000000000001, "Text": " oscillator on board, and they actually tested at the factory and guarantee the constraint of that 1 megahertz RC oscillator."}, {"Time_Start": 870.6, "Time_End": 872.72, "Text": " On the AT-timey-11, it's going to drift all over the place."}, {"Time_Start": 875.34, "Time_End": 881.6800000000001, "Text": " And the specific microcontroller resources they've stuck on this particular part are a hardware watchdog timer."}, {"Time_Start": 882.48, "Time_End": 888.5600000000001, "Text": " In this case, they actually run the watchdog timer off the same oscillator as the self-clocking RC circuit."}, {"Time_Start": 888.66, "Time_End": 893.82, "Text": " So the watchdog runs at 1 megahertz, and you can divide that down by any of a whole bunch of pre-scale values."}, {"Time_Start": 893.86, "Time_End": 895.92, "Text": " and, or you can disable it."}, {"Time_Start": 896.14, "Time_End": 902.44, "Text": " If it's on and your system has turned on the watchdog and fails to kick it before it times out,"}, {"Time_Start": 902.74, "Time_End": 904.38, "Text": " the watchdog will trigger a reset."}, {"Time_Start": 905.28, "Time_End": 908.96, "Text": " This is useful if you're building a system that you're afraid might go brain damage."}, {"Time_Start": 909.2, "Time_End": 913.66, "Text": " It's also useful if you're building a system where you want to be able to time out on confusion,"}, {"Time_Start": 913.66, "Time_End": 914.92, "Text": " and I'll touch on that later."}, {"Time_Start": 915.5, "Time_End": 919.04, "Text": " There's actually some good software system reasons you might want a watchdog timer."}, {"Time_Start": 919.46, "Time_End": 920.86, "Text": " It's got an 8-bit counter timer."}, {"Time_Start": 921.44, "Time_End": 923.84, "Text": " It's a counter when you use it to use it to."}, {"Time_Start": 923.86, "Time_End": 929.14, "Text": " When you trigger it based on an input pin, it's a timer when you hook it up to the clock,"}, {"Time_Start": 929.74, "Time_End": 933.7, "Text": " and you can use this for doing all sorts of real-time or quasi-real-time applications."}, {"Time_Start": 934.42, "Time_End": 943.46, "Text": " There is an analog comparator, which allows you to tell, to get a single bit comparison of two analog inputs on two of your I.O. Pins."}, {"Time_Start": 943.9, "Time_End": 945.26, "Text": " It can also generate an interrupt."}, {"Time_Start": 945.26, "Time_End": 950.5, "Text": " So if you want to be monitoring an analog level and cause the system to wake up,"}, {"Time_Start": 950.54, "Time_End": 953.38, "Text": " you can actually trigger an analog comparator fire."}, {"Time_Start": 953.86, "Time_End": 957.54, "Text": " And then the interrupt controller, which hooks some of these together."}, {"Time_Start": 957.78, "Time_End": 959.22, "Text": " You have an external interrupt pin."}, {"Time_Start": 959.44, "Time_End": 962.42, "Text": " You've got an interrupt on any pin change."}, {"Time_Start": 962.54, "Time_End": 967.98, "Text": " You can actually cause the system to interrupt when any of the external pins change value."}, {"Time_Start": 968.44, "Time_End": 970.6800000000001, "Text": " So they can effectively all be used as interrupt."}, {"Time_Start": 970.92, "Time_End": 976.28, "Text": " Obviously, you've got to be careful because you could interrupt a lot if you've got that hooked up to a high-speed signal."}, {"Time_Start": 977.1, "Time_End": 979.98, "Text": " You've got timer counter overflow, and then you've got the analog comparator."}, {"Time_Start": 981.28, "Time_End": 982.82, "Text": " What does it not have?"}, {"Time_Start": 982.82, "Time_End": 987.6800000000001, "Text": " This is where the rubber meets the road on some of the eight-pins stuff."}, {"Time_Start": 988.1400000000001, "Time_End": 990.4200000000001, "Text": " It has no S-RAM beyond the general-purpose registers."}, {"Time_Start": 990.5400000000001, "Time_End": 995.58, "Text": " That means if you need more than 32 bytes to do anything, this is not the part for you."}, {"Time_Start": 995.82, "Time_End": 999.0200000000001, "Text": " It does not support any sort of external S-RAM."}, {"Time_Start": 999.1600000000001, "Time_End": 1001.88, "Text": " Obviously, with eight-pins, you're not going to have a real big address database database."}, {"Time_Start": 1003.0200000000001, "Time_End": 1008.6400000000001, "Text": " It also means that because there's no external S-Ram, the stack is three-deep, meaning it's really easy to blow it,"}, {"Time_Start": 1009.08, "Time_End": 1010.2800000000001, "Text": " and it's implemented in hardware."}, {"Time_Start": 1010.48, "Time_End": 1012.5600000000001, "Text": " So it's nine bits wide of custom hardware."}, {"Time_Start": 1012.82, "Time_End": 1016.82, "Text": " cannot explicitly push or pop anything into the stack only when you do calls will"}, {"Time_Start": 1016.82, "Time_End": 1019.82, "Text": " it stick the PC, the program counter into the stack."}, {"Time_Start": 1019.82, "Time_End": 1022.82, "Text": " Otherwise, the stack is effectively not there."}, {"Time_Start": 1022.82, "Time_End": 1026.8200000000002, "Text": " Also, if you do below the stack, it has the interesting behavior of wrapping around."}, {"Time_Start": 1026.8200000000002, "Time_End": 1034.8200000000002, "Text": " So if you do a call, call, call, call, you will have lost the first call return address"}, {"Time_Start": 1034.8200000000002, "Time_End": 1036.8200000000002, "Text": " and the fourth will now sit over the first."}, {"Time_Start": 1036.8200000000002, "Time_End": 1041.8200000000002, "Text": " It also has no hardware you are. One of the things I talk about a little bit later"}, {"Time_Start": 1041.82, "Time_End": 1044.82, "Text": " is implementing a software you are, which is really quite doable."}, {"Time_Start": 1044.82, "Time_End": 1048.32, "Text": " It has no E-E-Prom storage. That may seem a little non-sequitur,"}, {"Time_Start": 1048.32, "Time_End": 1052.82, "Text": " but many of the parts do have a small chunk, a third memory space that is E-E-Prom space"}, {"Time_Start": 1052.82, "Time_End": 1054.82, "Text": " for storing look-up tables, constants."}, {"Time_Start": 1054.82, "Time_End": 1057.82, "Text": " This is a non-volatile space, normally the part can write to."}, {"Time_Start": 1057.82, "Time_End": 1059.82, "Text": " In this case, it just isn't there."}, {"Time_Start": 1059.82, "Time_End": 1061.82, "Text": " And then there's no ATD converter."}, {"Time_Start": 1061.82, "Time_End": 1065.82, "Text": " You can add a serial ADD converter if you want, or if you really need that,"}, {"Time_Start": 1065.82, "Time_End": 1068.82, "Text": " use a part that has it, but this particular part doesn't."}, {"Time_Start": 1068.82, "Time_End": 1070.82, "Text": " What development tools am I using?"}, {"Time_Start": 1070.82, "Time_End": 1076.82, "Text": " tools am I using? The assembler of choice I use is Atmel AVR Studio, which is an"}, {"Time_Start": 1076.82, "Time_End": 1081.32, "Text": " integrated development environment with an editor and an assembler. It also includes a simulator,"}, {"Time_Start": 1081.32, "Time_End": 1085.62, "Text": " so you can actually simulate your code, obviously, within the constraints of not having"}, {"Time_Start": 1085.62, "Time_End": 1091.22, "Text": " the hardware in the system. If you're using the ABR Studio with this particular board,"}, {"Time_Start": 1091.22, "Time_End": 1095.62, "Text": " you have to use a separate ISP package in system programming, and that allows you to program"}, {"Time_Start": 1095.62, "Time_End": 1100.8, "Text": " through the parallel or serial port, and then the development hardware, as I talked about a little"}, {"Time_Start": 1100.82, "Time_End": 1104.82, "Text": " bit earlier is the SDK 100. I don't know why I'm holding it up, no one can see it."}, {"Time_Start": 1104.82, "Time_End": 1111.82, "Text": " In fact, I have a slide of it in just a second. There we go. There is what the board looks like."}, {"Time_Start": 1111.82, "Time_End": 1117.82, "Text": " You see the parallel port and zero port connections on the left side. You've got a prototyping area on the right."}, {"Time_Start": 1117.82, "Time_End": 1122.82, "Text": " The stack of sockets, the stack of sockets about midboard is where you plug in the various parts."}, {"Time_Start": 1122.82, "Time_End": 1128.82, "Text": " You can see it supports two flavors of eight-pin part and then a 20 and a 28 pin."}, {"Time_Start": 1128.82, "Time_End": 1130.8, "Text": " There's also a microcontroller on it that's, that's, that's,"}, {"Time_Start": 1130.82, "Time_End": 1131.82, "Text": " doing the system programming."}, {"Time_Start": 1131.82, "Time_End": 1132.82, "Text": " Yeah."}, {"Time_Start": 1132.82, "Time_End": 1136.24, "Text": " Are there any OS requirements from the development department?"}, {"Time_Start": 1136.24, "Time_End": 1141.62, "Text": " This particular OS only runs, or this particular development only runs under a rather unpopular OS."}, {"Time_Start": 1141.62, "Time_End": 1144.78, "Text": " There are other options, and I'll touch on that in just a minute."}, {"Time_Start": 1144.78, "Time_End": 1147.3799999999999, "Text": " The good question."}, {"Time_Start": 1147.3799999999999, "Time_End": 1153.76, "Text": " The white circular thing is actually a piezoelectric speaker that allows you to do sound output, and"}, {"Time_Start": 1153.76, "Time_End": 1158.1, "Text": " I'll touch on that as a neat application of these parts shortly."}, {"Time_Start": 1158.1, "Time_End": 1160.8, "Text": " And then another nice thing about this board is it has its own power,"}, {"Time_Start": 1160.82, "Time_End": 1166.6799999999998, "Text": " regulator built in, so you feed it basically 7 to 20 volts AC or DC, and it's any polarity"}, {"Time_Start": 1166.6799999999998, "Time_End": 1174.52, "Text": " of DC, and it's fine with that. As I mentioned, it's the 20 to 28 pins provides, oh, it also"}, {"Time_Start": 1174.52, "Time_End": 1181.82, "Text": " provides four LEDs and four buttons. The fifth LED and button were the power and reset, respectively."}, {"Time_Start": 1181.82, "Time_End": 1189.62, "Text": " And then there's various jumpers next to all of the, all of the sockets that allow you to turn on and off some of"}, {"Time_Start": 1189.6200000000001, "Time_End": 1194.88, "Text": " functionality. If you want to wire things out directly, the jumpers make great wire"}, {"Time_Start": 1194.88, "Time_End": 1204.3000000000002, "Text": " wrap posts. And then this is a really good system for getting a minimal development going."}, {"Time_Start": 1204.3000000000002, "Time_End": 1209.6000000000001, "Text": " But once you're going, it's also really easy to transition to a standalone device. And in fact,"}, {"Time_Start": 1209.6000000000001, "Time_End": 1215.5800000000002, "Text": " there's an ISP header at the top of the board. There's a header that allows you to use this board"}, {"Time_Start": 1215.5800000000002, "Time_End": 1219.6000000000001, "Text": " to in-system program your own part if you accommodate that in your design."}, {"Time_Start": 1219.6200000000001, "Time_End": 1221.38, "Text": " in an external board."}, {"Time_Start": 1221.38, "Time_End": 1224.38, "Text": " Oh, and one other thing, there's an IR transceiver pair on this thing,"}, {"Time_Start": 1224.38, "Time_End": 1226.8600000000001, "Text": " if you want to develop an IR remote control."}, {"Time_Start": 1226.8600000000001, "Time_End": 1230.6000000000001, "Text": " And I talk about that a little bit shortly."}, {"Time_Start": 1230.6000000000001, "Time_End": 1233.24, "Text": " Okay, so what if you hate this OS?"}, {"Time_Start": 1233.24, "Time_End": 1236.18, "Text": " Or what if you want, or why can't you see?"}, {"Time_Start": 1236.18, "Time_End": 1240.3200000000002, "Text": " Specifically cross-assemblers, and that's my preferred development tool,"}, {"Time_Start": 1240.3200000000002, "Time_End": 1242.48, "Text": " are available for pretty much any OS."}, {"Time_Start": 1242.48, "Time_End": 1244.16, "Text": " The assemblers are relatively simple to write."}, {"Time_Start": 1244.16, "Time_End": 1247.5800000000002, "Text": " One of the nice things that falls out of a risk architecture"}, {"Time_Start": 1247.5800000000002, "Time_End": 1249.6000000000001, "Text": " is the assemblers are pretty straightforward."}, {"Time_Start": 1249.6200000000001, "Time_End": 1252.0200000000002, "Text": " The ISP tools are also available."}, {"Time_Start": 1252.0200000000002, "Time_End": 1258.6200000000001, "Text": " I do not recall off the top of my head what the preferred Linux ISP or BSD ISP is."}, {"Time_Start": 1258.6200000000001, "Time_End": 1261.1200000000001, "Text": " I'll try to get pointers to those up on the website fairly quickly."}, {"Time_Start": 1261.1200000000001, "Time_End": 1262.1200000000001, "Text": " Yes."}, {"Time_Start": 1262.1200000000001, "Time_End": 1267.6200000000001, "Text": " My understanding you can actually use the terminal emulator and like Z-Modem transfer or something."}, {"Time_Start": 1267.6200000000001, "Time_End": 1274.6200000000001, "Text": " A terminal emulator and a Z-modem transfer with the STK?"}, {"Time_Start": 1274.6200000000001, "Time_End": 1276.6200000000001, "Text": " With this particular development environment?"}, {"Time_Start": 1276.6200000000001, "Time_End": 1277.6200000000001, "Text": " Just pick the file."}, {"Time_Start": 1277.6200000000001, "Time_End": 1278.6200000000001, "Text": " Like your transfer five if you can use."}, {"Time_Start": 1278.6200000000001, "Time_End": 1279.6200000000001, "Text": " Okay."}, {"Time_Start": 1279.6200000000001, "Time_End": 1292.6200000000001, "Text": " Okay. If you've got a minimal system, I'm not sure if that will work with this particular board. It may. I honestly don't know."}, {"Time_Start": 1292.6200000000001, "Time_End": 1296.6200000000001, "Text": " He suggested you can just do a Z-modem. Was it Z-modem transfer?"}, {"Time_Start": 1296.6200000000001, "Time_End": 1307.6200000000001, "Text": " Okay. To the part. But the upshot of it is that even though Kanda, who makes this board for Atmel, does not publish this stuff widely enough, it is readily available online."}, {"Time_Start": 1307.6200000000001, "Time_End": 1308.6200000000001, "Text": " And as far as C, you can use this board for ATMEL, does not publish this stuff widely enough, it is readily available online."}, {"Time_Start": 1308.6200000000001, "Time_End": 1309.6000000000001, "Text": " And as far as C, you can use."}, {"Time_Start": 1309.6200000000001, "Time_End": 1315.6200000000001, "Text": " use, there's a variety of C development environments. A lot of people say, well, you know, C can be done efficiently, and it in fact can."}, {"Time_Start": 1315.6200000000001, "Time_End": 1319.6200000000001, "Text": " IAR makes a third-party development set. Unfortunately, that costs about 5K."}, {"Time_Start": 1319.6200000000001, "Time_End": 1325.6200000000001, "Text": " GCC, which actually arguably produces better code, is available widely."}, {"Time_Start": 1325.6200000000001, "Time_End": 1330.6200000000001, "Text": " And it does, it's really easy to set up a C environment."}, {"Time_Start": 1330.6200000000001, "Time_End": 1337.6200000000001, "Text": " I don't do it simply because I prefer to see exactly what instructions I'm twiddling and be able to run the simulator environment."}, {"Time_Start": 1337.6200000000001, "Time_End": 1345.6200000000001, "Text": " One of the things you've got to be aware of when you're using C, especially with a part like this, some of the compilers will choke on this simply because you have no S-RAM."}, {"Time_Start": 1345.6200000000001, "Time_End": 1349.6200000000001, "Text": " And they really want a stack to maintain stack frames."}, {"Time_Start": 1349.6200000000001, "Time_End": 1352.6200000000001, "Text": " And they get cranky when they've got no S-Ram at all."}, {"Time_Start": 1352.6200000000001, "Time_End": 1356.6200000000001, "Text": " But they can do it."}, {"Time_Start": 1356.6200000000001, "Time_End": 1360.6200000000001, "Text": " Okay, so what can you actually do? What are some of my sample applications?"}, {"Time_Start": 1360.6200000000001, "Time_End": 1367.6000000000001, "Text": " An AT keyboard interface, a serial flash connection, and audio output, and some of the canonical"}, {"Time_Start": 1367.6200000000001, "Time_End": 1375.38, "Text": " audio examples are Morse and DTMF. Some other example modules would be a soft U-art."}, {"Time_Start": 1375.38, "Time_End": 1382.0600000000002, "Text": " I alluded to that earlier. Datastream manipulator, otherwise known as a mod chip, an IR remote control,"}, {"Time_Start": 1382.0600000000002, "Time_End": 1385.5200000000002, "Text": " or even a small parallel application, in this case a 4-bit parallel application,"}, {"Time_Start": 1385.5200000000002, "Time_End": 1392.14, "Text": " a stepper motor controller. So the AT keyboard interface. At this point, I'm going to delve into"}, {"Time_Start": 1392.14, "Time_End": 1397.22, "Text": " these. I'm going to try to give you a sort of glancing overview of a bunch of different things."}, {"Time_Start": 1397.22, "Time_End": 1399.22, "Text": " Some of the application notes you may want to look at."}, {"Time_Start": 1399.22, "Time_End": 1404.22, "Text": " If you have more questions, feel free to raise them, either now, Q&A, or after the talk."}, {"Time_Start": 1404.22, "Time_End": 1410.22, "Text": " But the AT keyboard interface, for anyone's looked at it, is a synchronous serial interface, meaning you have a clock and a data line."}, {"Time_Start": 1410.22, "Time_End": 1413.22, "Text": " It's very well documented, very straightforward."}, {"Time_Start": 1413.22, "Time_End": 1415.22, "Text": " It also includes 5-volt power with it."}, {"Time_Start": 1415.22, "Time_End": 1420.22, "Text": " This is really nice because it means that the AT connector can power your little widget,"}, {"Time_Start": 1420.22, "Time_End": 1426.22, "Text": " and you're well within the current limitations of any device hanging off an AT port."}, {"Time_Start": 1426.22, "Time_End": 1432.1000000000001, "Text": " an AT port. In fact, virtually every keyboard in the world has a microcontroller in it,"}, {"Time_Start": 1432.1000000000001, "Time_End": 1436.2, "Text": " which is just running an AT interface. Most of them are 80-51s because they were all designed"}, {"Time_Start": 1436.2, "Time_End": 1445.34, "Text": " back in about 1983, ported over when AT became popular, when XT became AT, and then they largely"}, {"Time_Start": 1445.34, "Time_End": 1451.6200000000001, "Text": " haven't changed them. It's a ROM-based microcontroller. The QCat makes a great housing and a"}, {"Time_Start": 1451.6200000000001, "Time_End": 1456.06, "Text": " source of cable if you're looking for a keyboard interface."}, {"Time_Start": 1456.22, "Time_End": 1459.28, "Text": " If taking apart the QCAT, you will also learn some interesting truths."}, {"Time_Start": 1459.28, "Time_End": 1463.26, "Text": " One of them is that there is no direct electrical connection between the keyboard in and keyboard"}, {"Time_Start": 1463.26, "Time_End": 1469.94, "Text": " out from the QCat, which means that it is at least handing along and being aware of every keystroke."}, {"Time_Start": 1469.94, "Time_End": 1476.46, "Text": " This makes sense, but it's also a little insidious for reasons I'll get to momentarily."}, {"Time_Start": 1476.46, "Time_End": 1482.4, "Text": " So the AT, the AT reference AT keyboard interface is Application Note 313."}, {"Time_Start": 1482.4, "Time_End": 1486.2, "Text": " They wrote it in C. I went through it and I've done parts of it in assembly."}, {"Time_Start": 1486.22, "Time_End": 1490.6000000000001, "Text": " I haven't got that up and available online yet either, but hopefully it will be."}, {"Time_Start": 1491.3, "Time_End": 1493.94, "Text": " They actually put the clock on the external interrupt line."}, {"Time_Start": 1494.0, "Time_End": 1499.46, "Text": " One of the nice things about the AT interface is it has a maximum clock rate of, I believe, around 100 kHz, 110 kHz,"}, {"Time_Start": 1499.78, "Time_End": 1506.88, "Text": " which means you can actually, it's slow enough, you can just trigger an interrupt every time a clock signal comes in and read the bit."}, {"Time_Start": 1508.26, "Time_End": 1515.06, "Text": " Sample the data every interrupt, and then it's possible to get out of sync with the 11-bit frame that it sends."}, {"Time_Start": 1515.06, "Time_End": 1520.1599999999999, "Text": " If you somehow miss a bit, for some reason, in that case, what you generally want to do is time out."}, {"Time_Start": 1520.36, "Time_End": 1525.82, "Text": " Their canonical example uses an 8-bit timer for a 1.5 millisecond timeout,"}, {"Time_Start": 1526.26, "Time_End": 1530.1399999999999, "Text": " and then this is where if you're clever and want to save a few bytes of code space,"}, {"Time_Start": 1530.1399999999999, "Time_End": 1533.84, "Text": " you just set up the watchdog to time out after 15 milliseconds."}, {"Time_Start": 1533.96, "Time_End": 1537.54, "Text": " Every time you receive a bit or you've gotten to the end of the 11-bit frame,"}, {"Time_Start": 1537.8999999999999, "Time_End": 1540.0, "Text": " you kick the watchdog timer."}, {"Time_Start": 1540.3999999999999, "Time_End": 1541.76, "Text": " Otherwise, it'll get to 15 milliseconds."}, {"Time_Start": 1541.96, "Time_End": 1544.22, "Text": " It'll assume that it's gotten out of sync and it'll time out and reset."}, {"Time_Start": 1545.06, "Time_End": 1552.8999999999999, "Text": " So, what are some amusing widgets you could build with just an 8-bit microcontroller hooked up to an A-T keyboard?"}, {"Time_Start": 1552.8999999999999, "Time_End": 1561.06, "Text": " And a few I came up with were the typo generator, where you could have something that sits on the keyboard line and turn, say, every fourth R into a T,"}, {"Time_Start": 1561.06, "Time_End": 1566.32, "Text": " or just does minor transformations in a non-obvious way on the keyboard stream."}, {"Time_Start": 1566.32, "Time_End": 1569.82, "Text": " This will annoy the hell out of anyone who doesn't know what it, that it's there."}, {"Time_Start": 1569.82, "Time_End": 1575.04, "Text": " Another that I would like to build is the keyboard pipeline."}, {"Time_Start": 1575.06, "Time_End": 1578.3, "Text": " where it doesn't actually release a keystroke until the next one."}, {"Time_Start": 1578.3799999999999, "Time_End": 1583.1399999999999, "Text": " So you've got a lag of keystroke in your keyboard."}, {"Time_Start": 1584.04, "Time_End": 1588.6399999999999, "Text": " And then something that's actually useful, something that actually has some use,"}, {"Time_Start": 1588.72, "Time_End": 1593.74, "Text": " would it be a keyboard remapper if you wanted to do a QWERDivorek or a PC to Sun"}, {"Time_Start": 1593.74, "Time_End": 1598.82, "Text": " because a lot of people get cranky about transposing caps and caps lock and control"}, {"Time_Start": 1598.82, "Time_End": 1599.76, "Text": " when they're changing keyboards."}, {"Time_Start": 1600.3799999999999, "Time_End": 1604.48, "Text": " So there are actually a lot of useful applications, even with just,"}, {"Time_Start": 1605.06, "Time_End": 1618.3, "Text": " the AT keyboard interface. He asks if you asked if you set it up if you set it up to look for keystrokes S and U together, how hard it depends on how hard would it be to pull that out of memory from somewhere else?"}, {"Time_Start": 1618.3, "Time_End": 1626.1399999999999, "Text": " He asks if you set it up to look for keystrokes S and U together and then logged, say anything around that."}, {"Time_Start": 1626.1399999999999, "Time_End": 1627.46, "Text": " How hard would it be to get it out?"}, {"Time_Start": 1628.58, "Time_End": 1632.58, "Text": " It depends on how you want to store it, how you want to get it back, but hold that thought."}, {"Time_Start": 1635.06, "Time_End": 1637.82, "Text": " Say you want a lot of memory."}, {"Time_Start": 1637.82, "Time_End": 1639.82, "Text": " A serial flash, for example."}, {"Time_Start": 1639.82, "Time_End": 1641.3, "Text": " Atmel makes this great little part."}, {"Time_Start": 1641.3, "Time_End": 1643.1799999999998, "Text": " It's the AT-24C-512."}, {"Time_Start": 1643.1799999999998, "Time_End": 1648.84, "Text": " It is 64K bytes of flash in an eight-pin dip package."}, {"Time_Start": 1648.84, "Time_End": 1653.1, "Text": " It has, again, a two-bit, or rather a two-wire, bi-directional interface."}, {"Time_Start": 1653.1, "Time_End": 1659.44, "Text": " You can actually stack them, and it has, because they're using power and ground as two of their pins,"}, {"Time_Start": 1659.44, "Time_End": 1663.94, "Text": " clock and data is two of their other pins, they have a right-protect pin, and then two of the pins"}, {"Time_Start": 1663.94, "Time_End": 1669.24, "Text": " are address lines. So you can actually set these address lines basically as a bootstrapping,"}, {"Time_Start": 1669.24, "Time_End": 1674.3400000000001, "Text": " you hardwire the address lines, and then in the command frame to the serial EEPROM, you"}, {"Time_Start": 1674.3400000000001, "Time_End": 1678.9, "Text": " can address, you provide two address bits, so you can address up to four of them, which"}, {"Time_Start": 1678.9, "Time_End": 1685.8600000000001, "Text": " means you can stack them and you can basically bust them together and get up to 256 k-bytes of storage"}, {"Time_Start": 1685.8600000000001, "Time_End": 1693.92, "Text": " in serial EEProm in a very small form factor. Here's an example. One of the nice things is because"}, {"Time_Start": 1693.94, "Time_End": 1703.64, "Text": " they're both eight-pin dip packages. They share power and ground pins, so you can do this little bug sex thing where you basically just stack them together."}, {"Time_Start": 1704.0, "Time_End": 1717.96, "Text": " And in this case, I would actually, to do what I want to do with it, I'd actually have to route some of the pins around with some wires because this unfortunately puts one of the serial data lines on top of the Atmel interrupt line, which you want for the keyboard interface."}, {"Time_Start": 1718.52, "Time_End": 1723.92, "Text": " But, I mean, if you look at it, it's pretty cool that you've got in the left-hand picture, you have a micro-hand picture, you have a microgram."}, {"Time_Start": 1723.94, "Time_End": 1727.3600000000001, "Text": " controller with 64K of flash hanging off it. That's non-volatile memory."}, {"Time_Start": 1728.3600000000001, "Time_End": 1732.8200000000002, "Text": " The whole system runs at 5 volts and basically you could you could make that work with no other"}, {"Time_Start": 1732.8200000000002, "Time_End": 1738.92, "Text": " hardware hanging off it. The right-hand example is if you want to boost that up to 192k of flash."}, {"Time_Start": 1740.76, "Time_End": 1747.66, "Text": " I have the one pin. That's one of the address lines and basically I just wanted to provide an example of how you, if you don't want, if you don't want that"}, {"Time_Start": 1747.66, "Time_End": 1753.8200000000002, "Text": " pin connected, normally you would tag the pins together with solder, but if you want a pin to go somewhere else, it's really easy to just"}, {"Time_Start": 1753.82, "Time_End": 1757.32, "Text": " lift it up and run a wire off it."}, {"Time_Start": 1757.32, "Time_End": 1759.02, "Text": " Hmm."}, {"Time_Start": 1759.02, "Time_End": 1761.1799999999998, "Text": " Okay, so you've got an AT keyboard interface."}, {"Time_Start": 1761.1799999999998, "Time_End": 1763.48, "Text": " You've got a large non-volatile memory."}, {"Time_Start": 1763.48, "Time_End": 1768.32, "Text": " You've got a tiny size and you've got a bunch of people at DefCon."}, {"Time_Start": 1768.32, "Time_End": 1770.32, "Text": " What could we build with this?"}, {"Time_Start": 1770.32, "Time_End": 1775.24, "Text": " Now, at this point, I will go into a brief aside on a moral conundrum I found myself in when"}, {"Time_Start": 1775.24, "Time_End": 1776.8999999999999, "Text": " preparing this talk."}, {"Time_Start": 1776.8999999999999, "Time_End": 1780.04, "Text": " It resolved itself in part because I was behind schedule and didn't get the thing"}, {"Time_Start": 1780.04, "Time_End": 1783.8, "Text": " completely built, but I was actually going to provide a reference design for a reference design for"}, {"Time_Start": 1783.82, "Time_End": 1787.1599999999999, "Text": " a keyboard sniffer that anyone could build."}, {"Time_Start": 1787.1599999999999, "Time_End": 1790.58, "Text": " I read an article, though, about giving guns to children."}, {"Time_Start": 1790.58, "Time_End": 1797.32, "Text": " And it struck a chord with me that, you know, there should be a certain minimal"}, {"Time_Start": 1797.32, "Time_End": 1801.06, "Text": " sincerity check to this. You should at least have to build your own gun."}, {"Time_Start": 1801.06, "Time_End": 1809.1799999999998, "Text": " So, so I largely leave it at that, but the implication is you could build a really spiffy"}, {"Time_Start": 1809.1799999999998, "Time_End": 1813.8, "Text": " little keyboard, uh, keyboard sniffer. And as, as to the question of how you"}, {"Time_Start": 1813.82, "Time_End": 1818.78, "Text": " get it out, how you get the data out, if you've seen the ghost board, which is actually"}, {"Time_Start": 1818.78, "Time_End": 1823.36, "Text": " a commercial product that does this, and is in fact based on, I think it might be based on"}, {"Time_Start": 1823.36, "Time_End": 1827.08, "Text": " an AVR. I don't remember, there's a web page, someone tore one apart and saw what's in there."}, {"Time_Start": 1827.08, "Time_End": 1831.1399999999999, "Text": " And they actually used a larger microcontroller. I think this is a little slick, a little cooler"}, {"Time_Start": 1831.1399999999999, "Time_End": 1835.1, "Text": " solution because it's just that much smaller. I mean, you could probably make it look like just"}, {"Time_Start": 1835.1, "Time_End": 1841.2, "Text": " the keyboard connector. But in their solution, they actually capture keystrokes and then output"}, {"Time_Start": 1841.2, "Time_End": 1846.88, "Text": " keystrokes as the means of getting to it. You actually type an activation sequence."}, {"Time_Start": 1846.88, "Time_End": 1851.2, "Text": " And since it's sniffing the AT keyboard interface, you can just use that to trigger it, to have"}, {"Time_Start": 1851.2, "Time_End": 1856.88, "Text": " it kick over and reveal that it's there and start dumping its log."}, {"Time_Start": 1856.88, "Time_End": 1860.92, "Text": " I would be inclined to actually make the thing completely transparent. You want it to be completely"}, {"Time_Start": 1860.92, "Time_End": 1865.04, "Text": " out of van, so there is nothing you can type that would make it reveal itself. And also,"}, {"Time_Start": 1865.04, "Time_End": 1871.04, "Text": " I would prefer to, given the number of pins and what I'd like to use them for, I would probably"}, {"Time_Start": 1871.04, "Time_End": 1875.68, "Text": " actually set the hardware up so that I would have to drop it into a second fixture to"}, {"Time_Start": 1875.68, "Time_End": 1882.48, "Text": " extract the memory. But that's just because I want to be the only one who can read it. Anyway, so skipping,"}, {"Time_Start": 1882.48, "Time_End": 1899.12, "Text": " skipping, oh, yes. Sure. Yes, the question is. Yes, the question is, is there a security bit"}, {"Time_Start": 1899.1200000000001, "Time_End": 1927.98, "Text": " in the appell that will prevent reading back the contents of the program memory. And the answer is yes. There's a couple of flash fuses that set different functionality, but one of them is a security bit. There's a read protect that will make it impossible to extract the contents. There is also a write protect, I believe, that makes it impossible to overwrite it, although you can still erase it if you want to. So you don't end up turning it into a one-time programmable part."}, {"Time_Start": 1929.1200000000001, "Time_End": 1934.88, "Text": " Anyway, it depends on the specific part, but check the data sheet."}, {"Time_Start": 1934.88, "Time_End": 1937.3600000000001, "Text": " There are definitely things you can do to make your code."}, {"Time_Start": 1937.3600000000001, "Time_End": 1941.5600000000002, "Text": " I won't say impossible to extract, but you can require them to shave off the top of the part"}, {"Time_Start": 1941.5600000000002, "Time_End": 1945.6200000000001, "Text": " and use really expensive probing equipment."}, {"Time_Start": 1945.6200000000001, "Time_End": 1949.3000000000002, "Text": " And there are some really neat probing tools."}, {"Time_Start": 1949.3000000000002, "Time_End": 1951.3000000000002, "Text": " So audio output."}, {"Time_Start": 1951.3000000000002, "Time_End": 1957.66, "Text": " There is a proud history with 8-bit systems of generating audio by twiddling one bit to a speaker."}, {"Time_Start": 1957.66, "Time_End": 1962.96, "Text": " who grew up with an Apple II knows that you can do some pretty amazing things with one bit to a speaker."}, {"Time_Start": 1962.96, "Time_End": 1967.8000000000002, "Text": " You can also use a lookup table to generate a more pure tone. And I talk about using a lookup"}, {"Time_Start": 1967.8000000000002, "Time_End": 1974.42, "Text": " table in either EEPROM or using load program memory. You may be wondering how, if you've"}, {"Time_Start": 1974.42, "Time_End": 1977.9, "Text": " only got one bit going out, how do you get anything other than on or off? And I'll talk about"}, {"Time_Start": 1977.9, "Time_End": 1986.1000000000001, "Text": " that in just a second. With program space, I talked about this briefly earlier, but the"}, {"Time_Start": 1986.1000000000001, "Time_End": 1991.5400000000002, "Text": " way you extract your lookup tables from program spaces with the LPM command, you put the"}, {"Time_Start": 1991.5400000000002, "Time_End": 1996.2800000000002, "Text": " address you're looking for in the Z register, which is basically the R30 and R31."}, {"Time_Start": 1996.2800000000002, "Time_End": 2003.2, "Text": " And then because of the way they want to represent the program memory as a 16-bit word, they call"}, {"Time_Start": 2003.2, "Time_End": 2009.3600000000001, "Text": " the upper 15 bits the word address and the lower bit, the byte select, which is the same as saying"}, {"Time_Start": 2009.3600000000001, "Time_End": 2010.88, "Text": " a byte address."}, {"Time_Start": 2010.88, "Time_End": 2012.2600000000002, "Text": " But that's the way they represent it."}, {"Time_Start": 2012.2600000000002, "Time_End": 2016.0800000000002, "Text": " But basically, it means that you can store constants efficiently in the six-fixing."}, {"Time_Start": 2016.1000000000001, "Time_End": 2021.92, "Text": " 16-bit flash code space. So you can store lookup tables even though you don't have"}, {"Time_Start": 2021.92, "Time_End": 2028.66, "Text": " the E.E. Prom in this particular part. Morse code, like I said, is a real canonical audio"}, {"Time_Start": 2028.66, "Time_End": 2036.6200000000001, "Text": " interface. It's kind of cool because it represents a fairly well-known audio output and it's"}, {"Time_Start": 2036.6200000000001, "Time_End": 2043.94, "Text": " kind of nice to have your part alert itself that it needs to do something by just going."}, {"Time_Start": 2043.94, "Time_End": 2046.0800000000002, "Text": " An interesting exercise when you're working with a system."}, {"Time_Start": 2046.1000000000001, "Time_End": 2051.2200000000003, "Text": " with no space such as this or minimal, minimal spaces. How do you, how do you encode"}, {"Time_Start": 2051.2200000000003, "Time_End": 2056.86, "Text": " Morse code for your lookup table to do the ASCII to Morse conversion? And I touch on this"}, {"Time_Start": 2056.86, "Time_End": 2063.3, "Text": " just because it's a neat example of figuring out how to store things really efficiently."}, {"Time_Start": 2063.3, "Time_End": 2066.6600000000003, "Text": " Morse is essentially binary in that you've got short and long, but you've got variable-length"}, {"Time_Start": 2066.6600000000003, "Time_End": 2071.94, "Text": " signal, symbols, anywhere from E&T, which are one, up to some of the punctuation, which I believe"}, {"Time_Start": 2071.94, "Time_End": 2076.08, "Text": " are six or seven. I don't remember if there's any seven punctuation. If you"}, {"Time_Start": 2076.1, "Time_End": 2082.2599999999998, "Text": " you use a counter and a bit mask, then you quickly run out of bits for anything longer than five."}, {"Time_Start": 2082.2599999999998, "Time_End": 2087.2599999999998, "Text": " And I talk about L, you know, there you could use the four and then a bit mask and you could"}, {"Time_Start": 2087.2599999999998, "Time_End": 2091.68, "Text": " can catenate them together using three bits and five, three bits of length and five"}, {"Time_Start": 2091.68, "Time_End": 2100.62, "Text": " bits of data. Or you could use zero null bits at the start, a one start bit, and then the"}, {"Time_Start": 2100.62, "Time_End": 2105.7, "Text": " bit mask after that, in which case you've managed to reduce the length indicator to one bit."}, {"Time_Start": 2106.1, "Time_End": 2111.2599999999998, "Text": " And this struck me as something that's not immediately obvious, but is a nice, efficient"}, {"Time_Start": 2111.2599999999998, "Time_End": 2116.0, "Text": " way of storing things that are variable length and little lookup tables."}, {"Time_Start": 2116.0, "Time_End": 2119.7, "Text": " So I felt compelled to include that."}, {"Time_Start": 2119.7, "Time_End": 2125.2999999999997, "Text": " OK, DTMF, say instead of a Morse application, you want to be able to dial a phone, Atmel has an"}, {"Time_Start": 2125.2999999999997, "Time_End": 2131.42, "Text": " application note for you. AVR 314. They do it in 260 bytes of code and a hundred and"}, {"Time_Start": 2131.42, "Time_End": 2136.08, "Text": " 28 byte lookup table. The lookup table is basically just a representation of a representation of a"}, {"Time_Start": 2136.1, "Time_End": 2139.2999999999997, "Text": " of the pulse with modulation constants for a sine wave."}, {"Time_Start": 2139.2999999999997, "Time_End": 2145.24, "Text": " And what you do is you output variable length constant values"}, {"Time_Start": 2145.24, "Time_End": 2149.3399999999997, "Text": " on the speaker pin, and then you take advantage of the fact that there's a"}, {"Time_Start": 2149.3399999999997, "Time_End": 2152.94, "Text": " characteristic capacitance to act as a low-pass filter."}, {"Time_Start": 2152.94, "Time_End": 2157.2599999999998, "Text": " And so what you do is by turning the speaker on and off faster than it could"}, {"Time_Start": 2157.2599999999998, "Time_End": 2162.22, "Text": " possibly represent an audio, you get the low-pass equivalent of that,"}, {"Time_Start": 2162.22, "Time_End": 2165.9, "Text": " which turns into a sine wave or something close enough to it that that you can actually do"}, {"Time_Start": 2165.9, "Time_End": 2171.52, "Text": " fairly pure tones. You can do tones pure enough to do DTMF. In this case, the example in the"}, {"Time_Start": 2171.52, "Time_End": 2177.6800000000003, "Text": " data sheet uses a pulse with modulation feature that is included on a lot of the timer counters"}, {"Time_Start": 2177.6800000000003, "Time_End": 2183.88, "Text": " on the larger AVRs. In this case, there's a timer counter, but there's no pulse with modulation feature"}, {"Time_Start": 2183.88, "Time_End": 2190.1800000000003, "Text": " to it, so you would have to jerry-rig that in software, but it can be done. And that's how you can"}, {"Time_Start": 2190.1800000000003, "Time_End": 2194.94, "Text": " do pure tones. Obviously, if you want to do complex sounds, you would need a much larger"}, {"Time_Start": 2194.94, "Time_End": 2200.84, "Text": " external memory, but again, if you've got, say, a 64KK-byte flash memory hanging off it, you could"}, {"Time_Start": 2200.84, "Time_End": 2206.7000000000003, "Text": " actually do a pulse-width modulation representation of more complex waveforms to generate more complex"}, {"Time_Start": 2206.7000000000003, "Time_End": 2210.7400000000002, "Text": " sounds."}, {"Time_Start": 2210.7400000000002, "Time_End": 2211.54, "Text": " Soft U-Ark."}, {"Time_Start": 2211.54, "Time_End": 2219.14, "Text": " Say you want your device to be able to talk to the outside world in an obvious way."}, {"Time_Start": 2219.14, "Time_End": 2224.92, "Text": " Application note AVR 304 is a really complete, interrupt-driven, timer-based, you"}, {"Time_Start": 2224.94, "Time_End": 2230.14, "Text": " art, it takes several hundred words of code space, so you eat up a good chunk of your code"}, {"Time_Start": 2230.14, "Time_End": 2235.52, "Text": " space, but you end up with a U-art that is unobtrusive, sits in the background, uses the interrupt"}, {"Time_Start": 2235.52, "Time_End": 2242.38, "Text": " pin to detect start bits, and then samples based on the timer. All of these, if you're going"}, {"Time_Start": 2242.38, "Time_End": 2246.84, "Text": " to hook them up to, say, an RS-232 port, are going to require an external transceiver to do the"}, {"Time_Start": 2246.84, "Time_End": 2254.88, "Text": " level shifting from 0 to 5 to 0. But those are readily available. Or if you've got a system that's all"}, {"Time_Start": 2254.94, "Time_End": 2261.94, "Text": " things you've built, you can just keep it all at 5-volt signaling. I believe that's RS 422 or something."}, {"Time_Start": 2261.94, "Time_End": 2264.94, "Text": " What?"}, {"Time_Start": 2264.94, "Time_End": 2266.94, "Text": " 422 is balanced."}, {"Time_Start": 2266.94, "Time_End": 2268.94, "Text": " Okay, 422 is balanced. Thank you."}, {"Time_Start": 2268.94, "Time_End": 2269.94, "Text": " Yes."}, {"Time_Start": 2274.94, "Time_End": 2276.94, "Text": " He asks, the clock is someone unstable or they use a crystal to a clock."}, {"Time_Start": 2276.94, "Time_End": 2278.94, "Text": " He asks, the clock is someone unstable."}, {"Time_Start": 2278.94, "Time_End": 2281.94, "Text": " What do you, do you use a crystal to clock it?"}, {"Time_Start": 2281.94, "Time_End": 2283.44, "Text": " And again, the audience is getting ahead of me."}, {"Time_Start": 2283.44, "Time_End": 2284.94, "Text": " If you wait, just about two more slow."}, {"Time_Start": 2284.94, "Time_End": 2314.5, "Text": " I will in fact address that. But yes, there are definitely clocking problems on an asynchronous interface that you have your, that you have clock drift. And there's a couple of ways around that. If you want a minimal software you are, application no AVR 305 is 32 words, busy weight loops, no interrupt, no timer, quick and dirty, and it's really kind of cool. Basically, there's one, there's one hard-coded busy weight delay loop that's half a bit time long for whatever bit speed you want the thing to accommodate."}, {"Time_Start": 2314.94, "Time_End": 2322.94, "Text": " and then it just does shift register work and calling this delay loop one, two, or three times,"}, {"Time_Start": 2322.94, "Time_End": 2325.94, "Text": " depending on how many half-bit delays it needs."}, {"Time_Start": 2325.94, "Time_End": 2333.94, "Text": " And that's a good example of sort of sexy little, very small, efficient coding for microintrollers."}, {"Time_Start": 2333.94, "Time_End": 2336.94, "Text": " I mean, 32 words for a U-Ard is pretty neat."}, {"Time_Start": 2336.94, "Time_End": 2339.94, "Text": " Some thoughts on software U-Arts."}, {"Time_Start": 2339.94, "Time_End": 2344.92, "Text": " At high bit rates, your clock, your clock alignment,"}, {"Time_Start": 2344.94, "Time_End": 2348.62, "Text": " with whatever bod rate you're trying to support will get worse and worse."}, {"Time_Start": 2348.62, "Time_End": 2351.7400000000002, "Text": " And as was brought up, the clock is only as stable as a system clock."}, {"Time_Start": 2351.7400000000002, "Time_End": 2353.16, "Text": " Beware of the internal oscillator."}, {"Time_Start": 2353.16, "Time_End": 2358.2400000000002, "Text": " If you're using a part like this running at 1 megahertz, you can theoretically do a U-art that"}, {"Time_Start": 2358.2400000000002, "Time_End": 2360.4, "Text": " supports 38.4 K-Bod."}, {"Time_Start": 2360.9, "Time_End": 2367.38, "Text": " However, you probably want to bring that way back because as your clock drifts, the error gets"}, {"Time_Start": 2367.38, "Time_End": 2368.34, "Text": " more and more severe."}, {"Time_Start": 2369.52, "Time_End": 2372.62, "Text": " And you've got thermal drift, you've got voltage drift, you've got manufacturing variations."}, {"Time_Start": 2372.88, "Time_End": 2374.92, "Text": " As I said, the AT12 also includes."}, {"Time_Start": 2374.94, "Time_End": 2377.94, "Text": " includes a calibrated clock that you can use. Yes. Yes."}, {"Time_Start": 2377.94, "Time_End": 2378.94, "Text": " Yes."}, {"Time_Start": 2378.94, "Time_End": 2384.94, "Text": " My question was, what's the ball rate of the AT keyboard serial?"}, {"Time_Start": 2384.94, "Time_End": 2387.94, "Text": " But then it's synchronous, we have to operate, so it doesn't really matter."}, {"Time_Start": 2387.94, "Time_End": 2393.94, "Text": " Yeah, the, the AT keyboard is a synchronous interface that can go up to 100 kilohertz,"}, {"Time_Start": 2393.94, "Time_End": 2396.94, "Text": " but fortunately you don't have to extract your own clocking out of it."}, {"Time_Start": 2396.94, "Time_End": 2397.94, "Text": " Yes."}, {"Time_Start": 2397.94, "Time_End": 2398.94, "Text": " Yes."}, {"Time_Start": 2398.94, "Time_End": 2400.94, "Text": " This is a weird question regarding the frame."}, {"Time_Start": 2400.94, "Time_End": 2403.94, "Text": " But is it possible to repair the interim of clock with the internal clock in which?"}, {"Time_Start": 2403.94, "Time_End": 2420.94, "Text": " Okay, the question is, can you measure the internal clock to do the internal clock to an external clock to do thermal measurement of the part?"}, {"Time_Start": 2420.94, "Time_End": 2433.92, "Text": " Not that I am aware of. I don't believe there is anything, well, it might be possible if you had an external counter to do counter matching. The trouble is you can't"}, {"Time_Start": 2433.94, "Time_End": 2440.94, "Text": " get single clock resolution for, it would be difficult to get single clock resolution for doing comparisons."}, {"Time_Start": 2440.94, "Time_End": 2447.94, "Text": " It might be possible. It's much cheaper to just stick a thermal, thermal measuring device in the system."}, {"Time_Start": 2447.94, "Time_End": 2454.94, "Text": " Either a thermal diode or an explicit thermister."}, {"Time_Start": 2454.94, "Time_End": 2462.94, "Text": " Another point you bring up though is clock drift, if you do have a stable external reference and you are willing to believe that clock drift is truly random."}, {"Time_Start": 2462.94, "Time_End": 2474.94, "Text": " random is a good source of randomness. You can actually use clock noise to feed your entropy buffer if you, you know, are into that sort of thing."}, {"Time_Start": 2474.94, "Time_End": 2478.94, "Text": " So data stream manipulation, how am I doing?"}, {"Time_Start": 2478.94, "Time_End": 2479.94, "Text": " Oh my."}, {"Time_Start": 2479.94, "Time_End": 2480.94, "Text": " Oh my."}, {"Time_Start": 2480.94, "Time_End": 2481.94, "Text": " Data stream manipulation, mod chips."}, {"Time_Start": 2481.94, "Time_End": 2482.94, "Text": " Like I said, I'm going to only touch on this."}, {"Time_Start": 2482.94, "Time_End": 2488.94, "Text": " If you do a search on AVR mod chips for the PlayStation, you will find that there is someone who actually has source code available online."}, {"Time_Start": 2488.94, "Time_End": 2491.94, "Text": " The way a mod chip works, at least in a PlayStation, is you are, you are, you are usually."}, {"Time_Start": 2491.94, "Time_End": 2501.94, "Text": " is you are just replacing the very low bit rate out-of-band serial stream that says what the region code for this particular disk is."}, {"Time_Start": 2501.94, "Time_End": 2507.94, "Text": " And what it does is instead spits out the region code, spits out all of the region codes so that any mod chip will work anywhere."}, {"Time_Start": 2507.94, "Time_End": 2513.94, "Text": " And the PlayStation hardware that reads this, at least initially, was forgiving enough to accept this sort of behavior."}, {"Time_Start": 2513.94, "Time_End": 2518.94, "Text": " Most of the mod chips that you can buy online are implemented on the pick device."}, {"Time_Start": 2518.94, "Time_End": 2520.94, "Text": " Like I said, there's at least one AVR available online."}, {"Time_Start": 2520.94, "Time_End": 2541.64, "Text": " available online. And again, beware of clock deviation. If you're going to do a mod chip, you might want to do it on an AT-12, which has a calibrated clock, because if you have thermal drift, you can actually get far enough out that your mod chip will stop working. Some of the early generation mod chips suffered from thermal failure, whereas your PlayStation's on for half an hour, it warms up, and the thing no longer works."}, {"Time_Start": 2544.64, "Time_End": 2550.92, "Text": " PlayStation 2 mod chips are showing this behavior. I know that there was also some effort in the design of the PlayStation 2 to make it a little"}, {"Time_Start": 2550.94, "Time_End": 2552.94, "Text": " harder to do this sort of thing."}, {"Time_Start": 2552.94, "Time_End": 2557.94, "Text": " Obviously, in any system where you've got the signals running around, someone's going to figure out a way to get in there."}, {"Time_Start": 2557.94, "Time_End": 2561.94, "Text": " I think their goal is merely to make the mod chip more expensive than the PlayStation."}, {"Time_Start": 2561.94, "Time_End": 2564.94, "Text": " So, and that may well happen."}, {"Time_Start": 2564.94, "Time_End": 2573.94, "Text": " And then I talked briefly about doing an IRR receiver if you want to be able to build a remote control,"}, {"Time_Start": 2573.94, "Time_End": 2575.94, "Text": " a wireless remote control application."}, {"Time_Start": 2575.94, "Time_End": 2579.94, "Text": " Philip Sony RC5 protocol is explained in AVR410."}, {"Time_Start": 2579.94, "Time_End": 2586.94, "Text": " 10. It's similar to a soft u-art, except it uses bi-phase or Manchester encoding, where there's a transition on every bit time."}, {"Time_Start": 2586.94, "Time_End": 2589.94, "Text": " That means that a high-to-low transition is a zero."}, {"Time_Start": 2589.94, "Time_End": 2593.94, "Text": " A high-to-low transition with the transition in the middle of the bit is a zero, a low-to-high is a 1."}, {"Time_Start": 2593.94, "Time_End": 2600.94, "Text": " The reason you do this is because it's easier to spot transitions than long runs of constant value, especially in a medium like IR."}, {"Time_Start": 2600.94, "Time_End": 2603.94, "Text": " It also means that the signal is self-clocking."}, {"Time_Start": 2603.94, "Time_End": 2607.94, "Text": " You don't have to maintain clocks synchronization over many bit times."}, {"Time_Start": 2607.94, "Time_End": 2609.94, "Text": " It takes an input from an external."}, {"Time_Start": 2609.94, "Time_End": 2613.94, "Text": " IR diode and the IR diode is actually available on this board."}, {"Time_Start": 2613.94, "Time_End": 2621.94, "Text": " And then the RC5 framing, and they get into this in the data sheet, but I just wanted to mention it, is two start bits, which are always ones,"}, {"Time_Start": 2621.94, "Time_End": 2629.94, "Text": " a control bit which is toggled every time any particular button is pressed, five address bits, because of course you want two to the fifth devices to control with your remote,"}, {"Time_Start": 2629.94, "Time_End": 2633.94, "Text": " and six command bits because of course you've got that many devices."}, {"Time_Start": 2633.94, "Time_End": 2635.94, "Text": " What do you have to say to that many?"}, {"Time_Start": 2635.94, "Time_End": 2638.94, "Text": " And then the small parallel example is a stepper motor controller."}, {"Time_Start": 2638.94, "Time_End": 2645.44, "Text": " controller. And I include this because there was a lot of, there was a lot of interest in doing servo designs at last year's talk."}, {"Time_Start": 2645.44, "Time_End": 2649.94, "Text": " And stepper motors are really nice because once you understand what they're doing, they're fairly easy."}, {"Time_Start": 2649.94, "Time_End": 2654.44, "Text": " They are open-loop control mechanisms that are still, that are still deterministic."}, {"Time_Start": 2654.44, "Time_End": 2660.44, "Text": " If you try to run a DC motor and you turn it on for one second, you have no idea how many times it's gone around."}, {"Time_Start": 2660.44, "Time_End": 2663.44, "Text": " And you can gear it way down, but you still don't know exactly how far you've moved."}, {"Time_Start": 2663.44, "Time_End": 2668.44, "Text": " With stepper motors, as long as you don't overload them, they have moved as many steps as you've clocked."}, {"Time_Start": 2668.44, "Time_End": 2673.44, "Text": " and so it's open control loop. You don't need an encoder on the shaft, but you still know where the thing is."}, {"Time_Start": 2673.44, "Time_End": 2676.44, "Text": " For a unipolar stepper motor, the control is trivial."}, {"Time_Start": 2676.44, "Time_End": 2680.44, "Text": " For a dual polar, you actually have the possibility of building a software destroyable system."}, {"Time_Start": 2680.44, "Time_End": 2682.44, "Text": " And I'll talk about that in just a second."}, {"Time_Start": 2682.44, "Time_End": 2686.44, "Text": " A unipolar drive is commonly called a six-wire stepper motor,"}, {"Time_Start": 2686.44, "Time_End": 2692.44, "Text": " where you've got a center tap on each of two coils in the magnet, and then you've got the end taps."}, {"Time_Start": 2692.44, "Time_End": 2697.44, "Text": " And you want to turn on one or the other end tap to change the polarity on either of the coils."}, {"Time_Start": 2697.44, "Time_End": 2703.44, "Text": " coils. There is a data sheet that I reference here at Erickson which is a"}, {"Time_Start": 2703.44, "Time_End": 2707.44, "Text": " great introduction to stepper motor control. I just swiped some diagrams from"}, {"Time_Start": 2707.44, "Time_End": 2711.94, "Text": " them and if you're interested in building a servo, I'd recommend you go there and"}, {"Time_Start": 2711.94, "Time_End": 2715.92, "Text": " look at it. If you're using a bipolar, you have a coil, it's a four-wire"}, {"Time_Start": 2715.92, "Time_End": 2721.2000000000003, "Text": " stepper mortar and you want to be able to apply either, you want to be able to"}, {"Time_Start": 2721.2000000000003, "Time_End": 2724.26, "Text": " reverse the polarity across the coil. So what you do is you're building what's"}, {"Time_Start": 2724.26, "Time_End": 2727.42, "Text": " called an H-bridge driver. And if you look at this, the alternate"}, {"Time_Start": 2727.44, "Time_End": 2729.44, "Text": " corners of the H-bridge are controlled by the same bit."}, {"Time_Start": 2729.44, "Time_End": 2732.44, "Text": " So it's still only four control bits required for an H-bridge,"}, {"Time_Start": 2732.44, "Time_End": 2735.44, "Text": " but if you look at it, you'll also notice a really nasty failure mode."}, {"Time_Start": 2735.44, "Time_End": 2740.44, "Text": " If you turn on both sets of switches on any H-bridge,"}, {"Time_Start": 2740.44, "Time_End": 2745.44, "Text": " you suddenly have a very low impedance path from VCC to ground,"}, {"Time_Start": 2745.44, "Time_End": 2749.44, "Text": " and the thing will emit light, smoke, or fire,"}, {"Time_Start": 2749.44, "Time_End": 2752.44, "Text": " depending on how much power you're putting into it."}, {"Time_Start": 2752.44, "Time_End": 2756.44, "Text": " So what if you want more I.O? Well,"}, {"Time_Start": 2756.44, "Time_End": 2758.94, "Text": " Well, then you may want to look at other parts."}, {"Time_Start": 2758.94, "Time_End": 2761.44, "Text": " What are you doing with an 8-pin part if you want more I-O?"}, {"Time_Start": 2761.44, "Time_End": 2767.44, "Text": " But if you are some kind of sadist, you can use serial-to-parallel shift registers."}, {"Time_Start": 2767.44, "Time_End": 2781.44, "Text": " And in fact, there are some examples of this in really old, really old LED signboards where they actually control a large, you know, multi-hundred LED array with essentially two pins by just shifting everything out into shift registers."}, {"Time_Start": 2781.44, "Time_End": 2786.42, "Text": " And then if you want your transitions on these shift registers to be clean, make sure to use one with output latches, and then it"}, {"Time_Start": 2786.44, "Time_End": 2789.44, "Text": " takes a third pin because you've got to clock the output latch."}, {"Time_Start": 2789.44, "Time_End": 2793.44, "Text": " But you can chain these things together and have an arbitrary number of IOs,"}, {"Time_Start": 2793.44, "Time_End": 2795.44, "Text": " but the parts are so cheap for the larger parts."}, {"Time_Start": 2795.44, "Time_End": 2798.44, "Text": " You might as well just use a larger controller."}, {"Time_Start": 2798.44, "Time_End": 2801.44, "Text": " How do I, blah, for anything I have failed to mention here,"}, {"Time_Start": 2801.44, "Time_End": 2803.44, "Text": " and there is an infinite number of things I've failed to mention here."}, {"Time_Start": 2803.44, "Time_End": 2804.44, "Text": " Hit the web."}, {"Time_Start": 2804.44, "Time_End": 2808.44, "Text": " If you search, you'll be amazed that there's chances are if you've got a great idea,"}, {"Time_Start": 2808.44, "Time_End": 2811.44, "Text": " someone else has already built it, or at least has thought about building it."}, {"Time_Start": 2811.44, "Time_End": 2815.44, "Text": " Also, the manufacturer application notes, as you may have gotten an idea from my presentation,"}, {"Time_Start": 2815.44, "Time_End": 2818.44, "Text": " presentation provide a lot of good reference designs."}, {"Time_Start": 2818.44, "Time_End": 2821.94, "Text": " Often, if you look at manufacturers of parts that aren't the one you're looking at,"}, {"Time_Start": 2821.94, "Time_End": 2825.64, "Text": " that you're working on, you will find someone who's doing it on some other part,"}, {"Time_Start": 2825.64, "Time_End": 2828.7400000000002, "Text": " and then you can port it over to your architecture of choice, or change parts."}, {"Time_Start": 2828.7400000000002, "Time_End": 2832.2400000000002, "Text": " Depending on how agnostic you are, you know, maybe there's a reason they chose a pick,"}, {"Time_Start": 2832.2400000000002, "Time_End": 2836.04, "Text": " or maybe there's a reason they chose an 8051 or some other part."}, {"Time_Start": 2836.04, "Time_End": 2838.94, "Text": " Or finally, if you don't find what you're looking for, create your own."}, {"Time_Start": 2838.94, "Time_End": 2842.84, "Text": " And please share it with the world, because that's how the next guy who goes out"}, {"Time_Start": 2842.84, "Time_End": 2844.54, "Text": " looking on the web finds your project."}, {"Time_Start": 2845.44, "Time_End": 2850.44, "Text": " If you're looking for a starter book, the kit is the hardware you need."}, {"Time_Start": 2850.44, "Time_End": 2855.44, "Text": " The kit doesn't provide a good first order reference."}, {"Time_Start": 2855.44, "Time_End": 2858.44, "Text": " I finally, last year a lot of people were asking for a book,"}, {"Time_Start": 2858.44, "Time_End": 2860.44, "Text": " and there's a book called Get Going with AVR by Peter Sharp."}, {"Time_Start": 2860.44, "Time_End": 2865.44, "Text": " It's written in British, so it's got a few strange words in it,"}, {"Time_Start": 2865.44, "Time_End": 2867.44, "Text": " but it's a really good explanation."}, {"Time_Start": 2867.44, "Time_End": 2872.44, "Text": " It starts at very low level stuff, and it will explain to you what binary is,"}, {"Time_Start": 2872.44, "Time_End": 2874.44, "Text": " but it gets past that by about page four."}, {"Time_Start": 2874.44, "Time_End": 2875.44, "Text": " And then it really,"}, {"Time_Start": 2875.44, "Time_End": 2880.44, "Text": " really does get into some interesting applications and shows you how to make good use of the hardware."}, {"Time_Start": 2880.44, "Time_End": 2885.44, "Text": " It's designed around a slightly different candid development board, but you should be able to make the transition fairly painlessly."}, {"Time_Start": 2885.44, "Time_End": 2891.44, "Text": " Do read the documentation for this stuff because there are some quirks to the STK 100."}, {"Time_Start": 2891.44, "Time_End": 2899.44, "Text": " The control device, which is the, there's actually a microcontroller on there that it uses to send the code to your device through."}, {"Time_Start": 2899.44, "Time_End": 2905.42, "Text": " It's basically an in-system program controller actually controls the voltage that the process"}, {"Time_Start": 2905.44, "Time_End": 2906.44, "Text": " runs at."}, {"Time_Start": 2906.44, "Time_End": 2909.78, "Text": " And it took me the longest damn time to figure this out."}, {"Time_Start": 2909.78, "Time_End": 2913.2000000000003, "Text": " In spite of looking at the schematics, I was really embarrassed that I could not figure out why"}, {"Time_Start": 2913.2000000000003, "Time_End": 2917.2000000000003, "Text": " the thing would run three times faster when it was in run mode than in program mode, until"}, {"Time_Start": 2917.2000000000003, "Time_End": 2921.28, "Text": " I realized three, three, one megahertz, 350 kilohertz."}, {"Time_Start": 2921.28, "Time_End": 2924.62, "Text": " This sounds like the RC oscillator running at three volts."}, {"Time_Start": 2924.62, "Time_End": 2926.58, "Text": " Duh."}, {"Time_Start": 2926.58, "Time_End": 2931.78, "Text": " Also the ISP software requires Intel Hex files, which is not the default of ABR Studio."}, {"Time_Start": 2931.78, "Time_End": 2935.42, "Text": " This was also the source of far more wasted time than it should have been."}, {"Time_Start": 2935.44, "Time_End": 2936.44, "Text": " for me."}, {"Time_Start": 2936.44, "Time_End": 2940.94, "Text": " So it's embarrassing, but I admit it here to remind you that make sure the files you're generating"}, {"Time_Start": 2940.94, "Time_End": 2946.64, "Text": " because I had generated one hex file, generated one output file, and then had failed to save that change"}, {"Time_Start": 2946.64, "Time_End": 2947.68, "Text": " to the AVR studio."}, {"Time_Start": 2947.68, "Time_End": 2952.28, "Text": " So I could never figure out why my code, no matter how I would change it, didn't ever get better."}, {"Time_Start": 2952.28, "Time_End": 2956.1, "Text": " And it turns out I was downloading the same image into the part repeatedly."}, {"Time_Start": 2956.1, "Time_End": 2960.2400000000002, "Text": " Then, chance for me to drink some water."}, {"Time_Start": 2965.44, "Time_End": 2971.82, "Text": " Okay. I like to close these with an inspirational message, and one of the things"}, {"Time_Start": 2971.82, "Time_End": 2976.06, "Text": " I always say, like any good project, the hard part of these is getting started, and this year"}, {"Time_Start": 2976.06, "Time_End": 2980.48, "Text": " I added the caveat that you should cheat by starting with someone else's work, or a trivial"}, {"Time_Start": 2980.48, "Time_End": 2986.3, "Text": " example. And I have some trivial examples, I'm happy to give you."}, {"Time_Start": 2986.3, "Time_End": 2992.56, "Text": " I've got a very few minutes left in the talk, so I'm probably not going to do a demo of the dev studio."}, {"Time_Start": 2992.56, "Time_End": 2993.52, "Text": " It's pretty straightforward."}, {"Time_Start": 2993.52, "Time_End": 2995.42, "Text": " It's available online at the Atmel website for free."}, {"Time_Start": 2995.44, "Time_End": 2997.04, "Text": " I would encourage you to go take a look at it."}, {"Time_Start": 2997.04, "Time_End": 3000.84, "Text": " Even if you don't have the starter kit, you can at least play with the simulator."}, {"Time_Start": 3000.84, "Time_End": 3001.94, "Text": " Start small and work up from there."}, {"Time_Start": 3001.94, "Time_End": 3007.82, "Text": " Be willing to make mistakes because that's, like I said, I've tried to share my mistakes here,"}, {"Time_Start": 3007.82, "Time_End": 3013.38, "Text": " but if you do something stupid, at least you will only do it once, hopefully."}, {"Time_Start": 3013.38, "Time_End": 3015.8, "Text": " And then get involved, join the community of developers."}, {"Time_Start": 3015.8, "Time_End": 3019.54, "Text": " There's a lot of people who are interested in this stuff, and no matter how retarded your project"}, {"Time_Start": 3019.54, "Time_End": 3022.54, "Text": " is, there's probably at least one other person on earth who thinks it's as cool as you do."}, {"Time_Start": 3025.44, "Time_End": 3030.2000000000003, "Text": " So, to recap microcontrollers, a different development opportunity."}, {"Time_Start": 3030.2000000000003, "Time_End": 3034.44, "Text": " Gone over some of the characteristics of the AVR, specifically the AT Tiny 11."}, {"Time_Start": 3034.44, "Time_End": 3037.1, "Text": " We've looked at a lot of example functions, and then I've put the fun."}, {"Time_Start": 3037.1, "Time_End": 3038.44, "Text": " It's just fun to tinker with these."}, {"Time_Start": 3038.44, "Time_End": 3041.44, "Text": " It's neat to make blinking lights."}, {"Time_Start": 3041.44, "Time_End": 3044.4, "Text": " And then now is the chance to win the development environment."}, {"Time_Start": 3044.4, "Time_End": 3049.36, "Text": " I'll go into QA mode in just a second, but if you would like to submit feedback, I would strongly"}, {"Time_Start": 3049.36, "Time_End": 3052.98, "Text": " encourage you to give me feedback if you have a pen and paper."}, {"Time_Start": 3052.98, "Time_End": 3055.08, "Text": " If you don't ask the guy next to you."}, {"Time_Start": 3055.08, "Time_End": 3057.08, "Text": " Please write down your name or handle."}, {"Time_Start": 3057.08, "Time_End": 3062.08, "Text": " If you win one, it will be at the bellhop desk with your name or handle on it in an hour."}, {"Time_Start": 3062.08, "Time_End": 3065.08, "Text": " Because I've got to read the project ideas."}, {"Time_Start": 3065.08, "Time_End": 3067.08, "Text": " Tell me what I should change about this talk."}, {"Time_Start": 3067.08, "Time_End": 3071.08, "Text": " If there's anything you would have liked to see more of, less of,"}, {"Time_Start": 3071.08, "Time_End": 3075.08, "Text": " please tell me what I could do differently next year if I come back."}, {"Time_Start": 3075.08, "Time_End": 3076.08, "Text": " What, if anything, you liked about it?"}, {"Time_Start": 3076.08, "Time_End": 3081.08, "Text": " This is less important to me, but I ask this merely so I don't take out something good."}, {"Time_Start": 3081.08, "Time_End": 3084.08, "Text": " And then the important question for getting a development kit is,"}, {"Time_Start": 3084.08, "Time_End": 3085.08, "Text": " why do you want an SDK1?"}, {"Time_Start": 3085.08, "Time_End": 3087.08, "Text": " What's your cool project idea?"}, {"Time_Start": 3087.08, "Time_End": 3090.08, "Text": " The feedback is important to me, but the kits are awarded based on the project idea."}, {"Time_Start": 3090.08, "Time_End": 3096.08, "Text": " So even if you tell me I'm stupid, ugly, and I suck, but you have a good project idea, you will win a kit."}, {"Time_Start": 3096.08, "Time_End": 3099.08, "Text": " And like I said, winners can pick up theirs at the bellhop desk out front."}, {"Time_Start": 3099.08, "Time_End": 3103.08, "Text": " It's the thing out in front of the, it's outside where you can check your bags,"}, {"Time_Start": 3103.08, "Time_End": 3106.08, "Text": " and I will just stick your name on it and check it there."}, {"Time_Start": 3106.08, "Time_End": 3112.08, "Text": " And I'll try to post a list of the winning handles, and I will give away any, I don't give away here."}, {"Time_Start": 3112.08, "Time_End": 3114.08, "Text": " If you want to contact me, my email is."}, {"Time_Start": 3114.08, "Time_End": 3117.08, "Text": " my email address, Pking at PkScientific.com,"}, {"Time_Start": 3117.08, "Time_End": 3121.08, "Text": " and the subtle implicit plug for my not an agent jackets,"}, {"Time_Start": 3121.08, "Time_End": 3123.08, "Text": " which I'm not selling it at the moment anyway,"}, {"Time_Start": 3123.08, "Time_End": 3127.08, "Text": " the website for this talk is not an agent.com,"}, {"Time_Start": 3127.08, "Time_End": 3131.08, "Text": " and the slides and some of the examples will be available on there shortly."}, {"Time_Start": 3131.08, "Time_End": 3133.08, "Text": " I'm also, if you have other things you'd like me to add to the website,"}, {"Time_Start": 3133.08, "Time_End": 3135.08, "Text": " please feel free to send them along."}, {"Time_Start": 3135.08, "Time_End": 3137.08, "Text": " There's an AVR web ring."}, {"Time_Start": 3137.08, "Time_End": 3139.08, "Text": " I may or may not add the site to,"}, {"Time_Start": 3139.08, "Time_End": 3143.08, "Text": " but there's a lot of project rings that you can find if you just look around."}, {"Time_Start": 3143.08, "Time_End": 3144.14, "Text": " if you just look around."}, {"Time_Start": 3144.14, "Time_End": 3149.2599999999998, "Text": " It's a very fertile, very fertile environment online."}, {"Time_Start": 3149.2599999999998, "Time_End": 3154.02, "Text": " So Q&A, are there any general microcontroller questions,"}, {"Time_Start": 3154.02, "Time_End": 3157.2, "Text": " AVR specific, or who wants to try and win something"}, {"Time_Start": 3157.2, "Time_End": 3157.9, "Text": " with a project idea?"}, {"Time_Start": 3162.7799999999997, "Time_End": 3163.7999999999997, "Text": " Oh, sorry, yeah."}, {"Time_Start": 3165.16, "Time_End": 3166.08, "Text": " Hold on."}, {"Time_Start": 3167.48, "Time_End": 3170.52, "Text": " Yeah, that's the information I'm looking for in terms of feedback."}, {"Time_Start": 3171.3199999999997, "Time_End": 3172.2799999999997, "Text": " Was there, yes."}, {"Time_Start": 3173.08, "Time_End": 3175.08, "Text": " Yeah, sorry you."}, {"Time_Start": 3175.08, "Time_End": 3177.08, "Text": " For a project idea."}, {"Time_Start": 3177.08, "Time_End": 3178.08, "Text": " Project idea."}, {"Time_Start": 3178.08, "Time_End": 3186.08, "Text": " You know, maybe a basic Ethernet shift set, somehow did it work into the whole situation,"}, {"Time_Start": 3186.08, "Time_End": 3190.08, "Text": " and have a very basic, you know, kind of frame, set of memory,"}, {"Time_Start": 3190.08, "Time_End": 3198.08, "Text": " and then a simple type of interface to input, you know, maybe an arbitrary U.I.S. source, that's too much."}, {"Time_Start": 3198.08, "Time_End": 3202.08, "Text": " And that way you could, you know, you know, you could plug it into a network, a little bit slow."}, {"Time_Start": 3202.08, "Time_End": 3216.08, "Text": " A very small bit small."}, {"Time_Start": 3216.08, "Time_End": 3218.08, "Text": " So his idea was a very small spam bot, or IP stormbot."}, {"Time_Start": 3218.08, "Time_End": 3224.58, "Text": " So his idea was an IP packet spewer based on a microcontroller where you"}, {"Time_Start": 3224.58, "Time_End": 3228.84, "Text": " where you pre-compute the frame and have it sitting in memory and have the thing hooked up to an"}, {"Time_Start": 3228.84, "Time_End": 3229.84, "Text": " Ethernet controller."}, {"Time_Start": 3229.84, "Time_End": 3235.6400000000003, "Text": " Uh, hooking up to an Ethernet controller is, is a few more pins than we have here,"}, {"Time_Start": 3235.6400000000003, "Time_End": 3239.6400000000003, "Text": " but, but you could probably, you could probably do it with a couple of eight-pin ports."}, {"Time_Start": 3239.6400000000003, "Time_End": 3241.84, "Text": " What you've described in part is the PICO web."}, {"Time_Start": 3241.84, "Time_End": 3244.04, "Text": " I don't know if anyone is raising their hand to mention this."}, {"Time_Start": 3244.04, "Time_End": 3252.94, "Text": " There actually is a, uh, a, a, an AVR to, um, to an ISA Ethernet controller device."}, {"Time_Start": 3252.94, "Time_End": 3255.94, "Text": " It's not designed to spew out packets as fast as you want to."}, {"Time_Start": 3255.94, "Time_End": 3259.34, "Text": " It's designed to actually be a complete web server, but, uh,"}, {"Time_Start": 3259.34, "Time_End": 3263.34, "Text": " Let's get an audience approval rating."}, {"Time_Start": 3263.34, "Time_End": 3267.34, "Text": " Does a packet storm generator based on a microcontroller and Ethernet chip"}, {"Time_Start": 3267.34, "Time_End": 3269.34, "Text": " merit to development box?"}, {"Time_Start": 3269.34, "Time_End": 3271.34, "Text": " Yes, no, yes."}, {"Time_Start": 3271.34, "Time_End": 3275.34, "Text": " Show of hands, everyone who thinks he should get one."}, {"Time_Start": 3275.34, "Time_End": 3277.34, "Text": " Everyone who doesn't?"}, {"Time_Start": 3277.34, "Time_End": 3279.34, "Text": " Clock rate problems."}, {"Time_Start": 3279.34, "Time_End": 3281.34, "Text": " Clock rate problems."}, {"Time_Start": 3281.34, "Time_End": 3285.34, "Text": " Even at 10 megabit, you're 1 megahertz processor or even a 6 megars"}, {"Time_Start": 3285.34, "Time_End": 3287.34, "Text": " problem that is going to run fast enough to use those out."}, {"Time_Start": 3287.34, "Time_End": 3292.34, "Text": " But it might be running fast enough if you got an Ethernet controller with onboard memory"}, {"Time_Start": 3292.34, "Time_End": 3294.34, "Text": " to at least tell it, send that frame again."}, {"Time_Start": 3294.34, "Time_End": 3300.34, "Text": " So for what it's worth, I will at least concede that you could build it."}, {"Time_Start": 3300.34, "Time_End": 3303.34, "Text": " Is there anyone speaking in his defense?"}, {"Time_Start": 3303.34, "Time_End": 3307.34, "Text": " I have a solution that will make his idea work."}, {"Time_Start": 3307.34, "Time_End": 3309.34, "Text": " A solution, okay."}, {"Time_Start": 3309.34, "Time_End": 3316.34, "Text": " We have a hard-word T-R-P stuff so he can interface with SPI."}, {"Time_Start": 3316.34, "Time_End": 3317.34, "Text": " And you can interface with SDI."}, {"Time_Start": 3317.34, "Time_End": 3321.34, "Text": " use a clock data."}, {"Time_Start": 3321.34, "Time_End": 3327.34, "Text": " Okay, it's a three-wire interface to a hardware-based IP stack, did you say?"}, {"Time_Start": 3327.34, "Time_End": 3330.34, "Text": " Okay, well, so that makes it work."}, {"Time_Start": 3330.34, "Time_End": 3333.34, "Text": " You can actually look at a reference design at iReady.org."}, {"Time_Start": 3333.34, "Time_End": 3336.34, "Text": " So reference design for that available at iReady.org."}, {"Time_Start": 3336.34, "Time_End": 3338.34, "Text": " So, okay, it sounds like it's going to work."}, {"Time_Start": 3338.34, "Time_End": 3340.34, "Text": " I think I'm going to give it to him."}, {"Time_Start": 3347.34, "Time_End": 3348.52, "Text": " Hold on a sec. Could you hand that back?"}, {"Time_Start": 3351.96, "Time_End": 3353.84, "Text": " Yeah, it's a big green box. We can see it."}, {"Time_Start": 3356.2400000000002, "Time_End": 3362.7400000000002, "Text": " Okay, yes. A single key keyboard."}, {"Time_Start": 3377.34, "Time_End": 3388.34, "Text": " A single key keyboard for going from Morse code to a"}, {"Time_Start": 3388.34, "Time_End": 3393.34, "Text": " so that you can use it while driving or roller skating."}, {"Time_Start": 3397.34, "Time_End": 3399.34, "Text": " I think that's a winner, yeah."}, {"Time_Start": 3399.34, "Time_End": 3404.34, "Text": " Let me recommend you use power to walk faster than single key."}, {"Time_Start": 3404.34, "Time_End": 3407.32, "Text": " And if you're really ambitious and want to stick"}, {"Time_Start": 3407.34, "Time_End": 3410.34, "Text": " buttons on it you could do a nibble-based cordic keyboard."}, {"Time_Start": 3426.34, "Time_End": 3428.34, "Text": " See, the people in the back always get screwed."}, {"Time_Start": 3428.34, "Time_End": 3432.34, "Text": " You, the guy in the white, is that free geek."}, {"Time_Start": 3432.34, "Time_End": 3435.34, "Text": " Is that a label or a command?"}, {"Time_Start": 3435.34, "Time_End": 3436.34, "Text": " Okay."}, {"Time_Start": 3436.34, "Time_End": 3437.34, "Text": " Okay."}, {"Time_Start": 3437.34, "Time_End": 3455.34, "Text": " So, okay, he wants to build"}, {"Time_Start": 3455.34, "Time_End": 3464.34, "Text": " Okay, he wants to build something for use at FreeGeek, which is a stepper motor to swap for a robotic arm to swap in a tape farm in a tape farm."}, {"Time_Start": 3467.34, "Time_End": 3469.34, "Text": " libraries are really expensive."}, {"Time_Start": 3469.34, "Time_End": 3471.34, "Text": " Your old arm is it?"}, {"Time_Start": 3471.34, "Time_End": 3474.34, "Text": " Legos."}, {"Time_Start": 3474.34, "Time_End": 3482.34, "Text": " Yes, the Lego Mindstorm kit is a great way to build the mechanical portion of your design."}, {"Time_Start": 3482.34, "Time_End": 3487.34, "Text": " Okay, so there's, hmm."}, {"Time_Start": 3487.34, "Time_End": 3491.34, "Text": " The trouble that leaps to mind is at least with the minimal I.O."}, {"Time_Start": 3491.34, "Time_End": 3495.34, "Text": " You're going to get one stepper motor, so you're going to have one degree of freedom,"}, {"Time_Start": 3495.34, "Time_End": 3496.34, "Text": " which is a fairly limited robotic arm."}, {"Time_Start": 3496.34, "Time_End": 3498.34, "Text": " robotic arm."}, {"Time_Start": 3498.34, "Time_End": 3501.34, "Text": " I'm going to be cruel and throw this one entirely to the audience,"}, {"Time_Start": 3501.34, "Time_End": 3503.34, "Text": " and this time I'm actually going to listen to what they say."}, {"Time_Start": 3503.34, "Time_End": 3508.34, "Text": " Who thinks the robotic arm control for a tape farm should get it?"}, {"Time_Start": 3508.34, "Time_End": 3511.34, "Text": " And not?"}, {"Time_Start": 3511.34, "Time_End": 3514.34, "Text": " I'm sorry."}, {"Time_Start": 3514.34, "Time_End": 3516.34, "Text": " Submit a feedback form."}, {"Time_Start": 3516.34, "Time_End": 3517.34, "Text": " What?"}, {"Time_Start": 3517.34, "Time_End": 3519.34, "Text": " What?"}, {"Time_Start": 3519.34, "Time_End": 3520.34, "Text": " It's what eBay is for."}, {"Time_Start": 3520.34, "Time_End": 3522.34, "Text": " Yeah, that's what eBay is for."}, {"Time_Start": 3522.34, "Time_End": 3526.32, "Text": " And another thing I would point out is if you get out of here and you've submitted a feedback"}, {"Time_Start": 3526.34, "Time_End": 3531.34, "Text": " for them and you still don't get one, call up atmel and sound either really smart"}, {"Time_Start": 3531.34, "Time_End": 3536.34, "Text": " or really pathetic and there's a good chance that there's a good chance that they will send"}, {"Time_Start": 3536.34, "Time_End": 3541.34, "Text": " you one, especially if you're a student asked to speak to the university liaison because"}, {"Time_Start": 3541.34, "Time_End": 3547.34, "Text": " they do like to get these things into schools or if you can just say you're a student."}, {"Time_Start": 3547.34, "Time_End": 3550.34, "Text": " Okay, the guy with both hands up and the gesture cap."}, {"Time_Start": 3556.34, "Time_End": 3568.34, "Text": " And we're using the DCMS out for the recording test, and we've got it hooked into a phone line where it'll dial the number and everything."}, {"Time_Start": 3568.34, "Time_End": 3585.84, "Text": " With that bolt each drop from the other end picks up, it'll automatically play the recording message and say whatever and act like maybe a computer survey or something and have them type in or have it record your voice and keep it in memory."}, {"Time_Start": 3585.84, "Time_End": 3586.32, "Text": " Okay."}, {"Time_Start": 3586.34, "Time_End": 3588.34, "Text": " Okay."}, {"Time_Start": 3588.34, "Time_End": 3592.34, "Text": " So it's an answering machine that calls out for you."}, {"Time_Start": 3592.34, "Time_End": 3595.34, "Text": " Oh, good."}, {"Time_Start": 3595.34, "Time_End": 3604.34, "Text": " It's, it's, it's, it's, he's using DTMF and an external voice recorder chip to dial out and wait for the other end to pick up and record."}, {"Time_Start": 3604.34, "Time_End": 3605.34, "Text": " Am I basically getting it right?"}, {"Time_Start": 3605.34, "Time_End": 3611.34, "Text": " And it'll ask them a question and you can record what they say or have them questions"}, {"Time_Start": 3611.34, "Time_End": 3612.34, "Text": " and get information."}, {"Time_Start": 3612.34, "Time_End": 3615.34, "Text": " Okay, and it'll respond to DTMF tones from them."}, {"Time_Start": 3615.34, "Time_End": 3616.34, "Text": " Okay."}, {"Time_Start": 3616.34, "Time_End": 3623.34, "Text": " A social engineering or telemarketing tool."}, {"Time_Start": 3623.34, "Time_End": 3625.34, "Text": " Okay."}, {"Time_Start": 3625.34, "Time_End": 3631.34, "Text": " Throwing it to the audience, does he get one?"}, {"Time_Start": 3631.34, "Time_End": 3634.34, "Text": " Oh, I'm sorry, hostile crowd."}, {"Time_Start": 3634.34, "Time_End": 3636.34, "Text": " All right."}, {"Time_Start": 3636.34, "Time_End": 3639.34, "Text": " Am I just about out of time?"}, {"Time_Start": 3639.34, "Time_End": 3640.34, "Text": " How much longer can I go?"}, {"Time_Start": 3640.34, "Time_End": 3643.34, "Text": " Well, I haven't had any word of the next speaker."}, {"Time_Start": 3643.34, "Time_End": 3644.34, "Text": " Okay."}, {"Time_Start": 3644.34, "Time_End": 3645.34, "Text": " So we got to do."}, {"Time_Start": 3645.34, "Time_End": 3646.84, "Text": " So we got the next speaker."}, {"Time_Start": 3646.84, "Time_End": 3651.34, "Text": " Okay, so I'm pretty much running out of time."}, {"Time_Start": 3651.34, "Time_End": 3653.34, "Text": " I'm going to take one more."}, {"Time_Start": 3653.34, "Time_End": 3658.34, "Text": " And again, the guy sort of toward the back in the blue cap."}, {"Time_Start": 3658.34, "Time_End": 3661.34, "Text": " Yeah."}, {"Time_Start": 3661.34, "Time_End": 3667.34, "Text": " Could you speak up?"}, {"Time_Start": 3667.34, "Time_End": 3673.34, "Text": " I caught a link between a Game Boy and..."}, {"Time_Start": 3673.34, "Time_End": 3674.34, "Text": " Oh, okay."}, {"Time_Start": 3674.34, "Time_End": 3678.34, "Text": " Using the link port on the Game Boy Advance and basically building glue between that and a PC?"}, {"Time_Start": 3682.34, "Time_End": 3683.34, "Text": " Ah."}, {"Time_Start": 3683.34, "Time_End": 3692.34, "Text": " Okay, so would you be running, I mean, would you be using the Game Boy to,"}, {"Time_Start": 3692.34, "Time_End": 3695.34, "Text": " would you be running games on the Game Boy or using the Game Boy as a terminal for the PC?"}, {"Time_Start": 3695.34, "Time_End": 3703.34, "Text": " Okay."}, {"Time_Start": 3703.34, "Time_End": 3704.34, "Text": " Okay."}, {"Time_Start": 3704.34, "Time_End": 3711.34, "Text": " So it's a development project for basically the Game Boy as a console."}, {"Time_Start": 3711.34, "Time_End": 3713.34, "Text": " I don't know, sounds kind of cool."}, {"Time_Start": 3713.34, "Time_End": 3716.34, "Text": " What's the consensus?"}, {"Time_Start": 3716.34, "Time_End": 3718.34, "Text": " All in favor?"}, {"Time_Start": 3718.34, "Time_End": 3722.34, "Text": " All opposed?"}, {"Time_Start": 3722.34, "Time_End": 3727.34, "Text": " Okay, the hostile people are less adamant."}, {"Time_Start": 3727.34, "Time_End": 3730.34, "Text": " I think you get one. Can you come on up here at the end?"}, {"Time_Start": 3730.34, "Time_End": 3733.34, "Text": " And if everyone could just bring feedback forms if you've got them up to me,"}, {"Time_Start": 3733.34, "Time_End": 3736.34, "Text": " If you've got them up to me, I'm going to wrap it up now so the next guy can speak."}, {"Time_Start": 3736.34, "Time_End": 3737.34, "Text": " But thank you very much."}, {"Time_Start": 3737.34, "Time_End": 3738.34, "Text": " You've been a great audience."}]}