{"segments": [{"Time_Start": 0.0, "Time_End": 27.88, "Text": " The advanced uses, but the last thing is probably the most important, and that is that intrusion detection is not a process, I'm sorry, it is a process, it's not a product."}, {"Time_Start": 30.0, "Time_End": 34.0, "Text": " You'll have to forgive me on the slide there."}, {"Time_Start": 34.0, "Time_End": 38.88, "Text": " I'm a stand in, so I was struggling to get this presentation together."}, {"Time_Start": 38.88, "Time_End": 41.86, "Text": " Really, first off, what is intrusion detection?"}, {"Time_Start": 41.86, "Time_End": 50.42, "Text": " And it's the ability to detect attempted break-ins, anomalous behavior, and some system misuse."}, {"Time_Start": 50.42, "Time_End": 55.96, "Text": " And really, in the host-based world, what we see there is file integrity checking as well as audit"}, {"Time_Start": 55.96, "Time_End": 57.58, "Text": " log monitoring."}, {"Time_Start": 57.58, "Time_End": 59.980000000000004, "Text": " And then, of course, on the network side, we see..."}, {"Time_Start": 60.0, "Time_End": 65.3, "Text": " monitoring of network communications."}, {"Time_Start": 65.3, "Time_End": 70.64, "Text": " As far as capabilities are concerned, we really have monitoring, recording, notifying,"}, {"Time_Start": 70.64, "Time_End": 72.82, "Text": " reacting, and then of course archiving."}, {"Time_Start": 72.82, "Time_End": 78.24000000000001, "Text": " And if you look at monitoring, you're looking at all of the traffic that is passing a particular"}, {"Time_Start": 78.24000000000001, "Time_End": 87.36, "Text": " network segment, as well as on the host side, the ability to review host audit logs."}, {"Time_Start": 87.36, "Time_End": 89.98, "Text": " What you're ending up doing is having a set of"}, {"Time_Start": 90.0, "Time_End": 97.0, "Text": " of signatures that goes and records things when it sees particular signatures matched."}, {"Time_Start": 97.0, "Time_End": 102.4, "Text": " And then, of course, depending on the policies that you have set in place, when it sees a particular"}, {"Time_Start": 102.4, "Time_End": 107.72, "Text": " event that is matched, it can alert an analyst or administrator."}, {"Time_Start": 107.72, "Time_End": 115.5, "Text": " This allows the administrator to react dynamically to a situation that might be putting your"}, {"Time_Start": 115.5, "Time_End": 119.72, "Text": " information resources into a precarious situation."}, {"Time_Start": 119.72, "Time_End": 128.52, "Text": " And then lastly, of course, is keeping that information in archive format so that you can go back for not only prosecution support,"}, {"Time_Start": 128.52, "Time_End": 132.66, "Text": " but so that you can go and do data mining and event correlation."}, {"Time_Start": 134.26, "Time_End": 141.4, "Text": " So I like to think of intrusion detection, especially network-based intrusion detection, is the ADT of information security."}, {"Time_Start": 141.74, "Time_End": 144.54, "Text": " It just kind of sits and watches for you."}, {"Time_Start": 145.2, "Time_End": 149.7, "Text": " It's a misuse-based system, and really what that means is it's a misuse-based system, and really what that means is it's"}, {"Time_Start": 149.72, "Time_End": 154.72, "Text": " looking to recognize patterns and signatures."}, {"Time_Start": 154.72, "Time_End": 158.72, "Text": " This is really the majority of the systems that are out there."}, {"Time_Start": 158.72, "Time_End": 166.22, "Text": " NFR securities, NFR product, ISS, snort is also written this way."}, {"Time_Start": 166.22, "Time_End": 170.52, "Text": " The one thing to note about these systems is that they're really only as good as the programmers"}, {"Time_Start": 170.52, "Time_End": 172.22, "Text": " who are writing the signatures."}, {"Time_Start": 172.22, "Time_End": 175.72, "Text": " So if you have a lot of signatures and they're not very vague,"}, {"Time_Start": 175.72, "Time_End": 179.62, "Text": " then you can get a fairly robust system and not collect too much information."}, {"Time_Start": 179.72, "Time_End": 193.72, "Text": " We'll get to anomaly detection in a little bit, and then I can ask or answer questions about that."}, {"Time_Start": 193.72, "Time_End": 209.7, "Text": " But for the most part, just as an upfront, you tend to see anomaly detection in government organizations as well as research organizations that have the resources and time to go through and actually do"}, {"Time_Start": 209.72, "Time_End": 213.82, "Text": " some types of data mining to see more information like that."}, {"Time_Start": 215.42, "Time_End": 218.42, "Text": " What intrusion detection is not is a fix-all."}, {"Time_Start": 218.92, "Time_End": 222.82, "Text": " A lot of people seem to think that if they have an intrusion detection system,"}, {"Time_Start": 222.82, "Time_End": 228.24, "Text": " that it's going to tell them that someone's trying to break in and that it'll be all right."}, {"Time_Start": 228.4, "Time_End": 229.98, "Text": " But that isn't the case."}, {"Time_Start": 230.52, "Time_End": 235.64, "Text": " Just like a vulnerability scanner, it's telling you that the vulnerability is there,"}, {"Time_Start": 235.72, "Time_End": 238.52, "Text": " or it's telling you that someone is trying to exploit the system,"}, {"Time_Start": 238.86, "Time_End": 239.7, "Text": " but it's not passive."}, {"Time_Start": 239.72, "Time_End": 246.72, "Text": " the whole. Additionally, it's not a firewall. It does not control access in most cases"}, {"Time_Start": 246.72, "Time_End": 256.72, "Text": " to particular information resources. There are configurations in which you could issue a TCP reset to try and kill a session,"}, {"Time_Start": 256.72, "Time_End": 263.72, "Text": " but generally speaking, you don't want to dynamically reconfigure security controls based on intrusion detection."}, {"Time_Start": 263.72, "Time_End": 269.7, "Text": " And of course, it's not a perfect system. It's prone to false positives and can be able to"}, {"Time_Start": 269.72, "Time_End": 273.36, "Text": " somewhat complicated to use as well as fairly immature."}, {"Time_Start": 277.36, "Time_End": 282.44000000000005, "Text": " In complementing your existing security controls, it's really adding another level of security."}, {"Time_Start": 282.90000000000003, "Time_End": 290.04, "Text": " I like to think of people's organizations from a security standpoint as being like an M&M."}, {"Time_Start": 290.12, "Time_End": 293.20000000000005, "Text": " It's hard and crunchy on the outside, but kind of mushy on the inside."}, {"Time_Start": 293.86, "Time_End": 298.72, "Text": " And so when implementing intrusion detection, you're adding another layer of security."}, {"Time_Start": 299.72, "Time_End": 301.76000000000005, "Text": " It also operates in near real time."}, {"Time_Start": 302.02000000000004, "Time_End": 310.02000000000004, "Text": " Obviously, there's a certain amount of latency that occurs when you have a system that matches patterns and then sends an alert."}, {"Time_Start": 310.02000000000004, "Time_End": 315.22, "Text": " But for the most part, we consider it to be a real-time system."}, {"Time_Start": 316.04, "Time_End": 321.64000000000004, "Text": " Additionally, you can use intrusion detection as a check-in balance for security configurations,"}, {"Time_Start": 321.84000000000003, "Time_End": 324.42, "Text": " especially things along the nature of firewalls."}, {"Time_Start": 325.26000000000005, "Time_End": 329.70000000000005, "Text": " If certain types of traffic are getting through your firewall that you hadn't intended and your"}, {"Time_Start": 329.72, "Time_End": 335.88000000000005, "Text": " intrusion detection system can pick it up, then that would be your check-and-balance."}, {"Time_Start": 335.88000000000005, "Time_End": 340.48, "Text": " When you first install intrusion detection systems, whether it be network or host or file integrity"}, {"Time_Start": 340.48, "Time_End": 348.42, "Text": " checking, it allows you to get a baseline of information to get a good picture of the security posture."}, {"Time_Start": 348.42, "Time_End": 353.40000000000003, "Text": " And then, of course, intrusion detection also allows you to adapt to changes more quickly."}, {"Time_Start": 353.40000000000003, "Time_End": 359.70000000000005, "Text": " A specific example, I was working for an insurance company when the Melissa virus,"}, {"Time_Start": 359.72, "Time_End": 366.22, "Text": " came out. And so we took our intrusion detection systems and wrote a signature so that"}, {"Time_Start": 366.22, "Time_End": 372.3, "Text": " when it saw the subject header of Melissa, that it would issue a TCP reset. And it would kill"}, {"Time_Start": 372.3, "Time_End": 379.66, "Text": " a number of the attempted emails. And then, of course, ad hoc security needs. If you think that"}, {"Time_Start": 379.66, "Time_End": 385.1, "Text": " there's someone who's looking at a lot of offensive material on the Internet, you could write"}, {"Time_Start": 385.1, "Time_End": 388.24, "Text": " signatures to specifically monitor them."}, {"Time_Start": 389.72, "Time_End": 391.0, "Text": " So what about your firewall?"}, {"Time_Start": 391.86, "Time_End": 397.5, "Text": " Intrusion detection complements firewalls, in that firewalls provide access, and intrusion detection"}, {"Time_Start": 397.5, "Time_End": 401.98, "Text": " systems allow you to recognize the types of traffic that come in."}, {"Time_Start": 402.1, "Time_End": 408.96000000000004, "Text": " So a good example would be people that are coming to the con today, as they walk into the lobby,"}, {"Time_Start": 409.32000000000005, "Time_End": 411.86, "Text": " they have their badges, so they're allowed to come in."}, {"Time_Start": 412.08000000000004, "Time_End": 413.64000000000004, "Text": " That's kind of their access."}, {"Time_Start": 414.22, "Time_End": 419.70000000000005, "Text": " However, they could be carrying a backpack that contained tear gas or firearms or something."}, {"Time_Start": 419.72, "Time_End": 425.12, "Text": " that could be very harmful to the other attendees. And in a real-life scenario,"}, {"Time_Start": 425.12, "Time_End": 431.12, "Text": " that could be applied to intrusion detection. So firewalls allow for the right access, such"}, {"Time_Start": 431.12, "Time_End": 437.54, "Text": " as HTTP going through Port 80 on a firewall to get to its end host, but if it's a"}, {"Time_Start": 437.54, "Time_End": 443.6, "Text": " malicious string, then intrusion detection would be able to pick that up. And then, of"}, {"Time_Start": 443.6, "Time_End": 449.52000000000004, "Text": " course, intrusion detection isn't just for the perimeter. It can be used on any network segment"}, {"Time_Start": 449.52, "Time_End": 453.29999999999995, "Text": " that has critical information resources or anything that you might want to monitor."}, {"Time_Start": 455.03999999999996, "Time_End": 463.06, "Text": " So here's your typical firewall log, has the date and time, and it just kind of says which ports it's going,"}, {"Time_Start": 463.2, "Time_End": 467.03999999999996, "Text": " which ports network traffic is going through, whether it allowed it or not."}, {"Time_Start": 467.58, "Time_End": 475.02, "Text": " And then, of course, you have off an old dragon display, a little bit more information."}, {"Time_Start": 475.02, "Time_End": 479.14, "Text": " So this is giving you that it saw SSH version 1."}, {"Time_Start": 479.52, "Time_End": 483.58, "Text": " and some of the information tied to that."}, {"Time_Start": 483.58, "Time_End": 489.85999999999996, "Text": " Oftentimes, I like to refer to intrusion detection with the fence analogy."}, {"Time_Start": 489.85999999999996, "Time_End": 496.53999999999996, "Text": " Really, fences protect perimeters, a lot along the lines of the way firewalls do."}, {"Time_Start": 496.53999999999996, "Time_End": 502.97999999999996, "Text": " But they don't detect suspicious activity, and that's what intrusion detection systems do."}, {"Time_Start": 502.97999999999996, "Time_End": 509.32, "Text": " This goes back to the discussion about people coming into the con and what they might bring."}, {"Time_Start": 509.52000000000004, "Time_End": 515.38, "Text": " So if you don't know what they're bringing, but they have the right access, that's operating like a firewall."}, {"Time_Start": 515.58, "Time_End": 521.1600000000001, "Text": " Whereas if you could see the contents after the access, then that would be more like intrusion detection."}, {"Time_Start": 522.76, "Time_End": 529.98, "Text": " So now getting into the components of intrusion detection, you really have the data collectors, a repository in which to keep all your information,"}, {"Time_Start": 530.5, "Time_End": 532.4000000000001, "Text": " and then a means by which to display that."}, {"Time_Start": 532.7, "Time_End": 536.5600000000001, "Text": " And then finally, event notification, so you know what to do with what you're seeing."}, {"Time_Start": 538.7800000000001, "Time_End": 539.5, "Text": " The different."}, {"Time_Start": 539.52, "Time_End": 544.52, "Text": " types of intrusion detection systems. First you have the misuse based, and that's"}, {"Time_Start": 544.52, "Time_End": 549.96, "Text": " they're programmed for specific use and what you end up having is attack signatures. And"}, {"Time_Start": 549.96, "Time_End": 555.78, "Text": " these attack signatures are written to see different things on the network or different types"}, {"Time_Start": 555.78, "Time_End": 562.4399999999999, "Text": " of behavior on the host. And then, of course, you have anomaly detection. And that's something"}, {"Time_Start": 562.4399999999999, "Time_End": 568.8, "Text": " that's looking for things that are more difficult to find. For instance, you're looking at slow"}, {"Time_Start": 568.8000000000001, "Time_End": 575.7600000000001, "Text": " and low attacks, or you're looking at the types of users who log on every day from 9 to 5,"}, {"Time_Start": 575.8800000000001, "Time_End": 578.7800000000001, "Text": " but then last Tuesday they were on at 2 o'clock in the morning."}, {"Time_Start": 579.22, "Time_End": 585.7800000000001, "Text": " So it's much more event trending and correlation, and you get into data mining,"}, {"Time_Start": 585.8800000000001, "Time_End": 592.1800000000001, "Text": " and then, of course, at the very high-end level, you have organizations that are now starting to get into using artificial intelligence."}, {"Time_Start": 595.6800000000001, "Time_End": 598.7800000000001, "Text": " There are really three very popular."}, {"Time_Start": 598.8000000000001, "Time_End": 603.8000000000001, "Text": " methods of deploying intrusion detection. The first is the network node-based"}, {"Time_Start": 603.8000000000001, "Time_End": 610.1400000000001, "Text": " intrusion detection, which works very much like your regular network probe in that it sits"}, {"Time_Start": 610.1400000000001, "Time_End": 615.8000000000001, "Text": " out on the network and it looks at the traffic. However, it's deployed on a specific host,"}, {"Time_Start": 615.8000000000001, "Time_End": 623.46, "Text": " and it only monitors traffic inbound to or outbound from that host. Probably what most everyone"}, {"Time_Start": 623.46, "Time_End": 628.7800000000001, "Text": " is familiar with is the network-based intrusion detection where you would have a very inconspicuous"}, {"Time_Start": 628.8000000000001, "Time_End": 635.8000000000001, "Text": " probes sitting out on the network that had a stealth interface and at monitors an entire"}, {"Time_Start": 635.8000000000001, "Time_End": 642.3000000000001, "Text": " network segment. And then finally, host-based intrusion detection, which is also deployed at the host"}, {"Time_Start": 642.3000000000001, "Time_End": 650.1600000000001, "Text": " and monitors, audit logs, and things of that nature. So really, the pros that you get with the"}, {"Time_Start": 650.1600000000001, "Time_End": 655.1200000000001, "Text": " network node intrusion detection is you're getting the benefit of having the network intrusion"}, {"Time_Start": 655.1200000000001, "Time_End": 658.7800000000001, "Text": " detection at the host. It's unconcerned with bandwidth issues."}, {"Time_Start": 658.8000000000001, "Time_End": 660.8000000000001, "Text": " because it's not looking at the entire network."}, {"Time_Start": 660.8000000000001, "Time_End": 665.3000000000001, "Text": " And depending upon where in the stack encryption is,"}, {"Time_Start": 665.3000000000001, "Time_End": 669.8000000000001, "Text": " you may be able to work against some encryption."}, {"Time_Start": 669.8000000000001, "Time_End": 674.3000000000001, "Text": " Unfortunately, since it is network-based intrusion detection,"}, {"Time_Start": 674.3000000000001, "Time_End": 677.3000000000001, "Text": " it really isn't telling you what the impact on the host is."}, {"Time_Start": 677.3000000000001, "Time_End": 681.8000000000001, "Text": " It's not telling you if critical system files were changed,"}, {"Time_Start": 681.8000000000001, "Time_End": 683.8000000000001, "Text": " whether or not the system's vulnerable."}, {"Time_Start": 683.8000000000001, "Time_End": 687.3000000000001, "Text": " And then, of course, there's issues of scalability."}, {"Time_Start": 687.3000000000001, "Time_End": 688.3000000000001, "Text": " If you're going to,"}, {"Time_Start": 688.3000000000001, "Time_End": 694.3000000000001, "Text": " If you're going to implement a piece of software out on each host in your network,"}, {"Time_Start": 694.3000000000001, "Time_End": 698.3000000000001, "Text": " you're going to get into a situation where it may not scale."}, {"Time_Start": 698.3000000000001, "Time_End": 702.3000000000001, "Text": " Network pros and cons."}, {"Time_Start": 702.3000000000001, "Time_End": 707.3000000000001, "Text": " I'm really, really torn on this because I've worked with network-based intrusion detection"}, {"Time_Start": 707.3000000000001, "Time_End": 711.3000000000001, "Text": " for a number of years, and it's just failed me so many times."}, {"Time_Start": 711.3000000000001, "Time_End": 717.3000000000001, "Text": " But basically what you've got is the ability to have something that's kind of more bang for your buck."}, {"Time_Start": 717.3000000000001, "Time_End": 722.3000000000001, "Text": " bang for your buck. It goes and it monitors an entire network segment."}, {"Time_Start": 722.3000000000001, "Time_End": 728.3000000000001, "Text": " It has no fingerprint out on the network so long as you're operating with a stealth interface"}, {"Time_Start": 728.3000000000001, "Time_End": 733.3000000000001, "Text": " and then you've got, you know, another management interface on another network."}, {"Time_Start": 733.3000000000001, "Time_End": 739.3000000000001, "Text": " The problem with this, once again, is that it's unaware of whether or not an attack is successful."}, {"Time_Start": 739.3000000000001, "Time_End": 747.1, "Text": " Once you start getting into higher bandwidth, it starts either dropping packets or it's not fast enough to"}, {"Time_Start": 747.1, "Time_End": 754.1, "Text": " process everything it's seen. So it may get all the packets, but it's not detecting all of the"}, {"Time_Start": 754.1, "Time_End": 763.1, "Text": " all of the exploits. The host base, on the other hand, is aware of what the system impact is."}, {"Time_Start": 763.1, "Time_End": 768.1, "Text": " And of course, it's unconcerned with the bandwidth because it has nothing to do with the network."}, {"Time_Start": 768.1, "Time_End": 776.1, "Text": " But once again, now you're losing the network aspect in that you're only looking at system audit logs and accounts."}, {"Time_Start": 776.1, "Time_End": 781.7, "Text": " And of course, because it's limited to one host, you get back into the scalability issues."}, {"Time_Start": 783.7, "Time_End": 788.64, "Text": " As far as variations of architecture are concerned, there are really four."}, {"Time_Start": 789.24, "Time_End": 791.0400000000001, "Text": " And your first is your stand-alone."}, {"Time_Start": 792.3000000000001, "Time_End": 801.98, "Text": " And that would be something where you would have to go out and individually or independently log into each monitor that you had in order to extract the contents of it."}, {"Time_Start": 801.98, "Time_End": 806.08, "Text": " This is normally something that you would see deployed in a very large, or I'm sorry,"}, {"Time_Start": 806.1, "Time_End": 809.1, "Text": " sorry, a very small environment that didn't have money to spend."}, {"Time_Start": 809.1, "Time_End": 815.1, "Text": " And of course, in this type of environment, the event correlation becomes extremely difficult"}, {"Time_Start": 815.1, "Time_End": 820.1, "Text": " because you don't have a centralized data repository for everything to come back to."}, {"Time_Start": 822.1, "Time_End": 835.94, "Text": " Typically speaking, in a distributed system where you have products such as ISS or Accent or CyberSafe even for the host piece,"}, {"Time_Start": 836.1, "Time_End": 839.9, "Text": " what you have is multiple agents reporting back to a command console."}, {"Time_Start": 840.74, "Time_End": 847.3000000000001, "Text": " And that command console can push down information, and it makes it easier to correlate events."}, {"Time_Start": 847.3000000000001, "Time_End": 852.5600000000001, "Text": " But the problem there is you've got a one-to-many relationship."}, {"Time_Start": 852.86, "Time_End": 853.64, "Text": " It's two-tiered."}, {"Time_Start": 853.72, "Time_End": 855.66, "Text": " It's not truly three-tiered."}, {"Time_Start": 856.0600000000001, "Time_End": 863.34, "Text": " And so you're only allowed to operate with one analyst at a console at a time."}, {"Time_Start": 864.08, "Time_End": 866.08, "Text": " And so an ideally distributed."}, {"Time_Start": 866.1, "Time_End": 873.1, "Text": " environment would be having many agents, whether they be host, network, network node,"}, {"Time_Start": 873.1, "Time_End": 879.6, "Text": " file integrity checking, reporting back to a central data repository, and then having something"}, {"Time_Start": 879.6, "Time_End": 887.1, "Text": " such as a GUI client sitting out at your analyst's desktop so that they could easily log in and pull all of that information."}, {"Time_Start": 887.1, "Time_End": 894.1, "Text": " And then, of course, I mentioned managed environments because I used to work for a managed security service provider."}, {"Time_Start": 894.1, "Time_End": 896.08, "Text": " But basically here in this type of"}, {"Time_Start": 896.1, "Time_End": 899.1800000000001, "Text": " environment, you have dedicated analysts who do this all of the time."}, {"Time_Start": 900.34, "Time_End": 906.4200000000001, "Text": " Those organizations are also held to specific service level agreements for response as well"}, {"Time_Start": 906.4200000000001, "Time_End": 907.4, "Text": " as data archival."}, {"Time_Start": 908.32, "Time_End": 913.5400000000001, "Text": " There are certain economies of scale because you are utilizing shared architecture."}, {"Time_Start": 914.34, "Time_End": 917.08, "Text": " And then, of course, it's minimal network overhead."}, {"Time_Start": 918.58, "Time_End": 923.02, "Text": " And then finally, you know, it's very distributed."}, {"Time_Start": 923.1800000000001, "Time_End": 926.08, "Text": " It gets back into talking about the shared architecture, and it's out."}, {"Time_Start": 926.1, "Time_End": 956.08, "Text": " sourced. As far as architecture concerns, with the network base, you really need to worry about the bandwidth. As we get into faster and faster networks, a lot of the network intrusion detection vendors tout that they can do 100 megabit or even faster. And it's true that some of them are starting to get there, but it's still an issue. The faster, the faster the network, the more resources it's going to consider."}, {"Time_Start": 956.1, "Time_End": 958.1, "Text": " and more difficult."}, {"Time_Start": 958.1, "Time_End": 965.1, "Text": " Scalability is also an issue because when you're having numerous hundreds, thousands of agents reporting back,"}, {"Time_Start": 965.1, "Time_End": 972.1, "Text": " it can take up, it can consume network overhead as well as consume some of your resources."}, {"Time_Start": 972.1, "Time_End": 974.1, "Text": " Network fingerprint."}, {"Time_Start": 974.1, "Time_End": 982.1, "Text": " It's not really a concern for your network probes that are out there so long as you implement them with a stealth interface."}, {"Time_Start": 982.1, "Time_End": 986.08, "Text": " But you do see somewhat of a fingerprint with the host-"}, {"Time_Start": 986.1, "Time_End": 991.5, "Text": " based. And then, of course, you want to ensure that you've got a reporting back end so that you can"}, {"Time_Start": 991.5, "Time_End": 997.58, "Text": " gather all of this information and produce something useful for management, not only to get more"}, {"Time_Start": 997.58, "Time_End": 1003.4200000000001, "Text": " money for the initiative, but also so that you can fine tune the systems that you have in place"}, {"Time_Start": 1003.4200000000001, "Time_End": 1012.26, "Text": " and pinpoint where trouble spots are. Oftentimes implementing intrusion detection"}, {"Time_Start": 1012.26, "Time_End": 1016.08, "Text": " becomes segment-specific because it can be cost-prohibitive."}, {"Time_Start": 1016.1, "Time_End": 1027.44, "Text": " Additionally, you need to look at the types of network traffic that you're seeing, especially when you want to implement network intrusion detection on something such as a public services network."}, {"Time_Start": 1027.44, "Time_End": 1042.0, "Text": " Then you could really tune the system to the types of network traffic that you've got, as well as operating systems and the applications you have in play there, such as DNS or HTTP and things along those lines."}, {"Time_Start": 1045.0, "Time_End": 1046.08, "Text": " There's a lot of debate."}, {"Time_Start": 1046.1, "Time_End": 1050.1799999999998, "Text": " as to where the best place to deploy intrusion detection is concerned."}, {"Time_Start": 1050.58, "Time_End": 1055.6999999999998, "Text": " I will offer that you can deploy it to watch the internet or extranet."}, {"Time_Start": 1056.0, "Time_End": 1063.2199999999998, "Text": " PSN is, many people refer to it as a DMZ, but by the very nature of the word demilitarized zone,"}, {"Time_Start": 1063.3999999999999, "Time_End": 1068.3999999999999, "Text": " it's saying that there's no control, whereas most people have public services networks"}, {"Time_Start": 1068.3999999999999, "Time_End": 1074.9399999999998, "Text": " where they have services such as web and DNS and SMTP that is controlled."}, {"Time_Start": 1074.94, "Time_End": 1078.94, "Text": " So for the purpose of this presentation, I'll just call it Public Services Network."}, {"Time_Start": 1080.28, "Time_End": 1086.54, "Text": " Internal key network segments such as server farms, and then, of course, anything on critical hosts,"}, {"Time_Start": 1086.94, "Time_End": 1090.38, "Text": " you could implement the host-based and the network node base."}, {"Time_Start": 1092.7, "Time_End": 1101.44, "Text": " Really, when implementing on your external or extranet segments, you're kind of looking at suspicious activity detection."}, {"Time_Start": 1101.44, "Time_End": 1104.92, "Text": " This would be especially true in looking at all of the information."}, {"Time_Start": 1104.94, "Time_End": 1108.18, "Text": " that's hitting your firewall and that's hitting your perimeter."}, {"Time_Start": 1108.18, "Time_End": 1112.94, "Text": " Some people would say that, well, I've got the firewall to block all of this, I don't need to see it."}, {"Time_Start": 1112.94, "Time_End": 1116.94, "Text": " But since I'm so paranoid, I like to see everything that's coming in my network."}, {"Time_Start": 1116.94, "Time_End": 1123.94, "Text": " It's easier to deploy the network intrusion detection on external and extranets,"}, {"Time_Start": 1123.94, "Time_End": 1126.94, "Text": " unless, of course, you've got a DS3 or something."}, {"Time_Start": 1126.94, "Time_End": 1131.94, "Text": " But normally, these tend to be slower links, and so you have lower throughput,"}, {"Time_Start": 1131.94, "Time_End": 1134.92, "Text": " and the devices are able to keep up."}, {"Time_Start": 1134.94, "Time_End": 1141.54, "Text": " up better. Of course, it's not just for the internet. And then, as I was saying, you know,"}, {"Time_Start": 1141.54, "Time_End": 1148.72, "Text": " I like to put it outside of my firewall, the internet or extranet, as kind of a catch-all to see"}, {"Time_Start": 1148.72, "Time_End": 1156.18, "Text": " everything that's coming in. The internal really depends on, and when I say internal, I'm"}, {"Time_Start": 1156.18, "Time_End": 1163.6200000000001, "Text": " talking about RFC-1918 addresses. Oh, that's nice, my battery is charged. So I'm talking about the"}, {"Time_Start": 1163.6200000000001, "Time_End": 1170.0200000000002, "Text": " internal users in your corporation or firm. And it completely depends upon the threat model,"}, {"Time_Start": 1170.1200000000001, "Time_End": 1174.8200000000002, "Text": " whether or not you want to monitor what they're doing. Some people choose that they want to do"}, {"Time_Start": 1174.8200000000002, "Time_End": 1179.3200000000002, "Text": " event correlation with the external, see what gets through the firewall, and then compare the two."}, {"Time_Start": 1180.1200000000001, "Time_End": 1186.4, "Text": " Once again, that could be considered a check and balance. The way I like to use it is not look at anything"}, {"Time_Start": 1186.4, "Time_End": 1193.14, "Text": " coming into that particular network, but watch everything that's going out from that network and see"}, {"Time_Start": 1193.14, "Time_End": 1198.5400000000002, "Text": " where my internal users are going. Of course, on the internal network, there's always a higher"}, {"Time_Start": 1198.5400000000002, "Time_End": 1200.5, "Text": " exposure to bandwidth."}, {"Time_Start": 1200.5, "Time_End": 1216.44, "Text": " Your technical network, there's always a higher exposure to bandwidth."}, {"Time_Start": 1216.44, "Time_End": 1222.0800000000002, "Text": " Your critical network segments and public services networks, here's where you want to focus"}, {"Time_Start": 1222.08, "Time_End": 1228.12, "Text": " monitoring on the systems themselves. So that would mean implementing host-based intrusion detection,"}, {"Time_Start": 1228.6999999999998, "Time_End": 1236.9199999999998, "Text": " looking at key operating systems, whether you've got 2,000 Solaris, HPUX, A-I-X, specific applications,"}, {"Time_Start": 1237.1399999999999, "Time_End": 1243.1, "Text": " the types of traffic, you want to be able to narrow it down as much as you can because of the exposure"}, {"Time_Start": 1243.1, "Time_End": 1248.32, "Text": " to high bandwidth. So this would be an excellent place to implement host-based intrusion detection."}, {"Time_Start": 1250.32, "Time_End": 1252.06, "Text": " And then, of course, we were talking about."}, {"Time_Start": 1252.08, "Time_End": 1257.9199999999998, "Text": " this earlier, but generally speaking, the way I like to implement intrusion detection"}, {"Time_Start": 1257.9199999999998, "Time_End": 1262.6799999999998, "Text": " would be to watch everything coming at my network from the internet, kind of as a suspicious"}, {"Time_Start": 1262.6799999999998, "Time_End": 1269.32, "Text": " activity monitor, watch everything coming in from my business partners, because my first"}, {"Time_Start": 1269.32, "Time_End": 1277.84, "Text": " responsibility is to protect my own organization. There are some legalities or ethical issues"}, {"Time_Start": 1277.84, "Time_End": 1282.06, "Text": " related to ensuring that you're protecting your business partners."}, {"Time_Start": 1282.08, "Time_End": 1286.1599999999999, "Text": " but my first concern is making sure I'm protected from my business partners"}, {"Time_Start": 1286.1599999999999, "Time_End": 1289.1399999999999, "Text": " as opposed to protecting my business partners from anything else."}, {"Time_Start": 1290.36, "Time_End": 1294.96, "Text": " Additionally, as I mentioned earlier, I like to watch everything's going out of my network."}, {"Time_Start": 1295.4199999999998, "Time_End": 1298.86, "Text": " And then, of course, I like to watch things that go in and out of my DMZ"}, {"Time_Start": 1298.86, "Time_End": 1302.3999999999999, "Text": " because I really don't want to see anything initiating from my DMZ."}, {"Time_Start": 1302.52, "Time_End": 1303.9399999999998, "Text": " I only want to see it responding."}, {"Time_Start": 1304.56, "Time_End": 1312.06, "Text": " And, of course, I would put host-based agents out on the servers on that particular sector."}, {"Time_Start": 1312.08, "Time_End": 1318.78, "Text": " segment. As far as NIC configuration is concerned, I had mentioned this a couple"}, {"Time_Start": 1318.78, "Time_End": 1324.76, "Text": " of times earlier in the presentation, so I'll cover it in depth now. With network-based intrusion"}, {"Time_Start": 1324.76, "Time_End": 1331.22, "Text": " detection, you really have three ways to go about configuring it. There's the dual NIC configuration"}, {"Time_Start": 1331.22, "Time_End": 1339.6399999999999, "Text": " with a stealth interface. So basically, you would give it an all zero IP address and then do an ARP"}, {"Time_Start": 1339.6399999999999, "Time_End": 1342.06, "Text": " minus S, and you would end up having a stealth interface."}, {"Time_Start": 1342.08, "Time_End": 1351.78, "Text": " and then on the other side you would have either most likely an RFC 1918 address that went back to a monitoring network."}, {"Time_Start": 1351.78, "Time_End": 1358.1, "Text": " So essentially, since there's no IPA stack on the stealth interface, it's operating in promiscuous mode,"}, {"Time_Start": 1358.4199999999998, "Time_End": 1360.1799999999998, "Text": " and the device is essentially broken."}, {"Time_Start": 1360.48, "Time_End": 1367.0, "Text": " So someone from the outside is not going to be able to hack through that device to go to your management network."}, {"Time_Start": 1367.0, "Time_End": 1374.62, "Text": " Another type of configuration would be Doolnick without the stealth interface."}, {"Time_Start": 1374.78, "Time_End": 1380.0, "Text": " Maybe perhaps you want to look at two different network segments on your internal network,"}, {"Time_Start": 1380.0, "Time_End": 1385.28, "Text": " and you think that the threat isn't such that people will be trying to break the device."}, {"Time_Start": 1386.3, "Time_End": 1390.6, "Text": " And then the last would be a single monitored managed interface."}, {"Time_Start": 1390.6, "Time_End": 1396.98, "Text": " So you would be, basically, you would be running in promiscuous mode, but you"}, {"Time_Start": 1397.0, "Time_End": 1401.06, "Text": " you'd also be using that as your management interface to connect to the device."}, {"Time_Start": 1404.18, "Time_End": 1410.12, "Text": " It's important to start looking at false positives once you get your intrusion detection devices up and running."}, {"Time_Start": 1410.92, "Time_End": 1416.02, "Text": " It'll give you ideas on how to better design your solution so that it's more intelligent."}, {"Time_Start": 1416.66, "Time_End": 1423.22, "Text": " It'll also allow you to better understand the types of services and applications you have running on your network."}, {"Time_Start": 1424.22, "Time_End": 1426.98, "Text": " And then again, as I mentioned earlier, it gives you a little."}, {"Time_Start": 1427.0, "Time_End": 1431.6, "Text": " the baseline of your performance and then by which you can make adjustments."}, {"Time_Start": 1432.36, "Time_End": 1436.92, "Text": " And then finally, really knowing your level of readiness, where are you at as far as your"}, {"Time_Start": 1436.92, "Time_End": 1440.36, "Text": " security posture is concerned and the types of things that you have going on your network."}, {"Time_Start": 1442.3, "Time_End": 1444.48, "Text": " Data archival is extremely important."}, {"Time_Start": 1445.7, "Time_End": 1451.86, "Text": " Essentially, you have data being saved on the agent, and then that agent is sent back to"}, {"Time_Start": 1451.86, "Time_End": 1454.8, "Text": " hopefully a central repository."}, {"Time_Start": 1455.8, "Time_End": 1456.98, "Text": " This is the best place to..."}, {"Time_Start": 1457.0, "Time_End": 1462.16, "Text": " put it, to have all of your information resources, all of your intrusion detection,"}, {"Time_Start": 1462.8, "Time_End": 1468.2, "Text": " and having that all come back to a central repository because it eases event correlation."}, {"Time_Start": 1468.36, "Time_End": 1474.6, "Text": " It gives you an easier way to look at that information and to make decisions about that."}, {"Time_Start": 1475.02, "Time_End": 1477.04, "Text": " It also allows you to make solid backups."}, {"Time_Start": 1477.5, "Time_End": 1482.72, "Text": " If all your information is in one place, then it's much easier to backup as opposed to running 15 different backups"}, {"Time_Start": 1482.72, "Time_End": 1485.68, "Text": " or even hundreds of backups on agents every night."}, {"Time_Start": 1487.0, "Time_End": 1492.34, "Text": " And then lastly, of course, if you have this gigantic database, it gives you the ability to run data mining tools"}, {"Time_Start": 1492.34, "Time_End": 1498.18, "Text": " and to do some of the advanced event correlation as well as perform some of the analysis."}, {"Time_Start": 1501.68, "Time_End": 1511.6, "Text": " Custom configuration is really, what I'm getting at here is the ability to go in and custom configure any type of misuse system."}, {"Time_Start": 1512.14, "Time_End": 1516.88, "Text": " You certainly don't want to buy a system that's not going to allow you to go in"}, {"Time_Start": 1516.88, "Time_End": 1524.48, "Text": " and use standard notation and be able to fine-tune the device,"}, {"Time_Start": 1524.88, "Time_End": 1528.74, "Text": " be able to enter in networks that you want to ignore, or wild cards,"}, {"Time_Start": 1529.0800000000002, "Time_End": 1530.5800000000002, "Text": " something along those lines."}, {"Time_Start": 1530.66, "Time_End": 1534.3200000000002, "Text": " Because what invariably happens is you get way too much information."}, {"Time_Start": 1535.0800000000002, "Time_End": 1538.5600000000002, "Text": " And when you have too much information, it becomes overwhelming for analysts,"}, {"Time_Start": 1538.72, "Time_End": 1540.5200000000002, "Text": " and then they just start ignoring it."}, {"Time_Start": 1541.3600000000001, "Time_End": 1543.5800000000002, "Text": " Additionally, it gives you added functionality and freedom,"}, {"Time_Start": 1543.5800000000002, "Time_End": 1545.88, "Text": " and that comes back to reducing the information."}, {"Time_Start": 1546.88, "Time_End": 1552.0, "Text": " And finally, with the ad hoc security needs,"}, {"Time_Start": 1552.1200000000001, "Time_End": 1556.48, "Text": " this would allow you to do something along the lines of create a signature"}, {"Time_Start": 1556.48, "Time_End": 1559.5800000000002, "Text": " that allowed you to look at the subject line of an email,"}, {"Time_Start": 1559.88, "Time_End": 1563.6000000000001, "Text": " and then, of course, perhaps issue a TCP reset to try and kill that session."}, {"Time_Start": 1567.5400000000002, "Time_End": 1572.92, "Text": " There are different types of custom attack signatures, not getting too far into it,"}, {"Time_Start": 1572.92, "Time_End": 1576.8600000000001, "Text": " but you have Unix scripting, and a lot of that,"}, {"Time_Start": 1576.88, "Time_End": 1586.72, "Text": " would be snort, proprietary languages, intrusion.coms, S-NPL, NFR has N-Code,"}, {"Time_Start": 1587.0800000000002, "Time_End": 1589.5400000000002, "Text": " accent has their own language as well."}, {"Time_Start": 1590.0400000000002, "Time_End": 1596.6000000000001, "Text": " Other products allow you to give a Windows-based interface where you enter characters or wildcards,"}, {"Time_Start": 1596.68, "Time_End": 1597.68, "Text": " something along those lines."}, {"Time_Start": 1598.88, "Time_End": 1606.8600000000001, "Text": " As far as tax signature creation, you really have to be able to take an exploit and compile it"}, {"Time_Start": 1606.88, "Time_End": 1610.74, "Text": " your labs, run the exploit, and capture packets."}, {"Time_Start": 1610.74, "Time_End": 1616.8200000000002, "Text": " And when you capture these packets, then you can analyze them for what looks to be an anomaly."}, {"Time_Start": 1616.8200000000002, "Time_End": 1620.88, "Text": " And then, of course, when you do that, then you can begin to author the signature in the chosen"}, {"Time_Start": 1620.88, "Time_End": 1622.6200000000001, "Text": " language that you want."}, {"Time_Start": 1622.6200000000001, "Time_End": 1629.1200000000001, "Text": " And once you write that, then you can put it into your system and integrate it and see what happens."}, {"Time_Start": 1629.1200000000001, "Time_End": 1634.38, "Text": " Here's an example of what I would call a Christmas tree attack."}, {"Time_Start": 1634.38, "Time_End": 1636.8600000000001, "Text": " And basically, what that is, is if you look in the first first,"}, {"Time_Start": 1636.88, "Time_End": 1642.2800000000002, "Text": " 20 bytes of your IP packet, where all your flags are at, the Christmas tree attack,"}, {"Time_Start": 1642.38, "Time_End": 1647.3600000000001, "Text": " which is old and very basic, would be having all of your flag set."}, {"Time_Start": 1647.6000000000001, "Time_End": 1653.44, "Text": " So you'd have your urge and your act and your push and reset and sin and fin."}, {"Time_Start": 1654.4, "Time_End": 1658.8000000000002, "Text": " That's never supposed to happen in anything other than a lab environment."}, {"Time_Start": 1658.8000000000002, "Time_End": 1665.2800000000002, "Text": " So in this particular case, you would generate a packet that looked like this and then"}, {"Time_Start": 1665.28, "Time_End": 1671.94, "Text": " capture packets using, you know, ethyl or whatever you'd like, and then you would generate"}, {"Time_Start": 1671.94, "Time_End": 1674.84, "Text": " an attack signature that looked for that specific activity."}, {"Time_Start": 1676.18, "Time_End": 1680.8, "Text": " And then, of course, this is a fairly generic example of a snort signature."}, {"Time_Start": 1681.2, "Time_End": 1685.74, "Text": " Basically, you've got your rule header, which is saying you want to alert anytime you see a"}, {"Time_Start": 1685.74, "Time_End": 1691.32, "Text": " TCP packet that's sourced from and destined to the following."}, {"Time_Start": 1691.74, "Time_End": 1693.46, "Text": " And then, of course, you use your rule options."}, {"Time_Start": 1693.46, "Time_End": 1695.26, "Text": " And so this is a, this is a..."}, {"Time_Start": 1695.28, "Time_End": 1699.16, "Text": " a buffer overflow here, Mount DeBuffer overflow."}, {"Time_Start": 1702.78, "Time_End": 1708.94, "Text": " Some things that people try and do for intrusion detection avoidance for some of the less robust"}, {"Time_Start": 1708.94, "Time_End": 1715.94, "Text": " solutions would be to, well, the example here is the finite nature of attack signatures."}, {"Time_Start": 1716.44, "Time_End": 1723.34, "Text": " If it's looking for root in a particular attack signature, that's the way it's been programmed,"}, {"Time_Start": 1723.3400000000001, "Time_End": 1730.18, "Text": " then on the command line, if you enter, you know, R-03 times, and then a backspace,"}, {"Time_Start": 1730.2600000000002, "Time_End": 1734.2200000000003, "Text": " and then a T, well, that doesn't exactly match what it's looking for,"}, {"Time_Start": 1734.2800000000002, "Time_End": 1739.0800000000002, "Text": " and that would be one way to a very simple way, to get around a system."}, {"Time_Start": 1739.0800000000002, "Time_End": 1747.4, "Text": " There are still systems that are based like that, that actually look at text rather than context."}, {"Time_Start": 1749.0800000000002, "Time_End": 1753.3200000000002, "Text": " Another thing, most products have actually progressed."}, {"Time_Start": 1753.3400000000001, "Time_End": 1758.0600000000002, "Text": " to the point where they're fairly adept at decoding hex, but for a very long time,"}, {"Time_Start": 1758.42, "Time_End": 1766.7200000000003, "Text": " products could not decode hex on the fly. And so if you, the old IIS colon colon dollar data"}, {"Time_Start": 1766.7200000000003, "Time_End": 1773.68, "Text": " exploit, if you wrote that out in hex, you could easily bring down an IIS server. And then, of"}, {"Time_Start": 1773.68, "Time_End": 1780.7600000000002, "Text": " course, a lot of the products are becoming better with this as well, but being able to reassemble"}, {"Time_Start": 1780.76, "Time_End": 1788.94, "Text": " TCP packets that are fragmented. That used to be a very, very efficient way of getting"}, {"Time_Start": 1788.94, "Time_End": 1794.82, "Text": " around network-based intrusion detection. And one of the products that did that very well was"}, {"Time_Start": 1794.82, "Time_End": 1801.98, "Text": " frag router by Doug Song. And then, of course, we really need to think about usable reporting."}, {"Time_Start": 1802.58, "Time_End": 1810.24, "Text": " What types of reports are useful to us? You know, are we looking for top talkers? Are we looking for"}, {"Time_Start": 1810.24, "Time_End": 1817.18, "Text": " event by priority. The types of things that become important to us are really independent"}, {"Time_Start": 1817.18, "Time_End": 1823.6, "Text": " based on one organization to the next. And of course, things to think about how often do you want"}, {"Time_Start": 1823.6, "Time_End": 1830.08, "Text": " the reports. I've seen reports run on a daily basis for event by priority, and then of course"}, {"Time_Start": 1830.08, "Time_End": 1836.36, "Text": " kind of a weekly summary and even a summary, a monthly summary at times. The key thing is really"}, {"Time_Start": 1836.36, "Time_End": 1840.22, "Text": " what do you do with these reports? Oftentimes you hand someone a report."}, {"Time_Start": 1840.24, "Time_End": 1842.06, "Text": " and they don't do anything with it."}, {"Time_Start": 1842.46, "Time_End": 1846.2, "Text": " So the daily reports tend to be much more technical in nature,"}, {"Time_Start": 1846.32, "Time_End": 1852.42, "Text": " where you give those to your analysts, and they can go in and analyze traffic and make changes to the system,"}, {"Time_Start": 1852.86, "Time_End": 1857.26, "Text": " and whereas your weekly summary reports are something that you would give to executive management,"}, {"Time_Start": 1857.38, "Time_End": 1863.06, "Text": " where they say, oh, my gosh, I can't believe that somebody tried to hack us, and it was 500 times."}, {"Time_Start": 1864.4, "Time_End": 1868.04, "Text": " So, and, you know, the last thing is really, are the reports read?"}, {"Time_Start": 1868.44, "Time_End": 1870.22, "Text": " And oftentimes I found that they're not."}, {"Time_Start": 1870.24, "Time_End": 1875.2, "Text": " not. So when you put in pretty pictures, then executives usually read them."}, {"Time_Start": 1877.7, "Time_End": 1883.5, "Text": " Incident response is something that goes hand in hand with intrusion detection, so I'll just"}, {"Time_Start": 1883.5, "Time_End": 1889.42, "Text": " briefly talk about it here, but you really need to have the policies in place. Oftentimes, I've"}, {"Time_Start": 1889.42, "Time_End": 1895.82, "Text": " worked with clients to implement intrusion detection solutions, and then something happens, and they"}, {"Time_Start": 1895.82, "Time_End": 1900.22, "Text": " say, now what, and they're really not sure what to do. And so that's something that needs to"}, {"Time_Start": 1900.24, "Time_End": 1905.96, "Text": " be defined up front before you get into installing the systems as having the policies"}, {"Time_Start": 1905.96, "Time_End": 1911.58, "Text": " in place. And your incident response plan is an extension of your security plan. It has"}, {"Time_Start": 1911.58, "Time_End": 1916.76, "Text": " everything to do with what's important to you in your security plan. If you decide that you want"}, {"Time_Start": 1916.76, "Time_End": 1924.28, "Text": " to be notified every time someone fails their login three times, then that's reacting to"}, {"Time_Start": 1924.28, "Time_End": 1929.3, "Text": " that as an extension of the security policy. And of course, that goes along with the security policy. And of course, that"}, {"Time_Start": 1929.3, "Time_End": 1935.52, "Text": " goes along with what do you do when you see specific traffic? How do you rate the severity"}, {"Time_Start": 1935.52, "Time_End": 1939.6399999999999, "Text": " of an alert? And then, of course, finally, possible data forensics."}, {"Time_Start": 1942.82, "Time_End": 1948.28, "Text": " Touching on event criticality briefly, it depends on a number of factors. Most importantly,"}, {"Time_Start": 1948.44, "Time_End": 1953.48, "Text": " I would say, your security policy and what you've deemed appropriate and important to you."}, {"Time_Start": 1954.86, "Time_End": 1958.86, "Text": " What types of intrusion detection that you have employed is going to determine the"}, {"Time_Start": 1958.8600000000001, "Time_End": 1964.3000000000002, "Text": " determine the type of information that you receive back. As far as the different levels"}, {"Time_Start": 1964.3000000000002, "Time_End": 1970.66, "Text": " of an attack are concerned, this gets back to the policy. This gets back to the types of operating"}, {"Time_Start": 1970.66, "Time_End": 1975.44, "Text": " systems and applications you have running on your network. You know, what's important? If you're,"}, {"Time_Start": 1975.8400000000001, "Time_End": 1983.5600000000002, "Text": " if you are running, if you are running IIS and someone launches an Apache exploit against"}, {"Time_Start": 1983.5600000000002, "Time_End": 1988.8400000000001, "Text": " you, it's not going to be very important. But if it were the other way around,"}, {"Time_Start": 1988.8600000000001, "Time_End": 1994.38, "Text": " then all of a sudden it would become pertinent. So really, this is a, I would say that this"}, {"Time_Start": 1994.38, "Time_End": 2003.2, "Text": " is probably my graphical stolen version of Northcutt's criticality metric in his first book."}, {"Time_Start": 2003.64, "Time_End": 2009.22, "Text": " Basically, what you've got, as far as criticality is concerned, is you've got your non-focused"}, {"Time_Start": 2009.22, "Time_End": 2014.22, "Text": " exploitable attack. It's not really something that you're interested in being notified about."}, {"Time_Start": 2014.98, "Time_End": 2018.8400000000001, "Text": " There's not much harm that's going to happen of it. So it may,"}, {"Time_Start": 2018.8600000000001, "Time_End": 2024.3600000000001, "Text": " may be something that you want to report on or saving your systems in case there are other related attacks."}, {"Time_Start": 2025.46, "Time_End": 2048.48, "Text": " For your, for your, yeah, absolutely. If someone decides that they're going to, if someone decides that they're going to do a random netcast scan of your public services network and all you have is Unix devices, it's random. It's random, so it's not focused. And second, sure."}, {"Time_Start": 2048.86, "Time_End": 2050.1200000000003, "Text": " So it's random."}, {"Time_Start": 2051.0, "Time_End": 2055.1, "Text": " And then the other thing is it's not something that's exploitable."}, {"Time_Start": 2056.52, "Time_End": 2059.86, "Text": " Number two would be more reconnaissance work."}, {"Time_Start": 2059.96, "Time_End": 2064.46, "Text": " People that are looking to gather information about your network, they're digging on your DNS,"}, {"Time_Start": 2064.96, "Time_End": 2069.96, "Text": " they're doing, you know, they're doing NMAP scans."}, {"Time_Start": 2070.1200000000003, "Time_End": 2072.44, "Text": " They want to know what kind of operating systems you have."}, {"Time_Start": 2072.78, "Time_End": 2075.86, "Text": " That's definitely something that's higher up on the priority list."}, {"Time_Start": 2077.2400000000002, "Time_End": 2078.84, "Text": " And then, of course, when people,"}, {"Time_Start": 2078.86, "Time_End": 2084.52, "Text": " start jabbing at you. You know, it may be, maybe random, but it is something that could"}, {"Time_Start": 2084.52, "Time_End": 2088.9, "Text": " be exploited on your network or the other way around. It could be very focused, but"}, {"Time_Start": 2088.9, "Time_End": 2093.1400000000003, "Text": " not exploitable. That's something where you really want to start watching, what's going on"}, {"Time_Start": 2093.1400000000003, "Time_End": 2099.08, "Text": " in your network in real time, and then start possibly notifying people in your escalation"}, {"Time_Start": 2099.08, "Time_End": 2102.7400000000002, "Text": " procedures or even a client if you're doing this for someone."}, {"Time_Start": 2105.38, "Time_End": 2108.84, "Text": " Finally, actually not finally, you have your first."}, {"Time_Start": 2108.86, "Time_End": 2113.7400000000002, "Text": " focused exploitable. This is where you want to immediately contact the business unit"}, {"Time_Start": 2113.7400000000002, "Time_End": 2118.96, "Text": " that would be responsible for this information resource. Certainly something you want to report on."}, {"Time_Start": 2119.56, "Time_End": 2125.7400000000002, "Text": " And then, of course, finally, level five is extreme danger. Focused, you know that the system is"}, {"Time_Start": 2125.7400000000002, "Time_End": 2131.1, "Text": " vulnerable. It very well could have been compromised. It looks that way, judging from your"}, {"Time_Start": 2131.1, "Time_End": 2137.88, "Text": " host-based intrusion detection systems. You want to immediately notify either the internal or"}, {"Time_Start": 2137.88, "Time_End": 2147.12, "Text": " client contact and then begin to perform either information, incident response, or"}, {"Time_Start": 2147.12, "Time_End": 2154.88, "Text": " disaster recovery. And then lastly, just kind of throwing this in here is really assessing what"}, {"Time_Start": 2154.88, "Time_End": 2160.12, "Text": " your needs are when you're choosing an intrusion detection product. There are products out there"}, {"Time_Start": 2160.12, "Time_End": 2164.62, "Text": " that are very expensive. There are products out there that are open source that require a lot of time"}, {"Time_Start": 2164.62, "Time_End": 2166.5, "Text": " in coding and understanding."}, {"Time_Start": 2166.5, "Time_End": 2169.74, "Text": " So, how robust do you want it to be?"}, {"Time_Start": 2169.84, "Time_End": 2178.16, "Text": " Do you want to spend a lot of money and use half the features, or is it something that you can get away with spending less money?"}, {"Time_Start": 2178.62, "Time_End": 2185.36, "Text": " And certainly demo the products, being able to conduct all of those comparisons to see the different types of things."}, {"Time_Start": 2186.4, "Time_End": 2196.48, "Text": " Erecting an intrusion detection lab is not a huge feat, but it does require that a lot of different systems are in there so that you can"}, {"Time_Start": 2196.5, "Time_End": 2202.86, "Text": " actually generate the bandwidth necessary and be able to perform exploits on devices"}, {"Time_Start": 2202.86, "Time_End": 2208.14, "Text": " in there. So you can find out which systems are picking up and which systems aren't."}, {"Time_Start": 2208.14, "Time_End": 2212.74, "Text": " And then, of course, grill the vendors. And that's it. Thanks."}]}