{"segments": [{"Time_Start": 0.0, "Time_End": 2.0, "Text": " You know,"}, {"Time_Start": 30.0, "Time_End": 32.0, "Text": " Thank you."}, {"Time_Start": 60.0, "Time_End": 62.0, "Text": " Thank you."}, {"Time_Start": 90.0, "Time_End": 92.0, "Text": " Thank you."}, {"Time_Start": 120.0, "Time_End": 122.0, "Text": " Thank you."}, {"Time_Start": 150.0, "Time_End": 152.0, "Text": " Thank you."}, {"Time_Start": 180.0, "Time_End": 182.0, "Text": " Thank you."}, {"Time_Start": 210.0, "Time_End": 212.0, "Text": " Thank you."}, {"Time_Start": 240.0, "Time_End": 242.0, "Text": " Thank you."}, {"Time_Start": 270.0, "Time_End": 277.0, "Text": " Thank you."}, {"Time_Start": 277.0, "Time_End": 278.0, "Text": " You do that."}, {"Time_Start": 278.0, "Time_End": 280.0, "Text": " You do that one day."}, {"Time_Start": 300.0, "Time_End": 302.0, "Text": " Well, I want to welcome everyone here."}, {"Time_Start": 302.0, "Time_End": 307.0, "Text": " I've got an interesting message that I wanted to talk about today."}, {"Time_Start": 307.0, "Time_End": 310.0, "Text": " So what I'm doing is I wrote everything down."}, {"Time_Start": 310.0, "Time_End": 313.0, "Text": " I only, normally I talk to slides."}, {"Time_Start": 313.0, "Time_End": 318.0, "Text": " But when I think I have something important to actually say, I want to go ahead and get a written down."}, {"Time_Start": 318.0, "Time_End": 321.0, "Text": " I'll probably still improvise a lot, so you just have to bear with me."}, {"Time_Start": 321.0, "Time_End": 327.0, "Text": " I'm also going to sit down because this is a little bit easier to do."}, {"Time_Start": 327.0, "Time_End": 329.0, "Text": " The name of the talk is Wittershins, D-Evolution."}, {"Time_Start": 329.0, "Time_End": 333.34, "Text": " de-evolution in the politics of technology, and I'll kind of explain what that means."}, {"Time_Start": 333.34, "Time_End": 338.44, "Text": " I know I've had a lot of people come up and ask me about it, so here it goes."}, {"Time_Start": 338.44, "Time_End": 345.36, "Text": " The circle is a symbol used in many cultures to signify an unbroken cycle or a chain."}, {"Time_Start": 345.36, "Time_End": 351.54, "Text": " In Wicca, a practitioner will cast a circle around a ritual area for the beginning of a ritual"}, {"Time_Start": 351.54, "Time_End": 358.98, "Text": " moving clockwise, and this is known as deosil, a sacred space for worship and magic is created"}, {"Time_Start": 359.0, "Time_End": 367.0, "Text": " with the circle allowing protection from outside forces and concentrated focus of energies to be contained within the circle."}, {"Time_Start": 367.0, "Time_End": 373.0, "Text": " At the end of the ritual, the practitioner will move counterclockwise or wittershins"}, {"Time_Start": 373.0, "Time_End": 379.0, "Text": " to release and return the energy contained within the circle back from whence it came."}, {"Time_Start": 379.0, "Time_End": 386.0, "Text": " As is the case with most religions, its symbolism is reflected within society."}, {"Time_Start": 386.0, "Time_End": 388.98, "Text": " We have social circles that experience."}, {"Time_Start": 389.0, "Time_End": 400.0, "Text": " and contract, and society has a tendency to draw circles around itself using divisions such as class and race to try to contain themselves."}, {"Time_Start": 400.0, "Time_End": 405.0, "Text": " But as history has shown us, all of these circles are eventually undone."}, {"Time_Start": 405.0, "Time_End": 411.0, "Text": " And what is contained within them is released and returned to the elements from when it was drawn."}, {"Time_Start": 411.0, "Time_End": 416.0, "Text": " What if the circle is a technological or one?"}, {"Time_Start": 416.0, "Time_End": 418.98, "Text": " Or what if the so-called magic"}, {"Time_Start": 419.0, "Time_End": 424.0, "Text": " that was within the closed circle is technological in nature."}, {"Time_Start": 424.0, "Time_End": 428.0, "Text": " How do we release that type of magic?"}, {"Time_Start": 428.0, "Time_End": 439.0, "Text": " Part of the problem is that we don't think about the prison cell we live in."}, {"Time_Start": 439.0, "Time_End": 442.0, "Text": " And we are prisoners."}, {"Time_Start": 442.0, "Time_End": 449.0, "Text": " The shackles are poverty, social division, ignorance, dissension, and a media that's"}, {"Time_Start": 449.0, "Time_End": 454.0, "Text": " stupefies us with a news machine that churns out mind-controlling propaganda,"}, {"Time_Start": 454.0, "Time_End": 457.0, "Text": " along with a strong infusion of gimme, gimme, gimme, gimme,"}, {"Time_Start": 457.0, "Time_End": 461.0, "Text": " to drive up debt to ensure we are chained to a job"}, {"Time_Start": 461.0, "Time_End": 466.0, "Text": " and playing interest on our gold cards for the rest of our lives."}, {"Time_Start": 466.0, "Time_End": 471.0, "Text": " The key to unlocking these shackles is information."}, {"Time_Start": 471.0, "Time_End": 474.0, "Text": " And that is what we're going to talk about today."}, {"Time_Start": 474.0, "Time_End": 478.98, "Text": " At first glance, most journalists that are"}, {"Time_Start": 479.0, "Time_End": 483.6, "Text": " here, most of them, not all of them, but most of them are probably going to report that this"}, {"Time_Start": 483.6, "Time_End": 488.82, "Text": " particular talk is on hacktivism. To a certain extent they will be correct, but as most"}, {"Time_Start": 488.82, "Time_End": 494.18, "Text": " journalists call half of the website defacement's act of activism, then in truth, this is"}, {"Time_Start": 494.18, "Time_End": 498.24, "Text": " not a talk about hacktivism at all. This is a discussion about politics and this is a discussion"}, {"Time_Start": 498.24, "Time_End": 503.12, "Text": " about technology."}, {"Time_Start": 503.12, "Time_End": 508.98, "Text": " Once upon a time, it was commonly, what was commonly thought of is"}, {"Time_Start": 509.0, "Time_End": 515.16, "Text": " cyberspace was a cavernous thought construct whose physical borders and wires consisted"}, {"Time_Start": 515.16, "Time_End": 521.9, "Text": " of phone company equipment, x.25 relays, large components of the military industrial complex."}, {"Time_Start": 521.9, "Time_End": 529.0, "Text": " Mainly it was more machines and machine driven than it was people. What few outside explorers,"}, {"Time_Start": 529.0, "Time_End": 537.08, "Text": " real outside explorers that wandered into this realm, those were us, the hackers. Now, of course,"}, {"Time_Start": 537.08, "Time_End": 545.08, "Text": " we are rapidly approaching complete social acceptance of the computer within the home."}, {"Time_Start": 545.1800000000001, "Time_End": 551.12, "Text": " We have movies with titles like You've Got Mail. We have grandmothers that exchange recipes"}, {"Time_Start": 551.12, "Time_End": 557.7, "Text": " via ICQ. And this is probably one of the more annoying things, a little bit of a rant."}, {"Time_Start": 559.26, "Time_End": 566.96, "Text": " At least for me, when you hear news anchors on television that say, for more information on this story,"}, {"Time_Start": 567.08, "Time_End": 573.08, "Text": " Please go and log on to our websites at abccnews.com."}, {"Time_Start": 573.08, "Time_End": 581.08, "Text": " So I'm thinking, oh, log on. Forget the browser. I'll just use SSH or telnet and go in there and poke around on my own."}, {"Time_Start": 581.08, "Time_End": 587.08, "Text": " That is what they meant, right? Log on? That's a username and a password. I don't know."}, {"Time_Start": 587.08, "Time_End": 589.08, "Text": " Maybe not a good defense in court."}, {"Time_Start": 589.08, "Time_End": 597.0600000000001, "Text": " In my opinion, cyberspace to an extent is devolving, at least on the"}, {"Time_Start": 597.08, "Time_End": 626.98, "Text": " surface. With the advent of the World Wide Web and every company on the planet trying to get in line, it has become a polluted and over-commercialized place. The web had potential, but is rapidly becoming interactive television, complete with thousands of ad, very, very little decent content, and a least common denominator style of marketing and presentation. And I am supposed to hack that. If I wanted that kind of shit,"}, {"Time_Start": 627.08, "Time_End": 629.08, "Text": " I would steal cable television."}, {"Time_Start": 629.08, "Time_End": 631.08, "Text": " Thank you very much."}, {"Time_Start": 631.08, "Time_End": 639.08, "Text": " In many ways, this is just surface tension, though."}, {"Time_Start": 639.08, "Time_End": 644.08, "Text": " There are a few interesting things that are going on that are happening."}, {"Time_Start": 644.08, "Time_End": 650.08, "Text": " Some of the more important ones that need to be discussed, need to be brought to light."}, {"Time_Start": 657.08, "Time_End": 661.08, "Text": " What have we done?"}, {"Time_Start": 661.08, "Time_End": 664.08, "Text": " Okay, first off, we've created a wealth of tools."}, {"Time_Start": 664.08, "Time_End": 668.08, "Text": " We've got a lot of tools, and tools can be used for good or evil."}, {"Time_Start": 668.08, "Time_End": 673.08, "Text": " There's kind of a popular sentiment that you can, you can,"}, {"Time_Start": 673.08, "Time_End": 677.08, "Text": " take a hammer, and you can build a house with it, or you can cave someone's skull in with it."}, {"Time_Start": 677.08, "Time_End": 682.08, "Text": " And I think that's very true with a lot of the tools that hackers have put together."}, {"Time_Start": 682.08, "Time_End": 686.08, "Text": " And I'm not going to exclude myself from that particular arrangement."}, {"Time_Start": 686.08, "Time_End": 693.08, "Text": " particular arena. I've done that. And it's mainly because a lot of the tools we create,"}, {"Time_Start": 693.08, "Time_End": 697.08, "Text": " they may be generic in nature, but sometimes we go ahead and add features to them that"}, {"Time_Start": 697.08, "Time_End": 701.08, "Text": " basically benefit the intruder and not necessarily the administrator."}, {"Time_Start": 701.08, "Time_End": 707.08, "Text": " And yes, I am guilty of doing that. And yes, I will continue to do that."}, {"Time_Start": 707.08, "Time_End": 711.08, "Text": " Oh, sure, go ahead."}, {"Time_Start": 711.08, "Time_End": 715.08, "Text": " Applaud things that help intruders. There you go."}, {"Time_Start": 715.08, "Time_End": 721.6800000000001, "Text": " Now, using some of these tools who created, some of us have destroyed."}, {"Time_Start": 721.6800000000001, "Time_End": 723.5200000000001, "Text": " That is very true."}, {"Time_Start": 723.5200000000001, "Time_End": 726.4200000000001, "Text": " You cannot get around this at all."}, {"Time_Start": 726.4200000000001, "Time_End": 732.0200000000001, "Text": " The only defense that we have is that in any grouping of people, anytime you cut one segment"}, {"Time_Start": 732.0200000000001, "Time_End": 736.44, "Text": " of society, you're going to have a few bad apples in the group."}, {"Time_Start": 736.44, "Time_End": 738.5, "Text": " That's just the way it is, okay?"}, {"Time_Start": 738.5, "Time_End": 743.2, "Text": " It doesn't matter whether you're talking about the feds, it doesn't matter whether you're talking"}, {"Time_Start": 743.2, "Time_End": 743.96, "Text": " about us."}, {"Time_Start": 743.96, "Time_End": 745.0600000000001, "Text": " There's going to usually be a few."}, {"Time_Start": 745.08, "Time_End": 752.08, "Text": " that do that. And we have to live with that as a part of our society, of our group."}, {"Time_Start": 754.38, "Time_End": 759.44, "Text": " Another thing we've done is we've done disclosure, as we've gathered information we've shared."}, {"Time_Start": 759.5600000000001, "Time_End": 764.84, "Text": " Initially, we shared with each other and gradually, whether it was that we got older and wiser,"}, {"Time_Start": 765.4200000000001, "Time_End": 770.86, "Text": " or we just simply decided that it was much more important, we started sharing this information"}, {"Time_Start": 770.86, "Time_End": 775.0600000000001, "Text": " with other people. We tried to really create a good,"}, {"Time_Start": 775.08, "Time_End": 781.32, "Text": " sense of camaraderie around a lot of this. Again, the disclosure self could be a whole talk"}, {"Time_Start": 781.32, "Time_End": 789.7800000000001, "Text": " on itself because it does have its good side. It does have its bad side. But personally, I still believe"}, {"Time_Start": 789.7800000000001, "Time_End": 794.88, "Text": " in full disclosure. I still feel we should move forward in that direction. I encourage everyone else"}, {"Time_Start": 794.88, "Time_End": 798.58, "Text": " to do that. It's important to at least get that information out."}, {"Time_Start": 803.2800000000001, "Time_End": 804.98, "Text": " Here's a question that I want to do that."}, {"Time_Start": 805.08, "Time_End": 811.6600000000001, "Text": " want to start with to get people thinking. Why are hackers feared? And it probably"}, {"Time_Start": 811.6600000000001, "Time_End": 820.48, "Text": " boils down to this simple fact. If someone comes up with a method of using a piece of"}, {"Time_Start": 820.48, "Time_End": 827.96, "Text": " technology in a way beyond what it was intended to do, a hacker will usually intend, they will"}, {"Time_Start": 827.96, "Time_End": 835.0600000000001, "Text": " usually admire that type of thing. Additionally, injection of humor and or"}, {"Time_Start": 835.08, "Time_End": 841.1800000000001, "Text": " irony will add extra points. And here's the point that the rest of society tends"}, {"Time_Start": 841.1800000000001, "Time_End": 848.44, "Text": " to miss. This admiration that we have for technological trickery where we're able to bypass"}, {"Time_Start": 848.44, "Time_End": 853.84, "Text": " and make things do what they weren't intended to do, we think is neat. We think that is cool."}, {"Time_Start": 853.84, "Time_End": 860.72, "Text": " And even if someone is doing something illegal, we still have a tendency to at least"}, {"Time_Start": 860.72, "Time_End": 864.82, "Text": " admire it if it was technically fascinating."}, {"Time_Start": 865.08, "Time_End": 870.94, "Text": " This happens, not just in our arena, but in other areas as well."}, {"Time_Start": 871.0200000000001, "Time_End": 876.98, "Text": " When you see the movie where the guy climbs down the side of the building, goes in and bypasses"}, {"Time_Start": 876.98, "Time_End": 881.46, "Text": " all the electronic security and steals the diamonds, we think, wow, that was cool."}, {"Time_Start": 881.9000000000001, "Time_End": 883.98, "Text": " It's that same type of thing that we have."}, {"Time_Start": 884.48, "Time_End": 889.9200000000001, "Text": " And because we know a lot about stuff they don't know about, they have a tendency to fear us for"}, {"Time_Start": 889.9200000000001, "Time_End": 892.34, "Text": " those reasons. That's unfortunate."}, {"Time_Start": 892.34, "Time_End": 899.88, "Text": " it. And as far as the humor thing goes, just one funny thing because I saw it right before"}, {"Time_Start": 899.88, "Time_End": 905.8000000000001, "Text": " this conference started, I was looking over on the attrition site and looked at some of the"}, {"Time_Start": 905.8000000000001, "Time_End": 912.4, "Text": " postings from someone going by the name Evil Angelica, and I found them absolutely hysterical."}, {"Time_Start": 912.8000000000001, "Time_End": 920.58, "Text": " Now, what this person did was wrong, and I do not condone doing it, but it was funny, you know."}, {"Time_Start": 922.34, "Time_End": 932.48, "Text": " Probably what is more disturbing for the powers that run society is that we"}, {"Time_Start": 932.48, "Time_End": 937.58, "Text": " are willing to cross all kinds of social boundaries in our quest for knowledge."}, {"Time_Start": 937.58, "Time_End": 943.7800000000001, "Text": " You see, the Internet has done wonders for breaking down barriers, including international"}, {"Time_Start": 943.7800000000001, "Time_End": 944.7800000000001, "Text": " borders."}, {"Time_Start": 944.7800000000001, "Time_End": 949.3000000000001, "Text": " And probably the first group to realize the potential of this concept were the people that helped"}, {"Time_Start": 949.3000000000001, "Time_End": 950.1800000000001, "Text": " build the Internet."}, {"Time_Start": 950.1800000000001, "Time_End": 952.1800000000001, "Text": " And I'm not necessarily talking about."}, {"Time_Start": 952.34, "Time_End": 956.84, "Text": " the military industrial complex that first put things together."}, {"Time_Start": 956.84, "Time_End": 962.94, "Text": " But I'm talking about the hackers and people that were working within educational institutions"}, {"Time_Start": 962.94, "Time_End": 970.84, "Text": " that as they started hooking up their regional nets, it later became what we now known as the Internet."}, {"Time_Start": 970.84, "Time_End": 974.84, "Text": " They are the ones that kind of started breaking down some of those barriers as well."}, {"Time_Start": 974.84, "Time_End": 979.84, "Text": " Now, they had been doing this kind of thing already previously within academic circles."}, {"Time_Start": 979.84, "Time_End": 981.84, "Text": " You know, they had colleagues."}, {"Time_Start": 981.84, "Time_End": 986.74, "Text": " colleagues that were, you know, on the other side of the Iron Curtain or whatever,"}, {"Time_Start": 986.74, "Time_End": 990.0400000000001, "Text": " they wouldn't think twice about passing information back and forth."}, {"Time_Start": 990.0400000000001, "Time_End": 996.8000000000001, "Text": " Because to them, information was important, and it was something that was meant to be shared."}, {"Time_Start": 996.8000000000001, "Time_End": 1005.2, "Text": " And that's kind of, we've gone through and we've made this process even more automated and"}, {"Time_Start": 1005.2, "Time_End": 1008.5, "Text": " more simplified with the advent of the Internet."}, {"Time_Start": 1008.5, "Time_End": 1011.82, "Text": " And the thing is, when we get back to the whole fear,"}, {"Time_Start": 1011.84, "Time_End": 1019.7800000000001, "Text": " question, we, as in Packers, we know how to share information. And we know how to"}, {"Time_Start": 1019.7800000000001, "Time_End": 1027.48, "Text": " contact each other quickly. And we actually almost have our own language. I can say something"}, {"Time_Start": 1027.48, "Time_End": 1037.4, "Text": " right now. Let's say that I tell you, Port 80, 453, Port 255 is open into the DMZ and"}, {"Time_Start": 1037.4, "Time_End": 1041.82, "Text": " they're running NT. You guys know exactly what I meant by that, okay?"}, {"Time_Start": 1041.84, "Time_End": 1047.54, "Text": " You know exactly what this place of security is like. You know exactly how you go approach to get in."}, {"Time_Start": 1047.54, "Time_End": 1052.74, "Text": " And that's the kind of thing, I think, that kind of frightens people that doesn't, that really don't understand what we do."}, {"Time_Start": 1056.74, "Time_End": 1070.6999999999998, "Text": " This isn't the only thing, this doesn't explain all the fears, because, you know, society at large tends to fear us because a lot of times the media says that they should."}, {"Time_Start": 1070.7, "Time_End": 1078.26, "Text": " And this is reinforced with typically inane and technically inaccurate portrayals of what a hacker is in television and movies."}, {"Time_Start": 1083.14, "Time_End": 1089.5, "Text": " And we also have law enforcement and government agencies that at least appear to fear us."}, {"Time_Start": 1089.6000000000001, "Time_End": 1094.04, "Text": " Not so much as they used to, but they still, I think they still do to a certain extent."}, {"Time_Start": 1095.0, "Time_End": 1100.68, "Text": " And the thing is with them is, of course, you could say things like, okay, they're stupid or they just,"}, {"Time_Start": 1100.7, "Time_End": 1105.78, "Text": " don't get us. But, you know, I want you to think about this. I mean, they are not stupid."}, {"Time_Start": 1106.0800000000002, "Time_End": 1111.18, "Text": " A lot of these people, they track down criminals on the most minute of clues. They put together"}, {"Time_Start": 1111.18, "Time_End": 1117.78, "Text": " some fascinating technologies of their own. I mean, they are actually fairly smart in most cases."}, {"Time_Start": 1118.92, "Time_End": 1123.5, "Text": " Now, and a lot of times they are the ones that are helping feed the media, and they're telling the media"}, {"Time_Start": 1123.5, "Time_End": 1130.0, "Text": " to fear us and that we are all bad. And I want to actually think about why that might possibly be."}, {"Time_Start": 1130.7, "Time_End": 1153.2, "Text": " Who benefits? Who benefits from this? You start looking at this. This is kind of one of the techniques when you're trying to figure out who or what is behind something. You start looking at it and you start looking at it and you say, let's see who really benefits from this fear. Okay?"}, {"Time_Start": 1157.6000000000001, "Time_End": 1160.68, "Text": " One obvious answer is that these law enforcement agents,"}, {"Time_Start": 1160.7, "Time_End": 1162.7, "Text": " They get budget money."}, {"Time_Start": 1162.7, "Time_End": 1163.7, "Text": " Okay?"}, {"Time_Start": 1163.7, "Time_End": 1167.7, "Text": " They say things like, and they go before Congress, and they say things like,"}, {"Time_Start": 1167.7, "Time_End": 1172.7, "Text": " we need more money to fight cybercrime, okay?"}, {"Time_Start": 1172.7, "Time_End": 1176.7, "Text": " We need to fight cybercrime, because the economy is going to collapse"}, {"Time_Start": 1176.7, "Time_End": 1183.7, "Text": " if no one is willing to put their credit card number into a box on Amazon.com."}, {"Time_Start": 1183.7, "Time_End": 1189.7, "Text": " We must save the world, so we need more money and more budgets to go out there and do this kind of thing."}, {"Time_Start": 1189.7, "Time_End": 1202.88, "Text": " And, yes, I am kind of exaggerating to a certain extent, but that real, I mean, they have actually gone before Congress and said that kind of thing, that, yes, we want to go through and we need more money to do this kind of thing."}, {"Time_Start": 1203.52, "Time_End": 1219.24, "Text": " Now, one thing I want to point out about those dot-coms, okay, is as soon as the economy started to take the slightest turn, the slightest bits of pulling back, the slightest bit of, what they call it, a bear market."}, {"Time_Start": 1219.7, "Time_End": 1224.7, "Text": " Then all of a sudden, all these dot-coms all over the place started failing."}, {"Time_Start": 1224.7, "Time_End": 1228.7, "Text": " And that was because no one had any confidence in them to begin with anyway."}, {"Time_Start": 1228.7, "Time_End": 1232.7, "Text": " What happens when all of a sudden people have to tighten their belt?"}, {"Time_Start": 1232.7, "Time_End": 1233.7, "Text": " What are they doing?"}, {"Time_Start": 1233.7, "Time_End": 1237.7, "Text": " They're deciding not to order pizza online."}, {"Time_Start": 1237.7, "Time_End": 1240.7, "Text": " And so those types of dot-coms are failing."}, {"Time_Start": 1240.7, "Time_End": 1241.7, "Text": " Okay?"}, {"Time_Start": 1241.7, "Time_End": 1244.7, "Text": " Don't tell me that e-commerce is here yet."}, {"Time_Start": 1244.7, "Time_End": 1246.7, "Text": " It's really, really not."}, {"Time_Start": 1246.7, "Time_End": 1249.7, "Text": " Otherwise, if we'd have had that many companies fail,"}, {"Time_Start": 1249.7, "Time_End": 1255.7, "Text": " at once, we had had a major, major, major problem within the economy."}, {"Time_Start": 1255.7, "Time_End": 1262.7, "Text": " I think that should be obvious to everyone."}, {"Time_Start": 1262.7, "Time_End": 1266.7, "Text": " Governments benefit from fear of us."}, {"Time_Start": 1266.7, "Time_End": 1273.7, "Text": " They can tax the people for more money to get the budgets for law enforcement to do things."}, {"Time_Start": 1273.7, "Time_End": 1279.68, "Text": " And they can, especially here in the U.S., they can go through and they say, well, we'll lay"}, {"Time_Start": 1279.7, "Time_End": 1284.7, "Text": " We're going to alleviate the fears of the people so that they can use their credit cards online."}, {"Time_Start": 1284.7, "Time_End": 1288.7, "Text": " They can even get together and say, we're doing this bipartisanly."}, {"Time_Start": 1288.7, "Time_End": 1293.7, "Text": " We're working together to help you the people keep you safe from those evil hackers."}, {"Time_Start": 1293.7, "Time_End": 1295.7, "Text": " It does make them look good."}, {"Time_Start": 1295.7, "Time_End": 1299.7, "Text": " Again, I'm kind of exaggerating points here, okay?"}, {"Time_Start": 1299.7, "Time_End": 1302.7, "Text": " Just to try to get you to think about this stuff."}, {"Time_Start": 1302.7, "Time_End": 1308.7, "Text": " For the more paranoid people in the room, and there's probably one or two that are here,"}, {"Time_Start": 1308.7, "Time_End": 1316.7, "Text": " that are here. If you happen to believe that there is a secret society trying to create a world government, I want you to think about this."}, {"Time_Start": 1316.7, "Time_End": 1321.7, "Text": " We have various international treaties that are being created."}, {"Time_Start": 1321.7, "Time_End": 1329.7, "Text": " Some of these are regional, such as what's going on with the European Union recently did some stuff that was fairly interesting."}, {"Time_Start": 1329.7, "Time_End": 1335.7, "Text": " Others are more global, such as WTO, WIPO, these kinds of things."}, {"Time_Start": 1335.7, "Time_End": 1336.7, "Text": " Okay?"}, {"Time_Start": 1336.7, "Time_End": 1337.7, "Text": " They've created these treaties a lot of things."}, {"Time_Start": 1337.7, "Time_End": 1342.3, "Text": " these treaties a lot of times regarding, they have stuff in there regarding cybercrime"}, {"Time_Start": 1342.3, "Time_End": 1348.9, "Text": " and intellectual property rights, and these are basically impossible to enforce or control"}, {"Time_Start": 1348.9, "Time_End": 1354.42, "Text": " without some type of government enforcement body to at least go back to these countries"}, {"Time_Start": 1354.42, "Time_End": 1357.3400000000001, "Text": " and say you need to be doing this stuff."}, {"Time_Start": 1357.3400000000001, "Time_End": 1364.74, "Text": " Now I'm not saying that cybercrime and the fear of hackers is going to create the new world order,"}, {"Time_Start": 1364.74, "Time_End": 1367.68, "Text": " and then we're all going to be enslaved to evil, unseen."}, {"Time_Start": 1367.7, "Time_End": 1372.7, "Text": " overlords or anything like that, but if you happen to be thinking along those lines,"}, {"Time_Start": 1372.7, "Time_End": 1375.7, "Text": " this is what you might call another brick in the wall."}, {"Time_Start": 1375.7, "Time_End": 1376.7, "Text": " Okay?"}, {"Time_Start": 1376.7, "Time_End": 1379.7, "Text": " Again, something more to think about."}, {"Time_Start": 1383.7, "Time_End": 1388.7, "Text": " The media actually benefits from our fear to a certain extent,"}, {"Time_Start": 1388.7, "Time_End": 1394.7, "Text": " because in a lot of instances, particularly in mainstream media, they want sensationalism."}, {"Time_Start": 1394.7, "Time_End": 1396.7, "Text": " And why do they want sensationalism?"}, {"Time_Start": 1396.7, "Time_End": 1403.7, "Text": " I want sensationalism because they want to sell ad space and make money, not necessarily inform the public."}, {"Time_Start": 1403.7, "Time_End": 1409.7, "Text": " They've spent years conditioning the masses to want trite bullshit."}, {"Time_Start": 1409.7, "Time_End": 1414.7, "Text": " Okay? The sound bite. I absolutely hate the sound bite."}, {"Time_Start": 1414.7, "Time_End": 1419.7, "Text": " There's a lot of reporters that do not like interviewing me because I tell the truth."}, {"Time_Start": 1419.7, "Time_End": 1423.7, "Text": " They asked me, what is the biggest threat computer users face?"}, {"Time_Start": 1423.7, "Time_End": 1425.7, "Text": " And when I answer them unpatched systems,"}, {"Time_Start": 1425.7, "Time_End": 1427.7, "Text": " they are disappointed."}, {"Time_Start": 1427.7, "Time_End": 1430.7, "Text": " And oftentimes they will say things like, no, no, no."}, {"Time_Start": 1430.7, "Time_End": 1432.7, "Text": " Everyone says that."}, {"Time_Start": 1432.7, "Time_End": 1435.7, "Text": " What about hackers? What about cyber terrorists?"}, {"Time_Start": 1435.7, "Time_End": 1437.7, "Text": " And things like that."}, {"Time_Start": 1437.7, "Time_End": 1442.7, "Text": " I mean, hmm, that sounds suspiciously like you're trying to answer my question for me."}, {"Time_Start": 1442.7, "Time_End": 1445.7, "Text": " And just a side note, not all the media."}, {"Time_Start": 1445.7, "Time_End": 1449.7, "Text": " There's a few people that I know that have got it straight."}, {"Time_Start": 1449.7, "Time_End": 1454.7, "Text": " But in general, to the media, this is why hackers don't like you."}, {"Time_Start": 1454.7, "Time_End": 1455.7, "Text": " Okay."}, {"Time_Start": 1455.7, "Time_End": 1458.7, "Text": " That's very important to understand."}, {"Time_Start": 1458.7, "Time_End": 1462.7, "Text": " So we have a world that hates and fears us."}, {"Time_Start": 1462.7, "Time_End": 1467.7, "Text": " We have a media machine that could give a rat's ass whether we speak the truth or not,"}, {"Time_Start": 1467.7, "Time_End": 1470.7, "Text": " and governmental law enforcement and commercial security companies,"}, {"Time_Start": 1470.7, "Time_End": 1473.7, "Text": " using us to make money and increase budgets."}, {"Time_Start": 1473.7, "Time_End": 1478.7, "Text": " And this is what I would term to be a technological de-evolution."}, {"Time_Start": 1478.7, "Time_End": 1484.7, "Text": " As a little bit of a disclaimer, yes, I do work for a software company."}, {"Time_Start": 1484.7, "Time_End": 1488.7, "Text": " software company that does benefit from all that fear."}, {"Time_Start": 1488.7, "Time_End": 1495.7, "Text": " Most of the people in this room, I'm looking around, I see many friends that work at these same places."}, {"Time_Start": 1495.7, "Time_End": 1499.7, "Text": " But like the guy said in the movie Sneakers, well, that's my day job."}, {"Time_Start": 1514.7, "Time_End": 1526.7, "Text": " By the way, when I'm talking about things that we've done,"}, {"Time_Start": 1526.7, "Time_End": 1530.7, "Text": " I'm not going to really get into talking about breaking into systems and things like that"}, {"Time_Start": 1530.7, "Time_End": 1533.7, "Text": " because there's lots of other talks here at DefCon,"}, {"Time_Start": 1533.7, "Time_End": 1536.7, "Text": " and you can go see those things there, and that's usually what I talk about."}, {"Time_Start": 1536.7, "Time_End": 1538.7, "Text": " But we'll skip that for now."}, {"Time_Start": 1538.7, "Time_End": 1540.7, "Text": " We'll get into some other things."}, {"Time_Start": 1540.7, "Time_End": 1543.7, "Text": " But, I mean, since, like I said, I think a lot of things,"}, {"Time_Start": 1543.7, "Time_End": 1546.94, "Text": " Like I said, I think a lot of the media is going to think that I'm talking about hacktivism."}, {"Time_Start": 1546.94, "Time_End": 1552.3400000000001, "Text": " I have to at least cover the supposed activism activity."}, {"Time_Start": 1552.3400000000001, "Time_End": 1556.42, "Text": " First off, website defecements are not activism."}, {"Time_Start": 1556.42, "Time_End": 1558.38, "Text": " They're usually boring."}, {"Time_Start": 1558.38, "Time_End": 1564.3400000000001, "Text": " If there is any message that is political, it is added on as an afterthought, and I'd invite everyone"}, {"Time_Start": 1564.3400000000001, "Time_End": 1569.24, "Text": " to take a look at some of the articles from the attrition folks that's out there on attrition.org"}, {"Time_Start": 1569.24, "Time_End": 1570.44, "Text": " on hacktivism."}, {"Time_Start": 1570.44, "Time_End": 1573.68, "Text": " They've done a lot of research in this area, including a very nice."}, {"Time_Start": 1573.7, "Time_End": 1580.1000000000001, "Text": " expose on the entire self-fulfilling prophecy media created Chinese American"}, {"Time_Start": 1580.1000000000001, "Time_End": 1586.9, "Text": " hacker war defacements which was absolute complete and total bullshit okay the"}, {"Time_Start": 1586.9, "Time_End": 1592.94, "Text": " media created that one we had nothing to do with it except for a few a few of"}, {"Time_Start": 1592.94, "Time_End": 1599.6200000000001, "Text": " those bad apples now what is what is the worst thing about this is that some"}, {"Time_Start": 1599.6200000000001, "Time_End": 1603.68, "Text": " people really do seem to think that this is a way to get your political"}, {"Time_Start": 1603.7, "Time_End": 1604.54, "Text": " message out."}, {"Time_Start": 1606.1200000000001, "Time_End": 1615.32, "Text": " And the average defacer's work is never seen by the public at large anyway, and the message"}, {"Time_Start": 1615.32, "Time_End": 1624.14, "Text": " is never reported by the media accurately, and because it's usually the mainstream media"}, {"Time_Start": 1624.14, "Time_End": 1629.8600000000001, "Text": " that might get the message wrong, and you're usually lumped in with a bunch of lousy"}, {"Time_Start": 1629.8600000000001, "Time_End": 1633.68, "Text": " graffiti artists, and so no one's really going to pay attention to what you have to say anyway."}, {"Time_Start": 1633.7, "Time_End": 1640.7, "Text": " Do you folks really, really want to piss people off?"}, {"Time_Start": 1640.7, "Time_End": 1643.7, "Text": " You really want to piss them off?"}, {"Time_Start": 1643.7, "Time_End": 1646.7, "Text": " Stop defacing websites."}, {"Time_Start": 1646.7, "Time_End": 1648.7, "Text": " Think about it."}, {"Time_Start": 1648.7, "Time_End": 1651.7, "Text": " How will these government agencies get their budgets?"}, {"Time_Start": 1651.7, "Time_End": 1655.7, "Text": " How will these computer software companies sell their products?"}, {"Time_Start": 1655.7, "Time_End": 1656.7, "Text": " How will they sell their products?"}, {"Time_Start": 1656.7, "Time_End": 1658.7, "Text": " How will they sell penetration tests?"}, {"Time_Start": 1658.7, "Time_End": 1661.7, "Text": " To quote one of those movies,"}, {"Time_Start": 1661.7, "Time_End": 1662.7, "Text": " the winning movies,"}, {"Time_Start": 1662.7, "Time_End": 1665.0, "Text": " The winning move is not to play."}, {"Time_Start": 1668.54, "Time_End": 1669.3400000000001, "Text": " All right."}, {"Time_Start": 1670.06, "Time_End": 1671.94, "Text": " I've kind of talked a little bit about,"}, {"Time_Start": 1672.0, "Time_End": 1673.64, "Text": " let's kind of a little bit of a rant there."}, {"Time_Start": 1673.88, "Time_End": 1677.06, "Text": " Let's talk about some more positive things that we've done."}, {"Time_Start": 1677.44, "Time_End": 1679.54, "Text": " Acts that are truly what I call true hacktivism."}, {"Time_Start": 1679.8, "Time_End": 1682.1200000000001, "Text": " There's a few of them that are actually out there,"}, {"Time_Start": 1682.3600000000001, "Time_End": 1685.8600000000001, "Text": " things that are actually going on that are actually very, very interesting."}, {"Time_Start": 1687.8400000000001, "Time_End": 1690.4, "Text": " And a lot of times these don't get reported,"}, {"Time_Start": 1690.4, "Time_End": 1692.16, "Text": " particularly by the mainstream media,"}, {"Time_Start": 1692.16, "Time_End": 1692.68, "Text": " because they are actually."}, {"Time_Start": 1692.7, "Time_End": 1699.7, "Text": " have a tendency to, they're usually handed an article to go do with a topic in mind already."}, {"Time_Start": 1699.7, "Time_End": 1704.7, "Text": " Or, you know, they usually approach it with, oh, I can't sell that to my editor."}, {"Time_Start": 1704.7, "Time_End": 1708.7, "Text": " I'm going to have to, you know, I'm going to have to do something else."}, {"Time_Start": 1708.7, "Time_End": 1716.7, "Text": " First example, rubber hose. I hope that people are familiar with rubber hose. This is really, really cool."}, {"Time_Start": 1716.7, "Time_End": 1722.68, "Text": " Go to that website. This is a great example of hackers coding up code."}, {"Time_Start": 1722.7, "Time_End": 1724.9, "Text": " together to help out the oppressed."}, {"Time_Start": 1725.1000000000001, "Time_End": 1730.66, "Text": " Rubber hose, for those that don't know, it's basically a crypto solution for people who are afraid"}, {"Time_Start": 1730.66, "Time_End": 1734.18, "Text": " they're going to get their passphrase literally beat out of them."}, {"Time_Start": 1735.1000000000001, "Time_End": 1736.3400000000001, "Text": " And I'm not making that up."}, {"Time_Start": 1736.42, "Time_End": 1742.8400000000001, "Text": " Your target user for rubber hose is going to be probably a human rights activist who writes up"}, {"Time_Start": 1742.8400000000001, "Time_End": 1747.9, "Text": " in photographs digitizes information about human rights abuses in a foreign country"}, {"Time_Start": 1747.9, "Time_End": 1752.68, "Text": " and then wants to keep from getting a passphrase beaten out of them that could decry"}, {"Time_Start": 1752.7, "Time_End": 1757.7, "Text": " the data and endanger the lives of the people that the activist is actually trying to save,"}, {"Time_Start": 1757.7, "Time_End": 1759.7, "Text": " and including the activists' own life."}, {"Time_Start": 1759.7, "Time_End": 1764.7, "Text": " That is a very, very important website that I encourage people to go to and take a look at,"}, {"Time_Start": 1764.7, "Time_End": 1766.7, "Text": " particularly if you're here and you're a member of the media."}, {"Time_Start": 1766.7, "Time_End": 1771.7, "Text": " You really, really need to go and look and see something positive that's being done."}, {"Time_Start": 1771.7, "Time_End": 1776.7, "Text": " Another example, which I know many of us were hoping to see this, and we'll just have to be patient,"}, {"Time_Start": 1776.7, "Time_End": 1778.7, "Text": " was peek-a-booty."}, {"Time_Start": 1778.7, "Time_End": 1781.7, "Text": " The stuff that called to the dead cow and Hactivismo."}, {"Time_Start": 1781.7, "Time_End": 1787.7, "Text": " hacktivismo, all this stuff. They're developing methods that allow suppress people"}, {"Time_Start": 1787.7, "Time_End": 1793.7, "Text": " to bypass governmental technological boundaries, such as firewalls, filtering software, to get"}, {"Time_Start": 1793.7, "Time_End": 1796.7, "Text": " to information outside of their countries."}, {"Time_Start": 1796.7, "Time_End": 1801.7, "Text": " I also encourage you to go out and find a copy of the Hactivismo Declaration."}, {"Time_Start": 1801.7, "Time_End": 1806.7, "Text": " This is an extremely important document, and simply because of its solidifying nature."}, {"Time_Start": 1806.7, "Time_End": 1811.68, "Text": " A lot of the points that I brought up I found in the"}, {"Time_Start": 1811.7, "Time_End": 1817.7, "Text": " that document, which just came out just a few days ago, and I was extremely excited to read that."}, {"Time_Start": 1817.7, "Time_End": 1821.7, "Text": " There are a lot of other smaller examples that are out there."}, {"Time_Start": 1821.7, "Time_End": 1827.7, "Text": " I heard of one just the other day from Jennifer Granik, who pointed it out to me."}, {"Time_Start": 1827.7, "Time_End": 1835.7, "Text": " There's a man named Patrick Ball who works for the AALS, and I cannot remember what that stands for."}, {"Time_Start": 1835.7, "Time_End": 1840.7, "Text": " But essentially what he's come up with is a method of what's called the Red Button."}, {"Time_Start": 1840.7, "Time_End": 1854.7, "Text": " red button. So I'm someone that's working overseas. I'm working, helping people that are being suppressed by human rights, and the guys come and knock on the door. They're going to come in and they're going to take away everything off that hard drive."}, {"Time_Start": 1854.7, "Time_End": 1861.7, "Text": " You hit the red button, the entire hard drive is encrypted, and the key to decrypt it is in New York."}, {"Time_Start": 1861.7, "Time_End": 1865.7, "Text": " So there's no way that no matter what they do, they're not going to get that data."}, {"Time_Start": 1865.7, "Time_End": 1869.7, "Text": " And the data itself is never destroyed unless they destroy the entire hard drive."}, {"Time_Start": 1869.7, "Time_End": 1876.7, "Text": " drive. So those are some things that are kind of interesting that are going on."}, {"Time_Start": 1876.7, "Time_End": 1889.7, "Text": " Besides supporting projects such as these, I'm going to bring up some other, I guess, controversial material."}, {"Time_Start": 1889.7, "Time_End": 1898.7, "Text": " You have to remember that there's other things than just transgressions against people with human rights, but there's transgressions against the environment."}, {"Time_Start": 1898.7, "Time_End": 1908.7, "Text": " against the environment. There's also transgressions, I guess, what I call, against knowledge itself that is being perpetrated by some of these tightly-knit circles."}, {"Time_Start": 1908.7, "Time_End": 1923.7, "Text": " Let me ask you this. Does anyone here, does anyone here know someone who has died of ovarian cancer?"}, {"Time_Start": 1923.7, "Time_End": 1928.68, "Text": " Raise a hands. Anyone knows someone that's died of ovarian cancer? Okay. A few people who have."}, {"Time_Start": 1928.7, "Time_End": 1934.3, "Text": " do. And if you ask around in your family, you're probably going to find that there are other people that have died of ovarian cancer."}, {"Time_Start": 1935.9, "Time_End": 1944.9, "Text": " And before I go much farther in this story, I'm not going to give out any more details than what I'm going to tell you here because I don't want to be on the wrong end of a lawsuit on this."}, {"Time_Start": 1946.2, "Time_End": 1958.1000000000001, "Text": " 10 years ago, I was doing, actually it was 11 years ago, I was doing some consulting at a large transnational controlled pharmaceutical interest."}, {"Time_Start": 1958.7, "Time_End": 1960.7, "Text": " on the East Coast."}, {"Time_Start": 1960.7, "Time_End": 1965.7, "Text": " And I was given access into where the servers were."}, {"Time_Start": 1965.7, "Time_End": 1971.7, "Text": " And the servers were sitting in a bio lab of some kind."}, {"Time_Start": 1971.7, "Time_End": 1975.7, "Text": " And it was one of those things that, I mean, many of you have done consulting."}, {"Time_Start": 1975.7, "Time_End": 1977.7, "Text": " The guys didn't know really what they were doing."}, {"Time_Start": 1977.7, "Time_End": 1979.7, "Text": " And I was hired for a day."}, {"Time_Start": 1979.7, "Time_End": 1981.7, "Text": " I was done in 20 minutes."}, {"Time_Start": 1981.7, "Time_End": 1986.7, "Text": " So I'm playing around to kind of cover my time."}, {"Time_Start": 1986.7, "Time_End": 1987.7, "Text": " And to make it seem like I've actually been doing."}, {"Time_Start": 1987.7, "Time_End": 1991.8600000000001, "Text": " like I've actually been doing a whole lot."}, {"Time_Start": 1991.8600000000001, "Time_End": 1996.4, "Text": " I was looking around on some of the desk and I saw some papers lying out."}, {"Time_Start": 1996.4, "Time_End": 2003.06, "Text": " And there were stuff in there that indicated in some of these documents that it was referencing"}, {"Time_Start": 2003.06, "Time_End": 2009.94, "Text": " cures for cancer and how there were different types of cancers and that, you know, one type"}, {"Time_Start": 2009.94, "Time_End": 2016.26, "Text": " of chemical compound may destroy one type of cancer cell, it may not destroy another."}, {"Time_Start": 2016.26, "Time_End": 2017.26, "Text": " And I looked at those."}, {"Time_Start": 2017.26, "Time_End": 2020.12, "Text": " someone came in and says, hey, you're not supposed to be reading that kind of stuff."}, {"Time_Start": 2020.18, "Time_End": 2026.86, "Text": " And I said, okay, so I went back over to the computers or poking around on the computer system there"}, {"Time_Start": 2026.86, "Time_End": 2029.86, "Text": " that I had full administrative access to legitimately."}, {"Time_Start": 2030.46, "Time_End": 2033.86, "Text": " I was told I could look at any file on the system to solve the problem,"}, {"Time_Start": 2033.86, "Time_End": 2038.6, "Text": " so I decided I started looking at the Word documents on there and other things."}, {"Time_Start": 2040.4, "Time_End": 2046.66, "Text": " And in there, I found essentially all the documentation regarding"}, {"Time_Start": 2046.66, "Time_End": 2057.66, "Text": " a cure for ovarian cancer. This is 11 years ago. Where is this cure now?"}, {"Time_Start": 2057.66, "Time_End": 2064.66, "Text": " It's not here. Do you know why it's not here? Do you know what this company did with that information?"}, {"Time_Start": 2064.66, "Time_End": 2071.66, "Text": " They used it to sell early detection kits. They used it to sell"}, {"Time_Start": 2071.66, "Time_End": 2075.66, "Text": " to sell treatments. That's what they used this for."}, {"Time_Start": 2075.66, "Time_End": 2084.8599999999997, "Text": " this for. They made millions and millions of dollars and it did nothing to benefit"}, {"Time_Start": 2084.8599999999997, "Time_End": 2093.06, "Text": " anyone that really needed it. People died. This is one instance. When I was getting ready to leave"}, {"Time_Start": 2093.06, "Time_End": 2102.96, "Text": " that company after I finished my consulting engagement, I said to them, I'm sorry. I said to them, I'm sorry."}, {"Time_Start": 2105.66, "Time_End": 2112.66, "Text": " I said to them, I can't believe what I just saw."}, {"Time_Start": 2112.66, "Time_End": 2115.66, "Text": " And they said to me, they said, hey, you know what?"}, {"Time_Start": 2115.66, "Time_End": 2118.66, "Text": " You ought to come work for us."}, {"Time_Start": 2118.66, "Time_End": 2122.66, "Text": " We do all kinds of really cool and neat things."}, {"Time_Start": 2122.66, "Time_End": 2125.66, "Text": " Yeah, we got the cure for a varian cancer in there."}, {"Time_Start": 2125.66, "Time_End": 2129.66, "Text": " Hell, we've got, probably got the cure for the common cold."}, {"Time_Start": 2129.66, "Time_End": 2132.66, "Text": " Somewhere in those files and somewhere in those systems."}, {"Time_Start": 2132.66, "Time_End": 2134.66, "Text": " You know computers, why don't you come on?"}, {"Time_Start": 2134.66, "Time_End": 2135.64, "Text": " Come on and give us a hand."}, {"Time_Start": 2135.66, "Time_End": 2142.66, "Text": " You know, it was, it was no way, no way am I going to do this."}, {"Time_Start": 2142.66, "Time_End": 2147.66, "Text": " I thought about going in afterwards. I went after some of the people, the scientists and stuff."}, {"Time_Start": 2147.66, "Time_End": 2152.66, "Text": " I grabbed their names. I tried contacting him at home, asking him how they could sleep at night."}, {"Time_Start": 2152.66, "Time_End": 2154.66, "Text": " I couldn't get into the system. It was air gap."}, {"Time_Start": 2154.66, "Time_End": 2157.66, "Text": " They ended up closing down that facility and moving to another location."}, {"Time_Start": 2157.66, "Time_End": 2159.66, "Text": " I have no idea where it's at now."}, {"Time_Start": 2159.66, "Time_End": 2164.66, "Text": " But there you have it. That's just one. That's just one incident."}, {"Time_Start": 2164.66, "Time_End": 2174.66, "Text": " Now, I can also go on and talk to you about Dow Chemical and some of the things that DuPont and those guys did back in the 70s and 80s."}, {"Time_Start": 2174.66, "Time_End": 2177.66, "Text": " These people were brought up on criminal charges."}, {"Time_Start": 2177.66, "Time_End": 2184.66, "Text": " And it's kind of sad that you have that kind of thing that's going on out there in the world."}, {"Time_Start": 2184.66, "Time_End": 2191.66, "Text": " And all of a sudden doing things such as defacing a website don't seem quite as important anymore."}, {"Time_Start": 2191.66, "Time_End": 2193.66, "Text": " They're kind of childish."}, {"Time_Start": 2193.66, "Time_End": 2207.66, "Text": " Now, I find this type of a crime against humanity as bad as anything I think I've ever encountered, ever."}, {"Time_Start": 2207.66, "Time_End": 2216.66, "Text": " Now, I'm not advocating that we immediately go out and Aaron Brockovich their ass, although if someone wants to, that's fine."}, {"Time_Start": 2216.66, "Time_End": 2222.66, "Text": " But like I said, I'm not going to devolves the company's name. I'm not going to be, because they'll just, they'll come after me."}, {"Time_Start": 2222.66, "Time_End": 2237.66, "Text": " But I am saying that there are much more interesting and worthy targets if you're going to decide to go out and get your message out or do your or do whatever it is you want to do."}, {"Time_Start": 2237.66, "Time_End": 2249.66, "Text": " And I just want to imagine if one of us heard of a transnational, one of these multinational global conglomerates that held a secret like this that was proprietary."}, {"Time_Start": 2249.66, "Time_End": 2252.64, "Text": " But again, disclosure could result in safety."}, {"Time_Start": 2252.66, "Time_End": 2259.66, "Text": " living lives. Now imagine if we were organized. And I think this is why we are really feared."}, {"Time_Start": 2261.66, "Time_End": 2267.66, "Text": " Because quite frankly, because of such things which Aaron Brockovich and others have uncovered,"}, {"Time_Start": 2267.66, "Time_End": 2275.66, "Text": " what perhaps some of you may have uncovered, maybe we really do need to organize."}, {"Time_Start": 2275.66, "Time_End": 2282.64, "Text": " And most of these transnationals, these transnationals, they really only care about their one"}, {"Time_Start": 2282.66, "Time_End": 2290.66, "Text": " God with two heads. And those two heads are money and power. And that's it. And this is why they, this is why I think they really fear us."}, {"Time_Start": 2290.66, "Time_End": 2307.66, "Text": " I do recommend this. I do think we need to start to join forces and help out other groups that are out there, maybe such as Amnesty International."}, {"Time_Start": 2307.66, "Time_End": 2312.64, "Text": " I don't want to get too, you know, wispy-eyed about all of this in front of"}, {"Time_Start": 2312.66, "Time_End": 2337.66, "Text": " of you on this, but it is something that does mean something to me. I think what could happen if we do start to organize with them is that we could learn a lot about protecting ourselves, about protesting against things, and I think they could learn a lot about the technology that would benefit them and what they do. I think we can actually create a real, it could be a real symbiosis, something that really works well."}, {"Time_Start": 2337.66, "Time_End": 2342.64, "Text": " Stay tuned for developments. I've been talking with a number of people from different hacker groups."}, {"Time_Start": 2342.66, "Time_End": 2351.46, "Text": " that I've hit up with earlier this week and in the past couple of weeks, and I think we're hoping to do more on this."}, {"Time_Start": 2353.06, "Time_End": 2370.66, "Text": " And as society continues to deevolve into greed that are caused by, you know, the puppeteers that are running this cluster fuck that we call our society, we have to prepare ourselves for a few inevitable truths."}, {"Time_Start": 2372.66, "Time_End": 2393.7799999999997, "Text": " We have to prepare ourselves to remember that if we, the people, are being screwed by the man, and the man is controlling the information, you can bet that we, the people, are going to turn to us for help."}, {"Time_Start": 2394.8199999999997, "Time_End": 2402.64, "Text": " We're already volunteering to help out other citizens on this planet with such projects as Pekabootie and Robert Hope,"}, {"Time_Start": 2402.66, "Time_End": 2408.98, "Text": " However, with increasing globalization, it is possible that elements, particularly"}, {"Time_Start": 2408.98, "Time_End": 2417.48, "Text": " oppressive ones from different nation states, will begin to affect us."}, {"Time_Start": 2417.48, "Time_End": 2423.56, "Text": " And this brings us back to Witterschance, the opening of closed circles to release their magic."}, {"Time_Start": 2423.56, "Time_End": 2430.3799999999997, "Text": " As I stated, we are prisoners. The key to unlocking our shackles is information. That is why"}, {"Time_Start": 2430.38, "Time_End": 2436.38, "Text": " we say information wants to be free. A lot of this information has been gathered"}, {"Time_Start": 2436.38, "Time_End": 2442.38, "Text": " and closed away from the rest of us, some to protect others, some to protect us from ourselves,"}, {"Time_Start": 2442.38, "Time_End": 2448.48, "Text": " some just to make money on the backs of others. And I want to give you a little bit of"}, {"Time_Start": 2448.48, "Time_End": 2456.06, "Text": " information. I want to just bring up a few facts about how our talents are being used against"}, {"Time_Start": 2456.06, "Time_End": 2460.36, "Text": " us. We're being used by the system. I am, you are"}, {"Time_Start": 2460.38, "Time_End": 2467.38, "Text": " We have to work. We work hard. All of us because really nothing is free."}, {"Time_Start": 2467.38, "Time_End": 2473.38, "Text": " None of us live in freedom. We're enslaved to various systems such as credit card debt,"}, {"Time_Start": 2473.38, "Time_End": 2481.38, "Text": " the entire health care and insurance cycle, mortgages, car payments. We are slaves of our own economy."}, {"Time_Start": 2490.38, "Time_End": 2498.1400000000003, "Text": " being tapped into by others, the great them, they. They watch our websites, they sniff"}, {"Time_Start": 2498.1400000000003, "Time_End": 2504.2400000000002, "Text": " our email, they watch our post a full disclosure mailing list, they study our habits, they watch"}, {"Time_Start": 2504.2400000000002, "Time_End": 2510.08, "Text": " our very thought processes that we detail in research papers. They use this to say that we are"}, {"Time_Start": 2510.08, "Time_End": 2517.54, "Text": " a danger to society and yet they use our honed skills to build their defenses."}, {"Time_Start": 2520.38, "Time_End": 2528.76, "Text": " Those that spy upon us have greater technabilities than I think than we've previously"}, {"Time_Start": 2528.76, "Time_End": 2536.1, "Text": " guessed. There's been a lot of talk, especially with the previous talk, regarding such things"}, {"Time_Start": 2536.1, "Time_End": 2543.88, "Text": " as the NSA. And I, for one, don't necessarily believe that they cave to public pressure and allowed"}, {"Time_Start": 2543.88, "Time_End": 2550.06, "Text": " export of crypto over 40 bits. That's just something you don't want to just tip your hand"}, {"Time_Start": 2550.06, "Time_End": 2555.38, "Text": " to the enemy to do. My guess is they could probably cut through 128-bit encryption"}, {"Time_Start": 2555.38, "Time_End": 2561.84, "Text": " like butter, and they could probably do it in real time if they wanted to. And so I think they've"}, {"Time_Start": 2561.84, "Time_End": 2567.34, "Text": " it's really raised the bar. You know, I would not be surprised to tell you the truth of 1024"}, {"Time_Start": 2567.34, "Time_End": 2574.5, "Text": " bit within the inner sanctum was probably capable of being brute-forced in just a day or two,"}, {"Time_Start": 2574.5, "Time_End": 2580.04, "Text": " and 2048 within a week to 10 days. It just seems to me to make sense."}, {"Time_Start": 2580.06, "Time_End": 2586.46, "Text": " sense. And maybe you call me paranoid, but I'd rather live paranoid than looking just"}, {"Time_Start": 2586.46, "Time_End": 2595.7, "Text": " in case they are watching. But we'll not find out about it because the enemy states, they"}, {"Time_Start": 2595.7, "Time_End": 2600.0, "Text": " would find out about this as well, so I don't think we're going to find about this anytime soon."}, {"Time_Start": 2601.38, "Time_End": 2606.72, "Text": " My guess is anything close to the real capability will be denied. Denied is technically impossible"}, {"Time_Start": 2606.72, "Time_End": 2609.4, "Text": " to keep us in the rest of the real world and dark."}, {"Time_Start": 2610.06, "Time_End": 2621.02, "Text": " It is the nature of governments to try and main control over its people and preserve"}, {"Time_Start": 2621.02, "Time_End": 2623.7999999999997, "Text": " the infrastructures that sustain it."}, {"Time_Start": 2623.7999999999997, "Time_End": 2628.5, "Text": " With the de-evolution of the nation states, the rise of the transnational state, we must realize"}, {"Time_Start": 2628.5, "Time_End": 2634.24, "Text": " that we, the computer underground, are more of a target of various governments and transnational"}, {"Time_Start": 2634.24, "Time_End": 2639.62, "Text": " states than ever before, because we are a provisional government away from becoming a transnational"}, {"Time_Start": 2639.62, "Time_End": 2645.2799999999997, "Text": " national state ourselves. As I said earlier, if we were organized, they would"}, {"Time_Start": 2645.2799999999997, "Time_End": 2652.88, "Text": " really fear us because we would be unstoppable. And maybe that really is it. If we are a"}, {"Time_Start": 2652.88, "Time_End": 2657.98, "Text": " headless provisional government with hackers holding the wires instead of the infamous"}, {"Time_Start": 2657.98, "Time_End": 2665.06, "Text": " them, they can't control it, and I think that drives them absolutely mad. And I think"}, {"Time_Start": 2665.06, "Time_End": 2669.6, "Text": " they will try and stop us. Under the guise of laws used to protect us,"}, {"Time_Start": 2669.62, "Time_End": 2676.94, "Text": " from cyber terrorist issues such as college students trading MP3s, we are seeing"}, {"Time_Start": 2676.94, "Time_End": 2686.4, "Text": " our basic rights slowly being eaten away. A journalist who actually understands this stuff and is not"}, {"Time_Start": 2686.4, "Time_End": 2694.18, "Text": " an idiot, who goes by the name of Lou Cook, has labeled this neo-McCarthianism with the name"}, {"Time_Start": 2694.18, "Time_End": 2699.6, "Text": " of cybersterea, and it is real. It draws circles around idyllis."}, {"Time_Start": 2699.62, "Time_End": 2704.56, "Text": " of information and freedom, and it closes it off."}, {"Time_Start": 2704.56, "Time_End": 2709.2, "Text": " We have to find these circles that ensnare us, and we have to open them up."}, {"Time_Start": 2709.2, "Time_End": 2711.58, "Text": " Their energy needs to be released."}, {"Time_Start": 2711.58, "Time_End": 2718.42, "Text": " It has been said that the Internet is the great equalizer, and we should make that so."}, {"Time_Start": 2718.42, "Time_End": 2721.12, "Text": " We cannot wait until they take away our rights."}, {"Time_Start": 2721.12, "Time_End": 2726.52, "Text": " This is not a veiled thread about some bleak William Gibson futuristic landscape, and all of us"}, {"Time_Start": 2726.52, "Time_End": 2729.5, "Text": " romanticizing we are Neo running around trying to"}, {"Time_Start": 2729.5, "Time_End": 2738.4, "Text": " unplug the man. They are at the door. Now. It is here. Remember what techniques"}, {"Time_Start": 2738.4, "Time_End": 2743.78, "Text": " use to suppress human rights in the physical world can be adapted to the virtual one. We all"}, {"Time_Start": 2743.78, "Time_End": 2752.68, "Text": " could be next. It is cyber hysteria indeed. We are hackers. We adapt. If we are outlawed on the"}, {"Time_Start": 2752.68, "Time_End": 2757.98, "Text": " internet, we will circumvent our shackles. Maybe we'll return to our BBSs as of old, but we will"}, {"Time_Start": 2757.98, "Time_End": 2764.64, "Text": " still share our information, and we will still get our message out, and we will not be suppressed."}, {"Time_Start": 2764.64, "Time_End": 2770.62, "Text": " They will try their disinformation subterfuge and try to cloud your minds with petty arguments about"}, {"Time_Start": 2770.62, "Time_End": 2777.2400000000002, "Text": " such things as full disclosure debate, open source versus closed source, and the technological"}, {"Time_Start": 2777.2400000000002, "Time_End": 2784.8, "Text": " interpretations of our work. But it will only strengthen our resolve. They will try and stop us from"}, {"Time_Start": 2784.8, "Time_End": 2787.96, "Text": " entering their sacred little circles by chopping our own."}, {"Time_Start": 2787.98, "Time_End": 2795.38, "Text": " off the heads of our leaders. But guess what? There will be the occasional"}, {"Time_Start": 2795.38, "Time_End": 2802.38, "Text": " rallying battle cry by an individual or group, but there are no real leaders, only resolve,"}, {"Time_Start": 2802.38, "Time_End": 2806.02, "Text": " and raw, unbridled intellect."}, {"Time_Start": 2817.98, "Time_End": 2829.84, "Text": " gray hats, crackers, script kitties. You can use those terms and you can try to subdivide us"}, {"Time_Start": 2829.84, "Time_End": 2836.46, "Text": " and pit us against one another. It's not going to work. We are hackers."}, {"Time_Start": 2837.66, "Time_End": 2847.48, "Text": " In closing, I just want to say, with a traditional Wiccan saying, the circle is open. The circle is open."}, {"Time_Start": 2847.98, "Time_End": 2853.22, "Text": " Yet unbroken, merry meets, merry parts, merry meet again."}, {"Time_Start": 2853.86, "Time_End": 2855.76, "Text": " Thank you and blessed be."}]}