{"segments": [{"Time_Start": 0.0, "Time_End": 17.56, "Text": " This has won a permanent record."}, {"Time_Start": 18.6, "Time_End": 25.16, "Text": " Richard Thiem is one of the most extraordinary men that I've ever had the pleasure"}, {"Time_Start": 25.16, "Time_End": 29.98, "Text": " of both meeting, discussing with issues."}, {"Time_Start": 30.0, "Time_End": 34.92, "Text": " he's with and sharing a lot of similarities."}, {"Time_Start": 36.04, "Time_End": 46.92, "Text": " His depth of knowledge is so extraordinary, covering probably one of the widest ranges that I've ever"}, {"Time_Start": 46.92, "Time_End": 53.08, "Text": " encountered, makes it a gift for me every time I'm in his presence."}, {"Time_Start": 54.480000000000004, "Time_End": 59.980000000000004, "Text": " It's not often you meet, you know, your circle of people you love is always very small."}, {"Time_Start": 60.0, "Time_End": 72.46000000000001, "Text": " but having met Richard, it expanded by one, being captured by a man with intelligence, breath, depth,"}, {"Time_Start": 73.38, "Time_End": 82.5, "Text": " humanity, and above all, empathy. That is an astonishingly important group of virtues,"}, {"Time_Start": 82.5, "Time_End": 87.7, "Text": " and my friend, Richard Thiem, has them all. Welcome him."}, {"Time_Start": 90.0, "Time_End": 101.6, "Text": " Thank you. I am so completely used to being insulted, abused, and otherwise"}, {"Time_Start": 101.6, "Time_End": 107.3, "Text": " reduced to a sniveling, begging mess of, please stop Lou, that when he says something"}, {"Time_Start": 107.3, "Time_End": 113.16, "Text": " like that, I don't know what to say, except thank you, and it's mutual. We're two old Chicago"}, {"Time_Start": 113.16, "Time_End": 119.98, "Text": " guys. What are the silverbacks doing at a place like this? What has happened that lets this"}, {"Time_Start": 120.0, "Time_End": 125.12, "Text": " kind of thing happen. That's part of what I want to talk about. What we're doing here,"}, {"Time_Start": 126.08, "Time_End": 132.76, "Text": " we're trying to offer some perspective. Why we come is because, as Silverbacks with perspective,"}, {"Time_Start": 133.4, "Time_End": 140.0, "Text": " we also are sorely in need of the reinvigorating presence and power of what we perceive the hacking"}, {"Time_Start": 140.0, "Time_End": 146.98, "Text": " community in its totality, in its aggregate to possess, and to offer selflessly in an open source"}, {"Time_Start": 146.98, "Time_End": 149.98, "Text": " model of give, give, give, share, share."}, {"Time_Start": 150.0, "Time_End": 155.6, "Text": " share. We perceived, both of us, I think, Lou and I, Lou from his background, an extraordinary"}, {"Time_Start": 155.6, "Time_End": 160.76, "Text": " work in Chicago journalism, winning awards for documentaries with the heart of a hacker concerned"}, {"Time_Start": 160.76, "Time_End": 165.9, "Text": " about the murder of Fred Hampton. Forty thousand rounds in 8.6 seconds will take anybody out,"}, {"Time_Start": 165.9, "Time_End": 170.68, "Text": " especially when it's fired by the police in five seconds right after the warning. Most of you"}, {"Time_Start": 170.68, "Time_End": 174.88, "Text": " probably don't know that ancient history, but Lou has investigated that and all sorts of other"}, {"Time_Start": 174.88, "Time_End": 179.98, "Text": " things. As we grow older, we perceive the world to be changing radically, and we"}, {"Time_Start": 180.0, "Time_End": 186.5, "Text": " We perceive ourselves to be in need of tutoring and mentoring by younger people whose world"}, {"Time_Start": 186.5, "Time_End": 190.32, "Text": " is framed by the technology they have co-created."}, {"Time_Start": 190.32, "Time_End": 196.0, "Text": " DefCon 1, DefCon 2, 100 people, mostly guys, very few women, coming into the desert"}, {"Time_Start": 196.0, "Time_End": 199.54, "Text": " out of nowhere, meeting in bulletin boards online."}, {"Time_Start": 199.54, "Time_End": 202.2, "Text": " My first DefCon was DefCon 4."}, {"Time_Start": 202.2, "Time_End": 207.2, "Text": " I'm thinking back to one of the guys who refused to tell me his handle, much less his name,"}, {"Time_Start": 207.2, "Time_End": 209.98, "Text": " who when I asked, where are you from, said Texas, when I said,"}, {"Time_Start": 210.0, "Time_End": 217.18, "Text": " where in Texas said Texas, because the need for stealth and the fear and the paranoia of,"}, {"Time_Start": 217.18, "Time_End": 223.0, "Text": " I hope they don't find out what I've done, was so thick. You could cut it with a knife. I perceived"}, {"Time_Start": 223.0, "Time_End": 229.22, "Text": " correctly that those guys would be in positions of power and authority. The first talk I did"}, {"Time_Start": 229.22, "Time_End": 234.5, "Text": " here, DefCon4, was hacking his practice for transplanetary life in the 21st century."}, {"Time_Start": 234.5, "Time_End": 239.74, "Text": " We're in that century and the people who were then afraid to tell you their name or their handle"}, {"Time_Start": 239.74, "Time_End": 244.18, "Text": " are now in positions of power and authority in corporate America in the security business"}, {"Time_Start": 244.18, "Time_End": 253.24, "Text": " and in the intelligence community. Things change. Hacking changes. I have changed in the process"}, {"Time_Start": 253.24, "Time_End": 259.88, "Text": " of being immersed here in six years. I came as an outsider looking for advice from outsiders."}, {"Time_Start": 260.64, "Time_End": 266.76, "Text": " What I find myself now is with some of the best friends I have ever made in my life based on a shared"}, {"Time_Start": 266.76, "Time_End": 269.72, "Text": " set of assumptions. But those assumptions are about"}, {"Time_Start": 269.74, "Time_End": 275.42, "Text": " hacking in its essence, and things do change over time. So I've got a couple of themes."}, {"Time_Start": 275.84000000000003, "Time_End": 280.98, "Text": " I'll recapitulate a couple of things in quieter, softer detail that I did at Black Hat,"}, {"Time_Start": 280.98, "Time_End": 286.36, "Text": " but mostly it'll be a DefCon speech and not a Black Hat speech. Dead addict, one of my good"}, {"Time_Start": 286.36, "Time_End": 294.02, "Text": " friend said after Black Hat, man, you laid acid on us and you need to give us dope, which you know"}, {"Time_Start": 294.02, "Time_End": 299.08, "Text": " exactly what that means. So here's the dope. Here's the dope."}, {"Time_Start": 299.74, "Time_End": 309.38, "Text": " dope. What happened that allowed hacking to emerge as I really think it emerged? I think"}, {"Time_Start": 309.38, "Time_End": 316.82, "Text": " the 60s is where I look at MIT is where I look most closely, was a technology emerged that"}, {"Time_Start": 316.82, "Time_End": 323.14, "Text": " people were creating that changed fundamentally, in its essence, what I call the cognitive"}, {"Time_Start": 323.14, "Time_End": 327.90000000000003, "Text": " space of humanity. Now, I'm trying to try not to get too high flute and too technical, but"}, {"Time_Start": 327.90000000000003, "Time_End": 329.40000000000003, "Text": " there are a couple of key points."}, {"Time_Start": 329.74, "Time_End": 340.94, "Text": " One is that the cognitive space in which those of you who are 20 and under live was created for you or co-created for you by people whose names you probably don't know."}, {"Time_Start": 341.34000000000003, "Time_End": 348.34000000000003, "Text": " And this is what's critical. It literally did not exist in pre-war America or pre-war Earth."}, {"Time_Start": 348.88, "Time_End": 353.40000000000003, "Text": " The cognitive space in which you live now, when I say pre-war, I forgot there have been so many."}, {"Time_Start": 353.96000000000004, "Time_End": 358.92, "Text": " Pre-World War II is the war I'm thinking of, identifying my generation's benchmark."}, {"Time_Start": 359.74, "Time_End": 366.54, "Text": " Literally, it did not exist. People began to identify how it was coming to be and what"}, {"Time_Start": 366.54, "Time_End": 372.98, "Text": " it meant. People like Minsky at MIT asked this question. He said, you know, what do we mean"}, {"Time_Start": 372.98, "Time_End": 379.54, "Text": " by thinking? What is thinking? He said, thinking is the capacity simultaneously to hold in your"}, {"Time_Start": 379.54, "Time_End": 384.74, "Text": " mind a multiplicity of perspective, some of which seem mutually exclusive or contradictory."}, {"Time_Start": 384.74, "Time_End": 389.7, "Text": " Is this too intense for this hour of the morning? Okay. Okay. Okay."}, {"Time_Start": 389.74, "Time_End": 395.18, "Text": " rewind, back up, step up. Thinking is the ability to hold simultaneously in your mind,"}, {"Time_Start": 395.3, "Time_End": 401.22, "Text": " seemingly contradictory or mutually exclusive models of reality maps to the territory,"}, {"Time_Start": 401.7, "Time_End": 407.6, "Text": " which you hold tentatively and lightly, so that you can evaluate the stream of information coming"}, {"Time_Start": 407.6, "Time_End": 412.86, "Text": " into your system, compare it to the map and evaluate and say and conclude which is a good enough"}, {"Time_Start": 412.86, "Time_End": 419.36, "Text": " map for now to guide us into the territory, which is going to be good enough just for this moment, this week,"}, {"Time_Start": 419.36, "Time_End": 424.52000000000004, "Text": " this year because the map is constantly changing. That's what you mean by thinking. He said"}, {"Time_Start": 424.52000000000004, "Time_End": 429.58000000000004, "Text": " if you can only think one thing, and most of us has at least one member of our family who fits"}, {"Time_Start": 429.58000000000004, "Time_End": 434.42, "Text": " into this category. You can only think from one point of view. You're a literalist or a"}, {"Time_Start": 434.42, "Time_End": 439.18, "Text": " fundamentalist of the mind. And therefore, when you're talking to such a person, you know there's no"}, {"Time_Start": 439.18, "Time_End": 444.04, "Text": " dialogue, no give and take, no conversation. There's their position, which is the fixed foot"}, {"Time_Start": 444.04, "Time_End": 449.18, "Text": " of the compass, and your choice is to move toward it or away from it. And that's it. They are not"}, {"Time_Start": 449.36, "Time_End": 456.36, "Text": " capable of thinking. Where he said, is thinking taking place? Where is the cognitive space of humanity now? He said it is the net."}, {"Time_Start": 457.02000000000004, "Time_End": 464.14, "Text": " Now you've got all these words which have become second nature to you. The net, the matrix, the network, whatever you want to call it, the web."}, {"Time_Start": 464.64, "Time_End": 476.14, "Text": " All metaphors pointing to the same reality, a new restructuring of our relationship to ourselves, to each other, and to how we hold ourselves in the world as a possibility for action."}, {"Time_Start": 476.98, "Time_End": 479.34000000000003, "Text": " He said it's happening on the net, and therefore he's"}, {"Time_Start": 479.36, "Time_End": 485.52000000000004, "Text": " said to a generation for whom the words were new, if you are not plugged into the net, you are literally"}, {"Time_Start": 485.52000000000004, "Time_End": 493.16, "Text": " like a computer on a desktop in a corner, unplugged from the net, you are a brain in a bottle."}, {"Time_Start": 494.12, "Time_End": 500.22, "Text": " And he went on to say, and if you do not speak the language of the net, you are like a child raised by wolves"}, {"Time_Start": 500.22, "Time_End": 508.44, "Text": " in a cave, unable to speak the dialect of its tribe. You are less than human. So now, 20 and under,"}, {"Time_Start": 509.36, "Time_End": 515.26, "Text": " socialized into this cognitive space which us, Greybacks, found it our privilege to watch"}, {"Time_Start": 515.26, "Time_End": 521.4, "Text": " emerge. And because we were socialized to text and a different kind of technological structure of"}, {"Time_Start": 521.4, "Time_End": 528.96, "Text": " reality, we were able to see by contrast what was emerging. It was in that cognitive space, in that"}, {"Time_Start": 528.96, "Time_End": 535.22, "Text": " cognitive space, that hacking developed and gained its potency and its real meaning."}, {"Time_Start": 535.84, "Time_End": 539.0600000000001, "Text": " Now, let me give you a big picture view, which is something I like to give. I used to be in the"}, {"Time_Start": 539.0600000000001, "Time_End": 544.2, "Text": " religion business, by which I mean I was an Episcopal priest for 16 years. Please do not"}, {"Time_Start": 544.2, "Time_End": 549.0200000000001, "Text": " hold that against me. An Episcopal priest is merely a social engineer who has learned how to use and"}, {"Time_Start": 549.0200000000001, "Time_End": 553.98, "Text": " manipulate and empower the symbols of a tradition in order to organize communities around those symbols"}, {"Time_Start": 553.98, "Time_End": 559.0600000000001, "Text": " that don't know they're being social engineered. Just take it from me that you become..."}, {"Time_Start": 564.0600000000001, "Time_End": 569.0400000000001, "Text": " What I love about the unscripted truth that pops out is everybody recognizes it for what"}, {"Time_Start": 569.0600000000001, "Time_End": 575.3800000000001, "Text": " it is. So it occurred to me back in the early 80s when I bought an Apple 2. And my kids"}, {"Time_Start": 575.3800000000001, "Time_End": 580.7800000000001, "Text": " start playing with it and I start playing with it and he'd be playing a game in Hawaii and"}, {"Time_Start": 580.7800000000001, "Time_End": 586.2600000000001, "Text": " Aski Express 300 bought modem, you know, a little green screen. I'd say, where'd you get that game?"}, {"Time_Start": 586.2600000000001, "Time_End": 590.1400000000001, "Text": " The computer world didn't seem to have them. He says, no, it'll be out in about six months."}, {"Time_Start": 591.0400000000001, "Time_End": 595.5000000000001, "Text": " And I said, oh, how did you get it? And that's where I began being tutored by a 12-year-old."}, {"Time_Start": 595.5000000000001, "Time_End": 599.0400000000001, "Text": " And that's where I learned as an older man that if you're just really kind, people,"}, {"Time_Start": 599.0600000000001, "Time_End": 604.6600000000001, "Text": " patient and just respectful of your youngers, they will teach you what you need to know to"}, {"Time_Start": 604.6600000000001, "Time_End": 610.8800000000001, "Text": " function in the world. This is advice I give business people and CEOs all the time. In the"}, {"Time_Start": 610.8800000000001, "Time_End": 617.3800000000001, "Text": " religion business, it suddenly flashed upon my inner eye this truth, that the technological"}, {"Time_Start": 617.3800000000001, "Time_End": 622.84, "Text": " structures of humanity had created the religious and spiritual domain of the world. Let me"}, {"Time_Start": 622.84, "Time_End": 628.6200000000001, "Text": " tell you what I mean by that. Oral cultures. Before about 2,000 years ago, we had oral cultures before"}, {"Time_Start": 628.62, "Time_End": 632.92, "Text": " the emergence of writing. If I asked you to name the names of God you know from those times,"}, {"Time_Start": 633.0, "Time_End": 638.04, "Text": " you wouldn't have many to name because the oral cultures all died, i.e., the transmission of information"}, {"Time_Start": 638.04, "Time_End": 642.72, "Text": " by the coupling of the interface of tribe to tribe and person to person through oral tradition"}, {"Time_Start": 642.72, "Time_End": 647.76, "Text": " could only disseminate in real time what people had amassed and learned and passed down from"}, {"Time_Start": 647.76, "Time_End": 652.72, "Text": " generation to generation. Around the time that writing emerged, a whole bunch of people emerged in that"}, {"Time_Start": 652.72, "Time_End": 658.6, "Text": " very narrow bandwidth of historical time. And that's when all the religions of the world that we"}, {"Time_Start": 658.62, "Time_End": 663.88, "Text": " we call religions emerged. So it became clear to me that whoever it is you look to as a"}, {"Time_Start": 663.88, "Time_End": 669.46, "Text": " guru or someone to follow, whether it's Buddha or Jesus or Muhammad or Confucius or Moses or"}, {"Time_Start": 669.46, "Time_End": 675.86, "Text": " Lao Tzu or whatever, all of those people emerged during a very narrow bandwidth of time and"}, {"Time_Start": 675.86, "Time_End": 681.78, "Text": " were transformed from flesh and blood human beings into textual beings. Writing became the media"}, {"Time_Start": 681.78, "Time_End": 688.36, "Text": " through which they interfaced with humanity. And when people read written text, they internalized"}, {"Time_Start": 688.36, "Time_End": 694.04, "Text": " an image of possibility that was fundamentally different for them as individuals and collectively"}, {"Time_Start": 694.04, "Time_End": 699.94, "Text": " as humanity, a species, a society, or a culture than had ever been possible before the technology"}, {"Time_Start": 699.94, "Time_End": 705.6800000000001, "Text": " of writing emerged. Therefore, those aren't religions. Those are textual religions and the gods"}, {"Time_Start": 705.6800000000001, "Time_End": 711.32, "Text": " worshipped in and through them are textual gods. The printing press with movable type transformed"}, {"Time_Start": 711.32, "Time_End": 716.36, "Text": " those religions, sliced and diced them. They call it in this country Protestantism. It just means"}, {"Time_Start": 716.36, "Time_End": 720.96, "Text": " any time there's a deviance or aberration from the Orthodox truth, you start a new religion."}, {"Time_Start": 721.3000000000001, "Time_End": 727.3000000000001, "Text": " Not possible before people could read silently to themselves from the text, the typographic text,"}, {"Time_Start": 727.3000000000001, "Time_End": 732.98, "Text": " and it just became obvious to me that in this era of roughly a couple of hundred years of electronic"}, {"Time_Start": 732.98, "Time_End": 738.3000000000001, "Text": " communication, of which the net is merely the latest manifestation, we were once again going"}, {"Time_Start": 738.3000000000001, "Time_End": 743.2, "Text": " to transform ourselves in the image of the digital images and icons with which we interacted."}, {"Time_Start": 743.2, "Time_End": 746.86, "Text": " and digital gods and digital gurus were going to emerge."}, {"Time_Start": 747.22, "Time_End": 753.62, "Text": " I thought in the muds and mushes, now I would say in domains like EverQuest, where spirituality runs rampant."}, {"Time_Start": 753.74, "Time_End": 761.08, "Text": " In all the vast community games of the web, we are going to see emerging on the edges the spiritual concerns of humankind,"}, {"Time_Start": 761.62, "Time_End": 768.6, "Text": " and those gods and gurus are going to be like the web itself interactive and modular and fluid."}, {"Time_Start": 769.36, "Time_End": 773.1800000000001, "Text": " So the cognitive space of humanity is once again changed."}, {"Time_Start": 773.2, "Time_End": 775.0, "Text": " in a fundamental and primary way."}, {"Time_Start": 775.82, "Time_End": 780.1400000000001, "Text": " You take for granted, you who have been socialized by the matrix or the web or the net,"}, {"Time_Start": 780.62, "Time_End": 785.98, "Text": " that life is fundamentally interactive and modular and fluid, but let me give you a quick example"}, {"Time_Start": 785.98, "Time_End": 789.08, "Text": " of how difficult that is for someone older in certain cultures to get."}, {"Time_Start": 789.1800000000001, "Time_End": 793.7800000000001, "Text": " I live in the upper Midwest in Milwaukee, although I've lived in many other places, and if you"}, {"Time_Start": 793.7800000000001, "Time_End": 797.86, "Text": " asked an older Milwaukee person what they thought life consisted of, they thought that you were supposed"}, {"Time_Start": 797.86, "Time_End": 801.38, "Text": " to get out of school and get a job and keep it for the rest of your life."}, {"Time_Start": 801.38, "Time_End": 805.88, "Text": " If you were heterosexual, you were supposed to get married to a human of the opposite gender,"}, {"Time_Start": 806.28, "Time_End": 808.26, "Text": " and you were supposed to stay married to them forever."}, {"Time_Start": 808.76, "Time_End": 811.32, "Text": " If you were born into a religion, you were supposed to be that."}, {"Time_Start": 811.42, "Time_End": 813.76, "Text": " In fact, the ontology and the epistemology were identical."}, {"Time_Start": 813.9399999999999, "Time_End": 814.58, "Text": " You were that."}, {"Time_Start": 814.64, "Time_End": 818.9399999999999, "Text": " You couldn't conceive of an option because there was nothing with which to contrast what you had."}, {"Time_Start": 819.5, "Time_End": 820.28, "Text": " It was linear."}, {"Time_Start": 820.62, "Time_End": 823.9399999999999, "Text": " It was fixed, and it went to the end of your life and beyond."}, {"Time_Start": 824.4399999999999, "Time_End": 830.44, "Text": " But modular life, the kind you live and I live, means we must recreate ourselves again and again,"}, {"Time_Start": 830.44, "Time_End": 837.94, "Text": " recreate personas, recreate the images which people believe ourselves to be, and then put them out there."}, {"Time_Start": 837.98, "Time_End": 839.7800000000001, "Text": " You can call it social engineering if you want."}, {"Time_Start": 839.8800000000001, "Time_End": 840.94, "Text": " I just call it life."}, {"Time_Start": 841.5200000000001, "Time_End": 844.98, "Text": " You want to change religions, change to one, change back, change to another."}, {"Time_Start": 845.1, "Time_End": 849.6400000000001, "Text": " You want to change wives, spouses, partners, lovers, companions, significant, others, or pals,"}, {"Time_Start": 850.4000000000001, "Time_End": 853.8800000000001, "Text": " swap, plug-and-play, do what you want with relationships."}, {"Time_Start": 855.48, "Time_End": 857.5600000000001, "Text": " I thought that crowd would be still asleep."}, {"Time_Start": 857.5600000000001, "Time_End": 858.7600000000001, "Text": " I'm surprised that you're here."}, {"Time_Start": 860.44, "Time_End": 862.0, "Text": " You want to change jobs?"}, {"Time_Start": 862.1, "Time_End": 864.34, "Text": " How many people have changed jobs just this week?"}, {"Time_Start": 864.86, "Time_End": 866.46, "Text": " Who worked for One Secure?"}, {"Time_Start": 867.6600000000001, "Time_End": 869.0400000000001, "Text": " Who worked for Webvan?"}, {"Time_Start": 869.98, "Time_End": 871.7800000000001, "Text": " You change your career."}, {"Time_Start": 872.12, "Time_End": 873.62, "Text": " You change your job."}, {"Time_Start": 873.72, "Time_End": 874.72, "Text": " You change your vocation."}, {"Time_Start": 874.82, "Time_End": 875.5200000000001, "Text": " You change your religion."}, {"Time_Start": 875.6400000000001, "Time_End": 876.44, "Text": " You change your spouse."}, {"Time_Start": 876.94, "Time_End": 881.82, "Text": " And as hackers, you discover that you've changed fundamentally from the inside out."}, {"Time_Start": 881.82, "Time_End": 884.86, "Text": " You recreate, co-invent with others."}, {"Time_Start": 885.1400000000001, "Time_End": 886.2600000000001, "Text": " Your new identity."}, {"Time_Start": 886.7, "Time_End": 888.86, "Text": " Identity is modular and fluid."}, {"Time_Start": 889.0200000000001, "Time_End": 890.08, "Text": " It is up for grabs."}, {"Time_Start": 890.44, "Time_End": 900.44, "Text": " first people to discover this were those formed by the cognitive space emerging on things like the PDP 6, etc., at places like MIT,"}, {"Time_Start": 900.44, "Time_End": 906.44, "Text": " because interacting with that cognitive space changed and transformed them in the process of interaction,"}, {"Time_Start": 906.44, "Time_End": 913.44, "Text": " and now a new generation or two has been born, which doesn't know it any other way."}, {"Time_Start": 913.44, "Time_End": 914.44, "Text": " Okay."}, {"Time_Start": 914.44, "Time_End": 917.44, "Text": " That's the introduction."}, {"Time_Start": 917.44, "Time_End": 918.44, "Text": " Any..."}, {"Time_Start": 920.44, "Time_End": 934.44, "Text": " Any questions? Okay. I mean, I'll pause periodically for breath and you can ask whatever questions you want."}, {"Time_Start": 934.44, "Time_End": 941.44, "Text": " All right. The second key point I want to make because it's fundamental to what we're talking about is the context is content."}, {"Time_Start": 941.44, "Time_End": 945.44, "Text": " That when the context shifts, what it always creates a new is a new content."}, {"Time_Start": 945.44, "Time_End": 948.44, "Text": " I use this example at Blackhead, but I use it again here."}, {"Time_Start": 948.44, "Time_End": 950.4200000000001, "Text": " Eddie Bernay is the father of spin."}, {"Time_Start": 950.44, "Time_End": 956.1800000000001, "Text": " one of the architects of propaganda, PR, sciops, and social engineering in this century."}, {"Time_Start": 956.48, "Time_End": 960.1600000000001, "Text": " He invented the word public relations, which was probably an act of public relations."}, {"Time_Start": 960.8000000000001, "Time_End": 965.1800000000001, "Text": " And in the late 1920s, he was asked by publishers in New York to help them increase the sales"}, {"Time_Start": 965.1800000000001, "Time_End": 969.98, "Text": " of books, which had significantly declined. He didn't just take out advertisements for specific books."}, {"Time_Start": 970.4000000000001, "Time_End": 974.3000000000001, "Text": " He went to intellectual leading lights of the day Nobel Prize winners, top professors,"}, {"Time_Start": 974.6600000000001, "Time_End": 980.4200000000001, "Text": " and he said, is literacy fundamental to a society? They all said it is. Without literacy, a society will"}, {"Time_Start": 980.44, "Time_End": 985.5600000000001, "Text": " fundamentally fall apart. He said, well, you sign an affidavit to that effect. They all said, of course, and did."}, {"Time_Start": 985.94, "Time_End": 990.44, "Text": " He then gathered together builders, architects, contractors, and showed them the affidavits. And he said,"}, {"Time_Start": 990.44, "Time_End": 997.2600000000001, "Text": " the brightest people of our time are telling me that without a literate society, we will be toast in another two or three decades."}, {"Time_Start": 997.58, "Time_End": 1010.4200000000001, "Text": " Will you do everything possible to create that literate society? They all said, of course, that is why, from the late 1920s on, never before in human history, unless you were an aristocrat, one of the two percent, when you walked into an apartment"}, {"Time_Start": 1010.44, "Time_End": 1015.0400000000001, "Text": " building, which began to be built all over the place, three flats, and houses you would find,"}, {"Time_Start": 1015.1, "Time_End": 1020.86, "Text": " for the first time in human history, built in bookshelves. And when you find book, build in bookshelves,"}, {"Time_Start": 1020.9200000000001, "Time_End": 1026.94, "Text": " what you do without thinking is buy books and put them on the shelves. Context, content. The bookshelves"}, {"Time_Start": 1026.94, "Time_End": 1033.02, "Text": " are context. The books that unthinkingly we buy and put on the shelves are content. Usability is"}, {"Time_Start": 1033.02, "Time_End": 1038.14, "Text": " simply another way for designing bookshelves of the mind on the screen or interface of the interacting"}, {"Time_Start": 1038.14, "Time_End": 1040.42, "Text": " computer or network or web, so that when"}, {"Time_Start": 1040.44, "Time_End": 1045.3, "Text": " people see it, they immediately fuse to it, don't think about it, and provide the contents"}, {"Time_Start": 1045.3, "Time_End": 1053.94, "Text": " of their souls, like books, onto the context. When the context changes, if you persist in doing"}, {"Time_Start": 1053.94, "Time_End": 1059.78, "Text": " the same behaviors that made sense in that context, then you become suspect. I mean, that's"}, {"Time_Start": 1059.78, "Time_End": 1064.94, "Text": " one definition of insanity, to persist in behaviors long after they cease to have meaning."}, {"Time_Start": 1064.94, "Time_End": 1070.42, "Text": " I mean, example, you are the context for this presentation. What I am doing right now,"}, {"Time_Start": 1070.44, "Time_End": 1075.94, "Text": " kind of makes sense because you create the space for it to happen. But if you come back"}, {"Time_Start": 1075.94, "Time_End": 1080.3200000000002, "Text": " here at 4 in the morning, the tent is dark, there is no one out there, and I am continuing to"}, {"Time_Start": 1080.3200000000002, "Time_End": 1087.64, "Text": " do this. You would probably conclude that I am at best a little marginal, right? The same behavior"}, {"Time_Start": 1087.64, "Time_End": 1092.94, "Text": " that makes sense because you create the context for it will cease to make sense when the context"}, {"Time_Start": 1092.94, "Time_End": 1100.42, "Text": " shifts. Hacking emerged in a cognitive space in which it made perfect sense. It fits. It fits."}, {"Time_Start": 1100.44, "Time_End": 1106.64, "Text": " books to bookshelves. The cognitive space invented, first in mainframes and then in networks,"}, {"Time_Start": 1107.1200000000001, "Time_End": 1113.5, "Text": " created through interaction with humans, a network of humans in symbiotic relationship to the network,"}, {"Time_Start": 1113.88, "Time_End": 1119.8200000000002, "Text": " formed by it, fused with it, thinking the way it thought, interactive, modular, and fluid in its new"}, {"Time_Start": 1119.8200000000002, "Time_End": 1127.68, "Text": " behaviors, actions, and thinking and feeling modes. But when that context shifts, the same things"}, {"Time_Start": 1127.68, "Time_End": 1129.24, "Text": " don't make sense."}, {"Time_Start": 1129.8400000000001, "Time_End": 1135.54, "Text": " Example. The guys playing on the mainframe at MIT began to invade each other's territory."}, {"Time_Start": 1135.9, "Time_End": 1140.64, "Text": " But it wasn't by crossing boundaries because, as you know, in the cognitive space of a computer"}, {"Time_Start": 1140.64, "Time_End": 1145.3200000000002, "Text": " network, there are no fixed boundaries. They are fluid. They are self-invented. They are"}, {"Time_Start": 1145.3200000000002, "Time_End": 1150.74, "Text": " arbitrarily designated, then co-created, and then observed as much in the breach as in the observation."}, {"Time_Start": 1151.22, "Time_End": 1156.38, "Text": " But there were no boundaries or fences or borders. Therefore, it was fun. The first hackers"}, {"Time_Start": 1156.38, "Time_End": 1157.66, "Text": " had fun."}, {"Time_Start": 1157.68, "Time_End": 1161.1200000000001, "Text": " I mean, there's a wonderful quote that I mentioned the black cat."}, {"Time_Start": 1161.46, "Time_End": 1165.96, "Text": " The machine easily masters, the grim and the dumb, said Marshall McLuhan."}, {"Time_Start": 1166.02, "Time_End": 1169.4, "Text": " The masters of technology must be lighthearted and intelligent."}, {"Time_Start": 1169.88, "Time_End": 1171.3200000000002, "Text": " They had fun."}, {"Time_Start": 1171.6200000000001, "Time_End": 1176.0, "Text": " They crossed boundaries that no one was threatened by the crossing of which,"}, {"Time_Start": 1176.1000000000001, "Time_End": 1183.18, "Text": " because they had not yet come to be in the legal and social and economic and political structures of humankind."}, {"Time_Start": 1183.5600000000002, "Time_End": 1185.04, "Text": " Therefore, no laws were broken."}, {"Time_Start": 1185.6000000000001, "Time_End": 1187.66, "Text": " Therefore, no boundaries were violated because they were,"}, {"Time_Start": 1187.68, "Time_End": 1191.0, "Text": " They weren't there in the first place, or if they were, they were so clearly co-created"}, {"Time_Start": 1191.0, "Time_End": 1194.0800000000002, "Text": " and invented from scratch that no one minded."}, {"Time_Start": 1194.0800000000002, "Time_End": 1200.0, "Text": " It was fun to get into another machine, leave your insignia on the screen, or leave your signature,"}, {"Time_Start": 1200.0, "Time_End": 1203.16, "Text": " to write graffiti, to outsmart someone."}, {"Time_Start": 1203.16, "Time_End": 1206.44, "Text": " You had to be unconventional in the way you thought."}, {"Time_Start": 1206.44, "Time_End": 1211.76, "Text": " Hackers, above all, must be unconventional, must think at the edges of possibilities and see"}, {"Time_Start": 1211.76, "Time_End": 1216.16, "Text": " things from the big picture perspective, differently from those socialized through"}, {"Time_Start": 1216.16, "Time_End": 1220.1000000000001, "Text": " consensus reality to think and move as the herd thinks and moves."}, {"Time_Start": 1220.66, "Time_End": 1226.52, "Text": " So these were the brightest people exploring a new cognitive space and having fun doing it."}, {"Time_Start": 1227.1000000000001, "Time_End": 1232.74, "Text": " So you leave graffiti, you cross boundaries, you hack, you find elegant solutions, you find"}, {"Time_Start": 1232.74, "Time_End": 1239.9, "Text": " clodgy solutions, but you're looking for ways to make things up, to create new spaces, to create"}, {"Time_Start": 1239.9, "Time_End": 1246.1000000000001, "Text": " new possibilities, and that's what they did. Fast forward 30 years to the 90s or this decade,"}, {"Time_Start": 1246.16, "Time_End": 1250.26, "Text": " 40 years later, and what you've got is a different cognitive space."}, {"Time_Start": 1250.78, "Time_End": 1252.3600000000001, "Text": " Let me use DefCon as an example."}, {"Time_Start": 1252.8600000000001, "Time_End": 1255.94, "Text": " Those guys first came out of the desert wouldn't tell you their names or handles."}, {"Time_Start": 1256.8200000000002, "Time_End": 1260.48, "Text": " When I quote Dark Tangent these days, he insists I call him Jeff Moss."}, {"Time_Start": 1261.14, "Time_End": 1267.0400000000002, "Text": " When I open secure business quarterly from at stake, I don't see Mudge, proudly wearing only his hacker handle."}, {"Time_Start": 1267.14, "Time_End": 1269.24, "Text": " I see Peter, Mudge, Zatko."}, {"Time_Start": 1269.74, "Time_End": 1276.14, "Text": " Now, crossing over into the meat space of the herd, I see not well pond, but Chris Zon,"}, {"Time_Start": 1276.16, "Time_End": 1282.38, "Text": " politic? I know Welpon better. You see people morphing and therefore their handles are"}, {"Time_Start": 1282.38, "Time_End": 1288.42, "Text": " morphing. What you see is the transformation of identity itself into a different cognitive space,"}, {"Time_Start": 1288.78, "Time_End": 1294.3600000000001, "Text": " because that cognitive space has come more and more into the background rather than being in"}, {"Time_Start": 1294.3600000000001, "Time_End": 1298.4, "Text": " the foreground of our eyes. So we give an example. When the telephone was invented, you know,"}, {"Time_Start": 1298.52, "Time_End": 1304.5, "Text": " Bell was asked, what are you going to do with it? And Bell said, maybe you could call ahead to the"}, {"Time_Start": 1304.5, "Time_End": 1305.96, "Text": " next city and tell them a telegram."}, {"Time_Start": 1306.16, "Time_End": 1311.92, "Text": " is on its way. Why? Because the content of every new technology is the old technology"}, {"Time_Start": 1311.92, "Time_End": 1318.0800000000002, "Text": " which pours itself into the framework of the new technology until the new technology, by interacting"}, {"Time_Start": 1318.0800000000002, "Time_End": 1323.76, "Text": " and training us in symbiotic relationship with it, teaches us how to use it. There was no such thing"}, {"Time_Start": 1323.76, "Time_End": 1328.16, "Text": " as a million cell phones going off every hour at a conference when Bell invented the phone,"}, {"Time_Start": 1328.16, "Time_End": 1333.52, "Text": " because no one thought the telephone, including its inventor, was a personal communication device."}, {"Time_Start": 1333.52, "Time_End": 1339.48, "Text": " So not long ago a person said to me, when we were finishing conversation, I want to finish this, but call me."}, {"Time_Start": 1339.72, "Time_End": 1346.42, "Text": " Don't send me an email. I want to talk to a real person. And I thought that was pretty funny because when the telephone was invented,"}, {"Time_Start": 1346.54, "Time_End": 1353.6, "Text": " no one thought that tinny, a natural, distant sound, that recreation of a signal in your ear was a quote-unquote real person."}, {"Time_Start": 1354.1, "Time_End": 1363.5, "Text": " What they thought it was was was what it was, a simulation or facsimile. But we have so internalized that voice as if it is, quote-unquote, a real person."}, {"Time_Start": 1363.52, "Time_End": 1368.26, "Text": " that we don't see the telephone as a medium and its reproductions as simulations anymore,"}, {"Time_Start": 1368.68, "Time_End": 1372.72, "Text": " and that is exactly what is happening with our interaction with computer networks."}, {"Time_Start": 1373.1399999999999, "Time_End": 1376.46, "Text": " Talking to Uncle Ira downstairs, who brings all this great stuff."}, {"Time_Start": 1376.54, "Time_End": 1381.72, "Text": " I said, how is it going? He said, not so well, people aren't buying my analog telephones the way they used to."}, {"Time_Start": 1383.04, "Time_End": 1388.42, "Text": " They also can't unload the routers, things that used to be prize items that Ira would get behind the scenes"}, {"Time_Start": 1388.42, "Time_End": 1393.36, "Text": " and dump into DefCon for our pleasure and play. He finds now you can go to Compuware"}, {"Time_Start": 1393.3600000000001, "Time_End": 1400.0400000000002, "Text": " or Comp USA and get them off the shelf for even cheaper than he offers them, even workstations,"}, {"Time_Start": 1400.14, "Time_End": 1405.96, "Text": " the greatest power of become appliances. Like the telephone, we are already absorbing the"}, {"Time_Start": 1405.96, "Time_End": 1411.66, "Text": " structures of the cognitive space of the computer network. Therefore, what those hackers did,"}, {"Time_Start": 1411.7800000000002, "Time_End": 1417.18, "Text": " what their behaviors were back in the days when the cognitive space was new, is no longer"}, {"Time_Start": 1417.18, "Time_End": 1423.3400000000001, "Text": " hacking today. And that's why if what you do and call it hacking is break into a place,"}, {"Time_Start": 1423.3600000000001, "Time_End": 1428.1200000000001, "Text": " or write graffiti or break a lamp outside that's so creative, isn't it, to get drunk"}, {"Time_Start": 1428.1200000000001, "Time_End": 1434.5400000000002, "Text": " and kick a lamp down? I mean, this is not hacking. This has nothing to do with hacking."}, {"Time_Start": 1434.5400000000002, "Time_End": 1442.46, "Text": " It is a behavior that used to be hacking when it fit the context or space which no longer exists."}, {"Time_Start": 1442.46, "Time_End": 1446.48, "Text": " So people today are being accepted more and more into the mainstream, filling those positions"}, {"Time_Start": 1446.48, "Time_End": 1451.2600000000002, "Text": " of power and authority. Last year at DefCon, I saw for the first time how clearly people"}, {"Time_Start": 1451.26, "Time_End": 1456.82, "Text": " people needed to be warned about accepting their acceptance. Because if you accept"}, {"Time_Start": 1456.82, "Time_End": 1461.94, "Text": " your acceptance into the herd in the mainstream too much, you will forget the truth that only the"}, {"Time_Start": 1461.94, "Time_End": 1467.5, "Text": " outcast knows. Why do people like Lou and I, old silverbacks, come again and again to the edges"}, {"Time_Start": 1467.5, "Time_End": 1473.54, "Text": " that you provide for us? Because we want to be where the outcast lives, because we know what"}, {"Time_Start": 1473.54, "Time_End": 1479.02, "Text": " Timothy Leary said, you don't get the truth from the company memo. The lowest person in any"}, {"Time_Start": 1479.02, "Time_End": 1481.24, "Text": " organizational structure is where I go and I do."}, {"Time_Start": 1481.26, "Time_End": 1485.16, "Text": " consulting to find out what's going on in the system. As you rise up the hierarchical"}, {"Time_Start": 1485.16, "Time_End": 1490.04, "Text": " structure, you get the truth turned into the company truth, you become assimilated. The pickle"}, {"Time_Start": 1490.04, "Time_End": 1493.92, "Text": " jumping into the brine becomes pickled, and pretty soon you're articulating a truth"}, {"Time_Start": 1493.92, "Time_End": 1498.2, "Text": " you don't even know is true because you forgot where you're not true because you forgot where"}, {"Time_Start": 1498.2, "Time_End": 1502.64, "Text": " you left the truth in the first place. It becomes a half-truth. You can't even distinguish from lies"}, {"Time_Start": 1502.64, "Time_End": 1508.12, "Text": " and truths and anything else. When you're assimilated, you no longer are an outcast and you come"}, {"Time_Start": 1508.12, "Time_End": 1511.24, "Text": " to defend the structures that give you sustenance, feed you."}, {"Time_Start": 1511.26, "Time_End": 1516.64, "Text": " give you a paycheck and you forget the truth that only the outcast knows. The truest line"}, {"Time_Start": 1516.64, "Time_End": 1523.14, "Text": " I ever said here popped out unscripted last year, nurture the duplicity and the larceny in your"}, {"Time_Start": 1523.14, "Time_End": 1531.18, "Text": " hearts. It's what we share. You must not surrender to accepting your acceptance too exclusively"}, {"Time_Start": 1531.18, "Time_End": 1537.0, "Text": " so that you become part of the assimilated structures which value you because you are on the edges"}, {"Time_Start": 1537.0, "Time_End": 1541.0, "Text": " and on the outside. Now, heck, thank you."}, {"Time_Start": 1541.26, "Time_End": 1544.06, "Text": " Thank you. How are we done on time?"}, {"Time_Start": 1545.66, "Time_End": 1547.7, "Text": " I know, but what is it? Thank you."}, {"Time_Start": 1549.18, "Time_End": 1550.7, "Text": " What do I mean by On the Edges?"}, {"Time_Start": 1551.54, "Time_End": 1556.86, "Text": " Truth moves from the edge to the center. The truth that used to be true of hacking, too."}, {"Time_Start": 1557.02, "Time_End": 1561.46, "Text": " The truth that used to be DefCon moving to the center. This is becoming mainstream."}, {"Time_Start": 1561.92, "Time_End": 1567.44, "Text": " This has been a very mellow, all-at-all, Def-Con convention. I expect next year it will be"}, {"Time_Start": 1567.44, "Time_End": 1571.24, "Text": " mellower still. Pretty soon it will be nothing, but 40, 50, and 60-year-old."}, {"Time_Start": 1571.26, "Time_End": 1575.76, "Text": " people coming only to reminisce about the good old days. People are here from DefCon"}, {"Time_Start": 1575.76, "Time_End": 1581.56, "Text": " 1 with their children, for God's sake, and they're concerned about the ambiance. How do you know"}, {"Time_Start": 1581.56, "Time_End": 1586.1, "Text": " that the context is shifted? Listen, you used to walk into DefCon and what did you get?"}, {"Time_Start": 1586.1, "Time_End": 1592.22, "Text": " You got surly uncivil goons who didn't know what they were doing, not knowing how to register people"}, {"Time_Start": 1592.22, "Time_End": 1597.2, "Text": " and with, therefore, long lines going out into the desert heat, all the way down to the Luxur and down"}, {"Time_Start": 1597.2, "Time_End": 1601.24, "Text": " the strip and around the desert, all the way to Lake Mead, because it was so slow and"}, {"Time_Start": 1601.26, "Time_End": 1605.92, "Text": " ungainly, and you knew by the way you were treated with profound disrespect that you were at"}, {"Time_Start": 1605.92, "Time_End": 1614.4, "Text": " DefCon. You were home. What did you get this time? Twelve grannies hired professionally. Their"}, {"Time_Start": 1614.4, "Time_End": 1620.42, "Text": " walkers and canes lined up in the corners. No lines, because they knew what they were doing."}, {"Time_Start": 1620.82, "Time_End": 1626.6, "Text": " And you walk in expecting a surly goon and what you get is a gray-haired happy granny. It changes"}, {"Time_Start": 1626.6, "Time_End": 1631.24, "Text": " the space. We have been tamed. We have been civilized. We have been civilized. We have"}, {"Time_Start": 1631.26, "Time_End": 1643.66, "Text": " been mainstreamed. Oh, whoa, a woe is us. All right. So, how do you go? How do you go again and again"}, {"Time_Start": 1643.66, "Time_End": 1647.5, "Text": " to the edges to find the truth that is on the edge? You know, my favorite quote on that is"}, {"Time_Start": 1647.5, "Time_End": 1653.36, "Text": " Robert Galvin, great patriarch of Motorola, built that place out of almost nothing. And he was asked"}, {"Time_Start": 1653.36, "Time_End": 1658.36, "Text": " after 30, 40 years at its helm, what were the breakthrough ideas that made the critical difference"}, {"Time_Start": 1658.36, "Time_End": 1661.24, "Text": " as you built Motorola? And he thought about it long and"}, {"Time_Start": 1661.26, "Time_End": 1665.36, "Text": " seriously and he said, do you know every single breakthrough idea that made a critical difference"}, {"Time_Start": 1665.36, "Time_End": 1670.7, "Text": " in our company when we thought of this kind of chip or that kind of protocol, it began its life"}, {"Time_Start": 1670.7, "Time_End": 1676.8, "Text": " as a minority opinion. It was said way out there on the edge. No one heard it. If someone said"}, {"Time_Start": 1676.8, "Time_End": 1682.22, "Text": " it, it wasn't heard. If they said it again and people noticed, they laughed at it because it literally"}, {"Time_Start": 1682.22, "Time_End": 1686.94, "Text": " didn't fit the consensus reality to a degree that made it taken seriously. And if they said it again"}, {"Time_Start": 1686.94, "Time_End": 1691.24, "Text": " and again, you not only laughed at it, you laughed with ridicule on an edge because they were not"}, {"Time_Start": 1691.26, "Time_End": 1695.64, "Text": " just funny now, they were dumb and they didn't shut up. And if they said it again, you hired"}, {"Time_Start": 1695.64, "Time_End": 1699.6, "Text": " a camera crew to come in and do a 60-minute style expose of their character and personal"}, {"Time_Start": 1699.6, "Time_End": 1704.72, "Text": " life in order to totally devalue their professional reputation. And then finally, it arrived"}, {"Time_Start": 1704.72, "Time_End": 1709.98, "Text": " at the center. And you know it's at the center when everybody says, we agree with it and we have"}, {"Time_Start": 1709.98, "Time_End": 1717.74, "Text": " always agreed with it all along. Once everybody knows that truth, it is no longer the"}, {"Time_Start": 1717.74, "Time_End": 1721.24, "Text": " truth of the cutting edge. I mean, when I was in the"}, {"Time_Start": 1721.26, "Time_End": 1727.76, "Text": " 60s, we remember when the first statement, women should make equal pay to men for the"}, {"Time_Start": 1727.76, "Time_End": 1734.12, "Text": " same work. When Gloria Steinem first said things like that, people thought it was a joke. They"}, {"Time_Start": 1734.12, "Time_End": 1737.5, "Text": " didn't even hear it. When she said it again, they laughed, but then they began to ridicule her."}, {"Time_Start": 1737.5, "Time_End": 1743.44, "Text": " You go back to 60s, look at the vicious attacks on Gloria Steinem for saying that. Now, just"}, {"Time_Start": 1743.44, "Time_End": 1747.7, "Text": " about everybody in this space says, of course, equal pay for equal work, for men and women."}, {"Time_Start": 1747.7, "Time_End": 1751.24, "Text": " Everybody knows that. By the time everybody knows that it's no longer"}, {"Time_Start": 1751.26, "Time_End": 1755.82, "Text": " the truth on the edge that sets you free. I think this is what George Bernard Shaw meant"}, {"Time_Start": 1755.82, "Time_End": 1763.68, "Text": " when he said, all great truth begins as blasphemy. The reason I could be a priest was because"}, {"Time_Start": 1763.68, "Time_End": 1769.96, "Text": " the Jesus I knew in that context was a down and dirty street fighting, take no prisoners or"}, {"Time_Start": 1769.96, "Time_End": 1776.12, "Text": " compromises Jew, who got whacked for telling the truth. He was a hacker of the best sort. The"}, {"Time_Start": 1776.12, "Time_End": 1781.24, "Text": " problem of doing that kind of Jesus in the church is that the church has so abandoned that."}, {"Time_Start": 1781.26, "Time_End": 1787.04, "Text": " image and so left and forsaken the edges on which it had potency and power that it is now"}, {"Time_Start": 1787.04, "Time_End": 1793.14, "Text": " what you know very well. It has become the custodian of the images and the dead truths of"}, {"Time_Start": 1793.14, "Time_End": 1800.36, "Text": " the past. We are on the verge of a transplanetary transformation, sound 60s in Aquarius, but my God,"}, {"Time_Start": 1800.44, "Time_End": 1807.32, "Text": " we're not only going into space, we are in space. And we are building a new play space for real"}, {"Time_Start": 1807.32, "Time_End": 1811.24, "Text": " hackers. And I want to say that it is not just about computer."}, {"Time_Start": 1811.26, "Time_End": 1817.82, "Text": " anymore or networks anymore because they're ubiquitous, habitual, and ordinary."}, {"Time_Start": 1817.82, "Time_End": 1823.68, "Text": " And therefore, to replicate the habits and actions of hackers in the 60s in the new play space"}, {"Time_Start": 1823.68, "Time_End": 1831.16, "Text": " is missing the entire point. The new context requires new content congruent with it. So what"}, {"Time_Start": 1831.16, "Time_End": 1836.46, "Text": " is hacking going to look like? Well, what are information systems really about? Information"}, {"Time_Start": 1836.46, "Time_End": 1841.24, "Text": " and energy are the universe. In other words, all organizational structures are the universe."}, {"Time_Start": 1841.26, "Time_End": 1847.42, "Text": " are made up of information and energy. And the boundaries we arbitrarily draw"}, {"Time_Start": 1847.42, "Time_End": 1853.02, "Text": " determine the identities of individuals or organizations. That's why you hear more and more about"}, {"Time_Start": 1853.02, "Time_End": 1859.5, "Text": " transnationals. The emergence of a new sector of organizational structure appropriate to the flow"}, {"Time_Start": 1859.5, "Time_End": 1865.02, "Text": " of information and energy in the larger scale system that literally did not exist."}, {"Time_Start": 1865.02, "Time_End": 1870.86, "Text": " Before we used to talk about nation states, which evolved in the 18th, 19th, 17th centuries,"}, {"Time_Start": 1871.26, "Time_End": 1877.22, "Text": " As boundaries around appropriately large structures that fit the political, social,"}, {"Time_Start": 1877.22, "Time_End": 1882.04, "Text": " and economic flow of abstraction and information and energy of the day, those boundaries"}, {"Time_Start": 1882.04, "Time_End": 1887.3, "Text": " are dissolving. Your technologies are breaking them down. New transnationals are emerging."}, {"Time_Start": 1887.3, "Time_End": 1892.14, "Text": " And when you talk to someone like Vince Cerf, you hear him suggest strongly as he plans"}, {"Time_Start": 1892.14, "Time_End": 1897.04, "Text": " not geosynchronous satellites, but solar synchronous satellites. As we build the net throughout"}, {"Time_Start": 1897.04, "Time_End": 1899.42, "Text": " the solar system, we need new categories."}, {"Time_Start": 1899.42, "Time_End": 1902.8200000000002, "Text": " dot, earth, moon, dot, mars, dot, saturn, dotting."}, {"Time_Start": 1903.24, "Time_End": 1908.1000000000001, "Text": " Because once we conquer the problem of latency, we are going to build a net through the planetary"}, {"Time_Start": 1908.1000000000001, "Time_End": 1913.16, "Text": " system that is now like our front porch down which we are coming, like toddlers, walking for the first"}, {"Time_Start": 1913.16, "Time_End": 1919.3000000000002, "Text": " time. We haven't even begun to go around the block. The new place space is space. It's not"}, {"Time_Start": 1919.3000000000002, "Time_End": 1924.22, "Text": " here anymore. It's there. 200 years ago, if you asked the man in London, where the center of the world"}, {"Time_Start": 1924.22, "Time_End": 1929.1200000000001, "Text": " was, he would say right here, London, the city of London, the Bank of England, right here."}, {"Time_Start": 1929.42, "Time_End": 1934.3000000000002, "Text": " said, where is the edge? He would say the colonies, Australia, Canada, America. Only"}, {"Time_Start": 1934.3000000000002, "Time_End": 1938.66, "Text": " a couple of hundred years later would we say, where is the center? We say right here, the"}, {"Time_Start": 1938.66, "Time_End": 1944.22, "Text": " Earth is the center. By the time everybody believes it, by the time that picture of Earth rise"}, {"Time_Start": 1944.22, "Time_End": 1951.22, "Text": " over the moonscape first showed us ourselves, whole, it was already over. The center is out there."}, {"Time_Start": 1951.22, "Time_End": 1957.46, "Text": " The center is a point of reference in space from which we can see whole the entire system. That's"}, {"Time_Start": 1957.46, "Time_End": 1958.5800000000002, "Text": " what hackers do."}, {"Time_Start": 1958.58, "Time_End": 1964.3, "Text": " So you have to build the play space, the functional play space, bigger and bigger and bigger."}, {"Time_Start": 1964.84, "Time_End": 1969.1799999999998, "Text": " I mentioned the, well, let me do this one, because it's cute."}, {"Time_Start": 1970.6999999999998, "Time_End": 1974.58, "Text": " When I'm talking to businesses about where they can go to learn from the edges, what newly"}, {"Time_Start": 1974.58, "Time_End": 1979.72, "Text": " emergent realities need to be given names in order to build the future. I tell them there are three"}, {"Time_Start": 1979.72, "Time_End": 1985.48, "Text": " places to go. One is military technology. Because if you can find out what people are doing in that"}, {"Time_Start": 1985.48, "Time_End": 1988.56, "Text": " space, you are going to see what the world is going to be in the next,"}, {"Time_Start": 1988.5800000000002, "Time_End": 1993.3400000000001, "Text": " 10 or 20 years. There's an article I have which I could read if I could find it about the"}, {"Time_Start": 1993.3400000000001, "Time_End": 2000.6200000000001, "Text": " evolution of plasma skins for our spacecraft in order to prevent meteorites flex or projectiles"}, {"Time_Start": 2000.6200000000001, "Time_End": 2005.5400000000002, "Text": " from interfering with them, a force field, the kind that people have reported encountering around UFOs,"}, {"Time_Start": 2005.5400000000002, "Time_End": 2010.4, "Text": " but of course I don't want to go into UFOs because everybody knows that's crazy. The truth on the edge"}, {"Time_Start": 2010.4, "Time_End": 2015.2, "Text": " about which everybody speaks is crazy. It creates cognitive dissonance, so I'm not going to talk"}, {"Time_Start": 2015.2, "Time_End": 2018.5600000000002, "Text": " about crazy stuff. I'm just going to talk about the plasma field."}, {"Time_Start": 2018.5800000000002, "Time_End": 2024.7600000000002, "Text": " we are building around our interplanetary craft trying to build cold plasmas that"}, {"Time_Start": 2024.7600000000002, "Time_End": 2029.2600000000002, "Text": " will reject anything that tries to encounter them. Now that's crazy, but a friend of mine,"}, {"Time_Start": 2029.3400000000001, "Time_End": 2035.38, "Text": " a hacker stood in the desert outside Nellis in 1993 with night vision scopes and a video camera"}, {"Time_Start": 2035.38, "Time_End": 2040.44, "Text": " trying to hack the black operations that he was trying to see so he could bring them to his magazine,"}, {"Time_Start": 2040.5600000000002, "Time_End": 2045.5000000000002, "Text": " a leading aviation magazine, which they would never, ever print. No pictures, no stories"}, {"Time_Start": 2045.5000000000002, "Time_End": 2048.56, "Text": " that he ever found. He said in 93, he photographed what he called."}, {"Time_Start": 2048.58, "Time_End": 2052.7999999999997, "Text": " the dripper. It looks like a luminous arrow, zooming in over Nellis and far out toward"}, {"Time_Start": 2052.7999999999997, "Time_End": 2058.7599999999998, "Text": " Area 51, and it's home beyond. He took the picture to four physicists at JPL. They said,"}, {"Time_Start": 2058.8199999999997, "Time_End": 2064.88, "Text": " yep, it's a bifurcated plasma. That was 93. In 2001, I find an article that says that technology"}, {"Time_Start": 2064.88, "Time_End": 2071.46, "Text": " is now on the drawing boards. Okay? My kid played a game, and I said, when's it coming out?"}, {"Time_Start": 2071.54, "Time_End": 2076.92, "Text": " He said, six months from now, but I have it now. The hacker outside Nellis with his night vision scope"}, {"Time_Start": 2076.92, "Time_End": 2082.32, "Text": " in 93, photograph something which an article six, seven years later tells us is now on the"}, {"Time_Start": 2082.32, "Time_End": 2088.16, "Text": " drawing boards long after it has been observed in operation. I just want to say that a real"}, {"Time_Start": 2088.16, "Time_End": 2093.64, "Text": " hacker who's someone who doesn't believe the consensus, reality of the herd, the perception"}, {"Time_Start": 2093.64, "Time_End": 2100.16, "Text": " management of the tribe designed to ameliorate and placate the social space and keep it moving, functional"}, {"Time_Start": 2100.16, "Time_End": 2106.2200000000003, "Text": " and happy. A hacker is someone who refuses to accept that as truth and stands outside Nellis in"}, {"Time_Start": 2106.2200000000003, "Time_End": 2111.28, "Text": " the night in the dark with a night vision scope for hours and hours and hours in order"}, {"Time_Start": 2111.28, "Time_End": 2117.0800000000004, "Text": " to find out the truth and cobble it together with what he or she already knows so they can"}, {"Time_Start": 2117.0800000000004, "Time_End": 2123.7200000000003, "Text": " see what is truly going on. That's where hacking must move into the play space on the edges."}, {"Time_Start": 2123.7200000000003, "Time_End": 2130.92, "Text": " The wetware, dryware interface, organic life and artificial life or unnatural substances and"}, {"Time_Start": 2130.92, "Time_End": 2135.94, "Text": " natural substances is already morphing and dissolving. We don't know how to talk about real"}, {"Time_Start": 2135.94, "Time_End": 2140.78, "Text": " and artificial anymore because as we take the reins of genetic engineering in our own hands,"}, {"Time_Start": 2140.78, "Time_End": 2146.7200000000003, "Text": " we are going to create it. The Olympic athletes of the last Olympics were tested for EPO and human"}, {"Time_Start": 2146.7200000000003, "Time_End": 2153.1, "Text": " growth hormone so that we could see if they had ingested externally to themselves some substance"}, {"Time_Start": 2153.1, "Time_End": 2157.98, "Text": " which would jack up their ability to perform. They are hoping by the next Olympic Games, where is it"}, {"Time_Start": 2157.98, "Time_End": 2163.44, "Text": " Greece, a terrorist playground, if ever there was one. By the next Olympic Games, they hope to be able"}, {"Time_Start": 2163.44, "Time_End": 2165.92, "Text": " to engineer EPO and growth hormone so it's a crucial."}, {"Time_Start": 2165.94, "Time_End": 2171.26, "Text": " naturally from the inside. If they can do that, what is the distinction between natural"}, {"Time_Start": 2171.26, "Time_End": 2177.06, "Text": " and unnatural, real and artificial? There is none. You asked Ted Turner, how many manic depresses"}, {"Time_Start": 2177.06, "Time_End": 2183.38, "Text": " do we want? There are about 4% of the population manic depressive. Now, as evolution factors things"}, {"Time_Start": 2183.38, "Time_End": 2189.48, "Text": " in, that's a big proportion that evolution has kept in the biosphere because it thinks manic depression"}, {"Time_Start": 2189.48, "Time_End": 2195.3, "Text": " is valuable. Ted Turner said he always made his best deals in his manic phase, and he was willing"}, {"Time_Start": 2195.3, "Time_End": 2202.3, "Text": " to risk suicide and depression to not take his lithium so he could get those incredible highs."}, {"Time_Start": 2202.3, "Time_End": 2206.92, "Text": " Now, I don't want to say a hacker has to be manic-depressive. I just want to say that you know the low lows"}, {"Time_Start": 2206.92, "Time_End": 2211.5800000000004, "Text": " and you know the high highs of the power rush, photographing the drippers that zooms in like a"}, {"Time_Start": 2211.5800000000004, "Time_End": 2216.9, "Text": " luminous arrow, leading pieces of bifurcated plazs in the night sky behind it, you know the power"}, {"Time_Start": 2216.9, "Time_End": 2222.54, "Text": " rush when you get into a system and see, contrary to what people tell you, is the accepted"}, {"Time_Start": 2222.54, "Time_End": 2225.1200000000003, "Text": " consensus reality, what is really true."}, {"Time_Start": 2225.3, "Time_End": 2227.0, "Text": " How many manic depresses do we want?"}, {"Time_Start": 2227.28, "Time_End": 2232.78, "Text": " Well, we're marketing Prozac, Zolaf, Paxil, and all the other anti-anxiety and antidepression"}, {"Time_Start": 2232.78, "Time_End": 2235.0600000000004, "Text": " drugs as if we can take them from the outside."}, {"Time_Start": 2235.48, "Time_End": 2239.6000000000004, "Text": " Do you see that when we can engineer them from the inside, human beings are going to control"}, {"Time_Start": 2239.6000000000004, "Time_End": 2246.54, "Text": " their cognitive and emotional space from the inside and recreate their identity the way hackers"}, {"Time_Start": 2246.54, "Time_End": 2250.36, "Text": " are practicing recreating identity in virtual worlds right now?"}, {"Time_Start": 2251.0600000000004, "Time_End": 2253.8, "Text": " So what do you expect the hackers of the future to have?"}, {"Time_Start": 2253.86, "Time_End": 2255.28, "Text": " The near-term future, we hope."}, {"Time_Start": 2255.3, "Time_End": 2261.98, "Text": " So just as Wozni and Jobs built that apple in a garage and attributed to the revolution"}, {"Time_Start": 2261.98, "Time_End": 2268.1800000000003, "Text": " of the world somewhere in some offshore genetic data haven, somebody now is putting together"}, {"Time_Start": 2268.1800000000003, "Time_End": 2272.98, "Text": " the tools that will enable you to go into the basement the way I had a chemistry set and a wireless"}, {"Time_Start": 2272.98, "Time_End": 2277.48, "Text": " radio and ham radio when I was a kid, and you're going to be able to hack the genome."}, {"Time_Start": 2277.98, "Time_End": 2279.6000000000004, "Text": " You were going to be able to make little organisms."}, {"Time_Start": 2280.1200000000003, "Time_End": 2282.1400000000003, "Text": " You're going to be able to enhance your own cognition."}, {"Time_Start": 2282.6400000000003, "Time_End": 2285.28, "Text": " You were going to be able to play, and I hope you do it right."}, {"Time_Start": 2285.3, "Time_End": 2288.94, "Text": " with your cognitive space in order to make yourselves more intelligent."}, {"Time_Start": 2289.2200000000003, "Time_End": 2293.98, "Text": " You may even develop what is already on the drawing boards a 200 to 1 retinal implant zoom."}, {"Time_Start": 2294.44, "Time_End": 2301.26, "Text": " So instead of carrying those digital cameras which are heavy, you can just go click, click, click, click, click, click, click at Lou and go in or out."}, {"Time_Start": 2301.48, "Time_End": 2303.46, "Text": " You can have an infrared heads-up display."}, {"Time_Start": 2303.9, "Time_End": 2310.48, "Text": " It will fundamentally transform and alter the identity of a human being, collectively and individually."}, {"Time_Start": 2311.4, "Time_End": 2313.02, "Text": " That's what hackers are you going to play with."}, {"Time_Start": 2313.02, "Time_End": 2320.46, "Text": " At the wetware, dryware interface, hackers are going to recreate what it means to think, feel, and be human."}, {"Time_Start": 2321.1, "Time_End": 2324.24, "Text": " Those humans must be re-engineered in order to go to Mars."}, {"Time_Start": 2324.56, "Time_End": 2329.08, "Text": " They must be re-engineered in order to go to Titan, in order to go to Europa,"}, {"Time_Start": 2329.22, "Time_End": 2333.92, "Text": " to see if there's lives in the seething, slushy seas that we know must be worn by volcanic vents"}, {"Time_Start": 2333.92, "Time_End": 2335.58, "Text": " and therefore have life in them."}, {"Time_Start": 2335.58, "Time_End": 2342.44, "Text": " And they must be able to encounter the races and species that you know are there that are going to encounter."}, {"Time_Start": 2343.02, "Time_End": 2348.9, "Text": " us in a way that no longer enables us to avoid or not recognize their presence, the way a friend"}, {"Time_Start": 2348.9, "Time_End": 2353.48, "Text": " at NSA said, ants just don't get that dogs exist."}, {"Time_Start": 2354.64, "Time_End": 2356.68, "Text": " We were having this interesting conversation."}, {"Time_Start": 2357.14, "Time_End": 2358.6, "Text": " I want to go out to the edge a little bit."}, {"Time_Start": 2359.06, "Time_End": 2364.7599999999998, "Text": " I just talked to one of the CIA's best remote viewers, and we were talking about targeting"}, {"Time_Start": 2364.7599999999998, "Time_End": 2367.16, "Text": " the dark side of the moon for remote viewing."}, {"Time_Start": 2367.32, "Time_End": 2373.0, "Text": " Now, remote viewing is using structured, fixed protocols for clairvoyant access to information."}, {"Time_Start": 2373.02, "Time_End": 2375.18, "Text": " in non-local space time."}, {"Time_Start": 2375.68, "Time_End": 2379.22, "Text": " It was done for decades, and some of the guys had terrific hits."}, {"Time_Start": 2379.66, "Time_End": 2382.62, "Text": " The guy I was talking to in a long interview had some of the best."}, {"Time_Start": 2383.42, "Time_End": 2388.56, "Text": " He told me they had targeted, at NSA, which theoretically did not have such a protocol or plan,"}, {"Time_Start": 2389.0, "Time_End": 2390.0, "Text": " the dark side of the moon."}, {"Time_Start": 2390.16, "Time_End": 2394.1, "Text": " I asked my friend at NSA, now, at NSA, don't make it all one thing."}, {"Time_Start": 2394.88, "Time_End": 2397.24, "Text": " I mean, yes, he taught cover and deception at NSA."}, {"Time_Start": 2397.74, "Time_End": 2402.64, "Text": " Yes, he told me that the way it works is illusion, misdirection, and ridicule."}, {"Time_Start": 2403.02, "Time_End": 2406.4, "Text": " And then he paused and said, yes, and the greatest of these is ridicule."}, {"Time_Start": 2406.62, "Time_End": 2409.12, "Text": " You can put something in plain sight right on the table,"}, {"Time_Start": 2409.42, "Time_End": 2412.78, "Text": " and by making it impossible for any of you with a clear mind or heart,"}, {"Time_Start": 2413.02, "Time_End": 2416.18, "Text": " to keep saying you see it pretty soon we will all agree through ridicule,"}, {"Time_Start": 2416.36, "Time_End": 2418.32, "Text": " and ridicule alone that it does not exist,"}, {"Time_Start": 2418.62, "Time_End": 2421.66, "Text": " and we will walk around it as if functionally it does not exist."}, {"Time_Start": 2422.08, "Time_End": 2425.8, "Text": " I asked him if there was any other reason why you would target the dark side of the moon"}, {"Time_Start": 2425.8, "Time_End": 2430.44, "Text": " for remote viewing, if not to locate the presence of an alien species."}, {"Time_Start": 2430.84, "Time_End": 2433.0, "Text": " He said, of course, because when we first went to the moon,"}, {"Time_Start": 2433.02, "Time_End": 2434.62, "Text": " We wanted to build missile bases there."}, {"Time_Start": 2434.88, "Time_End": 2437.78, "Text": " It was the high ground, which everybody saw, would give us a leg up."}, {"Time_Start": 2438.12, "Time_End": 2440.48, "Text": " So we were looking at the dark side of the moon, perhaps,"}, {"Time_Start": 2440.94, "Time_End": 2444.18, "Text": " to see if there was a presence of some other being, an earth being,"}, {"Time_Start": 2444.3, "Time_End": 2446.82, "Text": " on the dark side of the moon, establishing a military thing."}, {"Time_Start": 2447.62, "Time_End": 2450.9, "Text": " He said, of course, when you go into space, you want it to be stealthy,"}, {"Time_Start": 2451.18, "Time_End": 2455.34, "Text": " you want it to be invisible, and you want it to be as far out as humanly possible."}, {"Time_Start": 2455.7, "Time_End": 2458.34, "Text": " He echoed, in fact, this wonderful, wonderful quote,"}, {"Time_Start": 2458.42, "Time_End": 2459.8, "Text": " which I hope I can find quickly,"}, {"Time_Start": 2459.8, "Time_End": 2463.1800000000003, "Text": " the manipulation of human perception itself."}, {"Time_Start": 2463.3, "Time_End": 2469.9, "Text": " This is someone talking about space war and why information and space technology are fusing in this new cognitive space."}, {"Time_Start": 2470.44, "Time_End": 2476.2200000000003, "Text": " It is not only preparation for warfare, the manipulation of human perception, listen to this, hackers,"}, {"Time_Start": 2477.02, "Time_End": 2479.5800000000004, "Text": " is the aim of warfare itself."}, {"Time_Start": 2480.3, "Time_End": 2482.7000000000003, "Text": " Not only concepts, but percepts."}, {"Time_Start": 2483.26, "Time_End": 2485.48, "Text": " Cyber war is cyborg war."}, {"Time_Start": 2486.1600000000003, "Time_End": 2489.5, "Text": " Psychological operations, information attack, deception."}, {"Time_Start": 2489.8, "Time_End": 2493.52, "Text": " biomedical attack, and multi-spectral warfare."}, {"Time_Start": 2494.1600000000003, "Time_End": 2499.0800000000004, "Text": " In short, all of the means of dissimulation and deception available to an attacker"}, {"Time_Start": 2499.0800000000004, "Time_End": 2505.2200000000003, "Text": " prior to military operations determine the form of the battle, the shape of the battlefield,"}, {"Time_Start": 2505.52, "Time_End": 2506.9, "Text": " and the outcome of the battle."}, {"Time_Start": 2507.26, "Time_End": 2510.0800000000004, "Text": " The only real enemy is the mind of the opponent."}, {"Time_Start": 2510.5600000000004, "Time_End": 2514.3, "Text": " As Sun Su said, all warfare is based on deception."}, {"Time_Start": 2515.0800000000004, "Time_End": 2517.1000000000004, "Text": " All warfare is based on deception,"}, {"Time_Start": 2517.5, "Time_End": 2519.1000000000004, "Text": " and the management of perception is the management of perception is the command of perception"}, {"Time_Start": 2519.1, "Time_End": 2523.02, "Text": " is the cardinal critical key piece."}, {"Time_Start": 2523.18, "Time_End": 2527.1, "Text": " So that when the enemy gets to the battlefield, the battle is already over."}, {"Time_Start": 2527.54, "Time_End": 2532.42, "Text": " In the global battle space, the goal is to win the war without the enemy,"}, {"Time_Start": 2532.58, "Time_End": 2535.4, "Text": " even knowing he or she has been at war."}, {"Time_Start": 2535.7599999999998, "Time_End": 2539.86, "Text": " They just thought they were walking to the bank and turned left at the corner"}, {"Time_Start": 2539.86, "Time_End": 2542.1, "Text": " because it seemed like a good idea."}, {"Time_Start": 2542.7799999999997, "Time_End": 2548.08, "Text": " Okay, so when you're talking about in space using multispectral radiation,"}, {"Time_Start": 2548.08, "Time_End": 2554.7, "Text": " stealthy technologies, camouflage, the creation of artificial environments to simulate"}, {"Time_Start": 2554.7, "Time_End": 2556.74, "Text": " real activity and environments."}, {"Time_Start": 2557.18, "Time_End": 2562.08, "Text": " You're talking about weaving through the whole information battle space, a web of deception,"}, {"Time_Start": 2562.46, "Time_End": 2564.8199999999997, "Text": " which looks like one thing but is really another."}, {"Time_Start": 2565.18, "Time_End": 2566.48, "Text": " So how can you ever tell?"}, {"Time_Start": 2566.58, "Time_End": 2571.46, "Text": " You need a point of reference outside the system from which to see the system itself"}, {"Time_Start": 2571.46, "Time_End": 2574.18, "Text": " in order to see what is true and what is not true."}, {"Time_Start": 2574.52, "Time_End": 2578.06, "Text": " My friend said, we're putting our stealthy weapons platforms as far out."}, {"Time_Start": 2578.08, "Time_End": 2582.86, "Text": " and as stealthily into space disguised as debris and junk as we can."}, {"Time_Start": 2583.42, "Time_End": 2586.06, "Text": " But he said, think one or two steps further."}, {"Time_Start": 2586.56, "Time_End": 2589.42, "Text": " Ten years ago, he said, if you talked about black holes,"}, {"Time_Start": 2590.16, "Time_End": 2592.38, "Text": " you would have thought you were dealing with a speculative event."}, {"Time_Start": 2593.08, "Time_End": 2595.18, "Text": " Now the Hubble has mapped black holes."}, {"Time_Start": 2595.56, "Time_End": 2599.24, "Text": " And our radio telescopes, it's not just for plain old research, he said,"}, {"Time_Start": 2599.24, "Time_End": 2605.16, "Text": " are trying to map the universe so that we can see through the singularities in event horizons"}, {"Time_Start": 2605.16, "Time_End": 2608.06, "Text": " the presence of planets, which like our own,"}, {"Time_Start": 2608.08, "Time_End": 2614.18, "Text": " harbor intelligent life. You know why, of course, he said. Because he said, we know that they are here."}, {"Time_Start": 2614.58, "Time_End": 2622.3199999999997, "Text": " He paused for effect, as one will, and repeated, they're here. We want to go there. And so we are"}, {"Time_Start": 2622.3199999999997, "Time_End": 2627.54, "Text": " looking at the development of quantum communications so we can park weapons platforms through"}, {"Time_Start": 2627.54, "Time_End": 2632.8199999999997, "Text": " singularities in other galaxies and recall them instantaneously through quantum communications. You"}, {"Time_Start": 2632.8199999999997, "Time_End": 2637.74, "Text": " know how it works. Entanglement, atom to atom, binary, on, off, which cannot be jammed or"}, {"Time_Start": 2637.7400000000002, "Time_End": 2642.2200000000003, "Text": " intercepted, which immediately spontaneously recalls the information, therefore the platform"}, {"Time_Start": 2642.2200000000003, "Time_End": 2648.0000000000005, "Text": " that we want to activate. All right. Now, that sounds pretty crazy, right? That sounds pretty crazy."}, {"Time_Start": 2648.32, "Time_End": 2655.8, "Text": " I think it's already on the drawing boards because it's already been seen. All right. Questions?"}, {"Time_Start": 2667.7400000000002, "Time_End": 2674.2200000000003, "Text": " The question was, what were the three things the NS guy said were the hallmarks"}, {"Time_Start": 2674.2200000000003, "Time_End": 2681.42, "Text": " of operations of deception and cover? Illusion, misdirection, and ridicule."}, {"Time_Start": 2681.42, "Time_End": 2686.1000000000004, "Text": " Illusion is the creating of simulated environments or objects which people believe are real."}, {"Time_Start": 2686.1000000000004, "Time_End": 2690.0000000000005, "Text": " In the management of perception space, Bernays, it means creating all kinds of different"}, {"Time_Start": 2690.0000000000005, "Time_End": 2694.86, "Text": " bookshelves onto which we all unconsciously put books without even noticing it."}, {"Time_Start": 2694.86, "Time_End": 2697.7200000000003, "Text": " I'll give you a quick example. It is from the UFO world, but it's just too great"}, {"Time_Start": 2697.7400000000002, "Time_End": 2701.46, "Text": " greatest story not to tell. A friend of mine wrote a book called The Missing Times,"}, {"Time_Start": 2701.46, "Time_End": 2707.2200000000003, "Text": " media complicity in the UFO coverup. He was called in 1975 by a friend in Montana who said,"}, {"Time_Start": 2707.28, "Time_End": 2712.48, "Text": " can you believe what's happening at the Minuteman missile silos out here? He said, what's happening?"}, {"Time_Start": 2712.5600000000004, "Time_End": 2716.76, "Text": " He said, aren't you getting it? It's in all the papers here locally. It's on everybody's lips"}, {"Time_Start": 2716.76, "Time_End": 2720.8, "Text": " because there have been dozens or hundreds of witnesses to these things, and they're hovering about"}, {"Time_Start": 2720.8, "Time_End": 2724.6800000000003, "Text": " and their things they're doing at the Minuteman missile silos. There was no mention of it in the"}, {"Time_Start": 2724.6800000000003, "Time_End": 2727.7200000000003, "Text": " national press. He used that seminal event as an example."}, {"Time_Start": 2727.7400000000002, "Time_End": 2734.88, "Text": " example of how complicity enables those who would masters of deception to create management"}, {"Time_Start": 2734.88, "Time_End": 2739.84, "Text": " of perception in the battle space, i.e. society so that it doesn't reach the official reality"}, {"Time_Start": 2739.84, "Time_End": 2745.0200000000004, "Text": " validated and accepted by the media that we come to believe is real. But things leak out. There"}, {"Time_Start": 2745.0200000000004, "Time_End": 2751.0200000000004, "Text": " is a black market in truth. This is where hackers live and operate. Sharing bits of information"}, {"Time_Start": 2751.0200000000004, "Time_End": 2756.26, "Text": " that enable us to cobble together a bigger picture, a model of alternative reality, which avoiding the"}, {"Time_Start": 2756.26, "Time_End": 2760.5800000000004, "Text": " tendency to be paranoid, nevertheless seems to be good enough for now, that map"}, {"Time_Start": 2760.5800000000004, "Time_End": 2766.0200000000004, "Text": " that Minsky mentioned. So it finally surfaced a few years later. Information leaked out and it"}, {"Time_Start": 2766.0200000000004, "Time_End": 2771.6600000000003, "Text": " couldn't be completely covered up. So what do you do? Illusion, misdirection, ridicule. Where did it"}, {"Time_Start": 2771.6600000000003, "Time_End": 2776.36, "Text": " show up? It showed up in the National Inquirer. Now, when something shows up in the National"}, {"Time_Start": 2776.36, "Time_End": 2781.2200000000003, "Text": " Inquirer in the late 1970s has a story, it is functionally dead. It no longer exists. No"}, {"Time_Start": 2781.2200000000003, "Time_End": 2785.6800000000003, "Text": " reporter, no researcher, no professor will ever cite that reference as a source."}, {"Time_Start": 2786.26, "Time_End": 2790.6800000000003, "Text": " Now, my friend went further and discovered that the people who created the National Enquirer,"}, {"Time_Start": 2790.88, "Time_End": 2796.6000000000004, "Text": " even listed the CIA on their resume. In 1951, they were part of the original group that put together"}, {"Time_Start": 2796.6000000000004, "Time_End": 2800.6800000000003, "Text": " the intelligence agency. He looked at where the funding for the National Inquirer came from,"}, {"Time_Start": 2800.7400000000002, "Time_End": 2802.92, "Text": " and all you could determine was that it was very, very murky."}, {"Time_Start": 2805.3, "Time_End": 2810.26, "Text": " Misdirection, illusion, ridicule. Bookshelves, books. You're standing in the line,"}, {"Time_Start": 2810.4, "Time_End": 2815.2200000000003, "Text": " grocery store, you have one. When I do a UFO talk, I hold it up. It says, space aliens, drain my blood."}, {"Time_Start": 2816.26, "Time_End": 2823.96, "Text": " and I compared that with the impact of the 1952, July, whatever it was, 19th, Washington Post,"}, {"Time_Start": 2824.0400000000004, "Time_End": 2828.1400000000003, "Text": " which if you were in a suburb of Maryland, and you opened your door and picked up your paper,"}, {"Time_Start": 2828.2400000000002, "Time_End": 2835.28, "Text": " it said, saucer outruns, jet, pilot reveals. There's a difference in the headline of the Washington Post saying something,"}, {"Time_Start": 2835.6400000000003, "Time_End": 2845.92, "Text": " and the National Inquirer saying it, illusion, misdirection, and ridicule. I'm just saying that you can't accept any face value reality as if it is what it is,"}, {"Time_Start": 2846.26, "Time_End": 2851.6800000000003, "Text": " And the goal of hacking, as I understand it, is to discover what it is, and if that means"}, {"Time_Start": 2851.6800000000003, "Time_End": 2859.5600000000004, "Text": " crossing boundaries, stealthily, using your own methods of illusion, misdirection, and stealth,"}, {"Time_Start": 2859.92, "Time_End": 2864.82, "Text": " then that is exactly what hacking must do to uncover and cobble together the truth in a world"}, {"Time_Start": 2864.82, "Time_End": 2869.1800000000003, "Text": " that is providing management and perception models of reality that are not as true as the ones we want."}, {"Time_Start": 2869.6400000000003, "Time_End": 2870.94, "Text": " Where do hackers come from?"}, {"Time_Start": 2871.5, "Time_End": 2873.7000000000003, "Text": " Consult your own origins and your own backgrounds."}, {"Time_Start": 2874.7000000000003, "Time_End": 2876.2400000000002, "Text": " John Paul Sartre said that great."}, {"Time_Start": 2876.26, "Time_End": 2881.88, "Text": " gift of father can give his son is to die very young. My father dropped dead when"}, {"Time_Start": 2881.88, "Time_End": 2886.6400000000003, "Text": " I was two years old and I am eternally grateful. My mother went to work and I came home"}, {"Time_Start": 2886.6400000000003, "Time_End": 2891.5800000000004, "Text": " a latchkey kid before there was a name for it. My parents were a refrigerator, then a"}, {"Time_Start": 2891.5800000000004, "Time_End": 2898.7200000000003, "Text": " television, then a ham radio, and above all books, typewriter, the masterpiece material"}, {"Time_Start": 2898.7200000000003, "Time_End": 2906.2400000000002, "Text": " of the mind, which enabled me to begin to imagine myself into the world. Hackers mostly feel to me"}, {"Time_Start": 2906.26, "Time_End": 2912.1600000000003, "Text": " the lost children of Neverland, tumbled out of their beds, and bootstrapping ourselves"}, {"Time_Start": 2912.1600000000003, "Time_End": 2918.46, "Text": " together in communities online into an adulthood we have to imagine because we didn't really"}, {"Time_Start": 2918.46, "Time_End": 2924.5, "Text": " have the best models for it ourselves. No wonder the invention of personas and the re-creation"}, {"Time_Start": 2924.5, "Time_End": 2930.5400000000004, "Text": " of our personalities to functionally fit the environment as it changes is one of our gifts. Hackers"}, {"Time_Start": 2930.5400000000004, "Time_End": 2936.2400000000002, "Text": " in their hearts, I think, know what I'm talking about. Spies, artists,"}, {"Time_Start": 2936.26, "Time_End": 2941.82, "Text": " hackers do not accept consensus reality and reconstruct it from a point of view that"}, {"Time_Start": 2941.82, "Time_End": 2947.42, "Text": " is on the edge until society accepts it and by the time everybody believes it, it's over."}, {"Time_Start": 2947.6200000000003, "Time_End": 2948.0600000000004, "Text": " A question?"}, {"Time_Start": 2948.0600000000004, "Time_End": 2951.48, "Text": " The question is, are we morally obligated to hack them?"}, {"Time_Start": 2952.26, "Time_End": 2955.46, "Text": " The question is, are we morally obligated to hack?"}, {"Time_Start": 2956.0200000000004, "Time_End": 2957.6200000000003, "Text": " Okay, let's see what else I've got here."}, {"Time_Start": 2959.6200000000003, "Time_End": 2960.5800000000004, "Text": " What do you think?"}, {"Time_Start": 2966.26, "Time_End": 2979.7000000000003, "Text": " See, as usual, you know the answer."}, {"Time_Start": 2979.7000000000003, "Time_End": 2984.0400000000004, "Text": " You ask the question, because there's a structural authority in the room, i.e., someone faking it."}, {"Time_Start": 2984.48, "Time_End": 2988.7200000000003, "Text": " But if you meet the Buddha on the road, kill him, i.e., someone will answer that question for you,"}, {"Time_Start": 2988.78, "Time_End": 2993.86, "Text": " get rid of them, because they're not mentoring you, they're trying to enslave you by making you think they know more than you do."}, {"Time_Start": 2994.1400000000003, "Time_End": 2995.2200000000003, "Text": " In fact, you knew the answer."}, {"Time_Start": 2995.46, "Time_End": 2996.2400000000002, "Text": " He said the imperative."}, {"Time_Start": 2996.26, "Time_End": 3001.0400000000004, "Text": " is obvious. Yes. Yes. We have an imperative to grow and to hack the truth in order to keep"}, {"Time_Start": 3001.0400000000004, "Time_End": 3006.1200000000003, "Text": " growing ourselves in the best images of the truth we can cobble together. That's what you said,"}, {"Time_Start": 3006.1800000000003, "Time_End": 3011.88, "Text": " and I thank you for your answer. Any other questions? Yes."}, {"Time_Start": 3012.48, "Time_End": 3021.94, "Text": " How do you, uh, valid? No, a lot are crazy. That's what makes it fun."}, {"Time_Start": 3026.26, "Time_End": 3032.26, "Text": " In other words, what is the methodology by which one determines whether a model of reality is good enough?"}, {"Time_Start": 3032.26, "Time_End": 3033.26, "Text": " Correct?"}, {"Time_Start": 3033.26, "Time_End": 3035.26, "Text": " Okay. Any other questions?"}, {"Time_Start": 3035.26, "Time_End": 3045.26, "Text": " I will refer you to, on my website, Themeworks, T-H-I-E-E-W-O-R-K-S.com."}, {"Time_Start": 3045.26, "Time_End": 3051.26, "Text": " There's an article called stalking the UFO meme on the Internet, which takes a look at all the scam art of charlatans"}, {"Time_Start": 3051.26, "Time_End": 3056.2400000000002, "Text": " and multiple referential material about that subject on the Internet. And I know that some of the Cottage"}, {"Time_Start": 3056.26, "Time_End": 3060.88, "Text": " I'm some of the guys in the cottage industry. I've watched it for, I've investigated this stuff for 23 years."}, {"Time_Start": 3061.2400000000002, "Time_End": 3064.96, "Text": " The first thing you have to get through is they're not disinformation agents. They're just scam artists."}, {"Time_Start": 3065.5, "Time_End": 3069.1800000000003, "Text": " I mean, because once you, look, I was a priest. Once you're dealing in symbols,"}, {"Time_Start": 3070.5, "Time_End": 3077.1000000000004, "Text": " well, let me tell you what I mean by that. I mean when what you're dealing with primarily are potent symbols that draw from people,"}, {"Time_Start": 3077.46, "Time_End": 3079.7200000000003, "Text": " powerful projections from the depths of their being."}, {"Time_Start": 3081.46, "Time_End": 3085.5400000000004, "Text": " Thank you. That's Ken Oltoff. He disseminates multiple protocols for it."}, {"Time_Start": 3086.26, "Time_End": 3093.98, "Text": " Once you deal in symbols, which elicit powerful projections from people's depths,"}, {"Time_Start": 3094.6200000000003, "Time_End": 3097.76, "Text": " UFOs are among those. Carl Young said they're mandolists."}, {"Time_Start": 3097.88, "Time_End": 3100.5800000000004, "Text": " They're called forth projections of our whole soul in its totality."}, {"Time_Start": 3100.88, "Time_End": 3102.6000000000004, "Text": " Religious symbols are designed to do that."}, {"Time_Start": 3103.0400000000004, "Time_End": 3108.38, "Text": " You are in danger of manipulating the person whose soul is projecting onto it."}, {"Time_Start": 3109.5400000000004, "Time_End": 3111.6600000000003, "Text": " They are behind a one-way mirror."}, {"Time_Start": 3111.76, "Time_End": 3114.5, "Text": " They're seeing a reflection of themselves, but they think they're seeing you."}, {"Time_Start": 3114.5, "Time_End": 3118.06, "Text": " you have to learn how to handle the projections."}, {"Time_Start": 3118.82, "Time_End": 3121.98, "Text": " Anything I did that was effective, if it was, as a priest,"}, {"Time_Start": 3122.2, "Time_End": 3126.74, "Text": " was because I learned to hear every question statement in respect to my priesthood"}, {"Time_Start": 3126.74, "Time_End": 3130.66, "Text": " as a projection from someone of what was going on with them."}, {"Time_Start": 3131.06, "Time_End": 3133.7, "Text": " And the goal is I just did with him whenever possible,"}, {"Time_Start": 3133.8, "Time_End": 3135.6, "Text": " if they had the ego strength and the ability,"}, {"Time_Start": 3135.96, "Time_End": 3138.28, "Text": " was to slowly give the projection back to them"}, {"Time_Start": 3138.28, "Time_End": 3141.7, "Text": " so they could integrate it, seize it, and accept responsibility for it."}, {"Time_Start": 3142.04, "Time_End": 3143.38, "Text": " It's the same thing when you're hacking."}, {"Time_Start": 3143.8, "Time_End": 3144.48, "Text": " When you encounter it,"}, {"Time_Start": 3144.5, "Time_End": 3149.52, "Text": " something that elicits, powerful projections, fears, or anxieties, you have to take a step"}, {"Time_Start": 3149.52, "Time_End": 3154.46, "Text": " back and withdraw and calm your mind. One of the other goals of hacking, I think, one of the primary"}, {"Time_Start": 3154.46, "Time_End": 3160.96, "Text": " requisites is to manage your ego. I did once a whole talk on social engineering, and the key piece"}, {"Time_Start": 3160.96, "Time_End": 3165.92, "Text": " of it is to manage your ego. I just did a seminar with John Nolan, had a Phoenix Consulting Institute,"}, {"Time_Start": 3165.92, "Time_End": 3171.5, "Text": " a competitive intelligence guru, and all of elicitation. He didn't call it social engineering."}, {"Time_Start": 3171.86, "Time_End": 3174.48, "Text": " It's elicitation for competitive intelligence. It's how to get"}, {"Time_Start": 3174.5, "Time_End": 3179.86, "Text": " people to reveal it's what the priesthood was about. How do you elicit the depths of someone's being"}, {"Time_Start": 3179.86, "Time_End": 3185.38, "Text": " and they don't even feel badly about giving you the information? It's all social engineering."}, {"Time_Start": 3185.38, "Time_End": 3191.94, "Text": " And if you have mastered your ego, so no one needs to know your power, except you in the exercise of it,"}, {"Time_Start": 3191.94, "Time_End": 3196.74, "Text": " you are the master of the universe. But if you need to tell somebody, you know, guru was here,"}, {"Time_Start": 3196.74, "Time_End": 3202.1, "Text": " or scribble your name or your IP address on a website you've just defaced, if you need attrition"}, {"Time_Start": 3202.1, "Time_End": 3204.48, "Text": " to mirror you so that you are magnified to the"}, {"Time_Start": 3204.5, "Time_End": 3208.74, "Text": " world is a powerful person, you're dead or lost. Because the management of the ego,"}, {"Time_Start": 3208.84, "Time_End": 3213.5, "Text": " the Zen say there's a pool that reflects the reflections of everything and the stillness."}, {"Time_Start": 3213.64, "Time_End": 3217.3, "Text": " Where is the moon? Where is the reflection? You can't tell the difference. You have to learn"}, {"Time_Start": 3217.3, "Time_End": 3223.52, "Text": " those skillful, stealthy, spiritual tools in order to manage yourself in the presence of powerful"}, {"Time_Start": 3223.52, "Time_End": 3230.38, "Text": " presentations. Then you need allies. The hacker world is contingent on sharing information."}, {"Time_Start": 3231.06, "Time_End": 3234.08, "Text": " It is set up so you can share information without jeopardy."}, {"Time_Start": 3234.5, "Time_End": 3239.94, "Text": " yourself like a cell and a resistance movement. So you can get and swap the information"}, {"Time_Start": 3239.94, "Time_End": 3244.46, "Text": " you need. You have to learn how to behave. You don't go in. I just got an email again. I'm sure"}, {"Time_Start": 3244.46, "Time_End": 3249.06, "Text": " we've all got them from Romania. Teach me to a hack. I read your name in PC world. Teach me to"}, {"Time_Start": 3249.06, "Time_End": 3258.52, "Text": " hack, please. Send me Trojan. I sent him a box of Trojans. And I hope they get through customs,"}, {"Time_Start": 3258.88, "Time_End": 3264.48, "Text": " right? So you learn how respectfully to go to the"}, {"Time_Start": 3264.5, "Time_End": 3270.66, "Text": " enclaves that Simple Nomad was talking about building in cyberspace to map and model alternative"}, {"Time_Start": 3270.66, "Time_End": 3276.06, "Text": " realities so that we can have safe places with trusted allies where we create these models together."}, {"Time_Start": 3276.06, "Time_End": 3281.24, "Text": " You learn that you can't do it alone. I'm always quoting Dark Tangent, Jeff, who said,"}, {"Time_Start": 3281.6, "Time_End": 3284.8, "Text": " the most important thing I need to know is what I don't need to know because there's too much to know."}, {"Time_Start": 3284.8, "Time_End": 3288.44, "Text": " And the second most important thing I need to know is where to go to get it when I need it."}, {"Time_Start": 3288.88, "Time_End": 3294.04, "Text": " Therefore, how to participate in relationship to these trusted communities of others who share with you"}, {"Time_Start": 3294.04, "Time_End": 3298.7599999999998, "Text": " the presuppositions or the tools of getting information. Then you have to build a point"}, {"Time_Start": 3298.7599999999998, "Time_End": 3303.92, "Text": " of reference and it's just like a spy. You gather data, you build a tentative hypothesis or"}, {"Time_Start": 3303.92, "Time_End": 3308.92, "Text": " model or map of reality. Then you gather more data and compare it to that. Just what Minsky said"}, {"Time_Start": 3308.92, "Time_End": 3314.84, "Text": " is thinking. You build models of a reality and constantly compare them to the feedback loops"}, {"Time_Start": 3314.84, "Time_End": 3319.4, "Text": " of real information. That article to which I referred you, it's back to my day's teaching literature"}, {"Time_Start": 3319.4, "Time_End": 3323.56, "Text": " in the 20s. I taught lit at the University of Illinois. And what it really is about is references,"}, {"Time_Start": 3323.56, "Time_End": 3328.16, "Text": " documentation using resources and references properly and learning how to ferret out the truth."}, {"Time_Start": 3328.22, "Time_End": 3331.86, "Text": " In those days, it was books. Today it's on the web. But the techniques are really the same."}, {"Time_Start": 3331.94, "Time_End": 3335.98, "Text": " You believe nothing at face value. If it's a controversial statement, you better get two or three"}, {"Time_Start": 3335.98, "Time_End": 3340.72, "Text": " references. My guy couldn't print his pictures of the dripper in the aviation magazine he served"}, {"Time_Start": 3340.72, "Time_End": 3345.2999999999997, "Text": " because he couldn't get corroboration from inside the Beltway because you never can. So you share it"}, {"Time_Start": 3345.2999999999997, "Time_End": 3349.44, "Text": " in the black market of truth when we are talking on the telephone about things we have found out,"}, {"Time_Start": 3349.68, "Time_End": 3353.54, "Text": " like my friend at NSA. How does he use his position at NSA? He had"}, {"Time_Start": 3353.56, "Time_End": 3358.2799999999997, "Text": " people come from all over the world to take his courses and learn what he could teach."}, {"Time_Start": 3358.2799999999997, "Time_End": 3361.7599999999998, "Text": " But he's also very interested in UFO phenomena. And when he heard somebody was from, say,"}, {"Time_Start": 3361.7599999999998, "Time_End": 3366.0, "Text": " White Sands, he would say, were you by any chance at White Sands in 19, whatever? And they would say,"}, {"Time_Start": 3366.0, "Time_End": 3370.92, "Text": " I was there. And he said, what was it? And he said, let me tell you what it was. We all are nodes in"}, {"Time_Start": 3370.92, "Time_End": 3375.64, "Text": " the network. How is power exercised in a web at the center of the web? The node of the network"}, {"Time_Start": 3375.64, "Time_End": 3379.96, "Text": " is the center. Everybody is the center. You create centers for yourself where you're the node."}, {"Time_Start": 3379.96, "Time_End": 3383.54, "Text": " You gather and share information. You build the models and maps of reality together."}, {"Time_Start": 3383.56, "Time_End": 3389.56, "Text": " You constantly fact-check, just like the Jedi journalist that Lou is and was."}, {"Time_Start": 3389.56, "Time_End": 3394.56, "Text": " You're constantly looking for people to deceive you. You are absolutely skeptical."}, {"Time_Start": 3394.56, "Time_End": 3397.56, "Text": " You believe everything and you believe nothing."}, {"Time_Start": 3397.56, "Time_End": 3400.56, "Text": " At least, that's one way."}, {"Time_Start": 3400.56, "Time_End": 3402.56, "Text": " Question."}, {"Time_Start": 3402.56, "Time_End": 3410.56, "Text": " In the community of an intelligent person, especially in the active community,"}, {"Time_Start": 3410.56, "Time_End": 3413.56, "Text": " we have a tendency to separate ourselves to"}, {"Time_Start": 3413.56, "Time_End": 3415.96, "Text": " created us versus them attitudes."}, {"Time_Start": 3415.96, "Time_End": 3416.66, "Text": " Right."}, {"Time_Start": 3416.66, "Time_End": 3423.7599999999998, "Text": " And what you're saying, I think you're writing in a lot of things like that the midstream is"}, {"Time_Start": 3423.7599999999998, "Time_End": 3425.86, "Text": " where true goes to die."}, {"Time_Start": 3425.86, "Time_End": 3429.56, "Text": " But I'm wondering, I guess how you respond to"}, {"Time_Start": 3429.56, "Time_End": 3434.56, "Text": " what do you feel our interaction with the midstream should be?"}, {"Time_Start": 3434.56, "Time_End": 3436.2599999999998, "Text": " What you see is not ideal."}, {"Time_Start": 3436.2599999999998, "Time_End": 3441.06, "Text": " Because obviously, we are on the end there, but we're trying to bring things back from the end."}, {"Time_Start": 3441.06, "Time_End": 3443.16, "Text": " It's not just about living on the end of the end of the stage."}, {"Time_Start": 3443.56, "Time_End": 3444.56, "Text": " there."}, {"Time_Start": 3444.56, "Time_End": 3448.56, "Text": " It's about creating something useful and being able to share that with the rest of the world."}, {"Time_Start": 3448.56, "Time_End": 3452.06, "Text": " Terrific. Did you hear what she said? It's not about staying on the edges. It's about using your power"}, {"Time_Start": 3452.06, "Time_End": 3455.06, "Text": " and what you learn how to do to create something more useful."}, {"Time_Start": 3455.06, "Time_End": 3461.06, "Text": " One of the things Lou was saying, attribution footnote, just a few moments before we came up here,"}, {"Time_Start": 3461.06, "Time_End": 3465.56, "Text": " and Simple Nomad confirmed from his position of authority, which we acknowledge in respect,"}, {"Time_Start": 3465.56, "Time_End": 3472.06, "Text": " was that one of the things that seems to be emerging are tools like peekabooty."}, {"Time_Start": 3472.06, "Time_End": 3473.06, "Text": " It's not just about how can we go."}, {"Time_Start": 3473.06, "Time_End": 3477.56, "Text": " how can we get back orifice onto a system and get, you know, take over control."}, {"Time_Start": 3477.56, "Time_End": 3479.56, "Text": " It's about how can we empower people?"}, {"Time_Start": 3479.56, "Time_End": 3485.06, "Text": " How can we help Amnesty International help people who are not otherwise able to speak the truth,"}, {"Time_Start": 3485.06, "Time_End": 3487.56, "Text": " find ways to disseminate the truth in the world."}, {"Time_Start": 3487.56, "Time_End": 3488.56, "Text": " That's exactly right."}, {"Time_Start": 3488.56, "Time_End": 3493.56, "Text": " And one of the joys of having come to DefCon for six years is watching this progression."}, {"Time_Start": 3493.56, "Time_End": 3497.06, "Text": " And that's exactly, ultimately, but you can't force anybody there."}, {"Time_Start": 3497.06, "Time_End": 3501.06, "Text": " First, the tools, first get excited about how to do it."}, {"Time_Start": 3501.06, "Time_End": 3503.06, "Text": " Trust that you will grow up and find the men."}, {"Time_Start": 3503.06, "Time_End": 3508.06, "Text": " centers you need, mutually and with all of us, to then move toward the higher values."}, {"Time_Start": 3508.06, "Time_End": 3511.06, "Text": " When I talk about hacking the truth, it's because the truth does set you free."}, {"Time_Start": 3511.06, "Time_End": 3516.06, "Text": " But it can't set you free unless you know what it does, but it's good for for human beings."}, {"Time_Start": 3516.06, "Time_End": 3518.06, "Text": " So really, I'm just repeating what you said."}, {"Time_Start": 3518.06, "Time_End": 3524.06, "Text": " You said exactly where the ethos of hacking has emerged and the use of information technology in its service."}, {"Time_Start": 3524.06, "Time_End": 3525.06, "Text": " Where?"}, {"Time_Start": 3525.06, "Time_End": 3526.06, "Text": " Okay."}, {"Time_Start": 3526.06, "Time_End": 3532.06, "Text": " I'm going for the collaboration, not to get on the Philadelphia experiment."}, {"Time_Start": 3532.06, "Time_End": 3533.06, "Text": " Ah."}, {"Time_Start": 3533.06, "Time_End": 3536.06, "Text": " The experiment, Battleship was there, then it wasn't, then it was."}, {"Time_Start": 3536.06, "Time_End": 3537.06, "Text": " Okay."}, {"Time_Start": 3537.06, "Time_End": 3541.06, "Text": " So in nature, where is it you can't?"}, {"Time_Start": 3541.06, "Time_End": 3543.06, "Text": " Okay."}, {"Time_Start": 3543.06, "Time_End": 3548.06, "Text": " We have a node in the net who likes the Philadelphia experiment as her"}, {"Time_Start": 3548.06, "Time_End": 3551.06, "Text": " domain of inquiry and has a lot of fun exploring it."}, {"Time_Start": 3551.06, "Time_End": 3554.06, "Text": " Raise your hand."}, {"Time_Start": 3554.06, "Time_End": 3557.06, "Text": " Anybody wants to talk to her about it, help her out with that."}, {"Time_Start": 3557.06, "Time_End": 3558.06, "Text": " That's where you go."}, {"Time_Start": 3558.06, "Time_End": 3560.06, "Text": " Okay."}, {"Time_Start": 3560.06, "Time_End": 3561.06, "Text": " Okay."}, {"Time_Start": 3561.06, "Time_End": 3562.06, "Text": " Or email."}, {"Time_Start": 3562.06, "Time_End": 3563.06, "Text": " Okay."}, {"Time_Start": 3563.06, "Time_End": 3566.06, "Text": " Oh, I can just give these out to the audience."}, {"Time_Start": 3566.06, "Time_End": 3567.06, "Text": " Okay."}, {"Time_Start": 3567.06, "Time_End": 3568.06, "Text": " Let me see if there's anything."}, {"Time_Start": 3568.06, "Time_End": 3571.06, "Text": " It's almost, it's got to be 11 o'clock, right?"}, {"Time_Start": 3571.06, "Time_End": 3572.06, "Text": " Yeah, okay."}, {"Time_Start": 3572.06, "Time_End": 3574.06, "Text": " And we got to catch a plane, right?"}, {"Time_Start": 3574.06, "Time_End": 3576.06, "Text": " Too bad."}, {"Time_Start": 3576.06, "Time_End": 3579.06, "Text": " Okay, these are giveaways."}, {"Time_Start": 3579.06, "Time_End": 3582.06, "Text": " These are left over from, this is a great gift."}, {"Time_Start": 3582.06, "Time_End": 3587.06, "Text": " A backpack left over from Black Hat, which obviously can't be used again next year,"}, {"Time_Start": 3587.06, "Time_End": 3589.06, "Text": " and therefore it's a giveaway."}, {"Time_Start": 3589.06, "Time_End": 3591.06, "Text": " Okay, who thought this was a pretty good talk?"}, {"Time_Start": 3591.06, "Time_End": 3592.06, "Text": " Okay, you get it."}, {"Time_Start": 3592.06, "Time_End": 3597.06, "Text": " Who wishes they thought it was a pretty good talk,"}, {"Time_Start": 3597.06, "Time_End": 3599.06, "Text": " but really isn't sure what the hell I said?"}, {"Time_Start": 3599.06, "Time_End": 3601.06, "Text": " Okay, there you go."}, {"Time_Start": 3601.06, "Time_End": 3605.06, "Text": " Okay, that's that."}, {"Time_Start": 3605.06, "Time_End": 3609.06, "Text": " I love to let people know that I continue to exist online."}, {"Time_Start": 3609.06, "Time_End": 3612.06, "Text": " Themeworks.com, our theme at theme."}, {"Time_Start": 3612.06, "Time_End": 3615.06, "Text": " We all know what matters most."}, {"Time_Start": 3615.06, "Time_End": 3619.06, "Text": " Look, look, I wasn't going to tell this story, but it's popping out,"}, {"Time_Start": 3619.06, "Time_End": 3620.06, "Text": " so I'm going to conclude with it."}, {"Time_Start": 3620.06, "Time_End": 3622.06, "Text": " My wife and I have seven children."}, {"Time_Start": 3622.06, "Time_End": 3626.06, "Text": " between us. It's what they call a blended family. You know, before you get to blend,"}, {"Time_Start": 3626.06, "Time_End": 3631.06, "Text": " you go through great, chop, grind, and puree. So any of you have been part of those joyous"}, {"Time_Start": 3631.06, "Time_End": 3640.06, "Text": " occasions, you know exactly what I mean, chop chop. My daughter, my real princess, the lowest of the seven,"}, {"Time_Start": 3640.06, "Time_End": 3644.06, "Text": " the weight of all those brothers and sisters on her head, came into my life when she was three."}, {"Time_Start": 3644.06, "Time_End": 3649.06, "Text": " She thought I looked and felt a lot like furniture and treated me appropriately for the next umpteen years."}, {"Time_Start": 3649.06, "Time_End": 3652.06, "Text": " Furniture is fine. You can sit on it."}, {"Time_Start": 3652.06, "Time_End": 3657.2999999999997, "Text": " You can have it drive you to school when it needs to get to school, but it's not a human being."}, {"Time_Start": 3658.1, "Time_End": 3662.74, "Text": " All right? So this challenged me in a way that I have never before been challenged in my life."}, {"Time_Start": 3663.22, "Time_End": 3666.72, "Text": " When she left for college, she gave me a note on Father's Day, actually, and she said,"}, {"Time_Start": 3666.7599999999998, "Time_End": 3670.42, "Text": " I know you don't think I've noticed what you've been doing for 15 years, but I really have."}, {"Time_Start": 3671.2599999999998, "Time_End": 3673.64, "Text": " It taught me the meaning of unconditional love."}, {"Time_Start": 3675.34, "Time_End": 3679.4, "Text": " It was the best moment of my life because that's what this is about."}, {"Time_Start": 3679.82, "Time_End": 3681.9, "Text": " The reason we come back, I don't want to preach."}, {"Time_Start": 3682.06, "Time_End": 3687.06, "Text": " much. I can't help it, though. It's not just about information. It's like she said,"}, {"Time_Start": 3687.06, "Time_End": 3699.06, "Text": " information on the service of a greater truth. The reason I come back is because I genuinely feel more at home here than any other place on earth."}, {"Time_Start": 3699.06, "Time_End": 3711.06, "Text": " Because we don't have to explain anything about our presuppositions in how we come to the world and create the reality that we know is ours to make up ex nihilo from nothing like little gods and goddesses."}, {"Time_Start": 3712.06, "Time_End": 3715.66, "Text": " So thank you very, very much for your attention. It's a privilege to say you."}, {"Time_Start": 3742.06, "Time_End": 3744.06, "Text": " Thank you."}, {"Time_Start": 3772.06, "Time_End": 3774.06, "Text": " Thank you."}, {"Time_Start": 3802.06, "Time_End": 3804.06, "Text": " Thank you."}]}