{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 8.24,
      "Text": "This text was transcribed using whisper model: large-v2\n\n So, my name is Jason Killam, I'm a detection engineer for Red Canary, and I'm going to"
    },
    {
      "Time_Start": 8.24,
      "Time_End": 13.92,
      "Text": " talk about malicious sign code and why we need to revoke these and how this helps everybody."
    },
    {
      "Time_Start": 13.92,
      "Time_End": 20.2,
      "Text": " So this is kind of a sequel, and Scooby-Doo helped me with some of the information and"
    },
    {
      "Time_Start": 20.2,
      "Time_End": 24.240000000000002,
      "Text": " research and context for this slide, so a lot of thanks to him for helping me with this."
    },
    {
      "Time_Start": 24.8,
      "Time_End": 25.76,
      "Text": " Sort of a sequel to that."
    },
    {
      "Time_Start": 29.520000000000003,
      "Time_End": 35.84,
      "Text": " Basically, for code signing certificates, you purchase a key from a certificate"
    },
    {
      "Time_Start": 36.400000000000006,
      "Time_End": 44.32000000000001,
      "Text": " signer like SSL.com, Satigo, those kind of places, and this kind of gives you a level"
    },
    {
      "Time_Start": 44.32000000000001,
      "Time_End": 49.36,
      "Text": " of trust with your binary. This usually prevents, a code signing certificate prevents the smart"
    },
    {
      "Time_Start": 49.44,
      "Time_End": 54.32,
      "Text": " screens pop-ups and the warning from Microsoft saying, hey, this is some untrusted stuff,"
    },
    {
      "Time_Start": 54.32,
      "Time_End": 57.519999999999996,
      "Text": " you sure you want to run this kind of thing. Next slide."
    },
    {
      "Time_Start": 61.28,
      "Time_End": 66.96000000000001,
      "Text": " So, for EV certificates, I thought about leaving this out, but the reason I want to include"
    },
    {
      "Time_Start": 67.76,
      "Time_End": 73.12,
      "Text": " the cost for these certificates, if it's a standard cert, it's $300 to $500, and if it's"
    },
    {
      "Time_Start": 73.12,
      "Time_End": 80.24000000000001,
      "Text": " an EV cert, it actually costs $1,500 to $3,000, so these guys have to make these fake shell"
    },
    {
      "Time_Start": 80.24000000000001,
      "Time_End": 85.60000000000001,
      "Text": " companies and all this stuff, all this work that goes into this, and they have to pay this money,"
    },
    {
      "Time_Start": 85.60000000000001,
      "Time_End": 90.56,
      "Text": " and then they have to charge somebody else, you know, to sell the certificate on, so all this,"
    },
    {
      "Time_Start": 90.56,
      "Time_End": 93.92,
      "Text": " if we can revoke these certificates, cost them actual money, and this is the actual dollar"
    },
    {
      "Time_Start": 93.92,
      "Time_End": 100.72,
      "Text": " figures that are costing this stuff. Hit it. So, this is my first example. This is a stealer"
    },
    {
      "Time_Start": 100.72,
      "Time_End": 106.88,
      "Text": " called Vidar. On the left is our bad one in red, and you can kind of see it's got some generic"
    },
    {
      "Time_Start": 106.88,
      "Time_End": 111.68,
      "Text": " information about it. I think monkey soft is the name in that one. It's a downloader. It was"
    },
    {
      "Time_Start": 111.68,
      "Time_End": 115.76,
      "Text": " actually pretending to be an installer for a piece of software called Notion, which I think is like"
    },
    {
      "Time_Start": 115.76,
      "Time_End": 120.16,
      "Text": " a home automation kind of software thing, and on the bottom, you can see the signer. This is all,"
    },
    {
      "Time_Start": 120.16,
      "Time_End": 125.12,
      "Text": " most of my screenshots are from VirusTotal, so this is kind of where I usually go to when I'm"
    },
    {
      "Time_Start": 125.12,
      "Time_End": 131.28,
      "Text": " looking at a binary, so your signer here in this case is AndresDS, and on the right, you've got"
    },
    {
      "Time_Start": 131.28,
      "Time_End": 136.16,
      "Text": " your legitimate binary, which is not directly related, but it's a better example of a good"
    },
    {
      "Time_Start": 136.88,
      "Time_End": 142.56,
      "Text": " binary is MSBuild from Microsoft, so it has the metadata that tells you it's MSBuild. It's"
    },
    {
      "Time_Start": 142.56,
      "Time_End": 147.84,
      "Text": " specific about what it is. It has a pretty good, it's signed by Microsoft, so it has that in the"
    },
    {
      "Time_Start": 147.84,
      "Time_End": 155.44,
      "Text": " name. Hit it. So, for a code signing certificate, you have your name, so this is like the friendly"
    },
    {
      "Time_Start": 155.44,
      "Time_End": 161.52,
      "Text": " name you kind of use to identify who signed the code, who made the code, who's the developer for"
    },
    {
      "Time_Start": 161.52,
      "Time_End": 166.4,
      "Text": " it, so, and then you have your certificate authority, so in this case, it, I think it's"
    },
    {
      "Time_Start": 166.4,
      "Time_End": 173.6,
      "Text": " Cictego. Actually, this is one reason I used, for the previous example, I used MSBuild because the"
    },
    {
      "Time_Start": 173.6,
      "Time_End": 179.12,
      "Text": " malicious binary is also signed, then the legitimate signer for Notion are both Cictego,"
    },
    {
      "Time_Start": 179.12,
      "Time_End": 184.95999999999998,
      "Text": " so it was really actually smart on the actor to choose something that also is from Cictego, so"
    },
    {
      "Time_Start": 184.95999999999998,
      "Time_End": 189.35999999999999,
      "Text": " it's harder to compare apples to apples with those, and then you have your valid to from cert"
    },
    {
      "Time_Start": 189.35999999999999,
      "Time_End": 194.16,
      "Text": " date window, and then your certificate thumbprint, so the valid to from is kind of helpful if you're"
    },
    {
      "Time_Start": 194.16,
      "Time_End": 200.4,
      "Text": " trying to establish a timeline of events. If you find a malicious binary on the box, and the to"
    },
    {
      "Time_Start": 200.4,
      "Time_End": 205.04,
      "Text": " from cert is recent, then you know it's a recent binary if you don't have that kind of historical"
    },
    {
      "Time_Start": 205.04,
      "Time_End": 209.84,
      "Text": " context, so I used to do a lot of incident response, and it's nice to have those timelines,"
    },
    {
      "Time_Start": 210.88,
      "Time_End": 214.4,
      "Text": " and then the thumbprint, that's the thing you want to focus on when you're trying to get this"
    },
    {
      "Time_Start": 214.4,
      "Time_End": 220.0,
      "Text": " stuff revoked, that's at the bottom, and the serial number, something I work with Matt Graber,"
    },
    {
      "Time_Start": 220.0,
      "Time_End": 225.52,
      "Text": " and he pointed out something interesting is you can spoof one of these, and I don't remember which,"
    },
    {
      "Time_Start": 225.52,
      "Time_End": 230.56,
      "Text": " and I should remember that, but you can't spoof the other, so I think it's the thumbprint is"
    },
    {
      "Time_Start": 230.56,
      "Time_End": 235.60000000000002,
      "Text": " spoofable, so they're both important, and they both individually identify it, but I think focus"
    },
    {
      "Time_Start": 235.60000000000002,
      "Time_End": 242.4,
      "Text": " on the serial number for this. Next. So, like I said, these are kind of inconsistencies with your"
    },
    {
      "Time_Start": 242.4,
      "Time_End": 247.20000000000002,
      "Text": " kind of malicious stuff on the left is the bad one, it's a usually really short timeline from"
    },
    {
      "Time_Start": 248.16000000000003,
      "Time_End": 253.84,
      "Text": " creation to being seen in the wild, so for virus total, like on this timeline, you have your"
    },
    {
      "Time_Start": 253.84,
      "Time_End": 258.4,
      "Text": " creation time, your signature date, first seen in the wild, I'm not going to talk about that,"
    },
    {
      "Time_Start": 258.4,
      "Time_End": 262.96,
      "Text": " because it's confusing as hell, because like virus total doesn't make any sense, it's like"
    },
    {
      "Time_Start": 262.96,
      "Time_End": 267.52,
      "Text": " shows MS build like a year before it was created, which doesn't make sense, but anyways, first"
    },
    {
      "Time_Start": 267.52,
      "Time_End": 272.8,
      "Text": " submission, all those last three are specific to virus total, when it was first uploaded, the last"
    },
    {
      "Time_Start": 272.8,
      "Time_End": 277.68,
      "Text": " time it was uploaded, and whenever, like if you're in virus total, and you say rerun this binary,"
    },
    {
      "Time_Start": 277.68,
      "Time_End": 283.84000000000003,
      "Text": " that's the last analysis date. So, yeah, so like with my MS build example, you got like"
    },
    {
      "Time_Start": 284.88,
      "Time_End": 291.52,
      "Text": " a much longer timeline of activity, so it gives that sign binary more credence that it's probably"
    },
    {
      "Time_Start": 291.52,
      "Time_End": 296.4,
      "Text": " legitimate, because if it was bad, it probably would have been revoked by now, but I've seen"
    },
    {
      "Time_Start": 296.4,
      "Time_End": 302.72,
      "Text": " examples where stuff sits on its valid signers for a long time. Next. So, this is kind of a"
    },
    {
      "Time_Start": 302.72,
      "Time_End": 309.52000000000004,
      "Text": " screen shot from this binary on an actual box, and you can see it kind of does a couple things,"
    },
    {
      "Time_Start": 309.52000000000004,
      "Time_End": 314.24,
      "Text": " this binary is called notion updater.exe, but like I showed before, it's just really generic,"
    },
    {
      "Time_Start": 314.24,
      "Time_End": 319.52000000000004,
      "Text": " so they can package it as whatever piece of software they want to pretend to be, but you see"
    },
    {
      "Time_Start": 319.52000000000004,
      "Time_End": 326.64000000000004,
      "Text": " it hits, and you guys are familiar with Vidar, it usually talks to telegram and steam, and I know in"
    },
    {
      "Time_Start": 326.64000000000004,
      "Time_End": 332.48,
      "Text": " the steam community example, it actually, you go to the URL it goes to, and it's the"
    },
    {
      "Time_Start": 332.48,
      "Time_End": 336.88,
      "Text": " profile picture is just an IP address, so you're like, oh, that's kind of a weird name to choose,"
    },
    {
      "Time_Start": 336.88,
      "Time_End": 342.48,
      "Text": " but whatever, but then that points it to the next, the actual C2 to send the data, so that the"
    },
    {
      "Time_Start": 343.76,
      "Time_End": 348.64000000000004,
      "Text": " stealer developer, whoever's pushing this out, can change that whenever they want. So, yeah,"
    },
    {
      "Time_Start": 348.64000000000004,
      "Time_End": 352.96000000000004,
      "Text": " whenever you're looking at binaries like this, it's, for me, when I'm doing analysis, because"
    },
    {
      "Time_Start": 354.40000000000003,
      "Time_End": 359.52000000000004,
      "Text": " I'm doing that kind of analyst work, I kind of think, why would a binary for an installer for"
    },
    {
      "Time_Start": 359.52,
      "Time_End": 364.15999999999997,
      "Text": " home software be talking to steam or telegram and this other stuff, and what's this random IP"
    },
    {
      "Time_Start": 364.15999999999997,
      "Time_End": 369.76,
      "Text": " address it's connecting to as opposed to an actual domain, hit it. So, our next example is yellow"
    },
    {
      "Time_Start": 369.76,
      "Time_End": 375.76,
      "Text": " cockatoo, it's kind of one we see a lot as well, and it's kind of in the wild a lot, it's off,"
    },
    {
      "Time_Start": 375.76,
      "Time_End": 381.28,
      "Text": " they kind of come and go, but on the left, you got your signer information, in this case,"
    },
    {
      "Time_Start": 381.28,
      "Time_End": 385.84,
      "Text": " it's heart craft brewery, so it's kind of weird that a place that makes beer would be making"
    },
    {
      "Time_Start": 385.84000000000003,
      "Time_End": 392.24,
      "Text": " software for that PDF icon, and on the right is, yeah, like our timeline here, again, it's a very"
    },
    {
      "Time_Start": 392.24,
      "Time_End": 397.6,
      "Text": " short timeline, I pretty much took this maybe probably the last analysis date, I can't quite"
    },
    {
      "Time_Start": 397.6,
      "Time_End": 402.88000000000005,
      "Text": " see it from here, but it's only a couple days, so it's pretty obvious if there's some weirdness"
    },
    {
      "Time_Start": 402.88000000000005,
      "Time_End": 411.6,
      "Text": " going on here, and this binary just got put in the wild, so, yep, next. So, yeah, if you just"
    },
    {
      "Time_Start": 411.6,
      "Time_End": 417.44,
      "Text": " Google it, like, I find a lot of stuff, a lot of the times, I'm kind of in Intel, but not in Intel,"
    },
    {
      "Time_Start": 417.44,
      "Time_End": 422.8,
      "Text": " but, like, I'm really good at Intel when it's on Google, so, if you just Google the heart craft"
    },
    {
      "Time_Start": 422.8,
      "Time_End": 427.20000000000005,
      "Text": " brewery, you find this Twitter post from squiggly do, and it actually shows, hey, this is kind of"
    },
    {
      "Time_Start": 427.20000000000005,
      "Time_End": 436.32000000000005,
      "Text": " weird that a brewery is signing a binary, and, yeah, next. So, call to action, like I said,"
    },
    {
      "Time_Start": 436.32000000000005,
      "Time_End": 440.96000000000004,
      "Text": " I have a good example here, Russian panda, I can't remember where she works, but I think it's ESET,"
    },
    {
      "Time_Start": 440.96000000000004,
      "Time_End": 446.32000000000005,
      "Text": " but she revoked, her team revoked the certificates for defact loader, which is a really hard"
    },
    {
      "Time_Start": 446.32000000000005,
      "Time_End": 452.64000000000004,
      "Text": " malware name to pronounce, but the developer had to basically pay everybody back, because their"
    },
    {
      "Time_Start": 452.64000000000004,
      "Time_End": 457.6,
      "Text": " certs were revoked, and that's the English translation, because it was all in Russian,"
    },
    {
      "Time_Start": 458.96000000000004,
      "Time_End": 462.96000000000004,
      "Text": " and you've got some links here, those are just some examples for SSL.com and Sectigo,"
    },
    {
      "Time_Start": 463.52000000000004,
      "Time_End": 468.8,
      "Text": " for Sectigo, you have to send it to an email, for SSL.com, they have an actual web form you fill out,"
    },
    {
      "Time_Start": 469.76,
      "Time_End": 475.84000000000003,
      "Text": " and, yeah, and they'll usually rely on, like, malware repositories, and stuff like that,"
    },
    {
      "Time_Start": 475.84000000000003,
      "Time_End": 481.44,
      "Text": " and squiggly do has a tool on GitHub that you can just give it the hash, you don't have to download"
    },
    {
      "Time_Start": 481.44,
      "Time_End": 486.24,
      "Text": " it or have the file, you just have to have the hash, you just provide it the hash, it will pull"
    },
    {
      "Time_Start": 486.24,
      "Time_End": 490.88,
      "Text": " down all the information about it, and basically make you an email that you can send to them,"
    },
    {
      "Time_Start": 490.88,
      "Time_End": 497.92,
      "Text": " and give you the instructions on how to get that cert revoked. Next. So, yeah, so, if you're going"
    },
    {
      "Time_Start": 497.92,
      "Time_End": 502.56,
      "Text": " to revoke these certs, the things you need to include, a name and email, just contact info,"
    },
    {
      "Time_Start": 503.52000000000004,
      "Time_End": 510.0,
      "Text": " those will usually help them if they're not sure why it needs to be revoked, some stuff like"
    },
    {
      "Time_Start": 510.0,
      "Time_End": 517.28,
      "Text": " non-binaries, like MSIX files, and malicious signed JavaScript is a little harder to explain to them,"
    },
    {
      "Time_Start": 517.28,
      "Time_End": 523.44,
      "Text": " because the certificate's not readily visible if you search virus huddle, and then the certificate"
    },
    {
      "Time_Start": 523.44,
      "Time_End": 528.8000000000001,
      "Text": " thumbprint serial, and then the reason why, and I usually kind of, sometimes you have to get really"
    },
    {
      "Time_Start": 528.8000000000001,
      "Time_End": 532.5600000000001,
      "Text": " specific about it, like I said, if it's on malware bazaar and it's really obvious it's bad,"
    },
    {
      "Time_Start": 532.5600000000001,
      "Time_End": 537.12,
      "Text": " they'll probably just revoke it, in some examples you might have to explain the attack chain and"
    },
    {
      "Time_Start": 537.12,
      "Time_End": 544.1600000000001,
      "Text": " how it works so that maybe they can replicate it or something on their end, and providing all that"
    },
    {
      "Time_Start": 544.1600000000001,
      "Time_End": 548.5600000000001,
      "Text": " information up front will shorten that time to revocation, I think with the example of MSIX"
    },
    {
      "Time_Start": 548.5600000000001,
      "Time_End": 555.9200000000001,
      "Text": " files, if the cert is revoked, that installer will not work, period, so it really screws up their day."
    },
    {
      "Time_Start": 556.6400000000001,
      "Time_End": 562.6400000000001,
      "Text": " Next. Yep, that's it. My slides will be on GitHub, but the Wi-Fi here has been kind of spotty,"
    },
    {
      "Time_Start": 562.6400000000001,
      "Time_End": 564.48,
      "Text": " so I haven't had time to upload them."
    }
  ]
}