{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 6.04,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Eric. I'm from CrowdStrike. I'm here to talk about how e-crime adversaries"
    },
    {
      "Time_Start": 6.04,
      "Time_End": 12.64,
      "Text": " use legitimate remote management tools. Oh, and it actually works. All right, let's start"
    },
    {
      "Time_Start": 12.64,
      "Time_End": 17.76,
      "Text": " with a little bit of background on these tools. So what are these? They're sometimes called"
    },
    {
      "Time_Start": 17.76,
      "Time_End": 24.02,
      "Text": " remote management and monitoring tools or RMM tools. These are legitimate remote administration"
    },
    {
      "Time_Start": 24.02,
      "Time_End": 30.52,
      "Text": " software offered by commercial vendors, and they're used by IT teams, MSSPs, and others"
    },
    {
      "Time_Start": 30.52,
      "Time_End": 36.22,
      "Text": " for monitoring endpoints, deploying patches and hotfixes, and troubleshooting issues"
    },
    {
      "Time_Start": 36.22,
      "Time_End": 41.86,
      "Text": " that users report. Almost every vendor has a free version that you or I or anyone can"
    },
    {
      "Time_Start": 41.86,
      "Time_End": 47.18,
      "Text": " go download from their website, and there are numerous such vendors. I've listed some"
    },
    {
      "Time_Start": 47.18,
      "Time_End": 51.739999999999995,
      "Text": " of the more common ones on this slide, but as it turned out in my research, there are"
    },
    {
      "Time_Start": 51.74,
      "Time_End": 57.86,
      "Text": " many, many other more obscure ones. The key advantage of these tools is not only do they"
    },
    {
      "Time_Start": 57.86,
      "Time_End": 62.06,
      "Text": " offer remote administration capability and can be obtained for free, but they're not"
    },
    {
      "Time_Start": 62.06,
      "Time_End": 68.14,
      "Text": " blocked by most security software precisely because they are needed by enterprise IT teams"
    },
    {
      "Time_Start": 68.14,
      "Time_End": 73.1,
      "Text": " for legitimate business purposes. And it's that lack of prevention and detection that"
    },
    {
      "Time_Start": 73.1,
      "Time_End": 79.78,
      "Text": " e-crime actors and other adversaries exploit. In fact, based on Falcon Overwatch telemetry,"
    },
    {
      "Time_Start": 79.78,
      "Time_End": 88.1,
      "Text": " we saw a near doubling in incidents involving RMM tools in 2023 as compared with 2022, as"
    },
    {
      "Time_Start": 88.1,
      "Time_End": 93.78,
      "Text": " you see on this slide. And this trend has only accelerated into 2024. When last I checked,"
    },
    {
      "Time_Start": 93.78,
      "Time_End": 101.1,
      "Text": " we had over 600 incidents so far in 2024. I've listed some of the most commonly seen"
    },
    {
      "Time_Start": 101.1,
      "Time_End": 107.02000000000001,
      "Text": " RMM tools on this slide, AnyDesk, Atera, Connect by Screen Connect, you're probably all familiar"
    },
    {
      "Time_Start": 107.17999999999999,
      "Time_End": 114.69999999999999,
      "Text": " with, but as I mentioned, there are many other obscure ones that we have seen as well. I'd like to turn now to a couple"
    },
    {
      "Time_Start": 114.69999999999999,
      "Time_End": 121.94,
      "Text": " different case studies that highlight some examples of e-crime actors using RMM tools."
    },
    {
      "Time_Start": 121.94,
      "Time_End": 127.1,
      "Text": " Let's start with everyone's favorite adversary, Scattered Spider. This is an extraordinarily"
    },
    {
      "Time_Start": 127.1,
      "Time_End": 132.3,
      "Text": " aggressive adversary that conducts prolific SMS phishing and phishing campaigns, which"
    },
    {
      "Time_Start": 132.3,
      "Time_End": 137.5,
      "Text": " direct users to landing pages to capture authentication credentials, primarily for SSO,"
    },
    {
      "Time_Start": 137.5,
      "Time_End": 143.74,
      "Text": " VPN, remote access, and they also socially engineer help desk users to give up those creds."
    },
    {
      "Time_Start": 143.74,
      "Time_End": 151.02,
      "Text": " They can defeat phone-based MFA with SIM swapping and MFA notification fatigue. Once they authenticate"
    },
    {
      "Time_Start": 151.02,
      "Time_End": 157.02,
      "Text": " to your environment, they will frequently drop a panoply of RMM tools, including several more"
    },
    {
      "Time_Start": 157.02,
      "Time_End": 162.62,
      "Text": " uncommon ones that have listed there on that slide, as you see. One of the interesting ways"
    },
    {
      "Time_Start": 162.62,
      "Time_End": 169.82000000000002,
      "Text": " that Scattered Spider deploys RMM tools is by compromising the admin panels for legitimate"
    },
    {
      "Time_Start": 169.82000000000002,
      "Time_End": 175.42000000000002,
      "Text": " EDR tools, so they already have credentials, they authenticate to the EDR admin panel, and"
    },
    {
      "Time_Start": 175.42000000000002,
      "Time_End": 182.14000000000001,
      "Text": " basically all EDR tools also offer native remote shell capability, so they can go run shell commands"
    },
    {
      "Time_Start": 182.14000000000001,
      "Time_End": 187.02,
      "Text": " on whatever system they want to, and they run commands that of course install an RMM tool to"
    },
    {
      "Time_Start": 187.02,
      "Time_End": 192.86,
      "Text": " give them additional access. At a more basic level, sometimes they will literally just spin up a web"
    },
    {
      "Time_Start": 192.86,
      "Time_End": 197.5,
      "Text": " browser, point it to the vendor website, download the installer, and run the installer, and that"
    },
    {
      "Time_Start": 197.5,
      "Time_End": 203.82000000000002,
      "Text": " usually works just fine. They've also deployed RMM tools using Microsoft Azure run commands,"
    },
    {
      "Time_Start": 203.82000000000002,
      "Time_End": 210.70000000000002,
      "Text": " which can run shell commands on your VMs or Microsoft Intune. Chef Spider is an interesting"
    },
    {
      "Time_Start": 210.70000000000002,
      "Time_End": 217.50000000000003,
      "Text": " lower volume e-crime adversary. They begin their campaigns by contacting companies via public sales"
    },
    {
      "Time_Start": 217.50000000000003,
      "Time_End": 223.18,
      "Text": " leader or contact forms. They pretend to be a customer interested in the company's products,"
    },
    {
      "Time_Start": 223.18,
      "Time_End": 229.10000000000002,
      "Text": " they provide an email address, the company responds to the email believing that they are"
    },
    {
      "Time_Start": 229.10000000000002,
      "Time_End": 235.98000000000002,
      "Text": " engaging with a customer, and then Chef Spider sends an email back to the company with a link"
    },
    {
      "Time_Start": 235.98000000000002,
      "Time_End": 241.18,
      "Text": " to a page which hosts an installer for Screen Connect, and we've seen these pages deliver"
    },
    {
      "Time_Start": 241.18,
      "Time_End": 247.98000000000002,
      "Text": " both Windows and macOS installers, likely based on the user agent strings of a browser navigating"
    },
    {
      "Time_Start": 247.98000000000002,
      "Time_End": 254.62,
      "Text": " to those pages. We've also tracked a series of callback phishing campaigns. This is a popular"
    },
    {
      "Time_Start": 254.62,
      "Time_End": 260.14000000000004,
      "Text": " tactic that numerous adversaries have used, so the adversary sends an email to you, it says"
    },
    {
      "Time_Start": 260.14000000000004,
      "Time_End": 264.38,
      "Text": " you have this imminent charge for a TV streaming service or some other internet service,"
    },
    {
      "Time_Start": 265.02,
      "Time_End": 270.62,
      "Text": " here's your invoice, the invoice PDF contains a helpful customer service phone number that you"
    },
    {
      "Time_Start": 270.62,
      "Time_End": 276.62,
      "Text": " are encouraged to dial if you do not want to pay your imminent charge. When you call the alleged"
    },
    {
      "Time_Start": 276.62,
      "Time_End": 282.38,
      "Text": " customer service number, the operators will send you a second email with a link, in this case to"
    },
    {
      "Time_Start": 282.38,
      "Time_End": 289.1,
      "Text": " Zoho Assist, which is another RMM tool, and we've seen the adversary use those Zoho Assist sessions"
    },
    {
      "Time_Start": 289.1,
      "Time_End": 295.58000000000004,
      "Text": " to download yet another RMM tool called Super Ops, as well as the WinSCP utility likely to"
    },
    {
      "Time_Start": 295.58000000000004,
      "Time_End": 304.06,
      "Text": " exfiltrate data. I'd like to turn now to some recommendations for hunting RMM tools, and while"
    },
    {
      "Time_Start": 304.06,
      "Time_End": 310.54,
      "Text": " the examples I provided are specific to some of the most common RMM tools, the principles here"
    },
    {
      "Time_Start": 310.54,
      "Time_End": 318.14000000000004,
      "Text": " apply to basically any tool. So at a foundational level, it's useful to monitor for artifacts that"
    },
    {
      "Time_Start": 318.14,
      "Time_End": 324.94,
      "Text": " are typical of RMM tools. You would be surprised just how many adversaries continue to use default"
    },
    {
      "Time_Start": 324.94,
      "Time_End": 331.18,
      "Text": " installer or client names, which typically reference the product itself, right? ScreenConnect,"
    },
    {
      "Time_Start": 331.18,
      "Time_End": 338.3,
      "Text": " TeamViewer, AnyDesk.exe, whatever, very similar to that. Even if you expect one or more of these"
    },
    {
      "Time_Start": 338.86,
      "Time_End": 344.78,
      "Text": " tools in your environment, you may not expect them to be dropping binaries regularly. So for instance,"
    },
    {
      "Time_Start": 344.78000000000003,
      "Time_End": 352.46000000000004,
      "Text": " AnyDesk, as part of normal operations, will write a file called GCAPI.dll, but other binaries"
    },
    {
      "Time_Start": 352.46000000000004,
      "Time_End": 359.26000000000005,
      "Text": " dropped underneath your AnyDesk process should probably be investigated. Additionally, RMM tools"
    },
    {
      "Time_Start": 359.26000000000005,
      "Time_End": 365.18,
      "Text": " will typically write artifacts of various sorts to a subdirectory within Program Files, Program Data,"
    },
    {
      "Time_Start": 365.18,
      "Time_End": 371.02000000000004,
      "Text": " or AppData Roaming. You see some examples there. The naming tends to reference the vendor or product."
    },
    {
      "Time_Start": 371.97999999999996,
      "Time_End": 379.34,
      "Text": " From a network perspective, some RMM tools will send a DNS request to a vendor-associated"
    },
    {
      "Time_Start": 379.34,
      "Time_End": 385.82,
      "Text": " domain. So for instance, NetSupportManager, when it starts up, typically sends a DNS request"
    },
    {
      "Time_Start": 385.82,
      "Time_End": 393.82,
      "Text": " to geo.netsupportsoftware.com. And ScreenConnect almost always connects to a subdomain of the"
    },
    {
      "Time_Start": 393.82,
      "Time_End": 400.21999999999997,
      "Text": " legitimate official ScreenConnect.com domain, and that's pretty typical even with malicious"
    },
    {
      "Time_Start": 400.22,
      "Time_End": 408.46000000000004,
      "Text": " uses of ScreenConnect. At a more advanced level, adversaries may rename their client or installer"
    },
    {
      "Time_Start": 408.46000000000004,
      "Time_End": 415.42,
      "Text": " binaries, change the file path. So simple hunts like on the former slide may not be as useful"
    },
    {
      "Time_Start": 415.42,
      "Time_End": 421.5,
      "Text": " in some cases, but you can still monitor for process behavior, that is, artifacts that appear"
    },
    {
      "Time_Start": 421.5,
      "Time_End": 426.22,
      "Text": " on the command line. So for instance, you see here, ConnectWise ScreenConnect will typically"
    },
    {
      "Time_Start": 426.22,
      "Time_End": 433.1,
      "Text": " launch with a verbose series of parameters, E, Y, H, so on and so forth. And obviously,"
    },
    {
      "Time_Start": 433.1,
      "Time_End": 437.90000000000003,
      "Text": " the particular values will change, but the presence of those parameters can be useful"
    },
    {
      "Time_Start": 437.90000000000003,
      "Time_End": 443.5,
      "Text": " for detecting ScreenConnect. ScreenConnect can also run manual shell commands that will typically"
    },
    {
      "Time_Start": 443.5,
      "Time_End": 451.98,
      "Text": " manifest as those run.cmd files on the command line. AnyDesk is typically installed with the"
    },
    {
      "Time_Start": 451.98,
      "Time_End": 457.98,
      "Text": " install flag and almost always is installed with the silent flag in order to suppress notifications"
    },
    {
      "Time_Start": 457.98,
      "Time_End": 464.94,
      "Text": " to users. TeamViewer will often run with the configuration or DRE flags, and TeamViewer's"
    },
    {
      "Time_Start": 464.94,
      "Time_End": 474.54,
      "Text": " helper binaries may appear with the action or log parameters. So in conclusion, ECRM adversaries will"
    },
    {
      "Time_Start": 474.54,
      "Time_End": 480.54,
      "Text": " almost certainly continue to use legitimate RMM tools in the future due to their potent combination"
    },
    {
      "Time_Start": 480.62,
      "Time_End": 486.06,
      "Text": " of remote administration capabilities, ease of availability, again, you can just download them"
    },
    {
      "Time_Start": 486.06,
      "Time_End": 491.98,
      "Text": " from any vendor website, and most importantly, evasion of detections and preventions. So in order"
    },
    {
      "Time_Start": 491.98,
      "Time_End": 498.3,
      "Text": " to detect them, baseline your network, know what RMM tools you do expect, and then write detections"
    },
    {
      "Time_Start": 498.3,
      "Time_End": 504.70000000000005,
      "Text": " for both hosts and network artifacts, as well as process behaviors. Thanks so much."
    },
    {
      "Time_Start": 510.54,
      "Time_End": 511.04,
      "Text": " Thank you."
    }
  ]
}