{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hi, everyone. Thanks for coming to my talk, Hyperscalers and FinCrime, a match made in"
    },
    {
      "Time_Start": 7.0,
      "Time_End": 10.56,
      "Text": " the cloud. I'm going to go a lot louder. Thank you. Keep doing that, by the way, because"
    },
    {
      "Time_Start": 10.56,
      "Time_End": 15.64,
      "Text": " I'm going to need that. All right. So, that's me. I currently work as the Senior Director"
    },
    {
      "Time_Start": 15.64,
      "Time_End": 21.06,
      "Text": " of Security Detection Research at Datadog. We do cloud security stuff. And much like"
    },
    {
      "Time_Start": 21.06,
      "Time_End": 24.92,
      "Text": " Brazilian Jiu-Jitsu and much like CrossFit, if you run a newsletter, you have to tell"
    },
    {
      "Time_Start": 24.92,
      "Time_End": 28.54,
      "Text": " everybody that you run a newsletter. So, that's my newsletter. A lot of the content that's"
    },
    {
      "Time_Start": 28.54,
      "Time_End": 33.22,
      "Text": " in there, a lot of people in this very audience wrote. So, thank you so much. I really appreciate"
    },
    {
      "Time_Start": 33.22,
      "Time_End": 37.7,
      "Text": " it. But, yeah, I have a lot to talk about. I split the talk into three buckets. Basically,"
    },
    {
      "Time_Start": 37.7,
      "Time_End": 42.14,
      "Text": " I'm going to do some buzzword bingo on cloud service providers. You saw the word hyperscalers,"
    },
    {
      "Time_Start": 42.14,
      "Time_End": 46.18,
      "Text": " so a bunch of Wall Street analysts got really excited probably if they heard that. We're"
    },
    {
      "Time_Start": 46.18,
      "Time_End": 49.78,
      "Text": " going to talk about how Datadog models cloud threats for detection opportunities, and we're"
    },
    {
      "Time_Start": 49.78,
      "Time_End": 54.34,
      "Text": " going to do some case studies here, specifically into two buckets. One bucket is going to be"
    },
    {
      "Time_Start": 54.34,
      "Time_End": 58.900000000000006,
      "Text": " using the cloud to go and do something else outside the cloud, and then cloud as the actual"
    },
    {
      "Time_Start": 58.900000000000006,
      "Time_End": 63.7,
      "Text": " primary target. And so, when you hear the word hyperscalers, you mostly think of these"
    },
    {
      "Time_Start": 63.7,
      "Time_End": 68.18,
      "Text": " three different companies, right? Amazon, Microsoft, and Google. And there's many reasons"
    },
    {
      "Time_Start": 68.18,
      "Time_End": 72.82000000000001,
      "Text": " why it's called hyperscalers. You go and look on their websites, you pull things up, you"
    },
    {
      "Time_Start": 72.82000000000001,
      "Time_End": 77.54,
      "Text": " start to notice that it's not just somebody else's computer. They offer hundreds of services"
    },
    {
      "Time_Start": 77.54,
      "Time_End": 82.42,
      "Text": " that a developer can use to go and write code, deploy, start a company, right? Go and look"
    },
    {
      "Time_Start": 82.42,
      "Time_End": 86.24000000000001,
      "Text": " at it for Azure. Notice it's over 200. I don't know if they're competing and making"
    },
    {
      "Time_Start": 86.24000000000001,
      "Time_End": 89.82000000000001,
      "Text": " sure they have that in their marketing copy. And in the most Google way possible, they"
    },
    {
      "Time_Start": 89.82000000000001,
      "Time_End": 94.18,
      "Text": " don't say how much they have. They have an interactive map of all the things that you"
    },
    {
      "Time_Start": 94.18,
      "Time_End": 99.86,
      "Text": " can go and do. I counted 237. So, all of them are really focused in making sure that they"
    },
    {
      "Time_Start": 99.86,
      "Time_End": 104.78,
      "Text": " can create all these different types of services so that developers can write fast. And it's"
    },
    {
      "Time_Start": 104.78,
      "Time_End": 109.1,
      "Text": " very similar to how a programming language would work. So, maybe you write Python at"
    },
    {
      "Time_Start": 109.10000000000001,
      "Time_End": 112.7,
      "Text": " one company, you go to another company, you're gonna use the same tool set, right? So, it's"
    },
    {
      "Time_Start": 112.7,
      "Time_End": 116.98,
      "Text": " very similar. You go to one company, you're working on Amazon, you're working on GCP,"
    },
    {
      "Time_Start": 116.98,
      "Time_End": 120.38000000000001,
      "Text": " you go to another, you're gonna do the same thing. And so, the threat model that they"
    },
    {
      "Time_Start": 120.38000000000001,
      "Time_End": 124.34,
      "Text": " generally follow revolves around something called the shared responsibility model. Google"
    },
    {
      "Time_Start": 124.34,
      "Time_End": 127.74000000000001,
      "Text": " calls it the shared fate model. Again, Google, they have to do something different. But the"
    },
    {
      "Time_Start": 127.74000000000001,
      "Time_End": 132.26000000000002,
      "Text": " basic premise behind it is that you're responsible for certain things and securing them and we're"
    },
    {
      "Time_Start": 132.26000000000002,
      "Time_End": 136.82,
      "Text": " responsible for certain things and securing them. And there's a little bit in the middle"
    },
    {
      "Time_Start": 136.82,
      "Time_End": 140.42,
      "Text": " that we're both responsible for. And so, what this does is it creates these homogenous"
    },
    {
      "Time_Start": 140.42,
      "Time_End": 144.7,
      "Text": " environments. They're built for scale and rapid deployment of new services. The problem"
    },
    {
      "Time_Start": 144.7,
      "Time_End": 147.85999999999999,
      "Text": " with these homogenous environments and when you're adding new services is it creates an"
    },
    {
      "Time_Start": 147.85999999999999,
      "Time_End": 151.9,
      "Text": " information asymmetry. What that basically means is that as these cloud service providers"
    },
    {
      "Time_Start": 151.9,
      "Time_End": 156.98,
      "Text": " are making more things and you're trying to make more things with them, cyber criminals"
    },
    {
      "Time_Start": 156.98,
      "Time_End": 161.66,
      "Text": " are also taking advantage of this. And they're not really banking on the fact that you know"
    },
    {
      "Time_Start": 161.66,
      "Time_End": 167.02,
      "Text": " everything about all the different services that are being deployed. And so, they're built"
    },
    {
      "Time_Start": 167.02,
      "Time_End": 171.66,
      "Text": " to rapidly launch these. It's all about the line going up, right? And so, this is taking"
    },
    {
      "Time_Start": 171.66,
      "Time_End": 176.9,
      "Text": " advantage of that. And so, the question becomes, how do you precisely describe a cloud service"
    },
    {
      "Time_Start": 176.9,
      "Time_End": 181.38,
      "Text": " attack? And again, more than just crypto mining, right? And so, what we do at Datadog is we"
    },
    {
      "Time_Start": 181.38,
      "Time_End": 186.34,
      "Text": " try to answer the where, what, why, and how. And so, the where is basically where is the"
    },
    {
      "Time_Start": 186.34,
      "Time_End": 193.26,
      "Text": " attack in the cloud being performed? And so, obvious one, cloud. This is like I log"
    },
    {
      "Time_Start": 193.26,
      "Time_End": 198.22,
      "Text": " into Amazon, I log into my Azure tenant, and I can configure things. I can launch things,"
    },
    {
      "Time_Start": 198.22,
      "Time_End": 202.66,
      "Text": " right? But as you move kind of closer and closer to where the code's being run, you"
    },
    {
      "Time_Start": 202.66,
      "Time_End": 207.54,
      "Text": " start looking at the cluster, the actual EC2 instance, the compute node, the virtual machine,"
    },
    {
      "Time_Start": 207.54,
      "Time_End": 211.58,
      "Text": " and a lot of the orchestrators like Kubernetes and things like that. Things run on these"
    },
    {
      "Time_Start": 212.54000000000002,
      "Time_End": 218.86,
      "Text": " EC2 instances. Containers. This is like the de facto standard to building like a hyperscale"
    },
    {
      "Time_Start": 218.86,
      "Time_End": 224.14000000000001,
      "Text": " company is you're deploying containers and that container contains code. And so, when"
    },
    {
      "Time_Start": 224.14000000000001,
      "Time_End": 228.06,
      "Text": " we're thinking about where is this attack occurring, we first say where did it first"
    },
    {
      "Time_Start": 228.06,
      "Time_End": 232.38000000000002,
      "Text": " start? And it can start in any one of the four Cs. And by the way, from those four Cs,"
    },
    {
      "Time_Start": 232.38000000000002,
      "Time_End": 236.10000000000002,
      "Text": " there are attack paths to go and navigate between everything here. So, it can go from"
    },
    {
      "Time_Start": 236.10000000000002,
      "Time_End": 240.3,
      "Text": " code to container, cluster to cloud, cloud back to code. And so, it's kind of important"
    },
    {
      "Time_Start": 240.3,
      "Time_End": 243.86,
      "Text": " to kind of realize like it's a little bit complicated to really go and perform all these"
    },
    {
      "Time_Start": 243.86,
      "Time_End": 248.82000000000002,
      "Text": " different types of detections, right? The next is specifically the data on the wire."
    },
    {
      "Time_Start": 248.82000000000002,
      "Time_End": 253.46,
      "Text": " This is the what can we see. Typically, the cloud service providers talk about two things,"
    },
    {
      "Time_Start": 253.46,
      "Time_End": 257.46000000000004,
      "Text": " the control plane, the data plane. The control plane is I'm booting up a database and this"
    },
    {
      "Time_Start": 257.46000000000004,
      "Time_End": 261.98,
      "Text": " database is going to be a certain version. I'm listing my databases. I'm removing them."
    },
    {
      "Time_Start": 261.98,
      "Time_End": 266.26,
      "Text": " The data plane is the data inside the database. So, specifically, what I'm putting in there."
    },
    {
      "Time_Start": 266.26,
      "Time_End": 270.86,
      "Text": " A lot of these, like Amazon, for example, calls this the value. Data plane contains"
    },
    {
      "Time_Start": 270.86,
      "Time_End": 276.34,
      "Text": " the value of a company or of a cloud, right? And so, looking at how can I find different"
    },
    {
      "Time_Start": 276.34,
      "Time_End": 279.82,
      "Text": " detection opportunities between these two is a really important thing when you're trying"
    },
    {
      "Time_Start": 279.82,
      "Time_End": 284.62,
      "Text": " to track all of these different intrusions. The next is the who. We call this the bot"
    },
    {
      "Time_Start": 284.62,
      "Time_End": 289.78,
      "Text": " or not question. You go and you look at identity and access management on almost all of the"
    },
    {
      "Time_Start": 289.78,
      "Time_End": 293.82,
      "Text": " cloud service providers. They always talk about whether an identity that's interacting"
    },
    {
      "Time_Start": 293.82,
      "Time_End": 298.2,
      "Text": " with these resources, is it a human or is it a machine? And there are different things"
    },
    {
      "Time_Start": 298.2,
      "Time_End": 302.54,
      "Text": " that you can baseline based on that behavior. A dev does certain things. A database does"
    },
    {
      "Time_Start": 302.54,
      "Time_End": 307.06,
      "Text": " certain things. So, baselining where this is, who's doing it, and whether or not it's"
    },
    {
      "Time_Start": 307.06,
      "Time_End": 310.98,
      "Text": " a bot is very important. And then, lastly, the how. This is kind of where Mitre comes"
    },
    {
      "Time_Start": 310.98,
      "Time_End": 315.78,
      "Text": " in and Mitre ATT&CK. We leverage Mitre ATT&CK pretty heavily, at least for the cloud. It"
    },
    {
      "Time_Start": 315.78,
      "Time_End": 319.86,
      "Text": " does have some things that, like, kind of repeat between each of the different stages,"
    },
    {
      "Time_Start": 320.02000000000004,
      "Time_End": 324.3,
      "Text": " but it's because it's kind of showcasing all of these different components of the where"
    },
    {
      "Time_Start": 324.3,
      "Time_End": 329.58000000000004,
      "Text": " and the what. And so, it's very useful for us as we're modeling these. So, quick recap,"
    },
    {
      "Time_Start": 329.58000000000004,
      "Time_End": 334.62,
      "Text": " how we put this all together. Where, what, who, and how. So, where in the four Cs can"
    },
    {
      "Time_Start": 334.62,
      "Time_End": 339.02000000000004,
      "Text": " we find telemetry? What information is available in those data planes or control planes? Who"
    },
    {
      "Time_Start": 339.02000000000004,
      "Time_End": 343.62,
      "Text": " is the identity type interested in the cloud resource? And how can a T code describe the"
    },
    {
      "Time_Start": 343.62,
      "Time_End": 347.66,
      "Text": " tactic? I stole this from the Proofpoint folks. I think they said on one of their podcasts"
    },
    {
      "Time_Start": 347.66,
      "Time_End": 353.3,
      "Text": " a T code for Mitre ATT&CK. Very precise and concise, which I love. So, I talked a lot"
    },
    {
      "Time_Start": 353.3,
      "Time_End": 357.5,
      "Text": " about what it is, what is a hyperscaler, why there's an information asymmetry, why it's"
    },
    {
      "Time_Start": 357.5,
      "Time_End": 361.34000000000003,
      "Text": " really targeted for devs, and now I'm going to start showing everyone a couple things"
    },
    {
      "Time_Start": 361.34000000000003,
      "Time_End": 365.1,
      "Text": " that we've seen at Datadog as well as things we've seen in the wild and kind of model it"
    },
    {
      "Time_Start": 365.1,
      "Time_End": 370.42,
      "Text": " using that threat model that I talked about earlier. So, we recently wrote a blog post"
    },
    {
      "Time_Start": 370.42,
      "Time_End": 375.02000000000004,
      "Text": " where a threat actor performed a resource hijacking attack to do a phishing campaign,"
    },
    {
      "Time_Start": 375.02,
      "Time_End": 380.06,
      "Text": " specifically smishing, I think I'm allowed to say that, or SMS-based phishing. But the"
    },
    {
      "Time_Start": 380.06,
      "Time_End": 384.85999999999996,
      "Text": " basic setup of it, and the way I'm going to do this is a sequence diagram. So, you have"
    },
    {
      "Time_Start": 384.85999999999996,
      "Time_End": 388.94,
      "Text": " the participants at the top, and then I'm going to walk through each one of the four"
    },
    {
      "Time_Start": 388.94,
      "Time_End": 393.82,
      "Text": " Cs, data plane, identity, things like that. So, we had an IP address that we were tracking"
    },
    {
      "Time_Start": 393.82,
      "Time_End": 398.26,
      "Text": " that was interacting with a ton of tenants. And what it basically did is it loaded a bunch"
    },
    {
      "Time_Start": 398.26,
      "Time_End": 405.5,
      "Text": " of stolen AWS keys on this specific piece of infrastructure, and it took those AWS keys"
    },
    {
      "Time_Start": 405.5,
      "Time_End": 410.21999999999997,
      "Text": " and started talking to these victim cloud service provider environments. Specifically,"
    },
    {
      "Time_Start": 410.21999999999997,
      "Time_End": 414.74,
      "Text": " it was saying I was performing some control plane API calls, and those are get caller"
    },
    {
      "Time_Start": 414.74,
      "Time_End": 420.14,
      "Text": " identity and get SMS attributes and get SMS sandbox status. And what that basically was"
    },
    {
      "Time_Start": 420.14,
      "Time_End": 425.74,
      "Text": " checking was given this AWS key, can I start sending text messages through the Amazon simple"
    },
    {
      "Time_Start": 425.74,
      "Time_End": 430.14,
      "Text": " notification service? And if it can, it went back to that attacker so they can carry out"
    },
    {
      "Time_Start": 430.14,
      "Time_End": 434.42,
      "Text": " the next part of their attack. So, there's a detection opportunity right there. The next"
    },
    {
      "Time_Start": 434.42,
      "Time_End": 440.22,
      "Text": " part of the attack included using a lot of those access keys to go and issue a data plane"
    },
    {
      "Time_Start": 440.22,
      "Time_End": 444.38,
      "Text": " event, which is send the text messages. So, a lot of these customers and a lot of these"
    },
    {
      "Time_Start": 444.38,
      "Time_End": 448.94,
      "Text": " honeypots that we had set up did not have text messaging through SNS enabled, and so"
    },
    {
      "Time_Start": 448.94,
      "Time_End": 454.06,
      "Text": " we saw a spike of data plane events specifically to go and target phishing victims on the right."
    },
    {
      "Time_Start": 454.38,
      "Time_End": 459.1,
      "Text": " What was interesting about this one is that the same infrastructure that was interacting"
    },
    {
      "Time_Start": 459.1,
      "Time_End": 463.18,
      "Text": " with these victim AWS environments was the same infrastructure that was hosting the phishing"
    },
    {
      "Time_Start": 463.18,
      "Time_End": 466.78000000000003,
      "Text": " website. So, this is kind of like a larger interesting detection opportunity where if"
    },
    {
      "Time_Start": 466.78000000000003,
      "Time_End": 471.66,
      "Text": " you see a spike of this traffic, and it's coming from an IP address and it's issuing a ton of data"
    },
    {
      "Time_Start": 471.66,
      "Time_End": 476.22,
      "Text": " plane events, you can actually pivot on that IP address and find associated phishing website."
    },
    {
      "Time_Start": 476.22,
      "Time_End": 481.34000000000003,
      "Text": " So, we thought that was kind of cool. But this is sleuth con. How the heck did this happen in"
    },
    {
      "Time_Start": 481.34000000000003,
      "Time_End": 485.98,
      "Text": " the first place? So, let's go sleuthing a little bit. So, really, the economy behind this initial"
    },
    {
      "Time_Start": 485.98,
      "Time_End": 491.58000000000004,
      "Text": " access for the stolen keys kind of boils down to this. An attacker will go and scan the internet,"
    },
    {
      "Time_Start": 491.58000000000004,
      "Time_End": 495.82000000000005,
      "Text": " they'll look for code repos, environment files, they'll look for blob storage devices,"
    },
    {
      "Time_Start": 495.82000000000005,
      "Time_End": 500.06000000000006,
      "Text": " and they're basically grepping out different types of access keys. And from those access keys,"
    },
    {
      "Time_Start": 500.06000000000006,
      "Time_End": 504.22,
      "Text": " then they can leverage that to go and attack these environments. And then the question becomes,"
    },
    {
      "Time_Start": 504.22,
      "Time_End": 508.62,
      "Text": " like, is this working? You can go on GrayNoise right now, go and look at their env crawler tag,"
    },
    {
      "Time_Start": 508.62,
      "Time_End": 513.34,
      "Text": " and you'll notice that even just over the last month, you'll see a bunch of internet activity"
    },
    {
      "Time_Start": 513.34,
      "Time_End": 516.86,
      "Text": " just scanning for these environment files. If you notice at the bottom two, they're also"
    },
    {
      "Time_Start": 516.86,
      "Time_End": 522.22,
      "Text": " leveraging a couple of vulnerabilities. And so, maybe it's not misconfigured to expose an"
    },
    {
      "Time_Start": 522.22,
      "Time_End": 526.22,
      "Text": " environment file, but it is misconfigured in the sense that it has a vulnerability. And so,"
    },
    {
      "Time_Start": 526.22,
      "Time_End": 531.74,
      "Text": " they can jump on there and pull those access keys from those files. Let's go sleuthing even more. Go"
    },
    {
      "Time_Start": 531.74,
      "Time_End": 537.1,
      "Text": " on Telegram. If anyone has a Telegram account, if you'd like, type in a bunch of cloud service"
    },
    {
      "Time_Start": 537.1,
      "Time_End": 543.4200000000001,
      "Text": " provider services. In this specific case, SES and SNS. You'll see all kinds of advertisements"
    },
    {
      "Time_Start": 543.4200000000001,
      "Time_End": 550.94,
      "Text": " for this type of access. Some things that are interesting, SNS is for SMS, SES is for email."
    },
    {
      "Time_Start": 550.94,
      "Time_End": 555.02,
      "Text": " So, instead of hijacking an email account, they're just going to hijack a cloud service provider"
    },
    {
      "Time_Start": 555.02,
      "Time_End": 558.78,
      "Text": " and a victim there, and they're going to use that to send out emails. You'll also notice that"
    },
    {
      "Time_Start": 558.78,
      "Time_End": 565.1,
      "Text": " there's 50,000, 100,000, and 500,000 quota. That's that sandbox account status that you saw earlier."
    },
    {
      "Time_Start": 565.1,
      "Time_End": 569.26,
      "Text": " Basically, breaking out of that sandbox and saying, I'm no longer a dev. I'm going to spend"
    },
    {
      "Time_Start": 569.26,
      "Time_End": 573.58,
      "Text": " money on you, Amazon. I'm going to send this a bunch of email. I'm going to send a bunch of text"
    },
    {
      "Time_Start": 573.58,
      "Time_End": 579.02,
      "Text": " messages. And they now have really reliable, trusted infrastructure for these campaigns."
    },
    {
      "Time_Start": 579.58,
      "Time_End": 584.62,
      "Text": " So, that's one of them. And a lot of these dev misconfigurations, they lead to these long-lived"
    },
    {
      "Time_Start": 584.62,
      "Time_End": 588.86,
      "Text": " access keys, but that's targeting the machine. That machine identity I was talking about earlier."
    },
    {
      "Time_Start": 588.86,
      "Time_End": 594.5400000000001,
      "Text": " How about targeting devs directly? Is there any payoff if you can target them directly to get"
    },
    {
      "Time_Start": 594.54,
      "Time_End": 597.98,
      "Text": " access keys? Because that's what devs use. They use that to interact with the cloud."
    },
    {
      "Time_Start": 598.9399999999999,
      "Time_End": 603.42,
      "Text": " And so, you know, this is a tweet from a few years ago. Super interesting campaign. We're"
    },
    {
      "Time_Start": 603.42,
      "Time_End": 608.2199999999999,
      "Text": " basically a popular Python library and a popular PHP library. We're compromised. Three million"
    },
    {
      "Time_Start": 608.2199999999999,
      "Time_End": 613.0999999999999,
      "Text": " users combined. And the malicious code was basically enumerating environment variables"
    },
    {
      "Time_Start": 613.0999999999999,
      "Time_End": 618.78,
      "Text": " and sending it to a Heroku app. Nothing here specifically, well, they said AWS, but if you"
    },
    {
      "Time_Start": 618.78,
      "Time_End": 623.0999999999999,
      "Text": " go and you look at some of the malware. So, for example, this was the malware in that backdoor"
    },
    {
      "Time_Start": 623.58,
      "Time_End": 627.98,
      "Text": " package. Enumerate the environment and send it off to this Heroku app. Nothing here that kind of"
    },
    {
      "Time_Start": 627.98,
      "Time_End": 632.62,
      "Text": " indicates this is targeting the cloud. But if you go and look at the PHP version, right there in the"
    },
    {
      "Time_Start": 632.62,
      "Time_End": 637.66,
      "Text": " middle, I think 4748, it's specifically targeting those access keys and specifically targeting"
    },
    {
      "Time_Start": 637.66,
      "Time_End": 643.26,
      "Text": " those secret keys going to that same Heroku app. So, pull up the sequence diagram. The basic premise"
    },
    {
      "Time_Start": 643.26,
      "Time_End": 646.86,
      "Text": " behind this is that someone's compromising a developer account that holds these popular"
    },
    {
      "Time_Start": 646.86,
      "Time_End": 651.34,
      "Text": " packages. And then you're shimming in your legitimate or your malware code. You're then"
    },
    {
      "Time_Start": 651.34,
      "Time_End": 656.46,
      "Text": " uploading that to a registry like PyPI. And then you're waiting for someone to either run it on"
    },
    {
      "Time_Start": 656.46,
      "Time_End": 661.26,
      "Text": " their laptop or run it in prod or staging or a build environment. And then that's when it gets"
    },
    {
      "Time_Start": 661.26,
      "Time_End": 666.3000000000001,
      "Text": " downloaded. Whether it's on any of those environments, it's now enumerating secrets. It's"
    },
    {
      "Time_Start": 666.3000000000001,
      "Time_End": 670.94,
      "Text": " taking those and it's bringing those back to that attacker controlled infrastructure. But again,"
    },
    {
      "Time_Start": 670.94,
      "Time_End": 676.14,
      "Text": " this is SleuthCon. How did this initial access happen in the first place? So, let's go sleuthing."
    },
    {
      "Time_Start": 676.14,
      "Time_End": 680.38,
      "Text": " So, this is a screenshot of an actor named John Malkovich who eventually became EvilProxy."
    },
    {
      "Time_Start": 681.1,
      "Time_End": 685.18,
      "Text": " And this post was four years ago. But basically, they're advertising their phishing kit."
    },
    {
      "Time_Start": 685.82,
      "Time_End": 689.9,
      "Text": " I've done phishing research for years. And this was the first time, if you see the red box at"
    },
    {
      "Time_Start": 689.9,
      "Time_End": 695.5,
      "Text": " the bottom there, I've ever seen templates for registries. So, this is the victimology of this"
    },
    {
      "Time_Start": 695.5,
      "Time_End": 701.42,
      "Text": " is really somebody who's a developer. That was years ago. You know, recently, if you kind of"
    },
    {
      "Time_Start": 701.42,
      "Time_End": 706.62,
      "Text": " search for these things, you'll notice other actors talking about access they have to different"
    },
    {
      "Time_Start": 706.62,
      "Time_End": 712.22,
      "Text": " rats and different botnets. And this particular one was saying that, hey, we get to these"
    },
    {
      "Time_Start": 712.22,
      "Time_End": 718.38,
      "Text": " different installs through compromised apps. Or sorry, compromised packages. So, on PyPI and"
    },
    {
      "Time_Start": 718.38,
      "Time_End": 722.54,
      "Text": " Golang and things like that. They made a post afterwards kind of describing a little bit more."
    },
    {
      "Time_Start": 722.54,
      "Time_End": 727.26,
      "Text": " You can read it top to bottom. Basically, anything that you can see on the registries, how many"
    },
    {
      "Time_Start": 727.26,
      "Time_End": 733.1,
      "Text": " installs it has per day, where it's hosted and things like that. And so, they're constantly"
    },
    {
      "Time_Start": 733.1,
      "Time_End": 737.9,
      "Text": " thinking about how can I get access to these popular packages so I can shim in malware and"
    },
    {
      "Time_Start": 737.9,
      "Time_End": 742.14,
      "Text": " then get installs on it. If you read the end, they're talking a little bit about they're interested"
    },
    {
      "Time_Start": 742.14,
      "Time_End": 746.3000000000001,
      "Text": " in a victim set targeting like crypto wallets. And I would say there's probably a Venn diagram"
    },
    {
      "Time_Start": 746.3000000000001,
      "Time_End": 750.94,
      "Text": " between developers and crypto holders. But it's still kind of interesting to note that is this"
    },
    {
      "Time_Start": 750.94,
      "Time_End": 757.6600000000001,
      "Text": " are they targeting the cloud? Maybe. But at the same time, like this is the evolution that"
    },
    {
      "Time_Start": 757.6600000000001,
      "Time_End": 762.46,
      "Text": " I've personally seen where you target, you know, folks that hold crypto and then you realize the"
    },
    {
      "Time_Start": 762.46,
      "Time_End": 766.94,
      "Text": " payouts higher if you target companies themselves. So, I thought that was a pretty interesting"
    },
    {
      "Time_Start": 766.94,
      "Time_End": 772.62,
      "Text": " finding here. So, I talked a lot about like cloud is like an ancillary target. But we're starting to"
    },
    {
      "Time_Start": 772.62,
      "Time_End": 775.6600000000001,
      "Text": " see a lot more. And I know a lot of folks here are seeing this too because I've had a lot of great"
    },
    {
      "Time_Start": 775.6600000000001,
      "Time_End": 780.0600000000001,
      "Text": " conversations already where cloud is the primary target. It's the thing that they want to get"
    },
    {
      "Time_Start": 780.0600000000001,
      "Time_End": 784.3000000000001,
      "Text": " access to because they want to do something to the firm that runs that. And so, I can't really"
    },
    {
      "Time_Start": 784.3000000000001,
      "Time_End": 789.5,
      "Text": " talk about this without talking about Scattered Spider or Muddled Libra. But this is an amazing"
    },
    {
      "Time_Start": 789.5,
      "Time_End": 794.62,
      "Text": " blog post by Margaret Zimmerman over at Unit 42 that basically talked about Scattered Spider's"
    },
    {
      "Time_Start": 794.62,
      "Time_End": 798.46,
      "Text": " evolution to the cloud and all the associated TTPs with it. So, they're showing that they're"
    },
    {
      "Time_Start": 798.46,
      "Time_End": 803.02,
      "Text": " learning how to navigate within these environments. And they're doing cross cloud too, which is also"
    },
    {
      "Time_Start": 803.02,
      "Time_End": 807.1,
      "Text": " interesting. I'm not going to model everything that happens during an intrusion because I want"
    },
    {
      "Time_Start": 807.1,
      "Time_End": 811.9,
      "Text": " to hone in on something specific. But the basic premise behind it, and I'm sure a lot of people"
    },
    {
      "Time_Start": 811.9,
      "Time_End": 816.62,
      "Text": " here know, when you get into a cloud environment, it's somebody that has privileged access to it."
    },
    {
      "Time_Start": 816.94,
      "Time_End": 821.42,
      "Text": " Who is that usually? Either an IT person or a developer, right? So, they'll socially engineer"
    },
    {
      "Time_Start": 821.42,
      "Time_End": 826.7,
      "Text": " them. They'll achieve some type of session cookie steal, or they'll add some secondary MFA."
    },
    {
      "Time_Start": 826.7,
      "Time_End": 831.58,
      "Text": " They pivot into the cloud service provider. They set up persistence. It's not just adding things"
    },
    {
      "Time_Start": 831.58,
      "Time_End": 836.54,
      "Text": " like a user, but they're doing things like setting up rogue identity providers and tenants,"
    },
    {
      "Time_Start": 836.54,
      "Time_End": 840.62,
      "Text": " and they're using that to pivot back in. And then they're literally just enumerating as much as they"
    },
    {
      "Time_Start": 840.62,
      "Time_End": 845.1800000000001,
      "Text": " can. And they're looking for a few things. They're looking for secrets, and they're looking for"
    },
    {
      "Time_Start": 845.1800000000001,
      "Time_End": 850.86,
      "Text": " intellectual property, and then they exfiltrate that. And so, again, I'm interested in this part."
    },
    {
      "Time_Start": 850.86,
      "Time_End": 854.46,
      "Text": " How are these actors talking about this? Why are they interested in this specific thing?"
    },
    {
      "Time_Start": 855.5000000000001,
      "Time_End": 862.7,
      "Text": " And so, I have a screenshot from a supposed Alfie Black Hat actor here. I had to gray out a lot to"
    },
    {
      "Time_Start": 862.7,
      "Time_End": 866.94,
      "Text": " make it safe for work. This was an interesting threat on Xplate where they were basically"
    },
    {
      "Time_Start": 866.94,
      "Time_End": 872.94,
      "Text": " arguing with LockBit. This was right before the Black Hat takedown and the LockBit takedown. But"
    },
    {
      "Time_Start": 873.0200000000001,
      "Time_End": 878.22,
      "Text": " the interesting part is right there in the red box where they basically say exfil is the only"
    },
    {
      "Time_Start": 878.22,
      "Time_End": 882.7,
      "Text": " thing that actually matters. So, it's kind of moving away from double extortion where they're"
    },
    {
      "Time_Start": 882.7,
      "Time_End": 887.1800000000001,
      "Text": " ransoming a company, and they're kind of really focusing on taking something from that company."
    },
    {
      "Time_Start": 887.1800000000001,
      "Time_End": 890.46,
      "Text": " Another interesting note, too, you'll see the big screenshot right there. The way they prove"
    },
    {
      "Time_Start": 890.46,
      "Time_End": 894.22,
      "Text": " they're in Black Hat is they said they were the one that submitted the Meridian Link SEC complaints."
    },
    {
      "Time_Start": 894.86,
      "Time_End": 899.34,
      "Text": " And so, that's their proof right there. Really fascinating threat if you kind of want to see"
    },
    {
      "Time_Start": 900.3000000000001,
      "Time_End": 905.1,
      "Text": " people bickering. It's almost like trash TV. You can't stop watching it. You like watching"
    },
    {
      "Time_Start": 905.1,
      "Time_End": 909.98,
      "Text": " these Jersey housewives argue. But this is where you can glean a lot of that intel, right? I think"
    },
    {
      "Time_Start": 909.98,
      "Time_End": 914.38,
      "Text": " I was having that conversation with John earlier. Once they start infighting, all kinds of stuff"
    },
    {
      "Time_Start": 914.38,
      "Time_End": 920.5400000000001,
      "Text": " starts to come out. I can't really talk about cloud exfiltration without talking about Sisense."
    },
    {
      "Time_Start": 920.5400000000001,
      "Time_End": 925.58,
      "Text": " So, for those that are unfamiliar, a few months ago, SISA released an advisory that basically"
    },
    {
      "Time_Start": 925.58,
      "Time_End": 929.4200000000001,
      "Text": " said this business intelligence company, Sisense, was breached, and if you're a customer,"
    },
    {
      "Time_Start": 929.4200000000001,
      "Time_End": 935.34,
      "Text": " you should start really thinking about talking to them and rerolling a lot of your integrations with"
    },
    {
      "Time_Start": 935.34,
      "Time_End": 940.62,
      "Text": " them. Our good friend Brian Krebs had an expose on this whole thing. He had insiders that had"
    },
    {
      "Time_Start": 940.62,
      "Time_End": 944.94,
      "Text": " access to the breach data. So, I want to build that sequence diagram just based on what's on"
    },
    {
      "Time_Start": 944.94,
      "Time_End": 949.74,
      "Text": " this public information that Krebs posted because it still kind of shows people are really interested"
    },
    {
      "Time_Start": 949.74,
      "Time_End": 956.62,
      "Text": " in targeting the cloud. So, according to the article, there was a host of GitLab server that"
    },
    {
      "Time_Start": 956.62,
      "Time_End": 962.0600000000001,
      "Text": " was either misconfigured or vulnerable to something. Once that was discovered, the actor"
    },
    {
      "Time_Start": 962.0600000000001,
      "Time_End": 967.1,
      "Text": " performed some exploit, or they took advantage of the misconfiguration to download source code."
    },
    {
      "Time_Start": 967.1,
      "Time_End": 971.74,
      "Text": " Again, devs. They're targeting the devs and what the devs do. Within that source code,"
    },
    {
      "Time_Start": 972.38,
      "Time_End": 979.1800000000001,
      "Text": " they found AWS keys within that source code, and they used that to list the S3 buckets that Sisense"
    },
    {
      "Time_Start": 979.1800000000001,
      "Time_End": 986.46,
      "Text": " owns, and they found a backup, and they downloaded it. And the whole implication throughout this post"
    },
    {
      "Time_Start": 986.46,
      "Time_End": 990.46,
      "Text": " from Brian Krebs is that they were going to use that to pivot into customer environments."
    },
    {
      "Time_Start": 990.46,
      "Time_End": 995.4200000000001,
      "Text": " And so, I thought this was interesting, too, in the sense of they're not necessarily downloading"
    },
    {
      "Time_Start": 995.4200000000001,
      "Time_End": 999.1800000000001,
      "Text": " Sisense code, or at least that's not what the blog post said, but they definitely targeted"
    },
    {
      "Time_Start": 999.1800000000001,
      "Time_End": 1004.7800000000001,
      "Text": " another part of intellectual property that is their customers. And if you go and you look at"
    },
    {
      "Time_Start": 1004.78,
      "Time_End": 1011.8199999999999,
      "Text": " some of the emails that Sisense's CISO sent out, again, Krebs got a hold of this and posted it on"
    },
    {
      "Time_Start": 1011.8199999999999,
      "Time_End": 1017.02,
      "Text": " the blog, but I put red boxes around like the cloudy things. But if you kind of read everything"
    },
    {
      "Time_Start": 1017.02,
      "Time_End": 1021.8199999999999,
      "Text": " here, you can almost always associate it with the cloud, right? API secrets, Active Directory"
    },
    {
      "Time_Start": 1021.8199999999999,
      "Time_End": 1026.54,
      "Text": " integrations, and things like that. So, they wanted the secrets, and they want to use it almost in like"
    },
    {
      "Time_Start": 1026.54,
      "Time_End": 1033.1,
      "Text": " a 3CX-style supply chain attack to go and pivot into other environments. So, again, exfiltration"
    },
    {
      "Time_Start": 1033.1,
      "Time_End": 1037.1,
      "Text": " is really going to be a hotter topic. It's something I'm telling my detection teams to"
    },
    {
      "Time_Start": 1037.1,
      "Time_End": 1042.78,
      "Text": " really focus on, because this is such like a massive event that you can catch. But a lot of"
    },
    {
      "Time_Start": 1042.78,
      "Time_End": 1046.2199999999998,
      "Text": " the times when it comes to those detection opportunities in the cloud, it's kind of hard to"
    },
    {
      "Time_Start": 1046.2199999999998,
      "Time_End": 1053.02,
      "Text": " put it all together and then start detecting it and then stopping it. I can't talk about"
    },
    {
      "Time_Start": 1053.02,
      "Time_End": 1059.26,
      "Text": " cloud threat actors without talking about these guys, Team TNT. So, Team TNT was a group that"
    },
    {
      "Time_Start": 1059.26,
      "Time_End": 1063.82,
      "Text": " kind of emerged on the scene in 2019. This is their Malpedia page. What made them interesting"
    },
    {
      "Time_Start": 1063.82,
      "Time_End": 1068.22,
      "Text": " is they're targeting cloud-native technologies, that cluster and container component I talked"
    },
    {
      "Time_Start": 1068.22,
      "Time_End": 1073.82,
      "Text": " about within the four Cs, specifically looking at Kubernetes, deploying malicious containers that"
    },
    {
      "Time_Start": 1073.82,
      "Time_End": 1078.7,
      "Text": " they uploaded to Docker Hub, Docker itself. They did the boring stuff like deployed a crypto miner,"
    },
    {
      "Time_Start": 1078.7,
      "Time_End": 1082.86,
      "Text": " but what kind of made them interesting is how they did their targeting and how they pivoted"
    },
    {
      "Time_Start": 1082.8600000000001,
      "Time_End": 1089.3400000000001,
      "Text": " into cloud environments afterwards. And so, the interesting part with this group, too,"
    },
    {
      "Time_Start": 1089.3400000000001,
      "Time_End": 1094.38,
      "Text": " is that the main person tweeted all the time all kinds of things that they were doing. So,"
    },
    {
      "Time_Start": 1094.38,
      "Time_End": 1099.2600000000002,
      "Text": " Hildegard, that's their Twitter. They still have it up. Notice that they're just like talking smack"
    },
    {
      "Time_Start": 1099.2600000000002,
      "Time_End": 1104.38,
      "Text": " that they got into a customer environment or just a cloud environment in general. They also"
    },
    {
      "Time_Start": 1106.0600000000002,
      "Time_End": 1110.94,
      "Text": " would go after like researcher firms, like this is Cato Security, talking about things they found"
    },
    {
      "Time_Start": 1110.94,
      "Time_End": 1116.7,
      "Text": " related to Hildegard and Team TNT's tooling. So, this is just him, again, bragging and engaging"
    },
    {
      "Time_Start": 1116.7,
      "Time_End": 1122.8600000000001,
      "Text": " with the community. So, it was a really fun time really interacting with Hildegard. The problem,"
    },
    {
      "Time_Start": 1123.42,
      "Time_End": 1127.9,
      "Text": " if you look on the right there, is they retired. And so, one of the first publicly reported"
    },
    {
      "Time_Start": 1127.9,
      "Time_End": 1133.18,
      "Text": " cloud threat actor groups that showed expertise in these environments. Hildegard is likely the"
    },
    {
      "Time_Start": 1133.18,
      "Time_End": 1137.98,
      "Text": " main actor of the group, but announced leaving the scene in late 2021. And one thing when they"
    },
    {
      "Time_Start": 1137.98,
      "Time_End": 1143.9,
      "Text": " left the scene is that they took their tooling and they leaked it. And so, since 2021, since that"
    },
    {
      "Time_Start": 1143.9,
      "Time_End": 1150.06,
      "Text": " leak, at least at Datadog, we've seen all kinds of stuff both in Honeypots as well as some of"
    },
    {
      "Time_Start": 1150.06,
      "Time_End": 1155.98,
      "Text": " our engagements where we're finding code reuse. We're finding a lot of Hildegard and Team TNT's"
    },
    {
      "Time_Start": 1155.98,
      "Time_End": 1162.8600000000001,
      "Text": " tooling. And so, I wanted to highlight a specific campaign we saw from Team TNT where we had an IP"
    },
    {
      "Time_Start": 1162.8600000000001,
      "Time_End": 1167.66,
      "Text": " address at the top, the command and control server, hitting our Honeypot, trying to get into"
    },
    {
      "Time_Start": 1167.66,
      "Time_End": 1172.7800000000002,
      "Text": " our cloud and trying to pivot to other victim environments, both with those exposed Kubernetes"
    },
    {
      "Time_Start": 1172.7800000000002,
      "Time_End": 1177.0200000000002,
      "Text": " and Docker APIs. Basically, the tooling would reach out, it would check to see if we had a"
    },
    {
      "Time_Start": 1177.0200000000002,
      "Time_End": 1182.22,
      "Text": " vulnerably configured Docker API, and it would do a bunch of stuff, such as it would create a"
    },
    {
      "Time_Start": 1182.22,
      "Time_End": 1186.94,
      "Text": " container, it would try to break out of that container, it would try to set up persistence"
    },
    {
      "Time_Start": 1186.94,
      "Time_End": 1192.46,
      "Text": " via all kinds of methods, including cron jobs. It tried to steal the AWS keys that we had as"
    },
    {
      "Time_Start": 1192.46,
      "Time_End": 1199.18,
      "Text": " a canary on that Honeypot, and it would try to interact with those AWS keys. Afterwards, in like"
    },
    {
      "Time_Start": 1199.18,
      "Time_End": 1206.3,
      "Text": " a wormy type of fashion, it would use that same machine that it tried to compromise to go and do"
    },
    {
      "Time_Start": 1206.3,
      "Time_End": 1210.78,
      "Text": " more scanning of the internet, more ways to kind of add things to the cloud, and then it kinds of"
    },
    {
      "Time_Start": 1210.78,
      "Time_End": 1217.42,
      "Text": " ended up in the crypto miner. But again, this is SleuthCon. Let's take a look at this. Specifically,"
    },
    {
      "Time_Start": 1217.98,
      "Time_End": 1223.1000000000001,
      "Text": " there are cron jobs that we know are uploading to a very specific endpoint at this IP address."
    },
    {
      "Time_Start": 1223.8200000000002,
      "Time_End": 1228.46,
      "Text": " Well, we as curious observers decided to access that upload API, and it was misconfigured. I think"
    },
    {
      "Time_Start": 1228.46,
      "Time_End": 1233.18,
      "Text": " they should probably watch this talk to learn a little bit more about securing the cloud. We"
    },
    {
      "Time_Start": 1233.18,
      "Time_End": 1238.8600000000001,
      "Text": " downloaded a bunch of their tooling, we downloaded their bash history, we downloaded just basically"
    },
    {
      "Time_Start": 1238.8600000000001,
      "Time_End": 1243.74,
      "Text": " everything they had on that C2 server, and then we noticed something in the bash history. We"
    },
    {
      "Time_Start": 1243.74,
      "Time_End": 1251.02,
      "Text": " specifically found a unique password. So, within the bash history, this is kind of a snippet of it."
    },
    {
      "Time_Start": 1251.02,
      "Time_End": 1255.9,
      "Text": " What this actor would do is they would access victim AWS keys. They would then load it into"
    },
    {
      "Time_Start": 1255.9,
      "Time_End": 1260.38,
      "Text": " the AWS CLI hosted locally on that command and control server. It would do a bunch of"
    },
    {
      "Time_Start": 1260.38,
      "Time_End": 1265.1,
      "Text": " persistence things like creating user login profiles, attaching user policies, basically"
    },
    {
      "Time_Start": 1265.1,
      "Time_End": 1269.34,
      "Text": " everything in persistence you can think of. But the one interesting part was right there."
    },
    {
      "Time_Start": 1269.98,
      "Time_End": 1277.1799999999998,
      "Text": " The password, erdnubble1704. I got really excited and my team was weirded out by me,"
    },
    {
      "Time_Start": 1277.1799999999998,
      "Time_End": 1282.54,
      "Text": " but I'm like, we get to do the best pivot and thread Intel passwords! And they're like, okay,"
    },
    {
      "Time_Start": 1282.54,
      "Time_End": 1287.82,
      "Text": " sounds good, Zach. So, I took it, and we put it in some breach databases, and we got some hits."
    },
    {
      "Time_Start": 1287.82,
      "Time_End": 1292.4599999999998,
      "Text": " It's like, okay, maybe, you know, we're not going to get full attribution, maybe this person's"
    },
    {
      "Time_Start": 1292.4599999999998,
      "Time_End": 1296.9399999999998,
      "Text": " kind of small, but at least we're starting to see some hits here. So, we got an email address,"
    },
    {
      "Time_Start": 1296.94,
      "Time_End": 1301.42,
      "Text": " which is great. That's another pivot that we're about to do in a second. We got an IP address,"
    },
    {
      "Time_Start": 1302.3,
      "Time_End": 1306.06,
      "Text": " and we realized that IP address was in Germany, and Hildegard speaks German."
    },
    {
      "Time_Start": 1306.78,
      "Time_End": 1311.98,
      "Text": " And we're like, okay, it's a little weird, but let's kind of keep going here. And so,"
    },
    {
      "Time_Start": 1311.98,
      "Time_End": 1317.26,
      "Text": " we took that email address and we got a name. From that name, we found social media profiles."
    },
    {
      "Time_Start": 1317.26,
      "Time_End": 1322.7,
      "Text": " From the social media profiles, we found one specific person from around 2020 to 2021 talking"
    },
    {
      "Time_Start": 1322.7,
      "Time_End": 1328.46,
      "Text": " about writing malware related to Team TNT as well as posting their screenshots. So, you know,"
    },
    {
      "Time_Start": 1328.46,
      "Time_End": 1333.1000000000001,
      "Text": " the question became, like, who is this, and is this Hildegard? And so, I reached out to my good"
    },
    {
      "Time_Start": 1333.1000000000001,
      "Time_End": 1339.9,
      "Text": " buddy Silas Cutler, who did a lot of work with Team TNT back in the day. He managed to find out"
    },
    {
      "Time_Start": 1339.9,
      "Time_End": 1344.06,
      "Text": " who he was, too. So, I asked him, is Hildegard's name blank? He's like, yeah, that's him. You found"
    },
    {
      "Time_Start": 1344.06,
      "Time_End": 1348.38,
      "Text": " him. And I said, okay, we have some hands-on keyboard activity in a honeypot. It used a very"
    },
    {
      "Time_Start": 1348.38,
      "Time_End": 1352.6200000000001,
      "Text": " specific password. He's like, oh, yeah, he does a lot by hand. So, Silas did all the hard work,"
    },
    {
      "Time_Start": 1352.6200000000001,
      "Time_End": 1358.38,
      "Text": " like, years ago. And so, specifically, 22 March 2021. He just wanted me to make sure everyone"
    },
    {
      "Time_Start": 1358.38,
      "Time_End": 1367.1000000000001,
      "Text": " knew that's when he found him. So, it really kind of came down to, like, he announced he left the"
    },
    {
      "Time_Start": 1367.1000000000001,
      "Time_End": 1371.9,
      "Text": " scene. Maybe he just got a little bit smart and still is doing what he was doing back then. He"
    },
    {
      "Time_Start": 1371.9,
      "Time_End": 1379.26,
      "Text": " just wasn't bragging. And so, you know, it is our assessment that Hildegard is continuing operations."
    },
    {
      "Time_Start": 1379.26,
      "Time_End": 1382.94,
      "Text": " We have hands-on keyboard activity with a unique password tied to his name, further uncovered by"
    },
    {
      "Time_Start": 1382.94,
      "Time_End": 1388.6200000000001,
      "Text": " other researchers who on separate occasions found his identity. And so, like a good analyst, we did"
    },
    {
      "Time_Start": 1388.6200000000001,
      "Time_End": 1394.38,
      "Text": " some analysis of competing hypothesis. Maybe other threat actors are using this password, either"
    },
    {
      "Time_Start": 1394.38,
      "Time_End": 1399.02,
      "Text": " through a collision or they knew it belonged to Hildegard. We didn't find anything of those"
    },
    {
      "Time_Start": 1399.1,
      "Time_End": 1403.66,
      "Text": " passwords within any of his tooling. It seems a little bit far-fetched. It's not a hunter two"
    },
    {
      "Time_Start": 1403.66,
      "Time_End": 1411.66,
      "Text": " password or a last pass. It's something where we can go and pivot and find very specific findings"
    },
    {
      "Time_Start": 1411.66,
      "Time_End": 1416.62,
      "Text": " in these breached databases. With the other competing hypothesis is, hey, maybe the tooling"
    },
    {
      "Time_Start": 1416.62,
      "Time_End": 1421.02,
      "Text": " that he had leaked by Hildegard contains his password. I have access to all that tooling."
    },
    {
      "Time_Start": 1422.06,
      "Time_End": 1426.62,
      "Text": " Luckily, we were there when he dropped that tooling and we found nothing related to this"
    },
    {
      "Time_Start": 1427.2600000000002,
      "Time_End": 1432.0600000000002,
      "Text": " password. And so, I did what anyone does, reach out to Hildegard on Twitter and ask"
    },
    {
      "Time_Start": 1432.0600000000002,
      "Time_End": 1434.3000000000002,
      "Text": " him if he's still around. He still hasn't DMed me back."
    },
    {
      "Time_Start": 1437.0200000000002,
      "Time_End": 1442.6200000000001,
      "Text": " So, that's basically the talk. I hope you all leave here today kind of understanding a little"
    },
    {
      "Time_Start": 1442.6200000000001,
      "Time_End": 1447.2600000000002,
      "Text": " bit more about the cloud. It's not just someone else's computer. It's about 237, according to"
    },
    {
      "Time_Start": 1447.2600000000002,
      "Time_End": 1452.7,
      "Text": " Google. Other things that you can do there. It's kind of hard to track everything that's going on"
    },
    {
      "Time_Start": 1453.42,
      "Time_End": 1457.42,
      "Text": " in terms of, like, where is something being attacked and what layers of the four Cs."
    },
    {
      "Time_Start": 1457.42,
      "Time_End": 1460.14,
      "Text": " But I hope you can kind of think about this a little bit more because"
    },
    {
      "Time_Start": 1460.8600000000001,
      "Time_End": 1464.22,
      "Text": " threat actors are definitely thinking about this more. And it's something that I"
    },
    {
      "Time_Start": 1464.22,
      "Time_End": 1472.6200000000001,
      "Text": " hope with this talk I brought to light. So, thank you."
    }
  ]
}