{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Jono. I'm a technical analyst with the PwC Threat Intelligence team. I'm very,"
    },
    {
      "Time_Start": 7.0,
      "Time_End": 12.44,
      "Text": " very grateful to the SleuthCon committee for having me here and for me being able to represent"
    },
    {
      "Time_Start": 12.44,
      "Time_End": 19.88,
      "Text": " my team's research. I cannot move slides, but I do know them, so it's all good. I always"
    },
    {
      "Time_Start": 19.88,
      "Time_End": 24.48,
      "Text": " take the opportunity with the introduction to kind of thank my team. They're so excellent."
    },
    {
      "Time_Start": 24.48,
      "Time_End": 29.04,
      "Text": " The PwC Threat Intel team is kind of like, I like to think of the world's best kept secret."
    },
    {
      "Time_Start": 29.04,
      "Time_End": 36.519999999999996,
      "Text": " Everyone in the team is amazing. My colleagues do an excellent job of tracking APTs and crimeware,"
    },
    {
      "Time_Start": 36.519999999999996,
      "Time_End": 40.76,
      "Text": " and you'll see a lot of that in the presentation. So I know some of you are watching online."
    },
    {
      "Time_Start": 40.76,
      "Time_End": 44.24,
      "Text": " Thanks for existing. You guys are excellent. And if you don't know anyone in the PwC Threat"
    },
    {
      "Time_Start": 44.24,
      "Time_End": 48.92,
      "Text": " Intel team, I'm more than happy to be the gateway drug. What we're going to talk about"
    },
    {
      "Time_Start": 48.92,
      "Time_End": 54.36,
      "Text": " in this talk, which you maybe will see at some point, is we're going to look at three"
    },
    {
      "Time_Start": 54.36,
      "Time_End": 59.84,
      "Text": " case studies from the Asia Pacific region in regards to ransomware. Ransomware in Asia,"
    },
    {
      "Time_Start": 59.84,
      "Time_End": 64.03999999999999,
      "Text": " we're also going to talk about just a little bit in terms of how it functions and why it's"
    },
    {
      "Time_Start": 64.03999999999999,
      "Time_End": 69.16,
      "Text": " a little bit different to that of the West. I will preface and say that I don't actually"
    },
    {
      "Time_Start": 69.16,
      "Time_End": 76.08,
      "Text": " live in Asia and I'm not native to Asia, but I have spoken to colleagues who are from there"
    },
    {
      "Time_Start": 76.08,
      "Time_End": 80.52,
      "Text": " and we're going to talk a little bit about how that works and why ransomware is so different"
    },
    {
      "Time_Start": 80.52,
      "Time_End": 86.64,
      "Text": " over there. Then we're going to use the case studies that I've got to effectively talk"
    },
    {
      "Time_Start": 86.64,
      "Time_End": 94.08,
      "Text": " through the TTPs used, including a very spicy actor that we found that is, we assess highly"
    },
    {
      "Time_Start": 94.08,
      "Time_End": 98.03999999999999,
      "Text": " likely to be a ransomware group that is based in Asia, and we can go through their entire"
    },
    {
      "Time_Start": 98.03999999999999,
      "Time_End": 102.32,
      "Text": " tool suite thanks to an open directory that they left out for us, which is very nice."
    },
    {
      "Time_Start": 102.32,
      "Time_End": 107.84,
      "Text": " This is going to be a very awkward presentation without any visualization. So imagine that"
    },
    {
      "Time_Start": 107.84,
      "Time_End": 117.80000000000001,
      "Text": " you can see a case study wherein a threat actor called White Veles, which is a threat"
    },
    {
      "Time_Start": 117.80000000000001,
      "Time_End": 122.52000000000001,
      "Text": " actor that we assess is highly likely based not in the Asia Pacific region, but based"
    },
    {
      "Time_Start": 122.52000000000001,
      "Time_End": 129.32,
      "Text": " in Eastern Europe. If anyone knows the malware X Matter, might ring a bell. This is a threat"
    },
    {
      "Time_Start": 129.32,
      "Time_End": 140.12,
      "Text": " actor that was found intruding on a threat actor in Asia. Sorry, an organization in Asia."
    },
    {
      "Time_Start": 140.12,
      "Time_End": 143.64,
      "Text": " For initial access, this is where the talk gets really interesting, and it would be so"
    },
    {
      "Time_Start": 143.64,
      "Time_End": 147.92,
      "Text": " much more interesting if you could see how interesting it was. You would see that the"
    },
    {
      "Time_Start": 147.92,
      "Time_End": 154.6,
      "Text": " threat actor managed to get in on three separate occasions across a period of a month. The"
    },
    {
      "Time_Start": 154.6,
      "Time_End": 161.12,
      "Text": " most interesting part is that the initial access of the initial access was a download"
    },
    {
      "Time_Start": 161.12,
      "Time_End": 168.04,
      "Text": " by an individual in the company of a cracked software called PTC Creo. Now, PTC Creo is"
    },
    {
      "Time_Start": 168.04,
      "Time_End": 175.4,
      "Text": " a like a software that you can use to kind of head up visualizations or just increase"
    },
    {
      "Time_Start": 175.4,
      "Time_End": 180.95999999999998,
      "Text": " visualization software. It is a visualization software. The cracked software included within"
    },
    {
      "Time_Start": 180.96,
      "Time_End": 187.56,
      "Text": " the README and the other files within the package, the .rel package, the same extension"
    },
    {
      "Time_Start": 187.56,
      "Time_End": 193.60000000000002,
      "Text": " as the ransomware that came a month later. Super spicy because it kind of indicates and"
    },
    {
      "Time_Start": 193.60000000000002,
      "Time_End": 199.4,
      "Text": " you would have to come up with a confidence assessment that either the threat actor placed"
    },
    {
      "Time_Start": 199.4,
      "Time_End": 203.56,
      "Text": " it there for someone to find, which is not like the threat actor to do before. We have"
    },
    {
      "Time_Start": 203.56,
      "Time_End": 206.84,
      "Text": " done a number of intrusions on this threat actor. We have seen nothing like that in the"
    },
    {
      "Time_Start": 206.84,
      "Time_End": 214.20000000000002,
      "Text": " past or that they employed an insider to potentially find the malicious software because"
    },
    {
      "Time_Start": 214.20000000000002,
      "Time_End": 218.44,
      "Text": " if you would have been able to see, you would have been able to see that they visited a"
    },
    {
      "Time_Start": 218.44,
      "Time_End": 225.36,
      "Text": " number of websites prior to the actual finding the actual software that they wanted. The"
    },
    {
      "Time_Start": 225.36,
      "Time_End": 229.56,
      "Text": " problem is that there is no connection between individual one, we'll call them individual"
    },
    {
      "Time_Start": 229.56,
      "Time_End": 236.44,
      "Text": " one, and individual two and individual three. Now, those two accounts, the latter two, are"
    },
    {
      "Time_Start": 236.44,
      "Time_End": 240.32,
      "Text": " individuals who were found, the accounts that were found to be used in the actual intrusion"
    },
    {
      "Time_Start": 240.32,
      "Time_End": 246.32,
      "Text": " a month later. The theory, or a theory, is that individual one was a shared account."
    },
    {
      "Time_Start": 246.32,
      "Time_End": 252.44,
      "Text": " We saw that individual one was able to effectively download, the threat actor was able to download"
    },
    {
      "Time_Start": 252.44,
      "Time_End": 256.44,
      "Text": " through individual one a bunch of key logging software, so we assessed it with a realistic"
    },
    {
      "Time_Start": 256.44,
      "Time_End": 260.44,
      "Text": " probability that actually they were able to see all of the credentials going in and out."
    },
    {
      "Time_Start": 260.44,
      "Time_End": 264.15999999999997,
      "Text": " Okay, Asia, it's bad. There's lots of ransomware, but not as much as there is in the West. And"
    },
    {
      "Time_Start": 264.16,
      "Time_End": 268.16,
      "Text": " the NCA and the FBI have either covered that or will cover that in about five minutes or"
    },
    {
      "Time_Start": 268.16,
      "Time_End": 274.04,
      "Text": " after lunch. Ransomware was bad, but it is not as bad as it was, again, thanks to the"
    },
    {
      "Time_Start": 274.04,
      "Time_End": 277.96000000000004,
      "Text": " NCA and the FBI. We've been through that. There are other actors in the region. We're"
    },
    {
      "Time_Start": 277.96000000000004,
      "Time_End": 282.8,
      "Text": " going to come on to WhiteDev173 in a little second. They are the threat actors that I"
    },
    {
      "Time_Start": 282.8,
      "Time_End": 288.24,
      "Text": " aforementioned that have the open directory involved. The case studies, again, White Veles"
    },
    {
      "Time_Start": 288.24,
      "Time_End": 291.16,
      "Text": " is the one we basically talked through without the slides, but we'll do a little bit of the"
    },
    {
      "Time_Start": 291.16,
      "Time_End": 297.40000000000003,
      "Text": " slides. The second case study is one that's based in, a threat actor we assessed is based"
    },
    {
      "Time_Start": 297.40000000000003,
      "Time_End": 301.16,
      "Text": " in the Asia Pacific region, which is kind of like a halfway house between White Veles"
    },
    {
      "Time_Start": 301.16,
      "Time_End": 305.36,
      "Text": " and WhiteDev173. It's interesting because they use the lock bit builder, but not lock"
    },
    {
      "Time_Start": 305.36,
      "Time_End": 309.44000000000005,
      "Text": " bit, but they do claim to be lock bit halfway through their intrusion and then don't have"
    },
    {
      "Time_Start": 309.44000000000005,
      "Time_End": 314.76000000000005,
      "Text": " a leak site or any exfiltration whatsoever, which is really interesting and weird. Okay,"
    },
    {
      "Time_Start": 314.76000000000005,
      "Time_End": 317.88,
      "Text": " Veles, there's the visualization I wanted you to see, and you're going to look at it"
    },
    {
      "Time_Start": 318.0,
      "Time_End": 323.04,
      "Text": " for a lot shorter period than I wanted you to at the time. I spent a lot of time on it."
    },
    {
      "Time_Start": 323.04,
      "Time_End": 327.56,
      "Text": " It's all good. This is what I was talking about, the individual one timeline. If I go"
    },
    {
      "Time_Start": 327.56,
      "Time_End": 332.48,
      "Text": " back, because I can do that, you can see individual one and individual two. There's like a question"
    },
    {
      "Time_Start": 332.48,
      "Time_End": 338.15999999999997,
      "Text": " mark there, and that's where we don't really know why it is that individual two logged"
    },
    {
      "Time_Start": 338.15999999999997,
      "Time_End": 346.08,
      "Text": " in a month later than individual one. We're just not sure why that is, but we assess with"
    },
    {
      "Time_Start": 346.08,
      "Time_End": 349.47999999999996,
      "Text": " a realistic probability that there was a key logger installed, and you can see that"
    },
    {
      "Time_Start": 349.47999999999996,
      "Time_End": 355.56,
      "Text": " on this slide from the timeline, that the threat actor essentially installed a bunch"
    },
    {
      "Time_Start": 355.56,
      "Time_End": 362.68,
      "Text": " of key logging software, a bunch of user data upload software, and then a month later they"
    },
    {
      "Time_Start": 362.68,
      "Time_End": 367.52,
      "Text": " return with a completely different account, so we assess with a realistic probability"
    },
    {
      "Time_Start": 367.52,
      "Time_End": 375.84,
      "Text": " that the threat actor basically used this weird PTC Creo software to effectively enter"
    },
    {
      "Time_Start": 375.88000000000005,
      "Time_End": 381.04,
      "Text": " into the environment, which as I said is super novel. It's just not something that you see"
    },
    {
      "Time_Start": 381.04,
      "Time_End": 385.92,
      "Text": " every day from a threat actor, particularly one as prolific as White Vela, someone that"
    },
    {
      "Time_Start": 385.92,
      "Time_End": 389.84000000000003,
      "Text": " so much of the industry has such a great handle on. It's just super rare to see, and it really"
    },
    {
      "Time_Start": 389.84000000000003,
      "Time_End": 397.12,
      "Text": " is only something we've seen them do whilst acting in the Asia Pacific. This is the part"
    },
    {
      "Time_Start": 397.12,
      "Time_End": 401.6,
      "Text": " I was mentioning. You can kind of see it. I always misjudge how easy it is to see things"
    },
    {
      "Time_Start": 401.6,
      "Time_End": 407.16,
      "Text": " on slides, but you can see the similarity between a legit cracked PTC Creo, let me say"
    },
    {
      "Time_Start": 407.16,
      "Time_End": 414.76000000000005,
      "Text": " that again, a legit cracked version of PTC Creo, and the White Vela's cracked PTC Creo."
    },
    {
      "Time_Start": 414.76000000000005,
      "Time_End": 419.3,
      "Text": " There are similarities. They basically just repackaged, it looks like, a malicious version"
    },
    {
      "Time_Start": 419.3,
      "Time_End": 423.92,
      "Text": " of PTC Creo, which is weird, and then made it more malicious, and the file extension"
    },
    {
      "Time_Start": 423.92,
      "Time_End": 428.72,
      "Text": " you can see underlined is the same file extension of the ransomware that we saw a month later,"
    },
    {
      "Time_Start": 428.72,
      "Time_End": 433.36,
      "Text": " which if that weren't the case, it'd be really spooky, but if you know, it wouldn't be anything"
    },
    {
      "Time_Start": 433.36,
      "Time_End": 438.68,
      "Text": " to look at, but if you know how ransomware configs are built, they're done at runtime"
    },
    {
      "Time_Start": 438.68,
      "Time_End": 444.40000000000003,
      "Text": " often, or they decide that the extension is loaded in before the ransomware is compiled,"
    },
    {
      "Time_Start": 444.40000000000003,
      "Time_End": 449.32000000000005,
      "Text": " so it looks like an executive decision. More questions than answers, but it's just one"
    },
    {
      "Time_Start": 449.32000000000005,
      "Time_End": 453.64000000000004,
      "Text": " of those case studies I wanted to highlight where we can clearly see a threat actor that"
    },
    {
      "Time_Start": 453.64,
      "Time_End": 459.64,
      "Text": " is quite prolific in Europe and the West, or targeting Europe and the West, has a completely"
    },
    {
      "Time_Start": 459.64,
      "Time_End": 466.64,
      "Text": " different tool set when it comes to Asia. I wanted to do this, threat intel is one of"
    },
    {
      "Time_Start": 466.64,
      "Time_End": 470.47999999999996,
      "Text": " those industries where we really love, not just the sound of our own voices, but we love"
    },
    {
      "Time_Start": 470.47999999999996,
      "Time_End": 475.96,
      "Text": " our work so much, and sometimes we don't do a good enough job of making it relevant for"
    },
    {
      "Time_Start": 475.96,
      "Time_End": 482.47999999999996,
      "Text": " other people, and I wanted to basically take the case studies and create a defender's retrospective"
    },
    {
      "Time_Start": 482.48,
      "Time_End": 487.0,
      "Text": " seeing what could have been done differently, not only because it's a cool thing to do,"
    },
    {
      "Time_Start": 487.0,
      "Time_End": 492.08000000000004,
      "Text": " but because you will see over the course of the case studies that there will be overlap"
    },
    {
      "Time_Start": 492.08000000000004,
      "Time_End": 497.20000000000005,
      "Text": " in defenses, so whilst the TTPs are unique, they're oftentimes like really quick wins"
    },
    {
      "Time_Start": 497.20000000000005,
      "Time_End": 502.76,
      "Text": " for defenses, and in this case, it's like no real difference. Network segmentation,"
    },
    {
      "Time_Start": 502.76,
      "Time_End": 507.52000000000004,
      "Text": " for example, to prevent users from being able to access more of the network than they otherwise"
    },
    {
      "Time_Start": 507.64000000000004,
      "Time_End": 514.64,
      "Text": " could have done, having allow and deny lists for different websites should kind of be a"
    },
    {
      "Time_Start": 515.52,
      "Time_End": 521.6,
      "Text": " thing that we all employ, in this case, because it allowed for a threat actor to get in, but"
    },
    {
      "Time_Start": 521.6,
      "Time_End": 525.48,
      "Text": " otherwise it's just a really basic thing to employ, and it's quite common here in the"
    },
    {
      "Time_Start": 525.48,
      "Time_End": 532.48,
      "Text": " West, less common in Asia to do so. MFA on remote access or remote services, or even"
    },
    {
      "Time_Start": 533.48,
      "Time_End": 539.5600000000001,
      "Text": " just RDP sessions in general, having MFA installed as much as possible on all accounts, but certainly"
    },
    {
      "Time_Start": 539.5600000000001,
      "Time_End": 545.44,
      "Text": " for remote sessions is something that is not as common as you see with user-based accounts"
    },
    {
      "Time_Start": 545.44,
      "Time_End": 550.84,
      "Text": " or rather like desktop accounts, and that's just a really quick win, and then also like"
    },
    {
      "Time_Start": 550.84,
      "Time_End": 557.84,
      "Text": " Exfil, I can say, because I saw it, the Exfil took place over a number of days. If you had"
    },
    {
      "Time_Start": 558.36,
      "Time_End": 563.84,
      "Text": " maybe like a network, like some network infrastructure in place or a network traffic monitor, you"
    },
    {
      "Time_Start": 563.84,
      "Time_End": 570.72,
      "Text": " would be able to see a bunch of traffic going out on port 22 or 80, especially because it's"
    },
    {
      "Time_Start": 570.72,
      "Time_End": 577.72,
      "Text": " so consistent. The Case Study 2 one, which is interesting in its own way because it involves"
    },
    {
      "Time_Start": 580.64,
      "Time_End": 585.4000000000001,
      "Text": " a threat actor based in the Asia-Pacific region. We assessed realistic probability just based"
    },
    {
      "Time_Start": 585.4,
      "Time_End": 589.92,
      "Text": " off of the fact that the contact email they were using, the contact data they were using"
    },
    {
      "Time_Start": 589.92,
      "Time_End": 596.92,
      "Text": " was based in CN. As you'll see with WhiteDev 173, I'm not here to make any political statements."
    },
    {
      "Time_Start": 597.92,
      "Time_End": 604.16,
      "Text": " I'm just here to give you the data, and everyone can do with that what you want. BlackTurtle"
    },
    {
      "Time_Start": 604.16,
      "Time_End": 609.8,
      "Text": " specifically went after Veeam servers first. That's an interesting thing to note because"
    },
    {
      "Time_Start": 609.8,
      "Time_End": 613.4,
      "Text": " oftentimes ransomware entities, at least from the observations that I've made whilst doing"
    },
    {
      "Time_Start": 613.4,
      "Time_End": 620.4,
      "Text": " instant response cases, has been that the threat actor will find Veeam eventually. In"
    },
    {
      "Time_Start": 620.48,
      "Time_End": 624.48,
      "Text": " this case, they gunned for the Veeam servers straight for backup."
    },
    {
      "Time_Start": 624.48,
      "Time_End": 631.48,
      "Text": " Now I spoke to individuals who worked alongside on the case based in Asia, and they made an"
    },
    {
      "Time_Start": 632.36,
      "Time_End": 636.0,
      "Text": " interesting point that I can't say is gospel, so I'll put realistic probability in front"
    },
    {
      "Time_Start": 636.0,
      "Time_End": 642.04,
      "Text": " of it so no one can hold me to account on anything that I'm about to say. In Asia, there's"
    },
    {
      "Time_Start": 642.04,
      "Time_End": 648.3199999999999,
      "Text": " a lot less of a focus on payment. They don't care so much. It's quite easy for them to"
    },
    {
      "Time_Start": 648.3199999999999,
      "Time_End": 653.1999999999999,
      "Text": " rebuild with the advent of cloud, so they don't take ransomware seriously. That's not"
    },
    {
      "Time_Start": 653.1999999999999,
      "Time_End": 658.04,
      "Text": " what I'm saying, but there's a definite trend towards we'll just rebuild after the fact."
    },
    {
      "Time_Start": 658.04,
      "Time_End": 662.4399999999999,
      "Text": " Even if they encrypt, we'll just rebuild. It's interesting with that knowledge in mind"
    },
    {
      "Time_Start": 662.4399999999999,
      "Time_End": 666.88,
      "Text": " or at least that anecdote in mind that the threat actor went immediately for Veeam and"
    },
    {
      "Time_Start": 667.0,
      "Time_End": 671.64,
      "Text": " then after that targeted other servers as well through proliferation. The encrypted"
    },
    {
      "Time_Start": 671.64,
      "Time_End": 678.64,
      "Text": " Veeam had an ESXI kind of leaning and then went to Windows after that, which again depends"
    },
    {
      "Time_Start": 679.24,
      "Time_End": 684.4,
      "Text": " on the cases you look at. It's less common. In terms of a defender's retrospective, although"
    },
    {
      "Time_Start": 684.4,
      "Time_End": 688.4,
      "Text": " there's some pretty images that I managed to get. There's some IOCs there as well if"
    },
    {
      "Time_Start": 688.4,
      "Time_End": 694.88,
      "Text": " you want to take a picture or just want to memorize some IOCs, some IPs, good luck. The"
    },
    {
      "Time_Start": 694.88,
      "Time_End": 700.82,
      "Text": " threat actor pretended to be LockBit. They ostensibly emailed the client or the victim"
    },
    {
      "Time_Start": 700.82,
      "Time_End": 707.82,
      "Text": " and said, we are LockBit. Here's our leak site. Please pay us now. They didn't exfiltrate"
    },
    {
      "Time_Start": 708.68,
      "Time_End": 714.88,
      "Text": " any data and immediately upon being questioned gave them the email to use, which is blackturtle"
    },
    {
      "Time_Start": 714.88,
      "Time_End": 720.44,
      "Text": " at sugo.cn, which was super interesting. The communications all took place in English,"
    },
    {
      "Time_Start": 720.44,
      "Time_End": 725.8000000000001,
      "Text": " which was also a weird development I think I would have expected given the victim and"
    },
    {
      "Time_Start": 725.8000000000001,
      "Time_End": 732.8000000000001,
      "Text": " given the nature of the threat actor that it would have been in Chinese, but it wasn't."
    },
    {
      "Time_Start": 733.0400000000001,
      "Time_End": 737.36,
      "Text": " The English communications was an interesting development. I've used the word interesting"
    },
    {
      "Time_Start": 737.36,
      "Time_End": 741.36,
      "Text": " a lot. I'm going to continue to use it. In terms of a defender's retrospective, again,"
    },
    {
      "Time_Start": 741.36,
      "Time_End": 747.44,
      "Text": " we can see some overlap there. Segmented network can prevent proliferation via one user having"
    },
    {
      "Time_Start": 747.44,
      "Time_End": 752.32,
      "Text": " access. I forgot to mention that, but you can read it, that the threat actor got in"
    },
    {
      "Time_Start": 752.32,
      "Time_End": 759.32,
      "Text": " via a FortiGate SSL VPN vulnerability, which what I didn't mention is that the victim was"
    },
    {
      "Time_Start": 759.6,
      "Time_End": 765.48,
      "Text": " told to patch this from a previous incident about four years ago, and they didn't. So"
    },
    {
      "Time_Start": 765.48,
      "Time_End": 770.1600000000001,
      "Text": " there were easy quick win fixes to prevent threat actors from getting into the environment"
    },
    {
      "Time_Start": 770.1600000000001,
      "Time_End": 776.6,
      "Text": " at all, let alone proliferating. I'm pretty sure that's all I want to say."
    },
    {
      "Time_Start": 776.64,
      "Time_End": 781.6800000000001,
      "Text": " Also, you know, things like MFA on accounts is a classic one. Making sure that passwords"
    },
    {
      "Time_Start": 781.6800000000001,
      "Time_End": 785.28,
      "Text": " are being rerolled is a super interesting one, and again, some of these are controversial"
    },
    {
      "Time_Start": 785.28,
      "Time_End": 788.5600000000001,
      "Text": " within the industry. I'm about to mention the MITRE ATT&CK framework in a little second,"
    },
    {
      "Time_Start": 788.5600000000001,
      "Time_End": 794.96,
      "Text": " which I know is going to cause some controversy, but some things are really quick wins and"
    },
    {
      "Time_Start": 794.96,
      "Time_End": 799.2,
      "Text": " shouldn't be controversial, i.e. patch your systems and constantly do vulnerability scanning"
    },
    {
      "Time_Start": 799.2,
      "Time_End": 804.48,
      "Text": " where possible. This one is not the juicy one. It's all juicy. It's all good intel,"
    },
    {
      "Time_Start": 804.48,
      "Time_End": 810.6,
      "Text": " and again, I really cannot stress enough how grateful I am for my colleagues and friends"
    },
    {
      "Time_Start": 810.6,
      "Time_End": 815.4,
      "Text": " across the world, across PwC, who have just provided all of this intel and helped create"
    },
    {
      "Time_Start": 815.4,
      "Time_End": 820.12,
      "Text": " and cobble this together, because this presentation would not be what it is without them, so a"
    },
    {
      "Time_Start": 820.12,
      "Time_End": 825.32,
      "Text": " huge shout out for the second time to my guys and gals over at PwC."
    },
    {
      "Time_Start": 825.32,
      "Time_End": 832.32,
      "Text": " WhiteDev 1073 is kind of a bit of a pride and joy of ours. We do quite constant, like,"
    },
    {
      "Time_Start": 833.32,
      "Time_End": 837.6800000000001,
      "Text": " scanning within the Asia-Pacific region for cool little snippets of stuff, and we found"
    },
    {
      "Time_Start": 837.6800000000001,
      "Time_End": 844.32,
      "Text": " an open directory that had port 18443 open that contained not just a whole suite of tools,"
    },
    {
      "Time_Start": 844.32,
      "Time_End": 851.32,
      "Text": " but most significantly the lock bit builder, and immediately, not alarm bells, but, like,"
    },
    {
      "Time_Start": 851.4000000000001,
      "Time_End": 855.72,
      "Text": " instantly immediately interesting, because even though we do see threat actors not based"
    },
    {
      "Time_Start": 855.72,
      "Time_End": 861.8800000000001,
      "Text": " in the Asia-Pacific host in Asia, it's not as common as you might think, or it's not"
    },
    {
      "Time_Start": 861.88,
      "Time_End": 867.32,
      "Text": " as common as I thought it was, and so immediately got to work looking at what we had found within"
    },
    {
      "Time_Start": 867.32,
      "Time_End": 874.16,
      "Text": " the directory, and what we found is, like, a whole suite of tools, and I thought the"
    },
    {
      "Time_Start": 874.16,
      "Time_End": 878.72,
      "Text": " best way to go about looking at it, both from an analysis perspective, but from a presentation"
    },
    {
      "Time_Start": 878.72,
      "Time_End": 884.2,
      "Text": " perspective as well, is to look at it from the MITRE ATT&CK framework, and I know that"
    },
    {
      "Time_Start": 884.2,
      "Time_End": 888.12,
      "Text": " the MITRE ATT&CK framework for some people in this industry is, you know, it is what"
    },
    {
      "Time_Start": 888.12,
      "Time_End": 894.16,
      "Text": " it is, it's a framework, but for this particular example, it works really, really well, because"
    },
    {
      "Time_Start": 894.16,
      "Time_End": 897.08,
      "Text": " I cannot explain to you every tool that's being used, and many of you will probably"
    },
    {
      "Time_Start": 897.08,
      "Time_End": 901.76,
      "Text": " recognize a lot of these tools, and some of them you might not. I thought it best to map"
    },
    {
      "Time_Start": 901.76,
      "Time_End": 905.76,
      "Text": " them to the MITRE ATT&CK framework so we can get an idea of how this threat actor operates"
    },
    {
      "Time_Start": 905.76,
      "Time_End": 911.84,
      "Text": " from recon all the way down to, you know, impact and XFIL and command and control. Did"
    },
    {
      "Time_Start": 911.84,
      "Time_End": 917.64,
      "Text": " that smoothly transition? It actually didn't. There you go. To command and control. And"
    },
    {
      "Time_Start": 917.64,
      "Time_End": 921.96,
      "Text": " we'll talk about some of these tools as we go. The recon initial access is always, for"
    },
    {
      "Time_Start": 921.96,
      "Time_End": 927.64,
      "Text": " me, the most interesting, because I'm going to spoil it for you, Cobalt Strike is used."
    },
    {
      "Time_Start": 927.64,
      "Time_End": 935.08,
      "Text": " The way it's used is quite novel, which is cool, but Cobalt Strike is, you know, I can't"
    },
    {
      "Time_Start": 935.08,
      "Time_End": 939.38,
      "Text": " talk about it for 30 minutes, but the recon initial access stuff is super interesting."
    },
    {
      "Time_Start": 939.38,
      "Time_End": 943.84,
      "Text": " It's the way, it's where we understand how a threat actor thinks about and where they"
    },
    {
      "Time_Start": 943.84,
      "Time_End": 948.96,
      "Text": " can develop entering into an environment. We see threat actors use credentials, we see"
    },
    {
      "Time_Start": 948.96,
      "Time_End": 953.88,
      "Text": " threat actors sometimes use phishing, although less so now, and sometimes we see them using"
    },
    {
      "Time_Start": 953.88,
      "Time_End": 959.2,
      "Text": " vulnerability scanning and then intrusion via some kind of, like, exploit that they"
    },
    {
      "Time_Start": 959.2,
      "Time_End": 965.84,
      "Text": " either find or develop themselves. In white dev 173 cases, which I know is not the sexiest"
    },
    {
      "Time_Start": 965.84,
      "Time_End": 971.6,
      "Text": " name, I know threat intel is quite famous for having weird and wonderful and wacky naming"
    },
    {
      "Time_Start": 971.6,
      "Time_End": 978.48,
      "Text": " conventions. We are currently in the process of doing an ACH, analysis of competing hypotheses."
    },
    {
      "Time_Start": 978.48,
      "Time_End": 981.88,
      "Text": " The reason it hasn't been done now is because I'm quite new to the states and was moving"
    },
    {
      "Time_Start": 981.88,
      "Time_End": 987.24,
      "Text": " over and it was a hassle. We're quite stringent in the team about how we do our naming conventions"
    },
    {
      "Time_Start": 987.24,
      "Time_End": 991.6800000000001,
      "Text": " and this was no exception. White dev 173, as I said, not the sexiest name, but it will"
    },
    {
      "Time_Start": 991.6800000000001,
      "Time_End": 995.84,
      "Text": " be changed to something a lot nicer once we get going."
    },
    {
      "Time_Start": 995.84,
      "Time_End": 999.84,
      "Text": " The initial access and recon is an interesting one, because they use tools that sometimes"
    },
    {
      "Time_Start": 999.84,
      "Time_End": 1007.12,
      "Text": " we've seen across our more western-based or rather not Asia-based actors, things like"
    },
    {
      "Time_Start": 1007.12,
      "Time_End": 1010.6,
      "Text": " web scan logic and volmap, which are readily available on GitHub."
    },
    {
      "Time_Start": 1010.6,
      "Time_End": 1020.76,
      "Text": " Xeon, XeonDXP and XeonDXP, these are tools that specifically target web platforms that"
    },
    {
      "Time_Start": 1020.76,
      "Time_End": 1025.56,
      "Text": " are written in Chinese language. I will say, I'm not going to say what's here on the slide,"
    },
    {
      "Time_Start": 1025.56,
      "Time_End": 1031.56,
      "Text": " but there is a bunch of TXT files that they use to kind of pump into these tools. The"
    },
    {
      "Time_Start": 1031.56,
      "Time_End": 1035.56,
      "Text": " targeting is interesting, and again, I'm not making political statements, I'm here to show"
    },
    {
      "Time_Start": 1035.56,
      "Time_End": 1041.56,
      "Text": " you what the data says. The IPs within their TXT files that they would use are based in"
    },
    {
      "Time_Start": 1041.56,
      "Time_End": 1049.56,
      "Text": " Korea, Taiwan, Iran, and mainland China. I don't know readily what that says about the"
    },
    {
      "Time_Start": 1049.56,
      "Time_End": 1055.56,
      "Text": " actor, I don't know what their handle is, particularly since I'm trying to see perhaps"
    },
    {
      "Time_Start": 1055.56,
      "Time_End": 1059.56,
      "Text": " if it's a raster-based target, rather than speaking of the state and the country. In"
    },
    {
      "Time_Start": 1059.56,
      "Time_End": 1065.48,
      "Text": " this case, people have brought raster targeting, but it's a case of white dev 173, which is"
    },
    {
      "Time_Start": 1065.48,
      "Time_End": 1071.48,
      "Text": " specifically focused on the Asian category in general. I mentioned Cobblestrike, the"
    },
    {
      "Time_Start": 1071.48,
      "Time_End": 1075.48,
      "Text": " proactor does use Cobblestrike, we found a very specific instance of it. In fact, the"
    },
    {
      "Time_Start": 1075.48,
      "Time_End": 1081.48,
      "Text": " proactor was kind enough to leave on their own directory to envolve, so you'll see them"
    },
    {
      "Time_Start": 1081.48,
      "Time_End": 1087.48,
      "Text": " test out the Cobblestrike instance two days prior to it going live. We actually found"
    },
    {
      "Time_Start": 1087.48,
      "Time_End": 1093.48,
      "Text": " that Cobblestrike instance before we found the group, through our online net gang, and"
    },
    {
      "Time_Start": 1093.48,
      "Time_End": 1097.48,
      "Text": " we basically put two and two together, but this was the group that was used in the server,"
    },
    {
      "Time_Start": 1097.48,
      "Time_End": 1101.48,
      "Text": " but we got to see that by testing success, we got to see that they set up their username"
    },
    {
      "Time_Start": 1101.48,
      "Time_End": 1107.48,
      "Text": " and passwords. We had four usernames, jhc, j, hannah, and neo. All of them shared the"
    },
    {
      "Time_Start": 1107.48,
      "Time_End": 1115.48,
      "Text": " same password convention, it was j, jhc, it was Matthew, at 123, j, it was j, at 123,"
    },
    {
      "Time_Start": 1115.48,
      "Time_End": 1121.48,
      "Text": " exclamation mark, and hannah, it was hannah, at 123, exclamation mark. We didn't get neos,"
    },
    {
      "Time_Start": 1121.48,
      "Time_End": 1125.48,
      "Text": " but we did see, and we assessed that the realistic probability probably followed the"
    },
    {
      "Time_Start": 1125.48,
      "Time_End": 1133.48,
      "Text": " same convention. They are all censoring the team server, which has a poor number of 12345s,"
    },
    {
      "Time_Start": 1133.48,
      "Time_End": 1141.48,
      "Text": " and a team server password of 12345, as well as every single IP that was successfully,"
    },
    {
      "Time_Start": 1141.48,
      "Time_End": 1146.48,
      "Text": " what's the word, successfully, and eventually accepted the team server is based in Hong"
    },
    {
      "Time_Start": 1147.48,
      "Time_End": 1152.48,
      "Text": " Kong. Of those five, three of them have the same 27 names."
    },
    {
      "Time_Start": 1153.48,
      "Time_End": 1159.48,
      "Text": " We did see, it wasn't in the slide, but we did see one other successful user,"
    },
    {
      "Time_Start": 1159.48,
      "Time_End": 1166.48,
      "Text": " the team server, by a name like brownflare, it was done from a team here in Hong Kong."
    },
    {
      "Time_Start": 1166.48,
      "Time_End": 1173.48,
      "Text": " I mean, it's a very simple model framework, you're supposed to use the dev team models,"
    },
    {
      "Time_Start": 1173.48,
      "Time_End": 1178.48,
      "Text": " right? You put the dev team models into the dev team models, it's really easy to use,"
    },
    {
      "Time_Start": 1178.48,
      "Time_End": 1182.48,
      "Text": " it has a really, like, easy tweak to use, but you can also use plug-in models,"
    },
    {
      "Time_Start": 1182.48,
      "Time_End": 1186.48,
      "Text": " and those are made via the, like, native public thread, I think, so, regressors,"
    },
    {
      "Time_Start": 1186.48,
      "Time_End": 1191.48,
      "Text": " and you'll be able to get .cna files, that is the regressor script, looks like that."
    },
    {
      "Time_Start": 1191.48,
      "Time_End": 1196.48,
      "Text": " Actually, one of those, one of those scripts is basically, like, Java, basically,"
    },
    {
      "Time_Start": 1196.48,
      "Time_End": 1201.48,
      "Text": " it's really easy to mix stuff, and then you can see, regularly how the thread actors"
    },
    {
      "Time_Start": 1201.48,
      "Time_End": 1206.48,
      "Text": " can use it to develop their own scripts. Now, why do I want to develop its own script?"
    },
    {
      "Time_Start": 1206.48,
      "Time_End": 1211.48,
      "Text": " I think the evidence is, plug-ins from Chinese developers, like LayDot,"
    },
    {
      "Time_Start": 1211.48,
      "Time_End": 1215.48,
      "Text": " might be famous within Chinese AT groups, and some client groups."
    },
    {
      "Time_Start": 1215.48,
      "Time_End": 1224.48,
      "Text": " Another one, CX, is a free, China-based, Chinese language script."
    },
    {
      "Time_Start": 1224.48,
      "Time_End": 1231.48,
      "Text": " In fact, CX is written entirely in Chinese, the CNA files are written with the Mandarin"
    },
    {
      "Time_Start": 1231.48,
      "Time_End": 1236.48,
      "Text": " Chinese language, but it's no longer available on GitHub, so you can take it down,"
    },
    {
      "Time_Start": 1236.48,
      "Time_End": 1243.48,
      "Text": " it bridges on, like, state-of-the-art security, new legislation, so we can only say,"
    },
    {
      "Time_Start": 1243.48,
      "Time_End": 1246.48,
      "Text": " with plug-ins, probably going to take to a highly likely confidence assessment,"
    },
    {
      "Time_Start": 1246.48,
      "Time_End": 1251.48,
      "Text": " they have the full GitHub repo, we can only make that assessment."
    },
    {
      "Time_Start": 1251.48,
      "Time_End": 1258.48,
      "Text": " Now, if you, basically, the CNA files, the CNA files are quite similar,"
    },
    {
      "Time_Start": 1258.48,
      "Time_End": 1265.48,
      "Text": " they do a very similar thing, they effectively have everything from privilege escalation"
    },
    {
      "Time_Start": 1265.48,
      "Time_End": 1271.48,
      "Text": " all the way down to, like, bypass, user creation, scheduled path creation, user deletion,"
    },
    {
      "Time_Start": 1271.48,
      "Time_End": 1273.48,
      "Text": " everything that you could want for Red Team."
    },
    {
      "Time_Start": 1273.48,
      "Time_End": 1278.48,
      "Text": " All of these tools are patched together in other Chinese language,"
    },
    {
      "Time_Start": 1278.48,
      "Time_End": 1287.48,
      "Text": " like LSTAR, or OneBox, and that's basically how they conduct most of their operations."
    },
    {
      "Time_Start": 1287.48,
      "Time_End": 1291.48,
      "Text": " There are some other tools that they use, they usually have their own scripts,"
    },
    {
      "Time_Start": 1291.48,
      "Time_End": 1295.48,
      "Text": " for some things, like bypassing, any ways to bypass, they have their own custom script,"
    },
    {
      "Time_Start": 1295.48,
      "Time_End": 1300.48,
      "Text": " I can't find anywhere else, which is interesting, but they do seem to be somewhat, again,"
    },
    {
      "Time_Start": 1300.48,
      "Time_End": 1302.48,
      "Text": " bastardized versions of what we see in OpenSource."
    },
    {
      "Time_Start": 1302.48,
      "Time_End": 1308.48,
      "Text": " So it's Frax that is capable of developing tools, it has some help, we can do so."
    },
    {
      "Time_Start": 1308.48,
      "Time_End": 1312.48,
      "Text": " The only other tools that we see on the instance are CD drivers."
    },
    {
      "Time_Start": 1312.48,
      "Time_End": 1314.48,
      "Text": " They're not normal or sexy, they're quite old."
    },
    {
      "Time_Start": 1318.48,
      "Time_End": 1323.48,
      "Text": " Which is Redux account vulnerability, if anyone knows that, it's basically like an in-and-out..."
    },
    {
      "Time_Start": 1323.48,
      "Time_End": 1324.48,
      "Text": " Have you ever heard of Redux?"
    },
    {
      "Time_Start": 1324.48,
      "Time_End": 1325.48,
      "Text": " No, I've never seen it."
    },
    {
      "Time_Start": 1325.48,
      "Time_End": 1326.48,
      "Text": " You've never heard of Redux?"
    },
    {
      "Time_Start": 1326.48,
      "Time_End": 1327.48,
      "Text": " No."
    },
    {
      "Time_Start": 1327.48,
      "Time_End": 1328.48,
      "Text": " Oh, thank you."
    },
    {
      "Time_Start": 1330.48,
      "Time_End": 1331.48,
      "Text": " Anyone else?"
    },
    {
      "Time_Start": 1331.48,
      "Time_End": 1333.48,
      "Text": " I don't actually know that you've ever heard of Redux."
    },
    {
      "Time_Start": 1333.48,
      "Time_End": 1334.48,
      "Text": " No, I've never seen it."
    },
    {
      "Time_Start": 1334.48,
      "Time_End": 1335.48,
      "Text": " It's basically like a..."
    },
    {
      "Time_Start": 1343.48,
      "Time_End": 1348.48,
      "Text": " It's a one-stop-shop rule, like Redux is, effectively, again, not developing tools themselves,"
    },
    {
      "Time_Start": 1348.48,
      "Time_End": 1353.48,
      "Text": " but they are, in some ways, using privilege escalation,"
    },
    {
      "Time_Start": 1355.48,
      "Time_End": 1357.48,
      "Text": " so the suite is really expensive."
    },
    {
      "Time_Start": 1359.48,
      "Time_End": 1364.48,
      "Text": " In terms of, I don't know how long I have, I'll just close up here,"
    },
    {
      "Time_Start": 1364.48,
      "Time_End": 1369.48,
      "Text": " because the other stuff, it's going to be much more useful,"
    },
    {
      "Time_Start": 1370.48,
      "Time_End": 1371.48,
      "Text": " on the slide."
    },
    {
      "Time_Start": 1372.48,
      "Time_End": 1375.48,
      "Text": " I'm not meaning, it should be easier to look at than have me talk to you."
    },
    {
      "Time_Start": 1376.48,
      "Time_End": 1383.48,
      "Text": " Again, defenses are something that will overlap with the other case studies that we looked at before."
    },
    {
      "Time_Start": 1383.48,
      "Time_End": 1389.48,
      "Text": " Stuff like MFA on account, both local and remote."
    },
    {
      "Time_Start": 1390.48,
      "Time_End": 1397.48,
      "Text": " Having user entity-based analytics, where this is a bit more sophisticated,"
    },
    {
      "Time_Start": 1397.48,
      "Time_End": 1399.48,
      "Text": " where you, effectively, have a nominal user,"
    },
    {
      "Time_Start": 1399.48,
      "Time_End": 1403.48,
      "Text": " and you can say, okay, the nominal user will conduct X amount of activities."
    },
    {
      "Time_Start": 1403.48,
      "Time_End": 1406.48,
      "Text": " Any users outside of that, we would like to flag to assault,"
    },
    {
      "Time_Start": 1406.48,
      "Time_End": 1408.48,
      "Text": " and we would like to immediately alert to stop on that."
    },
    {
      "Time_Start": 1408.48,
      "Time_End": 1411.48,
      "Text": " Now, that, for WhiteJet 1.33, would be really beneficial,"
    },
    {
      "Time_Start": 1411.48,
      "Time_End": 1415.48,
      "Text": " because a lot of their attack depends on them being able to create users,"
    },
    {
      "Time_Start": 1417.48,
      "Time_End": 1420.48,
      "Text": " and be able to use those new users to effectively,"
    },
    {
      "Time_Start": 1420.48,
      "Time_End": 1423.48,
      "Text": " let's say, take privileges and then bypass them immediately."
    },
    {
      "Time_Start": 1424.48,
      "Time_End": 1428.48,
      "Text": " I did put in the slide that it's going to be kind of useful to have,"
    },
    {
      "Time_Start": 1428.48,
      "Time_End": 1431.48,
      "Text": " it's had a role that isn't too extensive,"
    },
    {
      "Time_Start": 1431.48,
      "Time_End": 1435.48,
      "Text": " but then I also said a lot of the WhiteJet 1.33 have all bypassed that,"
    },
    {
      "Time_Start": 1435.48,
      "Time_End": 1437.48,
      "Text": " because they're able to effectively shut down AV."
    },
    {
      "Time_Start": 1437.48,
      "Time_End": 1441.48,
      "Text": " So, yes, extensive AV is always good, and it's a way to talk about practice,"
    },
    {
      "Time_Start": 1441.48,
      "Time_End": 1443.48,
      "Text": " especially if you're ensuring the market there,"
    },
    {
      "Time_Start": 1443.48,
      "Time_End": 1446.48,
      "Text": " but also, WhiteJet 1.33 might be able to do the same thing."
    },
    {
      "Time_Start": 1447.48,
      "Time_End": 1450.48,
      "Text": " I'm going to close off by saying that,"
    },
    {
      "Time_Start": 1450.48,
      "Time_End": 1453.48,
      "Text": " despite technical difficulties, this has been a really wonderful experience."
    },
    {
      "Time_Start": 1453.48,
      "Time_End": 1455.48,
      "Text": " Thank you very much for having me."
    },
    {
      "Time_Start": 1455.48,
      "Time_End": 1457.48,
      "Text": " Big thanks to the Snoop team."
    },
    {
      "Time_Start": 1457.48,
      "Time_End": 1459.48,
      "Text": " I hope you enjoy the rest of the day."
    },
    {
      "Time_Start": 1459.48,
      "Time_End": 1461.48,
      "Text": " Thank you very much."
    }
  ]
}