{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.6000000000000005,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I'm Carlos Borges. I'm from Brazil. I came straight from, you know, South America just"
    },
    {
      "Time_Start": 7.6000000000000005,
      "Time_End": 14.92,
      "Text": " for this event. And I'm an Intel analyst for Intel 471. Today, we'll speak... Let me see"
    },
    {
      "Time_Start": 14.92,
      "Time_End": 24.12,
      "Text": " if I can turn... Oh! Thank you! So, today we will talk about Basil Lord and the manuals"
    },
    {
      "Time_Start": 24.12,
      "Time_End": 34.08,
      "Text": " he crafted during his... The latest years to teach novice actors in getting into brain"
    },
    {
      "Time_Start": 34.08,
      "Time_End": 39.84,
      "Text": " server operations. So, the agenda today is not exactly linear, as you can see, but we"
    },
    {
      "Time_Start": 39.84,
      "Time_End": 45.32,
      "Text": " will cover some things like key events that led the actor to the publication and crafting"
    },
    {
      "Time_Start": 45.32,
      "Time_End": 51.2,
      "Text": " of those manuals. We will make an overview of those manuals to understand some interesting"
    },
    {
      "Time_Start": 51.2,
      "Time_End": 57.400000000000006,
      "Text": " and key concepts that he introduced there. We have a big timeline to cover. We will provide"
    },
    {
      "Time_Start": 57.400000000000006,
      "Time_End": 62.2,
      "Text": " some link analysis and crypto overview. I will disclose a few additional personas which"
    },
    {
      "Time_Start": 62.2,
      "Time_End": 72.36,
      "Text": " are not public, and we will talk about TTPs. Let's move it on. So, yes, this presentation"
    },
    {
      "Time_Start": 72.36,
      "Time_End": 79.68,
      "Text": " is a lot... Was a lot motivated by, you know, Operation Crumbs in February. One of the good"
    },
    {
      "Time_Start": 79.68,
      "Time_End": 86.52000000000001,
      "Text": " outcomes of the operation is that the US Department of Treasure announced two Russian"
    },
    {
      "Time_Start": 86.52000000000001,
      "Time_End": 93.72000000000001,
      "Text": " nationals and disclosed their identity and links with the LockBit gang. One of them is"
    },
    {
      "Time_Start": 93.72000000000001,
      "Time_End": 102.2,
      "Text": " Artur Sengetov, and the other one is, of course, our objective here, Ivan Kondratiev, aka Bastard"
    },
    {
      "Time_Start": 102.2,
      "Time_End": 108.36000000000001,
      "Text": " Lord. So, this is a big timeline to cover. Don't worry much about it. I will walk you"
    },
    {
      "Time_Start": 108.52,
      "Time_End": 116.52,
      "Text": " through some of the key events, so you can see, like, on the bottom right side, we are"
    },
    {
      "Time_Start": 116.52,
      "Time_End": 122.56,
      "Text": " on the end of the timeline, see about Operation Crumbs and the disclosure of his persona."
    },
    {
      "Time_Start": 122.56,
      "Time_End": 129.88,
      "Text": " However, we will take a look, you know, like since 2016. So, Bastard Lord, just a quick"
    },
    {
      "Time_Start": 129.88,
      "Time_End": 138.32,
      "Text": " introduction. So, he's an initial access broker. He's a reputable hands-on operation. He was"
    },
    {
      "Time_Start": 138.32,
      "Time_End": 147.07999999999998,
      "Text": " also a malware spammer. Those are a few of the public handles he used, so we have the"
    },
    {
      "Time_Start": 147.07999999999998,
      "Time_End": 153.48,
      "Text": " National Hazard Agents, which is a handle he used but also a reference to a cybercrack"
    },
    {
      "Time_Start": 153.48,
      "Time_End": 163.0,
      "Text": " game, The Actor Assemble. There's a Bastard Lord with one S, Fishy Eye, Buster, Alexo,"
    },
    {
      "Time_Start": 163.0,
      "Time_End": 172.2,
      "Text": " and Seener. Let's start with our timeline. According, you know, The Actor claimed this"
    },
    {
      "Time_Start": 172.2,
      "Time_End": 176.84,
      "Text": " in a lot of different sources which will be covered throughout the presentation. He said"
    },
    {
      "Time_Start": 176.84,
      "Time_End": 185.28,
      "Text": " that he started engaging in cybercrime between 2016 and 2018. At the time, he was engaging"
    },
    {
      "Time_Start": 185.28,
      "Time_End": 193.4,
      "Text": " with certain optimization, carding, and hacking websites. Then he got into 2019, The Actor"
    },
    {
      "Time_Start": 193.4,
      "Time_End": 201.84,
      "Text": " joined the XSS forum, and there he was already engaging with malware spamming campaigns."
    },
    {
      "Time_Start": 201.84,
      "Time_End": 210.68,
      "Text": " By the end of that year, like the fourth quarter of 2019, The Actor joined Lelartus, I guess"
    },
    {
      "Time_Start": 210.68,
      "Time_End": 217.24,
      "Text": " as most of you know he's a reputable affiliate, and Lelartus was a sort of mentor who teached"
    },
    {
      "Time_Start": 217.24,
      "Time_End": 224.44,
      "Text": " Bastard Lord a lot of hands-on operations. I can't see exactly the timeline here, but"
    },
    {
      "Time_Start": 224.44,
      "Time_End": 233.04000000000002,
      "Text": " I believe that we are now in 2020 on the first month, so, yes, June 2020. There's a very"
    },
    {
      "Time_Start": 233.04000000000002,
      "Time_End": 238.8,
      "Text": " interesting major event, I guess, for Bastard Lord which is the participation on this summer"
    },
    {
      "Time_Start": 238.8,
      "Time_End": 245.12,
      "Text": " article contest promoted by the LockBeat gang in partnership with the XSS administrators."
    },
    {
      "Time_Start": 245.12,
      "Time_End": 252.04000000000002,
      "Text": " The idea behind this was that the LockBeat gang paid a prize for the best articles, most"
    },
    {
      "Time_Start": 252.04000000000002,
      "Time_End": 257.16,
      "Text": " interesting articles related to cybersecurity and cybercrime, but that could support hands-on"
    },
    {
      "Time_Start": 257.16,
      "Time_End": 263.56,
      "Text": " operations. Bastard Lord participated in that, created a thread, and on that thread, he disclosed"
    },
    {
      "Time_Start": 263.56,
      "Time_End": 272.36,
      "Text": " some of his background, some details of the initially first rich organisations, and his"
    },
    {
      "Time_Start": 272.36,
      "Time_End": 284.04,
      "Text": " experience of exploiting the CV 2019, 11.5.10, which basically targets secure VPNs. It was"
    },
    {
      "Time_Start": 284.36,
      "Time_End": 294.44,
      "Text": " his first public appearance that draws more attention for us researchers. It looked like"
    },
    {
      "Time_Start": 294.44,
      "Time_End": 301.24,
      "Text": " the actor enjoyed the attention received, and the same month, he published this spamming tutorial."
    },
    {
      "Time_Start": 303.08000000000004,
      "Time_End": 308.76,
      "Text": " On this spamming tutorial, he spoke about a lot of, it was a very detailed tutorial,"
    },
    {
      "Time_Start": 308.76,
      "Time_End": 318.28,
      "Text": " and he spoke about tools he used and abused, like AMS Enterprise, the use of Xlead 2 underground"
    },
    {
      "Time_Start": 318.28,
      "Time_End": 328.2,
      "Text": " to get access and purchase access to compromised SMTP service, and the LTSpace product which is"
    },
    {
      "Time_Start": 328.2,
      "Time_End": 333.8,
      "Text": " a legitimate service for proxies, so the idea would be to hide the origins of the malware"
    },
    {
      "Time_Start": 333.8,
      "Time_End": 341.24,
      "Text": " campaigns. The thing is that, on that tutorial, he put that screenshot at the right side, and he"
    },
    {
      "Time_Start": 341.24,
      "Time_End": 350.04,
      "Text": " disclosed the user name on the service. So, this is like our first moniker likely operated by the"
    },
    {
      "Time_Start": 350.04,
      "Time_End": 360.68,
      "Text": " actor. So, we identified a profile on hacker forums which matches the same activity demonstrated"
    },
    {
      "Time_Start": 361.32,
      "Time_End": 368.84000000000003,
      "Text": " by the actor in reference to malware spamming operations. We also identified some other leads,"
    },
    {
      "Time_Start": 368.84000000000003,
      "Time_End": 375.0,
      "Text": " but that still needs double sourcing, so I will not disclose here, but this should be basically"
    },
    {
      "Time_Start": 375.0,
      "Time_End": 383.08,
      "Text": " like Discord accounts and similar communication channels. Moving on. He published a second"
    },
    {
      "Time_Start": 383.08,
      "Time_End": 390.36,
      "Text": " tutorial, but I don't call that exactly a tutorial, because that's basically a 10-minute video"
    },
    {
      "Time_Start": 390.84000000000003,
      "Time_End": 398.84000000000003,
      "Text": " illustrating him breaching an organisation. So, the whole process was recorded, and he posted that"
    },
    {
      "Time_Start": 398.84000000000003,
      "Time_End": 405.32,
      "Text": " explaining some of the steps. On that video, we can cite things like initial access via compromised"
    },
    {
      "Time_Start": 405.32,
      "Time_End": 411.16,
      "Text": " QSecure VPN, the use of the soft perfect which the actor enjoys a lot and you can see that very"
    },
    {
      "Time_Start": 411.16,
      "Time_End": 418.12,
      "Text": " often, lateral movement, and privilege escalation. The most interesting thing here is that"
    },
    {
      "Time_Start": 418.92,
      "Time_End": 425.96,
      "Text": " this video is a precursor to the publication of the manual which will occur like one year later"
    },
    {
      "Time_Start": 425.96,
      "Time_End": 431.48,
      "Text": " in August 2021, so many of those things that we can see on the first manual were actually"
    },
    {
      "Time_Start": 431.48,
      "Time_End": 436.52,
      "Text": " demonstrated on this video. I won't play the video here to not expose the victim organisation,"
    },
    {
      "Time_Start": 436.52,
      "Time_End": 444.44,
      "Text": " but I took a few screenshots of the main, I would say, events from the video. So, on this one,"
    },
    {
      "Time_Start": 445.32,
      "Time_End": 450.84,
      "Text": " the actor was accessing the company with the compromised QSecure VPN accounts. This is his"
    },
    {
      "Time_Start": 450.84,
      "Time_End": 459.64,
      "Text": " machine, his VPS machine. A lot of folders and files he was operating. Once he got access to the"
    },
    {
      "Time_Start": 460.6,
      "Time_End": 467.8,
      "Text": " VPN network, he started running soft perfect. He makes a really simple recon to identify"
    },
    {
      "Time_Start": 467.8,
      "Time_End": 475.40000000000003,
      "Text": " the network on the VPN connection he got, and he uses the same credentials to log on the VPN"
    },
    {
      "Time_Start": 475.40000000000003,
      "Time_End": 481.48,
      "Text": " to perform an authenticated scan with soft perfect. With that information, with that setup,"
    },
    {
      "Time_Start": 482.04,
      "Time_End": 490.92,
      "Text": " he already could identify machines accessible to that VPN network that he could access with"
    },
    {
      "Time_Start": 490.92,
      "Time_End": 499.48,
      "Text": " those credentials. This is what you are seeing in the screenshot. So, once he finds a good target"
    },
    {
      "Time_Start": 499.48,
      "Time_End": 508.12,
      "Text": " for him, he performs lateral movement via RDP there, and he dumps the process. He exfiltrates"
    },
    {
      "Time_Start": 508.12,
      "Time_End": 515.96,
      "Text": " that file to his machine and imports that into Mimikatz. From there, the actor can get access to"
    },
    {
      "Time_Start": 516.9200000000001,
      "Time_End": 523.5600000000001,
      "Text": " plain text credentials, and he uses that to make a new authenticated scan with more elevated"
    },
    {
      "Time_Start": 523.5600000000001,
      "Time_End": 530.6,
      "Text": " credentials, and he also uses an interesting feature from network perfect scanner to import"
    },
    {
      "Time_Start": 530.6,
      "Time_End": 536.6,
      "Text": " all the machines from active directory. So, basically, he starts poking every machine on the"
    },
    {
      "Time_Start": 536.6,
      "Time_End": 543.72,
      "Text": " network with those more elevated credentials. So, this is the results. This is basically what we're"
    },
    {
      "Time_Start": 543.72,
      "Time_End": 549.64,
      "Text": " seeing here are more accessible machines. The actor kind of highlights the machines with more"
    },
    {
      "Time_Start": 549.64,
      "Time_End": 558.0400000000001,
      "Text": " disk space which would mean they are good targets for Hanksworth to lock. And the video ends."
    },
    {
      "Time_Start": 560.52,
      "Time_End": 568.52,
      "Text": " Okay, so, moving on. During that time, the actor draws attention from Lockbit,"
    },
    {
      "Time_Start": 568.92,
      "Time_End": 576.52,
      "Text": " and he receives an invite to join the programme. We also identify some good evidence"
    },
    {
      "Time_Start": 577.0799999999999,
      "Time_End": 581.88,
      "Text": " of him working as an initial access broker for Avedon during that same period."
    },
    {
      "Time_Start": 585.0799999999999,
      "Time_End": 592.76,
      "Text": " Moving on timeline. On February 2021, the actor provided an interview to the actor"
    },
    {
      "Time_Start": 593.3199999999999,
      "Time_End": 597.4,
      "Text": " Yashichka. I usually say that. I'm not sure what is correct."
    },
    {
      "Time_Start": 600.12,
      "Time_End": 607.24,
      "Text": " They apparently developed a good relationship, and one thing worth mentioning is that"
    },
    {
      "Time_Start": 608.04,
      "Time_End": 614.68,
      "Text": " Yashichka was a translator of cybersecurity articles within the XSS board."
    },
    {
      "Time_Start": 615.0000000000001,
      "Time_End": 625.8000000000001,
      "Text": " On that interview, the actor provided a few details of his personal life. He claimed to"
    },
    {
      "Time_Start": 625.8000000000001,
      "Time_End": 633.96,
      "Text": " operate as an affiliate for this Hanksworth programme, Lockbit, and Avedon, and he was heavily"
    },
    {
      "Time_Start": 633.96,
      "Time_End": 640.7600000000001,
      "Text": " criticised by several members of the XSS, especially due to the public attention we received,"
    },
    {
      "Time_Start": 641.16,
      "Time_End": 649.0,
      "Text": " and most of them called it a mediocre ransom operation due to some basic techniques."
    },
    {
      "Time_Start": 650.92,
      "Time_End": 655.96,
      "Text": " He claimed at the time to operate in only a few underground forums, like one and two,"
    },
    {
      "Time_Start": 655.96,
      "Time_End": 662.68,
      "Text": " maybe XSS only, you know. However, this is a simplified version, and link analysis we made,"
    },
    {
      "Time_Start": 663.24,
      "Time_End": 669.48,
      "Text": " and I would highlight this simplified version if we have more, of some of those handles he used."
    },
    {
      "Time_Start": 670.44,
      "Time_End": 678.2,
      "Text": " So, starting with Bastelord on the XSS, we just make a connection where he was using a"
    },
    {
      "Time_Start": 678.2,
      "Time_End": 684.04,
      "Text": " Telegram account linked to Siener, which is a handle that became public in February."
    },
    {
      "Time_Start": 684.76,
      "Time_End": 692.28,
      "Text": " So Bastelord shared that Jabber account below, and that same Jabber account was also used"
    },
    {
      "Time_Start": 692.8399999999999,
      "Time_End": 701.0,
      "Text": " on Raider forums and the Exploit forums. On Exploit, he was using the handle editor which"
    },
    {
      "Time_Start": 701.0,
      "Time_End": 707.3199999999999,
      "Text": " is a reference, a possible reference that the actor was working with web designer before,"
    },
    {
      "Time_Start": 707.3199999999999,
      "Time_End": 715.48,
      "Text": " you know, getting into cybercrime. This was his claim. And here we have an assessment. So,"
    },
    {
      "Time_Start": 716.12,
      "Time_End": 724.28,
      "Text": " that editor account posted a very specific victim on the forum, and, like, one or two days later,"
    },
    {
      "Time_Start": 724.28,
      "Time_End": 731.16,
      "Text": " the account March Machico also posted the exact same victim. We can theorise a bit about that."
    },
    {
      "Time_Start": 731.72,
      "Time_End": 738.84,
      "Text": " You could perform some ACH, but, you know, that should be probably one of the affiliates of his,"
    },
    {
      "Time_Start": 738.84,
      "Time_End": 746.0400000000001,
      "Text": " and we could theorise about that. However, we also identified the March Machico Gmail account,"
    },
    {
      "Time_Start": 746.9200000000001,
      "Time_End": 752.9200000000001,
      "Text": " which was used to register the editor account on Raid forum. So, we have a very interesting link"
    },
    {
      "Time_Start": 752.9200000000001,
      "Time_End": 757.64,
      "Text": " with a null handle he was also using. So, yeah. Moving on."
    },
    {
      "Time_Start": 757.64,
      "Time_End": 769.08,
      "Text": " August 2021, he publishes the first manual. It had six pages, and, as I said, it reflects much"
    },
    {
      "Time_Start": 769.08,
      "Time_End": 777.56,
      "Text": " of the actor's underground activities. Some initial insights that we provide are a few"
    },
    {
      "Time_Start": 777.56,
      "Time_End": 784.12,
      "Text": " underground services the actor mentioned on that manual. So, the first one is mass scan online"
    },
    {
      "Time_Start": 784.12,
      "Time_End": 791.8,
      "Text": " to discover targets. It has similar functions to show them, for instance. The host bulletproofing"
    },
    {
      "Time_Start": 792.76,
      "Time_End": 801.08,
      "Text": " provider, and crack which is basically a database of cracked passwords. So, whenever the actor got"
    },
    {
      "Time_Start": 801.08,
      "Time_End": 807.96,
      "Text": " a hashed password, he could just drop that into the service to see if the actors had that"
    },
    {
      "Time_Start": 807.96,
      "Time_End": 818.2800000000001,
      "Text": " cracked it into the database. The first manual also included a set of tools delivered together"
    },
    {
      "Time_Start": 818.2800000000001,
      "Time_End": 826.6,
      "Text": " with the manual. On that, I mean, there's a few tools. I can explain those tools later for whoever"
    },
    {
      "Time_Start": 826.6,
      "Time_End": 833.4000000000001,
      "Text": " is interested. I wasn't planning to detail those, but just so everyone is aware. So, the manual"
    },
    {
      "Time_Start": 833.4,
      "Time_End": 839.88,
      "Text": " basically said things about gaining access, how to gain access to companies, escalating privilege,"
    },
    {
      "Time_Start": 839.88,
      "Time_End": 845.24,
      "Text": " performing lateral movement, and identification of good targets to lock within the network."
    },
    {
      "Time_Start": 846.1999999999999,
      "Time_End": 852.76,
      "Text": " There was no details about data exfiltration or extortion tactics on those manuals,"
    },
    {
      "Time_Start": 853.48,
      "Time_End": 859.8,
      "Text": " and I will provide a more summarized overview once we also cover the second manual. So,"
    },
    {
      "Time_Start": 859.8000000000001,
      "Time_End": 865.6400000000001,
      "Text": " on the next slides, we will get into it and get more details of the manuals together, I would say."
    },
    {
      "Time_Start": 868.2,
      "Time_End": 872.2800000000001,
      "Text": " Moving on to the timeline. We are now in November 2021."
    },
    {
      "Time_Start": 874.2800000000001,
      "Time_End": 880.5200000000001,
      "Text": " And the actor posted a comment on XSS saying that he would retire from hands-on operations."
    },
    {
      "Time_Start": 881.72,
      "Time_End": 887.6400000000001,
      "Text": " His account was voluntarily banned from the forum. However, he kept operating on the forum"
    },
    {
      "Time_Start": 888.52,
      "Time_End": 894.4399999999999,
      "Text": " under the fisheye handle, and there he disclosed an affiliation with AlphaV"
    },
    {
      "Time_Start": 894.4399999999999,
      "Time_End": 898.6,
      "Text": " after he was criticized in some aspects of their operation."
    },
    {
      "Time_Start": 901.72,
      "Time_End": 907.4,
      "Text": " One interesting thing is that there was an updated version of the first manual."
    },
    {
      "Time_Start": 908.36,
      "Time_End": 916.12,
      "Text": " This updated version was created about March 2022, and that included two, sorry,"
    },
    {
      "Time_Start": 916.12,
      "Time_End": 923.4,
      "Text": " five additional pages. So, the content included things like some comments about the war between"
    },
    {
      "Time_Start": 923.4,
      "Time_End": 928.68,
      "Text": " Russia and Ukraine, some information he got into cryptocurrency trading,"
    },
    {
      "Time_Start": 930.92,
      "Time_End": 938.84,
      "Text": " and he said some things about some public research made analyzing the first manual."
    },
    {
      "Time_Start": 939.8000000000001,
      "Time_End": 947.5600000000001,
      "Text": " It also included a new quick tutorial exploiting Blue Keep to get access in vulnerable RDP machines."
    },
    {
      "Time_Start": 953.1600000000001,
      "Time_End": 959.8000000000001,
      "Text": " The interesting link here is that he was using a custom tool. That tool was developed by the actor"
    },
    {
      "Time_Start": 959.8000000000001,
      "Time_End": 967.72,
      "Text": " Playbit, who is a reputable and well-known actor for developing, I would say, one-day"
    },
    {
      "Time_Start": 968.2800000000001,
      "Time_End": 974.84,
      "Text": " vulnerabilities, too. So, whenever, you know, a new vulnerability is disclosed, the actor"
    },
    {
      "Time_Start": 974.84,
      "Time_End": 982.6800000000001,
      "Text": " kind of develops the tools and starts selling them on the ground. He was a lot well-versed"
    },
    {
      "Time_Start": 982.6800000000001,
      "Time_End": 990.44,
      "Text": " with operational system vulnerabilities. So, Blue Keep was one of his targets."
    },
    {
      "Time_Start": 993.5600000000001,
      "Time_End": 1000.5200000000001,
      "Text": " On that manual, on the last additional page, he also made some appraisals to a few"
    },
    {
      "Time_Start": 1000.5200000000001,
      "Time_End": 1008.6800000000001,
      "Text": " actors, which is interesting. They collaborated somehow to the content included on those manuals."
    },
    {
      "Time_Start": 1008.6800000000001,
      "Time_End": 1016.7600000000001,
      "Text": " So, you can see, like, TMT, Lalarto, which is a reference to Wazawaka,"
    },
    {
      "Time_Start": 1017.48,
      "Time_End": 1025.4,
      "Text": " also supporting. Wazawaka probably was credited for this due to some collaborations with VMware"
    },
    {
      "Time_Start": 1025.4,
      "Time_End": 1030.44,
      "Text": " Breaching. There is also the actor Satyr and Marmalade Kinate."
    },
    {
      "Time_Start": 1035.72,
      "Time_End": 1043.96,
      "Text": " Moving on on timeline. It is December 2022, and the actor starts offering the second manual for"
    },
    {
      "Time_Start": 1043.96,
      "Time_End": 1052.6000000000001,
      "Text": " $10,000. This manual was 24 pages and included additional methods to gain initial access,"
    },
    {
      "Time_Start": 1052.9199999999998,
      "Time_End": 1059.8,
      "Text": " privileges, and reach technologies. Some interesting thing that occurred in both manuals"
    },
    {
      "Time_Start": 1059.8,
      "Time_End": 1066.36,
      "Text": " is that the actor always included screenshots taken from real victims, and the presence of the"
    },
    {
      "Time_Start": 1066.36,
      "Time_End": 1079.1599999999999,
      "Text": " password is, like, everywhere. So, there's an interesting link. In May 2023, he leaked a"
    },
    {
      "Time_Start": 1079.16,
      "Time_End": 1088.76,
      "Text": " redacted version of that manual after some online conflicts he had with Prudapt. However, he also"
    },
    {
      "Time_Start": 1088.76,
      "Time_End": 1099.0,
      "Text": " got access to the redacted version, and, you know, we understood why he leaked that redacted version,"
    },
    {
      "Time_Start": 1099.0,
      "Time_End": 1104.6000000000001,
      "Text": " because there was a lot of information about the breached victims, and some of those with"
    },
    {
      "Time_Start": 1104.6000000000001,
      "Time_End": 1111.3200000000002,
      "Text": " high profile, like providers for big government entities and billion-dollar companies. So,"
    },
    {
      "Time_Start": 1111.3200000000002,
      "Time_End": 1115.8000000000002,
      "Text": " there were things like VPN credentials used to get access into that."
    },
    {
      "Time_Start": 1118.2800000000002,
      "Time_End": 1124.92,
      "Text": " On the latest pages, it included two cryptocurrency addresses, one operated by"
    },
    {
      "Time_Start": 1124.92,
      "Time_End": 1132.76,
      "Text": " Bacelor, and another operated by Yashicheco. Here, I have some interesting crypto links that"
    },
    {
      "Time_Start": 1132.76,
      "Time_End": 1140.44,
      "Text": " I included. They are very basic. There is a lot of other correlated addresses, so this is just"
    },
    {
      "Time_Start": 1140.44,
      "Time_End": 1148.44,
      "Text": " a simplification. So, at the centre, there is the address included on the manual, and, you know,"
    },
    {
      "Time_Start": 1149.0,
      "Time_End": 1155.4,
      "Text": " I said, in December, he started selling the manuals. At the same period, we observed a lot of"
    },
    {
      "Time_Start": 1156.3600000000001,
      "Time_End": 1163.8,
      "Text": " transactions of about $10,000, which means, you know, those are potential buyers."
    },
    {
      "Time_Start": 1166.04,
      "Time_End": 1171.88,
      "Text": " Most of the money he got from that address was sent to KuCoin exchange."
    },
    {
      "Time_Start": 1172.8400000000001,
      "Time_End": 1180.6000000000001,
      "Text": " In September, like two months before he disclosed this address, national hazard agents,"
    },
    {
      "Time_Start": 1181.64,
      "Time_End": 1188.1200000000001,
      "Text": " no, his hacking group, they breached an organisation in Chile, and there was a handsome"
    },
    {
      "Time_Start": 1188.1200000000001,
      "Time_End": 1196.2800000000002,
      "Text": " note that included the address at the right side. There was a transaction flowing and, you know,"
    },
    {
      "Time_Start": 1197.08,
      "Time_End": 1205.48,
      "Text": " going to the address he operated linked to the manuals. There is another link from a real breach"
    },
    {
      "Time_Start": 1205.48,
      "Time_End": 1212.36,
      "Text": " with an address the actor shared within the manual. Another interesting link, so I mentioned"
    },
    {
      "Time_Start": 1212.36,
      "Time_End": 1220.44,
      "Text": " there was a good connection of him with Yashicheco, and there was some interactions with them in the"
    },
    {
      "Time_Start": 1220.44,
      "Time_End": 1227.64,
      "Text": " forum where he claimed to make a transfer to support Yashicheco with some medical care,"
    },
    {
      "Time_Start": 1227.64,
      "Time_End": 1236.52,
      "Text": " and that transaction was of about $80,500, and, analysing the transaction, we see that"
    },
    {
      "Time_Start": 1236.52,
      "Time_End": 1242.3600000000001,
      "Text": " that amount originated from KuCoin exchange, which, you know, is another good lead that he"
    },
    {
      "Time_Start": 1242.3600000000001,
      "Time_End": 1250.8400000000001,
      "Text": " operated an account at. So, those, you know, the first quarter of 2023 was some busy months"
    },
    {
      "Time_Start": 1250.8400000000001,
      "Time_End": 1255.5600000000002,
      "Text": " to Bastelord, so, at the time, he provided interviews to the record and Analyst One."
    },
    {
      "Time_Start": 1256.2800000000002,
      "Time_End": 1263.8000000000002,
      "Text": " He claimed to return to the Lockbit as a service programme, and he announced a new retirement."
    },
    {
      "Time_Start": 1263.8000000000002,
      "Time_End": 1270.1200000000001,
      "Text": " However, as the first time, he also kept operating with Hangstar operations, so you see a trend here,"
    },
    {
      "Time_Start": 1270.1200000000001,
      "Time_End": 1281.48,
      "Text": " right? So, let's take a look on the manuals. So, this is just an overview of the tools the actor"
    },
    {
      "Time_Start": 1281.48,
      "Time_End": 1292.5200000000002,
      "Text": " is using. So, we can see there the use of some of the tools that I mentioned above, like"
    },
    {
      "Time_Start": 1292.52,
      "Time_End": 1300.6,
      "Text": " Bazelon scan. However, checking the main techniques he used to gain initial action in those"
    },
    {
      "Time_Start": 1301.6399999999999,
      "Time_End": 1309.4,
      "Text": " organisations, we can say that most of that was related to the actor brute-forcing corporate VPNs"
    },
    {
      "Time_Start": 1310.52,
      "Time_End": 1316.84,
      "Text": " using Blue Keep and exploiting vulnerable corporate VPNs, you know, with vulnerabilities,"
    },
    {
      "Time_Start": 1316.84,
      "Time_End": 1326.6,
      "Text": " of course. Once he got access to an organisation, he spawns a software-perfect network scanner,"
    },
    {
      "Time_Start": 1326.6,
      "Time_End": 1333.6399999999999,
      "Text": " and from there, he starts looking for targets. What kind of targets those were? Many, of course,"
    },
    {
      "Time_Start": 1333.6399999999999,
      "Time_End": 1340.6,
      "Text": " most of the techniques within the manuals speak about escalating privileges to domain controllers."
    },
    {
      "Time_Start": 1341.4800000000002,
      "Time_End": 1348.3600000000001,
      "Text": " So, you can see there's like the notepad vulnerability, but he also used a lot of"
    },
    {
      "Time_Start": 1349.3200000000002,
      "Time_End": 1358.68,
      "Text": " common red-team techniques, like a ASP-wrapped roasting. He also used the tools to identify"
    },
    {
      "Time_Start": 1359.4800000000002,
      "Time_End": 1365.16,
      "Text": " domain accounts, you know, through the authentication protocol, and used the legend"
    },
    {
      "Time_Start": 1366.0400000000002,
      "Time_End": 1371.0,
      "Text": " to conduct those brute-force account attacks."
    },
    {
      "Time_Start": 1375.48,
      "Time_End": 1381.64,
      "Text": " His objectives here was always try, it's common, right? So, I need to get elevated credentials,"
    },
    {
      "Time_Start": 1381.64,
      "Time_End": 1390.0400000000002,
      "Text": " I need to dump any TDS database, I need to dump the process. This is kind of a common"
    },
    {
      "Time_Start": 1390.04,
      "Time_End": 1396.84,
      "Text": " procedure that we see in the text. Once he got access to those elevated credentials, he performs"
    },
    {
      "Time_Start": 1396.84,
      "Time_End": 1407.32,
      "Text": " a new scan with that. And then he finds the targets and tries to log them. There was a very"
    },
    {
      "Time_Start": 1407.32,
      "Time_End": 1414.6,
      "Text": " indirect reference. He didn't, he was not very explicit about it, but there was a section within"
    },
    {
      "Time_Start": 1414.6000000000001,
      "Time_End": 1422.2800000000002,
      "Text": " the manuals where he said, oh, how can you run a file in a remote machine, which is a reference to"
    },
    {
      "Time_Start": 1422.2800000000002,
      "Time_End": 1426.68,
      "Text": " how to deploy a hangs or to a remote machine, and he did that to PSZAC."
    },
    {
      "Time_Start": 1429.16,
      "Time_End": 1437.2400000000002,
      "Text": " So, some things that I can provide looking at those manuals is that they leverages"
    },
    {
      "Time_Start": 1438.0400000000002,
      "Time_End": 1443.4800000000002,
      "Text": " effective and fast manuals. That's what he's always looking for. The most effective and"
    },
    {
      "Time_Start": 1443.48,
      "Time_End": 1451.32,
      "Text": " fast methods. One interesting thing is that actors look on these manuals as a method to"
    },
    {
      "Time_Start": 1451.32,
      "Time_End": 1456.76,
      "Text": " learn about hands-free operations, and we, as defenders, I mean, organisations should also"
    },
    {
      "Time_Start": 1456.76,
      "Time_End": 1463.8,
      "Text": " take a look at those manuals, and, you know, interpret them as a good strategy to fight"
    },
    {
      "Time_Start": 1464.6,
      "Time_End": 1474.6,
      "Text": " hangsware attacks. So, those, as Will Thomas said to me, those are templated attacks. I like that"
    },
    {
      "Time_Start": 1474.6,
      "Time_End": 1481.32,
      "Text": " definition. So, this could be some good guides for us to protect against it."
    },
    {
      "Time_Start": 1484.28,
      "Time_End": 1491.96,
      "Text": " I will take a quick, I will do a quick mention to a section on the manuals where he speaks about"
    },
    {
      "Time_Start": 1491.96,
      "Time_End": 1497.64,
      "Text": " how they attack VMware technologies, which is the content from this slide. So, first, imagine"
    },
    {
      "Time_Start": 1497.64,
      "Time_End": 1505.96,
      "Text": " they got a domain account with elevated access. So, in many organisations, VMware re-centre,"
    },
    {
      "Time_Start": 1505.96,
      "Time_End": 1513.8,
      "Text": " which is a centralised interface that you can control virtualised machines, in most,"
    },
    {
      "Time_Start": 1514.52,
      "Time_End": 1521.48,
      "Text": " not most, in many organisations, VMware re-centre might be communicating with the domain,"
    },
    {
      "Time_Start": 1521.48,
      "Time_End": 1529.24,
      "Text": " so, in that case, the actor will try to use those credentials, log into VMware re-centre,"
    },
    {
      "Time_Start": 1529.24,
      "Time_End": 1535.4,
      "Text": " and verify if VMware ESX, which is the hypervisor where the virtual disks are,"
    },
    {
      "Time_Start": 1535.4,
      "Time_End": 1543.24,
      "Text": " is also connected to the domain. If that's not the case, what the actor does, so this is the idea for"
    },
    {
      "Time_Start": 1543.24,
      "Time_End": 1552.6,
      "Text": " the slides, he created a ESX admins global group and inserts an account on that group. He accesses"
    },
    {
      "Time_Start": 1552.6,
      "Time_End": 1557.96,
      "Text": " VMware re-centre. Remember, it's not linked, VMware re-centre, actually, ESX is not linked to the"
    },
    {
      "Time_Start": 1557.96,
      "Time_End": 1564.2,
      "Text": " domain, so he forces that connection to the domain. So now he can use that account,"
    },
    {
      "Time_Start": 1564.68,
      "Time_End": 1573.88,
      "Text": " a link with the ESX admins group, to log into VMware ESX, and from that, he now has an option"
    },
    {
      "Time_Start": 1574.52,
      "Time_End": 1587.24,
      "Text": " to change the VMware ESX root account password. This allows him to log into VMware ESX via SSH,"
    },
    {
      "Time_Start": 1587.24,
      "Time_End": 1592.76,
      "Text": " and from that, he can control the virtual disk as he wishes. This is interesting. Those are"
    },
    {
      "Time_Start": 1592.76,
      "Time_End": 1598.36,
      "Text": " template attacks, but, however, they're still effective, and you can still learn some interesting"
    },
    {
      "Time_Start": 1598.92,
      "Time_End": 1606.04,
      "Text": " techniques from that. I say that because I have seen only like two or three reports mentioning"
    },
    {
      "Time_Start": 1606.04,
      "Time_End": 1613.96,
      "Text": " these techniques by Hanksware operators, and there was a nice report from Sophos, if I'm not wrong,"
    },
    {
      "Time_Start": 1614.6000000000001,
      "Time_End": 1621.72,
      "Text": " where they mentioned the Akira, a Hanksware group, also used a similar technique."
    },
    {
      "Time_Start": 1623.32,
      "Time_End": 1627.96,
      "Text": " However, these open-source reports usually didn't provide further context"
    },
    {
      "Time_Start": 1627.96,
      "Time_End": 1632.3600000000001,
      "Text": " on why the actors did that, so, you know, you can have some general idea of it."
    },
    {
      "Time_Start": 1632.3600000000001,
      "Time_End": 1643.96,
      "Text": " We are on the last stages of our timeline. So, what do you got now? That is possibly,"
    },
    {
      "Time_Start": 1643.96,
      "Time_End": 1650.6000000000001,
      "Text": " and I emphasise possibly, a personal operating account with the Brat's Lab username."
    },
    {
      "Time_Start": 1651.88,
      "Time_End": 1659.3200000000002,
      "Text": " That account was also present on the Ramp forums, Hensel forums, and XSS. There are some good leads"
    },
    {
      "Time_Start": 1659.32,
      "Time_End": 1665.8,
      "Text": " that this account might be operated by Bicelor, such as he posted a screenshot from the Fisheye"
    },
    {
      "Time_Start": 1665.8,
      "Time_End": 1672.6799999999998,
      "Text": " web comics, which the guy's a fan, there are arts to the manuals, you know."
    },
    {
      "Time_Start": 1674.36,
      "Time_End": 1682.4399999999998,
      "Text": " In December, he posted a screenshot of the ALFV Taino during that disruption operation as a proof"
    },
    {
      "Time_Start": 1682.4399999999998,
      "Time_End": 1688.36,
      "Text": " that he still got access to that, that it was still working. He posted a lot of comments"
    },
    {
      "Time_Start": 1689.32,
      "Time_End": 1694.28,
      "Text": " to researchers indicating and giving hints that he could be Bicelor. However,"
    },
    {
      "Time_Start": 1696.2,
      "Time_End": 1701.1599999999999,
      "Text": " seeing that occurring, that account posted a comment saying, you're saying I'm not Bicelor."
    },
    {
      "Time_Start": 1705.1599999999999,
      "Time_End": 1711.32,
      "Text": " And we have a bonus. So, we are getting to the end of the presentation, and just last month,"
    },
    {
      "Time_Start": 1711.8799999999999,
      "Time_End": 1721.56,
      "Text": " a new persona arrived on the forum using the Mason handle. That account offered a third version of"
    },
    {
      "Time_Start": 1721.56,
      "Time_End": 1728.4399999999998,
      "Text": " the manual. The actor Mason claimed affiliation with Bicelor. He didn't say he was Bicelor."
    },
    {
      "Time_Start": 1730.36,
      "Time_End": 1736.6799999999998,
      "Text": " And the content that I can anticipate in providing you here for this new manual is that it is heavily"
    },
    {
      "Time_Start": 1736.68,
      "Time_End": 1743.16,
      "Text": " focused in identifying targets. I mean, using, like, corporate email addresses,"
    },
    {
      "Time_Start": 1743.16,
      "Time_End": 1749.4,
      "Text": " linking that with potential targets, identifying VPN corporate portals, link it with, you know,"
    },
    {
      "Time_Start": 1749.4,
      "Time_End": 1756.6000000000001,
      "Text": " the domains from that email addresses, things like that. And he's probably also using some"
    },
    {
      "Time_Start": 1756.6000000000001,
      "Time_End": 1764.76,
      "Text": " underground tools to conduct brute force count attacks. So, this is what this new manual is"
    },
    {
      "Time_Start": 1764.76,
      "Time_End": 1773.24,
      "Text": " about. Okay? And, you know, I can always provide further context. We have plenty of additional"
    },
    {
      "Time_Start": 1773.24,
      "Time_End": 1782.12,
      "Text": " details on almost every slide. So, whoever is interested, just reach out. Thank you."
    }
  ]
}