{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 3.04,
      "Text": "This text was transcribed using whisper model: medium\n\n Why is it so hard to schedule time for ourselves?"
    },
    {
      "Time_Start": 3.04,
      "Time_End": 7.92,
      "Text": " We are so obligated to schedule time with others, meetings, zoom calls, appointments,"
    },
    {
      "Time_Start": 7.92,
      "Time_End": 14.0,
      "Text": " all this stuff until it comes to us. Scheduling private uninterrupted time with you know who."
    },
    {
      "Time_Start": 14.72,
      "Time_End": 21.04,
      "Text": " You. That's what we want to get to. And it is so powerful yet we don't do it. And I have not done"
    },
    {
      "Time_Start": 21.04,
      "Time_End": 26.96,
      "Text": " it for such a long time until just recently when I went on a two to four day personal retreat."
    },
    {
      "Time_Start": 27.04,
      "Time_End": 31.04,
      "Text": " It was supposed to be two days it ended up being four days and I'm so thankful I took it. But on"
    },
    {
      "Time_Start": 31.04,
      "Time_End": 35.84,
      "Text": " that personal retreat I want to talk about the first thing I did which was go through an epic"
    },
    {
      "Time_Start": 35.84,
      "Time_End": 41.52,
      "Text": " wheel of life template. Now this template will take you two hours. You have to budget this time."
    },
    {
      "Time_Start": 41.52,
      "Time_End": 46.08,
      "Text": " But on the flip side of these two hours you should be able to say something like this."
    },
    {
      "Time_Start": 46.08,
      "Time_End": 51.36,
      "Text": " I know exactly where I am, I know how I got here, and I know where I would like to go."
    },
    {
      "Time_Start": 51.36,
      "Time_End": 55.92,
      "Text": " I'm reading what I wrote and I hope you have a similar result so let's get into it."
    },
    {
      "Time_Start": 55.92,
      "Time_End": 60.400000000000006,
      "Text": " And that template is a free download you can see it in the description below for you right now."
    },
    {
      "Time_Start": 60.400000000000006,
      "Time_End": 67.2,
      "Text": " It works perfectly in the app Obsidian. I custom designed it to be the perfect wheel of life for an"
    },
    {
      "Time_Start": 67.2,
      "Time_End": 72.8,
      "Text": " epic life audit. It worked wonders for me that's why I'm excited to share it with you. It is free."
    },
    {
      "Time_Start": 72.8,
      "Time_End": 76.64,
      "Text": " You can just download it immediately and then you can actually walk through the rest of these"
    },
    {
      "Time_Start": 76.64,
      "Time_End": 82.16,
      "Text": " exercises with me while going through the template. Or you can just watch the video first and then go"
    },
    {
      "Time_Start": 82.16,
      "Time_End": 86.72,
      "Text": " through the template. And you only need two things to do an epic wheel of life audit. You need a"
    },
    {
      "Time_Start": 86.72,
      "Time_End": 92.88,
      "Text": " private place and a thinking space. So make sure you have a private place and then for me my thinking"
    },
    {
      "Time_Start": 92.88,
      "Time_End": 97.92,
      "Text": " space will be Obsidian, the note-making app, and you'll find that this template works perfectly"
    },
    {
      "Time_Start": 97.92,
      "Time_End": 103.92,
      "Text": " in Obsidian. But first what is the wheel of life? It's a self-assessment tool. It's a way to know"
    },
    {
      "Time_Start": 103.92,
      "Time_End": 109.28,
      "Text": " ourselves. So what you do is you draw a little circle and then there are little pies where you"
    },
    {
      "Time_Start": 109.28,
      "Time_End": 114.08,
      "Text": " look at how you're doing in health and wealth and happiness and these different categories."
    },
    {
      "Time_Start": 114.08,
      "Time_End": 118.72,
      "Text": " You can slice them up any way you want and that's the thing about the wheel of life. There's no"
    },
    {
      "Time_Start": 118.72,
      "Time_End": 124.32000000000001,
      "Text": " one standard way. And what you'll find in the epic template that I've provided is that I've taken the"
    },
    {
      "Time_Start": 124.32000000000001,
      "Time_End": 129.36,
      "Text": " wheel and just unrolled it. So it's a bulleted list. And why this is so important is because"
    },
    {
      "Time_Start": 129.36,
      "Time_End": 136.56,
      "Text": " I've done wheel of life from over a decade ago and I don't have those copies handy because I did them"
    },
    {
      "Time_Start": 136.56,
      "Time_End": 142.72,
      "Text": " on paper somewhere and they didn't have any journaling to that. What we have here is an"
    },
    {
      "Time_Start": 142.72,
      "Time_End": 148.8,
      "Text": " intentional format that will allow you to pull out your thoughts and visibly see them and then"
    },
    {
      "Time_Start": 148.8,
      "Time_End": 154.24,
      "Text": " we'll see that how we can roll up and synthesize and more deeply understand all that to get a"
    },
    {
      "Time_Start": 154.24,
      "Time_End": 160.08,
      "Text": " really great perspective on where we are in life and where we'd like to go. So without further ado,"
    },
    {
      "Time_Start": 160.08,
      "Time_End": 165.12,
      "Text": " let's hop into the template. Okay now we're in. Now we're looking at the beautiful epic wheel of"
    },
    {
      "Time_Start": 165.12,
      "Time_End": 169.84,
      "Text": " life audit template and what you can see is a cool theme. If you like this theme, don't worry,"
    },
    {
      "Time_Start": 169.84,
      "Time_End": 173.76,
      "Text": " we'll have a video. Eventually the link will be up here and in the description below but let's get"
    },
    {
      "Time_Start": 173.76,
      "Time_End": 178.56,
      "Text": " into actually how to prepare for going through this experience because there is just a little"
    },
    {
      "Time_Start": 178.56,
      "Time_End": 184.16,
      "Text": " bit of preparation we want to do. So again, what will you need? A private place and a thinking"
    },
    {
      "Time_Start": 184.16,
      "Time_End": 189.68,
      "Text": " space. This is our thinking space but you need to create your private place. What is that going to"
    },
    {
      "Time_Start": 189.68,
      "Time_End": 195.52,
      "Text": " be? So you want to make sure you can budget two to three hours of private uninterrupted time. It's"
    },
    {
      "Time_Start": 195.52,
      "Time_End": 200.8,
      "Text": " really important. If you're going to be distracted, this isn't going to work for you. How can you"
    },
    {
      "Time_Start": 200.8,
      "Time_End": 205.52,
      "Text": " prepare beforehand? I would say before you start this, I mean feel free to just dive right into it."
    },
    {
      "Time_Start": 205.52,
      "Time_End": 210.48000000000002,
      "Text": " I found it was helpful to kind of create some space in the days leading up. Just start thinking"
    },
    {
      "Time_Start": 210.48000000000002,
      "Time_End": 215.84,
      "Text": " loosely about how life is going for you, where you are, just generally speaking what's gone well"
    },
    {
      "Time_Start": 215.84,
      "Time_End": 220.0,
      "Text": " and maybe where would you like to go? The results that you'll say afterwards is the thing that I"
    },
    {
      "Time_Start": 220.0,
      "Time_End": 224.0,
      "Text": " said. I hope you get the same result. I know exactly where I am. I know how I got here. I"
    },
    {
      "Time_Start": 224.0,
      "Time_End": 229.2,
      "Text": " know where I'd like to go and what you'll feel is that you'll be deeply knowing whatever it is you"
    },
    {
      "Time_Start": 229.2,
      "Time_End": 234.64000000000001,
      "Text": " care about and how you want to move forward to have more of that in your life. So here's how we're"
    },
    {
      "Time_Start": 234.64000000000001,
      "Time_End": 240.08,
      "Text": " going to go through it. We're not going to start from the top down. All this stuff is going to be"
    },
    {
      "Time_Start": 240.08,
      "Time_End": 245.12,
      "Text": " from the bottom up. So there are no scores to begin with. We're going to start with a process"
    },
    {
      "Time_Start": 245.12,
      "Time_End": 251.20000000000002,
      "Text": " called free writing. Some of you have heard of it or if you don't want to write, technology allows"
    },
    {
      "Time_Start": 251.20000000000002,
      "Time_End": 257.76,
      "Text": " us to actually freely talk and dictate and see the words that we're speaking so we can really"
    },
    {
      "Time_Start": 257.76,
      "Time_End": 262.64,
      "Text": " embody what we're saying. Speak from the heart and see the words so we can work with the words"
    },
    {
      "Time_Start": 262.64,
      "Time_End": 267.92,
      "Text": " and develop and roll up these these words and paragraphs into deeper layers of understanding."
    },
    {
      "Time_Start": 267.92,
      "Time_End": 271.6,
      "Text": " And that's where a lot of this magic happens. Now if you don't have two to three hours that's fine."
    },
    {
      "Time_Start": 271.6,
      "Time_End": 276.08000000000004,
      "Text": " What you can do is you can break this up. Now to let you know I did all this in two hours but let's"
    },
    {
      "Time_Start": 276.08000000000004,
      "Time_End": 280.08000000000004,
      "Text": " imagine you don't even have that and you just want to break it up into 30 minute chunks. You can do"
    },
    {
      "Time_Start": 280.08000000000004,
      "Time_End": 284.88,
      "Text": " that. Each 30 minute chunk will get you through one of the three major sections of the Wheel of"
    },
    {
      "Time_Start": 284.88,
      "Time_End": 290.40000000000003,
      "Text": " Life review. So if you only have 30 to 45 minutes you'll be perfectly fine. All you need to do is"
    },
    {
      "Time_Start": 290.40000000000003,
      "Time_End": 295.6,
      "Text": " just break up this whole activity into three different time blocks and then there you go."
    },
    {
      "Time_Start": 295.6,
      "Time_End": 300.64000000000004,
      "Text": " Something really important to note if you are opening up my template and you've thrown it into"
    },
    {
      "Time_Start": 300.64,
      "Time_End": 308.47999999999996,
      "Text": " Obsidian it's going to have every header and bullet expanded, unfolded, twirled open, and we"
    },
    {
      "Time_Start": 308.47999999999996,
      "Time_End": 313.52,
      "Text": " want everything to start out collapsed. So the way that you accomplish this is on a mac you hit"
    },
    {
      "Time_Start": 313.52,
      "Time_End": 321.03999999999996,
      "Text": " command p on windows control p and all I'm going to type is fold all and then we have it fold all"
    },
    {
      "Time_Start": 321.03999999999996,
      "Time_End": 325.28,
      "Text": " headings and lists. So I'm going to click that button and then you'll have this beautifully"
    },
    {
      "Time_Start": 325.36,
      "Time_End": 331.52000000000004,
      "Text": " presented format and you'll be able to twirl open what you need and work as you go. So that's the"
    },
    {
      "Time_Start": 331.52000000000004,
      "Time_End": 336.24,
      "Text": " recommended way. Let's keep going. So we've gone over the instructions and you can break this up"
    },
    {
      "Time_Start": 336.24,
      "Time_End": 341.36,
      "Text": " into three time blocks as we've stated. So now we're going to untwirl each of these sections."
    },
    {
      "Time_Start": 341.36,
      "Time_End": 348.56000000000006,
      "Text": " So the first is the top section. After two hours your final reflections go here. So we're not going"
    },
    {
      "Time_Start": 348.56000000000006,
      "Time_End": 353.84000000000003,
      "Text": " to go here yet and we'll add a little score so we'll have some sort of number like 5.5. Put that"
    },
    {
      "Time_Start": 353.84000000000003,
      "Time_End": 359.84000000000003,
      "Text": " there at the end but we're not starting at the end. So what we want to do is twirl down lived"
    },
    {
      "Time_Start": 359.84000000000003,
      "Time_End": 366.56000000000006,
      "Text": " experience or relationships or work. These are the three parts of the Wheel of Life review. So"
    },
    {
      "Time_Start": 366.56000000000006,
      "Time_End": 370.88000000000005,
      "Text": " choose the one that resonates the most with you. We're just going to go ahead and start in lived"
    },
    {
      "Time_Start": 370.88000000000005,
      "Time_End": 377.52000000000004,
      "Text": " experience. So let me twirl that down and you'll see that within lived experience we have recreation,"
    },
    {
      "Time_Start": 378.08,
      "Time_End": 385.28,
      "Text": " environment, and body. And then if we twirl down recreation we see that there are five, in this case,"
    },
    {
      "Time_Start": 385.28,
      "Time_End": 393.2,
      "Text": " five subsections. Hobbies, travel, leisure, consuming, and experiences. Like I said this"
    },
    {
      "Time_Start": 393.2,
      "Time_End": 399.44,
      "Text": " is an epic Wheel of Life audit. This covers everything. By the end of this you'll know all"
    },
    {
      "Time_Start": 399.44,
      "Time_End": 403.91999999999996,
      "Text": " aspects of your life. You won't have any like hey what did I miss? What areas did I miss? You won't"
    },
    {
      "Time_Start": 403.92,
      "Time_End": 408.64000000000004,
      "Text": " have that. You'll have confidence that you've covered all those aspects of life. So that's"
    },
    {
      "Time_Start": 408.64000000000004,
      "Time_End": 414.08000000000004,
      "Text": " recreation. We have environment, environments, the physical environment, the sensory experience,"
    },
    {
      "Time_Start": 414.08000000000004,
      "Time_End": 420.96000000000004,
      "Text": " and then what about our body? Sleep, nutrition, general movement, and exercise. So these are the"
    },
    {
      "Time_Start": 420.96000000000004,
      "Time_End": 426.48,
      "Text": " things that we want to be looking at when it comes to lived experience this first section. For this"
    },
    {
      "Time_Start": 426.48,
      "Time_End": 431.52000000000004,
      "Text": " video we just don't have the time to walk through everything together but I wanted to show you how"
    },
    {
      "Time_Start": 431.59999999999997,
      "Time_End": 436.96,
      "Text": " I would go through a few of these initial segments. So this is all just in the lived experience"
    },
    {
      "Time_Start": 436.96,
      "Time_End": 441.59999999999997,
      "Text": " section. There are three sections, relationships, and work. I won't twirl those down just yet"
    },
    {
      "Time_Start": 441.59999999999997,
      "Time_End": 446.56,
      "Text": " because I want to show you how I would go through this myself using hobbies and travel as the"
    },
    {
      "Time_Start": 446.56,
      "Time_End": 453.2,
      "Text": " example. So what you do is just click on hobbies and then hit enter to create a new bullet and then"
    },
    {
      "Time_Start": 453.2,
      "Time_End": 459.52,
      "Text": " indent by tab. Now we can start free writing here and this is how you should approach it really"
    },
    {
      "Time_Start": 459.52,
      "Time_End": 464.08,
      "Text": " freely. Punctuation doesn't matter. Grammar doesn't matter. What matters is that you're"
    },
    {
      "Time_Start": 464.08,
      "Time_End": 468.08,
      "Text": " getting it all out. You're figuring out what are my hobbies? What do they look like? What don't"
    },
    {
      "Time_Start": 468.08,
      "Time_End": 473.12,
      "Text": " they look like? And answering all the things in between. So here's something that I can share"
    },
    {
      "Time_Start": 473.12,
      "Time_End": 477.03999999999996,
      "Text": " because this one's not so personal. I don't have any hobbies right now. This is me answering"
    },
    {
      "Time_Start": 477.03999999999996,
      "Time_End": 482.56,
      "Text": " truthfully during my personal retreat. Exercise is where my extra time seems to go. Briefly in"
    },
    {
      "Time_Start": 482.56,
      "Time_End": 487.35999999999996,
      "Text": " this last quarter I was playing the Legend of Zelda Breath of the Wild and while that felt great"
    },
    {
      "Time_Start": 487.36,
      "Time_End": 491.6,
      "Text": " I'm done with video games again. At least for now. I basically, for those that don't know,"
    },
    {
      "Time_Start": 492.56,
      "Time_End": 497.44,
      "Text": " I started playing video games again after over a decade break and it was pretty cool for a couple"
    },
    {
      "Time_Start": 497.44,
      "Time_End": 502.64,
      "Text": " months but I'm done with that. That was a nice hobby but I don't need that anymore. I just kind"
    },
    {
      "Time_Start": 502.64,
      "Time_End": 508.48,
      "Text": " of want to go back to other things although I learned a lot from Legend of Zelda Breath of"
    },
    {
      "Time_Start": 508.48,
      "Time_End": 512.16,
      "Text": " the Wild. That was amazing. So this is all you do though. You just create a little bullet like this."
    },
    {
      "Time_Start": 512.16,
      "Time_End": 517.2,
      "Text": " Now if you have another talking point you just go ahead, you enter, create a new bullet, and then put"
    },
    {
      "Time_Start": 517.2,
      "Time_End": 521.9200000000001,
      "Text": " whatever's on your mind there so you might do more free riding. Or what I really like to do,"
    },
    {
      "Time_Start": 521.9200000000001,
      "Time_End": 527.9200000000001,
      "Text": " and you can do this simply like on a Mac, I'm going to hit F5 which is this little audio button"
    },
    {
      "Time_Start": 527.9200000000001,
      "Time_End": 531.44,
      "Text": " and your button might be in a different spot depending if you're on Windows or a different"
    },
    {
      "Time_Start": 531.44,
      "Time_End": 536.8000000000001,
      "Text": " device, but you can just dictate. You can do this on your phone. You can walk around and say whatever's"
    },
    {
      "Time_Start": 536.8000000000001,
      "Time_End": 542.1600000000001,
      "Text": " on your mind for any of these subsections. So this is what I did on my personal retreat. I was actually"
    },
    {
      "Time_Start": 542.16,
      "Time_End": 547.92,
      "Text": " walking around with my laptop, hit the dictate button, and then I was walking around, pacing"
    },
    {
      "Time_Start": 547.92,
      "Time_End": 552.24,
      "Text": " around the room, and I was just answering all these. That's how I was able to get through it"
    },
    {
      "Time_Start": 552.24,
      "Time_End": 558.4,
      "Text": " in just two hours. So something I ended up speaking out loud was this bullet. The other hobby that"
    },
    {
      "Time_Start": 558.4,
      "Time_End": 561.6,
      "Text": " doesn't really count would be listening to audiobooks. It's clear to me that I should have"
    },
    {
      "Time_Start": 561.6,
      "Time_End": 565.4399999999999,
      "Text": " some sort of hobby like dancing or something else that is physical but not just basic weight"
    },
    {
      "Time_Start": 565.4399999999999,
      "Time_End": 571.04,
      "Text": " training or calisthenic type of exercise. So this is me just doing a quick rundown of hobbies and"
    },
    {
      "Time_Start": 571.04,
      "Time_End": 575.1999999999999,
      "Text": " I think I had a couple other bullets, but then at the end of the day I'm just going to quickly say"
    },
    {
      "Time_Start": 575.1999999999999,
      "Time_End": 581.4399999999999,
      "Text": " currently I'm going to rate myself as a four. Ideal, it's not like I must have great hobbies,"
    },
    {
      "Time_Start": 581.4399999999999,
      "Time_End": 586.88,
      "Text": " so ideal is just a six. Whatever you feel like. I'm just going to use a scale from one to ten."
    },
    {
      "Time_Start": 586.88,
      "Time_End": 592.24,
      "Text": " We just want to quickly answer these. You don't have to use numbers. You could say the current"
    },
    {
      "Time_Start": 592.24,
      "Time_End": 599.36,
      "Text": " is not much. Ideal having something. You could say that, but for now I'll just keep it with numbers"
    },
    {
      "Time_Start": 599.36,
      "Time_End": 604.8000000000001,
      "Text": " and go four to six. Now this is crucial and there'll be another video on the roll up method"
    },
    {
      "Time_Start": 604.8000000000001,
      "Time_End": 611.6,
      "Text": " or basically a pure emergence method of making sense of things what we call like rolling up"
    },
    {
      "Time_Start": 611.6,
      "Time_End": 618.72,
      "Text": " information. So what I'm going to do now is just collapse this and roll up all that text into just"
    },
    {
      "Time_Start": 618.72,
      "Time_End": 623.36,
      "Text": " these scores so I can just see the highlight and then I'm going to roll down and get into"
    },
    {
      "Time_Start": 623.92,
      "Time_End": 629.6,
      "Text": " travel. So I'll do the same thing. Enter indent and then I'll start free writing or free talking"
    },
    {
      "Time_Start": 629.6,
      "Time_End": 633.84,
      "Text": " right here and boom this was something that was part of my reflection. I'm happy with my amount"
    },
    {
      "Time_Start": 633.84,
      "Time_End": 638.16,
      "Text": " of travel recently, but I'm less happy that some of the travel has forced me to become"
    },
    {
      "Time_Start": 638.16,
      "Time_End": 642.88,
      "Text": " behind on things like the wow workshop, one of our private behind the scenes workshops,"
    },
    {
      "Time_Start": 642.88,
      "Time_End": 648.32,
      "Text": " all the prep, and especially my book proposal. So there's like a double-edged sword. So when I"
    },
    {
      "Time_Start": 648.4000000000001,
      "Time_End": 653.7600000000001,
      "Text": " rated myself here, and this typically doesn't seem to happen, but I gave my current rating an"
    },
    {
      "Time_Start": 653.7600000000001,
      "Time_End": 658.96,
      "Text": " eight for travel, but I actually want my ideal to be a tick down a seven because I think I'm"
    },
    {
      "Time_Start": 658.96,
      "Time_End": 664.32,
      "Text": " traveling too much and it's kind of caused more stress for all my other things that I want to do."
    },
    {
      "Time_Start": 664.32,
      "Time_End": 669.36,
      "Text": " So I just gave that a score and then I collapsed that and then we go through everything. So let's"
    },
    {
      "Time_Start": 669.36,
      "Time_End": 673.9200000000001,
      "Text": " go ahead and imagine we give these other subsections score. So I'm thinking about my leisure time. What"
    },
    {
      "Time_Start": 673.92,
      "Time_End": 679.28,
      "Text": " do I do when I'm just relaxing? What does that look like? It might be similar to hobbies,"
    },
    {
      "Time_Start": 679.28,
      "Time_End": 684.3199999999999,
      "Text": " but it is a little bit different. What are you doing to relax, to unwind when you're not really"
    },
    {
      "Time_Start": 684.3199999999999,
      "Time_End": 689.8399999999999,
      "Text": " doing anything? And then what about your consuming habits? How are you engaging with content? What"
    },
    {
      "Time_Start": 689.8399999999999,
      "Time_End": 693.5999999999999,
      "Text": " does that look like? What do you like about it? What would you like to do differently? So these"
    },
    {
      "Time_Start": 693.5999999999999,
      "Time_End": 699.36,
      "Text": " are the questions that we're asking or variations of these questions for each of the subsections."
    },
    {
      "Time_Start": 699.36,
      "Time_End": 705.44,
      "Text": " And then finally experiences. When it comes to recreation, this big section, what experiences am"
    },
    {
      "Time_Start": 705.44,
      "Time_End": 711.12,
      "Text": " I having that I haven't already talked about? What are those experiences? What form are they taking?"
    },
    {
      "Time_Start": 711.12,
      "Time_End": 717.04,
      "Text": " What type of experiences do I want more of? So for all these subsections, you'll have a score"
    },
    {
      "Time_Start": 717.04,
      "Time_End": 723.2,
      "Text": " and then just kind of feel it out and overall this will allow you to roll it up into a final score."
    },
    {
      "Time_Start": 723.2,
      "Time_End": 728.96,
      "Text": " So I might say after all this that my current is a five and I'd like to get it to a six or"
    },
    {
      "Time_Start": 728.96,
      "Time_End": 734.88,
      "Text": " maybe even a seven. Now along with this final roll up, I'm going to go here and after finishing"
    },
    {
      "Time_Start": 734.88,
      "Time_End": 741.12,
      "Text": " the subsections below, I'm going to give an overall reasoning for my score. So I'm rolling up,"
    },
    {
      "Time_Start": 741.12,
      "Time_End": 747.36,
      "Text": " I'm synthesizing, I'm making sense of all of my free writing and all my free talking into"
    },
    {
      "Time_Start": 748.0,
      "Time_End": 753.0400000000001,
      "Text": " the final summary and I'm going to write that here. So my reasoning for this overall score"
    },
    {
      "Time_Start": 753.0400000000001,
      "Time_End": 758.08,
      "Text": " is here and that's for recreation. So then you repeat that process for environment,"
    },
    {
      "Time_Start": 758.08,
      "Time_End": 763.5200000000001,
      "Text": " for body, and then once you're done with those subsections and sections, it rolls up to give"
    },
    {
      "Time_Start": 763.5200000000001,
      "Time_End": 768.32,
      "Text": " you a score for lived experience. And again, it's just more of a feeling. You don't have to"
    },
    {
      "Time_Start": 768.32,
      "Time_End": 773.6800000000001,
      "Text": " be completely accurate with your math. So for my lived experience, I think my overall score ended"
    },
    {
      "Time_Start": 773.6800000000001,
      "Time_End": 780.48,
      "Text": " up being like a 6.5, which is not terribly high, it's not terribly low, but I had ideas of what I"
    },
    {
      "Time_Start": 780.48,
      "Time_End": 786.0,
      "Text": " wanted to do more of, ideas of what I wanted to do less of, and overall I felt really confident"
    },
    {
      "Time_Start": 786.0,
      "Time_End": 792.0,
      "Text": " in how I wanted to proceed with living, living my life. Okay, now you know the workflow. We"
    },
    {
      "Time_Start": 792.0,
      "Time_End": 798.0,
      "Text": " twirl down a section like recreation and then we answer all the subsections like hobbies and travel"
    },
    {
      "Time_Start": 798.0,
      "Time_End": 804.0,
      "Text": " and then we roll up with scores and then we roll up with an overall score and takeaway and then"
    },
    {
      "Time_Start": 804.0,
      "Time_End": 809.04,
      "Text": " we roll up even further to finish the lived experience section. Before we do that though,"
    },
    {
      "Time_Start": 809.04,
      "Time_End": 814.32,
      "Text": " I now want to walk you through all of the subsections with some priming questions."
    },
    {
      "Time_Start": 814.32,
      "Time_End": 818.08,
      "Text": " After you have those questions and after you see all the subsections, you'll have everything you"
    },
    {
      "Time_Start": 818.08,
      "Time_End": 823.84,
      "Text": " need to to do the epic Wheel of Life review on your own. So let's get to it. After recreation,"
    },
    {
      "Time_Start": 823.84,
      "Time_End": 828.88,
      "Text": " we're going to twirl down environment. So think about your lived experience. So much of it is"
    },
    {
      "Time_Start": 828.88,
      "Time_End": 834.4000000000001,
      "Text": " about the environment that surrounds us. It's so much of our experience. So in this one, we want"
    },
    {
      "Time_Start": 834.4000000000001,
      "Time_End": 839.6800000000001,
      "Text": " to review how we're feeling about our physical environment. Like think about where you are right"
    },
    {
      "Time_Start": 839.6800000000001,
      "Time_End": 846.48,
      "Text": " now watching this. Is that a good place? Is it uncomfortable? Is it too comfortable? Just think"
    },
    {
      "Time_Start": 846.48,
      "Time_End": 851.2,
      "Text": " about how you like that environment. What about your work environment? What about any other third"
    },
    {
      "Time_Start": 851.2,
      "Time_End": 855.5200000000001,
      "Text": " or fourth places that you spend a lot of time in? How are all these environments shaping you? How is"
    },
    {
      "Time_Start": 855.5200000000001,
      "Time_End": 860.32,
      "Text": " your town or city shaping you? Think about all of that and that's going to go into your physical"
    },
    {
      "Time_Start": 860.32,
      "Time_End": 865.36,
      "Text": " environment. So you're going to reflect on that here. Do your free writing or if you can, I really"
    },
    {
      "Time_Start": 865.36,
      "Time_End": 870.4,
      "Text": " prefer free talking for this exercise. So hit that dictate button and when you do it this way,"
    },
    {
      "Time_Start": 870.4,
      "Time_End": 875.04,
      "Text": " as we'll learn in a different video on the roll it method, you're able to do it in chunks. So it's"
    },
    {
      "Time_Start": 875.04,
      "Time_End": 879.36,
      "Text": " not like some dictation that you do for 15 minutes and you're like, I never want to look at that thing"
    },
    {
      "Time_Start": 879.36,
      "Time_End": 883.52,
      "Text": " again because I got a thousand words I have to run through. When you do it in chunks like this,"
    },
    {
      "Time_Start": 883.52,
      "Time_End": 889.9200000000001,
      "Text": " it's all usable. It's all clear and it all makes sense. So you just go bit by bit, free talk for"
    },
    {
      "Time_Start": 889.9200000000001,
      "Time_End": 897.1200000000001,
      "Text": " about 50 words to 200 words and then go on to the next bullet. So for example, it might look about"
    },
    {
      "Time_Start": 897.1200000000001,
      "Time_End": 901.6,
      "Text": " this long and then that's 50 words and then go on to the next bullet and say your next point"
    },
    {
      "Time_Start": 902.1600000000001,
      "Time_End": 908.32,
      "Text": " and so on and so forth. So that's the physical environment but part of this lived experience"
    },
    {
      "Time_Start": 908.32,
      "Time_End": 914.48,
      "Text": " of our environment is the sensory experience. So think even further. How are my senses? Like"
    },
    {
      "Time_Start": 914.48,
      "Time_End": 919.6800000000001,
      "Text": " what am I reacting to? Are you in a loud environment? Is it a quiet environment?"
    },
    {
      "Time_Start": 920.32,
      "Time_End": 926.72,
      "Text": " Is it safe? Is it full of interruptions? Think about your sensory experience that you're"
    },
    {
      "Time_Start": 926.72,
      "Time_End": 932.24,
      "Text": " currently going through day in and day out. What do you like about it? What could make it better?"
    },
    {
      "Time_Start": 932.24,
      "Time_End": 937.76,
      "Text": " So give yourself a current score and remember these current scores are not your aspirational"
    },
    {
      "Time_Start": 937.76,
      "Time_End": 943.52,
      "Text": " scores. This is where you think like how am I currently in alignment with where I think is"
    },
    {
      "Time_Start": 943.52,
      "Time_End": 949.36,
      "Text": " ideal for me and then when you get to that ideal score, think about what that would feel like."
    },
    {
      "Time_Start": 949.36,
      "Time_End": 954.3199999999999,
      "Text": " So your current score is about alignment and not outcome. So you can already be at a perfect"
    },
    {
      "Time_Start": 954.3199999999999,
      "Time_End": 958.56,
      "Text": " current score and it might match your ideal score. That doesn't mean you're exactly where you want"
    },
    {
      "Time_Start": 958.56,
      "Time_End": 962.88,
      "Text": " to be in the end game of your life. You're feeling alignment. You're in a good place. You're in a"
    },
    {
      "Time_Start": 962.88,
      "Time_End": 967.68,
      "Text": " good environment and that goes for all of these sections and subsections. So hey, moving on from"
    },
    {
      "Time_Start": 967.68,
      "Time_End": 972.64,
      "Text": " environment, let's pretend that we went through this exercise. We threw in all the text that we"
    },
    {
      "Time_Start": 972.64,
      "Time_End": 978.8,
      "Text": " want to throw in and then we rolled up those scores. Then we're going to give ourselves the"
    },
    {
      "Time_Start": 978.8,
      "Time_End": 984.0,
      "Text": " full takeaway where we made sense of all those bullets into one paragraph. Then we'll give"
    },
    {
      "Time_Start": 984.0,
      "Time_End": 990.08,
      "Text": " ourselves a score here, score here, and then we can roll up and collapse environment. We can roll"
    },
    {
      "Time_Start": 990.08,
      "Time_End": 997.04,
      "Text": " up and collapse recreation. Let's pretend environment was like a 5.5 and then we want it to be a 6."
    },
    {
      "Time_Start": 997.7600000000001,
      "Time_End": 1003.6,
      "Text": " Let's go over and twirl down body. So here we want to think about sleep. This one's pretty"
    },
    {
      "Time_Start": 1003.6,
      "Time_End": 1008.2400000000001,
      "Text": " straightforward. How am I sleeping? Could my sleep be better? Am I happy with the amount of sleep,"
    },
    {
      "Time_Start": 1008.2400000000001,
      "Time_End": 1013.5200000000001,
      "Text": " the quality of sleep, then nutrition? How is my diet? Am I eating at McDonald's every day?"
    },
    {
      "Time_Start": 1013.5200000000001,
      "Time_End": 1017.84,
      "Text": " How is that working out for me? For those that know the documentary Super Size Me,"
    },
    {
      "Time_Start": 1017.84,
      "Time_End": 1024.24,
      "Text": " Morgan Spurlock actually just passed away at the age of 53, I believe, and part of that was probably"
    },
    {
      "Time_Start": 1024.24,
      "Time_End": 1030.0,
      "Text": " not related to McDonald's, but maybe part of it was from that experience. Who knows? Point being,"
    },
    {
      "Time_Start": 1030.0,
      "Time_End": 1034.72,
      "Text": " we should be mindful of our nutrition. Then we have movement. How am I moving around generally"
    },
    {
      "Time_Start": 1034.72,
      "Time_End": 1040.56,
      "Text": " speaking? And movement is a different section than exercise. Why is that? Because exercise is more"
    },
    {
      "Time_Start": 1040.56,
      "Time_End": 1045.52,
      "Text": " intentional, it's more active. Movement, though, can just be how am I having healthy habits"
    },
    {
      "Time_Start": 1045.52,
      "Time_End": 1050.32,
      "Text": " throughout the day? That distinction is important for many of us working out in the world and it's"
    },
    {
      "Time_Start": 1050.32,
      "Time_End": 1056.1599999999999,
      "Text": " important to have. Just because you exercise for 30 minutes or 20 minutes even at one point of the"
    },
    {
      "Time_Start": 1056.1599999999999,
      "Time_End": 1060.32,
      "Text": " day, if the rest of your day you're stuck in a chair and you're not moving at all, that's something"
    },
    {
      "Time_Start": 1060.32,
      "Time_End": 1064.96,
      "Text": " that we want to bring attention towards. That's why we have that separate bullet for you to work"
    },
    {
      "Time_Start": 1064.96,
      "Time_End": 1068.1599999999999,
      "Text": " through. So let's pretend you work through all those. Then you can twirl that one up. Maybe you"
    },
    {
      "Time_Start": 1068.1599999999999,
      "Time_End": 1073.6,
      "Text": " gave it a final score and you said, well, actually the body could be a lot better there. It's a four,"
    },
    {
      "Time_Start": 1073.6,
      "Time_End": 1078.3999999999999,
      "Text": " I want to make it a seven. So based on all of these that you've twirled from the bottom up,"
    },
    {
      "Time_Start": 1079.1200000000001,
      "Time_End": 1085.6000000000001,
      "Text": " rolling up all this knowledge, layering in your understanding as you go, for the lived experience"
    },
    {
      "Time_Start": 1085.6000000000001,
      "Time_End": 1091.52,
      "Text": " section, for this category, you can give it your score and maybe I say it's a six. Again, it's just"
    },
    {
      "Time_Start": 1091.52,
      "Time_End": 1096.8000000000002,
      "Text": " kind of what I think my current score is and then that's going to roll up again to this overall"
    },
    {
      "Time_Start": 1096.8000000000002,
      "Time_End": 1101.6000000000001,
      "Text": " assessment at the top. Now before we get to that overall assessment, that's the final end of the"
    },
    {
      "Time_Start": 1101.6000000000001,
      "Time_End": 1107.1200000000001,
      "Text": " rainbow. So we're not there yet. Now I can actually collapse lived experience. So it's just a single"
    },
    {
      "Time_Start": 1107.1200000000001,
      "Time_End": 1112.0000000000002,
      "Text": " line. All that work has now collapsed into a single line. Let's quickly go through relationships"
    },
    {
      "Time_Start": 1112.0000000000002,
      "Time_End": 1116.0800000000002,
      "Text": " and work. I just want to give you a few priming questions so that you can go through this. You"
    },
    {
      "Time_Start": 1116.0800000000002,
      "Time_End": 1121.1200000000001,
      "Text": " can follow along with me, kind of use me to kind of prime your responses or just go through it"
    },
    {
      "Time_Start": 1121.1200000000001,
      "Time_End": 1126.4,
      "Text": " immediately. And then afterwards, when you have the time, you can go through the whole epic wheel"
    },
    {
      "Time_Start": 1126.4,
      "Time_End": 1131.2800000000002,
      "Text": " of life review on your own terms. All right, so first let's start with the soul. The soul,"
    },
    {
      "Time_Start": 1131.2800000000002,
      "Time_End": 1136.3200000000002,
      "Text": " what is this soul? Let's not go into definitions right now, but let's answer these two subsections."
    },
    {
      "Time_Start": 1137.04,
      "Time_End": 1140.8799999999999,
      "Text": " How do you feel you're doing with your life purpose? If any of you have read the book,"
    },
    {
      "Time_Start": 1140.8799999999999,
      "Time_End": 1146.1599999999999,
      "Text": " The Alchemist, that's called the personal legend. What is this thing that you're just drawn to that"
    },
    {
      "Time_Start": 1146.1599999999999,
      "Time_End": 1152.0,
      "Text": " is your personal legend that your heart is calling you towards? Maybe this is just general personal"
    },
    {
      "Time_Start": 1152.0,
      "Time_End": 1158.3999999999999,
      "Text": " discovery. Whatever it is, go ahead, hit enter, hit indent, and start free writing or free talking."
    },
    {
      "Time_Start": 1159.12,
      "Time_End": 1165.76,
      "Text": " Same thing, spirituality. Whatever that means to you, there should be some component of it"
    },
    {
      "Time_Start": 1165.76,
      "Time_End": 1170.08,
      "Text": " in your life. And if you say that there shouldn't be a component in your life, just give it a low"
    },
    {
      "Time_Start": 1170.08,
      "Time_End": 1175.12,
      "Text": " score and then you'll have that as a data point. Maybe five years later, you feel like maybe"
    },
    {
      "Time_Start": 1175.12,
      "Time_End": 1179.52,
      "Text": " something's missing. Maybe there's something you can add from spirituality. I don't want to preach"
    },
    {
      "Time_Start": 1179.52,
      "Time_End": 1183.36,
      "Text": " or tell you what to do. It's just something that we should consider. It's an element of life."
    },
    {
      "Time_Start": 1184.08,
      "Time_End": 1189.2,
      "Text": " However, we engage with it is important to note. So you do your work there. You can then roll those"
    },
    {
      "Time_Start": 1189.2,
      "Time_End": 1194.72,
      "Text": " up and then we're done with soul. We can give soul a score. Let's say, hey, we're at a six there,"
    },
    {
      "Time_Start": 1194.72,
      "Time_End": 1198.96,
      "Text": " but we want it to be more of a seven. If I know for sure I'm at the end of life, I'm going to say,"
    },
    {
      "Time_Start": 1198.96,
      "Time_End": 1203.76,
      "Text": " I really need to bump this thing up. I need to get my affairs in order. Just a consideration."
    },
    {
      "Time_Start": 1203.76,
      "Time_End": 1207.76,
      "Text": " Let's go into partnership. That's going to mean something different for all of us. But what I"
    },
    {
      "Time_Start": 1207.76,
      "Time_End": 1214.64,
      "Text": " want to stress here is that there's some sort of intimacy or closeness. How are we doing in our life"
    },
    {
      "Time_Start": 1214.64,
      "Time_End": 1220.48,
      "Text": " with intimacy and with closeness? So you could have a lifelong partner, but you might not be intimate"
    },
    {
      "Time_Start": 1220.48,
      "Time_End": 1225.52,
      "Text": " or close at all. Or you might not have that partner, but you might feel in your relationships,"
    },
    {
      "Time_Start": 1225.52,
      "Time_End": 1230.64,
      "Text": " in your life, you are very intimate and close with these individuals. You're able to be vulnerable."
    },
    {
      "Time_Start": 1230.64,
      "Time_End": 1235.68,
      "Text": " So whatever that means for you. Now, there is another section on romance. Depending on where"
    },
    {
      "Time_Start": 1235.68,
      "Time_End": 1240.48,
      "Text": " you are and what resonates with you, you'll just want to know where you're at. The score is just"
    },
    {
      "Time_Start": 1240.48,
      "Time_End": 1246.88,
      "Text": " reflective of that. It's auditing where you are in life and how that might affect how you feel and"
    },
    {
      "Time_Start": 1246.88,
      "Time_End": 1252.0800000000002,
      "Text": " where you might want to go. And then last, let's not forget fun and lightness. Romance can be pretty"
    },
    {
      "Time_Start": 1252.0800000000002,
      "Time_End": 1256.16,
      "Text": " serious and intense sometimes, but where's the fun and the lightness when it comes to our"
    },
    {
      "Time_Start": 1256.16,
      "Time_End": 1262.0,
      "Text": " relationships? Want to make sure that we have a category that we can reflect on. So that's why"
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1266.4,
      "Text": " that's there. Now, let's pretend we're done with partnership. Now we have family and friends. So"
    },
    {
      "Time_Start": 1266.4,
      "Time_End": 1271.0400000000002,
      "Text": " let's twirl down family. Two categories I want to look at. One is family connection. How are we"
    },
    {
      "Time_Start": 1271.0400000000002,
      "Time_End": 1275.6000000000001,
      "Text": " feeling connected with whatever we call family? Now, for most of us, that will actually be blood"
    },
    {
      "Time_Start": 1275.6000000000001,
      "Time_End": 1282.4800000000002,
      "Text": " family, but it doesn't have to be. It can be whatever, whoever we think of as family. And how"
    },
    {
      "Time_Start": 1282.4800000000002,
      "Time_End": 1287.3600000000001,
      "Text": " is that family health? Now, what I mean by health is kind of twofold. One is how is the actual health,"
    },
    {
      "Time_Start": 1287.3600000000001,
      "Time_End": 1293.0400000000002,
      "Text": " like the physical health of everyone, but how is the emotional health? These are about relationships."
    },
    {
      "Time_Start": 1293.0400000000002,
      "Time_End": 1299.1200000000001,
      "Text": " So what can we do with relationships to strengthen that health? So maybe there hasn't been a family"
    },
    {
      "Time_Start": 1299.1200000000001,
      "Time_End": 1304.96,
      "Text": " reunion in a while, or maybe you weren't at the last three, like myself. Well, I'll be going"
    },
    {
      "Time_Start": 1306.0800000000002,
      "Time_End": 1312.8000000000002,
      "Text": " tomorrow to celebrate an annual family reunion with my extended family. So I definitely have"
    },
    {
      "Time_Start": 1312.8000000000002,
      "Time_End": 1317.8400000000001,
      "Text": " put some emphasis on this and want to take advantage of that. And let's not forget friends."
    },
    {
      "Time_Start": 1317.8400000000001,
      "Time_End": 1321.8400000000001,
      "Text": " Now the friends category, you can see that as you live longer and longer in life,"
    },
    {
      "Time_Start": 1322.5600000000002,
      "Time_End": 1328.88,
      "Text": " you might find the need to partition out how you think of friends. So for me, and what I think"
    },
    {
      "Time_Start": 1328.88,
      "Time_End": 1332.88,
      "Text": " will resonate with a lot of different people and different ranges of life is that you have close"
    },
    {
      "Time_Start": 1332.88,
      "Time_End": 1337.68,
      "Text": " friends. You have old friends who sometimes are close, but not, but they're still important."
    },
    {
      "Time_Start": 1337.68,
      "Time_End": 1342.8000000000002,
      "Text": " You still want to make space with them and think about how you're maintaining or not maintaining"
    },
    {
      "Time_Start": 1342.8000000000002,
      "Time_End": 1349.2,
      "Text": " relationships there. Because remember, this whole category is about relationships. So then with"
    },
    {
      "Time_Start": 1349.2,
      "Time_End": 1356.0,
      "Text": " friends, we also have community and social connections. So some social connections might"
    },
    {
      "Time_Start": 1356.0,
      "Time_End": 1362.0,
      "Text": " be work-related. If you go into the office, those are social connections. Or the broader community"
    },
    {
      "Time_Start": 1362.0,
      "Time_End": 1366.88,
      "Text": " might be your neighbors or just other social groups you're a part of. And then there's this"
    },
    {
      "Time_Start": 1366.88,
      "Time_End": 1372.8,
      "Text": " fourth one that will be interesting to some of you here. Friends that are protomoy. So protomoy is a"
    },
    {
      "Time_Start": 1372.8,
      "Time_End": 1379.2,
      "Text": " Greek word that meant first among equals. So it's just a nice way to say all friends matter, all"
    },
    {
      "Time_Start": 1379.2,
      "Time_End": 1384.56,
      "Text": " people matter, but there are certain friends that you might, for whatever reason, wherever you are"
    },
    {
      "Time_Start": 1384.56,
      "Time_End": 1389.52,
      "Text": " in life, they're the protomoy. They're kind of like the first among equals. So we don't have to"
    },
    {
      "Time_Start": 1389.52,
      "Time_End": 1394.8799999999999,
      "Text": " say who they are exactly. They will always change. But how are you doing with those relationships,"
    },
    {
      "Time_Start": 1395.44,
      "Time_End": 1400.56,
      "Text": " those friends that you cherish so much that you want to really make sure that they have a"
    },
    {
      "Time_Start": 1400.56,
      "Time_End": 1404.8,
      "Text": " special space? They might not always be close friends, and that's why we have a separate space"
    },
    {
      "Time_Start": 1404.8,
      "Time_End": 1410.08,
      "Text": " for that. They might not always be old friends. That's why we have this fourth space where we can"
    },
    {
      "Time_Start": 1410.08,
      "Time_End": 1417.28,
      "Text": " analyze all of that. Congratulations. If you've made it this far, you have finished at least the"
    },
    {
      "Time_Start": 1417.28,
      "Time_End": 1422.24,
      "Text": " priming and prompting for the relationships section. So let's imagine we score all these,"
    },
    {
      "Time_Start": 1422.24,
      "Time_End": 1428.08,
      "Text": " and at the end of the day, we say, I've been working really hard personally. And that's been"
    },
    {
      "Time_Start": 1428.08,
      "Time_End": 1433.6799999999998,
      "Text": " at the sacrifice of my relationships. So maybe my relationships are five. Now we're going to continue"
    },
    {
      "Time_Start": 1433.68,
      "Time_End": 1441.04,
      "Text": " to roll up all this information and collapse that to a single line. Lived experience, six."
    },
    {
      "Time_Start": 1441.04,
      "Time_End": 1446.3200000000002,
      "Text": " Relationships, five. We have one more big section to go through, and that is work. So with work,"
    },
    {
      "Time_Start": 1446.3200000000002,
      "Time_End": 1453.1200000000001,
      "Text": " we have three subsections, and that's going to be work itself, finances, and then in this epic"
    },
    {
      "Time_Start": 1453.1200000000001,
      "Time_End": 1458.0,
      "Text": " Wheel of Life review, we're throwing in the mind here. The mind kind of goes everywhere. So we're"
    },
    {
      "Time_Start": 1458.0,
      "Time_End": 1461.2,
      "Text": " just throwing in the mind at the very end. It's the last thing that we're going to look at."
    },
    {
      "Time_Start": 1461.76,
      "Time_End": 1467.28,
      "Text": " So if I twirl down work, there are four subsections here. First with work is your"
    },
    {
      "Time_Start": 1467.28,
      "Time_End": 1472.64,
      "Text": " career or business health and trajectory. So let's look at those together. How are you doing there?"
    },
    {
      "Time_Start": 1472.64,
      "Time_End": 1477.3600000000001,
      "Text": " How do you feel about your career health? How about its trajectory? What can you do to improve"
    },
    {
      "Time_Start": 1477.3600000000001,
      "Time_End": 1482.8,
      "Text": " it? What does it look like? How can you strengthen it and be happier about it? In the next one,"
    },
    {
      "Time_Start": 1482.8,
      "Time_End": 1488.64,
      "Text": " we cover a term called protomoy relationships. So what's interesting is in relationships,"
    },
    {
      "Time_Start": 1488.64,
      "Time_End": 1493.6000000000001,
      "Text": " in friends, we have friends that are protomoy, but this category, first among equals, is so"
    },
    {
      "Time_Start": 1493.6000000000001,
      "Time_End": 1500.24,
      "Text": " important, it also flavors work relationships. So you might have those people in work that are"
    },
    {
      "Time_Start": 1500.24,
      "Time_End": 1507.1200000000001,
      "Text": " first among equals, but let's analyze them separately because they're not always friends."
    },
    {
      "Time_Start": 1507.1200000000001,
      "Time_End": 1512.0800000000002,
      "Text": " They're not always in that same ballpark, and so I do find that this distinction is helpful for me"
    },
    {
      "Time_Start": 1512.0800000000002,
      "Time_End": 1517.92,
      "Text": " to recognize that there are certain relationships that I do want to cultivate and nurture in my"
    },
    {
      "Time_Start": 1517.92,
      "Time_End": 1523.28,
      "Text": " career, but I don't necessarily want to think of those relationships as friends. We should be okay"
    },
    {
      "Time_Start": 1523.28,
      "Time_End": 1527.44,
      "Text": " with that. We should be comfortable with that. We should create a space so we can think about"
    },
    {
      "Time_Start": 1527.44,
      "Time_End": 1532.24,
      "Text": " that differently. So that's what we're doing here. And then the third one, how is my creation or"
    },
    {
      "Time_Start": 1532.24,
      "Time_End": 1538.72,
      "Text": " production? How am I creating things, doing things in work that have actual outputs"
    },
    {
      "Time_Start": 1539.92,
      "Time_End": 1544.88,
      "Text": " that people can see and measure? How is that looking? If you're a content creator, that's"
    },
    {
      "Time_Start": 1544.88,
      "Time_End": 1548.88,
      "Text": " maybe creating a new video. If you're in the office and you're working on spreadsheets,"
    },
    {
      "Time_Start": 1548.88,
      "Time_End": 1553.44,
      "Text": " that might just be completing a spreadsheet or updating a spreadsheet, and could be a million"
    },
    {
      "Time_Start": 1553.44,
      "Time_End": 1559.44,
      "Text": " different things, but how are you feeling in your creation process or in your production process?"
    },
    {
      "Time_Start": 1559.44,
      "Time_End": 1563.44,
      "Text": " That's what we look at there. Productivity comes into place there. And then last,"
    },
    {
      "Time_Start": 1563.44,
      "Time_End": 1569.8400000000001,
      "Text": " sense of contribution. We can be really productive. We can know that we are targeting the right people"
    },
    {
      "Time_Start": 1569.8400000000001,
      "Time_End": 1575.2,
      "Text": " in our career. We can have a good health and trajectory, but how do we feel about"
    },
    {
      "Time_Start": 1575.2,
      "Time_End": 1581.3600000000001,
      "Text": " our sense of contribution? Is this filling us up? Extremely important that we understand how we can"
    },
    {
      "Time_Start": 1581.3600000000001,
      "Time_End": 1586.4,
      "Text": " improve this score in whatever our work situation looks like. All right, let's pretend we got through"
    },
    {
      "Time_Start": 1586.4,
      "Time_End": 1591.5200000000002,
      "Text": " that. Two more to go. So finances. Of course we have to cover finances. We can't pretend"
    },
    {
      "Time_Start": 1591.5200000000002,
      "Time_End": 1598.4,
      "Text": " that finances are not part of an overall holistic wheel of life experience. So with finances, we're"
    },
    {
      "Time_Start": 1598.4,
      "Time_End": 1602.88,
      "Text": " going to look at net worth. Whatever your net worth is, however you're going to calculate it,"
    },
    {
      "Time_Start": 1603.6000000000001,
      "Time_End": 1609.68,
      "Text": " put something down on paper because now you have something to compare future you towards. And if"
    },
    {
      "Time_Start": 1609.68,
      "Time_End": 1614.24,
      "Text": " you've done it before, you can compare current you to past you. And this can give you a sense"
    },
    {
      "Time_Start": 1614.24,
      "Time_End": 1621.2800000000002,
      "Text": " of where you are and can allow you something really valuable. Clarity. And you can do stuff"
    },
    {
      "Time_Start": 1621.2800000000002,
      "Time_End": 1624.96,
      "Text": " with clarity. But if you don't have that clarity, what are you going to do? So that's what we're"
    },
    {
      "Time_Start": 1624.96,
      "Time_End": 1631.76,
      "Text": " doing with net worth. And then tied into work is cash flow. What does your monthly cash flow"
    },
    {
      "Time_Start": 1631.76,
      "Time_End": 1637.28,
      "Text": " look like? Are you happy with that? Most people aren't always happy. They want to improve these"
    },
    {
      "Time_Start": 1637.28,
      "Time_End": 1642.0,
      "Text": " things. Well, what does it look like to improve? What's realistic? What's the time frame for that"
    },
    {
      "Time_Start": 1642.0,
      "Time_End": 1647.52,
      "Text": " type of improvement? And then third, what's your sense of control and confidence in your finances?"
    },
    {
      "Time_Start": 1647.52,
      "Time_End": 1650.88,
      "Text": " So you'll have a net worth, you'll have some cash flow coming in, whatever that looks like."
    },
    {
      "Time_Start": 1650.88,
      "Time_End": 1655.44,
      "Text": " But how much control or confidence do you have in where you are and where you would like to go?"
    },
    {
      "Time_Start": 1656.16,
      "Time_End": 1659.68,
      "Text": " And then last, the mind. Almost saving the best for last, depending on who you are."
    },
    {
      "Time_Start": 1659.68,
      "Time_End": 1665.3600000000001,
      "Text": " How's my sense of learning? Do I feel like I'm learning new things? Then second category,"
    },
    {
      "Time_Start": 1665.3600000000001,
      "Time_End": 1669.7600000000002,
      "Text": " how's my sense of sense making? So we can be exposed to a lot of stuff. We can be feeding"
    },
    {
      "Time_Start": 1669.7600000000002,
      "Time_End": 1674.3200000000002,
      "Text": " our curiosity. But if we take it a little bit further, then that's when it becomes the sense"
    },
    {
      "Time_Start": 1674.3200000000002,
      "Time_End": 1680.48,
      "Text": " making. So how am I making sense of my world? Am I spending extra time reflecting on conversations"
    },
    {
      "Time_Start": 1680.48,
      "Time_End": 1688.4,
      "Text": " I've had or trying to connect ideas to other ideas? Or how am I growing in knowledge and"
    },
    {
      "Time_Start": 1688.4,
      "Time_End": 1693.04,
      "Text": " hopefully wisdom? That's what we're trying to understand here. And that does tie into,"
    },
    {
      "Time_Start": 1693.04,
      "Time_End": 1699.6,
      "Text": " but it's slightly different than a sense of personal growth. Do I feel like I'm growing"
    },
    {
      "Time_Start": 1699.6,
      "Time_End": 1705.04,
      "Text": " as a person, as a human being? Where's my sense of that like? I can tell you when I'm buried in"
    },
    {
      "Time_Start": 1705.04,
      "Time_End": 1709.92,
      "Text": " my work and I'm just churning out the next thing, I might be learning, I might be sense making,"
    },
    {
      "Time_Start": 1709.92,
      "Time_End": 1714.88,
      "Text": " but I might not necessarily feel that I'm tied into a sense of personal growth. So there you"
    },
    {
      "Time_Start": 1714.88,
      "Time_End": 1720.0,
      "Text": " have it. Those are all the prompting questions. So based on all these, let's give ourselves a work"
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1727.2,
      "Text": " score. And you know, I probably score quite high there these days. Too high. So let's give work a"
    },
    {
      "Time_Start": 1727.2,
      "Time_End": 1733.68,
      "Text": " score of eight. So now I twirled that up. I rolled up all of this. This is a method of starting from"
    },
    {
      "Time_Start": 1733.68,
      "Time_End": 1739.92,
      "Text": " the bottom and rolling up. Every time that we roll up information, we're deepening and layering"
    },
    {
      "Time_Start": 1739.92,
      "Time_End": 1744.8,
      "Text": " our understanding and it's giving us more confident where we are and where we would like to go. So"
    },
    {
      "Time_Start": 1744.8,
      "Time_End": 1754.48,
      "Text": " based on all these, I'm going to type out my final reflections here. As I'm articulating what really"
    },
    {
      "Time_Start": 1754.48,
      "Time_End": 1758.8,
      "Text": " stood out to me, what you want to do here is give your reasoning for your overall score. What really"
    },
    {
      "Time_Start": 1758.8,
      "Time_End": 1762.8,
      "Text": " stood out to you out of all this. And you'll usually feel it multiple times as you're going"
    },
    {
      "Time_Start": 1762.8,
      "Time_End": 1766.56,
      "Text": " through this. You might unexpectedly be talking about all sorts of things that you didn't even"
    },
    {
      "Time_Start": 1766.56,
      "Time_End": 1772.0,
      "Text": " know. That's something that we'll cover in the hidden takeaways. The stuff that this bubbles up,"
    },
    {
      "Time_Start": 1772.0,
      "Time_End": 1777.04,
      "Text": " that this reflection bubbles up. But at the end of the day, you'll put in your final reflections"
    },
    {
      "Time_Start": 1777.04,
      "Time_End": 1783.84,
      "Text": " here and you'll give yourself the overall score. So I think my overall score is like a 5.5 or a"
    },
    {
      "Time_Start": 1783.84,
      "Time_End": 1790.72,
      "Text": " 6.5, which feels fairly low, but I'm about to say why it was the most beautiful thing ever. And if"
    },
    {
      "Time_Start": 1790.72,
      "Time_End": 1794.88,
      "Text": " you're following along with me, this is a great time to hit pause, fill in your answers now,"
    },
    {
      "Time_Start": 1794.88,
      "Time_End": 1804.08,
      "Text": " and then when you're ready, hit play again. Okay. Wow. If you've gone through all this"
    },
    {
      "Time_Start": 1804.08,
      "Time_End": 1808.24,
      "Text": " walkthrough so far, I'm glad you're still here because there are some really important takeaways"
    },
    {
      "Time_Start": 1808.24,
      "Time_End": 1814.4,
      "Text": " and I want to share with you a sneak peek into some of my final reasonings for my overall score."
    },
    {
      "Time_Start": 1814.4,
      "Time_End": 1822.0,
      "Text": " So now me personally, my score after this two hour really intense assessment was 5.5 and you"
    },
    {
      "Time_Start": 1822.0,
      "Time_End": 1826.96,
      "Text": " might think I should be upset with that or disappointed. Quite the opposite. So I actually"
    },
    {
      "Time_Start": 1826.96,
      "Time_End": 1833.92,
      "Text": " wanted to share with you my exact takeaways. So two hours later, you can put in your final"
    },
    {
      "Time_Start": 1833.92,
      "Time_End": 1838.5600000000002,
      "Text": " reflections and let me just twirl down. What you see on screen is what I wrote with a little bit"
    },
    {
      "Time_Start": 1838.5600000000002,
      "Time_End": 1843.8400000000001,
      "Text": " redacted, but let me just read this out loud. It's funny as I look at the score 5.5, which kind of"
    },
    {
      "Time_Start": 1843.8400000000001,
      "Time_End": 1851.2800000000002,
      "Text": " seems alarming. I'm leaving this entire exercise feeling okay with myself and my current trajectory."
    },
    {
      "Time_Start": 1851.2800000000002,
      "Time_End": 1857.8400000000001,
      "Text": " And this is because the exercise helped me gain even more clarity by articulating answers for each"
    },
    {
      "Time_Start": 1857.8400000000001,
      "Time_End": 1865.1200000000001,
      "Text": " of these unique lenses. While redacted, redacted, redacted, the exercise has given me relief in its"
    },
    {
      "Time_Start": 1865.1200000000001,
      "Time_End": 1870.16,
      "Text": " clear conclusions. And that leaves me feeling good. Even understanding that my current score"
    },
    {
      "Time_Start": 1870.24,
      "Time_End": 1875.0400000000002,
      "Text": " is 5.5. And then I go further in a different bullet because that was good chunk. And now this"
    },
    {
      "Time_Start": 1875.0400000000002,
      "Time_End": 1879.28,
      "Text": " is a different topic. If I never do another Wheel of Life again, and you can tell it's not capitalized"
    },
    {
      "Time_Start": 1879.28,
      "Time_End": 1884.5600000000002,
      "Text": " so I was dictating this, that's fine because I've dictated and written over 4,600 words. It'll all"
    },
    {
      "Time_Start": 1884.5600000000002,
      "Time_End": 1889.92,
      "Text": " be okay because this single exercise has helped propel me to the next phase of my life's quest."
    },
    {
      "Time_Start": 1889.92,
      "Time_End": 1894.8000000000002,
      "Text": " So you could tell I'm kind of poetic there. I'm feeling pretty pumped with a 5.5 score. Like how"
    },
    {
      "Time_Start": 1894.8000000000002,
      "Time_End": 1899.52,
      "Text": " wild is that? So I'm going to share a next action and takeaway from this too, because that's what"
    },
    {
      "Time_Start": 1899.52,
      "Time_End": 1904.6399999999999,
      "Text": " you want to get to. But before we even get there, there's a hidden little header at the very bottom"
    },
    {
      "Time_Start": 1904.6399999999999,
      "Time_End": 1908.6399999999999,
      "Text": " of this template. And I want to share that with you now because it's really important as you look"
    },
    {
      "Time_Start": 1908.6399999999999,
      "Time_End": 1912.72,
      "Text": " at your score and make sense of it. Be kind to yourself. So if you click this call out,"
    },
    {
      "Time_Start": 1913.68,
      "Time_End": 1919.04,
      "Text": " be kind to yourself. And the best way you can do that is by being honest. That's the best way you"
    },
    {
      "Time_Start": 1919.04,
      "Time_End": 1925.68,
      "Text": " can be kind to yourself. Because the hidden benefit isn't some stupid score, some number,"
    },
    {
      "Time_Start": 1925.68,
      "Time_End": 1930.5600000000002,
      "Text": " it's the hidden emotions and the deeper understandings that this exercise will bubble"
    },
    {
      "Time_Start": 1930.5600000000002,
      "Time_End": 1937.44,
      "Text": " up out of you. It's the clarity and confidence that the exercise creates. So this is truly one"
    },
    {
      "Time_Start": 1937.44,
      "Time_End": 1942.3200000000002,
      "Text": " of those times where it's not the destination, it's the journey. If you go through this journey,"
    },
    {
      "Time_Start": 1942.3200000000002,
      "Time_End": 1948.8,
      "Text": " you'll be so happy with the destination, even if you score 5.5 or less. So again, it's not about"
    },
    {
      "Time_Start": 1948.8,
      "Time_End": 1953.44,
      "Text": " a number. It's not about the score. It's about being kind to yourself by being honest with"
    },
    {
      "Time_Start": 1953.44,
      "Time_End": 1958.72,
      "Text": " yourself. Then you'll have a bad score and you'll feel great about it. Now, final thing,"
    },
    {
      "Time_Start": 1958.72,
      "Time_End": 1962.56,
      "Text": " you have a great score. You did all this work. I'm going to ask you to at least come up with"
    },
    {
      "Time_Start": 1962.56,
      "Time_End": 1967.04,
      "Text": " a few different actions and takeaways. So I'll give you one example that I can share. I'm going"
    },
    {
      "Time_Start": 1967.04,
      "Time_End": 1971.76,
      "Text": " to twirl this one down. This is a real next action and takeaway that I came up with after"
    },
    {
      "Time_Start": 1971.76,
      "Time_End": 1976.72,
      "Text": " my big personal retreat. There are about eight personal ones, but this is definitely one that"
    },
    {
      "Time_Start": 1976.72,
      "Time_End": 1982.8,
      "Text": " I can share. That's not too personal. It's as simple as this. I'm giving myself an instructive."
    },
    {
      "Time_Start": 1982.8,
      "Time_End": 1988.32,
      "Text": " Live a lifestyle with movement and vitality. Significantly changed my current lifestyle"
    },
    {
      "Time_Start": 1988.32,
      "Time_End": 1994.8,
      "Text": " from what I feel is a sedentary one back to one with movement and vitality. So I'm giving myself"
    },
    {
      "Time_Start": 1994.8,
      "Time_End": 2000.6399999999999,
      "Text": " a very high level instructive. Now, since this has happened about three, four weeks ago,"
    },
    {
      "Time_Start": 2000.6399999999999,
      "Time_End": 2006.08,
      "Text": " I've been spending more time on the floor, moving around. I've been doing like primal crawls. I've"
    },
    {
      "Time_Start": 2006.08,
      "Time_End": 2011.28,
      "Text": " been doing all sorts of really fun things, getting back in touch with my body, understanding how to"
    },
    {
      "Time_Start": 2011.28,
      "Time_End": 2016.0,
      "Text": " make it work the way it naturally wants to work. It doesn't want to sit in this chair all day."
    },
    {
      "Time_Start": 2016.0,
      "Time_End": 2021.84,
      "Text": " If I'm on the ground, I'm naturally working my fascia, the connective tissue of the body."
    },
    {
      "Time_Start": 2021.84,
      "Time_End": 2027.84,
      "Text": " I'm naturally getting rid of aches and pains, becoming more mobile, more resistant and anti-fragile"
    },
    {
      "Time_Start": 2027.84,
      "Time_End": 2032.96,
      "Text": " to injuries as I age. All these things are happening just by one simple thing, spending"
    },
    {
      "Time_Start": 2032.96,
      "Time_End": 2037.6,
      "Text": " a little bit of time on the floor, on the ground. And that's just but one area where I'm trying to"
    },
    {
      "Time_Start": 2037.6000000000001,
      "Time_End": 2041.8400000000001,
      "Text": " live more of a lifestyle with movement and vitality. So with your next actions and your"
    },
    {
      "Time_Start": 2041.8400000000001,
      "Time_End": 2048.0,
      "Text": " takeaways, try to make it an instructive. That's basically an instruction to your current self."
    },
    {
      "Time_Start": 2048.0,
      "Time_End": 2053.04,
      "Text": " Live a lifestyle with movement and vitality and then a little bit of detail to follow one"
    },
    {
      "Time_Start": 2053.04,
      "Time_End": 2060.08,
      "Text": " sentence afterwards and that's all you need. So we're rolling up waves and waves of information"
    },
    {
      "Time_Start": 2060.08,
      "Time_End": 2064.8,
      "Text": " coming from parts of us that we didn't even know that were there. They've just been bubbling up"
    },
    {
      "Time_Start": 2064.8,
      "Time_End": 2070.8,
      "Text": " and we've been synthesizing and distilling and encapsulating them into takeaways that are"
    },
    {
      "Time_Start": 2070.8,
      "Time_End": 2076.6400000000003,
      "Text": " actionable and that we can practice immediately. And there you have it, the epic, and this was epic,"
    },
    {
      "Time_Start": 2076.6400000000003,
      "Time_End": 2082.88,
      "Text": " Wheel of Life review. Just so you know, there are 32 subsections in this review. That's as many as"
    },
    {
      "Time_Start": 2082.88,
      "Time_End": 2088.7200000000003,
      "Text": " the flavors at Baskin Robbins. 32 subsections. And at the end of this, you should have such clarity"
    },
    {
      "Time_Start": 2088.7200000000003,
      "Time_End": 2092.96,
      "Text": " and confidence of where you are in life and where you would like to go. Now as a reminder,"
    },
    {
      "Time_Start": 2092.96,
      "Time_End": 2099.92,
      "Text": " the template is in the description below and this recording is not going away. You can revisit this"
    },
    {
      "Time_Start": 2099.92,
      "Time_End": 2106.48,
      "Text": " recording at any time along with that template and you can walk through this Wheel of Life review"
    },
    {
      "Time_Start": 2106.48,
      "Time_End": 2111.68,
      "Text": " at your own pace. So keep that in mind. This can be a one and done. You can do it one time and get"
    },
    {
      "Time_Start": 2111.68,
      "Time_End": 2117.2,
      "Text": " so much benefit out of it, especially that first time, but it's just equally as powerful to come"
    },
    {
      "Time_Start": 2117.2,
      "Time_End": 2122.96,
      "Text": " back to it six months later, 12 months later. So just remember, you can revisit this recording"
    },
    {
      "Time_Start": 2122.96,
      "Time_End": 2127.68,
      "Text": " at any time. I really encourage you to and consider how you can engage in the comments."
    },
    {
      "Time_Start": 2127.68,
      "Time_End": 2131.7599999999998,
      "Text": " Let everybody know how you're doing because you might just inspire somebody else to keep"
    },
    {
      "Time_Start": 2131.7599999999998,
      "Time_End": 2136.56,
      "Text": " their Wheel of Life review rolling. And until next time, stay connected."
    }
  ]
}