{"segments": [{"Time_Start": 0.0, "Time_End": 8.0, "Text": " Holy shit. Can you imagine two stegger lectures in a row?"}, {"Time_Start": 8.0, "Time_End": 13.0, "Text": " Who in the hell plan that, right?"}, {"Time_Start": 13.0, "Time_End": 16.0, "Text": " How many of us said through the first one?"}, {"Time_Start": 16.0, "Time_End": 20.0, "Text": " All right, how many of you have been in sales before?"}, {"Time_Start": 20.0, "Time_End": 23.0, "Text": " All right, for those of you who have ever bought anything,"}, {"Time_Start": 23.0, "Time_End": 26.0, "Text": " okay, we got everybody now, right?"}, {"Time_Start": 26.0, "Time_End": 28.0, "Text": " You gotta hear it a lot of times to learn it, so"}, {"Time_Start": 28.0, "Time_End": 29.0, "Text": " I didn't know I was following."}, {"Time_Start": 29.0, "Time_End": 32.0, "Text": " I didn't know I was following a lecture on Stego."}, {"Time_Start": 32.0, "Time_End": 33.0, "Text": " This should be fun."}, {"Time_Start": 33.0, "Time_End": 37.0, "Text": " So I have, I'm going to get to repeat everything that you've already heard."}, {"Time_Start": 37.0, "Time_End": 39.0, "Text": " I'll do it quick."}, {"Time_Start": 39.0, "Time_End": 42.0, "Text": " I'll try and keep it as un-boring as possible"}, {"Time_Start": 42.0, "Time_End": 45.0, "Text": " and get you guys out of here because, God, is it hot?"}, {"Time_Start": 45.0, "Time_End": 47.0, "Text": " Who's hot?"}, {"Time_Start": 47.0, "Time_End": 50.0, "Text": " Feel free to remove your shirts as necessary."}, {"Time_Start": 50.0, "Time_End": 53.0, "Text": " Hey, it was an open offer."}, {"Time_Start": 53.0, "Time_End": 55.0, "Text": " Somebody's got to say it."}, {"Time_Start": 55.0, "Time_End": 56.0, "Text": " My name is Mike Rogers."}, {"Time_Start": 56.0, "Time_End": 58.0, "Text": " I'm going to be lecturing on Stegonographic Trojans today."}, {"Time_Start": 58.0, "Time_End": 62.0, "Text": " today. The Senior Security Engineer for Exceptional Software Strategies,"}, {"Time_Start": 62.0, "Time_End": 66.0, "Text": " Incorporated, a Baltimore-based security and software development firm."}, {"Time_Start": 66.0, "Time_End": 68.0, "Text": " Who's from Baltimore?"}, {"Time_Start": 68.0, "Time_End": 70.0, "Text": " Suckers. Yeah, me too."}, {"Time_Start": 70.0, "Time_End": 72.0, "Text": " What's that?"}, {"Time_Start": 72.0, "Time_End": 78.0, "Text": " All right, yeah, we'll get the... When I can hear you, we'll do it again."}, {"Time_Start": 78.0, "Time_End": 82.0, "Text": " All right. If you have questions, any time, raise your hand."}, {"Time_Start": 82.0, "Time_End": 85.0, "Text": " I'll try and get to all the questions as much as I can."}, {"Time_Start": 85.0, "Time_End": 87.0, "Text": " I'll try and go over all the cerebral stuff as quickly as possible."}, {"Time_Start": 87.0, "Time_End": 92.0, "Text": " stuff as quickly as possible and keep you guys entertained to some extent."}, {"Time_Start": 92.0, "Time_End": 93.0, "Text": " All right."}, {"Time_Start": 93.0, "Time_End": 94.0, "Text": " What is steganography?"}, {"Time_Start": 94.0, "Time_End": 99.0, "Text": " You guys should probably already know this, courtesy of a substitution, which was great."}, {"Time_Start": 99.0, "Time_End": 101.0, "Text": " Really stands for covered writing."}, {"Time_Start": 101.0, "Time_End": 102.0, "Text": " It's what it means."}, {"Time_Start": 102.0, "Time_End": 109.0, "Text": " Earliest examples date back to 440 years before Christ or whatever else BC stands for."}, {"Time_Start": 109.0, "Time_End": 113.0, "Text": " It's lately become a hot topic in the information security world in the last five years,"}, {"Time_Start": 113.0, "Time_End": 114.0, "Text": " give or take."}, {"Time_Start": 114.0, "Time_End": 117.0, "Text": " It's one of those things that kind of has to get reinvented,"}, {"Time_Start": 117.0, "Time_End": 123.0, "Text": " continuously. And since 9-11, this has become an enormously popular topic,"}, {"Time_Start": 123.0, "Time_End": 128.0, "Text": " primarily because of the use of private communications and etc., etc."}, {"Time_Start": 128.0, "Time_End": 131.0, "Text": " What is steganography used for, primarily used for secret messages?"}, {"Time_Start": 131.0, "Time_End": 135.0, "Text": " If you want to know more about it, ask your school kids or your neighborhood terrorists"}, {"Time_Start": 135.0, "Time_End": 138.0, "Text": " because they're the ones who are using this shit every day."}, {"Time_Start": 138.0, "Time_End": 140.0, "Text": " It just kind of happens that way, all right?"}, {"Time_Start": 140.0, "Time_End": 142.0, "Text": " How many of your parents?"}, {"Time_Start": 142.0, "Time_End": 145.0, "Text": " Yeah, they're doing it. Yeah, I can tell you right now."}, {"Time_Start": 145.0, "Time_End": 146.0, "Text": " All right."}, {"Time_Start": 146.0, "Time_End": 147.0, "Text": " All right."}, {"Time_Start": 147.0, "Time_End": 149.0, "Text": " The anatomy of the stego process is fairly simple."}, {"Time_Start": 149.0, "Time_End": 150.0, "Text": " A couple of components."}, {"Time_Start": 150.0, "Time_End": 153.0, "Text": " These are the things you've got to have, regardless."}, {"Time_Start": 153.0, "Time_End": 154.0, "Text": " The first thing is a cover document."}, {"Time_Start": 154.0, "Time_End": 157.0, "Text": " That's going to be what you're going to hide your information in."}, {"Time_Start": 157.0, "Time_End": 161.0, "Text": " You're going to have a secret message, whatever it is you want to get to someone else."}, {"Time_Start": 161.0, "Time_End": 163.0, "Text": " And the stego key."}, {"Time_Start": 163.0, "Time_End": 168.0, "Text": " The stego key is the process by which you're going to perform the encoding into the cover document."}, {"Time_Start": 168.0, "Time_End": 172.0, "Text": " And then what you may want to have is a cryptographic key."}, {"Time_Start": 172.0, "Time_End": 176.0, "Text": " Now the idea of steganography in and of itself is not to obfuscate data like cryptographic."}, {"Time_Start": 176.0, "Time_End": 181.5, "Text": " like cryptography does in that if it's recovered, no one really knows what the hell it means."}, {"Time_Start": 181.5, "Time_End": 185.0, "Text": " Instead, the concept is to try and make sure no one really knows it's there."}, {"Time_Start": 185.0, "Time_End": 190.0, "Text": " And so by nature, the material that's placed steganographically into any cover object"}, {"Time_Start": 190.0, "Time_End": 192.0, "Text": " is typically going to be in clear text."}, {"Time_Start": 192.0, "Time_End": 197.0, "Text": " However, because of security issues and because we're now getting better and better at steg analysis,"}, {"Time_Start": 197.0, "Time_End": 203.0, "Text": " more often than not, we're finding people who are beginning to cryptographically change their data."}, {"Time_Start": 203.0, "Time_End": 205.0, "Text": " So that way, even if it is recovered, it's pretty much used."}, {"Time_Start": 205.0, "Time_End": 208.0, "Text": " it's pretty much useless, give or take."}, {"Time_Start": 208.0, "Time_End": 213.0, "Text": " What this will produce or what this will give you is what's referred to commonly as a stego object."}, {"Time_Start": 213.0, "Time_End": 217.0, "Text": " A couple of steganography protocols, there's three primarily."}, {"Time_Start": 217.0, "Time_End": 219.0, "Text": " The first one is called pure steganography."}, {"Time_Start": 219.0, "Time_End": 223.0, "Text": " It's a steganographic system which does not require the exchange"}, {"Time_Start": 223.0, "Time_End": 226.0, "Text": " of a predetermined steganographic key."}, {"Time_Start": 226.0, "Time_End": 230.0, "Text": " That means that I'm going to steganographically encode something and I'm going to send it out"}, {"Time_Start": 230.0, "Time_End": 235.0, "Text": " and whomever my recipient is is going to steganographically decode that,"}, {"Time_Start": 235.0, "Time_End": 240.4, "Text": " without ever having privately communicated with me and tried to understand what my stego key is."}, {"Time_Start": 241.6, "Time_End": 243.4, "Text": " We have secret key steganography."}, {"Time_Start": 243.6, "Time_End": 245.2, "Text": " It's very similar to a symmetric cipher."}, {"Time_Start": 245.36, "Time_End": 250.96, "Text": " It's a one-way cipher in which we stegonographically put the data in in a predetermined cipher method."}, {"Time_Start": 251.34, "Time_End": 254.56, "Text": " And then, of course, the recipient has to be aware of that secret method."}, {"Time_Start": 254.86, "Time_End": 258.72, "Text": " We have to try and get that to them through some kind of privatized channel or secure channel."}, {"Time_Start": 259.68, "Time_End": 264.2, "Text": " And the following, excuse me, the encoding method is the stego key has to be known, as I said,"}, {"Time_Start": 264.2, "Time_End": 265.34, "Text": " both sender and receiver."}, {"Time_Start": 266.3, "Time_End": 268.74, "Text": " The last version is public key steganography."}, {"Time_Start": 268.88, "Time_End": 270.62, "Text": " This is becoming the real big topic here."}, {"Time_Start": 271.82, "Time_End": 272.88, "Text": " It requires two keys."}, {"Time_Start": 273.2, "Time_End": 274.34, "Text": " One public, one private."}, {"Time_Start": 274.44, "Time_End": 275.58, "Text": " It's built just like PKI."}, {"Time_Start": 275.88, "Time_End": 284.91999999999996, "Text": " In fact, a lot of public key steganography is actually structured on or built on the backside of already existing public key infrastructures that are in place."}, {"Time_Start": 284.91999999999996, "Time_End": 289.24, "Text": " And those public key infrastructures actually are facilitating for all the steganographic data."}, {"Time_Start": 292.38, "Time_End": 293.56, "Text": " Stegonographic techniques."}, {"Time_Start": 294.2, "Time_End": 299.0, "Text": " altogether. There will be a quiz later. No, I'm kidding. This presentation,"}, {"Time_Start": 299.0, "Time_End": 302.9, "Text": " incidentally, I apologize, I did not mention it earlier, will be posted on the"}, {"Time_Start": 302.9, "Time_End": 306.5, "Text": " internet. Unfortunately, I didn't get into the conference in time to get it onto the"}, {"Time_Start": 306.5, "Time_End": 311.96, "Text": " CD. I was kind of a latecomer. So it will be available at exceptional software.com"}, {"Time_Start": 311.96, "Time_End": 316.28, "Text": " .com forward slash defcon, but you'll probably need to give me about a week or two once I"}, {"Time_Start": 316.28, "Time_End": 320.41999999999996, "Text": " get back across the country and get it all put together. But then this presentation"}, {"Time_Start": 320.41999999999996, "Time_End": 324.18, "Text": " will be available. Okay. The first of your six techniques."}, {"Time_Start": 324.2, "Time_End": 331.2, "Text": " substitution systems, transform domain techniques, spread spectrum techniques,"}, {"Time_Start": 331.2, "Time_End": 337.09999999999997, "Text": " statistical methods, distortion techniques, and lastly cover generation methodologies."}, {"Time_Start": 337.09999999999997, "Time_End": 341.0, "Text": " So let's get into these in a little bit more detail. The first one, we'll actually, we'll talk"}, {"Time_Start": 341.0, "Time_End": 344.84, "Text": " about tools first. These are almost all substitution tools. The vast majority of what"}, {"Time_Start": 344.84, "Time_End": 348.74, "Text": " you'll find commercially available are going to focus on substitution. It is far and away the"}, {"Time_Start": 348.74, "Time_End": 353.68, "Text": " easiest methodology for doing any type of stagnantographic material, the footprint for any"}, {"Time_Start": 353.68, "Time_End": 357.98, "Text": " application that runs this as fairly small as a general rule because of the principle"}, {"Time_Start": 357.98, "Time_End": 362.6, "Text": " of how the stego works as opposed to getting into some of the other methods which get"}, {"Time_Start": 362.6, "Time_End": 367.5, "Text": " into much more cerebral and much more mathematically structured programs."}, {"Time_Start": 367.5, "Time_End": 373.5, "Text": " So the common tools, a lot of these you probably heard of steggo DOS, S tools is another one."}, {"Time_Start": 373.5, "Time_End": 379.62, "Text": " Mandel steg, easy stego. Anything that says easy, probably stay away from. Anybody here"}, {"Time_Start": 379.62, "Time_End": 383.66, "Text": " write that? Good, okay. White, no, sorry."}, {"Time_Start": 383.68, "Time_End": 388.52, "Text": " noise storm is another one. And stegonose. That's probably the one that I think most"}, {"Time_Start": 388.52, "Time_End": 393.16, "Text": " people seem to be aware of. Stegonos is not free, by the way, but for some reason, lots and"}, {"Time_Start": 393.16, "Time_End": 398.12, "Text": " lots of people have heard of it. All right, let's talk about the first method. Substitution systems"}, {"Time_Start": 398.12, "Time_End": 404.48, "Text": " and bit plane methodologies for dealing with steganography. It deals with the least significant"}, {"Time_Start": 404.48, "Time_End": 409.38, "Text": " bit substitution as one of the methodologies for which we deal with this. When you're doing a least"}, {"Time_Start": 409.38, "Time_End": 413.66, "Text": " significant bit substitution, we take whatever our cover document is going to be, be that J-PAY"}, {"Time_Start": 413.68, "Time_End": 418.86, "Text": " TIF, could be a BMP, it could be an AVI, Wayfile, MP3. You get the picture."}, {"Time_Start": 418.86, "Time_End": 422.86, "Text": " Pretty much anything that's digital data. And we're going to take the least significant bit"}, {"Time_Start": 422.86, "Time_End": 427.2, "Text": " of every single byte that's built into that structure and we're going to change it. We're going"}, {"Time_Start": 427.2, "Time_End": 432.0, "Text": " to modify that bit so that when they're all recompiled, it's going to build together our secret message."}, {"Time_Start": 432.0, "Time_End": 436.02, "Text": " In some situations, we'll actually take two bits. It just depends on the nature of the material"}, {"Time_Start": 436.02, "Time_End": 439.52, "Text": " that we're dealing with, and it depends on the tool that you're using to do this."}, {"Time_Start": 439.52, "Time_End": 443.66, "Text": " We also have image downgrading. Now image downgrading. Now, image downgrading"}, {"Time_Start": 443.68, "Time_End": 448.96, "Text": " is a little bit different than dealing with least significant bit substitution, and that"}, {"Time_Start": 448.96, "Time_End": 454.24, "Text": " we generally just downgrade the entire quality of the image altogether. So we're not going"}, {"Time_Start": 454.24, "Time_End": 459.6, "Text": " to substitute only one bit. We're going to substitute four bits for every bite, and each one"}, {"Time_Start": 459.6, "Time_End": 464.52, "Text": " of those four bits is going to represent the four most significant bits in whatever our secret"}, {"Time_Start": 464.52, "Time_End": 469.96000000000004, "Text": " message is that we're hoping to get across. So what actually happens is we take a standard"}, {"Time_Start": 469.96000000000004, "Time_End": 473.66, "Text": " picture that, let's say, maybe 32 bits, and we're going to move"}, {"Time_Start": 473.68, "Time_End": 479.76, "Text": " that down by four to the, what, two, four to the second, four squared, like 16 bits,"}, {"Time_Start": 479.90000000000003, "Time_End": 481.68, "Text": " as far as the quality is going to come down."}, {"Time_Start": 483.5, "Time_End": 488.04, "Text": " Pseudo-random permutations, that was just a lot of fun to say, which is why I put it on the slide."}, {"Time_Start": 488.68, "Time_End": 493.48, "Text": " The way this works is it doesn't actually use a structure. It's algorithmically generated"}, {"Time_Start": 493.48, "Time_End": 500.36, "Text": " mathematically so that we take random bits and random bytes from all across our document,"}, {"Time_Start": 500.36, "Time_End": 503.66, "Text": " and we're going to replace those with the steganographic material. So there's actually"}, {"Time_Start": 503.68, "Time_End": 509.6, "Text": " no formal structure. Now the benefit to this, and so far as using a substitution methodology"}, {"Time_Start": 509.6, "Time_End": 516.66, "Text": " for stego, is that this provides a less likely to detect statistical analysis. The problem with"}, {"Time_Start": 516.66, "Time_End": 521.1800000000001, "Text": " a lot of steganography, and while we look at an image, it appears to be completely innocuous,"}, {"Time_Start": 521.44, "Time_End": 526.5, "Text": " and we really can't tell, unless we're pretty good at it, that that object has been stagnographically"}, {"Time_Start": 526.5, "Time_End": 531.48, "Text": " embedded with something. But computers are really good at it, and the reason is, because of all these"}, {"Time_Start": 531.48, "Time_End": 536.9, "Text": " substitution methodologies, it's very common to produce a central statistical model that will"}, {"Time_Start": 536.9, "Time_End": 542.5600000000001, "Text": " actually tell you, through a stegan analysis process, where the actual data is. Now, you may not"}, {"Time_Start": 542.5600000000001, "Time_End": 546.96, "Text": " be able to retrieve the data, but you will in fact know it's there. Hence, why now cryptography is"}, {"Time_Start": 546.96, "Time_End": 553.08, "Text": " becoming such a big issue. So pseudo-random permutations randomly places your secret message across the"}, {"Time_Start": 553.08, "Time_End": 558.52, "Text": " document by performing some mathematical computations that allow it to determine an appropriate structure."}, {"Time_Start": 558.52, "Time_End": 563.54, "Text": " Pallet-based images. Again, it's where we take an image."}, {"Time_Start": 563.64, "Time_End": 565.84, "Text": " Only now we're going to focus on a single color."}, {"Time_Start": 566.6, "Time_End": 568.1999999999999, "Text": " We're going to take any one color you want."}, {"Time_Start": 569.0799999999999, "Time_End": 573.9399999999999, "Text": " Gray scale images probably seem to be the best because you've got 256 shades of gray."}, {"Time_Start": 574.38, "Time_End": 580.8, "Text": " And if one of those shades changes across the board, it's almost impossible to detect for all"}, {"Time_Start": 580.8, "Time_End": 582.76, "Text": " intent and purposes, especially through the eye."}, {"Time_Start": 583.0799999999999, "Time_End": 587.0799999999999, "Text": " So that's one of the big benefits to dealing with pallet-based images."}, {"Time_Start": 588.52, "Time_End": 592.0799999999999, "Text": " Binary images would be the last, no, maybe not."}, {"Time_Start": 592.16, "Time_End": 593.3199999999999, "Text": " Binary images is on here."}, {"Time_Start": 594.3199999999999, "Time_End": 597.72, "Text": " Binary images is primarily used when we're dealing with fax data,"}, {"Time_Start": 598.14, "Time_End": 603.6, "Text": " actually for using programs like Winfax and bitmap facts and things that shy in and whatnot."}, {"Time_Start": 604.48, "Time_End": 610.56, "Text": " If you're sending facts, the interesting thing about the way fax data is actually transmitted across the wire"}, {"Time_Start": 610.56, "Time_End": 614.34, "Text": " when it's sent electronic, well, from a computer-based fax station,"}, {"Time_Start": 614.34, "Time_End": 618.5, "Text": " is that as an enormous amount of redundancy actually structured into the fax page."}, {"Time_Start": 618.52, "Time_End": 623.52, "Text": " As a result of that redundancy, we can alternate the black and white pixels that"}, {"Time_Start": 623.52, "Time_End": 627.52, "Text": " are actually structured in for redundancy purposes, and we can encode our message in that"}, {"Time_Start": 627.52, "Time_End": 629.52, "Text": " without ever actually affecting the text whatsoever."}, {"Time_Start": 629.52, "Time_End": 635.52, "Text": " So it produces a fairly difficult way to detect what's going on, but it's limited in its functionality"}, {"Time_Start": 635.52, "Time_End": 638.52, "Text": " to primarily fax communications."}, {"Time_Start": 638.52, "Time_End": 642.52, "Text": " And SlackSpace, everybody's favorite."}, {"Time_Start": 642.52, "Time_End": 647.52, "Text": " If you're not sure what SlackSpace is, if your computer allocates 32K for any individual file,"}, {"Time_Start": 647.52, "Time_End": 652.52, "Text": " file and you create a file that's 2K, you got 30K a wasted space in that memory buffer"}, {"Time_Start": 652.52, "Time_End": 657.52, "Text": " or in that hard drive buffer and that's slack space. We can actually hide data inside of there"}, {"Time_Start": 657.52, "Time_End": 662.52, "Text": " and use it for hiding purposes because it'll never show up in the system."}, {"Time_Start": 662.52, "Time_End": 668.52, "Text": " The bad thing about using Slackspace, stagnographically, is SlackSpace will ultimately"}, {"Time_Start": 668.52, "Time_End": 670.52, "Text": " increase the size of the file if we use it."}, {"Time_Start": 670.52, "Time_End": 676.52, "Text": " We can go up to that 32K without going into another allocation unit, and by doing that we can still hide the"}, {"Time_Start": 676.52, "Time_End": 679.64, "Text": " that we can still hide the existence of our data."}, {"Time_Start": 679.64, "Time_End": 684.76, "Text": " But it's probably the least popular way, and more often than not, if you're using Slack"}, {"Time_Start": 684.76, "Time_End": 688.4, "Text": " Space, typically it's because you're hiding your own stuff, you know, stuff that you don't"}, {"Time_Start": 688.4, "Time_End": 692.52, "Text": " want feds getting a hold of and things of that nature when you're hiding it on your box."}, {"Time_Start": 692.52, "Time_End": 698.8199999999999, "Text": " Transform domain techniques, these get very, very cerebral, so I'll try and keep this"}, {"Time_Start": 698.8199999999999, "Time_End": 703.4399999999999, "Text": " very short and very brief. This is a discrete cosine transformation. Basically, it takes"}, {"Time_Start": 703.4399999999999, "Time_End": 706.5, "Text": " the coefficient of two binary objects, and"}, {"Time_Start": 706.52, "Time_End": 710.12, "Text": " It calculates the cosine and then it adds them together and multiplies them and"}, {"Time_Start": 710.12, "Time_End": 714.1999999999999, "Text": " and subtracts them and divides them and just by any other mathematical computation you can put together."}, {"Time_Start": 714.1999999999999, "Time_End": 719.48, "Text": " And it ultimately creates a calculation and it will actually use any two objects whose"}, {"Time_Start": 719.48, "Time_End": 723.0, "Text": " cosine will produce the same leading coefficient in the answer."}, {"Time_Start": 723.0, "Time_End": 727.4, "Text": " So it deals with a whole mathematical process for how it's going to encode the data."}, {"Time_Start": 727.4, "Time_End": 729.24, "Text": " Very, again, very cerebral."}, {"Time_Start": 729.24, "Time_End": 733.3199999999999, "Text": " It requires an enormous amount of processing and requires an enormous amount of overhead."}, {"Time_Start": 733.3199999999999, "Time_End": 735.4, "Text": " So it's not necessarily very popular."}, {"Time_Start": 735.4, "Time_End": 741.4, "Text": " Phase coding is another, it deals with a similar process where we're actually doing a phase shift on the data."}, {"Time_Start": 741.4, "Time_End": 747.4, "Text": " Phase coding is probably used more often than not when you're dealing with audio objects in some way, shape or form."}, {"Time_Start": 747.4, "Time_End": 756.4, "Text": " We can actually produce a phase shift on all the audio objects that are being sent out, and that phase shift will actually carry our message."}, {"Time_Start": 756.4, "Time_End": 757.4, "Text": " We'll represent our message."}, {"Time_Start": 757.4, "Time_End": 762.4, "Text": " Echo hiding, this also is another audio object."}, {"Time_Start": 762.4, "Time_End": 765.38, "Text": " I want to caution you a little bit about steganagram."}, {"Time_Start": 765.4, "Time_End": 768.4, "Text": " injecting anything into audio, however."}, {"Time_Start": 768.4, "Time_End": 773.4, "Text": " It is said, and I don't know, my hearing sucks, so I'm not really sure on it,"}, {"Time_Start": 773.4, "Time_End": 783.4, "Text": " but it is said that the human ear can detect any kind of distortion in audio at one part per 10 million milliseconds"}, {"Time_Start": 783.4, "Time_End": 787.4, "Text": " or some obnoxiously ridiculous number like that."}, {"Time_Start": 787.4, "Time_End": 792.4, "Text": " And you can actually detect any discrepancies that are going to be in the volume or in the file that's coming back."}, {"Time_Start": 792.4, "Time_End": 794.4, "Text": " So echo hiding and even phase shifting gets very, very, very different."}, {"Time_Start": 794.4, "Time_End": 797.6999999999999, "Text": " shifting gets very tricky trying to actually keep that data secret."}, {"Time_Start": 797.6999999999999, "Time_End": 801.4, "Text": " So I really try and stay as much away from that as you can."}, {"Time_Start": 801.4, "Time_End": 804.4, "Text": " MP3s are kind of changing that because of the compression factor,"}, {"Time_Start": 804.4, "Time_End": 808.4, "Text": " and we're actually working on in developing new ways to hide data that won't affect"}, {"Time_Start": 808.4, "Time_End": 813.4, "Text": " the quality of the image, but we're still in the early phases of that research."}, {"Time_Start": 813.4, "Time_End": 817.4, "Text": " Spread spectrum technologies, if we're doing anything spread spectrum."}, {"Time_Start": 817.4, "Time_End": 820.4, "Text": " We're just going to do a frequency hop, and the frequency hop, actually,"}, {"Time_Start": 820.4, "Time_End": 824.4, "Text": " the change in location through the frequency actually is what represents our data."}, {"Time_Start": 824.4, "Time_End": 828.4, "Text": " and that can be recompiled as a result of tracing the frequency hopping."}, {"Time_Start": 828.4, "Time_End": 834.4, "Text": " A lot of this stuff was used for spies in 1940s in World War I, World War II,"}, {"Time_Start": 834.4, "Time_End": 835.4, "Text": " and stuff like that."}, {"Time_Start": 835.4, "Time_End": 839.4, "Text": " A lot of it doesn't necessarily get used heavily today, but just a quick overview."}, {"Time_Start": 839.4, "Time_End": 845.4, "Text": " Statistical methodologies, this again tries to fight the Steganalysis perspective"}, {"Time_Start": 845.4, "Time_End": 849.4, "Text": " that what you're dealing with is a statistical model for how data is manipulated."}, {"Time_Start": 849.4, "Time_End": 853.4, "Text": " We try and take what's called a one-bit steganographic scheme so that it's not necessarily"}, {"Time_Start": 853.4, "Time_End": 858.1999999999999, "Text": " that it's not necessarily going to be statistically sound."}, {"Time_Start": 858.1999999999999, "Time_End": 864.4, "Text": " We extrapolate that into an 8-bit-by-8-8-block structure, and then those 8-by-8-block structures"}, {"Time_Start": 864.4, "Time_End": 868.4, "Text": " are actually located randomly throughout the data by using a basic RAND function."}, {"Time_Start": 868.4, "Time_End": 873.4, "Text": " Once that's done, almost any statistical analysis on the document itself"}, {"Time_Start": 873.4, "Time_End": 877.4, "Text": " is not going to detect the presence of the steganographic material."}, {"Time_Start": 877.4, "Time_End": 881.4, "Text": " Now, there's a downside to this, and that is that it doesn't necessarily guarantee the quality"}, {"Time_Start": 881.4, "Time_End": 883.68, "Text": " of the object that is the cover file."}, {"Time_Start": 883.98, "Time_End": 886.66, "Text": " So if you're using a JPEG or a TIF or anything like that,"}, {"Time_Start": 887.0799999999999, "Time_End": 890.8199999999999, "Text": " there's a very good chance that if someone were to look at that object,"}, {"Time_Start": 891.02, "Time_End": 893.3, "Text": " it may look a lot like it was done by Picasso."}, {"Time_Start": 894.22, "Time_End": 894.62, "Text": " All right."}, {"Time_Start": 895.56, "Time_End": 898.4, "Text": " So anybody who knows Picasso got that, by the way."}, {"Time_Start": 899.3199999999999, "Time_End": 903.86, "Text": " Distortion techniques, this is how we actually distort data to produce objects."}, {"Time_Start": 904.1999999999999, "Time_End": 909.16, "Text": " Line space encoding, actually varying the space in text files between spaces"}, {"Time_Start": 909.16, "Time_End": 911.38, "Text": " or between lines of object can represent."}, {"Time_Start": 911.4, "Time_End": 916.78, "Text": " the presence of a binary zero or a one, and the message can be recompiled as a result of that as well."}, {"Time_Start": 917.86, "Time_End": 920.66, "Text": " Or we can do distortion of digital images altogether."}, {"Time_Start": 921.02, "Time_End": 923.12, "Text": " Now, this is, it goes back to the Picasso comment."}, {"Time_Start": 923.6999999999999, "Time_End": 930.8, "Text": " In this case, what we're actually going to do is blur entire pixels, entire 32 bits of pixel depth"}, {"Time_Start": 930.8, "Time_End": 936.5, "Text": " in one single object, and we're going to pick one color, and we're going to blur the entire color"}, {"Time_Start": 936.5, "Time_End": 938.0, "Text": " everywhere in the document."}, {"Time_Start": 938.3, "Time_End": 941.38, "Text": " So what actually happens is we distort the image entirely."}, {"Time_Start": 941.4, "Time_End": 945.5799999999999, "Text": " completely and totally, but that distortion actually represents the information."}, {"Time_Start": 946.14, "Time_End": 949.74, "Text": " It's not that the data is hidden in those 32 bits."}, {"Time_Start": 949.86, "Time_End": 952.4599999999999, "Text": " It's that we change it so that we represent distortion."}, {"Time_Start": 952.72, "Time_End": 956.8, "Text": " And then we use an on-off methodology for where there is and where there is not distortion"}, {"Time_Start": 956.8, "Time_End": 958.14, "Text": " when we pixelate it out."}, {"Time_Start": 958.24, "Time_End": 959.92, "Text": " And that rebuilds the binary data."}, {"Time_Start": 961.98, "Time_End": 963.64, "Text": " Cover generation methods."}, {"Time_Start": 964.64, "Time_End": 965.66, "Text": " Mimic functions."}, {"Time_Start": 966.46, "Time_End": 971.24, "Text": " Mimic functions try to represent data that is already known."}, {"Time_Start": 971.4, "Time_End": 979.8, "Text": " With a statistical model, so if it is statistically analyzed, it's almost impossible to differentiate this file from something else."}, {"Time_Start": 980.14, "Time_End": 990.86, "Text": " Again, this is great if we have something that's looking at the file statistically, but if someone is looking at it, this really isn't going to produce much of a result for steganographic functions."}, {"Time_Start": 991.64, "Time_End": 994.4399999999999, "Text": " We can also do automatic generation of English text."}, {"Time_Start": 995.02, "Time_End": 998.64, "Text": " This is to try and compensate for where mimicking goes bad."}, {"Time_Start": 998.78, "Time_End": 1000.98, "Text": " Unfortunately, it's not necessarily successful."}, {"Time_Start": 1001.4, "Time_End": 1008.1999999999999, "Text": " Because it creates random generated text messages, which while they may follow a logical,"}, {"Time_Start": 1008.3199999999999, "Time_End": 1012.0, "Text": " grammatical sentence structure, make absolutely no sense whatsoever."}, {"Time_Start": 1012.3, "Time_End": 1016.06, "Text": " It'll say things like, the blue dog barks at the hollowed moon, and no clue."}, {"Time_Start": 1016.5799999999999, "Time_End": 1018.66, "Text": " So it gets very obscure."}, {"Time_Start": 1020.3, "Time_End": 1022.4399999999999, "Text": " All right, let's talk about the fun stuff."}, {"Time_Start": 1022.62, "Time_End": 1023.52, "Text": " Now that that that's over."}, {"Time_Start": 1023.6999999999999, "Time_End": 1024.58, "Text": " Who, 15 minutes."}, {"Time_Start": 1025.76, "Time_End": 1028.12, "Text": " How can we use steganography maliciously?"}, {"Time_Start": 1028.84, "Time_End": 1031.3799999999999, "Text": " Well, the idea behind steganography in an argument."}, {"Time_Start": 1031.4, "Time_End": 1037.1200000000001, "Text": " itself is steganography is designed to hide data and that's all what's really designed to do."}, {"Time_Start": 1037.3600000000001, "Time_End": 1041.8400000000001, "Text": " It's primarily been used as a methodology for communication and it hasn't been used for the practice"}, {"Time_Start": 1041.8400000000001, "Time_End": 1046.8400000000001, "Text": " of deploying information that is going to be used in any way, shape, or form maliciously."}, {"Time_Start": 1046.92, "Time_End": 1051.4, "Text": " We're trying to just be very secretive about our communications or about what data's already on our box."}, {"Time_Start": 1052.64, "Time_End": 1059.5600000000002, "Text": " So what we proposed about eight weeks ago, I don't know why I looked at my watch, but eight weeks"}, {"Time_Start": 1059.56, "Time_End": 1064.3799999999999, "Text": " ago, give or take, we propose the concept that what if we can take an object,"}, {"Time_Start": 1064.9199999999998, "Time_End": 1069.74, "Text": " any cover object, regardless of what it is, and we can stagnantigraphically embed into that,"}, {"Time_Start": 1069.78, "Time_End": 1072.96, "Text": " not a secret message, but actually functioning code."}, {"Time_Start": 1073.8, "Time_End": 1076.52, "Text": " What if we can embed into that functioning code?"}, {"Time_Start": 1076.6799999999998, "Time_End": 1082.2, "Text": " And can we have that code almost, and it sounds goofy, but what if we can have that code almost"}, {"Time_Start": 1082.2, "Time_End": 1087.58, "Text": " fall out of that object when it gets downloaded to another individual's PC?"}, {"Time_Start": 1087.58, "Time_End": 1092.96, "Text": " If we can do that and we can compile that data and load it into the stack,"}, {"Time_Start": 1093.1599999999999, "Time_End": 1097.3, "Text": " we can actually hack anybody we want, not a targeted attack,"}, {"Time_Start": 1097.46, "Time_End": 1100.72, "Text": " but we can hack almost anybody we want by accident,"}, {"Time_Start": 1101.12, "Time_End": 1104.8999999999999, "Text": " which is a very interesting concept for virus distribution or Trojan distribution."}, {"Time_Start": 1105.56, "Time_End": 1109.3, "Text": " So that's one of the things that we really wanted to address and how we wanted to look at it."}, {"Time_Start": 1109.62, "Time_End": 1113.3799999999999, "Text": " So if we use it as a methodology for hiding the distribution of malicious code,"}, {"Time_Start": 1113.5, "Time_End": 1115.54, "Text": " the opportunities really get pretty vast."}, {"Time_Start": 1115.54, "Time_End": 1117.56, "Text": " The tricky part is trying to figure."}, {"Time_Start": 1117.58, "Time_End": 1122.98, "Text": " out how do you stagnographically extract data from inside of that cover object,"}, {"Time_Start": 1123.4399999999998, "Time_End": 1127.84, "Text": " compile that data, and then launch that data, and cause that data to run."}, {"Time_Start": 1128.6799999999998, "Time_End": 1129.9399999999998, "Text": " So that's where it gets difficult."}, {"Time_Start": 1130.56, "Time_End": 1131.72, "Text": " All right, so let's distribute."}, {"Time_Start": 1131.8799999999999, "Time_End": 1132.6999999999998, "Text": " What do we want to distribute?"}, {"Time_Start": 1133.0, "Time_End": 1137.96, "Text": " As I said, viruses, primary object, and Trojans, that's the thing that we seem to care the most about,"}, {"Time_Start": 1138.24, "Time_End": 1141.24, "Text": " because that's going to give us the advantage of being able to take over a box."}, {"Time_Start": 1142.62, "Time_End": 1145.0, "Text": " So let's, we'll come back to that."}, {"Time_Start": 1146.34, "Time_End": 1147.56, "Text": " Let's imagine a concept."}, {"Time_Start": 1147.58, "Time_End": 1154.08, "Text": " that I take any Trojan. It doesn't matter what it is. You pick the Trojan of choice, all right?"}, {"Time_Start": 1154.08, "Time_End": 1162.08, "Text": " I take a Trojan, I break it down, I strip out as much of the unnecessary crap out of that that I possibly can."}, {"Time_Start": 1162.08, "Time_End": 1171.08, "Text": " I take that code for that Trojan and I stagnographically embed that information into an AVI file or a JPEG or an MP3."}, {"Time_Start": 1171.08, "Time_End": 1177.56, "Text": " And then I distribute that through whatever means you like. I'll give you a scenario a little bit later"}, {"Time_Start": 1177.58, "Time_End": 1181.9199999999998, "Text": " are on here in just a few minutes of how I actually would like to see this kind of work"}, {"Time_Start": 1181.9199999999998, "Time_End": 1183.36, "Text": " and how I'd like to see it come together."}, {"Time_Start": 1184.24, "Time_End": 1186.1599999999999, "Text": " But you distribute that information."}, {"Time_Start": 1186.4199999999998, "Time_End": 1191.76, "Text": " Now, once that information gets distributed out, how can we cause that information to fall out,"}, {"Time_Start": 1191.8799999999999, "Time_End": 1193.5, "Text": " literally fall out of that object?"}, {"Time_Start": 1193.9199999999998, "Time_End": 1195.28, "Text": " So we've looked at a couple of objects."}, {"Time_Start": 1195.3799999999999, "Time_End": 1196.6, "Text": " We've looked at a couple of options."}, {"Time_Start": 1197.04, "Time_End": 1201.1399999999999, "Text": " One of the first things that we've considered is looking at JPEG header files."}, {"Time_Start": 1201.24, "Time_End": 1206.3, "Text": " There's a clear text header portion that gets processed, just like any other portion of a JPEG"}, {"Time_Start": 1206.3, "Time_End": 1206.98, "Text": " gets processed."}, {"Time_Start": 1207.58, "Time_End": 1213.02, "Text": " And what we're trying to figure out now is how to write script steganographic extractors."}, {"Time_Start": 1213.32, "Time_End": 1215.34, "Text": " Now, unfortunately, I don't have code to show you."}, {"Time_Start": 1215.3999999999999, "Time_End": 1217.06, "Text": " We're still in the early developmental stages."}, {"Time_Start": 1217.5, "Time_End": 1221.02, "Text": " But if anybody wants to have suggestions or chit-chat later, come see me."}, {"Time_Start": 1221.9199999999998, "Time_End": 1231.52, "Text": " But what we're looking at is taking a basic script file that's going to pull out data from inside of the actual steganode object."}, {"Time_Start": 1232.06, "Time_End": 1237.56, "Text": " So if that script file is successful in extracting that code information, it then just becomes a problem."}, {"Time_Start": 1237.58, "Time_End": 1241.82, "Text": " of loading it into the cache via a web browser or something along those lines."}, {"Time_Start": 1242.6999999999998, "Time_End": 1248.9199999999998, "Text": " Now, what we have successfully accomplished is we've taken an AVI file, and we have loaded that"}, {"Time_Start": 1248.9199999999998, "Time_End": 1253.82, "Text": " AVI-I file with steganographic material. All right? Now, we haven't gone with source code yet,"}, {"Time_Start": 1254.1999999999998, "Time_End": 1259.46, "Text": " but we've gone with comparable-sized data files, and we've had enormous success with that so far."}, {"Time_Start": 1260.3799999999999, "Time_End": 1265.82, "Text": " Well, with that data, steganographically embedded into the AVI file, that AVI file becomes the carrier,"}, {"Time_Start": 1265.82, "Time_End": 1267.4399999999998, "Text": " and it becomes completely innocuous."}, {"Time_Start": 1267.58, "Time_End": 1271.56, "Text": " or at least it seems, to be completely innocuous in its distribution methodologies."}, {"Time_Start": 1272.6799999999998, "Time_End": 1280.08, "Text": " Now, the idea behind this, or how this really gets to be exciting, is the ABI file has the capacity to launch an event."}, {"Time_Start": 1280.28, "Time_End": 1282.22, "Text": " We have an editor that we use in our office."}, {"Time_Start": 1282.46, "Time_End": 1284.6599999999999, "Text": " I don't know what the name of the editor is off the top of my head."}, {"Time_Start": 1285.08, "Time_End": 1289.4199999999998, "Text": " It allows us to embed an event directly into the AVI file."}, {"Time_Start": 1289.8799999999999, "Time_End": 1293.56, "Text": " And primarily, the events that we choose to embed have been ASP-related."}, {"Time_Start": 1294.1799999999998, "Time_End": 1297.56, "Text": " So we can cause the AVI to actually kick off."}, {"Time_Start": 1297.58, "Time_End": 1303.3999999999999, "Text": " an ASP and we can also force that ASP to run outside of a web browser so it becomes"}, {"Time_Start": 1303.3999999999999, "Time_End": 1309.04, "Text": " completely transparent to the user so by doing this what we're in the process of"}, {"Time_Start": 1309.04, "Time_End": 1312.6399999999999, "Text": " developing now and I think we'll have it fairly soon and we'll try and make that"}, {"Time_Start": 1312.6399999999999, "Time_End": 1317.4399999999998, "Text": " code available as it's necessary is what we're trying to develop is in client"}, {"Time_Start": 1317.4399999999998, "Time_End": 1323.62, "Text": " server ASP based steganographic model so we take the architecture of a basic"}, {"Time_Start": 1323.62, "Time_End": 1327.56, "Text": " steganographic object or a steganographic encoder and decoder we"}, {"Time_Start": 1327.58, "Time_End": 1331.02, "Text": " We figure out how to make it run in a client server environment."}, {"Time_Start": 1331.02, "Time_End": 1337.3, "Text": " You have the client and the ASP that's being hosted is actually the server portion of the component."}, {"Time_Start": 1337.3, "Time_End": 1342.62, "Text": " So when the ASP kicks off, you're going to communicate from your box directly back to the ASP"}, {"Time_Start": 1342.62, "Time_End": 1348.34, "Text": " outside of a web browser, which is going to force some level of code to execute."}, {"Time_Start": 1348.34, "Time_End": 1352.82, "Text": " Again, we haven't worked out all the bugs, so I don't want to tell you exactly how it's going to happen yet."}, {"Time_Start": 1352.82, "Time_End": 1357.56, "Text": " Forces some level of code to execute, and when that level of code executes, it's going to"}, {"Time_Start": 1357.58, "Time_End": 1361.58, "Text": " search your drive for an individual file that's going to be actually"}, {"Time_Start": 1361.58, "Time_End": 1366.58, "Text": " stagnographically embedded in some way, shape, or form. Now the server portion of"}, {"Time_Start": 1366.58, "Time_End": 1372.58, "Text": " this is going to extract the data out of your machine or out of that AVI file or"}, {"Time_Start": 1372.58, "Time_End": 1375.8, "Text": " whatever, hopefully other distribution methods will come very shortly. We'll"}, {"Time_Start": 1375.8, "Time_End": 1381.3999999999999, "Text": " extract that data out of the source file itself and we'll be able to load that data as raw"}, {"Time_Start": 1381.3999999999999, "Time_End": 1385.6399999999999, "Text": " data, sort of like a binary install almost, but we'll be able to load that data into"}, {"Time_Start": 1385.6399999999999, "Time_End": 1387.56, "Text": " the executable stack while it's acting in."}, {"Time_Start": 1387.58, "Time_End": 1390.5, "Text": " as though it's hiding behind the web browser."}, {"Time_Start": 1390.5, "Time_End": 1395.6, "Text": " The nice thing about this is this will all happen just simply because of cached objects."}, {"Time_Start": 1395.6, "Time_End": 1399.1999999999998, "Text": " It doesn't necessarily have to be because you're running the AVI file."}, {"Time_Start": 1399.1999999999998, "Time_End": 1403.98, "Text": " If you browse to a web page where the AVI is being hosted, it'll actually buffer into your"}, {"Time_Start": 1403.98, "Time_End": 1406.48, "Text": " cache and everything should be able to structure right from there."}, {"Time_Start": 1406.48, "Time_End": 1408.6999999999998, "Text": " You don't even actually have to run the object."}, {"Time_Start": 1408.6999999999998, "Time_End": 1414.1, "Text": " And as we extrapolate this into JPEGs, it'll get even more functional in the same format."}, {"Time_Start": 1414.1, "Time_End": 1417.56, "Text": " So as objects become downloaded, we'll kick off background events."}, {"Time_Start": 1417.58, "Time_End": 1421.6599999999999, "Text": " which will extract the data, the malicious source code, directly out of your machine,"}, {"Time_Start": 1422.0, "Time_End": 1425.86, "Text": " or off of the steganographically embedded file, and place it on your hard drive,"}, {"Time_Start": 1426.1999999999998, "Time_End": 1429.78, "Text": " load the object actually, and force it to go into the executable function."}, {"Time_Start": 1430.6999999999998, "Time_End": 1432.98, "Text": " We'll pretty much have owned your computer at this point."}, {"Time_Start": 1434.1599999999999, "Time_End": 1435.32, "Text": " Now, why is this a big deal?"}, {"Time_Start": 1436.1, "Time_End": 1439.6, "Text": " It's not, I'm not the first person to think of this by any stretch of the imagination."}, {"Time_Start": 1439.76, "Time_End": 1443.3, "Text": " We're not the first people to begin doing work on this."}, {"Time_Start": 1443.3, "Time_End": 1445.86, "Text": " The Air Force has done work on this in the past."}, {"Time_Start": 1446.36, "Time_End": 1447.56, "Text": " There are folks in..."}, {"Time_Start": 1447.58, "Time_End": 1452.96, "Text": " in India who have done this as actually a thesis paper for a master's project, and they actually"}, {"Time_Start": 1452.96, "Time_End": 1457.34, "Text": " successfully created it in a keystroke logger and deployed a keystroke logger through"}, {"Time_Start": 1457.34, "Time_End": 1460.98, "Text": " steganographic techniques and were able to retrieve passwords."}, {"Time_Start": 1460.98, "Time_End": 1466.96, "Text": " Where they stopped was the keystroke logger ran local on the machine, and a keystroke logger actually"}, {"Time_Start": 1466.96, "Time_End": 1472.76, "Text": " acquired the information, then a conventional hack method had to be employed to contact that box"}, {"Time_Start": 1472.76, "Time_End": 1477.56, "Text": " and extract that data, those passwords and usernames, directly out of the file."}, {"Time_Start": 1477.58, "Time_End": 1479.04, "Text": " that the keystroke logger had generated."}, {"Time_Start": 1479.54, "Time_End": 1483.06, "Text": " What I propose to do is, I'll paint you a picture."}, {"Time_Start": 1483.6999999999998, "Time_End": 1488.12, "Text": " Imagine there's some web server out there that is fairly vulnerable."}, {"Time_Start": 1488.4199999999998, "Time_End": 1489.4199999999998, "Text": " I know, use your imagination."}, {"Time_Start": 1490.46, "Time_End": 1495.72, "Text": " So, I'm going to go out and I'm going to take an object that's on that web server, any picture,"}, {"Time_Start": 1496.0, "Time_End": 1500.9199999999998, "Text": " JPEG, it doesn't matter what it is, and I'm going to copy it from my web browser and save it to my"}, {"Time_Start": 1500.9199999999998, "Time_End": 1501.58, "Text": " local machine."}, {"Time_Start": 1502.36, "Time_End": 1507.4399999999998, "Text": " And then I'm going to steganographically inject my Trojan source code directly into that"}, {"Time_Start": 1507.44, "Time_End": 1513.3200000000002, "Text": " picture. Now, if I use the right steganographic methods such as substitution method"}, {"Time_Start": 1513.3200000000002, "Time_End": 1519.64, "Text": " or even phase shifting if I have to, depending on what the object is, I'm not going to affect"}, {"Time_Start": 1519.64, "Time_End": 1525.5, "Text": " the size of that object. So once I have a copy of that object that's now been steganographically"}, {"Time_Start": 1525.5, "Time_End": 1530.14, "Text": " injected, I'm going to take that object and I'm going to actually reload it back onto the web"}, {"Time_Start": 1530.14, "Time_End": 1536.5800000000002, "Text": " server. So it does require one hack. Just one. That's the nice part about it. So I load that back onto the"}, {"Time_Start": 1536.58, "Time_End": 1541.28, "Text": " web server that is the target. Now the beauty of this is if the administrator actually is"}, {"Time_Start": 1541.28, "Time_End": 1547.74, "Text": " smart enough to know that they've been hacked, figure the odds, right? If that happens, the odds of"}, {"Time_Start": 1547.74, "Time_End": 1553.8799999999999, "Text": " them knowing what I've done are slim to none. I've not modified or vandalized their site. I have absolutely"}, {"Time_Start": 1553.8799999999999, "Time_End": 1558.86, "Text": " in no way, shape, or form modified active X controls. I've not forced the loading of a cookie. I've not"}, {"Time_Start": 1558.86, "Time_End": 1563.32, "Text": " changed the size of an object, the location of an object or the name of an object. So everything"}, {"Time_Start": 1563.32, "Time_End": 1566.56, "Text": " appears as though I got in just to see if I could get it."}, {"Time_Start": 1566.58, "Time_End": 1570.8999999999999, "Text": " in and they run scared and they don't change anything and life goes on just as normal."}, {"Time_Start": 1571.6, "Time_End": 1578.3999999999999, "Text": " Right? So now once I've placed this information on their web page, any people who view that"}, {"Time_Start": 1578.3999999999999, "Time_End": 1585.3799999999999, "Text": " website will actually, without knowledge, download my Trojan. If they download that and it loads"}, {"Time_Start": 1585.3799999999999, "Time_End": 1589.86, "Text": " into the buffer, we force that object to run. And again, we're working out some of these bugs."}, {"Time_Start": 1590.1599999999999, "Time_End": 1595.5, "Text": " But we force that object to run out of the cache that's going to download automatically. By forcing"}, {"Time_Start": 1595.5, "Time_End": 1599.26, "Text": " that project to run, we primarily load that Trojan onto the client"}, {"Time_Start": 1599.26, "Time_End": 1603.66, "Text": " workstation. Now, one of the other things that's being developed in this process is not"}, {"Time_Start": 1603.66, "Time_End": 1607.46, "Text": " just the technique of how we're going to deploy the Trojan, but actually we're looking"}, {"Time_Start": 1607.46, "Time_End": 1613.12, "Text": " for a phone home kind of Trojan as well, something that can actually use encrypted channels"}, {"Time_Start": 1613.12, "Time_End": 1619.48, "Text": " in the IP or TCP header, either way, and can actually send communications backwards through Port"}, {"Time_Start": 1619.48, "Time_End": 1624.9, "Text": " 80, so it's not blockable on a firewall for all intent and purposes, backwards through Port 80,"}, {"Time_Start": 1624.9, "Time_End": 1630.6000000000001, "Text": " out to me as the master machine or the master computer, which will basically now"}, {"Time_Start": 1630.6000000000001, "Time_End": 1633.76, "Text": " give me full unbridled access to this random target."}, {"Time_Start": 1634.42, "Time_End": 1640.6200000000001, "Text": " The downside to this concept is that I cannot target what I'm going to go after machine-wise."}, {"Time_Start": 1641.0, "Time_End": 1646.46, "Text": " So instead I have to target individual organizations or agencies or business structures."}, {"Time_Start": 1646.8600000000001, "Time_End": 1653.1000000000001, "Text": " For example, let's say in the wake of HIPAA compliance, I decide that I'd really like to get myself"}, {"Time_Start": 1653.1000000000001, "Time_End": 1656.7400000000002, "Text": " into a couple of doctors' offices and kind of snoop around and see what I can find."}, {"Time_Start": 1657.88, "Time_End": 1663.5200000000002, "Text": " Well, I can't specifically find a doctor's office that's going to, you know, go out and download"}, {"Time_Start": 1663.5200000000002, "Time_End": 1669.5000000000002, "Text": " this object, but what I'm most likely able to do is go out and hack some medical technology"}, {"Time_Start": 1669.5000000000002, "Time_End": 1674.3000000000002, "Text": " company's website where doctors' offices go out and regularly download images and objects,"}, {"Time_Start": 1674.7600000000002, "Time_End": 1678.46, "Text": " download information, and now what I've done is I've attacked an entire industry,"}, {"Time_Start": 1678.64, "Time_End": 1681.3600000000001, "Text": " and it causes an innocuous attack for all intent and purposes."}, {"Time_Start": 1682.2600000000002, "Time_End": 1683.0800000000002, "Text": " So that's the basic thing."}, {"Time_Start": 1683.1000000000001, "Time_End": 1685.1000000000001, "Text": " concept and that's what we're looking at."}, {"Time_Start": 1685.1000000000001, "Time_End": 1690.1000000000001, "Text": " We're trying to figure out a very elegant way to try and extract some of that data out."}, {"Time_Start": 1690.1000000000001, "Time_End": 1694.1000000000001, "Text": " Now, as I said, about eight weeks ago, we started on this research, but we got kind of excited about it."}, {"Time_Start": 1694.1000000000001, "Time_End": 1698.1000000000001, "Text": " So that's why we came out here to share it with everybody and make sure that everybody's aware of it."}, {"Time_Start": 1698.1000000000001, "Time_End": 1704.1000000000001, "Text": " They haven't worked out all the bugs, but by next year we'll have it completely functioning and we'll have source code available for everyone."}, {"Time_Start": 1705.1000000000001, "Time_End": 1707.1000000000001, "Text": " So that's kind of what we're looking for."}, {"Time_Start": 1707.1000000000001, "Time_End": 1708.1000000000001, "Text": " That's the idea."}, {"Time_Start": 1708.1000000000001, "Time_End": 1712.1000000000001, "Text": " Why use Stego simply as a hiding technique? Why not use it as a distribution methodology?"}, {"Time_Start": 1712.1000000000001, "Time_End": 1713.1000000000001, "Text": " methodology."}, {"Time_Start": 1713.1000000000001, "Time_End": 1722.1000000000001, "Text": " And with that, I think I've summed it up in 30 minutes as opposed to 40, which I try and spare you guys the heat out here."}, {"Time_Start": 1722.1000000000001, "Time_End": 1730.1000000000001, "Text": " I will just simply show you the cited research just in case anybody cares, and that way nobody sues us."}, {"Time_Start": 1730.1000000000001, "Time_End": 1735.1000000000001, "Text": " Because again, as I said, a lot of these folks have done research on a similar topic and subject."}, {"Time_Start": 1735.1000000000001, "Time_End": 1742.0800000000002, "Text": " Staying a Graphic Computer Warfare by Jordan T. Cochran that provided a great amount of"}, {"Time_Start": 1742.1000000000001, "Time_End": 1746.9, "Text": " of information. He addressed similar concepts. Actually, he addressed the issue of"}, {"Time_Start": 1746.9, "Time_End": 1751.4, "Text": " virus distribution and didn't deal so much with Trojan and didn't quite take it to the extreme"}, {"Time_Start": 1751.4, "Time_End": 1756.5600000000002, "Text": " of taking over and owning computers as a result of it. The possibility of a stegonographic"}, {"Time_Start": 1756.5600000000002, "Time_End": 1763.2, "Text": " Trojan installer, that was the paper that was actually produced that downloaded or created"}, {"Time_Start": 1763.2, "Time_End": 1768.88, "Text": " and steganographically injected keystroke loggers as well. So we do have some structural"}, {"Time_Start": 1768.88, "Time_End": 1772.0800000000002, "Text": " function. We have some ideas of how this can work. We have some basic."}, {"Time_Start": 1772.1000000000001, "Time_End": 1782.1000000000001, "Text": " working models. We're just trying to take it a little bit further. So that's kind of some of the things that we use. We used a lot more resources, but these are the primary functions of the data."}, {"Time_Start": 1782.1000000000001, "Time_End": 1784.1000000000001, "Text": " All right? Questions?"}, {"Time_Start": 1784.1000000000001, "Time_End": 1786.1000000000001, "Text": " Yes."}, {"Time_Start": 1786.1000000000001, "Time_End": 1787.1000000000001, "Text": " Yes."}, {"Time_Start": 1787.1000000000001, "Time_End": 1792.1000000000001, "Text": " Do you see the commercial application in this?"}, {"Time_Start": 1792.1000000000001, "Time_End": 1798.1000000000001, "Text": " Or is, do I see any commercial application in this?"}, {"Time_Start": 1798.1000000000001, "Time_End": 1801.1000000000001, "Text": " And actually, yes."}, {"Time_Start": 1801.1000000000001, "Time_End": 1812.1000000000001, "Text": " Surprisingly, although it was kind of retrofitted into the concept. It wasn't creative for this perspective, but how many of you have made with digital watermarking? Anybody?"}, {"Time_Start": 1812.1000000000001, "Time_End": 1831.0800000000002, "Text": " Bueller? Okay, a couple of people. Digital watermarking, for anybody who is not very aware of what that is and what that concept is, it's a big movement that's actually happening with software manufacturers and Hollywood is big time on this bandwagon. And it allows them to embed basically steganographic data in"}, {"Time_Start": 1831.1000000000001, "Time_End": 1838.1000000000001, "Text": " to original objects and documents, and that steganographic data certifies the authenticity of the object."}, {"Time_Start": 1838.1000000000001, "Time_End": 1846.1000000000001, "Text": " So one of the things that we thought about is it's very possible that we could, and it's touchy because I don't,"}, {"Time_Start": 1846.1000000000001, "Time_End": 1856.1000000000001, "Text": " but if we use this technique to deploy the information and actually allow companies to embed information steganographically through this methodology,"}, {"Time_Start": 1856.1000000000001, "Time_End": 1861.0800000000002, "Text": " we could work out some concepts for how that information could be sent back."}, {"Time_Start": 1861.1000000000001, "Time_End": 1870.1000000000001, "Text": " for registration purposes or how that information could be sent back if, in fact, the information is pirated or used in some way that's in violation of the license."}, {"Time_Start": 1870.1000000000001, "Time_End": 1875.1000000000001, "Text": " It was something that was brought up actually by someone else in the office and we thought, you know, that's interesting."}, {"Time_Start": 1875.1000000000001, "Time_End": 1876.1000000000001, "Text": " It wasn't quite what we had wanted."}, {"Time_Start": 1876.1000000000001, "Time_End": 1881.1000000000001, "Text": " Or the idea, but, hey, if you can make money at it, you know."}, {"Time_Start": 1881.1000000000001, "Time_End": 1883.1000000000001, "Text": " So that's the answer."}, {"Time_Start": 1883.1000000000001, "Time_End": 1884.1000000000001, "Text": " Other questions?"}, {"Time_Start": 1884.1000000000001, "Time_End": 1886.1000000000001, "Text": " Yes."}, {"Time_Start": 1886.1000000000001, "Time_End": 1887.1000000000001, "Text": " Yes."}, {"Time_Start": 1891.1000000000001, "Time_End": 1895.1000000000001, "Text": " Okay, what are the question is, like,"}, {"Time_Start": 1895.1000000000001, "Time_End": 1916.1000000000001, "Text": " Okay, the question is, if we're talking about taking a Trojans and viruses and embedding them"}, {"Time_Start": 1916.1000000000001, "Time_End": 1918.1000000000001, "Text": " into an object into an object, and make sure I get all this right?"}, {"Time_Start": 1918.1000000000001, "Time_End": 1920.1000000000001, "Text": " And make sure I get all this right."}, {"Time_Start": 1920.1000000000001, "Time_End": 1927.1000000000001, "Text": " If he writes an MP3 player, what is it that he's going to put in the MP3 player"}, {"Time_Start": 1927.1000000000001, "Time_End": 1930.1000000000001, "Text": " that's going to cause the stagnantographic data to fall out?"}, {"Time_Start": 1930.1000000000001, "Time_End": 1932.1000000000001, "Text": " Is that correct?"}, {"Time_Start": 1932.1000000000001, "Time_End": 1933.1000000000001, "Text": " That's correct."}, {"Time_Start": 1950.1000000000001, "Time_End": 1959.1000000000001, "Text": " Right, and the statement was, you know, you wouldn't write an MP3 player that takes an instruction code and actually executes it."}, {"Time_Start": 1959.1000000000001, "Time_End": 1964.1000000000001, "Text": " And that's the idea behind this is that it's not supposed to be dependent upon the application."}, {"Time_Start": 1964.1000000000001, "Time_End": 1967.1000000000001, "Text": " It's something that's actually not supposed, it's not detectable."}, {"Time_Start": 1967.1000000000001, "Time_End": 1971.1000000000001, "Text": " And the interesting thing is, like, for the AVI files,"}, {"Time_Start": 1971.1000000000001, "Time_End": 1977.1000000000001, "Text": " every AVI file player that is out there plays a basic structure of any AVI file."}, {"Time_Start": 1977.1000000000001, "Time_End": 1980.1000000000001, "Text": " AVI files are multi-layered and coded, and you can have a visual."}, {"Time_Start": 1980.1000000000001, "Time_End": 1988.1000000000001, "Text": " one channel of data that includes closed captioning information and another channel of data that includes translation of the English text."}, {"Time_Start": 1988.1000000000001, "Time_End": 1992.1000000000001, "Text": " And there's a lot of channels and layers that structure into that."}, {"Time_Start": 1992.1000000000001, "Time_End": 1996.1000000000001, "Text": " And as a result, a lot of those AVI files, because it's a standard type,"}, {"Time_Start": 1996.1000000000001, "Time_End": 2001.1000000000001, "Text": " will automatically force functions to run and it's not specific to the player."}, {"Time_Start": 2001.1000000000001, "Time_End": 2005.1000000000001, "Text": " So the player is not specific in the process."}, {"Time_Start": 2005.1000000000001, "Time_End": 2007.1000000000001, "Text": " It's not a part of the function."}, {"Time_Start": 2007.1000000000001, "Time_End": 2010.0800000000002, "Text": " What's actually a part of the function is how the file"}, {"Time_Start": 2010.1000000000001, "Time_End": 2015.1000000000001, "Text": " is written and the file complies with whatever the standard format is."}, {"Time_Start": 2015.1000000000001, "Time_End": 2019.1000000000001, "Text": " Now, MP3, because you have more variation and it gets to be a little bit more difficult,"}, {"Time_Start": 2019.1000000000001, "Time_End": 2022.1000000000001, "Text": " but when you start dealing with things like JPEGs and whatnot,"}, {"Time_Start": 2022.1000000000001, "Time_End": 2027.1000000000001, "Text": " you have less open source people that are writing things to open JPEGs"}, {"Time_Start": 2027.1000000000001, "Time_End": 2030.1000000000001, "Text": " and in the business community, let me say it that way,"}, {"Time_Start": 2030.1000000000001, "Time_End": 2033.1000000000001, "Text": " because in the real world, we all know better."}, {"Time_Start": 2033.1000000000001, "Time_End": 2036.1000000000001, "Text": " But in the business community, you're getting less open source,"}, {"Time_Start": 2036.1000000000001, "Time_End": 2040.1000000000001, "Text": " you're getting standard objects, you're getting people that are opening JPEGs with, you know,"}, {"Time_Start": 2040.1000000000001, "Time_End": 2044.1000000000001, "Text": " know, PowerPoint or Word for that matter, or they're using Internet Explorer,"}, {"Time_Start": 2044.1000000000001, "Time_End": 2052.1000000000004, "Text": " or they're using Microsoft's photo editor, or they're using Adobe, or something, some variation thereof."}, {"Time_Start": 2052.1000000000004, "Time_End": 2057.1000000000004, "Text": " So they're going to comply to a basic structure of how the JPEG is supposed to execute."}, {"Time_Start": 2057.1000000000004, "Time_End": 2064.1000000000004, "Text": " So the object that opens it actually has no function whatsoever in the execution of the code."}, {"Time_Start": 2064.1000000000004, "Time_End": 2069.1000000000004, "Text": " So it's a little bit of a variation. It's really not dependent upon the execution of the code."}, {"Time_Start": 2069.1, "Time_End": 2076.1, "Text": " dependent upon the execution of or the object which opens the image."}, {"Time_Start": 2099.1, "Time_End": 2108.1, "Text": " I'm going to try and repeat as much of that as possible."}, {"Time_Start": 2108.1, "Time_End": 2116.1, "Text": " If you take an AVI and you layer a divX codec into it, right?"}, {"Time_Start": 2116.1, "Time_End": 2118.1, "Text": " And then you're going to launch it."}, {"Time_Start": 2118.1, "Time_End": 2120.1, "Text": " Now I lost you kind of after that."}, {"Time_Start": 2120.1, "Time_End": 2121.1, "Text": " Okay."}, {"Time_Start": 2121.1, "Time_End": 2128.1, "Text": " Basically, these are some kind of like an AVI, I'm going to layer."}, {"Time_Start": 2128.1, "Time_End": 2129.1, "Text": " Okay."}, {"Time_Start": 2129.1, "Time_End": 2134.1, "Text": " Is one of the layers of the AVI for executable code?"}, {"Time_Start": 2134.1, "Time_End": 2135.1, "Text": " No."}, {"Time_Start": 2135.1, "Time_End": 2136.1, "Text": " No."}, {"Time_Start": 2136.1, "Time_End": 2142.1, "Text": " However, it can force other events to run because the AVI has access to the stack."}, {"Time_Start": 2142.1, "Time_End": 2145.1, "Text": " So the AVI can actually force other objects to kick off."}, {"Time_Start": 2145.1, "Time_End": 2152.1, "Text": " And unfortunately, a lot of spam is distributed that way through AVIs, which kick off websites, which open up spam."}, {"Time_Start": 2152.1, "Time_End": 2158.1, "Text": " So it can kick off any ASP or HTML-based object by default, almost."}, {"Time_Start": 2158.1, "Time_End": 2162.1, "Text": " default. Almost every AVI in structure can do that no matter what."}, {"Time_Start": 2162.1, "Time_End": 2166.1, "Text": " And there's nothing special about the way the AVI is written and or encoded."}, {"Time_Start": 2166.1, "Time_End": 2171.1, "Text": " It's just a function of the layers that are built into the AVI object."}, {"Time_Start": 2171.1, "Time_End": 2177.1, "Text": " So what we propose is make it ASP-based, or at least for the AVI-based,"}, {"Time_Start": 2177.1, "Time_End": 2181.1, "Text": " which you can force to run outside of a browser window."}, {"Time_Start": 2181.1, "Time_End": 2183.1, "Text": " No one really even sees it."}, {"Time_Start": 2183.1, "Time_End": 2188.1, "Text": " Now, if there are nothing else going on, yeah, they may detects,"}, {"Time_Start": 2188.1, "Time_End": 2193.1, "Text": " some activity and if they're a really conscientious user, but like that's really our target,"}, {"Time_Start": 2193.1, "Time_End": 2201.1, "Text": " if they're a really conscientious user, then, you know, they may notice something funny is going on."}, {"Time_Start": 2201.1, "Time_End": 2207.1, "Text": " But by hiding it behind an AVI file, most of your hard disk activity and your processor activity"}, {"Time_Start": 2207.1, "Time_End": 2213.1, "Text": " can easily be explained away for even some fairly savvy users that, oh, that's the video,"}, {"Time_Start": 2213.1, "Time_End": 2216.1, "Text": " and they don't even question what in the hell is going on in the background."}, {"Time_Start": 2216.1, "Time_End": 2218.08, "Text": " So it actually, because it hides,"}, {"Time_Start": 2218.1, "Time_End": 2220.1, "Text": " behind an object makes it a little easier."}, {"Time_Start": 2248.1, "Time_End": 2254.1, "Text": " Once I break it, I'll fix it."}, {"Time_Start": 2254.1, "Time_End": 2260.1, "Text": " I've got to understand a little bit more about breaking it, because as I said, we're still in the early phases of development."}, {"Time_Start": 2260.1, "Time_End": 2265.1, "Text": " I was hoping to come and present an idea and make people aware of possibilities."}, {"Time_Start": 2265.1, "Time_End": 2272.1, "Text": " So until we actually can take conceptualization through fruition and we can build it,"}, {"Time_Start": 2272.1, "Time_End": 2278.08, "Text": " once we build it, we can probably begin to understand how it works, and then we will propose defense method"}, {"Time_Start": 2278.1, "Time_End": 2285.1, "Text": " for it as well and try and look at it objectively so that it doesn't cause some, you know,"}, {"Time_Start": 2285.1, "Time_End": 2288.1, "Text": " major internet outage or something along those lines."}, {"Time_Start": 2288.1, "Time_End": 2289.1, "Text": " Okay."}, {"Time_Start": 2289.1, "Time_End": 2292.1, "Text": " Other questions?"}, {"Time_Start": 2292.1, "Time_End": 2294.1, "Text": " Bueller."}, {"Time_Start": 2294.1, "Time_End": 2295.1, "Text": " Bueller."}, {"Time_Start": 2295.1, "Time_End": 2298.1, "Text": " All righty. You guys have a great day."}]}