{"segments": [{"Time_Start": 0.0, "Time_End": 5.0, "Text": " BSD security fundamentals."}, {"Time_Start": 5.0, "Time_End": 10.0, "Text": " This is just going to like hopefully at the end of this talk, you guys will have a little bit"}, {"Time_Start": 10.0, "Time_End": 15.0, "Text": " better understanding of some of the security mechanisms that are actually built right into BSD"}, {"Time_Start": 15.0, "Time_End": 18.0, "Text": " and a lot of people just don't make use of them and they're actually pretty nifty."}, {"Time_Start": 18.0, "Time_End": 22.0, "Text": " So, yeah, I'm just going to get started."}, {"Time_Start": 22.0, "Time_End": 26.0, "Text": " I'm going to throw this presentation up."}, {"Time_Start": 26.0, "Time_End": 29.0, "Text": " You have to excuse my PowerPoint format."}, {"Time_Start": 29.0, "Time_End": 30.0, "Text": " It's not very polished."}, {"Time_Start": 30.0, "Time_End": 35.0, "Text": " I just throw as much stuff in there so I like remember I don't, you know, so I don't leave anything out when I'm giving the talk."}, {"Time_Start": 35.0, "Time_End": 38.0, "Text": " So this will be up on the, this is a little bit different to the one of your CD."}, {"Time_Start": 38.0, "Time_End": 41.0, "Text": " It's a couple more revisions to it."}, {"Time_Start": 41.0, "Time_End": 45.0, "Text": " So go ahead and the website is going to be subtrained.net slash presentations"}, {"Time_Start": 45.0, "Time_End": 51.0, "Text": " and you can get some of the other talks that the rest of the guys that I work with have done."}, {"Time_Start": 51.0, "Time_End": 55.0, "Text": " Subtrain.net slash presentations."}, {"Time_Start": 55.0, "Time_End": 56.0, "Text": " Okay."}, {"Time_Start": 56.0, "Time_End": 59.0, "Text": " Okay, so for this whole thing,"}, {"Time_Start": 59.0, "Time_End": 63.0, "Text": " So for this whole talk, I'm pretty much going to be focusing on free BSD."}, {"Time_Start": 63.0, "Time_End": 69.0, "Text": " That's like the main operating system that my friends and I work with, and it's really the most mainstream."}, {"Time_Start": 69.0, "Time_End": 77.0, "Text": " And I mean, I'll deviate a little bit and talk about some cool stuff with OpenBSD, but it's mainly going to be free BSD."}, {"Time_Start": 77.0, "Time_End": 79.0, "Text": " It's just going to be a refresher."}, {"Time_Start": 79.0, "Time_End": 85.0, "Text": " I mean, some of you guys may already know a lot of this stuff, but I mean, I'm sure everybody will pick up a couple things that they didn't know."}, {"Time_Start": 85.0, "Time_End": 87.0, "Text": " The thing's pretty cool."}, {"Time_Start": 87.0, "Time_End": 89.0, "Text": " And it's going to be emphasized on."}, {"Time_Start": 89.0, "Time_End": 100.0, "Text": " on host-based security and I'm just going to basically show you, you know, using a defense-in-depth strategy, you're able to secure our BSD server, you know, all the way up to the wire pretty much."}, {"Time_Start": 100.0, "Time_End": 106.0, "Text": " And it's like the models of the security onion, you know what I mean?"}, {"Time_Start": 106.0, "Time_End": 107.0, "Text": " You peel it away."}, {"Time_Start": 107.0, "Time_End": 112.0, "Text": " A lot of people, I mean, it's ridiculous with like the recent Apache chunk encoding stuff."}, {"Time_Start": 112.0, "Time_End": 118.98, "Text": " I mean, I'm sure some of you guys came across this, but a lot of people actually went out of their way to start up Apache running"}, {"Time_Start": 119.0, "Time_End": 124.5, "Text": " is root because, you know, they didn't understand how file permissions work and Sim Links work,"}, {"Time_Start": 124.5, "Time_End": 128.1, "Text": " and they just wanted Apache to have access to their entire directory structure."}, {"Time_Start": 128.1, "Time_End": 131.5, "Text": " So once they got hit by the exploit, they were, you know, they were toast."}, {"Time_Start": 135.5, "Time_End": 143.7, "Text": " Okay, so BSD is actually in use in quite a few different products in today's, like, computer enterprise world,"}, {"Time_Start": 143.7, "Time_End": 145.6, "Text": " and it's kind of behind the scenes a lot of times."}, {"Time_Start": 145.6, "Time_End": 152.79999999999998, "Text": " a lot of companies are kind of turning to open source right now with like the current state of the economy"}, {"Time_Start": 152.79999999999998, "Time_End": 160.35999999999999, "Text": " because they don't want to pay the high support costs for licensing Microsoft software or some other commercial variant."}, {"Time_Start": 160.9, "Time_End": 165.85999999999999, "Text": " And a lot of times the quality of the software is, as you guys know, usually better."}, {"Time_Start": 166.95999999999998, "Time_End": 173.28, "Text": " Nokia firewalls that actually they run checkpoint, they use what's called the IPSO operating system,"}, {"Time_Start": 173.28, "Time_End": 176.28, "Text": " which is like a hardened version of FreeBSD 3.2,"}, {"Time_Start": 176.98, "Time_End": 181.18, "Text": " and they've just went ahead and done some extra, like, file locking and stuff,"}, {"Time_Start": 181.26, "Time_End": 183.5, "Text": " and they've got some proprietary stuff that they've added."}, {"Time_Start": 183.6, "Time_End": 184.08, "Text": " It's pretty cool."}, {"Time_Start": 185.14, "Time_End": 188.94, "Text": " And then all the Juniper, all the backbone routers and stuff,"}, {"Time_Start": 189.02, "Time_End": 194.54, "Text": " they all run free BSD, I think it's called Olive, is the name of the product,"}, {"Time_Start": 194.7, "Time_End": 197.4, "Text": " but it's more or less a BSD machine."}, {"Time_Start": 197.48, "Time_End": 199.28, "Text": " You can do package ad on it and all kinds of stuff."}, {"Time_Start": 199.36, "Time_End": 199.76, "Text": " They're pretty cool."}, {"Time_Start": 200.42000000000002, "Time_End": 203.26, "Text": " And, of course, everybody knows, you know, Yahoo uses free BSD."}, {"Time_Start": 203.28, "Time_End": 206.52, "Text": " cluster machines to power all their web stuff and their mail stuff."}, {"Time_Start": 211.52, "Time_End": 214.4, "Text": " All right, so get started with the basics."}, {"Time_Start": 214.52, "Time_End": 216.8, "Text": " I mean, everybody should know this, but I thought just go over it anyways."}, {"Time_Start": 218.16, "Time_End": 220.82, "Text": " You know, if you're messing with a system that's in a production environment,"}, {"Time_Start": 220.92000000000002, "Time_End": 221.58, "Text": " you'll make backups."}, {"Time_Start": 222.04, "Time_End": 224.68, "Text": " Don't make any new changes you're not comfortable with you."}, {"Time_Start": 224.68, "Time_End": 225.48, "Text": " You don't know what's going to do."}, {"Time_Start": 226.82, "Time_End": 230.78, "Text": " Go through your INID comp file and RC comp file and just turn off what you're not using."}, {"Time_Start": 231.34, "Time_End": 233.26, "Text": " I mean, free BSD is, essentially."}, {"Time_Start": 233.28, "Time_End": 238.72, "Text": " especially has gotten really good lately in the last couple of releases, and I think all the way back to like 4-3."}, {"Time_Start": 239.26, "Time_End": 246.06, "Text": " They've just turned almost everything off by default in INAD, which is like, I mean, they're really like setting the pace for other vendors."}, {"Time_Start": 246.6, "Time_End": 258.18, "Text": " Because I mean, up until just like maybe a year ago, the standard was just, you know, vendors were more concerned about making stuff work out of the box rather than, you know, emphasizing security."}, {"Time_Start": 258.18, "Time_End": 263.26, "Text": " So, I mean, they would just turn everything on by default to make it easier for the customer, which didn't turn out to be very good."}, {"Time_Start": 263.28000000000003, "Time_End": 264.08000000000004, "Text": " security strategy."}, {"Time_Start": 265.92, "Time_End": 272.84000000000003, "Text": " If you're running a machine and all you need to do is send mail locally, you can actually"}, {"Time_Start": 272.84000000000003, "Time_End": 278.94000000000005, "Text": " disable send mail, disable the Damon known as send mail in the RC comp file with some flags,"}, {"Time_Start": 279.48, "Time_End": 281.38000000000005, "Text": " and you can also turn off the submission port."}, {"Time_Start": 282.18, "Time_End": 284.1, "Text": " Sendmail comes default with 3BSD in case."}, {"Time_Start": 284.40000000000003, "Time_End": 285.18, "Text": " Some of you guys didn't know that."}, {"Time_Start": 285.18, "Time_End": 292.98, "Text": " And the submission port is just another, I think it's new to like send mail, like late versions, 8.11 and 8.12."}, {"Time_Start": 293.28000000000003, "Time_End": 299.72, "Text": " and most mail servers don't make use of it so that you can firewalled it off or disable it in the RCConf."}, {"Time_Start": 300.02000000000004, "Time_End": 301.78000000000003, "Text": " I'll get into how to do that specifically in a little bit."}, {"Time_Start": 302.72, "Time_End": 306.86, "Text": " And obviously, I mean, you're going to want to track the most stable version of the operating system."}, {"Time_Start": 308.12, "Time_End": 317.64000000000004, "Text": " If you're working in a production environment, I would say probably rebuild the system and rebuild the kernel like every two months or maybe every month and a half."}, {"Time_Start": 318.32000000000005, "Time_End": 323.26000000000005, "Text": " Obviously make exceptions, and I just recently have had some problems with OpenSSA."}, {"Time_Start": 323.28000000000003, "Time_End": 332.58000000000004, "Text": " and the free BSD team got the 3.4 stuff with the privileged separation put into the stable tree pretty quickly after that,"}, {"Time_Start": 332.62, "Time_End": 340.02000000000004, "Text": " even though stable wasn't actually affected by the recent off by one and some of the other remote open SSH stuff that's been floating around."}, {"Time_Start": 341.28000000000003, "Time_End": 345.34000000000003, "Text": " If you're, I mean, if you're a hobbyist, you know, I'd say go for it as much as possible."}, {"Time_Start": 345.34000000000003, "Time_End": 353.26000000000005, "Text": " I think I could probably count on one hand in the past three or four years at times that I've seen the stable tree really broke into the point where you couldn't"}, {"Time_Start": 353.28000000000003, "Time_End": 358.66, "Text": " you know, kind of figure out what was wrong, or maybe somebody just made a fat fingered something when they did their commit,"}, {"Time_Start": 359.1, "Time_End": 363.14000000000004, "Text": " and, you know, I got taken care of, you know, within 30 minutes or an hour or so."}, {"Time_Start": 363.70000000000005, "Time_End": 365.44000000000005, "Text": " I think, I'm not sure about this."}, {"Time_Start": 365.50000000000006, "Time_End": 370.44000000000005, "Text": " I'm not sure if they've gotten rid of this, but there's another branch called the security branch."}, {"Time_Start": 371.20000000000005, "Time_End": 377.88000000000005, "Text": " And basically, that's like an option for you, if you're running a production system and you don't want to,"}, {"Time_Start": 378.68, "Time_End": 383.1, "Text": " um, you don't think stable is really stable, basically."}, {"Time_Start": 383.28000000000003, "Time_End": 384.6, "Text": " But you want all the security fixes."}, {"Time_Start": 384.6, "Time_End": 388.98, "Text": " And all they do is commit anything like the, uh, the recent like IOSMASH stuff."}, {"Time_Start": 388.98, "Time_End": 393.70000000000005, "Text": " They just commit patches to that and then all you, that's all you get."}, {"Time_Start": 393.70000000000005, "Time_End": 398.14000000000004, "Text": " And a lot of people prefer that if they're looking to run a really stable environment."}, {"Time_Start": 398.14000000000004, "Time_End": 401.96000000000004, "Text": " And there's, there's the recent open SSL stuff that I was checking out before I head out to,"}, {"Time_Start": 401.96000000000004, "Time_End": 406.0, "Text": " headed out the black hat this week, but, uh, it looks like, um, there have been five"}, {"Time_Start": 406.0, "Time_End": 410.40000000000003, "Text": " or six new vulnerabilities found in open SSL, so rebuild your systems when you get home."}, {"Time_Start": 413.28000000000003, "Time_End": 420.34000000000003, "Text": " Okay, encrypted communications, I mean, especially at DefCon, I was really amazed"}, {"Time_Start": 420.34000000000003, "Time_End": 424.32000000000005, "Text": " the amount of people that were still like popping their mail and everything at like DefCon"}, {"Time_Start": 424.32000000000005, "Time_End": 431.40000000000003, "Text": " 10. It's kind of ridiculous, but more or less, I don't think there's, there's an excuse to not"}, {"Time_Start": 431.40000000000003, "Time_End": 438.70000000000005, "Text": " encrypt stuff that you're doing. Between SSH tunnels are using S Tunnel to wrap stuff with SSL."}, {"Time_Start": 439.14000000000004, "Time_End": 443.26000000000005, "Text": " I mean, what's your excuse for not doing that, you know? And OpenSSH has been"}, {"Time_Start": 443.28000000000003, "Time_End": 447.66, "Text": " included in the FreeBSD base sense, I think FreeBSD 4.0."}, {"Time_Start": 448.82000000000005, "Time_End": 454.08000000000004, "Text": " A lot of people have chosen to track the port, though, and use port upgrade to just keep it current."}, {"Time_Start": 455.04, "Time_End": 461.28000000000003, "Text": " And you can actually, there's an RCCOM variable, I think it's SSHD underscore demon, and you can just"}, {"Time_Start": 461.28000000000003, "Time_End": 465.56000000000006, "Text": " specify the path to your SSH daemon, so you can put it wherever you want."}, {"Time_Start": 466.74, "Time_End": 469.82000000000005, "Text": " Personally, I just stick with what's unstable. I never had a problem with it."}, {"Time_Start": 469.82, "Time_End": 478.76, "Text": " Even if with some of the recent open SSH disclosures, people are kind of muddy as to what was"}, {"Time_Start": 478.76, "Time_End": 481.28, "Text": " affected, where, and under what circumstances."}, {"Time_Start": 481.98, "Time_End": 487.82, "Text": " So, I mean, I just recommend going through and upgrading all your systems to 3.4 and"}, {"Time_Start": 487.82, "Time_End": 494.8, "Text": " disabling SSA version 1 where you can on some older systems, especially some legacy stuff."}, {"Time_Start": 495.53999999999996, "Time_End": 499.1, "Text": " Like I know, like Picks Firewalls and stuff, they only listen on."}, {"Time_Start": 499.82, "Time_End": 502.32, "Text": " to SSH version 1 for the protocol."}, {"Time_Start": 503.3, "Time_End": 509.0, "Text": " So, I mean, that might be a problem, but on your BSD systems, you really, you know, have no excuse not to."}, {"Time_Start": 509.09999999999997, "Time_End": 510.58, "Text": " And you can turn on privilege separation."}, {"Time_Start": 510.76, "Time_End": 513.9, "Text": " It's not enabled by default with 3.4."}, {"Time_Start": 514.5, "Time_End": 515.9399999999999, "Text": " You have to go in there and turn it on."}, {"Time_Start": 516.0, "Time_End": 518.24, "Text": " It's an option in the SSHD config file."}, {"Time_Start": 518.76, "Time_End": 521.34, "Text": " And it's just like, I think it's enable or use privilege separation."}, {"Time_Start": 522.26, "Time_End": 527.6, "Text": " And basically, I'll just fork off a process when somebody authenticated to your machine successfully,"}, {"Time_Start": 528.18, "Time_End": 529.34, "Text": " and it will drop some privileges."}, {"Time_Start": 529.82, "Time_End": 532.98, "Text": " I'll get into that a little bit later as to how some of that stuff works."}, {"Time_Start": 534.86, "Time_End": 543.88, "Text": " SFTP, this is kind of recent, I think it's like OpenSH 2.9 brought it in to the tree, like, as a standard thing."}, {"Time_Start": 543.88, "Time_End": 552.1800000000001, "Text": " But it's just basically a way to connect to your system to transfer files over SSH."}, {"Time_Start": 553.5, "Time_End": 556.46, "Text": " And obviously, I mean, the problems with FTP, everybody knows."}, {"Time_Start": 556.82, "Time_End": 559.4200000000001, "Text": " Some of you guys may have caught Jay Beale's talk yesterday."}, {"Time_Start": 559.82, "Time_End": 561.2600000000001, "Text": " about hardening FTP."}, {"Time_Start": 563.1400000000001, "Time_End": 569.82, "Text": " The FTP is 20 years old and, you know, passes stuff in the clear and uses an unauthenticated channel for data and everything."}, {"Time_Start": 570.0600000000001, "Time_End": 572.38, "Text": " It's just, this way it's encrypted."}, {"Time_Start": 572.82, "Time_End": 575.82, "Text": " This has full, like, public key support."}, {"Time_Start": 576.46, "Time_End": 581.1400000000001, "Text": " So, I mean, you know, it's basically just like you're making an administrative connection into the machine."}, {"Time_Start": 581.6800000000001, "Time_End": 588.58, "Text": " And there's some new clients for Windows, like Secure FX, and I'm not sure if Puddy has a file transfer client or not,"}, {"Time_Start": 588.58, "Time_End": 593.2, "Text": " but it's just, it's a lot more secure than using, using regular FTP."}, {"Time_Start": 595.36, "Time_End": 599.12, "Text": " Okay, public key authentication, just talking about this a little bit."}, {"Time_Start": 600.7, "Time_End": 602.12, "Text": " Really, what's going to get you?"}, {"Time_Start": 602.7, "Time_End": 609.46, "Text": " I mean, most people are pretty good, like, keeping their systems patched that are in the security industry,"}, {"Time_Start": 610.12, "Time_End": 613.4200000000001, "Text": " and, you know, are there a security engineer at their company or what have you?"}, {"Time_Start": 613.4200000000001, "Time_End": 617.12, "Text": " I mean, they understand the importance of rolling patches out in a timely manner,"}, {"Time_Start": 617.12, "Time_End": 621.94, "Text": " but what's going to get you are your users, usually with weak passwords."}, {"Time_Start": 622.7, "Time_End": 626.0600000000001, "Text": " And so I'm going to talk quite a bit about how to secure your user accounts."}, {"Time_Start": 627.26, "Time_End": 632.22, "Text": " And what it comes down to is, you know, users don't really give a crap about security."}, {"Time_Start": 632.96, "Time_End": 634.4, "Text": " And that's just the way it is."}, {"Time_Start": 634.46, "Time_End": 640.14, "Text": " I don't know if that'll ever change because, I mean, people want convenience and they want to be able to use their system and security."}, {"Time_Start": 640.14, "Time_End": 644.12, "Text": " And security and convenience are just kind of like opposite."}, {"Time_Start": 644.34, "Time_End": 647.1, "Text": " So I'm going to talk about."}, {"Time_Start": 647.12, "Time_End": 653.88, "Text": " about public key authentication, and I'm going to heavily recommend switching all users"}, {"Time_Start": 653.88, "Time_End": 658.58, "Text": " to public key authentication. If your users are savvy enough to handle it, you know, you may have"}, {"Time_Start": 658.58, "Time_End": 662.48, "Text": " to have them set up, help them set up the public, private key pair and everything. But once you"}, {"Time_Start": 662.48, "Time_End": 668.18, "Text": " do it, you can actually start out their password fields in the password database and, you know,"}, {"Time_Start": 668.18, "Time_End": 673.66, "Text": " they won't be able to log in with a Unix password scheme anymore. If you can't do that,"}, {"Time_Start": 673.72, "Time_End": 676.4, "Text": " I've got some alternatives later in the talk that I'll get into."}, {"Time_Start": 677.12, "Time_End": 685.76, "Text": " Okay. So I'm just going to get started, like, as you're installing, like, you know, you're"}, {"Time_Start": 685.76, "Time_End": 690.78, "Text": " setting up a new machine or whatever. It's always good to consider security right as you're building the"}, {"Time_Start": 690.78, "Time_End": 698.54, "Text": " system and how your partition scheme looks is really important to that. As much as you can"}, {"Time_Start": 698.54, "Time_End": 703.22, "Text": " break it up into different partitions. So at the minimum here, I've got like a root partition,"}, {"Time_Start": 703.22, "Time_End": 706.24, "Text": " user var temp, as a minimum."}, {"Time_Start": 707.12, "Time_End": 711.92, "Text": " Flash home should definitely be considered as a separate partition, just because, I mean,"}, {"Time_Start": 711.96, "Time_End": 717.8, "Text": " depending on the level of security you're looking for on your BSD machine, with some of the"}, {"Time_Start": 717.8, "Time_End": 724.38, "Text": " mount options and some of the other stuff you can do, you can really restrict what users can"}, {"Time_Start": 724.38, "Time_End": 732.0, "Text": " can and can't do on the file system. So, like, anything except user or slash because of S-bin,"}, {"Time_Start": 732.46, "Time_End": 737.1, "Text": " you can mount those with a no-suid argument, and basically that's just going to, if"}, {"Time_Start": 737.12, "Time_End": 742.98, "Text": " there's a file with a sewed bit set on it, it won't execute with that flag pass through"}, {"Time_Start": 742.98, "Time_End": 748.26, "Text": " mount. And I would also recommend setting that on your home partition too, just because, you know,"}, {"Time_Start": 748.3, "Time_End": 752.36, "Text": " users, if they're messing around with something and it's suid, especially if it's sued, you know,"}, {"Time_Start": 752.36, "Time_End": 758.92, "Text": " you don't really know what they're doing. Go through your file system and remove suid bits."}, {"Time_Start": 759.02, "Time_End": 766.86, "Text": " I was looking through the FreeBSD handbook just to see what the projects, uh, the projects, uh,"}, {"Time_Start": 767.12, "Time_End": 772.62, "Text": " was on this and they say, you know, anything that's set, uh, suid in the, in the default installation"}, {"Time_Start": 772.62, "Time_End": 779.92, "Text": " is probably pretty safe. But if you're not using stuff, um, for example, if, uh, any of the"}, {"Time_Start": 779.92, "Time_End": 785.0600000000001, "Text": " UUCP stuff, I mean, you can actually strip that right out in your make.com file. You can just say"}, {"Time_Start": 785.0600000000001, "Time_End": 789.54, "Text": " don't build UUCP because, you know, who uses that anymore. Um, but just go through your file"}, {"Time_Start": 789.54, "Time_End": 796.32, "Text": " system, uh, and, and look for, uh, suid and SJid files and just get rid of those, uh, anything you"}, {"Time_Start": 796.32, "Time_End": 796.8, "Text": " don't use."}, {"Time_Start": 797.12, "Time_End": 803.62, "Text": " either just remove the bit or, uh, just set the file zero, zero, zero, so no, if nobody's using it."}, {"Time_Start": 803.62, "Time_End": 810.62, "Text": " Um, the CH flag stuff, I'm going to get into that, uh, right now and in the next couple slides."}, {"Time_Start": 810.62, "Time_End": 814.12, "Text": " Uh, like extended, most people actually don't really know about this."}, {"Time_Start": 814.12, "Time_End": 818.12, "Text": " It was kind of interesting to me that, that most people didn't find out about this, but, um,"}, {"Time_Start": 818.12, "Time_End": 825.12, "Text": " this is like other variables you can set on a file that, uh, when you're using kernel secure levels,"}, {"Time_Start": 825.12, "Time_End": 827.8, "Text": " you can, like, restrict access to the file."}, {"Time_Start": 828.3, "Time_End": 832.46, "Text": " A couple of the ones I've got here are, like, um, the S-append, like a log file,"}, {"Time_Start": 832.96, "Time_End": 836.58, "Text": " that would be like a log file or text file type of a thing where you've got data incrementing to the,"}, {"Time_Start": 836.58, "Time_End": 841.66, "Text": " to the file, but you don't want anything else, you know, anything else, you don't want someone"}, {"Time_Start": 841.66, "Time_End": 843.72, "Text": " going in there and erasing their tracks or something."}, {"Time_Start": 843.98, "Time_End": 845.48, "Text": " So all they can do is append data."}, {"Time_Start": 846.2, "Time_End": 848.04, "Text": " All the file system will let them do is append data."}, {"Time_Start": 848.12, "Time_End": 848.82, "Text": " You can't do anything else."}, {"Time_Start": 849.3, "Time_End": 853.42, "Text": " And the SCHG bit, uh, you can set on binaries, system binaries."}, {"Time_Start": 853.42, "Time_End": 855.1, "Text": " Um, and, um, and the SCHG bit, uh, you can set on binaries, um, and,"}, {"Time_Start": 855.12, "Time_End": 861.3, "Text": " that'll basically, that'll just prevent modification, overwriting, deleting, and, uh, as long"}, {"Time_Start": 861.3, "Time_End": 865.94, "Text": " as you're running in a secure level of one or higher, uh, not even root can modify that."}, {"Time_Start": 866.0600000000001, "Time_End": 870.96, "Text": " So it kind of makes it a pain if you're rebuilding your system because you have to reboot into"}, {"Time_Start": 870.96, "Time_End": 875.84, "Text": " a non-secure mode and then clear all those, you know, rebuild your system or whatever, overwrite the"}, {"Time_Start": 875.84, "Time_End": 880.02, "Text": " binaries and then reset all the very, uh, the flags to whatever you had before."}, {"Time_Start": 880.62, "Time_End": 884.36, "Text": " So, I mean, it depends on the amount of, it depends on the amount of time that you want to spend,"}, {"Time_Start": 885.12, "Time_End": 891.62, "Text": " configuring this stuff. If you get really granular, the only, actually the interesting thing I ran into was"}, {"Time_Start": 891.62, "Time_End": 897.38, "Text": " people were complaining that, you know, if you set your whole, like, S-BIN and bin directories with the S-C-H-E"}, {"Time_Start": 897.38, "Time_End": 901.42, "Text": " flag, you couldn't tell if somebody had broken into your system because they weren't able to modify data."}, {"Time_Start": 901.74, "Time_End": 905.78, "Text": " People were getting pissed off because they weren't getting any tripwire reports because nobody could modify the files."}, {"Time_Start": 908.38, "Time_End": 909.92, "Text": " Yo, shut my shit down."}, {"Time_Start": 911.98, "Time_End": 912.38, "Text": " Thanks."}, {"Time_Start": 914.58, "Time_End": 914.98, "Text": " Okay."}, {"Time_Start": 915.12, "Time_End": 919.44, "Text": " So kernel secure levels, basically you can change these."}, {"Time_Start": 919.46, "Time_End": 920.08, "Text": " These are variables."}, {"Time_Start": 920.2, "Time_End": 921.2, "Text": " You can change on the fly."}, {"Time_Start": 921.74, "Time_End": 926.42, "Text": " You can't, you can't lower them, though, once the system is in multi-user mode."}, {"Time_Start": 927.26, "Time_End": 935.66, "Text": " The only real fault with kernel secure levels is that it doesn't, the secure level doesn't get set until very late in the boot process."}, {"Time_Start": 936.36, "Time_End": 942.1800000000001, "Text": " So if you're kind of paranoid about that and you think maybe one of your startup scripts has been modified"}, {"Time_Start": 942.1800000000001, "Time_End": 946.0600000000001, "Text": " and somebody is doing something nasty before your secure level gets raised."}, {"Time_Start": 946.5400000000001, "Time_End": 954.4000000000001, "Text": " It's always best to, like, set that S-CHG bit on your R-C files or some of your other startup files to prevent modification of those."}, {"Time_Start": 955.2, "Time_End": 957.34, "Text": " So the levels go from negative 1 to 3."}, {"Time_Start": 957.96, "Time_End": 959.6400000000001, "Text": " A negative 1 and 0 are kind of the same thing."}, {"Time_Start": 959.72, "Time_End": 960.6800000000001, "Text": " They're just in secure mode."}, {"Time_Start": 963.1400000000001, "Time_End": 971.7800000000001, "Text": " And secure level 1 is, you know, you can set, like, the append and the S-CHG flags, and you can't disable them."}, {"Time_Start": 972.1800000000001, "Time_End": 976.46, "Text": " Once they're set, and you can't load any LKMs, load, kernel modules."}, {"Time_Start": 976.86, "Time_End": 979.5400000000001, "Text": " You can't load or unload those in Secure Level 1."}, {"Time_Start": 980.4200000000001, "Time_End": 986.4000000000001, "Text": " Secure Level 2 is the same thing, but you can't write to disks in a raw fashion except for a mount."}, {"Time_Start": 987.1600000000001, "Time_End": 994.58, "Text": " And also, time changes, any changes to the system clock are clamped to plus or minus one second change."}, {"Time_Start": 995.0000000000001, "Time_End": 1002.1600000000001, "Text": " So if you're running like a PC or something with a, it doesn't keep time very well, you know, when you reboot your system to drop it in,"}, {"Time_Start": 1002.1800000000001, "Time_End": 1006.46, "Text": " to secure level zero to rebuild your system, you're going to want to go ahead and set your"}, {"Time_Start": 1006.46, "Time_End": 1011.8000000000001, "Text": " clock then, because if you don't, you'll just get errors in your log files about the time"}, {"Time_Start": 1011.8000000000001, "Time_End": 1012.96, "Text": " changes clamped to one second."}, {"Time_Start": 1015.7, "Time_End": 1022.82, "Text": " Okay, so, yeah, we just talked about that, setting the ASCHG flag on some of the, uh, your system"}, {"Time_Start": 1022.82, "Time_End": 1023.6200000000001, "Text": " binary directories."}, {"Time_Start": 1023.9200000000001, "Time_End": 1028.76, "Text": " Okay, this is a lot of data, I know, and, uh, if you can't read it, that's cool, uh, just grab the,"}, {"Time_Start": 1028.76, "Time_End": 1031.78, "Text": " this is all in the, on the CD, and this is going to be up on the website, too."}, {"Time_Start": 1032.18, "Time_End": 1037.18, "Text": " Basically, there's SISCTL variables."}, {"Time_Start": 1037.18, "Time_End": 1042.48, "Text": " That's also, the secure level configurations for FreeBSDA is a SISCTL variable,"}, {"Time_Start": 1043.0800000000002, "Time_End": 1046.0800000000002, "Text": " and it's just a numerical value, negative 1 to 3."}, {"Time_Start": 1046.18, "Time_End": 1050.6000000000001, "Text": " But these are some other settings that a lot of people don't really know about,"}, {"Time_Start": 1051.2, "Time_End": 1055.8200000000002, "Text": " that can actually kind of help you strengthen your network stack a little bit"}, {"Time_Start": 1055.8200000000002, "Time_End": 1058.78, "Text": " and kind of keep people guessing as to what you're running,"}, {"Time_Start": 1059.3600000000001, "Time_End": 1061.76, "Text": " and it kind of pisses people off there trying to port scan you."}, {"Time_Start": 1062.18, "Time_End": 1067.8200000000002, "Text": " The TCP black hole variable is the first one I'll talk about, and you can set that to 0, 1, or 2."}, {"Time_Start": 1069.54, "Time_End": 1076.74, "Text": " Basically, I'm just going to recommend 2, in almost any case, which is a totally silent mode where"}, {"Time_Start": 1076.74, "Time_End": 1081.22, "Text": " it's just not going to generate reset packets back to the source on any connection attempts"}, {"Time_Start": 1081.22, "Time_End": 1084.74, "Text": " to a port that has no socket open, nothing listening."}, {"Time_Start": 1085.44, "Time_End": 1090.78, "Text": " So if somebody throws a port scan at you that opens up ports 0 through 10,000, you've got like"}, {"Time_Start": 1090.78, "Time_End": 1095.6, "Text": " three things running on those 10,000 ports, they're just going to get, you're just going to sit there"}, {"Time_Start": 1095.6, "Time_End": 1098.8799999999999, "Text": " and they're in time out, they're just going to be waiting for a reset packet back to see if"}, {"Time_Start": 1098.8799999999999, "Time_End": 1108.22, "Text": " your port is closed or not. And there's the same setting for UDP, and basically that's the same"}, {"Time_Start": 1108.22, "Time_End": 1115.58, "Text": " procedure, same idea, except that it won't generate an ICMP port unreachable message on a port"}, {"Time_Start": 1115.58, "Time_End": 1120.76, "Text": " with no socket listening. So same thing. That will break trace route to your system. So"}, {"Time_Start": 1120.78, "Time_End": 1125.94, "Text": " if you care about people being able to trace route to you, you may want to drop that to zero or disable it."}, {"Time_Start": 1127.8999999999999, "Time_End": 1130.58, "Text": " So here's some other RC comp settings that you can do."}, {"Time_Start": 1130.8799999999999, "Time_End": 1136.04, "Text": " This is how you turn on secure levels in the main RC comp file."}, {"Time_Start": 1136.48, "Time_End": 1140.1399999999999, "Text": " You have to enable it, specify enable it, and then set the number that you want."}, {"Time_Start": 1142.1399999999999, "Time_End": 1148.08, "Text": " Secure Level 3 is the same thing as Secure Level 2, except you can't modify IPFW rules,"}, {"Time_Start": 1148.08, "Time_End": 1150.72, "Text": " which can kind of be a pain if you're initially building."}, {"Time_Start": 1150.78, "Time_End": 1154.62, "Text": " your system or something or you're adding services because you have to bounce the machine if you"}, {"Time_Start": 1154.62, "Time_End": 1158.8799999999999, "Text": " want to make any changes to your firewall rule base. So that's just maybe something you want to keep in"}, {"Time_Start": 1158.8799999999999, "Time_End": 1168.54, "Text": " mind as you're setting that up. ICMP drop redirect. This is going to drop any redirect packets"}, {"Time_Start": 1168.54, "Time_End": 1172.84, "Text": " from, supposedly, they're supposed to come from a router, but it's just going to drop them from anywhere,"}, {"Time_Start": 1172.84, "Time_End": 1178.78, "Text": " and it's just going to prevent people from modifying the path that your traffic is taking."}, {"Time_Start": 1180.78, "Time_End": 1188.5, "Text": " And then there's the TCP drop sin fin, and that's just going to drop any packets with the sin and the fin bid sets."}, {"Time_Start": 1188.8999999999999, "Time_End": 1191.02, "Text": " And it does break in RFC technically."}, {"Time_Start": 1191.58, "Time_End": 1198.32, "Text": " It's not RFC compliant, but, you know, there's no legitimate use for traffic with both of those bits set at the same time."}, {"Time_Start": 1198.68, "Time_End": 1201.46, "Text": " So, you know, I would recommend enabling it anyways."}, {"Time_Start": 1202.18, "Time_End": 1203.5, "Text": " Clear temp enable is kind of cool."}, {"Time_Start": 1204.24, "Time_End": 1207.54, "Text": " It'll just go through and wipe stuff in your temp directory on reboot."}, {"Time_Start": 1207.8999999999999, "Time_End": 1210.6399999999999, "Text": " And one other one, I don't know if I put it in here later or not, is,"}, {"Time_Start": 1210.78, "Time_End": 1215.22, "Text": " FSC underscore Y underscore enable equals yes."}, {"Time_Start": 1215.62, "Time_End": 1220.58, "Text": " It's a really handy setting if your machine is co-located or something and you don't have physical access to it."}, {"Time_Start": 1221.06, "Time_End": 1229.42, "Text": " If your machine gets balanced or if it crashes or something and it comes back up and starts up FSC to check out your file systems,"}, {"Time_Start": 1229.72, "Time_End": 1234.98, "Text": " this will just automatically, you know, accept any changes that FSC is going to make."}, {"Time_Start": 1234.98, "Time_End": 1238.98, "Text": " So you won't have to call somebody up and go, hey, go over to the console and press Y, Y, Y, Y a few times."}, {"Time_Start": 1239.6399999999999, "Time_End": 1239.92, "Text": " Go ahead."}, {"Time_Start": 1240.78, "Time_End": 1249.3799999999999, "Text": " Yeah, yeah, it's FSCK underscore Y underscore enable equals yes."}, {"Time_Start": 1250.6, "Time_End": 1255.18, "Text": " Go ahead."}, {"Time_Start": 1260.3799999999999, "Time_End": 1270.76, "Text": " I've heard of people compiling like the RISD stuff under BSD, but that's all like, I've heard of people compiling, like, the Rizer FS stuff under BSD, but that's all, like, I've got a friend of mine in the UK that works on the current stuff a lot, and he's really into, like, like, the cutting edge."}, {"Time_Start": 1270.78, "Time_End": 1279.5, "Text": " stuff. I've heard that they're thinking of integrating journaling stuff into UFS for FIO, but I haven't confirmed that yet, so."}, {"Time_Start": 1282.0, "Time_End": 1284.3999999999999, "Text": " Not by default, I don't think. Go ahead."}, {"Time_Start": 1284.78, "Time_End": 1289.0, "Text": " Soft updates, there's just, you read paper and something like that?"}, {"Time_Start": 1289.34, "Time_End": 1296.16, "Text": " Well, yeah, it's kind of a, it's a philosophical, this guy pointed out, soft updates is an option that you can set on your file systems."}, {"Time_Start": 1296.62, "Time_End": 1300.6, "Text": " Soft updates is kind of interesting in the way that it writes to the disk sometimes."}, {"Time_Start": 1300.78, "Time_End": 1303.44, "Text": " It won't actually write changes to the disk for up to a minute."}, {"Time_Start": 1304.3999999999999, "Time_End": 1308.16, "Text": " And so it's kind of a trade-off if you want to enable that or not."}, {"Time_Start": 1308.24, "Time_End": 1310.74, "Text": " If you're doing a lot, like, heavy discontensive stuff,"}, {"Time_Start": 1311.2, "Time_End": 1313.3999999999999, "Text": " FreeBSD recommends you turn on soft updates,"}, {"Time_Start": 1313.6, "Time_End": 1316.74, "Text": " and I think it actually turns it on by default when you set up a partition."}, {"Time_Start": 1321.08, "Time_End": 1321.84, "Text": " Where does it store that?"}, {"Time_Start": 1321.84, "Time_End": 1322.0, "Text": " Where does it store what?"}, {"Time_Start": 1322.56, "Time_End": 1324.24, "Text": " Those updates in the media."}, {"Time_Start": 1325.84, "Time_End": 1329.58, "Text": " He says, where the updates stored, they're in memory."}, {"Time_Start": 1329.58, "Time_End": 1329.6, "Text": " They're in memory."}, {"Time_Start": 1330.78, "Time_End": 1331.78, "Text": " to be written to the disc."}, {"Time_Start": 1331.78, "Time_End": 1337.78, "Text": " So if your machine crashes, your SOL for whatever data was written up to a minute,"}, {"Time_Start": 1337.78, "Time_End": 1339.78, "Text": " or prior to a minute."}, {"Time_Start": 1339.78, "Time_End": 1343.78, "Text": " Okay."}, {"Time_Start": 1343.78, "Time_End": 1353.78, "Text": " I mean, the two kind of like, duh, parts of this talk are encrypting your traffic and starting services"}, {"Time_Start": 1353.78, "Time_End": 1355.78, "Text": " in a jail environment."}, {"Time_Start": 1355.78, "Time_End": 1360.76, "Text": " I mean, so many services that you're going to see run nowadays have either native support for a"}, {"Time_Start": 1360.78, "Time_End": 1366.78, "Text": " like Bind or Apache, or you can actually, you can use this jail functionality built"}, {"Time_Start": 1366.78, "Time_End": 1372.78, "Text": " into FreeBSD, you can build a separate jail for any service that you're running pretty much."}, {"Time_Start": 1372.78, "Time_End": 1377.78, "Text": " And I mean, you can lock that down to a specific part of the file system and restrict people."}, {"Time_Start": 1377.78, "Time_End": 1383.78, "Text": " And I mean, by default, I mean, and SSH is kind of the newest one to do this with the privilege separation"}, {"Time_Start": 1383.78, "Time_End": 1387.78, "Text": " and fork off a separate process for each user."}, {"Time_Start": 1387.78, "Time_End": 1390.76, "Text": " But by default, I think that probably services like that,"}, {"Time_Start": 1390.78, "Time_End": 1396.1399999999999, "Text": " like bind, and Apache's already done this where when you do a free BSD install, you're"}, {"Time_Start": 1396.1399999999999, "Time_End": 1402.98, "Text": " going to get the the WWW user, and I think the Apache ports tree is updated now where the default"}, {"Time_Start": 1402.98, "Time_End": 1406.78, "Text": " username and group name that Apache runs under is WWW."}, {"Time_Start": 1406.78, "Time_End": 1411.8999999999999, "Text": " So, I mean, people have been using nobody for a while, but people didn't really understand that"}, {"Time_Start": 1411.8999999999999, "Time_End": 1417.3999999999999, "Text": " if you use nobody and you run four or five different services as nobody, it's not an unprivileged"}, {"Time_Start": 1417.3999999999999, "Time_End": 1418.04, "Text": " user anymore."}, {"Time_Start": 1419.04, "Time_End": 1420.76, "Text": " So, I mean, you don't know."}, {"Time_Start": 1420.78, "Time_End": 1422.78, "Text": " definitely need to break it out into separate users."}, {"Time_Start": 1422.78, "Time_End": 1432.78, "Text": " And with SSH, they've added an SSH user and the jail for that is slash bar slash empty."}, {"Time_Start": 1432.78, "Time_End": 1445.78, "Text": " Okay, for log in vain, this is kind of like this will pop up in your D message and you can configure this to drop into your messages file through syslog."}, {"Time_Start": 1445.78, "Time_End": 1449.78, "Text": " This is just going to show any connections to your machine on ports that aren't listening."}, {"Time_Start": 1449.78, "Time_End": 1454.46, "Text": " listening. So obviously this is going to sort of conflict with some of the black hole"}, {"Time_Start": 1454.46, "Time_End": 1459.3999999999999, "Text": " stuff that I was talking about a few slides back. But if you set this, you know, you're quickly going"}, {"Time_Start": 1459.3999999999999, "Time_End": 1461.98, "Text": " to tell if somebody's port scanning you or something, you're going to see a bunch of connections"}, {"Time_Start": 1461.98, "Time_End": 1467.3799999999999, "Text": " on ports that you aren't even listening on. So this is, and it's definitely, a lot of people"}, {"Time_Start": 1467.3799999999999, "Time_End": 1475.68, "Text": " kind of mistake this, this RCCOM variable for, some kind of packet filter and stuff."}, {"Time_Start": 1475.68, "Time_End": 1478.34, "Text": " It's not that all it does is report people connecting on, on, on, um, you know, it's not that all it does is report people connecting"}, {"Time_Start": 1478.34, "Time_End": 1484.1, "Text": " on ports that you're not using. So, you know, use it in conjunction with a nice IPF"}, {"Time_Start": 1484.1, "Time_End": 1493.1799999999998, "Text": " or IPFW rule set. Okay, so the next, the next thing is using IPF on almost any system."}, {"Time_Start": 1493.1799999999998, "Time_End": 1499.1999999999998, "Text": " And a lot of people take the mindset that, you know, they're behind their fire, their corporate"}, {"Time_Start": 1499.1999999999998, "Time_End": 1504.76, "Text": " firewall, you know, they're inside their, their office network, you know, nobody really malicious"}, {"Time_Start": 1504.76, "Time_End": 1508.32, "Text": " is doing anything. But even if it's just, you know, you know, your laptop,"}, {"Time_Start": 1508.34, "Time_End": 1514.1999999999998, "Text": " or something. I mean, it can't hurt to throw a nice IPFW rule set on your laptop and keep people out."}, {"Time_Start": 1514.26, "Time_End": 1517.4199999999998, "Text": " I'm sure a lot of people had that payoff at DefCon this year, you know?"}, {"Time_Start": 1518.9599999999998, "Time_End": 1520.1, "Text": " And it's really easy."}, {"Time_Start": 1520.22, "Time_End": 1527.12, "Text": " If you go to, if you look at it in the ETC directory, there's an RC firewall file, and I think I'd"}, {"Time_Start": 1527.12, "Time_End": 1529.78, "Text": " get into that later on, but I can't, come on I get ahead of it. Oh, go ahead."}, {"Time_Start": 1529.78, "Time_End": 1535.8999999999999, "Text": " What is the performance in fact that you can't have to celebrate with those tools on the business system?"}, {"Time_Start": 1537.1, "Time_End": 1538.32, "Text": " He says, what's the, the performance."}, {"Time_Start": 1538.3400000000001, "Time_End": 1545.1000000000001, "Text": " performance impact on a couple dozen rules set IPFW setup on a busy system. It depends"}, {"Time_Start": 1545.1000000000001, "Time_End": 1550.14, "Text": " what you define as a busy system, and it depends how fast your link speed is, and it depends"}, {"Time_Start": 1550.14, "Time_End": 1560.3400000000001, "Text": " on the specs of the machine. Personally, I've seen a machine take, like 80 or 90 megabits of"}, {"Time_Start": 1560.3400000000001, "Time_End": 1567.2, "Text": " it was filtering, and it was like a one gigahertz penny and three or something. And you could"}, {"Time_Start": 1567.2, "Time_End": 1571.74, "Text": " tell that the load is noticeable. I don't really have any measurable data to give you, but I would"}, {"Time_Start": 1571.74, "Time_End": 1579.14, "Text": " say probably like a 20% or 30% impact, but that's with the full out 80 megabit right across a fast"}, {"Time_Start": 1579.14, "Time_End": 1583.1000000000001, "Text": " Ethernet link. It was dropping every single packet, so."}, {"Time_Start": 1588.6000000000001, "Time_End": 1594.16, "Text": " Okay, a lot of people have kind of, they say, you know, it's, I'd like SFTP and everything,"}, {"Time_Start": 1594.32, "Time_End": 1596.8600000000001, "Text": " but I'm either I'm running in anonymous file archive or,"}, {"Time_Start": 1597.2, "Time_End": 1602.26, "Text": " I've got users who need FTP. They don't want to learn a new client, even though it's kind of"}, {"Time_Start": 1602.26, "Time_End": 1606.46, "Text": " transparent as to the differences. You know, they have some old scripts or something that are using"}, {"Time_Start": 1606.46, "Time_End": 1612.42, "Text": " FDP that they can convert, whatever reason. I would not recommend using FTP really anymore unless"}, {"Time_Start": 1612.42, "Time_End": 1618.42, "Text": " you're running an anonymous archive. And I'll kind of show you how to lock it down, but, you know,"}, {"Time_Start": 1618.42, "Time_End": 1627.1000000000001, "Text": " if you've got any users logging in individually, put their username in the ETC-FTP-H-Rute file."}, {"Time_Start": 1627.2, "Time_End": 1630.1200000000001, "Text": " and that's just going to basically restrict them to their home directory."}, {"Time_Start": 1631.16, "Time_End": 1635.14, "Text": " By default, they're not going to be restricted. They're going to just be able to move all around the file system."}, {"Time_Start": 1635.54, "Time_End": 1638.56, "Text": " And so if you've been kind of waxed with your file permission somewhere else,"}, {"Time_Start": 1639.26, "Time_End": 1642.02, "Text": " you know, they may have access to something that you don't want them to have access to."}, {"Time_Start": 1643.72, "Time_End": 1652.38, "Text": " If you start FTP from INETD, you can go and stick all, some of these flags right at the end."}, {"Time_Start": 1653.38, "Time_End": 1657.18, "Text": " Dash L twice will enable extended logging, and then you actually have to turn."}, {"Time_Start": 1657.2, "Time_End": 1659.7, "Text": " turn on logging for the FTP facility and SISLog."}, {"Time_Start": 1659.7, "Time_End": 1666.2, "Text": " That's going to give you each connection, each user's connecting,"}, {"Time_Start": 1666.2, "Time_End": 1671.2, "Text": " you know, time and date and also any files that they're uploading or downloading."}, {"Time_Start": 1671.2, "Time_End": 1673.2, "Text": " And so the files can be kind of verbose."}, {"Time_Start": 1673.2, "Time_End": 1677.2, "Text": " It's kind of similar to the X for log functionality in Linux."}, {"Time_Start": 1677.2, "Time_End": 1684.2, "Text": " If you're running an anonymous archive, use like capital dash A and dash R,"}, {"Time_Start": 1684.2, "Time_End": 1687.18, "Text": " and capital A is only going to allow anonymous"}, {"Time_Start": 1687.2, "Time_End": 1693.2, "Text": " nothing else, which is handy because nobody's going to figure out that they can FTP into your machine when you really don't want them to,"}, {"Time_Start": 1693.2, "Time_End": 1695.2, "Text": " even though they're a legitimate user."}, {"Time_Start": 1695.2, "Time_End": 1704.2, "Text": " And dash R is read-only mode, where the Damon will actually restrict itself from making any right calls to the system at all."}, {"Time_Start": 1704.2, "Time_End": 1711.2, "Text": " So in the event that somebody figures out how to overflow your, because FTPD runs his route, so, you know,"}, {"Time_Start": 1711.2, "Time_End": 1715.2, "Text": " if somebody figures out how to overflow that, it's not going to be able to write anything to the machine."}, {"Time_Start": 1717.2, "Time_End": 1723.2, "Text": " Okay, logging is obviously very important keeping track of your system."}, {"Time_Start": 1723.2, "Time_End": 1729.2, "Text": " And, you know, obviously logging, you have to spend the time looking at your logs on your system,"}, {"Time_Start": 1729.2, "Time_End": 1732.2, "Text": " so you know what's routine and you know what's not routine."}, {"Time_Start": 1732.2, "Time_End": 1737.2, "Text": " Because if you see something out of the ordinary, that kind of looks out of the ordinary,"}, {"Time_Start": 1737.2, "Time_End": 1741.2, "Text": " just because you say that's not really right, if you don't have, like, data to back that up,"}, {"Time_Start": 1741.2, "Time_End": 1745.2, "Text": " you know, say I haven't seen something like that in a month or something, or I've never seen that before,"}, {"Time_Start": 1745.2, "Time_End": 1746.2, "Text": " that's going to be a lot, you know, more of a clue in to you."}, {"Time_Start": 1746.2, "Time_End": 1748.94, "Text": " you know, more of a clue into you that, hey, something funny is going on."}, {"Time_Start": 1750.2, "Time_End": 1757.7, "Text": " If you start, if you're running like a regular workstation, I would recommend this, start syslog with the dash s-sflags,"}, {"Time_Start": 1757.7, "Time_End": 1762.9, "Text": " and that's just going to prevent the demon from opening the UDP port 514."}, {"Time_Start": 1763.7, "Time_End": 1773.88, "Text": " By default, free BSD won't let any users connect to your syslog daemon to log, and a lot operating systems didn't use to do that,"}, {"Time_Start": 1773.96, "Time_End": 1775.96, "Text": " and so people could, you know, fill up your logs."}, {"Time_Start": 1776.2, "Time_End": 1778.88, "Text": " at the very worst fill up your whole file system."}, {"Time_Start": 1778.98, "Time_End": 1780.3600000000001, "Text": " If you didn't have permission set up, right,"}, {"Time_Start": 1781.44, "Time_End": 1784.32, "Text": " someone would just allow unauthenticated connections from anywhere."}, {"Time_Start": 1785.8, "Time_End": 1789.32, "Text": " This is just going to keep anybody from being able to connect your syslog D at all."}, {"Time_Start": 1791.44, "Time_End": 1794.74, "Text": " I would recommend setting up a centralized syslog file,"}, {"Time_Start": 1794.8400000000001, "Time_End": 1799.06, "Text": " especially if you're running in Enterprise, and you've got 10 or 20 different servers,"}, {"Time_Start": 1799.16, "Time_End": 1803.6200000000001, "Text": " maybe, it's much easier to send all the data to a central place"}, {"Time_Start": 1803.6200000000001, "Time_End": 1806.18, "Text": " and then maybe even pull the data."}, {"Time_Start": 1806.2, "Time_End": 1810.96, "Text": " into some kind of, you know, an Excel spreadsheet or something for quick sorting or a database."}, {"Time_Start": 1811.7, "Time_End": 1813.32, "Text": " This is the syntax to do it."}, {"Time_Start": 1813.32, "Time_End": 1821.28, "Text": " You just, this is the wild card right here is just saying log anything on any facility to remote host."}, {"Time_Start": 1821.28, "Time_End": 1824.56, "Text": "org, and you can obviously fill it in with a local IP address or something."}, {"Time_Start": 1825.0, "Time_End": 1830.0, "Text": " You will not be able to use this dash-sess thing up here, though, with this machine that you're sending the logs to,"}, {"Time_Start": 1830.0, "Time_End": 1833.72, "Text": " obviously it needs to have that port open to be able to accept the logs."}, {"Time_Start": 1836.2, "Time_End": 1842.02, "Text": " In your Syslog com file, add this var-log FTPD or whatever you want to call it,"}, {"Time_Start": 1842.26, "Time_End": 1847.96, "Text": " if you're running an FTP server so that you can, you know, you get more information about what's going on with FTP."}, {"Time_Start": 1848.14, "Time_End": 1851.24, "Text": " I think by default it doesn't log anything that's going on with FTP at all,"}, {"Time_Start": 1851.76, "Time_End": 1856.16, "Text": " or maybe it drops it into messages, which is kind of clugy because there's so much other stuff going on in that file."}, {"Time_Start": 1856.48, "Time_End": 1857.46, "Text": " It's kind of hard to keep track."}, {"Time_Start": 1858.92, "Time_End": 1864.56, "Text": " The security file, IPFW, uses the security facility, and so do a few other applications,"}, {"Time_Start": 1864.56, "Time_End": 1872.22, "Text": " but at the end of your IPFW rule base, drop like a, you know, because it'll just do,"}, {"Time_Start": 1872.6399999999999, "Time_End": 1876.86, "Text": " it just goes down the rule base, and if a packet doesn't match, it'll drop to the next rule."}, {"Time_Start": 1877.24, "Time_End": 1884.24, "Text": " At the end, put it like a log-any rule, and anything that didn't match any of your other packets"}, {"Time_Start": 1884.24, "Time_End": 1886.36, "Text": " is going to go ahead and get dropped into that file."}, {"Time_Start": 1888.1399999999999, "Time_End": 1893.94, "Text": " There's a, I'm sure most of you guys have heard this, there's a, D-Shield.org project, and"}, {"Time_Start": 1893.94, "Time_End": 1900.3, "Text": " they have a client framework for IPFW logs, and it's like, it's just a Perl script that goes through"}, {"Time_Start": 1900.3, "Time_End": 1906.76, "Text": " and parses it out and changes the data into the D-Shield compatible data, and then you can set"}, {"Time_Start": 1906.76, "Time_End": 1911.7, "Text": " up a Cron script or something to email that data every night or something, you know, people connecting"}, {"Time_Start": 1911.7, "Time_End": 1916.7, "Text": " to your machine, and then you can go and log in through the web and take a look at it, and you can coordinate"}, {"Time_Start": 1916.7, "Time_End": 1919.8400000000001, "Text": " it with other people, other people submit their logs around the world. It's pretty cool."}, {"Time_Start": 1923.94, "Time_End": 1933.94, "Text": " Yeah?"}, {"Time_Start": 1933.94, "Time_End": 1934.94, "Text": " Right."}, {"Time_Start": 1934.94, "Time_End": 1947.94, "Text": " And as if people come on, you know, he said the FTP file, you can drop users at all."}, {"Time_Start": 1947.94, "Time_End": 1953.92, "Text": " And so obviously you're going to drop, like, and, obviously, you're going to drop, like, root, and obviously, any privileged user, you know, you don't want them, you don't want them, you don't want them pass."}, {"Time_Start": 1953.94, "Time_End": 1960.24, "Text": " their password and clear text. And that's, that's a good add on to the rest of the FTP stuff, the FTPCH route and everything else."}, {"Time_Start": 1961.42, "Time_End": 1971.76, "Text": " Some of this stuff is kind of interesting. This isn't, this isn't default with BSD, but I ran across a couple of these projects, just doing a little bit of research."}, {"Time_Start": 1972.4, "Time_End": 1982.8200000000002, "Text": " Trojanproof.org. They actually have a really cool white paper on their webpage about how they developed this tool, but I think they started with OpenBSD and they moved to free BSD for development."}, {"Time_Start": 1983.94, "Time_End": 1996.26, "Text": " And it's kind of like, it's almost like Tripwire, but in the kernel, and it can tell you if there are any MB5 variations, if something's changed with files that are executing on your system."}, {"Time_Start": 1996.3400000000001, "Time_End": 2000.24, "Text": " So as they're executing, it goes ahead and does the hash on a file to see if it's changed."}, {"Time_Start": 2001.04, "Time_End": 2009.28, "Text": " And they have some performance specs because a lot of people were concerned about performance on an enterprise machine, obviously."}, {"Time_Start": 2009.28, "Time_End": 2013.1200000000001, "Text": " And I think to benchmark it, they, like, built the kernel with,"}, {"Time_Start": 2013.94, "Time_End": 2020.38, "Text": " this enabled in the kernel, and then this without, and I think there's like a 12-second difference or two-second difference."}, {"Time_Start": 2020.5800000000002, "Time_End": 2022.64, "Text": " I can't remember which, but it really wasn't that bad."}, {"Time_Start": 2023.6000000000001, "Time_End": 2027.68, "Text": " And so that kind of works well with another file integrity tool like TripWire."}, {"Time_Start": 2029.02, "Time_End": 2036.5, "Text": " And that's just going to give you the kernel level MD5 checking."}, {"Time_Start": 2036.8400000000001, "Time_End": 2038.46, "Text": " And go ahead and check out the website."}, {"Time_Start": 2038.46, "Time_End": 2043.3400000000001, "Text": " They've got, they can explain it much better than I can, as far as if you're interested in the specifics of how it works."}, {"Time_Start": 2043.94, "Time_End": 2046.6200000000001, "Text": " The next one is server.sf.net."}, {"Time_Start": 2047.96, "Time_End": 2056.1, "Text": " This does like system call interception and logging of any, what you might deem potentially dangerous system calls."}, {"Time_Start": 2056.76, "Time_End": 2060.66, "Text": " So I've got a few listed here, ExecVE, Petrace, Set UID."}, {"Time_Start": 2061.16, "Time_End": 2064.86, "Text": " You can configure every single one of these through SISCTL commands."}, {"Time_Start": 2065.48, "Time_End": 2071.86, "Text": " So you can say, you know, I think that set UID calls really dangerous alert and block it."}, {"Time_Start": 2071.86, "Time_End": 2073.92, "Text": " Or you can say, I think PTrace."}, {"Time_Start": 2073.94, "Time_End": 2079.16, "Text": " I just want to log any of that, or I don't want to do anything with ExecVE, for example."}, {"Time_Start": 2079.52, "Time_End": 2081.88, "Text": " So, I mean, you can configure it to whatever settings you want."}, {"Time_Start": 2081.96, "Time_End": 2086.98, "Text": " And the author actually has some recommended settings if you're not really sure what's what."}, {"Time_Start": 2087.3, "Time_End": 2091.62, "Text": " You really kind of have to tweak it for your environment to see, you know, what your system is using."}, {"Time_Start": 2092.16, "Time_End": 2098.4, "Text": " And there's a tool called SIST trace that was actually written for OpenBSD."}, {"Time_Start": 2098.4, "Time_End": 2103.34, "Text": " And a guy at Black Hat this week showed that he ported it to free BSD."}, {"Time_Start": 2103.94, "Time_End": 2110.88, "Text": " And what SIS trace does is it'll basically log system calls that are being used by a particular process"}, {"Time_Start": 2110.88, "Time_End": 2116.64, "Text": " and then block ones that are not in what's called like a rules file for it."}, {"Time_Start": 2116.68, "Time_End": 2121.36, "Text": " So you initially set it up and you run it with like a wrapper, like a TCP wrapper."}, {"Time_Start": 2122.38, "Time_End": 2127.34, "Text": " So you execute SIS trace and then I think it's like dash A and then the demon."}, {"Time_Start": 2127.34, "Time_End": 2130.88, "Text": " and it'll start up and it'll log the SIS calls that it uses so you can go through,"}, {"Time_Start": 2130.88, "Time_End": 2132.26, "Text": " go ahead and put it through its paces."}, {"Time_Start": 2132.46, "Time_End": 2133.3, "Text": " We'll say for SSAH, you'll log."}, {"Time_Start": 2133.94, "Time_End": 2140.2200000000003, "Text": " log in, you know, do an SEP, copy a file over, whatever, and then it'll drop all that stuff"}, {"Time_Start": 2140.2200000000003, "Time_End": 2143.78, "Text": " into a text file, it's like a rules file, and then you can say, okay, that's everything that it"}, {"Time_Start": 2143.78, "Time_End": 2145.66, "Text": " can do, don't let it do anything else."}, {"Time_Start": 2145.66, "Time_End": 2152.9, "Text": " And so, you know, if you temp like an off by one exploit or something on your SSH damon, if it uses"}, {"Time_Start": 2152.9, "Time_End": 2158.62, "Text": " a system call that isn't used by SSH legitimately, it's just going to drop it, so that's"}, {"Time_Start": 2158.62, "Time_End": 2159.62, "Text": " kind of nifty."}, {"Time_Start": 2161.54, "Time_End": 2163.92, "Text": " BPF in your kernel is enabled by the file."}, {"Time_Start": 2163.94, "Time_End": 2170.36, "Text": " fault. I think it's, you only allowed two concurrent B.P.F filters in the generic"}, {"Time_Start": 2170.36, "Time_End": 2175.78, "Text": " kernel, but if you're running a production machine, you have no needs for promiscuous mode or any"}, {"Time_Start": 2175.78, "Time_End": 2181.14, "Text": " kind of real raw packet sniffing type stuff on your system, you should probably turn this off."}, {"Time_Start": 2182.7200000000003, "Time_End": 2189.26, "Text": " If you do this in conjunction with setting secure levels on your machine, so an intruder couldn't"}, {"Time_Start": 2189.26, "Time_End": 2193.92, "Text": " load a kernel module or something to make a change, that's just going to put a"}, {"Time_Start": 2193.94, "Time_End": 2199.1, "Text": " prevent people from sniffing on your wire. And another thing that you may want to do is"}, {"Time_Start": 2199.1, "Time_End": 2205.2400000000002, "Text": " write a script to check your D message output to see if anyone's put your interface into promiscuous"}, {"Time_Start": 2205.2400000000002, "Time_End": 2209.18, "Text": " mode and you don't know about it. So you could use like swatch or something to monitor the logs"}, {"Time_Start": 2209.18, "Time_End": 2217.78, "Text": " and send an email. But I mean, BPF is used by other things. Any kind of like some like real"}, {"Time_Start": 2217.78, "Time_End": 2223.56, "Text": " raw IP stuff may use it. So you probably want to test it out on a non-production system before you do"}, {"Time_Start": 2223.56, "Time_End": 2226.16, "Text": " that on anything that's production."}, {"Time_Start": 2228.2599999999998, "Time_End": 2228.74, "Text": " Okay."}, {"Time_Start": 2229.74, "Time_End": 2235.48, "Text": " This part's called keeping people out, and it's some of it's pretty basic, but a lot of people"}, {"Time_Start": 2235.48, "Time_End": 2242.42, "Text": " don't really use TCP wrappers, and they should, for non-public services, for like SSH, authentication,"}, {"Time_Start": 2243.1, "Time_End": 2247.08, "Text": " stuff that people aren't connecting to anonymous, honestly."}, {"Time_Start": 2247.08, "Time_End": 2252.02, "Text": " For example, like people sending you email connecting to your SMTP server or, you know, browsing"}, {"Time_Start": 2252.02, "Time_End": 2256.54, "Text": " your website or whatever. I mean, you can't do, you can't use TCP wrappers with that stuff,"}, {"Time_Start": 2256.6, "Time_End": 2262.64, "Text": " obviously, because you don't know who's coming. But for SSH and FTP, if you know, you've only"}, {"Time_Start": 2262.64, "Time_End": 2266.82, "Text": " got a select group of using FTP. I mean, the more you lock it down, the better you're off. And"}, {"Time_Start": 2266.82, "Time_End": 2273.22, "Text": " so like TCP wrappers combined with a nice IPFW rule set, it's just going to give you that defense"}, {"Time_Start": 2273.22, "Time_End": 2278.4, "Text": " in depth. And, you know, you never know when it can pay off. So the next one is a lot of users and"}, {"Time_Start": 2278.4, "Time_End": 2282.0, "Text": " a lot of groups, arguments in the SSHDG."}, {"Time_Start": 2282.02, "Time_End": 2287.2599999999998, "Text": " config file. You can specify certain users or certain groups, respectively, that are allowed to connect"}, {"Time_Start": 2287.2599999999998, "Time_End": 2294.32, "Text": " to SSH using SSH. So if, you know, you've got a user who's an FTP user, and you need to"}, {"Time_Start": 2294.32, "Time_End": 2298.38, "Text": " give them a shell for some reason, but you don't want them to come in through SSH, you obviously use this"}, {"Time_Start": 2298.38, "Time_End": 2304.84, "Text": " to not allow them. I think it's disallow users to not allow. You probably want to double-check that."}, {"Time_Start": 2305.98, "Time_End": 2310.74, "Text": " So go ahead. This works well with TCP wrapper usage and privilege separation in open SSH."}, {"Time_Start": 2312.02, "Time_End": 2317.7599999999998, "Text": " This last one is give users, people that are only FTP into the machine, give them a no-log-in shell."}, {"Time_Start": 2317.86, "Time_End": 2319.88, "Text": " Obviously, people have been doing that for years. That's pretty basic."}, {"Time_Start": 2323.58, "Time_End": 2328.7, "Text": " So these are some tools that you can use to check your system, and if you don't know what MF is,"}, {"Time_Start": 2328.7, "Time_End": 2330.1, "Text": " you're probably in the wrong building."}, {"Time_Start": 2331.78, "Time_End": 2336.66, "Text": " Whisker is pretty cool. There's a new Whisker version 2 that RFP is developing. That's the author,"}, {"Time_Start": 2337.16, "Time_End": 2341.94, "Text": " and it's a little more modular. So his website is wiretrip.net."}, {"Time_Start": 2342.02, "Time_End": 2349.96, "Text": " You may want to check that out, but the one in the ports tree is Whisker 1.4, which is, you know, it works okay for auditing, real basic stuff."}, {"Time_Start": 2350.96, "Time_End": 2354.98, "Text": " You know, if you've got an old pHF vulnerability on your network or something."}, {"Time_Start": 2355.74, "Time_End": 2362.78, "Text": " Tripwire, Tripwire is a commercial entity now, but what's called the academic source release of Tripwire is still available for free use."}, {"Time_Start": 2364.88, "Time_End": 2367.1, "Text": " And all you have to do is go in the ports tree and build it."}, {"Time_Start": 2367.1, "Time_End": 2371.08, "Text": " And you actually have to go get the source yourself. It doesn't use the traditional disk files."}, {"Time_Start": 2372.02, "Time_End": 2374.54, "Text": " distribution method just because of the way the licensing works."}, {"Time_Start": 2375.7, "Time_End": 2380.08, "Text": " But you can, I mean, triple wire it, you know, install it on your system, generate the database,"}, {"Time_Start": 2380.42, "Time_End": 2385.0, "Text": " and then keep the database on a floppy disk or something and go through and just verify that"}, {"Time_Start": 2385.0, "Time_End": 2387.14, "Text": " anything that's been changed you know you know about."}, {"Time_Start": 2387.7, "Time_End": 2391.04, "Text": " And that can give you real peace of mind as far as what's going on on on your system."}, {"Time_Start": 2391.52, "Time_End": 2395.7599999999998, "Text": " But again, it's only as granular as how you make it and how many files you have a check."}, {"Time_Start": 2396.2, "Time_End": 2399.02, "Text": " And if you have it look at everything, you're going to drive yourself crazy just because the amount"}, {"Time_Start": 2399.02, "Time_End": 2402.0, "Text": " of file changes that get take place that, you know, you don't really,"}, {"Time_Start": 2402.02, "Time_End": 2409.0, "Text": " realize. And snort, a lot of people are using snort on their, just their host machines now"}, {"Time_Start": 2409.0, "Time_End": 2414.98, "Text": " because it's a lot easier than, you know, kind of doing the combined like log analysis or everything"}, {"Time_Start": 2414.98, "Time_End": 2420.72, "Text": " and looking at some of the other, you know, your firewall logs and everything else with snort."}, {"Time_Start": 2420.82, "Time_End": 2424.5, "Text": " I mean, if something trips a signature, you're kind of interested in what's going on. Go ahead."}, {"Time_Start": 2432.02, "Time_End": 2440.68, "Text": " Yeah, actually, yes, can I use snort for any kind of a defensive mechanism?"}, {"Time_Start": 2441.3, "Time_End": 2445.52, "Text": " And there's a tool called hogwash, and the address for it is hogwash."}, {"Time_Start": 2446.06, "Time_End": 2447.66, "Text": " Hodge.net."}, {"Time_Start": 2448.32, "Time_End": 2452.02, "Text": " And it's written or co-written by one of the snort developers."}, {"Time_Start": 2453.06, "Time_End": 2457.6, "Text": " And it's actually being integrated into the Snort CVS tree right now for Snort 1.9."}, {"Time_Start": 2457.96, "Time_End": 2459.18, "Text": " It's going to be called the Inline Snort."}, {"Time_Start": 2459.2599999999998, "Time_End": 2460.64, "Text": " It's just going to be a compile time option."}, {"Time_Start": 2461.2, "Time_End": 2462.0, "Text": " But basically,"}, {"Time_Start": 2462.02, "Time_End": 2467.24, "Text": " instead of like an alert, you know, rewrite a snort rule, instead of the alert variable to,"}, {"Time_Start": 2467.24, "Time_End": 2470.98, "Text": " like, you know, alert and write to a file or something, you can do drops."}, {"Time_Start": 2471.4, "Time_End": 2477.92, "Text": " And so for a TCP connection, it'll send a reset back as soon as it realizes that the packet matches"}, {"Time_Start": 2477.92, "Time_End": 2482.88, "Text": " the payload for, say, like a Code Red attack or something. And it also has content replacement."}, {"Time_Start": 2483.48, "Time_End": 2490.42, "Text": " So, you know, going back to Code Red, you could say replace CMD.ex with XYZ.com or replace the first,"}, {"Time_Start": 2490.42, "Time_End": 2495.82, "Text": " you know, four or five bytes of the, of a shell code slide or something with nulls."}, {"Time_Start": 2496.2400000000002, "Time_End": 2501.32, "Text": " And those, you know, even if, even if your, uh, your system isn't patched, you're still going to be"}, {"Time_Start": 2501.32, "Time_End": 2505.58, "Text": " protected to an extent because you're just basically screwing up the exploit."}, {"Time_Start": 2505.58, "Time_End": 2510.5, "Text": " And it kind of, it kind of confuses the attacker because if they're sending like a Cmb.md."}, {"Time_Start": 2510.52, "Time_End": 2515.7400000000002, "Text": " DXC request, they're just going to get back, you know, a 404 or something because their request"}, {"Time_Start": 2515.7400000000002, "Time_End": 2517.1, "Text": " is being modified halfway through."}, {"Time_Start": 2517.7000000000003, "Time_End": 2520.4, "Text": " So it can, uh, it, it, it, it, it, it, it, it, you know, it."}, {"Time_Start": 2520.42, "Time_End": 2525.7400000000002, "Text": " And that's kind of a mixed blessing because if they really are clever and they start going, well, hey, what's going on?"}, {"Time_Start": 2525.78, "Time_End": 2528.82, "Text": " I know that I was able to get to that, you know, two days ago or something."}, {"Time_Start": 2529.16, "Time_End": 2530.1, "Text": " They started digging in deeper."}, {"Time_Start": 2530.3, "Time_End": 2533.0, "Text": " They may be able to figure out that you're running something like hogwash on your network."}, {"Time_Start": 2533.3, "Time_End": 2540.26, "Text": " But a lot of people are actually deploying that outside their firewall to grab stuff before it hits their DMZ, and it's pretty effective."}, {"Time_Start": 2544.06, "Time_End": 2544.58, "Text": " Go ahead."}, {"Time_Start": 2550.42, "Time_End": 2552.26, "Text": " Right."}, {"Time_Start": 2553.1800000000003, "Time_End": 2556.8, "Text": " Yeah, you just mentioned AID is another file integrity tool."}, {"Time_Start": 2558.26, "Time_End": 2562.78, "Text": " Right."}, {"Time_Start": 2563.6800000000003, "Time_End": 2564.86, "Text": " I really like Trippart."}, {"Time_Start": 2564.92, "Time_End": 2566.1, "Text": " I like the signature syntax."}, {"Time_Start": 2566.48, "Time_End": 2570.38, "Text": " It's really flexible, and it's pretty easy to write some pretty custom rules really fast."}, {"Time_Start": 2574.3, "Time_End": 2576.48, "Text": " Okay, just some miscellaneous stuff."}, {"Time_Start": 2577.26, "Time_End": 2578.84, "Text": " You should throw these on all your machines."}, {"Time_Start": 2578.84, "Time_End": 2580.32, "Text": " Like, throw it, you know, use NPP date."}, {"Time_Start": 2580.42, "Time_End": 2585.32, "Text": " Cron tab it and have it sync time with, you know, an internal time server or something out on the internet."}, {"Time_Start": 2585.46, "Time_End": 2587.76, "Text": " So, you know, your logs are always in sync and up-to-date."}, {"Time_Start": 2588.42, "Time_End": 2591.2000000000003, "Text": " I know some of the stuff seems basic, but a lot of people don't do it."}, {"Time_Start": 2591.6, "Time_End": 2598.16, "Text": " In the TTIs file, change the secure flag to insecure on all your local TTIs."}, {"Time_Start": 2599.06, "Time_End": 2602.56, "Text": " And that's just basically going to prevent root from logging in directly."}, {"Time_Start": 2602.7400000000002, "Time_End": 2606.1, "Text": " So you're just going to have to force somebody to log in as themselves and then, like,"}, {"Time_Start": 2606.1, "Time_End": 2608.1, "Text": " S.U. to root or use pseudo or something."}, {"Time_Start": 2609.58, "Time_End": 2610.1, "Text": " And also, you know, you know, you're just going to get into root or something."}, {"Time_Start": 2610.42, "Time_End": 2615.8, "Text": " Also, in SSHD config, there's a permit route login, and I think by default it's yes."}, {"Time_Start": 2616.1800000000003, "Time_End": 2617.62, "Text": " So obviously, you change that to know."}, {"Time_Start": 2617.6800000000003, "Time_End": 2620.08, "Text": " You don't want people logging into your system as root."}, {"Time_Start": 2620.16, "Time_End": 2628.54, "Text": " I mean, never, whenever possible, don't use the root password for some kind of authentication at the very most use it, you know,"}, {"Time_Start": 2628.58, "Time_End": 2629.62, "Text": " your S-U-to-Root or something."}, {"Time_Start": 2630.2000000000003, "Time_End": 2636.06, "Text": " But if you can use pseudo, because you just can be able to restrict who knows the root password on your system"}, {"Time_Start": 2636.06, "Time_End": 2640.4, "Text": " and you can granularly lock down, you know, who can do what on your machine, and they don't need the root"}, {"Time_Start": 2640.42, "Time_End": 2646.42, "Text": " The last one is a kernel configuration that you can do."}, {"Time_Start": 2646.42, "Time_End": 2650.42, "Text": " It's a pseudo device that you can enable called the SNP device."}, {"Time_Start": 2650.42, "Time_End": 2653.42, "Text": " And you can go ahead and use that."}, {"Time_Start": 2653.42, "Time_End": 2658.42, "Text": " I think the tool is called watch in the user as spin directory."}, {"Time_Start": 2658.42, "Time_End": 2661.42, "Text": " And you can attach to a TTY on your machine and it's non-interactive."}, {"Time_Start": 2661.42, "Time_End": 2669.42, "Text": " You can type back, but you can watch what somebody's doing and you can monitor them as they're going along."}, {"Time_Start": 2669.42, "Time_End": 2674.54, "Text": " Okay, so here's some related stuff."}, {"Time_Start": 2674.98, "Time_End": 2679.92, "Text": " Here's the link that this presentation is going to be available at with some of the updated info."}, {"Time_Start": 2681.42, "Time_End": 2687.64, "Text": " And freebSD.org slash security, I mean, you definitely want to bookmark that and check that out pretty often"}, {"Time_Start": 2687.64, "Time_End": 2694.7400000000002, "Text": " because that's where they post all the security advisories, and they also, there's like a security"}, {"Time_Start": 2694.7400000000002, "Time_End": 2698.04, "Text": " how-to that was, it's kind of outdated, it was written a few years ago, but it's got some good info."}, {"Time_Start": 2698.04, "Time_End": 2702.34, "Text": " And I've got some free stuff for you guys from the FreeBSD mall guys."}, {"Time_Start": 2704.04, "Time_End": 2706.42, "Text": " I think I've almost got enough for every single person in here."}, {"Time_Start": 2708.42, "Time_End": 2715.38, "Text": " And so, yeah, Murray, the guy who runs Free BSD mall, heard I was going to be talking about Free BSD, and so we were talking."}, {"Time_Start": 2716.4, "Time_End": 2720.14, "Text": " If you guys want to come up, I've got, well, actually, hang on, let me do T-shirts first."}, {"Time_Start": 2728.04, "Time_End": 2729.46, "Text": " All right, hang on, hang on."}, {"Time_Start": 2730.38, "Time_End": 2732.2599999999998, "Text": " I've got to give my plug first."}, {"Time_Start": 2732.34, "Time_End": 2738.42, "Text": " These are made by my friend Tim, and he works for a company called hacksoreware.com, and nobody else has these t-shirts."}, {"Time_Start": 2738.52, "Time_End": 2739.58, "Text": " He's all like zero-day, so."}, {"Time_Start": 2741.74, "Time_End": 2743.08, "Text": " Hold on, hold on, hold on."}, {"Time_Start": 2744.2, "Time_End": 2744.9, "Text": " Let me take one."}, {"Time_Start": 2745.0, "Time_End": 2749.0, "Text": " Mr. Sir?"}, {"Time_Start": 2751.1, "Time_End": 2752.02, "Text": " Too late, babe."}, {"Time_Start": 2755.22, "Time_End": 2756.3, "Text": " What was your question, sir?"}, {"Time_Start": 2758.04, "Time_End": 2759.34, "Text": " What was his comment, ma'am?"}, {"Time_Start": 2762.24, "Time_End": 2764.42, "Text": " That's what happens when you resist arrest."}, {"Time_Start": 2765.6, "Time_End": 2766.3, "Text": " Very good, sir."}, {"Time_Start": 2766.36, "Time_End": 2767.18, "Text": " You must be a cop."}, {"Time_Start": 2768.48, "Time_End": 2770.54, "Text": " Next year, folks, spot the fed."}, {"Time_Start": 2774.54, "Time_End": 2775.66, "Text": " But we're out of shirts, so."}]}