{"segments": [{"Time_Start": 0.0, "Time_End": 7.0, "Text": " A lot of them are actually detailed on the conference CD."}, {"Time_Start": 7.0, "Time_End": 8.0, "Text": " Oh, hey Jeff."}, {"Time_Start": 8.0, "Time_End": 10.0, "Text": " Give a hand for Jeff Moss."}, {"Time_Start": 14.0, "Time_End": 15.0, "Text": " Thanks."}, {"Time_Start": 15.0, "Time_End": 20.0, "Text": " We're going to take this off the screen for a second as we enter the IP address."}, {"Time_Start": 20.0, "Time_End": 24.0, "Text": " No particular reason. I trust each and every one of you."}, {"Time_Start": 30.0, "Time_End": 35.0, "Text": " Well, Michael is entering the address information."}, {"Time_Start": 35.0, "Time_End": 38.0, "Text": " My name is Dave Enler, Michael Sutton."}, {"Time_Start": 38.0, "Time_End": 39.0, "Text": " We work for eye defense."}, {"Time_Start": 39.0, "Time_End": 41.0, "Text": " I defense is a security intelligence company,"}, {"Time_Start": 41.0, "Time_End": 43.0, "Text": " just to give you a bit of background."}, {"Time_Start": 43.0, "Time_End": 45.0, "Text": " Michael and I work for eye defense labs,"}, {"Time_Start": 45.0, "Time_End": 47.0, "Text": " the security research arm of eye defense,"}, {"Time_Start": 47.0, "Time_End": 51.0, "Text": " and one of our keen interest is web application security."}, {"Time_Start": 51.0, "Time_End": 54.0, "Text": " Today we're going to talk about a very narrow aspect"}, {"Time_Start": 54.0, "Time_End": 55.0, "Text": " of web application security,"}, {"Time_Start": 55.0, "Time_End": 57.0, "Text": " but it's an important aspect"}, {"Time_Start": 57.0, "Time_End": 59.0, "Text": " because these types of vulnerabilities that we're going"}, {"Time_Start": 59.0, "Time_End": 68.0, "Text": " of vulnerabilities that we're going to be talking about are extremely prevalent on a lot of websites and web applications software softwares out there."}, {"Time_Start": 68.0, "Time_End": 74.0, "Text": " Additionally, it takes about half a second and half a brain to exploit these vulnerabilities."}, {"Time_Start": 74.0, "Time_End": 82.0, "Text": " So we're just going to walk through some of the basics, go through some just basic concepts of how state mechanisms are applied in web application sense,"}, {"Time_Start": 82.0, "Time_End": 84.0, "Text": " and how you can easily break through those."}, {"Time_Start": 84.0, "Time_End": 88.98, "Text": " So essentially we're going to be talking about how to brute force an application, not necessarily with the traditional"}, {"Time_Start": 89.0, "Time_End": 93.0, "Text": " username and password, you know, one, two, three, one, two, three, guest, guest."}, {"Time_Start": 93.0, "Time_End": 98.0, "Text": " But brute forcing that state mechanism, that's usually transparent to the user."}, {"Time_Start": 98.0, "Time_End": 114.0, "Text": " On the course of our research, we're getting started, just in terms of the legality of testing these types of mechanisms."}, {"Time_Start": 114.0, "Time_End": 118.98, "Text": " On the course of our research, we treated a lot of the holes we found, and we are going to be"}, {"Time_Start": 119.0, "Time_End": 123.0, "Text": " actually demonstrating some live holes that we notified the vendor of about a year ago."}, {"Time_Start": 123.0, "Time_End": 124.0, "Text": " They're still there."}, {"Time_Start": 124.0, "Time_End": 131.0, "Text": " Most of them either ignored us or were somewhat responsible in their response."}, {"Time_Start": 131.0, "Time_End": 137.0, "Text": " One in particular, and I'm not going to say much more about it, but one in particular threatened to sue us."}, {"Time_Start": 137.0, "Time_End": 141.0, "Text": " So these types of vulnerabilities, well, they might not seem that large."}, {"Time_Start": 141.0, "Time_End": 146.0, "Text": " You know, we go through the same sorts of responsible disclosure problems that all of you do as well."}, {"Time_Start": 146.0, "Time_End": 148.0, "Text": " And if Jennifer Granick is in the audience, thank you very much for your help."}, {"Time_Start": 148.0, "Time_End": 152.0, "Text": " you very much for your help and that of your students. She was actually able to provide some"}, {"Time_Start": 152.0, "Time_End": 158.0, "Text": " feedback and did a lot of the legwork when we were contacted by this company. So I'm not"}, {"Time_Start": 158.0, "Time_End": 162.0, "Text": " going to say anything more about it. And even if I'm completely drunk tonight, you're"}, {"Time_Start": 162.0, "Time_End": 164.0, "Text": " not going to be able to get me to say who it is."}, {"Time_Start": 178.0, "Time_End": 197.5, "Text": " But I'm having good time, pretending it is."}, {"Time_Start": 197.5, "Time_End": 203.0, "Text": " Sorry, we don't want to spend a lot of time on the network part, but"}, {"Time_Start": 203.0, "Time_End": 205.5, "Text": " they work on that I just want to spend a lot of time on the network part, but while they work on that,"}, {"Time_Start": 205.5, "Time_End": 206.5, "Text": " I just want to give another plug."}, {"Time_Start": 206.5, "Time_End": 207.5, "Text": " This is actually in the presentation."}, {"Time_Start": 208.0, "Time_End": 210.0, "Text": " it's not taking time out of it."}, {"Time_Start": 210.0, "Time_End": 214.0, "Text": " I'm one of the leaders of the open web application security project, OWASP,"}, {"Time_Start": 214.0, "Time_End": 219.0, "Text": " and it's actually a group of volunteers, it's a group of people in an open source community"}, {"Time_Start": 219.0, "Time_End": 225.0, "Text": " trying to work on some projects that raise the general level of awareness of web application security."}, {"Time_Start": 225.0, "Time_End": 229.0, "Text": " It seems in the last few years, we've just become, as an industry,"}, {"Time_Start": 229.0, "Time_End": 232.0, "Text": " we've just become aware that this is its own discipline."}, {"Time_Start": 232.0, "Time_End": 236.0, "Text": " So if you take a look at the website and I was going to walk you through some of the projects we're working on,"}, {"Time_Start": 236.0, "Time_End": 237.0, "Text": " it's OWASP.org."}, {"Time_Start": 237.0, "Time_End": 244.0, "Text": " org, OWASP.org. We're always looking for volunteers. I think there's probably a ton of talent in the"}, {"Time_Start": 244.0, "Time_End": 250.0, "Text": " audience. If you'd like to add your name to a project, and some of the projects are kind of"}, {"Time_Start": 250.0, "Time_End": 257.0, "Text": " documentation side and software side. The documentation side is actually working on web testing and"}, {"Time_Start": 257.0, "Time_End": 260.0, "Text": " web building documents to actually provide guidelines."}, {"Time_Start": 260.0, "Time_End": 262.0, "Text": " You know, how do you build a secure web application?"}, {"Time_Start": 262.0, "Time_End": 264.0, "Text": " How do you actually test it afterwards?"}, {"Time_Start": 264.0, "Time_End": 266.98, "Text": " When we were all looking at the stuff on the internet already, the real"}, {"Time_Start": 267.0, "Time_End": 272.0, "Text": " wasn't anything out there besides possibly the open source testing methodology"}, {"Time_Start": 272.0, "Time_End": 276.92, "Text": " from idea hamster.org. So take a look at the site. If you think there are things on there that"}, {"Time_Start": 276.92, "Time_End": 280.52, "Text": " interest you, drop me an email. Email will be on the presentation shortly."}, {"Time_Start": 280.52, "Time_End": 286.28, "Text": " I hope. Yeah, let's just get going. We might take a pause halfway through if we get connectivity,"}, {"Time_Start": 286.28, "Time_End": 287.64, "Text": " but don't want to delay much more."}, {"Time_Start": 297.0, "Time_End": 302.0, "Text": " So here's just an overview of what we're talking about."}, {"Time_Start": 302.0, "Time_End": 309.0, "Text": " In general, we'll just go through some basics, so we're all on the same page, go through some fun exploitation examples,"}, {"Time_Start": 309.0, "Time_End": 313.0, "Text": " and then talk about what developers, essentially there's three audiences."}, {"Time_Start": 313.0, "Time_End": 318.0, "Text": " Developers, when I say developers, I mean, people who actually buy the software from the vendors,"}, {"Time_Start": 318.0, "Time_End": 324.0, "Text": " like BEA, Web Logic, or ATGs, Dynamo, or, you know, Tomcat, etc."}, {"Time_Start": 324.0, "Time_End": 327.0, "Text": " And then what can users do to protect themselves?"}, {"Time_Start": 327.0, "Time_End": 332.0, "Text": " essentially not much, but we're going to get into that. And what can vendors do?"}, {"Time_Start": 332.0, "Time_End": 337.0, "Text": " And particularly the onus of these types of security vulnerabilities are mostly on the vendors, unfortunately,"}, {"Time_Start": 337.0, "Time_End": 341.0, "Text": " to fix before they actually get shipped to market."}, {"Time_Start": 341.0, "Time_End": 346.0, "Text": " So essentially, let's not spend a lot of time on these basics, but you log into a web application."}, {"Time_Start": 346.0, "Time_End": 351.0, "Text": " Web applications are typically protected by user accounts, varying levels."}, {"Time_Start": 351.0, "Time_End": 356.0, "Text": " You might have a user access, editor access, administrative access."}, {"Time_Start": 356.0, "Time_End": 361.5, "Text": " So you log in, and thereafter, the website, web server, web application knows who you are."}, {"Time_Start": 361.5, "Time_End": 364.0, "Text": " You don't have to actually enter your username and password after each click."}, {"Time_Start": 364.0, "Time_End": 365.0, "Text": " It's pretty straightforward."}, {"Time_Start": 365.0, "Time_End": 369.5, "Text": " So in the traditional sense, if someone wanted to, they had nothing to do on a weekend,"}, {"Time_Start": 369.5, "Time_End": 372.0, "Text": " they could just enter in a bunch of usernames and passwords,"}, {"Time_Start": 372.0, "Time_End": 376.0, "Text": " and that would be a great traditional brute force of a web application."}, {"Time_Start": 376.0, "Time_End": 383.0, "Text": " But what happens after you log in, since HTTP is a stateless protocol,"}, {"Time_Start": 383.0, "Time_End": 385.98, "Text": " developers essentially need a way to work"}, {"Time_Start": 386.0, "Time_End": 390.0, "Text": " recognize that the person who is actually clicking the next click is you."}, {"Time_Start": 390.0, "Time_End": 392.0, "Text": " It would be really bad if you saw other people's banking information."}, {"Time_Start": 392.0, "Time_End": 395.0, "Text": " It would be even worse if they saw your information."}, {"Time_Start": 395.0, "Time_End": 400.0, "Text": " In fact, I just said the same thing, but I said it like this."}, {"Time_Start": 400.0, "Time_End": 403.0, "Text": " Thanks for the two people who got that joke."}, {"Time_Start": 403.0, "Time_End": 406.0, "Text": " So essentially what happens is we generate a unique string,"}, {"Time_Start": 406.0, "Time_End": 408.0, "Text": " which is thereafter called the session ID."}, {"Time_Start": 408.0, "Time_End": 411.0, "Text": " It's also called a token. I've heard people call the nonce."}, {"Time_Start": 411.0, "Time_End": 415.0, "Text": " Essentially, it's just a unique string that you know and the web application knows so that essentially"}, {"Time_Start": 415.0, "Time_End": 419.0, "Text": " essentially you can there have to be recognized as that user."}, {"Time_Start": 419.0, "Time_End": 424.0, "Text": " A decent example is you go into a bar, the bouncer asks you to see your ID in a credit card,"}, {"Time_Start": 424.0, "Time_End": 427.0, "Text": " you authenticate, so to speak."}, {"Time_Start": 427.0, "Time_End": 430.0, "Text": " He stamps on your hand a unique number, that way when you go to the bar,"}, {"Time_Start": 430.0, "Time_End": 434.0, "Text": " you show the bartender your stamp, she looks at the number, references it,"}, {"Time_Start": 434.0, "Time_End": 436.0, "Text": " and she charges you a drink."}, {"Time_Start": 436.0, "Time_End": 440.0, "Text": " Well, that's great, but what if I either see your hand or if I can guess what number you have?"}, {"Time_Start": 440.0, "Time_End": 444.0, "Text": " So essentially these are the two types of blue."}, {"Time_Start": 444.0, "Time_End": 445.0, "Text": " Hello?"}, {"Time_Start": 445.0, "Time_End": 448.0, "Text": " These are the two types of exploitation scenarios."}, {"Time_Start": 448.0, "Time_End": 449.0, "Text": " Is this too loud?"}, {"Time_Start": 449.0, "Time_End": 450.0, "Text": " Too echo-y?"}, {"Time_Start": 450.0, "Time_End": 451.0, "Text": " Okay."}, {"Time_Start": 451.0, "Time_End": 453.0, "Text": " These are the two types of exploitation scenarios."}, {"Time_Start": 453.0, "Time_End": 457.0, "Text": " So session replay is essentially seeing what someone is doing and mimicking them with their"}, {"Time_Start": 457.0, "Time_End": 461.0, "Text": " credentials so that some action they took occurs again."}, {"Time_Start": 461.0, "Time_End": 469.0, "Text": " So, for instance, if I see Michael in the bar ordering a drink, and say he orders a Bloody Mary,"}, {"Time_Start": 469.0, "Time_End": 474.0, "Text": " then what I can do is the typical example, I would walk over, mimic exactly everything he"}, {"Time_Start": 474.0, "Time_End": 479.0, "Text": " did with his credentials and then order him 10 more drinks and then he gets charged."}, {"Time_Start": 479.0, "Time_End": 483.5, "Text": " Additionally, session hijacking would be if I dressed up like him, put the number on my hand"}, {"Time_Start": 483.5, "Time_End": 488.0, "Text": " again, either tied him up in the back or just, I didn't even, don't even need to."}, {"Time_Start": 488.0, "Time_End": 491.0, "Text": " Oh wow, that sounds really bad."}, {"Time_Start": 491.0, "Time_End": 497.0, "Text": " Please don't file a harassment suit."}, {"Time_Start": 497.0, "Time_End": 500.0, "Text": " And then I would actually order drinks for myself charging him."}, {"Time_Start": 500.0, "Time_End": 503.0, "Text": " So that gives you a decent example on what those two types of attacks are."}, {"Time_Start": 503.0, "Time_End": 505.0, "Text": " of attacks are."}, {"Time_Start": 505.0, "Time_End": 512.0, "Text": " So in theory, the username and password of a user gets exchanged for this session ID, which is usually a long, hard to guess, string."}, {"Time_Start": 512.0, "Time_End": 519.0, "Text": " So in theory, you would think that the security levels and standards behind that long string should be the same as your username and password."}, {"Time_Start": 519.0, "Time_End": 532.0, "Text": " Many companies make you go through many hoops of password selections because, you know, it doesn't satisfy this aspect or, you know, too many lowercase characters, or, you know, it's based on a common dictionary word."}, {"Time_Start": 532.0, "Time_End": 533.0, "Text": " Unfortunately, a lot of users."}, {"Time_Start": 533.0, "Time_End": 541.0, "Text": " and developers and vendors don't realize that that session ID is just as important to the authentication and state mechanism of the web application."}, {"Time_Start": 541.0, "Time_End": 546.0, "Text": " So it should, in theory, be just as strong, but unfortunately, it isn't."}, {"Time_Start": 546.0, "Time_End": 556.0, "Text": " So, again, just to further emphasize that that session ID string should be just as secure as a username and password."}, {"Time_Start": 563.0, "Time_End": 576.0, "Text": " Thanks for bearing with us guys. I appreciate it. This is a fantastic turnout for first presentation of the day. I'm sure you guys all stayed in last night, took it easy."}, {"Time_Start": 576.0, "Time_End": 580.0, "Text": " Nice to see you take this stuff seriously. That's great."}, {"Time_Start": 580.0, "Time_End": 587.0, "Text": " We'll just give a quick overview on how session IDs are passed and the way that they're stored and set up."}, {"Time_Start": 587.0, "Time_End": 592.0, "Text": " When we think of session IDs, we often think of cookies. That's not necessarily the only way that they can be passed."}, {"Time_Start": 592.0, "Time_End": 598.0, "Text": " way that they can be passed. A session idea is just a variable, a variable that gets passed between the browser and the server,"}, {"Time_Start": 598.0, "Time_End": 601.0, "Text": " as David mentioned, as a means of maintaining state."}, {"Time_Start": 601.0, "Time_End": 605.0, "Text": " So it can be stored anywhere that variables can be passed back and forth."}, {"Time_Start": 605.0, "Time_End": 613.0, "Text": " That would, besides cookies, also include things such as directly embedded within the URL using the get method,"}, {"Time_Start": 613.0, "Time_End": 617.0, "Text": " or it could be a hidden field within an HTML form."}, {"Time_Start": 617.0, "Time_End": 621.0, "Text": " And we'll show some of that and discuss why or why not that's a good idea."}, {"Time_Start": 621.0, "Time_End": 623.0, "Text": " That's a good idea."}, {"Time_Start": 623.0, "Time_End": 629.0, "Text": " As far as how that session ID, that unique, alphanumeric string is generated,"}, {"Time_Start": 629.0, "Time_End": 635.0, "Text": " that's generally transparent to the individual that's actually coding the web application."}, {"Time_Start": 635.0, "Time_End": 638.0, "Text": " They don't need to specifically come up with an algorithm to generate it."}, {"Time_Start": 638.0, "Time_End": 645.0, "Text": " That's generally done on their behalf by either the web server or the web application server."}, {"Time_Start": 645.0, "Time_End": 650.0, "Text": " Those of you who may be familiar with ASP pages, for example, you know, there's a session object,"}, {"Time_Start": 650.0, "Time_End": 656.0, "Text": " and creating a session variable as simple as calling that object, giving the variable a name,"}, {"Time_Start": 656.0, "Time_End": 658.0, "Text": " and everything is done in the background."}, {"Time_Start": 658.0, "Time_End": 661.0, "Text": " The IIS server does that for you."}, {"Time_Start": 661.0, "Time_End": 663.0, "Text": " So that's, I mean, it's good and bad."}, {"Time_Start": 663.0, "Time_End": 665.0, "Text": " It makes it a lot easier for the developer,"}, {"Time_Start": 665.0, "Time_End": 670.0, "Text": " but at the same time, you're somewhat at the mercy of that server that you're using."}, {"Time_Start": 670.0, "Time_End": 675.0, "Text": " If they're not using a good algorithm to generate that session ID,"}, {"Time_Start": 675.0, "Time_End": 677.0, "Text": " you may or may not be stuck with that."}, {"Time_Start": 677.0, "Time_End": 679.0, "Text": " Yeah, sure."}, {"Time_Start": 679.0, "Time_End": 681.0, "Text": " Yeah, sure."}, {"Time_Start": 681.0, "Time_End": 684.0, "Text": " Just basically two types of cookies."}, {"Time_Start": 684.0, "Time_End": 688.0, "Text": " Persistent cookies and Session are non-persistent cookies."}, {"Time_Start": 688.0, "Time_End": 691.0, "Text": " It basically refers to how long that cookie is stored."}, {"Time_Start": 691.0, "Time_End": 694.0, "Text": " The non-persistent simply stays in main memory."}, {"Time_Start": 694.0, "Time_End": 697.0, "Text": " Persistent is stored on your hard drive."}, {"Time_Start": 697.0, "Time_End": 700.0, "Text": " The persistent cookies are those that you would generally use"}, {"Time_Start": 700.0, "Time_End": 704.0, "Text": " when you have that remember me option on a website."}, {"Time_Start": 704.0, "Time_End": 706.0, "Text": " And again, there's security implications to that,"}, {"Time_Start": 706.0, "Time_End": 708.0, "Text": " because as we'll see, a session ID,"}, {"Time_Start": 708.0, "Time_End": 711.0, "Text": " is effectively a form of authentication."}, {"Time_Start": 711.0, "Time_End": 713.0, "Text": " So that needs to be protected."}, {"Time_Start": 713.0, "Time_End": 716.0, "Text": " We'll get into specifics about that."}, {"Time_Start": 716.0, "Time_End": 724.0, "Text": " This is just a diagram of what a basic cookie looks like,"}, {"Time_Start": 724.0, "Time_End": 727.0, "Text": " just so you understand the structure of it."}, {"Time_Start": 727.0, "Time_End": 731.0, "Text": " I've got those fields numbered 1 through 7, so I'll refer to them that way."}, {"Time_Start": 731.0, "Time_End": 733.0, "Text": " First field, that's the name of the web server"}, {"Time_Start": 733.0, "Time_End": 737.0, "Text": " that actually issued that cookie and has the ability to receive that cookie."}, {"Time_Start": 737.0, "Time_End": 743.0, "Text": " that cookie. Number two is a booing variable. True, false, just determines if other servers"}, {"Time_Start": 743.0, "Time_End": 750.0, "Text": " on that same domain can also receive that cookie. Number three, the path to specific pages"}, {"Time_Start": 750.0, "Time_End": 756.0, "Text": " on the web server that can receive the cookie. So it gives you a greater level of granularity"}, {"Time_Start": 756.0, "Time_End": 760.0, "Text": " as far as where that cookie information will be sent to."}, {"Time_Start": 760.0, "Time_End": 766.98, "Text": " Four, another booing variable. That determines if you need a secure connection and SSL"}, {"Time_Start": 767.0, "Time_End": 772.0, "Text": " before the cookie will be passed and we'll refer back to that a few times because that's an important one."}, {"Time_Start": 772.0, "Time_End": 779.0, "Text": " Number five, that's the expiry. I mentioned persistent versus session or non-persistent cookies."}, {"Time_Start": 779.0, "Time_End": 785.0, "Text": " That date there, that expiry date, is in Unix time, so it's the number of seconds since January,"}, {"Time_Start": 785.0, "Time_End": 796.0, "Text": " 1970, January 1st, 1970. And if you don't give it an expiry date by default, it's going to be a non-persistent cookie and be deleted when you close the web browser."}, {"Time_Start": 796.0, "Time_End": 797.0, "Text": " Six and seven, that's a"}, {"Time_Start": 797.0, "Time_End": 801.76, "Text": " That's the actual payload of that cookie or the data in a name value format."}, {"Time_Start": 801.76, "Time_End": 804.6, "Text": " So in this case, the name of the session idea is Apache."}, {"Time_Start": 804.6, "Time_End": 806.16, "Text": " That's how you would refer to it."}, {"Time_Start": 806.16, "Time_End": 810.24, "Text": " And seven is the session idea itself."}, {"Time_Start": 810.24, "Time_End": 813.44, "Text": " These are just some examples of various sites."}, {"Time_Start": 813.44, "Time_End": 816.34, "Text": " You'll see that they all follow that format."}, {"Time_Start": 816.34, "Time_End": 823.12, "Text": " Star Wars, they have the Wookie Cookie, and the other ones are a little less creative than that."}, {"Time_Start": 823.12, "Time_End": 826.98, "Text": " I mentioned there's various places that you can store that session ID."}, {"Time_Start": 827.0, "Time_End": 832.24, "Text": " discussed cookies. Another one is directly within the URL itself. You'll see at the"}, {"Time_Start": 832.24, "Time_End": 838.5, "Text": " end of each of these URLs, that string is basically a session ID. And obviously that's"}, {"Time_Start": 838.5, "Time_End": 844.34, "Text": " not a very secure way of sending it because if somebody gets a hold of that URL, it effectively"}, {"Time_Start": 844.34, "Time_End": 849.34, "Text": " your authentication is embedded into the URL. Somebody's not going to need to log in with a username"}, {"Time_Start": 849.34, "Time_End": 854.94, "Text": " and password, so not a secure way of doing it. But there are situations where you may want to do that."}, {"Time_Start": 854.94, "Time_End": 856.98, "Text": " You see greeting card sites often use that."}, {"Time_Start": 857.0, "Time_End": 861.24, "Text": " this basically so that a user can go to a unique greeting card."}, {"Time_Start": 861.24, "Time_End": 867.24, "Text": " And we'll walk through those examples as well."}, {"Time_Start": 867.24, "Time_End": 874.24, "Text": " Then the third thing that I mentioned as far as how session IDs can be passed would"}, {"Time_Start": 874.24, "Time_End": 878.76, "Text": " be within hidden fields within an HTML form."}, {"Time_Start": 878.76, "Time_End": 883.5, "Text": " Again, not a very secure way of doing it, but there may be situations where you want to do that."}, {"Time_Start": 883.5, "Time_End": 886.98, "Text": " I think people often mistakenly believe that it's more secure."}, {"Time_Start": 887.0, "Time_End": 892.1, "Text": " secure than it is because an end user can't visibly see it the way they can see a session"}, {"Time_Start": 892.1, "Time_End": 896.6, "Text": " ID embedded within the URL. But as you know, there's nothing to seeing this. You just"}, {"Time_Start": 896.6, "Time_End": 900.9, "Text": " have to view the source code of the web page."}, {"Time_Start": 900.9, "Time_End": 908.8, "Text": " I just want to put this entire talk sort of in perspective in that we're talking about one very"}, {"Time_Start": 908.8, "Time_End": 916.6, "Text": " specific technical vulnerability on web application security. But with anything in security,"}, {"Time_Start": 916.6, "Time_End": 921.3000000000001, "Text": " security, you need to look at the big picture. I mean, you could have a fantastic algorithm."}, {"Time_Start": 921.72, "Time_End": 927.16, "Text": " It gives you a very unique pseudo-random difficult, if not impossible, to guess session ID."}, {"Time_Start": 927.78, "Time_End": 933.66, "Text": " But if other aspects of security that interact with that are very poor, it doesn't do you any good."}, {"Time_Start": 933.66, "Time_End": 939.5, "Text": " I mean, let's say your policy called for that cookie to be a persistent one, so it's stored on the hard drive."}, {"Time_Start": 940.0400000000001, "Time_End": 946.48, "Text": " Who cares if it's a hard to guess algorithm if somebody can grab that cookie and there's poor physical and logical security"}, {"Time_Start": 946.48, "Time_End": 948.34, "Text": " around the server doesn't mean anything."}, {"Time_Start": 948.54, "Time_End": 954.58, "Text": " So just keep in perspective that this is only one aspect of web application security."}, {"Time_Start": 956.98, "Time_End": 959.76, "Text": " We'll walk through an example."}, {"Time_Start": 959.9, "Time_End": 966.8000000000001, "Text": " We won't be able to go to the web page, but on this one, I mentioned that greeting card"}, {"Time_Start": 966.8000000000001, "Time_End": 972.96, "Text": " sites are a good example of a site that embeds a session ID directly within the URL."}, {"Time_Start": 974.08, "Time_End": 975.6800000000001, "Text": " And you've all walked through this."}, {"Time_Start": 975.6800000000001, "Time_End": 977.8000000000001, "Text": " You know how it operates."}, {"Time_Start": 978.24, "Time_End": 979.98, "Text": " You want to send a greeting card to somebody."}, {"Time_Start": 980.1400000000001, "Time_End": 981.34, "Text": " You log into their site."}, {"Time_Start": 981.48, "Time_End": 982.5200000000001, "Text": " You make the greeting card."}, {"Time_Start": 982.7600000000001, "Time_End": 984.82, "Text": " And they receive an email, something like this,"}, {"Time_Start": 984.9000000000001, "Time_End": 987.74, "Text": " that says, click on this URL to see your greeting card."}, {"Time_Start": 988.24, "Time_End": 991.4000000000001, "Text": " And at the end of it, it'll have the session ID right in there."}, {"Time_Start": 992.5600000000001, "Time_End": 997.84, "Text": " Now, when you first look at it, the session idea is that last 16 characters there."}, {"Time_Start": 997.84, "Time_End": 1000.0200000000001, "Text": " It actually, I mean, it looks random."}, {"Time_Start": 1000.1600000000001, "Time_End": 1004.0400000000001, "Text": " If you only look at one, you know, it's just a long, hard-to-guess string."}, {"Time_Start": 1004.1400000000001, "Time_End": 1005.5600000000001, "Text": " So if you want it to brute force that."}, {"Time_Start": 1005.6800000000001, "Time_End": 1010.98, "Text": " You're going to have to go through 10 to the power of 16 combinations, which will take a very long time to do."}, {"Time_Start": 1011.5000000000001, "Time_End": 1020.6600000000001, "Text": " But the only way to see if something is truly random is to look at more than one and see if there's anything in common between those URLs, those session IDs."}, {"Time_Start": 1021.2, "Time_End": 1026.1000000000001, "Text": " So in this case, what we did is just kept regenerating that greeting card over and over again,"}, {"Time_Start": 1026.3, "Time_End": 1030.02, "Text": " just technically literally by hitting the back button and doing it over."}, {"Time_Start": 1031.4, "Time_End": 1035.66, "Text": " And when we started to look at those variables, we noticed that."}, {"Time_Start": 1035.68, "Time_End": 1037.6000000000001, "Text": " that they weren't all that random."}, {"Time_Start": 1037.6000000000001, "Time_End": 1042.76, "Text": " The first three characters, that 83, seems to be some kind of a constant, never changes."}, {"Time_Start": 1043.48, "Time_End": 1049.1200000000001, "Text": " And then the next, I don't know, seven or eight characters, that actually turns out to be the date."}, {"Time_Start": 1049.44, "Time_End": 1053.98, "Text": " And that's an important thing that you want to be careful when you're generating a session ID,"}, {"Time_Start": 1054.22, "Time_End": 1057.78, "Text": " that it's not using something that is known to the user."}, {"Time_Start": 1057.9, "Time_End": 1062.0800000000002, "Text": " And obviously, if the user is creating that greeting card, they know what time they created it."}, {"Time_Start": 1062.42, "Time_End": 1063.8, "Text": " So it's easy for them to figure out."}, {"Time_Start": 1064.0600000000002, "Time_End": 1065.66, "Text": " In this case, we did this on."}, {"Time_Start": 1065.68, "Time_End": 1072.94, "Text": " July 25 to 1221 and you can see that in the 725 1221 and so what we end up"}, {"Time_Start": 1072.94, "Time_End": 1079.24, "Text": " with is actually only four or five digits that are actually truly the random"}, {"Time_Start": 1079.24, "Time_End": 1085.3, "Text": " or so supposedly random portion of that session ID and in this case they're"}, {"Time_Start": 1085.3, "Time_End": 1090.8200000000002, "Text": " actually sequential so they're not even that random at all so we've gone from having to"}, {"Time_Start": 1090.8200000000002, "Time_End": 1094.9, "Text": " brute force something that was 10 to the power of 16 down to something that's about"}, {"Time_Start": 1094.9, "Time_End": 1105.64, "Text": " 10,000, 100,000 digits which is much more reasonable we'll we'll save the"}, {"Time_Start": 1105.64, "Time_End": 1109.3000000000002, "Text": " demo on this for a second because we'll either if we have internet access we'll try it"}, {"Time_Start": 1109.3000000000002, "Time_End": 1114.3400000000001, "Text": " that way if not we'll switch over to the other computer but basically you know if you"}, {"Time_Start": 1114.3400000000001, "Time_End": 1118.3600000000001, "Text": " want to brute force that you got 10,000 combinations one way is obviously get a web"}, {"Time_Start": 1118.3600000000001, "Time_End": 1124.16, "Text": " browser start typing it in manually and if you got nothing better to do that might"}, {"Time_Start": 1124.16, "Time_End": 1124.88, "Text": " be a good way to do it"}, {"Time_Start": 1124.9, "Time_End": 1129.76, "Text": " but easier way is to automate that you might want to write a pearl script or"}, {"Time_Start": 1129.76, "Time_End": 1135.88, "Text": " something in this case we actually wrote a tool that will allow you to brute force session"}, {"Time_Start": 1135.88, "Time_End": 1142.5400000000002, "Text": " IDs in various scenarios in cookies within URLs that's the tool right there we'll"}, {"Time_Start": 1142.5400000000002, "Time_End": 1147.76, "Text": " demo it on the other box so but actually David you want to just talk about the sections here"}, {"Time_Start": 1147.76, "Time_End": 1154.5800000000002, "Text": " so essentially we were looking at a lot of web applications and our audits"}, {"Time_Start": 1154.9, "Time_End": 1156.22, "Text": " in past lives."}, {"Time_Start": 1157.42, "Time_End": 1162.68, "Text": " Really the only decent way to tell if a session idea is predictable is by looking at it."}, {"Time_Start": 1162.7800000000002, "Time_End": 1165.9, "Text": " It'd be nice if there were some neat AI program or neural net."}, {"Time_Start": 1165.98, "Time_End": 1169.96, "Text": " You could just run it through and it would have a yes or no button and yes, predictable, no,"}, {"Time_Start": 1170.02, "Time_End": 1170.6200000000001, "Text": " non-predictable."}, {"Time_Start": 1171.22, "Time_End": 1178.7, "Text": " But unfortunately, the easiest way to figure it out is just by looking at a bunch of session IDs generated in sequence very close to one another."}, {"Time_Start": 1179.2800000000002, "Time_End": 1183.3000000000002, "Text": " So essentially this is a tool that has three aspects to it, three mini tools."}, {"Time_Start": 1183.3000000000002, "Time_End": 1184.5600000000002, "Text": " I'm not sure if you can see it."}, {"Time_Start": 1184.9, "Time_End": 1186.8200000000002, "Text": " This should be on the DefCon CD."}, {"Time_Start": 1187.0800000000002, "Time_End": 1188.0400000000002, "Text": " It's an open source tool."}, {"Time_Start": 1188.18, "Time_End": 1192.6000000000001, "Text": " You can look at the spaghetti visual basic code that I put together."}, {"Time_Start": 1193.3600000000001, "Time_End": 1199.9, "Text": " Essentially, the top part allows you to sample those session IDs that are generated just from the website."}, {"Time_Start": 1200.3200000000002, "Time_End": 1201.14, "Text": " This is version one."}, {"Time_Start": 1201.68, "Time_End": 1206.0, "Text": " Version two would be nice if you could actually generate the session IDs after you log into that website."}, {"Time_Start": 1206.22, "Time_End": 1210.46, "Text": " So you'd have to actually include the post information in that as well with the credentials."}, {"Time_Start": 1211.18, "Time_End": 1213.98, "Text": " So essentially you can just, if we have time later,"}, {"Time_Start": 1214.9, "Time_End": 1219.18, "Text": " if we get network connection, I'll show you, using redhat.com as the example."}, {"Time_Start": 1219.3000000000002, "Time_End": 1225.64, "Text": " They actually use the IP address, your IP address to append to, you know, some bit of entropy,"}, {"Time_Start": 1225.94, "Time_End": 1226.88, "Text": " some random numbers."}, {"Time_Start": 1227.4, "Time_End": 1230.5600000000002, "Text": " They don't use that necessarily for authentication, but it's just a decent example."}, {"Time_Start": 1231.1000000000001, "Time_End": 1236.0, "Text": " This middle part of the tool is a basic authentication brute forcing, which really isn't"}, {"Time_Start": 1236.0, "Time_End": 1241.0, "Text": " within the scope of our presentation, but we had all the same hooks in there to do a lot of this anyway."}, {"Time_Start": 1241.0, "Time_End": 1242.8000000000002, "Text": " So it might as well, it was kind of an added bonus."}, {"Time_Start": 1243.72, "Time_End": 1244.88, "Text": " The last part is where the real real thing."}, {"Time_Start": 1244.9, "Time_End": 1248.46, "Text": " need of this brute forcing is, and I'm just going to put these two windows"}, {"Time_Start": 1248.46, "Time_End": 1251.5, "Text": " sort of but side by side, almost as if we're running it in real time."}, {"Time_Start": 1252.1000000000001, "Time_End": 1256.1200000000001, "Text": " If you switch your eyes really quickly, you may actually see some movement, but I'm not sure"}, {"Time_Start": 1256.1200000000001, "Time_End": 1258.18, "Text": " if that's from what you were doing last night."}, {"Time_Start": 1259.14, "Time_End": 1265.8000000000002, "Text": " Essentially, what you can see is we pasted a really long URL into the URL field."}, {"Time_Start": 1266.88, "Time_End": 1271.7800000000002, "Text": " The scenario is essentially, if I know that Michael sent his girlfriend a really scintillating"}, {"Time_Start": 1271.7800000000002, "Time_End": 1274.7800000000002, "Text": " greeting card, and I can figure out, you know, when the time was,"}, {"Time_Start": 1274.9, "Time_End": 1276.9, "Text": " At least I have a range to work with."}, {"Time_Start": 1276.9, "Time_End": 1278.9, "Text": " What is that is that?"}, {"Time_Start": 1278.9, "Time_End": 1279.9, "Text": " Like, no."}, {"Time_Start": 1279.9, "Time_End": 1280.9, "Text": " Oh, sure."}, {"Time_Start": 1280.9, "Time_End": 1283.9, "Text": " What we can do is we'll just, we'll show you another example."}, {"Time_Start": 1283.9, "Time_End": 1285.9, "Text": " We have a standalone box with a web server."}, {"Time_Start": 1285.9, "Time_End": 1288.9, "Text": " At least you can see some of the cookie generation."}, {"Time_Start": 1288.9, "Time_End": 1297.9, "Text": " But then you paste that URL and use a combination of regular expressions to tell the tool which characters you want to grind through."}, {"Time_Start": 1297.9, "Time_End": 1299.9, "Text": " So I'll just give you a brief demo on this computer."}, {"Time_Start": 1304.9, "Time_End": 1318.4, "Text": " So this, we'll just run it locally off of my machine."}, {"Time_Start": 1318.4, "Time_End": 1321.4, "Text": " This, I apologize, I'm totally not a redneck."}, {"Time_Start": 1321.4, "Time_End": 1323.4, "Text": " This was an application."}, {"Time_Start": 1323.4, "Time_End": 1327.9, "Text": " From a school project, and this morning as we were in the hotel room,"}, {"Time_Start": 1327.9, "Time_End": 1329.4, "Text": " we're like, we need something that makes session IDs."}, {"Time_Start": 1329.4, "Time_End": 1330.9, "Text": " I was like, cool, I got it."}, {"Time_Start": 1330.9, "Time_End": 1332.4, "Text": " It's left over from school."}, {"Time_Start": 1332.4, "Time_End": 1334.4, "Text": " But it just..."}, {"Time_Start": 1334.4, "Time_End": 1335.4, "Text": " Just ignore it."}, {"Time_Start": 1335.4, "Time_End": 1336.4, "Text": " All right."}, {"Time_Start": 1336.4, "Time_End": 1338.4, "Text": " Pretend it's like a Linux site or something."}, {"Time_Start": 1338.4, "Time_End": 1343.4, "Text": " Michael, there's a fancy NASCAR."}, {"Time_Start": 1343.4, "Time_End": 1344.4, "Text": " Is that an Oxymor?"}, {"Time_Start": 1344.4, "Time_End": 1349.4, "Text": " Oh, sorry, wrong tool."}, {"Time_Start": 1349.4, "Time_End": 1354.4, "Text": " So we have IIS running on this sort of standalone, so stop in your laptops."}, {"Time_Start": 1354.4, "Time_End": 1358.4, "Text": " What we're doing is we're just, you can just walk through the window?"}, {"Time_Start": 1358.4, "Time_End": 1359.4, "Text": " Yeah, sure."}, {"Time_Start": 1359.4, "Time_End": 1363.4, "Text": " Just, so all we were doing is we know that the website uses session ID."}, {"Time_Start": 1363.4, "Time_End": 1365.4, "Text": " uses session IDs."}, {"Time_Start": 1365.4, "Time_End": 1367.4, "Text": " And so we want to see that randomness."}, {"Time_Start": 1367.4, "Time_End": 1369.4, "Text": " So we want to generate a succession of them."}, {"Time_Start": 1369.4, "Time_End": 1374.4, "Text": " So with that first part, we're able to just put the URL directly into there,"}, {"Time_Start": 1374.4, "Time_End": 1377.4, "Text": " say we want how many cookies, in this case 10,"}, {"Time_Start": 1377.4, "Time_End": 1380.4, "Text": " and just get the cookies, and then it's spit out in the bottom."}, {"Time_Start": 1380.4, "Time_End": 1382.4, "Text": " And in this case, they are fairly random."}, {"Time_Start": 1382.4, "Time_End": 1384.4, "Text": " I asked there's a reasonable job."}, {"Time_Start": 1384.4, "Time_End": 1389.4, "Text": " But that's the first step of allowing you to look at it and then decide,"}, {"Time_Start": 1389.4, "Time_End": 1392.4, "Text": " is there some non-randomness that I can brief for it?"}, {"Time_Start": 1392.4, "Time_End": 1393.4, "Text": " Actually, why don't you?"}, {"Time_Start": 1393.4, "Time_End": 1398.4, "Text": " walk through the regular expression, please?"}, {"Time_Start": 1398.4, "Time_End": 1403.4, "Text": " Sure."}, {"Time_Start": 1403.4, "Time_End": 1411.4, "Text": " So the, we'll see the URL and cookie field."}, {"Time_Start": 1411.4, "Time_End": 1413.4, "Text": " You can actually boot for us either."}, {"Time_Start": 1413.4, "Time_End": 1415.4, "Text": " If you wanted to just brute first the URL,"}, {"Time_Start": 1415.4, "Time_End": 1417.4, "Text": " we put the regular expressions in there."}, {"Time_Start": 1417.4, "Time_End": 1418.4, "Text": " If you want the URL constant,"}, {"Time_Start": 1418.4, "Time_End": 1419.4, "Text": " you paste the cookie in."}, {"Time_Start": 1419.4, "Time_End": 1422.4, "Text": " And essentially, it takes care of all the formatting for you."}, {"Time_Start": 1422.4, "Time_End": 1423.4, "Text": " You just have to have to have to have."}, {"Time_Start": 1423.4, "Time_End": 1427.4, "Text": " have a basic variable equals value format here."}, {"Time_Start": 1427.4, "Time_End": 1428.4, "Text": " So we have..."}, {"Time_Start": 1428.4, "Time_End": 1440.4, "Text": " ASP session ID, blah, blah, blah, blah,"}, {"Time_Start": 1440.4, "Time_End": 1442.4, "Text": " equals, and then this really long stream."}, {"Time_Start": 1442.4, "Time_End": 1445.4, "Text": " So let's try and just proof force the last digit."}, {"Time_Start": 1445.4, "Time_End": 1448.4, "Text": " You put the starting digit or the starting character in there,"}, {"Time_Start": 1448.4, "Time_End": 1449.4, "Text": " which is going to be A."}, {"Time_Start": 1449.4, "Time_End": 1450.4, "Text": " I don't know if you..."}, {"Time_Start": 1450.4, "Time_End": 1451.4, "Text": " Can you see this on the screen?"}, {"Time_Start": 1451.4, "Time_End": 1452.4, "Text": " Okay, so I'll just walk you through it."}, {"Time_Start": 1452.4, "Time_End": 1453.4, "Text": " You put it."}, {"Time_Start": 1453.4, "Time_End": 1459.4, "Text": " the character there and essentially if you just click on the tab, you can test it out when you try it out on the CD."}, {"Time_Start": 1459.4, "Time_End": 1463.4, "Text": " Just click the info tab, it's kind of obscure, but once you actually look at it, you'll understand"}, {"Time_Start": 1463.4, "Time_End": 1464.4, "Text": " what the ranges mean."}, {"Time_Start": 1464.4, "Time_End": 1470.4, "Text": " You can do 0 through 9, little A through little Z, Big A through Big Z, and then the combination of those together."}, {"Time_Start": 1470.4, "Time_End": 1474.4, "Text": " So essentially what you see here is us grinding through each one."}, {"Time_Start": 1474.4, "Time_End": 1476.4, "Text": " You'll see two radio buttons at the bottom."}, {"Time_Start": 1476.4, "Time_End": 1483.4, "Text": " The first one is just, I'm going to click on it here, just look for a non-44 header, which means you're grinding"}, {"Time_Start": 1483.4, "Time_End": 1489.4, "Text": " a URL in addition with a possible cookie in there, and you're getting a page back."}, {"Time_Start": 1489.4, "Time_End": 1496.9, "Text": " Now, assuming that the web server hasn't customized their error message, you may get a 200 success."}, {"Time_Start": 1496.9, "Time_End": 1500.4, "Text": " This is the web page, congratulations you've authenticated."}, {"Time_Start": 1500.4, "Time_End": 1505.4, "Text": " Some websites have custom error messages like, you know, these aren't the web pages you're looking for,"}, {"Time_Start": 1505.4, "Time_End": 1508.4, "Text": " go away, nosy, etc."}, {"Time_Start": 1508.4, "Time_End": 1513.38, "Text": " So what you can do is actually click on this radio button and tell it what a successful web, web,"}, {"Time_Start": 1513.4, "Time_End": 1520.4, "Text": " brute force would look like, what string in it would have, such as welcome to your account or, you know, et cetera."}, {"Time_Start": 1520.4, "Time_End": 1522.4, "Text": " So that's the tool in a nutshell."}, {"Time_Start": 1522.4, "Time_End": 1524.4, "Text": " Why don't you do mini-browser?"}, {"Time_Start": 1524.4, "Time_End": 1525.4, "Text": " Yeah."}, {"Time_Start": 1525.4, "Time_End": 1530.4, "Text": " And this is just another tool, mini browser that we like to use."}, {"Time_Start": 1530.4, "Time_End": 1537.4, "Text": " Essentially, it's just a browser with different fields that you can kind of watch the transaction, the web transaction take place."}, {"Time_Start": 1537.4, "Time_End": 1541.4, "Text": " So this is Michael's NASCAR login."}, {"Time_Start": 1541.4, "Time_End": 1542.4, "Text": " If you look at the log, you'll see the code."}, {"Time_Start": 1542.4, "Time_End": 1545.4, "Text": " you'll see the cookie actually getting passed back and forth."}, {"Time_Start": 1545.4, "Time_End": 1550.4, "Text": " If you actually click on cookies, you can see them all listed out pretty nicely."}, {"Time_Start": 1550.4, "Time_End": 1553.4, "Text": " We're going to show you another example of this later, so."}, {"Time_Start": 1553.4, "Time_End": 1554.4, "Text": " So..."}, {"Time_Start": 1554.4, "Time_End": 1567.4, "Text": " I'm sorry?"}, {"Time_Start": 1567.4, "Time_End": 1569.4, "Text": " What is the food force?"}, {"Time_Start": 1569.4, "Time_End": 1571.4, "Text": " It's version the Visual Basic."}, {"Time_Start": 1571.4, "Time_End": 1576.9, "Text": " The Visual Basic, it's open source, so you can actually see the code for yourself and improve it."}, {"Time_Start": 1576.9, "Time_End": 1579.9, "Text": " Send it back to me, and I'll take credit for it."}, {"Time_Start": 1579.9, "Time_End": 1580.9, "Text": " I'm just joking."}, {"Time_Start": 1580.9, "Time_End": 1585.9, "Text": " If you want to actually help out with it, I'd be glad to post a new version with any improvements."}, {"Time_Start": 1585.9, "Time_End": 1587.9, "Text": " And there are some improvements I have in mind, so..."}, {"Time_Start": 1587.9, "Time_End": 1592.9, "Text": " Let's actually switch sides again."}, {"Time_Start": 1597.9, "Time_End": 1599.9, "Text": " So, okay, why is this bad?"}, {"Time_Start": 1599.9, "Time_End": 1600.9, "Text": " Obviously it's bad because you can actually actually..."}, {"Time_Start": 1600.9, "Time_End": 1604.9, "Text": " you can actually get into a user's account without their username and password."}, {"Time_Start": 1604.9, "Time_End": 1606.9, "Text": " It's really easy to exploit, as you saw."}, {"Time_Start": 1606.9, "Time_End": 1607.9, "Text": " Now you all have the tool."}, {"Time_Start": 1607.9, "Time_End": 1609.9, "Text": " It's even easier to exploit."}, {"Time_Start": 1609.9, "Time_End": 1615.9, "Text": " Unlike typical login scenarios, like an operating system or a lot of other web applications,"}, {"Time_Start": 1615.9, "Time_End": 1619.9, "Text": " if you have five failed logins sometimes, that account is locked out."}, {"Time_Start": 1619.9, "Time_End": 1623.9, "Text": " But brute forcing session IDs, it's really hard to detect a failed."}, {"Time_Start": 1623.9, "Time_End": 1628.9, "Text": " There's no necessarily a failed login scenario in group forcing a session ID,"}, {"Time_Start": 1628.9, "Time_End": 1630.9, "Text": " or getting a bad set."}, {"Time_Start": 1630.9, "Time_End": 1636.9, "Text": " Additionally, there aren't a lot of intrusion detection systems that detect these types of attacks."}, {"Time_Start": 1636.9, "Time_End": 1645.9, "Text": " I would say none, but I have a feeling that some are actually coming out that would start to detect these types of exploits."}, {"Time_Start": 1645.9, "Time_End": 1650.9, "Text": " Additionally, really the only way you'll know that someone is trying to do this is by looking at your log data,"}, {"Time_Start": 1650.9, "Time_End": 1654.9, "Text": " which I don't think a lot of us do. Essentially, you would either see a lot of error messages,"}, {"Time_Start": 1654.9, "Time_End": 1659.9, "Text": " or you'd see a lot of error messages that followed by the successful login access."}, {"Time_Start": 1659.9, "Time_End": 1662.9, "Text": " log in acts on your access, your successful access log."}, {"Time_Start": 1662.9, "Time_End": 1666.9, "Text": " I'm just going to mention that this last point."}, {"Time_Start": 1666.9, "Time_End": 1671.9, "Text": " There's a myth that I'm sure a lot of you run up against that SSL secures all,"}, {"Time_Start": 1671.9, "Time_End": 1673.9, "Text": " and obviously it doesn't."}, {"Time_Start": 1673.9, "Time_End": 1678.9, "Text": " What I wanted to say is SSL server side doesn't really do much to protect you against these types of attacks."}, {"Time_Start": 1678.9, "Time_End": 1684.9, "Text": " When I say server side, which really describes most of the SSL certificate scenarios out there,"}, {"Time_Start": 1684.9, "Time_End": 1687.9, "Text": " the web server has a certificate, the client, doesn't."}, {"Time_Start": 1687.9, "Time_End": 1688.9, "Text": " And another P."}, {"Time_Start": 1688.9, "Time_End": 1693.9, "Text": " if you wanted to actually issue certificates to your clients, authenticate them in that way as well,"}, {"Time_Start": 1693.9, "Time_End": 1699.9, "Text": " that might actually protect against a lot of these attacks because it would redirect you to an authentication screen."}, {"Time_Start": 1699.9, "Time_End": 1702.9, "Text": " Unfortunately, this really isn't feasible in a business sense."}, {"Time_Start": 1702.9, "Time_End": 1707.9, "Text": " If you're in a very small environment, you could do this or an intranet."}, {"Time_Start": 1707.9, "Time_End": 1713.9, "Text": " I just wanted to point out kind of a news hit that occurred for this type of attack."}, {"Time_Start": 1713.9, "Time_End": 1717.9, "Text": " Essentially, it's interesting that, you know, a few years ago, web application security was a dot on."}, {"Time_Start": 1717.9, "Time_End": 1723.9, "Text": " security was a dot on the radar. Now you see, you know, exploit scripting hole exposes hotmail, and you see this on CNN.com."}, {"Time_Start": 1723.9, "Time_End": 1730.9, "Text": " So it's good in a way because users and the internet community are becoming aware that these types of attacks are bad."}, {"Time_Start": 1730.9, "Time_End": 1735.9, "Text": " Unfortunately, this was based on a bug track posting by, I think Mark Slimco, and he said,"}, {"Time_Start": 1735.9, "Time_End": 1743.9, "Text": " hey, I'm a Verizon wireless customer, and when I logged in, I got this URL, and I'm not sure if you can see it on the screen."}, {"Time_Start": 1743.9, "Time_End": 1746.9, "Text": " There's a portion in red, and that's an ID."}, {"Time_Start": 1746.9, "Time_End": 1748.9, "Text": " He got redirected to this URL."}, {"Time_Start": 1748.9, "Time_End": 1752.9, "Text": " In fact, all Verizon wireless customers were redirected to a URL similar to this."}, {"Time_Start": 1752.9, "Time_End": 1754.9, "Text": " The only difference was that number was different."}, {"Time_Start": 1754.9, "Time_End": 1758.9, "Text": " Well, it seems that by incrementing or decrementing that number,"}, {"Time_Start": 1758.9, "Time_End": 1762.9, "Text": " and you can see other users' information, billing information,"}, {"Time_Start": 1762.9, "Time_End": 1764.9, "Text": " credit card information, oops."}, {"Time_Start": 1764.9, "Time_End": 1770.9, "Text": " So this is, it's good in a way because I'm sure Verizon fixed it very quickly"}, {"Time_Start": 1770.9, "Time_End": 1775.9, "Text": " once this news item came out, it's bad because who knows how many other customers were affected."}, {"Time_Start": 1775.9, "Time_End": 1776.9, "Text": " I'm not sure if you can do."}, {"Time_Start": 1776.9, "Time_End": 1777.9, "Text": " can see the screen."}, {"Time_Start": 1777.9, "Time_End": 1778.9, "Text": " SecurityPimps.com."}, {"Time_Start": 1778.9, "Time_End": 1781.9, "Text": " It's actual site."}, {"Time_Start": 1781.9, "Time_End": 1782.9, "Text": " It's actually my site."}, {"Time_Start": 1782.9, "Time_End": 1788.14, "Text": " Not really doing much with it except just playing around with Flash and maybe forming a hacker"}, {"Time_Start": 1788.14, "Time_End": 1789.14, "Text": " group someday."}, {"Time_Start": 1789.14, "Time_End": 1793.9, "Text": " I'm not sure we'd have to be based outside of Nevada just because of the name or outside of Las Vegas in"}, {"Time_Start": 1793.9, "Time_End": 1794.9, "Text": " Nevada."}, {"Time_Start": 1794.9, "Time_End": 1796.4, "Text": " That joke will bind."}, {"Time_Start": 1796.4, "Time_End": 1800.9, "Text": " So essentially, I host this at register.com."}, {"Time_Start": 1800.9, "Time_End": 1806.88, "Text": " Register.com lets you as a registrant, they provide you a web access."}, {"Time_Start": 1806.9, "Time_End": 1810.6000000000001, "Text": " portal, web application that you can manage your domain in."}, {"Time_Start": 1810.6000000000001, "Time_End": 1814.9, "Text": " It's the domain manager, so you log in, change any DNS settings."}, {"Time_Start": 1814.9, "Time_End": 1818.9, "Text": " I was trying to change the setting one day when I forgot my password."}, {"Time_Start": 1818.9, "Time_End": 1823.9, "Text": " So essentially what you do in the forgotten password scheme is you put in the domain in"}, {"Time_Start": 1823.9, "Time_End": 1826.9, "Text": " and an email gets sent to the administrative contact of that domain."}, {"Time_Start": 1826.9, "Time_End": 1829.9, "Text": " No matter who you are, you can cause this to occur."}, {"Time_Start": 1829.9, "Time_End": 1832.9, "Text": " You can cause the forgotten password to occur."}, {"Time_Start": 1832.9, "Time_End": 1835.9, "Text": " So the email got sent to Pimp Daddy at Security PimpStat."}, {"Time_Start": 1835.9, "Time_End": 1837.9, "Text": " Pimps.com, that's me."}, {"Time_Start": 1837.9, "Time_End": 1840.9, "Text": " I'm not going to make a joke about it since the first one bombed."}, {"Time_Start": 1840.9, "Time_End": 1843.9, "Text": " And we're running long time."}, {"Time_Start": 1843.9, "Time_End": 1846.9, "Text": " So essentially you get this long URL."}, {"Time_Start": 1846.9, "Time_End": 1849.9, "Text": " And if in a three-day time period someone visits that URL,"}, {"Time_Start": 1849.9, "Time_End": 1853.9, "Text": " you're not even asked for your old password, you can change the password."}, {"Time_Start": 1853.9, "Time_End": 1854.9, "Text": " So think of it this way."}, {"Time_Start": 1854.9, "Time_End": 1858.9, "Text": " If I know your domain, or if I know what domain is hosted on register.com,"}, {"Time_Start": 1858.9, "Time_End": 1863.9, "Text": " I can plug in the domain in and figure out that,"}, {"Time_Start": 1863.9, "Time_End": 1865.9, "Text": " well, let me go back, by pressing back and"}, {"Time_Start": 1865.9, "Time_End": 1868.9, "Text": " a few times I got these URLs in my email as well."}, {"Time_Start": 1868.9, "Time_End": 1874.9, "Text": " So obviously those session IDs after, can you see the numbers?"}, {"Time_Start": 1874.9, "Time_End": 1883.9, "Text": " Sure, if you can't, essentially we whittled down it was a 12-digit session ID to what was now five."}, {"Time_Start": 1883.9, "Time_End": 1890.9, "Text": " So if you had a domain on register.com and you know someone else that you could submit them at the same time,"}, {"Time_Start": 1890.9, "Time_End": 1894.9, "Text": " essentially figure out what that was in proximity and probably shave that time off so that I think"}, {"Time_Start": 1894.9, "Time_End": 1896.9, "Text": " So that I think I figured it out."}, {"Time_Start": 1896.9, "Time_End": 1900.9, "Text": " If you wanted to submit it when someone goes home from work around six"}, {"Time_Start": 1900.9, "Time_End": 1905.9, "Text": " and try and brute force it when someone actually shows up again around eight or nine,"}, {"Time_Start": 1905.9, "Time_End": 1910.9, "Text": " you could probably do that 50% of the time if you were doing maybe one request a second."}, {"Time_Start": 1910.9, "Time_End": 1916.9, "Text": " So we won't go through these examples."}, {"Time_Start": 1916.9, "Time_End": 1920.9, "Text": " One is D-film and one is Sendomatic."}, {"Time_Start": 1920.9, "Time_End": 1923.9, "Text": " I'll just explain really quick what they were."}, {"Time_Start": 1923.9, "Time_End": 1924.9, "Text": " That's a situation."}, {"Time_Start": 1924.9, "Time_End": 1927.9, "Text": " where a session ID was passed directly within the URL,"}, {"Time_Start": 1927.9, "Time_End": 1929.4, "Text": " and there was no randomness."}, {"Time_Start": 1929.4, "Time_End": 1931.9, "Text": " They were just purely incrementing that number."}, {"Time_Start": 1931.9, "Time_End": 1933.9, "Text": " You know, D-film is where you make your own little"}, {"Time_Start": 1933.9, "Time_End": 1936.4, "Text": " personal flash movie and send it to somebody."}, {"Time_Start": 1936.4, "Time_End": 1940.4, "Text": " And they weren't at all using that session ID for security."}, {"Time_Start": 1940.4, "Time_End": 1946.9, "Text": " They were just using it to allow you to see a unique video or whatever."}, {"Time_Start": 1946.9, "Time_End": 1950.9, "Text": " And just the important thing to note there is that they may not have been"}, {"Time_Start": 1950.9, "Time_End": 1953.9, "Text": " planning security in there because you can just increment that session ID,"}, {"Time_Start": 1953.9, "Time_End": 1954.9, "Text": " you'll see some."}, {"Time_Start": 1954.9, "Time_End": 1960.9, "Text": " somebody else's video or Sendomatic is one of those sites where you set up a party and"}, {"Time_Start": 1960.9, "Time_End": 1961.9, "Text": " you send invites to people."}, {"Time_Start": 1961.9, "Time_End": 1965.9, "Text": " If you increment it, you can see other people's parties and invite your friends to their party"}, {"Time_Start": 1965.9, "Time_End": 1967.9, "Text": " and all that kind of stuff."}, {"Time_Start": 1967.9, "Time_End": 1973.9, "Text": " And even though they may not have used it, they may have not planned security in there,"}, {"Time_Start": 1973.9, "Time_End": 1975.9, "Text": " their users may not have that same perception."}, {"Time_Start": 1975.9, "Time_End": 1981.9, "Text": " They may think that they are the only people who can see their greetings and their invitations."}, {"Time_Start": 1981.9, "Time_End": 1984.9, "Text": " So never designed something to your"}, {"Time_Start": 1984.9, "Time_End": 1989.9, "Text": " security specifications, you have to design it to your end user specifications."}, {"Time_Start": 1989.9, "Time_End": 1994.9, "Text": " If they think there's security in there, find out there's not, that's not a good way to keep your clients around."}, {"Time_Start": 1994.9, "Time_End": 1998.9, "Text": " We have about 10 minutes."}, {"Time_Start": 1998.9, "Time_End": 2001.9, "Text": " We're probably going to run five minutes late just to let you know."}, {"Time_Start": 2001.9, "Time_End": 2006.9, "Text": " I'm a big believer in doing things on time, especially having brief presentations"}, {"Time_Start": 2006.9, "Time_End": 2009.9, "Text": " and agreeing to end when you're going to end, but we started a little late."}, {"Time_Start": 2009.9, "Time_End": 2011.9, "Text": " So just to let you know."}, {"Time_Start": 2011.9, "Time_End": 2013.9, "Text": " FreeServers.com is where I host."}, {"Time_Start": 2013.9, "Time_End": 2015.9, "Text": "com is where I host security pimps."}, {"Time_Start": 2015.9, "Time_End": 2017.9, "Text": " Again, same sort of scenario."}, {"Time_Start": 2017.9, "Time_End": 2021.9, "Text": " You have a web application, you log in, and in this case, I actually can change the content."}, {"Time_Start": 2021.9, "Time_End": 2024.9, "Text": " Free servers is a free web hosting service."}, {"Time_Start": 2024.9, "Time_End": 2027.9, "Text": " Essentially you can pick from a bunch of domains."}, {"Time_Start": 2027.9, "Time_End": 2030.9, "Text": " This one I just pick testing, one two, three,"}, {"Time_Start": 2030.9, "Time_End": 2033.9, "Text": " that ITGO.com."}, {"Time_Start": 2033.9, "Time_End": 2038.9, "Text": " So essentially you log in, user name and password, you go into your login screen,"}, {"Time_Start": 2038.9, "Time_End": 2042.9, "Text": " you can change content, you can upload content, delete content."}, {"Time_Start": 2042.9, "Time_End": 2048.9, "Text": " So using mini browser, just as an example, we can't do this online, but we log in,"}, {"Time_Start": 2048.9, "Time_End": 2053.9, "Text": " you can see that our cookie is actually go to the next screen where you can actually see it."}, {"Time_Start": 2053.9, "Time_End": 2055.9, "Text": " All right, so it looks like a fairly random cookie."}, {"Time_Start": 2055.9, "Time_End": 2059.9, "Text": " But every time I logged in, I actually got the same cookie."}, {"Time_Start": 2059.9, "Time_End": 2064.9, "Text": " So, hmm, a lot of developers make the mistake of obfuscating,"}, {"Time_Start": 2064.9, "Time_End": 2067.9, "Text": " offuse skating, say that in the morning."}, {"Time_Start": 2067.9, "Time_End": 2071.9, "Text": " The session ID with just a very basic encoding mechanism like base 64 or hex."}, {"Time_Start": 2071.9, "Time_End": 2075.9, "Text": " or hex, and they think, ah, ha ha, no one will ever figure that out."}, {"Time_Start": 2075.9, "Time_End": 2079.9, "Text": " Well, just for kicks, I put it through a base 64 decoder,"}, {"Time_Start": 2079.9, "Time_End": 2082.9, "Text": " and security stats actually has a decent one."}, {"Time_Start": 2082.9, "Time_End": 2087.9, "Text": " If we were to go to this link and paste it, you would see that that string decoded,"}, {"Time_Start": 2087.9, "Time_End": 2092.9, "Text": " base 64 decoded, is my domain name, colon, and then my password."}, {"Time_Start": 2092.9, "Time_End": 2095.9, "Text": " Just to let you know everyone who's firing up your browser,"}, {"Time_Start": 2095.9, "Time_End": 2098.9, "Text": " change the password already, so don't try and log in."}, {"Time_Start": 2098.9, "Time_End": 2100.9, "Text": " So essentially, this is a case where I don't know."}, {"Time_Start": 2100.9, "Time_End": 2105.9, "Text": " This is a case where I don't necessarily need to brute force it in the traditional sense, character by character,"}, {"Time_Start": 2105.9, "Time_End": 2107.9, "Text": " but I can use a dictionary attack."}, {"Time_Start": 2107.9, "Time_End": 2112.9, "Text": " So what I did, wrote a parole script, which is included in a paper on your CD."}, {"Time_Start": 2112.9, "Time_End": 2114.9, "Text": " All these parole scripts are included."}, {"Time_Start": 2114.9, "Time_End": 2119.9, "Text": " Wrote a paper, it basically runs through dictionary attack, takes the password,"}, {"Time_Start": 2119.9, "Time_End": 2124.9, "Text": " pends it to the domain, runs base 64 on it, and tries to load a browser,"}, {"Time_Start": 2124.9, "Time_End": 2127.9, "Text": " and essentially sees if we get successful log in."}, {"Time_Start": 2127.9, "Time_End": 2129.9, "Text": " So, yeah, just go ahead."}, {"Time_Start": 2129.9, "Time_End": 2133.9, "Text": " Or if you really have nothing to do on the weekend,"}, {"Time_Start": 2133.9, "Time_End": 2136.9, "Text": " you can definitely brute force every single character,"}, {"Time_Start": 2136.9, "Time_End": 2138.9, "Text": " but why bother?"}, {"Time_Start": 2141.9, "Time_End": 2145.9, "Text": " And just to mention, some sites actually use the URL and the cookie"}, {"Time_Start": 2145.9, "Time_End": 2147.9, "Text": " to store the session ID."}, {"Time_Start": 2147.9, "Time_End": 2150.9, "Text": " We showed Amazon earlier as one that actually stores the URL"}, {"Time_Start": 2150.9, "Time_End": 2152.9, "Text": " and before you raise your hand after"}, {"Time_Start": 2152.9, "Time_End": 2154.9, "Text": " and say, well, they use the cookie as well, it's true,"}, {"Time_Start": 2154.9, "Time_End": 2158.9, "Text": " but they actually use a lot of those same information in the URL."}, {"Time_Start": 2158.9, "Time_End": 2159.9, "Text": " Let's just store it in the cookie."}, {"Time_Start": 2159.9, "Time_End": 2163.9, "Text": " So while you think you're really clever by using a cookie to store this information,"}, {"Time_Start": 2163.9, "Time_End": 2168.9, "Text": " you're doing all the things you should be doing by storing it over SSL or sending it over SSL."}, {"Time_Start": 2168.9, "Time_End": 2172.9, "Text": " If it's also in the URL, then someone may still be able to get that information."}, {"Time_Start": 2172.9, "Time_End": 2175.9, "Text": " Additionally, if you're storing information in the URL,"}, {"Time_Start": 2175.9, "Time_End": 2178.9, "Text": " a proxy server store that information in logs."}, {"Time_Start": 2178.9, "Time_End": 2183.9, "Text": " So if someone were to break into your proxy server and see a session ID from a past login,"}, {"Time_Start": 2183.9, "Time_End": 2187.9, "Text": " that authentication information is right in there and viewable."}, {"Time_Start": 2187.9, "Time_End": 2188.9, "Text": " Essentially, just to break into your proxy server."}, {"Time_Start": 2188.9, "Time_End": 2192.2000000000003, "Text": " Essentially, just to break the six common problems behind session IDs,"}, {"Time_Start": 2192.6600000000003, "Time_End": 2194.48, "Text": " the first four actually relate to brute forcing."}, {"Time_Start": 2194.6800000000003, "Time_End": 2199.44, "Text": " So weak algorithm, obviously, if I generate an algorithm,"}, {"Time_Start": 2199.64, "Time_End": 2202.7400000000002, "Text": " one, two, three, four, five, six, seven, eight, nine, ten, eleven, blah, blah, blah, blah, blah, 12."}, {"Time_Start": 2203.0, "Time_End": 2204.5, "Text": " Not a very good algorithm, it's predictable."}, {"Time_Start": 2205.4, "Time_End": 2206.7400000000002, "Text": " Reverse engineerable as well."}, {"Time_Start": 2206.8, "Time_End": 2211.28, "Text": " You just saw username and password and through some encoding mechanism."}, {"Time_Start": 2212.08, "Time_End": 2214.44, "Text": " The second problem, no form of account lockout,"}, {"Time_Start": 2214.52, "Time_End": 2216.86, "Text": " and there's really no real way to combat this."}, {"Time_Start": 2216.86, "Time_End": 2218.88, "Text": " If you saw an IP address coming in,"}, {"Time_Start": 2218.9, "Time_End": 2223.4, "Text": " trying to brute force a session ID. You can't exactly lock out an IP address on the internet"}, {"Time_Start": 2223.4, "Time_End": 2230.7000000000003, "Text": " realistically, especially because of the way ISPs tend to randomize IP addresses like AOL. I believe"}, {"Time_Start": 2230.7000000000003, "Time_End": 2235.76, "Text": " AOL still does this. After each click of a web browser, your IP address actually changes."}, {"Time_Start": 2237.2000000000003, "Time_End": 2242.84, "Text": " So that's just another problem to exhaust that exacerbates this. Short T-space. I thought of a decent"}, {"Time_Start": 2242.84, "Time_End": 2247.62, "Text": " example. This is my luggage lock, and essentially assumed that there's a random code each time"}, {"Time_Start": 2247.62, "Time_End": 2252.52, "Text": " every time I walk it. It's, you know, it's great. You need, you need code every time,"}, {"Time_Start": 2252.56, "Time_End": 2257.96, "Text": " so no one can guess it. Unfortunately, it's easy to brute force. I have four dials on here, zero to nine."}, {"Time_Start": 2258.46, "Time_End": 2263.08, "Text": " Now, obviously, someone could brute force that probably during a day, again, if they were doing all"}, {"Time_Start": 2263.08, "Time_End": 2267.7, "Text": " these other things on that weekend, they had nothing to do. What we could do, though, is if we wanted"}, {"Time_Start": 2267.7, "Time_End": 2272.46, "Text": " to increase the key space, we could either create a bunch of dials that go all the way out, you know,"}, {"Time_Start": 2272.46, "Time_End": 2277.22, "Text": " for two feet, but also had zero to nine on it, or we could increase the length of the dials,"}, {"Time_Start": 2277.2200000000003, "Time_End": 2278.6400000000003, "Text": " including some other characters on it."}, {"Time_Start": 2279.2000000000003, "Time_End": 2281.78, "Text": " So I'll just give you an idea of what I mean by key space."}, {"Time_Start": 2283.86, "Time_End": 2285.82, "Text": " Again, indefinite expiration on the server."}, {"Time_Start": 2285.94, "Time_End": 2288.0200000000004, "Text": " If you click the Remember Me button, it gives an attacker,"}, {"Time_Start": 2288.4, "Time_End": 2290.46, "Text": " however long they want to brute force a session ID."}, {"Time_Start": 2290.7000000000003, "Time_End": 2291.38, "Text": " Pretty straightforward."}, {"Time_Start": 2292.2200000000003, "Time_End": 2293.82, "Text": " I'm not going to spend a lot of time in the last two."}, {"Time_Start": 2294.2000000000003, "Time_End": 2297.4800000000005, "Text": " Essentially, you all understand that if you capture a session ID in transit"}, {"Time_Start": 2297.4800000000005, "Time_End": 2301.42, "Text": " or if you're able to get a user to load some malicious Trojan horse"}, {"Time_Start": 2301.42, "Time_End": 2303.84, "Text": " that then sends it to you, you can then log into his application."}, {"Time_Start": 2307.2200000000003, "Time_End": 2313.1400000000003, "Text": " These are just some tools, all free tools, that you can use as a website, web application"}, {"Time_Start": 2313.1400000000003, "Time_End": 2318.1000000000004, "Text": " developer to help you, or as an auditor of somebody else's stuff, to determine if it's secure"}, {"Time_Start": 2318.1000000000004, "Time_End": 2321.86, "Text": " or whatever else you guys choose to use it for."}, {"Time_Start": 2321.86, "Time_End": 2326.42, "Text": " The first one, Session Auditor, that was the tool that we showed you, the one that we wrote,"}, {"Time_Start": 2326.42, "Time_End": 2330.0200000000004, "Text": " and allows you to brute force those Session IDs."}, {"Time_Start": 2330.0200000000004, "Time_End": 2336.42, "Text": " WebSlooth is a great tool. It does a lot of different things. Sessions Auditor is actually embedded"}, {"Time_Start": 2336.42, "Time_End": 2340.6, "Text": " within that tool, so you get the same functionality, but WebSleaf, they'll allow you to do a lot more."}, {"Time_Start": 2341.52, "Time_End": 2347.76, "Text": " And then the last four, Web Proxy, HEDP, Push, Achilles, and Mini Browser, we showed your Mini Browser."}, {"Time_Start": 2347.76, "Time_End": 2352.62, "Text": " Those are all effectively personal proxies, so what they're allowing you to do is not to brute force"}, {"Time_Start": 2352.62, "Time_End": 2358.2200000000003, "Text": " that Session ID, but to intercept the communications between the browser and the server so that you can"}, {"Time_Start": 2358.2200000000003, "Time_End": 2362.2200000000003, "Text": " see what's happening in the background. You can see how that session ID is getting passed."}, {"Time_Start": 2362.62, "Time_End": 2366.4, "Text": " And with most of those, it'll also allow you to adjust things before that,"}, {"Time_Start": 2366.42, "Time_End": 2372.1800000000003, "Text": " session ID is sent. So you're sort of doing a manual brute force. What can you do as"}, {"Time_Start": 2372.1800000000003, "Time_End": 2377.62, "Text": " a user? Obviously as a user, you're at the mercy of the application, the web application"}, {"Time_Start": 2377.62, "Time_End": 2382.42, "Text": " that you're using, but there are still some common sense protective measures that you can take."}, {"Time_Start": 2382.42, "Time_End": 2388.36, "Text": " One, logging out when your session is done so that if they're using that session cookie to use"}, {"Time_Start": 2388.36, "Time_End": 2393.12, "Text": " the session ID, it'll get wiped off the server. And so if somebody steals it, it's not going"}, {"Time_Start": 2393.12, "Time_End": 2396.1800000000003, "Text": " to work for them anymore. Don't select your member me option."}, {"Time_Start": 2396.42, "Time_End": 2405.42, "Text": " Memory option is good in some situations if it's security is not involved, but all that's doing is maintaining that session ID on your hard drive."}, {"Time_Start": 2405.42, "Time_End": 2408.42, "Text": " And if somebody has access to your hard drive, they can grab it."}, {"Time_Start": 2408.42, "Time_End": 2409.42, "Text": " And everybody knows where to find it."}, {"Time_Start": 2409.42, "Time_End": 2413.42, "Text": " You know, Netscape stores of cookies in a certain place, i.e. stores it in a certain place."}, {"Time_Start": 2413.42, "Time_End": 2415.42, "Text": " It's always in the same place."}, {"Time_Start": 2415.42, "Time_End": 2418.42, "Text": " Then that ties into the third one."}, {"Time_Start": 2418.42, "Time_End": 2420.42, "Text": " Use SSL when you can."}, {"Time_Start": 2420.42, "Time_End": 2425.42, "Text": " David mentioned, you know, it's not perfect because if you can get something at one of the end points or at a problem."}, {"Time_Start": 2425.42, "Time_End": 2428.42, "Text": " or at a proxy in the middle, you can still intercept it,"}, {"Time_Start": 2428.42, "Time_End": 2431.42, "Text": " but it does prevent somebody from sniffing that session ID,"}, {"Time_Start": 2431.42, "Time_End": 2433.42, "Text": " which is obviously a good thing."}, {"Time_Start": 2433.42, "Time_End": 2437.42, "Text": " And patching your browser with anything, you've got to keep the patches up to date."}, {"Time_Start": 2437.42, "Time_End": 2440.42, "Text": " The big thing right now is cross-site scripting attacks."}, {"Time_Start": 2440.42, "Time_End": 2442.42, "Text": " We see new ones every day."}, {"Time_Start": 2442.42, "Time_End": 2445.42, "Text": " And keeping your browser patches up to date"}, {"Time_Start": 2445.42, "Time_End": 2448.42, "Text": " will help you from not somebody,"}, {"Time_Start": 2448.42, "Time_End": 2451.42, "Text": " help you from not allowing somebody to grab your session ID"}, {"Time_Start": 2451.42, "Time_End": 2454.42, "Text": " through a cross-side scripting attack."}, {"Time_Start": 2454.42, "Time_End": 2455.42, "Text": " And, you know,"}, {"Time_Start": 2455.42, "Time_End": 2461.42, "Text": " A session ID is an authentication mechanism, so treat it the way you would treat a username and password."}, {"Time_Start": 2461.42, "Time_End": 2467.42, "Text": " If you're passing it around in an email, just keep that in mind that it, that's what it's doing."}, {"Time_Start": 2467.42, "Time_End": 2471.42, "Text": " Just a follow on to cross-site scripting."}, {"Time_Start": 2471.42, "Time_End": 2477.42, "Text": " Obviously, cross-site scripting is a server-side problem, but there are a few browser-specific issues that"}, {"Time_Start": 2477.42, "Time_End": 2483.42, "Text": " some cross-site scripting works on older versions of Netscape, that don't work on the newer versions, etc."}, {"Time_Start": 2483.42, "Time_End": 2485.42, "Text": " Obviously, there are a lot of cross-site scripting."}, {"Time_Start": 2485.42, "Time_End": 2491.42, "Text": " stuff is dependent on the vendor to either fix or make sure it doesn't affect authentication."}, {"Time_Start": 2491.42, "Time_End": 2493.42, "Text": " So what can you do as a software vendor?"}, {"Time_Start": 2493.42, "Time_End": 2496.42, "Text": " If you're actually hearing the audience and you've grown your facial hair out in the last week"}, {"Time_Start": 2496.42, "Time_End": 2499.42, "Text": " with wanting to mingle in."}, {"Time_Start": 2499.42, "Time_End": 2503.42, "Text": " These are the things that software vendors can do to make sure"}, {"Time_Start": 2503.42, "Time_End": 2507.42, "Text": " that their applications are more resilient to application group forcing."}, {"Time_Start": 2507.42, "Time_End": 2511.42, "Text": " Obviously, you're not going to be immune to it by the very nature of most of these state mechanisms."}, {"Time_Start": 2511.42, "Time_End": 2514.42, "Text": " Regenerate the session ID after a set period of time."}, {"Time_Start": 2514.42, "Time_End": 2518.42, "Text": " This helps if someone actually sees the information in your proxy."}, {"Time_Start": 2518.42, "Time_End": 2521.42, "Text": " It just makes it harder for an attacker."}, {"Time_Start": 2521.42, "Time_End": 2525.42, "Text": " My favorite is create booby-trapped session IDs in the application."}, {"Time_Start": 2525.42, "Time_End": 2530.42, "Text": " So if you have essentially, I have five minutes, okay,"}, {"Time_Start": 2530.42, "Time_End": 2535.42, "Text": " my five-minute overplan wasn't going to go over well."}, {"Time_Start": 2535.42, "Time_End": 2540.42, "Text": " But essentially just create a booby-trapped ID so that one that never gets generated,"}, {"Time_Start": 2540.42, "Time_End": 2543.42, "Text": " but one that you can detect if someone's going through a range."}, {"Time_Start": 2543.42, "Time_End": 2544.42, "Text": " When practical,"}, {"Time_Start": 2544.42, "Time_End": 2547.42, "Text": " So limit the successful sessions to specific IP addresses."}, {"Time_Start": 2547.42, "Time_End": 2550.42, "Text": " Again, this will only work in an internet environment."}, {"Time_Start": 2550.42, "Time_End": 2554.42, "Text": " This really isn't realistic for it, an internet application,"}, {"Time_Start": 2554.42, "Time_End": 2557.42, "Text": " in an environment where you have control over the physical aspects"}, {"Time_Start": 2557.42, "Time_End": 2559.42, "Text": " of where people are logging in."}, {"Time_Start": 2559.42, "Time_End": 2563.42, "Text": " For instance, if you only want someone to log in from this desk and the sock,"}, {"Time_Start": 2563.42, "Time_End": 2567.42, "Text": " then really that's the only way this option will play."}, {"Time_Start": 2567.42, "Time_End": 2571.42, "Text": " Auto-expired the sessions if someone walks away."}, {"Time_Start": 2571.42, "Time_End": 2573.42, "Text": " And the last one is something cool."}, {"Time_Start": 2573.42, "Time_End": 2575.42, "Text": " The last one is something cool."}, {"Time_Start": 2575.42, "Time_End": 2578.42, "Text": " It's kind of hard to explain, but essentially when we talked about a replay attack,"}, {"Time_Start": 2578.42, "Time_End": 2583.42, "Text": " if you're going to check out of a shopping cart, someone actually sees that checkout request"}, {"Time_Start": 2583.42, "Time_End": 2588.42, "Text": " and then just fires a bunch more checkout request so you get, on Amazon, you get 10 copies"}, {"Time_Start": 2588.42, "Time_End": 2591.42, "Text": " of comma sutra for dummies instead of the one you ordered."}, {"Time_Start": 2591.42, "Time_End": 2596.42, "Text": " Essentially what you can do is the page before that, put a nonce or another type of session ID"}, {"Time_Start": 2596.42, "Time_End": 2598.42, "Text": " that requires you actually come from that page."}, {"Time_Start": 2598.42, "Time_End": 2599.42, "Text": " And Yahoo does this."}, {"Time_Start": 2599.42, "Time_End": 2601.42, "Text": " They call it crumbs."}, {"Time_Start": 2601.42, "Time_End": 2602.42, "Text": " That's their official term for it."}, {"Time_Start": 2602.42, "Time_End": 2605.42, "Text": " And most important, just use a good algorithm"}, {"Time_Start": 2605.42, "Time_End": 2607.42, "Text": " and make sure the inputs to that algorithm"}, {"Time_Start": 2607.42, "Time_End": 2611.42, "Text": " are based on time or user ID or password."}, {"Time_Start": 2611.42, "Time_End": 2613.42, "Text": " Some good pseudo number random generators,"}, {"Time_Start": 2613.42, "Time_End": 2617.42, "Text": " E-GADs, Y-A-R-R-O-W."}, {"Time_Start": 2617.42, "Time_End": 2621.42, "Text": " What can you do as someone who actually has to buy this type of software?"}, {"Time_Start": 2621.42, "Time_End": 2624.42, "Text": " Well, a lot of this software actually does have the ability"}, {"Time_Start": 2624.42, "Time_End": 2628.42, "Text": " to generate hard-to-guess, hard-to-go-4 session IDs."}, {"Time_Start": 2628.42, "Time_End": 2629.42, "Text": " You just have to configure it."}, {"Time_Start": 2629.42, "Time_End": 2632.42, "Text": " Some of them have a few levels, but unfortunately out of the"}, {"Time_Start": 2632.42, "Time_End": 2635.42, "Text": " box, they are very, very low level."}, {"Time_Start": 2635.42, "Time_End": 2637.42, "Text": " And again, test your system."}, {"Time_Start": 2637.42, "Time_End": 2639.42, "Text": " I mean, you should be able to know as a vendor,"}, {"Time_Start": 2639.42, "Time_End": 2643.42, "Text": " or as a developer, if your system is prone to these attacks."}, {"Time_Start": 2643.42, "Time_End": 2646.42, "Text": " It's your responsibility, in a sense, to your users."}, {"Time_Start": 2646.42, "Time_End": 2649.42, "Text": " I want to leave just a one or two minutes for questions,"}, {"Time_Start": 2649.42, "Time_End": 2652.42, "Text": " but essentially we talked about OASP."}, {"Time_Start": 2652.42, "Time_End": 2655.42, "Text": " We already talked about OASP."}, {"Time_Start": 2655.42, "Time_End": 2657.42, "Text": " In conclusion, users, just be aware."}, {"Time_Start": 2657.42, "Time_End": 2661.42, "Text": " Developers configure your sites properly and your systems properly."}, {"Time_Start": 2661.42, "Time_End": 2663.42, "Text": " systems properly and test them."}, {"Time_Start": 2663.42, "Time_End": 2667.42, "Text": " And software vendors, fix your software."}, {"Time_Start": 2667.42, "Time_End": 2669.42, "Text": " Just some resources."}, {"Time_Start": 2669.42, "Time_End": 2673.42, "Text": " Yeah, if you have questions, you want to just come up after."}, {"Time_Start": 2673.42, "Time_End": 2677.42, "Text": " Unless you really have one that's burning a hole and you want everyone to hear."}, {"Time_Start": 2677.42, "Time_End": 2680.42, "Text": " Just, yeah, just one question, sorry."}, {"Time_Start": 2680.42, "Time_End": 2686.42, "Text": " I'm sorry, did you say that once more?"}, {"Time_Start": 2686.42, "Time_End": 2690.42, "Text": " Question is, can you use the SSL session ID for session tracking?"}, {"Time_Start": 2690.42, "Time_End": 2691.42, "Text": " ID for session tracking."}, {"Time_Start": 2691.42, "Time_End": 2693.42, "Text": " There's actually a decent thread about this."}, {"Time_Start": 2693.42, "Time_End": 2696.42, "Text": " I believe on the web application security list."}, {"Time_Start": 2696.42, "Time_End": 2699.42, "Text": " The answer is no, you really can't, for a lot of reasons."}, {"Time_Start": 2699.42, "Time_End": 2703.42, "Text": " One, it was just never meant to integrate well into web applications."}, {"Time_Start": 2703.42, "Time_End": 2706.42, "Text": " Often you have proxy servers that may strip that out"}, {"Time_Start": 2706.42, "Time_End": 2708.42, "Text": " before they actually get to the web application."}, {"Time_Start": 2708.42, "Time_End": 2710.42, "Text": " But if anyone wants more detail on that question,"}, {"Time_Start": 2710.42, "Time_End": 2712.42, "Text": " or they just want to come up after, please do."}, {"Time_Start": 2712.42, "Time_End": 2713.42, "Text": " Thanks for attending."}, {"Time_Start": 2713.42, "Time_End": 2714.42, "Text": " Sorry we started late."}, {"Time_Start": 2720.42, "Time_End": 2723.42, "Text": " Thank you."}, {"Time_Start": 2723.42, "Time_End": 2725.42, "Text": " Thank you."}, {"Time_Start": 2725.42, "Time_End": 2727.42, "Text": " Thank you."}]}