{"segments": [{"Time_Start": 0.0, "Time_End": 7.0, "Text": " Lawrence Baldwin and this presentation is on extreme IP back tracing."}, {"Time_Start": 7.0, "Time_End": 12.0, "Text": " Um, what I say?"}, {"Time_Start": 12.0, "Time_End": 15.0, "Text": " Test, test."}, {"Time_Start": 15.0, "Time_End": 16.0, "Text": " Okay."}, {"Time_Start": 16.0, "Time_End": 22.0, "Text": " I sat through two presentations here earlier and was in the back and couldn't really hear well."}, {"Time_Start": 22.0, "Time_End": 25.0, "Text": " Is this a good volume of voice to be able to hear me?"}, {"Time_Start": 25.0, "Time_End": 27.0, "Text": " All right, good."}, {"Time_Start": 27.0, "Time_End": 34.0, "Text": " I'm the developer and operator of the Minet Watchman distributed intrusion detection system."}, {"Time_Start": 34.0, "Time_End": 43.0, "Text": " And I collect firewall events from about 1,200 firewalls around the world and try to make some sense of it"}, {"Time_Start": 43.0, "Time_End": 53.0, "Text": " and backtrace addresses when we detect, when people have been compromised and try to send them notifications."}, {"Time_Start": 53.0, "Time_End": 56.0, "Text": " So I probably backtrace somewhere around 25,000 to 30,000."}, {"Time_Start": 56.0, "Time_End": 61.0, "Text": " 5,000 or 30,000 IP addresses a day and try to figure out who the heck owns them."}, {"Time_Start": 61.0, "Time_End": 67.0, "Text": " And the rationale for putting this presentation together is to try to impart some of that knowledge,"}, {"Time_Start": 67.0, "Time_End": 72.0, "Text": " bring visibility to the fact that this process is non-trivial,"}, {"Time_Start": 72.0, "Time_End": 77.0, "Text": " and maybe encourage people to do more with their firewall logs as well."}, {"Time_Start": 86.0, "Time_End": 93.0, "Text": " Okay, so a lot of these events that show up in your firewall logs, your IDS logs,"}, {"Time_Start": 93.0, "Time_End": 100.0, "Text": " really it's non-trivial tracing some of these IP addresses back to their owner."}, {"Time_Start": 100.0, "Time_End": 105.0, "Text": " A lot of times if you do a Hoos look up, you end up with nothing more than the ISP."}, {"Time_Start": 105.0, "Time_End": 112.0, "Text": " And really what we're hoping to do is that a lot of these systems that people are using to attack other people"}, {"Time_Start": 112.0, "Time_End": 115.0, "Text": " are not their own systems sitting on their own home DSL line."}, {"Time_Start": 115.0, "Time_End": 120.0, "Text": " home DSL line, they've broken into someone else's machine and they're launching attacks"}, {"Time_Start": 120.0, "Time_End": 122.0, "Text": " from these machines that they're controlling."}, {"Time_Start": 122.0, "Time_End": 130.0, "Text": " And we have plenty of those machines out there, Code Red, Minda."}, {"Time_Start": 130.0, "Time_End": 136.0, "Text": " Based on that, there's two ways really to improve the overall security of the Internet."}, {"Time_Start": 136.0, "Time_End": 141.0, "Text": " One goal is reducing the number of, total number of compromise hosts."}, {"Time_Start": 141.0, "Time_End": 144.98, "Text": " And the other being to minimize the amount of time that assistance"}, {"Time_Start": 145.0, "Time_End": 147.0, "Text": " remains compromised."}, {"Time_Start": 147.0, "Time_End": 156.0, "Text": " And so we have, to protect ourselves, we need to let people know people who have been broken into."}, {"Time_Start": 156.0, "Time_End": 163.0, "Text": " I need to let them know, hey, you know, we're seeing this in our logs, and"}, {"Time_Start": 163.0, "Time_End": 170.0, "Text": " I know a lot of people when they fire up their firewalls and alarm bells start going off like crazy,"}, {"Time_Start": 170.0, "Time_End": 174.0, "Text": " they get almost as upset as when they receive a piece of spam."}, {"Time_Start": 174.0, "Time_End": 181.0, "Text": " What we really have to realize is that probably about 95% of the scanning activity that you might be seeing in the law"}, {"Time_Start": 181.0, "Time_End": 188.0, "Text": " this isn't coming from a hacker directly, but rather it's really just another victim that's been compromised with something."}, {"Time_Start": 188.0, "Time_End": 196.0, "Text": " So it's almost like these probes are a cry for help rather than something that's intentionally hostile."}, {"Time_Start": 196.0, "Time_End": 204.0, "Text": " This quote here is taken from an article written shortly after the February 2000 DDS tax."}, {"Time_Start": 204.0, "Time_End": 213.0, "Text": " authorities pursuing the attackers say the servers they used belong to the users that had no idea that their resources were being used to launch attacks."}, {"Time_Start": 213.0, "Time_End": 219.0, "Text": " So here's a pretty interesting trace."}, {"Time_Start": 219.0, "Time_End": 223.0, "Text": " This was a MyNet Watchman incident."}, {"Time_Start": 223.0, "Time_End": 227.0, "Text": " Machine was compromised by the Microsoft Spider Wern."}, {"Time_Start": 227.0, "Time_End": 233.98, "Text": " When we backtraced the IP, it led over to the right server and you see the net name is"}, {"Time_Start": 234.0, "Time_End": 241.0, "Text": " is GAN, central reason of GANRF. And if we actually, if you see the notified contact,"}, {"Time_Start": 241.0, "Time_End": 245.0, "Text": " the first notified contact is SAM at GAN.RU."}, {"Time_Start": 245.0, "Time_End": 251.0, "Text": " So we go over to GAN.RU and run this page through a translator."}, {"Time_Start": 251.0, "Time_End": 255.0, "Text": " This is the Nuclear Regulatory Agency of Russia."}, {"Time_Start": 255.0, "Time_End": 259.0, "Text": " So pretty nice to know that they are infected."}, {"Time_Start": 259.0, "Time_End": 263.0, "Text": " As far as an update on this, the machine was actually..."}, {"Time_Start": 263.0, "Time_End": 267.0, "Text": " we notified them weeks and weeks ago."}, {"Time_Start": 267.0, "Time_End": 271.0, "Text": " And as of the last week, they were still attacking people."}, {"Time_Start": 271.0, "Time_End": 279.0, "Text": " So I don't know what kind of response that they're planning, but hopefully they do something soon."}, {"Time_Start": 279.0, "Time_End": 292.0, "Text": " Okay, so we're going to start by talking about some of the different tools you can use to back trace and some interesting places that information shows up."}, {"Time_Start": 292.0, "Time_End": 298.0, "Text": " up. We're going to start with, you know, the first thing that you want to do when"}, {"Time_Start": 298.0, "Time_End": 302.0, "Text": " you're actually tracing something back is actually validate the source IP."}, {"Time_Start": 302.0, "Time_End": 313.0, "Text": " Um, before we, before you go off and spend a whole lot of time trying to, trying to figure out"}, {"Time_Start": 313.0, "Time_End": 320.0, "Text": " who owns an address, it's really good idea to validate where that actual traffic came from."}, {"Time_Start": 320.0, "Time_End": 321.0, "Text": " Just because a packet."}, {"Time_Start": 321.0, "Time_End": 328.0, "Text": " a packet has a source IP address that could be from address based halfway across the world,"}, {"Time_Start": 328.0, "Time_End": 333.0, "Text": " there's nothing to stop that packet from having been generated locally by somebody spoofing addresses"}, {"Time_Start": 333.0, "Time_End": 337.0, "Text": " or some kind of misconfiguration problem or whatnot."}, {"Time_Start": 337.0, "Time_End": 347.0, "Text": " So it's certainly a good idea to use either a packet analyzer or router debug commands to actually validate"}, {"Time_Start": 347.0, "Time_End": 350.98, "Text": " that the packet is actually coming in physically from some remote"}, {"Time_Start": 351.0, "Time_End": 352.0, "Text": " physical interface."}, {"Time_Start": 352.0, "Time_End": 360.0, "Text": " Also, when trying to analyze firewall events in a broadcast network kind of topologies such"}, {"Time_Start": 360.0, "Time_End": 366.0, "Text": " as a cable modem network, it's entirely possible that you'll receive bleed through traffic"}, {"Time_Start": 366.0, "Time_End": 373.0, "Text": " that's sourced from addresses that are actually your neighbors on the same cable segment,"}, {"Time_Start": 373.0, "Time_End": 379.0, "Text": " whether they're using private addresses or maybe even being misconfigured with valid public addresses"}, {"Time_Start": 379.0, "Time_End": 382.0, "Text": " from other places around the world."}, {"Time_Start": 382.0, "Time_End": 390.0, "Text": " So one of the next steps you can take to is to eliminate some potential bad IP addresses."}, {"Time_Start": 390.0, "Time_End": 395.0, "Text": " In RFC 1812, they mentioned the Martian addresses."}, {"Time_Start": 395.0, "Time_End": 401.0, "Text": " And I was looking around to find that consistent definition of what the actual Martian addresses were."}, {"Time_Start": 401.0, "Time_End": 404.0, "Text": " These are actually read from the RFCs."}, {"Time_Start": 404.0, "Time_End": 408.98, "Text": " Some people might argue that link local and some of the other IANA reserve stuff are belonging to this"}, {"Time_Start": 409.0, "Time_End": 413.0, "Text": " group, but the examples here directly from the RFC."}, {"Time_Start": 413.0, "Time_End": 419.0, "Text": " You've got the broadcast, leadback, multic, and limited broadcast addresses."}, {"Time_Start": 419.0, "Time_End": 423.0, "Text": " And an interesting quote from the RFC is below."}, {"Time_Start": 423.0, "Time_End": 429.0, "Text": " A router should not forward any packet that has an invalid IP source address, which..."}, {"Time_Start": 429.0, "Time_End": 437.0, "Text": " I can't tell you the number of times I've had people ask me, you know, why is IP address 224.0.0.5 attacking me?"}, {"Time_Start": 437.0, "Time_End": 449.0, "Text": " So you can also exclude private addresses, 10 dot space, 172-16-31, 192-168."}, {"Time_Start": 449.0, "Time_End": 457.0, "Text": " There's a class A, B, and C, slash 12, slash 16."}, {"Time_Start": 457.0, "Time_End": 465.0, "Text": " Oops. This was a pretty interesting, who is record. Actually, this is from Korea."}, {"Time_Start": 465.0, "Time_End": 473.0, "Text": " they actually published a who is record, if you look at the IP address range, as for private IP address space."}, {"Time_Start": 473.0, "Time_End": 480.0, "Text": " And this came up on a discussion on the nanodress, and someone said, what was it?"}, {"Time_Start": 480.0, "Time_End": 485.0, "Text": " Someone's done an APDEC registration for LFC 1918 private space."}, {"Time_Start": 485.0, "Time_End": 494.0, "Text": " Perhaps they're suggesting that spammers or perhaps all of Korea be assigned private address space, which are fortunately non-routable."}, {"Time_Start": 494.0, "Time_End": 495.0, "Text": " non-routable."}, {"Time_Start": 495.0, "Time_End": 505.0, "Text": " So I mentioned this a couple slides back, but you can also pretty much exclude anything that comes from an IANA address."}, {"Time_Start": 505.0, "Time_End": 508.0, "Text": " It's really doubtful with their attacking rule."}, {"Time_Start": 508.0, "Time_End": 511.0, "Text": " These are some of the reserved addresses."}, {"Time_Start": 511.0, "Time_End": 517.0, "Text": " If you do look up for IANA at the WHOAS servers at Aaron, you'll get this list."}, {"Time_Start": 517.0, "Time_End": 520.0, "Text": " And this is just the list continued."}, {"Time_Start": 520.0, "Time_End": 523.0, "Text": " You do have to be a little careful about just dismissing"}, {"Time_Start": 523.0, "Time_End": 529.0, "Text": " reserved addresses because those are, of course, subject to change."}, {"Time_Start": 529.0, "Time_End": 536.0, "Text": " I know I have been considering a specific address range as being reserved in my database,"}, {"Time_Start": 536.0, "Time_End": 540.0, "Text": " and then six months later, some new reservations have been given out."}, {"Time_Start": 540.0, "Time_End": 544.0, "Text": " So addresses that were previously invalid as source addresses are now invalid."}, {"Time_Start": 544.0, "Time_End": 552.0, "Text": " So you've got to be sure to check these IPs on a somewhat frequent basis."}, {"Time_Start": 552.0, "Time_End": 556.0, "Text": " You should definitely look for stuff that looks fake."}, {"Time_Start": 556.0, "Time_End": 560.0, "Text": " 1.2.3.4, probably as an attack in here."}, {"Time_Start": 560.0, "Time_End": 564.0, "Text": " We also have some examples from MaxVisions, Whitepats,"}, {"Time_Start": 564.0, "Time_End": 567.0, "Text": " document on NAP decoy addresses."}, {"Time_Start": 567.0, "Time_End": 570.0, "Text": " Sometimes those show up in a trace."}, {"Time_Start": 570.0, "Time_End": 576.0, "Text": " People try to be really stealthy and you see a trace that has 23.23.23."}, {"Time_Start": 576.0, "Time_End": 577.0, "Text": " is the source IP."}, {"Time_Start": 577.0, "Time_End": 581.0, "Text": " And then you see another packet from 24.24.24."}, {"Time_Start": 581.0, "Time_End": 584.0, "Text": " something from a public address that's totally different."}, {"Time_Start": 584.0, "Time_End": 585.0, "Text": " And they're like, huh?"}, {"Time_Start": 585.0, "Time_End": 588.0, "Text": " Which address you're using there, buddy."}, {"Time_Start": 588.0, "Time_End": 595.0, "Text": " So you can do a limited amount of spoof detection on the addresses."}, {"Time_Start": 595.0, "Time_End": 600.0, "Text": " It gets really difficult to detect spoofing because ultimately where you receive the packet"}, {"Time_Start": 600.0, "Time_End": 603.0, "Text": " is somewhere near the edge of the network."}, {"Time_Start": 603.0, "Time_End": 610.0, "Text": " And Bob Morris, with his TCP IP weaknesses in the 4-5."}, {"Time_Start": 610.0, "Time_End": 613.0, "Text": " The weaknesses in the 4.2 BSD lyrics TCP IP software."}, {"Time_Start": 613.0, "Time_End": 615.0, "Text": " This is back in 1985."}, {"Time_Start": 615.0, "Time_End": 619.0, "Text": " He describes the weakness, which is basically anybody can fill in the source address,"}, {"Time_Start": 619.0, "Time_End": 622.0, "Text": " whatever source address they want, similar to snail mail."}, {"Time_Start": 622.0, "Time_End": 626.0, "Text": " If you don't have access, physical access to the network,"}, {"Time_Start": 626.0, "Time_End": 633.0, "Text": " there's really not an easy way to validate whether or not an address that appears to be attacking you is real or not."}, {"Time_Start": 633.0, "Time_End": 640.0, "Text": " However, there are some, and these are not extremely reliable, but at least some basic"}, {"Time_Start": 640.0, "Time_End": 644.5, "Text": " that you can do that might give you some information to decide whether or not the address is spoof."}, {"Time_Start": 644.5, "Time_End": 652.0, "Text": " Because obviously if somebody is spoofing an address, you don't want to be picking up the phone or sending them a nasty gram saying, you know, why are you scanning me?"}, {"Time_Start": 652.0, "Time_End": 658.0, "Text": " Yeah. So here's a technique. It's based on a one of the passive fingerprinting techniques,"}, {"Time_Start": 658.0, "Time_End": 667.0, "Text": " which actually looks at the TTL value. And so when you receive a packet and you check what the TTO was at the point that you received it,"}, {"Time_Start": 667.0, "Time_End": 676.0, "Text": " it. There's default TTLs for most OSS's and based on that and the count at where you received it,"}, {"Time_Start": 676.0, "Time_End": 685.0, "Text": " you can do some deduction as to what type of machine was attacking you, but also perhaps find out if it was"}, {"Time_Start": 685.0, "Time_End": 691.0, "Text": " a spoofed address. By trace routing back to that IP, you'll have some idea of the number of hops that"}, {"Time_Start": 691.0, "Time_End": 696.98, "Text": " it actually takes to get to you from that IP. Asymmetric routing may add a few hops and you"}, {"Time_Start": 697.0, "Time_End": 704.0, "Text": " between but they should be, should be fairly standard. And so if you subtract the final"}, {"Time_Start": 704.0, "Time_End": 710.0, "Text": " TTL from the original TTL and then do some guessing as to what kind of OAS sent the packet,"}, {"Time_Start": 710.0, "Time_End": 715.5, "Text": " you can get, yeah, it's not totally reliable, but it can give you an idea whether a packet"}, {"Time_Start": 715.5, "Time_End": 717.0, "Text": " was really spoofed or not."}, {"Time_Start": 717.0, "Time_End": 724.0, "Text": " I mean, if you receive a packet and the implied decrement in TTL implies that that host is like"}, {"Time_Start": 724.0, "Time_End": 726.98, "Text": " ten hops away, but when you trace it out to that IP, if you receive a packet, it's"}, {"Time_Start": 727.0, "Time_End": 733.0, "Text": " it's like 40 hops away, I'd say there's probably a pretty good chance that that was a spoofed address."}, {"Time_Start": 733.0, "Time_End": 744.0, "Text": " And I don't know if anyone here was in the XPROD 2 talk, but there's actually a list of what the default starting TTL values are for a lot of the major operating system."}, {"Time_Start": 744.0, "Time_End": 746.0, "Text": " Oh, I didn't realize you did it to know."}, {"Time_Start": 746.0, "Time_End": 748.0, "Text": " Oh, it looks like he stole it from him."}, {"Time_Start": 748.0, "Time_End": 750.0, "Text": " No, this was actually taken."}, {"Time_Start": 750.0, "Time_End": 756.0, "Text": " I looked around for the default TTLs all over the place and there was this one link on Google that unfortunately was down."}, {"Time_Start": 756.0, "Time_End": 757.44, "Text": " Unfortunately, it was down."}, {"Time_Start": 757.44, "Time_End": 759.64, "Text": " So this is from the cache page."}, {"Time_Start": 759.64, "Time_End": 767.4, "Text": " I haven't verified all of these, but I have looked into the Windows and the Linux TTLs."}, {"Time_Start": 767.4, "Time_End": 774.76, "Text": " And in the slides on the CD-On, there's actually some details about how you can change your default"}, {"Time_Start": 774.76, "Time_End": 780.24, "Text": " TTL to be whatever you want it to be."}, {"Time_Start": 780.24, "Time_End": 785.94, "Text": " So here's an example of where this type of speech detection breaks down, you'll notice at"}, {"Time_Start": 786.0, "Time_End": 790.0, "Text": " At hop 10, we jump into 10 dot space."}, {"Time_Start": 790.0, "Time_End": 793.0, "Text": " And then at hop 11, we jump into 172 dot space,"}, {"Time_Start": 793.0, "Time_End": 795.0, "Text": " and then the trace disappears after that."}, {"Time_Start": 795.0, "Time_End": 800.0, "Text": " So we really have no idea exactly how many hops away this particular address is."}, {"Time_Start": 804.0, "Time_End": 809.0, "Text": " Another way to validate whether or not an IP address is real"}, {"Time_Start": 809.0, "Time_End": 814.0, "Text": " is to perform route validation on it by looking at BGP route tables."}, {"Time_Start": 814.0, "Time_End": 815.98, "Text": " And there's a couple of sites."}, {"Time_Start": 816.0, "Time_End": 820.44, "Text": " listed here that will basically let you punch in an IP address and it will come"}, {"Time_Start": 820.44, "Time_End": 826.88, "Text": " back and tell you what the route, the active route entries are for that address."}, {"Time_Start": 826.88, "Time_End": 831.24, "Text": " This is like a really, I've only just started doing this, playing with this, but it's really a powerful"}, {"Time_Start": 831.24, "Time_End": 832.24, "Text": " concept."}, {"Time_Start": 832.24, "Time_End": 837.54, "Text": " Almost every other source of back tracing information is stale and old information, whereas, you"}, {"Time_Start": 837.54, "Time_End": 842.8, "Text": " know, BGP route information is about one of the few sort of active and real-time information."}, {"Time_Start": 842.8, "Time_End": 845.98, "Text": " And I can't tell you the number of times when I've taken an address that I have some suspicion"}, {"Time_Start": 846.0, "Time_End": 852.0, "Text": " about whether or not it's been spoofed or not, plug it into BGP route tables and it comes back network, not even in table."}, {"Time_Start": 852.0, "Time_End": 855.0, "Text": " So we have an example of that here."}, {"Time_Start": 855.0, "Time_End": 862.0, "Text": " Yeah, here's a, just a quick spoof example. This is a lookup at Aaron for 182.1.1.2."}, {"Time_Start": 862.0, "Time_End": 864.0, "Text": " And of course, no match."}, {"Time_Start": 864.0, "Time_End": 868.0, "Text": " And then here's the results of the looking glass."}, {"Time_Start": 868.0, "Time_End": 874.0, "Text": " No routes for this IP address, so it's pretty accurate that it's probably spoofed."}, {"Time_Start": 874.0, "Time_End": 879.0, "Text": " Of course, the sooner you do this, the more accurate the information is, too."}, {"Time_Start": 879.0, "Time_End": 888.0, "Text": " So, the team backtrace, there's a couple of tools that are pretty standard tools for doing back tracing."}, {"Time_Start": 888.0, "Time_End": 891.0, "Text": " One of them is NS Lookup, of course."}, {"Time_Start": 891.0, "Time_End": 896.0, "Text": " If you just have an IP address, you want to find out what the reverse DNS name is."}, {"Time_Start": 896.0, "Time_End": 903.0, "Text": " Armed with that, you can query for starter authority, MX records."}, {"Time_Start": 903.0, "Time_End": 910.0, "Text": " records, things like that that can give you more information about the domain itself."}, {"Time_Start": 910.0, "Time_End": 916.0, "Text": " Here's an example, simple example, the MS lookup, we set the type to pointer, looking at the full address"}, {"Time_Start": 916.0, "Time_End": 920.0, "Text": " in the inner ARPA namespace."}, {"Time_Start": 920.0, "Time_End": 926.0, "Text": " And then we look for the SOA for the full address in outer ARPA namespace, and of course it doesn't"}, {"Time_Start": 926.0, "Time_End": 927.0, "Text": " find it."}, {"Time_Start": 927.0, "Time_End": 932.0, "Text": " So we dropped off the last octet and looked for the start of authority on the Class C address."}, {"Time_Start": 932.0, "Time_End": 937.0, "Text": " address and here it is located at RR.com."}, {"Time_Start": 937.0, "Time_End": 951.0, "Text": " One thing that in the early stages that I was using this technique, I was actually recursively backing up to even the Class B level to do these SOA lookups"}, {"Time_Start": 951.0, "Time_End": 958.0, "Text": " and I can assure you that's not a very good idea because you have tons of different ISPs within the same Class B address."}, {"Time_Start": 958.0, "Time_End": 961.98, "Text": " So you really don't want to go further than going to a Class C level and you really don't want to go further than going to a Class C level"}, {"Time_Start": 962.0, "Time_End": 971.0, "Text": " And even that can be touch and go if you're dealing with an address base that's been very finely distributed across multiple providers."}, {"Time_Start": 971.0, "Time_End": 978.0, "Text": " Another one of the standard back tracing tools is, of course, the Who is databases."}, {"Time_Start": 978.0, "Time_End": 989.0, "Text": " I do my first lookups at Aaron because it'll tell you if it's not in their registry and they'll point you at one of the other mix if it is."}, {"Time_Start": 989.0, "Time_End": 998.0, "Text": " A lot of times the data that you get back though from the who is servers is totally bogus or totally out of date."}, {"Time_Start": 998.0, "Time_End": 1005.0, "Text": " Here you have some of the advanced query syntax for Aaron."}, {"Time_Start": 1005.0, "Time_End": 1011.0, "Text": " Some of these are kind of fun to play with doing full lookups and net lookups."}, {"Time_Start": 1011.0, "Time_End": 1018.98, "Text": " You can actually do a net lookup on a, say, class B and it will give you every network in the database that you can actually do a net lookup on a class B and it will give you every network in the database that"}, {"Time_Start": 1019.0, "Time_End": 1021.0, "Text": " is whether that class be right."}, {"Time_Start": 1021.0, "Time_End": 1026.0, "Text": " One of the things I wanted to emphasize from the previous slide is"}, {"Time_Start": 1026.0, "Time_End": 1034.0, "Text": " very often people will see the email contact address listed in an errand record"}, {"Time_Start": 1034.0, "Time_End": 1037.0, "Text": " and start shooting email at that person."}, {"Time_Start": 1037.0, "Time_End": 1041.0, "Text": " It's really not a good idea as the typically the contact record"}, {"Time_Start": 1041.0, "Time_End": 1045.0, "Text": " there is a person who maintains the IP address allocation space,"}, {"Time_Start": 1045.0, "Time_End": 1048.0, "Text": " not a person who deals with security issues."}, {"Time_Start": 1048.0, "Time_End": 1048.98, "Text": " So about the"}, {"Time_Start": 1049.0, "Time_End": 1054.0, "Text": " only case where you'd want to use that information is if you see a net block that's extremely small,"}, {"Time_Start": 1054.0, "Time_End": 1059.0, "Text": " like a Class C or below, then it might be safe to try to contact that person directly."}, {"Time_Start": 1059.0, "Time_End": 1064.0, "Text": " If it's a large ISP, you don't want to be sending email to the Aaron contact information."}, {"Time_Start": 1064.0, "Time_End": 1069.0, "Text": " You just want to take the domain portion of that contact address and then as we'll get into later,"}, {"Time_Start": 1069.0, "Time_End": 1072.0, "Text": " try to figure out what mailbox is to use and that sort of thing."}, {"Time_Start": 1072.0, "Time_End": 1075.0, "Text": " So we talked about this. Let's see."}, {"Time_Start": 1075.0, "Time_End": 1077.0, "Text": " Okay, so here's an example."}, {"Time_Start": 1077.0, "Time_End": 1083.0, "Text": " If you work, the contact email is at hotmail.com, which is pretty useful."}, {"Time_Start": 1083.0, "Time_End": 1085.0, "Text": " And the phone number is pretty good."}, {"Time_Start": 1085.0, "Time_End": 1090.0, "Text": " One, two, three, four, five, six, seven, eight, nine, zero."}, {"Time_Start": 1090.0, "Time_End": 1096.0, "Text": " So obviously, not much is going to be able to get through to any of these numbers."}, {"Time_Start": 1096.0, "Time_End": 1102.0, "Text": " This record really emphasizes the whole problem with who is."}, {"Time_Start": 1102.0, "Time_End": 1106.98, "Text": " In that, yes, you can look up Aaron records and find out net block"}, {"Time_Start": 1107.0, "Time_End": 1112.0, "Text": " information. But very often, those net block records don't tell you anything about the domain"}, {"Time_Start": 1112.0, "Time_End": 1119.0, "Text": " that is responsible for that address space. Because it sure ain't hotmail.com. And you"}, {"Time_Start": 1119.0, "Time_End": 1124.0, "Text": " really can't even, you really have to look at this carefully to realize that Internet America"}, {"Time_Start": 1124.0, "Time_End": 1133.0, "Text": " in Dallas, Texas, well, their domain name, it's probably IADFW.net. But doing that in an automated fashion"}, {"Time_Start": 1133.0, "Time_End": 1136.98, "Text": " is almost impossible. It requires almost manually"}, {"Time_Start": 1137.0, "Time_End": 1143.0, "Text": " reviewing these records and making those associations between IP address and domain names."}, {"Time_Start": 1143.0, "Time_End": 1149.0, "Text": " Okay, so moving on, we have the intermediate backtrace category."}, {"Time_Start": 1149.0, "Time_End": 1155.0, "Text": " Some more advanced tools as you move further in the tracing."}, {"Time_Start": 1155.0, "Time_End": 1161.0, "Text": " Recursive, who is, if the record isn't an error that would point you at Wipe or APNEC,"}, {"Time_Start": 1161.0, "Time_End": 1165.0, "Text": " who in turn might point you to one of the national registries."}, {"Time_Start": 1165.0, "Time_End": 1172.0, "Text": " So by doing recursive lookups, you can narrow down who actually owns the space."}, {"Time_Start": 1172.0, "Time_End": 1177.0, "Text": " And you can actually cross-check what you find in the IP-based Who-Is records"}, {"Time_Start": 1177.0, "Time_End": 1180.0, "Text": " with domain-based Who-Is queries."}, {"Time_Start": 1180.0, "Time_End": 1182.0, "Text": " There are several places to do that."}, {"Time_Start": 1182.0, "Time_End": 1185.0, "Text": " I like the Geek Tools proxy a lot."}, {"Time_Start": 1185.0, "Time_End": 1188.0, "Text": " And I just recently stumbled on the UhooIs.com"}, {"Time_Start": 1188.0, "Time_End": 1194.0, "Text": " so I'm not so sure about the reliability of it, but it seems universal who-is."}, {"Time_Start": 1194.0, "Time_End": 1196.0, "Text": " who is sounds pretty nice."}, {"Time_Start": 1196.0, "Time_End": 1200.0, "Text": " Yeah, cross-checking is very critical because"}, {"Time_Start": 1200.0, "Time_End": 1205.0, "Text": " one of my pet peeves about IP who is information is"}, {"Time_Start": 1205.0, "Time_End": 1208.0, "Text": " there's absolutely no ramifications whatsoever"}, {"Time_Start": 1208.0, "Time_End": 1212.0, "Text": " when somebody allows that information to go stay on and out of date,"}, {"Time_Start": 1212.0, "Time_End": 1214.0, "Text": " which is the reason why it's so out of date."}, {"Time_Start": 1214.0, "Time_End": 1218.0, "Text": " I mean, I see records constantly where the last update time was like"}, {"Time_Start": 1218.0, "Time_End": 1220.0, "Text": " 1994 or earlier."}, {"Time_Start": 1220.0, "Time_End": 1224.0, "Text": " Whereas with domain who is information, there's really"}, {"Time_Start": 1224.0, "Time_End": 1228.0, "Text": " real ramifications if you don't put a valid email address in there."}, {"Time_Start": 1228.0, "Time_End": 1231.0, "Text": " You're not going to get notifications about your domain name expiring,"}, {"Time_Start": 1231.0, "Time_End": 1233.0, "Text": " and you could lose your domain."}, {"Time_Start": 1233.0, "Time_End": 1237.0, "Text": " So very often the domain contact information will actually have"}, {"Time_Start": 1237.0, "Time_End": 1241.0, "Text": " much more timely information than what's in the IP Who Is record."}, {"Time_Start": 1241.0, "Time_End": 1245.0, "Text": " So once you have a domain that you might be pulling out of IP Who Is,"}, {"Time_Start": 1245.0, "Time_End": 1249.0, "Text": " look it up in the domain who is and validate the contact,"}, {"Time_Start": 1249.0, "Time_End": 1253.0, "Text": " see if the contact information is as good or possibly more up to date."}, {"Time_Start": 1253.0, "Time_End": 1258.0, "Text": " This is an interesting example from a document."}, {"Time_Start": 1258.0, "Time_End": 1262.0, "Text": " I've been getting a ton of spam, encouraging me to buy my ."}, {"Time_Start": 1262.0, "Time_End": 1263.0, "Text": " ."}, {"Time_Start": 1263.0, "Time_End": 1265.0, "Text": " ."}, {"Time_Start": 1265.0, "Time_End": 1268.0, "Text": " And Moostar, the people who administer the ."}, {"Time_Start": 1268.0, "Time_End": 1269.0, "Text": " ."}, {"Time_Start": 1269.0, "Time_End": 1271.0, "Text": " This is an interesting court."}, {"Time_Start": 1271.0, "Time_End": 1275.0, "Text": " Under current administrative practices, the U.S. top-ended domain not only has no central database"}, {"Time_Start": 1275.0, "Time_End": 1277.0, "Text": " that can in turn create a central who is,"}, {"Time_Start": 1277.0, "Time_End": 1282.0, "Text": " there's also no mechanism in place for delegates to provision database information to the central registry."}, {"Time_Start": 1282.0, "Time_End": 1287.0, "Text": " registry. Even if delegates wish to provide me who is in relation to the USTLD administrator,"}, {"Time_Start": 1287.0, "Time_End": 1293.0, "Text": " that capability is currently non-existent. So we're really not doing anything to fix the problem"}, {"Time_Start": 1293.0, "Time_End": 1300.0, "Text": " of being able to trace these events back to an actual owner or administrator of an IP."}, {"Time_Start": 1304.0, "Time_End": 1309.0, "Text": " Once you actually have extracted out a domain name that you believe is responsible,"}, {"Time_Start": 1309.0, "Time_End": 1312.0, "Text": " your next step in trying to actually make physical"}, {"Time_Start": 1312.0, "Time_End": 1316.0, "Text": " contact is to figure out an actual email box to send it to."}, {"Time_Start": 1316.0, "Time_End": 1324.0, "Text": " And we have the Abuse.net site, which is sort of a de facto registry of abuse email addresses."}, {"Time_Start": 1324.0, "Time_End": 1330.0, "Text": " And you can just basically punch in any domain and it'll try to pop back and tell you what mailbox,"}, {"Time_Start": 1330.0, "Time_End": 1335.0, "Text": " whether or not it's an abuse at, mailbox security at, or postmaster at, whatever it is."}, {"Time_Start": 1335.0, "Time_End": 1341.0, "Text": " And I think now he's up to about, I think he's got about 140,000 domains in there."}, {"Time_Start": 1341.0, "Time_End": 1348.0, "Text": " This site is more meant for dealing with spam-related issues, but in large majority of cases,"}, {"Time_Start": 1348.0, "Time_End": 1354.0, "Text": " the spam mailbox is essentially the same as any kind of security-related mailbox."}, {"Time_Start": 1354.0, "Time_End": 1360.0, "Text": " Okay, moving to go on, we have some more advanced techniques,"}, {"Time_Start": 1360.0, "Time_End": 1367.0, "Text": " which first one is, if the Who is Query doesn't give you the right domain,"}, {"Time_Start": 1367.0, "Time_End": 1370.98, "Text": " you can try searching in Google and putting in parts of the"}, {"Time_Start": 1371.0, "Time_End": 1374.0, "Text": " the information that you got back from who is."}, {"Time_Start": 1374.0, "Time_End": 1379.0, "Text": " Try adding parts of the actual Agress, the city, the state."}, {"Time_Start": 1379.0, "Time_End": 1384.0, "Text": " Here's a neat example. It's something that you don't see all the time."}, {"Time_Start": 1384.0, "Time_End": 1390.0, "Text": " Here's, if you look at the address space for two of these, for each of these records,"}, {"Time_Start": 1390.0, "Time_End": 1394.0, "Text": " they're two different records for the exact same space."}, {"Time_Start": 1394.0, "Time_End": 1397.0, "Text": " So it's kind of tough to tell who owns this."}, {"Time_Start": 1397.0, "Time_End": 1400.0, "Text": " IWave. Dot Quote sounds a little bit more specific."}, {"Time_Start": 1400.0, "Time_End": 1402.0, "Text": " specific."}, {"Time_Start": 1402.0, "Time_End": 1407.0, "Text": " So here's the full record for IWave Corporation."}, {"Time_Start": 1407.0, "Time_End": 1413.0, "Text": " Again, the contact is at Hotmail, not really helping us out."}, {"Time_Start": 1413.0, "Time_End": 1420.0, "Text": " So we do a Google search on IWave, adding some address information in there, Vienna,"}, {"Time_Start": 1420.0, "Time_End": 1429.0, "Text": " and lo and behold, the third link down, and shows us www.IWave.com."}, {"Time_Start": 1429.0, "Time_End": 1429.98, "Text": " And of course, search"}, {"Time_Start": 1430.0, "Time_End": 1440.0, "Text": " thing to that website, you'll notice in the bottom right in the corner, we actually have a real email box, not at Hotmail."}, {"Time_Start": 1440.0, "Time_End": 1446.0, "Text": " One of the other advanced tools that you can use is, referral who is,"}, {"Time_Start": 1446.0, "Time_End": 1455.0, "Text": " when I first read through the spec on R, Who Is, I got extremely excited."}, {"Time_Start": 1455.0, "Time_End": 1459.98, "Text": " I was like, you know, great, here's this much more specific tool of getting down at who owns"}, {"Time_Start": 1460.0, "Time_End": 1465.0, "Text": " address space, because very often when you do a straight who is look up, it's just going to"}, {"Time_Start": 1465.0, "Time_End": 1469.0, "Text": " resolve to the service provider and not to the actual end company."}, {"Time_Start": 1469.0, "Time_End": 1475.0, "Text": " And unfortunately, trying to contact a company through a service provider is pretty much a brick wall."}, {"Time_Start": 1475.0, "Time_End": 1480.0, "Text": " You can pretty much be guaranteed that you're not going to have any communication for, like, weeks at a time."}, {"Time_Start": 1480.0, "Time_End": 1486.0, "Text": " So our who is is basically a mechanism for ISPs to create more granular databases."}, {"Time_Start": 1486.0, "Time_End": 1489.0, "Text": " Unfortunately, only a handful of services."}, {"Time_Start": 1489.0, "Time_End": 1493.0, "Text": " only a handful of service providers have implemented their own Ar-Who-Is servers."}, {"Time_Start": 1496.0, "Time_End": 1502.0, "Text": " Here's just a quick example. This is actually from Geek Tools. I know it's a little bit hard to read."}, {"Time_Start": 1502.0, "Time_End": 1508.0, "Text": " But this is just one that, you know, when you do, look up at Aaron, it will give you back, you know,"}, {"Time_Start": 1508.0, "Time_End": 1515.0, "Text": " a record for Exodus, and then, say, you know, for further information, you can visit the Ar-Who-Is server at Exodus."}, {"Time_Start": 1515.0, "Time_End": 1519.0, "Text": " So the nice thing about the GeekTools proxy is it gives you both records, or the Al-Hoo-Is server at Exodus."}, {"Time_Start": 1519.0, "Time_End": 1526.0, "Text": " actually automatically go out and pull down the R who has record and give it to you."}, {"Time_Start": 1526.0, "Time_End": 1538.0, "Text": " So this is the domain record based on what we pulled out of this slide here."}, {"Time_Start": 1538.0, "Time_End": 1540.0, "Text": " This is the domain record."}, {"Time_Start": 1540.0, "Time_End": 1547.0, "Text": " We get Hostmaster at PMimaging.com, which is nice."}, {"Time_Start": 1547.0, "Time_End": 1552.0, "Text": " nice. This illustrates why people should use role-based accounts for their contacts."}, {"Time_Start": 1552.0, "Time_End": 1560.0, "Text": " If Jerry Blow leaves the company, you don't want his email, I guess, as the contact in your information."}, {"Time_Start": 1560.0, "Time_End": 1569.0, "Text": " A nice generic hostmaster at your company is great to use because whoever takes over as the next hostmaster can receive that email."}, {"Time_Start": 1577.0, "Time_End": 1584.0, "Text": " databases besides who is. There's the routing registry on RR records."}, {"Time_Start": 1584.0, "Time_End": 1591.0, "Text": " I list RFC number there if you're interested. The routing registry is similar to the BGP routes"}, {"Time_Start": 1591.0, "Time_End": 1598.0, "Text": " except it's stale and a lot older information, but sometimes you can find nuggets of gold."}, {"Time_Start": 1598.0, "Time_End": 1604.0, "Text": " Here was a successful trace that we actually were able to pull out information with RR."}, {"Time_Start": 1604.0, "Time_End": 1606.0, "Text": " The culprit in this case was Click Network."}, {"Time_Start": 1606.0, "Time_End": 1609.0, "Text": " was Click Network."}, {"Time_Start": 1609.0, "Time_End": 1614.0, "Text": " Unfortunately, if we thought IP, who his records were out of date,"}, {"Time_Start": 1614.0, "Time_End": 1619.0, "Text": " the route records tend to be even a more order of magnitude out of date,"}, {"Time_Start": 1619.0, "Time_End": 1624.0, "Text": " so it isn't always helpful resource, but it's just another possible source to try."}, {"Time_Start": 1624.0, "Time_End": 1629.0, "Text": " So yeah, here's what's actually returned by the routing registry,"}, {"Time_Start": 1629.0, "Time_End": 1632.0, "Text": " hostmaster at Clicknetwork.com."}, {"Time_Start": 1632.0, "Time_End": 1635.98, "Text": " So then we move into some of the more extreme"}, {"Time_Start": 1636.0, "Time_End": 1637.0, "Text": " techniques."}, {"Time_Start": 1637.0, "Time_End": 1647.0, "Text": " You can, well, you have an IP, yes, it doesn't do any harm to see what ports they've got offered out to the world."}, {"Time_Start": 1647.0, "Time_End": 1655.0, "Text": " And I know, perhaps there's a banner there that you can read that I'll tell you who administers the machine in question."}, {"Time_Start": 1655.0, "Time_End": 1665.0, "Text": " Yeah, I've actually found a surprisingly high percentage of compromised servers are also running mail servers."}, {"Time_Start": 1665.0, "Time_End": 1669.0, "Text": " I'd say it almost seems like almost as high as 25%."}, {"Time_Start": 1669.0, "Time_End": 1675.0, "Text": " Unfortunately, although including a mail banner on your mail server is an RFC requirement,"}, {"Time_Start": 1675.0, "Time_End": 1682.0, "Text": " I'd say probably only about, you know, 60% of people actually follow that standard, so it's not always effective."}, {"Time_Start": 1682.0, "Time_End": 1684.0, "Text": " So here's an example."}, {"Time_Start": 1684.0, "Time_End": 1694.0, "Text": " You know, this particular machine had 443 open and so looking at the SSL certificate,"}, {"Time_Start": 1694.0, "Time_End": 1700.0, "Text": " certificate, you can see in the subject line that's highlighted laitimes.com."}, {"Time_Start": 1700.0, "Time_End": 1705.0, "Text": " Here we're getting some clue as to who might be running this machine."}, {"Time_Start": 1705.0, "Time_End": 1712.0, "Text": " And you can get this to pop up just by doing a, you know, surfing HTTP surf right to the IP address that's attacking you."}, {"Time_Start": 1712.0, "Time_End": 1717.0, "Text": " You know, then this SSL certificate pops up and..."}, {"Time_Start": 1717.0, "Time_End": 1723.0, "Text": " So here's an example where we may have gone too far and trying to trace something back."}, {"Time_Start": 1723.0, "Time_End": 1733.0, "Text": " You'll notice that the range for this record is actually almost four addresses wide, four IP addresses wide."}, {"Time_Start": 1733.0, "Time_End": 1738.0, "Text": " So here's the record that's returned by the Wipe server."}, {"Time_Start": 1738.0, "Time_End": 1745.0, "Text": " So we tried connecting up to the machine that's got FTP open, or one of view, FTP."}, {"Time_Start": 1745.0, "Time_End": 1747.0, "Text": " Gee, I wonder how I got cracked?"}, {"Time_Start": 1747.0, "Time_End": 1750.0, "Text": " The ultra secure Wii FTP."}, {"Time_Start": 1750.0, "Time_End": 1752.0, "Text": " So we didn't find anything there."}, {"Time_Start": 1752.0, "Time_End": 1753.0, "Text": " So we didn't find anything there."}, {"Time_Start": 1753.0, "Time_End": 1756.0, "Text": " but trying some of the other IP addresses in the range,"}, {"Time_Start": 1756.0, "Time_End": 1758.0, "Text": " there's a web server on one of the other addresses."}, {"Time_Start": 1758.0, "Time_End": 1762.0, "Text": " And there it is, Portoadultos.com."}, {"Time_Start": 1762.0, "Time_End": 1765.0, "Text": " Click here."}, {"Time_Start": 1765.0, "Time_End": 1770.0, "Text": " Click here to see Las Titas de Epictony."}, {"Time_Start": 1770.0, "Time_End": 1778.0, "Text": " So here's the domain record for Portoadotos.com."}, {"Time_Start": 1778.0, "Time_End": 1782.0, "Text": " And we do get a webmaster at Porto Adoptorist.com"}, {"Time_Start": 1782.0, "Time_End": 1783.0, "Text": " as an email address."}, {"Time_Start": 1783.0, "Time_End": 1784.0, "Text": " here."}, {"Time_Start": 1784.0, "Time_End": 1793.0, "Text": " So there's times that you trace these back and, you know, through whatever, you know,"}, {"Time_Start": 1793.0, "Time_End": 1799.0, "Text": " by whatever reason, you still have no answer as to who might run this machine."}, {"Time_Start": 1799.0, "Time_End": 1805.0, "Text": " So you can always kind of move out and then take a step back and find out, you know,"}, {"Time_Start": 1805.0, "Time_End": 1810.0, "Text": " who runs the anonymous, autonomous system."}, {"Time_Start": 1810.0, "Time_End": 1813.0, "Text": " But my objective is always to try to try to, um,"}, {"Time_Start": 1813.0, "Time_End": 1821.0, "Text": " get the backtrace to be as specific as possible so we can make direct contact with whoever's actually responsible for the system."}, {"Time_Start": 1821.0, "Time_End": 1827.0, "Text": " But as Jason said, when that's not possible and you want to at least get a message to someone,"}, {"Time_Start": 1827.0, "Time_End": 1830.0, "Text": " you can use the autonomous system information."}, {"Time_Start": 1830.0, "Time_End": 1835.0, "Text": " In general, only a larger or midstream ISP is going to have BGP autonomous system number."}, {"Time_Start": 1835.0, "Time_End": 1840.0, "Text": " So you're not going to really be able to get extremely specific in many cases,"}, {"Time_Start": 1840.0, "Time_End": 1842.0, "Text": " but at least gives you an avenue to go somewhere."}, {"Time_Start": 1842.0, "Time_End": 1853.0, "Text": " So here's an AS example. This is a BGP looking glass look up on an IP address."}, {"Time_Start": 1853.0, "Time_End": 1860.0, "Text": " And I've circled the terminating AS record, or the terminating AS number 6197."}, {"Time_Start": 1860.0, "Time_End": 1865.0, "Text": " And this is the same command that we used previously where we got the no network found."}, {"Time_Start": 1865.0, "Time_End": 1869.0, "Text": " When the network is actually routable, the output will look like this."}, {"Time_Start": 1869.0, "Time_End": 1871.0, "Text": " So here's the full that we use."}, {"Time_Start": 1871.0, "Time_End": 1878.0, "Text": " Here's the full record from Aaron on the autonomous system, 6197."}, {"Time_Start": 1878.0, "Time_End": 1881.0, "Text": " The contact here."}, {"Time_Start": 1881.0, "Time_End": 1887.0, "Text": " Yeah, this is a great example of useful, not useful information."}, {"Time_Start": 1887.0, "Time_End": 1892.0, "Text": " I actually consulted for Bell South for a number of years in their early days."}, {"Time_Start": 1892.0, "Time_End": 1897.0, "Text": " And when I saw this record, I was dumbfounded that the contact person was listed working at Siemens."}, {"Time_Start": 1897.0, "Time_End": 1901.0, "Text": " And I was pretty sure there was no logical relationship between"}, {"Time_Start": 1901.0, "Time_End": 1906.0, "Text": " Siemens and Bell South, or than Bell South occasionally buys a phone switch from Siemens."}, {"Time_Start": 1906.0, "Time_End": 1913.0, "Text": " And so I had kind of, I had actually just punted on this, assumed that it was some kind of error."}, {"Time_Start": 1913.0, "Time_End": 1920.0, "Text": " And unbelievably, about four months later, I was standing on a train platform, having come from a meeting,"}, {"Time_Start": 1920.0, "Time_End": 1925.0, "Text": " and it was a guy standing next to me holding the same envelope that I had, so I assumed he had been at the same meeting."}, {"Time_Start": 1925.0, "Time_End": 1930.98, "Text": " Just, I had some time to spare, so I went up and chatted with him, and we started talking, and, you know, a few minutes in"}, {"Time_Start": 1931.0, "Time_End": 1934.0, "Text": " knew it, find out he works for Siemens, and I was like, what's your name?"}, {"Time_Start": 1934.0, "Time_End": 1936.0, "Text": " I was like, roller Dawson?"}, {"Time_Start": 1936.0, "Time_End": 1938.0, "Text": " I'm like, wait a minute, I need to talk to you."}, {"Time_Start": 1938.0, "Time_End": 1943.0, "Text": " So this is like the real example of extreme bat tracing."}, {"Time_Start": 1943.0, "Time_End": 1946.0, "Text": " I had to hunt a guy down to a train platform."}, {"Time_Start": 1946.0, "Time_End": 1953.0, "Text": " And this is another good example of the breakdown and problems with the Aaron records."}, {"Time_Start": 1953.0, "Time_End": 1959.0, "Text": " What essentially happened was he was originally, he did originally work for Bell South."}, {"Time_Start": 1959.0, "Time_End": 1965.0, "Text": " And when the AS number was registered, he used his contact handle."}, {"Time_Start": 1965.0, "Time_End": 1970.0, "Text": " You know, several years later, he left the company and went to work for Siemens,"}, {"Time_Start": 1970.0, "Time_End": 1975.0, "Text": " and he began allocating address space, assigning it to his handle main."}, {"Time_Start": 1975.0, "Time_End": 1981.0, "Text": " Well, there's no mechanism to say, you know, all these addresses that I used to administer,"}, {"Time_Start": 1981.0, "Time_End": 1985.0, "Text": " I don't work for that company anymore, so remove those references from me."}, {"Time_Start": 1985.0, "Time_End": 1989.0, "Text": " So, you know, we're sitting here having a person, you know, we don't know,"}, {"Time_Start": 1989.0, "Time_End": 1994.0, "Text": " doesn't even work for the company anymore, still being a contact person."}, {"Time_Start": 1994.0, "Time_End": 1996.0, "Text": " So that's what happened in this case."}, {"Time_Start": 1996.0, "Time_End": 2001.0, "Text": " It's really, it would have been much nicer if they had a role-based account here."}, {"Time_Start": 2001.0, "Time_End": 2005.0, "Text": " Willard, originally, like you said, he had his email address at Bell South."}, {"Time_Start": 2005.0, "Time_End": 2009.0, "Text": " He updated his personal record to show that he was working at Siemens."}, {"Time_Start": 2009.0, "Time_End": 2014.0, "Text": " And here we have an implied relationship between Siemens and Bell South, which really doesn't exist."}, {"Time_Start": 2014.0, "Time_End": 2018.0, "Text": " So here's another extreme technique you can use."}, {"Time_Start": 2018.0, "Time_End": 2025.0, "Text": " technique you can use if net bias is enabled on the machine, send them a wind pop-up message using NetSend."}, {"Time_Start": 2025.0, "Time_End": 2027.0, "Text": " Hello."}, {"Time_Start": 2027.0, "Time_End": 2030.0, "Text": " I haven't quite figured a technique to actually make this be successful."}, {"Time_Start": 2030.0, "Time_End": 2033.0, "Text": " I've probably sent about a hundred of these and never had the person contact me,"}, {"Time_Start": 2033.0, "Time_End": 2038.0, "Text": " but I have a feeling if the message was crafted in an intriguing way,"}, {"Time_Start": 2038.0, "Time_End": 2044.0, "Text": " such as, you know, this is the Microsoft Security Management Center in Washington."}, {"Time_Start": 2044.0, "Time_End": 2047.0, "Text": " Please call us immediately with this phone number that might work."}, {"Time_Start": 2047.0, "Time_End": 2054.0, "Text": " So this is one of my favorite back traces."}, {"Time_Start": 2054.0, "Time_End": 2060.0, "Text": " It's amazing how people are willing to name their machines,"}, {"Time_Start": 2060.0, "Time_End": 2063.0, "Text": " things that give away a tremendous amount of information."}, {"Time_Start": 2063.0, "Time_End": 2068.0, "Text": " Here we did an NBT stat to get an iteration of the machine names."}, {"Time_Start": 2068.0, "Time_End": 2073.0, "Text": " And the work group name is called Aduchi underscore Dorf."}, {"Time_Start": 2073.0, "Time_End": 2076.0, "Text": " I thought it was Dufus at first, but I saw it was Dorf."}, {"Time_Start": 2076.0, "Time_End": 2077.0, "Text": " And..."}, {"Time_Start": 2077.0, "Time_End": 2084.0, "Text": " I happen to also do a trace route to that address and could sort of see from the trace route that it looked like,"}, {"Time_Start": 2084.0, "Time_End": 2088.0, "Text": " given the CHI that it was probably in the Chicago area,"}, {"Time_Start": 2088.0, "Time_End": 2093.0, "Text": " and then just do a Google search for Ducci Dorff in Chicago,"}, {"Time_Start": 2093.0, "Time_End": 2098.0, "Text": " and bam, law firm of the Ducci Dorff in Black and Ship and a bunch of other names."}, {"Time_Start": 2098.0, "Time_End": 2102.0, "Text": " So there's an example where just this little tiny piece of information,"}, {"Time_Start": 2102.0, "Time_End": 2106.5, "Text": " if it's unique enough and not like John Smith,"}, {"Time_Start": 2106.5, "Time_End": 2108.0, "Text": " and you've got a little bit of information,"}, {"Time_Start": 2108.0, "Time_End": 2110.6, "Text": " you can actually trace that back to the machine lane."}, {"Time_Start": 2110.96, "Time_End": 2114.56, "Text": " Now, the sad part of the story is I called up this company just to give him a heads up,"}, {"Time_Start": 2115.0, "Time_End": 2119.2, "Text": " got the secretary, and said, you know, you talk to your security manager or your MIS manager,"}, {"Time_Start": 2119.34, "Time_End": 2120.64, "Text": " and she's like, who?"}, {"Time_Start": 2121.4, "Time_End": 2122.16, "Text": " We don't have one."}, {"Time_Start": 2123.0, "Time_End": 2125.0, "Text": " So I was like, okay, well, let me talk to your managing partner."}, {"Time_Start": 2125.34, "Time_End": 2129.66, "Text": " And I get Mr. Blankenship on the phone and just very nicely and politely explained to him that"}, {"Time_Start": 2129.66, "Time_End": 2132.62, "Text": " it looks like when those machines been hacked, you might want to have it checked out."}, {"Time_Start": 2132.92, "Time_End": 2133.94, "Text": " I'm not trying to sell you anything."}, {"Time_Start": 2134.52, "Time_End": 2136.48, "Text": " And his response was like, okay, thank you."}, {"Time_Start": 2136.5, "Time_End": 2137.5, "Text": " Have nice."}, {"Time_Start": 2137.5, "Time_End": 2138.5, "Text": " Have nice day."}, {"Time_Start": 2138.5, "Time_End": 2145.5, "Text": " So here's the, we've actually done a little bit of cross-checking of the domain record"}, {"Time_Start": 2145.5, "Time_End": 2150.5, "Text": " with what we found and found the responsible domain to be adlmb.com."}, {"Time_Start": 2150.5, "Time_End": 2160.5, "Text": " So, sometimes no matter what you do, there's nothing you can find out about an address."}, {"Time_Start": 2160.5, "Time_End": 2165.5, "Text": " So you find out what is the most directly upstream."}, {"Time_Start": 2165.5, "Time_End": 2171.5, "Text": " directly upstream address from the one you're looking to trace and see where that leads."}, {"Time_Start": 2171.5, "Time_End": 2177.5, "Text": " Sometimes it's only the service provider, but you never know."}, {"Time_Start": 2177.5, "Time_End": 2181.5, "Text": " It's really important to get as close as possible."}, {"Time_Start": 2181.5, "Time_End": 2185.5, "Text": " Here's a trace that, or it's a record that comes back from Ripe,"}, {"Time_Start": 2185.5, "Time_End": 2189.5, "Text": " showing that this address space is registered to Intercom Pro."}, {"Time_Start": 2189.5, "Time_End": 2193.5, "Text": " But the notify contact has a totally different domain."}, {"Time_Start": 2193.5, "Time_End": 2194.5, "Text": " That's tacta.net."}, {"Time_Start": 2194.5, "Time_End": 2195.5, "Text": " net."}, {"Time_Start": 2195.5, "Time_End": 2201.5, "Text": " So whenever you see disparate information like that, the people we really want to contact"}, {"Time_Start": 2201.5, "Time_End": 2204.5, "Text": " intercom pro."}, {"Time_Start": 2204.5, "Time_End": 2210.5, "Text": " So we do an MS lookup, looking for mail exchange records for Intercom Pro."}, {"Time_Start": 2210.5, "Time_End": 2213.5, "Text": " And as you can see, there are none."}, {"Time_Start": 2213.5, "Time_End": 2217.5, "Text": " No address records available for that either."}, {"Time_Start": 2217.5, "Time_End": 2221.5, "Text": " So here's a trace route to the IP."}, {"Time_Start": 2221.5, "Time_End": 2223.5, "Text": " Trace 22 is the IP that, Hop 22 is the IP."}, {"Time_Start": 2223.5, "Time_End": 2225.5, "Text": " Hop 22 is the end of the trace."}, {"Time_Start": 2225.5, "Time_End": 2228.5, "Text": " Hop 21 is the next IP just above it."}, {"Time_Start": 2228.5, "Time_End": 2232.5, "Text": " So we try looking at that for more information."}, {"Time_Start": 2232.5, "Time_End": 2241.5, "Text": " And we find that it's registered to TACTA net, which TACTA corresponds with the other address that we found."}, {"Time_Start": 2241.5, "Time_End": 2249.5, "Text": " So it looks like this is about as close as we're going to be able to get is TACTA.net."}, {"Time_Start": 2249.5, "Time_End": 2252.5, "Text": " So, conclusion."}, {"Time_Start": 2252.5, "Time_End": 2264.5, "Text": " It's surprising how many corporations have an isolationist view of the Internet."}, {"Time_Start": 2264.5, "Time_End": 2270.5, "Text": " And they're very concerned about protecting themselves on the inside, very hard firewall,"}, {"Time_Start": 2270.5, "Time_End": 2272.5, "Text": " crunchy exterior."}, {"Time_Start": 2272.5, "Time_End": 2275.5, "Text": " Sometimes they actually deploy stuff within their networks."}, {"Time_Start": 2275.5, "Time_End": 2280.5, "Text": " But, you know, back when Code Red and Memb and some of those other ones are hidden, you know,"}, {"Time_Start": 2280.5, "Time_End": 2282.5, "Text": " you'd see in the web logs, you know, you'd see in the web logs,"}, {"Time_Start": 2282.5, "Time_End": 2285.5, "Text": " direct evidence of all these machines that were compromised."}, {"Time_Start": 2285.5, "Time_End": 2291.5, "Text": " And most companies really, I mean, they don't make their money tracing these back and"}, {"Time_Start": 2291.5, "Time_End": 2296.5, "Text": " be nice to people and letting them know they're broken into, so they really don't do it."}, {"Time_Start": 2296.5, "Time_End": 2302.5, "Text": " And as a result, you have a tremendous number of already broken into machines just waiting for someone"}, {"Time_Start": 2302.5, "Time_End": 2306.5, "Text": " to grab control of them and point them, DDoS somebody."}, {"Time_Start": 2306.5, "Time_End": 2310.5, "Text": " Unfortunately, machines that are port scanning you today could be DDoS and you tomorrow."}, {"Time_Start": 2310.5, "Time_End": 2311.5, "Text": " That's the importance of..."}, {"Time_Start": 2311.5, "Time_End": 2313.5, "Text": " the importance of trying to backtrace them."}, {"Time_Start": 2313.5, "Time_End": 2317.5, "Text": " So you do read your logs, I hope."}, {"Time_Start": 2317.5, "Time_End": 2320.5, "Text": " There are services that can help you do it."}, {"Time_Start": 2320.5, "Time_End": 2323.5, "Text": " Lawrence's site, MyNet Watchmen, is excellent."}, {"Time_Start": 2323.5, "Time_End": 2325.5, "Text": " D-Shield is very similar."}, {"Time_Start": 2325.5, "Time_End": 2329.5, "Text": " If you don't like the idea of sending your logs outside of your network,"}, {"Time_Start": 2329.5, "Time_End": 2332.5, "Text": " you think that that might be insecure somehow,"}, {"Time_Start": 2332.5, "Time_End": 2335.5, "Text": " then there are solutions you can deploy internally to watch,"}, {"Time_Start": 2335.5, "Time_End": 2337.5, "Text": " LogCentry."}, {"Time_Start": 2337.5, "Time_End": 2340.5, "Text": " So..."}, {"Time_Start": 2340.5, "Time_End": 2341.5, "Text": " So..."}, {"Time_Start": 2341.5, "Time_End": 2343.5, "Text": " That's our presentation."}, {"Time_Start": 2343.5, "Time_End": 2345.5, "Text": " So do we have any questions?"}, {"Time_Start": 2345.5, "Time_End": 2348.5, "Text": " What's that?"}, {"Time_Start": 2348.5, "Time_End": 2352.5, "Text": " The presentation, all the slides are on the CD,"}, {"Time_Start": 2352.5, "Time_End": 2354.5, "Text": " and if you look at the notes view,"}, {"Time_Start": 2354.5, "Time_End": 2357.5, "Text": " I apologize, but the notes view is totally screwed up."}, {"Time_Start": 2357.5, "Time_End": 2360.5, "Text": " My PowerPoint skills are only this big."}, {"Time_Start": 2360.5, "Time_End": 2363.5, "Text": " So I have on my website,"}, {"Time_Start": 2363.5, "Time_End": 2367.5, "Text": " jason.net, that's j-a-es-o-n.net."}, {"Time_Start": 2367.5, "Time_End": 2370.5, "Text": " If you go to that site, it will take you"}, {"Time_Start": 2370.5, "Time_End": 2377.5, "Text": " it will take you into a place where you can actually download the latest and greatest presentation with all the notes fixed on it."}]}