{"segments": [{"Time_Start": 0.0, "Time_End": 7.0, "Text": " Is that better?"}, {"Time_Start": 7.0, "Time_End": 11.0, "Text": " Thanks for coming."}, {"Time_Start": 11.0, "Time_End": 17.0, "Text": " This panel, if you saw the correct listing, is called Disclosure, the mother of all vulnerabilities."}, {"Time_Start": 17.0, "Time_End": 22.0, "Text": " I have a couple of comments to issue first before we get going."}, {"Time_Start": 22.0, "Time_End": 29.0, "Text": " This morning, Simple Nomad asked an important question about this panel, so all of you who were at his talk and are here."}, {"Time_Start": 29.0, "Time_End": 30.0, "Text": " Thanks for coming."}, {"Time_Start": 30.0, "Time_End": 34.0, "Text": " He wanted to know why Microsoft is represented on a panel about what the feds think."}, {"Time_Start": 34.0, "Time_End": 37.0, "Text": " So let me address this right off."}, {"Time_Start": 37.0, "Time_End": 40.0, "Text": " First, this panel is not about what the feds think."}, {"Time_Start": 40.0, "Time_End": 44.0, "Text": " It's about what security people, researchers, the intelligence community,"}, {"Time_Start": 44.0, "Time_End": 48.0, "Text": " the executive branch of our government, and hopefully all of you think."}, {"Time_Start": 48.0, "Time_End": 53.0, "Text": " Second, Microsoft declined to come speak on this panel, so he's not here."}, {"Time_Start": 53.0, "Time_End": 58.980000000000004, "Text": " Secondly, I had an important call this morning for all of you who have been following security"}, {"Time_Start": 59.0, "Time_End": 63.0, "Text": " news the past couple of days and have been tracking the HP Snowsoft issue."}, {"Time_Start": 63.0, "Time_End": 69.0, "Text": " Adrian called me from Snowsoft this morning, and he asked me to read a statement from him"}, {"Time_Start": 69.0, "Time_End": 72.0, "Text": " that accurately reflects what we'll be talking about later."}, {"Time_Start": 72.0, "Time_End": 77.0, "Text": " He said he does not want the scene to be in an uproar as a result of what happened."}, {"Time_Start": 77.0, "Time_End": 83.0, "Text": " That Snowsoft did approach HP in a very blunt way, and he understands that now."}, {"Time_Start": 83.0, "Time_End": 88.0, "Text": " Similarly, corporations are used to being approached with subtlety."}, {"Time_Start": 88.0, "Time_End": 89.0, "Text": " He said, please."}, {"Time_Start": 89.0, "Time_End": 92.0, "Text": " ask that we all come together to find a middle ground."}, {"Time_Start": 92.0, "Time_End": 97.0, "Text": " The community, this community, needs to approach corporate America in a more positive light,"}, {"Time_Start": 97.0, "Time_End": 101.0, "Text": " and he hopes that what we talk about will help us do so."}, {"Time_Start": 101.0, "Time_End": 105.0, "Text": " So with that, I'll do my more formal introduction."}, {"Time_Start": 105.0, "Time_End": 109.0, "Text": " Everyone here is presumably involved in security in some way."}, {"Time_Start": 109.0, "Time_End": 114.0, "Text": " Today's panel will discuss responsible disclosure or vulnerability information."}, {"Time_Start": 114.0, "Time_End": 118.0, "Text": " This has become a hot topic lately as debate rages on the best way to safeguard computers."}, {"Time_Start": 118.0, "Time_End": 120.0, "Text": " to safeguard computers."}, {"Time_Start": 120.0, "Time_End": 124.0, "Text": " Global Intersec has been weighing in heavily in favor of individual responsibility."}, {"Time_Start": 124.0, "Time_End": 130.0, "Text": " There is a plausible and workable way to disclose vulnerability information which suits everyone,"}, {"Time_Start": 130.0, "Time_End": 134.0, "Text": " but it requires cooperation between all the involved communities."}, {"Time_Start": 134.0, "Time_End": 136.0, "Text": " Why is responsible disclosure important?"}, {"Time_Start": 136.0, "Time_End": 140.0, "Text": " Currently, most security information either gets dumped onto the Internet"}, {"Time_Start": 140.0, "Time_End": 143.0, "Text": " or sucked into the black hole of corporate America."}, {"Time_Start": 143.0, "Time_End": 146.0, "Text": " The path to real security is found in the middle ground."}, {"Time_Start": 146.0, "Time_End": 148.0, "Text": " Such a course must enable software company,"}, {"Time_Start": 148.0, "Time_End": 152.0, "Text": " to create patches by giving them sufficient information about the problem,"}, {"Time_Start": 152.0, "Time_End": 155.0, "Text": " but also ensuring that the information does not fall into the wrong hands,"}, {"Time_Start": 155.0, "Time_End": 158.0, "Text": " and that something is done about the problem."}, {"Time_Start": 158.0, "Time_End": 162.0, "Text": " And although web defacements are annoying, I'm speaking more of corporate espionage,"}, {"Time_Start": 162.0, "Time_End": 165.0, "Text": " intellectual property theft, augmentations of terrorism, etc."}, {"Time_Start": 165.0, "Time_End": 169.0, "Text": " Why do the losses due to attacks increase every year?"}, {"Time_Start": 169.0, "Time_End": 172.0, "Text": " Why the viruses using known exploits promulgate so rapidly?"}, {"Time_Start": 172.0, "Time_End": 176.0, "Text": " Why are advisories released immediately after vendor notification?"}, {"Time_Start": 176.0, "Time_End": 178.0, "Text": " A large part of the answer is,"}, {"Time_Start": 178.0, "Time_End": 183.0, "Text": " is the current practices and lack of communication between computers and communities."}, {"Time_Start": 183.0, "Time_End": 188.0, "Text": " The most major vulnerability still affecting the entire internet is disclosure itself."}, {"Time_Start": 188.0, "Time_End": 191.0, "Text": " Bringing everyone together is a step-by-step process."}, {"Time_Start": 191.0, "Time_End": 197.0, "Text": " I hope that today's panel will help us all move forward into a relatively more secure and responsible computing age."}, {"Time_Start": 197.0, "Time_End": 201.0, "Text": " To that end, please allow me to briefly introduce our panel members."}, {"Time_Start": 201.0, "Time_End": 207.0, "Text": " To my left is Dick Schaefer, Deputy Director of Information Assurance at the National Security Agency."}, {"Time_Start": 207.0, "Time_End": 211.0, "Text": " agency. To his left is Marcus Sacks, Director for Communication,"}, {"Time_Start": 211.0, "Time_End": 216.0, "Text": " Infrastructure Protection Office of Cyber Space Security at the White House."}, {"Time_Start": 216.0, "Time_End": 222.0, "Text": " To his left is Sammy Sagerie, Senior Principal Scientist at the Strategic Research Institute."}, {"Time_Start": 222.0, "Time_End": 228.0, "Text": " To his left is Martin Linder, incident handling team leader for CERT Coordination Center."}, {"Time_Start": 228.0, "Time_End": 233.0, "Text": " And finally, on the far end is Tom Parker, Director of Research for Global Intersec."}, {"Time_Start": 237.0, "Time_End": 244.0, "Text": " Each of the panelists is going to give a very brief comment on disclosure,"}, {"Time_Start": 244.0, "Time_End": 249.0, "Text": " then we'll talk about some pre-suggested questions, and then we'll take questions from the audience."}, {"Time_Start": 249.0, "Time_End": 251.0, "Text": " Mr. Schaefer?"}, {"Time_Start": 251.0, "Time_End": 254.0, "Text": " Thank you, Mike."}, {"Time_Start": 254.0, "Time_End": 265.0, "Text": " Just a statement that two years ago, I sat on a panel up here with then Assistant Secretary of Art Money,"}, {"Time_Start": 265.0, "Time_End": 270.0, "Text": " And we had somewhat of a similar discussion."}, {"Time_Start": 270.0, "Time_End": 279.0, "Text": " Since that time, we've had probably one of the most malicious and egregious events that this country has ever seen."}, {"Time_Start": 279.0, "Time_End": 281.0, "Text": " That was totally physical."}, {"Time_Start": 281.0, "Time_End": 291.0, "Text": " And underlying what might come next could be something that also comes along a cyber dimension."}, {"Time_Start": 291.0, "Time_End": 294.0, "Text": " And what would be even worse would be some combination of a cyber dimension."}, {"Time_Start": 294.0, "Time_End": 297.0, "Text": " combination events, both physical and cyber."}, {"Time_Start": 297.0, "Time_End": 307.5, "Text": " And so underlying our ability to understand what we've got in the security technology that everyone is using,"}, {"Time_Start": 307.5, "Time_End": 315.0, "Text": " where the vulnerabilities are, how those things can be fixed, the more that we're able to communicate,"}, {"Time_Start": 315.0, "Time_End": 323.98, "Text": " the more we're able to talk, and the we're really you all out there, everyone else who is finding"}, {"Time_Start": 324.0, "Time_End": 330.0, "Text": " deficiencies or vulnerabilities in products they're using, and communicating those"}, {"Time_Start": 330.0, "Time_End": 336.0, "Text": " to the vendor community, hopefully the sooner that those things get fixed."}, {"Time_Start": 336.0, "Time_End": 342.0, "Text": " It doesn't always happen quickly, sometimes it doesn't even happen."}, {"Time_Start": 342.0, "Time_End": 350.0, "Text": " But I don't think that should diminish our sense of urgency in trying to address the issues"}, {"Time_Start": 350.0, "Time_End": 353.0, "Text": " both within this community, within the national security."}, {"Time_Start": 353.0, "Time_End": 357.34, "Text": " the national security community and within the vendor community as well."}, {"Time_Start": 360.76, "Time_End": 365.5, "Text": " Thanks, Dick. Thanks, Mike. Good afternoon. My name is Mark Sox. I know a lot of you,"}, {"Time_Start": 365.5, "Time_End": 374.08, "Text": " and I'm glad to see many of your familiar faces here back in the heat of the desert. Since September 11th, of course, many things have changed."}, {"Time_Start": 374.24, "Time_End": 379.18, "Text": " Two new offices have appeared at the White House, the Office of Homeland Security that many of you are quite familiar with."}, {"Time_Start": 379.18, "Time_End": 382.98, "Text": " And of course, the Department of Homeland Security is in legislation."}, {"Time_Start": 383.0, "Time_End": 386.0, "Text": " at the moment. We do hope to see that occur by the end of the year."}, {"Time_Start": 386.0, "Time_End": 391.0, "Text": " The office I belong to is the Office of Cyber Space Security, probably well known amongst this community,"}, {"Time_Start": 391.0, "Time_End": 397.0, "Text": " but not well known amongst the rest of the nation, certainly not as well known as the Homeland Security Office."}, {"Time_Start": 397.0, "Time_End": 399.0, "Text": " We're very small, 16 people."}, {"Time_Start": 399.0, "Time_End": 405.0, "Text": " Mr. Richard Clark, who is the President's Special Advisor for Cyber Space Security, heads up the group,"}, {"Time_Start": 405.0, "Time_End": 409.0, "Text": " and is also the Chairman of the President's Critical Infrastructure Protection Board,"}, {"Time_Start": 409.0, "Time_End": 412.0, "Text": " a board consisting of 23 members of various federal organizations."}, {"Time_Start": 412.0, "Time_End": 421.0, "Text": " organizations who meet periodically to work together with industry on security type issues that affect the critical infrastructures."}, {"Time_Start": 421.0, "Time_End": 435.0, "Text": " One key piece that we're working on is a strategy for cyberspace security, which is currently in a final draft form being circulated amongst the federal agencies for concurrence and amongst some members of industry."}, {"Time_Start": 435.0, "Time_End": 441.0, "Text": " We should see a public version, the latter part of September. It'll be published both as paper,"}, {"Time_Start": 441.0, "Time_End": 448.0, "Text": " CD-ROM and on a website, and when it does come out, there'll be links from Whitehouse.gov that can take you there."}, {"Time_Start": 448.0, "Time_End": 451.0, "Text": " It's fairly lengthy, currently well over 500 pages."}, {"Time_Start": 451.0, "Time_End": 458.0, "Text": " What I encourage you to do, please, is take a look at it when it comes out and give us your feedback as quickly and as accurately as possible."}, {"Time_Start": 458.0, "Time_End": 469.0, "Text": " We'd like to have a second version out, a little more accurate version, by February of next year, and we'll continue to redo and correct and make better this strategy."}, {"Time_Start": 469.0, "Time_End": 473.0, "Text": " because we understand, as you do, that cyberspace changes over time."}, {"Time_Start": 473.0, "Time_End": 477.0, "Text": " One of the things you will see addressed, of course, is vulnerability to disclosure."}, {"Time_Start": 477.0, "Time_End": 483.0, "Text": " Many of you, I'm sure, were present Wednesday morning when Mr. Clark gave his keynote address at Black Hat."}, {"Time_Start": 483.0, "Time_End": 485.0, "Text": " He briefly talked about disclosure."}, {"Time_Start": 485.0, "Time_End": 490.0, "Text": " Unfortunately, some of his comments were taken a little bit out of context and some press reporting."}, {"Time_Start": 490.0, "Time_End": 494.0, "Text": " What I want to reiterate is our position on this is that we do believe in disclosure,"}, {"Time_Start": 494.0, "Time_End": 498.0, "Text": " but what we believe in is responsible and ethical and legal disclosure."}, {"Time_Start": 498.0, "Time_End": 498.98, "Text": " And what this involves, of course,"}, {"Time_Start": 499.0, "Time_End": 504.0, "Text": " is if you're a researcher or if you're a person who enjoys looking for these types of things,"}, {"Time_Start": 504.0, "Time_End": 506.0, "Text": " do it within the scope of the law."}, {"Time_Start": 506.0, "Time_End": 509.0, "Text": " And our recommendation, of course, is to work with the vendors as best as possible."}, {"Time_Start": 509.0, "Time_End": 516.0, "Text": " We do recognize many vendors may or may not be receptive to these types of this type of input."}, {"Time_Start": 516.0, "Time_End": 520.0, "Text": " If that fails, Search CC and other third parties are available."}, {"Time_Start": 520.0, "Time_End": 523.0, "Text": " And if that fails, we'll try and help you as best as possible."}, {"Time_Start": 523.0, "Time_End": 528.98, "Text": " What we would like to try and avoid, of course, is just the blatant open publication of vulnerabilities next"}, {"Time_Start": 529.0, "Time_End": 531.0, "Text": " without giving the vendors a fair shake."}, {"Time_Start": 531.0, "Time_End": 537.0, "Text": " And we'll leave it at that, and I'm sure we'll be having quite a bit more lively conversation as the hour goes long."}, {"Time_Start": 537.0, "Time_End": 544.0, "Text": " My name is Sammy Sajri, and I represent the research committee."}, {"Time_Start": 544.0, "Time_End": 551.0, "Text": " In particular, my background is on trusted systems design, figuring out how to design operating systems and distributed networks securely."}, {"Time_Start": 551.0, "Time_End": 554.0, "Text": " I'd like to start with a story."}, {"Time_Start": 554.0, "Time_End": 558.98, "Text": " A long time ago, some things about"}, {"Time_Start": 559.0, "Time_End": 571.0, "Text": " The physicians observed that during the polio epidemic that a lot of the children in the cities were getting much harder hit by the polio epidemic than the kids in the country."}, {"Time_Start": 571.0, "Time_End": 577.0, "Text": " And they were quite disturbed by this and they were doing correlations among factors and they couldn't quite figure it out."}, {"Time_Start": 577.0, "Time_End": 586.0, "Text": " Well, they later, as we learn more about immunity, they figured out that the difference was that the children in the country were playing in the dirt."}, {"Time_Start": 586.0, "Time_End": 591.2, "Text": " They were breathing dirt, and when they were out in the backyard, some of the kids were eating dirt."}, {"Time_Start": 591.7, "Time_End": 594.94, "Text": " And this was actually a very, very important observation."}, {"Time_Start": 596.24, "Time_End": 603.4, "Text": " It was paradoxical that the kids in the city were getting harder hit because medical care was better and it was a more sterile environment."}, {"Time_Start": 603.9, "Time_End": 612.3, "Text": " But what turned out to be very important is that you have to have exposure to the bad things, the bad elements,"}, {"Time_Start": 612.3, "Time_End": 615.5, "Text": " and for your immunity system to be able to compensate."}, {"Time_Start": 616.0, "Time_End": 621.14, "Text": " So as we learn more about immunity, we learned that it's a very intricate and beautiful system,"}, {"Time_Start": 621.26, "Time_End": 624.54, "Text": " and it's one of the most sophisticated mechanisms in the body."}, {"Time_Start": 625.46, "Time_End": 630.82, "Text": " And one thing we learned is that the first step in that is what's called a macrophage."}, {"Time_Start": 631.74, "Time_End": 640.06, "Text": " So a macrophage is the thing that encounters the bacteria or agent when it enters your body,"}, {"Time_Start": 640.54, "Time_End": 645.98, "Text": " and it slices it up, and it presents it to the rest of the immunity system as,"}, {"Time_Start": 646.0, "Time_End": 647.66, "Text": " the bad thing that it should target."}, {"Time_Start": 648.62, "Time_End": 651.9, "Text": " Okay, so you might be asking, okay, am I in the wrong conference right now?"}, {"Time_Start": 652.06, "Time_End": 654.08, "Text": " The immunity conference is down the hall."}, {"Time_Start": 654.5, "Time_End": 661.58, "Text": " But it actually turns out to be extremely relevant here because this is exactly the role that I see"}, {"Time_Start": 661.58, "Time_End": 666.56, "Text": " the hackers and the people who are doing research in finding these vulnerabilities."}, {"Time_Start": 666.56, "Time_End": 669.5, "Text": " They are the macrophages of the community."}, {"Time_Start": 669.72, "Time_End": 673.86, "Text": " They are the ones that are finding these vulnerabilities, presenting it to the rest of the"}, {"Time_Start": 673.86, "Time_End": 679.16, "Text": " community system, which is the national critical infrastructure and every other part"}, {"Time_Start": 679.16, "Time_End": 682.86, "Text": " of our infrastructure so that we have a chance to react to it."}, {"Time_Start": 682.86, "Time_End": 691.86, "Text": " You have to understand that my perspective here is that a very, very bad event is going to happen in cyberspace, and it's eminent."}, {"Time_Start": 691.86, "Time_End": 698.86, "Text": " I mean, there's every indication from everything going on and every, you know, major government report is"}, {"Time_Start": 698.86, "Time_End": 703.36, "Text": " strongly suggesting that a very, very bad event will happen sometime because we're very vulnerable."}, {"Time_Start": 703.36, "Time_End": 711.96, "Text": " And so given that vulnerability, as we sort of run the trade-offs between disclosure and limited disclosure and non-disclosure,"}, {"Time_Start": 712.36, "Time_End": 720.86, "Text": " what I'm here to do is advocate that this disclosure process is critical to the immunity process or the analogy of the immunity process that we have,"}, {"Time_Start": 720.86, "Time_End": 732.66, "Text": " and that this macrophage function, this cyber macrophage function that's being performed is important in preparation for what will likely become a very, very devastating event in cyberspace in the very near future."}, {"Time_Start": 732.66, "Time_End": 740.42, "Text": " So I am much, much more leaning towards being better prepared by having the macrophages present these vulnerabilities to the rest of the community."}, {"Time_Start": 744.5, "Time_End": 756.0, "Text": " Hi, I'm Marty Linder from the SERT Coordination Center, and I think what I first want to say is we are a coordination center, and our goal is to coordinate with the people reporting the vulnerabilities, the vendors, and the public."}, {"Time_Start": 756.56, "Time_End": 762.1999999999999, "Text": " We get thousands of vulnerability reports a year, and each one of them makes it to the vendor."}, {"Time_Start": 762.66, "Time_End": 769.26, "Text": " Not all of them become advisories on our part, because if we put out 1,000 advisories a year, no one would get any work done."}, {"Time_Start": 769.76, "Time_End": 778.16, "Text": " Hopefully, the vendors are working with us to take some of these vulnerabilities, roll them into patches that come out in the case of Microsoft and Service Packs,"}, {"Time_Start": 778.66, "Time_End": 784.68, "Text": " because they're not that risky at the time to make it into an advisory from our point of view."}, {"Time_Start": 784.9399999999999, "Time_End": 791.4399999999999, "Text": " And that goes into the whole discussion of vulnerability metrics and what's a bad vulnerability versus one that can be fixed later."}, {"Time_Start": 791.44, "Time_End": 793.6, "Text": " and I'm sure there'll be a debate about that."}, {"Time_Start": 794.5600000000001, "Time_End": 798.8000000000001, "Text": " The other thing to point out is a lot of the vulnerabilities aren't with a single vendor."}, {"Time_Start": 799.96, "Time_End": 805.62, "Text": " I know if there's a bug in Microsoft Office, the vendor that's going to fix it is Microsoft."}, {"Time_Start": 806.2600000000001, "Time_End": 813.0600000000001, "Text": " But if you take the Apache vulnerabilities of the last couple months, yes, Apache source needs to be fixed,"}, {"Time_Start": 813.1400000000001, "Time_End": 817.48, "Text": " but there's a lot of companies out there that are building their products based on Apache."}, {"Time_Start": 818.2800000000001, "Time_End": 821.32, "Text": " And we try to coordinate with them also."}, {"Time_Start": 821.44, "Time_End": 835.3800000000001, "Text": " So that when Apache puts out a patch, the vendors that are using that source have an opportunity before it becomes public to build their version of the binaries so that when the advisory goes out or it becomes public, everyone's ready to go."}, {"Time_Start": 835.74, "Time_End": 838.24, "Text": " And I think that's an important thing to remember about a vulnerability."}, {"Time_Start": 838.84, "Time_End": 841.7800000000001, "Text": " There isn't necessarily just one vendor involved all the time."}, {"Time_Start": 845.36, "Time_End": 848.86, "Text": " Hi, I'm Tom Parker, Director of Research for Global Insec."}, {"Time_Start": 848.86, "Time_End": 851.92, "Text": " Other of you have known me as MRX."}, {"Time_Start": 852.6800000000001, "Time_End": 855.62, "Text": " I'll keep this short because we have a lot to get through today."}, {"Time_Start": 857.62, "Time_End": 861.42, "Text": " There are a lot of people here from a lot of different communities and different backgrounds,"}, {"Time_Start": 861.58, "Time_End": 863.96, "Text": " whether it would be government, grey hat, black hat, white hat."}, {"Time_Start": 865.3000000000001, "Time_End": 871.6, "Text": " I think the key to all of this is working together."}, {"Time_Start": 872.0600000000001, "Time_End": 878.76, "Text": " And without working together, we can't take advantage of the diversity of all the backgrounds and experiences that we've had."}, {"Time_Start": 878.86, "Time_End": 889.86, "Text": " And I think that's the main reason we put this panel together to try and discuss how we can better communicate and work together to make a more secure internet."}, {"Time_Start": 893.86, "Time_End": 905.24, "Text": " So the underlying question behind vulnerability research and disclosure is what does responsible disclosure really mean?"}, {"Time_Start": 905.24, "Time_End": 908.84, "Text": " Lots of people have very disparate opinions about."}, {"Time_Start": 908.86, "Time_End": 910.54, "Text": " what constitutes responsibility."}, {"Time_Start": 911.1800000000001, "Time_End": 917.02, "Text": " So I'm going to pose that question to each of the communities represented up here and hopefully"}, {"Time_Start": 917.02, "Time_End": 921.24, "Text": " later stimulates some discussion among the communities represented in front of us."}, {"Time_Start": 921.24, "Time_End": 924.42, "Text": " So what does responsible disclosure mean to each of you?"}, {"Time_Start": 928.1800000000001, "Time_End": 938.0600000000001, "Text": " Well, I think primarily responsible disclosure means not allowing vulnerabilities which could impact"}, {"Time_Start": 938.0600000000001, "Time_End": 945.2, "Text": " critical national systems fall under the hands of those people who would use that information"}, {"Time_Start": 945.2, "Time_End": 954.84, "Text": " to take advantage and do harm either to business which reflects into the economic health of the nation"}, {"Time_Start": 954.84, "Time_End": 958.84, "Text": " or to the national security structure within the nation itself."}, {"Time_Start": 959.62, "Time_End": 968.0200000000001, "Text": " And so it's it really is protecting that information which is critical to the"}, {"Time_Start": 968.0600000000001, "Time_End": 971.7600000000001, "Text": " livelihood of everyone in this room."}, {"Time_Start": 975.1800000000001, "Time_End": 978.22, "Text": " My comments, of course, will echo exactly what Dick said."}, {"Time_Start": 978.3000000000001, "Time_End": 980.5400000000001, "Text": " Critical infrastructure protection is what we're about."}, {"Time_Start": 981.2800000000001, "Time_End": 987.0200000000001, "Text": " When vulnerabilities are found in public software, it may appear at first that it's not a big deal."}, {"Time_Start": 987.5600000000001, "Time_End": 993.5400000000001, "Text": " If we check into it, we find that in fact, common off-the-shelf, Microsoft, Oracle, Cisco,"}, {"Time_Start": 993.7, "Time_End": 998.0400000000001, "Text": " doesn't matter, widely used within critical infrastructures, probably far more than"}, {"Time_Start": 998.0600000000001, "Time_End": 1002.3000000000001, "Text": " we expect it is. Responsibility, of course, is a two-way street. It's the responsibility"}, {"Time_Start": 1002.3000000000001, "Time_End": 1007.7600000000001, "Text": " of the person or a group who finds some type of vulnerability or weakness to let the vendor know."}, {"Time_Start": 1007.7600000000001, "Time_End": 1012.5600000000001, "Text": " It's also the responsibility of the vendor to do something about it and not bury it and wait"}, {"Time_Start": 1012.5600000000001, "Time_End": 1014.82, "Text": " a year or more before patching the software."}, {"Time_Start": 1018.82, "Time_End": 1027.66, "Text": " I've always been, I've favored the model where you give the vendor a certain amount of time to respond."}, {"Time_Start": 1028.06, "Time_End": 1034.8999999999999, "Text": " to put out a patch and then you disclose and what that time is is subject to debate you know some"}, {"Time_Start": 1034.8999999999999, "Time_End": 1039.8999999999999, "Text": " people use three months six months 30 minutes you know somewhere between 30 minutes and six months"}, {"Time_Start": 1039.8999999999999, "Time_End": 1046.6599999999999, "Text": " is probably the right number the other side of that is is I also believe that part of responsible"}, {"Time_Start": 1046.6599999999999, "Time_End": 1051.5, "Text": " disclosure is the responsibility to disclose and I know that's sort of the opposite side of that and"}, {"Time_Start": 1051.5, "Time_End": 1056.98, "Text": " then I certainly believe in the aspect of trying to do it in a way that minimizes damage but I"}, {"Time_Start": 1056.98, "Time_End": 1061.1200000000001, "Text": " think those who are discovering vulnerabilities have an important role to play in our"}, {"Time_Start": 1061.1200000000001, "Time_End": 1066.08, "Text": " critical infrastructure protection by this immunological response, the presentation of the"}, {"Time_Start": 1066.08, "Time_End": 1070.72, "Text": " vulnerabilities to the community, the responsible presentation for sure, but that"}, {"Time_Start": 1070.72, "Time_End": 1077.22, "Text": " presentation and that we are responsible to make sure that that gets nurtured and taken"}, {"Time_Start": 1077.22, "Time_End": 1081.92, "Text": " care of and that those who are finding them are responsible to make sure they come to light."}, {"Time_Start": 1085.22, "Time_End": 1086.96, "Text": " I think I have to agree with what Sam"}, {"Time_Start": 1086.98, "Time_End": 1091.24, "Text": " said it's unclear as to what the right amount of time is for vulnerability"}, {"Time_Start": 1091.24, "Time_End": 1099.16, "Text": " disclosure right now our search CC it's basically a 45-day disclosure policy but"}, {"Time_Start": 1099.16, "Time_End": 1105.58, "Text": " if the vendors in good faith are working on a patch we will adjust that time as"}, {"Time_Start": 1105.58, "Time_End": 1110.18, "Text": " long as we are not seeing any active exploitation of the vulnerability the moment we"}, {"Time_Start": 1110.18, "Time_End": 1115.24, "Text": " see active exploitation of the vulnerability we will disclose as much information as we"}, {"Time_Start": 1115.24, "Time_End": 1119.1, "Text": " can so that people can defend themselves against the exploit that's underway."}, {"Time_Start": 1120.1, "Time_End": 1124.68, "Text": " And I think that's an important key there, that if there is active exploitation of a vulnerability,"}, {"Time_Start": 1124.68, "Time_End": 1129.86, "Text": " you need to get the word out at some level so people can defend themselves against that vulnerability."}, {"Time_Start": 1133.02, "Time_End": 1139.32, "Text": " I think responsible disclosure, what it is, depends very much on your personal outlook on things."}, {"Time_Start": 1139.86, "Time_End": 1145.2, "Text": " Some researchers think that it's certainly not irresponsible to openly disclose exploits to bug track"}, {"Time_Start": 1145.24, "Time_End": 1150.8, "Text": " another fora. Some unnamed corporations think it's okay to patch vulnerabilities,"}, {"Time_Start": 1150.8, "Time_End": 1156.58, "Text": " he's not telling anyone about it and included in the next update. I think responsible"}, {"Time_Start": 1156.58, "Time_End": 1164.44, "Text": " disclosure is finding a happy middle between all of those grounds. And as Marcus said, while"}, {"Time_Start": 1164.44, "Time_End": 1171.42, "Text": " still protecting critical infrastructure, I think it's important that even though website"}, {"Time_Start": 1171.42, "Time_End": 1175.22, "Text": " defacements and other annoyances do get a little."}, {"Time_Start": 1175.24, "Time_End": 1180.92, "Text": " a little boring. I think it's important that we, our first priority is to protect the systems"}, {"Time_Start": 1180.92, "Time_End": 1182.66, "Text": " which surround our country."}, {"Time_Start": 1188.84, "Time_End": 1193.94, "Text": " So we heard a little bit about what constitutes responsible disclosure."}, {"Time_Start": 1194.54, "Time_End": 1200.54, "Text": " So now I'd like to flip the coin over and ask, what threats do you see as a result of current trends"}, {"Time_Start": 1200.54, "Time_End": 1204.8, "Text": " of irresponsibility? Why is responsible disclosure necessary and why is now,"}, {"Time_Start": 1205.24, "Time_End": 1207.9, "Text": " the right time to be pursuing such a course."}, {"Time_Start": 1214.9, "Time_End": 1218.06, "Text": " I think we read about this in the paper every day."}, {"Time_Start": 1218.78, "Time_End": 1225.42, "Text": " I think we just don't look at what the aggregation of those threats really might mean."}, {"Time_Start": 1226.56, "Time_End": 1235.02, "Text": " Relative to what I may have visibility into or what we may be visibility into or what we may be concerned"}, {"Time_Start": 1235.02, "Time_End": 1239.02, "Text": " about and I surely can't address in a forum like this."}, {"Time_Start": 1240.2, "Time_End": 1251.34, "Text": " But suffice it to say that it isn't anything much more terribly impactful than what's read in the paper"}, {"Time_Start": 1251.34, "Time_End": 1257.16, "Text": " every day. It's clearly just at a much broader scale."}, {"Time_Start": 1259.2, "Time_End": 1263.3, "Text": " The question, of course, is why is it important now? Why wasn't it important 30 years ago?"}, {"Time_Start": 1263.3799999999999, "Time_End": 1265.0, "Text": " Why wasn't it important during the civil?"}, {"Time_Start": 1265.02, "Time_End": 1269.98, "Text": " war? Well, you know, it's always been important. What has, of course, changed is the way"}, {"Time_Start": 1269.98, "Time_End": 1274.54, "Text": " we do business. We've been able to communicate globally for over 100 years. It goes back to the"}, {"Time_Start": 1274.54, "Time_End": 1278.98, "Text": " telegraph and before. But today, I don't think there's a household out there here, at least"}, {"Time_Start": 1278.98, "Time_End": 1282.12, "Text": " in the United States, it doesn't have a computer, or at least some type of internet connection."}, {"Time_Start": 1282.12, "Time_End": 1288.58, "Text": " And if you go globally, it's the numbers are quite high and increasing each year. Security awareness is"}, {"Time_Start": 1288.58, "Time_End": 1295.0, "Text": " also up. And now we're getting well past the point of critical mass to where pretty much"}, {"Time_Start": 1295.02, "Time_End": 1300.06, "Text": " any person, and I think all of you are aware of this, can download any type of exploit,"}, {"Time_Start": 1300.2, "Time_End": 1306.26, "Text": " vulnerability, et cetera. The script kiddies run rampant. These sites are well known. The concept of"}, {"Time_Start": 1306.26, "Time_End": 1311.78, "Text": " keeping something hidden for a couple of years is a government secret while we quickly or behind the scenes"}, {"Time_Start": 1311.78, "Time_End": 1317.24, "Text": " work out a solution. Those days are gone. We now measure flash to bang in a matter of hours"}, {"Time_Start": 1317.24, "Time_End": 1323.02, "Text": " or days from the time something is discovered to the time a working exploit is out. That time is"}, {"Time_Start": 1323.02, "Time_End": 1327.32, "Text": " getting almost down to zero. And I think there's even been a couple of cases where we've"}, {"Time_Start": 1327.32, "Time_End": 1333.3, "Text": " seen exploits out before the vulnerability was even released, which would be like a negative day"}, {"Time_Start": 1333.3, "Time_End": 1339.32, "Text": " rather than an O day. So, yes, time is right now. We're past the point where we can keep"}, {"Time_Start": 1339.32, "Time_End": 1341.16, "Text": " talking about it, and it's time to do something about it."}, {"Time_Start": 1344.66, "Time_End": 1350.72, "Text": " My perspective is that in the recent time, certainly within the last five years, we have become"}, {"Time_Start": 1350.72, "Time_End": 1353.0, "Text": " incredibly dependent on our critical infrastructure."}, {"Time_Start": 1353.02, "Time_End": 1358.34, "Text": " so much so that our society now, as we know it, it depends on it."}, {"Time_Start": 1358.74, "Time_End": 1364.06, "Text": " And so what you can do in that infrastructure has become increasingly dangerous."}, {"Time_Start": 1364.7, "Time_End": 1367.24, "Text": " And so our vulnerability is extraordinary high."}, {"Time_Start": 1367.24, "Time_End": 1374.0, "Text": " And so when you have a high dependence on an increasingly brittle infrastructure, that suggests caution."}, {"Time_Start": 1374.2, "Time_End": 1379.08, "Text": " And so this is a good time to talk about what caution means and how you balance the need"}, {"Time_Start": 1379.08, "Time_End": 1382.72, "Text": " to take us from a brittle system to a more robust one."}, {"Time_Start": 1383.02, "Time_End": 1387.9, "Text": " and being careful with the brutal system we have so that we can all benefit from what that system provides us today."}, {"Time_Start": 1391.1, "Time_End": 1395.6399999999999, "Text": " I think if you go back some number of years ago, 10 or 15 years ago,"}, {"Time_Start": 1396.1399999999999, "Time_End": 1401.1399999999999, "Text": " most computers out there were managed by professionals that took care of the computer."}, {"Time_Start": 1401.6399999999999, "Time_End": 1404.74, "Text": " Now we have home computers all over the place that really aren't managed."}, {"Time_Start": 1405.22, "Time_End": 1412.62, "Text": " So we need to, when a vulnerability is discovered, minimize the impact to the people that don't know how to manage their computers."}, {"Time_Start": 1413.02, "Time_End": 1428.12, "Text": " So we need to, when we discover vulnerability, we need to get the problem resolved and then somehow come up with a better method of deploying those patches so that the people that don't manage computers for a living are not the biggest part of our problem."}, {"Time_Start": 1428.12, "Time_End": 1435.02, "Text": " All of these unprotected home machines and university computers that can be leveraged against our critical infrastructure."}, {"Time_Start": 1439.16, "Time_End": 1442.5, "Text": " I think one of the things that springs to mind first is"}, {"Time_Start": 1442.5, "Time_End": 1444.92, "Text": " the growing risk of internet-borne worms."}, {"Time_Start": 1445.78, "Time_End": 1449.12, "Text": " Over the last two years, we've seen a growing number of them."}, {"Time_Start": 1449.88, "Time_End": 1454.84, "Text": " And I think in the future we'll see the time between a vulnerability being released"}, {"Time_Start": 1454.84, "Time_End": 1461.12, "Text": " and the time to seeing the worm that exploits that vulnerability shorten."}, {"Time_Start": 1462.52, "Time_End": 1465.76, "Text": " Case study, the Apache exploit for free BSD."}, {"Time_Start": 1467.16, "Time_End": 1472.38, "Text": " The Sculper worm, which came out, I think, about 12 days after the original exploit was posted to BugTrack,"}, {"Time_Start": 1472.5, "Time_End": 1479.36, "Text": " It was very poorly written, however, it came at a time where people hadn't finished patching their systems yet."}, {"Time_Start": 1479.86, "Time_End": 1483.8, "Text": " Some people still weren't convinced that it was exploitable on non-64-bit platforms."}, {"Time_Start": 1484.62, "Time_End": 1488.64, "Text": " If it was done well, it could have caused a lot more damage than it did."}, {"Time_Start": 1489.44, "Time_End": 1492.76, "Text": " And I think that's one of the things we need to look at."}, {"Time_Start": 1495.96, "Time_End": 1502.34, "Text": " So my next question, before we open this up to the floor, is really the core of what this is really the core of what this is."}, {"Time_Start": 1502.5, "Time_End": 1508.88, "Text": " is about, and I'll ask the panelists, how can all the different communities represented here"}, {"Time_Start": 1508.88, "Time_End": 1516.3, "Text": " and even those that aren't represented here work together to reach some sort of ideal disclosure model?"}, {"Time_Start": 1521.1, "Time_End": 1526.3, "Text": " I think they really, they really do need to work together."}, {"Time_Start": 1527.18, "Time_End": 1532.1, "Text": " It shouldn't be a contest of rushing to,"}, {"Time_Start": 1532.5, "Time_End": 1540.38, "Text": " to get credit for finding a vulnerability and publishing that in some forms such that one can say me first,"}, {"Time_Start": 1541.02, "Time_End": 1549.88, "Text": " it's stepping back and saying, where are the possible outcomes if this vulnerability is exploited?"}, {"Time_Start": 1550.8, "Time_End": 1562.26, "Text": " What are the possible outcomes if I share this with some community that may not have the perspectives that I, as the researcher,"}, {"Time_Start": 1562.5, "Time_End": 1567.22, "Text": " or as the scientist or as a system administrator have,"}, {"Time_Start": 1567.74, "Time_End": 1572.02, "Text": " based on my knowledge of what could be done with the vulnerability."}, {"Time_Start": 1572.82, "Time_End": 1578.74, "Text": " So it's sharing the information, and I hate to use the word responsibly,"}, {"Time_Start": 1578.84, "Time_End": 1581.44, "Text": " but it is sharing the information responsibly,"}, {"Time_Start": 1581.44, "Time_End": 1586.04, "Text": " and it's also working not only to identify the vulnerability,"}, {"Time_Start": 1586.92, "Time_End": 1592.48, "Text": " but to also say, and here's what can be done, either the vendor,"}, {"Time_Start": 1592.5, "Time_End": 1598.32, "Text": " to patch in a patch for the vulnerability or in a system sense,"}, {"Time_Start": 1598.74, "Time_End": 1605.08, "Text": " here's something that can be done between T0, the time that the vulnerability is made known"}, {"Time_Start": 1605.08, "Time_End": 1610.68, "Text": " and the time that it's actually a patch is available to address the vulnerability,"}, {"Time_Start": 1610.98, "Time_End": 1616.0, "Text": " here's something that can be done in the system to mitigate the effects if, in fact,"}, {"Time_Start": 1616.06, "Time_End": 1617.46, "Text": " that vulnerability is exploited."}, {"Time_Start": 1618.16, "Time_End": 1622.04, "Text": " So it is information sharing, it is working together."}, {"Time_Start": 1622.5, "Time_End": 1632.8, "Text": " But I think it's also measured restraint when one finds a flaw, a vulnerability,"}, {"Time_Start": 1632.8, "Time_End": 1639.04, "Text": " and to really step back and say, what might someone do if they exploit this"}, {"Time_Start": 1639.04, "Time_End": 1643.08, "Text": " and what is the likely or possible impact of that being done?"}, {"Time_Start": 1644.32, "Time_End": 1652.48, "Text": " Terribly, you know, egregious things from the telephone system coming down to the financial"}, {"Time_Start": 1652.5, "Time_End": 1661.14, "Text": " system coming down to, you know, all the grades for the seniors being changed in some"}, {"Time_Start": 1661.14, "Time_End": 1662.04, "Text": " college class."}, {"Time_Start": 1662.22, "Time_End": 1673.72, "Text": " I mean, those all have various impacts, some much, much more far-reaching than others, but all should"}, {"Time_Start": 1673.72, "Time_End": 1676.5, "Text": " be addressed with the same level of concern."}, {"Time_Start": 1679.08, "Time_End": 1682.48, "Text": " What's going to make this come together is that a continued cultural"}, {"Time_Start": 1682.5, "Time_End": 1685.72, "Text": " change. We've seen quite a bit of it over the past several years, of course, the integration"}, {"Time_Start": 1685.72, "Time_End": 1690.6, "Text": " of IT and IT services into businesses that before would never even use a computer for anything"}, {"Time_Start": 1690.6, "Time_End": 1695.44, "Text": " other than a fancy electric typewriter. But the part of the culture that hasn't changed"}, {"Time_Start": 1695.44, "Time_End": 1700.82, "Text": " it is the information sharing piece of it. We've seen some effort over the past few years to"}, {"Time_Start": 1700.82, "Time_End": 1706.86, "Text": " build the ISACs, to let it at a sector level, sharing of weaknesses and vulnerabilities, say within"}, {"Time_Start": 1706.86, "Time_End": 1711.5, "Text": " the banking industry or within transportation or other sectors. But even that sharing is done"}, {"Time_Start": 1711.5, "Time_End": 1712.38, "Text": " very reluctantly."}, {"Time_Start": 1712.5, "Time_End": 1717.88, "Text": " I realize a lot of that has to do with the fact that a company just does not want to know other companies,"}, {"Time_Start": 1718.0, "Time_End": 1723.14, "Text": " be they peer companies, competitors, or even somebody that's not in their space, don't want them to know of their problems."}, {"Time_Start": 1723.94, "Time_End": 1732.94, "Text": " This sharing of information is also permeating those who are aware of vulnerabilities not only within themselves but within other systems."}, {"Time_Start": 1733.36, "Time_End": 1736.44, "Text": " How do you get that information to somebody who can do something about it?"}, {"Time_Start": 1736.74, "Time_End": 1741.64, "Text": " And if you are the organization or the individual or the company or who can do something about it,"}, {"Time_Start": 1741.64, "Time_End": 1747.94, "Text": " What mechanisms do you have in place to receive that information, to enter that into the process of making change?"}, {"Time_Start": 1748.44, "Time_End": 1752.6000000000001, "Text": " Those cultural things is something that we are making progress over the past few years,"}, {"Time_Start": 1752.68, "Time_End": 1758.88, "Text": " but that is what has to continue to evolve to the point where we are comfortable with sharing our weaknesses,"}, {"Time_Start": 1759.2, "Time_End": 1762.48, "Text": " essentially amongst ourselves, so that something can be done to repair it."}, {"Time_Start": 1764.8200000000002, "Time_End": 1769.0400000000002, "Text": " Every negotiation begins with a statement of the interests of all parties."}, {"Time_Start": 1769.04, "Time_End": 1775.44, "Text": " And I think we need to understand the interests of the researchers and the interests of the people doing the vulnerability discovery"}, {"Time_Start": 1775.44, "Time_End": 1780.1599999999999, "Text": " and what values they get out of the disclosures so that that can be properly accommodated."}, {"Time_Start": 1780.26, "Time_End": 1783.98, "Text": " There's clear values to individuals and there's clear values to the community."}, {"Time_Start": 1784.3799999999999, "Time_End": 1790.46, "Text": " And I think in the balance, we need to understand those values to accommodate them as best as possible."}, {"Time_Start": 1791.28, "Time_End": 1797.68, "Text": " Secondly, I think we need to properly evaluate the costs and benefits of each possible model of disclosure."}, {"Time_Start": 1797.68, "Time_End": 1809.38, "Text": " As I stated earlier, there is a long-term value that people tend to neglect, which is the long-term effect of a particular action."}, {"Time_Start": 1809.52, "Time_End": 1816.52, "Text": " So, for example, in response to some of the information that terrorists were getting off the network and to some hacker attacks,"}, {"Time_Start": 1816.88, "Time_End": 1820.02, "Text": " the DOD pulled tremendous amounts of information off the web."}, {"Time_Start": 1820.64, "Time_End": 1825.66, "Text": " That had a tremendous cost to the mission effectiveness of the DOD, a cost that's really never been evaluated."}, {"Time_Start": 1825.66, "Time_End": 1829.8600000000001, "Text": " Has that cost been worse than the benefit that they received from that?"}, {"Time_Start": 1830.24, "Time_End": 1831.5800000000002, "Text": " It's not clear, right?"}, {"Time_Start": 1831.64, "Time_End": 1839.64, "Text": " So what I'm advocating is that we clearly evaluate both the near-term costs and the long-term costs for what we do,"}, {"Time_Start": 1839.76, "Time_End": 1844.4, "Text": " in a particular how we decide to suppress disclosure or to any degree we decide to do it."}, {"Time_Start": 1844.6000000000001, "Time_End": 1849.8400000000001, "Text": " We need to understand the long-term implications to the defendability of our critical infrastructure."}, {"Time_Start": 1850.48, "Time_End": 1855.64, "Text": " Lastly, I think we need to make sure that those who are in this research business set an"}, {"Time_Start": 1855.66, "Time_End": 1860.66, "Text": " integrity standard. So, you know, for that very, very tiny fraction of us who don't know,"}, {"Time_Start": 1860.96, "Time_End": 1867.4, "Text": " it is wrong to disclose information that you get that then is used to kill people."}, {"Time_Start": 1867.6000000000001, "Time_End": 1872.96, "Text": " That makes you an accomplice, right? And so if we set up an integrity standard that suggests that"}, {"Time_Start": 1872.96, "Time_End": 1878.64, "Text": " the community comes down on people who do that, who share information with terrorists who then kill"}, {"Time_Start": 1878.64, "Time_End": 1882.5600000000002, "Text": " 5,000 people, that's wrong. All right? So as long as we all understand that's wrong,"}, {"Time_Start": 1882.8400000000001, "Time_End": 1885.64, "Text": " then, you know, that standard will help create trust between the law."}, {"Time_Start": 1885.66, "Time_End": 1886.16, "Text": " all parties."}, {"Time_Start": 1888.96, "Time_End": 1896.02, "Text": " I'll keep this short. I think not everyone is created equal and different people will do different"}, {"Time_Start": 1896.02, "Time_End": 1900.92, "Text": " things with a piece of information once it's given to them. So I think it's very important that"}, {"Time_Start": 1900.92, "Time_End": 1906.8600000000001, "Text": " when you identify a vulnerability and you need to tell someone about it, either a vendor or a buddy"}, {"Time_Start": 1906.8600000000001, "Time_End": 1910.98, "Text": " or whatever, you really need to think long and hard about why you're telling them this piece of"}, {"Time_Start": 1910.98, "Time_End": 1915.64, "Text": " information and what is the purpose, what is the use of that information when you give"}, {"Time_Start": 1915.66, "Time_End": 1921.66, "Text": " it to them. In the case of the CCC, we have relationships we say with hundreds of companies, and that's true."}, {"Time_Start": 1921.66, "Time_End": 1927.66, "Text": " But the relationships aren't with the companies, the relationships with individuals and the companies that we trust."}, {"Time_Start": 1927.66, "Time_End": 1932.66, "Text": " And there's a big difference there. It's one thing to pick up the phone and say, I called Microsoft."}, {"Time_Start": 1932.66, "Time_End": 1937.66, "Text": " It's another thing to pick up the phone and say I called this person in Microsoft."}, {"Time_Start": 1937.66, "Time_End": 1943.66, "Text": " Because when I call this person, I know who I'm telling, and I know what he or she's going to do with the information."}, {"Time_Start": 1943.66, "Time_End": 1948.66, "Text": " If I pick up the phone and call Bill Gates, I have no idea what he's going to do with that information."}, {"Time_Start": 1948.66, "Time_End": 1951.66, "Text": " And I think that's an important point to remember."}, {"Time_Start": 1951.66, "Time_End": 1957.66, "Text": " Back to the original question of what the ideal disclosure metric is."}, {"Time_Start": 1957.66, "Time_End": 1963.66, "Text": " I think the ideal metric would depend very much upon the individual."}, {"Time_Start": 1963.66, "Time_End": 1969.66, "Text": " However, as I said earlier, whatever the ideal metric is, I think the first things that need to be protected"}, {"Time_Start": 1969.66, "Time_End": 1972.66, "Text": " are critical infrastructures and skater systems."}, {"Time_Start": 1972.66, "Time_End": 1979.66, "Text": " systems, you know, the systems which allow us to make telephone calls, the systems"}, {"Time_Start": 1979.66, "Time_End": 1987.66, "Text": " which allow us to take a tube, the systems which allow us to fly safely, everything."}, {"Time_Start": 1987.66, "Time_End": 1994.66, "Text": " There have been numerous cases where hackers have broken into skater systems at dams"}, {"Time_Start": 1994.66, "Time_End": 1997.66, "Text": " and head control of floodgates."}, {"Time_Start": 1997.66, "Time_End": 1999.66, "Text": " That isn't acceptable."}, {"Time_Start": 1999.66, "Time_End": 2001.66, "Text": " Whatever the ideal metric is,"}, {"Time_Start": 2001.66, "Time_End": 2006.66, "Text": " is that the first priority does have to be critical infrastructure."}, {"Time_Start": 2006.66, "Time_End": 2007.66, "Text": " Okay."}, {"Time_Start": 2007.66, "Time_End": 2013.66, "Text": " I'm going to open this for questions from the floor, but I'm going to ask, let me preface this by requesting,"}, {"Time_Start": 2013.66, "Time_End": 2017.66, "Text": " that you really think about what the purpose of us being here is."}, {"Time_Start": 2017.66, "Time_End": 2023.66, "Text": " It's to work together and to build a positive way that we can work forward."}, {"Time_Start": 2023.66, "Time_End": 2028.66, "Text": " So flaming my panelists, there's no one any good, and I'm just going to shut you down."}, {"Time_Start": 2028.66, "Time_End": 2030.66, "Text": " So please ask things that can be addressed positively."}, {"Time_Start": 2030.66, "Time_End": 2037.66, "Text": " Let me pass this mic around."}, {"Time_Start": 2037.66, "Time_End": 2048.66, "Text": " Yeah, I want to see what you think the responsibility of companies is to secure themselves."}, {"Time_Start": 2048.66, "Time_End": 2055.66, "Text": " I mean, when we had the Y2K problem, we basically told them that they had to put information about"}, {"Time_Start": 2055.66, "Time_End": 2060.64, "Text": " how much they've solved of the Y2K."}, {"Time_Start": 2060.66, "Time_End": 2064.66, "Text": " problem into their SEC filing. So do you think that that should be done with security"}, {"Time_Start": 2064.66, "Time_End": 2069.66, "Text": " or do you think something more like a FOIA exemption, which I know is going through Congress right now,"}, {"Time_Start": 2069.66, "Time_End": 2071.66, "Text": " is the better way to do it?"}, {"Time_Start": 2075.66, "Time_End": 2080.66, "Text": " I think the companies have a tremendous amount of responsibility."}, {"Time_Start": 2080.66, "Time_End": 2086.66, "Text": " It's not always followed through."}, {"Time_Start": 2086.66, "Time_End": 2089.66, "Text": " Just as we all see the quality of what we all see."}, {"Time_Start": 2089.66, "Time_End": 2095.18, "Text": " The quality of what we're getting out of commercial software vendors today is absolutely terrible."}, {"Time_Start": 2095.8399999999997, "Time_End": 2103.72, "Text": " We are the beta testers for most of this stuff, and that's why the ability to find so many vulnerabilities is there."}, {"Time_Start": 2104.72, "Time_End": 2113.94, "Text": " But I think the more that we're able to push back in their direction and say, we're not going to accept this."}, {"Time_Start": 2114.3599999999997, "Time_End": 2117.3999999999996, "Text": " And when things are found, we do want them fixed."}, {"Time_Start": 2117.4, "Time_End": 2121.54, "Text": " and the we is the total consuming community."}, {"Time_Start": 2122.2200000000003, "Time_End": 2125.84, "Text": " I think the vendors will continue to come along."}, {"Time_Start": 2125.96, "Time_End": 2131.34, "Text": " Some do it much, much better than others, but we're willing to buy this stuff."}, {"Time_Start": 2132.1, "Time_End": 2142.9, "Text": " I mean, so we have an opportunity to get them to take action to fix the things that everybody is finding out there."}, {"Time_Start": 2147.4, "Time_End": 2151.58, "Text": " I agree what you were saying."}, {"Time_Start": 2152.58, "Time_End": 2158.12, "Text": " I see that because the software, the corporations that write the software have no liability,"}, {"Time_Start": 2158.86, "Time_End": 2164.54, "Text": " they have no vested interest except that they get a black eye whenever a vulnerability comes out."}, {"Time_Start": 2165.2000000000003, "Time_End": 2172.82, "Text": " Are we going to see liability for those corporations to include security within the development process right now?"}, {"Time_Start": 2172.82, "Time_End": 2174.86, "Text": " Many of those companies do not include it."}, {"Time_Start": 2175.26, "Time_End": 2176.48, "Text": " They take no liability."}, {"Time_Start": 2177.4, "Time_End": 2183.64, "Text": " They define what the risk to their corporate customers are without the corporate customers being involved."}, {"Time_Start": 2188.64, "Time_End": 2193.96, "Text": " I wish we had somebody from Congress here that could address that directly because that would be a law or Department of Justice."}, {"Time_Start": 2195.84, "Time_End": 2200.96, "Text": " We, the federal government, of course, as was just explained, we have an enormous purchasing power ourselves."}, {"Time_Start": 2201.62, "Time_End": 2204.52, "Text": " We also have to put up with the end user license agreements."}, {"Time_Start": 2204.52, "Time_End": 2208.74, "Text": " We are also bound by those same words that you are."}, {"Time_Start": 2209.3, "Time_End": 2210.46, "Text": " It bothers us as well."}, {"Time_Start": 2210.88, "Time_End": 2218.82, "Text": " That, in fact, I purchased software from a vendor, and the vendor places in a paragraph the fact that they are not responsible for what I do with the software."}, {"Time_Start": 2218.94, "Time_End": 2221.7599999999998, "Text": " They're not responsible with what happens to the software after it's installed."}, {"Time_Start": 2222.68, "Time_End": 2226.06, "Text": " Whether that's right or wrong, I'm sure we could spend an entire afternoon debating it."}, {"Time_Start": 2226.2599999999998, "Time_End": 2230.06, "Text": " There's certainly issues there that are up for discussion and are being discussed."}, {"Time_Start": 2230.82, "Time_End": 2234.5, "Text": " Whether legislation is the right way to go, I'm not personally convinced."}, {"Time_Start": 2234.52, "Time_End": 2236.2, "Text": " that that's absolutely correct."}, {"Time_Start": 2236.3, "Time_End": 2239.32, "Text": " We would like to try and not legislate as much of this as possible."}, {"Time_Start": 2240.28, "Time_End": 2248.2599999999998, "Text": " But your point is absolutely valid, and it's certainly something that we need to continue working with"}, {"Time_Start": 2248.2599999999998, "Time_End": 2250.34, "Text": " to come to whatever the right answer is."}, {"Time_Start": 2253.98, "Time_End": 2259.6, "Text": " To the panel in general, we seem to see a lot of bugs that are found by researchers"}, {"Time_Start": 2259.6, "Time_End": 2264.5, "Text": " and get sent off to cert, to other places, to disappear into a black hole."}, {"Time_Start": 2264.52, "Time_End": 2271.28, "Text": " never heard from again. These things also are sent to the companies. Again, they"}, {"Time_Start": 2271.28, "Time_End": 2275.32, "Text": " don't always know who they're sitting it to. And those, again, disappeared in black holes."}, {"Time_Start": 2275.32, "Time_End": 2280.12, "Text": " The researchers then get frustrated and finally publish their information on bug track. Often,"}, {"Time_Start": 2280.12, "Time_End": 2285.28, "Text": " cert talks about waiting until there's a fix or waiting until the horse has already escaped"}, {"Time_Start": 2285.28, "Time_End": 2290.5, "Text": " from the barn before they announce that there's a problem with the padlock. How do, can we"}, {"Time_Start": 2290.5, "Time_End": 2294.5, "Text": " address this so that the researchers aren't frustrated enough to put bugs out"}, {"Time_Start": 2294.52, "Time_End": 2298.52, "Text": " there before this time. How do we get the companies to respond?"}, {"Time_Start": 2298.52, "Time_End": 2302.52, "Text": " I think I'll answer that. I think there's a misconception."}, {"Time_Start": 2302.52, "Time_End": 2310.52, "Text": " CERT, for one, we get a lot of vulnerability reports. We don't publicize as an advisory every single one of them."}, {"Time_Start": 2310.52, "Time_End": 2317.52, "Text": " If we did, we'd be doing a thousand a year. That's way too many. But there is another side, in our case of the website,"}, {"Time_Start": 2317.52, "Time_End": 2322.52, "Text": " which is the vulnerability database, which are those vulnerabilities which haven't made it to be an advisory,"}, {"Time_Start": 2322.52, "Time_End": 2329.58, "Text": " but have been reported to us, reported to the vendor, and it documents the steps that all the parties took"}, {"Time_Start": 2329.58, "Time_End": 2336.04, "Text": " to work on that vulnerability. And you'll find thousands of them in there that actually have been fixed."}, {"Time_Start": 2336.68, "Time_End": 2343.04, "Text": " And they got rolled into a patch that, yeah, it wasn't publicized like an advisory or a bulletin from the vendor,"}, {"Time_Start": 2343.2, "Time_End": 2347.46, "Text": " but they were indeed fixed in a service pack or some other rollout of the software."}, {"Time_Start": 2348.36, "Time_End": 2352.5, "Text": " So there's a fine line there, and I'm not sure what, if you're seeing a,"}, {"Time_Start": 2352.52, "Time_End": 2357.68, "Text": " vulnerability reported and it truly looks like it goes into a black hole in our case"}, {"Time_Start": 2357.68, "Time_End": 2362.44, "Text": " call back and ask and we will go talk to the vendor because there's only so many of us we can't"}, {"Time_Start": 2362.44, "Time_End": 2367.52, "Text": " deal with all of them completely but we'll deal with as many of the big ones as we can in"}, {"Time_Start": 2367.52, "Time_End": 2369.2, "Text": " as timely manner as we can"}, {"Time_Start": 2369.2, "Time_End": 2375.96, "Text": " during the discussions here"}, {"Time_Start": 2382.52, "Time_End": 2387.68, "Text": " be assuming that there's a vendor to go to where there's some sort of support available"}, {"Time_Start": 2387.68, "Time_End": 2393.7599999999998, "Text": " for the software that's vulnerable. In a lot of instances, it's either shareware that was put out"}, {"Time_Start": 2393.7599999999998, "Time_End": 2399.9, "Text": " by an individual or a company that is no longer in business or software that's no longer"}, {"Time_Start": 2399.9, "Time_End": 2406.2, "Text": " supported by the vendor. What sort of things would you recommend that researchers can do in"}, {"Time_Start": 2406.2, "Time_End": 2412.12, "Text": " those instances where the software is no longer supported by anyone, but there's still a"}, {"Time_Start": 2412.12, "Time_End": 2413.12, "Text": " vulnerability in it."}, {"Time_Start": 2417.44, "Time_End": 2418.56, "Text": " I'll take that one."}, {"Time_Start": 2418.6, "Time_End": 2419.2799999999997, "Text": " There's a couple things."}, {"Time_Start": 2419.54, "Time_End": 2422.3399999999997, "Text": " If there's no one behind the product that has the vulnerability,"}, {"Time_Start": 2422.6, "Time_End": 2425.68, "Text": " no company or anything, then it's not going to get fixed."}, {"Time_Start": 2426.2599999999998, "Time_End": 2431.18, "Text": " So the best thing you can do at that point is to document the workaround if there is one"}, {"Time_Start": 2431.18, "Time_End": 2432.98, "Text": " to the vulnerability."}, {"Time_Start": 2433.64, "Time_End": 2439.14, "Text": " And if there is no workaround, then really the only solution realistically is to not use the product,"}, {"Time_Start": 2439.56, "Time_End": 2441.1, "Text": " and that's an individual's choice."}, {"Time_Start": 2442.12, "Time_End": 2448.04, "Text": " But for the open source community in places like that, feel free to contact SERT or other organizations"}, {"Time_Start": 2448.04, "Time_End": 2455.0, "Text": " that might know the individuals who might be able to rebuild the code with a patch in the code"}, {"Time_Start": 2455.0, "Time_End": 2458.14, "Text": " and see where it goes from there. Does that help?"}, {"Time_Start": 2464.24, "Time_End": 2472.1, "Text": " I'm just wondering if any of the panel members see a greater importance to perhaps reduce,"}, {"Time_Start": 2472.12, "Time_End": 2480.3599999999997, "Text": " the large number of security, I guess, problems created for businesses and individuals"}, {"Time_Start": 2480.3599999999997, "Time_End": 2487.72, "Text": " by bugs that could cost them, huge economic things, outweighed by, on the other side,"}, {"Time_Start": 2487.8399999999997, "Time_End": 2496.14, "Text": " way compared to the very slim but real chance of, for example, a terrorist exploiting a bug that's"}, {"Time_Start": 2496.14, "Time_End": 2501.2599999999998, "Text": " been, since the bugs are generally all released anyway on bug track, and I'm sure the terrorists"}, {"Time_Start": 2501.26, "Time_End": 2505.6200000000003, "Text": " or aware of it and haven't done it too much, wouldn't there be some advantage to releasing"}, {"Time_Start": 2505.6200000000003, "Time_End": 2512.4, "Text": " the bugs to the public a little more quickly so that they can, the public and companies can protect"}, {"Time_Start": 2512.4, "Time_End": 2516.2000000000003, "Text": " themselves against those bugs or work more quickly to protect themselves?"}, {"Time_Start": 2518.32, "Time_End": 2521.0600000000004, "Text": " Well, the question would be, what is quick?"}, {"Time_Start": 2522.96, "Time_End": 2527.5800000000004, "Text": " Yeah, there you go. Now I can see you. When you talk about quick, are you talking about a researcher"}, {"Time_Start": 2527.5800000000004, "Time_End": 2531.2400000000002, "Text": " finding a vulnerability in publishing it without sending it to the very?"}, {"Time_Start": 2531.26, "Time_End": 2536.1200000000003, "Text": " vendor for their patch to be released? Or are you talking about getting it to the vendor"}, {"Time_Start": 2536.1200000000003, "Time_End": 2539.1000000000004, "Text": " and then having the vendor release the vulnerability, which?"}, {"Time_Start": 2539.6000000000004, "Time_End": 2540.76, "Text": " Right."}, {"Time_Start": 2544.44, "Time_End": 2558.42, "Text": " Right. We, in a perfect world, you know, if everything worked like it should, within a matter of a few days to a few weeks, because complex, software is complex, and to be fair on the software of vendors, a patch is not something that you do just within a matter of hours or even within a matter of a few days."}, {"Time_Start": 2558.42, "Time_End": 2561.2400000000002, "Text": " But a reasonable amount of time, whatever that is, depending on the"}, {"Time_Start": 2561.26, "Time_End": 2567.2000000000003, "Text": " software to be turned around and made public. Absolutely. Recognizing though that's a perfect world"}, {"Time_Start": 2567.2000000000003, "Time_End": 2572.88, "Text": " model and we don't live in a perfect world. What is the, of course, at stake here is when a vulnerability"}, {"Time_Start": 2572.88, "Time_End": 2578.78, "Text": " is found, a researcher finds it, and they short circuit the system and publish it directly to the general"}, {"Time_Start": 2578.78, "Time_End": 2583.2200000000003, "Text": " audience without letting the software vendors have at least a shot at it, a fair shot at trying to fix it."}, {"Time_Start": 2588.2200000000003, "Time_End": 2591.2400000000002, "Text": " Hi there. You've talked about responsible"}, {"Time_Start": 2591.26, "Time_End": 2593.26, "Text": " disclosure? Is it turned on?"}, {"Time_Start": 2593.26, "Time_End": 2595.26, "Text": " Can I leave that thing on?"}, {"Time_Start": 2595.26, "Time_End": 2601.6200000000003, "Text": " Hi there. You've talked about the responsible disclosure of information, but how many"}, {"Time_Start": 2601.6200000000003, "Time_End": 2606.42, "Text": " given organizations actually have a responsible disclosure policy? This is just a case of"}, {"Time_Start": 2606.42, "Time_End": 2607.82, "Text": " views we say, not as we do."}, {"Time_Start": 2607.82, "Time_End": 2611.26, "Text": " What are you going to talk about?"}, {"Time_Start": 2611.26, "Time_End": 2618.26, "Text": " Yeah. How many, how many government organizations actually have a responsible disclosure policy?"}, {"Time_Start": 2618.26, "Time_End": 2620.26, "Text": " I don't know."}, {"Time_Start": 2620.26, "Time_End": 2621.26, "Text": " I don't know."}, {"Time_Start": 2621.26, "Time_End": 2627.1000000000004, "Text": " I don't know. The question is how many companies have a responsible disclosure policy?"}, {"Time_Start": 2627.1000000000004, "Time_End": 2629.9, "Text": " Different organizations?"}, {"Time_Start": 2629.9, "Time_End": 2640.8, "Text": " Absolutely. No, I don't have a number to give you. I don't know. I wouldn't even know the percentage. I know many do, but it would be unfair to give you a number."}, {"Time_Start": 2640.8, "Time_End": 2651.1600000000003, "Text": " Turn it on. Leave that thing on. With the threat that some companies make against the people that find those disclosures,"}, {"Time_Start": 2651.26, "Time_End": 2655.5, "Text": " Could you see some sort of federal whistleblower protection, possibly, for people"}, {"Time_Start": 2655.5, "Time_End": 2660.36, "Text": " that find disclosures to protect them from attack by the company that they find the vulnerability?"}, {"Time_Start": 2660.36, "Time_End": 2662.2000000000003, "Text": " Whistleblower protection."}, {"Time_Start": 2666.1600000000003, "Time_End": 2671.6600000000003, "Text": " It sounds like the survey says, whistleblower protection sounds like a good thing."}, {"Time_Start": 2671.96, "Time_End": 2675.5400000000004, "Text": " Let me find out. I'm not aware of any effort that's ongoing like that."}, {"Time_Start": 2676.1800000000003, "Time_End": 2681.2400000000002, "Text": " I don't know that we're quite to that point yet where we need it, but if we get there, certainly,"}, {"Time_Start": 2681.26, "Time_End": 2691.5, "Text": " I got asked one question that was requested to be related anonymously to the panel, so I'll ask on their behalf."}, {"Time_Start": 2693.6200000000003, "Time_End": 2697.5200000000004, "Text": " Everything that we've talked about so far has been domestically based."}, {"Time_Start": 2697.6200000000003, "Time_End": 2699.4, "Text": " What can we in the U.S. do?"}, {"Time_Start": 2699.4, "Time_End": 2709.1800000000003, "Text": " How does the fact that vulnerabilities are released all over the world impact any kind of work that we move forward as we move forward as a country?"}, {"Time_Start": 2711.26, "Time_End": 2713.92, "Text": " Do you want me answering all these questions?"}, {"Time_Start": 2713.92, "Time_End": 2715.26, "Text": " No, I mean."}, {"Time_Start": 2715.26, "Time_End": 2721.26, "Text": " Terrorism is a global issue."}, {"Time_Start": 2721.26, "Time_End": 2729.26, "Text": " We're beginning to deal with nations that this country has never had a strong relationship before,"}, {"Time_Start": 2729.26, "Time_End": 2735.26, "Text": " and we're sharing information with nations that we never thought we'd share information with before."}, {"Time_Start": 2735.26, "Time_End": 2740.26, "Text": " The United States is clearly a leader."}, {"Time_Start": 2740.26, "Time_End": 2755.44, "Text": " both economically, militarily, and I think from a, you know, if you look, where is new technology coming from, it's coming primarily out of this country."}, {"Time_Start": 2756.0400000000004, "Time_End": 2765.0, "Text": " And so I think we've got a responsibility to act in a way that we want the rest of the world to follow."}, {"Time_Start": 2765.0, "Time_End": 2767.2200000000003, "Text": " We need to set that example."}, {"Time_Start": 2767.88, "Time_End": 2770.1000000000004, "Text": " Not going to solve the problem overnight."}, {"Time_Start": 2770.26, "Time_End": 2782.6600000000003, "Text": " it's not going to solve the problem entirely, but I think clearly we have a responsibility to show how we can do it and how then we would like the rest of the world to do it as well."}, {"Time_Start": 2784.1200000000003, "Time_End": 2797.5, "Text": " Just real quick, let me add to that so everybody knows we do have several ongoing efforts with many countries to share what we've learned in terms of critical infrastructure protection and cybersecurity, because of course we are quite a well ahead of many nations."}, {"Time_Start": 2797.5, "Time_End": 2799.5800000000004, "Text": " There are many things we can also learn from other nations."}, {"Time_Start": 2799.58, "Time_End": 2802.42, "Text": " Others that have gone after the Internet in different ways."}, {"Time_Start": 2803.02, "Time_End": 2806.2999999999997, "Text": " For example, many Asian countries, the Internet is simply your handheld."}, {"Time_Start": 2806.54, "Time_End": 2807.84, "Text": " It's contained on your cell phone."}, {"Time_Start": 2807.92, "Time_End": 2812.1, "Text": " It's nothing like we have where it's a physical box with a cable or a DSL connection."}, {"Time_Start": 2812.64, "Time_End": 2818.84, "Text": " There are things we can learn from other industries, from other countries, and from other cultures."}, {"Time_Start": 2819.34, "Time_End": 2823.2599999999998, "Text": " We are working very hard to try and spread what we've learned and to learn from others."}, {"Time_Start": 2823.2599999999998, "Time_End": 2826.46, "Text": " But the question of what happens if we push all this offshore?"}, {"Time_Start": 2827.08, "Time_End": 2828.98, "Text": " Well, we're a very interconnected society."}, {"Time_Start": 2829.58, "Time_End": 2835.34, "Text": " knows, no boundaries. There are no, as yet, no laws that apply globally where I can arrest"}, {"Time_Start": 2835.34, "Time_End": 2840.34, "Text": " somebody in a foreign country for breaking a U.S. law. I hope we don't ever come to that."}, {"Time_Start": 2840.34, "Time_End": 2845.2, "Text": " I hope that what we can do is continue to set the example. And this is, of course, a call for not"}, {"Time_Start": 2845.2, "Time_End": 2848.64, "Text": " only the federal government, but you as individuals, American citizens, and those of you that are"}, {"Time_Start": 2848.64, "Time_End": 2853.2, "Text": " citizens of other countries, to continue to lead the way and set the proper example of how"}, {"Time_Start": 2853.2, "Time_End": 2857.2, "Text": " to do this type of business we're talking about here in terms of ethical disclosures."}, {"Time_Start": 2859.58, "Time_End": 2866.58, "Text": " Unfortunately, we're limited by time, so let me close by saying thank you all for coming"}, {"Time_Start": 2866.58, "Time_End": 2870.58, "Text": " and hopefully in the future for participating in this discussion."}, {"Time_Start": 2870.58, "Time_End": 2875.58, "Text": " Because it's the people here, it's the people at Black Cat, it's the people that actually"}, {"Time_Start": 2875.58, "Time_End": 2882.58, "Text": " give serious and legitimate thought to the best way to responsibly disclose that information"}, {"Time_Start": 2882.58, "Time_End": 2889.56, "Text": " that are going to be contributing to whatever our government, whatever international governments,"}, {"Time_Start": 2889.58, "Time_End": 2894.7599999999998, "Text": " decide is the best way. And I personally would like it to come from the populace,"}, {"Time_Start": 2894.7599999999998, "Time_End": 2901.46, "Text": " not just from the government. Lastly, let me say that we do have some information packets"}, {"Time_Start": 2901.46, "Time_End": 2908.2999999999997, "Text": " on Global Intersec and also on Microsoft, just for flavor, their opinions on responsible disclosure."}, {"Time_Start": 2909.02, "Time_End": 2914.02, "Text": " Some of the panelists, unfortunately, have secondary engagements, but others of us will be"}, {"Time_Start": 2914.02, "Time_End": 2918.84, "Text": " around for further discussion. We'll head to the back so that they can use the room for the next panel,"}, {"Time_Start": 2918.84, "Time_End": 2923.2400000000002, "Text": " which I was asked to announce is Richard Team Hacking the next 10 years."}, {"Time_Start": 2923.38, "Time_End": 2924.08, "Text": " Thank you all for coming."}]}