{"segments": [{"Time_Start": 0.0, "Time_End": 11.0, "Text": " Ladies and gentlemen, is everybody up for an exciting round of Spot the Fed?"}, {"Time_Start": 11.0, "Time_End": 16.0, "Text": " Does anyone like to spot a Fed?"}, {"Time_Start": 16.0, "Time_End": 18.0, "Text": " Raise your hand, please."}, {"Time_Start": 18.0, "Time_End": 24.0, "Text": " The lady in the back with the pink hair, come on down."}, {"Time_Start": 24.0, "Time_End": 27.0, "Text": " You have to bring your fed with you, ma'am."}, {"Time_Start": 30.0, "Time_End": 34.0, "Text": " Oh, he's a Fed."}, {"Time_Start": 34.0, "Time_End": 37.0, "Text": " All right, we'll get the session going now."}, {"Time_Start": 37.0, "Time_End": 55.0, "Text": " I want to introduce Thomas Munn."}, {"Time_Start": 55.0, "Time_End": 57.0, "Text": " He is going to talk about data hiding in Linux."}, {"Time_Start": 57.0, "Time_End": 59.0, "Text": " He was going to talk about BSD."}, {"Time_Start": 59.0, "Time_End": 60.0, "Text": " But that has going to talk about BSD."}, {"Time_Start": 60.0, "Time_End": 64.0, "Text": " half of the presentation team isn't here, so here's Thomas."}, {"Time_Start": 64.0, "Time_End": 67.0, "Text": " Hi, thanks for your patience."}, {"Time_Start": 67.0, "Time_End": 73.0, "Text": " Unfortunately, TGR met with circumstances beyond both of our control"}, {"Time_Start": 73.0, "Time_End": 75.0, "Text": " and cannot speak today."}, {"Time_Start": 75.0, "Time_End": 80.0, "Text": " So his stuff is in the presentation for those of you who are BSD people."}, {"Time_Start": 80.0, "Time_End": 84.0, "Text": " Unfortunately, I don't want to look kind of silly because I don't know a huge amount about it."}, {"Time_Start": 84.0, "Time_End": 90.0, "Text": " I've set up IDS sensors on it, but I am beyond that not a BSD guru or guise"}, {"Time_Start": 90.0, "Time_End": 93.0, "Text": " So with that I'm going to begin."}, {"Time_Start": 93.0, "Time_End": 96.0, "Text": " Before I begin, here's some interesting devices."}, {"Time_Start": 96.0, "Time_End": 102.0, "Text": " This is a 30-gig USB 2.0 hard drive."}, {"Time_Start": 102.0, "Time_End": 107.0, "Text": " It's $150, and it's available based on, and I don't know who they are,"}, {"Time_Start": 107.0, "Time_End": 110.0, "Text": " but this is where I bought it, based on computers.com,"}, {"Time_Start": 110.0, "Time_End": 113.0, "Text": " and it's an incredible little device."}, {"Time_Start": 113.0, "Time_End": 117.0, "Text": " It's 30 gigs, and it's about the size of a pack of cigarettes"}, {"Time_Start": 117.0, "Time_End": 119.0, "Text": " and weighs about six or seven hours."}, {"Time_Start": 119.0, "Time_End": 126.0, "Text": " six or seven ounces. It doesn't cost like $400 like a lot of the available USB drives."}, {"Time_Start": 126.0, "Time_End": 128.0, "Text": " I'll tell you what these are for later."}, {"Time_Start": 128.0, "Time_End": 134.0, "Text": " This, you can't really see, is one of these USB keychain fobs."}, {"Time_Start": 134.0, "Time_End": 140.0, "Text": " You can get them in capacities ranging from 8 megabytes up to 1 gigabyte."}, {"Time_Start": 140.0, "Time_End": 142.0, "Text": " This version is the 8 gig version."}, {"Time_Start": 142.0, "Time_End": 145.0, "Text": " I bought it Comp USA for $30."}, {"Time_Start": 145.0, "Time_End": 147.0, "Text": " 8 megabyte, sorry."}, {"Time_Start": 147.0, "Time_End": 156.0, "Text": " Anyways, this is actually an unrelated device, but was my prototype for this whole project,"}, {"Time_Start": 156.0, "Time_End": 158.0, "Text": " it was a nomad."}, {"Time_Start": 158.0, "Time_End": 162.0, "Text": " Originally, I wanted to be able to store a file system on an MP3 player"}, {"Time_Start": 162.0, "Time_End": 166.0, "Text": " so that I could keep my data on the MP3 player and have it look like an MP3 player"}, {"Time_Start": 166.0, "Time_End": 171.0, "Text": " when actually, in fact, it was a data storage device for more than just MP3s."}, {"Time_Start": 171.0, "Time_End": 176.0, "Text": " So anyways, those are just the three devices of interest before I begin."}, {"Time_Start": 177.0, "Time_End": 189.0, "Text": " Basically, I don't know if any of you have been through layoffs, but I've been through five now."}, {"Time_Start": 189.0, "Time_End": 194.0, "Text": " And when they happen, especially if you're in the security industry, they happen very quickly."}, {"Time_Start": 194.0, "Time_End": 199.0, "Text": " Pretty much, you get in in the morning and they say, you are terminated."}, {"Time_Start": 199.0, "Time_End": 200.0, "Text": " They don't even say that."}, {"Time_Start": 200.0, "Time_End": 202.0, "Text": " They try to get all the passwords out of you first."}, {"Time_Start": 202.0, "Time_End": 206.0, "Text": " So if someone starts asking you for all your passwords and your security, you know that there's probably a problem."}, {"Time_Start": 206.0, "Time_End": 207.0, "Text": " probably a problem."}, {"Time_Start": 207.0, "Time_End": 214.0, "Text": " But anyways, so what happens is you get in and they essentially, they just give you a trash bag"}, {"Time_Start": 214.0, "Time_End": 218.44, "Text": " and you start filling your trash bag with your personal effects."}, {"Time_Start": 218.44, "Time_End": 223.76, "Text": " If you have any personal data, and I need to stress very strongly that you should not be using"}, {"Time_Start": 223.76, "Time_End": 228.88, "Text": " this to save your employer's data on your hard drive illegally."}, {"Time_Start": 228.88, "Time_End": 231.58, "Text": " I strongly advocate that you do not do that."}, {"Time_Start": 231.58, "Time_End": 235.98, "Text": " Network diagrams, things like that are property of the company, and as a, you are a, you"}, {"Time_Start": 236.0, "Time_End": 242.0, "Text": " ethical and practitioner of security, you have no right in keeping those documents."}, {"Time_Start": 242.0, "Time_End": 247.64, "Text": " On the other hand, if you have databases and general information which you gather, which are not"}, {"Time_Start": 247.64, "Time_End": 254.3, "Text": " of a specific nature, to your employer, it's just for me it's an ethical thing, I don't like them"}, {"Time_Start": 254.3, "Time_End": 258.2, "Text": " to have my problem solution database that I've been collecting for the last three or four years."}, {"Time_Start": 258.2, "Time_End": 259.9, "Text": " I keep a database of all my solutions."}, {"Time_Start": 259.9, "Time_End": 261.0, "Text": " That's my property."}, {"Time_Start": 261.0, "Time_End": 262.0, "Text": " It's not theirs."}, {"Time_Start": 262.0, "Time_End": 265.98, "Text": " So it was in reaction to this that I did this whole."}, {"Time_Start": 266.0, "Time_End": 269.34, "Text": " this whole presentation."}, {"Time_Start": 269.34, "Time_End": 274.06, "Text": " I got to the point where I wanted my data to be my data."}, {"Time_Start": 274.18, "Time_End": 275.7, "Text": " I wanted my programs to come with me."}, {"Time_Start": 276.06, "Time_End": 281.06, "Text": " I did not want to have to worry about if I were laid off suddenly and arbitrarily having to try"}, {"Time_Start": 281.06, "Time_End": 282.96, "Text": " to back up data with they wouldn't let me back up."}, {"Time_Start": 283.4, "Time_End": 290.2, "Text": " So this is where, this is a whole context for this project."}, {"Time_Start": 290.34, "Time_End": 291.04, "Text": " I'm going to stand up."}, {"Time_Start": 292.48, "Time_End": 295.98, "Text": " Basically, there's a number of ways you can do."}, {"Time_Start": 296.0, "Time_End": 301.88, "Text": " this. You can use USB devices. You can use encrypted file systems. One of the more interesting"}, {"Time_Start": 301.88, "Time_End": 308.68, "Text": " ways that they do it is actually through wireless cards, access, basically use them in ad hoc"}, {"Time_Start": 308.68, "Time_End": 313.64, "Text": " mode and you have a mini network of two, which is the computer that you have and the computer"}, {"Time_Start": 313.64, "Time_End": 319.98, "Text": " that is out in a location, and you can transmit information through that channel using either"}, {"Time_Start": 319.98, "Time_End": 325.68, "Text": " the loop AES or other encrypted mechanisms. That's another interesting way. That was Will's"}, {"Time_Start": 325.68, "Time_End": 329.76, "Text": " of this, I'm not will, but whoever it was, over their side of the story."}, {"Time_Start": 330.46, "Time_End": 334.52, "Text": " And basically, that's the part that we're not going to do."}, {"Time_Start": 334.7, "Time_End": 339.2, "Text": " Anyways, I'm going to, so you see my presentation."}, {"Time_Start": 340.06, "Time_End": 342.22, "Text": " Basically, employers will eliminate you quickly."}, {"Time_Start": 342.66, "Time_End": 344.32, "Text": " You will not have any time to back up your data."}, {"Time_Start": 345.02, "Time_End": 351.78000000000003, "Text": " You use a USB or removable device that stays with you, and encrypting that data ensures that if someone"}, {"Time_Start": 351.78000000000003, "Time_End": 355.04, "Text": " steals this, your data will not be accessible to them."}, {"Time_Start": 355.68, "Time_End": 360.68, "Text": " if you've got some personal or email or anything like that that is of a sensitive nature,"}, {"Time_Start": 360.68, "Time_End": 369.28000000000003, "Text": " you can use this device to essentially make it very hard or very expensive for either whoever"}, {"Time_Start": 369.28000000000003, "Time_End": 374.18, "Text": " it is you're trying to prevent from getting your data. It's a very expensive process."}, {"Time_Start": 380.18, "Time_End": 385.66, "Text": " I hooked at a number of different packages. There was originally what they"}, {"Time_Start": 385.68, "Time_End": 389.76, "Text": " called the kernel patch for Linux, which was actually compiled into the kernel,"}, {"Time_Start": 390.16, "Time_End": 394.34000000000003, "Text": " but you had to patch the kernel each and every time you upgraded your kernel, which is something"}, {"Time_Start": 394.34000000000003, "Time_End": 394.88, "Text": " of a pain."}, {"Time_Start": 395.02, "Time_End": 396.2, "Text": " I don't know if any of you have done that."}, {"Time_Start": 396.40000000000003, "Time_End": 399.06, "Text": " It's, I can't use it with stock kernel."}, {"Time_Start": 399.06, "Time_End": 404.52, "Text": " So, for instance, if I'm one of those people who doesn't like to compile kernels, and there's plenty of them,"}, {"Time_Start": 404.96000000000004, "Time_End": 410.34000000000003, "Text": " you can actually use this product without recompiling your kernel, which is kind of nice."}, {"Time_Start": 410.5, "Time_End": 413.16, "Text": " You just use the source code tree, and I'll get into that later."}, {"Time_Start": 414.0, "Time_End": 415.66, "Text": " So that was one of the reasons for choosing a product."}, {"Time_Start": 415.68, "Time_End": 418.68, "Text": " module another reason you're choosing the module this is a special"}, {"Time_Start": 418.68, "Time_End": 424.8, "Text": " version of loop.0 it has the AES bindings built into it so that if they don't"}, {"Time_Start": 424.8, "Time_End": 431.62, "Text": " have a loop.0 module then they can't even decrypt your data so if you keep the loop"}, {"Time_Start": 431.62, "Time_End": 438.24, "Text": " dot oh module on your device and and mounted in an unencrypted partition and then"}, {"Time_Start": 438.24, "Time_End": 442.26, "Text": " you know in smod and force it from this as opposed to the actual hard drive on"}, {"Time_Start": 442.26, "Time_End": 445.66, "Text": " which your system the person who you're trying to protect your data"}, {"Time_Start": 445.68, "Time_End": 448.06, "Text": " doesn't even know you're trying to protect your data from them."}, {"Time_Start": 449.06, "Time_End": 454.28000000000003, "Text": " I mean, there's no real indication of the fact that it's on the system."}, {"Time_Start": 454.90000000000003, "Time_End": 460.14, "Text": " Adding GNU PG on a device like this even increases your security further."}, {"Time_Start": 460.66, "Time_End": 465.4, "Text": " You essentially have your private key as well as the encrypted password on your keychain USB,"}, {"Time_Start": 465.52, "Time_End": 470.1, "Text": " which is with you at all times, so that even if they get a hold of that, they get a hold of the modules,"}, {"Time_Start": 470.22, "Time_End": 475.44, "Text": " they still have to get a hold of this in the keys, and they have to know your private key password."}, {"Time_Start": 475.68, "Time_End": 477.44, "Text": " before they can get into the device."}, {"Time_Start": 483.40000000000003, "Time_End": 487.2, "Text": " Basically, you can obtain the loop dash AES sources from SourceForge."}, {"Time_Start": 488.48, "Time_End": 494.32, "Text": " If you just go to SourceForge and type in loop dash AES, it will in fact,"}, {"Time_Start": 494.48, "Time_End": 501.2, "Text": " show you the appropriate link. They upgrade it fairly frequently."}, {"Time_Start": 501.74, "Time_End": 505.66, "Text": " I'm rather pleased to say that in the process of the upgrading, they do not."}, {"Time_Start": 505.68, "Time_End": 515.02, "Text": " break, so you can actually have a loop AES 1.0.0.C and loop AES 1.0.6. F. And you can still"}, {"Time_Start": 515.02, "Time_End": 519.44, "Text": " read the file system. It doesn't break the file system from rev to rev, which I've seen other"}, {"Time_Start": 519.44, "Time_End": 524.44, "Text": " products that do do that. And it's kind of nice because that I don't have to redo my encrypted disk"}, {"Time_Start": 524.44, "Time_End": 531.1800000000001, "Text": " every time. When you, there's, loop AES actually has really good documentation. Read the"}, {"Time_Start": 531.1800000000001, "Time_End": 535.66, "Text": " Read Me before you do anything. They tell you exactly what you need to do. Everything everything in the"}, {"Time_Start": 535.6800000000001, "Time_End": 541.82, "Text": " this presentation and a lot more is actually covered in the Read Me. It's very well"}, {"Time_Start": 541.82, "Time_End": 547.58, "Text": " documented. The one thing that they don't tell, they tell you, but, you know, if you want to get started"}, {"Time_Start": 547.58, "Time_End": 552.0600000000001, "Text": " real quick and you don't want to bother reading it, compile your kernel first. In other words,"}, {"Time_Start": 552.3000000000001, "Time_End": 556.6200000000001, "Text": " you don't have to install it, but you at least have to do a make, you know, just make, you know,"}, {"Time_Start": 556.6200000000001, "Time_End": 563.34, "Text": " do some basic kernel options. You cannot compile the loop dot, the loopback file system into your kernel,"}, {"Time_Start": 563.9200000000001, "Time_End": 565.6600000000001, "Text": " and you just do that. And you don't have to worry about it."}, {"Time_Start": 565.6800000000001, "Time_End": 570.24, "Text": " the rest of the modules because that's the only thing you really want. If you're"}, {"Time_Start": 570.24, "Time_End": 575.6400000000001, "Text": " already doing a kernel from scratch, I mean from stock, if you don't like to say you're using Red Hat"}, {"Time_Start": 575.6400000000001, "Time_End": 582.74, "Text": " or one of the other 17,000 different versions of Linux, I bet you could even load the module"}, {"Time_Start": 582.74, "Time_End": 588.2800000000001, "Text": " into BSD using the Linux compatibility mode, which would be an interesting thought if somebody"}, {"Time_Start": 588.2800000000001, "Time_End": 591.6400000000001, "Text": " actually wants to try that, but I don't know how well it would work because it's kernel space"}, {"Time_Start": 591.6400000000001, "Time_End": 595.6600000000001, "Text": " that might do really bad things to your system. You also have to"}, {"Time_Start": 595.6800000000001, "Time_End": 601.0000000000001, "Text": " get what's called the Util Linux collection, which contains a modified mount and low setup"}, {"Time_Start": 601.0000000000001, "Time_End": 607.3000000000001, "Text": " utility. It also contains some modified man pages which tell you how to do things. What you"}, {"Time_Start": 607.3000000000001, "Time_End": 613.72, "Text": " do is you essentially, you get the loop AES source, well first you compile your kernel, then"}, {"Time_Start": 613.72, "Time_End": 620.2600000000001, "Text": " you get the other, then you get Util Linux, you place it, you untar the loop AES tar, then"}, {"Time_Start": 620.2600000000001, "Time_End": 625.2800000000001, "Text": " you take the Utilinix and you put it in there and you untar it there, and then you run their"}, {"Time_Start": 625.28, "Time_End": 630.92, "Text": " utility and they do a, there's a patch, you have to actually run a patch and then you do"}, {"Time_Start": 630.92, "Time_End": 637.86, "Text": " the make and follow the directions and you're pretty much, as they say, cooking with gas."}, {"Time_Start": 637.86, "Time_End": 642.8399999999999, "Text": " So basically the first step is patch Utilinix after you've untarded. Go to Freshmeat if you"}, {"Time_Start": 642.8399999999999, "Time_End": 647.8, "Text": " don't know where Utilinix is and just type in Util dash Linux and you can get the source code."}, {"Time_Start": 647.8, "Time_End": 654.88, "Text": " So you basically do patch minus P0 or less than patch file name. Assuming you are in the directory"}, {"Time_Start": 654.88, "Time_End": 659.74, "Text": " which contains the loop dash AES source. So in other words, if you untargeted in temp,"}, {"Time_Start": 660.02, "Time_End": 665.64, "Text": " it would be slash temp slash loop dash AES dash blah, and then you would do patch minus P0"}, {"Time_Start": 665.64, "Time_End": 672.0, "Text": " once you were in those directories. Again, follow the read me and do exactly what it says."}, {"Time_Start": 673.2, "Time_End": 678.66, "Text": " It really, I mean, I felt kind of dumb because I screwed it up and I messed up a kernel or two"}, {"Time_Start": 678.66, "Time_End": 684.22, "Text": " and I couldn't boot. If I just read the documentation, I would have been fine. So save yourself a"}, {"Time_Start": 684.22, "Time_End": 687.5, "Text": " of pain and read the documentation from top to bottom before you do anything."}, {"Time_Start": 687.82, "Time_End": 688.26, "Text": " I'll say that."}, {"Time_Start": 688.32, "Time_End": 689.4, "Text": " This will be the last time I say that."}, {"Time_Start": 691.82, "Time_End": 693.34, "Text": " So you patch the Utilinix."}, {"Time_Start": 693.9, "Time_End": 696.1600000000001, "Text": " Again, here's some gotchas."}, {"Time_Start": 696.4, "Time_End": 700.34, "Text": " Loop AES requires that loopback support not be put in the kernel."}, {"Time_Start": 700.84, "Time_End": 703.32, "Text": " If you put loop back in the kernel, it will not work."}, {"Time_Start": 704.9, "Time_End": 708.78, "Text": " Make sure that you are using the correct kernel version before compiling."}, {"Time_Start": 708.96, "Time_End": 713.0600000000001, "Text": " In other words, you have to make sure that whatever kernel you want this thing to work for"}, {"Time_Start": 713.0600000000001, "Time_End": 714.2, "Text": " is, in fact, the kernel you'll be able to be."}, {"Time_Start": 714.22, "Time_End": 720.38, "Text": " booting from. Now, what I did with one of the stock Red Hat systems as a test was I took"}, {"Time_Start": 720.38, "Time_End": 726.12, "Text": " whatever the current one was, undid their source code from it, and what happens is, if you don't"}, {"Time_Start": 726.12, "Time_End": 730.1, "Text": " actually compile the kernel yourself, it'll complain. It will say, this will taint the kernel"}, {"Time_Start": 730.1, "Time_End": 735.34, "Text": " and I'm not going to use it. So you can force the kernel load with no detrimental effects to the"}, {"Time_Start": 735.34, "Time_End": 741.1800000000001, "Text": " system, but you have to force it. And there's a couple scripts, which I think I included in this"}, {"Time_Start": 741.1800000000001, "Time_End": 744.2, "Text": " presentation. Anyway, so that's just one."}, {"Time_Start": 744.22, "Time_End": 747.9, "Text": " You have to be obviously root to install kernel modules."}, {"Time_Start": 748.22, "Time_End": 750.9, "Text": " I mean, I figure all of you would know that, but I just wanted to put it in."}, {"Time_Start": 751.36, "Time_End": 755.22, "Text": " You must do a make-menu config before compiling loop AES."}, {"Time_Start": 755.32, "Time_End": 757.02, "Text": " In other words, choose your appropriate kernel options."}, {"Time_Start": 757.26, "Time_End": 759.02, "Text": " And make sure that you choose the right processor."}, {"Time_Start": 759.1600000000001, "Time_End": 760.0, "Text": " Your kernel won't boot."}, {"Time_Start": 764.14, "Time_End": 767.5400000000001, "Text": " You must compile USB in the kernel as a module."}, {"Time_Start": 768.0400000000001, "Time_End": 771.78, "Text": " I had horrible time when I put USB directly in the kernel."}, {"Time_Start": 772.78, "Time_End": 774.2, "Text": " There are order-dependent."}, {"Time_Start": 774.22, "Time_End": 779.36, "Text": " things that need to be done in a certain way for things to work. If you put it in the kernel,"}, {"Time_Start": 779.9, "Time_End": 787.6800000000001, "Text": " the USB-UH-C-I module will load before the modules that you need, and you just can't control"}, {"Time_Start": 787.6800000000001, "Time_End": 792.58, "Text": " the order, and you have to control the order. Now, if you use a stock, Mandrake, Red Hat,"}, {"Time_Start": 793.48, "Time_End": 799.28, "Text": " Susie, or any of them, it'll probably just work out of the box. When I did it was on my old system"}, {"Time_Start": 799.28, "Time_End": 803.9200000000001, "Text": " with, you know, I'm an old kernel person, and I've been compiling kernel since 91."}, {"Time_Start": 804.22, "Time_End": 806.64, "Text": " So I tend to compile my own kernels."}, {"Time_Start": 806.76, "Time_End": 811.98, "Text": " But I just tried it for, just grins' sake, does it work from it?"}, {"Time_Start": 811.98, "Time_End": 815.1800000000001, "Text": " So, anyways, so basically, this is the hard way."}, {"Time_Start": 815.5600000000001, "Time_End": 818.0, "Text": " So you have to compile in SCSI support as a module."}, {"Time_Start": 818.48, "Time_End": 820.84, "Text": " You have to compile in SCSI generic modules."}, {"Time_Start": 821.4, "Time_End": 822.26, "Text": " The disk modules."}, {"Time_Start": 822.46, "Time_End": 826.9, "Text": " You need the USB UHCI, or if you want to use the high-speed version 2,"}, {"Time_Start": 827.34, "Time_End": 833.28, "Text": " you'll need the 2.5.29 kernel series, which also has USB-O-H-H-CI,"}, {"Time_Start": 833.28, "Time_End": 834.2, "Text": " which supports 400."}, {"Time_Start": 834.22, "Time_End": 841.0400000000001, "Text": " mega-second. Default speed for the USB device is 12 megabits. So you're looking at about"}, {"Time_Start": 841.0400000000001, "Time_End": 847.62, "Text": " a megabyte per second transfer when you're actually storing things. Like again, for USB"}, {"Time_Start": 847.62, "Time_End": 853.24, "Text": " 2.0, you will definitely want to use 2.5. Again, it's experimental. Use at your own"}, {"Time_Start": 853.24, "Time_End": 862.6, "Text": " risk. Installing USB. This is, again, for those who like to do it the hard way. You have to install"}, {"Time_Start": 862.6, "Time_End": 863.1, "Text": " SCSI."}, {"Time_Start": 864.22, "Time_End": 874.72, "Text": " SCSI disk, USB, USB, UHCI, and USB storage. After that, you can manually put in your loop.0."}, {"Time_Start": 874.72, "Time_End": 878.84, "Text": " So for instance, after you do all the mod probe, SCSI, mod probe, SCSI, mod probe, SCSI,"}, {"Time_Start": 878.84, "Time_End": 883.74, "Text": " modpub, SCSI, Degeneric, et cetera, et cetera, et cetera, et cetera, et cetera, you do mod probe, space, loop.0."}, {"Time_Start": 884.12, "Time_End": 894.2, "Text": " And of course, if you did it the way that I described with the stock kernel, you would need to do INSMOD and then minus F, followed by the path of where the"}, {"Time_Start": 894.22, "Time_End": 900.78, "Text": " loop.0 is stored. Again, that can depend highly on system. I recommend using,"}, {"Time_Start": 901.48, "Time_End": 910.64, "Text": " I'll wait till the jet passes. Anyways, so you can just do that wherever you want."}, {"Time_Start": 911.74, "Time_End": 916.1600000000001, "Text": " Again, the, I was going to say, see the website for the script to load the modules, but I haven't"}, {"Time_Start": 916.1600000000001, "Time_End": 922.72, "Text": " had a chance to update my DNS. So, anyways, I can provide that script if anyone wants."}, {"Time_Start": 924.22, "Time_End": 925.22, "Text": " It's pretty simple."}, {"Time_Start": 926.72, "Time_End": 929.22, "Text": " Basically, again, follow the ReadMe that comes Loop AES."}, {"Time_Start": 929.4, "Time_End": 933.2, "Text": " The first thing you want to do is run low setup to set up the device."}, {"Time_Start": 933.7, "Time_End": 938.72, "Text": " The commands are in the readme under getting up file system using GNU PG."}, {"Time_Start": 938.72, "Time_End": 946.82, "Text": " This is the particular architecture that I found for a single user system is the best."}, {"Time_Start": 947.52, "Time_End": 953.48, "Text": " There's a lot of other scenarios that cover how to do encrypted swap, how to do encrypted file systems for different users."}, {"Time_Start": 954.22, "Time_End": 957.36, "Text": " how to do, you know, they cover a wide range of options."}, {"Time_Start": 957.36, "Time_End": 959.96, "Text": " And for those of you that don't want to use GNUPG,"}, {"Time_Start": 959.96, "Time_End": 964.5, "Text": " you can just use a nice 40-character password if you're using AES-192,"}, {"Time_Start": 964.5, "Time_End": 965.46, "Text": " which is what I recommend."}, {"Time_Start": 966.12, "Time_End": 970.12, "Text": " 256 is a little too slow, and I think a bit excessive because, I mean, you know,"}, {"Time_Start": 970.1600000000001, "Time_End": 971.6600000000001, "Text": " it's the top end."}, {"Time_Start": 972.5600000000001, "Time_End": 977.08, "Text": " But the 192 version, you have to type in a 40-46 character"}, {"Time_Start": 977.08, "Time_End": 978.58, "Text": " or 40-character password minimum."}, {"Time_Start": 979.44, "Time_End": 981.84, "Text": " So, and you get one chance to type it."}, {"Time_Start": 982.22, "Time_End": 984.1, "Text": " So if you, if you, if you type it wrong,"}, {"Time_Start": 984.22, "Time_End": 986.6800000000001, "Text": " and you forget it, that's it."}, {"Time_Start": 987.02, "Time_End": 988.9200000000001, "Text": " I mean, you type it once, there's no verification."}, {"Time_Start": 989.5600000000001, "Time_End": 992.86, "Text": " You just run low setup, followed by the password, and hope you type it right."}, {"Time_Start": 993.26, "Time_End": 996.62, "Text": " Because if you type it wrong, it's pretty much useless,"}, {"Time_Start": 996.74, "Time_End": 998.8000000000001, "Text": " and you'll have to start over again because you won't be able to mount it."}, {"Time_Start": 1000.38, "Time_End": 1004.44, "Text": " Again, I recommend manually mounting the file system to test it."}, {"Time_Start": 1004.94, "Time_End": 1010.36, "Text": " You can try doing, they have a nice part where they talk about using FS tab,"}, {"Time_Start": 1010.36, "Time_End": 1013.5, "Text": " where you just put, you know, the device name, which can be a file."}, {"Time_Start": 1014.22, "Time_End": 1021.78, "Text": " this would be like slash mNT slash file one, which is the actual encrypted loop LO setup device that you created."}, {"Time_Start": 1022.36, "Time_End": 1029.1200000000001, "Text": " Now, all setup can be used in several ways. It can be used on files. It can be used at the block level."}, {"Time_Start": 1029.1200000000001, "Time_End": 1037.44, "Text": " In other words, I can do LO setup slash dev slash SDA1. I can actually set up a device instead of just a file."}, {"Time_Start": 1037.94, "Time_End": 1044.2, "Text": " So the entire file system is encrypted. It's not even just a file, but the whole file system is loop A,"}, {"Time_Start": 1044.22, "Time_End": 1049.98, "Text": " ES encrypted. So it's just absolute garbage and it's not a file. So then you can even"}, {"Time_Start": 1049.98, "Time_End": 1054.9, "Text": " obfuscate what type of file system it is until they actually know what the encryption is. So you"}, {"Time_Start": 1054.9, "Time_End": 1060.72, "Text": " can use like a mega file system if you really want to be obscure and really make things difficult."}, {"Time_Start": 1060.72, "Time_End": 1065.04, "Text": " Because you've got to know, I mean, yeah, you can look at the header, but I mean, the average person who"}, {"Time_Start": 1065.04, "Time_End": 1069.34, "Text": " would probably be trying to do that probably wouldn't think that. You know, if you can eliminate"}, {"Time_Start": 1069.34, "Time_End": 1073.6200000000001, "Text": " 75% of the un-clever people in the world, you've done a very well job. So anyways."}, {"Time_Start": 1074.22, "Time_End": 1081.22, "Text": " Keep all the scripts and modules on a separate removable hard drive."}, {"Time_Start": 1081.22, "Time_End": 1086.22, "Text": " This. Keep G&U. PG's on a USB keychain."}, {"Time_Start": 1086.22, "Time_End": 1089.22, "Text": " Don't forget, back up your USB disk."}, {"Time_Start": 1089.22, "Time_End": 1093.22, "Text": " Because if this suddenly drops from a very high hide onto concrete,"}, {"Time_Start": 1093.22, "Time_End": 1095.22, "Text": " all of your data will be gone."}, {"Time_Start": 1095.22, "Time_End": 1099.22, "Text": " So I recommend, there's several ways you can back up."}, {"Time_Start": 1099.22, "Time_End": 1100.22, "Text": " If you're using a file, it's really easy."}, {"Time_Start": 1100.22, "Time_End": 1102.22, "Text": " Just copy the file to a remote media."}, {"Time_Start": 1102.22, "Time_End": 1103.22, "Text": " If anyone gets a hold of it, so what?"}, {"Time_Start": 1103.22, "Time_End": 1107.72, "Text": " get the hold of it, so what? They can't do anything with it. If you want to actually do the file system,"}, {"Time_Start": 1107.72, "Time_End": 1112.98, "Text": " you kind of have to unencrypt the data, you know, while the file system is mounted, you have to back it up,"}, {"Time_Start": 1112.98, "Time_End": 1119.6200000000001, "Text": " make a tar, and then if you're really worried, GNU, PG encrypt it, and store it on a CD or dat tape"}, {"Time_Start": 1119.6200000000001, "Time_End": 1126.6200000000001, "Text": " or whatever it is that you use to back up. Basically, what I do is, I actually have, on this guy,"}, {"Time_Start": 1126.6200000000001, "Time_End": 1133.2, "Text": " there's three partitions. The first one, is a Windows partition, don't tell anybody. The second one is a Windows partition. Don't tell anybody. The second one is a"}, {"Time_Start": 1133.22, "Time_End": 1139.58, "Text": " is just a device-level encrypted EXT3 file system, which is actually not really."}, {"Time_Start": 1139.68, "Time_End": 1142.04, "Text": " It's a loop AES. I used LOS setup to set it up."}, {"Time_Start": 1142.84, "Time_End": 1149.52, "Text": " And then the third is unencrypted, and I keep the keys on that, just because at the time I didn't have this."}, {"Time_Start": 1150.06, "Time_End": 1154.52, "Text": " And for those of you that don't want to spend the extra money, it's a slightly more convenient way."}, {"Time_Start": 1154.56, "Time_End": 1157.78, "Text": " So what you have to do is you have to go to root because you have to be root to do all this,"}, {"Time_Start": 1157.78, "Time_End": 1161.74, "Text": " unless you want to set up pseudo or make the mountable by users."}, {"Time_Start": 1162.2, "Time_End": 1163.2, "Text": " But basically, go into root,"}, {"Time_Start": 1163.22, "Time_End": 1171.78, "Text": " you simlink the dot GNUPG directory in the root file system to the place where you store"}, {"Time_Start": 1171.78, "Time_End": 1178.8, "Text": " your GNUPG keys to decryp the file system. So that way you don't have to do any, you don't keep"}, {"Time_Start": 1178.8, "Time_End": 1184.3, "Text": " any of the public keys on the system. That's the whole purpose of the exercise. You basically,"}, {"Time_Start": 1184.94, "Time_End": 1192.52, "Text": " I mount the USB hard drive on like home slash username, whatever that happens to be, and I create a"}, {"Time_Start": 1192.52, "Time_End": 1196.46, "Text": " script that automatically mounts the disc. And again, that script, you can do one"}, {"Time_Start": 1196.46, "Time_End": 1200.4, "Text": " of two ways. If you want to do it conveniently, you get a shell code compiler, and you write the"}, {"Time_Start": 1200.4, "Time_End": 1204.68, "Text": " script, you name it something obscure, and you shell code compile it, so it's just another binary."}, {"Time_Start": 1204.84, "Time_End": 1210.26, "Text": " So you name it like LS1. So like for mounting, for instance, you'd have LS1, for unmounting would be"}, {"Time_Start": 1210.26, "Time_End": 1215.2, "Text": " LS2. So if they look at your history, they say, oh, LS1, and it doesn't print anything out,"}, {"Time_Start": 1215.24, "Time_End": 1219.5, "Text": " and you really don't know what it does, because you just turn all the echoing off. And so it's fairly"}, {"Time_Start": 1219.5, "Time_End": 1222.5, "Text": " obscure. And it's still convenient, so you have this script."}, {"Time_Start": 1222.52, "Time_End": 1227.6399999999999, "Text": " on the system. If you're really paranoid, you put it on here and just shell script format."}, {"Time_Start": 1228.28, "Time_End": 1232.74, "Text": " I have a start and end script, which I keep unencrypted on the disk because I don't really care. I'm not"}, {"Time_Start": 1232.74, "Time_End": 1240.68, "Text": " that paranoid. So I log in his route. I type in start. It asks me for my GNU-PG phrase, which actually"}, {"Time_Start": 1240.68, "Time_End": 1245.4, "Text": " I haven't migrated it yet. It would look here for it. And this is a, you can also sim link to this. I mean,"}, {"Time_Start": 1245.4, "Time_End": 1252.5, "Text": " whatever your SIM link is, you create it to where your keys are stored. Now there's two keys. Well, there's two parts of it. There's your private"}, {"Time_Start": 1252.52, "Time_End": 1259.06, "Text": " key, which is used to decrypt. Then there is the actual encrypted 47 random, like you take like"}, {"Time_Start": 1259.06, "Time_End": 1266.66, "Text": " dev random and you actually cat it to a file and then you encrypt that file with the GNUPG. You have to"}, {"Time_Start": 1266.66, "Time_End": 1270.62, "Text": " make it ASC or it doesn't work very well. But so you actually like dev random. So you're actually"}, {"Time_Start": 1270.62, "Time_End": 1276.44, "Text": " using a fairly random password that's 47 or however many characters you want. There's a nice little"}, {"Time_Start": 1276.44, "Time_End": 1282.3, "Text": " DD hack. I think I live, I don't know if I listed in here, but it's pretty cool because it actually creates, it's in the"}, {"Time_Start": 1282.3, "Time_End": 1286.74, "Text": " documentation when you get the loop AES package. So you can set your box size to"}, {"Time_Start": 1286.74, "Time_End": 1291.78, "Text": " 104 and have a 104 character password if you really, really, really, really want to make it"}, {"Time_Start": 1291.78, "Time_End": 1297.68, "Text": " hard for someone to get it. Again, erase roots bash history. If you're really paranoid,"}, {"Time_Start": 1298.48, "Time_End": 1302.3, "Text": " your dot bash history has absolutely everything or dot whatever the other one is dot history."}, {"Time_Start": 1302.3, "Time_End": 1309.18, "Text": " I don't, if you're using Sun. Although if you're using Sun, you can use Linux. Anyways, so I"}, {"Time_Start": 1309.18, "Time_End": 1312.28, "Text": " either link it to DevNol or, you know, have"}, {"Time_Start": 1312.3, "Time_End": 1317.1, "Text": " a script that at the end script greater than, you know, roots, batch, that's history,"}, {"Time_Start": 1317.1, "Time_End": 1320.8999999999999, "Text": " so that it gets rid of any evidence of that having been used."}, {"Time_Start": 1320.8999999999999, "Time_End": 1332.54, "Text": " Okay. Here's the hardware sources again. The 30-gig USB drive is"}, {"Time_Start": 1332.54, "Time_End": 1339.58, "Text": " www.b.b.com. Now, they're friendly Chinese people and don't ask them on how to get this"}, {"Time_Start": 1339.58, "Time_End": 1342.28, "Text": " to working in Linux, but it does work. I actually have made it work."}, {"Time_Start": 1342.3, "Time_End": 1349.3, "Text": " work. With the modern USB kernel, it's just plug and play. In fact, it even unmounts it automatically if you just unplug it. It's kind of cool."}, {"Time_Start": 1349.3, "Time_End": 1356.3, "Text": " The keychains, you can Google USB keychain. I like the T-Rex one because it's really small."}, {"Time_Start": 1356.3, "Time_End": 1361.3, "Text": " It's small and it actually has a little key thing on it. There's about 14 different ones you can get."}, {"Time_Start": 1361.3, "Time_End": 1369.8, "Text": " You might want to get a USB hub, especially if you're using this because you've got to plug it in the back of the computer or you have to get one of those stupid extension cables."}, {"Time_Start": 1369.8, "Time_End": 1372.28, "Text": " So I recommend a four-part USB hub."}, {"Time_Start": 1372.3, "Time_End": 1373.3, "Text": " hub."}, {"Time_Start": 1373.3, "Time_End": 1377.18, "Text": " Now, even better is if you get a USB 2.0 controller."}, {"Time_Start": 1377.18, "Time_End": 1384.06, "Text": " Now some interesting things I've found, there is a new USB 2.0 PCMCAIA card available at"}, {"Time_Start": 1384.06, "Time_End": 1385.7, "Text": " $60."}, {"Time_Start": 1385.7, "Time_End": 1390.82, "Text": " And what you can do is, so if you want to be cheap, you buy yourself a PC card reader for your"}, {"Time_Start": 1390.82, "Time_End": 1397.3, "Text": " desktop, and you plug it into your desktop, and then if you want to use it on your laptop, you just"}, {"Time_Start": 1397.3, "Time_End": 1399.7, "Text": " plug the USB 2.0 into your laptop."}, {"Time_Start": 1399.7, "Time_End": 1402.28, "Text": " So it's kind of a portable way to take the USB 2.0."}, {"Time_Start": 1402.3, "Time_End": 1406.96, "Text": " with you without having to spend $60, you know, the N plus one for each one you want,"}, {"Time_Start": 1407.0, "Time_End": 1411.62, "Text": " you have to buy the controller. The only thing I have not tested, because I did not have a chance"}, {"Time_Start": 1411.62, "Time_End": 1418.18, "Text": " to buy it, whether or not it actually works under Linux. Now, I do know it uses the one that I found"}, {"Time_Start": 1418.18, "Time_End": 1424.44, "Text": " was a, I can't remember it was A-Tech or something, A-Tech. And it uses the NEC chip set,"}, {"Time_Start": 1424.44, "Time_End": 1432.28, "Text": " which is reputed to work in the kernel traffic. And as of the 2.5.29, as of five, you know,"}, {"Time_Start": 1432.3, "Time_End": 1435.84, "Text": " yesterday supposedly has been listed as working."}, {"Time_Start": 1435.84, "Time_End": 1438.8999999999999, "Text": " I've not tried it, so don't hold me to that."}, {"Time_Start": 1438.8999999999999, "Time_End": 1443.12, "Text": " But it's ironic to think that Linux will probably have USB 2.0 support"}, {"Time_Start": 1443.12, "Time_End": 1444.6, "Text": " before Windows."}, {"Time_Start": 1444.6, "Time_End": 1449.98, "Text": " Anyways, since the file system is encrypted"}, {"Time_Start": 1449.98, "Time_End": 1453.52, "Text": " at the device level, you can put stuff on NFS drives"}, {"Time_Start": 1453.52, "Time_End": 1456.12, "Text": " and have the contents be secure from eavesdropping."}, {"Time_Start": 1456.12, "Time_End": 1458.3999999999999, "Text": " So for instance, one of the applications"}, {"Time_Start": 1458.3999999999999, "Time_End": 1462.28, "Text": " that you can actually do is have an NFS drive."}, {"Time_Start": 1462.3, "Time_End": 1466.2, "Text": " where you keep your home directory. Say that you've got NFS mounts and you don't"}, {"Time_Start": 1466.2, "Time_End": 1470.94, "Text": " want, you know, Joe Blow system administrator who you don't have any control over looking"}, {"Time_Start": 1470.94, "Time_End": 1476.04, "Text": " to your stuff. So you create a happy little file system that you mount with a"}, {"Time_Start": 1476.04, "Time_End": 1480.6, "Text": " low setup. Now obviously if you don't have control of your workstation, well you're out of"}, {"Time_Start": 1480.6, "Time_End": 1485.52, "Text": " luck. But for the most part, if you can do a boot or you know run any kind of, well not that I"}, {"Time_Start": 1485.52, "Time_End": 1489.6, "Text": " would ever advocate hacking a Solaris box, but it takes about 10 seconds to get root"}, {"Time_Start": 1489.6, "Time_End": 1492.28, "Text": " on a Solaris box and install your own modules, although"}, {"Time_Start": 1492.3, "Time_End": 1494.2, "Text": " it wouldn't work on a Solaris box because it's not Linux."}, {"Time_Start": 1494.3, "Time_End": 1499.58, "Text": " But anyways, you could actually GAC, put it on an SMB file system."}, {"Time_Start": 1499.68, "Time_End": 1504.74, "Text": " So you could actually use Low Setup, set up the file system across the network on your Windows network"}, {"Time_Start": 1504.74, "Time_End": 1508.8999999999999, "Text": " and use Low Setup and mount to mount the file system using SMB."}, {"Time_Start": 1509.12, "Time_End": 1511.9199999999998, "Text": " You could do the same thing for Netware, you could use the same thing for Andrew,"}, {"Time_Start": 1511.9199999999998, "Time_End": 1515.98, "Text": " you could do the same thing for any kind of a disconnected, any kind of a file system."}, {"Time_Start": 1516.54, "Time_End": 1519.96, "Text": " So you, I mean, for the, you know, so it's really powerful."}, {"Time_Start": 1520.46, "Time_End": 1521.76, "Text": " So you can essentially have"}, {"Time_Start": 1521.76, "Time_End": 1524.3, "Text": " trusted data on an untrusted source."}, {"Time_Start": 1524.54, "Time_End": 1528.36, "Text": " Now, the nice thing is, is when the data is being sent across the network, it's encrypted."}, {"Time_Start": 1528.92, "Time_End": 1530.98, "Text": " Because it's going through the loopback driver."}, {"Time_Start": 1531.36, "Time_End": 1535.76, "Text": " What happens is, is the data essentially, it goes to the unencrypted of a loopback device."}, {"Time_Start": 1535.9, "Time_End": 1539.52, "Text": " The loopback device encrypts it with AES and writes it to the device."}, {"Time_Start": 1540.02, "Time_End": 1542.32, "Text": " So that no matter where you're writing to, it's always encrypted."}, {"Time_Start": 1543.24, "Time_End": 1546.14, "Text": " Obviously, if someone has access to the local system, well, no."}, {"Time_Start": 1546.44, "Time_End": 1548.32, "Text": " Or, yes, and now here are some caveats."}, {"Time_Start": 1548.72, "Time_End": 1551.74, "Text": " If your loop file system is mounted, it is very much."}, {"Time_Start": 1551.76, "Time_End": 1556.76, "Text": " It means it is unencrypted and it is currently readable by anyone who has read access"}, {"Time_Start": 1556.76, "Time_End": 1557.76, "Text": " to the system."}, {"Time_Start": 1557.76, "Time_End": 1562.76, "Text": " Now you can use file system permissions in Unix to make it 7-00 and protect it a little better,"}, {"Time_Start": 1562.76, "Time_End": 1566.76, "Text": " but again, that's subject to the file system permissions in Unix."}, {"Time_Start": 1566.76, "Time_End": 1571.76, "Text": " Another thing you need to bear in mind is that if you lose your key, you have lost the data."}, {"Time_Start": 1571.76, "Time_End": 1574.76, "Text": " It's pretty much history, so back up your keys."}, {"Time_Start": 1574.76, "Time_End": 1579.76, "Text": " In fact, media like this are nice because you can put a right protect tab on this."}, {"Time_Start": 1579.76, "Time_End": 1580.76, "Text": " And you just put it in right protect mode."}, {"Time_Start": 1580.76, "Time_End": 1585.44, "Text": " protect mode and you're done it's it's it's flash media it's not being"}, {"Time_Start": 1585.44, "Time_End": 1589.82, "Text": " rewritten so it'll practically never wear out in theory so that's a nice"}, {"Time_Start": 1589.82, "Time_End": 1593.3, "Text": " thought for they're durable you drop them who cares you know and it's there's no"}, {"Time_Start": 1593.3, "Time_End": 1597.26, "Text": " moving parts you drop this you're in trouble especially if it's moving"}, {"Time_Start": 1597.26, "Time_End": 1603.98, "Text": " um again another thing another another another thought devices like this for"}, {"Time_Start": 1603.98, "Time_End": 1610.1, "Text": " instance the terrapin mine you can use those kinds of devices you can use PDAs and if"}, {"Time_Start": 1610.1, "Time_End": 1610.74, "Text": " anything with"}, {"Time_Start": 1610.76, "Time_End": 1615.06, "Text": " removable, accessible storage with a removable mountable file system."}, {"Time_Start": 1615.16, "Time_End": 1621.08, "Text": " In other words, all these devices that you have that can do Windows SMB, you can use to store the data."}, {"Time_Start": 1621.8799999999999, "Time_End": 1626.18, "Text": " So your form factor is practically unlimited with this application."}, {"Time_Start": 1627.0, "Time_End": 1632.44, "Text": " Again, you can do it across wireless, you can do it with this, you can do it with this, you can do it with this,"}, {"Time_Start": 1632.44, "Time_End": 1640.74, "Text": " you can do it with a one-gig keychain, so your your options for where you want to store the stuff, you can store it on CDRW."}, {"Time_Start": 1640.76, "Time_End": 1642.8799999999999, "Text": " if you just want to have a CDRW drive."}, {"Time_Start": 1646.3799999999999, "Time_End": 1648.72, "Text": " And, okay, other possibilities."}, {"Time_Start": 1648.84, "Time_End": 1652.4, "Text": " Foppies, zip disks, jazz disks, avoid, they do tend to eat data."}, {"Time_Start": 1653.56, "Time_End": 1654.9, "Text": " Encrypted root file systems."}, {"Time_Start": 1655.02, "Time_End": 1659.14, "Text": " You can actually have the root file system before you even boot the system be encrypted."}, {"Time_Start": 1659.54, "Time_End": 1664.0, "Text": " So if you're truly paranoid and have a laptop, you type in a password before it will even boot."}, {"Time_Start": 1664.7, "Time_End": 1667.82, "Text": " I mean, after the BIOS password, which of course you all put on your laptops, don't you?"}, {"Time_Start": 1668.68, "Time_End": 1670.74, "Text": " Encrypted swap, for those of you worried about."}, {"Time_Start": 1670.76, "Time_End": 1673.86, "Text": " what goes on in your swap and whether or not it can be read."}, {"Time_Start": 1674.58, "Time_End": 1679.42, "Text": " Again, view the ReadMe file inside of Loop Dash AES for even more wonderful ideas."}, {"Time_Start": 1680.46, "Time_End": 1687.86, "Text": " And this is the part where actually, where I stop, because this is the other option that I did not correct."}, {"Time_Start": 1687.96, "Time_End": 1688.6, "Text": " How much time do I have?"}, {"Time_Start": 1688.62, "Time_End": 1689.12, "Text": " What time is it?"}, {"Time_Start": 1691.32, "Time_End": 1692.28, "Text": " I have 30 minutes?"}, {"Time_Start": 1693.28, "Time_End": 1694.12, "Text": " 25 minutes."}, {"Time_Start": 1694.5, "Time_End": 1694.72, "Text": " Okay."}, {"Time_Start": 1695.56, "Time_End": 1697.3, "Text": " I'm going to open you up for questions in a second."}, {"Time_Start": 1697.3, "Time_End": 1700.74, "Text": " I ran across a very cool utility on FreshMeet."}, {"Time_Start": 1700.76, "Time_End": 1707.1, "Text": " two days ago. It's called SMB, I mean, Pam underscore mount. And what it does, I haven't"}, {"Time_Start": 1707.1, "Time_End": 1712.52, "Text": " used it yet, but it allows a user to mount a loopback encrypted file system automatically"}, {"Time_Start": 1712.52, "Time_End": 1717.3799999999999, "Text": " upon login. So all that nasty stuff that I saw about logging in his route, you don't even need to"}, {"Time_Start": 1717.3799999999999, "Time_End": 1723.14, "Text": " do that. You just log in as your user, you type your password, and in theory, it'll mount your file"}, {"Time_Start": 1723.14, "Time_End": 1729.96, "Text": " system. Be aware that the character password thing, though, might be a problem, because if you only"}, {"Time_Start": 1729.96, "Time_End": 1734.9, "Text": " have a minuscule eight-character password, loop AES will say, go to hell, and you're not going"}, {"Time_Start": 1734.9, "Time_End": 1740.58, "Text": " to encrypt this, because I need 40 characters. So you, you know, remember your famous quotes and"}, {"Time_Start": 1740.58, "Time_End": 1744.64, "Text": " things like that for passwords. They make very good passwords. Well, at least they did make very good"}, {"Time_Start": 1744.64, "Time_End": 1753.42, "Text": " passwords. Again, so that's, so SMB underscore mount is a very cool thing. And like I said, I've"}, {"Time_Start": 1753.42, "Time_End": 1759.64, "Text": " been using this now for three months. I, like I said, I go in the morning, I mount the device,"}, {"Time_Start": 1759.96, "Time_End": 1764.32, "Text": " I save all my stuff. The only time I ever notice the fact that it's only a megabyte per second"}, {"Time_Start": 1764.32, "Time_End": 1769.68, "Text": " is when I'm compiling source code and I forget that I actually am on the system, or when I'm"}, {"Time_Start": 1769.68, "Time_End": 1774.7, "Text": " copying things from it that are not, you know, anything more than one megabit, obviously copying a"}, {"Time_Start": 1774.7, "Time_End": 1779.82, "Text": " 10 megabyte file from that file to say temp for whatever. That's the only time I notice because"}, {"Time_Start": 1779.82, "Time_End": 1786.06, "Text": " its file system caches everything. So you really don't see the performance penalty. Another thing"}, {"Time_Start": 1786.06, "Time_End": 1789.94, "Text": " is I highly recommend using EXT3 on any kind of"}, {"Time_Start": 1789.96, "Time_End": 1797.4, "Text": " of removable device. FSCane, a 10 gig disk, or a 30 gig disk, can take years off your life."}, {"Time_Start": 1797.4, "Time_End": 1803.72, "Text": " So I highly recommend that you run a journaling file system of some kind or some kind of a soft update system,"}, {"Time_Start": 1803.72, "Time_End": 1807.08, "Text": " because these things can be disconnected in moments notice."}, {"Time_Start": 1807.08, "Time_End": 1813.48, "Text": " Again, the USB 2.0 option is very cool because this goes from 1 megasecond to 7, or 8 megs a second."}, {"Time_Start": 1813.48, "Time_End": 1819.94, "Text": " For processor, I have a 1 gigahertz aathlon, and I have not noticed any significant"}, {"Time_Start": 1819.96, "Time_End": 1826.0, "Text": " processor utilization even during heavy of disk access, 2% with no difference."}, {"Time_Start": 1826.0, "Time_End": 1831.8600000000001, "Text": " I benchmarked the non-encrypted versus the encrypted partition, so at one megabit, there is no system"}, {"Time_Start": 1831.8600000000001, "Time_End": 1837.82, "Text": " slow down on a reasonably modern processor. Obviously, the libretto would probably be a different story."}, {"Time_Start": 1839.46, "Time_End": 1842.74, "Text": " Other than that, you know, here's the little, this thing's kind of cool because it comes with"}, {"Time_Start": 1842.74, "Time_End": 1848.3600000000001, "Text": " like a little case and a nice, well, this is the yucky belkin one, but they actually comes"}, {"Time_Start": 1848.3600000000001, "Time_End": 1850.0600000000002, "Text": " with a really nice cable that's really long."}, {"Time_Start": 1850.0600000000002, "Time_End": 1851.46, "Text": " So you can just take it with you."}, {"Time_Start": 1851.46, "Time_End": 1854.2400000000002, "Text": " And in addition to using this thing for your,"}, {"Time_Start": 1854.2400000000002, "Time_End": 1857.1200000000001, "Text": " you can have all your analysis tools on this,"}, {"Time_Start": 1857.1200000000001, "Time_End": 1858.92, "Text": " and you just plug it into your compromised host,"}, {"Time_Start": 1858.92, "Time_End": 1861.8000000000002, "Text": " you've got your statically linked versions of all your utilities,"}, {"Time_Start": 1861.8000000000002, "Time_End": 1863.42, "Text": " and you can use it for forensics."}, {"Time_Start": 1863.42, "Time_End": 1865.92, "Text": " Anyways, I feel like the Ginzu commercial."}, {"Time_Start": 1867.1200000000001, "Time_End": 1870.1000000000001, "Text": " Anyways, do you want me to open this up for questions now?"}, {"Time_Start": 1870.4, "Time_End": 1871.5200000000002, "Text": " I'm pretty much done."}, {"Time_Start": 1872.5200000000002, "Time_End": 1875.6000000000001, "Text": " If we're an active, are we an active group"}, {"Time_Start": 1875.6000000000001, "Time_End": 1877.2400000000002, "Text": " for asking questions?"}, {"Time_Start": 1877.2400000000002, "Time_End": 1878.3400000000001, "Text": " I'm asking the audience."}, {"Time_Start": 1878.3600000000001, "Time_End": 1882.92, "Text": " as somewhat non-ritorical or are we all hot and just want to be done?"}, {"Time_Start": 1885.0000000000002, "Time_End": 1885.88, "Text": " I'm, sir."}, {"Time_Start": 1888.5200000000002, "Time_End": 1890.14, "Text": " The URL for which?"}, {"Time_Start": 1892.5600000000002, "Time_End": 1896.38, "Text": " The URLs, I thought that I had them, but I don't think I do."}, {"Time_Start": 1896.94, "Time_End": 1901.66, "Text": " The URL actually for Loop AES is, I'm going to have to go through this."}, {"Time_Start": 1902.8000000000002, "Time_End": 1904.0200000000002, "Text": " Come on, BSD."}, {"Time_Start": 1905.96, "Time_End": 1907.48, "Text": " I thought I had the URLs."}, {"Time_Start": 1908.3600000000001, "Time_End": 1909.3600000000001, "Text": " I don't."}, {"Time_Start": 1909.3600000000001, "Time_End": 1916.8000000000002, "Text": " The URL for Loop AES, go to SourceForge, and go the little search box and type in loop dash AES."}, {"Time_Start": 1916.8000000000002, "Time_End": 1918.18, "Text": " That will find it."}, {"Time_Start": 1918.18, "Time_End": 1924.0800000000002, "Text": " For Pam underscore Mount, let me go to a command prompt, and I will tell you exactly what that is,"}, {"Time_Start": 1924.0800000000002, "Time_End": 1926.4, "Text": " because I do have that on the system."}, {"Time_Start": 1926.4, "Time_End": 1930.42, "Text": " www.baseoncom is where you buy these."}, {"Time_Start": 1930.42, "Time_End": 1938.2800000000002, "Text": " And obviously, www. nomadworld.com, not that I buy one, because it's pretty useless at this point, but"}, {"Time_Start": 1938.3600000000001, "Time_End": 1939.3600000000001, "Text": " They're cool."}, {"Time_Start": 1939.3600000000001, "Time_End": 1943.3600000000001, "Text": " Control all backses."}, {"Time_Start": 1943.3600000000001, "Time_End": 1944.3600000000001, "Text": " Okay."}, {"Time_Start": 1944.3600000000001, "Time_End": 1945.3600000000001, "Text": " Yes, I'm Wagner's route."}, {"Time_Start": 1945.3600000000001, "Time_End": 1947.3600000000001, "Text": " I know it's bad."}, {"Time_Start": 1947.3600000000001, "Time_End": 1948.3600000000001, "Text": " Okay."}, {"Time_Start": 1948.3600000000001, "Time_End": 1953.3600000000001, "Text": " Where CD slash home slash jam?"}, {"Time_Start": 1953.3600000000001, "Time_End": 1957.3600000000001, "Text": " Okay."}, {"Time_Start": 1957.3600000000001, "Time_End": 1960.3600000000001, "Text": " CD, Pam."}, {"Time_Start": 1960.3600000000001, "Time_End": 1963.3600000000001, "Text": " Pam underscore Mount is available on Freshmeet."}, {"Time_Start": 1963.3600000000001, "Time_End": 1964.3600000000001, "Text": " www."}, {"Time_Start": 1964.3600000000001, "Time_End": 1965.3600000000001, "Text": " www."}, {"Time_Start": 1965.3600000000001, "Time_End": 1966.3600000000001, "Text": " Freshmeat."}, {"Time_Start": 1966.3600000000001, "Time_End": 1967.3600000000001, "Text": " And just type in Freshmeet."}, {"Time_Start": 1967.3600000000001, "Time_End": 1969.3600000000001, "Text": " fresh meat."}, {"Time_Start": 1969.3600000000001, "Time_End": 1970.3600000000001, "Text": " www."}, {"Time_Start": 1970.3600000000001, "Time_End": 1971.3600000000001, "Text": " fresh meat."}, {"Time_Start": 1971.3600000000001, "Time_End": 1975.3600000000001, "Text": " It is not a porn site, although that sounds like one."}, {"Time_Start": 1975.3600000000001, "Time_End": 1982.3600000000001, "Text": " Anyway, so basically, so that's the Pam Mount utility."}, {"Time_Start": 1982.3600000000001, "Time_End": 1987.3600000000001, "Text": " That one is, I'm going to play with it because it's kind of nice to think that you could have a multi-user"}, {"Time_Start": 1987.3600000000001, "Time_End": 1992.3600000000001, "Text": " system with different encryption options for each different user."}, {"Time_Start": 1992.3600000000001, "Time_End": 1994.3600000000001, "Text": " Any other questions?"}, {"Time_Start": 1994.3600000000001, "Time_End": 1996.3600000000001, "Text": " Oh, I guess you."}, {"Time_Start": 1996.3600000000001, "Time_End": 1997.3600000000001, "Text": " Do you?"}, {"Time_Start": 1997.3600000000001, "Time_End": 2001.3600000000001, "Text": " If you have an IDE hard disk, can you just put any kind of overhead on that?"}, {"Time_Start": 2001.3600000000001, "Time_End": 2004.3600000000001, "Text": " If you have an IDE hard disk, what?"}, {"Time_Start": 2004.3600000000001, "Time_End": 2011.3600000000001, "Text": " Oh, you're basically asking, can you encrypt a block device, like an IDE hard disk?"}, {"Time_Start": 2011.3600000000001, "Time_End": 2012.3600000000001, "Text": " Yes."}, {"Time_Start": 2012.3600000000001, "Time_End": 2017.3600000000001, "Text": " You can use any, you can use any kind of a device that is a block device."}, {"Time_Start": 2017.3600000000001, "Time_End": 2023.3600000000001, "Text": " I, negligible, because it's AES, it's actually designed to be fast."}, {"Time_Start": 2023.3600000000001, "Time_End": 2025.3600000000001, "Text": " It uses the Rendell algorithm, if you're familiar with."}, {"Time_Start": 2025.3600000000001, "Time_End": 2032.66, "Text": " If you're familiar with that, it's much more efficient than does, or triple does, which is just a nightmare without hard work acceleration."}, {"Time_Start": 2032.66, "Time_End": 2037.16, "Text": " Like I said, in a modern processor, probably about 4% to 5% of processor."}, {"Time_Start": 2038.5600000000002, "Time_End": 2039.7600000000002, "Text": " Again, it's..."}, {"Time_Start": 2039.7600000000002, "Time_End": 2045.72, "Text": " Therapeut, the same. I've not seen any slowdown up to a megabit."}, {"Time_Start": 2045.96, "Time_End": 2052.32, "Text": " Now, if you start looking at 30, 40, 50, 100 megs a second, there might be some issues, but that's what multiprocessors are for."}, {"Time_Start": 2055.36, "Time_End": 2062.36, "Text": " No, I didn't say that. I've only tested up to a megabyte per second. I have used it on a system"}, {"Time_Start": 2062.36, "Time_End": 2068.36, "Text": " where I was using a 26 meg per disk, just subjective, and I did not notice any difference."}, {"Time_Start": 2068.36, "Time_End": 2072.36, "Text": " I was able to copy a file almost instantaneously as if it was a normal hard drive."}, {"Time_Start": 2072.36, "Time_End": 2074.36, "Text": " It's pretty much transparent."}, {"Time_Start": 2074.36, "Time_End": 2076.36, "Text": " Questions continued?"}, {"Time_Start": 2076.36, "Time_End": 2079.36, "Text": " I guess the gentleman in the black over there, you."}, {"Time_Start": 2082.36, "Time_End": 2084.36, "Text": " Please speak up much louder. I cannot hear you."}, {"Time_Start": 2084.36, "Time_End": 2086.36, "Text": " I cannot hear you."}, {"Time_Start": 2094.36, "Time_End": 2095.36, "Text": " Can you come up?"}, {"Time_Start": 2095.36, "Time_End": 2098.36, "Text": " I cannot hear you."}, {"Time_Start": 2098.36, "Time_End": 2099.36, "Text": " Okay, thank you."}, {"Time_Start": 2099.36, "Time_End": 2107.36, "Text": " Is there a risk to do a crypto analysis using the well-known data like to super-blocks and some well-known"}, {"Time_Start": 2107.36, "Time_End": 2110.36, "Text": " Yeah."}, {"Time_Start": 2110.36, "Time_End": 2113.36, "Text": " There is obviously the problem that if Mount knows how to"}, {"Time_Start": 2113.36, "Time_End": 2117.36, "Text": " to mount a loopback encrypted file system,"}, {"Time_Start": 2117.36, "Time_End": 2120.36, "Text": " probably someone doing crypto analysis"}, {"Time_Start": 2120.36, "Time_End": 2122.36, "Text": " would be able to see the fact that it was, in fact,"}, {"Time_Start": 2122.36, "Time_End": 2124.36, "Text": " done using that cipher."}, {"Time_Start": 2124.36, "Time_End": 2128.36, "Text": " However, at least you've introduced a layer of obscurity,"}, {"Time_Start": 2128.36, "Time_End": 2131.36, "Text": " which I know they say security through obscurity is bad,"}, {"Time_Start": 2131.36, "Time_End": 2134.36, "Text": " but it's at least a layer of obscurity that"}, {"Time_Start": 2134.36, "Time_End": 2137.36, "Text": " probably 75 to 95% of the people in the world,"}, {"Time_Start": 2137.36, "Time_End": 2140.36, "Text": " or at least in most circles that you run into,"}, {"Time_Start": 2140.36, "Time_End": 2142.36, "Text": " are not going to be able to figure out."}, {"Time_Start": 2142.36, "Time_End": 2143.36, "Text": " But I think to answer your question,"}, {"Time_Start": 2143.36, "Time_End": 2146.86, "Text": " yes, cryptanalysis would probably reveal the fact, the existence of the disk."}, {"Time_Start": 2147.36, "Time_End": 2149.36, "Text": " Now, if you want to get really kind of sneaky,"}, {"Time_Start": 2149.36, "Time_End": 2151.36, "Text": " you might try thinking about using steganography"}, {"Time_Start": 2151.36, "Time_End": 2153.36, "Text": " and writing your own file system driver"}, {"Time_Start": 2153.36, "Time_End": 2156.86, "Text": " and story the encrypted file inside of, like, say, a nice big MP3."}, {"Time_Start": 2156.86, "Time_End": 2158.36, "Text": " But that's a different story."}, {"Time_Start": 2158.36, "Time_End": 2159.36, "Text": " Sir."}, {"Time_Start": 2159.36, "Time_End": 2163.36, "Text": " Do these slides correlate well when goes on a CD."}, {"Time_Start": 2163.36, "Time_End": 2164.36, "Text": " Do these what?"}, {"Time_Start": 2164.36, "Time_End": 2168.36, "Text": " Do these slides that you've shown us"}, {"Time_Start": 2168.36, "Time_End": 2169.36, "Text": " correlation well,"}, {"Time_Start": 2169.36, "Time_End": 2171.36, "Text": " presentation slides,"}, {"Time_Start": 2171.36, "Time_End": 2172.36, "Text": " correlate well when goes on a CD."}, {"Time_Start": 2172.36, "Time_End": 2173.36, "Text": " They're exactly."}, {"Time_Start": 2173.36, "Time_End": 2174.36, "Text": " the same?"}, {"Time_Start": 2174.36, "Time_End": 2177.36, "Text": " At least I think they are."}, {"Time_Start": 2177.36, "Time_End": 2179.36, "Text": " Questions?"}, {"Time_Start": 2179.36, "Time_End": 2180.36, "Text": " Ma'am?"}, {"Time_Start": 2180.36, "Time_End": 2183.36, "Text": " Oh, sorry."}, {"Time_Start": 2183.36, "Time_End": 2185.36, "Text": " I didn't know you."}, {"Time_Start": 2185.36, "Time_End": 2187.36, "Text": " Okay."}, {"Time_Start": 2187.36, "Time_End": 2189.36, "Text": " What's the"}, {"Time_Start": 2189.36, "Time_End": 2190.36, "Text": " Colonel Hive?"}, {"Time_Start": 2190.36, "Time_End": 2192.36, "Text": " The Colonel Hive?"}, {"Time_Start": 2192.36, "Time_End": 2196.36, "Text": " Oh, well, originally the Colonel,"}, {"Time_Start": 2196.36, "Time_End": 2198.36, "Text": " those kind of just stopped."}, {"Time_Start": 2198.36, "Time_End": 2200.36, "Text": " If you actually look at, I went to the kernel"}, {"Time_Start": 2200.36, "Time_End": 2205.36, "Text": " source, the crypto directory, and the kernel patch is like 2.3."}, {"Time_Start": 2205.36, "Time_End": 2208.36, "Text": " And I know that they list some other guy's URL"}, {"Time_Start": 2208.36, "Time_End": 2210.36, "Text": " way out in the middle of nowhere, but..."}, {"Time_Start": 2210.36, "Time_End": 2216.36, "Text": " Yeah, I'm just saying, like I said, in my searches,"}, {"Time_Start": 2216.36, "Time_End": 2220.36, "Text": " and again, I may be ignorant, that does happen sometimes,"}, {"Time_Start": 2220.36, "Time_End": 2224.36, "Text": " I did not find, I also did not like the idea that was directly in the kernel."}, {"Time_Start": 2224.36, "Time_End": 2226.36, "Text": " I wanted to build a load and unload a module"}, {"Time_Start": 2226.36, "Time_End": 2229.36, "Text": " so I could leave a system protected or unprotected or with the ability to read"}, {"Time_Start": 2229.36, "Time_End": 2232.36, "Text": " or the ability to read or not read an encrypted file system."}, {"Time_Start": 2232.36, "Time_End": 2234.36, "Text": " So that was one of the..."}, {"Time_Start": 2234.36, "Time_End": 2238.36, "Text": " I did use the encrypted files, you know, the kernel patch,"}, {"Time_Start": 2238.36, "Time_End": 2239.36, "Text": " and it worked great."}, {"Time_Start": 2239.36, "Time_End": 2242.36, "Text": " In fact, I think it's a little faster, to be honest,"}, {"Time_Start": 2242.36, "Time_End": 2245.36, "Text": " because it's directly in the kernel, it's not a module, and all those things."}, {"Time_Start": 2245.36, "Time_End": 2247.36, "Text": " So anyways, that's my answer."}, {"Time_Start": 2247.36, "Time_End": 2249.36, "Text": " Questions?"}, {"Time_Start": 2249.36, "Time_End": 2251.36, "Text": " I guess that is it."}, {"Time_Start": 2251.36, "Time_End": 2253.36, "Text": " Thank you for your attention in time."}]}