{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 11.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Once again, thank you for coming, welcome to Sifcon, I guess."
    },
    {
      "Time_Start": 11.44,
      "Time_End": 16.28,
      "Text": " It's really good to be here, I'd like to just in the beginning extend my deep gratitude"
    },
    {
      "Time_Start": 16.28,
      "Time_End": 20.88,
      "Text": " to the organiser for having me once again at this great conference, it's really one"
    },
    {
      "Time_Start": 20.88,
      "Time_End": 26.04,
      "Text": " of my favourite events in Poland, so yeah, it's good to be back here in Gdynia."
    },
    {
      "Time_Start": 26.04,
      "Time_End": 33.839999999999996,
      "Text": " So what we're going to talk about today is Winti and why this title, the group that wasn't,"
    },
    {
      "Time_Start": 33.839999999999996,
      "Time_End": 37.64,
      "Text": " was it a group, what happened, we will learn just in a bit."
    },
    {
      "Time_Start": 37.64,
      "Time_End": 44.2,
      "Text": " So a bit of the time schedule for today, first a short introduction of why I'm even here"
    },
    {
      "Time_Start": 44.2,
      "Time_End": 50.64,
      "Text": " and why am I talking to you about this Winti group, second we will have a short introduction"
    },
    {
      "Time_Start": 50.64,
      "Time_End": 56.4,
      "Text": " on how to define the groups at all and what do we mean by group, what do we mean by threat"
    },
    {
      "Time_Start": 56.4,
      "Time_End": 64.8,
      "Text": " actor and so on, but the main body, the main part of the presentation will be analysis"
    },
    {
      "Time_Start": 64.8,
      "Time_End": 75.64,
      "Text": " of how the Winti discoveries, published research, disclosed campaigns and so much more unfolded"
    },
    {
      "Time_Start": 75.64,
      "Time_End": 82.92,
      "Text": " in terms of what was published and second an answer to those who might ask, so what,"
    },
    {
      "Time_Start": 82.92,
      "Time_End": 89.64,
      "Text": " what are the consequences of taking a certain approach and what can we learn from this group."
    },
    {
      "Time_Start": 89.64,
      "Time_End": 95.2,
      "Text": " As we are here at ZipCon and this is red and blue conference, as you can see by my attire"
    },
    {
      "Time_Start": 95.2,
      "Time_End": 100.74000000000001,
      "Text": " I'm more aligned with the blue side, but on the side of the red I hope that it will also"
    },
    {
      "Time_Start": 100.74000000000001,
      "Time_End": 109.54,
      "Text": " support adversary emulation team with perhaps working on more high fidelity simulation if"
    },
    {
      "Time_Start": 109.54,
      "Time_End": 116.10000000000001,
      "Text": " the client or your customer will request that you need to emulate Winti."
    },
    {
      "Time_Start": 116.10000000000001,
      "Time_End": 122.22000000000001,
      "Text": " So first of all who am I, I'm working daily as a principal intelligence analyst at Cointelligence,"
    },
    {
      "Time_Start": 122.22000000000001,
      "Time_End": 128.26000000000002,
      "Text": " so I mainly do threat research work and work directly with customers on providing tailored"
    },
    {
      "Time_Start": 128.26,
      "Time_End": 134.1,
      "Text": " intelligence briefings, intelligence solutions and supporting their security organisation."
    },
    {
      "Time_Start": 134.1,
      "Time_End": 140.78,
      "Text": " Also from time to time students of SANS 4578 might meet me where I'm supporting SANS instructors"
    },
    {
      "Time_Start": 140.78,
      "Time_End": 146.73999999999998,
      "Text": " as a teaching assistant and I run my own personal blog where you can read some of my free thoughts"
    },
    {
      "Time_Start": 146.73999999999998,
      "Time_End": 152.54,
      "Text": " about the intelligence security, national security at counterintelligence.pl, feel free"
    },
    {
      "Time_Start": 152.54,
      "Time_End": 157.5,
      "Text": " to reach me either at the conference or at those addresses and just a standard disclaimer"
    },
    {
      "Time_Start": 157.5,
      "Time_End": 162.5,
      "Text": " that whatever I'll be saying today is purely my own conclusion, thoughts and so on and"
    },
    {
      "Time_Start": 162.5,
      "Time_End": 168.26,
      "Text": " do not represent the position of my company."
    },
    {
      "Time_Start": 168.26,
      "Time_End": 174.3,
      "Text": " So just one more short disclaimer, because we will be talking of how the group unfolded"
    },
    {
      "Time_Start": 174.3,
      "Time_End": 180.58,
      "Text": " and what was the understanding of it, I will be naming and mentioning research of many"
    },
    {
      "Time_Start": 180.58,
      "Time_End": 186.82,
      "Text": " many great threat intelligence teams and by all means I do not mean that if I come to"
    },
    {
      "Time_Start": 186.82,
      "Time_End": 192.1,
      "Text": " a different conclusion they are wrong or their analysis was bad or something like that,"
    },
    {
      "Time_Start": 192.1,
      "Time_End": 199.14,
      "Text": " rather that because of different intelligence requirements we might approach the same situation"
    },
    {
      "Time_Start": 199.14,
      "Time_End": 206.66,
      "Text": " in different manners, so just a quick disclaimer that this is all the research I will present"
    },
    {
      "Time_Start": 206.66,
      "Time_End": 211.78,
      "Text": " is all very high quality, just we might have a different perspective."
    },
    {
      "Time_Start": 211.78,
      "Time_End": 222.14,
      "Text": " So sliding right at the defining and tracking the various adversarial groups, basically"
    },
    {
      "Time_Start": 222.14,
      "Time_End": 226.5,
      "Text": " we might approach this issue in a twofold manner."
    },
    {
      "Time_Start": 226.5,
      "Time_End": 233.9,
      "Text": " We might approach it by what's commonly called a threat actor, which is represented by this"
    },
    {
      "Time_Start": 233.9,
      "Time_End": 242.22,
      "Text": " nice FBI wanted poster on the right hand side and this is trying to establish exactly"
    },
    {
      "Time_Start": 242.22,
      "Time_End": 247.70000000000002,
      "Text": " who are those actors, so who are the people on the keyboard, operators and so on, like"
    },
    {
      "Time_Start": 247.70000000000002,
      "Time_End": 253.86,
      "Text": " having this very particular visibility into a specific unit that is conducting activity,"
    },
    {
      "Time_Start": 253.86,
      "Time_End": 258.98,
      "Text": " being it a criminal group or being it an intelligence unit or military unit."
    },
    {
      "Time_Start": 258.98,
      "Time_End": 265.38,
      "Text": " In terms of WNT we will be talking about this APT41 cluster as defined by pretty much"
    },
    {
      "Time_Start": 265.38,
      "Time_End": 271.22,
      "Text": " United States government by now and is composed of the intelligence officers, but the other"
    },
    {
      "Time_Start": 271.22,
      "Time_End": 277.42,
      "Text": " solution that you might come across and approach is tracking it by just activity."
    },
    {
      "Time_Start": 277.42,
      "Time_End": 283.38,
      "Text": " So the left hand illustration presents diamond model of intrusion analysis, which means that"
    },
    {
      "Time_Start": 283.54,
      "Time_End": 292.42,
      "Text": " you aim to break down the activity into specific observables such as the infrastructure use"
    },
    {
      "Time_Start": 292.42,
      "Time_End": 300.34,
      "Text": " capabilities, so the malware techniques, tactics and procedures for initial access, the victimology"
    },
    {
      "Time_Start": 300.34,
      "Time_End": 306.34,
      "Text": " and based on that, regardless of who is sitting at the keyboard, you will be tracking like"
    },
    {
      "Time_Start": 306.34,
      "Time_End": 309.26,
      "Text": " what is the representation of the group."
    },
    {
      "Time_Start": 309.26,
      "Time_End": 316.3,
      "Text": " Okay so let's dive right in and so the question is who is this WNT hacker, what is going on"
    },
    {
      "Time_Start": 316.3,
      "Time_End": 317.3,
      "Text": " there?"
    },
    {
      "Time_Start": 317.3,
      "Time_End": 323.34,
      "Text": " And the answer is WNT is not a group, WNT is actually a malware, WNT is a remote access"
    },
    {
      "Time_Start": 323.34,
      "Time_End": 334.74,
      "Text": " trojan that's got the versions for Windows and Linux and has wide capabilities of allowing"
    },
    {
      "Time_Start": 334.74,
      "Time_End": 338.9,
      "Text": " operator to interact with systems and files, commands and so on."
    },
    {
      "Time_Start": 338.90000000000003,
      "Time_End": 342.50000000000006,
      "Text": " So this is it, thank you for coming to my talk."
    },
    {
      "Time_Start": 342.50000000000006,
      "Time_End": 352.02000000000004,
      "Text": " But on a more serious note, the WNT as a group has been first defined by Kaspersky, but the"
    },
    {
      "Time_Start": 352.02000000000004,
      "Time_End": 356.38000000000005,
      "Text": " kind of caveat is that it was not actually discovered by Kaspersky."
    },
    {
      "Time_Start": 356.38000000000005,
      "Time_End": 364.78000000000003,
      "Text": " So what happened in 2013 is we had this very nice research piece from Kaspersky that described"
    },
    {
      "Time_Start": 364.86,
      "Time_End": 371.94000000000005,
      "Text": " a group that is using this WNT malware and stolen certificates to target video game companies."
    },
    {
      "Time_Start": 371.94000000000005,
      "Time_End": 378.38000000000005,
      "Text": " Although there was here a short, let's say a disclaimer or there was a bit of a misnomer,"
    },
    {
      "Time_Start": 378.38000000000005,
      "Time_End": 384.98,
      "Text": " not misnomer, but the targeting was much wider because it also involved activist groups,"
    },
    {
      "Time_Start": 384.98,
      "Time_End": 393.54,
      "Text": " but in general because of this wide use of the WNT tool, so this remote access tool,"
    },
    {
      "Time_Start": 393.54,
      "Time_End": 399.16,
      "Text": " and because of the use of stolen certificates and because of the victimology that was kind"
    },
    {
      "Time_Start": 399.16,
      "Time_End": 404.90000000000003,
      "Text": " of defined, Kaspersky took this name that was originally discovered by Symantec, so"
    },
    {
      "Time_Start": 404.90000000000003,
      "Time_End": 411.3,
      "Text": " WNT malware group and decided that from now on they will be tracking this as the group"
    },
    {
      "Time_Start": 411.3,
      "Time_End": 418.94,
      "Text": " and if you can see here, perhaps not from the back of the hall, so at the very bottom"
    },
    {
      "Time_Start": 418.94,
      "Time_End": 424.98,
      "Text": " of the screenshot from Kaspersky is that we uncovered activity of the Chinese origins"
    },
    {
      "Time_Start": 424.98,
      "Time_End": 430.02,
      "Text": " and we tracked this activity as a WNT group."
    },
    {
      "Time_Start": 430.02,
      "Time_End": 440.22,
      "Text": " So to further give you a background, the group was discovered even earlier, around 2010,"
    },
    {
      "Time_Start": 440.22,
      "Time_End": 446.46,
      "Text": " by 2013 community research, let's say, as a whole started tracking it, but by then the"
    },
    {
      "Time_Start": 446.50000000000006,
      "Time_End": 452.62000000000006,
      "Text": " activity was mainly focused on very much financially motivated actions, so they were breaching"
    },
    {
      "Time_Start": 452.62000000000006,
      "Time_End": 458.78000000000003,
      "Text": " these video game companies and they were stealing the source code or they were even doing cheats"
    },
    {
      "Time_Start": 458.78000000000003,
      "Time_End": 466.90000000000003,
      "Text": " in-game to gain the in-game currency for exchange, so it was essentially this quite advanced"
    },
    {
      "Time_Start": 466.90000000000003,
      "Time_End": 472.14000000000004,
      "Text": " malware was used to funnel the money out of gaming companies and we had stolen certificates,"
    },
    {
      "Time_Start": 472.14,
      "Time_End": 475.5,
      "Text": " so things were quite interesting to follow."
    },
    {
      "Time_Start": 475.5,
      "Time_End": 482.78,
      "Text": " And then around the same time in 2013, FireEye, now Google Cloud's Mandiant, has published"
    },
    {
      "Time_Start": 482.78,
      "Time_End": 487.7,
      "Text": " a research and they seemed to get a sense of what is going on because they published"
    },
    {
      "Time_Start": 487.7,
      "Time_End": 496.09999999999997,
      "Text": " this very nice piece about the digital quartermaster, so they described how the various toolings"
    },
    {
      "Time_Start": 496.1,
      "Time_End": 503.86,
      "Text": " and infrastructure is shared among the various groups, which pointed them to the conclusion"
    },
    {
      "Time_Start": 503.86,
      "Time_End": 510.14000000000004,
      "Text": " that it is essentially like a development team, or the infrastructure creation team,"
    },
    {
      "Time_Start": 510.14000000000004,
      "Time_End": 516.26,
      "Text": " that supplies the tooling to various activity groups as they are tracked in a different"
    },
    {
      "Time_Start": 516.26,
      "Time_End": 517.26,
      "Text": " manner."
    },
    {
      "Time_Start": 517.26,
      "Time_End": 524.5,
      "Text": " So we had essentially this idea that what the researchers were tracking was not so much"
    },
    {
      "Time_Start": 524.5,
      "Time_End": 532.38,
      "Text": " of a group of the hands-on keyboard operators, but the development team that was supplying"
    },
    {
      "Time_Start": 532.38,
      "Time_End": 533.82,
      "Text": " those tools."
    },
    {
      "Time_Start": 533.82,
      "Time_End": 539.94,
      "Text": " And this will have quite a bit of ramification as we go further, but here you can see on"
    },
    {
      "Time_Start": 539.94,
      "Time_End": 546.9,
      "Text": " this bottom screenshot from the report, the quote was about the, it referenced directly"
    },
    {
      "Time_Start": 546.9,
      "Time_End": 554.02,
      "Text": " the Kaspersky report and the stolen certificates were in fact the same ones that were used"
    },
    {
      "Time_Start": 554.02,
      "Time_End": 557.3,
      "Text": " by the Winty cluster."
    },
    {
      "Time_Start": 557.3,
      "Time_End": 562.8199999999999,
      "Text": " And the Winty itself by Mandiant I think is tracked as High Noon, and this was a part"
    },
    {
      "Time_Start": 562.8199999999999,
      "Time_End": 566.3,
      "Text": " of this, let's say, quartermaster report."
    },
    {
      "Time_Start": 566.3,
      "Time_End": 577.26,
      "Text": " Then in 2014 we had a very extensive report on the activity that was tracked by essentially"
    },
    {
      "Time_Start": 577.26,
      "Time_End": 583.06,
      "Text": " a coalition of partners, there was Microsoft, Cisco, FireEye, EyeSight, Noveta, multiple"
    },
    {
      "Time_Start": 583.0600000000001,
      "Time_End": 590.86,
      "Text": " groups involved, and they published this research piece, Operation SMN, which as some"
    },
    {
      "Time_Start": 590.86,
      "Time_End": 599.7800000000001,
      "Text": " might know is an acronym for Some Marketing Name, because apparently they thought this"
    },
    {
      "Time_Start": 599.7800000000001,
      "Time_End": 603.2600000000001,
      "Text": " was an appropriate naming convention."
    },
    {
      "Time_Start": 603.2600000000001,
      "Time_End": 610.4200000000001,
      "Text": " So this was a wide-ranging Chinese intelligence operation that targeted Fortune 500 companies,"
    },
    {
      "Time_Start": 610.42,
      "Time_End": 613.78,
      "Text": " aerospace industry, defense industry, all over the world."
    },
    {
      "Time_Start": 613.78,
      "Time_End": 622.26,
      "Text": " And because of this visibility that was available to this multitude of companies, they could"
    },
    {
      "Time_Start": 622.26,
      "Time_End": 630.66,
      "Text": " track this whole cluster of what was going on, and in the additional research piece that"
    },
    {
      "Time_Start": 630.66,
      "Time_End": 637.06,
      "Text": " was published soon later on was the analysis of the further version of Winty malware."
    },
    {
      "Time_Start": 637.0600000000001,
      "Time_End": 642.46,
      "Text": " So this was this link by the malware grouping."
    },
    {
      "Time_Start": 642.46,
      "Time_End": 649.74,
      "Text": " And Noveta in this report, like we had now with FireEye and Kaspersky, also put the moderate"
    },
    {
      "Time_Start": 649.74,
      "Time_End": 653.94,
      "Text": " to high confidence of the Chinese intelligence operation."
    },
    {
      "Time_Start": 653.94,
      "Time_End": 661.46,
      "Text": " So we had those links, we had those malware and infrastructure, but now some of you might"
    },
    {
      "Time_Start": 661.46,
      "Time_End": 667.7800000000001,
      "Text": " ask like what happened with the targeting and victims from the trying to get in-game"
    },
    {
      "Time_Start": 667.7800000000001,
      "Time_End": 671.1,
      "Text": " currency to targeting defense contractors."
    },
    {
      "Time_Start": 671.1,
      "Time_End": 681.46,
      "Text": " So in fact in 2015 from Kaspersky there was another report on the Winty malware group,"
    },
    {
      "Time_Start": 681.46,
      "Time_End": 689.22,
      "Text": " which directly linked those efforts to the Axiom reporting, and Kaspersky claimed that"
    },
    {
      "Time_Start": 689.6600000000001,
      "Time_End": 695.98,
      "Text": " the samples they have seen are similar or analogous to what was reported in Operation"
    },
    {
      "Time_Start": 695.98,
      "Time_End": 705.0600000000001,
      "Text": " SMN, and because of that they tracked it further as this Winty activity."
    },
    {
      "Time_Start": 705.0600000000001,
      "Time_End": 712.38,
      "Text": " But the victimology and targeting has now changed, and the targeting also in this Kaspersky"
    },
    {
      "Time_Start": 712.38,
      "Time_End": 716.78,
      "Text": " visibility moved more towards the pharmaceutical companies."
    },
    {
      "Time_Start": 716.8199999999999,
      "Time_End": 723.4599999999999,
      "Text": " So perhaps a targeting more in line with what we saw from the Noveta report."
    },
    {
      "Time_Start": 723.4599999999999,
      "Time_End": 730.86,
      "Text": " And very, very, let's say in the short time frame, Symantec published a research on the"
    },
    {
      "Time_Start": 730.86,
      "Time_End": 743.22,
      "Text": " groups they tracked as a black fly, in which they talked about the use of the stolen certificates"
    },
    {
      "Time_Start": 743.3000000000001,
      "Time_End": 749.22,
      "Text": " mainly, and how these certificates that were obtained from those also video game companies"
    },
    {
      "Time_Start": 749.22,
      "Time_End": 753.74,
      "Text": " were used for malware delivery purpose."
    },
    {
      "Time_Start": 753.74,
      "Time_End": 761.5,
      "Text": " And the research indirectly referenced Kaspersky research, so as you might see on the screenshot"
    },
    {
      "Time_Start": 761.5,
      "Time_End": 770.6600000000001,
      "Text": " below, it says that third party vendor published, and because of the similarity in the malware"
    },
    {
      "Time_Start": 770.98,
      "Time_End": 779.98,
      "Text": " and the technique of stealing code signing certificates, we had this grouping from Symantec,"
    },
    {
      "Time_Start": 779.98,
      "Time_End": 785.8199999999999,
      "Text": " and now you might get a bit lost in this, so we will start with our first diagram."
    },
    {
      "Time_Start": 785.8199999999999,
      "Time_End": 792.62,
      "Text": " So essentially what happened and how we arrived at this point is that initially the Winty"
    },
    {
      "Time_Start": 792.74,
      "Time_End": 806.18,
      "Text": " was discovered by Symantec as a malware group, then we had a grouping into the activity group"
    },
    {
      "Time_Start": 806.18,
      "Time_End": 813.38,
      "Text": " by Kaspersky, so Kaspersky, when they detected this malware, they decided to track it not"
    },
    {
      "Time_Start": 813.38,
      "Time_End": 821.1800000000001,
      "Text": " just as a detection of a sample of a group like Metroprater Cobblestring, but as a group,"
    },
    {
      "Time_Start": 821.1800000000001,
      "Time_End": 826.4200000000001,
      "Text": " and then it resulted in this Winty group, and when we go back, do a round, back to what"
    },
    {
      "Time_Start": 826.4200000000001,
      "Time_End": 836.7800000000001,
      "Text": " Symantec was saying, is that Symantec, when it was Winty joined with the stolen certificates,"
    },
    {
      "Time_Start": 836.7800000000001,
      "Time_End": 842.1800000000001,
      "Text": " they tracked it as black fly, and when it was some other custom tooling that was used"
    },
    {
      "Time_Start": 842.1800000000001,
      "Time_End": 847.3000000000001,
      "Text": " in the attacks, it was tracked as sack fly group."
    },
    {
      "Time_Start": 847.3000000000001,
      "Time_End": 854.0200000000001,
      "Text": " And going further we can see that since around 2016, more and more vendors started, let's"
    },
    {
      "Time_Start": 854.0200000000001,
      "Time_End": 862.3800000000001,
      "Text": " say jumping on this research tray of the Winty group, and we had this blog from Silence,"
    },
    {
      "Time_Start": 862.3800000000001,
      "Time_End": 871.1,
      "Text": " now Blackberry Silence, about their research into so-called PASS-TV group that was targeting"
    },
    {
      "Time_Start": 871.1,
      "Time_End": 879.22,
      "Text": " once again gaming companies, and the link here, unfortunately, the links between the"
    },
    {
      "Time_Start": 879.22,
      "Time_End": 885.5400000000001,
      "Text": " groupings started being a bit more, let's say, disjoint, because what Silence team has"
    },
    {
      "Time_Start": 885.5400000000001,
      "Time_End": 894.74,
      "Text": " referenced is that because of the similarity in victimology of the stolen certificates"
    },
    {
      "Time_Start": 894.74,
      "Time_End": 901.7,
      "Text": " victims, so which companies were affected by this certificate theft, that was used then"
    },
    {
      "Time_Start": 901.7,
      "Time_End": 912.1,
      "Text": " to, that was used then to sign this malware, and because those victims were earlier breached"
    },
    {
      "Time_Start": 912.1,
      "Time_End": 919.42,
      "Text": " as referenced by other vendors as victims of Winty, we had this linking into their PASS-TV"
    },
    {
      "Time_Start": 919.4200000000001,
      "Time_End": 925.94,
      "Text": " group, as you can see, this conclusion that Winty and PASS-TV are closely related."
    },
    {
      "Time_Start": 925.94,
      "Time_End": 935.1800000000001,
      "Text": " However, if we take like a step back from this, we actually see here that the, as I"
    },
    {
      "Time_Start": 935.1800000000001,
      "Time_End": 940.0200000000001,
      "Text": " noticed this link started getting a bit murky, because essentially we started from this tracking"
    },
    {
      "Time_Start": 940.0200000000001,
      "Time_End": 945.7,
      "Text": " by Winty, okay, so this is a malware specific to a given group, but at this point in some"
    },
    {
      "Time_Start": 945.7,
      "Time_End": 952.22,
      "Text": " vendor reporting, we are almost dropping this part of the conversation, let's say,"
    },
    {
      "Time_Start": 952.22,
      "Time_End": 959.58,
      "Text": " and when we look at this PASS-TV and how it was defined, it was because only of the some"
    },
    {
      "Time_Start": 959.58,
      "Time_End": 966.62,
      "Text": " certificates that were stolen from those companies, but the malware used mainly was of completely,"
    },
    {
      "Time_Start": 966.62,
      "Time_End": 972.96,
      "Text": " well, not completely, but was of a different kind, including some open source software."
    },
    {
      "Time_Start": 972.96,
      "Time_End": 981.08,
      "Text": " So what happened in 2017 is that Microsoft took a tackle on this group, and they did"
    },
    {
      "Time_Start": 981.08,
      "Time_End": 992.64,
      "Text": " quite a thing, because they said that because of how these objectives and how the methods"
    },
    {
      "Time_Start": 992.64,
      "Time_End": 998.48,
      "Text": " differ between certain representations of Winty, they will take approach that they will"
    },
    {
      "Time_Start": 998.48,
      "Time_End": 1001.12,
      "Text": " start tracking it as two groups."
    },
    {
      "Time_Start": 1001.12,
      "Time_End": 1007.44,
      "Text": " So we had this, this was still when the Microsoft was using this element's name for the activity"
    },
    {
      "Time_Start": 1007.44,
      "Time_End": 1015.12,
      "Text": " group naming, so we had the Barium and Lead, and Barium represent more this part focus"
    },
    {
      "Time_Start": 1015.12,
      "Time_End": 1023.4,
      "Text": " on the, let's say, commercial activity, financially motivated activity, attacking of gaming companies,"
    },
    {
      "Time_Start": 1023.4,
      "Time_End": 1029.36,
      "Text": " trying to get these scams and going with in-game currency, and we had the Lead group,"
    },
    {
      "Time_Start": 1029.36,
      "Time_End": 1035.44,
      "Text": " which was more focused, let's say, on those high-value advanced target, industrial espionage"
    },
    {
      "Time_Start": 1035.44,
      "Time_End": 1039.1399999999999,
      "Text": " and trying to breach into defense contractors and so on."
    },
    {
      "Time_Start": 1039.1399999999999,
      "Time_End": 1047.4,
      "Text": " So basically it looked like that, that the Microsoft took this grouping of Winty by the"
    },
    {
      "Time_Start": 1047.4,
      "Time_End": 1053.92,
      "Text": " malware and broke it down based on the victimology and on the techniques used, because they noticed"
    },
    {
      "Time_Start": 1053.92,
      "Time_End": 1065.68,
      "Text": " that for different targets, different initial access or delivery techniques were used, which"
    },
    {
      "Time_Start": 1065.68,
      "Time_End": 1067.3200000000002,
      "Text": " is quite interesting."
    },
    {
      "Time_Start": 1067.3200000000002,
      "Time_End": 1073.8000000000002,
      "Text": " The Lead part, which was, let's say, more concerned with serious target, which was quite"
    },
    {
      "Time_Start": 1073.8,
      "Time_End": 1079.04,
      "Text": " a bit more direct with their approach, and they tended to just straight up directly send"
    },
    {
      "Time_Start": 1079.04,
      "Time_End": 1082.72,
      "Text": " the Winty executable to their victims by phishing mails."
    },
    {
      "Time_Start": 1082.72,
      "Time_End": 1089.2,
      "Text": " On the other hand, the Barium group, which was more concerned with money and getting"
    },
    {
      "Time_Start": 1089.2,
      "Time_End": 1093.84,
      "Text": " the financial results of their operation, was actually quite proficient in building"
    },
    {
      "Time_Start": 1093.84,
      "Time_End": 1100.6,
      "Text": " rapport with their victims, doing social engineering work, building up on the relationship, sending"
    },
    {
      "Time_Start": 1100.6000000000001,
      "Time_End": 1107.16,
      "Text": " LNK files that were used then to deliver Winty as a second stage and so on and so on."
    },
    {
      "Time_Start": 1107.16,
      "Time_End": 1114.0800000000002,
      "Text": " So as you hear on the left-hand side of the slide, we have this diamond model, this diamond"
    },
    {
      "Time_Start": 1114.0800000000002,
      "Time_End": 1120.96,
      "Text": " model node, because when, at the beginning of the presentation, I've talked about the"
    },
    {
      "Time_Start": 1120.96,
      "Time_End": 1129.44,
      "Text": " different scenarios or different approaches to grouping, the Microsoft explicitly, even"
    },
    {
      "Time_Start": 1129.52,
      "Time_End": 1135.28,
      "Text": " as they mentioned in this group, decided to go the activity group route and do not focus"
    },
    {
      "Time_Start": 1135.28,
      "Time_End": 1140.16,
      "Text": " so much on who is behind the keyboard or how the group is internally constructed, just"
    },
    {
      "Time_Start": 1140.16,
      "Time_End": 1143.04,
      "Text": " on the representation."
    },
    {
      "Time_Start": 1143.04,
      "Time_End": 1150.96,
      "Text": " Then the Trend Micro also tried to take a job at tracking and defining how the Winty"
    },
    {
      "Time_Start": 1150.96,
      "Time_End": 1162.16,
      "Text": " works, but Trend Micro kind of stepped back into this idea of having the activity group"
    },
    {
      "Time_Start": 1162.16,
      "Time_End": 1167.44,
      "Text": " by the malware, so basically they said they talked about the Winty group but they tracked"
    },
    {
      "Time_Start": 1167.44,
      "Time_End": 1172.04,
      "Text": " the presentation of the malware and they found a very nice, they did a very nice research"
    },
    {
      "Time_Start": 1172.04,
      "Time_End": 1177.16,
      "Text": " about the use of GitHub for command and control communication, so the GitHub repositories"
    },
    {
      "Time_Start": 1177.24,
      "Time_End": 1185.24,
      "Text": " were used to host the commands that were fetched by the malware pieces and as such they represented"
    },
    {
      "Time_Start": 1185.24,
      "Time_End": 1193.48,
      "Text": " that it received the commands from the, essentially, attackers from C2."
    },
    {
      "Time_Start": 1193.48,
      "Time_End": 1198.28,
      "Text": " Trend Micro went even further because they went on to track the infrastructure of the"
    },
    {
      "Time_Start": 1198.28,
      "Time_End": 1206.64,
      "Text": " attackers, they found this individual that was known as Hack520 on various social media"
    },
    {
      "Time_Start": 1206.64,
      "Time_End": 1214.96,
      "Text": " platforms and because of that they discovered the registration scheme and the ranges of"
    },
    {
      "Time_Start": 1214.96,
      "Time_End": 1219.2800000000002,
      "Text": " the VPS addressing that was used as part of this infrastructure."
    },
    {
      "Time_Start": 1219.2800000000002,
      "Time_End": 1230.1200000000001,
      "Text": " So we had now this from Trend Micro, this bit of wider picture of having both the infrastructure"
    },
    {
      "Time_Start": 1230.1200000000001,
      "Time_End": 1236.16,
      "Text": " and malware, so perhaps even as they started from this very much, let's say, maybe less"
    },
    {
      "Time_Start": 1236.16,
      "Time_End": 1243.8400000000001,
      "Text": " defined malware based tracking, they expanded it into this technical axis of the Diamond"
    },
    {
      "Time_Start": 1243.8400000000001,
      "Time_End": 1250.3200000000002,
      "Text": " model into infrastructure and capabilities and they discovered that, pardon, they discovered"
    },
    {
      "Time_Start": 1250.3200000000002,
      "Time_End": 1257.0,
      "Text": " the guy behind this infrastructure is apparently a fan of pigs, he had a pet pig which is indeed"
    },
    {
      "Time_Start": 1257.0,
      "Time_End": 1263.16,
      "Text": " very cute and he was happy to post it on various social media which actually also helped with"
    },
    {
      "Time_Start": 1263.3200000000002,
      "Time_End": 1269.3200000000002,
      "Text": " tracking them because apparently pigs are not so common as pets."
    },
    {
      "Time_Start": 1269.3200000000002,
      "Time_End": 1274.28,
      "Text": " Yeah, take your pictures."
    },
    {
      "Time_Start": 1274.28,
      "Time_End": 1279.2,
      "Text": " So this is how it went for the Trend Micro."
    },
    {
      "Time_Start": 1279.2,
      "Time_End": 1289.64,
      "Text": " Then what happened in terms of how the understanding of the group was developing was that in 2017"
    },
    {
      "Time_Start": 1289.64,
      "Time_End": 1298.76,
      "Text": " we had this report from 401 Threat Research Group and what happened there is that they"
    },
    {
      "Time_Start": 1298.76,
      "Time_End": 1304.6000000000001,
      "Text": " did actually a few pieces on the Winty but like the cornerstone, the punchline was that"
    },
    {
      "Time_Start": 1304.6000000000001,
      "Time_End": 1309.5200000000002,
      "Text": " they report on burning umbrellas, so they tracked the representation or the presentation"
    },
    {
      "Time_Start": 1309.5200000000002,
      "Time_End": 1315.5200000000002,
      "Text": " of the Winty in certain victimologies, they tracked down the infrastructure and they came"
    },
    {
      "Time_Start": 1315.52,
      "Time_End": 1322.4,
      "Text": " to the conclusion that it should be tracked as a single umbrella, which means that various"
    },
    {
      "Time_Start": 1322.4,
      "Time_End": 1330.48,
      "Text": " intelligence, Chinese intelligence operations are using similar backbone composed of the"
    },
    {
      "Time_Start": 1330.48,
      "Time_End": 1337.8799999999999,
      "Text": " TTPs like using our favourite Winty malware and using infrastructure that could be tracked"
    },
    {
      "Time_Start": 1337.88,
      "Time_End": 1347.16,
      "Text": " by certain characteristics and this backbone is used as an umbrella for various groups"
    },
    {
      "Time_Start": 1347.16,
      "Time_End": 1354.0,
      "Text": " like that are called Axiom, APT17, Lead Barium, Wicked Panda and so on by different actors"
    },
    {
      "Time_Start": 1354.0,
      "Time_End": 1364.4,
      "Text": " but initially it came from the same route, so either the same activity in terms of tasking"
    },
    {
      "Time_Start": 1364.4,
      "Time_End": 1371.4,
      "Text": " or this is one organisation that creates all those infrastructure and so on."
    },
    {
      "Time_Start": 1371.4,
      "Time_End": 1376.3600000000001,
      "Text": " What is interesting for this report, they put a high confidence in attribution to this"
    },
    {
      "Time_Start": 1376.3600000000001,
      "Time_End": 1382.52,
      "Text": " Chinese intelligence apparatus, now from what was published and from my understanding this"
    },
    {
      "Time_Start": 1382.52,
      "Time_End": 1391.8000000000002,
      "Text": " is based purely on the analysis of the observables, there was no insight, they had no internal"
    },
    {
      "Time_Start": 1391.8,
      "Time_End": 1397.9199999999998,
      "Text": " knowledge about the intercepts of something that could point them further towards this"
    },
    {
      "Time_Start": 1397.9199999999998,
      "Time_End": 1407.6399999999999,
      "Text": " assessment, but apparently they felt that they have enough to link it back to the Chinese"
    },
    {
      "Time_Start": 1407.6399999999999,
      "Time_End": 1414.56,
      "Text": " intelligence, and it seems they were not entirely wrong in that, because by 2018 the United"
    },
    {
      "Time_Start": 1414.56,
      "Time_End": 1420.76,
      "Text": " States Department of Justice started getting involved also in tracking of Winty or maybe"
    },
    {
      "Time_Start": 1420.76,
      "Time_End": 1427.8799999999999,
      "Text": " not tracking but rather prosecuting, and there was a first indictment against officers"
    },
    {
      "Time_Start": 1427.8799999999999,
      "Time_End": 1436.16,
      "Text": " of the Jiangsu Province Ministry of State Security Department, and in this indictment"
    },
    {
      "Time_Start": 1436.16,
      "Time_End": 1444.44,
      "Text": " we can see that around 2012 members of the conspiracy installed this Winty malware on"
    },
    {
      "Time_Start": 1444.44,
      "Time_End": 1448.8200000000002,
      "Text": " the computers of the industrial company."
    },
    {
      "Time_Start": 1448.8200000000002,
      "Time_End": 1455.8400000000001,
      "Text": " So interesting thing to note here is that while Kaspersky was tracking it when it was"
    },
    {
      "Time_Start": 1455.8400000000001,
      "Time_End": 1462.68,
      "Text": " discovered and reached public as a commercial financially motivated operation, we can see"
    },
    {
      "Time_Start": 1462.68,
      "Time_End": 1470.2,
      "Text": " that in fact even by 2012 this was already an industrial espionage outlet."
    },
    {
      "Time_Start": 1470.2,
      "Time_End": 1478.44,
      "Text": " Similarly in 2019 we have seen this scent of this Linux version when the Chronicle posted"
    },
    {
      "Time_Start": 1478.44,
      "Time_End": 1486.48,
      "Text": " on their blog that there is not only Windows which is most popular, but also a Linux version"
    },
    {
      "Time_Start": 1486.48,
      "Time_End": 1494.72,
      "Text": " of the Winty RAT, and it dated back to 2015 and to the breaches against some Vietnamese"
    },
    {
      "Time_Start": 1494.72,
      "Time_End": 1499.32,
      "Text": " gaming companies, so we can see how those both streams, let's say lead and barium in"
    },
    {
      "Time_Start": 1499.32,
      "Time_End": 1503.88,
      "Text": " Microsoft terminology, were going in parallel."
    },
    {
      "Time_Start": 1503.88,
      "Time_End": 1513.76,
      "Text": " And in 2019 also Asset published a very extensive piece on the arsenal and the activity of the"
    },
    {
      "Time_Start": 1513.76,
      "Time_End": 1514.76,
      "Text": " Winty group."
    },
    {
      "Time_Start": 1514.76,
      "Time_End": 1522.0,
      "Text": " What I like in this report, they make quite clear that from their perspective Winty is"
    },
    {
      "Time_Start": 1522.0,
      "Time_End": 1527.56,
      "Text": " a group that performed these attacks using techniques and tooling described by them and"
    },
    {
      "Time_Start": 1527.56,
      "Time_End": 1533.16,
      "Text": " tracked, regardless of what is the underlying structure of the group."
    },
    {
      "Time_Start": 1533.16,
      "Time_End": 1540.76,
      "Text": " So once again, similarly to maybe similarly to Microsoft or to other vendors that did"
    },
    {
      "Time_Start": 1540.76,
      "Time_End": 1550.48,
      "Text": " not care so much about the attribution, they just tried to get there by grouping up use"
    },
    {
      "Time_Start": 1550.48,
      "Time_End": 1554.3600000000001,
      "Text": " of certain techniques and use and how it was deployed."
    },
    {
      "Time_Start": 1554.3600000000001,
      "Time_End": 1561.16,
      "Text": " And also the things that start getting up is that if you remember the supply chains"
    },
    {
      "Time_Start": 1561.16,
      "Time_End": 1569.96,
      "Text": " attacks that used for example CCCleaner or Asus Firmware Update, those attacks were also"
    },
    {
      "Time_Start": 1569.96,
      "Time_End": 1578.6,
      "Text": " linked to this activity through deployed artifacts and through the techniques used and how the"
    },
    {
      "Time_Start": 1578.6,
      "Time_End": 1580.3,
      "Text": " malware was constructed."
    },
    {
      "Time_Start": 1580.3,
      "Time_End": 1586.6599999999999,
      "Text": " So we had now by this very quite a bit sprawling activity that involves both supply chain attacks"
    },
    {
      "Time_Start": 1586.6599999999999,
      "Time_End": 1593.82,
      "Text": " but delivery by social engineering infrastructure that was based in China and other regions,"
    },
    {
      "Time_Start": 1593.82,
      "Time_End": 1596.08,
      "Text": " a lot of victims and so on."
    },
    {
      "Time_Start": 1596.08,
      "Time_End": 1606.5,
      "Text": " And in 2019 also Mandiant came up with this quite interesting scenario is that this Winty"
    },
    {
      "Time_Start": 1606.5,
      "Time_End": 1615.7,
      "Text": " which they tracked as APT41 is essentially the one operation but split between the official"
    },
    {
      "Time_Start": 1615.7,
      "Time_End": 1623.06,
      "Text": " part so intelligence officers doing their work and the moonlighting part, so intelligence"
    },
    {
      "Time_Start": 1623.06,
      "Time_End": 1629.62,
      "Text": " officers making money on the side by using the capabilities they have access to."
    },
    {
      "Time_Start": 1629.6200000000001,
      "Time_End": 1638.38,
      "Text": " So yes, so as you see on the upper screenshot from the report, they mentioned the Barium"
    },
    {
      "Time_Start": 1638.38,
      "Time_End": 1647.8600000000001,
      "Text": " Group and Winty as what constitutes of this APT41 and below we can see one of the certificates"
    },
    {
      "Time_Start": 1647.8600000000001,
      "Time_End": 1650.46,
      "Text": " that was linked to this operation."
    },
    {
      "Time_Start": 1650.46,
      "Time_End": 1657.66,
      "Text": " So actually Mandiant took an opposite approach to what Microsoft was doing with lead and"
    },
    {
      "Time_Start": 1657.66,
      "Time_End": 1663.3000000000002,
      "Text": " barium and we can mark it as this icon of the indictment."
    },
    {
      "Time_Start": 1663.3000000000002,
      "Time_End": 1670.38,
      "Text": " They grouped together two branches of the operation, the financially motivated part"
    },
    {
      "Time_Start": 1670.38,
      "Time_End": 1678.94,
      "Text": " and the industrial espionage one, because they had correlation between used malware,"
    },
    {
      "Time_Start": 1678.94,
      "Time_End": 1686.0600000000002,
      "Text": " the specific mailing addresses that were used to deliver those and so on and generally having"
    },
    {
      "Time_Start": 1686.06,
      "Time_End": 1689.82,
      "Text": " the shared infrastructure that was used to deliver it."
    },
    {
      "Time_Start": 1689.82,
      "Time_End": 1700.06,
      "Text": " So basically if you would turn these schemes upside down, you would see the division into"
    },
    {
      "Time_Start": 1700.06,
      "Time_End": 1703.1799999999998,
      "Text": " lead and barium actors."
    },
    {
      "Time_Start": 1703.1799999999998,
      "Time_End": 1711.34,
      "Text": " And further in 2020, APT41 moniker was actually used by the United States Department of Justice"
    },
    {
      "Time_Start": 1711.3400000000001,
      "Time_End": 1717.2600000000002,
      "Text": " in another indictment, but this one was way more specific."
    },
    {
      "Time_Start": 1717.2600000000002,
      "Time_End": 1724.1000000000001,
      "Text": " So earlier we just had this mention of industrial espionage operation using Winty malware, but"
    },
    {
      "Time_Start": 1724.1000000000001,
      "Time_End": 1737.42,
      "Text": " now we had explicit indictment, explicit finger pointing into this APT41 operation and pointing"
    },
    {
      "Time_Start": 1737.42,
      "Time_End": 1745.8200000000002,
      "Text": " out to specific operators that were conducting those operations as a part of the so-called"
    },
    {
      "Time_Start": 1745.8200000000002,
      "Time_End": 1751.8600000000001,
      "Text": " name and shame campaign, so the attempts of the United States government to impose cost"
    },
    {
      "Time_Start": 1751.8600000000001,
      "Time_End": 1760.22,
      "Text": " on the operations by publishing their official names, their personal details."
    },
    {
      "Time_Start": 1760.22,
      "Time_End": 1766.98,
      "Text": " And as you can hear at the bottom of this part of the indictment, in fact we had this"
    },
    {
      "Time_Start": 1766.98,
      "Time_End": 1774.7,
      "Text": " confirmed by this official document, United States government grouping the activity by"
    },
    {
      "Time_Start": 1774.7,
      "Time_End": 1783.26,
      "Text": " the Plague X Winty but also Shadowpad, so one of the malware that was used in the supply"
    },
    {
      "Time_Start": 1783.26,
      "Time_End": 1788.3,
      "Text": " chain attack as far as I remember for Asus one."
    },
    {
      "Time_Start": 1788.3,
      "Time_End": 1795.4199999999998,
      "Text": " So we had this more clarity, and in 2020 also my company, Quo Intelligence, we published"
    },
    {
      "Time_Start": 1795.4199999999998,
      "Time_End": 1808.06,
      "Text": " a research piece on the sample that we discovered that was used to attack the German chemical"
    },
    {
      "Time_Start": 1808.06,
      "Time_End": 1810.02,
      "Text": " company."
    },
    {
      "Time_Start": 1810.02,
      "Time_End": 1818.74,
      "Text": " We had this, we had not only the code similarities but also this link by stolen certificates,"
    },
    {
      "Time_Start": 1818.74,
      "Time_End": 1826.34,
      "Text": " and we have also discovered how the DNS tunnelling was used to exfil data and as a C2 channel"
    },
    {
      "Time_Start": 1826.34,
      "Time_End": 1828.1,
      "Text": " essentially."
    },
    {
      "Time_Start": 1828.1,
      "Time_End": 1834.74,
      "Text": " And here from how we, I mean we also used the Winty group moniker, but we had this very"
    },
    {
      "Time_Start": 1834.74,
      "Time_End": 1841.98,
      "Text": " direct link, we had this very direct link because we found sample that had significant"
    },
    {
      "Time_Start": 1841.98,
      "Time_End": 1848.46,
      "Text": " code similarities and significant overlap in the use of stolen certificates."
    },
    {
      "Time_Start": 1848.46,
      "Time_End": 1853.82,
      "Text": " So we came to this very, very let's say one-to-one direct mapping into the capabilities that"
    },
    {
      "Time_Start": 1853.82,
      "Time_End": 1862.3,
      "Text": " were used earlier, but we saw those now deployed against different target, this chemical company,"
    },
    {
      "Time_Start": 1862.3,
      "Time_End": 1867.98,
      "Text": " but also South Korean gaming, but in general when we track back, and you can read it on"
    },
    {
      "Time_Start": 1867.98,
      "Time_End": 1875.1,
      "Text": " our blog, when we track back this activity, it went more into this lead branch, let's"
    },
    {
      "Time_Start": 1875.1,
      "Time_End": 1882.94,
      "Text": " say, in targeting various German industrial and technology companies."
    },
    {
      "Time_Start": 1882.94,
      "Time_End": 1891.34,
      "Text": " And interestingly coming to our more recent times, in 2020 FireEyeMandiant tracked, published"
    },
    {
      "Time_Start": 1891.42,
      "Time_End": 1901.1000000000001,
      "Text": " report and now on tracked as APT41 against global intrusion against, as I believe, mainly"
    },
    {
      "Time_Start": 1901.1000000000001,
      "Time_End": 1906.6200000000001,
      "Text": " network devices, vulnerabilities in Citrix, NetScaler, Cisco routers and so on, but what"
    },
    {
      "Time_Start": 1906.6200000000001,
      "Time_End": 1912.7800000000002,
      "Text": " was interesting about this report is this is after the indictments by DOJ, so we had"
    },
    {
      "Time_Start": 1912.94,
      "Time_End": 1922.94,
      "Text": " this, let's say, official name of APT41 floating around, but here the tools used were not any"
    },
    {
      "Time_Start": 1922.94,
      "Time_End": 1929.58,
      "Text": " more winty, but we had our favourite CobaltStrike and Meterpreter used in those intrusions."
    },
    {
      "Time_Start": 1929.58,
      "Time_End": 1936.74,
      "Text": " So let's say that by the Mandiant visibility, apparently they have capabilities to go a"
    },
    {
      "Time_Start": 1936.82,
      "Time_End": 1947.14,
      "Text": " bit deeper and kind of move away from having to have the winty malware included to track"
    },
    {
      "Time_Start": 1947.14,
      "Time_End": 1949.46,
      "Text": " further those capabilities."
    },
    {
      "Time_Start": 1949.46,
      "Time_End": 1953.14,
      "Text": " And also then in 2022 we had Cyber Reason."
    },
    {
      "Time_Start": 1953.14,
      "Time_End": 1960.42,
      "Text": " Cyber Reason did a very in-depth research on the new campaigns that they discovered"
    },
    {
      "Time_Start": 1960.42,
      "Time_End": 1964.66,
      "Text": " by tracking the intrusions where the winty malware was used."
    },
    {
      "Time_Start": 1964.8200000000002,
      "Time_End": 1971.3000000000002,
      "Text": " They described in this two-part research how the malware was evolved to include more evasive"
    },
    {
      "Time_Start": 1971.3000000000002,
      "Time_End": 1979.38,
      "Text": " capabilities and so on, and again they had this high attribution to winty group, but"
    },
    {
      "Time_Start": 1979.38,
      "Time_End": 1984.5800000000002,
      "Text": " it was moderate high actually, but this is not very surprising given how it was tracked"
    },
    {
      "Time_Start": 1984.5800000000002,
      "Time_End": 1992.26,
      "Text": " by those various malware representations, and it showed, even when we go back to the"
    },
    {
      "Time_Start": 1992.26,
      "Time_End": 2000.18,
      "Text": " Noveta report, when they described the various versions of winty that were going further"
    },
    {
      "Time_Start": 2000.18,
      "Time_End": 2007.46,
      "Text": " from version 1.2.3, we can see that after 10 years around, the malware is in fact still"
    },
    {
      "Time_Start": 2007.46,
      "Time_End": 2012.82,
      "Text": " in development, which kind of speaks volumes to its role in those operations."
    },
    {
      "Time_Start": 2014.1,
      "Time_End": 2022.18,
      "Text": " Also in 2022 we had the report from the group IB, another great vendor, and they did this"
    },
    {
      "Time_Start": 2022.74,
      "Time_End": 2028.5,
      "Text": " using the Mandiant moniker of APT41, and they described a very, very wide-ranging campaign"
    },
    {
      "Time_Start": 2028.5,
      "Time_End": 2038.1000000000001,
      "Text": " all over the world, Europe, America, Asia-Pacific, about the APT41 alleged activities, but they"
    },
    {
      "Time_Start": 2038.1000000000001,
      "Time_End": 2046.9,
      "Text": " grouped it very, very widely using both the Double Dragon barium-led monikers, which indicated"
    },
    {
      "Time_Start": 2046.9,
      "Time_End": 2053.86,
      "Text": " that they moved more towards this, let's say, single entity, single group scenario,"
    },
    {
      "Time_Start": 2053.86,
      "Time_End": 2059.94,
      "Text": " and it also resulted in a very wide description of techniques, tactics, and procedure,"
    },
    {
      "Time_Start": 2060.82,
      "Time_End": 2064.58,
      "Text": " apparently secure injection, also Cobalt strike, and again was used,"
    },
    {
      "Time_Start": 2064.58,
      "Time_End": 2068.58,
      "Text": " living off the land utilities, and so on, and so on."
    },
    {
      "Time_Start": 2068.58,
      "Time_End": 2076.02,
      "Text": " And to kind of finish now, going through a timeline, is that in 2022 September,"
    },
    {
      "Time_Start": 2076.02,
      "Time_End": 2082.9,
      "Text": " the Department of Human Health Services, the United States, has published this briefing"
    },
    {
      "Time_Start": 2082.9,
      "Time_End": 2089.3,
      "Text": " about how the activity recently unfolded, how it affects the healthcare sector,"
    },
    {
      "Time_Start": 2089.3,
      "Time_End": 2096.58,
      "Text": " and as you can see here, similarly to the United States in the Department of Justice"
    },
    {
      "Time_Start": 2097.46,
      "Time_End": 2107.7,
      "Text": " Department of Justice position, they used the barium-winty naming convention, omitting"
    },
    {
      "Time_Start": 2107.7,
      "Time_End": 2114.98,
      "Text": " led one, and they very heavily underscored the links to the Five-Year Plan, so the"
    },
    {
      "Time_Start": 2115.7799999999997,
      "Time_End": 2123.06,
      "Text": " Chinese political documents that describes national goals in terms of economic"
    },
    {
      "Time_Start": 2123.06,
      "Time_End": 2130.66,
      "Text": " and strategic development, and how it links to the Chinese intelligence operators."
    },
    {
      "Time_Start": 2130.66,
      "Time_End": 2137.2999999999997,
      "Text": " Okay, so that leaves us again with this question, who is this winty hacker and what can we do with"
    },
    {
      "Time_Start": 2137.2999999999997,
      "Time_End": 2145.86,
      "Text": " it? And if you were taking notes by the vendor and by which elements were used to link those"
    },
    {
      "Time_Start": 2145.86,
      "Time_End": 2152.66,
      "Text": " malware together, unfortunately, we can come to conclusion that by most of the time, it was"
    },
    {
      "Time_Start": 2152.66,
      "Time_End": 2159.62,
      "Text": " mainly tracked by the winty malware sample, and that there was involvement of stolen digital"
    },
    {
      "Time_Start": 2159.62,
      "Time_End": 2166.1,
      "Text": " certificates to sign the code, which is, of course, not much, either in the case of the"
    },
    {
      "Time_Start": 2166.1,
      "Time_End": 2172.18,
      "Text": " defense and in terms of adversary emulation. Because when we look at the kill chain"
    },
    {
      "Time_Start": 2172.18,
      "Time_End": 2179.8599999999997,
      "Text": " representation of the activity, we would be somewhere between weaponization, so understanding"
    },
    {
      "Time_Start": 2179.94,
      "Time_End": 2188.42,
      "Text": " how this tooling and code was developed, and maybe delivery as in trying to pass it with"
    },
    {
      "Time_Start": 2188.42,
      "Time_End": 2194.1,
      "Text": " the stolen certificates. But if it goes to get installed on the systems we protect,"
    },
    {
      "Time_Start": 2194.7400000000002,
      "Time_End": 2201.54,
      "Text": " it essentially goes through exploitation phase, it gets installed, and we are blind in those"
    },
    {
      "Time_Start": 2201.54,
      "Time_End": 2209.54,
      "Text": " spots if you want to also represent, defend and have the understanding of the whole kill chain."
    },
    {
      "Time_Start": 2209.86,
      "Time_End": 2218.66,
      "Text": " I think we should rephrase the question into not who is winty or who is behind the keyboard,"
    },
    {
      "Time_Start": 2218.66,
      "Time_End": 2224.9,
      "Text": " but because of how your security organization works, how can you define this group on your own"
    },
    {
      "Time_Start": 2224.9,
      "Time_End": 2234.9,
      "Text": " and how can you make sure that it fits your needs of operation? So we might do it with the"
    },
    {
      "Time_Start": 2235.46,
      "Time_End": 2243.14,
      "Text": " analytical models. So instead of getting stuck on the APT41 or the double dragon barium lead"
    },
    {
      "Time_Start": 2243.14,
      "Time_End": 2249.3,
      "Text": " monikers, what I think that both internal intelligence teams or any intelligence team"
    },
    {
      "Time_Start": 2249.3,
      "Time_End": 2255.46,
      "Text": " that is tasked with tracking this kind of activity should do is essentially create an"
    },
    {
      "Time_Start": 2255.46,
      "Time_End": 2263.2200000000003,
      "Text": " analytical model that will act as a bucket to catch the operations, the intrusions that fit"
    },
    {
      "Time_Start": 2263.2200000000003,
      "Time_End": 2275.1400000000003,
      "Text": " your needs. So instead of having this one-to-one fit, I think the tracking should come from"
    },
    {
      "Time_Start": 2275.1400000000003,
      "Time_End": 2281.2200000000003,
      "Text": " understanding of what elements do you really need from winty. So what was the requirement?"
    },
    {
      "Time_Start": 2281.2200000000003,
      "Time_End": 2287.3,
      "Text": " Was it mentioned by the CSO that he wants to have this information by the group? Did it come up in"
    },
    {
      "Time_Start": 2287.3,
      "Time_End": 2294.5,
      "Text": " the Tiber exercise that you as a red team need to simulate these activities? What exactly are the"
    },
    {
      "Time_Start": 2294.5,
      "Time_End": 2301.3,
      "Text": " elements you need to focus on and either how it will impact your defense posture because you will"
    },
    {
      "Time_Start": 2301.3,
      "Time_End": 2310.9,
      "Text": " be doing some threat modeling or gap analysis or how else you can even use it for having"
    },
    {
      "Time_Start": 2311.3,
      "Time_End": 2317.46,
      "Text": " the defense efforts. And the solution, therefore, is to make your own winty model"
    },
    {
      "Time_Start": 2318.1800000000003,
      "Time_End": 2324.5,
      "Text": " and accounting for the three elements essentially of threat definitions, so intent,"
    },
    {
      "Time_Start": 2324.5,
      "Time_End": 2332.7400000000002,
      "Text": " opportunity, and capability. Think about what do you want to have achieved with this or how do you"
    },
    {
      "Time_Start": 2332.7400000000002,
      "Time_End": 2338.02,
      "Text": " want to see this group. So are you more interested in targeting of this industrial sector or gaming"
    },
    {
      "Time_Start": 2338.02,
      "Time_End": 2344.58,
      "Text": " and internet content companies? What capabilities do you need to track? Do you need to be so focused"
    },
    {
      "Time_Start": 2344.58,
      "Time_End": 2351.94,
      "Text": " on this winty model or do you want to include also supply chain attacks and so on? And to"
    },
    {
      "Time_Start": 2351.94,
      "Time_End": 2358.74,
      "Text": " think about why will you be following this reporting when you have this activity group."
    },
    {
      "Time_Start": 2358.74,
      "Time_End": 2364.02,
      "Text": " So will you need to check if the next supply chain attack that gets detected"
    },
    {
      "Time_Start": 2364.82,
      "Time_End": 2370.18,
      "Text": " is also related to this and you might need to take a deeper look if you want to check in general"
    },
    {
      "Time_Start": 2370.18,
      "Time_End": 2377.7,
      "Text": " for the use of code signing certificates as a vector of making malware more evasive?"
    },
    {
      "Time_Start": 2377.7,
      "Time_End": 2384.2599999999998,
      "Text": " Do you see very heavily that your environment is infected with various iterations of winty"
    },
    {
      "Time_Start": 2384.2599999999998,
      "Time_End": 2390.98,
      "Text": " and you need to have robust defenses? This will all ultimately influence how you need to track"
    },
    {
      "Time_Start": 2390.98,
      "Time_End": 2398.18,
      "Text": " or how you might want to track the group by its manners."
    },
    {
      "Time_Start": 2399.14,
      "Time_End": 2408.02,
      "Text": " So when we take into consideration all those examples and"
    },
    {
      "Time_Start": 2408.02,
      "Time_End": 2414.66,
      "Text": " presentation of activity like the techniques from the targeting used to the techniques through the"
    },
    {
      "Time_Start": 2414.66,
      "Time_End": 2422.8999999999996,
      "Text": " infrastructure, we can have this very wide list and very wide understanding"
    },
    {
      "Time_Start": 2422.8999999999996,
      "Time_End": 2430.18,
      "Text": " essentially something similar to what was done by ESET and Group IP of having this"
    },
    {
      "Time_Start": 2430.18,
      "Time_End": 2436.3399999999997,
      "Text": " let's say mosaic of different factors. And when we break it down into the diamond model"
    },
    {
      "Time_Start": 2436.3399999999997,
      "Time_End": 2442.74,
      "Text": " representation, so when we break it down into this adversary, victimology, infrastructure"
    },
    {
      "Time_Start": 2443.6200000000003,
      "Time_End": 2452.5000000000005,
      "Text": " and capabilities part on each vertex of the model, we can start thinking about"
    },
    {
      "Time_Start": 2453.1400000000003,
      "Time_End": 2463.46,
      "Text": " what is important to us and what is not so much. So when we looked at the top vertex,"
    },
    {
      "Time_Start": 2463.46,
      "Time_End": 2470.9,
      "Text": " so the adversary, we have from one side those operators that were very much concerned with the"
    },
    {
      "Time_Start": 2470.9,
      "Time_End": 2476.7400000000002,
      "Text": " financial gains, so they were stealing this in-game currency and so on. We had also this"
    },
    {
      "Time_Start": 2476.7400000000002,
      "Time_End": 2482.98,
      "Text": " apparent foreign intelligence apparatus that was tasked with the collection of industrial espionage."
    },
    {
      "Time_Start": 2484.58,
      "Time_End": 2491.06,
      "Text": " And when we look at the capabilities, again we have quite a few features that when"
    },
    {
      "Time_Start": 2491.94,
      "Time_End": 2501.86,
      "Text": " grouped together will allow us to be able to pick and choose what matters to us."
    },
    {
      "Time_Start": 2502.98,
      "Time_End": 2510.02,
      "Text": " So to give you a more specific example, if we look at the core intelligence block and what we did"
    },
    {
      "Time_Start": 2510.82,
      "Time_End": 2519.14,
      "Text": " is that we had this kind of specific representation in mind that took the victimology,"
    },
    {
      "Time_Start": 2519.14,
      "Time_End": 2522.74,
      "Text": " the use of malware, these specific tactics as stolen certificates."
    },
    {
      "Time_Start": 2524.66,
      "Time_End": 2531.94,
      "Text": " And it created, let's say, its own activity cluster. So because we did not have visibility"
    },
    {
      "Time_Start": 2531.94,
      "Time_End": 2538.66,
      "Text": " like from signal or human intelligence into who is the adversary, this is not so important,"
    },
    {
      "Time_Start": 2538.66,
      "Time_End": 2543.2999999999997,
      "Text": " this is not by this point, like whether this was this financially motivated folks,"
    },
    {
      "Time_Start": 2543.2999999999997,
      "Time_End": 2548.66,
      "Text": " this were seasoned intelligence officers, we do not need to know that at this point."
    },
    {
      "Time_Start": 2548.74,
      "Time_End": 2555.06,
      "Text": " But we can see the representation that they were doing this in DNS tunneling, they were using this"
    },
    {
      "Time_Start": 2556.2599999999998,
      "Time_End": 2562.02,
      "Text": " specific techniques of delivery, they had code similarities and so on, and because of tracking the"
    },
    {
      "Time_Start": 2563.3799999999997,
      "Time_End": 2571.7,
      "Text": " various malware representation, we can have this, we can have this, our own cluster that fits our"
    },
    {
      "Time_Start": 2571.7,
      "Time_End": 2577.06,
      "Text": " needs and allow us to make informed decisions about whether the next intrusion or the next"
    },
    {
      "Time_Start": 2577.06,
      "Time_End": 2584.2599999999998,
      "Text": " campaign or the next discovered piece of malware is in fact what fits into our understanding."
    },
    {
      "Time_Start": 2584.2599999999998,
      "Time_End": 2589.7,
      "Text": " And I would very heavily recommend this approach because ultimately when you are using someone"
    },
    {
      "Time_Start": 2589.7,
      "Time_End": 2595.2999999999997,
      "Text": " else's naming, when you're using APT41, when you're using WinT, DoubleDragon and so on,"
    },
    {
      "Time_Start": 2595.94,
      "Time_End": 2601.14,
      "Text": " you do not have this control over what is going on. Because let's imagine you are a red team,"
    },
    {
      "Time_Start": 2601.14,
      "Time_End": 2608.1,
      "Text": " you are doing the threat intelligence-based ethical red teaming exercise, and you get from"
    },
    {
      "Time_Start": 2608.1,
      "Time_End": 2615.46,
      "Text": " the threat intelligence report that this APT41 is a group of interest, so we need to emulate that."
    },
    {
      "Time_Start": 2615.46,
      "Time_End": 2621.22,
      "Text": " But essentially what happens there is you kind of give a space to Mandiant to have an input into"
    },
    {
      "Time_Start": 2621.22,
      "Time_End": 2627.14,
      "Text": " your exercise, because the next report might come up, like in the next month, in the next week and"
    },
    {
      "Time_Start": 2627.14,
      "Time_End": 2634.42,
      "Text": " so on, and it will turn into kind of feeding into your process. As opposed to that, when you have"
    },
    {
      "Time_Start": 2634.42,
      "Time_End": 2641.06,
      "Text": " your own cluster, either for defense or offensive research, you can have your own understanding and"
    },
    {
      "Time_Start": 2641.06,
      "Time_End": 2649.22,
      "Text": " even you can go further, like for the red team to develop further capabilities based on the"
    },
    {
      "Time_Start": 2649.22,
      "Time_End": 2655.06,
      "Text": " blueprint that will be prepared. And I believe that is more or less all from my side, I would"
    },
    {
      "Time_Start": 2655.06,
      "Time_End": 2660.42,
      "Text": " just like to, probably these references are barely visible, because as you might have noticed, there"
    },
    {
      "Time_Start": 2660.42,
      "Time_End": 2664.9,
      "Text": " were quite a few reports that I went through, and I would like to congratulate all of those"
    },
    {
      "Time_Start": 2664.9,
      "Time_End": 2669.7799999999997,
      "Text": " teams on the great work, threat intelligence, they work and they were doing. And with that,"
    },
    {
      "Time_Start": 2669.7799999999997,
      "Time_End": 2672.34,
      "Text": " thank you very much for your time."
    }
  ]
}