{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Coming to attend this talk, I'm Paul Coggin from Huntsville, Alabama, in the U.S."
    },
    {
      "Time_Start": 14.44,
      "Time_End": 18.8,
      "Text": " This is my fourth time speaking at X33FCon."
    },
    {
      "Time_Start": 18.8,
      "Time_End": 22.2,
      "Text": " I sincerely appreciate the invitation to return."
    },
    {
      "Time_Start": 22.2,
      "Time_End": 29.52,
      "Text": " I came in to Poland a few days early and got to visit SOPOD and Gdansk."
    },
    {
      "Time_Start": 29.52,
      "Time_End": 30.52,
      "Text": " I love this country."
    },
    {
      "Time_Start": 30.52,
      "Time_End": 31.64,
      "Text": " It is so beautiful."
    },
    {
      "Time_Start": 31.64,
      "Time_End": 36.56,
      "Text": " The Baltic Sea area is just breathtaking, fabulous people, great food."
    },
    {
      "Time_Start": 36.56,
      "Time_End": 39.8,
      "Text": " I love to eat and I ate a lot while I was here."
    },
    {
      "Time_Start": 39.8,
      "Time_End": 44.36,
      "Text": " It's been a really, really great visit and a fun time being back here in Poland again."
    },
    {
      "Time_Start": 44.36,
      "Time_End": 54.96,
      "Text": " So this talk, I'm going to get into some ideas around threat hunting for both space and digital"
    },
    {
      "Time_Start": 54.96,
      "Time_End": 57.36,
      "Text": " energy."
    },
    {
      "Time_Start": 57.36,
      "Time_End": 64.28,
      "Text": " The genesis of this talk, years ago, when I first started thinking about this subject,"
    },
    {
      "Time_Start": 64.28,
      "Time_End": 68.96,
      "Text": " my kids were making me watch the Transformers movie over and over and over."
    },
    {
      "Time_Start": 68.96,
      "Time_End": 73.44,
      "Text": " And being an IT computer security nerd, I was thinking, you know, how would someone"
    },
    {
      "Time_Start": 73.44,
      "Time_End": 81.56,
      "Text": " detect a sophisticated attack like the Decepticons, where they're embedded themselves like in"
    },
    {
      "Time_Start": 81.56,
      "Time_End": 87.72,
      "Text": " a satellite or the Air Force One and the other computer systems that were getting attacked."
    },
    {
      "Time_Start": 87.72,
      "Time_End": 91.96000000000001,
      "Text": " They were so hard to detect what they were doing, how they got in, et cetera."
    },
    {
      "Time_Start": 91.96000000000001,
      "Time_End": 100.0,
      "Text": " And around that same time, there was all the activity in the news around the Stuxnet attack"
    },
    {
      "Time_Start": 100.0,
      "Time_End": 103.36,
      "Text": " against the centrifuges in the Iran nuclear program."
    },
    {
      "Time_Start": 103.36,
      "Time_End": 108.24000000000001,
      "Text": " So I was starting to really, it was puzzling me, how would we go and detect these sophisticated"
    },
    {
      "Time_Start": 108.24000000000001,
      "Time_End": 109.24000000000001,
      "Text": " attacks?"
    },
    {
      "Time_Start": 109.48,
      "Time_End": 115.96000000000001,
      "Text": " That the normal IT security monitoring is not detecting and is missing."
    },
    {
      "Time_Start": 115.96000000000001,
      "Time_End": 121.80000000000001,
      "Text": " My initial thoughts, being an old school network guy, because I come from a background, basically"
    },
    {
      "Time_Start": 121.80000000000001,
      "Time_End": 122.80000000000001,
      "Text": " network engineering."
    },
    {
      "Time_Start": 122.80000000000001,
      "Time_End": 126.92000000000002,
      "Text": " I came up through telco service provider enterprise networking."
    },
    {
      "Time_Start": 126.92000000000002,
      "Time_End": 133.08,
      "Text": " So I was always thinking about, you know, as an old school router guy, how would we"
    },
    {
      "Time_Start": 133.08,
      "Time_End": 134.52,
      "Text": " go and attack this and detect it?"
    },
    {
      "Time_Start": 134.52,
      "Time_End": 139.08,
      "Text": " And so I started thinking about in-band and out-of-band data management, collecting all"
    },
    {
      "Time_Start": 139.08,
      "Time_End": 144.76000000000002,
      "Text": " the logs, both in-band and out-of-band, and correlating the logs, looking for differences"
    },
    {
      "Time_Start": 144.76000000000002,
      "Time_End": 147.76000000000002,
      "Text": " from the environment, et cetera."
    },
    {
      "Time_Start": 147.76000000000002,
      "Time_End": 156.20000000000002,
      "Text": " But as my thoughts matured more, I started realizing, you know, that's not enough, need"
    },
    {
      "Time_Start": 156.20000000000002,
      "Time_End": 157.20000000000002,
      "Text": " to go deeper."
    },
    {
      "Time_Start": 157.20000000000002,
      "Time_End": 163.4,
      "Text": " And so I spent a lot of my career also working in smart grid, industrial control systems,"
    },
    {
      "Time_Start": 163.4,
      "Time_End": 164.4,
      "Text": " data."
    },
    {
      "Time_Start": 164.4,
      "Time_End": 168.20000000000002,
      "Text": " Now everybody calls it operational technology, internet of things, et cetera, whatever the"
    },
    {
      "Time_Start": 168.20000000000002,
      "Time_End": 173.16,
      "Text": " marketing buzzword that the vendors are selling this week."
    },
    {
      "Time_Start": 173.16,
      "Time_End": 180.52,
      "Text": " But brought me back to this Purdue model to describe how to maybe look at some of these"
    },
    {
      "Time_Start": 180.52,
      "Time_End": 185.16,
      "Text": " problems differently that are being missed in the critical infrastructure and some of"
    },
    {
      "Time_Start": 185.16,
      "Time_End": 186.6,
      "Text": " the large enterprises."
    },
    {
      "Time_Start": 186.6,
      "Time_End": 193.16,
      "Text": " And that's going down to the lower level, down to the physical systems, looking at things"
    },
    {
      "Time_Start": 193.16,
      "Time_End": 201.64,
      "Text": " like electrical signals to different sensors, vibration, actuators, measuring current draw,"
    },
    {
      "Time_Start": 201.64,
      "Time_End": 208.6,
      "Text": " get as low level as we can out-of-band so that there's no external influences to this"
    },
    {
      "Time_Start": 208.6,
      "Time_End": 209.6,
      "Text": " data."
    },
    {
      "Time_Start": 209.6,
      "Time_End": 216.0,
      "Text": " But go down as low as we can and monitor the signaling that's happening, and then correlate"
    },
    {
      "Time_Start": 216.0,
      "Time_End": 220.16,
      "Text": " that with the whole system of system of the normal data that we usually collect with our"
    },
    {
      "Time_Start": 220.16,
      "Time_End": 224.56,
      "Text": " logging systems to get an idea of what's happening."
    },
    {
      "Time_Start": 224.56,
      "Time_End": 230.2,
      "Text": " So this presentation is a lot of brainstorming that I did on what are all the data sources"
    },
    {
      "Time_Start": 230.2,
      "Time_End": 235.35999999999999,
      "Text": " that those typical network and IT professionals may be missing that are out there."
    },
    {
      "Time_Start": 235.35999999999999,
      "Time_End": 241.72,
      "Text": " And I'll tell you one thing I've learned from some of the professionals that are true experts"
    },
    {
      "Time_Start": 241.72,
      "Time_End": 246.0,
      "Text": " in industrial control systems and SCADA is there's not a lot of security down here at"
    },
    {
      "Time_Start": 246.0,
      "Time_End": 251.72,
      "Text": " level zero, level one in those devices, not a lot of authentication happening."
    },
    {
      "Time_Start": 251.72,
      "Time_End": 260.0,
      "Text": " It's a pretty insecure, it's a pretty unsecure environment when you get down to those levels."
    },
    {
      "Time_Start": 260.0,
      "Time_End": 264.36,
      "Text": " There's standards that are being worked on it for level zero, level one, but it's not,"
    },
    {
      "Time_Start": 264.36,
      "Time_End": 266.28,
      "Text": " most places it's not there yet."
    },
    {
      "Time_Start": 266.28,
      "Time_End": 272.36,
      "Text": " One thing is I was making sure that I was not totally off track, I went and looked at"
    },
    {
      "Time_Start": 272.36,
      "Time_End": 278.44,
      "Text": " the MITRE ATT&CK, and they have 39 data sources identified, and again, some of what I've kind"
    },
    {
      "Time_Start": 278.44,
      "Time_End": 285.68,
      "Text": " of confirmed to myself is that going and drilling down in the physics-based data sources may"
    },
    {
      "Time_Start": 285.68,
      "Time_End": 291.52000000000004,
      "Text": " be a place that's being overlooked that we should go look at as cybersecurity professionals"
    },
    {
      "Time_Start": 291.52000000000004,
      "Time_End": 298.76,
      "Text": " that are trying to find the decepticons in the network, the proverbial APT that is so"
    },
    {
      "Time_Start": 298.76,
      "Time_End": 300.76,
      "Text": " hard to find."
    },
    {
      "Time_Start": 300.76,
      "Time_End": 307.44,
      "Text": " So a lot of the inspiration I got to go back and revisit this is I'm working on my fourth"
    },
    {
      "Time_Start": 307.44,
      "Time_End": 312.68,
      "Text": " master's in space systems, which is basically physics, and as I was digging into all this"
    },
    {
      "Time_Start": 312.68,
      "Time_End": 318.36,
      "Text": " physics for the space systems, academic work I'm doing, I said, you know, how would these"
    },
    {
      "Time_Start": 318.36,
      "Time_End": 321.08,
      "Text": " physicists go about attacking the problem?"
    },
    {
      "Time_Start": 321.08,
      "Time_End": 325.68,
      "Text": " Because the way that I think about it, and you know, a lot of peers in the network industry,"
    },
    {
      "Time_Start": 325.68,
      "Time_End": 329.12,
      "Text": " we're obviously missing something, so how, you know, how would the physicists go about"
    },
    {
      "Time_Start": 329.12,
      "Time_End": 331.44,
      "Text": " it, and what would Newton and Einstein do?"
    },
    {
      "Time_Start": 331.44,
      "Time_End": 336.08,
      "Text": " How would they think about it?"
    },
    {
      "Time_Start": 336.08,
      "Time_End": 342.36,
      "Text": " So one example of a sensor, low-cost sensor, if we were in a critical infrastructure environment,"
    },
    {
      "Time_Start": 342.36,
      "Time_End": 348.8,
      "Text": " maybe go and look at something like a vibration sensor to collect logging information from."
    },
    {
      "Time_Start": 348.8,
      "Time_End": 353.88,
      "Text": " They like those, for example, those Iranian centrifuges back in the day when they were"
    },
    {
      "Time_Start": 353.88,
      "Time_End": 360.48,
      "Text": " spinning and the current was fluctuating, the centrifuge, the speed was changing in"
    },
    {
      "Time_Start": 360.48,
      "Time_End": 364.84,
      "Text": " those centrifuges, there's probably was some vibration, there's probably some current draw"
    },
    {
      "Time_Start": 364.84,
      "Time_End": 371.24,
      "Text": " changes, and if there was like a vibration sensor on that, maybe that would have detected"
    },
    {
      "Time_Start": 371.24,
      "Time_End": 372.24,
      "Text": " it."
    },
    {
      "Time_Start": 372.24,
      "Time_End": 378.8,
      "Text": " So also maybe some of our other critical infrastructure environments, maybe a gas pipeline, what"
    },
    {
      "Time_Start": 378.8,
      "Time_End": 385.2,
      "Text": " have you, maybe if we had a vibration sensor monitoring those critical infrastructure networks,"
    },
    {
      "Time_Start": 385.2,
      "Time_End": 390.36,
      "Text": " maybe that would give the security monitoring team, the threat hunting team, some new key"
    },
    {
      "Time_Start": 390.36,
      "Time_End": 391.36,
      "Text": " data."
    },
    {
      "Time_Start": 391.36,
      "Time_End": 399.16,
      "Text": " Something I found a real interesting idea is acoustic monitoring."
    },
    {
      "Time_Start": 399.16,
      "Time_End": 410.04,
      "Text": " You could monitor the acoustics of, say, the pipes, and listen for different variations"
    },
    {
      "Time_Start": 410.04,
      "Time_End": 414.08000000000004,
      "Text": " in the sounds that you're hearing in, say, your pipes."
    },
    {
      "Time_Start": 414.08000000000004,
      "Time_End": 418.96000000000004,
      "Text": " Also in power transformers, there's a lot of talk about the power grid being a target"
    },
    {
      "Time_Start": 418.96000000000004,
      "Time_End": 426.24,
      "Text": " for nation-state entities that the critical infrastructure is going to be targeted, the"
    },
    {
      "Time_Start": 426.24,
      "Time_End": 428.12,
      "Text": " power grid obviously is a big target."
    },
    {
      "Time_Start": 428.12,
      "Time_End": 430.08,
      "Text": " Well, what about looking at power transformers?"
    },
    {
      "Time_Start": 430.08,
      "Time_End": 437.04,
      "Text": " Apparently, I'm not an electrical engineer, I don't work in the power industry, but apparently"
    },
    {
      "Time_Start": 437.04,
      "Time_End": 444.16,
      "Text": " some of the power transformers have oil in them, and it is a good point of data source"
    },
    {
      "Time_Start": 444.16,
      "Time_End": 449.84000000000003,
      "Text": " to listen to the sound, the harmonics of the transformers that are filled with oil, because"
    },
    {
      "Time_Start": 449.84000000000003,
      "Time_End": 454.16,
      "Text": " apparently they'll make different noises, and then you could either maybe predict a"
    },
    {
      "Time_Start": 454.16,
      "Time_End": 459.68,
      "Text": " maintenance issue, you could forecast, hey, we need to be prepared to replace a transformer"
    },
    {
      "Time_Start": 459.68,
      "Time_End": 464.88000000000005,
      "Text": " that's starting to fail, or it could be an indicator or a threat hunt team that works"
    },
    {
      "Time_Start": 464.88000000000005,
      "Time_End": 470.52000000000004,
      "Text": " for that power grid provider, hey, we may have somebody helping us manage the network,"
    },
    {
      "Time_Start": 470.52000000000004,
      "Time_End": 475.92,
      "Text": " we might need to go and investigate this further, both with a maintenance team and with cyber"
    },
    {
      "Time_Start": 475.92,
      "Time_End": 481.40000000000003,
      "Text": " SMEs to correlate this data to make sure that it's not a maintenance problem, or we have"
    },
    {
      "Time_Start": 481.40000000000003,
      "Time_End": 484.28000000000003,
      "Text": " a sophisticated attack against our power transformer."
    },
    {
      "Time_Start": 484.28000000000003,
      "Time_End": 489.40000000000003,
      "Text": " So, it's another good data indicator to look at."
    },
    {
      "Time_Start": 489.40000000000003,
      "Time_End": 497.24,
      "Text": " Harmonics from the current, apparently you can, it's possible to study the current that"
    },
    {
      "Time_Start": 497.24,
      "Time_End": 502.48,
      "Text": " is being drawn by computer systems and detect the software that's being run."
    },
    {
      "Time_Start": 502.48,
      "Time_End": 510.00000000000006,
      "Text": " Maybe that is a way to consider for threat hunt teams to be able to detect malware that"
    },
    {
      "Time_Start": 510.0,
      "Time_End": 517.16,
      "Text": " is running on targeted systems and key critical infrastructure, to detect software that we're"
    },
    {
      "Time_Start": 517.16,
      "Time_End": 523.1,
      "Text": " not aware of, that's wholly outside of configuration management and control, something that's not"
    },
    {
      "Time_Start": 523.1,
      "Time_End": 531.4,
      "Text": " in our inventory, maybe monitoring the harmonics and baselining that out of the current utilization"
    },
    {
      "Time_Start": 531.4,
      "Time_End": 537.0,
      "Text": " is a new indicator that if we correlated the whole big system of systems into our logs"
    },
    {
      "Time_Start": 537.0,
      "Time_End": 542.16,
      "Text": " and applied like machine learning to it and baselined that, we could find that anomaly,"
    },
    {
      "Time_Start": 542.16,
      "Time_End": 545.92,
      "Text": " that needle in the haystack, by looking at this harmonics metric."
    },
    {
      "Time_Start": 548.56,
      "Time_End": 553.2,
      "Text": " And this was really fascinating to me as a physics-based data source, everyone is talking"
    },
    {
      "Time_Start": 553.2,
      "Time_End": 560.2,
      "Text": " about PNT in the news, I follow a lot of industry experts in the space industry, and they talk"
    },
    {
      "Time_Start": 560.2,
      "Time_End": 565.48,
      "Text": " about the timing, GPS, GNSS, all the timing sources with satellites."
    },
    {
      "Time_Start": 565.48,
      "Time_End": 572.2,
      "Text": " I had, it's fascinating to me that the power grid is very dependent on timing to sync up"
    },
    {
      "Time_Start": 572.2,
      "Time_End": 577.64,
      "Text": " the timing between all the different transmission systems so that they can accurately reroute"
    },
    {
      "Time_Start": 577.64,
      "Time_End": 584.08,
      "Text": " power and if the timing is off, power starts getting routed the wrong way, bad things are"
    },
    {
      "Time_Start": 584.08,
      "Time_End": 587.96,
      "Text": " going to happen, it's going to cause, they could cause major interruptions in the grid"
    },
    {
      "Time_Start": 587.96,
      "Time_End": 593.0,
      "Text": " if timing is not totally synced up against the whole power grid system."
    },
    {
      "Time_Start": 593.04,
      "Time_End": 600.92,
      "Text": " And a lot of the systems use NTP, network time protocol, might use GPS sensors to pull"
    },
    {
      "Time_Start": 600.92,
      "Time_End": 607.76,
      "Text": " accurate timing, but GPS can be spoofed, it's in the news regularly now that GPS is being"
    },
    {
      "Time_Start": 607.76,
      "Time_End": 610.8,
      "Text": " spoofed, so that can be targeted by jamming or spoofing."
    },
    {
      "Time_Start": 612.8,
      "Time_End": 616.76,
      "Text": " And of course NTP, there's been some denial of service attacks against NTP, so we need"
    },
    {
      "Time_Start": 616.76,
      "Time_End": 628.48,
      "Text": " to go and look at backups for the GPS systems and NTP, the NTP is being moved to precision"
    },
    {
      "Time_Start": 628.48,
      "Time_End": 634.64,
      "Text": " timing protocol, it's more accurate, but there are other alternatives like the Celsium and"
    },
    {
      "Time_Start": 634.64,
      "Time_End": 642.72,
      "Text": " rubidium oscillators and some other satellites that we can monitor, but the threat hunting"
    },
    {
      "Time_Start": 642.72,
      "Time_End": 648.12,
      "Text": " team definitely needs to be monitoring the timing sources, wherever they're pulling that"
    },
    {
      "Time_Start": 648.12,
      "Time_End": 653.44,
      "Text": " timing sync from, need to be monitoring that for variations to make sure someone is not"
    },
    {
      "Time_Start": 653.44,
      "Time_End": 660.6800000000001,
      "Text": " targeting timing, trying to disrupt the power grid system or the network that they're monitoring."
    },
    {
      "Time_Start": 660.6800000000001,
      "Time_End": 668.24,
      "Text": " This is a key place to go and monitor, because I know in my experience working with power"
    },
    {
      "Time_Start": 668.24,
      "Time_End": 673.48,
      "Text": " companies, everyone is working, everybody is doing what everybody does, monitor the"
    },
    {
      "Time_Start": 673.48,
      "Time_End": 679.16,
      "Text": " firewall logs, you're watching the server logs, your SCADA logs, your HMI logs, but"
    },
    {
      "Time_Start": 679.16,
      "Time_End": 684.6800000000001,
      "Text": " what about the power, making sure that power and putting logging capability to sync up"
    },
    {
      "Time_Start": 684.6800000000001,
      "Time_End": 689.08,
      "Text": " and keep an eye on your power, key thing not to lose sight of."
    },
    {
      "Time_Start": 690.08,
      "Time_End": 698.24,
      "Text": " Again, going back to some of the satellite system attacks that we may be overlooking"
    },
    {
      "Time_Start": 698.24,
      "Time_End": 708.9200000000001,
      "Text": " like GPS, et cetera, is the satellite control system for the user segment that goes on ships."
    },
    {
      "Time_Start": 708.9200000000001,
      "Time_End": 717.48,
      "Text": " There's been a lot of activity where from the satellite system that the communications"
    },
    {
      "Time_Start": 717.52,
      "Time_End": 724.52,
      "Text": " on the ships utilize for navigation, being able to talk back to the owners of the ships,"
    },
    {
      "Time_Start": 724.52,
      "Time_End": 731.2,
      "Text": " and there's typically an organization that will be managing ships or different organizations"
    },
    {
      "Time_Start": 731.2,
      "Time_End": 737.4,
      "Text": " that keep up with all the traffic routes and what's going on with the weather, et cetera."
    },
    {
      "Time_Start": 737.4,
      "Time_End": 743.16,
      "Text": " Third party organizations, kind of like a knock sock for ships that is taking care of"
    },
    {
      "Time_Start": 743.16,
      "Time_End": 750.1999999999999,
      "Text": " all the logistics and management of the ships, they'll come in over SATCOMs to help the captains"
    },
    {
      "Time_Start": 750.1999999999999,
      "Time_End": 751.1999999999999,
      "Text": " manage the ship."
    },
    {
      "Time_Start": 751.1999999999999,
      "Time_End": 755.52,
      "Text": " In many cases, the captains are responsible for the ship, but there's other organizations"
    },
    {
      "Time_Start": 755.52,
      "Time_End": 759.7199999999999,
      "Text": " that are telling the captains exactly what to do, where they're going to navigate, and"
    },
    {
      "Time_Start": 759.7199999999999,
      "Time_End": 767.1999999999999,
      "Text": " how to traverse the seas, make sure that they don't run aground or run into weather issues."
    },
    {
      "Time_Start": 767.1999999999999,
      "Time_End": 772.56,
      "Text": " But it's showing here that coming in over those satellite links, the navigation systems"
    },
    {
      "Time_Start": 772.5600000000001,
      "Time_End": 774.5600000000001,
      "Text": " and all are being targeted."
    },
    {
      "Time_Start": 774.5600000000001,
      "Time_End": 777.2800000000001,
      "Text": " So those systems need to be monitored."
    },
    {
      "Time_Start": 777.2800000000001,
      "Time_End": 782.2,
      "Text": " All of the different physics-based navigation systems on the ship should be monitored to"
    },
    {
      "Time_Start": 782.2,
      "Time_End": 786.4000000000001,
      "Text": " make sure somebody hasn't come in over a SATCOM link and is helping us drive the ship."
    },
    {
      "Time_Start": 786.4000000000001,
      "Time_End": 793.5200000000001,
      "Text": " In this case, there was a German ship that was headed to Djibouti over near Kenya off"
    },
    {
      "Time_Start": 793.5200000000001,
      "Time_End": 799.72,
      "Text": " the east coast of Africa, and the pirates had one of the ships hacked for like 10 hours,"
    },
    {
      "Time_Start": 799.72,
      "Time_End": 802.08,
      "Text": " had control of it and were steering it."
    },
    {
      "Time_Start": 802.08,
      "Time_End": 807.5600000000001,
      "Text": " And also from the theme of this presentation about physics-based monitoring, it was released"
    },
    {
      "Time_Start": 807.5600000000001,
      "Time_End": 813.44,
      "Text": " that some classified data was released that the Iranians were researching how to make"
    },
    {
      "Time_Start": 813.44,
      "Time_End": 815.5200000000001,
      "Text": " a ship blow up."
    },
    {
      "Time_Start": 815.5200000000001,
      "Time_End": 817.5600000000001,
      "Text": " That's going to go back to physics-based monitoring."
    },
    {
      "Time_Start": 817.5600000000001,
      "Time_End": 823.64,
      "Text": " They're trying to go and figure out how to make something kinetic happen through a cyber"
    },
    {
      "Time_Start": 823.64,
      "Time_End": 829.6,
      "Text": " attack, say maybe blowing up a pump, making a centrifuge fail, maybe blowing up a pump"
    },
    {
      "Time_Start": 829.6,
      "Time_End": 830.6,
      "Text": " at a fuel station."
    },
    {
      "Time_Start": 830.6,
      "Time_End": 841.48,
      "Text": " They need to put an emphasis on physics-based monitoring on these ships."
    },
    {
      "Time_Start": 841.48,
      "Time_End": 844.64,
      "Text": " Another incident happened just a few years ago."
    },
    {
      "Time_Start": 844.64,
      "Time_End": 853.16,
      "Text": " Apparently there was a ship coming out headed to New York that had gotten hacked and got"
    },
    {
      "Time_Start": 853.16,
      "Time_End": 861.48,
      "Text": " taken over, and the folks who targeted the ship had complete control of the navigational"
    },
    {
      "Time_Start": 861.48,
      "Time_End": 865.28,
      "Text": " system and were able to drive the ship."
    },
    {
      "Time_Start": 865.28,
      "Time_End": 870.68,
      "Text": " Apparently, according to this Cyber Owl Consulting Company, they're saying that they're seeing"
    },
    {
      "Time_Start": 870.68,
      "Time_End": 874.3199999999999,
      "Text": " at least one attack against ships a day."
    },
    {
      "Time_Start": 874.3199999999999,
      "Time_End": 878.76,
      "Text": " So those ships are getting targeted through the satellite communication system and down"
    },
    {
      "Time_Start": 878.76,
      "Time_End": 883.88,
      "Text": " into the navigational control system that drive the ship, and that's going to be a bunch"
    },
    {
      "Time_Start": 883.88,
      "Time_End": 891.52,
      "Text": " of physics-based devices, gyroscopes, et cetera, that are on those ships and should be getting"
    },
    {
      "Time_Start": 891.52,
      "Time_End": 897.24,
      "Text": " monitored, that we should be collecting data on to know what's happening with our ship,"
    },
    {
      "Time_Start": 897.24,
      "Time_End": 906.52,
      "Text": " not just monitoring the Windows server, but also monitoring those IOT, operational technology"
    },
    {
      "Time_Start": 906.84,
      "Time_End": 908.84,
      "Text": " devices on the ship."
    },
    {
      "Time_Start": 908.84,
      "Time_End": 916.4,
      "Text": " There's been a great deal of talk about GPS spoofing, especially with the war going on"
    },
    {
      "Time_Start": 916.4,
      "Time_End": 917.4,
      "Text": " in Ukraine."
    },
    {
      "Time_Start": 917.4,
      "Time_End": 921.36,
      "Text": " It's been going on for a long time, GPS spoofing."
    },
    {
      "Time_Start": 921.36,
      "Time_End": 925.76,
      "Text": " It's in the news a great deal here recently."
    },
    {
      "Time_Start": 925.76,
      "Time_End": 930.56,
      "Text": " In a lot of cases, what the GPS spoofing is doing that we're reading about is it's trying"
    },
    {
      "Time_Start": 930.56,
      "Time_End": 933.36,
      "Text": " to defeat drones."
    },
    {
      "Time_Start": 933.36,
      "Time_End": 939.04,
      "Text": " If you can confuse the drones, you might be able to make a drone either land or return"
    },
    {
      "Time_Start": 939.04,
      "Time_End": 945.6800000000001,
      "Text": " back to base if it's getting outside of where it knows it's supposed to be."
    },
    {
      "Time_Start": 945.6800000000001,
      "Time_End": 950.16,
      "Text": " If it's getting confused, it'll just fly back home."
    },
    {
      "Time_Start": 950.16,
      "Time_End": 956.28,
      "Text": " You can get GPS receivers that are hardened, but those GPS receivers that are hardened"
    },
    {
      "Time_Start": 956.28,
      "Time_End": 959.04,
      "Text": " are not going to tell you who's attacking you."
    },
    {
      "Time_Start": 959.52,
      "Time_End": 965.16,
      "Text": " If you want to set up the ability to identify where the attack is coming from, not just"
    },
    {
      "Time_Start": 965.16,
      "Time_End": 970.8,
      "Text": " try to protect the device, but also identify it, as threat hunters, you're going to need"
    },
    {
      "Time_Start": 970.8,
      "Time_End": 976.56,
      "Text": " to have additional antennas that can not only receive the signal, detect the signal that"
    },
    {
      "Time_Start": 976.56,
      "Time_End": 986.4,
      "Text": " the GPS is being targeted and protect, say, a ship or a UAV drone device from it, but"
    },
    {
      "Time_Start": 986.4,
      "Time_End": 992.4399999999999,
      "Text": " also you're going to need additional antennas to be able to detect the direction the attack"
    },
    {
      "Time_Start": 992.4399999999999,
      "Time_End": 997.88,
      "Text": " is coming from, if that is of interest to you."
    },
    {
      "Time_Start": 997.88,
      "Time_End": 1004.16,
      "Text": " Another physics-based source to consider, going back to ships, is the echo sounder."
    },
    {
      "Time_Start": 1004.16,
      "Time_End": 1008.12,
      "Text": " That would be a good target for a terrorist organization because that echo sounder on"
    },
    {
      "Time_Start": 1008.12,
      "Time_End": 1013.28,
      "Text": " a ship is going to tell the ship how deep of water they're in, whether they're about"
    },
    {
      "Time_Start": 1013.28,
      "Time_End": 1017.72,
      "Text": " to go and maybe get up on a sandbar or a reef."
    },
    {
      "Time_Start": 1017.72,
      "Time_End": 1021.72,
      "Text": " I've got an example here of a pristine reef that a ship doesn't know that it was about"
    },
    {
      "Time_Start": 1021.72,
      "Time_End": 1030.24,
      "Text": " to run aground, that it was off course for like four days until it ran up on a pristine reef."
    },
    {
      "Time_Start": 1030.24,
      "Time_End": 1039.32,
      "Text": " So maybe somebody was messing with the navigation system and the nautical maps were not showing"
    },
    {
      "Time_Start": 1039.32,
      "Time_End": 1043.24,
      "Text": " that they were where they thought they were, as well as the echo sounder was not telling"
    },
    {
      "Time_Start": 1043.24,
      "Time_End": 1046.52,
      "Text": " them that they were starting to run into shallow water and run up on a reef."
    },
    {
      "Time_Start": 1046.52,
      "Time_End": 1048.32,
      "Text": " So I'll have an example of that."
    },
    {
      "Time_Start": 1048.32,
      "Time_End": 1054.32,
      "Text": " Another device to be looking at is the denominator for monitoring wind."
    },
    {
      "Time_Start": 1054.32,
      "Time_End": 1059.12,
      "Text": " There is an issue in the Suez Canal not too long ago, there's a lot of speculation about"
    },
    {
      "Time_Start": 1059.12,
      "Time_End": 1060.52,
      "Text": " what happened there."
    },
    {
      "Time_Start": 1060.52,
      "Time_End": 1068.52,
      "Text": " There is speculation that there was a couple pilots and the captains were maybe arguing"
    },
    {
      "Time_Start": 1068.52,
      "Time_End": 1074.16,
      "Text": " on the bridge about who had authority to drive the ship through the canal."
    },
    {
      "Time_Start": 1074.16,
      "Time_End": 1080.76,
      "Text": " There's speculation that there was speculation about a cyber attack."
    },
    {
      "Time_Start": 1080.76,
      "Time_End": 1087.56,
      "Text": " And there's also some thought that what might have happened is in that part of the world"
    },
    {
      "Time_Start": 1087.56,
      "Time_End": 1093.12,
      "Text": " where the Suez Canal is, it could have been wind."
    },
    {
      "Time_Start": 1093.1200000000001,
      "Time_End": 1098.92,
      "Text": " My question is, so were the wind sensors being monitored or were they being influenced?"
    },
    {
      "Time_Start": 1098.92,
      "Time_End": 1103.16,
      "Text": " If it was a cyber attack, were they collecting the logs off those wind sensors?"
    },
    {
      "Time_Start": 1103.16,
      "Time_End": 1107.96,
      "Text": " Did they have a baseline of that to know what kind of anomaly might be happening?"
    },
    {
      "Time_Start": 1107.96,
      "Time_End": 1112.0000000000002,
      "Text": " But that was in the news for a long time there."
    },
    {
      "Time_Start": 1112.0000000000002,
      "Time_End": 1113.3200000000002,
      "Text": " They had the whole canal blocked."
    },
    {
      "Time_Start": 1113.3200000000002,
      "Time_End": 1118.4,
      "Text": " But that is a key instrument to also look at monitoring the health and status of, not"
    },
    {
      "Time_Start": 1118.4,
      "Time_End": 1124.3600000000001,
      "Text": " only for maintenance and making sure you're not experiencing issues due to the wind, but"
    },
    {
      "Time_Start": 1124.3600000000001,
      "Time_End": 1132.3600000000001,
      "Text": " also from a possible someone having a cyber security attack to influence the vessel."
    },
    {
      "Time_Start": 1132.3600000000001,
      "Time_End": 1140.2800000000002,
      "Text": " Another device to consider for getting physics-based logs from is an accelerometer, where it's"
    },
    {
      "Time_Start": 1140.2800000000002,
      "Time_End": 1144.16,
      "Text": " a device that's going to measure acceleration."
    },
    {
      "Time_Start": 1144.16,
      "Time_End": 1148.0400000000002,
      "Text": " So that mechanical motion is going to be turned into an electrical signal."
    },
    {
      "Time_Start": 1148.6,
      "Time_End": 1155.32,
      "Text": " So as threat hunters, as cyber security professionals, it's our job to monitor these type of vessels,"
    },
    {
      "Time_Start": 1155.32,
      "Time_End": 1160.2,
      "Text": " whether it's a satellite or a ship, what have you."
    },
    {
      "Time_Start": 1160.2,
      "Time_End": 1167.96,
      "Text": " We should maybe consider monitoring that mechanical to electrical signal that is being generated"
    },
    {
      "Time_Start": 1167.96,
      "Time_End": 1173.68,
      "Text": " and have that baselined and adding that to our logging and applying machine learning"
    },
    {
      "Time_Start": 1173.68,
      "Time_End": 1178.04,
      "Text": " to it over time so that we can detect those possible anomalies."
    },
    {
      "Time_Start": 1178.04,
      "Time_End": 1183.52,
      "Text": " Or it could be, again, going back, it could be that we could proactively predict a maintenance"
    },
    {
      "Time_Start": 1183.52,
      "Time_End": 1190.04,
      "Text": " issue and deal with the problem before it turns into a really big expensive issue or"
    },
    {
      "Time_Start": 1190.04,
      "Time_End": 1193.6000000000001,
      "Text": " a possible catastrophe, because we're being proactive in monitoring."
    },
    {
      "Time_Start": 1193.6000000000001,
      "Time_End": 1201.8400000000001,
      "Text": " Not every problem is a cyber attack, so it could be that it enables proactive maintenance."
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1207.4399999999998,
      "Text": " If it is a cyber attack, we'll at least have maybe have an early warning."
    },
    {
      "Time_Start": 1207.4399999999998,
      "Time_End": 1215.72,
      "Text": " Then we've got a gyroscope, very similar nature, where we're going to keep up with our orientation"
    },
    {
      "Time_Start": 1215.72,
      "Time_End": 1216.72,
      "Text": " and our speed."
    },
    {
      "Time_Start": 1216.72,
      "Time_End": 1228.32,
      "Text": " We're going to have these on our space vehicle satellites, space station, also on ships,"
    },
    {
      "Time_Start": 1228.32,
      "Time_End": 1234.6,
      "Text": " whether it's a military ship or cruise ships, cargo ships, et cetera, they're going to have"
    },
    {
      "Time_Start": 1234.6,
      "Time_End": 1235.6,
      "Text": " gyroscopes."
    },
    {
      "Time_Start": 1235.6,
      "Time_End": 1239.96,
      "Text": " That's going to be a key device to monitor and get instrumentation on for the threat"
    },
    {
      "Time_Start": 1239.96,
      "Time_End": 1245.24,
      "Text": " hunt team to know what's going on with that vessel to see if someone's influencing the"
    },
    {
      "Time_Start": 1245.24,
      "Time_End": 1246.24,
      "Text": " operation of the vehicle."
    },
    {
      "Time_Start": 1246.24,
      "Time_End": 1251.52,
      "Text": " It could be on a drone as well."
    },
    {
      "Time_Start": 1251.52,
      "Time_End": 1257.08,
      "Text": " Speaking of all these physics-based indicators on ships, there's a thing called a voyage"
    },
    {
      "Time_Start": 1257.08,
      "Time_End": 1258.08,
      "Text": " data recorder."
    },
    {
      "Time_Start": 1258.08,
      "Time_End": 1263.52,
      "Text": " Voyage data recorder is kind of like a black box for ships, you know, you've got the black"
    },
    {
      "Time_Start": 1263.52,
      "Time_End": 1264.52,
      "Text": " box on planes."
    },
    {
      "Time_Start": 1264.52,
      "Time_End": 1268.36,
      "Text": " Well, ships have something similar called the voyage data recorder."
    },
    {
      "Time_Start": 1268.36,
      "Time_End": 1276.36,
      "Text": " My thought is, if I worked for a cruise line or if I worked for a military or some cargo"
    },
    {
      "Time_Start": 1276.36,
      "Time_End": 1283.96,
      "Text": " ship organization in the future, I would want to have a voyage data recorder for my network"
    },
    {
      "Time_Start": 1283.96,
      "Time_End": 1292.52,
      "Text": " cybersecurity team so that they're getting an independent, pristine copy of all the instrumentation"
    },
    {
      "Time_Start": 1292.52,
      "Time_End": 1298.6000000000001,
      "Text": " data from all the operational technology on that ship, the navigation system, the gyroscopes,"
    },
    {
      "Time_Start": 1298.6000000000001,
      "Time_End": 1302.88,
      "Text": " all the electrical, mechanical to electrical signaling that's happening on that ship."
    },
    {
      "Time_Start": 1302.88,
      "Time_End": 1309.1200000000001,
      "Text": " I'd want to have my own voyage data recorder that my security operations center, my threat"
    },
    {
      "Time_Start": 1309.1200000000001,
      "Time_End": 1316.4,
      "Text": " hunters could be monitoring to pull independent, pristine logs to be able to figure if somebody's"
    },
    {
      "Time_Start": 1316.4,
      "Time_End": 1317.72,
      "Text": " helping me run my ship."
    },
    {
      "Time_Start": 1317.72,
      "Time_End": 1325.3600000000001,
      "Text": " Because here is an example of this Waukeshio ship that ran aground, apparently, for four"
    },
    {
      "Time_Start": 1325.3600000000001,
      "Time_End": 1326.3600000000001,
      "Text": " days."
    },
    {
      "Time_Start": 1326.3600000000001,
      "Time_End": 1330.0000000000002,
      "Text": " There were two monitoring systems."
    },
    {
      "Time_Start": 1330.0000000000002,
      "Time_End": 1335.72,
      "Text": " There was the owners of the ship that monitored the ship, and then there's a third party that"
    },
    {
      "Time_Start": 1335.72,
      "Time_End": 1338.76,
      "Text": " monitors and manages ships for the owners."
    },
    {
      "Time_Start": 1338.76,
      "Time_End": 1343.4,
      "Text": " And like I said, they work with the captains, and apparently, those organizations have more"
    },
    {
      "Time_Start": 1343.4,
      "Time_End": 1348.84,
      "Text": " control and authority than the captain on the ship about where the ship is going, the"
    },
    {
      "Time_Start": 1348.84,
      "Time_End": 1356.92,
      "Text": " speed, the direction they're taking based on weather, et cetera."
    },
    {
      "Time_Start": 1356.92,
      "Time_End": 1362.1200000000001,
      "Text": " In both of those networks that are monitoring the health status, monitoring location of"
    },
    {
      "Time_Start": 1362.1200000000001,
      "Time_End": 1367.88,
      "Text": " those ships, apparently, they had bad data for four days, and nobody knew what really"
    },
    {
      "Time_Start": 1367.88,
      "Time_End": 1372.3600000000001,
      "Text": " was going on with that ship until it ran aground up on a pristine reef."
    },
    {
      "Time_Start": 1372.3600000000001,
      "Time_End": 1378.0000000000002,
      "Text": " So that goes back to, from a threat hunting standpoint, as cybersecurity professionals,"
    },
    {
      "Time_Start": 1378.0000000000002,
      "Time_End": 1383.1200000000001,
      "Text": " we need to be able to have a voyage data recorder access of our own so that the threat hunters"
    },
    {
      "Time_Start": 1383.1200000000001,
      "Time_End": 1390.24,
      "Text": " can be pulling this data and correlating it with enterprise-type data to get a baseline"
    },
    {
      "Time_Start": 1390.24,
      "Time_End": 1395.52,
      "Text": " of what's happening with the network."
    },
    {
      "Time_Start": 1395.52,
      "Time_End": 1406.24,
      "Text": " This goes back to where I've spent most of my years as a professional in telecommunications,"
    },
    {
      "Time_Start": 1406.24,
      "Time_End": 1410.8,
      "Text": " service provider networks, and I presented on this a few years ago, about four years"
    },
    {
      "Time_Start": 1410.8,
      "Time_End": 1415.2,
      "Text": " ago, about hacking telecommunications, service provider networks."
    },
    {
      "Time_Start": 1415.2,
      "Time_End": 1422.0,
      "Text": " So since we're talking about physics-based detection, I wanted to bring this back up."
    },
    {
      "Time_Start": 1422.0,
      "Time_End": 1426.88,
      "Text": " It's not talked a lot about, especially the telecommunications companies, they don't want"
    },
    {
      "Time_Start": 1426.88,
      "Time_End": 1430.8400000000001,
      "Text": " to talk about the fact that their networks get hacked like everybody else's do, and there's"
    },
    {
      "Time_Start": 1430.8400000000001,
      "Time_End": 1435.24,
      "Text": " insider threats, there's nation states that are targeting their networks, there's organized"
    },
    {
      "Time_Start": 1435.24,
      "Time_End": 1443.48,
      "Text": " crime that are targeting their networks as well, but we just treat it like the cloud."
    },
    {
      "Time_Start": 1443.48,
      "Time_End": 1444.72,
      "Text": " It's a black box to us."
    },
    {
      "Time_Start": 1445.72,
      "Time_End": 1447.6000000000001,
      "Text": " BGP is being hijacked."
    },
    {
      "Time_Start": 1447.6000000000001,
      "Time_End": 1452.72,
      "Text": " If you're not aware of it, you need to be watching and monitoring your BGP, but also,"
    },
    {
      "Time_Start": 1452.72,
      "Time_End": 1459.72,
      "Text": " if you're buying services like multi-protocol label switching, which a lot of us in the"
    },
    {
      "Time_Start": 1459.72,
      "Time_End": 1464.92,
      "Text": " enterprise world treat as a black box network and we just don't ask any questions, the telco"
    },
    {
      "Time_Start": 1464.92,
      "Time_End": 1466.92,
      "Text": " tells us it's secure."
    },
    {
      "Time_Start": 1466.92,
      "Time_End": 1473.84,
      "Text": " They use the acronym VPN, so everybody assumes that that implies encryption, but it doesn't."
    },
    {
      "Time_Start": 1473.9599999999998,
      "Time_End": 1479.3999999999999,
      "Text": " It's just a layer two, layer three, unencrypted VPN."
    },
    {
      "Time_Start": 1479.3999999999999,
      "Time_End": 1482.8799999999999,
      "Text": " It's not encrypted until you lay encryption on it."
    },
    {
      "Time_Start": 1482.8799999999999,
      "Time_End": 1491.12,
      "Text": " So you could very well either have someone, an insider threat that works for the telco"
    },
    {
      "Time_Start": 1491.12,
      "Time_End": 1492.8799999999999,
      "Text": " or a nation state actor."
    },
    {
      "Time_Start": 1492.8799999999999,
      "Time_End": 1496.12,
      "Text": " I'm aware of multiple cases of each."
    },
    {
      "Time_Start": 1496.12,
      "Time_End": 1503.0,
      "Text": " Can't go into them for NDAs, obviously, but I'm aware of multiple cases where these networks"
    },
    {
      "Time_Start": 1503.0,
      "Time_End": 1508.28,
      "Text": " are being targeted and the enterprises accidentally find out about it."
    },
    {
      "Time_Start": 1508.28,
      "Time_End": 1514.24,
      "Text": " And like one organization, they called some IP addresses out of an interesting part of"
    },
    {
      "Time_Start": 1514.24,
      "Time_End": 1519.56,
      "Text": " the world coming in from their MPLS VPN is secure."
    },
    {
      "Time_Start": 1519.56,
      "Time_End": 1521.84,
      "Text": " It's secure because it's VPN, right?"
    },
    {
      "Time_Start": 1521.84,
      "Time_End": 1528.56,
      "Text": " There is from their public, private, rather their private VPN service, there is traffic"
    },
    {
      "Time_Start": 1529.08,
      "Time_End": 1534.08,
      "Text": " exfiltrating out their firewall and they didn't recognize the IP addresses and they tracked"
    },
    {
      "Time_Start": 1534.08,
      "Time_End": 1540.04,
      "Text": " it back and the telco MPLS VPN network had been hacked and some adversary had added themselves"
    },
    {
      "Time_Start": 1540.04,
      "Time_End": 1542.56,
      "Text": " to their MPLS VPN."
    },
    {
      "Time_Start": 1542.56,
      "Time_End": 1550.24,
      "Text": " And then of course, there's a lot of conversations on the internet about BGP hacking."
    },
    {
      "Time_Start": 1550.24,
      "Time_End": 1557.6399999999999,
      "Text": " I want to throw out the idea that one way to detect this, if you don't have good visibility"
    },
    {
      "Time_Start": 1557.64,
      "Time_End": 1558.64,
      "Text": " is timing."
    },
    {
      "Time_Start": 1558.64,
      "Time_End": 1564.5600000000002,
      "Text": " Even if you're on the enterprise side, if you're out on the edge of a telecommunications"
    },
    {
      "Time_Start": 1564.5600000000002,
      "Time_End": 1568.4,
      "Text": " carrier network, you're not sure what's happening with the telco."
    },
    {
      "Time_Start": 1568.4,
      "Time_End": 1572.6000000000001,
      "Text": " You can't hide from physics and time is going to tell the truth."
    },
    {
      "Time_Start": 1572.6000000000001,
      "Time_End": 1579.24,
      "Text": " If you've got a baseline of what your connectivity looks like to your remote locations, you know,"
    },
    {
      "Time_Start": 1579.24,
      "Time_End": 1586.6000000000001,
      "Text": " say across Poland, across Europe, Asia, the US, South America, the Pacific, et cetera."
    },
    {
      "Time_Start": 1586.6000000000001,
      "Time_End": 1591.0800000000002,
      "Text": " If you have a good baseline of that, you can be able to go and indicate that someone"
    },
    {
      "Time_Start": 1591.0800000000002,
      "Time_End": 1600.5600000000002,
      "Text": " is doing like using MPLS traffic engineering or something to redirect your traffic down"
    },
    {
      "Time_Start": 1600.5600000000002,
      "Time_End": 1608.2800000000002,
      "Text": " a different path so that they can do capture or possibly injection into your MPLS network"
    },
    {
      "Time_Start": 1608.2800000000002,
      "Time_End": 1610.2400000000002,
      "Text": " or your internet network."
    },
    {
      "Time_Start": 1610.2400000000002,
      "Time_End": 1614.3200000000002,
      "Text": " There's something else to consider and there's a bunch of papers out there on this."
    },
    {
      "Time_Start": 1614.32,
      "Time_End": 1626.84,
      "Text": " One thing I want to draw your attention to is there's a big push to put lots of technology"
    },
    {
      "Time_Start": 1626.84,
      "Time_End": 1634.0,
      "Text": " out on the military now, both in the US and, of course, here in Europe."
    },
    {
      "Time_Start": 1634.0,
      "Time_End": 1638.9399999999998,
      "Text": " Everyone is deploying and adding new technology and putting all these specialized sensors"
    },
    {
      "Time_Start": 1638.94,
      "Time_End": 1647.18,
      "Text": " and devices on troops as well as emergency responders, adding all kinds of new gadgets"
    },
    {
      "Time_Start": 1647.18,
      "Time_End": 1651.94,
      "Text": " and communications devices, but as IT and cyber security professionals, we've got to"
    },
    {
      "Time_Start": 1651.94,
      "Time_End": 1656.74,
      "Text": " figure out how we're going to threat hunt all these devices, do the forensics and threat"
    },
    {
      "Time_Start": 1656.74,
      "Time_End": 1665.3,
      "Text": " hunt and monitor the local system on an emergency responder or a military personnel."
    },
    {
      "Time_Start": 1665.3,
      "Time_End": 1668.5,
      "Text": " How do we monitor and make sure those devices are not being hacked, that there's some kind"
    },
    {
      "Time_Start": 1668.5,
      "Time_End": 1676.98,
      "Text": " of compromise to them with the whole military things and battlefield things?"
    },
    {
      "Time_Start": 1676.98,
      "Time_End": 1684.14,
      "Text": " One thing to consider is leveraging software-defined radio to monitor all these different protocols"
    },
    {
      "Time_Start": 1684.14,
      "Time_End": 1695.3,
      "Text": " that may be getting utilized, like LORA and LORAWAN and all the different SATCOM communications,"
    },
    {
      "Time_Start": 1695.3,
      "Time_End": 1696.98,
      "Text": " something that a lot of people are not thinking about."
    },
    {
      "Time_Start": 1696.98,
      "Time_End": 1699.46,
      "Text": " What about the ham radio protocol?"
    },
    {
      "Time_Start": 1699.46,
      "Time_End": 1710.74,
      "Text": " It's low speed, not a lot of bandwidth, and that's an old-school protocol that more seasoned"
    },
    {
      "Time_Start": 1710.74,
      "Time_End": 1715.14,
      "Text": " professionals are aware of the ham networks and ham protocols, and a lot of the younger"
    },
    {
      "Time_Start": 1715.14,
      "Time_End": 1719.1,
      "Text": " generation that are coming up are not aware of the ham networks and don't use it because"
    },
    {
      "Time_Start": 1719.1,
      "Time_End": 1724.58,
      "Text": " it's too slow for them, and they're not interested in having voice communications over ham, but"
    },
    {
      "Time_Start": 1724.58,
      "Time_End": 1728.3799999999999,
      "Text": " the ham radio network has the ability to do data communication, and it's not going"
    },
    {
      "Time_Start": 1728.3799999999999,
      "Time_End": 1729.3799999999999,
      "Text": " to be high-speed."
    },
    {
      "Time_Start": 1729.3799999999999,
      "Time_End": 1734.98,
      "Text": " You're not going to be X-filling terabytes of data, but you could be using it for command"
    },
    {
      "Time_Start": 1734.98,
      "Time_End": 1735.98,
      "Text": " control."
    },
    {
      "Time_Start": 1735.98,
      "Time_End": 1737.8999999999999,
      "Text": " All you need is a shell, right?"
    },
    {
      "Time_Start": 1737.8999999999999,
      "Time_End": 1745.02,
      "Text": " What is to stop someone from taking that slow ham link and using it for backdoor data communications"
    },
    {
      "Time_Start": 1745.02,
      "Time_End": 1746.98,
      "Text": " or for command control?"
    },
    {
      "Time_Start": 1746.98,
      "Time_End": 1753.1399999999999,
      "Text": " Something else to look at, and also keep an eye on this 5G and 6G, and 6G, I mean, everybody's"
    },
    {
      "Time_Start": 1753.14,
      "Time_End": 1754.14,
      "Text": " talking about it."
    },
    {
      "Time_Start": 1754.14,
      "Time_End": 1761.8200000000002,
      "Text": " It's coming with the new satellite architectures that are about to be deployed."
    },
    {
      "Time_Start": 1761.8200000000002,
      "Time_End": 1766.42,
      "Text": " Something else to put on your radar, if it ain't already, is the whole internet of space"
    },
    {
      "Time_Start": 1766.42,
      "Time_End": 1767.42,
      "Text": " things."
    },
    {
      "Time_Start": 1767.42,
      "Time_End": 1772.14,
      "Text": " SpaceX bought a company called Swarm, and what they're doing is putting in satellites"
    },
    {
      "Time_Start": 1772.14,
      "Time_End": 1774.42,
      "Text": " in very low-Earth orbit."
    },
    {
      "Time_Start": 1774.42,
      "Time_End": 1778.14,
      "Text": " In very low-Earth orbit, those satellites are not going to stay up in orbit for very"
    },
    {
      "Time_Start": 1778.14,
      "Time_End": 1780.7800000000002,
      "Text": " long because of the atmospheric drag."
    },
    {
      "Time_Start": 1780.78,
      "Time_End": 1783.3799999999999,
      "Text": " Because atmospheric drag, it's going to pull those satellites out of orbit, and they're"
    },
    {
      "Time_Start": 1783.3799999999999,
      "Time_End": 1787.26,
      "Text": " going to burn up in the atmosphere after being up there for a short period of time, so it's"
    },
    {
      "Time_Start": 1787.26,
      "Time_End": 1792.98,
      "Text": " not going to be a big issue with debris, things like that, because where they're located in"
    },
    {
      "Time_Start": 1792.98,
      "Time_End": 1797.86,
      "Text": " orbit, they'll just fall out and burn out, and they're small."
    },
    {
      "Time_Start": 1797.86,
      "Time_End": 1804.26,
      "Text": " But we need to be thinking about in our plans of how are we going to do forensics and incident"
    },
    {
      "Time_Start": 1804.26,
      "Time_End": 1808.18,
      "Text": " response and threat hunting of all these low-Earth wind devices."
    },
    {
      "Time_Start": 1809.18,
      "Time_End": 1814.74,
      "Text": " It's another communication protocol, a whole other set of devices, and I'm having a lot"
    },
    {
      "Time_Start": 1814.74,
      "Time_End": 1820.02,
      "Text": " of conversations around these type of devices and looking at using these communications,"
    },
    {
      "Time_Start": 1820.02,
      "Time_End": 1824.9,
      "Text": " and so as threat hunters, we need to be thinking about how we're going to go and hunt lower"
    },
    {
      "Time_Start": 1824.9,
      "Time_End": 1828.42,
      "Text": " wind and these type of IOT devices."
    },
    {
      "Time_Start": 1830.26,
      "Time_End": 1835.94,
      "Text": " Last year, I was here, I spoke about some of the satellites that have been hacked, and"
    },
    {
      "Time_Start": 1835.94,
      "Time_End": 1838.14,
      "Text": " I'll just hit this real fast."
    },
    {
      "Time_Start": 1838.14,
      "Time_End": 1844.5,
      "Text": " The Landsat 7 was hacked a couple times, it was confirmed it was attacked, the Terra"
    },
    {
      "Time_Start": 1844.5,
      "Time_End": 1850.3400000000001,
      "Text": " satellite was targeted, that was confirmed to be an attack, be taken over momentarily,"
    },
    {
      "Time_Start": 1850.3400000000001,
      "Time_End": 1855.98,
      "Text": " there was a NOAA satellite, NOAA is an organization in the U.S., it monitors the atmosphere, the"
    },
    {
      "Time_Start": 1855.98,
      "Time_End": 1862.0600000000002,
      "Text": " oceans and things for the U.S., that satellite was attacked successfully, and then control"
    },
    {
      "Time_Start": 1862.0600000000002,
      "Time_End": 1863.74,
      "Text": " was regained from it."
    },
    {
      "Time_Start": 1863.74,
      "Time_End": 1868.0200000000002,
      "Text": " There's debate about the ROSAT, depending on what camp you're in, there's those that"
    },
    {
      "Time_Start": 1868.02,
      "Time_End": 1876.5,
      "Text": " say it wasn't hacked, and they will argue behemothly that it was not hacked, then there's"
    },
    {
      "Time_Start": 1876.5,
      "Time_End": 1880.78,
      "Text": " others that say that it really was hacked and it was directed toward the sun and burned"
    },
    {
      "Time_Start": 1880.78,
      "Time_End": 1885.1,
      "Text": " up the sensor and disabled that satellite."
    },
    {
      "Time_Start": 1885.1,
      "Time_End": 1893.06,
      "Text": " The speculation on the ROSAT is that a ground station was hacked in Europe, I think it was"
    },
    {
      "Time_Start": 1893.06,
      "Time_End": 1898.46,
      "Text": " by the Russians, is what the speculation is, it was hacked and the satellite was turned,"
    },
    {
      "Time_Start": 1898.46,
      "Time_End": 1901.06,
      "Text": " and so it was disabled."
    },
    {
      "Time_Start": 1901.06,
      "Time_End": 1907.4199999999998,
      "Text": " Then the UK Skynet satellite, that's one of, Skynet is a UK military satellite network,"
    },
    {
      "Time_Start": 1907.4199999999998,
      "Time_End": 1914.34,
      "Text": " it's a constellation of four satellites, there's a lot of arguing back and forth about whether"
    },
    {
      "Time_Start": 1914.34,
      "Time_End": 1915.82,
      "Text": " that really got hacked or not."
    },
    {
      "Time_Start": 1915.82,
      "Time_End": 1920.6599999999999,
      "Text": " I found some pretty good references that said that they didn't admit that the whole satellite"
    },
    {
      "Time_Start": 1920.66,
      "Time_End": 1927.3000000000002,
      "Text": " was totally taken care of, hacked, and held for ransom, but I did find references that"
    },
    {
      "Time_Start": 1927.3000000000002,
      "Time_End": 1934.6200000000001,
      "Text": " said that admitted that the control link was taken control of momentarily, so me, I read"
    },
    {
      "Time_Start": 1934.6200000000001,
      "Time_End": 1940.8600000000001,
      "Text": " it got hacked, but depending on what camp you're in, the argument goes back and forth"
    },
    {
      "Time_Start": 1940.8600000000001,
      "Time_End": 1944.98,
      "Text": " whether it happened, but I did find links where it was admitted that the control link"
    },
    {
      "Time_Start": 1944.98,
      "Time_End": 1950.3400000000001,
      "Text": " was successfully targeted, so we've got to be thinking about threat hunting these satellites"
    },
    {
      "Time_Start": 1950.3400000000001,
      "Time_End": 1957.3400000000001,
      "Text": " and things, and so from a cybersecurity threat hunting standpoint, what are we up against?"
    },
    {
      "Time_Start": 1957.3400000000001,
      "Time_End": 1964.0600000000002,
      "Text": " From a legacy standpoint, what I've been able to find is 23 different space operating systems"
    },
    {
      "Time_Start": 1964.0600000000002,
      "Time_End": 1968.0600000000002,
      "Text": " that have been used, there's probably more that I have not been able to identify yet."
    },
    {
      "Time_Start": 1968.0600000000002,
      "Time_End": 1973.7800000000002,
      "Text": " A brand new one that I just discovered down at the bottom in the center is MIT's come"
    },
    {
      "Time_Start": 1973.7800000000002,
      "Time_End": 1979.66,
      "Text": " out with a new cyber-hardened satellite software system where they've gone in and engineered"
    },
    {
      "Time_Start": 1979.66,
      "Time_End": 1984.78,
      "Text": " from the ground up for that operating system for a spacecraft to be secure from the very"
    },
    {
      "Time_Start": 1984.78,
      "Time_End": 1990.74,
      "Text": " beginning, so that's a new operating system, it was just published, I don't know if it's"
    },
    {
      "Time_Start": 1990.74,
      "Time_End": 1996.5400000000002,
      "Text": " going to be available in the open source like on GitHub or if it's only going to be select"
    },
    {
      "Time_Start": 1996.5400000000002,
      "Time_End": 2001.3000000000002,
      "Text": " organizations that have access to it, I have no idea yet, but most of the satellites today"
    },
    {
      "Time_Start": 2001.46,
      "Time_End": 2010.26,
      "Text": " that are being flown are predominantly Linux-based kernels, like SpaceX, SpaceX has its own Linux"
    },
    {
      "Time_Start": 2010.26,
      "Time_End": 2019.02,
      "Text": " kernel for the rockets and its satellite systems, they have a hardened Linux kernel, so most"
    },
    {
      "Time_Start": 2019.02,
      "Time_End": 2027.3,
      "Text": " things are converging on a custom Linux kernel, but if we're going to, like I said, if we're"
    },
    {
      "Time_Start": 2027.3,
      "Time_End": 2031.18,
      "Text": " going to go start doing threat hunting, we're working for some organization that's got space"
    },
    {
      "Time_Start": 2031.18,
      "Time_End": 2035.0600000000002,
      "Text": " craft assets, we've got to account for this, how we're going to go and do threat hunting,"
    },
    {
      "Time_Start": 2035.0600000000002,
      "Time_End": 2037.38,
      "Text": " forensics, incident response in space."
    },
    {
      "Time_Start": 2039.26,
      "Time_End": 2043.54,
      "Text": " Then when, also we start looking at this, then there's not only the operating system,"
    },
    {
      "Time_Start": 2043.54,
      "Time_End": 2050.54,
      "Text": " but the command languages to talk to the spacecraft, because a lot of them are more of, a lot of"
    },
    {
      "Time_Start": 2050.54,
      "Time_End": 2060.42,
      "Text": " the new ones are using Linux, Python is probably going to be an option, the CCSDS standard"
    },
    {
      "Time_Start": 2060.46,
      "Time_End": 2068.9,
      "Text": " is probably what you're going to see primarily as a command language on most of these satellites."
    },
    {
      "Time_Start": 2069.54,
      "Time_End": 2074.62,
      "Text": " It's an international standard, a lot of the satellites use, but you need to be aware of"
    },
    {
      "Time_Start": 2074.62,
      "Time_End": 2078.7400000000002,
      "Text": " these other command languages, depending on the satellites that you're, there's a lot"
    },
    {
      "Time_Start": 2078.7400000000002,
      "Time_End": 2082.86,
      "Text": " of satellites that are, that have been in orbit for a long time, legacy satellites that"
    },
    {
      "Time_Start": 2082.86,
      "Time_End": 2086.62,
      "Text": " we may have to deal with and have to go and be able to do threat hunting against."
    },
    {
      "Time_Start": 2087.62,
      "Time_End": 2094.1,
      "Text": " And along, and also along that same line are the protocols that the satellites might be using."
    },
    {
      "Time_Start": 2094.1,
      "Time_End": 2100.06,
      "Text": " Predominantly, you're going to see the CCSDS space communication protocol, that is an international"
    },
    {
      "Time_Start": 2100.06,
      "Time_End": 2107.22,
      "Text": " standard, and also in Europe, there is the European Cooperation for Space Standardization"
    },
    {
      "Time_Start": 2107.22,
      "Time_End": 2113.7799999999997,
      "Text": " Packet Utilization Standard, ECSS, that is a protocol that is a standard that's used"
    },
    {
      "Time_Start": 2113.78,
      "Time_End": 2118.86,
      "Text": " for a lot of satellites here in Europe that you may run into, but there is a, but there"
    },
    {
      "Time_Start": 2118.86,
      "Time_End": 2123.9,
      "Text": " are a lot of protocols out there that you could encounter if you started working for"
    },
    {
      "Time_Start": 2123.9,
      "Time_End": 2129.98,
      "Text": " an organization that has spacecraft assets that you need to help get monitoring visibility"
    },
    {
      "Time_Start": 2129.98,
      "Time_End": 2130.98,
      "Text": " on."
    },
    {
      "Time_Start": 2130.98,
      "Time_End": 2136.7400000000002,
      "Text": " And of course, IP and IPv6 are out there, and we have WebOne, SpaceX, with the Starlink"
    },
    {
      "Time_Start": 2136.7400000000002,
      "Time_End": 2144.94,
      "Text": " network, and Biosat, they're all running IP, and MPLS and all that."
    },
    {
      "Time_Start": 2144.94,
      "Time_End": 2148.1400000000003,
      "Text": " So where are we at from a cybersecurity standpoint in space?"
    },
    {
      "Time_Start": 2148.1400000000003,
      "Time_End": 2154.6600000000003,
      "Text": " This is, I'm an old school Cisco guy, that's what I grew up, spent most of my career working"
    },
    {
      "Time_Start": 2154.6600000000003,
      "Time_End": 2159.3,
      "Text": " on Cisco routers and networking."
    },
    {
      "Time_Start": 2159.3,
      "Time_End": 2165.0600000000004,
      "Text": " So this really got my attention because I remember back when Cisco self-defending networks"
    },
    {
      "Time_Start": 2165.06,
      "Time_End": 2172.38,
      "Text": " came out in the early 2000s, so their first intrusion prevention system came out from"
    },
    {
      "Time_Start": 2172.38,
      "Time_End": 2176.18,
      "Text": " a company that I believe is called NetRanger, I believe they had the very first one, Cisco"
    },
    {
      "Time_Start": 2176.18,
      "Time_End": 2180.9,
      "Text": " bought them, and now everybody's got an intrusion prevention system."
    },
    {
      "Time_Start": 2180.9,
      "Time_End": 2187.7799999999997,
      "Text": " But Slingshot is a satellite that the Aerospace Corporation put up in September of 2022, and"
    },
    {
      "Time_Start": 2187.7799999999997,
      "Time_End": 2193.38,
      "Text": " it has an intrusion prevention system capability on it, and so it's constantly monitoring and"
    },
    {
      "Time_Start": 2193.38,
      "Time_End": 2199.5,
      "Text": " logging and looking for unexpected commands, commands out of order."
    },
    {
      "Time_Start": 2199.5,
      "Time_End": 2206.5,
      "Text": " It's baselining all the data that's coming into it, any kind of commands that are out"
    },
    {
      "Time_Start": 2206.5,
      "Time_End": 2214.46,
      "Text": " of line of what's expected, it's utilizing machine learning to detect anomalies in activity"
    },
    {
      "Time_Start": 2214.46,
      "Time_End": 2217.86,
      "Text": " on the spacecraft itself, and any commands that are sent to it."
    },
    {
      "Time_Start": 2218.3,
      "Time_End": 2225.82,
      "Text": " I think this is pretty interesting that where things are headed with a self-defending satellite."
    },
    {
      "Time_Start": 2227.82,
      "Time_End": 2234.38,
      "Text": " We've had the self-defending networks where a firewall IDS can detect an attack, and then"
    },
    {
      "Time_Start": 2234.38,
      "Time_End": 2241.38,
      "Text": " the firewall IDS can reconfigure, it can reconfigure the firewall in your router to respond to"
    },
    {
      "Time_Start": 2241.38,
      "Time_End": 2242.38,
      "Text": " that attack."
    },
    {
      "Time_Start": 2242.38,
      "Time_End": 2246.42,
      "Text": " Well, now we're looking at using that same kind of concept for a satellite so that the"
    },
    {
      "Time_Start": 2246.42,
      "Time_End": 2256.26,
      "Text": " satellite can defend itself, which is here in Europe, a satellite was launched in July"
    },
    {
      "Time_Start": 2256.26,
      "Time_End": 2262.3,
      "Text": " of 2021, and similarly, it has a self-defending capability, and it's using software-defined"
    },
    {
      "Time_Start": 2262.3,
      "Time_End": 2269.42,
      "Text": " radio so that if it starts detecting and someone messing with its frequencies, trying to jam"
    },
    {
      "Time_Start": 2269.42,
      "Time_End": 2276.06,
      "Text": " the satellite, it's using the same frequencies interfering with it, the satellite, the software-defined"
    },
    {
      "Time_Start": 2276.06,
      "Time_End": 2281.82,
      "Text": " radio on the satellite can be reprogrammed dynamically to defend itself and jump to different"
    },
    {
      "Time_Start": 2281.82,
      "Time_End": 2287.38,
      "Text": " frequencies so that it can keep operating and work through whether it's accidental or"
    },
    {
      "Time_Start": 2287.38,
      "Time_End": 2291.2999999999997,
      "Text": " intentional disruption to its communications."
    },
    {
      "Time_Start": 2291.2999999999997,
      "Time_End": 2295.02,
      "Text": " I think it's really interesting to see where this is going to go."
    },
    {
      "Time_Start": 2295.02,
      "Time_End": 2301.06,
      "Text": " I'm really fascinated with the possibilities of a self-defending spacecraft."
    },
    {
      "Time_Start": 2302.06,
      "Time_End": 2308.5,
      "Text": " Here are some tools that are new."
    },
    {
      "Time_Start": 2308.5,
      "Time_End": 2311.62,
      "Text": " Everybody knows about MITRE ATT&CK."
    },
    {
      "Time_Start": 2311.62,
      "Time_End": 2315.58,
      "Text": " All through this presentation, we talked about machine learning and AI over and over again."
    },
    {
      "Time_Start": 2315.58,
      "Time_End": 2319.58,
      "Text": " So if you're interested in machine learning and AI, you also need to be looking at MITRE"
    },
    {
      "Time_Start": 2319.58,
      "Time_End": 2324.54,
      "Text": " ATLAS because the machine learning AI are being targeted with what's called adversarial"
    },
    {
      "Time_Start": 2324.9,
      "Time_End": 2331.14,
      "Text": " machine learning, where the machine learning and AI algorithms and the data are being targeted."
    },
    {
      "Time_Start": 2331.14,
      "Time_End": 2338.82,
      "Text": " So you want to go and check out MITRE ATLAS if you're involved with machine learning projects"
    },
    {
      "Time_Start": 2338.82,
      "Time_End": 2343.5,
      "Text": " because your machine learning AI is going to be targeted as well."
    },
    {
      "Time_Start": 2343.5,
      "Time_End": 2348.34,
      "Text": " The European Space Agency, just here a couple weeks ago, released SHIELD."
    },
    {
      "Time_Start": 2348.34,
      "Time_End": 2355.06,
      "Text": " Think of SHIELD as a space capability similar to MITRE ATT&CK, but it came out of the European"
    },
    {
      "Time_Start": 2355.06,
      "Time_End": 2356.54,
      "Text": " Space Agency."
    },
    {
      "Time_Start": 2356.54,
      "Time_End": 2358.1400000000003,
      "Text": " It's brand new."
    },
    {
      "Time_Start": 2358.1400000000003,
      "Time_End": 2359.58,
      "Text": " There's SPARTA."
    },
    {
      "Time_Start": 2359.58,
      "Time_End": 2364.1000000000004,
      "Text": " It's similar to MITRE ATT&CK, but it came out of Aerospace Corporation."
    },
    {
      "Time_Start": 2364.1000000000004,
      "Time_End": 2368.1000000000004,
      "Text": " I had a good friend of mine, Dr. Jacob Oakley."
    },
    {
      "Time_Start": 2368.1000000000004,
      "Time_End": 2371.98,
      "Text": " He just released this framework called TREX."
    },
    {
      "Time_Start": 2371.98,
      "Time_End": 2373.46,
      "Text": " I encourage you to look at that."
    },
    {
      "Time_Start": 2373.46,
      "Time_End": 2376.3,
      "Text": " That's focused on space vehicles."
    },
    {
      "Time_Start": 2377.3,
      "Time_End": 2384.42,
      "Text": " Dr. Oakley is a true SME in cybersecurity, and he actually wrote the only book that I'm aware of on"
    },
    {
      "Time_Start": 2384.42,
      "Time_End": 2386.0600000000004,
      "Text": " space cybersecurity."
    },
    {
      "Time_Start": 2386.0600000000004,
      "Time_End": 2390.1800000000003,
      "Text": " So if you're interested in space satellite cybersecurity, you need to check out Dr. Oakley's"
    },
    {
      "Time_Start": 2390.1800000000003,
      "Time_End": 2392.02,
      "Text": " book out on Amazon."
    },
    {
      "Time_Start": 2392.02,
      "Time_End": 2393.2200000000003,
      "Text": " It's a really good book."
    },
    {
      "Time_Start": 2393.2200000000003,
      "Time_End": 2402.1800000000003,
      "Text": " And also, a new tool that I'm interested in that also has industrial control system plug-ins is"
    },
    {
      "Time_Start": 2402.18,
      "Time_End": 2408.58,
      "Text": " MITRE's Caldera, which will help automate some of these frameworks for both blue team and red"
    },
    {
      "Time_Start": 2408.58,
      "Time_End": 2410.98,
      "Text": " team testing."
    },
    {
      "Time_Start": 2410.98,
      "Time_End": 2412.5,
      "Text": " We'll make sure those are on your radar."
    }
  ]
}