{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 19.64,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hey everyone, on behalf of Spectrops and the Spectrops crew, I'd like to thank you for"
    },
    {
      "Time_Start": 19.64,
      "Time_End": 24.48,
      "Text": " attending our first conference event, hopefully the first of many."
    },
    {
      "Time_Start": 25.44,
      "Time_End": 30.48,
      "Text": " You know, obviously we've been going through this pandemic sort of situation for the last"
    },
    {
      "Time_Start": 30.48,
      "Time_End": 36.0,
      "Text": " several months, and early on, sort of like from a leadership perspective,"
    },
    {
      "Time_Start": 36.64,
      "Time_End": 43.36,
      "Text": " kind of sort of like a state of paralysis as you're dealing with all these company issues"
    },
    {
      "Time_Start": 43.36,
      "Time_End": 47.44,
      "Text": " and customers that are having issues, and how are you going to switch all your operations to"
    },
    {
      "Time_Start": 47.44,
      "Time_End": 54.0,
      "Text": " a specific method. Much of our crew got together and came up with this week of webinars in the"
    },
    {
      "Time_Start": 54.0,
      "Time_End": 63.120000000000005,
      "Text": " spring, kind of just, I don't know, do something positive, right? And, you know, I think I had a"
    },
    {
      "Time_Start": 63.120000000000005,
      "Time_End": 68.64,
      "Text": " dark time and hopefully something that like gave people a little bit of a distraction for a while."
    },
    {
      "Time_Start": 68.64,
      "Time_End": 75.03999999999999,
      "Text": " And as we got into the summer, we looked at our year, we, you know, we want to take that further"
    },
    {
      "Time_Start": 75.68,
      "Time_End": 81.52,
      "Text": " and kind of focus us as a company on what we sort of wanted to do, right? What we wanted to"
    },
    {
      "Time_Start": 84.08,
      "Time_End": 89.52,
      "Text": " kind of do for the rest of the year, and kind of what could we do for a positive sort of thing"
    },
    {
      "Time_Start": 89.52,
      "Time_End": 93.68,
      "Text": " for the industry, and kind of focus everything down to that. So that's how we kind of came up"
    },
    {
      "Time_Start": 93.68,
      "Time_End": 101.84,
      "Text": " with this conference, and hopefully we enjoy it. The team has put a ton of work into this over the"
    },
    {
      "Time_Start": 101.84,
      "Time_End": 106.72,
      "Text": " last several months, and I kind of get to be the idea guy, right? So I sit there and say,"
    },
    {
      "Time_Start": 106.72,
      "Time_End": 111.12,
      "Text": " we should do this thing, and then just get to sit on the sidelines as everybody else gets to do it."
    },
    {
      "Time_Start": 111.12,
      "Time_End": 115.84,
      "Text": " And it's, you know, I'm really happy and proud to see this amazing amount of work that the team"
    },
    {
      "Time_Start": 115.84,
      "Time_End": 122.4,
      "Text": " has put in place and done to produce this. So hopefully we enjoy it, and on behalf of the team,"
    },
    {
      "Time_Start": 122.4,
      "Time_End": 128.96,
      "Text": " again, I thank you for spending some time with us. Just a little bit of overview on the conference."
    },
    {
      "Time_Start": 129.92000000000002,
      "Time_End": 134.96,
      "Text": " If you haven't seen it already, I kind of have a lobby for various places you can go."
    },
    {
      "Time_Start": 135.44,
      "Time_End": 141.12,
      "Text": " You know, every year we try to do sort of like a charity, you know, like design a shirt and do a"
    },
    {
      "Time_Start": 141.12,
      "Time_End": 148.0,
      "Text": " charity, you know, sometimes, or do the proceeds, something that's important to us. And this year"
    },
    {
      "Time_Start": 148.0,
      "Time_End": 151.84,
      "Text": " we wanted to kind of expand that in conjunction with the conference. So we have our first sort"
    },
    {
      "Time_Start": 151.84,
      "Time_End": 156.24,
      "Text": " of swag store for our conference, and kind of a suite of charities that are important to us,"
    },
    {
      "Time_Start": 157.12,
      "Time_End": 162.64000000000001,
      "Text": " you know, with some very spectro-obscure, so feel free to check that out. And then kind of"
    },
    {
      "Time_Start": 162.64000000000001,
      "Time_End": 167.92000000000002,
      "Text": " recreate that lobby-com feel a little bit as best we could. So we set up a channel on"
    },
    {
      "Time_Start": 167.92000000000002,
      "Time_End": 173.84,
      "Text": " Bloodhound Slack. We'll be hanging out during the day on Friday. I mean, it's Wednesday since"
    },
    {
      "Time_Start": 173.84,
      "Time_End": 179.04000000000002,
      "Text": " I'm recording this, but we'll be all hanging out there, and you can chat with us, and hopefully"
    },
    {
      "Time_Start": 179.04000000000002,
      "Time_End": 185.92000000000002,
      "Text": " just have some fun. And then obviously all of these sessions are recorded so that people can"
    },
    {
      "Time_Start": 185.92000000000002,
      "Time_End": 190.08,
      "Text": " kind of view them at your leisure. Obviously a few tracks, so you can't go to every talk right away,"
    },
    {
      "Time_Start": 190.08,
      "Time_End": 195.28,
      "Text": " but they'll be up for a while on the conference site, and then on YouTube later. So we hope"
    },
    {
      "Time_Start": 195.92000000000002,
      "Time_End": 203.20000000000002,
      "Text": " everyone enjoys it. So a little bit about this talk outside of this conference. There's a good"
    },
    {
      "Time_Start": 203.20000000000002,
      "Time_End": 208.56,
      "Text": " chance you haven't seen me speak before. I'm Dave McGuire. I'm the CEO of Spectro-Obs, but"
    },
    {
      "Time_Start": 209.60000000000002,
      "Time_End": 215.12,
      "Text": " kind of like, I don't know, one of those like old warriors that just kind of sit around and talk"
    },
    {
      "Time_Start": 215.12,
      "Time_End": 219.76000000000002,
      "Text": " about like their glorious adventures in the past. That's pretty much where I'm at now. I'm not"
    },
    {
      "Time_Start": 220.0,
      "Time_End": 224.48,
      "Text": " going to tell you when I was last technically relevant. So you don't necessarily see me talk a"
    },
    {
      "Time_Start": 224.48,
      "Time_End": 230.72,
      "Text": " lot because we as a company, we really try to like let the work sort of speak for itself, right? And"
    },
    {
      "Time_Start": 234.0,
      "Time_End": 237.12,
      "Text": " not that I do a lot of work out there, so you probably wouldn't see me very often,"
    },
    {
      "Time_Start": 237.76,
      "Time_End": 243.2,
      "Text": " but we're putting this schedule together, coming up with what we wanted to talk about,"
    },
    {
      "Time_Start": 243.2,
      "Time_End": 246.32,
      "Text": " and our team was like, well, we need to do a keynote because the conference is due. And I was"
    },
    {
      "Time_Start": 246.32,
      "Time_End": 250.64,
      "Text": " like, that's a great idea. We should totally do a keynote. I'm like, well, yeah, you should do the"
    },
    {
      "Time_Start": 250.64,
      "Time_End": 256.24,
      "Text": " keynote. Oh, what the heck am I going to talk about? They go, you should do it. I'm like,"
    },
    {
      "Time_Start": 256.24,
      "Time_End": 261.44,
      "Text": " maybe we have somebody else do it. Nope, it's going to be you. All right. So sit down and think,"
    },
    {
      "Time_Start": 261.44,
      "Time_End": 265.28,
      "Text": " what can I have to say that's sort of interesting? One of the things that the"
    },
    {
      "Time_Start": 267.03999999999996,
      "Time_End": 271.68,
      "Text": " pandemic that was kind of, not that it's been good by any means, but one of the things that"
    },
    {
      "Time_Start": 271.68,
      "Time_End": 275.92,
      "Text": " kind of lets you do, I don't know if it's good, lets you sit and kind of focus on this existential"
    },
    {
      "Time_Start": 276.88,
      "Time_End": 280.72,
      "Text": " reflection, right? Which is, you know, like, what are we doing? Where are we going?"
    },
    {
      "Time_Start": 281.68,
      "Time_End": 287.76,
      "Text": " What are we doing today? And why are we doing it? And where do we come from? Because you remember"
    },
    {
      "Time_Start": 287.76,
      "Time_End": 293.28000000000003,
      "Text": " sort of what the normal world was like. And realize we hadn't really ever done that for"
    },
    {
      "Time_Start": 293.28000000000003,
      "Time_End": 299.2,
      "Text": " Spectrum, right? We never really sat and talked about, you know, what drives us, what motivates"
    },
    {
      "Time_Start": 299.2,
      "Time_End": 304.0,
      "Text": " us, those kinds of things. How do we see ourselves in the community? So I thought that might be"
    },
    {
      "Time_Start": 304.0,
      "Time_End": 310.0,
      "Text": " something, this could be a good chance to sort of do that in this format. I think it was this"
    },
    {
      "Time_Start": 310.0,
      "Time_End": 315.84,
      "Text": " clever title. I thought it was clever. Obviously called, How Did Ghosts Grow Up? I was immediately"
    },
    {
      "Time_Start": 315.84,
      "Time_End": 320.56,
      "Text": " reminded by our team that that's an oxymoron, because obviously ghosts don't grow up. I still"
    },
    {
      "Time_Start": 320.56,
      "Time_End": 325.68,
      "Text": " thought it was clever, so I kept it. But thinking about it, I actually had to go like develop my"
    },
    {
      "Time_Start": 325.68,
      "Time_End": 330.64,
      "Text": " content after that. And thinking about it, you're kind of like, well, it's true, ghosts don't grow up."
    },
    {
      "Time_Start": 330.64,
      "Time_End": 337.12,
      "Text": " Honestly, you know, we're obviously playing off of like the Spectrops, you know, name for how"
    },
    {
      "Time_Start": 337.12,
      "Time_End": 341.28000000000003,
      "Text": " ghosts grow up. But like, companies don't grow up either, right? A company is a thing that exists."
    },
    {
      "Time_Start": 342.16,
      "Time_End": 348.64,
      "Text": " So obviously our company isn't going to grow up, but people do. I grow up, and our folks do,"
    },
    {
      "Time_Start": 348.64,
      "Time_End": 354.24,
      "Text": " and people that join us bring new perspectives in. But also if you think about it, our community is"
    },
    {
      "Time_Start": 354.24,
      "Time_End": 359.36,
      "Text": " really growing up together as well. We're a very young community in general. Let me say less than"
    },
    {
      "Time_Start": 359.36,
      "Time_End": 366.16,
      "Text": " really effectively 30 years old. And if you look back at our history, we've made a ton of mistakes."
    },
    {
      "Time_Start": 367.04,
      "Time_End": 373.84000000000003,
      "Text": " We've had some great victories, like you think. Our perspective has often changed, just like,"
    },
    {
      "Time_Start": 373.84000000000003,
      "Time_End": 381.52,
      "Text": " you know, a group of folks growing up. And so, you know, kind of from that, maybe what this"
    },
    {
      "Time_Start": 381.52,
      "Time_End": 386.32,
      "Text": " talk is about is maybe more of a story, right? It's a story about how we're growing up, how we,"
    },
    {
      "Time_Start": 386.32,
      "Time_End": 391.28,
      "Text": " Spectrops, are growing up. I mean, I've grown up some, and how our community has sort of grown up"
    },
    {
      "Time_Start": 391.28,
      "Time_End": 398.15999999999997,
      "Text": " as well, and how we see Spectrops sort of fitting into that picture of, you know, where maybe we"
    },
    {
      "Time_Start": 398.15999999999997,
      "Time_End": 406.64,
      "Text": " want to go. And so, you know, from an industry perspective, don't get me wrong, I'm a philosopher."
    },
    {
      "Time_Start": 407.59999999999997,
      "Time_End": 413.84,
      "Text": " Nobody would ever certainly accuse me of that, nor would I characterize my views or our views"
    },
    {
      "Time_Start": 413.84,
      "Time_End": 418.0,
      "Text": " as sort of what's the entire industry. They only give you our perspective, give you my perspective."
    },
    {
      "Time_Start": 418.64,
      "Time_End": 422.96,
      "Text": " I think it's even kind of dangerous a little bit to try to put a box around what our industry,"
    },
    {
      "Time_Start": 422.96,
      "Time_End": 429.76,
      "Text": " our community is, because that's often somewhat up for debate. So I'm not going to try to do that."
    },
    {
      "Time_Start": 429.76,
      "Time_End": 435.44,
      "Text": " I'll be a little bit more vague. But, you know, if you think about it, spent some time ruminating"
    },
    {
      "Time_Start": 435.52,
      "Time_End": 444.4,
      "Text": " kind of on what are we doing? And, you know, where does our industry exist? You think,"
    },
    {
      "Time_Start": 444.4,
      "Time_End": 448.88,
      "Text": " you would come to realize that, like, we exist in this very unique community, right? This very"
    },
    {
      "Time_Start": 448.88,
      "Time_End": 455.28,
      "Text": " unique industry, because we sort of exist in this constant state of, like, asymmetrical warfare,"
    },
    {
      "Time_Start": 455.28,
      "Time_End": 464.08,
      "Text": " really, in that, you know, we're constantly dealing with attacks and defense, and how do"
    },
    {
      "Time_Start": 464.08,
      "Time_End": 469.52,
      "Text": " we deal with these threats that are sort of actively attacking us on a regular basis?"
    },
    {
      "Time_Start": 470.8,
      "Time_End": 476.88,
      "Text": " And kind of realize that, like, really, for us, everyone is in the fight. That's another thing"
    },
    {
      "Time_Start": 476.88,
      "Time_End": 483.2,
      "Text": " unique for situations that we have corporations and we're trying to defend organizations that"
    },
    {
      "Time_Start": 483.2,
      "Time_End": 489.36,
      "Text": " are really looking from a defense perspective. But we also have nation states involved. We have"
    },
    {
      "Time_Start": 489.36,
      "Time_End": 496.32,
      "Text": " criminal organizations. We have all kinds of, obviously, groups that are sort of involved in"
    },
    {
      "Time_Start": 496.32,
      "Time_End": 504.72,
      "Text": " this fight and tangentially a part of our community in some respects. Also that, like,"
    },
    {
      "Time_Start": 504.72,
      "Time_End": 509.76,
      "Text": " our victories in our young sort of lives have been really, really fleeting. Think about it."
    },
    {
      "Time_Start": 510.64,
      "Time_End": 516.8000000000001,
      "Text": " You know, we may solve a problem. We may, you know, we may feel like we made two steps forward"
    },
    {
      "Time_Start": 516.8,
      "Time_End": 525.04,
      "Text": " in something, but oftentimes it only lasts for a little while, right? And, yeah, new attacks come"
    },
    {
      "Time_Start": 525.04,
      "Time_End": 532.0,
      "Text": " out. New methods of operations come out. This constant back and forth that we're in. I think"
    },
    {
      "Time_Start": 532.0,
      "Time_End": 537.12,
      "Text": " one of the most unique things about us is that, like, how exactly do we define what the good guys"
    },
    {
      "Time_Start": 537.12,
      "Time_End": 542.64,
      "Text": " and the bad guys are? I mean, at the end of the day, it really actually, for us, depends on"
    },
    {
      "Time_Start": 542.64,
      "Time_End": 549.52,
      "Text": " perspective. And so, like, your country, another country, our country, right? And then also"
    },
    {
      "Time_Start": 550.64,
      "Time_End": 554.88,
      "Text": " on a point in time. That's kind of interesting about us and the, like, significant component"
    },
    {
      "Time_Start": 554.88,
      "Time_End": 560.88,
      "Text": " of the industry that maybe at one point in time would not have been considered the good guys,"
    },
    {
      "Time_Start": 560.88,
      "Time_End": 566.24,
      "Text": " right? But that's sometimes a valuable perspective in us, and I don't think you see that too much in"
    },
    {
      "Time_Start": 566.24,
      "Time_End": 572.24,
      "Text": " other industries. Like I said, we're also really comparatively young and uninformed. I've been"
    },
    {
      "Time_Start": 572.24,
      "Time_End": 576.8,
      "Text": " doing this for 19 years, and that makes me basically ancient since I effectively joined"
    },
    {
      "Time_Start": 576.8,
      "Time_End": 584.64,
      "Text": " this industry. But really, even in that time, you know, we've grown so large, like, it's not"
    },
    {
      "Time_Start": 584.64,
      "Time_End": 593.12,
      "Text": " recognizable what it was, you know, 19 years ago for me. And not recognizable from the number,"
    },
    {
      "Time_Start": 593.12,
      "Time_End": 597.6,
      "Text": " the size that we've grown to, but the way that we're operating. And so, in some respects,"
    },
    {
      "Time_Start": 597.6,
      "Time_End": 603.6,
      "Text": " we're in this form where we're really still forming what we're going to be, you know,"
    },
    {
      "Time_Start": 603.6,
      "Time_End": 608.08,
      "Text": " when we grow up, kind of. What are our grandkids going to be doing in this industry? And so,"
    },
    {
      "Time_Start": 608.72,
      "Time_End": 613.84,
      "Text": " we're in a sort of, like, dynamic time that, in a lot of respects, is exciting and also frustrating,"
    },
    {
      "Time_Start": 613.84,
      "Time_End": 621.6800000000001,
      "Text": " obviously. I'm probably being a little bit nostalgic here, thinking back to my much younger"
    },
    {
      "Time_Start": 621.6800000000001,
      "Time_End": 628.48,
      "Text": " self, when, you know, and saying that, like, times are simpler. The problem sets that we"
    },
    {
      "Time_Start": 628.48,
      "Time_End": 635.6,
      "Text": " were dealing with was simpler. And in a lot of respects, that's true. But what strikes me the"
    },
    {
      "Time_Start": 635.6,
      "Time_End": 641.44,
      "Text": " most, kind of, is that, you know, my younger self, is that you sort of, or you felt you knew"
    },
    {
      "Time_Start": 641.44,
      "Time_End": 646.0000000000001,
      "Text": " what your job was, or you felt you knew that the mission, you're trying to make the world a safer"
    },
    {
      "Time_Start": 646.0,
      "Time_End": 651.2,
      "Text": " place. At the end of the day, I'll have all kinds of other motivations for what's going on."
    },
    {
      "Time_Start": 651.2,
      "Time_End": 655.2,
      "Text": " There was a sense, sort of, that, like, we were going to solve problems. It was going to get"
    },
    {
      "Time_Start": 655.2,
      "Time_End": 662.4,
      "Text": " better. If you sort of look back at, you know, how things have gone over those number of years,"
    },
    {
      "Time_Start": 664.0,
      "Time_End": 669.76,
      "Text": " you can really come to see that, I think, like, oftentimes, we're just reacting, right? We're"
    },
    {
      "Time_Start": 670.3199999999999,
      "Time_End": 676.88,
      "Text": " like building the plane as we're flying it. And that makes us, you know, it makes us very"
    },
    {
      "Time_Start": 676.88,
      "Time_End": 682.72,
      "Text": " reactionary. It also makes it hard to say, what was the vision? Like, well, a vision that depended"
    },
    {
      "Time_Start": 682.72,
      "Time_End": 687.04,
      "Text": " on what was going on at that time. Concepts that, you know, we've been lucky to sort of, like,"
    },
    {
      "Time_Start": 687.04,
      "Time_End": 692.8,
      "Text": " ride the wave on, you know, with spectrops, like red teaming and hunting. You know, these military"
    },
    {
      "Time_Start": 692.8,
      "Time_End": 699.28,
      "Text": " concepts that sort of migrated into the civilian space, because of the type of asymmetric warfare"
    },
    {
      "Time_Start": 699.28,
      "Time_End": 705.28,
      "Text": " that we dealt with, you know, those kind of migrated along the way. It wasn't like 15 years"
    },
    {
      "Time_Start": 705.28,
      "Time_End": 711.92,
      "Text": " ago, we knew that these components were going to be big, or big components of what we as an"
    },
    {
      "Time_Start": 711.92,
      "Time_End": 718.48,
      "Text": " industry did. I think that's also made it really hard to, you know, that reactionary sort of"
    },
    {
      "Time_Start": 718.48,
      "Time_End": 723.28,
      "Text": " mentality we've been into. It's been really hard to see, like, three steps out, right? Okay, if we"
    },
    {
      "Time_Start": 723.28,
      "Time_End": 726.4,
      "Text": " do this thing, what's going to be the reaction to it? If we release this, what's going to be"
    },
    {
      "Time_Start": 726.4,
      "Time_End": 731.1999999999999,
      "Text": " the reaction to it? How's that going to affect things? We want to do, you know, we're doing"
    },
    {
      "Time_Start": 731.1999999999999,
      "Time_End": 737.28,
      "Text": " something to make, to help to make this thing better. But in the end of the day, two, three"
    },
    {
      "Time_Start": 737.28,
      "Time_End": 743.76,
      "Text": " steps down the line, you know, it could be used against you, right? It's really hard to see when"
    },
    {
      "Time_Start": 743.76,
      "Time_End": 747.76,
      "Text": " really we're just reacting around us. And, you know, you can't see three steps ahead when you"
    },
    {
      "Time_Start": 747.76,
      "Time_End": 754.72,
      "Text": " can barely see your own feet in the fog. And so, you know, this future implications of what we're"
    },
    {
      "Time_Start": 754.72,
      "Time_End": 760.88,
      "Text": " doing today can be really hard to see. When I say doing today, I'm talking about services that"
    },
    {
      "Time_Start": 760.88,
      "Time_End": 767.36,
      "Text": " you're offering, products you're building, open source tools that you're releasing, right? It can"
    },
    {
      "Time_Start": 767.36,
      "Time_End": 772.0,
      "Text": " be really hard to see where that goes somewhere down the road. And the stakes get a lot higher."
    },
    {
      "Time_Start": 772.0,
      "Time_End": 778.08,
      "Text": " The industry is bigger. There's a lot more money involved. And a lot more opinions, diverse"
    },
    {
      "Time_Start": 778.08,
      "Time_End": 783.36,
      "Text": " opinions about how you should operate. And so that can kind of lead you to a little bit of a"
    },
    {
      "Time_Start": 783.36,
      "Time_End": 788.96,
      "Text": " paralysis sometimes of, like, I don't know what the right thing to do is. If I do this thing that"
    },
    {
      "Time_Start": 788.96,
      "Time_End": 792.96,
      "Text": " I think it'll make better, how many different ways might that affect things? And the answer is"
    },
    {
      "Time_Start": 792.96,
      "Time_End": 798.0,
      "Text": " oftentimes we don't know. But because we don't know, and the stakes are higher, makes you kind of"
    },
    {
      "Time_Start": 798.0,
      "Time_End": 805.52,
      "Text": " worry about what you're going to do. If you, you know, when I look at SpecterOps, we're a little"
    },
    {
      "Time_Start": 805.52,
      "Time_End": 811.12,
      "Text": " less than four years old at this point. Obviously a new entrant sort of in the field,"
    },
    {
      "Time_Start": 811.76,
      "Time_End": 818.24,
      "Text": " comparatively to a lot of organizations out there. What's really funny from our company journey"
    },
    {
      "Time_Start": 818.24,
      "Time_End": 824.16,
      "Text": " is that it's a microcosm sort of of the industry. You know, when we founded SpecterOps, I don't"
    },
    {
      "Time_Start": 824.16,
      "Time_End": 830.24,
      "Text": " think anybody would have accused us of some, like, super grand vision. Really the vision for us was"
    },
    {
      "Time_Start": 830.24,
      "Time_End": 837.52,
      "Text": " very inward focused. You know, we primarily were just focusing on ourselves and, like, being a place"
    },
    {
      "Time_Start": 837.52,
      "Time_End": 846.88,
      "Text": " that we wanted to work, being a place that did a few things well, and let our voice out there,"
    },
    {
      "Time_Start": 847.52,
      "Time_End": 852.4,
      "Text": " how we speak to sort of the community and the industry, be through our work, or let it speak"
    },
    {
      "Time_Start": 852.4,
      "Time_End": 857.76,
      "Text": " for itself. And be a place that people could be, you know, we felt we could be proud of the work"
    },
    {
      "Time_Start": 857.76,
      "Time_End": 862.48,
      "Text": " we were doing, but also feel rewarded for it, right? So very focused on ourselves. If there"
    },
    {
      "Time_Start": 862.48,
      "Time_End": 869.52,
      "Text": " was a vision, which maybe I'm being a little bit generous, but if there was a vision, you know, we"
    },
    {
      "Time_Start": 869.52,
      "Time_End": 873.6,
      "Text": " we felt fundamentally, and still do today, and you'll hear this quite a bit, but we felt"
    },
    {
      "Time_Start": 873.6,
      "Time_End": 881.36,
      "Text": " fundamentally that, you know, information sharing needs to be more open in our community. We need"
    },
    {
      "Time_Start": 881.36,
      "Time_End": 886.32,
      "Text": " to be more open about how we're building off of each other. Something that we were passionate"
    },
    {
      "Time_Start": 886.32,
      "Time_End": 893.2,
      "Text": " about beforehand, and when you run the company, right, you get to sort of lead by example, and try"
    },
    {
      "Time_Start": 893.2,
      "Time_End": 900.88,
      "Text": " to push that. Another thing maybe, again, being generous to some degree, maybe in our heart we"
    },
    {
      "Time_Start": 900.88,
      "Time_End": 907.2800000000001,
      "Text": " were sort of educators, you know, come from backgrounds of doing hundreds of engagements,"
    },
    {
      "Time_Start": 908.1600000000001,
      "Time_End": 916.08,
      "Text": " and I think anybody can relate to this kind of hamster wheel of, you know, constantly doing a"
    },
    {
      "Time_Start": 916.08,
      "Time_End": 921.44,
      "Text": " service, and coming back the next year, and the same thing, and really wondering, like,"
    },
    {
      "Time_Start": 921.44,
      "Time_End": 930.5600000000001,
      "Text": " what kind of impact are you having out there? And for us, for our passion, kind of was driven more"
    },
    {
      "Time_Start": 931.12,
      "Time_End": 937.36,
      "Text": " by, you know, educating, and getting satisfaction from, like, spreading that knowledge"
    },
    {
      "Time_Start": 937.36,
      "Time_End": 942.96,
      "Text": " out, and teaching, and building internal capabilities, so that they could do that. They could scale much"
    },
    {
      "Time_Start": 942.96,
      "Time_End": 950.1600000000001,
      "Text": " better than we can, maybe, you know, provide, you know, actually really push capabilities forward."
    },
    {
      "Time_Start": 951.44,
      "Time_End": 955.36,
      "Text": " I wouldn't, I would never accuse those necessarily of being strategies,"
    },
    {
      "Time_Start": 955.36,
      "Time_End": 961.52,
      "Text": " but maybe our ethos beyond just being someplace that we kind of wanted to work, you can tell"
    },
    {
      "Time_Start": 962.88,
      "Time_End": 970.32,
      "Text": " it's not like there's a grand plan in there at all. And I think, you know, I know this is"
    },
    {
      "Time_Start": 970.32,
      "Time_End": 975.2,
      "Text": " speaking for me, but I think anybody who's gone out and been a part of building a company,"
    },
    {
      "Time_Start": 977.0400000000001,
      "Time_End": 983.0400000000001,
      "Text": " one of the things you realize early on, and that continues probably for forever, is that building"
    },
    {
      "Time_Start": 983.0400000000001,
      "Time_End": 989.7600000000001,
      "Text": " a company is really hard. Like, it just, there's, it's incredibly difficult. I hope I never found"
    },
    {
      "Time_Start": 989.7600000000001,
      "Time_End": 995.0400000000001,
      "Text": " another company. And you're often sort of doing that same thing I was talking about from the"
    },
    {
      "Time_Start": 995.0400000000001,
      "Time_End": 1000.8000000000001,
      "Text": " industry, is that you're reacting. You're reacting to this much more, you know, external"
    },
    {
      "Time_Start": 1000.8000000000001,
      "Time_End": 1006.4000000000001,
      "Text": " sort of opportunities or challenges, and you get wrapped up in this day-to-day of just reacting."
    },
    {
      "Time_Start": 1007.2,
      "Time_End": 1011.44,
      "Text": " So, you kind of sit yourself and, you know, look at what have we been doing for the last year, and"
    },
    {
      "Time_Start": 1011.44,
      "Time_End": 1017.2,
      "Text": " if you have a strategic plan or not, that's like, well, I mean, I don't know, didn't really hit it."
    },
    {
      "Time_Start": 1017.2,
      "Time_End": 1023.7600000000001,
      "Text": " I mean, but we did all these things. And, you know, I think we were really fortunate for ourselves,"
    },
    {
      "Time_Start": 1023.76,
      "Time_End": 1029.52,
      "Text": " and probably lots in the industry felt very similar, and that it was the opportunities,"
    },
    {
      "Time_Start": 1029.52,
      "Time_End": 1033.36,
      "Text": " right, it was the former things that really were driving us a lot. So, it wasn't necessarily all"
    },
    {
      "Time_Start": 1033.36,
      "Time_End": 1037.28,
      "Text": " the challenges that we're facing. It's that, you know, we're in this growing industry,"
    },
    {
      "Time_Start": 1038.48,
      "Time_End": 1048.8,
      "Text": " and reminds me of a story I once heard from somebody who built and sold a company, a tech"
    },
    {
      "Time_Start": 1048.8,
      "Time_End": 1055.04,
      "Text": " company, in the late 90s. And kind of the point of the whole story was him saying, like, don't"
    },
    {
      "Time_Start": 1055.04,
      "Time_End": 1060.8799999999999,
      "Text": " think I'm all that smart, even though I pulled a company for a bunch of money, because in the"
    },
    {
      "Time_Start": 1060.8799999999999,
      "Time_End": 1066.0,
      "Text": " late 90s in the tech industry, you basically had to try not to make money. So, you know,"
    },
    {
      "Time_Start": 1066.0,
      "Time_End": 1070.32,
      "Text": " it was just lucky. In a lot of respects, I think that's true for cybersecurity as well,"
    },
    {
      "Time_Start": 1070.32,
      "Time_End": 1075.76,
      "Text": " but it has been for some time, not quite so much in 2020. But, you know, you're driven by this"
    },
    {
      "Time_Start": 1075.76,
      "Time_End": 1081.04,
      "Text": " external growing industry. You might say, like, oh, we grew 300% this year. Are we doing great?"
    },
    {
      "Time_Start": 1081.04,
      "Time_End": 1085.12,
      "Text": " Well, everybody's growing 300% because of the industry. It's not necessarily because you're"
    },
    {
      "Time_Start": 1085.12,
      "Time_End": 1093.12,
      "Text": " doing anything all that great. But it's really easy to lose kind of the forest and the trees,"
    },
    {
      "Time_Start": 1093.12,
      "Time_End": 1099.04,
      "Text": " right? You know, you have these overarching goals you want to hit, but then it's just the day-to-day"
    },
    {
      "Time_Start": 1099.52,
      "Time_End": 1106.48,
      "Text": " that catches up. We also, I think a lot of folks can relate, but we made plenty of mistakes along"
    },
    {
      "Time_Start": 1106.48,
      "Time_End": 1110.96,
      "Text": " the way as we were essentially doing everything for the first time. You find this sort of"
    },
    {
      "Time_Start": 1110.96,
      "Time_End": 1116.56,
      "Text": " accumulates in these, like, shaky supports sort of as you build the foundation, right? And so,"
    },
    {
      "Time_Start": 1116.56,
      "Time_End": 1122.08,
      "Text": " like, you got to go back and clean that up, which adds to the also we're driven by this"
    },
    {
      "Time_Start": 1122.08,
      "Time_End": 1126.48,
      "Text": " day-to-day opportunities. And so, you can sit here three and a half years later, kind of like I was,"
    },
    {
      "Time_Start": 1126.56,
      "Time_End": 1131.52,
      "Text": " and kind of say, how do we push forward to that? Like, we had these sort of dreams, at least,"
    },
    {
      "Time_Start": 1131.52,
      "Time_End": 1138.0,
      "Text": " when we started, and we certainly have tried to pursue them. But, you know, how well have we"
    },
    {
      "Time_Start": 1138.0,
      "Time_End": 1144.56,
      "Text": " really done at the end of the day? And you can look at yourself critically that way. But I think"
    },
    {
      "Time_Start": 1144.56,
      "Time_End": 1153.28,
      "Text": " we did learn a lot. And I would not say that we did everything wrong by any means. But I think"
    },
    {
      "Time_Start": 1153.28,
      "Time_End": 1158.0,
      "Text": " sometimes you look back and say, what have we not been good at? Oftentimes, for us, it's been"
    },
    {
      "Time_Start": 1158.0,
      "Time_End": 1164.6399999999999,
      "Text": " messaging. It's probably mostly been on me. But, you know, messaging and being out there and kind"
    },
    {
      "Time_Start": 1164.6399999999999,
      "Time_End": 1171.84,
      "Text": " of letting people know what you're doing and why are you doing it. You know, I don't think we've"
    },
    {
      "Time_Start": 1172.6399999999999,
      "Time_End": 1177.68,
      "Text": " often sort of been very quiet in that regard as we've gone along in our journey."
    },
    {
      "Time_Start": 1178.64,
      "Time_End": 1185.8400000000001,
      "Text": " And what strikes me, sort of, when I look at this industry I've been a part of for so long,"
    },
    {
      "Time_Start": 1188.5600000000002,
      "Time_End": 1197.04,
      "Text": " if my younger self was to see us today, I think that person would be really disappointed."
    },
    {
      "Time_Start": 1197.04,
      "Time_End": 1204.5600000000002,
      "Text": " Hopefully not at me, but, or at me, but sort of, like, how far did we come?"
    },
    {
      "Time_Start": 1205.2,
      "Time_End": 1212.6399999999999,
      "Text": " And, you know, if you look at us, every year, like, more and more money has been poured into"
    },
    {
      "Time_Start": 1212.6399999999999,
      "Time_End": 1219.9199999999998,
      "Text": " cybersecurity. Our industry has grown. Investments have been made in, you know, company, in the"
    },
    {
      "Time_Start": 1219.9199999999998,
      "Time_End": 1227.9199999999998,
      "Text": " cybersecurity practices and companies all over the place. But fair or not, or really, on us or not,"
    },
    {
      "Time_Start": 1228.72,
      "Time_End": 1234.0,
      "Text": " I have to say that I don't think we would argue that the world is a safer place, you know, after"
    },
    {
      "Time_Start": 1234.0,
      "Time_End": 1240.0,
      "Text": " the time that we've been doing this. People are more and more dependent on the technology and the"
    },
    {
      "Time_Start": 1240.0,
      "Time_End": 1247.1200000000001,
      "Text": " platforms that we're supposed to protect. And I think if we were successful, it would just,"
    },
    {
      "Time_Start": 1247.1200000000001,
      "Time_End": 1250.48,
      "Text": " you'd never hear from us, right? It would work. It wouldn't be something that you worry about,"
    },
    {
      "Time_Start": 1251.52,
      "Time_End": 1254.0,
      "Text": " you know, outside of the industry that we work in."
    },
    {
      "Time_Start": 1254.96,
      "Time_End": 1261.36,
      "Text": " But that's not the case, right? Instead of working behind the scenes, actually, our struggles,"
    },
    {
      "Time_Start": 1261.36,
      "Time_End": 1267.6,
      "Text": " our defeats, our victories, even, are constantly out in the open and often really ill understood"
    },
    {
      "Time_Start": 1267.6,
      "Time_End": 1271.6,
      "Text": " by, you know, because they're fairly complex. And if you think of the victories, for example,"
    },
    {
      "Time_Start": 1271.6,
      "Time_End": 1277.52,
      "Text": " that do make it out in the open, and we're going to equate that to anything else, you kind of feel"
    },
    {
      "Time_Start": 1277.52,
      "Time_End": 1282.32,
      "Text": " sad for them. Like the victory was, you know, the fact that we were able to do it, you know,"
    },
    {
      "Time_Start": 1282.6399999999999,
      "Time_End": 1289.52,
      "Text": " like the victory was, you didn't have this, you know, system, or this, you know, collection of"
    },
    {
      "Time_Start": 1289.52,
      "Time_End": 1295.28,
      "Text": " systems broken into that were critical, which is great. It's wonderful. But like, it's like"
    },
    {
      "Time_Start": 1295.28,
      "Time_End": 1298.96,
      "Text": " the equivalent of like, you know, you're reading a newspaper, like we hold, we held the fort."
    },
    {
      "Time_Start": 1300.1599999999999,
      "Time_End": 1304.3999999999999,
      "Text": " Most of the time we don't, but we did this time. That's actually kind of sad, right?"
    },
    {
      "Time_Start": 1306.6399999999999,
      "Time_End": 1308.32,
      "Text": " More than anything else, I think that there's this,"
    },
    {
      "Time_Start": 1309.28,
      "Time_End": 1313.6,
      "Text": " there's even more uncertainty. And if the investments we're making, and we're making a lot,"
    },
    {
      "Time_Start": 1315.28,
      "Time_End": 1321.04,
      "Text": " if what we're doing is effective, right? Is it, is, is this money that we're putting in,"
    },
    {
      "Time_Start": 1321.04,
      "Time_End": 1325.04,
      "Text": " and, you know, the people that were working here and whatever, like, are we effective? Are we"
    },
    {
      "Time_Start": 1325.04,
      "Time_End": 1333.04,
      "Text": " making it better? And in my experience, the answer is, well, I don't know, right? I mean,"
    },
    {
      "Time_Start": 1333.04,
      "Time_End": 1338.72,
      "Text": " we can have all kinds of metrics out there, but fundamentally, when it, you know, comes down to"
    },
    {
      "Time_Start": 1338.72,
      "Time_End": 1345.84,
      "Text": " the end, are we more effective? Do we feel more effective at responding to breaches? Do we have"
    },
    {
      "Time_Start": 1345.84,
      "Time_End": 1352.1599999999999,
      "Text": " confidence in ourselves, in our defenses? And I think the answer is oftentimes, no, right?"
    },
    {
      "Time_Start": 1354.72,
      "Time_End": 1360.96,
      "Text": " And so, you know, that's not necessarily a terrible thing,"
    },
    {
      "Time_Start": 1361.68,
      "Time_End": 1366.96,
      "Text": " but it's almost one of those things that you might, we might want to stop and say, okay, well,"
    },
    {
      "Time_Start": 1366.96,
      "Time_End": 1372.08,
      "Text": " how are we going to effectively utilize pretty, pretty massive resources that are deployed out"
    },
    {
      "Time_Start": 1372.08,
      "Time_End": 1381.6000000000001,
      "Text": " here for us? But if you look at our community, you know, our community, it really does face"
    },
    {
      "Time_Start": 1381.6000000000001,
      "Time_End": 1387.76,
      "Text": " these incredible challenges. You think about it, you have these massive investments that are being"
    },
    {
      "Time_Start": 1387.84,
      "Time_End": 1394.32,
      "Text": " made by our adversaries. And again, adversaries can be somewhat subjective, but, you know,"
    },
    {
      "Time_Start": 1394.32,
      "Time_End": 1403.12,
      "Text": " massive investments that are being made and, you know, to defeat us, to defeat effectively what"
    },
    {
      "Time_Start": 1403.12,
      "Time_End": 1410.0,
      "Text": " we as a public community are trying to do. And like I said, who's the good guys and who's the"
    },
    {
      "Time_Start": 1410.0,
      "Time_End": 1416.48,
      "Text": " bad guys? Somewhat up for debate. And so, we often have to operate in sort of like,"
    },
    {
      "Time_Start": 1416.48,
      "Time_End": 1420.32,
      "Text": " infiltrators are somewhat in our midst, right? Like the things that we're doing could be used"
    },
    {
      "Time_Start": 1420.32,
      "Time_End": 1427.2,
      "Text": " against us. And I think that as with any group of people that are sort of, you know, under siege,"
    },
    {
      "Time_Start": 1428.56,
      "Time_End": 1435.28,
      "Text": " develop sort of a bunker mentality in a lot of respects, or, you know, like exiles, you know,"
    },
    {
      "Time_Start": 1435.28,
      "Time_End": 1442.24,
      "Text": " war zone, and that we're under this incredible pressure a lot. But instead of unifying,"
    },
    {
      "Time_Start": 1442.24,
      "Time_End": 1452.16,
      "Text": " oftentimes, we won't break into, you know, warring factions, you know, fighting each other,"
    },
    {
      "Time_Start": 1452.96,
      "Time_End": 1456.08,
      "Text": " and sort of hoarding our scarce resources, right? Hoarding the fact that like,"
    },
    {
      "Time_Start": 1456.8,
      "Time_End": 1461.68,
      "Text": " each of us individually aren't really able to make that much of an investment compared to,"
    },
    {
      "Time_Start": 1461.68,
      "Time_End": 1469.6,
      "Text": " you know, nation state, along those lines. But we also hoard them to a large extent, because we"
    },
    {
      "Time_Start": 1470.5600000000002,
      "Time_End": 1476.64,
      "Text": " look like a source of competitive advantage or whatever, which just makes us collectively,"
    },
    {
      "Time_Start": 1478.3200000000002,
      "Time_End": 1484.88,
      "Text": " I think, less capable. On the plus side, like I said, our industry is incredibly dynamic."
    },
    {
      "Time_Start": 1486.0000000000002,
      "Time_End": 1489.1200000000001,
      "Text": " And that's a really exciting thing for us to be in. I mean, even putting bounds around it,"
    },
    {
      "Time_Start": 1489.1200000000001,
      "Time_End": 1495.8400000000001,
      "Text": " as I said, is difficult. But, you know, the potential is still out there. Even if we feel"
    },
    {
      "Time_Start": 1495.84,
      "Time_End": 1502.1599999999999,
      "Text": " a little bit cynical today, and wouldn't never want to characterize us as a bunch of failures,"
    },
    {
      "Time_Start": 1502.1599999999999,
      "Time_End": 1510.6399999999999,
      "Text": " by any means, but like, we do have this dynamic element to us. And we can be very,"
    },
    {
      "Time_Start": 1510.6399999999999,
      "Time_End": 1514.56,
      "Text": " very good at solving collective problems and sort of get our get our heads around it."
    },
    {
      "Time_Start": 1518.3999999999999,
      "Time_End": 1524.24,
      "Text": " You know, when we look at where we're going, as an industry, again, wouldn't call myself any kind"
    },
    {
      "Time_Start": 1524.24,
      "Time_End": 1530.88,
      "Text": " of philosopher, honestly, we make a lot better operators at Spectrops than prognosticators or"
    },
    {
      "Time_Start": 1530.88,
      "Time_End": 1537.2,
      "Text": " whatever. You know, there's lots of people out there with some very good opinions, people who"
    },
    {
      "Time_Start": 1537.2,
      "Time_End": 1543.92,
      "Text": " spend a lot of time and thought, they're trying to push the industry. And honestly, our perspective"
    },
    {
      "Time_Start": 1543.92,
      "Time_End": 1550.96,
      "Text": " is pretty inward focusing on things that we do. But some thoughts on where we feel"
    },
    {
      "Time_Start": 1551.68,
      "Time_End": 1556.48,
      "Text": " we'd like to see the industry go. And also where we'll try to push things."
    },
    {
      "Time_Start": 1557.2,
      "Time_End": 1566.64,
      "Text": " You know, right off the top, let's say, we feel very strongly in this concept,"
    },
    {
      "Time_Start": 1566.64,
      "Time_End": 1572.4,
      "Text": " you know, that our industry, and our companies, you know, have this sort of dual mission."
    },
    {
      "Time_Start": 1572.96,
      "Time_End": 1578.56,
      "Text": " And we sort of serve two masters. Because obviously, we're capitalists, and that's how"
    },
    {
      "Time_Start": 1578.56,
      "Time_End": 1585.76,
      "Text": " sort of the system works, whether you like it or not. But we also serve a public good."
    },
    {
      "Time_Start": 1586.6399999999999,
      "Time_End": 1592.08,
      "Text": " Right, we're not just there to make money, we're also there to try to provide a line of defense"
    },
    {
      "Time_Start": 1592.08,
      "Time_End": 1598.08,
      "Text": " at the end of the day. And, you know, that's not unique, necessarily. In fact, there's lots"
    },
    {
      "Time_Start": 1598.08,
      "Time_End": 1605.52,
      "Text": " of industries out there that, you know, that have these dual purposes, maybe best example would be"
    },
    {
      "Time_Start": 1605.52,
      "Time_End": 1612.16,
      "Text": " healthcare, again, not trying to take a stance in healthcare by any means, or whether that's"
    },
    {
      "Time_Start": 1612.16,
      "Time_End": 1616.32,
      "Text": " effective or not for the various systems out there. If you think about it fundamentally,"
    },
    {
      "Time_Start": 1616.32,
      "Time_End": 1623.44,
      "Text": " there's an understanding and a sharing that happens within that industry in that community,"
    },
    {
      "Time_Start": 1623.44,
      "Time_End": 1628.8799999999999,
      "Text": " you don't necessarily see in an industry like ours. If you think about it, for example,"
    },
    {
      "Time_Start": 1629.6000000000001,
      "Time_End": 1637.44,
      "Text": " if one hospital system develops a technique that, you know, a surgical technique, let's just say,"
    },
    {
      "Time_Start": 1637.44,
      "Time_End": 1645.68,
      "Text": " that saves lives, that will make people safer, they don't hoard that, they don't hold it close"
    },
    {
      "Time_Start": 1645.68,
      "Time_End": 1651.44,
      "Text": " to their chest and say, you know, well, that's an advantage for us that we keep people alive"
    },
    {
      "Time_Start": 1651.44,
      "Time_End": 1657.5200000000002,
      "Text": " better than you do. They share it out, right? So that others can emulate them. They don't share"
    },
    {
      "Time_Start": 1657.52,
      "Time_End": 1662.24,
      "Text": " everything, obviously. But in some aspects of the industry, you might say, you know,"
    },
    {
      "Time_Start": 1662.24,
      "Time_End": 1668.32,
      "Text": " are a lot more about profit or IP protections or whatnot than others. But even those, I think you"
    },
    {
      "Time_Start": 1668.32,
      "Time_End": 1673.84,
      "Text": " see a level of sharing that you often don't see at the corporate level for us. I wouldn't"
    },
    {
      "Time_Start": 1673.84,
      "Time_End": 1678.24,
      "Text": " characterize the community level necessarily as the same. I think we have a great community,"
    },
    {
      "Time_Start": 1678.96,
      "Time_End": 1681.28,
      "Text": " but the corporate participation in that could not be that great."
    },
    {
      "Time_Start": 1681.28,
      "Time_End": 1690.32,
      "Text": " I think there's a saying in the military, you train for the situations that you pray"
    },
    {
      "Time_Start": 1690.32,
      "Time_End": 1698.24,
      "Text": " you'll never face, right? This concept of readiness, that we need to be constantly"
    },
    {
      "Time_Start": 1698.24,
      "Time_End": 1701.92,
      "Text": " training and constantly getting ready for the thing we actually hope we never face."
    },
    {
      "Time_Start": 1702.48,
      "Time_End": 1711.44,
      "Text": " And we would say that that focus on readiness needs to be probably better out there in the"
    },
    {
      "Time_Start": 1711.44,
      "Time_End": 1716.3200000000002,
      "Text": " security, within security operations as well. Because honestly, it's the exact same thing."
    },
    {
      "Time_Start": 1716.3200000000002,
      "Time_End": 1720.96,
      "Text": " Think about it. Most of the situations that you're trying to protect against are the ones"
    },
    {
      "Time_Start": 1720.96,
      "Time_End": 1724.8000000000002,
      "Text": " or trying to be able to effectively react to are the ones you never actually want to face."
    },
    {
      "Time_Start": 1726.5600000000002,
      "Time_End": 1728.0800000000002,
      "Text": " But you still want to be effective at them."
    },
    {
      "Time_Start": 1732.5600000000002,
      "Time_End": 1738.8000000000002,
      "Text": " I think most importantly, though, something that's close for us is that we need to"
    },
    {
      "Time_Start": 1740.0,
      "Time_End": 1751.8400000000001,
      "Text": " remember that we're in the gates together and our enemies are outside those gates."
    },
    {
      "Time_Start": 1753.2,
      "Time_End": 1758.48,
      "Text": " Our enemies are outside the gates, not inside with us. This isn't about red versus blue."
    },
    {
      "Time_Start": 1758.48,
      "Time_End": 1764.96,
      "Text": " This isn't about your company or our company. This is about the collective thing we're trying"
    },
    {
      "Time_Start": 1764.96,
      "Time_End": 1769.84,
      "Text": " to do, the collective mission that we have. And maybe we do something that somebody else"
    },
    {
      "Time_Start": 1769.84,
      "Time_End": 1774.16,
      "Text": " doesn't like. Maybe we have an opinion that somebody doesn't like. Maybe we make a mistake"
    },
    {
      "Time_Start": 1774.16,
      "Time_End": 1782.48,
      "Text": " and we need help in addressing that and going forward in a better direction."
    },
    {
      "Time_Start": 1783.1200000000001,
      "Time_End": 1789.44,
      "Text": " But it needs to come from a position that we're all still in this together. We're all here to"
    },
    {
      "Time_Start": 1789.44,
      "Time_End": 1795.2,
      "Text": " help each other. And our enemies are not us. We're not a group of warring factions."
    },
    {
      "Time_Start": 1797.44,
      "Time_End": 1800.8,
      "Text": " I don't have much more to say on that. But for us, that's something that's very important."
    },
    {
      "Time_Start": 1800.8,
      "Time_End": 1805.6,
      "Text": " And you'll see from us is that that's not a side that we're going to try to take."
    },
    {
      "Time_Start": 1806.5600000000002,
      "Time_End": 1815.68,
      "Text": " When I look at SpectreOps today, ironically, I've found for myself, personally,"
    },
    {
      "Time_Start": 1815.68,
      "Time_End": 1821.5200000000002,
      "Text": " and as our company has grown, that we're more defined by our limitations than we were by our"
    },
    {
      "Time_Start": 1821.5200000000002,
      "Time_End": 1828.16,
      "Text": " ambitions. I don't mean that necessarily in a negative way, but you become much more aware of"
    },
    {
      "Time_Start": 1828.3200000000002,
      "Time_End": 1833.28,
      "Text": " what you can actually achieve versus the kind of grand dreams you might have."
    },
    {
      "Time_Start": 1833.28,
      "Time_End": 1838.3200000000002,
      "Text": " And we know that our company isn't going to change the world or change the industry."
    },
    {
      "Time_Start": 1838.3200000000002,
      "Time_End": 1846.16,
      "Text": " We're a small cog in a big system at the end of the day. It doesn't mean we're helpless."
    },
    {
      "Time_Start": 1846.16,
      "Time_End": 1850.0800000000002,
      "Text": " It just means that there are things that we can affect and things that we can't affect."
    },
    {
      "Time_Start": 1851.04,
      "Time_End": 1856.32,
      "Text": " We've done some things right, but we've also often fallen short of our own dreams."
    },
    {
      "Time_Start": 1858.08,
      "Time_End": 1867.04,
      "Text": " At our worst, we can become paralyzed with our inaction, worried about the negative perception"
    },
    {
      "Time_Start": 1867.04,
      "Time_End": 1870.3999999999999,
      "Text": " that our customers might have, the community might have of something we're doing,"
    },
    {
      "Time_Start": 1870.96,
      "Time_End": 1876.48,
      "Text": " and sit there and ruminate over and over and over and over and over and over and over and over."
    },
    {
      "Time_Start": 1876.88,
      "Time_End": 1882.72,
      "Text": " And sit there and ruminate over and over again on what the right answer might be."
    },
    {
      "Time_Start": 1885.1200000000001,
      "Time_End": 1888.64,
      "Text": " And then, until it doesn't really matter what the right answer is,"
    },
    {
      "Time_Start": 1888.64,
      "Time_End": 1890.56,
      "Text": " because you just didn't do anything and you moved on."
    },
    {
      "Time_Start": 1891.92,
      "Time_End": 1898.24,
      "Text": " I think when I look at us, at least from an engagement perspective,"
    },
    {
      "Time_Start": 1898.24,
      "Time_End": 1903.1200000000001,
      "Text": " that's probably one of our biggest failings, is falling short of where we wanted to be."
    },
    {
      "Time_Start": 1907.1200000000001,
      "Time_End": 1913.52,
      "Text": " But it's not negative. I don't want people to think that I sit here and think quite negatively"
    },
    {
      "Time_Start": 1913.52,
      "Time_End": 1918.8,
      "Text": " about our industry or company or anything else. I have great hope for our industry."
    },
    {
      "Time_Start": 1918.8,
      "Time_End": 1925.04,
      "Text": " I have great hope, obviously, for our company. And I'd like to say, where are we going to go?"
    },
    {
      "Time_Start": 1927.68,
      "Time_End": 1930.32,
      "Text": " What can you expect from us as you look to us in the future?"
    },
    {
      "Time_Start": 1931.6,
      "Time_End": 1935.28,
      "Text": " I won't say about some specific business or some tool we're going to release,"
    },
    {
      "Time_Start": 1935.28,
      "Time_End": 1942.8,
      "Text": " but more our philosophy. For us, we're going to be always conscious of our dual mission."
    },
    {
      "Time_Start": 1943.36,
      "Time_End": 1952.48,
      "Text": " Cognizant that we serve a public good, along with trying to also make payroll,"
    },
    {
      "Time_Start": 1952.48,
      "Time_End": 1957.2,
      "Text": " whatever else we're up to. And that means that we're not necessarily going to"
    },
    {
      "Time_Start": 1957.6000000000001,
      "Time_End": 1962.48,
      "Text": " every time make the decision that makes us the most money, right?"
    },
    {
      "Time_Start": 1962.48,
      "Time_End": 1967.28,
      "Text": " That we have two masters at the end of the day that we're going to be serving."
    },
    {
      "Time_Start": 1968.96,
      "Time_End": 1970.8,
      "Text": " And we encourage others to look at it that same way."
    },
    {
      "Time_Start": 1970.8,
      "Time_End": 1974.8,
      "Text": " Yeah, it doesn't mean we're not in competition, but it does mean that we understand what we"
    },
    {
      "Time_Start": 1977.92,
      "Time_End": 1982.72,
      "Text": " share and we don't share. And what collectively pushes us,"
    },
    {
      "Time_Start": 1983.04,
      "Time_End": 1988.0,
      "Text": " makes us collectively better. And we're not going to have all the answers."
    },
    {
      "Time_Start": 1988.0,
      "Time_End": 1991.92,
      "Text": " We don't have all the answers now, even to most of the questions we have."
    },
    {
      "Time_Start": 1991.92,
      "Time_End": 1998.48,
      "Text": " I'm sure we have a few of the answers, but we're going to be comfortable with that."
    },
    {
      "Time_Start": 1998.48,
      "Time_End": 2001.04,
      "Text": " The fact that we don't necessarily know where this goes."
    },
    {
      "Time_Start": 2002.88,
      "Time_End": 2008.32,
      "Text": " And we're not going to try to determine whatever that answer is before we decide to take action."
    },
    {
      "Time_Start": 2008.3999999999999,
      "Time_End": 2016.6399999999999,
      "Text": " What you can expect to see from us is this sort of continual focus on an educational mission,"
    },
    {
      "Time_Start": 2016.6399999999999,
      "Time_End": 2023.84,
      "Text": " that thing that makes us passionate and being open with information sharing, being maybe more"
    },
    {
      "Time_Start": 2023.84,
      "Time_End": 2030.08,
      "Text": " open today as we look at what have we been sharing or not as we've gone through our day-to-day"
    },
    {
      "Time_Start": 2030.08,
      "Time_End": 2038.24,
      "Text": " struggles and whatnot. I think, you know, we're going to have to figure out how we're going to"
    },
    {
      "Time_Start": 2038.96,
      "Time_End": 2044.56,
      "Text": " being, we're going to work on being more comfortable in our own skin, trying to lead by"
    },
    {
      "Time_Start": 2044.56,
      "Time_End": 2050.64,
      "Text": " example, but being okay with wearing a blouse on our sleeve. And, you know, we're going to make"
    },
    {
      "Time_Start": 2050.64,
      "Time_End": 2057.84,
      "Text": " mistakes. We're going to make a lot of mistakes, but as long as we're learning from them, that's"
    },
    {
      "Time_Start": 2057.84,
      "Time_End": 2065.6,
      "Text": " okay. It's a good part of the process. And it's not a failure, you know, for us others to see that."
    },
    {
      "Time_Start": 2066.24,
      "Time_End": 2070.08,
      "Text": " I think also, you know, as long as we're going to default to action, right? Like,"
    },
    {
      "Time_Start": 2071.2,
      "Time_End": 2075.2,
      "Text": " like at the end of the day, the worst decision is the ones that you don't make."
    },
    {
      "Time_Start": 2076.0,
      "Time_End": 2080.96,
      "Text": " And so sometimes when you make those decisions on what you're going to release,"
    },
    {
      "Time_Start": 2080.96,
      "Time_End": 2083.2,
      "Text": " what you're going to share, the stance that you're going to take,"
    },
    {
      "Time_Start": 2084.0,
      "Time_End": 2089.6,
      "Text": " people might not like what you did. They might think that you didn't really consider,"
    },
    {
      "Time_Start": 2090.4,
      "Time_End": 2094.4,
      "Text": " you know, every opinion enough, or you didn't consider all the angles enough."
    },
    {
      "Time_Start": 2094.4,
      "Time_End": 2100.0,
      "Text": " And it could be, it could be right in that case. And we're going to understand that sometimes the"
    },
    {
      "Time_Start": 2100.0,
      "Time_End": 2105.6,
      "Text": " work, sometimes the work that we produce is not going to be used for good, right? It's going to"
    },
    {
      "Time_Start": 2105.6,
      "Time_End": 2114.2400000000002,
      "Text": " be used against us. We can't control everything, but the trade-off is ignorance. And to us,"
    },
    {
      "Time_Start": 2114.2400000000002,
      "Time_End": 2120.1600000000003,
      "Text": " we feel that's more negative than the times that the things that we've done have been used against"
    },
    {
      "Time_Start": 2120.16,
      "Time_End": 2130.3199999999997,
      "Text": " us. Probably I'll have to stay there. Hopefully, you know, again, that's pretty vague because"
    },
    {
      "Time_Start": 2130.3199999999997,
      "Time_End": 2135.68,
      "Text": " it's not like we're talking about a business strategic plan necessarily, but at least maybe"
    },
    {
      "Time_Start": 2135.68,
      "Time_End": 2140.3199999999997,
      "Text": " you understand, like, how do we see the world? How do we see our interactions with the world?"
    },
    {
      "Time_Start": 2140.3199999999997,
      "Time_End": 2146.08,
      "Text": " What are we going to advocate for? And we'll try to be better as we look into the future with,"
    },
    {
      "Time_Start": 2146.96,
      "Time_End": 2154.56,
      "Text": " you know, that being open with that message and being more open with what we're saying."
    },
    {
      "Time_Start": 2156.08,
      "Time_End": 2162.0,
      "Text": " I'd like to close with a couple things. One is, you know, again, I want to thank everyone"
    },
    {
      "Time_Start": 2163.52,
      "Time_End": 2170.4,
      "Text": " who signed up for this event. You know, the responses were sort of overwhelming for us,"
    },
    {
      "Time_Start": 2170.4,
      "Time_End": 2174.4,
      "Text": " and I think really reaffirming for us, you know, sort of positivity as we were dealing"
    },
    {
      "Time_Start": 2175.04,
      "Time_End": 2179.92,
      "Text": " with some of the dark things. I think everyone was. Thank you for, you know, if you've made it"
    },
    {
      "Time_Start": 2179.92,
      "Time_End": 2186.4,
      "Text": " this far through the presentation. Thank you for listening to me as I kind of ramble about"
    },
    {
      "Time_Start": 2187.6800000000003,
      "Time_End": 2190.48,
      "Text": " and ruminate about what we're doing as an industry and as a company."
    },
    {
      "Time_Start": 2192.48,
      "Time_End": 2198.8,
      "Text": " You know, for me personally, I want to thank our SpectreOps crew who over the last, you know,"
    },
    {
      "Time_Start": 2198.8,
      "Time_End": 2207.44,
      "Text": " several months have really done amazing work. I sit on the sidelines a lot. The position that"
    },
    {
      "Time_Start": 2207.44,
      "Time_End": 2212.5600000000004,
      "Text": " I'm in, I'm supposed to go, like, strategize or something, right? But, you know, seeing the hard"
    },
    {
      "Time_Start": 2212.5600000000004,
      "Time_End": 2220.0800000000004,
      "Text": " work that our crew has put forward to produce this conference, but also just the truly sort"
    },
    {
      "Time_Start": 2220.0800000000004,
      "Time_End": 2225.2000000000003,
      "Text": " of remarkable things that they've accomplished as we sort of dealt with this, you know, I think"
    },
    {
      "Time_Start": 2225.2000000000003,
      "Time_End": 2230.2400000000002,
      "Text": " really what is the worst period in our lives and probably everyone's because we've, you know,"
    },
    {
      "Time_Start": 2230.2400000000002,
      "Time_End": 2236.0000000000005,
      "Text": " tried to navigate this. Watching them overcome the obstacles that they have has been something that"
    },
    {
      "Time_Start": 2236.6400000000003,
      "Time_End": 2243.5200000000004,
      "Text": " probably drives the most satisfaction for me. I have a feeling that is shared by a lot of my fellow"
    },
    {
      "Time_Start": 2243.5200000000004,
      "Time_End": 2250.7200000000003,
      "Text": " CEOs out there in our community. But it's been really humbling to see at the end of the day,"
    },
    {
      "Time_Start": 2251.5200000000004,
      "Time_End": 2257.0400000000004,
      "Text": " you know, following essentially a dumb Marine as he learns all this for the first time,"
    },
    {
      "Time_Start": 2257.76,
      "Time_End": 2264.7200000000003,
      "Text": " accepting my failures and watching me fumble, but sticking with us as we go along."
    },
    {
      "Time_Start": 2266.6400000000003,
      "Time_End": 2272.0800000000004,
      "Text": " Final kind of thing I want to feel like I'd be remiss not to use the platform that I have"
    },
    {
      "Time_Start": 2272.08,
      "Time_End": 2276.24,
      "Text": " right now to not close sort of with a personal appeal."
    },
    {
      "Time_Start": 2285.44,
      "Time_End": 2290.96,
      "Text": " Nobody knows this probably, but my wife is, works at one of the hospitals here."
    },
    {
      "Time_Start": 2290.96,
      "Time_End": 2295.44,
      "Text": " It's a clinician in the Seattle area that was actually one of the first ones I had to deal"
    },
    {
      "Time_Start": 2295.44,
      "Time_End": 2305.28,
      "Text": " with this pandemic. I've seen how hard it is, you know, on the front lines for them."
    },
    {
      "Time_Start": 2305.92,
      "Time_End": 2311.44,
      "Text": " And I've seen how privileged we are. And that's something I think that maybe we don't"
    },
    {
      "Time_Start": 2313.36,
      "Time_End": 2318.96,
      "Text": " take into account enough that, you know, we live in an industry that pays well,"
    },
    {
      "Time_Start": 2318.96,
      "Time_End": 2327.84,
      "Text": " that can operate remotely and do so safely, right? And we're incredibly fortunate for that."
    },
    {
      "Time_Start": 2327.84,
      "Time_End": 2332.64,
      "Text": " You know, the worst things we've had to deal with is these sort of macroeconomic factors."
    },
    {
      "Time_Start": 2335.04,
      "Time_End": 2340.48,
      "Text": " This has really been a dark hour for a lot of us, you know, watching, you know, for me,"
    },
    {
      "Time_Start": 2340.48,
      "Time_End": 2346.2400000000002,
      "Text": " watching our kids, you know, the effects that they're going to, that we're seeing happen on"
    },
    {
      "Time_Start": 2346.2400000000002,
      "Time_End": 2350.88,
      "Text": " them, you know, just dealing with the situation that seems like it's never going to end. I know"
    },
    {
      "Time_Start": 2350.88,
      "Time_End": 2357.28,
      "Text": " I'm tired. We're all tired. There may be, you know, from some of the recent news we've had"
    },
    {
      "Time_Start": 2358.0800000000004,
      "Time_End": 2362.88,
      "Text": " that you can kind of see the glimmer of light at the end of the tunnel, which can give you some"
    },
    {
      "Time_Start": 2362.88,
      "Time_End": 2368.96,
      "Text": " hope there. But my appeal would be that whatever reviews, I don't want to pick any sides, but"
    },
    {
      "Time_Start": 2368.96,
      "Time_End": 2377.04,
      "Text": " whatever reviews, I'd ask you to stay safe, limit your exposure to this virus. I realize we can all"
    },
    {
      "Time_Start": 2377.04,
      "Time_End": 2385.52,
      "Text": " have opinions about how it affects us and the hardships we put on. But I can say that, you know,"
    },
    {
      "Time_Start": 2385.52,
      "Time_End": 2391.76,
      "Text": " for my family, I'll ask for my family and the families that are like us, that, you know, people"
    },
    {
      "Time_Start": 2391.76,
      "Time_End": 2400.6400000000003,
      "Text": " are really going through hell fighting this virus. And their families, you know, watch them leave every day"
    },
    {
      "Time_Start": 2402.4,
      "Time_End": 2408.1600000000003,
      "Text": " and worry not just for them, but for those they might bring home with them. And it's hard, but"
    },
    {
      "Time_Start": 2408.1600000000003,
      "Time_End": 2414.8,
      "Text": " remember them when you're, you know, when you're going about your lives and stay safe for them"
    },
    {
      "Time_Start": 2414.8,
      "Time_End": 2421.6000000000004,
      "Text": " and nothing else. So again, thank you for listening to me. Thank you for coming to our"
    },
    {
      "Time_Start": 2421.6000000000004,
      "Time_End": 2429.1200000000003,
      "Text": " conference and hope you enjoy it. And hopefully see each other again next year, maybe in a much more"
    },
    {
      "Time_Start": 2430.48,
      "Time_End": 2431.84,
      "Text": " hopefully personal setting."
    }
  ]
}