{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 17.48,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Josh Krueger. I'm a threat hunter for SpecterOps and their defensive clients."
    },
    {
      "Time_Start": 17.48,
      "Time_End": 21.48,
      "Text": " Primarily, I work on program development, building security operating centers to a more"
    },
    {
      "Time_Start": 21.48,
      "Time_End": 26.240000000000002,
      "Text": " mature level. Some of the hobbies that I enjoy are astrophotography and spending time with"
    },
    {
      "Time_Start": 26.240000000000002,
      "Time_End": 27.240000000000002,
      "Text": " my family."
    },
    {
      "Time_Start": 27.240000000000002,
      "Time_End": 30.44,
      "Text": " All right, so let's just jump right into it. So starting off, we come to some well-known"
    },
    {
      "Time_Start": 30.44,
      "Time_End": 35.36,
      "Text": " but often unsaid problems when determining which alerts to look at first. The first issue"
    },
    {
      "Time_Start": 35.36,
      "Time_End": 39.480000000000004,
      "Text": " we come to is a lack of structure, which is a subjective issue. The analyst is allowed"
    },
    {
      "Time_Start": 39.480000000000004,
      "Time_End": 43.52,
      "Text": " to choose any alert for any rhyme or reason. The analyst will want to choose the newest,"
    },
    {
      "Time_Start": 43.52,
      "Time_End": 47.08,
      "Text": " the easiest, or the novel alert that will inherently create opportunities for the analyst"
    },
    {
      "Time_Start": 47.08,
      "Time_End": 49.52,
      "Text": " to miss two positives."
    },
    {
      "Time_Start": 49.52,
      "Time_End": 54.6,
      "Text": " The second issue we come to is the structure of prioritization is based off assumptions."
    },
    {
      "Time_Start": 54.6,
      "Time_End": 57.760000000000005,
      "Text": " What this means is the scoring structure actually exists. The team put in the time"
    },
    {
      "Time_Start": 57.760000000000005,
      "Time_End": 61.88,
      "Text": " to create the prioritization structure, but it is inherently flawed because it is stagnant"
    },
    {
      "Time_Start": 61.88,
      "Time_End": 66.04,
      "Text": " and has never been tested. The analysts are prioritizing alerts based on factors that"
    },
    {
      "Time_Start": 66.04,
      "Time_End": 71.24000000000001,
      "Text": " they think are malicious, but have not yet tested that hypothesis."
    },
    {
      "Time_Start": 71.24000000000001,
      "Time_End": 75.68,
      "Text": " The third issue we run into is a singular factor is used to determine priority. The"
    },
    {
      "Time_Start": 75.68,
      "Time_End": 80.08,
      "Text": " priority of the alert itself is decided based off of only one factor. This can likely be"
    },
    {
      "Time_Start": 80.08,
      "Time_End": 85.67999999999999,
      "Text": " utilized with precise alerts, such as malware-based antivirus alerts, but for more complex technique-based"
    },
    {
      "Time_Start": 85.67999999999999,
      "Time_End": 89.28,
      "Text": " alerts, this could cause multiple alerts to be ranked as high."
    },
    {
      "Time_Start": 89.28,
      "Time_End": 93.2,
      "Text": " And then finally, our last pain point identifies that the scoring structure for the prioritization"
    },
    {
      "Time_Start": 93.2,
      "Time_End": 97.64,
      "Text": " has never been updated. The scoring structure exists, but it is not updated and scaled for"
    },
    {
      "Time_Start": 97.64,
      "Time_End": 102.56,
      "Text": " different research, new forms of technique execution, environment changes, or personnel"
    },
    {
      "Time_Start": 102.56,
      "Time_End": 103.56,
      "Text": " and process changes."
    },
    {
      "Time_Start": 103.56,
      "Time_End": 109.56,
      "Text": " First, we need to define some terms specific to this talk. Triage in this case is the concept"
    },
    {
      "Time_Start": 109.56,
      "Time_End": 114.28,
      "Text": " of adding context to the base condition and establishing a priority according to that"
    },
    {
      "Time_Start": 114.28,
      "Time_End": 118.12,
      "Text": " funnel of fidelity. When I'm talking about the funnel of fidelity, I'm referring to the"
    },
    {
      "Time_Start": 118.12,
      "Time_End": 121.64,
      "Text": " project created by Jared Atkinson that walks security operating center analysts through"
    },
    {
      "Time_Start": 121.64,
      "Time_End": 125.72,
      "Text": " the process of which we collect and respond to alerts."
    },
    {
      "Time_Start": 125.72,
      "Time_End": 130.16,
      "Text": " And then let's get into subjective versus objective metrics. Subjective metrics are"
    },
    {
      "Time_Start": 130.16,
      "Time_End": 135.08,
      "Text": " opinion-based metrics. An example of an opinion-based metric is providing a one-to-five scale on"
    },
    {
      "Time_Start": 135.08,
      "Time_End": 140.28,
      "Text": " how good something is. Whereas an objective metric is fact-based and should be the same"
    },
    {
      "Time_Start": 140.28,
      "Time_End": 145.48000000000002,
      "Text": " regardless of the person. An example of a fact-based metric is number of tickets closed"
    },
    {
      "Time_Start": 145.48000000000002,
      "Time_End": 148.20000000000002,
      "Text": " by the security operating center. That's not something we can refute, and it's something"
    },
    {
      "Time_Start": 148.20000000000002,
      "Time_End": 152.12,
      "Text": " we can identify and validate."
    },
    {
      "Time_Start": 152.12,
      "Time_End": 156.72000000000003,
      "Text": " So some other terms that you may not have heard of before is a priori and a posteriori."
    },
    {
      "Time_Start": 156.72000000000003,
      "Time_End": 163.20000000000002,
      "Text": " Both of these words are the root of the word priority. And a priori means derived from"
    },
    {
      "Time_Start": 163.20000000000002,
      "Time_End": 169.16000000000003,
      "Text": " logic or reason or to be known true. An example that I give here of this form of hypothesis"
    },
    {
      "Time_Start": 169.16000000000003,
      "Time_End": 175.12,
      "Text": " is a rooster crows when the sun rises. An a posteriori is a proven fact. It's an observed"
    },
    {
      "Time_Start": 175.12,
      "Time_End": 182.04000000000002,
      "Text": " fact. An example I give with the a posteriori is the sun rises after the rooster crows."
    },
    {
      "Time_Start": 182.04000000000002,
      "Time_End": 187.20000000000002,
      "Text": " Both methods are utilized in prioritization. However, both methods can create misconceptions."
    },
    {
      "Time_Start": 187.20000000000002,
      "Time_End": 193.84000000000003,
      "Text": " A a priori or a hypothesis-based misconception would be roosters crow when the sun rises."
    },
    {
      "Time_Start": 193.84000000000003,
      "Time_End": 197.52,
      "Text": " Because we don't have evidence on every single rooster crowing, our misconception could be"
    },
    {
      "Time_Start": 197.52,
      "Time_End": 202.96,
      "Text": " if there isn't a sun, the rooster won't crow. For our a posteriori, which is completely"
    },
    {
      "Time_Start": 202.96,
      "Time_End": 208.08,
      "Text": " based on fact, right, no logic or reason has been added to it, misconceptions can be created"
    },
    {
      "Time_Start": 208.08,
      "Time_End": 215.20000000000002,
      "Text": " there as well. So for the example, the sun rises after the rooster crows, an unvalidated"
    },
    {
      "Time_Start": 215.20000000000002,
      "Time_End": 220.76000000000002,
      "Text": " form of a a posteriori, we could make that misconception that the sun rises because the"
    },
    {
      "Time_Start": 220.76000000000002,
      "Time_End": 224.96,
      "Text": " rooster crowed. We would have to add in logic or reason to know that the world revolves"
    },
    {
      "Time_Start": 224.96,
      "Time_End": 231.4,
      "Text": " around the sun and of course not around it. All right. So let's start off with our base"
    },
    {
      "Time_Start": 231.4,
      "Time_End": 236.28000000000003,
      "Text": " condition. To effectively prioritize malicious events, we must first derive that base condition."
    },
    {
      "Time_Start": 236.28000000000003,
      "Time_End": 241.08,
      "Text": " To begin developing our malicious factors and form that scoring, we will need to begin"
    },
    {
      "Time_Start": 241.08,
      "Time_End": 246.24,
      "Text": " collecting telemetry for our original data set for that condition. This data set is often"
    },
    {
      "Time_Start": 246.24,
      "Time_End": 251.28,
      "Text": " derived from either our production environment or our testing environment. We will use the"
    },
    {
      "Time_Start": 251.28,
      "Time_End": 256.04,
      "Text": " example of service creation for the duration of this presentation. For this example, the"
    },
    {
      "Time_Start": 256.04,
      "Time_End": 260.16,
      "Text": " base condition for service creation will be collecting telemetry on all created services,"
    },
    {
      "Time_Start": 260.16,
      "Time_End": 265.32,
      "Text": " both malicious and legitimate within that first data set. When collecting our base condition,"
    },
    {
      "Time_Start": 265.32,
      "Time_End": 269.96000000000004,
      "Text": " we will need to consider the collection method as well. Here I'm giving an example of identifying"
    },
    {
      "Time_Start": 270.23999999999995,
      "Time_End": 276.71999999999997,
      "Text": " service creations via the 4697 event ID or identifying service creation via the raw registry"
    },
    {
      "Time_Start": 276.71999999999997,
      "Time_End": 281.56,
      "Text": " key creation event. In this case, we're going to side with the raw registry key creation"
    },
    {
      "Time_Start": 281.56,
      "Time_End": 284.91999999999996,
      "Text": " events and we're going to do this because regardless of what tool interacts with the"
    },
    {
      "Time_Start": 284.91999999999996,
      "Time_End": 289.67999999999995,
      "Text": " service control manager, the registry key will still need to be created in HPLM system"
    },
    {
      "Time_Start": 289.67999999999995,
      "Time_End": 296.03999999999996,
      "Text": " current control set service. So here's an example of Johnny Johnson's latest automated"
    },
    {
      "Time_Start": 296.04,
      "Time_End": 301.0,
      "Text": " detection pipeline, Jupyter Notebook project. This project is located in his GitHub and here"
    },
    {
      "Time_Start": 301.0,
      "Time_End": 305.16,
      "Text": " in this project, Johnny identifies our base condition as the registry key creation under"
    },
    {
      "Time_Start": 305.16,
      "Time_End": 310.6,
      "Text": " HPLM system current control set services. The registry key is a necessary choke point for this"
    },
    {
      "Time_Start": 310.6,
      "Time_End": 314.88,
      "Text": " technique as the operating system will need to identify this key in order to start the service"
    },
    {
      "Time_Start": 314.88,
      "Time_End": 323.12,
      "Text": " at boot time. So the base condition is the registry key creation, which gets us that process that"
    },
    {
      "Time_Start": 323.12,
      "Time_End": 328.4,
      "Text": " created the service, the process GUID of that process, and the timestamp. But what does it not"
    },
    {
      "Time_Start": 328.4,
      "Time_End": 332.24,
      "Text": " give us, right? It doesn't give us enough information to make a triage decision on whether"
    },
    {
      "Time_Start": 332.24,
      "Time_End": 337.36,
      "Text": " or not this is benign or malicious. Why? Because in this situation, in a normal situation that a"
    },
    {
      "Time_Start": 337.36,
      "Time_End": 341.92,
      "Text": " service is created, the service control manager would be the one that would create the service,"
    },
    {
      "Time_Start": 341.92,
      "Time_End": 348.32,
      "Text": " right? We would see a creating process of services.exe and not a PowerShell or reg.exe."
    },
    {
      "Time_Start": 348.32,
      "Time_End": 352.96,
      "Text": " What this means is that a process instructs the service control manager or a process"
    },
    {
      "Time_Start": 352.96,
      "Time_End": 359.36,
      "Text": " instructs the services.exe process to create this registry key, and we need to determine what that"
    },
    {
      "Time_Start": 359.36,
      "Time_End": 363.92,
      "Text": " process was. So what does it not give us? The name of the process that instructed the service control"
    },
    {
      "Time_Start": 363.92,
      "Time_End": 368.32,
      "Text": " manager that created that registry key, and it also doesn't give us the user that created that"
    },
    {
      "Time_Start": 368.32,
      "Time_End": 372.8,
      "Text": " registry key and if that service was created remotely or locally. So in all in all, it's"
    },
    {
      "Time_Start": 372.8,
      "Time_End": 377.28,
      "Text": " giving us a lot of a lot of information, but we're really missing that contextual information"
    },
    {
      "Time_Start": 377.28000000000003,
      "Time_End": 383.44000000000005,
      "Text": " to make that malicious or benign decision. So how do we do that? Well, we would have to add"
    },
    {
      "Time_Start": 383.44000000000005,
      "Time_End": 388.56,
      "Text": " factors, right? We must add contextual evidence to the base condition to provide the analyst a"
    },
    {
      "Time_Start": 388.56,
      "Time_End": 394.0,
      "Text": " composite event enabling the benign or malicious decision-making capability. We need to add factors"
    },
    {
      "Time_Start": 394.0,
      "Time_End": 398.48,
      "Text": " to make that decision, but we don't know what context to add, right? It's a chicken before the"
    },
    {
      "Time_Start": 398.48,
      "Time_End": 404.0,
      "Text": " egg scenario. So how do we go about identifying which factors to include and how do we validate"
    },
    {
      "Time_Start": 404.0,
      "Time_End": 410.0,
      "Text": " that these factors are actually aiding us in decision-making? So that takes us to our hypothesis"
    },
    {
      "Time_Start": 410.0,
      "Time_End": 416.32,
      "Text": " or our a priori, right? To identify factors, we must develop a logical hypothesis based off research"
    },
    {
      "Time_Start": 416.32,
      "Time_End": 420.72,
      "Text": " of the underlying technology. So when talking about the example of service creation, I make"
    },
    {
      "Time_Start": 420.72,
      "Time_End": 426.48,
      "Text": " four assumptions. Assumption number one is a remote service creation is a malicious indicator."
    },
    {
      "Time_Start": 426.48,
      "Time_End": 432.24,
      "Text": " Assumption number two is a binary creating the registry key should be services.exe in a"
    },
    {
      "Time_Start": 432.24,
      "Time_End": 438.72,
      "Text": " normal situation. Assumption number three is our start type services are also a malicious indicator."
    },
    {
      "Time_Start": 439.68,
      "Time_End": 445.84000000000003,
      "Text": " And then assumption number four is processes requesting to create services should be sc.exe"
    },
    {
      "Time_Start": 445.84000000000003,
      "Time_End": 451.6,
      "Text": " in a normal process workflow, right? Each assumption represents our hypothesis of the"
    },
    {
      "Time_Start": 451.6,
      "Time_End": 457.2,
      "Text": " likelihood to indicate malicious behavior. Each hypothesis has been built upon research."
    },
    {
      "Time_Start": 458.08,
      "Time_End": 461.28000000000003,
      "Text": " But then you could ask why did we make these assumptions? Because some of these assumptions"
    },
    {
      "Time_Start": 461.28000000000003,
      "Time_End": 464.8,
      "Text": " when looking at it, and if you looked for service creation in your own environments,"
    },
    {
      "Time_Start": 464.8,
      "Time_End": 468.88000000000005,
      "Text": " you may quickly identify that these assumptions are kind of a dangerous assumption to make."
    },
    {
      "Time_Start": 469.52000000000004,
      "Time_End": 473.92,
      "Text": " The one that sticks out obviously to me is auto start type services are malicious factors."
    },
    {
      "Time_Start": 474.64000000000004,
      "Time_End": 479.68,
      "Text": " Generally, there are many, many auto start type services within the environment natively"
    },
    {
      "Time_Start": 479.68,
      "Time_End": 485.68,
      "Text": " by default, right? And so adding this to our base context as a malicious factor"
    },
    {
      "Time_Start": 485.68,
      "Time_End": 490.56000000000006,
      "Text": " may not necessarily work out for us in a realistic environment, okay? And that's okay. These are just"
    },
    {
      "Time_Start": 490.56,
      "Time_End": 494.88,
      "Text": " assumptions. These are just hypotheses. We will have to validate those assumptions. But first,"
    },
    {
      "Time_Start": 494.88,
      "Time_End": 498.8,
      "Text": " we need to identify how these assumptions came to be. How did we build these assumptions?"
    },
    {
      "Time_Start": 500.0,
      "Time_End": 505.76,
      "Text": " All right. So hypothesis number one or assumption number one is remote service creation is a"
    },
    {
      "Time_Start": 505.76,
      "Time_End": 510.88,
      "Text": " malicious indicator, right? The hypothesis is derived from the knowledge of post exploitation"
    },
    {
      "Time_Start": 510.88,
      "Time_End": 516.8,
      "Text": " phase the kill chain, okay? I needed an objective metric in order to create my assumption number"
    },
    {
      "Time_Start": 516.8,
      "Time_End": 521.92,
      "Text": " one. So objectively, I used MITRE ATT&CK, and I looked and I saw that remote service creation"
    },
    {
      "Time_Start": 521.92,
      "Time_End": 526.24,
      "Text": " accomplishes three tactics or three goals, lateral movement, persistence, and execution,"
    },
    {
      "Time_Start": 526.24,
      "Time_End": 531.92,
      "Text": " whereas local service creation accomplishes two goals, persistence and execution, okay? Because"
    },
    {
      "Time_Start": 531.92,
      "Time_End": 536.8,
      "Text": " we know that remote service creation accomplishes so many tactics, we can assume or hypothesize"
    },
    {
      "Time_Start": 536.8,
      "Time_End": 541.52,
      "Text": " that an adversary may choose remote service creation instead of local service creation"
    },
    {
      "Time_Start": 541.52,
      "Time_End": 546.16,
      "Text": " to accomplish more than one goal. Now, again, remember, this is just a hypothesis, and you may"
    },
    {
      "Time_Start": 546.16,
      "Time_End": 550.4,
      "Text": " look at this and think, well, I can also use local service creation to do privilege escalation"
    },
    {
      "Time_Start": 550.4,
      "Time_End": 555.52,
      "Text": " as well, which would equal them out. And yes, that's true, but I needed an objective metric"
    },
    {
      "Time_Start": 555.52,
      "Time_End": 560.48,
      "Text": " to create this assumption, and MITRE ATT&CK lists three tactics for remote service creation and two"
    },
    {
      "Time_Start": 560.48,
      "Time_End": 565.68,
      "Text": " for local service creation. And so because of that, I'm going to base this possibly incorrect"
    },
    {
      "Time_Start": 565.68,
      "Time_End": 572.4,
      "Text": " assumption off of that metric. And then we come into assumption number two. The binary"
    },
    {
      "Time_Start": 572.4,
      "Time_End": 577.84,
      "Text": " we create in the registry key should be services.exe in a normal environment. Hypothesis is derived"
    },
    {
      "Time_Start": 577.84,
      "Time_End": 581.92,
      "Text": " from the research into the underlying technology. So this is based on the underlying technology that"
    },
    {
      "Time_Start": 581.92,
      "Time_End": 588.24,
      "Text": " I researched. We can create a hypothesis that any time hklm system correct control set services"
    },
    {
      "Time_Start": 588.24,
      "Time_End": 593.84,
      "Text": " sub registry key is created for a service, and that that process that did it is not services.exe,"
    },
    {
      "Time_Start": 593.84,
      "Time_End": 597.52,
      "Text": " this could be a malicious indicator. Again, remember, at this point, we're still making"
    },
    {
      "Time_Start": 597.52,
      "Time_End": 603.1999999999999,
      "Text": " assumptions, so I would need to go in and I would need to prove that services.exe is the only"
    },
    {
      "Time_Start": 603.1999999999999,
      "Time_End": 608.56,
      "Text": " process, for the most part, that's creating these registry keys. If there is any sort of outlier or"
    },
    {
      "Time_Start": 608.56,
      "Time_End": 612.3199999999999,
      "Text": " difference that I need to be able to document that and identify that, and then again come up"
    },
    {
      "Time_Start": 612.3199999999999,
      "Time_End": 616.64,
      "Text": " with probability. So to create a service, there is specific criteria that isn't normally met,"
    },
    {
      "Time_Start": 616.64,
      "Time_End": 621.84,
      "Text": " and this is what this assumption is based off of. A registry key must be created within hklm system"
    },
    {
      "Time_Start": 621.84,
      "Time_End": 627.4399999999999,
      "Text": " correct control set and services. Five registry values are set within hklm system correct control"
    },
    {
      "Time_Start": 627.6,
      "Time_End": 632.5600000000001,
      "Text": " set services, and these changes to the registry are normally made by services.exe at the request"
    },
    {
      "Time_Start": 632.5600000000001,
      "Time_End": 637.9200000000001,
      "Text": " of another process. And then we come into assumption number three, auto start type"
    },
    {
      "Time_Start": 637.9200000000001,
      "Time_End": 643.36,
      "Text": " services are a malicious factor. So the hypothesis is derived from the assumption that the adversary"
    },
    {
      "Time_Start": 643.36,
      "Time_End": 648.48,
      "Text": " will want to successfully survive a reboot autonomously. This hypothesis makes the logical"
    },
    {
      "Time_Start": 648.48,
      "Time_End": 652.4000000000001,
      "Text": " assumption that an adversary would rather have their payload execute upon startup instead of"
    },
    {
      "Time_Start": 652.4,
      "Time_End": 658.64,
      "Text": " waiting for some external force to interact with their server. Now if some of you are well versed"
    },
    {
      "Time_Start": 658.64,
      "Time_End": 664.3199999999999,
      "Text": " red teamers, you can definitely identify a few situations where you may want a manual start type"
    },
    {
      "Time_Start": 664.3199999999999,
      "Time_End": 671.28,
      "Text": " service, where you may want some sort of external factor to be what executes your service. But we're"
    },
    {
      "Time_Start": 671.28,
      "Time_End": 677.1999999999999,
      "Text": " going to make this assumption as a logical representation of that a priori, which is just"
    },
    {
      "Time_Start": 677.2,
      "Time_End": 683.6800000000001,
      "Text": " assuming the adversary will want to survive. All right, and then assumption number four,"
    },
    {
      "Time_Start": 683.6800000000001,
      "Time_End": 688.6400000000001,
      "Text": " the process requesting to create services should be sc.exe in a normal situation."
    },
    {
      "Time_Start": 688.6400000000001,
      "Time_End": 692.72,
      "Text": " So this hypothesis looks at the deviation from the baseline behavior within an environment."
    },
    {
      "Time_Start": 692.72,
      "Time_End": 697.5200000000001,
      "Text": " I wanted to use this assumption specifically because sc.exe is a windows native binary,"
    },
    {
      "Time_Start": 697.5200000000001,
      "Time_End": 702.96,
      "Text": " and a lot of the clients that I work for will oftentimes inherently try to allow a list or"
    },
    {
      "Time_Start": 702.96,
      "Time_End": 708.08,
      "Text": " filter out those windows native binaries, making the assumption that adversaries will use some new"
    },
    {
      "Time_Start": 708.08,
      "Time_End": 713.36,
      "Text": " or novel software to complete their objective. And for those of you that are very familiar with"
    },
    {
      "Time_Start": 713.36,
      "Time_End": 719.76,
      "Text": " SpecterOps's techniques and research, SpecterOps's red team is very heavy into using living off the"
    },
    {
      "Time_Start": 719.76,
      "Time_End": 726.24,
      "Text": " land techniques. So this assumption that we should filter out windows native binaries would be very,"
    },
    {
      "Time_Start": 726.24,
      "Time_End": 734.16,
      "Text": " very, very dangerous. All right, so now that we've established our hypothesis and the factors"
    },
    {
      "Time_Start": 734.16,
      "Time_End": 739.6,
      "Text": " that we might want to include, now we have to identify the likelihood of these being malicious"
    },
    {
      "Time_Start": 739.6,
      "Time_End": 745.84,
      "Text": " or just in general good indicators to add context to our alert. So from here on out,"
    },
    {
      "Time_Start": 745.84,
      "Time_End": 750.96,
      "Text": " we're going to have to test these hypotheses with validation and testing, and it's going to take"
    },
    {
      "Time_Start": 751.9200000000001,
      "Time_End": 757.2,
      "Text": " these data analytic approaches to turn these hypotheses into empirical evidence,"
    },
    {
      "Time_Start": 757.2,
      "Time_End": 762.88,
      "Text": " okay, or the a posteriori. If you're not familiar with the term empirical, it means by observation"
    },
    {
      "Time_Start": 762.88,
      "Time_End": 768.64,
      "Text": " or through validation and testing, right? An example of empirical evidence could be you can"
    },
    {
      "Time_Start": 768.64,
      "Time_End": 773.52,
      "Text": " say the ocean is made of water because you've observed yourself both water and the ocean,"
    },
    {
      "Time_Start": 773.52,
      "Time_End": 776.72,
      "Text": " right? So how do we go about testing our hypothesis?"
    },
    {
      "Time_Start": 777.0400000000001,
      "Time_End": 781.6800000000001,
      "Text": " To validate our hypothesis, we need to collect our data set and apply data analytic techniques"
    },
    {
      "Time_Start": 781.6800000000001,
      "Time_End": 786.8000000000001,
      "Text": " or statistic-based techniques to identify the differences in criteria that consistently"
    },
    {
      "Time_Start": 786.8000000000001,
      "Time_End": 793.28,
      "Text": " differentiate legitimate from malicious. Many times what this entails is statistic analysis"
    },
    {
      "Time_Start": 793.28,
      "Time_End": 800.08,
      "Text": " to determine deviations from baseline behavior. Some considerations that we need to think about"
    },
    {
      "Time_Start": 800.08,
      "Time_End": 805.6800000000001,
      "Text": " when we're trying to collect that data set and determine the differences in that data set are"
    },
    {
      "Time_Start": 805.84,
      "Time_End": 811.84,
      "Text": " differences in that data set is our test pool size, our data pool size. Do we have a singular"
    },
    {
      "Time_Start": 811.84,
      "Time_End": 816.8000000000001,
      "Text": " or multiple environment in there? Do we have singular or multiple data sets in there? And"
    },
    {
      "Time_Start": 816.8000000000001,
      "Time_End": 821.36,
      "Text": " then the variations of those data sets, the variations of the environment. There's been many"
    },
    {
      "Time_Start": 821.36,
      "Time_End": 826.24,
      "Text": " times where I've had a hypothesis or I've had an assumption, and I've gone and tested it on one"
    },
    {
      "Time_Start": 826.24,
      "Time_End": 831.0400000000001,
      "Text": " client environment, and then when I've looked at a second client environment, the results are"
    },
    {
      "Time_Start": 831.04,
      "Time_End": 836.3199999999999,
      "Text": " completely different. The latest example I can think of is I wanted to test any process"
    },
    {
      "Time_Start": 836.3199999999999,
      "Time_End": 843.12,
      "Text": " communicating over 488 that wasn't LSAT. And I made that assumption that this could possibly"
    },
    {
      "Time_Start": 843.12,
      "Time_End": 850.16,
      "Text": " pick up some sort of like a raw TGS crafting tool or some kind of TGT manipulation tool out there."
    },
    {
      "Time_Start": 850.16,
      "Time_End": 855.4399999999999,
      "Text": " When I tested it in one environment, I found zero results other than like I think a small percentage"
    },
    {
      "Time_Start": 855.44,
      "Time_End": 861.36,
      "Text": " were Java, but ruling those out, I found zero results for any malicious indicators of a process"
    },
    {
      "Time_Start": 861.36,
      "Time_End": 866.72,
      "Text": " communicating over 488 that wasn't LSAT. But then when I looked in two other clients, I've actually"
    },
    {
      "Time_Start": 866.72,
      "Time_End": 873.36,
      "Text": " found a lot of different unique binaries that were unique to those client environments that were"
    },
    {
      "Time_Start": 873.36,
      "Time_End": 878.24,
      "Text": " effectively confirming my hypothesis, but also skewing my results. So this does happen quite"
    },
    {
      "Time_Start": 878.24,
      "Time_End": 882.8000000000001,
      "Text": " often, and we need to account for that kind of stuff. All right, so how do we go about testing"
    },
    {
      "Time_Start": 882.8000000000001,
      "Time_End": 889.2,
      "Text": " these hypotheses and doing these statistic-based analytics, right? So to identify the differences"
    },
    {
      "Time_Start": 889.2,
      "Time_End": 894.32,
      "Text": " in our hypothesis, we're going to utilize descriptive statistics first. The descriptive"
    },
    {
      "Time_Start": 894.32,
      "Time_End": 899.2800000000001,
      "Text": " statistics is what we can utilize to measure frequency. The measure of frequency, this is the"
    },
    {
      "Time_Start": 899.2800000000001,
      "Time_End": 904.5600000000001,
      "Text": " most common utilized technique that I see when it comes to developing a scoring criteria. A measure"
    },
    {
      "Time_Start": 904.5600000000001,
      "Time_End": 908.8800000000001,
      "Text": " of frequency is essentially identifying prevalence in the environment and then trying to identify"
    },
    {
      "Time_Start": 908.88,
      "Time_End": 917.92,
      "Text": " deviation. And then we also have measures of tendency or measures of prevalence of execution,"
    },
    {
      "Time_Start": 917.92,
      "Time_End": 923.84,
      "Text": " right? So here we gather the mean, medium, or mode, and we try to determine the commonly indicated"
    },
    {
      "Time_Start": 923.84,
      "Time_End": 930.4,
      "Text": " response, right, or the common indicated event of execution. And we also have measures of variation"
    },
    {
      "Time_Start": 930.4,
      "Time_End": 936.24,
      "Text": " for our descriptive statistics. This measure of variation is used to measure the range of data. So"
    },
    {
      "Time_Start": 936.24,
      "Time_End": 942.16,
      "Text": " this is our high to low, right? What are looking at all the possible outcomes in our data set?"
    },
    {
      "Time_Start": 942.16,
      "Time_End": 946.96,
      "Text": " What is the highest outcome compared to what is the lowest outcome? And then we have measures of"
    },
    {
      "Time_Start": 946.96,
      "Time_End": 951.84,
      "Text": " position. This is used to determine the scores formed between multiple data sets within a data"
    },
    {
      "Time_Start": 951.84,
      "Time_End": 958.4,
      "Text": " pool. Generally, this is kind of the final step if you are using every one of these descriptive"
    },
    {
      "Time_Start": 958.4,
      "Time_End": 964.96,
      "Text": " statistic techniques. Measures of position is generally used to measure the variations"
    },
    {
      "Time_Start": 965.6,
      "Time_End": 972.08,
      "Text": " between scores in a large data pool. So you would have needed to create your scoring criteria"
    },
    {
      "Time_Start": 972.08,
      "Time_End": 977.36,
      "Text": " already, and you would have needed to take multiple snapshots in time and recorded multiple"
    },
    {
      "Time_Start": 977.36,
      "Time_End": 985.0400000000001,
      "Text": " scores for one hypothesis and then try to identify that statistical anomaly. In many cases, we're"
    },
    {
      "Time_Start": 985.0400000000001,
      "Time_End": 990.4000000000001,
      "Text": " going to utilize measures of frequency to determine the anomaly across data sets. But in some"
    },
    {
      "Time_Start": 990.4,
      "Time_End": 995.04,
      "Text": " situations, when the anomaly is low and the variation is high, we're going to need to use"
    },
    {
      "Time_Start": 995.04,
      "Time_End": 1000.16,
      "Text": " more than one and sometimes all of the descriptive statistics to aid us in identifying that difference."
    },
    {
      "Time_Start": 1001.12,
      "Time_End": 1006.48,
      "Text": " We can then take that data analyzed by those descriptive techniques, and we can feed them"
    },
    {
      "Time_Start": 1006.48,
      "Time_End": 1011.76,
      "Text": " into inferential statistics to determine our probability. I listed a couple here. There's"
    },
    {
      "Time_Start": 1011.76,
      "Time_End": 1017.28,
      "Text": " actually quite a few more, but the ones that I've seen utilized the most, we've seen the most"
    },
    {
      "Time_Start": 1017.28,
      "Time_End": 1022.72,
      "Text": " examples of. Start off with Bayes' theorem, which essentially is used to determine the probability"
    },
    {
      "Time_Start": 1022.72,
      "Time_End": 1027.52,
      "Text": " from prior collected data or prior collected measurement. Then we have analysis of variance,"
    },
    {
      "Time_Start": 1027.52,
      "Time_End": 1031.68,
      "Text": " which is going to take the measures of frequency and the measures of variance and determine the"
    },
    {
      "Time_Start": 1031.68,
      "Time_End": 1036.96,
      "Text": " differences between the probability of variations remaining the same. And then finally, we have"
    },
    {
      "Time_Start": 1036.96,
      "Time_End": 1040.32,
      "Text": " regression, and regression will aid us in determining the outcome of the score"
    },
    {
      "Time_Start": 1040.32,
      "Time_End": 1043.84,
      "Text": " if we were to test the scoring structure in another data set from the same data."
    },
    {
      "Time_Start": 1044.56,
      "Time_End": 1047.6799999999998,
      "Text": " All right, so start off with measures of frequency. I'm going to use measures of"
    },
    {
      "Time_Start": 1047.6799999999998,
      "Time_End": 1052.56,
      "Text": " frequency with that assumption number one. Assumption number one is a remote service"
    },
    {
      "Time_Start": 1052.56,
      "Time_End": 1057.6799999999998,
      "Text": " creation is a malicious practice. This is the most common form of descriptive statistic technique"
    },
    {
      "Time_Start": 1057.6799999999998,
      "Time_End": 1062.9599999999998,
      "Text": " that I see utilized in scoring when compared to the different clients I work for. It's very"
    },
    {
      "Time_Start": 1062.9599999999998,
      "Time_End": 1067.52,
      "Text": " simple. We just simply count the amount of events from our data set and then determine that baseline"
    },
    {
      "Time_Start": 1067.52,
      "Time_End": 1073.12,
      "Text": " deviation. The example I give is the prevalence of locally created services across three environments"
    },
    {
      "Time_Start": 1073.2,
      "Time_End": 1079.1200000000001,
      "Text": " outweighs remotely created services 1,001. So obviously, this isn't a very granular approach"
    },
    {
      "Time_Start": 1079.1200000000001,
      "Time_End": 1083.0400000000002,
      "Text": " with the measures of frequency. It can be, but this example is not going to be. It's going to"
    },
    {
      "Time_Start": 1083.0400000000002,
      "Time_End": 1088.24,
      "Text": " be from a more high-level perspective. And the conclusion is legitimate remote service creation"
    },
    {
      "Time_Start": 1088.24,
      "Time_End": 1092.4,
      "Text": " is actually very rare across three environments. So we're going to score the occurrence of"
    },
    {
      "Time_Start": 1092.4,
      "Time_End": 1098.72,
      "Text": " Sysmon Event ID 12 registry P creation into that HPLM system current control set services"
    },
    {
      "Time_Start": 1099.68,
      "Time_End": 1105.28,
      "Text": " with a correlated Sysmon Event ID of three network connection initiated with a score higher"
    },
    {
      "Time_Start": 1105.28,
      "Time_End": 1110.24,
      "Text": " than that of locally created services. So in this case, we have two outcomes and we score one of"
    },
    {
      "Time_Start": 1110.24,
      "Time_End": 1115.28,
      "Text": " them higher than the other one. And so you could create a scoring structure that simply states like"
    },
    {
      "Time_Start": 1115.28,
      "Time_End": 1122.24,
      "Text": " for a service creation event, if it is a remote service creation event, score it higher than if"
    },
    {
      "Time_Start": 1122.24,
      "Time_End": 1127.52,
      "Text": " it was a locally created. And then here's how we normally take that measure of frequency and feed"
    },
    {
      "Time_Start": 1127.6,
      "Time_End": 1133.12,
      "Text": " that into probability. So here we're going to take assumption number two, and we're going to"
    },
    {
      "Time_Start": 1133.76,
      "Time_End": 1138.16,
      "Text": " assume that we already did that measure of frequency data analysis and then feed that"
    },
    {
      "Time_Start": 1138.16,
      "Time_End": 1143.28,
      "Text": " into our probability process. So we start off with that experiment. The binary creating the"
    },
    {
      "Time_Start": 1143.28,
      "Time_End": 1148.16,
      "Text": " registry should be services.exe. And then we're going to come up with two outcomes because of"
    },
    {
      "Time_Start": 1148.16,
      "Time_End": 1153.52,
      "Text": " that. And we identify that the binaries used in the occurrence of service registry P creation"
    },
    {
      "Time_Start": 1153.52,
      "Time_End": 1160.8799999999999,
      "Text": " was registry.exe and services.exe. Event one is services.exe, which is the 95% of the occurrence."
    },
    {
      "Time_Start": 1160.8799999999999,
      "Time_End": 1166.4,
      "Text": " And then event two, the binary was registry.exe, which only accounted for 5% of the occurrence."
    },
    {
      "Time_Start": 1166.4,
      "Time_End": 1171.68,
      "Text": " Right. So we can then take that inverse of the probability and turn it into our score of"
    },
    {
      "Time_Start": 1171.68,
      "Time_End": 1176.56,
      "Text": " malicious or more accurately our score of how abnormal it is in the environment. And we would"
    },
    {
      "Time_Start": 1176.56,
      "Time_End": 1183.9199999999998,
      "Text": " give registry.exe a malicious score of 9.5 because it is very abnormal for that binary to be creating"
    },
    {
      "Time_Start": 1183.9199999999998,
      "Time_End": 1189.44,
      "Text": " the services, the service underneath that registry key in our data pool as compared to our other"
    },
    {
      "Time_Start": 1189.44,
      "Time_End": 1196.32,
      "Text": " occurrence, which is services.exe. Now, in reality, you might have multiple processes creating that"
    },
    {
      "Time_Start": 1196.32,
      "Time_End": 1200.96,
      "Text": " services key. You could see PowerShell doing it. You could see registry.exe doing it. Maybe you see"
    },
    {
      "Time_Start": 1200.96,
      "Time_End": 1206.48,
      "Text": " regedit doing it. And maybe you see services.exe. And in that case, we would score all those"
    },
    {
      "Time_Start": 1206.48,
      "Time_End": 1212.8,
      "Text": " differently based on that inverse of the probability. And then we come to assumption number three. And"
    },
    {
      "Time_Start": 1212.8,
      "Time_End": 1217.52,
      "Text": " we're going to use a more advanced theory, which is Bayes' theorem. And so assumption number three"
    },
    {
      "Time_Start": 1217.52,
      "Time_End": 1222.32,
      "Text": " is auto start services are a malicious factor. With Bayes' theorem, essentially what we're going"
    },
    {
      "Time_Start": 1222.32,
      "Time_End": 1227.2,
      "Text": " to do is it relies on the prior validated information to make inferences about future"
    },
    {
      "Time_Start": 1227.2,
      "Time_End": 1233.04,
      "Text": " probability. So again, this is moving into that inferential statistic. The prior validated"
    },
    {
      "Time_Start": 1233.04,
      "Time_End": 1237.3600000000001,
      "Text": " information is the marginal probability that we can predict regardless of whether the service"
    },
    {
      "Time_Start": 1237.3600000000001,
      "Time_End": 1242.72,
      "Text": " is or is not malicious. So what this is doing is we're looking for a range. And we're going to"
    },
    {
      "Time_Start": 1242.72,
      "Time_End": 1246.96,
      "Text": " remove the question on whether or not this is malicious. And we're just going to rely on the"
    },
    {
      "Time_Start": 1246.96,
      "Time_End": 1253.2,
      "Text": " question of is this an anomaly. So here we have PA, which is the percentage of services that are"
    },
    {
      "Time_Start": 1253.2,
      "Time_End": 1258.48,
      "Text": " auto start type as compared to all services created in our data set. We have PB, which is"
    },
    {
      "Time_Start": 1258.48,
      "Time_End": 1262.32,
      "Text": " the number of service creations that have been determined to be malicious, which we're going to"
    },
    {
      "Time_Start": 1262.32,
      "Time_End": 1266.88,
      "Text": " remove from this equation, right? Because it's not that it's not important, but it's skewing our"
    },
    {
      "Time_Start": 1266.88,
      "Time_End": 1272.48,
      "Text": " results. So we have PA, which is the number of auto start services as compared to all services"
    },
    {
      "Time_Start": 1272.48,
      "Time_End": 1278.16,
      "Text": " created, which would equal 13 out of 52. We're going to use easy math to make this really simple."
    },
    {
      "Time_Start": 1278.16,
      "Time_End": 1284.0800000000002,
      "Text": " So 13 out of 52 services created were auto start type. That equals 25%. So based on this historical"
    },
    {
      "Time_Start": 1284.0800000000002,
      "Time_End": 1288.64,
      "Text": " data, we can say there's a 25% chance that a service will be auto start without knowing if"
    },
    {
      "Time_Start": 1288.64,
      "Time_End": 1292.0800000000002,
      "Text": " it is malicious or not. And that's okay. We don't need to necessarily know if it's malicious right"
    },
    {
      "Time_Start": 1292.0800000000002,
      "Time_End": 1298.0,
      "Text": " away. We can then do that statistical inference, and we can deduce the probability of data from"
    },
    {
      "Time_Start": 1298.0,
      "Time_End": 1303.44,
      "Text": " Bayes' theorem. Inference is basically just deducing probability distribution from a data,"
    },
    {
      "Time_Start": 1303.44,
      "Time_End": 1307.28,
      "Text": " and we're going to try to identify that marginal probability, that range."
    },
    {
      "Time_Start": 1308.16,
      "Time_End": 1313.04,
      "Text": " So once we've identified that range from highest to lowest, we've identified our range and we can"
    },
    {
      "Time_Start": 1313.04,
      "Time_End": 1318.56,
      "Text": " infer our probability to determine a score. And then finally, let's talk about measures of"
    },
    {
      "Time_Start": 1318.56,
      "Time_End": 1324.4,
      "Text": " position. It was that last descriptive statistic that I put on there. And this is kind of a unique"
    },
    {
      "Time_Start": 1324.4,
      "Time_End": 1329.2,
      "Text": " scenario. I personally don't run into this situation very, very often because I haven't"
    },
    {
      "Time_Start": 1329.2,
      "Time_End": 1335.44,
      "Text": " seen a lot of environments that have a scoring structure that has been up to date and kept up"
    },
    {
      "Time_Start": 1335.44,
      "Time_End": 1341.68,
      "Text": " to date long enough. But in this example, we're going to use that assumption number four, which"
    },
    {
      "Time_Start": 1341.68,
      "Time_End": 1347.44,
      "Text": " was the processes requesting to create services should normally be sc.exe. So for measures of"
    },
    {
      "Time_Start": 1347.44,
      "Time_End": 1351.44,
      "Text": " position, what we're going to do is we're going to identify the variances between multiple data"
    },
    {
      "Time_Start": 1351.44,
      "Time_End": 1357.2,
      "Text": " sets over a period of time, or we're going to identify the variances of one data set,"
    },
    {
      "Time_Start": 1357.2,
      "Time_End": 1365.3600000000001,
      "Text": " but multiple snapshots in time over a long period of time. So measures of position will identify"
    },
    {
      "Time_Start": 1365.3600000000001,
      "Time_End": 1372.0800000000002,
      "Text": " the information on average, dispersion, and shape. It'll also give the five numbers are the minimum,"
    },
    {
      "Time_Start": 1372.0800000000002,
      "Time_End": 1376.16,
      "Text": " the first quartile, the median, the third quartile, and then the maximum."
    },
    {
      "Time_Start": 1378.64,
      "Time_End": 1381.2,
      "Text": " All right, so again, that assumption number four is what we're going to use here. We've"
    },
    {
      "Time_Start": 1381.2,
      "Time_End": 1385.76,
      "Text": " determined that the deviation from baseline scores across many data sets from multiple"
    },
    {
      "Time_Start": 1385.76,
      "Time_End": 1392.0,
      "Text": " client environments that are specific snapshots in time within those data sets are concluded to"
    },
    {
      "Time_Start": 1392.0,
      "Time_End": 1398.0,
      "Text": " 14 scores that represent the deviational anomaly. So even though I've listed only five numbers up"
    },
    {
      "Time_Start": 1398.0,
      "Time_End": 1403.52,
      "Text": " here, know these numbers are derived from 14 scores. So using that information, we can plot"
    },
    {
      "Time_Start": 1403.52,
      "Time_End": 1408.96,
      "Text": " these five scores here, which are the minimum, the first quartile, the median, the third quartile,"
    },
    {
      "Time_Start": 1408.96,
      "Time_End": 1414.8799999999999,
      "Text": " and the maximum. We would then calculate the outliers. We're using a box graph. So when we're"
    },
    {
      "Time_Start": 1414.88,
      "Time_End": 1422.4,
      "Text": " using a box graph, the outliers fall beyond the location of the fences, which are located at 57"
    },
    {
      "Time_Start": 1422.4,
      "Time_End": 1428.3200000000002,
      "Text": " and 96. Since none of the numbers fall outside of that range, there is essentially no outliers in"
    },
    {
      "Time_Start": 1428.3200000000002,
      "Time_End": 1432.64,
      "Text": " the situation. If there were outliers in the situation, we would need to compute those outliers"
    },
    {
      "Time_Start": 1432.64,
      "Time_End": 1437.68,
      "Text": " and identify essentially what are the variances in that data set specifically that create those"
    },
    {
      "Time_Start": 1437.68,
      "Time_End": 1443.7600000000002,
      "Text": " outliers. We also find the mean of all five numbers, which is 75.64. But more importantly,"
    },
    {
      "Time_Start": 1443.76,
      "Time_End": 1449.44,
      "Text": " we identify that standard deviation as 12.39. We can take the standard deviation and try to"
    },
    {
      "Time_Start": 1449.44,
      "Time_End": 1454.16,
      "Text": " attempt to identify the marginal probability of the difference remaining constant across the data"
    },
    {
      "Time_Start": 1454.16,
      "Time_End": 1459.2,
      "Text": " pool. So we can try to identify that range that's different across the data pool. This deviation"
    },
    {
      "Time_Start": 1459.2,
      "Time_End": 1464.56,
      "Text": " can act as a flexible weight for our scoring. And it can also, in many cases, act as a standard"
    },
    {
      "Time_Start": 1464.56,
      "Time_End": 1470.8,
      "Text": " deviation proof of concept that we can identify when our scoring is basically out of control."
    },
    {
      "Time_Start": 1470.8,
      "Time_End": 1474.72,
      "Text": " And at that point, we can use this as an indicator that our scoring needs drastic tuning."
    },
    {
      "Time_Start": 1475.52,
      "Time_End": 1482.1599999999999,
      "Text": " All right. So once we've done our data analysis or our statistic-based analytics, we can then"
    },
    {
      "Time_Start": 1482.1599999999999,
      "Time_End": 1487.12,
      "Text": " identify the differences in that criteria. We must then identify the behavior relationships that"
    },
    {
      "Time_Start": 1487.12,
      "Time_End": 1491.84,
      "Text": " begin to form our empirical scoring. So the empirical score is derived from the evidence"
    },
    {
      "Time_Start": 1491.84,
      "Time_End": 1497.68,
      "Text": " of the statistic analysis. And the empirical scoring must be documented so that future analysts"
    },
    {
      "Time_Start": 1497.68,
      "Time_End": 1500.5600000000002,
      "Text": " can research, tune, and account for variance in that score."
    },
    {
      "Time_Start": 1502.72,
      "Time_End": 1507.6000000000001,
      "Text": " How do we prevent stagnating our conclusions? Empirical scoring requires constant testing to"
    },
    {
      "Time_Start": 1507.6000000000001,
      "Time_End": 1511.28,
      "Text": " validate our hypothesis and create those conclusions. We have to account for the"
    },
    {
      "Time_Start": 1511.28,
      "Time_End": 1515.44,
      "Text": " changes in environments, endpoint software, and processes and practices for our people"
    },
    {
      "Time_Start": 1515.44,
      "Time_End": 1519.44,
      "Text": " and that change over time. So ideally, this is where machine learning could be utilized to"
    },
    {
      "Time_Start": 1519.44,
      "Time_End": 1525.1200000000001,
      "Text": " validate those metrics and focus on those conclusions remaining the same, as well as"
    },
    {
      "Time_Start": 1525.1200000000001,
      "Time_End": 1530.3200000000002,
      "Text": " alert when those conclusions are then different. There is expected to be some margin of error."
    },
    {
      "Time_Start": 1530.3200000000002,
      "Time_End": 1534.64,
      "Text": " So there is the admissible decision role, which is a statistical understanding that there is no"
    },
    {
      "Time_Start": 1534.64,
      "Time_End": 1539.1200000000001,
      "Text": " better alternative to this. We're essentially doing the best that we can with our statistic"
    },
    {
      "Time_Start": 1539.1200000000001,
      "Time_End": 1544.0800000000002,
      "Text": " analysis. And our conclusions are the best based on our current tool set and our experience as"
    },
    {
      "Time_Start": 1544.0800000000002,
      "Time_End": 1548.48,
      "Text": " analysts. Speaking of experience of analysts, we often also consider that there is always going to"
    },
    {
      "Time_Start": 1548.48,
      "Time_End": 1553.7600000000002,
      "Text": " be some bias in our conclusion because defenders will always bring their experience to the table."
    },
    {
      "Time_Start": 1553.76,
      "Time_End": 1558.4,
      "Text": " And all analysts, regardless of how hard we try to rule out that bias, we must account for that"
    },
    {
      "Time_Start": 1558.4,
      "Time_End": 1563.28,
      "Text": " bias in some way. Generally, this is done with a margin of error. So we'll need to account for"
    },
    {
      "Time_Start": 1563.28,
      "Time_End": 1569.04,
      "Text": " our incomplete knowledge and that margin of error. And as soon as there is an outlier beyond that"
    },
    {
      "Time_Start": 1569.04,
      "Time_End": 1574.16,
      "Text": " margin of error, we then need to go back and validate our conclusions. All right. So I mentioned"
    },
    {
      "Time_Start": 1574.16,
      "Time_End": 1580.16,
      "Text": " Jared Atkinson and the funnel of fidelity. I mentioned Johnny Johnson in his GitHub. He has"
    },
    {
      "Time_Start": 1580.16,
      "Time_End": 1586.16,
      "Text": " on there his notebook projects, which are extremely useful tool, both in the research and"
    },
    {
      "Time_Start": 1586.16,
      "Time_End": 1590.5600000000002,
      "Text": " in actual client environments. And then I linked his research up there as well. And then finally,"
    },
    {
      "Time_Start": 1590.5600000000002,
      "Time_End": 1595.0400000000002,
      "Text": " there is my research for my post. And then I wanted to include some links that I used for"
    },
    {
      "Time_Start": 1595.0400000000002,
      "Time_End": 1600.24,
      "Text": " my statistical analysis. Most of these were derived of these examples that were in here."
    },
    {
      "Time_Start": 1600.24,
      "Time_End": 1604.3200000000002,
      "Text": " And that is it. I appreciate you attending my presentation. And I hope you were able to take"
    },
    {
      "Time_Start": 1604.32,
      "Time_End": 1617.12,
      "Text": " away some of these considerations into your own environment. I'll be here if you have any questions."
    }
  ]
}