{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 12.88,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I'm Paul Coggin. I'm from Huntsville, Alabama in the U.S. And so this"
    },
    {
      "Time_Start": 12.88,
      "Time_End": 21.02,
      "Text": " presentation we're going to dive into a broad set of topics related to"
    },
    {
      "Time_Start": 21.02,
      "Time_End": 29.2,
      "Text": " space and cybersecurity. When you start talking about space, one of the key"
    },
    {
      "Time_Start": 29.2,
      "Time_End": 36.08,
      "Text": " components is the ground systems. Think of a ground system as the kind of like"
    },
    {
      "Time_Start": 36.08,
      "Time_End": 41.8,
      "Text": " your NOC or your SOC in your enterprise network where you manage your"
    },
    {
      "Time_Start": 41.8,
      "Time_End": 46.120000000000005,
      "Text": " enterprise network infrastructure. Similar with space systems, they"
    },
    {
      "Time_Start": 46.120000000000005,
      "Time_End": 51.28,
      "Text": " have ground stations that will be spread out across the world so that you have"
    },
    {
      "Time_Start": 51.28,
      "Time_End": 57.879999999999995,
      "Text": " visibility no matter where your assets are in orbit. You have visibility and you"
    },
    {
      "Time_Start": 57.88,
      "Time_End": 62.040000000000006,
      "Text": " can communicate with your assets and you can download information from the"
    },
    {
      "Time_Start": 62.040000000000006,
      "Time_End": 67.8,
      "Text": " from the payload as well as be able to send commands to the payload and to the"
    },
    {
      "Time_Start": 67.8,
      "Time_End": 73.2,
      "Text": " spacecraft itself. And in this example we're showing a ground station network"
    },
    {
      "Time_Start": 73.2,
      "Time_End": 81.68,
      "Text": " for NASA. But other other space systems constellations will have a ground"
    },
    {
      "Time_Start": 81.68,
      "Time_End": 88.08000000000001,
      "Text": " station network similar to this. But the big trend, everyone's talking about a"
    },
    {
      "Time_Start": 88.08000000000001,
      "Time_End": 94.44000000000001,
      "Text": " public cloud these days. Well also with space, space is utilizing the public"
    },
    {
      "Time_Start": 94.44000000000001,
      "Time_End": 100.88000000000001,
      "Text": " cloud. There's a leaf space out of Italy. Kubos who's got a application called"
    },
    {
      "Time_Start": 100.88000000000001,
      "Time_End": 108.52000000000001,
      "Text": " Major Tom that is hosted in Amazon AWS. Amazon is offering space ground station"
    },
    {
      "Time_Start": 108.52,
      "Time_End": 113.11999999999999,
      "Text": " services in the cloud where you can outsource the ground station to Amazon"
    },
    {
      "Time_Start": 113.11999999999999,
      "Time_End": 117.8,
      "Text": " where they have the antenna spread across geographic locations, their data"
    },
    {
      "Time_Start": 117.8,
      "Time_End": 122.64,
      "Text": " centers, so that you don't have to go build a large ground station network and"
    },
    {
      "Time_Start": 122.64,
      "Time_End": 126.19999999999999,
      "Text": " you can just outsource to them. Microsoft Azure has their orbit"
    },
    {
      "Time_Start": 126.19999999999999,
      "Time_End": 133.28,
      "Text": " service as well. And my understanding is Google is doing similarly for SpaceX"
    },
    {
      "Time_Start": 133.36,
      "Time_End": 143.56,
      "Text": " Starlink's project. So space is moving to the cloud. And also similarly it's not"
    },
    {
      "Time_Start": 143.56,
      "Time_End": 149.28,
      "Text": " real surprising that space providers are using infrastructure in the public"
    },
    {
      "Time_Start": 149.28,
      "Time_End": 155.12,
      "Text": " cloud. But what really surprised me is I started digging into space technologies"
    },
    {
      "Time_Start": 155.12,
      "Time_End": 161.12,
      "Text": " is that space is actually moving, that the cloud is actually moving to space in"
    },
    {
      "Time_Start": 161.16,
      "Time_End": 167.48000000000002,
      "Text": " some cases where vendors such as Leo cloud, new startups like Leo cloud are"
    },
    {
      "Time_Start": 167.48000000000002,
      "Time_End": 172.0,
      "Text": " actually going to put cloud infrastructure on their satellites in"
    },
    {
      "Time_Start": 172.0,
      "Time_End": 178.84,
      "Text": " space so that the say the image processing that is happening in space"
    },
    {
      "Time_Start": 178.84,
      "Time_End": 182.8,
      "Text": " where there's all kinds of imaging and data being gathered can be pre-processed"
    },
    {
      "Time_Start": 182.8,
      "Time_End": 187.4,
      "Text": " in space and then sent back down to earth as needed instead of having to"
    },
    {
      "Time_Start": 187.4,
      "Time_End": 191.32,
      "Text": " send everything. They're going to have data center capabilities in space to"
    },
    {
      "Time_Start": 191.32,
      "Time_End": 195.12,
      "Text": " provide all kinds of different services which is going to generate a lot of"
    },
    {
      "Time_Start": 195.12,
      "Time_End": 200.32,
      "Text": " interesting scenarios and questions for the cybersecurity industry with all"
    },
    {
      "Time_Start": 200.32,
      "Time_End": 207.0,
      "Text": " those assets going up into space. Something I was gonna make you aware of, a big"
    },
    {
      "Time_Start": 207.0,
      "Time_End": 212.36,
      "Text": " problem with with space is there is radiation and I'm going to go deeper"
    },
    {
      "Time_Start": 212.36,
      "Time_End": 218.32000000000002,
      "Text": " into this. And so there's companies that are coming out with new technologies to"
    },
    {
      "Time_Start": 218.32000000000002,
      "Time_End": 224.56,
      "Text": " support the data centers moving to space with like Roman out of Israel who's"
    },
    {
      "Time_Start": 224.56,
      "Time_End": 228.68,
      "Text": " created like a terabyte hard drive that's hardened for the harsh environment"
    },
    {
      "Time_Start": 228.68,
      "Time_End": 233.60000000000002,
      "Text": " of space. So this is that this is this market is really developing quickly to"
    },
    {
      "Time_Start": 233.60000000000002,
      "Time_End": 237.24,
      "Text": " support this. And what really got my attention here recently as I was"
    },
    {
      "Time_Start": 237.24,
      "Time_End": 243.20000000000002,
      "Text": " preparing this presentation is they're also now there's a startup is looking at"
    },
    {
      "Time_Start": 243.20000000000002,
      "Time_End": 250.44,
      "Text": " actually putting data centers on the moon in lava tunnels possibly on the"
    },
    {
      "Time_Start": 250.44,
      "Time_End": 258.0,
      "Text": " moon. So that's good so so the cloud is definitely moving to space quickly. And"
    },
    {
      "Time_Start": 258.0,
      "Time_End": 264.0,
      "Text": " there's one more example of NTT by a telecommunications company out of Japan"
    },
    {
      "Time_Start": 264.0,
      "Time_End": 268.16,
      "Text": " and they're they're planning on building a constellation and the"
    },
    {
      "Time_Start": 268.16,
      "Time_End": 272.84,
      "Text": " different satellites will have storage capabilities similar to your data center"
    },
    {
      "Time_Start": 272.84,
      "Time_End": 277.44,
      "Text": " on on earth. But they're gonna have that on their satellites and then they're"
    },
    {
      "Time_Start": 277.44,
      "Time_End": 280.24,
      "Text": " going to be interconnected there's gonna be a large network interconnected with"
    },
    {
      "Time_Start": 280.24,
      "Time_End": 284.96,
      "Text": " lasers free space optics. So it's gonna be a large network just like what we"
    },
    {
      "Time_Start": 284.96,
      "Time_End": 288.72,
      "Text": " have here on the ground but it's all going to be up in space. So this quick"
    },
    {
      "Time_Start": 288.72,
      "Time_End": 293.2,
      "Text": " this market is quickly evolving and then it goes like I said it's going to bring"
    },
    {
      "Time_Start": 293.2,
      "Time_End": 297.56,
      "Text": " in a lot of new questions about cybersecurity. You know how are we going"
    },
    {
      "Time_Start": 297.56,
      "Time_End": 303.52,
      "Text": " to deal with incident response, forensics, recovery, denial of service, lots of"
    },
    {
      "Time_Start": 303.52,
      "Time_End": 308.24,
      "Text": " different scenarios as all of those networks that we're used to being having"
    },
    {
      "Time_Start": 308.24,
      "Time_End": 315.52,
      "Text": " on the ground or moving up up to space. Now we're getting to space depending on"
    },
    {
      "Time_Start": 315.52,
      "Time_End": 323.03999999999996,
      "Text": " the application it could be running the satellites like one web the SpaceX star"
    },
    {
      "Time_Start": 323.16,
      "Time_End": 328.32,
      "Text": " link those those satellites are typically running at Leo in low-earth"
    },
    {
      "Time_Start": 328.32,
      "Time_End": 335.48,
      "Text": " orbit. Now your cable TV and a lot of your telecommunications satellites"
    },
    {
      "Time_Start": 335.48,
      "Time_End": 339.92,
      "Text": " they're typically in geo where in Leo those satellites are in low-earth orbit"
    },
    {
      "Time_Start": 339.92,
      "Time_End": 344.12,
      "Text": " they're they're revolving around the earth around about every four hours"
    },
    {
      "Time_Start": 344.12,
      "Time_End": 349.48,
      "Text": " they're they're making a an orbit around the earth with geo those satellites are"
    },
    {
      "Time_Start": 349.48,
      "Time_End": 354.8,
      "Text": " fixed and they're they're pinpointed they're pointed to follow the earth's"
    },
    {
      "Time_Start": 354.8,
      "Time_End": 358.48,
      "Text": " rotation so they're always pointing at the same place on the earth with your"
    },
    {
      "Time_Start": 358.48,
      "Time_End": 362.6,
      "Text": " geo so that's that we're very familiar with for telecommunications but what"
    },
    {
      "Time_Start": 362.6,
      "Time_End": 367.32,
      "Text": " you're hearing about in the news so much lately is with one web and SpaceX etc as"
    },
    {
      "Time_Start": 367.32,
      "Time_End": 375.68,
      "Text": " the Leo orbits. Now from a threat standpoint from a cybersecurity and just"
    },
    {
      "Time_Start": 375.68,
      "Time_End": 381.44,
      "Text": " physical kinetic threats the the American scientists the Federation of"
    },
    {
      "Time_Start": 381.44,
      "Time_End": 386.16,
      "Text": " American scientists have defined like five major categories of threats to"
    },
    {
      "Time_Start": 386.16,
      "Time_End": 390.68,
      "Text": " space you have deception where you know someone's going to mess with you think"
    },
    {
      "Time_Start": 390.68,
      "Time_End": 395.08,
      "Text": " about like spoofing GPS there's a lot of information out there now in the news"
    },
    {
      "Time_Start": 395.08,
      "Time_End": 401.8,
      "Text": " about AIS information that the ships use to know their location GPS GNSS here in"
    },
    {
      "Time_Start": 401.8,
      "Time_End": 407.44,
      "Text": " Europe being spoofed temporary disruption may be like electronic"
    },
    {
      "Time_Start": 407.44,
      "Time_End": 414.2,
      "Text": " warfare where someone turns on a radio frequency jammer where the signal is"
    },
    {
      "Time_Start": 414.2,
      "Time_End": 420.24,
      "Text": " jammed temporarily as soon as the power is removed the signal is restored that"
    },
    {
      "Time_Start": 420.24,
      "Time_End": 425.64,
      "Text": " would you know some disruption or it could be that there's a denial a service"
    },
    {
      "Time_Start": 425.64,
      "Time_End": 430.32,
      "Text": " where someone's goes and saturates the link somehow and in a degradation could"
    },
    {
      "Time_Start": 430.32,
      "Time_End": 436.59999999999997,
      "Text": " be they maybe they're using a laser or something to that's actually damaged the"
    },
    {
      "Time_Start": 436.59999999999997,
      "Time_End": 442.0,
      "Text": " satellite in you know or complete destruction because there's been a lot"
    },
    {
      "Time_Start": 442.0,
      "Time_End": 445.56,
      "Text": " of that in the news lately like a missile test against the satellite to"
    },
    {
      "Time_Start": 445.56,
      "Time_End": 449.32,
      "Text": " blow the satellite up and then creates a debris field which creates the concern"
    },
    {
      "Time_Start": 449.32,
      "Time_End": 453.32,
      "Text": " of what we call Kessler syndrome where there could be a chain reaction of"
    },
    {
      "Time_Start": 453.32,
      "Time_End": 458.0,
      "Text": " debris hitting debris or other space assets and it causes the chain reaction"
    },
    {
      "Time_Start": 458.0,
      "Time_End": 461.92,
      "Text": " to work to the point that space is no longer usable because of the debris"
    },
    {
      "Time_Start": 461.92,
      "Time_End": 467.96,
      "Text": " field in some of the threads some of them are reversible like I've mentioned"
    },
    {
      "Time_Start": 467.96,
      "Time_End": 473.6,
      "Text": " the electronic warfare you turn on the signal you turn on the jammer it and it"
    },
    {
      "Time_Start": 473.6,
      "Time_End": 479.52,
      "Text": " affects the system you remove the power and it'll go away all the way to two"
    },
    {
      "Time_Start": 479.52,
      "Time_End": 486.04,
      "Text": " threads like a missile hitting a rocket and blowing it up and in that case it"
    },
    {
      "Time_Start": 486.04,
      "Time_End": 490.84000000000003,
      "Text": " would be non-reversible and then with cyber it could be reversible or"
    },
    {
      "Time_Start": 490.84000000000003,
      "Time_End": 495.04,
      "Text": " non-reversible depending on the type of attack but but speaking of the"
    },
    {
      "Time_Start": 495.04,
      "Time_End": 498.52000000000004,
      "Text": " non-reversible just wanted to as I was researching this I wanted to bring this"
    },
    {
      "Time_Start": 498.52000000000004,
      "Time_End": 506.0,
      "Text": " out of some examples of some kinetic attacks back in the 70s I thought it was"
    },
    {
      "Time_Start": 506.0,
      "Time_End": 511.72,
      "Text": " interesting to learn that in the 70s that one of the space station Alma that"
    },
    {
      "Time_Start": 511.72,
      "Time_End": 516.5600000000001,
      "Text": " the Soviet Union had actually had a machine gun on it a cannon 23 millimeter"
    },
    {
      "Time_Start": 516.5600000000001,
      "Time_End": 520.12,
      "Text": " cannon I thought that was really interested and there's there's talk"
    },
    {
      "Time_Start": 520.12,
      "Time_End": 524.08,
      "Text": " about you know war in space a lot these days well this is a satellite that the"
    },
    {
      "Time_Start": 524.08,
      "Time_End": 527.48,
      "Text": " French are looking at building it's actually going to either have a"
    },
    {
      "Time_Start": 527.48,
      "Time_End": 534.72,
      "Text": " submachine gun or lasers on it so real interesting but but we're talking about"
    },
    {
      "Time_Start": 534.72,
      "Time_End": 539.4,
      "Text": " cyber and focusing on cybersecurity for this talk and with the cybersecurity the"
    },
    {
      "Time_Start": 539.4,
      "Time_End": 542.1999999999999,
      "Text": " issues we're looking at are jamming which is gonna be like electronic"
    },
    {
      "Time_Start": 542.1999999999999,
      "Time_End": 546.24,
      "Text": " warfare it's gonna be your radio frequency malware we'll get into some"
    },
    {
      "Time_Start": 546.24,
      "Time_End": 550.84,
      "Text": " examples of malware in space spoofing we mentioned earlier like GPS and GNSS"
    },
    {
      "Time_Start": 550.84,
      "Time_End": 559.16,
      "Text": " spoofing the timing capability GPS capability you're the control system for"
    },
    {
      "Time_Start": 559.16,
      "Time_End": 564.28,
      "Text": " the satellite targeting the payload system for the satellite maybe hacking"
    },
    {
      "Time_Start": 564.28,
      "Time_End": 569.48,
      "Text": " eavesdropping in the eavesdropping it's easier to do than you may realize because"
    },
    {
      "Time_Start": 569.48,
      "Time_End": 573.12,
      "Text": " a lot we have a lot of examples of this a lot of a lot of the satellite"
    },
    {
      "Time_Start": 573.12,
      "Time_End": 579.8,
      "Text": " communications are not encrypted though we assume it's encrypted it's not in"
    },
    {
      "Time_Start": 579.8,
      "Time_End": 585.24,
      "Text": " many many cases it's not I'm going to give a lot of examples it's a from a"
    },
    {
      "Time_Start": 585.24,
      "Time_End": 588.1,
      "Text": " threat standpoint there's a lot of different threats we could be a nation"
    },
    {
      "Time_Start": 588.1,
      "Time_End": 592.88,
      "Text": " state could be military could be Intel they're going to have you know a lot"
    },
    {
      "Time_Start": 592.88,
      "Time_End": 598.56,
      "Text": " more sophisticated capabilities to come at your system with and then all the all"
    },
    {
      "Time_Start": 598.56,
      "Time_End": 603.92,
      "Text": " the way down to a more unsophisticated users they may be just eavesdropping it"
    },
    {
      "Time_Start": 603.92,
      "Time_End": 609.28,
      "Text": " doesn't it doesn't take a whole lot of funding to go get a couple go get to get"
    },
    {
      "Time_Start": 609.28,
      "Time_End": 613.96,
      "Text": " the equipment needed to just passively eavesdrop on unencrypted satellite"
    },
    {
      "Time_Start": 613.96,
      "Time_End": 620.72,
      "Text": " traffic when I was talking about cybersecurity problems especially from"
    },
    {
      "Time_Start": 620.72,
      "Time_End": 627.8000000000001,
      "Text": " an offensive standpoint I like to do tag trees so real high-level strategy"
    },
    {
      "Time_Start": 627.8000000000001,
      "Time_End": 632.24,
      "Text": " for the attack tree might be to go if you're looking at somebody's going after"
    },
    {
      "Time_Start": 632.24,
      "Time_End": 636.4,
      "Text": " a satellite system I'd be to go after the ground station as an insider threat"
    },
    {
      "Time_Start": 636.4,
      "Time_End": 642.72,
      "Text": " or try to figure out how to get through the VPN firewall like in the case of"
    },
    {
      "Time_Start": 642.72,
      "Time_End": 647.32,
      "Text": " what happened with bias sat here recently somebody got into the ground"
    },
    {
      "Time_Start": 647.32,
      "Time_End": 652.32,
      "Text": " the the ground system that controlled the user terminals then there's a"
    },
    {
      "Time_Start": 652.32,
      "Time_End": 657.6400000000001,
      "Text": " scenario of a sat-to-sat that right now are everything I can see with sat-to-sat"
    },
    {
      "Time_Start": 657.6400000000001,
      "Time_End": 662.08,
      "Text": " is all theoretical nothing there's nothing that I've been able to read out"
    },
    {
      "Time_Start": 662.08,
      "Time_End": 667.6,
      "Text": " in the press no books or papers that go into real-world examples of sat-to-sat"
    },
    {
      "Time_Start": 667.6,
      "Time_End": 671.1600000000001,
      "Text": " but it's probably something that we'll see in the future and there's the"
    },
    {
      "Time_Start": 671.1600000000001,
      "Time_End": 675.0400000000001,
      "Text": " possibility especially with the lack of strong encryption it could be that"
    },
    {
      "Time_Start": 675.04,
      "Time_End": 679.8,
      "Text": " someone could go and stand up their own ground station and try to communicate"
    },
    {
      "Time_Start": 679.8,
      "Time_End": 686.8399999999999,
      "Text": " with your satellite if they if they have the resources and so so here's an"
    },
    {
      "Time_Start": 686.8399999999999,
      "Time_End": 690.5999999999999,
      "Text": " example up you know but a few years ago everybody was talking about Stuxnet and"
    },
    {
      "Time_Start": 690.5999999999999,
      "Time_End": 694.9599999999999,
      "Text": " as I was working on doing this research I found it really interesting they're"
    },
    {
      "Time_Start": 694.9599999999999,
      "Time_End": 700.4,
      "Text": " apparently at a Black Hat someone published that not only did Stuxnet go"
    },
    {
      "Time_Start": 700.4,
      "Time_End": 705.92,
      "Text": " and spread around the around the globe but it also apparently was able to"
    },
    {
      "Time_Start": 705.92,
      "Time_End": 711.4,
      "Text": " affect a satellite for a cable TV operator in India for the INSAT-4B"
    },
    {
      "Time_Start": 711.4,
      "Time_End": 718.1999999999999,
      "Text": " satellite apparently somehow the Stuxnet malware got into the ground station and"
    },
    {
      "Time_Start": 718.1999999999999,
      "Time_End": 724.16,
      "Text": " was able to go and spread to to the INSAT-4B satellite and what I gather"
    },
    {
      "Time_Start": 724.16,
      "Time_End": 729.16,
      "Text": " looking researching online is it might look it appears that the Siemens PLC"
    },
    {
      "Time_Start": 729.16,
      "Time_End": 734.68,
      "Text": " might have been used to control the solar panels on the satellite and so it"
    },
    {
      "Time_Start": 734.68,
      "Time_End": 739.3199999999999,
      "Text": " was able to that malware was able to disable the satellite so that it no"
    },
    {
      "Time_Start": 739.3199999999999,
      "Time_End": 744.76,
      "Text": " longer responded and in the cable TV company in India it is said lost her"
    },
    {
      "Time_Start": 744.76,
      "Time_End": 750.28,
      "Text": " satellite because there because of the solar panels no longer responded so"
    },
    {
      "Time_Start": 750.28,
      "Time_End": 756.52,
      "Text": " that's one issue now this is the this is all in the news here lately about the"
    },
    {
      "Time_Start": 756.52,
      "Time_End": 761.8,
      "Text": " solar storms coming from the Sun there's all these cosmic rays that are"
    },
    {
      "Time_Start": 761.8,
      "Time_End": 768.8,
      "Text": " coming out of the Sun with protons and ions that are come that are headed"
    },
    {
      "Time_Start": 768.8,
      "Time_End": 773.1999999999999,
      "Text": " toward the earth that can cause all kinds of disruptions with the power grid"
    },
    {
      "Time_Start": 773.1999999999999,
      "Time_End": 779.1999999999999,
      "Text": " I read an article where up in up here in northern Europe that there was problems"
    },
    {
      "Time_Start": 779.1999999999999,
      "Time_End": 785.48,
      "Text": " with with some train stations where the solar storms are sending so much so many"
    },
    {
      "Time_Start": 785.48,
      "Time_End": 791.08,
      "Text": " particles to the earth that it was causing disruption with the trains with"
    },
    {
      "Time_Start": 791.08,
      "Time_End": 796.76,
      "Text": " the signaling where there may not be a train on the tracks but because of the"
    },
    {
      "Time_Start": 796.76,
      "Time_End": 802.52,
      "Text": " particles the ions being sent to the earth from the Sun it was causing the"
    },
    {
      "Time_Start": 802.52,
      "Time_End": 805.76,
      "Text": " signaling to believe that there was actually a train on the tracks when"
    },
    {
      "Time_Start": 805.76,
      "Time_End": 812.12,
      "Text": " there wasn't but but it could cause all kinds of disruptions all this these"
    },
    {
      "Time_Start": 812.2,
      "Time_End": 816.6,
      "Text": " particles coming in from the Sun especially in space and I've kind of a"
    },
    {
      "Time_Start": 816.6,
      "Time_End": 822.28,
      "Text": " term did a Einstein denial of service because that's what E equal MC square"
    },
    {
      "Time_Start": 822.28,
      "Time_End": 827.6,
      "Text": " his equation he's so famous for is defined for is to define the energy of"
    },
    {
      "Time_Start": 827.6,
      "Time_End": 834.08,
      "Text": " the mass in the speed which is the speed of light square of the particles that"
    },
    {
      "Time_Start": 834.08,
      "Time_End": 843.5200000000001,
      "Text": " are heading out into the solar system sourced from the Sun now this these"
    },
    {
      "Time_Start": 843.5200000000001,
      "Time_End": 848.8000000000001,
      "Text": " solar storms these cosmic rays these ions and particles that are flying"
    },
    {
      "Time_Start": 848.8000000000001,
      "Time_End": 854.84,
      "Text": " through space that's reason that a lot of the spacecraft are not using"
    },
    {
      "Time_Start": 854.84,
      "Time_End": 861.2800000000001,
      "Text": " encryption because if they if because if they want to use encryption whoever the"
    },
    {
      "Time_Start": 861.28,
      "Time_End": 864.76,
      "Text": " designers the manufacturers of the spacecraft would have to go use"
    },
    {
      "Time_Start": 864.76,
      "Time_End": 868.8,
      "Text": " radiation hardened equipment they would have to spend a lot more money hardening"
    },
    {
      "Time_Start": 868.8,
      "Time_End": 873.16,
      "Text": " that equipment to survive the hostile environment of space and the last thing"
    },
    {
      "Time_Start": 873.16,
      "Time_End": 878.8,
      "Text": " you want to do is put a satellite in space or spacecraft in space you didn't"
    },
    {
      "Time_Start": 878.8,
      "Time_End": 884.0,
      "Text": " spend the money up front to get it hardened against the radiation and all"
    },
    {
      "Time_Start": 884.0,
      "Time_End": 890.48,
      "Text": " the particles that are against sent through the the galaxy through space and"
    },
    {
      "Time_Start": 890.48,
      "Time_End": 897.4,
      "Text": " and have disruptions of your encryption because what happens there's a specifically"
    },
    {
      "Time_Start": 897.4,
      "Time_End": 901.72,
      "Text": " the ion charges it could go when it hits those elect hits the electronics on"
    },
    {
      "Time_Start": 901.72,
      "Time_End": 905.68,
      "Text": " spacecraft it can only it could just take one particle and it calls was what"
    },
    {
      "Time_Start": 905.68,
      "Time_End": 910.96,
      "Text": " they call it a single event upset and it'll flip a bit in the electronics and"
    },
    {
      "Time_Start": 910.96,
      "Time_End": 914.32,
      "Text": " if you're doing encryption it'll mess up all that King and then you're gonna"
    },
    {
      "Time_Start": 914.32,
      "Time_End": 917.72,
      "Text": " lose your connection and you're going you're gonna lose your contact with the"
    },
    {
      "Time_Start": 917.72,
      "Time_End": 922.8000000000001,
      "Text": " the payload as well as you're gonna lose your control of the spacecraft and so"
    },
    {
      "Time_Start": 922.8000000000001,
      "Time_End": 928.32,
      "Text": " you got to go and wait for that that it for that system to reestablish resync"
    },
    {
      "Time_Start": 928.32,
      "Time_End": 932.9200000000001,
      "Text": " the encryption so that you can log back into your system again so that's the"
    },
    {
      "Time_Start": 932.9200000000001,
      "Time_End": 937.64,
      "Text": " reason a lot of the spacecraft if they don't go through the expense if they"
    },
    {
      "Time_Start": 937.64,
      "Time_End": 940.52,
      "Text": " don't go through the expense of getting the radiation hardening they're gonna"
    },
    {
      "Time_Start": 940.52,
      "Time_End": 944.68,
      "Text": " they're not going to use encryption because they'll lose they'll lose"
    },
    {
      "Time_Start": 944.68,
      "Time_End": 954.6,
      "Text": " control of their satellite and so here's an example here's an example of a"
    },
    {
      "Time_Start": 954.6,
      "Time_End": 961.64,
      "Text": " satellite that was not encrypted and some apparently some ham radio operators"
    },
    {
      "Time_Start": 961.64,
      "Time_End": 967.52,
      "Text": " some smart innovative folks discovered that the satellite was not encrypting"
    },
    {
      "Time_Start": 967.52,
      "Time_End": 972.52,
      "Text": " was open in Brazil and they started using an open satellite for their"
    },
    {
      "Time_Start": 972.52,
      "Time_End": 977.56,
      "Text": " communication purposes were like CB radio and and at one point they arrested"
    },
    {
      "Time_Start": 977.56,
      "Time_End": 981.4,
      "Text": " 39 people across six states in Brazil and by the time they got through"
    },
    {
      "Time_Start": 981.4,
      "Time_End": 986.12,
      "Text": " arresting everybody and trying to get them off of that satellite that they"
    },
    {
      "Time_Start": 986.12,
      "Time_End": 989.56,
      "Text": " were illegally using other people were using that satellite you know because"
    },
    {
      "Time_Start": 989.56,
      "Time_End": 992.4399999999999,
      "Text": " once you get up in space it's kind of hard to go up there and start adding you"
    },
    {
      "Time_Start": 992.4399999999999,
      "Time_End": 996.48,
      "Text": " know bolting and encryption and security on to the spacecraft after the fact"
    },
    {
      "Time_Start": 996.48,
      "Time_End": 1000.76,
      "Text": " kind of like down here on there it's hard to go and secure it after the fact"
    },
    {
      "Time_Start": 1000.76,
      "Time_End": 1007.9200000000001,
      "Text": " another famous example is proving the point that a lot of the satellite"
    },
    {
      "Time_Start": 1007.9200000000001,
      "Time_End": 1013.12,
      "Text": " communications are not encrypted is the turtle of malware command control where"
    },
    {
      "Time_Start": 1013.12,
      "Time_End": 1020.12,
      "Text": " where the malware would infect an end-user and and then send out"
    },
    {
      "Time_Start": 1020.12,
      "Time_End": 1026.08,
      "Text": " communications to IP addresses that were being spoofed in satellite network"
    },
    {
      "Time_Start": 1026.1599999999999,
      "Time_End": 1032.96,
      "Text": " footprints across southern Europe and North Africa and so the malware would"
    },
    {
      "Time_Start": 1032.96,
      "Time_End": 1038.0,
      "Text": " get infected it was it would phone home to some spoofed IP address it was in in"
    },
    {
      "Time_Start": 1038.0,
      "Time_End": 1044.04,
      "Text": " some for some satellite user IP address it was being spoofed and then once they"
    },
    {
      "Time_Start": 1044.04,
      "Time_End": 1048.96,
      "Text": " got they received the handshake the notification then they would go and use"
    },
    {
      "Time_Start": 1048.96,
      "Time_End": 1055.04,
      "Text": " a landline connection to establish the two-way sim commands back to whoever was"
    },
    {
      "Time_Start": 1055.04,
      "Time_End": 1060.44,
      "Text": " infected and so again this would not be happening the spoofing would not work if"
    },
    {
      "Time_Start": 1060.44,
      "Time_End": 1067.6,
      "Text": " they were using encryption again I this is a calling out a scenario that right"
    },
    {
      "Time_Start": 1067.6,
      "Time_End": 1072.1599999999999,
      "Text": " now is is theoretical but it's something to keep out there in mind another reason"
    },
    {
      "Time_Start": 1072.1599999999999,
      "Time_End": 1076.52,
      "Text": " to go and harden these systems design security into these new space systems"
    },
    {
      "Time_Start": 1076.52,
      "Time_End": 1080.76,
      "Text": " what they're calling space 2.0 that's happening in the world economy right now"
    },
    {
      "Time_Start": 1080.76,
      "Time_End": 1086.08,
      "Text": " to build it in build into cybersecurity initially is because at some point not"
    },
    {
      "Time_Start": 1086.08,
      "Time_End": 1091.0,
      "Text": " only could there be ground to satellite attacks but but there could be vectors"
    },
    {
      "Time_Start": 1091.0,
      "Time_End": 1098.08,
      "Text": " evolve where it could go sat to sat either over RF or possibly optics it's"
    },
    {
      "Time_Start": 1098.08,
      "Time_End": 1102.48,
      "Text": " gonna be a lot harder to do that with with optics but certainly possible with"
    },
    {
      "Time_Start": 1102.48,
      "Time_End": 1111.64,
      "Text": " RF here's a real-world example of a satellite that was taking taking control"
    },
    {
      "Time_Start": 1111.64,
      "Time_End": 1119.1200000000001,
      "Text": " of but there's a US German satellite called Rosette and someone that got"
    },
    {
      "Time_Start": 1119.1200000000001,
      "Time_End": 1126.48,
      "Text": " control of it and they were able to to point it at the sign and and get the"
    },
    {
      "Time_Start": 1126.48,
      "Time_End": 1136.2,
      "Text": " sound to the point that the satellite was disabled and no longer of use then"
    },
    {
      "Time_Start": 1136.2,
      "Time_End": 1142.3600000000001,
      "Text": " there there's the Landsat 7 satellite it was a it was taking control of twice"
    },
    {
      "Time_Start": 1142.3600000000001,
      "Time_End": 1149.1200000000001,
      "Text": " back in 2007 and 2008 two different times that satellite was accessed and"
    },
    {
      "Time_Start": 1149.1200000000001,
      "Time_End": 1153.4,
      "Text": " according to what's out out on the internet when those satellites were when"
    },
    {
      "Time_Start": 1153.5600000000002,
      "Time_End": 1159.88,
      "Text": " I was taking control of whoever the actor was they got control but they they"
    },
    {
      "Time_Start": 1159.88,
      "Time_End": 1164.64,
      "Text": " did not go and utilize the access that they had my what I read between the"
    },
    {
      "Time_Start": 1164.64,
      "Time_End": 1170.44,
      "Text": " lines in it is probably kind of like a Windows person getting a shell on a"
    },
    {
      "Time_Start": 1170.44,
      "Time_End": 1176.2800000000002,
      "Text": " Unix box they they got access they got a shell but they know Windows and they"
    },
    {
      "Time_Start": 1176.2800000000002,
      "Time_End": 1183.0,
      "Text": " don't know Unix so what are you going to do so who and so the so the people who"
    },
    {
      "Time_Start": 1183.0,
      "Time_End": 1186.64,
      "Text": " manage and operate the satellite were able to recover and get back control of"
    },
    {
      "Time_Start": 1186.64,
      "Time_End": 1190.16,
      "Text": " their satellite on two different occasions because whoever got access"
    },
    {
      "Time_Start": 1190.16,
      "Time_End": 1195.52,
      "Text": " didn't know what they were doing you know it's kind of like me getting into a"
    },
    {
      "Time_Start": 1195.52,
      "Time_End": 1201.76,
      "Text": " VMS box I wouldn't know what I was doing"
    },
    {
      "Time_Start": 1203.08,
      "Time_End": 1211.0,
      "Text": " similarly there's a Terra satellite it was also compromised in 2008 June 2008"
    },
    {
      "Time_Start": 1211.0,
      "Time_End": 1215.64,
      "Text": " and October 2008 very similarly it was accessed twice and whoever the users are"
    },
    {
      "Time_Start": 1215.64,
      "Time_End": 1223.32,
      "Text": " they had they had the privileged access but again the owners of the satellites"
    },
    {
      "Time_Start": 1223.32,
      "Time_End": 1227.56,
      "Text": " were able to kick them off the satellite they did not go and do anything with"
    },
    {
      "Time_Start": 1227.56,
      "Time_End": 1231.76,
      "Text": " their access but they did have control they did they they were able to get in"
    },
    {
      "Time_Start": 1231.76,
      "Time_End": 1235.28,
      "Text": " kind of like I said yeah they got the shell but they didn't know what to do"
    },
    {
      "Time_Start": 1235.28,
      "Time_End": 1238.64,
      "Text": " with it once they got there so that's my that's my perception of the research"
    },
    {
      "Time_Start": 1238.64,
      "Time_End": 1245.24,
      "Text": " I've done it's bad guys being bad guys what you know they're typically they're"
    },
    {
      "Time_Start": 1245.24,
      "Time_End": 1249.5600000000002,
      "Text": " gonna start escalating privilege and spreading influence right so so the"
    },
    {
      "Time_Start": 1249.5600000000002,
      "Time_End": 1254.3600000000001,
      "Text": " analogy in my mind I keep going back to is is the Windows hacker with a shell on"
    },
    {
      "Time_Start": 1254.3600000000001,
      "Time_End": 1261.76,
      "Text": " a Unix box it's gonna be a long it's gonna be a long project go ahead to get"
    },
    {
      "Time_Start": 1261.76,
      "Time_End": 1266.48,
      "Text": " the books out and then and when you get into these satellites there's some other"
    },
    {
      "Time_Start": 1266.48,
      "Time_End": 1270.84,
      "Text": " research I've done there is a large number of operating systems there's a"
    },
    {
      "Time_Start": 1270.84,
      "Time_End": 1276.4,
      "Text": " large number of command languages and there's a long list of protocols that"
    },
    {
      "Time_Start": 1276.4,
      "Time_End": 1281.0,
      "Text": " they use so what would you end up with one things I perceive is kind of a"
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1286.0,
      "Text": " security by obscurity because because you might you got to know you might need"
    },
    {
      "Time_Start": 1286.0,
      "Time_End": 1289.56,
      "Text": " to know the operating system they'd know the command languages etc and that"
    },
    {
      "Time_Start": 1289.56,
      "Time_End": 1295.04,
      "Text": " probably is buying the the owners of the system some time so that they can get"
    },
    {
      "Time_Start": 1295.04,
      "Time_End": 1298.1599999999999,
      "Text": " controlled back of the satellite because a lot of these satellites have"
    },
    {
      "Time_Start": 1298.1599999999999,
      "Time_End": 1304.0,
      "Text": " what the feature called watchdog so that it can restore itself at a certain point"
    },
    {
      "Time_Start": 1304.0,
      "Time_End": 1308.76,
      "Text": " if there's some activities that the satellite doesn't respond something's"
    },
    {
      "Time_Start": 1308.76,
      "Time_End": 1313.08,
      "Text": " weird going on with it maybe if there's just a general issue of kind of the"
    },
    {
      "Time_Start": 1313.08,
      "Time_End": 1317.76,
      "Text": " watchdog monitoring I'm just I'm thinking might have been in these cases"
    },
    {
      "Time_Start": 1317.76,
      "Time_End": 1320.76,
      "Text": " might have just rebooted the satellite or something to kick the bad guys off"
    },
    {
      "Time_Start": 1320.92,
      "Time_End": 1327.0,
      "Text": " I'm totally speculating but just based on what I'm reading then again in 2014"
    },
    {
      "Time_Start": 1327.0,
      "Time_End": 1331.4,
      "Text": " there was a satellite a weather satellite they got hacked and we got"
    },
    {
      "Time_Start": 1331.4,
      "Time_End": 1338.84,
      "Text": " back control of it but but they got access of that as well now this is one"
    },
    {
      "Time_Start": 1338.84,
      "Time_End": 1344.72,
      "Text": " that's really interested me there's a the apparently the Brits have the"
    },
    {
      "Time_Start": 1344.72,
      "Time_End": 1350.92,
      "Text": " military has some satellites they have four of them called sky net and"
    },
    {
      "Time_Start": 1350.92,
      "Time_End": 1356.1200000000001,
      "Text": " apparently someone got access to one of the satellites and held it for ransom in"
    },
    {
      "Time_Start": 1356.1200000000001,
      "Time_End": 1360.76,
      "Text": " 1999 I found that really interesting can you can't hope you can't open your email"
    },
    {
      "Time_Start": 1360.76,
      "Time_End": 1364.72,
      "Text": " open a browser these days without reading something about ransomware"
    },
    {
      "Time_Start": 1364.72,
      "Time_End": 1369.08,
      "Text": " attacks well this wasn't a malware ransomware attack but somebody was able"
    },
    {
      "Time_Start": 1369.08,
      "Time_End": 1380.08,
      "Text": " to get into that into the satellite and held it for ransom apparently now also"
    },
    {
      "Time_Start": 1380.08,
      "Time_End": 1385.12,
      "Text": " on the space station there's been two documented events of on space station"
    },
    {
      "Time_Start": 1385.12,
      "Time_End": 1391.8799999999999,
      "Text": " where a thumb drive and a laptop were accidentally introduced malware on to"
    },
    {
      "Time_Start": 1391.8799999999999,
      "Time_End": 1397.28,
      "Text": " the International Space Station now it was not introduced into the flight"
    },
    {
      "Time_Start": 1397.28,
      "Time_End": 1400.8799999999999,
      "Text": " control system of space station where it would threaten the lives of the"
    },
    {
      "Time_Start": 1400.8799999999999,
      "Time_End": 1404.96,
      "Text": " astronauts or the with the mission system but apparently got into some"
    },
    {
      "Time_Start": 1404.96,
      "Time_End": 1410.72,
      "Text": " network on the system service there's two cases that are documented of malware"
    },
    {
      "Time_Start": 1410.72,
      "Time_End": 1418.56,
      "Text": " being introduced to space station we were talking we're having some"
    },
    {
      "Time_Start": 1418.56,
      "Time_End": 1424.32,
      "Text": " conversations earlier about insider trust some of us and and this ago this"
    },
    {
      "Time_Start": 1424.32,
      "Time_End": 1429.8799999999999,
      "Text": " goes back to you know this everyone gets vetted everyone you know supposed"
    },
    {
      "Time_Start": 1429.8799999999999,
      "Time_End": 1434.3999999999999,
      "Text": " to be supposed to be a good person that we trust to have access into our data"
    },
    {
      "Time_Start": 1434.3999999999999,
      "Time_End": 1439.48,
      "Text": " centers under our enterprise networks work in our socks work in our network"
    },
    {
      "Time_Start": 1439.48,
      "Time_End": 1445.24,
      "Text": " operation centers and you know how the the physical access and badge access to"
    },
    {
      "Time_Start": 1445.24,
      "Time_End": 1450.6799999999998,
      "Text": " our data centers and stuff well the same thing with these ground stations got a"
    },
    {
      "Time_Start": 1450.68,
      "Time_End": 1456.4,
      "Text": " we got to you know monitor everyone's roles and responsibilities and our"
    },
    {
      "Time_Start": 1456.4,
      "Time_End": 1460.0800000000002,
      "Text": " access to the network and and not just leave all the ports open on these"
    },
    {
      "Time_Start": 1460.0800000000002,
      "Time_End": 1465.64,
      "Text": " networks and control access to what can be plugged into our networks because in"
    },
    {
      "Time_Start": 1465.64,
      "Time_End": 1470.6000000000001,
      "Text": " this case someone apparently found an open network connection and was able to"
    },
    {
      "Time_Start": 1470.6000000000001,
      "Time_End": 1480.5600000000002,
      "Text": " stick a Raspberry Pi on the network for a period and and steal data so now"
    },
    {
      "Time_Start": 1481.12,
      "Time_End": 1486.84,
      "Text": " it's not all just a wild wild west out there there is international committees"
    },
    {
      "Time_Start": 1486.84,
      "Time_End": 1493.96,
      "Text": " groups that do meet from Europe the US Japan from around countries around the"
    },
    {
      "Time_Start": 1493.96,
      "Time_End": 1498.72,
      "Text": " world that are meeting to come up with how the protocols should work how"
    },
    {
      "Time_Start": 1498.72,
      "Time_End": 1502.8,
      "Text": " encryption should work what are the best practice for what are the best practices"
    },
    {
      "Time_Start": 1502.8,
      "Time_End": 1507.0,
      "Text": " for space architectures you know the European Space Agency NASA all of these"
    },
    {
      "Time_Start": 1507.12,
      "Time_End": 1511.0,
      "Text": " different organizations the commercial organizations they all work together and"
    },
    {
      "Time_Start": 1511.0,
      "Time_End": 1515.64,
      "Text": " come up with these standards it's just it's like security in the enterprise"
    },
    {
      "Time_Start": 1515.64,
      "Time_End": 1518.96,
      "Text": " there's a whole lot of standards out there getting created by the ITU and I"
    },
    {
      "Time_Start": 1518.96,
      "Time_End": 1525.4,
      "Text": " Tripoli IETF etc but you know we got to follow them and implement them and so"
    },
    {
      "Time_Start": 1525.4,
      "Time_End": 1528.64,
      "Text": " there's some of the documentation that's out there that's international"
    },
    {
      "Time_Start": 1528.64,
      "Time_End": 1533.72,
      "Text": " standards for security and best practices out there up there now this is"
    },
    {
      "Time_Start": 1533.72,
      "Time_End": 1539.52,
      "Text": " a pretty comprehensive list of what I've been able to find thus far best"
    },
    {
      "Time_Start": 1539.52,
      "Time_End": 1548.84,
      "Text": " practices for securing space systems the there's NIST a lot of a lot of people in"
    },
    {
      "Time_Start": 1548.84,
      "Time_End": 1552.44,
      "Text": " the international community follow NIST for best practices and standards this"
    },
    {
      "Time_Start": 1552.44,
      "Time_End": 1559.48,
      "Text": " past year they've released 80 the NIST 8401 and NIST 8270 documents for"
    },
    {
      "Time_Start": 1559.6,
      "Time_End": 1569.64,
      "Text": " securing space systems there's the CISA the SEC they've all have best practice"
    },
    {
      "Time_Start": 1569.64,
      "Time_End": 1576.88,
      "Text": " standards and here just recently like in the last two weeks I've discovered that"
    },
    {
      "Time_Start": 1576.88,
      "Time_End": 1583.04,
      "Text": " Germany is also released best practices for securing space systems there's a lot"
    },
    {
      "Time_Start": 1583.04,
      "Time_End": 1588.04,
      "Text": " of there's a lot of best practices and guidelines that have been released for"
    },
    {
      "Time_Start": 1588.04,
      "Time_End": 1592.36,
      "Text": " how to secure the spacecraft and the ground systems the key is going to be is"
    },
    {
      "Time_Start": 1592.36,
      "Time_End": 1595.96,
      "Text": " reviewing those best practices and getting them turned into policy and then"
    },
    {
      "Time_Start": 1595.96,
      "Time_End": 1604.36,
      "Text": " let that drive our systems engineering and design of these systems but the"
    },
    {
      "Time_Start": 1604.36,
      "Time_End": 1610.2,
      "Text": " guidelines are out there some of the thoughts that I have after doing all"
    },
    {
      "Time_Start": 1610.2,
      "Time_End": 1615.48,
      "Text": " this research is you know the drum and everyone's beating these days is the"
    },
    {
      "Time_Start": 1615.48,
      "Time_End": 1618.6,
      "Text": " DevSecOps and type take all these standards like we just had listed and"
    },
    {
      "Time_Start": 1618.6,
      "Time_End": 1622.72,
      "Text": " build that into our processes when we're writing our doing our initial systems"
    },
    {
      "Time_Start": 1622.72,
      "Time_End": 1626.48,
      "Text": " engineering and creating our requirements and monitoring our supply"
    },
    {
      "Time_Start": 1626.48,
      "Time_End": 1630.68,
      "Text": " chain because we get this we get the spacecraft up in space and somebody's"
    },
    {
      "Time_Start": 1630.68,
      "Time_End": 1635.52,
      "Text": " embedded some bad firmware we got we get some hot firmware and somewhere in that"
    },
    {
      "Time_Start": 1635.52,
      "Time_End": 1640.4,
      "Text": " supply chain it's gonna be hard to go and fix it flash the EEPROM once it's up"
    },
    {
      "Time_Start": 1640.4,
      "Time_End": 1645.1200000000001,
      "Text": " in space you know or fix an operating system now one of the things that's"
    },
    {
      "Time_Start": 1645.1200000000001,
      "Time_End": 1649.0800000000002,
      "Text": " really of interest to me is is some of us were talking last night and earlier"
    },
    {
      "Time_Start": 1649.0800000000002,
      "Time_End": 1654.7600000000002,
      "Text": " today is a lot of the satellites now the new technology a lot of people are"
    },
    {
      "Time_Start": 1654.7600000000002,
      "Time_End": 1659.1200000000001,
      "Text": " talking about is a software-defined satellite where containers and virtual"
    },
    {
      "Time_Start": 1659.1200000000001,
      "Time_End": 1664.0400000000002,
      "Text": " machines are being used on the technology being used on the satellites"
    },
    {
      "Time_Start": 1664.0400000000002,
      "Time_End": 1668.7600000000002,
      "Text": " and that's going to open up a whole new domain of capabilities and verse and"
    },
    {
      "Time_Start": 1668.76,
      "Time_End": 1676.36,
      "Text": " features for not only unique payloads but also for security because when we"
    },
    {
      "Time_Start": 1676.36,
      "Time_End": 1680.04,
      "Text": " get containers and virtual machines going why can we not go and add a"
    },
    {
      "Time_Start": 1680.04,
      "Time_End": 1684.6,
      "Text": " virtual machine or containers for security monitoring because we're adding"
    },
    {
      "Time_Start": 1684.6,
      "Time_End": 1692.12,
      "Text": " we're getting all this new storage like I showed earlier and so maybe we could"
    },
    {
      "Time_Start": 1692.12,
      "Time_End": 1696.8799999999999,
      "Text": " go and start adding intrusion prevention systems adding machine learning and AI"
    },
    {
      "Time_Start": 1696.88,
      "Time_End": 1701.68,
      "Text": " to monitor the commands and the behavior of the satellite and if we if"
    },
    {
      "Time_Start": 1701.68,
      "Time_End": 1705.0800000000002,
      "Text": " we sense that somebody's doing something nefarious to our satellite there's some"
    },
    {
      "Time_Start": 1705.0800000000002,
      "Time_End": 1711.4,
      "Text": " suspicious happening we can restore to a known good container or known good VM and"
    },
    {
      "Time_Start": 1711.4,
      "Time_End": 1716.5600000000002,
      "Text": " monitor monitor our all the commands that are being sent to us and if"
    },
    {
      "Time_Start": 1716.5600000000002,
      "Time_End": 1720.7600000000002,
      "Text": " somebody's sending thing commands out of order commands that we are not expecting"
    },
    {
      "Time_Start": 1720.76,
      "Time_End": 1730.04,
      "Text": " maybe that could could trigger a reconfiguration of the system this is"
    },
    {
      "Time_Start": 1730.04,
      "Time_End": 1736.84,
      "Text": " where I'm going next with the research it is looking at building out a cyber"
    },
    {
      "Time_Start": 1736.84,
      "Time_End": 1741.36,
      "Text": " range myself a space cyber range here's some tools that are free if you're"
    },
    {
      "Time_Start": 1741.36,
      "Time_End": 1746.76,
      "Text": " interested in space and you want to do a deeper dive in and and learn and learn"
    },
    {
      "Time_Start": 1746.76,
      "Time_End": 1755.64,
      "Text": " satellites the orbit the ground systems NASA who in the US is our government"
    },
    {
      "Time_Start": 1755.64,
      "Time_End": 1761.04,
      "Text": " agency that manages space systems for the US kind of like the European Space"
    },
    {
      "Time_Start": 1761.04,
      "Time_End": 1767.36,
      "Text": " Agency here in Europe they've released the NASA core flight system that is a"
    },
    {
      "Time_Start": 1767.36,
      "Time_End": 1773.8799999999999,
      "Text": " CubeSat software system that actually flies on CubeSats you could use Cosmos"
    },
    {
      "Time_Start": 1774.0,
      "Time_End": 1779.3200000000002,
      "Text": " from ball aerospace to act like a ground station and NASA's also released the 42"
    },
    {
      "Time_Start": 1779.3200000000002,
      "Time_End": 1787.0400000000002,
      "Text": " space simulator that will model the the orbit for your satellites so you could"
    },
    {
      "Time_Start": 1787.0400000000002,
      "Time_End": 1791.5200000000002,
      "Text": " run it all in VMs on your laptop and then there's another CubeSat that NASA's"
    },
    {
      "Time_Start": 1791.5200000000002,
      "Time_End": 1798.4,
      "Text": " released called NOS 3 NOS 3 that you may find interesting in there's a some other"
    },
    {
      "Time_Start": 1798.4,
      "Time_End": 1802.8400000000001,
      "Text": " open source project open source projects called Artemis and Sat Nogs I would"
    },
    {
      "Time_Start": 1802.8400000000001,
      "Time_End": 1808.6000000000001,
      "Text": " encourage you to look at and one it's popped on my radar here recently is"
    },
    {
      "Time_Start": 1808.6000000000001,
      "Time_End": 1816.96,
      "Text": " Icarus. Icarus is a tool that's out on github. Icarus was designed to model"
    },
    {
      "Time_Start": 1816.96,
      "Time_End": 1823.4,
      "Text": " simulate constellations like Starlink and OneWeb so you can go in and model"
    },
    {
      "Time_Start": 1823.4,
      "Time_End": 1829.8400000000001,
      "Text": " and simulate for different satellite constellations like DDoS type stuff and"
    },
    {
      "Time_Start": 1830.16,
      "Time_End": 1835.8000000000002,
      "Text": " that Icarus framework is open source so that's another good tool to go look at"
    },
    {
      "Time_Start": 1835.8000000000002,
      "Time_End": 1840.68,
      "Text": " if you want to dig into and learn more about space."
    }
  ]
}