{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 16.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Alright, off we go. So, hello all. My name is Mariusz and I'm a Red Teamer back in ING."
    },
    {
      "Time_Start": 16.0,
      "Time_End": 22.16,
      "Text": " We are doing this like global Red Team engagements and therefore we have collected a bunch of"
    },
    {
      "Time_Start": 22.16,
      "Time_End": 29.88,
      "Text": " tricks that were useful during our endeavors and as well as since I'm especially inclined"
    },
    {
      "Time_Start": 29.88,
      "Time_End": 35.12,
      "Text": " towards the malware because I used to analyze and dissect malware samples as well as write"
    },
    {
      "Time_Start": 35.12,
      "Time_End": 40.82,
      "Text": " my own. Therefore, I am more interested in devising malware stuff so I would like to"
    },
    {
      "Time_Start": 40.82,
      "Time_End": 46.4,
      "Text": " share with you a little bit of tricks and tactics that we could use malware wise towards"
    },
    {
      "Time_Start": 46.4,
      "Time_End": 52.879999999999995,
      "Text": " increasing our chances during the Red Team operations that we'll be having. So, what"
    },
    {
      "Time_Start": 52.88,
      "Time_End": 60.56,
      "Text": " we'll be sharing today is a few tricks about the phishing as well as how can we approach"
    },
    {
      "Time_Start": 60.56,
      "Time_End": 68.52000000000001,
      "Text": " the initial access stage in the more highly secure environments as well as a little"
    },
    {
      "Time_Start": 68.52000000000001,
      "Time_End": 76.28,
      "Text": " more into the evasion ideas. Because, as we might imagine, the evasion is really important"
    },
    {
      "Time_Start": 76.32000000000001,
      "Time_End": 84.56,
      "Text": " in order to survive the multiple stages of detection and sensing dodgy stuff. Therefore,"
    },
    {
      "Time_Start": 84.56,
      "Time_End": 92.8,
      "Text": " we might want to cover some of the more recent ideas how to combat them. And, as a disclaimer,"
    },
    {
      "Time_Start": 92.8,
      "Time_End": 99.16,
      "Text": " of course, there are no fancy new tactics in this talk. We've got a bunch of stuff that we"
    },
    {
      "Time_Start": 99.16,
      "Time_End": 104.6,
      "Text": " use and keep privately low-profile so that we can operate still within our networks. But,"
    },
    {
      "Time_Start": 104.60000000000001,
      "Time_End": 113.96000000000001,
      "Text": " among the things that I can show to you today, we'll be covering a few ideas that are already"
    },
    {
      "Time_Start": 113.96000000000001,
      "Time_End": 122.20000000000002,
      "Text": " quite known but yet can be still weaponized and used during the engagement. So, one of the tricks"
    },
    {
      "Time_Start": 122.20000000000002,
      "Time_End": 127.52000000000001,
      "Text": " that we really like abusing is to use the legitimate third-party services, such as,"
    },
    {
      "Time_Start": 127.52000000000001,
      "Time_End": 134.48000000000002,
      "Text": " for instance, LinkedIn, and abuse them to smuggle the URLs so that the employees who are not that"
    },
    {
      "Time_Start": 134.51999999999998,
      "Time_End": 143.23999999999998,
      "Text": " sensitive about conversating with the mind-like experts from all around the world are more inclined"
    },
    {
      "Time_Start": 143.23999999999998,
      "Time_End": 149.12,
      "Text": " into opening, actually, this kind of stuff. So, smuggling the malicious payloads within the"
    },
    {
      "Time_Start": 149.12,
      "Time_End": 155.44,
      "Text": " attachments is no more a viable approach towards targeting companies because the email scanning"
    },
    {
      "Time_Start": 155.44,
      "Time_End": 161.2,
      "Text": " systems are so good at detecting dodgy stuff within the attachments. Therefore, we would"
    },
    {
      "Time_Start": 161.20000000000002,
      "Time_End": 166.8,
      "Text": " consider to just sticking away from the attachments-based malware and sticking more"
    },
    {
      "Time_Start": 166.8,
      "Time_End": 178.32000000000002,
      "Text": " into the URLs. And URLs have this little bit of a problem for the security scanning and the proxies"
    },
    {
      "Time_Start": 178.32000000000002,
      "Time_End": 184.44000000000003,
      "Text": " and systems because it's hard to tell the intention of the landing page that the user is about to hit."
    },
    {
      "Time_Start": 185.04,
      "Time_End": 192.64,
      "Text": " So, there's very hard logic to be implemented towards sensing whether the URL attached to the"
    },
    {
      "Time_Start": 192.64,
      "Time_End": 198.56,
      "Text": " email is going to be dodgy or not. And among the other tricks that we might chain altogether"
    },
    {
      "Time_Start": 198.56,
      "Time_End": 203.52,
      "Text": " within the email or the conversation that we'll be trying to develop are the things like the"
    },
    {
      "Time_Start": 203.52,
      "Time_End": 208.88,
      "Text": " right-to-left-over-right trick, which still works quite nice during the most recent times,"
    },
    {
      "Time_Start": 209.04,
      "Time_End": 215.32,
      "Text": " even though that was designed or devised 10 or 20 years ago. So, it still keeps on giving."
    },
    {
      "Time_Start": 215.32,
      "Time_End": 225.88,
      "Text": " And also, we consider that these little bit of not so developed phishing ideas for just firing"
    },
    {
      "Time_Start": 225.88,
      "Time_End": 232.51999999999998,
      "Text": " a single email and forgetting about it and just waiting for the user to get infected are no more"
    },
    {
      "Time_Start": 232.76000000000002,
      "Time_End": 239.8,
      "Text": " so much successful anymore because users are not so much inclined into clicking on the very"
    },
    {
      "Time_Start": 239.8,
      "Time_End": 246.96,
      "Text": " first email that they have received from this particular sender. In order to better understand"
    },
    {
      "Time_Start": 246.96,
      "Time_End": 253.24,
      "Text": " what we are dealing with while we are delivering the email message, we came to the effort to just"
    },
    {
      "Time_Start": 253.24,
      "Time_End": 259.28000000000003,
      "Text": " actually send hundreds of emails towards the Office 365 email scanning system, the Microsoft"
    },
    {
      "Time_Start": 259.28000000000003,
      "Time_End": 267.44000000000005,
      "Text": " Defender for Office 365, and we've been trying to conclude what were the SMTP headers getting back"
    },
    {
      "Time_Start": 267.44000000000005,
      "Time_End": 275.16,
      "Text": " to us when we're trying to analyse and examine the results during our internal analysis efforts. And"
    },
    {
      "Time_Start": 275.16,
      "Time_End": 285.52000000000004,
      "Text": " we came to the observation that there were more than 20 SMTP threat rules and rule numbers that"
    },
    {
      "Time_Start": 285.56,
      "Time_End": 294.59999999999997,
      "Text": " we could actually, with a great deal of certainty, establish that the rules are getting back to these"
    },
    {
      "Time_Start": 294.59999999999997,
      "Time_End": 302.53999999999996,
      "Text": " particular observations related to the emails. So, for instance, having the sole existence of the"
    },
    {
      "Time_Start": 302.53999999999996,
      "Time_End": 311.59999999999997,
      "Text": " A URL within the mail is going to trigger back on a single anti-spam or threat rule,"
    },
    {
      "Time_Start": 312.20000000000005,
      "Time_End": 319.44,
      "Text": " so we could just imagine, but there are a bunch of others that will be hitting back on our emails"
    },
    {
      "Time_Start": 319.44,
      "Time_End": 327.40000000000003,
      "Text": " that we could be aware of, so I think that this is a valuable idea to try to learn how our mails"
    },
    {
      "Time_Start": 327.40000000000003,
      "Time_End": 333.96000000000004,
      "Text": " are getting scanned and what engrams are being extracted out from our emails. And then, before"
    },
    {
      "Time_Start": 333.96000000000004,
      "Time_End": 339.6,
      "Text": " we actually deliver something, we could be applying this idea of linting our phishing emails before we"
    },
    {
      "Time_Start": 339.6,
      "Time_End": 346.96000000000004,
      "Text": " actually fire them away. And by the linting, we mean to have a couple of safe checks implemented"
    },
    {
      "Time_Start": 346.96000000000004,
      "Time_End": 353.36,
      "Text": " within our scriptings. So, for instance, stuff like how many URL parameters are there in the"
    },
    {
      "Time_Start": 353.36,
      "Time_End": 360.12,
      "Text": " URL that we are about to attach into the email message. This is the concept that still matters,"
    },
    {
      "Time_Start": 360.12,
      "Time_End": 366.40000000000003,
      "Text": " because we have observed, just let me get back to the previous slide, we have observed by going"
    },
    {
      "Time_Start": 366.52000000000004,
      "Time_End": 372.64000000000004,
      "Text": " through all of these rules that there were some rules that were like more rules being provided"
    },
    {
      "Time_Start": 372.64000000000004,
      "Time_End": 378.76000000000005,
      "Text": " back to us when we provided the URL containing multiple get parameters, whereas while we kept"
    },
    {
      "Time_Start": 378.76000000000005,
      "Time_End": 387.04,
      "Text": " it short, lean, and mean, quite concise URL, it will get back with less amount of anti-spam rules"
    },
    {
      "Time_Start": 387.04,
      "Time_End": 392.64000000000004,
      "Text": " in SMTP headers. Therefore, we concluded that we would be better off with keeping our URLs nice"
    },
    {
      "Time_Start": 393.03999999999996,
      "Time_End": 400.8,
      "Text": " and tidy. And among the other tricks that we found is that there has to be HTML smuggling"
    },
    {
      "Time_Start": 400.8,
      "Time_End": 407.24,
      "Text": " involved when we're targeting Office 365 environments, because just simply pointing"
    },
    {
      "Time_Start": 407.24,
      "Time_End": 413.2,
      "Text": " towards the file would obviously get that file being fetched by the automated sandboxing mechanism,"
    },
    {
      "Time_Start": 413.2,
      "Time_End": 420.0,
      "Text": " and therefore it might get detonated and, of course, burned before we even reach out to the"
    },
    {
      "Time_Start": 420.04,
      "Time_End": 430.0,
      "Text": " very first employee that we try to target. So, well, stating the obvious, we cannot have this"
    },
    {
      "Time_Start": 430.0,
      "Time_End": 436.92,
      "Text": " kind of bad smells within our URLs, so just like pointing to, directly pointing to the extension,"
    },
    {
      "Time_Start": 436.92,
      "Time_End": 443.52,
      "Text": " because obviously the automated, and especially during the machine learning times, automated"
    },
    {
      "Time_Start": 443.52,
      "Time_End": 448.56,
      "Text": " models are going to be very sensitive about it, therefore we are applying this idea of linting"
    },
    {
      "Time_Start": 448.6,
      "Time_End": 453.72,
      "Text": " our phishing mails before we actually fire them away, so that we won't be living this kind of"
    },
    {
      "Time_Start": 453.72,
      "Time_End": 461.12,
      "Text": " smelly traces. And among the others, what we found is that, for instance, even such an idea"
    },
    {
      "Time_Start": 461.12,
      "Time_End": 469.32,
      "Text": " of embedding images and encoded within the base 64 blobs within the HTML is going to impact the"
    },
    {
      "Time_Start": 469.32,
      "Time_End": 477.08,
      "Text": " number of anti-spam rules being matched on our email, so we found that it's so much easier and"
    },
    {
      "Time_Start": 477.12,
      "Time_End": 484.32,
      "Text": " so much safer to just point to the remotely hosted images while still risking the notion that the"
    },
    {
      "Time_Start": 484.32,
      "Time_End": 489.08,
      "Text": " employee might not enable fetching remote resources. We are okay with that, as well as"
    },
    {
      "Time_Start": 489.08,
      "Time_End": 497.28,
      "Text": " trying to maybe attach them to the email, just as we are attaching the images within the signature."
    },
    {
      "Time_Start": 497.6,
      "Time_End": 507.28000000000003,
      "Text": " So, the base 64 is a not-so-stable approach to go about designing HTMLs, and it might be a little"
    },
    {
      "Time_Start": 507.28000000000003,
      "Time_End": 512.8000000000001,
      "Text": " bit hard to explain, but what we found during our trials and errors was that this convoluted"
    },
    {
      "Time_Start": 512.8000000000001,
      "Time_End": 519.2,
      "Text": " approach of free next-hop servers targeting the Office 365 environments worked the best for us."
    },
    {
      "Time_Start": 519.2,
      "Time_End": 523.88,
      "Text": " So, the first one will be having this go phish on the EC2 instance, then there is going to be"
    },
    {
      "Time_Start": 524.2,
      "Time_End": 535.4,
      "Text": " a vanilla, empty EC2 redirector that just pushes on behalf of SoCat all the emails targeting the"
    },
    {
      "Time_Start": 535.4,
      "Time_End": 543.16,
      "Text": " 557 TCP port, and then redirecting them away to the SMTP, which is a high-reputational,"
    },
    {
      "Time_Start": 543.16,
      "Time_End": 550.28,
      "Text": " well-trusted mail delivery system. And therefore, Office 365 will just send back all the way to the"
    },
    {
      "Time_Start": 550.28,
      "Time_End": 557.4399999999999,
      "Text": " very beginning on the received service examination. So, it will sense that, okay,"
    },
    {
      "Time_Start": 557.4399999999999,
      "Time_End": 561.56,
      "Text": " this is the SMTP, and this is the Gmail that provided me that email, and Gmail is going to"
    },
    {
      "Time_Start": 561.56,
      "Time_End": 567.68,
      "Text": " do the same about our vanilla EC2 instance, and it's not going to send anything dodgy about it,"
    },
    {
      "Time_Start": 567.68,
      "Time_End": 578.88,
      "Text": " because the IP points back to the AWS and states, therefore, this might be a well-trusted IP pool,"
    },
    {
      "Time_Start": 579.0,
      "Time_End": 585.4,
      "Text": " so Gmail may be not so picky about it, and therefore, we can deliver the emails to the"
    },
    {
      "Time_Start": 585.4,
      "Time_End": 589.88,
      "Text": " Office 365. At least, this is what we are speculating how this might work, because obviously,"
    },
    {
      "Time_Start": 589.88,
      "Time_End": 595.24,
      "Text": " it's like a black box, therefore, we cannot be sure. Also, what we observed is that after"
    },
    {
      "Time_Start": 595.24,
      "Time_End": 601.84,
      "Text": " delivering this fourth of five emails, Defender is going to cool down on us, but then after waiting"
    },
    {
      "Time_Start": 601.84,
      "Time_End": 607.2,
      "Text": " a few hours, we'll be able to bring back on the same domain that we used to deliver these first"
    },
    {
      "Time_Start": 607.2800000000001,
      "Time_End": 613.08,
      "Text": " emails. Now, with regards to the initial access, there are a few approaches that still work,"
    },
    {
      "Time_Start": 613.08,
      "Time_End": 619.88,
      "Text": " and of course, this is very, very highly environment, as well as company-independent,"
    },
    {
      "Time_Start": 619.88,
      "Time_End": 624.44,
      "Text": " therefore, some of the tricks might work for your environment, whereas they won't work for ours,"
    },
    {
      "Time_Start": 624.44,
      "Time_End": 633.12,
      "Text": " so the gift that keeps on giving is the idea to fish to persist instead of fishing to access,"
    },
    {
      "Time_Start": 633.12,
      "Time_End": 639.4,
      "Text": " and there was this very nicely put up the article coming from MatHand from Spector Ops,"
    },
    {
      "Time_Start": 639.4,
      "Time_End": 645.6,
      "Text": " which is exactly described what we were thinking about for the past months, but we couldn't just"
    },
    {
      "Time_Start": 645.6,
      "Time_End": 651.72,
      "Text": " put up in this elegant words, wording as he did, so for instance, it's so much better,"
    },
    {
      "Time_Start": 651.72,
      "Time_End": 657.84,
      "Text": " it's so much more reliable to just drop the DLL into a very specific sweet spot and have that DLL"
    },
    {
      "Time_Start": 657.84,
      "Time_End": 664.8000000000001,
      "Text": " follow the proxying or the side-loading idea, so for instance, we could very easily weaponize"
    },
    {
      "Time_Start": 664.8000000000001,
      "Time_End": 672.24,
      "Text": " the side-loading against Teams, where we can just easily find that Teams is trying to load up the"
    },
    {
      "Time_Start": 672.24,
      "Time_End": 679.12,
      "Text": " version DLL coming out from its Microsoft Teams directory within the local app data, therefore,"
    },
    {
      "Time_Start": 679.12,
      "Time_End": 686.48,
      "Text": " we can easily craft our own dodgy DLL and just persist from inside of the VBScript or the VBA,"
    },
    {
      "Time_Start": 686.64,
      "Time_End": 694.48,
      "Text": " just easily while still the chaining the file right and exact steps. Yeah, so I wouldn't be"
    },
    {
      "Time_Start": 694.48,
      "Time_End": 700.6800000000001,
      "Text": " so inclined into using the typical Windows script host kind of file vectors, things like HDAs,"
    },
    {
      "Time_Start": 700.6800000000001,
      "Time_End": 710.2,
      "Text": " JScripts and VBScripts used to work for many years, but now, when we have the era of very"
    },
    {
      "Time_Start": 710.24,
      "Time_End": 716.88,
      "Text": " aggressively configured EDRs or EPP products, as well as proxies, that even tries to pull the,"
    },
    {
      "Time_Start": 716.88,
      "Time_End": 722.6,
      "Text": " to extract the files and pass them to the automated detonation environments,"
    },
    {
      "Time_Start": 722.6,
      "Time_End": 731.4000000000001,
      "Text": " so that we can just briefly mention about the Zscaler, who is having this like Apex sandbox"
    },
    {
      "Time_Start": 731.4000000000001,
      "Time_End": 738.84,
      "Text": " bundle within it, so some of the proxy systems are very aggressive towards the files, therefore,"
    },
    {
      "Time_Start": 739.0,
      "Time_End": 746.1600000000001,
      "Text": " using that kind of all the vectors might not be reliable for our highly scrutinized environments."
    },
    {
      "Time_Start": 746.1600000000001,
      "Time_End": 752.2800000000001,
      "Text": " So, for instance, oh, well, obviously, transmitting the executable ones to just MSC,"
    },
    {
      "Time_Start": 752.2800000000001,
      "Time_End": 760.0,
      "Text": " MSI files installation and installations systems, as well as executables just simply exist. Well,"
    },
    {
      "Time_Start": 760.0,
      "Time_End": 765.88,
      "Text": " however, this was convenient for a pretty long time, it's not much more and reliable as we can"
    },
    {
      "Time_Start": 765.88,
      "Time_End": 771.4399999999999,
      "Text": " already know it, and there was this very nice research coming from George and Konstantinos"
    },
    {
      "Time_Start": 771.4399999999999,
      "Time_End": 780.2,
      "Text": " back maybe a year or two years ago, and they have described this very nice and hefty ideas"
    },
    {
      "Time_Start": 780.2,
      "Time_End": 786.84,
      "Text": " for bypassing specific products, and we've been trying to, we've been heavily utilizing their"
    },
    {
      "Time_Start": 786.84,
      "Time_End": 793.92,
      "Text": " outcomes, and what we can, for instance, say here, that some of the executable files will just slip"
    },
    {
      "Time_Start": 793.96,
      "Time_End": 799.84,
      "Text": " through the product because of some unknown reasons, and this is exactly the same for the"
    },
    {
      "Time_Start": 799.84,
      "Time_End": 807.8000000000001,
      "Text": " CrowdStrike, which is known to be susceptible to having the CPL files, and the CPL file is just a"
    },
    {
      "Time_Start": 807.8000000000001,
      "Time_End": 813.9200000000001,
      "Text": " simple DLL that exposes merely a single export, and also there is this idea that we shouldn't be"
    },
    {
      "Time_Start": 813.9200000000001,
      "Time_End": 821.0000000000001,
      "Text": " reliable on having plain DLLs, having this the malicious code within the DLL main is going to"
    },
    {
      "Time_Start": 821.04,
      "Time_End": 825.4,
      "Text": " cause us a lot of problems because of the loader lock issues, therefore you might be better off"
    },
    {
      "Time_Start": 825.4,
      "Time_End": 832.04,
      "Text": " finding primitives to run your dodgy code from the exported functionality instead of DLL main,"
    },
    {
      "Time_Start": 832.04,
      "Time_End": 839.28,
      "Text": " because you'll be experiencing this undefined, unpredictable behaviors when you try to load"
    },
    {
      "Time_Start": 839.28,
      "Time_End": 843.08,
      "Text": " your shellcode from inside of the DLL main, just because of this loader lock issues, therefore"
    },
    {
      "Time_Start": 843.2,
      "Time_End": 850.5600000000001,
      "Text": " CPL is like a perfect idea to weaponize that kind of thinking about the DLLs, and also the"
    },
    {
      "Time_Start": 850.5600000000001,
      "Time_End": 859.2800000000001,
      "Text": " LNK files, the LNKs are such a decade-old threat, we cannot even think about, we cannot even imagine"
    },
    {
      "Time_Start": 859.2800000000001,
      "Time_End": 866.72,
      "Text": " why is that threat still noticed during the 2022, where Microsoft is so aggressive towards the"
    },
    {
      "Time_Start": 866.72,
      "Time_End": 872.4000000000001,
      "Text": " macros, and is so aggressive towards applying the mark of the web idea towards plenty other"
    },
    {
      "Time_Start": 873.36,
      "Time_End": 880.72,
      "Text": " file formats, why do they don't do the same thing about the LNKs, like we've been trying to come up"
    },
    {
      "Time_Start": 880.72,
      "Time_End": 887.48,
      "Text": " with observation how much common is for our employees to use to transmit LNK files, and"
    },
    {
      "Time_Start": 887.48,
      "Time_End": 894.88,
      "Text": " we've seen as it results from my talks with the blue team guys, who have been trying to do this"
    },
    {
      "Time_Start": 894.88,
      "Time_End": 901.68,
      "Text": " like threat hunting queries, that the LNKs could be quite easily blocked on the perimeter of the"
    },
    {
      "Time_Start": 901.6800000000001,
      "Time_End": 906.72,
      "Text": " customers, therefore we might be just suggesting them to block that extension right away, without"
    },
    {
      "Time_Start": 906.72,
      "Time_End": 919.1600000000001,
      "Text": " losing any business use cases. As well as HTML files, the HTML are not so anticipated as the"
    },
    {
      "Time_Start": 919.1600000000001,
      "Time_End": 925.6400000000001,
      "Text": " malware vector, and still they can be delivered even inside of the attachment, and the HTML can"
    },
    {
      "Time_Start": 925.6400000000001,
      "Time_End": 930.6800000000001,
      "Text": " easily contain the smuggling payload, therefore constituting all the rest of the infection chain,"
    },
    {
      "Time_Start": 930.7600000000001,
      "Time_End": 938.2,
      "Text": " just from inside of the simple email attachment, and what's funny about this email"
    },
    {
      "Time_Start": 938.2,
      "Time_End": 945.4000000000001,
      "Text": " attachment, is that we can apply this really old trick of just inputting this dandy Unicode byte"
    },
    {
      "Time_Start": 945.4000000000001,
      "Time_End": 952.6,
      "Text": " into the file name, so that it will mingle with how the file name is being printed,"
    },
    {
      "Time_Start": 952.84,
      "Time_End": 961.44,
      "Text": " represented back to the user, and therefore trying to fool the more tech savvy users into"
    },
    {
      "Time_Start": 961.44,
      "Time_End": 966.28,
      "Text": " thinking that they are dealing with this maybe a little bit more legitimate file, such as Fox1."
    },
    {
      "Time_Start": 966.28,
      "Time_End": 982.48,
      "Text": " Also, the VBA malware. Well, we consider that the VBA isn't going away"
    },
    {
      "Time_Start": 982.48,
      "Time_End": 992.3199999999999,
      "Text": " any much soon, because of how much is it used by the big players, such as hedge funds"
    },
    {
      "Time_Start": 992.44,
      "Time_End": 998.72,
      "Text": " companies, and the financial sector, and the brokers. I even have my friend who is a lawyer,"
    },
    {
      "Time_Start": 998.72,
      "Time_End": 1004.2,
      "Text": " and he told me that he's so used to working with VBA macros, even the lawyers, like colleague"
    },
    {
      "Time_Start": 1004.2,
      "Time_End": 1009.7600000000001,
      "Text": " lawyers, are using that mechanism, that functionality, because they also have their"
    },
    {
      "Time_Start": 1009.7600000000001,
      "Time_End": 1016.2800000000001,
      "Text": " own automated Excel spreadsheets that somebody has written years ago, that they are using inside of"
    },
    {
      "Time_Start": 1016.28,
      "Time_End": 1025.96,
      "Text": " their companies. Therefore, it is still a viable approach targeting lesser aware users, that the"
    },
    {
      "Time_Start": 1025.96,
      "Time_End": 1032.24,
      "Text": " yellow ribbon enabling them, making them enable macros, is not so scary after all, because we've"
    },
    {
      "Time_Start": 1032.24,
      "Time_End": 1038.0,
      "Text": " used to work with this kind of files, therefore we can go about it. And there's also a very nice"
    },
    {
      "Time_Start": 1038.0,
      "Time_End": 1044.6399999999999,
      "Text": " podcast with Risky Business, where the CEO of CrowdStrike shares some of his insights with"
    },
    {
      "Time_Start": 1045.16,
      "Time_End": 1054.68,
      "Text": " what he learned from talking with Microsoft on this pushing back on macros decision, and I highly"
    },
    {
      "Time_Start": 1054.68,
      "Time_End": 1060.68,
      "Text": " recommend going back and listening to that podcast, because it's very insightful. And also, we can"
    },
    {
      "Time_Start": 1060.68,
      "Time_End": 1066.24,
      "Text": " think of millions of ways we could actually weaponize VBA to bring us the code execution"
    },
    {
      "Time_Start": 1066.24,
      "Time_End": 1074.24,
      "Text": " primitive, but according to our researchers, we have this like maybe 20 of different code"
    },
    {
      "Time_Start": 1074.24,
      "Time_End": 1080.2,
      "Text": " patterns implemented within the VBA, and the three ones that are the most effective, that we found"
    },
    {
      "Time_Start": 1080.2,
      "Time_End": 1088.36,
      "Text": " the most effective, were the simple file droppers, as well as the idea of James Forshaw for having"
    },
    {
      "Time_Start": 1088.36,
      "Time_End": 1095.4,
      "Text": " this realization from inside of the VBA code, through the use of .NET interoperability interfaces,"
    },
    {
      "Time_Start": 1095.4,
      "Time_End": 1103.88,
      "Text": " and in XSL transfer mode, which applies the same logic. Also, there are some more or less"
    },
    {
      "Time_Start": 1103.88,
      "Time_End": 1111.88,
      "Text": " anticipated file formats, so just plain simple word, we all are aware of the remote template"
    },
    {
      "Time_Start": 1111.88,
      "Time_End": 1118.72,
      "Text": " trick within the words, when we can just deliver the plain simple docs file without the macros,"
    },
    {
      "Time_Start": 1118.72,
      "Time_End": 1124.68,
      "Text": " which will then be having this like a reference to the remotely hosted template, that template"
    },
    {
      "Time_Start": 1124.8,
      "Time_End": 1131.4,
      "Text": " can have arbitrary example, meaning we don't need to follow this .tm kind of naming. Therefore,"
    },
    {
      "Time_Start": 1131.4,
      "Time_End": 1136.8,
      "Text": " we could dechain the infection into two stages, first delivering the macro-less document, then"
    },
    {
      "Time_Start": 1136.8,
      "Time_End": 1143.76,
      "Text": " having the macro-enabled payload delivered back to us during the remote resources fetching,"
    },
    {
      "Time_Start": 1143.76,
      "Time_End": 1148.64,
      "Text": " and the same approach can be applied to the XLS by the use of mechanics called custom UI,"
    },
    {
      "Time_Start": 1148.8000000000002,
      "Time_End": 1154.76,
      "Text": " which was designed to provide the customers the ability to customize the ribbon within the office"
    },
    {
      "Time_Start": 1154.76,
      "Time_End": 1160.16,
      "Text": " applications, and also PowerPoint. PowerPoint is also not so much anticipated format, and we found"
    },
    {
      "Time_Start": 1160.16,
      "Time_End": 1165.92,
      "Text": " that in our community, and I found that in while working with my customers, that they haven't been"
    },
    {
      "Time_Start": 1165.92,
      "Time_End": 1170.92,
      "Text": " experiencing macro-enabled PowerPoints, therefore they never considered that the PowerPoint might"
    },
    {
      "Time_Start": 1170.92,
      "Time_End": 1178.3200000000002,
      "Text": " be the dangerous one, and also the same observation applies to lesser known and more even exotic"
    },
    {
      "Time_Start": 1178.48,
      "Time_End": 1185.28,
      "Text": " formats, but they don't share the same risk exposure, because the Visio or the project is not"
    },
    {
      "Time_Start": 1185.28,
      "Time_End": 1189.6,
      "Text": " so commonly pre-installed, there are this like additional applications, but still we need to be"
    },
    {
      "Time_Start": 1189.6,
      "Time_End": 1195.36,
      "Text": " aware that while targeting critical infrastructure sectors, there are these architects and engineers"
    },
    {
      "Time_Start": 1195.36,
      "Time_End": 1201.48,
      "Text": " who are used to work with CAD software, and CAD software typically has this backward compatibility"
    },
    {
      "Time_Start": 1201.64,
      "Time_End": 1208.44,
      "Text": " with the Visio diagrams, therefore devising malware for Visio will get the power plant sector"
    },
    {
      "Time_Start": 1208.44,
      "Time_End": 1213.48,
      "Text": " infected as well, because of the software that the engineers and architects are using there,"
    },
    {
      "Time_Start": 1213.48,
      "Time_End": 1220.52,
      "Text": " so we see that there are plenty more of dodgy extensions that we could be aware of,"
    },
    {
      "Time_Start": 1220.52,
      "Time_End": 1231.2,
      "Text": " and therefore instruct our customers to protect themselves from. And to just support what we"
    },
    {
      "Time_Start": 1232.2,
      "Time_End": 1237.96,
      "Text": " have already said, the VBA runtime engine is not only present within the Microsoft products,"
    },
    {
      "Time_Start": 1237.96,
      "Time_End": 1245.04,
      "Text": " it is very ubiquitous among the architects and engineers, especially in CAD software,"
    },
    {
      "Time_Start": 1245.04,
      "Time_End": 1253.32,
      "Text": " as well as other exotic ones, such as ArcMap, GIS templates, and even oscilloscopes may have"
    },
    {
      "Time_Start": 1253.4399999999998,
      "Time_End": 1260.9199999999998,
      "Text": " this support for VBA code, which is kind of interesting. Therefore, this increases the"
    },
    {
      "Time_Start": 1260.9199999999998,
      "Time_End": 1268.36,
      "Text": " threat surface that there is actually behind the VBA story. And now, a little bit of a backstory"
    },
    {
      "Time_Start": 1268.36,
      "Time_End": 1277.4399999999998,
      "Text": " of the containerization idea. So, I assume that we are all aware of the fact that Microsoft tried"
    },
    {
      "Time_Start": 1277.44,
      "Time_End": 1285.24,
      "Text": " to apply this quite a nicely sounding logic of blocking macros, whenever they have this"
    },
    {
      "Time_Start": 1285.24,
      "Time_End": 1290.24,
      "Text": " like paint flag that they are marked that they came from the internet, therefore these files"
    },
    {
      "Time_Start": 1290.24,
      "Time_End": 1294.88,
      "Text": " cannot be trusted because they come from the untrusted source, so the macro is decided,"
    },
    {
      "Time_Start": 1294.88,
      "Time_End": 1300.6000000000001,
      "Text": " so the office applications are deciding that, well, since that file source cannot be trusted,"
    },
    {
      "Time_Start": 1300.6000000000001,
      "Time_End": 1306.3200000000002,
      "Text": " therefore I am not willing to run its code, therefore I'll make the decision for the"
    },
    {
      "Time_Start": 1307.32,
      "Time_End": 1315.6399999999999,
      "Text": " user instead and just make him unable to even enable macros. So, since we've been trying to"
    },
    {
      "Time_Start": 1315.6399999999999,
      "Time_End": 1321.1599999999999,
      "Text": " find that kind of functionality applied to the Office 365, we've seen the Microsoft"
    },
    {
      "Time_Start": 1321.1599999999999,
      "Time_End": 1327.1599999999999,
      "Text": " representatives telling that they have this very robust protection against the mark of the web."
    },
    {
      "Time_Start": 1327.1599999999999,
      "Time_End": 1334.0,
      "Text": " Well, I couldn't find the proper version of the Office 365 environment. Maybe you can just"
    },
    {
      "Time_Start": 1334.32,
      "Time_End": 1340.92,
      "Text": " approach me after this talk and point me to the specific installation that has this feature"
    },
    {
      "Time_Start": 1340.92,
      "Time_End": 1348.76,
      "Text": " enforced, but I couldn't just reproduce it. So, we didn't yet found the exactly running"
    },
    {
      "Time_Start": 1348.76,
      "Time_End": 1355.64,
      "Text": " and working idea for blocking MOTEVU-enabled documents. So, in practice, it means that"
    },
    {
      "Time_Start": 1355.64,
      "Time_End": 1361.2,
      "Text": " currently this doesn't really act as an evasion. We have the evasion before even the security"
    },
    {
      "Time_Start": 1361.2,
      "Time_End": 1366.96,
      "Text": " measurements was implemented, at least this is like my point of view, but it can act as the way"
    },
    {
      "Time_Start": 1366.96,
      "Time_End": 1372.68,
      "Text": " of showing to the customers that there are way much more extensions that should be considered"
    },
    {
      "Time_Start": 1372.68,
      "Time_End": 1379.76,
      "Text": " as dangerous and therefore untrusted, such as ISOs or even IMGs, which are not so popular as"
    },
    {
      "Time_Start": 1379.76,
      "Time_End": 1385.64,
      "Text": " the concept of ISO, and IMG is simply a synonym to the ISO. We can just simply rename the extension"
    },
    {
      "Time_Start": 1385.64,
      "Time_End": 1391.4,
      "Text": " and we will have the same ISO inside of it, and we will be probably aware that the files within"
    },
    {
      "Time_Start": 1391.4,
      "Time_End": 1398.0,
      "Text": " the container will not have the mark of the web file taint flag propagated. Therefore, even if"
    },
    {
      "Time_Start": 1398.0,
      "Time_End": 1403.76,
      "Text": " the container itself is considered as coming from untrusted, the file inside of that container"
    },
    {
      "Time_Start": 1403.76,
      "Time_End": 1412.0400000000002,
      "Text": " won't apply the same observation. And also, it was quite surprising to us that during the"
    },
    {
      "Time_Start": 1412.04,
      "Time_End": 1417.2,
      "Text": " actual engagement, while we were constantly observing the print screens coming from back"
    },
    {
      "Time_Start": 1417.2,
      "Time_End": 1424.3999999999999,
      "Text": " of our beacons, we just observed these employees that were working with these PDF files"
    },
    {
      "Time_Start": 1424.3999999999999,
      "Time_End": 1432.6,
      "Text": " that had like 10 and more files embedded inside of them. And this was the Eureka idea for us,"
    },
    {
      "Time_Start": 1432.6,
      "Time_End": 1438.76,
      "Text": " that hey, since the employees are using and do know, they are familiarized with this mechanism"
    },
    {
      "Time_Start": 1438.76,
      "Time_End": 1444.0,
      "Text": " of having files embedded into the PDF, we are going to weaponize that and we are going to reuse"
    },
    {
      "Time_Start": 1444.0,
      "Time_End": 1450.4,
      "Text": " that idea for our endeavors. And it kind of worked, so we can also store files within the PDFs and"
    },
    {
      "Time_Start": 1450.4,
      "Time_End": 1456.8,
      "Text": " have even them quite automatically popped in front of the user. And as you can see from the"
    },
    {
      "Time_Start": 1456.8,
      "Time_End": 1461.76,
      "Text": " social engineering perspective, the prompt is already having this like secure defaults and"
    },
    {
      "Time_Start": 1461.76,
      "Time_End": 1467.4,
      "Text": " the enabling button is already highlighted. Therefore, just simply hitting enter or just"
    },
    {
      "Time_Start": 1467.68,
      "Time_End": 1473.88,
      "Text": " forgetting about to read all of this boring stuff that is on the dialog is enough to get"
    },
    {
      "Time_Start": 1473.88,
      "Time_End": 1482.0400000000002,
      "Text": " one's infected. And now comes the beauty of HTML smuggling. So, the idea of HTML smuggling is known"
    },
    {
      "Time_Start": 1482.0400000000002,
      "Time_End": 1488.76,
      "Text": " for a couple of years and we all learned, I guess that at least I have learned about this idea from"
    },
    {
      "Time_Start": 1488.76,
      "Time_End": 1495.2,
      "Text": " the outlying guys who just share this very cool research about the notion of having malware"
    },
    {
      "Time_Start": 1495.32,
      "Time_End": 1502.72,
      "Text": " embedded within the HTML, which in turn contains this JavaScript. So, there is this JavaScript"
    },
    {
      "Time_Start": 1502.72,
      "Time_End": 1510.2,
      "Text": " automation that will unpack the file and drop it to the hard drive during the drive-by occasion."
    },
    {
      "Time_Start": 1510.2,
      "Time_End": 1518.8400000000001,
      "Text": " And this is just so surprising that this idea gets our malicious files, regardless of their"
    },
    {
      "Time_Start": 1518.84,
      "Time_End": 1526.08,
      "Text": " extension, regardless of their contents, easily just right into the victim's hard drive,"
    },
    {
      "Time_Start": 1526.08,
      "Time_End": 1533.3999999999999,
      "Text": " because the proxies, as well as any other network positioned systems, have no way to differentiate"
    },
    {
      "Time_Start": 1533.3999999999999,
      "Time_End": 1540.56,
      "Text": " whether the HTML or JavaScript is dodgy. And even if they were trying to just hook into this"
    },
    {
      "Time_Start": 1540.56,
      "Time_End": 1547.1999999999998,
      "Text": " dodgy world, we could apply heavy JavaScript obfuscations. Therefore, this is not the best"
    },
    {
      "Time_Start": 1547.24,
      "Time_End": 1554.68,
      "Text": " idea for them to even try to sense the dodginess within the JavaScript. And the only way to protect"
    },
    {
      "Time_Start": 1554.68,
      "Time_End": 1561.16,
      "Text": " against it is to come up with clever and robust HIPPS rules on the downloads directory that the"
    },
    {
      "Time_Start": 1561.16,
      "Time_End": 1566.2,
      "Text": " customers could apply. So, for instance, running the CPL files from the downloads directory. This"
    },
    {
      "Time_Start": 1566.2,
      "Time_End": 1571.52,
      "Text": " is an anomaly that we could model our detections around. Therefore, we could kill it by simply"
    },
    {
      "Time_Start": 1571.52,
      "Time_End": 1578.76,
      "Text": " denying the system to even think about running CPLs from the downloads ones. But also, this idea"
    },
    {
      "Time_Start": 1578.76,
      "Time_End": 1585.6,
      "Text": " will only be effective if we anticipate, if we model the fact that our landing pages are going"
    },
    {
      "Time_Start": 1585.6,
      "Time_End": 1590.44,
      "Text": " to be heavily scanned by the automated sandboxes, proxies, and even the prying eyes of looting"
    },
    {
      "Time_Start": 1590.44,
      "Time_End": 1597.8,
      "Text": " analysts. So, we need to come up with this anti-headless timing device, even the post-delivery"
    },
    {
      "Time_Start": 1597.96,
      "Time_End": 1603.32,
      "Text": " and redirection, as well as we might be thinking about deploying decoy documents, so-called plausible"
    },
    {
      "Time_Start": 1603.32,
      "Time_End": 1610.56,
      "Text": " deniability something. And then, as you can see, as we can see all, there's like so much, so much"
    },
    {
      "Time_Start": 1610.56,
      "Time_End": 1618.6,
      "Text": " to protect against. Like, during my attempt to collect every extensions that I would see quite"
    },
    {
      "Time_Start": 1618.6,
      "Time_End": 1626.1599999999999,
      "Text": " nicely weaponized, I came up with this 70, 73 extensions list. Maybe there's much more. These"
    },
    {
      "Time_Start": 1626.24,
      "Time_End": 1631.52,
      "Text": " are at least the ones that I think that I will be able to weaponize. Therefore, they pose actual"
    },
    {
      "Time_Start": 1631.52,
      "Time_End": 1637.5600000000002,
      "Text": " risk to the customers that we are protecting. So, just simply trying to discuss with"
    },
    {
      "Time_Start": 1637.5600000000002,
      "Time_End": 1644.8000000000002,
      "Text": " them the possibility of blocking these extensions if there is no business case for"
    },
    {
      "Time_Start": 1644.8000000000002,
      "Time_End": 1654.48,
      "Text": " having them coming from the internet would be a nice mitigation strategy. Now, let's get to the"
    },
    {
      "Time_Start": 1654.48,
      "Time_End": 1661.52,
      "Text": " second part of this talk, the evasion in depth. So, in order to maximize our chances for the"
    },
    {
      "Time_Start": 1661.52,
      "Time_End": 1666.28,
      "Text": " successful breach, we need to be thinking about evasions at every step of the kill chain that"
    },
    {
      "Time_Start": 1666.28,
      "Time_End": 1671.8,
      "Text": " we try to simulate. So, every step of the kill chain comes with its unique challenges that we"
    },
    {
      "Time_Start": 1671.8,
      "Time_End": 1678.64,
      "Text": " need to combat. And all of these challenges, when we are trying to emulate them inappropriately,"
    },
    {
      "Time_Start": 1678.76,
      "Time_End": 1684.68,
      "Text": " will be leaving traces behind us. And therefore, we should be trying to first test our samples"
    },
    {
      "Time_Start": 1684.68,
      "Time_End": 1691.24,
      "Text": " within our environments, apply the threat hunting, as well as threat detection ideas"
    },
    {
      "Time_Start": 1691.24,
      "Time_End": 1697.48,
      "Text": " ourselves within our lab environments, so that we can be in advanced compared to our blue team"
    },
    {
      "Time_Start": 1697.48,
      "Time_End": 1704.2,
      "Text": " colleagues and see what our samples are leaving behind and try to address that traces and that"
    },
    {
      "Time_Start": 1704.24,
      "Time_End": 1712.88,
      "Text": " leftovers ourselves. So, starting with the delivery, we found that hosting our payloads"
    },
    {
      "Time_Start": 1712.88,
      "Time_End": 1720.72,
      "Text": " within the good reputation servers, such as clouds, are the best way to get into the company,"
    },
    {
      "Time_Start": 1720.72,
      "Time_End": 1727.0,
      "Text": " because, of course, this isn't that simple to just block entire windows.net domain. Therefore,"
    },
    {
      "Time_Start": 1727.0,
      "Time_End": 1732.44,
      "Text": " we might be abusing multiple different, for instance, Azure services to host our payloads,"
    },
    {
      "Time_Start": 1732.56,
      "Time_End": 1739.8,
      "Text": " and there is no clear idea what to do about it when you think about companies' large-scale"
    },
    {
      "Time_Start": 1739.8,
      "Time_End": 1749.8400000000001,
      "Text": " solutions to this problem. Therefore, I guess that it is beneficial to come over that threat,"
    },
    {
      "Time_Start": 1749.8400000000001,
      "Time_End": 1754.04,
      "Text": " to try to model it and try to see if there is anything that we could do about it. So,"
    },
    {
      "Time_Start": 1754.04,
      "Time_End": 1759.6000000000001,
      "Text": " for instance, I know that some customers can simply block entire Amazon AWS.net,"
    },
    {
      "Time_Start": 1759.68,
      "Time_End": 1765.3200000000002,
      "Text": " because they are not using AWS resources. Therefore, at least minimizing the threat"
    },
    {
      "Time_Start": 1765.3200000000002,
      "Time_End": 1772.88,
      "Text": " surface of that cloud. And also, Mr. Docs has this very cool project called Living of Trusted"
    },
    {
      "Time_Start": 1772.88,
      "Time_End": 1781.4800000000002,
      "Text": " Sites, when he tries to collect every domain, every internet service that could be reused,"
    },
    {
      "Time_Start": 1781.72,
      "Time_End": 1790.88,
      "Text": " repurposed for the file storage primitive. So, for instance, he just disclosed to us that we"
    },
    {
      "Time_Start": 1790.88,
      "Time_End": 1798.96,
      "Text": " can simply upload the file as attachments while working on the email within the Office 365 Outlook,"
    },
    {
      "Time_Start": 1798.96,
      "Time_End": 1806.56,
      "Text": " and that file will then be immediately uploaded to the Azure cloud and will get back to us with"
    },
    {
      "Time_Start": 1806.6399999999999,
      "Time_End": 1813.6399999999999,
      "Text": " this nice Outlook live.net domain URL. So, it will be quite trusted, but yet it comes with this"
    },
    {
      "Time_Start": 1813.6399999999999,
      "Time_End": 1820.6399999999999,
      "Text": " very short validity of ten minutes, something like that. So, it's not that useful, but there"
    },
    {
      "Time_Start": 1820.6399999999999,
      "Time_End": 1828.12,
      "Text": " are plenty of other ideas. Also, before we actually deliver the Office document, for instance, we"
    },
    {
      "Time_Start": 1828.12,
      "Time_End": 1833.52,
      "Text": " should be applying multiple evasions on the file level as well. So, for instance, VBA purging,"
    },
    {
      "Time_Start": 1833.6399999999999,
      "Time_End": 1842.76,
      "Text": " which works very good, even now during the 2022 year. But yet, there is this, I would call it the"
    },
    {
      "Time_Start": 1842.76,
      "Time_End": 1849.84,
      "Text": " backdoor. If you check out the official repository on the GitHub with the Office purge, there is this"
    },
    {
      "Time_Start": 1849.84,
      "Time_End": 1858.0,
      "Text": " left idea for having Yara signature being applicable on the documents purged with that tool."
    },
    {
      "Time_Start": 1858.08,
      "Time_End": 1864.8,
      "Text": " Therefore, I would be advising to find another tool. There's a forked one that will get your"
    },
    {
      "Time_Start": 1864.8,
      "Time_End": 1870.96,
      "Text": " files a little bit more stealthier as compared to Office purging one. And the Office document"
    },
    {
      "Time_Start": 1870.96,
      "Time_End": 1876.28,
      "Text": " encryption is a terrifying approach to just cut down on the detection to the very zero level when"
    },
    {
      "Time_Start": 1876.28,
      "Time_End": 1881.12,
      "Text": " you just apply your custom password, or even the hard-coded default one, Velvet Sweatshop,"
    },
    {
      "Time_Start": 1881.12,
      "Time_End": 1887.8,
      "Text": " will cut it because as long as the victim provides his own password, the antiviruses and EDR stuff"
    },
    {
      "Time_Start": 1887.8,
      "Time_End": 1893.96,
      "Text": " are unable to sense anything out of it. And also, when it comes to what we actually can do with"
    },
    {
      "Time_Start": 1893.96,
      "Time_End": 1900.36,
      "Text": " the VBA, .NET 2.js is a still gift that keeps on giving, and even when it comes to Microsoft"
    },
    {
      "Time_Start": 1900.36,
      "Time_End": 1904.76,
      "Text": " attack surface reduction rules, there's this rule called block Office applications from injecting"
    },
    {
      "Time_Start": 1904.76,
      "Time_End": 1911.04,
      "Text": " into other processes, and we found that these ASR rules are ineffective against .NET 2.js, .NET"
    },
    {
      "Time_Start": 1911.04,
      "Time_End": 1919.68,
      "Text": " loaded and deserialized assemblies. Also, the idea that we really like is to use the XSL transform"
    },
    {
      "Time_Start": 1919.68,
      "Time_End": 1925.3999999999999,
      "Text": " node that we can see on the right-hand side, higher image. We are just providing the URL,"
    },
    {
      "Time_Start": 1925.3999999999999,
      "Time_End": 1933.04,
      "Text": " or even we can provide the entire VBS XML, and that XML, XSL rather, can contain the VBScript"
    },
    {
      "Time_Start": 1933.04,
      "Time_End": 1938.6399999999999,
      "Text": " or the JScript, and that one will be launched, deserialized within the memory, therefore giving"
    },
    {
      "Time_Start": 1938.64,
      "Time_End": 1944.24,
      "Text": " us this low footprint, quite stealthy code execution primitive from inside of the VBA."
    },
    {
      "Time_Start": 1944.24,
      "Time_End": 1951.76,
      "Text": " And also, if we want to actually run something inside of the system, try to use the"
    },
    {
      "Time_Start": 1951.76,
      "Time_End": 1957.2800000000002,
      "Text": " dechained execution approach, so instead of running your commands inside of the child processes,"
    },
    {
      "Time_Start": 1957.2800000000002,
      "Time_End": 1962.6000000000001,
      "Text": " try to look for the primitives that will let you dechain the parent-child relationship. And also,"
    },
    {
      "Time_Start": 1962.6000000000001,
      "Time_End": 1968.0800000000002,
      "Text": " don't evade Emsi from inside of the VBA, just look for the other ways around it, like for instance,"
    },
    {
      "Time_Start": 1968.2400000000002,
      "Time_End": 1973.5200000000002,
      "Text": " using the more sophisticated VBA implementations. Instead of trying to patch the memory of the Emsi,"
    },
    {
      "Time_Start": 1973.5200000000002,
      "Time_End": 1980.5200000000002,
      "Text": " this is not the way to go. This is not a scalable way to go. And another thing is that using the"
    },
    {
      "Time_Start": 1980.5200000000002,
      "Time_End": 1986.8400000000001,
      "Text": " community malware, which Cobalt Strike is right now considering us, as well as the Metasploit one,"
    },
    {
      "Time_Start": 1986.8400000000001,
      "Time_End": 1993.8400000000001,
      "Text": " Covenant one, they are used as these benchmarks for EDRs. The EDRs need to fine-tune their own"
    },
    {
      "Time_Start": 1993.88,
      "Time_End": 1998.0400000000002,
      "Text": " detections towards these products, because the entire community expects that, for instance,"
    },
    {
      "Time_Start": 1998.0400000000002,
      "Time_End": 2003.96,
      "Text": " the EDR X0-XZ will be sensing Cobalt Strike within the memory, regardless of how well was"
    },
    {
      "Time_Start": 2003.96,
      "Time_End": 2009.2,
      "Text": " it hidden. Therefore, the Cobalt Strike will get us, at some point, probably detected,"
    },
    {
      "Time_Start": 2009.2,
      "Time_End": 2017.44,
      "Text": " so we can think about moving towards another C2 implants, such as, for instance, Mythic C2,"
    },
    {
      "Time_Start": 2017.44,
      "Time_End": 2022.1200000000001,
      "Text": " which is an open-source one, and it's really, really affordable to just try to work with it"
    },
    {
      "Time_Start": 2022.1200000000001,
      "Time_End": 2026.64,
      "Text": " and come up with our custom implant for the Mythic, and keep it in-house, just for the case."
    },
    {
      "Time_Start": 2026.64,
      "Time_End": 2031.5200000000002,
      "Text": " And also, if you work with Sliver, just think about the idea that executes assembly,"
    },
    {
      "Time_Start": 2031.5200000000002,
      "Time_End": 2036.92,
      "Text": " which is very convenient, follows the fork-and-run approach, which is something I'm going to briefly"
    },
    {
      "Time_Start": 2036.92,
      "Time_End": 2044.88,
      "Text": " cover in just about seconds. This is quite a loud idea for running our .NETs. When we think"
    },
    {
      "Time_Start": 2044.88,
      "Time_End": 2050.2000000000003,
      "Text": " about delivering the executables, also bear in mind that there is this prevalence and reputation"
    },
    {
      "Time_Start": 2050.2,
      "Time_End": 2056.4399999999996,
      "Text": " analysis that our executable, regardless of how sophisticated that was, was only seen in"
    },
    {
      "Time_Start": 2056.4399999999996,
      "Time_End": 2062.2,
      "Text": " two devices worldwide. Therefore, it is considered as anomalous, because it's so uncommon, so it"
    },
    {
      "Time_Start": 2062.2,
      "Time_End": 2069.12,
      "Text": " will be detected and mitigated, contained, even before it has a chance to shine and chance to"
    },
    {
      "Time_Start": 2069.12,
      "Time_End": 2074.8399999999997,
      "Text": " apply all its sophisticated evasions and patches, and so on. So strive for the DLS side-loading,"
    },
    {
      "Time_Start": 2074.84,
      "Time_End": 2081.0,
      "Text": " hijacking, comp hijacking, wherever you want it, just don't use exists. Also, if you want to"
    },
    {
      "Time_Start": 2081.0,
      "Time_End": 2087.84,
      "Text": " deliver the actual executable, you can think about heavily obfuscating your stuff. So there is this"
    },
    {
      "Time_Start": 2087.84,
      "Time_End": 2094.08,
      "Text": " concept of obfuscators and protectors. I'm sure that we worked with UPIX and ConfuserX before."
    },
    {
      "Time_Start": 2094.08,
      "Time_End": 2101.4,
      "Text": " The only idea that I wanted to kind of enhance and release to my Red Team colleagues is to apply"
    },
    {
      "Time_Start": 2101.4,
      "Time_End": 2109.88,
      "Text": " the entire daisy-chained load of full of the packers, so that we can have the result of one"
    },
    {
      "Time_Start": 2109.88,
      "Time_End": 2115.76,
      "Text": " packer being fed to the other packer, and then even further complicate the stuff, and even maybe"
    },
    {
      "Time_Start": 2115.76,
      "Time_End": 2122.6,
      "Text": " just apply some other stages to just signing files using the skr, crow, or the mangle one, or even"
    },
    {
      "Time_Start": 2122.6,
      "Time_End": 2128.64,
      "Text": " removing pair resources using pair reset, for instance, or even backdoor the files using the"
    },
    {
      "Time_Start": 2128.7599999999998,
      "Time_End": 2134.24,
      "Text": " backdoor one. And also, when we are talking about responsibly delivering our cyber weapons,"
    },
    {
      "Time_Start": 2134.24,
      "Time_End": 2139.8399999999997,
      "Text": " think about watermarking your implants. So just intentionally inject some signatures into your"
    },
    {
      "Time_Start": 2139.8399999999997,
      "Time_End": 2145.72,
      "Text": " implants, so then when the Blue Team will get back to you in about half of a year later, and they will"
    },
    {
      "Time_Start": 2145.72,
      "Time_End": 2151.3599999999997,
      "Text": " ask you, is that yours? You'll be comfortable with saying, yes, that is ours, because we extracted"
    },
    {
      "Time_Start": 2151.48,
      "Time_End": 2160.6,
      "Text": " this as JSON blob from inside of that executable, and we were able to apply our password that we"
    },
    {
      "Time_Start": 2160.6,
      "Time_End": 2164.56,
      "Text": " have documented somewhere in our systems, and therefore we can extract the metadata out of"
    },
    {
      "Time_Start": 2164.56,
      "Time_End": 2171.52,
      "Text": " the beacon or out of the malware ourselves. So ideas where to store, where to stuff that kind"
    },
    {
      "Time_Start": 2171.52,
      "Time_End": 2178.7200000000003,
      "Text": " of watermarking are very simple. Just use the P headers, maybe resources, maybe just stick up with"
    },
    {
      "Time_Start": 2178.76,
      "Time_End": 2189.4,
      "Text": " the additional P section, maybe even tamper with the DOS stub instead. Also, if you want to backdoor"
    },
    {
      "Time_Start": 2189.4,
      "Time_End": 2194.92,
      "Text": " something because you like feeling that you really need to have this informer of a shellcode, but you"
    },
    {
      "Time_Start": 2194.92,
      "Time_End": 2201.0400000000004,
      "Text": " still would like to leverage, to abuse the fact that there are plenty of rich resources, icons,"
    },
    {
      "Time_Start": 2201.0400000000004,
      "Time_End": 2207.1200000000003,
      "Text": " cursors, and so on, you could try to inject your payload into the legitimate library using quite a"
    },
    {
      "Time_Start": 2208.12,
      "Time_End": 2215.0,
      "Text": " few ideas for writing and executing your shellcodes. And these two tools, the backdoor one,"
    },
    {
      "Time_Start": 2215.0,
      "Time_End": 2220.24,
      "Text": " watermarker one, are bundled within the protect my tooling package. So if you fancy using them,"
    },
    {
      "Time_Start": 2220.24,
      "Time_End": 2227.88,
      "Text": " check out the GitHub repository that contains them already. And one of the ideas that I would"
    },
    {
      "Time_Start": 2227.88,
      "Time_End": 2233.64,
      "Text": " recommend would be to try to store your shellcode in the middle of the first code section so that"
    },
    {
      "Time_Start": 2233.64,
      "Time_End": 2239.56,
      "Text": " we don't introduce yet another one, as long as the shellcode is not overly long, and then try to"
    },
    {
      "Time_Start": 2239.56,
      "Time_End": 2244.6,
      "Text": " hijack branching instruction from the original entry point and then point it towards the shellcode"
    },
    {
      "Time_Start": 2244.6,
      "Time_End": 2249.4,
      "Text": " that you just injected, so that we don't even tamper with the address of entry point P header"
    },
    {
      "Time_Start": 2249.4,
      "Time_End": 2255.04,
      "Text": " structure. And even there is this funny thing about just applying fake code signatures onto"
    },
    {
      "Time_Start": 2255.04,
      "Time_End": 2261.44,
      "Text": " our implants. So for instance, here we are taking this idea and implementation and an exported"
    },
    {
      "Time_Start": 2261.44,
      "Time_End": 2267.04,
      "Text": " certificate from manifestation MacGyver from SpectraOps, and we are just taking his fake code"
    },
    {
      "Time_Start": 2267.04,
      "Time_End": 2272.2000000000003,
      "Text": " certificate, we are applying it on the Apollo, and as we can see, Apollo before signing 30"
    },
    {
      "Time_Start": 2272.2000000000003,
      "Time_End": 2280.56,
      "Text": " detections, after signing with fake, still stolen certificates, eight less, and it just happens that"
    },
    {
      "Time_Start": 2280.56,
      "Time_End": 2290.56,
      "Text": " a few products were sustainable to this kind of fooling around them. There is this also"
    },
    {
      "Time_Start": 2291.0,
      "Time_End": 2297.4,
      "Text": " quite a fresh idea of pumping and bloating our malware samples. I haven't played with that much"
    },
    {
      "Time_Start": 2297.4,
      "Time_End": 2307.7599999999998,
      "Text": " with them myself yet, but we've heard that we can just inject the plenty of words, of English words,"
    },
    {
      "Time_Start": 2307.7599999999998,
      "Time_End": 2316.48,
      "Text": " to the very end of the executable, so that we can try to strive towards lower effective entropy of"
    },
    {
      "Time_Start": 2316.48,
      "Time_End": 2322.4,
      "Text": " the entire file. So that is the idea behind file pumping. And the file bloating, if we have the"
    },
    {
      "Time_Start": 2322.4,
      "Time_End": 2331.04,
      "Text": " implant that will act as our persistent one, and we leave it on our hard drive, how about just"
    },
    {
      "Time_Start": 2331.04,
      "Time_End": 2336.0,
      "Text": " increasing in size into something ridiculous, such as maybe 50 megs, and just leave it out there,"
    },
    {
      "Time_Start": 2336.0,
      "Time_End": 2342.76,
      "Text": " so that maybe some AVs and EDRs will just look at this size and say that this is not something for"
    },
    {
      "Time_Start": 2342.76,
      "Time_End": 2351.5600000000004,
      "Text": " me. Among the strategies that we can apply is to try to, of course, time delay the execution"
    },
    {
      "Time_Start": 2351.5600000000004,
      "Time_End": 2356.84,
      "Text": " primitives that we have. When we, during our shellcode execution, there is this allocation,"
    },
    {
      "Time_Start": 2356.84,
      "Time_End": 2363.4,
      "Text": " write, and execution steps. We could apply heavy delays among these subsequent steps,"
    },
    {
      "Time_Start": 2363.4,
      "Time_End": 2370.6000000000004,
      "Text": " following the drip loader style of injecting stuff. It is quite effective towards the"
    },
    {
      "Time_Start": 2370.6,
      "Time_End": 2375.88,
      "Text": " crowdstrike even today, but just requires a little bit of love for refactoring it and playing"
    },
    {
      "Time_Start": 2375.88,
      "Time_End": 2382.0,
      "Text": " with the source code. And then also, we could apply some blending in to just find the"
    },
    {
      "Time_Start": 2382.0,
      "Time_End": 2387.4,
      "Text": " remote process, if we really want to go about remote injection, and to find about process that"
    },
    {
      "Time_Start": 2387.4,
      "Time_End": 2395.52,
      "Text": " Duke has already pre-loaded CLR, WinHTTP, CRUD UI, so that we will be living inside of the"
    },
    {
      "Time_Start": 2395.92,
      "Time_End": 2403.0,
      "Text": " quite legitimate process. But instead, I would advise against injecting it to remote processes,"
    },
    {
      "Time_Start": 2403.0,
      "Time_End": 2409.56,
      "Text": " because it is so complicated to do it right, without leaving many traces behind. Even the"
    },
    {
      "Time_Start": 2409.56,
      "Time_End": 2416.12,
      "Text": " sole idea of direct syscalls can be implemented inappropriately, therefore leaving traces and"
    },
    {
      "Time_Start": 2416.12,
      "Time_End": 2421.0,
      "Text": " the detection primitives. So, just try to stay in process, in line, instead of injecting. Forget"
    },
    {
      "Time_Start": 2421.12,
      "Time_End": 2426.92,
      "Text": " injecting anything. We don't need to inject anymore. If we stay inside, if we operate inside"
    },
    {
      "Time_Start": 2426.92,
      "Time_End": 2432.28,
      "Text": " of the DLL that was loaded to the team server, there is just no need for us to keep on injecting"
    },
    {
      "Time_Start": 2432.28,
      "Time_End": 2437.28,
      "Text": " outside of the teams, because we are already living in the legitimate process, right? So,"
    },
    {
      "Time_Start": 2437.28,
      "Time_End": 2444.8,
      "Text": " in order to push back on the DOM's Yara signatures, we could even try to unlink our malware PA models"
    },
    {
      "Time_Start": 2444.8,
      "Time_End": 2451.28,
      "Text": " from the PEP during sleep, just before that, so that there is this no CRUD UI, no WinHTTP,"
    },
    {
      "Time_Start": 2451.28,
      "Time_End": 2456.28,
      "Text": " and I guess that this might even push back on some of the detection ideas coming from the"
    },
    {
      "Time_Start": 2456.28,
      "Time_End": 2462.48,
      "Text": " EDRs as well. We can also apply the calstack spoofers and approaches, as well as shellcode"
    },
    {
      "Time_Start": 2462.48,
      "Time_End": 2470.52,
      "Text": " fluctuation, which tries to leave our shellcode within the read-write or not accessible memory"
    },
    {
      "Time_Start": 2470.52,
      "Time_End": 2475.32,
      "Text": " pages, because we don't want to leave, we don't want to reside, and we don't want to have our"
    },
    {
      "Time_Start": 2475.32,
      "Time_End": 2483.68,
      "Text": " beacons left in the executable places, because as soon as the antivirus memory scanner sweeps comes"
    },
    {
      "Time_Start": 2483.68,
      "Time_End": 2489.08,
      "Text": " in, we don't want to be scanned, even in the first place, and the antiviruses, out of the"
    },
    {
      "Time_Start": 2489.08,
      "Time_End": 2494.4,
      "Text": " performance reason, are going to skip on the executable pages, because they are not... skip"
    },
    {
      "Time_Start": 2494.4,
      "Time_End": 2499.92,
      "Text": " not executable pages, because they don't fancy scanning every virtual memory allocations out"
    },
    {
      "Time_Start": 2499.92,
      "Time_End": 2504.6,
      "Text": " there, so they should be trying this performance optimizations idea for scanning only the executable"
    },
    {
      "Time_Start": 2504.6,
      "Time_End": 2510.56,
      "Text": " ones, so just keep your shellcode outside of the executable memory allocation, when you don't"
    },
    {
      "Time_Start": 2510.56,
      "Time_End": 2520.88,
      "Text": " operate. And also, if you fancy about patching AMSI and ETW, don't do it, because the corruption of"
    },
    {
      "Time_Start": 2520.88,
      "Time_End": 2526.96,
      "Text": " AMSI.dll is being picked up by the defender lately, as well as CrowdStrike, according to my"
    },
    {
      "Time_Start": 2526.96,
      "Time_End": 2531.56,
      "Text": " observations, therefore, we will be better off pulling these hardware breakpoints, kind of a"
    },
    {
      "Time_Start": 2531.56,
      "Time_End": 2539.16,
      "Text": " trick, where we apply the idea of having four breakpoints, that would then trigger during,"
    },
    {
      "Time_Start": 2539.16,
      "Time_End": 2546.84,
      "Text": " while entering the AMSI or ETW detection functions, so just AMSI scan buffer, and then from inside of"
    },
    {
      "Time_Start": 2546.84,
      "Time_End": 2551.0,
      "Text": " that, from inside of that exception handler, that will be triggered, because there is going to,"
    },
    {
      "Time_Start": 2551.0,
      "Time_End": 2556.2,
      "Text": " there's going to be single step exception triggered, as soon as the system enters the"
    },
    {
      "Time_Start": 2556.5600000000004,
      "Time_End": 2563.4800000000005,
      "Text": " detection function, we'll be trying to just conveniently, swiftly step, just jump outside"
    },
    {
      "Time_Start": 2563.4800000000005,
      "Time_End": 2569.4,
      "Text": " of that function, while not touching any byte in the memory, therefore not triggering this"
    },
    {
      "Time_Start": 2569.4,
      "Time_End": 2577.1200000000003,
      "Text": " AMSI-related detections. Also, a cool trick, we can even convert Windows handles into process"
    },
    {
      "Time_Start": 2577.1200000000003,
      "Time_End": 2582.9600000000005,
      "Text": " handles, and we can even apply the James Forshaw idea for turning a little bit of limited process"
    },
    {
      "Time_Start": 2582.96,
      "Time_End": 2589.68,
      "Text": " handle permissions into the full access ones, so there is this very cool idea for having Explorer"
    },
    {
      "Time_Start": 2589.68,
      "Time_End": 2598.2,
      "Text": " process handle, without calling to the open process API. One of a bunker trick about McAfee,"
    },
    {
      "Time_Start": 2598.2,
      "Time_End": 2604.7200000000003,
      "Text": " is that we can try to map out every possible process that the antivirus or EDR has, and try"
    },
    {
      "Time_Start": 2604.7200000000003,
      "Time_End": 2611.96,
      "Text": " to see which ones are not covered with the self-defense kernel primitives, and find that"
    },
    {
      "Time_Start": 2611.96,
      "Time_End": 2616.68,
      "Text": " there are all these, like, GUI processes that the antivirus have running, and they won't be"
    },
    {
      "Time_Start": 2616.68,
      "Time_End": 2622.32,
      "Text": " protected by the self-defense modules, therefore we can abuse them to just store our beacons inside"
    },
    {
      "Time_Start": 2622.32,
      "Time_End": 2626.96,
      "Text": " of these processes, because they are going to be considered as trusted, because they are"
    },
    {
      "Time_Start": 2626.96,
      "Time_End": 2634.6,
      "Text": " related to antivirus, so just simply find the FCNM process, and inject just right inside of"
    },
    {
      "Time_Start": 2634.6,
      "Time_End": 2641.72,
      "Text": " that one, and McAfee will should at least remind speechless about our beacon operating in there."
    },
    {
      "Time_Start": 2641.72,
      "Time_End": 2649.56,
      "Text": " And also, funny thing is that your products might be storing these log files within the file system,"
    },
    {
      "Time_Start": 2649.56,
      "Time_End": 2655.48,
      "Text": " and this is the case for the McAfee, which stores the quite verbose logging facility within the"
    },
    {
      "Time_Start": 2655.48,
      "Time_End": 2661.12,
      "Text": " program data, and you can just simply review the outcomes, the contents of these log files,"
    },
    {
      "Time_Start": 2661.24,
      "Time_End": 2666.72,
      "Text": " and just see for yourself that there are mentions about excluded processes, therefore as soon as we"
    },
    {
      "Time_Start": 2666.72,
      "Time_End": 2672.3599999999997,
      "Text": " have this idea that some process is excluded from scanning, we can just abuse this bound to within"
    },
    {
      "Time_Start": 2672.3599999999997,
      "Time_End": 2678.3599999999997,
      "Text": " the beacon, and just put our task inside of that excluded from scanning process, therefore surviving"
    },
    {
      "Time_Start": 2678.3599999999997,
      "Time_End": 2686.0,
      "Text": " attack from AVs. Also, command control-wise, just don't apply, just don't follow the fork and round"
    },
    {
      "Time_Start": 2686.0,
      "Time_End": 2691.72,
      "Text": " approach any longer. The execute assembly one is going to create this sacrificial process,"
    },
    {
      "Time_Start": 2691.72,
      "Time_End": 2696.48,
      "Text": " it's going to inject reflective DLL injection, the shellcode in there, it's going to"
    },
    {
      "Time_Start": 2696.48,
      "Time_End": 2702.28,
      "Text": " reflectively load itself, and then connect back to the beacon process over the name pipe. This is"
    },
    {
      "Time_Start": 2702.28,
      "Time_End": 2708.8,
      "Text": " so loud, this is not so stealthy approach we can do, we can be smarter about it, and just follow"
    },
    {
      "Time_Start": 2708.92,
      "Time_End": 2713.88,
      "Text": " the living inside of the process idea. Sorry about it, it means that I need to hurry up."
    },
    {
      "Time_Start": 2713.88,
      "Time_End": 2722.2400000000002,
      "Text": " All right, so just quickly, quickly summing up on this one, just use the bofnet from the"
    },
    {
      "Time_Start": 2722.2400000000002,
      "Time_End": 2729.6800000000003,
      "Text": " bofnet from the C-corp, from SpectraOps. Also, be aware that there is this private enhanced fork"
    },
    {
      "Time_Start": 2729.6800000000003,
      "Time_End": 2736.1600000000003,
      "Text": " of that bofnet, which I am the humble contributor to, which gives us this execute assembly and job"
    },
    {
      "Time_Start": 2736.64,
      "Time_End": 2741.8799999999997,
      "Text": " primitives that work just like a breeze, so you can try to figure out where to find that one,"
    },
    {
      "Time_Start": 2741.8799999999997,
      "Time_End": 2750.12,
      "Text": " and use them during your operations to just live inside the beacons process. A few slides left,"
    },
    {
      "Time_Start": 2750.12,
      "Time_End": 2755.92,
      "Text": " when you think about egressing, egress over highly reputational services such as OneDrive,"
    },
    {
      "Time_Start": 2755.92,
      "Time_End": 2763.2799999999997,
      "Text": " maybe GitHub, Slack, and if you think about connecting within the intranet instead of"
    },
    {
      "Time_Start": 2763.28,
      "Time_End": 2769.0800000000004,
      "Text": " using SMB, which might be RPC firewalled, we could be better off using the primitives of LDAP,"
    },
    {
      "Time_Start": 2769.0800000000004,
      "Time_End": 2774.1600000000003,
      "Text": " since when there is this domain joint system, and there's another domain joint system,"
    },
    {
      "Time_Start": 2774.1600000000003,
      "Time_End": 2778.6800000000003,
      "Text": " even in the highly separated networks with a swift segment, they still need to connect back"
    },
    {
      "Time_Start": 2778.6800000000003,
      "Time_End": 2784.44,
      "Text": " to the same domain controller, and we could use it to constitute a nice and hefty command and"
    },
    {
      "Time_Start": 2784.44,
      "Time_End": 2790.0400000000004,
      "Text": " control channel. Also, use the serverless redirectors, we've been piggybacking on the"
    },
    {
      "Time_Start": 2790.12,
      "Time_End": 2795.56,
      "Text": " AWS lambdas for a long time by now, and they come at real cheap, like five bucks or so for"
    },
    {
      "Time_Start": 2795.56,
      "Time_End": 2802.72,
      "Text": " four months long engagements, and they just constitute the sole idea of egressing to the"
    },
    {
      "Time_Start": 2802.72,
      "Time_End": 2811.56,
      "Text": " more trusted domains. And when you think about exfiltrating stuff, when you just dump this very"
    },
    {
      "Time_Start": 2811.56,
      "Time_End": 2819.44,
      "Text": " nice process memory, or maybe you even extracted entire team's cache that the team stores, you"
    },
    {
      "Time_Start": 2819.48,
      "Time_End": 2826.8,
      "Text": " might be trying to compress it using a nice and handy Zippy, or zipper instead, primitive, and"
    },
    {
      "Time_Start": 2826.8,
      "Time_End": 2831.76,
      "Text": " then when you have this like one gigs long of a zip file, you could just copy it to the OneDrive"
    },
    {
      "Time_Start": 2831.76,
      "Time_End": 2838.76,
      "Text": " sync directory, wait a little, and then get back to the Office 365 using the stolen primary refresh"
    },
    {
      "Time_Start": 2838.76,
      "Time_End": 2845.56,
      "Text": " token, and then just simply download the file out of the OneDrive web UI console, because the"
    },
    {
      "Time_Start": 2845.6,
      "Time_End": 2851.2,
      "Text": " OneDrive did the job for you for syncing back and exfiltrating the file, and you didn't have to"
    },
    {
      "Time_Start": 2851.2,
      "Time_End": 2856.52,
      "Text": " even care for the employee to keep a little while longer in the job, so that your file gets"
    },
    {
      "Time_Start": 2856.52,
      "Time_End": 2861.92,
      "Text": " exfiltrated properly, because OneDrive does everything of that for you. Now, as a summary,"
    },
    {
      "Time_Start": 2861.92,
      "Time_End": 2866.4,
      "Text": " there are a little bit of more slides, but I just anticipated I won't be able to cover all of them,"
    },
    {
      "Time_Start": 2866.4,
      "Time_End": 2873.96,
      "Text": " and all of the slides are accessible at my blog already, you can go out and check out the slides"
    },
    {
      "Time_Start": 2874.08,
      "Time_End": 2879.2400000000002,
      "Text": " for yourself, as well as try to use the product, my tooling tool, which I consider that could"
    },
    {
      "Time_Start": 2879.2400000000002,
      "Time_End": 2887.4,
      "Text": " enhance our operations outcomes, and also what I want to convey is that what I call the art of"
    },
    {
      "Time_Start": 2887.4,
      "Time_End": 2894.84,
      "Text": " evasion is only as successful as the number of tries we are applying, so we'll be failing like"
    },
    {
      "Time_Start": 2894.84,
      "Time_End": 2903.16,
      "Text": " 100 times, but then we'll find eventually this one nice fancy bypass for the product that we are"
    },
    {
      "Time_Start": 2903.16,
      "Time_End": 2909.16,
      "Text": " against, so just don't give up and keep on trying, and also be respectful to your blue team"
    },
    {
      "Time_Start": 2909.16,
      "Time_End": 2914.7599999999998,
      "Text": " colleagues, even if you breach the company, don't be braggy about it, just try to work with them,"
    },
    {
      "Time_Start": 2914.7599999999998,
      "Time_End": 2919.48,
      "Text": " deliver all the TTPs, all the samples, just share with them with the cool stuff that you devised,"
    },
    {
      "Time_Start": 2919.48,
      "Time_End": 2924.7599999999998,
      "Text": " because after all, we all want to progress, and we also want to adapt and keep on researching."
    }
  ]
}