{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.52,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hello everybody, I really have a hard task because this is the first presentation"
    },
    {
      "Time_Start": 14.52,
      "Time_End": 20.64,
      "Text": " after the dinner and this is the second day of the conference and my objective"
    },
    {
      "Time_Start": 20.64,
      "Time_End": 24.28,
      "Text": " is not to allow you to fall asleep."
    },
    {
      "Time_Start": 24.28,
      "Time_End": 28.92,
      "Text": " Hopefully this will be something interesting. Very enigmatic. Everybody is"
    },
    {
      "Time_Start": 28.92,
      "Time_End": 36.68,
      "Text": " hearing me well? Yep, at least somebody responded. My very enigmatic title, we"
    },
    {
      "Time_Start": 36.68,
      "Time_End": 42.84,
      "Text": " need a major step in maturing security. I will explain that in a few"
    },
    {
      "Time_Start": 42.84,
      "Time_End": 48.52,
      "Text": " slides. Just a quick disclaimer that all the stuff that I will present in this"
    },
    {
      "Time_Start": 48.52,
      "Time_End": 56.120000000000005,
      "Text": " presentation and on the following slides is my opinion, nobody else. Not my wife,"
    },
    {
      "Time_Start": 56.120000000000005,
      "Time_End": 61.400000000000006,
      "Text": " not my employee, not my line manager, not my friend of my line manager or"
    },
    {
      "Time_Start": 61.400000000000006,
      "Time_End": 66.32000000000001,
      "Text": " whatever. All the stuff on this presentation is intended for education"
    },
    {
      "Time_Start": 66.32000000000001,
      "Time_End": 72.56,
      "Text": " purpose only. Feel free to be educated and no animals were harmed during the"
    },
    {
      "Time_Start": 72.56,
      "Time_End": 79.08000000000001,
      "Text": " whole process and research that was done. Who am I for those who don't know me?"
    },
    {
      "Time_Start": 79.08000000000001,
      "Time_End": 86.04,
      "Text": " I'm working for more than 12 years in the security and until last year I was"
    },
    {
      "Time_Start": 86.04,
      "Time_End": 93.48,
      "Text": " working on the blue team. In the blue team I graduated physics and I'm very"
    },
    {
      "Time_Start": 93.48,
      "Time_End": 101.76,
      "Text": " grateful for having that point in time when I was learning"
    },
    {
      "Time_Start": 101.76,
      "Time_End": 107.12,
      "Text": " physics because actually it occurs that applying all the rules that we learn"
    },
    {
      "Time_Start": 107.12,
      "Time_End": 114.0,
      "Text": " during studying physics applied very well to IT security,"
    },
    {
      "Time_Start": 114.0,
      "Time_End": 117.88,
      "Text": " especially that one like you want to test if something is stable, just shake"
    },
    {
      "Time_Start": 117.88,
      "Time_End": 124.92,
      "Text": " it. If it will break it, it wasn't secure enough. As I said, for the last"
    },
    {
      "Time_Start": 124.92,
      "Time_End": 130.2,
      "Text": " year I'm trying to be a red teamer, so I'm gaining the experience as a red"
    },
    {
      "Time_Start": 130.2,
      "Time_End": 135.16,
      "Text": " teamer, but deeply in my heart I'm a blue teamer, so I'm always thinking"
    },
    {
      "Time_Start": 135.16,
      "Time_End": 140.52,
      "Text": " even when I'm breaking something or running a cobalt strike, I'm always"
    },
    {
      "Time_Start": 140.52,
      "Time_End": 148.08,
      "Text": " thinking about the blue defense side. So, the real problem that I would like"
    },
    {
      "Time_Start": 148.08,
      "Time_End": 153.48000000000002,
      "Text": " to discuss here is the supply chain attack problem. So, basically the"
    },
    {
      "Time_Start": 153.48000000000002,
      "Time_End": 159.60000000000002,
      "Text": " problem, how can we make secure or more secure or fix some issues"
    },
    {
      "Time_Start": 159.60000000000002,
      "Time_End": 167.48000000000002,
      "Text": " regarding shipping untrusted piece of software into our infrastructure? I know"
    },
    {
      "Time_Start": 167.56,
      "Time_End": 172.95999999999998,
      "Text": " this is really a good buzzword for the past two years, but I will try to avoid"
    },
    {
      "Time_Start": 172.95999999999998,
      "Time_End": 179.92,
      "Text": " buzzwords and BS in my presentation. So, the motivation for this presentation"
    },
    {
      "Time_Start": 179.92,
      "Time_End": 186.32,
      "Text": " started one and a half year ago, a few days after the SolarWings incidents. How"
    },
    {
      "Time_Start": 186.32,
      "Time_End": 194.04,
      "Text": " many of you know what is SolarWings about? Raise your hand. A majority. So,"
    },
    {
      "Time_Start": 194.04,
      "Time_End": 201.0,
      "Text": " very quickly, SolarWings is a software that is used in your network. It is a"
    },
    {
      "Time_Start": 201.0,
      "Time_End": 206.2,
      "Text": " software that is being run in privilege endpoints, and basically the attacker was"
    },
    {
      "Time_Start": 206.2,
      "Time_End": 212.23999999999998,
      "Text": " able to compromise the pipeline that is used to create that"
    },
    {
      "Time_Start": 212.23999999999998,
      "Time_End": 220.04,
      "Text": " software, the binaries of that software, and by compromising that part, it is"
    },
    {
      "Time_Start": 220.04,
      "Time_End": 225.4,
      "Text": " really big simplification, they were able to implant malicious components"
    },
    {
      "Time_Start": 225.4,
      "Time_End": 229.84,
      "Text": " into the software that was later on installed. They were, the malicious"
    },
    {
      "Time_Start": 229.84,
      "Time_End": 236.35999999999999,
      "Text": " implant was present in the binaries for at least half a year, and it was"
    },
    {
      "Time_Start": 236.35999999999999,
      "Time_End": 243.16,
      "Text": " installed in multiple institutions. And soon after the event called"
    },
    {
      "Time_Start": 243.28,
      "Time_End": 253.35999999999999,
      "Text": " SolarWings hack, the discussion on one of the social, professional social network"
    },
    {
      "Time_Start": 253.35999999999999,
      "Time_End": 258.24,
      "Text": " portals started with this sentence, like the SolarWings hacks shows that the"
    },
    {
      "Time_Start": 258.24,
      "Time_End": 265.0,
      "Text": " automatic patching is not always a good idea, blah, blah, blah, and very obvious and"
    },
    {
      "Time_Start": 265.0,
      "Time_End": 269.92,
      "Text": " very correct sentence that you are responsible for what is being installed"
    },
    {
      "Time_Start": 270.04,
      "Time_End": 275.12,
      "Text": " on your network. But the biggest problem in the supply chain attack is that, yes,"
    },
    {
      "Time_Start": 275.12,
      "Time_End": 281.68,
      "Text": " you are responsible, but the garbage that you receive and you need to install on"
    },
    {
      "Time_Start": 281.68,
      "Time_End": 285.68,
      "Text": " your network is being delivered by someone else, and there's no way that you"
    },
    {
      "Time_Start": 285.68,
      "Time_End": 291.6,
      "Text": " can verify, continuously verify the trust, especially that you have, if you have"
    },
    {
      "Time_Start": 291.6,
      "Time_End": 298.96000000000004,
      "Text": " multiple vendors that are supplying multiple things for you. So, I responded"
    },
    {
      "Time_Start": 298.96,
      "Time_End": 307.71999999999997,
      "Text": " quickly, okay, how on earth can you, what kind of process can you apply to be sure"
    },
    {
      "Time_Start": 307.71999999999997,
      "Time_End": 312.91999999999996,
      "Text": " to ensure yourself or your organization or to detect malicious intents in the"
    },
    {
      "Time_Start": 312.91999999999996,
      "Time_End": 316.35999999999996,
      "Text": " software that is being shipped to you? Like, the only thing that came to my mind,"
    },
    {
      "Time_Start": 316.35999999999996,
      "Time_End": 320.64,
      "Text": " okay, I can take the binaries, I can install it on the sandbox environment, I"
    },
    {
      "Time_Start": 320.64,
      "Time_End": 328.44,
      "Text": " can employ me or my friends to reverse engineer the software, analyze byte by"
    },
    {
      "Time_Start": 328.64,
      "Time_End": 333.52,
      "Text": " byte every function that is there, and then I will be able to, in majority, of"
    },
    {
      "Time_Start": 333.52,
      "Time_End": 338.88,
      "Text": " course, claim that, okay, I didn't see anything suspicious. If you go to the"
    },
    {
      "Time_Start": 338.88,
      "Time_End": 343.52,
      "Text": " doctor, the doctor will never say to you, okay, you're healthy. The doctor"
    },
    {
      "Time_Start": 343.52,
      "Time_End": 348.28,
      "Text": " will always tell you, I don't see anything suspicious. For me, you are"
    },
    {
      "Time_Start": 348.28,
      "Time_End": 353.64,
      "Text": " not looking sick. They will not tell you that you're 100% healthy because you"
    },
    {
      "Time_Start": 353.64,
      "Time_End": 359.03999999999996,
      "Text": " may not be healthy. So, even if I would reverse spend, like, half a year on"
    },
    {
      "Time_Start": 359.03999999999996,
      "Time_End": 363.28,
      "Text": " reverse engineering, I wouldn't feel comfortable on telling somebody else"
    },
    {
      "Time_Start": 363.28,
      "Time_End": 367.68,
      "Text": " that I definitely certified that this binary, especially huge binary, is"
    },
    {
      "Time_Start": 367.68,
      "Time_End": 374.4,
      "Text": " definitely safe and free from debuggers. And the discussion continues. I'm not"
    },
    {
      "Time_Start": 374.4,
      "Time_End": 378.76,
      "Text": " saying that the manual installation is the answer, and the guy proposed three"
    },
    {
      "Time_Start": 378.92,
      "Time_End": 384.88,
      "Text": " things. Check if the update is critical or not, and not install it. Like, the"
    },
    {
      "Time_Start": 384.88,
      "Time_End": 389.32,
      "Text": " whole idea of shipping the updates quickly is to install them, especially if"
    },
    {
      "Time_Start": 389.32,
      "Time_End": 395.36,
      "Text": " the software is high-privileged software, and in the most cases, vendors are not"
    },
    {
      "Time_Start": 395.36,
      "Time_End": 400.0,
      "Text": " providing updates because they just, you know, okay, let's release the update. This"
    },
    {
      "Time_Start": 400.0,
      "Time_End": 406.8,
      "Text": " is the 22nd of the middle of the summer, let's just release the update. They're"
    },
    {
      "Time_Start": 406.8,
      "Time_End": 410.8,
      "Text": " releasing update because they fixed something, probably. Maybe cosmetic things"
    },
    {
      "Time_Start": 410.8,
      "Time_End": 417.06,
      "Text": " like user interface button was moved left, or maybe a security issue. To check"
    },
    {
      "Time_Start": 417.06,
      "Time_End": 423.40000000000003,
      "Text": " on the sandbox, if there's nothing suspicious, like, I deeply believe that"
    },
    {
      "Time_Start": 423.40000000000003,
      "Time_End": 430.84000000000003,
      "Text": " sandbox approach is working, but I will give a huge bottle of very pricey beer"
    },
    {
      "Time_Start": 430.84000000000003,
      "Time_End": 435.08000000000004,
      "Text": " to person that would be able to run a very complex software on the sandbox, and"
    },
    {
      "Time_Start": 435.12,
      "Time_End": 439.84,
      "Text": " point a finger, okay, this is a malicious intent. For all the hundreds of the"
    },
    {
      "Time_Start": 439.84,
      "Time_End": 445.35999999999996,
      "Text": " behavioral things that were registered, like access to the disk, access to the"
    },
    {
      "Time_Start": 445.35999999999996,
      "Time_End": 449.4,
      "Text": " memory, access to the registry, and all the other interactions, they will be able"
    },
    {
      "Time_Start": 449.4,
      "Time_End": 453.15999999999997,
      "Text": " to point the finger and say, oh, this is definitely malicious because this IP"
    },
    {
      "Time_Start": 453.15999999999997,
      "Time_End": 458.24,
      "Text": " address starts from 5. And to ensure that no external communication is being"
    },
    {
      "Time_Start": 458.24,
      "Time_End": 462.36,
      "Text": " allowed, and this is very problematic because, for example, the solar wings"
    },
    {
      "Time_Start": 462.36,
      "Time_End": 469.40000000000003,
      "Text": " needed a lot of network communication, of course, local communication, but if you,"
    },
    {
      "Time_Start": 469.40000000000003,
      "Time_End": 474.68,
      "Text": " nowadays, it is hard to have a software that doesn't require network"
    },
    {
      "Time_Start": 474.68,
      "Time_End": 483.64,
      "Text": " communication. Like, I don't know, most of them require, so even, for example, for"
    },
    {
      "Time_Start": 483.64,
      "Time_End": 489.92,
      "Text": " downloading the updates. So, yeah, this was perfect shot, like, don't install updates,"
    },
    {
      "Time_Start": 489.92,
      "Time_End": 493.36,
      "Text": " run your software on sandbox, and definitely this will fix the problem of"
    },
    {
      "Time_Start": 493.36,
      "Time_End": 500.84000000000003,
      "Text": " supply chain attacks. No. And again, if you try to discover what is the problem"
    },
    {
      "Time_Start": 500.84000000000003,
      "Time_End": 505.8,
      "Text": " with supply chain attacks, that's the problem. You have a third party that you"
    },
    {
      "Time_Start": 505.8,
      "Time_End": 508.48,
      "Text": " cannot trust that is supplying you stuff, and you need to run it on your"
    },
    {
      "Time_Start": 508.48,
      "Time_End": 515.64,
      "Text": " environment. And, as I said, running stuff and analyzing the results, maybe if you're"
    },
    {
      "Time_Start": 515.64,
      "Time_End": 521.52,
      "Text": " running malware and you definitely know what you're looking for. And it was a"
    },
    {
      "Time_Start": 521.52,
      "Time_End": 526.96,
      "Text": " moment when corporate approach kicked in. I was in my tie, I was sitting in my shirt,"
    },
    {
      "Time_Start": 526.96,
      "Time_End": 535.08,
      "Text": " in my corporate desk, and my approach changes. We don't have problems, we have"
    },
    {
      "Time_Start": 535.08,
      "Time_End": 548.76,
      "Text": " challenges. You're not sleeping, nice. So, I asked myself, okay, I can argue on the"
    },
    {
      "Time_Start": 548.76,
      "Time_End": 554.96,
      "Text": " LinkedIn, like everybody can do, but this is not moving us anywhere. Let's start"
    },
    {
      "Time_Start": 554.96,
      "Time_End": 562.6400000000001,
      "Text": " thinking, okay, how actually we can approach that problem. So, first thing of"
    },
    {
      "Time_Start": 562.76,
      "Time_End": 568.08,
      "Text": " problem solving, we need to well define what is actually the problem. So, let's start by"
    },
    {
      "Time_Start": 568.08,
      "Time_End": 573.36,
      "Text": " trying to articulate what is the problem. The problem is, who can provide the data"
    },
    {
      "Time_Start": 573.36,
      "Time_End": 577.92,
      "Text": " about expected behavior of the software? And, of course, the obvious answer here is,"
    },
    {
      "Time_Start": 577.92,
      "Time_End": 582.88,
      "Text": " like, you don't need to spend a lot of time on thinking, vendor, because they are building the"
    },
    {
      "Time_Start": 582.88,
      "Time_End": 590.68,
      "Text": " software. So, let's do this social experiment. Ask the vendor. So, you're opening Outlook,"
    },
    {
      "Time_Start": 590.8000000000001,
      "Time_End": 596.6400000000001,
      "Text": " starting our urgent request from our security department. Please provide the description,"
    },
    {
      "Time_Start": 596.6400000000001,
      "Time_End": 600.84,
      "Text": " what is the expected behavior of your software? Let's assume that this is simple software,"
    },
    {
      "Time_Start": 600.84,
      "Time_End": 605.44,
      "Text": " like, you know, business calculation or something like that. Regards, full bar,"
    },
    {
      "Time_Start": 605.44,
      "Time_End": 613.0400000000001,
      "Text": " sending the email, waiting a few days, waiting a few more days, and the answer is coming,"
    },
    {
      "Time_Start": 613.16,
      "Time_End": 621.64,
      "Text": " we are receiving the document with a logo. Second page, company mission. Second page,"
    },
    {
      "Time_Start": 621.64,
      "Time_End": 627.52,
      "Text": " term, the list of things that will be in the document, and the description why this product"
    },
    {
      "Time_Start": 627.52,
      "Time_End": 633.16,
      "Text": " is very special, and marketing description, what this stuff is doing, claiming to be a"
    },
    {
      "Time_Start": 633.16,
      "Time_End": 639.7199999999999,
      "Text": " behavior description, and the Gartner Square pointing, like, we're here, and we are very"
    },
    {
      "Time_Start": 639.72,
      "Time_End": 645.96,
      "Text": " unique, and the statement that you need to think before printing this document. Like,"
    },
    {
      "Time_Start": 645.96,
      "Time_End": 651.9200000000001,
      "Text": " I think majority of the people that are working in the big organizations would agree with me,"
    },
    {
      "Time_Start": 651.9200000000001,
      "Time_End": 657.08,
      "Text": " that, like, this is something that you will get if you will ask vendors that way, like,"
    },
    {
      "Time_Start": 657.08,
      "Time_End": 662.72,
      "Text": " provide me the description, you will get the PDF, maybe, maybe a word file, maybe a link to"
    },
    {
      "Time_Start": 662.72,
      "Time_End": 669.28,
      "Text": " the website with all that very important information, and this is not moving us anywhere"
    },
    {
      "Time_Start": 669.36,
      "Time_End": 676.92,
      "Text": " again. So, the real problem is not who can provide the data, because the vendor, this is the obvious"
    },
    {
      "Time_Start": 676.92,
      "Time_End": 686.56,
      "Text": " answer, but we just need to maybe ask more precisely for the data. So, okay, we're creating"
    },
    {
      "Time_Start": 686.56,
      "Time_End": 691.68,
      "Text": " another email, because this is response for the forward of the response, please provide the list"
    },
    {
      "Time_Start": 691.68,
      "Time_End": 696.52,
      "Text": " of domain IP addresses that your software needs to connect in order to work, like, they just focus"
    },
    {
      "Time_Start": 696.52,
      "Time_End": 701.76,
      "Text": " on IP addresses. What you will get, let's, like, make a vote, maybe there's something that you would"
    },
    {
      "Time_Start": 701.76,
      "Time_End": 709.0,
      "Text": " like to propose. Not a PDF, you will get an Excel file with a list of the domains. Okay, this is"
    },
    {
      "Time_Start": 709.0,
      "Time_End": 713.4399999999999,
      "Text": " better, because you can select the column, copy to the text file, and you will have the list of"
    },
    {
      "Time_Start": 713.4399999999999,
      "Time_End": 719.12,
      "Text": " things that you need to look for, or the opposite, you will get the list of the things that shouldn't"
    },
    {
      "Time_Start": 719.12,
      "Time_End": 727.68,
      "Text": " worry you, but this is only this one software. Is it scalable? No. Did you get the answer? Partially,"
    },
    {
      "Time_Start": 727.68,
      "Time_End": 734.24,
      "Text": " yes, but only for the network connectivity. So, let's move forward. How a responsible entity, and"
    },
    {
      "Time_Start": 734.24,
      "Time_End": 741.6,
      "Text": " we assume here that this is a vendor, can provide the data about expected behavior of the software,"
    },
    {
      "Time_Start": 741.76,
      "Time_End": 751.4,
      "Text": " and the side question, what is the behavior? So, let's pause here, and think about fixing the"
    },
    {
      "Time_Start": 751.4,
      "Time_End": 759.24,
      "Text": " supply chain problem in modern way. We don't need machine learning, we don't need sandboxing, we don't"
    },
    {
      "Time_Start": 759.24,
      "Time_End": 766.32,
      "Text": " need blockchain stuff and deception, because we already have too many security software on the"
    },
    {
      "Time_Start": 766.32,
      "Time_End": 772.32,
      "Text": " market. We have a network security protection, prevention, we have network intrusion detection,"
    },
    {
      "Time_Start": 772.32,
      "Time_End": 779.0,
      "Text": " network intrusion prevention, we have pattern-based detection on the network, and on the host, and"
    },
    {
      "Time_Start": 779.0,
      "Time_End": 786.08,
      "Text": " inside the memory even. We have endpoint protection, signature-based, behavioral-based, stuff that is"
    },
    {
      "Time_Start": 786.08,
      "Time_End": 791.5600000000001,
      "Text": " responsible just for monitoring and forwarding the data about the behavior to the central server,"
    },
    {
      "Time_Start": 791.72,
      "Time_End": 798.5200000000001,
      "Text": " then to process it and apply the rules. Of course, we have stuff that is based on blockchain and"
    },
    {
      "Time_Start": 798.5200000000001,
      "Time_End": 807.5600000000001,
      "Text": " artificial intelligence, but this is useless. But this all stuff that I enlisted, and probably most"
    },
    {
      "Time_Start": 807.5600000000001,
      "Time_End": 817.2800000000001,
      "Text": " of you are working on daily basis with that kind of software, is ineffective alone. Like a quotation"
    },
    {
      "Time_Start": 817.28,
      "Time_End": 821.8399999999999,
      "Text": " from the Shrek, the security is like onion, you need to have liars. So, you need to have liars of"
    },
    {
      "Time_Start": 821.8399999999999,
      "Time_End": 827.64,
      "Text": " security products. You have an endpoint protection, because if the network protection will fail,"
    },
    {
      "Time_Start": 827.64,
      "Time_End": 835.52,
      "Text": " maybe the endpoint protection will pick up the attack and alert you, and maybe stop the attack."
    },
    {
      "Time_Start": 835.52,
      "Time_End": 843.36,
      "Text": " All the stuff that I listed here is very vendor-specific, like you are configuring the stuff"
    },
    {
      "Time_Start": 843.36,
      "Time_End": 849.04,
      "Text": " in a very vendor-specific way. Most probably, this is a web interface that you need to click."
    },
    {
      "Time_Start": 849.04,
      "Time_End": 858.96,
      "Text": " Even if you apply fancy rules like, okay, let's combine detection of a specific execution path,"
    },
    {
      "Time_Start": 858.96,
      "Time_End": 866.6800000000001,
      "Text": " etc. You are putting that knowledge and that configuration in a web interface. Maybe in"
    },
    {
      "Time_Start": 866.6800000000001,
      "Time_End": 872.9200000000001,
      "Text": " some cases you have a configuration file being uploaded, maybe. But this is very vendor-specific,"
    },
    {
      "Time_Start": 873.0000000000001,
      "Time_End": 878.2400000000001,
      "Text": " and definitely you cannot just ship this configuration when you're changing, I don't know,"
    },
    {
      "Time_Start": 878.2400000000001,
      "Time_End": 883.6,
      "Text": " antivirus vendor from one to another. You cannot merge the configuration from one place to another,"
    },
    {
      "Time_Start": 883.6,
      "Time_End": 888.6,
      "Text": " because this is vendor-specific. Even if you probably use the button export configuration,"
    },
    {
      "Time_Start": 888.6,
      "Time_End": 894.96,
      "Text": " you will end up with binary crap that is only parsable by this specific software. So, in the"
    },
    {
      "Time_Start": 894.96,
      "Time_End": 901.44,
      "Text": " same category, like antivirus endpoint protection or network protection, the functionality is even"
    },
    {
      "Time_Start": 901.44,
      "Time_End": 907.24,
      "Text": " heavily inconsistent. There's no, like, one baseline that we should look for. There's no"
    },
    {
      "Time_Start": 907.24,
      "Time_End": 914.6,
      "Text": " list of events that we should look at on the operating system level. Most probably, the majority"
    },
    {
      "Time_Start": 914.6,
      "Time_End": 919.4000000000001,
      "Text": " of the security solutions are logging things like, I don't know, create process activity."
    },
    {
      "Time_Start": 919.4000000000001,
      "Time_End": 927.2800000000001,
      "Text": " Most security processes are logging the network activity. But, for example, and this is an open"
    },
    {
      "Time_Start": 927.28,
      "Time_End": 934.9599999999999,
      "Text": " question, I never saw a security product that was logging create process function call and the"
    },
    {
      "Time_Start": 934.9599999999999,
      "Time_End": 940.48,
      "Text": " flag if the process is being created, suspended or not. But everybody who was working on pair"
    },
    {
      "Time_Start": 940.48,
      "Time_End": 947.56,
      "Text": " hollowing method knows that this is like the obvious way to detect that. And I didn't saw"
    },
    {
      "Time_Start": 947.56,
      "Time_End": 955.3199999999999,
      "Text": " any kind of functionality on the market. Of course, there's an exception. Most of those security stuff"
    },
    {
      "Time_Start": 955.32,
      "Time_End": 962.6400000000001,
      "Text": " is ingesting IOCs. But this is the result of the IOC becoming industry standard in terms of"
    },
    {
      "Time_Start": 962.6400000000001,
      "Time_End": 971.1600000000001,
      "Text": " digesting things. A side question here, how do you store your configuration? You have firewalls,"
    },
    {
      "Time_Start": 971.1600000000001,
      "Time_End": 977.96,
      "Text": " you have stateless firewalls, stateful firewalls, new generation firewalls, new generation web 3.0"
    },
    {
      "Time_Start": 977.96,
      "Time_End": 984.24,
      "Text": " firewalls, endpoint protection, antivirus, EDR, host-based firewall, application-wide listing"
    },
    {
      "Time_Start": 984.36,
      "Time_End": 990.96,
      "Text": " rules, URLs and whatever. You have multiple layers. And how do you store the configuration"
    },
    {
      "Time_Start": 990.96,
      "Time_End": 1001.08,
      "Text": " of those solutions? Most probably, a case study based on firewall, good old, sorry, this was the"
    },
    {
      "Time_Start": 1001.08,
      "Time_End": 1010.84,
      "Text": " next slide. In most cases, in big organization, the configuration is stored in the series of"
    },
    {
      "Time_Start": 1011.0400000000001,
      "Time_End": 1017.88,
      "Text": " word documents that are describing the changes that are you applying one by one. Maybe the"
    },
    {
      "Time_Start": 1017.88,
      "Time_End": 1025.8,
      "Text": " appliance is holding the recent version of the rule set configuration. And the only"
    },
    {
      "Time_Start": 1025.8,
      "Time_End": 1030.88,
      "Text": " copy, cold copy of that is if you are making a backup, of course, you're making a backup or"
    },
    {
      "Time_Start": 1030.88,
      "Time_End": 1036.4,
      "Text": " snapshot. As I said before, most probably there's no way to switch the vendor. If you will,"
    },
    {
      "Time_Start": 1036.88,
      "Time_End": 1042.72,
      "Text": " if you, for example, just switch the vendor of the firewall, like switch Palo Alto to Cisco,"
    },
    {
      "Time_Start": 1042.72,
      "Time_End": 1050.5600000000002,
      "Text": " Cisco Palo Alto, merging the rule set is a bit challenging. And there's no way that you will"
    },
    {
      "Time_Start": 1050.5600000000002,
      "Time_End": 1055.92,
      "Text": " find a provider on the market that will say, okay, we will merge one and one and you will,"
    },
    {
      "Time_Start": 1055.92,
      "Time_End": 1062.48,
      "Text": " we will guarantee the functionality. Anyone storing that kind of configuration again managed"
    },
    {
      "Time_Start": 1062.48,
      "Time_End": 1070.32,
      "Text": " to do that in the text files. So, you're sleeping or nobody's doing that. Let's get back to the"
    },
    {
      "Time_Start": 1070.32,
      "Time_End": 1078.68,
      "Text": " real problem. So, let's apply again the corporate approach to solve the problem. Background is,"
    },
    {
      "Time_Start": 1078.68,
      "Time_End": 1085.16,
      "Text": " how can we get the information about the intended behavior of the software? Current situation is"
    },
    {
      "Time_Start": 1085.16,
      "Time_End": 1093.3600000000001,
      "Text": " that as I showed and nobody objected. If we will ask vendor, we'll get word documents or PDFs. This"
    },
    {
      "Time_Start": 1093.3600000000001,
      "Time_End": 1099.6000000000001,
      "Text": " is completely useless crap. What is our target? We want to get the knowledge that's about the"
    },
    {
      "Time_Start": 1099.6000000000001,
      "Time_End": 1105.24,
      "Text": " behavior, about the expected behavior and the way that the computers and the humans can read it,"
    },
    {
      "Time_Start": 1105.24,
      "Time_End": 1111.4,
      "Text": " parse it and consume it. The root cause is most probably there is no well-defined format to"
    },
    {
      "Time_Start": 1111.4,
      "Time_End": 1119.2,
      "Text": " exchange that kind of information. What are the countermeasures? Let's propose the format."
    },
    {
      "Time_Start": 1119.2,
      "Time_End": 1128.16,
      "Text": " Let's do it, like we did that years ago. We created a IOC standard, like how can we exchange the"
    },
    {
      "Time_Start": 1128.16,
      "Time_End": 1137.3200000000002,
      "Text": " knowledge about behavioral events that indicates the infrastructure being compromised. It's working,"
    },
    {
      "Time_Start": 1137.36,
      "Time_End": 1141.8799999999999,
      "Text": " we are exchanging that data. We even have a fancy protocols of exchanging that data."
    },
    {
      "Time_Start": 1141.8799999999999,
      "Time_End": 1148.8,
      "Text": " The implementation plan, let's make a POC, ask people about the opinion, put stuff on the GitHub"
    },
    {
      "Time_Start": 1148.8,
      "Time_End": 1158.8,
      "Text": " and get drinks. So, I'm introducing now the indicators of normality, the things that is"
    },
    {
      "Time_Start": 1158.8,
      "Time_End": 1165.6,
      "Text": " quite obvious consequence of indicators of compromise. Why not indicators of compromise?"
    },
    {
      "Time_Start": 1165.68,
      "Time_End": 1171.0000000000002,
      "Text": " Because if you are detecting indicator of compromises in the neural network, as I said,"
    },
    {
      "Time_Start": 1171.0000000000002,
      "Time_End": 1178.2400000000002,
      "Text": " this is already a bad situation. So, we need to reverse the process. Why application whitelisting"
    },
    {
      "Time_Start": 1178.2400000000002,
      "Time_End": 1183.5600000000002,
      "Text": " is working? Because you're whitelisting the application, you know what you're whitelisting,"
    },
    {
      "Time_Start": 1183.5600000000002,
      "Time_End": 1188.5200000000002,
      "Text": " you're not blacklisting things because you don't know what you need to blacklist, but you may know"
    },
    {
      "Time_Start": 1188.6399999999999,
      "Time_End": 1199.4,
      "Text": " what you want to whitelist. Why? What do we want to achieve? We want to achieve the consistent way"
    },
    {
      "Time_Start": 1199.4,
      "Time_End": 1205.68,
      "Text": " of describing the expected behavior. I'm repeating that like a third time or something, and it needs"
    },
    {
      "Time_Start": 1205.68,
      "Time_End": 1211.08,
      "Text": " to be exchangeable. It needs to be possible for both computers and humans, because otherwise,"
    },
    {
      "Time_Start": 1211.08,
      "Time_End": 1217.6399999999999,
      "Text": " people won't be able to assess if this set of rules or set of description is accurate or not."
    },
    {
      "Time_Start": 1218.48,
      "Time_End": 1224.24,
      "Text": " It should be a primary golden source for virus security liars. Like, if we have this source of"
    },
    {
      "Time_Start": 1224.24,
      "Time_End": 1232.68,
      "Text": " description, we later on can export or extract stuff from this configuration. So, from this"
    },
    {
      "Time_Start": 1232.68,
      "Time_End": 1238.5200000000002,
      "Text": " golden source to our endpoint configuration and the endpoint firewall, EDR or whatever"
    },
    {
      "Time_Start": 1238.6,
      "Time_End": 1251.68,
      "Text": " fancy software you are using. And by defining the entities that we expect as being a description of"
    },
    {
      "Time_Start": 1251.68,
      "Time_End": 1257.52,
      "Text": " the behavior, we can have consistent expectations from the vendors. For example, if you have a very"
    },
    {
      "Time_Start": 1257.52,
      "Time_End": 1263.72,
      "Text": " obvious description that we want to have the ability to monitor network security, we can expect"
    },
    {
      "Time_Start": 1263.88,
      "Time_End": 1270.6000000000001,
      "Text": " that if we will onboard a vendor, we are expecting that this product needs to monitor network"
    },
    {
      "Time_Start": 1270.6000000000001,
      "Time_End": 1278.3600000000001,
      "Text": " activity. Who is responsible? Vendors, of course, because they are shipping software. Security"
    },
    {
      "Time_Start": 1278.3600000000001,
      "Time_End": 1286.04,
      "Text": " department, because some vendors are very hard to cooperate, so the security department will be"
    },
    {
      "Time_Start": 1286.04,
      "Time_End": 1293.1200000000001,
      "Text": " responsible. Or anyone, like IOCs are being created by the community. You can pay for generating IOCs,"
    },
    {
      "Time_Start": 1293.1200000000001,
      "Time_End": 1298.44,
      "Text": " or you can generate them on your own and it will work. Stuff will ingest your data and you will"
    },
    {
      "Time_Start": 1298.44,
      "Time_End": 1309.72,
      "Text": " get the detection. Why? Because we already put some effort on, we already persuaded vendors that"
    },
    {
      "Time_Start": 1309.72,
      "Time_End": 1316.16,
      "Text": " are supplying us with the software to put some effort on the security. From the functionality"
    },
    {
      "Time_Start": 1316.16,
      "Time_End": 1322.68,
      "Text": " perspective, and if you disagree, raise a hand. Both things that I listed here, like a code signing"
    },
    {
      "Time_Start": 1322.8,
      "Time_End": 1328.2,
      "Text": " and a hash publication, is completely worthless. It is not adding additional security to the"
    },
    {
      "Time_Start": 1328.2,
      "Time_End": 1335.96,
      "Text": " software. It is adding another security layer. Code signing allows you to sign the code, and if"
    },
    {
      "Time_Start": 1335.96,
      "Time_End": 1340.92,
      "Text": " you download it, you are able to verify if that code was shipped and signed by this specific"
    },
    {
      "Time_Start": 1340.92,
      "Time_End": 1346.0800000000002,
      "Text": " holder of this certificate. From the business perspective, this is a cost, because they need"
    },
    {
      "Time_Start": 1346.08,
      "Time_End": 1354.32,
      "Text": " to acquire a quite costly certificate. They need to maintain the key management. They need to keep"
    },
    {
      "Time_Start": 1354.32,
      "Time_End": 1359.6,
      "Text": " the key safe, because if the key leaks, you get the, I don't know, Windows driver signed by the"
    },
    {
      "Time_Start": 1359.6,
      "Time_End": 1365.4399999999998,
      "Text": " leaked certificate. So, this is costly. And from the overall perspective, this is not improving,"
    },
    {
      "Time_Start": 1365.4399999999998,
      "Time_End": 1370.6399999999999,
      "Text": " I don't know, the quality of the software. The software is not running faster if it is being"
    },
    {
      "Time_Start": 1370.68,
      "Time_End": 1378.64,
      "Text": " signed. Hash publication. This is maybe not so cost-ineffective, because you just need to"
    },
    {
      "Time_Start": 1378.64,
      "Time_End": 1385.2,
      "Text": " calculate a hash of your binaries and publish them on your website, but this is an additional"
    },
    {
      "Time_Start": 1385.2,
      "Time_End": 1390.8000000000002,
      "Text": " process that is also not improving the efficiency of your software. This is just a security feature"
    },
    {
      "Time_Start": 1390.8000000000002,
      "Time_End": 1396.6000000000001,
      "Text": " that allows people, when your code is, for example, not signed, to verify if they have the right"
    },
    {
      "Time_Start": 1396.6000000000001,
      "Time_End": 1404.72,
      "Text": " binaries on the disk. A very simple operation. Do's and don'ts. The thing that I would like"
    },
    {
      "Time_Start": 1404.72,
      "Time_End": 1412.44,
      "Text": " to propose is the idea may help to improve or solve partial problems with the security,"
    },
    {
      "Time_Start": 1412.44,
      "Time_End": 1418.68,
      "Text": " especially in terms of shipping a third-party stuff in your infrastructure. It is just a format."
    },
    {
      "Time_Start": 1418.68,
      "Time_End": 1425.0000000000002,
      "Text": " This is not an implementation. This is not a solution. I'm not creating EDR, XDR, endpoint"
    },
    {
      "Time_Start": 1425.0,
      "Time_End": 1430.2,
      "Text": " protection, firewall, whatever, and definitely not a blockchain. This is something like IOCs."
    },
    {
      "Time_Start": 1430.2,
      "Time_End": 1435.8,
      "Text": " IOC is just a specification, how we will write the data. And definitely, this is not a silver"
    },
    {
      "Time_Start": 1435.8,
      "Time_End": 1441.04,
      "Text": " bullet. This will not solve all the security problems. This will help us to improve the"
    },
    {
      "Time_Start": 1441.04,
      "Time_End": 1450.68,
      "Text": " security and maybe fix some specific problems. Let me show you what I had in mind when I was"
    },
    {
      "Time_Start": 1450.76,
      "Time_End": 1457.4,
      "Text": " working on the format. We have already rules that are human and computer readable, like Sigma rules,"
    },
    {
      "Time_Start": 1457.4,
      "Time_End": 1467.24,
      "Text": " Yaro rules. Anybody here wrote a Swagger OpenAPI profile for your web application? Yes? You can"
    },
    {
      "Time_Start": 1467.24,
      "Time_End": 1475.0800000000002,
      "Text": " describe in human readable form what your whole web application is implementing, like all the"
    },
    {
      "Time_Start": 1475.84,
      "Time_End": 1482.3999999999999,
      "Text": " HTTP requests that can be done to your application, and you have a way to describe that. And this is"
    },
    {
      "Time_Start": 1482.3999999999999,
      "Time_End": 1488.0,
      "Text": " still human readable and computer readable. Rules that need to be human readable, well-structured,"
    },
    {
      "Time_Start": 1488.0,
      "Time_End": 1495.1999999999998,
      "Text": " you need to be able to make a very easy, in a very easy way, a diff between two files when"
    },
    {
      "Time_Start": 1495.1999999999998,
      "Time_End": 1502.1599999999999,
      "Text": " something is changing. And the benefit of that, you are able to store it in the repository as a"
    },
    {
      "Time_Start": 1502.48,
      "Time_End": 1511.4,
      "Text": " text file, so you are able to track the changes over the time. Rules in that format can, the"
    },
    {
      "Time_Start": 1511.4,
      "Time_End": 1517.2,
      "Text": " purpose is that those rules can be later on translated, exported, or, I don't know, compiled"
    },
    {
      "Time_Start": 1517.2,
      "Time_End": 1523.0400000000002,
      "Text": " to the other formats. So, for example, to AppArmor, Linux, AppLocker, Sysmon, Proxmon rules,"
    },
    {
      "Time_Start": 1523.0400000000002,
      "Time_End": 1529.5600000000002,
      "Text": " whatever you have in your infrastructure. AppArmor is a very good example because they"
    },
    {
      "Time_Start": 1529.56,
      "Time_End": 1536.6799999999998,
      "Text": " are already providing very similar functionality, but please raise a hand whoever read AppArmor"
    },
    {
      "Time_Start": 1536.6799999999998,
      "Time_End": 1544.44,
      "Text": " configuration file. Like, look inside. One, two. It is working, but this definitely, the part of"
    },
    {
      "Time_Start": 1544.44,
      "Time_End": 1550.28,
      "Text": " human readable is not working there. Like, yeah, you can take a piece of paper and start drawing"
    },
    {
      "Time_Start": 1550.28,
      "Time_End": 1557.2,
      "Text": " things and maybe you will understand, but this is definitely not so obvious. And let's apply some"
    },
    {
      "Time_Start": 1558.04,
      "Time_End": 1569.1200000000001,
      "Text": " old Python Xen. Explicit over implicit. The readability is important. If our format needs"
    },
    {
      "Time_Start": 1569.1200000000001,
      "Time_End": 1572.92,
      "Text": " additional explanation, this is a bad idea. So, this format needs to be easy to understand,"
    },
    {
      "Time_Start": 1572.92,
      "Time_End": 1579.32,
      "Text": " even for the person that didn't read this documentation for that. So, yeah, this is the"
    },
    {
      "Time_Start": 1579.32,
      "Time_End": 1585.1200000000001,
      "Text": " format how we will store it. The problem, of course, there's a, quickly we will pick up the"
    },
    {
      "Time_Start": 1585.72,
      "Time_End": 1590.72,
      "Text": " problem of signing those rules because if the vendor will be releasing them, we need to have a"
    },
    {
      "Time_Start": 1590.72,
      "Time_End": 1599.0400000000002,
      "Text": " way to verify the integrity of the file so we can put them into the JWT so the vendor can sign it."
    },
    {
      "Time_Start": 1599.0400000000002,
      "Time_End": 1603.44,
      "Text": " Probably maybe using even the same certificate that you're using for code signing, which is"
    },
    {
      "Time_Start": 1603.44,
      "Time_End": 1611.7600000000002,
      "Text": " asymmetric key. And this is an example of the rule. We have very simple structure. We're defining the,"
    },
    {
      "Time_Start": 1611.8799999999999,
      "Time_End": 1619.2,
      "Text": " we have categories like network behavior, file system behavior. Let me show you the file itself."
    },
    {
      "Time_Start": 1619.2,
      "Time_End": 1630.16,
      "Text": " Yeah, so we have some metadata like any other formats. Targets, so we are defining what files,"
    },
    {
      "Time_Start": 1630.16,
      "Time_End": 1638.36,
      "Text": " what, to what files should we apply this rule set to. And basically, the rule set is here. So,"
    },
    {
      "Time_Start": 1638.3600000000001,
      "Time_End": 1643.3600000000001,
      "Text": " for example, for network, we specify that this piece of software is allowed to connect to,"
    },
    {
      "Time_Start": 1643.3600000000001,
      "Time_End": 1649.92,
      "Text": " example, COM on port 80. If our solution is allowing us to implement layer 7 inspection,"
    },
    {
      "Time_Start": 1649.92,
      "Time_End": 1655.4,
      "Text": " we have the information that we expect HTTP there. If our solution is not allowing us to do so,"
    },
    {
      "Time_Start": 1655.4,
      "Time_End": 1663.1200000000001,
      "Text": " we just can leave with port TCP and only that information. On the file system, we can specify"
    },
    {
      "Time_Start": 1663.44,
      "Time_End": 1671.72,
      "Text": " what paths, what files can be open and accessed by the software. And the idea behind the whole"
    },
    {
      "Time_Start": 1671.72,
      "Time_End": 1680.0800000000002,
      "Text": " rule set is to apply the allow-deny order. So, if something is not being allowed explicitly,"
    },
    {
      "Time_Start": 1680.0800000000002,
      "Time_End": 1686.1200000000001,
      "Text": " it means that it is not being allowed at all. So, if you don't want your software to touch the file"
    },
    {
      "Time_Start": 1686.1200000000001,
      "Time_End": 1690.64,
      "Text": " system, you're just leaving the file system section empty. And basically, it means that"
    },
    {
      "Time_Start": 1690.64,
      "Time_End": 1699.1200000000001,
      "Text": " your software doesn't supposed to touch anything on the disk. Exec means what kind of child"
    },
    {
      "Time_Start": 1699.1200000000001,
      "Time_End": 1707.68,
      "Text": " processes should be allowed to be spawned by that process. Registry, this is very platform specific."
    },
    {
      "Time_Start": 1707.68,
      "Time_End": 1716.72,
      "Text": " Parents means what can we expect in terms of our process being spawned from. And environment means"
    },
    {
      "Time_Start": 1717.08,
      "Time_End": 1724.76,
      "Text": " we can put some information what are the allowed or not allowed environment variables that are"
    },
    {
      "Time_Start": 1724.76,
      "Time_End": 1732.24,
      "Text": " being used by our software. This is quite basic. The format is extendable. So, we can, if we think"
    },
    {
      "Time_Start": 1732.24,
      "Time_End": 1738.28,
      "Text": " about like, I don't know, maybe let's add what is the current temperature in the room and the"
    },
    {
      "Time_Start": 1738.28,
      "Time_End": 1742.96,
      "Text": " software only needs to be operated in a specific range of temperature, we can add a section here."
    },
    {
      "Time_Start": 1742.96,
      "Time_End": 1751.56,
      "Text": " Not a problem. How to generate that stuff? Vendors can use a code annotation. They are"
    },
    {
      "Time_Start": 1751.56,
      "Time_End": 1757.68,
      "Text": " already using code annotation to generate the documentation. Like, whoever spent some time on"
    },
    {
      "Time_Start": 1757.68,
      "Time_End": 1764.44,
      "Text": " developing software knows that in most modern programming languages, you can put a code"
    },
    {
      "Time_Start": 1764.44,
      "Time_End": 1771.0,
      "Text": " annotation in the comments in your code. And just by having them in the code, you can create a"
    },
    {
      "Time_Start": 1771.08,
      "Time_End": 1781.88,
      "Text": " documentation that will describe how your code is working, what API are you exposing. So, we can try"
    },
    {
      "Time_Start": 1781.88,
      "Time_End": 1787.92,
      "Text": " to make a code annotation. So, for example, if we have, and this is an obvious way to do that,"
    },
    {
      "Time_Start": 1787.92,
      "Time_End": 1791.84,
      "Text": " if we have a function that is, I don't know, loading a configuration file from the disk,"
    },
    {
      "Time_Start": 1791.84,
      "Time_End": 1797.48,
      "Text": " we can add a code annotation that we expect read and write access to the specific file on the disk."
    },
    {
      "Time_Start": 1797.48,
      "Time_End": 1804.64,
      "Text": " Of course, we can generate that profile by sandboxing, monitoring, etc. So, we can just"
    },
    {
      "Time_Start": 1804.64,
      "Time_End": 1811.64,
      "Text": " list the events that are happening and add them to the whitelist. Or we can just do the"
    },
    {
      "Time_Start": 1811.64,
      "Time_End": 1818.48,
      "Text": " manual work. And let me show you an example of the rule. For example, a very obvious rule for notepad."
    },
    {
      "Time_Start": 1818.48,
      "Time_End": 1837.8,
      "Text": " Okay. So, this is a rule for the notepad. Notepad's supposed to open read and write"
    },
    {
      "Time_Start": 1837.8,
      "Time_End": 1842.52,
      "Text": " files on the disk. It doesn't supposed to, I don't know, do a network communication,"
    },
    {
      "Time_Start": 1842.6399999999999,
      "Time_End": 1851.12,
      "Text": " spawn a process, I don't know, execute anything. Like, if you will see a notepad spawning a new"
    },
    {
      "Time_Start": 1851.12,
      "Time_End": 1856.56,
      "Text": " process, this is definitely not something expected from the notepad. So, in this way,"
    },
    {
      "Time_Start": 1856.56,
      "Time_End": 1863.68,
      "Text": " in those few lines of text, we created a profile for a notepad. A thing that is being commonly"
    },
    {
      "Time_Start": 1863.68,
      "Time_End": 1871.16,
      "Text": " used in very naive exploitation paths, but it will work. Later on, you can fit that knowledge"
    },
    {
      "Time_Start": 1871.16,
      "Time_End": 1877.3600000000001,
      "Text": " into your security solution and see, like, if there is something that is not fitting the profile,"
    },
    {
      "Time_Start": 1877.3600000000001,
      "Time_End": 1885.5600000000002,
      "Text": " this is definitely the indicator of being compromised. So, we're going back to the"
    },
    {
      "Time_Start": 1885.5600000000002,
      "Time_End": 1890.76,
      "Text": " indicator of the compromise, but we don't need to define explicitly that we are looking for"
    },
    {
      "Time_Start": 1890.76,
      "Time_End": 1897.0,
      "Text": " something malicious here. And let me show you an example of how we can see the changes in the file."
    },
    {
      "Time_Start": 1901.16,
      "Time_End": 1904.24,
      "Text": " Okay."
    },
    {
      "Time_Start": 1911.0,
      "Time_End": 1917.52,
      "Text": " Yeah, so, even if the attacker would manage to compromise the supply chain of the vendor,"
    },
    {
      "Time_Start": 1917.52,
      "Time_End": 1924.72,
      "Text": " and even if they manage to compromise this ION rule set, and the vendor will publish,"
    },
    {
      "Time_Start": 1924.72,
      "Time_End": 1930.3600000000001,
      "Text": " like, they will be, I don't know, stupid and will publish anything that will be delivered"
    },
    {
      "Time_Start": 1930.3600000000001,
      "Time_End": 1941.44,
      "Text": " by the pipeline. Anyone, without any reverse engineering, can take a look on that and see,"
    },
    {
      "Time_Start": 1941.44,
      "Time_End": 1947.5200000000002,
      "Text": " okay, somebody added a huge section here, and the software that previously, in past,"
    },
    {
      "Time_Start": 1947.5200000000002,
      "Time_End": 1956.3200000000002,
      "Text": " over the past five years, was not executing anything, is, like, allowed to execute arbitrary"
    },
    {
      "Time_Start": 1956.3999999999999,
      "Time_End": 1964.3999999999999,
      "Text": " binary from the disk. There are still some open problems, like how can we put pin policy to a"
    },
    {
      "Time_Start": 1964.3999999999999,
      "Time_End": 1970.2,
      "Text": " binary using hash signatures, etc. How can we handle a script interpreters or load bins? This"
    },
    {
      "Time_Start": 1970.2,
      "Time_End": 1980.36,
      "Text": " is an open subject. One of the ideas here is to create a pattern for what arguments for the"
    },
    {
      "Time_Start": 1980.3600000000001,
      "Time_End": 1989.3200000000002,
      "Text": " process are being allowed. And in terms of networking, there's always a problem in domain"
    },
    {
      "Time_Start": 1989.3200000000002,
      "Time_End": 1998.2400000000002,
      "Text": " name resolution versus time to check versus time to use DNS rebinding, etc. But I think those are"
    },
    {
      "Time_Start": 1998.2400000000002,
      "Time_End": 2006.64,
      "Text": " the minor problems here. I want to thank, to give a big thank to everybody who I asked about the"
    },
    {
      "Time_Start": 2006.64,
      "Time_End": 2012.5600000000002,
      "Text": " opinion or help on that subject here for over the past year. I don't want to list them because"
    },
    {
      "Time_Start": 2012.5600000000002,
      "Time_End": 2018.6000000000001,
      "Text": " there's, like, a huge list of the person and I may miss somebody, so big thank you to everybody"
    },
    {
      "Time_Start": 2018.6000000000001,
      "Time_End": 2023.3200000000002,
      "Text": " who helped me on improving that. Please feel free to contribute."
    }
  ]
}