{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 13.120000000000001,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay. Well, thank you so much for having me today. I'm excited to speak here at ZeefCon."
    },
    {
      "Time_Start": 13.120000000000001,
      "Time_End": 18.04,
      "Text": " Sorry I couldn't be there in person, but it looks like a lot of the conference attendees"
    },
    {
      "Time_Start": 18.04,
      "Time_End": 22.96,
      "Text": " are having a good time with my colleagues, George Orchias and Chris Peacock. So it's"
    },
    {
      "Time_Start": 22.96,
      "Time_End": 27.76,
      "Text": " been good to at least catch up and see some of those pictures on Twitter. Today, I'm going"
    },
    {
      "Time_Start": 27.76,
      "Time_End": 33.760000000000005,
      "Text": " to get to talk about one of probably the most fun things for me is talking a little bit"
    },
    {
      "Time_Start": 33.760000000000005,
      "Time_End": 38.56,
      "Text": " more about execution methods and diving deep onto the specific topic, because I think it's"
    },
    {
      "Time_Start": 38.56,
      "Time_End": 42.52,
      "Text": " something that's not quite visited enough when we're talking about some of our purple"
    },
    {
      "Time_Start": 42.52,
      "Time_End": 47.400000000000006,
      "Text": " teaming and how we're changing some of what we're doing as we test."
    },
    {
      "Time_Start": 47.400000000000006,
      "Time_End": 52.52,
      "Text": " So a little bit about myself. I'm the adversary emulation lead at Scythe currently. I've been"
    },
    {
      "Time_Start": 52.52,
      "Time_End": 57.080000000000005,
      "Text": " here about a year and a half now. Prior to my time at Scythe, I did security research"
    },
    {
      "Time_Start": 57.080000000000005,
      "Time_End": 62.040000000000006,
      "Text": " at Sandia National Labs, did a little bit of everything. I also worked at MITRE, which"
    },
    {
      "Time_Start": 62.040000000000006,
      "Time_End": 66.48,
      "Text": " most people are familiar with because of MITRE ATT&CK. So I worked with that team, the ATT&CK"
    },
    {
      "Time_Start": 66.48,
      "Time_End": 71.92,
      "Text": " evaluations team, and that was really where getting into the sort of open source focus"
    },
    {
      "Time_Start": 71.92,
      "Time_End": 76.72,
      "Text": " of cyber threat intelligence, as well as tying that to adversary emulation and some of our"
    },
    {
      "Time_Start": 76.88,
      "Time_End": 84.08,
      "Text": " testing. So I've been around in this space for probably about a decade now and excited to at"
    },
    {
      "Time_Start": 84.08,
      "Time_End": 89.03999999999999,
      "Text": " least share some of what I've been doing over the past couple of years. So three big things"
    },
    {
      "Time_Start": 89.03999999999999,
      "Time_End": 94.48,
      "Text": " that I hope you'll take away from this talk is the first, of course, is why execution methods"
    },
    {
      "Time_Start": 94.48,
      "Time_End": 100.88,
      "Text": " are a hard problem. It's why they make security challenging, because they're sort of the ground"
    },
    {
      "Time_Start": 100.88,
      "Time_End": 106.96,
      "Text": " floor of everything else that we build things on. Second thing would be the mindset for how"
    },
    {
      "Time_Start": 106.96,
      "Time_End": 112.8,
      "Text": " you can do some tests and depth of testing with different execution methods. We often focus on"
    },
    {
      "Time_Start": 112.8,
      "Time_End": 119.52,
      "Text": " different types of techniques and working across MITRE ATT&CK matrix in this instance. And I really"
    },
    {
      "Time_Start": 119.52,
      "Time_End": 126.16,
      "Text": " want to focus on trying to drill down on a few specific ones and focus our testing there."
    },
    {
      "Time_Start": 126.16,
      "Time_End": 130.0,
      "Text": " And then, of course, like a lot of talks, I want to make sure that there's a ton of resources for"
    },
    {
      "Time_Start": 130.0,
      "Time_End": 133.68,
      "Text": " you to work off of. So regardless of whether you're able to apply this in an enterprise"
    },
    {
      "Time_Start": 133.68,
      "Time_End": 138.96,
      "Text": " environment or you're a student or someone that's working from home or in your own lab environment,"
    },
    {
      "Time_Start": 138.96,
      "Time_End": 143.28,
      "Text": " that you still have a lot of different options to choose from when you're trying to learn more"
    },
    {
      "Time_Start": 143.28,
      "Time_End": 148.4,
      "Text": " about this topic. So what are execution methods? So I took this from"
    },
    {
      "Time_Start": 190.16,
      "Time_End": 195.76,
      "Text": " All right. Let's talk about execution methods. And just to give an example here,"
    },
    {
      "Time_Start": 196.48,
      "Time_End": 201.92,
      "Text": " let's talk about process discovery. So process discovery is T1057, for those of you that aren't"
    },
    {
      "Time_Start": 201.92,
      "Time_End": 206.96,
      "Text": " familiar with it. There's a bunch of different ways to execute it. And so if you've followed"
    },
    {
      "Time_Start": 206.96,
      "Time_End": 212.0,
      "Text": " me, you've seen some of this before, where there's tons of different ways to execute it."
    },
    {
      "Time_Start": 212.0,
      "Time_End": 217.6,
      "Text": " We've got task list, get process. You can use other tools. And the difference between all of"
    },
    {
      "Time_Start": 217.6,
      "Time_End": 223.76,
      "Text": " these, even though they're all tying to the exact same technique, is the execution methods,"
    },
    {
      "Time_Start": 223.76,
      "Time_End": 230.79999999999998,
      "Text": " whether it's command line, PowerShell, WMI, or the Windows Native API. And so that's one of the"
    },
    {
      "Time_Start": 230.79999999999998,
      "Time_End": 235.2,
      "Text": " things that when I talk about variance and I talk about depth and execution methods,"
    },
    {
      "Time_Start": 235.2,
      "Time_End": 239.44,
      "Text": " it's about how we can change those and how, of course, those are going to impact our ability"
    },
    {
      "Time_Start": 239.44,
      "Time_End": 245.51999999999998,
      "Text": " to detect them. And this is how adversaries have been more and more moving towards changing what"
    },
    {
      "Time_Start": 245.52,
      "Time_End": 253.20000000000002,
      "Text": " they're doing. So why do they matter? One of the big things that execution methods give us"
    },
    {
      "Time_Start": 253.20000000000002,
      "Time_End": 260.08,
      "Text": " or give anyone is flexibility and expertise. This is across everything, whether it's legitimate use"
    },
    {
      "Time_Start": 260.08,
      "Time_End": 266.48,
      "Text": " cases, system administrators, operating systems are designed to have a wide number of use cases"
    },
    {
      "Time_Start": 266.48,
      "Time_End": 270.64,
      "Text": " and a wide number of users. So when we get to execution methods, just touching on some of the"
    },
    {
      "Time_Start": 270.64,
      "Time_End": 276.4,
      "Text": " ones we talked about previously, command line was obviously used first for systems administration,"
    },
    {
      "Time_Start": 276.4,
      "Time_End": 281.03999999999996,
      "Text": " things like that. We then, of course, have PowerShell. It's another big one that came"
    },
    {
      "Time_Start": 281.03999999999996,
      "Time_End": 286.88,
      "Text": " along. And so those are some of the ways that we're able to, that the operating systems are"
    },
    {
      "Time_Start": 286.88,
      "Time_End": 291.52,
      "Text": " able to sort of meet people where they're at and also provide new features while, of course,"
    },
    {
      "Time_Start": 291.52,
      "Time_End": 298.4,
      "Text": " especially in Windows, providing a lot of old legacy features so that people are able to continue"
    },
    {
      "Time_Start": 298.48,
      "Time_End": 304.40000000000003,
      "Text": " to leverage it. Telemetry inconsistencies. And this is sort of the heart of why execution methods"
    },
    {
      "Time_Start": 304.40000000000003,
      "Time_End": 310.24,
      "Text": " matter, is that getting information from each of them is a little bit different. And so being able"
    },
    {
      "Time_Start": 310.24,
      "Time_End": 316.64000000000004,
      "Text": " to write detections relies on that information. And of course, more and more adversaries or red team"
    },
    {
      "Time_Start": 317.28000000000003,
      "Time_End": 322.16,
      "Text": " research is done in order to try and find execution methods that don't have"
    },
    {
      "Time_Start": 322.16,
      "Time_End": 325.92,
      "Text": " any sort of telemetry or have low telemetry for defenders to work off of."
    },
    {
      "Time_Start": 326.8,
      "Time_End": 332.0,
      "Text": " And so part of that is you have to determine the intent behind the action. Because these are"
    },
    {
      "Time_Start": 332.0,
      "Time_End": 336.96000000000004,
      "Text": " leveraging different technologies that are part of an operating system that are there for legitimate"
    },
    {
      "Time_Start": 336.96000000000004,
      "Time_End": 343.36,
      "Text": " use cases, we have people, you have to determine whether or not it is a typical program, just a"
    },
    {
      "Time_Start": 343.36,
      "Time_End": 349.12,
      "Text": " Windows application that's doing that specific behavior or whether it's an adversary trying to"
    },
    {
      "Time_Start": 349.12,
      "Time_End": 355.04,
      "Text": " abuse it in a blend in. And then that's where I've been talking about this and the sort of underlying"
    },
    {
      "Time_Start": 355.04,
      "Time_End": 362.40000000000003,
      "Text": " thing is that operating systems offer a ton of ways to execute different code. And you can"
    },
    {
      "Time_Start": 362.40000000000003,
      "Time_End": 366.88,
      "Text": " install even more, right? And you can continue to extend it. And that's something that I think is"
    },
    {
      "Time_Start": 367.52000000000004,
      "Time_End": 372.64000000000004,
      "Text": " sort of at the heart of the problem is that we have such a large attack surface when we're"
    },
    {
      "Time_Start": 372.64000000000004,
      "Time_End": 376.64000000000004,
      "Text": " talking about execution methods because there are more and more ways being invented"
    },
    {
      "Time_Start": 377.6,
      "Time_End": 382.08000000000004,
      "Text": " to execute code to meet developers and technology as it continues to grow."
    },
    {
      "Time_Start": 382.96,
      "Time_End": 387.03999999999996,
      "Text": " Now, a quick roadmap of what we're covering today. We're going to go over a quick cycle"
    },
    {
      "Time_Start": 387.03999999999996,
      "Time_End": 392.4,
      "Text": " of execution methods as a whole, how they sort of build on top of each other. We're going to"
    },
    {
      "Time_Start": 392.4,
      "Time_End": 396.96,
      "Text": " go over a bunch of resources on sort of what you're going to need for testing and tools."
    },
    {
      "Time_Start": 397.68,
      "Time_End": 402.4,
      "Text": " Then we're going to dive deep into Windows PowerShell and the different execution method"
    },
    {
      "Time_Start": 402.4,
      "Time_End": 406.56,
      "Text": " variants you can do in order to sort of thoroughly test it. And then we're going to talk a little bit"
    },
    {
      "Time_Start": 406.72,
      "Time_End": 412.8,
      "Text": " about the Lullabas project and MSBuild to sort of close it out. Now, the cycle of execution"
    },
    {
      "Time_Start": 412.8,
      "Time_End": 419.2,
      "Text": " methods. This is something that I picked PowerShell for sort of my main examples here and"
    },
    {
      "Time_Start": 419.2,
      "Time_End": 424.8,
      "Text": " partially because it's been sort of so well documented and a lot of people in this space have"
    },
    {
      "Time_Start": 424.8,
      "Time_End": 430.32,
      "Text": " a pretty good history of it. So, when we are talking about a life cycle, let's talk about how"
    },
    {
      "Time_Start": 430.32,
      "Time_End": 436.16,
      "Text": " something comes in to being an execution method. Part of it is its creation. And so, PowerShell"
    },
    {
      "Time_Start": 436.8,
      "Time_End": 442.16,
      "Text": " version 1 was released back in 2006. Now, something to remember, though, is that every"
    },
    {
      "Time_Start": 442.16,
      "Time_End": 447.28000000000003,
      "Text": " time something's released doesn't necessarily mean it's used. This was at a point in PowerShell's"
    },
    {
      "Time_Start": 447.28000000000003,
      "Time_End": 452.8,
      "Text": " life where you still had to download and install it and then it wasn't as widely adapted. And so,"
    },
    {
      "Time_Start": 452.8,
      "Time_End": 457.6,
      "Text": " that's something that comes into sort of the maturity of each of these different methods"
    },
    {
      "Time_Start": 457.6,
      "Time_End": 462.08000000000004,
      "Text": " is whether or not they're widely adopted. And so, when we look at PowerShell version 2 that"
    },
    {
      "Time_Start": 462.08,
      "Time_End": 467.84,
      "Text": " was released three years later, it was included in Windows 7 by default. Now, having default"
    },
    {
      "Time_Start": 467.84,
      "Time_End": 473.44,
      "Text": " installs is something that is going to increase your user base by a lot. And that's where we"
    },
    {
      "Time_Start": 473.44,
      "Time_End": 478.56,
      "Text": " have this intended use of PowerShell through system administrators that now have this tool"
    },
    {
      "Time_Start": 478.56,
      "Time_End": 483.28,
      "Text": " that was widely deployed by default that they could leverage. Now, of course, the next step"
    },
    {
      "Time_Start": 483.28,
      "Time_End": 487.36,
      "Text": " is what you can probably guess. The, you know, information security community always has this"
    },
    {
      "Time_Start": 487.36,
      "Time_End": 492.32,
      "Text": " part in it. And it's the unintended use of the execution method. And so, while these aren't"
    },
    {
      "Time_Start": 492.32,
      "Time_End": 498.08000000000004,
      "Text": " necessarily the pure points of where these things turned, right, it's a key thing to remember is"
    },
    {
      "Time_Start": 498.08000000000004,
      "Time_End": 502.88,
      "Text": " that research happens before publishing. And so, these things typically probably happened even"
    },
    {
      "Time_Start": 502.88,
      "Time_End": 508.48,
      "Text": " years before the actual talks. But there was a DerbyCon talk that went over PowerShell and was"
    },
    {
      "Time_Start": 508.48,
      "Time_End": 514.88,
      "Text": " like, oh, my gosh. And so, that was Dave Kennedy and Josh Kelly back in 2013. And then, of course,"
    },
    {
      "Time_Start": 514.88,
      "Time_End": 520.32,
      "Text": " Empire was one of the big first well-known command and control projects that sort of came out"
    },
    {
      "Time_Start": 520.32,
      "Time_End": 525.36,
      "Text": " and focused on some of those post-exploitation activities sort of opposed to Metasploit at the"
    },
    {
      "Time_Start": 525.36,
      "Time_End": 531.84,
      "Text": " time. And so, Cobalt Strike had obviously made some of those just C2 in general a big topic."
    },
    {
      "Time_Start": 531.84,
      "Time_End": 535.84,
      "Text": " But PowerShell Empire was sort of the first one of the first ones that sort of came out that"
    },
    {
      "Time_Start": 535.84,
      "Time_End": 543.04,
      "Text": " was used widespread. Now, with that, of course, comes more and more people abusing these systems"
    },
    {
      "Time_Start": 543.04,
      "Time_End": 548.56,
      "Text": " in PowerShell. And that is where we get better logging and telemetry from the vendor, in this"
    },
    {
      "Time_Start": 548.56,
      "Time_End": 554.56,
      "Text": " case, Microsoft. And so, they had a lot of enhanced logging that they did in PowerShell version 3, 4,"
    },
    {
      "Time_Start": 554.56,
      "Time_End": 559.76,
      "Text": " and 5 through the Windows management framework. And really, the things here that you might be"
    },
    {
      "Time_Start": 559.76,
      "Time_End": 564.9599999999999,
      "Text": " familiar with are, of course, the script block logging. We're going to talk about that a lot,"
    },
    {
      "Time_Start": 564.9599999999999,
      "Time_End": 569.68,
      "Text": " like module logging. And then, of course, the constrained language mode and some of that."
    },
    {
      "Time_Start": 569.6800000000001,
      "Time_End": 574.96,
      "Text": " So, that's really where we saw this sort of reaction from Microsoft in that case. They"
    },
    {
      "Time_Start": 574.96,
      "Time_End": 581.6,
      "Text": " released an entire blog post about how PowerShell loves the blue team too. And so, you can go check"
    },
    {
      "Time_Start": 581.6,
      "Time_End": 588.24,
      "Text": " and read through some of that. But the idea was to give defenders an ability to monitor and try"
    },
    {
      "Time_Start": 588.24,
      "Time_End": 594.0000000000001,
      "Text": " and lock down a lot of PowerShell's features. Now, the next thing is, of course, people look"
    },
    {
      "Time_Start": 594.0,
      "Time_End": 600.24,
      "Text": " for new execution methods, whether it's native API calls when doing that through different methods"
    },
    {
      "Time_Start": 600.24,
      "Time_End": 605.68,
      "Text": " like C sharp or some of the other red team research that you've probably seen. But the"
    },
    {
      "Time_Start": 605.68,
      "Time_End": 611.12,
      "Text": " idea behind this entire life cycle is that typically this is how people are going to go"
    },
    {
      "Time_Start": 611.12,
      "Time_End": 616.08,
      "Text": " through and look for things, especially when you're talking about adversaries are trying to"
    },
    {
      "Time_Start": 616.08,
      "Time_End": 621.44,
      "Text": " accomplish a lot of similar things. Even across time, their methods just change a little bit. And"
    },
    {
      "Time_Start": 621.44,
      "Time_End": 627.5200000000001,
      "Text": " that's really what it comes down to. So, this is a compounding problem because things keep"
    },
    {
      "Time_Start": 628.08,
      "Time_End": 633.44,
      "Text": " adding to it. We're covering you have to cover all the previous execution methods while also"
    },
    {
      "Time_Start": 633.44,
      "Time_End": 639.6,
      "Text": " tackling new ones that come out. And so, that's something that is challenging for any organization"
    },
    {
      "Time_Start": 639.6,
      "Time_End": 643.6800000000001,
      "Text": " because it means you need people that at least are plugged into some of those communities,"
    },
    {
      "Time_Start": 643.6800000000001,
      "Time_End": 647.9200000000001,
      "Text": " can understand what are some of the challenges. And, of course, this is while development is"
    },
    {
      "Time_Start": 647.92,
      "Time_End": 653.92,
      "Text": " still happening. PowerShell in this case is still a problem even all these years later because there"
    },
    {
      "Time_Start": 653.92,
      "Time_End": 659.12,
      "Text": " is active development. There are things that you can still use. And so, that's where you have to"
    },
    {
      "Time_Start": 659.12,
      "Time_End": 665.28,
      "Text": " have a team or a strategy for tackling some of those. And, of course, if your data changes,"
    },
    {
      "Time_Start": 665.28,
      "Time_End": 670.0,
      "Text": " whether you're swapping out EDRs or other defensive vendors, this is going to be something that"
    },
    {
      "Time_Start": 670.8,
      "Time_End": 676.3199999999999,
      "Text": " makes your challenge even harder is how do we make sure we maintain consistency in our detections"
    },
    {
      "Time_Start": 676.32,
      "Time_End": 680.08,
      "Text": " across all these execution methods while adding and taking away tools."
    },
    {
      "Time_Start": 681.12,
      "Time_End": 686.48,
      "Text": " So, the purple perspective here is that it can be a good thing because execution methods tend to be"
    },
    {
      "Time_Start": 686.48,
      "Time_End": 692.24,
      "Text": " what we see and talk about when we're talking about adversary maturity. And so, this provides"
    },
    {
      "Time_Start": 692.24,
      "Time_End": 699.2,
      "Text": " defenders with a maturity map for how they can look at their own testing. So, you can use execution"
    },
    {
      "Time_Start": 699.2,
      "Time_End": 705.44,
      "Text": " methods as a way to see what level of maturity you're at. And so, from command line to PowerShell"
    },
    {
      "Time_Start": 705.44,
      "Time_End": 710.1600000000001,
      "Text": " to Windows API calls and there's a couple in between there, too, you can essentially track"
    },
    {
      "Time_Start": 710.1600000000001,
      "Time_End": 717.0400000000001,
      "Text": " how adversaries are building their own capabilities and then map that to your ability to not only"
    },
    {
      "Time_Start": 717.0400000000001,
      "Time_End": 722.48,
      "Text": " track but log and detect off of the behaviors being executed with those specific execution"
    },
    {
      "Time_Start": 722.48,
      "Time_End": 728.08,
      "Text": " methods. So, there is a positive here. Now, how do we solve all of this? This is, of course,"
    },
    {
      "Time_Start": 728.08,
      "Time_End": 733.7600000000001,
      "Text": " a Purple Team conference. So, through Purple Team testing. So, next we're going to talk about"
    },
    {
      "Time_Start": 733.76,
      "Time_End": 739.12,
      "Text": " different testing methods and tools. So, a little bit of advice here from somebody who's"
    },
    {
      "Time_Start": 739.12,
      "Time_End": 743.4399999999999,
      "Text": " been doing this for a little while is focus, especially if you're new to doing either Purple"
    },
    {
      "Time_Start": 743.4399999999999,
      "Time_End": 749.68,
      "Text": " Team exercises or to security testing in general, is to focus on one question at a time. Now, you"
    },
    {
      "Time_Start": 749.68,
      "Time_End": 753.36,
      "Text": " have to break your big questions into smaller ones and I've got an example here that we'll walk"
    },
    {
      "Time_Start": 753.36,
      "Time_End": 758.72,
      "Text": " through. But the big thing here is to pick a technique and you're not going to deviate from it"
    },
    {
      "Time_Start": 758.72,
      "Time_End": 762.48,
      "Text": " for this set of testing. If you're testing execution methods, you want to change one"
    },
    {
      "Time_Start": 762.48,
      "Time_End": 767.28,
      "Text": " variable at a time. The variable you're changing is the execution method and not the technique"
    },
    {
      "Time_Start": 767.28,
      "Time_End": 773.04,
      "Text": " itself. And so, discovery techniques are a really good starting point because they tend to have"
    },
    {
      "Time_Start": 773.04,
      "Time_End": 778.8000000000001,
      "Text": " something that you can execute on the endpoint. For instance, PowerShell, command line, WMI,"
    },
    {
      "Time_Start": 778.8000000000001,
      "Time_End": 785.84,
      "Text": " that kind of thing, it might have a one or two command execution where other techniques are"
    },
    {
      "Time_Start": 785.84,
      "Time_End": 791.12,
      "Text": " going to require a bit more effort. And so, for this one, our big question, and this might not"
    },
    {
      "Time_Start": 791.12,
      "Time_End": 796.5600000000001,
      "Text": " seem like a big question to all of you, is will process discovery T1057 generate an alert? So,"
    },
    {
      "Time_Start": 796.5600000000001,
      "Time_End": 800.32,
      "Text": " let's look at how we want to break this down. There's a couple different things we want to"
    },
    {
      "Time_Start": 800.32,
      "Time_End": 805.2,
      "Text": " focus on here. One is how do we execute the technique? We'll get into a little bit about"
    },
    {
      "Time_Start": 805.2,
      "Time_End": 810.64,
      "Text": " how this can get more complicated, but overall, part of the thing here is making sure that you"
    },
    {
      "Time_Start": 810.64,
      "Time_End": 815.76,
      "Text": " have the current skills and expertise to execute it. Now, for something like process discovery or"
    },
    {
      "Time_Start": 815.76,
      "Time_End": 820.8,
      "Text": " the other discovery techniques, they're a great way to start because they don't take a whole lot"
    },
    {
      "Time_Start": 820.8000000000001,
      "Time_End": 827.44,
      "Text": " here. Of course, you can execute it. In fact, a lot of them are used by programs, so that is even"
    },
    {
      "Time_Start": 827.44,
      "Time_End": 833.36,
      "Text": " going to allow you to execute it through potential protections and those new mechanisms that"
    },
    {
      "Time_Start": 833.36,
      "Time_End": 839.2800000000001,
      "Text": " Microsoft's put into PowerShell. The other thing, and this is going to be where it's going to take"
    },
    {
      "Time_Start": 839.2800000000001,
      "Time_End": 843.7600000000001,
      "Text": " some time, effort, and energy, is what artifacts are generated on the endpoint, in this case,"
    },
    {
      "Time_Start": 844.48,
      "Time_End": 848.5600000000001,
      "Text": " by what you're executing. In the course of process discovery, it'll depend on how we're"
    },
    {
      "Time_Start": 848.5600000000001,
      "Time_End": 853.12,
      "Text": " executing it, but this is where you need to at least be thinking of what are some of the things"
    },
    {
      "Time_Start": 853.12,
      "Time_End": 858.6400000000001,
      "Text": " that happen when I type in that command. Then, of course, what changes can you make that would"
    },
    {
      "Time_Start": 858.6400000000001,
      "Time_End": 864.48,
      "Text": " potentially impact that alert? Then, going over to what is probably a little bit more on the"
    },
    {
      "Time_Start": 864.48,
      "Time_End": 868.6400000000001,
      "Text": " detection side is where are you going to get your data? What's that data source you have for your"
    },
    {
      "Time_Start": 868.6400000000001,
      "Time_End": 873.6,
      "Text": " execution method? Of course, being able to correlate that with other data, this gets"
    },
    {
      "Time_Start": 873.6,
      "Time_End": 877.7600000000001,
      "Text": " more into that last point, which is analysis and how much you want to be able to do versus being"
    },
    {
      "Time_Start": 877.76,
      "Time_End": 883.12,
      "Text": " able to just see that you have the data that you're collecting. Depending on where you are in"
    },
    {
      "Time_Start": 884.08,
      "Time_End": 888.96,
      "Text": " your own testing maturity process, you might not be able to answer all these, and that's okay."
    },
    {
      "Time_Start": 888.96,
      "Time_End": 892.56,
      "Text": " I just want to at least put these out there as this is a way that you can break down that big"
    },
    {
      "Time_Start": 892.56,
      "Time_End": 898.16,
      "Text": " question into smaller ones that you need to tackle individually. Now, our testing setup is going to"
    },
    {
      "Time_Start": 898.16,
      "Time_End": 903.28,
      "Text": " have three key components here, an environment, and, of course, using something like the cloud"
    },
    {
      "Time_Start": 903.28,
      "Time_End": 907.52,
      "Text": " is what a lot of testers are moving to, at least for standing up test beds, and I'll talk about"
    },
    {
      "Time_Start": 907.52,
      "Time_End": 912.72,
      "Text": " those a little bit in a minute. You, of course, need to collect data from that environment, and so"
    },
    {
      "Time_Start": 912.72,
      "Time_End": 918.0,
      "Text": " data collection tools, some of them can be built in, other ones are specific projects, and then,"
    },
    {
      "Time_Start": 918.0,
      "Time_End": 922.72,
      "Text": " of course, the last thing is our data generation, and that's really how these things break down."
    },
    {
      "Time_Start": 922.72,
      "Time_End": 927.04,
      "Text": " We oftentimes think of it in red team tools or blue team tools or things like that, but at its"
    },
    {
      "Time_Start": 927.04,
      "Time_End": 930.48,
      "Text": " core, that's really what we're doing in an environment is we're trying to generate data"
    },
    {
      "Time_Start": 930.48,
      "Time_End": 937.1999999999999,
      "Text": " for us to work off of. Now, test environments, if you are working at an enterprise, it's ideal"
    },
    {
      "Time_Start": 937.2,
      "Time_End": 941.44,
      "Text": " for your production environment because you want all of that noise, you want all of those things in"
    },
    {
      "Time_Start": 941.44,
      "Time_End": 945.84,
      "Text": " play because you may find out that the execution method you're testing is used all across your"
    },
    {
      "Time_Start": 945.84,
      "Time_End": 952.32,
      "Text": " environment, and that is going to make it really difficult in order to write detections just"
    },
    {
      "Time_Start": 952.32,
      "Time_End": 957.44,
      "Text": " in a vacuum if you're in your own test bed. Now, if you're not, of course, able to do it in"
    },
    {
      "Time_Start": 957.44,
      "Time_End": 961.76,
      "Text": " your own production environment, there's a lot of other options, and these continue to grow, which is"
    },
    {
      "Time_Start": 961.76,
      "Time_End": 966.3199999999999,
      "Text": " actually great because it provides a lot of opportunities for more and more people"
    },
    {
      "Time_Start": 966.3199999999999,
      "Time_End": 973.28,
      "Text": " to learn about how enterprise networks work and how testing can work in them. So, virtual"
    },
    {
      "Time_Start": 973.28,
      "Time_End": 978.0,
      "Text": " machines, cyber ranges, that kind of thing, cloud providers, as I already went over, are sort of those"
    },
    {
      "Time_Start": 978.0,
      "Time_End": 983.12,
      "Text": " key components when you're looking at building different test environments. Now, I've got a"
    },
    {
      "Time_Start": 983.12,
      "Time_End": 988.64,
      "Text": " couple here that I'll talk to you. Attack range by Splunk, this has been a really popular one that's"
    },
    {
      "Time_Start": 988.64,
      "Time_End": 993.84,
      "Text": " continued to grow and be supported, and this sets up sort of everything for you. So, this sets up"
    },
    {
      "Time_Start": 993.84,
      "Time_End": 998.8,
      "Text": " your data collectors, this sets up your data generators, and, of course, gives you the"
    },
    {
      "Time_Start": 998.8,
      "Time_End": 1004.24,
      "Text": " environment. It does require a combination of virtual machines and cloud infrastructure, so this"
    },
    {
      "Time_Start": 1004.24,
      "Time_End": 1009.92,
      "Text": " is one of those, you know, bring your own credit card in order to set some of this up, and that's"
    },
    {
      "Time_Start": 1009.92,
      "Time_End": 1013.92,
      "Text": " when we're talking about these cloud environments, a lot of times that is what you have to do."
    },
    {
      "Time_Start": 1013.92,
      "Time_End": 1017.92,
      "Text": " You're setting up the environment in your own personal cloud account, so you can do testing,"
    },
    {
      "Time_Start": 1017.9200000000001,
      "Time_End": 1023.1200000000001,
      "Text": " but I would say watch out for that bill at the end of the month because there's a lot of stories"
    },
    {
      "Time_Start": 1023.1200000000001,
      "Time_End": 1027.8400000000001,
      "Text": " online of people that forget that they leave something up and then have a lot of money that"
    },
    {
      "Time_Start": 1027.8400000000001,
      "Time_End": 1033.6000000000001,
      "Text": " they have to spend. Game of Active Directory, this was also recently updated by Orange Cyber Defense,"
    },
    {
      "Time_Start": 1033.6000000000001,
      "Time_End": 1038.8000000000002,
      "Text": " they released version 2, and so this is an intentionally vulnerable Active Directory setup,"
    },
    {
      "Time_Start": 1038.8000000000002,
      "Time_End": 1044.5600000000002,
      "Text": " and the idea behind this is looking at the types of environments you want to test on and the types"
    },
    {
      "Time_Start": 1044.56,
      "Time_End": 1048.8799999999999,
      "Text": " of execution methods you want to test. Active Directory could be a key component to some of that,"
    },
    {
      "Time_Start": 1048.8799999999999,
      "Time_End": 1054.08,
      "Text": " so setting up some of these ranges allows for it. Detection Lab is another really popular one that"
    },
    {
      "Time_Start": 1054.08,
      "Time_End": 1059.9199999999998,
      "Text": " came out by Chris Long, and this is has, it's probably the most censored environment out of"
    },
    {
      "Time_Start": 1059.9199999999998,
      "Time_End": 1064.48,
      "Text": " everything here, and that's something that, of course, people have used if you are trying to"
    },
    {
      "Time_Start": 1064.48,
      "Time_End": 1070.1599999999999,
      "Text": " figure out exactly what artifacts get generated. Now, if you've never used it before, a word of"
    },
    {
      "Time_Start": 1070.16,
      "Time_End": 1075.6000000000001,
      "Text": " caution here is that if you start doing too many things at once, you're going to get a flood of data"
    },
    {
      "Time_Start": 1075.6000000000001,
      "Time_End": 1081.1200000000001,
      "Text": " and you're not going to know necessarily what to look for. So, again, keeping your testing small if"
    },
    {
      "Time_Start": 1081.1200000000001,
      "Time_End": 1086.48,
      "Text": " you're using Detection Lab for the first time is going to be key. Now, there's SnapLabs, which is"
    },
    {
      "Time_Start": 1086.48,
      "Time_End": 1091.28,
      "Text": " now part of Immersive Labs, also has Active Directory ranges. They have a Community Edition"
    },
    {
      "Time_Start": 1091.28,
      "Time_End": 1096.72,
      "Text": " where you, again, can plug in your own credentials and they will, they essentially have all these,"
    },
    {
      "Time_Start": 1096.72,
      "Time_End": 1101.1200000000001,
      "Text": " a lot of these things templated out, so you can just click Deploy and they'll, they'll host it on"
    },
    {
      "Time_Start": 1101.1200000000001,
      "Time_End": 1106.16,
      "Text": " your own infrastructure. So, it's kind of a cool way to set it up, and then the last thing here is"
    },
    {
      "Time_Start": 1106.16,
      "Time_End": 1111.92,
      "Text": " a book, and that's Building Virtual Machine Labs, a hands-on guide by Tony Robinson, and this walks"
    },
    {
      "Time_Start": 1111.92,
      "Time_End": 1116.0,
      "Text": " through if you've never built virtual machines before, you're just interested in learning more"
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1120.16,
      "Text": " about the depth that you can customize and how you can build some of these environments yourself,"
    },
    {
      "Time_Start": 1120.16,
      "Time_End": 1125.1200000000001,
      "Text": " that's a good starting point. Now, let's talk about data generators. These three questions are"
    },
    {
      "Time_Start": 1125.1200000000001,
      "Time_End": 1130.88,
      "Text": " the big things that I already talked to earlier, and the first, the first and last are going to be"
    },
    {
      "Time_Start": 1130.88,
      "Time_End": 1135.92,
      "Text": " your big things here, because how to execute the technique, just knowing how you're able to execute"
    },
    {
      "Time_Start": 1135.92,
      "Time_End": 1141.7600000000002,
      "Text": " it with that tool, as well as what changes and customizations can you make. It's not always"
    },
    {
      "Time_Start": 1141.7600000000002,
      "Time_End": 1145.44,
      "Text": " something you're going to be able to, there's, there's changes that might be limited because of"
    },
    {
      "Time_Start": 1145.44,
      "Time_End": 1150.8000000000002,
      "Text": " how the tool's built, so that's something that you've got to think of, or at least test out and"
    },
    {
      "Time_Start": 1150.8,
      "Time_End": 1155.52,
      "Text": " try out when you're going through your testing. Now, there's a bunch of different ones, I'll give"
    },
    {
      "Time_Start": 1155.52,
      "Time_End": 1159.44,
      "Text": " a shout out here to the C2 Matrix, that's sort of an aggregation of a ton of different projects."
    },
    {
      "Time_Start": 1160.24,
      "Time_End": 1165.44,
      "Text": " SANS also released a Slingshot VM that's a C2 Matrix edition that has a bunch of those"
    },
    {
      "Time_Start": 1165.44,
      "Time_End": 1169.52,
      "Text": " command and controls automatically set up for you, because some of them do take builds,"
    },
    {
      "Time_Start": 1170.56,
      "Time_End": 1175.12,
      "Text": " and then you can just work from that, so sort of ease of deployment, that might be one way to do"
    },
    {
      "Time_Start": 1175.12,
      "Time_End": 1180.48,
      "Text": " it. Now, Atomic Red Team is probably the most well-known data generator, because it is probably"
    },
    {
      "Time_Start": 1180.48,
      "Time_End": 1186.32,
      "Text": " the most straightforward to use, although something to mention is, of course, if you're not,"
    },
    {
      "Time_Start": 1186.32,
      "Time_End": 1190.88,
      "Text": " if you're just using Atomic Red Team and sort of copy pasting off of that, or use, you may not"
    },
    {
      "Time_Start": 1190.88,
      "Time_End": 1196.08,
      "Text": " generate network traffic, which might be something that is, again, important to your detection for"
    },
    {
      "Time_Start": 1196.08,
      "Time_End": 1201.68,
      "Text": " your execution method. Caldera by Mitre, it's another big one, that's a personal project that"
    },
    {
      "Time_Start": 1201.68,
      "Time_End": 1206.88,
      "Text": " I really like, because I worked on it some while I was at Mitre, and it was sort of something I"
    },
    {
      "Time_Start": 1206.88,
      "Time_End": 1212.24,
      "Text": " really enjoyed. PurpleSharp, I think Mauricio talked earlier today, and maybe even highlighted"
    },
    {
      "Time_Start": 1212.24,
      "Time_End": 1217.8400000000001,
      "Text": " PurpleSharp some, so I'll give a shout out to him and to the project there, it's another one to check"
    },
    {
      "Time_Start": 1217.8400000000001,
      "Time_End": 1223.1200000000001,
      "Text": " out. And then to continue on with a book recommendation, there's Black Hat Python and"
    },
    {
      "Time_Start": 1223.1200000000001,
      "Time_End": 1228.5600000000002,
      "Text": " Black Hat Go by NoStarchPress, walk you through how to create a command and control framework with"
    },
    {
      "Time_Start": 1228.5600000000002,
      "Time_End": 1234.48,
      "Text": " either Python or Go, so that you're able to see exactly how things work, and you are essentially"
    },
    {
      "Time_Start": 1234.48,
      "Time_End": 1239.04,
      "Text": " writing some of the code that's going to do that data generation. So depending on what level you're"
    },
    {
      "Time_Start": 1239.04,
      "Time_End": 1243.1200000000001,
      "Text": " trying to learn, whether you're trying to just get something done quickly or build your own,"
    },
    {
      "Time_Start": 1243.1200000000001,
      "Time_End": 1247.52,
      "Text": " there's a whole bunch of options here, pick one or two and try them out, I think that's more"
    },
    {
      "Time_Start": 1247.52,
      "Time_End": 1253.1200000000001,
      "Text": " important than trying to pick the perfect one. Now data collection, again, we went over these,"
    },
    {
      "Time_Start": 1253.92,
      "Time_End": 1258.96,
      "Text": " and this is just to understand how are you going to be getting this data that you're testing in."
    },
    {
      "Time_Start": 1259.52,
      "Time_End": 1263.28,
      "Text": " And so there's a couple of different things here, if you are in that production environment,"
    },
    {
      "Time_Start": 1263.28,
      "Time_End": 1268.56,
      "Text": " an EDR or other production tooling are going to give you a lot of data already. Now if you're"
    },
    {
      "Time_Start": 1268.56,
      "Time_End": 1272.72,
      "Text": " missing some, it might be as simple as turning on a feature instead of having to install something"
    },
    {
      "Time_Start": 1272.72,
      "Time_End": 1277.92,
      "Text": " completely new. And this is where I mentioned before that for lab environments, leveraging"
    },
    {
      "Time_Start": 1277.92,
      "Time_End": 1283.12,
      "Text": " a detection lab or attack range is something that will automatically instrument it for you."
    },
    {
      "Time_Start": 1283.12,
      "Time_End": 1288.72,
      "Text": " So it has a bunch of sensors already, they also on the pages for the projects give you a list of"
    },
    {
      "Time_Start": 1288.72,
      "Time_End": 1293.2,
      "Text": " the different technologies, so that's something that you can of course leverage. Now if you're"
    },
    {
      "Time_Start": 1293.2,
      "Time_End": 1297.68,
      "Text": " building your own or if you're working in your own work environment, everyone talks about Sysmon,"
    },
    {
      "Time_Start": 1297.68,
      "Time_End": 1303.6000000000001,
      "Text": " and Sysmon is great, but a lot of organizations still haven't deployed it widely. So EDRs"
    },
    {
      "Time_Start": 1303.6000000000001,
      "Time_End": 1309.76,
      "Text": " essentially use similar collection methods to it, so it's a good way to at least get started."
    },
    {
      "Time_Start": 1309.76,
      "Time_End": 1313.68,
      "Text": " And of course, these are the two major recommendations, Swift on Security and then"
    },
    {
      "Time_Start": 1313.68,
      "Time_End": 1319.92,
      "Text": " Olaf's modular Sysmon project are both really, really good places to start if you haven't used"
    },
    {
      "Time_Start": 1319.92,
      "Time_End": 1325.76,
      "Text": " Sysmon before. So and then the last thing I want to talk about here is of course network data."
    },
    {
      "Time_Start": 1325.76,
      "Time_End": 1331.76,
      "Text": " This is something that a lot of what we're going to talk about and test on is the host, but network"
    },
    {
      "Time_Start": 1331.76,
      "Time_End": 1337.44,
      "Text": " data can become a key element when you are writing your detections in your environment. So this is"
    },
    {
      "Time_Start": 1337.44,
      "Time_End": 1343.6000000000001,
      "Text": " something that it's going to depend on what sort of insights you have, and this is going to be your"
    },
    {
      "Time_Start": 1343.6000000000001,
      "Time_End": 1348.8000000000002,
      "Text": " mileage may vary depending on your setup, but as you are maturing and learning more about this, if"
    },
    {
      "Time_Start": 1348.8,
      "Time_End": 1354.56,
      "Text": " you are building your own testbed, linking and correlating both the host-based information and"
    },
    {
      "Time_Start": 1354.56,
      "Time_End": 1361.28,
      "Text": " the network-based is going to be key. And so you have the Zeek project is one of those, formerly"
    },
    {
      "Time_Start": 1361.28,
      "Time_End": 1365.76,
      "Text": " bro, and then of course this is something I just like to talk about the data collectors because the"
    },
    {
      "Time_Start": 1365.76,
      "Time_End": 1371.36,
      "Text": " ELK stack is pretty popular, and so you have all the beats. So winlog beats is one of those"
    },
    {
      "Time_Start": 1371.36,
      "Time_End": 1378.0,
      "Text": " data collection methods. Now as far as when you start maturing and get to the point where you're"
    },
    {
      "Time_Start": 1378.0,
      "Time_End": 1383.44,
      "Text": " beyond data collection and you want to do some of that analysis, the key question here is what"
    },
    {
      "Time_Start": 1383.44,
      "Time_End": 1389.68,
      "Text": " data can you group together that sort of improves your analysis or might allow you to make a"
    },
    {
      "Time_Start": 1389.68,
      "Time_End": 1394.88,
      "Text": " detection that says this is for sure malicious or reduces the false positive rate that you have to"
    },
    {
      "Time_Start": 1394.88,
      "Time_End": 1400.8,
      "Text": " deal with. And so that's where you enrich the data that you already have, maybe it's a specific"
    },
    {
      "Time_Start": 1402.0,
      "Time_End": 1407.44,
      "Text": " process that executes and then is paired with network data so you understand at least what"
    },
    {
      "Time_Start": 1407.44,
      "Time_End": 1412.64,
      "Text": " is that host name or URL that it's calling out to. Those types of things can give you more"
    },
    {
      "Time_Start": 1412.64,
      "Time_End": 1418.48,
      "Text": " information than something that's sort of isolated and by itself. Now there's a couple of things here,"
    },
    {
      "Time_Start": 1419.1200000000001,
      "Time_End": 1424.72,
      "Text": " securityonion is a big one that's that is very popular, and then the ELK stack as I mentioned"
    },
    {
      "Time_Start": 1424.72,
      "Time_End": 1429.44,
      "Text": " before is something that has been built on a lot. And so I'll give a shout out to, you know, we've"
    },
    {
      "Time_Start": 1429.44,
      "Time_End": 1435.8400000000001,
      "Text": " seen the HELC, although I put the SANS ELK stack because it is more recently updated, and then I"
    },
    {
      "Time_Start": 1435.84,
      "Time_End": 1442.3999999999999,
      "Text": " want to give a shout out to Outflank for RedElk, which is sort of a red team view of the ELK stack"
    },
    {
      "Time_Start": 1442.3999999999999,
      "Time_End": 1447.28,
      "Text": " and sort of doing some of that offensive monitoring, which I think this was sort of the first"
    },
    {
      "Time_Start": 1447.28,
      "Time_End": 1452.24,
      "Text": " time that that came out, that a project came out publicly that talked about doing some more data"
    },
    {
      "Time_Start": 1452.24,
      "Time_End": 1456.6399999999999,
      "Text": " analysis for red teams, which I think is really good, so that's why I wanted to highlight that"
    },
    {
      "Time_Start": 1456.6399999999999,
      "Time_End": 1464.56,
      "Text": " specifically. Now alert generation, this is where things start to, there's not as many free resources"
    },
    {
      "Time_Start": 1464.56,
      "Time_End": 1469.9199999999998,
      "Text": " out there. EDRs have varying degrees out of the box, it just depends on the vendor and your setup,"
    },
    {
      "Time_Start": 1469.9199999999998,
      "Time_End": 1476.3999999999999,
      "Text": " but Sigma has become a massive project by Florian, and so that's something I just want to give a"
    },
    {
      "Time_Start": 1476.3999999999999,
      "Time_End": 1482.32,
      "Text": " shout out there, and so you can also port those Sigma rules to other formats, and he also has"
    },
    {
      "Time_Start": 1482.32,
      "Time_End": 1487.28,
      "Text": " built his own EDR that has a community edition, so that will tell you at least what Sigma rules"
    },
    {
      "Time_Start": 1487.28,
      "Time_End": 1492.6399999999999,
      "Text": " you triggered with some of your different testing. And then Elastic has actually released their"
    },
    {
      "Time_Start": 1492.64,
      "Time_End": 1496.88,
      "Text": " detection rules, and those are also widely available, so when we're talking about detections"
    },
    {
      "Time_Start": 1496.88,
      "Time_End": 1504.5600000000002,
      "Text": " for some of these different methods, we want to look at those. Now let's dive, let's start"
    },
    {
      "Time_Start": 1504.5600000000002,
      "Time_End": 1510.0800000000002,
      "Text": " diving into how you would test something like PowerShell, and PowerShell is still a problem,"
    },
    {
      "Time_Start": 1510.0800000000002,
      "Time_End": 1515.6000000000001,
      "Text": " as I mentioned, in 2022. The way we're going to execute it for this test and sort of talking"
    },
    {
      "Time_Start": 1515.6000000000001,
      "Time_End": 1521.76,
      "Text": " through it is with get process through Atomic Red Team test number three, and so I've got links"
    },
    {
      "Time_Start": 1521.76,
      "Time_End": 1526.64,
      "Text": " there at the bottom if you wanted to try and follow along, but the key thing here again is"
    },
    {
      "Time_Start": 1526.64,
      "Time_End": 1530.72,
      "Text": " now we know how we're executing it, following through all of those questions, looking at how"
    },
    {
      "Time_Start": 1530.72,
      "Time_End": 1535.84,
      "Text": " are we going to get information from that execution method. Well, we have Sysmon installed, so we have"
    },
    {
      "Time_Start": 1535.84,
      "Time_End": 1540.8799999999999,
      "Text": " Sysmon Event ID 1, so we're going to be spawning a new process, as well as having something like"
    },
    {
      "Time_Start": 1540.8799999999999,
      "Time_End": 1547.92,
      "Text": " script block logging, which might be overkill for this specific technique, but it's important"
    },
    {
      "Time_Start": 1547.92,
      "Time_End": 1553.04,
      "Text": " because of some of the things we're going to do a little bit later, and then looking at this,"
    },
    {
      "Time_Start": 1553.04,
      "Time_End": 1558.72,
      "Text": " sort of asking ourselves the question is what pieces are missing? Do we have process trees?"
    },
    {
      "Time_Start": 1558.72,
      "Time_End": 1562.96,
      "Text": " If this is something that this is the first time you're looking at it, process trees are going to"
    },
    {
      "Time_Start": 1562.96,
      "Time_End": 1568.72,
      "Text": " help you a ton because you're going to understand what artifacts are left on the system, and so"
    },
    {
      "Time_Start": 1568.72,
      "Time_End": 1573.92,
      "Text": " Process Explorer from the Sysinternals project by Windows is really good, and so this is one of"
    },
    {
      "Time_Start": 1573.92,
      "Time_End": 1580.16,
      "Text": " those things where, you know, opening and executing something from just a Windows GUI"
    },
    {
      "Time_Start": 1580.16,
      "Time_End": 1585.44,
      "Text": " might have Explorer as a parent process versus something that's not a beacon.exe, and so this"
    },
    {
      "Time_Start": 1585.44,
      "Time_End": 1590.16,
      "Text": " is where you'll see the differences between something like Atomic Red Team versus a C2"
    },
    {
      "Time_Start": 1590.16,
      "Time_End": 1594.48,
      "Text": " framework, and you should be able to test out those differences and at least spot a couple of key ones,"
    },
    {
      "Time_Start": 1595.28,
      "Time_End": 1599.1200000000001,
      "Text": " and something that people that are looking at this always ask, should we just disable"
    },
    {
      "Time_Start": 1599.1200000000001,
      "Time_End": 1604.88,
      "Text": " PowerShell? It seems like a problem, and I'm going to say probably not. Maybe you can in your"
    },
    {
      "Time_Start": 1604.88,
      "Time_End": 1609.68,
      "Text": " organization, but more and more people still continue to use PowerShell, and there's this"
    },
    {
      "Time_Start": 1609.68,
      "Time_End": 1614.5600000000002,
      "Text": " guide that was released on keeping PowerShell security measures to use and embrace in order"
    },
    {
      "Time_Start": 1614.5600000000002,
      "Time_End": 1620.0000000000002,
      "Text": " to make sure that it won't be abused, and so this was released by a joint set of governments,"
    },
    {
      "Time_Start": 1620.0000000000002,
      "Time_End": 1626.4,
      "Text": " I think all the five eyes. So let's talk about once you've executed that, we've maybe gotten"
    },
    {
      "Time_Start": 1626.4,
      "Time_End": 1631.3600000000001,
      "Text": " some detections, you know, are you done? And the answer, of course, is no. This is where we're"
    },
    {
      "Time_Start": 1631.3600000000001,
      "Time_End": 1636.72,
      "Text": " actually just getting started, and these are the key variations that you want to focus on"
    },
    {
      "Time_Start": 1636.72,
      "Time_End": 1641.44,
      "Text": " for execution methods, and you can probably come up with some other ones as well, but these are the"
    },
    {
      "Time_Start": 1641.44,
      "Time_End": 1646.64,
      "Text": " ones that have historically sort of been used by attackers or researchers in order to bypass"
    },
    {
      "Time_Start": 1646.64,
      "Time_End": 1650.96,
      "Text": " different techniques, and so some of the key questions we want to look at is, like, can we"
    },
    {
      "Time_Start": 1650.96,
      "Time_End": 1655.8400000000001,
      "Text": " run something without it being logged? Can we obfuscate what we run so that even if somebody"
    },
    {
      "Time_Start": 1655.8400000000001,
      "Time_End": 1660.4800000000002,
      "Text": " is able to collect it, they have to maybe do some analysis of their own to determine what"
    },
    {
      "Time_Start": 1660.4800000000002,
      "Time_End": 1666.16,
      "Text": " it even does? Can we copy and move it? Can we rename? And can we bring our own? There's a bunch"
    },
    {
      "Time_Start": 1666.16,
      "Time_End": 1670.3200000000002,
      "Text": " of different things here that you can test out, and really what this is is you're exploring the"
    },
    {
      "Time_Start": 1670.3200000000002,
      "Time_End": 1675.44,
      "Text": " features and capabilities of your execution method. That's really what it comes down to."
    },
    {
      "Time_Start": 1675.44,
      "Time_End": 1680.16,
      "Text": " Some of them, like PowerShell, are pretty well documented because they've been around for a long"
    },
    {
      "Time_Start": 1680.16,
      "Time_End": 1685.8400000000001,
      "Text": " time now. I mean, PowerShell has been around since 2006, as we said, and so that versus maybe"
    },
    {
      "Time_Start": 1685.8400000000001,
      "Time_End": 1692.0,
      "Text": " the newer execution methods that might not be official even are going to be really poorly"
    },
    {
      "Time_Start": 1692.0,
      "Time_End": 1698.96,
      "Text": " documented, and so that might require a lot of research and discovery on your own or with a team,"
    },
    {
      "Time_Start": 1698.96,
      "Time_End": 1704.0800000000002,
      "Text": " and then this also is testing your assumption about how that method works, and as you'll see"
    },
    {
      "Time_Start": 1704.0800000000002,
      "Time_End": 1709.28,
      "Text": " with PowerShell, there's a lot of things that variations that essentially came out from people"
    },
    {
      "Time_Start": 1710.24,
      "Time_End": 1715.52,
      "Text": " testing their assumptions. Now, let's talk about running something without being logged. How do we"
    },
    {
      "Time_Start": 1715.52,
      "Time_End": 1721.84,
      "Text": " tackle this? Now, remember when I was going through our cycle here, PowerShell didn't start getting"
    },
    {
      "Time_Start": 1721.84,
      "Time_End": 1729.12,
      "Text": " really good or better logging and controls until versions 3, 4, and 5, which came out a bit later,"
    },
    {
      "Time_Start": 1729.12,
      "Time_End": 1734.96,
      "Text": " but PowerShell version 2 was installed by default for backwards compatibility up until I think last"
    },
    {
      "Time_Start": 1734.96,
      "Time_End": 1742.4,
      "Text": " year, and even now, a lot of different laptops or Windows machines that get shipped still have"
    },
    {
      "Time_Start": 1742.4,
      "Time_End": 1748.0,
      "Text": " version 2 enabled, and so this is something that you can do a downgrade attack, and this is where"
    },
    {
      "Time_Start": 1748.0,
      "Time_End": 1752.88,
      "Text": " you just tack on that you want version 2. You're going to run the same thing, and this is before"
    },
    {
      "Time_Start": 1752.88,
      "Time_End": 1757.52,
      "Text": " all of that logging happens, and so that's something that still happens in a lot of"
    },
    {
      "Time_Start": 1757.52,
      "Time_End": 1761.8400000000001,
      "Text": " environments, especially when we're doing purple teaming. We see this a lot. The other thing is"
    },
    {
      "Time_Start": 1761.8400000000001,
      "Time_End": 1766.4800000000002,
      "Text": " truncating logging. This is something that environments and especially if you're in an"
    },
    {
      "Time_Start": 1766.4800000000002,
      "Time_End": 1771.2800000000002,
      "Text": " enterprise that's trying to conserve the amount of data that they're storing, especially depending"
    },
    {
      "Time_Start": 1771.2800000000002,
      "Time_End": 1775.8400000000001,
      "Text": " on how you're storing it, maybe in the cloud versus on-prem, and so they might truncate to"
    },
    {
      "Time_Start": 1776.64,
      "Time_End": 1781.2,
      "Text": " the first 500 characters of something and figure that that's all they need,"
    },
    {
      "Time_Start": 1781.2,
      "Time_End": 1789.1200000000001,
      "Text": " and so in this case, you could just put and pre-pen 500 spaces before your test and see,"
    },
    {
      "Time_Start": 1789.7600000000002,
      "Time_End": 1795.92,
      "Text": " am I able to still see that? Now, this is where some things like script block logging might have"
    },
    {
      "Time_Start": 1795.92,
      "Time_End": 1801.1200000000001,
      "Text": " that minimized command that we'll talk about that get past this, but these are still a lot of"
    },
    {
      "Time_Start": 1801.1200000000001,
      "Time_End": 1805.5200000000002,
      "Text": " different good variations to prove whether or not those are working or not, and so that's really the"
    },
    {
      "Time_Start": 1805.5200000000002,
      "Time_End": 1810.64,
      "Text": " question to ask every time after you run one of these. Does my telemetry change? Does my detection"
    },
    {
      "Time_Start": 1810.64,
      "Time_End": 1814.4,
      "Text": " ability change or my alerting, which is really what we're trying to work towards?"
    },
    {
      "Time_Start": 1815.3600000000001,
      "Time_End": 1820.5600000000002,
      "Text": " Now, can we obfuscate what we run? Base64 encoding, this is something that's very much"
    },
    {
      "Time_Start": 1820.5600000000002,
      "Time_End": 1825.52,
      "Text": " inbuilt and part of PowerShell and is widely used for legitimate use cases too,"
    },
    {
      "Time_Start": 1826.4,
      "Time_End": 1833.92,
      "Text": " and encoding commands in general is something that a lot of especially automation and provisioning"
    },
    {
      "Time_Start": 1833.92,
      "Time_End": 1838.96,
      "Text": " tools use just to help make sure they're getting everything consistently across the network,"
    },
    {
      "Time_Start": 1839.28,
      "Time_End": 1845.8400000000001,
      "Text": " and this is why Base64 encoding is so popular also with adversaries, just because encoding"
    },
    {
      "Time_Start": 1845.8400000000001,
      "Time_End": 1851.28,
      "Text": " commands require at least one more step of analysis, whether it's just decoding it before"
    },
    {
      "Time_Start": 1851.28,
      "Time_End": 1855.76,
      "Text": " you try and understand whether it works, so you can check that and see whether or not you have"
    },
    {
      "Time_Start": 1855.76,
      "Time_End": 1861.44,
      "Text": " an analyst that's either going to, maybe the EDR does it for you, or maybe you have to pull"
    },
    {
      "Time_Start": 1861.44,
      "Time_End": 1865.44,
      "Text": " up CyberChef or something like that in order to decode the command to understand what it does."
    },
    {
      "Time_Start": 1866.16,
      "Time_End": 1870.0800000000002,
      "Text": " Now, invoke obfuscation is another one of my favorite projects to talk about,"
    },
    {
      "Time_Start": 1870.8,
      "Time_End": 1876.8,
      "Text": " and that's by Daniel Bohannon, and this is where he sort of took to the extreme some of the"
    },
    {
      "Time_Start": 1877.8400000000001,
      "Time_End": 1882.16,
      "Text": " obfuscation techniques that you can do with programming language because you can insert"
    },
    {
      "Time_Start": 1882.16,
      "Time_End": 1887.8400000000001,
      "Text": " null characters and things like that, and the compiler or the interpreter will ignore them"
    },
    {
      "Time_Start": 1887.8400000000001,
      "Time_End": 1894.56,
      "Text": " because it's just trying to get at what is that thing you're trying to execute, but of course,"
    },
    {
      "Time_Start": 1895.12,
      "Time_End": 1900.1599999999999,
      "Text": " as humans looking at it, and this is an example where you can at least still tell what's going on,"
    },
    {
      "Time_Start": 1901.2,
      "Time_End": 1905.76,
      "Text": " you can see, all right, it's get process, but that might break some detections that are based"
    },
    {
      "Time_Start": 1905.76,
      "Time_End": 1912.24,
      "Text": " on just looking for a get process string. Other things, how about copy or moving the"
    },
    {
      "Time_Start": 1912.24,
      "Time_End": 1918.56,
      "Text": " PowerShell executable? We've been assuming that we're using the system path that's executing"
    },
    {
      "Time_Start": 1918.56,
      "Time_End": 1925.44,
      "Text": " PowerShell.exe, and so what if we copy and move it to just the user profile that you have and"
    },
    {
      "Time_Start": 1925.44,
      "Time_End": 1930.6399999999999,
      "Text": " execute the same thing? Is this going to break any policies or detections because people are looking"
    },
    {
      "Time_Start": 1930.6399999999999,
      "Time_End": 1936.96,
      "Text": " for that specific path of PowerShell.exe? And so, again, these are some of those variations"
    },
    {
      "Time_Start": 1936.96,
      "Time_End": 1942.0,
      "Text": " you have to think through, and especially when we start getting into other execution methods,"
    },
    {
      "Time_Start": 1942.0,
      "Time_End": 1947.6799999999998,
      "Text": " these can break a lot of what are sort of fragile detections in the area. Same with renaming."
    },
    {
      "Time_Start": 1948.56,
      "Time_End": 1953.6799999999998,
      "Text": " This is something if people are looking for PowerShell.exe, maybe they decided that regardless"
    },
    {
      "Time_Start": 1953.6799999999998,
      "Time_End": 1958.8799999999999,
      "Text": " of where it's executed on the system, if you find PowerShell.exe, you need to detect on it,"
    },
    {
      "Time_Start": 1958.8799999999999,
      "Time_End": 1963.84,
      "Text": " and this is where rename, of course, is going to get past that. So, every environment and every"
    },
    {
      "Time_Start": 1963.84,
      "Time_End": 1968.1599999999999,
      "Text": " set of detections that have been implemented are probably going to be different. That's sort of"
    },
    {
      "Time_Start": 1968.1599999999999,
      "Time_End": 1972.48,
      "Text": " the reality. There's some people that can take all of Sigma rules, are part of Sigma rules in"
    },
    {
      "Time_Start": 1972.48,
      "Time_End": 1977.44,
      "Text": " addition to their own custom rules or what they have in the EDRs out of the box, but these are"
    },
    {
      "Time_Start": 1977.44,
      "Time_End": 1983.2,
      "Text": " what you're testing is all those assumptions about what works in environments. Now, let's"
    },
    {
      "Time_Start": 1983.2,
      "Time_End": 1990.64,
      "Text": " talk about unmanaged PowerShell, which is sort of works by, it was initially sort of coined by Lee"
    },
    {
      "Time_Start": 1990.64,
      "Time_End": 1997.8400000000001,
      "Text": " Christensen in 2014, had the unmanaged PowerShell project. PowerPick became in Cobalt Strikes,"
    },
    {
      "Time_Start": 1997.8400000000001,
      "Time_End": 2004.0,
      "Text": " so it was really easy to swap over. I think Empire also supports this. Of course, now it does,"
    },
    {
      "Time_Start": 2004.0,
      "Time_End": 2009.36,
      "Text": " but the idea with this is that typically your normal PowerShell execution, and this is sort"
    },
    {
      "Time_Start": 2009.36,
      "Time_End": 2014.24,
      "Text": " of a simplified version, was run through PowerShell.exe, and PowerShell would then"
    },
    {
      "Time_Start": 2014.24,
      "Time_End": 2021.36,
      "Text": " reference a DLL, and so the idea was let's just skip using that exe altogether and call the DLL"
    },
    {
      "Time_Start": 2022.56,
      "Time_End": 2028.08,
      "Text": " straight, and that's something that broke a lot of detections and still continues to break"
    },
    {
      "Time_Start": 2028.0800000000002,
      "Time_End": 2033.7600000000002,
      "Text": " detections, because people are focused on building detections around that PowerShell"
    },
    {
      "Time_Start": 2033.7600000000002,
      "Time_End": 2039.8400000000001,
      "Text": " executable, and so that's something that this, like I said, still is a problem to this day for"
    },
    {
      "Time_Start": 2039.8400000000001,
      "Time_End": 2045.1200000000001,
      "Text": " a lot of organizations is dealing with unmanaged PowerShell, so I highly encourage people to check"
    },
    {
      "Time_Start": 2045.1200000000001,
      "Time_End": 2050.32,
      "Text": " things out. This is where, of course, when we get to, when we talked about choosing a tool that"
    },
    {
      "Time_Start": 2050.32,
      "Time_End": 2054.96,
      "Text": " allows you to have these level of variances, some things are going to be changing just those"
    },
    {
      "Time_Start": 2054.96,
      "Time_End": 2059.2,
      "Text": " characters. Others are going to be changing that underlying method in this case, but it's still"
    },
    {
      "Time_Start": 2059.2,
      "Time_End": 2065.68,
      "Text": " PowerShell, so this is still, in Mitre ATT&CK, the PowerShell execution still falls under this,"
    },
    {
      "Time_Start": 2067.12,
      "Time_End": 2072.2400000000002,
      "Text": " so the other things, of course, and this is going to get to sort of the more advanced"
    },
    {
      "Time_Start": 2073.12,
      "Time_End": 2079.28,
      "Text": " variants is can you bring your own, and so this is where can you download and bring or upload,"
    },
    {
      "Time_Start": 2079.28,
      "Time_End": 2085.44,
      "Text": " I guess, as part of your ATT&CK, your own DLL and reference that, so that's something that if people"
    },
    {
      "Time_Start": 2085.44,
      "Time_End": 2090.8,
      "Text": " are looking at the different paths and say they're looking for everything that's PowerShell.exe and"
    },
    {
      "Time_Start": 2090.8,
      "Time_End": 2097.28,
      "Text": " that system automation DLL, you could, of course, rename it, and it's still going to retain all of"
    },
    {
      "Time_Start": 2097.28,
      "Time_End": 2103.6800000000003,
      "Text": " the features and functionality and Microsoft Signature because you download and you're going"
    },
    {
      "Time_Start": 2103.6800000000003,
      "Time_End": 2108.7200000000003,
      "Text": " to be using it the same as anything else would, so if you bring your own and reference it, people"
    },
    {
      "Time_Start": 2108.7200000000003,
      "Time_End": 2114.0000000000005,
      "Text": " might have to figure out what you're calling updater.dll and they are either going to have to"
    },
    {
      "Time_Start": 2114.0000000000005,
      "Time_End": 2119.6800000000003,
      "Text": " try and look for artifacts that indicate that this is a PowerShell DLL or they're going to have to"
    },
    {
      "Time_Start": 2119.6800000000003,
      "Time_End": 2124.4,
      "Text": " potentially reverse engineer it or something like that or they just won't know, and then the last"
    },
    {
      "Time_Start": 2124.4,
      "Time_End": 2130.1600000000003,
      "Text": " thing is taking that one step further because what we've seen is a lot of organizations will have a"
    },
    {
      "Time_Start": 2130.96,
      "Time_End": 2139.44,
      "Text": " set of allow listed DLLs or by hash or they will do hash blocking, and so, of course, changing the"
    },
    {
      "Time_Start": 2139.44,
      "Time_End": 2145.2799999999997,
      "Text": " hash on files is pretty easy, but the key thing here is to change the hash while maintaining"
    },
    {
      "Time_Start": 2145.2799999999997,
      "Time_End": 2151.7599999999998,
      "Text": " that signed Microsoft Sign Binary status, and so that's where there's a project by Mr. Unicoder"
    },
    {
      "Time_Start": 2151.7599999999998,
      "Time_End": 2158.3199999999997,
      "Text": " that is called Windows Sign Binary that will tell you which bytes you can change in some of these"
    },
    {
      "Time_Start": 2158.32,
      "Time_End": 2165.28,
      "Text": " DLLs or other execution methods that are signed by Microsoft without affecting that specific"
    },
    {
      "Time_Start": 2165.84,
      "Time_End": 2171.6800000000003,
      "Text": " signature, so you'll still have a signed binary and it still works, but it won't have that hash,"
    },
    {
      "Time_Start": 2171.6800000000003,
      "Time_End": 2175.36,
      "Text": " so just ways that you can continue to sort of scale up what you're doing."
    },
    {
      "Time_Start": 2176.6400000000003,
      "Time_End": 2182.32,
      "Text": " Now, a couple of additional resources. BC Security forked Empire after it was sunset by SpectreOps a"
    },
    {
      "Time_Start": 2182.32,
      "Time_End": 2187.36,
      "Text": " number of years ago. They added a GUI called Starkiller, and that's one additional resource"
    },
    {
      "Time_Start": 2187.36,
      "Time_End": 2193.1200000000003,
      "Text": " when you're specifically looking at PowerShell. Now, SpectreOps also deprecated and released their"
    },
    {
      "Time_Start": 2193.1200000000003,
      "Time_End": 2197.92,
      "Text": " free Adversary Tactics PowerShell course. Check it out if you want. There's a lot of good exercises,"
    },
    {
      "Time_Start": 2197.92,
      "Time_End": 2203.1200000000003,
      "Text": " labs. All of the slides are there, too, and it's a four-day class. I took it back in 2017,"
    },
    {
      "Time_Start": 2203.84,
      "Time_End": 2207.04,
      "Text": " and so that was it's a good class. I still recommend checking it out."
    },
    {
      "Time_Start": 2207.92,
      "Time_End": 2213.6800000000003,
      "Text": " Now, let's talk about Lulbass here to sort of wrap things up. This was start off as living"
    },
    {
      "Time_Start": 2213.68,
      "Time_End": 2219.6,
      "Text": " off the land binaries, so Lulbins, and it was initially coined by Matt Graber and that team,"
    },
    {
      "Time_Start": 2219.6,
      "Time_End": 2223.6,
      "Text": " and a lot of the early public research was done by Casey Smith, so I just wanted to give,"
    },
    {
      "Time_Start": 2223.6,
      "Time_End": 2227.9199999999996,
      "Text": " especially Casey, a lot of shoutouts because if you go through the Lulbass project, you'll see"
    },
    {
      "Time_Start": 2227.9199999999996,
      "Time_End": 2234.72,
      "Text": " a lot of references with Casey as the contributor, and it's great in sort of listing all of those"
    },
    {
      "Time_Start": 2234.72,
      "Time_End": 2238.72,
      "Text": " Microsoft signed binaries that allow you to execute something else, and so that's what I"
    },
    {
      "Time_Start": 2238.72,
      "Time_End": 2242.0,
      "Text": " couldn't, you know, couldn't do it justice better than what they already had in the GitHub,"
    },
    {
      "Time_Start": 2242.64,
      "Time_End": 2248.4,
      "Text": " and basically the idea is there's unexpected functionality that might be useful to a red"
    },
    {
      "Time_Start": 2248.4,
      "Time_End": 2254.56,
      "Text": " team or a threat actor, and that's something that we're going to dive into a little bit more,"
    },
    {
      "Time_Start": 2254.56,
      "Time_End": 2260.16,
      "Text": " and part of the reason I want to dive into this is because it challenges some of our assumptions"
    },
    {
      "Time_Start": 2260.16,
      "Time_End": 2265.68,
      "Text": " with that first question. With PowerShell and what we chose this last for our last example,"
    },
    {
      "Time_Start": 2265.68,
      "Time_End": 2270.72,
      "Text": " it's super easy to execute that in the command line, but executing payloads for MSBuild,"
    },
    {
      "Time_Start": 2270.7200000000003,
      "Time_End": 2275.36,
      "Text": " if you've never done it before, is something that is going to require a little bit more effort,"
    },
    {
      "Time_Start": 2275.36,
      "Time_End": 2278.96,
      "Text": " so what you see at the top there, that top blue bar, is going to be what you see with"
    },
    {
      "Time_Start": 2278.96,
      "Time_End": 2285.1200000000003,
      "Text": " the Lulbass project. It says what those specific, that Lulbass can do. It can, in this case,"
    },
    {
      "Time_Start": 2285.1200000000003,
      "Time_End": 2292.2400000000002,
      "Text": " execute, and it's an application whitelisting bypass, and so while MSBuild is not on Windows,"
    },
    {
      "Time_Start": 2293.0400000000004,
      "Time_End": 2297.36,
      "Text": " out of the box, it tends to get installed, even if you don't mean it to, because of other"
    },
    {
      "Time_Start": 2297.36,
      "Time_End": 2302.1600000000003,
      "Text": " applications that are either building or installing things on the endpoint, so even if it's"
    },
    {
      "Time_Start": 2302.1600000000003,
      "Time_End": 2307.84,
      "Text": " not there, or if it shouldn't be there, it might be there. Now, the other thing when we're talking"
    },
    {
      "Time_Start": 2307.84,
      "Time_End": 2314.08,
      "Text": " about variants that I didn't touch on before is 32 versus 64-bit versions, and that's"
    },
    {
      "Time_Start": 2314.08,
      "Time_End": 2319.36,
      "Text": " something that you can see here. There is that variance in the two, so again, you have different"
    },
    {
      "Time_Start": 2319.36,
      "Time_End": 2324.56,
      "Text": " executables, in this case, or different file paths that might impact your detection, so make sure to"
    },
    {
      "Time_Start": 2324.56,
      "Time_End": 2328.48,
      "Text": " look at that, and of course, that's going to impact your ability to execute payloads, because"
    },
    {
      "Time_Start": 2328.48,
      "Time_End": 2336.48,
      "Text": " you need to tailor your payload to the version of MSBuild, so one of the things is that I mentioned"
    },
    {
      "Time_Start": 2336.48,
      "Time_End": 2341.6,
      "Text": " before that's going to be more difficult to pay on your technique is how to execute it, and you"
    },
    {
      "Time_Start": 2341.6,
      "Time_End": 2347.7599999999998,
      "Text": " may not have the expertise right now, like, just sitting there to be able to execute a MSBuild"
    },
    {
      "Time_Start": 2347.7599999999998,
      "Time_End": 2351.7599999999998,
      "Text": " one, and so that's where I wanted to at least touch on something that's a little bit harder"
    },
    {
      "Time_Start": 2351.76,
      "Time_End": 2357.6000000000004,
      "Text": " in order to build up tests, and this is where the Lullabass project does give you a bunch of"
    },
    {
      "Time_Start": 2357.6000000000004,
      "Time_End": 2363.5200000000004,
      "Text": " examples of how to execute them, and there are other blog posts. Tools like Metasploit will"
    },
    {
      "Time_Start": 2363.5200000000004,
      "Time_End": 2368.0,
      "Text": " help you build that initial payload, but again, this is where I emphasize making sure that initial"
    },
    {
      "Time_Start": 2368.0,
      "Time_End": 2373.6800000000003,
      "Text": " payload only tests, you know, in this case, like, the get process technique, so that you're still"
    },
    {
      "Time_Start": 2373.6800000000003,
      "Time_End": 2378.1600000000003,
      "Text": " testing your execution methods, and so this might take you some time to figure out what you're doing,"
    },
    {
      "Time_Start": 2378.16,
      "Time_End": 2383.04,
      "Text": " but that is normal. You're going to have to figure these out before you can even start doing"
    },
    {
      "Time_Start": 2383.04,
      "Time_End": 2386.8799999999997,
      "Text": " those variances that I talked about for the execution method. You're going to have to figure"
    },
    {
      "Time_Start": 2386.8799999999997,
      "Time_End": 2393.12,
      "Text": " out how to execute it, and so that's just something I want to, you know, address, because as you get"
    },
    {
      "Time_Start": 2393.12,
      "Time_End": 2397.7599999999998,
      "Text": " into the more complex techniques, you're going to have to spend some research time to even get your"
    },
    {
      "Time_Start": 2397.7599999999998,
      "Time_End": 2401.52,
      "Text": " initial test case going, and that's something that, especially if you're new to this, might be"
    },
    {
      "Time_Start": 2401.52,
      "Time_End": 2407.52,
      "Text": " a frustrating experience, but know that everyone goes through it at one time or another. Now,"
    },
    {
      "Time_Start": 2408.16,
      "Time_End": 2414.72,
      "Text": " again, those variations, can we move it? Can we run it a different way? These are things that you"
    },
    {
      "Time_Start": 2414.72,
      "Time_End": 2419.04,
      "Text": " should explore with every execution method, and this tends to break a lot of the detections,"
    },
    {
      "Time_Start": 2419.04,
      "Time_End": 2424.08,
      "Text": " especially when we're talking about Lullabass, so PowerShell has been something that, with newer"
    },
    {
      "Time_Start": 2424.08,
      "Time_End": 2431.44,
      "Text": " versions, does tend to be pretty well documented, so it's really about figuring out what is your"
    },
    {
      "Time_Start": 2431.44,
      "Time_End": 2435.84,
      "Text": " threshold for risk, and what types of adversaries do you think are going to be targeting your"
    },
    {
      "Time_Start": 2435.84,
      "Time_End": 2439.6,
      "Text": " organization, because the more advanced they are, the more they're going to be doing some of these"
    },
    {
      "Time_Start": 2439.6,
      "Time_End": 2444.88,
      "Text": " variations, because adversaries don't want to rebuild capability. They really want to focus"
    },
    {
      "Time_Start": 2444.88,
      "Time_End": 2450.56,
      "Text": " on minimal effort in order to have that maximal gain, and that's why they tend to choose and"
    },
    {
      "Time_Start": 2450.56,
      "Time_End": 2457.12,
      "Text": " change out execution methods rather than entire new techniques, so there are also, you know,"
    },
    {
      "Time_Start": 2457.12,
      "Time_End": 2461.44,
      "Text": " bunch of different detections listed on the Lullabass project page. I heavily recommend you"
    },
    {
      "Time_Start": 2461.44,
      "Time_End": 2468.3199999999997,
      "Text": " check those out, because I think that's sort of a key part of this. Correlation is really needed"
    },
    {
      "Time_Start": 2468.3199999999997,
      "Time_End": 2472.64,
      "Text": " for these. This is where I talked about those network connections being key. You know, my"
    },
    {
      "Time_Start": 2473.44,
      "Time_End": 2480.72,
      "Text": " historic example here is Meterpreter from Metasploit tended to spawn notepad.exe calling"
    },
    {
      "Time_Start": 2480.72,
      "Time_End": 2486.4,
      "Text": " back on port 4444, and so that's something that, if you saw in your network, you knew that was"
    },
    {
      "Time_Start": 2486.4,
      "Time_End": 2493.28,
      "Text": " probably a malicious actor or tester, and that's, in that case, something that takes correlation"
    },
    {
      "Time_Start": 2493.28,
      "Time_End": 2498.32,
      "Text": " and context with notepad probably shouldn't be calling out to the internet, and same with you"
    },
    {
      "Time_Start": 2498.32,
      "Time_End": 2502.64,
      "Text": " and your environment trying to understand what are some of those Lullabass techniques. Should they be"
    },
    {
      "Time_Start": 2502.64,
      "Time_End": 2507.04,
      "Text": " calling out to the internet or spawning network connections, and if not, that's probably a good"
    },
    {
      "Time_Start": 2507.04,
      "Time_End": 2512.4,
      "Text": " place to start for your detections, though there's always more. There's a ton of different ones. I've"
    },
    {
      "Time_Start": 2512.4,
      "Time_End": 2520.2400000000002,
      "Text": " only covered, you know, really two big ones here, one in depth, and so I always invite you to go and"
    },
    {
      "Time_Start": 2520.2400000000002,
      "Time_End": 2523.92,
      "Text": " do some of your own research to explore some of these, because that's how you're going to find"
    },
    {
      "Time_Start": 2523.92,
      "Time_End": 2530.7200000000003,
      "Text": " new and undocumented ways that haven't been discovered yet, so check them out. There's a"
    },
    {
      "Time_Start": 2530.7200000000003,
      "Time_End": 2536.08,
      "Text": " lot of good research out there being done. Give another shout out here to MDSet for also doing a"
    },
    {
      "Time_Start": 2536.08,
      "Time_End": 2540.32,
      "Text": " lot of good research, and they've got some great blogs that give a technical breakdown on how you"
    },
    {
      "Time_Start": 2540.32,
      "Time_End": 2546.0,
      "Text": " can do some of these things. So with that, I hope you took away at least what made these"
    },
    {
      "Time_Start": 2546.0,
      "Time_End": 2552.0800000000004,
      "Text": " challenging as a test part, just how you can go and sort of do some more in-depth testing of"
    },
    {
      "Time_Start": 2552.0800000000004,
      "Time_End": 2556.96,
      "Text": " execution methods, and of course, there are a ton of resources here, so hopefully you picked up at"
    },
    {
      "Time_Start": 2556.96,
      "Time_End": 2562.88,
      "Text": " least one new one or at least have a couple of things that you can try out later. With that,"
    },
    {
      "Time_Start": 2562.88,
      "Time_End": 2569.12,
      "Text": " thanks so much."
    }
  ]
}