{"segments": [{"Time_Start": 0.0, "Time_End": 17.44, "Text": " Hi, my name is noise, I'm an anonymous email operator."}, {"Time_Start": 19.94, "Time_End": 22.62, "Text": " That's been a standard handshake greeting for the past year or so,"}, {"Time_Start": 22.82, "Time_End": 26.78, "Text": " and I find that its reception as some kind of 12-step confession is not wholly incoincidental."}, {"Time_Start": 27.36, "Time_End": 28.900000000000002, "Text": " I think there are a couple of reasons for this."}, {"Time_Start": 28.900000000000002, "Time_End": 31.900000000000002, "Text": " First, anonymous re-mailers are old hat these days."}, {"Time_Start": 31.900000000000002, "Time_End": 36.900000000000006, "Text": " Most of the clue for people have straight off to work on sexier, high-bandwidth anonymity tools and protocols."}, {"Time_Start": 36.900000000000006, "Time_End": 38.900000000000006, "Text": " I certainly don't begrudge than that."}, {"Time_Start": 38.900000000000006, "Time_End": 42.900000000000006, "Text": " Distributed anonymous information, storage, and retrieval systems are neat,"}, {"Time_Start": 42.900000000000006, "Time_End": 48.900000000000006, "Text": " and the potential of a widespread micropayment-based remower network coming online the next couple of years pleases me greatly."}, {"Time_Start": 48.900000000000006, "Time_End": 53.900000000000006, "Text": " However, a side effect of this interest shift is the resulting general misconception"}, {"Time_Start": 53.900000000000006, "Time_End": 57.900000000000006, "Text": " that the current public anonymous remallor network is now unimportant and uninterested."}, {"Time_Start": 57.9, "Time_End": 61.28, "Text": " unimportant and uninteresting, something I hope to dispel in the next 40 minutes."}, {"Time_Start": 62.28, "Time_End": 66.9, "Text": " Second, there are a plethora of free web-based mail systems out there that purport"}, {"Time_Start": 66.9, "Time_End": 72.78, "Text": " to offer varying degrees of security to their users. Disposable accounts from hot mail to"}, {"Time_Start": 72.78, "Time_End": 77.3, "Text": " hash mail are easy for the masses to use. They have snazied web interfaces, which make"}, {"Time_Start": 77.3, "Time_End": 82.4, "Text": " account creation and mail management essentially painless. These features obviously account"}, {"Time_Start": 82.4, "Time_End": 86.9, "Text": " for the wide popularity, and the varying degrees of security they offer is thought to be good enough"}, {"Time_Start": 86.9, "Time_End": 88.44000000000001, "Text": " for most people, for most purposes."}, {"Time_Start": 89.72, "Time_End": 93.22, "Text": " Thus, another misconception I frequently encounter is the notion that anonymous"}, {"Time_Start": 93.22, "Time_End": 96.74000000000001, "Text": " re-mailers have been rendered wholly obsolete by these web-based systems."}, {"Time_Start": 97.36000000000001, "Time_End": 103.2, "Text": " But, even assuming each of these web-based systems offer strong end-to-end encryption, that by no means"}, {"Time_Start": 103.2, "Time_End": 105.7, "Text": " obviates the need for a public anonymous remower network."}, {"Time_Start": 106.58000000000001, "Time_End": 110.96000000000001, "Text": " Finally, there's a shocking amount of apathy on the part of many otherwise, technically savvy, and"}, {"Time_Start": 110.96000000000001, "Time_End": 114.76, "Text": " clueful people when it comes to what anonymous remellers really are and how they work."}, {"Time_Start": 115.36000000000001, "Time_End": 116.80000000000001, "Text": " One of the main reasons I'm up here today,"}, {"Time_Start": 116.9, "Time_End": 119.9, "Text": " is the result of a conversation I had with some people at Defcom last year."}, {"Time_Start": 120.66000000000001, "Time_End": 123.34, "Text": " Multiple times, I've been asked what the big deal with running a re-mailer is."}, {"Time_Start": 123.80000000000001, "Time_End": 126.30000000000001, "Text": " People actually ask me things like, don't they just strip out headers?"}, {"Time_Start": 127.52000000000001, "Time_End": 131.28, "Text": " These were not simpletons. One of them is given an Uber Haxor talk here tomorrow."}, {"Time_Start": 132.86, "Time_End": 137.02, "Text": " They've just never been exposed to remailers in any meaningful sort of way, and I found that disturbing."}, {"Time_Start": 137.94, "Time_End": 142.98000000000002, "Text": " That said, today I'm going to cover how remellers work, who uses them, and who wants them shut down."}, {"Time_Start": 143.98000000000002, "Time_End": 146.52, "Text": " Along the way, I'll also be shamelessly proselytizing,"}, {"Time_Start": 146.52, "Time_End": 149.60000000000002, "Text": " in the hopes of convincing some of you to become re-mailer operators yourselves,"}, {"Time_Start": 150.06, "Time_End": 154.76000000000002, "Text": " and the rest of you, that the history, evolution, and recent developments surrounding the anonymous"}, {"Time_Start": 154.76000000000002, "Time_End": 157.8, "Text": " re-mailer network are still interesting, relevant, and cool today."}, {"Time_Start": 158.94, "Time_End": 163.02, "Text": " To have a small disclaimer, running anonymous re-mailer, it's just a somewhat glorified happy of mine."}, {"Time_Start": 163.5, "Time_End": 165.98000000000002, "Text": " I'll do my best answer questions, but I'm by no means an expert."}, {"Time_Start": 166.52, "Time_End": 169.84, "Text": " If I fuck up and say something boneheaded, please point it out to me I'd really appreciate it."}, {"Time_Start": 171.48000000000002, "Time_End": 171.88, "Text": " Okay."}, {"Time_Start": 171.88, "Time_End": 176.5, "Text": " By far the best and most widely used, well, known, and most widely used re-meller, was an honest,"}, {"Time_Start": 176.52, "Time_End": 182.18, "Text": " .penet.5, or pennet, run by you of health English, hustling us, out of Finland, from 1992 through"}, {"Time_Start": 182.18, "Time_End": 188.04000000000002, "Text": " 96. In its hey though, it was home to almost half immoral users. Penet was not an anonymous"}, {"Time_Start": 188.04000000000002, "Time_End": 193.42000000000002, "Text": " re-mailer. It was actually a pseudoanamous remeller, and it worked as follows. Suppose Alice wanted"}, {"Time_Start": 193.42000000000002, "Time_End": 197.82000000000002, "Text": " to post a message to use Met without reviewing her originating email address, say Alice at"}, {"Time_Start": 197.82000000000002, "Time_End": 202.74, "Text": " somewhere.com. Alice could mail her message to Pennett, along with instructions specifying to"}, {"Time_Start": 202.74, "Time_End": 204.12, "Text": " which group she wanted the note posted."}, {"Time_Start": 204.12, "Time_End": 208.88, "Text": " Bennett would then post her message, to use Met, replacing Alice's true email address"}, {"Time_Start": 208.88, "Time_End": 212.04, "Text": " with something like anon-123 at anon.enot.Pennett."}, {"Time_Start": 212.76, "Time_End": 217.5, "Text": " Pennett maintained a list of true email addresses and the corresponding areas is on Pennant."}, {"Time_Start": 218.26, "Time_End": 221.16, "Text": " This allowed people to reply to Alice without knowing her true address."}, {"Time_Start": 221.66, "Time_End": 225.76, "Text": " Thus, mail sent to Anon 123 would be forwarded by the emailer to Alice at Somewhere.com."}, {"Time_Start": 226.54000000000002, "Time_End": 229.62, "Text": " The Pennett system was free, simple, and really easy to use."}, {"Time_Start": 230.06, "Time_End": 233.4, "Text": " Its location outside of the United States jurisdiction also made it quite attractive."}, {"Time_Start": 234.12, "Time_End": 238.18, "Text": " Its admin spent approximately $1,000 a month running the system for what he described as"}, {"Time_Start": 238.18, "Time_End": 243.8, "Text": " humanitarian reasons and to permit freedom of expression about sensitive issues."}, {"Time_Start": 245.14000000000001, "Time_End": 249.3, "Text": " Pennett helped everyone from human rights activists, fearing reprisals, to people recovering from sexual"}, {"Time_Start": 249.3, "Time_End": 254.08, "Text": " abuse, to people's straight jobs, willing to discuss their erratic peccodillos in public forums."}, {"Time_Start": 254.56, "Time_End": 258.28000000000003, "Text": " Whole use net groups virtually owe their existence to Pennett."}, {"Time_Start": 259.48, "Time_End": 262.48, "Text": " Unfortunately, Bennett had a weather-glaring similar point of failure."}, {"Time_Start": 262.48, "Time_End": 266.88, "Text": " Yolf could readily determine the identity of his users by simply examining the"}, {"Time_Start": 266.88, "Time_End": 267.72, "Text": " logs on his system."}, {"Time_Start": 268.92, "Time_End": 272.8, "Text": " This fall ultimately caused him to close his rumor as the result of the following two legal attacks."}, {"Time_Start": 273.86, "Time_End": 279.94, "Text": " On February 2nd, 1995, an American representative of the Church of Scientology contacted Yolf,"}, {"Time_Start": 280.06, "Time_End": 283.90000000000003, "Text": " informing him that some information residing on an internal Scientology computer in California"}, {"Time_Start": 283.90000000000003, "Time_End": 287.38, "Text": " was stolen and had been made public via penit-usenet-us-us-net post."}, {"Time_Start": 288.08000000000004, "Time_End": 292.46000000000004, "Text": " The church claimed that the information was classified as their corporate"}, {"Time_Start": 292.48, "Time_End": 298.42, "Text": " secret. The church reported this event as a burglary to the LAPD and FBI, and the"}, {"Time_Start": 298.42, "Time_End": 303.76, "Text": " representative of the church asked Yoof to reveal the identity of the user. After Yoof made it"}, {"Time_Start": 303.76, "Time_End": 308.06, "Text": " clear that he would not reveal the personal information of his users, he was told an official request"}, {"Time_Start": 308.06, "Time_End": 313.32, "Text": " had been sent to finish police via Interpol. On February 8th, Yof was served with a search"}, {"Time_Start": 313.32, "Time_End": 317.26, "Text": " and seizure warrant on his home and the pennant server, demanding the name of the anonymous user."}, {"Time_Start": 318.02000000000004, "Time_End": 322.46000000000004, "Text": " Yoof managed to prevent confiscation of the entire server by giving the police information."}, {"Time_Start": 322.48, "Time_End": 324.14000000000004, "Text": " only on a discette, which he had copied."}, {"Time_Start": 324.90000000000003, "Time_End": 328.76, "Text": " He was revealed to finish police that the anonymous ID would belong to an account of Caltech."}, {"Time_Start": 329.8, "Time_End": 334.42, "Text": " Armed with this information, the Scientologist's lawyers sent private investigators to Caltech that same day,"}, {"Time_Start": 334.84000000000003, "Time_End": 337.52000000000004, "Text": " demanding personal information on set users' account."}, {"Time_Start": 338.32, "Time_End": 343.36, "Text": " To Caltech's credit, the school refused to give the Church of Scientology or its private investigators"}, {"Time_Start": 343.36, "Time_End": 349.5, "Text": " in the information, but it ultimately did divulge the info to the LAPU detectives who subsequently"}, {"Time_Start": 349.5, "Time_End": 350.44, "Text": " contacted the school."}, {"Time_Start": 351.40000000000003, "Time_End": 352.46000000000004, "Text": " The second attack on the school."}, {"Time_Start": 352.48, "Time_End": 356.8, "Text": " Pennet came in the spring of 1996 after the Church of Scientology sued Grady Ward"}, {"Time_Start": 356.8, "Time_End": 362.6, "Text": " and subjected him to nearly 11 hours of deposition by Silentology lawyers. The church accused Grady of"}, {"Time_Start": 362.6, "Time_End": 367.48, "Text": " violating the church's copyrights by posting several of its advanced technology documents on the web"}, {"Time_Start": 367.48, "Time_End": 373.22, "Text": " via anonymous re-mowers. In the course of its lawsuit, the Church of Scientology again pressured"}, {"Time_Start": 373.22, "Time_End": 376.94, "Text": " finished police for access to Pennett's records, this time to determine whether or not"}, {"Time_Start": 376.94, "Time_End": 381.98, "Text": " Grady Ward had ever used remuners. Finish police, bowing to the Scientologist's request,"}, {"Time_Start": 382.48, "Time_End": 386.74, "Text": " contacted Yolf in June of 1996, demanding that he turn over the names of two more users."}, {"Time_Start": 387.54, "Time_End": 391.54, "Text": " Specifically, they sought the identities of users who have posted Scientology documents to Usenet"}, {"Time_Start": 391.54, "Time_End": 396.1, "Text": " in February and March. Yof asked the Finnish court for a delay, and the court granted one until"}, {"Time_Start": 396.1, "Time_End": 402.32, "Text": " August 22nd. At the August 22nd hearing, the Helsinki District Court decided against Yolf"}, {"Time_Start": 402.32, "Time_End": 406.94, "Text": " and ordered him to turn over the names. In effect, the court ruled that email was not protected by"}, {"Time_Start": 406.94, "Time_End": 410.34000000000003, "Text": " standard Finnish privacy laws as other communications such as telephone calls."}, {"Time_Start": 410.34000000000003, "Time_End": 414.90000000000003, "Text": " He appealed the ruling, but feeling that if he lost the case, he ultimately might"}, {"Time_Start": 414.90000000000003, "Time_End": 419.58000000000004, "Text": " be forced to compromise the identities of more users. He closed Pennett down on August 30th."}, {"Time_Start": 420.18, "Time_End": 424.44000000000005, "Text": " He found the rise of other room hours throughout the world in the three years Pennant operated"}, {"Time_Start": 424.44000000000005, "Time_End": 429.00000000000006, "Text": " something of a consolation. Yorff was ultimately ordered to reveal the accounts by the"}, {"Time_Start": 429.00000000000006, "Time_End": 433.94000000000005, "Text": " accord of appeals, which he did so to finish police. Amazingly, both accounts at Pennett were mapped to"}, {"Time_Start": 433.94000000000005, "Time_End": 439.64000000000004, "Text": " accounts at alpha.c2.org, a pseudonym server offering the potential for being very secure and able to resist"}, {"Time_Start": 439.64, "Time_End": 444.2, "Text": " the very kind of attack that shut down Pennett. Enter the Cypherpunk or type 1 remiller."}, {"Time_Start": 445.4, "Time_End": 450.26, "Text": " Cypherpump remallers have two vast improvements over Pennett-style remillers. They support chaining"}, {"Time_Start": 450.26, "Time_End": 455.5, "Text": " and PGP encryption. The structure of cypher pump email messages is a nested set of encrypted"}, {"Time_Start": 455.5, "Time_End": 460.86, "Text": " messages where each message is encrypted to crew a remiller. The message contains instructions for each"}, {"Time_Start": 460.86, "Time_End": 465.8, "Text": " remiller, such as where to send the message next, and the message to be forwarded. Each remover"}, {"Time_Start": 465.8, "Time_End": 469.62, "Text": " removes a layer of encryption and accompanying instructions, takes any request,"}, {"Time_Start": 469.64, "Time_End": 472.24, "Text": " and sends the message on to the next destination."}, {"Time_Start": 473.2, "Time_End": 476.59999999999997, "Text": " This is easy to visualize through tangible snail mail analogy."}, {"Time_Start": 477.58, "Time_End": 479.64, "Text": " Suppose Alice writes Bob's address on an envelope."}, {"Time_Start": 480.32, "Time_End": 484.32, "Text": " Inside the envelope is another envelope with instructions for Bob to mail the inner envelope to Charlie."}, {"Time_Start": 484.97999999999996, "Time_End": 489.58, "Text": " Charlie gets the envelope, opens it, and finds a smaller envelope with instructions to send it to Dave,"}, {"Time_Start": 489.78, "Time_End": 493.47999999999996, "Text": " and so on, until the innermost message is eventually sent to its intended recipient."}, {"Time_Start": 494.78, "Time_End": 498.59999999999997, "Text": " Of course, in the world, nothing would prevent Bob from peeking inside of all of the envelopes,"}, {"Time_Start": 498.7, "Time_End": 499.62, "Text": " so the analogy isn't perfect."}, {"Time_Start": 499.64, "Time_End": 500.91999999999996, "Text": " But you get the general idea."}, {"Time_Start": 501.8, "Time_End": 506.41999999999996, "Text": " So, a standard cypherpunk re-mailer can send messages to another email address or post it to a news group,"}, {"Time_Start": 506.88, "Time_End": 514.6999999999999, "Text": " and it can accept encrypted messages with instructions for processing hidden inside the encrypted message."}, {"Time_Start": 516.08, "Time_End": 518.26, "Text": " Anonymous re-mowers are designed to prevent traffic analysis."}, {"Time_Start": 518.9399999999999, "Time_End": 524.3199999999999, "Text": " And while cyphepunk renalers substantially reduce the likelihood of a casual adversary gaining access to messages,"}, {"Time_Start": 525.0, "Time_End": 529.52, "Text": " through more trivial methods such as packet snivers, it's important to note the weaknesses in the"}, {"Time_Start": 529.52, "Time_End": 533.52, "Text": " system, particularly against a very powerful adversary, with access to many resources."}, {"Time_Start": 533.52, "Time_End": 539.02, "Text": " Assuming an attacker is able to record the contents of all messages into and out of re-mailers,"}, {"Time_Start": 539.02, "Time_End": 541.52, "Text": " along with the times they arrive and depart."}, {"Time_Start": 541.52, "Time_End": 546.52, "Text": " All messages are monitored as they leave, the sender's machine, and as they arrive at the destination."}, {"Time_Start": 546.52, "Time_End": 552.52, "Text": " Also, the attacker is able to send an unlimited number of messages through the re-mailers, including previously intercepted messages."}, {"Time_Start": 552.52, "Time_End": 557.52, "Text": " Messages can be prevented from arriving at their destinations by denial of service."}, {"Time_Start": 557.52, "Time_End": 558.52, "Text": " Also, suppose the attacker has to be prevented from arriving at their destinations by a denial of service."}, {"Time_Start": 558.52, "Time_End": 559.52, "Text": " Also, suppose the attacker has a number of service."}, {"Time_Start": 559.52, "Time_End": 564.52, "Text": " has compromised some, but not all, of the re-mailers, and there's the source, destination,"}, {"Time_Start": 564.52, "Time_End": 569.52, "Text": " and contents of all messages passing through the compromised re-mailers."}, {"Time_Start": 572.52, "Time_End": 576.52, "Text": " This threat model may sound a bit steep, but I'm hardly comfortable saying that it is beyond"}, {"Time_Start": 576.52, "Time_End": 580.52, "Text": " the capabilities of certain TLA agencies who are present at this con today."}, {"Time_Start": 580.52, "Time_End": 585.52, "Text": " The most fundamental problem with cypherpunk re-mailers is that messages can be traced through them despite"}, {"Time_Start": 585.52, "Time_End": 587.52, "Text": " their encryption and chaining capabilities."}, {"Time_Start": 587.52, "Time_End": 589.5, "Text": " This is because incoming messages,"}, {"Time_Start": 589.52, "Time_End": 592.52, "Text": " are forwarded directly after processing."}, {"Time_Start": 592.52, "Time_End": 596.52, "Text": " Thus, when one message arrives, another message leads immediately thereafter."}, {"Time_Start": 596.52, "Time_End": 599.52, "Text": " With no further information, the attacker knows that these are the same message,"}, {"Time_Start": 599.52, "Time_End": 602.52, "Text": " despite any precautions that may have been taken."}, {"Time_Start": 602.52, "Time_End": 606.52, "Text": " This can be done retroactively using mail logs if they're kept."}, {"Time_Start": 606.52, "Time_End": 612.52, "Text": " The first proposed solution to this problem was to delay incoming messages for some random length of time."}, {"Time_Start": 612.52, "Time_End": 615.52, "Text": " If this time were longer than the time between message arrivals,"}, {"Time_Start": 615.52, "Time_End": 619.52, "Text": " then it would be impossible to know, with certainty, which incoming messages corresponded to"}, {"Time_Start": 619.52, "Time_End": 624.52, "Text": " which outgoing messages. Sounds nice, but this proposal is weak for several reasons."}, {"Time_Start": 624.52, "Time_End": 628.52, "Text": " First, the exact amount of protection provided by latency is unknown."}, {"Time_Start": 628.52, "Time_End": 630.52, "Text": " It depends on the traffic through the email at that time."}, {"Time_Start": 630.52, "Time_End": 635.52, "Text": " If there are many messages arriving in the average holding time,"}, {"Time_Start": 635.52, "Time_End": 640.52, "Text": " then the idea of the message is reasonably well disguised."}, {"Time_Start": 640.52, "Time_End": 643.52, "Text": " But if there's very little traffic due to moment fluctuations,"}, {"Time_Start": 643.52, "Time_End": 648.52, "Text": " network outages, or denial of service attacks, the middle or no protection is provided."}, {"Time_Start": 648.52, "Time_End": 649.5, "Text": " To provide some minimum minimum"}, {"Time_Start": 649.52, "Time_End": 656.52, "Text": " level of protection, considering only normal traffic variations, the latency must be larger than it would have to be at times of maximum traffic."}, {"Time_Start": 656.52, "Time_End": 661.52, "Text": " A proposal called reordering fixes this problem, but it opens up another possible attack."}, {"Time_Start": 661.52, "Time_End": 666.52, "Text": " Reordering requires that a rumor will keep a certain number of messages in the pool on the email at all times."}, {"Time_Start": 666.52, "Time_End": 674.52, "Text": " The most efficient re-ordering scheme is to keep N messages in the pool and to send out one of the N plus one messages in the pool,"}, {"Time_Start": 674.52, "Time_End": 676.52, "Text": " including the one that just arrived, chosen at random."}, {"Time_Start": 676.52, "Time_End": 679.52, "Text": " Unfortunately, this scheme is susceptible to a spam,"}, {"Time_Start": 679.52, "Time_End": 683.52, "Text": " An attacker sends many more than end messages to the emailer."}, {"Time_Start": 683.52, "Time_End": 691.52, "Text": " These messages will displace all real messages in the pool, leaving only messages which the attacker can recognize."}, {"Time_Start": 691.52, "Time_End": 697.52, "Text": " If the attacker sends another batch of messages after your message arrives, your message will be flushed back out of the pool."}, {"Time_Start": 697.52, "Time_End": 701.52, "Text": " Since the attacker can recognize his own messages, yours will be obvious."}, {"Time_Start": 701.52, "Time_End": 704.52, "Text": " Combining latency and reordering gives some resistance to this attack."}, {"Time_Start": 704.52, "Time_End": 708.52, "Text": " Rather than sending out one message from the pool each time the message arrives,"}, {"Time_Start": 708.52, "Time_End": 712.52, "Text": " periodically all that end messages in the pool are sent."}, {"Time_Start": 712.52, "Time_End": 715.52, "Text": " If during an average period, several messages have arrived,"}, {"Time_Start": 715.52, "Time_End": 717.52, "Text": " then even if the pool of messages is flushed out,"}, {"Time_Start": 717.52, "Time_End": 721.52, "Text": " there would be more than just your message mixed with the attacker's messages."}, {"Time_Start": 721.52, "Time_End": 724.52, "Text": " If the attacker combines the spam with its mild service attack,"}, {"Time_Start": 724.52, "Time_End": 727.52, "Text": " then your message would be the only non-attacker message again."}, {"Time_Start": 727.52, "Time_End": 730.52, "Text": " There's nothing you can do if the attacker can ensure that yours is the only message"}, {"Time_Start": 730.52, "Time_End": 733.52, "Text": " traversing the entire network of re-mailers."}, {"Time_Start": 733.52, "Time_End": 737.52, "Text": " With ideal re-mellers, your message could be any one of the messages passing through any remeller at the same."}, {"Time_Start": 737.52, "Time_End": 739.52, "Text": " any emailer at the same time."}, {"Time_Start": 739.52, "Time_End": 743.52, "Text": " It appears as the only message passing through the re-mailer network, the new toast."}, {"Time_Start": 743.52, "Time_End": 749.52, "Text": " Now, as soon the message is chained through mailers that are delaying and reordering at every hop."}, {"Time_Start": 749.52, "Time_End": 752.52, "Text": " Your message can still be tracked by its size."}, {"Time_Start": 752.52, "Time_End": 757.52, "Text": " By default, messages decrease in size by a small and approximately known amount each hop."}, {"Time_Start": 757.52, "Time_End": 761.52, "Text": " Even if your message is well mixed with the other messages in the re-mailer,"}, {"Time_Start": 761.52, "Time_End": 764.52, "Text": " and even if there are all different sizes, they are still distinguishable."}, {"Time_Start": 764.52, "Time_End": 767.5, "Text": " It is possible to have the we mailer remove padding from the message"}, {"Time_Start": 767.52, "Time_End": 772.52, "Text": " each hop, but this only decreases the size of the message."}, {"Time_Start": 774.52, "Time_End": 777.52, "Text": " Sorry, I'm really nervous."}, {"Time_Start": 777.52, "Time_End": 782.52, "Text": " This only decreases the size of the message and only to a minimum established by the size"}, {"Time_Start": 782.52, "Time_End": 784.52, "Text": " of the actual message you want to send."}, {"Time_Start": 784.52, "Time_End": 789.52, "Text": " We're also limited by the fact that extremely large messages will stand out,"}, {"Time_Start": 789.52, "Time_End": 795.52, "Text": " since your message must change size by a large fraction of its own size, each hop,"}, {"Time_Start": 795.52, "Time_End": 796.52, "Text": " to ensure maximum confusion."}, {"Time_Start": 796.52, "Time_End": 797.52, "Text": " confusion."}, {"Time_Start": 797.52, "Time_End": 802.52, "Text": " But removing padding at each step confuses traffic analysis, it still leaks information."}, {"Time_Start": 802.52, "Time_End": 807.52, "Text": " All messages that leave a email are larger than your message when it arrived are known not to be yours."}, {"Time_Start": 807.52, "Time_End": 811.52, "Text": " And if the use of this feature is unusual, then your message will stand out as being the only"}, {"Time_Start": 811.52, "Time_End": 813.52, "Text": " one to change size by a non-standard amount."}, {"Time_Start": 813.52, "Time_End": 814.52, "Text": " The solution is clear."}, {"Time_Start": 814.52, "Time_End": 818.52, "Text": " To defeat this attack, all messages must be exactly the same size."}, {"Time_Start": 818.52, "Time_End": 824.52, "Text": " Unfortunately, even reordered, indistinguishable messages can still be tracked under the given threat model."}, {"Time_Start": 824.52, "Time_End": 828.52, "Text": " Replay attacks can be used to follow a message to its final destination,"}, {"Time_Start": 828.52, "Time_End": 831.52, "Text": " or to backtrack from the end to the original sender."}, {"Time_Start": 831.52, "Time_End": 835.52, "Text": " Both types use a type of, both attacks use a type of spam attack."}, {"Time_Start": 835.52, "Time_End": 837.52, "Text": " To trace a message forward through the chain of re-mailers,"}, {"Time_Start": 837.52, "Time_End": 841.52, "Text": " the attacker captures your message and sends many copies of it to the first remiller."}, {"Time_Start": 841.52, "Time_End": 845.52, "Text": " Many identical messages will emerge from the re-mailer and move on to the next one."}, {"Time_Start": 845.52, "Time_End": 848.52, "Text": " This bump in re-mailer traffic will show the route to the message."}, {"Time_Start": 848.52, "Time_End": 852.52, "Text": " When it becomes too dispersed from reordering, the message can be captured between two remailers,"}, {"Time_Start": 852.52, "Time_End": 853.52, "Text": " and many copies were introduced at that point."}, {"Time_Start": 853.52, "Time_End": 855.52, "Text": " is reintroduced at that point."}, {"Time_Start": 855.52, "Time_End": 859.52, "Text": " To prevent this attack, re-mowers must refuse to send any message more than once."}, {"Time_Start": 859.52, "Time_End": 863.52, "Text": " This can be done by including a random ID for each hub, which the re-mailer records."}, {"Time_Start": 863.52, "Time_End": 868.52, "Text": " To limit the storage demands on the re-mailer, IDs may be removed from the list after a period of time."}, {"Time_Start": 868.52, "Time_End": 871.52, "Text": " This could also be cleared whenever a remower changed its key."}, {"Time_Start": 871.52, "Time_End": 877.52, "Text": " Thus, even though cypher pump re-mellers offer vastly more security than pennant-style systems, they have their limits."}, {"Time_Start": 877.52, "Time_End": 881.52, "Text": " There are still security rules that can be used to discover the real sender of a message,"}, {"Time_Start": 881.52, "Time_End": 883.52, "Text": " despite the use of PGP encryption,"}, {"Time_Start": 883.52, "Time_End": 885.52, "Text": " chaining, latency, and reordering."}, {"Time_Start": 885.52, "Time_End": 891.52, "Text": " Type 2, or Mixmaster re-Mellers, render most of the attacks against Type 1 re-mellers useless."}, {"Time_Start": 891.52, "Time_End": 897.52, "Text": " The design philosophy of MixMaster Remellers was strongly influenced by David Chalm's 1981 MixNet paper."}, {"Time_Start": 897.52, "Time_End": 903.52, "Text": " In essence, a Mix, a Mix, or in this case a Remeler, is a service that forwarded messages using public key crypto"}, {"Time_Start": 903.52, "Time_End": 906.52, "Text": " to hide the correlation between its inputs and outputs."}, {"Time_Start": 906.52, "Time_End": 912.52, "Text": " So, if a message is sent through a sequence of mixes, one trusted mix is sufficient to provide anonymity and unobservability of communication."}, {"Time_Start": 912.52, "Time_End": 915.52, "Text": " of communications against a powerful adversary."}, {"Time_Start": 915.52, "Time_End": 919.52, "Text": " Mixmaster wheelers implement the Mixnet protocol for electronic mail."}, {"Time_Start": 919.52, "Time_End": 923.52, "Text": " Unfortunately, I don't have a slide of the structure of a mixed master message,"}, {"Time_Start": 923.52, "Time_End": 927.52, "Text": " and it's more complicated than nested PGP encrypted messages."}, {"Time_Start": 927.52, "Time_End": 935.52, "Text": " Mixmaster uses three triple-dise keys for all data encryption, and 1024-bit RSA for public encryption"}, {"Time_Start": 935.52, "Time_End": 937.52, "Text": " of the triple-dise keys."}, {"Time_Start": 937.52, "Time_End": 941.52, "Text": " Mixmaster messages are sent as one or more packets, up to 250,000."}, {"Time_Start": 941.52, "Time_End": 943.52, "Text": " up to 255 packets total."}, {"Time_Start": 943.52, "Time_End": 947.52, "Text": " Messages consistent of multiple packets are called multi-part messages."}, {"Time_Start": 947.52, "Time_End": 951.52, "Text": " A Mixmaster packet packet contains a header containing information for the remilers"}, {"Time_Start": 951.52, "Time_End": 954.52, "Text": " and a body containing what's referred to as payload data."}, {"Time_Start": 954.52, "Time_End": 959.52, "Text": " To ensure the packets are indistinguishable, all mixed master packets are exactly the same length."}, {"Time_Start": 959.52, "Time_End": 964.52, "Text": " Each of the 20 headers is 512 bytes and the body is 10K."}, {"Time_Start": 964.52, "Time_End": 969.52, "Text": " To send a message, the user agent first splits it up into parts of a fixed size,"}, {"Time_Start": 969.52, "Time_End": 971.52, "Text": " which form the bodies of mixed-master packets."}, {"Time_Start": 971.52, "Time_End": 973.52, "Text": " which can be compressed."}, {"Time_Start": 973.52, "Time_End": 976.52, "Text": " The sender then chooses a sequence of up to 20 re-mailers for each packet."}, {"Time_Start": 976.52, "Time_End": 980.52, "Text": " The final remailer must be identical for multi-part packets."}, {"Time_Start": 980.52, "Time_End": 982.52, "Text": " The packet header contains 20 slots."}, {"Time_Start": 982.52, "Time_End": 987.52, "Text": " For a sequence of N remailers, slots N plus 1 through 20 are filled with random data."}, {"Time_Start": 987.52, "Time_End": 991.52, "Text": " For each of the slots 1 through N, a sender generates a symmetric encryption key"}, {"Time_Start": 991.52, "Time_End": 994.52, "Text": " which is used to encrypt the body and all subsequent header sections."}, {"Time_Start": 994.52, "Time_End": 1000.52, "Text": " So, a particular slot between 1 and N, call it I, will contain a key together with other control information."}, {"Time_Start": 1000.52, "Time_End": 1001.52, "Text": " information."}, {"Time_Start": 1001.52, "Time_End": 1005.48, "Text": " This bonder has been encrypted with the IF remailer's public key."}, {"Time_Start": 1005.48, "Time_End": 1009.28, "Text": " To increase reliability, redundant copies of the message can be sent through different paths."}, {"Time_Start": 1009.28, "Time_End": 1013.52, "Text": " However, the final email in each chain must be identical so that duplicates can be detected"}, {"Time_Start": 1013.52, "Time_End": 1016.14, "Text": " and the message is delivered only once."}, {"Time_Start": 1016.14, "Time_End": 1021.74, "Text": " When a remaster message, it would decrypt the first header slot with its private RSA key."}, {"Time_Start": 1021.74, "Time_End": 1026.28, "Text": " By keeping track of the packet ID, the lima then verifies that the packet has not been produced, processed"}, {"Time_Start": 1026.28, "Time_End": 1027.28, "Text": " before."}, {"Time_Start": 1027.28, "Time_End": 1030.5, "Text": " The integrity of the message is verified by checking the packet length."}, {"Time_Start": 1030.52, "Time_End": 1033.52, "Text": " and verifying message digest included in the packet."}, {"Time_Start": 1033.52, "Time_End": 1039.52, "Text": " Then, the first header is removed, the others are shifted up by one, and the last section is filled with random padding."}, {"Time_Start": 1039.52, "Time_End": 1044.52, "Text": " All header sections and the packet body are decrypted with the symmetric key found in the header."}, {"Time_Start": 1044.52, "Time_End": 1050.52, "Text": " This reveals a public key encrypted header section for the next remower at the top,"}, {"Time_Start": 1050.52, "Time_End": 1052.52, "Text": " and removes the old top header section."}, {"Time_Start": 1052.52, "Time_End": 1055.52, "Text": " Aski armoring is then applied to the resulting message."}, {"Time_Start": 1055.52, "Time_End": 1059.52, "Text": " The remower collects several encrypted messages before sending out the resulting messages."}, {"Time_Start": 1059.52, "Time_End": 1061.52, "Text": " the resulting messages in random order."}, {"Time_Start": 1061.52, "Time_End": 1065.52, "Text": " Data for the last room that I am in the chain contains a flag indicating that it is the last"}, {"Time_Start": 1065.52, "Time_End": 1069.52, "Text": " hop and whether or not it is part, it is part of a multi-part message."}, {"Time_Start": 1069.52, "Time_End": 1074.52, "Text": " If the packet is not multi-part, then the packet body is decrypted and the plain text is placed in a reordering pool"}, {"Time_Start": 1074.52, "Time_End": 1077.52, "Text": " from which it is ultimately delivered to the recipient."}, {"Time_Start": 1077.52, "Time_End": 1084.52, "Text": " If it is one part of the message, the message is used, if it is one part message is used to add"}, {"Time_Start": 1084.52, "Time_End": 1087.52, "Text": " nervous, sorry."}, {"Time_Start": 1087.52, "Time_End": 1089.52, "Text": " If it is one part of the message, the message, the message is used to add, the message,"}, {"Time_Start": 1089.52, "Time_End": 1092.72, "Text": " idea is used to identify the other parts as they arrive."}, {"Time_Start": 1092.72, "Time_End": 1096.42, "Text": " When all the parts have arrived, the message is reassembled, decompressed if necessary, and placed"}, {"Time_Start": 1096.42, "Time_End": 1097.72, "Text": " in the pool."}, {"Time_Start": 1097.72, "Time_End": 1101.52, "Text": " If all of the parts do not arrive within some time limit, the message is discarded."}, {"Time_Start": 1101.52, "Time_End": 1105.52, "Text": " Only the last remower on the chain can see that a group of remower packets are all part of the"}, {"Time_Start": 1105.52, "Time_End": 1106.92, "Text": " single message."}, {"Time_Start": 1106.92, "Time_End": 1110.02, "Text": " To all the others, they are completely independent."}, {"Time_Start": 1110.02, "Time_End": 1113.52, "Text": " Mixmaster re-remalers can offer a good deal of security to their users."}, {"Time_Start": 1113.52, "Time_End": 1116.52, "Text": " As with type 1 re-remalers, though, their security is not infallible."}, {"Time_Start": 1116.52, "Time_End": 1119.5, "Text": " Obviously, the security of the MixNet,"}, {"Time_Start": 1119.52, "Time_End": 1123.52, "Text": " relies on the assumption that the underlying cryptographic primitives are secure."}, {"Time_Start": 1123.52, "Time_End": 1127.52, "Text": " There is no anonymity at all if remuner is in a given chain collude with the adversary,"}, {"Time_Start": 1127.52, "Time_End": 1130.52, "Text": " or if they are compromised during the lifetime of their keys."}, {"Time_Start": 1130.52, "Time_End": 1134.52, "Text": " Using a longer chain increases the assurance that the user's privacy will be preserved,"}, {"Time_Start": 1134.52, "Time_End": 1138.52, "Text": " but at the same time causes lower reliability and higher latency."}, {"Time_Start": 1138.52, "Time_End": 1143.52, "Text": " Sending the dummy copies of a message increases reliability, but may also facilitate attacks."}, {"Time_Start": 1143.52, "Time_End": 1148.52, "Text": " An optimum must be found according to the individual security needs and trust in the remailers."}, {"Time_Start": 1148.52, "Time_End": 1153.52, "Text": " Also, passive adversaries can observe some or all of the messages sent to mixes."}, {"Time_Start": 1153.52, "Time_End": 1159.52, "Text": " The user's anonymity comes from the fact that a large number of messages are collected and sent in random order."}, {"Time_Start": 1159.52, "Time_End": 1164.52, "Text": " For that reason, remodelers should correct as many messages as possible while keeping the latency acceptable."}, {"Time_Start": 1164.52, "Time_End": 1170.52, "Text": " Keep in mind, in essence, anyone with access to email to email could use Pennant."}, {"Time_Start": 1170.52, "Time_End": 1174.52, "Text": " If one had access to PGP as well in a few spare minutes to read the instructions,"}, {"Time_Start": 1174.52, "Time_End": 1177.52, "Text": " anyone could make use of the cipherpunk re-mailer without any additional software."}, {"Time_Start": 1177.52, "Time_End": 1178.52, "Text": " software."}, {"Time_Start": 1178.52, "Time_End": 1179.52, "Text": " Mixmaster is different."}, {"Time_Start": 1179.52, "Time_End": 1182.52, "Text": " Unlike the other emailers, you can't just make your own message and send it to it."}, {"Time_Start": 1182.52, "Time_End": 1183.52, "Text": " And send it."}, {"Time_Start": 1183.52, "Time_End": 1187.52, "Text": " Mixmaster security comes in part from using a special message format."}, {"Time_Start": 1187.52, "Time_End": 1190.52, "Text": " You need a Mixmaster client to create MixMaster messages."}, {"Time_Start": 1190.52, "Time_End": 1195.52, "Text": " I'm sure you're all aware that the steeper the learning curve, the fewer users you get."}, {"Time_Start": 1195.52, "Time_End": 1198.52, "Text": " That said, who uses re-mailers anyway?"}, {"Time_Start": 1198.52, "Time_End": 1201.52, "Text": " I'll indulge my megalomania for a moment and say, I do."}, {"Time_Start": 1201.52, "Time_End": 1203.52, "Text": " And I have since the early 90s."}, {"Time_Start": 1203.52, "Time_End": 1206.52, "Text": " Back then it was usually to post to assorted news groups, which were coincidentally."}, {"Time_Start": 1206.52, "Time_End": 1212.52, "Text": " which were, coincidentally, young teenage girls are underrepresented."}, {"Time_Start": 1212.52, "Time_End": 1214.52, "Text": " I posted anonymously for a number of reasons."}, {"Time_Start": 1214.52, "Time_End": 1220.52, "Text": " First, you're a lot more likely to be taken seriously in a technical group group if you're not a 12-year-old girl."}, {"Time_Start": 1220.52, "Time_End": 1228.52, "Text": " Similarly, you're a lot less likely to get dismissed as a trolling mark or harassed in these groups with more interesting nature."}, {"Time_Start": 1228.52, "Time_End": 1233.52, "Text": " Memoirs are also a nice way to root individuals of computer-related security risks."}, {"Time_Start": 1233.52, "Time_End": 1236.52, "Text": " Today, I mainly use room mallors to post to any way to report."}, {"Time_Start": 1236.52, "Time_End": 1240.52, "Text": " number of mailing lists to which I am subscribed. My concern now is not so much the immediate"}, {"Time_Start": 1240.52, "Time_End": 1243.52, "Text": " protection of my identity so much as throwing the archives."}, {"Time_Start": 1243.52, "Time_End": 1248.52, "Text": " Email is as fast and casual as a voice phone call, but can be stored and retrieved with"}, {"Time_Start": 1248.52, "Time_End": 1251.52, "Text": " infinitely greater efficiency than paper letters or taped conversations."}, {"Time_Start": 1251.52, "Time_End": 1256.52, "Text": " If the storage of that message is not protected, and it rarely is, it can be accessed"}, {"Time_Start": 1256.52, "Time_End": 1261.52, "Text": " by anyone who takes the trouble to rummage through any of the many archived computer records that may have received such a message."}, {"Time_Start": 1261.52, "Time_End": 1262.52, "Text": " Think Deja News."}, {"Time_Start": 1262.52, "Time_End": 1265.52, "Text": " I'm in law school."}, {"Time_Start": 1265.52, "Time_End": 1266.52, "Text": " I'm in law school."}, {"Time_Start": 1266.52, "Time_End": 1270.52, "Text": " real job someday and 10 years from now I'd rather not have my future opponents"}, {"Time_Start": 1270.52, "Time_End": 1274.52, "Text": " digging through archives to dig out my most recent political rant."}, {"Time_Start": 1274.52, "Time_End": 1276.52, "Text": " Makes sense to me."}, {"Time_Start": 1276.52, "Time_End": 1279.52, "Text": " So why might you use a ringmailer?"}, {"Time_Start": 1279.52, "Time_End": 1282.52, "Text": " Maybe you're a computer engineer who wants to express opinions about computer products."}, {"Time_Start": 1282.52, "Time_End": 1285.52, "Text": " Maybe their opinions that your employer wouldn't like you to share."}, {"Time_Start": 1285.52, "Time_End": 1287.52, "Text": " Maybe you work for Microsoft."}, {"Time_Start": 1287.52, "Time_End": 1294.52, "Text": " Maybe you live in a community that's violently intolerant of your social, political, or religious views."}, {"Time_Start": 1294.52, "Time_End": 1295.52, "Text": " A poster to alt."}, {"Time_Start": 1295.52, "Time_End": 1300.02, "Text": " to alt.p.p.privacy.9 server rate, I consider myself to be a fairly good example"}, {"Time_Start": 1300.02, "Time_End": 1305.52, "Text": " of why anonymous re-mowers are needed on the net. To be blunt, I am bisexual, a pervert, and a rich."}, {"Time_Start": 1305.52, "Time_End": 1308.52, "Text": " I also live in Alabama, where at least two of the three are illegal."}, {"Time_Start": 1308.52, "Time_End": 1322.52, "Text": " In a worst case, in a worst-case scenario, I could lose my job, have a career-roomed, face prosecution,"}, {"Time_Start": 1322.52, "Time_End": 1324.52, "Text": " and possibly even have to deal with violence."}, {"Time_Start": 1324.52, "Time_End": 1327.52, "Text": " Maybe you're seeking employment via the internet,"}, {"Time_Start": 1327.52, "Time_End": 1330.52, "Text": " and you don't want to jeopardize your present job."}, {"Time_Start": 1330.52, "Time_End": 1332.52, "Text": " Maybe you're looking for some action in LA personals."}, {"Time_Start": 1332.52, "Time_End": 1334.52, "Text": " I don't really care."}, {"Time_Start": 1334.52, "Time_End": 1336.52, "Text": " Maybe you're a whistleblower, afraid of retaliation."}, {"Time_Start": 1336.52, "Time_End": 1340.52, "Text": " Hey, you might even be an honest bureaucrat seeking out these whistleblowers."}, {"Time_Start": 1340.52, "Time_End": 1343.52, "Text": " Maybe don't want people spanning the corporate address."}, {"Time_Start": 1343.52, "Time_End": 1346.52, "Text": " Maybe if reverse-engineered something you'd like to share with others,"}, {"Time_Start": 1346.52, "Time_End": 1350.52, "Text": " and you'd rather not be the subject of frivolous corporate lawsuits for your trouble."}, {"Time_Start": 1350.52, "Time_End": 1353.52, "Text": " Bubs, exploits, and all sorts of interesting things are frequently reported this."}, {"Time_Start": 1353.52, "Time_End": 1358.8799999999999, "Text": " frequently reported this way. The source code for CSS authentication is released via the"}, {"Time_Start": 1358.8799999999999, "Time_End": 1364.4, "Text": " anonymous email network. Yay. Maybe you feel that if you criticize your government,"}, {"Time_Start": 1364.4, "Time_End": 1369.84, "Text": " Big Brother will start monitoring you. Maybe you live in Kosovo. In early 1999, the anonymous"}, {"Time_Start": 1369.84, "Time_End": 1375.12, "Text": " email network allowed ethnic Albanians to provide first-hand accounts of Serbian atrocities in Kosovo without"}, {"Time_Start": 1375.12, "Time_End": 1380.56, "Text": " fear of retribution. We noticed a big spike of usage during that time. As you have said,"}, {"Time_Start": 1380.56, "Time_End": 1383.5, "Text": " remowers have made it possible for people to discuss very sensitive matter."}, {"Time_Start": 1383.52, "Time_End": 1389.36, "Text": " such as domestic violence, school bullying, or human rights, anonymously, and confidentially"}, {"Time_Start": 1389.36, "Time_End": 1393.28, "Text": " on the internet. The closing of a non-penet FI will make it harder to discuss these matters."}, {"Time_Start": 1393.28, "Time_End": 1398.26, "Text": " In short, there are many legitimate reasons why you, a law-abiding citizen, might use"}, {"Time_Start": 1398.26, "Time_End": 1404.28, "Text": " remailers. These issues here are the rights to freedom of speech and the rights to personal"}, {"Time_Start": 1404.28, "Time_End": 1409.02, "Text": " privacy. Having the right to free speech may work well in the case of verbal expression,"}, {"Time_Start": 1409.02, "Time_End": 1413.5, "Text": " but it may cease to have its intended purpose in face of retaliation that may take place decades"}, {"Time_Start": 1413.52, "Time_End": 1418.52, "Text": " In a system that theoretically can have infinitely large memory and infinitely long remembrance,"}, {"Time_Start": 1418.52, "Time_End": 1423.52, "Text": " the freedom of expression can become abused and perverted by a government that does not respect individual rights."}, {"Time_Start": 1423.52, "Time_End": 1426.52, "Text": " This brings me to my third topic of the afternoon."}, {"Time_Start": 1426.52, "Time_End": 1430.52, "Text": " At any given time, there are usually 20 public type 1 or type 2 renewers in the world."}, {"Time_Start": 1430.52, "Time_End": 1436.52, "Text": " Of these 20, usually only half, offer sufficient reliability to be of actual use."}, {"Time_Start": 1436.52, "Time_End": 1439.52, "Text": " This has been a trend for the past year, for years."}, {"Time_Start": 1439.52, "Time_End": 1443.5, "Text": " So you might be asking, if three dollars are so great, why are they so much?"}, {"Time_Start": 1443.52, "Time_End": 1448.32, "Text": " few of them. The most benign reason I think is that running a remower takes more time,"}, {"Time_Start": 1448.32, "Time_End": 1453.42, "Text": " energy, and patience that most people would care to spend on a free service. I run my"}, {"Time_Start": 1453.42, "Time_End": 1457.34, "Text": " email off load P90 bucks, which I have attached to my university's network. Financially,"}, {"Time_Start": 1457.34, "Time_End": 1461.46, "Text": " it doesn't cost me anything to run it. It's one of my hobbies, so I don't mend spying spending"}, {"Time_Start": 1461.46, "Time_End": 1467.44, "Text": " five weeks or so, five hours a week or so, to care and feed it. Other remarks actually"}, {"Time_Start": 1467.44, "Time_End": 1471.8, "Text": " pay to keep their remorse up in winning. Everything from extra phone lines to co-location facilities"}, {"Time_Start": 1471.8, "Time_End": 1473.4, "Text": " frequently come out of their own pockets."}, {"Time_Start": 1473.52, "Time_End": 1478.52, "Text": " If you've got some spare cash in your pocket, you might want to donate and help one of them out."}, {"Time_Start": 1478.52, "Time_End": 1485.52, "Text": " Personal gratification and running a re-mailer can go a long way, but eventually the headaches and expense one can incur can outweigh the fun."}, {"Time_Start": 1485.52, "Time_End": 1490.52, "Text": " I think the average lifespan of a remower these days is somewhere between three and six months for that reason."}, {"Time_Start": 1490.52, "Time_End": 1493.52, "Text": " Another reason for this is the fact that it's a largely thankless job."}, {"Time_Start": 1493.52, "Time_End": 1497.52, "Text": " Most satisfied email users have little reason to praise their email operators."}, {"Time_Start": 1497.52, "Time_End": 1498.52, "Text": " What would they say?"}, {"Time_Start": 1498.52, "Time_End": 1501.52, "Text": " Hey, I'm Jim, when I used your service to come out of the closet, thanks."}, {"Time_Start": 1501.52, "Time_End": 1502.52, "Text": " Yeah, right."}, {"Time_Start": 1502.52, "Time_End": 1506.52, "Text": " Instead, you're likely to accumulate a massive complaints and threats."}, {"Time_Start": 1506.52, "Time_End": 1507.52, "Text": " Many of them are amusing."}, {"Time_Start": 1507.52, "Time_End": 1509.52, "Text": " 99% of them are harmless."}, {"Time_Start": 1509.52, "Time_End": 1512.52, "Text": " I enjoyed some of the more illiterate ones so much I've taped them up on my fridge."}, {"Time_Start": 1512.52, "Time_End": 1518.52, "Text": " I've been called everything from the communist to a neo-Nazi to a liberal for the simple act of running a roomiller."}, {"Time_Start": 1518.52, "Time_End": 1521.52, "Text": " I tend to laugh out loud picturing myself in any of these rules."}, {"Time_Start": 1521.52, "Time_End": 1525.52, "Text": " I've also noticed that people like to give out legal advice when they're angry."}, {"Time_Start": 1525.52, "Time_End": 1530.52, "Text": " One of my favorite complaints accused me of being an accessory to accomplish harassment,"}, {"Time_Start": 1530.52, "Time_End": 1531.52, "Text": " which I was informed, was not looked upon favorably."}, {"Time_Start": 1531.52, "Time_End": 1533.52, "Text": " not looked upon favorably in Washington State."}, {"Time_Start": 1533.52, "Time_End": 1535.52, "Text": " Right, I see."}, {"Time_Start": 1535.52, "Time_End": 1538.52, "Text": " Sometimes complaints don't go directly to you."}, {"Time_Start": 1538.52, "Time_End": 1541.52, "Text": " Sometimes people complain to your ISP or your DNS provider."}, {"Time_Start": 1541.52, "Time_End": 1544.52, "Text": " I've become well acquainted with several university officials"}, {"Time_Start": 1544.52, "Time_End": 1546.52, "Text": " as the result of running my emailer."}, {"Time_Start": 1546.52, "Time_End": 1547.52, "Text": " I'm sick."}, {"Time_Start": 1547.52, "Time_End": 1549.52, "Text": " I actually look forward to dealing with them."}, {"Time_Start": 1549.52, "Time_End": 1551.52, "Text": " It means I get to wax poetic on fun things like the Constitution,"}, {"Time_Start": 1551.52, "Time_End": 1554.52, "Text": " the First Amendment, and the school's acceptable use policy."}, {"Time_Start": 1554.52, "Time_End": 1557.52, "Text": " Other email operators don't have it so easy."}, {"Time_Start": 1557.52, "Time_End": 1560.52, "Text": " Their ISPs may terminate their service at will at the first sign of trouble."}, {"Time_Start": 1560.52, "Time_End": 1561.52, "Text": " trouble."}, {"Time_Start": 1561.52, "Time_End": 1565.52, "Text": " System administrators often adamantly against the use of their sites for anonymity servers."}, {"Time_Start": 1565.52, "Time_End": 1569.52, "Text": " They are afraid that they would be held responsible for acts such as terrorism or kidnapping,"}, {"Time_Start": 1569.52, "Time_End": 1574.52, "Text": " which could theoretically take place as a result of anonymous messages which pass through their system."}, {"Time_Start": 1574.52, "Time_End": 1578.52, "Text": " Administrators would often rather shut down a re-mailer than deal with all of the politics that surround that"}, {"Time_Start": 1578.52, "Time_End": 1579.52, "Text": " remailer."}, {"Time_Start": 1579.52, "Time_End": 1583.52, "Text": " This is one of the main reasons for the short lifespans of many re-mellers."}, {"Time_Start": 1583.52, "Time_End": 1587.52, "Text": " One of the simplest solutions to all of this is to run a middleman remailer."}, {"Time_Start": 1587.52, "Time_End": 1589.52, "Text": " In this mode, a remower will not send messages directly to final receipts."}, {"Time_Start": 1589.52, "Time_End": 1591.02, "Text": " directly to final recipients."}, {"Time_Start": 1591.02, "Time_End": 1593.52, "Text": " Instead, it will only send messages to other re-mailers."}, {"Time_Start": 1593.52, "Time_End": 1595.52, "Text": " Because it can never be used as the final hop-in-mitted message,"}, {"Time_Start": 1595.52, "Time_End": 1599.52, "Text": " the outside world never receives any re-mailed messages from the middleman."}, {"Time_Start": 1599.52, "Time_End": 1601.52, "Text": " Wala, no complaints."}, {"Time_Start": 1601.52, "Time_End": 1605.52, "Text": " The obvious drawback to middleman is that they reduce the number of possible chain permutations."}, {"Time_Start": 1605.52, "Time_End": 1609.52, "Text": " As long as there are plenty of full-featured re-mailers around, this doesn't matter much."}, {"Time_Start": 1609.52, "Time_End": 1612.52, "Text": " But if only a handful of re-mellers were mailed to a final recipients,"}, {"Time_Start": 1612.52, "Time_End": 1615.52, "Text": " the situation could escalate rapidly from a robust re-mailer network"}, {"Time_Start": 1615.52, "Time_End": 1618.52, "Text": " to a network with single points of failure."}, {"Time_Start": 1618.52, "Time_End": 1619.52, "Text": " But, having a handful of mailers will mailers,"}, {"Time_Start": 1619.52, "Time_End": 1622.52, "Text": " when middlemen remowers around is better than not having them at all."}, {"Time_Start": 1622.52, "Time_End": 1624.52, "Text": " They provide a useful service."}, {"Time_Start": 1624.52, "Time_End": 1625.52, "Text": " They're one more link in the chain."}, {"Time_Start": 1625.52, "Time_End": 1628.52, "Text": " If you're interested in one of the remower, but you're genuinely concerned about your"}, {"Time_Start": 1628.52, "Time_End": 1632.52, "Text": " ISP's objection, middlemen are great, and I hope you'll consider it."}, {"Time_Start": 1632.52, "Time_End": 1636.52, "Text": " Now, wide speculation of my part suggests to me that a far less benign reason that there are"}, {"Time_Start": 1636.52, "Time_End": 1641.52, "Text": " so few remuners in the world is that lots of people and organizations worldwide would like to see"}, {"Time_Start": 1641.52, "Time_End": 1645.52, "Text": " the demise of the anonymous remower network and are actively working toward that goal."}, {"Time_Start": 1645.52, "Time_End": 1649.5, "Text": " Governments that violate human rights, as well as organizations banning public and"}, {"Time_Start": 1649.52, "Time_End": 1653.6, "Text": " and open discussion of their activities, such as the Church of Scientology, are among these."}, {"Time_Start": 1654.1399999999999, "Time_End": 1658.72, "Text": " The Church of Scientology frequently threatens anonymous and anonymity providers with lawsuits"}, {"Time_Start": 1658.72, "Time_End": 1661.22, "Text": " unless they curtail or terminate their services."}, {"Time_Start": 1661.92, "Time_End": 1664.16, "Text": " They've been doing this for years, and they're still doing it."}, {"Time_Start": 1664.56, "Time_End": 1667.0, "Text": " I received a nastygram from one other lawyers just last month."}, {"Time_Start": 1668.34, "Time_End": 1671.66, "Text": " Obviously, though, governments may also have a keen interest in anonymous renaler usage."}, {"Time_Start": 1672.2, "Time_End": 1676.76, "Text": " Rurals are in operation all over the world, and governmental attitudes toward them cover the whole spectrum."}, {"Time_Start": 1677.58, "Time_End": 1679.42, "Text": " For example, a Viena operator,"}, {"Time_Start": 1679.52, "Time_End": 1682.52, "Text": " recently pointed me to a web page maintained by his local police department."}, {"Time_Start": 1683.28, "Time_End": 1688.74, "Text": " The Australian police actually recommend that citizens use re-mellers to post-to-use net as a method of privacy protection."}, {"Time_Start": 1689.96, "Time_End": 1696.1, "Text": " In stark contrast, the operator of T2, a remower in the UK, announced that he would be closing down his remaler this coming Monday"}, {"Time_Start": 1696.1, "Time_End": 1701.24, "Text": " because passage of the regulation of investigatory powers or whip bill appears imminent."}, {"Time_Start": 1702.58, "Time_End": 1709.5, "Text": " Feared by fears of rampant anarchy, pornography, pornography, and digital black markets, the UK has pressed ahead with measures of intrusion"}, {"Time_Start": 1709.52, "Time_End": 1712.3, "Text": " into internet, into the internet, far more suited to China."}, {"Time_Start": 1713.36, "Time_End": 1719.28, "Text": " The WIP bill will connect UK ISPs directly to MI5 headquarters by where of black boxes"}, {"Time_Start": 1719.28, "Time_End": 1725.04, "Text": " authorized to snoop, often without warrant, on email, or other British domestic internet activities."}, {"Time_Start": 1726.08, "Time_End": 1730.1399999999999, "Text": " You might think the obvious character to this is to call the Brits and tell them to use more encryption."}, {"Time_Start": 1730.76, "Time_End": 1736.12, "Text": " Snoopers be damned. You'd be wrong. The bill also contains a requirement that computer users and"}, {"Time_Start": 1736.12, "Time_End": 1739.5, "Text": " companies hand over their decryption keys to the government on demand, of"}, {"Time_Start": 1739.52, "Time_End": 1741.96, "Text": " anyone as low as a constable."}, {"Time_Start": 1741.96, "Time_End": 1746.28, "Text": " Moreover, the WIPBOR permits gagwaters surrounding these key requests with possible jail time"}, {"Time_Start": 1746.28, "Time_End": 1749.7, "Text": " for anyone revealing key requests and fulfillments."}, {"Time_Start": 1749.7, "Time_End": 1753.8799999999999, "Text": " WIPBers and their ilk should encourage those of us outside Oilwells, Ingram, to use encryption"}, {"Time_Start": 1753.8799999999999, "Time_End": 1756.34, "Text": " and to run more remowers."}, {"Time_Start": 1756.34, "Time_End": 1761.54, "Text": " I asked the U.K. Remeller for his thoughts on closing down T2, and this is what he had to say."}, {"Time_Start": 1761.54, "Time_End": 1768.24, "Text": " I see myself at the moment as in a situation as in a similar position to Yolf in 1996, faced with a choice"}, {"Time_Start": 1768.24, "Time_End": 1772.86, "Text": " between continuing with an untrustworthy service or making an honest shutdown, it is fairly"}, {"Time_Start": 1772.86, "Time_End": 1777.78, "Text": " easy to see what is preferable. If I continued with the current config, people will rightly have"}, {"Time_Start": 1777.78, "Time_End": 1782.56, "Text": " suspicions that the key had leaked to any of the endless list of government bodies of any kind"}, {"Time_Start": 1782.56, "Time_End": 1786.72, "Text": " who are supposed to be able to demand decryption and also keys in an ill-defined circumstance."}, {"Time_Start": 1787.6200000000001, "Time_End": 1791.78, "Text": " Contrary to what government spokesmen have said, neither a court order nor criminal investigation"}, {"Time_Start": 1791.78, "Time_End": 1797.0, "Text": " into anything, nor suspicion of a crime by a person receiving the demand, is required before the demand"}, {"Time_Start": 1797.0, "Time_End": 1797.44, "Text": " is made."}, {"Time_Start": 1798.24, "Time_End": 1802.48, "Text": " It has been pointed out often that the mechanics of public keys mean that innocent people,"}, {"Time_Start": 1802.48, "Time_End": 1806.1200000000001, "Text": " receiving messages from a suspect, would be more likely to have notices served on them than"}, {"Time_Start": 1806.1200000000001, "Time_End": 1807.0, "Text": " a suspect himself."}, {"Time_Start": 1807.0, "Time_End": 1812.74, "Text": " Thankfully, our own government has not yet succeeded in passing a similar bill."}, {"Time_Start": 1812.74, "Time_End": 1817.56, "Text": " Additionally, we have a bill of rights which the UK does not have, and a healthy body of history"}, {"Time_Start": 1817.56, "Time_End": 1820.36, "Text": " and case law supporting the right to anonymity."}, {"Time_Start": 1820.36, "Time_End": 1826.76, "Text": " An anonymous discourse has been an integral part of American literary and social development."}, {"Time_Start": 1826.76, "Time_End": 1828.22, "Text": " The responsibility of journalists, not"}, {"Time_Start": 1828.24, "Time_End": 1830.6, "Text": " to reveal their sources is recognized almost universally."}, {"Time_Start": 1831.3, "Time_End": 1834.68, "Text": " Many authors write in the pen names, and there are still many cases where the true identity"}, {"Time_Start": 1834.68, "Time_End": 1836.68, "Text": " of such authors has yet to be discovered."}, {"Time_Start": 1837.28, "Time_End": 1841.16, "Text": " Additionally, anonymous peer reviews of proposals and articles are common in academic circles."}, {"Time_Start": 1842.48, "Time_End": 1846.98, "Text": " The intertwining of anonymous rhetoric and American social development is perhaps best evidenced"}, {"Time_Start": 1846.98, "Time_End": 1850.82, "Text": " by the Federalist papers, arguing the greatest single work of political theory in history."}, {"Time_Start": 1851.58, "Time_End": 1855.28, "Text": " The work may never have seen the light of day had authors James Madison and Alexander Hamilton,"}, {"Time_Start": 1855.72, "Time_End": 1857.8, "Text": " collectively known pseudonymonymously as Publius,"}, {"Time_Start": 1858.24, "Time_End": 1860.74, "Text": " been forced to reveal their true identities."}, {"Time_Start": 1861.7, "Time_End": 1864.88, "Text": " Moreover, the Supreme Court has repeatedly confirmed the right to anonymity."}, {"Time_Start": 1865.42, "Time_End": 1869.02, "Text": " Nevertheless, this has not stopped the U.S. government from trying to deprive us of our rights."}, {"Time_Start": 1870.4, "Time_End": 1875.98, "Text": " At the carnival hearings a couple days ago, FBI lab director Donald Kerr pulled out the usual FUD"}, {"Time_Start": 1875.98, "Time_End": 1879.0, "Text": " with much speculation and little or no supporting evidence."}, {"Time_Start": 1879.56, "Time_End": 1883.46, "Text": " He said, as you know, the use of computers and the Internet has grown rapidly"}, {"Time_Start": 1883.46, "Time_End": 1888.22, "Text": " and has been paralleled by the exploitation of computers, networks, and databases to commit crimes,"}, {"Time_Start": 1888.24, "Time_End": 1890.94, "Text": " and to harm the safety, security, and privacy of others."}, {"Time_Start": 1891.54, "Time_End": 1895.92, "Text": " Criminals use computers to send child pornography to each other, using anonymous encrypted communications."}, {"Time_Start": 1896.74, "Time_End": 1901.6, "Text": " Hackers break into financial service company systems and steal customers' home addresses and credit card members."}, {"Time_Start": 1902.2, "Time_End": 1908.04, "Text": " Criminals use the Internet's inexpensive and easy communications to commit large-scale fraud on victims all over the world."}, {"Time_Start": 1908.44, "Time_End": 1912.48, "Text": " And, of course, you know, terrorist bombers plan their strikes using the Internet."}, {"Time_Start": 1913.92, "Time_End": 1916.26, "Text": " Investigating, and I'm not making this up."}, {"Time_Start": 1918.24, "Time_End": 1924.52, "Text": " and deterring such wrongdoing requires tools and techniques designed to work with new and evolving computer network technologies."}, {"Time_Start": 1925.32, "Time_End": 1932.6, "Text": " He continued to blather about striking balances between privacy interests, ISP interests, and of course the duty of government investigators to protect public safety."}, {"Time_Start": 1933.3, "Time_End": 1941.14, "Text": " My favorite line, though, for this testimony was, quote, I would like to discuss how the FBI is meeting this challenge in the area of electronic male interception."}, {"Time_Start": 1941.7, "Time_End": 1947.78, "Text": " Quote, a friend of mine pointed out yesterday that you know you've tweaked the FBI when they drag out child proographers,"}, {"Time_Start": 1947.78, "Time_End": 1950.08, "Text": " terrorist bombers, hackers, and the usual suspects."}, {"Time_Start": 1951.22, "Time_End": 1955.96, "Text": " I think the whole carnivore situation really underscores why we need more remowers and why we need more people"}, {"Time_Start": 1955.96, "Time_End": 1960.92, "Text": " out there using them, for the complementary tear-jerk purposes that lend credibility to anonymity"}, {"Time_Start": 1960.92, "Time_End": 1964.5, "Text": " and counter-government assertions that only criminals have a need to hide their identities."}, {"Time_Start": 1965.34, "Time_End": 1969.6399999999999, "Text": " It's important to show them that for every imaginary bomb-toting money-wondering child pornographer,"}, {"Time_Start": 1970.1, "Time_End": 1976.08, "Text": " there are 100 HIV-positive teens, abused women, or political dissidents out there looking for a way to communicate safely."}, {"Time_Start": 1976.6399999999999, "Time_End": 1977.76, "Text": " It's time the deck was stacked in our phone."}, {"Time_Start": 1977.78, "Time_End": 1983.22, "Text": " favor. A couple months ago, the president's key, the president's working group on unlawful"}, {"Time_Start": 1983.22, "Time_End": 1990.3799999999999, "Text": " contact on the internet, chaired by Janet Reno, issued a 200K report which predictably expressed"}, {"Time_Start": 1990.3799999999999, "Time_End": 1994.58, "Text": " the need for government ability to determine, quote, the source of anonymous emails that contain"}, {"Time_Start": 1994.58, "Time_End": 2001.12, "Text": " bomb threats, quote. The interagency group was formed in August of 1999 by the president and"}, {"Time_Start": 2001.12, "Time_End": 2006.94, "Text": " includes such neutries as FBI director, Louis Free, Treasury Secretary Larry Summers, Commerce Secretary"}, {"Time_Start": 2006.94, "Time_End": 2010.78, "Text": " Warren Dowie and representatives from the military DEA and Secret Service."}, {"Time_Start": 2011.92, "Time_End": 2015.76, "Text": " The group is asked to address the issue of unlawful conduct involving the use of the internet"}, {"Time_Start": 2015.76, "Time_End": 2020.3600000000001, "Text": " and to prepare a report with recommendations on the extent to which existing federal laws,"}, {"Time_Start": 2020.5800000000002, "Time_End": 2024.72, "Text": " this is a quote, provide a sufficient basis for effective investigation and prosecution of"}, {"Time_Start": 2024.72, "Time_End": 2028.5800000000002, "Text": " unlawful conduct that involves the use of the internet, such as the illegal sale of guns,"}, {"Time_Start": 2028.72, "Time_End": 2032.9, "Text": " explosive controlled substances, and prescription drugs, as well as fraud and, of course, child pornography."}, {"Time_Start": 2034.1000000000001, "Time_End": 2036.92, "Text": " The report stated that anonymous rumors can be used to protect the"}, {"Time_Start": 2036.94, "Time_End": 2040.66, "Text": " privacy of dissidents in oppressive countries, but can also frustrate police who can't"}, {"Time_Start": 2040.66, "Time_End": 2049.62, "Text": " figure out the message. Da! Of course, most abuses of online anonymity, of online anonymity"}, {"Time_Start": 2049.62, "Time_End": 2053.76, "Text": " can be promulgated through traditional means. Death threats, for instance, can be equally hard"}, {"Time_Start": 2053.76, "Time_End": 2058.76, "Text": " to trace when delivered by phone or mail as when delivered through the internet. Additionally,"}, {"Time_Start": 2058.92, "Time_End": 2062.78, "Text": " people sometimes feel that liberalist material can be distributed anonymously, leaving"}, {"Time_Start": 2062.78, "Time_End": 2066.68, "Text": " them no one to sue. This danger is the flip side of anonymous whistleblowing."}, {"Time_Start": 2066.94, "Time_End": 2070.34, "Text": " which most people would agree is a socially valuable use of anonymity."}, {"Time_Start": 2071.14, "Time_End": 2075.94, "Text": " But such misuses are only as effective as the goability of the recipient allows."}, {"Time_Start": 2076.56, "Time_End": 2080.54, "Text": " All this abhorring should be checked by an authoritative expert before the public believes the charges."}, {"Time_Start": 2081.78, "Time_End": 2085.2200000000003, "Text": " Freedom of expression must be allowed. With this freedom comes on sorts of problems,"}, {"Time_Start": 2085.36, "Time_End": 2087.32, "Text": " but these types of problems are not unique to the Internet."}, {"Time_Start": 2087.92, "Time_End": 2096.52, "Text": " Unpopular speech is a necessary consequence of free speech, and it was decided long ago during the drafting of the Constitution and the Bill of Rights,"}, {"Time_Start": 2096.52, "Time_End": 2099.1, "Text": " that the advantages of free speech outweigh the disadvantages."}, {"Time_Start": 2099.74, "Time_End": 2101.42, "Text": " This principle should hold on the Internet as well."}, {"Time_Start": 2102.16, "Time_End": 2105.66, "Text": " Anonymous rumor should provide a vital service with many benefits to the online community."}, {"Time_Start": 2106.98, "Time_End": 2110.9, "Text": " Penit's downfall was due less to its imperfect security than to its success."}, {"Time_Start": 2111.58, "Time_End": 2112.7, "Text": " Because of the ubiquitous..."}, {"Time_Start": 2112.7, "Time_End": 2114.64, "Text": " Because of the ubiquitous..."}, {"Time_Start": 2114.64, "Time_End": 2115.52, "Text": " Because of the ubiquitous..."}, {"Time_Start": 2126.52, "Time_End": 2130.28, "Text": " to knowing lists and news groups, you've got more than his share of unwanted attention."}, {"Time_Start": 2130.84, "Time_End": 2135.94, "Text": " For example, the London observer, in a rabid scale piece on the imagined scourge of kitty point on the net,"}, {"Time_Start": 2136.18, "Time_End": 2140.22, "Text": " accused him by name as being a, quote, key link in the international pedophile chain."}, {"Time_Start": 2142.36, "Time_End": 2147.4, "Text": " Of course, you know, the investigation turned out none of this was true, but hey, you know, the media printed it."}, {"Time_Start": 2148.28, "Time_End": 2152.28, "Text": " Other critics have simply cited the ease with which anonymous rumors can be used to harass people,"}, {"Time_Start": 2152.6, "Time_End": 2155.96, "Text": " illegally distribute classified information, or spread bootleg graphics or music."}, {"Time_Start": 2156.52, "Time_End": 2163.08, "Text": " True enough, except that these same problems plagued the phone system and the U.S. Postal Service, and there are like, I'm sorry,"}, {"Time_Start": 2164.2599999999998, "Time_End": 2166.38, "Text": " and there haven't been many proposals to shut them down."}, {"Time_Start": 2167.36, "Time_End": 2170.08, "Text": " My final type of the day is where the remodel network is headed."}, {"Time_Start": 2170.7, "Time_End": 2175.44, "Text": " As I said at the top of hour, I've heard numerous times that the need for a free public email network is gone."}, {"Time_Start": 2176.14, "Time_End": 2180.06, "Text": " I have strong personal reasons to disagree with that statement, but hey, let's suppose it's true for a second."}, {"Time_Start": 2180.86, "Time_End": 2181.78, "Text": " Diversity is important."}, {"Time_Start": 2182.3, "Time_End": 2186.04, "Text": " Even if hush mail and freedom and whatnot provide everything the public remarry network does"}, {"Time_Start": 2186.04, "Time_End": 2188.46, "Text": " with all sorts of bells and whistles, so what?"}, {"Time_Start": 2189.1, "Time_End": 2191.48, "Text": " I keep a flashlight next to my bed in case the power goes out."}, {"Time_Start": 2191.94, "Time_End": 2192.96, "Text": " I back up my files."}, {"Time_Start": 2193.46, "Time_End": 2197.2799999999997, "Text": " I'd rather have the Renoir network out there than not need it than need it and not have it."}, {"Time_Start": 2198.0, "Time_End": 2200.9, "Text": " That said, development on the Renoir network is hardly dead."}, {"Time_Start": 2201.44, "Time_End": 2204.08, "Text": " Proposals for Mixmaster version 3 have been floating around for a while."}, {"Time_Start": 2204.58, "Time_End": 2209.94, "Text": " You can grab the most recent Mixmaster tarball via anonymous FTP from Mixmaster.anomizer.com."}, {"Time_Start": 2210.7799999999997, "Time_End": 2215.5, "Text": " Additionally, many of the Renoo operators have their own side projects aimed at improving services"}, {"Time_Start": 2215.5, "Time_End": 2216.94, "Text": " and providing entire runoons."}, {"Time_Start": 2217.56, "Time_End": 2221.4, "Text": " The only threat of the rip, though, has spawned a flow of new interest in modifying re-marrow protocols."}, {"Time_Start": 2222.32, "Time_End": 2227.56, "Text": " The coding project Angel would make use of session keys that could never be accessible to the remower operator."}, {"Time_Start": 2228.64, "Time_End": 2230.74, "Text": " Followed or memory patches may also achieve the same effect."}, {"Time_Start": 2232.26, "Time_End": 2234.06, "Text": " Ryan Fordham's radio clash is in pre-data."}, {"Time_Start": 2234.36, "Time_End": 2238.5, "Text": " It's a distributed communication system aimed at implementing our processes, Who's on First protocol."}, {"Time_Start": 2239.34, "Time_End": 2240.9, "Text": " Who's on First works as follows."}, {"Time_Start": 2241.66, "Time_End": 2245.44, "Text": " When One Node Alice wishes to send a message to Node Bob, Alice connects to Bob,"}, {"Time_Start": 2245.5, "Time_End": 2246.5, "Text": " and sends him a session key."}, {"Time_Start": 2246.5, "Time_End": 2251.5, "Text": " All for the traffic between Alice and Bob is encrypted with the session key, which is used only one time."}, {"Time_Start": 2251.5, "Time_End": 2253.5, "Text": " Highly exchanged session keys?"}, {"Time_Start": 2253.5, "Time_End": 2258.5, "Text": " Each node has a signing key good for, say, two weeks, and a general encryption key good for a much shorter period,"}, {"Time_Start": 2258.5, "Time_End": 2260.5, "Text": " one day, or maybe less."}, {"Time_Start": 2260.5, "Time_End": 2267.5, "Text": " When Alice wants to send a message to or three Bob, she gets Bob's current encryption key and verifies the signature against Bob's current signing key."}, {"Time_Start": 2267.5, "Time_End": 2271.5, "Text": " She then creates a session ID and sessions it with her own signing key,"}, {"Time_Start": 2271.5, "Time_End": 2274.5, "Text": " encrypts it with Bob's public key, and sends it to him."}, {"Time_Start": 2274.5, "Time_End": 2275.5, "Text": " it to him."}, {"Time_Start": 2275.5, "Time_End": 2279.76, "Text": " Bob decrypts the message, verifies the signature, and if all is well, uses the session key and"}, {"Time_Start": 2279.76, "Time_End": 2282.4, "Text": " ID for all further messages in that session."}, {"Time_Start": 2282.4, "Time_End": 2285.44, "Text": " Cession keys are discarded after use."}, {"Time_Start": 2285.44, "Time_End": 2289.48, "Text": " So, if a session key is compromised, only that current session is in danger."}, {"Time_Start": 2289.48, "Time_End": 2293.56, "Text": " If the general key is compromised, all traffic for that day or however long the key is good"}, {"Time_Start": 2293.56, "Time_End": 2294.68, "Text": " for is in danger."}, {"Time_Start": 2294.68, "Time_End": 2299.5, "Text": " Another thing about who's on first is that all traffic is encrypted and to end, meaning that if"}, {"Time_Start": 2299.5, "Time_End": 2303.9, "Text": " a rogue node operator recorded all traffic through his node, he wouldn't know the previous and"}, {"Time_Start": 2303.9, "Time_End": 2304.4, "Text": " next hop."}, {"Time_Start": 2304.5, "Time_End": 2307.7, "Text": " You would know the previous next hop, but nothing more."}, {"Time_Start": 2307.7, "Time_End": 2312.5, "Text": " You wouldn't even know if the previous hop was the first or the next was the final."}, {"Time_Start": 2312.5, "Time_End": 2316.5, "Text": " My favorite pet project, though, is the concept of so-called stealth re-mullers."}, {"Time_Start": 2316.5, "Time_End": 2321.5, "Text": " I admit the million women of itself is part of my attraction to the idea, but the concept's pretty cool too."}, {"Time_Start": 2321.5, "Time_End": 2327.5, "Text": " Style three narrows I've seen use of two scripts which rap Mixmaster."}, {"Time_Start": 2327.5, "Time_End": 2329.5, "Text": " One is for sending and one is for receiving."}, {"Time_Start": 2329.5, "Time_End": 2334.48, "Text": " Essentially, the re-mail works in a specified use night group for messages with subjects like attention"}, {"Time_Start": 2334.5, "Time_End": 2338.5, "Text": " stealth remower Alice. It yanks copies down, processes them in a big batch,"}, {"Time_Start": 2338.5, "Time_End": 2342.5, "Text": " and then sends them off by something like send at nym.aer.net."}, {"Time_Start": 2342.5, "Time_End": 2346.5, "Text": " Stealth remowers are great for operators without a 24-7 connection."}, {"Time_Start": 2346.5, "Time_End": 2350.5, "Text": " Message processing can be done whenever the operator feels like connecting to the network."}, {"Time_Start": 2350.5, "Time_End": 2354.5, "Text": " Because the remower is itself making use of a pseudonym, the operator is effectively"}, {"Time_Start": 2354.5, "Time_End": 2358.5, "Text": " sidestepping complaints and many other headaches which can come with running a standard 24-7 remower."}, {"Time_Start": 2358.5, "Time_End": 2361.5, "Text": " Finally, my little plug on why I run my remower."}, {"Time_Start": 2361.5, "Time_End": 2363.5, "Text": " I've used remowers for a long time."}, {"Time_Start": 2363.5, "Time_End": 2371.5, "Text": " and the general theory behind remower security is that as long as at least one of the re-mellers you use has not been compromised by nefarious types, then you're pretty safe."}, {"Time_Start": 2371.5, "Time_End": 2375.5, "Text": " Trust no one, that's certainly the credo of the remaler network."}, {"Time_Start": 2375.5, "Time_End": 2381.5, "Text": " Anyway, I figured the best way to make sure at least one of the remallers I used was known by the NSA was to run one myself."}, {"Time_Start": 2381.5, "Time_End": 2387.5, "Text": " Of course, you have no reason to suspect I'm not in lead with the NSA."}, {"Time_Start": 2387.5, "Time_End": 2391.5, "Text": " If you're concerned about that, it wouldn't hurt you to open up your own public remaler."}, {"Time_Start": 2391.5, "Time_End": 2392.5, "Text": " There's a substantial amount of window soft."}, {"Time_Start": 2392.5, "Time_End": 2396.5, "Text": " Ange an amount of Windows software out there that makes running in using anonymous remowers painless."}, {"Time_Start": 2396.5, "Time_End": 2398.5, "Text": " I don't know much about it. I don't limit."}, {"Time_Start": 2398.5, "Time_End": 2403.5, "Text": " As I said earlier, you can grab Mixmaster tarball for Mixmaster.anomizer.com."}, {"Time_Start": 2403.5, "Time_End": 2406.5, "Text": " The rest of the Unix remire tools are pretty old and can use some reworking."}, {"Time_Start": 2406.5, "Time_End": 2409.5, "Text": " There aren't many of us remaps and we can use some help."}, {"Time_Start": 2409.5, "Time_End": 2410.5, "Text": " Renowers are neat."}, {"Time_Start": 2410.5, "Time_End": 2413.5, "Text": " They encourage you to examine source code and write scripts."}, {"Time_Start": 2413.5, "Time_End": 2414.5, "Text": " They thwart big brother."}, {"Time_Start": 2414.5, "Time_End": 2416.5, "Text": " They improve your diplomacy skills."}, {"Time_Start": 2416.5, "Time_End": 2420.5, "Text": " I don't know whether or not they get you checks, but hey, run your own and find out."}, {"Time_Start": 2420.5, "Time_End": 2421.5, "Text": " All right, that's all I've got questions."}, {"Time_Start": 2421.5, "Time_End": 2422.5, "Text": " questions."}]}