{"segments": [{"Time_Start": 0.0, "Time_End": 14.32, "Text": " I can actually start my talk now, and again, if I go over here and you can't hear me,"}, {"Time_Start": 14.42, "Time_End": 15.540000000000001, "Text": " just wave your hands at me and let me know."}, {"Time_Start": 16.28, "Time_End": 20.56, "Text": " My name is Jeff Thompson, otherwise known as Mithrander, for some of the people here who are my friends and know me."}, {"Time_Start": 21.06, "Time_End": 26.080000000000002, "Text": " I'm a director at a company called Argus Systems Group, and I have a title, which is called"}, {"Time_Start": 26.080000000000002, "Time_End": 29.98, "Text": " Suffer Evangelist and Visionary, which essentially means that I get to stand in front of people."}, {"Time_Start": 30.0, "Time_End": 33.2, "Text": " people like you, jump up and down, weigh my arms, pretend like I know what I'm talking about."}, {"Time_Start": 33.9, "Time_End": 35.980000000000004, "Text": " Every once in a while I do, most of the time, probably not."}, {"Time_Start": 36.6, "Time_End": 42.14, "Text": " I'm going to be giving a presentation on how to hack B1 trusted operating systems."}, {"Time_Start": 42.74, "Time_End": 45.7, "Text": " And hopefully this will be fun for me and also fun for all of you."}, {"Time_Start": 46.24, "Time_End": 50.82, "Text": " I'm going to be using the pitpole.compack trust operating system product suite, and that's a big sentence,"}, {"Time_Start": 51.379999999999995, "Time_End": 56.04, "Text": " which is essentially our company's trusted operating system product as a reference for giving this talk."}, {"Time_Start": 56.400000000000006, "Time_End": 59.760000000000005, "Text": " However, all the things that I will be talking about should be pretty easily translatable."}, {"Time_Start": 60.0, "Time_End": 62.04, "Text": " to other trusted operating systems."}, {"Time_Start": 62.14, "Time_End": 68.14, "Text": " I'm trying to leave it fairly general so all you guys can break into trusted Solaris or Virtual Vault"}, {"Time_Start": 68.14, "Time_End": 70.12, "Text": " or some of the other fun little OSs out there."}, {"Time_Start": 71.76, "Time_End": 74.8, "Text": " Just to tell you a little bit about the company, as I mentioned, it's Argus Systems Group,"}, {"Time_Start": 75.0, "Time_End": 78.46000000000001, "Text": " and we build B1, commercial-grade B-1 trusted operating systems."}, {"Time_Start": 78.6, "Time_End": 81.4, "Text": " All the work that we do is at the OS level and the kernel level."}, {"Time_Start": 81.5, "Time_End": 83.34, "Text": " We really don't do much at the application level."}, {"Time_Start": 83.68, "Time_End": 88.14, "Text": " We leave that to other people who want to do things like encryption and cessation, fun stuff like that."}, {"Time_Start": 88.82, "Time_End": 89.98, "Text": " So I'm going to ask three questions."}, {"Time_Start": 90.0, "Time_End": 93.2, "Text": " quick questions. We have to have the little interactive part, so I get a little something out of this."}, {"Time_Start": 93.3, "Time_End": 98.3, "Text": " First of all, I'm wondering, like, if you could raise your hands, if you've ever heard of trusted operating systems before."}, {"Time_Start": 99.32, "Time_End": 103.32, "Text": " All right, that's pretty sweet. I like that. The next one is kind of the kicker."}, {"Time_Start": 103.44, "Time_End": 106.7, "Text": " How many people have actually used a trusted operating system? Been on a box,"}, {"Time_Start": 106.96000000000001, "Time_End": 113.12, "Text": " tried to hack one, say, this week, or, you know, just kind of a system administrator or whatever."}, {"Time_Start": 115.26, "Time_End": 119.64, "Text": " All right, so not quite as many. You guys need to change that, and I'll tell you how at the end of the speech."}, {"Time_Start": 120.0, "Time_End": 124.7, "Text": " The next thing is I'm wondering how many people are here who are actually trying to break the box that I brought in."}, {"Time_Start": 124.84, "Time_End": 129.9, "Text": " It's a little, actually, an IBM think pad running pit bull slers on there."}, {"Time_Start": 131.42, "Time_End": 132.02, "Text": " One guy?"}, {"Time_Start": 133.86, "Time_End": 135.4, "Text": " All right. Well, you'll learn something."}, {"Time_Start": 138.76, "Time_End": 148.04, "Text": " Basically, I should just mention that real quick. What we did is we brought in a pit bull box for the Capture of Flag Competition, and we opened up a web server, put a cheap little messaging board system out,"}, {"Time_Start": 148.04, "Time_End": 149.06, "Text": " hoping someone could hack that."}, {"Time_Start": 150.0, "Time_End": 153.34, "Text": " S-S-H-D, Telmet, IMAP, POP, send mail."}, {"Time_Start": 154.34, "Time_End": 156.0, "Text": " And I think that's it."}, {"Time_Start": 156.1, "Time_End": 158.7, "Text": " And today I just gave away Etsy Shadow with all the passwords in it, too,"}, {"Time_Start": 158.78, "Time_End": 160.02, "Text": " so people should be able to crack those."}, {"Time_Start": 160.56, "Time_End": 163.78, "Text": " And the point is really just to kind of demonstrate that you can give"}, {"Time_Start": 163.78, "Time_End": 166.38, "Text": " what would appear to be the house away, a trusted operating system."}, {"Time_Start": 167.18, "Time_End": 170.98, "Text": " And if you configure it correctly, there's nothing that people can do to break into it"}, {"Time_Start": 170.98, "Time_End": 172.5, "Text": " because of the mechanisms that it provides."}, {"Time_Start": 173.28, "Time_End": 175.72, "Text": " So my speech is going to be composed of two parts."}, {"Time_Start": 175.9, "Time_End": 178.5, "Text": " The first part I had actually hoped to do during a newbie session,"}, {"Time_Start": 178.5, "Time_End": 179.98, "Text": " but for whatever reason, I didn't get that."}, {"Time_Start": 180.0, "Time_End": 184.22, "Text": " So I'm going to have to kind of roll it into here just to give some background on trusted operating systems."}, {"Time_Start": 184.3, "Time_End": 188.6, "Text": " I'll try and wing through it fairly quickly and not go into too much detail, but just enough"}, {"Time_Start": 188.6, "Time_End": 192.28, "Text": " so you guys can understand what I'm talking about in the second part, which is, of course,"}, {"Time_Start": 192.38, "Time_End": 193.94, "Text": " methodologies for hacking trusted OS."}, {"Time_Start": 194.04, "Time_End": 198.98, "Text": " I'm not going to be giving any away any minus 1 or zero-day wares here, so you can't go out and, like, hack all"}, {"Time_Start": 198.98, "Time_End": 201.9, "Text": " the Swiss banks and stuff immediately, at least."}, {"Time_Start": 202.56, "Time_End": 205.3, "Text": " And don't tell them that I taught you how to do this if you go do it."}, {"Time_Start": 206.04, "Time_End": 209.7, "Text": " So the other thing is, of course, an assumption I make because it's the Uber Hatcher,"}, {"Time_Start": 210.0, "Time_End": 215.66, "Text": " everybody's really smart speech, I'm not going to go into actually how to hack boxes and per se"}, {"Time_Start": 215.66, "Time_End": 220.58, "Text": " with the old OS's, but a lot of the tools that you have, a lot of the methodologies that you use"}, {"Time_Start": 220.58, "Time_End": 225.54, "Text": " in old systems apply directly to hacking trusted operating systems, buffer overflows,"}, {"Time_Start": 225.58, "Time_End": 230.02, "Text": " things like that. However, the mindset that you have to approach your attack with is very different,"}, {"Time_Start": 230.28, "Time_End": 233.9, "Text": " and that's going to really be the crux of the speech, is to try and get all of you into that mindset."}, {"Time_Start": 235.46, "Time_End": 239.12, "Text": " So to understand trusted operating systems, there's really four concepts which are worth"}, {"Time_Start": 239.12, "Time_End": 242.74, "Text": " understanding. The first is least privilege or something or something else known as"}, {"Time_Start": 242.74, "Time_End": 246.68, "Text": " capabilities, the POSIX capabilities model, which many of you may be familiar with,"}, {"Time_Start": 247.20000000000002, "Time_End": 252.22, "Text": " an idea of authorizations, mandatory access control, and the idea of putting security"}, {"Time_Start": 252.22, "Time_End": 258.26, "Text": " into the network layer, and by that I mean into the actual data on the network stack that passes"}, {"Time_Start": 258.26, "Time_End": 262.54, "Text": " through the system, as opposed to just at the IP layer, which would be filtering."}, {"Time_Start": 264.04, "Time_End": 267.42, "Text": " For privileges, there's two concepts that you need to understand. The first is least"}, {"Time_Start": 267.42, "Time_End": 270.96000000000004, "Text": " privilege. This has actually been written about quite a bit in a lot of security books"}, {"Time_Start": 270.96000000000004, "Time_End": 274.96000000000004, "Text": " when there's the little three-page chapter on B1 trusted operating systems, and they"}, {"Time_Start": 274.96000000000004, "Time_End": 280.6, "Text": " mention it as a sort of exotic thing. Least privilege is the idea that rather than having, like on"}, {"Time_Start": 280.6, "Time_End": 285.66, "Text": " standard Unix systems where you have UID zero or Root, which has complete access to the system,"}, {"Time_Start": 285.74, "Time_End": 289.98, "Text": " it can override all security on the system, it has access to all system calls. Rather than doing that,"}, {"Time_Start": 290.02000000000004, "Time_End": 294.8, "Text": " you take all the concepts of what Root can do, and you break it up into privileges. So,"}, {"Time_Start": 294.8, "Time_End": 297.40000000000003, "Text": " for example, Root needs to mount a file system. Well, mounting a"}, {"Time_Start": 297.42, "Time_End": 300.66, "Text": " is a concept, it's also a system call. So what you do is you create a privilege"}, {"Time_Start": 300.66, "Time_End": 304.84000000000003, "Text": " which says now that this program or this process can actually mount a file system."}, {"Time_Start": 305.94, "Time_End": 310.42, "Text": " And to give you kind of a real world example of that, you can take a web server, and if you want"}, {"Time_Start": 310.42, "Time_End": 314.76, "Text": " to bind a port 80, you need to run it as root, and then it'll switch to another user. The reason"}, {"Time_Start": 314.76, "Time_End": 317.96000000000004, "Text": " why you need to run it as root is not because it needs to have access to files in the system,"}, {"Time_Start": 318.32, "Time_End": 323.18, "Text": " simply because it needs to bind to Port 80, because it's a privileged port. So on a trusted operating"}, {"Time_Start": 323.18, "Time_End": 327.40000000000003, "Text": " system, instead of setting it as root or giving it total access to the system, you simply give it"}, {"Time_Start": 327.42, "Time_End": 330.58000000000004, "Text": " one privilege, and it can bind to the privilege port, and that's all it needs."}, {"Time_Start": 331.14000000000004, "Time_End": 336.22, "Text": " The next thing to get into is this is a little bit of a, in a coding topic,"}, {"Time_Start": 336.64000000000004, "Time_End": 339.84000000000003, "Text": " is the idea of privilege bracketing, but it also affects you when you're trying to break boxes."}, {"Time_Start": 340.66, "Time_End": 345.8, "Text": " And it's this, is that privilege bracketing is the idea that a processor program only needs to"}, {"Time_Start": 345.8, "Time_End": 349.22, "Text": " turn on its privileges or its abilities when it needs to use them."}, {"Time_Start": 349.68, "Time_End": 351.78000000000003, "Text": " And when it's done using them, it can throw them away."}, {"Time_Start": 352.34000000000003, "Time_End": 355.84000000000003, "Text": " So on standard Unix, you want to throw them away, you become something else besides root."}, {"Time_Start": 355.84000000000003, "Time_End": 357.40000000000003, "Text": " And I trusted operating system, you see,"}, {"Time_Start": 357.42, "Time_End": 361.32, "Text": " simply drop the privilege. And now if somebody goes and breaks that program, it's not there"}, {"Time_Start": 361.32, "Time_End": 367.68, "Text": " anymore, and there's no way for them to get it back. And so now you can limit the exposure in your code"}, {"Time_Start": 367.68, "Time_End": 372.66, "Text": " and also where you're really going to need to focus your reviews of your code, at least your security"}, {"Time_Start": 372.66, "Time_End": 376.02000000000004, "Text": " relevant reviews of your code, where privileges are going to be active. And it allows you start"}, {"Time_Start": 376.02000000000004, "Time_End": 383.08000000000004, "Text": " building much more secure software and spend time where it matters in review. So privileges, traditional"}, {"Time_Start": 383.08000000000004, "Time_End": 386.40000000000003, "Text": " Unix has one privilege. Root. Your root, you have everything. You're not root. You try to get root."}, {"Time_Start": 387.42, "Time_End": 393.68, "Text": " And with that, there's, what we do is we take that idea of root, like I said, and break it up into privileges."}, {"Time_Start": 393.84000000000003, "Time_End": 397.92, "Text": " So now we have things like a file system mounting privilege, DAC read privilege."}, {"Time_Start": 398.04, "Time_End": 401.64000000000004, "Text": " DAC is just another word for permission bits or access control list."}, {"Time_Start": 401.70000000000005, "Time_End": 403.06, "Text": " It's just kind of an encompassing term."}, {"Time_Start": 403.48, "Time_End": 406.84000000000003, "Text": " And then you also create new privileges, which are specific to trust operating systems."}, {"Time_Start": 407.18, "Time_End": 410.44, "Text": " Privileges which allow you to override mandatory access control rules."}, {"Time_Start": 410.88, "Time_End": 414.72, "Text": " Or a great privilege here, and this is kind of a hint, if you can get this on a system."}, {"Time_Start": 415.22, "Time_End": 416.08000000000004, "Text": " PVPV PROC."}, {"Time_Start": 416.08000000000004, "Time_End": 417.40000000000003, "Text": " It's a privilege that gives the price."}, {"Time_Start": 417.42, "Time_End": 421.56, "Text": " process and ability to set privileges on other processes. So if you have that, you just"}, {"Time_Start": 421.56, "Time_End": 424.96000000000004, "Text": " start giving yourself lots of nice privileges, and then you can own the system."}, {"Time_Start": 426.96000000000004, "Time_End": 431.22, "Text": " All right, processes. There's three types of privilege sets that you can have in a process."}, {"Time_Start": 431.72, "Time_End": 434.78000000000003, "Text": " And the first one is one really important to understand. It's the limiting privilege set."}, {"Time_Start": 435.16, "Time_End": 440.1, "Text": " The idea behind the limiting privilege set is that you can specify for a process and all of its children"}, {"Time_Start": 440.1, "Time_End": 445.48, "Text": " that they can never exceed this amount of privilege. So a great thing to do with this is if you"}, {"Time_Start": 445.48, "Time_End": 447.12, "Text": " have users logging onto your system."}, {"Time_Start": 447.42, "Time_End": 449.2, "Text": " who you don't trust, don't ever want to trust,"}, {"Time_Start": 449.48, "Time_End": 451.74, "Text": " you can give them a limiting privilege set, which says no privileges."}, {"Time_Start": 452.40000000000003, "Time_End": 456.52000000000004, "Text": " Now, no matter what that user does, they can run programs that would normally give them privilege,"}, {"Time_Start": 456.92, "Time_End": 458.54, "Text": " they can do those kinds of things."}, {"Time_Start": 459.06, "Time_End": 461.78000000000003, "Text": " And when they run them, the colonel will see that they have this limiting privilege set"}, {"Time_Start": 461.78000000000003, "Time_End": 463.06, "Text": " set and will refuse to give them privileges."}, {"Time_Start": 463.32, "Time_End": 467.44, "Text": " The program may continue to run, but it will run without any kind of special ability on the system"}, {"Time_Start": 467.44, "Time_End": 468.28000000000003, "Text": " or special access."}, {"Time_Start": 469.14, "Time_End": 473.64, "Text": " The maximum privilege set is essentially the set of privileges that a process can use over its lifetime,"}, {"Time_Start": 474.14, "Time_End": 477.40000000000003, "Text": " and the effective privilege set is the set of privileges that the process."}, {"Time_Start": 477.42, "Time_End": 481.68, "Text": " is using at any given moment so it can raise and lower these privileges in its"}, {"Time_Start": 481.68, "Time_End": 485.58000000000004, "Text": " effective set when it doesn't want them anymore it throws them out of its maximum set"}, {"Time_Start": 485.58000000000004, "Time_End": 488.86, "Text": " and when it doesn't want its children to have any privileges anymore it throws it"}, {"Time_Start": 488.86, "Time_End": 495.58000000000004, "Text": " out of its limiting privilege set now files privileges work in a different way"}, {"Time_Start": 495.58000000000004, "Time_End": 500.64, "Text": " on files and particularly they really work on executables in almost all cases what you do"}, {"Time_Start": 500.64, "Time_End": 503.88, "Text": " is you can put three types of privileges on files and there's the sets are innate"}, {"Time_Start": 503.88, "Time_End": 507.40000000000003, "Text": " proxy and authorized anate set of privileges are put on to"}, {"Time_Start": 507.42, "Time_End": 511.08000000000004, "Text": " and executable. And what that means is when that program is run, the privileges in the"}, {"Time_Start": 511.08000000000004, "Time_End": 517.1, "Text": " innate set will be placed into the maximum set of the new program, right? As long as they don't"}, {"Time_Start": 517.1, "Time_End": 522.16, "Text": " exceed the limiting privilege set. So it's always placed against that. Proxy privileges are simply"}, {"Time_Start": 522.16, "Time_End": 528.28, "Text": " the set of privileges that if the process that execs the program runs it, only privileges"}, {"Time_Start": 528.28, "Time_End": 532.74, "Text": " that existed in the process before will be passed on through the proxy privileges. So it's just saying"}, {"Time_Start": 532.74, "Time_End": 536.28, "Text": " these are what allow this program to pick up in addition to the innate set."}, {"Time_Start": 537.42, "Time_End": 543.42, "Text": " Authorized privileges are a set of privileges, which a program only gets if the user has an authorization."}, {"Time_Start": 543.68, "Time_End": 545.5799999999999, "Text": " I'll explain what authorizations mean in just a minute."}, {"Time_Start": 546.76, "Time_End": 548.56, "Text": " So there's lots of privilege stuff."}, {"Time_Start": 549.38, "Time_End": 554.54, "Text": " How privileges move, just very quickly, is if you fork a process, privileges carry across the fork."}, {"Time_Start": 554.8399999999999, "Time_End": 559.26, "Text": " So demons that have privileges and fork will still have privileges on their children."}, {"Time_Start": 559.92, "Time_End": 564.5799999999999, "Text": " However, if you exec, then all of the rules for privilege transference come into place,"}, {"Time_Start": 564.66, "Time_End": 567.36, "Text": " the innate privileges, the proxy privileges, and the authorized privilege sets."}, {"Time_Start": 567.42, "Time_End": 576.04, "Text": " and to give another example of that, and this has a large effect on buffer overflow strategies on these boxes,"}, {"Time_Start": 577.14, "Time_End": 583.4599999999999, "Text": " is because you would lose your privileges when you exec, if somebody buffer overflow is a program that has privilege,"}, {"Time_Start": 583.8399999999999, "Time_End": 585.28, "Text": " and right now, what does everybody do?"}, {"Time_Start": 585.3199999999999, "Time_End": 586.04, "Text": " They use shell code."}, {"Time_Start": 586.16, "Time_End": 587.8399999999999, "Text": " That's most of the assembly code that's available."}, {"Time_Start": 588.36, "Time_End": 592.5799999999999, "Text": " While when you exec a shell, the shell most likely will not have any innate privileges on it,"}, {"Time_Start": 592.8399999999999, "Time_End": 597.18, "Text": " unless the administrator is an idiot, and they won't have any proxy privileges for"}, {"Time_Start": 597.1800000000001, "Time_End": 599.0400000000001, "Text": " most likely for the same reason."}, {"Time_Start": 600.36, "Time_End": 604.8000000000001, "Text": " So what happens is when you do that buffer overflow, the person gets on the system through that process,"}, {"Time_Start": 604.9000000000001, "Time_End": 606.7800000000001, "Text": " but they're not going to have any special access to the system."}, {"Time_Start": 608.94, "Time_End": 611.24, "Text": " Now to kind of go through authorizations."}, {"Time_Start": 612.3000000000001, "Time_End": 618.6600000000001, "Text": " Privileges, as I said, are an attribute that's applied to a process, and it specifies what special rights a process has."}, {"Time_Start": 619.46, "Time_End": 626.94, "Text": " Authorizations are more of a user-level concept, and an authorization simply says that if a user runs this program, they're allowed to."}, {"Time_Start": 627.1800000000001, "Time_End": 628.5400000000001, "Text": " And it's used in a couple ways."}, {"Time_Start": 628.96, "Time_End": 629.7, "Text": " And I'll explain that."}, {"Time_Start": 630.6800000000001, "Time_End": 633.6400000000001, "Text": " One thing that can happen is that a program that's run"}, {"Time_Start": 633.6400000000001, "Time_End": 637.0200000000001, "Text": " can look up the user who's running it because it can look at its own UID."}, {"Time_Start": 637.5000000000001, "Time_End": 641.58, "Text": " And it will say, does the user who's trying to run me have this authorization?"}, {"Time_Start": 641.8800000000001, "Time_End": 646.0200000000001, "Text": " For example, is this user considered a security administrator or a system operator?"}, {"Time_Start": 646.5400000000001, "Time_End": 648.9200000000001, "Text": " And if they're one of those, then I want to let them use me."}, {"Time_Start": 649.1, "Time_End": 651.4200000000001, "Text": " If they're not, then I'll exit and say there's an error."}, {"Time_Start": 651.6800000000001, "Time_End": 654.4200000000001, "Text": " Or I'll only perform a limited set of functionality."}, {"Time_Start": 654.72, "Time_End": 657.1200000000001, "Text": " Or I'll drop my privileges, or I'll never use them."}, {"Time_Start": 657.1800000000001, "Time_End": 662.22, "Text": " And so it allows programs to decide how it should operate based on who runs them as well."}, {"Time_Start": 664.3000000000001, "Time_End": 668.6200000000001, "Text": " Now there's two, actually two sets of authorizations which can be placed onto files,"}, {"Time_Start": 668.7, "Time_End": 671.3800000000001, "Text": " and this violates the rule that I said that this all takes place in user space,"}, {"Time_Start": 671.46, "Time_End": 675.32, "Text": " because these are two, I guess, counter examples of that."}, {"Time_Start": 676.08, "Time_End": 677.72, "Text": " The first is access authorizations."}, {"Time_Start": 678.0200000000001, "Time_End": 682.1, "Text": " You can say on a file that only a security administrator can run this program."}, {"Time_Start": 682.46, "Time_End": 686.94, "Text": " Only a UID who has this authorization is allowed to run this program."}, {"Time_Start": 687.1800000000001, "Time_End": 693.5000000000001, "Text": " And so what happens is when in that program's run, the kernel will look and see if the user who's trying to run it has the correct authorization."}, {"Time_Start": 694.1200000000001, "Time_End": 695.48, "Text": " If he doesn't, he can't run it."}, {"Time_Start": 695.94, "Time_End": 698.44, "Text": " This brings up something else I should mention about processes."}, {"Time_Start": 699.3800000000001, "Time_End": 703.4200000000001, "Text": " Like the limiting privilege set, there's also a limiting authorization set."}, {"Time_Start": 703.94, "Time_End": 711.5200000000001, "Text": " And what this means is you can put onto a process, you can say to that process or really to the kernel about the process,"}, {"Time_Start": 711.84, "Time_End": 713.9000000000001, "Text": " that it can only have a certain set of authorizations."}, {"Time_Start": 714.4000000000001, "Time_End": 716.6200000000001, "Text": " This is one of the things that we did on the box that we put out there."}, {"Time_Start": 717.1800000000001, "Time_End": 720.8000000000001, "Text": " Anything that's coming in through INATD has a limiting authorization set of login,"}, {"Time_Start": 721.0000000000001, "Time_End": 722.9200000000001, "Text": " which means you can log into the system."}, {"Time_Start": 723.2800000000001, "Time_End": 726.1200000000001, "Text": " So you can come in through town light, you can come in through FTP, and you can do those sorts of things."}, {"Time_Start": 726.94, "Time_End": 729.6, "Text": " However, once you're on there, you can't obtain any other authorization."}, {"Time_Start": 729.96, "Time_End": 734.4200000000001, "Text": " So if you change to a new UID who would normally have the security administrator authorization,"}, {"Time_Start": 734.72, "Time_End": 736.4200000000001, "Text": " which would mean you could do lots of bad things in the box,"}, {"Time_Start": 736.84, "Time_End": 739.6400000000001, "Text": " you won't have those authorizations even though you're that user."}, {"Time_Start": 740.6, "Time_End": 742.82, "Text": " And then the last thing is the privilege authorization set."}, {"Time_Start": 742.82, "Time_End": 745.6, "Text": " And this goes back to what I was saying about the authorization privilege set."}, {"Time_Start": 745.6, "Time_End": 746.48, "Text": " Just flip the two words."}, {"Time_Start": 747.1800000000001, "Time_End": 751.44, "Text": " And what this is is a list of authorizations placed on a executable that says,"}, {"Time_Start": 751.7800000000001, "Time_End": 756.72, "Text": " if this executable is run, then it obtains these extra privileges, and so it gets some special abilities."}, {"Time_Start": 760.24, "Time_End": 764.84, "Text": " With authorizations, you create a concept of, and these are really important ones to know when you're going after a box."}, {"Time_Start": 765.4200000000001, "Time_End": 769.22, "Text": " Kind of historically, they're called ISSO, SA, and SO, and there can be other roles."}, {"Time_Start": 769.6400000000001, "Time_End": 776.72, "Text": " Rules are simply a concept that you apply to your users to say that these users should have special abilities on the system."}, {"Time_Start": 777.1800000000001, "Time_End": 778.5400000000001, "Text": " Now, ISO is a security officer."}, {"Time_Start": 778.6400000000001, "Time_End": 780.7800000000001, "Text": " They should be allowed to change security on the system."}, {"Time_Start": 781.22, "Time_End": 783.9200000000001, "Text": " Obviously, this is a very, very trusted account."}, {"Time_Start": 784.6600000000001, "Time_End": 786.6800000000001, "Text": " SA, system administrator can add users."}, {"Time_Start": 786.84, "Time_End": 788.6400000000001, "Text": " SO can reboot the system."}, {"Time_Start": 788.8800000000001, "Time_End": 792.8000000000001, "Text": " But we don't need to give them the root abilities that you have on standard Unix."}, {"Time_Start": 793.0600000000001, "Time_End": 797.9000000000001, "Text": " We just give them the specific authorizations that they require to do the tasks that they need to do."}, {"Time_Start": 798.46, "Time_End": 803.0400000000001, "Text": " And how that works is that you put authorization checks on the administrative programs."}, {"Time_Start": 803.5600000000001, "Time_End": 806.6200000000001, "Text": " And these programs will then check to see if the right person is running them."}, {"Time_Start": 807.1800000000001, "Time_End": 811.0600000000001, "Text": " MAC, mandatory access control."}, {"Time_Start": 811.72, "Time_End": 814.86, "Text": " This is a very boring definition taken from TCSEC glossary."}, {"Time_Start": 815.0200000000001, "Time_End": 820.86, "Text": " T.C.Sec is better known as the Rainbow Series, if any of you have managed to get through all of the books, not just the orange book."}, {"Time_Start": 821.1200000000001, "Time_End": 821.5400000000001, "Text": " Congratulations."}, {"Time_Start": 825.1, "Time_End": 826.08, "Text": " Actually, I just have a question."}, {"Time_Start": 826.1400000000001, "Time_End": 828.0600000000001, "Text": " How many people have a set of rainbow books at home?"}, {"Time_Start": 829.0000000000001, "Time_End": 830.3000000000001, "Text": " Has everybody managed to order them?"}, {"Time_Start": 830.5600000000001, "Time_End": 831.08, "Text": " No? All right."}, {"Time_Start": 831.1400000000001, "Time_End": 834.3800000000001, "Text": " Well, now you want to read about common criteria, which is equally a boring read."}, {"Time_Start": 835.5000000000001, "Time_End": 836.5400000000001, "Text": " But it's good to know about."}, {"Time_Start": 837.1800000000001, "Time_End": 842.5000000000001, "Text": " So mandatory access control is, I guess, from a historical and a government perspective,"}, {"Time_Start": 842.84, "Time_End": 848.0400000000001, "Text": " is the idea of looking at information and saying that this object on a system, this processor, this file,"}, {"Time_Start": 848.58, "Time_End": 850.2, "Text": " is protected at a certain level."}, {"Time_Start": 850.4000000000001, "Time_End": 853.82, "Text": " And we all know this is things like this is a top secret piece of information."}, {"Time_Start": 854.4000000000001, "Time_End": 857.7, "Text": " And then you look at processes or other objects that try to access that information."}, {"Time_Start": 858.1, "Time_End": 860.46, "Text": " And you say, I don't care who that person is."}, {"Time_Start": 860.9200000000001, "Time_End": 862.24, "Text": " It doesn't matter what they're UID is."}, {"Time_Start": 862.5400000000001, "Time_End": 866.72, "Text": " All I care about is that that process has been clear to access this information."}, {"Time_Start": 867.1800000000001, "Time_End": 871.22, "Text": " And what that means is that if somebody is in a Mac level,"}, {"Time_Start": 871.9000000000001, "Time_End": 876.1200000000001, "Text": " that they can change UIDs, and their access through Mac will not change."}, {"Time_Start": 876.3000000000001, "Time_End": 879.74, "Text": " And that's very significant and makes everybody else's job very difficult."}, {"Time_Start": 881.0200000000001, "Time_End": 887.0600000000001, "Text": " What happens with Mac is if you create a file, whatever SL or Mac label is on your process,"}, {"Time_Start": 887.2600000000001, "Time_End": 889.24, "Text": " that's how the file will be protected always."}, {"Time_Start": 889.5600000000001, "Time_End": 891.84, "Text": " There's no way for an owner of a file to change this."}, {"Time_Start": 891.94, "Time_End": 895.0000000000001, "Text": " This is very, very different from discretionary access control."}, {"Time_Start": 895.44, "Time_End": 897.1600000000001, "Text": " Under DAC, if you own the file,"}, {"Time_Start": 897.1800000000001, "Time_End": 898.7800000000001, "Text": " you can change its access controls."}, {"Time_Start": 899.6200000000001, "Time_End": 904.22, "Text": " And the reason why this is useful with Mac is that you can also tie this into the network."}, {"Time_Start": 904.72, "Time_End": 907.5600000000001, "Text": " And you can say, I have an administrator who's connecting to my system."}, {"Time_Start": 907.6400000000001, "Time_End": 908.58, "Text": " He has a username password."}, {"Time_Start": 908.8800000000001, "Time_End": 909.44, "Text": " He's really smart."}, {"Time_Start": 909.5200000000001, "Time_End": 910.36, "Text": " He comes through SSH."}, {"Time_Start": 910.5600000000001, "Time_End": 915.5400000000001, "Text": " But because we're using SSH, we may let other people SSH in from the Internet"}, {"Time_Start": 915.5400000000001, "Time_End": 917.2, "Text": " because we have regular users on our system."}, {"Time_Start": 917.2, "Time_End": 923.1600000000001, "Text": " But we also have this ISSO or security administrator who comes in from internally."}, {"Time_Start": 923.5600000000001, "Time_End": 926.72, "Text": " What you can do is actually apply Mac labels, as I said, to the network layer,"}, {"Time_Start": 926.72, "Time_End": 930.24, "Text": " and say, this administrator coming in internally has one type of access."}, {"Time_Start": 930.34, "Time_End": 932.7, "Text": " Well, full access, because we trust people who come in from inside."}, {"Time_Start": 933.12, "Time_End": 935.5400000000001, "Text": " Unless they're corporate insiders, and we have a whole different set of problems."}, {"Time_Start": 936.48, "Time_End": 940.08, "Text": " But somebody who just grabs this guy's password and comes in from the public internet,"}, {"Time_Start": 940.22, "Time_End": 941.5600000000001, "Text": " we don't want him to have the same access."}, {"Time_Start": 941.96, "Time_End": 943.8000000000001, "Text": " Under standard Unix, he does."}, {"Time_Start": 944.2, "Time_End": 947.72, "Text": " If you're root from the inside, from the outside, from a VPN, you're root."}, {"Time_Start": 947.8000000000001, "Time_End": 948.4, "Text": " It doesn't matter."}, {"Time_Start": 949.34, "Time_End": 950.64, "Text": " Using Mac, you can change that."}, {"Time_Start": 950.7, "Time_End": 952.82, "Text": " And I'll explain what those mechanisms are."}, {"Time_Start": 952.82, "Time_End": 956.0, "Text": " And again, those will directly affect an attack onto a system."}, {"Time_Start": 956.72, "Time_End": 962.9200000000001, "Text": " And kind of a corollary to something else that occurs is that the owner of a file cannot give access to his file to somebody else."}, {"Time_Start": 963.0600000000001, "Time_End": 969.4, "Text": " He can through DAC, but if he copies it through Mac, the file will be at least as well protected as it was when it was the original file."}, {"Time_Start": 969.72, "Time_End": 972.58, "Text": " So only people who are cleared for a file can ever see a file."}, {"Time_Start": 974.48, "Time_End": 978.1600000000001, "Text": " To briefly go through what an SL is, SL stands for sensitivity label."}, {"Time_Start": 978.58, "Time_End": 986.44, "Text": " This is the kind of the security object that's used to decide access under mandatory access control in a model that is called the Bell Lapagula model."}, {"Time_Start": 986.72, "Time_End": 988.6, "Text": " There's two components."}, {"Time_Start": 988.74, "Time_End": 992.52, "Text": " There's a classification, which is things like you know of probably as unclassified, classified, classified,"}, {"Time_Start": 992.52, "Time_End": 993.1, "Text": " top secret."}, {"Time_Start": 993.62, "Time_End": 995.32, "Text": " And then there's compartments where categories."}, {"Time_Start": 995.98, "Time_End": 999.62, "Text": " And they're the same thing, but depending on where you work or where you live, they might be called one or the other."}, {"Time_Start": 1000.0400000000001, "Time_End": 1003.9, "Text": " These are kind of like groupings, where you might say I have a financial compartment that's being protected,"}, {"Time_Start": 1004.22, "Time_End": 1006.72, "Text": " or a cryptography department if you're working for the NSA."}, {"Time_Start": 1007.2, "Time_End": 1010.34, "Text": " Or very exciting names like Project A, Project B, and Project C."}, {"Time_Start": 1010.96, "Time_End": 1015.32, "Text": " And SLs are written out with the classification first, followed by a set of compartments."}, {"Time_Start": 1016.72, "Time_End": 1023.72, "Text": " Now, how the different pieces relate to each other, the classifications are, as I said,"}, {"Time_Start": 1023.78, "Time_End": 1027.58, "Text": " in a hierarchical relationship so that they can be equal to greater than or less than each other."}, {"Time_Start": 1027.88, "Time_End": 1031.56, "Text": " So top secret is greater than secret is greater than confidential is greater than unclassified."}, {"Time_Start": 1032.4, "Time_End": 1033.32, "Text": " Compartments work differently."}, {"Time_Start": 1033.46, "Time_End": 1034.7, "Text": " They're actually placed into sets."}, {"Time_Start": 1035.0, "Time_End": 1036.64, "Text": " So you have basic set relationships."}, {"Time_Start": 1036.84, "Time_End": 1040.5, "Text": " They can be subsets, supersets, disjoint, or equal to each other."}, {"Time_Start": 1041.94, "Time_End": 1043.46, "Text": " And that's just basic set theory."}, {"Time_Start": 1043.46, "Time_End": 1046.48, "Text": " Now, a word you're going to hear a lot if you start to play around,"}, {"Time_Start": 1046.72, "Time_End": 1050.3, "Text": " access control is a concept of dominance, of label dominance."}, {"Time_Start": 1050.7, "Time_End": 1056.2, "Text": " And in order for a label to dominate another label, there's two criteria that have to be met."}, {"Time_Start": 1056.58, "Time_End": 1061.28, "Text": " The first is that the label that's trying to dominate the other label, label one, dominating label two,"}, {"Time_Start": 1061.54, "Time_End": 1064.54, "Text": " its classification has to be equal to or greater, which makes sense."}, {"Time_Start": 1064.94, "Time_End": 1069.22, "Text": " In order for somebody to access a piece of information, that's secret, they need to be secret or top secret."}, {"Time_Start": 1069.66, "Time_End": 1072.26, "Text": " You probably wouldn't let an unclassified guy come in and read that."}, {"Time_Start": 1072.8, "Time_End": 1076.66, "Text": " The next piece is that the compartment set has to be equal to or a super set."}, {"Time_Start": 1076.72, "Time_End": 1077.8600000000001, "Text": " of the other compartment set."}, {"Time_Start": 1080.8600000000001, "Time_End": 1086.6200000000001, "Text": " On trusted operating systems, essentially, typically every object on a system has an SL and is protected"}, {"Time_Start": 1086.6200000000001, "Time_End": 1087.02, "Text": " by MAC."}, {"Time_Start": 1087.22, "Time_End": 1089.44, "Text": " It's not always necessarily true, but typically it is."}, {"Time_Start": 1090.2, "Time_End": 1095.1000000000001, "Text": " But most importantly, processes and files will always have SLs, where you're not going to have"}, {"Time_Start": 1095.1000000000001, "Time_End": 1096.1000000000001, "Text": " a very good MAC system."}, {"Time_Start": 1097.16, "Time_End": 1101.24, "Text": " And again, as I mentioned, whenever processes create files, the labels will be placed in the files,"}, {"Time_Start": 1101.34, "Time_End": 1105.68, "Text": " and when processes create new processes, the labels will transfer to the new processes."}, {"Time_Start": 1106.72, "Time_End": 1110.06, "Text": " So what happens is when a system boots up, it's going to have to create the ENIT process,"}, {"Time_Start": 1110.2, "Time_End": 1114.3600000000001, "Text": " process one, and it's going to put a default SL onto that process."}, {"Time_Start": 1114.88, "Time_End": 1120.16, "Text": " And so now when ANIT spawns off all of its children, all of those processes will have the same MAC label."}, {"Time_Start": 1120.3, "Time_End": 1124.48, "Text": " Well, that's not very useful because now everybody's at the same level, and it's not really providing too much protection."}, {"Time_Start": 1124.98, "Time_End": 1131.72, "Text": " So what we do is we put privileges on processes or programs are going to run, like login or SSHD."}, {"Time_Start": 1132.26, "Time_End": 1136.7, "Text": " And what we do is we give those programs the ability to change."}, {"Time_Start": 1136.72, "Time_End": 1141.42, "Text": " their own SLs. So now when somebody logs onto the system like I do, it goes and says, hey, that's Jeff,"}, {"Time_Start": 1141.5, "Time_End": 1145.04, "Text": " you know, I'll give him, you know, top secret all access to the system. He can do whatever he wants"}, {"Time_Start": 1145.04, "Time_End": 1149.56, "Text": " to to to me. But when someone else comes in, they can get a different level. And that allows you to put"}, {"Time_Start": 1149.56, "Time_End": 1154.0, "Text": " people at different levels in a system and isolate them from each other. And I'll explain how that"}, {"Time_Start": 1154.0, "Time_End": 1160.44, "Text": " isolation works. This is how mandatory access control works in the Bellapagelin model. In order for"}, {"Time_Start": 1160.44, "Time_End": 1166.5, "Text": " a process to read a file, process has to have an SL that dominates"}, {"Time_Start": 1166.72, "Time_End": 1173.08, "Text": " the SL of the file to read. In order to write to a file, a process has to be equal to the"}, {"Time_Start": 1173.08, "Time_End": 1179.18, "Text": " cell, not dominate equal to it. And now, I'll give you an example of how this applies. If you have"}, {"Time_Start": 1179.18, "Time_End": 1183.26, "Text": " a system and you place every file in the system at implementation low, which is the lowest SL you can have"}, {"Time_Start": 1183.26, "Time_End": 1189.64, "Text": " on a system, that means every SL dominates it and thus has read access to it. But then you go and you put on"}, {"Time_Start": 1189.64, "Time_End": 1193.94, "Text": " login, you say every user that logs into the system, place them at confidential. Well, now every user"}, {"Time_Start": 1193.94, "Time_End": 1196.7, "Text": " who comes on a system has read access, but they don't have right."}, {"Time_Start": 1196.72, "Time_End": 1201.32, "Text": " access to any files on the system, no matter what user ID they become, no matter what"}, {"Time_Start": 1201.32, "Time_End": 1209.04, "Text": " they do on the system, they only have read access to the system. Processes have two other"}, {"Time_Start": 1209.04, "Time_End": 1213.96, "Text": " SLs applied to them. This concept of minimum and maximum clearance. And what this means is simply"}, {"Time_Start": 1213.96, "Time_End": 1220.48, "Text": " that the process is effective SL can go between these two ranges. And in fact, the only"}, {"Time_Start": 1220.48, "Time_End": 1225.84, "Text": " way for a process to change its effective SL is if it has privileges or it has access to an"}, {"Time_Start": 1225.84, "Time_End": 1229.4399999999998, "Text": " administrative program that will allow it to change that. Typically, you don't give people"}, {"Time_Start": 1229.4399999999998, "Time_End": 1234.3, "Text": " the ability to do this because you want to lock them in at a specific SL so that they can't"}, {"Time_Start": 1234.3, "Time_End": 1239.4599999999998, "Text": " get out and change other pieces of the system. And secondarily, directories and devices have"}, {"Time_Start": 1239.4599999999998, "Time_End": 1243.9599999999998, "Text": " a second SL, which is called a maximum SL. So they'll actually have a minimum on a maximum."}, {"Time_Start": 1244.6, "Time_End": 1248.84, "Text": " Files are single level containers. So they have one SL. That's the ESL that they're protected at."}, {"Time_Start": 1249.1799999999998, "Time_End": 1252.22, "Text": " Directors can have lots of files in them. These files can be at different levels."}, {"Time_Start": 1252.22, "Time_End": 1256.72, "Text": " implementation low, top secret all. So you might put a range on a directory to allow"}, {"Time_Start": 1256.72, "Time_End": 1261.22, "Text": " people to put more types of information in there. And devices are the same way. Some devices"}, {"Time_Start": 1261.22, "Time_End": 1264.8, "Text": " you may want to allow many people to connect to you, other devices you only want one person"}, {"Time_Start": 1264.8, "Time_End": 1272.1000000000001, "Text": " to connect to you, like DevKMM. Now just to show here, this is the kind of a logging example."}, {"Time_Start": 1272.1000000000001, "Time_End": 1275.78, "Text": " What will happen on most trusted operating systems is that you'll have database which will store"}, {"Time_Start": 1275.78, "Time_End": 1280.18, "Text": " security information, like a clearance file, which will store minimum maximum clearance,"}, {"Time_Start": 1280.18, "Time_End": 1282.2, "Text": " and then a default clearance that's, or a default clearance."}, {"Time_Start": 1282.22, "Time_End": 1283.52, "Text": " that someone would log in at."}, {"Time_Start": 1284.04, "Time_End": 1288.0, "Text": " And under Pitbull, it's stored an Etsy Security Clear and other other trusted operating systems."}, {"Time_Start": 1288.1200000000001, "Time_End": 1288.56, "Text": " It's elsewhere."}, {"Time_Start": 1289.54, "Time_End": 1297.56, "Text": " Also, log in and some other programs may give the ability to a user to decide a session level that they would like to connect to the system at."}, {"Time_Start": 1297.82, "Time_End": 1302.26, "Text": " So here we say, set my effective SL to other SLAB, and it can request that."}, {"Time_Start": 1302.56, "Time_End": 1306.46, "Text": " If you want somebody to always and only log in at one SL, you make their minimum, their maximum,"}, {"Time_Start": 1306.46, "Time_End": 1308.66, "Text": " and their default the same, and they're locked into this compartment."}, {"Time_Start": 1309.94, "Time_End": 1310.18, "Text": " All right."}, {"Time_Start": 1310.66, "Time_End": 1312.2, "Text": " This is the last bit on the trusted operating."}, {"Time_Start": 1312.22, "Time_End": 1313.88, "Text": " system part and we get to the interesting bits."}, {"Time_Start": 1314.88, "Time_End": 1319.78, "Text": " This is very important because it's significantly different than any of the other mechanisms on standard Unix."}, {"Time_Start": 1319.84, "Time_End": 1326.06, "Text": " And it's the idea of putting access control information in the network layer, not just at the IP layer,"}, {"Time_Start": 1326.1200000000001, "Time_End": 1330.9, "Text": " but all the way down through under Solaris it would be streams for wherever your data flow model is on the OS."}, {"Time_Start": 1331.84, "Time_End": 1338.1000000000001, "Text": " And you can place rules on the system, which say if data comes in from a specific interface, from a specific host,"}, {"Time_Start": 1338.3600000000001, "Time_End": 1341.9, "Text": " over a port, using a protocol, basic firewalling rules."}, {"Time_Start": 1342.22, "Time_End": 1344.56, "Text": " Then you apply security labels to that."}, {"Time_Start": 1345.18, "Time_End": 1349.56, "Text": " And then what you can do is restrict processes running on the system based on their SLSs,"}, {"Time_Start": 1349.88, "Time_End": 1353.16, "Text": " who they can talk to because of the security information."}, {"Time_Start": 1353.6200000000001, "Time_End": 1357.6200000000001, "Text": " And you can also restrict how information go out and how information come in."}, {"Time_Start": 1358.0, "Time_End": 1361.24, "Text": " And this is different, too, than under Unix."}, {"Time_Start": 1361.6000000000001, "Time_End": 1365.2, "Text": " Because what happens is once you get, when you're in a system and you do filtering,"}, {"Time_Start": 1365.32, "Time_End": 1368.46, "Text": " you can say either people can get in or can come out."}, {"Time_Start": 1369.04, "Time_End": 1371.4, "Text": " But you can't say, I want to allow this process out, but I don't want to allow this process out,"}, {"Time_Start": 1371.46, "Time_End": 1372.2, "Text": " but I don't want to allow that."}, {"Time_Start": 1372.22, "Time_End": 1375.2, "Text": " process out. So you can do some pretty interesting things with that."}, {"Time_Start": 1376.94, "Time_End": 1381.04, "Text": " This is a very basic example of a network rule. I've caught out a lot of some of the extra stuff"}, {"Time_Start": 1381.04, "Time_End": 1385.16, "Text": " that doesn't matter for this talk. You can see from the top part that it's essentially a standard"}, {"Time_Start": 1385.16, "Time_End": 1390.1000000000001, "Text": " firewalling rule. We specify ports, not mask. Here we're looking at a 192-00 network, and we're"}, {"Time_Start": 1390.1000000000001, "Time_End": 1394.46, "Text": " looking at TCP protocol. The next part that's different, though, from a firewalling rule is the idea"}, {"Time_Start": 1394.46, "Time_End": 1401.6200000000001, "Text": " of specifying a minimum and a maximum SL range on this interface or on this rule. This is the types of data"}, {"Time_Start": 1401.6200000000001, "Time_End": 1406.64, "Text": " that you allow to flow out of this rule. So here basically we're saying anybody can send"}, {"Time_Start": 1406.64, "Time_End": 1411.48, "Text": " information out through this, that applies to this rule. However, a very important piece is"}, {"Time_Start": 1411.48, "Time_End": 1416.0000000000002, "Text": " this default SL, and here it's confidential A. And what this does is it's saying that every piece"}, {"Time_Start": 1416.0000000000002, "Time_End": 1420.88, "Text": " of data that comes into the system will be marked at this level. So now processes have to dominate"}, {"Time_Start": 1420.88, "Time_End": 1426.2, "Text": " this label in order to be able to read the information to be able to access it. And here's a big"}, {"Time_Start": 1426.2, "Time_End": 1431.3600000000001, "Text": " blocky diagram, kind of summing all this up to show you why this actually means something. On this, we have"}, {"Time_Start": 1431.3600000000001, "Time_End": 1435.3200000000002, "Text": " two processes running. We have a web server and an SQL server. The web server is running at"}, {"Time_Start": 1435.3200000000002, "Time_End": 1442.5400000000002, "Text": " confidential HTTP. HDPD is a compartment. And we also have an SQL server running at ConSQL. One of the"}, {"Time_Start": 1442.5400000000002, "Time_End": 1447.3000000000002, "Text": " things right here is you'll notice that the SLs are disjoint from each other. And what this means is that the"}, {"Time_Start": 1447.3000000000002, "Time_End": 1453.2400000000002, "Text": " web server can't access the SQL server. It can't access it over the network internally, and it can't"}, {"Time_Start": 1453.2400000000002, "Time_End": 1457.7600000000002, "Text": " access its files, because here I'm assuming that the files are protected at that level. Another thing"}, {"Time_Start": 1457.7600000000002, "Time_End": 1461.3400000000001, "Text": " that we can do is place the web server's files, its content, its binary."}, {"Time_Start": 1461.3600000000001, "Time_End": 1467.16, "Text": " CGI programs at Confidential. And what that does is it gives the web server read-only access"}, {"Time_Start": 1467.16, "Time_End": 1472.0200000000002, "Text": " to its files, but not write access. So now if somebody comes in and breaks through CGI bin"}, {"Time_Start": 1472.0200000000002, "Time_End": 1477.46, "Text": " programs that are written poorly, which happens on occasion, then they're only going to have"}, {"Time_Start": 1477.46, "Time_End": 1481.5200000000002, "Text": " read access to these files. And they can become root, they can become ISSO, they become any user"}, {"Time_Start": 1481.5200000000002, "Time_End": 1485.3600000000001, "Text": " they want to, but they're locked into this Mac compartment that only has read access to the files."}, {"Time_Start": 1485.3600000000001, "Time_End": 1490.5600000000002, "Text": " So very quickly, you have a read-only web server. And that's just a very simple application of what"}, {"Time_Start": 1490.5600000000002, "Time_End": 1491.2400000000002, "Text": " you can do here."}, {"Time_Start": 1491.3600000000001, "Time_End": 1496.8200000000002, "Text": " And then basically what the networking rules do is it allows you to set up these data flows,"}, {"Time_Start": 1497.4, "Time_End": 1500.94, "Text": " for example here on port 80 to the web server that allow some people to connect in"}, {"Time_Start": 1500.94, "Time_End": 1504.94, "Text": " and keep other people from connecting. So for example, on the main interface, we have port"}, {"Time_Start": 1504.94, "Time_End": 1509.3400000000001, "Text": " 8Con HTTP, which allows, it's a general rule which allows anybody to connect through that port"}, {"Time_Start": 1509.3400000000001, "Time_End": 1514.8200000000002, "Text": " at that level, but the interface default is confidential default, which means that anybody coming in through"}, {"Time_Start": 1514.8200000000002, "Time_End": 1519.0000000000002, "Text": " this interface will get marked at that if they go anywhere else besides the web server, which then means"}, {"Time_Start": 1519.0000000000002, "Time_End": 1521.3400000000001, "Text": " they can't talk to the SQL server. But it's not so."}, {"Time_Start": 1521.3600000000001, "Time_End": 1524.5400000000002, "Text": " much the filtering aspects that are important because you can do those, you can accomplish"}, {"Time_Start": 1524.5400000000002, "Time_End": 1528.6000000000001, "Text": " those things with firewalls. It's the fact that you can now isolate your processes and your"}, {"Time_Start": 1528.6000000000001, "Time_End": 1532.5200000000002, "Text": " subsystems from each other, which we did a whole lot of on the web, on our system that we're"}, {"Time_Start": 1532.5200000000002, "Time_End": 1542.7600000000002, "Text": " letting people hack. And you can trap people in these. All right, the fun stuff. Hacking B1 trusted"}, {"Time_Start": 1542.7600000000002, "Time_End": 1546.72, "Text": " operating systems. The first thing, and I mentioned this before, that you have to do is you"}, {"Time_Start": 1546.72, "Time_End": 1551.3400000000001, "Text": " have to change your mindset, because what you're attacking is not the same. And the type of"}, {"Time_Start": 1551.3600000000001, "Time_End": 1555.5400000000002, "Text": " types of attacks that you would use, while it might yield some kind of access, will probably"}, {"Time_Start": 1555.5400000000002, "Time_End": 1558.98, "Text": " not yield the type of access that you're usually going for."}, {"Time_Start": 1558.98, "Time_End": 1563.7600000000002, "Text": " Keep it in your head. Root and UID 0 has no special meaning on these systems. UID 0 is no different"}, {"Time_Start": 1563.7600000000002, "Time_End": 1565.5400000000002, "Text": " than UID 1024."}, {"Time_Start": 1565.5400000000002, "Time_End": 1572.3600000000001, "Text": " Access to files, anything that you're trying to get to you, is controlled by both DAC and Mac."}, {"Time_Start": 1572.3600000000001, "Time_End": 1576.3000000000002, "Text": " So when I start talking about you need to have this type of SL or this to pass a Mac check, and"}, {"Time_Start": 1576.3000000000002, "Time_End": 1580.0800000000002, "Text": " I don't talk about DAC, it's because I'm assuming that everybody already understands how permission"}, {"Time_Start": 1580.0800000000002, "Time_End": 1580.68, "Text": " bits work."}, {"Time_Start": 1580.68, "Time_End": 1582.66, "Text": " You have to pass both checks, though."}, {"Time_Start": 1583.8, "Time_End": 1591.0800000000002, "Text": " So now, if you can, if you get past Mac, which can only be done, excuse me, by obtaining privileges,"}, {"Time_Start": 1592.16, "Time_End": 1595.0800000000002, "Text": " then you get to, you're still back to the standard DAC problem."}, {"Time_Start": 1595.5, "Time_End": 1600.0600000000002, "Text": " You have to become user or you have to obtain privileges in order to circumvent DAC."}, {"Time_Start": 1602.18, "Time_End": 1602.74, "Text": " All right."}, {"Time_Start": 1604.8, "Time_End": 1610.24, "Text": " The corollary to root access on a standard system, what root access is under a trusted operating system?"}, {"Time_Start": 1610.68, "Time_End": 1615.98, "Text": " system is essentially having access to all administrative commands that they'll let you run them"}, {"Time_Start": 1615.98, "Time_End": 1619.4, "Text": " and do whatever you want to do on the system. They'll let you give you all the privileges, they'll let you"}, {"Time_Start": 1619.4, "Time_End": 1624.48, "Text": " change files. If you can do all of those things, then you really have complete access to the system."}, {"Time_Start": 1624.6200000000001, "Time_End": 1629.4, "Text": " So now you're not so much going after a UID as you are going after authorizations or privileges"}, {"Time_Start": 1629.4, "Time_End": 1634.78, "Text": " and also getting yourself to a correct SL. So now we have new problems when we attack a system."}, {"Time_Start": 1635.0800000000002, "Time_End": 1638.5600000000002, "Text": " You have to figure out what are the files or what is the information that you're going after."}, {"Time_Start": 1638.8600000000001, "Time_End": 1640.66, "Text": " How is it protected? How can I get it?"}, {"Time_Start": 1640.68, "Time_End": 1644.48, "Text": " to the level that it's protected at so that I can access it. If I just need to read it, it's one"}, {"Time_Start": 1644.48, "Time_End": 1648.66, "Text": " problem. If I need to write to it, it's an entirely different problem. And then how can I get the,"}, {"Time_Start": 1648.66, "Time_End": 1652.7, "Text": " how can I get the authorizations that I need in order to run the programs that I need to run to do this?"}, {"Time_Start": 1653.24, "Time_End": 1657.14, "Text": " And of course, if you can figure out some great way to hack a process that happens to have all privileges"}, {"Time_Start": 1657.14, "Time_End": 1659.0, "Text": " on it, then you're pretty much done as well."}, {"Time_Start": 1660.96, "Time_End": 1664.8400000000001, "Text": " Set UAD programs aren't quite the juicy target they used to be because set UID under"}, {"Time_Start": 1664.8400000000001, "Time_End": 1669.46, "Text": " trusted operating systems performs one function. It changes your user ID. Well, you can become"}, {"Time_Start": 1669.46, "Time_End": 1673.58, "Text": " another user ID that might give you more authorizations on a system because the user ID"}, {"Time_Start": 1673.58, "Time_End": 1679.06, "Text": " might have them. But if the system's set up correctly, you're probably stuck in a limiting"}, {"Time_Start": 1679.06, "Time_End": 1682.94, "Text": " authorization set where you can't get them, like we did on the machine word letting people try and"}, {"Time_Start": 1682.94, "Time_End": 1688.9, "Text": " break into. The thing to remember is when you're going after a set UID, you're not going to be changing"}, {"Time_Start": 1688.9, "Time_End": 1693.3600000000001, "Text": " your SL. You're still going to be locked into this level and isolated from the rest of the system."}, {"Time_Start": 1693.76, "Time_End": 1697.54, "Text": " Even though you might all of a sudden start passing DAC checks, you're not going to be passing the"}, {"Time_Start": 1697.54, "Time_End": 1698.1000000000001, "Text": " MAC checks."}, {"Time_Start": 1699.46, "Time_End": 1702.38, "Text": " So now what you need to do, instead of looking for set UID programs,"}, {"Time_Start": 1702.52, "Time_End": 1706.1000000000001, "Text": " is look for executables and damans that are running with privilege, with special access."}, {"Time_Start": 1706.48, "Time_End": 1708.96, "Text": " If you can find those, those are the programs that you need to break"}, {"Time_Start": 1708.96, "Time_End": 1713.54, "Text": " so that you can obtain the privileges or the authorizations that you need in order to get into the system."}, {"Time_Start": 1716.02, "Time_End": 1720.18, "Text": " There's kind of two ways to go after privilege programs, and obviously there's more than this,"}, {"Time_Start": 1720.42, "Time_End": 1726.1000000000001, "Text": " but I just want to talk about two because they're a little bit different because of the trusted operating system natures."}, {"Time_Start": 1726.68, "Time_End": 1729.44, "Text": " As I mentioned, buffer overflows will create, you know, that create a sheet."}, {"Time_Start": 1729.46, "Time_End": 1733.9, "Text": " a shield, a shell will not yield privileges because you're doing an exec,"}, {"Time_Start": 1734.42, "Time_End": 1735.46, "Text": " and you'll lose those privileges."}, {"Time_Start": 1735.6000000000001, "Time_End": 1739.06, "Text": " So now what needs to happen is, is people need to go out and start writing new shell code."}, {"Time_Start": 1739.3600000000001, "Time_End": 1741.4, "Text": " The shell code needs to do a little bit more creative work."}, {"Time_Start": 1741.7, "Time_End": 1744.88, "Text": " It's going to have to go out and find authorization tables, modify those,"}, {"Time_Start": 1745.3, "Time_End": 1748.8, "Text": " modify clearance databases so that you can log in at a level that you want to log in at,"}, {"Time_Start": 1748.8, "Time_End": 1751.74, "Text": " and modify network labeling rules so that if you come in over the network,"}, {"Time_Start": 1751.82, "Time_End": 1754.1200000000001, "Text": " you can gain access in the way that you'd like to."}, {"Time_Start": 1757.08, "Time_End": 1759.44, "Text": " One of the first things to check on a B1 option."}, {"Time_Start": 1759.46, "Time_End": 1764.7, "Text": " operating system and don't bother checking on pit bull because this is not a problem, but it's"}, {"Time_Start": 1764.7, "Time_End": 1769.02, "Text": " still worth mentioning because you should look for it, is the idea of trusted library paths."}, {"Time_Start": 1769.02, "Time_End": 1777.22, "Text": " On some systems you may have run into a little issue if you run a set UID program and you can specify a,"}, {"Time_Start": 1777.22, "Time_End": 1782.96, "Text": " or a program running as root, and you can specify a library path to look for libraries, so you can get"}, {"Time_Start": 1782.96, "Time_End": 1787.02, "Text": " it to use a different library than it was intended to. In other words, you can say, hey, use this great library"}, {"Time_Start": 1787.02, "Time_End": 1788.7, "Text": " I wrote in slash 10th instead of slash lib."}, {"Time_Start": 1788.7, "Time_End": 1792.32, "Text": " Well, if you can do that, obviously, you can get a program running this route to do whatever you want it to,"}, {"Time_Start": 1792.42, "Time_End": 1795.94, "Text": " if you can get it to run commands or anything you've written in the library."}, {"Time_Start": 1796.24, "Time_End": 1798.04, "Text": " The same thing is true of privilege programs."}, {"Time_Start": 1798.14, "Time_End": 1799.18, "Text": " It's the same kind of attack."}, {"Time_Start": 1799.52, "Time_End": 1800.92, "Text": " It's just now you're going for privilege programs."}, {"Time_Start": 1801.46, "Time_End": 1806.3400000000001, "Text": " So it's really quick and easy to check, you know, setting the environment very old past and see if that works."}, {"Time_Start": 1806.82, "Time_End": 1811.98, "Text": " Because if you do that, you have access to the system very easily and without a whole lot of creativity."}, {"Time_Start": 1812.76, "Time_End": 1815.82, "Text": " And if you can't do that, then you need to find locations where libraries are located"}, {"Time_Start": 1815.82, "Time_End": 1818.68, "Text": " and try and get them in there and get people to use them, which is an obvious."}, {"Time_Start": 1818.7, "Time_End": 1825.7, "Text": " attack. The thing to remember now as well is because before we used to place set"}, {"Time_Start": 1825.7, "Time_End": 1829.0800000000002, "Text": " set you ID zero on programs that we needed to do special things, now we have limited privilege"}, {"Time_Start": 1829.0800000000002, "Time_End": 1834.3, "Text": " sets, which means that if you're going after the mount command, it's only going to yield the"}, {"Time_Start": 1834.3, "Time_End": 1838.78, "Text": " mount privilege. It's not going to yield special file system access. So lots of programs that we"}, {"Time_Start": 1838.78, "Time_End": 1843.8600000000001, "Text": " may have normally went after before are not going to be yielding the type of access that we want."}, {"Time_Start": 1843.8600000000001, "Time_End": 1848.68, "Text": " So now you have to be a little choosier over the programs that you're going for. Though, of"}, {"Time_Start": 1848.7, "Time_End": 1852.6000000000001, "Text": " Of course, if you can get a privilege that lets you insert curl modules, that's great, and you can get everything else from there."}, {"Time_Start": 1856.02, "Time_End": 1866.18, "Text": " And the last item on the last slide, which I should mention too, is probably one of the most important things to go after are processes that give you the ability to override security checks, mandatory access control and DAC checks."}, {"Time_Start": 1866.7, "Time_End": 1870.74, "Text": " And also, very importantly, processes which have the ability to set privileges on processes."}, {"Time_Start": 1871.18, "Time_End": 1873.5800000000002, "Text": " It's clearly one of the most important privileges that exist."}, {"Time_Start": 1874.0, "Time_End": 1877.72, "Text": " And if you can get that, then you can give yourself whatever you need to do the work that you want to."}, {"Time_Start": 1878.7, "Time_End": 1882.78, "Text": " Getting files into system directories is a little trickier."}, {"Time_Start": 1882.92, "Time_End": 1886.98, "Text": " It's not just becoming the user ID. Now you have to be the right SL to place information in there."}, {"Time_Start": 1887.54, "Time_End": 1891.68, "Text": " And you can look at directories on a pit bull system, for example, with a program called SECLS."}, {"Time_Start": 1892.0, "Time_End": 1894.6000000000001, "Text": " MinusS gives you the SL on the directories."}, {"Time_Start": 1895.54, "Time_End": 1901.3600000000001, "Text": " Some directories are going to be created multi-level, which means they allow a range of data to be placed into them."}, {"Time_Start": 1902.16, "Time_End": 1905.98, "Text": " So if you're an attacker and you exist in a range that allows you to put information in there,"}, {"Time_Start": 1905.98, "Time_End": 1908.68, "Text": " like say, for example, slash lib, they don't make it, it's not made."}, {"Time_Start": 1908.7, "Time_End": 1909.78, "Text": " made a single level directory."}, {"Time_Start": 1910.6000000000001, "Time_End": 1914.4, "Text": " Then if you're an attacker, you can put information in there if you can pass the DAC check,"}, {"Time_Start": 1914.48, "Time_End": 1918.6200000000001, "Text": " which means all you have to do is guess maybe the root password or an ISO password or somebody"}, {"Time_Start": 1918.6200000000001, "Time_End": 1920.22, "Text": " who would have right access into that directory."}, {"Time_Start": 1920.66, "Time_End": 1922.48, "Text": " Now all of a sudden you went and circumvented MAC checks."}, {"Time_Start": 1923.28, "Time_End": 1927.24, "Text": " And now you can make your libraries or, you know, things in Etsy or wherever it is that you're"}, {"Time_Start": 1927.24, "Time_End": 1931.24, "Text": " going after available to other people to use and break their boxes with."}, {"Time_Start": 1931.72, "Time_End": 1936.32, "Text": " Single level directories are a little trickier because they force you to be specifically at that level"}, {"Time_Start": 1936.32, "Time_End": 1937.32, "Text": " to do this type of work."}, {"Time_Start": 1938.7, "Time_End": 1944.04, "Text": " So one of the first things that you should do is search a machine for multi-level system-type directories."}, {"Time_Start": 1944.28, "Time_End": 1947.8600000000001, "Text": " Then it becomes really just the old problem of becoming that user ID."}, {"Time_Start": 1948.74, "Time_End": 1952.56, "Text": " The next thing is if you have a multi-level directory that has a range on it that you fall into,"}, {"Time_Start": 1952.82, "Time_End": 1954.88, "Text": " and you can become the user who owns that directory."}, {"Time_Start": 1955.1200000000001, "Time_End": 1959.88, "Text": " You can also remove the directory and thus getting rid of the files that are underneath it."}, {"Time_Start": 1960.52, "Time_End": 1964.7, "Text": " And this is significant because there can actually be files in a directory that you wouldn't have access to you,"}, {"Time_Start": 1964.9, "Time_End": 1966.24, "Text": " but you may want to replace."}, {"Time_Start": 1966.24, "Time_End": 1968.68, "Text": " Like for an example, in Etsy, there's a little bit."}, {"Time_Start": 1968.7, "Time_End": 1972.42, "Text": " file called shadow. And that's usually protected at the highest level the system can"}, {"Time_Start": 1972.42, "Time_End": 1977.16, "Text": " protect it at. Well, if you can become implementation low and slash Etsy is a multi-level"}, {"Time_Start": 1977.16, "Time_End": 1981.7, "Text": " directory from up below to TSR, you can blow away Etsy, replace it, put a new Etsy in there with"}, {"Time_Start": 1981.7, "Time_End": 1986.3400000000001, "Text": " a shadow that you like. And again, you know, now you have more access to the system or the security"}, {"Time_Start": 1986.3400000000001, "Time_End": 1990.74, "Text": " clearance files or things like that. And you can replace the attack applies, obviously, to all"}, {"Time_Start": 1990.74, "Time_End": 1995.3400000000001, "Text": " directories. And again, this allows you to circumvent the mandatory access control checks placed"}, {"Time_Start": 1995.3400000000001, "Time_End": 1995.92, "Text": " on a system."}, {"Time_Start": 1995.92, "Time_End": 2002.68, "Text": " Obviously, it's very important to get a new SL, because chances are the SL that you log into"}, {"Time_Start": 2002.68, "Time_End": 2006.22, "Text": " a system is not one that you want, but one that the administrator wants you to have."}, {"Time_Start": 2006.52, "Time_End": 2008.96, "Text": " So start looking for ways to change it."}, {"Time_Start": 2010.42, "Time_End": 2011.7, "Text": " There's a few different ways to do this."}, {"Time_Start": 2011.8400000000001, "Time_End": 2015.26, "Text": " You can set it, sometimes in systems you can set it for your session, as I mentioned before,"}, {"Time_Start": 2015.42, "Time_End": 2019.5, "Text": " or you can ask you to a new user, which might change your effective SL, and you can also leverage"}, {"Time_Start": 2019.5, "Time_End": 2021.28, "Text": " networking connections to get to new levels."}, {"Time_Start": 2023.04, "Time_End": 2025.9, "Text": " Setting your session SL can be done through a different,"}, {"Time_Start": 2025.92, "Time_End": 2029.42, "Text": " a couple different ways typically. For example, we have a program we call trusted SSH,"}, {"Time_Start": 2029.42, "Time_End": 2035.74, "Text": " which is essentially a trusted operating system aware SSH that lets you specify your effective"}, {"Time_Start": 2035.74, "Time_End": 2040.5600000000002, "Text": " SL. One thing, though, again, is that your effective SL has to be within your minimum maximum clearance"}, {"Time_Start": 2040.5600000000002, "Time_End": 2046.24, "Text": " as specified in some sort of clearance database, unless they've implemented it in a very, very broken"}, {"Time_Start": 2046.24, "Time_End": 2051.98, "Text": " way. Another example of something that can be used to get different access on a system, if you're"}, {"Time_Start": 2051.98, "Time_End": 2055.02, "Text": " able to get user passwords, and this is true on a pit bull system, if you're you're able to get user passwords, and this is true"}, {"Time_Start": 2055.02, "Time_End": 2057.08, "Text": " on a pit bull system. If you do an SU dash"}, {"Time_Start": 2057.08, "Time_End": 2058.96, "Text": " and you're saying, I want to change this new user,"}, {"Time_Start": 2059.34, "Time_End": 2060.88, "Text": " your effective SL will be changed."}, {"Time_Start": 2061.3, "Time_End": 2063.18, "Text": " So if all of your system files are protected"}, {"Time_Start": 2063.18, "Time_End": 2064.98, "Text": " at implementation low, you get the"}, {"Time_Start": 2064.98, "Time_End": 2066.96, "Text": " root password, you do SU dash root, and"}, {"Time_Start": 2066.96, "Time_End": 2068.4, "Text": " his default clearance is input low."}, {"Time_Start": 2068.7599999999998, "Time_End": 2070.5, "Text": " All of a sudden, you have access to all the system file"}, {"Time_Start": 2070.5, "Time_End": 2072.22, "Text": " files in the game's over."}, {"Time_Start": 2073.48, "Time_End": 2075.2, "Text": " So, again,"}, {"Time_Start": 2075.2, "Time_End": 2077.2599999999998, "Text": " though, when you do an SU dash, most likely"}, {"Time_Start": 2077.2599999999998, "Time_End": 2080.16, "Text": " your effective SL will have to be in the range of your clearance,"}, {"Time_Start": 2080.2599999999998, "Time_End": 2082.92, "Text": " otherwise it won't let you do that. And that's true under pit bull and hopefully true"}, {"Time_Start": 2082.92, "Time_End": 2083.7599999999998, "Text": " under other systems."}, {"Time_Start": 2084.6, "Time_End": 2084.8, "Text": " Now,"}, {"Time_Start": 2085.02, "Time_End": 2090.88, "Text": " Authorizations. Because authorizations are tied to a user ID, becoming a new user can still have a great effect on a system."}, {"Time_Start": 2091.28, "Time_End": 2095.16, "Text": " If the administrative commands are not protected at a level that prohibits you from getting to them,"}, {"Time_Start": 2095.54, "Time_End": 2098.42, "Text": " which hopefully when someone's configuring a system, that's exactly what they do."}, {"Time_Start": 2098.7599999999998, "Time_End": 2104.62, "Text": " For example, in the box that we have out there, we put everything at TSOL, top secret all, which essentially means nobody has access to them,"}, {"Time_Start": 2104.86, "Time_End": 2109.92, "Text": " except for one user who comes in over SSH who uses an RSA key, a 1024-bit RSA key."}, {"Time_Start": 2110.3, "Time_End": 2114.56, "Text": " Well, unless somebody guesses that key, there's really no way for them to get into the system at that level."}, {"Time_Start": 2115.02, "Time_End": 2118.28, "Text": " And again, I should mention again, beware the limiting authorization set,"}, {"Time_Start": 2118.36, "Time_End": 2121.2, "Text": " because now assuming to other users doesn't help you."}, {"Time_Start": 2123.9, "Time_End": 2124.7, "Text": " RC scripts."}, {"Time_Start": 2126.1, "Time_End": 2129.64, "Text": " Obviously, on any system, if you can modify the RC scripts, even a standard Unix system,"}, {"Time_Start": 2129.7, "Time_End": 2133.28, "Text": " you probably have a lot of power, and on standard Unix, you've already rooted the box."}, {"Time_Start": 2133.88, "Time_End": 2136.06, "Text": " Undertrusted operating systems, though, it's a little bit different."}, {"Time_Start": 2136.74, "Time_End": 2141.48, "Text": " If you get access to an RC script, though, you have pretty much access to the whole system after a reboot."}, {"Time_Start": 2141.48, "Time_End": 2144.82, "Text": " And the reason is, is that RC scripts are typically either launched"}, {"Time_Start": 2144.82, "Time_End": 2148.44, "Text": " with lots of privileges, which means pretty much open access to the system,"}, {"Time_Start": 2148.78, "Time_End": 2153.38, "Text": " or they have lots of authorizations in order to run the programs that they need to to start up the system."}, {"Time_Start": 2153.7200000000003, "Time_End": 2156.8, "Text": " So this is another very juicy target to go after on these boxes."}, {"Time_Start": 2159.02, "Time_End": 2159.82, "Text": " Network labeling."}, {"Time_Start": 2160.6200000000003, "Time_End": 2164.2000000000003, "Text": " As I showed you before, you can specify what a label is for different ports, for different services."}, {"Time_Start": 2164.84, "Time_End": 2168.5800000000004, "Text": " And so now if you can find a service which is running on a box at a level that you'd like to be at,"}, {"Time_Start": 2168.6400000000003, "Time_End": 2174.5, "Text": " like implementation low, and you can exploit that, buffer overflow, that program, you can give yourself a shell"}, {"Time_Start": 2174.5, "Time_End": 2179.26, "Text": " at that SL. Now the only thing you have to do is become the user that you want with the right"}, {"Time_Start": 2179.26, "Time_End": 2185.62, "Text": " authorizations, and you can have full access to the system. So don't ever run any services at"}, {"Time_Start": 2185.62, "Time_End": 2188.56, "Text": " implementation law, if that's what your system files are at. That's a lesson."}, {"Time_Start": 2190.4, "Time_End": 2194.66, "Text": " Kernel bugs. Kernel bugs are always good for any operating system. All the securities in the kernel"}, {"Time_Start": 2194.66, "Time_End": 2198.96, "Text": " inside, in there, and if you can break the kernel, you own the system. You can circumvent all the"}, {"Time_Start": 2198.96, "Time_End": 2201.46, "Text": " security, or at least you should be able to figure out a way to do that."}, {"Time_Start": 2201.46, "Time_End": 2206.02, "Text": " So kind of where to look on trusted operating systems."}, {"Time_Start": 2206.3, "Time_End": 2209.2200000000003, "Text": " Of course, first, there's all the regular old kernel books that happen every once in a while."}, {"Time_Start": 2209.56, "Time_End": 2212.84, "Text": " If you can find one of those to get in, then you can give yourself the access you need."}, {"Time_Start": 2213.2, "Time_End": 2215.6, "Text": " But there's other things that you can go after, too, which are kernel related."}, {"Time_Start": 2216.1, "Time_End": 2218.7, "Text": " Look at DevKM. That gives you access to all of kernel memory."}, {"Time_Start": 2218.86, "Time_End": 2223.18, "Text": " If it's had an SL that you can get to and you can become a user who has access to it,"}, {"Time_Start": 2223.46, "Time_End": 2224.8, "Text": " then you can modify kernel memory."}, {"Time_Start": 2225.54, "Time_End": 2227.66, "Text": " And you should pretty much be able to take over the box from that."}, {"Time_Start": 2228.26, "Time_End": 2231.44, "Text": " And you can give yourself all the privileges you need, pick the UID that you'd like to have,"}, {"Time_Start": 2231.46, "Time_End": 2234.7, "Text": " and give yourself an SL that would allow you to do what you need to do."}, {"Time_Start": 2235.28, "Time_End": 2237.52, "Text": " Also, access to raw devices is very useful."}, {"Time_Start": 2237.7, "Time_End": 2241.56, "Text": " If you can get access to a raw device, you can modify the security structures and the files"}, {"Time_Start": 2241.56, "Time_End": 2245.52, "Text": " and change everything to a level that is more amenable to the level that you're at,"}, {"Time_Start": 2245.84, "Time_End": 2247.44, "Text": " and then again, get the access that you'd like."}, {"Time_Start": 2248.44, "Time_End": 2252.2400000000002, "Text": " Also, it's interesting to look at devices, look through IOC control interfaces"}, {"Time_Start": 2252.2400000000002, "Time_End": 2254.06, "Text": " and different ways to communicate with devices."}, {"Time_Start": 2254.5, "Time_End": 2257.32, "Text": " They typically tend to be a little less scrutinized on B1 systems"}, {"Time_Start": 2257.32, "Time_End": 2261.36, "Text": " just because a lot of times there aren't, the Mac rules,"}, {"Time_Start": 2261.46, "Time_End": 2264.06, "Text": " aren't being looked at in the IOC control."}, {"Time_Start": 2264.2, "Time_End": 2268.46, "Text": " Simply, the only time a Mac check takes place is when you try and open and access the device."}, {"Time_Start": 2268.6, "Time_End": 2271.68, "Text": " But after that, you can communicate with the device readily, which is reasonable,"}, {"Time_Start": 2271.94, "Time_End": 2275.14, "Text": " but if somebody screwed up their device, then you can have access to the system."}, {"Time_Start": 2275.96, "Time_End": 2280.32, "Text": " Also, it's worthwhile checking to see if IPC mechanisms on a system are actually using Mac."}, {"Time_Start": 2280.66, "Time_End": 2284.6, "Text": " If they're not, you have a way to communicate with processes that are at a different level than you."}, {"Time_Start": 2284.6, "Time_End": 2287.34, "Text": " And you can potentially use that as an attack path."}, {"Time_Start": 2291.46, "Time_End": 2297.2, "Text": " It's important to remember that anything that you can find once you circumvent Mac is only then protected by DAC,"}, {"Time_Start": 2297.32, "Time_End": 2300.3, "Text": " or if there's something that isn't actually checking mandatory access control,"}, {"Time_Start": 2300.64, "Time_End": 2303.64, "Text": " then you're probably back to a DAC or no access check attack."}, {"Time_Start": 2304.16, "Time_End": 2307.14, "Text": " And now all you need is, possibly, is to know a password to become a UID."}, {"Time_Start": 2307.28, "Time_End": 2308.42, "Text": " You're back to the old problem."}, {"Time_Start": 2308.82, "Time_End": 2313.36, "Text": " So again, as I say this a lot, really what you're trying to do is you're trying to reduce your problem set"}, {"Time_Start": 2313.36, "Time_End": 2316.58, "Text": " to get rid of the layers that the trusted operating system puts on"}, {"Time_Start": 2316.58, "Time_End": 2321.2200000000003, "Text": " by meeting the access checks that it makes and bringing it back to a common attack problem."}, {"Time_Start": 2321.46, "Time_End": 2324.62, "Text": " It's difficult, but it can be done if the system is misconfigured."}, {"Time_Start": 2327.9, "Time_End": 2332.06, "Text": " These are real basic things which you should just always check because somebody might screw up the box."}, {"Time_Start": 2332.36, "Time_End": 2336.36, "Text": " Try and log in as a highly authorized user. Can you guess the password for the security administrator?"}, {"Time_Start": 2336.7200000000003, "Time_End": 2343.84, "Text": " Do they let you connect us him from an external connection and add an SL that lets you run administrative programs or access system files?"}, {"Time_Start": 2344.2400000000002, "Time_End": 2347.6, "Text": " It's worth trying. It's probably not the case, but it's definitely worth looking at."}, {"Time_Start": 2347.6, "Time_End": 2349.6, "Text": " And also look for the security databases."}, {"Time_Start": 2350.08, "Time_End": 2351.44, "Text": " They're pretty much the key to the security."}, {"Time_Start": 2351.46, "Time_End": 2355.84, "Text": " on the system. And if you can modify them, you're going to own the box fairly quickly."}, {"Time_Start": 2358.18, "Time_End": 2361.46, "Text": " Just to mention some of the commercial trusted operating systems that are available."}, {"Time_Start": 2362.2200000000003, "Time_End": 2365.44, "Text": " There's, of course, the company I work for Argus Systems Group, we make pit bull."}, {"Time_Start": 2365.88, "Time_End": 2370.9, "Text": " That's on Solaris 7, Spark, and X86. We're porting to Solaris 8, Solaris 6. We have early release on"}, {"Time_Start": 2370.9, "Time_End": 2376.86, "Text": " AIX, and we're reporting to Linux on 32-bit and 64-bit kernels. And as I understand, that's going"}, {"Time_Start": 2376.86, "Time_End": 2381.3, "Text": " to be available because I'm sure some people here are interested in that by the end of the"}, {"Time_Start": 2381.3, "Time_End": 2383.98, "Text": " fourth quarter, and we should have a beta program available for that as well."}, {"Time_Start": 2384.7400000000002, "Time_End": 2388.76, "Text": " HP makes a product called Virtual Vault, which runs an HP hardware as part of a suite called"}, {"Time_Start": 2388.76, "Time_End": 2394.2200000000003, "Text": " Presidium. There's also an effort underway to create a trusted operating system, an open source"}, {"Time_Start": 2394.2200000000003, "Time_End": 2398.7400000000002, "Text": " trusted operating system, on top of free BSD. And you can find out information on that at"}, {"Time_Start": 2398.7400000000002, "Time_End": 2406.6400000000003, "Text": " at www.d.com. So the best way to learn how to break these boxes is, of course, to have your own"}, {"Time_Start": 2406.6400000000003, "Time_End": 2411.28, "Text": " is start securing it and breaking it. So you should get one and start doing it. And it's very"}, {"Time_Start": 2411.3, "Time_End": 2414.6600000000003, "Text": " easy to do, actually, because we're giving ours away for free for individual,"}, {"Time_Start": 2414.78, "Time_End": 2421.1400000000003, "Text": " non-com. So if you go to Argusrevolution.com, we have ISSO, I'm sorry, ISO images,"}, {"Time_Start": 2421.88, "Time_End": 2425.6400000000003, "Text": " available, you can order the media, all those kinds of things, and you can have unlimited licenses."}, {"Time_Start": 2426.1200000000003, "Time_End": 2433.78, "Text": " We make all that available. I'll be making this speech and the presentation I gave for BlackHat,"}, {"Time_Start": 2433.84, "Time_End": 2439.46, "Text": " which, as I said, was more detailed as far as trusted operating systems go, available on the Argus"}, {"Time_Start": 2439.46, "Time_End": 2440.3, "Text": " Revolution website."}, {"Time_Start": 2441.3, "Time_End": 2445.96, "Text": " I believe a real audio stream available on Black Hat site for the presentation that I gave."}, {"Time_Start": 2446.26, "Time_End": 2448.7400000000002, "Text": " I don't know what the case is for DEFCOM, what they're doing with that exactly."}, {"Time_Start": 2449.2200000000003, "Time_End": 2453.32, "Text": " And white papers, documentation, and there's a discussion form available on the website as well,"}, {"Time_Start": 2453.6800000000003, "Time_End": 2458.26, "Text": " if you have questions. And, of course, please feel free to email me if you have any questions."}, {"Time_Start": 2458.4, "Time_End": 2460.3, "Text": " And, yes, I will definitely answer questions."}, {"Time_Start": 2461.2200000000003, "Time_End": 2461.5800000000004, "Text": " Yes."}, {"Time_Start": 2461.5800000000004, "Time_End": 2461.6000000000004, "Text": " Yes."}, {"Time_Start": 2465.6800000000003, "Time_End": 2468.82, "Text": " Yeah, they have the OB-1 stuff."}, {"Time_Start": 2468.9, "Time_End": 2469.02, "Text": " Yeah."}, {"Time_Start": 2471.3, "Time_End": 2474.6800000000003, "Text": " In truth, most of I know is from hearsay."}, {"Time_Start": 2474.86, "Time_End": 2477.6600000000003, "Text": " I tried to contact them, but I didn't get a lot of information back."}, {"Time_Start": 2478.02, "Time_End": 2483.32, "Text": " I know what they have done is they've released what is based off of the trusted IREX code base."}, {"Time_Start": 2483.7200000000003, "Time_End": 2488.2400000000002, "Text": " They did a CMW there, and basically they released that code as an example."}, {"Time_Start": 2488.34, "Time_End": 2492.6200000000003, "Text": " And from what I understand is that there is an effort underway at SGI, at least with people who work there,"}, {"Time_Start": 2492.7000000000003, "Time_End": 2498.5600000000004, "Text": " who are trying to create a trusted Linux, which is essentially based on the trusted IRX code base."}, {"Time_Start": 2501.3, "Time_End": 2502.0600000000004, "Text": " No comment."}, {"Time_Start": 2506.1400000000003, "Time_End": 2507.1000000000004, "Text": " Yeah, no comment."}, {"Time_Start": 2507.84, "Time_End": 2509.28, "Text": " You can come up and talk to me about it."}, {"Time_Start": 2509.34, "Time_End": 2509.6200000000003, "Text": " That's fine."}, {"Time_Start": 2510.26, "Time_End": 2511.2200000000003, "Text": " Just not through the microphone."}, {"Time_Start": 2513.0, "Time_End": 2513.42, "Text": " Any yet, yes."}, {"Time_Start": 2516.5, "Time_End": 2517.2200000000003, "Text": " All right."}, {"Time_Start": 2520.7400000000002, "Time_End": 2526.98, "Text": " All right. The question was, what about our role-based access control?"}, {"Time_Start": 2527.1000000000004, "Time_End": 2527.98, "Text": " Something called Arback."}, {"Time_Start": 2528.38, "Time_End": 2531.28, "Text": " R-back is essentially a discretionary access control."}, {"Time_Start": 2531.3, "Time_End": 2537.1000000000004, "Text": " mechanism, which is, I mentioned roles, like I-S-S-O-S-O-S-A."}, {"Time_Start": 2537.2400000000002, "Time_End": 2543.6000000000004, "Text": " The idea there is you're creating roles, and you can create an access control set around that."}, {"Time_Start": 2543.9, "Time_End": 2549.1800000000003, "Text": " It's not a pure, mandatory system, but it is still very useful."}, {"Time_Start": 2549.38, "Time_End": 2553.86, "Text": " That's actually out on Solaris 8, as I understand it, Arback is being made available as well."}, {"Time_Start": 2555.02, "Time_End": 2557.2000000000003, "Text": " Yeah, there is a Linux version as well."}, {"Time_Start": 2557.2000000000003, "Time_End": 2559.3, "Text": " I've actually not used it on Linux yet."}, {"Time_Start": 2561.3, "Time_End": 2562.0600000000004, "Text": " What else?"}, {"Time_Start": 2563.2200000000003, "Time_End": 2563.42, "Text": " Yeah."}, {"Time_Start": 2566.92, "Time_End": 2567.94, "Text": " Oh, there are."}, {"Time_Start": 2568.0600000000004, "Time_End": 2568.2400000000002, "Text": " Okay."}, {"Time_Start": 2569.26, "Time_End": 2572.0600000000004, "Text": " Do you know where, what website that's on?"}, {"Time_Start": 2574.1800000000003, "Time_End": 2577.34, "Text": " D-W-W-R-S-G-D-D-D-D-D-D-D-D-E-D-E."}, {"Time_Start": 2578.54, "Time_End": 2580.2200000000003, "Text": " R-S-B-E-E-E-E-E."}, {"Time_Start": 2581.26, "Time_End": 2583.26, "Text": " R-S-B-B-E-B-R-S-back, okay."}, {"Time_Start": 2591.3, "Time_End": 2592.6600000000003, "Text": " Right."}, {"Time_Start": 2603.2200000000003, "Time_End": 2605.2000000000003, "Text": " All right. Any other questions?"}, {"Time_Start": 2605.84, "Time_End": 2607.0600000000004, "Text": " Sorry, I haven't looked over yet."}, {"Time_Start": 2607.0800000000004, "Time_End": 2607.28, "Text": " Yes."}, {"Time_Start": 2609.04, "Time_End": 2610.0800000000004, "Text": " I guess you're going out of there."}, {"Time_Start": 2621.3, "Time_End": 2622.84, "Text": " Yes."}, {"Time_Start": 2626.1000000000004, "Time_End": 2630.8, "Text": " He was making a comment on seeing files in a directory, and there's two things I'll say about that."}, {"Time_Start": 2631.8, "Time_End": 2636.98, "Text": " One is that if you are looking, if you have access to a directory, to the directory file,"}, {"Time_Start": 2637.38, "Time_End": 2641.92, "Text": " then you can see what's in a file, but when then you go into the directory and you actually try and look at,"}, {"Time_Start": 2642.1600000000003, "Time_End": 2644.98, "Text": " examine the structures of the files, you may not have access to them."}, {"Time_Start": 2645.2400000000002, "Time_End": 2649.7400000000002, "Text": " The second thing is there's another concept called, oh, now it's going to escape my mind,"}, {"Time_Start": 2650.2400000000002, "Time_End": 2651.28, "Text": " partition directory."}, {"Time_Start": 2651.3, "Time_End": 2656.6400000000003, "Text": " And the idea is that you can create this directory structure, it's kind of a virtual"}, {"Time_Start": 2656.6400000000003, "Time_End": 2661.6600000000003, "Text": " directory structure under directories, where, depending on the level of the file that you're"}, {"Time_Start": 2661.6600000000003, "Time_End": 2665.76, "Text": " putting in there, it will go into one of these sub-directories, right, which is marked at a specific"}, {"Time_Start": 2665.76, "Time_End": 2666.6600000000003, "Text": " single level."}, {"Time_Start": 2667.1200000000003, "Time_End": 2671.7200000000003, "Text": " And so what level you're at kind of put you into one of these sub-directories, and you can't get access"}, {"Time_Start": 2671.7200000000003, "Time_End": 2672.46, "Text": " to the other ones."}, {"Time_Start": 2672.7000000000003, "Time_End": 2675.82, "Text": " So you can completely separate files that are at different levels from users."}, {"Time_Start": 2677.0800000000004, "Time_End": 2677.5600000000004, "Text": " Yes?"}, {"Time_Start": 2677.5600000000004, "Time_End": 2681.28, "Text": " How complicated is the API to math, and do you expect?"}, {"Time_Start": 2681.3, "Time_End": 2688.6000000000004, "Text": " Oh, do you want to exploit the third-party developers?"}, {"Time_Start": 2689.32, "Time_End": 2690.2000000000003, "Text": " Oh, always."}, {"Time_Start": 2692.84, "Time_End": 2698.6400000000003, "Text": " No, the API isn't very complicated, fortunately, at least speaking for myself."}, {"Time_Start": 2701.94, "Time_End": 2705.52, "Text": " But it, and it's not really some, well, I guess even with Mac stuff."}, {"Time_Start": 2706.2200000000003, "Time_End": 2710.36, "Text": " I guess kind of the advantage to it is that when you're working with the API, you're most likely"}, {"Time_Start": 2710.36, "Time_End": 2711.1800000000003, "Text": " working with it."}, {"Time_Start": 2711.3, "Time_End": 2717.0800000000004, "Text": " very specific pieces of your code, whereas the problem with standard Unix is that you're"}, {"Time_Start": 2717.0800000000004, "Time_End": 2721.34, "Text": " working with those things, but you pretty much said that you're working with it in the entire"}, {"Time_Start": 2721.34, "Time_End": 2725.98, "Text": " program, because you've said it's UID0, here's my, you know, here's all I can do, and I can do, you know,"}, {"Time_Start": 2726.02, "Time_End": 2731.26, "Text": " change mods and things and files, but when you're working with the trusted operating system"}, {"Time_Start": 2731.26, "Time_End": 2736.7200000000003, "Text": " APIs, you're going to have to be very aware of what you know, what you're using, where you're"}, {"Time_Start": 2736.7200000000003, "Time_End": 2739.96, "Text": " using them, because they're going to apply specifically to this, to the pieces of code that you're"}, {"Time_Start": 2739.96, "Time_End": 2740.6400000000003, "Text": " trying to work with."}, {"Time_Start": 2741.3, "Time_End": 2745.54, "Text": " made a little bit sense. I should also mention that on the site, we make our SDK available"}, {"Time_Start": 2745.54, "Time_End": 2749.36, "Text": " as well for the product for free, so if people want to play around with that. For example,"}, {"Time_Start": 2749.48, "Time_End": 2754.0, "Text": " I've made a multi-level aware LDAP server, which does security using mandatory access"}, {"Time_Start": 2754.0, "Time_End": 2758.1800000000003, "Text": " control as well, so you can limit access to the LDAP server based on where our users are coming"}, {"Time_Start": 2758.1800000000003, "Time_End": 2763.1800000000003, "Text": " from in a mandatory fashion. That was just a little side project for fun. Yes."}, {"Time_Start": 2763.1800000000003, "Time_End": 2771.28, "Text": " Does that mean the applications have to be trusted aware? No, absolutely not. The, what you can"}, {"Time_Start": 2771.3, "Time_End": 2775.34, "Text": " do, if you have what we call a commercial off-the-shelf program, which is a government"}, {"Time_Start": 2775.34, "Time_End": 2781.0600000000004, "Text": " way of saying just regular programs that everybody uses like me and you, you do not need to"}, {"Time_Start": 2781.0600000000004, "Time_End": 2785.54, "Text": " modify those programs. However, if they would run on a system as a regular user, they're not"}, {"Time_Start": 2785.54, "Time_End": 2791.02, "Text": " performing security-relevant functions, so you just run them as normal. However, if they would have run"}, {"Time_Start": 2791.02, "Time_End": 2795.4, "Text": " run as root normally, which means they probably were performing security-relevant functions, then what"}, {"Time_Start": 2795.4, "Time_End": 2800.5800000000004, "Text": " you need to do is look at that program and figure out what privileges it needs. Now, okay, how do you do"}, {"Time_Start": 2800.58, "Time_End": 2804.46, "Text": " that without code. Well, you can. For example, with Pitbull, we have a program that we created called"}, {"Time_Start": 2804.46, "Time_End": 2808.72, "Text": " Trace PV, which essentially analyzes the binary, the libraries that is linking against,"}, {"Time_Start": 2808.7599999999998, "Time_End": 2812.2, "Text": " and looks at all these things, and figures out what privileges it needs, and we'll set up the program"}, {"Time_Start": 2812.2, "Time_End": 2817.86, "Text": " so it'll run properly in a least privileged fashion. Trust that's a program similar to that,"}, {"Time_Start": 2817.9, "Time_End": 2821.7799999999997, "Text": " but it's much more limited. I don't think Virtual Vault has anything like that at all. I'm sorry?"}, {"Time_Start": 2822.7, "Time_End": 2823.3199999999997, "Text": " Yes, please."}, {"Time_Start": 2830.58, "Time_End": 2840.7, "Text": " Ladies and gentlemen, a couple things. Racial slurs against people who are here will not"}, {"Time_Start": 2840.7, "Time_End": 2848.7799999999997, "Text": " be tolerated. Threats against the staff, a la, I will kick your ass, or I will kill you, will not"}, {"Time_Start": 2848.7799999999997, "Time_End": 2854.98, "Text": " be tolerated. Threats against other convention goers, a la, I will kick your ass or kill you,"}, {"Time_Start": 2854.98, "Time_End": 2860.56, "Text": " will not be tolerated. There's a group of people out there who seem to think that IRC is"}, {"Time_Start": 2860.58, "Time_End": 2867.9, "Text": " real life. IRC is not real life. In real life, that is assault, and you will go to"}, {"Time_Start": 2867.9, "Time_End": 2873.54, "Text": " jail. I'm hoping some of their friends are in this room right now. I'm hoping these people"}, {"Time_Start": 2873.54, "Time_End": 2877.48, "Text": " will get to them and tell them to go away and not to come back, so I do not have to put you"}, {"Time_Start": 2877.48, "Time_End": 2883.96, "Text": " in jail. Because if I catch you, I will make sure you go to jail. I'm sorry to have to bring"}, {"Time_Start": 2883.96, "Time_End": 2888.2599999999998, "Text": " this up this way, but this will not be tolerated, and this is the third or fourth incident"}, {"Time_Start": 2888.26, "Time_End": 2892.98, "Text": " that I've heard in the last two days with this group of people. We are supposed to be"}, {"Time_Start": 2892.98, "Time_End": 2901.3, "Text": " enlightened, mature adults. Good fun and pranks is fine. Threatening to hurt someone is not fine."}, {"Time_Start": 2901.3, "Time_End": 2904.26, "Text": " Thank you very much for your time."}, {"Time_Start": 2918.26, "Time_End": 2920.7200000000003, "Text": " Yes."}, {"Time_Start": 2921.0600000000004, "Time_End": 2922.6400000000003, "Text": " What's the price on the product?"}, {"Time_Start": 2924.42, "Time_End": 2925.1200000000003, "Text": " No comment."}, {"Time_Start": 2927.2200000000003, "Time_End": 2930.5, "Text": " Actually, the pricing model"}, {"Time_Start": 2930.5, "Time_End": 2932.38, "Text": " and all that stuff has changed, and I am an engineer,"}, {"Time_Start": 2932.6200000000003, "Time_End": 2933.4, "Text": " not a salesperson."}, {"Time_Start": 2933.98, "Time_End": 2935.76, "Text": " So I hate to answer those questions."}, {"Time_Start": 2936.9, "Time_End": 2937.84, "Text": " I should say,"}, {"Time_Start": 2938.1000000000004, "Time_End": 2940.26, "Text": " and maybe I can get a round of a plus for this"}, {"Time_Start": 2940.26, "Time_End": 2940.94, "Text": " to make me feel good."}, {"Time_Start": 2941.28, "Time_End": 2942.32, "Text": " The program I mentioned before,"}, {"Time_Start": 2942.38, "Time_End": 2944.48, "Text": " the Argus Revolution program was actually put together by me."}, {"Time_Start": 2944.5600000000004, "Time_End": 2945.1600000000003, "Text": " I pushed it through."}, {"Time_Start": 2945.1600000000003, "Time_End": 2946.78, "Text": " I wanted to make the product available"}, {"Time_Start": 2946.78, "Time_End": 2947.88, "Text": " to people for free."}, {"Time_Start": 2948.26, "Time_End": 2951.34, "Text": " like me and you because it's worth us using it."}, {"Time_Start": 2951.84, "Time_End": 2952.5800000000004, "Text": " So that's it."}, {"Time_Start": 2952.94, "Time_End": 2953.2000000000003, "Text": " All right."}, {"Time_Start": 2954.5800000000004, "Time_End": 2955.0200000000004, "Text": " Thanks."}]}