{"segments": [{"Time_Start": 0.0, "Time_End": 25.88, "Text": " Hiya, well, I'm going to talk really fast because if I talk really fast and I can get done almost at the time when I was supposed to be done. So if I talk too fast, you just have to raise your hand and say you're going too fast and then I'll slow down."}, {"Time_Start": 25.88, "Time_End": 28.04, "Text": " I'm going to pass."}, {"Time_Start": 28.439999999999998, "Time_End": 28.64, "Text": " Okay."}, {"Time_Start": 29.06, "Time_End": 31.759999999999998, "Text": " As pre-said, I'm with IBM's Thomas J. Wesson Research Center,"}, {"Time_Start": 31.919999999999998, "Time_End": 34.04, "Text": " what the date is today?"}, {"Time_Start": 35.5, "Time_End": 36.32, "Text": " Is it 30th?"}, {"Time_Start": 36.56, "Time_End": 38.12, "Text": " Okay, tomorrow's my last day there."}, {"Time_Start": 38.56, "Time_End": 41.36, "Text": " So today I'm representing them here to you with this research."}, {"Time_Start": 41.74, "Time_End": 44.56, "Text": " And after tomorrow, then I won't be representing them with this research."}, {"Time_Start": 44.66, "Time_End": 49.519999999999996, "Text": " But this research will still be published on behalf of them when the rest of the research is done."}, {"Time_Start": 49.66, "Time_End": 52.04, "Text": " So anyway, I'm there at the..."}, {"Time_Start": 52.04, "Time_End": 54.14, "Text": " I don't know when my new job is yet, and haven't decided."}, {"Time_Start": 54.14, "Time_End": 58.64, "Text": " Basically, I've been coming to DefCon since the second, DefCon."}, {"Time_Start": 59.64, "Time_End": 61.02, "Text": " I will slow down, thank you."}, {"Time_Start": 61.480000000000004, "Time_End": 65.34, "Text": " And I'm here to talk today about something that I just called The End of Innocence"}, {"Time_Start": 65.34, "Time_End": 69.44, "Text": " because there have been a lot of changes in the house seen with computer viruses since I've started coming to DefCon."}, {"Time_Start": 69.68, "Time_End": 73.9, "Text": " I also have this shirt, which I was going to wear, which the codebreakers guys gave me."}, {"Time_Start": 73.94, "Time_End": 76.58, "Text": " So since I can't wear it, I'll show it to you and you can pretend I'm wearing it."}, {"Time_Start": 77.88, "Time_End": 79.64, "Text": " The front of it says codebreakers."}, {"Time_Start": 81.64, "Time_End": 83.76, "Text": " The back of it says Justice for Dave."}, {"Time_Start": 84.14, "Time_End": 91.74, "Text": " This is Dave Smith, who says he wrote the Melissa virus, who's facing a long jail time and a lot of big fine."}, {"Time_Start": 92.0, "Time_End": 94.42, "Text": " And I'm going to talk about that toward the end of this presentation,"}, {"Time_Start": 94.92, "Time_End": 100.08, "Text": " because this presentation is kind of about what is justice in a society where we don't really know the impact of our actions"}, {"Time_Start": 100.08, "Time_End": 102.06, "Text": " on our really widely distributed systems."}, {"Time_Start": 102.72, "Time_End": 107.08, "Text": " What made me start doing this research now was I started reading things in the newspaper and in magazines."}, {"Time_Start": 107.52, "Time_End": 108.88, "Text": " And this stuff really makes me nuts."}, {"Time_Start": 108.88, "Time_End": 114.02, "Text": " I read this quote, which said, this case, the company says, and I won't name the company here,"}, {"Time_Start": 114.14, "Time_End": 115.14, "Text": " but I will be in the paper."}, {"Time_Start": 115.46, "Time_End": 120.42, "Text": " Proves that virus writing, that means writing the virus, is indeed illegal, despite arguments"}, {"Time_Start": 120.42, "Time_End": 120.98, "Text": " in the contrary."}, {"Time_Start": 121.42, "Time_End": 124.6, "Text": " Now, I don't know about you guys, but when I see somebody telling me it's illegal to write something"}, {"Time_Start": 124.6, "Time_End": 129.18, "Text": " on my own computer and my own home, and it is indeed illegal despite what other people say,"}, {"Time_Start": 129.78, "Time_End": 133.5, "Text": " that kind of worries me when people start thinking that what I write on my own computer"}, {"Time_Start": 133.5, "Time_End": 135.7, "Text": " is any of their business, really."}, {"Time_Start": 136.22, "Time_End": 141.12, "Text": " I get more nuts when I read things like this prosecution, that prosecution being that of David L. Smith,"}, {"Time_Start": 141.48, "Time_End": 144.12, "Text": " would be a decisive event that will tend to reduce the relentless."}, {"Time_Start": 144.14000000000001, "Time_End": 148.70000000000002, "Text": " increasing threat and resulting to risk of computer viruses to society of a whole."}, {"Time_Start": 149.10000000000002, "Time_End": 150.92000000000002, "Text": " I read the statement like, what is based on?"}, {"Time_Start": 151.08, "Time_End": 155.5, "Text": " How do we know that this prosecution is going to really reduce the increasing threat?"}, {"Time_Start": 155.68, "Time_End": 163.62, "Text": " Had there been any scientific research to show whether these types of arrests and prosecutions in the past have caused any reduction in the risk?"}, {"Time_Start": 164.26000000000002, "Time_End": 172.66000000000003, "Text": " Finally, while you get the idea, when I read by locking up the perpetrators, the cycle of mounting numbers, rate and violence of viruses will get a pause and reversal."}, {"Time_Start": 172.66000000000003, "Time_End": 173.78000000000003, "Text": " What's that based on?"}, {"Time_Start": 174.14000000000001, "Time_End": 175.16000000000003, "Text": " Is that really true?"}, {"Time_Start": 175.50000000000003, "Time_End": 179.34, "Text": " So I thought, well, I'm going to take a look at what's happened in the past 10 years or so with computer viruses,"}, {"Time_Start": 179.64000000000001, "Time_End": 183.58, "Text": " and I'm going to see if there's any scientific evidence that would support the premise,"}, {"Time_Start": 183.82000000000002, "Time_End": 188.64000000000001, "Text": " that by doing this thing, we're actually spending money wisely, and this is really going to cause a decrease in the problem."}, {"Time_Start": 189.72000000000003, "Time_End": 191.56, "Text": " A little bit about why I got involved with this."}, {"Time_Start": 191.8, "Time_End": 198.26000000000002, "Text": " Back in 1985 to about 1991, mostly I was interested in DOS and LS9, which was a Tandy Coco thing,"}, {"Time_Start": 198.56, "Time_End": 202.36, "Text": " and Unix systems, and it was a whole lot of fun, and I got a PC complete with the virus,"}, {"Time_Start": 202.36, "Time_End": 203.84, "Text": " and that was not quite so much fun."}, {"Time_Start": 204.14000000000001, "Time_End": 206.3, "Text": " None of my friends could help me when I got the virus."}, {"Time_Start": 206.50000000000003, "Time_End": 209.38000000000002, "Text": " I suppose that should say none of my hacker friends could help me with viruses,"}, {"Time_Start": 209.52, "Time_End": 212.08, "Text": " because the two worlds are pretty far apart, packing and virus writing."}, {"Time_Start": 212.70000000000002, "Time_End": 218.0, "Text": " So I sought out to help with people who knew about computer viruses, and this would be antivirus people and virus writers."}, {"Time_Start": 218.26000000000002, "Time_End": 219.98000000000002, "Text": " And that's where all my troubles started."}, {"Time_Start": 220.12, "Time_End": 222.04000000000002, "Text": " That's where it all started going kind of crazy."}, {"Time_Start": 222.94000000000003, "Time_End": 230.02, "Text": " As I started talking to the virus writers, I realized that the good guys were saying that the bad guys were bad."}, {"Time_Start": 230.96, "Time_End": 234.12, "Text": " But the bad guys that I was talking to didn't act bad, and I should."}, {"Time_Start": 234.14000000000001, "Time_End": 237.98000000000002, "Text": " know because I talked to hundreds of them, but they weren't acting, you know, bad."}, {"Time_Start": 238.10000000000002, "Time_End": 240.46, "Text": " To me, in fact, they were being quite helpful, pleasant and polite."}, {"Time_Start": 241.74, "Time_End": 243.52, "Text": " So I thought, let's do some science about this."}, {"Time_Start": 243.64000000000001, "Time_End": 247.3, "Text": " So I did the science to find out exactly if these guys were all bad."}, {"Time_Start": 247.84, "Time_End": 253.74, "Text": " And the paper got accepted by an organization called Virus Bulletin, which is a magazine that talks specifically about viruses."}, {"Time_Start": 253.9, "Time_End": 256.78000000000003, "Text": " Their website is www.virusbtn.com."}, {"Time_Start": 256.78000000000003, "Time_End": 258.98, "Text": " They're very, very good for information about viruses."}, {"Time_Start": 259.84000000000003, "Time_End": 262.38, "Text": " And the AV guys did not like the results of this study."}, {"Time_Start": 262.72, "Time_End": 264.12, "Text": " They did not like it at all."}, {"Time_Start": 264.14, "Time_End": 270.59999999999997, "Text": " all because it said that the virus writers were actually not all evil, malicious, unethical,"}, {"Time_Start": 270.74, "Time_End": 273.41999999999996, "Text": " antisocial, couldn't get a date if their life depended on its scum."}, {"Time_Start": 276.12, "Time_End": 280.78, "Text": " So there I was, you know, with all these people in the antivirus world, and there I was saying,"}, {"Time_Start": 280.82, "Time_End": 281.91999999999996, "Text": " you know, you guys are wrong."}, {"Time_Start": 282.15999999999997, "Time_End": 285.02, "Text": " And I was one of this kind of outcast that Richard was talking about earlier."}, {"Time_Start": 285.32, "Time_End": 286.91999999999996, "Text": " I kept saying this, you know, you guys are wrong."}, {"Time_Start": 286.96, "Time_End": 287.9, "Text": " These people are not scum."}, {"Time_Start": 287.96, "Time_End": 289.06, "Text": " They're not all sociopaths."}, {"Time_Start": 289.26, "Time_End": 290.08, "Text": " This is not true."}, {"Time_Start": 290.34, "Time_End": 292.38, "Text": " And they kept saying, yeah, well, you're just as bad as them."}, {"Time_Start": 292.38, "Time_End": 293.64, "Text": " But I kept saying the truth."}, {"Time_Start": 294.14, "Time_End": 299.38, "Text": " And the truth was that these guys were mostly guys with good social lives, mostly guys that"}, {"Time_Start": 299.38, "Time_End": 303.06, "Text": " had good relationships with women, mostly some really good, some not so good, just like everybody"}, {"Time_Start": 303.06, "Time_End": 308.68, "Text": " else, guys who had good relationships with their parents, guys who helped in social and community"}, {"Time_Start": 308.68, "Time_End": 314.03999999999996, "Text": " projects, sometimes pretty cool guys, although a few of them are pretty not cool guys, but very rarely"}, {"Time_Start": 314.03999999999996, "Time_End": 314.64, "Text": " are they not cool?"}, {"Time_Start": 314.64, "Time_End": 317.3, "Text": " And they were within what we call ethical norms for the ages."}, {"Time_Start": 317.3, "Time_End": 319.76, "Text": " And they say, well, what's that, ethical norm stuff?"}, {"Time_Start": 319.76, "Time_End": 324.12, "Text": " Basically that's how we describe in the science world of how people are not."}, {"Time_Start": 324.14, "Time_End": 327.44, "Text": " make decisions. You know, babies reason differently than kids, and they reason differently than"}, {"Time_Start": 327.44, "Time_End": 329.9, "Text": " preteens, and they reason differently than teens, and blah, blah, blah, blah, blah."}, {"Time_Start": 330.53999999999996, "Time_End": 334.26, "Text": " And to find out how people think, we give them a series of ethical dilemmas they have to solve,"}, {"Time_Start": 334.3, "Time_End": 338.9, "Text": " and they say, well, we think this, and here's why. And series of tests with numbers, you know, how many"}, {"Time_Start": 338.9, "Time_End": 342.58, "Text": " different ways can you shape four colors, how many plates if you spin them on the end of rings"}, {"Time_Start": 342.58, "Time_End": 346.71999999999997, "Text": " to this and that. They take these tests and you see where they rank on these scales, and there"}, {"Time_Start": 346.71999999999997, "Time_End": 352.59999999999997, "Text": " are norms for these. By ethically normal, what that means, in case of virus writers, is that they may come"}, {"Time_Start": 352.59999999999997, "Time_End": 353.94, "Text": " into this virus writing, where it says, and they may come into this virus writing where it says,"}, {"Time_Start": 354.14, "Time_End": 358.4, "Text": " here. They participate in the community for a while. They have interactions with other people"}, {"Time_Start": 358.4, "Time_End": 362.88, "Text": " who write computer viruses. They reconsider what they're doing, and they age out. They begin"}, {"Time_Start": 362.88, "Time_End": 366.59999999999997, "Text": " to act like the older people who are going out. New people are coming in all the time cycling"}, {"Time_Start": 366.59999999999997, "Time_End": 370.64, "Text": " and write a few viruses. Some people stay, mostly just a big cycle going around and round and around."}, {"Time_Start": 371.3, "Time_End": 376.5, "Text": " Now, if this was true, somebody who was at level one, two years later would be at level two. The next"}, {"Time_Start": 376.5, "Time_End": 379.94, "Text": " year would be at level three. The next year would be at level four. And we will watch all of these"}, {"Time_Start": 379.94, "Time_End": 384.08, "Text": " virus riders. I talked to some probably 80 or so of them. We would watch them progress up"}, {"Time_Start": 384.14, "Time_End": 388.3, "Text": " stages and how their cognitive reasoning abilities changed. So this was a long study,"}, {"Time_Start": 388.68, "Time_End": 394.58, "Text": " which I did for a long period of time. And finally, we saw, indeed, they were going right up to scale."}, {"Time_Start": 394.76, "Time_End": 398.68, "Text": " There were only a couple of exceptions, adults that did not age out, and they tend to drift"}, {"Time_Start": 398.68, "Time_End": 403.38, "Text": " often to other more criminal activity instead of just writing computer viruses. Now, what was next?"}, {"Time_Start": 403.9, "Time_End": 407.02, "Text": " I thought, well, this is pretty interesting stuff. The press really liked it because we were saying"}, {"Time_Start": 407.02, "Time_End": 411.36, "Text": " that some of the stereotypes weren't very true, and things need to be reconsidered. And we saw that"}, {"Time_Start": 411.36, "Time_End": 413.96, "Text": " operating systems were becoming more common."}, {"Time_Start": 414.14, "Time_End": 417.94, "Text": " know, more one type. Connectivity was coming everywhere. So the old places where"}, {"Time_Start": 417.94, "Time_End": 422.58, "Text": " viruses used to come from, or where people said they came from, began to shift around. There"}, {"Time_Start": 422.58, "Time_End": 426.34, "Text": " was a shift in the zones going from, you know, people were looking at Eastern Block because they"}, {"Time_Start": 426.34, "Time_End": 429.82, "Text": " had connectivity. Then it was America. Then it was Canada. Then it was Australia. Now it's"}, {"Time_Start": 429.82, "Time_End": 433.86, "Text": " Indonesia. Where the viruses were coming from was changing. In fact, basically, every place the"}, {"Time_Start": 433.86, "Time_End": 437.88, "Text": " internet came to, the viruses came from. So I don't think that's any, you know, big hard rocket"}, {"Time_Start": 437.88, "Time_End": 441.76, "Text": " science there. It makes pretty much sense to me when you got a computer and you got connectivity"}, {"Time_Start": 441.76, "Time_End": 444.12, "Text": " and you got people talking about things. They're going to talk about things. They're going to"}, {"Time_Start": 444.14, "Time_End": 449.03999999999996, "Text": " do things. That's just how it is. But people, the reason they did this, it was still the same. People"}, {"Time_Start": 449.03999999999996, "Time_End": 453.14, "Text": " were curious. They wanted to do what they called research. And they were making political and social"}, {"Time_Start": 453.14, "Time_End": 458.59999999999997, "Text": " statements in some cases. Vactivism, not hacktivism, V because of virus. It wasn't just about technical"}, {"Time_Start": 458.59999999999997, "Time_End": 463.03999999999996, "Text": " stuff. And this is the stuff that really interested me the most. There were some very mixed messages"}, {"Time_Start": 463.03999999999996, "Time_End": 470.5, "Text": " from the media. I mean, when you open the press from maybe 1992, 93, 94, 95, 96, when you read about"}, {"Time_Start": 470.5, "Time_End": 473.56, "Text": " virus bodies, you read about, oh, they're real renegades. They're really bad guys. And they're really bad guys."}, {"Time_Start": 474.14, "Time_End": 476.78, "Text": " And, you know, women, you like bad guys."}, {"Time_Start": 476.94, "Time_End": 479.08, "Text": " They're like bad boys. So virus writers are bad boys."}, {"Time_Start": 479.14, "Time_End": 481.64, "Text": " Let's be a virus writer. We're a bad boy. You know, and we're cool."}, {"Time_Start": 482.24, "Time_End": 485.02, "Text": " And the media kind of promoted that, that it was a cool thing to do."}, {"Time_Start": 486.06, "Time_End": 488.78, "Text": " They also promoted the idea that viruses were incredibly compact."}, {"Time_Start": 488.94, "Time_End": 490.62, "Text": " She had to be a real genius to write a virus."}, {"Time_Start": 490.9, "Time_End": 493.28, "Text": " Well, I could sit here and write one for you in about less than two minutes."}, {"Time_Start": 493.68, "Time_End": 497.96, "Text": " This guy over here that wasn't a Fed could write one for you in about 30 seconds."}, {"Time_Start": 498.38, "Time_End": 501.94, "Text": " There are some people, as I look out that I saw earlier who could write them for you"}, {"Time_Start": 501.94, "Time_End": 504.12, "Text": " and are pretty complex viruses in a pretty."}, {"Time_Start": 504.14, "Time_End": 507.0, "Text": " short amount of time, but it doesn't take a rocket science to be able to do it."}, {"Time_Start": 507.34, "Time_End": 509.02, "Text": " Although, in some cases, a little more complex."}, {"Time_Start": 509.09999999999997, "Time_End": 511.02, "Text": " But you don't have to be a genius to write most of this stuff."}, {"Time_Start": 511.09999999999997, "Time_End": 513.02, "Text": " You know, you just take some, write some macro commands."}, {"Time_Start": 513.06, "Time_End": 515.24, "Text": " It's really easy if you could get the, well, I'll never mean how to do it."}, {"Time_Start": 515.3, "Time_End": 515.78, "Text": " You can't do that."}, {"Time_Start": 516.58, "Time_End": 519.0, "Text": " In some cases, it was taunting from the antivirus community."}, {"Time_Start": 519.26, "Time_End": 523.56, "Text": " I mean, let me ask you, if I go up to you and say, you know, you guys, you guys are so stupid."}, {"Time_Start": 524.0, "Time_End": 526.64, "Text": " You couldn't raise your left hand if your life depended on it."}, {"Time_Start": 527.18, "Time_End": 529.22, "Text": " You know, I'm going to start seeing these left hands go up like there."}, {"Time_Start": 529.22, "Time_End": 532.34, "Text": " So when you see some guys going out saying, you know, the virus riders obviously"}, {"Time_Start": 532.34, "Time_End": 534.08, "Text": " are too stupid to know how to use."}, {"Time_Start": 534.14, "Time_End": 537.14, "Text": " blah, blah, blah. The next thing we see is viruses that do blah, blah, blah."}, {"Time_Start": 537.76, "Time_End": 541.9, "Text": " There are also some technical papers written, which, in my opinion, more like how-to guides for how to"}, {"Time_Start": 541.9, "Time_End": 546.84, "Text": " write certain kinds of viruses, which means that virus writing tended to appear to be just a little"}, {"Time_Start": 546.84, "Time_End": 551.56, "Text": " bit less wrong to people. It appeared to be just a little bit cooler than it probably actually is,"}, {"Time_Start": 551.98, "Time_End": 555.36, "Text": " which means young people weren't aging out, so we're seeing more virus riders and they're getting"}, {"Time_Start": 555.36, "Time_End": 560.58, "Text": " older. And because they don't age out, older people, people in corporations, just playing around"}, {"Time_Start": 560.58, "Time_End": 563.68, "Text": " doing what they think are some tests, which usually aren't very good tests and don't really help them,"}, {"Time_Start": 563.6800000000001, "Time_End": 565.2, "Text": " but people do like to play with computers."}, {"Time_Start": 565.7, "Time_End": 567.6, "Text": " Pretty soon they're calling somebody to help them out of a jam."}, {"Time_Start": 567.6800000000001, "Time_End": 572.86, "Text": " They say, oh, you know, I got this virus, and I altered it and edit, and it's a macrovirus,"}, {"Time_Start": 573.0200000000001, "Time_End": 575.8800000000001, "Text": " and now it's spread throughout my company, and my antivirus software doesn't detect it."}, {"Time_Start": 575.8800000000001, "Time_End": 576.7, "Text": " Can you please help me?"}, {"Time_Start": 577.1800000000001, "Time_End": 580.94, "Text": " So, you know, this kind of created a few problems, and they're often calling me, and I really need"}, {"Time_Start": 580.94, "Time_End": 581.3000000000001, "Text": " some sleep."}, {"Time_Start": 581.4000000000001, "Time_End": 582.7, "Text": " I haven't had any really for three days."}, {"Time_Start": 582.7800000000001, "Time_End": 584.6800000000001, "Text": " So if you're thinking about doing this tonight, please don't."}, {"Time_Start": 584.7, "Time_End": 585.58, "Text": " And if you do, don't call me."}, {"Time_Start": 586.0200000000001, "Time_End": 590.6200000000001, "Text": " But there are two viruses in particular that came to attention, Melissa and C-I-H."}, {"Time_Start": 590.6200000000001, "Time_End": 593.2, "Text": " Is there anybody here who doesn't know Melissa virus?"}, {"Time_Start": 593.6800000000001, "Time_End": 594.98, "Text": " My C-I-H virus."}, {"Time_Start": 595.7, "Time_End": 595.94, "Text": " Okay."}, {"Time_Start": 596.1, "Time_End": 597.3000000000001, "Text": " These are, I like the scripts."}, {"Time_Start": 597.5000000000001, "Time_End": 599.36, "Text": " I tried to make them look kind of like the virus."}, {"Time_Start": 599.46, "Time_End": 602.32, "Text": " And Melissa, you're like a girl in C-I-H, kind of orientalish."}, {"Time_Start": 602.3800000000001, "Time_End": 603.4200000000001, "Text": " That was my creativity."}, {"Time_Start": 603.86, "Time_End": 607.1200000000001, "Text": " Well, there's a real mixed message about this whole situation,"}, {"Time_Start": 607.5400000000001, "Time_End": 610.5000000000001, "Text": " which is why this T-shirt, this Justice for Day shirt, which I am going to wear,"}, {"Time_Start": 610.5400000000001, "Time_End": 613.1, "Text": " but when I tried it on you guys, it's going to itchy, so I've got to watch it first."}, {"Time_Start": 613.5400000000001, "Time_End": 616.8000000000001, "Text": " The Melissa author, David Smith, and you can read about him, lots of places on Internet,"}, {"Time_Start": 617.2600000000001, "Time_End": 623.32, "Text": " is awaiting a really long sentence and looking at really huge fines for the virus that he admits to writing."}, {"Time_Start": 623.6800000000001, "Time_End": 630.6800000000001, "Text": " But when you read reports of the C.I.H. author, which virus was much more destructive."}, {"Time_Start": 630.6800000000001, "Time_End": 634.6800000000001, "Text": " He got a polite slap on the wrist. He got a good job."}, {"Time_Start": 634.6800000000001, "Time_End": 639.6800000000001, "Text": " And there are press releases saying he's an absolutely brilliant above-average programmer."}, {"Time_Start": 639.6800000000001, "Time_End": 642.6800000000001, "Text": " Now, this is a real mixed message and a real double standard."}, {"Time_Start": 642.6800000000001, "Time_End": 646.6800000000001, "Text": " And it kind of says to me that in our whole virtual society and community as a whole,"}, {"Time_Start": 646.6800000000001, "Time_End": 649.6800000000001, "Text": " we don't really know what we think about this kind of stuff."}, {"Time_Start": 649.6800000000001, "Time_End": 652.6800000000001, "Text": " And people are getting some real mixed messages."}, {"Time_Start": 652.6800000000001, "Time_End": 656.6800000000001, "Text": " There are lots of people running scared because of all those times."}, {"Time_Start": 656.6800000000001, "Time_End": 660.6800000000001, "Text": " Viruses are causing, you know, depending on who you talk to anywhere from $17,000 damage to"}, {"Time_Start": 660.6800000000001, "Time_End": 663.6800000000001, "Text": " to trillions and billions, gazillions of dollars of damages."}, {"Time_Start": 663.6800000000001, "Time_End": 664.6800000000001, "Text": " People are running scared."}, {"Time_Start": 664.6800000000001, "Time_End": 667.6800000000001, "Text": " And when people run scared, do you know what the solution is that they look to"}, {"Time_Start": 667.6800000000001, "Time_End": 670.6800000000001, "Text": " when they get really, really scared and they don't know what else to do?"}, {"Time_Start": 670.6800000000001, "Time_End": 671.6800000000001, "Text": " Not the bottle."}, {"Time_Start": 671.6800000000001, "Time_End": 672.6800000000001, "Text": " No, close."}, {"Time_Start": 672.6800000000001, "Time_End": 675.6800000000001, "Text": " Maybe they should be going for the bottle."}, {"Time_Start": 675.6800000000001, "Time_End": 677.6800000000001, "Text": " Because their solution is lost."}, {"Time_Start": 677.6800000000001, "Time_End": 682.6600000000001, "Text": " In this case, you get this case to come and he says, virus writing is"}, {"Time_Start": 682.6800000000001, "Time_End": 683.6800000000001, "Text": " it's illegal."}, {"Time_Start": 683.6800000000001, "Time_End": 688.5000000000001, "Text": " The prosecution will be an event that will reduce virus writing by locking people up."}, {"Time_Start": 688.5000000000001, "Time_End": 690.6200000000001, "Text": " It's going to solve the problem."}, {"Time_Start": 690.6200000000001, "Time_End": 695.08, "Text": " Now this is actually naming this only because I just took this quote before I came, making a bomb"}, {"Time_Start": 695.08, "Time_End": 697.58, "Text": " is illegal but writing about how to make a bomb is not."}, {"Time_Start": 697.58, "Time_End": 699.98, "Text": " But what's a computer virus, the words are the bomb."}, {"Time_Start": 699.98, "Time_End": 704.3800000000001, "Text": " And here we have someone on Usenet, and I've got the URLs so I could give them to you, to look"}, {"Time_Start": 704.3800000000001, "Time_End": 708.1800000000001, "Text": " up, suggesting that Congress look at making it illegal to write a computer virus."}, {"Time_Start": 708.1800000000001, "Time_End": 711.98, "Text": " And I thought, well, you know, how do we know that's really going to solve the problem?"}, {"Time_Start": 711.98, "Time_End": 712.58, "Text": " How are you going to force that?"}, {"Time_Start": 712.6800000000001, "Time_End": 716.44, "Text": " anyway. And there's another fellow, Michigabelle, who actually is a good friend of mine,"}, {"Time_Start": 716.44, "Time_End": 720.24, "Text": " suggests that programs actually aren't speech and therefore shouldn't be protected. So we have"}, {"Time_Start": 720.24, "Time_End": 725.6800000000001, "Text": " some pretty complex issues and pretty high-power people pushing for ideas that may not have"}, {"Time_Start": 725.6800000000001, "Time_End": 729.9200000000001, "Text": " the best long-term effect. When look at viruses in the world wide web, we have people"}, {"Time_Start": 729.9200000000001, "Time_End": 733.36, "Text": " saying got to get rid of them, got to get rid of them all, it's irresponsible, ISPs shouldn't"}, {"Time_Start": 733.36, "Time_End": 737.36, "Text": " let them up there, people want to make it illegal. But how do you know when something"}, {"Time_Start": 737.36, "Time_End": 740.9200000000001, "Text": " becomes bad? I mean, at what point in the cycle of thinking about virus, hurting somebody with"}, {"Time_Start": 740.9200000000001, "Time_End": 742.0400000000001, "Text": " virus, does it become bad?"}, {"Time_Start": 742.6800000000001, "Time_End": 743.6800000000001, "Text": " Malice?"}, {"Time_Start": 743.6800000000001, "Time_End": 747.6800000000001, "Text": " Malice is a subjective judgment, isn't it?"}, {"Time_Start": 747.6800000000001, "Time_End": 751.6800000000001, "Text": " Intentional, making of damage to someone else?"}, {"Time_Start": 751.6800000000001, "Time_End": 755.6800000000001, "Text": " Intent intentional. Intent's kind of a hard thing to prove when you're looking at code."}, {"Time_Start": 755.6800000000001, "Time_End": 760.6800000000001, "Text": " I could write a virus right here and give it to him on a disk and I have no intent to harm anyone."}, {"Time_Start": 760.6800000000001, "Time_End": 763.6800000000001, "Text": " So if all you have this a program to look at, how can you tell what the intent is?"}, {"Time_Start": 763.6800000000001, "Time_End": 767.6800000000001, "Text": " Now, even if it says, you know, this is a bad thing meant to harm, it may just be a demonstration."}, {"Time_Start": 767.6800000000001, "Time_End": 770.6800000000001, "Text": " But do we know the impact of this potential law?"}, {"Time_Start": 770.6800000000001, "Time_End": 771.6800000000001, "Text": " I mean, how much have we actually looked at it?"}, {"Time_Start": 771.6800000000001, "Time_End": 772.6800000000001, "Text": " How much of we actually looked at it?"}, {"Time_Start": 772.6800000000001, "Time_End": 774.6800000000001, "Text": " So let's say we're going to go through a series of things."}, {"Time_Start": 774.6800000000001, "Time_End": 775.6800000000001, "Text": " I did a surveyor."}, {"Time_Start": 775.6800000000001, "Time_End": 776.6800000000001, "Text": " I had a bad thought."}, {"Time_Start": 776.6800000000001, "Time_End": 777.6800000000001, "Text": " Is that wrong if you have a bad thought?"}, {"Time_Start": 777.6800000000001, "Time_End": 780.6800000000001, "Text": " And it's probably, you think it's wrong if you have a bad thought?"}, {"Time_Start": 780.6800000000001, "Time_End": 781.6800000000001, "Text": " Okay."}, {"Time_Start": 781.6800000000001, "Time_End": 782.6800000000001, "Text": " Close your eyes."}, {"Time_Start": 782.6800000000001, "Time_End": 783.6800000000001, "Text": " Okay, it's a down thing."}, {"Time_Start": 783.6800000000001, "Time_End": 784.6800000000001, "Text": " He's a bad thing."}, {"Time_Start": 784.6800000000001, "Time_End": 785.6800000000001, "Text": " Again, what's over a man think it's in his heart?"}, {"Time_Start": 785.6800000000001, "Time_End": 786.6800000000001, "Text": " There he does."}, {"Time_Start": 786.6800000000001, "Time_End": 787.6800000000001, "Text": " So you had a bad thought."}, {"Time_Start": 787.6800000000001, "Time_End": 788.6800000000001, "Text": " What if you told it to your friend?"}, {"Time_Start": 788.6800000000001, "Time_End": 789.6800000000001, "Text": " Is it bad then?"}, {"Time_Start": 789.6800000000001, "Time_End": 791.6800000000001, "Text": " What if you wrote it down on your computer?"}, {"Time_Start": 791.6800000000001, "Time_End": 792.6800000000001, "Text": " Is it bad then?"}, {"Time_Start": 792.6800000000001, "Time_End": 794.6800000000001, "Text": " What if you did it for a class project?"}, {"Time_Start": 794.6800000000001, "Time_End": 795.6800000000001, "Text": " These are all the same things you're writing."}, {"Time_Start": 795.6800000000001, "Time_End": 797.6800000000001, "Text": " It's where you write it, make it a bad thing?"}, {"Time_Start": 797.6800000000001, "Time_End": 802.1800000000001, "Text": " How about if you put it up on your website labeled as a virus so your friends can take a look?"}, {"Time_Start": 802.1800000000001, "Time_End": 803.1800000000001, "Text": " Is that bad?"}, {"Time_Start": 803.1800000000001, "Time_End": 808.1800000000001, "Text": " How about if you label it as a really cool nifty disc utility so the unsuspecting won't get it and hurt themselves?"}, {"Time_Start": 808.1800000000001, "Time_End": 809.1800000000001, "Text": " Is that bad?"}, {"Time_Start": 809.1800000000001, "Time_End": 811.1800000000001, "Text": " Or maybe they shouldn't be on your website to begin with?"}, {"Time_Start": 811.1800000000001, "Time_End": 813.6800000000001, "Text": " How about if you password protect it when you put it up there?"}, {"Time_Start": 813.6800000000001, "Time_End": 816.1800000000001, "Text": " Is that bad?"}, {"Time_Start": 816.1800000000001, "Time_End": 820.1800000000001, "Text": " I decided that what I would do is I would ask people here what they thought about what is bad,"}, {"Time_Start": 820.1800000000001, "Time_End": 823.6800000000001, "Text": " what is as far as writing a virus, and what the impact of this law would be."}, {"Time_Start": 823.6800000000001, "Time_End": 827.6800000000001, "Text": " So in order to do this and have it be something that would be scientifically valid so people would take it"}, {"Time_Start": 827.6800000000001, "Time_End": 831.6800000000001, "Text": " seriously, whether than me just asking a bunch of questions of a bunch of people at a conference."}, {"Time_Start": 831.6800000000001, "Time_End": 835.6800000000001, "Text": " Had to choose a target population, this seemed like a good one, people who are pre-open."}, {"Time_Start": 835.6800000000001, "Time_End": 839.6800000000001, "Text": " Had to get a number of responses in a sample set that would give me statistically relevant data so that when I published it,"}, {"Time_Start": 839.6800000000001, "Time_End": 843.6800000000001, "Text": " anybody who looks at it from a scientific angle, it's all, well, this certainly is statistically significant,"}, {"Time_Start": 843.6800000000001, "Time_End": 845.6800000000001, "Text": " we need to take a serious look at this."}, {"Time_Start": 845.6800000000001, "Time_End": 849.6800000000001, "Text": " I need to make sure the samples were chosen randomly so that I didn't get three people who are all together"}, {"Time_Start": 849.6800000000001, "Time_End": 853.6800000000001, "Text": " so they're all right to think the same way, so we're grabbing people every so often as they come in."}, {"Time_Start": 853.6800000000001, "Time_End": 855.6800000000001, "Text": " And I've done all that now, taking this survey data."}, {"Time_Start": 855.6800000000001, "Time_End": 857.6800000000001, "Text": " I still have to do an analysis."}, {"Time_Start": 857.6800000000001, "Time_End": 867.6800000000001, "Text": " a statistical tool and I'll probably use some sort of analysis of covariance and have to interpret the data, which I haven't had time to do yet, and I'll do that before this virus bullet conference in September."}, {"Time_Start": 867.6800000000001, "Time_End": 871.6800000000001, "Text": " We have some interesting questions, and here are the questions that we asked."}, {"Time_Start": 871.6800000000001, "Time_End": 879.6800000000001, "Text": " We said, if it were to become illegal to write self-replicating code, would you be less likely to do it, makes no difference, or more likely to do it?"}, {"Time_Start": 879.6800000000001, "Time_End": 886.6800000000001, "Text": " And so we get some really interesting responses, which I won't go into now, but I'll publish them in just a little bit."}, {"Time_Start": 886.6800000000001, "Time_End": 890.6800000000001, "Text": " in just a little bit. And how far would you go? Very popular question here at DEFCOM."}, {"Time_Start": 890.6800000000001, "Time_End": 897.6800000000001, "Text": " Is thinking about writing a virus your limit of tolerance? Is talking about a virus your limit of tolerance?"}, {"Time_Start": 897.6800000000001, "Time_End": 901.6800000000001, "Text": " Is riding a virus your limit? How about if you let it escape accidentally?"}, {"Time_Start": 901.6800000000001, "Time_End": 906.6800000000001, "Text": " How about if you give it to friends? Interestingly enough, more people thought letting a virus"}, {"Time_Start": 906.6800000000001, "Time_End": 911.6800000000001, "Text": " escape accidentally was like the worst thing you could do, it was far worse than, you know, than anything."}, {"Time_Start": 911.6800000000001, "Time_End": 915.6800000000001, "Text": " That being stupid is worse than being malicious. And that was very interesting to read the comments."}, {"Time_Start": 915.6800000000001, "Time_End": 917.6800000000001, "Text": " to read the comments on that."}, {"Time_Start": 921.6800000000001, "Time_End": 923.6800000000001, "Text": " It's putting it up on a site clearly labeled."}, {"Time_Start": 923.6800000000001, "Time_End": 927.6800000000001, "Text": " And I was actually quite surprised because several years ago when I,"}, {"Time_Start": 927.6800000000001, "Time_End": 929.6800000000001, "Text": " I think it was last year when we did the panel hand viruses,"}, {"Time_Start": 929.6800000000001, "Time_End": 932.6800000000001, "Text": " I asked how many people thought it was okay to put a virus up on a VX site,"}, {"Time_Start": 932.6800000000001, "Time_End": 934.6800000000001, "Text": " clearly labeled, and a lot of people did."}, {"Time_Start": 934.6800000000001, "Time_End": 938.6800000000001, "Text": " But as we started sampling people, many, many more people than last year"}, {"Time_Start": 938.6800000000001, "Time_End": 940.6800000000001, "Text": " thought that putting it up, even clearly labeled,"}, {"Time_Start": 940.6800000000001, "Time_End": 942.6800000000001, "Text": " was probably irresponsible, and maybe not a good idea."}, {"Time_Start": 942.6800000000001, "Time_End": 945.6800000000001, "Text": " Putting a virus on use on that label as a YouTube,"}, {"Time_Start": 945.6800000000001, "Time_End": 948.6800000000001, "Text": " say sexy.exe or you look at me.com or whatever,"}, {"Time_Start": 948.6800000000001, "Time_End": 951.6800000000001, "Text": " and using it to mess up someone's computer really bad."}, {"Time_Start": 951.6800000000001, "Time_End": 953.6800000000001, "Text": " So these are the questions that we ask."}, {"Time_Start": 953.6800000000001, "Time_End": 956.6800000000001, "Text": " And what we're going to do, as I started looking at this data,"}, {"Time_Start": 956.6800000000001, "Time_End": 958.6800000000001, "Text": " there is statistical relevance."}, {"Time_Start": 958.6800000000001, "Time_End": 962.6800000000001, "Text": " The data is chunked pretty clearly into three very distinct groups"}, {"Time_Start": 962.6800000000001, "Time_End": 965.6800000000001, "Text": " with some pretty strong patterns that are starting to emerge."}, {"Time_Start": 965.6800000000001, "Time_End": 968.6800000000001, "Text": " But I need to do a real analysis and correlate that if it were illegal data"}, {"Time_Start": 968.6800000000001, "Time_End": 972.6800000000001, "Text": " with how far would you go data, to see if the level of what you find acceptable"}, {"Time_Start": 972.6800000000001, "Time_End": 974.6800000000001, "Text": " has any correlation with what if it becomes illegal."}, {"Time_Start": 974.6800000000001, "Time_End": 978.6800000000001, "Text": " it becomes illegal. Would you change your mind then? It's starting to look now"}, {"Time_Start": 978.6800000000001, "Time_End": 983.6800000000001, "Text": " like the lower people's tolerances for posting viruses in public, the more likely they are"}, {"Time_Start": 983.6800000000001, "Time_End": 987.6800000000001, "Text": " to totally do a flipping change about if it becomes illegal and actually start writing viruses."}, {"Time_Start": 987.6800000000001, "Time_End": 991.6800000000001, "Text": " So it's kind of a pretty surprising result as I sort through this data."}, {"Time_Start": 991.6800000000001, "Time_End": 995.6800000000001, "Text": " I still have to interpret it and put it through all these complex programs and type in the numbers"}, {"Time_Start": 995.6800000000001, "Time_End": 997.6800000000001, "Text": " and it will do all these complex mathematical things for me."}, {"Time_Start": 997.6800000000001, "Time_End": 1001.6800000000001, "Text": " So for now, what's been the impact of laws on virus-related incidents?"}, {"Time_Start": 1001.6800000000001, "Time_End": 1004.6600000000001, "Text": " I mean, we can look at the number of viruses that are actually out there in the wild"}, {"Time_Start": 1004.6800000000001, "Time_End": 1007.6800000000001, "Text": " And this is not the number that the antivirus companies tell you exist."}, {"Time_Start": 1007.6800000000001, "Time_End": 1011.6800000000001, "Text": " Just say, we protect you from, you know, 500 gazillion viruses."}, {"Time_Start": 1011.6800000000001, "Time_End": 1013.6800000000001, "Text": " Pay no attention to that number."}, {"Time_Start": 1013.6800000000001, "Time_End": 1014.6800000000001, "Text": " It's an irrelevant number."}, {"Time_Start": 1014.6800000000001, "Time_End": 1017.6800000000001, "Text": " What really matters, the viruses are actually out there doing problems."}, {"Time_Start": 1017.6800000000001, "Time_End": 1020.6800000000001, "Text": " And I think there were some viruses that circulated last year on here"}, {"Time_Start": 1020.6800000000001, "Time_End": 1022.6800000000001, "Text": " that have caused people some problems."}, {"Time_Start": 1022.6800000000001, "Time_End": 1025.68, "Text": " The number of viruses causing the problems in the wild"}, {"Time_Start": 1025.68, "Time_End": 1029.68, "Text": " and chart the activity of post-arrest sentencing and the different press."}, {"Time_Start": 1029.68, "Time_End": 1034.66, "Text": " On these four guys, Dr. Pop, Christopher Powell, the C.I.H guy whose name Mike"}, {"Time_Start": 1034.68, "Time_End": 1036.68, "Text": " pronounced, which is why I didn't own it."}, {"Time_Start": 1036.68, "Time_End": 1037.68, "Text": " Anne Smith."}, {"Time_Start": 1037.68, "Time_End": 1039.68, "Text": " So we look at viruses."}, {"Time_Start": 1039.68, "Time_End": 1040.68, "Text": " You see these lines here."}, {"Time_Start": 1040.68, "Time_End": 1043.68, "Text": " This yellow line at the top represents the total number of viruses"}, {"Time_Start": 1043.68, "Time_End": 1045.68, "Text": " that have been found out in the wild reported"}, {"Time_Start": 1045.68, "Time_End": 1047.68, "Text": " to this organization called the Wildest Organization."}, {"Time_Start": 1047.68, "Time_End": 1048.68, "Text": " I work with them."}, {"Time_Start": 1048.68, "Time_End": 1051.68, "Text": " They get reports from, like, over 55 people that work out"}, {"Time_Start": 1051.68, "Time_End": 1053.68, "Text": " in the field of viruses."}, {"Time_Start": 1053.68, "Time_End": 1055.68, "Text": " Users report to them, they report to us."}, {"Time_Start": 1055.68, "Time_End": 1058.68, "Text": " This blue number is viruses reported by two or more people."}, {"Time_Start": 1058.68, "Time_End": 1062.68, "Text": " Those are viruses that are actually spreading out in the wild."}, {"Time_Start": 1062.68, "Time_End": 1064.68, "Text": " And the red and green numbers down here,"}, {"Time_Start": 1064.68, "Time_End": 1067.68, "Text": " that the red is the new since the last time the list was published,"}, {"Time_Start": 1067.68, "Time_End": 1070.18, "Text": " with green being normalized, because sometimes we'd skip a month,"}, {"Time_Start": 1070.18, "Time_End": 1071.68, "Text": " so we had to normalize the data."}, {"Time_Start": 1071.68, "Time_End": 1075.68, "Text": " These are the important numbers, the viruses that are new every month."}, {"Time_Start": 1075.68, "Time_End": 1078.68, "Text": " And if we look here at, back over here in a long time ago,"}, {"Time_Start": 1078.68, "Time_End": 1080.68, "Text": " when Dr. Pop was arrested,"}, {"Time_Start": 1080.68, "Time_End": 1085.68, "Text": " we see that there was not really a drop-off in the viruses after he was arrested."}, {"Time_Start": 1085.68, "Time_End": 1089.68, "Text": " We look here at when Christopher Powell was arrested,"}, {"Time_Start": 1089.68, "Time_End": 1093.68, "Text": " and I don't know about you guys, but when I look at that, it looks to me like,"}, {"Time_Start": 1093.68, "Time_End": 1094.68, "Text": " it goes,"}, {"Time_Start": 1094.68, "Time_End": 1099.68, "Text": " and it never goes down lower, any point on the time chart,"}, {"Time_Start": 1099.68, "Time_End": 1102.68, "Text": " where it would look like it was related to that arrest."}, {"Time_Start": 1102.68, "Time_End": 1105.68, "Text": " Get over here to David Smith."}, {"Time_Start": 1105.68, "Time_End": 1109.68, "Text": " You see that it then up, and it did come back down afterwards."}, {"Time_Start": 1109.68, "Time_End": 1112.68, "Text": " People could have gotten a little shaky,"}, {"Time_Start": 1112.68, "Time_End": 1115.68, "Text": " but overall, this looks like the noise is just pretty constant."}, {"Time_Start": 1115.68, "Time_End": 1119.68, "Text": " There's really nothing that statistically significantly showing here"}, {"Time_Start": 1119.68, "Time_End": 1122.68, "Text": " that these arrests and public relations have had any,"}, {"Time_Start": 1122.68, "Time_End": 1124.68, "Text": " have had any impact on the noise."}, {"Time_Start": 1124.68, "Time_End": 1128.5800000000002, "Text": " the amount of viruses, new viruses getting released that actually cause problems."}, {"Time_Start": 1128.5800000000002, "Time_End": 1136.68, "Text": " And over here, the CIOH author, after him, not even, you know, I mean, obviously, if you, they're going up all the time,"}, {"Time_Start": 1136.68, "Time_End": 1141.68, "Text": " they're not coming back down. So it doesn't look like there's any clear pattern of these convictions"}, {"Time_Start": 1141.68, "Time_End": 1146.68, "Text": " and these high-profile arrest and these stiff penalties and all its other stuff they're talking about."}, {"Time_Start": 1146.68, "Time_End": 1149.68, "Text": " It doesn't look like it's having very much of an impact at all."}, {"Time_Start": 1149.68, "Time_End": 1154.66, "Text": " So I think it will be really interesting to see when we put this data together if people with a low virus tower,"}, {"Time_Start": 1154.68, "Time_End": 1158.68, "Text": " believe a law against virus riding would increase the likelihood they'd ride a virus."}, {"Time_Start": 1158.68, "Time_End": 1165.68, "Text": " I think it would be really interesting to see what an appropriate penalty for this guy might be for David Smith."}, {"Time_Start": 1165.68, "Time_End": 1170.68, "Text": " And we did ask that in a different set of survey questions, and that data is still being broad and correlated."}, {"Time_Start": 1170.68, "Time_End": 1173.68, "Text": " We've got quite a few responses there."}, {"Time_Start": 1173.68, "Time_End": 1177.68, "Text": " And the range of penalties people suggest he should get community service,"}, {"Time_Start": 1177.68, "Time_End": 1179.68, "Text": " he should get 10 years of hard time."}, {"Time_Start": 1179.68, "Time_End": 1184.66, "Text": " I can't say what my opinion is because it would bias the survey, but"}, {"Time_Start": 1184.68, "Time_End": 1186.68, "Text": " probably you can mostly guess."}, {"Time_Start": 1186.68, "Time_End": 1191.68, "Text": " If the number of viruses in the World Wide Web for distribution increases, decreases,"}, {"Time_Start": 1191.68, "Time_End": 1194.68, "Text": " are stays the same after Mr. Smith's sentencing."}, {"Time_Start": 1194.68, "Time_End": 1199.68, "Text": " We started by using the Google search engine and looking for all the viruses."}, {"Time_Start": 1199.68, "Time_End": 1203.68, "Text": " All the virus sites, when you type in VIWI, how many do you see where there are actual live viruses?"}, {"Time_Start": 1203.68, "Time_End": 1209.68, "Text": " We found it about, I think it was maybe 15% of them actually had live viruses."}, {"Time_Start": 1209.68, "Time_End": 1213.68, "Text": " So we're going to also measure that the same way after the arrest and sentencing."}, {"Time_Start": 1213.68, "Time_End": 1217.68, "Text": " of Mr. Smith, which has been postponed several times now,"}, {"Time_Start": 1217.68, "Time_End": 1221.68, "Text": " and we're hoping that it comes in August before I have to actually present this data."}, {"Time_Start": 1221.68, "Time_End": 1224.68, "Text": " Now what do I think? And people ask me this all the time, press people ask,"}, {"Time_Start": 1224.68, "Time_End": 1228.68, "Text": " because somehow I've become this expert on computer virus writers, I guess, because it actually mattered to me."}, {"Time_Start": 1228.68, "Time_End": 1231.68, "Text": " I didn't like people calling people names and putting out stereotypes."}, {"Time_Start": 1231.68, "Time_End": 1234.68, "Text": " It seemed unfair about people that are always perfectly decent to me."}, {"Time_Start": 1234.68, "Time_End": 1240.68, "Text": " People are looking for specific law as a solution to a big problem."}, {"Time_Start": 1240.68, "Time_End": 1242.68, "Text": " I think that there's probably a problem."}, {"Time_Start": 1242.68, "Time_End": 1247.68, "Text": " that there's probably no scientific evidence, at least yet, to show that that law is actually going to help with the problem."}, {"Time_Start": 1247.68, "Time_End": 1254.68, "Text": " From this data that we collected here, it looks like there may be evidence to show, or at least support the hypothesis,"}, {"Time_Start": 1254.68, "Time_End": 1257.68, "Text": " that making these sorts of laws would make the problem worse."}, {"Time_Start": 1257.68, "Time_End": 1262.68, "Text": " But who can really blame people when the viruses are causing so much problem out there to business corporations?"}, {"Time_Start": 1262.68, "Time_End": 1264.68, "Text": " I mean, they want a solution."}, {"Time_Start": 1264.68, "Time_End": 1267.68, "Text": " And so what should the solution be?"}, {"Time_Start": 1267.68, "Time_End": 1268.68, "Text": " What do I think?"}, {"Time_Start": 1268.68, "Time_End": 1272.68, "Text": " I think that viruses are indeed very cool, the first time you ever see,"}, {"Time_Start": 1272.68, "Time_End": 1273.68, "Text": " how they work."}, {"Time_Start": 1273.68, "Time_End": 1276.68, "Text": " I mean, people say, viruses aren't cool, they're boring."}, {"Time_Start": 1276.68, "Time_End": 1278.68, "Text": " That's because they've been doing it for a while."}, {"Time_Start": 1278.68, "Time_End": 1282.68, "Text": " The first time you see a program, make a copy of itself, and do something like that, it's pretty cool."}, {"Time_Start": 1282.68, "Time_End": 1283.68, "Text": " But after that, it's pretty boring."}, {"Time_Start": 1283.68, "Time_End": 1288.68, "Text": " And you have to weigh that coolness factor off with the responsibility factor of what you're doing."}, {"Time_Start": 1288.68, "Time_End": 1293.68, "Text": " I think that virus writing, per se, and I'm not talking about writing of self-replicating programs"}, {"Time_Start": 1293.68, "Time_End": 1298.68, "Text": " in university or research environments, but just, you know, virus writing and putting it up on some VX website."}, {"Time_Start": 1298.68, "Time_End": 1299.68, "Text": " That's not research."}, {"Time_Start": 1299.68, "Time_End": 1300.68, "Text": " That's not rocket science."}, {"Time_Start": 1300.68, "Time_End": 1301.68, "Text": " It's not helpful."}, {"Time_Start": 1301.68, "Time_End": 1302.68, "Text": " It's not about artificial live."}, {"Time_Start": 1302.68, "Time_End": 1305.68, "Text": " artificial intelligence. It's not about solving any interesting new problems."}, {"Time_Start": 1305.68, "Time_End": 1309.68, "Text": " It's just stripping out some macro code, changing a few things around, posting it out,"}, {"Time_Start": 1309.68, "Time_End": 1312.68, "Text": " and before you know it, it's costing companies, tons and tons of money."}, {"Time_Start": 1312.68, "Time_End": 1313.68, "Text": " That's not a cool thing."}, {"Time_Start": 1313.68, "Time_End": 1315.68, "Text": " It's a pretty sucking thing."}, {"Time_Start": 1315.68, "Time_End": 1320.68, "Text": " Viruses can cause really big problems, and I think that it's irresponsible to make them publicly available"}, {"Time_Start": 1320.68, "Time_End": 1324.68, "Text": " because unlike with exploits and tools, which you will put them up and somebody can get them"}, {"Time_Start": 1324.68, "Time_End": 1327.68, "Text": " and mess with them and you're making a choice each time with the virus,"}, {"Time_Start": 1327.68, "Time_End": 1331.68, "Text": " once you get it going, it's like the gift that keeps on giving."}, {"Time_Start": 1331.68, "Time_End": 1332.68, "Text": " You can't say,"}, {"Time_Start": 1332.68, "Time_End": 1335.68, "Text": " I wish I could stop it now, because once it's out there, you can't control it."}, {"Time_Start": 1335.68, "Time_End": 1336.68, "Text": " It's going to keep going."}, {"Time_Start": 1336.68, "Time_End": 1339.68, "Text": " But I think that doesn't have to make it a matter of law."}, {"Time_Start": 1339.68, "Time_End": 1343.68, "Text": " Finally, and because I've gone so fast, I think we finished just about on time,"}, {"Time_Start": 1343.68, "Time_End": 1346.68, "Text": " I really think that what you do on your own computer is your own business,"}, {"Time_Start": 1346.68, "Time_End": 1348.68, "Text": " but that's really only for now."}, {"Time_Start": 1348.68, "Time_End": 1352.68, "Text": " In some countries, it's already illegal to write a computer virus."}, {"Time_Start": 1352.68, "Time_End": 1356.68, "Text": " And one of those companies, one of those countries was in the Netherlands."}, {"Time_Start": 1356.68, "Time_End": 1359.68, "Text": " I have a list of those countries on some research I did before."}, {"Time_Start": 1359.68, "Time_End": 1361.68, "Text": " I've misplaced a paper, which is why I don't have the list for you here."}, {"Time_Start": 1361.68, "Time_End": 1363.68, "Text": " I don't have the list for you here now."}, {"Time_Start": 1363.68, "Time_End": 1367.68, "Text": " But if you want it to remain what's on your computer being your own business,"}, {"Time_Start": 1367.68, "Time_End": 1369.68, "Text": " you have to act responsibly."}, {"Time_Start": 1369.68, "Time_End": 1372.68, "Text": " If you're going to be experimenting with viruses and people are going to do it,"}, {"Time_Start": 1372.68, "Time_End": 1375.68, "Text": " don't mean things laying around where some idiot can get a hold of it"}, {"Time_Start": 1375.68, "Time_End": 1377.68, "Text": " and go out and use it to hurt people."}, {"Time_Start": 1377.68, "Time_End": 1381.68, "Text": " Because then you'll be giving scaremongers and people who want to stereotype viruses"}, {"Time_Start": 1381.68, "Time_End": 1385.68, "Text": " and people who write programs give them ammunition to go out and ask for laws."}, {"Time_Start": 1385.68, "Time_End": 1389.68, "Text": " When people are scared and they see a solution, they're going to grab a hold of it."}, {"Time_Start": 1389.68, "Time_End": 1390.68, "Text": " So you need to really protect yourself by acting responsible."}, {"Time_Start": 1390.68, "Time_End": 1394.68, "Text": " yourself by acting responsibly and don't give people any ammunition to put laws"}, {"Time_Start": 1394.68, "Time_End": 1399.68, "Text": " into effect that ultimately it's just a tiny wedge into what is your feeding."}, {"Time_Start": 1399.68, "Time_End": 1402.68, "Text": " Because if today they don't like the fact that you're going to write a computer virus,"}, {"Time_Start": 1402.68, "Time_End": 1404.68, "Text": " so they're going to say if you read a virus it's illegal."}, {"Time_Start": 1404.68, "Time_End": 1407.68, "Text": " Maybe tomorrow they won't like that you write and exploit."}, {"Time_Start": 1407.68, "Time_End": 1410.68, "Text": " And what the next day, if they don't like something else you write."}, {"Time_Start": 1410.68, "Time_End": 1413.68, "Text": " So I mean, if every time it's something they don't like it becomes illegal,"}, {"Time_Start": 1413.68, "Time_End": 1417.68, "Text": " they being however they are in power at the time, probably would be a very bad thing."}, {"Time_Start": 1417.68, "Time_End": 1420.68, "Text": " So if you act responsibly and don't just put viruses out there,"}, {"Time_Start": 1420.68, "Time_End": 1425.68, "Text": " you're going to be doing everybody a really big favor as far as what information is allowed to keep free."}, {"Time_Start": 1425.68, "Time_End": 1428.68, "Text": " And that's my really fast presentation, I think."}, {"Time_Start": 1428.68, "Time_End": 1432.68, "Text": " Yep, that's it."}, {"Time_Start": 1432.68, "Time_End": 1435.68, "Text": " Are just macros. They're not true viruses."}, {"Time_Start": 1435.68, "Time_End": 1440.68, "Text": " It's just exploiting the object model built into email programs."}, {"Time_Start": 1440.68, "Time_End": 1443.68, "Text": " Any self-replicating program would qualify as a virus."}, {"Time_Start": 1443.68, "Time_End": 1446.68, "Text": " Now, I personally prefer viruses and assembler"}, {"Time_Start": 1446.68, "Time_End": 1449.68, "Text": " just because I think that you actually direct the program."}, {"Time_Start": 1449.68, "Time_End": 1451.68, "Text": " the program, if I want to refer a virus."}, {"Time_Start": 1451.68, "Time_End": 1454.68, "Text": " But the macoviruses, I mean, it's just exercises."}, {"Time_Start": 1454.68, "Time_End": 1456.68, "Text": " To me, it's just exercises in stupidity."}, {"Time_Start": 1456.68, "Time_End": 1457.68, "Text": " But that is not true."}, {"Time_Start": 1457.68, "Time_End": 1461.68, "Text": " Acroviruses in the early 90s when DOS just came out,"}, {"Time_Start": 1461.68, "Time_End": 1464.68, "Text": " writing viruses was actually the top technology."}, {"Time_Start": 1464.68, "Time_End": 1467.68, "Text": " You learned the internals of the file system."}, {"Time_Start": 1467.68, "Time_End": 1469.68, "Text": " You found ways to make yourself still"}, {"Time_Start": 1469.68, "Time_End": 1472.68, "Text": " so DOS didn't know that you were allocating the memory out of its own heap."}, {"Time_Start": 1472.68, "Time_End": 1475.68, "Text": " You could have yourself in DOS buffers."}, {"Time_Start": 1475.68, "Time_End": 1476.68, "Text": " It was the 512 virus."}, {"Time_Start": 1476.68, "Time_End": 1479.68, "Text": " A major breakthrough is that a stouture"}, {"Time_Start": 1479.68, "Time_End": 1484.68, "Text": " the way to better programming skills in that operating system."}, {"Time_Start": 1484.68, "Time_End": 1487.68, "Text": " Now, since I was involved in these things in the early 90s,"}, {"Time_Start": 1487.68, "Time_End": 1490.68, "Text": " I really can't say anything about the microviruses that are going out now."}, {"Time_Start": 1490.68, "Time_End": 1493.68, "Text": " Personally, I don't think of them as viruses,"}, {"Time_Start": 1493.68, "Time_End": 1495.68, "Text": " because like you said, some idiot..."}, {"Time_Start": 1495.68, "Time_End": 1497.68, "Text": " Did I say some idiot?"}, {"Time_Start": 1497.68, "Time_End": 1500.68, "Text": " ...and does some modifications and there you go."}, {"Time_Start": 1500.68, "Time_End": 1501.68, "Text": " You got to be strange."}, {"Time_Start": 1501.68, "Time_End": 1504.68, "Text": " Back in the early 90s, that was really good work,"}, {"Time_Start": 1504.68, "Time_End": 1506.68, "Text": " and people were making real good progress"}, {"Time_Start": 1506.68, "Time_End": 1508.68, "Text": " and doing amazing stuff with a setting them."}, {"Time_Start": 1508.68, "Time_End": 1511.68, "Text": " Now, I think that's really true, but I also think that in those days,"}, {"Time_Start": 1511.68, "Time_End": 1514.68, "Text": " the part of the programs that made them viral was simply"}, {"Time_Start": 1514.68, "Time_End": 1517.68, "Text": " find first, find next, and you can do it in two lines of code."}, {"Time_Start": 1517.68, "Time_End": 1519.68, "Text": " So I think you could have done the viral part."}, {"Time_Start": 1519.68, "Time_End": 1522.68, "Text": " I mean, you could have done all the other parts of things that were done in viruses"}, {"Time_Start": 1522.68, "Time_End": 1523.68, "Text": " without making them replicate."}, {"Time_Start": 1523.68, "Time_End": 1527.68, "Text": " The replication was the trivial part, as far as the programming."}, {"Time_Start": 1527.68, "Time_End": 1529.68, "Text": " Viruses like the 4K, the whale,"}, {"Time_Start": 1529.68, "Time_End": 1533.68, "Text": " established new skills techniques that weren't even thought up"}, {"Time_Start": 1533.68, "Time_End": 1535.68, "Text": " by operating system programmers."}, {"Time_Start": 1535.68, "Time_End": 1538.68, "Text": " I disagree that, basically, the virus,"}, {"Time_Start": 1538.68, "Time_End": 1542.68, "Text": " The fine first and finance is considered vibrating."}, {"Time_Start": 1542.68, "Time_End": 1546.68, "Text": " Not to mention that a lot of viruses never actually cause any damage."}, {"Time_Start": 1546.68, "Time_End": 1549.68, "Text": " They just proliferated and you've got to take that in consideration."}, {"Time_Start": 1549.68, "Time_End": 1553.68, "Text": " Not all virus riders actually sought to inflict damage."}, {"Time_Start": 1553.68, "Time_End": 1558.68, "Text": " I agree with you 100% that not all virus writers seek to do damage."}, {"Time_Start": 1558.68, "Time_End": 1562.68, "Text": " I think that's one of the stereotypes that my initial research showed was true."}, {"Time_Start": 1562.68, "Time_End": 1566.68, "Text": " That in most cases it was intellectual curiosity or exercise."}, {"Time_Start": 1566.68, "Time_End": 1567.68, "Text": " In many cases, people do..."}, {"Time_Start": 1567.68, "Time_End": 1571.68, "Text": " cases people, even who don't mean to cost damage, don't realize the impact of what they're"}, {"Time_Start": 1571.68, "Time_End": 1575.68, "Text": " doing over the large scale. So even when their virus got out, and before they notice everywhere,"}, {"Time_Start": 1575.68, "Time_End": 1579.68, "Text": " in many cases in early days, it wasn't at all intentional, I believe."}, {"Time_Start": 1579.68, "Time_End": 1580.68, "Text": " I agree with you."}, {"Time_Start": 1580.68, "Time_End": 1582.68, "Text": " Yes, and the very back."}, {"Time_Start": 1582.68, "Time_End": 1583.68, "Text": " Hi."}, {"Time_Start": 1583.68, "Time_End": 1584.68, "Text": " Hi."}, {"Time_Start": 1584.68, "Time_End": 1596.68, "Text": " That expression, that computer code is an expression of speech and"}, {"Time_Start": 1596.68, "Time_End": 1602.68, "Text": " expression of speech and is legal. Yes, I am. I talk about it in the actual research paper from which these were taken."}, {"Time_Start": 1602.68, "Time_End": 1607.68, "Text": " But there are people who are saying that viruses should be exempted from that protection,"}, {"Time_Start": 1607.68, "Time_End": 1611.68, "Text": " that they should not be given the same form of First Amendment protection."}, {"Time_Start": 1611.68, "Time_End": 1616.68, "Text": " And you know, not all speech. It's speech. There's lots of speech, but not all speech is protected speech."}, {"Time_Start": 1616.68, "Time_End": 1621.68, "Text": " There are things you can't say or do legally, things that aren't protected."}, {"Time_Start": 1621.68, "Time_End": 1626.68, "Text": " And it's really conceivable that if there's a strong enough push to make writing a computer virus,"}, {"Time_Start": 1626.68, "Time_End": 1628.88, "Text": " and non-protected speech, and that could happen."}, {"Time_Start": 1628.88, "Time_End": 1632.68, "Text": " So we outlawing self-representing speech?"}, {"Time_Start": 1632.68, "Time_End": 1634.68, "Text": " Not my idea, dude."}, {"Time_Start": 1634.68, "Time_End": 1637.68, "Text": " Not my idea. I'm just reporting the news."}, {"Time_Start": 1637.68, "Time_End": 1639.68, "Text": " Yes."}, {"Time_Start": 1639.68, "Time_End": 1646.68, "Text": " Do you think that this is more wired and the amount of damage caused by viruses"}, {"Time_Start": 1646.68, "Time_End": 1651.68, "Text": " in the wild increases that they will kind of adopt these,"}, {"Time_Start": 1651.68, "Time_End": 1655.68, "Text": " because of the way they operate, once you let them up, it's kind of kind of go,"}, {"Time_Start": 1655.68, "Time_End": 1660.68, "Text": " without the same kind of social variety as landmines in the past."}, {"Time_Start": 1660.68, "Time_End": 1662.68, "Text": " This is kind of hilarious."}, {"Time_Start": 1662.68, "Time_End": 1667.68, "Text": " I think certainly one thing that I've observed over the past several years is that,"}, {"Time_Start": 1667.68, "Time_End": 1673.68, "Text": " you know, the hacker community and the virus community are kind of separate communities."}, {"Time_Start": 1673.68, "Time_End": 1675.68, "Text": " You know, there's some merging of the communities,"}, {"Time_Start": 1675.68, "Time_End": 1679.68, "Text": " but the virus riders have tended to be at the lower end of the scale"}, {"Time_Start": 1679.68, "Time_End": 1683.68, "Text": " and kind of look down upon because, you know, the stuff does damage,"}, {"Time_Start": 1683.68, "Time_End": 1685.68, "Text": " even though we say, you know, we think it's not."}, {"Time_Start": 1685.68, "Time_End": 1691.18, "Text": " not intended to do damage, it's kind of like the sucking part of the underground technology."}, {"Time_Start": 1691.18, "Time_End": 1697.18, "Text": " So I think it probably will continue to be looked more down upon unless people behave more responsibly with it."}, {"Time_Start": 1697.18, "Time_End": 1700.18, "Text": " I think if people behave more responsibly with what they're doing,"}, {"Time_Start": 1700.18, "Time_End": 1704.18, "Text": " don't just leave it laying out there where somebody can get it and it just keeps going."}, {"Time_Start": 1704.18, "Time_End": 1711.18, "Text": " It's possible it might not have to be looked upon as some sort of bad, evil, unethical, malicious, antisocial act."}, {"Time_Start": 1711.18, "Time_End": 1714.18, "Text": " Way in the back in the white shirt."}, {"Time_Start": 1714.18, "Time_End": 1715.18, "Text": " Yes."}, {"Time_Start": 1715.18, "Time_End": 1717.98, "Text": " Yes. Do you have a comment about the recent law, you know,"}, {"Time_Start": 1717.98, "Time_End": 1721.18, "Text": " what is that law?"}, {"Time_Start": 1721.18, "Time_End": 1727.68, "Text": " No one to make it an illegal to transmit a virus?"}, {"Time_Start": 1727.68, "Time_End": 1729.18, "Text": " And I guess I'm a criminal."}, {"Time_Start": 1729.18, "Time_End": 1740.18, "Text": " I mean, the people that work with the antivirus stuff all the time,"}, {"Time_Start": 1740.18, "Time_End": 1742.18, "Text": " we have to transmit the viruses, don't we?"}, {"Time_Start": 1742.18, "Time_End": 1743.18, "Text": " How do we differentiate?"}, {"Time_Start": 1743.18, "Time_End": 1744.18, "Text": " It's illegal for me to give him."}, {"Time_Start": 1744.18, "Time_End": 1748.18, "Text": " me to give him one, but it's not illegal for me to give some antivirus guy one."}, {"Time_Start": 1748.18, "Time_End": 1752.18, "Text": " It's all about a matter of intent and who's interpreting the intent."}, {"Time_Start": 1752.18, "Time_End": 1755.18, "Text": " And I think that's what the real concern really is."}, {"Time_Start": 1755.18, "Time_End": 1756.18, "Text": " Yes."}, {"Time_Start": 1756.18, "Time_End": 1760.18, "Text": " Did you touch on all in your study about how"}, {"Time_Start": 1760.18, "Time_End": 1762.18, "Text": " even though the next class may not be well written,"}, {"Time_Start": 1762.18, "Time_End": 1766.18, "Text": " some people's opinion, that they show laws in operating system models"}, {"Time_Start": 1766.18, "Time_End": 1770.18, "Text": " as well as email plans, i.e. Microsoft."}, {"Time_Start": 1770.18, "Time_End": 1772.18, "Text": " Did you touch about that at all?"}, {"Time_Start": 1772.18, "Time_End": 1779.18, "Text": " I did talk about that a little bit."}, {"Time_Start": 1779.18, "Time_End": 1782.18, "Text": " I talked about it more in a paper."}, {"Time_Start": 1782.18, "Time_End": 1785.18, "Text": " Actually, the paper is linked to the new security focus website."}, {"Time_Start": 1785.18, "Time_End": 1787.18, "Text": " It's a link to that paper."}, {"Time_Start": 1787.18, "Time_End": 1788.18, "Text": " It's called When Worlds Collide."}, {"Time_Start": 1788.18, "Time_End": 1793.18, "Text": " And it's about the different views that the antivirus and the traditional security community have"}, {"Time_Start": 1793.18, "Time_End": 1798.18, "Text": " on whether or not demonstrating these vulnerabilities."}, {"Time_Start": 1798.18, "Time_End": 1801.18, "Text": " Programs generally don't have to be viral to demonstrate"}, {"Time_Start": 1801.18, "Time_End": 1803.18, "Text": " to demonstrate the vulnerability."}, {"Time_Start": 1803.18, "Time_End": 1806.18, "Text": " You can demonstrate most of these vulnerabilities straight away."}, {"Time_Start": 1806.18, "Time_End": 1809.18, "Text": " The virus just, it's the part that really is the problem,"}, {"Time_Start": 1809.18, "Time_End": 1812.18, "Text": " because it gets going out of your control."}, {"Time_Start": 1812.18, "Time_End": 1816.18, "Text": " But there's a little bit about the differing views on information sharing"}, {"Time_Start": 1816.18, "Time_End": 1818.18, "Text": " and what's okay and what's not."}, {"Time_Start": 1818.18, "Time_End": 1821.18, "Text": " The community is actually, just like the virus rider and the hacker communities"}, {"Time_Start": 1821.18, "Time_End": 1823.18, "Text": " have different models of how they behave."}, {"Time_Start": 1823.18, "Time_End": 1826.18, "Text": " The antivirus community and the security community"}, {"Time_Start": 1826.18, "Time_End": 1830.18, "Text": " have so far been pretty much distinct, different organizations."}, {"Time_Start": 1830.18, "Time_End": 1831.18, "Text": " We're starting to see."}, {"Time_Start": 1831.18, "Time_End": 1837.18, "Text": " the antivirus acting as a function of the general security corporations."}, {"Time_Start": 1837.18, "Time_End": 1841.18, "Text": " We're seeing security corporations bring antivirus up under that so that it's all one thing,"}, {"Time_Start": 1841.18, "Time_End": 1843.18, "Text": " which is probably good for the users."}, {"Time_Start": 1843.18, "Time_End": 1849.18, "Text": " The two worlds, in my opinion, never were separate, but they have been separate."}, {"Time_Start": 1849.18, "Time_End": 1853.18, "Text": " We need to really work to bring them together because there's a lot of knowledge,"}, {"Time_Start": 1853.18, "Time_End": 1856.18, "Text": " different skill sets in those two communities."}, {"Time_Start": 1856.18, "Time_End": 1859.18, "Text": " Yes?"}, {"Time_Start": 1859.18, "Time_End": 1860.18, "Text": " Yes."}, {"Time_Start": 1860.18, "Time_End": 1866.18, "Text": " I was pointing to, yes, you can meet a company like Microsoft aware,"}, {"Time_Start": 1866.18, "Time_End": 1869.18, "Text": " the problem with your Outlook Express,"}, {"Time_Start": 1869.18, "Time_End": 1871.18, "Text": " but unless all the people are there,"}, {"Time_Start": 1871.18, "Time_End": 1874.18, "Text": " Microsoft can say, well, it's a problem,"}, {"Time_Start": 1874.18, "Time_End": 1877.18, "Text": " but it's not really a problem because we have a really stupid stuff for it."}, {"Time_Start": 1877.18, "Time_End": 1881.18, "Text": " Well, I've been some work now with them, with them."}, {"Time_Start": 1881.18, "Time_End": 1885.18, "Text": " A lot of us are trying to do some work with the folks at Microsoft"}, {"Time_Start": 1885.18, "Time_End": 1888.18, "Text": " on some of these issues, and there really are effective ways"}, {"Time_Start": 1888.18, "Time_End": 1889.18, "Text": " of getting the changes made without..."}, {"Time_Start": 1889.18, "Time_End": 1893.18, "Text": " without pelting out 5 billion viruses everywhere."}, {"Time_Start": 1893.18, "Time_End": 1896.18, "Text": " You know, I'd say, try a letter first."}, {"Time_Start": 1896.18, "Time_End": 1903.18, "Text": " Windows is it's been working more than I think people are aware."}, {"Time_Start": 1903.18, "Time_End": 1906.18, "Text": " Yes?"}, {"Time_Start": 1906.18, "Time_End": 1909.18, "Text": " Don't you think Windows should get enabled, like,"}, {"Time_Start": 1909.18, "Time_End": 1915.18, "Text": " secret, like, damaging,"}, {"Time_Start": 1915.18, "Time_End": 1918.18, "Text": " because people can always say that you know,"}, {"Time_Start": 1918.18, "Time_End": 1919.18, "Text": " they didn't know?"}, {"Time_Start": 1919.18, "Time_End": 1922.18, "Text": " Fortunately, I think that Windows probably isn't a virus."}, {"Time_Start": 1922.18, "Time_End": 1924.18, "Text": " It's not spreading so much anymore."}, {"Time_Start": 1924.18, "Time_End": 1926.18, "Text": " We're seeing more and more Linux systems."}, {"Time_Start": 1926.18, "Time_End": 1930.18, "Text": " It's probably a really good product."}, {"Time_Start": 1930.18, "Time_End": 1932.18, "Text": " It's killing it off."}, {"Time_Start": 1932.18, "Time_End": 1936.18, "Text": " That's my own personal view, not that of IBM."}, {"Time_Start": 1936.18, "Time_End": 1938.18, "Text": " Yes?"}, {"Time_Start": 1938.18, "Time_End": 1940.18, "Text": " You might tell everybody,"}, {"Time_Start": 1940.18, "Time_End": 1945.18, "Text": " as a network technician who's a part for 18 to see."}, {"Time_Start": 1945.18, "Time_End": 1948.18, "Text": " He's an average guy just like most people in his room."}, {"Time_Start": 1948.18, "Time_End": 1952.18, "Text": " and he was known as Vicodin' E.S."}, {"Time_Start": 1952.18, "Time_End": 1955.18, "Text": " He was an excellent script writer."}, {"Time_Start": 1955.18, "Time_End": 1958.18, "Text": " Well, I guess you heard it right there."}, {"Time_Start": 1958.18, "Time_End": 1961.18, "Text": " David Smith was an excellent script writer,"}, {"Time_Start": 1961.18, "Time_End": 1963.18, "Text": " known as Vicodin E.S."}, {"Time_Start": 1963.18, "Time_End": 1966.18, "Text": " And he's looking at doing lots of time in jail"}, {"Time_Start": 1966.18, "Time_End": 1971.18, "Text": " for releasing a virus that he admits to having it written."}, {"Time_Start": 1971.18, "Time_End": 1974.18, "Text": " As far as him being just a normal guy like everybody else,"}, {"Time_Start": 1974.18, "Time_End": 1977.18, "Text": " most of my research anyway has shown that most people who do this stuff,"}, {"Time_Start": 1977.18, "Time_End": 1979.18, "Text": " people who do this stuff are just pretty much with,"}, {"Time_Start": 1979.18, "Time_End": 1981.18, "Text": " they could be just a guy next door, anybody."}, {"Time_Start": 1981.18, "Time_End": 1983.18, "Text": " It's not, it doesn't take some special, you know,"}, {"Time_Start": 1983.18, "Time_End": 1985.18, "Text": " evil, malicious, horrible person."}, {"Time_Start": 1985.18, "Time_End": 1989.18, "Text": " It's not some guy sitting in the basement listening to Danzig all day and"}, {"Time_Start": 1989.18, "Time_End": 1992.18, "Text": " I just, you know, it's just, it's just a guy."}, {"Time_Start": 1992.18, "Time_End": 1995.18, "Text": " And sometimes it's just a guy at school, a guy who works for an ISP."}, {"Time_Start": 1995.18, "Time_End": 1997.18, "Text": " It could be anybody."}, {"Time_Start": 1997.18, "Time_End": 1999.18, "Text": " It's not, you know, the devil behind the door."}, {"Time_Start": 1999.18, "Time_End": 2000.18, "Text": " The door."}, {"Time_Start": 2000.18, "Time_End": 2003.18, "Text": " Sorry, I can hear you."}, {"Time_Start": 2003.18, "Time_End": 2005.18, "Text": " The virus."}, {"Time_Start": 2005.18, "Time_End": 2006.18, "Text": " The virus."}, {"Time_Start": 2006.18, "Time_End": 2007.18, "Text": " It doesn't see a cold and the virus."}, {"Time_Start": 2007.18, "Time_End": 2009.18, "Text": " self-replicate, what doesn't it mean?"}, {"Time_Start": 2009.18, "Time_End": 2012.18, "Text": " One final question over there."}, {"Time_Start": 2012.18, "Time_End": 2032.18, "Text": " I think that in order to have a functional operating system"}, {"Time_Start": 2032.18, "Time_End": 2033.18, "Text": " you're going to have a functional operating system"}, {"Time_Start": 2033.18, "Time_End": 2036.18, "Text": " you're going to have to be allowed to write at some place on a file system and make copies."}, {"Time_Start": 2036.18, "Time_End": 2040.18, "Text": " need copies, and as long as you can do that, you're going to have the potential to have a virus."}, {"Time_Start": 2040.18, "Time_End": 2044.18, "Text": " I don't think it's really the issue of operating system manufacturers."}, {"Time_Start": 2044.18, "Time_End": 2049.1800000000003, "Text": " I think that the culpability in the case of viruses lies in a lot of places."}, {"Time_Start": 2049.1800000000003, "Time_End": 2053.1800000000003, "Text": " It's what you do with the thing that you create."}, {"Time_Start": 2053.1800000000003, "Time_End": 2058.1800000000003, "Text": " And I think we need to look a lot more personal responsibility in what we do with our creations"}, {"Time_Start": 2058.1800000000003, "Time_End": 2061.1800000000003, "Text": " instead of looking elsewhere for who's responsible."}, {"Time_Start": 2061.1800000000003, "Time_End": 2063.1800000000003, "Text": " We need to look at ourselves."}, {"Time_Start": 2063.1800000000003, "Time_End": 2065.1800000000003, "Text": " I'm sorry, one final last question."}, {"Time_Start": 2065.18, "Time_End": 2066.18, "Text": " Yes, Guston."}, {"Time_Start": 2066.18, "Time_End": 2068.18, "Text": " Going back to this question, they start calling up."}, {"Time_Start": 2068.18, "Time_End": 2070.18, "Text": " In the case of the luck bug virus,"}, {"Time_Start": 2070.18, "Time_End": 2090.18, "Text": " when I was one of the most basic exploits on OLA calls and U.B script now."}, {"Time_Start": 2090.18, "Time_End": 2091.18, "Text": " I don't know what everybody needs to do."}, {"Time_Start": 2091.18, "Time_End": 2094.18, "Text": " I certainly couldn't recommend any kind of action of"}, {"Time_Start": 2094.18, "Time_End": 2098.18, "Text": " kind of action of holding an operating system manufacturer responsible."}, {"Time_Start": 2098.18, "Time_End": 2102.18, "Text": " Probably it would be interesting to see what happened if anybody did,"}, {"Time_Start": 2102.18, "Time_End": 2104.18, "Text": " but I don't know that anybody's doing that."}, {"Time_Start": 2104.18, "Time_End": 2106.18, "Text": " Do you know?"}, {"Time_Start": 2106.18, "Time_End": 2108.18, "Text": " I'm not going to see Microsoft."}, {"Time_Start": 2108.18, "Time_End": 2110.18, "Text": " Why not?"}, {"Time_Start": 2110.18, "Time_End": 2112.18, "Text": " They're very much."}, {"Time_Start": 2112.18, "Time_End": 2113.18, "Text": " Okay."}, {"Time_Start": 2113.18, "Time_End": 2116.18, "Text": " All right."}, {"Time_Start": 2116.18, "Time_End": 2121.18, "Text": " Well, if anybody has any questions about the research, the later research, or this study,"}, {"Time_Start": 2121.18, "Time_End": 2123.18, "Text": " this project from here will be on the DEFCOM site."}, {"Time_Start": 2123.18, "Time_End": 2125.18, "Text": " on the Defcom site, probably."}, {"Time_Start": 2125.18, "Time_End": 2128.18, "Text": " And if you look at the IBM, www.a.v."}, {"Time_Start": 2128.18, "Time_End": 2132.18, "Text": " The paper will be there, or you can contact me."}, {"Time_Start": 2132.18, "Time_End": 2135.18, "Text": " I've got a bunch of email addresses."}, {"Time_Start": 2135.18, "Time_End": 2139.18, "Text": " You just type Sarah Gordon and virus in a search engine,"}, {"Time_Start": 2139.18, "Time_End": 2141.18, "Text": " and you'll find me somewhere, if I'm around,"}, {"Time_Start": 2141.18, "Time_End": 2144.18, "Text": " and if I haven't given up on all this insanity by then."}, {"Time_Start": 2144.18, "Time_End": 2146.18, "Text": " So thank you very much for coming."}, {"Time_Start": 2146.18, "Time_End": 2147.18, "Text": " And bye."}]}