{"segments": [{"Time_Start": 0.0, "Time_End": 2.0, "Text": " BADYSKILEEN SULLIV."}, {"Time_Start": 2.0, "Time_End": 4.0, "Text": " THEIRSKILEEN SULLIV."}, {"Time_Start": 4.0, "Time_End": 5.0, "Text": " THEIRSKI."}, {"Time_Start": 5.0, "Time_End": 6.0, "Text": " THEIRSKI."}, {"Time_Start": 6.0, "Time_End": 8.0, "Text": " Thank you."}, {"Time_Start": 36.0, "Time_End": 65.26, "Text": " Some of the stuff may be kind of basic for some of you, but some of it actually, we're going to touch on a few new things, and then I'll kind of cover some new things we've got at the end."}, {"Time_Start": 66.0, "Time_End": 78.32, "Text": " And I also want to apologize for the PowerPoint thing, but hey, you know, that's kind of what a lot of us that end up going around doing some of these presentations have to live with."}, {"Time_Start": 78.82, "Time_End": 85.86, "Text": " Anyway, I'm assuming on this presentation, you all understand what an IP address is, you understand a little bit of basic system administration."}, {"Time_Start": 86.56, "Time_End": 92.24000000000001, "Text": " I'm also going to make the assumption that when I talk about tools or refer to tools, that you know how to go and find them."}, {"Time_Start": 92.24000000000001, "Time_End": 95.98, "Text": " I don't know how many emails that I've gotten from people saying, you know, hey, where do I,"}, {"Time_Start": 96.0, "Time_End": 101.02, "Text": " get the so-and-so tool or whatever, okay. I figure everyone probably knows how to use a search engine and whatnot."}, {"Time_Start": 101.44, "Time_End": 105.06, "Text": " And they understand a little bit of the basic stuff about the usage of the tools."}, {"Time_Start": 106.9, "Time_End": 113.06, "Text": " The presentation is more from a network point of view. I'll touch on host-based type stuff where it seems appropriate."}, {"Time_Start": 113.96000000000001, "Time_End": 117.52, "Text": " But for the most part, we're talking about the network itself."}, {"Time_Start": 121.28, "Time_End": 125.98, "Text": " I think everyone probably, you know, something about I got into doing."}, {"Time_Start": 126.0, "Time_End": 139.06, "Text": " But the NMRC.org website, I also have a nice day job at Bindview who are very, very happy to hire hackers and whatnot."}, {"Time_Start": 139.36, "Time_End": 142.4, "Text": " And so I get to do a lot of what I've been doing."}, {"Time_Start": 143.06, "Time_End": 145.54, "Text": " I've had some people say, why haven't you been updating your website?"}, {"Time_Start": 145.7, "Time_End": 149.6, "Text": " Well, it's because I've been extremely happy working on the Razor team at Bindview."}, {"Time_Start": 149.68, "Time_End": 150.82, "Text": " They've been keeping me really busy."}, {"Time_Start": 150.82, "Time_End": 154.82, "Text": " And so that kind of tends to be where my attention has been focused."}, {"Time_Start": 156.0, "Time_End": 164.24, "Text": " As far as the network mapping stuff goes, first thing you need to know is know a little bit about your target."}, {"Time_Start": 164.24, "Time_End": 170.76, "Text": " There's different ways you'd go about, now I'm not going to cover actual breaking-in techniques."}, {"Time_Start": 170.76, "Time_End": 176.84, "Text": " We're just going to be basically talking about kind of to do some type of stuff ahead of time."}, {"Time_Start": 176.84, "Time_End": 178.36, "Text": " Public information where you can get a lot of stuff."}, {"Time_Start": 178.36, "Time_End": 184.24, "Text": " We're going to cover some stuff on that, some techniques on network enumeration, and then we'll get into some mapping."}, {"Time_Start": 184.24, "Time_End": 191.54000000000002, "Text": " Public information, obviously, if you wanted to really research your target, you go out and you look at the public records and everything."}, {"Time_Start": 191.66, "Time_End": 194.28, "Text": " You find out a lot of interesting things from public records and whatnot."}, {"Time_Start": 195.16, "Time_End": 199.4, "Text": " And is Edgar still online where you can search it and everything?"}, {"Time_Start": 199.58, "Time_End": 200.9, "Text": " That was always a, yeah."}, {"Time_Start": 201.82000000000002, "Time_End": 204.62, "Text": " I only talked at one point, I think, about turning it off or something."}, {"Time_Start": 204.74, "Time_End": 205.66000000000003, "Text": " I'd read something about that."}, {"Time_Start": 205.66000000000003, "Time_End": 210.62, "Text": " But it's a, that's always something I always make sure I take a look at."}, {"Time_Start": 211.22, "Time_End": 214.22, "Text": " Of course, who is DNS and all."}, {"Time_Start": 214.24, "Time_End": 217.08, "Text": " the assorted tools that go with probing DNS."}, {"Time_Start": 218.22, "Time_End": 224.66, "Text": " Public postings, this is another thing that some people kind of tend to forget, forget about."}, {"Time_Start": 225.10000000000002, "Time_End": 231.48000000000002, "Text": " A lot of times you'll find that people will, on mailing lists and in news groups and other places,"}, {"Time_Start": 231.48000000000002, "Time_End": 237.64000000000001, "Text": " will actually post technical questions, and in the process they're giving away pieces of their technology,"}, {"Time_Start": 238.28, "Time_End": 239.92000000000002, "Text": " what they have in there."}, {"Time_Start": 240.0, "Time_End": 242.08, "Text": " I'm having problems with the so-and-so backup system."}, {"Time_Start": 242.22, "Time_End": 242.86, "Text": " Okay, well, I know."}, {"Time_Start": 243.16000000000003, "Time_End": 244.22, "Text": " Now what kind of backup system?"}, {"Time_Start": 244.24, "Time_End": 248.48000000000002, "Text": " it is, and I know what operating systems maybe that runs on that kind of information."}, {"Time_Start": 249.0, "Time_End": 250.66, "Text": " Sometimes they get even more details than that."}, {"Time_Start": 250.76000000000002, "Time_End": 252.38, "Text": " They put their, you know, in their sig files."}, {"Time_Start": 252.5, "Time_End": 256.88, "Text": " They've got also their telephone numbers, so now I've got exchanges that I can word now"}, {"Time_Start": 256.88, "Time_End": 258.52, "Text": " because I know what their work numbers are and whatnot."}, {"Time_Start": 259.16, "Time_End": 261.84000000000003, "Text": " So don't forget those areas."}, {"Time_Start": 264.06, "Time_End": 268.58, "Text": " Network enumeration, pretty much the goal that you have of network enumeration."}, {"Time_Start": 268.58, "Time_End": 269.62, "Text": " We'll cover that here in a second."}, {"Time_Start": 270.24, "Time_End": 272.42, "Text": " I want to get into on that ICMP."}, {"Time_Start": 274.24, "Time_End": 280.36, "Text": " There's actually some fairly new things with ICMP, thanks to a couple of talks I've had around here."}, {"Time_Start": 281.2, "Time_End": 282.78000000000003, "Text": " And you can pretty much read the rest."}, {"Time_Start": 282.82, "Time_End": 284.32, "Text": " I'm not going to stand up here and read slides to you."}, {"Time_Start": 285.78000000000003, "Time_End": 287.78000000000003, "Text": " I do want to talk on ICMP."}, {"Time_Start": 289.2, "Time_End": 295.88, "Text": " One thing that's been, you know, the first thing that everyone would do, they'd do the sweep with echo packets"}, {"Time_Start": 295.88, "Time_End": 298.74, "Text": " and get the responses back, and now I know I had a host up."}, {"Time_Start": 299.48, "Time_End": 302.18, "Text": " And so, of course, people started blocking that at the firewall."}, {"Time_Start": 302.18, "Time_End": 308.72, "Text": " Another alternative to that would be to sweep with, say, something like a timestamp packets"}, {"Time_Start": 308.72, "Time_End": 313.38, "Text": " or even info request packets, although that's not supported nearly as much."}, {"Time_Start": 313.86, "Time_End": 318.8, "Text": " But if they're only blocking echo packets at the firewall, then by sweeping for these different"}, {"Time_Start": 318.8, "Time_End": 322.82, "Text": " types, then you can go ahead and find out if you've actually got a host up or not."}, {"Time_Start": 323.5, "Time_End": 325.84000000000003, "Text": " So a lot of people have taken it a step further."}, {"Time_Start": 326.0, "Time_End": 327.08, "Text": " They're blocking a lot more."}, {"Time_Start": 327.08, "Time_End": 329.68, "Text": " They're saying, okay, well, I'm only going to allow in something like,"}, {"Time_Start": 332.18, "Time_End": 334.14, "Text": " I'm only going to allow in host report unreachables."}, {"Time_Start": 334.54, "Time_End": 339.44, "Text": " Maybe I'm going to allow in a source quench, and that's the only kind of stuff that I'm going to allow"}, {"Time_Start": 339.44, "Time_End": 341.06, "Text": " to come into my network."}, {"Time_Start": 341.3, "Time_End": 346.84000000000003, "Text": " Well, another way I can get around that, now, is if they're allowing the host report unreachables in,"}, {"Time_Start": 346.84000000000003, "Time_End": 354.66, "Text": " I send in a forged host report unreachable, just one that was unsolicited."}, {"Time_Start": 355.24, "Time_End": 361.24, "Text": " I use an illegal header length, and what will happen is if they've properly implemented"}, {"Time_Start": 361.24, "Time_End": 367.66, "Text": " ICMP in the IP stack. It'll say, I've got an error now. I'm going to go ahead and reply"}, {"Time_Start": 367.66, "Time_End": 373.38, "Text": " back saying, you've got a parameter problem, and so then I get an ICMP back, and boom, I've actually"}, {"Time_Start": 373.38, "Time_End": 380.3, "Text": " now determined that that host is now up. And that was actually theory until I had a talk earlier"}, {"Time_Start": 380.3, "Time_End": 384.8, "Text": " this week, and I got the guy's name in the last slide here, because I really appreciate learning"}, {"Time_Start": 384.8, "Time_End": 390.96000000000004, "Text": " that information. The other thing, I don't know specifically how much this goes across the various"}, {"Time_Start": 390.96000000000004, "Time_End": 397.46000000000004, "Text": " vendors, they all have their different ways that they do IP and everything."}, {"Time_Start": 397.64000000000004, "Time_End": 403.44000000000005, "Text": " And not everyone implements things the same way, but we'll talk a little bit more about that here"}, {"Time_Start": 403.44000000000005, "Time_End": 411.88000000000005, "Text": " in a minute. Scanning, Y-scan, hopefully everyone here already knows why you scan. You're looking"}, {"Time_Start": 411.88000000000005, "Time_End": 419.36, "Text": " for services running and whatnot. And pretty much everyone's using N-map. It's become"}, {"Time_Start": 419.36, "Time_End": 427.56, "Text": " It does some of the ping sweeps and stuff. But some of the other features, the fingerprinting"}, {"Time_Start": 427.56, "Time_End": 433.12, "Text": " is extremely interesting. That helps out a whole lot. Another real interesting thing that I like"}, {"Time_Start": 433.12, "Time_End": 443.86, "Text": " to use with NMAP, as most of you know that use it, it comes with a lib P-cap. And so it goes"}, {"Time_Start": 443.86, "Time_End": 449.34000000000003, "Text": " into promiscuous mode during some of the scans, which means that if I see that if I see it,"}, {"Time_Start": 449.36, "Time_End": 456.1, "Text": " set it up to where I don't, you can do the decoy thing and say, okay, I'm going to, you know,"}, {"Time_Start": 456.1, "Time_End": 460.14, "Text": " and then put in your real IP address in there. Depending on how, where you're scanning from,"}, {"Time_Start": 460.24, "Time_End": 466.06, "Text": " you can use the IP, say your IP address is someone down the hall, and if you're on the same net,"}, {"Time_Start": 466.12, "Time_End": 471.42, "Text": " you scan, and since you're in promiscuous mode, you still get all the responses back and they blame"}, {"Time_Start": 471.42, "Time_End": 477.96000000000004, "Text": " the guy down the hall, or they blame the guy, you know, if you've got a cable modem, they blame some other"}, {"Time_Start": 477.96000000000004, "Time_End": 482.76000000000005, "Text": " guy that you've managed to pick up. So that's kind of a neat, a neat little feature there"}, {"Time_Start": 482.76000000000005, "Time_End": 496.96000000000004, "Text": " so you can scan without revealing your address. TCP fingerprinting, and I think pretty much everyone"}, {"Time_Start": 496.96000000000004, "Time_End": 501.6, "Text": " here probably knows what that is, but for those that don't send out a flurry of packets with"}, {"Time_Start": 501.6, "Time_End": 506.26000000000005, "Text": " the various settings, you get a bunch of different responses that come back, and then these"}, {"Time_Start": 506.26, "Time_End": 512.3, "Text": " can be the types of responses can pretty much indicate the types of operating systems"}, {"Time_Start": 512.3, "Time_End": 519.2, "Text": " you're dealing with. Something that I found out fairly recently, because I just started playing"}, {"Time_Start": 519.2, "Time_End": 527.66, "Text": " a lot with ICMP and TTL, is that by sending in certain types of ICMP packets, you know,"}, {"Time_Start": 527.66, "Time_End": 533.74, "Text": " with various things switched in that, you get you fairly unique responses and they're fairly"}, {"Time_Start": 533.74, "Time_End": 540.74, "Text": " consistent responses and you can do somewhat of a OS type fingerprinting just with ICMP."}, {"Time_Start": 540.74, "Time_End": 547.74, "Text": " This comes in handy if you're doing that thing where they've, with the host or port unreachable,"}, {"Time_Start": 547.74, "Time_End": 552.74, "Text": " you can actually then at that point you're going to be able to tell what type of, in some cases,"}, {"Time_Start": 552.74, "Time_End": 556.74, "Text": " what type of OS you actually have sitting on the inside."}, {"Time_Start": 556.74, "Time_End": 561.74, "Text": " The additional probes thing here."}, {"Time_Start": 561.74, "Time_End": 567.08, "Text": " The other thing you want to do is scan for possible security devices."}, {"Time_Start": 567.08, "Time_End": 571.6800000000001, "Text": " And one thing I like to talk about is throwaway hosts, okay?"}, {"Time_Start": 571.6800000000001, "Time_End": 578.24, "Text": " If I'm going to, let's say I'm doing a penetration test of some kind, you know."}, {"Time_Start": 578.24, "Time_End": 582.88, "Text": " Some of you may be doing them legitimately, some of you may be doing your own freelance penetration"}, {"Time_Start": 582.88, "Time_End": 588.1, "Text": " testing, but you get the idea where you want to check out and see where there's various security"}, {"Time_Start": 588.1, "Time_End": 590.8, "Text": " devices are, okay?"}, {"Time_Start": 590.8000000000001, "Time_End": 595.8000000000001, "Text": " So sometimes you take a host that you know is you don't care about that you have ownership"}, {"Time_Start": 595.8000000000001, "Time_End": 599.2400000000001, "Text": " of and you're going to go ahead and send in your packets and then maybe you're going to try"}, {"Time_Start": 599.2400000000001, "Time_End": 603.72, "Text": " the same thing again and then see if you get some type of different response."}, {"Time_Start": 603.72, "Time_End": 608.7800000000001, "Text": " So what it is is it involves looking for a lack of response due to perhaps some type of security"}, {"Time_Start": 608.7800000000001, "Time_End": 610.7800000000001, "Text": " device that's on there."}, {"Time_Start": 610.7800000000001, "Time_End": 617.0200000000001, "Text": " And of course then using some of the anti-sniff technology sweeping for promiscuous devices."}, {"Time_Start": 617.0200000000001, "Time_End": 620.7800000000001, "Text": " The other things that I would do is consider"}, {"Time_Start": 620.8000000000001, "Time_End": 623.5600000000001, "Text": " some of the odd ICMP things."}, {"Time_Start": 623.5600000000001, "Time_End": 626.6800000000001, "Text": " I mean, if you can, this is one way how you would spot honey pots."}, {"Time_Start": 626.6800000000001, "Time_End": 632.8000000000001, "Text": " If you've got something in there that looks like it's some type of somewhat open"}, {"Time_Start": 632.8000000000001, "Time_End": 640.0400000000001, "Text": " NT device, and it turns out that it's really something else because the ICMP responses"}, {"Time_Start": 640.0400000000001, "Time_End": 646.0400000000001, "Text": " you're getting back are kind of indicating that it's a Unix box, then that's an example of"}, {"Time_Start": 646.0400000000001, "Time_End": 650.7800000000001, "Text": " where you've got maybe a honeypot or something like that, where you can, that you can, that's a,"}, {"Time_Start": 650.8000000000001, "Time_End": 655.6400000000001, "Text": " obviously avoid it, or if you want to go in and play around and look like an idiot,"}, {"Time_Start": 655.7400000000001, "Time_End": 659.2400000000001, "Text": " I guess you could do that to trick them or whatever."}, {"Time_Start": 659.2400000000001, "Time_End": 669.4000000000001, "Text": " But anyway, network mapping, this involves basically determining the network layout,"}, {"Time_Start": 669.5200000000001, "Time_End": 676.6200000000001, "Text": " trying to figure out exactly where the devices are, where they're attached, who's talking to what,"}, {"Time_Start": 676.6200000000001, "Time_End": 677.7400000000001, "Text": " and whatnot."}, {"Time_Start": 678.3600000000001, "Time_End": 679.98, "Text": " Trace Rout's a good tool for doing this."}, {"Time_Start": 679.98, "Time_End": 680.6600000000001, "Text": " Firewalk."}, {"Time_Start": 680.8000000000001, "Time_End": 682.2, "Text": " It's probably a little bit better tool."}, {"Time_Start": 682.3000000000001, "Time_End": 683.5000000000001, "Text": " It gets you a little bit better in there."}, {"Time_Start": 684.0400000000001, "Time_End": 688.9200000000001, "Text": " And then some of these other things we've already been talking about, specifically, ICMP is what I'm thinking about here."}, {"Time_Start": 690.96, "Time_End": 695.58, "Text": " For doing some type of bypassing in the firewall, this is a slide I should have updated last night."}, {"Time_Start": 696.0400000000001, "Time_End": 700.4200000000001, "Text": " I don't know if any of you wrote Black Hat, but there's a great presentation on getting past checkpoint firewalls,"}, {"Time_Start": 700.4200000000001, "Time_End": 703.0600000000001, "Text": " which was just absolutely, that was wondrous."}, {"Time_Start": 703.2600000000001, "Time_End": 704.1400000000001, "Text": " That was actually great."}, {"Time_Start": 704.3000000000001, "Time_End": 706.46, "Text": " So forget this slide, just go to that stuff."}, {"Time_Start": 706.9200000000001, "Time_End": 707.6800000000001, "Text": " It's really good stuff."}, {"Time_Start": 707.6800000000001, "Time_End": 710.7800000000001, "Text": " But, I mean, there are some things where at least where you're trying to be."}, {"Time_Start": 710.8000000000001, "Time_End": 714.1200000000001, "Text": " pro because before you're launching an attack against something on the other side of the firewall,"}, {"Time_Start": 714.22, "Time_End": 717.9000000000001, "Text": " you at least need to try to know what the hell that is you're launching the attack against."}, {"Time_Start": 718.2400000000001, "Time_End": 723.84, "Text": " So using things like, you know, firewall to determine what services may be running,"}, {"Time_Start": 724.0000000000001, "Time_End": 727.82, "Text": " or an in-map as well, just try to determine what kind of services are running."}, {"Time_Start": 727.9000000000001, "Time_End": 730.6, "Text": " You get roughly maybe an idea of what you've got there on the inside."}, {"Time_Start": 732.1400000000001, "Time_End": 740.3600000000001, "Text": " For the most parts, we usually only need, as attackers, you only, you're only going to come in on one port for the most part,"}, {"Time_Start": 740.36, "Time_End": 743.44, "Text": " unless you're doing something really oddball and sophisticated."}, {"Time_Start": 744.08, "Time_End": 748.76, "Text": " But, you know, for example, most people leave open port 25, they leave them port 80,"}, {"Time_Start": 749.1, "Time_End": 750.9, "Text": " and those are going to be kind of things you're looking for."}, {"Time_Start": 751.7, "Time_End": 758.54, "Text": " State table manipulation, this has to do with the FTP thing that came out to where I can,"}, {"Time_Start": 759.1, "Time_End": 762.88, "Text": " you know, with passive FTP, I'm going to actually put entries into the state table,"}, {"Time_Start": 763.42, "Time_End": 765.58, "Text": " and now I'm going to have a way into there."}, {"Time_Start": 765.58, "Time_End": 769.54, "Text": " That kind of was the lead-up to what that black hat,"}, {"Time_Start": 770.36, "Time_End": 772.6, "Text": " presentation was on checkpoint."}, {"Time_Start": 775.44, "Time_End": 781.02, "Text": " Obviously, if a site has intrusion detection, you'll want to do something to avoid that, if that is your"}, {"Time_Start": 781.02, "Time_End": 782.76, "Text": " call or cause."}, {"Time_Start": 785.26, "Time_End": 790.64, "Text": " Obviously, if there's some way that you can manipulate the data that they're going to detect,"}, {"Time_Start": 790.86, "Time_End": 795.24, "Text": " because for the most, these are pattern matching for the most part, the network-based ones"}, {"Time_Start": 795.24, "Time_End": 795.88, "Text": " are pattern matching."}, {"Time_Start": 796.0600000000001, "Time_End": 799.4200000000001, "Text": " So you can go ahead and maybe try and alter that data, but the detects, but the detection, you can go ahead and maybe try and alter"}, {"Time_Start": 799.4200000000001, "Time_End": 801.1, "Text": " that data, but the attack will still work."}, {"Time_Start": 801.1800000000001, "Time_End": 802.2400000000001, "Text": " That'd be a good way to do it."}, {"Time_Start": 802.58, "Time_End": 803.3800000000001, "Text": " Fragmented packets."}, {"Time_Start": 803.98, "Time_End": 807.1200000000001, "Text": " I know that a couple of years ago, there was a big thing at Black Hat"}, {"Time_Start": 807.1200000000001, "Time_End": 811.3600000000001, "Text": " and a paper that was released that talked about a number of different"}, {"Time_Start": 811.3600000000001, "Time_End": 814.6200000000001, "Text": " ways to get past intrusion detection, and one of them was using"}, {"Time_Start": 814.6200000000001, "Time_End": 815.6200000000001, "Text": " fragmented packets."}, {"Time_Start": 817.5000000000001, "Time_End": 821.5200000000001, "Text": " I think that most of the vendors, up until about maybe six months"}, {"Time_Start": 821.5200000000001, "Time_End": 825.5000000000001, "Text": " ago, most of the vendors were still vulnerable to this."}, {"Time_Start": 825.58, "Time_End": 828.3000000000001, "Text": " I think there's a few more that are just now getting on board and their patching."}, {"Time_Start": 828.3000000000001, "Time_End": 831.98, "Text": " But, you know, that's still a valid thing to try."}, {"Time_Start": 832.0600000000001, "Time_End": 839.44, "Text": " Did I assess, does anyone know if the real secure stuff actually is handling fragmented packets now?"}, {"Time_Start": 840.7800000000001, "Time_End": 841.98, "Text": " 5.0, supposedly."}, {"Time_Start": 842.46, "Time_End": 842.7, "Text": " Okay."}, {"Time_Start": 843.1, "Time_End": 845.0000000000001, "Text": " Vote of confidence there, supposedly."}, {"Time_Start": 845.1400000000001, "Time_End": 845.32, "Text": " Great."}, {"Time_Start": 846.0400000000001, "Time_End": 846.34, "Text": " You know."}, {"Time_Start": 847.1, "Time_End": 848.96, "Text": " Now someone else is saying, no, it's not."}, {"Time_Start": 850.3800000000001, "Time_End": 850.7400000000001, "Text": " Okay."}, {"Time_Start": 852.3800000000001, "Time_End": 853.22, "Text": " There we go."}, {"Time_Start": 853.5200000000001, "Time_End": 855.0200000000001, "Text": " So use that then."}, {"Time_Start": 855.2400000000001, "Time_End": 855.5400000000001, "Text": " Great."}, {"Time_Start": 855.54, "Time_End": 866.12, "Text": " Another way of avoiding intrusion detection, which is something that I saw at my previous employer,"}, {"Time_Start": 867.66, "Time_End": 876.26, "Text": " was that if there was a lot of false positives, then the system administrators started losing confidence in it,"}, {"Time_Start": 876.3, "Time_End": 878.5, "Text": " and we'll start distrusting it."}, {"Time_Start": 879.38, "Time_End": 881.7199999999999, "Text": " Distraction type things are also a real good thing."}, {"Time_Start": 882.2199999999999, "Time_End": 885.52, "Text": " Hitting the thing with a ton of port scans, and then you launch your little"}, {"Time_Start": 885.54, "Time_End": 887.3399999999999, "Text": " attack thing and you get in."}, {"Time_Start": 887.8, "Time_End": 893.28, "Text": " I mean, you're just basically, they're trying to track down all this other activity and then you get"}, {"Time_Start": 893.28, "Time_End": 897.16, "Text": " the, you slip in the one thing that I've actually seen."}, {"Time_Start": 897.62, "Time_End": 904.28, "Text": " Another one would be to make sure that if you're going to be logged, and this has to do mainly"}, {"Time_Start": 904.28, "Time_End": 910.9599999999999, "Text": " with the, you know, IDS stuff that looks at, that scrapes through logs, there's looking"}, {"Time_Start": 910.9599999999999, "Time_End": 911.8399999999999, "Text": " for various things."}, {"Time_Start": 911.8399999999999, "Time_End": 915.52, "Text": " If you make your entries into those logs look like."}, {"Time_Start": 915.54, "Time_End": 923.0999999999999, "Text": " normal log type entries, then there's a very good chance that your stuff will go undetected."}, {"Time_Start": 923.6999999999999, "Time_End": 930.26, "Text": " I know that several years ago, well, actually, it's maybe less than maybe a couple of years ago,"}, {"Time_Start": 930.26, "Time_End": 938.16, "Text": " I know that the Shadow IDS, if you read through the manual and filed it exactly the way it was"}, {"Time_Start": 938.16, "Time_End": 943.9, "Text": " written, it said, okay, you're going to have a lot of stuff in your logs, and Shadow does not do"}, {"Time_Start": 943.9, "Time_End": 949.28, "Text": " stuff in real time, it actually goes through and looks at logs. So if I'm doing stuff,"}, {"Time_Start": 950.52, "Time_End": 954.3, "Text": " as I said, if you're, if you see a lot of stuff with the source port of 80, that's all your"}, {"Time_Start": 954.3, "Time_End": 960.16, "Text": " web traffic. So you may just want to skip and dump everything with the source port of 80. This was"}, {"Time_Start": 960.16, "Time_End": 965.16, "Text": " basically in the instruction. So then all you had to do is say, okay, my attacks now are all going"}, {"Time_Start": 965.16, "Time_End": 969.6, "Text": " to be source port 80, and they're not going to catch any of them. And they were wondering why"}, {"Time_Start": 969.6, "Time_End": 973.88, "Text": " they were having all these.gov and dot-mill website defacements. And I think that was probably"}, {"Time_Start": 973.9, "Time_End": 976.86, "Text": " we have a pretty good indication right there of it."}, {"Time_Start": 980.9399999999999, "Time_End": 985.38, "Text": " Whenever you're getting all these little pieces of data from all these different sources,"}, {"Time_Start": 985.54, "Time_End": 987.52, "Text": " you need to start pulling all this stuff together."}, {"Time_Start": 989.16, "Time_End": 993.76, "Text": " And you've got to remember that even the smallest amount of data that you may collect against a target,"}, {"Time_Start": 993.88, "Time_End": 994.86, "Text": " this can be reused."}, {"Time_Start": 995.1, "Time_End": 997.14, "Text": " This could possibly be reused in the future."}, {"Time_Start": 997.6999999999999, "Time_End": 1001.4399999999999, "Text": " I do know there's people out there that will scan and scan and scan and scan and scan,"}, {"Time_Start": 1001.4399999999999, "Time_End": 1003.3, "Text": " and they build up these large databases of,"}, {"Time_Start": 1003.9, "Time_End": 1008.16, "Text": " various ports open and stuff. They may not use that stuff for a long time."}, {"Time_Start": 1008.24, "Time_End": 1013.54, "Text": " It's important to realize that whether you're, you know, attacking or defending, that that's very"}, {"Time_Start": 1013.54, "Time_End": 1022.68, "Text": " important. And a lot of things, like if I have, you know, just one little spot where I can, you know,"}, {"Time_Start": 1023.18, "Time_End": 1027.72, "Text": " perhaps get in partway, maybe I've got another spot somewhere else, looking at each one of these"}, {"Time_Start": 1027.72, "Time_End": 1029.5, "Text": " various steps."}, {"Time_Start": 1033.9, "Time_End": 1038.9, "Text": " Well, I'll go through here, and I've kind of edited a lot of this."}, {"Time_Start": 1039.0, "Time_End": 1047.46, "Text": " I've done some screen depths of just basically what a live site would look like if you want to do some mapping on here."}, {"Time_Start": 1047.6000000000001, "Time_End": 1049.1000000000001, "Text": " And I'll kind of go through it here real quick."}, {"Time_Start": 1050.2, "Time_End": 1052.48, "Text": " Do it Who is against the Target Company."}, {"Time_Start": 1052.6200000000001, "Time_End": 1055.24, "Text": " I think I kind of messed that up the way I've got that type there."}, {"Time_Start": 1055.8400000000001, "Time_End": 1061.6000000000001, "Text": " Doing it Who Is, first thing I want to determine is get the servers, their name servers."}, {"Time_Start": 1061.6, "Time_End": 1071.4599999999998, "Text": " a lot of times someone will, it's fairly common for someone to have their ISP as a backup name server."}, {"Time_Start": 1071.6599999999999, "Time_End": 1079.84, "Text": " So sometimes if you're going after a zone dump to pull down all the addresses, it's usually safer to go against the ISP."}, {"Time_Start": 1081.2199999999998, "Time_End": 1091.3799999999999, "Text": " However, in this particular case, this is actually a former employer, I, you know, I just went out there, they did not list the ISP, okay?"}, {"Time_Start": 1091.6, "Time_End": 1093.3999999999999, "Text": " they had their own stuff."}, {"Time_Start": 1093.5, "Time_End": 1100.4199999999998, "Text": " So I went ahead and started poking around and looking at that, doing trace routes to the various boxes."}, {"Time_Start": 1100.62, "Time_End": 1102.56, "Text": " I've got these, I don't know, that shows up okay."}, {"Time_Start": 1103.1599999999999, "Time_End": 1107.6799999999998, "Text": " I've got it highlighted there in brighter white."}, {"Time_Start": 1107.9399999999998, "Time_End": 1113.7199999999998, "Text": " It looks like their ISP is Southwestern Bell as it goes in there."}, {"Time_Start": 1114.6399999999999, "Time_End": 1120.3799999999999, "Text": " Now, I do a trace route using some, using the other box, just to be sure."}, {"Time_Start": 1120.38, "Time_End": 1126.64, "Text": " my gosh, they've got a second ISP there, which is CW.net, which is cable and wireless."}, {"Time_Start": 1130.92, "Time_End": 1137.68, "Text": " Next thing I did was I went out and did a zone dump on them, since they left that wide open."}, {"Time_Start": 1137.74, "Time_End": 1143.74, "Text": " As you can see, I got back a huge amount of answers on that. So now I've got a ton of stuff."}, {"Time_Start": 1145.0800000000002, "Time_End": 1150.3600000000001, "Text": " This, using a tool called ICMP and NUM that I wrote, I started, I started,"}, {"Time_Start": 1150.38, "Time_End": 1157.5800000000002, "Text": " I tried doing some ping sweeps just with echo, and they had echo blocks, so doing ping sweeps with a timestamp."}, {"Time_Start": 1157.64, "Time_End": 1162.3400000000001, "Text": " I was able to basically enumerate a lot of hosts there."}, {"Time_Start": 1163.14, "Time_End": 1173.2600000000002, "Text": " One interesting thing is that NT does not respond properly to a lot of these ICMP things."}, {"Time_Start": 1173.2600000000002, "Time_End": 1180.3600000000001, "Text": " So if you had a segment, yeah, but for the most part, if someone, just a default, a default,"}, {"Time_Start": 1180.38, "Time_End": 1188.8000000000002, "Text": " saying if you install services, for the most part, if you, a normal installation of NT,"}, {"Time_Start": 1188.92, "Time_End": 1195.3600000000001, "Text": " if you go through and sweep them with ping, normal echo packets, you get back replies and then sweep them"}, {"Time_Start": 1195.3600000000001, "Time_End": 1201.4, "Text": " them with, with a timestamp. All the ones that don't answer on the timestamp, those are probably"}, {"Time_Start": 1201.4, "Time_End": 1206.7600000000002, "Text": " 95, 98, and NT boxes. They fixed it in Win 2K."}, {"Time_Start": 1210.38, "Time_End": 1217.14, "Text": " Looking over the public systems, what they have in the DMZ, particularly large companies,"}, {"Time_Start": 1217.24, "Time_End": 1225.5400000000002, "Text": " if they have any kind of e-commerce presence, don't just look at for WWW, also look for WW2, and, you know,"}, {"Time_Start": 1225.74, "Time_End": 1229.0400000000002, "Text": " I've even seen webdev."}, {"Time_Start": 1229.3400000000001, "Time_End": 1235.38, "Text": " Dot whatever, sitting out there in the DMZ, they've got to test it, and so it'll be sitting out there,"}, {"Time_Start": 1235.38, "Time_End": 1239.94, "Text": " and sometimes this will have a lot more lax security on it."}, {"Time_Start": 1240.38, "Time_End": 1248.66, "Text": " looking through and exploring all those public systems, a lot of times will give you a lot of good information."}, {"Time_Start": 1250.68, "Time_End": 1254.92, "Text": " Scanning, this is a real, I've got two scans that you can see here."}, {"Time_Start": 1254.98, "Time_End": 1262.72, "Text": " The first one with NMAP, as, you know, I did it polite, and as you can see, I got back a lot of answers there."}, {"Time_Start": 1263.6000000000001, "Time_End": 1269.3200000000002, "Text": " And then down towards the bottom here, here's another run of NMAP, where I'm not"}, {"Time_Start": 1269.32, "Time_End": 1273.82, "Text": " I don't have the polite stuff going."}, {"Time_Start": 1274.5, "Time_End": 1278.0, "Text": " And for the same address, it shows me that no ports are open."}, {"Time_Start": 1278.52, "Time_End": 1278.76, "Text": " Okay?"}, {"Time_Start": 1278.96, "Time_End": 1282.72, "Text": " I've got an IDS system now that probably did something."}, {"Time_Start": 1282.82, "Time_End": 1285.48, "Text": " I got something in there that we hadn't triggered that."}, {"Time_Start": 1285.56, "Time_End": 1287.7, "Text": " That's an example of where you're doing the scanning,"}, {"Time_Start": 1288.56, "Time_End": 1292.3, "Text": " and, you know, I do this from a box that I don't really care about,"}, {"Time_Start": 1292.54, "Time_End": 1294.3799999999999, "Text": " whether they learn the IP address or not."}, {"Time_Start": 1294.3799999999999, "Time_End": 1298.58, "Text": " I want to actually try and trigger the stuff that's"}, {"Time_Start": 1298.58, "Time_End": 1302.6999999999998, "Text": " out there to secure the network to try to see what it is."}, {"Time_Start": 1305.3999999999999, "Time_End": 1312.78, "Text": " Here's a scan, I swear to God, outside of changing the domain name, I swear to God, that was the host name."}, {"Time_Start": 1312.86, "Time_End": 1314.76, "Text": " The host name of the firewall was firewall."}, {"Time_Start": 1315.3999999999999, "Time_End": 1316.8799999999999, "Text": " That was a..."}, {"Time_Start": 1316.8799999999999, "Time_End": 1319.46, "Text": " The what now?"}, {"Time_Start": 1321.54, "Time_End": 1323.1999999999998, "Text": " Yeah, they use router."}, {"Time_Start": 1324.3999999999999, "Time_End": 1326.5, "Text": " You know, for the router, you know, for the router, you know."}, {"Time_Start": 1327.1, "Time_End": 1328.24, "Text": " And that's what it was."}, {"Time_Start": 1328.58, "Time_End": 1331.24, "Text": " pretty difficult to spot, you know, the firewall, there."}, {"Time_Start": 1331.24, "Time_End": 1333.52, "Text": " Oh, firewall dot, whatever."}, {"Time_Start": 1333.52, "Time_End": 1339.9199999999998, "Text": " And actually, too, their VPN box was, host's name was VPN, okay?"}, {"Time_Start": 1341.0, "Time_End": 1343.04, "Text": " But for some, and I thought, well, it's, you know,"}, {"Time_Start": 1343.04, "Time_End": 1347.54, "Text": " maybe I'll find the IDS that way, but I, no, they actually didn't do that, you know."}, {"Time_Start": 1352.34, "Time_End": 1357.98, "Text": " The reason I use two dash of ease, verbose, verbose, you get more, more stuff back."}, {"Time_Start": 1358.58, "Time_End": 1363.54, "Text": " you know, because otherwise, it wouldn't have filled up this screen, you know, so."}, {"Time_Start": 1368.4399999999998, "Time_End": 1373.02, "Text": " If you look there and you see that some of the stuff is in a filtered state,"}, {"Time_Start": 1373.6399999999999, "Time_End": 1381.0, "Text": " which means that when I scan them, it means that something out there outside."}, {"Time_Start": 1381.1599999999999, "Time_End": 1383.1799999999998, "Text": " I'm scanning the firewall, and I think about this, I'm scanning the firewall, and I think about this,"}, {"Time_Start": 1383.1799999999998, "Time_End": 1388.02, "Text": " I'm scanning the firewall, but for some reason they're doing filtering,"}, {"Time_Start": 1388.58, "Time_End": 1390.98, "Text": " outside the firewall."}, {"Time_Start": 1392.78, "Time_End": 1394.3999999999999, "Text": " That's really kind of odd."}, {"Time_Start": 1394.48, "Time_End": 1400.1, "Text": " And that right there, it's just like a red flag that says, you know, they probably had some type of firewall problem."}, {"Time_Start": 1400.1999999999998, "Time_End": 1404.4399999999998, "Text": " They couldn't figure out how to do something, so they had to just go out there and put some stuff in the router."}, {"Time_Start": 1405.9399999999998, "Time_End": 1410.04, "Text": " And, you know, okay, 139, I think we know what that is."}, {"Time_Start": 1411.84, "Time_End": 1413.48, "Text": " 161, S&MP."}, {"Time_Start": 1414.84, "Time_End": 1418.56, "Text": " But the real telling one here is the 256, 256, 244."}, {"Time_Start": 1418.58, "Time_End": 1425.08, "Text": " 57 to 58, okay? That's, that right there that says that's a checkpoint. Okay, that's what"}, {"Time_Start": 1425.08, "Time_End": 1429.08, "Text": " that tells me right there. That's the checkpoint. Those are the ports that a checkpoint firewall"}, {"Time_Start": 1429.08, "Time_End": 1435.6999999999998, "Text": " uses if you're going to do remote management on the box. And apparently they didn't know how"}, {"Time_Start": 1435.6999999999998, "Time_End": 1440.24, "Text": " to turn it off at the firewall. They had to do it on the router outside so he couldn't manage the firewall"}, {"Time_Start": 1440.24, "Time_End": 1445.98, "Text": " from the outside, which is a shame, because that would have possibly simplified a lot of things."}, {"Time_Start": 1445.98, "Time_End": 1452.82, "Text": " But anyway, so here's the mapping of how this went with this, just to give you an idea."}, {"Time_Start": 1453.46, "Time_End": 1458.16, "Text": " All right, I know who my ISPs are, okay, cable and wireless and southwestern belt,"}, {"Time_Start": 1458.94, "Time_End": 1464.54, "Text": " to very, very fine and very secure ISPs."}, {"Time_Start": 1466.34, "Time_End": 1472.72, "Text": " And just slowly I go through there, I determine, you know, where the boxes are, who's pointing to what,"}, {"Time_Start": 1472.72, "Time_End": 1475.96, "Text": " and it was fairly easy to determine what was in the dean."}, {"Time_Start": 1475.98, "Time_End": 1483.44, "Text": " and what was not. And I was able to do just with a little bit of, you know, sending the packets in"}, {"Time_Start": 1483.44, "Time_End": 1489.08, "Text": " and doing the trace-right thing here and there, what not. I could tell that in some cases, I was getting"}, {"Time_Start": 1489.08, "Time_End": 1495.58, "Text": " one extra hop as I went in. And I didn't know the exact layout internally where all this stuff's"}, {"Time_Start": 1495.58, "Time_End": 1500.4, "Text": " crossing over, but I started figuring out that they had some level of redundancy. There was kind of a"}, {"Time_Start": 1500.4, "Time_End": 1505.96, "Text": " default path for some of this stuff. But in other cases, they kind of had a redundant."}, {"Time_Start": 1505.98, "Time_End": 1512.2, "Text": " thing here. And I can see why they did it after I started looking a little more because cable and"}, {"Time_Start": 1512.2, "Time_End": 1522.02, "Text": " wireless, whoever the big guy was, you know, you, UNET or whatever, at that level. They basically"}, {"Time_Start": 1522.02, "Time_End": 1529.1200000000001, "Text": " had two, these, these two ISPs went up to two completely different with a larger backbone providers."}, {"Time_Start": 1529.1200000000001, "Time_End": 1533.18, "Text": " So they're wanting, they were working on getting, you know, a whole bunch of redundancy going there."}, {"Time_Start": 1535.98, "Time_End": 1540.72, "Text": " Pretty much at that point, you start picking off and figuring out what boxes you got in there."}, {"Time_Start": 1541.08, "Time_End": 1551.52, "Text": " And then you get to the point where you've actually started getting some real indication as to what the various boxes are."}, {"Time_Start": 1552.04, "Time_End": 1556.46, "Text": " And like I said, this is all pretty much live data."}, {"Time_Start": 1556.46, "Time_End": 1565.1, "Text": " So, you know, now if I'm going to attack, I've got a pretty good feel for what I'm going up against."}, {"Time_Start": 1565.98, "Time_End": 1566.98, "Text": " there in the network."}, {"Time_Start": 1566.98, "Time_End": 1574.48, "Text": " Something I wanted to talk about as far as, I'm going to touch on this attack stuff,"}, {"Time_Start": 1574.48, "Time_End": 1581.48, "Text": " so it's just kind of somewhat new, hold on here, send someone to voicemail."}, {"Time_Start": 1581.48, "Time_End": 1590.28, "Text": " Um, there's two types of attacks as far as distributed attacks go."}, {"Time_Start": 1590.28, "Time_End": 1595.96, "Text": " Those are ones that do not require direct observation of the results."}, {"Time_Start": 1595.98, "Time_End": 1599.66, "Text": " those attacks that do require direct observation of the results."}, {"Time_Start": 1600.6200000000001, "Time_End": 1602.74, "Text": " Okay, and I'll give you some examples of what I mean by that."}, {"Time_Start": 1604.22, "Time_End": 1611.28, "Text": " Basic model here, we have, and this is commonly found in your distributed denial of service."}, {"Time_Start": 1612.74, "Time_End": 1616.64, "Text": " And that is you have a bunch of agents sitting out on computers that have been compromised,"}, {"Time_Start": 1617.74, "Time_End": 1624.54, "Text": " the zombies that are sitting out there, and then you have your servers that send all their stuff to the zombies."}, {"Time_Start": 1624.54, "Time_End": 1633.3, "Text": " By the way, I want to say something about the zombie thing, because I caught a lot of shit for a zombie zapper, okay, because of the name that Bindview released."}, {"Time_Start": 1633.42, "Time_End": 1640.26, "Text": " I did not name that product, marketing, named that product because they read zombie somewhere in a trade magazine."}, {"Time_Start": 1640.3999999999999, "Time_End": 1649.36, "Text": " I just wanted to point that out while I've got, you know, a group of people, like, you know, actually care about, you know, it's just so, very scary."}, {"Time_Start": 1649.52, "Time_End": 1653.52, "Text": " I couldn't come with a better name, so, but, you know, nonetheless, I didn't name that."}, {"Time_Start": 1653.52, "Time_End": 1653.84, "Text": " Anyway."}, {"Time_Start": 1654.54, "Time_End": 1662.1399999999999, "Text": " So you have your agents out there, they receive their stuff from the various servers, and there's usually some client that talks to the server that does this."}, {"Time_Start": 1663.36, "Time_End": 1677.1399999999999, "Text": " With the distributed denial of service, you don't need to see the results of the, and you see the responses back from those packets that you're sending in to keep people from buying a book on Amazon for an hour and a half."}, {"Time_Start": 1680.02, "Time_End": 1684.3, "Text": " This is a little bit more of an advanced type thing."}, {"Time_Start": 1684.54, "Time_End": 1690.34, "Text": " And then we'll do this. That's where I forge the timestamp requests into the target."}, {"Time_Start": 1690.52, "Time_End": 1699.1599999999999, "Text": " The timestamp replies come back, and I sniff the replies, and I sniff the replies, and I forge the source address so that as the packets come back by,"}, {"Time_Start": 1699.24, "Time_End": 1713.3, "Text": " then I'm actually going to be able to sniff the replies. Okay, now obviously, if you're forging to address on your same segment, it's a lot easier, or you'd have to compromise one of those rock-hard secure ISPs like Southwestern Bell."}, {"Time_Start": 1714.54, "Time_End": 1716.26, "Text": " to be able to do this kind of stuff."}, {"Time_Start": 1717.48, "Time_End": 1719.48, "Text": " Okay, this is the one that's really fun."}, {"Time_Start": 1719.58, "Time_End": 1723.6599999999999, "Text": " This is the one that I really, really, really, really like."}, {"Time_Start": 1724.72, "Time_End": 1727.42, "Text": " And we'll have to go through this step by step."}, {"Time_Start": 1727.54, "Time_End": 1732.48, "Text": " Okay, I've got my target, and they've got a firewall out in front, okay?"}, {"Time_Start": 1732.6399999999999, "Time_End": 1735.2, "Text": " So they're all nice, neat, and secure."}, {"Time_Start": 1736.7, "Time_End": 1743.42, "Text": " First thing I do is I break into one of those rock-solid ISPs."}, {"Time_Start": 1744.54, "Time_End": 1748.1399999999999, "Text": " Yeah. Is it just me?"}, {"Time_Start": 1750.54, "Time_End": 1753.82, "Text": " I didn't have already anything to drink last night at all."}, {"Time_Start": 1754.18, "Time_End": 1757.34, "Text": " Oh, okay, there we go. Wow. Okay."}, {"Time_Start": 1758.3, "Time_End": 1770.04, "Text": " Anyway, you compromise one of those upstream ISPs. Now this upstream host here, I am never going to send a packet from this upstream host in towards that target at all."}, {"Time_Start": 1770.04, "Time_End": 1775.0, "Text": " So this upstream host is not going to be sending any packets for me."}, {"Time_Start": 1775.08, "Time_End": 1777.36, "Text": " It's not going to show up in any logs over there whatsoever."}, {"Time_Start": 1777.54, "Time_End": 1780.6599999999999, "Text": " I want to protect that guy. Okay, he's gold. All right?"}, {"Time_Start": 1781.94, "Time_End": 1782.94, "Text": " All right. Next thing here."}, {"Time_Start": 1784.34, "Time_End": 1789.32, "Text": " I've got my various attack nodes here, and I got my master node controlling them."}, {"Time_Start": 1790.7, "Time_End": 1795.8799999999999, "Text": " And what I want to do here is if I want the attack nodes to do something to the target,"}, {"Time_Start": 1795.8799999999999, "Time_End": 1800.02, "Text": " and let's say if they're doing some type of pro, uh, uh, uh, uh, pro,"}, {"Time_Start": 1800.04, "Time_End": 1806.54, "Text": " they're going to scan, whatever. Okay. I control them with the master node and I send my stuff up there"}, {"Time_Start": 1806.54, "Time_End": 1808.6399999999999, "Text": " because these attack notes, what they're going to do."}, {"Time_Start": 1811.48, "Time_End": 1817.56, "Text": " They'll send in their stuff through the firewall. Now, I may be, what I'm doing is I may be using"}, {"Time_Start": 1817.56, "Time_End": 1824.44, "Text": " as far as a source address. I could be using a source address that is a trusted partner."}, {"Time_Start": 1825.74, "Time_End": 1830.02, "Text": " In this whole business to business thing that everyone's"}, {"Time_Start": 1830.04, "Time_End": 1833.42, "Text": " doing with this whole e-commerce thing."}, {"Time_Start": 1834.54, "Time_End": 1839.18, "Text": " I may have, the target may have, because back at public records, you know, people that they're doing"}, {"Time_Start": 1839.18, "Time_End": 1845.96, "Text": " business with, large customers of them, large vendors for them, they may have extra rules in the"}, {"Time_Start": 1845.96, "Time_End": 1852.76, "Text": " firewall, and I'm pretty sure that especially the administrators in the audience will attest to that"}, {"Time_Start": 1852.76, "Time_End": 1856.7, "Text": " how often they've had to, all right, we'll go ahead and open up blah, blah, blah,"}, {"Time_Start": 1856.7, "Time_End": 1860.02, "Text": " port for what's their faces, because they make us a lot of money."}, {"Time_Start": 1860.04, "Time_End": 1862.1, "Text": " or we do a lot of business with it."}, {"Time_Start": 1862.24, "Time_End": 1864.06, "Text": " I know that I've seen it a dozen times."}, {"Time_Start": 1864.86, "Time_End": 1870.36, "Text": " So those are the source addresses that I want to have coming in on these attacks or these various"}, {"Time_Start": 1870.36, "Time_End": 1871.02, "Text": " probes."}, {"Time_Start": 1871.82, "Time_End": 1873.5, "Text": " So the replies are flying by."}, {"Time_Start": 1873.6, "Time_End": 1878.56, "Text": " Now, where they're flying by is that upstream host, so I can now sniff the replies."}, {"Time_Start": 1879.6, "Time_End": 1879.84, "Text": " Okay?"}, {"Time_Start": 1880.6, "Time_End": 1889.24, "Text": " And then, of course, to kind of complete the picture, put a link in here between the upstream host and"}, {"Time_Start": 1889.24, "Time_End": 1894.66, "Text": " the master note. Now, what this allows me to do then is if I'm doing a scan, for example,"}, {"Time_Start": 1895.86, "Time_End": 1899.64, "Text": " okay, I could tell the master note, okay, I'm going to send out to these attack nodes, I'm"}, {"Time_Start": 1899.64, "Time_End": 1906.02, "Text": " going to do the scan, replies come back, I get the sniff replies in the upstream host, and then through"}, {"Time_Start": 1906.02, "Time_End": 1912.22, "Text": " a covert channel, he communicates back to the master node. This is all done, you know, with"}, {"Time_Start": 1912.22, "Time_End": 1917.42, "Text": " a, you know, encryption and all that, probably using ICMP or something like that to communicate."}, {"Time_Start": 1919.24, "Time_End": 1923.86, "Text": " And so I can also kind of expand upon this, and I can say, let's say that I want to do"}, {"Time_Start": 1923.86, "Time_End": 1928.1, "Text": " something that's going to involve a TCP three-way handshake, for example."}, {"Time_Start": 1928.52, "Time_End": 1931.4, "Text": " So what I can do is I can send from the master node to the attack nodes."}, {"Time_Start": 1931.94, "Time_End": 1935.46, "Text": " The attack notes, go ahead and send in their attacks."}, {"Time_Start": 1936.42, "Time_End": 1936.66, "Text": " Boom."}, {"Time_Start": 1937.58, "Time_End": 1939.02, "Text": " We pick it back up on the sniffers."}, {"Time_Start": 1939.1, "Time_End": 1940.02, "Text": " The reply comes out."}, {"Time_Start": 1940.38, "Time_End": 1945.28, "Text": " I can send that information back to the master node, and I can continue that whole cycle there."}, {"Time_Start": 1945.82, "Time_End": 1949.22, "Text": " And I can actually have a conversation where I'm actually engaged."}, {"Time_Start": 1949.24, "Time_End": 1954.08, "Text": " in an attack and there is nothing in those logs over there whatsoever on the firewall"}, {"Time_Start": 1954.08, "Time_End": 1958.68, "Text": " or anything on the target is going to reveal my true address."}, {"Time_Start": 1958.68, "Time_End": 1962.4, "Text": " So that's kind of the whole idea behind this."}, {"Time_Start": 1962.4, "Time_End": 1968.3, "Text": " Some other things that make this more fun is that as far as the upstream host goes, when"}, {"Time_Start": 1968.3, "Time_End": 1972.82, "Text": " he's sending information up here to the master node, he's going to use roughly the same"}, {"Time_Start": 1972.82, "Time_End": 1977.5, "Text": " type of technique that I'm using to grab these sniff replies, okay?"}, {"Time_Start": 1977.5, "Time_End": 1979.22, "Text": " All these replies, they're destined for some."}, {"Time_Start": 1979.24, "Time_End": 1984.4, "Text": " place over here. The sniffer that's running here on the upstream host just knows what to pick up."}, {"Time_Start": 1984.76, "Time_End": 1988.96, "Text": " I'm going to do the same thing. I don't send that stuff from the upstream host directly to the master node."}, {"Time_Start": 1989.8, "Time_End": 1995.18, "Text": " I send it to somewhere on his same segment or somewhere past him. Do where he's going to pick it up, sniffing."}, {"Time_Start": 1995.6, "Time_End": 1998.9, "Text": " And it's the same thing I'm going to do for sending from the master node to the attack nodes."}, {"Time_Start": 1999.28, "Time_End": 2005.2, "Text": " I'm not going to send directly to those IP addresses. I'll send to those segments. I'll send somewhere along the way."}, {"Time_Start": 2007.2, "Time_End": 2009.04, "Text": " Obviously, that's kind of complex."}, {"Time_Start": 2009.24, "Time_End": 2015.02, "Text": " If you own union net, then you're probably, this is going to be a lot easier to set up."}, {"Time_Start": 2015.14, "Time_End": 2019.82, "Text": " But that's kind of the model, kind of the idea behind all this."}, {"Time_Start": 2022.1, "Time_End": 2025.18, "Text": " And no, I don't have the software written for this, okay? Sorry."}, {"Time_Start": 2027.58, "Time_End": 2030.6, "Text": " But I'm sure someone will come up with it."}, {"Time_Start": 2030.6, "Time_End": 2039.0, "Text": " I did a talk at Sands sometime last year, right before the distributed denial of service."}, {"Time_Start": 2039.24, "Time_End": 2044.08, "Text": " I was talking about some of this stuff on a much smaller scale."}, {"Time_Start": 2044.44, "Time_End": 2050.16, "Text": " And then, boom, you know, I get an email from someone after all the distributed denial of service stuff,"}, {"Time_Start": 2050.2, "Time_End": 2055.22, "Text": " from someone that saw the talk at Sands and said, you know, I think they looked at your presentation."}, {"Time_Start": 2055.38, "Time_End": 2058.44, "Text": " They ripped you off, dude, because they, you know, that's kind of stuff you're doing."}, {"Time_Start": 2059.64, "Time_End": 2063.42, "Text": " Well, probably, I would expect the natural evolution as the stuff moves along."}, {"Time_Start": 2063.52, "Time_End": 2067.34, "Text": " This is going to be, I would think this would be the next type thing."}, {"Time_Start": 2069.2400000000002, "Time_End": 2074.6000000000004, "Text": " Free stuff, we're kind of getting towards the end of the presentation here."}, {"Time_Start": 2075.6400000000003, "Time_End": 2084.76, "Text": " The vendor that paid, or my boss, is a Bideview, since sort of the vendor that's supplying some software,"}, {"Time_Start": 2085.0400000000004, "Time_End": 2088.5800000000004, "Text": " and I'm wearing their shorts, and they paid my plane ticket out here."}, {"Time_Start": 2089.1800000000003, "Time_End": 2093.42, "Text": " You know, I should at least go ahead and plug the product I work on during the day."}, {"Time_Start": 2094.86, "Time_End": 2098.36, "Text": " The Sands came out with a list of the top ten."}, {"Time_Start": 2099.2400000000002, "Time_End": 2103.86, "Text": " security things that you all need to check for."}, {"Time_Start": 2104.36, "Time_End": 2107.34, "Text": " I think all it was is just a list, so attackers now had a list."}, {"Time_Start": 2107.44, "Time_End": 2108.6600000000003, "Text": " Oh, I'll just try these first."}, {"Time_Start": 2108.88, "Time_End": 2114.96, "Text": " But, you know, they've got the list here, and Hacker Shield has what they call a rapid-fire update."}, {"Time_Start": 2115.0600000000004, "Time_End": 2117.3, "Text": " Hacker Shield is a security scanner."}, {"Time_Start": 2118.1200000000003, "Time_End": 2120.5200000000004, "Text": " Has an update, an all-inclusive update."}, {"Time_Start": 2120.6400000000003, "Time_End": 2126.2200000000003, "Text": " You can download Hacker Shield for free off the net and load in this thing, and it's good for 30 days."}, {"Time_Start": 2126.2200000000003, "Time_End": 2128.48, "Text": " And I think it's like a 25 IP addresses."}, {"Time_Start": 2129.2400000000002, "Time_End": 2136.2400000000002, "Text": " and whatnot. Vlad, the scanner, is what the Bindview Razor team, put together."}, {"Time_Start": 2136.2400000000002, "Time_End": 2143.2400000000002, "Text": " It's a security scanner that only does the Sands Top 10. Okay, so it is somewhat limited,"}, {"Time_Start": 2143.2400000000002, "Time_End": 2147.2400000000002, "Text": " but it is freeware, it's open source, you can get it out off the Razor website."}, {"Time_Start": 2147.2400000000002, "Time_End": 2158.2400000000002, "Text": " It has some pretty cool stuff in it. One of the things it has in it, it has a pretty nice and neat CGI scanner."}, {"Time_Start": 2158.2400000000002, "Time_End": 2161.6800000000003, "Text": " It doesn't do any of the evasion stuff that Whisker does."}, {"Time_Start": 2162.5000000000005, "Time_End": 2173.6600000000003, "Text": " And until I talked to RFP, I thought that we were doing more checks than he was, but no, it's 1.4 that's either just come out or will be out there very soon."}, {"Time_Start": 2173.7200000000003, "Time_End": 2177.6400000000003, "Text": " It's going to have probably 10 times as many, which, you know, bumma."}, {"Time_Start": 2178.1600000000003, "Time_End": 2182.0800000000004, "Text": " I'll have to snarf more stuff from him to get this up to speak."}, {"Time_Start": 2182.32, "Time_End": 2185.1000000000004, "Text": " But that's a pretty cool thing that's in there."}, {"Time_Start": 2185.1000000000004, "Time_End": 2188.2200000000003, "Text": " The other thing that's in there is, we're calling it kind of a protocol."}, {"Time_Start": 2188.2400000000002, "Time_End": 2194.1200000000003, "Text": " scanner and it's to test the user IDs and and passwords you know if they have"}, {"Time_Start": 2194.1200000000003, "Time_End": 2202.76, "Text": " weak user IDs and passwords and Vlad does telnet's all login pop three"}, {"Time_Start": 2202.76, "Time_End": 2213.0200000000004, "Text": " iMap what else does it do I'm missing a couple here oh SMB Todd where are you"}, {"Time_Start": 2213.0200000000004, "Time_End": 2217.8, "Text": " help me I can't remember oh SSH I think I said there's like six or seven of them that it does"}, {"Time_Start": 2217.8, "Time_End": 2218.6000000000004, "Text": " the"}, {"Time_Start": 2218.6000000000004, "Time_End": 2225.04, "Text": " SSH one is kind of cool because I don't think there's very many"}, {"Time_Start": 2225.04, "Time_End": 2230.36, "Text": " you know like dictionary style things that you can use to go ahead and go after"}, {"Time_Start": 2230.36, "Time_End": 2236.52, "Text": " SSH just you know saying user IDs and passwords and whatnot have the thing actually automated"}, {"Time_Start": 2236.52, "Time_End": 2241.8, "Text": " we don't have a huge amount of default accounts and password"}, {"Time_Start": 2241.8, "Time_End": 2247.78, "Text": " passwords listed in the supplied databases but obviously you could all support"}, {"Time_Start": 2247.8, "Time_End": 2254.42, "Text": " your own. And the final thing, which is a kind of a fun tool, is called"}, {"Time_Start": 2254.42, "Time_End": 2261.8, "Text": " de-spoof. And if I'm getting scanned or I'm getting a packet coming in and I'm thinking, hey, is this"}, {"Time_Start": 2261.8, "Time_End": 2268.96, "Text": " thing really, you know, a forged packet or is it the real thing or not, it'd be a kind of a,"}, {"Time_Start": 2268.96, "Time_End": 2273.6400000000003, "Text": " there should be kind of a good way to kind of tell. And what this does, de-spoof actually checks"}, {"Time_Start": 2273.6400000000003, "Time_End": 2277.78, "Text": " the TTL. It sends a packet out and tries to determine."}, {"Time_Start": 2277.8, "Time_End": 2282.8, "Text": " the real TTL from where I received the packet from. So obviously, you know, I can say,"}, {"Time_Start": 2282.8, "Time_End": 2288.8, "Text": " okay, I got the packet I suspect is forged. Let's say it has a TTL in it of, say, 50."}, {"Time_Start": 2288.8, "Time_End": 2294.8, "Text": " Okay? Now I'm going to check that and test it by setting a query packet out to that address,"}, {"Time_Start": 2294.8, "Time_End": 2301.8, "Text": " and I get a response back, and I look at that TTL. If they match, then it's probably the real thing."}, {"Time_Start": 2301.8, "Time_End": 2307.78, "Text": " If not, then maybe the thing is forged, especially if it's way off. So that's kind of a way that you can"}, {"Time_Start": 2307.8, "Time_End": 2313.8, "Text": " check. It's kind of a fun thing that you can do with that TTL. Anyway, the things, these"}, {"Time_Start": 2313.8, "Time_End": 2318.6800000000003, "Text": " tools just got put up there on the Razor website and encourage you to all go out there and download"}, {"Time_Start": 2318.6800000000003, "Time_End": 2325.0600000000004, "Text": " them and have some fun with them. Be careful with Vlad the scanner. If you're the kind of person"}, {"Time_Start": 2325.0600000000004, "Time_End": 2332.4, "Text": " that just likes to point it at whatever, okay? The protocol scanner thing is actually going"}, {"Time_Start": 2332.4, "Time_End": 2337.78, "Text": " to be considered intrusion into the system. You're trying users, user IDs,"}, {"Time_Start": 2337.8, "Time_End": 2343.8, "Text": " and passwords, but pretty much everything else is just you're looking to see if a file is there or if a service is writing or something."}, {"Time_Start": 2346.8, "Time_End": 2353.8, "Text": " I wanted to say thanks to a couple of people here. I'm not sure how to pronounce Ofen Arkin's name."}, {"Time_Start": 2353.8, "Time_End": 2367.46, "Text": " I hope I just pronounce it correctly. Some of the ICMP stuff I've been discussing up until Friday when I got over here to DefCon was theory, and he's already been doing a whole lot of research."}, {"Time_Start": 2367.8, "Time_End": 2372.98, "Text": " on that. So a lot of the theory stuff, he was able to pull something out of his backpack and says,"}, {"Time_Start": 2373.04, "Time_End": 2379.04, "Text": " no, dude, I've already checked this out. And here's some more information on it. So look for de-spoof to get"}, {"Time_Start": 2379.04, "Time_End": 2387.04, "Text": " updated with even more exciting stuff. And then Donald McLaughlin was the one that put me on the path"}, {"Time_Start": 2387.04, "Time_End": 2397.0, "Text": " about the whole tricks, all the tricks with TTL and whatnot. And so he deserves some credit on that as well."}, {"Time_Start": 2397.0, "Time_End": 2399.72, "Text": " I want to make sure that I mentioned those guys' names."}, {"Time_Start": 2401.56, "Time_End": 2411.26, "Text": " And as far as follow-up goes, obviously the NMRC website, and I promise I'm going to start updating the thing a little bit better than I have been."}, {"Time_Start": 2411.32, "Time_End": 2412.62, "Text": " I know that I've been bad about that."}, {"Time_Start": 2413.34, "Time_End": 2415.2, "Text": " But also look out on the Razor website."}, {"Time_Start": 2415.4, "Time_End": 2417.92, "Text": " Half of what I've been working on usually ends up out there."}, {"Time_Start": 2418.54, "Time_End": 2425.54, "Text": " Anyway, and probably some of the things that we work on on Razor that aren't exactly politically correct to be stuck out on"}, {"Time_Start": 2425.54, "Time_End": 2429.7599999999998, "Text": " on the Razor website, we'll probably end up on the NMRC website."}, {"Time_Start": 2430.12, "Time_End": 2432.38, "Text": " So that's kind of a thing to know."}, {"Time_Start": 2432.44, "Time_End": 2433.88, "Text": " And then I got my email addresses there."}, {"Time_Start": 2434.84, "Time_End": 2435.88, "Text": " That's pretty much it."}, {"Time_Start": 2435.92, "Time_End": 2437.62, "Text": " If we've got some questions,"}, {"Time_Start": 2439.46, "Time_End": 2440.84, "Text": " feel free to fire away."}, {"Time_Start": 2440.96, "Time_End": 2441.22, "Text": " Yes."}, {"Time_Start": 2455.54, "Time_End": 2467.82, "Text": " Okay."}, {"Time_Start": 2468.74, "Time_End": 2473.72, "Text": " The comment was about wanting some comments on how some people will modify their kernels or modify whatever so that when you're"}, {"Time_Start": 2473.7200000000003, "Time_End": 2481.6800000000003, "Text": " Some people will modify their kernels or modify whatever so that when you're getting an NMAP scan that's tried to do a fingerprint,"}, {"Time_Start": 2483.0600000000004, "Time_End": 2489.0400000000004, "Text": " maybe it's doing something, you know, maybe it's saying, oh, I'm not really this OS, I'm actually a printer."}, {"Time_Start": 2489.6800000000003, "Time_End": 2491.78, "Text": " Or something else like that."}, {"Time_Start": 2491.9, "Time_End": 2500.5800000000004, "Text": " Yeah, I mean, that's where I think this IC&P stuff that often has come up with is going to be pretty interesting."}, {"Time_Start": 2500.5800000000004, "Time_End": 2503.2400000000002, "Text": " And matter of fact, one of the things I'm going to get, when I get back home,"}, {"Time_Start": 2503.7200000000003, "Time_End": 2509.6000000000004, "Text": " is probably to work on a scanner of some type that actually uses ICMP to do fingerprinting."}, {"Time_Start": 2510.1000000000004, "Time_End": 2513.42, "Text": " That's what I mean as far as like as far as spotting a honeypot."}, {"Time_Start": 2514.6800000000003, "Time_End": 2522.96, "Text": " If you've got something that shows up on NMAP is one thing, but then you look at some of the responses coming back from ICMP,"}, {"Time_Start": 2523.26, "Time_End": 2528.42, "Text": " and it just says this is a completely different IP stack, that maybe I've got something funky happening there."}, {"Time_Start": 2531.3, "Time_End": 2532.42, "Text": " Any other questions?"}, {"Time_Start": 2533.7200000000003, "Time_End": 2540.7200000000003, "Text": " Okay, I guess not. I want to thank each and every one of you for coming visiting"}, {"Time_Start": 2540.7200000000003, "Time_End": 2545.7200000000003, "Text": " my website. I appreciate it a lot. Thank you and blessed being."}]}