{"segments": [{"Time_Start": 0.0, "Time_End": 7.26, "Text": " Oh, it's too much, it's too much."}, {"Time_Start": 7.34, "Time_End": 11.34, "Text": " In any case, first of all, I got to say, it's great to be back,"}, {"Time_Start": 11.540000000000001, "Time_End": 14.74, "Text": " but I have to give my own sly attempted humor here."}, {"Time_Start": 15.26, "Time_End": 17.16, "Text": " Okay, they got rid of Marlboro Man."}, {"Time_Start": 17.66, "Time_End": 20.46, "Text": " They got rid of, oh God, what's the,"}, {"Time_Start": 20.7, "Time_End": 24.44, "Text": " they got with a Marble Man, Spuds McKenzie died last year,"}, {"Time_Start": 25.0, "Time_End": 28.400000000000002, "Text": " and, of course, the guy there, Joe Camel is gone,"}, {"Time_Start": 28.5, "Time_End": 29.98, "Text": " and now the Taco Bell does."}, {"Time_Start": 30.0, "Time_End": 31.2, "Text": " Like, I mean, what's going on?"}, {"Time_Start": 31.46, "Time_End": 32.26, "Text": " I mean, come on."}, {"Time_Start": 32.64, "Time_End": 34.92, "Text": " You know, look, that was my weak attempted humor."}, {"Time_Start": 35.42, "Time_End": 38.72, "Text": " Okay, as I always preface my comments, you guys know,"}, {"Time_Start": 39.04, "Time_End": 43.42, "Text": " when it comes to being a software, hardware expert, I know nothing."}, {"Time_Start": 43.54, "Time_End": 46.58, "Text": " I just learned how to attach files to my email, okay?"}, {"Time_Start": 46.879999999999995, "Time_End": 50.06, "Text": " So I'm thinking I'm a hot shit now on the computer, okay?"}, {"Time_Start": 50.06, "Time_End": 57.260000000000005, "Text": " So you guys know I am not the guy to ask the technical sort of questions about."}, {"Time_Start": 57.42, "Time_End": 59.94, "Text": " My specialty is information use."}, {"Time_Start": 60.0, "Time_End": 61.82, "Text": " and information abuse."}, {"Time_Start": 62.36, "Time_End": 66.98, "Text": " Previous years, last year we showed how you can steal somebody's identity the year before that."}, {"Time_Start": 67.28, "Time_End": 69.66, "Text": " We took a part of an actress, if you guys remember."}, {"Time_Start": 69.84, "Time_End": 73.74, "Text": " We put her whole life up on the screen, and I've got to say something."}, {"Time_Start": 74.28, "Time_End": 77.76, "Text": " Every time I've come to speak on these things, because you know me,"}, {"Time_Start": 77.82, "Time_End": 84.8, "Text": " I put up the unvarnished information, I always think, well, maybe I should etch out two digits of the SSN"}, {"Time_Start": 84.8, "Time_End": 86.38, "Text": " or hide the phone number, whatever."}, {"Time_Start": 86.38, "Time_End": 89.98, "Text": " And I always tell you, well, I don't believe in some."}, {"Time_Start": 90.0, "Time_End": 95.28, "Text": " So how can I come here at DefCon and then censor my own talk?"}, {"Time_Start": 95.52, "Time_End": 100.62, "Text": " And I've always asked you guys, don't go mess these people's lives up because they're not bad people."}, {"Time_Start": 100.7, "Time_End": 101.62, "Text": " They're public figures."}, {"Time_Start": 101.96000000000001, "Time_End": 102.8, "Text": " That's why we use them."}, {"Time_Start": 102.8, "Time_End": 111.14, "Text": " And I want to say to DefCon's credit, and you guys' credit, I have never gotten any reports that anybody I've used as an example up here,"}, {"Time_Start": 111.22, "Time_End": 113.34, "Text": " you guys have not messed their lives up."}, {"Time_Start": 113.6, "Time_End": 119.08, "Text": " So I want law enforcement, wherever else, to understand that most of you guys are solid citizens."}, {"Time_Start": 119.08, "Time_End": 123.25999999999999, "Text": " You just are interested in things being open and keeping them open."}, {"Time_Start": 123.38, "Time_End": 124.64, "Text": " But I appreciate that."}, {"Time_Start": 125.75999999999999, "Time_End": 126.1, "Text": " Okay."}, {"Time_Start": 126.34, "Time_End": 127.67999999999999, "Text": " I've stroked you guys enough."}, {"Time_Start": 129.92, "Time_End": 132.02, "Text": " So what am I here talking about right now?"}, {"Time_Start": 132.12, "Time_End": 133.76, "Text": " First, the other thing before I begin,"}, {"Time_Start": 134.52, "Time_End": 136.54, "Text": " the book I'm about to talk to you about,"}, {"Time_Start": 138.04, "Time_End": 141.06, "Text": " excerpt about 10 steps you can take to protect your privacy,"}, {"Time_Start": 141.06, "Time_End": 146.62, "Text": " I need to consult with some people who are bona fide experts"}, {"Time_Start": 146.62, "Time_End": 149.06, "Text": " on using the Internet and"}, {"Time_Start": 149.08, "Time_End": 152.84, "Text": " particularly on protecting privacy on the Internet."}, {"Time_Start": 153.08, "Time_End": 155.72000000000003, "Text": " I need somebody who's got expertise."}, {"Time_Start": 155.98000000000002, "Time_End": 159.64000000000001, "Text": " It might be somebody a cult of the dead cow that might be one of you out here."}, {"Time_Start": 159.74, "Time_End": 162.12, "Text": " I need to consult with you on that chapter."}, {"Time_Start": 162.54000000000002, "Time_End": 167.10000000000002, "Text": " I will give you credit in the book, either under your hacking name or your real name if you want,"}, {"Time_Start": 167.44, "Time_End": 170.98000000000002, "Text": " and this will be a real opportunity because this will be a big mainstream book."}, {"Time_Start": 171.04000000000002, "Time_End": 174.10000000000002, "Text": " But I need somebody who is an expert on that."}, {"Time_Start": 174.18, "Time_End": 175.12, "Text": " I would appreciate it."}, {"Time_Start": 175.12, "Time_End": 179.06, "Text": " If you could come to the author table either later today or tomorrow,"}, {"Time_Start": 179.08, "Time_End": 184.16000000000003, "Text": " and talk to me about, you know, your credentials and whatever, because I really need that."}, {"Time_Start": 184.22, "Time_End": 187.48000000000002, "Text": " Because, like I said, I am not the detail expert on that."}, {"Time_Start": 188.04000000000002, "Time_End": 190.18, "Text": " Okay, let's go into what I want to talk about."}, {"Time_Start": 190.28, "Time_End": 195.02, "Text": " That is 10 steps you can take to increase your privacy."}, {"Time_Start": 195.64000000000001, "Time_End": 199.26000000000002, "Text": " I have a book that will be coming out early next year called Privacy Power."}, {"Time_Start": 199.56, "Time_End": 202.62, "Text": " How to drop out and stay out of Big Brothers databases,"}, {"Time_Start": 202.62, "Time_End": 205.96, "Text": " a guide to privacy protection and the information age."}, {"Time_Start": 206.20000000000002, "Time_End": 208.86, "Text": " And let me just give you the concept statement of the book,"}, {"Time_Start": 209.08, "Time_End": 212.66000000000003, "Text": " because this flames our whole talk here today."}, {"Time_Start": 213.28, "Time_End": 216.14000000000001, "Text": " America has become a surveillance society."}, {"Time_Start": 216.64000000000001, "Time_End": 221.18, "Text": " Private database collectors relentlessly build files on every person"}, {"Time_Start": 221.18, "Time_End": 228.08, "Text": " and government agencies use our daily activities as a pretext to monitor unsuspecting citizens."}, {"Time_Start": 228.58, "Time_End": 232.48000000000002, "Text": " Rowe awaits the individual who falls outside the norm."}, {"Time_Start": 232.48000000000002, "Time_End": 236.88000000000002, "Text": " The result can be a tax audit, the denial of credit and insurance,"}, {"Time_Start": 237.22000000000003, "Time_End": 239.06, "Text": " or even the scrutiny of law for it,"}, {"Time_Start": 239.08, "Time_End": 244.28, "Text": " officials. Privacy power, how to drop out and stay out of Big Brother's databases,"}, {"Time_Start": 244.78, "Time_End": 249.88000000000002, "Text": " is the first comprehensive guide to personal privacy protection and the information age."}, {"Time_Start": 249.88000000000002, "Time_End": 256.34000000000003, "Text": " It strips away the veil of secrecy surrounding the database collectors and reveals how they do their dirty work."}, {"Time_Start": 256.72, "Time_End": 262.42, "Text": " The book dead outlines a step-by-step plan individuals can follow to reclaim their privacy."}, {"Time_Start": 262.66, "Time_End": 269.06, "Text": " Essentially, what I'm going to try to do in this book and give you a taste of in this talk is a way that you"}, {"Time_Start": 269.08, "Time_End": 273.38, "Text": " can build what we would call privacy firewalls in your own life."}, {"Time_Start": 273.78, "Time_End": 279.53999999999996, "Text": " The problem is that the dawn of the 21st century, there is no way to have absolute privacy."}, {"Time_Start": 279.53999999999996, "Time_End": 281.64, "Text": " You can have absolute privacy, one of two ways."}, {"Time_Start": 282.2, "Time_End": 287.88, "Text": " You can go out to the Yukon or head out to Africa and live off the land in a hut, which I don't find"}, {"Time_Start": 287.88, "Time_End": 293.41999999999996, "Text": " to be too appealing, or you can go to the other extreme as some of my other books I've written on"}, {"Time_Start": 293.41999999999996, "Time_End": 297.9, "Text": " creating a new identity, and you can create a brand new identity, and then of course you have"}, {"Time_Start": 297.9, "Time_End": 298.88, "Text": " open a privacy."}, {"Time_Start": 299.08, "Time_End": 302.53999999999996, "Text": " because the person the computers think you are and who you are,"}, {"Time_Start": 302.88, "Time_End": 306.18, "Text": " but that has a price too because it's like your mom says,"}, {"Time_Start": 306.28, "Time_End": 307.62, "Text": " well, I don't understand, James."}, {"Time_Start": 307.71999999999997, "Time_End": 311.38, "Text": " Why are you getting mail in the name of, you know, Robert P. Youcomb?"}, {"Time_Start": 312.0, "Time_End": 313.64, "Text": " Well, hard to explain that."}, {"Time_Start": 313.74, "Time_End": 316.56, "Text": " And they know, what happens if Robert P. Yukham gets married?"}, {"Time_Start": 316.71999999999997, "Time_End": 317.76, "Text": " Is it a valid marriage, whatever?"}, {"Time_Start": 318.47999999999996, "Time_End": 319.88, "Text": " Those are the extremes."}, {"Time_Start": 320.38, "Time_End": 324.94, "Text": " Now, for those who are interested in that extreme of the new identity method,"}, {"Time_Start": 324.94, "Time_End": 329.06, "Text": " when I speak tomorrow, I would be talking in detail about two new books to deal."}, {"Time_Start": 329.08, "Time_End": 334.74, "Text": " with that, the ID forger, and fake ID by male and motor. But what I'm talking about"}, {"Time_Start": 334.74, "Time_End": 341.41999999999996, "Text": " today is we want to live in the 21st century, use our computers, eat at McDonald's, have sex"}, {"Time_Start": 341.41999999999996, "Time_End": 349.12, "Text": " with women who know our name, that were men for that matter, okay? To do that requires that we"}, {"Time_Start": 349.12, "Time_End": 356.7, "Text": " have a certain level of interaction into the society we live in. So unless we want to go live"}, {"Time_Start": 356.7, "Time_End": 360.94, "Text": " off the land in Africa or an Indian reservation, and even on Indian reservation,"}, {"Time_Start": 361.06, "Time_End": 367.97999999999996, "Text": " you have documents, or live under new identity, we have to try to say, is there a way that we"}, {"Time_Start": 367.97999999999996, "Time_End": 375.64, "Text": " can carve out a zone of privacy for ourselves that will allow us to still do all the things"}, {"Time_Start": 375.64, "Time_End": 382.74, "Text": " you have to do, hold a job, pay taxes, all that stuff, but still keep some personal privacy."}, {"Time_Start": 383.28, "Time_End": 386.44, "Text": " Luckily, as of now, the answer is still, you know, you have to do."}, {"Time_Start": 386.7, "Time_End": 402.46, "Text": " Yes. And that's what I aim to give you some insight on how to do. The first step, though, is to know thine enemy. In other words, where is the data? Who collects it? Who can use it and abuse it? And what's going on?"}, {"Time_Start": 402.46, "Time_End": 416.68, "Text": " Well, let's talk about why has the collection of data expanded so much here lately? Well, private industry has one reason they want your personal information. The government has a data expanded so much here lately. Well, private industry has one reason. The government has a data."}, {"Time_Start": 416.7, "Time_End": 425.65999999999997, "Text": " different reason. With private industry, the more I know about you, the easier it is for me to sell you things, for me to make a profit."}, {"Time_Start": 426.15999999999997, "Time_End": 434.82, "Text": " So private industry's sole interest in your personal data is profit. Simple as that."}, {"Time_Start": 435.41999999999996, "Time_End": 443.44, "Text": " Look, even me, I'm a writer. I want you to buy my books, right? The more I know about you, the more easier it might be for me to get you to buy one of my books."}, {"Time_Start": 443.44, "Time_End": 446.68, "Text": " Well, scale that up a million fold. That's what big."}, {"Time_Start": 446.7, "Time_End": 476.68, "Text": " bad corporation does. Now, all corporations aren't bad. Most of them are big, but I'm not saying big, bad corporation mean the company's bad, meaning their data collection and protection procedures might be very bad. That is like the corporations have an interest in you having as little privacy protection for your personal information as possible, because their goal is to know as much as they can about you, use that to make their sale, then take that very data about you, and make a"}, {"Time_Start": 476.7, "Time_End": 481.36, "Text": " second killing by selling it to somebody else who then will use it to sell you something."}, {"Time_Start": 481.65999999999997, "Time_End": 487.02, "Text": " So that's private industries. Private industry's interest in you having no privacy is profit."}, {"Time_Start": 487.62, "Time_End": 496.36, "Text": " What is the government's interest? Well, what does the government do? It does two things. It regulates and it controls."}, {"Time_Start": 497.0, "Time_End": 506.44, "Text": " Control is meaning they won't let us riot in here. Because if we riot in here, the Las Vegas Metropolitan Police will come in very quickly and will have us spend the night"}, {"Time_Start": 506.44, "Time_End": 512.46, "Text": " someplace other than the hotel. So that's, that is control. Control can be law enforcement."}, {"Time_Start": 512.92, "Time_End": 518.54, "Text": " It can be anything that curtails your ability to do whatever it is that you want to do."}, {"Time_Start": 519.0, "Time_End": 527.5, "Text": " The second motive that government has for having your personal data as much of it as possible is to regulate you."}, {"Time_Start": 528.1, "Time_End": 536.24, "Text": " Regulation can be anything from you want a driver's license, you must do X, Y, and Z. If you want to build a house, you must get a"}, {"Time_Start": 536.24, "Time_End": 540.54, "Text": " building permit. You will be allowed. Remember, there was a time when American citizens,"}, {"Time_Start": 540.7, "Time_End": 545.62, "Text": " private citizens, couldn't own gold. I mean, it made no sense. Why can't I own gold? Gold is a rock."}, {"Time_Start": 545.6800000000001, "Time_End": 550.1800000000001, "Text": " If I can buy gold or find it, shouldn't I be able to own it? For some reason, the big bad government"}, {"Time_Start": 550.1800000000001, "Time_End": 556.38, "Text": " said, you can't have gold. That was actually a crime. To have private ownership of gold until I think"}, {"Time_Start": 556.38, "Time_End": 564.26, "Text": " the late 1960s or the early 1970s. So the government's interest is controlling regulation. To that end,"}, {"Time_Start": 564.26, "Time_End": 572.26, "Text": " then the government wants to expand its knowledge of your activities through any method it can to get more information,"}, {"Time_Start": 572.46, "Time_End": 576.4, "Text": " to enable it to control and regulate you more."}, {"Time_Start": 577.0, "Time_End": 582.22, "Text": " So these are the two forces that drive why they want to collect the data."}, {"Time_Start": 582.22, "Time_End": 588.8, "Text": " And so you have to understand that each agency, meaning be they a government agency or private agency,"}, {"Time_Start": 588.9, "Time_End": 593.08, "Text": " they have a different reason why they want to destroy your privacy."}, {"Time_Start": 593.4399999999999, "Time_End": 594.24, "Text": " But in the end,"}, {"Time_Start": 594.26, "Time_End": 601.26, "Text": " the net result is the same. So let's talk about how this changes the playing field"}, {"Time_Start": 601.26, "Time_End": 607.38, "Text": " before we start talking about who knows what. You could go in to buy a car. And I always use"}, {"Time_Start": 607.38, "Time_End": 611.66, "Text": " this as an example. And the guy, so usually one or two things. And car dealers have gotten"}, {"Time_Start": 611.66, "Time_End": 615.58, "Text": " in a lot of trouble with the law over this, but this is what they do. And unfortunately,"}, {"Time_Start": 615.58, "Time_End": 619.42, "Text": " the law is kind of murky. You go in to buy a car. So you're talking to the guy, whatever,"}, {"Time_Start": 619.52, "Time_End": 624.1, "Text": " he sees you drive up, and he's like, well, we're having a contest. We're giving away such and such."}, {"Time_Start": 624.26, "Time_End": 627.72, "Text": " you like to enter. So he gives you a little slip of paper and you fill out your name and address"}, {"Time_Start": 627.72, "Time_End": 631.98, "Text": " and whatever. And then he takes that. He says, okay, thanks. And then he said, well, would you"}, {"Time_Start": 631.98, "Time_End": 635.36, "Text": " like to take a test drive? Of course, to do that, you've got to show him your license and usually"}, {"Time_Start": 635.36, "Time_End": 639.3199999999999, "Text": " they write something down. So you're out test driving a car, whatever. Well, whilst you're out test"}, {"Time_Start": 639.3199999999999, "Time_End": 645.52, "Text": " driving a car, they're back there pulling your credit report. They're finding out, one, can this guy"}, {"Time_Start": 645.52, "Time_End": 653.4399999999999, "Text": " buy a car if he wants to buy a car? Can he finance a car if he wants to finance a car? And how much"}, {"Time_Start": 653.44, "Time_End": 658.86, "Text": " is he and Hock and how much might I be able to sell him? So then you come back and you're thinking,"}, {"Time_Start": 658.98, "Time_End": 663.7800000000001, "Text": " yeah, I might like this car, but blah, blah, blah. But the problem is now when you come back,"}, {"Time_Start": 664.2, "Time_End": 670.1600000000001, "Text": " the playing field has been changed because unlike when you walked in where he didn't know"}, {"Time_Start": 670.1600000000001, "Time_End": 677.5400000000001, "Text": " anything about your wants and desires and needs until you told him, now he knows, hey, Joe College"}, {"Time_Start": 677.5400000000001, "Time_End": 683.4200000000001, "Text": " makes $65,000 a year. He has four gold visa accounts. He"}, {"Time_Start": 683.44, "Time_End": 690.46, "Text": " just paid off his previous car loan and he owns a home and is married and his wife works,"}, {"Time_Start": 690.86, "Time_End": 698.1600000000001, "Text": " now he's got information that he can use to manipulate your buying behavior. In other words,"}, {"Time_Start": 698.22, "Time_End": 706.6600000000001, "Text": " the playing field has been changed. This is the danger that we face. And how did he do that?"}, {"Time_Start": 706.6600000000001, "Time_End": 712.7800000000001, "Text": " Because he was able to access deeply personal information. Some of you know sensitive information about you."}, {"Time_Start": 712.78, "Time_End": 717.6, "Text": " your credit report without your authorization. You came in and took a test drive."}, {"Time_Start": 717.88, "Time_End": 722.28, "Text": " I'll give you any little experience I had. I went to the dentist in California when I was visiting"}, {"Time_Start": 722.28, "Time_End": 731.5799999999999, "Text": " somebody there a few months ago, and the dentist was a dentist who pulled a credit report on every patient"}, {"Time_Start": 731.5799999999999, "Time_End": 737.12, "Text": " who walked in the office. You know, when you go to a medical office, and look, I'm not immune to it"}, {"Time_Start": 737.12, "Time_End": 742.74, "Text": " any more than anybody else's. You fill out a sheet with your name, your SSN, all that stuff."}, {"Time_Start": 742.78, "Time_End": 750.54, "Text": " I'm standing at the counter. Of course, they didn't know that I was John Q. Newman, because you guys probably realize that's not the name on the stuff in my wallet."}, {"Time_Start": 751.3, "Time_End": 755.26, "Text": " All of a sudden, I see TransUnion come up on the receptionist screen."}, {"Time_Start": 755.74, "Time_End": 758.74, "Text": " And I said, wait a minute, that's my credit report you just pulled."}, {"Time_Start": 759.52, "Time_End": 766.74, "Text": " And I said, what the hell are you doing? And she said, oh, well, it's our policy of our office that we pull the credit report of any new patient."}, {"Time_Start": 766.74, "Time_End": 772.76, "Text": " I said, wait a minute, I'm paying cash for this visit. She said, well, it's our, it's our, it's our, it's our, it's our, it's our, it's our,"}, {"Time_Start": 772.78, "Time_End": 778.12, "Text": " policy, blah, blah, blah. And I'm like, wait a minute. One, you've put a wrong address now on my credit"}, {"Time_Start": 778.12, "Time_End": 782.86, "Text": " report, which I'm going to have to try to get off, which is, if you pardon my French, a bitch"}, {"Time_Start": 782.86, "Time_End": 790.86, "Text": " to do. And two, this is just because you put this boilerplate in the thing I signed, that is not"}, {"Time_Start": 790.86, "Time_End": 796.62, "Text": " enough because I am paying cash. You did not ask me, are you going to be financing this? Therefore,"}, {"Time_Start": 796.62, "Time_End": 801.86, "Text": " we have a right to do this. Well, to make a long story short, you know me, I'm not going to walk away without"}, {"Time_Start": 801.86, "Time_End": 806.8000000000001, "Text": " satisfaction. Well, I showed that, I told the dentist, I said, let me talk to your boss,"}, {"Time_Start": 806.86, "Time_End": 811.12, "Text": " and I explained him, you know, I could go see you over this, because I said, you violated a bunch of laws,"}, {"Time_Start": 811.26, "Time_End": 815.54, "Text": " Fair Credit Reporting Act, a bunch of other things. And then I showed him, because I happened to have"}, {"Time_Start": 815.54, "Time_End": 821.4, "Text": " a copy of Forbes magazine where I worked with Adam Penningberg, who's here today on what we can uncover"}, {"Time_Start": 821.4, "Time_End": 825.72, "Text": " with just his name, and I showed him this article, and then he was kind of surprised. I said, well,"}, {"Time_Start": 825.72, "Time_End": 832.4200000000001, "Text": " I'll be back tomorrow. Tomorrow I came back with his credit report. This 12 pages long,"}, {"Time_Start": 832.5, "Time_End": 838.4200000000001, "Text": " because I got the credit report on him that is the second kind of credit report, the kind that contains"}, {"Time_Start": 838.4200000000001, "Time_End": 845.8000000000001, "Text": " everything, if you're borrowing over $50,000. Not only did I have his name in SSN, I had the name"}, {"Time_Start": 845.8000000000001, "Time_End": 851.5400000000001, "Text": " in SSN of his wife, of his children, of the people who lived in the house before he did, I had his"}, {"Time_Start": 851.5400000000001, "Time_End": 855.7, "Text": " mortgage balance, I had how much he owed on his cars, how much he owed on."}, {"Time_Start": 855.72, "Time_End": 860.58, "Text": " the loans and his professional practice, quite frankly, he was flabbergasted. Then he said to me,"}, {"Time_Start": 860.6600000000001, "Time_End": 864.94, "Text": " oh, well, I guess I will have to talk to my accountant about this. He was quite concerned that I found"}, {"Time_Start": 864.94, "Time_End": 869.32, "Text": " all this out. I said, why? You didn't care about my privacy. Why should you worry about yours?"}, {"Time_Start": 870.24, "Time_End": 883.74, "Text": " Okay. So this is my point. So first, thank you. So, all right? So, step one, in any war,"}, {"Time_Start": 883.74, "Time_End": 890.9, "Text": " because it is a battle for personal privacy, because they will sell out your data to the cheapest bidder."}, {"Time_Start": 891.24, "Time_End": 898.52, "Text": " Prisoners in Texas process who've been convicted of rape, process, catalog orders, book airline"}, {"Time_Start": 898.52, "Time_End": 904.0, "Text": " reservations, murderers right now could be reconciling your credit card charges."}, {"Time_Start": 904.38, "Time_End": 908.74, "Text": " Because the generals in the war for personal privacy have one goal."}, {"Time_Start": 909.28, "Time_End": 913.72, "Text": " Maximize profits at any cost. And if that means I use a consumer."}, {"Time_Start": 913.74, "Time_End": 921.12, "Text": " somebody who's been convicted of rape to process a woman's health clinics billing records,"}, {"Time_Start": 921.22, "Time_End": 928.76, "Text": " I'll damn well do so. So the first step in building a privacy firewall is to understand this is a battle."}, {"Time_Start": 929.16, "Time_End": 935.78, "Text": " It's a battle you have to join. If you want some privacy, you have to say, I am going to seize my privacy and take it."}, {"Time_Start": 935.78, "Time_End": 942.66, "Text": " So let's talk about, like I said, the first step is to know thine enemy. In any war, know who your enemy is."}, {"Time_Start": 942.66, "Time_End": 944.6999999999999, "Text": " So let's talk about who the enemy is."}, {"Time_Start": 945.18, "Time_End": 953.7199999999999, "Text": " In the book, I go through all of the major databases, but I also go through some of the ones you might be surprised exist or don't know too much about."}, {"Time_Start": 954.0799999999999, "Time_End": 957.4599999999999, "Text": " We all know about the credit bureaus, that kind of stuff."}, {"Time_Start": 957.54, "Time_End": 959.8, "Text": " But what about the check verification services?"}, {"Time_Start": 959.8, "Time_End": 965.02, "Text": " And the current supplement to the Lumpanis catalog, which we'll have here tomorrow,"}, {"Time_Start": 965.02, "Time_End": 972.64, "Text": " I have written a catalog piece talking about how check approval services are the new scarlet letter in the"}, {"Time_Start": 972.66, "Time_End": 978.64, "Text": " 21st century. At my website, privacypower.com, I have so many people who come to me that say,"}, {"Time_Start": 978.8, "Time_End": 983.66, "Text": " John, I can't open a bank account any place in this country. I have to go to check cashing"}, {"Time_Start": 983.66, "Time_End": 988.9599999999999, "Text": " agencies because I can't open an account. And the reason they can't open an account is because"}, {"Time_Start": 988.9599999999999, "Time_End": 996.8199999999999, "Text": " five, ten, three years ago they had trouble with an account. It got closed. And now, that is now"}, {"Time_Start": 996.8199999999999, "Time_End": 1002.6, "Text": " reported to a place like telecheck, check verification, incorporate. There's a bunch of them. Telecheck."}, {"Time_Start": 1002.66, "Time_End": 1004.3399999999999, "Text": " and they can't open a bank account."}, {"Time_Start": 1004.66, "Time_End": 1005.9399999999999, "Text": " And it's like, well, wait a minute."}, {"Time_Start": 1006.0799999999999, "Time_End": 1009.1999999999999, "Text": " This was four or five years ago, sometimes even ten years ago."}, {"Time_Start": 1009.6999999999999, "Time_End": 1012.78, "Text": " Well, it's because these now have become the new gatekeepers."}, {"Time_Start": 1013.1, "Time_End": 1017.28, "Text": " If you can't even have a deposit-taking relationship with a bank,"}, {"Time_Start": 1017.3399999999999, "Time_End": 1018.6999999999999, "Text": " we're not talking about credit."}, {"Time_Start": 1018.9399999999999, "Time_End": 1023.02, "Text": " We're talking about just being able to deposit and cash paychecks."}, {"Time_Start": 1023.02, "Time_End": 1028.76, "Text": " It's very difficult to exist in this society because essentially you have to live on a cash basis."}, {"Time_Start": 1029.2, "Time_End": 1032.6399999999999, "Text": " Well, now there are millions of people in this country who now, now are millions of people in this country who now"}, {"Time_Start": 1032.66, "Time_End": 1038.66, "Text": " have this scarlet brand on them. So that's one of the new database groups that"}, {"Time_Start": 1038.66, "Time_End": 1044.22, "Text": " you haven't, don't hear a whole lot about, but they're just as big and potentially even worse than"}, {"Time_Start": 1044.22, "Time_End": 1050.3000000000002, "Text": " the credit bureaus. You can open a bank account with bad credit, but if you have bad stuff"}, {"Time_Start": 1050.3000000000002, "Time_End": 1055.9, "Text": " at the check verification services, you may not be able to open a bank account at all and try"}, {"Time_Start": 1055.9, "Time_End": 1062.64, "Text": " living on a cash basis. It's difficult and dangerous. Okay, so that's one of the place we talk"}, {"Time_Start": 1062.66, "Time_End": 1066.92, "Text": " about. We also go into the law enforcement computer systems. When you get pulled"}, {"Time_Start": 1066.92, "Time_End": 1072.6200000000001, "Text": " over by that cop, you ever wonder why he takes a few minutes to get back to bring you the ticket"}, {"Time_Start": 1072.6200000000001, "Time_End": 1078.24, "Text": " back? Well, that's because he's checking you out 10 ways to Sunday. And a lot of people, first"}, {"Time_Start": 1078.24, "Time_End": 1084.3200000000002, "Text": " of all, most people know that when you get pulled over, you're checked for warrants. Before the"}, {"Time_Start": 1084.3200000000002, "Time_End": 1090.16, "Text": " cop pulls you over, he checks your license plate against a national stolen vehicle database and"}, {"Time_Start": 1090.16, "Time_End": 1095.88, "Text": " also to see if the car itself is wanted in connection with the crime. That will determine"}, {"Time_Start": 1095.88, "Time_End": 1100.7, "Text": " whether or not he comes up to your window nicely or whether or not it's like, sir, could you"}, {"Time_Start": 1100.7, "Time_End": 1105.94, "Text": " turn off the engine and please step outside of the vehicle. Okay? It's what we call the felony"}, {"Time_Start": 1105.94, "Time_End": 1111.68, "Text": " traffic stop. When that happens and you haven't, he hasn't come up to you yet, that means the"}, {"Time_Start": 1111.68, "Time_End": 1118.24, "Text": " license plate on your car has got some real bad history to it. Okay? Then after he comes up to you"}, {"Time_Start": 1118.24, "Time_End": 1122.6, "Text": " and takes your license, he goes back to his car. And ever notice why they make it so"}, {"Time_Start": 1122.6, "Time_End": 1128.16, "Text": " very clear on a driver's license, your birth date? That's why, because he goes back to his car"}, {"Time_Start": 1128.16, "Time_End": 1134.56, "Text": " and the first files he checks are the NCIC wanted persons index. In any given time, there's"}, {"Time_Start": 1134.56, "Time_End": 1140.94, "Text": " anywhere from 600 to 700,000 people in this country who are wanted for serious crimes. The only"}, {"Time_Start": 1140.94, "Time_End": 1146.24, "Text": " warrants that get listed, there are misdemeanor and felony warrants where the issuing jurisdiction will"}, {"Time_Start": 1146.24, "Time_End": 1150.96, "Text": " actually pay to have the person brought back. So in other words, unpaid parking tickets"}, {"Time_Start": 1150.96, "Time_End": 1155.84, "Text": " may get you a local warrant, but it won't get you arrested here in Vegas if you've got unpaid"}, {"Time_Start": 1155.84, "Time_End": 1160.4, "Text": " parking tickets in San Diego. So those are you guys who are worried about that. Chill, okay?"}, {"Time_Start": 1160.64, "Time_End": 1166.84, "Text": " It's not going to happen. Not this weekend. In any case, so he then checks you on the wanted"}, {"Time_Start": 1166.84, "Time_End": 1173.36, "Text": " at persons index. And if there's a match, then he calls up the whole warrant file to make sure that"}, {"Time_Start": 1173.36, "Time_End": 1176.08, "Text": " you actually are the person they want. That's when he comes back."}, {"Time_Start": 1176.24, "Time_End": 1180.28, "Text": " And then he's a little less friendly and asks you to please step out the vehicle."}, {"Time_Start": 1181.28, "Time_End": 1186.4, "Text": " But you might think, and that's okay. Most of us would agree a policeman doing a traffic stop"}, {"Time_Start": 1186.4, "Time_End": 1191.02, "Text": " or on the street should be able to check if somebody's wanted. That's what we consider a legitimate use."}, {"Time_Start": 1191.52, "Time_End": 1199.28, "Text": " But did you also know if he wants, he can see if you have a criminal record of any consequence any place in the United States."}, {"Time_Start": 1199.6, "Time_End": 1206.22, "Text": " There's something called the Interstate Identification Index brought to us, or Triple I, as it's known in the law enforcement."}, {"Time_Start": 1206.24, "Time_End": 1209.24, "Text": " business brought to us by our good friends at the FBI."}, {"Time_Start": 1209.24, "Time_End": 1212.24, "Text": " FBI about 25 years ago said, you know what?"}, {"Time_Start": 1212.24, "Time_End": 1220.24, "Text": " What we need is a central repository of all criminal conviction information from everywhere within the United States."}, {"Time_Start": 1220.24, "Time_End": 1225.24, "Text": " So we're going to give each state money so that they can create a system where they forward to us"}, {"Time_Start": 1225.24, "Time_End": 1228.24, "Text": " conviction information on a regular basis."}, {"Time_Start": 1228.24, "Time_End": 1231.24, "Text": " Now understand, this is separate and apart from a warrant."}, {"Time_Start": 1231.24, "Time_End": 1236.24, "Text": " This is where you convicted of something 5, 10, 15, 20 years ago."}, {"Time_Start": 1236.24, "Time_End": 1240.74, "Text": " So now we have what's called AAA, the Interstate Identification Index."}, {"Time_Start": 1240.74, "Time_End": 1247.24, "Text": " In many states, officers on the street can check that to see if you have a criminal record."}, {"Time_Start": 1247.24, "Time_End": 1249.24, "Text": " This is where I have a problem."}, {"Time_Start": 1249.24, "Time_End": 1255.24, "Text": " If you're pulled over for just a traffic stop, for a speeding or a broken taillight or whatever,"}, {"Time_Start": 1255.24, "Time_End": 1263.24, "Text": " should that police officer be able to get into your life to the point of finding out if you have a record?"}, {"Time_Start": 1263.24, "Time_End": 1265.24, "Text": " Or is that an invasion of your privacy?"}, {"Time_Start": 1265.24, "Time_End": 1271.24, "Text": " If you had a record for pot possession or for even selling drugs 20 years ago,"}, {"Time_Start": 1271.24, "Time_End": 1275.24, "Text": " now you're an upstanding middle-aged man with kids and you get pulled over,"}, {"Time_Start": 1275.24, "Time_End": 1279.24, "Text": " should that cop be able to put that back in your face like it happened yesterday?"}, {"Time_Start": 1279.24, "Time_End": 1284.24, "Text": " I say no, but this is part of the battle now that's been created"}, {"Time_Start": 1284.24, "Time_End": 1289.24, "Text": " with creating this national database of criminal record."}, {"Time_Start": 1289.24, "Time_End": 1295.22, "Text": " As an aside, you know, the Brady Law that allows you to buy a gun with the instant back"}, {"Time_Start": 1295.24, "Time_End": 1299.24, "Text": " ground check, they never intended it, but if you want to create a new identity,"}, {"Time_Start": 1299.24, "Time_End": 1305.74, "Text": " this allows you to actually make sure that the name and birthday you've created has no criminal history."}, {"Time_Start": 1305.74, "Time_End": 1307.24, "Text": " Go try to buy a gun."}, {"Time_Start": 1307.24, "Time_End": 1313.24, "Text": " Because right there in the store, if you can buy a gun, they will have checked triple I"}, {"Time_Start": 1313.24, "Time_End": 1319.74, "Text": " and your state's law enforcement database, and if it comes back clean, that means the name and birthday"}, {"Time_Start": 1319.74, "Time_End": 1324.74, "Text": " you've created don't have any warrants out and don't have any serious criminal history."}, {"Time_Start": 1324.74, "Time_End": 1330.68, "Text": " So, in a way, by trying to take our privacy away, they've made it easier to create a new identity."}, {"Time_Start": 1330.68, "Time_End": 1335.7, "Text": " I talk about this in Reborn in the USA, the third edition, a couple of my other books."}, {"Time_Start": 1335.78, "Time_End": 1339.44, "Text": " In any case, that's aside, but this is how I talk about how things grow."}, {"Time_Start": 1339.58, "Time_End": 1345.8, "Text": " Well, state and local police agencies have a similar database like Triple I for what happens in their states."}, {"Time_Start": 1346.6, "Time_End": 1351.4, "Text": " There's also something called the Treasury Enforcement Computer System, or PECS."}, {"Time_Start": 1351.86, "Time_End": 1354.72, "Text": " And I can thank a name."}, {"Time_Start": 1354.74, "Time_End": 1359.34, "Text": " famous customs service agent who was here one year, who actually let me go on to Tex"}, {"Time_Start": 1359.34, "Time_End": 1366.14, "Text": " and see what Tex can do. If you think NCIC is bad, Tex is even worse. As the customs officer"}, {"Time_Start": 1366.14, "Time_End": 1372.84, "Text": " said to me, Tex really is big brother. Any time you enter the United States, under the law,"}, {"Time_Start": 1372.84, "Time_End": 1378.58, "Text": " because you are technically not inside of the United States, the Constitution does not apply to you."}, {"Time_Start": 1378.58, "Time_End": 1384.24, "Text": " Ever wonder why customs agents at the border act like they have no fear? Well, that's because"}, {"Time_Start": 1384.24, "Time_End": 1387.34, "Text": " basically, and it's the border or its functional equivalent."}, {"Time_Start": 1387.48, "Time_End": 1393.86, "Text": " That means if you come back on a flight from London and land at LAX or New York City, JFK, or C-TAC,"}, {"Time_Start": 1394.0, "Time_End": 1398.7, "Text": " that is the functional equivalent of the border, because until you pass through customs and"}, {"Time_Start": 1398.7, "Time_End": 1404.46, "Text": " immigration, you are technically not in the United States, which means the Constitution doesn't"}, {"Time_Start": 1404.46, "Time_End": 1405.32, "Text": " protect you yet."}, {"Time_Start": 1405.66, "Time_End": 1409.46, "Text": " Now, it doesn't mean they can shoot you to death, but I'll tell you, it allows them to do almost"}, {"Time_Start": 1409.46, "Time_End": 1410.76, "Text": " anything else they want to do."}, {"Time_Start": 1410.76, "Time_End": 1416.2, "Text": " PEC's accesses NCIC, which is run by the FBI."}, {"Time_Start": 1416.2, "Time_End": 1423.62, "Text": " Remember, the customs service is Treasury, IRS, Treasury, Customs, you're crossing the border,"}, {"Time_Start": 1423.92, "Time_End": 1425.18, "Text": " you get where I'm going here."}, {"Time_Start": 1425.62, "Time_End": 1431.78, "Text": " Okay, they can check all the records in NCIC, but they can also do a lot of other things."}, {"Time_Start": 1432.08, "Time_End": 1436.24, "Text": " For example, when you drive across the border from Mexico or Canada, if you notice they're"}, {"Time_Start": 1436.24, "Time_End": 1440.74, "Text": " optical readers, they record your license plate number and state,"}, {"Time_Start": 1440.76, "Time_End": 1445.12, "Text": " state. If they wanted to find out, for example, they say, you know what, let's see how many"}, {"Time_Start": 1445.12, "Time_End": 1449.32, "Text": " times has John K Newman crossed the border to go into Tijuana? Because maybe I got a thing for"}, {"Time_Start": 1449.32, "Time_End": 1454.8, "Text": " T.J. Well, they could say, well, first we need to find out, does he have a car? So they go and say,"}, {"Time_Start": 1454.8799999999999, "Time_End": 1459.32, "Text": " well, let's see if there are any cars in California, Nevada, Arizona registered to John K. Newman."}, {"Time_Start": 1459.42, "Time_End": 1463.8, "Text": " Or they could check the whole damn country if they wanted to, and then they get a list of cars"}, {"Time_Start": 1463.8, "Time_End": 1469.64, "Text": " registered to John K. Newman. Then they could put in my birthday to narrow that down. So now, with just"}, {"Time_Start": 1469.64, "Time_End": 1475.3600000000001, "Text": " my name, they found that I own a car. Then they can then say, okay, this is the license"}, {"Time_Start": 1475.3600000000001, "Time_End": 1481.66, "Text": " plate number. Let's run that against text and see how many times we've recorded this car coming"}, {"Time_Start": 1481.66, "Time_End": 1487.6200000000001, "Text": " across the border. They'll get a printout that'll tell them when and where and what border crossings"}, {"Time_Start": 1487.6200000000001, "Time_End": 1494.8600000000001, "Text": " I've used. So understand, any time you enter the United States, you are put under a level of"}, {"Time_Start": 1494.8600000000001, "Time_End": 1499.6200000000001, "Text": " surveillance that no other free society does. And this is"}, {"Time_Start": 1499.64, "Time_End": 1505.68, "Text": " maybe the key thrust I'm trying to make here. As Americans, we still have more rights"}, {"Time_Start": 1505.68, "Time_End": 1511.5400000000002, "Text": " than almost any other country, but we are the most surveilled and monitored society. There's"}, {"Time_Start": 1511.5400000000002, "Time_End": 1517.64, "Text": " also another treasury database called FinCEN, Financial Crimes Enforcement Network. Go to their"}, {"Time_Start": 1517.64, "Time_End": 1523.7, "Text": " website. They make it clear. They say, we follow the money. Well, I've written a little piece"}, {"Time_Start": 1523.7, "Time_End": 1529.24, "Text": " explaining what FinCin does. Basically, there was always something called the Bank Secrecy Act."}, {"Time_Start": 1529.64, "Time_End": 1534.46, "Text": " understand your bank records, there is no expectation of privacy. When they were up here"}, {"Time_Start": 1534.46, "Time_End": 1540.74, "Text": " before, in a legal sense, what defines whether an action is private or not is if you have"}, {"Time_Start": 1540.74, "Time_End": 1547.64, "Text": " expectation of privacy. And the Supreme Court ruled back in the 70s that when you fill out"}, {"Time_Start": 1547.64, "Time_End": 1553.5800000000002, "Text": " things like deposit slips, withdrawal orders, write checks, whatever, there is no expectation"}, {"Time_Start": 1553.5800000000002, "Time_End": 1559.48, "Text": " of privacy in your banking records. Keep that in mind. Well, the bank's"}, {"Time_Start": 1559.64, "Time_End": 1565.7, "Text": " Act was updated a couple of years ago, and part of it says that if a bank is used"}, {"Time_Start": 1565.7, "Time_End": 1571.14, "Text": " as a dup for laundering drug money or whatever, the bank can be held civilly and criminally"}, {"Time_Start": 1571.14, "Time_End": 1577.68, "Text": " liable if they have not taken due diligent steps to prevent it. This has led to what's something"}, {"Time_Start": 1577.68, "Time_End": 1583.26, "Text": " called a suspicious activity report. Suspicious activity report can be filed by the bank"}, {"Time_Start": 1583.26, "Time_End": 1587.72, "Text": " on you for any number of reasons. Maybe they think you take out too many much cash. Maybe"}, {"Time_Start": 1587.72, "Time_End": 1589.3000000000002, "Text": " you bring in a bunch of small bills."}, {"Time_Start": 1589.64, "Time_End": 1590.96, "Text": " and exchange them in the large bills."}, {"Time_Start": 1591.3200000000002, "Time_End": 1594.26, "Text": " Whatever. All they need is to think something is suspicious."}, {"Time_Start": 1594.76, "Time_End": 1600.0200000000002, "Text": " To cover their ass, the IRS wants them, the Treasury Department, wants them to file the report."}, {"Time_Start": 1600.3200000000002, "Time_End": 1603.72, "Text": " That report goes to Finsen in Detroit."}, {"Time_Start": 1604.3600000000001, "Time_End": 1607.8200000000002, "Text": " And at that point, all sorts of bad stuff can start happening."}, {"Time_Start": 1607.96, "Time_End": 1614.38, "Text": " By law, you can't be told that report was sent to Finsen, the Financial Crimes Enforcement Network."}, {"Time_Start": 1614.7800000000002, "Time_End": 1617.48, "Text": " When they get that report, a bunch of stuff can start happening."}, {"Time_Start": 1617.48, "Time_End": 1619.22, "Text": " One, your bank accounts and credit."}, {"Time_Start": 1619.64, "Time_End": 1623.26, "Text": " accounts and everything else will be put under scrutiny. That's number one."}, {"Time_Start": 1623.8200000000002, "Time_End": 1630.1000000000001, "Text": " Best case scenario, you might get a tax audit. Worst case scenario, you might find your funds"}, {"Time_Start": 1630.1000000000001, "Time_End": 1637.0200000000002, "Text": " all of a sudden are the subject of a lien or an embargo because they think you might be somebody"}, {"Time_Start": 1637.0200000000002, "Time_End": 1643.16, "Text": " that you're not. All of this is done with no due process of law. So that's a new database now."}, {"Time_Start": 1643.5600000000002, "Time_End": 1647.68, "Text": " Let's put it this way. The first year they had to do these reports, about 20,000 were filed."}, {"Time_Start": 1647.68, "Time_End": 1649.68, "Text": " Second year, about $50,000."}, {"Time_Start": 1649.8200000000002, "Time_End": 1651.76, "Text": " Last year, about $200,000."}, {"Time_Start": 1652.1200000000001, "Time_End": 1654.14, "Text": " What do you think is going to happen as time goes on?"}, {"Time_Start": 1654.76, "Time_End": 1658.1000000000001, "Text": " Finally, the last new database I'll talk about is something called"}, {"Time_Start": 1658.1000000000001, "Time_End": 1660.52, "Text": " the National New Higher Database."}, {"Time_Start": 1660.6000000000001, "Time_End": 1664.04, "Text": " Bet you guys didn't even hear of that database, but you don't what?"}, {"Time_Start": 1664.04, "Time_End": 1669.7, "Text": " Unless you all are independently wealthy in here, most of you are working as wage slaves someplace."}, {"Time_Start": 1670.4, "Time_End": 1671.1200000000001, "Text": " Guess what?"}, {"Time_Start": 1671.42, "Time_End": 1677.66, "Text": " Starting last year, there is a federal database that all states must contribute at a"}, {"Time_Start": 1677.68, "Time_End": 1685.8200000000002, "Text": " minimum, your name, your birth date, and your SSN2. They then match this data against a list"}, {"Time_Start": 1685.8200000000002, "Time_End": 1690.68, "Text": " of about a quarter million people who owe seriously overdue child support."}, {"Time_Start": 1691.6200000000001, "Time_End": 1698.3, "Text": " Now, here is my problem. Here we have created a brand new database that basically will contain"}, {"Time_Start": 1698.3, "Time_End": 1704.3, "Text": " everybody because most everybody must work to support themselves to catch a quarter million"}, {"Time_Start": 1704.3, "Time_End": 1706.8400000000001, "Text": " people who don't pay their child support."}, {"Time_Start": 1706.8400000000001, "Time_End": 1708.4, "Text": " I have no children."}, {"Time_Start": 1708.7600000000002, "Time_End": 1709.5800000000002, "Text": " Never have."}, {"Time_Start": 1709.9, "Time_End": 1718.5200000000002, "Text": " But my records are sent there as on my fathers, who's 65, and certainly he doesn't have to pay child support anymore."}, {"Time_Start": 1718.6200000000001, "Time_End": 1724.18, "Text": " Yeah, dad, I appreciate the money, but, you know, the point of it is his records are being sent there."}, {"Time_Start": 1724.2200000000003, "Time_End": 1725.7, "Text": " You think that's the worst part of it?"}, {"Time_Start": 1725.7200000000003, "Time_End": 1726.1200000000001, "Text": " Oh, no."}, {"Time_Start": 1726.8600000000001, "Time_End": 1728.2200000000003, "Text": " Here's the second part of it."}, {"Time_Start": 1728.6200000000001, "Time_End": 1732.9, "Text": " At the same time, part of this law was, and here's how they sold it to you."}, {"Time_Start": 1732.9, "Time_End": 1735.16, "Text": " They said, but it's for the children."}, {"Time_Start": 1735.6200000000001, "Time_End": 1736.3400000000001, "Text": " Don't you want children?"}, {"Time_Start": 1736.8400000000001, "Time_End": 1739.0800000000002, "Text": " to get their overdue child support?"}, {"Time_Start": 1739.46, "Time_End": 1743.66, "Text": " There's $50 billion in unpaid child support out there."}, {"Time_Start": 1744.0200000000002, "Time_End": 1747.2600000000002, "Text": " Don't you want hungry children to get what they need?"}, {"Time_Start": 1747.4800000000002, "Time_End": 1751.5800000000002, "Text": " Well, of course I do, but does that mean you have to go rate my privacy to do it?"}, {"Time_Start": 1752.2400000000002, "Time_End": 1752.5800000000002, "Text": " Okay."}, {"Time_Start": 1753.18, "Time_End": 1758.5400000000002, "Text": " The second part of this is banks must search their records, and I believe it's twice a year,"}, {"Time_Start": 1758.5400000000002, "Time_End": 1763.4, "Text": " to look for matches account holders who match the people on this list."}, {"Time_Start": 1764.38, "Time_End": 1766.8200000000002, "Text": " If they find the match, they're supposed to notice."}, {"Time_Start": 1766.8400000000001, "Time_End": 1771.5600000000002, "Text": " the federal new hire database and then they will go in and institute"}, {"Time_Start": 1771.5600000000002, "Time_End": 1776.0200000000002, "Text": " garnishment proceedings and by law they can't tell you for a period of time to give"}, {"Time_Start": 1776.0200000000002, "Time_End": 1781.94, "Text": " them time to get the money well that's bad enough but a lot of smaller banks"}, {"Time_Start": 1781.94, "Time_End": 1785.38, "Text": " have decided you know what we don't want to go to the expense of hiring people"}, {"Time_Start": 1785.38, "Time_End": 1790.0000000000002, "Text": " installing the screening software and all this stuff it's time consuming so instead"}, {"Time_Start": 1790.0000000000002, "Time_End": 1794.5600000000002, "Text": " we use the provision of the law that just lets us take the magnetic tape with all"}, {"Time_Start": 1794.5600000000002, "Time_End": 1796.8200000000002, "Text": " our bank account records and give it to"}, {"Time_Start": 1796.8400000000001, "Time_End": 1799.3000000000002, "Text": " to the state child support agency."}, {"Time_Start": 1799.3000000000002, "Time_End": 1803.7200000000003, "Text": " So as of this moment, depending with whom you bank,"}, {"Time_Start": 1803.7200000000003, "Time_End": 1809.2200000000003, "Text": " your account records, the balances, the withdrawal history,"}, {"Time_Start": 1809.2200000000003, "Time_End": 1812.8000000000002, "Text": " all of that stuff is at your state's child support"}, {"Time_Start": 1812.8000000000002, "Time_End": 1815.2200000000003, "Text": " enforcement division because many of the banks"}, {"Time_Start": 1815.2200000000003, "Time_End": 1817.96, "Text": " have said, well, we just rather let them do it."}, {"Time_Start": 1817.96, "Time_End": 1820.5400000000002, "Text": " So this is how, here's what we have done."}, {"Time_Start": 1820.5400000000002, "Time_End": 1824.4, "Text": " We have said, we want to have what I call security via database,"}, {"Time_Start": 1824.4, "Time_End": 1826.4, "Text": " which means we expand,"}, {"Time_Start": 1826.4, "Time_End": 1832.46, "Text": " how many databases we create on people so that we can read out the bad people."}, {"Time_Start": 1832.76, "Time_End": 1837.14, "Text": " When you rent an apartment, there was a time when you rent an apartment,"}, {"Time_Start": 1837.52, "Time_End": 1840.5400000000002, "Text": " you told them where you used to live, they called, they asked your landlord,"}, {"Time_Start": 1840.8600000000001, "Time_End": 1844.48, "Text": " yeah, he paid his rent on time, blah, blah, blah, they wanted to know you were working."}, {"Time_Start": 1844.7800000000002, "Time_End": 1846.2, "Text": " They were like, welcome to the neighborhood."}, {"Time_Start": 1846.4, "Time_End": 1847.2800000000002, "Text": " Now what happens?"}, {"Time_Start": 1847.66, "Time_End": 1852.16, "Text": " Well, you fill out a credit report, essentially, they pull a credit report,"}, {"Time_Start": 1852.16, "Time_End": 1856.38, "Text": " then they go to a second place that checks for people who have a bad,"}, {"Time_Start": 1856.4, "Time_End": 1861.2800000000002, "Text": " Rimmel history, and now some of the places that screen renters even check to see if you have"}, {"Time_Start": 1861.2800000000002, "Time_End": 1864.0800000000002, "Text": " a criminal record and have wants and warrants."}, {"Time_Start": 1864.68, "Time_End": 1867.4, "Text": " And they say, but this makes the community safer."}, {"Time_Start": 1867.8000000000002, "Time_End": 1871.8200000000002, "Text": " Well, of course, it makes the community safer, but my God, at what price?"}, {"Time_Start": 1872.18, "Time_End": 1876.1200000000001, "Text": " This is the question, if we have security via database."}, {"Time_Start": 1876.88, "Time_End": 1879.94, "Text": " The ultimate part of this could be we all get mail."}, {"Time_Start": 1880.24, "Time_End": 1885.24, "Text": " What if the post office said, look, the mails are used to transact a lot of illegal"}, {"Time_Start": 1885.24, "Time_End": 1885.68, "Text": " business."}, {"Time_Start": 1885.7800000000002, "Time_End": 1886.38, "Text": " We all know that."}, {"Time_Start": 1886.4, "Time_End": 1894.9, "Text": " So starting the 1st of January 2001, all envelopes, mailing containers, and packages must be transparent,"}, {"Time_Start": 1895.26, "Time_End": 1899.42, "Text": " and anything inside of them must be wrapped in transparent paper."}, {"Time_Start": 1900.0800000000002, "Time_End": 1901.4, "Text": " Don't think it can happen."}, {"Time_Start": 1901.8200000000002, "Time_End": 1908.1200000000001, "Text": " My point up here is, yeah, if they tried to do that tomorrow, the American people would balk."}, {"Time_Start": 1908.5, "Time_End": 1914.42, "Text": " But when you take privacy way inch by inch, here we've got a national new hire database."}, {"Time_Start": 1914.8600000000001, "Time_End": 1916.38, "Text": " Here we've got your bank record."}, {"Time_Start": 1916.4, "Time_End": 1924.3400000000001, "Text": " being given over to bureaucrats with no warrant for no reason, how much further is it"}, {"Time_Start": 1924.3400000000001, "Time_End": 1930.16, "Text": " before we reach a point where we are sold that for the common good, we're willing to give up all"}, {"Time_Start": 1930.16, "Time_End": 1930.96, "Text": " of our privacy."}, {"Time_Start": 1931.7, "Time_End": 1934.0, "Text": " So that's, like I said, you've got to know your enemy."}, {"Time_Start": 1934.2, "Time_End": 1937.7, "Text": " Now, the part two of the book is privacy protection strategies."}, {"Time_Start": 1938.0, "Time_End": 1943.5, "Text": " And because I've been running over a little bit, I'm going to be brief on this, but I will be at the"}, {"Time_Start": 1943.5, "Time_End": 1946.38, "Text": " table all tonight and all tomorrow if you want to talk to me."}, {"Time_Start": 1946.4, "Time_End": 1953.44, "Text": " about this. Number one, your SSN is the key to all the records about you. So step"}, {"Time_Start": 1953.44, "Time_End": 1959.68, "Text": " one on protecting your privacy is you have to make a conscious decision that I control"}, {"Time_Start": 1959.68, "Time_End": 1964.8600000000001, "Text": " where this number goes. Now in the book, I talk about how their numbers are created, how they"}, {"Time_Start": 1964.8600000000001, "Time_End": 1969.92, "Text": " started, what they became. But the fact is, any of you who are over 35 in here who still have"}, {"Time_Start": 1969.92, "Time_End": 1975.8600000000001, "Text": " your original SS cards, you got in the 70s or earlier, that card specifically said not for"}, {"Time_Start": 1975.8600000000001, "Time_End": 1981.92, "Text": " identification because the number on that card is supposed to identify a pension account,"}, {"Time_Start": 1982.16, "Time_End": 1988.3400000000001, "Text": " not a person, but because it's a unique identifier, everybody glommed onto that. So it started"}, {"Time_Start": 1988.3400000000001, "Time_End": 1994.4, "Text": " showing up on driver's licenses, insurance policies, whatever. The first step in getting some of your"}, {"Time_Start": 1994.4, "Time_End": 1999.96, "Text": " privacy back is to open your wallet up. If your SS card is in there, you take it out and you leave it at"}, {"Time_Start": 1999.96, "Time_End": 2005.5200000000002, "Text": " home. That's step number one. Step one. Step number two is if you're from a state,"}, {"Time_Start": 2005.8600000000001, "Time_End": 2011.5600000000002, "Text": " that puts the SSN on the license. Most of those states now will allow you not to have it on there."}, {"Time_Start": 2011.92, "Time_End": 2020.6200000000001, "Text": " Some states that use the SSN as the license number will now allow you to get that change to just a nine-digit number they create."}, {"Time_Start": 2020.98, "Time_End": 2028.66, "Text": " If you're in one of those states, go do that. No one should be able to know your SSN just from looking at your driver's license"}, {"Time_Start": 2028.66, "Time_End": 2035.8400000000001, "Text": " or from going through something in your wallet. This is critical. Number two, you need to"}, {"Time_Start": 2035.8600000000001, "Time_End": 2043.0600000000002, "Text": " compartmentalize. That means people only should know about you what they need to know"}, {"Time_Start": 2043.0600000000002, "Time_End": 2049.2200000000003, "Text": " about you. Does your dentist, does Radio Shack, because God, you can't buy a battery at Radio Shack"}, {"Time_Start": 2049.2200000000003, "Time_End": 2056.06, "Text": " without giving a name and address? Do these people really, do these people really need to know where"}, {"Time_Start": 2056.06, "Time_End": 2062.36, "Text": " you live? I say no, they don't. Your home address where you actually lay your head at night"}, {"Time_Start": 2062.36, "Time_End": 2067.92, "Text": " is something that should be privileged information to people who are really close to you."}, {"Time_Start": 2068.4, "Time_End": 2070.98, "Text": " Even your boss doesn't need to know where you live."}, {"Time_Start": 2071.2400000000002, "Time_End": 2073.6, "Text": " He needs an address and a way to contact you."}, {"Time_Start": 2073.9, "Time_End": 2080.1800000000003, "Text": " So part two of taking some of your privacy back is you get a mailing address at either mailboxes, etc.,"}, {"Time_Start": 2080.1800000000003, "Time_End": 2087.52, "Text": " or secretarial service, and you have all, that is the address of record you give to banks,"}, {"Time_Start": 2088.08, "Time_End": 2092.34, "Text": " to your dentist, to anybody who doesn't actually."}, {"Time_Start": 2092.36, "Time_End": 2098.54, "Text": " need to know where you live. So anytime you fill out a form or somebody ask you for your"}, {"Time_Start": 2098.54, "Time_End": 2104.26, "Text": " name and address, the first question, if you're building a privacy firewall, is, is this a person"}, {"Time_Start": 2104.26, "Time_End": 2109.02, "Text": " who needs to really know where I live? Your mother needs to know where you really live, but the"}, {"Time_Start": 2109.02, "Time_End": 2116.76, "Text": " guys at Radio Shack, sure is hell don't. Okay? Next step on as far as this, fell telephone with caller"}, {"Time_Start": 2116.76, "Time_End": 2122.34, "Text": " ID, because you know those 800 numbers, man, I bought a house a year ago. I got a"}, {"Time_Start": 2122.36, "Time_End": 2127.34, "Text": " non-listed, non-published number. I get this call, hi, it's call again water treatment."}, {"Time_Start": 2127.6200000000003, "Time_End": 2131.3, "Text": " It's like, wait a minute, how the hell did you get this number? Oh, we got it from the builder."}, {"Time_Start": 2132.06, "Time_End": 2137.7200000000003, "Text": " It's like, oh, well, isn't that special? Okay, my point is here, and I'm Mr. Privacy."}, {"Time_Start": 2138.2400000000002, "Time_End": 2142.32, "Text": " Okay? And they're calling me. I'm moving a new house. I do all the stuff I'm telling you to do,"}, {"Time_Start": 2142.54, "Time_End": 2148.96, "Text": " and here they are. Here's the deal on telephone privacy. One, get a voicemail number linked to a pager,"}, {"Time_Start": 2149.36, "Time_End": 2152.34, "Text": " because the point is most people who call you, they don't really"}, {"Time_Start": 2152.36, "Time_End": 2157.52, "Text": " need to talk to you. What they need to do is give you information or reach you in a timely manner."}, {"Time_Start": 2157.96, "Time_End": 2163.1400000000003, "Text": " So those people don't need to know the number of the phone sitting on your desk at home."}, {"Time_Start": 2163.1400000000003, "Time_End": 2171.6600000000003, "Text": " What they need is a phone number so that they can reach you. That does exactly that. This is the number"}, {"Time_Start": 2171.6600000000003, "Time_End": 2177.52, "Text": " you give all of those other people. Like we have a saying in the ID business, share the Spirious"}, {"Time_Start": 2177.52, "Time_End": 2182.34, "Text": " with the Curious. Okay? So that's if you're buying something and you've got."}, {"Time_Start": 2182.36, "Time_End": 2186.86, "Text": " got to give the phone number and an address? Are you doing something? Well, you have to? That's what you give out."}, {"Time_Start": 2187.36, "Time_End": 2204.06, "Text": " Now, the hardwired phone. Phone companies can be real bad. Yeah, we need to name, your SSN, blah, blah, blah, this kind of stuff. But thanks to deregulation now in most markets, there are alternative phone companies that will give you local phone service."}, {"Time_Start": 2204.6200000000003, "Time_End": 2212.34, "Text": " These companies frequently advertise, no ID, no credit checks, whatever. That's who you go with. You get the phone in a completely"}, {"Time_Start": 2212.36, "Time_End": 2219.1400000000003, "Text": " spurious name. My dog, Sarah, appears on many legal accounts. Sarah's a very well-off dog."}, {"Time_Start": 2219.2400000000002, "Time_End": 2226.2200000000003, "Text": " Let me tell you. She does well for herself. Sarah has frequent fire miles. Sarah, Sarah is something else."}, {"Time_Start": 2226.3, "Time_End": 2233.54, "Text": " Let me tell you. That's a dead dog. I just don't know. But in any case, the point of it is, is that you can do the same thing."}, {"Time_Start": 2233.54, "Time_End": 2241.36, "Text": " I say that's who you get your phone service with. You get the phone service with that company in a totally spurious name and rover's name."}, {"Time_Start": 2241.36, "Time_End": 2271.1800000000003, "Text": " or if you've got a cat in the cat's name or the gerbils name or make up a name and then it's non-published number then you've dropped out now credit cards banks whatever you have your statements and accounts and whatever go to the mailing address you can't establish credit and with most mailing addresses now there are some ways around that which I'll talk about tomorrow but you can cut the data trail"}, {"Time_Start": 2271.36, "Time_End": 2301.1800000000003, "Text": " because then what happens is their address of record is over there at mailboxes etc at the secretarial service especially so then if you move they have no idea where you really are utilities now that can be a problem or if you move into an apartment well I have a client because I also advise that people at my website privacy power.com how to create new identities this guy set up a new identity and he wanted to live in a nice apartment complex where he goes there and of course you said well fill out this form this form this form this form"}, {"Time_Start": 2301.36, "Time_End": 2306.6600000000003, "Text": " We want your fingerprints, your firstborn, title to your first born, or whatever, and we'll consider you."}, {"Time_Start": 2306.6600000000003, "Time_End": 2310.56, "Text": " And then he said, well, look, what if I just pay the whole first year's rent up front?"}, {"Time_Start": 2310.96, "Time_End": 2315.26, "Text": " And he took out a cashier's check out of his wallet for $11,000."}, {"Time_Start": 2315.54, "Time_End": 2317.86, "Text": " She said, oh, no problem whatsoever, sir. Here you go."}, {"Time_Start": 2318.3, "Time_End": 2327.44, "Text": " My point be, when you're dealing with places like cable TV, utility companies, whatever, if you're willing to pay for the service for six months or a year in advance,"}, {"Time_Start": 2327.44, "Time_End": 2331.34, "Text": " it's amazing how green makes all those little."}, {"Time_Start": 2331.36, "Time_End": 2333.2000000000003, "Text": " formalities disappear."}, {"Time_Start": 2334.1600000000003, "Time_End": 2334.44, "Text": " Okay."}, {"Time_Start": 2334.9, "Time_End": 2337.82, "Text": " Another thing, never ever use your SSN"}, {"Time_Start": 2337.82, "Time_End": 2340.1400000000003, "Text": " or any part of it as a password"}, {"Time_Start": 2340.1400000000003, "Time_End": 2341.9, "Text": " on any account that you have."}, {"Time_Start": 2342.26, "Time_End": 2344.28, "Text": " Last year, I showed you"}, {"Time_Start": 2344.28, "Time_End": 2347.1400000000003, "Text": " we had, all we had was a professor's name."}, {"Time_Start": 2347.6, "Time_End": 2349.58, "Text": " And when we were done, we had his SSN"}, {"Time_Start": 2349.58, "Time_End": 2350.4, "Text": " and the whole bit."}, {"Time_Start": 2350.7400000000002, "Time_End": 2353.58, "Text": " If he banked a Bank of America or Bank One"}, {"Time_Start": 2353.58, "Time_End": 2356.1400000000003, "Text": " or a bunch of other places, we could have called up"}, {"Time_Start": 2356.1400000000003, "Time_End": 2358.6200000000003, "Text": " and I could have said, hi, yes, my name is Lester"}, {"Time_Start": 2358.6200000000003, "Time_End": 2361.2400000000002, "Text": " Molester, and I don't have my account."}, {"Time_Start": 2361.36, "Time_End": 2363.44, "Text": " book here, but I need my"}, {"Time_Start": 2363.44, "Time_End": 2365.02, "Text": " account date to say, well, what's your name,"}, {"Time_Start": 2365.34, "Time_End": 2367.34, "Text": " what's your address, what's your birth date, and now"}, {"Time_Start": 2367.34, "Time_End": 2369.0, "Text": " to make sure it's really you, Mr. Melester,"}, {"Time_Start": 2369.26, "Time_End": 2371.48, "Text": " I need to know the last four tickets of your SSN."}, {"Time_Start": 2372.04, "Time_End": 2372.96, "Text": " 1-271."}, {"Time_Start": 2373.3, "Time_End": 2374.7400000000002, "Text": " How can I do for you, sir?"}, {"Time_Start": 2375.04, "Time_End": 2376.84, "Text": " Well, your balance is $8,500,"}, {"Time_Start": 2377.32, "Time_End": 2379.42, "Text": " your account number of such and such, and blah, blah, blah."}, {"Time_Start": 2379.7200000000003, "Time_End": 2381.36, "Text": " Well, I'd like you to change the mailing"}, {"Time_Start": 2381.36, "Time_End": 2383.52, "Text": " address, my debit card, to such and such,"}, {"Time_Start": 2383.52, "Time_End": 2385.02, "Text": " and could you send me another one because I lost it?"}, {"Time_Start": 2385.32, "Time_End": 2387.5, "Text": " No problem, Mr. Lester, go right out in mail"}, {"Time_Start": 2387.5, "Time_End": 2389.34, "Text": " tomorrow. Boom. I've emptied"}, {"Time_Start": 2389.34, "Time_End": 2391.3, "Text": " this guy's bank account. He's like, hey,"}, {"Time_Start": 2391.36, "Time_End": 2393.78, "Text": " what's going on here? He's on vacation in Hawaii, and they're like,"}, {"Time_Start": 2394.04, "Time_End": 2397.36, "Text": " sir, I'm sorry, but we'd like to talk to you. Your credit card"}, {"Time_Start": 2397.36, "Time_End": 2399.7400000000002, "Text": " was declined, sir. You're a scumbag."}, {"Time_Start": 2399.82, "Time_End": 2402.26, "Text": " Please leave the hotel. It's like, well, I don't know what happened."}, {"Time_Start": 2402.7400000000002, "Time_End": 2404.88, "Text": " Okay? So, this is my whole point."}, {"Time_Start": 2405.28, "Time_End": 2409.4, "Text": " Many agencies use part of your SSN as a password."}, {"Time_Start": 2409.6, "Time_End": 2413.32, "Text": " I showed you, you can get anybody's SSN in this country for"}, {"Time_Start": 2413.32, "Time_End": 2415.54, "Text": " 50 bucks, and if you have an address on them."}, {"Time_Start": 2416.04, "Time_End": 2420.32, "Text": " Do not use SSNs, or for that matter, your mother's maiden name,"}, {"Time_Start": 2420.32, "Time_End": 2424.2400000000002, "Text": " as an identifier. There was an identity theft ring"}, {"Time_Start": 2424.2400000000002, "Time_End": 2428.48, "Text": " that's preyed on people who were born in California and Massachusetts"}, {"Time_Start": 2428.48, "Time_End": 2432.6600000000003, "Text": " because in those states, birth certificates are open records completely."}, {"Time_Start": 2433.1000000000004, "Time_End": 2437.04, "Text": " What they would do is find people who were born in those states"}, {"Time_Start": 2437.04, "Time_End": 2440.42, "Text": " that had decent incomes, they'd get their birth certificates,"}, {"Time_Start": 2440.42, "Time_End": 2444.56, "Text": " then they had their mother's maiden names, and then they would take over their bank accounts"}, {"Time_Start": 2444.56, "Time_End": 2447.98, "Text": " and do all sorts of other stuff, and the guy would say, but it had to be you,"}, {"Time_Start": 2448.04, "Time_End": 2449.98, "Text": " because not only didn't know your SSM,"}, {"Time_Start": 2449.98, "Time_End": 2451.96, "Text": " but he knew your mother's maiden name."}, {"Time_Start": 2452.44, "Time_End": 2453.2, "Text": " Remember something."}, {"Time_Start": 2453.32, "Time_End": 2455.84, "Text": " Your mother's maiden name is actually a public record"}, {"Time_Start": 2455.84, "Time_End": 2458.2400000000002, "Text": " because it's on your damn birth certificate."}, {"Time_Start": 2458.8, "Time_End": 2460.4, "Text": " Keep these things in mind."}, {"Time_Start": 2461.1, "Time_End": 2461.36, "Text": " Okay?"}, {"Time_Start": 2461.78, "Time_End": 2464.72, "Text": " Some states are worse to live in than others."}, {"Time_Start": 2465.06, "Time_End": 2466.08, "Text": " Some states are better."}, {"Time_Start": 2466.44, "Time_End": 2468.62, "Text": " Washington State, I love here's why."}, {"Time_Start": 2468.7400000000002, "Time_End": 2470.92, "Text": " It's where Lumpanx is and they pay good royalties,"}, {"Time_Start": 2470.92, "Time_End": 2473.62, "Text": " but more so than that, in Washington State,"}, {"Time_Start": 2473.84, "Time_End": 2475.94, "Text": " unless you're getting a commercial driver's license,"}, {"Time_Start": 2476.1, "Time_End": 2478.0, "Text": " you must not provide an SSN."}, {"Time_Start": 2478.28, "Time_End": 2479.96, "Text": " It is not asked for, norwick."}, {"Time_Start": 2479.98, "Time_End": 2484.36, "Text": " required in the licensing process because they create a unique identifying number"}, {"Time_Start": 2484.36, "Time_End": 2490.26, "Text": " for you for the license, and Washington State has very good, strong privacy protection laws."}, {"Time_Start": 2491.3, "Time_End": 2497.4, "Text": " Some states like Ohio can be very bad because in Ohio, until recently, and I still think"}, {"Time_Start": 2497.4, "Time_End": 2500.98, "Text": " it's true, auto registrations have your SSN on them."}, {"Time_Start": 2500.98, "Time_End": 2502.8, "Text": " This is the registration form in your car."}, {"Time_Start": 2503.1, "Time_End": 2506.36, "Text": " They have your SS in on them and your driver's license number."}, {"Time_Start": 2506.7400000000002, "Time_End": 2509.96, "Text": " Identity thieves know in Ohio, oh, don't, you know."}, {"Time_Start": 2509.98, "Time_End": 2513.66, "Text": " You don't have to go do any hacking or breaking in or dumpster diving."}, {"Time_Start": 2513.66, "Time_End": 2516.46, "Text": " Just go break in somebody's car and take the auto registration."}, {"Time_Start": 2516.46, "Time_End": 2520.98, "Text": " If the guy's got a Lexus, and it means these guys got some money, he's driving a Lexus"}, {"Time_Start": 2520.98, "Time_End": 2525.6, "Text": " unless he stole the damn thing, break in, hey, I've got the auto-in fact, if you can open"}, {"Time_Start": 2525.6, "Time_End": 2530.22, "Text": " the door and just write down the stuff off the vehicle registration and put it back."}, {"Time_Start": 2530.22, "Time_End": 2532.16, "Text": " You don't even have to steal anything."}, {"Time_Start": 2532.16, "Time_End": 2533.36, "Text": " They've made it very easy."}, {"Time_Start": 2533.36, "Time_End": 2539.96, "Text": " I ask you, what the hell do SSNs and driver's license numbers have to do with the registration"}, {"Time_Start": 2539.98, "Time_End": 2546.98, "Text": " of a car. But this is what we call data creep. It grows. Finally, like I've said, you"}, {"Time_Start": 2546.98, "Time_End": 2551.26, "Text": " see how your bank can be a snitch on, you other things like that. You, there are other steps"}, {"Time_Start": 2551.26, "Time_End": 2555.5, "Text": " you can take, like you can use a corporation. Nevada corporations are excellent because the"}, {"Time_Start": 2555.5, "Time_End": 2560.48, "Text": " only thing Nevada knows about the offices of the corporation are their name and mailing address."}, {"Time_Start": 2560.48, "Time_End": 2565.48, "Text": " So you could create a Nevada corporation a totally spurious name. That corporation"}, {"Time_Start": 2565.48, "Time_End": 2569.96, "Text": " under U.S. common law, a corporation is like a person. It can own property, open property, open"}, {"Time_Start": 2569.98, "Time_End": 2575.3, "Text": " bank accounts, everything else. A company can provide you with wraparound privacy."}, {"Time_Start": 2575.3, "Time_End": 2581.22, "Text": " If you're driving a car registered in a corporation, auto plates are public record. If somebody"}, {"Time_Start": 2581.22, "Time_End": 2585.88, "Text": " runs your plate, all they're going to get back is XYZt Corporation. They're not going to get"}, {"Time_Start": 2585.88, "Time_End": 2590.82, "Text": " your name and address. A corporation can open a bank account, have an EIN. A lot of you guys"}, {"Time_Start": 2590.82, "Time_End": 2596.48, "Text": " who are techies can work on contract for short periods of time at companies because you don't"}, {"Time_Start": 2596.48, "Time_End": 2599.96, "Text": " want to be, you know, be holding the one company. You can work."}, {"Time_Start": 2599.98, "Time_End": 2603.7400000000002, "Text": " work for the corporation can sign the contract."}, {"Time_Start": 2603.7400000000002, "Time_End": 2608.58, "Text": " We'll say if you work on a temporary project with a computer services firm, the corporation"}, {"Time_Start": 2608.58, "Time_End": 2610.14, "Text": " signs a contract."}, {"Time_Start": 2610.14, "Time_End": 2616.48, "Text": " The payments are made to the corporation's EIN, not to your SS number, but as an officer"}, {"Time_Start": 2616.48, "Time_End": 2621.22, "Text": " of the corporation, you can access to corporate funds to pay your bill."}, {"Time_Start": 2621.22, "Time_End": 2628.38, "Text": " So a corporation can give you what we call wraparound privacy because it can act, as we say,"}, {"Time_Start": 2628.38, "Time_End": 2629.88, "Text": " in local parentis, for the company."}, {"Time_Start": 2629.98, "Time_End": 2636.22, "Text": " you as if it was you. So I highly recommend the use of a personal corporation."}, {"Time_Start": 2636.22, "Time_End": 2641.64, "Text": " Finally, for banking privacy, there is no way if you maintain bank accounts in the United States,"}, {"Time_Start": 2641.64, "Time_End": 2647.32, "Text": " as you have seen, from the child support people, the suspicious activity reports, whatever."}, {"Time_Start": 2647.32, "Time_End": 2652.2400000000002, "Text": " If you have a bank account in the United States, there is no expectation of privacy, those records"}, {"Time_Start": 2652.2400000000002, "Time_End": 2659.96, "Text": " are available to all sorts of people. I highly recommend, as an ultimate step, that you help and"}, {"Time_Start": 2659.98, "Time_End": 2661.98, "Text": " offshore accounts like in Switzerland."}, {"Time_Start": 2661.98, "Time_End": 2671.98, "Text": " Switzerland, even though there's been some destruction of the privacy there, if you're not a drug dealer and you don't have $50 million over there that shows up over one night,"}, {"Time_Start": 2671.98, "Time_End": 2680.98, "Text": " Switzerland still offers security, knowing that your money is safe and will be there, and it still offers a great deal of privacy."}, {"Time_Start": 2680.98, "Time_End": 2683.98, "Text": " You do not need a million dollars to open a Swiss bank account."}, {"Time_Start": 2683.98, "Time_End": 2685.98, "Text": " You don't even need $10,000."}, {"Time_Start": 2685.98, "Time_End": 2689.96, "Text": " They will issue you an ATM debit card so you can actually"}, {"Time_Start": 2689.98, "Time_End": 2697.98, "Text": " your funds here. You can even get a checkbook. Of course, you should never be writing checks on your Swiss account here, but they'll even give you a multi-currency checkbook."}, {"Time_Start": 2697.98, "Time_End": 2701.98, "Text": " Swiss bank accounts are an ideal way to reclaim some privacy."}, {"Time_Start": 2701.98, "Time_End": 2708.98, "Text": " But here's the rub. You open up an overseas bank account. The Treasury Department says you must file this special form."}, {"Time_Start": 2708.98, "Time_End": 2715.98, "Text": " And it doesn't just go in with your tax return. It goes to the Treasury's Department of foreign asset control."}, {"Time_Start": 2715.98, "Time_End": 2718.98, "Text": " And they say if you have over, I think it's $1,000."}, {"Time_Start": 2718.98, "Time_End": 2723.48, "Text": " dollars in that account when you do your taxes, you're supposed to file this."}, {"Time_Start": 2723.48, "Time_End": 2727.98, "Text": " Now, I say that's up to you. Maybe you forgot to file the form."}, {"Time_Start": 2727.98, "Time_End": 2733.98, "Text": " I'm not telling anybody, so please don't get on me. My mother's best friend retired from the IRS."}, {"Time_Start": 2733.98, "Time_End": 2740.98, "Text": " But the point of it is, is that what I'm saying is that many people who decide they're willing to go all the way for privacy,"}, {"Time_Start": 2740.98, "Time_End": 2742.98, "Text": " do so with foreign bank accounts."}, {"Time_Start": 2742.98, "Time_End": 2746.98, "Text": " Here's my point as I close, because I know I'm run over a little bit."}, {"Time_Start": 2746.98, "Time_End": 2749.98, "Text": " We are in a surveillance society."}, {"Time_Start": 2749.98, "Time_End": 2756.98, "Text": " The United States, although we are democracy and we have more freedoms than any other industrial democracy,"}, {"Time_Start": 2756.98, "Time_End": 2763.98, "Text": " we are also the most monitored people of any democracy because the government is increasingly saying"}, {"Time_Start": 2763.98, "Time_End": 2769.98, "Text": " we are going to take your everyday activities like using a bank account, working and whatever,"}, {"Time_Start": 2769.98, "Time_End": 2775.98, "Text": " and use it as a way to monitor what you are doing to make sure you're not one of the bad people."}, {"Time_Start": 2775.98, "Time_End": 2781.98, "Text": " one of the bad people. The problem is we are the ones who allow this to happen"}, {"Time_Start": 2781.98, "Time_End": 2787.98, "Text": " because they sell these ideas that remove our privacy by saying, well, shouldn't those children"}, {"Time_Start": 2787.98, "Time_End": 2792.98, "Text": " get their child support? Yes, but there's 270 million people in this country."}, {"Time_Start": 2792.98, "Time_End": 2798.98, "Text": " Should we take the privacy away of all of those people to get a quarter million people"}, {"Time_Start": 2798.98, "Time_End": 2804.98, "Text": " who won't honor the obligations to their children? This is the fundamental challenge of a democracy."}, {"Time_Start": 2804.98, "Time_End": 2812.48, "Text": " of a democracy. A few of the guilty, so to speak, go free so that we do not convict the innocent."}, {"Time_Start": 2812.48, "Time_End": 2819.48, "Text": " And that means that privacy must be protected, even if the protection of that privacy allows"}, {"Time_Start": 2819.48, "Time_End": 2827.58, "Text": " some people to escape societal sanction. This is the challenge that we face. Because if we're not"}, {"Time_Start": 2827.58, "Time_End": 2834.96, "Text": " careful, we might be here at deathcon 20, where I'll have a lot more gray hair. And you guys"}, {"Time_Start": 2834.98, "Time_End": 2840.86, "Text": " will too and it is where I say thank you for the letters you've sent me. I really"}, {"Time_Start": 2840.86, "Time_End": 2848.98, "Text": " like these designer transparent envelopes. That could actually happen. So this is why I say,"}, {"Time_Start": 2848.98, "Time_End": 2855.44, "Text": " what this will give you the ability to do is to carve out a zone of privacy so that if somebody"}, {"Time_Start": 2855.44, "Time_End": 2860.28, "Text": " wants to know all about you, they better be willing to spend a lot of money and go through a lot"}, {"Time_Start": 2860.28, "Time_End": 2864.96, "Text": " of effort to do so. That's what I can give you the tools to do."}, {"Time_Start": 2864.98, "Time_End": 2870.66, "Text": " the weapons to do. And if more of us do that, a backlash is starting to happen in this country"}, {"Time_Start": 2870.66, "Time_End": 2876.92, "Text": " about people are saying, wait a minute, they are knowing too much about what we do all of the time."}, {"Time_Start": 2877.36, "Time_End": 2885.6, "Text": " And a backlash is starting. And if more people will hear the call, privacy is not lost yet."}, {"Time_Start": 2886.04, "Time_End": 2892.48, "Text": " But it's up to us to protect it and to take it back and to keep what we have. Thank you very much."}, {"Time_Start": 2894.98, "Time_End": 2896.98, "Text": " Thank you."}]}