{"segments": [{"Time_Start": 0.0, "Time_End": 21.0, "Text": " We all survived last night, I see."}, {"Time_Start": 21.0, "Time_End": 24.0, "Text": " Can everyone hear me in the back of the room?"}, {"Time_Start": 24.0, "Time_End": 27.0, "Text": " Alright, if you can't hear me just yell."}, {"Time_Start": 27.0, "Time_End": 32.0, "Text": " My name is Robert Muncie. I am a security engineer for a financial institution."}, {"Time_Start": 32.0, "Time_End": 39.0, "Text": " And I came up with this presentation after going to Networkers, which is Cisco's premier event,"}, {"Time_Start": 39.0, "Time_End": 45.0, "Text": " where you go and you spend about three days an intense router switching camp."}, {"Time_Start": 45.0, "Time_End": 51.0, "Text": " And basically this is about an hour-long introduction of a seminar that I took, which was about 10 hours."}, {"Time_Start": 51.0, "Time_End": 56.0, "Text": " So there's going to be sections in the slides here that I'm not really going to cover a whole lot of code in."}, {"Time_Start": 56.0, "Time_End": 61.0, "Text": " and I've kind of skipped detail on, but if you're interested in more, this is my email address here."}, {"Time_Start": 61.0, "Time_End": 65.0, "Text": " And at the end of the presentation, if you want, you can give me my business card."}, {"Time_Start": 65.0, "Time_End": 67.0, "Text": " You can give me your business card."}, {"Time_Start": 67.0, "Time_End": 71.0, "Text": " And I'll be happy to answer any questions offline as well."}, {"Time_Start": 71.0, "Time_End": 75.0, "Text": " We're going to start off with some security principles."}, {"Time_Start": 75.0, "Time_End": 79.0, "Text": " Very important to know there is no perfect solution in the world."}, {"Time_Start": 79.0, "Time_End": 81.0, "Text": " Everything is always changing."}, {"Time_Start": 81.0, "Time_End": 85.0, "Text": " And as security professionals, it kind of feels like we're outnumbered at times by the..."}, {"Time_Start": 85.0, "Time_End": 87.0, "Text": " by the other side."}, {"Time_Start": 87.0, "Time_End": 92.0, "Text": " Our goal here is to make it as hard as possible to get information about your network."}, {"Time_Start": 92.0, "Time_End": 95.0, "Text": " If you..."}, {"Time_Start": 95.0, "Time_End": 100.0, "Text": " All right, I know we have fireworks."}, {"Time_Start": 115.0, "Time_End": 122.0, "Text": " There we go."}, {"Time_Start": 122.0, "Time_End": 128.0, "Text": " Okay, so we're going to learn how to make it as hard as possible to get information about the network,"}, {"Time_Start": 128.0, "Time_End": 131.0, "Text": " and we're going to make it even harder for people to gain access."}, {"Time_Start": 131.0, "Time_End": 139.0, "Text": " A typical comp right, a typical network hack takes three stages."}, {"Time_Start": 139.0, "Time_End": 141.0, "Text": " Your first stage is reconnaissance about the target."}, {"Time_Start": 141.0, "Time_End": 144.98, "Text": " You then attempt to gain initial access, and then you attempt to gain initial access, and then you attempt to gain"}, {"Time_Start": 145.0, "Time_End": 147.0, "Text": " elevated privileges."}, {"Time_Start": 147.0, "Time_End": 153.0, "Text": " Along those notes, we're going to look at what we do with our routers before we even plug in the wires to connect to the Internet."}, {"Time_Start": 153.0, "Time_End": 160.0, "Text": " We're going to look at turning off unnecessary services, turning on logging, prevent unauthorized telnet access to the router,"}, {"Time_Start": 160.0, "Time_End": 168.0, "Text": " restrict the S&MP community strings, or disable them, and make authentication secure so that the people performing management are the people we want."}, {"Time_Start": 168.0, "Time_End": 173.0, "Text": " The very first thing we're going to look at here then is turning off unnecessary services."}, {"Time_Start": 173.0, "Time_End": 174.0, "Text": " These three commands here, no service."}, {"Time_Start": 174.0, "Time_End": 187.0, "Text": " commands here, no service UDP small servers, no service TCP small servers, and no service finger are now standard after 12 release of the iOS."}, {"Time_Start": 187.0, "Time_End": 194.0, "Text": " Some people may wonder, well, why do we turn off the echo command, or why is the echo command even part of our router?"}, {"Time_Start": 194.0, "Time_End": 203.0, "Text": " When Cisco was first coming in to being as a company, they took Unix and basically stripped it down and put it onto their router."}, {"Time_Start": 203.0, "Time_End": 207.0, "Text": " In the very early routers, there even used to be email capabilities."}, {"Time_Start": 207.0, "Time_End": 216.16, "Text": " So, one thing you can do with ECHO that's kind of nasty, if you were an attacker, you could send a DNS packet to the router."}, {"Time_Start": 216.16, "Time_End": 218.16, "Text": " You falsify the source address."}, {"Time_Start": 218.88, "Time_End": 229.46, "Text": " You send it to a false port, in this case, 53, which is ECHO, and the router will ignore any access list you may have for DNS control and will simply return the packet because it thinks it was a local request."}, {"Time_Start": 230.6, "Time_End": 232.94, "Text": " And, of course, Finger, no reason to give away."}, {"Time_Start": 233.0, "Time_End": 236.1, "Text": " any information about the router itself."}, {"Time_Start": 237.34, "Time_End": 241.64, "Text": " These commands here are more for the Unix commands."}, {"Time_Start": 242.04, "Time_End": 245.18, "Text": " If you're not familiar with them, it's very good to disable these."}, {"Time_Start": 245.72, "Time_End": 249.82, "Text": " The first two commands, basically, are remote commands."}, {"Time_Start": 249.96, "Time_End": 253.72, "Text": " The first one is a remote execute command, and the second is a remote file copy."}, {"Time_Start": 254.78, "Time_End": 260.04, "Text": " And the last one is a command which enables accurate information about the host TCP ports."}, {"Time_Start": 261.78, "Time_End": 262.98, "Text": " These two commands are,"}, {"Time_Start": 263.0, "Time_End": 267.18, "Text": " interface-specific means you've got to put them on every interface that you want them to happen on."}, {"Time_Start": 267.82, "Time_End": 271.18, "Text": " Typically, I like to put these on the border routers that connect to the Internet."}, {"Time_Start": 271.32, "Time_End": 273.34, "Text": " I like to place them on those interfaces, absolutely."}, {"Time_Start": 274.26, "Time_End": 277.74, "Text": " And after 120, release of the iOS, these are now standard."}, {"Time_Start": 278.36, "Time_End": 284.46, "Text": " So when you look at your configs after you put an IP onto the interface, these will already be there for you."}, {"Time_Start": 285.08, "Time_End": 290.48, "Text": " It's very rare that you would need IP-directed broadcast, unless you were doing multi-casting"}, {"Time_Start": 290.48, "Time_End": 292.58, "Text": " and IP-source routing."}, {"Time_Start": 293.0, "Time_End": 296.9, "Text": " It just says that it'll never forward a packet if it carries a source routing option."}, {"Time_Start": 297.18, "Time_End": 299.22, "Text": " And this is kind of anti-spoofing."}, {"Time_Start": 301.82, "Time_End": 305.16, "Text": " IP and the CEF is Cisco Express forwarding."}, {"Time_Start": 305.54, "Time_End": 312.4, "Text": " The IP-Verify Unicast RPF is reverse path forwarding."}, {"Time_Start": 312.82, "Time_End": 314.1, "Text": " These two commands come together."}, {"Time_Start": 314.78, "Time_End": 318.28, "Text": " This particular command is only good for symmetric routing environments."}, {"Time_Start": 318.4, "Time_End": 321.3, "Text": " This is typical in most companies where you go router A to router B."}, {"Time_Start": 322.02, "Time_End": 322.98, "Text": " If we were looking at,"}, {"Time_Start": 323.0, "Time_End": 327.88, "Text": " at an ISP, an ISP couldn't do this because they have symmetric router, where router"}, {"Time_Start": 327.88, "Time_End": 333.46, "Text": " A could go to both C and D and D could go to router B without having to pass through A."}, {"Time_Start": 333.46, "Time_End": 337.8, "Text": " The Schedule Interval 500 command is also now standard."}, {"Time_Start": 337.8, "Time_End": 341.68, "Text": " It controls the time of responding to interrupts from the network interface, and basically what"}, {"Time_Start": 341.68, "Time_End": 346.06, "Text": " this means is the router is handling lots and lots of packets, that there are always going"}, {"Time_Start": 346.06, "Time_End": 349.54, "Text": " to be an interrupt packet that it's going to have to stop and look at and try to figure out"}, {"Time_Start": 349.54, "Time_End": 351.54, "Text": " what it's supposed to be doing with it."}, {"Time_Start": 351.54, "Time_End": 352.98, "Text": " With this command, we tell it that it can only do it."}, {"Time_Start": 353.0, "Time_End": 358.84, "Text": " that every 500 milliseconds and that gives the router time to process information."}, {"Time_Start": 358.84, "Time_End": 365.28, "Text": " Other things to think about is to restrict or turn off NTP, which is the time protocol."}, {"Time_Start": 365.28, "Time_End": 370.32, "Text": " I like to take one router and turn it into the network time protocol router for the rest of my"}, {"Time_Start": 370.32, "Time_End": 375.84, "Text": " network and then restrict what all the other routers can only receive time information."}, {"Time_Start": 375.84, "Time_End": 380.12, "Text": " This will become more important as we look into turning on logging and we want to make sure"}, {"Time_Start": 380.12, "Time_End": 382.98, "Text": " that if for some reason we need to go back and see what happens."}, {"Time_Start": 383.0, "Time_End": 387.16, "Text": " in a time, we need to know exactly what time those things occurred."}, {"Time_Start": 387.16, "Time_End": 391.5, "Text": " We also want to disable CDP, which is a Cisco discovery protocol."}, {"Time_Start": 391.5, "Time_End": 395.5, "Text": " This is real nice if you're setting up your routers, but once you have them set up, there's"}, {"Time_Start": 395.5, "Time_End": 396.9, "Text": " no reason really to have it on."}, {"Time_Start": 396.9, "Time_End": 403.14, "Text": " It's a layer two protocol, and basically you can type in a command locally on the router, and"}, {"Time_Start": 403.14, "Time_End": 406.94, "Text": " it will tell you what are the routers it can see next to it."}, {"Time_Start": 406.94, "Time_End": 410.24, "Text": " And of course, as always, you want to stay up to date with your iOS levels."}, {"Time_Start": 410.24, "Time_End": 412.98, "Text": " It seems like to me that Cisco releases an iOS about."}, {"Time_Start": 413.0, "Time_End": 419.24, "Text": " every two weeks and a lot of times, yeah, if you laugh from the audience, especially for"}, {"Time_Start": 419.24, "Time_End": 425.5, "Text": " us we have 30-some routers in our network currently and trying to stay up to date with those"}, {"Time_Start": 425.5, "Time_End": 431.32, "Text": " and update the code can sometimes be a challenge."}, {"Time_Start": 431.32, "Time_End": 433.72, "Text": " Let's take a look here at a little simple access list."}, {"Time_Start": 433.72, "Time_End": 436.56, "Text": " This one prevents unauthorized telnet access to the router."}, {"Time_Start": 436.56, "Time_End": 441.58, "Text": " I don't particularly like this particular access list because it allows a huge pool of addresses"}, {"Time_Start": 441.58, "Time_End": 442.98, "Text": " that could manage my router."}, {"Time_Start": 443.0, "Time_End": 448.64, "Text": " If I was going to do it myself or my own particular routers, I would create a subnet"}, {"Time_Start": 448.64, "Time_End": 452.82, "Text": " that only the network administrators were in, and then I would restrict access only to that"}, {"Time_Start": 452.82, "Time_End": 453.82, "Text": " subnet."}, {"Time_Start": 453.82, "Time_End": 460.82, "Text": " That way, you would prevent internal users like developers who might have access to your"}, {"Time_Start": 460.82, "Time_End": 467.48, "Text": " routers for some particular reason or would have elevated access to their desktops."}, {"Time_Start": 467.48, "Time_End": 472.72, "Text": " This command basically works in the fact that you take an access list, you permit your subnet range"}, {"Time_Start": 472.72, "Time_End": 474.06, "Text": " of whatever you want to do here."}, {"Time_Start": 474.12, "Time_End": 481.0, "Text": " So here I've done 10 xX, x,x, and then you go down into line VTY, and I did 0 to 44 here."}, {"Time_Start": 481.34000000000003, "Time_End": 483.86, "Text": " You can do 0 to 4 as typical."}, {"Time_Start": 484.58000000000004, "Time_End": 487.5, "Text": " And then you do, this is a sub-command."}, {"Time_Start": 487.64000000000004, "Time_End": 491.08000000000004, "Text": " The access list 12 in is actually a sub-command to the line command."}, {"Time_Start": 491.72, "Time_End": 498.22, "Text": " So in the enable mode, you would type line VTY, 0, space, 4, and then you would type in your"}, {"Time_Start": 498.22, "Time_End": 499.74, "Text": " command in the sub-interface."}, {"Time_Start": 501.74, "Time_End": 502.16, "Text": " Logging."}, {"Time_Start": 502.72, "Time_End": 507.3, "Text": " is very important, especially if, you know, after you've been compromised, you need to go back"}, {"Time_Start": 507.3, "Time_End": 512.74, "Text": " and see what happens, or if you are doing IDS, you want to be able to have a historical log"}, {"Time_Start": 512.74, "Time_End": 515.48, "Text": " of what was going on here."}, {"Time_Start": 515.48, "Time_End": 520.98, "Text": " The MSECS command is only valid if you're using MTP."}, {"Time_Start": 520.98, "Time_End": 527.5400000000001, "Text": " Some of the very small routers don't have their own time protocols or don't have internal clocks."}, {"Time_Start": 527.5400000000001, "Time_End": 530.96, "Text": " So you may want to use local instead."}, {"Time_Start": 530.96, "Time_End": 532.7, "Text": " And then the last command we have."}, {"Time_Start": 532.72, "Time_End": 536.38, "Text": " We have logging, and then here we would put in a server IP address."}, {"Time_Start": 536.38, "Time_End": 539.44, "Text": " And basically, we want to get these logs off of our routers."}, {"Time_Start": 539.44, "Time_End": 542.8000000000001, "Text": " If you leave the logs on the routers, the log is a fixed size."}, {"Time_Start": 542.8000000000001, "Time_End": 548.72, "Text": " You can increase it, but if you reboot the router, all the logs go with it."}, {"Time_Start": 548.72, "Time_End": 554.76, "Text": " Restricting SNMP access, if you're in a small environment, I don't even recommend using the management"}, {"Time_Start": 554.76, "Time_End": 560.6600000000001, "Text": " protocol, but unfortunately in the larger environments, it's almost impossible to get away from."}, {"Time_Start": 560.6600000000001, "Time_End": 562.7, "Text": " So here, what this one does is we have a lot of it."}, {"Time_Start": 562.72, "Time_End": 568.6600000000001, "Text": " access list number 13. In this particular case, I'd permit two IPs, so this would be my two"}, {"Time_Start": 568.6600000000001, "Time_End": 575.24, "Text": " SNMP collection boxes. And then I would issue the command SNMP community. I'd community"}, {"Time_Start": 575.24, "Time_End": 578.78, "Text": " put it in the password. In this case, we're putting in the read only password."}, {"Time_Start": 582.74, "Time_End": 588.32, "Text": " And then the 13 references back to the access list 13. A couple other things to know about"}, {"Time_Start": 588.32, "Time_End": 592.4, "Text": " SNMP. Be sure and don't use public, private, or secret."}, {"Time_Start": 592.72, "Time_End": 596.6800000000001, "Text": " If so, just posted on the internet and let people have fun with it."}, {"Time_Start": 597.26, "Time_End": 602.48, "Text": " And be sure to use different strings for the read-only and write-only communities."}, {"Time_Start": 602.9, "Time_End": 606.78, "Text": " Remember, they can be cracked, especially if they're easy, so you need to use strong passwords."}, {"Time_Start": 607.6, "Time_End": 610.52, "Text": " And be sure and used a mixed alpha-numeric strings."}, {"Time_Start": 610.52, "Time_End": 615.94, "Text": " I typically like to use about a 10-character password with numbers and capitals mixed in there."}, {"Time_Start": 617.74, "Time_End": 619.5400000000001, "Text": " Make authentication secure."}, {"Time_Start": 620.1600000000001, "Time_End": 622.7, "Text": " There's two ways you can type in the enable password."}, {"Time_Start": 622.72, "Time_End": 628.72, "Text": " You can do enable password and then the password, or you can do enable secret and then the password."}, {"Time_Start": 628.72, "Time_End": 635.72, "Text": " I don't recommend using the enable password. It's a very weak algorithm that encrypts the password."}, {"Time_Start": 635.72, "Time_End": 639.72, "Text": " If you use enable secrets, you're using an MD5 one-way hash."}, {"Time_Start": 639.72, "Time_End": 644.72, "Text": " And then the other thing I'd like to do here is I like to use privilege levels."}, {"Time_Start": 644.72, "Time_End": 649.72, "Text": " This is good for auxiliary, especially if you're going to connect a modem for out-of-band management."}, {"Time_Start": 649.72, "Time_End": 651.72, "Text": " And here I give it at privilege level five."}, {"Time_Start": 651.72, "Time_End": 656.52, "Text": " level 5. That means unless you know the enabled password, the only thing you can do"}, {"Time_Start": 656.52, "Time_End": 661.44, "Text": " is read only in the router commands. You can go into enable, but you can't save and you can't"}, {"Time_Start": 661.44, "Time_End": 667.9, "Text": " make changes. As an administrator, though, you can put in a password later and you can pass"}, {"Time_Start": 667.9, "Time_End": 675.08, "Text": " into true enable mode. Along with this, make sure that physical access is highly restricted."}, {"Time_Start": 675.08, "Time_End": 680.64, "Text": " Really, this should be one or two people should have key access. Given 10 minutes and physical"}, {"Time_Start": 680.64, "Time_End": 681.7, "Text": " access to your router."}, {"Time_Start": 681.72, "Time_End": 683.96, "Text": " I can compromise it and you would never know the difference."}, {"Time_Start": 685.96, "Time_End": 688.52, "Text": " And Cisco will kindly give you the information on how to do that."}, {"Time_Start": 691.48, "Time_End": 691.9200000000001, "Text": " Yeah."}, {"Time_Start": 707.9200000000001, "Time_End": 710.0400000000001, "Text": " You can't be able to be able to know about getting into the password and clearing the password and you do it?"}, {"Time_Start": 710.0400000000001, "Time_End": 711.7, "Text": " You reload and you can reload and you come back."}, {"Time_Start": 711.72, "Time_End": 715.72, "Text": " with the configuration. And then you just put in whatever password you'd like."}, {"Time_Start": 715.72, "Time_End": 723.0, "Text": " It's really just as simple as that. It varies per model on how exactly you do it. And switches"}, {"Time_Start": 723.0, "Time_End": 728.96, "Text": " are a little different than routers, but for all of them, it's pretty straightforward. On Cisco"}, {"Time_Start": 728.96, "Time_End": 735.12, "Text": " site, you just type in your model number and then recover password, and it'll bring up the information"}, {"Time_Start": 735.12, "Time_End": 741.7, "Text": " here. There's two ways really to do authentication. You can do Radius and Tacax. In our environment, we"}, {"Time_Start": 741.72, "Time_End": 747.5, "Text": " use radius. So I've done the radius example here. The AAA new model is just how"}, {"Time_Start": 747.5, "Time_End": 752.5, "Text": " you tell the router I'm now going to make all authentication secure. In this case, I do triple"}, {"Time_Start": 752.5, "Time_End": 758.02, "Text": " A authentication, log on, radius, local, which means that anyone connecting in will first either be"}, {"Time_Start": 758.02, "Time_End": 761.64, "Text": " authenticated to the radius server. And if they don't have an account on the radius server,"}, {"Time_Start": 761.64, "Time_End": 767.82, "Text": " then it goes to local authentication. And then in this case, I now do username, and I would type in"}, {"Time_Start": 767.82, "Time_End": 771.5400000000001, "Text": " my name here, which would be Robert. And then whatever password."}, {"Time_Start": 771.72, "Time_End": 777.9200000000001, "Text": " password. To here, you can also do privilege levels. So if, for instance, you wanted"}, {"Time_Start": 777.9200000000001, "Time_End": 782.0, "Text": " to give a developer read only access so that he could tone it into your router and then maybe"}, {"Time_Start": 782.0, "Time_End": 787.12, "Text": " telling it into the network itself, you could give him only read only. But you could give"}, {"Time_Start": 787.12, "Time_End": 793.4, "Text": " your users a higher level of privilege. Also in the logs, it now tells you who logged into your"}, {"Time_Start": 793.4, "Time_End": 799.1600000000001, "Text": " router and what changes they made. That's kind of helpful. And then later in the command"}, {"Time_Start": 799.16, "Time_End": 804.3199999999999, "Text": " you have to type in the radius server host, which is basically just an IP. And then here"}, {"Time_Start": 804.3199999999999, "Time_End": 810.52, "Text": " I've used a shared key. The shared key, by the way, is not encrypted inside the configs."}, {"Time_Start": 812.92, "Time_End": 817.04, "Text": " Other things to know about authentication, no matter what you do, if you're just typing in your"}, {"Time_Start": 817.04, "Time_End": 821.3399999999999, "Text": " password, it's in clear text. So if someone is sitting there and watching, they can get your"}, {"Time_Start": 821.3399999999999, "Time_End": 826.22, "Text": " text where they can get your passwords fairly easily. I would consider a one-time password method or"}, {"Time_Start": 826.22, "Time_End": 829.14, "Text": " considering using SSH. The new I"}, {"Time_Start": 829.16, "Time_End": 833.28, "Text": " supports SSH. I'm not really going to go into how to do that because"}, {"Time_Start": 833.28, "Time_End": 842.66, "Text": " that's a fairly complex topic. It's important. Do what? I still can't hear you."}, {"Time_Start": 842.66, "Time_End": 855.16, "Text": " Oh, it's one. Was it one, one, one? Yeah, it's one. Yes, it's one. And then along"}, {"Time_Start": 855.16, "Time_End": 859.14, "Text": " with that, we want to audit our login attempts. And so we type in IP accounting and then"}, {"Time_Start": 859.16, "Time_End": 865.42, "Text": " an IP account access violations. And then this simply goes into the logs. And then in this case,"}, {"Time_Start": 865.5, "Time_End": 869.66, "Text": " I put in logging, and then I would type in the IP for my syslog server if I hadn't done it"}, {"Time_Start": 869.66, "Time_End": 876.0, "Text": " previously. You can also do SNMP traps. If you're using, you know, some type of S&MP program"}, {"Time_Start": 876.0, "Time_End": 883.92, "Text": " like OpenView or there's some freeware ones that we use that we like. Okay, now we're ready to plug"}, {"Time_Start": 883.92, "Time_End": 889.14, "Text": " in a network cable and hook up to the internet. We're going to look at preventing spoofing, some"}, {"Time_Start": 889.16, "Time_End": 896.8199999999999, "Text": " DoS protection. NAD is a good, is it bad? We're going to look at the new firewall feature set available from 12X on, which is pretty nifty."}, {"Time_Start": 897.24, "Time_End": 905.38, "Text": " And you now also have IDS that you can do either local in the router or have it sent to an IDS product, which of course Cisco will be happy to sell you."}, {"Time_Start": 906.66, "Time_End": 912.28, "Text": " Preventing spoofing. This is a fairly simple access list here. We have access list 109, deny IP, which is my internal."}, {"Time_Start": 913.18, "Time_End": 919.14, "Text": " And then two internals here, 172 and 10. And then access list 101 permit IP any any, which says,"}, {"Time_Start": 919.16, "Time_End": 924.54, "Text": " says any traffic is allowed in except internal traffic behind the router. And then"}, {"Time_Start": 924.54, "Time_End": 929.4599999999999, "Text": " here I've applied it to the serial interfaces IP access group instead of list. I don't know"}, {"Time_Start": 929.4599999999999, "Time_End": 933.78, "Text": " why. It's just going to make you do it that way. 101 referencing back to the access list. And"}, {"Time_Start": 933.78, "Time_End": 940.4, "Text": " then in means for inbound traffic, all access list can go in or out. So here we have a little"}, {"Time_Start": 940.4, "Time_End": 945.4, "Text": " detailed diagram of what's going on here. We have the internet passing into a border"}, {"Time_Start": 945.4, "Time_End": 948.84, "Text": " passing into an internal router and then passing into our network here."}, {"Time_Start": 949.8, "Time_End": 954.6999999999999, "Text": " On the serial S-0-1 interface, which is connecting between the two routers,"}, {"Time_Start": 955.4, "Time_End": 961.9399999999999, "Text": " we're permitting traffic from the 142 network, and we're denying everything else."}, {"Time_Start": 962.4599999999999, "Time_End": 966.72, "Text": " And then this is all inbound to the S-01, which is really outbound to the Internet."}, {"Time_Start": 967.26, "Time_End": 968.02, "Text": " That kind of makes sense."}, {"Time_Start": 968.8, "Time_End": 973.4, "Text": " And then on the interface, serial zero on the other router, here we have two different groups,"}, {"Time_Start": 973.4, "Time_End": 975.38, "Text": " and this is basically just reversed."}, {"Time_Start": 975.4, "Time_End": 978.72, "Text": " reversing what's allowed in versus what's allowed out."}, {"Time_Start": 979.72, "Time_End": 982.18, "Text": " And this is pretty standard here for most networks."}, {"Time_Start": 983.8199999999999, "Time_End": 989.28, "Text": " Spoofing continued. IPSEF distributed, and then interface serial and then a number,"}, {"Time_Start": 989.4599999999999, "Time_End": 992.9, "Text": " and then you can do IP Verify Unicass Reverse Path."}, {"Time_Start": 993.5, "Time_End": 998.0799999999999, "Text": " This mitigates source adder spoofing by checking that a package return path uses the same interface"}, {"Time_Start": 998.0799999999999, "Time_End": 1005.04, "Text": " it arrived on. Not appropriate for ISPs, but very helpful for us as just business people"}, {"Time_Start": 1005.0400000000001, "Time_End": 1006.1400000000001, "Text": " hooking up to the internet."}, {"Time_Start": 1010.58, "Time_End": 1013.7, "Text": " DOS protection or prevention."}, {"Time_Start": 1014.58, "Time_End": 1017.22, "Text": " These particular access lists are good to put on your router,"}, {"Time_Start": 1017.6600000000001, "Time_End": 1019.1400000000001, "Text": " and then if you come under attack,"}, {"Time_Start": 1019.5600000000001, "Time_End": 1021.8000000000001, "Text": " to go ahead and type the commands into your interface."}, {"Time_Start": 1022.3800000000001, "Time_End": 1023.94, "Text": " Access lists can take performance hits."}, {"Time_Start": 1024.48, "Time_End": 1026.98, "Text": " The more access lists that have to be processed by the packet,"}, {"Time_Start": 1026.98, "Time_End": 1029.14, "Text": " the slower your packets are inbound."}, {"Time_Start": 1029.92, "Time_End": 1033.42, "Text": " So this slide and the next slide, I'd like to have both of these axi lists"}, {"Time_Start": 1033.42, "Time_End": 1035.02, "Text": " on my router, but not active."}, {"Time_Start": 1035.04, "Time_End": 1041.28, "Text": " And here we're basically just saying that all outbound ping responses are limited to 256 kilobytes."}, {"Time_Start": 1042.28, "Time_End": 1047.0, "Text": " And then in the next one, we're going to limit inbound TCP sin packets to 8 kilobytes."}, {"Time_Start": 1049.76, "Time_End": 1050.32, "Text": " Nat."}, {"Time_Start": 1051.52, "Time_End": 1052.04, "Text": " Yeah."}, {"Time_Start": 1052.04, "Time_End": 1058.24, "Text": " How does the control the TCP packets have a human or active in the J2CPC packages?"}, {"Time_Start": 1059.12, "Time_End": 1060.68, "Text": " You mean in the last slide?"}, {"Time_Start": 1061.24, "Time_End": 1065.02, "Text": " In the last slide, it just looks at, it just, it allows only a certain amount of"}, {"Time_Start": 1065.04, "Time_End": 1066.58, "Text": " of those TCPIP packets through."}, {"Time_Start": 1067.58, "Time_End": 1067.7, "Text": " Yeah."}, {"Time_Start": 1067.8999999999999, "Time_End": 1070.48, "Text": " So it looks at them and if it reaches its limit in the queue,"}, {"Time_Start": 1070.68, "Time_End": 1073.52, "Text": " it starts dropping them, and it just puts them into the bit bucket and ignores them."}, {"Time_Start": 1075.6399999999999, "Time_End": 1077.8999999999999, "Text": " So you don't necessarily stop the attack,"}, {"Time_Start": 1078.1399999999999, "Time_End": 1082.1399999999999, "Text": " but you're mitigating the attack on your router and you allow business to continue."}, {"Time_Start": 1083.44, "Time_End": 1085.24, "Text": " NAD, that's real good."}, {"Time_Start": 1085.44, "Time_End": 1087.46, "Text": " It hides your entire network behind one IP."}, {"Time_Start": 1087.46, "Time_End": 1090.46, "Text": " It allows you for control and monitoring of internet usage."}, {"Time_Start": 1091.26, "Time_End": 1091.7, "Text": " Bad."}, {"Time_Start": 1091.94, "Time_End": 1093.48, "Text": " It may not work for all servers."}, {"Time_Start": 1094.02, "Time_End": 1095.02, "Text": " In this, in 1.5.5."}, {"Time_Start": 1095.04, "Time_End": 1106.3799999999999, "Text": " Since we all go to Windows 2000, as we go to Windows 2000, the Windows 2000 DNS servers have to be able to talk to the outside world."}, {"Time_Start": 1107.3, "Time_End": 1113.1399999999999, "Text": " So in this case, you may have to open up holes in NET, and we're going to look at that here in our slides and exactly how you would do that."}, {"Time_Start": 1113.52, "Time_End": 1117.18, "Text": " Also, email has to have a way to come through, and email does not work through NET."}, {"Time_Start": 1118.78, "Time_End": 1121.0, "Text": " So here we have basic IPNET commands."}, {"Time_Start": 1121.34, "Time_End": 1122.6, "Text": " Here we're setting up the pool."}, {"Time_Start": 1122.6000000000001, "Time_End": 1128.96, "Text": " and in this case, I do IP NAT pool, and then I just have a particular name here."}, {"Time_Start": 1129.0000000000002, "Time_End": 1131.18, "Text": " In this case, it's just a random name."}, {"Time_Start": 1131.68, "Time_End": 1133.3600000000001, "Text": " And then outside IP, outside IP."}, {"Time_Start": 1133.5400000000002, "Time_End": 1136.5200000000002, "Text": " This can be a range, or it can be one single IP."}, {"Time_Start": 1137.3200000000002, "Time_End": 1138.22, "Text": " Prefects link 30."}, {"Time_Start": 1138.9, "Time_End": 1143.7600000000002, "Text": " And then the next we do IPNAT inside source route map and then a name."}, {"Time_Start": 1145.1000000000001, "Time_End": 1151.9800000000002, "Text": " So these commands, this IPNAT inside source command is going to connect into the next slide here."}, {"Time_Start": 1152.6000000000001, "Time_End": 1155.4, "Text": " So here we're setting up the route map."}, {"Time_Start": 1155.4800000000002, "Time_End": 1160.7800000000002, "Text": " So we have route map, a name permit, and then the 10 is an access list, which is going to appear later."}, {"Time_Start": 1161.2400000000002, "Time_End": 1166.7, "Text": " And then we have match IP addresses to those access lists, which says only these IPs pass through NAT."}, {"Time_Start": 1167.5800000000002, "Time_End": 1170.5600000000002, "Text": " Helpful if you have a group that you don't want to go out to the Internet."}, {"Time_Start": 1171.2600000000002, "Time_End": 1175.3600000000001, "Text": " And then we have an IP access list, an extended access list."}, {"Time_Start": 1175.9, "Time_End": 1180.68, "Text": " So over here, these are people who we're going to allow through our NAT."}, {"Time_Start": 1180.68, "Time_End": 1184.3600000000001, "Text": " our NAT, or if we want to allow, you know, specific services."}, {"Time_Start": 1186.24, "Time_End": 1188.74, "Text": " So in this case here, we're going to allow email."}, {"Time_Start": 1189.28, "Time_End": 1203.5, "Text": " So we have IPNAT inside source static TCPIP, internal IP, the port, which is 25, to the external IP, to the external IP, and then port, and then extendable simply means that it can handle multiple types of traffic."}, {"Time_Start": 1203.96, "Time_End": 1206.7, "Text": " It allows a service from the outside world to talk to your internal server."}, {"Time_Start": 1207.04, "Time_End": 1210.66, "Text": " I don't particularly like to do this command, and I only like to do it to DMZ server."}, {"Time_Start": 1210.68, "Time_End": 1215.46, "Text": " servers, unless someone feels good about opening up the Internet to their exchange server."}, {"Time_Start": 1216.92, "Time_End": 1219.8, "Text": " The firewall feature set has just now become available."}, {"Time_Start": 1220.0800000000002, "Time_End": 1223.22, "Text": " It's really great if you have branch offices that you're going to connect to the Internet."}, {"Time_Start": 1223.74, "Time_End": 1225.74, "Text": " You don't want to buy a firewall for them."}, {"Time_Start": 1226.1200000000001, "Time_End": 1229.66, "Text": " Cisco now allows you to buy a higher-priced software feature set."}, {"Time_Start": 1230.14, "Time_End": 1231.26, "Text": " You get a basic firewall."}, {"Time_Start": 1231.64, "Time_End": 1232.94, "Text": " It's not a great firewall."}, {"Time_Start": 1233.8400000000001, "Time_End": 1235.8400000000001, "Text": " I don't recommend it for your main office."}, {"Time_Start": 1236.3600000000001, "Time_End": 1240.66, "Text": " There is a performance hit, and typically it's good to have lots of memory."}, {"Time_Start": 1240.68, "Time_End": 1242.28, "Text": " and your routers as you use it."}, {"Time_Start": 1243.88, "Time_End": 1246.74, "Text": " This is a typical firewall feature set command."}, {"Time_Start": 1246.8600000000001, "Time_End": 1252.22, "Text": " Basically, we turn on the audit trail, and then we name what particular services we want to watch."}, {"Time_Start": 1252.66, "Time_End": 1258.98, "Text": " And in this case, I watch TCP, UDP, FTP, TFTP, and SNMTP."}, {"Time_Start": 1261.0600000000002, "Time_End": 1262.96, "Text": " VIDES feature set is also new."}, {"Time_Start": 1263.8600000000001, "Time_End": 1265.28, "Text": " It does network-based intrusion."}, {"Time_Start": 1265.54, "Time_End": 1267.5600000000002, "Text": " It's not as good as a host-based intrusion system."}, {"Time_Start": 1267.9, "Time_End": 1269.0600000000002, "Text": " It slows down traffic."}, {"Time_Start": 1269.6000000000001, "Time_End": 1270.48, "Text": " It's even worse."}, {"Time_Start": 1270.68, "Time_End": 1274.68, "Text": " really than the firewall feature set, because a firewall feature set only has to look at a packet."}, {"Time_Start": 1275.1000000000001, "Time_End": 1276.68, "Text": " The IDES has to think about a packet."}, {"Time_Start": 1278.18, "Time_End": 1285.14, "Text": " I typically would only use this on a bigger router if you were using 7200s or something like that."}, {"Time_Start": 1286.98, "Time_End": 1296.18, "Text": " And then in the same action here, IP audit, info action alarm drop reset, which says if it happens,"}, {"Time_Start": 1296.66, "Time_End": 1300.66, "Text": " you're going to note it. You're going to take the following actions. You're going to set off an online."}, {"Time_Start": 1300.68, "Time_End": 1304.68, "Text": " you're going to drop the packet and you're going to reset that particular connection."}, {"Time_Start": 1304.68, "Time_End": 1310.68, "Text": " And then the rest of them are logging. You can also do anti-spam with this."}, {"Time_Start": 1310.68, "Time_End": 1316.68, "Text": " So, and in this case, this particular command, the IP audit, S&MTP, spam says,"}, {"Time_Start": 1316.68, "Time_End": 1321.68, "Text": " if an email is inbound and it goes to more than 25 people, it's spam, it gets dropped."}, {"Time_Start": 1321.68, "Time_End": 1323.68, "Text": " Kind of nice."}, {"Time_Start": 1323.68, "Time_End": 1325.68, "Text": " Do what?"}, {"Time_Start": 1325.68, "Time_End": 1329.68, "Text": " No, you can change it."}, {"Time_Start": 1329.68, "Time_End": 1330.68, "Text": " You can change it."}, {"Time_Start": 1330.68, "Time_End": 1337.68, "Text": " make a 10, 100, it depends on what you really consider spam. 25 is the default."}, {"Time_Start": 1341.68, "Time_End": 1360.66, "Text": " Let's see. Whoa. Okay, we're a little off here on the projector. I don't know what happened on this one. The IP audit name is how this one begins. And then it has a name info list 99. So now I'm going to use an access list. In this particular case, I can say, I don't want you to watch package."}, {"Time_Start": 1360.68, "Time_End": 1367.68, "Text": " from my internal network, which is where, you know, no reason to slow these packets down because I'm hopefully going to trust my internal traffic."}, {"Time_Start": 1367.68, "Time_End": 1370.68, "Text": " And then I'm going to permit anything else that comes through."}, {"Time_Start": 1370.68, "Time_End": 1373.68, "Text": " I'm going to say, I want you to look at and I want you to monitor."}, {"Time_Start": 1373.68, "Time_End": 1381.68, "Text": " And of course, the IDS feature set and the firewall feature set both have to be turned on, and they're turned on at the interface level."}, {"Time_Start": 1381.68, "Time_End": 1385.68, "Text": " So in this particular case, Fast Ether 00 happens to be connected to the Internet."}, {"Time_Start": 1385.68, "Time_End": 1389.68, "Text": " I come on and I do IP audit. The IDS info is actually the name of the interface level."}, {"Time_Start": 1389.68, "Time_End": 1394.68, "Text": " the name of whatever you call your IDS service and then for inbound traffic."}, {"Time_Start": 1394.68, "Time_End": 1399.68, "Text": " You can also do outbound traffic depending on where you want to put it."}, {"Time_Start": 1399.68, "Time_End": 1404.68, "Text": " Now let's hook up a branch office. Not that we would ever have those."}, {"Time_Start": 1404.68, "Time_End": 1408.68, "Text": " We're going to look at a two office connection. I'm going to talk about some other problems"}, {"Time_Start": 1408.68, "Time_End": 1414.68, "Text": " that you may see on slower lines like ISDN and dial-up and then what to do if you have more than 10 sites."}, {"Time_Start": 1414.68, "Time_End": 1418.68, "Text": " Why would we want to use the Internet to hook up two offices?"}, {"Time_Start": 1418.68, "Time_End": 1423.68, "Text": " offices. Well, it's a lot cheaper than hooking up a frame relay. It's a lot easier to do."}, {"Time_Start": 1423.68, "Time_End": 1428.68, "Text": " You can protect the branch office traffic using what we're going to look at here."}, {"Time_Start": 1428.68, "Time_End": 1431.68, "Text": " And it's fairly simple once you get it in place."}, {"Time_Start": 1431.68, "Time_End": 1435.68, "Text": " We're going to use encryption here."}, {"Time_Start": 1435.68, "Time_End": 1439.68, "Text": " So here we have crypto map. We're going to give it a name, a number."}, {"Time_Start": 1439.68, "Time_End": 1441.68, "Text": " The name and number are irrelevant."}, {"Time_Start": 1441.68, "Time_End": 1447.68, "Text": " And then IPSEC dash, ISAM, KMP. Set peer, we're going to set the branch office IP."}, {"Time_Start": 1447.68, "Time_End": 1453.68, "Text": " this IP. And then we're going to do a set, transform, set, encryption, des. Now you can also do triple"}, {"Time_Start": 1453.68, "Time_End": 1460.68, "Text": " Dez. And then match address 101 is matching to the access list here at the bottom. So here we have"}, {"Time_Start": 1460.68, "Time_End": 1466.68, "Text": " access list 101, permit IP, local IP, remote IP. And this basically says that only this IP is allowed"}, {"Time_Start": 1466.68, "Time_End": 1473.68, "Text": " to send encrypted traffic to this router. And then we're also going to set up the policy."}, {"Time_Start": 1473.68, "Time_End": 1476.68, "Text": " In this case, I'm using pre-shared keys, which is authentication pre-shared."}, {"Time_Start": 1476.68, "Time_End": 1482.68, "Text": " pre-shared. Crypto, ISAM, key, and then I'm going to set the key as whatever you want to make it."}, {"Time_Start": 1482.68, "Time_End": 1486.68, "Text": " Once again, the keys are in clear text in the configs."}, {"Time_Start": 1486.68, "Time_End": 1489.68, "Text": " And then the address we're going to use the remote IP."}, {"Time_Start": 1489.68, "Time_End": 1494.68, "Text": " And then the pre-shared key has to be the same on both sides, of course."}, {"Time_Start": 1494.68, "Time_End": 1497.68, "Text": " Problems you may see, ISDN and dial-up are more complex."}, {"Time_Start": 1497.68, "Time_End": 1501.68, "Text": " The lines go up and down, of course, because we don't, that's the reason we bought ISDN,"}, {"Time_Start": 1501.68, "Time_End": 1503.68, "Text": " is we didn't want to have traffic continuously."}, {"Time_Start": 1503.68, "Time_End": 1506.66, "Text": " Workarounds for that. You have to develop access list that can"}, {"Time_Start": 1506.68, "Time_End": 1511.68, "Text": " determine if the traffic is interesting to turn back on the crypto tunnels."}, {"Time_Start": 1511.68, "Time_End": 1515.68, "Text": " Otherwise you're just going to send packets and the packets are going to drop because they don't know where they're going."}, {"Time_Start": 1515.68, "Time_End": 1520.68, "Text": " Also, if you use smaller routers for this, small routers don't have an internal time source."}, {"Time_Start": 1520.68, "Time_End": 1527.68, "Text": " To workarounds for that is you can tell them to use an NTP source that's out on the network, which is okay."}, {"Time_Start": 1527.68, "Time_End": 1534.68, "Text": " Or you could, as my Cisco instructor said, you could hook up a GPS to the back of your router and they would have a time source."}, {"Time_Start": 1534.68, "Time_End": 1537.68, "Text": " More than 10 sites."}, {"Time_Start": 1537.68, "Time_End": 1543.68, "Text": " After you get to about 10 sites, typing in shared keys for each different site could be a little repetitive."}, {"Time_Start": 1543.68, "Time_End": 1545.68, "Text": " Your configs could be a little long."}, {"Time_Start": 1545.68, "Time_End": 1548.68, "Text": " You can then go to what's called TED."}, {"Time_Start": 1548.68, "Time_End": 1554.68, "Text": " And TED is an algorithm that allows you to do hundreds of sites and everything is dynamic."}, {"Time_Start": 1554.68, "Time_End": 1563.68, "Text": " The configuration for that, I could spend an hour on in slides trying to show what you could do with TED and how it actually works."}, {"Time_Start": 1563.68, "Time_End": 1570.68, "Text": " Hardware limits the amount of tunnels, particular routers that we have, we can do 2,000 tunnels."}, {"Time_Start": 1570.68, "Time_End": 1576.68, "Text": " The 2620s, which just now are capable of the encryption, I think, can handle like 50."}, {"Time_Start": 1576.68, "Time_End": 1582.68, "Text": " But the problem is, is you get into speed problems with how much bandwidth can be pushed through those routers."}, {"Time_Start": 1582.68, "Time_End": 1587.68, "Text": " And then, of course, a fully mesh design would be even more complex if you consider 10 sites."}, {"Time_Start": 1587.68, "Time_End": 1592.68, "Text": " So each of those 10 sites would then have 10 sites and 10 sites, so you'd have 40 pre-shared keys."}, {"Time_Start": 1592.68, "Time_End": 1596.68, "Text": " shared keys. Obviously not the best thing in the world."}, {"Time_Start": 1596.68, "Time_End": 1600.68, "Text": " That's pretty much it. In summary, don't use the default blindly."}, {"Time_Start": 1600.68, "Time_End": 1603.68, "Text": " Deploy services that aren't needed. Allow device management from anywhere."}, {"Time_Start": 1603.68, "Time_End": 1607.68, "Text": " Use clear or easy guess passwords. Send important data in clear text."}, {"Time_Start": 1607.68, "Time_End": 1610.68, "Text": " And assume that you're not going to be hacked."}, {"Time_Start": 1610.68, "Time_End": 1612.68, "Text": " Do make sure that you secure your network devices."}, {"Time_Start": 1612.68, "Time_End": 1616.68, "Text": " Use strong authentication. Deploy firewalls on all internet connections."}, {"Time_Start": 1616.68, "Time_End": 1620.68, "Text": " Deploy some form of intrusion detection and make sure that you are logging."}, {"Time_Start": 1620.68, "Time_End": 1624.68, "Text": " These particular sources right here are really good."}, {"Time_Start": 1624.68, "Time_End": 1630.68, "Text": " We have Cisco's improving security on Cisco routers and security technical tips."}, {"Time_Start": 1630.68, "Time_End": 1636.68, "Text": " And then these are more of my personal sites that I like to read just for interesting."}, {"Time_Start": 1636.68, "Time_End": 1644.68, "Text": " Which of course is InfoWore, Insecure, Security Portal, Security Focus, Sands, and of course Coast."}, {"Time_Start": 1644.68, "Time_End": 1646.68, "Text": " That's it."}, {"Time_Start": 1650.68, "Time_End": 1652.68, "Text": " Thank you."}]}