{"segments": [{"Time_Start": 0.0, "Time_End": 20.54, "Text": " The future of criminal law. People often want to see into the future, and today that's what we're going to do."}, {"Time_Start": 20.62, "Time_End": 22.46, "Text": " We're going to look at what's going to happen."}, {"Time_Start": 23.46, "Time_End": 29.8, "Text": " What is the future? Some people say that technology is the future, but we all know that the real"}, {"Time_Start": 30.0, "Time_End": 35.42, "Text": " is globalization. And what globalization is going to bring us is international computer"}, {"Time_Start": 35.42, "Time_End": 40.78, "Text": " crime laws. Not global at first, but eventually that's what we're moving towards. And what"}, {"Time_Start": 40.78, "Time_End": 49.7, "Text": " I want to look at is the first major, probably to be successful initiative to have an international"}, {"Time_Start": 49.7, "Time_End": 59.760000000000005, "Text": " computer crime law. Why do we need international computer crime laws? Because the Internet is an international"}, {"Time_Start": 59.76, "Time_End": 66.84, "Text": " system because computer crime and crime of all sorts now can cross boundaries. In the old days,"}, {"Time_Start": 67.17999999999999, "Time_End": 73.36, "Text": " I had to go into the library with the candlestick if I was going to kill Colonel Mustard."}, {"Time_Start": 73.8, "Time_End": 79.46, "Text": " I had to actually physically be there. And while being there, I could leave behind all sorts of evidence,"}, {"Time_Start": 79.46, "Time_End": 86.18, "Text": " from fingerprints to hair samples, eyewitnesses who may have seen me enter the room,"}, {"Time_Start": 86.53999999999999, "Time_End": 89.32, "Text": " all the way to today leaving behind DNA."}, {"Time_Start": 89.76, "Time_End": 97.06, "Text": " Now, I can be the criminal in one country, I can attack a victim in another country,"}, {"Time_Start": 97.26, "Time_End": 100.56, "Text": " and the evidence can be strewn in any number of countries in between."}, {"Time_Start": 101.48, "Time_End": 102.58000000000001, "Text": " And police hate that."}, {"Time_Start": 105.82000000000001, "Time_End": 114.10000000000001, "Text": " But there is some major obstacles towards developing a uniform theory of what computer crime should be."}, {"Time_Start": 114.38000000000001, "Time_End": 115.64, "Text": " And what are those obstacles?"}, {"Time_Start": 116.18, "Time_End": 119.36000000000001, "Text": " First of all, between, there's a lot of areas of agreement."}, {"Time_Start": 119.76, "Time_End": 125.76, "Text": " which in most of the European nations and in the United States,"}, {"Time_Start": 125.76, "Time_End": 130.76, "Text": " we have a consensus as to what should be illegal."}, {"Time_Start": 130.76, "Time_End": 132.76, "Text": " And some of those areas of obvious agreement,"}, {"Time_Start": 132.76, "Time_End": 135.76, "Text": " where there's not a lot of problem for people to say,"}, {"Time_Start": 135.76, "Time_End": 137.76, "Text": " yes, I agree, that should be illegal,"}, {"Time_Start": 137.76, "Time_End": 140.76, "Text": " are, for example, with child pornography,"}, {"Time_Start": 140.76, "Time_End": 144.76, "Text": " the destruction of data, data theft,"}, {"Time_Start": 144.76, "Time_End": 148.76, "Text": " these are offenses which we can tend to agree"}, {"Time_Start": 148.76, "Time_End": 153.76, "Text": " ought to be made illegal. But there are great areas of disagreement."}, {"Time_Start": 153.76, "Time_End": 157.76, "Text": " One of the major areas of disagreement is substantive."}, {"Time_Start": 157.76, "Time_End": 160.76, "Text": " What is or what should be a crime?"}, {"Time_Start": 160.76, "Time_End": 164.76, "Text": " And countries don't necessarily agree on this, even in some basic ways."}, {"Time_Start": 164.76, "Time_End": 172.76, "Text": " For example, in the United States, unauthorized access, simple trespass to a computer without permission, is a crime."}, {"Time_Start": 172.76, "Time_End": 177.76, "Text": " Other countries may not have a crime, may not have a statute that prohibits that at all."}, {"Time_Start": 177.76, "Time_End": 184.76, "Text": " that at all, or when they do have a statute that prohibits it, they may have some added additional things that go with it."}, {"Time_Start": 184.76, "Time_End": 186.76, "Text": " They don't think that simple trespass as a crime."}, {"Time_Start": 186.76, "Time_End": 192.76, "Text": " For example, in Germany, their unauthorized access computer crime law requires that the person"}, {"Time_Start": 192.76, "Time_End": 198.76, "Text": " have circumvented some kind of security measure in order for that trespass to then be unauthorized."}, {"Time_Start": 198.76, "Time_End": 204.76, "Text": " So if you just happen upon the password file in a web server in the United States,"}, {"Time_Start": 204.76, "Time_End": 206.76, "Text": " you could be convicted of unauthorized access because you accept it."}, {"Time_Start": 206.76, "Time_End": 210.76, "Text": " access because you exceeded your authorization when you went to look at this password file."}, {"Time_Start": 210.76, "Time_End": 214.76, "Text": " In Germany, that wouldn't be the case. The people just left their password file on the web server"}, {"Time_Start": 214.76, "Time_End": 220.76, "Text": " without any kind of security protection or means of authenticating permissible viewers."}, {"Time_Start": 220.76, "Time_End": 224.76, "Text": " So it wouldn't be a crime under that statute."}, {"Time_Start": 224.76, "Time_End": 230.76, "Text": " So even with something as simple as unauthorized access, we can have a great disagreement."}, {"Time_Start": 230.76, "Time_End": 240.76, "Text": " Another problem is the relative competence or incompetence of local law enforcement officials."}, {"Time_Start": 240.76, "Time_End": 247.76, "Text": " Here in the United States, we've had a lot of effort to try to train our FBI agents to be up to snuff"}, {"Time_Start": 247.76, "Time_End": 254.76, "Text": " in the techniques necessary to do a good forensic analysis of computer crime data."}, {"Time_Start": 254.76, "Time_End": 259.76, "Text": " In other countries, they do not have the resources necessarily or"}, {"Time_Start": 259.76, "Time_End": 271.76, "Text": " They don't have the resources necessarily or the information or the expertise"}, {"Time_Start": 271.76, "Time_End": 279.76, "Text": " for them to investigate computer crimes in such a way as to necessarily find the proper perpetrator"}, {"Time_Start": 279.76, "Time_End": 284.76, "Text": " or to do it in a way in which it could be used in a court, for example, in the United States,"}, {"Time_Start": 284.76, "Time_End": 287.76, "Text": " where you're going to have defense attorneys to challenge that evidence."}, {"Time_Start": 289.76, "Time_End": 293.76, "Text": " There may be somebody who commits an offense in another country,"}, {"Time_Start": 293.76, "Time_End": 298.76, "Text": " and the United States is interested in locating and prosecuting that person."}, {"Time_Start": 298.76, "Time_End": 305.76, "Text": " But local law enforcement authorities here may have little or no power to go to another country"}, {"Time_Start": 305.76, "Time_End": 310.76, "Text": " where the perpetrator may be located or where the evidence may be located to investigate."}, {"Time_Start": 310.76, "Time_End": 319.76, "Text": " So there's no agreement on what powers one nation has to interrogate, search, see,"}, {"Time_Start": 319.76, "Time_End": 326.76, "Text": " evidence in another nation and nations differ from country to country as to what"}, {"Time_Start": 326.76, "Time_End": 331.76, "Text": " kind of privacy protections they have for their internet users and thus what kind of"}, {"Time_Start": 331.76, "Time_End": 338.76, "Text": " evidence they can permissibly collect from an ISP with and the question is then can"}, {"Time_Start": 338.76, "Time_End": 340.76, "Text": " they simply seize evidence from the ISP?"}, {"Time_Start": 340.76, "Time_End": 342.76, "Text": " Can they simply do they just have to request it?"}, {"Time_Start": 342.76, "Time_End": 347.76, "Text": " Do they need a court order or perhaps a warrant or do they need nothing?"}, {"Time_Start": 347.76, "Time_End": 349.76, "Text": " Or is there no way for them to do?"}, {"Time_Start": 349.76, "Time_End": 356.76, "Text": " obtain that information? Is it so protected you can't, a law enforcement person can't get it at all?"}, {"Time_Start": 356.76, "Time_End": 365.76, "Text": " There's the territorial problem with the lack of cooperation between a local law enforcement agency"}, {"Time_Start": 365.76, "Time_End": 372.76, "Text": " or a one nation's law enforcement agency and the law enforcement agency of another nation."}, {"Time_Start": 372.76, "Time_End": 378.76, "Text": " We've all seen those movies where the FBI comes in and the local police are mad because they're on their territory."}, {"Time_Start": 378.76, "Time_End": 386.76, "Text": " that sort of internecine rivalry is that many more times worse when we're not even talking about officials in the same country."}, {"Time_Start": 386.76, "Time_End": 396.76, "Text": " And finally, if we do manage to discover who is the perpetrator of an offense and where they are located,"}, {"Time_Start": 396.76, "Time_End": 405.76, "Text": " there are disagreements over whether we have the authority, one nation has the authority, to bring that person to that country for trial,"}, {"Time_Start": 405.76, "Time_End": 408.74, "Text": " and whether the home nation is going to extradite that person."}, {"Time_Start": 408.76, "Time_End": 418.76, "Text": " So all of these elements make at this point in time international computer crime difficult to deal with."}, {"Time_Start": 418.76, "Time_End": 420.76, "Text": " Let's look at some examples."}, {"Time_Start": 424.76, "Time_End": 427.76, "Text": " Who's familiar with the I Love You Virus case?"}, {"Time_Start": 427.76, "Time_End": 431.76, "Text": " Okay, so I won't go into it in too much detail."}, {"Time_Start": 431.76, "Time_End": 436.76, "Text": " A gentleman in the Philippines decided it wasn't fair that no one in the Philippines decided that wasn't fair"}, {"Time_Start": 436.76, "Time_End": 440.76, "Text": " that no one in the Philippines could afford internet access."}, {"Time_Start": 440.76, "Time_End": 444.76, "Text": " He thought a good way for people to get internet access would be to use the accounts of other people"}, {"Time_Start": 444.76, "Time_End": 446.76, "Text": " and to have their passwords."}, {"Time_Start": 446.76, "Time_End": 454.76, "Text": " So he wrote as part of his school paper virus that would go out through the internet"}, {"Time_Start": 454.76, "Time_End": 457.76, "Text": " and it would collect passwords."}, {"Time_Start": 457.76, "Time_End": 460.76, "Text": " This I Love You, Byra, and it was an email that was titled, I Love You,"}, {"Time_Start": 460.76, "Time_End": 463.76, "Text": " and of course everybody always hopes that somebody loves them."}, {"Time_Start": 463.76, "Time_End": 466.74, "Text": " So when you would get an email, when you would get an email from your friend that's"}, {"Time_Start": 466.76, "Time_End": 470.96, "Text": " said I love you, you would click on it, open it up, and what it would do is it would go"}, {"Time_Start": 470.96, "Time_End": 476.76, "Text": " through all your email addresses if you happen to use Microsoft Outlook and send itself"}, {"Time_Start": 476.76, "Time_End": 480.65999999999997, "Text": " to all of those people, a note from you saying that you loved them."}, {"Time_Start": 480.65999999999997, "Time_End": 486.76, "Text": " And there were great complications for corporate networks as they tried to clean this bug out of their"}, {"Time_Start": 486.76, "Time_End": 492.76, "Text": " system, but essentially what it was supposed to do was harvest these passwords and send them home."}, {"Time_Start": 492.76, "Time_End": 496.74, "Text": " Eventually, the United States authorities, with the"}, {"Time_Start": 496.76, "Time_End": 505.76, "Text": " of the Philippines was able to trace this virus back to a small apartment in Manila"}, {"Time_Start": 505.76, "Time_End": 510.76, "Text": " where this gentleman lived with his girlfriend, or with his sister and her boyfriend, I believe."}, {"Time_Start": 510.76, "Time_End": 516.76, "Text": " And eventually, first they thought it was the boyfriend, but when this guy's school told the authorities"}, {"Time_Start": 516.76, "Time_End": 521.76, "Text": " that actually he'd written his graduate thesis paper on exactly this topic, they realized that it was him."}, {"Time_Start": 521.76, "Time_End": 525.76, "Text": " So, you know, corporations here in the United States were claiming millions of dollars."}, {"Time_Start": 525.76, "Time_End": 529.76, "Text": " millions of dollars of loss for all the time and effort that they had had to take"}, {"Time_Start": 529.76, "Time_End": 533.76, "Text": " to clean this virus out of their system because everybody was getting way too many emails."}, {"Time_Start": 533.76, "Time_End": 541.76, "Text": " And they were eager to prosecute this sort of latter-day Robin Hood here in the United States"}, {"Time_Start": 541.76, "Time_End": 544.76, "Text": " or in the Philippines, just so long as something happened to him."}, {"Time_Start": 544.76, "Time_End": 549.76, "Text": " But it turned out that the Philippines does not have, or rather did not have,"}, {"Time_Start": 549.76, "Time_End": 553.76, "Text": " a law against writing and sending viruses."}, {"Time_Start": 553.76, "Time_End": 555.76, "Text": " So there was nothing to prosecute."}, {"Time_Start": 555.76, "Time_End": 561.76, "Text": " him for, and this gentleman was set free, much to the consternation of local authorities here in the United States."}, {"Time_Start": 561.76, "Time_End": 568.76, "Text": " Of course, bad cases always make bad law, and Philippines ran out to quickly pass an anti-virus law,"}, {"Time_Start": 568.76, "Time_End": 570.76, "Text": " which in the long run is a good thing."}, {"Time_Start": 570.76, "Time_End": 576.76, "Text": " But at the time, since there was no law, it couldn't be applied to him prospectively,"}, {"Time_Start": 576.76, "Time_End": 580.76, "Text": " and this gentleman, there's no legal recourse."}, {"Time_Start": 580.76, "Time_End": 583.76, "Text": " There's no legal punishment that can befall him."}, {"Time_Start": 583.76, "Time_End": 587.76, "Text": " And that was extremely aggravating to the United States."}, {"Time_Start": 587.76, "Time_End": 591.76, "Text": " But not as aggravating in some ways as the case involving the Russians."}, {"Time_Start": 591.76, "Time_End": 597.76, "Text": " Because at least in the I Love You Virus case, the Philippines was cooperative."}, {"Time_Start": 597.76, "Time_End": 608.76, "Text": " In the case involving these two Russians, the, let me just add that because it was not a crime in the Philippines"}, {"Time_Start": 608.76, "Time_End": 613.76, "Text": " with the gentleman who wrote the I Love You Virus, he could not then be extradited to the United States."}, {"Time_Start": 613.76, "Time_End": 616.76, "Text": " for trial here, even though it is a crime here in the United States."}, {"Time_Start": 616.76, "Time_End": 618.76, "Text": " So nothing could be done."}, {"Time_Start": 618.76, "Time_End": 625.76, "Text": " With the Russians, these were two Russian guys who had stolen a bunch of credit card information,"}, {"Time_Start": 625.76, "Time_End": 630.76, "Text": " done some other stuff, but basically stolen a bunch of credit card information from companies like PayPal,"}, {"Time_Start": 630.76, "Time_End": 632.76, "Text": " which is an online payment provider."}, {"Time_Start": 632.76, "Time_End": 640.76, "Text": " And the FBI, with some assistance, was eventually able, after a year or so of investigation,"}, {"Time_Start": 640.76, "Time_End": 642.76, "Text": " to trace these thefts back to"}, {"Time_Start": 642.76, "Time_End": 648.76, "Text": " to Russia. They called the Russian authorities and asked them for assistance, and the"}, {"Time_Start": 648.76, "Time_End": 653.76, "Text": " Russians simply did not return their telephone calls. They could not get the Russians to be interested"}, {"Time_Start": 653.76, "Time_End": 657.76, "Text": " in arresting these two guys. Not only couldn't they get them interested in arresting the"}, {"Time_Start": 657.76, "Time_End": 662.16, "Text": " two guys or interrogating the two guys, they couldn't get them to even collect any evidence over there"}, {"Time_Start": 662.16, "Time_End": 666.6, "Text": " from these two guys. Their requests for assistance were totally ignored, and the United States"}, {"Time_Start": 666.6, "Time_End": 672.74, "Text": " has no power to obtain a search warrant for a computer server that's located in Russia."}, {"Time_Start": 672.76, "Time_End": 679.76, "Text": " Without that information, they couldn't charge them here, and of course,"}, {"Time_Start": 679.76, "Time_End": 685.76, "Text": " without the cooperation of the Russian authorities, they couldn't extradite them here to the United States."}, {"Time_Start": 685.76, "Time_End": 689.76, "Text": " So the FBI came up with a great social engineering hack."}, {"Time_Start": 689.76, "Time_End": 692.76, "Text": " They didn't have Russian cooperation."}, {"Time_Start": 692.76, "Time_End": 696.76, "Text": " They didn't have any evidence, and they didn't have great technological expertise."}, {"Time_Start": 696.76, "Time_End": 701.76, "Text": " But what they did do was they set up a fake company in Seattle and they called the"}, {"Time_Start": 701.76, "Time_End": 705.76, "Text": " And they called these Russian guys up, and they said, hey, we've got this computer security company,"}, {"Time_Start": 705.76, "Time_End": 708.76, "Text": " and we think you guys are really good, we might want to hire you."}, {"Time_Start": 708.76, "Time_End": 711.76, "Text": " Why don't you guys fly here to Seattle for an interview?"}, {"Time_Start": 711.76, "Time_End": 712.76, "Text": " So these..."}, {"Time_Start": 712.76, "Time_End": 713.76, "Text": " That's right."}, {"Time_Start": 713.76, "Time_End": 716.76, "Text": " So these two guys, you know, times are tough, the economy's bad."}, {"Time_Start": 716.76, "Time_End": 724.76, "Text": " So these two guys flew from Russia to the Seattle to go to this company, Invita, it was appropriately called."}, {"Time_Start": 724.76, "Time_End": 728.76, "Text": " And while they were there, they went through the sort of interviewing process,"}, {"Time_Start": 728.76, "Time_End": 731.76, "Text": " and the FBI agents posing"}, {"Time_Start": 731.76, "Time_End": 737.56, "Text": " as human resources personnel, said, well, you know, show us what you can do, hack into our network."}, {"Time_Start": 737.56, "Time_End": 744.76, "Text": " So the Russian guys sat down at the company computers and logged into their server in Russia"}, {"Time_Start": 744.76, "Time_End": 747.76, "Text": " to get their hacking tools that they had stored there."}, {"Time_Start": 747.76, "Time_End": 754.76, "Text": " Unbeknownst to them, the FBI had a sniffer running on that system and captured their username and password."}, {"Time_Start": 754.76, "Time_End": 759.76, "Text": " After they entered that information into the computer, the Russians were arrested,"}, {"Time_Start": 759.76, "Time_End": 761.76, "Text": " and with that username and password, they were arrested."}, {"Time_Start": 761.76, "Time_End": 768.76, "Text": " The FBI logged onto the server in Russia, collected that information, brought it over here to the United States,"}, {"Time_Start": 768.76, "Time_End": 780.76, "Text": " zipped it up, then went and got a search warrant to open the file that they had downloaded from Russia after having obtained it."}, {"Time_Start": 780.76, "Time_End": 790.76, "Text": " The defense attorney in that case did challenge that on Fourth Amendment grounds, and the judge denied his motion, but I'm sure that it will be appealed."}, {"Time_Start": 791.76, "Time_End": 798.76, "Text": " So with cases like that, there's been an immense interest on the part of international law enforcement"}, {"Time_Start": 798.76, "Time_End": 804.76, "Text": " to try to come to some kind of terms of cooperation, some terms of agreement,"}, {"Time_Start": 804.76, "Time_End": 807.76, "Text": " so that we don't have these problems that arise in the future."}, {"Time_Start": 807.76, "Time_End": 816.76, "Text": " The Council of Europe's Cybercrime Treaty is the most developed and the most advanced of these efforts."}, {"Time_Start": 816.76, "Time_End": 821.76, "Text": " Something of a gleam in the eye of the Hoover Institution only four years ago is the"}, {"Time_Start": 821.76, "Time_End": 825.56, "Text": " It's now rapidly on its way towards ratification."}, {"Time_Start": 825.56, "Time_End": 838.26, "Text": " And we're going to talk in detail about the provisions of that treaty, but I just want to mention that there has been a lot of international cooperation in many fields other than crime lately."}, {"Time_Start": 838.26, "Time_End": 850.76, "Text": " The G8, which is the eight industrialized nations, has also been very concerned with cybercrime and has developed a list of principles which have been incorporated into the Council of Europe Treaty."}, {"Time_Start": 850.76, "Time_End": 859.76, "Text": " We've also seen international treaties on copyright law and a new one that we're in the process of debating,"}, {"Time_Start": 859.76, "Time_End": 863.76, "Text": " which is the Hague Treaty, which is about the enforcement of foreign judgments."}, {"Time_Start": 863.76, "Time_End": 871.76, "Text": " Now, you may remember, as I said, globalization is the future, internationalism is the trend."}, {"Time_Start": 871.76, "Time_End": 879.76, "Text": " And we are looking at a vast effort to homogenize the law across nations, most often in the way that the United States thinks the law ought to be."}, {"Time_Start": 879.76, "Time_End": 881.76, "Text": " thinks the law ought to be."}, {"Time_Start": 881.76, "Time_End": 891.76, "Text": " With conventions or treaties like the Byrne Convention or the WIPO Treaty, we're looking at exporting the United States view of what copyright law is to other nations."}, {"Time_Start": 891.76, "Time_End": 898.76, "Text": " And if you'll remember, it is the WIPO treaty that brought us the Digital Millennium Copyright Act."}, {"Time_Start": 898.76, "Time_End": 902.76, "Text": " And I know that that was discussed here at this conference earlier, so I won't belaborate."}, {"Time_Start": 902.76, "Time_End": 909.74, "Text": " But, you know, I think we're familiar with the problems that the DMCA poses for people doing research, for reverse engineering, for"}, {"Time_Start": 909.76, "Time_End": 914.76, "Text": " encryption research and other important and valuable efforts of that nature."}, {"Time_Start": 914.76, "Time_End": 920.76, "Text": " You know, basically, Mickey Mouse is getting his way and the rest of us are going to have to follow in step."}, {"Time_Start": 920.76, "Time_End": 923.76, "Text": " The Hague Treaty is even more dangerous in many ways."}, {"Time_Start": 923.76, "Time_End": 927.76, "Text": " The Hague Treaty is a treaty that's designed to enforce foreign judgments."}, {"Time_Start": 927.76, "Time_End": 933.76, "Text": " Now, most treaties and the Council of Europe's Cybercrime Treaty, I include in this,"}, {"Time_Start": 933.76, "Time_End": 939.74, "Text": " want the signatories, the countries that join the treaty, to change or amend their laws to be"}, {"Time_Start": 939.76, "Time_End": 942.76, "Text": " in accordance with what the treaty says."}, {"Time_Start": 942.76, "Time_End": 948.76, "Text": " The Hague Treaty is a little bit different in that what it says is whatever your law may be,"}, {"Time_Start": 948.76, "Time_End": 953.76, "Text": " we're going to respect that here in the other countries that are members of the treaty."}, {"Time_Start": 953.76, "Time_End": 959.76, "Text": " So instead of saying here's what our basic standards are going to be for the law,"}, {"Time_Start": 959.76, "Time_End": 966.76, "Text": " the Hague Treaty says, hey, if you break the law in this country or that country and there's a judgment against you,"}, {"Time_Start": 966.76, "Time_End": 968.76, "Text": " we're going to let that judgment be enforced here in the United States."}, {"Time_Start": 968.76, "Time_End": 970.26, "Text": " here in the United States."}, {"Time_Start": 970.26, "Time_End": 974.76, "Text": " So if you get sued for defamation or liable or something like that in the United Kingdom,"}, {"Time_Start": 974.76, "Time_End": 977.76, "Text": " which does not have the same free speech protections we have here,"}, {"Time_Start": 977.76, "Time_End": 979.76, "Text": " and there's a judgment against you, here in the United States,"}, {"Time_Start": 979.76, "Time_End": 982.76, "Text": " we're going to allow that judgment to be enforced."}, {"Time_Start": 982.76, "Time_End": 984.76, "Text": " So this is not about the Hague Treaty."}, {"Time_Start": 984.76, "Time_End": 986.76, "Text": " Perhaps it should be, and we can talk more about that later,"}, {"Time_Start": 986.76, "Time_End": 990.76, "Text": " but the Hague Treaty raises a lot of problems."}, {"Time_Start": 990.76, "Time_End": 994.76, "Text": " And those problems, basically the problems of difference is in values,"}, {"Time_Start": 994.76, "Time_End": 998.76, "Text": " differences in procedure, differences in protections for privacy,"}, {"Time_Start": 998.76, "Time_End": 1002.76, "Text": " free speech and important rights of that nature are,"}, {"Time_Start": 1002.76, "Time_End": 1005.76, "Text": " those are problems we're going to see here with cybercrime and also"}, {"Time_Start": 1005.76, "Time_End": 1008.76, "Text": " that are very much issues with the Hague Treaty."}, {"Time_Start": 1008.76, "Time_End": 1010.76, "Text": " I have a question there?"}, {"Time_Start": 1014.76, "Time_End": 1019.76, "Text": " The question was whether the Hague Treaty prevents our government"}, {"Time_Start": 1019.76, "Time_End": 1021.76, "Text": " from prosecuting us for foreign laws."}, {"Time_Start": 1021.76, "Time_End": 1024.76, "Text": " And while the Hague Treaty does not prevent that,"}, {"Time_Start": 1024.76, "Time_End": 1027.76, "Text": " here in the United States, you can be prosecuted under United States."}, {"Time_Start": 1027.76, "Time_End": 1029.26, "Text": " under United States laws."}, {"Time_Start": 1029.26, "Time_End": 1031.76, "Text": " Our government has to enforce our laws."}, {"Time_Start": 1031.76, "Time_End": 1036.76, "Text": " So the Hague Treaty will not give our government new power to prosecute for other laws,"}, {"Time_Start": 1036.76, "Time_End": 1040.76, "Text": " but what it will do is it will say that our government has to enforce"}, {"Time_Start": 1040.76, "Time_End": 1044.76, "Text": " judgments in other countries under their laws."}, {"Time_Start": 1044.76, "Time_End": 1050.76, "Text": " So as I said, if you were, if you were sued in the United Kingdom"}, {"Time_Start": 1050.76, "Time_End": 1052.76, "Text": " for insulting McDonald's,"}, {"Time_Start": 1052.76, "Time_End": 1056.76, "Text": " and McDonald's won a judgment against you there,"}, {"Time_Start": 1056.76, "Time_End": 1061.76, "Text": " there, then the United States government would be a party"}, {"Time_Start": 1061.76, "Time_End": 1066.76, "Text": " or an accomplice to enforcing that judgment against you here,"}, {"Time_Start": 1066.76, "Time_End": 1069.76, "Text": " even though under United States law your comments about McDonald's"}, {"Time_Start": 1069.76, "Time_End": 1072.76, "Text": " would have been protected under the First Amendment"}, {"Time_Start": 1072.76, "Time_End": 1075.76, "Text": " and not something for which you could have been sued civilly."}, {"Time_Start": 1075.76, "Time_End": 1076.76, "Text": " Okay?"}, {"Time_Start": 1076.76, "Time_End": 1078.76, "Text": " The gentleman with the white hat?"}, {"Time_Start": 1078.76, "Time_End": 1082.76, "Text": " The"}, {"Time_Start": 1082.76, "Time_End": 1084.76, "Text": " The"}, {"Time_Start": 1084.76, "Time_End": 1086.76, "Text": " The..."}, {"Time_Start": 1086.76, "Time_End": 1090.76, "Text": " He's asking who it applies to, and that's a good question,"}, {"Time_Start": 1090.76, "Time_End": 1095.76, "Text": " because obviously, if it applies, we certainly don't want judgments from some countries"}, {"Time_Start": 1095.76, "Time_End": 1099.76, "Text": " whose laws are extremely different from ours to be enforced here."}, {"Time_Start": 1099.76, "Time_End": 1104.76, "Text": " For example, if you were violated the ankle-showing law in Afghanistan,"}, {"Time_Start": 1104.76, "Time_End": 1106.76, "Text": " and now I'm going to get caned,"}, {"Time_Start": 1106.76, "Time_End": 1109.76, "Text": " we certainly wouldn't want that judgment to be enforced against me here in the United States"}, {"Time_Start": 1109.76, "Time_End": 1111.76, "Text": " to be something of a spectacle."}, {"Time_Start": 1111.76, "Time_End": 1113.76, "Text": " But it's for nations that signed the Hague Treaty."}, {"Time_Start": 1113.76, "Time_End": 1116.76, "Text": " the Hague Treaty or any of these treaties."}, {"Time_Start": 1116.76, "Time_End": 1119.76, "Text": " And right now, as with the Cybercrime Treaty,"}, {"Time_Start": 1119.76, "Time_End": 1123.76, "Text": " we're basically looking at the Western Europe nations."}, {"Time_Start": 1123.76, "Time_End": 1126.76, "Text": " With Cybercrime Treaty, it's the Western European Nations,"}, {"Time_Start": 1126.76, "Time_End": 1130.76, "Text": " plus the, I forget what they call them right now,"}, {"Time_Start": 1130.76, "Time_End": 1132.76, "Text": " but sort of the friendly observer nations,"}, {"Time_Start": 1132.76, "Time_End": 1136.76, "Text": " the United States, Canada, Japan,"}, {"Time_Start": 1136.76, "Time_End": 1138.76, "Text": " and maybe one other that we're looking at as inviting"}, {"Time_Start": 1138.76, "Time_End": 1140.76, "Text": " to be members of this treaty."}, {"Time_Start": 1140.76, "Time_End": 1142.76, "Text": " Yes, you."}, {"Time_Start": 1142.76, "Time_End": 1145.76, "Text": " Yes, you."}, {"Time_Start": 1145.76, "Time_End": 1162.76, "Text": " So if I put something to reduce through that the jurisdiction question,"}, {"Time_Start": 1162.76, "Time_End": 1164.76, "Text": " and the answer to that,"}, {"Time_Start": 1164.76, "Time_End": 1167.76, "Text": " if you do something from United States soil,"}, {"Time_Start": 1167.76, "Time_End": 1169.76, "Text": " you are subject to United States law,"}, {"Time_Start": 1169.76, "Time_End": 1171.76, "Text": " even if it affects someone outside the country."}, {"Time_Start": 1171.76, "Time_End": 1175.76, "Text": " the country. If you do something from outside the country"}, {"Time_Start": 1175.76, "Time_End": 1178.76, "Text": " that affects someone on United States soil, then again,"}, {"Time_Start": 1178.76, "Time_End": 1180.76, "Text": " you're probably subject to United States law."}, {"Time_Start": 1180.76, "Time_End": 1184.76, "Text": " Now whether you can get here or not, whether they'll get you here or not"}, {"Time_Start": 1184.76, "Time_End": 1187.76, "Text": " as part of that whole extradition treaty question."}, {"Time_Start": 1187.76, "Time_End": 1191.76, "Text": " But, so the answer is,"}, {"Time_Start": 1191.76, "Time_End": 1195.76, "Text": " so the answer is, well, I'm not a specialist in British law."}, {"Time_Start": 1195.76, "Time_End": 1196.76, "Text": " I think the answer is the same."}, {"Time_Start": 1196.76, "Time_End": 1201.76, "Text": " If the server is in the United Kingdom and people can read it in a use of"}, {"Time_Start": 1201.76, "Time_End": 1204.76, "Text": " group there, even though you're located here,"}, {"Time_Start": 1204.76, "Time_End": 1207.76, "Text": " theoretically you could be subject to United Kingdom law."}, {"Time_Start": 1207.76, "Time_End": 1210.76, "Text": " However, this is part of the whole problem"}, {"Time_Start": 1210.76, "Time_End": 1213.76, "Text": " or part of the whole good thing about the Internet,"}, {"Time_Start": 1213.76, "Time_End": 1215.76, "Text": " which is that what are they going to do?"}, {"Time_Start": 1215.76, "Time_End": 1218.76, "Text": " I mean, who's going to prosecute you for something you've done over there?"}, {"Time_Start": 1218.76, "Time_End": 1220.76, "Text": " But also, how can they stop you?"}, {"Time_Start": 1220.76, "Time_End": 1225.76, "Text": " For example, when Yahoo had people selling Nazi memorabilia"}, {"Time_Start": 1225.76, "Time_End": 1228.76, "Text": " across their network, they're subject to laws in Germany"}, {"Time_Start": 1228.76, "Time_End": 1230.76, "Text": " and France and, you know, other nations that perhaps"}, {"Time_Start": 1230.76, "Time_End": 1233.76, "Text": " other nations that prohibit the selling of that kind of material."}, {"Time_Start": 1233.76, "Time_End": 1235.76, "Text": " But, so what are they going to do?"}, {"Time_Start": 1235.76, "Time_End": 1238.76, "Text": " They take that stuff off of Yahoo.fr,"}, {"Time_Start": 1238.76, "Time_End": 1241.76, "Text": " but you can still get that on Yahoo.com,"}, {"Time_Start": 1241.76, "Time_End": 1244.76, "Text": " and a person in France can easily access Yahoo.com."}, {"Time_Start": 1244.76, "Time_End": 1247.76, "Text": " So that is one of the issues with the Internet."}, {"Time_Start": 1247.76, "Time_End": 1249.76, "Text": " You know, are we going to have a basic dumbing down"}, {"Time_Start": 1249.76, "Time_End": 1253.76, "Text": " where all we see on the Internet is what's palatable"}, {"Time_Start": 1253.76, "Time_End": 1256.76, "Text": " to every nation, the lowest common denominator,"}, {"Time_Start": 1256.76, "Time_End": 1259.76, "Text": " or are we going to see a higher level of discourse on the Internet?"}, {"Time_Start": 1259.76, "Time_End": 1264.76, "Text": " of discourse on the Internet where, you know, what's appropriate, you know,"}, {"Time_Start": 1264.76, "Time_End": 1267.76, "Text": " where we don't have that kind, those kinds of restrictions."}, {"Time_Start": 1267.76, "Time_End": 1268.76, "Text": " Yes?"}, {"Time_Start": 1268.76, "Time_End": 1270.76, "Text": " So my question is, if you know,"}, {"Time_Start": 1270.76, "Time_End": 1272.76, "Text": " like suppose I was in New York State,"}, {"Time_Start": 1272.76, "Time_End": 1277.76, "Text": " where I had an account in Germany or Zaire or something like that,"}, {"Time_Start": 1277.76, "Time_End": 1280.76, "Text": " like that, like, I made, you know, I did something to follow"}, {"Time_Start": 1280.76, "Time_End": 1283.76, "Text": " and what I was going to say to make."}, {"Time_Start": 1283.76, "Time_End": 1289.76, "Text": " Is it that the fact of you that in the United States or, you know,"}, {"Time_Start": 1289.76, "Time_End": 1295.76, "Text": " Okay, so this is a question about where the account is located."}, {"Time_Start": 1295.76, "Time_End": 1297.76, "Text": " And what I'm going to say is this."}, {"Time_Start": 1297.76, "Time_End": 1301.76, "Text": " There are innumerable what ifs in this area of the law."}, {"Time_Start": 1301.76, "Time_End": 1304.76, "Text": " And the law is not certain about any of these things."}, {"Time_Start": 1304.76, "Time_End": 1307.76, "Text": " What I just said about jurisdiction is the general principle."}, {"Time_Start": 1307.76, "Time_End": 1310.76, "Text": " But some of these questions, you know, I'm not, we can't really answer"}, {"Time_Start": 1310.76, "Time_End": 1313.76, "Text": " because we don't know these things haven't happened."}, {"Time_Start": 1313.76, "Time_End": 1314.76, "Text": " There's no agreement on it."}, {"Time_Start": 1314.76, "Time_End": 1317.76, "Text": " And what I really want to, I will take your question and then yours."}, {"Time_Start": 1317.76, "Time_End": 1319.76, "Text": " But then I want to move on so that I can talk about"}, {"Time_Start": 1319.76, "Time_End": 1328.76, "Text": " about what the Council of Europe is trying to do to address these problems, because the way the law is right now is not necessarily the way the law is going to be in the future."}, {"Time_Start": 1328.76, "Time_End": 1335.76, "Text": " And I'm happy to take tons of what ifs after, but right now I sort of want to begin to move on through exactly what the law is."}, {"Time_Start": 1335.76, "Time_End": 1346.76, "Text": " I mean, the jurisdictional problem is huge, and that's why countries want to enter into these multilateral treaties to try to resolve exactly the kind of problems that this person just raised."}, {"Time_Start": 1346.76, "Time_End": 1347.76, "Text": " Yes."}, {"Time_Start": 1349.76, "Time_End": 1356.76, "Text": " it's a question whether there's like any country that has separate laws for foreigners and for their own nationals?"}, {"Time_Start": 1356.76, "Time_End": 1363.76, "Text": " And it's a question whether there's any country that has separate laws for foreigners and for their own nationals, and I don't know the answer to that."}, {"Time_Start": 1363.76, "Time_End": 1379.6, "Text": " But I believe I heard you to say that if a company makes a judgment against me, great, or against the gun, whatever, and then they can enforce that justice via the treaty against the treaty against the United States and forth a lot of that judgment that judgment that we're effectively allowing"}, {"Time_Start": 1379.76, "Time_End": 1386.76, "Text": " The question is the Hague treaty, as I write a free speech, and right against seizure,"}, {"Time_Start": 1386.76, "Time_End": 1404.76, "Text": " and the right through their trial, etc., etc., and the question was, isn't the Hague Treaty, as I described it, something that allows international law to override our domestic protections for free speech and rights of that nature?"}, {"Time_Start": 1404.76, "Time_End": 1409.74, "Text": " And the answer to that is yes, and that's one of the reasons why people are so concerned about the Hague treaty."}, {"Time_Start": 1409.76, "Time_End": 1439.74, "Text": " Well, the treaty is not, the Hague Treaty is in its early stages, and one of the reasons why I mentioned is because you'll see as we go through the provisions of the Cybercrime Treaty that there have been a lot of lobbying efforts on, there has been a lot of lobbying efforts on the part of computer security professionals, encryption researchers, and people of that nature to try to change the European Cybercrime Treaty and make it more palatable. And the same thing needs to be done to be the Hague Treaty. The Hague Treaty, the Hague Treaty. The Hague Treaty,"}, {"Time_Start": 1439.76, "Time_End": 1443.76, "Text": " It either needs to be amended from where it stands now or it needs to be killed."}, {"Time_Start": 1443.76, "Time_End": 1447.76, "Text": " Richard Stallman wrote a great rant about why the Hague Treaty is bad."}, {"Time_Start": 1447.76, "Time_End": 1459.76, "Text": " And I recommend that people take a look at that and think about, you know, what we can do in order to either ameliorate the downsides of these international laws or kill them altogether."}, {"Time_Start": 1459.76, "Time_End": 1466.76, "Text": " Let's take a look at how that happened in the process of negotiating and arguing about the European Cybercrime Treaty."}, {"Time_Start": 1469.76, "Time_End": 1473.76, "Text": " The treaty is currently in its final draft form."}, {"Time_Start": 1473.76, "Time_End": 1479.76, "Text": " You can look at what the treaty says at that URL that I have up there."}, {"Time_Start": 1479.76, "Time_End": 1485.76, "Text": " And the treaty is, as I said earlier, one of these types of documents that requires the member nations,"}, {"Time_Start": 1485.76, "Time_End": 1498.76, "Text": " the signatories, to amend their or to pass local laws that will make them in concurrence or in agreement with all the other signatory nations."}, {"Time_Start": 1498.76, "Time_End": 1499.74, "Text": " They have to pass new laws."}, {"Time_Start": 1499.76, "Time_End": 1503.56, "Text": " laws that will agree with the provisions of the treaty."}, {"Time_Start": 1503.56, "Time_End": 1513.36, "Text": " And the treaty has three basic areas in which agreement is, in which we agree to agree."}, {"Time_Start": 1513.36, "Time_End": 1516.86, "Text": " One is the substance, we need to have a substantive consensus."}, {"Time_Start": 1516.86, "Time_End": 1519.14, "Text": " We agree on what is a crime."}, {"Time_Start": 1519.14, "Time_End": 1525.08, "Text": " We amend our laws to make sure that everything that's in the treaty that they say should be a crime"}, {"Time_Start": 1525.08, "Time_End": 1526.8, "Text": " is a crime in the United States."}, {"Time_Start": 1526.8, "Time_End": 1529.74, "Text": " And not just in the United States, but in all the member nations of the"}, {"Time_Start": 1529.76, "Time_End": 1531.76, "Text": " Council of Europe."}, {"Time_Start": 1531.76, "Time_End": 1539.76, "Text": " Second is a procedural consensus that we agree that there are processes, whatever those processes may be,"}, {"Time_Start": 1539.76, "Time_End": 1548.76, "Text": " for the retention of data and the collection of evidence and then the disclosure of that information to local law enforcement."}, {"Time_Start": 1548.76, "Time_End": 1552.76, "Text": " And finally, the third thing is the international cooperation aspect."}, {"Time_Start": 1552.76, "Time_End": 1558.76, "Text": " If local law enforcement can collect the evidence, then local law enforcement can turn it over to the law enforcement"}, {"Time_Start": 1558.76, "Time_End": 1565.76, "Text": " enforcement agents of other nations where, for example, the crime may have had its worst effect."}, {"Time_Start": 1565.76, "Time_End": 1575.76, "Text": " You want to see the site?"}, {"Time_Start": 1575.76, "Time_End": 1579.76, "Text": " You want to see the site?"}, {"Time_Start": 1579.76, "Time_End": 1585.76, "Text": " Oh, I'm not sure if it's on Lexus, actually, so I don't really know."}, {"Time_Start": 1585.76, "Time_End": 1587.76, "Text": " Where that would be?"}, {"Time_Start": 1587.76, "Time_End": 1591.76, "Text": " I don't know where it would be on Lexus."}, {"Time_Start": 1591.76, "Time_End": 1593.76, "Text": " I know that's where it is on the web."}, {"Time_Start": 1593.76, "Time_End": 1594.76, "Text": " Sorry."}, {"Time_Start": 1594.76, "Time_End": 1599.76, "Text": " Okay, so here we have a little picture of our hero from the I Love You Virus case."}, {"Time_Start": 1599.76, "Time_End": 1603.76, "Text": " And he's representing everything that we're going to now agree is going to be illegal."}, {"Time_Start": 1603.76, "Time_End": 1605.76, "Text": " First, illegal access."}, {"Time_Start": 1605.76, "Time_End": 1607.76, "Text": " Illegal access meaning access without right."}, {"Time_Start": 1607.76, "Time_End": 1613.76, "Text": " Initially, this law required every signatory nation to make illegal access,"}, {"Time_Start": 1613.76, "Time_End": 1617.76, "Text": " simple trespass, or exceeding"}, {"Time_Start": 1617.76, "Time_End": 1621.76, "Text": " authorized access illegal, just as it is here in the United States."}, {"Time_Start": 1621.76, "Time_End": 1627.76, "Text": " With lobbying from other nations, the illegal access provision now allows"}, {"Time_Start": 1627.76, "Time_End": 1632.76, "Text": " variations on that theme as per the law that already exists in Germany."}, {"Time_Start": 1632.76, "Time_End": 1636.76, "Text": " They now allow you to require either that there be some kind of damage first"}, {"Time_Start": 1636.76, "Time_End": 1639.76, "Text": " or that some security measure have been circumvented or something like that."}, {"Time_Start": 1639.76, "Time_End": 1642.76, "Text": " That was the result of lobbying."}, {"Time_Start": 1642.76, "Time_End": 1646.76, "Text": " We have illegal interception of data, wiretap, or sniffing."}, {"Time_Start": 1646.76, "Time_End": 1651.76, "Text": " data interference, stealing data, erasing data,"}, {"Time_Start": 1651.76, "Time_End": 1654.76, "Text": " altering data, that sort of thing."}, {"Time_Start": 1654.76, "Time_End": 1657.76, "Text": " System interference, denial of service."}, {"Time_Start": 1657.76, "Time_End": 1659.76, "Text": " Misuse of devices."}, {"Time_Start": 1659.76, "Time_End": 1662.76, "Text": " This is very controversial and was formally a provision"}, {"Time_Start": 1662.76, "Time_End": 1666.76, "Text": " called illegal devices, which controls"}, {"Time_Start": 1666.76, "Time_End": 1671.76, "Text": " the development, possession, and use of hacker tools,"}, {"Time_Start": 1671.76, "Time_End": 1675.76, "Text": " like scanners, exploits, password crackers,"}, {"Time_Start": 1675.76, "Time_End": 1681.76, "Text": " anything that is primarily designed to do the first four,"}, {"Time_Start": 1681.76, "Time_End": 1686.76, "Text": " illegal access, interception, data interference, or system interference."}, {"Time_Start": 1686.76, "Time_End": 1690.76, "Text": " Computer-related forgery."}, {"Time_Start": 1690.76, "Time_End": 1693.76, "Text": " Computer-related fraud."}, {"Time_Start": 1693.76, "Time_End": 1695.76, "Text": " Child pornography."}, {"Time_Start": 1695.76, "Time_End": 1700.76, "Text": " And those are basically things that we traditionally think of as criminal offenses."}, {"Time_Start": 1700.76, "Time_End": 1702.76, "Text": " Kim?"}, {"Time_Start": 1702.76, "Time_End": 1704.76, "Text": " Oh, wait."}, {"Time_Start": 1704.76, "Time_End": 1706.76, "Text": " Hold on just a second."}, {"Time_Start": 1706.76, "Time_End": 1707.76, "Text": " Kim."}, {"Time_Start": 1707.76, "Time_End": 1712.76, "Text": " The question was about the misuse of devices provision,"}, {"Time_Start": 1712.76, "Time_End": 1715.76, "Text": " and we're going to talk about that kind of in detail later,"}, {"Time_Start": 1715.76, "Time_End": 1718.76, "Text": " and then if I don't answer your question, please do ask it again."}, {"Time_Start": 1718.76, "Time_End": 1720.76, "Text": " Who was the other person who wanted to?"}, {"Time_Start": 1720.76, "Time_End": 1722.76, "Text": " Oh, okay."}, {"Time_Start": 1722.76, "Time_End": 1726.76, "Text": " So now we get into a new kind of crime, maybe not here in the United States,"}, {"Time_Start": 1726.76, "Time_End": 1729.76, "Text": " but for most of these places, copyright."}, {"Time_Start": 1729.76, "Time_End": 1733.76, "Text": " This treaty would require the signatory nations to criminalize copyright."}, {"Time_Start": 1733.76, "Time_End": 1738.76, "Text": " criminalized copyright. In the United States, up until not that long ago,"}, {"Time_Start": 1738.76, "Time_End": 1743.76, "Text": " copyright offenses were generally treated as a civil matter. Now they're treated as a criminal matter."}, {"Time_Start": 1743.76, "Time_End": 1749.76, "Text": " And what this treaty would do is it would require other nations to also create copyright laws"}, {"Time_Start": 1749.76, "Time_End": 1754.76, "Text": " that are punished criminally. Now, I know that most of you probably know this, but the difference"}, {"Time_Start": 1754.76, "Time_End": 1758.76, "Text": " between a civil case and a criminal case is a civil case is where somebody sues you for money."}, {"Time_Start": 1758.76, "Time_End": 1762.76, "Text": " A criminal case is where the government pursues you to take away your liberty and you go to jail."}, {"Time_Start": 1762.76, "Time_End": 1770.76, "Text": " And the treaty specifically states that member nations must pass laws that make you go to jail for copyright infringement."}, {"Time_Start": 1770.76, "Time_End": 1783.76, "Text": " There's also provisions for aiding and abetting, corporate liability, and as I said, these all are laws that the signatory nations not only must pass,"}, {"Time_Start": 1783.76, "Time_End": 1787.76, "Text": " but also must punish with a potential sentence of imprisonment."}, {"Time_Start": 1787.76, "Time_End": 1791.76, "Text": " The gentleman in the back who changed his mind and wants to ask his question again."}, {"Time_Start": 1791.76, "Time_End": 1798.76, "Text": " The copyright infringement is that implied only to the age of the music."}, {"Time_Start": 1798.76, "Time_End": 1818.56, "Text": " The question is, does this imply only to copyright infringement like a copying of"}, {"Time_Start": 1818.56, "Time_End": 1820.56, "Text": " songs on Napster or something of that nature?"}, {"Time_Start": 1820.56, "Time_End": 1827.56, "Text": " Does it also apply to purchasing or even producing counterfeit items like fake Levi jeans or something of that nature?"}, {"Time_Start": 1827.56, "Time_End": 1833.56, "Text": " And basically, the answer is it would apply to all those kinds of things if they happened in the signatory nations."}, {"Time_Start": 1833.56, "Time_End": 1844.56, "Text": " Anything that is a copyright infringement under the Byrne Convention or the WIPO Treaty or any of a number of other international copyright treaties."}, {"Time_Start": 1850.56, "Time_End": 1859.56, "Text": " The question is, what is illegal access mean? And I ask myself that pretty much every day."}, {"Time_Start": 1859.56, "Time_End": 1869.56, "Text": " Under the, I'm not kidding. Pretty much, at this point in time, each country certainly has its own hacker laws."}, {"Time_Start": 1869.56, "Time_End": 1879.56, "Text": " And whether those laws prohibit illegal access or don't prohibit illegal access require you to have circumvented some security measure or not, they're all over the map."}, {"Time_Start": 1879.56, "Time_End": 1884.02, "Text": " The idea behind this treaty is to make everybody agree within reason."}, {"Time_Start": 1884.02, "Time_End": 1888.94, "Text": " They have had to make some concessions because of lobbying and because of differences between countries."}, {"Time_Start": 1888.94, "Time_End": 1894.56, "Text": " But the basic idea is to get everybody in the Council of Europe, plus some other big nations, like the United States,"}, {"Time_Start": 1894.56, "Time_End": 1900.56, "Text": " to all agree on the same definition, essentially the same definitions of crimes."}, {"Time_Start": 1900.56, "Time_End": 1901.56, "Text": " Yeah?"}, {"Time_Start": 1909.56, "Time_End": 1911.56, "Text": " I can't really hear your question."}, {"Time_Start": 1911.56, "Time_End": 1912.56, "Text": " I'm sorry."}, {"Time_Start": 1912.56, "Time_End": 1922.56, "Text": " The question is, what if United States intelligence"}, {"Time_Start": 1922.56, "Time_End": 1925.56, "Text": " intelligence organizations attack something in one of the treaty countries?"}, {"Time_Start": 1925.56, "Time_End": 1927.56, "Text": " Does that then become illegal?"}, {"Time_Start": 1927.56, "Time_End": 1930.56, "Text": " I asked myself that question when thinking about the Russians case."}, {"Time_Start": 1930.56, "Time_End": 1933.56, "Text": " I mean, here we have the FBI agents."}, {"Time_Start": 1933.56, "Time_End": 1934.56, "Text": " They sniffed the network."}, {"Time_Start": 1934.56, "Time_End": 1935.56, "Text": " Okay, it was their own network."}, {"Time_Start": 1935.56, "Time_End": 1937.56, "Text": " Maybe that's okay, maybe it's not."}, {"Time_Start": 1937.56, "Time_End": 1938.56, "Text": " But then they used a password, which they knew was not their own."}, {"Time_Start": 1938.56, "Time_End": 1942.56, "Text": " they knew it was not their own, to gain unauthorized access to a server located in Russia"}, {"Time_Start": 1942.56, "Time_End": 1945.56, "Text": " and to take data from that server."}, {"Time_Start": 1945.56, "Time_End": 1949.56, "Text": " And I thought to myself, that sounds pretty much like a violation of United States law."}, {"Time_Start": 1949.56, "Time_End": 1955.56, "Text": " In the United States law, there's a provision that says that law enforcement agents can do stuff like that"}, {"Time_Start": 1955.56, "Time_End": 1957.56, "Text": " if they have legal authority."}, {"Time_Start": 1957.56, "Time_End": 1959.56, "Text": " Of course, they didn't have a warrant or anything,"}, {"Time_Start": 1959.56, "Time_End": 1964.56, "Text": " and we don't really know what the legal authority necessarily would look like there."}, {"Time_Start": 1964.56, "Time_End": 1968.54, "Text": " But, you know, it sounds to me like,"}, {"Time_Start": 1968.56, "Time_End": 1973.56, "Text": " It's arguably an 18 U.S.C. 1030 violation."}, {"Time_Start": 1973.56, "Time_End": 1977.56, "Text": " Of course, we don't see the Department of Justice going after these FBI agents to prosecute them."}, {"Time_Start": 1977.56, "Time_End": 1983.56, "Text": " So my answer to you is that there will still be some variations between the laws of the member nations."}, {"Time_Start": 1983.56, "Time_End": 1989.56, "Text": " And we still have possibly provisions that say there's an exception for law enforcement or something of that nature."}, {"Time_Start": 1989.56, "Time_End": 1992.56, "Text": " And that even though that's exception for law enforcement may or may not apply,"}, {"Time_Start": 1992.56, "Time_End": 1997.56, "Text": " because it doesn't seem like they got legal authority, law enforcement may still go ahead and do stuff like that."}, {"Time_Start": 1997.56, "Time_End": 1998.56, "Text": " And the answer is that."}, {"Time_Start": 1998.56, "Time_End": 2001.56, "Text": " is we don't know the answer because that's the beauty of the Internet."}, {"Time_Start": 2001.56, "Time_End": 2004.56, "Text": " It's still too young for us to really have everything nailed down."}, {"Time_Start": 2004.56, "Time_End": 2007.56, "Text": " So it's a good question and a complicated answer."}, {"Time_Start": 2007.56, "Time_End": 2010.56, "Text": " I'll take that gentleman in the back."}, {"Time_Start": 2010.56, "Time_End": 2013.56, "Text": " Uh-huh."}, {"Time_Start": 2013.56, "Time_End": 2018.56, "Text": " There's already been some discussions not in the public medium about whether there's"}, {"Time_Start": 2018.56, "Time_End": 2019.56, "Text": " some of some actions."}, {"Time_Start": 2019.56, "Time_End": 2025.56, "Text": " It's done different in the same time that would actually come in the"}, {"Time_Start": 2025.56, "Time_End": 2026.56, "Text": " case."}, {"Time_Start": 2026.56, "Time_End": 2038.56, "Text": " Okay. Did everybody hear that? Okay. Yes. I mean, it's a..."}, {"Time_Start": 2038.56, "Time_End": 2041.56, "Text": " Oh, now it's all broken down."}, {"Time_Start": 2056.56, "Time_End": 2059.56, "Text": " So those are the, I'm going to go without that then."}, {"Time_Start": 2059.56, "Time_End": 2064.06, "Text": " Those are the substantive rules that need to be, that signatory nations need to agree on."}, {"Time_Start": 2064.06, "Time_End": 2067.06, "Text": " There's also procedural rules that the nations need to agree on."}, {"Time_Start": 2067.06, "Time_End": 2075.56, "Text": " And those procedural rules are basically about the collection of data and the preservation of data"}, {"Time_Start": 2075.56, "Time_End": 2082.06, "Text": " so that we can have evidence collection by local law enforcement, at least,"}, {"Time_Start": 2082.06, "Time_End": 2086.32, "Text": " which will lead us up to the third provision, which is that once local law enforcement collects this data,"}, {"Time_Start": 2086.56, "Time_End": 2091.56, "Text": " we're going to go and hand it over to foreign law enforcement agents."}, {"Time_Start": 2091.56, "Time_End": 2099.56, "Text": " So first, there are procedural rules that require system administrators to preserve stored computer data"}, {"Time_Start": 2099.56, "Time_End": 2107.56, "Text": " up to 90 days upon request and that that 90-day period can be extended if further requested."}, {"Time_Start": 2107.56, "Time_End": 2116.56, "Text": " System administrators must be able to, there must be laws that require system administrators to preserve traffic data,"}, {"Time_Start": 2116.56, "Time_End": 2121.56, "Text": " and to disclose that data to law enforcement agents."}, {"Time_Start": 2121.56, "Time_End": 2128.56, "Text": " So I put a little picture of a computer server here because one of the great complaints that these provisions have had"}, {"Time_Start": 2128.56, "Time_End": 2135.56, "Text": " and one of the powerful lobbying efforts made against these provisions was by ISPs who said,"}, {"Time_Start": 2135.56, "Time_End": 2141.56, "Text": " look, we don't have the resources to store all this information for you all the time."}, {"Time_Start": 2141.56, "Time_End": 2145.56, "Text": " This is a great financial burden on us and we simply can't do it."}, {"Time_Start": 2145.56, "Time_End": 2153.56, "Text": " And the Council of Europe as a whole has generally disregarded that complaint on the part of the ISPs."}, {"Time_Start": 2153.56, "Time_End": 2158.56, "Text": " But you did say upon request, not all data."}, {"Time_Start": 2158.56, "Time_End": 2162.56, "Text": " Right, not all data. It is upon request. And actually, that's a very good question"}, {"Time_Start": 2162.56, "Time_End": 2165.56, "Text": " and something that we'll talk about a little while later."}, {"Time_Start": 2165.56, "Time_End": 2169.56, "Text": " There have been some amendments to these provisions to make them a little more palatable."}, {"Time_Start": 2169.56, "Time_End": 2175.54, "Text": " In fact, the treaty does say that it is upon request, but countries can"}, {"Time_Start": 2175.56, "Time_End": 2181.56, "Text": " still require whatever legal process they need before this information is disclosed."}, {"Time_Start": 2181.56, "Time_End": 2186.56, "Text": " So if the United States still requires a court order or a warrant to get certain information,"}, {"Time_Start": 2186.56, "Time_End": 2191.56, "Text": " that's okay. Generally, that's interpreted, the treaty is interpreted as not conflicting"}, {"Time_Start": 2191.56, "Time_End": 2196.56, "Text": " with already existing United States privacy protections. However, the treaty does not impose"}, {"Time_Start": 2196.56, "Time_End": 2205.54, "Text": " requirements on other signatory nations to have or to institute privacy protections at all before this type of"}, {"Time_Start": 2205.56, "Time_End": 2207.56, "Text": " of information is turned over."}, {"Time_Start": 2207.56, "Time_End": 2210.56, "Text": " So if nations want to have privacy protections, they still can,"}, {"Time_Start": 2210.56, "Time_End": 2214.56, "Text": " but there's no encouragement or inducement for them to do so."}, {"Time_Start": 2214.56, "Time_End": 2215.56, "Text": " Yes?"}, {"Time_Start": 2215.56, "Time_End": 2217.56, "Text": " So what about..."}, {"Time_Start": 2217.56, "Time_End": 2222.56, "Text": " When we're talking about when it is a verbalized,"}, {"Time_Start": 2222.56, "Time_End": 2225.56, "Text": " and that makes sense that's going beyond that,"}, {"Time_Start": 2225.56, "Time_End": 2228.56, "Text": " I work for something that it was"}, {"Time_Start": 2228.56, "Time_End": 2231.56, "Text": " it was possible to get that you."}, {"Time_Start": 2231.56, "Time_End": 2234.56, "Text": " I worked for a free email, so we have to go a long time."}, {"Time_Start": 2234.56, "Time_End": 2235.56, "Text": " And we have to have to do it."}, {"Time_Start": 2235.56, "Time_End": 2239.56, "Text": " So that one group, when we were ever asked to somehow get people"}, {"Time_Start": 2239.56, "Time_End": 2243.56, "Text": " or think of those people, we would not be able to do it."}, {"Time_Start": 2243.56, "Time_End": 2245.56, "Text": " It was technologically possible."}, {"Time_Start": 2245.56, "Time_End": 2247.56, "Text": " So, in a system like that,"}, {"Time_Start": 2247.56, "Time_End": 2250.56, "Text": " does that mean that you're screwed,"}, {"Time_Start": 2250.56, "Time_End": 2253.56, "Text": " you have a community or is that meaning there are going to be accepted"}, {"Time_Start": 2253.56, "Time_End": 2256.56, "Text": " or is that means that there are going to be exceptions"}, {"Time_Start": 2256.56, "Time_End": 2258.56, "Text": " for a system that are outside of this?"}, {"Time_Start": 2258.56, "Time_End": 2261.56, "Text": " Okay, that's an excellent question and an excellent follow-up"}, {"Time_Start": 2261.56, "Time_End": 2263.56, "Text": " to the point that the gentleman over here made."}, {"Time_Start": 2263.56, "Time_End": 2264.56, "Text": " And this was one of the major battles in this"}, {"Time_Start": 2264.56, "Time_End": 2266.56, "Text": " major battles in this treaty."}, {"Time_Start": 2266.56, "Time_End": 2271.56, "Text": " The question of whether or not ISPs or other service providers could be forced to"}, {"Time_Start": 2271.56, "Time_End": 2280.56, "Text": " construct their technology in such a way as to allow for this type of recording of data and surveillance."}, {"Time_Start": 2280.56, "Time_End": 2286.56, "Text": " And there was great concern about this because in the United States we had passed a law that we call Kalea,"}, {"Time_Start": 2286.56, "Time_End": 2288.56, "Text": " which many of you may be familiar with."}, {"Time_Start": 2288.56, "Time_End": 2294.56, "Text": " And Kalea basically was a law that required telecommunications providers to have technological"}, {"Time_Start": 2294.56, "Time_End": 2299.56, "Text": " capabilities within their systems that permitted law enforcement eavesdropping,"}, {"Time_Start": 2299.56, "Time_End": 2302.56, "Text": " that facilitated law enforcement eavesdropping."}, {"Time_Start": 2302.56, "Time_End": 2310.56, "Text": " And when this treaty was being negotiated, people were very concerned that these provisions"}, {"Time_Start": 2310.56, "Time_End": 2318.56, "Text": " about procedural data collecting were another kind of CALEA for the ISPs,"}, {"Time_Start": 2318.56, "Time_End": 2323.56, "Text": " for the data, that had to do not with telecommunications, but with data communications."}, {"Time_Start": 2323.56, "Time_End": 2325.56, "Text": " but with data communications."}, {"Time_Start": 2325.56, "Time_End": 2327.56, "Text": " And through great efforts at lobbying,"}, {"Time_Start": 2327.56, "Time_End": 2330.56, "Text": " the treaty has added a provision that says"}, {"Time_Start": 2330.56, "Time_End": 2333.56, "Text": " that this type of data collection has to be within"}, {"Time_Start": 2333.56, "Time_End": 2336.56, "Text": " the technological capabilities of the ISP."}, {"Time_Start": 2336.56, "Time_End": 2340.56, "Text": " That there's not a Kalea-type provision in here"}, {"Time_Start": 2340.56, "Time_End": 2345.56, "Text": " that requires ISPs or remailers or that sort of thing"}, {"Time_Start": 2345.56, "Time_End": 2350.56, "Text": " to enable this type of evidence collection or surveillance."}, {"Time_Start": 2350.56, "Time_End": 2353.54, "Text": " Many people feel that those provisions, as they now"}, {"Time_Start": 2353.56, "Time_End": 2356.56, "Text": " and in the treaty are not strong enough,"}, {"Time_Start": 2356.56, "Time_End": 2359.56, "Text": " but there is that language in the treaty and the notes"}, {"Time_Start": 2359.56, "Time_End": 2361.56, "Text": " that explain what the Council of Europe was thinking"}, {"Time_Start": 2361.56, "Time_End": 2363.56, "Text": " when they were writing this thing,"}, {"Time_Start": 2363.56, "Time_End": 2366.56, "Text": " which I also often ask myself,"}, {"Time_Start": 2366.56, "Time_End": 2370.56, "Text": " say that they specifically do want to avoid this"}, {"Time_Start": 2370.56, "Time_End": 2373.56, "Text": " what is called the Kalea problem."}, {"Time_Start": 2373.56, "Time_End": 2375.56, "Text": " So thanks for that question."}, {"Time_Start": 2375.56, "Time_End": 2378.56, "Text": " Search and seizure is another issue."}, {"Time_Start": 2378.56, "Time_End": 2379.56, "Text": " Yes."}, {"Time_Start": 2383.56, "Time_End": 2392.56, "Text": " Well, the question is, will ISPs be prohibited from informing customers when these requests are made?"}, {"Time_Start": 2392.56, "Time_End": 2397.56, "Text": " And the answer is that, yes, there are provisions in this treaty that say that you,"}, {"Time_Start": 2397.56, "Time_End": 2405.56, "Text": " there has to be a way to hide the fact of this investigation from the customer."}, {"Time_Start": 2405.56, "Time_End": 2411.56, "Text": " Now, what the parameters of that provision are, I'm not totally familiar with,"}, {"Time_Start": 2411.56, "Time_End": 2412.56, "Text": " but I have a copy of the treaty with."}, {"Time_Start": 2412.56, "Time_End": 2414.56, "Text": " of the treaty with me and we can look it up."}, {"Time_Start": 2414.56, "Time_End": 2419.06, "Text": " So if you want to come up after and people who are interested in the nuances of that question,"}, {"Time_Start": 2419.06, "Time_End": 2424.56, "Text": " we can look that up in the treaty and see if it's possible for us to decipher what in fact it might mean."}, {"Time_Start": 2424.56, "Time_End": 2426.56, "Text": " Search and seizure is an issue."}, {"Time_Start": 2426.56, "Time_End": 2431.56, "Text": " And the main question with search and seizure was a problem with trans-border searches."}, {"Time_Start": 2431.56, "Time_End": 2435.56, "Text": " Are we going to let law enforcement agencies from France or Britain or, you know,"}, {"Time_Start": 2435.56, "Time_End": 2439.56, "Text": " other countries, come into the United States and search our computer servers here?"}, {"Time_Start": 2439.56, "Time_End": 2442.56, "Text": " Basically, the way that that problem was resolved was"}, {"Time_Start": 2442.56, "Time_End": 2448.56, "Text": " to say no, we're not going to allow that, but what we are going to allow is we're going to enable local law enforcement to do searching,"}, {"Time_Start": 2448.56, "Time_End": 2452.56, "Text": " and then we're going to have local law enforcement promise that they're going to cooperate."}, {"Time_Start": 2452.56, "Time_End": 2460.56, "Text": " One part of this search and seizure provision is that the law enforcement, there should have to be laws passed,"}, {"Time_Start": 2460.56, "Time_End": 2467.56, "Text": " which allow law enforcement to order a person with knowledge about the system or about the data protection measures"}, {"Time_Start": 2467.56, "Time_End": 2471.56, "Text": " to provide the ability to search, seize, or copy the data."}, {"Time_Start": 2471.56, "Time_End": 2475.56, "Text": " copy the data. So we're going to talk about that a little bit, but just think about that for a second."}, {"Time_Start": 2475.56, "Time_End": 2480.56, "Text": " Is provide different from enable?"}, {"Time_Start": 2480.56, "Time_End": 2485.56, "Text": " Is provide different from enable?"}, {"Time_Start": 2485.56, "Time_End": 2488.56, "Text": " It's provide different from enable."}, {"Time_Start": 2488.56, "Time_End": 2490.56, "Text": " You should be a lawyer because that's a good question."}, {"Time_Start": 2490.56, "Time_End": 2491.56, "Text": " I mean, we don't know."}, {"Time_Start": 2491.56, "Time_End": 2499.56, "Text": " Basically, what that provision has been interpreted as meaning is that it is a challenge or a danger or a threat to"}, {"Time_Start": 2499.56, "Time_End": 2507.56, "Text": " to encryption rights in countries, that the person who's protected the data or her data with an encryption key"}, {"Time_Start": 2507.56, "Time_End": 2514.56, "Text": " would then have to be able to provide the ability to law enforcement to search that data, meaning that they may have to turn over their key."}, {"Time_Start": 2514.56, "Time_End": 2520.56, "Text": " And that butts up directly against Fifth Amendment protections here in the United States,"}, {"Time_Start": 2520.56, "Time_End": 2523.56, "Text": " as well as creates a host of other problems."}, {"Time_Start": 2523.56, "Time_End": 2525.56, "Text": " So whether provide means enable, I don't know."}, {"Time_Start": 2525.56, "Time_End": 2528.56, "Text": " But if you're asking me whether that means that encryption rights are threatened, the answer is yes."}, {"Time_Start": 2528.56, "Time_End": 2547.56, "Text": " is yes. The question is, does the treaty say that the authorities"}, {"Time_Start": 2547.56, "Time_End": 2555.56, "Text": " and command him to decipher it for them. And that is what the treaty looks like it says. That is what the treaty looks like it says and is a source of great concern."}, {"Time_Start": 2555.56, "Time_End": 2558.56, "Text": " concern."}, {"Time_Start": 2558.56, "Time_End": 2561.56, "Text": " The treaty allows data interception."}, {"Time_Start": 2561.56, "Time_End": 2568.56, "Text": " It requires signatory countries to pass laws that will force service providers to do real-time collection of traffic data"}, {"Time_Start": 2568.56, "Time_End": 2572.56, "Text": " and to cooperate with authorities when they do real-time collection of traffic data."}, {"Time_Start": 2572.56, "Time_End": 2576.56, "Text": " And as we talked about earlier, because of the good question in the back,"}, {"Time_Start": 2576.56, "Time_End": 2580.56, "Text": " that is within the service provider's existing technical capacity."}, {"Time_Start": 2580.56, "Time_End": 2582.56, "Text": " So there's no Kalia problem."}, {"Time_Start": 2582.56, "Time_End": 2584.56, "Text": " They're not required to build snooping into their system."}, {"Time_Start": 2584.56, "Time_End": 2588.56, "Text": " into their system, but they do have to cooperate with data intercepts,"}, {"Time_Start": 2588.56, "Time_End": 2593.56, "Text": " just as the telecommunications companies do here when they're given a wiretap order."}, {"Time_Start": 2593.56, "Time_End": 2613.56, "Text": " There are, and the final essence of all of this, is that once the signatory nations pass the laws that state what is a crime,"}, {"Time_Start": 2613.56, "Time_End": 2617.66, "Text": " what is a crime, and we all agree on what's a crime, and once the signatory countries"}, {"Time_Start": 2617.66, "Time_End": 2622.56, "Text": " passed laws that say, here's, data collection can happen, and here's how data collection"}, {"Time_Start": 2622.56, "Time_End": 2628.46, "Text": " will happen, then they all agree that once they will then exchange that data."}, {"Time_Start": 2628.46, "Time_End": 2633.66, "Text": " That's the essence of the treaty and how these international problems are to be overcome."}, {"Time_Start": 2633.66, "Time_End": 2639.86, "Text": " And these jurisdictional questions, that's the cooperation problem, and added to that is a definition"}, {"Time_Start": 2639.86, "Time_End": 2643.54, "Text": " of jurisdiction, where a nation has jurisdiction, is defined as,"}, {"Time_Start": 2643.56, "Time_End": 2647.2, "Text": " on their territory, on one of their ships, on one of their aircraft."}, {"Time_Start": 2647.2, "Time_End": 2652.18, "Text": " And once we have this agreement that the nations have jurisdiction and that we have agreements"}, {"Time_Start": 2652.18, "Time_End": 2654.58, "Text": " about all these crimes, we can agree on extradition."}, {"Time_Start": 2654.58, "Time_End": 2657.98, "Text": " Because usually we don't have extradition unless the offense is a crime in both nations."}, {"Time_Start": 2657.98, "Time_End": 2661.7799999999997, "Text": " Now it's a crime in both nations, so we agree that we extradite."}, {"Time_Start": 2661.7799999999997, "Time_End": 2666.0, "Text": " It requires both first that it's punishable by both parties, but also that it be an offense that"}, {"Time_Start": 2666.0, "Time_End": 2668.24, "Text": " is punishable by more than one year."}, {"Time_Start": 2668.24, "Time_End": 2672.66, "Text": " And an offense that's punishable by more than one year is a felony, by less than one year is a misdemeanor."}, {"Time_Start": 2672.66, "Time_End": 2673.54, "Text": " That's the..."}, {"Time_Start": 2673.56, "Time_End": 2680.56, "Text": " essential difference."}, {"Time_Start": 2680.56, "Time_End": 2682.56, "Text": " Okay."}, {"Time_Start": 2682.56, "Time_End": 2686.56, "Text": " So, consensus can be bad."}, {"Time_Start": 2686.56, "Time_End": 2687.56, "Text": " Why?"}, {"Time_Start": 2687.56, "Time_End": 2691.56, "Text": " Because we don't have a laboratory approach where we can see a lot of variations in the ways that different"}, {"Time_Start": 2691.56, "Time_End": 2695.56, "Text": " computer crime laws can help or hurt computer security."}, {"Time_Start": 2695.56, "Time_End": 2699.96, "Text": " We also are heading towards a situation where we have a substantive agreement on these laws"}, {"Time_Start": 2699.96, "Time_End": 2703.5, "Text": " without having any greater agreement on human rights, on free speech, on due"}, {"Time_Start": 2703.56, "Time_End": 2708.1, "Text": " process or on any of these things which could result not only an injustice in those"}, {"Time_Start": 2708.1, "Time_End": 2712.9, "Text": " other countries but it results in our law enforcement agents and our country and our tax dollars"}, {"Time_Start": 2712.9, "Time_End": 2717.94, "Text": " being spent to pursue or prosecute cases in other countries that would never be pursued"}, {"Time_Start": 2717.94, "Time_End": 2724.94, "Text": " or prosecuted here because of these rights."}, {"Time_Start": 2724.94, "Time_End": 2728.32, "Text": " Article 6 is one of the more controversial of the provisions."}, {"Time_Start": 2728.32, "Time_End": 2733.54, "Text": " Initially it regulated all hacker tools and it was interpreted as preventing the"}, {"Time_Start": 2733.56, "Time_End": 2738.1, "Text": " development of any hacker tools. Through great lobbying efforts, it's been amended,"}, {"Time_Start": 2738.1, "Time_End": 2743.36, "Text": " and it now says there's no liability when the tool is designed for the authorized testing"}, {"Time_Start": 2743.36, "Time_End": 2749.44, "Text": " or protection of a computer system. That wasn't enough for many people because, you know, who's"}, {"Time_Start": 2749.44, "Time_End": 2753.5, "Text": " to determine whether it's for authorized, whether it's designed for authorized testing or"}, {"Time_Start": 2753.5, "Time_End": 2757.2599999999998, "Text": " designed for hacking. Hacking tool looks very much like a security tool. In fact, they're"}, {"Time_Start": 2757.2599999999998, "Time_End": 2763.54, "Text": " often the same tools. So because of great pressure from countries, from encryption experts,"}, {"Time_Start": 2763.56, "Time_End": 2768.86, "Text": " and from researchers in different countries, that provision is now one that you can opt out of."}, {"Time_Start": 2768.86, "Time_End": 2777.0, "Text": " However, I think we can look, I think the trend of the future is that we're going to have to be battling a lot of laws that prohibit hacker tools."}, {"Time_Start": 2777.0, "Time_End": 2786.56, "Text": " The Australian government has recently, is considering now a law which would just ban all hacker tools without these exceptions for computer security research."}, {"Time_Start": 2786.56, "Time_End": 2790.7599999999998, "Text": " Child pornography, you wouldn't think it's controversial, but it is."}, {"Time_Start": 2790.76, "Time_End": 2795.0600000000004, "Text": " this law will, this treaty will export the United States definition of child pornography,"}, {"Time_Start": 2795.2200000000003, "Time_End": 2802.42, "Text": " which includes not only actual child porn, but virtual child porn, pornography in which no children were harmed,"}, {"Time_Start": 2802.5200000000004, "Time_End": 2805.6200000000003, "Text": " but which appears to be a visual depiction of a child."}, {"Time_Start": 2805.92, "Time_End": 2809.78, "Text": " At the very least, this treaty requires that the virtual child porn be a picture."}, {"Time_Start": 2810.0800000000004, "Time_End": 2813.88, "Text": " In the United States, that's not a requirement, and I read in the New York Times two days ago"}, {"Time_Start": 2813.88, "Time_End": 2819.5200000000004, "Text": " that somebody was sentenced to prison for 10 years for a written depiction of child pornography."}, {"Time_Start": 2820.76, "Time_End": 2829.76, "Text": " We talked about all of this."}, {"Time_Start": 2829.76, "Time_End": 2831.76, "Text": " So what's the bad news about the cybercrime treaty?"}, {"Time_Start": 2831.76, "Time_End": 2834.76, "Text": " They're serious."}, {"Time_Start": 2834.76, "Time_End": 2839.76, "Text": " Are there what?"}, {"Time_Start": 2839.76, "Time_End": 2843.76, "Text": " The question is, were there any lawyers involved in this process?"}, {"Time_Start": 2843.76, "Time_End": 2848.76, "Text": " And I think that the answer is clearly that there were too many lawyers involved in this process?"}, {"Time_Start": 2848.76, "Time_End": 2849.76, "Text": " Yes."}, {"Time_Start": 2849.76, "Time_End": 2850.76, "Text": " Thank you."}, {"Time_Start": 2850.76, "Time_End": 2852.76, "Text": " I just want to stop you for a second."}, {"Time_Start": 2852.76, "Time_End": 2858.76, "Text": " We'll move on because that virtual foreign thing has implications far beyond any kind of"}, {"Time_Start": 2858.76, "Time_End": 2862.76, "Text": " Internet, TV, kind of, you know, whatever."}, {"Time_Start": 2862.76, "Time_End": 2876.76, "Text": " Wouldn't it affect potentially legitimate Hollywood films in which two actors over the age of 18 are playing the role of teenagers involved in sexual activity?"}, {"Time_Start": 2876.76, "Time_End": 2883.76, "Text": " a little bit of the recent traffic, which ironically had a cameo by Mr. Hatch who played itself."}, {"Time_Start": 2883.76, "Time_End": 2893.76, "Text": " The endless love, that high, where you're alleged to believe that the characters are under the age-be."}, {"Time_Start": 2893.76, "Time_End": 2899.76, "Text": " The question is whether the child pornography law has implications far beyond the limited ones that I said."}, {"Time_Start": 2899.76, "Time_End": 2903.76, "Text": " And before I answer that question, I want to ask whether I have till 12 or 1230."}, {"Time_Start": 2903.76, "Time_End": 2904.76, "Text": " Does anybody know?"}, {"Time_Start": 2904.76, "Time_End": 2905.76, "Text": " Okay."}, {"Time_Start": 2905.76, "Time_End": 2906.76, "Text": " Well, well, my answer to that then is."}, {"Time_Start": 2906.76, "Time_End": 2908.76, "Text": " Yes, it does."}, {"Time_Start": 2908.76, "Time_End": 2913.76, "Text": " I want to go back here."}, {"Time_Start": 2913.76, "Time_End": 2917.76, "Text": " Oops."}, {"Time_Start": 2917.76, "Time_End": 2920.76, "Text": " Oh, now I've messed it up."}, {"Time_Start": 2920.76, "Time_End": 2923.76, "Text": " Do you make your slides?"}, {"Time_Start": 2923.76, "Time_End": 2926.76, "Text": " I am going to make the slides available."}, {"Time_Start": 2926.76, "Time_End": 2928.76, "Text": " Oh."}, {"Time_Start": 2928.76, "Time_End": 2931.76, "Text": " Yeah, I will make them available on DefCon."}, {"Time_Start": 2931.76, "Time_End": 2934.76, "Text": " As you can see, I mean, with the child porn thing,"}, {"Time_Start": 2934.76, "Time_End": 2935.76, "Text": " that little picture there is the picture from Lolea."}, {"Time_Start": 2935.76, "Time_End": 2937.76, "Text": " is the picture from Lolita."}, {"Time_Start": 2937.76, "Time_End": 2943.76, "Text": " That's the picture from Lolita, which was, you know, one of the classic, it's a classic and also child porn."}, {"Time_Start": 2943.76, "Time_End": 2945.76, "Text": " So child porn is, it's very controversial."}, {"Time_Start": 2945.76, "Time_End": 2947.76, "Text": " Most people think, oh, you know, it's a black and white issue."}, {"Time_Start": 2947.76, "Time_End": 2951.76, "Text": " But there are lots of complicated legal issues in it, just like with the movie Endless Love"}, {"Time_Start": 2951.76, "Time_End": 2954.76, "Text": " and that sort of thing, what you raised."}, {"Time_Start": 2954.76, "Time_End": 2959.76, "Text": " Okay, so you saw the bad news, and I will make that available, but the question is, what can I do?"}, {"Time_Start": 2959.76, "Time_End": 2964.76, "Text": " And I don't want to leave you on the low point where you all feel like, man, that treaty really sucks."}, {"Time_Start": 2964.76, "Time_End": 2966.76, "Text": " we're in for something really bad."}, {"Time_Start": 2966.76, "Time_End": 2967.76, "Text": " So what can I do?"}, {"Time_Start": 2967.76, "Time_End": 2968.76, "Text": " Lobbying works."}, {"Time_Start": 2968.76, "Time_End": 2969.76, "Text": " Okay?"}, {"Time_Start": 2969.76, "Time_End": 2976.76, "Text": " I've raised many points and pointed out numerous times where lobbying by nations, by researchers,"}, {"Time_Start": 2976.76, "Time_End": 2983.76, "Text": " by encryption advocates, have resulted in modifications being made to the treaty that have made the treaty better."}, {"Time_Start": 2983.76, "Time_End": 2985.76, "Text": " So lobbying does work and is not too late."}, {"Time_Start": 2985.76, "Time_End": 2989.76, "Text": " So I urge everybody who has interests in these issues, and that does appear to be everybody in this room"}, {"Time_Start": 2989.76, "Time_End": 2993.76, "Text": " since you came here and you stayed for the entire hour on this early Saturday morning,"}, {"Time_Start": 2993.76, "Time_End": 2996.76, "Text": " to get educated about these issues."}, {"Time_Start": 2996.76, "Time_End": 2997.76, "Text": " Sunday morning."}, {"Time_Start": 2997.76, "Time_End": 2999.76, "Text": " See, I'm the one with the problem."}, {"Time_Start": 2999.76, "Time_End": 3003.76, "Text": " And I've listed a couple of URLs here for organizations"}, {"Time_Start": 3003.76, "Time_End": 3009.76, "Text": " which have been heavily involved in trying to make the cybercrime treaty better"}, {"Time_Start": 3009.76, "Time_End": 3013.76, "Text": " and to try to make sure that rights are protected,"}, {"Time_Start": 3013.76, "Time_End": 3017.76, "Text": " that our rights and the rights of people and other nations are protected in the treaty."}, {"Time_Start": 3017.76, "Time_End": 3020.76, "Text": " So get out there and do some good."}, {"Time_Start": 3020.76, "Time_End": 3021.76, "Text": " Thank you very much."}, {"Time_Start": 3023.76, "Time_End": 3025.76, "Text": " Thank you."}]}