{"segments": [{"Time_Start": 0.0, "Time_End": 29.98, "Text": " This is a quite wonderful little way for manufacturers because what it does it lets them manufacture one single product and yet with jumper pads or with jumper pads or zero-oom resistance."}, {"Time_Start": 30.0, "Time_End": 34.9, "Text": " or even E.E. Proms, they can easily reconfigure it for other more expensive models."}, {"Time_Start": 34.9, "Time_End": 38.72, "Text": " This means they only have to make one model at one cost, and then of course they choose whatever"}, {"Time_Start": 38.72, "Time_End": 42.68, "Text": " price they want to make for, all the different ones with more advanced features or things"}, {"Time_Start": 42.68, "Time_End": 47.879999999999995, "Text": " like that."}, {"Time_Start": 47.879999999999995, "Time_End": 53.16, "Text": " Sidco boxes are, of course, something that everyone is familiar with. You've probably read"}, {"Time_Start": 53.16, "Time_End": 59.980000000000004, "Text": " the modification facts on it, text documents, or even done it yourself."}, {"Time_Start": 60.0, "Time_End": 66.44, "Text": " This covers a lot of the different things I'm going to be discussing."}, {"Time_Start": 66.44, "Time_End": 69.76, "Text": " And one thing I should warn you is bear with me because this is the first time I've"}, {"Time_Start": 69.76, "Time_End": 74.0, "Text": " been making a presentation in front of anyone, especially in audience this big."}, {"Time_Start": 74.0, "Time_End": 76.36, "Text": " So I'm going to suck."}, {"Time_Start": 76.36, "Time_End": 81.24000000000001, "Text": " I'm already going to warn you about that."}, {"Time_Start": 81.24000000000001, "Time_End": 85.08, "Text": " One of the first things to do if you're trying to figure out what mods are available for your"}, {"Time_Start": 85.08, "Time_End": 89.56, "Text": " particular device you've chosen, oops, spelling error."}, {"Time_Start": 89.56, "Time_End": 92.12, "Text": " Oh, well, bear with it."}, {"Time_Start": 92.12, "Time_End": 95.34, "Text": " Are there any special features on models that look identical?"}, {"Time_Start": 95.34, "Time_End": 97.44, "Text": " Like, for instance, the caller ID boxes."}, {"Time_Start": 97.44, "Time_End": 101.84, "Text": " Got two models that look virtually identical, yet the only difference between them is the number"}, {"Time_Start": 101.84, "Time_End": 103.28, "Text": " of calls they store."}, {"Time_Start": 103.28, "Time_End": 110.48, "Text": " This could give you an idea of what features are or are not available to possibly be added or removed"}, {"Time_Start": 110.48, "Time_End": 112.6, "Text": " for your particular piece of hardware you've chosen."}, {"Time_Start": 112.6, "Time_End": 115.48, "Text": " Are there any unusual markings on the plastic?"}, {"Time_Start": 115.48, "Time_End": 119.54, "Text": " One of the things manufacturers like to do is, when they make their case."}, {"Time_Start": 119.56, "Time_End": 125.5, "Text": " cases with the plastic injection mold system, it's a big metal mold and what they"}, {"Time_Start": 125.5, "Time_End": 130.1, "Text": " do is they sometimes have modular components to it so that when they inject the plastic, if they"}, {"Time_Start": 130.1, "Time_End": 134.6, "Text": " want to change the features as to what doors are or not available or openings or whatnot,"}, {"Time_Start": 134.6, "Time_End": 140.98000000000002, "Text": " all they have to do is simply put in a sec block of metal in place of another one and you"}, {"Time_Start": 140.98000000000002, "Time_End": 149.54, "Text": " now have a door available there for buttons or a hole or whatnot for any other models."}, {"Time_Start": 149.56, "Time_End": 154.22, "Text": " This is most visible on the NetPliant's eye opener with the compact flash socket."}, {"Time_Start": 154.66, "Time_End": 158.36, "Text": " As if you look at it from the outside, you can see small ridges from where there is a door,"}, {"Time_Start": 158.5, "Time_End": 160.3, "Text": " even though it's a solid molded piece of plastic."}, {"Time_Start": 160.68, "Time_End": 165.14000000000001, "Text": " And on the inside, you can see the holes drilled in the side for where the door snaps into place"}, {"Time_Start": 165.14000000000001, "Time_End": 168.58, "Text": " if they ever made that into any of the eye openers."}, {"Time_Start": 170.8, "Time_End": 177.92000000000002, "Text": " Are there any big, empty, and unused spots on the case, or whatever external case it is?"}, {"Time_Start": 177.92000000000002, "Time_End": 189.48000000000002, "Text": " Sometimes what they do is you'll find, like let's say a VCR, for example, have a big open panel on it, a play and a stop button,"}, {"Time_Start": 189.88000000000002, "Time_End": 192.92000000000002, "Text": " and over on the other side of power button. There would be a big strip of absolutely nothing there."}, {"Time_Start": 193.42000000000002, "Time_End": 198.04000000000002, "Text": " There could possibly be something added or made available for that, which I'll cover that here shortly."}, {"Time_Start": 199.16000000000003, "Time_End": 205.02, "Text": " With big open areas, those are physical things such as displays, lights, all sorts of stuff."}, {"Time_Start": 207.92000000000002, "Time_End": 216.64000000000001, "Text": " And also, one of the other things I'm going to be talking, one of the other things to look for is LCD displays or other gas plasma displays, vacuum fluorescence."}, {"Time_Start": 217.14000000000001, "Time_End": 232.22000000000003, "Text": " You can sometimes see characters on them available indicating that there are possibly certain features there, such as with, it could be that they use the same display for several different models and note inside of the embedded chip, the main CPU for the device."}, {"Time_Start": 232.22000000000003, "Time_End": 237.9, "Text": " There might not even be the ability there added for whatever number of calls you want to have."}, {"Time_Start": 237.92000000000002, "Time_End": 244.52, "Text": " for a caller ID box or other additional features such as ham radios or things of that nature."}, {"Time_Start": 246.52, "Time_End": 253.52, "Text": " The reason why LCD displays can see that is because LCD displays are meant to be viewed like in the top picture,"}, {"Time_Start": 253.92000000000002, "Time_End": 258.86, "Text": " looking straight down with the light source either behind you or around you with ambient light."}, {"Time_Start": 259.90000000000003, "Time_End": 267.90000000000003, "Text": " If you look at it at a very shallow angle, you can many times see additional characters made the contrast"}, {"Time_Start": 267.92, "Time_End": 271.54, "Text": " of them made more visible. So you can see what other features are there, segments"}, {"Time_Start": 271.54, "Time_End": 278.64000000000004, "Text": " of LCD displays for numeric characters or other certain features, such as a little funny"}, {"Time_Start": 278.64000000000004, "Time_End": 285.8, "Text": " little symbols like some of the people who make ham radios and cell phones and stuff like"}, {"Time_Start": 285.8, "Time_End": 290.6, "Text": " to put in."}, {"Time_Start": 290.6, "Time_End": 297.76, "Text": " I had a much nicer picture until I lost it, so I kind of put together a quickie here. You can view the"}, {"Time_Start": 297.92, "Time_End": 326.82, "Text": " like shaped are supposed to be the liquid crystals. How this works is, light is sent through the first piece of polarizing glass and turns the light basically into a vertical polarization. The liquid crystals distort that vertical polarization and allows it to become pretty much non-polarized again. It then passes through the rear one which has horizontal polarization and is reflected off a rear reflective material of some kind where it then bounces back through."}, {"Time_Start": 327.92, "Time_End": 332.46000000000004, "Text": " allows you to pretty much see what looks like a light display or light character."}, {"Time_Start": 333.54, "Time_End": 341.34000000000003, "Text": " When electricity is applied on a thin metal coating on the surface of the LCD display,"}, {"Time_Start": 343.48, "Time_End": 350.22, "Text": " the liquid crystals line up and polarize themselves and keep from depolarizing the light that passes through it."}, {"Time_Start": 350.86, "Time_End": 353.42, "Text": " At which point, the light will not be able to pass through the rear filter."}, {"Time_Start": 353.84000000000003, "Time_End": 357.74, "Text": " And because the light cannot be reflected off the rear display, the end of the reflective material,"}, {"Time_Start": 357.92, "Time_End": 364.88, "Text": " ends up looking dark. The thing is, by lowering the voltage, the liquid crystals"}, {"Time_Start": 364.88, "Time_End": 370.68, "Text": " do not properly polarize themselves. And the end result is that the display looks somewhat faded"}, {"Time_Start": 370.68, "Time_End": 376.04, "Text": " or a light shade of gray, basically gray scales, like what the Game Boys do, various other displays"}, {"Time_Start": 376.04, "Time_End": 382.26, "Text": " like the Palm Pilot, if you program in for using the gray scale functions."}, {"Time_Start": 382.26, "Time_End": 387.76, "Text": " The thing about it is, even when this display segments are wired to the CPU and are not being"}, {"Time_Start": 387.76, "Time_End": 392.76, "Text": " used, a small amount of trickle voltage is going through that, changing that polarization slightly."}, {"Time_Start": 393.32, "Time_End": 399.02, "Text": " If you hold it up to the light to look through it like that first picture I had, when the power is not"}, {"Time_Start": 399.02, "Time_End": 404.82, "Text": " applied, you'll barely see anything at all. You might see the metal coatings, but I wouldn't see"}, {"Time_Start": 404.82, "Time_End": 411.12, "Text": " anything else. But when the small trickle voltage flows through it, the special characters that might not"}, {"Time_Start": 411.12, "Time_End": 414.32, "Text": " be normally available will be considerably more visible."}, {"Time_Start": 417.76, "Time_End": 421.96, "Text": " So that way you can identify just basically I'll buy it looks."}, {"Time_Start": 421.96, "Time_End": 427.15999999999997, "Text": " One thing to do when opening it up is keep all the screws separate and what I always do is put"}, {"Time_Start": 427.15999999999997, "Time_End": 431.86, "Text": " down a piece of paper and mark what pattern the screws went in what holes for whatever device"}, {"Time_Start": 431.86, "Time_End": 434.96, "Text": " you're open, whether it's a VCR or a television set or whatnot."}, {"Time_Start": 434.96, "Time_End": 438.56, "Text": " Because many of these screws are different for each and every socket and I've seen a lot of people"}, {"Time_Start": 438.56, "Time_End": 444.76, "Text": " throw them all into the same little bowl and then try to figure out afterwards what screw holes those go back into."}, {"Time_Start": 444.76, "Time_End": 447.74, "Text": " Such a pain in the butt so it's best to keep them all separate."}, {"Time_Start": 447.76, "Time_End": 451.59999999999997, "Text": " in the first place. When you're trying to open it up, do not force it if it won't,"}, {"Time_Start": 451.59999999999997, "Time_End": 455.52, "Text": " if it's snapped together and just won't come apart because you will break the parts of the molded"}, {"Time_Start": 455.52, "Time_End": 460.48, "Text": " plastic case, they're usually snapped together. That happened with my first"}, {"Time_Start": 460.48, "Time_End": 465.59999999999997, "Text": " Sidco caller ID box I owned, as many of you probably have done, broken the little snaps at"}, {"Time_Start": 465.59999999999997, "Time_End": 471.84, "Text": " the foot of it. And also, if the case gets stuck on anything, do not force it apart as well"}, {"Time_Start": 471.84, "Time_End": 475.12, "Text": " because you can damage it to use cheap plastic that is easy to break."}, {"Time_Start": 477.76, "Time_End": 485.76, "Text": " On the circuit board, you can look for possible points where it can be modified at."}, {"Time_Start": 485.76, "Time_End": 501.76, "Text": " Usually it involves a blob of solder of some kind, such as on the caller ID boxes, that all you have to do is because of the resident flux that's already on it from the original manufacturer, just touch a solder iron to it and that will pretty much break the contact."}, {"Time_Start": 501.76, "Time_End": 505.76, "Text": " And just add solder to reconfigure it again."}, {"Time_Start": 505.76, "Time_End": 512.76, "Text": " open solder pads that are abnormally shaped relative to the rest of the surface mount components."}, {"Time_Start": 512.76, "Time_End": 518.76, "Text": " You'll find that when you look at many circuit boards that have the solder pads on it that are open with nothing there,"}, {"Time_Start": 518.76, "Time_End": 524.76, "Text": " the surface mount components around it, such as the diodes and transistors and stuff, we usually have a different size and shape"}, {"Time_Start": 524.76, "Time_End": 530.76, "Text": " than the ones that are meant to just have a blob of solder to close it shut to simply short the circuit."}, {"Time_Start": 530.76, "Time_End": 534.76, "Text": " This is one of the other most common"}, {"Time_Start": 534.76, "Time_End": 539.76, "Text": " things as well. Look for a whole rows of zero-oam resistors."}, {"Time_Start": 539.76, "Time_End": 547.76, "Text": " Many times zero-oam resistors are used in place of blobs of solder because they look like any old surface-mount component."}, {"Time_Start": 547.76, "Time_End": 552.76, "Text": " And people will look at that. Many people who don't know how to read the numbers off the surface-mount components,"}, {"Time_Start": 552.76, "Time_End": 559.76, "Text": " will look at that, think it's just a regular resistor or diode or something else, and not think about possibly removing that."}, {"Time_Start": 559.76, "Time_End": 563.76, "Text": " Rows of identical diodes or resistors."}, {"Time_Start": 563.76, "Time_End": 570.76, "Text": " Usually the diodes are used for things I found them used in ham radios and police scanners quite a bit."}, {"Time_Start": 570.76, "Time_End": 574.76, "Text": " I'll have pictures of those coming up here shortly."}, {"Time_Start": 574.76, "Time_End": 579.76, "Text": " One of the things you're doing is when you find a whole bank of them to go through,"}, {"Time_Start": 579.76, "Time_End": 582.76, "Text": " one of the tricks I found which is really good is gray logic."}, {"Time_Start": 582.76, "Time_End": 587.76, "Text": " It's used for motor sensors and various other things"}, {"Time_Start": 587.76, "Time_End": 592.76, "Text": " and is a different form of the regular binary logic which many of you people have seen."}, {"Time_Start": 592.76, "Time_End": 597.76, "Text": " scene. Touching wires together is one of the other most common things that I found"}, {"Time_Start": 597.76, "Time_End": 602.76, "Text": " very useful. Take pieces of wire, solder them straight down onto the pads that go up,"}, {"Time_Start": 602.76, "Time_End": 606.76, "Text": " and simply touch them together or twist them together or short them together."}, {"Time_Start": 606.76, "Time_End": 610.76, "Text": " That way you only solder it twice to put the wires on and to take them off."}, {"Time_Start": 610.76, "Time_End": 616.76, "Text": " And that way you can go ahead and adjust the configurations and combinations as many times as you want."}, {"Time_Start": 616.76, "Time_End": 621.76, "Text": " Or if you're going to have to do it for an extended period of time, I also install one of those banks of dip switches."}, {"Time_Start": 621.76, "Time_End": 625.76, "Text": " of dip switches that are commonly using some of the jumperless motherboards"}, {"Time_Start": 625.76, "Time_End": 630.76, "Text": " and various other components, such as some of the older Iso cards."}, {"Time_Start": 630.76, "Time_End": 634.76, "Text": " Grade code looks like this."}, {"Time_Start": 634.76, "Time_End": 639.76, "Text": " And the reason why it's shaped as it is, is obviously, to simplify the design."}, {"Time_Start": 639.76, "Time_End": 643.76, "Text": " And also, as you can see each and every time the state changes,"}, {"Time_Start": 643.76, "Time_End": 647.76, "Text": " only one single bit changes between states."}, {"Time_Start": 647.76, "Time_End": 650.76, "Text": " This means when you're soldering it, a lot less work."}, {"Time_Start": 650.76, "Time_End": 657.76, "Text": " because for this number of combinations, for 16 different combinations, you only have to"}, {"Time_Start": 657.76, "Time_End": 661.76, "Text": " solder it about 16 times to get back to where it was at the original factory default."}, {"Time_Start": 661.76, "Time_End": 666.76, "Text": " Where if you use regular binary code, you pretty much find yourself soldering a whole lot of times"}, {"Time_Start": 666.76, "Time_End": 672.76, "Text": " and in between 7 and 8, as you can see right there, you'd have to solder every single pad at the same time."}, {"Time_Start": 672.76, "Time_End": 675.76, "Text": " And the more soldering you have to do means the more heat on your circuit board."}, {"Time_Start": 675.76, "Time_End": 680.76, "Text": " That means you can't actually delaminate the circuit material itself and take the traces right off."}, {"Time_Start": 680.76, "Time_End": 691.76, "Text": " There are all sorts of hidden features in TVs, VCRs, and other home electronics devices."}, {"Time_Start": 691.76, "Time_End": 693.76, "Text": " These range from various models."}, {"Time_Start": 693.76, "Time_End": 698.76, "Text": " They have stereo, region coding on some DVD players, possibly."}, {"Time_Start": 698.76, "Time_End": 702.76, "Text": " I haven't had too much experience with that since DVD players are still a little on the pricey side."}, {"Time_Start": 702.76, "Time_End": 707.76, "Text": " I don't want to rip apart a 200 piece of electronics gear just to find myself screwing it over."}, {"Time_Start": 707.76, "Time_End": 710.74, "Text": " I think you people can sympathize."}, {"Time_Start": 710.76, "Time_End": 717.76, "Text": " with that. This is the inside of my rate 715 DVD player and all over the board"}, {"Time_Start": 717.76, "Time_End": 724.76, "Text": " ranging from on this side this way here, here, here, and also right here, here, and here,"}, {"Time_Start": 724.76, "Time_End": 727.76, "Text": " on the board there are whole banks of zero-oam resistors."}, {"Time_Start": 727.76, "Time_End": 732.76, "Text": " I haven't yet attempted to figure out what those do because, as you can see,"}, {"Time_Start": 732.76, "Time_End": 736.76, "Text": " a lot of electronics components are missing from it, which I'd have to add,"}, {"Time_Start": 736.76, "Time_End": 740.76, "Text": " which are usually available only on European models, such as for the SCART connector,"}, {"Time_Start": 740.76, "Time_End": 744.76, "Text": " and also for the Dolby AC3 output."}, {"Time_Start": 744.76, "Time_End": 748.76, "Text": " And so enabling those features, the device might not even work or boot up."}, {"Time_Start": 748.76, "Time_End": 754.76, "Text": " And also I just bought the thing as well, so I am not going to mess with it."}, {"Time_Start": 754.76, "Time_End": 756.76, "Text": " But it gives you something to look at."}, {"Time_Start": 756.76, "Time_End": 761.76, "Text": " Here's a close-up of around the ROM chip and with the CPU up here."}, {"Time_Start": 761.76, "Time_End": 767.76, "Text": " This is one bank of zero-oom resistors, this is another bank, and here's another bank, and here's another bank."}, {"Time_Start": 767.76, "Time_End": 769.76, "Text": " Those are probably the ones that configure various systems."}, {"Time_Start": 769.76, "Time_End": 775.76, "Text": " ones that configure various things such as what hardware is and is not installed and available on it."}, {"Time_Start": 775.76, "Time_End": 781.76, "Text": " Another thing to look at right here is, as you can see, this connector that goes to the face plate has certain pins missing from it."}, {"Time_Start": 781.76, "Time_End": 791.76, "Text": " I follow the traces and discover that's for audio output, audio video outputs are right on the front of the player itself for connecting to a stereo system or something like that,"}, {"Time_Start": 791.76, "Time_End": 797.76, "Text": " which is found on other, I've seen those on pictures of other rate 715 DVD players."}, {"Time_Start": 797.76, "Time_End": 799.74, "Text": " So you could get yourself another audio output by that."}, {"Time_Start": 799.76, "Time_End": 801.76, "Text": " actually wiring those up."}, {"Time_Start": 801.76, "Time_End": 805.76, "Text": " Which could be useful if you have a crammed stereo system."}, {"Time_Start": 805.76, "Time_End": 809.76, "Text": " Another thing to look for is, as I mentioned earlier, VCRs."}, {"Time_Start": 809.76, "Time_End": 815.76, "Text": " When I first got into figuring out hardware mods, one of the things I did was"}, {"Time_Start": 815.76, "Time_End": 820.76, "Text": " I decided to look at one of my VCRs that I had, which I had pulled out of a dumpster and fixed up."}, {"Time_Start": 820.76, "Time_End": 822.76, "Text": " I was too cheap to go out and buy one."}, {"Time_Start": 822.76, "Time_End": 824.76, "Text": " I don't think many people can sympathize with me."}, {"Time_Start": 824.76, "Time_End": 826.76, "Text": " Also, it's fun to fix up something yourself."}, {"Time_Start": 826.76, "Time_End": 829.74, "Text": " One of the things I did it is it only had a place"}, {"Time_Start": 829.76, "Time_End": 831.76, "Text": " a stop and a power button."}, {"Time_Start": 831.76, "Time_End": 834.76, "Text": " No record, no speed adjustments, no nothing."}, {"Time_Start": 834.76, "Time_End": 839.76, "Text": " I couldn't even rewind a tape except for playing it all the way to the end of the linear rewind automatically."}, {"Time_Start": 839.76, "Time_End": 842.76, "Text": " So I took off the faceplate, yeah, wonderful design, huh?"}, {"Time_Start": 842.76, "Time_End": 848.76, "Text": " So I took off the face plate and what I found was that on the circuit board right behind the display"}, {"Time_Start": 848.76, "Time_End": 856.76, "Text": " there were through holes drilled in the circuit board and pads and the locations to solder on all the additional buttons for fast forward,"}, {"Time_Start": 856.76, "Time_End": 858.76, "Text": " rewind, etc."}, {"Time_Start": 858.76, "Time_End": 859.76, "Text": " So I'm like,"}, {"Time_Start": 859.76, "Time_End": 860.76, "Text": " Hmm."}, {"Time_Start": 860.76, "Time_End": 863.76, "Text": " After some experimentation with the best way to implement it,"}, {"Time_Start": 863.76, "Time_End": 866.76, "Text": " I ended up screwing up the face plate considerably drilling lots of holes through it."}, {"Time_Start": 866.76, "Time_End": 870.76, "Text": " So it went out, got a big chunk of aluminum sheet metal, drilled holes through it,"}, {"Time_Start": 870.76, "Time_End": 877.76, "Text": " put your regular through hole, push buttons, a cheap pack of $1 ones from Radio Shack,"}, {"Time_Start": 877.76, "Time_End": 881.76, "Text": " and had myself a full set of buttons and a nice tricked-out VCR."}, {"Time_Start": 881.76, "Time_End": 887.76, "Text": " That served me for several years until I turned around and gave it to a friend to it ended up dying last year."}, {"Time_Start": 887.76, "Time_End": 888.76, "Text": " Aw."}, {"Time_Start": 889.76, "Time_End": 896.76, "Text": " On chips."}, {"Time_Start": 896.76, "Time_End": 903.76, "Text": " One of the things to look for is on small embedded chips, such as telephones, radios, remote controls,"}, {"Time_Start": 903.76, "Time_End": 908.76, "Text": " there's almost anything that has a small single chip that can be reused for other things,"}, {"Time_Start": 908.76, "Time_End": 916.26, "Text": " such as other models of VCR, or TV remote controls, or the small, simple things is unused pins on them"}, {"Time_Start": 916.26, "Time_End": 919.74, "Text": " can enable you to do all sorts of things, especially if they're not used."}, {"Time_Start": 919.76, "Time_End": 923.76, "Text": " wired to anything. Why they use these is it's less engineering, less work for them,"}, {"Time_Start": 923.76, "Time_End": 929.76, "Text": " and also it means faster certification as well, since some of these devices have to have FCC approval."}, {"Time_Start": 933.76, "Time_End": 941.76, "Text": " What I'm going to use for an example is a DTMF chip, which is on this small touchtone encoder here,"}, {"Time_Start": 941.76, "Time_End": 946.76, "Text": " which inside of it, I decided to want to add the A, B, C, and D keys one day."}, {"Time_Start": 946.76, "Time_End": 955.76, "Text": " What I did is I studied it, and what I found is this pin, although it should be for the fourth column, was not."}, {"Time_Start": 955.76, "Time_End": 958.76, "Text": " The fourth column was all the way up here."}, {"Time_Start": 962.76, "Time_End": 967.76, "Text": " This is pretty common to find unused pins all over the place. Usually these won't even have traces running to them."}, {"Time_Start": 967.76, "Time_End": 971.76, "Text": " They'll simply be soldered to the board just so that the chip is all the way down."}, {"Time_Start": 971.76, "Time_End": 975.76, "Text": " And what you can do is short the wires together."}, {"Time_Start": 975.76, "Time_End": 986.76, "Text": " or in this case, cut the trace on the board and rig up a slide switch, which is what I did with mine,"}, {"Time_Start": 986.76, "Time_End": 990.76, "Text": " so that I can switch the columns back and forth for the..."}, {"Time_Start": 990.76, "Time_End": 992.76, "Text": " Yes, sir."}, {"Time_Start": 992.76, "Time_End": 998.76, "Text": " Do you like to do that experimentally or do you like to get the data sheet to come manufacturer?"}, {"Time_Start": 998.76, "Time_End": 1000.76, "Text": " No, that's a good point."}, {"Time_Start": 1000.76, "Time_End": 1005.74, "Text": " One of the things you can do to find these, the information on what pins are or are not used,"}, {"Time_Start": 1005.76, "Time_End": 1011.76, "Text": " used is to get, as this individual mentioned there, get the data sheets from the manufacturers."}, {"Time_Start": 1011.76, "Time_End": 1015.76, "Text": " Sometimes these are made available, sometimes they are not."}, {"Time_Start": 1015.76, "Time_End": 1020.76, "Text": " In this case, for this UM chip, I have not been able to locate the specs on it,"}, {"Time_Start": 1020.76, "Time_End": 1025.76, "Text": " and I had to figure that out on my own, which with the way it was designed,"}, {"Time_Start": 1025.76, "Time_End": 1031.76, "Text": " the wires simply run straight to both vertical and horizontal across the board and are shorted together."}, {"Time_Start": 1031.76, "Time_End": 1034.76, "Text": " So all I had to do is take a paper clip and short the appropriate pins until I found,"}, {"Time_Start": 1034.76, "Time_End": 1037.1, "Text": " until I found the fourth column."}, {"Time_Start": 1037.1, "Time_End": 1043.32, "Text": " It might be more complex for other devices, but for simple things like telephones for adding,"}, {"Time_Start": 1043.32, "Time_End": 1048.14, "Text": " for example, redial buttons, flash buttons, even possibly memory buttons, which are not available"}, {"Time_Start": 1048.14, "Time_End": 1055.0, "Text": " on your small, cheap phone, you could be able to add them if you find unused pins."}, {"Time_Start": 1055.0, "Time_End": 1060.0, "Text": " On embedded chips, there's all sorts of different ways they can be configured for the various jumper"}, {"Time_Start": 1060.0, "Time_End": 1064.74, "Text": " settings, like I pointed out earlier, with the caller ID boxes for the hardware configuring."}, {"Time_Start": 1064.76, "Time_End": 1073.76, "Text": " for the components. They could have diodes between them. They could be tied directly to the 5 volts supply to tie them high or straight to the ground to tie them low."}, {"Time_Start": 1073.76, "Time_End": 1078.76, "Text": " They could even be not soldered to anything at all in order to disable them."}, {"Time_Start": 1078.76, "Time_End": 1082.76, "Text": " They could have diodes in either direction. It all depends on how the chip was designed in the first place."}, {"Time_Start": 1082.76, "Time_End": 1093.76, "Text": " As to how to find this out, you can contact the manufacturer who had originally made the chip, especially if it's a commonly available one that is meant to be used for all sorts of devices."}, {"Time_Start": 1093.76, "Time_End": 1095.76, "Text": " and get the data sheets on it."}, {"Time_Start": 1097.76, "Time_End": 1101.76, "Text": " Zero-oam resistors, I found they come in all sizes."}, {"Time_Start": 1101.76, "Time_End": 1104.76, "Text": " I've had very large ones, almost the size of my pinky fingernail,"}, {"Time_Start": 1104.76, "Time_End": 1106.76, "Text": " all the way down to extremely small ones."}, {"Time_Start": 1106.76, "Time_End": 1110.76, "Text": " Usually, I found them to be black with zeros print all across it,"}, {"Time_Start": 1110.76, "Time_End": 1113.76, "Text": " or green with zeros all across it, or even blank."}, {"Time_Start": 1113.76, "Time_End": 1117.76, "Text": " And even I found a few blue ones as well, they are totally blank,"}, {"Time_Start": 1117.76, "Time_End": 1120.76, "Text": " and have zero-ooms of resistance, and they are not capacitors or diodes."}, {"Time_Start": 1120.76, "Time_End": 1122.76, "Text": " I've checked them all over."}, {"Time_Start": 1122.76, "Time_End": 1123.76, "Text": " So they could look like a lot."}, {"Time_Start": 1123.76, "Time_End": 1125.76, "Text": " almost anything."}, {"Time_Start": 1125.76, "Time_End": 1130.76, "Text": " Surface-mount diodes come in all sorts of shapes, sizes, and colors as well."}, {"Time_Start": 1130.76, "Time_End": 1136.76, "Text": " And ranging from the cylindrical kind that is glass like the old kind with the through hole leads,"}, {"Time_Start": 1136.76, "Time_End": 1140.76, "Text": " all the up to surface-mount ones, even three lead ones that have both the anodes tied together"}, {"Time_Start": 1140.76, "Time_End": 1142.76, "Text": " and the cathodes tied together at one end."}, {"Time_Start": 1142.76, "Time_End": 1145.76, "Text": " Although those aren't very common, you do find them here and there."}, {"Time_Start": 1145.76, "Time_End": 1149.76, "Text": " It's used for configurations such as in a few models of ham radio."}, {"Time_Start": 1153.76, "Time_End": 1157.76, "Text": " most common places I found these to be used all over the place is for radio scanners"}, {"Time_Start": 1157.76, "Time_End": 1163.76, "Text": " and police scanners, as many of you people out there know, for how to modify police scanners,"}, {"Time_Start": 1163.76, "Time_End": 1167.76, "Text": " to let them do cell phones, or things like that."}, {"Time_Start": 1167.76, "Time_End": 1174.76, "Text": " Sodder pads, zero-oam resistors, diodes, and loops of wire are also extremely common."}, {"Time_Start": 1174.76, "Time_End": 1177.76, "Text": " The loops of wire one is a pretty interesting one I'll point out later."}, {"Time_Start": 1177.76, "Time_End": 1180.76, "Text": " Undocumented pins on the CPU, as mentioned earlier."}, {"Time_Start": 1180.76, "Time_End": 1183.74, "Text": " There's also secret codes you can enter in on the keypad on a few"}, {"Time_Start": 1183.76, "Time_End": 1194.76, "Text": " models and even computer interface systems are another vulnerability to let you enable your piece of equipment to do all sorts of other interesting little things."}, {"Time_Start": 1194.76, "Time_End": 1203.76, "Text": " For ham radios and police scanners, as mentioned earlier, solder pads, zero-home resistors, diodes, and now loops of wire are used."}, {"Time_Start": 1203.76, "Time_End": 1206.76, "Text": " Loops of wire were actually kind of short-lived, don't know if they're still there or not."}, {"Time_Start": 1206.76, "Time_End": 1212.76, "Text": " The reason why loops of wire were used is because it was meant to be performed by the user after it was sold."}, {"Time_Start": 1212.76, "Time_End": 1218.76, "Text": " The Unidin Corporation is the one who made the Pro 2026."}, {"Time_Start": 1218.76, "Time_End": 1223.76, "Text": " That has a small loop of wire right behind the display labeled L201."}, {"Time_Start": 1223.76, "Time_End": 1227.76, "Text": " It's just a single arch that comes right off the small daughter board, right back down."}, {"Time_Start": 1227.76, "Time_End": 1233.76, "Text": " You take that wire, cut it, reassemble your police scanner, reset it, and presto."}, {"Time_Start": 1233.76, "Time_End": 1236.76, "Text": " You now have the ability to listen to cell phones."}, {"Time_Start": 1236.76, "Time_End": 1241.76, "Text": " It's kind of the ham radio, the scanner company's way of thumbing their nose at the FCC."}, {"Time_Start": 1241.76, "Time_End": 1244.9, "Text": " Thumbing there knows that the FCC, when the FCC said you cannot have cell phone anymore,"}, {"Time_Start": 1245.2, "Time_End": 1250.32, "Text": " he said, okay, our radios will be sold with cell phone frequencies currently blocked."}, {"Time_Start": 1250.8799999999999, "Time_End": 1254.96, "Text": " But of course, all you have to do is remove the certain component as opposed to adding it,"}, {"Time_Start": 1255.2, "Time_End": 1256.6, "Text": " and you can now get cell phones back."}, {"Time_Start": 1257.08, "Time_End": 1260.86, "Text": " Then the FCC turned around, went to them, said, nope, you can't even make your scanners modifiable,"}, {"Time_Start": 1261.3, "Time_End": 1262.72, "Text": " so you can't modify them anymore."}, {"Time_Start": 1263.2, "Time_End": 1266.42, "Text": " Unless you replace the CPU with one from a European model,"}, {"Time_Start": 1266.42, "Time_End": 1271.14, "Text": " or just went out and bought a European one overseas that already had the ability to listen to those"}, {"Time_Start": 1271.76, "Time_End": 1277.6, "Text": " Bands. Alinko-Ham radios are another common one. On the base models, you cut the yellow loop of wire"}, {"Time_Start": 1278.32, "Time_End": 1283.4, "Text": " and then reassemble it and reset the radio, and now you can both transmit and receive out of band"}, {"Time_Start": 1283.4, "Time_End": 1286.76, "Text": " depending upon the model. We'll depend upon what frequencies you have."}, {"Time_Start": 1287.52, "Time_End": 1292.18, "Text": " Same thing with the handheld models, they have two loops of wire, both a red and a blue one. Cut the blue one,"}, {"Time_Start": 1292.18, "Time_End": 1299.64, "Text": " you can now receive out-of-band, which usually includes things like just about 10, 20 megahertz, both above and below the ham radio band,"}, {"Time_Start": 1299.64, "Time_End": 1305.0400000000002, "Text": " depending upon if it's 2 meter or if it's 70 centimeter, and you cut the red wire,"}, {"Time_Start": 1305.16, "Time_End": 1306.76, "Text": " and you can now do Mars cap as well."}, {"Time_Start": 1308.1200000000001, "Time_End": 1312.94, "Text": " You can also, with many of the Elinko ones, when you enable the out-of-band reception, you can now listen"}, {"Time_Start": 1312.94, "Time_End": 1318.44, "Text": " to AM aircraft frequencies as well, indicating a whole new stage of circuits, which normally"}, {"Time_Start": 1318.44, "Time_End": 1323.42, "Text": " you would not be used inside the radio. And also, of course, everyone's familiar with the Yasu FT50,"}, {"Time_Start": 1323.72, "Time_End": 1329.5200000000002, "Text": " who here isn't. It has one single blob of solder behind the keypad, remove the keypad, remove the"}, {"Time_Start": 1329.64, "Time_End": 1335.8200000000002, "Text": " reset the radio, it's modifiable. In many cases, the ham radio companies"}, {"Time_Start": 1335.8200000000002, "Time_End": 1340.38, "Text": " actually want the customers to be able to modify the radios themselves. A few"}, {"Time_Start": 1340.38, "Time_End": 1344.94, "Text": " companies for certain models would actually send you out the various components"}, {"Time_Start": 1344.94, "Time_End": 1349.0200000000002, "Text": " you'd either add or remove or give you instructions on it if you proved you had a"}, {"Time_Start": 1349.0200000000002, "Time_End": 1354.24, "Text": " Mars cap permit. What that would let them do is that would remove the work from them."}, {"Time_Start": 1354.24, "Time_End": 1359.6200000000001, "Text": " Since 99% of the time the mod would work quite well. And of course if it didn't work,"}, {"Time_Start": 1359.64, "Time_End": 1363.8400000000001, "Text": " what you could do is contact them, send it in, and they will service it under the warranty,"}, {"Time_Start": 1363.94, "Time_End": 1367.64, "Text": " even though you've opened it up and modified it, as long as you can prove you have the Mars Cap permits."}, {"Time_Start": 1371.0800000000002, "Time_End": 1378.46, "Text": " For radio scanners, the Pro 43 shows some of the most common jumpers and configurations out there."}, {"Time_Start": 1378.8200000000002, "Time_End": 1386.5800000000002, "Text": " Diode 1 either enables or disables the key lock switch. I think this was probably added for OEM use"}, {"Time_Start": 1386.5800000000002, "Time_End": 1389.6200000000001, "Text": " for ones that they would not want to have the key lock switch."}, {"Time_Start": 1389.64, "Time_End": 1395.4, "Text": " keypad modified or touched or anything like that. So just be stuck at certain frequencies."}, {"Time_Start": 1397.3200000000002, "Time_End": 1402.68, "Text": " Diod 2 would enable the 30 to 54 megahertz coverage. If it was there, you can listen to those"}, {"Time_Start": 1402.68, "Time_End": 1407.0400000000002, "Text": " and tune to frequencies within that band. If it's removed, you cannot talk to, you cannot listen"}, {"Time_Start": 1407.0400000000002, "Time_End": 1414.1000000000001, "Text": " to stuff within that band. Same thing with diode 3, which in for Europe, 30 to 54 is television signals"}, {"Time_Start": 1414.1000000000001, "Time_End": 1419.2, "Text": " over there, while here in the United States 66 to 88 megahertz is television signals."}, {"Time_Start": 1419.64, "Time_End": 1421.3600000000001, "Text": " So there's no point in tuning in those frequencies."}, {"Time_Start": 1421.66, "Time_End": 1424.7800000000002, "Text": " So that's why they can configure between those two for the different markets."}, {"Time_Start": 1425.3000000000002, "Time_End": 1430.3000000000002, "Text": " And by putting in both diodes in those locations, you can tune in both areas of those frequencies."}, {"Time_Start": 1433.1000000000001, "Time_End": 1437.72, "Text": " Diode 4 would either block the cellular bands or allow the cellular bands."}, {"Time_Start": 1438.22, "Time_End": 1441.8400000000001, "Text": " And, of course, they'd make it so all you had to do was remove the component quite conveniently,"}, {"Time_Start": 1442.44, "Time_End": 1444.1200000000001, "Text": " and you can now listen to such frequencies."}, {"Time_Start": 1444.22, "Time_End": 1448.4, "Text": " With surface mount components, most people would either crush or destroy the component on the board"}, {"Time_Start": 1448.4, "Time_End": 1454.48, "Text": " without having to get out of soldering iron, or actually take the time to desoder it"}, {"Time_Start": 1454.48, "Time_End": 1459.96, "Text": " and place it into another location to enable, for instance, 66 to 88 megahertz range."}, {"Time_Start": 1460.3400000000001, "Time_End": 1466.46, "Text": " On most other police scanners, there's a single diode in place of diode 2 and diode 3 that are the"}, {"Time_Start": 1466.46, "Time_End": 1472.52, "Text": " switches between the 30 to 54 megahertz range or the 66 to 88 megahertz range, whether it's"}, {"Time_Start": 1472.52, "Time_End": 1478.38, "Text": " there or not. The only problem with listening to these frequencies, when comparing to 30,"}, {"Time_Start": 1478.4, "Time_End": 1486.0400000000002, "Text": " to 54 megahertz or the 66 to 88 megahertz range, is the electronics are not designed to tune in 66 to 88 megahertz."}, {"Time_Start": 1486.5, "Time_End": 1491.5800000000002, "Text": " So you can listen to stuff there if someone is actually transmitting there, but the reception will be quite poor"}, {"Time_Start": 1491.5800000000002, "Time_End": 1495.7, "Text": " without a lot of readjustments and a lot of replacement of the components."}, {"Time_Start": 1496.26, "Time_End": 1498.0400000000002, "Text": " But still, it's just nice to have that feature added."}, {"Time_Start": 1498.8400000000001, "Time_End": 1504.18, "Text": " And of course, diode 5 would change the stepping range of the cellular telephone frequencies."}, {"Time_Start": 1504.18, "Time_End": 1507.98, "Text": " In Europe, since the cell phones use a totally different frequency plan,"}, {"Time_Start": 1508.4, "Time_End": 1514.0800000000002, "Text": " What they do is for that area, they would have 12.5 kilohertz steps in between the frequencies."}, {"Time_Start": 1514.88, "Time_End": 1519.02, "Text": " So you can listen to, like, the police, or whatever they would have over there,"}, {"Time_Start": 1519.8600000000001, "Time_End": 1521.18, "Text": " depending upon your area or whatnot."}, {"Time_Start": 1521.38, "Time_End": 1527.16, "Text": " But in America, they use 30 kilohertz steps for the analog cell phones in those frequency bands."}, {"Time_Start": 1528.74, "Time_End": 1533.52, "Text": " The thing about that is they'd want to have the frequency jumps in between the two frequencies"}, {"Time_Start": 1533.52, "Time_End": 1536.8000000000002, "Text": " for the stepping range configurable for the various markets."}, {"Time_Start": 1538.4, "Time_End": 1543.66, "Text": " Another idea with sticking the wires straight onto the solder pads or whatever"}, {"Time_Start": 1543.66, "Time_End": 1547.22, "Text": " configuration point and sticking them up and touching them together is you can touch together"}, {"Time_Start": 1547.22, "Time_End": 1553.22, "Text": " combinations of resistors, diodes or whatnot, that were not meant to be crossed over to"}, {"Time_Start": 1553.22, "Time_End": 1558.6200000000001, "Text": " possibly make use of various bugs within the firmware designed inside the chip."}, {"Time_Start": 1558.6200000000001, "Time_End": 1564.8400000000001, "Text": " With the Pro 4D3, when you add a diode and cross it between the cathode of diode 1 to the"}, {"Time_Start": 1564.8400000000001, "Time_End": 1570.66, "Text": " anode of the slot for diode 5, when you step up or down, the police scanner will"}, {"Time_Start": 1570.66, "Time_End": 1576.2400000000002, "Text": " now jump very large steps. This would override and jump over the frequencies that would"}, {"Time_Start": 1576.2400000000002, "Time_End": 1580.5600000000002, "Text": " normally block at each end of, let's say, the 66 to 88 megahertz range. When it"}, {"Time_Start": 1580.5600000000002, "Time_End": 1587.7, "Text": " tries to go below 66 megahertz, it'll only skip over to the next frequency that would"}, {"Time_Start": 1587.7, "Time_End": 1591.9, "Text": " be available, either below or above it. But, because it's now jumping over that"}, {"Time_Start": 1591.9, "Time_End": 1596.8000000000002, "Text": " frequency by stepping in a manner that would be larger than it's supposed to, it"}, {"Time_Start": 1596.8000000000002, "Time_End": 1600.72, "Text": " jumps straight past that blocking frequency and into a range that normally you wouldn't be"}, {"Time_Start": 1600.72, "Time_End": 1605.16, "Text": " able to get access to. At that point you can then open up the squelch as if you got a signal"}, {"Time_Start": 1605.16, "Time_End": 1609.72, "Text": " and save the frequency wherever you wanted to. This will let you open up the entire"}, {"Time_Start": 1609.72, "Time_End": 1617.94, "Text": " police scanner from 0.5 mega, 0.5 kilohertz all the way up to 99.99.99 megahertz."}, {"Time_Start": 1621.9, "Time_End": 1630.52, "Text": " With the Pro 23, 25, 46, and 51 handheld scanners, which were made by Unison, along with"}, {"Time_Start": 1630.52, "Time_End": 1634.5600000000002, "Text": " various other Unidon radios, depending upon what model number they made them under, there's all"}, {"Time_Start": 1634.5600000000002, "Time_End": 1638.66, "Text": " sorts of keypad tricks for holding down buttons on it and turning it down. The instructions"}, {"Time_Start": 1638.66, "Time_End": 1643.8400000000001, "Text": " actually says hold down the 2, the 9 key while turned on your power, and the radio is totally"}, {"Time_Start": 1643.8400000000001, "Time_End": 1648.98, "Text": " reset. All your frequencies are lost. But if you hold down 2, 9, and the lockout keys when"}, {"Time_Start": 1648.98, "Time_End": 1651.88, "Text": " turning on, you now erase all the memory."}, {"Time_Start": 1651.9, "Time_End": 1656.5800000000002, "Text": " and you fill the memory banks with 1 through 25 of test frequencies."}, {"Time_Start": 1657.14, "Time_End": 1661.94, "Text": " 2.9 and manual does totally different test frequencies than 2.9 in lockout,"}, {"Time_Start": 1662.0600000000002, "Time_End": 1665.0600000000002, "Text": " and only 1 through 7 are filled with these test frequencies for workbench use."}, {"Time_Start": 1665.76, "Time_End": 1670.74, "Text": " 2.9 in the band button or 2.9 and the monitor button will do a display test,"}, {"Time_Start": 1670.88, "Time_End": 1674.5400000000002, "Text": " which will cycle through all the various characters on the display useful if you've ripped the thing apart"}, {"Time_Start": 1674.5400000000002, "Time_End": 1677.76, "Text": " or rebuilt it or somehow fixed it up, combine it with other parts."}, {"Time_Start": 1677.8200000000002, "Time_End": 1679.74, "Text": " You want to see if the display works properly."}, {"Time_Start": 1681.9, "Time_End": 1689.14, "Text": " The cool thing about the 2-9 and lockout is, as I stated before, with the Pro 43,"}, {"Time_Start": 1689.3200000000002, "Time_End": 1694.66, "Text": " when it jumps outside of its normal range, you already get frequencies right here that are outside"}, {"Time_Start": 1694.66, "Time_End": 1697.38, "Text": " the range, those are supposed to be able to tune on these scanners."}, {"Time_Start": 1697.8400000000001, "Time_End": 1702.18, "Text": " So without even opening it up, without even hardware configuring it or anything like that,"}, {"Time_Start": 1702.24, "Time_End": 1705.14, "Text": " you already have frequencies that are outside the normal range."}, {"Time_Start": 1705.66, "Time_End": 1708.96, "Text": " And all you have to do is go to these frequencies and tell it to search up or search down,"}, {"Time_Start": 1709.9, "Time_End": 1711.88, "Text": " and it'll already be outside of those."}, {"Time_Start": 1711.9, "Time_End": 1716.22, "Text": " inside of those bands, and you could go to the extremes of it and store those frequencies"}, {"Time_Start": 1716.22, "Time_End": 1717.74, "Text": " elsewhere in other memory areas."}, {"Time_Start": 1718.7800000000002, "Time_End": 1724.46, "Text": " 14, 15, and 16 are in the 66 to 88 megahertz range, and 23, as you can see, is within the cellular"}, {"Time_Start": 1724.46, "Time_End": 1729.1000000000001, "Text": " telephone range. That will let you listen to cell phones. All you have to do is go to the upper and"}, {"Time_Start": 1729.1000000000001, "Time_End": 1734.22, "Text": " lower limits, and you could pretty much have a blast, listen to whatever analog cell phones you want"}, {"Time_Start": 1734.22, "Time_End": 1738.22, "Text": " to, until, of course, the cell phone companies decide to totally abolish analog cell phones altogether."}, {"Time_Start": 1741.9, "Time_End": 1746.7, "Text": " For ham radios, some of the most common ones are the Mars cap, which is extended transmittabilities."}, {"Time_Start": 1748.8000000000002, "Time_End": 1753.0, "Text": " Certain forms of extended reception, such as AM aircraft, like with the Alinko's,"}, {"Time_Start": 1753.74, "Time_End": 1756.38, "Text": " cellular, VHF, UHF, and even 800 megahertz."}, {"Time_Start": 1756.5, "Time_End": 1761.64, "Text": " With some radios, they would actually ship them with the 800 megahertz range allowed,"}, {"Time_Start": 1761.76, "Time_End": 1763.5600000000002, "Text": " and all the electronics necessary to tune it."}, {"Time_Start": 1764.1200000000001, "Time_End": 1769.88, "Text": " And all you have to do is clip a wire or otherwise modify it by changing diode configurations and resistor configurations,"}, {"Time_Start": 1770.52, "Time_End": 1771.88, "Text": " and you can now listen to 800 megahertz."}, {"Time_Start": 1771.9, "Time_End": 1779.0600000000002, "Text": " The reason why they even do this is because in order to receive out of band, it requires further FCC approval and certification."}, {"Time_Start": 1779.66, "Time_End": 1784.6200000000001, "Text": " So they ship it purposely crippled and let the user modify it to enable those added features."}, {"Time_Start": 1784.74, "Time_End": 1793.3000000000002, "Text": " They say, well, it's not FCC approved, though, but I'd seriously doubt the FCC is going to raid your place and kick down the door because you're now listening to the police on 155 megahertz,"}, {"Time_Start": 1793.8200000000002, "Time_End": 1795.2800000000002, "Text": " which is outside your ham radio range."}, {"Time_Start": 1796.0600000000002, "Time_End": 1798.68, "Text": " But you never know. They could, but still bust you for that kind of stuff."}, {"Time_Start": 1799.52, "Time_End": 1801.88, "Text": " Features for specific countries, such as their transmit and transmit and resharts."}, {"Time_Start": 1801.9, "Time_End": 1806.72, "Text": " receive ranges, repeater tone control, repeater offsets, and various other features"}, {"Time_Start": 1806.72, "Time_End": 1809.3200000000002, "Text": " for specific countries."}, {"Time_Start": 1809.3200000000002, "Time_End": 1814.0, "Text": " And for the model configurations, there are certain pieces of hardware that are or not available,"}, {"Time_Start": 1814.0, "Time_End": 1820.2, "Text": " such as with some of the radios, the 800 megahertz range, dual band, such as 70"}, {"Time_Start": 1820.2, "Time_End": 1827.1200000000001, "Text": " centimeter versus 2 meter, which as they'd use the same CPU, but certain pins would tell the"}, {"Time_Start": 1827.1200000000001, "Time_End": 1831.88, "Text": " CPU what model of radio it's in, indicating what frequencies you can tune."}, {"Time_Start": 1831.9, "Time_End": 1835.9, "Text": " into. Mars cap, as many of you people out there, have probably modified"}, {"Time_Start": 1835.9, "Time_End": 1845.9, "Text": " ham radios, know, is a feature which, as an acronym, many of you people have heard, but still don't know what it means."}, {"Time_Start": 1845.9, "Time_End": 1849.9, "Text": " Military-assisted radio service is what Mars stands for."}, {"Time_Start": 1849.9, "Time_End": 1856.9, "Text": " It's a service that, where ham radios users apply their services and apply their hardware to patch telephone calls in"}, {"Time_Start": 1856.9, "Time_End": 1861.88, "Text": " wartime emergencies, disaster areas, and things like that. Civil Air Force"}, {"Time_Start": 1861.9, "Time_End": 1871.9, "Text": " was started back in World War II with civilian aircraft spotting German U-boats off the East Coast, and they're still used nowadays."}, {"Time_Start": 1871.9, "Time_End": 1877.9, "Text": " You never know when it might be needed if we ever go to nuclear war, someone might need to spot a nuclear bomb 30 seconds before it hits the ground."}, {"Time_Start": 1877.9, "Time_End": 1882.9, "Text": " Search and rescue is also what it's used for as well, which I was about to cover."}, {"Time_Start": 1882.9, "Time_End": 1884.9, "Text": " A friend of mine is in as well."}, {"Time_Start": 1884.9, "Time_End": 1891.88, "Text": " And these bands are generally 130 to 170 megahertz or 150"}, {"Time_Start": 1891.9, "Time_End": 1897.16, "Text": " to 170 makers, sometimes more, sometimes less, depending upon what the ham radio companies"}, {"Time_Start": 1897.16, "Time_End": 1904.6200000000001, "Text": " decided to manufacture in. One of the other things I've found is, especially if you're into"}, {"Time_Start": 1904.6200000000001, "Time_End": 1909.16, "Text": " Mars Cap, like a friend of mine is, and needed to modify one of his ham radios. He frequently"}, {"Time_Start": 1909.16, "Time_End": 1914.94, "Text": " loaned it to someone else and was constantly afraid of this person using and abusing the out-of-band"}, {"Time_Start": 1914.94, "Time_End": 1920.5, "Text": " transmitt abilities, which of course he wasn't supposed to let that person use it. With many of these"}, {"Time_Start": 1920.5, "Time_End": 1924.94, "Text": " ham radios, you have to reset the radio with a keypad combination or something like that"}, {"Time_Start": 1924.94, "Time_End": 1931.62, "Text": " in order to complete the modification. So what you do is you modify the hardware, cut the wire,"}, {"Time_Start": 1932.22, "Time_End": 1938.8, "Text": " remove the diode or whatnot to actually modify it, reset the radio, and then unmodify the hardware,"}, {"Time_Start": 1939.3, "Time_End": 1944.78, "Text": " but don't reset the radio for that last final little stage. That would pretty much not finalize"}, {"Time_Start": 1944.78, "Time_End": 1950.4, "Text": " the mod and it could still work in the Mars cap range, but all you have to do is reset the radio,"}, {"Time_Start": 1950.5, "Time_End": 1954.5, "Text": " and the radio is now restored back to its original factory configuration."}, {"Time_Start": 1954.5, "Time_End": 1961.5, "Text": " And you can go ahead and loan it out to your friend at that point and let him use it without the ability of him to use it."}, {"Time_Start": 1961.5, "Time_End": 1968.5, "Text": " One of the things out there that I have found is software hacks."}, {"Time_Start": 1968.5, "Time_End": 1973.5, "Text": " With many of the ham radios and radio scanners having computer interfaces available for them,"}, {"Time_Start": 1973.5, "Time_End": 1979.5, "Text": " this lets you do all sorts of really interesting things, which with many of the early radios,"}, {"Time_Start": 1979.5, "Time_End": 1985.96, "Text": " early radios, you could actually take advantage of this, such as with the FT50, for example."}, {"Time_Start": 1985.96, "Time_End": 1991.42, "Text": " What you can do is hex edit the save data files in the case of if the save data file is basically"}, {"Time_Start": 1991.42, "Time_End": 1998.46, "Text": " a direct memory dump of all the information inside the radio scanners either RAM or EEPROM"}, {"Time_Start": 1998.46, "Time_End": 2002.22, "Text": " memory, just dumps it all out as a computer file, is what the software does."}, {"Time_Start": 2002.22, "Time_End": 2006.3, "Text": " You can then go in with the hex editor change, various information such as letting you go out"}, {"Time_Start": 2006.3, "Time_End": 2009.48, "Text": " of band or things like that, and then re-upload it to the radio."}, {"Time_Start": 2009.5, "Time_End": 2013.24, "Text": " This can also be used for hardware configurations and whatnot."}, {"Time_Start": 2013.24, "Time_End": 2017.38, "Text": " You can intercept or emulate the data transfers by writing your own custom software to let"}, {"Time_Start": 2017.38, "Time_End": 2024.44, "Text": " you do these various things, or even, if it's possible, direct edit the device's device's"}, {"Time_Start": 2024.44, "Time_End": 2028.56, "Text": " e-e-prom or RAM memory with an in-circuit reader-writer."}, {"Time_Start": 2028.56, "Time_End": 2031.16, "Text": " Of course, that would be pretty darn complex, and I would love to see someone out there"}, {"Time_Start": 2031.16, "Time_End": 2037.0, "Text": " design that, but that's beyond my abilities."}, {"Time_Start": 2037.0, "Time_End": 2041.0, "Text": " .GIF is a file I commonly use on some of the websites I designed. It's basically"}, {"Time_Start": 2041.0, "Time_End": 2046.24, "Text": " a one-pixel-by-one-1-pixel transparent GIF. This gives you an idea of what a hex file looks"}, {"Time_Start": 2046.24, "Time_End": 2050.74, "Text": " like or what a computer file looks like when you view it in its hexadecimal form, which is how"}, {"Time_Start": 2050.74, "Time_End": 2056.26, "Text": " the computer sees it. For the RDF file that the FD50 uses for the saved data configuration,"}, {"Time_Start": 2057.52, "Time_End": 2065.74, "Text": " you can see a 5E3 hex at that specific spot in memory is where the configuration for the hardware is,"}, {"Time_Start": 2065.7400000000002, "Time_End": 2067.7200000000003, "Text": " what country code it's configured for."}, {"Time_Start": 2068.1600000000003, "Time_End": 2074.94, "Text": " This is also backed up at C-E-7H as well, which is the hex addresses for where those are."}, {"Time_Start": 2075.46, "Time_End": 2079.6600000000003, "Text": " What you can do is these two cannot be modified at the same time."}, {"Time_Start": 2079.7200000000003, "Time_End": 2082.6200000000003, "Text": " You can't modify these and send it out to the radio because the radio will check that"}, {"Time_Start": 2082.6200000000003, "Time_End": 2086.6400000000003, "Text": " and say, whoops, you're trying to upload a file meant for a totally different radio."}, {"Time_Start": 2086.76, "Time_End": 2089.3, "Text": " I'm not going to allow that and give you an error message on the display."}, {"Time_Start": 2089.96, "Time_End": 2095.48, "Text": " But what you can do is change the first one around and then upload the file to"}, {"Time_Start": 2095.48, "Time_End": 2099.66, "Text": " the radio at that point, and what it would do is"}, {"Time_Start": 2099.66, "Time_End": 2103.12, "Text": " the radio will accept it and look at only at the second one and say,"}, {"Time_Start": 2103.54, "Time_End": 2107.58, "Text": " okay, I'm supposed to accept you. And now it will change itself around, so it'll be, for"}, {"Time_Start": 2107.58, "Time_End": 2111.48, "Text": " instance, if you change it over to 2hex, you'll now have a different"}, {"Time_Start": 2111.48, "Time_End": 2112.96, "Text": " country code programmed into it."}, {"Time_Start": 2114.4, "Time_End": 2117.7400000000002, "Text": " And then when you redownload the radio, both of those memory spots will be"}, {"Time_Start": 2117.7400000000002, "Time_End": 2118.92, "Text": " zero two hex."}, {"Time_Start": 2122.98, "Time_End": 2125.46, "Text": " When it comes to save data files, one thing"}, {"Time_Start": 2125.48, "Time_End": 2129.2400000000002, "Text": " that they like to do is put in check sums to tell if the file is corrupted or not"}, {"Time_Start": 2129.2400000000002, "Time_End": 2131.1, "Text": " or if the user has modified it themselves."}, {"Time_Start": 2132.42, "Time_End": 2137.36, "Text": " As you can see, this is kind of a simplified version of check sums right here, which is a simple"}, {"Time_Start": 2137.36, "Time_End": 2144.22, "Text": " summing method where you add all the hex characters up, and you end up with a single digit to tell"}, {"Time_Start": 2144.22, "Time_End": 2147.6, "Text": " if it's been modified or not, or if it's been damaged or otherwise corrupted."}, {"Time_Start": 2149.18, "Time_End": 2153.08, "Text": " As to what kind of check summing is used, some of the programmers can get really bored"}, {"Time_Start": 2153.08, "Time_End": 2155.46, "Text": " and use all kinds of weird things, even quantum math,"}, {"Time_Start": 2155.48, "Time_End": 2158.58, "Text": " if they wanted to, to form some hundred character check sum."}, {"Time_Start": 2159.88, "Time_End": 2163.84, "Text": " It could happen, but the most common find is just simply summing it all together."}, {"Time_Start": 2166.12, "Time_End": 2173.64, "Text": " As you can see right here, when this one goes up to two hex, the check sum goes up one as well."}, {"Time_Start": 2174.06, "Time_End": 2178.6, "Text": " This is almost an instant telltale sign that they're just simply using the summing method of check summing."}, {"Time_Start": 2179.2400000000002, "Time_End": 2185.36, "Text": " And as you can see, when this one goes up to 20 hex, this goes up to 50 hex, this goes up to 50 hex as well,"}, {"Time_Start": 2185.48, "Time_End": 2187.96, "Text": " makes the 10 jump."}, {"Time_Start": 2188.64, "Time_End": 2191.44, "Text": " And when this one goes down, so does this."}, {"Time_Start": 2192.06, "Time_End": 2196.68, "Text": " All you have to do is when you find out where the check sum is being stored at by changing small,"}, {"Time_Start": 2196.68, "Time_End": 2197.8, "Text": " simple bits of information."}, {"Time_Start": 2198.46, "Time_End": 2203.28, "Text": " Looking at where those changes are actually taking place at in the check sum, at that point,"}, {"Time_Start": 2203.36, "Time_End": 2204.54, "Text": " you know where the check sum is."}, {"Time_Start": 2204.58, "Time_End": 2207.62, "Text": " And when you go in and change whatever a little bit of information you want to, what frequency"}, {"Time_Start": 2207.62, "Time_End": 2211.88, "Text": " or whatnot, change the check sum equally up or down along with it."}, {"Time_Start": 2214.6, "Time_End": 2215.46, "Text": " If these are more common,"}, {"Time_Start": 2215.48, "Time_End": 2219.88, "Text": " complex form of checks summing, well, you'll have to figure that one out on your own."}, {"Time_Start": 2220.48, "Time_End": 2223.84, "Text": " Another form of data transfer that they use is they don't do a direct memory dump."}, {"Time_Start": 2224.48, "Time_End": 2229.64, "Text": " In this theoretical model, it just simply sends out a block of information saying,"}, {"Time_Start": 2229.7, "Time_End": 2231.9, "Text": " I want you to do this frequency in this memory bank."}, {"Time_Start": 2232.34, "Time_End": 2237.6, "Text": " The advantages of this are it can be a lot faster to upload the information or download the information"}, {"Time_Start": 2237.6, "Time_End": 2243.8, "Text": " to or from the police scanner or ham radio because there's a lot less information being sent into and out of it."}, {"Time_Start": 2243.8, "Time_End": 2248.96, "Text": " And as you can see right here, the first one sent out is just a simple wake up, here comes"}, {"Time_Start": 2248.96, "Time_End": 2253.4, "Text": " comes some information, sends out the various frequencies, sets channel one to be the priority"}, {"Time_Start": 2253.4, "Time_End": 2258.1400000000003, "Text": " channel, and such channels banks one and two to be scanned and all others off."}, {"Time_Start": 2258.38, "Time_End": 2261.2400000000002, "Text": " And then it tells it it's all done with the interface and go back to normal operation."}, {"Time_Start": 2263.2400000000002, "Time_End": 2272.3, "Text": " In this theoretical model, as you can see, these first characters sent out are the memory slots"}, {"Time_Start": 2272.3, "Time_End": 2273.78, "Text": " that the radio goes into for 100,"}, {"Time_Start": 2273.8, "Time_End": 2279.86, "Text": " channel police scanner. And then as you get down here, other codes are sent out to give"}, {"Time_Start": 2279.86, "Time_End": 2284.96, "Text": " it other bits of information. But what happens is you actually send out other codes, like what"}, {"Time_Start": 2284.96, "Time_End": 2292.84, "Text": " does A2 hex do, A3 hex, and other things. You can possibly get it to go into test modes, change"}, {"Time_Start": 2292.84, "Time_End": 2297.4, "Text": " the hardware, or other things, and change various other forms of configuration with it."}, {"Time_Start": 2301.0, "Time_End": 2303.78, "Text": " Direct edits of the device's memory. One thing you can"}, {"Time_Start": 2303.8, "Time_End": 2307.98, "Text": " do is, such as with the Q-Cats, if you really want to change the serial number, desotter the"}, {"Time_Start": 2307.98, "Time_End": 2313.5600000000004, "Text": " E-E-Prom chip instead of decline it, and drop it into some kind of reader-writer unit and change"}, {"Time_Start": 2313.5600000000004, "Time_End": 2318.46, "Text": " the serial number to, let's say, 0,000,000-337."}, {"Time_Start": 2318.46, "Time_End": 2325.82, "Text": " Another thing you can do is use a reader-writer to take the information, instead of directly editing"}, {"Time_Start": 2325.82, "Time_End": 2330.92, "Text": " it inside the chip, which some will let you do, save it as a file, hex-eddit it using their existing"}, {"Time_Start": 2330.92, "Time_End": 2333.78, "Text": " software to upload and download the file from your reader-writer unit."}, {"Time_Start": 2333.8, "Time_End": 2339.3, "Text": " it, hex-ed it as before, and then re-upload it to the chip and re-soddered into place."}, {"Time_Start": 2339.3, "Time_End": 2343.34, "Text": " Another thing you can do with the Q-CAD as well, which a friend just told me about a half hour"}, {"Time_Start": 2343.34, "Time_End": 2348.6200000000003, "Text": " before this little speech, is take the data line when you declaught and cut that little trace"}, {"Time_Start": 2348.6200000000003, "Time_End": 2352.52, "Text": " on the board, instead tie that trace straight to the ground."}, {"Time_Start": 2352.52, "Time_End": 2356.2000000000003, "Text": " Now, although I haven't had a chance to try that yet, he said that theoretically it should"}, {"Time_Start": 2356.2000000000003, "Time_End": 2362.7000000000003, "Text": " output all zeros instead of giving some erroneous information and errors in the serial number."}, {"Time_Start": 2362.7000000000003, "Time_End": 2371.36, "Text": " see the digital convergence company try to track a serial number with all zeros when half the country has that."}, {"Time_Start": 2371.36, "Time_End": 2375.94, "Text": " One thing you can also do as well is if someone actually goes out and takes the time to make it,"}, {"Time_Start": 2375.94, "Time_End": 2382.36, "Text": " have an in-circuit E-E-Prom reader-writer that'll let you read and write the RAM or the E-E-prom chip"}, {"Time_Start": 2382.36, "Time_End": 2387.2200000000003, "Text": " or flash memory or something like that directly inside the unit without having to desotter it"}, {"Time_Start": 2387.2200000000003, "Time_End": 2388.9800000000005, "Text": " and take it out."}, {"Time_Start": 2388.9800000000005, "Time_End": 2392.6800000000003, "Text": " Of course all this information is covered and is basically the same thing."}, {"Time_Start": 2392.7000000000003, "Time_End": 2399.8, "Text": " information as to how you'd hack digital television signals and whatnot, but it also"}, {"Time_Start": 2399.8, "Time_End": 2404.1000000000004, "Text": " applies to all sorts of other little things as well, when you mess around with smart cards"}, {"Time_Start": 2404.1000000000004, "Time_End": 2406.5600000000004, "Text": " or all sorts of things."}, {"Time_Start": 2406.5600000000004, "Time_End": 2410.32, "Text": " One thing to do is to practice with video game emulators, for example, by editing the saved game"}, {"Time_Start": 2410.32, "Time_End": 2412.32, "Text": " information that some of them have."}, {"Time_Start": 2412.32, "Time_End": 2418.88, "Text": " This lets you get some practice messing around with checksums, hex editing, finding locations to"}, {"Time_Start": 2418.88, "Time_End": 2422.6800000000003, "Text": " actually edit, things like that."}, {"Time_Start": 2422.7000000000003, "Time_End": 2426.4600000000005, "Text": " That pretty much concludes this little presentation of mine."}, {"Time_Start": 2426.4600000000005, "Time_End": 2433.6400000000003, "Text": " You can find this slideshow at this website, which I have right here, if you actually want to view it."}, {"Time_Start": 2433.6400000000003, "Time_End": 2436.94, "Text": " Along with, of course, these cute little pictures of mine, which are also my Windows wallpaper"}, {"Time_Start": 2436.94, "Time_End": 2437.94, "Text": " as well."}, {"Time_Start": 2437.94, "Time_End": 2442.76, "Text": " And although I haven't had a chance to upload this yet because I've been busy with various other"}, {"Time_Start": 2442.76, "Time_End": 2444.7000000000003, "Text": " things here at the convention, I hope to have this uploaded tonight."}, {"Time_Start": 2444.7000000000003, "Time_End": 2450.7400000000002, "Text": " So if you go to this URL like right now, it'll come up with a nice little 404 error message."}, {"Time_Start": 2450.7400000000002, "Time_End": 2452.1000000000004, "Text": " Does anyone have any questions?"}, {"Time_Start": 2452.1000000000004, "Time_End": 2452.5800000000004, "Text": " Yes, you."}, {"Time_Start": 2452.7000000000003, "Time_End": 2459.2000000000003, "Text": " Could you please repeat that?"}, {"Time_Start": 2459.2000000000003, "Time_End": 2461.7200000000003, "Text": " TradeZone.com?"}, {"Time_Start": 2461.7200000000003, "Time_End": 2462.88, "Text": " Free trade zone."}, {"Time_Start": 2462.88, "Time_End": 2464.0800000000004, "Text": " Oh, free trade zone."}, {"Time_Start": 2464.38, "Time_End": 2465.82, "Text": " I've never actually been there, yes."}, {"Time_Start": 2466.26, "Time_End": 2468.8, "Text": " Freetradezone.com might have some information as to this."}, {"Time_Start": 2469.1000000000004, "Time_End": 2474.42, "Text": " I haven't seen it myself, so I can't tell you exactly what is or is not there."}, {"Time_Start": 2474.42, "Time_End": 2477.0400000000004, "Text": " So anything else from anyone?"}, {"Time_Start": 2479.5000000000005, "Time_End": 2480.28, "Text": " Yes, you."}, {"Time_Start": 2482.7000000000003, "Time_End": 2487.4600000000005, "Text": " cell phones?"}, {"Time_Start": 2487.4600000000005, "Time_End": 2489.34, "Text": " Oh, I was going to cover that."}, {"Time_Start": 2489.34, "Time_End": 2494.84, "Text": " Cell phones, usually they have a customized chip which has everything built into it."}, {"Time_Start": 2494.84, "Time_End": 2501.26, "Text": " The code, which is stored, which is actually the computer program itself, the firmware, everything"}, {"Time_Start": 2501.26, "Time_End": 2503.0600000000004, "Text": " stored on one single chip."}, {"Time_Start": 2503.0600000000004, "Time_End": 2507.2200000000003, "Text": " Many times these chips are actually meant to be programmed only once with certain data lines"}, {"Time_Start": 2507.2200000000003, "Time_End": 2511.5200000000004, "Text": " and then tied straight to ground or something like that with the memory that's used inside them"}, {"Time_Start": 2511.5200000000004, "Time_End": 2512.6800000000003, "Text": " could be an e-e-prompt."}, {"Time_Start": 2512.7000000000003, "Time_End": 2516.84, "Text": " for firmware updates if it was ever sent back to the factory, or it could simply"}, {"Time_Start": 2516.84, "Time_End": 2521.4600000000005, "Text": " be a prom-chip, program will read-only memory, and meant only to be, have the information set"}, {"Time_Start": 2521.4600000000005, "Time_End": 2525.5200000000004, "Text": " to it once, and you cannot no longer reprogram it or anything like that."}, {"Time_Start": 2525.5200000000004, "Time_End": 2530.0200000000004, "Text": " All the other information, such as the EE Prom, which stores the ESNs and various other"}, {"Time_Start": 2530.0200000000004, "Time_End": 2535.1600000000003, "Text": " serial numbers, that is stored within the chip itself, and usually that is extremely hard"}, {"Time_Start": 2535.1600000000003, "Time_End": 2540.0600000000004, "Text": " to get to, unless you actually first modify the code to then let you get access to it."}, {"Time_Start": 2540.0600000000004, "Time_End": 2542.6800000000003, "Text": " So with the newer cell phones, it's virtually"}, {"Time_Start": 2542.7000000000003, "Time_End": 2546.0800000000004, "Text": " impossible unless you know some secret trick that I don't, but with many of the older"}, {"Time_Start": 2546.0800000000004, "Time_End": 2550.9600000000005, "Text": " cell phones, especially the ones that have the E-E-prom chips, sort of separately on the board, or"}, {"Time_Start": 2550.9600000000005, "Time_End": 2555.6000000000004, "Text": " have the ROM chip for the software, such as with the Oki-900."}, {"Time_Start": 2555.6000000000004, "Time_End": 2561.1800000000003, "Text": " You can then go through, rewrite a new firmware to the ROM chip, solder on the ROM chip, or put it"}, {"Time_Start": 2561.1800000000003, "Time_End": 2566.5400000000004, "Text": " in a socket if you're lucky enough to have a socketed, Oki-900, and then you can gain access"}, {"Time_Start": 2566.5400000000004, "Time_End": 2568.4600000000005, "Text": " to changing the ESNs."}, {"Time_Start": 2568.4600000000005, "Time_End": 2569.4600000000005, "Text": " Anything else?"}, {"Time_Start": 2569.4600000000005, "Time_End": 2570.76, "Text": " Yes, you."}, {"Time_Start": 2572.7000000000003, "Time_End": 2574.94, "Text": " Like, when you're a country code?"}, {"Time_Start": 2574.94, "Time_End": 2575.4600000000005, "Text": " Yeah."}, {"Time_Start": 2575.4600000000005, "Time_End": 2578.4600000000005, "Text": " How do you know which other bias that checks, comes off proper?"}, {"Time_Start": 2578.4600000000005, "Time_End": 2582.94, "Text": " How do you know which other bias change in the code?"}, {"Time_Start": 2582.94, "Time_End": 2588.7400000000002, "Text": " When you're changing the country code, for example, in a radio that does a direct dump of all"}, {"Time_Start": 2588.7400000000002, "Time_End": 2596.76, "Text": " of its RAM, I have only seen current, usually only the ACU radios do that, but other future ham radios"}, {"Time_Start": 2596.76, "Time_End": 2600.7200000000003, "Text": " and police scanners, now that more and more of them are coming out with computer interfaces, it all depends"}, {"Time_Start": 2600.7200000000003, "Time_End": 2602.4600000000005, "Text": " upon what the companies actually tend to do."}, {"Time_Start": 2602.7000000000003, "Time_End": 2606.7000000000003, "Text": " Most police scanners, I found all the companies try to copy each other feature-wise."}, {"Time_Start": 2606.7000000000003, "Time_End": 2609.7000000000003, "Text": " It's like what Microsoft does."}, {"Time_Start": 2609.7000000000003, "Time_End": 2611.7000000000003, "Text": " Imitation is the sincerest form of flattery."}, {"Time_Start": 2611.7000000000003, "Time_End": 2612.7000000000003, "Text": " Oops."}, {"Time_Start": 2612.7000000000003, "Time_End": 2614.7000000000003, "Text": " I mean, imitation is the sincerest form of flattery."}, {"Time_Start": 2614.7000000000003, "Time_End": 2617.7000000000003, "Text": " I mean, innovation is the sincerest form of flattering."}, {"Time_Start": 2617.7000000000003, "Time_End": 2624.7000000000003, "Text": " So, of course, that's why many of the ham radios and police scanners all use diodes,"}, {"Time_Start": 2624.7000000000003, "Time_End": 2627.7000000000003, "Text": " while many of the caller ID boxes, even ones from other companies,"}, {"Time_Start": 2627.7000000000003, "Time_End": 2630.7000000000003, "Text": " use solder pads and blobs of solder on them."}, {"Time_Start": 2630.7000000000003, "Time_End": 2632.7000000000003, "Text": " When you're directly editing the information,"}, {"Time_Start": 2632.7000000000003, "Time_End": 2637.3, "Text": " information as a saved data file with a hex editor or however you're directly editing it,"}, {"Time_Start": 2637.3, "Time_End": 2642.42, "Text": " to look for the checksum, that would be kind of hard to look for, and you'd have to change"}, {"Time_Start": 2642.42, "Time_End": 2645.5200000000004, "Text": " a lot of information around and figure out pretty much what you're doing."}, {"Time_Start": 2645.5200000000004, "Time_End": 2649.86, "Text": " Another thing you can also do is find configurations from friends in foreign countries"}, {"Time_Start": 2649.86, "Time_End": 2653.94, "Text": " and compare the information together to figure out exactly where this information is stored at"}, {"Time_Start": 2653.94, "Time_End": 2656.94, "Text": " and what bits and bytes change here and there."}, {"Time_Start": 2656.94, "Time_End": 2660.4600000000005, "Text": " It can be a lot of work figuring out where this information is stored at, though, but of course"}, {"Time_Start": 2660.4600000000005, "Time_End": 2661.7000000000003, "Text": " that's part of the fun of it as well."}, {"Time_Start": 2662.7000000000003, "Time_End": 2663.7000000000003, "Text": " Yes."}, {"Time_Start": 2663.7000000000003, "Time_End": 2672.7000000000003, "Text": " Have you ever fried a device by using experimental judgment?"}, {"Time_Start": 2672.7000000000003, "Time_End": 2675.7000000000003, "Text": " Have you ever fried something?"}, {"Time_Start": 2675.7000000000003, "Time_End": 2677.7000000000003, "Text": " By changing around the configurations?"}, {"Time_Start": 2677.7000000000003, "Time_End": 2681.7000000000003, "Text": " Not yet, but of course I'm going to one of these days."}, {"Time_Start": 2681.7000000000003, "Time_End": 2683.7000000000003, "Text": " So that's one thing to keep in mind."}, {"Time_Start": 2683.7000000000003, "Time_End": 2688.7000000000003, "Text": " When you fry your device, not if, but when, years down the road you fry your device, do not blame me"}, {"Time_Start": 2688.7000000000003, "Time_End": 2691.7000000000003, "Text": " for proceeding this information into your head."}, {"Time_Start": 2691.7000000000003, "Time_End": 2693.7000000000003, "Text": " Anything else?"}, {"Time_Start": 2693.7000000000003, "Time_End": 2694.7000000000003, "Text": " Yes?"}, {"Time_Start": 2694.7000000000003, "Time_End": 2701.7000000000003, "Text": " Because you're working with logical signals, it's not something that could do to the chip itself,"}, {"Time_Start": 2701.7000000000003, "Time_End": 2705.7000000000003, "Text": " but something else in the device that could be damaged."}, {"Time_Start": 2705.7000000000003, "Time_End": 2706.7000000000003, "Text": " Yeah."}, {"Time_Start": 2706.7000000000003, "Time_End": 2711.7000000000003, "Text": " It's not the logic level signals to cause the damage, but an effect of setting"}, {"Time_Start": 2711.7000000000003, "Time_End": 2712.7000000000003, "Text": " configuration."}, {"Time_Start": 2712.7000000000003, "Time_End": 2714.7000000000003, "Text": " Yes, good point."}, {"Time_Start": 2714.7000000000003, "Time_End": 2718.7000000000003, "Text": " By changing the configurations themselves, you might not actually fry the device directly,"}, {"Time_Start": 2718.7000000000003, "Time_End": 2721.7000000000003, "Text": " but you might tell, for instance, the CPU,"}, {"Time_Start": 2721.7000000000003, "Time_End": 2731.7000000000003, "Text": " to use a piece of hardware microchip that's not available there, and it's trying to use it and could eventually burn itself out, possibly in a matter of seconds, possibly in a matter of years."}, {"Time_Start": 2731.7000000000003, "Time_End": 2740.7000000000003, "Text": " This is a theoretical possibility, which I haven't come across yet, but it could be possible with some of the devices that are going to be released out in the future."}, {"Time_Start": 2740.7000000000003, "Time_End": 2741.7000000000003, "Text": " Yes."}, {"Time_Start": 2741.7000000000003, "Time_End": 2745.7000000000003, "Text": " Any modifications of Palm or the Palm Pilot?"}, {"Time_Start": 2745.7000000000003, "Time_End": 2751.7000000000003, "Text": " The Palm Pilot itself, no modifications that I know of, or any of the other PDA devices."}, {"Time_Start": 2751.7000000000003, "Time_End": 2761.94, "Text": " when you add, but except for adding memory, when you add memory, usually there are no resistors or solder pads or anything like that to configure or change."}, {"Time_Start": 2761.94, "Time_End": 2770.0400000000004, "Text": " The device, the CPU just simply scans what memory is and isn't available, adds it all, it says, okay, I got two megs, I got four megs, or something like that."}, {"Time_Start": 2770.2400000000002, "Time_End": 2773.1200000000003, "Text": " There could be lots of other configurations as well and ways of doing it."}, {"Time_Start": 2773.28, "Time_End": 2773.6200000000003, "Text": " Yes."}, {"Time_Start": 2777.5200000000004, "Time_End": 2780.7400000000002, "Text": " Could you please repeat that?"}, {"Time_Start": 2781.7000000000003, "Time_End": 2785.7000000000003, "Text": " Yes?"}, {"Time_Start": 2785.7000000000003, "Time_End": 2790.7000000000003, "Text": " They have a springboard on the back that allows you to attach any device that's made."}, {"Time_Start": 2790.7000000000003, "Time_End": 2797.7000000000003, "Text": " The full white papers on this is on their website, as well as all the code tools for new, for programming,"}, {"Time_Start": 2797.7000000000003, "Time_End": 2799.7000000000003, "Text": " which you might want to make."}, {"Time_Start": 2799.7000000000003, "Time_End": 2804.7000000000003, "Text": " So you can create any device that you want to input into the handspring."}, {"Time_Start": 2804.7000000000003, "Time_End": 2806.7000000000003, "Text": " Yes, the handspring."}, {"Time_Start": 2806.7000000000003, "Time_End": 2810.7000000000003, "Text": " For creating the handspring modules, what you can do is,"}, {"Time_Start": 2810.7000000000003, "Time_End": 2817.7000000000003, "Text": " is, as this individual had just pointed out, is all the specs are available for the various connectors on it,"}, {"Time_Start": 2817.7000000000003, "Time_End": 2820.7000000000003, "Text": " for what memory can be added or address ranges or things like that."}, {"Time_Start": 2820.7000000000003, "Time_End": 2826.7000000000003, "Text": " With many of the sockets, they meant for people and companies to come out with upgrades and add-ons,"}, {"Time_Start": 2826.7000000000003, "Time_End": 2828.7000000000003, "Text": " and this can be documented."}, {"Time_Start": 2828.7000000000003, "Time_End": 2831.7000000000003, "Text": " It might be difficult convincing them to tell you the information because you're not some big,"}, {"Time_Start": 2831.7000000000003, "Time_End": 2834.7000000000003, "Text": " multi-million dollar company, but in fact some private little individual."}, {"Time_Start": 2834.7000000000003, "Time_End": 2836.7000000000003, "Text": " There'll be a lot less likely to tell you."}, {"Time_Start": 2836.7000000000003, "Time_End": 2837.7000000000003, "Text": " Anything else?"}, {"Time_Start": 2837.7000000000003, "Time_End": 2838.7000000000003, "Text": " Yes."}, {"Time_Start": 2838.7000000000003, "Time_End": 2839.7000000000003, "Text": " Yes."}, {"Time_Start": 2839.7000000000003, "Time_End": 2864.7000000000003, "Text": " I've heard that the springboard is a lot on the end of the end of the screen"}, {"Time_Start": 2864.7000000000003, "Time_End": 2868.7000000000003, "Text": " Yes, as this individual had pointed out, one of the things is the handspring up."}, {"Time_Start": 2868.7000000000003, "Time_End": 2880.7000000000003, "Text": " The handspring upgrade socket is electrically seen as a PCMCI slot, even though the card design, the socket design, the pinouts, etc, are shuffled around and configured differently."}, {"Time_Start": 2880.7000000000003, "Time_End": 2886.7000000000003, "Text": " So you could possibly, if you're interested in hacking the handspring, look up the information on PCMCI slots."}, {"Time_Start": 2886.7000000000003, "Time_End": 2889.7000000000003, "Text": " Any other questions anyone might have?"}, {"Time_Start": 2889.7000000000003, "Time_End": 2891.7000000000003, "Text": " Any heckles?"}, {"Time_Start": 2891.7000000000003, "Time_End": 2896.7000000000003, "Text": " Well, that pretty much concludes my little speech. I hope you enjoyed it."}, {"Time_Start": 2898.7000000000003, "Time_End": 2905.1000000000004, "Text": " And I shall hand the mic over."}]}