{"segments": [{"Time_Start": 0.0, "Time_End": 20.0, "Text": " This is Nat for newbies and not so newbies, it's primarily a tutorial."}, {"Time_Start": 20.0, "Time_End": 25.0, "Text": " If you're looking for something else, you're in the wrong room."}, {"Time_Start": 25.0, "Time_End": 29.98, "Text": " Before we get started, a couple of things I want to"}, {"Time_Start": 30.0, "Time_End": 36.76, "Text": " I want to do rather quickly here, something I've always sort of wanted to do with a crowd"}, {"Time_Start": 36.76, "Time_End": 45.4, "Text": " like this, a special sort of DDoS, distributed denial of service thing. So everyone who has"}, {"Time_Start": 45.4, "Time_End": 52.08, "Text": " a cell phone, please take it out. We're going to try something here. Take your cell phone out,"}, {"Time_Start": 52.08, "Time_End": 57.980000000000004, "Text": " hold it up in one hand. Everybody, if you didn't bring a cell phone, you're a loser. Hold it up."}, {"Time_Start": 60.0, "Time_End": 67.0, "Text": " Hold that cell phone up. Okay, step one. Just for a moment, turn the power off."}, {"Time_Start": 69.0, "Time_End": 80.0, "Text": " Turn the power off. Okay, step two, put it in your pocket and leave it there for an hour."}, {"Time_Start": 84.0, "Time_End": 89.98, "Text": " That's the world's first do it yourself, distributed,"}, {"Time_Start": 90.0, "Time_End": 91.84, "Text": " self-denial of service."}, {"Time_Start": 97.24, "Time_End": 100.4, "Text": " A second issue. Some of you have been"}, {"Time_Start": 100.4, "Time_End": 104.9, "Text": " and know that there's this"}, {"Time_Start": 104.9, "Time_End": 108.0, "Text": " spot the Fed contest. And before"}, {"Time_Start": 108.0, "Time_End": 110.7, "Text": " 200 of you out there try to claim a free t-shirt"}, {"Time_Start": 110.7, "Time_End": 116.14, "Text": " on my appearance, I'm not a Fed, never have been."}, {"Time_Start": 116.84, "Time_End": 117.7, "Text": " It's really hot out there."}, {"Time_Start": 120.0, "Time_End": 126.64, "Text": " works so well. I know I got a monogram shirt on, but I got white socks and red"}, {"Time_Start": 128.0, "Time_End": 132.96, "Text": " Converse All-Star high tops on, so I couldn't be a Fed. So just thought I'd straighten that out."}, {"Time_Start": 135.36, "Time_End": 137.76, "Text": " I hope this continues to work. Bad batteries?"}, {"Time_Start": 150.0, "Time_End": 162.34, "Text": " one all right oh let's see it who's who's got that phone all right we're"}, {"Time_Start": 162.34, "Time_End": 167.64, "Text": " going to talk about nat which is network address translation I've been working"}, {"Time_Start": 167.64, "Time_End": 174.54, "Text": " with firewalls for a few years primarily checkpoint firewall one but network"}, {"Time_Start": 174.54, "Time_End": 179.44, "Text": " address translation is valuable with almost any firewall or almost any setup"}, {"Time_Start": 180.0, "Time_End": 185.9, "Text": " I chose this topic because in my opinion it's sort of ignored I think"}, {"Time_Start": 185.9, "Time_End": 191.46, "Text": " Nat is really useful it's essentially free it does all sorts of cool stuff it"}, {"Time_Start": 191.46, "Time_End": 195.96, "Text": " gives you all sorts of protections it's a really valuable thing in my opinion and I"}, {"Time_Start": 195.96, "Time_End": 201.42000000000002, "Text": " looking at the firewall literature I thought it wasn't being covered very well so I'm"}, {"Time_Start": 201.42000000000002, "Time_End": 207.82, "Text": " sort of an amateur at this but I think that speaks speaks well for itself here and so"}, {"Time_Start": 207.82, "Time_End": 209.98, "Text": " this is going to be two 50-minute sessions"}, {"Time_Start": 210.0, "Time_End": 214.0, "Text": " We're going to go until 350 p.m. Take a 10 minute break, come back at four."}, {"Time_Start": 214.0, "Time_End": 222.0, "Text": " I'm eager for questions. This is a tutorial. The whole point here is that you learn and that you enjoy yourselves."}, {"Time_Start": 222.0, "Time_End": 232.0, "Text": " So please, don't even do that raise your hand thing. I grew up in New Jersey. It's okay to just shout out, yo, at the top of your lungs."}, {"Time_Start": 232.0, "Time_End": 236.0, "Text": " That's not an insult. I'll be glad to stop and answer questions."}, {"Time_Start": 240.0, "Time_End": 245.2, "Text": " Here's the, I'm going to run through a quick introduction. I don't know exactly when the break is going to occur here."}, {"Time_Start": 245.8, "Time_End": 251.3, "Text": " We're going to talk about some basics of network address translation. I'm going to show you a typical NAT configuration."}, {"Time_Start": 251.3, "Time_End": 255.5, "Text": " I'm going to draw it here on the world's smallest whiteboard."}, {"Time_Start": 256.88, "Time_End": 261.24, "Text": " We're going to discuss NAT in action. I'm going to go over some of the benefits."}, {"Time_Start": 262.5, "Time_End": 266.16, "Text": " There are some special firewall configurations that I'm going to discuss."}, {"Time_Start": 267.12, "Time_End": 269.98, "Text": " Those of you who have done network address translation know."}, {"Time_Start": 270.0, "Time_End": 272.0, "Text": " that there are some special DNS issues."}, {"Time_Start": 272.0, "Time_End": 276.0, "Text": " If a single TCP IP host has multiple IP addresses,"}, {"Time_Start": 276.0, "Time_End": 280.0, "Text": " it's an interesting question, which IP address should your DNS server return?"}, {"Time_Start": 280.0, "Time_End": 282.0, "Text": " We'll talk about that."}, {"Time_Start": 282.0, "Time_End": 287.0, "Text": " Quick summary, lots of Q&A, but please don't save your questions till the end."}, {"Time_Start": 287.0, "Time_End": 289.0, "Text": " Let's hear them as we go along."}, {"Time_Start": 293.0, "Time_End": 299.0, "Text": " Some of you, this track, this talk is on the newbie track, so some of you may be wondering,"}, {"Time_Start": 299.0, "Time_End": 306.0, "Text": " you know, am I well enough qualified for this? Is this over my head? Is this basic stuff that's going to bore me?"}, {"Time_Start": 306.0, "Time_End": 312.0, "Text": " If you know some of these basic concepts, you're going to be plenty well qualified for it."}, {"Time_Start": 312.0, "Time_End": 319.0, "Text": " So if you've done some basic TCP stuff, you should be just fine."}, {"Time_Start": 319.0, "Time_End": 326.0, "Text": " If you've ever done any of these, you're more than qualified to benefit from this tutorial."}, {"Time_Start": 326.0, "Time_End": 328.98, "Text": " How many people here have configured a TCPIP host,"}, {"Time_Start": 329.0, "Time_End": 331.0, "Text": " or firewall?"}, {"Time_Start": 331.0, "Time_End": 333.0, "Text": " Knowingly configured one?"}, {"Time_Start": 333.0, "Time_End": 335.0, "Text": " Thank you."}, {"Time_Start": 335.0, "Time_End": 338.0, "Text": " Connected some LAN users to the internet."}, {"Time_Start": 338.0, "Time_End": 342.0, "Text": " Debugged an internet connectivity problem?"}, {"Time_Start": 342.0, "Time_End": 345.0, "Text": " Okay, be careful now."}, {"Time_Start": 345.0, "Time_End": 348.0, "Text": " Brought down Yahoo with a DDOS attack."}, {"Time_Start": 348.0, "Time_End": 351.0, "Text": " Okay, just a few of you."}, {"Time_Start": 351.0, "Time_End": 358.0, "Text": " Here is one possible definition of Nat."}, {"Time_Start": 358.0, "Time_End": 359.0, "Text": " I couldn't."}, {"Time_Start": 359.0, "Time_End": 363.0, "Text": " find anything official or formal on the internet anywhere, so I'm sort of making this up."}, {"Time_Start": 363.0, "Time_End": 368.0, "Text": " The assigning of two different IP addresses to the same TCP IP host,"}, {"Time_Start": 368.0, "Time_End": 373.0, "Text": " a public one to be used when accessing the host from inside the security perimeter,"}, {"Time_Start": 373.0, "Time_End": 378.0, "Text": " and a private one to be used when accessing the host from outside the security perimeter."}, {"Time_Start": 378.0, "Time_End": 385.0, "Text": " So as you all probably know, the basic concept of NAT is that you establish a security perimeter"}, {"Time_Start": 385.0, "Time_End": 388.98, "Text": " around your organization and use different IP addresses on the"}, {"Time_Start": 389.0, "Time_End": 393.0, "Text": " inside and on the outside. You need a network address translation box,"}, {"Time_Start": 393.0, "Time_End": 399.0, "Text": " a NAT box, sitting on the perimeter in order to do the intelligent translations back and forth,"}, {"Time_Start": 399.0, "Time_End": 403.0, "Text": " but this is the basic concept. If you have a better definition, I'd like to hear it,"}, {"Time_Start": 403.0, "Time_End": 405.0, "Text": " but I think this works pretty well."}, {"Time_Start": 405.0, "Time_End": 415.0, "Text": " Some basics, we're going to talk about RFC 1918, the concept of private IP addresses,"}, {"Time_Start": 415.0, "Time_End": 419.0, "Text": " and two general modes of operation for NAC."}, {"Time_Start": 419.0, "Time_End": 426.0, "Text": " that. You've all probably heard of by now the Internet Engineering Task Force."}, {"Time_Start": 426.0, "Time_End": 433.0, "Text": " They archive these things called RFCs. They are requests for comments."}, {"Time_Start": 433.0, "Time_End": 439.0, "Text": " This is the, I guess, democratic unstructured way that the Internet has developed."}, {"Time_Start": 439.0, "Time_End": 444.0, "Text": " Somebody comes up with a bright idea and posts publicly a request for comment."}, {"Time_Start": 444.0, "Time_End": 448.98, "Text": " Basically what they're saying is, I think this is a good idea. I think this is the way"}, {"Time_Start": 449.0, "Time_End": 451.0, "Text": " The world should do things."}, {"Time_Start": 451.0, "Time_End": 456.0, "Text": " I assert this is the best we've got, and I'm posting this for comments."}, {"Time_Start": 456.0, "Time_End": 462.0, "Text": " And only after it's been subjected to perhaps withering public scrutiny,"}, {"Time_Start": 462.0, "Time_End": 465.0, "Text": " do people sort of generally agree that, yeah, this works."}, {"Time_Start": 465.0, "Time_End": 474.0, "Text": " And so most of the Internet, the specifications, have been designated and cleared up and archived in these RFCs."}, {"Time_Start": 474.0, "Time_End": 478.0, "Text": " The famous one for us, in terms of network address translation, is 1918."}, {"Time_Start": 478.0, "Time_End": 485.0, "Text": " Anybody who knows Nat, anybody who can tell you the story about those funny IP addresses, 192, 168?"}, {"Time_Start": 485.0, "Time_End": 489.0, "Text": " How many people here have seen some addresses?"}, {"Time_Start": 489.0, "Time_End": 494.0, "Text": " 192, 168, and you know there's something funny about them, but you're not quite sure what it is."}, {"Time_Start": 494.0, "Time_End": 496.0, "Text": " Hands, thank you."}, {"Time_Start": 496.0, "Time_End": 503.0, "Text": " So, in 1918, address allocation for private Internet discusses some of this, but not all of it."}, {"Time_Start": 503.0, "Time_End": 506.0, "Text": " You can find them all at IETF.org."}, {"Time_Start": 506.0, "Time_End": 507.0, "Text": " There's all sorts of great stuff."}, {"Time_Start": 507.0, "Time_End": 513.0, "Text": " On a boring, rainy afternoon, it's a terrific way to learn some more things about the Internet."}, {"Time_Start": 513.0, "Time_End": 517.0, "Text": " Okay, so let's talk about private IP addresses."}, {"Time_Start": 517.0, "Time_End": 521.0, "Text": " On the bottom row there, you see the 192-168s."}, {"Time_Start": 521.0, "Time_End": 526.0, "Text": " Now, early in your careers, when messing with TCP IP and routing issues,"}, {"Time_Start": 526.0, "Time_End": 534.0, "Text": " you quickly figured out that there was something different and strange and special about those IP addresses."}, {"Time_Start": 534.0, "Time_End": 535.0, "Text": " If you were paying attention, you figured out that there was something different and strange and special about those IP addresses."}, {"Time_Start": 535.0, "Time_End": 539.0, "Text": " paying attention, you figured out that they couldn't route out to the internet."}, {"Time_Start": 539.0, "Time_End": 547.0, "Text": " These are three different classes of IP address blocks that have been reserved and are private."}, {"Time_Start": 547.0, "Time_End": 550.0, "Text": " One of them is a class A block, the tens."}, {"Time_Start": 550.0, "Time_End": 556.0, "Text": " So if you ever see any IP addresses starting with 10, you know that these are private."}, {"Time_Start": 556.0, "Time_End": 558.0, "Text": " They're non-routable on the internet."}, {"Time_Start": 558.0, "Time_End": 562.0, "Text": " We'll talk about some of these special characteristics here in a minute."}, {"Time_Start": 562.0, "Time_End": 564.98, "Text": " This is particularly nice because"}, {"Time_Start": 565.0, "Time_End": 567.0, "Text": " because you've got 16 million IP addresses,"}, {"Time_Start": 567.0, "Time_End": 570.0, "Text": " and you can use this, no matter how big your organization is,"}, {"Time_Start": 570.0, "Time_End": 574.0, "Text": " you can use the 10 block to help get things structured internally."}, {"Time_Start": 574.0, "Time_End": 578.0, "Text": " The Class B blocks, which are the toughest trivia question here,"}, {"Time_Start": 578.0, "Time_End": 581.0, "Text": " ask somebody what are the Class B private address blocks?"}, {"Time_Start": 581.0, "Time_End": 584.0, "Text": " 17216 through 17231."}, {"Time_Start": 584.0, "Time_End": 589.0, "Text": " There are 16 Class B blocks available, each of which has 64,000 IP addresses."}, {"Time_Start": 589.0, "Time_End": 594.0, "Text": " And there are 256 class C blocks, each of which has 256 IP."}, {"Time_Start": 594.0, "Time_End": 596.0, "Text": " IP addresses."}, {"Time_Start": 596.0, "Time_End": 601.0, "Text": " So you should know if you ever see any host with these IP addresses"}, {"Time_Start": 601.0, "Time_End": 603.0, "Text": " that there's something special going on."}, {"Time_Start": 603.0, "Time_End": 605.0, "Text": " These are private IP addresses."}, {"Time_Start": 605.0, "Time_End": 607.0, "Text": " They are non-routable on the Internet,"}, {"Time_Start": 607.0, "Time_End": 610.0, "Text": " and we'll talk about some of the special characteristics here."}, {"Time_Start": 610.0, "Time_End": 614.0, "Text": " These private addresses are reserved"}, {"Time_Start": 614.0, "Time_End": 619.0, "Text": " and that they'll never be assigned to someone in the global Internet routing scheme."}, {"Time_Start": 619.0, "Time_End": 623.0, "Text": " There is no host out there at 192168."}, {"Time_Start": 623.0, "Time_End": 627.0, "Text": " 168 on the internet somewhere. None. There are none."}, {"Time_Start": 627.0, "Time_End": 635.0, "Text": " In fact, every router on the internet is required to drop all packets addressed to any IP address in these blocks."}, {"Time_Start": 635.0, "Time_End": 637.0, "Text": " So you don't have to worry about it."}, {"Time_Start": 637.0, "Time_End": 645.0, "Text": " So if you're on your corporate land and you know there's a web server that you're using at 10.1.1.1,"}, {"Time_Start": 645.0, "Time_End": 647.0, "Text": " what does that say to you?"}, {"Time_Start": 647.0, "Time_End": 652.0, "Text": " Well, the immediate conclusion you can come to is that, well, that must be internal to my corporation somewhere."}, {"Time_Start": 652.0, "Time_End": 657.0, "Text": " somewhere because you know for a fact it can't be over the internet because you can't get to it."}, {"Time_Start": 657.0, "Time_End": 664.0, "Text": " So it's nice that you never have to worry about a collision, you never have to worry about,"}, {"Time_Start": 664.0, "Time_End": 671.0, "Text": " well, if I make my host 10.1.1.1, oh no, have I just screwed up my routing tables?"}, {"Time_Start": 671.0, "Time_End": 673.0, "Text": " What if there is a 10.1.1.1 out there?"}, {"Time_Start": 673.0, "Time_End": 678.0, "Text": " I'm never going to be able to reach them now because, you know, I'm going to be routing back to myself."}, {"Time_Start": 678.0, "Time_End": 681.98, "Text": " So one of the benefits of having private IP addresses is you can use you"}, {"Time_Start": 682.0, "Time_End": 694.0, "Text": " use them all you want internally and you have no fear that you're going to screw up your routing tables and find yourself colliding with something that's legitimate and valid out on the Internet because you know for a fact it's not."}, {"Time_Start": 694.0, "Time_End": 703.0, "Text": " Packets with a private address destination are dropped by Internet routers and we're going to talk about one of the benefits of this in the future."}, {"Time_Start": 703.0, "Time_End": 711.0, "Text": " If one of your internal machines that you don't want people on the Internet to have access to has one of these private IP addresses, it's a lot harder for something."}, {"Time_Start": 711.0, "Time_End": 722.0, "Text": " a lot harder for someone on the Internet to connect to it because any packets that a hacker sends to 192-168, as soon as they get out on the Internet, they're going to be dropped, right?"}, {"Time_Start": 722.0, "Time_End": 727.0, "Text": " This is even better than an access control list. This is, I don't have an address you can get to."}, {"Time_Start": 727.0, "Time_End": 733.0, "Text": " Anyone can use them internally as they'll never collide with external addresses."}, {"Time_Start": 733.0, "Time_End": 740.98, "Text": " Okay, we've talked about RFC 1918 and some private addresses. If you've been"}, {"Time_Start": 741.0, "Time_End": 746.32, "Text": " In playing with network address translation, you've probably seen that in most firewalls,"}, {"Time_Start": 746.32, "Time_End": 754.58, "Text": " in particular here the checkpoints firewall one, if you notice here I'm sort of using some other terminology, well, I am."}, {"Time_Start": 754.58, "Time_End": 758.88, "Text": " There are two modes, generally speaking, for network address translation."}, {"Time_Start": 758.88, "Time_End": 766.54, "Text": " Hide mode, otherwise known as many to one, or static mode, which is one to one."}, {"Time_Start": 766.54, "Time_End": 770.98, "Text": " And this is largely because when it comes to granting Internet access in your"}, {"Time_Start": 771.0, "Time_End": 777.84, "Text": " organization, you can pretty much partition all of your TCPIP hosts into two groups,"}, {"Time_Start": 777.84, "Time_End": 784.68, "Text": " those of which should have some access by people on the Internet, you know, your mail server,"}, {"Time_Start": 784.68, "Time_End": 789.96, "Text": " right, your web server, your FTP server, and those that you never want anyone on the"}, {"Time_Start": 789.96, "Time_End": 795.72, "Text": " Internet to have access to, your payroll server, the accounting server, your workstation,"}, {"Time_Start": 795.72, "Time_End": 800.98, "Text": " say. I'm speaking only of connections coming from the Internet in, not connections going from"}, {"Time_Start": 801.0, "Time_End": 805.24, "Text": " inside out. So if you're like most organizations, you can partition all of your"}, {"Time_Start": 805.24, "Time_End": 811.86, "Text": " your PCPIP hosts, you know, all but five of them. You want to be internal and protected."}, {"Time_Start": 811.86, "Time_End": 817.98, "Text": " For the purposes of this discussion, I'm going to call that the land, the local area network."}, {"Time_Start": 817.98, "Time_End": 824.66, "Text": " And then there's maybe four or five servers or hundreds if you're a big content provider."}, {"Time_Start": 824.66, "Time_End": 828.76, "Text": " And you're going to want those to be allowed at least some access from people on the internet."}, {"Time_Start": 828.76, "Time_End": 830.98, "Text": " And I'm going to call that the DMZ, demilitary."}, {"Time_Start": 831.0, "Time_End": 860.9, "Text": " zone, which is sort of not very descriptive, but it's a special zone. Perhaps it's even a special nick off of your firewall and a protected subnet in which you're allowing some access by people on the internet. Very filtered, very specific, very carefully monitored access, but you are allowing some access. But the machines on the inside, like, you know, the woman who does payroll, her laptop, you know, her desktop machine, you don't want people on the outside to be able to connect to that under any circumstances."}, {"Time_Start": 861.0, "Time_End": 865.4, "Text": " So those go in the land, and they'll be in something called hide mode."}, {"Time_Start": 866.4, "Time_End": 872.24, "Text": " Static motor one-to-one is what you typically do for servers, machines that you wish to make available to the public."}, {"Time_Start": 872.38, "Time_End": 890.34, "Text": " So the moral of the story is if you're going to set up Nat in your organization, one of the first things you need to do is basically think about all your TCP IP hosts and partition them into two groups, mutually exclusive, collectively exhaustive, and figure out which ones go in the DMZ and which ones go in the land."}, {"Time_Start": 891.0, "Time_End": 892.64, "Text": " And that'll help you figure out which mode to use."}, {"Time_Start": 894.82, "Time_End": 896.84, "Text": " Okay, so we've talked about the first section here."}, {"Time_Start": 897.36, "Time_End": 898.3, "Text": " Let's have some questions."}, {"Time_Start": 898.48, "Time_End": 900.16, "Text": " I've talked about RFC-1918."}, {"Time_Start": 900.86, "Time_End": 903.0, "Text": " I've talked about private IP addresses."}, {"Time_Start": 903.42, "Time_End": 906.72, "Text": " I've talked about two modes of network address translation."}, {"Time_Start": 907.78, "Time_End": 908.14, "Text": " Questions?"}, {"Time_Start": 908.98, "Time_End": 909.96, "Text": " Things I've screwed up on."}, {"Time_Start": 909.96, "Time_End": 910.22, "Text": " Yes."}, {"Time_Start": 910.22, "Time_End": 914.3, "Text": " How would that work in a VPN situation?"}, {"Time_Start": 914.3, "Time_End": 917.52, "Text": " The question is, how would not work in a VPN situation?"}, {"Time_Start": 918.08, "Time_End": 920.5, "Text": " The short answer is, with great difficulty."}, {"Time_Start": 921.0, "Time_End": 922.16, "Text": " It's a real problem."}, {"Time_Start": 922.26, "Time_End": 927.8, "Text": " I believe IPSEC embeds the IP address of the host, and that goes out, it's some problems."}, {"Time_Start": 929.08, "Time_End": 935.92, "Text": " I don't know a whole lot more than that that I can share with you at this point, but yes, there's some real difficulties if you're trying to use a VPN with not."}, {"Time_Start": 936.24, "Time_End": 950.9, "Text": " Because Nat, the host and the server, or the two ends of the connection using Nat, basically don't need to and perhaps cannot be aware of the fact that network address translation was used."}, {"Time_Start": 951.0, "Time_End": 952.0, "Text": " used."}, {"Time_Start": 952.0, "Time_End": 957.0, "Text": " You know, we'll show here, I'm going to go through some descriptions here and walk through with packets."}, {"Time_Start": 957.0, "Time_End": 963.0, "Text": " And I'm going to show that both, for example, if you're browsing the web with a client using network address translation,"}, {"Time_Start": 963.0, "Time_End": 966.0, "Text": " neither side is even aware that Nat is going on."}, {"Time_Start": 966.0, "Time_End": 974.0, "Text": " So for most protocols that operate with good manners and don't embed IP addresses in the payload,"}, {"Time_Start": 974.0, "Time_End": 976.0, "Text": " then that works just fine."}, {"Time_Start": 976.0, "Time_End": 980.98, "Text": " But one of the security aspects of some VPN protocols is that in order to prevent"}, {"Time_Start": 981.0, "Time_End": 985.5, "Text": " various attacks, et cetera, they embed the IP address and the payload, and that can cause some problems."}, {"Time_Start": 987.82, "Time_End": 993.96, "Text": " The best way to do that is to have, the best way to solve this problem is to have the VPN and your firewall working together."}, {"Time_Start": 994.68, "Time_End": 1000.14, "Text": " For example, checkpoint firewall one, the example I know, I'm not trying to plug them, they do that well."}, {"Time_Start": 1000.26, "Time_End": 1002.56, "Text": " You can mix the VPN with network address translation."}, {"Time_Start": 1004.18, "Time_End": 1004.98, "Text": " Other questions?"}, {"Time_Start": 1006.82, "Time_End": 1010.84, "Text": " Okay, this is a typical NAT configuration. This is a highly set configuration. This is a highly"}, {"Time_Start": 1011.0, "Time_End": 1019.0, "Text": " stylized, simple network. This is your new dot-com company two years ago. They've been in business for two weeks."}, {"Time_Start": 1019.0, "Time_End": 1027.0, "Text": " The Big Eye Internet, we have a gateway router. It's your, you know, your Cisco 1700 or your Cisco 3,600, whatever it is."}, {"Time_Start": 1027.0, "Time_End": 1034.0, "Text": " You're running a firewall there with Nat, and you'll see that there are two separate Knicks coming out of that firewall."}, {"Time_Start": 1034.0, "Time_End": 1040.98, "Text": " I'm really trying to separate those two land segments to the greatest"}, {"Time_Start": 1041.0, "Time_End": 1047.1, "Text": " possible. On the lower right, we have the DMZ, and you'll see we've got a World Wide Web"}, {"Time_Start": 1047.1, "Time_End": 1053.14, "Text": " server, we have a mail server, and an FTP server, and those machines are in the DMZ because"}, {"Time_Start": 1053.14, "Time_End": 1057.64, "Text": " we do want people on the internet to have some limited access to those machines."}, {"Time_Start": 1059.08, "Time_End": 1067.36, "Text": " On the lower left-hand side is the LAN, and there's the server there and various users, and again,"}, {"Time_Start": 1067.36, "Time_End": 1070.98, "Text": " the purpose is we don't want anyone on the internet to have any access."}, {"Time_Start": 1071.0, "Time_End": 1098.66, "Text": " access to the people in the land. So we've already done this partitioning. We've already got it split out here into two separate subnets with two separate policies. The one on the lower right is in static using static mode nat. The one on the lower left is using hide mode. Question? What if your, the question is what if your router does your nat for you, can you still split it up into two different modes?"}, {"Time_Start": 1098.66, "Time_End": 1100.34, "Text": " Like the lower end of those code routers?"}, {"Time_Start": 1101.0, "Time_End": 1105.0, "Text": " 675, 678s, like that?"}, {"Time_Start": 1105.0, "Time_End": 1108.0, "Text": " Okay, the question is particularly about low-end Cisco routers."}, {"Time_Start": 1108.0, "Time_End": 1116.0, "Text": " I don't know. If there's a single nick coming out on the bottom of the router, then it makes it a lot harder, obviously, to split it into two nicks."}, {"Time_Start": 1116.0, "Time_End": 1120.0, "Text": " You know, put a switch underneath it and do the best you can."}, {"Time_Start": 1120.0, "Time_End": 1122.0, "Text": " You know, the point of security is not to be perfect."}, {"Time_Start": 1122.0, "Time_End": 1126.0, "Text": " It's just to put up, you know, as many sort of walls to climb over as you can."}, {"Time_Start": 1126.0, "Time_End": 1130.98, "Text": " One of the purposes of splitting it into two different nicks is"}, {"Time_Start": 1131.0, "Time_End": 1135.62, "Text": " it's like those lizards in the deserts of Arizona who have those big tails."}, {"Time_Start": 1135.82, "Time_End": 1139.54, "Text": " And if a predator grabs the tail, well, the tail breaks off and the lizard gets away."}, {"Time_Start": 1140.28, "Time_End": 1146.2, "Text": " And the DMZ is sort of the lizard's tail here, because you are allowing some access from the internet."}, {"Time_Start": 1146.34, "Time_End": 1149.38, "Text": " There is still some chance of somebody taking over one of your servers."}, {"Time_Start": 1150.0, "Time_End": 1157.16, "Text": " And so you set up your routing rules and the firewall rules in such a way that even if somebody takes over your web server,"}, {"Time_Start": 1157.58, "Time_End": 1159.3, "Text": " they still can't get into the land."}, {"Time_Start": 1159.3, "Time_End": 1160.98, "Text": " Okay, this is the whole reason why you're going to be."}, {"Time_Start": 1161.0, "Time_End": 1166.9, "Text": " use two separate subnets and have two separate policies here. You know, obviously nobody wants"}, {"Time_Start": 1166.9, "Time_End": 1173.24, "Text": " to get their web server taken over. But if it does, well, okay, you can flatten that hard"}, {"Time_Start": 1173.24, "Time_End": 1178.94, "Text": " drive and start over. But at no time did they have enhanced access to get back into the land"}, {"Time_Start": 1178.94, "Time_End": 1183.84, "Text": " and get into your payroll server, which is the real concern. So that's the motivation behind"}, {"Time_Start": 1183.84, "Time_End": 1185.24, "Text": " having these two different land segments."}, {"Time_Start": 1191.0, "Time_End": 1203.6, "Text": " the question is that some routers will do specific port forwarding, limiting"}, {"Time_Start": 1203.6, "Time_End": 1209.2, "Text": " certain packets destined for certain ports only to certain IP addresses. That sounds"}, {"Time_Start": 1209.2, "Time_End": 1212.16, "Text": " like an access control list or basic firewall configuration issues."}, {"Time_Start": 1212.16, "Time_End": 1220.6, "Text": " It's like if a packet comes in on port 80, then it forwards to certain address. So it does sort of do what he was asking for."}, {"Time_Start": 1221.0, "Time_End": 1249.46, "Text": " Natt in action. All right, we're going to, we're going to, uh, I wanted to have a little icon here of a guy named Natt. And I was going to use them as a little animated something stupid here. But with my lame, uh, with my lame amateur PowerPoint skills, you've been saved."}, {"Time_Start": 1251.0, "Time_End": 1258.68, "Text": " We're going to look here. There are four possibilities. We're going to look here at hide mode and static mode."}, {"Time_Start": 1259.8, "Time_End": 1265.74, "Text": " There's another cell phone. And we're going to look at outbound connections and inbound connections and see what happens."}, {"Time_Start": 1267.88, "Time_End": 1280.94, "Text": " Okay. The first thing we're going to do here is talk about what's inside an IP packet. I could spend four days talking about what's inside an IP packet. I'm just going to mention a couple of basic fundamental things that you need to know"}, {"Time_Start": 1281.0, "Time_End": 1288.0, "Text": " for network address translation. You can get a PhD in IP packetology, I'm sure, from somewhere."}, {"Time_Start": 1288.0, "Time_End": 1299.0, "Text": " Two of the most important things are the IP source address. Every TCP IP packet that goes anywhere contains the source address of the machine where it came from."}, {"Time_Start": 1299.0, "Time_End": 1310.0, "Text": " Or if you spoof it, it can contain any IP address you want. But let's start with normal expected IP packets, which have the IP address of the TCP IP host that sent the packet."}, {"Time_Start": 1310.0, "Time_End": 1320.0, "Text": " Another thing it also contains is the destination. You wouldn't be able to route the packet over your network or over the internet if it didn't have an address where it wants to go."}, {"Time_Start": 1320.0, "Time_End": 1327.0, "Text": " So this is like a letter you're throwing in the mail or I guess in the example of the internet, the canonical example, it's a postcard you're throwing in the mail."}, {"Time_Start": 1327.0, "Time_End": 1330.0, "Text": " And this postcard has a two address and it has a from address."}, {"Time_Start": 1330.0, "Time_End": 1333.0, "Text": " You already know that. This is simple stuff."}, {"Time_Start": 1333.0, "Time_End": 1337.0, "Text": " Something else that it has is a port number."}, {"Time_Start": 1337.0, "Time_End": 1344.0, "Text": " number. Those of you who know the OSI model, this is layer four. This is the transport layer."}, {"Time_Start": 1344.0, "Time_End": 1356.0, "Text": " For example, these are port numbers you've heard about if you're talking to a web server, it's port 80, HTTP. If you're talking to an FTP server, it's port 21. Outbound email is SMTP, port 25, etc."}, {"Time_Start": 1356.0, "Time_End": 1364.0, "Text": " You've heard these port numbers before. These get sent along with every packet. Again, this is a two address and a from address."}, {"Time_Start": 1364.0, "Time_End": 1366.98, "Text": " The from address is actually sort of a little more mysterious."}, {"Time_Start": 1367.0, "Time_End": 1375.16, "Text": " A lot of times when I'm teaching firewall classes, a lot of people are sort of uncertain or sort of surprised by this concept that every packet has a from port address."}, {"Time_Start": 1375.26, "Time_End": 1382.92, "Text": " And it turns out it's actually fairly valuable, and it's one of the things that keeps firewalls, by which a firewall can keep its internal state tables straight."}, {"Time_Start": 1383.04, "Time_End": 1384.04, "Text": " And we'll talk about that in a minute."}, {"Time_Start": 1385.64, "Time_End": 1388.46, "Text": " Also inside an IP packet, there's lots of other stuff."}, {"Time_Start": 1389.06, "Time_End": 1396.18, "Text": " There's the data payload, you know, and this is your oversized ping of death packet or whatever it is you're sending today."}, {"Time_Start": 1397.0, "Time_End": 1400.5, "Text": " Error correction information, et cetera."}, {"Time_Start": 1400.5, "Time_End": 1405.0, "Text": " There's an awful lot of other stuff corresponding with other layers and flags, et cetera, et cetera."}, {"Time_Start": 1405.0, "Time_End": 1413.0, "Text": " But for purposes of the discussion of network address translation, the only things that are really important for us today are the two and from address for"}, {"Time_Start": 1413.0, "Time_End": 1419.0, "Text": " for the two and from IP address and the two and from port address."}, {"Time_Start": 1419.0, "Time_End": 1422.0, "Text": " So we could talk about translating some of those addresses."}, {"Time_Start": 1422.0, "Time_End": 1425.0, "Text": " What's not for TCP IP or IP in general?"}, {"Time_Start": 1425.0, "Time_End": 1427.16, "Text": " IP in general."}, {"Time_Start": 1430.08, "Time_End": 1430.52, "Text": " Okay."}, {"Time_Start": 1430.92, "Time_End": 1433.74, "Text": " So now we're going to go to hide mode outbound, the first one."}, {"Time_Start": 1434.62, "Time_End": 1435.5, "Text": " Step number one."}, {"Time_Start": 1436.68, "Time_End": 1437.96, "Text": " Okay, this is hide mode."}, {"Time_Start": 1438.16, "Time_End": 1441.48, "Text": " You remember we have the land users who are sitting inside the land."}, {"Time_Start": 1442.42, "Time_End": 1444.02, "Text": " They're protected by hide mode."}, {"Time_Start": 1444.46, "Time_End": 1445.68, "Text": " They have a non-routable address."}, {"Time_Start": 1445.78, "Time_End": 1446.92, "Text": " They have one of these private addresses."}, {"Time_Start": 1447.04, "Time_End": 1448.84, "Text": " It's like 192-168, right?"}, {"Time_Start": 1449.26, "Time_End": 1454.06, "Text": " So we know already that if they send a request out to some web server on the internet,"}, {"Time_Start": 1454.06, "Time_End": 1459.76, "Text": " using their own address, where's the web server going to reply to, right?"}, {"Time_Start": 1460.3, "Time_End": 1464.76, "Text": " If this packet goes out just by itself, some web server somewhere on the Internet"}, {"Time_Start": 1464.76, "Time_End": 1469.78, "Text": " is going to get a request, an HTTP request, from somebody who's identifying themselves"}, {"Time_Start": 1469.78, "Time_End": 1477.3799999999999, "Text": " as being 192-168, you know, 1.2, that web server can't reply because, well, we know that you"}, {"Time_Start": 1477.3799999999999, "Time_End": 1479.2, "Text": " can't respond to an address like that."}, {"Time_Start": 1479.26, "Time_End": 1482.8, "Text": " You can't send packets over the Internet to one of those non-routable addresses."}, {"Time_Start": 1483.3799999999999, "Time_End": 1484.04, "Text": " So we know all right."}, {"Time_Start": 1484.06, "Time_End": 1487.3, "Text": " ready that some translation is going to have to occur here before that packet leaves"}, {"Time_Start": 1487.3, "Time_End": 1494.22, "Text": " your security perimeter. So the packet leaves the client. And you can see here, I've just"}, {"Time_Start": 1494.22, "Time_End": 1500.1, "Text": " enumerated the four sort of different embedded addresses in that packet. The first one is the IP"}, {"Time_Start": 1500.1, "Time_End": 1505.3999999999999, "Text": " source address is the private address. You know, this is the private address of your web"}, {"Time_Start": 1505.3999999999999, "Time_End": 1511.94, "Text": " client there at work. The IP destination, I'm just using www. website.com. It's just a placeholder."}, {"Time_Start": 1514.06, "Time_End": 1518.24, "Text": " client is going to pick a random high TCP port number and the destination is going"}, {"Time_Start": 1518.24, "Time_End": 1525.12, "Text": " to be port 80 and we know that because you're trying to talk to a web server. As it leaves your"}, {"Time_Start": 1525.12, "Time_End": 1531.0, "Text": " firewall or your NAT box, okay, this is where the network address translation comes in, your"}, {"Time_Start": 1531.0, "Time_End": 1538.7, "Text": " your NAT box overwrites the source address with the public IP address. So you see there the IP"}, {"Time_Start": 1538.7, "Time_End": 1543.6599999999999, "Text": " source, we've overwritten it with a virtual public address. This is an address that you own. You've"}, {"Time_Start": 1543.66, "Time_End": 1549.0400000000002, "Text": " and assigned it by your ISP or by IANA, and you own it and it routes on the internet."}, {"Time_Start": 1549.0400000000002, "Time_End": 1555.02, "Text": " And the other three addresses you leave unchanged. One of the important things here is that the"}, {"Time_Start": 1555.02, "Time_End": 1560.16, "Text": " firewall has to store information about this connection in the state table. Because this packet,"}, {"Time_Start": 1560.16, "Time_End": 1564.5800000000002, "Text": " you know, this packet, this connection, well, the firewall is actually sort of maintaining two"}, {"Time_Start": 1564.5800000000002, "Time_End": 1569.46, "Text": " different connections now, one between the internal client and the firewall, and another one between"}, {"Time_Start": 1569.46, "Time_End": 1573.64, "Text": " the firewall and the firewall and this web server out on the internet. And you have to have to"}, {"Time_Start": 1573.66, "Time_End": 1603.64, "Text": " have to keep all that straight because when the answer comes back the firewall has to decide whether to let this in or not. So the firewall keeps a state table, just a little bit of RAM, just keeps a little piece of, just a simple little table that says, okay, this inside user at this IP address, he has an open connection going out to this web server, his address is this, the fake external address we gave him is that, and the connection is open. He went out on this port number, you know, so just some basic information. So the firewall"}, {"Time_Start": 1603.66, "Time_End": 1610.5600000000002, "Text": " all keeps the state information in order to keep the channel open for the return traffic the remote public"}, {"Time_Start": 1610.5600000000002, "Time_End": 1615.96, "Text": " server this is you know the website you're going to now he sees a request from a valid"}, {"Time_Start": 1615.96, "Time_End": 1622.26, "Text": " internet host you know 205 219 84.5 or whatever that's a valid routable address so the"}, {"Time_Start": 1622.26, "Time_End": 1629.1000000000001, "Text": " web server sees this and says hey i'm a web server my job is to serve up web pages i've got a valid"}, {"Time_Start": 1629.1000000000001, "Time_End": 1633.5800000000002, "Text": " HTTP request here from a valid internet address so he just responds"}, {"Time_Start": 1633.66, "Time_End": 1635.6000000000001, "Text": " So he sends back."}, {"Time_Start": 1636.28, "Time_End": 1642.52, "Text": " Now, in a sense, it's easy to see he's just flipping the two and from on both the IP address and the port address."}, {"Time_Start": 1643.0400000000002, "Time_End": 1644.2, "Text": " So he flips the two here."}, {"Time_Start": 1644.28, "Time_End": 1648.88, "Text": " So this packet that leaves the server has a source address from him, which makes perfect sense."}, {"Time_Start": 1649.16, "Time_End": 1651.64, "Text": " He's sending it back to the virtual public address."}, {"Time_Start": 1652.28, "Time_End": 1658.3600000000001, "Text": " The port is on 80, the port source is on 80, and the destination is the original high TCP port number."}, {"Time_Start": 1658.74, "Time_End": 1662.44, "Text": " Now this is sort of one of the mysteries that everyone's sort of surprised to see is that,"}, {"Time_Start": 1662.44, "Time_End": 1668.26, "Text": " is that when answers, when your replies come back from public web servers or from any web server,"}, {"Time_Start": 1668.68, "Time_End": 1675.4, "Text": " the two port number is the same random high TCP port number that your machine selected at the beginning."}, {"Time_Start": 1675.8600000000001, "Time_End": 1678.8600000000001, "Text": " Now, since the firewall has kept that information in the table,"}, {"Time_Start": 1679.24, "Time_End": 1684.3, "Text": " the firewall is able to disambiguate these replies when they come back and decide who gets this packet."}, {"Time_Start": 1692.44, "Time_End": 1703.4, "Text": " client behind the map translator and they all collide on the random high force if they want to send to which one is the"}, {"Time_Start": 1703.4, "Time_End": 1710.3600000000001, "Text": " question is if you have multiple web browsers in hide mode in the same land and they all want to go out and"}, {"Time_Start": 1710.3600000000001, "Time_End": 1717.24, "Text": " browse the web simultaneously and they collide on high TCP port numbers how do you resolve that well the"}, {"Time_Start": 1717.24, "Time_End": 1722.42, "Text": " answer is we're much more willing to take the chance they're going to collide on port number"}, {"Time_Start": 1722.44, "Time_End": 1726.3600000000001, "Text": " than on the chance that they're going to collide on outbound IP addresses,"}, {"Time_Start": 1726.48, "Time_End": 1729.54, "Text": " which we know they're going to collide because they're all hiding behind the same IP address."}, {"Time_Start": 1730.0800000000002, "Time_End": 1732.42, "Text": " I don't know how the firewall resolves that."}, {"Time_Start": 1732.68, "Time_End": 1740.66, "Text": " It probably rejects the connection and says try again, but there's 64,000 or 63,000 random high TCP port addresses,"}, {"Time_Start": 1740.66, "Time_End": 1742.88, "Text": " so your chances of colliding are actually very small."}, {"Time_Start": 1743.3, "Time_End": 1748.94, "Text": " I would imagine if you were a firewall and somebody, you know, the way you would keep those straight"}, {"Time_Start": 1748.94, "Time_End": 1752.42, "Text": " would be either to reject the second connection or maybe do something sort."}, {"Time_Start": 1752.44, "Time_End": 1756.5800000000002, "Text": " smart like keep track of well this guy's going to a different IP address so when the"}, {"Time_Start": 1756.5800000000002, "Time_End": 1760.18, "Text": " answer comes back you match both the IP address and the port number and that's how you keep"}, {"Time_Start": 1760.18, "Time_End": 1764.3200000000002, "Text": " it straight so I imagine if you did both of those I mean what are the chances of two"}, {"Time_Start": 1764.3200000000002, "Time_End": 1769.88, "Text": " land coasts simultaneously going to Yahoo both with the same random high port number"}, {"Time_Start": 1769.88, "Time_End": 1781.5, "Text": " pretty small excuse me who would pick a different high port number the fire number"}, {"Time_Start": 1781.5, "Time_End": 1782.42, "Text": " the firewall"}, {"Time_Start": 1782.44, "Time_End": 1789.54, "Text": " All right, the question is, is it possible the firewall would just pick a second high port number going to the same destination?"}, {"Time_Start": 1790.3400000000001, "Time_End": 1798.24, "Text": " Right. There's something called port address translation. The firewall does have the ability to, you know, play further games with this, pick different port numbers, et cetera."}, {"Time_Start": 1798.8, "Time_End": 1807.1200000000001, "Text": " The chances of this happening are very small, so it's not something, you know, we worry about a whole lot. I don't know the details of how firewall one in particular, you know, resolves that."}, {"Time_Start": 1807.1200000000001, "Time_End": 1811.56, "Text": " But given the fact that there are 63,000 random high TCP port numbers,"}, {"Time_Start": 1812.44, "Time_End": 1816.5800000000002, "Text": " And most lands, you know, are hiding only a few hundred people behind a single, you know,"}, {"Time_Start": 1816.6200000000001, "Time_End": 1824.18, "Text": " Nat configuration. It doesn't seem to happen very often. I'm sure there's a solution. I'm sure, I'm sure they've worked on it, but I haven't considered it very much."}, {"Time_Start": 1826.3, "Time_End": 1829.8, "Text": " Does the, does the Mac address pull?"}, {"Time_Start": 1832.54, "Time_End": 1841.9, "Text": " Well, Mac addresses are local to your Ethernet segment. They don't cross routers. They don't even cross switches."}, {"Time_Start": 1842.44, "Time_End": 1852.98, "Text": " So, whatever Mac address you have on your local land client could easily be long gone by the time you get to your gateway router or your Natbox."}, {"Time_Start": 1853.3400000000001, "Time_End": 1858.88, "Text": " That's layer 2, Ethernet only, doesn't have any part of this type of mat."}, {"Time_Start": 1860.3200000000002, "Time_End": 1860.68, "Text": " Question?"}, {"Time_Start": 1864.68, "Time_End": 1871.78, "Text": " All right, the comment is, if you're using Firewall 1 in hide mode, you're always going to be port in hide mode, you're always going to be using firewall 1 in hide mode, you're always going to be using port address translation."}, {"Time_Start": 1872.44, "Time_End": 1888.64, "Text": " Okay. Okay, the comment is there. Okay, the comment is there's no reason to be"}, {"Time_Start": 1888.64, "Time_End": 1898.24, "Text": " maintaining force the same port number. Okay, fine. This is not something I'm an expert on on these details. I know that, you know, the firewall handles them just fine, and I haven't torn into it."}, {"Time_Start": 1902.44, "Time_End": 1904.92, "Text": " The response finally comes back to the client."}, {"Time_Start": 1904.92, "Time_End": 1907.7, "Text": " The client receives the reply from the internet host."}, {"Time_Start": 1907.7, "Time_End": 1908.42, "Text": " So he's happy."}, {"Time_Start": 1908.42, "Time_End": 1914.5, "Text": " He sent out a request to an internet server, and he got his HTTP request back, so he's perfectly happy."}, {"Time_Start": 1914.5, "Time_End": 1916.44, "Text": " Number nine, he has no idea Nat was used."}, {"Time_Start": 1916.44, "Time_End": 1922.38, "Text": " He has no idea that the web server thought he was really talking to 204, 205, you know, 199-1."}, {"Time_Start": 1922.38, "Time_End": 1923.7, "Text": " He has no idea."}, {"Time_Start": 1923.7, "Time_End": 1925.2, "Text": " And the server has no idea also."}, {"Time_Start": 1925.2, "Time_End": 1928.22, "Text": " The server, as far as he knows, he received a valid request."}, {"Time_Start": 1928.22, "Time_End": 1932.42, "Text": " So one of the important issues here, if Nat is working properly, is that neither the client,"}, {"Time_Start": 1932.44, "Time_End": 1936.0800000000002, "Text": " nor the server have any idea that Nat was used, and it doesn't matter."}, {"Time_Start": 1936.16, "Time_End": 1939.64, "Text": " They don't need to know, except for some unusual circumstances such as the VPN."}, {"Time_Start": 1941.3200000000002, "Time_End": 1942.56, "Text": " Okay, that was outbound."}, {"Time_Start": 1943.3600000000001, "Time_End": 1946.8400000000001, "Text": " Now we're going to talk about hide mode and inbound connections."}, {"Time_Start": 1947.76, "Time_End": 1953.06, "Text": " And if you're thinking ahead, if you're reading ahead, you might be thinking, something's not right here."}, {"Time_Start": 1953.3200000000002, "Time_End": 1955.3600000000001, "Text": " Why should there be inbound connections in hide mode?"}, {"Time_Start": 1956.52, "Time_End": 1957.3600000000001, "Text": " And it's true."}, {"Time_Start": 1958.16, "Time_End": 1961.8, "Text": " One of the purposes of hide mode is that there can't be inbound connections."}, {"Time_Start": 1962.44, "Time_End": 1970.8200000000002, "Text": " So let's say that web server you just connected to has an evil process on it, and it tries to open another connection back to your web client."}, {"Time_Start": 1971.2, "Time_End": 1975.8600000000001, "Text": " Those of you who have firewalls now and watch the logs, you see this all the time."}, {"Time_Start": 1975.98, "Time_End": 1979.6200000000001, "Text": " I'm running Firewall 1 in my lab right now, and I'm seeing it all the time."}, {"Time_Start": 1979.72, "Time_End": 1988.78, "Text": " I connect to some web server somewhere on the internet, and three seconds later, there's some high TCP port attempted connection right back to my web client."}, {"Time_Start": 1989.3200000000002, "Time_End": 1992.3200000000002, "Text": " My firewall drops them all and logs them, but this happens all the time."}, {"Time_Start": 1992.44, "Time_End": 1999.44, "Text": " So in this scenario, the packet comes in from this website."}, {"Time_Start": 1999.44, "Time_End": 2006.44, "Text": " Its destination is the public IP address, the routable one that your Natbox was using."}, {"Time_Start": 2006.44, "Time_End": 2013.44, "Text": " Whatever the port source is and the port destination, if it's an evil process, it can fake it all at once,"}, {"Time_Start": 2013.44, "Time_End": 2017.44, "Text": " but it's coming in on something that, well, clearly you're not allowing any port numbers to come through"}, {"Time_Start": 2017.44, "Time_End": 2020.44, "Text": " because you're in hide mode on the land."}, {"Time_Start": 2020.44, "Time_End": 2021.44, "Text": " The firewall sees the incoming package."}, {"Time_Start": 2021.44, "Time_End": 2026.1000000000001, "Text": " sees the incoming packet and is unable to match it with a known connection described"}, {"Time_Start": 2026.1000000000001, "Time_End": 2029.8200000000002, "Text": " in the state table. So remember before, we talked about this state table where the firewall"}, {"Time_Start": 2029.8200000000002, "Time_End": 2034.78, "Text": " keeps information about connections that are outbound. So when packets come back in, it can"}, {"Time_Start": 2034.78, "Time_End": 2040.3600000000001, "Text": " look up in the table and say, oh yeah, I know about you, I was expecting you. You're the answer"}, {"Time_Start": 2040.3600000000001, "Time_End": 2045.94, "Text": " to this request from someone in my land. However, if a new connection tries to come through,"}, {"Time_Start": 2045.94, "Time_End": 2050.94, "Text": " the firewall looks at this and says, what is this? You're trying to connect to somebody who's in"}, {"Time_Start": 2050.94, "Time_End": 2057.66, "Text": " hide mode and the firewall says you know my job is to hide those hosts so the"}, {"Time_Start": 2057.66, "Time_End": 2061.8, "Text": " firewall says well this is a virtual IP address only it's not a real IP address we just"}, {"Time_Start": 2061.8, "Time_End": 2066.06, "Text": " used it temporarily for hide mode and that also here's an interesting question even"}, {"Time_Start": 2066.06, "Time_End": 2072.34, "Text": " if the firewall could forward that packet to some host on inside the land it's an"}, {"Time_Start": 2072.34, "Time_End": 2079.82, "Text": " interesting question which host is it intended for there could be 200 hosts in there"}, {"Time_Start": 2080.94, "Time_End": 2086.84, "Text": " Lastly, hiding the internal hosts is the whole point of hide mode."}, {"Time_Start": 2086.84, "Time_End": 2093.94, "Text": " So the next issue, the next item here is, well, the next thing that happens is the connection fails, no connection can be made, hence hide mode."}, {"Time_Start": 2093.94, "Time_End": 2100.44, "Text": " All right, we've talked about the first two in hide mode. I'll just, I'll more quickly go through static mode."}, {"Time_Start": 2100.44, "Time_End": 2102.94, "Text": " Okay, questions. Question here?"}, {"Time_Start": 2110.94, "Time_End": 2116.0, "Text": " that can be exploited from the hide mode local addresses."}, {"Time_Start": 2116.0, "Time_End": 2122.28, "Text": " The only cash, so to speak, would be, my understanding, would be the state tables that are stored"}, {"Time_Start": 2122.28, "Time_End": 2125.18, "Text": " in the firewall."}, {"Time_Start": 2125.18, "Time_End": 2130.58, "Text": " Well, sure, once the connection leaves the firewall, you know, it's subject to all sorts of other,"}, {"Time_Start": 2130.58, "Time_End": 2133.04, "Text": " you know, man in the middle attacks or whatever."}, {"Time_Start": 2133.04, "Time_End": 2136.7200000000003, "Text": " At that point, it's just a standard connection going out over the internet."}, {"Time_Start": 2136.7200000000003, "Time_End": 2140.92, "Text": " I suppose if you were able to, you know, hack into that, you could get back through with"}, {"Time_Start": 2140.94, "Time_End": 2142.2400000000002, "Text": " The firewall is fairly clever."}, {"Time_Start": 2143.84, "Time_End": 2146.82, "Text": " I don't know all the details of what it's got there to prevent that."}, {"Time_Start": 2146.84, "Time_End": 2154.48, "Text": " But the firewall is only going to allow, you know, replies from that IP address with the correct port number and within a certain period of time."}, {"Time_Start": 2155.78, "Time_End": 2162.98, "Text": " If you're hiding a couple of hundred land hosts in hide mode, hiding behind a single IP address on the Internet,"}, {"Time_Start": 2163.32, "Time_End": 2169.0, "Text": " and let's say you were sniffing that connection, you sniffed somebody's T1 line going out to the Internet, what do you see?"}, {"Time_Start": 2169.26, "Time_End": 2170.92, "Text": " You see a single IP address."}, {"Time_Start": 2170.94, "Time_End": 2172.84, "Text": " that's incredibly chatty, right?"}, {"Time_Start": 2172.84, "Time_End": 2177.94, "Text": " You see a single IP address that's simultaneously talking to 53 websites."}, {"Time_Start": 2177.94, "Time_End": 2181.44, "Text": " That's hard, that's harder, that's a real blizzard of information, and it's harder to keep all"}, {"Time_Start": 2181.44, "Time_End": 2185.94, "Text": " those data streams separate and tease them out and figure out who's what, and it'd be hard work."}, {"Time_Start": 2185.94, "Time_End": 2190.94, "Text": " But yeah, once the connection leaves the firewall and goes out on the internet insecurely, yes,"}, {"Time_Start": 2190.94, "Time_End": 2196.94, "Text": " there's some things that can be done, but the firewall is keeping a state table with all the relevant information"}, {"Time_Start": 2196.94, "Time_End": 2199.94, "Text": " and blocks everything that doesn't match exactly what it's expecting."}, {"Time_Start": 2199.94, "Time_End": 2207.7000000000003, "Text": " The firewall is much smarter than a simple access control list, which just says let this, you know, port number into this IP address."}, {"Time_Start": 2207.98, "Time_End": 2218.9, "Text": " The firewall has a state table and says only this connection and only for the next 30 seconds, and you have to be this IP address, you have to be this port number, otherwise you get dropped."}, {"Time_Start": 2219.8, "Time_End": 2220.4, "Text": " Question."}, {"Time_Start": 2229.94, "Time_End": 2244.94, "Text": " session is still open?"}, {"Time_Start": 2244.94, "Time_End": 2252.94, "Text": " Well, the only connection that stays open is for return HTTP information."}, {"Time_Start": 2252.94, "Time_End": 2256.94, "Text": " So it has to have a source of a source port number of 80."}, {"Time_Start": 2256.94, "Time_End": 2258.94, "Text": " So it has to have a source port number of 80."}, {"Time_Start": 2258.94, "Time_End": 2268.44, "Text": " There is no way, the firewall in order to allow web traffic requests to come back to the client has to allow web traffic requests to come back to the client."}, {"Time_Start": 2268.44, "Time_End": 2270.94, "Text": " So as long as they look like that, yes, they're going to be let through."}, {"Time_Start": 2271.44, "Time_End": 2276.7000000000003, "Text": " But if they come in as an attempted telnet connection, no, the port numbers are wrong, it'll get blocked."}, {"Time_Start": 2277.76, "Time_End": 2288.92, "Text": " So, you know, the firewall is only smart enough to let web traffic back, but, you know, if there's something dangerous in that, you know, you've attached a, you know, a Trojanhorse.exi to it, well, the firewall,"}, {"Time_Start": 2288.94, "Time_End": 2298.94, "Text": " has to do other things to protect you against that. But the connections that is opened allows web traffic responses back from that IP address until the timeout."}, {"Time_Start": 2318.94, "Time_End": 2336.94, "Text": " All right, the question is that if the web server responds with the correct source IP address and the correct source port address that matches the existing connection, then the firewall will let that through."}, {"Time_Start": 2336.94, "Time_End": 2339.94, "Text": " The answer is yes."}, {"Time_Start": 2339.94, "Time_End": 2342.94, "Text": " That's, I mean, that's what it does."}, {"Time_Start": 2342.94, "Time_End": 2348.92, "Text": " You know, you, the firewall has to do some other things in terms of further inspection of"}, {"Time_Start": 2348.94, "Time_End": 2353.26, "Text": " attached files, say, so much more high-level inspection, layer seven in the packets."}, {"Time_Start": 2353.42, "Time_End": 2359.1, "Text": " But for what I'm talking about here with network address translation, it's just looking at layers three and four."}, {"Time_Start": 2359.66, "Time_End": 2367.82, "Text": " And so if something comes back through the firewall that looks like valid web response, it's something the web server sent, then yes, it's going to let it back in."}, {"Time_Start": 2367.82, "Time_End": 2371.26, "Text": " This is just simply, you know, allowing web access from the land."}, {"Time_Start": 2372.06, "Time_End": 2372.38, "Text": " Yes."}, {"Time_Start": 2373.9, "Time_End": 2375.02, "Text": " Gentleman in the back, white shirt."}, {"Time_Start": 2378.94, "Time_End": 2397.94, "Text": " So the firewall thing that you're going to explain this, then, you're going to require for the fact to put in the first,"}, {"Time_Start": 2397.94, "Time_End": 2402.94, "Text": " for the internal path to the network."}, {"Time_Start": 2402.94, "Time_End": 2408.92, "Text": " All right. The question of the comments on the question of the comments,"}, {"Time_Start": 2408.94, "Time_End": 2416.54, "Text": " is that there are some known and perhaps patched issues involving firewalls with buffer"}, {"Time_Start": 2416.54, "Time_End": 2420.78, "Text": " overflows. Yeah, those are separate issues. I'm not really trying to talk about some of the,"}, {"Time_Start": 2420.78, "Time_End": 2425.44, "Text": " you know, the more detailed security issues here. These are just, I'm going through the basics of"}, {"Time_Start": 2425.44, "Time_End": 2427.2400000000002, "Text": " Nat. Yes, there are other firewall issues."}, {"Time_Start": 2430.7400000000002, "Time_End": 2434.84, "Text": " Right, if you can do a buffer overflow and a firewall, there's all sorts of things possible."}, {"Time_Start": 2438.94, "Time_End": 2445.26, "Text": " Okay, the, we're in static mode here outbound. This is going out. The firewall overrides"}, {"Time_Start": 2445.26, "Time_End": 2449.7400000000002, "Text": " the IP source address with the public IP address. So this is just like we saw in hide mode. This"}, {"Time_Start": 2449.7400000000002, "Time_End": 2456.7000000000003, "Text": " is the packet going outbound. Since the from IP address on this packet is a local, non-routable"}, {"Time_Start": 2456.7000000000003, "Time_End": 2459.34, "Text": " address, the firewall has to change it on the way outbound."}, {"Time_Start": 2465.34, "Time_End": 2468.78, "Text": " The question is, does the firewall, does the firewall"}, {"Time_Start": 2468.94, "Time_End": 2474.94, "Text": " accommodate a single or perhaps multiple hide addresses. My understanding with the"}, {"Time_Start": 2474.94, "Time_End": 2480.32, "Text": " checkpoint firewall, one product, it's only one IP address per, say, subnet or per group or per"}, {"Time_Start": 2480.32, "Time_End": 2485.82, "Text": " rule. My experience with the Cisco PICS firewall is that you can designate a range of IP"}, {"Time_Start": 2485.82, "Time_End": 2490.34, "Text": " addresses and it will randomly select among them. That's even better, present your opponents"}, {"Time_Start": 2490.34, "Time_End": 2495.54, "Text": " with, you know, 100 random, 100 IP addresses and individual traffic is bouncing around between"}, {"Time_Start": 2495.54, "Time_End": 2498.78, "Text": " them, sort of a spread spectrum sort of approach to it. So,"}, {"Time_Start": 2498.94, "Time_End": 2505.2000000000003, "Text": " So it depends which product you have. Firewall 1, I think, typically goes with one, but I know that Cisco picks and you can put a range in."}, {"Time_Start": 2505.8, "Time_End": 2512.76, "Text": " We're going to talk about it here in a minute, but of course any IP address that you're hiding behind for Nat has to be a public address that you own, right?"}, {"Time_Start": 2512.76, "Time_End": 2518.88, "Text": " You can't just pick some random IP address because then your traffic will go out, but it won't come back."}, {"Time_Start": 2523.04, "Time_End": 2528.84, "Text": " The remote public server, it sees the request. It looks perfectly reasonable. It looks like a valid request."}, {"Time_Start": 2528.94, "Time_End": 2532.92, "Text": " it just flips the two addresses, puts the payload in, and sends it back."}, {"Time_Start": 2533.0, "Time_End": 2535.5, "Text": " This is just a standard response from a web server."}, {"Time_Start": 2536.3, "Time_End": 2542.94, "Text": " Coming back in, the firewall has to do the translation again, since it was addressed to the virtual public IP address."}, {"Time_Start": 2542.94, "Time_End": 2546.98, "Text": " It now needs to be disambiguated and sent back to the correct internal address."}, {"Time_Start": 2547.7200000000003, "Time_End": 2556.46, "Text": " So the moral of the story here is that your network address translation box changes one address on the way out and one address on the way in, and that's it."}, {"Time_Start": 2556.96, "Time_End": 2558.14, "Text": " You just have to get the right one."}, {"Time_Start": 2558.94, "Time_End": 2561.94, "Text": " The DMZ server receives the reply from the internet host."}, {"Time_Start": 2562.06, "Time_End": 2566.2400000000002, "Text": " The client has no idea that Nat was used, and the server has no idea that Nat was used."}, {"Time_Start": 2566.56, "Time_End": 2572.26, "Text": " So, again, as long as you're using safe protocols that don't embed an IP address inside the payload,"}, {"Time_Start": 2572.76, "Time_End": 2573.8, "Text": " then this shouldn't be a problem."}, {"Time_Start": 2576.2200000000003, "Time_End": 2578.46, "Text": " Let's do the last one here before we take the break."}, {"Time_Start": 2579.16, "Time_End": 2584.78, "Text": " And again, this is going to be for people trying to connect to your inbound, to your web servers."}, {"Time_Start": 2585.2000000000003, "Time_End": 2588.92, "Text": " These are people on the internet trying to connect into your web server, your FTP server, any of your"}, {"Time_Start": 2588.94, "Time_End": 2595.06, "Text": " public servers. And again, here's the four addresses. It's being addressed to your"}, {"Time_Start": 2595.06, "Time_End": 2601.76, "Text": " virtual public address. A leading question here, where does the remote internal, the internet"}, {"Time_Start": 2601.76, "Time_End": 2607.42, "Text": " client get this static virtual public address? This is leading to the DNS discussion we're"}, {"Time_Start": 2607.42, "Time_End": 2612.02, "Text": " going to have in the next hour. If you have more than one IP address assigned to a particular"}, {"Time_Start": 2612.02, "Time_End": 2617.3, "Text": " TCP IP host, you have to be careful to make sure that you load up your DNS servers with the correct"}, {"Time_Start": 2617.3, "Time_End": 2622.1000000000004, "Text": " address depending on who's going to be querying that DNS server. So if this is a public"}, {"Time_Start": 2622.1000000000004, "Time_End": 2626.48, "Text": " DNS server that you want people on the internet to be able to get to your server with, then you have"}, {"Time_Start": 2626.48, "Time_End": 2631.0600000000004, "Text": " to make sure that you're using one of your virtual IP addresses for it, right? You don't want"}, {"Time_Start": 2631.0600000000004, "Time_End": 2636.3, "Text": " to load up a public DNS server with a 192-168. That won't do any good. They'll never get to you."}, {"Time_Start": 2637.3, "Time_End": 2641.04, "Text": " So just, I want you to just keep in mind that one of the issues you have to resolve with"}, {"Time_Start": 2641.04, "Time_End": 2644.6200000000003, "Text": " network address translation is how to load up your DNS servers."}, {"Time_Start": 2647.3, "Time_End": 2651.92, "Text": " On the way in, the firewall overwrites the destination address with your private address."}, {"Time_Start": 2654.86, "Time_End": 2658.94, "Text": " Your DMZ server sees a request from an internet host. It replies."}, {"Time_Start": 2663.7400000000002, "Time_End": 2669.7200000000003, "Text": " The firewall, on the way out, this reply, the firewall has to overwrite the source address one more time,"}, {"Time_Start": 2670.2000000000003, "Time_End": 2673.38, "Text": " so the packet appears to be coming from a valid internet address."}, {"Time_Start": 2674.7400000000002, "Time_End": 2677.1000000000004, "Text": " And lastly, the internet client out there,"}, {"Time_Start": 2677.3, "Time_End": 2683.0600000000004, "Text": " receives the reply from the DMZ server. The client has no idea that Nat was used."}, {"Time_Start": 2683.0600000000004, "Time_End": 2687.78, "Text": " The server has no idea that Nat was used. So I just wanted to enumerate here the four different types"}, {"Time_Start": 2687.78, "Time_End": 2693.2400000000002, "Text": " or the four different, you know, inbound and outbound with both D, with both hide mode and static mode"}, {"Time_Start": 2693.2400000000002, "Time_End": 2697.1200000000003, "Text": " and just sort of step through it. It's not that complicated. Once you sit down with, you know,"}, {"Time_Start": 2697.1800000000003, "Time_End": 2701.5, "Text": " paper and pencil and work it through, it's not that tough. You're only changing one address in each"}, {"Time_Start": 2701.5, "Time_End": 2707.0600000000004, "Text": " direction, and all you're doing is just maintaining the consistency that the packets have correct addresses,"}, {"Time_Start": 2707.3, "Time_End": 2709.3, "Text": " they're on the inside or the outside."}, {"Time_Start": 2709.3, "Time_End": 2713.3, "Text": " How do you protect your land from your compromised DMZ?"}, {"Time_Start": 2713.3, "Time_End": 2717.3, "Text": " The question is, how do you protect your land from your compromised DMZ?"}, {"Time_Start": 2717.3, "Time_End": 2721.3, "Text": " Well, you do it in your firewall with rules in your firewall,"}, {"Time_Start": 2721.3, "Time_End": 2727.3, "Text": " and that you don't allow any connections from hosts in the DMZ into hosts on the land."}, {"Time_Start": 2727.3, "Time_End": 2731.3, "Text": " So you plan ahead and you say, well, what if somebody totally owned my web server,"}, {"Time_Start": 2731.3, "Time_End": 2733.3, "Text": " what's the first thing they're going to do?"}, {"Time_Start": 2733.3, "Time_End": 2735.3, "Text": " They're going to try to use that as a stepping stone, a springboard,"}, {"Time_Start": 2735.3, "Time_End": 2740.3, "Text": " springboard into the rest of your network. And at that point, the firewall is going to stop them"}, {"Time_Start": 2740.3, "Time_End": 2744.98, "Text": " as they're trying to connect from the inside. So this is the main reason why you want to have"}, {"Time_Start": 2744.98, "Time_End": 2750.1800000000003, "Text": " your DMZ and your land on separate knick cards, separate land segments so that the firewall"}, {"Time_Start": 2750.1800000000003, "Time_End": 2757.3, "Text": " has the best chance possible of still providing a defense there. Your DMZ is sort of a land"}, {"Time_Start": 2757.3, "Time_End": 2762.26, "Text": " where things are partially trusted. You'll let people from the outside in to some degree to get,"}, {"Time_Start": 2762.26, "Time_End": 2764.5800000000004, "Text": " you know, on specific port numbers."}, {"Time_Start": 2765.3, "Time_End": 2770.36, "Text": " If something on the DMZ starts trying to connect back into your land, you don't allow it."}, {"Time_Start": 2771.0600000000004, "Time_End": 2777.1400000000003, "Text": " And so even if it's totally compromised, that's okay, because you still have a firewall protecting your inside land."}, {"Time_Start": 2778.04, "Time_End": 2778.26, "Text": " Yes."}, {"Time_Start": 2781.7000000000003, "Time_End": 2784.42, "Text": " The question is, that could be improved with a cascading firewall?"}, {"Time_Start": 2784.98, "Time_End": 2785.34, "Text": " Sure."}, {"Time_Start": 2786.26, "Time_End": 2786.7400000000002, "Text": " Question."}, {"Time_Start": 2790.98, "Time_End": 2794.2200000000003, "Text": " Is there a reason why some services don't go through a firewall?"}, {"Time_Start": 2795.3, "Time_End": 2803.0600000000004, "Text": " like voice. Some of the new multimedia protocols are very complex. They open up a control"}, {"Time_Start": 2803.0600000000004, "Time_End": 2809.5800000000004, "Text": " channel and then they send all sorts of port number information about it, about the connection,"}, {"Time_Start": 2809.5800000000004, "Time_End": 2816.02, "Text": " and then they open up a whole bunch of random high TCP ports in order to send the data."}, {"Time_Start": 2816.02, "Time_End": 2821.82, "Text": " Those of you who have worked with other access control lists, etc., you know that FTP"}, {"Time_Start": 2821.82, "Time_End": 2825.28, "Text": " is sort of a strange protocol, right? It's a strange, not well-"}, {"Time_Start": 2825.3, "Time_End": 2830.82, "Text": " behaving protocol because once you do that port 21 port 20 thing you get it set up and then"}, {"Time_Start": 2830.82, "Time_End": 2834.6600000000003, "Text": " all of a sudden there's this discussion between the server and the client about which random high"}, {"Time_Start": 2834.6600000000003, "Time_End": 2839.6200000000003, "Text": " TCP port number are we going to use for the data channel well if you have a static access control"}, {"Time_Start": 2839.6200000000003, "Time_End": 2846.1800000000003, "Text": " list you can't prepare for that because if somebody's picking port you know 5,021 well you can't"}, {"Time_Start": 2846.1800000000003, "Time_End": 2851.2200000000003, "Text": " you can't you know you can't set up an access control list that you're constantly changing for that so"}, {"Time_Start": 2851.2200000000003, "Time_End": 2855.2200000000003, "Text": " ftp is special ftp is different and that's why you need a firewall that"}, {"Time_Start": 2855.3, "Time_End": 2859.78, "Text": " that's smart enough to understand the protocol and actually sniff the packets and this is what an"}, {"Time_Start": 2859.78, "Time_End": 2864.02, "Text": " ft you know this is how ftp is handled in a firewall is the firewall is the firewalls actually sniffing"}, {"Time_Start": 2864.02, "Time_End": 2870.1000000000004, "Text": " the control channel and says oh you want port 5211 open well it temporarily makes a hole in the"}, {"Time_Start": 2870.1000000000004, "Time_End": 2875.54, "Text": " firewall just for those IP addresses and just that port number and only until the only while the connection"}, {"Time_Start": 2875.54, "Time_End": 2882.5, "Text": " is valid so if you're running some of these um uh sort sort of the new Microsoft multimedia"}, {"Time_Start": 2882.5, "Time_End": 2885.2200000000003, "Text": " what h323 or whatever they are i don't know that i don't know that i don't know"}, {"Time_Start": 2885.3, "Time_End": 2890.26, "Text": " all the details you need a firewall that understands them and can sniff the control channel"}, {"Time_Start": 2890.26, "Time_End": 2896.1000000000004, "Text": " and say oh okay i need to open up these five high tcp ports it has to be a dynamic"}, {"Time_Start": 2896.1000000000004, "Time_End": 2900.6600000000003, "Text": " intelligent thing you can't just you know set set something where we're going to allow this or we're"}, {"Time_Start": 2900.6600000000003, "Time_End": 2904.98, "Text": " not going to allow that it requires some real dynamic thinking going on in order to make"}, {"Time_Start": 2904.98, "Time_End": 2911.46, "Text": " that work it's just about time so i'm going to release you we're starting again at four"}, {"Time_Start": 2911.46, "Time_End": 2914.5800000000004, "Text": " o'clock on the dot and ask me questions here in between"}, {"Time_Start": 2915.3, "Time_End": 2927.3, "Text": " of nat for newbies and not so newbies we're going to run until 4.50 p.m."}, {"Time_Start": 2929.3, "Time_End": 2934.1000000000004, "Text": " We have several more issues to discuss. I'm going to talk about the benefits of using"}, {"Time_Start": 2934.1000000000004, "Time_End": 2938.98, "Text": " that. I'm going to talk about some special firewall configuration issues. I'm going to talk about"}, {"Time_Start": 2938.98, "Time_End": 2945.1400000000003, "Text": " DNS. Questions at this point. Those of you who were here before, any"}, {"Time_Start": 2945.3, "Time_End": 2950.02, "Text": " any lingering questions anything that we can talk about before we go forward?"}, {"Time_Start": 2975.3, "Time_End": 2980.84, "Text": " Even if you have NAT configured properly and you have a lot of people on your land who are using hide mode,"}, {"Time_Start": 2981.84, "Time_End": 2990.76, "Text": " the question is what else can you do to protect yourself from what your ISP or somebody who is sniffing your T1 line, say,"}, {"Time_Start": 2990.76, "Time_End": 2991.96, "Text": " and has figured out you're using that?"}, {"Time_Start": 2993.34, "Time_End": 3002.78, "Text": " Well, if you think the intrusion is only local to you, it's only between your gateway router and your ISP or something like that,"}, {"Time_Start": 3003.52, "Time_End": 3005.28, "Text": " go find another ISP someone."}, {"Time_Start": 3005.3, "Time_End": 3010.3, "Text": " who's willing to make, who's willing to be the other end of a VPN and just tunnel to them."}, {"Time_Start": 3010.3, "Time_End": 3018.3, "Text": " Find somebody, anybody on the internet who's willing to be the other end of a VPN and just tunnel all of your company's traffic through that box."}, {"Time_Start": 3018.3, "Time_End": 3023.3, "Text": " In other words, you'll be, you know, on a VPN, just to be really clear, is an authenticated,"}, {"Time_Start": 3023.3, "Time_End": 3028.3, "Text": " encrypted, private channel over the public internet or over a public network."}, {"Time_Start": 3028.3, "Time_End": 3034.3, "Text": " So you could have your entire company VPN through your public ISP over to somebody, anybody."}, {"Time_Start": 3034.3, "Time_End": 3037.3, "Text": " Anybody. Pick somebody in Australia for 20 bucks a month. It doesn't matter."}, {"Time_Start": 3037.3, "Time_End": 3042.3, "Text": " And then you get then from there, you will emerge from the tunnel and be released out on the internet."}, {"Time_Start": 3042.3, "Time_End": 3045.3, "Text": " And your ISP or anybody who's sniffing your T1 line, what do they see?"}, {"Time_Start": 3045.3, "Time_End": 3050.3, "Text": " They see a ton of encrypted traffic and the value to them should be zero."}, {"Time_Start": 3050.3, "Time_End": 3055.3, "Text": " So if it's local to you like that, then find another place to emerge on the internet."}, {"Time_Start": 3055.3, "Time_End": 3059.3, "Text": " Or find another ISP or whatever. That would be one way to do it."}, {"Time_Start": 3059.3, "Time_End": 3061.3, "Text": " Other questions?"}, {"Time_Start": 3064.3, "Time_End": 3067.3, "Text": " Okay, I'm going to talk about the benefits of using that."}, {"Time_Start": 3067.3, "Time_End": 3071.3, "Text": " The reason I developed this talk was because I think that is really cool."}, {"Time_Start": 3071.3, "Time_End": 3075.3, "Text": " I think you get an awful lot of benefits for very little hassle."}, {"Time_Start": 3075.3, "Time_End": 3078.3, "Text": " I find it really valuable."}, {"Time_Start": 3078.3, "Time_End": 3081.3, "Text": " So there's basically four main issues here."}, {"Time_Start": 3081.3, "Time_End": 3084.3, "Text": " You can hide your internal network structure from outsiders."}, {"Time_Start": 3084.3, "Time_End": 3089.3, "Text": " Structurally block all connections from the Internet to your hosts using hide mode,"}, {"Time_Start": 3089.3, "Time_End": 3092.3, "Text": " preserve scarce IP addresses,"}, {"Time_Start": 3092.3, "Time_End": 3093.3, "Text": " and something called preventing leakage."}, {"Time_Start": 3093.3, "Time_End": 3097.2000000000003, "Text": " called preventing leakage around your firewall, which we'll talk about."}, {"Time_Start": 3097.2000000000003, "Time_End": 3104.3, "Text": " The first one here, since network address translation provides the logical bridge between"}, {"Time_Start": 3104.3, "Time_End": 3112.3, "Text": " your internal LAN IP addresses which you created and your external IP addresses, which, you know,"}, {"Time_Start": 3112.3, "Time_End": 3118.1000000000004, "Text": " those are the ones you got from your ISP or IANA, since you can completely control what happens inside"}, {"Time_Start": 3118.1000000000004, "Time_End": 3123.28, "Text": " and you can completely control that logical bridging, you can do whatever you want on the"}, {"Time_Start": 3123.3, "Time_End": 3129.3, "Text": " inside and basically structure it so that you can control what people on the outside see."}, {"Time_Start": 3129.3, "Time_End": 3134.3, "Text": " You know, on the outside you could have, you know, five IP addresses in numeric sequence,"}, {"Time_Start": 3134.3, "Time_End": 3139.3, "Text": " but they really represent, you know, servers that are on five different DMZ subnets."}, {"Time_Start": 3139.3, "Time_End": 3140.3, "Text": " Whatever."}, {"Time_Start": 3140.3, "Time_End": 3147.3, "Text": " What matters is, is you can completely delink what people see on the outside from what's actually happening on the inside."}, {"Time_Start": 3147.3, "Time_End": 3152.3, "Text": " You know, we talk about tools like NMAP and port scanning, etc., right?"}, {"Time_Start": 3152.3, "Time_End": 3165.3, "Text": " whole point, if you're sort of, you know, if you were a hacker and you're doing your basic research on some company and you were considering seeing what you, seeing what sort of mischief you can get up to with them, what's the first thing you're going to do?"}, {"Time_Start": 3165.3, "Time_End": 3182.28, "Text": " You're going to try to scan their public IP addresses, right? You're going to find out, well, what subnets do they have, what do they own, what domain names do they have registered, these IP addresses, okay, let's do a port scan, okay, look, they've got a web server at these addresses, they respond to FTP at these addresses. Oh, look, there's one of their mail servers, right? This is easy stuff."}, {"Time_Start": 3182.3, "Time_End": 3184.3, "Text": " This is public information, basically."}, {"Time_Start": 3184.3, "Time_End": 3194.3, "Text": " But the nice thing is, if you're using NAT, then getting all of that public external information gives you zero information about what's happening inside."}, {"Time_Start": 3194.3, "Time_End": 3197.3, "Text": " So this is the main benefit of NAT."}, {"Time_Start": 3197.3, "Time_End": 3203.3, "Text": " You can make the outside look like whatever you want, and it's completely orthogonal to what's happening on the inside."}, {"Time_Start": 3203.3, "Time_End": 3205.3, "Text": " There's absolutely no relation at all. Question."}, {"Time_Start": 3212.3, "Time_End": 3227.84, "Text": " Okay, the question is you've got a NAT box running as an FTP server?"}, {"Time_Start": 3227.84, "Time_End": 3230.2400000000002, "Text": " Yeah, let's just say, for example."}, {"Time_Start": 3230.2400000000002, "Time_End": 3242.28, "Text": " Well, okay, well, I guess I'd start off by saying that that's a bad idea. You should, you know, move your FTP server into the DMZ. I mean, FTP is notorious, you know. I mean, in my lab, my FTP server,"}, {"Time_Start": 3242.3, "Time_End": 3248.46, "Text": " it got ransacked two months ago through FTP. So I'm here to tell you, I don't like FTP. It's a bad thing to be serving."}, {"Time_Start": 3249.26, "Time_End": 3255.46, "Text": " So, no, you don't want, you don't want somebody to be able to do something evil with FTP and then gain control of your Knot box."}, {"Time_Start": 3255.5800000000004, "Time_End": 3261.9, "Text": " Oh man, you just gave them the keys. So first of all, separate those out. Make your not box firewall just a not box firewall."}, {"Time_Start": 3261.9, "Time_End": 3266.2200000000003, "Text": " In fact, strip that thing down so there's nothing on it, except your not in your firewall."}, {"Time_Start": 3267.02, "Time_End": 3272.28, "Text": " So if I'm going to, here, I'll rephrase your question. If you do have a FTP"}, {"Time_Start": 3272.3, "Time_End": 3278.3, "Text": " server inside and you're making it available to outsiders using, say, static mode net,"}, {"Time_Start": 3278.5600000000004, "Time_End": 3283.7400000000002, "Text": " yeah, people can tell that you've got, you know, people do a port scan, they will be able to tell,"}, {"Time_Start": 3283.82, "Time_End": 3288.1000000000004, "Text": " yeah, there's an FTP server there at that IP address. That's what you want. You're making it public."}, {"Time_Start": 3288.5, "Time_End": 3293.88, "Text": " I mean, that's why you have an FTP server. So, yes, if you want people to be able to connect to your"}, {"Time_Start": 3293.88, "Time_End": 3298.96, "Text": " mail server, web server, FTP server, then yes, if they do a port scan, they will see those ports open."}, {"Time_Start": 3299.2400000000002, "Time_End": 3302.28, "Text": " That's the point. But you've limited it to, you've limited it to, you."}, {"Time_Start": 3302.3, "Time_End": 3307.2400000000002, "Text": " You've limited it to exactly which IP addresses you want and exactly which port numbers you want."}, {"Time_Start": 3307.6600000000003, "Time_End": 3311.1200000000003, "Text": " And you're not giving away any information about the inside structure."}, {"Time_Start": 3311.2200000000003, "Time_End": 3318.1600000000003, "Text": " All you're giving away is that somewhere in your organization, there's an FTP server, but who knows what that address is?"}, {"Time_Start": 3318.1600000000003, "Time_End": 3320.5600000000004, "Text": " It's probably a private, non-routable inside address, right?"}, {"Time_Start": 3320.6600000000003, "Time_End": 3322.4, "Text": " I mean, nobody, you know, you're not giving away anything."}, {"Time_Start": 3322.54, "Time_End": 3328.42, "Text": " You're giving away the fact that an FTP site exists at your company, but you've already told people that."}, {"Time_Start": 3328.5, "Time_End": 3330.1200000000003, "Text": " So that's not giving away anything more."}, {"Time_Start": 3330.12, "Time_End": 3332.4, "Text": " Other questions?"}, {"Time_Start": 3334.56, "Time_End": 3340.62, "Text": " Okay, so this is the main benefit of NAD, is you can completely decouple your internal structure"}, {"Time_Start": 3340.62, "Time_End": 3344.8399999999997, "Text": " from your external structure, say your external IP structure."}, {"Time_Start": 3345.2999999999997, "Time_End": 3348.18, "Text": " So let script kitties do all the port scanning they want."}, {"Time_Start": 3348.44, "Time_End": 3352.5, "Text": " All they're going to find out is that, yeah, your company has a web server, duh."}, {"Time_Start": 3353.58, "Time_End": 3358.44, "Text": " They're going to find out, yeah, your company has an FTP server, you're a genius, and you've"}, {"Time_Start": 3358.44, "Time_End": 3359.1, "Text": " got a mail server."}, {"Time_Start": 3359.54, "Time_End": 3359.7999999999997, "Text": " All right."}, {"Time_Start": 3360.12, "Time_End": 3364.62, "Text": " you're still a genius. That, okay, that doesn't do them any good. So your public IP address"}, {"Time_Start": 3364.62, "Time_End": 3371.3199999999997, "Text": " structure is designed independently of your internal structure. Another benefit"}, {"Time_Start": 3371.3199999999997, "Time_End": 3381.58, "Text": " to NAT, hosts are protected by hide mode, don't have a public IP address. This is crucial. In"}, {"Time_Start": 3381.58, "Time_End": 3385.5, "Text": " the previous hour, we talked about in hide mode how someone can try to make a connection into"}, {"Time_Start": 3385.5, "Time_End": 3390.1, "Text": " one of the machines on your land. Well, the machines on your land, well, the machines on your land,"}, {"Time_Start": 3390.12, "Time_End": 3392.1, "Text": " don't have a public IP address."}, {"Time_Start": 3392.66, "Time_End": 3398.08, "Text": " Okay, this is even better than an access control list. This is even better than a router or a firewall saying,"}, {"Time_Start": 3398.18, "Time_End": 3402.9, "Text": " oh, you know, we're not going to allow people to connect to this particular IP address with this port number."}, {"Time_Start": 3403.52, "Time_End": 3406.56, "Text": " It's even better because this IP address doesn't even exist."}, {"Time_Start": 3407.3599999999997, "Time_End": 3412.22, "Text": " I mean, this is, this is much better than access control list. This is, you've made an architectural change"}, {"Time_Start": 3412.22, "Time_End": 3418.62, "Text": " or it's being completely blocked by architecture. They can't even, they can't even tell that those machines exist."}, {"Time_Start": 3418.62, "Time_End": 3423.92, "Text": " somebody on the outside could be ping in that machine all day long. Well, first of all, what address would they ping?"}, {"Time_Start": 3424.16, "Time_End": 3429.7, "Text": " Well, there is no address they could ping. So you can't even get started. So that's a real benefit."}, {"Time_Start": 3432.74, "Time_End": 3439.8599999999997, "Text": " A third benefit to network address translation is to preserve scarce IPV4 IP addresses."}, {"Time_Start": 3440.74, "Time_End": 3445.3199999999997, "Text": " How many people here have heard of something called IPV6 coming along real soon now?"}, {"Time_Start": 3445.8199999999997, "Time_End": 3448.22, "Text": " Okay, any year now. I know we're working on it."}, {"Time_Start": 3448.62, "Time_End": 3458.8599999999997, "Text": " Back with the internet, you know, we're first starting, you know, the concept of a 32-bit IP address that is such a vast IP address space."}, {"Time_Start": 3458.94, "Time_End": 3461.7, "Text": " Nobody thought we'd ever run out. Well, clearly, we're running out."}, {"Time_Start": 3464.42, "Time_End": 3472.0, "Text": " The same thing about 20 meg hard drives, right? I mean, if a guy like me can have 16 IP addresses in his house, you know, we're going to run out soon."}, {"Time_Start": 3473.52, "Time_End": 3478.54, "Text": " So there are only 128 class A."}, {"Time_Start": 3478.62, "Time_End": 3484.68, "Text": " IP address blocks. That's all there are. There are only 32,000 class Bs and only about 8 million"}, {"Time_Start": 3484.68, "Time_End": 3489.94, "Text": " class Cs. We're running out. I'll show you some examples here of people, you know, sort of grabbing more"}, {"Time_Start": 3489.94, "Time_End": 3493.7, "Text": " than they needed. There's some humorous examples here we'll get to. But the fact is,"}, {"Time_Start": 3493.74, "Time_End": 3498.4, "Text": " there just aren't enough. I mean, every organization who's bigger than five people is going to claim"}, {"Time_Start": 3498.4, "Time_End": 3501.9, "Text": " they want their own class B, and there just aren't enough to go around."}, {"Time_Start": 3503.8199999999997, "Time_End": 3506.2, "Text": " Non-market allocation adds to scarcity."}, {"Time_Start": 3508.62, "Time_End": 3515.46, "Text": " IP addresses, once they're assigned, they tend to have fairly strong squatters rights."}, {"Time_Start": 3515.88, "Time_End": 3521.3599999999997, "Text": " So once your company gets a Class B or a Class A, you tend to hold on to it and resist people taking it from you."}, {"Time_Start": 3521.96, "Time_End": 3523.52, "Text": " And we'll see here some examples."}, {"Time_Start": 3523.68, "Time_End": 3527.74, "Text": " One of the reasons we tend to be running out of IP address blocks."}, {"Time_Start": 3528.2999999999997, "Time_End": 3530.2, "Text": " And also routing table restrictions."}, {"Time_Start": 3531.2999999999997, "Time_End": 3538.6, "Text": " The central core routers on the Internet have to have routing table entries for basically every single value."}, {"Time_Start": 3538.62, "Time_End": 3540.62, "Text": " IP address in the world."}, {"Time_Start": 3540.62, "Time_End": 3545.62, "Text": " And my understanding, I'm sure there's someone in this room who knows this better than I,"}, {"Time_Start": 3545.62, "Time_End": 3550.12, "Text": " but my understanding, just a year or two ago, I read an article saying, well, it's bigger than 64 megs now"}, {"Time_Start": 3550.12, "Time_End": 3555.62, "Text": " and approaching 128, and it's really causing a problem because a lot of those routers only have 128 megs."}, {"Time_Start": 3555.62, "Time_End": 3562.62, "Text": " Well, first of all, imagine how difficult it is for a router to dynamically search through a 128 megabyte routing table"}, {"Time_Start": 3562.62, "Time_End": 3566.62, "Text": " to figure out which, you know, which dick it should send this packet out on."}, {"Time_Start": 3566.62, "Time_End": 3567.62, "Text": " So the more IP of it."}, {"Time_Start": 3567.62, "Time_End": 3573.04, "Text": " The more IP addresses you have out there and the more fragmented they become, the harder it is to keep straight where you route things."}, {"Time_Start": 3573.14, "Time_End": 3579.24, "Text": " Because a router on the central part of the Internet has to be able to handle pretty much every packet that comes its way."}, {"Time_Start": 3582.2999999999997, "Time_End": 3584.06, "Text": " Okay, let's talk about squatters' rights."}, {"Time_Start": 3584.62, "Time_End": 3585.9, "Text": " This is interesting stuff."}, {"Time_Start": 3587.74, "Time_End": 3591.3399999999997, "Text": " I was getting curious about who owns all the Class A address blocks."}, {"Time_Start": 3591.46, "Time_End": 3595.2, "Text": " These are 1 through 127, I guess 0 through 127."}, {"Time_Start": 3596.4, "Time_End": 3597.24, "Text": " Here's some of them."}, {"Time_Start": 3597.62, "Time_End": 3601.68, "Text": " 40. If you ever see a packet coming from 40, you can thank Eli Lilly & Company."}, {"Time_Start": 3602.06, "Time_End": 3606.64, "Text": " Now, what are Eli Lilly and company doing with a full Class A address block? I don't know."}, {"Time_Start": 3606.7, "Time_End": 3610.66, "Text": " That makes them equivalent to Sprint, I think, in terms of how many IP addresses they have."}, {"Time_Start": 3610.8599999999997, "Time_End": 3619.7799999999997, "Text": " This is stupid. Prudential securities, E.I. DuPont, Merck, Boeing? I mean, Boeing, give me a break."}, {"Time_Start": 3620.18, "Time_End": 3625.2599999999998, "Text": " I mean, with a Class B, you could give an IP address to every seat on every plane Boeing is ever sold, I think."}, {"Time_Start": 3627.62, "Time_End": 3633.38, "Text": " Another one here, which I think recently got yanked, was Mercedes-Benz had 53."}, {"Time_Start": 3634.7999999999997, "Time_End": 3646.02, "Text": " I like Mercedes-Benz, but, you know, I'm pretty sure that if I were allowed to use NAT, I could hide any one of these companies behind a Class C address block, right?"}, {"Time_Start": 3646.8199999999997, "Time_End": 3650.24, "Text": " I mean, for any size company, I mean, how many public IP addresses do you need?"}, {"Time_Start": 3650.3599999999997, "Time_End": 3653.3199999999997, "Text": " A couple of web servers, couple of mail servers, couple FTP servers, right?"}, {"Time_Start": 3653.7, "Time_End": 3654.3599999999997, "Text": " How many do you need?"}, {"Time_Start": 3654.48, "Time_End": 3657.46, "Text": " 10, 12, and then maybe one hide address?"}, {"Time_Start": 3657.62, "Time_End": 3662.22, "Text": " for me to hide the rest of your people behind, or maybe a range, but still, I'm willing to bet."}, {"Time_Start": 3662.66, "Time_End": 3667.38, "Text": " If you let me spend money on hardware like I want to, I could hide any corporation in America"}, {"Time_Start": 3667.38, "Time_End": 3672.44, "Text": " behind a single, classy IP address block. You don't need, however, $16 million or some ridiculous number"}, {"Time_Start": 3672.44, "Time_End": 3678.24, "Text": " of IP addresses. So I'm looking here at number 48, Prudential Securities. They got it in May of 1995."}, {"Time_Start": 3678.68, "Time_End": 3684.0, "Text": " Well, everyone talks about 1995 is the year the Internet really took off. It looks like they just"}, {"Time_Start": 3684.0, "Time_End": 3687.6, "Text": " got in under the wire. This is probably, from my looking through IM."}, {"Time_Start": 3687.62, "Time_End": 3692.8399999999997, "Text": " his website, this is the last corporate Class A giveaway. Some lucky guys, they're over"}, {"Time_Start": 3692.8399999999997, "Time_End": 3697.2, "Text": " at Prudential, pulling down a whole Class A for the company. Now would be a whole lot"}, {"Time_Start": 3697.2, "Time_End": 3704.16, "Text": " harder. So, as you can see, if, you know, if these guys like Eli Lilly can grab a whole"}, {"Time_Start": 3704.16, "Time_End": 3709.48, "Text": " class A, you know, obviously we're not allocating IPV4 addresses very efficiently, and this is one"}, {"Time_Start": 3709.48, "Time_End": 3710.52, "Text": " of the reasons we're running out."}, {"Time_Start": 3714.3199999999997, "Time_End": 3716.52, "Text": " So here, back to that."}, {"Time_Start": 3717.62, "Time_End": 3721.9, "Text": " The reason you're able to use NAT to preserve scarce IP addresses is because all of your"}, {"Time_Start": 3721.9, "Time_End": 3727.4, "Text": " internal machines have private non-routables, and then the only ones that you need for the outside"}, {"Time_Start": 3727.4, "Time_End": 3731.2599999999998, "Text": " are the static addresses that you're using for people to come to your servers and the"}, {"Time_Start": 3731.2599999999998, "Time_End": 3732.7999999999997, "Text": " hide mode addresses that you're using."}, {"Time_Start": 3732.7999999999997, "Time_End": 3738.18, "Text": " So almost any company could turn in their Class A if they wanted to and pick up a Class"}, {"Time_Start": 3738.18, "Time_End": 3742.18, "Text": " C and probably do just fine."}, {"Time_Start": 3742.18, "Time_End": 3746.68, "Text": " Another benefit of NAT, number four, is preventing leakage around your firewall. How many"}, {"Time_Start": 3746.6800000000003, "Time_End": 3750.88, "Text": " people here are sort of network administrators or sys admins or something like that"}, {"Time_Start": 3750.88, "Time_End": 3754.6600000000003, "Text": " or you're in charge of a network in some organization. How many people have had somebody"}, {"Time_Start": 3754.6600000000003, "Time_End": 3759.6200000000003, "Text": " in your organization, they get either a dial-up account at their desk, or they get a ricochet"}, {"Time_Start": 3759.6200000000003, "Time_End": 3766.8, "Text": " modem or they get some other way to connect to the internet, and before you know it, they're"}, {"Time_Start": 3766.8, "Time_End": 3770.2400000000002, "Text": " starting to route internal land packets through their private connection. Has that happened"}, {"Time_Start": 3770.2400000000002, "Time_End": 3776.28, "Text": " to anybody here? It's a real issue that, you know, somebody at work, well, as we all know, the"}, {"Time_Start": 3776.28, "Time_End": 3780.1600000000003, "Text": " most dangerous thing in the world is a helpful engineer with a screwdriver. But let's say"}, {"Time_Start": 3780.1600000000003, "Time_End": 3784.4, "Text": " you get somebody at your office who's sick and tired of not being able to get through the firewall"}, {"Time_Start": 3784.4, "Time_End": 3788.2400000000002, "Text": " to do whatever he wants. So he gets a dial-up account and he gets a modem line in his office"}, {"Time_Start": 3788.2400000000002, "Time_End": 3793.32, "Text": " and he starts dialing out. Well, let's say he's running Windows NT server, he accidentally checks"}, {"Time_Start": 3793.32, "Time_End": 3797.6000000000004, "Text": " the forward packets box, and what do you know? He's got a server connected to the internet without"}, {"Time_Start": 3797.6000000000004, "Time_End": 3801.84, "Text": " protection and now he's routing between the internet in your land and it's not going through your firewall."}, {"Time_Start": 3801.84, "Time_End": 3806.26, "Text": " Well, this is real trouble. So one of the things that network addresses,"}, {"Time_Start": 3806.28, "Time_End": 3811.2200000000003, "Text": " translation does for you is it helps prevent this leakage. I call this leakage. If you're"}, {"Time_Start": 3811.2200000000003, "Time_End": 3816.6000000000004, "Text": " setting up a security perimeter and you've got your firewall, I mean, the whole point is that all of"}, {"Time_Start": 3816.6000000000004, "Time_End": 3821.5800000000004, "Text": " the traffic has to go through that checkpoint, right? If some of your traffic is leaking around your"}, {"Time_Start": 3821.5800000000004, "Time_End": 3825.9, "Text": " firewall and you're in that box, well, that's not very secure because you can be sure hackers are going"}, {"Time_Start": 3825.9, "Time_End": 3831.9, "Text": " to be leaking back, well, taking it, yeah, okay, leaking back in the other direction. So this is not good."}, {"Time_Start": 3831.9, "Time_End": 3840.6, "Text": " So if you force all of your traffic, well, if you use network address translation, then you're forcing all of your traffic to go through the NAT box."}, {"Time_Start": 3840.6800000000003, "Time_End": 3844.04, "Text": " You can't leak around it because your addresses aren't any good."}, {"Time_Start": 3844.04, "Time_End": 3860.06, "Text": " So since the state tables on your NAT box are private to your NAT box, and since, therefore, nobody else can get in there and sort of figure out what's going on, if somebody does leak, the private address they have is worthless on the outside."}, {"Time_Start": 3860.26, "Time_End": 3861.88, "Text": " So let's say somebody with a machine with a 1-190."}, {"Time_Start": 3861.9, "Time_End": 3869.7000000000003, "Text": " 192168 dials up somewhere and connects to somebody and starts routing, well, that 192-168 isn't going anywhere, right?"}, {"Time_Start": 3869.7400000000002, "Time_End": 3873.5, "Text": " It's a private, non-routable address. That's the point. It's worthless on the Internet."}, {"Time_Start": 3875.08, "Time_End": 3879.8, "Text": " Public addresses are worthless on the inside because they have to go through the network address translation."}, {"Time_Start": 3880.7000000000003, "Time_End": 3884.94, "Text": " And traffic that leaks around the firewall has senseless IP address translation."}, {"Time_Start": 3885.48, "Time_End": 3891.78, "Text": " So one of the nice things about Nat is that you, not perfectly, but fairly effectively,"}, {"Time_Start": 3891.9, "Time_End": 3896.4, "Text": " ruin the effectiveness of any traffic that tries to leak around your firewall."}, {"Time_Start": 3909.52, "Time_End": 3914.58, "Text": " This is Windows 98. It's taking a little time here."}, {"Time_Start": 3921.9, "Time_End": 3936.14, "Text": " chair up here i have uh i brought 50 copies which clearly isn't enough a print"}, {"Time_Start": 3936.14, "Time_End": 3942.2200000000003, "Text": " out of the presentation so if you want want you come up and grab one now"}, {"Time_Start": 3942.2200000000003, "Time_End": 3948.54, "Text": " oh yeah by the end of the presentation i'll show you here this presentation is already posted on the internet"}, {"Time_Start": 3951.9, "Time_End": 3981.64, "Text": " Man. Okay, the fifth issue here. Let's talk about just some basics, how to configure a firewall for Nat, because Nat is usually done through a firewall. You know, if someone's going to go through the trouble of writing, designing, coding a firewall a firewall, adding Nat is fairly easy. So you should get them."}, {"Time_Start": 3981.9, "Time_End": 3989.08, "Text": " get them as a bundle. I know that checkpoint firewall one, you get Nat with it for free, as they say."}, {"Time_Start": 3989.08, "Time_End": 3991.2200000000003, "Text": " And Cisco Pix has Nat also."}, {"Time_Start": 3995.14, "Time_End": 4005.5, "Text": " The question is, what about the cheap personal hardware firewalls like D-Link? They're great."}, {"Time_Start": 4006.2200000000003, "Time_End": 4011.6600000000003, "Text": " You know, hey, for 300 bucks, geez, you can't go wrong. It's not perfect. You can't do all sorts of crazy"}, {"Time_Start": 4011.6600000000003, "Time_End": 4015.7000000000003, "Text": " configuration stuff. You know, you can't get Microsoft Net Meeting to go through it or something."}, {"Time_Start": 4016.26, "Time_End": 4022.26, "Text": " But man, I strongly recommend everybody have a personal firewall of some sort if you're going to connect"}, {"Time_Start": 4022.26, "Time_End": 4027.9800000000005, "Text": " to the internet. And D-Link or LinkSys, these guys out of Taiwan that make great stuff really"}, {"Time_Start": 4027.9800000000005, "Time_End": 4030.4800000000005, "Text": " inexpensive. It works. I've got a couple of them at home."}, {"Time_Start": 4032.1200000000003, "Time_End": 4038.86, "Text": " I'm sorry, what about Black Ice? Black Ice? I think Steve Gibson's website, I think he"}, {"Time_Start": 4038.86, "Time_End": 4044.9, "Text": " I think he definitively proves it's worthless. So go with something, in his opinion, go with something else."}, {"Time_Start": 4046.1, "Time_End": 4048.1, "Text": " Zone alarm is very good. Yes."}, {"Time_Start": 4050.98, "Time_End": 4051.38, "Text": " Do what?"}, {"Time_Start": 4055.38, "Time_End": 4066.48, "Text": " Do hardware firewalls like D-link and Links? It's not very much. Do hardware firewalls and not-boxes like the D-link or the link-s-sist, do they add much network overhead? I think you really asking, or do they add much latency?"}, {"Time_Start": 4067.2400000000002, "Time_End": 4067.7200000000003, "Text": " No."}, {"Time_Start": 4068.2200000000003, "Time_End": 4068.84, "Text": " Undetectable."}, {"Time_Start": 4068.86, "Time_End": 4074.5, "Text": " milliseconds. Not a problem. It's in hardware. It's a, you know, it's an ASIC."}, {"Time_Start": 4074.5, "Time_End": 4093.78, "Text": " It's, you know, it's an ASIC. It's, you're saying the netgear in particular does have firewall. You're saying the net gear in particular does have firewall?"}, {"Time_Start": 4098.86, "Time_End": 4107.08, "Text": " Okay, the Netgear box includes some rules-based firewall technology from Sonic Wall."}, {"Time_Start": 4107.58, "Time_End": 4113.98, "Text": " One of the ones I use is a D-link box that also provides my wireless, my 802-11B Wi-Fi connection."}, {"Time_Start": 4114.28, "Time_End": 4123.139999999999, "Text": " It is a wireless node and Nat box and firewall with rules together for, I don't know, $230,000, something like that."}, {"Time_Start": 4123.179999999999, "Time_End": 4127.58, "Text": " Whatever. The price is falling. You can't go wrong. You know, get one that has firewall and net."}, {"Time_Start": 4128.86, "Time_End": 4129.62, "Text": " Other questions?"}, {"Time_Start": 4136.62, "Time_End": 4140.42, "Text": " The question is, am I going to address circumvention of Nat device?"}, {"Time_Start": 4141.719999999999, "Time_End": 4142.0199999999995, "Text": " No."}, {"Time_Start": 4143.599999999999, "Time_End": 4149.16, "Text": " This is designed for newbies. This is a tutorial so that the goal is that at the end of this,"}, {"Time_Start": 4149.16, "Time_End": 4155.58, "Text": " you have more confidence and information about setting up Nat rather than confidence in information about cracking it."}, {"Time_Start": 4158.86, "Time_End": 4161.0199999999995, "Text": " Is that the next hour?"}, {"Time_Start": 4161.74, "Time_End": 4163.5, "Text": " We're meeting at a bar downtown."}, {"Time_Start": 4166.219999999999, "Time_End": 4174.46, "Text": " So I hate to be so simplistic here to say that, you know, in order to configure Nat on your firewall,"}, {"Time_Start": 4174.62, "Time_End": 4176.46, "Text": " the first step should be document your network."}, {"Time_Start": 4177.16, "Time_End": 4181.179999999999, "Text": " But it's, gosh, it's awfully important to do that."}, {"Time_Start": 4181.259999999999, "Time_End": 4183.12, "Text": " If you don't know what you have, you don't know where you're going."}, {"Time_Start": 4183.12, "Time_End": 4185.86, "Text": " And it's sometimes a lot of work to really figure out what you've got."}, {"Time_Start": 4186.719999999999, "Time_End": 4188.759999999999, "Text": " You know, I use what I call."}, {"Time_Start": 4188.86, "Time_End": 4196.839999999999, "Text": " the pre-beta version of Vizio, Vizio 0.9, which is a piece of 8.5 by 11 paper and a pencil,"}, {"Time_Start": 4197.0599999999995, "Time_End": 4202.88, "Text": " and I draw, and I make the diagram, and I draw in my, you know, I draw in all my subnets and everything."}, {"Time_Start": 4203.0199999999995, "Time_End": 4204.04, "Text": " And it works just fine."}, {"Time_Start": 4204.58, "Time_End": 4209.5, "Text": " I've got to tell you, it's actually more complex than you think to really sit down and diagram what you've got."}, {"Time_Start": 4209.78, "Time_End": 4211.0, "Text": " You have to be really clear."}, {"Time_Start": 4211.08, "Time_End": 4213.12, "Text": " You have to know, what are your IP subnets here?"}, {"Time_Start": 4213.799999999999, "Time_End": 4215.94, "Text": " You know, what are the default gateways?"}, {"Time_Start": 4215.94, "Time_End": 4217.54, "Text": " What are the subnet masks?"}, {"Time_Start": 4218.099999999999, "Time_End": 4218.839999999999, "Text": " You know, and you've got to learn."}, {"Time_Start": 4218.86, "Time_End": 4224.16, "Text": " all that technology, you know, you have to learn all that terminology, you know, 255-25-25-25-25-25-248."}, {"Time_Start": 4224.259999999999, "Time_End": 4224.86, "Text": " What does that mean?"}, {"Time_Start": 4225.48, "Time_End": 4226.219999999999, "Text": " Got to figure that out."}, {"Time_Start": 4226.339999999999, "Time_End": 4229.82, "Text": " So that's the first part, document your network."}, {"Time_Start": 4230.0599999999995, "Time_End": 4231.62, "Text": " Number two, make a plan."}, {"Time_Start": 4231.719999999999, "Time_End": 4232.7, "Text": " Figure out where you want to be."}, {"Time_Start": 4233.339999999999, "Time_End": 4238.759999999999, "Text": " If you're going to be instituting that for the first time, there's actually some substantial changes you need to make to your network."}, {"Time_Start": 4238.86, "Time_End": 4240.74, "Text": " You're changing all of your internal IP addresses."}, {"Time_Start": 4242.98, "Time_End": 4246.299999999999, "Text": " One of the technical things we've got to talk about here is ARP issues."}, {"Time_Start": 4246.7, "Time_End": 4248.839999999999, "Text": " Just briefly, ARP is a..."}, {"Time_Start": 4248.86, "Time_End": 4252.5199999999995, "Text": " layer three, layer two protocol called Address Resolution Protocol."}, {"Time_Start": 4253.48, "Time_End": 4257.4, "Text": " This is how you convert layer three addresses into Ethernet addresses."}, {"Time_Start": 4257.92, "Time_End": 4259.46, "Text": " Think of it as a vending machine."}, {"Time_Start": 4260.099999999999, "Time_End": 4264.139999999999, "Text": " You put in a Layer 3 address, and what you get out is a Layer 2 address."}, {"Time_Start": 4265.179999999999, "Time_End": 4269.16, "Text": " If somebody's on your local area network and you want to talk to them through Ethernet,"}, {"Time_Start": 4269.219999999999, "Time_End": 4274.0199999999995, "Text": " because that's how you talk to somebody on your land, and you know their IP address, but not their Ethernet address,"}, {"Time_Start": 4274.099999999999, "Time_End": 4278.259999999999, "Text": " you send out an ARP broadcast, you say, yo, anybody out there on this IP address,"}, {"Time_Start": 4278.26, "Time_End": 4281.84, "Text": " and whoever has it answers back and gives you his Ethernet address."}, {"Time_Start": 4282.08, "Time_End": 4285.68, "Text": " Whatever, we're going to talk about ARP here in a minute, but it's a technical detail you need to know."}, {"Time_Start": 4285.76, "Time_End": 4288.280000000001, "Text": " It's sort of one of the few things we need to talk about down at layer two."}, {"Time_Start": 4289.5, "Time_End": 4293.74, "Text": " Also, we have to talk about routing issues, because if you're changing all of your IP addresses,"}, {"Time_Start": 4293.9400000000005, "Time_End": 4295.860000000001, "Text": " well, clearly, you have to change all your routing setups."}, {"Time_Start": 4296.780000000001, "Time_End": 4300.06, "Text": " Also, there's a special thing you have to worry about here."}, {"Time_Start": 4301.06, "Time_End": 4307.08, "Text": " Your firewall is a router first and has a bad attitude second, right?"}, {"Time_Start": 4307.320000000001, "Time_End": 4308.24, "Text": " That's what a firewall."}, {"Time_Start": 4308.26, "Time_End": 4314.04, "Text": " is. It's a router first with an added bad attitude. And when you're setting up your"}, {"Time_Start": 4314.04, "Time_End": 4317.68, "Text": " router, excuse me, when you're setting up your firewall, let's say if you're doing a checkpoint"}, {"Time_Start": 4317.68, "Time_End": 4323.38, "Text": " firewall 1, you know, and it sits on top of a Solaris box or an NT box, you know, you want to"}, {"Time_Start": 4323.38, "Time_End": 4328.66, "Text": " get your NT box up and running first and make sure you can route through it first before you add"}, {"Time_Start": 4328.66, "Time_End": 4334.280000000001, "Text": " the firewall and start dropping packets. So keep that in mind. You know, a firewall is"}, {"Time_Start": 4334.280000000001, "Time_End": 4338.24, "Text": " just a router with some advanced, sophisticated access control."}, {"Time_Start": 4338.26, "Time_End": 4345.320000000001, "Text": " lists and similar types of things. So it's an interesting question if a packet is coming"}, {"Time_Start": 4345.320000000001, "Time_End": 4355.3, "Text": " into your network, it needs to be Natted, say static mode. And while it's in that NAT box,"}, {"Time_Start": 4355.3, "Time_End": 4361.54, "Text": " it's two address for IP. It gets changed, right? It gets changed from the virtual public IP"}, {"Time_Start": 4361.54, "Time_End": 4366.900000000001, "Text": " address into the private one. Well, that brings up an interesting question about routing. Because,"}, {"Time_Start": 4366.900000000001, "Time_End": 4368.24, "Text": " you know, where you route a"}, {"Time_Start": 4368.26, "Time_End": 4389.92, "Text": " packet is based entirely upon what is the two address of that packet. So now you have a packet whose address, you know, its mailing address is changing. So there's issues we have to go over here. We have to talk about, you know, exactly how do you handle that? How do you route a packet whose address is changing dynamically on you? Would you route it to the public one? Do you route it to the private one? Do you route first and Natt first? Whatever. We'll talk about that."}, {"Time_Start": 4398.26, "Time_End": 4405.26, "Text": " Oh, I'm locked up."}, {"Time_Start": 4405.26, "Time_End": 4410.26, "Text": " I should use Linux. Thank you."}, {"Time_Start": 4410.26, "Time_End": 4412.26, "Text": " Oh, here we go."}, {"Time_Start": 4428.26, "Time_End": 4442.26, "Text": " I have this wireless land card here."}, {"Time_Start": 4442.26, "Time_End": 4445.26, "Text": " So I'm probably being hacked."}, {"Time_Start": 4445.26, "Time_End": 4451.26, "Text": " We should expect messages coming up on the screen here."}, {"Time_Start": 4458.26, "Time_End": 4462.26, "Text": " return one of the printouts, please."}, {"Time_Start": 4462.26, "Time_End": 4477.26, "Text": " Thank you."}, {"Time_Start": 4477.26, "Time_End": 4483.26, "Text": " Well, unfortunately this machine. Oh, here we go. We just got some action."}, {"Time_Start": 4483.26, "Time_End": 4487.26, "Text": " We just got some action."}, {"Time_Start": 4487.26, "Time_End": 4488.26, "Text": " Okay."}, {"Time_Start": 4488.26, "Time_End": 4496.26, "Text": " So I'm going to try to continue on this. If not, I can use the whiteboard. In terms of documenting your network, as I said, this is really just the basics."}, {"Time_Start": 4496.26, "Time_End": 4502.26, "Text": " IP addresses, subnets, gateways, routers, firewalls, all connections through the security perimeter."}, {"Time_Start": 4502.26, "Time_End": 4507.26, "Text": " Again, I'm just talking about documenting. What do you have just so you know what you've got currently going?"}, {"Time_Start": 4518.26, "Time_End": 4527.14, "Text": " up here. Making a plan, the main issues are just what are your public and your private"}, {"Time_Start": 4527.14, "Time_End": 4532.18, "Text": " IP addresses, whatever your documentation is, your hand drawing, etc. You need to have it at least"}, {"Time_Start": 4532.18, "Time_End": 4537.1, "Text": " as detailed for what you're doing going forward. And your NAT rules, you need to sort of, you need"}, {"Time_Start": 4537.1, "Time_End": 4541.26, "Text": " to figure out in advance what are you going to do in terms of which machines are going to be in the"}, {"Time_Start": 4541.26, "Time_End": 4545.58, "Text": " land and are going to have hide mode network address translation and which machines are going to be"}, {"Time_Start": 4545.58, "Time_End": 4548.02, "Text": " in your DMZ and have static mode."}, {"Time_Start": 4548.26, "Time_End": 4554.26, "Text": " Man, this is annoying."}, {"Time_Start": 4554.26, "Time_End": 4560.26, "Text": " I hate to reboot because it just takes forever on this machine."}, {"Time_Start": 4560.26, "Time_End": 4563.26, "Text": " See if it works out."}, {"Time_Start": 4563.26, "Time_End": 4568.26, "Text": " I'm waiting for my mouse to come back."}, {"Time_Start": 4568.26, "Time_End": 4572.26, "Text": " Huh?"}, {"Time_Start": 4572.26, "Time_End": 4575.26, "Text": " The engine power?"}, {"Time_Start": 4575.26, "Time_End": 4577.26, "Text": " Yeah, that's next on my list."}, {"Time_Start": 4578.26, "Time_End": 4582.26, "Text": " The question is, let's talk about DNS issues."}, {"Time_Start": 4582.26, "Time_End": 4585.26, "Text": " DNS issues are three slides away."}, {"Time_Start": 4585.26, "Time_End": 4591.26, "Text": " We've already been over at VPN."}, {"Time_Start": 4591.26, "Time_End": 4600.26, "Text": " In case you missed the first hour, there was a question about VPN, about VPN compatibility with network address translation."}, {"Time_Start": 4600.26, "Time_End": 4605.26, "Text": " It's the one sort of barely resolved issue."}, {"Time_Start": 4605.26, "Time_End": 4615.860000000001, "Text": " VPN, well, okay, network address translation works best with, how do we describe them,"}, {"Time_Start": 4615.860000000001, "Time_End": 4621.66, "Text": " well-behaved protocols that do not embed the IP address inside the payload of the packet."}, {"Time_Start": 4621.66, "Time_End": 4626.66, "Text": " Because VPN's, excuse me, because network address translation, your Natbox is changing your IP address"}, {"Time_Start": 4626.66, "Time_End": 4629.860000000001, "Text": " as these packets go in and out of your security perimeter."}, {"Time_Start": 4629.860000000001, "Time_End": 4633.360000000001, "Text": " So a well-behaved protocol, that doesn't matter, they don't care."}, {"Time_Start": 4633.360000000001, "Time_End": 4635.24, "Text": " They only look in the packet itself."}, {"Time_Start": 4635.26, "Time_End": 4639.26, "Text": " for the IP2 and from destination and rely on that."}, {"Time_Start": 4639.26, "Time_End": 4642.26, "Text": " VPNs are special because they've added some security issues in there."}, {"Time_Start": 4642.26, "Time_End": 4644.26, "Text": " They've added some security protections"}, {"Time_Start": 4644.26, "Time_End": 4647.26, "Text": " and that they actually embed the IP address in the payload,"}, {"Time_Start": 4647.26, "Time_End": 4649.26, "Text": " or encrypt it and embed it."}, {"Time_Start": 4649.26, "Time_End": 4653.26, "Text": " And so you can get some problems because on the other end of your VPN,"}, {"Time_Start": 4653.26, "Time_End": 4656.26, "Text": " it sees a packet coming from one IP address,"}, {"Time_Start": 4656.26, "Time_End": 4660.26, "Text": " and yet the inside embedded information gives a different IP address."}, {"Time_Start": 4660.26, "Time_End": 4664.26, "Text": " So there are still issues with VPNs and network address translation."}, {"Time_Start": 4664.26, "Time_End": 4665.26, "Text": " The best solution is a different address translation."}, {"Time_Start": 4665.26, "Time_End": 4669.26, "Text": " is to use an integrated firewall that has both network address translation and VPN,"}, {"Time_Start": 4669.26, "Time_End": 4672.26, "Text": " and that issue will be resolved by itself. Yes."}, {"Time_Start": 4672.26, "Time_End": 4675.26, "Text": " What about hardware VPN?"}, {"Time_Start": 4675.26, "Time_End": 4680.26, "Text": " Oh, I don't have a, I'm not able to really give a recommendation one way or the other."}, {"Time_Start": 4680.26, "Time_End": 4681.26, "Text": " There's a lot of different solutions."}, {"Time_Start": 4681.26, "Time_End": 4687.26, "Text": " IPSEC has emerged as the standard, so if someone is using IPSEC, you should be fine."}, {"Time_Start": 4687.26, "Time_End": 4688.26, "Text": " Yes."}, {"Time_Start": 4688.26, "Time_End": 4694.26, "Text": " We talk about mail servers and at T servers and what they would be exposed."}, {"Time_Start": 4694.26, "Time_End": 4695.26, "Text": " What about people services?"}, {"Time_Start": 4695.26, "Time_End": 4697.26, "Text": " Is everything you say about that?"}, {"Time_Start": 4697.26, "Time_End": 4699.26, "Text": " Google servers, or people servers, or behind the firewall,"}, {"Time_Start": 4699.26, "Time_End": 4701.26, "Text": " and you're employing that,"}, {"Time_Start": 4701.26, "Time_End": 4704.26, "Text": " even though they can give up some of the 14 can be used,"}, {"Time_Start": 4704.26, "Time_End": 4708.26, "Text": " to see that people server a big deal."}, {"Time_Start": 4708.26, "Time_End": 4710.26, "Text": " And is everything you said about those other boxes apply to the server."}, {"Time_Start": 4710.26, "Time_End": 4713.26, "Text": " The question is, I've talked about web servers,"}, {"Time_Start": 4713.26, "Time_End": 4716.26, "Text": " FTP servers, mail servers as being"}, {"Time_Start": 4716.26, "Time_End": 4720.26, "Text": " servers that you want available to people on the outside, on the internet,"}, {"Time_Start": 4720.26, "Time_End": 4722.26, "Text": " and that you put them in the DMZ because of it."}, {"Time_Start": 4722.26, "Time_End": 4724.26, "Text": " And the question is, does the same thing apply to SQL servers?"}, {"Time_Start": 4724.26, "Time_End": 4725.26, "Text": " Yes."}, {"Time_Start": 4725.26, "Time_End": 4728.26, "Text": " You have SQL servers outside your firewall."}, {"Time_Start": 4728.26, "Time_End": 4731.26, "Text": " You have SQL servers outside your firewall."}, {"Time_Start": 4731.26, "Time_End": 4737.26, "Text": " Ask the hackers who own that SQL server to do that for you."}, {"Time_Start": 4737.26, "Time_End": 4739.26, "Text": " I mean, whatever."}, {"Time_Start": 4739.26, "Time_End": 4740.26, "Text": " They need to talk."}, {"Time_Start": 4740.26, "Time_End": 4743.26, "Text": " You have SQL servers outside the firewall that need to"}, {"Time_Start": 4743.26, "Time_End": 4746.26, "Text": " talk back to some."}, {"Time_Start": 4746.26, "Time_End": 4748.26, "Text": " Do it?"}, {"Time_Start": 4748.26, "Time_End": 4753.26, "Text": " The support is the standard by the fraud."}, {"Time_Start": 4753.26, "Time_End": 4754.26, "Text": " I guess."}, {"Time_Start": 4754.26, "Time_End": 4755.26, "Text": " I guess."}, {"Time_Start": 4755.26, "Time_End": 4758.26, "Text": " I guess I don't understand the configuration. Why do you have SQL servers outside the firewall?"}, {"Time_Start": 4758.26, "Time_End": 4777.26, "Text": " I have changed production and commerce servers behind the firewall in the Rout"}, {"Time_Start": 4777.26, "Time_End": 4780.26, "Text": " to allow or not allow those port numbers."}, {"Time_Start": 4780.26, "Time_End": 4782.26, "Text": " And I think you can actually change those port numbers."}, {"Time_Start": 4782.26, "Time_End": 4784.26, "Text": " But if you want to allow someone on the internet access,"}, {"Time_Start": 4784.26, "Time_End": 4791.26, "Text": " internet access to your, you know, whatever server, put it in your DMZ and put the appropriate holes in the firewall. It's no different."}, {"Time_Start": 4791.26, "Time_End": 4794.26, "Text": " Yeah, there's no difference between, you know, SQL server or web server."}, {"Time_Start": 4794.26, "Time_End": 4797.26, "Text": " It's a little strange to make that accessible to someone in the outside world."}, {"Time_Start": 4797.26, "Time_End": 4800.26, "Text": " It sounds a little risky, but there shouldn't be any difference."}, {"Time_Start": 4800.26, "Time_End": 4802.26, "Text": " Excuse me?"}, {"Time_Start": 4802.26, "Time_End": 4804.26, "Text": " Okay."}, {"Time_Start": 4804.26, "Time_End": 4807.26, "Text": " Question, yes."}, {"Time_Start": 4814.26, "Time_End": 4817.26, "Text": " from the outside of your network network"}, {"Time_Start": 4817.26, "Time_End": 4819.26, "Text": " I've got to go to the situation where"}, {"Time_Start": 4819.26, "Time_End": 4821.26, "Text": " make your cable to actual"}, {"Time_Start": 4821.26, "Time_End": 4823.26, "Text": " and the end of work"}, {"Time_Start": 4823.26, "Time_End": 4825.26, "Text": " and you're running on."}, {"Time_Start": 4825.26, "Time_End": 4829.26, "Text": " And I'm like to get through my math"}, {"Time_Start": 4829.26, "Time_End": 4832.26, "Text": " and I think we're in and I don't know if I have a statement"}, {"Time_Start": 4832.26, "Time_End": 4834.26, "Text": " to translate"}, {"Time_Start": 4834.26, "Time_End": 4837.26, "Text": " internal address"}, {"Time_Start": 4837.26, "Time_End": 4840.26, "Text": " but I'm like map rule"}, {"Time_Start": 4840.26, "Time_End": 4843.26, "Text": " to be a good with my board"}, {"Time_Start": 4843.26, "Time_End": 4844.26, "Text": " and forth."}, {"Time_Start": 4844.26, "Time_End": 4858.26, "Text": " Okay, the question involves some"}, {"Time_Start": 4858.26, "Time_End": 4861.26, "Text": " between NAT and VPN,"}, {"Time_Start": 4861.26, "Time_End": 4863.26, "Text": " I guess in particular using a cable modem at home"}, {"Time_Start": 4863.26, "Time_End": 4866.26, "Text": " and trying to use VPN to get back into work."}, {"Time_Start": 4866.26, "Time_End": 4868.26, "Text": " Those interactions are a lot more,"}, {"Time_Start": 4868.26, "Time_End": 4869.26, "Text": " oh, I love this,"}, {"Time_Start": 4869.26, "Time_End": 4872.26, "Text": " are a lot more complicated that,"}, {"Time_Start": 4872.26, "Time_End": 4873.26, "Text": " well, it looks like we,"}, {"Time_Start": 4873.26, "Time_End": 4874.26, "Text": " it looks like we, it looks like we,"}, {"Time_Start": 4874.26, "Time_End": 4877.26, "Text": " It looks like we've got an hour now, don't we?"}, {"Time_Start": 4877.26, "Time_End": 4878.26, "Text": " Yeah."}, {"Time_Start": 4878.26, "Time_End": 4885.26, "Text": " Here comes safe mode, I bet."}, {"Time_Start": 4885.26, "Time_End": 4890.26, "Text": " It's a complicated interaction between..."}, {"Time_Start": 4890.26, "Time_End": 4893.26, "Text": " You might be in safe mode if you got that wire with me."}, {"Time_Start": 4893.26, "Time_End": 4895.26, "Text": " I'm so embarrassed."}, {"Time_Start": 4895.26, "Time_End": 4898.26, "Text": " It's a complicated interaction between Nat and VPN."}, {"Time_Start": 4898.26, "Time_End": 4900.26, "Text": " I'm not prepared to get into the details on it."}, {"Time_Start": 4900.26, "Time_End": 4903.26, "Text": " That's a lot tougher problem to solve."}, {"Time_Start": 4903.26, "Time_End": 4905.26, "Text": " I'm saying that I figured out that"}, {"Time_Start": 4905.26, "Time_End": 4907.26, "Text": " you're not going to be a program"}, {"Time_Start": 4907.26, "Time_End": 4908.26, "Text": " with a high board"}, {"Time_Start": 4908.26, "Time_End": 4910.26, "Text": " would allow the"}, {"Time_Start": 4910.26, "Time_End": 4911.26, "Text": " BPM amount of such"}, {"Time_Start": 4911.26, "Time_End": 4929.26, "Text": " that with the NAP."}, {"Time_Start": 4929.26, "Time_End": 4931.26, "Text": " What kind of box were you,"}, {"Time_Start": 4931.26, "Time_End": 4932.26, "Text": " what kind of not box were using?"}, {"Time_Start": 4932.26, "Time_End": 4933.26, "Text": " What kind of not box were using?"}, {"Time_Start": 4933.26, "Time_End": 4934.26, "Text": " Open BSD?"}, {"Time_Start": 4934.26, "Time_End": 4935.26, "Text": " Okay."}, {"Time_Start": 4935.26, "Time_End": 4936.26, "Text": " Okay."}, {"Time_Start": 4936.26, "Time_End": 4937.26, "Text": " Okay."}, {"Time_Start": 4937.26, "Time_End": 4938.26, "Text": " Other questions?"}, {"Time_Start": 4938.26, "Time_End": 4939.26, "Text": " Yes."}, {"Time_Start": 4939.26, "Time_End": 4943.26, "Text": " Other questions?"}, {"Time_Start": 4943.26, "Time_End": 4944.26, "Text": " Yes."}, {"Time_Start": 4944.26, "Time_End": 4946.26, "Text": " Do ISPs use Natting?"}, {"Time_Start": 4946.26, "Time_End": 4949.26, "Text": " Do ISPs use Natting?"}, {"Time_Start": 4949.26, "Time_End": 4951.26, "Text": " Um..."}, {"Time_Start": 4951.26, "Time_End": 4952.26, "Text": " How..."}, {"Time_Start": 4952.26, "Time_End": 4953.26, "Text": " How..."}, {"Time_Start": 4953.26, "Time_End": 4955.26, "Text": " I said,"}, {"Time_Start": 4955.26, "Time_End": 4957.26, "Text": " Oh,"}, {"Time_Start": 4957.26, "Time_End": 4958.26, "Text": " you're,"}, {"Time_Start": 4958.26, "Time_End": 4959.26, "Text": " you're,"}, {"Time_Start": 4959.26, "Time_End": 4960.26, "Text": " you've got some of the best"}, {"Time_Start": 4960.26, "Time_End": 4961.26, "Text": " experience you can have,"}, {"Time_Start": 4961.26, "Time_End": 4962.26, "Text": " you're behind,"}, {"Time_Start": 4962.26, "Time_End": 4963.26, "Text": " the website,"}, {"Time_Start": 4963.26, "Time_End": 4964.26, "Text": " you guys,"}, {"Time_Start": 4964.26, "Time_End": 4965.26, "Text": " so that I'm"}, {"Time_Start": 4965.26, "Time_End": 4966.26, "Text": " on something to do I."}, {"Time_Start": 4966.26, "Time_End": 4989.26, "Text": " It's a public eye, okay, the question is, the question is, the question is, you went to a Steve Gibson's website, you tested the Shields Up thing, and it reported back that you were on a private network, congratulations, and this was news to you."}, {"Time_Start": 4989.26, "Time_End": 4993.26, "Text": " Are you on a public IP address? It looks like a regular..."}, {"Time_Start": 4996.26, "Time_End": 5004.26, "Text": " Is it possible that your ISP is doing some firewalling for you and protecting some of those port numbers?"}, {"Time_Start": 5004.26, "Time_End": 5021.26, "Text": " Yeah."}, {"Time_Start": 5021.26, "Time_End": 5022.26, "Text": " It might be the..."}, {"Time_Start": 5022.26, "Time_End": 5023.26, "Text": " It might be the..."}, {"Time_Start": 5023.26, "Time_End": 5024.26, "Text": " Well, you've got a public, routable IP address, and I mean, it might be the..."}, {"Time_Start": 5024.26, "Time_End": 5025.26, "Text": " Well, you've got a public routable IP address."}, {"Time_Start": 5025.26, "Time_End": 5026.26, "Text": " And I'm..."}, {"Time_Start": 5026.26, "Time_End": 5029.26, "Text": " I've never heard of an ISP issuing non-routables to anybody."}, {"Time_Start": 5029.26, "Time_End": 5031.26, "Text": " So, I don't know."}, {"Time_Start": 5031.26, "Time_End": 5035.26, "Text": " Oh, you've got an ISP for dial-up who gives you non-routables?"}, {"Time_Start": 5035.26, "Time_End": 5037.26, "Text": " Really?"}, {"Time_Start": 5037.26, "Time_End": 5039.26, "Text": " Oh, sorry to hear that."}, {"Time_Start": 5039.26, "Time_End": 5041.26, "Text": " Other questions?"}, {"Time_Start": 5041.26, "Time_End": 5042.26, "Text": " Yes."}, {"Time_Start": 5042.26, "Time_End": 5046.26, "Text": " So I just assume that all companies use that."}, {"Time_Start": 5046.26, "Time_End": 5047.26, "Text": " Am I wrong with that?"}, {"Time_Start": 5047.26, "Time_End": 5049.26, "Text": " The question is, should I assume..."}, {"Time_Start": 5049.26, "Time_End": 5051.26, "Text": " I've always assumed..."}, {"Time_Start": 5051.26, "Time_End": 5053.26, "Text": " This sounds like a hacker question."}, {"Time_Start": 5053.26, "Time_End": 5055.26, "Text": " I've always assumed that companies would use that."}, {"Time_Start": 5055.26, "Time_End": 5060.26, "Text": " I'm surprised that I'm only seeing the impression that most companies don't use NAT."}, {"Time_Start": 5060.26, "Time_End": 5069.26, "Text": " The question is you've always assumed most companies use NAT, and now I guess I'm talking here sort of implying that not all companies use NAT and maybe they should get with the program."}, {"Time_Start": 5069.26, "Time_End": 5070.26, "Text": " I don't really know."}, {"Time_Start": 5070.26, "Time_End": 5076.26, "Text": " I think there's a lot of companies, I mean, all the companies I've worked for, I mean, everybody is desperately short of time and resources."}, {"Time_Start": 5076.26, "Time_End": 5083.26, "Text": " And if a company's been around for a long time and they've got public addresses and it seems to work and, you know, they haven't been hacked severely recently,"}, {"Time_Start": 5083.26, "Time_End": 5084.26, "Text": " there's no incentive for people to change that."}, {"Time_Start": 5084.26, "Time_End": 5093.26, "Text": " for people to change that. If you, you know, if you're Eli Lilly and company and you've got a Class A and you want to preserve your squatters rights, what are you going to do?"}, {"Time_Start": 5093.26, "Time_End": 5104.26, "Text": " You're going to make as much use of those addresses as you can, right? You're going to, you know, you're not going to hide behind a single Class C and then sit around and wait for someone to grab that Class A out of your hands, right? You're going to make as much use of that as you can."}, {"Time_Start": 5104.26, "Time_End": 5107.76, "Text": " The coffee pot at Eli Lilly has its own IP address."}, {"Time_Start": 5107.76, "Time_End": 5114.24, "Text": " So, um, I don't know. I don't really know what the, what the, what, how to, how to, how to, how to, how to, how to, how to,"}, {"Time_Start": 5114.26, "Time_End": 5118.16, "Text": " really answer that question. I suspect there's an awful lot of organizations out there"}, {"Time_Start": 5118.16, "Time_End": 5123.74, "Text": " who many years ago got the network working once and then dropped it and went on to other"}, {"Time_Start": 5123.74, "Time_End": 5127.52, "Text": " emergencies and haven't been back, you know. You know how things get typically"}, {"Time_Start": 5127.52, "Time_End": 5131.66, "Text": " configured, right? You get it working once and then it's not your most important five alarm"}, {"Time_Start": 5131.66, "Time_End": 5135.26, "Text": " fire and so you don't get back to it and well, you know, everyone's getting on the internet and no"}, {"Time_Start": 5135.26, "Time_End": 5140.06, "Text": " one's complaining and, you know, I, you know, I got to go, I got to do something else. I don't"}, {"Time_Start": 5140.06, "Time_End": 5144.24, "Text": " have time. So I suspect there's lots of companies out there who have firewalls who aren't using that,"}, {"Time_Start": 5144.26, "Time_End": 5147.56, "Text": " And, uh, yeah, I imagine so, but I don't have data on it."}, {"Time_Start": 5148.400000000001, "Time_End": 5149.1, "Text": " Uh, yes, question."}, {"Time_Start": 5174.26, "Time_End": 5179.72, "Text": " that your organization is a real pain and you're exactly right you sort of have to do it in one"}, {"Time_Start": 5179.72, "Time_End": 5185.9400000000005, "Text": " swell foop it's it's a lot of work it's a it's a long bad weekend and there's a lot of"}, {"Time_Start": 5185.9400000000005, "Time_End": 5190.88, "Text": " ways to go wrong on it I'll talk about that a little bit yeah if if you're a"}, {"Time_Start": 5190.88, "Time_End": 5195.42, "Text": " company who's already got a few thousand users set up with public IP addresses who"}, {"Time_Start": 5195.42, "Time_End": 5200.1, "Text": " wants the headache of converting them over to to private I completely agree yes"}, {"Time_Start": 5200.1, "Time_End": 5215.400000000001, "Text": " I actually went through that situation in the company and we switched IPs for whatever reason and it took three days to actually do all the IP"}, {"Time_Start": 5215.400000000001, "Time_End": 5229.160000000001, "Text": " machine and then on top of that there is a my area so yeah okay there's so here's a war story up here about here about it about it took three days to change when you changed ISPs"}, {"Time_Start": 5229.16, "Time_End": 5238.98, "Text": " If you were using private IP addresses and you change ISPs, you only have to reconfigure your NAT box because none of your internal addresses change, just your external ones."}, {"Time_Start": 5239.0599999999995, "Time_End": 5241.82, "Text": " You get a new class C from Bob's ISP."}, {"Time_Start": 5242.34, "Time_End": 5243.92, "Text": " You're up and running in 10 minutes, right?"}, {"Time_Start": 5243.98, "Time_End": 5244.84, "Text": " It's not that tough."}, {"Time_Start": 5245.28, "Time_End": 5248.22, "Text": " Another real benefit of going with with NAT."}, {"Time_Start": 5248.44, "Time_End": 5248.7, "Text": " Yes."}, {"Time_Start": 5248.7, "Time_End": 5249.96, "Text": " This leads to my question."}, {"Time_Start": 5249.96, "Time_End": 5259.139999999999, "Text": " If you have a home network and you have a dynamically assigned public number from a dialogue connection, but a small home."}, {"Time_Start": 5259.16, "Time_End": 5263.16, "Text": " How much trouble is that to maintain that side?"}, {"Time_Start": 5263.16, "Time_End": 5271.16, "Text": " Okay, the question is, what if you have a NAT box and on the outside, the public IP address side of it,"}, {"Time_Start": 5271.16, "Time_End": 5277.16, "Text": " you're using a DHCP address, an address that's dynamically given to you by your internet service provider."}, {"Time_Start": 5277.16, "Time_End": 5283.16, "Text": " Traditionally, typically, from what I've seen in that box, is you have to hard code in the external IP address."}, {"Time_Start": 5283.16, "Time_End": 5286.16, "Text": " But this is trouble if you've got, if you're getting it dynamically."}, {"Time_Start": 5286.16, "Time_End": 5288.16, "Text": " The new boxes now allow for that."}, {"Time_Start": 5288.16, "Time_End": 5289.139999999999, "Text": " I think my..."}, {"Time_Start": 5289.16, "Time_End": 5297.2, "Text": " My D-link Wi-Fi hub, but it's a combination of a switch, a firewall, a gnat box, and a coffee maker, I think."}, {"Time_Start": 5297.599999999999, "Time_End": 5300.42, "Text": " And it's got, I think you can do DHCP on the outside."}, {"Time_Start": 5300.62, "Time_End": 5302.639999999999, "Text": " So new hardware will allow that."}, {"Time_Start": 5303.08, "Time_End": 5305.36, "Text": " Checkpoint firewall, one, I don't think so at this point."}, {"Time_Start": 5305.36, "Time_End": 5311.16, "Text": " So this, you know, there's a need for that, and it's easy to code it, so expect it soon."}, {"Time_Start": 5311.16, "Time_End": 5312.4, "Text": " Question."}, {"Time_Start": 5319.16, "Time_End": 5328.16, "Text": " Now, like you, if you're going to work set up properly, you have Sunnet, and so you can place your NAP box"}, {"Time_Start": 5328.16, "Time_End": 5336.16, "Text": " repeatedly throughout the company and update the Sunnet at the time, if you look at any kind of."}, {"Time_Start": 5336.16, "Time_End": 5344.16, "Text": " The suggestion is a way that you can incrementally walk your company through a major IP address change."}, {"Time_Start": 5344.16, "Time_End": 5349.139999999999, "Text": " And that is, if you've broken your network up into subnets, you can do them one at a time and use Natbox."}, {"Time_Start": 5349.16, "Time_End": 5355.16, "Text": " and have the outside of the nat box still be in the old regime while the inside or the downside,"}, {"Time_Start": 5355.16, "Time_End": 5358.16, "Text": " or the inside of the nat box with the land that they're all going to be on the new addresses."}, {"Time_Start": 5358.16, "Time_End": 5362.16, "Text": " So if you're thinking cleverly through it and are willing to go through some of that, yeah,"}, {"Time_Start": 5362.16, "Time_End": 5365.16, "Text": " you can sort of walk your way through one land at a time,"}, {"Time_Start": 5365.16, "Time_End": 5370.16, "Text": " and then maybe at the end there's a, there's a bad weekend where you have to sort of yank all those out or do something else."}, {"Time_Start": 5370.16, "Time_End": 5373.16, "Text": " but yeah, you can incrementally work your way through."}, {"Time_Start": 5373.16, "Time_End": 5375.16, "Text": " It's still a headache, there's still going to be problems,"}, {"Time_Start": 5375.16, "Time_End": 5378.16, "Text": " and Monday morning people are still going to be calling you and they're going to be mad."}, {"Time_Start": 5378.16, "Time_End": 5379.16, "Text": " Yes."}, {"Time_Start": 5379.16, "Time_End": 5380.16, "Text": " In the back."}, {"Time_Start": 5396.16, "Time_End": 5400.16, "Text": " Okay, another tip here, another tip here, DHCP is particularly helpful."}, {"Time_Start": 5400.16, "Time_End": 5408.16, "Text": " Those of you who haven't discovered it yet, dynamic host configuration protocol, it's a great way to propagate network changes through your network and your users don't even know."}, {"Time_Start": 5408.16, "Time_End": 5415.16, "Text": " I don't even know. I need to move on. We're only got about seven or eight minutes left, so I'm going to try to try to make some more tracks here."}, {"Time_Start": 5415.16, "Time_End": 5424.16, "Text": " Windows 98 seems to be I spoke too soon."}, {"Time_Start": 5429.16, "Time_End": 5432.16, "Text": " There we go."}, {"Time_Start": 5438.16, "Time_End": 5446.26, "Text": " plan back to address resolution protocol if you're going to be using on the"}, {"Time_Start": 5446.26, "Time_End": 5452.2, "Text": " outside of your nat box faco IP addresses you know these are virtual public"}, {"Time_Start": 5452.2, "Time_End": 5456.46, "Text": " IP addresses but for example this is really an issue say on a checkpoint firewall"}, {"Time_Start": 5456.46, "Time_End": 5461.139999999999, "Text": " when you on Solaris or on Windows NT if you're going to be using external public"}, {"Time_Start": 5461.139999999999, "Time_End": 5466.0, "Text": " IP addresses that aren't native to that box you have to make sure that that box will"}, {"Time_Start": 5466.0, "Time_End": 5468.139999999999, "Text": " respond properly to our broadcasts"}, {"Time_Start": 5468.16, "Time_End": 5472.96, "Text": " from your router. If you have a gateway router who's trying to find this virtual IP address,"}, {"Time_Start": 5472.96, "Time_End": 5477.88, "Text": " you have to ensure that the outside of your NAT box is going to respond to the ARP broadcasts"}, {"Time_Start": 5477.88, "Time_End": 5482.84, "Text": " and announce itself properly as being the Ethernet host for that IP address."}, {"Time_Start": 5482.84, "Time_End": 5487.34, "Text": " A lot more complicated details. In Firewall 1, you handle it in two different ways, depending"}, {"Time_Start": 5487.34, "Time_End": 5492.92, "Text": " if you're on Solaris or if you're on Windows NT. Just keep in mind, you have to get that straight."}, {"Time_Start": 5492.92, "Time_End": 5498.139999999999, "Text": " On routing, as I mentioned, the firewall is a router first."}, {"Time_Start": 5498.16, "Time_End": 5500.16, "Text": " And it's a firewall second."}, {"Time_Start": 5500.16, "Time_End": 5505.16, "Text": " Important question, how do you route a packet whose IP destination is changing?"}, {"Time_Start": 5505.16, "Time_End": 5509.16, "Text": " Since routing is based upon, what is your IP destination?"}, {"Time_Start": 5509.16, "Time_End": 5515.16, "Text": " So the question sort of falls down to this. Which comes first, the routing or the natting?"}, {"Time_Start": 5515.16, "Time_End": 5517.16, "Text": " And it depends on your firewall. You have to figure this out."}, {"Time_Start": 5517.16, "Time_End": 5520.16, "Text": " With checkpoint, the routing comes first."}, {"Time_Start": 5520.16, "Time_End": 5524.16, "Text": " And the natting is the very last thing that happens as the packet flies out the door."}, {"Time_Start": 5524.16, "Time_End": 5528.16, "Text": " So you have to route to the correct nick first, whether it's the land or the land."}, {"Time_Start": 5528.16, "Time_End": 5534.16, "Text": " the DMZ and then just as it's leaving the very last step is the destination address gets changed."}, {"Time_Start": 5534.16, "Time_End": 5537.16, "Text": " So it can go either way. You can route first or you can nat first."}, {"Time_Start": 5537.16, "Time_End": 5540.16, "Text": " You just have to find out what it is in your firewall and make sure you understand that."}, {"Time_Start": 5540.16, "Time_End": 5545.16, "Text": " But keep in mind, you're trying to route a packet that has a dynamically changing destination address."}, {"Time_Start": 5545.16, "Time_End": 5548.16, "Text": " And as you can imagine, that can get tricky if you get it wrong."}, {"Time_Start": 5548.16, "Time_End": 5551.16, "Text": " DNS issues."}, {"Time_Start": 5551.16, "Time_End": 5553.16, "Text": " Here's the problem."}, {"Time_Start": 5553.16, "Time_End": 5557.16, "Text": " If you have two different IP addresses for a given host, one on the inside and one on the outside,"}, {"Time_Start": 5557.16, "Time_End": 5565.16, "Text": " on the outside, which IP address should be returned with the DNS query?"}, {"Time_Start": 5565.16, "Time_End": 5570.16, "Text": " Users on the inside, they need to get DNS resolved to the inside address."}, {"Time_Start": 5570.16, "Time_End": 5574.16, "Text": " Users on the outside need to get DNS resolved to the outside address."}, {"Time_Start": 5574.16, "Time_End": 5577.16, "Text": " So the question is, which answer should DNS resolve?"}, {"Time_Start": 5577.16, "Time_End": 5581.16, "Text": " If you've got a, in your DMZ, you have www.com,"}, {"Time_Start": 5581.16, "Time_End": 5587.16, "Text": " and you're inside on the land, and you go to, you know, you say, you set your browse"}, {"Time_Start": 5587.16, "Time_End": 5590.16, "Text": " at www.com, you resolve DNS."}, {"Time_Start": 5590.16, "Time_End": 5593.16, "Text": " Well, which address do you want to resolve to?"}, {"Time_Start": 5593.16, "Time_End": 5595.16, "Text": " The outside one or the inside one?"}, {"Time_Start": 5595.16, "Time_End": 5597.16, "Text": " Here's the answer."}, {"Time_Start": 5597.16, "Time_End": 5599.16, "Text": " You have to have something called split DNS."}, {"Time_Start": 5599.16, "Time_End": 5603.16, "Text": " You need to maintain both an inside and an outside DNS server."}, {"Time_Start": 5603.16, "Time_End": 5606.16, "Text": " Insiders resolve to the inside,"}, {"Time_Start": 5606.16, "Time_End": 5608.16, "Text": " outsiders resolve to the outside,"}, {"Time_Start": 5608.16, "Time_End": 5611.16, "Text": " and you limit the number of entries in the outside DNS server"}, {"Time_Start": 5611.16, "Time_End": 5613.16, "Text": " to just the minimum required."}, {"Time_Start": 5613.16, "Time_End": 5615.16, "Text": " So this is an additional enhanced security."}, {"Time_Start": 5615.16, "Time_End": 5617.16, "Text": " You don't want people on the outside to use an outside"}, {"Time_Start": 5617.16, "Time_End": 5620.16, "Text": " look up and just run through all the tables on your DNS server"}, {"Time_Start": 5620.16, "Time_End": 5622.16, "Text": " and figure out all your internal machines, right?"}, {"Time_Start": 5622.16, "Time_End": 5623.16, "Text": " That wouldn't be good."}, {"Time_Start": 5623.16, "Time_End": 5626.16, "Text": " So you list the five boxes that are in your DMZ."}, {"Time_Start": 5626.16, "Time_End": 5629.16, "Text": " You list their public IP addresses, and outsiders can see that."}, {"Time_Start": 5629.16, "Time_End": 5632.16, "Text": " But in terms of all the inside machines, you use inside DNS,"}, {"Time_Start": 5632.16, "Time_End": 5635.16, "Text": " and so that enhances your security by keeping the,"}, {"Time_Start": 5635.16, "Time_End": 5639.16, "Text": " again, you're hiding the internal structure of your network from outsiders."}, {"Time_Start": 5639.16, "Time_End": 5642.16, "Text": " Okay."}, {"Time_Start": 5642.16, "Time_End": 5644.16, "Text": " A summary here."}, {"Time_Start": 5644.16, "Time_End": 5647.16, "Text": " Nat provides security at the network architecture"}, {"Time_Start": 5647.16, "Time_End": 5653.16, "Text": " level. That's one of the reasons I think it's so good. It's below and before"}, {"Time_Start": 5653.16, "Time_End": 5656.16, "Text": " you get issues like access control lists."}, {"Time_Start": 5656.16, "Time_End": 5659.16, "Text": " How many people here have screwed up an ACL and accidentally let something"}, {"Time_Start": 5659.16, "Time_End": 5662.16, "Text": " through they shouldn't or accidentally block something they shouldn't have?"}, {"Time_Start": 5662.16, "Time_End": 5665.16, "Text": " I better see every hand go up if you've ever touched a router."}, {"Time_Start": 5665.16, "Time_End": 5668.16, "Text": " People do it all the time. It's much harder to screw up Nat."}, {"Time_Start": 5668.16, "Time_End": 5673.16, "Text": " Well, once you get that working the first time, then it's harder to get it wrong later."}, {"Time_Start": 5673.16, "Time_End": 5676.16, "Text": " It provides security at a structural level."}, {"Time_Start": 5676.16, "Time_End": 5677.139999999999, "Text": " The nice thing"}, {"Time_Start": 5677.16, "Time_End": 5683.16, "Text": " is all the machines in your hide mode, all the machines on your land, they don't even have public IP addresses."}, {"Time_Start": 5683.16, "Time_End": 5688.16, "Text": " So the question of whether somebody from the outside can connect to it is sort of moot."}, {"Time_Start": 5688.16, "Time_End": 5691.16, "Text": " I've talked here about the many benefits of Nat."}, {"Time_Start": 5691.16, "Time_End": 5694.16, "Text": " Sort of a warning, a caveat."}, {"Time_Start": 5694.16, "Time_End": 5698.16, "Text": " It may require some significant restructuring of your network."}, {"Time_Start": 5698.16, "Time_End": 5701.16, "Text": " It's some real work to do IP address changes in your company,"}, {"Time_Start": 5701.16, "Time_End": 5706.16, "Text": " but I believe the benefits are pretty darn nice if you can get a chance to pull it off."}, {"Time_Start": 5706.16, "Time_End": 5707.16, "Text": " Where to get in information?"}, {"Time_Start": 5707.16, "Time_End": 5711.66, "Text": " more information. There's the Internet Engineering Task Force. This is my company,"}, {"Time_Start": 5711.66, "Time_End": 5716.76, "Text": " Information Engine. This presentation is already posted on the site. If you go to"}, {"Time_Start": 5716.76, "Time_End": 5720.98, "Text": " InformationEngine.com, you see a section called DefCon9, and you can find my PowerPoint"}, {"Time_Start": 5720.98, "Time_End": 5729.16, "Text": " presentation here. I want to do some more Q&A, and this is about us. It's sort of a one-man"}, {"Time_Start": 5729.16, "Time_End": 5733.16, "Text": " corporation. I'm definitely looking for more interesting opportunities. I have resumes"}, {"Time_Start": 5733.16, "Time_End": 5737.139999999999, "Text": " up here. You know how to get to my website. Talk to me if you wish. And in the few"}, {"Time_Start": 5737.16, "Time_End": 5740.84, "Text": " minutes we have left actually about two minutes more questions and I'll handle more"}, {"Time_Start": 5740.84, "Time_End": 5743.639999999999, "Text": " questions when we're done here until we lose the room thank you"}]}