{"segments": [{"Time_Start": 0.0, "Time_End": 17.44, "Text": " This is not going to be enough to teach you anything."}, {"Time_Start": 18.56, "Time_End": 25.080000000000002, "Text": " So when I was reviewing the materials coming in today, I saw some of the speakers and lectures and lectures and some of the topics."}, {"Time_Start": 25.72, "Time_End": 29.98, "Text": " Man, some of the names were, you know, the Crimson Fugue was speaking on something, and the digital."}, {"Time_Start": 30.0, "Time_End": 36.1, "Text": " Rubicon and all these great names, and I see my name and it's Dario Diaz, you know, speaking on the DMCA, very exciting."}, {"Time_Start": 36.88, "Time_End": 46.14, "Text": " So I made a decision that I changed the name of my lecture, and, uh, my lecture is now going to be,"}, {"Time_Start": 46.14, "Time_End": 51.400000000000006, "Text": " so you got your lame ass indicted by a federal grand jury, and now the feds have a bunch of guys in riot gear,"}, {"Time_Start": 52.28, "Time_End": 57.5, "Text": " storming your house to forfeit all your stuff and put you in a federal penitentiary with a cellmate named Bamba,"}, {"Time_Start": 57.5, "Time_End": 58.68, "Text": " who wants to make you as bitch."}, {"Time_Start": 60.0, "Time_End": 68.96000000000001, "Text": " And from this point on, I want to be known as the law slut, okay?"}, {"Time_Start": 69.52, "Time_End": 72.32, "Text": " It makes me feel much better if I have a title to be called by."}, {"Time_Start": 80.56, "Time_End": 87.22, "Text": " The Digital Millennium Copyright Act was enacted by Congress in, well, over a long period of time, but actually signed in law in 1998."}, {"Time_Start": 87.96000000000001, "Time_End": 89.98, "Text": " It's comprised of five separate titles."}, {"Time_Start": 90.0, "Time_End": 97.12, "Text": " The general idea is to implement some world intellectual property organization treaties,"}, {"Time_Start": 98.06, "Time_End": 101.4, "Text": " and those are the two treaties, the copyright treaty, and the performances of phonograms treaty."}, {"Time_Start": 101.88, "Time_End": 108.76, "Text": " It's codified at 17 United States Code Section 1201, A1, 1202,03."}, {"Time_Start": 108.94, "Time_End": 110.18, "Text": " You know, look it up, you'll see what it is."}, {"Time_Start": 110.18, "Time_End": 112.9, "Text": " It was signing the law in 1998 by President Clinton."}, {"Time_Start": 120.0, "Time_End": 124.9, "Text": " A technical failure here."}, {"Time_Start": 124.9, "Time_End": 128.98, "Text": " The Digital Millennium Copyright Act is spread into five titles."}, {"Time_Start": 128.98, "Time_End": 136.14, "Text": " The first title implements those treaties that we talked about just now, the World Intellectual Treaties."}, {"Time_Start": 136.14, "Time_End": 141.28, "Text": " The second title is an online copyright limitation liability act."}, {"Time_Start": 141.28, "Time_End": 148.72, "Text": " What that does is it lets online service providers have certain content on their website and not be liable for it."}, {"Time_Start": 148.72, "Time_End": 152.06, "Text": " The third title is the Computer Maintenance Act."}, {"Time_Start": 152.06, "Time_End": 158.5, "Text": " What that allows certain companies or corporations to do is start a computer and if it's password"}, {"Time_Start": 158.5, "Time_End": 162.22, "Text": " protected with software or some type of operating system or somehow it doesn't allow you to"}, {"Time_Start": 162.22, "Time_End": 166.8, "Text": " get into it to fix it, it allows you to bypass that protection to fix it."}, {"Time_Start": 166.8, "Time_End": 170.4, "Text": " The fourth title just involves miscellaneous provisions."}, {"Time_Start": 170.4, "Time_End": 177.84, "Text": " And the fifth title is a standard United States Congress log rolling adding its vessel"}, {"Time_Start": 177.84, "Time_End": 189.72, "Text": " Hall Design Protection Act. You can see the serious thought that went into this Copyright Act that they have to protect boat hulls as a result of passing, you know, protecting DVDs and CD-ROMs and so forth."}, {"Time_Start": 193.16, "Time_End": 207.82, "Text": " The first section on the cover is 17 United States Code 1201A1. And it reads, no person, no persons shall circumvent a technological measure that effectively controls access to a work protected,"}, {"Time_Start": 207.84, "Time_End": 211.8, "Text": " and I put by copyright law because there's a whole bunch of stuff after that that I really don't want to get into."}, {"Time_Start": 212.94, "Time_End": 222.26, "Text": " The first thing I want to tell you about this general little rule up there is that it seems to require that in order to receive protection of the Digital Millennium Copyright Act,"}, {"Time_Start": 223.08, "Time_End": 228.6, "Text": " you must implement some type of effective control to keep people from circumventing it or copying it."}, {"Time_Start": 228.84, "Time_End": 229.62, "Text": " What does that mean?"}, {"Time_Start": 230.12, "Time_End": 237.76, "Text": " Well, I got some case law and we'll talk about it later on, but something you're going to hear from me today if you ask questions at the end of the conference is, I don't know."}, {"Time_Start": 237.84, "Time_End": 243.06, "Text": " And with somebody with an ego like mind, to say, I don't know, it's really hard and hurts, but I don't know."}, {"Time_Start": 243.26, "Time_End": 244.70000000000002, "Text": " There's not much law on it right now."}, {"Time_Start": 245.04, "Time_End": 247.06, "Text": " So the first thing is you have to have effective control."}, {"Time_Start": 248.22, "Time_End": 252.42000000000002, "Text": " The second thing is, it divides technological measures into two parts."}, {"Time_Start": 253.72, "Time_End": 262.86, "Text": " It prevents unauthorized access to the work, which means, you know, bypassing some type of encryption or key up front or some type of lock to get into the work."}, {"Time_Start": 262.86, "Time_End": 267.02, "Text": " And the second thing it prevents is copying the work once you get to it."}, {"Time_Start": 267.02, "Time_End": 270.96, "Text": " So it sounds like, in essence, you have two separate things."}, {"Time_Start": 271.29999999999995, "Time_End": 276.59999999999997, "Text": " You have works that have some type of system to bypass to get to and works that don't."}, {"Time_Start": 276.82, "Time_End": 279.74, "Text": " Well, you know you can't copy the ones that don't because copyright law protects it."}, {"Time_Start": 280.38, "Time_End": 287.44, "Text": " In this statute, Congress did not anticipate something like the DVD that has access and copyright protection."}, {"Time_Start": 288.65999999999997, "Time_End": 296.46, "Text": " And if you read on your own, and you'll get an idea for the difficulty everyone's going to have interpreting this law."}, {"Time_Start": 297.02, "Time_End": 300.02, "Text": " That's the Copyright Office summary of this law."}, {"Time_Start": 300.02, "Time_End": 306.52, "Text": " As to the act of circumvention itself, the provision prohibits circumventing unauthorized access, but not unauthorized copying."}, {"Time_Start": 306.52, "Time_End": 308.52, "Text": " Since copying of work may be fair use."}, {"Time_Start": 308.52, "Time_End": 313.52, "Text": " Section 1201 does not prohibit the act of circumventing a technological measure that prevents copying."}, {"Time_Start": 313.52, "Time_End": 318.52, "Text": " By contrast, since the fair use doctrine is not a defense to the act gaining authorized access to a work,"}, {"Time_Start": 318.52, "Time_End": 323.02, "Text": " the act of circumventing a technological measure in order to gain access is prohibited."}, {"Time_Start": 323.02, "Time_End": 327.0, "Text": " Now, I put together a large binder"}, {"Time_Start": 327.02, "Time_End": 330.71999999999997, "Text": " presenting this presentation at DefCon."}, {"Time_Start": 330.71999999999997, "Time_End": 335.88, "Text": " I've read that statement no less than 80 times."}, {"Time_Start": 335.88, "Time_End": 338.97999999999996, "Text": " My field is trial work and I practice law."}, {"Time_Start": 338.97999999999996, "Time_End": 341.91999999999996, "Text": " I cannot make sense of that."}, {"Time_Start": 341.91999999999996, "Time_End": 346.15999999999997, "Text": " If you can make sense of it, please come up to me after the lecture and let me know that"}, {"Time_Start": 346.15999999999997, "Time_End": 349.26, "Text": " would look like an idiot the next time I talk about this."}, {"Time_Start": 349.26, "Time_End": 355.03999999999996, "Text": " It absolutely flies right in the face of what every software manufacturer is going to do in"}, {"Time_Start": 355.03999999999996, "Time_End": 356.84, "Text": " in this world and that's put a"}, {"Time_Start": 357.02, "Time_End": 361.09999999999997, "Text": " simple access code in front of their copyrighted work and prevent everyone from"}, {"Time_Start": 361.09999999999997, "Time_End": 364.24, "Text": " circumventing it so they can get access to the copyright work regardless of what your"}, {"Time_Start": 364.24, "Time_End": 365.65999999999997, "Text": " intention is to do with the copyrighted work."}, {"Time_Start": 371.65999999999997, "Time_End": 375.32, "Text": " The next section I'm going to talk about, and these are the only two I'm really going to deal"}, {"Time_Start": 375.32, "Time_End": 381.41999999999996, "Text": " with today, is 1201A2. No person shall manufacture, import, offer to the public, provide, or"}, {"Time_Start": 381.41999999999996, "Time_End": 385.4, "Text": " otherwise traffic in any technology, product, service, device, component, or part thereof"}, {"Time_Start": 385.4, "Time_End": 385.9, "Text": " that."}, {"Time_Start": 385.90000000000003, "Time_End": 388.86, "Text": " and then it gives you a list of items, sort of like a checklist."}, {"Time_Start": 389.48, "Time_End": 397.54, "Text": " It's primarily designed to circumvent a technological measure, has only limited commercially significant purpose other than to circumvent a technological measure, or."}, {"Time_Start": 397.74, "Time_End": 402.46000000000004, "Text": " And I put or read and underlined it because or and and end in the law have special meanings."}, {"Time_Start": 402.98, "Time_End": 412.08000000000004, "Text": " It's inclusive or exclusive or what you'll see as or means any one of these things, any one of these three things violates the DMCA."}, {"Time_Start": 412.78000000000003, "Time_End": 414.92, "Text": " So you don't need all three, you need only one of these three things."}, {"Time_Start": 415.14000000000004, "Time_End": 415.88000000000005, "Text": " And the third thing is,"}, {"Time_Start": 415.90000000000003, "Time_End": 418.52000000000004, "Text": " is marketed for use in circumventing a technological measure."}, {"Time_Start": 419.28000000000003, "Time_End": 425.18, "Text": " And at the bottom there, I've got the definition of what they mean to circumvent a technological measure."}, {"Time_Start": 426.08000000000004, "Time_End": 433.70000000000005, "Text": " Descrambling, decrypting, avoiding bypassing, almost anything, impair any technological measure without the authority of the copyright owner."}, {"Time_Start": 436.20000000000005, "Time_End": 445.74, "Text": " So basically, any one of those three things, bypassing, only limited commercial significance, any one of the three is the violation of the DMC,"}, {"Time_Start": 445.90000000000003, "Time_End": 448.06000000000006, "Text": " see later on in some case law what happens."}, {"Time_Start": 449.84000000000003, "Time_End": 455.1, "Text": " Throughout the lecture, I'd like to have a few questions I'm going to pose to you, and I definitely want to have some discussions back and forth."}, {"Time_Start": 455.48, "Time_End": 457.56000000000006, "Text": " If you can hold that to the end, man, I really appreciate it."}, {"Time_Start": 458.90000000000003, "Time_End": 466.32000000000005, "Text": " First question is, does the statutes that we just saw prevent providing any information instructions on how to circumvent a technological measure?"}, {"Time_Start": 467.14000000000004, "Time_End": 473.68000000000006, "Text": " Yesterday I was sitting in a lecture, and I saw in front of me a guy wearing a shirt, and it had the code to CSSdscramble.c."}, {"Time_Start": 474.72, "Time_End": 475.88000000000005, "Text": " He's wearing that on the back of it."}, {"Time_Start": 475.90000000000003, "Time_End": 479.38000000000005, "Text": " of his shirt. It's C code. You know, somebody probably has it in here right now."}, {"Time_Start": 480.58000000000004, "Time_End": 486.44000000000005, "Text": " Does that violate the DMCA? There was a, there's a First Amendment case that we read about"}, {"Time_Start": 486.44000000000005, "Time_End": 491.28000000000003, "Text": " in constitutional law law school where a guy wore a shirt to the draft board and the back of his"}, {"Time_Start": 491.28000000000003, "Time_End": 496.42, "Text": " shirt, he didn't say a word, but the back of his shirt said, you know, and trying to have a modicum"}, {"Time_Start": 496.42, "Time_End": 501.68000000000006, "Text": " of dignity in here, his shirt said, fuck the draft. Well, he got a lot of trouble for that,"}, {"Time_Start": 501.68000000000006, "Time_End": 505.88000000000005, "Text": " and it started a whole area of law about expressive conduct."}, {"Time_Start": 505.90000000000003, "Time_End": 513.26, "Text": " versus not expressive. In other words, is what that guy yesterday with a CSSdscrangle.c shirt on,"}, {"Time_Start": 513.8000000000001, "Time_End": 519.82, "Text": " is he a violation of the statute? Is providing instruction violation? Is that a technological measure?"}, {"Time_Start": 519.88, "Time_End": 524.98, "Text": " Are you circumventing something merely by giving somebody a set of instructions or printing it on the back of your shirt or sending him an email?"}, {"Time_Start": 525.36, "Time_End": 530.2, "Text": " And there's the example I'm using. Harry Hack writes a program and he just publishes a code."}, {"Time_Start": 530.62, "Time_End": 535.84, "Text": " He writes it in a C. He doesn't give anybody the compiler, doesn't give the executable, publishes that code on his website."}, {"Time_Start": 535.9, "Time_End": 539.02, "Text": " somebody copies it, compiles it, and uses it."}, {"Time_Start": 539.22, "Time_End": 540.1, "Text": " Is Harry Hack in trouble?"}, {"Time_Start": 541.34, "Time_End": 547.6999999999999, "Text": " Well, we'll see later on. He may not be because of some corrections that were made in the law over a period of time,"}, {"Time_Start": 548.12, "Time_End": 555.84, "Text": " but you begin to see the problem with infringement of First Amendment in certain areas of the law when the DMCA comes into effect."}, {"Time_Start": 556.14, "Time_End": 560.74, "Text": " I don't know the answer to this question. I really don't know. Is that against the rules?"}, {"Time_Start": 560.8199999999999, "Time_End": 565.22, "Text": " Is instruction enough? Over time, I guess we'll find out. This law is only three years old."}, {"Time_Start": 565.9, "Time_End": 576.06, "Text": " The DMCA also sets out various exemptions, things you can do that will not get you in trouble and will not run afoul of the DMCA."}, {"Time_Start": 576.86, "Time_End": 578.8199999999999, "Text": " The first thing is the law enforcement exemption."}, {"Time_Start": 579.54, "Time_End": 586.24, "Text": " What that does is any lawfully authorized investigative protective information security intelligence activity is exempt from the entire DMCA."}, {"Time_Start": 586.9399999999999, "Time_End": 595.24, "Text": " Does that mean that a county sheriff investigating something, whatever that may be, is he,"}, {"Time_Start": 595.24, "Time_End": 599.38, "Text": " an investigative authority? It doesn't really say it's a federal law. Does it apply to county"}, {"Time_Start": 599.38, "Time_End": 603.94, "Text": " sheriffs or a Tampa Police Department or from Tampa. So who does that really apply to?"}, {"Time_Start": 604.82, "Time_End": 610.0600000000001, "Text": " The second thing is a nonprofit library. It's a very narrow exception. What allows the"}, {"Time_Start": 610.0600000000001, "Time_End": 615.72, "Text": " nonprofit library to do is make copies of circumvent technology for fair use to provide little clips of"}, {"Time_Start": 615.72, "Time_End": 622.62, "Text": " access to various other people. And I talk about does not, does not exclude you from A2 or B1. B1 is"}, {"Time_Start": 622.62, "Time_End": 625.22, "Text": " very similar to A2. Get the statute, look at it."}, {"Time_Start": 625.24, "Time_End": 633.52, "Text": " I don't have the time to go into all of them here, but it doesn't give an exemption to the library for circumventing the technological measure under the provisions of A2, which I showed a little bit earlier."}, {"Time_Start": 634.7, "Time_End": 636.28, "Text": " The third thing is reverse engineering."}, {"Time_Start": 636.62, "Time_End": 640.54, "Text": " This is where everybody in this room would think they would fall under."}, {"Time_Start": 641.1, "Time_End": 643.22, "Text": " Everybody was very happy that they added the reverse engineering."}, {"Time_Start": 643.78, "Time_End": 651.28, "Text": " We're going to make it okay to circumvent technology or make copies for you to make your program interoperable with other programs."}, {"Time_Start": 651.88, "Time_End": 654.8, "Text": " In other words, we want to be able to make a DVD disk for Linux."}, {"Time_Start": 654.8000000000001, "Time_End": 657.5000000000001, "Text": " We'll see later on, it played an important role."}, {"Time_Start": 657.9200000000001, "Time_End": 661.44, "Text": " So let's circumvent the technology to make it interoperable with other technologies."}, {"Time_Start": 661.9200000000001, "Time_End": 665.1800000000001, "Text": " So we thought that that was a good thing, you know, the reverse engineering."}, {"Time_Start": 666.1600000000001, "Time_End": 668.4000000000001, "Text": " The next exemption is encryption research."}, {"Time_Start": 669.08, "Time_End": 672.8000000000001, "Text": " It's not a violation to circumvent a technological measure for good faith."}, {"Time_Start": 673.6200000000001, "Time_End": 679.94, "Text": " In good faith, I got to read and underline again, because that's an interesting concept because what's good faith to me may not be good faith to you."}, {"Time_Start": 680.2600000000001, "Time_End": 681.3800000000001, "Text": " It may not be good faith to you."}, {"Time_Start": 681.72, "Time_End": 684.48, "Text": " So they try the best they can to codify what that means."}, {"Time_Start": 684.8000000000001, "Time_End": 691.8000000000001, "Text": " The encryption researcher has to lawfully obtain a copy of the copyrighted work."}, {"Time_Start": 691.8000000000001, "Time_End": 699.8000000000001, "Text": " He's got to act, the act has to be necessary to conduct the research that he's trying to do."}, {"Time_Start": 699.8000000000001, "Time_End": 701.8000000000001, "Text": " This is the killer."}, {"Time_Start": 701.8000000000001, "Time_End": 710.8000000000001, "Text": " The guy performing the encryption research has to make a good faith effort to obtain permission from the copyright owner to do this work."}, {"Time_Start": 710.8000000000001, "Time_End": 714.7800000000001, "Text": " There's something happening very recently I'll talk about at the end where"}, {"Time_Start": 714.8000000000001, "Time_End": 716.1200000000001, "Text": " you'll see that that's a real problem."}, {"Time_Start": 716.1800000000001, "Time_End": 721.0200000000001, "Text": " So keep that in the back of your mind, making a good faith effort to obtain permission to circumvent the encryption."}, {"Time_Start": 722.36, "Time_End": 725.1200000000001, "Text": " And this is something neat that I don't understand as well."}, {"Time_Start": 725.2400000000001, "Time_End": 730.6600000000001, "Text": " Item number four, such act of the encryption researcher does not constitute infringement."}, {"Time_Start": 732.7800000000001, "Time_End": 734.2800000000001, "Text": " I have no idea what that means."}, {"Time_Start": 734.2800000000001, "Time_End": 741.4000000000001, "Text": " How can you be circumventing technological measures and technological access without infringing on the copyright owner's copyright?"}, {"Time_Start": 741.8000000000001, "Time_End": 744.7800000000001, "Text": " It doesn't, they give you the exemption, and then they just take it."}, {"Time_Start": 744.8000000000001, "Time_End": 747.8000000000001, "Text": " away from you at the very end by saying you can't infringe on this though."}, {"Time_Start": 747.8000000000001, "Time_End": 748.8000000000001, "Text": " Don't do that."}, {"Time_Start": 748.8000000000001, "Time_End": 750.8000000000001, "Text": " Here are the good faith factors."}, {"Time_Start": 750.8000000000001, "Time_End": 752.8000000000001, "Text": " Was the information disseminated?"}, {"Time_Start": 752.8000000000001, "Time_End": 754.8000000000001, "Text": " In other words, did I give it to a whole bunch of people on the website?"}, {"Time_Start": 754.8000000000001, "Time_End": 757.8000000000001, "Text": " Just publish it for the world to see."}, {"Time_Start": 757.8000000000001, "Time_End": 762.8000000000001, "Text": " Was the person in a legitimate course, I put court, bad habit,"}, {"Time_Start": 762.8000000000001, "Time_End": 766.8000000000001, "Text": " course of study, trained, experienced in encryption research."}, {"Time_Start": 766.8000000000001, "Time_End": 771.8000000000001, "Text": " Think about a court making the decision for anybody in this room"}, {"Time_Start": 771.8000000000001, "Time_End": 774.8000000000001, "Text": " as to whether it's good faith, as to"}, {"Time_Start": 774.8000000000001, "Time_End": 780.8000000000001, "Text": " what you've done or not. There are people in this room that know more about what this is trying to protect"}, {"Time_Start": 780.8000000000001, "Time_End": 788.8000000000001, "Text": " than any college professor. So how can the court make a decision that this gentleman, for example,"}, {"Time_Start": 788.8000000000001, "Time_End": 792.8000000000001, "Text": " is not a legitimate course of study when he's trying to learn something, or he's not experienced"}, {"Time_Start": 792.8000000000001, "Time_End": 798.8000000000001, "Text": " in encryption research when he may know more about it than, you know, a college professor."}, {"Time_Start": 798.8000000000001, "Time_End": 804.7800000000001, "Text": " The researcher has to provide the findings to the copyright owner as a result of"}, {"Time_Start": 804.8000000000001, "Time_End": 810.34, "Text": " his work and he's not exempt under B1. Again, B1 is very simpler to A2, 1201B1."}, {"Time_Start": 810.34, "Time_End": 816.0400000000001, "Text": " There's no exemption for that. So even though you do all the good faith stuff, all these things that"}, {"Time_Start": 816.0400000000001, "Time_End": 820.1200000000001, "Text": " they want you to do, you contact the guy, you know, you want to get the information, you do all"}, {"Time_Start": 820.1200000000001, "Time_End": 825.2400000000001, "Text": " those things, you're still not exempt in another provision of the DMCA under B1."}, {"Time_Start": 825.2400000000001, "Time_End": 828.7600000000001, "Text": " So it's given and then taken away by another method."}, {"Time_Start": 834.8000000000001, "Time_End": 864.2, "Text": " This exemption is protection of minors. You can circumvent if somehow you're protecting minors, you know, different cookies. Somebody's opened a web browser before and it opens up 40 windows. Some of those windows don't have particularly tasteful things contained in them. You can somehow circumvent a program that may be doing that if you have a minor using the computer. It's a very narrow exception. And once again, it adds at the very end of it, the technology product or service must not violate the provisions of this title."}, {"Time_Start": 864.8000000000001, "Time_End": 865.8000000000001, "Text": " very nice."}, {"Time_Start": 865.8000000000001, "Time_End": 868.8000000000001, "Text": " And then at the very end, they say don't violate the provisions of the title."}, {"Time_Start": 868.8000000000001, "Time_End": 870.8000000000001, "Text": " Personal privacy."}, {"Time_Start": 870.8000000000001, "Time_End": 879.8000000000001, "Text": " If the software is giving out your personal information, for whatever reason it is, the software is sending personal data, whatever record you have,"}, {"Time_Start": 879.8000000000001, "Time_End": 883.8000000000001, "Text": " and you don't know about it and you can't get to it, you can circumvent it to turn off that switch."}, {"Time_Start": 883.8000000000001, "Time_End": 886.8000000000001, "Text": " That'll send your personal information."}, {"Time_Start": 886.8000000000001, "Time_End": 888.8000000000001, "Text": " And the last one is security testing."}, {"Time_Start": 888.8000000000001, "Time_End": 893.8000000000001, "Text": " It permits the circumvention of access control measures for the purpose of testing a security computer network."}, {"Time_Start": 893.8000000000001, "Time_End": 896.5600000000001, "Text": " you need the authorization of the person you're getting into."}, {"Time_Start": 896.8000000000001, "Time_End": 900.8000000000001, "Text": " So in other words, it would be a consultant going into a company website"}, {"Time_Start": 900.8000000000001, "Time_End": 904.8000000000001, "Text": " or a company network and getting together with the owner and saying,"}, {"Time_Start": 904.8000000000001, "Time_End": 906.8000000000001, "Text": " I'm going to prove your security by hacking your network."}, {"Time_Start": 906.8000000000001, "Time_End": 908.8000000000001, "Text": " And that gives you protection."}, {"Time_Start": 908.8000000000001, "Time_End": 911.8000000000001, "Text": " And once again, you have an exemption on that."}, {"Time_Start": 911.8000000000001, "Time_End": 914.8000000000001, "Text": " Was the info used solely to provide security?"}, {"Time_Start": 914.8000000000001, "Time_End": 915.8000000000001, "Text": " Well, what does solely mean?"}, {"Time_Start": 915.8000000000001, "Time_End": 919.8000000000001, "Text": " Does it mean that once I'm done with that, I cannot take what I learned to a similar corporate website"}, {"Time_Start": 919.8000000000001, "Time_End": 922.8000000000001, "Text": " with the exact same information and use that that I got from this guy?"}, {"Time_Start": 922.8000000000001, "Time_End": 924.8000000000001, "Text": " that I got from this guy with this guy?"}, {"Time_Start": 924.8000000000001, "Time_End": 929.8000000000001, "Text": " Does it mean that once I'm done here, I have to wipe my memory solely for that information?"}, {"Time_Start": 929.8000000000001, "Time_End": 934.8000000000001, "Text": " And whether the info derived from the testing was used so as to not facilitate infringement?"}, {"Time_Start": 934.8000000000001, "Time_End": 938.8000000000001, "Text": " Once you learn it, did you give it to somebody else that they could do it to somebody,"}, {"Time_Start": 938.8000000000001, "Time_End": 941.8000000000001, "Text": " or they could do it to a corporate network?"}, {"Time_Start": 941.8000000000001, "Time_End": 947.8000000000001, "Text": " Was it your purpose in doing this work, whatever you're doing with somebody's network,"}, {"Time_Start": 947.8000000000001, "Time_End": 950.8000000000001, "Text": " to not facilitate infringement, to bypass other networks?"}, {"Time_Start": 950.8000000000001, "Time_End": 951.8000000000001, "Text": " And that's the factor."}, {"Time_Start": 951.8000000000001, "Time_End": 957.8000000000001, "Text": " Here are the remedies."}, {"Time_Start": 957.8000000000001, "Time_End": 962.8000000000001, "Text": " Let's say someone in this room violates one of the provisions."}, {"Time_Start": 962.8000000000001, "Time_End": 968.8000000000001, "Text": " What does the other party, the copyright owner, what right does that individual have against you?"}, {"Time_Start": 968.8000000000001, "Time_End": 972.8000000000001, "Text": " I mean, slap on the wrist, you know, poking the eye, whatever he wants to do?"}, {"Time_Start": 972.8000000000001, "Time_End": 973.8000000000001, "Text": " What do they do?"}, {"Time_Start": 973.8000000000001, "Time_End": 976.8000000000001, "Text": " Well, section 1203 sets out the civil remedies."}, {"Time_Start": 976.8000000000001, "Time_End": 980.8000000000001, "Text": " Civil remedies generally involve money, injunctions, things like that, doesn't put you in jail."}, {"Time_Start": 980.8000000000001, "Time_End": 986.8000000000001, "Text": " it allows temporary and permanent injunctions and this next line is very interesting"}, {"Time_Start": 986.8000000000001, "Time_End": 992.8000000000001, "Text": " but in no event imposed a prior restraint on free speech or the press protected by the First Amendment"}, {"Time_Start": 992.8000000000001, "Time_End": 996.8000000000001, "Text": " so you can get an injunction you can get a permanent injunction"}, {"Time_Start": 996.8000000000001, "Time_End": 999.8000000000001, "Text": " but that injunction is not supposed to violate free speech"}, {"Time_Start": 999.8000000000001, "Time_End": 1003.8000000000001, "Text": " think about that when you're posting something or you're publishing a newsletter"}, {"Time_Start": 1003.8000000000001, "Time_End": 1010.7800000000001, "Text": " or the guys on 2600 are posting some code is that free speech is that something that you're conveying a"}, {"Time_Start": 1010.8000000000001, "Time_End": 1012.72, "Text": " message, you're expressing something to somebody else."}, {"Time_Start": 1013.22, "Time_End": 1014.5600000000001, "Text": " It's not supposed to limit that."}, {"Time_Start": 1014.6, "Time_End": 1015.84, "Text": " It's not supposed to fringe on that."}, {"Time_Start": 1015.9200000000001, "Time_End": 1018.5200000000001, "Text": " And as we'll see it, there's a little problem with it later on."}, {"Time_Start": 1020.2, "Time_End": 1024.72, "Text": " The court can order the impounding of any device or product involved in the violation."}, {"Time_Start": 1025.18, "Time_End": 1027.1000000000001, "Text": " So they basically come in and take all your computer stuff."}, {"Time_Start": 1027.2, "Time_End": 1028.98, "Text": " They come in and take all your hardware, all your software."}, {"Time_Start": 1029.0800000000002, "Time_End": 1034.38, "Text": " They can take everything from you that you're using to violate the DMCA."}, {"Time_Start": 1035.28, "Time_End": 1036.78, "Text": " They can award money damages."}, {"Time_Start": 1037.92, "Time_End": 1039.4, "Text": " Actual damages, loss of profits."}, {"Time_Start": 1039.4, "Time_End": 1040.54, "Text": " As the company can prove."}, {"Time_Start": 1040.8, "Time_End": 1044.3999999999999, "Text": " damages that you lost profits or they can actually put a number on it the court"}, {"Time_Start": 1044.3999999999999, "Time_End": 1048.78, "Text": " can give the copyright owner that number you know John Smith prevented me from"}, {"Time_Start": 1048.78, "Time_End": 1053.34, "Text": " selling 4,000 rights of my copyright and I sell them at $10 each so I'm entitled"}, {"Time_Start": 1053.34, "Time_End": 1059.28, "Text": " to $400,000 there are statutory damages you have to make an election during"}, {"Time_Start": 1059.28, "Time_End": 1063.8999999999999, "Text": " the litigation the the the copyright owner has to make an election the damages are"}, {"Time_Start": 1063.8999999999999, "Time_End": 1068.1599999999999, "Text": " not less than 200 or not more than 2,500 the copyright owner can recover the"}, {"Time_Start": 1068.1599999999999, "Time_End": 1070.4199999999998, "Text": " cost of defending the action"}, {"Time_Start": 1070.42, "Time_End": 1072.76, "Text": " The prevailing party gets attorney's fees and costs."}, {"Time_Start": 1074.18, "Time_End": 1077.68, "Text": " The court can order the modification of the equipment or the destruction of the equipment."}, {"Time_Start": 1077.8600000000001, "Time_End": 1084.94, "Text": " If the court is convinced that your computer that you use to violate the DMCA somehow needs to be destroyed,"}, {"Time_Start": 1085.04, "Time_End": 1086.74, "Text": " the court can take your stuff and destroy it."}, {"Time_Start": 1087.8000000000002, "Time_End": 1093.38, "Text": " And finally, if you do it more than one time, the court can award trouble damages, which is three times of damages."}, {"Time_Start": 1093.48, "Time_End": 1097.22, "Text": " So if they approve 2,000, they get 6,000, 200,000, and so on."}, {"Time_Start": 1098.02, "Time_End": 1100.4, "Text": " Here's the interesting part of the DMM."}, {"Time_Start": 1100.42, "Time_End": 1109.26, "Text": " Let me go over. This screen doesn't fit. These are criminal penalties of the DMCA, which,"}, {"Time_Start": 1110.2, "Time_End": 1113.18, "Text": " I mean, you can imagine where the problems are already in construing the statute if you weren't"}, {"Time_Start": 1113.18, "Time_End": 1120.22, "Text": " to follow these. You have to violate the provisions of the DMCA willfully and, once again,"}, {"Time_Start": 1120.26, "Time_End": 1125.22, "Text": " I put it in red, for purposes of commercial advantage or private financial gain. So if you"}, {"Time_Start": 1125.22, "Time_End": 1130.4, "Text": " violate it willfully, which I think everybody has to be conscious when they're sitting"}, {"Time_Start": 1130.42, "Time_End": 1134.72, "Text": " at a computer keyboard and tapping out code. So every act that does it is willful."}, {"Time_Start": 1134.8400000000001, "Time_End": 1139.88, "Text": " So I think everyone's going to fall into the first one. And for purposes of commercial financial"}, {"Time_Start": 1139.88, "Time_End": 1144.72, "Text": " advantage or private financial gain. Does that mean you're helping a friend? Does it mean that"}, {"Time_Start": 1144.72, "Time_End": 1148.44, "Text": " you're helping another company and they gain from your act, even though you didn't know about it?"}, {"Time_Start": 1148.92, "Time_End": 1155.44, "Text": " I don't know. The first offense, once you get caught in the Fed stormier room and want to put you"}, {"Time_Start": 1155.44, "Time_End": 1160.16, "Text": " a bubba, the first offense is up to $500,000 fine and five years in prison."}, {"Time_Start": 1160.42, "Time_End": 1161.18, "Text": " Or both."}, {"Time_Start": 1162.6200000000001, "Time_End": 1163.3000000000002, "Text": " Or both."}, {"Time_Start": 1163.38, "Time_End": 1164.18, "Text": " It's not one or the other."}, {"Time_Start": 1165.14, "Time_End": 1166.8400000000001, "Text": " The court can give you both of them."}, {"Time_Start": 1167.6000000000001, "Time_End": 1172.8400000000001, "Text": " Every subsequent offense after that is a fine up to $1 million, $10 years in prison, or both."}, {"Time_Start": 1173.6000000000001, "Time_End": 1175.8200000000002, "Text": " So once again, do it again, you get caught."}, {"Time_Start": 1176.4, "Time_End": 1177.42, "Text": " You're in bad shape."}, {"Time_Start": 1178.3000000000002, "Time_End": 1181.96, "Text": " And the statute puts a five-year statute of limitations, which means that from the time of the act,"}, {"Time_Start": 1182.18, "Time_End": 1189.88, "Text": " the government has five years to indict you, take you before the grand jury, and say you're now going to face criminal prosecution for your act."}, {"Time_Start": 1190.42, "Time_End": 1193.6000000000001, "Text": " So if any of you've done anything five years ago, you're good."}, {"Time_Start": 1198.42, "Time_End": 1202.38, "Text": " For those of you that haven't done things five years ago, and I saw a lot of phases out there, you're not so good."}, {"Time_Start": 1204.48, "Time_End": 1206.24, "Text": " Let me talk for a minute about some of the case law."}, {"Time_Start": 1208.42, "Time_End": 1212.8200000000002, "Text": " I spent, this case is probably the longest case that I broke down for you."}, {"Time_Start": 1213.44, "Time_End": 1216.94, "Text": " It's Universal City Studios v. Remerdies, I think, is where you pronounce it."}, {"Time_Start": 1216.94, "Time_End": 1218.8400000000001, "Text": " This is a famous DCSS case."}, {"Time_Start": 1220.42, "Time_End": 1225.94, "Text": " CSS has a technology, or DVDs have a technology on it, content scrambled system."}, {"Time_Start": 1226.66, "Time_End": 1232.52, "Text": " And what it does is it is a code on a DVD, and everybody probably knows this and you're going to make fun of me."}, {"Time_Start": 1232.6000000000001, "Time_End": 1236.0600000000002, "Text": " And I was a tech guy for seven years, so I know all the codes, but I'm going to speak to newbies."}, {"Time_Start": 1236.72, "Time_End": 1241.3000000000002, "Text": " It's got a code on it that needs a DVD player to encrypt that code so you can play it on the screen."}, {"Time_Start": 1242.04, "Time_End": 1248.3400000000001, "Text": " You can't copy it, you can't duplicate it in a machine, you can't really do anything with it other than play it in a DVD player."}, {"Time_Start": 1248.8400000000001, "Time_End": 1250.4, "Text": " So it has protections for it."}, {"Time_Start": 1250.42, "Time_End": 1256.8000000000002, "Text": " access to the information and then it has protections to prevent you from copying the information."}, {"Time_Start": 1256.8000000000002, "Time_End": 1261.42, "Text": " So it has two purposes, and remember earlier I talked about Congress not anticipating that."}, {"Time_Start": 1261.42, "Time_End": 1263.6000000000001, "Text": " They didn't expect that."}, {"Time_Start": 1263.6000000000001, "Time_End": 1265.18, "Text": " They did both things."}, {"Time_Start": 1265.18, "Time_End": 1270.3000000000002, "Text": " The young 15 year old kid in Norway wrote a piece of code with a couple other guys he met on IRC"}, {"Time_Start": 1270.3000000000002, "Time_End": 1278.5800000000002, "Text": " that basically took the information on the DVD, stripped it, and allowed people to copy DVDs"}, {"Time_Start": 1278.5800000000002, "Time_End": 1279.98, "Text": " and make perfect digital copies."}, {"Time_Start": 1279.98, "Time_End": 1284.9, "Text": " And then there was a technology that came along called DivX that allowed you to compress it and put it on a CD."}, {"Time_Start": 1285.6200000000001, "Time_End": 1291.28, "Text": " And this really bothered the movie studios because all their information now could be made perfect digital copies."}, {"Time_Start": 1292.78, "Time_End": 1296.94, "Text": " And anybody could transport it just over the Internet, send it over a modem, however you wanted to do it."}, {"Time_Start": 1297.7, "Time_End": 1303.22, "Text": " Well, 2,600, this little website and magazine, some of you may have heard of it, maybe."}, {"Time_Start": 1304.22, "Time_End": 1308.82, "Text": " These guys posted the CSS or the DCSS code on their website."}, {"Time_Start": 1309.98, "Time_End": 1313.66, "Text": " and it cheezed off the studios."}, {"Time_Start": 1314.8600000000001, "Time_End": 1317.98, "Text": " You know, these people now can make these perfect digital copies of it."}, {"Time_Start": 1318.42, "Time_End": 1322.22, "Text": " So they sued under the Digital Millennium Copyright Act 2,600."}, {"Time_Start": 1322.92, "Time_End": 1325.26, "Text": " A few other people, too, but 2,600 were the bad guys."}, {"Time_Start": 1325.68, "Time_End": 1328.4, "Text": " They sued them and told them, take all your stuff off the site."}, {"Time_Start": 1328.68, "Time_End": 1331.9, "Text": " Take all the DCSS off the site."}, {"Time_Start": 1335.18, "Time_End": 1336.6200000000001, "Text": " I'm going to get to that."}, {"Time_Start": 1336.6200000000001, "Time_End": 1338.8, "Text": " They posted it, they posted on the site at first."}, {"Time_Start": 1339.98, "Time_End": 1341.32, "Text": " The preliminary injunction came out."}, {"Time_Start": 1342.9, "Time_End": 1347.0, "Text": " DCS, the guys of 2600 said, hey, there's a chance we're going to lose this."}, {"Time_Start": 1347.18, "Time_End": 1352.9, "Text": " So as an act of civil disobedience, and we all know that the 2600 guys are, they don't like that."}, {"Time_Start": 1352.92, "Time_End": 1354.28, "Text": " They don't like the civil disobedience stuff."}, {"Time_Start": 1354.88, "Time_End": 1358.34, "Text": " These guys posted, you know, 50 mirrors."}, {"Time_Start": 1358.58, "Time_End": 1362.44, "Text": " They went to a whole bunch of sites that allowed you to get DCSS, but didn't actually have it on their site."}, {"Time_Start": 1363.1, "Time_End": 1367.58, "Text": " So it became a big issue later on as to whether that is a violation."}, {"Time_Start": 1367.74, "Time_End": 1368.76, "Text": " Can you post to other sites?"}, {"Time_Start": 1368.76, "Time_End": 1369.96, "Text": " Can you provide information that tells us?"}, {"Time_Start": 1369.98, "Time_End": 1377.28, "Text": " people go get it from www.com or where can you get it from it posted a big thing well the court"}, {"Time_Start": 1377.28, "Time_End": 1384.92, "Text": " wrote a long opinion and they came up with these these read the opinion find it somewhere read the"}, {"Time_Start": 1384.92, "Time_End": 1389.92, "Text": " opinion you won't understand 90% of the first amendment stuff but it's very interesting to see the"}, {"Time_Start": 1389.92, "Time_End": 1396.92, "Text": " court sidestep certain rights and certain things that we take and and we think are right and the court"}, {"Time_Start": 1396.92, "Time_End": 1399.96, "Text": " sidesteps it what i've done here is i've used"}, {"Time_Start": 1399.98, "Time_End": 1404.02, "Text": " some of the exemptions and just a few of them that the guys from 2600 argued."}, {"Time_Start": 1404.58, "Time_End": 1408.38, "Text": " The first thing they argued was reverse engineering. Remember the exemption for reverse"}, {"Time_Start": 1408.38, "Time_End": 1416.76, "Text": " engineering I had up earlier? The argument was this is necessary for us to make Linux DVD player."}, {"Time_Start": 1416.8600000000001, "Time_End": 1420.72, "Text": " There's not one out there. I mean, we're going to make interoperable. We got to make this work with Linux."}, {"Time_Start": 1420.8600000000001, "Time_End": 1424.14, "Text": " You know, there's a lot of people that have Linux. No one here, but there's an operating system"}, {"Time_Start": 1424.14, "Time_End": 1429.64, "Text": " called Linux. And we need to make our DVDs work with Linux and nobody has that yet. So we need"}, {"Time_Start": 1429.64, "Time_End": 1435.14, "Text": " access to them to make them interoperable. Well, the court heard the argument and this is what"}, {"Time_Start": 1435.14, "Time_End": 1442.16, "Text": " they held. The argument fails because the source can only be made available in others, two others,"}, {"Time_Start": 1442.4, "Time_End": 1446.96, "Text": " by the person who acquired the information. It means that only I, if I write that code,"}, {"Time_Start": 1447.16, "Time_End": 1452.5400000000002, "Text": " can give it to you. I cannot give it to you and then you give it to that third party. So that's"}, {"Time_Start": 1452.5400000000002, "Time_End": 1456.8200000000002, "Text": " the way they sidestepped that, that the statute reads that only the person writing it."}, {"Time_Start": 1459.64, "Time_End": 1465.68, "Text": " The right to make the information available extends only to the dissemination solely"}, {"Time_Start": 1465.68, "Time_End": 1470.5800000000002, "Text": " for the purpose. Remember the solely language I used? So basically, you have to fall into"}, {"Time_Start": 1470.5800000000002, "Time_End": 1477.48, "Text": " the encryption research, give all the information of the copyright owner, and it's got to be solely"}, {"Time_Start": 1477.48, "Time_End": 1481.4, "Text": " for the purpose. It can't be for anything else. So in other words, we want this for a Linux DVD"}, {"Time_Start": 1481.4, "Time_End": 1486.8200000000002, "Text": " player, but we can't bypass the code and we can't copy it to make a DVD player. It's got to be solely"}, {"Time_Start": 1486.8200000000002, "Time_End": 1489.6200000000001, "Text": " for the purpose of a DVD player. And this code lets other people"}, {"Time_Start": 1489.64, "Time_End": 1495.64, "Text": " who don't have Linux DVD players rip DVDs and have perfect copies of movies."}, {"Time_Start": 1495.64, "Time_End": 1500.64, "Text": " So it fails reverse engineering for that purpose because somebody else other than Linux users can have it."}, {"Time_Start": 1500.64, "Time_End": 1505.64, "Text": " Not for public dissemination. A, you're not supposed to give it to anybody else."}, {"Time_Start": 1505.64, "Time_End": 1511.64, "Text": " And finally the most interesting argument, I think that the court wrote in their opinion,"}, {"Time_Start": 1511.64, "Time_End": 1516.64, "Text": " is that DCSS was written on a Windows platform."}, {"Time_Start": 1516.64, "Time_End": 1519.6200000000001, "Text": " And therefore, the writers should"}, {"Time_Start": 1519.64, "Time_End": 1522.64, "Text": " should have known that window users were going to use this software."}, {"Time_Start": 1522.64, "Time_End": 1529.64, "Text": " Now, I don't know of any platform that is owned or operated by one person."}, {"Time_Start": 1529.64, "Time_End": 1534.64, "Text": " In other words, nobody has a laptop that has, you know, the Dario operating system on it,"}, {"Time_Start": 1534.64, "Time_End": 1536.64, "Text": " and I got to write it for that so I can do it."}, {"Time_Start": 1536.64, "Time_End": 1538.64, "Text": " These people wrote it in Windows, and the court said,"}, {"Time_Start": 1538.64, "Time_End": 1540.64, "Text": " well, because you wrote it in Windows, other people could use it,"}, {"Time_Start": 1540.64, "Time_End": 1542.64, "Text": " and therefore it's not solely for the purpose."}, {"Time_Start": 1542.64, "Time_End": 1545.64, "Text": " The logic, figure it out."}, {"Time_Start": 1545.64, "Time_End": 1548.64, "Text": " The second argument, the guy is from 2600 made."}, {"Time_Start": 1548.64, "Time_End": 1555.64, "Text": " 2,600 made, is that there is a fair use. Copyright law is, it's an entire chapter"}, {"Time_Start": 1555.64, "Time_End": 1560.64, "Text": " in the United States code. You basically have the right to make copies of things for fair use."}, {"Time_Start": 1560.64, "Time_End": 1564.64, "Text": " In other words, I can copy something for this presentation in a small portion to present it to you."}, {"Time_Start": 1564.64, "Time_End": 1571.64, "Text": " A college professor can copy two comparative works to show you a director from, you know, Citizen Kane"}, {"Time_Start": 1571.64, "Time_End": 1575.64, "Text": " and how he did something as compared to a director from, you know, hackers, that movie hackers."}, {"Time_Start": 1575.64, "Time_End": 1577.64, "Text": " You know, how did they do that?"}, {"Time_Start": 1577.64, "Time_End": 1578.64, "Text": " There's a fair use object."}, {"Time_Start": 1578.64, "Time_End": 1581.64, "Text": " The court acknowledges, and in their opinion, they write,"}, {"Time_Start": 1581.64, "Time_End": 1584.64, "Text": " oh, this is going to really be a problem for fair use."}, {"Time_Start": 1584.64, "Time_End": 1587.64, "Text": " Now, you know, Houston, we have a problem on this one."}, {"Time_Start": 1587.64, "Time_End": 1590.64, "Text": " The way they get around it is they say,"}, {"Time_Start": 1590.64, "Time_End": 1594.64, "Text": " Congress created the exemptions that they thought was fair,"}, {"Time_Start": 1594.64, "Time_End": 1596.64, "Text": " and they put fair in quotations."}, {"Time_Start": 1596.64, "Time_End": 1599.64, "Text": " Never mind the fair use doctrine."}, {"Time_Start": 1599.64, "Time_End": 1600.64, "Text": " Never mind."}, {"Time_Start": 1600.64, "Time_End": 1604.64, "Text": " The exemptions that I went through earlier are what Congress thought fair"}, {"Time_Start": 1604.64, "Time_End": 1606.64, "Text": " when they wrote the statute."}, {"Time_Start": 1606.64, "Time_End": 1608.64, "Text": " The fact that Congress is"}, {"Time_Start": 1608.64, "Time_End": 1611.64, "Text": " selected to leave technologically unsophisticated persons"}, {"Time_Start": 1611.64, "Time_End": 1614.64, "Text": " who wish to make fair use of encrypted copyrighted works"}, {"Time_Start": 1614.64, "Time_End": 1616.64, "Text": " without the technical means of doing so"}, {"Time_Start": 1616.64, "Time_End": 1617.64, "Text": " is a matter for Congress."}, {"Time_Start": 1620.64, "Time_End": 1622.64, "Text": " That's a quote from the opinion."}, {"Time_Start": 1625.64, "Time_End": 1629.64, "Text": " Then, finally, 2,600 argued the First Amendment."}, {"Time_Start": 1629.64, "Time_End": 1632.64, "Text": " Now, the First Amendment for the Court in this case"}, {"Time_Start": 1632.64, "Time_End": 1636.64, "Text": " is a big, hairy, smelly, 800-pound gorilla."}, {"Time_Start": 1636.64, "Time_End": 1638.64, "Text": " And if you read the opinion,"}, {"Time_Start": 1638.64, "Time_End": 1642.64, "Text": " you'll burn it and throw it away because you won't understand it number one."}, {"Time_Start": 1642.64, "Time_End": 1646.64, "Text": " And it compares content versus expressive versus all kinds of stuff."}, {"Time_Start": 1646.64, "Time_End": 1648.64, "Text": " It's a real mess for them."}, {"Time_Start": 1648.64, "Time_End": 1653.64, "Text": " The court, the first thing the court did in this opinion is acknowledged that code is protected free speech."}, {"Time_Start": 1653.64, "Time_End": 1656.64, "Text": " Code is written. It's free speech."}, {"Time_Start": 1656.64, "Time_End": 1658.64, "Text": " We understand that it can be free speech."}, {"Time_Start": 1658.64, "Time_End": 1662.64, "Text": " We understand that a code is entitled to First Amendment protection."}, {"Time_Start": 1662.64, "Time_End": 1667.64, "Text": " Let me page it down here real quick."}, {"Time_Start": 1667.64, "Time_End": 1670.64, "Text": " page down here real quick so we can read this all at one time and do it together."}, {"Time_Start": 1674.64, "Time_End": 1680.64, "Text": " Just as a computer code cannot be excluded from the area of First Amendment concern because it is abstract."}, {"Time_Start": 1680.64, "Time_End": 1682.64, "Text": " In many cases, arcane."}, {"Time_Start": 1682.64, "Time_End": 1685.64, "Text": " I had to look arcane up in the dictionary because my vocabulary is not that big,"}, {"Time_Start": 1685.64, "Time_End": 1688.64, "Text": " but arcane means understood by only a few."}, {"Time_Start": 1688.64, "Time_End": 1689.64, "Text": " Okay?"}, {"Time_Start": 1689.64, "Time_End": 1694.64, "Text": " So it's abstract, first of all, I'm sure everybody in this room thinks that computer code is abstract."}, {"Time_Start": 1694.64, "Time_End": 1696.64, "Text": " And I'm sure that everybody in this room thinks that computer code is arcane,"}, {"Time_Start": 1696.64, "Time_End": 1697.64, "Text": " but that's the way that."}, {"Time_Start": 1697.64, "Time_End": 1703.3400000000001, "Text": " the court views it. It's abstract and arcane. That long history of First Amendment jurisprudence"}, {"Time_Start": 1703.3400000000001, "Time_End": 1708.44, "Text": " makes equally clear that the fact words, symbols, and even actions convey ideas. Remember"}, {"Time_Start": 1708.44, "Time_End": 1715.5400000000002, "Text": " the fuck the draft shirt or, you know, things like that. And evoke emotions does not inevitably"}, {"Time_Start": 1715.5400000000002, "Time_End": 1721.7, "Text": " place them beyond the power of government. What the court basically did there, there's a famous"}, {"Time_Start": 1721.7, "Time_End": 1727.6200000000001, "Text": " case about written in First Amendment law. And you're protected by First Amendment speech, but"}, {"Time_Start": 1727.64, "Time_End": 1730.8400000000001, "Text": " a room like this, I'm not protected. If I yell, fire, fire, and everybody"}, {"Time_Start": 1730.8400000000001, "Time_End": 1736.2, "Text": " stores for the door and people get trampled, that's a, that's a not protected free speech."}, {"Time_Start": 1736.4, "Time_End": 1738.98, "Text": " Because there's not a fire. I'm not trying to save anybody. I'm just creating a problem."}, {"Time_Start": 1739.8400000000001, "Time_End": 1746.68, "Text": " That's what the court's done with that statement. That court said in this opinion that the"}, {"Time_Start": 1746.68, "Time_End": 1752.44, "Text": " CSS code, or the DCSS code, rather, is equivalent of yelling fire in a crowded room like this,"}, {"Time_Start": 1752.44, "Time_End": 1757.46, "Text": " and it's not protected. That's the way that they put it into context that lawyers may understand,"}, {"Time_Start": 1757.64, "Time_End": 1763.38, "Text": " of, you know, programmers. A computer program does more than convey a message."}, {"Time_Start": 1763.38, "Time_End": 1768.8600000000001, "Text": " It does more than express the programmers' concepts. DCSS has a distinctly functional non-speech"}, {"Time_Start": 1768.8600000000001, "Time_End": 1774.3200000000002, "Text": " aspect in addition to reflecting the thoughts of the programmers. The DMCA, as applied to the posting"}, {"Time_Start": 1774.3200000000002, "Time_End": 1780.5800000000002, "Text": " of computer code, is valid exercise of Congress's authority. Relief granted. Relief granted"}, {"Time_Start": 1780.5800000000002, "Time_End": 1787.6200000000001, "Text": " basically means they gave them an injunction. They could have gotten money damages. They could have gotten other damages allowed"}, {"Time_Start": 1787.64, "Time_End": 1790.72, "Text": " by the DMCA. They could have taken their equipment. They could have burned it. They could"}, {"Time_Start": 1790.72, "Time_End": 1797.98, "Text": " have done all the things that we talked about. But that last line about code not being expressive."}, {"Time_Start": 1797.98, "Time_End": 1803.1200000000001, "Text": " It's instructions as a function is very troubling. And if you get a moment in more than a moment,"}, {"Time_Start": 1803.18, "Time_End": 1807.46, "Text": " but if you read the opinion, you'll see the trouble the court has in dealing with that issue,"}, {"Time_Start": 1807.5400000000002, "Time_End": 1813.0600000000002, "Text": " that First Amendment issue, as to whether code is protected first. Take it in two cassette decks and make a copy of it."}, {"Time_Start": 1813.5600000000002, "Time_End": 1817.5200000000002, "Text": " And it creates a real problem for real networks and the argument as well. But effective"}, {"Time_Start": 1817.64, "Time_End": 1821.0800000000002, "Text": " control doesn't necessarily mean I can't get to it. Effective control just means there's"}, {"Time_Start": 1821.0800000000002, "Time_End": 1826.0200000000002, "Text": " some protection afforded to it. That's the way the courts have interpreted that. And there's"}, {"Time_Start": 1826.0200000000002, "Time_End": 1830.2, "Text": " actually a definition of effective control in the statute itself, but like everything else,"}, {"Time_Start": 1830.2, "Time_End": 1836.64, "Text": " is subject to interpretation. The argument, this is what Streambox was arguing. This is"}, {"Time_Start": 1836.64, "Time_End": 1841.68, "Text": " what Streambox was telling the judge, look, the protection is not effective because the user"}, {"Time_Start": 1841.68, "Time_End": 1847.46, "Text": " could videotape the screen with a digital video camera and could listen to what's coming through"}, {"Time_Start": 1847.46, "Time_End": 1851.92, "Text": " with the speakers and then they could, you know, circulate perfect digital copies of that"}, {"Time_Start": 1851.92, "Time_End": 1857.38, "Text": " off the screen. The court found the argument was not valid because the result would not be a perfect"}, {"Time_Start": 1857.38, "Time_End": 1865.46, "Text": " digital copy. That's true, but a camcorder that makes digital copies would be perfect digital copies of"}, {"Time_Start": 1865.46, "Time_End": 1870.6000000000001, "Text": " that result, which would basically get you exactly what you needed anyway. The court held that even"}, {"Time_Start": 1870.6000000000001, "Time_End": 1877.18, "Text": " if it were so, even if that were true that you could copy it from your camcorder, it doesn't"}, {"Time_Start": 1877.18, "Time_End": 1883.54, "Text": " make a difference because the VCR circumvents access to let you see it in the first"}, {"Time_Start": 1883.54, "Time_End": 1889.72, "Text": " place. Remember the big or I put on that thing? One, two, or three? Just because the"}, {"Time_Start": 1889.72, "Time_End": 1896.3200000000002, "Text": " VCR circumvented the access to that stream, that's enough under the DMCA. We don't"}, {"Time_Start": 1896.3200000000002, "Time_End": 1899.78, "Text": " even worry about whether you could copy it or not. All we're worried about is did you circumvent"}, {"Time_Start": 1899.78, "Time_End": 1904.9, "Text": " the access? Yes, you violated the provisions of the DMCA, and that was enough. So we're not"}, {"Time_Start": 1904.9, "Time_End": 1908.7, "Text": " even going to get to you copying it off the screen or copying it with your, you know, pocket"}, {"Time_Start": 1908.7, "Time_End": 1914.66, "Text": " recorder, whatever it is. And I got a little note here because one of the things that real networks"}, {"Time_Start": 1914.66, "Time_End": 1924.3600000000001, "Text": " tried to argue is that their data, their file, their stream was in a proprietary format, and no one"}, {"Time_Start": 1924.3600000000001, "Time_End": 1930.3000000000002, "Text": " else had access to it. Therefore, you don't need access, but just the fact that it's proprietary"}, {"Time_Start": 1930.3000000000002, "Time_End": 1934.88, "Text": " means it's protected. Nobody else can get it. That is a horrifying. That is a horrifying."}, {"Time_Start": 1934.9, "Time_End": 1941.38, "Text": " argument. If you think about it for just a minute, the fact that this law has resulted in a"}, {"Time_Start": 1941.38, "Time_End": 1945.3200000000002, "Text": " copyright owner saying, all I'm going to do is put in a proprietary format. I'm not going to"}, {"Time_Start": 1945.3200000000002, "Time_End": 1953.0, "Text": " protect it. That in itself makes it protected is the repercussions of that in not only in law,"}, {"Time_Start": 1953.0800000000002, "Time_End": 1959.02, "Text": " but in the computer areas is very, very scary. The third case I want to talk about real"}, {"Time_Start": 1959.02, "Time_End": 1964.68, "Text": " quick is Microsystem Software versus Scandinavia Online. This case involved"}, {"Time_Start": 1964.9, "Time_End": 1970.38, "Text": " a little program called Cyber Patrol. What it is, a web blocking program, you add it to your"}, {"Time_Start": 1970.38, "Time_End": 1977.8400000000001, "Text": " computer and there's certain websites you can't go to if that program is installed. What the folks at"}, {"Time_Start": 1977.8400000000001, "Time_End": 1987.2800000000002, "Text": " Microsystems did is they encrypted the web access, what sites were being blocked. So in other words,"}, {"Time_Start": 1987.2800000000002, "Time_End": 1994.38, "Text": " if I were a small company called Microsoft, and I made one of these, and in that code, I encrypted"}, {"Time_Start": 1994.38, "Time_End": 1997.8000000000002, "Text": " the fact I didn't want people to go to, you know, Linux, or I didn't want people to go"}, {"Time_Start": 1997.8000000000002, "Time_End": 2002.7600000000002, "Text": " to anything with, with $2,600 in it, or I didn't want people to visit any site. How would I know?"}, {"Time_Start": 2004.16, "Time_End": 2009.18, "Text": " It's encrypted. I don't have access to it. How would I know that that software is not blocking my"}, {"Time_Start": 2009.18, "Time_End": 2016.5200000000002, "Text": " access to certain 2,600 sites or certain Linux sites or certain competitor sites? Well, that was"}, {"Time_Start": 2016.5200000000002, "Time_End": 2024.14, "Text": " the issue of that case. The court doesn't even address it. It doesn't even talk about whether you can"}, {"Time_Start": 2024.14, "Time_End": 2030.5, "Text": " decrypt something like that. The court, very interestingly, wants to avoid any discussion"}, {"Time_Start": 2030.5, "Time_End": 2035.92, "Text": " of the violation by saying, sorry, guys, you didn't have standing. Standing is a thing in the law"}, {"Time_Start": 2035.92, "Time_End": 2042.8400000000001, "Text": " that I cannot sue for her. I can't go and say, I want to sue on behalf of her. She has to sue on her own."}, {"Time_Start": 2043.44, "Time_End": 2047.88, "Text": " Well, what happened is Scandinavian Online basically left their cause of action, and some people that"}, {"Time_Start": 2047.88, "Time_End": 2052.62, "Text": " wanted the decrypted information they were providing followed up on the appeal. They said,"}, {"Time_Start": 2052.62, "Time_End": 2055.64, "Text": " wait a minute, wait, wait. We want the right to be able to do that. And they were doing a good"}, {"Time_Start": 2055.64, "Time_End": 2059.92, "Text": " thing for us so that we could see who is being blocked and not. The court said, hey, you all are good"}, {"Time_Start": 2059.92, "Time_End": 2064.3399999999997, "Text": " guys. That's a great argument. We're not going to wrestle that animal. You don't have standing"}, {"Time_Start": 2064.3399999999997, "Time_End": 2069.62, "Text": " thanks by. That's the way they got rid of it. They got rid of it on legal grounds, not on grounds of the"}, {"Time_Start": 2069.62, "Time_End": 2074.74, "Text": " DMCA. One of the reasons I brought these three cases out is, well, they're pretty much the leading"}, {"Time_Start": 2074.74, "Time_End": 2080.8599999999997, "Text": " cases in the area. But more importantly, so you get an idea of how courts are having a problem,"}, {"Time_Start": 2080.86, "Time_End": 2087.32, "Text": " wrestling with this issue of what constitutes access, what constitutes fair use."}, {"Time_Start": 2087.6600000000003, "Time_End": 2093.6400000000003, "Text": " They will sidestep any way they can to avoid it. They'll avoid it with standing."}, {"Time_Start": 2094.08, "Time_End": 2098.28, "Text": " They'll avoid it with saying the First Amendment, well, we got a problem with it, but, you know,"}, {"Time_Start": 2098.42, "Time_End": 2103.0, "Text": " fair use is what Congress says it is. Now what we say it is. They're constantly sidestepping"}, {"Time_Start": 2103.0, "Time_End": 2108.08, "Text": " because the language of the DMCA is a little bit tough to deal with."}, {"Time_Start": 2110.86, "Time_End": 2112.1800000000003, "Text": " question? Yes."}, {"Time_Start": 2114.3, "Time_End": 2114.9, "Text": " What's that?"}, {"Time_Start": 2116.2200000000003, "Time_End": 2120.1800000000003, "Text": " I, streaming media, serious, they think that there was too many options."}, {"Time_Start": 2120.48, "Time_End": 2124.9, "Text": " The reason I use this case is because this case addresses many of that, the launch.com case,"}, {"Time_Start": 2125.06, "Time_End": 2126.6, "Text": " but it's very similar to this case."}, {"Time_Start": 2127.06, "Time_End": 2131.1400000000003, "Text": " But the actual written opinion on that one is not near as nice to read as the real network's case."}, {"Time_Start": 2131.2200000000003, "Time_End": 2132.3, "Text": " This one's a little bit better to read."}, {"Time_Start": 2133.02, "Time_End": 2133.2200000000003, "Text": " Yes."}, {"Time_Start": 2136.06, "Time_End": 2136.5, "Text": " Yes."}, {"Time_Start": 2137.5, "Time_End": 2139.96, "Text": " The, no, actually, no, it doesn't."}, {"Time_Start": 2140.0, "Time_End": 2140.84, "Text": " The real network's case."}, {"Time_Start": 2140.86, "Time_End": 2142.84, "Text": " deals, what was that?"}, {"Time_Start": 2144.4, "Time_End": 2145.56, "Text": " I thought somebody said something."}, {"Time_Start": 2147.1, "Time_End": 2148.0, "Text": " Oh, yeah, I'm sorry."}, {"Time_Start": 2148.6800000000003, "Time_End": 2153.4, "Text": " Does the real network case talk about the Sony versus Universal case?"}, {"Time_Start": 2153.78, "Time_End": 2154.34, "Text": " It does."}, {"Time_Start": 2154.88, "Time_End": 2156.6600000000003, "Text": " You're talking about the VCR and time shifting?"}, {"Time_Start": 2157.26, "Time_End": 2157.54, "Text": " Right."}, {"Time_Start": 2157.9, "Time_End": 2160.56, "Text": " They talk about that, and it got a little bit deep."}, {"Time_Start": 2160.94, "Time_End": 2162.1800000000003, "Text": " I'm already at 40 minutes."}, {"Time_Start": 2162.2400000000002, "Time_End": 2162.96, "Text": " I knew this was going to happen."}, {"Time_Start": 2163.38, "Time_End": 2166.26, "Text": " But basically what they argued was you could time shift it."}, {"Time_Start": 2166.26, "Time_End": 2170.58, "Text": " In other words, I could record, you know, Frazier at 8 o'clock and watch 11 o'clock."}, {"Time_Start": 2170.86, "Time_End": 2173.5, "Text": " That case with VCR said it's okay to time shift."}, {"Time_Start": 2173.78, "Time_End": 2180.3, "Text": " Real networks, they address it, but it doesn't play a part in it because why would you need a time shift on a computer if you always have it there?"}, {"Time_Start": 2180.46, "Time_End": 2182.7200000000003, "Text": " It's not the equivalent of losing the show once it already passed."}, {"Time_Start": 2183.1, "Time_End": 2186.88, "Text": " So they talk about it, but that dealt with VCRs and they really didn't do a whole lot with it."}, {"Time_Start": 2187.56, "Time_End": 2193.1400000000003, "Text": " Now, there was a thing called the SDMI challenge."}, {"Time_Start": 2194.1400000000003, "Time_End": 2200.84, "Text": " The SDI challenge is a new technology with a variance watermark to prevent people from."}, {"Time_Start": 2200.86, "Time_End": 2203.46, "Text": " copying CD-ROMs, copying music."}, {"Time_Start": 2204.42, "Time_End": 2213.02, "Text": " It was a challenge that these, this SDI put out, and they basically threw down a gauntlet to a bunch of people"}, {"Time_Start": 2213.02, "Time_End": 2214.86, "Text": " and said, break our technology."}, {"Time_Start": 2215.1, "Time_End": 2216.1800000000003, "Text": " This is great technology."}, {"Time_Start": 2216.32, "Time_End": 2218.04, "Text": " This Varence watermark is so good."}, {"Time_Start": 2218.54, "Time_End": 2220.0, "Text": " You know, it's the best thing coming along."}, {"Time_Start": 2220.94, "Time_End": 2222.54, "Text": " Well, they put it out there."}, {"Time_Start": 2222.6, "Time_End": 2226.04, "Text": " They let people download content with the watermark in it."}, {"Time_Start": 2226.2200000000003, "Time_End": 2229.54, "Text": " They let people have access to it, and they let people get into it to try to break the watermark."}, {"Time_Start": 2229.54, "Time_End": 2232.56, "Text": " Well, not surprising somebody did it."}, {"Time_Start": 2233.38, "Time_End": 2234.46, "Text": " Many people did it."}, {"Time_Start": 2235.34, "Time_End": 2238.66, "Text": " One of the people that did it was a gentleman named Edward Felton."}, {"Time_Start": 2239.3, "Time_End": 2244.4, "Text": " Edward Felton is a college professor in computer science at Princeton University."}, {"Time_Start": 2245.98, "Time_End": 2250.94, "Text": " You know, sort of a reputable guy, I guess, you know, he's got a little bit of credentials behind him."}, {"Time_Start": 2252.2599999999998, "Time_End": 2256.48, "Text": " He wrote an article, a paper on it."}, {"Time_Start": 2256.48, "Time_End": 2259.52, "Text": " He submitted the paper to peer review, and he was going to present the paper."}, {"Time_Start": 2259.54, "Time_End": 2265.44, "Text": " paper at the information hiding workshop in D.C. this year. He got a very interesting letter"}, {"Time_Start": 2265.44, "Time_End": 2271.3, "Text": " from the folks at RIA, the recording industry, and SDI. He got a very interesting letter"}, {"Time_Start": 2271.3, "Time_End": 2276.88, "Text": " when he submitted his paper publishing. And I got a copy of it, and I just highlighted some areas,"}, {"Time_Start": 2276.88, "Time_End": 2282.64, "Text": " and I want you to take a look at how far we've come in three years, where a challenge is thrown down,"}, {"Time_Start": 2283.24, "Time_End": 2286.44, "Text": " the challenge is answered, and then you get an interesting letter like this."}, {"Time_Start": 2288.48, "Time_End": 2289.52, "Text": " This is the whole letter."}, {"Time_Start": 2289.54, "Time_End": 2294.98, "Text": " I just, I highlighted some stuff in red, and I brought up my screen at the bottom, and all kinds of stuff is falling apart on me."}, {"Time_Start": 2298.7799999999997, "Time_End": 2301.32, "Text": " This is the letter he got, and some of this you can't see, so I'll read it."}, {"Time_Start": 2302.12, "Time_End": 2309.22, "Text": " He got a letter from the vice president, who's a lawyer, of the Recording Institute, and the letter said,"}, {"Time_Start": 2309.82, "Time_End": 2314.24, "Text": " as you're aware, at least one of the technologies that was subject to the public challenge, notice the public challenge."}, {"Time_Start": 2314.44, "Time_End": 2316.66, "Text": " I mean, they basically threw down a gauntlet, and this guy met the challenge."}, {"Time_Start": 2317.38, "Time_End": 2319.52, "Text": " The Verence Watermark is already in commercial use."}, {"Time_Start": 2319.54, "Time_End": 2323.2, "Text": " and the disclosure of any information that might assist others to remove this watermark"}, {"Time_Start": 2323.2, "Time_End": 2326.34, "Text": " would seriously jeopardize the technology and the content it presents."}, {"Time_Start": 2327.2799999999997, "Time_End": 2331.54, "Text": " In addition, any disclosure of information gained from participating in the public challenge"}, {"Time_Start": 2331.54, "Time_End": 2334.32, "Text": " would be outside the scope of the activities permitted by the agreement"}, {"Time_Start": 2334.32, "Time_End": 2338.84, "Text": " and could subject you to research team to actions under the DMCA."}, {"Time_Start": 2341.1, "Time_End": 2345.36, "Text": " Unfortunately, the disclosure that you are contemplating"}, {"Time_Start": 2345.36, "Time_End": 2349.52, "Text": " could result a significant broader consequence and could directly lead to the"}, {"Time_Start": 2349.54, "Time_End": 2351.14, "Text": " legal distribution of copyrighted material."}, {"Time_Start": 2351.7799999999997, "Time_End": 2356.24, "Text": " Such disclosure is not authorized by the agreement would constitute a violation of the agreement"}, {"Time_Start": 2356.24, "Time_End": 2361.62, "Text": " and would subject your research team to the enforcement actions under the DMCA and possibly other federal laws."}, {"Time_Start": 2363.48, "Time_End": 2368.1, "Text": " Business has already made the decision that they can use the Digital Millennium Copyright Act"}, {"Time_Start": 2368.1, "Time_End": 2374.5, "Text": " to stop the publication of a paper presented by a Princeton College professor."}, {"Time_Start": 2377.3, "Time_End": 2379.0, "Text": " He pulled the paper on his own."}, {"Time_Start": 2379.54, "Time_End": 2385.0, "Text": " He pulled the paper. Talk about the freezing and chilling of free speech."}, {"Time_Start": 2385.36, "Time_End": 2387.68, "Text": " Is it a prior restraint? Yes."}, {"Time_Start": 2388.32, "Time_End": 2391.48, "Text": " Did Congress address a prior restraint on free speech in the DMCA?"}, {"Time_Start": 2391.86, "Time_End": 2392.3, "Text": " Yes."}, {"Time_Start": 2393.3, "Time_End": 2397.16, "Text": " Did they care? Was it enough to scare Felton? He pulled his paper."}, {"Time_Start": 2397.88, "Time_End": 2403.68, "Text": " Here is a college professor that was chilled by words in a statute,"}, {"Time_Start": 2403.96, "Time_End": 2409.2599999999998, "Text": " now used by the people who enacted the statute to stop him from providing all of us"}, {"Time_Start": 2409.26, "Time_End": 2412.6400000000003, "Text": " with a technical paper that may lead us to better security,"}, {"Time_Start": 2412.94, "Time_End": 2416.98, "Text": " that may lead us to something that is not anticipated right now,"}, {"Time_Start": 2417.48, "Time_End": 2420.0200000000004, "Text": " he pulled it. They have filed an action."}, {"Time_Start": 2421.28, "Time_End": 2424.84, "Text": " Dr. Felton filed a declaratory action to say,"}, {"Time_Start": 2425.0, "Time_End": 2428.2000000000003, "Text": " can I publish it or not? But who knows if that's going to be out eight years from now,"}, {"Time_Start": 2428.28, "Time_End": 2430.9, "Text": " or eight months from now, rather, a year from those, no way to tell. Yes."}, {"Time_Start": 2439.26, "Time_End": 2443.6200000000003, "Text": " the weepo treaties, you take it, whether you like it or not."}, {"Time_Start": 2458.5400000000004, "Time_End": 2463.86, "Text": " Look, those questions, all right? Those are too hard. There's too much, all right? There's too"}, {"Time_Start": 2463.86, "Time_End": 2466.7200000000003, "Text": " much there on that one, okay? Yes."}, {"Time_Start": 2469.26, "Time_End": 2476.5800000000004, "Text": " The question is, is it an alternate action that he wanted to establish a test case?"}, {"Time_Start": 2476.92, "Time_End": 2481.0600000000004, "Text": " Yeah, but do you think he dedicated a research team at Princeton just to make law?"}, {"Time_Start": 2481.32, "Time_End": 2485.2000000000003, "Text": " Do you think Dr. Felton gives a rosy rat's ass about me and the law?"}, {"Time_Start": 2485.5, "Time_End": 2490.82, "Text": " He was doing a project. Somebody threw down a challenge in front of a man who said, I'll meet your challenge,"}, {"Time_Start": 2491.0400000000004, "Time_End": 2494.7400000000002, "Text": " and as a result of meeting it, I'm going to let all my peers. I subjected this paper to peer review."}, {"Time_Start": 2494.7400000000002, "Time_End": 2499.1600000000003, "Text": " And everybody said, damn, man, you're a pretty bright guy, but you can't release that information."}, {"Time_Start": 2499.26, "Time_End": 2504.34, "Text": " So, do I think he did it for the purpose of doing this? No, not by any stretch of imagination."}, {"Time_Start": 2504.8, "Time_End": 2508.88, "Text": " Do I think that he's an innocent party caught up in a cyclone of law that he may not understand?"}, {"Time_Start": 2509.1800000000003, "Time_End": 2511.26, "Text": " That's exactly what I think happened. Yes."}, {"Time_Start": 2512.5, "Time_End": 2518.92, "Text": " The basically, the strong-armine, the reference you just saw, they eventually a couple times, they referenced something called an agreement."}, {"Time_Start": 2519.2200000000003, "Time_End": 2519.6800000000003, "Text": " Right."}, {"Time_Start": 2523.1800000000003, "Time_End": 2526.0200000000004, "Text": " Actually, he entered what's called a click-through agreement."}, {"Time_Start": 2526.32, "Time_End": 2529.0400000000004, "Text": " In order to get the test software."}, {"Time_Start": 2529.26, "Time_End": 2536.44, "Text": " You had to go to the website, identify yourself, read an agreement, click through it, and then the software came over to your computer."}, {"Time_Start": 2536.9, "Time_End": 2538.5400000000004, "Text": " So he read a click-through agreement."}, {"Time_Start": 2538.9, "Time_End": 2542.5600000000004, "Text": " That may be an issue that the court may use to circumvent the DMCA again."}, {"Time_Start": 2543.46, "Time_End": 2547.0600000000004, "Text": " You know, they may go on principles of contract law, basically."}, {"Time_Start": 2547.5400000000004, "Time_End": 2549.6600000000003, "Text": " But it's going to be very interesting to find out."}, {"Time_Start": 2549.7400000000002, "Time_End": 2550.36, "Text": " There was an agreement."}, {"Time_Start": 2550.48, "Time_End": 2556.0200000000004, "Text": " He did click through to get the software, which gives a court another issue to hang on to in order to maybe get away from the DMCA."}, {"Time_Start": 2557.1400000000003, "Time_End": 2557.5400000000004, "Text": " Yes."}, {"Time_Start": 2559.26, "Time_End": 2563.26, "Text": " on patent law versus fair use."}, {"Time_Start": 2563.26, "Time_End": 2583.26, "Text": " It seems to me that the . ."}, {"Time_Start": 2583.26, "Time_End": 2585.26, "Text": " The question goes to, can I talk a little bit about patent law versus copyright law and"}, {"Time_Start": 2585.26, "Time_End": 2589.2400000000002, "Text": " versus copyright law and versus a company putting a little bit about patent law versus a company putting"}, {"Time_Start": 2589.26, "Time_End": 2591.6000000000004, "Text": " something out there in just a proprietary format."}, {"Time_Start": 2591.96, "Time_End": 2594.7000000000003, "Text": " And the answer to that question is, no, I can't because I really don't know anything about patent law."}, {"Time_Start": 2595.42, "Time_End": 2597.28, "Text": " So I do trial work."}, {"Time_Start": 2597.32, "Time_End": 2598.46, "Text": " I don't do much patent law stuff."}, {"Time_Start": 2599.0400000000004, "Time_End": 2601.8, "Text": " Let me get to the questions real quick, and then I'll answer the questions afterwards."}, {"Time_Start": 2602.5, "Time_End": 2605.48, "Text": " Here's some examples that I just thought up in my reading and preparation."}, {"Time_Start": 2606.48, "Time_End": 2607.92, "Text": " You know, here's Nimboy."}, {"Time_Start": 2608.0, "Time_End": 2611.94, "Text": " This guy buys a piece of software that's protected by what everyone here probably knows is a dongle."}, {"Time_Start": 2612.4, "Time_End": 2617.0400000000004, "Text": " You buy a piece of software, you can open up certain aspects of the software, and it malfunctions."}, {"Time_Start": 2617.0400000000004, "Time_End": 2619.2400000000002, "Text": " And Nimboy cannot get to."}, {"Time_Start": 2619.26, "Time_End": 2623.6200000000003, "Text": " the portion of the software that he purchased because it's obsolete or malfunctions or the date"}, {"Time_Start": 2623.6200000000003, "Time_End": 2624.9, "Text": " stamp ran or for whatever reason."}, {"Time_Start": 2626.4, "Time_End": 2628.32, "Text": " He tries to contact the company."}, {"Time_Start": 2628.42, "Time_End": 2629.2400000000002, "Text": " He tries to find out."}, {"Time_Start": 2629.32, "Time_End": 2630.28, "Text": " He thinks they went out of business."}, {"Time_Start": 2630.7200000000003, "Time_End": 2636.28, "Text": " Can Nimboy circumvent the access to get to the portion of the program that he paid for?"}, {"Time_Start": 2638.6000000000004, "Time_End": 2640.2000000000003, "Text": " I see yes faces."}, {"Time_Start": 2640.36, "Time_End": 2641.8, "Text": " I see nose shaking back there."}, {"Time_Start": 2641.9, "Time_End": 2642.7200000000003, "Text": " I see all kinds of stuff."}, {"Time_Start": 2644.84, "Time_End": 2645.2400000000002, "Text": " Yes."}, {"Time_Start": 2645.32, "Time_End": 2646.5400000000004, "Text": " Who is it that said that back there?"}, {"Time_Start": 2647.2400000000002, "Time_End": 2648.4, "Text": " The Library of Congress."}, {"Time_Start": 2648.5200000000004, "Time_End": 2648.7200000000003, "Text": " Okay."}, {"Time_Start": 2648.7200000000003, "Time_End": 2649.2400000000002, "Text": " You're frightening."}, {"Time_Start": 2649.26, "Time_End": 2650.36, "Text": " guy because you know too much."}, {"Time_Start": 2653.0, "Time_End": 2660.2200000000003, "Text": " There was a provision in the DMCA that allowed the librarian of Congress to make"}, {"Time_Start": 2660.2200000000003, "Time_End": 2664.26, "Text": " exceptions as time went on because Congress anticipated the fact that we're going to have problems"}, {"Time_Start": 2664.26, "Time_End": 2664.8, "Text": " like this."}, {"Time_Start": 2665.42, "Time_End": 2668.92, "Text": " Out of all the things you could possibly come up with, the librarian of Congress came up"}, {"Time_Start": 2668.92, "Time_End": 2672.9, "Text": " with two, where you can access or circumvent."}, {"Time_Start": 2674.0, "Time_End": 2674.9, "Text": " This is one of them."}, {"Time_Start": 2675.46, "Time_End": 2679.0, "Text": " If you have a piece of software that you paid for and you copy, and you, and you copy,"}, {"Time_Start": 2679.26, "Time_End": 2684.3, "Text": " you paid for the copyright to use an access, and it malfunctions because something goes wrong,"}, {"Time_Start": 2684.3, "Time_End": 2689.7200000000003, "Text": " you can circumvent the access in order to get to the portions that you wanted or you paid the right"}, {"Time_Start": 2689.7200000000003, "Time_End": 2691.0600000000004, "Text": " to copyright for."}, {"Time_Start": 2691.0600000000004, "Time_End": 2698.4, "Text": " Now, in order to the guy that knows too much back there, let's say that the entire CD-ROM that you"}, {"Time_Start": 2698.4, "Time_End": 2705.1600000000003, "Text": " buy with 10 software suites on it has to be circumvented in order to get the piece that you bought."}, {"Time_Start": 2705.1600000000003, "Time_End": 2706.32, "Text": " Do you violate the DMCA there?"}, {"Time_Start": 2709.26, "Time_End": 2711.1000000000004, "Text": " I don't know."}, {"Time_Start": 2711.9, "Time_End": 2716.1400000000003, "Text": " I really don't know because most of the time software don't go's has five or six volumes,"}, {"Time_Start": 2716.6400000000003, "Time_End": 2718.1400000000003, "Text": " five or six different programs on it."}, {"Time_Start": 2718.6400000000003, "Time_End": 2720.5, "Text": " Well, I don't know."}, {"Time_Start": 2720.5600000000004, "Time_End": 2724.0600000000004, "Text": " I don't know what the answer to that is, but if it's only one, you do have the right to circumvent it."}, {"Time_Start": 2728.38, "Time_End": 2733.28, "Text": " The question is, there's a question here as to whether you could sell that solution or share that solution."}, {"Time_Start": 2736.2000000000003, "Time_End": 2736.5600000000004, "Text": " Exactly."}, {"Time_Start": 2737.1200000000003, "Time_End": 2738.7000000000003, "Text": " Here's my best piece of it."}, {"Time_Start": 2739.26, "Time_End": 2745.26, "Text": " I represent certain people that don't do very nice things in our society, that do"}, {"Time_Start": 2745.26, "Time_End": 2747.38, "Text": " distasteful things in our society."}, {"Time_Start": 2747.38, "Time_End": 2751.34, "Text": " And the best piece of advice I can give anybody, if you're facing any problem or you're doing"}, {"Time_Start": 2751.34, "Time_End": 2754.5800000000004, "Text": " something, is the smell test."}, {"Time_Start": 2754.5800000000004, "Time_End": 2758.3, "Text": " If it doesn't smell right, probably ain't right."}, {"Time_Start": 2758.3, "Time_End": 2764.34, "Text": " If you get an idea that what you're doing may not quite pass that smell test, don't do it."}, {"Time_Start": 2764.34, "Time_End": 2767.5, "Text": " Now that being said, that being said."}, {"Time_Start": 2767.5, "Time_End": 2768.5, "Text": " All right."}, {"Time_Start": 2768.5, "Time_End": 2770.7, "Text": " Here's the problem that I'm really concerned about."}, {"Time_Start": 2771.32, "Time_End": 2776.98, "Text": " And, you know, maybe there's some ingenious person here that will take this sick mind of mind and implement this."}, {"Time_Start": 2777.88, "Time_End": 2784.38, "Text": " But a software company, a software company makes a piece of software, and it's a database for a business."}, {"Time_Start": 2785.1, "Time_End": 2789.56, "Text": " And they market it and people buy it and they love it and they're using it and they're putting all their data in there,"}, {"Time_Start": 2789.62, "Time_End": 2791.06, "Text": " a contact manager, whatever it may be."}, {"Time_Start": 2791.78, "Time_End": 2798.04, "Text": " Then that company, without knowing the user, puts a little piece of code in there that changes the access."}, {"Time_Start": 2798.5, "Time_End": 2800.5, "Text": " method a couple years down the road."}, {"Time_Start": 2800.5, "Time_End": 2801.5, "Text": " Okay?"}, {"Time_Start": 2801.5, "Time_End": 2804.5, "Text": " They rewrite the access method."}, {"Time_Start": 2804.5, "Time_End": 2807.5, "Text": " Two years down the road, somebody says, I want access to my data."}, {"Time_Start": 2807.5, "Time_End": 2808.5, "Text": " They turn their computer on."}, {"Time_Start": 2808.5, "Time_End": 2810.5, "Text": " It gives them a message saying access denied."}, {"Time_Start": 2810.5, "Time_End": 2814.5, "Text": " They call the company, the company says, oh yeah, you need version 2.0."}, {"Time_Start": 2814.5, "Time_End": 2817.5, "Text": " Because now you don't have access to your data."}, {"Time_Start": 2817.5, "Time_End": 2824.5, "Text": " Can that user circumvent the protection to that data file to get their own data?"}, {"Time_Start": 2824.5, "Time_End": 2827.5, "Text": " I hear a yes is?"}, {"Time_Start": 2827.5, "Time_End": 2828.5, "Text": " I hear a yes?"}, {"Time_Start": 2828.5, "Time_End": 2829.5, "Text": " Why?"}, {"Time_Start": 2829.5, "Time_End": 2830.5, "Text": " Where's the yes?"}, {"Time_Start": 2830.5, "Time_End": 2831.5, "Text": " Put your hand up."}, {"Time_Start": 2831.5, "Time_End": 2832.5, "Text": " Yes."}, {"Time_Start": 2832.5, "Time_End": 2833.5, "Text": " Okay, guy in the blue back there."}, {"Time_Start": 2833.5, "Time_End": 2834.5, "Text": " Why?"}, {"Time_Start": 2834.5, "Time_End": 2837.5, "Text": " Isn't the format proprietary like real networks?"}, {"Time_Start": 2837.5, "Time_End": 2841.5, "Text": " Isn't the format proprietary like real networks?"}, {"Time_Start": 2841.5, "Time_End": 2845.5, "Text": " That data is in the format of the database structure"}, {"Time_Start": 2845.5, "Time_End": 2847.5, "Text": " that they use to write the program."}, {"Time_Start": 2847.5, "Time_End": 2848.5, "Text": " Is that enough?"}, {"Time_Start": 2848.5, "Time_End": 2852.5, "Text": " The data itself is yours in many things."}, {"Time_Start": 2852.5, "Time_End": 2855.5, "Text": " Isn't basically the data contained on a DVD-ROM yours?"}, {"Time_Start": 2855.5, "Time_End": 2856.5, "Text": " Why?"}, {"Time_Start": 2856.5, "Time_End": 2858.5, "Text": " Why?"}, {"Time_Start": 2858.5, "Time_End": 2860.5, "Text": " Because it belongs to the copyright owner?"}, {"Time_Start": 2860.5, "Time_End": 2863.5, "Text": " You're just licensed."}, {"Time_Start": 2863.5, "Time_End": 2868.5, "Text": " See, you'll have 10 answers and 10 responses for each answer."}, {"Time_Start": 2868.5, "Time_End": 2880.5, "Text": " Right."}, {"Time_Start": 2880.5, "Time_End": 2883.5, "Text": " But remember from before, access is enough."}, {"Time_Start": 2883.5, "Time_End": 2885.5, "Text": " Access is enough."}, {"Time_Start": 2885.5, "Time_End": 2886.5, "Text": " Remember where the court said,"}, {"Time_Start": 2886.5, "Time_End": 2891.04, "Text": " even if you copied it with a digital camcorder, the act of accessing violates."}, {"Time_Start": 2891.8, "Time_End": 2892.96, "Text": " Have you violated if you do that?"}, {"Time_Start": 2893.68, "Time_End": 2896.8, "Text": " If you do this to the company's software to get your own data, have you violated?"}, {"Time_Start": 2896.9, "Time_End": 2901.94, "Text": " Because you've accessed a technology, you've, you've circumvented a technological measure giving you access."}, {"Time_Start": 2902.7, "Time_End": 2904.34, "Text": " And the thing is, what's that?"}, {"Time_Start": 2904.54, "Time_End": 2905.14, "Text": " I don't know."}, {"Time_Start": 2905.2, "Time_End": 2906.26, "Text": " I mean, there's a lot of answers out here."}, {"Time_Start": 2906.32, "Time_End": 2908.34, "Text": " People have a lot of ideas, but there's no opinion on it yet."}, {"Time_Start": 2909.0, "Time_End": 2909.8, "Text": " There's no opinion."}, {"Time_Start": 2913.1, "Time_End": 2916.28, "Text": " Is the company required up front to tell you they're going to be changing it?"}, {"Time_Start": 2916.5, "Time_End": 2918.36, "Text": " Okay, why?"}, {"Time_Start": 2923.04, "Time_End": 2925.82, "Text": " See, y'all are going to have a lot of stuff to talk about out here."}, {"Time_Start": 2925.94, "Time_End": 2927.7, "Text": " See, it wasn't so boring after all, was it?"}, {"Time_Start": 2928.78, "Time_End": 2931.24, "Text": " Let me finish up with something real quick, and then I want to take questions."}, {"Time_Start": 2931.58, "Time_End": 2934.9, "Text": " And I knew I'd run long, and I apologize to the next speaker, but fuck him."}, {"Time_Start": 2939.46, "Time_End": 2944.14, "Text": " Actually, the next speaker is a guy named Steven's Hugh, and I recommend everybody to stay here."}, {"Time_Start": 2944.24, "Time_End": 2945.44, "Text": " He is sort of a hero of mine."}, {"Time_Start": 2945.52, "Time_End": 2946.4, "Text": " He's a safe web guy."}, {"Time_Start": 2946.5, "Time_End": 2949.2, "Text": " the guy is a okay, you know, stick around for it."}, {"Time_Start": 2949.22, "Time_End": 2949.62, "Text": " He's very good."}, {"Time_Start": 2950.58, "Time_End": 2954.76, "Text": " I represented a, when I was putting together in my presentation,"}, {"Time_Start": 2954.92, "Time_End": 2957.26, "Text": " I was looking for stuff to add to try to make this non-boring,"}, {"Time_Start": 2957.36, "Time_End": 2958.52, "Text": " to try to give you something."}, {"Time_Start": 2959.28, "Time_End": 2960.82, "Text": " And I ran across a cartoon."}, {"Time_Start": 2961.92, "Time_End": 2965.32, "Text": " I represented a kid, received some national exposure who was,"}, {"Time_Start": 2965.82, "Time_End": 2967.72, "Text": " and it's a tragic case, and I don't mean to make fun of it,"}, {"Time_Start": 2967.74, "Time_End": 2970.04, "Text": " but in my business, you've got to kind of laugh at some of things that happened."}, {"Time_Start": 2970.74, "Time_End": 2972.62, "Text": " The kid was throwing rocks off an overpass,"}, {"Time_Start": 2973.12, "Time_End": 2976.48, "Text": " and the rock fell through a windshield and killed a teacher."}, {"Time_Start": 2976.5, "Time_End": 2978.5, "Text": " from Alabama. It was really bad."}, {"Time_Start": 2978.56, "Time_End": 2980.74, "Text": " There were teenagers. It was a bad"}, {"Time_Start": 2980.74, "Time_End": 2982.08, "Text": " case. But"}, {"Time_Start": 2982.08, "Time_End": 2984.4, "Text": " I was looking through trying to put something,"}, {"Time_Start": 2984.5, "Time_End": 2986.24, "Text": " and I saw a cartoon that, to me,"}, {"Time_Start": 2986.6, "Time_End": 2988.24, "Text": " I can laugh at it, even though it's very tragic."}, {"Time_Start": 2988.7, "Time_End": 2990.14, "Text": " And you might be able to laugh at it."}, {"Time_Start": 2990.9, "Time_End": 2992.7, "Text": " Maybe not, and maybe everybody think I'm a sick"}, {"Time_Start": 2992.7, "Time_End": 2993.6, "Text": " SOB, but"}, {"Time_Start": 2993.6, "Time_End": 2996.48, "Text": " this is sort of hackers"}, {"Time_Start": 2996.48, "Time_End": 2998.58, "Text": " throwing rocks off the information highway."}, {"Time_Start": 3000.28, "Time_End": 3002.08, "Text": " And what they do to the information highway."}, {"Time_Start": 3002.34, "Time_End": 3003.82, "Text": " I sort of see it a little bit different."}, {"Time_Start": 3004.46, "Time_End": 3006.06, "Text": " I read a little line preparing."}, {"Time_Start": 3006.5, "Time_End": 3011.26, "Text": " And it says that computer hackers are to free speech today, what pornographers were"}, {"Time_Start": 3011.26, "Time_End": 3014.38, "Text": " to be free speech 20 years ago."}, {"Time_Start": 3014.38, "Time_End": 3017.12, "Text": " And we see it in the opinions of the court."}, {"Time_Start": 3017.12, "Time_End": 3021.7, "Text": " We see that these people who the court is having dealing with on the First Amendment are the"}, {"Time_Start": 3021.7, "Time_End": 3025.6, "Text": " same people they had dealing with the Hustler magazine case."}, {"Time_Start": 3025.6, "Time_End": 3033.6, "Text": " And the same people that just do certain things to learn, to share information, to have fun."}, {"Time_Start": 3033.6, "Time_End": 3036.48, "Text": " And when you have a law like the DMCA, read"}, {"Time_Start": 3036.5, "Time_End": 3040.34, "Text": " it, understand it, because it's the kind of thing that can really get you in trouble."}, {"Time_Start": 3040.98, "Time_End": 3043.52, "Text": " And with that, I'm going to end and I'll take questions."}, {"Time_Start": 3043.76, "Time_End": 3047.32, "Text": " And I think I should probably end and maybe take questions outside because I don't want to"}, {"Time_Start": 3047.32, "Time_End": 3048.32, "Text": " piss off the next guy."}, {"Time_Start": 3049.5, "Time_End": 3050.98, "Text": " So, thank you."}]}