{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hello, my name is Kuba Gretzky. I wanted today to show you the way to fish for two-factor"
    },
    {
      "Time_Start": 15.44,
      "Time_End": 23.6,
      "Text": " authentication tokens using the tool that I made one year ago. So basically who I am"
    },
    {
      "Time_Start": 23.6,
      "Time_End": 28.560000000000002,
      "Text": " briefly, I'm an independent software developer for the last 10 years, ex-MMO hacker, and"
    },
    {
      "Time_Start": 28.560000000000002,
      "Time_End": 35.28,
      "Text": " currently I'm working on the development of custom post-exploitation agents with focus"
    },
    {
      "Time_Start": 35.28,
      "Time_End": 44.68000000000001,
      "Text": " on advanced AV evasion. So the question, how much is the fish, Scooter once asked. I don't"
    },
    {
      "Time_Start": 44.68000000000001,
      "Time_End": 50.040000000000006,
      "Text": " know how much is the fish because it doesn't make any sense, but basically what fishing"
    },
    {
      "Time_Start": 50.040000000000006,
      "Time_End": 55.44,
      "Text": " right now looks like is based on creating templates. So you create a template of the"
    },
    {
      "Time_Start": 55.44,
      "Time_End": 62.519999999999996,
      "Text": " known web service that asks you to enter your credentials and then the credentials"
    },
    {
      "Time_Start": 62.519999999999996,
      "Time_End": 67.88,
      "Text": " are captured and this is basically it. And if two-factor authentication is enabled on"
    },
    {
      "Time_Start": 67.88,
      "Time_End": 75.84,
      "Text": " the account, of course, the credentials are basically useless because you can't do much"
    },
    {
      "Time_Start": 75.84,
      "Time_End": 83.2,
      "Text": " with it. So what's the next generation of fishing? Next generation of fishing, why use"
    },
    {
      "Time_Start": 83.2,
      "Time_End": 89.36,
      "Text": " templates anyway? You can just set up your server that acts as a relay proxy between"
    },
    {
      "Time_Start": 89.36,
      "Time_End": 96.12,
      "Text": " the victim and the web service like Google, for example, and the whole website will be"
    },
    {
      "Time_Start": 96.12,
      "Time_End": 102.68,
      "Text": " just retrieved and shown to the victim dynamically. You don't need to create custom templates"
    },
    {
      "Time_Start": 102.68,
      "Time_End": 108.68,
      "Text": " and everything. And additionally to that, all the requests, HTTP requests are intercepted"
    },
    {
      "Time_Start": 108.68,
      "Time_End": 114.28,
      "Text": " on the fly. So we can read credentials, cookies, you can manipulate this data and also you"
    },
    {
      "Time_Start": 114.28,
      "Time_End": 123.44000000000001,
      "Text": " can set up your own domain with custom SSL TLS certificate. So this will be a live demo,"
    },
    {
      "Time_Start": 123.44000000000001,
      "Time_End": 138.52,
      "Text": " so everything can go wrong right now. Okay. So I will show you how to hack my own account."
    },
    {
      "Time_Start": 138.52,
      "Time_End": 146.52,
      "Text": " So this is basically the link that the victim will receive. So our victim will be called"
    },
    {
      "Time_Start": 146.52,
      "Time_End": 154.36,
      "Text": " Janusz. So Janusz is receiving a link. And please, Janusz, see this document and get"
    },
    {
      "Time_Start": 154.36,
      "Time_End": 162.9,
      "Text": " back to me. So this is the victim's browser. Janusz is entering the link. Let me just only"
    },
    {
      "Time_Start": 162.9,
      "Time_End": 171.58,
      "Text": " remove all the cookies just in case. So Janusz is receiving the link. And this is what he"
    },
    {
      "Time_Start": 171.58,
      "Time_End": 180.70000000000002,
      "Text": " sees. This is the real Google website. But instead you can see the URL is the attacker's"
    },
    {
      "Time_Start": 180.70000000000002,
      "Time_End": 189.70000000000002,
      "Text": " domain. So what Janusz does, he sees, okay, I need to log in. I need to log in in order"
    },
    {
      "Time_Start": 189.70000000000002,
      "Time_End": 198.02,
      "Text": " to see this document. So I will do that. Now it asks for the password. So Janusz enters"
    },
    {
      "Time_Start": 198.02,
      "Time_End": 221.06,
      "Text": " his password. Okay. I forgot the password. Okay. And now let me just take my phone. Because"
    },
    {
      "Time_Start": 221.06,
      "Time_End": 230.54,
      "Text": " this account is set up with two-factor authentication. And this is now what happens. I got the push"
    },
    {
      "Time_Start": 230.54,
      "Time_End": 237.26,
      "Text": " notification on my Android phone. I don't know if you can see that. It says that someone"
    },
    {
      "Time_Start": 237.26,
      "Time_End": 242.38,
      "Text": " from Linux machine and the unrecognized location tries to log into my account. And of course"
    },
    {
      "Time_Start": 242.38,
      "Time_End": 254.29999999999998,
      "Text": " this is Janusz. So Janusz presses yes. I just press yes. And now Janusz is seeing the"
    },
    {
      "Time_Start": 254.29999999999998,
      "Time_End": 260.18,
      "Text": " document that he was supposed to see. So this is the end on the victim side. And now what"
    },
    {
      "Time_Start": 260.18,
      "Time_End": 274.54,
      "Text": " does the attacker do? So the attacker logs into the Evil Jinx server via SSH. Well, whatever"
    },
    {
      "Time_Start": 274.54,
      "Time_End": 285.9,
      "Text": " you can log in with. And they try to see what kind of credentials were captured. So now"
    },
    {
      "Time_Start": 286.02000000000004,
      "Time_End": 297.70000000000005,
      "Text": " we see we found two creds and one token. So if we look into here, into the logs directory,"
    },
    {
      "Time_Start": 297.70000000000005,
      "Time_End": 304.90000000000003,
      "Text": " you can see there is the email of Janusz at gmail.com. The rest is actually funny because"
    },
    {
      "Time_Start": 304.90000000000003,
      "Time_End": 309.86,
      "Text": " some Chinese bots are trying to brute force Google accounts using my fake domain. I don't"
    },
    {
      "Time_Start": 309.86,
      "Time_End": 319.42,
      "Text": " know why it just came up this morning. Yeah. Well, but no tokens. Yeah. Okay. So now we"
    },
    {
      "Time_Start": 319.42,
      "Time_End": 327.78000000000003,
      "Text": " see we have two files. One is with the creds. So you can see the login and the password."
    },
    {
      "Time_Start": 327.78000000000003,
      "Time_End": 333.5,
      "Text": " You can later use it to log in yourself if you want. I'll probably change it or not."
    },
    {
      "Time_Start": 333.5,
      "Time_End": 342.18,
      "Text": " And then you see the better part, which is the tokens. So these are the cookies that"
    },
    {
      "Time_Start": 342.18,
      "Time_End": 349.86,
      "Text": " Google saves in the browser to make sure that the client is authenticated. So this is basically"
    },
    {
      "Time_Start": 349.86,
      "Time_End": 357.62,
      "Text": " what happens after the two-factor authentication is a success. So attacker copies this authentication"
    },
    {
      "Time_Start": 357.66,
      "Time_End": 366.7,
      "Text": " tokens. Then we're going to move to the attacker browser. I will clear the cookies just to make"
    },
    {
      "Time_Start": 366.7,
      "Time_End": 374.94,
      "Text": " sure that everything is clean. So first I'll show you what happens when I open Gmail. Okay."
    },
    {
      "Time_Start": 374.94,
      "Time_End": 382.26,
      "Text": " So Gmail just asked me to log in. So I'm not logged in as the attacker. So what I will do,"
    },
    {
      "Time_Start": 382.26,
      "Time_End": 391.14,
      "Text": " I'll clear the cookies again. And I will use the Chrome extension to import the cookies that I"
    },
    {
      "Time_Start": 391.14,
      "Time_End": 404.86,
      "Text": " just captured from Janusz. Okay. And now we're visiting Gmail again. And boom, we are Janusz."
    },
    {
      "Time_Start": 405.1,
      "Time_End": 417.54,
      "Text": " Bypassing fully two-factor authentication. So this is how it works. Why cookies? Well,"
    },
    {
      "Time_Start": 417.54,
      "Time_End": 423.58000000000004,
      "Text": " I just said because the browser needs to verify itself with the web server. And two-factor"
    },
    {
      "Time_Start": 423.58000000000004,
      "Time_End": 429.78000000000003,
      "Text": " authentication method really doesn't matter because you can use SMS, you can use, I don't know,"
    },
    {
      "Time_Start": 429.82000000000005,
      "Time_End": 435.38000000000005,
      "Text": " many different kinds. I think only Yubikeys protects you against this kind of attack"
    },
    {
      "Time_Start": 435.38000000000005,
      "Time_End": 442.66,
      "Text": " because Yubikeys also checks the URL in the address bar that the credentials are paired with"
    },
    {
      "Time_Start": 442.66,
      "Time_End": 452.78000000000003,
      "Text": " and won't allow you to enter the credentials on the other website. So what can websites do to"
    },
    {
      "Time_Start": 452.90000000000003,
      "Time_End": 462.26000000000005,
      "Text": " protect itself against it? So last year, lead security executive from Google contacted me."
    },
    {
      "Time_Start": 462.26000000000005,
      "Time_End": 471.3,
      "Text": " How can they fix that? And apparently they fixed it somehow. And I didn't check. So last month,"
    },
    {
      "Time_Start": 471.3,
      "Time_End": 476.78000000000003,
      "Text": " I checked it. And this is what you can see. This is basically what I found in one of their"
    },
    {
      "Time_Start": 476.78000000000003,
      "Time_End": 482.22,
      "Text": " JavaScript files when it didn't work. So basically what they figured out to do is"
    },
    {
      "Time_Start": 482.22,
      "Time_End": 489.42,
      "Text": " they do regular expression on the URL tab just to see if it's not a phish domain currently. So"
    },
    {
      "Time_Start": 489.42,
      "Time_End": 495.74,
      "Text": " this was actually the way to bypass that was to just modify this regular expression on the fly"
    },
    {
      "Time_Start": 495.74,
      "Time_End": 502.58000000000004,
      "Text": " while being in the proxy and modifying all the data. So in order to better protect against it,"
    },
    {
      "Time_Start": 502.82,
      "Time_End": 513.02,
      "Text": " I would advise doing obfuscation. Of course, it's not like fully the best solution, but it will"
    },
    {
      "Time_Start": 513.02,
      "Time_End": 520.38,
      "Text": " deter some attackers and it will make the whole like replacement much, much, much harder."
    },
    {
      "Time_Start": 520.5799999999999,
      "Time_End": 521.54,
      "Text": " 30 seconds."
    },
    {
      "Time_Start": 521.86,
      "Time_End": 522.98,
      "Text": " Yeah, I'm done."
    },
    {
      "Time_Start": 523.06,
      "Time_End": 524.54,
      "Text": " Okay, great. Thank you."
    }
  ]
}