{"segments": [{"Time_Start": 0.0, "Time_End": 3.0, "Text": " Welcome to the annual Def-Con Convention."}, {"Time_Start": 3.0, "Time_End": 9.0, "Text": " This meeting was held an exciting Las Vegas Nevada from July 9 for the 11th, 1999."}, {"Time_Start": 9.0, "Time_End": 12.0, "Text": " This is radio tape number 18."}, {"Time_Start": 12.0, "Time_End": 15.0, "Text": " Introduction to TCP IP."}, {"Time_Start": 19.0, "Time_End": 24.0, "Text": " Unfortunately, I wasn't able to make copies of these slides."}, {"Time_Start": 24.0, "Time_End": 29.0, "Text": " This is to be kind of a slide-intensive presentation, so if anybody does want to copy the slides,"}, {"Time_Start": 29.0, "Time_End": 31.0, "Text": " Just grab me any time during the con."}, {"Time_Start": 31.0, "Time_End": 33.0, "Text": " I'll throw them on a floppy for you."}, {"Time_Start": 33.0, "Time_End": 36.0, "Text": " Or send me an email and I'll get them to you."}, {"Time_Start": 40.0, "Time_End": 43.0, "Text": " And for those of you who don't know,"}, {"Time_Start": 43.0, "Time_End": 47.0, "Text": " I will be doing a brief introduction to TCPIP this morning."}, {"Time_Start": 51.0, "Time_End": 55.0, "Text": " What this lecture is going to cover, this lecture is going to be a low-level,"}, {"Time_Start": 55.0, "Time_End": 58.0, "Text": " basically it's a low-level overview of TCPIP."}, {"Time_Start": 58.0, "Time_End": 59.0, "Text": " This lecture is going to cover."}, {"Time_Start": 59.0, "Time_End": 64.0, "Text": " is geared towards novices, this obviously is the new B-track, so it's not going to be a real high-tech presentation."}, {"Time_Start": 64.0, "Time_End": 72.0, "Text": " If you do want a high overview of TCPIP, this is a book to get."}, {"Time_Start": 72.0, "Time_End": 78.0, "Text": " TCIP Illustrated, W. Richard Stevens, buy this book, read it from cover to cover."}, {"Time_Start": 78.0, "Time_End": 80.0, "Text": " After read this one, there's two more volumes after this."}, {"Time_Start": 80.0, "Time_End": 82.0, "Text": " Excellent book."}, {"Time_Start": 82.0, "Time_End": 88.0, "Text": " First off, I want to cover this."}, {"Time_Start": 88.0, "Time_End": 95.0, "Text": " First off, I want to cover us a little bit of the history of TCPIP where it all began."}, {"Time_Start": 95.0, "Time_End": 103.0, "Text": " Essentially, TCPIP started in 1969 when the Advanced Research Project Agency,"}, {"Time_Start": 103.0, "Time_End": 109.0, "Text": " also known as ARPA, decided to fund some research and development to making basically not really a global network,"}, {"Time_Start": 109.0, "Time_End": 115.0, "Text": " but they just wanted to start putting all the resources together and make a network that they could put all these resources together"}, {"Time_Start": 115.0, "Time_End": 117.0, "Text": " and network with the computers together."}, {"Time_Start": 117.0, "Time_End": 121.0, "Text": " and essentially make all their computers work a little better together."}, {"Time_Start": 121.0, "Time_End": 126.0, "Text": " Arpa's goal was, and originally, the Internet, as we know what to say, that was not their original goal."}, {"Time_Start": 126.0, "Time_End": 128.0, "Text": " It was more of a research project."}, {"Time_Start": 128.0, "Time_End": 133.0, "Text": " Our purpose goal was to study techniques for providing robust, vendor-independent, data communications."}, {"Time_Start": 133.0, "Time_End": 137.0, "Text": " So basically, they could put all these different machines together, regardless of operating system,"}, {"Time_Start": 137.0, "Time_End": 141.0, "Text": " regardless of vendor, and have these machines be able to talk to each other on a network."}, {"Time_Start": 147.0, "Time_End": 152.0, "Text": " ARPANET was so successful that many organizations attached to it began to use it on a daily basis."}, {"Time_Start": 152.0, "Time_End": 160.0, "Text": " Obviously, it was proved to be a very important resource people are using on a daily basis, so it did grow rather rapidly."}, {"Time_Start": 160.0, "Time_End": 166.0, "Text": " In 1975, ARPANET, converted from the experimental network to an operational network,"}, {"Time_Start": 166.0, "Time_End": 170.0, "Text": " when the Defense Communication Agency, also known as DCA, took control of it."}, {"Time_Start": 170.0, "Time_End": 173.0, "Text": " They took full control of it and released it from ARPANET."}, {"Time_Start": 177.0, "Time_End": 182.0, "Text": " In 1983, a couple different things happened with TCPIP."}, {"Time_Start": 182.0, "Time_End": 185.0, "Text": " The TCPIP protocols were developed as military standards."}, {"Time_Start": 185.0, "Time_End": 188.0, "Text": " They were then enforced as military standards."}, {"Time_Start": 188.0, "Time_End": 194.0, "Text": " All hosts on the network were then required to build a communication suite to talk to each other."}, {"Time_Start": 194.0, "Time_End": 201.0, "Text": " Also in 1983, DARPA funded the implementation of TCPIP in Berkeley or BSD Unix."}, {"Time_Start": 201.0, "Time_End": 206.0, "Text": " And also, in 1983, the term that we know say as Internet came in a common use."}, {"Time_Start": 206.0, "Time_End": 225.0, "Text": " Also in 1983, ARPANS split into both the mill net, and also a newer, smaller ARPANS, was controlled by two bodies at this time."}, {"Time_Start": 225.0, "Time_End": 232.0, "Text": " In 1985, the National Science Foundation, or the NSF, created NSF net and connects it to the internet."}, {"Time_Start": 232.0, "Time_End": 235.0, "Text": " In 1987, NSF created a faster new backbone."}, {"Time_Start": 235.0, "Time_End": 242.0, "Text": " new backbone and a three-tier topology that includes both backbone, regional networks,"}, {"Time_Start": 242.0, "Time_End": 243.44, "Text": " and local networks."}, {"Time_Start": 243.44, "Time_End": 248.06, "Text": " So basically, NSFNet was the whole backbone for the entire internet at this time."}, {"Time_Start": 252.06, "Time_End": 255.36, "Text": " And then in 1990, Aluponet passed out of existence."}, {"Time_Start": 255.36, "Time_End": 258.78, "Text": " This is probably a lot more memorable for a lot of people."}, {"Time_Start": 258.78, "Time_End": 264.0, "Text": " In 1995, NSFNet seizes its role as a primary backbone for the internet."}, {"Time_Start": 264.0, "Time_End": 264.98, "Text": " Basically, that's when it can."}, {"Time_Start": 265.0, "Time_End": 268.0, "Text": " came to be known as what we know as today is the internet in 1995."}, {"Time_Start": 272.0, "Time_End": 274.0, "Text": " So basically, this all can be wrapped up in a nutshell."}, {"Time_Start": 275.0, "Time_End": 279.0, "Text": " What has come to be known is the internet was originally designed and experimented,"}, {"Time_Start": 279.0, "Time_End": 282.0, "Text": " or it was originally designed as an experimental network."}, {"Time_Start": 282.0, "Time_End": 287.0, "Text": " They really had no intentions of it growing into the network that has come to be known as today."}, {"Time_Start": 288.0, "Time_End": 292.0, "Text": " The internet has grown much larger than it was originally intended for, obviously."}, {"Time_Start": 292.0, "Time_End": 294.94, "Text": " And also the original networks and agency involved in the"}, {"Time_Start": 295.0, "Time_End": 299.0, "Text": " the creation of the internet are no longer involved in that process today."}, {"Time_Start": 299.0, "Time_End": 302.0, "Text": " They no longer play in a role in that."}, {"Time_Start": 302.0, "Time_End": 310.0, "Text": " A couple of the myths of TCPIB. Contrated him when you think."}, {"Time_Start": 310.0, "Time_End": 315.0, "Text": " Al Gore did not create the internet. He did not invent the internet."}, {"Time_Start": 315.0, "Time_End": 320.0, "Text": " When the internet was funded, Al Gore was only 21 years old. He was a college student."}, {"Time_Start": 320.0, "Time_End": 323.0, "Text": " I don't think he had anything to do with it."}, {"Time_Start": 323.0, "Time_End": 330.0, "Text": " Okay, now we're going to go into some of the definitions we'll be using."}, {"Time_Start": 330.0, "Time_End": 332.0, "Text": " TCPIP defined."}, {"Time_Start": 332.0, "Time_End": 336.0, "Text": " It's the transmission control protocol, internet protocol."}, {"Time_Start": 336.0, "Time_End": 343.0, "Text": " Essentially, this is the suite of networking protocols that have been used to construct the global internet."}, {"Time_Start": 343.0, "Time_End": 346.0, "Text": " I also referred to as the DOD or Alpernet protocol suite."}, {"Time_Start": 346.0, "Time_End": 349.0, "Text": " You all here are referred to these days."}, {"Time_Start": 349.0, "Time_End": 352.98, "Text": " Sometimes you still may, because they were involved in the early development of the"}, {"Time_Start": 353.0, "Time_End": 354.0, "Text": " the suite."}, {"Time_Start": 354.0, "Time_End": 365.0, "Text": " So TCP defined in nutshell is a series of protocols that allows computers"}, {"Time_Start": 365.0, "Time_End": 370.0, "Text": " to communicate on a network, regardless of operating system, regardless of vendor."}, {"Time_Start": 370.0, "Time_End": 372.0, "Text": " It doesn't matter what operating system you're running."}, {"Time_Start": 372.0, "Time_End": 374.0, "Text": " It doesn't matter what type of computer you're running."}, {"Time_Start": 374.0, "Time_End": 380.0, "Text": " As long as you're running a TCPIP stack, you can still communicate with other computers on that network."}, {"Time_Start": 383.0, "Time_End": 388.0, "Text": " Okay, I really hate the OSI model."}, {"Time_Start": 388.0, "Time_End": 390.0, "Text": " We're not going to go into that at all with this talk."}, {"Time_Start": 390.0, "Time_End": 393.0, "Text": " The thing we are going to talk about is the four layers of TCIP."}, {"Time_Start": 393.0, "Time_End": 394.0, "Text": " This is what's really important."}, {"Time_Start": 394.0, "Time_End": 399.0, "Text": " I think when it comes to TCPIP, the OSI model is not really that important."}, {"Time_Start": 399.0, "Time_End": 402.0, "Text": " There's a lot of layers that are not even used in TCPIP."}, {"Time_Start": 402.0, "Time_End": 406.0, "Text": " So let's talk about the four layers of TCPIP."}, {"Time_Start": 406.0, "Time_End": 410.0, "Text": " Starting from the bottom, we have the link layer, which is the device driver and interface card."}, {"Time_Start": 410.0, "Time_End": 412.0, "Text": " If you're now what interface card, it's as simple as that."}, {"Time_Start": 412.0, "Time_End": 414.0, "Text": " It's as simple as that."}, {"Time_Start": 414.0, "Time_End": 417.0, "Text": " Moving on up the stack, we have a network layer,"}, {"Time_Start": 417.0, "Time_End": 423.0, "Text": " which is typically comprised of IP, ICMP, and IGMP."}, {"Time_Start": 423.0, "Time_End": 428.0, "Text": " Moving on up the stack, we have the transport layer,"}, {"Time_Start": 428.0, "Time_End": 432.0, "Text": " which consists of either TCP or UDP,"}, {"Time_Start": 432.0, "Time_End": 435.0, "Text": " and at the very top of this stack is our application level."}, {"Time_Start": 435.0, "Time_End": 438.0, "Text": " These are the actual applications that the users interact with,"}, {"Time_Start": 438.0, "Time_End": 441.0, "Text": " such as telnet, FTP, mail, what have you."}, {"Time_Start": 441.0, "Time_End": 449.0, "Text": " A little description of what each layer is comprise of and what it does."}, {"Time_Start": 449.0, "Time_End": 452.0, "Text": " The data link layer, this is the very bottom of the stack."}, {"Time_Start": 452.0, "Time_End": 460.0, "Text": " This layer includes the device driver in the OS and the corresponding network interface card in the computer."}, {"Time_Start": 460.0, "Time_End": 464.0, "Text": " So this is both your network interface card and whatever drivers are required"}, {"Time_Start": 464.0, "Time_End": 467.0, "Text": " to interface that nick with your machine."}, {"Time_Start": 467.0, "Time_End": 470.0, "Text": " This handles both the hardware details of physically interfaces the network."}, {"Time_Start": 470.0, "Time_End": 473.0, "Text": " faces the network."}, {"Time_Start": 477.0, "Time_End": 479.0, "Text": " Moving on up to the network layer."}, {"Time_Start": 479.0, "Time_End": 481.0, "Text": " This is also sometimes known as the internet layer."}, {"Time_Start": 481.0, "Time_End": 485.0, "Text": " This handles the movement and routing of packets around the network."}, {"Time_Start": 485.0, "Time_End": 494.0, "Text": " Moving on up, the third layer, which is the transport layer."}, {"Time_Start": 494.0, "Time_End": 498.0, "Text": " This provides a flow of data between two hosts for the application layer above."}, {"Time_Start": 498.0, "Time_End": 500.0, "Text": " Two different transport protocol"}, {"Time_Start": 500.0, "Time_End": 502.0, "Text": " are used at this level."}, {"Time_Start": 502.0, "Time_End": 504.0, "Text": " I'll give you a brief description right now."}, {"Time_Start": 504.0, "Time_End": 507.0, "Text": " We're going to go a little bit further in depth into those in a few minutes."}, {"Time_Start": 507.0, "Time_End": 511.0, "Text": " It uses both TCP and UDP, as I mentioned a few minutes ago."}, {"Time_Start": 511.0, "Time_End": 514.0, "Text": " TCP, it's an extremely reliable protocol."}, {"Time_Start": 514.0, "Time_End": 520.0, "Text": " It breaks data passed from the application layer above and two chunks for the network layer below."}, {"Time_Start": 520.0, "Time_End": 526.0, "Text": " It acknowledges every packet of better receives, sets time outs, and a couple more things which I'll go into a few more minutes."}, {"Time_Start": 526.0, "Time_End": 529.0, "Text": " It's considered to be very reliable to actually establish any connection with the machine."}, {"Time_Start": 529.0, "Time_End": 532.0, "Text": " connection with the machine on the other end of the network."}, {"Time_Start": 532.0, "Time_End": 535.0, "Text": " The other protocol used at this level is UDP."}, {"Time_Start": 535.0, "Time_End": 538.0, "Text": " This is considered to be very unreliable."}, {"Time_Start": 538.0, "Time_End": 543.0, "Text": " It sends us packets of data, also in his datagrams, from one host to another."}, {"Time_Start": 543.0, "Time_End": 547.0, "Text": " The problem with this is there's no guarantee that those packets you're sending to the remote host"}, {"Time_Start": 547.0, "Time_End": 550.0, "Text": " are actually being received by that remote host."}, {"Time_Start": 554.0, "Time_End": 557.0, "Text": " And at the very top, we have the application layer."}, {"Time_Start": 557.0, "Time_End": 558.0, "Text": " This layer handles the details."}, {"Time_Start": 558.0, "Time_End": 561.0, "Text": " handles the details of the particular application being used."}, {"Time_Start": 561.0, "Time_End": 564.0, "Text": " Some of the standard TCP IP applications include"}, {"Time_Start": 564.0, "Time_End": 571.0, "Text": " Telnet, FTPP, SMTP, and also SNMP."}, {"Time_Start": 571.0, "Time_End": 578.0, "Text": " Okay, another definition."}, {"Time_Start": 578.0, "Time_End": 580.0, "Text": " Encapsulation."}, {"Time_Start": 580.0, "Time_End": 585.0, "Text": " That encapsulation is, when an application sends data using TCPIP,"}, {"Time_Start": 585.0, "Time_End": 587.0, "Text": " it's sent through each layer in the protocol stack."}, {"Time_Start": 587.0, "Time_End": 593.0, "Text": " stack. As I pass it through each layer, each layer adds its own information to that data"}, {"Time_Start": 593.0, "Time_End": 597.0, "Text": " by adding its own header and sometimes a footer to that information."}, {"Time_Start": 597.0, "Time_End": 601.0, "Text": " The data is then sent as a stream of bits across the network."}, {"Time_Start": 601.0, "Time_End": 608.0, "Text": " This is a little graphical representation of exactly how encapsulation works."}, {"Time_Start": 608.0, "Time_End": 611.0, "Text": " We start off with our user data."}, {"Time_Start": 611.0, "Time_End": 616.0, "Text": " First, it's run through the application layer. Remember, has to work its way through the top of the"}, {"Time_Start": 616.0, "Time_End": 620.0, "Text": " way through the top of the stack, go down to the bottom of the stack."}, {"Time_Start": 620.0, "Time_End": 627.0, "Text": " Once it runs through the application layer, the application layer adds on its own application header."}, {"Time_Start": 627.0, "Time_End": 639.0, "Text": " The next layer on down is the TCP layer, so obviously that's going to add on its own information."}, {"Time_Start": 639.0, "Time_End": 644.0, "Text": " As we can see, it does add on a TCP header."}, {"Time_Start": 644.0, "Time_End": 654.0, "Text": " Now this piece of data, or this segment is what's known as the TCP segment."}, {"Time_Start": 654.0, "Time_End": 659.0, "Text": " Both your application data and TCP header comprise a TCP segment."}, {"Time_Start": 659.0, "Time_End": 667.0, "Text": " Moving on down, the next layer we have is our IP layer."}, {"Time_Start": 667.0, "Time_End": 673.0, "Text": " And as you can see, the IP layer adds on its own IP header."}, {"Time_Start": 673.0, "Time_End": 674.0, "Text": " on IP header."}, {"Time_Start": 674.0, "Time_End": 684.0, "Text": " And this piece of data is what's known as an IP datagram, is comprised of your application data,"}, {"Time_Start": 684.0, "Time_End": 687.0, "Text": " your TCP header, and your IP data."}, {"Time_Start": 687.0, "Time_End": 690.0, "Text": " I'm sorry, your IP header."}, {"Time_Start": 690.0, "Time_End": 696.0, "Text": " And obviously, the very bottom of the list or the bottom of our stack is the link layer,"}, {"Time_Start": 696.0, "Time_End": 700.0, "Text": " our internet card, or Ethernet card."}, {"Time_Start": 703.0, "Time_End": 710.0, "Text": " And the link layer, if you notice, adds both an Ethernet trailer and an Ethernet header."}, {"Time_Start": 713.0, "Time_End": 716.0, "Text": " And this piece of data is what's known as an Ethernet frame."}, {"Time_Start": 716.0, "Time_End": 720.0, "Text": " This is going to be what's sent across the Ethernet."}, {"Time_Start": 724.0, "Time_End": 730.0, "Text": " And not that data would now go across the Ethernet, and once it's handled by the other machine,"}, {"Time_Start": 730.0, "Time_End": 732.0, "Text": " once it's handled by the other machine,"}, {"Time_Start": 732.0, "Time_End": 736.6, "Text": " Once that piece of data sent across the wire, what happens is demultiplexing."}, {"Time_Start": 736.6, "Time_End": 739.9, "Text": " It's the exact opposite of what happened just a minute ago."}, {"Time_Start": 739.9, "Time_End": 744.9, "Text": " When an Ethernet frame is received by host, it starts its way back up the protocol stack."}, {"Time_Start": 744.9, "Time_End": 749.5, "Text": " Each layer, then, we'll look at its respective header and its footer if there was a footer for that layer,"}, {"Time_Start": 749.5, "Time_End": 754.2, "Text": " and it decides what to do with that data next before it passes on to the next layer up."}, {"Time_Start": 754.2, "Time_End": 758.3, "Text": " So when you're sending data from a host, it moves this way down the stack, goes to the host,"}, {"Time_Start": 758.3, "Time_End": 761.9, "Text": " moves this way back up the stack, and strips all the headers and footers up they're required for that."}, {"Time_Start": 762.0, "Time_End": 769.0, "Text": " layer then passes off the application layer and decides what to do with it from there."}, {"Time_Start": 769.0, "Time_End": 777.0, "Text": " Okay, now I'm going to talk a little bit about some of the TCPIP networking protocols that are in use today."}, {"Time_Start": 777.0, "Time_End": 786.0, "Text": " First, I'm going to talk about IP, some of the features of the IP or the Internet protocol."}, {"Time_Start": 786.0, "Time_End": 792.0, "Text": " IP is the dominant network layer protocol used by the TCPIP,"}, {"Time_Start": 792.0, "Time_End": 797.2, "Text": " suite of protocols. IP defines the rules for packaging network traffic into IP"}, {"Time_Start": 797.2, "Time_End": 801.7, "Text": " datagrams and also defines the rules for moving these data grams across the network."}, {"Time_Start": 801.7, "Time_End": 807.0, "Text": " So you can see IP is a very important layer, very important protocol."}, {"Time_Start": 807.0, "Time_End": 811.74, "Text": " IP is also responsible for fragmenting the data whenever necessary and to properly"}, {"Time_Start": 811.74, "Time_End": 815.44, "Text": " reassemble the diagrams at the other end. This will make a little more sense in a few more"}, {"Time_Start": 815.44, "Time_End": 821.98, "Text": " minutes. This is actually what an IP header looks like."}, {"Time_Start": 822.0, "Time_End": 824.0, "Text": " It might be a little bit hard to reach the lights up here."}, {"Time_Start": 824.0, "Time_End": 826.0, "Text": " We couldn't get these lights shut up off up here."}, {"Time_Start": 826.0, "Time_End": 832.0, "Text": " But I'm going to go ahead and describe what each piece of this IP header actually means."}, {"Time_Start": 832.0, "Time_End": 838.0, "Text": " Upper left-hand corner, the very first item on there is the version number."}, {"Time_Start": 838.0, "Time_End": 843.0, "Text": " This indicates which version of IP is being used, which is typically version 4."}, {"Time_Start": 843.0, "Time_End": 847.0, "Text": " Obviously, we're very slowly converging into version 6."}, {"Time_Start": 847.0, "Time_End": 850.0, "Text": " It's probably a very slow convergence with that."}, {"Time_Start": 850.0, "Time_End": 851.0, "Text": " The next item is the 4th."}, {"Time_Start": 851.0, "Time_End": 858.0, "Text": " item is the 4-bit header length. This indicates how many 4 byte words are in the actual header."}, {"Time_Start": 858.0, "Time_End": 863.0, "Text": " The next item is the 8-bit type of service. I'm not going into a real big detail on this."}, {"Time_Start": 863.0, "Time_End": 869.0, "Text": " TCPI-A-P Illustrator breaks this down really well and exactly what the different types of service are."}, {"Time_Start": 869.0, "Time_End": 874.0, "Text": " But essentially this indicates the level of service the IDP datagram should be assigned."}, {"Time_Start": 874.0, "Time_End": 879.0, "Text": " The next item is the 16-bit total length in bytes."}, {"Time_Start": 879.0, "Time_End": 881.0, "Text": " This is the actual data."}, {"Time_Start": 881.0, "Time_End": 885.0, "Text": " diagram length, the entire datagram, including the header."}, {"Time_Start": 885.0, "Time_End": 889.0, "Text": " The max size of this is 65,535 bytes."}, {"Time_Start": 889.0, "Time_End": 894.0, "Text": " The next item is the 16-bit identification."}, {"Time_Start": 894.0, "Time_End": 899.0, "Text": " Let's see."}, {"Time_Start": 899.0, "Time_End": 901.0, "Text": " This is actual datagram identification."}, {"Time_Start": 901.0, "Time_End": 905.0, "Text": " This uniquely identifies each datagram being sent by a host."}, {"Time_Start": 905.0, "Time_End": 910.0, "Text": " You want to have your IEP datagrams, each have an individual identification."}, {"Time_Start": 910.0, "Time_End": 911.0, "Text": " So once they're received by their host."}, {"Time_Start": 911.0, "Time_End": 913.0, "Text": " the host knows how to handle that."}, {"Time_Start": 916.0, "Time_End": 918.0, "Text": " The next item, we have a couple different flags."}, {"Time_Start": 918.0, "Time_End": 920.0, "Text": " There's three flag positions there."}, {"Time_Start": 920.0, "Time_End": 921.0, "Text": " The first one's not being used."}, {"Time_Start": 921.0, "Time_End": 923.0, "Text": " It's represented by the zero."}, {"Time_Start": 923.0, "Time_End": 927.0, "Text": " The next flag, DF is don't fragment,"}, {"Time_Start": 927.0, "Time_End": 929.0, "Text": " and the next flag is more fragment."}, {"Time_Start": 929.0, "Time_End": 932.0, "Text": " This controls how the actual IP datagram has been fragmented"}, {"Time_Start": 932.0, "Time_End": 934.0, "Text": " as it's been sent across the wire."}, {"Time_Start": 934.0, "Time_End": 936.0, "Text": " You're sending a lot of information across the wire."}, {"Time_Start": 936.0, "Time_End": 939.0, "Text": " Obviously, it's going to have to fragment this information."}, {"Time_Start": 939.0, "Time_End": 941.0, "Text": " It can't send it all in one giant chunk."}, {"Time_Start": 941.0, "Time_End": 944.76, "Text": " Remember, we have that limitation on how big the actual package can be with this."}, {"Time_Start": 947.24, "Time_End": 952.0, "Text": " The next item we're looking at is the fragment offset, or the 13-bit fragment offset."}, {"Time_Start": 952.0, "Time_End": 957.0, "Text": " This indicates how many units from the start of the original datagram the current datagram is."}, {"Time_Start": 957.0, "Time_End": 961.0, "Text": " Now, this would be used when you're sending quite a bit of data across the wire."}, {"Time_Start": 961.0, "Time_End": 965.0, "Text": " That number is going to increase with every packet of data that's being crossed the sent."}, {"Time_Start": 965.0, "Time_End": 968.0, "Text": " That's being sent across the wire."}, {"Time_Start": 968.0, "Time_End": 970.5, "Text": " If you're sending just a very small packet across the wire, you're a very small packet across the wire,"}, {"Time_Start": 970.5, "Time_End": 972.5, "Text": " your fragment offset is going to be zero."}, {"Time_Start": 972.5, "Time_End": 976.5, "Text": " If it's being broken, I'm to say three packets, it's going to increase with every packet, 1, 2, 3."}, {"Time_Start": 976.5, "Time_End": 980.5, "Text": " That way, once it was received at the host, it's going to know how to interpret that data,"}, {"Time_Start": 980.5, "Time_End": 982.5, "Text": " how to put that data back together."}, {"Time_Start": 982.5, "Time_End": 987.5, "Text": " And it's also when it's done receiving data, basically, when it's received the end of that data."}, {"Time_Start": 987.5, "Time_End": 991.5, "Text": " The next field is the Time to Live, or TTL."}, {"Time_Start": 991.5, "Time_End": 993.5, "Text": " This is an 8-bit number."}, {"Time_Start": 993.5, "Time_End": 999.5, "Text": " This indicates how many routers the data gram may traverse before being dropped, the max TTL being 255."}, {"Time_Start": 999.5, "Time_End": 1004.5, "Text": " 255. If you don't set a time to live on a packet, you send it out across the wire,"}, {"Time_Start": 1004.5, "Time_End": 1008.5, "Text": " let's say at a particular time it can't find its host, it's going to bounce across the internet"}, {"Time_Start": 1008.5, "Time_End": 1010.5, "Text": " forever until that host comes up."}, {"Time_Start": 1010.5, "Time_End": 1014.5, "Text": " Can't have that kind of, can't have that happening on the internet."}, {"Time_Start": 1014.5, "Time_End": 1017.5, "Text": " It could probably cause a lot of problems."}, {"Time_Start": 1017.5, "Time_End": 1020.5, "Text": " The next field is the 8-bit protocol field."}, {"Time_Start": 1020.5, "Time_End": 1028.5, "Text": " This identifies which protocol is handed to the, which protocol has handed the IEP to data."}, {"Time_Start": 1028.5, "Time_End": 1030.5, "Text": " the IP to data."}, {"Time_Start": 1030.5, "Time_End": 1032.5, "Text": " The next field are pretty obvious."}, {"Time_Start": 1032.5, "Time_End": 1034.5, "Text": " The 32-bit source IP address."}, {"Time_Start": 1034.5, "Time_End": 1038.5, "Text": " The 32-pit destination IP address."}, {"Time_Start": 1038.5, "Time_End": 1044.5, "Text": " Obviously, it's the IP address which is sourcing this information"}, {"Time_Start": 1044.5, "Time_End": 1048.5, "Text": " and the IP address which is the destination of this information."}, {"Time_Start": 1048.5, "Time_End": 1050.5, "Text": " The next field is the options."}, {"Time_Start": 1050.5, "Time_End": 1053.5, "Text": " This field is not always used."}, {"Time_Start": 1053.5, "Time_End": 1057.5, "Text": " Currently defined options are security and handling restrictions."}, {"Time_Start": 1057.5, "Time_End": 1058.5, "Text": " Record."}, {"Time_Start": 1058.5, "Time_End": 1064.5, "Text": " route, timestamp, loose source routing, and strict source routing."}, {"Time_Start": 1064.5, "Time_End": 1066.5, "Text": " These options are rarely used."}, {"Time_Start": 1066.5, "Time_End": 1071.5, "Text": " There's a lot of routers out there on the internet that do not know how to handle these options,"}, {"Time_Start": 1071.5, "Time_End": 1073.5, "Text": " so it's very well that they are used."}, {"Time_Start": 1073.5, "Time_End": 1077.5, "Text": " And obviously, your last field's data is very obvious what that's going to be."}, {"Time_Start": 1077.5, "Time_End": 1081.5, "Text": " That's your data that you're sending to the application, sending to the remote host."}, {"Time_Start": 1081.5, "Time_End": 1095.0, "Text": " This is an actual TCP dump on the IP headers."}, {"Time_Start": 1095.0, "Time_End": 1097.5, "Text": " To give you an example of what it might look like."}, {"Time_Start": 1097.5, "Time_End": 1100.5, "Text": " As you can see at the very top, our version is version 4."}, {"Time_Start": 1100.5, "Time_End": 1104.5, "Text": " That's what's most widely, most commonly used on the internet these days."}, {"Time_Start": 1104.5, "Time_End": 1107.5, "Text": " The header length, 20 bytes, that's obvious."}, {"Time_Start": 1107.5, "Time_End": 1110.5, "Text": " The service type, as I said, I'm not going to go into that today."}, {"Time_Start": 1110.5, "Time_End": 1116.5, "Text": " but that hexadecimal representation represents the level of service that this datagram will be."}, {"Time_Start": 1116.5, "Time_End": 1122.5, "Text": " The next item, datagram length, this is the length of the entire datagram, including the header."}, {"Time_Start": 1122.5, "Time_End": 1124.5, "Text": " It's 40 bytes."}, {"Time_Start": 1124.5, "Time_End": 1129.5, "Text": " Next we have our unique identification, which we would have for every packet going across the wire."}, {"Time_Start": 1129.5, "Time_End": 1134.5, "Text": " And next we have our two flags, the must fragment and don't fragment."}, {"Time_Start": 1134.5, "Time_End": 1138.5, "Text": " As you can see in this case, must fragment is off, don't fragment is on."}, {"Time_Start": 1138.5, "Time_End": 1140.5, "Text": " That means we're sending a very small pack."}, {"Time_Start": 1140.5, "Time_End": 1144.5, "Text": " across the wire, it's only going to be one packet going across the wire."}, {"Time_Start": 1144.5, "Time_End": 1149.5, "Text": " Next fragmentation offset, as I mentioned, this will increase exponentially"}, {"Time_Start": 1149.5, "Time_End": 1152.5, "Text": " when you're sending large amounts of data across the wire."}, {"Time_Start": 1152.5, "Time_End": 1156.5, "Text": " At this case, it's a very small piece of data we're sending."}, {"Time_Start": 1156.5, "Time_End": 1159.5, "Text": " The next item, time to live, 32."}, {"Time_Start": 1159.5, "Time_End": 1166.5, "Text": " This packet can only traverse 32 routers or 32 hops before its destination before it's actually dropped."}, {"Time_Start": 1166.5, "Time_End": 1170.48, "Text": " The next item is the encapsulated protocol that's being used in this instance, which is"}, {"Time_Start": 1170.5, "Time_End": 1176.2, "Text": " TCP. The next item is the header checks some. This is basically a bounce"}, {"Time_Start": 1176.2, "Time_End": 1180.38, "Text": " checking that the remote host will use to make sure that the data being received is"}, {"Time_Start": 1180.38, "Time_End": 1185.68, "Text": " not corrupted in any way. Then we have our source IP address and destination IP"}, {"Time_Start": 1185.68, "Time_End": 1194.5, "Text": " address. Those are both obvious. Okay, I just wanted to mention a little bit of Tracewall"}, {"Time_Start": 1194.5, "Time_End": 1200.34, "Text": " program. This can be a very useful diagnostic program, especially since there is no"}, {"Time_Start": 1200.5, "Time_End": 1207.5, "Text": " that two connective IP datagrams from the same source to the same destination will take the same route."}, {"Time_Start": 1207.5, "Time_End": 1213.5, "Text": " They usually will, but let's say you're saying data across the wire, a large amount of data going across the wire."}, {"Time_Start": 1213.5, "Time_End": 1218.5, "Text": " If one of those routes should drop automatically, they will be re-routed to that host."}, {"Time_Start": 1218.5, "Time_End": 1222.5, "Text": " That host should still receive all that data. Trace route is a good program."}, {"Time_Start": 1222.5, "Time_End": 1228.5, "Text": " It's a good tool that can be used to trace the flow of IP datagrams from one host to another."}, {"Time_Start": 1230.5, "Time_End": 1235.5, "Text": " An explanation of how trace route works."}, {"Time_Start": 1235.5, "Time_End": 1241.5, "Text": " Trace route sends an IP datagram with a time to live of one to the destination host."}, {"Time_Start": 1241.5, "Time_End": 1245.5, "Text": " If you remember a minute ago I mentioned, the time to live is essentially how many routers"}, {"Time_Start": 1245.5, "Time_End": 1248.5, "Text": " that packet can traverse before it's going to be dropped."}, {"Time_Start": 1248.5, "Time_End": 1252.5, "Text": " So obviously, once it gets to the first router and its path to the host,"}, {"Time_Start": 1252.5, "Time_End": 1256.5, "Text": " that pack is going to be dropped, is going to be decremented by to zero."}, {"Time_Start": 1256.5, "Time_End": 1258.5, "Text": " That pack is going to be dropped by that router."}, {"Time_Start": 1258.5, "Time_End": 1260.5, "Text": " That router is then going to be sent to the first router."}, {"Time_Start": 1260.5, "Time_End": 1265.5, "Text": " an ICMP, time exceeded back to the host."}, {"Time_Start": 1265.5, "Time_End": 1266.5, "Text": " What happens next?"}, {"Time_Start": 1266.5, "Time_End": 1270.5, "Text": " Trace route then sends another datagram with a time to live or two."}, {"Time_Start": 1270.5, "Time_End": 1273.5, "Text": " We then find the next IP address of the second order."}, {"Time_Start": 1273.5, "Time_End": 1276.5, "Text": " They'll decrement to zero once again be dropped."}, {"Time_Start": 1276.5, "Time_End": 1279.5, "Text": " They'll send back the ICMP, time exceeded back to the host,"}, {"Time_Start": 1279.5, "Time_End": 1280.5, "Text": " so on and so forth."}, {"Time_Start": 1280.5, "Time_End": 1284.5, "Text": " We'll keep doing this until it eventually does reach the host."}, {"Time_Start": 1284.5, "Time_End": 1293.5, "Text": " And here we just have our, it's a real simple sample trace route output."}, {"Time_Start": 1293.5, "Time_End": 1295.5, "Text": " We're trace routing to victim.com."}, {"Time_Start": 1295.5, "Time_End": 1296.5, "Text": " Trace route to victim.com."}, {"Time_Start": 1296.5, "Time_End": 1297.5, "Text": " Trace route to victim.com."}, {"Time_Start": 1297.5, "Time_End": 1299.5, "Text": " It gives us our IP address."}, {"Time_Start": 1299.5, "Time_End": 1303.5, "Text": " It's going to be a maximum of 30 hops, which is the time to deliver 30."}, {"Time_Start": 1303.5, "Time_End": 1305.5, "Text": " And it's saying 40 byte packets."}, {"Time_Start": 1305.5, "Time_End": 1308.5, "Text": " That's the entire, the size of the entire packet, including the header,"}, {"Time_Start": 1308.5, "Time_End": 1310.5, "Text": " is going to be 40 bytes in this case."}, {"Time_Start": 1310.5, "Time_End": 1313.5, "Text": " You can see the first hop is Satan."}, {"Time_Start": 1313.5, "Time_End": 1314.5, "Text": " And we have, it's a size."}, {"Time_Start": 1314.5, "Time_End": 1316.5, "Text": " We're actually saying three packets every time."}, {"Time_Start": 1316.5, "Time_End": 1318.5, "Text": " We have our average for every packet."}, {"Time_Start": 1318.5, "Time_End": 1321.5, "Text": " 20 milliseconds, 10 milliseconds, and 10 milliseconds."}, {"Time_Start": 1321.5, "Time_End": 1325.5, "Text": " The next hop, which are our actual destination host, is victim."}, {"Time_Start": 1325.5, "Time_End": 1329.5, "Text": " So we can see we have 120 milliseconds for all three of those."}, {"Time_Start": 1329.5, "Time_End": 1333.5, "Text": " So for each TTL, three datagrams are actually being sent."}, {"Time_Start": 1333.5, "Time_End": 1335.5, "Text": " These values are then recorded in your output."}, {"Time_Start": 1344.5, "Time_End": 1347.5, "Text": " To TCP, some of the features of TCP."}, {"Time_Start": 1347.5, "Time_End": 1349.5, "Text": " TCP is a transport layer protocol."}, {"Time_Start": 1349.5, "Time_End": 1351.5, "Text": " I mentioned that a little bit earlier."}, {"Time_Start": 1351.5, "Time_End": 1355.5, "Text": " This provides a way to connect hosts across a network reliably."}, {"Time_Start": 1355.5, "Time_End": 1359.5, "Text": " As I mentioned before, TCP is considered to be a very reliable protocol."}, {"Time_Start": 1359.5, "Time_End": 1364.5, "Text": " Actually, TCP provides a virtual circuit between two hosts."}, {"Time_Start": 1364.5, "Time_End": 1367.5, "Text": " These hosts are actually connected from one and point to another."}, {"Time_Start": 1367.5, "Time_End": 1371.5, "Text": " It's basically a virtual connection between the two machines."}, {"Time_Start": 1371.5, "Time_End": 1373.5, "Text": " Communicating hosts are required to acknowledge receipt of network trends."}, {"Time_Start": 1373.5, "Time_End": 1375.5, "Text": " receipt of network traffic."}, {"Time_Start": 1375.5, "Time_End": 1377.5, "Text": " That way, you're guaranteed that that information"}, {"Time_Start": 1377.5, "Time_End": 1380.5, "Text": " you're being sent to that host is actually being received by that host."}, {"Time_Start": 1380.5, "Time_End": 1384.5, "Text": " But for some reason, that host drops in the middle of the transmission to be notified,"}, {"Time_Start": 1384.5, "Time_End": 1389.5, "Text": " all the information you were sending to that host was not received."}, {"Time_Start": 1389.5, "Time_End": 1395.5, "Text": " Some more features of TCP."}, {"Time_Start": 1395.5, "Time_End": 1401.5, "Text": " TCP packages its data into segments, which contain both data and session control information."}, {"Time_Start": 1401.5, "Time_End": 1403.5, "Text": " And since site-tube"}, {"Time_Start": 1403.5, "Time_End": 1406.5, "Text": " Since segments traversing your network may arrive out of order,"}, {"Time_Start": 1406.5, "Time_End": 1409.5, "Text": " TCP provides proper reassembly of these segments."}, {"Time_Start": 1409.5, "Time_End": 1413.5, "Text": " As I mentioned before, all your packets may not necessarily take the same path."}, {"Time_Start": 1413.5, "Time_End": 1415.5, "Text": " Some of these packets may arrive out of order,"}, {"Time_Start": 1415.5, "Time_End": 1419.5, "Text": " so we have to have a means for assembling these packets in the proper order"}, {"Time_Start": 1419.5, "Time_End": 1421.5, "Text": " once they arrive at their destination host."}, {"Time_Start": 1421.5, "Time_End": 1424.5, "Text": " This is where sequence numbers come in."}, {"Time_Start": 1424.5, "Time_End": 1427.5, "Text": " Sequence numbers are used to properly reassemble all these packets"}, {"Time_Start": 1427.5, "Time_End": 1429.5, "Text": " that are being sent to your host."}, {"Time_Start": 1429.5, "Time_End": 1433.5, "Text": " You can think of that the sequence number basically as a 32-bit count"}, {"Time_Start": 1433.5, "Time_End": 1442.5, "Text": " It can range anywhere from zero to $4 billion, 294,967,295."}, {"Time_Start": 1442.5, "Time_End": 1448.5, "Text": " So it's pretty broad range that the sequence number can fall into."}, {"Time_Start": 1448.5, "Time_End": 1456.5, "Text": " And this is just an example of how the, this is an FTP transfer TCP dump outfoot."}, {"Time_Start": 1456.5, "Time_End": 1460.5, "Text": " As we can see on our first line, we have TCP."}, {"Time_Start": 1460.5, "Time_End": 1462.5, "Text": " It's obviously used an FTP as telling us."}, {"Time_Start": 1462.5, "Time_End": 1464.5, "Text": " FTP is telling us."}, {"Time_Start": 1464.5, "Time_End": 1467.5, "Text": " And the sequence number, we're going to look at the last four digits of this."}, {"Time_Start": 1467.5, "Time_End": 1469.5, "Text": " It's 1397."}, {"Time_Start": 1469.5, "Time_End": 1474.5, "Text": " And as you can see, the data payload is 1,460 bytes."}, {"Time_Start": 1474.5, "Time_End": 1477.5, "Text": " So next we increment up, 1,460."}, {"Time_Start": 1477.5, "Time_End": 1482.5, "Text": " The sequence number is going to increase by 1,460 for packet 50."}, {"Time_Start": 1482.5, "Time_End": 1485.5, "Text": " It's going to jump up to 2857."}, {"Time_Start": 1485.5, "Time_End": 1489.5, "Text": " Once again, it's 1460 bytes in this packet."}, {"Time_Start": 1489.5, "Time_End": 1491.5, "Text": " So our next packet obviously is going to increase by that set."}, {"Time_Start": 1491.5, "Time_End": 1494.5, "Text": " to increase by that same amount of number for the sequence number."}, {"Time_Start": 1494.5, "Time_End": 1496.5, "Text": " Increases to 4317."}, {"Time_Start": 1496.5, "Time_End": 1499.5, "Text": " The same thing for packet 52."}, {"Time_Start": 1499.5, "Time_End": 1502.5, "Text": " So essentially, if these packets arrive out of order,"}, {"Time_Start": 1502.5, "Time_End": 1505.5, "Text": " the receiving host can still put these packets back into the proper order"}, {"Time_Start": 1505.5, "Time_End": 1510.5, "Text": " and acknowledge what this data being sent across the wire is."}, {"Time_Start": 1515.5, "Time_End": 1518.5, "Text": " And one of the other features of TCP."}, {"Time_Start": 1518.5, "Time_End": 1521.5, "Text": " It maximizes performance of a connection by"}, {"Time_Start": 1521.5, "Time_End": 1524.5, "Text": " ensuring TCP segments are neither too large or too small."}, {"Time_Start": 1524.5, "Time_End": 1528.5, "Text": " There's a lot of balance checking to make sure it's not saying too much data."}, {"Time_Start": 1528.5, "Time_End": 1531.5, "Text": " You don't want to send too much data because if that receiving host can't handle that much"}, {"Time_Start": 1531.5, "Time_End": 1535.0, "Text": " that much data, you're going to lose data and you're going to have probably corrupted data"}, {"Time_Start": 1535.0, "Time_End": 1540.5, "Text": " being sent across the wire."}, {"Time_Start": 1540.5, "Time_End": 1545.5, "Text": " So everything I've said about TCP can pretty much be wrapped up in a little in a nutshell."}, {"Time_Start": 1545.5, "Time_End": 1547.5, "Text": " It provides a virtual circuit."}, {"Time_Start": 1547.5, "Time_End": 1550.5, "Text": " TCP connections behave like a live two-way communication."}, {"Time_Start": 1550.5, "Time_End": 1552.5, "Text": " or a two-way connection."}, {"Time_Start": 1552.5, "Time_End": 1555.5, "Text": " You can basically think about it as basically a telephone conversation."}, {"Time_Start": 1555.5, "Time_End": 1558.5, "Text": " You're connected from one end point to another end point."}, {"Time_Start": 1558.5, "Time_End": 1561.5, "Text": " It provides reliable connections."}, {"Time_Start": 1561.5, "Time_End": 1564.5, "Text": " TCP segments are guaranteed to reach their destination."}, {"Time_Start": 1564.5, "Time_End": 1567.5, "Text": " And if for some reason they're not receiving their destination,"}, {"Time_Start": 1567.5, "Time_End": 1569.5, "Text": " the user is notified about this."}, {"Time_Start": 1569.5, "Time_End": 1573.5, "Text": " And there's also a lot of stuff put into TCP"}, {"Time_Start": 1573.5, "Time_End": 1576.5, "Text": " that provides performance optimization."}, {"Time_Start": 1576.5, "Time_End": 1580.48, "Text": " TCP can modify transmission variables depending on"}, {"Time_Start": 1580.5, "Time_End": 1585.5, "Text": " network conditions. For some reason, if a route seems to drop, a route seems to really be lagging,"}, {"Time_Start": 1585.5, "Time_End": 1590.5, "Text": " that information will reroute across the network, and it essentially will still reach the host,"}, {"Time_Start": 1590.5, "Time_End": 1593.5, "Text": " even if a route does drop."}, {"Time_Start": 1597.5, "Time_End": 1601.5, "Text": " And now we're going to go ahead and take a look at the TCP header and all the fields that are included"}, {"Time_Start": 1601.5, "Time_End": 1603.5, "Text": " in the TCP header."}, {"Time_Start": 1603.5, "Time_End": 1609.5, "Text": " The first two items we have, the 16-bit source port number, the 16-bit destination port number,"}, {"Time_Start": 1609.5, "Time_End": 1614.5, "Text": " bit destination port number. Obviously, this is the IP address of your originating host"}, {"Time_Start": 1614.5, "Time_End": 1621.0, "Text": " and your destination host. The next field is your 32-bit sequence number. As I mentioned, the"}, {"Time_Start": 1621.0, "Time_End": 1626.5, "Text": " sequence number is a four-by number assigned by TCP, starting with a randomly chosen number."}, {"Time_Start": 1626.5, "Time_End": 1632.5, "Text": " Actually, the older operating systems, it wasn't really very random. I'll talk about that in a few minutes."}, {"Time_Start": 1632.5, "Time_End": 1638.5, "Text": " I think Pete's actually going to elaborate on this in the next speech on TCP IP sequence prediction."}, {"Time_Start": 1638.5, "Time_End": 1639.5, "Text": " This number is used."}, {"Time_Start": 1639.5, "Time_End": 1646.5, "Text": " to determine how many bytes have been transmitted across the network, so it can properly assemble those packets once they're received."}, {"Time_Start": 1646.5, "Time_End": 1651.5, "Text": " The next field is the 32-bit acknowledgement number."}, {"Time_Start": 1651.5, "Time_End": 1656.5, "Text": " This acknowledgment number acknowledges the last segment sent by the host."}, {"Time_Start": 1656.5, "Time_End": 1662.5, "Text": " We can't have all these packets traversing the network and receiving the host and the host not acknowledging that they're being received."}, {"Time_Start": 1662.5, "Time_End": 1664.5, "Text": " Otherwise, there's no way we're going to have a good connection."}, {"Time_Start": 1664.5, "Time_End": 1668.5, "Text": " There's no way we're going to have a reliable connection going across the wire."}, {"Time_Start": 1668.5, "Time_End": 1672.5, "Text": " The next item is the four-bit header length."}, {"Time_Start": 1672.5, "Time_End": 1675.5, "Text": " This measures the header length and four by roads."}, {"Time_Start": 1675.5, "Time_End": 1680.5, "Text": " The next field's reserve. I'm not going to discuss that."}, {"Time_Start": 1680.5, "Time_End": 1683.5, "Text": " In the next field, we have six different flags."}, {"Time_Start": 1683.5, "Time_End": 1686.5, "Text": " I'll give you a brief description of what each of those flags mean."}, {"Time_Start": 1686.5, "Time_End": 1689.5, "Text": " These flags may either be turned on or turned off."}, {"Time_Start": 1689.5, "Time_End": 1693.5, "Text": " These flags are used when negotiating and managing a connection."}, {"Time_Start": 1693.5, "Time_End": 1698.48, "Text": " The first flag, which is Urge, or U-R-G. This indicates the second"}, {"Time_Start": 1698.5, "Time_End": 1704.5, "Text": " being sent is urgent, so you can prioritize the urgency of segments being sent across the wire."}, {"Time_Start": 1704.5, "Time_End": 1712.5, "Text": " The next flag is AC, or acknowledge, indicates the ACC number, and the segment header is valid."}, {"Time_Start": 1712.5, "Time_End": 1715.5, "Text": " The next field is Bush, PSH."}, {"Time_Start": 1715.5, "Time_End": 1720.5, "Text": " This automatically tells that to pass the data to the application as soon as possible."}, {"Time_Start": 1720.5, "Time_End": 1725.5, "Text": " It puts a precedence on this information to pass to the application layer ASAP."}, {"Time_Start": 1725.5, "Time_End": 1727.5, "Text": " The next field is RST."}, {"Time_Start": 1727.5, "Time_End": 1734.5, "Text": " The field is RST or reset. This flag is used to reset a connection. The next flag, which is sin."}, {"Time_Start": 1734.5, "Time_End": 1740.4, "Text": " synchronize. This synchronizes the numbers used to initiate a connection. I'll talk about initiating"}, {"Time_Start": 1740.4, "Time_End": 1747.5, "Text": " connection in a few minutes. And the last field is fin. This indicates that the sender is finished sending data."}, {"Time_Start": 1747.5, "Time_End": 1754.5, "Text": " A fin would be finished, obviously, at the very end of your flow of data, indicating they are no longer sending data."}, {"Time_Start": 1754.5, "Time_End": 1757.48, "Text": " You're receiving hosts as you know that it has received all this data at that time."}, {"Time_Start": 1757.5, "Time_End": 1763.5, "Text": " The next field is a 16-bit window size. This is the number of bytes"}, {"Time_Start": 1763.5, "Time_End": 1767.5, "Text": " that the receiving host is willing to accept. This is what's called a sliding window,"}, {"Time_Start": 1767.5, "Time_End": 1771.5, "Text": " and this can actually scale depending on what kind of traffic that host is receiving."}, {"Time_Start": 1771.5, "Time_End": 1775.5, "Text": " The max being 65,535 bytes."}, {"Time_Start": 1775.5, "Time_End": 1783.5, "Text": " The next field, the 16-bit TCP checksum. This is a check sum of the TCP header and data."}, {"Time_Start": 1783.5, "Time_End": 1787.48, "Text": " Once again, this is used by the receiving host to ensure that that data"}, {"Time_Start": 1787.5, "Time_End": 1793.14, "Text": " being sent across the wire is not corrupted. The next field is the 16-bit"}, {"Time_Start": 1793.14, "Time_End": 1798.78, "Text": " urgent pointer. This is used only if the urgent flag is set, so a sense of precedence on"}, {"Time_Start": 1798.78, "Time_End": 1805.02, "Text": " your information going across the wire. The last field are options. The most"}, {"Time_Start": 1805.02, "Time_End": 1812.5, "Text": " commonly used options in TCP headers are both MSS, which is maximum segment size."}, {"Time_Start": 1812.5, "Time_End": 1817.48, "Text": " This determines the maximum size segment the center is willing to"}, {"Time_Start": 1817.5, "Time_End": 1823.5, "Text": " receive. This basically coincides with the 16-bit window size I just discussed a minute ago."}, {"Time_Start": 1823.5, "Time_End": 1827.82, "Text": " And then obviously at the bottom we have our data. Data is not always going to be sent across the"}, {"Time_Start": 1827.82, "Time_End": 1832.5, "Text": " wires you're going to see in a few minutes. When you're establishing a connection, no data is being sent."}, {"Time_Start": 1832.5, "Time_End": 1838.5, "Text": " You must first establish that virtual connection before any data can be sent across the wire."}, {"Time_Start": 1838.5, "Time_End": 1844.5, "Text": " So essentially this segment of the TCP, this portion of the TC segment is optional."}, {"Time_Start": 1847.5, "Time_End": 1853.5, "Text": " And also jumping back to the synchronized numbers, I was talking about how the"}, {"Time_Start": 1853.5, "Time_End": 1857.0, "Text": " host synchronized, they use these numbers, to determine how much data is being"}, {"Time_Start": 1857.0, "Time_End": 1861.5, "Text": " sent across the wire, and it's also used to properly reassemble these packets."}, {"Time_Start": 1861.5, "Time_End": 1867.5, "Text": " On older systems, this number, when you first bootstrap the system, this number is set at 1."}, {"Time_Start": 1867.5, "Time_End": 1874.5, "Text": " Every second it increases by 128,000, and every connection it would increase by 64,000."}, {"Time_Start": 1874.5, "Time_End": 1876.5, "Text": " That's why in a lot of older systems, it was, it was a lot of older systems."}, {"Time_Start": 1876.5, "Time_End": 1881.5, "Text": " it was a lot easier for people to try and predict TCP sequence numbers."}, {"Time_Start": 1881.5, "Time_End": 1885.5, "Text": " These days on current TCP stacks, this numbers generated randomly,"}, {"Time_Start": 1885.5, "Time_End": 1888.5, "Text": " so it's not quite so easy to try and hijack a connection with that."}, {"Time_Start": 1888.5, "Time_End": 1892.5, "Text": " I think Pete's going to be elaborating on that a little bit more in the next segment."}, {"Time_Start": 1906.5, "Time_End": 1912.5, "Text": " And this is an actual TCP dump of a TCP header, give you an idea of what it looks like."}, {"Time_Start": 1912.5, "Time_End": 1920.5, "Text": " Our source port is 22. It's a well-known port, SSH. Destination ports, 1,714, it's an unknown port."}, {"Time_Start": 1920.5, "Time_End": 1931.5, "Text": " It's an F-R-M-O port. The sequence number, our acknowledgement number, the header length, which is 20 bytes, is telling us there's no data in this payload."}, {"Time_Start": 1931.5, "Time_End": 1935.5, "Text": " Our flags, the origin flags turned off, the acknowledged flag is turned off."}, {"Time_Start": 1935.5, "Time_End": 1941.8, "Text": " flag is turned on, the push flag is turned off, reset flag is turned off, the"}, {"Time_Start": 1941.8, "Time_End": 1945.26, "Text": " synchronized flag is turned off because we're not establishing a connection, we're already"}, {"Time_Start": 1945.26, "Time_End": 1950.9, "Text": " connected to this host, and the fin flag is turned off. The window advertisements"}, {"Time_Start": 1950.9, "Time_End": 1958.18, "Text": " 32,736 bytes. This is how many bytes of data, how a remote host is willing to"}, {"Time_Start": 1958.18, "Time_End": 1964.84, "Text": " accept at that particular time. We also have our checks on that is used by the receiving host to"}, {"Time_Start": 1964.8400000000001, "Time_End": 1969.0800000000002, "Text": " to ensure this data being sent across the wires not being corrupted and our urgent"}, {"Time_Start": 1969.0800000000002, "Time_End": 1977.46, "Text": " pointers being set to zero because of the fact that the urgent flag is off."}, {"Time_Start": 1977.46, "Time_End": 1981.5600000000002, "Text": " It's just a little graph of the representation what actually happens when you establish a three-way"}, {"Time_Start": 1981.5600000000002, "Time_End": 1986.8400000000001, "Text": " connection or a TCP connection to a remote host. It's what's known as a three-way handshake."}, {"Time_Start": 1986.8400000000001, "Time_End": 1994.8200000000002, "Text": " Initially, the client will send a send packet to the server with an ISN of a"}, {"Time_Start": 1994.8400000000001, "Time_End": 2002.0400000000002, "Text": " we'll say it's x right now it's not really important what number that is. The"}, {"Time_Start": 2002.0400000000002, "Time_End": 2007.3400000000001, "Text": " server is then going to apply with the sin. It's going to set its own ISN is Y. It's also"}, {"Time_Start": 2007.3400000000001, "Time_End": 2013.2, "Text": " going to acknowledge the client's ISN by adding one to it. So it would be x plus 1 in"}, {"Time_Start": 2013.2, "Time_End": 2020.38, "Text": " that case. The client then sends back and other acknowledge with the server's"}, {"Time_Start": 2020.38, "Time_End": 2022.4, "Text": " ISN, which would be Y plus one."}, {"Time_Start": 2024.8400000000001, "Time_End": 2028.8400000000001, "Text": " Once this happens, we have a full connection established."}, {"Time_Start": 2028.8400000000001, "Time_End": 2034.8400000000001, "Text": " Data connection will be sent across the wire at this time."}, {"Time_Start": 2034.8400000000001, "Time_End": 2042.8400000000001, "Text": " And this is a packet dump showing exactly what it looks like when this three-way handshake is being established."}, {"Time_Start": 2042.8400000000001, "Time_End": 2049.84, "Text": " As you can see, we're connecting from TC port 24,616 to an FTP port."}, {"Time_Start": 2049.84, "Time_End": 2053.84, "Text": " We have our sequence number, I'll go off the last four, that's 1,453."}, {"Time_Start": 2053.84, "Time_End": 2060.84, "Text": " The requesting client sends a sin or a synchronized segment, specifying the port number"}, {"Time_Start": 2060.84, "Time_End": 2068.84, "Text": " of the server which is to connect to, and the client's ISN, or initial sequence number."}, {"Time_Start": 2068.84, "Time_End": 2071.84, "Text": " Part 2 of the handshake."}, {"Time_Start": 2071.84, "Time_End": 2076.84, "Text": " The server responds with the sin segment, including the server's own ISN, which is in blue,"}, {"Time_Start": 2076.84, "Time_End": 2078.84, "Text": " the last four being 5737."}, {"Time_Start": 2078.84, "Time_End": 2082.84, "Text": " An acknowledgement is also sent with the client's ISN plus 1."}, {"Time_Start": 2082.84, "Time_End": 2089.84, "Text": " plus 1. So as you can see, that date increased by 1. It's at 1454 now. It was originally at 1453"}, {"Time_Start": 2089.84, "Time_End": 2096.84, "Text": " when we first initiated this connection. And the last part of the three-way handshake."}, {"Time_Start": 2096.84, "Time_End": 2102.84, "Text": " The client acknowledges the Silver's sin and sends an act segment with the server's ISM plus 1,"}, {"Time_Start": 2102.84, "Time_End": 2108.84, "Text": " which is the number in the blue. As you can see, that day increased by 1. It's now at 5738."}, {"Time_Start": 2108.84, "Time_End": 2111.84, "Text": " Whereas before with the last packet, it was 5737."}, {"Time_Start": 2111.84, "Time_End": 2121.84, "Text": " If there's any questions, you can feel free to ask them any time or sit until the end."}, {"Time_Start": 2125.84, "Time_End": 2128.84, "Text": " Moving on to UDP, user datagram protocol."}, {"Time_Start": 2128.84, "Time_End": 2130.84, "Text": " I mentioned before."}, {"Time_Start": 2130.84, "Time_End": 2134.84, "Text": " UDP is also another transport layer protocols such as TCP."}, {"Time_Start": 2134.84, "Time_End": 2140.84, "Text": " UDP does not use the benefits of error detection, error correction, handshaking, or verification,"}, {"Time_Start": 2140.84, "Time_End": 2143.84, "Text": " or verification of delivery like TCP."}, {"Time_Start": 2143.84, "Time_End": 2147.84, "Text": " It provides a connection list of delivery system between two hosts."}, {"Time_Start": 2147.84, "Time_End": 2150.84, "Text": " And because of the fact that there's no error checking, error correction,"}, {"Time_Start": 2150.84, "Time_End": 2153.84, "Text": " it doesn't ensure that your packets are receiving the host."}, {"Time_Start": 2153.84, "Time_End": 2156.84, "Text": " UDP does have very low overhead."}, {"Time_Start": 2156.84, "Time_End": 2160.84, "Text": " It's typically only useful as very simple applications such as TFTP."}, {"Time_Start": 2160.84, "Time_End": 2165.84, "Text": " If you have a real intensive application, you're not going to want to use UDP"}, {"Time_Start": 2165.84, "Time_End": 2170.84, "Text": " because there's no guarantee that this information being sent across the wire is actually receiving a"}, {"Time_Start": 2170.84, "Time_End": 2171.84, "Text": " host."}, {"Time_Start": 2171.84, "Time_End": 2177.84, "Text": " With an intensive application, you want to guarantee that the information is properly going across the wire."}, {"Time_Start": 2177.84, "Time_End": 2183.84, "Text": " Now we'll take a look at all the fields in the UDP header."}, {"Time_Start": 2183.84, "Time_End": 2187.84, "Text": " As you can see, it's a very small header because of the fact that it doesn't have a lot of these error"}, {"Time_Start": 2187.84, "Time_End": 2190.84, "Text": " correction and bounce checking like the other information did."}, {"Time_Start": 2190.84, "Time_End": 2197.84, "Text": " The very top, the first two, the first two areas of the UDP header, the 16-bit source port number,"}, {"Time_Start": 2197.84, "Time_End": 2199.84, "Text": " 16-bit destination port number."}, {"Time_Start": 2199.84, "Time_End": 2200.84, "Text": " Those are both pretty out."}, {"Time_Start": 2200.84, "Time_End": 2207.84, "Text": " obvious. The 16-bit UDP length. This indicates the length of the entire UDP"}, {"Time_Start": 2207.84, "Time_End": 2215.84, "Text": " datagram including the header. Next we have the 16-bit UDP checksum. This is a check sum of the entire"}, {"Time_Start": 2215.84, "Time_End": 2222.84, "Text": " UDP datagram. Once again, this is used by the receiving host to ensure that data being sent across"}, {"Time_Start": 2222.84, "Time_End": 2228.84, "Text": " the wires not being corrupted. And the last field is our data. It's obvious what that's going to be."}, {"Time_Start": 2228.84, "Time_End": 2230.82, "Text": " It's our data we're sending to the application on a remote machine."}, {"Time_Start": 2230.84, "Time_End": 2244.84, "Text": " He was asking, he does not do error detection."}, {"Time_Start": 2244.84, "Time_End": 2249.84, "Text": " All this, it's not actually doing error detection, it's just ensuring that that packet is properly formed"}, {"Time_Start": 2249.84, "Time_End": 2250.84, "Text": " since it's received the host."}, {"Time_Start": 2250.84, "Time_End": 2254.84, "Text": " Let's say that packet does hit the host and it says there's something wrong with this packet."}, {"Time_Start": 2254.84, "Time_End": 2256.84, "Text": " It's not going to let you know if there's something wrong with it."}, {"Time_Start": 2256.84, "Time_End": 2260.84, "Text": " Right."}, {"Time_Start": 2260.84, "Time_End": 2273.84, "Text": " And next, we'll take a..."}, {"Time_Start": 2273.84, "Time_End": 2275.84, "Text": " This is natural TCP dump of a UDB header."}, {"Time_Start": 2275.84, "Time_End": 2277.84, "Text": " See what it actually looks like."}, {"Time_Start": 2277.84, "Time_End": 2280.84, "Text": " Our source port is 2167."}, {"Time_Start": 2280.84, "Time_End": 2284.84, "Text": " This once again is an ephemeral port that the user is interacting with."}, {"Time_Start": 2284.84, "Time_End": 2285.84, "Text": " The destination port is 53."}, {"Time_Start": 2285.84, "Time_End": 2290.84, "Text": " Parts 53, Domain Service, Domain Name Service Parts, the DNS request."}, {"Time_Start": 2290.84, "Time_End": 2297.84, "Text": " Datagram length is 37 bytes, 8 of which is the header, and 29 of which is the actual data being sent."}, {"Time_Start": 2297.84, "Time_End": 2299.84, "Text": " And then we have our checksum."}, {"Time_Start": 2303.84, "Time_End": 2309.84, "Text": " That actually pretty much wraps up my speech."}, {"Time_Start": 2309.84, "Time_End": 2312.84, "Text": " There's a couple references I have in my slides."}, {"Time_Start": 2312.84, "Time_End": 2314.84, "Text": " As I mentioned before, TCPIP Illustrated Volume 1."}, {"Time_Start": 2314.84, "Time_End": 2319.84, "Text": " volume 1. Excellent resource. It's kind of difficult to get into it at first,"}, {"Time_Start": 2319.84, "Time_End": 2323.84, "Text": " but the more you read up on it, the easier it does seem to get."}, {"Time_Start": 2323.84, "Time_End": 2328.84, "Text": " Also, TCPIP Network Administration, is one of O'Reilly's books,"}, {"Time_Start": 2328.84, "Time_End": 2331.84, "Text": " written by Craig Hunt, is a pretty decent book also."}, {"Time_Start": 2335.84, "Time_End": 2341.84, "Text": " Like I said before, if anyone does want to copy these slides, you can drop me an email."}, {"Time_Start": 2341.84, "Time_End": 2343.84, "Text": " It's Punkus at Atrition.org."}, {"Time_Start": 2343.84, "Time_End": 2344.84, "Text": " I'll be glad to see you."}, {"Time_Start": 2344.84, "Time_End": 2346.84, "Text": " you can send you a copy of these."}, {"Time_Start": 2346.84, "Time_End": 2347.84, "Text": " Let's see."}, {"Time_Start": 2347.84, "Time_End": 2353.84, "Text": " Also having the references, the TCPIP fact, the frequently asked questions,"}, {"Time_Start": 2353.84, "Time_End": 2355.84, "Text": " is broken on into two parts."}, {"Time_Start": 2355.84, "Time_End": 2359.84, "Text": " There's a URL for that I could give to you."}, {"Time_Start": 2359.84, "Time_End": 2362.84, "Text": " I'm not going to read it."}, {"Time_Start": 2362.84, "Time_End": 2364.84, "Text": " And also TCP show."}, {"Time_Start": 2364.84, "Time_End": 2366.84, "Text": " TCP show is a really good program."}, {"Time_Start": 2366.84, "Time_End": 2370.84, "Text": " If you're trying to learn about TCPIP, I really recommend this program."}, {"Time_Start": 2370.84, "Time_End": 2373.84, "Text": " It's a program that's used in conjunction with TCP dump."}, {"Time_Start": 2373.84, "Time_End": 2378.84, "Text": " dump. TCP show essentially reads a TCP dump safe file"}, {"Time_Start": 2378.84, "Time_End": 2383.84, "Text": " provides a reasonably complete decode of Ethernet, Alp, RAP,"}, {"Time_Start": 2383.84, "Time_End": 2391.84, "Text": " IP, ICMP, UDP, and TCP headers and packets that match the Boolean expression."}, {"Time_Start": 2391.84, "Time_End": 2398.84, "Text": " All the dumps that showed on the screen in this presentation were done using the program TCP show."}, {"Time_Start": 2398.84, "Time_End": 2401.84, "Text": " I don't know how familiar people in here are with TCP dump,"}, {"Time_Start": 2401.84, "Time_End": 2402.84, "Text": " but it doesn't really provide an output."}, {"Time_Start": 2402.84, "Time_End": 2407.84, "Text": " and output that's really easy to determine what's going on with that information."}, {"Time_Start": 2407.84, "Time_End": 2413.84, "Text": " So both TCP show and TCP dump use in conjunction with each other are excellent tools"}, {"Time_Start": 2413.84, "Time_End": 2418.84, "Text": " to examine exactly what's going on with TCP IP."}, {"Time_Start": 2418.84, "Time_End": 2423.84, "Text": " Excuse, uh, hold on."}, {"Time_Start": 2423.84, "Time_End": 2430.84, "Text": " Email addresses on the screen is Punkus, P-U-N-K-I-S at Atrition.org."}, {"Time_Start": 2430.84, "Time_End": 2434.84, "Text": " For those of you who weren't in here before,"}, {"Time_Start": 2434.84, "Time_End": 2437.84, "Text": " who in here is familiar with attrition, just out of curiosity?"}, {"Time_Start": 2437.84, "Time_End": 2438.84, "Text": " A couple of people."}, {"Time_Start": 2438.84, "Time_End": 2442.84, "Text": " Just so everyone gets a heads up, we are going to be changing the focus on attrition."}, {"Time_Start": 2442.84, "Time_End": 2446.84, "Text": " There are going to be a lot of changes coming up in the near future on that,"}, {"Time_Start": 2446.84, "Time_End": 2447.84, "Text": " so keep your eyes on that."}, {"Time_Start": 2447.84, "Time_End": 2451.84, "Text": " We are going toward a more technical content with that."}, {"Time_Start": 2451.84, "Time_End": 2454.84, "Text": " So we'll change our focus a little bit on that."}, {"Time_Start": 2454.84, "Time_End": 2457.84, "Text": " You're not going to dump on your efforts."}, {"Time_Start": 2457.84, "Time_End": 2459.84, "Text": " We're not dumping anything."}, {"Time_Start": 2459.84, "Time_End": 2460.84, "Text": " We are ending a couple things."}, {"Time_Start": 2460.84, "Time_End": 2462.34, "Text": " we're going to finish on a couple of things."}, {"Time_Start": 2462.34, "Time_End": 2465.84, "Text": " There's a couple things that we feel we don't need to pursue anymore."}, {"Time_Start": 2465.84, "Time_End": 2469.84, "Text": " We think we've proven our point on a couple of the issues that we've been making."}, {"Time_Start": 2469.84, "Time_End": 2472.84, "Text": " The lot of sections will not go away."}, {"Time_Start": 2472.84, "Time_End": 2475.84, "Text": " So, reporters."}, {"Time_Start": 2479.84, "Time_End": 2481.84, "Text": " Okay, is there any other questions?"}, {"Time_Start": 2481.84, "Time_End": 2482.84, "Text": " Yes."}, {"Time_Start": 2482.84, "Time_End": 2484.84, "Text": " Yes."}, {"Time_Start": 2484.84, "Time_End": 2486.84, "Text": " Is that one in the face?"}, {"Time_Start": 2486.84, "Time_End": 2489.84, "Text": " What's that?"}, {"Time_Start": 2489.84, "Time_End": 2490.84, "Text": " Does that?"}, {"Time_Start": 2490.84, "Time_End": 2495.84, "Text": " He was asking if TCP show we'll do both Ethernet and token rings."}, {"Time_Start": 2495.84, "Time_End": 2496.84, "Text": " Is I correct?"}, {"Time_Start": 2496.84, "Time_End": 2498.84, "Text": " To my knowledge, it does Ethernet only."}, {"Time_Start": 2498.84, "Time_End": 2502.84, "Text": " Do you know that you don't myself?"}, {"Time_Start": 2502.84, "Time_End": 2504.84, "Text": " No."}, {"Time_Start": 2504.84, "Time_End": 2509.84, "Text": " Why doesn't it increase by one?"}, {"Time_Start": 2509.84, "Time_End": 2513.84, "Text": " Peace can be talking about this with the TCP vulnerabilities."}, {"Time_Start": 2513.84, "Time_End": 2516.84, "Text": " If it increases by one, it's to be very easily for an attacker"}, {"Time_Start": 2516.84, "Time_End": 2519.84, "Text": " because then basically a fake packet coming from wherever he wants to,"}, {"Time_Start": 2519.84, "Time_End": 2520.84, "Text": " to."}, {"Time_Start": 2520.84, "Time_End": 2523.84, "Text": " When they're receiving host to send back an acknowledgement number,"}, {"Time_Start": 2523.84, "Time_End": 2525.84, "Text": " you're going to know what the next number should be in that sequence,"}, {"Time_Start": 2525.84, "Time_End": 2528.84, "Text": " so it would be very easy to hijack a connection with that."}, {"Time_Start": 2528.84, "Time_End": 2535.84, "Text": " The older TCPIP stacks every second, they increase 128,000."}, {"Time_Start": 2535.84, "Time_End": 2538.84, "Text": " Every connection that's made increased by 64,000."}, {"Time_Start": 2538.84, "Time_End": 2542.84, "Text": " So with a little bit of luck on alert systems, it was a little bit easier to actually hijack"}, {"Time_Start": 2542.84, "Time_End": 2544.84, "Text": " a TCP session."}, {"Time_Start": 2544.84, "Time_End": 2548.84, "Text": " Yes."}, {"Time_Start": 2548.84, "Time_End": 2555.84, "Text": " UDP rarely is used anymore."}, {"Time_Start": 2555.84, "Time_End": 2559.84, "Text": " I mean, what's used, TFTP is one of the only stock applications"}, {"Time_Start": 2559.84, "Time_End": 2562.84, "Text": " that come with most systems that's used,"}, {"Time_Start": 2562.84, "Time_End": 2564.84, "Text": " that uses UDP anywhere."}, {"Time_Start": 2564.84, "Time_End": 2567.84, "Text": " Like I said before, it's just used for if you have a very"}, {"Time_Start": 2567.84, "Time_End": 2571.84, "Text": " non-crucial application, I guess I could say,"}, {"Time_Start": 2571.84, "Time_End": 2574.84, "Text": " where it's not really totally important that the data being"}, {"Time_Start": 2574.84, "Time_End": 2576.84, "Text": " sent across the weather is being acknowledged."}, {"Time_Start": 2576.84, "Time_End": 2578.84, "Text": " If you're just using a system where you want a very low,"}, {"Time_Start": 2578.84, "Time_End": 2580.84, "Text": " head, UDP would be a good time to use that."}, {"Time_Start": 2608.84, "Time_End": 2610.84, "Text": " I really don't think."}, {"Time_Start": 2610.84, "Time_End": 2613.84, "Text": " He asked about UDP being used with video transmissions."}, {"Time_Start": 2613.84, "Time_End": 2616.84, "Text": " I doubt you'd really actually want to,"}, {"Time_Start": 2616.84, "Time_End": 2620.84, "Text": " because you'd probably be dropping a lot of frames not actually knowing it."}, {"Time_Start": 2620.84, "Time_End": 2625.84, "Text": " So, typically video applications being sent across the internet are pretty intensive"}, {"Time_Start": 2625.84, "Time_End": 2629.84, "Text": " if you want to use something like TCP to send in information."}, {"Time_Start": 2629.84, "Time_End": 2633.84, "Text": " Yeah."}, {"Time_Start": 2633.84, "Time_End": 2637.84, "Text": " It's one there, you will see the frames are going to drop just by the out."}, {"Time_Start": 2637.84, "Time_End": 2643.84, "Text": " Yeah, it would be obvious, but for instance, if you have some kind of service where people are paying for this information,"}, {"Time_Start": 2643.84, "Time_End": 2648.84, "Text": " you're dropping frames, and obviously your video output is not going to look very good."}, {"Time_Start": 2648.84, "Time_End": 2653.84, "Text": " Then, I mean, it would be kind of up to the user that that's pushed that information across the wire."}, {"Time_Start": 2653.84, "Time_End": 2658.84, "Text": " Do you have a reason?"}, {"Time_Start": 2658.84, "Time_End": 2659.84, "Text": " True."}, {"Time_Start": 2659.84, "Time_End": 2664.84, "Text": " Yes."}, {"Time_Start": 2664.84, "Time_End": 2670.34, "Text": " The checks on, I'm not going to go into that."}, {"Time_Start": 2670.34, "Time_End": 2671.34, "Text": " That's a little more high level."}, {"Time_Start": 2671.34, "Time_End": 2674.34, "Text": " It's actually a little bit above what I'm working on right now."}, {"Time_Start": 2674.34, "Time_End": 2675.34, "Text": " I can't answer."}, {"Time_Start": 2675.34, "Time_End": 2680.34, "Text": " It's a hexadec decimal number that's generated by looking to examine the contents of the payload."}, {"Time_Start": 2680.34, "Time_End": 2686.34, "Text": " The same thing is done once it's received by its receiving hosts and to ensure the data is being received properly."}, {"Time_Start": 2690.34, "Time_End": 2692.34, "Text": " Any other questions?"}, {"Time_Start": 2692.34, "Time_End": 2694.34, "Text": " Comments, death threats."}, {"Time_Start": 2694.34, "Time_End": 2705.34, "Text": " threats."}, {"Time_Start": 2705.34, "Time_End": 2709.34, "Text": " What about it?"}, {"Time_Start": 2709.34, "Time_End": 2713.34, "Text": " There's not a time to live?"}, {"Time_Start": 2713.34, "Time_End": 2715.34, "Text": " Okay."}, {"Time_Start": 2715.34, "Time_End": 2719.34, "Text": " If he was asking what could be a potential problem with saying information across the wire"}, {"Time_Start": 2719.34, "Time_End": 2720.34, "Text": " without a time to live."}, {"Time_Start": 2720.34, "Time_End": 2724.32, "Text": " Obviously, if I'm saying information to a host on the internet, that's not actually"}, {"Time_Start": 2724.34, "Time_End": 2728.34, "Text": " up at that time, this information is going to be bouncing across the internet forever."}, {"Time_Start": 2728.34, "Time_End": 2730.34, "Text": " Let's say that host never comes back up."}, {"Time_Start": 2730.34, "Time_End": 2733.34, "Text": " This internet's always going to be balancing across the internet."}, {"Time_Start": 2733.34, "Time_End": 2735.34, "Text": " So you're going to cause a lot of overhead problems, obviously."}, {"Time_Start": 2735.34, "Time_End": 2738.34, "Text": " Hosts are dropping every day."}, {"Time_Start": 2742.34, "Time_End": 2744.34, "Text": " Using the TTL, they will."}, {"Time_Start": 2744.34, "Time_End": 2746.34, "Text": " Without the TCL, they will not."}, {"Time_Start": 2750.34, "Time_End": 2752.34, "Text": " Well, the TTL cannot be set above two weeks."}, {"Time_Start": 2752.34, "Time_End": 2753.34, "Text": " Well, the TTL cannot be set above two days."}, {"Time_Start": 2753.34, "Time_End": 2755.34, "Text": " cannot be set above 255, so."}, {"Time_Start": 2755.34, "Time_End": 2758.34, "Text": " There is an upper limit on that."}, {"Time_Start": 2758.34, "Time_End": 2761.34, "Text": " And back?"}, {"Time_Start": 2761.34, "Time_End": 2766.34, "Text": " With the question is with you that,"}, {"Time_Start": 2766.34, "Time_End": 2769.34, "Text": " the product out there,"}, {"Time_Start": 2769.34, "Time_End": 2774.34, "Text": " so that that's not going to be enough?"}, {"Time_Start": 2774.34, "Time_End": 2777.34, "Text": " What do you think about that?"}, {"Time_Start": 2777.34, "Time_End": 2781.34, "Text": " His questions with the exponential increase in the internet,"}, {"Time_Start": 2781.34, "Time_End": 2783.34, "Text": " more and more routers being pushed out"}, {"Time_Start": 2783.34, "Time_End": 2787.34, "Text": " there is there ever going to be a time when a time to live of 255 is not enough?"}, {"Time_Start": 2787.34, "Time_End": 2790.34, "Text": " Uh, at this point, no."}, {"Time_Start": 2790.34, "Time_End": 2792.34, "Text": " If you have that many hops is a bad network,"}, {"Time_Start": 2792.34, "Time_End": 2793.34, "Text": " apologies are."}, {"Time_Start": 2793.34, "Time_End": 2797.34, "Text": " No, typically, if you trace-fraught a host, even if you're"}, {"Time_Start": 2797.34, "Time_End": 2799.34, "Text": " trace-froading it to the other side of the world,"}, {"Time_Start": 2799.34, "Time_End": 2801.34, "Text": " you're probably not going to have more than 20 or 30 hops."}, {"Time_Start": 2801.34, "Time_End": 2805.34, "Text": " I've never done a trace-froll, or I've had probably more than 40 hobs."}, {"Time_Start": 2805.34, "Time_End": 2808.34, "Text": " So I think actually 255 is very reasonable."}, {"Time_Start": 2808.34, "Time_End": 2810.34, "Text": " I average about 8 to 60."}, {"Time_Start": 2810.34, "Time_End": 2811.34, "Text": " Right."}, {"Time_Start": 2811.34, "Time_End": 2812.34, "Text": " Yes."}, {"Time_Start": 2812.34, "Time_End": 2813.34, "Text": " Yes."}, {"Time_Start": 2813.34, "Time_End": 2816.34, "Text": " it's being done automatically by trace route."}, {"Time_Start": 2816.34, "Time_End": 2818.34, "Text": " Correct."}, {"Time_Start": 2818.34, "Time_End": 2824.34, "Text": " It is being done automatically by trace route."}, {"Time_Start": 2824.34, "Time_End": 2826.34, "Text": " Through our modifications, I think actually,"}, {"Time_Start": 2826.34, "Time_End": 2828.34, "Text": " route has written one where you can increase the blur."}, {"Time_Start": 2828.34, "Time_End": 2830.34, "Text": " That can be changed."}, {"Time_Start": 2830.34, "Time_End": 2834.34, "Text": " But that's the default that it sets it as is 30."}, {"Time_Start": 2834.34, "Time_End": 2837.34, "Text": " That's why sometimes if you're doing a trace route"}, {"Time_Start": 2837.34, "Time_End": 2839.34, "Text": " and you'll get your first three lines of information,"}, {"Time_Start": 2839.34, "Time_End": 2841.34, "Text": " then you'll get a couple rows of asterix."}, {"Time_Start": 2841.34, "Time_End": 2842.34, "Text": " It's succeeding."}, {"Time_Start": 2842.34, "Time_End": 2843.34, "Text": " It's time to live."}, {"Time_Start": 2843.34, "Time_End": 2847.34, "Text": " being dropped."}, {"Time_Start": 2847.34, "Time_End": 2850.34, "Text": " Any other questions?"}, {"Time_Start": 2854.34, "Time_End": 2857.34, "Text": " Actually, it depends on who you ask about it."}, {"Time_Start": 2857.34, "Time_End": 2860.34, "Text": " It's, some people say it's one, some people say it's other."}, {"Time_Start": 2860.34, "Time_End": 2863.34, "Text": " Typically, it's just how many hops?"}, {"Time_Start": 2863.34, "Time_End": 2868.34, "Text": " Yes."}, {"Time_Start": 2868.34, "Time_End": 2872.34, "Text": " If the urgency set automatic is related to the agency set automatic is related to the"}, {"Time_Start": 2872.34, "Time_End": 2876.34, "Text": " The urgency is automatically unless you actually build a program where you're constructing your own pack is."}, {"Time_Start": 2876.34, "Time_End": 2878.34, "Text": " It's set automatically."}, {"Time_Start": 2878.34, "Time_End": 2896.34, "Text": " Read TCIP volumes 1 through 3 and learn how to program and see."}, {"Time_Start": 2902.34, "Time_End": 2912.34, "Text": " Well, it does make a program called Libnet."}, {"Time_Start": 2912.34, "Time_End": 2914.34, "Text": " I'm not sure what his site even is these days."}, {"Time_Start": 2914.34, "Time_End": 2915.34, "Text": " I don't even know if it's up."}, {"Time_Start": 2915.34, "Time_End": 2917.34, "Text": " It's L-I-B-N-E-T."}, {"Time_Start": 2917.34, "Time_End": 2919.34, "Text": " And I know..."}, {"Time_Start": 2919.34, "Time_End": 2921.34, "Text": " It's the seatbox in library."}, {"Time_Start": 2921.34, "Time_End": 2923.34, "Text": " It's all the nasty fact for you."}, {"Time_Start": 2923.34, "Time_End": 2925.34, "Text": " I think it's a packet factory."}, {"Time_Start": 2925.34, "Time_End": 2927.34, "Text": " Okay, packet factory."}, {"Time_Start": 2927.34, "Time_End": 2929.34, "Text": " I believe is the new URL for that."}, {"Time_Start": 2929.34, "Time_End": 2931.34, "Text": " And actually they were supposed to be releasing a newer and"}, {"Time_Start": 2931.34, "Time_End": 2938.34, "Text": " a newer and bigger version of that in the real near future, I believe."}, {"Time_Start": 2941.34, "Time_End": 2944.34, "Text": " Any other questions?"}]}