{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Today, I'm going to introduce the next speaker, and I'm going to ask him to come up to the"
    },
    {
      "Time_Start": 30.0,
      "Time_End": 31.0,
      "Text": " stage."
    },
    {
      "Time_Start": 31.0,
      "Time_End": 37.0,
      "Text": " But I wanted to give a little background on what's been happening in the Macintosh scene,"
    },
    {
      "Time_Start": 37.0,
      "Time_End": 38.0,
      "Text": " as it were."
    },
    {
      "Time_Start": 38.0,
      "Time_End": 39.0,
      "Text": " A lot of people seem to think that Macintosh is unhackable."
    },
    {
      "Time_Start": 39.0,
      "Time_End": 40.0,
      "Text": " I read this numerous times."
    },
    {
      "Time_Start": 40.0,
      "Time_End": 41.0,
      "Text": " There was a recent article by Adam Penenberg that quoted somebody."
    },
    {
      "Time_Start": 41.0,
      "Time_End": 42.0,
      "Text": " They said, oh, you don't need a machine to get a Mac."
    },
    {
      "Time_Start": 42.0,
      "Time_End": 43.0,
      "Text": " Well, that's not true."
    },
    {
      "Time_Start": 43.0,
      "Time_End": 44.0,
      "Text": " It never has been."
    },
    {
      "Time_Start": 44.0,
      "Time_End": 70.0,
      "Text": " Back in, let me think, 1981, 1982, when the law first started, I started a Macintosh cracking"
    },
    {
      "Time_Start": 70.0,
      "Time_End": 71.0,
      "Text": " archive, hacking archive."
    },
    {
      "Time_Start": 71.0,
      "Time_End": 78.0,
      "Text": " I would keep little programs, little tools, Mac versions of Crack for new packard cracking"
    },
    {
      "Time_Start": 78.0,
      "Time_End": 79.0,
      "Text": " and other various tools."
    },
    {
      "Time_Start": 79.0,
      "Time_End": 80.0,
      "Text": " They were all for free, which was big back then."
    },
    {
      "Time_Start": 80.0,
      "Time_End": 81.0,
      "Text": " Some of the IDs from the Crackers for Macintosh."
    },
    {
      "Time_Start": 81.0,
      "Time_End": 82.0,
      "Text": " And I just put them up on the FTP site, and everybody laughed at me when I did it."
    },
    {
      "Time_Start": 82.0,
      "Time_End": 83.0,
      "Text": " And the other auth members didn't know much."
    },
    {
      "Time_Start": 83.0,
      "Time_End": 84.0,
      "Text": " It was like, nobody wants that stuff."
    },
    {
      "Time_Start": 84.0,
      "Time_End": 85.0,
      "Text": " And we put it up, and it was immediately a big hit."
    },
    {
      "Time_Start": 85.0,
      "Time_End": 86.0,
      "Text": " My little 20 meg FTP archive was a big hit."
    },
    {
      "Time_Start": 86.0,
      "Time_End": 87.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 87.0,
      "Time_End": 88.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 88.0,
      "Time_End": 89.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 89.0,
      "Time_End": 90.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 90.0,
      "Time_End": 91.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 91.0,
      "Time_End": 92.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 92.0,
      "Time_End": 93.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 93.0,
      "Time_End": 94.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 94.0,
      "Time_End": 95.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 95.0,
      "Time_End": 96.0,
      "Text": " It was a big hit."
    },
    {
      "Time_Start": 127.0,
      "Time_End": 131.36,
      "Text": " Irvine, which is now sold out, has been for a while and they will not be a volume 2."
    },
    {
      "Time_Start": 131.36,
      "Time_End": 132.72,
      "Text": " Very, very popular site."
    },
    {
      "Time_Start": 132.72,
      "Time_End": 142.56,
      "Text": " I was very surprised at how many other people out there were working with Macintoshes and"
    },
    {
      "Time_Start": 142.56,
      "Time_End": 143.56,
      "Text": " doing that sort of thing."
    },
    {
      "Time_Start": 143.56,
      "Time_End": 144.56,
      "Text": " So it's a very popular type topic."
    },
    {
      "Time_Start": 144.56,
      "Time_End": 149.44,
      "Text": " It's unusual because you don't hear about it very often."
    },
    {
      "Time_Start": 149.44,
      "Time_End": 157.44,
      "Text": " very often. You hear more about the NT, the Windows, Unix, nobody ever talks about macOS."
    },
    {
      "Time_Start": 157.44,
      "Time_End": 166.44,
      "Text": " So, RackMac is going strong, it's doing well, lots of hits, lots of people looking at it,"
    },
    {
      "Time_Start": 166.44,
      "Time_End": 175.44,
      "Text": " downloading stuff, uploading stuff. Rack released a CD, a thousand copies, sold out. But my"
    },
    {
      "Time_Start": 175.44,
      "Time_End": 181.44,
      "Text": " interest started to go elsewhere, and Rack has sort of fallen by the wayside as I've"
    },
    {
      "Time_Start": 181.44,
      "Time_End": 185.44,
      "Text": " taken over Hacker News and some other duties. And unfortunately, Rack hasn't been updated"
    },
    {
      "Time_Start": 185.44,
      "Time_End": 189.44,
      "Text": " in a long time, and a lot of people have sent me emails saying, hey, when are you going"
    },
    {
      "Time_Start": 189.44,
      "Time_End": 191.44,
      "Text": " to update Rack, when are you going to put new files up, when are you going to do this,"
    },
    {
      "Time_Start": 191.44,
      "Time_End": 197.44,
      "Text": " when are you going to do that, fix the broken links, etc., etc. So, I get a lot of mail"
    },
    {
      "Time_Start": 197.44,
      "Time_End": 202.44,
      "Text": " on that, and I just, unfortunately, I don't have time. And when Rack started, it was the"
    },
    {
      "Time_Start": 202.44,
      "Time_End": 210.44,
      "Text": " only resource to get Macintosh utilities. And so, I felt it was sort of a duty to put"
    },
    {
      "Time_Start": 210.44,
      "Time_End": 215.44,
      "Text": " it up. But lately, recently, the last year or two, we've had some other people who have"
    },
    {
      "Time_Start": 215.44,
      "Time_End": 222.44,
      "Text": " sort of taken over the lead, as it were, for Macintosh hacking. And that's who's here today."
    },
    {
      "Time_Start": 222.44,
      "Time_End": 232.44,
      "Text": " The Freeking's Macintosh archives in securemac.com is now probably the premier Macintosh hacking"
    },
    {
      "Time_Start": 232.44,
      "Time_End": 239.44,
      "Text": " sites to get your information and your tools. So, what I'm going to do today is I'm going"
    },
    {
      "Time_Start": 239.44,
      "Time_End": 244.44,
      "Text": " to officially declare the Rack Mac archives in mothballs. It's not going to go down, I'm"
    },
    {
      "Time_Start": 244.44,
      "Time_End": 250.44,
      "Text": " not going to take the site down, I'm not going to remove any of the software that's up there,"
    },
    {
      "Time_Start": 250.44,
      "Time_End": 254.44,
      "Text": " but I will officially mothball it so that people won't expect it to be updated. And"
    },
    {
      "Time_Start": 254.44,
      "Time_End": 260.44,
      "Text": " I'm going to link to Freeky here, Freeky's Macintosh archives, and basically pass the"
    },
    {
      "Time_Start": 260.44,
      "Time_End": 269.44,
      "Text": " symbolic coupon from my archive over to his so that we can now have an official site or"
    },
    {
      "Time_Start": 269.44,
      "Time_End": 274.44,
      "Text": " resource where you can get your Macintosh information. So, without further ado, I will"
    },
    {
      "Time_Start": 274.44,
      "Time_End": 278.44,
      "Text": " introduce to you Freeky from Freeky's Macintosh archives."
    },
    {
      "Time_Start": 278.44,
      "Time_End": 293.44,
      "Text": " All right. I don't know how many of you people actually own Macs or how many people just..."
    },
    {
      "Time_Start": 293.44,
      "Time_End": 302.44,
      "Text": " All right. I'm going to go over some different stuff here. Macintosh security, what macOS"
    },
    {
      "Time_Start": 302.44,
      "Time_End": 310.44,
      "Text": " offers in security, the programs out there, and the people who make the security programs."
    },
    {
      "Time_Start": 310.44,
      "Time_End": 336.44,
      "Text": " So, all right. Stuff."
    },
    {
      "Time_Start": 337.44,
      "Time_End": 347.44,
      "Text": " The security software out there for the Mac, it's pretty simple. It's stupid. People put"
    },
    {
      "Time_Start": 347.44,
      "Time_End": 354.44,
      "Text": " out the software out there, don't put any time into it. They actually just do it for the"
    },
    {
      "Time_Start": 354.44,
      "Time_End": 362.44,
      "Text": " money. Yeah, there we go. There's a few companies out there that actually have worked with me"
    },
    {
      "Time_Start": 362.44,
      "Time_End": 370.44,
      "Text": " and Freeky's Macintosh archives, securemac.com, to improve their software. Freeky's Mac archives"
    },
    {
      "Time_Start": 370.44,
      "Time_End": 376.44,
      "Text": " puts out the cracks for all different things. One of the software out there made by Power"
    },
    {
      "Time_Start": 376.44,
      "Time_End": 384.44,
      "Text": " On Software is called On Guard. Right now they are, in my opinion, one of the best software"
    },
    {
      "Time_Start": 384.44,
      "Time_End": 389.44,
      "Text": " companies out there for the Mac because they actually care about it. Most of the other"
    },
    {
      "Time_Start": 389.44,
      "Time_End": 399.44,
      "Text": " software companies out there just kind of say, I don't care, your site's nothing. So when"
    },
    {
      "Time_Start": 399.44,
      "Time_End": 410.44,
      "Text": " No Guard was released, it kind of just removes the wonderful little encryption that it uses."
    },
    {
      "Time_Start": 411.44,
      "Time_End": 417.44,
      "Text": " And a couple days later they fixed that and made it stronger. And this isn't my computer."
    },
    {
      "Time_Start": 417.44,
      "Time_End": 433.44,
      "Text": " All right. Magic Key is an Apple Talk brute force cracker. It's made by someone named"
    },
    {
      "Time_Start": 434.44,
      "Time_End": 449.44,
      "Text": " Yeah. It's made by System Cowboy. He's worked with me in creating some of the software out"
    },
    {
      "Time_Start": 449.44,
      "Time_End": 455.44,
      "Text": " there. He's one of the people that keeps Freeky's Mac archives running because people check"
    },
    {
      "Time_Start": 455.44,
      "Time_End": 461.44,
      "Text": " back daily to the site because they want to know what's out there. What this program does"
    },
    {
      "Time_Start": 461.44,
      "Time_End": 468.44,
      "Text": " is it brute force attacks the Apple Talk password file for the server, which we're not running"
    },
    {
      "Time_Start": 468.44,
      "Time_End": 481.44,
      "Text": " on here. And it spits out the passwords. Pretty nifty stuff."
    },
    {
      "Time_Start": 481.44,
      "Time_End": 497.44,
      "Text": " All right. Other software out there, like At Ease, who out there actually uses At Ease still?"
    },
    {
      "Time_Start": 497.44,
      "Time_End": 508.44,
      "Text": " Nobody? All right. At Ease is the simplest program out there to actually bypass those 100"
    },
    {
      "Time_Start": 508.44,
      "Time_End": 518.44,
      "Text": " different ways. System 7.6 is going to have a kind of 7, 7, 8, 7. It's going to have a"
    },
    {
      "Time_Start": 518.44,
      "Time_End": 524.44,
      "Text": " beefed up version of At Ease that supports encryption and other nifty stuff like that."
    },
    {
      "Time_Start": 524.44,
      "Time_End": 530.44,
      "Text": " So they're going to try to bring it back. Different ways to bypass At Ease, startup disk,"
    },
    {
      "Time_Start": 530.44,
      "Time_End": 542.44,
      "Text": " space bar, shift key, file replacement. Turn it off. And who out there uses foolproof?"
    },
    {
      "Time_Start": 542.44,
      "Time_End": 552.44,
      "Text": " One person? All right. Foolproof is kind of fun. School districts like to use it. K-12"
    },
    {
      "Time_Start": 552.44,
      "Time_End": 561.44,
      "Text": " environments and some spiffy agencies out there who didn't want to be named. But they use it for"
    },
    {
      "Time_Start": 561.44,
      "Time_End": 571.44,
      "Text": " their security environment. And most everybody has come to realize that it's not secure. And the"
    },
    {
      "Time_Start": 571.44,
      "Time_End": 579.44,
      "Text": " ways to get past it, there's programs out there that will decrypt the password. There's, again,"
    },
    {
      "Time_Start": 579.44,
      "Time_End": 587.44,
      "Text": " the startup disk, space bar, shift key, file replacement. It's hot in here. All right. For"
    },
    {
      "Time_Start": 587.44,
      "Time_End": 596.44,
      "Text": " remote security, like your Mac is pretty secure remotely unless you actually put something on it"
    },
    {
      "Time_Start": 596.44,
      "Time_End": 604.44,
      "Text": " that makes it insecure, like a server. Program out there made by power on software, screen to"
    },
    {
      "Time_Start": 604.44,
      "Time_End": 617.44,
      "Text": " screen. It's like Timbuk2 or PC anywhere. Somebody named Prozac made a crack for it. It will let you"
    },
    {
      "Time_Start": 617.44,
      "Time_End": 623.44,
      "Text": " log on as administrator from any computer. Power on software doesn't know about it yet. But it will"
    },
    {
      "Time_Start": 623.44,
      "Time_End": 633.44,
      "Text": " be out there. And the school districts will use it a lot to watch people. Another one out there"
    },
    {
      "Time_Start": 633.44,
      "Time_End": 641.44,
      "Text": " is made by a guy named Rito, remote extension. Has anybody ever used that? A couple. All right."
    },
    {
      "Time_Start": 641.44,
      "Time_End": 649.44,
      "Text": " That's a cool program. His new version has keystroke logger. What it basically is, it's like"
    },
    {
      "Time_Start": 649.44,
      "Time_End": 656.44,
      "Text": " back orifice. You guys know it's a little extension that sits on the computer and lets somebody log"
    },
    {
      "Time_Start": 656.44,
      "Time_End": 665.44,
      "Text": " in remotely, take control of the computer, do file sharing, all that other stuff. He kind of retired"
    },
    {
      "Time_Start": 665.44,
      "Time_End": 670.44,
      "Text": " doing that, but I'm sure his source code will be out there. I mean, he could have used a better"
    },
    {
      "Time_Start": 670.44,
      "Time_End": 678.44,
      "Text": " programming language, but it's kind of cool. For web servers, the one that comes bundled with"
    },
    {
      "Time_Start": 678.44,
      "Time_End": 689.44,
      "Text": " OSA is the MS personal web server. That's cool. There was a denial of service attack for that. It"
    },
    {
      "Time_Start": 689.44,
      "Time_End": 697.44,
      "Text": " was fixed pretty quick. Another problem I noticed with it is when I tried to remove it, I left one"
    },
    {
      "Time_Start": 697.44,
      "Time_End": 705.44,
      "Text": " of the extensions on and my computer wouldn't start up ever again. So it's a good server. Y2K"
    },
    {
      "Time_Start": 705.44,
      "Time_End": 713.44,
      "Text": " Mac, not going to be any. So all you Windows people, everybody else who has problems, get a Mac."
    },
    {
      "Time_Start": 713.44,
      "Time_End": 731.44,
      "Text": " I started in the Mac community because weasel site was turning down and I wanted to do the best"
    },
    {
      "Time_Start": 731.44,
      "Time_End": 739.44,
      "Text": " site out there, so I put up the site. Secure Mac.com is a Macintosh security site that covers it in"
    },
    {
      "Time_Start": 739.44,
      "Time_End": 745.44,
      "Text": " the nice way so school districts and teachers and parents won't get pissed off if their kids are"
    },
    {
      "Time_Start": 745.44,
      "Time_End": 763.44,
      "Text": " looking at freak's Mac archives. Let me see if I have that locally. Maybe. Oh, yeah, it was"
    },
    {
      "Time_Start": 763.44,
      "Time_End": 769.44,
      "Text": " supposed to have a tower computer down here, but it never got down here for some reason. So thank you"
    },
    {
      "Time_Start": 769.44,
      "Time_End": 782.44,
      "Text": " and thanks for the guy who let me use this computer. No guard. What this program does, it's for"
    },
    {
      "Time_Start": 782.44,
      "Time_End": 790.44,
      "Text": " power on software's on guard. It has the emergency code when you log in. When you have on guard on"
    },
    {
      "Time_Start": 790.44,
      "Time_End": 796.44,
      "Text": " your computer, you'll see the log in screen. If you type in emergency, it will come up with the code."
    },
    {
      "Time_Start": 796.44,
      "Time_End": 801.44,
      "Text": " You're supposed to call power on software and tell them and they'll give you a recovery password."
    },
    {
      "Time_Start": 801.44,
      "Time_End": 824.44,
      "Text": " This program does that without you calling them, so anybody could get an administrator password again."
    },
    {
      "Time_Start": 824.44,
      "Time_End": 834.44,
      "Text": " For other Macintosh security programs, there's Empower Pro that's more for, it's used in more"
    },
    {
      "Time_Start": 834.44,
      "Time_End": 846.44,
      "Text": " professional businesses. It's pretty cool software. It's rather secure compared to the other ones."
    },
    {
      "Time_Start": 846.44,
      "Time_End": 862.44,
      "Text": " I can't use the mouse. Some other things I like to talk about are alternative OS's for the Macintosh."
    },
    {
      "Time_Start": 862.44,
      "Time_End": 872.44,
      "Text": " These make the Mac environment more or less secure. Rather less secure because you're dealing with"
    },
    {
      "Time_Start": 873.44,
      "Time_End": 879.44,
      "Text": " multiple platforms and each one has their own security problems. OSX has its own problems. You're"
    },
    {
      "Time_Start": 879.44,
      "Time_End": 886.44,
      "Text": " dealing in both BSD environment and Mac OS environment. As far as server, it's really cool. It works"
    },
    {
      "Time_Start": 886.44,
      "Time_End": 900.44,
      "Text": " really well, but you have twice the security to deal with. And there's lots of denial of service attacks"
    },
    {
      "Time_Start": 901.44,
      "Time_End": 916.44,
      "Text": " which will be on Freaks Macintosh archives in the morning. There's one exploit for OSX right now. It's"
    },
    {
      "Time_Start": 916.44,
      "Time_End": 926.44,
      "Text": " just a CGI buffer overflow which makes the computer go wacko and it dies. But there's going to be more"
    },
    {
      "Time_Start": 926.44,
      "Time_End": 940.44,
      "Text": " out in the morning. There's going to be a remote kind of exploit to get root. That will be out in the"
    },
    {
      "Time_Start": 940.44,
      "Time_End": 949.44,
      "Text": " morning of the day after that. Whenever I wake up. Other software out for the Mac that I suggest you"
    },
    {
      "Time_Start": 950.44,
      "Time_End": 956.44,
      "Text": " use if you want to get more into the security part of it. Res editor which is a resource editor which is"
    },
    {
      "Time_Start": 956.44,
      "Time_End": 964.44,
      "Text": " good for changing stuff. If you have that on a floppy, it will save your life sometimes. Mac bugs, good for"
    },
    {
      "Time_Start": 964.44,
      "Time_End": 970.44,
      "Text": " the people out there who like to crack the software. I don't know who would do that, but it's out there."
    },
    {
      "Time_Start": 971.44,
      "Time_End": 983.44,
      "Text": " Mac paint because it's the best little art program out there. And resourcer. As far as the remote extension,"
    },
    {
      "Time_Start": 983.44,
      "Time_End": 992.44,
      "Text": " Guido has gotten a girlfriend, so he's kind of turned over the project and realized that real basic sucks for a"
    },
    {
      "Time_Start": 992.44,
      "Time_End": 1007.44,
      "Text": " language. So that's going to be rewritten by somebody named, more information will be on the web page"
    },
    {
      "Time_Start": 1007.44,
      "Time_End": 1015.44,
      "Text": " tomorrow. A nifty little program that's going to be out, it's going to be called Fink. It's made by a guy"
    },
    {
      "Time_Start": 1015.44,
      "Time_End": 1024.44,
      "Text": " named Jindal. He's helped me out a lot. There's many of exploits and denial of service attacks. Everything's"
    },
    {
      "Time_Start": 1024.44,
      "Time_End": 1034.44,
      "Text": " supported for Unix, for Windows. This guy is making a program that will change the Unix source code and allow it"
    },
    {
      "Time_Start": 1034.44,
      "Time_End": 1042.44,
      "Text": " as a plug-in and you'll be able to do all of that fun nifty attacks, root, all that stuff from your Mac. So you just"
    },
    {
      "Time_Start": 1042.44,
      "Time_End": 1052.44,
      "Text": " drop it in the folder. A little bit of tweaking would need to be done, but he's all up for just doing it. It's pretty"
    },
    {
      "Time_Start": 1052.44,
      "Time_End": 1063.44,
      "Text": " cool. For all you people who like to look at source code, you can take a look at that. It's made by Prozac. It's a"
    },
    {
      "Time_Start": 1063.44,
      "Time_End": 1071.44,
      "Text": " pretty cool program. It cracks Authenticate, which is a Macintosh security program. Another one of those programs"
    },
    {
      "Time_Start": 1071.44,
      "Time_End": 1084.44,
      "Text": " that you need to make money. As far as keystroke loggers detection, there really isn't any internet detection"
    },
    {
      "Time_Start": 1084.44,
      "Time_End": 1093.44,
      "Text": " intrusion software for the Macintosh. There's schools. Everybody has problems with keystrokes, key loggers. You can't"
    },
    {
      "Time_Start": 1093.44,
      "Time_End": 1101.44,
      "Text": " tell when they're installed. You can make it so it's not noticeable. A program will be released on that to actually"
    },
    {
      "Time_Start": 1101.44,
      "Time_End": 1109.44,
      "Text": " remove and show the log files for it. If you have invisible Oasis on your computer, you make it invisible, you change the"
    },
    {
      "Time_Start": 1109.44,
      "Time_End": 1121.44,
      "Text": " extension name to some system signing name, you can log everybody's strokes forever. Are there any questions?"
    },
    {
      "Time_Start": 1121.44,
      "Time_End": 1140.44,
      "Text": " Hotline servers are kind of secure. They actually update it once in a while. Hotline communications is nifty. Check out"
    },
    {
      "Time_Start": 1140.44,
      "Time_End": 1155.44,
      "Text": " Coracho. Coracho is a file transfer program like Hotline, chat, everything. It is good. It supports multiple servers. People use it to"
    },
    {
      "Time_Start": 1155.44,
      "Time_End": 1166.44,
      "Text": " download shareware and other programs like that and to meet people. Hotline, there has been some insecurities with it, making links to"
    },
    {
      "Time_Start": 1167.44,
      "Time_End": 1175.44,
      "Text": " people's hard disks so you can actually download anything from their disk, upload a file, whatever, .lnk, and you'd have access to"
    },
    {
      "Time_Start": 1175.44,
      "Time_End": 1185.44,
      "Text": " that. As far as denial of service attacks, there have been a few for mostly just sending login requests and server requests."
    },
    {
      "Time_Start": 1185.44,
      "Time_End": 1201.44,
      "Text": " There's a program on my website which isn't here, but it deals with Hotline security. It has a good document on it and how the actual"
    },
    {
      "Time_Start": 1202.44,
      "Time_End": 1226.44,
      "Text": " protocol works for it. It's good to look up at. Anybody else? Yep. The Apple network assistant. Yeah, I haven't used it for back"
    },
    {
      "Time_Start": 1226.44,
      "Time_End": 1252.44,
      "Text": " orifice type stuff. All right. We'll have people take a look at that since it's cool. Anybody else?"
    },
    {
      "Time_Start": 1253.44,
      "Time_End": 1263.44,
      "Text": " How secure is Mac DNS? I'm not quite sure about that. I haven't really dealt with Mac DNS. There's been a lot of good reviews for it as far as"
    },
    {
      "Time_Start": 1264.44,
      "Time_End": 1288.44,
      "Text": " software, but those don't matter. There is a poisoning attack for most DNS servers. Is there one for Mac? What is it? Cool. Anybody else?"
    },
    {
      "Time_Start": 1288.44,
      "Time_End": 1316.44,
      "Text": " My address is freaky.staticusers.net. Freaky, F-R-E-A-K-Y.staticusers.net. Or www.securemac.com. Your choice. Anybody else?"
    },
    {
      "Time_Start": 1316.44,
      "Time_End": 1326.44,
      "Text": " All right. Would anybody like to know about any other security products that they may use in their office, work, home? All right."
    },
    {
      "Time_Start": 1326.44,
      "Time_End": 1351.44,
      "Text": " If Secure does, there was a new version of BetterTelnet SSH that came out about a week or so ago. So they've been working on that. It hasn't been very complete or successful yet."
    },
    {
      "Time_Start": 1351.44,
      "Time_End": 1380.44,
      "Text": " Excuse me? For the Mac? Cool. FDtelnet? Niftytelnet. All right. Yeah, I've used that. Nobody could use it in the U.S. Don't do it."
    },
    {
      "Time_Start": 1381.44,
      "Time_End": 1400.44,
      "Text": " Anybody else? Any suggestions of what I should talk about more?"
    },
    {
      "Time_Start": 1400.44,
      "Time_End": 1412.44,
      "Text": " Besides what? Throwing out a window?"
    },
    {
      "Time_Start": 1413.44,
      "Time_End": 1426.44,
      "Text": " Fun malicious things you could do to a Mac. Well, it depends on how smart the user is who uses it. There's extensions out there that'll just screw with their minds."
    },
    {
      "Time_Start": 1426.44,
      "Time_End": 1439.44,
      "Text": " Malicious things, put keystroke loggers on it, put remote extension on it, good program. You could really screw with people's minds."
    },
    {
      "Time_Start": 1439.44,
      "Time_End": 1466.44,
      "Text": " If they're over a network, you could send out messages and other things like that."
    },
    {
      "Time_Start": 1466.44,
      "Time_End": 1480.44,
      "Text": " There's an extension control panel out there that'll make your Mac look like Windows. I do know of something called Go Mac. It'll give you a little start bar. As far as a full display, I'm not sure of that."
    },
    {
      "Time_Start": 1480.44,
      "Time_End": 1509.44,
      "Text": " Go Mac sucks."
    },
    {
      "Time_Start": 1510.44,
      "Time_End": 1532.44,
      "Text": " Wake up. Wake up. Die. Come back. All right. So don't use Go Mac, suggestion of that guy over there."
    },
    {
      "Time_Start": 1533.44,
      "Time_End": 1550.44,
      "Text": " No, I'll restart. No, I, no. Any other questions? Any software?"
    },
    {
      "Time_Start": 1550.44,
      "Time_End": 1567.44,
      "Text": " X server for Mac, a good one. There's one you don't have to pay for. Go to Hotline, look for a shareware version. And I think it really crashed. Hold on."
    },
    {
      "Time_Start": 1580.44,
      "Time_End": 1593.44,
      "Text": " These things rock."
    },
    {
      "Time_Start": 1594.44,
      "Time_End": 1612.44,
      "Text": " Yes, there is. When the Macs read the disk, there are viruses out there. There haven't been any new viruses out there for the longest time. So any cheap program like Disinfectant, which has been discontinued for about a year, it'll catch it though."
    },
    {
      "Time_Start": 1612.44,
      "Time_End": 1634.44,
      "Text": " And you can execute on, mess with the B-tree on it. Just a little fun and annoying stuff like that. And more Mac virus stuff."
    },
    {
      "Time_Start": 1634.44,
      "Time_End": 1663.44,
      "Text": " I need some technical support here. Yeah. All right. We're going to reboot into Linux. Alternative OS, maybe. I'm trying to find the power key on this little sucker."
    },
    {
      "Time_Start": 1664.44,
      "Time_End": 1686.44,
      "Text": " No Go. I tried it. There. Power! Oh, that was the enter key I was holding down with it."
    },
    {
      "Time_Start": 1686.44,
      "Time_End": 1706.44,
      "Text": " Within a week, I was told by some member of some group that it would be open, the source code, so that'll be out within a week from some of our programmers."
    },
    {
      "Time_Start": 1706.44,
      "Time_End": 1727.44,
      "Text": " There's a program out there currently, Mac Back Orifice. It doesn't support really anything, but it'll still let you connect, so you can be cool and own Windows boxes. Any other questions?"
    },
    {
      "Time_Start": 1728.44,
      "Time_End": 1748.44,
      "Text": " Yep. You in the corner. All right. Give me the disk. Sure, of course."
    },
    {
      "Time_Start": 1749.44,
      "Time_End": 1771.44,
      "Text": " Password protection program. As far as startup or file security, On Guard, it works pretty well, even though it's easily hackable."
    },
    {
      "Time_Start": 1772.44,
      "Time_End": 1784.44,
      "Text": " We won't export outside of the U.S. either. So go to Hotline."
    },
    {
      "Time_Start": 1785.44,
      "Time_End": 1799.44,
      "Text": " Oh, yeah. This is a pretty cool computer. I'm taking it home with me. Any questions?"
    },
    {
      "Time_Start": 1799.44,
      "Time_End": 1819.44,
      "Text": " Private file. I haven't actually checked on that, but I did e-mail the author of most of the encryption programs out there, and I remember getting a not-so-technical response back, a generic, hey, it's secure."
    },
    {
      "Time_Start": 1819.44,
      "Time_End": 1843.44,
      "Text": " So if you trust him. Any other questions?"
    },
    {
      "Time_Start": 1844.44,
      "Time_End": 1866.44,
      "Text": " All right. Now that we're back up again, Keykiller is a program for keys off. All it does is go to the pref file and cracks it, and it turns keys off off for extension 1.3."
    },
    {
      "Time_Start": 1867.44,
      "Time_End": 1874.44,
      "Text": " And, of course, the company of the software company hasn't made a crack for it, a fix for the crack yet."
    },
    {
      "Time_Start": 1875.44,
      "Time_End": 1891.44,
      "Text": " You have any questions, sir? Anything else?"
    },
    {
      "Time_Start": 1892.44,
      "Time_End": 1915.44,
      "Text": " For Norton disk lock, I'd have to think. I don't know any offhand, but if it is, it will be on the site, freaky.staticusers.net, when I wake up."
    },
    {
      "Time_Start": 1916.44,
      "Time_End": 1922.44,
      "Text": " So what other software programs do people use out there in their home and office?"
    },
    {
      "Time_Start": 1924.44,
      "Time_End": 1936.44,
      "Text": " Word dialers. As far as word dialers, a guy named Simon says, is he in the crowd? You want to come up here?"
    },
    {
      "Time_Start": 1937.44,
      "Time_End": 1941.44,
      "Text": " He was actually going to demonstrate Seek and Destroy 4."
    },
    {
      "Time_Start": 1951.44,
      "Time_End": 1960.44,
      "Text": " Okay. I have three disks for special people out there. Seek and Destroy 4, it's a new word dialer for the Mac platform."
    },
    {
      "Time_Start": 1961.44,
      "Time_End": 1967.44,
      "Text": " All the way in the back. In the front. And hop over there."
    },
    {
      "Time_Start": 1975.44,
      "Time_End": 1979.44,
      "Text": " Let's see. It will be up on his site when he wakes up also."
    },
    {
      "Time_Start": 1980.44,
      "Time_End": 1987.44,
      "Text": " If you want to get it, if any of you know of Apple Communications, they'll probably have it."
    },
    {
      "Time_Start": 1988.44,
      "Time_End": 1992.44,
      "Text": " Ebola, run by Vaccine. I don't know if he's in the crowd."
    },
    {
      "Time_Start": 1993.44,
      "Time_End": 1995.44,
      "Text": " Okay, good. Apple's dead. Thank God."
    },
    {
      "Time_Start": 1996.44,
      "Time_End": 2001.44,
      "Text": " You can get it at Ebola or on Cracho. I run a Cracho server called..."
    },
    {
      "Time_Start": 2003.44,
      "Time_End": 2005.44,
      "Text": " Yeah, Apple's dead, jackass."
    },
    {
      "Time_Start": 2006.44,
      "Time_End": 2007.44,
      "Text": " Sorry."
    },
    {
      "Time_Start": 2009.44,
      "Time_End": 2014.44,
      "Text": " Yeah, you can get it on Acid, which is acid.emsec.net, I believe."
    },
    {
      "Time_Start": 2016.44,
      "Time_End": 2021.44,
      "Text": " Okay, I'll see if this is actually the disk that has it. Does it have a floppy? No, it doesn't."
    },
    {
      "Time_Start": 2022.44,
      "Time_End": 2030.44,
      "Text": " Okay, well, since we don't have a computer here to use it, I'll just talk a little bit about it and what it's going to be leading up to."
    },
    {
      "Time_Start": 2031.44,
      "Time_End": 2034.44,
      "Text": " It's new. It actually works as an easier interface."
    },
    {
      "Time_Start": 2035.44,
      "Time_End": 2038.44,
      "Text": " I don't know. Let's see where to go."
    },
    {
      "Time_Start": 2039.44,
      "Time_End": 2041.44,
      "Text": " I'm trying to remember because I have to look at it."
    },
    {
      "Time_Start": 2044.44,
      "Time_End": 2047.44,
      "Text": " The future release is actually going to support multiple modems."
    },
    {
      "Time_Start": 2049.44,
      "Time_End": 2054.44,
      "Text": " It's not like a super duper any change from any word out that's out there now,"
    },
    {
      "Time_Start": 2055.44,
      "Time_End": 2062.44,
      "Text": " except that it's kind of like the predecessor, or it's going to be the predecessor of the Lightman project."
    },
    {
      "Time_Start": 2063.44,
      "Time_End": 2065.44,
      "Text": " This guy named Quest is working on."
    },
    {
      "Time_Start": 2066.44,
      "Time_End": 2069.44,
      "Text": " The Lightman project is actually going to be..."
    },
    {
      "Time_Start": 2070.44,
      "Time_End": 2074.44,
      "Text": " He went out to make the best word out for the Macintosh and add features that other systems have,"
    },
    {
      "Time_Start": 2075.44,
      "Time_End": 2078.44,
      "Text": " that us poor Mac OS souls don't have in a word out."
    },
    {
      "Time_Start": 2079.44,
      "Time_End": 2082.44,
      "Text": " It's going to support error code databases."
    },
    {
      "Time_Start": 2083.44,
      "Time_End": 2085.44,
      "Text": " Let's see, it's going to have..."
    },
    {
      "Time_Start": 2086.44,
      "Time_End": 2088.44,
      "Text": " So you can stick in a WAV file or a simple send or whatever,"
    },
    {
      "Time_Start": 2089.44,
      "Time_End": 2091.44,
      "Text": " and saying like, oh, I'm sorry, wrong number."
    },
    {
      "Time_Start": 2092.44,
      "Time_End": 2094.44,
      "Text": " So when you call it, it'll just play that if it doesn't get a carrier."
    },
    {
      "Time_Start": 2095.44,
      "Time_End": 2097.44,
      "Text": " Probably going to be fax recognition."
    },
    {
      "Time_Start": 2099.44,
      "Time_End": 2104.44,
      "Text": " It's going to have a blacklist so you can type in local numbers of where..."
    },
    {
      "Time_Start": 2105.44,
      "Time_End": 2113.44,
      "Text": " Don't dial 911. Don't dial the police department or your local federal investigation places."
    },
    {
      "Time_Start": 2114.44,
      "Time_End": 2116.44,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2117.44,
      "Time_End": 2123.44,
      "Text": " Also, it's going to have a terminal, which is going to show you everything that's being sent to the modem."
    },
    {
      "Time_Start": 2124.44,
      "Time_End": 2127.44,
      "Text": " So if there are any kind of problems, you'll be able to figure it out and take a look at."
    },
    {
      "Time_Start": 2128.44,
      "Time_End": 2132.44,
      "Text": " Easier readouts. It's not just going to be a bunch of garbled text with empty boxes in there,"
    },
    {
      "Time_Start": 2133.44,
      "Time_End": 2135.44,
      "Text": " and wondering what the hell is going on."
    },
    {
      "Time_Start": 2136.44,
      "Time_End": 2138.44,
      "Text": " Trying to think what else it supports."
    },
    {
      "Time_Start": 2138.44,
      "Time_End": 2140.44,
      "Text": " I don't know, any questions so far about it?"
    },
    {
      "Time_Start": 2141.44,
      "Time_End": 2143.44,
      "Text": " Right now it's in beta, beta 3."
    },
    {
      "Time_Start": 2144.44,
      "Time_End": 2148.44,
      "Text": " It's private, so you can't get it and you won't get it until it's public data."
    },
    {
      "Time_Start": 2149.44,
      "Time_End": 2151.44,
      "Text": " No, you can distribute those."
    },
    {
      "Time_Start": 2152.44,
      "Time_End": 2154.44,
      "Text": " That's for that."
    },
    {
      "Time_Start": 2155.44,
      "Time_End": 2157.44,
      "Text": " Any questions at all?"
    },
    {
      "Time_Start": 2158.44,
      "Time_End": 2160.44,
      "Text": " I don't know what else to say."
    },
    {
      "Time_Start": 2161.44,
      "Time_End": 2163.44,
      "Text": " No. Fuck on."
    },
    {
      "Time_Start": 2164.44,
      "Time_End": 2166.44,
      "Text": " It'll stick in the CD drive."
    },
    {
      "Time_Start": 2166.44,
      "Time_End": 2168.44,
      "Text": " No."
    },
    {
      "Time_Start": 2169.44,
      "Time_End": 2171.44,
      "Text": " Okay."
    },
    {
      "Time_Start": 2172.44,
      "Time_End": 2174.44,
      "Text": " That's about it for that."
    },
    {
      "Time_Start": 2175.44,
      "Time_End": 2181.44,
      "Text": " So if there are no questions, I will start making beatbox noises into the microphone in three seconds."
    },
    {
      "Time_Start": 2182.44,
      "Time_End": 2184.44,
      "Text": " Two, one."
    },
    {
      "Time_Start": 2193.44,
      "Time_End": 2195.44,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 2196.44,
      "Time_End": 2198.44,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2201.44,
      "Time_End": 2203.44,
      "Text": " Support your local freakers."
    },
    {
      "Time_Start": 2204.44,
      "Time_End": 2206.44,
      "Text": " One question."
    },
    {
      "Time_Start": 2207.44,
      "Time_End": 2209.44,
      "Text": " You mentioned it could play a WAV file. Is that supported for all modems?"
    },
    {
      "Time_Start": 2210.44,
      "Time_End": 2215.44,
      "Text": " Right now, I don't have any kind of beta that has that feature supported yet."
    },
    {
      "Time_Start": 2216.44,
      "Time_End": 2218.44,
      "Text": " He's working on it."
    },
    {
      "Time_Start": 2219.44,
      "Time_End": 2221.44,
      "Text": " That's not on Seek and Destroy."
    },
    {
      "Time_Start": 2221.44,
      "Time_End": 2225.44,
      "Text": " Seek and Destroy 4, by the way, is based on Seek and Destroy 3 by Boris."
    },
    {
      "Time_Start": 2226.44,
      "Time_End": 2231.44,
      "Text": " Boris at Dylan dot something dot UK dot whatever."
    },
    {
      "Time_Start": 2232.44,
      "Time_End": 2236.44,
      "Text": " It's on the What All About screen."
    },
    {
      "Time_Start": 2237.44,
      "Time_End": 2243.44,
      "Text": " Basically what Quest did, he checked out the source and he basically rewrote all of it."
    },
    {
      "Time_Start": 2244.44,
      "Time_End": 2248.44,
      "Text": " He just called it Seek and Destroy 4 because it was based on the other guy's code."
    },
    {
      "Time_Start": 2248.44,
      "Time_End": 2250.44,
      "Text": " Yeah, that's about it."
    },
    {
      "Time_Start": 2251.44,
      "Time_End": 2255.44,
      "Text": " So more beatbox noises or would you like me to sit down now?"
    },
    {
      "Time_Start": 2270.44,
      "Time_End": 2272.44,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2278.44,
      "Time_End": 2280.44,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2299.44,
      "Time_End": 2301.44,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 2302.44,
      "Time_End": 2304.44,
      "Text": " Yep."
    },
    {
      "Time_Start": 2305.44,
      "Time_End": 2308.44,
      "Text": " I have no clue what you just said."
    },
    {
      "Time_Start": 2311.44,
      "Time_End": 2313.44,
      "Text": " Oh yes, there's lots of those."
    },
    {
      "Time_Start": 2314.44,
      "Time_End": 2316.44,
      "Text": " They're on freaky dot static users dot net."
    },
    {
      "Time_Start": 2317.44,
      "Time_End": 2319.44,
      "Text": " And they work very well."
    },
    {
      "Time_Start": 2320.44,
      "Time_End": 2322.44,
      "Text": " They're old."
    },
    {
      "Time_Start": 2323.44,
      "Time_End": 2325.44,
      "Text": " Not like BTNF has changed at all."
    },
    {
      "Time_Start": 2329.44,
      "Time_End": 2333.44,
      "Text": " So now we're in the progress of porting stuff over."
    },
    {
      "Time_Start": 2334.44,
      "Time_End": 2336.44,
      "Text": " VO2K."
    },
    {
      "Time_Start": 2337.44,
      "Time_End": 2339.44,
      "Text": " Bad."
    },
    {
      "Time_Start": 2344.44,
      "Time_End": 2348.44,
      "Text": " Anyway, while this is going, I'd like to thank you all for coming."
    },
    {
      "Time_Start": 2349.44,
      "Time_End": 2352.44,
      "Text": " I'm kind of out of stuff to say."
    },
    {
      "Time_Start": 2353.44,
      "Time_End": 2355.44,
      "Text": " What about port scanners?"
    },
    {
      "Time_Start": 2356.44,
      "Time_End": 2358.44,
      "Text": " AG group has put out one."
    },
    {
      "Time_Start": 2359.44,
      "Time_End": 2361.44,
      "Text": " PC, Mac, whatever."
    },
    {
      "Time_Start": 2362.44,
      "Time_End": 2364.44,
      "Text": " It works very well."
    },
    {
      "Time_Start": 2365.44,
      "Time_End": 2369.44,
      "Text": " There's BP scan, which scans for remote vulnerabilities."
    },
    {
      "Time_Start": 2370.44,
      "Time_End": 2373.44,
      "Text": " Made by a group called Broken Pipe."
    },
    {
      "Time_Start": 2374.44,
      "Time_End": 2376.44,
      "Text": " Who dropped the project."
    },
    {
      "Time_Start": 2377.44,
      "Time_End": 2379.44,
      "Text": " Logic made one."
    },
    {
      "Time_Start": 2380.44,
      "Time_End": 2383.44,
      "Text": " Again, all this stuff is on my site and you can search for it."
    },
    {
      "Time_Start": 2383.44,
      "Time_End": 2385.44,
      "Text": " And you'll find it all."
    },
    {
      "Time_Start": 2386.44,
      "Time_End": 2388.44,
      "Text": " What's that address?"
    },
    {
      "Time_Start": 2389.44,
      "Time_End": 2391.44,
      "Text": " Freaky dot static users dot net."
    },
    {
      "Time_Start": 2392.44,
      "Time_End": 2394.44,
      "Text": " Anybody else?"
    },
    {
      "Time_Start": 2408.44,
      "Time_End": 2410.44,
      "Text": " Can you sniff?"
    },
    {
      "Time_Start": 2410.44,
      "Time_End": 2412.44,
      "Text": " Can you sniff?"
    },
    {
      "Time_Start": 2413.44,
      "Time_End": 2415.44,
      "Text": " Yeah?"
    },
    {
      "Time_Start": 2426.44,
      "Time_End": 2428.44,
      "Text": " Yeah, Etherpeak."
    },
    {
      "Time_Start": 2429.44,
      "Time_End": 2431.44,
      "Text": " Their demo has expired even when you download it from their site."
    },
    {
      "Time_Start": 2432.44,
      "Time_End": 2434.44,
      "Text": " So go to Hotline and look for it."
    },
    {
      "Time_Start": 2436.44,
      "Time_End": 2438.44,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2441.44,
      "Time_End": 2443.44,
      "Text": " I guess I'm done there."
    },
    {
      "Time_Start": 2449.44,
      "Time_End": 2451.44,
      "Text": " Hell yeah."
    },
    {
      "Time_Start": 2455.44,
      "Time_End": 2457.44,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 2466.44,
      "Time_End": 2468.44,
      "Text": " Getting kind of personal, aren't you?"
    },
    {
      "Time_Start": 2470.44,
      "Time_End": 2472.44,
      "Text": " All right."
    },
    {
      "Time_Start": 2482.44,
      "Time_End": 2484.44,
      "Text": " All right."
    },
    {
      "Time_Start": 2485.44,
      "Time_End": 2487.44,
      "Text": " Thank you all for coming."
    },
    {
      "Time_Start": 2488.44,
      "Time_End": 2490.44,
      "Text": " Goodbye."
    }
  ]
}