{"segments": [{"Time_Start": 0.0, "Time_End": 16.080000000000002, "Text": " The following video was recorded live at the conference and produced by the Sound of Knowledge"}, {"Time_Start": 16.080000000000002, "Time_End": 17.080000000000002, "Text": " Incorporated."}, {"Time_Start": 17.080000000000002, "Time_End": 18.080000000000002, "Text": " Welcome to the annual DEFCON convention."}, {"Time_Start": 18.080000000000002, "Time_End": 19.080000000000002, "Text": " This meeting was held in exciting Las Vegas Nevada from July 9th through the 11th 1999."}, {"Time_Start": 19.080000000000002, "Time_End": 48.24, "Text": " This is video tape number 9, Packing Oracle 101."}, {"Time_Start": 48.24, "Time_End": 61.800000000000004, "Text": " There's my email address if anybody wants copies of these slides, just send me an email."}, {"Time_Start": 61.800000000000004, "Time_End": 73.24000000000001, "Text": " First a usual disclaimer."}, {"Time_Start": 73.24, "Time_End": 80.08, "Text": " Because of my professional affiliations, my absolutely necessary disclaimer."}, {"Time_Start": 80.08, "Time_End": 86.67999999999999, "Text": " I'm not saying go out and use this information for any kind of illegal purposes."}, {"Time_Start": 86.67999999999999, "Time_End": 95.24, "Text": " Okay, what is Oracle?"}, {"Time_Start": 95.24, "Time_End": 100.44, "Text": " Oracle is a relational database management system."}, {"Time_Start": 100.44, "Time_End": 106.24, "Text": " These provide a transparent interface between the storage of data and the representation"}, {"Time_Start": 106.24, "Time_End": 107.24, "Text": " of data."}, {"Time_Start": 107.24, "Time_End": 112.16, "Text": " And Oracle is a very widely used database."}, {"Time_Start": 112.16, "Time_End": 118.6, "Text": " It's very prevalent in the industry."}, {"Time_Start": 118.6, "Time_End": 121.6, "Text": " What's the value of attending this presentation?"}, {"Time_Start": 121.6, "Time_End": 126.47999999999999, "Text": " One is that, like I said, Oracle is widely used."}, {"Time_Start": 126.48, "Time_End": 134.4, "Text": " If you get some Oracle expertise, you can go out and make some money with it."}, {"Time_Start": 134.4, "Time_End": 145.28, "Text": " You can apply the knowledge learned here for some good things."}, {"Time_Start": 145.28, "Time_End": 153.44, "Text": " Oracle uses standard query language to get the database."}, {"Time_Start": 154.44, "Time_End": 157.44, "Text": " Here's some Oracle SQL tools."}, {"Time_Start": 157.44, "Time_End": 162.44, "Text": " SQL is probably the most widely used."}, {"Time_Start": 162.44, "Time_End": 167.44, "Text": " It's basically a shell to do standard query language commands."}, {"Time_Start": 167.44, "Time_End": 171.44, "Text": " Forms is an Oracle application."}, {"Time_Start": 171.44, "Time_End": 176.44, "Text": " Report writer is a query front-end data query tool."}, {"Time_Start": 176.44, "Time_End": 182.44, "Text": " SequoMenu also is an application front-end for menu applications."}, {"Time_Start": 182.44, "Time_End": 187.44, "Text": " SequoLater will load data from system files into the database."}, {"Time_Start": 187.44, "Time_End": 195.44, "Text": " SequoNet is the TCPIP communications protocol used to communicate in client-server fashion."}, {"Time_Start": 195.44, "Time_End": 202.44, "Text": " And SequoDBA is an administration tool."}, {"Time_Start": 202.44, "Time_End": 206.44, "Text": " Here's a few other Oracle tools."}, {"Time_Start": 206.44, "Time_End": 211.44, "Text": " Basically, these are case tools, the first two to help develop applications."}, {"Time_Start": 211.44, "Time_End": 217.44, "Text": " And the last ones are neural reporting utility."}, {"Time_Start": 219.44, "Time_End": 234.44, "Text": " Here's current programming languages that can be used to create batch jobs or application code for Oracle applications."}, {"Time_Start": 234.44, "Time_End": 251.44, "Text": " Basically, it's each of these languages with a compiler that will let you embed SQL commands into that language, into that compiler."}, {"Time_Start": 251.44, "Time_End": 256.44, "Text": " This is the way Oracle stores data in tables."}, {"Time_Start": 256.44, "Time_End": 259.44, "Text": " Here's a sample table."}, {"Time_Start": 259.44, "Time_End": 267.44, "Text": " These are columns, SSN, last name, first name."}, {"Time_Start": 267.44, "Time_End": 270.44, "Text": " These are rows within the table."}, {"Time_Start": 270.44, "Time_End": 276.44, "Text": " And any single data element within a column within a row is called a record."}, {"Time_Start": 276.44, "Time_End": 293.44, "Text": " If you're on an OS and you want to know if they have Oracle on that OS, here are some ways you can determine if Oracle is present on that system."}, {"Time_Start": 293.44, "Time_End": 300.44, "Text": " On Unix, PS, list the processes and grep anything with ORA in it."}, {"Time_Start": 300.44, "Time_End": 308.44, "Text": " On MVS, under interactive system productivity facility, there should be an Oracle option."}, {"Time_Start": 308.44, "Time_End": 321.44, "Text": " On VMS, you list the processes, and on NT, there'll be an Oracle option under programs, and it will also be running as a service."}, {"Time_Start": 324.44, "Time_End": 330.44, "Text": " In order to access the database, you have to have a few things."}, {"Time_Start": 330.44, "Time_End": 337.44, "Text": " You have to have your path set up to where you can access the Oracle executables."}, {"Time_Start": 337.44, "Time_End": 342.44, "Text": " You also have to be pointing to the system ID of the database."}, {"Time_Start": 342.44, "Time_End": 350.44, "Text": " Oracle databases are named with system IDs, and it's just basically a generic naming standard."}, {"Time_Start": 350.44, "Time_End": 354.44, "Text": " You can name it DBO1, DBO2, DBO3."}, {"Time_Start": 354.44, "Time_End": 359.44, "Text": " You just have to be pointing to the valid database in order to access it."}, {"Time_Start": 359.44, "Time_End": 363.44, "Text": " And you need a valid user ID with Connect privileges."}, {"Time_Start": 368.44, "Time_End": 378.44, "Text": " In order to identify valid environment variables, you could check the INI files to see what databases have been"}, {"Time_Start": 379.44, "Time_End": 382.44, "Text": " loaded on that system."}, {"Time_Start": 382.44, "Time_End": 388.44, "Text": " In the environment variables, the path in the SID will be in those files."}, {"Time_Start": 388.44, "Time_End": 397.44, "Text": " On MVS, it's sys1.proclod, and VMS, INI files, and NT, INI files."}, {"Time_Start": 398.44, "Time_End": 413.44, "Text": " The types of user IDs that exist in an Oracle database, DBA Database Administrator, basically can do anything they want."}, {"Time_Start": 413.44, "Time_End": 416.44, "Text": " This is the God ID with an Oracle."}, {"Time_Start": 416.44, "Time_End": 424.44, "Text": " A privileged user is a user that has been granted specific privileges to data elements within the database."}, {"Time_Start": 425.44, "Time_End": 435.44, "Text": " And an unprivileged user can be a user ID that's been created but has been given their privileges that can access anything that's been granted to public."}, {"Time_Start": 435.44, "Time_End": 443.44, "Text": " Within Oracle, some system elements and sometimes data elements are granted to public, which means any user ID can access it."}, {"Time_Start": 446.44, "Time_End": 450.44, "Text": " So you don't need specific permissions if it's been granted to public."}, {"Time_Start": 455.44, "Time_End": 459.44, "Text": " Oracle uses several different types of authentication options."}, {"Time_Start": 459.44, "Time_End": 463.44, "Text": " One is authenticated by the operating system."}, {"Time_Start": 463.44, "Time_End": 468.44, "Text": " If you have a valid user ID in the operating system, you can get into the database."}, {"Time_Start": 468.44, "Time_End": 473.44, "Text": " Another is standard user ID and password stored in the database."}, {"Time_Start": 473.44, "Time_End": 478.44, "Text": " And two more X509 certificates and smart cards, which are newer options."}, {"Time_Start": 484.44, "Time_End": 496.44, "Text": " With operating system authentication, this is probably the most widely used authentication due to the lack of password management within the database."}, {"Time_Start": 496.44, "Time_End": 509.44, "Text": " And what happens in this case is you have a valid operating system user ID, and in the database you have the same ID that has a prefix of OPS dollar sign."}, {"Time_Start": 509.44, "Time_End": 517.44, "Text": " And that's the default. It can be something different, but that's pretty much 99% of the time that's the prefix."}, {"Time_Start": 517.44, "Time_End": 526.44, "Text": " So if you've signed on to the operating system, you type SQL plus to try and get into the SQL shell."}, {"Time_Start": 526.44, "Time_End": 532.44, "Text": " And when it prompts you for a user ID, you just put slash and it lets you into the database."}, {"Time_Start": 532.44, "Time_End": 550.44, "Text": " So what does that mean? If you can become a user on the operating system that has a valid database user ID and you're using OS authentication, you're in the database."}, {"Time_Start": 550.44, "Time_End": 554.44, "Text": " No additional authentication required."}, {"Time_Start": 554.44, "Time_End": 574.44, "Text": " If you're doing some type of penetration testing or certification and accreditation testing, you should check out some user IDs that are on the OS that look like they're Oracle application users to see if you can get to that ID and then get to the database."}, {"Time_Start": 575.44, "Time_End": 591.44, "Text": " Another way is to look for IDs that are in the DBA group, because if you can get to one of those IDs and get into the database, you're now God of the database."}, {"Time_Start": 591.44, "Time_End": 598.44, "Text": " The user ID and password authentication. This is pretty much used for client server environments."}, {"Time_Start": 598.44, "Time_End": 607.44, "Text": " The user IDs can be from one to 30 characters, cannot be muzz, but it can be a space."}, {"Time_Start": 607.44, "Time_End": 621.44, "Text": " Password to stored does encrypt it in the database. And basically when you log in, it will encrypt the password value that you enter and match it up against the stored value in the database."}, {"Time_Start": 621.44, "Time_End": 641.44, "Text": " And the big problem with this is that the does key to do this crypto is not well secured. So if you access that key, you can pretty much crack all the passwords in the database."}, {"Time_Start": 641.44, "Time_End": 655.44, "Text": " The user ID and password authentication. Every Oracle implementation has three default user IDs and passwords. Anytime an Oracle database is installed, these IDs and passwords exist."}, {"Time_Start": 655.44, "Time_End": 664.44, "Text": " The first one is sys. The password is changed uninstalled. The second one is system. The password is manager."}, {"Time_Start": 664.44, "Time_End": 670.44, "Text": " And like I said, if you're doing certification and accreditation testing, these are things you should try."}, {"Time_Start": 670.44, "Time_End": 679.44, "Text": " And the third is Scott. Password is Tiger. And that's basically an unprivileged user ID, but it's always there."}, {"Time_Start": 679.44, "Time_End": 693.44, "Text": " But if you're a security person and you're installing or someone's installed a database, you should go change these passwords. Obviously."}, {"Time_Start": 693.44, "Time_End": 718.44, "Text": " Sys is the only ID that can start stop or tune the database. But system or any other ID that has the DBA role granted to it can do anything in the database except start stop or tune it."}, {"Time_Start": 718.44, "Time_End": 726.44, "Text": " The X509 certificate authentication. The newest version of Oracle is Oracle 8. It's been around for about a year now."}, {"Time_Start": 726.44, "Time_End": 742.44, "Text": " They have a separate security server that's an option with the database. And with it, you can use X509 certificates to authenticate yourself to the security server and then to the database."}, {"Time_Start": 742.44, "Time_End": 752.44, "Text": " And the smart card is the same thing."}, {"Time_Start": 752.44, "Time_End": 771.44, "Text": " If you're doing certification and accreditation testing of a database on most implementations, any user in the DBA group can run the SQL DBA utility and type the words connect internal and be logged in as sys."}, {"Time_Start": 771.44, "Time_End": 781.44, "Text": " And use of the SQL DBA utility should be locked down on Oracle implementations, but it's usually not."}, {"Time_Start": 781.44, "Time_End": 799.44, "Text": " And it won't work on NT because NT handles groups differently than Unix and VMS and NNVS. It doesn't recognize group privileges the same way."}, {"Time_Start": 800.44, "Time_End": 811.44, "Text": " When you're in the database, how do you access the data? You must have specific granted access to the tables or views of the tables."}, {"Time_Start": 811.44, "Time_End": 820.44, "Text": " Within Oracle, you can limit access to a table to certain data elements within the table through use of views."}, {"Time_Start": 820.44, "Time_End": 826.44, "Text": " So when you're in the database, you have to have these table privileges granted to you to get to the data."}, {"Time_Start": 827.44, "Time_End": 838.44, "Text": " And table privileges can be given on a table by table basis. Lots of tables can be grouped into what's called a row, and then that row can be granted to the user."}, {"Time_Start": 838.44, "Time_End": 846.44, "Text": " And only the owner of the table can grant access to the table."}, {"Time_Start": 847.44, "Time_End": 858.44, "Text": " Or a user ID that has been granted access to the table by the owner with grant authority so they can re-grant permissions once they've been granted permissions."}, {"Time_Start": 858.44, "Time_End": 860.44, "Text": " That's not typically done."}, {"Time_Start": 860.44, "Time_End": 882.44, "Text": " Like I said before, the access views can provide granularity of record level access. You can limit it just to specific rows or specific columns or specific records within a row within a column."}, {"Time_Start": 883.44, "Time_End": 890.44, "Text": " And all users employ SQL in some way to retrieve and present data."}, {"Time_Start": 896.44, "Time_End": 908.44, "Text": " Also, besides the database, data being in the database, it's obviously in the OS files. And those OS files may not always be well protected."}, {"Time_Start": 909.44, "Time_End": 923.44, "Text": " If you find the OS files and they're readable, a lot of the data will be gibberish because of the format it's starting, but there will be normal, readable, clear text data in those OS files."}, {"Time_Start": 923.44, "Time_End": 928.44, "Text": " So it's not always necessary to get into the database to look at the data."}, {"Time_Start": 929.44, "Time_End": 946.44, "Text": " Oracle subdirectories have names like those listed here. And like I said, accessing data this way is not going to restrict you to certain rows or columns or records within the database."}, {"Time_Start": 947.44, "Time_End": 967.44, "Text": " Here are some Oracle system privileges roles. You must grant Connect to any user ID that has to log into the database. Connect is a role within Oracle."}, {"Time_Start": 968.44, "Time_End": 983.44, "Text": " If you grant the resource role to a user, that will allow them to create, manage, or drop database resources such as tables within their schema, which means under their user ID."}, {"Time_Start": 984.44, "Time_End": 990.44, "Text": " And DBA is a role which allows users to do just about anything they want to do within the database."}, {"Time_Start": 991.44, "Time_End": 1003.44, "Text": " And within Oracle, Oracle 7NA came out with some other granular roles to further limit access to system resources."}, {"Time_Start": 1004.44, "Time_End": 1014.44, "Text": " So you have some granularity where you don't have to make a user a DBA or just a normal user. You can just give them only the privileges they need to do their job."}, {"Time_Start": 1015.44, "Time_End": 1021.44, "Text": " But before Oracle 7, these were pretty much the only system roles that existed."}, {"Time_Start": 1022.44, "Time_End": 1045.44, "Text": " Any and all system privileges can be granted by any user with the DBA privilege. So if you want to grant a system privilege to a user, if you're a DBA, you can grant any system privilege."}, {"Time_Start": 1046.44, "Time_End": 1050.44, "Text": " You cannot grant system privileges to a non-DBA with grant authority."}, {"Time_Start": 1061.44, "Time_End": 1072.44, "Text": " Auditing within the database. Auditing in Oracle can be turned globally-run or off by modifying the INI files for the database."}, {"Time_Start": 1072.44, "Time_End": 1093.44, "Text": " This is going to require a restart to actually get the database to start or stop logging. However, DBA can turn on or off auditing within the database by issuing commands, and it would not require a database restart for that change to take effect."}, {"Time_Start": 1103.44, "Time_End": 1120.44, "Text": " The DBA can set granular or global auditing parameters, and basically I'm going to get into some commands later that specify the different types of auditing that a DBA can do within the database."}, {"Time_Start": 1121.44, "Time_End": 1139.44, "Text": " All audit records are sent to the sys.aud dollar sign system table. Any DBA can access those audit records, not through querying the table itself, but through querying views that have been created to point to that table."}, {"Time_Start": 1140.44, "Time_End": 1153.44, "Text": " The sys.aud dollar table must be backed up to regular tables and cleared periodically, and the reason why is right here."}, {"Time_Start": 1154.44, "Time_End": 1174.44, "Text": " If the sys.aud dollar table grows to 50,000 records, the database basically stops running, and if you audit every successful read of an Oracle table, you're going to reach that limit pretty fast."}, {"Time_Start": 1175.44, "Time_End": 1183.44, "Text": " Oracle password management."}, {"Time_Start": 1184.44, "Time_End": 1196.44, "Text": " Other than the fact that you have to have a password to access the database, all Oracle versions prior to version 8 have no password management features."}, {"Time_Start": 1196.44, "Time_End": 1216.44, "Text": " What does that mean? That means that a user can establish a password of a space, a run, or an A, or anything. They can establish passwords that match their names or user IDs."}, {"Time_Start": 1217.44, "Time_End": 1225.44, "Text": " Passwords will never expire, and accounts will never be locked within any version of Oracle prior to 8."}, {"Time_Start": 1227.44, "Time_End": 1239.44, "Text": " Most people are still on 7 or lower. Some people have moved to 8, but there's been some instability within version 8 that's kept some people from moving there."}, {"Time_Start": 1240.44, "Time_End": 1261.44, "Text": " Exceptions to that prior slide. If you're trying to connect to the database after three unsuccessful login attempts, the SQL plus session or login session will be terminated. However, you can restart that session thousands and thousands of times, and that user ID will never be locked."}, {"Time_Start": 1262.44, "Time_End": 1268.44, "Text": " It's just a lockout on invalid passwords within the logon form."}, {"Time_Start": 1269.44, "Time_End": 1280.44, "Text": " These two companies, Mirror Systems and Blametree, offer third-party password management software for Oracle versions 7 and 8."}, {"Time_Start": 1281.44, "Time_End": 1292.44, "Text": " Oracle 8 finally puts in password management into the database, mainly because people like me bitched enough for them to do it."}, {"Time_Start": 1292.44, "Time_End": 1313.44, "Text": " If you're looking in an OS and you want to know if Blametree or Mirror is being used to do password management within an Oracle database version 7 or 8, they have SysOS IDs."}, {"Time_Start": 1314.44, "Time_End": 1329.44, "Text": " The Blametree user ID on the OS would be SQLCQR. I don't know what the mirror user ID is, but I'm sure it can be found on Moore's website. Call them up, ask them whatever, some information about their product."}, {"Time_Start": 1329.44, "Time_End": 1356.44, "Text": " Within Oracle 8, password management parameters can be set by any DBA. If you list the default profile on the Oracle database, it will show the password management parameters that exist under Oracle 8, which can be turned on or off or set to different parameters or levels."}, {"Time_Start": 1359.44, "Time_End": 1379.44, "Text": " Oracle TCPIP Sessions. The Sequenet protocol is used to remotely connect to the Oracle database. Multiple database instances will usually run on a single server, and each instance will require its own listener or port."}, {"Time_Start": 1379.44, "Time_End": 1396.44, "Text": " So basically you can have three or four or five database instances running on an operating system, and you just have to have separate listeners for the Sequenet connection to connect to."}, {"Time_Start": 1397.44, "Time_End": 1405.44, "Text": " An Oracle server listener is usually run in this port range, 1500 to 1599."}, {"Time_Start": 1405.44, "Time_End": 1424.44, "Text": " In order to encrypt Sequenet Sessions, there was a product called Secure Network Services. Now it's called Advanced Networking Option, and sometimes it's used, sometimes it's not."}, {"Time_Start": 1424.44, "Time_End": 1453.44, "Text": " The crypto strength of AMO is pretty good, but there are some flaws in the key exchange protocol, and basically if you want to know what they are, you probably have to do a source code review and sign a land disclosure agreement like I have, and you'd be able to pick out that stuff."}, {"Time_Start": 1453.44, "Time_End": 1469.44, "Text": " And AMO encryption can be mandated or it can be optional. So the server can say every TCPIP Sequenet session is encrypted, or you can encrypt if the client wants to or not."}, {"Time_Start": 1469.44, "Time_End": 1496.44, "Text": " Here are some useful SQL statements. Grant Connect to user ID being any user ID you want to name, identified by password being any password you want to name, that will create a new user within the Oracle database."}, {"Time_Start": 1496.44, "Time_End": 1517.44, "Text": " If you want to change a user's password, you could use that second command, and basically all the information here, I gave this presentation to a guy that had to do some certification testing, and he took this presentation and went at this database, he knew nothing about it."}, {"Time_Start": 1517.44, "Time_End": 1528.44, "Text": " He really didn't know anything about Oracle, and he was able to get into the database lots of different ways and do lots of different things once he got there."}, {"Time_Start": 1528.44, "Time_End": 1553.44, "Text": " You can grant the DBA role to a user ID if you are DBA or if you're in the system account or sys account within the database, and you can drop user IDs by drop user user ID cascade, the cascade is an option, and it will drop all the tables created by our user when you delete the user ID."}, {"Time_Start": 1553.44, "Time_End": 1563.44, "Text": " If you don't use cascade, the user ID goes away, but the tables still exist."}, {"Time_Start": 1563.44, "Time_End": 1589.44, "Text": " You can look at all user IDs and passwords in the database by issuing the top command. You have to be a DBA to access any DBA table, and basically that's any table that starts with the name sys.dba something. Only DBAs can query those tables."}, {"Time_Start": 1589.44, "Time_End": 1617.44, "Text": " There are also some tables within Oracle that start with the word ALL. Any user ID on the system can query those tables. So any user could look at all the user IDs on the system by selecting user name from all users. That table, all users, does not have the passwords stored in it, so you would not get the encrypted passwords."}, {"Time_Start": 1617.44, "Time_End": 1627.44, "Text": " Select asterisk from profile default. If you're in Oracle 8 and you want to see what the password management settings are, that's the command to do it."}, {"Time_Start": 1627.44, "Time_End": 1644.44, "Text": " If you wanted to change the default profile, you could do a command like alt or profile default invalid logins unlimited. So then there would be no lock. What's that?"}, {"Time_Start": 1644.44, "Time_End": 1646.44, "Text": " Do you have to be a DBA to do that?"}, {"Time_Start": 1646.44, "Time_End": 1653.44, "Text": " Yes. In order to change that default profile, you do have to be a DBA."}, {"Time_Start": 1653.44, "Time_End": 1659.44, "Text": " But there's plenty of ways to be kind of DBA."}, {"Time_Start": 1659.44, "Time_End": 1682.44, "Text": " If you grant all on any table to a user ID, basically it's going to give you a whole list of permissions on that table, like select, which means read, insert into the table, modify the table, delete records out of the table, and a few others like create indexes on the table and links on the table."}, {"Time_Start": 1682.44, "Time_End": 1697.44, "Text": " You can grant specific privileges, so if you want to just grant read access to a user ID, you can do grant select on the table to the user ID, and that user ID would only be able to read that table."}, {"Time_Start": 1697.44, "Time_End": 1711.44, "Text": " And you can revoke everything on the table from the user ID. You want to take away access on a specific table or object."}, {"Time_Start": 1711.44, "Time_End": 1722.44, "Text": " If you want to create a row, basically it's just create row and row name, and drop a row or delete a row, drop row, row name."}, {"Time_Start": 1722.44, "Time_End": 1736.44, "Text": " And if you want to add a bunch of table permissions to a row, you basically grant those table permissions to that row, and then the second to last command, you can grant that row to a user."}, {"Time_Start": 1736.44, "Time_End": 1749.44, "Text": " Prior to version 7, there were no rows, so if it's a security administrator, your job was really hard, because you had to grant specific table privileges to every user ID on the system."}, {"Time_Start": 1749.44, "Time_End": 1756.44, "Text": " And with RQL 7 and 8, you can just grant it to a single row and grant that row to every user that needs it."}, {"Time_Start": 1756.44, "Time_End": 1765.44, "Text": " And the last command is to take a row away from the user ID."}, {"Time_Start": 1766.44, "Time_End": 1782.44, "Text": " The granular auditing options are alluded to here. You can turn on auditing for any successful login by using the top command."}, {"Time_Start": 1783.44, "Time_End": 1791.44, "Text": " You can turn on auditing for any unsuccessful login by using the second command."}, {"Time_Start": 1791.44, "Time_End": 1805.44, "Text": " And you can audit specific privileges, say any time someone updates a table, you can audit just that, updates on default, like any table on the system."}, {"Time_Start": 1805.44, "Time_End": 1811.44, "Text": " And if you issue that command, any table that gets updated will cut an audit record."}, {"Time_Start": 1811.44, "Time_End": 1820.44, "Text": " Or you can do it on a specific table."}, {"Time_Start": 1820.44, "Time_End": 1827.44, "Text": " This first option is showing how to do it on a specific table instead of every table by default."}, {"Time_Start": 1827.44, "Time_End": 1837.44, "Text": " You can turn off auditing by just doing no audit all on a table, so any access to that table at all would not be auditing if that statement was issued."}, {"Time_Start": 1837.44, "Time_End": 1849.44, "Text": " And no audit all will turn off all statement auditing. Basically, any SQL statements that are issued will not be audited."}, {"Time_Start": 1849.44, "Time_End": 1858.44, "Text": " And no audit all privileges would turn off auditing for any system privilege that was executed."}, {"Time_Start": 1866.44, "Time_End": 1872.44, "Text": " No audit all on default will turn off all default audits."}, {"Time_Start": 1872.44, "Time_End": 1879.44, "Text": " If you want to turn on auditing for a specific user, you do audit session by the user ID."}, {"Time_Start": 1879.44, "Time_End": 1888.44, "Text": " And if you want to turn off auditing for a specific user, you just issue no audit session by that user ID."}, {"Time_Start": 1888.44, "Time_End": 1897.44, "Text": " So if you were doing something in the database and you didn't want to be audited and you could issue that command, you would not be auditing."}, {"Time_Start": 1897.44, "Time_End": 1903.44, "Text": " And delete asterisk from the suicide dollar table will delete all audit records."}, {"Time_Start": 1912.44, "Time_End": 1926.44, "Text": " This first statement, say you're querying a database that has a bunch of credit card numbers, this would show you how to possibly retrieve some of those credit card numbers."}, {"Time_Start": 1926.44, "Time_End": 1937.44, "Text": " Or a database that had some other data. The second statement has a rad card, F name like Liz percent sign."}, {"Time_Start": 1937.44, "Time_End": 1950.44, "Text": " Basically, you can put a percent sign before or after any string and that will give you any option like Liz or Lizzie or anything that came after Liz, basically."}, {"Time_Start": 1950.44, "Time_End": 1963.44, "Text": " If you wanted to see all the tables in the database, you could select owner and table name from SysDBA tables."}, {"Time_Start": 1963.44, "Time_End": 1971.44, "Text": " If you wanted to list all columns within a table, you would do a describe on that table."}, {"Time_Start": 1972.44, "Time_End": 1985.44, "Text": " And if you want to list audit records, here's one of the audit views of the suicide dollar table that can be queried to look at all audit records for a specific user."}, {"Time_Start": 1986.44, "Time_End": 2002.44, "Text": " Here's some of the useful security tables within an article database. The first one is stores all users and passwords in that table."}, {"Time_Start": 2002.44, "Time_End": 2009.44, "Text": " The second one, any table privileges that have been granted to anyone would be stored in that second one."}, {"Time_Start": 2010.44, "Time_End": 2015.44, "Text": " The third one, any system privileges that have been granted to any user would be stored in the third."}, {"Time_Start": 2015.44, "Time_End": 2024.44, "Text": " Any profiles that have been created and granted to specific users will be in the SysDBA profile table."}, {"Time_Start": 2024.44, "Time_End": 2028.44, "Text": " Any roles that have been created will be in the DBA roles table."}, {"Time_Start": 2029.44, "Time_End": 2034.44, "Text": " Any role privileges who they've been granted to would be in the DBA role probes."}, {"Time_Start": 2034.44, "Time_End": 2042.44, "Text": " And audit records would be under the view of the DBA audit trial table."}, {"Time_Start": 2042.44, "Time_End": 2045.44, "Text": " And the SysDBA dollar table is the actual audit table."}, {"Time_Start": 2045.44, "Time_End": 2059.44, "Text": " It kind of went quick, but that's it. If anybody has any questions, now's the time. Yes."}, {"Time_Start": 2075.44, "Time_End": 2103.44, "Text": " Okay. Within Oracle, there are very back segments."}, {"Time_Start": 2103.44, "Time_End": 2114.44, "Text": " So if you're doing a lot of changes within the database and something happens, it crashes, you can roll back to some certain period in time."}, {"Time_Start": 2114.44, "Time_End": 2119.44, "Text": " You want to know if you can offload those rollback segments."}, {"Time_Start": 2119.44, "Time_End": 2129.44, "Text": " Yeah, yeah. Basically, you can structure, you can separate some of those things like the rollback segments on different disks on an OS."}, {"Time_Start": 2129.44, "Time_End": 2143.44, "Text": " So if you have a disk crash on a disk that has part of the database, it's not necessarily going to affect whether you have stuff like rollback segments if you have it on a different disk."}, {"Time_Start": 2143.44, "Time_End": 2150.44, "Text": " So you can separate those things. As far as putting them on another OS, I'm pretty sure you can do that."}, {"Time_Start": 2150.44, "Time_End": 2158.44, "Text": " Just do an export."}, {"Time_Start": 2158.44, "Time_End": 2166.44, "Text": " I'm thinking of an OS."}, {"Time_Start": 2166.44, "Time_End": 2172.44, "Text": " Okay. Yeah, I mean, I'm not a DBA, so those functions are kind of outside of my realm."}, {"Time_Start": 2172.44, "Time_End": 2187.44, "Text": " I do know that if you're issuing a bunch of SQL statements and you're not committing those statements to the database periodically, you'll overflow the rollback segments and the database will run to a halt."}, {"Time_Start": 2187.44, "Time_End": 2205.44, "Text": " So if you're issuing a thousand create user commands and you're not committing those commands every 50 user IDs or something, you'll overflow the rollback segments and the system will halt."}, {"Time_Start": 2205.44, "Time_End": 2216.44, "Text": " Yes."}, {"Time_Start": 2216.44, "Time_End": 2228.44, "Text": " If you're using OS authentication and a user ID has already logged into the OS, it doesn't matter what the ID in the database has as a password."}, {"Time_Start": 2229.44, "Time_End": 2239.44, "Text": " If it's set up to use OS authentication and the ID exists that matches the OS ID and has an op-styler prefix, they'll log in."}, {"Time_Start": 2239.44, "Time_End": 2246.44, "Text": " If you want them to have to log into the database, don't use the OS authentication."}, {"Time_Start": 2246.44, "Time_End": 2256.44, "Text": " They'll log into the OS, but if you create an ID for them in the database, don't prefix it with the op-styler and when they connect, they'll have to supply the user ID and password."}, {"Time_Start": 2256.44, "Time_End": 2277.44, "Text": " Right. If you do SQL net, that's not OS authentication because you're client server mode. You're not logged into the OS."}, {"Time_Start": 2277.44, "Time_End": 2295.44, "Text": " And the ID can exist just as a regular user ID with a password. There can be op-styler user ID with a password and you'll have to type op-styler user ID on the password if you're coming in with a SQL net because you haven't authenticated to the OS."}, {"Time_Start": 2296.44, "Time_End": 2297.44, "Text": " Yes."}, {"Time_Start": 2300.44, "Time_End": 2308.44, "Text": " No, I have not. I've seen some of it, some sales pitch stuff. Do you have any specific questions about it?"}, {"Time_Start": 2312.44, "Time_End": 2323.44, "Text": " There's problems with that. One of them will use a global user ID to access the database and it's doing all the ID mappings at the web server."}, {"Time_Start": 2323.44, "Time_End": 2331.44, "Text": " I personally have a little heartache with that, but I haven't filled with it much. Yes."}, {"Time_Start": 2333.44, "Time_End": 2344.44, "Text": " It's vvandal at exploit.com. The O in exploit is a zero. Yes."}, {"Time_Start": 2344.44, "Time_End": 2368.44, "Text": " It does encrypt it. An offline tool to list the, I mean basically if you can access the OS data files from the OS, you'll see those encrypted passwords there."}, {"Time_Start": 2375.44, "Time_End": 2386.44, "Text": " Okay. Yes."}, {"Time_Start": 2386.44, "Time_End": 2407.44, "Text": " Just to start, he's asking if it's possible to start the SQL net listener on a privileged part, like less than 1023 you're asking."}, {"Time_Start": 2407.44, "Time_End": 2420.44, "Text": " If that port's not being used by another service, yes, you can specify the listener to use one of those privileged ports if it's not being used. Yes."}, {"Time_Start": 2420.44, "Time_End": 2436.44, "Text": " Yeah, I mean those commands I was issuing, if you want to delete all audit records for a specific ID, you can do that."}, {"Time_Start": 2436.44, "Time_End": 2457.44, "Text": " If you want to delete audit records on a specific table, like anybody that's accessed a specific table, you can do that. Basically, you just delete stuff from the sysad dollar table where some condition is met, whatever condition you need to meet."}, {"Time_Start": 2458.44, "Time_End": 2468.44, "Text": " Does that answer it? I mean, okay. Yes."}, {"Time_Start": 2469.44, "Time_End": 2486.44, "Text": " Yeah, you can, but typically it's a date-based thing where you offload all the, you know, if you're going to be making audit backups, you probably want to store them by some weekly parameter, a monthly parameter, a daily parameter."}, {"Time_Start": 2486.44, "Time_End": 2500.44, "Text": " So you'd have to have your script set up to offload just that week's data and then a script that would delete just that week's data. So, you know, you can code that. So, yes, you can automate it."}, {"Time_Start": 2500.44, "Time_End": 2526.44, "Text": " Um, you could, not in the database itself, I mean, there's nothing to trigger that. You could set up something in, like, Quon to go check it and, you know, if you can select count from the table and it'll give you how many records, how many rows are in that, in that sysad dollar table."}, {"Time_Start": 2526.44, "Time_End": 2540.44, "Text": " And I'm based on some output condition of it's greater than whatever, 40,000, then you can, you know, kick off whatever you need to to clear it out. Yeah. Yes."}, {"Time_Start": 2540.44, "Time_End": 2562.44, "Text": " Tested any vulnerabilities with the SQL net protocol. As far as, like, man in the middle attack or I'm getting a key, a crypto key for the session. Yeah."}, {"Time_Start": 2562.44, "Time_End": 2587.44, "Text": " Um, but I mean, as far as anything else, um, you know, it's either, it's either encrypted or it's not, um, as far as connecting to the database with SQL net, you know, you have to have a valid ID once you get there. I wouldn't find a way to, like, exploit that to get in. Otherwise, yes."}, {"Time_Start": 2588.44, "Time_End": 2606.44, "Text": " I don't think so. I don't think anybody can drop a DBA table, but I haven't actually tried that. That's a good little test. Yes."}, {"Time_Start": 2607.44, "Time_End": 2627.44, "Text": " Any statements like if you're inserting data into a table, you're inserting some row into a table and you have insert this row, insert this row, insert this row."}, {"Time_Start": 2627.44, "Time_End": 2653.44, "Text": " You can insert to any table you have access to. Yeah. I mean, basically, if you have access to do some type of command that's going to alter any kind of data, whether it's creating users or inserting data or deleting data, whatever you have access to do, if you do too many of them without committing them, you will overflow that row back segment."}, {"Time_Start": 2657.44, "Time_End": 2686.44, "Text": " I mean, what I usually do is do a commit like every 50 or more than 100 statements. I don't know exactly at which point it breaks. It probably depends on the complexity of the SQL command you're issuing, but I never go over 100 SQL statements without issuing a commit unless I want to break it. Yes."}, {"Time_Start": 2688.44, "Time_End": 2708.44, "Text": " It's just something that Oracle overlooked. I mean, they do have the ability to does encrypt the passwords, but they didn't really take good consideration in how they were going to protect that does key."}, {"Time_Start": 2708.44, "Time_End": 2737.44, "Text": " You know, can they fix that? Yeah. Is it fixed right now? No. How is it affected? How is it protected? Basically, it's not. I mean, basically, you know, there's a few ways you can find out. You can fool around with it and find it yourself. You can do a source code review and, you know, sign a non-disclosure."}, {"Time_Start": 2738.44, "Time_End": 2751.44, "Text": " statement like I did, which is why I'm not disclosing it right now, and you'll find it. Or you can get me drunk and maybe I'll tell you later. Yes."}, {"Time_Start": 2751.44, "Time_End": 2780.44, "Text": " Well, usually, if you're, you know, using all this authentication, if you're setting up a bunch of application users, they normally be part of some application group, but it's not necessary for them to be in a specific group."}, {"Time_Start": 2781.44, "Time_End": 2799.44, "Text": " at the OS if you're using. Right. With the exception of if they're in the DBA group and they run the SQL DBA utility, that's the only time it'll actually check what the group is."}, {"Time_Start": 2799.44, "Time_End": 2802.44, "Text": " Last question."}, {"Time_Start": 2830.44, "Time_End": 2847.44, "Text": " If you ever want them to execute stored procedures, you can set up profiles for a user within the database that can limit what they can do. You can basically say they can't issue this command, this command, this command, or any command except this one."}, {"Time_Start": 2847.44, "Time_End": 2871.44, "Text": " So, yeah, you can do some stuff to limit what they can execute over a SQL net connection. The second part of that was most of the proxies, if you're talking about firewall proxies or like generic proxies, they're not really doing any command filtering within the proxy."}, {"Time_Start": 2871.44, "Time_End": 2885.44, "Text": " It's just some proxy to get them through the firewall and handle the SQL net traffic. But to me, a generic proxy is not really a proxy. A proxy is going to limit what you can actually do while you're using that."}, {"Time_Start": 2886.44, "Time_End": 2894.44, "Text": " The sky's saying Sidewinder."}, {"Time_Start": 2902.44, "Time_End": 2906.44, "Text": " What is it limiting? I mean, what is it stopping you from doing?"}, {"Time_Start": 2916.44, "Time_End": 2929.44, "Text": " Most of the ones I've seen were generic."}, {"Time_Start": 2929.44, "Time_End": 2957.44, "Text": " Well, it does that on NT. The SQL net implementation on NT uses a wide range of ports, which is really f'd up if you're some kind of security administrator."}, {"Time_Start": 2958.44, "Time_End": 2975.44, "Text": " On Unix, it doesn't do that. The listener listens on this port and this port only. So, yeah, if you're running NT and trying to do SQL net, you could have a situation where you can't use proxies because of the wide range of ports, and the proxy's not going to handle that."}, {"Time_Start": 2976.44, "Time_End": 2993.44, "Text": " You would get that the port is open. If you were port scanning, would you know if the port was being used?"}, {"Time_Start": 2994.44, "Time_End": 2998.44, "Text": " Would you just get an open port and not have anything else?"}, {"Time_Start": 3008.44, "Time_End": 3016.44, "Text": " If you were not directly to the cell, then why would you use the wide range of the potential of this thing so it's not the protocol itself?"}, {"Time_Start": 3017.44, "Time_End": 3029.44, "Text": " What you probably want to be doing is connecting SQL plus over SQL net to see if you get a username, login prompt."}, {"Time_Start": 3030.44, "Time_End": 3040.44, "Text": " Do you have any possible way to exclude the database listener to get operating system show access?"}, {"Time_Start": 3045.44, "Time_End": 3055.44, "Text": " If you're in a SQL net session, if you host out, you host out back to your client. You don't host out to the OS."}, {"Time_Start": 3055.44, "Time_End": 3065.44, "Text": " Do you have any experience with this protocol running on the cell that we've been tunneling in now, and if so, do you know how they're doing this?"}, {"Time_Start": 3086.44, "Time_End": 3088.44, "Text": " Is there a medication there?"}, {"Time_Start": 3089.44, "Time_End": 3097.44, "Text": " No, I've seen it, but I haven't played with it. I don't know."}, {"Time_Start": 3100.44, "Time_End": 3103.44, "Text": " One more question?"}, {"Time_Start": 3104.44, "Time_End": 3108.44, "Text": " One more question? Thank you all for coming."}]}