{"segments": [{"Time_Start": 0.0, "Time_End": 11.0, "Text": " Welcome to the annual DEFCON convention. This meeting was held at exciting Las Vegas Nevada from July 9th, with the 11th 1999."}, {"Time_Start": 12.0, "Time_End": 18.0, "Text": " This is video tape number 40, Security Problems associated with client-side scripting."}, {"Time_Start": 18.0, "Time_End": 32.0, "Text": " And what we do is we find and we fully disclose the holes that we find in these web servers."}, {"Time_Start": 33.0, "Time_End": 37.0, "Text": " So, what kind of holes are these? Okay, these are the kinds of holes."}, {"Time_Start": 38.0, "Time_End": 43.0, "Text": " By holes, I don't mean hacking and e-banging and changing their website, posting up some alternative message."}, {"Time_Start": 44.0, "Time_End": 57.0, "Text": " What I mean is gaining access to an arbitrary number of usernames and passwords from the service of the Hotmail service, the Exciter, the Yahoo Mail, things like that."}, {"Time_Start": 60.0, "Time_End": 65.0, "Text": " And the way that, what we focus on really, is not working at the level of networking."}, {"Time_Start": 66.0, "Time_End": 69.0, "Text": " So we work a little bit higher, we work at the level of the application itself."}, {"Time_Start": 70.0, "Time_End": 75.0, "Text": " So, we're not going in and we're not trying to compromise a firewall."}, {"Time_Start": 76.0, "Time_End": 85.0, "Text": " We're not trying to gain root on the server. We're actually taking advantage of holes that are in the web application layer."}, {"Time_Start": 86.0, "Time_End": 89.0, "Text": " So, hypertext transfer protocol went above the actual application itself."}, {"Time_Start": 90.0, "Time_End": 92.0, "Text": " And we'll see how that's done."}, {"Time_Start": 93.0, "Time_End": 102.0, "Text": " Okay, and some of our targets have been, like I say, Hotmail, Yahoo, eBay, Lycos, Hidora, a whole bunch of services powered by Inet address, and Excite Mail."}, {"Time_Start": 105.0, "Time_End": 111.0, "Text": " So, yeah, so we're going to spend some time talking about Java, JavaScript, EBScript, Shockwave, and all these client-side technologies, okay?"}, {"Time_Start": 112.0, "Time_End": 120.0, "Text": " Because the way, it's funny, a lot of these large corporations spend a lot of money, a lot of energy, pay a lot of attention to gaining a really secure network."}, {"Time_Start": 121.0, "Time_End": 129.0, "Text": " And it turns out that the application itself is inherently insecure, so you don't have to know a bloody thing about networking in order to get in and compromise the system."}, {"Time_Start": 130.0, "Time_End": 136.0, "Text": " And, frighteningly enough, you don't actually even need to know a lot about server-side or, I mean, client-side programming."}, {"Time_Start": 137.0, "Time_End": 142.0, "Text": " A few lines of JavaScript is all it took to gain an arbitrary number of Hotmail usernames and passwords."}, {"Time_Start": 143.0, "Time_End": 158.0, "Text": " Okay, and just a little bit about our resources. Like I say, we're a small group, and everything that we do is pretty well-financed out of our own pocket."}, {"Time_Start": 159.0, "Time_End": 163.0, "Text": " We run our stuff off really old boxes. 486 is running for BSD."}, {"Time_Start": 164.0, "Time_End": 171.0, "Text": " And we lease a backroom space from our internet service provider. Our major cost is our internet service provider, which is about $200 a month."}, {"Time_Start": 172.0, "Time_End": 173.0, "Text": " We do most of our work from home."}, {"Time_Start": 174.0, "Time_End": 181.0, "Text": " So we don't collect any money from the holes that we find. We don't have any form of advertising or sponsorship, and we don't sell a product or a service."}, {"Time_Start": 182.0, "Time_End": 189.0, "Text": " So we all have day jobs, and this is sort of what we do when we come home and to unwind."}, {"Time_Start": 193.0, "Time_End": 202.0, "Text": " Okay, so the philosophy behind the sort of the experts that we find, like I say, when we do find a major hole in a large web service,"}, {"Time_Start": 203.0, "Time_End": 208.0, "Text": " we find that the best way to get it fixed is basically to fully disclose the nature of the problem."}, {"Time_Start": 209.0, "Time_End": 212.0, "Text": " That means provide full source and instructions on how it can be done."}, {"Time_Start": 213.0, "Time_End": 218.0, "Text": " And also, and this is really helpful for working with the media, actually provide an online working demo"}, {"Time_Start": 219.0, "Time_End": 221.0, "Text": " so that anybody can go to the site and pop credit from themselves."}, {"Time_Start": 222.0, "Time_End": 228.0, "Text": " And there was a really interesting talk yesterday about a fellow here that was talking about how you can interact with the media."}, {"Time_Start": 229.0, "Time_End": 237.0, "Text": " And he was suggesting that you shift the onus to the hacker to educate the media."}, {"Time_Start": 238.0, "Time_End": 243.0, "Text": " And that's fair. That's actually the case. And my recommendation is that don't let the media write your story,"}, {"Time_Start": 244.0, "Time_End": 247.0, "Text": " write your own story, put it up on your own website, and then just point them to the website."}, {"Time_Start": 248.0, "Time_End": 250.0, "Text": " That's the best way for them to get the facts straight."}, {"Time_Start": 251.0, "Time_End": 257.0, "Text": " Okay, anyway, the net result of finding these holes is that they result in a better web-based service, okay?"}, {"Time_Start": 258.0, "Time_End": 264.0, "Text": " So the whole point of finding these security holes is to improve the service, not to go out and bring them down"}, {"Time_Start": 264.0, "Time_End": 270.0, "Text": " by storing thousands of user names and passwords in a database and then writing a program that does some funny stuff."}, {"Time_Start": 275.0, "Time_End": 281.0, "Text": " Okay, so in the experts we found there's been sort of a funny kind of a pattern, a life cycle almost to the exploit."}, {"Time_Start": 282.0, "Time_End": 293.0, "Text": " It tends to be the same thing over and over again. When you find a hole, and again I'm focusing on these holes that are accomplished through client-side programming,"}, {"Time_Start": 294.0, "Time_End": 300.0, "Text": " generally the first thing we do is we warn the web-based service that they do in fact have a major security hole."}, {"Time_Start": 301.0, "Time_End": 309.0, "Text": " And it's quite common actually to get ignored or banned or just plenty refuted, all three."}, {"Time_Start": 310.0, "Time_End": 315.0, "Text": " So the next step, the next thing that we do is we post a working demo on the source code on our website."}, {"Time_Start": 316.0, "Time_End": 324.0, "Text": " After that, usually the web community picks up on it, it gets into bug track in the news groups, and the web media picks it up,"}, {"Time_Start": 325.0, "Time_End": 328.0, "Text": " wire.com and news.com and slash dot and things like that."}, {"Time_Start": 329.0, "Time_End": 336.0, "Text": " And if it generates enough interest, which is usually the case if it's a major up hole, then the paper media picks it up,"}, {"Time_Start": 337.0, "Time_End": 341.0, "Text": " a local paper or a national paper, something like that, and it starts getting thrown around the papers."}, {"Time_Start": 342.0, "Time_End": 348.0, "Text": " And basically once the web media picks it up, the online service itself will have a knee-jerk reaction,"}, {"Time_Start": 349.0, "Time_End": 356.0, "Text": " and they will quickly try and fix the problem overnight, which is sort of an up hole patch."}, {"Time_Start": 357.0, "Time_End": 362.0, "Text": " There's a major problem, and that suddenly the information is posted out there on the web for anyone to see,"}, {"Time_Start": 363.0, "Time_End": 365.0, "Text": " and the first thing that they want to do is they want to patch the problem as quickly as possible."}, {"Time_Start": 365.0, "Time_End": 372.0, "Text": " So generally they will put out a patch that specifically targets the demonstration that's been put online,"}, {"Time_Start": 373.0, "Time_End": 377.0, "Text": " without actually in many cases solving the underlying problem."}, {"Time_Start": 378.0, "Time_End": 383.0, "Text": " So it's not uncommon for them to release a quick fix and then to be able to compromise that again the next day,"}, {"Time_Start": 384.0, "Time_End": 385.0, "Text": " which is pretty funny."}, {"Time_Start": 388.0, "Time_End": 391.0, "Text": " And of course the net result is that we all get reaction fans."}, {"Time_Start": 396.0, "Time_End": 399.0, "Text": " But it does result in a better product, and we feel much better about ourselves."}, {"Time_Start": 403.0, "Time_End": 410.0, "Text": " Okay, so just briefly I'd like to talk about, just to sort of set the stage for understanding,"}, {"Time_Start": 411.0, "Time_End": 416.0, "Text": " how can it be so easy to gain access to all this data sitting behind ultra-secure firewalls, etc."}, {"Time_Start": 417.0, "Time_End": 426.0, "Text": " To set the stage, I'm going to have to talk a little bit about HTML and the interaction between web client and a web server."}, {"Time_Start": 427.0, "Time_End": 430.0, "Text": " Okay, so HTML in brief, let's get this over with in 22 seconds."}, {"Time_Start": 431.0, "Time_End": 433.0, "Text": " Just out of curiosity, how many people here actually have worked in HTML?"}, {"Time_Start": 434.0, "Time_End": 435.0, "Text": " Oh, the vast majority, okay."}, {"Time_Start": 436.0, "Time_End": 439.0, "Text": " And I was sort of thinking that you're all networking gurus that didn't bother going up that high."}, {"Time_Start": 440.0, "Time_End": 441.0, "Text": " Okay, that's cool."}, {"Time_Start": 442.0, "Time_End": 445.0, "Text": " Okay, so in that case, I really can make this brief."}, {"Time_Start": 446.0, "Time_End": 452.0, "Text": " As we all know, at its simplest, HTML is a series of tags that's applied to a text and a text document"}, {"Time_Start": 453.0, "Time_End": 457.0, "Text": " to mark it up so that when it's displayed by a browser, the browser will, to make a long story short,"}, {"Time_Start": 458.0, "Time_End": 465.0, "Text": " so that the browser will know how to display it, how to format it, what images to display, things like that."}, {"Time_Start": 465.0, "Time_End": 471.0, "Text": " So, yeah, the browser reads the tags for information on formatting, creating hyperlinks, displaying images,"}, {"Time_Start": 472.0, "Time_End": 474.0, "Text": " and that's really what a super simple web page is, right?"}, {"Time_Start": 475.0, "Time_End": 477.0, "Text": " But it's hard. The web is all about text and images."}, {"Time_Start": 478.0, "Time_End": 481.0, "Text": " At least that's what it was originally, and then the web became more complicated than that."}, {"Time_Start": 482.0, "Time_End": 487.0, "Text": " Suddenly, people, actually, this was built in from the very beginning, but the web became more complicated"}, {"Time_Start": 488.0, "Time_End": 492.0, "Text": " because we now have the power to do server-side processing, right?"}, {"Time_Start": 492.0, "Time_End": 497.0, "Text": " We have the ability to tie the front end into a back end through HTML forms."}, {"Time_Start": 499.0, "Time_End": 503.0, "Text": " So, that's server-side processing, right? CGI scripting, initially."}, {"Time_Start": 504.0, "Time_End": 507.0, "Text": " So we could connect the front end to the back end."}, {"Time_Start": 508.0, "Time_End": 509.0, "Text": " And then another cool thing came along."}, {"Time_Start": 510.0, "Time_End": 514.0, "Text": " Suddenly, we found that we could do client-side scripting, right?"}, {"Time_Start": 515.0, "Time_End": 518.0, "Text": " So using things like JavaScript, Java AppWords, Shockwave, Flash, right,"}, {"Time_Start": 519.0, "Time_End": 520.0, "Text": " and all the stuff that comes in with the plugins,"}, {"Time_Start": 521.0, "Time_End": 525.0, "Text": " suddenly we had the option to either do processing right in the browser itself"}, {"Time_Start": 526.0, "Time_End": 530.0, "Text": " or to transfer all the knowledge or all the data that a user fills out in a form,"}, {"Time_Start": 531.0, "Time_End": 536.0, "Text": " send that back over to the server, and then have the server do some form of processing and create a follow-up page."}, {"Time_Start": 544.0, "Time_End": 547.0, "Text": " Okay, so the link between the front end and the back end."}, {"Time_Start": 548.0, "Time_End": 549.0, "Text": " Let's look at that."}, {"Time_Start": 550.0, "Time_End": 553.0, "Text": " I want to focus a little bit on the back end, the server-side program."}, {"Time_Start": 554.0, "Time_End": 556.0, "Text": " The link between the front end and the back end is an HTML form."}, {"Time_Start": 557.0, "Time_End": 558.0, "Text": " What is a form?"}, {"Time_Start": 559.0, "Time_End": 562.0, "Text": " A form is just a collection of graphical user interface elements, right?"}, {"Time_Start": 563.0, "Time_End": 569.0, "Text": " So things like text boxes, text fields, radio buttons, check boxes, things like that, right?"}, {"Time_Start": 570.0, "Time_End": 571.0, "Text": " That's a form."}, {"Time_Start": 572.0, "Time_End": 574.0, "Text": " And it's implemented as an HTML tag, okay?"}, {"Time_Start": 575.0, "Time_End": 578.0, "Text": " Now the tag, that form tag that makes those graphical user interface elements"}, {"Time_Start": 579.0, "Time_End": 581.0, "Text": " also provides other information, okay?"}, {"Time_Start": 584.0, "Time_End": 588.0, "Text": " It also points to, you can see up here, here's an example of a form tag, right?"}, {"Time_Start": 589.0, "Time_End": 594.0, "Text": " You can see it actually, it has an action attribute there that actually points to the server-side programming"}, {"Time_Start": 595.0, "Time_End": 598.0, "Text": " that's going to process the form data, right?"}, {"Time_Start": 600.0, "Time_End": 603.0, "Text": " It also has an attribute called method, which can either be set to post or get,"}, {"Time_Start": 603.0, "Time_End": 610.0, "Text": " that just basically specifies how the data is going to be transmitted to the server."}, {"Time_Start": 611.0, "Time_End": 616.0, "Text": " And here you have some input tags, and those actually create the graphical user interface elements themselves, okay?"}, {"Time_Start": 617.0, "Time_End": 618.0, "Text": " So in a form you have two things."}, {"Time_Start": 619.0, "Time_End": 621.0, "Text": " The form allows you to create the graphical user interface elements."}, {"Time_Start": 622.0, "Time_End": 630.0, "Text": " And inside those, inside the form, the form holds the data, okay, that the user will be typing in, okay?"}, {"Time_Start": 631.0, "Time_End": 637.0, "Text": " So if you have a name and password field in a web application, someone types their name and password into a form,"}, {"Time_Start": 638.0, "Time_End": 644.0, "Text": " that data is a part of the form and can be accessed, as we'll see later, through client-side scripting, okay?"}, {"Time_Start": 645.0, "Time_End": 650.0, "Text": " It's considered to be a part of the form now, accessible through the document object model, which I'll talk about a bit later."}, {"Time_Start": 651.0, "Time_End": 654.0, "Text": " Okay, so anyway, the big picture is that the form ties the front end to the back end,"}, {"Time_Start": 655.0, "Time_End": 657.0, "Text": " and it contains the data that people fill in in the form itself."}, {"Time_Start": 658.0, "Time_End": 663.0, "Text": " Okay, so people go to the form, they fill out all their information, they fill out their username, they fill out their password,"}, {"Time_Start": 664.0, "Time_End": 665.0, "Text": " they click the submit button, and what happens?"}, {"Time_Start": 666.0, "Time_End": 675.0, "Text": " All that great data in the form gets packaged up and sent over to the server-side program that is specified here in this action field, right?"}, {"Time_Start": 676.0, "Time_End": 681.0, "Text": " So it gets sent over to the server-side program, the server-side program takes those new value pairs, in other words, the data from the form,"}, {"Time_Start": 682.0, "Time_End": 686.0, "Text": " does something useful, who knows what, and then creates a follow-up page."}, {"Time_Start": 687.0, "Time_End": 691.0, "Text": " Okay, we're all familiar with this, I'm not going to belabor the point, but, you know, we've all used search engines, right?"}, {"Time_Start": 692.0, "Time_End": 695.0, "Text": " We've all, many of us have probably used webmail and e-commerce sites, okay?"}, {"Time_Start": 696.0, "Time_End": 700.0, "Text": " This is the basic premise behind all that cool stuff, okay?"}, {"Time_Start": 701.0, "Time_End": 704.0, "Text": " Most of the time, you're actually just sending the data over to a server-side program."}, {"Time_Start": 704.0, "Time_End": 711.0, "Text": " So, what is the form?"}, {"Time_Start": 712.0, "Time_End": 717.0, "Text": " The form really constitutes the basis of a web application, right?"}, {"Time_Start": 718.0, "Time_End": 726.0, "Text": " It's pretty hard to have a web application, a portal site, or whatever you want to call it, without using forms, without tying the front end to the back end, right?"}, {"Time_Start": 727.0, "Time_End": 731.0, "Text": " This form will contain user authentication information."}, {"Time_Start": 732.0, "Time_End": 738.0, "Text": " In some way, shape, or form, a web application has to keep track of its users, right?"}, {"Time_Start": 739.0, "Time_End": 743.0, "Text": " It has to keep track of who you are, what are you ordering, what's your credit card number, okay?"}, {"Time_Start": 744.0, "Time_End": 752.0, "Text": " But the basic user authentication information is quite likely, quite often, passed back and forth between the client and the server, okay?"}, {"Time_Start": 753.0, "Time_End": 756.0, "Text": " So usually, just by looking at a form and a page, you can pick out a lot of really useful information."}, {"Time_Start": 757.0, "Time_End": 768.0, "Text": " So the bottom line is that when you are in a session with a web application, what you don't want is you wouldn't like it if somebody else could see the values inside your form, okay?"}, {"Time_Start": 769.0, "Time_End": 774.0, "Text": " Because that's your data. It's your user name, your password, and your credit card number is what's sitting in that form, right?"}, {"Time_Start": 775.0, "Time_End": 781.0, "Text": " And generally speaking, it would be pretty hard for someone to be able to reach into that form and grab that data out of there because it's on your web page, right?"}, {"Time_Start": 781.0, "Time_End": 788.0, "Text": " Nobody else has it, just you. Everybody has their own user name and password embedded in the form that they get from the web application."}, {"Time_Start": 789.0, "Time_End": 791.0, "Text": " So what's the problem? How can there be a security role?"}, {"Time_Start": 799.0, "Time_End": 803.0, "Text": " Now, to understand that, we have to have a look at the other side. Let's look at the flip side now. Let's just look at the client side."}, {"Time_Start": 804.0, "Time_End": 807.0, "Text": " Let's say we want to do processing, but we don't want to communicate with the server, right?"}, {"Time_Start": 807.0, "Time_End": 812.0, "Text": " We don't want to send all that data back to the server for processing. We want to do it all in the browser itself."}, {"Time_Start": 813.0, "Time_End": 821.0, "Text": " We can do that using client side technologies like JavaScript, VBScript, Shockwave, Flash, Java Atlas, okay?"}, {"Time_Start": 822.0, "Time_End": 826.0, "Text": " So of those, you can sort of break all those client side technologies down into two major groups."}, {"Time_Start": 827.0, "Time_End": 833.0, "Text": " In one case, the actual code is sitting right inside the HTML document, okay?"}, {"Time_Start": 834.0, "Time_End": 839.0, "Text": " So it's right inside script tags, smack right there in the HTML document itself, okay?"}, {"Time_Start": 840.0, "Time_End": 842.0, "Text": " Examples of that are JavaScript and VBScript."}, {"Time_Start": 844.0, "Time_End": 852.0, "Text": " In the other case, the code that gets, the code is not sitting right in the HTML document, but it's actually sitting in a separate file on the web server."}, {"Time_Start": 853.0, "Time_End": 860.0, "Text": " And what the browser does is the browser has to go fetch that file, download it, execute it, okay?"}, {"Time_Start": 861.0, "Time_End": 867.0, "Text": " So either the code is directly in the HTML document or it's in a separate document, like a class file, if it's Java, right?"}, {"Time_Start": 870.0, "Time_End": 874.0, "Text": " Okay, so which of these, out of these two categories, which is the most powerful, which presents the biggest threat?"}, {"Time_Start": 875.0, "Time_End": 880.0, "Text": " Well, we all present a threat. We've shown holes with both kinds of client side technologies."}, {"Time_Start": 881.0, "Time_End": 883.0, "Text": " By generally speaking, category A is more powerful."}, {"Time_Start": 883.0, "Time_End": 887.0, "Text": " Category A has more direct control over the document object model."}, {"Time_Start": 888.0, "Time_End": 893.0, "Text": " It has more control over being able to manipulate the different aspects of an HTML document, okay?"}, {"Time_Start": 894.0, "Time_End": 899.0, "Text": " So JavaScript, VBScript are generally more powerful."}, {"Time_Start": 900.0, "Time_End": 905.0, "Text": " And of those two, JavaScript is more powerful simply because it's supported in your browsers, okay?"}, {"Time_Start": 906.0, "Time_End": 909.0, "Text": " JavaScript is supported in both Netscape and Intramed Explorer."}, {"Time_Start": 910.0, "Time_End": 918.0, "Text": " Although I'm sure Microsoft is calling it JScript or something, but it's just like, oh, oh, you see that one?"}, {"Time_Start": 927.0, "Time_End": 929.0, "Text": " Do you think we just saw this one?"}, {"Time_Start": 931.0, "Time_End": 936.0, "Text": " Okay, so how powerful is this JavaScript anyway? What can it do? What can it not do?"}, {"Time_Start": 937.0, "Time_End": 942.0, "Text": " Okay, well first that's, I mean, it's very powerful. So let's start with what JavaScript can't do, okay?"}, {"Time_Start": 943.0, "Time_End": 946.0, "Text": " JavaScript cannot reach into the local file system, okay?"}, {"Time_Start": 947.0, "Time_End": 953.0, "Text": " And this is what, I know that you can use JavaScript to set cookies and stuff, but in general, JavaScript cannot reach into local file system."}, {"Time_Start": 954.0, "Time_End": 961.0, "Text": " So you don't have to worry about downloading somebody's HTML page and having a rogue JavaScript output or a rogue piece of JavaScript that's going to go deleting your hard drive, okay?"}, {"Time_Start": 962.0, "Time_End": 965.0, "Text": " JavaScript can't reach into your local file system."}, {"Time_Start": 967.0, "Time_End": 977.0, "Text": " Now what it can do, okay, there's another restriction that I want to talk about."}, {"Time_Start": 978.0, "Time_End": 983.0, "Text": " How many of us, well, I suppose that if many of us are familiar with HTML, we're also familiar with framed documents, right?"}, {"Time_Start": 984.0, "Time_End": 989.0, "Text": " So that's when you go to a website and the website is broken up into frames, each frame holds a different HTML document, right?"}, {"Time_Start": 990.0, "Time_End": 993.0, "Text": " So in that case, the website is containing more than one HTML document at a time."}, {"Time_Start": 993.0, "Time_End": 1002.0, "Text": " Can JavaScript be in one of those documents and reach over and manipulate what's going on in one of the other frames? It depends."}, {"Time_Start": 1003.0, "Time_End": 1009.0, "Text": " If the HTML document in those other frames is basically coming from the same domain, you know, it can."}, {"Time_Start": 1010.0, "Time_End": 1013.0, "Text": " If it's a different website entirely, no, not really, it can't."}, {"Time_Start": 1016.0, "Time_End": 1022.0, "Text": " Same applies for actually having another browser window open at the same time that has another HTML document loaded into it."}, {"Time_Start": 1023.0, "Time_End": 1029.0, "Text": " Okay, so that's what JavaScript cannot do. What can JavaScript do?"}, {"Time_Start": 1030.0, "Time_End": 1039.0, "Text": " Well, JavaScript can do a lot. Usually it's used for things like validating its legitimate uses or things like form validation and image swapping."}, {"Time_Start": 1040.0, "Time_End": 1045.0, "Text": " You know, when you surf around the web and you move your mouse over and then your bar and the image lights up or something like that, right?"}, {"Time_Start": 1046.0, "Time_End": 1052.0, "Text": " That's done with JavaScript. Or you type in, you go to a page and you type in your name and you click the submit button."}, {"Time_Start": 1053.0, "Time_End": 1064.0, "Text": " You forgot to type in your last name. Even before the browser bothers to contact the server, a client-side process will occur where it validates a form input to see whether or not you forgot to fill in one of the fields, right?"}, {"Time_Start": 1065.0, "Time_End": 1067.0, "Text": " So that's called form validation to do that with JavaScript."}, {"Time_Start": 1067.0, "Time_End": 1092.0, "Text": " Now, what makes JavaScript powerful is that it can open up a sort of HTML document for output, so it can write auditory text to the browser, so it can create a follow-up page, right?"}, {"Time_Start": 1092.0, "Time_End": 1102.0, "Text": " It can dynamically create an HTML document. It can also look around in the HTML document that it's embedded in."}, {"Time_Start": 1103.0, "Time_End": 1118.0, "Text": " So it can, if there's also a form on the same page as the JavaScript, or even in a separate frame that it has access to, the JavaScript can reach right into that form and pull out whatever data is in that form."}, {"Time_Start": 1119.0, "Time_End": 1133.0, "Text": " So JavaScript can suck the data out of a form. Now, so far, it still isn't clear how this could compromise security, right? Because the JavaScript is on your page. The form is on your page, right? Or the page of an internet service provider."}, {"Time_Start": 1134.0, "Time_End": 1144.0, "Text": " So why would anybody write JavaScript to compromise their own form? Well, let's see what the problem is."}, {"Time_Start": 1149.0, "Time_End": 1156.0, "Text": " Actually, before I tell you the big secret about how it compromises security, there's one more thing I want to cover."}, {"Time_Start": 1157.0, "Time_End": 1165.0, "Text": " Is JavaScript only limited to, is its power only limited to the client side, or can it actually interact with the server?"}, {"Time_Start": 1166.0, "Time_End": 1177.0, "Text": " Well, it can't directly interact with the server, but like I say, what it can do is it can read information from the form, and what it can do is it can also send data, okay?"}, {"Time_Start": 1178.0, "Time_End": 1188.0, "Text": " It can basically redirect the browser to a new arbitrary URL, okay? So using a GET request, it can actually contact any server-side program anywhere on the web, okay?"}, {"Time_Start": 1189.0, "Time_End": 1201.0, "Text": " So it could read the information from the form and then send that data to an arbitrary server by a GET request, or it could change the data in the form so that it's sending bogus data to the back-end program, right?"}, {"Time_Start": 1204.0, "Time_End": 1213.0, "Text": " And also, like I said, it can redirect to any, it can create dynamically any follow-up page, or it can redirect to any existing web page on the web, okay?"}, {"Time_Start": 1214.0, "Time_End": 1218.0, "Text": " So it's still not clear how this compromises security, I'm just giving you a taste of the power of JavaScript."}, {"Time_Start": 1219.0, "Time_End": 1225.0, "Text": " Okay, but what we've learned so far is that obviously JavaScript can manipulate an HTML document in which it is embedded, okay?"}, {"Time_Start": 1226.0, "Time_End": 1237.0, "Text": " So it has almost total control over the HTML document in which it resides, as well as being able to control follow-up documents or documents in other frames and windows from the same domain."}, {"Time_Start": 1238.0, "Time_End": 1247.0, "Text": " So, given that information, would it be wise to allow a user to post their own JavaScript into a public web application?"}, {"Time_Start": 1248.0, "Time_End": 1265.0, "Text": " If you were a portal, if you were a web service provider, would it be a good idea to allow users to post JavaScript onto the same page as your own forms, the forms that thousands of users are going to be using to authenticate themselves and send data back and forth to your service?"}, {"Time_Start": 1266.0, "Time_End": 1269.0, "Text": " Hmm, let me think about that. No, it's not."}, {"Time_Start": 1272.0, "Time_End": 1278.0, "Text": " Okay, but surprisingly, surprisingly, it happens all the time, okay?"}, {"Time_Start": 1280.0, "Time_End": 1294.0, "Text": " So what are the susceptible online services? Well, the susceptible online services is any web application that gives the user the ability to post HTML, okay, including JavaScript, that would be incorporated into the website's own HTML content."}, {"Time_Start": 1295.0, "Time_End": 1307.0, "Text": " And viewed by other people, right? So what are some examples of these susceptible services? Things like web mail, online auctions, web-based chat rooms, basically any service with a chat area, okay?"}, {"Time_Start": 1308.0, "Time_End": 1324.0, "Text": " So that's just, those are just in general categories, but basically any service, any service where a user can post their own stuff into the web application is walking on thin ice."}, {"Time_Start": 1325.0, "Time_End": 1329.0, "Text": " So let's have a look at web mail services."}, {"Time_Start": 1330.0, "Time_End": 1346.0, "Text": " Okay, so what we were able to do, we hosted online working demos that stole usernames and passwords from Microsoft's Hotmail using JavaScript, both before and after they released a patch, Yahoo Mail, using Java, and Microsoft's Hotmail, again, using Shockwave."}, {"Time_Start": 1346.0, "Time_End": 1355.0, "Text": " And we also found vulnerabilities in the web mail services of Yahoo, iPost, eDora, and all the sites powered by online that address a mail website."}, {"Time_Start": 1356.0, "Time_End": 1371.0, "Text": " What was the real-world effect, if this had gone unnoticed? Well, the implications of stealing usernames and passwords from these services is that it allows the bad guy to, in the case of a web mail service, to delete, send, and read the victim's email."}, {"Time_Start": 1371.0, "Time_End": 1379.0, "Text": " Okay, to check other mail accounts by mail checking, for those of you that use Hotmail, you'll know that you can configure it to check email on your other accounts."}, {"Time_Start": 1380.0, "Time_End": 1392.0, "Text": " Access the address book, change the password of the web mail account itself, play around with preferences, basically it's just, you wouldn't want a script to be getting into your web mail."}, {"Time_Start": 1393.0, "Time_End": 1402.0, "Text": " And, you know, I won't help you crack Hotmail to find out if you're supposed to cheat on me, just to answer a lot of the email I tend to get for some reason."}, {"Time_Start": 1408.0, "Time_End": 1418.0, "Text": " Okay, so how does it work? How is it that a large web mail service, how is it that posting JavaScript can affect a large web mail service?"}, {"Time_Start": 1419.0, "Time_End": 1428.0, "Text": " Okay, here's one example of an algorithm that illustrates the problem."}, {"Time_Start": 1429.0, "Time_End": 1446.0, "Text": " Okay, so imagine that you've logged into your Hotmail, or some other web mail account, and you send someone an email, and in many of these web mail services, you're allowed to use HTML to make your email a little more interesting."}, {"Time_Start": 1447.0, "Time_End": 1455.0, "Text": " Maybe you want to send an image, maybe you want to include a shockwave or something like that, so many of these web mail applications allow you to include HTML."}, {"Time_Start": 1456.0, "Time_End": 1462.0, "Text": " So imagine that your email, your web mail actually contains some script tags and some JavaScript in it."}, {"Time_Start": 1463.0, "Time_End": 1472.0, "Text": " Okay, so you send it off to the other person, the other person checks their web mail, and what happens when they view the page?"}, {"Time_Start": 1472.0, "Time_End": 1478.0, "Text": " Well, the JavaScript starts running, and the first thing that it does is it sucks the authentication information from their form."}, {"Time_Start": 1479.0, "Time_End": 1492.0, "Text": " Then it goes and it changes every hyperlink in every frame to point to a different server-side program, not Hotmail, for example, but instead your own server-side mailing program."}, {"Time_Start": 1493.0, "Time_End": 1503.0, "Text": " To be more specific, you're pointing to a server-side mailing program, and you're including your own query string, your own information that you're going to send to the server-side program."}, {"Time_Start": 1504.0, "Time_End": 1510.0, "Text": " And what information might that be? Well, in the worst case scenario, it could be that authentication data, the username and password, for example."}, {"Time_Start": 1511.0, "Time_End": 1522.0, "Text": " So, the JavaScript redirects to this mailing program. The mailing program sends the user in the password off to, who knows who, Mr. Bad Guy, I guess."}, {"Time_Start": 1523.0, "Time_End": 1535.0, "Text": " And the mailing program itself then does a redirect and sends the user back to the normal, legitimate follow-up page of the web application so that, in their eyes, nothing unusual has occurred. It's all transparent to the user."}, {"Time_Start": 1536.0, "Time_End": 1553.0, "Text": " Now, up at the very top, I'd say that this is Webmail X.1, snagging username and password old, and the reason that's old is that very few Webmail services now will include any really useful or directly useful authentication information in their forms."}, {"Time_Start": 1554.0, "Time_End": 1558.0, "Text": " Usually, it's a little bit hard to decipher, more like a session key or something like that."}, {"Time_Start": 1559.0, "Time_End": 1570.0, "Text": " So, this may have worked a little while ago, and they work in the smaller services still, but it generally wouldn't work that well nowadays."}, {"Time_Start": 1571.0, "Time_End": 1577.0, "Text": " Okay, something a little trickier. Let's have a look at how you could get the same effect using spoofing."}, {"Time_Start": 1578.0, "Time_End": 1585.0, "Text": " Okay, so again, you go and you send someone an email that contains JavaScript."}, {"Time_Start": 1586.0, "Time_End": 1596.0, "Text": " Now, this time, again, the JavaScript alters every hyperlink and every frame of the web application, so you're guaranteed at some point someone's going to click on one of these rigged links."}, {"Time_Start": 1597.0, "Time_End": 1605.0, "Text": " Now, when they do click on those links, the JavaScript dynamically creates a follow-up page. What does a follow-up page look like?"}, {"Time_Start": 1606.0, "Time_End": 1624.0, "Text": " Well, a follow-up page is an exact duplicate of a legitimate page that says, well, you have just timed out of this service, please re-login and you're using a password, and these web service applications generally really do have a page that says that, right?"}, {"Time_Start": 1625.0, "Time_End": 1630.0, "Text": " So, in this case, you make it look exactly like that. You inform the user that they've timed out. Of course, they really haven't, right?"}, {"Time_Start": 1631.0, "Time_End": 1637.0, "Text": " And then they wonder, ah, didn't they experience that moment of frustration? Like, geez, it didn't time out? Ah, fine, whatever."}, {"Time_Start": 1638.0, "Time_End": 1646.0, "Text": " And then they go and they type their username and password back into the form which you conveniently provided, and of course, that form is of your own engineering."}, {"Time_Start": 1647.0, "Time_End": 1652.0, "Text": " And what does it point to? Well, again, it points to, let's see, and this is, what does it do?"}, {"Time_Start": 1655.0, "Time_End": 1665.0, "Text": " Yeah. So, in this case, once you've gone that far, we're going to think it's in your domain, right? So, you can do whatever you want with it. You can redirect to a server-side mailing program, mail it back to the back guy."}, {"Time_Start": 1668.0, "Time_End": 1676.0, "Text": " This is, ah, not so old. This is, ah, I think this still works, actually."}, {"Time_Start": 1677.0, "Time_End": 1687.0, "Text": " We pointed this problem out in Microsoft's Hotmail service, and they came up with a couple patches, but as far as I know, it still works for there."}, {"Time_Start": 1690.0, "Time_End": 1701.0, "Text": " You can actually send data in the message body of an email, but it still works as an attachment using, not using JavaScript, but using another client-side technology, which I'll do to figure out what it is."}, {"Time_Start": 1702.0, "Time_End": 1725.0, "Text": " Okay, example three. Here's another twist on the same theme. So, let's say that the web service provider finally catches on and they say, hey, wait a minute, this JavaScript is bad news. That's it. I am filtering out JavaScript. So, fine. They filter out their JavaScript. Does that mean that the web application is now secure? Actually, no."}, {"Time_Start": 1726.0, "Time_End": 1737.0, "Text": " What happens is it turns out that you can do the exact same thing using a slight twist. You can do the exact same thing with many client-side technologies, okay? So, let's have a look at how you can do it with applets."}, {"Time_Start": 1738.0, "Time_End": 1753.0, "Text": " In this case, you send somewhere an email containing a Java applet. What does the applet look like? It doesn't have to look like anything. It can just be one pixel by one pixel applet. That is white on the white background, so the person can't even see it. It doesn't have to be a visible applet."}, {"Time_Start": 1754.0, "Time_End": 1777.0, "Text": " So, obviously, the user receives your email. They receive the applet, and the applet starts running, and what does the applet do? Well, it turns out that applets have a method available to them that can actually load our HTML documents into a specific frame of the frame set. I think it's called set applet context or something like that."}, {"Time_Start": 1778.0, "Time_End": 1786.0, "Text": " So, the applet itself has the ability to load an arbitrary HTML document into a different frame."}, {"Time_Start": 1788.0, "Time_End": 1797.0, "Text": " So, what does the applet do? Well, it loads a... Now, for those of you that are familiar with webmail service, you'll know that it's a framed environment, right?"}, {"Time_Start": 1798.0, "Time_End": 1807.0, "Text": " On the left-hand frame, you have your control panel. It's like compose new mail, check mail, whatever, all these options."}, {"Time_Start": 1808.0, "Time_End": 1823.0, "Text": " And the right-hand frame, you actually have email messages themselves. So, what does the applet do? Well, the applet goes into the left-hand frame, the frame that contains all the... basically the control pad for the mail service."}, {"Time_Start": 1824.0, "Time_End": 1831.0, "Text": " And it replaces it with the bad guy's own HTML document, which, lo and behold, is an exact duplicate of the control panel."}, {"Time_Start": 1832.0, "Time_End": 1847.0, "Text": " But, of course, it's been engineered to do something slightly different. This new control panel is engineered so that every single link on the control panel, basically, is a link to load, guess what, a time-out message into the right-hand frame."}, {"Time_Start": 1848.0, "Time_End": 1859.0, "Text": " Again, from the bad guy's own mail server, right? Obviously, that page is totally under the control of the bad guy, and whenever the user enters their own relogging information, it's sent right back to the bad guy."}, {"Time_Start": 1860.0, "Time_End": 1863.0, "Text": " Now, it turns out you can also do the exact same thing with Sharkwave."}, {"Time_Start": 1864.0, "Time_End": 1877.0, "Text": " Now, the interesting thing here is that in the eyes of the browser itself, no security violation is going on with JavaScript, right? Because where is the JavaScript?"}, {"Time_Start": 1878.0, "Time_End": 1882.0, "Text": " The JavaScript is in an HTML document that's actually being served out from the web service itself."}, {"Time_Start": 1883.0, "Time_End": 1893.0, "Text": " As far as the browser's concerned, that JavaScript is Hotmail's JavaScript. It has free range going to any frame, change whatever it likes, all through the forms, right?"}, {"Time_Start": 1894.0, "Time_End": 1903.0, "Text": " And why? All because the web mail services allow people to post up their own JavaScript, which then gets incorporated into their own page. See, that's the problem."}, {"Time_Start": 1904.0, "Time_End": 1909.0, "Text": " Once that JavaScript is incorporated into their page, it has free range."}, {"Time_Start": 1913.0, "Time_End": 1915.0, "Text": " Okay."}, {"Time_Start": 1918.0, "Time_End": 1926.0, "Text": " Web-based auctions, same general idea. We posted an online working demo of a JavaScript expert that stole usernames and passwords of eBay users."}, {"Time_Start": 1927.0, "Time_End": 1932.0, "Text": " And also, interestingly, it can be extended to replicate itself by inserting itself into people's own auctions."}, {"Time_Start": 1933.0, "Time_End": 1938.0, "Text": " And this was coined the eBay-la virus, and it caught a little bit of media attention. That was a pretty funny name, I thought."}, {"Time_Start": 1939.0, "Time_End": 1941.0, "Text": " eBay-la, people liked it."}, {"Time_Start": 1944.0, "Time_End": 1954.0, "Text": " Okay, so what is the exploit? In this twist, you post an item up for auction at eBay, and I don't know, how many people here have actually been to eBay?"}, {"Time_Start": 1955.0, "Time_End": 1960.0, "Text": " So you know that when you post an item at eBay, all the items have associated descriptions."}, {"Time_Start": 1961.0, "Time_End": 1966.0, "Text": " And when you go to post your own item up, there's a place where you can type in your own description of what the item is going to be, right?"}, {"Time_Start": 1967.0, "Time_End": 1975.0, "Text": " And eBay has decided to let you use any sort of HTML tags you want in your description of the item that you want to sell."}, {"Time_Start": 1976.0, "Time_End": 1983.0, "Text": " Uh-oh. So in your description, you type out your script tags, insert some JavaScript, and what does this JavaScript do?"}, {"Time_Start": 1984.0, "Time_End": 1995.0, "Text": " Well, let's talk a little bit about eBay. It turns out that when another person comes to view your item that's up for auction, what does that look like on the screen?"}, {"Time_Start": 1996.0, "Time_End": 2006.0, "Text": " Well, there's a description of the item, right? And right underneath the description of the item is a form."}, {"Time_Start": 2007.0, "Time_End": 2013.0, "Text": " So that if you want to bid on the item, you can enter your username, password to make your bid, right?"}, {"Time_Start": 2014.0, "Time_End": 2020.0, "Text": " So basically, the description of the item is on the exact same page as the form where you enter your username and password."}, {"Time_Start": 2021.0, "Time_End": 2028.0, "Text": " Uh-oh. That's bad. Because as we all know, the item description contains JavaScript. What does the JavaScript do?"}, {"Time_Start": 2029.0, "Time_End": 2034.0, "Text": " Well, the JavaScript will immediately start playing around with the form, okay? And there's a whole bunch of things that it can do."}, {"Time_Start": 2035.0, "Time_End": 2041.0, "Text": " It can suddenly say, well, yes, thank you for typing in your username and password, but I don't think we'll be sending that to eBay right away."}, {"Time_Start": 2041.0, "Time_End": 2052.0, "Text": " First, let's send that off to Mr. Bad Guy, and on a server-side mailing program, that does a redirect to a normal, back-to-the-normal eBay follow-up page, right?"}, {"Time_Start": 2053.0, "Time_End": 2064.0, "Text": " So from the point of view of the user, what's happened? They've seen an item description. They placed a bid on it. The next page. They told that their bid was registered."}, {"Time_Start": 2065.0, "Time_End": 2068.0, "Text": " Great, right? From that point of view, nothing unusual has happened."}, {"Time_Start": 2069.0, "Time_End": 2075.0, "Text": " Okay, so what are the implications of, in this case, with this web application, what are the implications of stealing the username and password?"}, {"Time_Start": 2076.0, "Time_End": 2084.0, "Text": " Well, in this case, you can use them to create new options, and what does that do? That actually automatically charges the victim's account, right?"}, {"Time_Start": 2085.0, "Time_End": 2090.0, "Text": " So suddenly, we're not just dealing with, you know, we're dealing with real money."}, {"Time_Start": 2091.0, "Time_End": 2098.0, "Text": " You can place it at bids in the victim's name. You can retract legitimate bids in the victim's name. You can change the victim's username and password."}, {"Time_Start": 2099.0, "Time_End": 2112.0, "Text": " You can prematurely close an auction, and also, eBay has some really great, powerful server-side programs that allow you to change the description of your own item, even after it's gone up for bid."}, {"Time_Start": 2113.0, "Time_End": 2125.0, "Text": " How do you do that when I turn to your username and password? So if I know your username and password, if I've stolen your username and password, and it turns out that you yourself are an eBay user that is running an auction."}, {"Time_Start": 2126.0, "Time_End": 2140.0, "Text": " Well, now I can go into your auction, post my eBay code into your auction, right? That can actually be done automatically, so that in effect what you have is a virus that is spreading from auction item to auction item."}, {"Time_Start": 2141.0, "Time_End": 2150.0, "Text": " If somebody goes to the auction, they place a bid. If they themselves are running an auction, then suddenly the code is in there. Auction item description."}, {"Time_Start": 2151.0, "Time_End": 2169.0, "Text": " Now, that was never actually, I never actually wrote that. I just wrote, I never wrote the self-replicating kind, although it would have been trivial to extend it, and eBay eventually patched the problem after two and a half months."}, {"Time_Start": 2170.0, "Time_End": 2188.0, "Text": " Okay, so that's the bad news. What's the good news? Is there a way that designers can take advantage of this information to improve their site? Yes, there is."}, {"Time_Start": 2189.0, "Time_End": 2204.0, "Text": " Okay, if you're running a kind of a web service where users must be allowed to post their own HTML content to public areas, especially to public areas that contain forms, then you should take the following steps."}, {"Time_Start": 2205.0, "Time_End": 2220.0, "Text": " One, filter the content for client side processes slash tags. So, it's hard, but at least make the attempt to filter out script tags, applet tags, shockwave, flash, things like that."}, {"Time_Start": 2221.0, "Time_End": 2236.0, "Text": " And when the time does come for you to write your filtering software, a common mistake that I see is that the programs are written from the perspective of filtering in, from filtering out instead of filtering in."}, {"Time_Start": 2237.0, "Time_End": 2252.0, "Text": " What's the difference between filtering out and filtering in? Well, it's the difference between starting from the premise that you're going to let everything in, except for that, that, that, that, as opposed to saying, I'm not letting anything in, except that, that, that, that."}, {"Time_Start": 2253.0, "Time_End": 2257.0, "Text": " The latter is what you want. You want to start with the premise, I'm not letting anything in."}, {"Time_Start": 2258.0, "Time_End": 2281.0, "Text": " Okay, maybe some plain text. Okay, maybe hyperlinks. Maybe this, maybe that, right? So, be choosy about what you let in. Don't try and figure out everything that you want to filter out because, you know, there are a lot of sneaky ways to embed JavaScript and client side processes into a web page and there's no way you're going to be able to keep up with the technology, the evolution of the technology."}, {"Time_Start": 2282.0, "Time_End": 2291.0, "Text": " It's much harder to try and keep up with all the latest tags and all the different ways to embed it in the HTML than it is to just say, I'm not letting anything in, except you, you, you."}, {"Time_Start": 2292.0, "Time_End": 2304.0, "Text": " And one of the reasons that it's really hard to filter out this client side technology is because you can write a filter. Sure, it's easier to write a filter that'll go in and, you know, filter out all the script tags and stuff."}, {"Time_Start": 2304.0, "Time_End": 2314.0, "Text": " But, you know, to do that, your program is going to have to be looking for certain tokens, right? It's going to have to be looking for HTML tags that have a certain structure."}, {"Time_Start": 2315.0, "Time_End": 2327.0, "Text": " But browsers are so flexible. It turns out that even if you do type in a tag, and let's say you leave out the closing bracket, well, the filter won't pick it up because it's not a well-formed HTML tag, right?"}, {"Time_Start": 2328.0, "Time_End": 2339.0, "Text": " But the browser will figure out what the person is trying to do. So it's just really hard. Don't even try to pick out what you want to, you know, filter out. I strongly recommend filtering in instead."}, {"Time_Start": 2340.0, "Time_End": 2357.0, "Text": " Okay, also if you really must allow your users to post JavaScript information, to post their own JavaScript content, display it in its own browser window, and you can use your own JavaScript to make sure that that new window does not contain a reference to its parent window."}, {"Time_Start": 2358.0, "Time_End": 2368.0, "Text": " Okay, that way any JavaScript that's posted by a user will not be able to make a reference to the parent and will not be able to go and start playing around with anything other than the window which is displayed."}, {"Time_Start": 2369.0, "Time_End": 2378.0, "Text": " And obviously you should never place a form on the same page or a follow-up page from all unfiltered content."}, {"Time_Start": 2379.0, "Time_End": 2387.0, "Text": " So those are just some tips. Hopefully it'll propagate its way back to the designers of web applications."}, {"Time_Start": 2388.0, "Time_End": 2402.0, "Text": " It's, like I say, it would be great if this information was used to maybe shift, at least in some cases, you know, it's great to have excellent network security. It's really great to have great network administrators and have a totally secure network environment."}, {"Time_Start": 2403.0, "Time_End": 2413.0, "Text": " But, hey, if your web application itself is insecure, you're spending a lot of money to protect stuff behind a firewall that can be accessed in a few lines of JavaScript, right? So what are the priorities?"}, {"Time_Start": 2414.0, "Time_End": 2425.0, "Text": " Okay, I'll take some questions now, and unfortunately I have to leave in half an hour and go back to Canada. I'll be up by the pool for about half an hour if anybody wants to talk before I leave, and I'll take some questions now."}, {"Time_Start": 2425.0, "Time_End": 2446.0, "Text": " Well, when I say, I'm talking about web mail applications, right? So I'm talking about things like hotmail and stuff like that."}, {"Time_Start": 2446.0, "Time_End": 2457.0, "Text": " Now, there is also some ability to tinker around with things like Outlook and stuff. If you can shut off JavaScript, I mean, if you're paranoid, yeah, I'll turn off JavaScript, but JavaScript isn't the only problem, right?"}, {"Time_Start": 2458.0, "Time_End": 2459.0, "Text": " Yeah."}, {"Time_Start": 2459.0, "Time_End": 2469.0, "Text": " Yeah."}, {"Time_Start": 2470.0, "Time_End": 2473.0, "Text": " No, I haven't heard of their voice. I'm sorry."}, {"Time_Start": 2473.0, "Time_End": 2495.0, "Text": " Any other questions?"}, {"Time_Start": 2496.0, "Time_End": 2515.0, "Text": " Could you either say that louder or could someone in the front repeat that so I can hear the question?"}, {"Time_Start": 2515.0, "Time_End": 2526.0, "Text": " There have been a lot of, there have been a stream of polls that have allowed you to do things like that, and yeah, sure, another approach is to look into your cache and stuff like that and mail that back."}, {"Time_Start": 2527.0, "Time_End": 2544.0, "Text": " Usually the most, for the purpose of our demonstrations, you know, it seemed that the most, the way to catch people's attention that there's a security problem is to just steal the usernames and passwords because that, you know, the goal is to get the media's attention"}, {"Time_Start": 2545.0, "Time_End": 2550.0, "Text": " to the solution to the problem, so you have to do something that people can identify with, right? Everybody knows what it means to steal a username and password."}, {"Time_Start": 2551.0, "Time_End": 2566.0, "Text": " Like, yeah, obviously, you know, this isn't the only thing you can do. You can use this, if you're a designer of a web application, you want to patch this because, you know, I'm sure there are much more creative ways to do bad stuff than I've been able to show up on with my overhead."}, {"Time_Start": 2566.0, "Time_End": 2594.0, "Text": " Yeah, well, cookies are just another technology at the disposal of someone that's doing client-side scripting, so it's just a facet, something that you can take advantage of if you want to, you know, if you do suck some information out of somewhere, you may want to store in a cookie for whatever reason."}, {"Time_Start": 2594.0, "Time_End": 2611.0, "Text": " Cookies in and of themselves are not inherently dangerous. They're just a tool. There's nothing particularly inherent and dangerous about a cookie."}, {"Time_Start": 2612.0, "Time_End": 2615.0, "Text": " Okay, I guess I'm running out of time, so thanks a lot."}]}