{"segments": [{"Time_Start": 0.0, "Time_End": 3.92, "Text": " Welcome to the annual DEF CON convention."}, {"Time_Start": 4.48, "Time_End": 9.3, "Text": " This meeting was held an exciting Las Vegas Nevada from July night through the 11th, 1999."}, {"Time_Start": 10.36, "Time_End": 12.48, "Text": " This is video tape number 22."}, {"Time_Start": 13.18, "Time_End": 17.82, "Text": " The evidence, morality, practicality, patriotism of hacking."}, {"Time_Start": 22.72, "Time_End": 23.580000000000002, "Text": " I'm Phil."}, {"Time_Start": 24.82, "Time_End": 25.900000000000002, "Text": " I'm one of the feds."}, {"Time_Start": 25.92, "Time_End": 27.36, "Text": " I guess this is my third time up here."}, {"Time_Start": 28.42, "Time_End": 29.98, "Text": " The reason they asked me to come to talk about."}, {"Time_Start": 30.0, "Time_End": 38.18, "Text": " to you for a couple reasons. One thing I do professionally is try to protect the infrastructure,"}, {"Time_Start": 38.94, "Time_End": 45.42, "Text": " the IT, and weapons systems for U.S. Army. I work for the Army Chief Information Officer,"}, {"Time_Start": 45.42, "Time_End": 52.44, "Text": " and my job is to do information assurance, policy, program, architecture, acquisition, and"}, {"Time_Start": 52.44, "Time_End": 59.84, "Text": " finally implementation to the program managers across the Army, wherever we may deploy or wherever we may have a presence"}, {"Time_Start": 59.84, "Time_End": 61.64, "Text": " to protect our systems."}, {"Time_Start": 62.400000000000006, "Time_End": 70.10000000000001, "Text": " I started this business about 27 years ago, 27, 30 years ago, where my greatest enemy"}, {"Time_Start": 70.10000000000001, "Time_End": 73.18, "Text": " in protecting my systems was the Uval Empire."}, {"Time_Start": 74.86, "Time_End": 79.7, "Text": " Concerned about the Soviet Union and Warsaw Pact, those kind of folks who had a substantial"}, {"Time_Start": 79.7, "Time_End": 84.58000000000001, "Text": " capability to take our system out or listen to them or exploit them."}, {"Time_Start": 85.30000000000001, "Time_End": 89.82000000000001, "Text": " I'm a veteran of Vietnam, and I'm also a veteran of Gulf War, and I am very aware."}, {"Time_Start": 89.84, "Time_End": 92.98, "Text": " of what can happen when people listen into your system."}, {"Time_Start": 93.58, "Time_End": 99.18, "Text": " In Vietnam, we used to be very concerned about something called imitative communication deception."}, {"Time_Start": 99.98, "Time_End": 104.66, "Text": " And if you haven't seen the history films, I suggest you take a look at them because it hasn't"}, {"Time_Start": 104.66, "Time_End": 109.54, "Text": " changed all that much, whether you're getting into a system today and looking at data or you're listening"}, {"Time_Start": 109.54, "Time_End": 118.72, "Text": " to an FM, AM radio channel, such as we had in Vietnam, listening to where the next helicopter drop zone was"}, {"Time_Start": 118.72, "Time_End": 122.62, "Text": " going to be, or the next landing zone was going to be, and next pickup. It was all"}, {"Time_Start": 122.62, "Time_End": 128.78, "Text": " information leaned. What they used to do to us in Vietnam was capture or listen to our radios,"}, {"Time_Start": 129.24, "Time_End": 134.14, "Text": " on secure radios, I might add, listen to a 10-digit coordinate in which a helicopter would come in"}, {"Time_Start": 134.14, "Time_End": 140.94, "Text": " to pick up people or to draw people off. And the folks on the ground would radio back to the helicopter pilot"}, {"Time_Start": 140.94, "Time_End": 145.78, "Text": " and a team chief and say, hey man, land where I pop yellow smoke. Well, guess what they would do?"}, {"Time_Start": 145.88, "Time_End": 148.62, "Text": " They would hear that. And there'd be two areas on the ground."}, {"Time_Start": 148.72, "Time_End": 153.4, "Text": " yellow smoke. And it was a 50-50 chance that the helicopter would land in the right place."}, {"Time_Start": 153.48, "Time_End": 158.5, "Text": " And if he didn't, they land in the right place, he was received with director and direct fire."}, {"Time_Start": 159.34, "Time_End": 166.42, "Text": " That is real, real cyber warfare starting back in the mid-60s. Those kind of lessons,"}, {"Time_Start": 166.42, "Time_End": 170.52, "Text": " I tell you, have not lost themselves in the business that I do today."}, {"Time_Start": 172.02, "Time_End": 178.56, "Text": " I'm here today, if you read what's on the agenda, to talk about patriotism, morality, ethics of"}, {"Time_Start": 178.56, "Time_End": 183.96, "Text": " hacking and so forth. But I must do disclaimer right off to bat. The rest of my presentation"}, {"Time_Start": 183.96, "Time_End": 188.94, "Text": " of the speech I'm going to do today is my opinion. It is not the opinion of the U.S. government."}, {"Time_Start": 189.08, "Time_End": 194.08, "Text": " It is not the opinion of the Secretary of the Army, a certain opinion of the Army, Chief Information"}, {"Time_Start": 194.08, "Time_End": 201.36, "Text": " Officer. It is strictly mine. I want to, first of all, thank the organizers of DEFCON for inviting"}, {"Time_Start": 201.36, "Time_End": 206.8, "Text": " this out here. This is a great opportunity for us. We've interfaced with a whole lot of you all out here."}, {"Time_Start": 206.8, "Time_End": 215.3, "Text": " I picked up a great number of tips, and I think after yesterday's Meet the Fed panel, we are a little more synthesized to some of your concerns as well."}, {"Time_Start": 215.98000000000002, "Time_End": 221.42000000000002, "Text": " I appreciate the opportunity to be here today, and I hope that I made the right decision by leaving my Kevlar at home."}, {"Time_Start": 224.96, "Time_End": 229.16000000000003, "Text": " Actually, I was a deaf coin last year, as I mentioned, and I was pointed out as a Fed in record time."}, {"Time_Start": 229.76000000000002, "Time_End": 236.14000000000001, "Text": " Carl Lewis had meth on me on this one. I guess that must have been either the cowboy boots or the Jess for Mangel"}, {"Time_Start": 236.14000000000001, "Time_End": 237.70000000000002, "Text": " so you can't tell."}, {"Time_Start": 238.54000000000002, "Time_End": 240.76000000000002, "Text": " But I will tell you, I did get a haircut for you guys."}, {"Time_Start": 242.46, "Time_End": 243.08, "Text": " You're welcome."}, {"Time_Start": 244.42000000000002, "Time_End": 250.76000000000002, "Text": " So anyway, since I couldn't hide anymore, and I do appreciate and I understand the value of what this conference does and can do,"}, {"Time_Start": 250.76000000000002, "Time_End": 257.0, "Text": " do what you bring to the industry and community and the impact of the government, I just simply"}, {"Time_Start": 257.0, "Time_End": 259.26, "Text": " said, okay, well, I'll be a speaker this year."}, {"Time_Start": 260.42, "Time_End": 266.12, "Text": " Before I'd let me come up here, though, they warned me not to bore anyone at death, not to get on my"}, {"Time_Start": 266.14, "Time_End": 271.0, "Text": " military high horse in no time and under any circumstance was I to be allowed to make"}, {"Time_Start": 271.0, "Time_End": 281.12, "Text": " any reference to anti-online or a guy named J.P. However, I think Peter Shipley and I could talk"}, {"Time_Start": 281.12, "Time_End": 286.32, "Text": " about some things after the conference as well on that. There are a few things I want to say today,"}, {"Time_Start": 286.32, "Time_End": 293.32, "Text": " and after that I'll point out, if you haven't got your T-shirt yet, a lot of my cool workers are in the audience here."}, {"Time_Start": 293.32, "Time_End": 298.28, "Text": " And I'm rather proud of the feds that came out to this conference because they're harder to spot than they were last year."}, {"Time_Start": 300.92, "Time_End": 311.5, "Text": " There are certainly a multi-talented group of individuals gathered here today, a group that many profit-seeking computer security headhunters would give their firstborn to recruit, and I've talked to many of you."}, {"Time_Start": 312.2, "Time_End": 314.5, "Text": " The best of the best in the elite, there's no question."}, {"Time_Start": 315.14, "Time_End": 321.1, "Text": " Computer security companies have probably approached many of you, and I know that some of you are even now currently employed by some."}, {"Time_Start": 321.1, "Time_End": 326.38, "Text": " The irony of that situation certainly hasn't missed any of us in an Department of Defense,"}, {"Time_Start": 326.68, "Time_End": 331.44, "Text": " whether corporate world, or the FBI, or a number of other people who find it hard to accept"}, {"Time_Start": 331.44, "Time_End": 336.28000000000003, "Text": " that the very people who stir up the coals are the ones getting paid to put out the fires."}, {"Time_Start": 337.6, "Time_End": 341.22, "Text": " Couldn't that be compared to hiring a thief to install a security system in your home?"}, {"Time_Start": 342.08000000000004, "Time_End": 346.04, "Text": " Would you appreciate his expertise when he comes back three weeks later"}, {"Time_Start": 346.04, "Time_End": 349.98, "Text": " and relieves you with that stereo system that you just procured?"}, {"Time_Start": 349.98, "Time_End": 354.20000000000005, "Text": " hackers working for computer security companies, what a combination."}, {"Time_Start": 355.5, "Time_End": 359.06, "Text": " You know, they say that a large percentage of criminals return to prison after being caught"}, {"Time_Start": 359.06, "Time_End": 363.96000000000004, "Text": " continue a crime using many of the new techniques to learn while they were in jail."}, {"Time_Start": 364.72, "Time_End": 369.70000000000005, "Text": " These people that lived in the environment consisting of all the expertise in their career field,"}, {"Time_Start": 370.1, "Time_End": 371.04, "Text": " criminals meet criminals."}, {"Time_Start": 372.14000000000004, "Time_End": 375.38, "Text": " Wouldn't a hacker working in a computer security company be almost the same?"}, {"Time_Start": 376.56, "Time_End": 379.40000000000003, "Text": " When they hire, when they're hard to work for these firms,"}, {"Time_Start": 379.40000000000003, "Time_End": 381.3, "Text": " isn't like being a kid in the candy store."}, {"Time_Start": 382.1, "Time_End": 387.64000000000004, "Text": " All the latest and greatest tools, technology, that they've heard about but didn't have access to"}, {"Time_Start": 387.64000000000004, "Time_End": 390.6, "Text": " or maybe didn't have money to buy right there at the fingertips."}, {"Time_Start": 391.22, "Time_End": 396.40000000000003, "Text": " Can all hackers honestly say that they wouldn't be at least bit tempted to do a little vulnerability"}, {"Time_Start": 396.40000000000003, "Time_End": 398.64000000000004, "Text": " testing on their own once they were on the inside?"}, {"Time_Start": 399.16, "Time_End": 402.40000000000003, "Text": " This was discussed yesterday during the meet the Fed panel."}, {"Time_Start": 403.54, "Time_End": 407.46000000000004, "Text": " You'll get me wrong, I'm not saying that everyone would do it, but I am saying that there's a certain"}, {"Time_Start": 407.46000000000004, "Time_End": 409.06000000000006, "Text": " percentage would consider it."}, {"Time_Start": 409.40000000000003, "Time_End": 413.00000000000006, "Text": " And that is a big percentage that most employers don't want to risk."}, {"Time_Start": 413.72, "Time_End": 419.04, "Text": " Many of you may say I'm stereotyping, and not everyone with a hacking background does illegal hacking."}, {"Time_Start": 419.68, "Time_End": 426.08000000000004, "Text": " And that if they did, it doesn't mean that they would continue to do it once they were hired to work for the good guys."}, {"Time_Start": 426.84000000000003, "Time_End": 437.42, "Text": " But smokers, dieters, addicts of all kinds will tell you that it is a lot harder to change away life than it is to give in to the habit one more time."}, {"Time_Start": 437.42, "Time_End": 440.6, "Text": " Before I go, let me make something clear."}, {"Time_Start": 440.7, "Time_End": 442.36, "Text": " I'm not labeling all hackers as criminals."}, {"Time_Start": 442.82, "Time_End": 444.92, "Text": " I'm saying that criminals are criminals."}, {"Time_Start": 445.8, "Time_End": 451.38, "Text": " If you haven't been caught for breaking the law, and if you have been caught for breaking the law, you're a criminal."}, {"Time_Start": 451.94, "Time_End": 458.1, "Text": " If it is your passion and pastime to poke, prod, dissect computers, computer code, or outbreaking any law,"}, {"Time_Start": 458.40000000000003, "Time_End": 460.14, "Text": " then you're a tactician in high demand."}, {"Time_Start": 461.72, "Time_End": 467.40000000000003, "Text": " When it comes to military, we have enough problems to worry about without adding convicted hackers."}, {"Time_Start": 467.42, "Time_End": 468.54, "Text": " or criminals to payroll."}, {"Time_Start": 469.42, "Time_End": 474.06, "Text": " And if you believe what you're reading the papers or CNTV, I'm sure most of you would agree"}, {"Time_Start": 474.06, "Time_End": 477.98, "Text": " that we just don't need any more trouble than we have."}, {"Time_Start": 478.46000000000004, "Time_End": 485.1, "Text": " And isn't it ironic, if you will, when we had the conversation yesterday about doing a load of vulnerability"}, {"Time_Start": 485.1, "Time_End": 491.5, "Text": " analysis just to show people how they were insecure that someone took down the DEFCOM homepage."}, {"Time_Start": 493.34000000000003, "Time_End": 495.66, "Text": " And if you haven't seen that, you need to take a look at it."}, {"Time_Start": 495.66, "Time_End": 496.94, "Text": " So you do yourselves."}, {"Time_Start": 497.42, "Time_End": 503.74, "Text": " of telling you. On the other hand, there's no question that we would benefit from hiring"}, {"Time_Start": 503.74, "Time_End": 509.1, "Text": " people at the level of intelligence expertise that these people have. Script kitties excluded."}, {"Time_Start": 512.14, "Time_End": 517.5, "Text": " It's no secret that the biggest obstacle to military faces and efforts to run cyber security"}, {"Time_Start": 517.5, "Time_End": 523.9, "Text": " race is a lack of well-trained people who are always committed to the longevity that's required"}, {"Time_Start": 523.9, "Time_End": 527.1, "Text": " to complete this important task. Dr. Honker, Jeff Honker, Jeff Honker,"}, {"Time_Start": 527.42, "Time_End": 532.4599999999999, "Text": " was here on the platform which yesterday from the National Security Council spoke about"}, {"Time_Start": 532.4599999999999, "Time_End": 537.86, "Text": " implementing initiatives that would keep that technical staff in place at least a little longer."}, {"Time_Start": 538.5799999999999, "Time_End": 543.54, "Text": " More money is a great starting place, and that would also enable us to complete, compete for personnel"}, {"Time_Start": 543.54, "Time_End": 545.02, "Text": " and other corporate contract."}, {"Time_Start": 545.52, "Time_End": 547.9599999999999, "Text": " Some of our friends, which we call doorway bandits."}, {"Time_Start": 548.9599999999999, "Time_End": 550.9799999999999, "Text": " They will get those folks into the business."}, {"Time_Start": 551.66, "Time_End": 552.98, "Text": " Why do hackers hack?"}, {"Time_Start": 553.86, "Time_End": 557.4, "Text": " Well, we consistently hear about the part of the"}, {"Time_Start": 557.42, "Time_End": 561.9799999999999, "Text": " hacker culture that claims that they do it for the good of computer security."}, {"Time_Start": 562.4799999999999, "Time_End": 567.18, "Text": " And that pointing out vulnerabilities in other people's system is a good thing that educates the victim"}, {"Time_Start": 567.18, "Time_End": 570.4, "Text": " about the gross lack of their security."}, {"Time_Start": 571.3399999999999, "Time_End": 575.92, "Text": " If they should happen to delete or alter a few files or alter a home page while they're at it,"}, {"Time_Start": 576.18, "Time_End": 577.14, "Text": " then so be it."}, {"Time_Start": 578.3, "Time_End": 582.98, "Text": " I mean, I lock my door every night before I go to bed, but that doesn't mean that you're invited"}, {"Time_Start": 582.98, "Time_End": 584.9, "Text": " to come in and help yourself with my belongings."}, {"Time_Start": 585.86, "Time_End": 587.36, "Text": " That's the same rationale."}, {"Time_Start": 587.42, "Time_End": 589.3199999999999, "Text": " that I use for people who use that argument."}, {"Time_Start": 590.12, "Time_End": 591.78, "Text": " What about repercussions of these lessons?"}, {"Time_Start": 592.56, "Time_End": 595.66, "Text": " I can think of a few situations that are near and dear to my military heart."}, {"Time_Start": 596.2199999999999, "Time_End": 602.62, "Text": " What would happen if a hacker broke in through it and called it an education to make an education"}, {"Time_Start": 602.62, "Time_End": 607.36, "Text": " point and point out vulnerabilities in the system that control the stocking, shipping,"}, {"Time_Start": 607.4399999999999, "Time_End": 609.1999999999999, "Text": " and medical supplies to our troops abroad?"}, {"Time_Start": 610.1999999999999, "Time_End": 615.5999999999999, "Text": " Is it worth the lives of our countrymen to have bragging rights about owning someone else's box?"}, {"Time_Start": 616.5999999999999, "Time_End": 617.4, "Text": " How funny is it?"}, {"Time_Start": 617.42, "Time_End": 621.4599999999999, "Text": " or education would it be if a shipment of weapons meant to protect our homes and families"}, {"Time_Start": 621.4599999999999, "Time_End": 627.4, "Text": " were replaced with packages of turmoil underwear to a few well-placed keystrokes."}, {"Time_Start": 628.62, "Time_End": 631.5, "Text": " These things are all possible, and they're all great concern to me."}, {"Time_Start": 632.4, "Time_End": 636.06, "Text": " Is everything justified in the name of education? I think not."}, {"Time_Start": 637.28, "Time_End": 640.86, "Text": " Then are those hackers who group themselves as a hacktivist category."}, {"Time_Start": 641.8, "Time_End": 647.18, "Text": " Hackers against child pornography, hackers against war, and so on, it is an honorable"}, {"Time_Start": 647.1800000000001, "Time_End": 652.6800000000001, "Text": " intent, that they feel strongly about these issues and a lot of people share those concerns"}, {"Time_Start": 652.6800000000001, "Time_End": 658.0200000000001, "Text": " with them. Hackers want their voices to be heard. That's clear, but it is illegal to penetrate"}, {"Time_Start": 658.0200000000001, "Time_End": 665.0600000000001, "Text": " the best, and it's illegal to penetrate and is that the best way to speak out. Have hackers stopped"}, {"Time_Start": 665.0600000000001, "Time_End": 671.5200000000001, "Text": " to think how much good is being done by their actions? Listen to what I'm thinking. How many children"}, {"Time_Start": 671.5200000000001, "Time_End": 676.6400000000001, "Text": " have been saved from the sick cruelties of child pornography by defacing a homepage?"}, {"Time_Start": 677.1800000000001, "Time_End": 681.9000000000001, "Text": " How many soldiers have been kept off the front lines by taking down U.S. Army home page?"}, {"Time_Start": 682.7800000000001, "Time_End": 686.6800000000001, "Text": " They also make the assumption that large numbers of people see these authors pages."}, {"Time_Start": 687.46, "Time_End": 694.6200000000001, "Text": " But a message put up at 3 a.m. and taken down at 6 a.m., probably isn't going to be seen by influential political audiences,"}, {"Time_Start": 695.2800000000001, "Time_End": 699.08, "Text": " and they presume that it probably won't be seen by a lot of other people either."}, {"Time_Start": 699.08, "Time_End": 703.72, "Text": " True, many sites archived these pages which give them a lot more exposure."}, {"Time_Start": 704.4000000000001, "Time_End": 707.1600000000001, "Text": " But if exposure to the evils of child pornography is the goal,"}, {"Time_Start": 707.1800000000001, "Time_End": 713.6800000000001, "Text": " and why not put up your own websites dedicated to saying child pornography is bad"}, {"Time_Start": 713.6800000000001, "Time_End": 717.46, "Text": " instead of risking legal actions by tampering with someone else's?"}, {"Time_Start": 718.08, "Time_End": 723.34, "Text": " I'm certainly no expert, but I'm probably a guess that writing a letter to a congressman"}, {"Time_Start": 723.34, "Time_End": 728.24, "Text": " or a senator or other local officials might get the ball rolling a little faster than a web page"}, {"Time_Start": 728.24, "Time_End": 729.6200000000001, "Text": " full of misspelled curse words."}, {"Time_Start": 731.2800000000001, "Time_End": 736.9200000000001, "Text": " I can't help but think of how much work could be accomplished in the fight that could be won"}, {"Time_Start": 736.92, "Time_End": 740.2199999999999, "Text": " if hackers were mobilized their efforts in certain other directions."}, {"Time_Start": 741.2199999999999, "Time_End": 748.26, "Text": " If they put up as much organized effort in riding a bike to work or not littering on the highways or carpooling,"}, {"Time_Start": 748.36, "Time_End": 752.62, "Text": " conserving energy, or recycling as they do in illegal penetrating of other people's systems,"}, {"Time_Start": 753.14, "Time_End": 755.1999999999999, "Text": " we would certainly have a better planet to live on."}, {"Time_Start": 755.92, "Time_End": 761.0999999999999, "Text": " If they put their considerable computer expertise to work in training, research, development facilities,"}, {"Time_Start": 761.4399999999999, "Time_End": 766.42, "Text": " we might even have shopping malls in the ocean floor or could be talking about putting condos on Mars."}, {"Time_Start": 766.9200000000001, "Time_End": 769.6800000000001, "Text": " Right along hasn't changed much in the beginning of time."}, {"Time_Start": 770.1600000000001, "Time_End": 776.7400000000001, "Text": " And I wonder if hackers have stopped to consider the people who are being affected directly or indirectly by their evil deeds."}, {"Time_Start": 777.6400000000001, "Time_End": 782.3800000000001, "Text": " You think about the system administrator who will spend for days repairing the damage that was done"}, {"Time_Start": 782.3800000000001, "Time_End": 787.96, "Text": " or a small business owner who may have to close down because they can't afford to restore the data that was destroyed."}, {"Time_Start": 788.8800000000001, "Time_End": 791.2, "Text": " Take the Citibank incident, for example."}, {"Time_Start": 791.6200000000001, "Time_End": 795.32, "Text": " Even though most of the money was recovered, a fairly large chunk was not."}, {"Time_Start": 796.2800000000001, "Time_End": 796.7600000000001, "Text": " Why?"}, {"Time_Start": 796.9200000000001, "Time_End": 799.0000000000001, "Text": " Or who do you think paid for that loss?"}, {"Time_Start": 799.32, "Time_End": 802.32, "Text": " Do you think Citibank just chalked it up to the old well factor?"}, {"Time_Start": 803.5400000000001, "Time_End": 807.6800000000001, "Text": " Or do you think that the taxpayers, consumers, including the culpros paid?"}, {"Time_Start": 808.46, "Time_End": 811.1, "Text": " As the saying goes, no good deed goes unpunished."}, {"Time_Start": 813.3600000000001, "Time_End": 820.84, "Text": " What you do takes talent, patience, perseverance, determination, and a low-end computer with anything but a AOL account."}, {"Time_Start": 822.84, "Time_End": 826.9000000000001, "Text": " What you do gets attention in the media, the military, your peers, and even the other."}, {"Time_Start": 826.9200000000001, "Time_End": 828.4200000000001, "Text": " FBI on some occasions."}, {"Time_Start": 830.0600000000001, "Time_End": 833.46, "Text": " What you do gives jobs, assist administrators, network administrators,"}, {"Time_Start": 833.96, "Time_End": 837.5000000000001, "Text": " virus detection companies, software engineers, teachers, students, and lawyers."}, {"Time_Start": 837.8600000000001, "Time_End": 838.98, "Text": " And all this is remarkable."}, {"Time_Start": 841.1200000000001, "Time_End": 847.1800000000001, "Text": " Excuse me, folks. Real quick announcement."}, {"Time_Start": 847.7600000000001, "Time_End": 851.2800000000001, "Text": " Is there a Brett Bressler or Roman Israel in the audience?"}, {"Time_Start": 851.84, "Time_End": 853.1800000000001, "Text": " Or does anyone know these people?"}, {"Time_Start": 853.44, "Time_End": 856.08, "Text": " If you do, would you please ask them to go to the second floor?"}, {"Time_Start": 856.9200000000001, "Time_End": 858.32, "Text": " And talk to a lady named Sharon."}, {"Time_Start": 858.5600000000001, "Time_End": 861.82, "Text": " There is a family emergency that you need to handle immediately."}, {"Time_Start": 862.32, "Time_End": 863.1, "Text": " Thank you very much."}, {"Time_Start": 867.48, "Time_End": 871.8600000000001, "Text": " As I mentioned, all this is very, very remarkable."}, {"Time_Start": 872.3600000000001, "Time_End": 876.0200000000001, "Text": " If it wasn't remarkable, many of the feds wouldn't be here today to hear what you have to say"}, {"Time_Start": 876.0200000000001, "Time_End": 879.0000000000001, "Text": " and hear what you have to discuss and share with us."}, {"Time_Start": 879.44, "Time_End": 882.34, "Text": " However, a famous patriarch of the dark side once said,"}, {"Time_Start": 882.7400000000001, "Time_End": 884.58, "Text": " Luke, I am your father."}, {"Time_Start": 885.8800000000001, "Time_End": 886.9000000000001, "Text": " But he also."}, {"Time_Start": 886.9200000000001, "Time_End": 889.1800000000001, "Text": " lit up the night's sky with his burning carcass."}, {"Time_Start": 890.2800000000001, "Time_End": 895.1600000000001, "Text": " The point is that it may be fun to be a bad guy, but in the end, when it comes down to an attorney"}, {"Time_Start": 895.1600000000001, "Time_End": 900.5600000000001, "Text": " in a hell or damnation, a few hours or days behind bars, or the FBI beating down your door"}, {"Time_Start": 900.5600000000001, "Time_End": 906.0200000000001, "Text": " in the middle night, wouldn't you rather choose the Big Hatton, Cliff Chend of Dudley Dewright, or"}, {"Time_Start": 906.0200000000001, "Time_End": 912.5200000000001, "Text": " besides, Dudley always gets the girl, and Olive Oil never chooses Brutus over Popeye."}, {"Time_Start": 913.8800000000001, "Time_End": 915.0200000000001, "Text": " You're all talented."}, {"Time_Start": 915.8600000000001, "Time_End": 916.9000000000001, "Text": " A group of talented."}, {"Time_Start": 916.9200000000001, "Time_End": 922.6600000000001, "Text": " people. Your career opportunities and learning potential will be far greater than any in my"}, {"Time_Start": 922.6600000000001, "Time_End": 928.8600000000001, "Text": " generation. The sky is limited, but there is a catch. The old saying was true by not being"}, {"Time_Start": 928.8600000000001, "Time_End": 933.8600000000001, "Text": " able to have your cake and eat it too. The illegal activity will never be rewarded, and those hackers"}, {"Time_Start": 933.8600000000001, "Time_End": 939.0000000000001, "Text": " that have escaped prosecution may feel like they'll never be caught. But sooner or later, justice will catch"}, {"Time_Start": 939.0000000000001, "Time_End": 945.6600000000001, "Text": " up, and they'll realize that no one is invincible. As for those hackers who feel productivity,"}, {"Time_Start": 946.9200000000001, "Time_End": 951.3800000000001, "Text": " ways to use their talent. If you do it right, you have absolutely no boundaries."}, {"Time_Start": 951.6200000000001, "Time_End": 959.44, "Text": " You can go anywhere you want. In closing, I have just this left to say. We're the G-Man"}, {"Time_Start": 959.44, "Time_End": 966.3800000000001, "Text": " of the Department of Defense, in order to form a more secure network, establish firewalls, ensure"}, {"Time_Start": 966.3800000000001, "Time_End": 972.0400000000001, "Text": " domestic connectivity, provide for assist administrators, promote the changing of passwords,"}, {"Time_Start": 972.0400000000001, "Time_End": 976.5000000000001, "Text": " and patch every exploitable home known to man, before it."}, {"Time_Start": 976.9200000000001, "Time_End": 985.6800000000001, "Text": " Team Split-O, Global Hell, or the Elves, take them apart. Do hereby request, in the"}, {"Time_Start": 985.6800000000001, "Time_End": 991.1200000000001, "Text": " Memorial Warriors of Rodney King, why can't we just get along? Thank you very much."}, {"Time_Start": 1006.9200000000001, "Time_End": 1012.4200000000001, "Text": " back in Federal Computer Week, where you gave a little bit of a much of all, as soon as you turned on the webcam, the microphone."}, {"Time_Start": 1013.1, "Time_End": 1016.4000000000001, "Text": " I was wondering what Joe Daxon was when that happened."}, {"Time_Start": 1017.6, "Time_End": 1018.9000000000001, "Text": " Oh, I'm glad that's a good question."}, {"Time_Start": 1019.0600000000001, "Time_End": 1024.64, "Text": " The question was that he had read an article that myself and Ms. Robin, who is my personal hacker,"}, {"Time_Start": 1025.44, "Time_End": 1030.92, "Text": " did a demo to some of the higher-ups in the government in which we broke into a system,"}, {"Time_Start": 1032.5, "Time_End": 1034.7, "Text": " exploiting poor password management."}, {"Time_Start": 1034.7, "Time_End": 1036.7, "Text": " Turned on a couple of directories."}, {"Time_Start": 1036.92, "Time_End": 1042.8400000000001, "Text": " captured some audio through a wayfile, brought it back, turned on some cameras,"}, {"Time_Start": 1042.94, "Time_End": 1044.14, "Text": " took their pictures, and so forth."}, {"Time_Start": 1044.8000000000002, "Time_End": 1048.02, "Text": " And the question was, what was the reaction to the leadership?"}, {"Time_Start": 1049.52, "Time_End": 1053.3000000000002, "Text": " Shock, is probably the best word to sum that up."}, {"Time_Start": 1054.3200000000002, "Time_End": 1059.0800000000002, "Text": " I think that most of the leadership business understand that people's email is in jeopardy,"}, {"Time_Start": 1059.54, "Time_End": 1063.64, "Text": " and they have grown to at least understand that risk."}, {"Time_Start": 1064.16, "Time_End": 1066.9, "Text": " I'm not sure that the hiring up you go in the executive."}, {"Time_Start": 1066.92, "Time_End": 1072.48, "Text": " chain that they fully understand the technical ramifications of that capability."}, {"Time_Start": 1072.48, "Time_End": 1081.02, "Text": " But when you turn on a capability to their local PC that captures them speaking, or if they happen"}, {"Time_Start": 1081.02, "Time_End": 1085.6200000000001, "Text": " to be silly enough to leave the camera plugged in and you can take their picture while they're speaking,"}, {"Time_Start": 1086.22, "Time_End": 1094.0600000000002, "Text": " that kind of really makes them quickly aware of the vulnerabilities of the technology and where to place it and so forth."}, {"Time_Start": 1094.0600000000002, "Time_End": 1096.9, "Text": " I gave that demonstration to some folks."}, {"Time_Start": 1096.92, "Time_End": 1097.92, "Text": " at the Army War College."}, {"Time_Start": 1098.7, "Time_End": 1100.3400000000001, "Text": " And I'll tell you a little funny story here."}, {"Time_Start": 1100.5, "Time_End": 1101.52, "Text": " There was a lady in the front."}, {"Time_Start": 1102.28, "Time_End": 1103.96, "Text": " You could tell about her body language."}, {"Time_Start": 1104.0800000000002, "Time_End": 1107.5800000000002, "Text": " She was extremely nervous and under significant stress,"}, {"Time_Start": 1108.0600000000002, "Time_End": 1111.16, "Text": " which worried me because it is not my intent when I do these presentations"}, {"Time_Start": 1111.16, "Time_End": 1113.66, "Text": " to put anybody in a heart attack nerd."}, {"Time_Start": 1114.1000000000001, "Time_End": 1115.5, "Text": " So I finally stopped the demo."}, {"Time_Start": 1116.1000000000001, "Time_End": 1118.3000000000002, "Text": " I asked Ms. Robin to quit for a minute."}, {"Time_Start": 1119.04, "Time_End": 1120.96, "Text": " And I asked this lady straight up."}, {"Time_Start": 1121.04, "Time_End": 1122.76, "Text": " I said, is there something I can do for you?"}, {"Time_Start": 1122.76, "Time_End": 1125.52, "Text": " I mean, would you like a glass of water or something of this nature?"}, {"Time_Start": 1126.0800000000002, "Time_End": 1126.8200000000002, "Text": " She said, no."}, {"Time_Start": 1126.92, "Time_End": 1131.24, "Text": " She said, you know, I'm really pissed at my husband."}, {"Time_Start": 1131.72, "Time_End": 1137.44, "Text": " And I'm trying to understand what my demonstration had to do with her present feeling about her husband."}, {"Time_Start": 1137.94, "Time_End": 1139.72, "Text": " And I said, well, why is that, ma'am?"}, {"Time_Start": 1140.18, "Time_End": 1141.64, "Text": " I mean, I started the conversation."}, {"Time_Start": 1141.76, "Time_End": 1143.8400000000001, "Text": " She had my interest, a couple hundred people in the audience."}, {"Time_Start": 1144.42, "Time_End": 1145.44, "Text": " I said, why is that?"}, {"Time_Start": 1145.74, "Time_End": 1149.6200000000001, "Text": " She says, you know, I told him to take the computer out of our bedroom."}, {"Time_Start": 1153.8200000000002, "Time_End": 1156.3600000000001, "Text": " I think we at least made one convert that day."}, {"Time_Start": 1156.92, "Time_End": 1159.16, "Text": " Any other questions?"}, {"Time_Start": 1160.04, "Time_End": 1160.4, "Text": " Sir?"}, {"Time_Start": 1161.6000000000001, "Time_End": 1166.04, "Text": " Would you like to comment on, there's a new story looking around that."}, {"Time_Start": 1167.04, "Time_End": 1168.18, "Text": " Some U.S. and B."}, {"Time_Start": 1168.18, "Time_End": 1174.88, "Text": " Other agencies are accordingly accurate to hack into the bank account, so you can follow the officials,"}, {"Time_Start": 1175.04, "Time_End": 1176.8400000000001, "Text": " they please don't the line from the most of it."}, {"Time_Start": 1177.8400000000001, "Time_End": 1184.48, "Text": " If you can you confirm it to deny that, if it's true, how does that mean to the accurate to the applicant?"}, {"Time_Start": 1185.68, "Time_End": 1186.68, "Text": " I would agree with him."}, {"Time_Start": 1186.92, "Time_End": 1188.7, "Text": " I don't know anything about that, so I can't comment on it."}, {"Time_Start": 1216.92, "Time_End": 1218.8200000000002, "Text": " or have someone to repeat the question, please."}, {"Time_Start": 1218.9, "Time_End": 1221.42, "Text": " Talking about, how do you do about the utilities like back orifice?"}, {"Time_Start": 1223.74, "Time_End": 1226.9, "Text": " Yeah, it's going to be a fan I am not, obviously."}, {"Time_Start": 1227.28, "Time_End": 1230.64, "Text": " Although I am willing to trade the cult,"}, {"Time_Start": 1230.8400000000001, "Time_End": 1233.3200000000002, "Text": " I have a very nice Army Information Insurance Cup"}, {"Time_Start": 1233.3200000000002, "Time_End": 1235.46, "Text": " and I'll trade him for a CD and a T-shirt."}, {"Time_Start": 1238.52, "Time_End": 1242.3400000000001, "Text": " There's no big secret if you've watched the media and so forth that"}, {"Time_Start": 1242.3400000000001, "Time_End": 1246.5600000000002, "Text": " back orifice has caused some degree of stress"}, {"Time_Start": 1246.5600000000002, "Time_End": 1246.9, "Text": " and concerns."}, {"Time_Start": 1246.92, "Time_End": 1253.52, "Text": " concern. Of course, you know, you can continue to those kind of things. That's your first"}, {"Time_Start": 1253.52, "Time_End": 1260.16, "Text": " right amendment. Again, I mentioned yesterday that case law is a bad thing to be the first"}, {"Time_Start": 1260.16, "Time_End": 1267.3600000000001, "Text": " one in. Don't be surprised if sometimes, someday, people are held accountable for these"}, {"Time_Start": 1267.3600000000001, "Time_End": 1271.68, "Text": " kind of applications and the damage they caused, and that's about all I'll say at this point."}, {"Time_Start": 1272.88, "Time_End": 1273.4, "Text": " Sir."}, {"Time_Start": 1276.92, "Time_End": 1284.5800000000002, "Text": " I think the real threat to what it's about anyway system, whether it's over through DOP or whatever,"}, {"Time_Start": 1284.68, "Time_End": 1288.7, "Text": " they're willing to users and their lack of experience at a piece."}, {"Time_Start": 1289.24, "Time_End": 1297.72, "Text": " It's neat to hear anybody that's in the street building animals comes to you too much of where you look at and after the IHQ."}, {"Time_Start": 1300.22, "Time_End": 1304.68, "Text": " I think it's an age old, the question I'll try to rephrase it."}, {"Time_Start": 1305.1000000000001, "Time_End": 1306.9, "Text": " The concern is whether we ought to."}, {"Time_Start": 1306.92, "Time_End": 1313.46, "Text": " educate our users more and worry less about hackers or focus on the education of our"}, {"Time_Start": 1313.46, "Time_End": 1318.96, "Text": " system administrators. I am one of a growing school, I think, that says the users shouldn't"}, {"Time_Start": 1318.96, "Time_End": 1323.64, "Text": " be any more educated than using the system. And the system administrator, the service provider,"}, {"Time_Start": 1324.0800000000002, "Time_End": 1331.98, "Text": " ought to be wholly responsible for securing any integrity that system. I think that we are"}, {"Time_Start": 1331.98, "Time_End": 1336.74, "Text": " focusing our attention and our resources on the system administrator, the service provider, the service"}, {"Time_Start": 1336.92, "Time_End": 1339.9, "Text": " the technology and fusion to provide that security."}, {"Time_Start": 1340.28, "Time_End": 1346.42, "Text": " The user should have password or access control mechanisms, whether it be biographic or biometrics"}, {"Time_Start": 1346.42, "Time_End": 1352.74, "Text": " or this kind of thing, but I don't think educating the user on system access is the solution."}, {"Time_Start": 1352.9, "Time_End": 1358.8600000000001, "Text": " There is some work to be done there, but I tend to shift that burden to the service provider."}, {"Time_Start": 1358.8600000000001, "Time_End": 1359.5600000000002, "Text": " Sir."}, {"Time_Start": 1366.92, "Time_End": 1375.42, "Text": " They all, basically, the whole effort of the government's components to be hacking to"}, {"Time_Start": 1375.42, "Time_End": 1379.5600000000002, "Text": " use halving systems for military purposes, using hackers to do that."}, {"Time_Start": 1380.28, "Time_End": 1382.78, "Text": " And when you said, you can talk about that."}, {"Time_Start": 1383.2, "Time_End": 1387.38, "Text": " What's your personal opinion about the ethical issues associated with doing that?"}, {"Time_Start": 1388.6200000000001, "Time_End": 1389.8400000000001, "Text": " Let me clarify."}, {"Time_Start": 1390.54, "Time_End": 1393.28, "Text": " It's not that I didn't want to talk about it, I truly do not know about it."}, {"Time_Start": 1393.28, "Time_End": 1396.74, "Text": " My job in the department is computer network defense."}, {"Time_Start": 1396.92, "Time_End": 1398.92, "Text": " and not computer network attack."}, {"Time_Start": 1398.92, "Time_End": 1400.92, "Text": " Okay, and I focus on that."}, {"Time_Start": 1400.92, "Time_End": 1405.92, "Text": " The ethical issues on computer network attack,"}, {"Time_Start": 1405.92, "Time_End": 1408.92, "Text": " I'm not sure that I have in my own mind"}, {"Time_Start": 1408.92, "Time_End": 1410.92, "Text": " determine what the grounds rules are."}, {"Time_Start": 1410.92, "Time_End": 1413.92, "Text": " We had a discussion last night by the pool"}, {"Time_Start": 1413.92, "Time_End": 1416.92, "Text": " with Dr. Honker and a few others"}, {"Time_Start": 1416.92, "Time_End": 1420.92, "Text": " about the legalities of a stage of war"}, {"Time_Start": 1420.92, "Time_End": 1422.92, "Text": " and what constitutes an attack."}, {"Time_Start": 1422.92, "Time_End": 1425.92, "Text": " In a traditional sense, in the physical world,"}, {"Time_Start": 1425.92, "Time_End": 1426.92, "Text": " you throw Obama at me,"}, {"Time_Start": 1426.92, "Time_End": 1429.3600000000001, "Text": " it's very clearly that you've attacked me."}, {"Time_Start": 1429.6000000000001, "Time_End": 1431.3600000000001, "Text": " You shoot at me, and I know this as well."}, {"Time_Start": 1431.96, "Time_End": 1436.68, "Text": " You penetrate my system and violate my sovereignty,"}, {"Time_Start": 1437.68, "Time_End": 1440.44, "Text": " folks consider that to be an attack as well."}, {"Time_Start": 1440.7, "Time_End": 1443.92, "Text": " But from a legal perspective, I don't know what constitutes an attack,"}, {"Time_Start": 1443.98, "Time_End": 1447.0600000000002, "Text": " and I don't know that Congress will wrestle with that anytime soon."}, {"Time_Start": 1448.2, "Time_End": 1452.52, "Text": " Should we not counterattack in the same manner that we are attacked?"}, {"Time_Start": 1453.16, "Time_End": 1456.46, "Text": " Those are decisions that happen to remain by people in way above my"}, {"Time_Start": 1456.46, "Time_End": 1458.06, "Text": " my food chain."}, {"Time_Start": 1458.06, "Time_End": 1463.06, "Text": " And again, I'm not answering your question, but I simply don't have an answer for you."}, {"Time_Start": 1465.06, "Time_End": 1466.6000000000001, "Text": " This is the next speaker here?"}, {"Time_Start": 1467.18, "Time_End": 1468.3600000000001, "Text": " I don't want to get into your time."}, {"Time_Start": 1468.76, "Time_End": 1468.96, "Text": " Okay."}, {"Time_Start": 1470.82, "Time_End": 1471.82, "Text": " Your question, sir."}, {"Time_Start": 1472.76, "Time_End": 1474.06, "Text": " Yeah, you just mentioned that"}, {"Time_Start": 1474.06, "Time_End": 1478.76, "Text": " you feel that you should counterattack if you've been attacked,"}, {"Time_Start": 1478.8600000000001, "Time_End": 1481.26, "Text": " do you feel that the government has been attacked by the U.S.S."}, {"Time_Start": 1481.26, "Time_End": 1483.3600000000001, "Text": " or the common of the speech?"}, {"Time_Start": 1485.52, "Time_End": 1486.44, "Text": " I don't know that either."}, {"Time_Start": 1486.46, "Time_End": 1492.64, "Text": " Okay, I have run out of my time."}, {"Time_Start": 1492.78, "Time_End": 1494.88, "Text": " I appreciate, again, the invite here."}, {"Time_Start": 1495.0, "Time_End": 1498.48, "Text": " I appreciate your attention, and have a great rest of the conference."}, {"Time_Start": 1498.76, "Time_End": 1499.66, "Text": " Thank you very much."}]}