{"segments": [{"Time_Start": 0.0, "Time_End": 10.0, "Text": " Welcome to the annual DEFCON convention. This meeting was held in exciting Las Vegas Nevada from July 9, through the 11th 1999."}, {"Time_Start": 10.0, "Time_End": 16.0, "Text": " This is video tape number 38 of the DEFCON proxy server."}, {"Time_Start": 16.0, "Time_End": 35.0, "Text": " It's an interesting story on how it came up. At first, me and a friend of mine were at Comdex two years ago, right here in Las Vegas."}, {"Time_Start": 36.0, "Time_End": 45.0, "Text": " We were looking at this vendor who had a content-sensitive filtering device, and we couldn't get to any porn sites."}, {"Time_Start": 45.0, "Time_End": 56.0, "Text": " We didn't want to go to any porn sites, but the thing was, if you could get skin on a page, you would get this teddy bear with bondage on it."}, {"Time_Start": 56.0, "Time_End": 61.0, "Text": " Well, bondage gear on it, and that's what we really wanted. We wanted the teddy bear. We wanted to bring it home."}, {"Time_Start": 61.0, "Time_End": 64.0, "Text": " How many of y'all used the DEFCON proxy server?"}, {"Time_Start": 65.0, "Time_End": 69.0, "Text": " How many of y'all think it sucks?"}, {"Time_Start": 69.0, "Time_End": 78.0, "Text": " Well, that's good. Anyway, what happened is we tried everything we could to get past this device."}, {"Time_Start": 78.0, "Time_End": 85.0, "Text": " What we eventually tried to do was go to a site that was basically all images in no text."}, {"Time_Start": 85.0, "Time_End": 90.0, "Text": " Even by IP address, we couldn't get past this device, so I kind of planted a seed with me."}, {"Time_Start": 90.0, "Time_End": 96.0, "Text": " I wanted to see if I could do something to get around this. I started playing with proxy servers."}, {"Time_Start": 96.0, "Time_End": 106.0, "Text": " What we're going to talk about today is exactly what is a proxy, because it's a newbie truck, but I'm sure most of y'all know what a proxy is, because most of y'all would use it."}, {"Time_Start": 106.0, "Time_End": 111.0, "Text": " Why use a proxy server? Why would you want to use such a device?"}, {"Time_Start": 112.0, "Time_End": 120.0, "Text": " Is it really anonymous, which is a big issue for you guys right now, and a new access policy?"}, {"Time_Start": 120.0, "Time_End": 128.0, "Text": " There's some things that have come up in terms of present resources that we have available to us, and just network utilization."}, {"Time_Start": 128.0, "Time_End": 137.0, "Text": " There's going to be some policy changes to the proxy server, but don't be alone. We're still going to offer some basic free access."}, {"Time_Start": 138.0, "Time_End": 140.0, "Text": " Exactly what is a proxy?"}, {"Time_Start": 140.0, "Time_End": 146.0, "Text": " Well, in networking or computing, a proxy is a device that separates you from a third party."}, {"Time_Start": 146.0, "Time_End": 159.0, "Text": " There are web proxies, there are Telnet proxies, FTP proxies, but because web browsers are the predominant application on the internet, you'll see web proxies more often than that."}, {"Time_Start": 160.0, "Time_End": 170.0, "Text": " And this is a high-level topology of how a regular, a non-proxyed web session is just go."}, {"Time_Start": 170.0, "Time_End": 176.0, "Text": " You have Dilbert, a porn surfer, or just Hacker down there at the bottom, and you have the home user up there at the top."}, {"Time_Start": 176.0, "Time_End": 186.0, "Text": " And what happens is direct TCP connections are made on port 80 or any other web port that are coming, published ports are 80, and for SSL it's 443."}, {"Time_Start": 186.0, "Time_End": 189.0, "Text": " And you go directly over to the porn sites."}, {"Time_Start": 189.0, "Time_End": 205.0, "Text": " And that's kind of intrusive because you can pass environments over there, your email address, things like that, IP address, who you are basically, where you came from, and where you come from in terms of what ISP you're using."}, {"Time_Start": 205.0, "Time_End": 211.0, "Text": " What the DEPCON proxy does is it acts as an intermediary device."}, {"Time_Start": 211.0, "Time_End": 220.0, "Text": " You'll see the, I'll call the segment over to your left, to the web site proxies over segment A, and we'll call the one on the left, segment B."}, {"Time_Start": 220.0, "Time_End": 233.0, "Text": " On segment B, the green dotted lines, the proxies here will take your request, and then it'll go to the site for you, bring back all the data, and then rewrite the pages and display them to you."}, {"Time_Start": 234.0, "Time_End": 245.0, "Text": " And when it does that, it rewrites the link, so any subsequent link that you press on the laptop will force you through the proxy server, so you don't have to worry about that."}, {"Time_Start": 245.0, "Time_End": 257.0, "Text": " Just some things when there's an FTP link or an email link, and it's going to make you leave the proxy, it'll warn you before that, it'll give you the link in case you do want to go there anyway."}, {"Time_Start": 258.0, "Time_End": 281.0, "Text": " The real, well, a lot of issues where people are writing, you know, URLs were showing up in corporate proxy filters, and they were concerned that their boss or the government might be able to view the traffic that was going over there, because it isn't anonymous."}, {"Time_Start": 281.0, "Time_End": 290.0, "Text": " It's anonymous from the all server proxy to the destination website, but it's not at all anonymous between all server and you."}, {"Time_Start": 290.0, "Time_End": 298.0, "Text": " And even the red dotted lines on segment A show that it's an encrypted session, but even though it's encrypted, it's not really anonymous."}, {"Time_Start": 298.0, "Time_End": 310.0, "Text": " From here, your boss, which is the company you work for, the ISP, the government, they can still tell that you're going to the proxy server, but because the session is encrypted, they can't read your traffic."}, {"Time_Start": 310.0, "Time_End": 313.0, "Text": " Which for some of the years is very important also."}, {"Time_Start": 313.0, "Time_End": 325.0, "Text": " And another thing that the encrypted version of the deaf crime proxy shows is that it blows through content filtering devices, which is what I wanted to do."}, {"Time_Start": 325.0, "Time_End": 328.0, "Text": " I wanted to blow through content devices."}, {"Time_Start": 328.0, "Time_End": 331.0, "Text": " That was my original goal, because I wanted to get past that device."}, {"Time_Start": 331.0, "Time_End": 343.0, "Text": " So if your boss is going to let you go out on 443, which is at the SSL port, and you can make it to the deaf crime proxy server, you're going to be able to pretty much get whatever you want."}, {"Time_Start": 343.0, "Time_End": 352.0, "Text": " What happens is you go out of destination port 443, and then the deaf crime proxy server will go out of destination 80."}, {"Time_Start": 353.0, "Time_End": 363.0, "Text": " So you can visit non-SSL sites by using SSL and also, I'm sorry, deaf crime, it used to be also, and it became a part of the deaf crime organization not too long ago."}, {"Time_Start": 369.0, "Time_End": 371.0, "Text": " You know who that is?"}, {"Time_Start": 371.0, "Time_End": 378.0, "Text": " That's DQ on top of the Grand Plaza Hotel in Taiwan."}, {"Time_Start": 378.0, "Time_End": 380.0, "Text": " I talked about it jumping."}, {"Time_Start": 381.0, "Time_End": 384.0, "Text": " Why use a proxy server?"}, {"Time_Start": 386.0, "Time_End": 389.0, "Text": " An amenity. You might want to remain anonymous."}, {"Time_Start": 389.0, "Time_End": 392.0, "Text": " That's the biggest reason for all of you guys."}, {"Time_Start": 392.0, "Time_End": 407.0, "Text": " Also, we started, in the beginning when we were doing this, what happened is it turned out as something I wanted to do, and then I told a couple of friends about it, and the couple of friends told a couple of friends, and then Jericho put it on attrition.org,"}, {"Time_Start": 407.0, "Time_End": 415.0, "Text": " Jericho or DQ put it on the deaf crime site, so this isn't something that was programmed on purpose."}, {"Time_Start": 415.0, "Time_End": 418.0, "Text": " Well, it was programmed on purpose, but it hasn't engineered."}, {"Time_Start": 418.0, "Time_End": 426.0, "Text": " This is not something that was planned to be rolled out to millions and millions of people, and it is millions and millions of people, believe it or not."}, {"Time_Start": 426.0, "Time_End": 436.0, "Text": " I know it's Sunday and it's early, and it turned out kind of well, but on a Tuesday that we stopped logging the service, which was about four weeks ago when we stopped testing it,"}, {"Time_Start": 436.0, "Time_End": 439.0, "Text": " we basically logged to see where people were going."}, {"Time_Start": 439.0, "Time_End": 447.0, "Text": " We didn't care who you were. We wanted to know why you use the proxy server, and the vast majority, I'm talking like 90% of you guys use it for porn."}, {"Time_Start": 447.0, "Time_End": 459.0, "Text": " I'm serious. We saw people rooting around in CGI bins and going to government sites and stuff like that, but the vast majority of you guys use it for porn."}, {"Time_Start": 459.0, "Time_End": 471.0, "Text": " And what I was going to do today is I set out last night on a mission to go look for the little teddy bear with bondage on it, but I couldn't find it."}, {"Time_Start": 471.0, "Time_End": 477.0, "Text": " So what I did is grab goodies today, by the way."}, {"Time_Start": 477.0, "Time_End": 491.0, "Text": " In Iowa, where the proxy server is based on it, I got y'all an inflatable pig blow-up doll."}, {"Time_Start": 491.0, "Time_End": 497.0, "Text": " You're a lucky guy."}, {"Time_Start": 497.0, "Time_End": 503.0, "Text": " But anonymity is the biggest reason why a person would want to use our proxy server. Yes, we assume."}, {"Time_Start": 503.0, "Time_End": 507.0, "Text": " The second one is you're forced. You might not have a choice to use a proxy server."}, {"Time_Start": 507.0, "Time_End": 518.0, "Text": " If you're in a corporate environment and you're sitting on your company land, they may have a proxy server that they force you to go through."}, {"Time_Start": 518.0, "Time_End": 524.0, "Text": " And the reason that they do that is, well, there's a couple of reasons they might want to do it."}, {"Time_Start": 524.0, "Time_End": 534.0, "Text": " As a consultant, I can tell you that I'll go into a company and I'll recommend a caching proxy server, which stores web pages locally."}, {"Time_Start": 534.0, "Time_End": 541.0, "Text": " The perception is that all subsequent accesses are faster, but it really isn't."}, {"Time_Start": 541.0, "Time_End": 544.0, "Text": " Well, it is faster because it's coming from the local segment."}, {"Time_Start": 544.0, "Time_End": 552.0, "Text": " And what you do by implementing a caching proxy server is you can roll the utilization on your WAN link, which is very important,"}, {"Time_Start": 552.0, "Time_End": 558.0, "Text": " because if you go to a company, and for example, the company's WAN link, say the public internet connection is a key one,"}, {"Time_Start": 558.0, "Time_End": 561.0, "Text": " it costs $2,700 a month."}, {"Time_Start": 561.0, "Time_End": 570.0, "Text": " If you tell them that you can cut down on the utilization of their WAN link and put off upgrading that line for another year or so,"}, {"Time_Start": 570.0, "Time_End": 575.0, "Text": " they'll say tens of thousands of dollars over a period of a year."}, {"Time_Start": 575.0, "Time_End": 578.0, "Text": " And you get a big yawn when you tell them that."}, {"Time_Start": 578.0, "Time_End": 587.0, "Text": " But another reason that they force you to go through a proxy, and probably the real reason, is if you go to the HR director and you tell them by implementing a caching proxy server"}, {"Time_Start": 587.0, "Time_End": 598.0, "Text": " that you can spy on your employees and see where they're going and back up the pages that they go to, well, then you get the PO sign in like 30 seconds."}, {"Time_Start": 599.0, "Time_End": 601.0, "Text": " High pass restrictions."}, {"Time_Start": 601.0, "Time_End": 610.0, "Text": " You go might have a firewall or filter based on content, I'm sorry, a firewall, have a firewall or filter based on content or site destination."}, {"Time_Start": 610.0, "Time_End": 615.0, "Text": " And this is really popular with countries like Cuba, China, Russia."}, {"Time_Start": 615.0, "Time_End": 617.0, "Text": " They don't want you to go to the CNN site."}, {"Time_Start": 617.0, "Time_End": 619.0, "Text": " They don't want you to go to the American government site."}, {"Time_Start": 619.0, "Time_End": 622.0, "Text": " And I'm not saying that you can come to America and get the real store."}, {"Time_Start": 622.0, "Time_End": 626.0, "Text": " I'm just saying that they can go come to America and get the other side of the store."}, {"Time_Start": 626.0, "Time_End": 630.0, "Text": " And they can make a decision based on what they've learned."}, {"Time_Start": 630.0, "Time_End": 637.0, "Text": " And I recently got a letter from a guy in Russia who said that he really, really likes their proxy server and he uses it all the time."}, {"Time_Start": 637.0, "Time_End": 639.0, "Text": " And he sent that to me in email."}, {"Time_Start": 639.0, "Time_End": 643.0, "Text": " He said he uses the encrypted version because he can bypass the government that way."}, {"Time_Start": 643.0, "Time_End": 647.0, "Text": " And what happened is he sent it to me in clear text email."}, {"Time_Start": 647.0, "Time_End": 649.0, "Text": " So he used the encrypted version of the proxy."}, {"Time_Start": 649.0, "Time_End": 652.0, "Text": " Then he sends me the email in clear text."}, {"Time_Start": 652.0, "Time_End": 655.0, "Text": " So I envisioned, like, the government going there."}, {"Time_Start": 655.0, "Time_End": 658.0, "Text": " And I chatted a couple of minutes later because I responded to him."}, {"Time_Start": 658.0, "Time_End": 662.0, "Text": " I never got back."}, {"Time_Start": 662.0, "Time_End": 665.0, "Text": " Who knows who that is?"}, {"Time_Start": 665.0, "Time_End": 666.0, "Text": " Microsoft?"}, {"Time_Start": 666.0, "Time_End": 667.0, "Text": " Here."}, {"Time_Start": 667.0, "Time_End": 668.0, "Text": " I don't want to throw it."}, {"Time_Start": 668.0, "Time_End": 669.0, "Text": " It's here."}, {"Time_Start": 669.0, "Time_End": 670.0, "Text": " You want it?"}, {"Time_Start": 670.0, "Time_End": 672.0, "Text": " You know?"}, {"Time_Start": 672.0, "Time_End": 674.0, "Text": " It's a jack off, bro."}, {"Time_Start": 674.0, "Time_End": 676.0, "Text": " Anybody else want it?"}, {"Time_Start": 676.0, "Time_End": 677.0, "Text": " No?"}, {"Time_Start": 677.0, "Time_End": 678.0, "Text": " Yeah, it's a proxy server."}, {"Time_Start": 678.0, "Time_End": 679.0, "Text": " It's a proxy for your hand."}, {"Time_Start": 679.0, "Time_End": 681.0, "Text": " Okay."}, {"Time_Start": 681.0, "Time_End": 685.0, "Text": " I got better prices as we all are."}, {"Time_Start": 685.0, "Time_End": 688.0, "Text": " Well, hold on a second."}, {"Time_Start": 688.0, "Time_End": 690.0, "Text": " You want the pleasure cups instead?"}, {"Time_Start": 690.0, "Time_End": 694.0, "Text": " Okay."}, {"Time_Start": 694.0, "Time_End": 697.0, "Text": " I can't throw them this too heavy."}, {"Time_Start": 697.0, "Time_End": 700.0, "Text": " Is it really anonymous?"}, {"Time_Start": 700.0, "Time_End": 704.0, "Text": " No, but I feel that we've made a good effort in that part."}, {"Time_Start": 704.0, "Time_End": 707.0, "Text": " The best effort, actually, that we can do, I think."}, {"Time_Start": 707.0, "Time_End": 709.0, "Text": " It's encrypted."}, {"Time_Start": 710.0, "Time_End": 712.0, "Text": " The boss still knows where you're going."}, {"Time_Start": 712.0, "Time_End": 721.0, "Text": " But even more importantly to some of you guys is between also the DEF CON proxy server and you."}, {"Time_Start": 721.0, "Time_End": 726.0, "Text": " There's no way to control who's going to be monitoring that, who's going to be sniffing that,"}, {"Time_Start": 726.0, "Time_End": 727.0, "Text": " even though they can't see you."}, {"Time_Start": 727.0, "Time_End": 730.0, "Text": " They know that you're using the server."}, {"Time_Start": 730.0, "Time_End": 734.0, "Text": " And the government, I think, can brute force that encryption."}, {"Time_Start": 734.0, "Time_End": 735.0, "Text": " But I don't think the boss can."}, {"Time_Start": 735.0, "Time_End": 738.0, "Text": " So if you're going to use it for points, I think you're fine."}, {"Time_Start": 738.0, "Time_End": 739.0, "Text": " You're up to no good."}, {"Time_Start": 739.0, "Time_End": 742.0, "Text": " Who knows?"}, {"Time_Start": 742.0, "Time_End": 743.0, "Text": " Whoops."}, {"Time_Start": 743.0, "Time_End": 747.0, "Text": " The clear text version of the proxy is anonymous, as you know from the web server point of view."}, {"Time_Start": 747.0, "Time_End": 750.0, "Text": " And the encrypted version is anonymous to the web server as well."}, {"Time_Start": 750.0, "Time_End": 754.0, "Text": " And like I just said, they can still sniff your traffic, but they can't read it."}, {"Time_Start": 754.0, "Time_End": 762.0, "Text": " So a lot of people, I don't want you all to get the impression that it's anonymous from you to also read the notes encrypted."}, {"Time_Start": 762.0, "Time_End": 763.0, "Text": " It's not."}, {"Time_Start": 763.0, "Time_End": 770.0, "Text": " It's just, it's, they can see your traffic still."}, {"Time_Start": 770.0, "Time_End": 771.0, "Text": " And that's bail."}, {"Time_Start": 771.0, "Time_End": 772.0, "Text": " And nobody wants to jack off bail."}, {"Time_Start": 772.0, "Time_End": 777.0, "Text": " That's okay."}, {"Time_Start": 777.0, "Time_End": 781.0, "Text": " The DEF CON proxy server is now part of the DEF CON organization."}, {"Time_Start": 781.0, "Time_End": 788.0, "Text": " And what that means is it's going to have a DEF CON URL and it's going to be based out of Seattle."}, {"Time_Start": 788.0, "Time_End": 789.0, "Text": " We're going to move it from Iowa."}, {"Time_Start": 789.0, "Time_End": 798.0, "Text": " Believe it or not, the proxy server is running on a Pentium 75 with 32 megs of RAM running free BS day."}, {"Time_Start": 798.0, "Time_End": 801.0, "Text": " And it's getting beat to death right now."}, {"Time_Start": 801.0, "Time_End": 803.0, "Text": " I'm trying to keep sure that the machine almost dies."}, {"Time_Start": 803.0, "Time_End": 804.0, "Text": " So we're going to upgrade the machine."}, {"Time_Start": 804.0, "Time_End": 807.0, "Text": " It's going to go on a door Pentium machine."}, {"Time_Start": 807.0, "Time_End": 813.0, "Text": " And it's going to go to a place where we have either that connectivity to a DS3."}, {"Time_Start": 813.0, "Time_End": 817.0, "Text": " We will continue to offer the clear text version of the proxy server."}, {"Time_Start": 817.0, "Time_End": 818.0, "Text": " And that's not correct."}, {"Time_Start": 818.0, "Time_End": 822.0, "Text": " We're still going to offer the encrypted version as well for free as a community service."}, {"Time_Start": 822.0, "Time_End": 827.0, "Text": " And we're going to limit the bandwidth."}, {"Time_Start": 827.0, "Time_End": 830.0, "Text": " I think we're going to start off at 256."}, {"Time_Start": 830.0, "Time_End": 835.0, "Text": " And I think we're willing to develop the 512K for the proxy server, for the free services."}, {"Time_Start": 835.0, "Time_End": 837.0, "Text": " So you're always going to be able to get in."}, {"Time_Start": 837.0, "Time_End": 839.0, "Text": " You're always going to be able to use it for free."}, {"Time_Start": 839.0, "Time_End": 844.0, "Text": " But sometimes it's going to be kind of slow during peak times."}, {"Time_Start": 844.0, "Time_End": 852.0, "Text": " Can you tell us a little bit about what you're using for?"}, {"Time_Start": 852.0, "Time_End": 853.0, "Text": " Yes."}, {"Time_Start": 853.0, "Time_End": 856.0, "Text": " What do you use it for?"}, {"Time_Start": 856.0, "Time_End": 858.0, "Text": " What do you use it for?"}, {"Time_Start": 858.0, "Time_End": 859.0, "Text": " What do you use it for?"}, {"Time_Start": 859.0, "Time_End": 861.0, "Text": " What do you use it for?"}, {"Time_Start": 861.0, "Time_End": 862.0, "Text": " I'll tell you."}, {"Time_Start": 862.0, "Time_End": 863.0, "Text": " Okay."}, {"Time_Start": 863.0, "Time_End": 864.0, "Text": " All right."}, {"Time_Start": 864.0, "Time_End": 868.0, "Text": " But I know that I have no other way to use it for free."}, {"Time_Start": 868.0, "Time_End": 870.0, "Text": " And then I'll open it for free."}, {"Time_Start": 870.0, "Time_End": 871.0, "Text": " Okay."}, {"Time_Start": 871.0, "Time_End": 872.0, "Text": " Okay."}, {"Time_Start": 872.0, "Time_End": 883.0, "Text": " And I would like to see if there's anything else you would like to share with you that you're going to be able to do."}, {"Time_Start": 883.0, "Time_End": 885.0, "Text": " Mm-hmm."}, {"Time_Start": 885.0, "Time_End": 888.0, "Text": " You'll be able to do it."}, {"Time_Start": 888.0, "Time_End": 890.0, "Text": " And we have a way of separating them."}, {"Time_Start": 890.0, "Time_End": 894.0, "Text": " There's going to be an economic mechanism."}, {"Time_Start": 894.0, "Time_End": 896.0, "Text": " I'll get to that."}, {"Time_Start": 896.0, "Time_End": 899.0, "Text": " So we're going to continue to offer that for free."}, {"Time_Start": 899.0, "Time_End": 901.0, "Text": " The encrypted version of the blah blah blah blah blah."}, {"Time_Start": 901.0, "Time_End": 906.0, "Text": " And some other, you know, new features will cost a nominal fee per year."}, {"Time_Start": 906.0, "Time_End": 910.0, "Text": " And like I said, that's not accurate because we're also going to offer encrypted for free."}, {"Time_Start": 910.0, "Time_End": 916.0, "Text": " But unlimited pipe, not full-blown DS3."}, {"Time_Start": 916.0, "Time_End": 918.0, "Text": " The new domain will be DEFCON.net."}, {"Time_Start": 918.0, "Time_End": 922.0, "Text": " We covered that."}, {"Time_Start": 922.0, "Time_End": 927.0, "Text": " And what you'll get is you'll get access to all web proxies."}, {"Time_Start": 927.0, "Time_End": 931.0, "Text": " Well, also, you're going to be able to open up an account with us."}, {"Time_Start": 931.0, "Time_End": 934.0, "Text": " And your e-mail address will be at DEFCON.net."}, {"Time_Start": 934.0, "Time_End": 936.0, "Text": " And we're going to have a hot mail."}, {"Time_Start": 936.0, "Time_End": 937.0, "Text": " Well, actually, it's already done."}, {"Time_Start": 937.0, "Time_End": 939.0, "Text": " It's a hot mail type of interface."}, {"Time_Start": 939.0, "Time_End": 941.0, "Text": " And it's going to be through SSL."}, {"Time_Start": 941.0, "Time_End": 943.0, "Text": " So you can send clear text to e-mail."}, {"Time_Start": 943.0, "Time_End": 954.0, "Text": " But you can go to DEFCON and offer that e-mail via your web browser and it will be encrypted."}, {"Time_Start": 954.0, "Time_End": 957.0, "Text": " And we're also going to have Telnet and NetGP proxies."}, {"Time_Start": 957.0, "Time_End": 963.0, "Text": " And they're going to be authenticated using the DEFCON.net login."}, {"Time_Start": 963.0, "Time_End": 966.0, "Text": " Because a lot of people actually are requesting to Telnet."}, {"Time_Start": 966.0, "Time_End": 971.0, "Text": " Not so much DEFCP, but a lot of people are requesting to Telnet proxy."}, {"Time_Start": 971.0, "Time_End": 974.0, "Text": " The membership is going to be $50 per year."}, {"Time_Start": 974.0, "Time_End": 979.0, "Text": " We're going to donate some of that to either EFF or Epic."}, {"Time_Start": 979.0, "Time_End": 983.0, "Text": " So it's going to be a good cause, any leftover that we have."}, {"Time_Start": 983.0, "Time_End": 991.0, "Text": " But mostly, we did just to try to separate the people who are looking for free porn, actually."}, {"Time_Start": 991.0, "Time_End": 993.0, "Text": " We don't know if it's going to work."}, {"Time_Start": 993.0, "Time_End": 995.0, "Text": " And because this is an..."}, {"Time_Start": 995.0, "Time_End": 1004.0, "Text": " Do you think so?"}, {"Time_Start": 1004.0, "Time_End": 1006.0, "Text": " I'm sorry?"}, {"Time_Start": 1006.0, "Time_End": 1007.0, "Text": " Well, no."}, {"Time_Start": 1007.0, "Time_End": 1008.0, "Text": " I know."}, {"Time_Start": 1008.0, "Time_End": 1009.0, "Text": " We just..."}, {"Time_Start": 1009.0, "Time_End": 1011.0, "Text": " The sign-up is going to be kind of painful."}, {"Time_Start": 1011.0, "Time_End": 1013.0, "Text": " So the porn guys are kind of instant."}, {"Time_Start": 1013.0, "Time_End": 1015.0, "Text": " It's an impulse buy."}, {"Time_Start": 1015.0, "Time_End": 1018.0, "Text": " They can sign up on the Net and it's just instant access."}, {"Time_Start": 1018.0, "Time_End": 1023.0, "Text": " So we think that because the sign-up is going to be kind of painful, because the sign-up also has to be anonymous."}, {"Time_Start": 1023.0, "Time_End": 1029.0, "Text": " If you pay me with a credit card or a 900 number, the PT key is going to log that 900 call."}, {"Time_Start": 1029.0, "Time_End": 1034.0, "Text": " Or the credit card is going to be billed somewhere, so it's still not anonymous."}, {"Time_Start": 1034.0, "Time_End": 1041.0, "Text": " So what's going to happen is, later on in the slide, I think it is, we say that you're going to have to pay over there at the registration booth."}, {"Time_Start": 1041.0, "Time_End": 1042.0, "Text": " But we're not going to do that."}, {"Time_Start": 1042.0, "Time_End": 1043.0, "Text": " We're going to have a secure form."}, {"Time_Start": 1043.0, "Time_End": 1048.0, "Text": " And on this form, all you're going to do is give us a name and a password, and you're going to hit the submit button."}, {"Time_Start": 1048.0, "Time_End": 1054.0, "Text": " And the form is going to return the address, which is basically a DEF CON, a Jeff Moss."}, {"Time_Start": 1054.0, "Time_End": 1056.0, "Text": " And you're going to send the money to him."}, {"Time_Start": 1056.0, "Time_End": 1060.0, "Text": " And when the money gets there, then we enable the account."}, {"Time_Start": 1060.0, "Time_End": 1066.0, "Text": " And we're hoping that you guys will do that via money order and just write your user name in the member section of the money order."}, {"Time_Start": 1066.0, "Time_End": 1069.0, "Text": " And like I said, all of this is subject to change, because we're not a big corporation."}, {"Time_Start": 1069.0, "Time_End": 1071.0, "Text": " We're very nimble."}, {"Time_Start": 1071.0, "Time_End": 1075.0, "Text": " If it doesn't work, we just kind of have to fix it some kind of way."}, {"Time_Start": 1080.0, "Time_End": 1081.0, "Text": " I'm lying."}, {"Time_Start": 1081.0, "Time_End": 1087.0, "Text": " I mean, there's some things we have to address, though."}, {"Time_Start": 1087.0, "Time_End": 1090.0, "Text": " Because like you said, the guy in China can't afford 50 bucks."}, {"Time_Start": 1090.0, "Time_End": 1093.0, "Text": " Or we just have a hard time getting into it."}, {"Time_Start": 1093.0, "Time_End": 1094.0, "Text": " I mean, there's currency issues."}, {"Time_Start": 1094.0, "Time_End": 1097.0, "Text": " And can he walk into a 7-Eleven and get him on the order?"}, {"Time_Start": 1097.0, "Time_End": 1100.0, "Text": " No, quite frankly, that's something that we didn't think of."}, {"Time_Start": 1100.0, "Time_End": 1103.0, "Text": " And like I said, this isn't something that was engineered."}, {"Time_Start": 1103.0, "Time_End": 1108.0, "Text": " This wasn't something that was supposed to be rolled out as a product sometime."}, {"Time_Start": 1108.0, "Time_End": 1109.0, "Text": " I'm not slipping."}, {"Time_Start": 1109.0, "Time_End": 1110.0, "Text": " No."}, {"Time_Start": 1110.0, "Time_End": 1111.0, "Text": " I understand."}, {"Time_Start": 1111.0, "Time_End": 1112.0, "Text": " How many year next year?"}, {"Time_Start": 1112.0, "Time_End": 1114.0, "Text": " What should we switch?"}, {"Time_Start": 1114.0, "Time_End": 1117.0, "Text": " Well, internationally, it probably won't play out very well."}, {"Time_Start": 1117.0, "Time_End": 1120.0, "Text": " And if you're domestically, you bring up a good point."}, {"Time_Start": 1120.0, "Time_End": 1126.0, "Text": " But I don't think a lot of point servers are going to go through the trouble of signing up to use it."}, {"Time_Start": 1126.0, "Time_End": 1132.0, "Text": " And if somebody's paying for the bandwidth, and they send us $50 per year,"}, {"Time_Start": 1132.0, "Time_End": 1136.0, "Text": " and it's popular, and it makes a million or $2 a year."}, {"Time_Start": 1136.0, "Time_End": 1139.0, "Text": " And we're just looking to subsidize some of the network utilization."}, {"Time_Start": 1139.0, "Time_End": 1142.0, "Text": " So if we can take money off the top and send it to EFF or Epic,"}, {"Time_Start": 1142.0, "Time_End": 1143.0, "Text": " that's a good thing, don't you?"}, {"Time_Start": 1143.0, "Time_End": 1144.0, "Text": " All right."}, {"Time_Start": 1144.0, "Time_End": 1147.0, "Text": " If you're not supposed to talk to EFF, you're going to be able to come back."}, {"Time_Start": 1147.0, "Time_End": 1148.0, "Text": " That's fine."}, {"Time_Start": 1148.0, "Time_End": 1152.0, "Text": " If you're going to have money, you're going to be able to come back."}, {"Time_Start": 1152.0, "Time_End": 1155.0, "Text": " I talk with David's syllable a lot."}, {"Time_Start": 1155.0, "Time_End": 1158.0, "Text": " With Epic, EFF is no real coach to sign anything."}, {"Time_Start": 1158.0, "Time_End": 1160.0, "Text": " But you do."}, {"Time_Start": 1160.0, "Time_End": 1162.0, "Text": " That's a good point as well."}, {"Time_Start": 1162.0, "Time_End": 1166.0, "Text": " I know that they do good legislative work and good lobbying work and stuff like that."}, {"Time_Start": 1166.0, "Time_End": 1168.0, "Text": " But, you know, they get donations."}, {"Time_Start": 1168.0, "Time_End": 1171.0, "Text": " And if somebody is a significant contributor to their cause,"}, {"Time_Start": 1171.0, "Time_End": 1177.0, "Text": " then, yeah, maybe they can sponsor some of the people who want to use it internationally."}, {"Time_Start": 1179.0, "Time_End": 1181.0, "Text": " Forget that."}, {"Time_Start": 1181.0, "Time_End": 1182.0, "Text": " There was no printer here."}, {"Time_Start": 1182.0, "Time_End": 1185.0, "Text": " That's the reason for that, basically."}, {"Time_Start": 1185.0, "Time_End": 1188.0, "Text": " It's scheduled for roll-out 9.15."}, {"Time_Start": 1188.0, "Time_End": 1192.0, "Text": " And all present services will remain free until roll-out."}, {"Time_Start": 1192.0, "Time_End": 1193.0, "Text": " And it may be early."}, {"Time_Start": 1193.0, "Time_End": 1196.0, "Text": " That's just something I came up with off the top of my head."}, {"Time_Start": 1196.0, "Time_End": 1199.0, "Text": " I got to go home and kick the dog and kiss my wife"}, {"Time_Start": 1199.0, "Time_End": 1201.0, "Text": " and take a rest and go back to work."}, {"Time_Start": 1201.0, "Time_End": 1204.0, "Text": " But I think I'm going to have it out by 9.15."}, {"Time_Start": 1206.0, "Time_End": 1211.0, "Text": " And here's the present URLs and the past URLs."}, {"Time_Start": 1211.0, "Time_End": 1212.0, "Text": " I'm sorry."}, {"Time_Start": 1212.0, "Time_End": 1213.0, "Text": " They're the present in the future."}, {"Time_Start": 1213.0, "Time_End": 1214.0, "Text": " I'm sorry."}, {"Time_Start": 1214.0, "Time_End": 1218.0, "Text": " So after the 15th, you can just go to proxy.duffcon.net"}, {"Time_Start": 1218.0, "Time_End": 1222.0, "Text": " or proxy.duffcon.net"}, {"Time_Start": 1222.0, "Time_End": 1223.0, "Text": " for the paying services."}, {"Time_Start": 1223.0, "Time_End": 1226.0, "Text": " And if you want to write the guys who wanted to email,"}, {"Time_Start": 1226.0, "Time_End": 1230.0, "Text": " just send them an email at the proxy at duffcon.net."}, {"Time_Start": 1232.0, "Time_End": 1233.0, "Text": " And that's it."}, {"Time_Start": 1233.0, "Time_End": 1234.0, "Text": " Q&A."}, {"Time_Start": 1237.0, "Time_End": 1238.0, "Text": " I'm sorry?"}, {"Time_Start": 1238.0, "Time_End": 1239.0, "Text": " Wait."}, {"Time_Start": 1239.0, "Time_End": 1240.0, "Text": " Just wait right there."}, {"Time_Start": 1240.0, "Time_End": 1241.0, "Text": " It's the same thing."}, {"Time_Start": 1241.0, "Time_End": 1242.0, "Text": " Okay."}, {"Time_Start": 1245.0, "Time_End": 1246.0, "Text": " Hmm."}, {"Time_Start": 1262.0, "Time_End": 1264.0, "Text": " Are we getting all of this?"}, {"Time_Start": 1264.0, "Time_End": 1266.0, "Text": " Oh, this presentation is going to be available."}, {"Time_Start": 1266.0, "Time_End": 1267.0, "Text": " I don't have my speaker notes."}, {"Time_Start": 1267.0, "Time_End": 1269.0, "Text": " There's so much more I wanted to tell you guys."}, {"Time_Start": 1269.0, "Time_End": 1272.0, "Text": " This presentation will be available on the Duck Ground proxy server side."}, {"Time_Start": 1272.0, "Time_End": 1274.0, "Text": " So you can download it and take a look at the speaker notes."}, {"Time_Start": 1274.0, "Time_End": 1277.0, "Text": " And you can go, oh, yeah, that wouldn't have went away well at all."}, {"Time_Start": 1279.0, "Time_End": 1280.0, "Text": " There we go."}, {"Time_Start": 1281.0, "Time_End": 1282.0, "Text": " Okay, guys."}, {"Time_Start": 1291.0, "Time_End": 1292.0, "Text": " I can't hear you, sir."}, {"Time_Start": 1296.0, "Time_End": 1298.0, "Text": " No, but those addresses are the site."}, {"Time_Start": 1298.0, "Time_End": 1299.0, "Text": " But the present..."}, {"Time_Start": 1300.0, "Time_End": 1303.0, "Text": " Oh, yeah, for the new URLs in the addresses,"}, {"Time_Start": 1303.0, "Time_End": 1304.0, "Text": " we're going to put something up."}, {"Time_Start": 1304.0, "Time_End": 1307.0, "Text": " You can expect to see all of this Monday night."}, {"Time_Start": 1309.0, "Time_End": 1310.0, "Text": " No."}, {"Time_Start": 1310.0, "Time_End": 1313.0, "Text": " On DC's hyphen proxy dot also."}, {"Time_Start": 1314.0, "Time_End": 1316.0, "Text": " Yeah, that's the present URL."}, {"Time_Start": 1326.0, "Time_End": 1327.0, "Text": " Any questions?"}, {"Time_Start": 1330.0, "Time_End": 1333.0, "Text": " Okay, who wants a copy of free BSD 3.2?"}, {"Time_Start": 1334.0, "Time_End": 1336.0, "Text": " Who knows where URL is?"}, {"Time_Start": 1339.0, "Time_End": 1340.0, "Text": " Yeah."}, {"Time_Start": 1342.0, "Time_End": 1343.0, "Text": " Nope, not research."}, {"Time_Start": 1345.0, "Time_End": 1347.0, "Text": " Yeah, we got it."}, {"Time_Start": 1350.0, "Time_End": 1353.0, "Text": " And if anybody wants to jack glove, y'all can just come up and get it."}, {"Time_Start": 1356.0, "Time_End": 1357.0, "Text": " I'm sorry?"}, {"Time_Start": 1359.0, "Time_End": 1361.0, "Text": " I'm sorry, this isn't Jeopardy."}, {"Time_Start": 1367.0, "Time_End": 1369.0, "Text": " You're going to rush all the time."}, {"Time_Start": 1371.0, "Time_End": 1372.0, "Text": " You're going to rush all the time."}, {"Time_Start": 1372.0, "Time_End": 1373.0, "Text": " Wait, wait, hold on a second."}, {"Time_Start": 1373.0, "Time_End": 1375.0, "Text": " You're going to throw up."}, {"Time_Start": 1385.0, "Time_End": 1387.0, "Text": " What about what the pleasure comes?"}, {"Time_Start": 1389.0, "Time_End": 1390.0, "Text": " Oh, well, okay."}, {"Time_Start": 1392.0, "Time_End": 1394.0, "Text": " Thank y'all very much for coming out this hour."}, {"Time_Start": 1394.0, "Time_End": 1395.0, "Text": " I appreciate it."}]}