{"segments": [{"Time_Start": 0.0, "Time_End": 6.16, "Text": " Convention. This meeting was held in exciting Las Vegas, Nevada from July night through the 11th, 1999."}, {"Time_Start": 8.22, "Time_End": 11.92, "Text": " This is video tape number 47, Crypto Tales."}, {"Time_Start": 15.92, "Time_End": 21.6, "Text": " Okay, so, that's a bit loud, I think."}, {"Time_Start": 23.04, "Time_End": 29.98, "Text": " Okay, so, I'm here. I've been doing crypto stuff for a few years now, so I'm going to"}, {"Time_Start": 30.0, "Time_End": 34.32, "Text": " to tell a bunch of stories about stuff in the crypto industry, stuff that I've done with my"}, {"Time_Start": 34.32, "Time_End": 37.94, "Text": " company in the past, stuff to other people have done in the crypto industry, some losing"}, {"Time_Start": 37.94, "Time_End": 42.58, "Text": " stories you might not have heard before. But if anyone has a specific story, they'd like to hear"}, {"Time_Start": 42.58, "Time_End": 48.58, "Text": " that I might know. Feel free to request a story, because I might know the story, and I could"}, {"Time_Start": 48.58, "Time_End": 54.260000000000005, "Text": " tell it, and so that could be fun. And so, I mean, to start off, does anyone have any specific"}, {"Time_Start": 54.260000000000005, "Time_End": 59.46, "Text": " request to begin? Or should I just come up with my own list of stories to start with?"}, {"Time_Start": 60.0, "Time_End": 61.0, "Text": " Requests?"}, {"Time_Start": 61.0, "Time_End": 62.0, "Text": " Okay."}, {"Time_Start": 62.0, "Time_End": 64.0, "Text": " So let me come up with a story."}, {"Time_Start": 64.0, "Time_End": 65.0, "Text": " Oh, you do."}, {"Time_Start": 65.0, "Time_End": 66.0, "Text": " Okay."}, {"Time_Start": 66.0, "Time_End": 67.0, "Text": " Okay."}, {"Time_Start": 67.0, "Time_End": 73.0, "Text": " I didn't know that story very well because I wasn't there, but I can tell that story."}, {"Time_Start": 73.0, "Time_End": 77.0, "Text": " So, I can make it up, too."}, {"Time_Start": 77.0, "Time_End": 84.0, "Text": " So apparently, the story is this, it's not a very long story because I wasn't there."}, {"Time_Start": 84.0, "Time_End": 86.0, "Text": " So Jim Bidzai is talking to some NSA people."}, {"Time_Start": 86.0, "Time_End": 88.0, "Text": " I said, this was actually a long time ago."}, {"Time_Start": 88.0, "Time_End": 90.0, "Text": " This was probably a 92 or 902."}, {"Time_Start": 90.0, "Time_End": 91.0, "Text": " or something like that."}, {"Time_Start": 91.0, "Time_End": 94.0, "Text": " Long time ago, the grand scale of things, of course."}, {"Time_Start": 94.0, "Time_End": 100.0, "Text": " And, of course, RSA has had an interesting relationship with the NSA, because of course they always"}, {"Time_Start": 100.0, "Time_End": 101.0, "Text": " get export license."}, {"Time_Start": 101.0, "Time_End": 106.0, "Text": " They've made all for their cryptography and stuff."}, {"Time_Start": 106.0, "Time_End": 109.0, "Text": " So they have to maintain a good relationship with the NSA."}, {"Time_Start": 109.0, "Time_End": 115.0, "Text": " But of course, they also have to maintain a good experience with the crypto community and claim"}, {"Time_Start": 115.0, "Time_End": 119.0, "Text": " and have a very antagonistic attitude with the NSA in the public eye."}, {"Time_Start": 119.0, "Time_End": 120.0, "Text": " guy."}, {"Time_Start": 120.0, "Time_End": 126.0, "Text": " So it creates an interesting perspective because RSA has to kiss NSA ass on one side and they also"}, {"Time_Start": 126.0, "Time_End": 128.12, "Text": " have to kick their ass on the other side."}, {"Time_Start": 128.12, "Time_End": 133.36, "Text": " So I'm not sure if this was actually the case back when this happened, but apparently Jim"}, {"Time_Start": 133.36, "Time_End": 140.24, "Text": " Bids also likes to tell this story of how when at one point he was talking to some NSA guys"}, {"Time_Start": 140.24, "Time_End": 144.32, "Text": " and they were being assholes to him and he was being an asshole to them."}, {"Time_Start": 144.32, "Time_End": 148.98, "Text": " And then they just said rather casually that they could just fix this."}, {"Time_Start": 149.0, "Time_End": 153.0, "Text": " out in the parking lot with a car running over him."}, {"Time_Start": 153.0, "Time_End": 158.0, "Text": " And so he didn't appreciate that very much, and so he started telling lots of people,"}, {"Time_Start": 158.0, "Time_End": 160.0, "Text": " and people were kind of amused by that."}, {"Time_Start": 160.0, "Time_End": 164.0, "Text": " And it was kind of hard to say whether or not that was an actual death threat from the NSA,"}, {"Time_Start": 164.0, "Time_End": 168.0, "Text": " or whether or not Jim Bidzaz just invented that story for his own personal amusement,"}, {"Time_Start": 168.0, "Time_End": 175.0, "Text": " or for his own personal advantage, or if they were just joking and just like, whatever,"}, {"Time_Start": 175.0, "Time_End": 179.0, "Text": " we're really not going to kill you, you're just a dumbass if you think we're going to kill you kind of thing."}, {"Time_Start": 179.0, "Time_End": 183.0, "Text": " So, that was the Chimidzha story."}, {"Time_Start": 183.0, "Time_End": 194.0, "Text": " So, okay, um, let's see, so I started my company, C2Net in 1994, as an internet service provider,"}, {"Time_Start": 194.0, "Time_End": 195.0, "Text": " or internet privacy company."}, {"Time_Start": 195.0, "Time_End": 202.0, "Text": " So what I was doing then was, was I started the company in 94 because I was living in California,"}, {"Time_Start": 202.0, "Time_End": 206.0, "Text": " I had been living in California for about a year, and I was going to all the cyphopunks meetings,"}, {"Time_Start": 206.0, "Time_End": 208.0, "Text": " and all of these people were saying, oh, we're going to..."}, {"Time_Start": 208.0, "Time_End": 221.0, "Text": " we're going to implement anonymous technology and the government's going to be irrelevant and we're all going to have a lovely anarchy and life will be gray and everything will be hunky and we won't have to pay taxes and it will all be good."}, {"Time_Start": 221.0, "Time_End": 228.0, "Text": " But all of these people are like, okay, this is all going to happen and they said, oh, all this cryptography technology is going to make all this stuff happen."}, {"Time_Start": 228.0, "Time_End": 237.98, "Text": " But they thought that angels from the sky were going to come down and just tap for a magic wand and then all this technology would exist and it would be deployed."}, {"Time_Start": 238.0, "Time_End": 243.0, "Text": " and people would use it and people would make money and they wouldn't have to pay taxes and it would be all good."}, {"Time_Start": 243.0, "Time_End": 246.0, "Text": " But of course, I knew that that was never going to happen."}, {"Time_Start": 246.0, "Time_End": 250.0, "Text": " There are angels who are going to come down from the sky to solve all our problems for us."}, {"Time_Start": 250.0, "Time_End": 256.0, "Text": " So I started my company in 94 to solve those problems, hopefully."}, {"Time_Start": 256.0, "Time_End": 264.0, "Text": " And so that's, so I started out in 94 and it was kind of fun."}, {"Time_Start": 264.0, "Time_End": 267.98, "Text": " We did anonymous web hosting, Anonymous,"}, {"Time_Start": 268.0, "Time_End": 279.0, "Text": " site, anonymous mail, anonymous mail, anonymous web hosting, anonymous pseudonyms."}, {"Time_Start": 279.0, "Time_End": 289.0, "Text": " We did a lot of, the pseudonym stuff is very similar in design to the mail services done by zero knowledge today."}, {"Time_Start": 289.0, "Time_End": 294.0, "Text": " They're actually doing a company which will make some money at it as opposed to my company, which didn't."}, {"Time_Start": 294.0, "Time_End": 297.0, "Text": " But the basic idea is that"}, {"Time_Start": 297.0, "Time_End": 303.0, "Text": " is that your mail gets forwarded to a bunch of different hops so that it can't be traced."}, {"Time_Start": 303.0, "Time_End": 314.0, "Text": " Now, I built this system because the traditional anonymous servers, such as a non.ponnet.fi,"}, {"Time_Start": 314.0, "Time_End": 318.0, "Text": " were built with a very single point of failure in them."}, {"Time_Start": 318.0, "Time_End": 323.0, "Text": " If you hadn't accounted a non.ponnet.fi and say someone like the Scientologists,"}, {"Time_Start": 323.0, "Time_End": 326.98, "Text": " wanted to find out who you were, all they had to do was go to Finland, spend lots of"}, {"Time_Start": 327.0, "Time_End": 331.0, "Text": " and buy them to finish government or whatever you have to do in Finland to get you away."}, {"Time_Start": 331.0, "Time_End": 337.0, "Text": " And then what they end up doing is getting access to your real identity because they use this,"}, {"Time_Start": 337.0, "Time_End": 341.0, "Text": " it's all, all of the actual sensitive information is actually stored in one place,"}, {"Time_Start": 341.0, "Time_End": 345.0, "Text": " and all you have to do is break into the computer or subpoena the computer or whatever"}, {"Time_Start": 345.0, "Time_End": 348.0, "Text": " and you get all the sensitive information, and that's not very safe."}, {"Time_Start": 348.0, "Time_End": 352.0, "Text": " So I set up the system so that even if my server was subpoenaed,"}, {"Time_Start": 352.0, "Time_End": 356.98, "Text": " I wouldn't actually be revealing the real identities of the anonymous"}, {"Time_Start": 357.0, "Time_End": 358.0, "Text": " users."}, {"Time_Start": 358.0, "Time_End": 364.0, "Text": " So I set up the system and people started using it and it was all good."}, {"Time_Start": 364.0, "Time_End": 368.0, "Text": " And people were using the anon.p.net.fi system because it was a lot easier to use."}, {"Time_Start": 368.0, "Time_End": 374.0, "Text": " So my system was being used by the ultra paranoid and the non.p.netfi system was being used by"}, {"Time_Start": 374.0, "Time_End": 376.0, "Text": " the less paranoid."}, {"Time_Start": 376.0, "Time_End": 377.0, "Text": " And so it was all good."}, {"Time_Start": 377.0, "Time_End": 380.0, "Text": " There was a nice marketplace for anybody in the community."}, {"Time_Start": 380.0, "Time_End": 385.0, "Text": " But then the Scientologists actually did spend a lot of money and they went to anon.pon.pon.fi"}, {"Time_Start": 385.0, "Time_End": 392.0, "Text": " and they convinced the Finnish government to, at first they wanted to get the entire database"}, {"Time_Start": 392.0, "Time_End": 396.0, "Text": " of all the anonymous identities mapped to real identities."}, {"Time_Start": 396.0, "Time_End": 399.0, "Text": " And the Finnish government has much stronger protections for privacy than the"}, {"Time_Start": 399.0, "Time_End": 401.0, "Text": " U.S. government has."}, {"Time_Start": 401.0, "Time_End": 406.0, "Text": " So they actually, it was actually very difficult for the Scientologists to get that information."}, {"Time_Start": 406.0, "Time_End": 410.0, "Text": " They had to go to court many times and spend lots of money on legal bills."}, {"Time_Start": 410.0, "Time_End": 414.0, "Text": " I'm sure the Scientologist lawyers were happy with that situation because they made lots of money off the deal."}, {"Time_Start": 414.0, "Time_End": 416.0, "Text": " lots of money off the deal."}, {"Time_Start": 416.0, "Time_End": 418.0, "Text": " But, so it was a lot of work."}, {"Time_Start": 418.0, "Time_End": 421.0, "Text": " In the end, the Finnish government did end up caving,"}, {"Time_Start": 421.0, "Time_End": 425.0, "Text": " but they didn't reveal, they didn't want to give up the entire database."}, {"Time_Start": 425.0, "Time_End": 429.0, "Text": " They said, well, you're only looking for two guys, so we're just going to force"}, {"Time_Start": 429.0, "Time_End": 432.0, "Text": " p.net.fi to reveal the two guys."}, {"Time_Start": 432.0, "Time_End": 439.0, "Text": " So the Finnish government eventually caved in, and Johan was,"}, {"Time_Start": 439.0, "Time_End": 442.0, "Text": " who was running peanut."}, {"Time_Start": 442.0, "Time_End": 445.0, "Text": " NFI was pretty much devastated by this."}, {"Time_Start": 445.0, "Time_End": 451.0, "Text": " He had previously thought that his security model was going to work because the Finnish government"}, {"Time_Start": 451.0, "Time_End": 452.0, "Text": " was on his side."}, {"Time_Start": 452.0, "Time_End": 455.0, "Text": " He later learned, of course, that the Finnish government wasn't on his side."}, {"Time_Start": 455.0, "Time_End": 460.0, "Text": " They only had these laws because there was one level of protection against the attack,"}, {"Time_Start": 460.0, "Time_End": 465.0, "Text": " but of course the Scientologist managed to breach that level of protection, the Finnish"}, {"Time_Start": 465.0, "Time_End": 467.0, "Text": " laws he was relying upon."}, {"Time_Start": 467.0, "Time_End": 471.0, "Text": " So because he was so upset over this, he shut down the Pinet FI server and now no one can use"}, {"Time_Start": 471.0, "Time_End": 473.0, "Text": " and now no one can use the P9FI server."}, {"Time_Start": 473.0, "Time_End": 476.0, "Text": " Because he didn't want to give people a false sense of security."}, {"Time_Start": 476.0, "Time_End": 479.0, "Text": " What I was saying, what I was doing in order to try to market,"}, {"Time_Start": 479.0, "Time_End": 483.0, "Text": " my product was, of course, saying that he was giving people a false sense of security."}, {"Time_Start": 483.0, "Time_End": 486.0, "Text": " But, in fact, as long as it's marketed right,"}, {"Time_Start": 486.0, "Time_End": 490.0, "Text": " it's not a false sense of security, you just know how much security you're getting."}, {"Time_Start": 490.0, "Time_End": 493.0, "Text": " You can either go to P9FI if you want something that's easy to use,"}, {"Time_Start": 493.0, "Time_End": 497.0, "Text": " or you go to my server running at alpha.c2.org"}, {"Time_Start": 497.0, "Time_End": 501.0, "Text": " if you want actual security that can withstand the Scientology"}, {"Time_Start": 501.0, "Time_End": 507.0, "Text": " attack. So we shut down, everyone was upset. There was all sorts of clamor."}, {"Time_Start": 507.0, "Time_End": 511.0, "Text": " No, no, it's being shut down. A Scientologist suck. We should kick their asses, you know, whatever."}, {"Time_Start": 511.0, "Time_End": 516.0, "Text": " Um, you know, eventually got an EFF Pioneer award, which was all good."}, {"Time_Start": 516.0, "Time_End": 518.0, "Text": " We're all very proud of him for that."}, {"Time_Start": 518.0, "Time_End": 526.0, "Text": " And then things eventually slowly died down. My company changed focus, which I'll get to later."}, {"Time_Start": 526.0, "Time_End": 530.98, "Text": " And, but after about three years or so, we were a couple of"}, {"Time_Start": 531.0, "Time_End": 537.0, "Text": " According to Finnish law, after three years, the records for an investigation need to be opened up."}, {"Time_Start": 537.0, "Time_End": 540.0, "Text": " So the Finnish government released the records for the investigation."}, {"Time_Start": 540.0, "Time_End": 547.0, "Text": " And the records included the real identities of the people the Scientologists spent a lot of money trying to get."}, {"Time_Start": 547.0, "Time_End": 554.0, "Text": " And it turns out that the so-called real identities hidden by the Peanut.Fi service were actually pointing at my pseudonymous server,"}, {"Time_Start": 554.0, "Time_End": 558.0, "Text": " which there would have been no way the Scientologists would have gotten with that."}, {"Time_Start": 558.0, "Time_End": 559.0, "Text": " They could have tried to sue me."}, {"Time_Start": 559.0, "Time_End": 561.0, "Text": " They never actually contacted me."}, {"Time_Start": 561.0, "Time_End": 564.1, "Text": " So I figured they knew that they would have had no hope if they tried contacting me."}, {"Time_Start": 564.1, "Time_End": 568.0, "Text": " Because I actually probably wouldn't even need to subpoena at that point."}, {"Time_Start": 568.0, "Time_End": 570.8, "Text": " I was just giving them some cipher text, which they couldn't decrypt."}, {"Time_Start": 570.8, "Time_End": 573.84, "Text": " I probably would have asked for a subpoena because it would have cost them more money,"}, {"Time_Start": 573.84, "Time_End": 575.76, "Text": " and it's always good to make the Scientologists pay."}, {"Time_Start": 575.76, "Time_End": 584.3, "Text": " So that's, so that was pretty cool, because we knew that the Scientologists spent huge amounts of money trying to get that information,"}, {"Time_Start": 584.3, "Time_End": 585.5, "Text": " and then they couldn't get it."}, {"Time_Start": 585.5, "Time_End": 589.5, "Text": " So, and so I'm going to know the Scientology story."}, {"Time_Start": 589.5, "Time_End": 590.5, "Text": " This one's kind of amusing."}, {"Time_Start": 590.5, "Time_End": 594.0, "Text": " It's not really crypto-related, but it's still kind of cool."}, {"Time_Start": 594.0, "Time_End": 599.5, "Text": " A friend of mine was working as a network engineer at Aerials Internet, on the East Coast."}, {"Time_Start": 599.5, "Time_End": 603.5, "Text": " And they had a customer of the Scientologist didn't like."}, {"Time_Start": 603.5, "Time_End": 606.5, "Text": " So they called them up. They called him up."}, {"Time_Start": 606.5, "Time_End": 609.5, "Text": " And he was just the guy who answered the phone at the time, because it's a small company."}, {"Time_Start": 609.5, "Time_End": 615.5, "Text": " You know, they didn't have huge banks of tech support people answering the phone or anything like that back then."}, {"Time_Start": 615.5, "Time_End": 617.5, "Text": " So, in a way, he answers the phone."}, {"Time_Start": 617.5, "Time_End": 620.5, "Text": " He says, you know, they say to the Scientologists are like, oh,"}, {"Time_Start": 620.5, "Time_End": 623.5, "Text": " well, you have to talk to our legal department, and then they go to the legal department."}, {"Time_Start": 623.5, "Time_End": 628.5, "Text": " The Scientologists eventually sue Arles Internet, and they, of course, named my friend as one of the"}, {"Time_Start": 628.5, "Time_End": 631.5, "Text": " plaintiffs in the lawsuit because he picked up the phone."}, {"Time_Start": 631.5, "Time_End": 636.5, "Text": " And so anyway, whatever, they sue Arles, Internet, or the case gets dropped, or whatever,"}, {"Time_Start": 636.5, "Time_End": 638.5, "Text": " they settle out and know exactly what happened."}, {"Time_Start": 638.5, "Time_End": 641.5, "Text": " But then, a few years later, my friend stops working for Oils Internet."}, {"Time_Start": 641.5, "Time_End": 643.5, "Text": " He's working for a company in San Francisco."}, {"Time_Start": 643.5, "Time_End": 648.5, "Text": " He's walking around San Francisco one day, and he sees the Scientology store in San Francisco."}, {"Time_Start": 648.5, "Time_End": 649.5, "Text": " He's like, ha, cool, we're going to go into the Scientology store in San Francisco."}, {"Time_Start": 649.5, "Time_End": 650.5, "Text": " He's like, ha, cool, we're going to go into the Scientology store in San Francisco."}, {"Time_Start": 650.5, "Time_End": 656.5, "Text": " store and see what I can do, like buy Dianetics or something like that."}, {"Time_Start": 656.5, "Time_End": 660.5, "Text": " So he goes into the Scientology store, and this guy, this person at the counter, she looks at him,"}, {"Time_Start": 660.5, "Time_End": 663.5, "Text": " and she's like, hey, aren't she that ISP guy?"}, {"Time_Start": 663.5, "Time_End": 667.5, "Text": " And so then he gets really scared and he turns around and runs away."}, {"Time_Start": 671.5, "Time_End": 680.4, "Text": " Okay, so, so let's see, so I was writing an internet service, and so people would get a"}, {"Time_Start": 680.5, "Time_End": 682.5, "Text": " accounts and all this sort of thing."}, {"Time_Start": 682.5, "Time_End": 689.5, "Text": " And in 1996, I came out with a product called Stronghold, which is a web server based on Apache,"}, {"Time_Start": 689.5, "Time_End": 691.5, "Text": " which adds SSL capabilities."}, {"Time_Start": 691.5, "Time_End": 694.5, "Text": " At the time, the only value was that it added SSL capabilities."}, {"Time_Start": 694.5, "Time_End": 698.5, "Text": " Now, there's like lots of marketing literature about what other value it adds."}, {"Time_Start": 698.5, "Time_End": 702.5, "Text": " But at the time, all we did was adding SSL to Apache."}, {"Time_Start": 702.5, "Time_End": 710.5, "Text": " And so the company, at that point, the company wasn't really making any money off the web post"}, {"Time_Start": 710.5, "Time_End": 713.5, "Text": " and the anonymous mail services and that sort of thing."}, {"Time_Start": 713.5, "Time_End": 714.5, "Text": " I still had a day job."}, {"Time_Start": 714.5, "Time_End": 717.5, "Text": " I was contracting an SGI and all sorts of things."}, {"Time_Start": 717.5, "Time_End": 722.5, "Text": " So I knew that the software business was going to make lots of money"}, {"Time_Start": 722.5, "Time_End": 724.5, "Text": " and the services business wasn't making lots of money."}, {"Time_Start": 724.5, "Time_End": 726.5, "Text": " I would have had to invest heavily into that."}, {"Time_Start": 726.5, "Time_End": 727.5, "Text": " The margins were low."}, {"Time_Start": 727.5, "Time_End": 729.5, "Text": " All sorts of things like that."}, {"Time_Start": 729.5, "Time_End": 731.5, "Text": " So I was migrating off of that."}, {"Time_Start": 731.5, "Time_End": 734.5, "Text": " And then November 1996 rolls around."}, {"Time_Start": 734.5, "Time_End": 737.5, "Text": " And I go to this conference in Florida, whatever."}, {"Time_Start": 737.5, "Time_End": 739.5, "Text": " It was a pretty boring conference."}, {"Time_Start": 739.5, "Time_End": 740.5, "Text": " But by the time I'm done with the conference,"}, {"Time_Start": 740.5, "Time_End": 742.0, "Text": " I had gotten all these business leads."}, {"Time_Start": 742.0, "Time_End": 743.0, "Text": " I was really hyped."}, {"Time_Start": 743.0, "Time_End": 744.5, "Text": " I was really psyched about doing business."}, {"Time_Start": 744.5, "Time_End": 746.5, "Text": " I had set up, by that point,"}, {"Time_Start": 746.5, "Time_End": 748.5, "Text": " offshore development centers all over the world."}, {"Time_Start": 748.5, "Time_End": 750.5, "Text": " And I was thinking, well,"}, {"Time_Start": 750.5, "Time_End": 752.5, "Text": " what could the NSA do to shut me down?"}, {"Time_Start": 752.5, "Time_End": 755.5, "Text": " And I realized that since I was still doing web posting,"}, {"Time_Start": 755.5, "Time_End": 758.5, "Text": " they could just plant some child porn on my site"}, {"Time_Start": 758.5, "Time_End": 760.5, "Text": " and, you know, go after me for child porn,"}, {"Time_Start": 760.5, "Time_End": 762.5, "Text": " and that would suck."}, {"Time_Start": 762.5, "Time_End": 764.5, "Text": " So I'm thinking, okay, I really need to finish"}, {"Time_Start": 764.5, "Time_End": 766.5, "Text": " that whole migration away from web hosting"}, {"Time_Start": 766.5, "Time_End": 768.5, "Text": " because that's sort of a liability."}, {"Time_Start": 768.5, "Time_End": 770.5, "Text": " And then I guess I guess"}, {"Time_Start": 770.5, "Time_End": 774.5, "Text": " home, I'm in the office on Monday,"}, {"Time_Start": 774.5, "Time_End": 777.5, "Text": " and we just moved into a new office,"}, {"Time_Start": 777.5, "Time_End": 779.5, "Text": " and so the office is all still in shambles"}, {"Time_Start": 779.5, "Time_End": 782.5, "Text": " and I'm putting together my desk and all of this."}, {"Time_Start": 782.5, "Time_End": 784.5, "Text": " And some guy walks in, he has me a chief of papers,"}, {"Time_Start": 784.5, "Time_End": 786.5, "Text": " and he says, you are served."}, {"Time_Start": 786.5, "Time_End": 788.5, "Text": " I'm like, hmm, what's this?"}, {"Time_Start": 788.5, "Time_End": 791.5, "Text": " And it turns out that we had been sued"}, {"Time_Start": 791.5, "Time_End": 793.5, "Text": " for contributory copyright infringement"}, {"Time_Start": 793.5, "Time_End": 796.5, "Text": " by Adobe Traveling Software"}, {"Time_Start": 796.5, "Time_End": 799.5, "Text": " and one other company, whose name,"}, {"Time_Start": 799.5, "Time_End": 801.5, "Text": " whose name escapes me."}, {"Time_Start": 801.5, "Time_End": 805.5, "Text": " But, anyway, they sued me and my company"}, {"Time_Start": 805.5, "Time_End": 807.5, "Text": " for contributory copyright infringement,"}, {"Time_Start": 807.5, "Time_End": 809.5, "Text": " which is, not child porn,"}, {"Time_Start": 809.5, "Time_End": 812.5, "Text": " but it was based on the fact that we had some customers"}, {"Time_Start": 812.5, "Time_End": 815.5, "Text": " hosting web pages on our site"}, {"Time_Start": 815.5, "Time_End": 819.5, "Text": " that had allegedly material which the SPA,"}, {"Time_Start": 819.5, "Time_End": 821.5, "Text": " the Software Publishers Association,"}, {"Time_Start": 821.5, "Time_End": 824.5, "Text": " considered to be contributory copyright infringement."}, {"Time_Start": 824.5, "Time_End": 827.5, "Text": " So those three things were"}, {"Time_Start": 827.5, "Time_End": 829.5, "Text": " serial numbers for what,"}, {"Time_Start": 829.5, "Time_End": 832.5, "Text": " was information about how to get, how to crack,"}, {"Time_Start": 832.5, "Time_End": 836.5, "Text": " copy protection, and links to sites which host wares."}, {"Time_Start": 836.5, "Time_End": 839.5, "Text": " They didn't actually claim that we had any wares on our site."}, {"Time_Start": 839.5, "Time_End": 843.5, "Text": " They only claimed that we had links and information."}, {"Time_Start": 843.5, "Time_End": 847.5, "Text": " So, and of course, the reason they had sued me,"}, {"Time_Start": 847.5, "Time_End": 852.5, "Text": " which I later learned, is that a few months prior to this,"}, {"Time_Start": 852.5, "Time_End": 856.5, "Text": " they had sent out an email to a large number of internet providers"}, {"Time_Start": 856.5, "Time_End": 859.5, "Text": " who apparently they knew had some sort of"}, {"Time_Start": 859.5, "Time_End": 862.5, "Text": " wares or links to wares or whatever on their site."}, {"Time_Start": 862.5, "Time_End": 863.5, "Text": " And the email basically said,"}, {"Time_Start": 863.5, "Time_End": 866.5, "Text": " please give us a call and we will sue you."}, {"Time_Start": 866.5, "Time_End": 868.5, "Text": " So I never got that email apparently."}, {"Time_Start": 868.5, "Time_End": 870.5, "Text": " My mail server was flaky or whatever."}, {"Time_Start": 870.5, "Time_End": 872.5, "Text": " I don't know what was going on."}, {"Time_Start": 872.5, "Time_End": 875.5, "Text": " But anyway, all the ISPSA did get that email."}, {"Time_Start": 875.5, "Time_End": 879.5, "Text": " They all called up the SPA, and then the SPA's response was,"}, {"Time_Start": 879.5, "Time_End": 882.5, "Text": " sign this code of conduct and we won't sue you."}, {"Time_Start": 882.5, "Time_End": 886.5, "Text": " And this code of conduct, the SPA wanted people to sign"}, {"Time_Start": 886.5, "Time_End": 887.5, "Text": " was pretty heinous."}, {"Time_Start": 887.5, "Time_End": 889.5, "Text": " And basically would have required"}, {"Time_Start": 889.5, "Time_End": 894.5, "Text": " that the internet providers monitor everything every one of their users did."}, {"Time_Start": 894.5, "Time_End": 901.5, "Text": " And at that point, the various lawsuits had been resolved,"}, {"Time_Start": 901.5, "Time_End": 908.5, "Text": " which showed that an ISPs not liable as long as they don't monitor and moderate their traffic."}, {"Time_Start": 908.5, "Time_End": 913.5, "Text": " So by monitoring traffic and agreeing to this code of conduct liable,"}, {"Time_Start": 913.5, "Time_End": 917.5, "Text": " ISPs were actually signing up for more liability than they had in the first place."}, {"Time_Start": 917.5, "Time_End": 918.5, "Text": " So, people were actually signing up for more liability than they had in the first place."}, {"Time_Start": 918.5, "Time_End": 919.5, "Text": " So, people,"}, {"Time_Start": 919.5, "Time_End": 925.5, "Text": " Actually, most of the providers who received that comment from the SPA,"}, {"Time_Start": 925.5, "Time_End": 928.5, "Text": " please sign this code of conduct and we won't sue you,"}, {"Time_Start": 928.5, "Time_End": 932.5, "Text": " did decide to sign the code of conduct because they were afraid of the SPA."}, {"Time_Start": 932.5, "Time_End": 935.5, "Text": " Two providers, GeoCities and Tripod, didn't sign."}, {"Time_Start": 935.5, "Time_End": 938.5, "Text": " They were like, this is bogus, we're not going to sign this."}, {"Time_Start": 938.5, "Time_End": 940.5, "Text": " And so they didn't sign."}, {"Time_Start": 940.5, "Time_End": 945.5, "Text": " And I, of course, didn't sign because I had no clue that they wanted to sign this stupid code of conduct."}, {"Time_Start": 945.5, "Time_End": 948.5, "Text": " So Geocities, Tripod, and C2Net all received this"}, {"Time_Start": 948.5, "Time_End": 955.5, "Text": " lawsuit. And it was very clear from their announcements, from their tactics, that the lawsuit"}, {"Time_Start": 955.5, "Time_End": 964.5, "Text": " was not meant in any way to actually go to court or actually be concerned with the fact that"}, {"Time_Start": 964.5, "Time_End": 968.5, "Text": " we allegedly had contributory copyright material on our sites."}, {"Time_Start": 968.5, "Time_End": 973.5, "Text": " They just sued because they wanted us to settle, sign the code of conduct, and then they would drop"}, {"Time_Start": 973.5, "Time_End": 974.5, "Text": " the lawsuit."}, {"Time_Start": 974.5, "Time_End": 978.0, "Text": " And so they dropped the lawsuit on GeoCities and Tripod."}, {"Time_Start": 978.0, "Time_End": 981.0, "Text": " And GeoCities and Tripod both decided to settle."}, {"Time_Start": 981.0, "Time_End": 987.0, "Text": " They were in the course of negotiating with investors and things along those lines,"}, {"Time_Start": 987.0, "Time_End": 991.0, "Text": " and they didn't want the investors to be afraid of the lawsuit and all that sort of thing."}, {"Time_Start": 991.0, "Time_End": 999.0, "Text": " And so they negotiated with the SPA and settled by signing a code of conduct, which actually wasn't heinous."}, {"Time_Start": 999.0, "Time_End": 1002.0, "Text": " So they did settle, which I think was kind of lame."}, {"Time_Start": 1002.0, "Time_End": 1007.0, "Text": " But they didn't actually sign a code of conduct which actually restricted them in a code of conduct,"}, {"Time_Start": 1007.0, "Time_End": 1011.0, "Text": " them in any way. The code of conduct basically said we were there the law."}, {"Time_Start": 1011.0, "Time_End": 1017.0, "Text": " Well, duh. So it wasn't anything new. But I was kind of frustrated that they did settle because,"}, {"Time_Start": 1017.0, "Time_End": 1021.0, "Text": " of course, the SPA could then claim the victory. I, of course, didn't settle."}, {"Time_Start": 1021.0, "Time_End": 1023.0, "Text": " The S..."}, {"Time_Start": 1023.0, "Time_End": 1029.0, "Text": " I called out my friend that got out at the F.F.F.F. And it's like, help, what do I do?"}, {"Time_Start": 1029.0, "Time_End": 1032.0, "Text": " And so he referred me to a very good attorney in San Francisco."}, {"Time_Start": 1032.0, "Time_End": 1036.0, "Text": " And we told the SPA that they were smoking crack."}, {"Time_Start": 1036.0, "Time_End": 1043.0, "Text": " crack. At first, they wouldn't even tell us which ones of our customers had the"}, {"Time_Start": 1043.0, "Time_End": 1050.84, "Text": " allegedly contributory copyright material. So, well, the first thing is that what they claimed"}, {"Time_Start": 1050.84, "Time_End": 1055.14, "Text": " was contributory copyright was, in fact, protected speech. So if they wanted to take this to court,"}, {"Time_Start": 1055.34, "Time_End": 1059.28, "Text": " and if we did in fact have what they claimed was on to say, we would have taken it to court"}, {"Time_Start": 1059.28, "Time_End": 1064.76, "Text": " and we would have won. But, and they probably knew this. But, of course, they weren't interested"}, {"Time_Start": 1064.76, "Time_End": 1065.98, "Text": " in going to court. They were just into court. They were just into court."}, {"Time_Start": 1066.0, "Time_End": 1071.0, "Text": " in getting some press and having a bunch of people signed their stupid little code of conduct."}, {"Time_Start": 1071.0, "Time_End": 1080.0, "Text": " So we, so it wasn't actually the SPA that sued us, of course, because the SPA itself is just a trade organization that has no standing."}, {"Time_Start": 1080.0, "Time_End": 1086.0, "Text": " What the SPA does is they have a bunch of member organizations,"}, {"Time_Start": 1086.0, "Time_End": 1094.0, "Text": " and many of their member organizations sign over power of attorney to the SPA so that the SPA can sue other people on their behalf."}, {"Time_Start": 1094.0, "Time_End": 1095.0, "Text": " So the fact was, they do it be able to the SPA."}, {"Time_Start": 1095.0, "Time_End": 1098.68, "Text": " And the fact was, Adobe and Traveling Software didn't even know that they had sued me."}, {"Time_Start": 1099.44, "Time_End": 1103.6, "Text": " So we called up Adobe and were like, why are you suing us? This is so anti-internet."}, {"Time_Start": 1103.68, "Time_End": 1107.02, "Text": " And Adobe was all into this web publishing thing. So like, we're not anti-internet."}, {"Time_Start": 1107.08, "Time_End": 1110.6, "Text": " We didn't know about this lawsuit. We avow all knowledge of this lawsuit."}, {"Time_Start": 1111.36, "Time_End": 1114.18, "Text": " The SPA sucks. They didn't say that, you know, but."}, {"Time_Start": 1116.34, "Time_End": 1123.1, "Text": " And we didn't actually get significant contacts at Traveling Software or the third company, which name, I don't recall."}, {"Time_Start": 1123.1000000000001, "Time_End": 1127.88, "Text": " Well, actually, they misspelled traveling software's name in the lawsuit, which I thought was pretty funny."}, {"Time_Start": 1130.88, "Time_End": 1136.5600000000002, "Text": " So we didn't even know which one of our customers had the allegedly contributory copyright material on the site."}, {"Time_Start": 1136.8000000000002, "Time_End": 1144.4, "Text": " So my attorney calls them up and he's like, well, you know, you claim that they got contributory copyright infringement material on the site."}, {"Time_Start": 1144.8200000000002, "Time_End": 1152.4, "Text": " Why don't we tell us which customers, but at first they alleged that I and my company were actually engaged in contributory copyright infringement."}, {"Time_Start": 1152.4, "Time_End": 1154.4, "Text": " because that's actually what the lawsuit said."}, {"Time_Start": 1154.46, "Time_End": 1160.24, "Text": " It didn't say that I was liable for the acts of my customers, which they implied, which they meant to say,"}, {"Time_Start": 1160.3600000000001, "Time_End": 1163.3400000000001, "Text": " but they actually said I was doing contributory copyright infringement."}, {"Time_Start": 1163.96, "Time_End": 1174.3200000000002, "Text": " So anyway, I'm very, I actually gave him a call and said, well, which one of these customers are doing the contributory copyright infringement?"}, {"Time_Start": 1174.68, "Time_End": 1180.3600000000001, "Text": " And the person, the attorney who actually sued me on this case was like, hmm, I don't know."}, {"Time_Start": 1180.5, "Time_End": 1181.74, "Text": " Let me get back to you on that."}, {"Time_Start": 1182.4, "Time_End": 1187.5, "Text": " So, after much harassment, they eventually told us who it was."}, {"Time_Start": 1187.5600000000002, "Time_End": 1189.5800000000002, "Text": " There were these two random customers of ours."}, {"Time_Start": 1190.5800000000002, "Time_End": 1193.4, "Text": " And so then I went to go look at their website."}, {"Time_Start": 1193.72, "Time_End": 1197.3200000000002, "Text": " And all I found on those websites was the alt-biner is where's FAQ."}, {"Time_Start": 1198.22, "Time_End": 1200.14, "Text": " And so that was clearly protected speech."}, {"Time_Start": 1200.14, "Time_End": 1202.76, "Text": " So we told them, you guys are on crack."}, {"Time_Start": 1202.8600000000001, "Time_End": 1204.0600000000002, "Text": " This is all protected speech."}, {"Time_Start": 1205.0800000000002, "Time_End": 1206.8200000000002, "Text": " You guys need to drop the lawsuit."}, {"Time_Start": 1207.7, "Time_End": 1212.38, "Text": " And then it was about, they'd say,"}, {"Time_Start": 1212.4, "Time_End": 1219.64, "Text": " They filed for the lawsuit and served notice to me on one day, and I believe we had 21 days to file a response."}, {"Time_Start": 1220.0400000000002, "Time_End": 1224.2800000000002, "Text": " And, of course, filing a response would have been pretty expensive, and I didn't want to spend the money,"}, {"Time_Start": 1224.4, "Time_End": 1227.38, "Text": " so I didn't actually tell our attorney to actually start writing the response."}, {"Time_Start": 1227.74, "Time_End": 1230.6200000000001, "Text": " So it was about five days before we had to file the response."}, {"Time_Start": 1231.8000000000002, "Time_End": 1235.38, "Text": " And an attorney was just telling them, well, you know, you guys really need to drop the lawsuit,"}, {"Time_Start": 1235.5400000000002, "Time_End": 1240.7800000000002, "Text": " because if I start working on following the response, and then we countersuit, you guys are going to be liable for my legal fees,"}, {"Time_Start": 1240.8400000000001, "Time_End": 1241.8200000000002, "Text": " and it's not going to be cheap."}, {"Time_Start": 1242.4, "Time_End": 1249.76, "Text": " So they dropped the lawsuit, but they dropped the lawsuit without prejudice,"}, {"Time_Start": 1249.94, "Time_End": 1252.5, "Text": " which basically means that they reserved the right to file it again."}, {"Time_Start": 1252.5, "Time_End": 1259.0, "Text": " They claimed that they dropped the lawsuit because there was confusion over whether or not I had received that initial email."}, {"Time_Start": 1260.38, "Time_End": 1263.5400000000002, "Text": " Not because they had no case and they were total dumbasses."}, {"Time_Start": 1264.26, "Time_End": 1269.0800000000002, "Text": " But they claimed that, okay, we're dropping this lawsuit is a good faith measure,"}, {"Time_Start": 1269.5800000000002, "Time_End": 1271.94, "Text": " but we still want you to sign the code of conduct."}, {"Time_Start": 1272.4, "Time_End": 1275.14, "Text": " If you don't sign a kind of conduct, we might file the lawsuit again."}, {"Time_Start": 1276.2, "Time_End": 1281.7800000000002, "Text": " And I told them that they needed to apologize and recover my legal fees before I would even answer their telephone calls."}, {"Time_Start": 1283.0400000000002, "Time_End": 1284.74, "Text": " And they didn't apologize."}, {"Time_Start": 1284.94, "Time_End": 1286.44, "Text": " They didn't give me my legal fees back."}, {"Time_Start": 1286.5, "Time_End": 1288.88, "Text": " And, of course, they didn't sue me again because they had no case."}, {"Time_Start": 1290.6200000000001, "Time_End": 1300.02, "Text": " So it turned out, after this lovely adventure, I learned that of all of the SPA members,"}, {"Time_Start": 1300.02, "Time_End": 1302.38, "Text": " the only three SPA members that had given them,"}, {"Time_Start": 1302.4, "Time_End": 1305.8400000000001, "Text": " the SPA power of attorney were those three companies that had sued me."}, {"Time_Start": 1306.4, "Time_End": 1309.4, "Text": " So I'm not into the details of the SPA, but..."}, {"Time_Start": 1309.4, "Time_End": 1311.4, "Text": " So they didn't."}, {"Time_Start": 1311.4, "Time_End": 1312.4, "Text": " No, they didn't."}, {"Time_Start": 1312.4, "Time_End": 1315.4, "Text": " They didn't apologize and they didn't give me any money."}, {"Time_Start": 1315.4, "Time_End": 1319.4, "Text": " I would have preferred if I had to pick one or the other, the apology or the money,"}, {"Time_Start": 1319.4, "Time_End": 1321.4, "Text": " I would have picked the apology because it wasn't a whole lot of money,"}, {"Time_Start": 1321.4, "Time_End": 1324.4, "Text": " and I got a lot of press out of it, so I thought it was cool."}, {"Time_Start": 1324.4, "Time_End": 1328.4, "Text": " But I really thought that if, because they didn't apologize,"}, {"Time_Start": 1328.4, "Time_End": 1332.4, "Text": " that other Internet providers were at risk,"}, {"Time_Start": 1332.4, "Time_End": 1334.4, "Text": " of them doing the same thing to them."}, {"Time_Start": 1334.4, "Time_End": 1337.4, "Text": " And that was just clearly a bad situation."}, {"Time_Start": 1337.4, "Time_End": 1341.4, "Text": " So if they apologized and acknowledged the fact that what they did was wrong,"}, {"Time_Start": 1341.4, "Time_End": 1344.4, "Text": " that they sued me just because they wanted me to sign a code of conduct,"}, {"Time_Start": 1344.4, "Time_End": 1346.4, "Text": " and it was just a total bullying tactic,"}, {"Time_Start": 1346.4, "Time_End": 1349.4, "Text": " then I thought, okay, these people maybe are seeing the light of day"}, {"Time_Start": 1349.4, "Time_End": 1351.4, "Text": " and I'll talk to them on a reasonable basis as a human to a human,"}, {"Time_Start": 1351.4, "Time_End": 1356.4, "Text": " as opposed to treating them like the scum they are."}, {"Time_Start": 1356.4, "Time_End": 1361.4, "Text": " So, anyway, that was the, uh..."}, {"Time_Start": 1361.4, "Time_End": 1362.4, "Text": " So I read away into the..."}, {"Time_Start": 1362.4, "Time_End": 1368.4, "Text": " only three companies that at that point had given the SPA power of attorney to sue were those three companies."}, {"Time_Start": 1368.4, "Time_End": 1375.4, "Text": " So I guess they're sort of losing respectability within their customer base, which is a good thing."}, {"Time_Start": 1375.4, "Time_End": 1379.4, "Text": " Because, of course, software piracy isn't such a good thing."}, {"Time_Start": 1379.4, "Time_End": 1383.4, "Text": " I've made a significant amount of money selling software and I don't like my software pirates."}, {"Time_Start": 1383.4, "Time_End": 1391.4, "Text": " So the SPA, not being the organization to protect against privacy is a good..."}, {"Time_Start": 1391.4, "Time_End": 1399.4, "Text": " piracy is a good thing. It was kind of losing because I was a privacy company, so I'd always say piracy, but I'd say privacy by mistake."}, {"Time_Start": 1399.4, "Time_End": 1405.4, "Text": " It would be all very confusing. So, anyway, that's the SPA story."}, {"Time_Start": 1405.4, "Time_End": 1408.4, "Text": " Um, let's see, more stories."}, {"Time_Start": 1408.4, "Time_End": 1412.4, "Text": " What's the Fourth of July story?"}, {"Time_Start": 1412.4, "Time_End": 1416.4, "Text": " Oh yeah, okay, I'll tell that story. That story's kind of fun."}, {"Time_Start": 1416.4, "Time_End": 1420.4, "Text": " So anyway, so I'm, um..."}, {"Time_Start": 1421.4, "Time_End": 1430.4, "Text": " This is 1997, and I'll tell the earlier 97 media story first, because it's kind of funny."}, {"Time_Start": 1430.4, "Time_End": 1437.4, "Text": " So in May 96, in early 97, I and a bunch of friends and a bunch of people from Situ,"}, {"Time_Start": 1437.4, "Time_End": 1444.4, "Text": " and we would always go to a breakfast brunch at the Thai Temple in Berkeley every Sunday morning."}, {"Time_Start": 1444.4, "Time_End": 1450.4, "Text": " So we were at, I was there, and one day a bunch of new people who I'd never met before from Japan were there,"}, {"Time_Start": 1450.4, "Time_End": 1464.4, "Text": " Japan were there and they were all chatting and they were apparently from the press and they were doing a what a documentary on cryptography."}, {"Time_Start": 1464.4, "Time_End": 1468.4, "Text": " So I was like, okay, cool, I got their name and all of this stuff."}, {"Time_Start": 1468.4, "Time_End": 1473.4, "Text": " And then they went back to Japan, did some more research, came back, and then they decided they wanted to cover C2Net and PGP."}, {"Time_Start": 1473.4, "Time_End": 1478.4, "Text": " So they allocated two weeks to cover PGP and two weeks to cover C2Net."}, {"Time_Start": 1478.4, "Time_End": 1479.4, "Text": " And the first two weeks they allocated was the first two weeks they allocated."}, {"Time_Start": 1479.4, "Time_End": 1484.4, "Text": " allocated was the first two weeks of February, and that was PGP, so they covered PGP during that time."}, {"Time_Start": 1484.4, "Time_End": 1494.4, "Text": " And then the second two weeks was the, um, was they were covering C-Tuna."}, {"Time_Start": 1494.4, "Time_End": 1500.4, "Text": " But we told them, well, if you're covering us, that's not going to work so well, because the first week is fine,"}, {"Time_Start": 1500.4, "Time_End": 1503.4, "Text": " because we're going to be in the office and you can film us and whatever, we can take interviews and all this,"}, {"Time_Start": 1503.4, "Time_End": 1507.4, "Text": " but the next week we're going to a conference in Anguola."}, {"Time_Start": 1507.4, "Time_End": 1511.4, "Text": " Anguilla is a small island, three miles from St. Iron in the Eastern Caribbean."}, {"Time_Start": 1511.4, "Time_End": 1513.4, "Text": " It takes 15 hours to get there."}, {"Time_Start": 1513.4, "Time_End": 1515.4, "Text": " We have to take a small little plane to get there."}, {"Time_Start": 1515.4, "Time_End": 1518.4, "Text": " There's only about 8,000 people who live there. They have no taxes."}, {"Time_Start": 1518.4, "Time_End": 1520.4, "Text": " We were going to a conference there."}, {"Time_Start": 1520.4, "Time_End": 1523.4, "Text": " And so they told them, well, you know, it would be great if you film this and all,"}, {"Time_Start": 1523.4, "Time_End": 1525.4, "Text": " but we're going to this conference."}, {"Time_Start": 1525.4, "Time_End": 1527.4, "Text": " So they call back to the home office."}, {"Time_Start": 1527.4, "Time_End": 1529.4, "Text": " They're like, can we go to Angola?"}, {"Time_Start": 1529.4, "Time_End": 1530.4, "Text": " The home office is yes."}, {"Time_Start": 1530.4, "Time_End": 1534.4, "Text": " So they fly to Anguilla before we do."}, {"Time_Start": 1534.4, "Time_End": 1536.4, "Text": " But I didn't know this."}, {"Time_Start": 1536.4, "Time_End": 1537.4, "Text": " But I didn't know this."}, {"Time_Start": 1537.4, "Time_End": 1541.4, "Text": " I just thought, okay, they're back in the hotel, they'll be in Anguola, they'll be filming us."}, {"Time_Start": 1541.4, "Time_End": 1542.4, "Text": " It would be all good."}, {"Time_Start": 1542.4, "Time_End": 1545.4, "Text": " So we're getting off the plane in Anguola."}, {"Time_Start": 1545.4, "Time_End": 1548.4, "Text": " It's, you know, a small little plane, so we have to climb down the stairs under the tarmac."}, {"Time_Start": 1548.4, "Time_End": 1553.4, "Text": " I look out at the terminal and there's this really bright light flashing in my face."}, {"Time_Start": 1553.4, "Time_End": 1555.4, "Text": " I'm like, what's that? Oh, it's a camera."}, {"Time_Start": 1555.4, "Time_End": 1557.4, "Text": " Oh, that's the NHK guys!"}, {"Time_Start": 1557.4, "Time_End": 1561.4, "Text": " So we were filmed walking off the plane in total of crypto rock star experience."}, {"Time_Start": 1561.4, "Time_End": 1564.4, "Text": " And so that was a lot of fun."}, {"Time_Start": 1564.4, "Time_End": 1567.4, "Text": " And so then we were hanging out with us for over the course of the"}, {"Time_Start": 1567.4, "Time_End": 1572.6000000000001, "Text": " the next week, filming us in Anguilla, and it was really cool. I was interviewed while sitting on a porch"}, {"Time_Start": 1572.6000000000001, "Time_End": 1579.44, "Text": " with St. Ma in the back, and my hair was blowing, and it was just the total lush crypto"}, {"Time_Start": 1579.44, "Time_End": 1588.0400000000002, "Text": " interview. And they showed that eventually on Japanese television, the national, like, PBS equivalent"}, {"Time_Start": 1588.0400000000002, "Time_End": 1594.26, "Text": " in Japan. So, more later on in a new year, we were continuing to do public relations and"}, {"Time_Start": 1594.26, "Time_End": 1597.38, "Text": " and big press. And there's this guy from Forbes, who will have"}, {"Time_Start": 1597.4, "Time_End": 1601.74, "Text": " first was supposed to be doing an article, Electronic Commerce, and Visa, and SET, and all of this."}, {"Time_Start": 1602.2800000000002, "Time_End": 1604.8600000000001, "Text": " So he started talking to a bunch of people in the crypto community."}, {"Time_Start": 1605.3000000000002, "Time_End": 1609.3600000000001, "Text": " And he realized after talking to a bunch of people in the crypto community, that SET and Visa and"}, {"Time_Start": 1609.3600000000001, "Time_End": 1611.0, "Text": " and Electronic Commerce are all really boring."}, {"Time_Start": 1611.1200000000001, "Time_End": 1613.16, "Text": " And the really interesting thing is tax evasion."}, {"Time_Start": 1613.76, "Time_End": 1614.8000000000002, "Text": " Tax avoidance, sorry."}, {"Time_Start": 1615.8400000000001, "Time_End": 1620.3600000000001, "Text": " So he's like, I'm going to talk to all these cypherpunks who are really interested in tax avoidance."}, {"Time_Start": 1620.8000000000002, "Time_End": 1625.3400000000001, "Text": " And by that point, I had grown old than jaded, and I wasn't really interested in tax avoidance."}, {"Time_Start": 1625.3400000000001, "Time_End": 1626.68, "Text": " I just wanted to make lots of money."}, {"Time_Start": 1627.4, "Time_End": 1632.02, "Text": " But he wanted to do an article on tax avoidance."}, {"Time_Start": 1632.66, "Time_End": 1637.92, "Text": " So, but of course, I was still an article just a little bit of terror, and I just realized that there was no way I was ever going to win."}, {"Time_Start": 1640.0600000000002, "Time_End": 1644.0800000000002, "Text": " So anyway, he talked to a bunch of people in the crypto community and they're like, oh, you should talk to Samoa."}, {"Time_Start": 1644.18, "Time_End": 1645.68, "Text": " So he was like, okay, he comes and talks to me."}, {"Time_Start": 1645.7, "Time_End": 1648.72, "Text": " So he talks to me on Friday, July 3rd at the office."}, {"Time_Start": 1649.64, "Time_End": 1652.0600000000002, "Text": " And we chat, and we have a good time."}, {"Time_Start": 1652.14, "Time_End": 1656.5, "Text": " We talk for like two, three hours or something like that, and it's time to go home because I have a meeting or whatever."}, {"Time_Start": 1657.4, "Time_End": 1660.44, "Text": " And so he was like, oh, I still need to talk to some more."}, {"Time_Start": 1660.48, "Time_End": 1661.18, "Text": " Can we talk tomorrow?"}, {"Time_Start": 1661.3000000000002, "Time_End": 1663.1000000000001, "Text": " So we get together in a cafe in Berkeley."}, {"Time_Start": 1663.96, "Time_End": 1666.76, "Text": " And so I'm thinking, so July 4th, cool, it's a holiday."}, {"Time_Start": 1667.3600000000001, "Time_End": 1672.64, "Text": " So anyway, so we go, we meet in this cafe, and we're sitting down and like, oh, I like this holiday."}, {"Time_Start": 1672.9, "Time_End": 1674.46, "Text": " You get to celebrate over there in the government."}, {"Time_Start": 1675.5, "Time_End": 1676.8200000000002, "Text": " And I thought, okay."}, {"Time_Start": 1677.02, "Time_End": 1678.8200000000002, "Text": " So he interviewed me and it was all good."}, {"Time_Start": 1678.8200000000002, "Time_End": 1687.38, "Text": " And then a few weeks later, actually a few weeks later, a photographer came and he, he, you"}, {"Time_Start": 1687.4, "Time_End": 1690.9, "Text": " took my picture, he took pictures of other cypherpunks, and, you know, it was all good."}, {"Time_Start": 1692.64, "Time_End": 1699.1000000000001, "Text": " And then I got an email from him sometime in early September or late August, saying the final"}, {"Time_Start": 1699.1000000000001, "Time_End": 1704.94, "Text": " issues of the magazine, the first pressing is off the press or whatever. I'm sending it to you"}, {"Time_Start": 1704.94, "Time_End": 1709.5800000000002, "Text": " by next day now. I think he'll get a kick out of it. So he sent it to me on Friday. I was"}, {"Time_Start": 1709.5800000000002, "Time_End": 1712.8600000000001, "Text": " actually in the office on Saturday because I was working on some web pages or whatever."}, {"Time_Start": 1713.5400000000002, "Time_End": 1717.14, "Text": " And I show up with the office. One of my coworkers had already been there."}, {"Time_Start": 1717.4, "Time_End": 1724.0400000000002, "Text": " And then he throws this magazine on my desk, which has this picture of me on it, and it says,"}, {"Time_Start": 1724.1000000000001, "Time_End": 1725.76, "Text": " this guy wants to overthrow the government."}, {"Time_Start": 1728.46, "Time_End": 1731.5400000000002, "Text": " So, I'm thinking, wow, that's wild."}, {"Time_Start": 1733.1200000000001, "Time_End": 1735.3600000000001, "Text": " So I open up the magazine, like, oh, what is the article?"}, {"Time_Start": 1735.5, "Time_End": 1736.18, "Text": " This is really weird."}, {"Time_Start": 1736.5400000000002, "Time_End": 1740.68, "Text": " And I look at the article, and it starts out saying, I like this holiday."}, {"Time_Start": 1741.22, "Time_End": 1743.16, "Text": " You get to celebrate overthrowing the government."}, {"Time_Start": 1744.8600000000001, "Time_End": 1746.16, "Text": " And so that was pretty cool."}, {"Time_Start": 1747.4, "Time_End": 1753.4, "Text": " And the article was just an excellent article. It talked about how tax avoidance was the"}, {"Time_Start": 1753.4, "Time_End": 1760.4, "Text": " patriotic thing to do and all sorts of things like that. It had a really good page layout"}, {"Time_Start": 1760.4, "Time_End": 1766.2, "Text": " system because every spread, on the left there'd be a picture of a cipherpunk who talked about"}, {"Time_Start": 1766.2, "Time_End": 1770.4, "Text": " how tax avoidance was a good thing. And on the right, there was a picture of some big-wig banker"}, {"Time_Start": 1770.4, "Time_End": 1776.3000000000002, "Text": " like the head of Citibank talking about how tax avoidance was a good thing. So it was a really balanced"}, {"Time_Start": 1776.3000000000002, "Time_End": 1776.9, "Text": " perspective."}, {"Time_Start": 1776.9, "Time_End": 1782.96, "Text": " You've got the radical and wackos like us, and then you've got, you know, the straight conservative people who are all into it as well."}, {"Time_Start": 1784.14, "Time_End": 1786.74, "Text": " So it was a pretty good article."}, {"Time_Start": 1786.88, "Time_End": 1787.5600000000002, "Text": " I had a lot of fun."}, {"Time_Start": 1788.46, "Time_End": 1789.72, "Text": " Everyone made a lot of fun."}, {"Time_Start": 1789.8400000000001, "Time_End": 1791.5600000000002, "Text": " Oh, it looks like I'm out of time."}, {"Time_Start": 1792.46, "Time_End": 1794.22, "Text": " So, thank you."}]}