{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome to the annual DEF CON convention. This meeting was held in exciting Las Vegas,"
    },
    {
      "Time_Start": 7.0,
      "Time_End": 14.0,
      "Text": " Nevada from July 9th through the 11th, 1999. This is videotape number 41."
    },
    {
      "Time_Start": 14.0,
      "Time_End": 21.0,
      "Text": " No applause. Hands up who was drinking late last night. Yeah, don't applaud. Hands up"
    },
    {
      "Time_Start": 35.64,
      "Time_End": 42.64,
      "Text": " who was drinking late last night. Who was drinking CON sunup?"
    },
    {
      "Time_Start": 45.0,
      "Time_End": 51.0,
      "Text": " Sorry, the pebbles are appearing on a Hacker Jeopardy team, even though I'm losing one."
    },
    {
      "Time_Start": 51.0,
      "Time_End": 56.0,
      "Text": " So, in case you're wondering why I'm wearing the sun specs, it's not really because of"
    },
    {
      "Time_Start": 56.0,
      "Time_End": 61.0,
      "Text": " the fact that I want to look cool, it's more because of the fact that, well, it's a bit"
    },
    {
      "Time_Start": 61.0,
      "Time_End": 65.0,
      "Text": " bright in here, is the polite way of putting it."
    },
    {
      "Time_Start": 65.0,
      "Time_End": 72.0,
      "Text": " Well, and also welcome to this talk, which I have come to term the cursed talk recently."
    },
    {
      "Time_Start": 75.0,
      "Time_End": 82.0,
      "Text": " And it's struck again, this time with the projection system."
    },
    {
      "Time_Start": 85.0,
      "Time_End": 93.0,
      "Text": " Hands up who can see what's on the screen on the palm top on the desk in front here."
    },
    {
      "Time_Start": 95.0,
      "Time_End": 100.0,
      "Text": " Thank you. What palm top is the best answer I can come with at this point?"
    },
    {
      "Time_Start": 105.0,
      "Time_End": 112.0,
      "Text": " Wontoshibo Libretto. It doesn't seem to be willing to project. It doesn't even do it"
    },
    {
      "Time_Start": 112.0,
      "Time_End": 116.0,
      "Text": " under Windows, let alone Linux, which the presentation is under."
    },
    {
      "Time_Start": 116.0,
      "Time_End": 122.0,
      "Text": " So, I'm going to probably have to deliver this without doing the projection. I suspected"
    },
    {
      "Time_Start": 122.0,
      "Time_End": 125.0,
      "Text": " this might be the case."
    },
    {
      "Time_Start": 126.0,
      "Time_End": 129.0,
      "Text": " Pass it around."
    },
    {
      "Time_Start": 131.0,
      "Time_End": 133.0,
      "Text": " What was that again?"
    },
    {
      "Time_Start": 133.0,
      "Time_End": 135.0,
      "Text": " Pass it around."
    },
    {
      "Time_Start": 135.0,
      "Time_End": 140.0,
      "Text": " Pass it around. Would I get it back afterwards?"
    },
    {
      "Time_Start": 143.0,
      "Time_End": 147.0,
      "Text": " Don't worry about it. I'll make sure there's a full copy of overheads are available. I'll"
    },
    {
      "Time_Start": 147.0,
      "Time_End": 151.0,
      "Text": " give you a web address where I'll post them to in the coming weeks so you can download"
    },
    {
      "Time_Start": 151.0,
      "Time_End": 156.0,
      "Text": " the copy of the overheads. So, I'll do it verbally and you can download them then."
    },
    {
      "Time_Start": 156.0,
      "Time_End": 158.0,
      "Text": " Is that okay with everyone?"
    },
    {
      "Time_Start": 158.0,
      "Time_End": 160.0,
      "Text": " Okay, we'll move on that."
    },
    {
      "Time_Start": 160.0,
      "Time_End": 164.0,
      "Text": " Actually, I should be able to give you a better set than what I've got here because this is"
    },
    {
      "Time_Start": 164.0,
      "Time_End": 170.0,
      "Text": " an interesting story. I found out I was speaking at DEF CON after I came to the United States"
    },
    {
      "Time_Start": 170.0,
      "Time_End": 176.0,
      "Text": " on vacation. That's why I've only got my palm top with me. I just brought it along for web"
    },
    {
      "Time_Start": 177.0,
      "Time_End": 184.0,
      "Text": " access and all I had on it was Windows 95 and Linux and the only presentation here I"
    },
    {
      "Time_Start": 184.0,
      "Time_End": 190.0,
      "Text": " had was Star Office under Linux. So, that's what the presentation here is in. But the"
    },
    {
      "Time_Start": 190.0,
      "Time_End": 195.0,
      "Text": " main presentation, which I submitted, was actually in PowerPoint and it was left back"
    },
    {
      "Time_Start": 195.0,
      "Time_End": 198.0,
      "Text": " in Britain."
    },
    {
      "Time_Start": 198.0,
      "Time_End": 203.0,
      "Text": " I'm saying this is a cursed talk because when I wrote this up on the laptop, rewrote it"
    },
    {
      "Time_Start": 204.0,
      "Time_End": 211.0,
      "Text": " on the laptop for you all, I did it in Vegas and the heavens opened. So, it rained here."
    },
    {
      "Time_Start": 211.0,
      "Time_End": 216.0,
      "Text": " I think I might be to blame for it and in Britain, when I did the original one on PowerPoint,"
    },
    {
      "Time_Start": 216.0,
      "Time_End": 221.0,
      "Text": " I did it a couple of days earlier and after that I was in a road smash and had to be cut"
    },
    {
      "Time_Start": 221.0,
      "Time_End": 226.0,
      "Text": " out of the vehicle about three weeks ago. So, I'm here with cracked ribs but still operational."
    },
    {
      "Time_Start": 226.0,
      "Time_End": 231.0,
      "Text": " So, I'm viewing this as a minor setback, not being able to display this on the overhead"
    },
    {
      "Time_Start": 231.0,
      "Time_End": 236.0,
      "Text": " projection and just thanking the lucky stars the ceiling hasn't fallen in."
    },
    {
      "Time_Start": 236.0,
      "Time_End": 245.0,
      "Text": " Yeah, definitely. It's the best way on this."
    },
    {
      "Time_Start": 245.0,
      "Time_End": 253.0,
      "Text": " So, what's the talk about? Well, literally, the talk is about simple methods which can"
    },
    {
      "Time_Start": 253.0,
      "Time_End": 260.0,
      "Text": " be used to damage a company's website or damage a company's web presence or internet presence"
    },
    {
      "Time_Start": 260.0,
      "Time_End": 268.0,
      "Text": " without necessarily hacking the site itself. There's all sorts of techniques and as I've"
    },
    {
      "Time_Start": 268.0,
      "Time_End": 272.0,
      "Text": " been asked to do this for Newbie Channel, I've picked some of the simpler ones to outline"
    },
    {
      "Time_Start": 272.0,
      "Time_End": 281.0,
      "Text": " later on which can be done and particularly strong emphasis on the defense against them."
    },
    {
      "Time_Start": 281.0,
      "Time_End": 287.0,
      "Text": " If you've not read the sheet, I am a lecturer in computer networking and also on computer"
    },
    {
      "Time_Start": 287.0,
      "Time_End": 292.0,
      "Text": " security and information security. So, it's more aimed more towards protection than attack"
    },
    {
      "Time_Start": 292.0,
      "Time_End": 297.0,
      "Text": " but naturally to defend you've got to know how the attack occurs. So, I'm going to be"
    },
    {
      "Time_Start": 297.0,
      "Time_End": 302.0,
      "Text": " describing that out to you. So, it's in basic terms and if you're expecting some radical"
    },
    {
      "Time_Start": 302.0,
      "Time_End": 308.0,
      "Text": " new hacking exploits, you're in the wrong talk. But it's an alternative way of thinking"
    },
    {
      "Time_Start": 308.0,
      "Time_End": 315.0,
      "Text": " things which many people in security tend not to look at and hopefully I'll open a few"
    },
    {
      "Time_Start": 315.0,
      "Time_End": 321.0,
      "Text": " eyes about out there to what security should be rather than what quite a few of the vendors"
    },
    {
      "Time_Start": 321.0,
      "Time_End": 327.0,
      "Text": " are selling. Right. Do you mind if I look at the palm top rather than point it out at"
    },
    {
      "Time_Start": 327.0,
      "Time_End": 335.0,
      "Text": " the crowd? I mean, who can actually see the actual screen display? Hands up. So, in other"
    },
    {
      "Time_Start": 335.0,
      "Time_End": 341.0,
      "Text": " words, about five yards is all that. Do you mind if I look at it so I can see what the"
    },
    {
      "Time_Start": 342.0,
      "Time_End": 352.0,
      "Text": " The problem with the Libretto, if anyone ever gets one, Tube Libretto, is that the screen"
    },
    {
      "Time_Start": 352.0,
      "Time_End": 359.0,
      "Text": " resolution is 640 by 480 which leads to not a lot of projection screens will not display."
    },
    {
      "Time_Start": 359.0,
      "Time_End": 365.0,
      "Text": " In addition, the fact is very, very high frequency on production and that's what things a lot"
    },
    {
      "Time_Start": 365.0,
      "Time_End": 370.0,
      "Text": " of the presentation devices won't do. It is turned on in the BIOS if anyone's asking"
    },
    {
      "Time_Start": 370.0,
      "Time_End": 378.0,
      "Text": " to actually project out on the other projector. So, that's the reason why it's not displaying."
    },
    {
      "Time_Start": 378.0,
      "Time_End": 385.0,
      "Text": " Unless someone here wants to come up and reconfigure X Windows so I can't see it but knock"
    },
    {
      "Time_Start": 385.0,
      "Time_End": 391.0,
      "Text": " down the screen display to actually get it up on the thing, they're welcome to have a"
    },
    {
      "Time_Start": 391.0,
      "Time_End": 399.0,
      "Text": " go if they can do it in two minutes flat. Anyone here can do that? Won't work. The reason"
    },
    {
      "Time_Start": 399.0,
      "Time_End": 406.0,
      "Text": " is because the resolution is set, I'd have to set for the screen display as well as the"
    },
    {
      "Time_Start": 406.0,
      "Time_End": 411.0,
      "Text": " driver. You'd have to knock down the hertz ratio of the system if it doesn't have a standard"
    },
    {
      "Time_Start": 411.0,
      "Time_End": 415.0,
      "Text": " VGA function. You'd have to knock down the speed resolution and lose the screen display"
    },
    {
      "Time_Start": 415.0,
      "Time_End": 421.0,
      "Text": " but knock it down to something which that can handle to put out on the screen. So, that"
    },
    {
      "Time_Start": 421.0,
      "Time_End": 432.0,
      "Text": " won't work, I'm afraid. Tried it. Okay, right. Let's get underway. Extra border hacking."
    },
    {
      "Time_Start": 432.0,
      "Time_End": 442.0,
      "Text": " Why defenses are required beyond your site's boundary. I'm the only one who can see this"
    },
    {
      "Time_Start": 442.0,
      "Time_End": 447.0,
      "Text": " overhead. Why am I clicking to it? Well, first of all, everyone here should be aware of a"
    },
    {
      "Time_Start": 447.0,
      "Time_End": 455.0,
      "Text": " conventional model of connecting to an Internet. For a small to medium-sized company, you have"
    },
    {
      "Time_Start": 455.0,
      "Time_End": 463.0,
      "Text": " a site, you're connected to the Internet via one single link. Your logical model of Internet"
    },
    {
      "Time_Start": 463.0,
      "Time_End": 476.0,
      "Text": " connectivity, you to the Internet, Internet to you. Now, I assume most people here would"
    },
    {
      "Time_Start": 476.0,
      "Time_End": 483.0,
      "Text": " not connect a company via any leased line technology without putting in a firewall."
    },
    {
      "Time_Start": 483.0,
      "Time_End": 489.0,
      "Text": " I think it's a given thing that everyone here would actually connect a firewall. Anyone"
    },
    {
      "Time_Start": 489.0,
      "Time_End": 500.0,
      "Text": " who wouldn't? You wouldn't connect a firewall? Why is that? Okay, you'd put some kind of"
    },
    {
      "Time_Start": 500.0,
      "Time_End": 505.0,
      "Text": " method of access to the Internet at large, wouldn't you? Or more importantly, between"
    },
    {
      "Time_Start": 505.0,
      "Time_End": 516.0,
      "Text": " your company and the attendees of DEF CON, I would imagine. It's realistic, isn't it?"
    },
    {
      "Time_Start": 516.0,
      "Time_End": 521.0,
      "Text": " And so, you'd actually have that in between you and the Internet. There's a great deal"
    },
    {
      "Time_Start": 521.0,
      "Time_End": 526.0,
      "Text": " of computer security vendors out there who are selling firewalls as a be-all and end-all"
    },
    {
      "Time_Start": 526.0,
      "Time_End": 531.0,
      "Text": " of security. I hope people, by listening to some of the talks at DEF CON, have started"
    },
    {
      "Time_Start": 531.0,
      "Time_End": 537.0,
      "Text": " to realize that if they had that conception beforehand, that's not necessarily the case."
    },
    {
      "Time_Start": 537.0,
      "Time_End": 548.0,
      "Text": " Firewalls are good. Firewalls will help you. They won't do everything. You have been attending"
    },
    {
      "Time_Start": 548.0,
      "Time_End": 555.0,
      "Text": " the other talks, haven't you, I trust? Okay, I'm just asking at this point here, because"
    },
    {
      "Time_Start": 555.0,
      "Time_End": 560.0,
      "Text": " previous times when I've been to DEF CON, I've turned up before, a lot of people have"
    },
    {
      "Time_Start": 560.0,
      "Time_End": 564.0,
      "Text": " just gone on drinking sprees up to Sunday, then turned up because their bags had been"
    },
    {
      "Time_Start": 564.0,
      "Time_End": 568.0,
      "Text": " kicked out of the hotel, and therefore hanging around the presentations for a little while"
    },
    {
      "Time_Start": 568.0,
      "Time_End": 576.0,
      "Text": " before going back. Anyone notice that this morning? No? Well, the luggage in the corridor."
    },
    {
      "Time_Start": 577.0,
      "Time_End": 585.0,
      "Text": " The thing is, firewalls enforce a kind of fortress model, the traditional Orange Book-based"
    },
    {
      "Time_Start": 585.0,
      "Time_End": 590.0,
      "Text": " approach to computer security. For those who didn't know the Orange Book, a security standard"
    },
    {
      "Time_Start": 590.0,
      "Time_End": 595.0,
      "Text": " for actually securing sites, it's based on the fact of hardening sites against attack."
    },
    {
      "Time_Start": 595.0,
      "Time_End": 601.0,
      "Text": " You form a fortress and defend against it. The old traditional model of computer security."
    },
    {
      "Time_Start": 602.0,
      "Time_End": 609.0,
      "Text": " There's also another model, time-based, pioneered by Bob Ayers and talked about a lot by Winshaw"
    },
    {
      "Time_Start": 609.0,
      "Time_End": 613.0,
      "Text": " Tao, if you haven't been hit by one of his books thrown into the audience on the subject."
    },
    {
      "Time_Start": 613.0,
      "Time_End": 621.0,
      "Text": " If you were there last night, you probably were hit by one. But literally, both of these"
    },
    {
      "Time_Start": 621.0,
      "Time_End": 628.0,
      "Text": " are based on a kind of fortress model. It's interesting that computer security is often"
    },
    {
      "Time_Start": 628.0,
      "Time_End": 634.0,
      "Text": " analogous to actually real life and old things which happened in history. So really a firewall"
    },
    {
      "Time_Start": 634.0,
      "Time_End": 641.0,
      "Text": " is nothing more different than a castle. It helps protect your site. And what people forget"
    },
    {
      "Time_Start": 641.0,
      "Time_End": 649.0,
      "Text": " is that castles have problems. There's a whole series of Hinges in history where castles"
    },
    {
      "Time_Start": 649.0,
      "Time_End": 659.0,
      "Text": " have actually been detrimental to the defenders. Anyone heard of a certain battle which occurred"
    },
    {
      "Time_Start": 659.0,
      "Time_End": 667.0,
      "Text": " between Julius Caesar in France, famous for what's called Tactical Donuts? No? Any military"
    },
    {
      "Time_Start": 667.0,
      "Time_End": 674.0,
      "Text": " people here? Alicia, that's the one. Yes, I was leaning on to that one. So you're fed."
    },
    {
      "Time_Start": 675.0,
      "Time_End": 686.0,
      "Text": " Mike, thank you. Quiet. Hmm, interesting. So everyone note it down for later. You walked"
    },
    {
      "Time_Start": 686.0,
      "Time_End": 695.0,
      "Text": " into that one. The key thing to note, it's taught at all the military colleges. It's worth"
    },
    {
      "Time_Start": 695.0,
      "Time_End": 699.0,
      "Text": " noting the fact it's very famous because of the Tactical Donut. And the inner defenders"
    },
    {
      "Time_Start": 699.0,
      "Time_End": 702.0,
      "Text": " were trying to get out to attack Julius Caesar, while the outer ones were trying to get in"
    },
    {
      "Time_Start": 702.0,
      "Time_End": 706.0,
      "Text": " to attack him on the outside. So it's a very unusual battle scenario. But the inner defenders"
    },
    {
      "Time_Start": 706.0,
      "Time_End": 710.0,
      "Text": " just could not get their troops out of the gates in sufficient numbers. They only could"
    },
    {
      "Time_Start": 710.0,
      "Time_End": 716.0,
      "Text": " attack them on small part. And that was in part what led to his victory. There's a whole"
    },
    {
      "Time_Start": 716.0,
      "Time_End": 723.0,
      "Text": " series of other cases where fortresses have been negative. The general fortress is a by"
    },
    {
      "Time_Start": 723.0,
      "Time_End": 731.0,
      "Text": " time against an attacker. It's to deter an attacker and also to make the defenders feel"
    },
    {
      "Time_Start": 732.0,
      "Time_End": 742.0,
      "Text": " safe, whether they are or not. The placebo effect. I'm sure there's many computer consultants"
    },
    {
      "Time_Start": 742.0,
      "Time_End": 749.0,
      "Text": " in the audience here today. And I bet many of them have sold firewalls. And perhaps knowingly"
    },
    {
      "Time_Start": 749.0,
      "Time_End": 754.0,
      "Text": " that the firewall isn't perhaps the best product. Or in some cases that the customer didn't"
    },
    {
      "Time_Start": 754.0,
      "Time_End": 760.0,
      "Text": " actually need a firewall. And how should I put it this way? The fact that we sold them"
    },
    {
      "Time_Start": 760.0,
      "Time_End": 767.0,
      "Text": " to them because the customer felt they needed one to make them feel safer. It's a visible"
    },
    {
      "Time_Start": 767.0,
      "Time_End": 774.0,
      "Text": " symbol of authority and security. And it's a demarcation line. And it does force anyone"
    },
    {
      "Time_Start": 774.0,
      "Time_End": 784.0,
      "Text": " attacking to invest more effort in trying to break in. Great theory for defence but"
    },
    {
      "Time_Start": 784.0,
      "Time_End": 791.0,
      "Text": " there's a problem. Historically, and you always should look at history because we always repeat"
    },
    {
      "Time_Start": 791.0,
      "Time_End": 800.0,
      "Text": " history's mistakes in the current day. Very few fortresses were ever stormed by force."
    },
    {
      "Time_Start": 801.0,
      "Time_End": 811.0,
      "Text": " Look at your military history. It's littered with cases of attacks on fortresses. In most"
    },
    {
      "Time_Start": 811.0,
      "Time_End": 819.0,
      "Text": " of these, the fortress was not stormed by force or if it was, only at the final end"
    },
    {
      "Time_Start": 819.0,
      "Time_End": 830.0,
      "Text": " stage. And that end stage was the end of a siege. Most fell due to being starved into"
    },
    {
      "Time_Start": 830.0,
      "Time_End": 839.0,
      "Text": " submission. The defenders would surrender. And there's various methods of forcing this"
    },
    {
      "Time_Start": 839.0,
      "Time_End": 850.0,
      "Text": " to be done. In particular, cutting off key services that defenders rely upon. It's very"
    },
    {
      "Time_Start": 850.0,
      "Time_End": 859.0,
      "Text": " unlikely anyone can build a fortress which doesn't need some external services. Think"
    },
    {
      "Time_Start": 859.0,
      "Time_End": 871.0,
      "Text": " about a company's internet link. Does that need any external services to operate? I'd"
    },
    {
      "Time_Start": 871.0,
      "Time_End": 876.0,
      "Text": " argue you'd have to have some otherwise why on earth did you connect to the internet in"
    },
    {
      "Time_Start": 876.0,
      "Time_End": 884.0,
      "Text": " the first place? So literally, you've got that flaw. And there's been a whole series"
    },
    {
      "Time_Start": 884.0,
      "Time_End": 888.0,
      "Text": " of these throughout history. And to move into modern history is to give a military"
    },
    {
      "Time_Start": 888.0,
      "Time_End": 894.0,
      "Text": " example. The fall of Singapore in World War II, where the Japanese effectively cut off"
    },
    {
      "Time_Start": 894.0,
      "Time_End": 900.0,
      "Text": " the water supply and therefore forced the British forces to surrender. You can go throughout"
    },
    {
      "Time_Start": 900.0,
      "Time_End": 905.0,
      "Text": " hundreds of cases where the fact this has happened. You cut off something essential,"
    },
    {
      "Time_Start": 905.0,
      "Time_End": 910.0,
      "Text": " something people didn't think about, and it forces the other side to capitulate. And this"
    },
    {
      "Time_Start": 910.0,
      "Time_End": 916.0,
      "Text": " is worrying because many sites connected by internet links but protected by firewalls"
    },
    {
      "Time_Start": 916.0,
      "Time_End": 925.0,
      "Text": " have key services which are important to them running on the outside of the firewall or"
    },
    {
      "Time_Start": 925.0,
      "Time_End": 933.0,
      "Text": " elsewhere on the internet where they may be vulnerable. I'm sure we've all perhaps seen"
    },
    {
      "Time_Start": 933.0,
      "Time_End": 939.0,
      "Text": " the situation where you have web servers outside firewalls on the internet when perhaps you"
    },
    {
      "Time_Start": 939.0,
      "Time_End": 943.0,
      "Text": " don't really want to protect the actual web server more than the people running Windows"
    },
    {
      "Time_Start": 943.0,
      "Time_End": 954.0,
      "Text": " 95 at the desktop. But that's where the firewall ends up going in. So let's look at the attacks."
    },
    {
      "Time_Start": 954.0,
      "Time_End": 962.0,
      "Text": " Let's see what can go on. And the first one is your internet service provider. Everything"
    },
    {
      "Time_Start": 962.0,
      "Time_End": 971.0,
      "Text": " you do goes via them. Simple, really. Everyone here knows that from their access at home,"
    },
    {
      "Time_Start": 971.0,
      "Time_End": 980.0,
      "Text": " if not from their companies. Who trusts their internet service provider? Hands up. Put your"
    },
    {
      "Time_Start": 980.0,
      "Time_End": 986.0,
      "Text": " hand down if you are your internet service provider. Ah, right, okay. So in other words,"
    },
    {
      "Time_Start": 986.0,
      "Time_End": 996.0,
      "Text": " none of you seem to trust them. Why? Unknown quantity? Is there a company out there? They"
    },
    {
      "Time_Start": 996.0,
      "Time_End": 1003.0,
      "Text": " see all your traffic. They know what you do on the internet. They know what sites you"
    },
    {
      "Time_Start": 1003.0,
      "Time_End": 1013.0,
      "Text": " visit, as could anyone who breaks into their systems as well. If someone breaks into an"
    },
    {
      "Time_Start": 1013.0,
      "Time_End": 1022.0,
      "Text": " internet service provider, they can alter stuff which normally would be viewed as being"
    },
    {
      "Time_Start": 1022.0,
      "Time_End": 1030.0,
      "Text": " secure. And internet service providers often, I used to use the they word there, often,"
    },
    {
      "Time_Start": 1030.0,
      "Time_End": 1039.0,
      "Text": " aren't the most secure systems out there. Okay, some are. Some are very, very secure"
    },
    {
      "Time_Start": 1039.0,
      "Time_End": 1045.0,
      "Text": " indeed. But others aren't. They all tend to have vulnerabilities. They're often concerned"
    },
    {
      "Time_Start": 1045.0,
      "Time_End": 1049.0,
      "Text": " with getting the product out. You'd hope that they'd be more technically oriented than the"
    },
    {
      "Time_Start": 1049.0,
      "Time_End": 1055.0,
      "Text": " people, for example, at J Blogs and Cocos factory. But you'd be surprised sometimes"
    },
    {
      "Time_Start": 1055.0,
      "Time_End": 1060.0,
      "Text": " at the vulnerabilities which stuck out there. I've gone to quite a few web hosting companies"
    },
    {
      "Time_Start": 1060.0,
      "Time_End": 1067.0,
      "Text": " and just found straight out of the box installs of Linux Red Hat 4.1 with no bug patches out"
    },
    {
      "Time_Start": 1067.0,
      "Time_End": 1073.0,
      "Text": " there, running several hundred websites off the thing. I'm sure you probably all know"
    },
    {
      "Time_Start": 1073.0,
      "Time_End": 1081.0,
      "Text": " of similar cases or Windows NT straight installations and no bug patches being placed on them."
    },
    {
      "Time_Start": 1081.0,
      "Time_End": 1087.0,
      "Text": " So in other words, they have vulnerabilities. And just ask Dark Tangent about Defcon.org"
    },
    {
      "Time_Start": 1087.0,
      "Time_End": 1093.0,
      "Text": " and fire this hosting company if you want to. Has anyone ever seen Defcon.org website?"
    },
    {
      "Time_Start": 1093.0,
      "Time_End": 1101.0,
      "Text": " Did anyone see it on Friday? Yeah? Who saw it on Friday? Most people here haven't."
    },
    {
      "Time_Start": 1101.0,
      "Time_End": 1108.0,
      "Text": " Didn't see it. They're already here. So they didn't have any internet access. Right."
    },
    {
      "Time_Start": 1108.0,
      "Time_End": 1116.0,
      "Text": " In case anyone wants to know, the Defcon.org site got altered, didn't it? Yeah. So I mean,"
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1121.0,
      "Text": " it happens to them by their hosting company. Again, it was held by an external hosting"
    },
    {
      "Time_Start": 1121.0,
      "Time_End": 1126.0,
      "Text": " company. Someone broke into an external hosting company's computers and altered things. And"
    },
    {
      "Time_Start": 1126.0,
      "Time_End": 1131.0,
      "Text": " this is worrying, particularly if people do a variety of attacks. Now, assuming you've"
    },
    {
      "Time_Start": 1131.0,
      "Time_End": 1136.0,
      "Text": " got your web server at your site, so we'll assume a medium-sized company, least line"
    },
    {
      "Time_Start": 1136.0,
      "Time_End": 1141.0,
      "Text": " connectivity, website running on their site rather than an external host, and they're"
    },
    {
      "Time_Start": 1141.0,
      "Time_End": 1147.0,
      "Text": " connected via an internet service provider. Right? Well, if you break an internet service"
    },
    {
      "Time_Start": 1148.0,
      "Time_End": 1155.0,
      "Text": " provider, what damage can be done? Well, they can do the following. First of all, sniffing."
    },
    {
      "Time_Start": 1155.0,
      "Time_End": 1172.0,
      "Text": " I'm sure you all know what sniffing is. Am I right? No, not that. Okay. Right. Okay."
    },
    {
      "Time_Start": 1172.0,
      "Time_End": 1178.0,
      "Text": " Did you win any of the tickets to Palomino? Obviously not. Right. Okay. Right. Sniffing,"
    },
    {
      "Time_Start": 1178.0,
      "Time_End": 1182.0,
      "Text": " in case anyone didn't know, in the computing term, is monitoring and recording your traffic."
    },
    {
      "Time_Start": 1182.0,
      "Time_End": 1186.0,
      "Text": " Anyone at the internet service provider could do it. There's tons of programs out there"
    },
    {
      "Time_Start": 1186.0,
      "Time_End": 1190.0,
      "Text": " to do the system. I won't go through them all, or any of them, in fact. But the key"
    },
    {
      "Time_Start": 1190.0,
      "Time_End": 1194.0,
      "Text": " thing is they can just record your traffic, see what's going past on the wire, and record"
    },
    {
      "Time_Start": 1194.0,
      "Time_End": 1201.0,
      "Text": " it down. If you're long on to external machines, unencrypted, which most people tend to do,"
    },
    {
      "Time_Start": 1201.0,
      "Time_End": 1206.0,
      "Text": " unfortunately, you're bell-tasked to get the ID and password. But one of the most"
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1215.0,
      "Text": " serious things is actually just seeing what sites your company visits. And particularly"
    },
    {
      "Time_Start": 1215.0,
      "Time_End": 1222.0,
      "Text": " for blackmail purposes, for certain staff, but in addition for industrial espionage."
    },
    {
      "Time_Start": 1222.0,
      "Time_End": 1227.0,
      "Text": " Because your email goes out, and I'm prepared to put money on here that most people in this"
    },
    {
      "Time_Start": 1227.0,
      "Time_End": 1233.0,
      "Text": " room do not use encrypted email when talking to commercial clients. Very few companies,"
    },
    {
      "Time_Start": 1233.0,
      "Time_End": 1238.0,
      "Text": " when emailing other commercial clients, tend to encrypt their email. So if someone breaks"
    },
    {
      "Time_Start": 1238.0,
      "Time_End": 1243.0,
      "Text": " in the internet service provider, they could spy on the actual email traffic, record it"
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1248.0,
      "Text": " going out to the company, find out who your company's clients are, or providers, how much"
    },
    {
      "Time_Start": 1248.0,
      "Time_End": 1253.0,
      "Text": " you're perhaps charging for them, and maybe undercut you, or be able to work out your"
    },
    {
      "Time_Start": 1253.0,
      "Time_End": 1262.0,
      "Text": " financial position. It happens, particularly if you're from France, or going to France,"
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1269.0,
      "Text": " allegedly. The key thing to note is that's one thing. The other thing is DNS analysis."
    },
    {
      "Time_Start": 1269.0,
      "Time_End": 1275.0,
      "Text": " The DNS system, the running internet service provider, could be monitored. See which sites"
    },
    {
      "Time_Start": 1275.0,
      "Time_End": 1281.0,
      "Text": " you visit, and so on. It would be nice if your rivals were able to post up X Corp has"
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1287.0,
      "Text": " 25% of its accesses to porn sites, and pass it off to a newspaper. I'm sure that would"
    },
    {
      "Time_Start": 1287.0,
      "Time_End": 1293.0,
      "Text": " go down well with your managing director, the COO."
    },
    {
      "Time_Start": 1293.0,
      "Time_End": 1294.0,
      "Text": " What?"
    },
    {
      "Time_Start": 1294.0,
      "Time_End": 1296.0,
      "Text": " You change."
    },
    {
      "Time_Start": 1296.0,
      "Time_End": 1297.0,
      "Text": " Sorry?"
    },
    {
      "Time_Start": 1297.0,
      "Time_End": 1298.0,
      "Text": " You change."
    },
    {
      "Time_Start": 1298.0,
      "Time_End": 1303.0,
      "Text": " Oh yes, and this is what this next slide is. And you can see this."
    },
    {
      "Time_Start": 1304.0,
      "Time_End": 1315.0,
      "Text": " You're sat in the front, very handy for this. Yes, it can be changed. I'm sure you've probably"
    },
    {
      "Time_Start": 1315.0,
      "Time_End": 1320.0,
      "Text": " seen some of the other talks on the poison in caches, but what about hitting the primary"
    },
    {
      "Time_Start": 1320.0,
      "Time_End": 1326.0,
      "Text": " and secondary DNS servers? Most mid-sized companies tend not to bother hosting their"
    },
    {
      "Time_Start": 1326.0,
      "Time_End": 1331.0,
      "Text": " own DNS servers on site, even if they've got a web server. They get their internet service"
    },
    {
      "Time_Start": 1331.0,
      "Time_End": 1337.0,
      "Text": " provider to host it for them. This means that any DNS lookups requesting their domain"
    },
    {
      "Time_Start": 1337.0,
      "Time_End": 1343.0,
      "Text": " get provided by their internet service provider to whoever asked, and then they talk by the"
    },
    {
      "Time_Start": 1343.0,
      "Time_End": 1351.0,
      "Text": " internet service provider to the company. So if you're on AOL, any AOL users here? No"
    },
    {
      "Time_Start": 1351.0,
      "Time_End": 1362.0,
      "Text": " one wants to admit being on AOL? Hmm, strange. So obviously not many security professionals"
    },
    {
      "Time_Start": 1362.0,
      "Time_End": 1368.0,
      "Text": " in the audience. Some of them tend to have CompuServe and AOL accounts, I've noticed."
    },
    {
      "Time_Start": 1368.0,
      "Time_End": 1372.0,
      "Text": " They do, it's true, it's just they don't."
    },
    {
      "Time_Start": 1372.0,
      "Time_End": 1380.0,
      "Text": " Come on, let me ask the question again. Honestly, who has an AOL account or CompuServe?"
    },
    {
      "Time_Start": 1380.0,
      "Time_End": 1391.0,
      "Text": " None, right, okay then. I don't believe it. Some of you will. Okay, who had an AOL account"
    },
    {
      "Time_Start": 1391.0,
      "Time_End": 1397.0,
      "Text": " and dropped it? Thank you, at least you've got some people answer."
    },
    {
      "Time_Start": 1397.0,
      "Time_End": 1401.0,
      "Text": " No, the thing about it is that these internet service providers, they go by them, they get"
    },
    {
      "Time_Start": 1401.0,
      "Time_End": 1405.0,
      "Text": " their DNS information off your app, their SP server hosting the website. They get that"
    },
    {
      "Time_Start": 1405.0,
      "Time_End": 1410.0,
      "Text": " and then use the IP number to talk through to the site. TCP IP basics talk, I'm not going"
    },
    {
      "Time_Start": 1410.0,
      "Time_End": 1414.0,
      "Text": " to go into it anymore. But what happens if someone breaks into internet service provider,"
    },
    {
      "Time_Start": 1414.0,
      "Time_End": 1420.0,
      "Text": " changes that DNS information? They can redirect where the website's going to. So instead of"
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1426.0,
      "Text": " going to your company's website, they can be redirected to another one. So people going"
    },
    {
      "Time_Start": 1427.0,
      "Time_End": 1452.0,
      "Text": " to yourcompany.com suddenly go to www.insertyourfavoritesiteofchoice.com. Yeah, redirect to their email as well,"
    },
    {
      "Time_Start": 1452.0,
      "Time_End": 1461.0,
      "Text": " yeah, particularly to their rivals or something completely inappropriate. That's right. And"
    },
    {
      "Time_Start": 1461.0,
      "Time_End": 1466.0,
      "Text": " in addition, of course, there's another nasty attack where you hack someone else's DNS one,"
    },
    {
      "Time_Start": 1466.0,
      "Time_End": 1473.0,
      "Text": " which is a completely different site, and redirect their email to you, your target."
    },
    {
      "Time_Start": 1473.0,
      "Time_End": 1480.0,
      "Text": " And that means that they get all the spurious emails which they wouldn't normally expect."
    },
    {
      "Time_Start": 1480.0,
      "Time_End": 1487.0,
      "Text": " Could be embarrassing for certain kind of sites, again, to clog it up. There's all sorts"
    },
    {
      "Time_Start": 1487.0,
      "Time_End": 1494.0,
      "Text": " of tricks which can be done with this DNS redirection. It's not, you know, it's a hacking"
    },
    {
      "Time_Start": 1494.0,
      "Time_End": 1502.0,
      "Text": " attack, it's not that tricky to pull off. Okay, that's, leave DNS for time. I want to"
    },
    {
      "Time_Start": 1502.0,
      "Time_End": 1507.0,
      "Text": " get through a few more services, in particular denial-of-service attacks, which you've all"
    },
    {
      "Time_Start": 1507.0,
      "Time_End": 1515.0,
      "Text": " heard of, I'm sure, particularly the old-fashioned hosing attack. And this actually operates,"
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1521.0,
      "Text": " hang on, does anyone know what hosing is? Literally it's just sending people so much"
    },
    {
      "Time_Start": 1521.0,
      "Time_End": 1526.0,
      "Text": " traffic that their pipe can't handle it. My pipe's bigger than yours, so I can transmit"
    },
    {
      "Time_Start": 1526.0,
      "Time_End": 1533.0,
      "Text": " more data than you can handle, so you cannot access the internet. So I've got a T1, you've"
    },
    {
      "Time_Start": 1533.0,
      "Time_End": 1540.0,
      "Text": " got a 56k modem, I broadcast 64, well, I broadcast like 256 kilobits a second to you, you're"
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1546.0,
      "Text": " not going to be able to do any web browsing or anything on the internet whilst I'm transmitting."
    },
    {
      "Time_Start": 1546.0,
      "Time_End": 1554.0,
      "Text": " That's what rehosing is. And again, that's an interesting one, because firewalls at sites"
    },
    {
      "Time_Start": 1554.0,
      "Time_End": 1560.0,
      "Text": " often make hosing attacks more possible, they slow down connections. Anyone here who's"
    },
    {
      "Time_Start": 1560.0,
      "Time_End": 1567.0,
      "Text": " worked in a company who's got a firewall connected via an ISDN line or slow speed connection,"
    },
    {
      "Time_Start": 1567.0,
      "Time_End": 1572.0,
      "Text": " then suddenly upgraded their speed of link and tried to put, use the same firewall on"
    },
    {
      "Time_Start": 1572.0,
      "Time_End": 1578.0,
      "Text": " the higher speed link, and suddenly found you've got no improvement in actual connection"
    },
    {
      "Time_Start": 1578.0,
      "Time_End": 1584.0,
      "Text": " speed. Anyone have that situation? Yeah, a few professionals out there. Because in"
    },
    {
      "Time_Start": 1584.0,
      "Time_End": 1589.0,
      "Text": " fact the firewall wasn't able to handle the extra traffic, it was a limitation of traffic."
    },
    {
      "Time_Start": 1589.0,
      "Time_End": 1595.0,
      "Text": " And this is very worrying, because a lot of systems have this, and a lot of military fortresses"
    },
    {
      "Time_Start": 1595.0,
      "Time_End": 1601.0,
      "Text": " in the past have had this. And there's a famous case, anyone heard of Horatio at the Bridge"
    },
    {
      "Time_Start": 1601.0,
      "Time_End": 1608.0,
      "Text": " from military history? From Roman history? Yeah, where one person essentially stood at"
    },
    {
      "Time_Start": 1608.0,
      "Time_End": 1612.0,
      "Text": " the bridge, everyone had to cross one at a time, the attacking army was able to face"
    },
    {
      "Time_Start": 1612.0,
      "Time_End": 1619.0,
      "Text": " the entire army one on one, and essentially save the city by defeating the army. He died"
    },
    {
      "Time_Start": 1619.0,
      "Time_End": 1626.0,
      "Text": " himself I believe, but was able to defeat the attack. So this is the sort of thing again"
    },
    {
      "Time_Start": 1626.0,
      "Time_End": 1631.0,
      "Text": " which applies, and firewalls do constrict your access speed, so in some ways they make"
    },
    {
      "Time_Start": 1631.0,
      "Time_End": 1637.0,
      "Text": " you more vulnerable to these sort of attacks. And we all know denial of service attacks"
    },
    {
      "Time_Start": 1637.0,
      "Time_End": 1642.0,
      "Text": " don't need much knowledge to carry out, any script person can actually get stuff off certain"
    },
    {
      "Time_Start": 1642.0,
      "Time_End": 1649.0,
      "Text": " sites on the internet. Now these are the more technical external attacks, but there are"
    },
    {
      "Time_Start": 1649.0,
      "Time_End": 1655.0,
      "Text": " some incredibly insidious, very basic levels of attacks which can be carried out by people"
    },
    {
      "Time_Start": 1655.0,
      "Time_End": 1662.0,
      "Text": " with no technical knowledge whatsoever. And including here, technical knowledge, being"
    },
    {
      "Time_Start": 1662.0,
      "Time_End": 1669.0,
      "Text": " able to visit a certain website, get a script, and press go and type in an IP number. There"
    },
    {
      "Time_Start": 1669.0,
      "Time_End": 1676.0,
      "Text": " are some even more basic level skills which can be done to attack this. And this is based"
    },
    {
      "Time_Start": 1677.0,
      "Time_End": 1684.0,
      "Text": " about actual information and poisoning information out on the internet about companies."
    },
    {
      "Time_Start": 1684.0,
      "Time_End": 1691.0,
      "Text": " I assume there's a good number of people looking at this crowd from the age group which is"
    },
    {
      "Time_Start": 1691.0,
      "Time_End": 1698.0,
      "Text": " here, most of the younger people probably aren't up yet I assume. A good number of you"
    },
    {
      "Time_Start": 1698.0,
      "Time_End": 1705.0,
      "Text": " work for companies. How many of your companies have a policy of monitoring what is said about"
    },
    {
      "Time_Start": 1706.0,
      "Time_End": 1715.0,
      "Text": " your company on the internet? Hands up. That's most not, but a good number are, good. Because"
    },
    {
      "Time_Start": 1715.0,
      "Time_End": 1721.0,
      "Text": " most companies tend not to check what's been said about them on the internet, and that"
    },
    {
      "Time_Start": 1721.0,
      "Time_End": 1729.0,
      "Text": " is dangerous. Information is power. Poisoned information about a company can be damaging."
    },
    {
      "Time_Start": 1729.0,
      "Time_End": 1736.0,
      "Text": " Say the fact that you are going to post a loss in the coming quarter gets out to the"
    },
    {
      "Time_Start": 1736.0,
      "Time_End": 1743.0,
      "Text": " people trading your stock on Nasdaq. What's going to happen? Yeah, we all know what's"
    },
    {
      "Time_Start": 1743.0,
      "Time_End": 1749.0,
      "Text": " happened. We've seen some cases of some people trying to talk up stock as well recently using"
    },
    {
      "Time_Start": 1749.0,
      "Time_End": 1756.0,
      "Text": " false information. And the problem is people accept what they are told across the internet"
    },
    {
      "Time_Start": 1757.0,
      "Time_End": 1764.0,
      "Text": " without really checking the sources. And the problem is people can do these attacks, particularly"
    },
    {
      "Time_Start": 1764.0,
      "Time_End": 1772.0,
      "Text": " on things like newsgroups. Now most people here probably access newsgroups at one a time,"
    },
    {
      "Time_Start": 1772.0,
      "Time_End": 1782.0,
      "Text": " alt.sex.whatever, or other topics. I know you have. There's always one in the audience"
    },
    {
      "Time_Start": 1782.0,
      "Time_End": 1786.0,
      "Text": " here. You can always get one. The thing is, you always have people who access these kind"
    },
    {
      "Time_Start": 1786.0,
      "Time_End": 1791.0,
      "Text": " of sites, and particularly useful ones as well, like comp.rs.linex and so on like that."
    },
    {
      "Time_Start": 1791.0,
      "Time_End": 1797.0,
      "Text": " And hopefully comp.rs.stuffonlibretto is trying to get it worked with these overprojection"
    },
    {
      "Time_Start": 1797.0,
      "Time_End": 1803.0,
      "Text": " systems as well. I'm going to have to visit that one. The thing is, fake press releases"
    },
    {
      "Time_Start": 1803.0,
      "Time_End": 1808.0,
      "Text": " could easily be published on a newsgroup in the hope of causing you problems. And it can"
    },
    {
      "Time_Start": 1808.0,
      "Time_End": 1813.0,
      "Text": " be done virtually anonymously. Forget what people say about, oh, you can always track"
    },
    {
      "Time_Start": 1813.0,
      "Time_End": 1819.0,
      "Text": " people across cyberspace and so on. Well, any person can go and get an AOL account,"
    },
    {
      "Time_Start": 1819.0,
      "Time_End": 1825.0,
      "Text": " one of these trial accounts. You find them, well, who hasn't got one coming through the"
    },
    {
      "Time_Start": 1825.0,
      "Time_End": 1833.0,
      "Text": " door? Just go and get a magazine, pick one up. Enter in some kind of financial information"
    },
    {
      "Time_Start": 1834.0,
      "Time_End": 1840.0,
      "Text": " for the registration. Connect on via a hotel room, register on someone else's name, paid"
    },
    {
      "Time_Start": 1840.0,
      "Time_End": 1848.0,
      "Text": " for in cash. And you can post anonymously. Any other Internet service provider, probably"
    },
    {
      "Time_Start": 1848.0,
      "Time_End": 1854.0,
      "Text": " similar, like CompuServe, and you name which one you want to do. I'm just picking one AOL"
    },
    {
      "Time_Start": 1854.0,
      "Time_End": 1864.0,
      "Text": " because I have an AOL account. I know, I got it when I came to America in the hope of getting"
    },
    {
      "Time_Start": 1864.0,
      "Time_End": 1875.0,
      "Text": " Internet access. Yeah, there is actually my name on it. Why, do you have a look? Ah, right."
    },
    {
      "Time_Start": 1875.0,
      "Time_End": 1882.0,
      "Text": " Okay. It's not actually my name, but it's close to it. So I'm not really slagging off"
    },
    {
      "Time_Start": 1882.0,
      "Time_End": 1887.0,
      "Text": " AOL, don't worry about that. It did work, and I've been able to get Internet access."
    },
    {
      "Time_Start": 1887.0,
      "Time_End": 1892.0,
      "Text": " The key thing to know is the fact that these companies which distribute things widely do"
    },
    {
      "Time_Start": 1892.0,
      "Time_End": 1896.0,
      "Text": " make this vulnerable. It is possible to do it. And the people publish via things like"
    },
    {
      "Time_Start": 1896.0,
      "Time_End": 1900.0,
      "Text": " Daisy News in addition, it helps muddy the waters. They can almost certainly get away"
    },
    {
      "Time_Start": 1900.0,
      "Time_End": 1905.0,
      "Text": " with such a posting. So it's not exactly news, not exactly difficult."
    },
    {
      "Time_Start": 1905.0,
      "Time_End": 1910.0,
      "Text": " Defenses. If you're going to defend yourself, you're going to have to check newsgroups for"
    },
    {
      "Time_Start": 1910.0,
      "Time_End": 1915.0,
      "Text": " yourself. Use a search engine for newsgroups such as Daisy News. Search for your company's"
    },
    {
      "Time_Start": 1915.0,
      "Time_End": 1923.0,
      "Text": " name. See what's there. And publish quickly counter statements if any occur about your"
    },
    {
      "Time_Start": 1923.0,
      "Time_End": 1927.0,
      "Text": " company. You're going to have to be on the ball on this. It's worth noting that many"
    },
    {
      "Time_Start": 1927.0,
      "Time_End": 1934.0,
      "Text": " companies use such companies to search for news articles on themselves, press clipping"
    },
    {
      "Time_Start": 1935.0,
      "Time_End": 1940.0,
      "Text": " agencies, which tend to return once a week. A number of these actually do this on the"
    },
    {
      "Time_Start": 1940.0,
      "Time_End": 1945.0,
      "Text": " Internet as well, and it might be worthwhile paying for such a company to actually search"
    },
    {
      "Time_Start": 1945.0,
      "Time_End": 1950.0,
      "Text": " for your press clippings and information to see if anyone's doing this about yourself."
    },
    {
      "Time_Start": 1950.0,
      "Time_End": 1955.0,
      "Text": " And it can affect small companies as well as large ones. Imagine if you're a small"
    },
    {
      "Time_Start": 1955.0,
      "Time_End": 1963.0,
      "Text": " burger joint and someone posted news to a local newsgroup that you had food poisoning"
    },
    {
      "Time_Start": 1963.0,
      "Time_End": 1973.0,
      "Text": " outbreak. Gets into the local press. Problem. People can also email poisoned information"
    },
    {
      "Time_Start": 1973.0,
      "Time_End": 1979.0,
      "Text": " pretending to come from you. There's plenty of guides on out there on how to hide your"
    },
    {
      "Time_Start": 1979.0,
      "Time_End": 1984.0,
      "Text": " email and disguise where it's coming from. Use the trick I told you earlier and just"
    },
    {
      "Time_Start": 1984.0,
      "Time_End": 1988.0,
      "Text": " actually connect on using port 25 and enter the information. There's tons of script information"
    },
    {
      "Time_Start": 1989.0,
      "Time_End": 1994.0,
      "Text": " out there and they just send it there and it appears to come from you. Okay. If you"
    },
    {
      "Time_Start": 1994.0,
      "Time_End": 1999.0,
      "Text": " had a check, you'd find out it wouldn't have come from the person who thinks newspapers"
    },
    {
      "Time_Start": 1999.0,
      "Time_End": 2006.0,
      "Text": " are able to take the effort to check up all the releases sent to them to check the header"
    },
    {
      "Time_Start": 2006.0,
      "Time_End": 2013.0,
      "Text": " information to confirm everything's correct. Okay. Major ones do it. What about the local"
    },
    {
      "Time_Start": 2013.0,
      "Time_End": 2021.0,
      "Text": " newspaper? You've got to watch out for that. That can happen, particularly also to clients"
    },
    {
      "Time_Start": 2021.0,
      "Time_End": 2027.0,
      "Text": " as well. I mean, people do it all the time, like canceling hotel rooms of some speakers"
    },
    {
      "Time_Start": 2027.0,
      "Time_End": 2037.0,
      "Text": " coming to DEF CON. It does actually happen. So what happens at this point? Well, how do"
    },
    {
      "Time_Start": 2037.0,
      "Time_End": 2042.0,
      "Text": " you defend it? Well, you should use digital signatures on emails. Anyone do that with"
    },
    {
      "Time_Start": 2042.0,
      "Time_End": 2050.0,
      "Text": " their email? Go on. A good number of people do that. Digital signatures just really take"
    },
    {
      "Time_Start": 2050.0,
      "Time_End": 2054.0,
      "Text": " the contents of the email, produce a hashing function out of it so you can tell the email"
    },
    {
      "Time_Start": 2054.0,
      "Time_End": 2061.0,
      "Text": " message is actually where it came from and the contents haven't been altered. You can"
    },
    {
      "Time_Start": 2061.0,
      "Time_End": 2065.0,
      "Text": " do that with emails, you can do that with newsgroups, but it's not perfect because how"
    },
    {
      "Time_Start": 2066.0,
      "Time_End": 2072.0,
      "Text": " many people here think everyone who you send digital signatures to bothers checking their"
    },
    {
      "Time_Start": 2072.0,
      "Time_End": 2079.0,
      "Text": " authenticity? How many people here have had a download off the internet of some popular"
    },
    {
      "Time_Start": 2079.0,
      "Time_End": 2084.0,
      "Text": " application, a shared application, and it's had a file with a digital signature, say,"
    },
    {
      "Time_Start": 2084.0,
      "Time_End": 2089.0,
      "Text": " generated with PGP, and you've checked the digital signature to check your binary was"
    },
    {
      "Time_Start": 2089.0,
      "Time_End": 2098.0,
      "Text": " not altered? Who's actually done that? About 20% of this audience. Who reckons the general"
    },
    {
      "Time_Start": 2098.0,
      "Time_End": 2106.0,
      "Text": " population at large bothers? Not likely. Most don't do it. So there's no really easy answer"
    },
    {
      "Time_Start": 2106.0,
      "Time_End": 2114.0,
      "Text": " to actually defend some emails. Okay. That one there. Oh, good grief. Moved ahead. So"
    },
    {
      "Time_Start": 2114.0,
      "Time_End": 2118.0,
      "Text": " let's have a look at some other simple ones. And the most obvious one of all is the"
    },
    {
      "Time_Start": 2119.0,
      "Time_End": 2127.0,
      "Text": " domain name registration trick. I assume everyone's registered their domain name. In fact, I think"
    },
    {
      "Time_Start": 2127.0,
      "Time_End": 2132.0,
      "Text": " most people in this audience probably have tons of them or registered those investment"
    },
    {
      "Time_Start": 2132.0,
      "Time_End": 2141.0,
      "Text": " opportunities. Some companies didn't. Left themselves open. And quite recently, a couple"
    },
    {
      "Time_Start": 2141.0,
      "Time_End": 2145.0,
      "Text": " of major companies never bothered registering their domain names and they got taken over."
    },
    {
      "Time_Start": 2145.0,
      "Time_End": 2150.0,
      "Text": " You've probably heard of it and they're quite a bit in the press. I won't mention their"
    },
    {
      "Time_Start": 2150.0,
      "Time_End": 2155.0,
      "Text": " names and won't embarrass them, but I'm sure you'll find plenty of information on websites"
    },
    {
      "Time_Start": 2155.0,
      "Time_End": 2159.0,
      "Text": " about it. But there's various things you can do. You need to register these domain names."
    },
    {
      "Time_Start": 2159.0,
      "Time_End": 2168.0,
      "Text": " Make sure you get them. Also make sure you may get the .net and .org as well as the .com."
    },
    {
      "Time_Start": 2168.0,
      "Time_End": 2175.0,
      "Text": " Don't leave yourself open. Some conferences have done on hacking in the past, particularly"
    },
    {
      "Time_Start": 2175.0,
      "Time_End": 2180.0,
      "Text": " one which is called Beyond Hope, which very nearly had beyondhope.com registered when"
    },
    {
      "Time_Start": 2180.0,
      "Time_End": 2186.0,
      "Text": " they were using hope.net as their domain name system. Because the fact people have a tendency"
    },
    {
      "Time_Start": 2186.0,
      "Time_End": 2192.0,
      "Text": " to go just typing names to try and find out sites. Make sure the fact your domain name"
    },
    {
      "Time_Start": 2193.0,
      "Time_End": 2202.0,
      "Text": " matches and also get logical alternatives to your site to protect your name. This is"
    },
    {
      "Time_Start": 2202.0,
      "Time_End": 2208.0,
      "Text": " important because make sure if you've got an O in your name, you register the letter"
    },
    {
      "Time_Start": 2208.0,
      "Time_End": 2215.0,
      "Text": " zero, number zero, in actual your name. Microsoft, for example, with a zero instead of an O."
    },
    {
      "Time_Start": 2215.0,
      "Time_End": 2219.0,
      "Text": " Because people will use that and they might be able to convince people that their site"
    },
    {
      "Time_Start": 2219.0,
      "Time_End": 2226.0,
      "Text": " is a genuine one. Ones instead of I's. Some poor users, for example, AOL users have discovered"
    },
    {
      "Time_Start": 2226.0,
      "Time_End": 2232.0,
      "Text": " you can't tell the difference between O and zero and one and I on the actual software."
    },
    {
      "Time_Start": 2232.0,
      "Time_End": 2239.0,
      "Text": " You can also do derogatory versions of your domain name. Make sure that you get them."
    },
    {
      "Time_Start": 2239.0,
      "Time_End": 2244.0,
      "Text": " Just like quite a few of the T-shirts which have been wandering around at DEF CON. Make"
    },
    {
      "Time_Start": 2244.0,
      "Time_End": 2247.0,
      "Text": " sure you actually do that if you wish to protect yourself. Yes?"
    },
    {
      "Time_Start": 2247.0,
      "Time_End": 2251.0,
      "Text": " Isn't that just because the intruders are no longer enforcing their own regulations?"
    },
    {
      "Time_Start": 2251.0,
      "Time_End": 2256.0,
      "Text": " Correct. But there's all sorts of ways of even getting around it at that point. Say"
    },
    {
      "Time_Start": 2256.0,
      "Time_End": 2267.0,
      "Text": " for example you have Federal Universal Credit Cards. I mean they won't allow that domain"
    },
    {
      "Time_Start": 2267.0,
      "Time_End": 2273.0,
      "Text": " name but you know you could actually do that. You get your initials. Just the K at the end"
    },
    {
      "Time_Start": 2273.0,
      "Time_End": 2277.0,
      "Text": " becomes a K. I'll leave it up to you to work that one out. There's ways of doing that."
    },
    {
      "Time_Start": 2277.0,
      "Time_End": 2282.0,
      "Text": " You could legitimately form a quick corporation very quickly with that and then register that"
    },
    {
      "Time_Start": 2282.0,
      "Time_End": 2286.0,
      "Text": " and you'd potentially have a reason to have that domain name."
    },
    {
      "Time_Start": 2286.0,
      "Time_End": 2291.0,
      "Text": " And trademarks is a major issue because they're not all international. They're nationals."
    },
    {
      "Time_Start": 2291.0,
      "Time_End": 2296.0,
      "Text": " And .coms are international sections. So it's a real set of muddy waters on that at that"
    },
    {
      "Time_Start": 2296.0,
      "Time_End": 2300.0,
      "Text": " area. But you're correct. If there was strong enforcement at the top level, people wouldn't"
    },
    {
      "Time_Start": 2300.0,
      "Time_End": 2307.0,
      "Text": " be able to do this. And some countries have enforced such a stringent regulation on their"
    },
    {
      "Time_Start": 2307.0,
      "Time_End": 2315.0,
      "Text": " bodies, particularly in other countries. The ltd.uk one in the United Kingdom is an example"
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2322.0,
      "Text": " of that which only is available to registered limited companies under their registered limited"
    },
    {
      "Time_Start": 2322.0,
      "Time_End": 2329.0,
      "Text": " company name. The .co.uk is open but .lt.uk you must be a registered company to get that"
    },
    {
      "Time_Start": 2329.0,
      "Time_End": 2339.0,
      "Text": " particular name. So people can easily construct a site with a similar domain name and they"
    },
    {
      "Time_Start": 2339.0,
      "Time_End": 2345.0,
      "Text": " could even design it to look like your site. I'm going to use AOL here. Anyone heard of"
    },
    {
      "Time_Start": 2345.0,
      "Time_End": 2352.0,
      "Text": " aolbilling.com which knocked around until it was wiped out recently? It's a site for"
    },
    {
      "Time_Start": 2352.0,
      "Time_End": 2358.0,
      "Text": " AOL users where people are emailing AOL users and saying, oh, we've lost your billing information."
    },
    {
      "Time_Start": 2358.0,
      "Time_End": 2366.0,
      "Text": " Please go to www.aolbilling.com and type in your ID, password, your credit card information,"
    },
    {
      "Time_Start": 2366.0,
      "Time_End": 2372.0,
      "Text": " your mother's maiden name and your national insurance number so we can actually ensure"
    },
    {
      "Time_Start": 2372.0,
      "Time_End": 2380.0,
      "Text": " that you get a faster service. These things happen. You know, I receive such emails going"
    },
    {
      "Time_Start": 2380.0,
      "Time_End": 2385.0,
      "Text": " that doesn't exist anymore. The key thing is this, people could create sites and maybe"
    },
    {
      "Time_Start": 2385.0,
      "Time_End": 2390.0,
      "Text": " even convince people it's a legitimate site. It could be accurate copy for a while before"
    },
    {
      "Time_Start": 2390.0,
      "Time_End": 2397.0,
      "Text": " it got changed, yes. It could be accurate copy before it even got changed. And this"
    },
    {
      "Time_Start": 2397.0,
      "Time_End": 2401.0,
      "Text": " could be combined with news group postings and people could think the site's genuine"
    },
    {
      "Time_Start": 2401.0,
      "Time_End": 2406.0,
      "Text": " and then you could change it and you can do this for search. There's literally internet"
    },
    {
      "Time_Start": 2406.0,
      "Time_End": 2411.0,
      "Text": " hosting companies out there who are willing to just take company orders and give people"
    },
    {
      "Time_Start": 2411.0,
      "Time_End": 2417.0,
      "Text": " one month's free web hosting. They go to that particular company, say, hello, company,"
    },
    {
      "Time_Start": 2417.0,
      "Time_End": 2423.0,
      "Text": " one month's free web hosting, please. I am target company name, please. Here's the information"
    },
    {
      "Time_Start": 2423.0,
      "Time_End": 2428.0,
      "Text": " you'll bill me in one month if I like your service. Please register this domain name."
    },
    {
      "Time_Start": 2428.0,
      "Time_End": 2432.0,
      "Text": " Here's the information. And all that's different is the email address where the registration"
    },
    {
      "Time_Start": 2432.0,
      "Time_End": 2437.0,
      "Text": " document goes to. They go and register it like that. It appears to be the site. It looks"
    },
    {
      "Time_Start": 2437.0,
      "Time_End": 2441.0,
      "Text": " genuine. If anyone does a Whois search on the internet, it is a legitimate site. They"
    },
    {
      "Time_Start": 2441.0,
      "Time_End": 2445.0,
      "Text": " publicize it, put something up which looks genuine, they could just change it before"
    },
    {
      "Time_Start": 2445.0,
      "Time_End": 2450.0,
      "Text": " the month's up to actually get the site actually appearing to change things. And that could"
    },
    {
      "Time_Start": 2450.0,
      "Time_End": 2455.0,
      "Text": " have an effect and the press could easily fall for such a thing. It's a way of hacking"
    },
    {
      "Time_Start": 2455.0,
      "Time_End": 2461.0,
      "Text": " without actually hacking the site and you could get the publicity. So that's it there."
    },
    {
      "Time_Start": 2461.0,
      "Time_End": 2466.0,
      "Text": " So what do you do? Make sure all related domain names you control. If you have a domain name,"
    },
    {
      "Time_Start": 2466.0,
      "Time_End": 2471.0,
      "Text": " use it. Don't use web space off a provider without your domain name. This is a free web"
    },
    {
      "Time_Start": 2471.0,
      "Time_End": 2476.0,
      "Text": " space with a long address because if people are accessing using such a long address, if"
    },
    {
      "Time_Start": 2476.0,
      "Time_End": 2480.0,
      "Text": " someone creates an account with, say, just one number different, it would be very difficult"
    },
    {
      "Time_Start": 2480.0,
      "Time_End": 2487.0,
      "Text": " to tell the difference. And if you find out a site, get it deregistered. Do what AOL did,"
    },
    {
      "Time_Start": 2487.0,
      "Time_End": 2491.0,
      "Text": " which is, well, I assume they did because since they vanished, go and actually get the"
    },
    {
      "Time_Start": 2491.0,
      "Time_End": 2497.0,
      "Text": " thing removed. They will do it in these cases quite quickly and quite easily. Just keep"
    },
    {
      "Time_Start": 2497.0,
      "Time_End": 2502.0,
      "Text": " an eye on what's going on out there. So if you suddenly get new domain names appearing"
    },
    {
      "Time_Start": 2502.0,
      "Time_End": 2508.0,
      "Text": " under your name, go and search them out and get them removed."
    },
    {
      "Time_Start": 2508.0,
      "Time_End": 2515.0,
      "Text": " So that's one thing we can do. There's other ones as well. Search engines. Oh, they're"
    },
    {
      "Time_Start": 2515.0,
      "Time_End": 2522.0,
      "Text": " lovely. Who uses web search engines here? Okay. Who doesn't use web search engines"
    },
    {
      "Time_Start": 2522.0,
      "Time_End": 2531.0,
      "Text": " here? Everybody uses them. Your goal, you're typing keywords, looking for websites. You're"
    },
    {
      "Time_Start": 2531.0,
      "Time_End": 2536.0,
      "Text": " looking for particular words, often defined by meta tags in the page or elements, and"
    },
    {
      "Time_Start": 2536.0,
      "Time_End": 2542.0,
      "Text": " to know to get the site you're looking for. And almost certainly, it's probably not the"
    },
    {
      "Time_Start": 2542.0,
      "Time_End": 2546.0,
      "Text": " site you're looking for, except that gentleman at the back, obviously, who normally gets"
    },
    {
      "Time_Start": 2546.0,
      "Time_End": 2551.0,
      "Text": " those kind of sites. But the key thing to know is the fact that if you go looking for"
    },
    {
      "Time_Start": 2551.0,
      "Time_End": 2559.0,
      "Text": " your company's name, will you get your company's site or will you get your rival's?"
    },
    {
      "Time_Start": 2559.0,
      "Time_End": 2565.0,
      "Text": " How many people here are running consultancies to get people in the top 10 on search engines?"
    },
    {
      "Time_Start": 2565.0,
      "Time_End": 2574.0,
      "Text": " Hands up. No one? You are, right. Normally you find that a lot of people are doing this"
    },
    {
      "Time_Start": 2574.0,
      "Time_End": 2579.0,
      "Text": " now, to order and alter web pages in order to actually get them in the top 10 of the"
    },
    {
      "Time_Start": 2579.0,
      "Time_End": 2584.0,
      "Text": " search engines. But a rival could do a similar sort of thing to jump ahead of you in the"
    },
    {
      "Time_Start": 2584.0,
      "Time_End": 2590.0,
      "Text": " queue. And also the fact this fake site could also jump ahead of a legitimate site. There's"
    },
    {
      "Time_Start": 2590.0,
      "Time_End": 2595.0,
      "Text": " a good number of people who don't go around membering domain names. They just rely upon"
    },
    {
      "Time_Start": 2595.0,
      "Time_End": 2600.0,
      "Text": " the likes of Yahoo and other such systems to actually locate the sites for them and"
    },
    {
      "Time_Start": 2600.0,
      "Time_End": 2605.0,
      "Text": " just type the company names in there, get the information coming back. So in other words,"
    },
    {
      "Time_Start": 2605.0,
      "Time_End": 2611.0,
      "Text": " what I'm saying is keep an eye what's out there. Make sure you register with search"
    },
    {
      "Time_Start": 2611.0,
      "Time_End": 2616.0,
      "Text": " engines. Make sure you're well positioned. Use that gentleman's company services if need"
    },
    {
      "Time_Start": 2617.0,
      "Time_End": 2624.0,
      "Text": " be. I have no financial association with you whatsoever. Or similar people to make sure"
    },
    {
      "Time_Start": 2624.0,
      "Time_End": 2628.0,
      "Text": " that you're well positioned in the search engines. And check regularly for what your"
    },
    {
      "Time_Start": 2628.0,
      "Time_End": 2633.0,
      "Text": " company name pulls up on the web. There could be some embarrassing stuff. It could be your"
    },
    {
      "Time_Start": 2633.0,
      "Time_End": 2638.0,
      "Text": " rivals. Make sure that you're well positioned. And that's the key thing about this. Keep"
    },
    {
      "Time_Start": 2638.0,
      "Time_End": 2645.0,
      "Text": " your eyes open. I could go on about loads of extra things here. And I could go into"
    },
    {
      "Time_Start": 2645.0,
      "Time_End": 2650.0,
      "Text": " more technical ones as well if it was required. But this is supposed to be the newbie thing."
    },
    {
      "Time_Start": 2650.0,
      "Time_End": 2655.0,
      "Text": " The key thing I did for this talk is I wanted to wake people up into thinking about beyond"
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2662.0,
      "Text": " the firewalls. Beyond fortress models. Beyond time-based models. And just think about the"
    },
    {
      "Time_Start": 2662.0,
      "Time_End": 2669.0,
      "Text": " actual setup of your systems on the internet. And regard the internet as your backyard which"
    },
    {
      "Time_Start": 2669.0,
      "Time_End": 2677.0,
      "Text": " you also have to defend. Keep an eye on what's being said out there. Don't just pull down"
    },
    {
      "Time_Start": 2677.0,
      "Time_End": 2684.0,
      "Text": " the blinds and ignore what's not going on in the street. Because what goes on out there"
    },
    {
      "Time_Start": 2684.0,
      "Time_End": 2689.0,
      "Text": " could cause you far more damage than what goes in here. And you've got to bear in mind"
    },
    {
      "Time_Start": 2689.0,
      "Time_End": 2698.0,
      "Text": " that this has happened quite a bit. In particular, anyone here go to Beyond Hope conference?"
    },
    {
      "Time_Start": 2698.0,
      "Time_End": 2707.0,
      "Text": " Anyone to HIP in Holland? A few of us went to HIP. In HIP, someone claimed to hack some"
    },
    {
      "Time_Start": 2707.0,
      "Time_End": 2713.0,
      "Text": " of the HIP sites. And the alter wasn't really a hack. It was a site altered locally in America"
    },
    {
      "Time_Start": 2713.0,
      "Time_End": 2718.0,
      "Text": " and just changed to look like it. So these sort of things are done. And they do get publicity."
    },
    {
      "Time_Start": 2718.0,
      "Time_End": 2724.0,
      "Text": " And people only realize it well after that things weren't really the hack that actually"
    },
    {
      "Time_Start": 2724.0,
      "Time_End": 2729.0,
      "Text": " happened. But after that, it's too late that the embarrassment has occurred."
    },
    {
      "Time_Start": 2729.0,
      "Time_End": 2734.0,
      "Text": " Okay, then. Right. Well, I'm going to take questions now. I think it's a good time to"
    },
    {
      "Time_Start": 2734.0,
      "Time_End": 2740.0,
      "Text": " take a few questions. And I have a few things to pass out to the audience if anyone's interested"
    },
    {
      "Time_Start": 2740.0,
      "Time_End": 2747.0,
      "Text": " from a British conference called DNS. 14th of August, Blackpool, United Kingdom. You"
    },
    {
      "Time_Start": 2747.0,
      "Time_End": 2751.0,
      "Text": " won't get an airfare over there now because the eclipse has finished three days beforehand."
    },
    {
      "Time_Start": 2751.0,
      "Time_End": 2757.0,
      "Text": " So it's probably why I'm plugging it. But I have a few candy bars from it. I have to"
    },
    {
      "Time_Start": 2757.0,
      "Time_End": 2761.0,
      "Text": " throw them out in the audience, but I think I'll injure you all. So I'll be willing to"
    },
    {
      "Time_Start": 2761.0,
      "Time_End": 2765.0,
      "Text": " kind of like throw them down the corridor in the next few minutes after questions if"
    },
    {
      "Time_Start": 2765.0,
      "Time_End": 2768.0,
      "Text": " anyone's interested. Okay. Questions?"
    },
    {
      "Time_Start": 2768.0,
      "Time_End": 2782.0,
      "Text": " You mean about allowing DNS through, particularly port 53? Yeah, we all know about it. It's"
    },
    {
      "Time_Start": 2782.0,
      "Time_End": 2787.0,
      "Text": " an old trick, straight through. Yeah, it can be done that way. It's very much a technical"
    },
    {
      "Time_Start": 2787.0,
      "Time_End": 2793.0,
      "Text": " attack. But yeah, a lot of firewalls essentially operate on a filter-based mechanism and will"
    },
    {
      "Time_Start": 2793.0,
      "Time_End": 2797.0,
      "Text": " allow stuff through. Well, you know, certain people's ones like address translation blow"
    },
    {
      "Time_Start": 2797.0,
      "Time_End": 2802.0,
      "Text": " that one out of the water. Yes, gentleman in blue shirt."
    },
    {
      "Time_Start": 2802.0,
      "Time_End": 2807.0,
      "Text": " I want to say something quickly about going to network solutions and changing somebody"
    },
    {
      "Time_Start": 2807.0,
      "Time_End": 2812.0,
      "Text": " else's registration. Oh, the changing someone else's registration"
    },
    {
      "Time_Start": 2812.0,
      "Time_End": 2820.0,
      "Text": " at network solutions. Oh, that's a good one. Yeah, you can do that. People, when you get"
    },
    {
      "Time_Start": 2820.0,
      "Time_End": 2825.0,
      "Text": " domain names, they have to be able to be transferred and changed, particularly from provider to"
    },
    {
      "Time_Start": 2825.0,
      "Time_End": 2831.0,
      "Text": " provider, changing who's hosting a particular IP, the primary and secondary domain service."
    },
    {
      "Time_Start": 2831.0,
      "Time_End": 2838.0,
      "Text": " So network solutions accept requests to change things, and there are several methods of doing"
    },
    {
      "Time_Start": 2838.0,
      "Time_End": 2846.0,
      "Text": " it, authentication. The most common used one is email address only. You can have PGP signatures,"
    },
    {
      "Time_Start": 2846.0,
      "Time_End": 2851.0,
      "Text": " you can have signatures, but hardly anybody does it."
    },
    {
      "Time_Start": 2852.0,
      "Time_End": 2857.0,
      "Text": " And what happens is you go to the site, put a request to change information, even change"
    },
    {
      "Time_Start": 2857.0,
      "Time_End": 2862.0,
      "Text": " ownership, and they email the email address listed in their document with a confirmation"
    },
    {
      "Time_Start": 2862.0,
      "Time_End": 2867.0,
      "Text": " number, and the person then who gets the email must reply with that confirmation number to"
    },
    {
      "Time_Start": 2867.0,
      "Time_End": 2872.0,
      "Text": " get the thing changed. If you can intercept that email and reply with it, you can change"
    },
    {
      "Time_Start": 2872.0,
      "Time_End": 2877.0,
      "Text": " it. Yeah. Good example of the internet service provider who's broken the internet service"
    },
    {
      "Time_Start": 2878.0,
      "Time_End": 2882.0,
      "Text": " provider's sniffing, because then you can get that going past and reply. Brilliant question."
    },
    {
      "Time_Start": 2882.0,
      "Time_End": 2884.0,
      "Text": " You get a candy bar."
    },
    {
      "Time_Start": 2890.0,
      "Time_End": 2892.0,
      "Text": " See what I mean about these being dangerous? Catch."
    },
    {
      "Time_Start": 2896.0,
      "Time_End": 2898.0,
      "Text": " They make good cudgels as well."
    },
    {
      "Time_Start": 2900.0,
      "Time_End": 2906.0,
      "Text": " They've got a shelf life of about 300 years, so, I mean, they've made sense of pure sugar,"
    },
    {
      "Time_Start": 2906.0,
      "Time_End": 2911.0,
      "Text": " mint flavor, where hackers rock all the way through, and the best thing to point out about"
    },
    {
      "Time_Start": 2911.0,
      "Time_End": 2916.0,
      "Text": " them is that, well, watch your teeth when you try and eat one, that's all I'm going"
    },
    {
      "Time_Start": 2916.0,
      "Time_End": 2921.0,
      "Text": " to say. A gentleman in the black shirt, which is not very identifiable, but hold on a second,"
    },
    {
      "Time_Start": 2921.0,
      "Time_End": 2923.0,
      "Text": " I'm going to try and sit somewhere warm and straight in the front."
    },
    {
      "Time_Start": 2937.0,
      "Time_End": 2949.0,
      "Text": " Yes. I believe you're correct on that. I've always done my changes using the web interface"
    },
    {
      "Time_Start": 2949.0,
      "Time_End": 2956.0,
      "Text": " and then the confirmation back, yeah. Yes. Whether that was wise to tell this audience,"
    },
    {
      "Time_Start": 2956.0,
      "Time_End": 2961.0,
      "Text": " I'm not too sure about. That's all I'm going to say at that point."
    },
    {
      "Time_Start": 2962.0,
      "Time_End": 2969.0,
      "Text": " Yeah, OK, it won't work. You can generally assume that virtually everybody who's involved"
    },
    {
      "Time_Start": 2969.0,
      "Time_End": 2974.0,
      "Text": " in computer security, most of them have actually ensured that their domain names are registered"
    },
    {
      "Time_Start": 2974.0,
      "Time_End": 2979.0,
      "Text": " with a key. You know, it's a simple thing. You will not be able to get DEF CON reassigned."
    },
    {
      "Time_Start": 2979.0,
      "Time_End": 2984.0,
      "Text": " You won't be able to get DNS CON reassigned. You won't be able to get 2600 reassigned,"
    },
    {
      "Time_Start": 2984.0,
      "Time_End": 2989.0,
      "Text": " but you would be able to get Joe Blog Butcher's reassigned or whatever the company happened"
    },
    {
      "Time_Start": 2989.0,
      "Time_End": 2992.0,
      "Text": " to be. Any more questions?"
    },
    {
      "Time_Start": 2992.0,
      "Time_End": 2994.0,
      "Text": " You can do the same thing with round-offs."
    },
    {
      "Time_Start": 2994.0,
      "Time_End": 2996.0,
      "Text": " Oh yes, of course you can."
    },
    {
      "Time_Start": 2996.0,
      "Time_End": 2998.0,
      "Text": " Then you can use that round-off to track other places."
    },
    {
      "Time_Start": 2998.0,
      "Time_End": 3004.0,
      "Text": " Oh yeah, brilliant denial-of-service that. Yeah, the old trick, if you want to do denial-of-service,"
    },
    {
      "Time_Start": 3004.0,
      "Time_End": 3008.0,
      "Text": " you don't do it from your machine, you get other people to denial-of-service your target"
    },
    {
      "Time_Start": 3008.0,
      "Time_End": 3010.0,
      "Text": " by doing that. Yeah, it's a great one."
    },
    {
      "Time_Start": 3010.0,
      "Time_End": 3016.0,
      "Text": " Another bad thing about firewalls is you can usually run a P2P through a port that's open"
    },
    {
      "Time_Start": 3017.0,
      "Time_End": 3022.0,
      "Text": " and actually have a point-and-click tunnel out there in the terminal network."
    },
    {
      "Time_Start": 3022.0,
      "Time_End": 3028.0,
      "Text": " Yes, of course. The old thing about most firewalls is letting things through on a DNS request"
    },
    {
      "Time_Start": 3028.0,
      "Time_End": 3033.0,
      "Text": " through the DNS server outside and back orifice being put over that port. It's an old trick."
    },
    {
      "Time_Start": 3033.0,
      "Time_End": 3038.0,
      "Text": " It's very common being done on that. And it's amazing the number of modern installations"
    },
    {
      "Time_Start": 3038.0,
      "Time_End": 3044.0,
      "Text": " which just allow that to happen. It really is. It's sad, but it's true."
    },
    {
      "Time_Start": 3045.0,
      "Time_End": 3049.0,
      "Text": " The gentleman in the glasses on this side, please."
    },
    {
      "Time_Start": 3057.0,
      "Time_End": 3062.0,
      "Text": " You mean the fact that most people leave their mail servers globally accessible,"
    },
    {
      "Time_Start": 3062.0,
      "Time_End": 3066.0,
      "Text": " so what I can do is externally, my fake email coming from your company,"
    },
    {
      "Time_Start": 3066.0,
      "Time_End": 3071.0,
      "Text": " I actually get your email server to send it straight out?"
    },
    {
      "Time_Start": 3071.0,
      "Time_End": 3078.0,
      "Text": " I've just said that. Yeah. Literally, whenever you use a tool such as Eudora,"
    },
    {
      "Time_Start": 3078.0,
      "Time_End": 3081.0,
      "Text": " you enter in which mail server you're going to be doing your posting from."
    },
    {
      "Time_Start": 3081.0,
      "Time_End": 3088.0,
      "Text": " And as used by a lot of the spam emailers, they use other people's email servers to bounce email off."
    },
    {
      "Time_Start": 3088.0,
      "Time_End": 3092.0,
      "Text": " You don't have to use your own. Most of them have got no defenses set up."
    },
    {
      "Time_Start": 3092.0,
      "Time_End": 3097.0,
      "Text": " It's changing. The spam email industry has forced people to check on this."
    },
    {
      "Time_Start": 3098.0,
      "Time_End": 3102.0,
      "Text": " But I could set up my Eudora account to essentially send the email from your mail server."
    },
    {
      "Time_Start": 3102.0,
      "Time_End": 3107.0,
      "Text": " It would appear more or less that it came from your site at that point."
    },
    {
      "Time_Start": 3107.0,
      "Time_End": 3111.0,
      "Text": " It's still not complete because I still haven't got the sending address,"
    },
    {
      "Time_Start": 3111.0,
      "Time_End": 3116.0,
      "Text": " so you could pick that one up, but it would muddy the waters a bit more."
    },
    {
      "Time_Start": 3119.0,
      "Time_End": 3122.0,
      "Text": " You've had your hand up. Gentleman in the blue shirt."
    },
    {
      "Time_Start": 3123.0,
      "Time_End": 3126.0,
      "Text": " How do you check to see if, say, you've got a company X,"
    },
    {
      "Time_Start": 3126.0,
      "Time_End": 3128.0,
      "Text": " and they have a really stupid app that you can use,"
    },
    {
      "Time_Start": 3128.0,
      "Time_End": 3132.0,
      "Text": " and it's not going to screw with what we need for the record?"
    },
    {
      "Time_Start": 3132.0,
      "Time_End": 3134.0,
      "Text": " How do you check to see if you have it?"
    },
    {
      "Time_Start": 3134.0,
      "Time_End": 3136.0,
      "Text": " Oh, it's easy enough. That's not a problem."
    },
    {
      "Time_Start": 3136.0,
      "Time_End": 3138.0,
      "Text": " Just go and pull your record up on the internet."
    },
    {
      "Time_Start": 3138.0,
      "Time_End": 3141.0,
      "Text": " By default, it won't show it up on the Whois, wherever you've done that."
    },
    {
      "Time_Start": 3141.0,
      "Time_End": 3144.0,
      "Text": " Just put a request in to change it so you have a key."
    },
    {
      "Time_Start": 3144.0,
      "Time_End": 3149.0,
      "Text": " If it turns out that you have a key and you didn't know you have a key, you're in trouble."
    },
    {
      "Time_Start": 3149.0,
      "Time_End": 3154.0,
      "Text": " You've got to do it by the old snail mail method to confirm who you are."
    },
    {
      "Time_Start": 3154.0,
      "Time_End": 3157.0,
      "Text": " That's another good one as well, actually."
    },
    {
      "Time_Start": 3157.0,
      "Time_End": 3159.0,
      "Text": " I shouldn't have mentioned that, should I?"
    },
    {
      "Time_Start": 3159.0,
      "Time_End": 3162.0,
      "Text": " Are all possible facts still changed in any domain?"
    },
    {
      "Time_Start": 3162.0,
      "Time_End": 3166.0,
      "Text": " Not all. You can request that out."
    },
    {
      "Time_Start": 3166.0,
      "Time_End": 3168.0,
      "Text": " I know what you mean at this point."
    },
    {
      "Time_Start": 3168.0,
      "Time_End": 3171.0,
      "Text": " For the average company, yes, it will work."
    },
    {
      "Time_Start": 3171.0,
      "Time_End": 3174.0,
      "Text": " The old letter is a good one as well."
    },
    {
      "Time_Start": 3175.0,
      "Time_End": 3180.0,
      "Text": " Facts. No one ever checks the number the facts came from, do they?"
    },
    {
      "Time_Start": 3180.0,
      "Time_End": 3183.0,
      "Text": " We all know that trick."
    },
    {
      "Time_Start": 3183.0,
      "Time_End": 3186.0,
      "Text": " These are all basic tricks, I'm sure you notice."
    },
    {
      "Time_Start": 3186.0,
      "Time_End": 3189.0,
      "Text": " I don't want to deal too much on network solutions."
    },
    {
      "Time_Start": 3189.0,
      "Time_End": 3194.0,
      "Text": " If I could have a couple of questions which isn't from network solutions as the final question,"
    },
    {
      "Time_Start": 3194.0,
      "Time_End": 3197.0,
      "Text": " because I need to get off for the next set of speakers."
    },
    {
      "Time_Start": 3197.0,
      "Time_End": 3199.0,
      "Text": " Where are the next set of speakers?"
    },
    {
      "Time_Start": 3199.0,
      "Time_End": 3201.0,
      "Text": " Ah, right. Okay."
    },
    {
      "Time_Start": 3201.0,
      "Time_End": 3204.0,
      "Text": " Gentleman in the white shirt. Final question."
    },
    {
      "Time_Start": 3204.0,
      "Time_End": 3213.0,
      "Text": " I was just wondering if you have anything to comment on about black-bowling networks by multiplying routing information."
    },
    {
      "Time_Start": 3213.0,
      "Time_End": 3221.0,
      "Text": " If you're on ISP, you can usually attack a target by advertising a more specific route, say for their website."
    },
    {
      "Time_Start": 3221.0,
      "Time_End": 3227.0,
      "Text": " A lot of the less local ISPs would be social engineers who do ads for a specific route."
    },
    {
      "Time_Start": 3228.0,
      "Time_End": 3231.0,
      "Text": " Oh, yes, adding routes, static routes."
    },
    {
      "Time_Start": 3231.0,
      "Time_End": 3234.0,
      "Text": " Sorry, I'm English, so my pronunciation is a bit different."
    },
    {
      "Time_Start": 3234.0,
      "Time_End": 3236.0,
      "Text": " Yeah, such systems."
    },
    {
      "Time_Start": 3236.0,
      "Time_End": 3238.0,
      "Text": " Like saying, oh, I'm a major system."
    },
    {
      "Time_Start": 3238.0,
      "Time_End": 3244.0,
      "Text": " The way to the entire internet is down this modem line, which happened recently."
    },
    {
      "Time_Start": 3244.0,
      "Time_End": 3248.0,
      "Text": " But, yeah, you can do some attacks based upon that."
    },
    {
      "Time_Start": 3248.0,
      "Time_End": 3251.0,
      "Text": " I'm just wondering whether, I don't think with the time left,"
    },
    {
      "Time_Start": 3251.0,
      "Time_End": 3255.0,
      "Text": " I'm going to have necessarily time to really explain that to the entire audience here,"
    },
    {
      "Time_Start": 3255.0,
      "Time_End": 3260.0,
      "Text": " because there's some really sneaky tactics you can pull off with that."
    },
    {
      "Time_Start": 3260.0,
      "Time_End": 3263.0,
      "Text": " I notice you're smiling there at that point."
    },
    {
      "Time_Start": 3263.0,
      "Time_End": 3269.0,
      "Text": " Yeah, I'm just, it probably wouldn't be wise, and we don't really have the time to go into that."
    },
    {
      "Time_Start": 3269.0,
      "Time_End": 3275.0,
      "Text": " But let's just say the fact, if you go and look that up on the web and have enough time to look at that on TCP IP basics"
    },
    {
      "Time_Start": 3275.0,
      "Time_End": 3281.0,
      "Text": " and the way routes that work, you can cause, essentially, traffic to go round in a circle"
    },
    {
      "Time_Start": 3281.0,
      "Time_End": 3285.0,
      "Text": " and all sorts of nasty tricks to pull off and those sort of things."
    },
    {
      "Time_Start": 3285.0,
      "Time_End": 3293.0,
      "Text": " I did say that was one of the nastiest things, but I said that was the last question,"
    },
    {
      "Time_Start": 3293.0,
      "Time_End": 3297.0,
      "Text": " but I will just take yours, and I mean this is the final question."
    },
    {
      "Time_Start": 3298.0,
      "Time_End": 3301.0,
      "Text": " It seems that if you actually do a really brutal attack,"
    },
    {
      "Time_Start": 3301.0,
      "Time_End": 3304.0,
      "Text": " then the other side is going to be able to react in some way,"
    },
    {
      "Time_Start": 3304.0,
      "Time_End": 3312.0,
      "Text": " but if it was something more subtle, and you get to their site, say, all the way up to 32,"
    },
    {
      "Time_Start": 3312.0,
      "Time_End": 3319.0,
      "Text": " then if it was something like a training or something,"
    },
    {
      "Time_Start": 3319.0,
      "Time_End": 3324.0,
      "Text": " then that would be a really bad thing on your behalf,"
    },
    {
      "Time_Start": 3324.0,
      "Time_End": 3327.0,
      "Text": " because if you go to their site, they wouldn't be able to react."
    },
    {
      "Time_Start": 3327.0,
      "Time_End": 3333.0,
      "Text": " Right. For everyone who didn't quite hear that, I think it was very softly spoken, I may need to point out."
    },
    {
      "Time_Start": 3333.0,
      "Time_End": 3336.0,
      "Text": " It essentially worked in a variant of what was discussed earlier."
    },
    {
      "Time_Start": 3336.0,
      "Time_End": 3339.0,
      "Text": " Essentially, if they've got a financial trading system which is in real time,"
    },
    {
      "Time_Start": 3339.0,
      "Time_End": 3341.0,
      "Text": " it's only got one hop between its targets."
    },
    {
      "Time_Start": 3341.0,
      "Time_End": 3344.0,
      "Text": " If you alter the route so it goes up to 32, you're in deep trouble."
    },
    {
      "Time_Start": 3344.0,
      "Time_End": 3347.0,
      "Text": " Yeah. Simple."
    },
    {
      "Time_Start": 3348.0,
      "Time_End": 3352.0,
      "Text": " All these attacks are generally basically very simple attacks,"
    },
    {
      "Time_Start": 3352.0,
      "Time_End": 3355.0,
      "Text": " but they can cause a hell of a lot of problems,"
    },
    {
      "Time_Start": 3355.0,
      "Time_End": 3358.0,
      "Text": " and that's the thing you need to watch out for."
    },
    {
      "Time_Start": 3358.0,
      "Time_End": 3360.0,
      "Text": " I hope I haven't offended anyone from any companies."
    },
    {
      "Time_Start": 3360.0,
      "Time_End": 3364.0,
      "Text": " Anyone work for a while in the audience?"
    },
    {
      "Time_Start": 3364.0,
      "Time_End": 3368.0,
      "Text": " I might expect my account to vanish now."
    },
    {
      "Time_Start": 3368.0,
      "Time_End": 3373.0,
      "Text": " Oh, thank you. Okay."
    },
    {
      "Time_Start": 3373.0,
      "Time_End": 3375.0,
      "Text": " Okay, that's a very good one."
    },
    {
      "Time_Start": 3375.0,
      "Time_End": 3379.0,
      "Text": " I'll make sure it's off the DNSCon website,"
    },
    {
      "Time_Start": 3379.0,
      "Time_End": 3382.0,
      "Text": " probably because it's more likely to remain up, I think."
    },
    {
      "Time_Start": 3382.0,
      "Time_End": 3391.0,
      "Text": " www.dnscon.org"
    },
    {
      "Time_Start": 3391.0,
      "Time_End": 3395.0,
      "Text": " And I'll put it on forward slash defcon in lowercase."
    },
    {
      "Time_Start": 3395.0,
      "Time_End": 3396.0,
      "Text": " Okay?"
    },
    {
      "Time_Start": 3396.0,
      "Time_End": 3398.0,
      "Text": " So I'll make..."
    },
    {
      "Time_Start": 3398.0,
      "Time_End": 3399.0,
      "Text": " Sorry?"
    },
    {
      "Time_Start": 3399.0,
      "Time_End": 3400.0,
      "Text": " Sorry."
    },
    {
      "Time_Start": 3400.0,
      "Time_End": 3407.0,
      "Text": " www.dnscon.org"
    },
    {
      "Time_Start": 3407.0,
      "Time_End": 3410.0,
      "Text": " forward slash defcon."
    },
    {
      "Time_Start": 3410.0,
      "Time_End": 3411.0,
      "Text": " Okay?"
    },
    {
      "Time_Start": 3411.0,
      "Time_End": 3413.0,
      "Text": " I'll put it up on that site, unless someone wants to tell me"
    },
    {
      "Time_Start": 3413.0,
      "Time_End": 3415.0,
      "Text": " another site directory they want it on."
    },
    {
      "Time_Start": 3415.0,
      "Time_End": 3416.0,
      "Text": " I'll put that up."
    },
    {
      "Time_Start": 3416.0,
      "Time_End": 3418.0,
      "Text": " Remember the fact is my main slides are in England,"
    },
    {
      "Time_Start": 3418.0,
      "Time_End": 3420.0,
      "Text": " so you're going to have to wait for me to get back."
    },
    {
      "Time_Start": 3420.0,
      "Time_End": 3423.0,
      "Text": " It's going to be about two weeks until I get back to the United Kingdom,"
    },
    {
      "Time_Start": 3423.0,
      "Time_End": 3425.0,
      "Text": " so I'll have them up there."
    },
    {
      "Time_Start": 3425.0,
      "Time_End": 3427.0,
      "Text": " If anyone wants to email me,"
    },
    {
      "Time_Start": 3427.0,
      "Time_End": 3430.0,
      "Text": " I'll put an email address up on the same page."
    },
    {
      "Time_Start": 3430.0,
      "Time_End": 3433.0,
      "Text": " It'll be about a week or so, unless someone wants to actually see me now"
    },
    {
      "Time_Start": 3433.0,
      "Time_End": 3436.0,
      "Text": " to get my email address."
    },
    {
      "Time_Start": 3436.0,
      "Time_End": 3437.0,
      "Text": " Okay?"
    },
    {
      "Time_Start": 3437.0,
      "Time_End": 3439.0,
      "Text": " Right, well, I'm just going to throw a few things out in the audience,"
    },
    {
      "Time_Start": 3439.0,
      "Time_End": 3440.0,
      "Text": " if anyone's interested."
    },
    {
      "Time_Start": 3440.0,
      "Time_End": 3442.0,
      "Text": " Anyone want anything?"
    },
    {
      "Time_Start": 3442.0,
      "Time_End": 3444.0,
      "Text": " Oh, good grief."
    },
    {
      "Time_Start": 3444.0,
      "Time_End": 3445.0,
      "Text": " All right."
    },
    {
      "Time_Start": 3475.0,
      "Time_End": 3477.0,
      "Text": " Hold this tight in here."
    },
    {
      "Time_Start": 3477.0,
      "Time_End": 3478.0,
      "Text": " Tighter."
    },
    {
      "Time_Start": 3481.0,
      "Time_End": 3482.0,
      "Text": " Ready?"
    },
    {
      "Time_Start": 3482.0,
      "Time_End": 3483.0,
      "Text": " There."
    },
    {
      "Time_Start": 3483.0,
      "Time_End": 3484.0,
      "Text": " Duck."
    },
    {
      "Time_Start": 3485.0,
      "Time_End": 3487.0,
      "Text": " And one to this quarter, since if not,"
    },
    {
      "Time_Start": 3487.0,
      "Time_End": 3489.0,
      "Text": " that is the only one we want to get in that quarter."
    },
    {
      "Time_Start": 3489.0,
      "Time_End": 3490.0,
      "Text": " Ready?"
    },
    {
      "Time_Start": 3490.0,
      "Time_End": 3491.0,
      "Text": " Ready?"
    },
    {
      "Time_Start": 3491.0,
      "Time_End": 3492.0,
      "Text": " Catch."
    },
    {
      "Time_Start": 3492.0,
      "Time_End": 3493.0,
      "Text": " Final one."
    },
    {
      "Time_Start": 3493.0,
      "Time_End": 3494.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 3496.0,
      "Time_End": 3498.0,
      "Text": " Right there, well, thank you for listening,"
    },
    {
      "Time_Start": 3498.0,
      "Time_End": 3500.0,
      "Text": " and I hope you've enjoyed the talk."
    },
    {
      "Time_Start": 3500.0,
      "Time_End": 3502.0,
      "Text": " Thank you."
    }
  ]
}