{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome to the annual Defcon Convention. This meeting was held in exciting Las Vegas, Nevada from July 9 through the 11th, 1999. This is videotape number 7."
    },
    {
      "Time_Start": 14.0,
      "Time_End": 43.0,
      "Text": " I don't know. Those of you in the back, can you hear us? Okay."
    },
    {
      "Time_Start": 43.0,
      "Time_End": 65.0,
      "Text": " Okay. We're going to get started now. My name's Gail Thackeray. For those of you who don't know, it doesn't count if you're trying to spot a fed. It doesn't count if you spot us because we're both wearing law enforcement insignia. You don't get a t-shirt for recognizing us."
    },
    {
      "Time_Start": 65.0,
      "Time_End": 86.0,
      "Text": " He wore his undercover outfit today. I'm Gail Thackeray. I'm with the Arizona Attorney General's Office and this is Kevin Higgins who is with the Nevada Attorney General's Office. Kevin is going to lead off by giving you some very useful information since you're attending this conference."
    },
    {
      "Time_Start": 86.0,
      "Time_End": 101.0,
      "Text": " Nevada has some very interesting laws that you should know about and he's going to give you some survival skills for getting through the weekend unbusted. Kevin Higgins."
    },
    {
      "Time_Start": 101.0,
      "Time_End": 122.0,
      "Text": " I'm not sure the Attorney General knows that's the reason I'm here today. This is by way of background. I've been with the AG's office 14 years now. I've been doing the high tech stuff for a couple years. Before that, I was in charge of death penalty prosecutions. I used to get people executed. Now I do other things. It's a little change of pace."
    },
    {
      "Time_Start": 122.0,
      "Time_End": 149.0,
      "Text": " You have to understand here in Nevada, you're in the old west. Most things weren't against the law. A lot of things aren't against the law. Things become against the law because somebody gets angry or mad or you do the wrong thing. We'll talk about that briefly. I should also give a disclaimer. Any views I represent today are not necessarily the views of the Nevada Attorney General, the Nevada Department of Justice, or anybody else besides myself."
    },
    {
      "Time_Start": 152.0,
      "Time_End": 181.0,
      "Text": " We're going to spend a little time about the only things you got in trouble for in Nevada. Cheating and gambling is a bad thing. It's still a bad thing. I wouldn't recommend that this weekend. Stealing cows is a really bad thing. Up in northern Nevada, there aren't a lot of repeat offenders. They find their horses in their trucks but not much else. Scaring the tourist is also discouraged. We try to avoid that."
    },
    {
      "Time_Start": 182.0,
      "Time_End": 192.0,
      "Text": " As loud as I can, I'll try to talk louder. There's no big volume knob up here to turn up. I'm sorry. If there was a big knob, I would do that."
    },
    {
      "Time_Start": 192.0,
      "Time_End": 217.0,
      "Text": " Nevada Attorney General's office kind of got thrust into the high tech issue when we discovered an employee of an unnamed state agency was using his technical expertise to gasp, cheat at gaming. It's a bad thing. He had gone and he was an employee of the Nevada Gaming Control Board. Any Nevada Gaming Control Board employees here today? Alright, you could out him if they were here."
    },
    {
      "Time_Start": 217.0,
      "Time_End": 235.0,
      "Text": " He figured out how to reprogram the EPROMs in slot machines. Not that you heard it here, but if you go into a casino and you look at all those slot machines, you're looking at a really big network. They know which machines are paying off, which machines are busted. Nobody plays nifty nickels anymore, so we're getting rid of it."
    },
    {
      "Time_Start": 235.0,
      "Time_End": 257.0,
      "Text": " Back in the old days, there were actual mechanical reels and the reel spinning determined little mechanical random number generator. The pins would go into the reels, bing, bing, bing, you won, you lost. Even the ones that look like they have reels today really don't have reels. There's a random number generator built in, a little EPROM chip. I'm probably telling people way too much."
    },
    {
      "Time_Start": 257.0,
      "Time_End": 283.0,
      "Text": " One thing the Gaming Control Board does is they check to make sure that that's an authorized random number generator program. Well, Mr. Harris figured out a way, there's a little slack on the EPROM, he figured out a way to put his own little program in there. He had a coin drop sequence, and if he dropped the coins in the right sequence, 2, 3, 2, 3, 1, 2, 3, it maxed out the jackpot."
    },
    {
      "Time_Start": 284.0,
      "Time_End": 305.0,
      "Text": " And so he was maxing out jackpots, and his friends were maxing out jackpots all over Nevada. The reason he got caught is he got greedy, and from a law enforcement point of view, that's how most people get caught. They get greedy, they brag, they tell people they think they're friends that aren't their friends, and they get caught."
    },
    {
      "Time_Start": 305.0,
      "Time_End": 328.0,
      "Text": " He went to Atlantic City, he knew there was a way to scam a Keno game in Atlantic City. He found out it really wasn't a random number generator, that it was a predictable cycle on the Keno machine. So he sat in the hotel room, had his laptop running, saw the sequence come up, went down, made his bet, won $100,000. And Mr. Harris got caught because he wanted it in cash. Casinos don't pay out cash for $100,000."
    },
    {
      "Time_Start": 329.0,
      "Time_End": 344.0,
      "Text": " So if any of you have got the Keno machine rigged, they don't pay out cash, you get a check, they get ID, they get your picture. He was so insistent, hotel security eventually goes into his hotel room, and to their surprise, the Keno numbers are coming up on his laptop before they're coming up on the Keno system."
    },
    {
      "Time_Start": 344.0,
      "Time_End": 371.0,
      "Text": " So Mr. Harris got caught, and got arrested. The gaming control board was somewhat chagrined and embarrassed. He was the head of technical services that was supposed to stop this sort of thing. We did a search warrant, we got his computer, and that's where our problems started. Local Metro, the first thing they found was this disk that said cheating program on it. Hey! So they whip it into their computer, and it just burns the hell out of it. I mean, it fries the hard drive."
    },
    {
      "Time_Start": 371.0,
      "Time_End": 378.0,
      "Text": " Number one, if you're in law enforcement, do not run the program that says cheating program."
    },
    {
      "Time_Start": 378.0,
      "Time_End": 398.0,
      "Text": " The second thing they found, they got his hard drive. We couldn't get into his hard drive. Anybody from the FBI here? We sent it to Quantico, they couldn't get into the hard drive. One of our guys had gone to a law enforcement training thing, we got into the hard drive, found out his whole scam, convicted him."
    },
    {
      "Time_Start": 398.0,
      "Time_End": 413.0,
      "Text": " He snitched off all his friends, and they've been prosecuted too. So we kind of got into the high tech prosecution thing through the back door. I think Mr. Harris, for the most part, is going to be an exception to the norm."
    },
    {
      "Time_Start": 413.0,
      "Time_End": 433.0,
      "Text": " Where local law enforcement is going to run into computers and computer crime, and we do it all the time here, we find guys that are making meth, they've got their accounts receivable and accounts payable on their laptop. They're running a spreadsheet. Joe sold 10 grams, he owes me this much. Joe sold 5 grams, he hasn't paid me. I owe this much money."
    },
    {
      "Time_Start": 433.0,
      "Time_End": 453.0,
      "Text": " We find this, you know, it used to be kept in little slips of paper, you know, they'd lose them, it was hard to do your urine report, you know, so we get these guys, they've got the recipes, they've downloaded it off the internet, either to make good meth or bad meth, if they know what they're doing. You know they're doing good meth and bad meth, thank you, that's good to know."
    },
    {
      "Time_Start": 453.0,
      "Time_End": 468.0,
      "Text": " And they catch them all the time, and it's much more efficient for us because they have the list of all their customers there. Most of the meth guys aren't smart enough to use code names, you know, Stinky owes me, it's Kevin Higgins owes me."
    },
    {
      "Time_Start": 468.0,
      "Time_End": 488.0,
      "Text": " The other place we run into it is people killing their relatives. They oftentimes will have a little diary somewhere that says my wife really needs to be killed, I gotta kill my wife. They think they have it hidden in the slack somewhere. There are two or three law enforcement types in Nevada that are smart enough to look at the slack on the hard drive and find that stuff out."
    },
    {
      "Time_Start": 488.0,
      "Time_End": 508.0,
      "Text": " We had a dead apartment manager in Reno, one right between the eyes, over his desk, they go in, the screensaver's on, they get through the password on the screensaver, and lo and behold, guess whose account is up there, you know, Joe Smith's account, three months in the red, they go and find Joe, and of course he's the guy that offed the apartment manager."
    },
    {
      "Time_Start": 508.0,
      "Time_End": 534.0,
      "Text": " So, you know, it's kind of low tech, and the way we look at it, there's a lot of people that are doing old crimes using computers. They're, you know, keeping their meth records, they're writing, you know, buy new, skit, poison, they have their shopping lists on the computer, you find them, they've got their financial records. You find some new kind of crimes going on. We've had a couple of the short bus guys that have, you know, lured teenage girls to Nevada with vague promises."
    },
    {
      "Time_Start": 534.0,
      "Time_End": 563.0,
      "Text": " I'm sure nobody has made vague promises in chat rooms here to meet somebody of the opposite sex, right? I'm glad to know that. And like I said, you know, things are pretty open in Nevada until, frankly, you piss somebody off, okay? And last bill, we just passed a new bill in the legislature on high tech crime, and I can tell you where about half the stuff came from. There's now a crime in Nevada to strip the header information off your email. We catch you doing it, it's a misdemeanor. Yay! That's got to be a Fed back there."
    },
    {
      "Time_Start": 564.0,
      "Time_End": 579.0,
      "Text": " And the reason is that an African American state legislator was getting racist hate mail that the header was stripped off of. Nobody knows who sent it to him, so he introduces a bill and it's now a crime to strip the header information. So, he made, somebody made him mad."
    },
    {
      "Time_Start": 579.0,
      "Time_End": 601.0,
      "Text": " Forfeiture. We can now, if we arrest you for any computer-related crime, we can forfeit any piece of equipment you've got and keep it. And the reason that happened is they caught a guy in Reno that was hacking cable boxes. He had like 300 cable boxes he'd hacked, so it got, you know, the political agenda and all that stuff. And they convicted him of his misdemeanor crime, and as he walks out the door, he says, I want my boxes back."
    },
    {
      "Time_Start": 601.0,
      "Time_End": 616.0,
      "Text": " And the prosecutor kind of starts sputtering and realizes that the forfeiture statute doesn't include cable boxes or electronic components. So, the guy got his misdemeanor, he got 300 boxes back though. So, TCI wasn't happy and they got their little bit put in the bill."
    },
    {
      "Time_Start": 616.0,
      "Time_End": 631.0,
      "Text": " Theft of computer services is illegal. Encryption in order to commit a crime is illegal. So, if we catch you committing a crime and you've been doing kiddie porn stuff and you've encrypted it and were eventually able to get through it, you've actually committed a separate crime by encrypting it."
    },
    {
      "Time_Start": 631.0,
      "Time_End": 657.0,
      "Text": " Most of these guys are not the Kevin Poulsons of the world that we catch. You know, their password is on a sticky note on their, you know, right on their monitor. It's, you know, fluffy or whatever. And, like I was talking to Gail about, one of the things I do is I teach kind of intro to prison 101 at the juvenile center up in Reno."
    },
    {
      "Time_Start": 658.0,
      "Time_End": 677.0,
      "Text": " And, you know, this is what life is like to be in prison, guys. Maybe you've got to straighten up your life. And this kid in the back goes, hey, man, you never catch the smart ones. And, well, you know, junior, you're right here in custody. So, we probably don't catch the really, really smart ones in state law enforcement, but we catch the dumb ones and the short bus guys we catch all the time."
    },
    {
      "Time_Start": 677.0,
      "Time_End": 694.0,
      "Text": " So, I'll let Gail do her bit. I'm happy to answer questions. And you can ask the prosecutor a question and I reserve the right to decline to answer it. So, thank you for your time. It's been interesting here. And I think I'm the only one with a tie on today, so."
    },
    {
      "Time_Start": 694.0,
      "Time_End": 709.0,
      "Text": " We are not feds. We are state agency, but we are government and we are here to help you."
    },
    {
      "Time_Start": 709.0,
      "Time_End": 730.0,
      "Text": " True. Now, look, you just found out something you didn't know about Nevada law. I'm going to tell you just a few minutes worth of things. I have read some of the most astoundingly bad legal advice I have ever seen in my life off the net. Get a real lawyer, will you?"
    },
    {
      "Time_Start": 731.0,
      "Time_End": 754.0,
      "Text": " Let me explain a little bit about the Electronic Communications Privacy Act, because I'll bet that a lot of you, I see a lot of the confusion in the discussion forums out there, a lot of you do not realize that this is a very unusual statute. You've heard about the Fourth and Fifth Amendments and how if police do things wrong, maybe stuff will get suppressed and it can't be used against you."
    },
    {
      "Time_Start": 754.0,
      "Time_End": 777.0,
      "Text": " Well, the wiretap statutes, starting with the Federal Electronic Communications Privacy Act, are unique. There, there is a suppression rule that applies not just to the police, but to private citizens. And it has very sharp pointy teeth that you need to know about just to get through life with a computer, a video camera, for example. And we'll go to that in a minute."
    },
    {
      "Time_Start": 777.0,
      "Time_End": 799.0,
      "Text": " Now I'm going to do a little question of my own here. How many of you, from either reading or just, you know, what you see in the press or just your natural instincts, how many of you think that it's really shocking that Kevin Mitnick has been held this long without a trial? Until his guilty plea, of course."
    },
    {
      "Time_Start": 799.0,
      "Time_End": 819.0,
      "Text": " Okay? Now, of those who put their hands up, how many of you have asked Kevin Mitnick how many times he consented to delay his trial? You see, there's something that none of the pro-Mitnick folks are mentioning out there in all these hacked webpages and Free Kevin stuff."
    },
    {
      "Time_Start": 819.0,
      "Time_End": 840.0,
      "Text": " What they're forgetting to mention is that when a person is arrested in state court, in federal court, they are facing charges and they have a right to a speedy trial. Now the number of days may be different in each state, but Kevin could not have been held this long if he had not asked for those delays."
    },
    {
      "Time_Start": 841.0,
      "Time_End": 862.0,
      "Text": " So the rule is, if the defendant wants a speedy trial, the prosecution and the courts have got to work together to give it to him. And there are some exceptions to that. You know, somebody getting sick, like the defense attorney or star witness, might delay part of the trial. There are lots of reasons why there might be a delay. But the point is, the defendant, by and large, controls when he goes to trial."
    },
    {
      "Time_Start": 863.0,
      "Time_End": 869.0,
      "Text": " So ask Kevin how many times he's shown up in court or his attorney on his behalf and consented to the delay."
    },
    {
      "Time_Start": 870.0,
      "Time_End": 893.0,
      "Text": " Secondly, Kevin was held without bond. How many people think that was unfair? Come on, you guys have been saying different stuff out there than that. A lot of people are complaining that it's outrageous that Kevin Mitnick was not allowed release before his trial. Well, you know what? He was on release when he skipped. Duh."
    },
    {
      "Time_Start": 894.0,
      "Time_End": 910.0,
      "Text": " Nothing that happens to you in your trial is going to be as bad as skipping and then getting caught and coming back to face new charges and the old charges. Judges don't look kindly on people who skip bond, so don't do it if you don't want to get held without bond."
    },
    {
      "Time_Start": 911.0,
      "Time_End": 925.0,
      "Text": " Now, one of my personal favorites, besides the fractured legal advice I get off the net, is hacker handles or whatever you call those means you all give yourselves. We all give ourselves. I have one, too. And no one will tell you what it is."
    },
    {
      "Time_Start": 926.0,
      "Time_End": 944.0,
      "Text": " But when you are arrested, what effect do you think it has on the jury if the testimony from your friends, relations, your own records, maybe your own webpage, is that your name is the Angel of Destruction? Good."
    },
    {
      "Time_Start": 945.0,
      "Time_End": 959.0,
      "Text": " How about something thief? This is good. People use the most amazing handles, and they probably think they're very powerful at the time, but we get a lot of amusement out of them when we're doing our search warrants."
    },
    {
      "Time_Start": 960.0,
      "Time_End": 981.0,
      "Text": " Now, let's go on to the most important thing we can talk about today, the ECPA. Basically, the wiretap statutes, and there are some variations by state, but let's talk about the federal one because you need to understand it at the thimble level that we're doing all our legal advice on today, because it applies to all of us."
    },
    {
      "Time_Start": 982.0,
      "Time_End": 995.0,
      "Text": " It is the minimum threshold by the federal statute. It is the minimum threshold of protection that we are all entitled to as we go around using phones, using computers, and talking to each other, communicating."
    },
    {
      "Time_Start": 996.0,
      "Time_End": 1001.0,
      "Text": " The federal statute says the states can give more protection, but they can't give less."
    },
    {
      "Time_Start": 1002.0,
      "Time_End": 1016.0,
      "Text": " So, here are the basic protections. We're having an oral conversation if we're talking in this room face-to-face. We're having a wire conversation if the human voice is being transmitted over a wire microwave. We don't care what the form is."
    },
    {
      "Time_Start": 1017.0,
      "Time_End": 1029.0,
      "Text": " Now, this is a kind of technically inaccurate convention, but what you need to know about these two is wire communications and oral communications are protected at the very highest level."
    },
    {
      "Time_Start": 1030.0,
      "Time_End": 1043.0,
      "Text": " As government, we cannot intercept those without something that is much harder to get than a search warrant. We call it a search warrant on steroids. You have to have everything you need for a search warrant, plus a lot of other stuff."
    },
    {
      "Time_Start": 1046.0,
      "Time_End": 1054.0,
      "Text": " Now, the reason this should interest you is, first of all, you use communications every day and you want to be protected. Your privacy, you want protected."
    },
    {
      "Time_Start": 1055.0,
      "Time_End": 1066.0,
      "Text": " The second thing you need to know is, when you're doing some of the things that people take naturally, like filming each other with video cameras, you may unwittingly step into wiretap territory."
    },
    {
      "Time_Start": 1067.0,
      "Time_End": 1082.0,
      "Text": " The statute says that you shall not use a device, which may be a video camera with a sound on, to intercept communications without the consent of a party. That's the federal. Some states require all parties."
    },
    {
      "Time_Start": 1082.0,
      "Time_End": 1097.0,
      "Text": " Unless you have the consent of a party, or are they in a place where there's no reasonable expectation of privacy. There's that phrase again that you heard in the first talk. Reasonable expectation of privacy would not be out there where anybody can overhear you."
    },
    {
      "Time_Start": 1098.0,
      "Time_End": 1111.0,
      "Text": " It would be on a telephone. It would be on an internet phone. Internet phone, even though it's going out electronically, which is the third kind of communication, is protected at that high level because a human voice is talking."
    },
    {
      "Time_Start": 1112.0,
      "Time_End": 1136.0,
      "Text": " Now, the last thing I want to tell you, because we really don't have time to do the whole statute and we want to give everybody time for questions, is that if you violate someone else's wire or oral communication privacy, and it's been ten years that we started routinely writing wiretap tools into search warrants in hacker cases because we find those routinely."
    },
    {
      "Time_Start": 1137.0,
      "Time_End": 1153.0,
      "Text": " Not only can you be prosecuted for the wiretap violation and served, and your thoughtful Congress has given statutory damages against even a civilian wiretapper, just as against the government, but you cannot use that evidence."
    },
    {
      "Time_Start": 1153.0,
      "Time_End": 1167.0,
      "Text": " The classic case where this comes up is the annoyed boyfriend, girlfriend, spouse decides to wiretap the family phone or some other phone to find out what their beloved object is up to."
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1189.0,
      "Text": " They cannot use that in court, even if there's no state action. If a thief steals a document, he can deliver it to the police and say, you know, I know I'm going to get in trouble for this, but I was doing a burglary last night and I saw this plot to kill someone and my conscience will not allow me to let this go, so I'm giving it to you."
    },
    {
      "Time_Start": 1190.0,
      "Time_End": 1206.0,
      "Text": " Well, we can use that and investigate. There's no state action, the police have done nothing wrong in most states. Under the federal wiretap statute, it's no good to you to wiretap someone else because if you get caught, not only can you get prosecuted and sued, but you can't use it."
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1214.0,
      "Text": " No court will admit, except to prosecute you for violating that statute. That's how high the privacy level is."
    },
    {
      "Time_Start": 1218.0,
      "Time_End": 1222.0,
      "Text": " How does this affect employers and employees?"
    },
    {
      "Time_Start": 1223.0,
      "Time_End": 1233.0,
      "Text": " Employers have certain exceptions within the wiretap statute. The wiretap statute is one of these things that says thou shalt not, but then you look at the exceptions."
    },
    {
      "Time_Start": 1233.0,
      "Time_End": 1242.0,
      "Text": " And employers and employees is a different situation because there are exceptions that cover regular business use of certain communications facilities."
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1251.0,
      "Text": " The phone company has the right to listen too because there's another exception that covers them for protecting the network from fraud and abuse, protecting users."
    },
    {
      "Time_Start": 1251.0,
      "Time_End": 1262.0,
      "Text": " So the telephone company has a limited right to listen in. They don't have a right to listen in to see if you're committing a crime just randomly, but if they're investigating something, they may have that right."
    },
    {
      "Time_Start": 1262.0,
      "Time_End": 1267.0,
      "Text": " Now the final thing I want to say about electronic communications, because this is widely misunderstood."
    },
    {
      "Time_Start": 1267.0,
      "Time_End": 1272.0,
      "Text": " Electronic communications, and let's just use email as the most common one."
    },
    {
      "Time_Start": 1272.0,
      "Time_End": 1281.0,
      "Text": " Employers, right now the way the case law is working, employers can read your email and use it even if they promised you they wouldn't."
    },
    {
      "Time_Start": 1281.0,
      "Time_End": 1289.0,
      "Text": " There was a case out of Pennsylvania, the Pillsbury case, where they told the employee, we don't read email, it's confidential, we'll never use it against you."
    },
    {
      "Time_Start": 1289.0,
      "Time_End": 1293.0,
      "Text": " They did, they fired the guy, and the court upheld it."
    },
    {
      "Time_Start": 1293.0,
      "Time_End": 1300.0,
      "Text": " So do not say anything on your boss' email systems that you don't want to read in the paper or have used against you."
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1310.0,
      "Text": " Okay, now I don't want to go into detail there. If any of you have questions, I cannot give legal advice as a member of government, and I don't think Kevin can, to individual people."
    },
    {
      "Time_Start": 1310.0,
      "Time_End": 1317.0,
      "Text": " And I need to repeat the same disclaimer that these are, anything I say here is not the opinion of my boss or my office."
    },
    {
      "Time_Start": 1317.0,
      "Time_End": 1323.0,
      "Text": " It may not even be my opinion if we get into an argument, but we'll try to answer questions."
    },
    {
      "Time_Start": 1323.0,
      "Time_End": 1329.0,
      "Text": " Now, for Kevin, if you have any questions about Nevada law or anything else, is available in semi."
    },
    {
      "Time_Start": 1329.0,
      "Time_End": 1338.0,
      "Text": " And since we have a virtual schedule here, obviously, I think we'll hold the questions down to about 10 minutes so we don't trample too much on the next speaker."
    },
    {
      "Time_Start": 1338.0,
      "Time_End": 1340.0,
      "Text": " Okay, we'll be less or so minutes."
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1347.0,
      "Text": " Oh, okay, I'll be less or so minutes."
    },
    {
      "Time_Start": 1347.0,
      "Time_End": 1350.0,
      "Text": " Is the guy that knows the difference between bad meth and good meth, does he have a question?"
    },
    {
      "Time_Start": 1350.0,
      "Time_End": 1352.0,
      "Text": " No, he doesn't have a question."
    },
    {
      "Time_Start": 1353.0,
      "Time_End": 1379.0,
      "Text": " If the FBI does it, it's obviously a foreign counterintelligence emergency."
    },
    {
      "Time_Start": 1380.0,
      "Time_End": 1382.0,
      "Text": " I'm going to attempt to answer these."
    },
    {
      "Time_Start": 1382.0,
      "Time_End": 1383.0,
      "Text": " Yes."
    },
    {
      "Time_Start": 1383.0,
      "Time_End": 1393.0,
      "Text": " Okay, somebody breaks into a system, installs a sniffer design, and steals passwords. Is that a violation of the privacy of the user who has those passwords, and would you prosecute them?"
    },
    {
      "Time_Start": 1393.0,
      "Time_End": 1398.0,
      "Text": " That's a direct violation of Nevada law, whoops, to break into anybody's system for any reason."
    },
    {
      "Time_Start": 1398.0,
      "Time_End": 1404.0,
      "Text": " To break in, to alter, to view, to steal data of any sort is a felony in Nevada, so we would prosecute."
    },
    {
      "Time_Start": 1404.0,
      "Time_End": 1407.0,
      "Text": " Big Doug."
    },
    {
      "Time_Start": 1407.0,
      "Time_End": 1408.0,
      "Text": " Thank you."
    },
    {
      "Time_Start": 1408.0,
      "Time_End": 1424.0,
      "Text": " It's been said a number of times this week that if a computer system has been intruded into, that the system administrator can capture information and disclose that to law enforcement."
    },
    {
      "Time_Start": 1424.0,
      "Time_End": 1437.0,
      "Text": " My understanding of ECPA is that there is some liability, or potential liability, in the system administrator's part for doing that. Is that consistent with your understanding?"
    },
    {
      "Time_Start": 1437.0,
      "Time_End": 1440.0,
      "Text": " Partly."
    },
    {
      "Time_Start": 1440.0,
      "Time_End": 1456.0,
      "Text": " Okay, the question was, if someone breaks into a computer system, can the system administrator capture the information, do a sniffer for example, capture their information and then turn it over to law enforcement? Is that accurate?"
    },
    {
      "Time_Start": 1456.0,
      "Time_End": 1461.0,
      "Text": " The answer to that is the thing they teach you on your first day in law school. It depends."
    },
    {
      "Time_Start": 1462.0,
      "Time_End": 1474.0,
      "Text": " The statute gives the system administrator the right to do whatever they need, by and large. Now remember, we're talking real thumbnail law here. There are always exceptions to anything, as you heard earlier today."
    },
    {
      "Time_Start": 1474.0,
      "Time_End": 1489.0,
      "Text": " But the rough answer is the statute specifically gives system administrators, network operators, who have the responsibility for keeping it running, the ability, the legal right to do whatever that takes, including watching incoming keystrokes."
    },
    {
      "Time_Start": 1489.0,
      "Time_End": 1508.0,
      "Text": " Now in the famous Legion of Doom case that was prosecuted out of Atlanta, Georgia, that was actually done. There were some keystroke captures going on, but at that point the law was so new that the prosecutors did not want, basically, that evidence because they didn't need it."
    },
    {
      "Time_Start": 1508.0,
      "Time_End": 1512.0,
      "Text": " They didn't use it in a way that I think today we'd all be much more comfortable with."
    },
    {
      "Time_Start": 1512.0,
      "Time_End": 1527.0,
      "Text": " Now there are some states, now remember states all have an equivalent of the ECPA. There are some states that might require the system administrator to insist on a subpoena or search warrant. Some states would actually require a search warrant if it's personally identifiable information."
    },
    {
      "Time_Start": 1527.0,
      "Time_End": 1534.0,
      "Text": " We don't have an ECPA here in Nevada because nobody's gotten PO'd yet."
    },
    {
      "Time_Start": 1534.0,
      "Time_End": 1552.0,
      "Text": " Wiretap said, Nevada's an odd state for a lot of reasons, but one-on-one conversations, I'm fully free, it's one-party consent, so if I'm talking to you in the privacy of your home and you say, let's go blow up the World Trade Center, man, I can tape that and use it."
    },
    {
      "Time_Start": 1552.0,
      "Time_End": 1560.0,
      "Text": " Telephone communications, on the other hand, is a two-party consent state, so except answering machines, that's another story."
    },
    {
      "Time_Start": 1560.0,
      "Time_End": 1562.0,
      "Text": " Up here in the front row."
    },
    {
      "Time_Start": 1562.0,
      "Time_End": 1574.0,
      "Text": " I have an initial complaint. It says that the first engineering facility was for any purposes. Does that mean that you can't impact our own systems?"
    },
    {
      "Time_Start": 1574.0,
      "Time_End": 1581.0,
      "Text": " Because it would be violating the security of the law if it was agreed by someone else."
    },
    {
      "Time_Start": 1581.0,
      "Time_End": 1592.0,
      "Text": " Do you know if that was agreed by someone else or if that's being considered unauthorized by the system?"
    },
    {
      "Time_Start": 1592.0,
      "Time_End": 1597.0,
      "Text": " Well, I helped write the Nevada law this last session, and we said it's against the law to hack into a system."
    },
    {
      "Time_Start": 1597.0,
      "Time_End": 1606.0,
      "Text": " There's no exception in the law if you're hacking into your own system. We hadn't considered people hacking into their own systems, so I kind of doubt a prosecutor would do anything with that, but that's an interesting point."
    },
    {
      "Time_Start": 1606.0,
      "Time_End": 1612.0,
      "Text": " Of course, in Nevada, it is against the law to commit suicide, so we will prosecute you if you do that."
    },
    {
      "Time_Start": 1612.0,
      "Time_End": 1634.0,
      "Text": " The guidelines are all about math. Do you have a question?"
    },
    {
      "Time_Start": 1634.0,
      "Time_End": 1651.0,
      "Text": " The federal statute uses the word intercept and defines it quite clearly as capturing. It doesn't say you have to understand it, and in fact, there's a portion of the statute that was added to the original wiretap statutes from the ECPA, the first version of it was enacted."
    },
    {
      "Time_Start": 1651.0,
      "Time_End": 1669.0,
      "Text": " For example, if we had a legal wiretap order in Arizona, a court-supervised wiretap order, if some gibberish comes across the line that we can't understand, the statute actually allows you to grab it and intercept it and then do after-the-fact minimization,"
    },
    {
      "Time_Start": 1669.0,
      "Time_End": 1683.0,
      "Text": " which means that you can't use it or listen to it or display it or send it to people and disclose it if it's not relevant to what the court has ordered you to have, but we can capture it and then decipher it later, basically."
    },
    {
      "Time_Start": 1683.0,
      "Time_End": 1709.0,
      "Text": " I should have mentioned earlier in the ECPA that there are three crimes. One is interception, two is disclosing, and three is using. So if Newt Gingrich hadn't been a politician, he could have gotten rich off the press people who disclosed what his statements over the cell phone were, maybe, we're all arguing about this, because the statute does not have any press exception in it."
    },
    {
      "Time_Start": 1710.0,
      "Time_End": 1737.0,
      "Text": " If a reporter hacks into your stuff or tape records you in such a way that it's a violation of the statute, we're all debating this, but there's nothing in the statute that says there's a First Amendment press exception. The statute's quite clear. It's very, very sharp-pointed teeth and very strict definition. So it'll be interesting to see if that happens, but Newt obviously wasn't going to take on the press. But at $10,000 per offense, he could have been very, very rich if he had won that issue."
    },
    {
      "Time_Start": 1738.0,
      "Time_End": 1739.0,
      "Text": " How about the guy in the back?"
    },
    {
      "Time_Start": 1740.0,
      "Time_End": 1741.0,
      "Text": " The guy in the back."
    },
    {
      "Time_Start": 1742.0,
      "Time_End": 1743.0,
      "Text": " The blue shirt."
    },
    {
      "Time_Start": 1767.0,
      "Time_End": 1778.0,
      "Text": " I'm going to repeat the question."
    },
    {
      "Time_Start": 1779.0,
      "Time_End": 1782.0,
      "Text": " Well, repeat the question."
    },
    {
      "Time_Start": 1783.0,
      "Time_End": 1793.0,
      "Text": " Well, the presumption is we get an anonymous tip that somebody's got porno and we get a search warrant and a search machine. Well, we'll take that for the assumption that we wouldn't do it."
    },
    {
      "Time_Start": 1794.0,
      "Time_End": 1808.0,
      "Text": " Well, sure. Anonymous tip isn't enough for us to get a search warrant, but outside of that, we get a complaint from somebody that the guy in the big blue shirt, whoever, I've been on the website and he sent me something. So let's say we got enough to get a search warrant."
    },
    {
      "Time_Start": 1809.0,
      "Time_End": 1813.0,
      "Text": " And you're asking if finding back orifice on his machine is a defense?"
    },
    {
      "Time_Start": 1814.0,
      "Time_End": 1821.0,
      "Text": " Well, it basically would be a defense to the crime. It doesn't mean you didn't commit the crime. It would be up to you to prove the defense somehow."
    },
    {
      "Time_Start": 1822.0,
      "Time_End": 1832.0,
      "Text": " Of course, as soon as the existence of back orifice was a defense, I'm sure every pedophile in the country would just automatically put back orifice on their machine and say, obviously my enemy did this to me on purpose."
    },
    {
      "Time_Start": 1833.0,
      "Time_End": 1842.0,
      "Text": " Of course, it's kind of hard if you've got, you know, CDs you've burnt and you've got your huge kiddie porn CD collection to claim that, you know, somebody did that to me when I wasn't looking."
    },
    {
      "Time_Start": 1847.0,
      "Time_End": 1854.0,
      "Text": " Do you have any CDs? No? Okay. I shouldn't ask any incriminating questions. I promise I'll do that. Way in the back over here, the guy that looks like a fed."
    },
    {
      "Time_Start": 1862.0,
      "Time_End": 1869.0,
      "Text": " If somebody comes to you as a kind of cop, why do you have to know who they are? Do you have to know who they are?"
    },
    {
      "Time_Start": 1869.0,
      "Time_End": 1884.0,
      "Text": " In my opinion, no and no. I mean, you're on an open public forum that anybody can log into, and that's the old, yeah, before I sell you the dope, man, are you a cop? You know, the cop doesn't have to tell you the truth. No."
    },
    {
      "Time_Start": 1884.0,
      "Time_End": 1891.0,
      "Text": " What if you're a cop and you don't have any experience here without being arrested?"
    },
    {
      "Time_Start": 1891.0,
      "Time_End": 1903.0,
      "Text": " You mean, do they have to tell the truth then, you're asking? Our Supreme Court here in Nevada, our Supreme Court here in Nevada says cops can tell you anything they want and to deceive you into telling them, so they don't have to tell you the truth."
    },
    {
      "Time_Start": 1904.0,
      "Time_End": 1921.0,
      "Text": " Is there a legitimate expectation of privacy in a closed IRC? You know, I don't know. I suppose if it was limited to four people, you knew the four people, and somebody was posing as the fourth person that really wasn't the fourth person, it might be a question."
    },
    {
      "Time_Start": 1921.0,
      "Time_End": 1933.0,
      "Text": " But I don't know how you prove that you had that legitimate expectation of privacy, because you can't ID that person by looking at the computer screen. You don't know who it is other than their handle, right?"
    },
    {
      "Time_Start": 1933.0,
      "Time_End": 1942.0,
      "Text": " Well, sure, I mean, you know, ask them questions, I guess, but that's an open forum, pretty much."
    },
    {
      "Time_Start": 1942.0,
      "Time_End": 1947.0,
      "Text": " Who's kind of shifty looking? I'll ask them a question. Way over there."
    },
    {
      "Time_Start": 1948.0,
      "Time_End": 1953.0,
      "Text": " I'm going to ask you a question again. You've got the right to indicate what you've got."
    },
    {
      "Time_Start": 1953.0,
      "Time_End": 1968.0,
      "Text": " If you've got another identity that you're ready to give to a cop, or a lady, or an officer, as you consider what you want to do, and they're all there, you've got a right to decide what you want to do."
    },
    {
      "Time_Start": 1968.0,
      "Time_End": 1975.0,
      "Text": " Okay, I'm sure most of you didn't hear that. It was a kind of statement."
    },
    {
      "Time_Start": 1976.0,
      "Time_End": 1990.0,
      "Text": " Roughly to the effect that Kevin Mitnick and his attorney certainly did, at some point, contribute to the delays in their trial, but the prosecution had made it difficult for them to have access to the evidence."
    },
    {
      "Time_Start": 1990.0,
      "Time_End": 2004.0,
      "Text": " Well, in Arizona, as in many states, but don't take this for gospel, because you always need to check the jurisdiction you're in, and the feds play by completely different rules, we have a discovery process that goes on before trial."
    },
    {
      "Time_Start": 2004.0,
      "Time_End": 2012.0,
      "Text": " Basically, they get to see everything that we have. We are theoretically able to see what they have, although that doesn't happen as often."
    },
    {
      "Time_Start": 2012.0,
      "Time_End": 2023.0,
      "Text": " The defense can always ask if they want to for a delay because the prosecution hasn't provided evidence, and the courts will not deny that."
    },
    {
      "Time_Start": 2024.0,
      "Time_End": 2036.0,
      "Text": " Sometimes it's inescapable. For example, in a homicide where somebody is arrested right away, there may be DNA evidence required, and as we all know from the OJ trial, that may take a while."
    },
    {
      "Time_Start": 2036.0,
      "Time_End": 2040.0,
      "Text": " So you're not going to have the DNA results the day after the test, the arrest."
    },
    {
      "Time_Start": 2040.0,
      "Time_End": 2048.0,
      "Text": " You're not going to always have your computer forensics available right at the point where the rules say you should give discovery."
    },
    {
      "Time_Start": 2048.0,
      "Time_End": 2060.0,
      "Text": " But in Arizona, for example, if the prosecution hasn't provided everything, then we have an ongoing duty, according to the rules of court, to continue to provide it as we get it."
    },
    {
      "Time_Start": 2060.0,
      "Time_End": 2067.0,
      "Text": " And the defense has the same obligation in our state, because Arizona is not a trial-by-ambush state."
    },
    {
      "Time_Start": 2067.0,
      "Time_End": 2073.0,
      "Text": " The court rules discourage that, and in fact, they're broadening the discovery rules all the time."
    },
    {
      "Time_Start": 2074.0,
      "Time_End": 2088.0,
      "Text": " Basically, I don't know what the prosecution did in the Mitney case, but in any criminal trial, there's a great deal of investigating that goes on by both sides after the arrest, and that's sometimes what occasions the delay."
    },
    {
      "Time_Start": 2088.0,
      "Time_End": 2090.0,
      "Text": " Whoever has requested the delay."
    },
    {
      "Time_Start": 2090.0,
      "Time_End": 2096.0,
      "Text": " The point is, the defense can always force the prosecution to honor the speedy trial rules."
    },
    {
      "Time_Start": 2096.0,
      "Time_End": 2101.0,
      "Text": " And there are, as I said, some exceptions, but the courts make the decisions."
    },
    {
      "Time_Start": 2101.0,
      "Time_End": 2103.0,
      "Text": " The prosecution does not."
    },
    {
      "Time_Start": 2103.0,
      "Time_End": 2106.0,
      "Text": " Okay, we have another speech coming up."
    },
    {
      "Time_Start": 2106.0,
      "Time_End": 2109.0,
      "Text": " Is there anyone who's running this?"
    },
    {
      "Time_Start": 2109.0,
      "Time_End": 2110.0,
      "Text": " No? Okay."
    },
    {
      "Time_Start": 2110.0,
      "Time_End": 2112.0,
      "Text": " We don't have a schedule for five, so..."
    },
    {
      "Time_Start": 2112.0,
      "Time_End": 2113.0,
      "Text": " Okay."
    },
    {
      "Time_Start": 2113.0,
      "Time_End": 2114.0,
      "Text": " We'll just keep going."
    },
    {
      "Time_Start": 2114.0,
      "Time_End": 2115.0,
      "Text": " Pick one."
    },
    {
      "Time_Start": 2115.0,
      "Time_End": 2118.0,
      "Text": " Somebody want to comment on how nice my tie is?"
    },
    {
      "Time_Start": 2118.0,
      "Time_End": 2119.0,
      "Text": " No? Okay."
    },
    {
      "Time_Start": 2121.0,
      "Time_End": 2123.0,
      "Text": " Over here in the front row."
    },
    {
      "Time_Start": 2127.0,
      "Time_End": 2133.0,
      "Text": " There will be a statement to the effect that by clicking on this, it means that you've released the owner of this website."
    },
    {
      "Time_Start": 2133.0,
      "Time_End": 2135.0,
      "Text": " Liability or something like that."
    },
    {
      "Time_Start": 2135.0,
      "Time_End": 2139.0,
      "Text": " I'm wondering if those statements are going to be legal or not."
    },
    {
      "Time_Start": 2139.0,
      "Time_End": 2145.0,
      "Text": " Well, releases are an interesting thing, and you can't consent necessarily to something that's like..."
    },
    {
      "Time_Start": 2145.0,
      "Time_End": 2154.0,
      "Text": " If you get on a ride, like an amusement park ride, and they know it's broken, and they say, sign a consent, and if you get killed, that that consent is not legally effective."
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2160.0,
      "Text": " By analogy, if they know that link's bad, and they're just trying to get you to go somewhere, and they think that's going to cover them."
    },
    {
      "Time_Start": 2160.0,
      "Time_End": 2167.0,
      "Text": " Depends on how full the disclaimer is, but for the most part, I think you can still get sued."
    },
    {
      "Time_Start": 2167.0,
      "Time_End": 2169.0,
      "Text": " I don't think it protects you too much."
    },
    {
      "Time_Start": 2169.0,
      "Time_End": 2171.0,
      "Text": " Do you have one on your website that says that?"
    },
    {
      "Time_Start": 2171.0,
      "Time_End": 2172.0,
      "Text": " No?"
    },
    {
      "Time_Start": 2172.0,
      "Time_End": 2178.0,
      "Text": " The linking and click-through and disclaimer waiver stuff is all completely up in the air right now,"
    },
    {
      "Time_Start": 2179.0,
      "Time_End": 2188.0,
      "Text": " because the civil lawyers are having a fine time battling that out, and I think we all have to wait and just watch the cases as they come through and see how people sort that out."
    },
    {
      "Time_Start": 2188.0,
      "Time_End": 2192.0,
      "Text": " I haven't asked anybody over here."
    },
    {
      "Time_Start": 2192.0,
      "Time_End": 2194.0,
      "Text": " Brown shirt."
    },
    {
      "Time_Start": 2195.0,
      "Time_End": 2201.0,
      "Text": " Assuming that your system is secure, and not your system is secure, how do you defend the right to consent?"
    },
    {
      "Time_Start": 2201.0,
      "Time_End": 2209.0,
      "Text": " And you talk about the pool that you see across the board of lawyers, and the division that you have there, and that includes all the customers,"
    },
    {
      "Time_Start": 2209.0,
      "Time_End": 2217.0,
      "Text": " who lost 100% of their card data, even though you were not acting on that data, and you had no legal basis to do that."
    },
    {
      "Time_Start": 2217.0,
      "Time_End": 2223.0,
      "Text": " Well, again, all of these situations are very fact-specific, kind of like Fourth Amendment situations."
    },
    {
      "Time_Start": 2223.0,
      "Time_End": 2230.0,
      "Text": " But if the statute, if they're acting in a way that the statute says they may do to protect their system,"
    },
    {
      "Time_Start": 2230.0,
      "Time_End": 2234.0,
      "Text": " and the statute also says they can't just do random monitoring because they feel like it."
    },
    {
      "Time_Start": 2234.0,
      "Time_End": 2241.0,
      "Text": " The phone company can't start listening to telephone calls to see if anybody's ripping them off as a practice."
    },
    {
      "Time_Start": 2241.0,
      "Time_End": 2246.0,
      "Text": " But when an incident is occurring that's a legitimate investigation, they can capture."
    },
    {
      "Time_Start": 2246.0,
      "Time_End": 2257.0,
      "Text": " Now, the real question, both for criminal and civil liability, would be what if they improperly use information that they have captured that's not relevant to the investigation."
    },
    {
      "Time_Start": 2257.0,
      "Time_End": 2263.0,
      "Text": " So system administrators dealing with an incident, whether you're a government agency administrator or corporate,"
    },
    {
      "Time_Start": 2263.0,
      "Time_End": 2269.0,
      "Text": " the first thing you should do at the sign of an incident where you're going to tackle any of this is run for the lawyers."
    },
    {
      "Time_Start": 2269.0,
      "Time_End": 2273.0,
      "Text": " Prosecutors, if you're a cop, run for the civil people, the corporate counsel."
    },
    {
      "Time_Start": 2273.0,
      "Time_End": 2280.0,
      "Text": " If you're a system administrator in a corporation, there's a lot of very touchy liability stuff that just isn't settled yet."
    },
    {
      "Time_Start": 2284.0,
      "Time_End": 2287.0,
      "Text": " In all fairness, is there a woman here that would like to ask a question?"
    },
    {
      "Time_Start": 2287.0,
      "Time_End": 2289.0,
      "Text": " Oh, here's one."
    },
    {
      "Time_Start": 2289.0,
      "Time_End": 2291.0,
      "Text": " All right, here we go."
    },
    {
      "Time_Start": 2291.0,
      "Time_End": 2307.0,
      "Text": " The question was, when do people, do people, or when do they have to notify you that they're going to be listening to your conversations?"
    },
    {
      "Time_Start": 2307.0,
      "Time_End": 2315.0,
      "Text": " There are some states that have, either by statute or by case law, that have all-party consent, meaning if there are five people in the conversation,"
    },
    {
      "Time_Start": 2315.0,
      "Time_End": 2317.0,
      "Text": " phone company? Okay."
    },
    {
      "Time_Start": 2317.0,
      "Time_End": 2321.0,
      "Text": " If there are five people in the conversation, all five have to know and agree."
    },
    {
      "Time_Start": 2321.0,
      "Time_End": 2331.0,
      "Text": " Now, if you're in a state like that, then the question would be, do they have this supervisor, phone company, system administrator exception?"
    },
    {
      "Time_Start": 2331.0,
      "Time_End": 2336.0,
      "Text": " When we use phone, by the way, now, I no longer care whether it's a phone company or any of the other media,"
    },
    {
      "Time_Start": 2336.0,
      "Time_End": 2344.0,
      "Text": " because with all these media converging and internet phone, just, you know, we'll use phone as a generic term for people talking with their voices."
    },
    {
      "Time_Start": 2344.0,
      "Time_End": 2350.0,
      "Text": " So that would be a question that would be completely dependent on the individual state,"
    },
    {
      "Time_Start": 2350.0,
      "Time_End": 2358.0,
      "Text": " and both the exception and what legislation we may have that governs system administrators in an all-party consent state."
    },
    {
      "Time_Start": 2358.0,
      "Time_End": 2367.0,
      "Text": " Just by way of information, here in Nevada, it's much easier for me to get a trap and trace than it is to get a full phone tap to listen to what you have."
    },
    {
      "Time_Start": 2367.0,
      "Time_End": 2376.0,
      "Text": " So I can figure out who's calling you and who you're calling with hardly any effort at all to convince somebody to issue me a warrant."
    },
    {
      "Time_Start": 2376.0,
      "Time_End": 2381.0,
      "Text": " I may or shouldn't tell you this, it's extremely difficult here in Nevada. Yes?"
    },
    {
      "Time_Start": 2381.0,
      "Time_End": 2391.0,
      "Text": " I was wondering if that's a possibility that you can say that I know that there have been a lot of search warrants investigated in investigations in something like the New York Times now,"
    },
    {
      "Time_Start": 2391.0,
      "Time_End": 2400.0,
      "Text": " or that other nationwide investigations are required. I'm wondering if you think the number of searches compared to the number of records is odd,"
    },
    {
      "Time_Start": 2400.0,
      "Time_End": 2404.0,
      "Text": " and it seems superficial. Would there have been an insight to talk about the potential for searches,"
    },
    {
      "Time_Start": 2404.0,
      "Time_End": 2409.0,
      "Text": " and if so, what's actually being done to talk about it?"
    },
    {
      "Time_Start": 2409.0,
      "Time_End": 2424.0,
      "Text": " The question was, well let me see if I can state this right, it related to the number of searches that are done in relation to the number of arrests that arise out of those search warrants, would that be accurate?"
    },
    {
      "Time_Start": 2425.0,
      "Time_End": 2435.0,
      "Text": " Okay, yeah. We've heard already from Able Counsel on the other side, what a search warrant requires."
    },
    {
      "Time_Start": 2435.0,
      "Time_End": 2440.0,
      "Text": " Basically, they have to go to the judge and they have to have something called probable cause."
    },
    {
      "Time_Start": 2440.0,
      "Time_End": 2450.0,
      "Text": " Probable cause to believe a crime is being committed, and probable cause to believe evidence of the crime will be found in the place where the evidence is stored."
    },
    {
      "Time_Start": 2450.0,
      "Time_End": 2460.0,
      "Text": " Now one of the misconceptions that I see every time there's a hacker bust from 1980-something on out to today is, well they did a search warrant and nobody's arrested."
    },
    {
      "Time_Start": 2460.0,
      "Time_End": 2465.0,
      "Text": " That's why they call it a search warrant. They're still looking."
    },
    {
      "Time_Start": 2465.0,
      "Time_End": 2475.0,
      "Text": " And in that situation, perhaps there are five search warrants done in a case, and one person may be arrested out of that, and that person may not have been in any of the five locations searched."
    },
    {
      "Time_Start": 2475.0,
      "Time_End": 2482.0,
      "Text": " But a judge makes that initial determination, is there enough to justify going to this place to look?"
    },
    {
      "Time_Start": 2482.0,
      "Time_End": 2488.0,
      "Text": " There's no punishment for guessing wrong or not finding the stuff."
    },
    {
      "Time_Start": 2488.0,
      "Time_End": 2493.0,
      "Text": " For example, the bad guys knew you were coming and they took off with the meth lab and now you find an empty house."
    },
    {
      "Time_Start": 2493.0,
      "Time_End": 2501.0,
      "Text": " So a lot of search warrants either are part of a larger case and you can't really tie the location to who eventually gets arrested."
    },
    {
      "Time_Start": 2502.0,
      "Time_End": 2508.0,
      "Text": " Conversely, there are cases where we do one search warrant and out of the evidence we find there, 20 people get arrested."
    },
    {
      "Time_Start": 2508.0,
      "Time_End": 2518.0,
      "Text": " An example of that would be a wiretap. It's not uncommon in a drug wiretap for us to wind up with, say, 60 people being indicted out of one that's essentially a search warrant."
    },
    {
      "Time_Start": 2518.0,
      "Time_End": 2520.0,
      "Text": " Yeah, you had a follow-up?"
    },
    {
      "Time_Start": 2520.0,
      "Time_End": 2549.0,
      "Text": " Okay, the question was, are the number of searches in hacking computer-related cases comparable to other types of complex cases, such as drug cases?"
    },
    {
      "Time_Start": 2549.0,
      "Time_End": 2559.0,
      "Text": " I really couldn't answer that because one of the things you find is that the press, and this isn't an insult, but the press is very hot on the bust, you know?"
    },
    {
      "Time_Start": 2559.0,
      "Time_End": 2563.0,
      "Text": " The press almost never falls up on what happened in that case."
    },
    {
      "Time_Start": 2563.0,
      "Time_End": 2574.0,
      "Text": " So you may have great publicity on some search and then without going to the courthouse, you couldn't find out that everybody involved in the case pled guilty quietly with no publicity."
    },
    {
      "Time_Start": 2574.0,
      "Time_End": 2583.0,
      "Text": " The other thing I want to say is that the federal wiretap statutes, which some people are looking at on this, are there more searches than there are indictments."
    },
    {
      "Time_Start": 2583.0,
      "Time_End": 2585.0,
      "Text": " They report the results of those annually."
    },
    {
      "Time_Start": 2585.0,
      "Time_End": 2592.0,
      "Text": " The numbers, this is why you have to remember that statistics lie, the numbers are wildly inaccurate."
    },
    {
      "Time_Start": 2592.0,
      "Time_End": 2600.0,
      "Text": " When you read the press saying that they did, I forget what the number is, but they did 10,000 more wiretaps in the last decade than the one before."
    },
    {
      "Time_Start": 2600.0,
      "Time_End": 2603.0,
      "Text": " Well, you know what happened in the last decade? Pages."
    },
    {
      "Time_Start": 2604.0,
      "Time_End": 2609.0,
      "Text": " We have to get a full-blown wiretap order to get the numbers off the pager."
    },
    {
      "Time_Start": 2609.0,
      "Time_End": 2617.0,
      "Text": " And you know what? There's lots more pagers than there used to be, but does that mean there are gazillions of people being listened to?"
    },
    {
      "Time_Start": 2617.0,
      "Time_End": 2622.0,
      "Text": " If you take the pager statistics out, then you see the true number of wiretaps."
    },
    {
      "Time_Start": 2622.0,
      "Time_End": 2625.0,
      "Text": " And the same problem with the computer search warrants."
    },
    {
      "Time_Start": 2625.0,
      "Time_End": 2634.0,
      "Text": " One of our frustrations in law enforcement is the FBI has never, when we've asked them somehow because nobody could define it as part of the problem, they don't track."
    },
    {
      "Time_Start": 2634.0,
      "Time_End": 2638.0,
      "Text": " We don't have a reporting mechanism for who gets arrested for computer crime."
    },
    {
      "Time_Start": 2638.0,
      "Time_End": 2643.0,
      "Text": " We don't have a reporting mechanism the way we do for wiretap from how many search warrants are executed."
    },
    {
      "Time_Start": 2643.0,
      "Time_End": 2645.0,
      "Text": " There's no way to look this stuff up."
    },
    {
      "Time_Start": 2646.0,
      "Time_End": 2653.0,
      "Text": " Not to harp on the FBI, but if you don't know, state law enforcement always harps on the FBI and other feds."
    },
    {
      "Time_Start": 2653.0,
      "Time_End": 2655.0,
      "Text": " There's what's called a uniform crime reporting form."
    },
    {
      "Time_Start": 2655.0,
      "Time_End": 2660.0,
      "Text": " So everybody that gets murdered or stabbed or sexually assaulted here in Nevada, it gets reported."
    },
    {
      "Time_Start": 2660.0,
      "Time_End": 2663.0,
      "Text": " And the FBI, of course, says statistics are down 7%."
    },
    {
      "Time_Start": 2663.0,
      "Time_End": 2669.0,
      "Text": " Nobody gets reported for computer crime, break-ins, white-collar crime, your average insurance fraud."
    },
    {
      "Time_Start": 2669.0,
      "Time_End": 2671.0,
      "Text": " There's no box to check on the form."
    },
    {
      "Time_Start": 2671.0,
      "Time_End": 2673.0,
      "Text": " So, violent crimes down."
    },
    {
      "Time_Start": 2673.0,
      "Time_End": 2676.0,
      "Text": " Nobody's, that's a nice wave, by the way."
    },
    {
      "Time_Start": 2676.0,
      "Time_End": 2679.0,
      "Text": " Nobody is reporting and keeping track of whether white-collar fraud is."
    },
    {
      "Time_Start": 2679.0,
      "Time_End": 2688.0,
      "Text": " And on our level, I think that some of those people that used to do the stop-and-robs that are marginally trainable, maybe the medium-sized bus,"
    },
    {
      "Time_Start": 2688.0,
      "Time_End": 2693.0,
      "Text": " it's not that hard to get on the internet and find out these scams and commit a white-collar scam."
    },
    {
      "Time_Start": 2693.0,
      "Time_End": 2696.0,
      "Text": " Something happens here in Nevada, I can tell you it's happening in a casino right this very second."
    },
    {
      "Time_Start": 2696.0,
      "Time_End": 2702.0,
      "Text": " Somebody has broken into a mailbox in Las Vegas somewhere, stolen somebody's check they've made out to the power company,"
    },
    {
      "Time_Start": 2702.0,
      "Time_End": 2707.0,
      "Text": " has scanned it, reprinted it, changed the name on it, and is passing bad paper every casino in town."
    },
    {
      "Time_Start": 2707.0,
      "Time_End": 2712.0,
      "Text": " That doesn't take a lot of hacker expertise to do, but it's safer than robbing the 7-Eleven."
    },
    {
      "Time_Start": 2712.0,
      "Time_End": 2716.0,
      "Text": " You don't get shot, and you're probably not going to prison, and you're not going to get a gun enhancement."
    },
    {
      "Time_Start": 2716.0,
      "Time_End": 2720.0,
      "Text": " So, those statistics are just so misleading, I don't know how to keep track of it."
    },
    {
      "Time_Start": 2720.0,
      "Time_End": 2723.0,
      "Text": " Now, the guy with the nice wave, the Aryan youth over here."
    },
    {
      "Time_Start": 2726.0,
      "Time_End": 2734.0,
      "Text": " What are some of the stipulations on the fact that websites accumulate good information and pass it on to other agencies?"
    },
    {
      "Time_Start": 2734.0,
      "Time_End": 2736.0,
      "Text": " Pretty much spam."
    },
    {
      "Time_Start": 2736.0,
      "Time_End": 2744.0,
      "Text": " In Nevada, as of June 8th, an internet service provider cannot give your information out to anybody else without committing a misdemeanor."
    },
    {
      "Time_Start": 2744.0,
      "Time_End": 2746.0,
      "Text": " Now, does that mean they're not doing it? No."
    },
    {
      "Time_Start": 2746.0,
      "Time_End": 2753.0,
      "Text": " But, you'd be surprised how hard it is to get a list of every ISP in Nevada, like in the phone books."
    },
    {
      "Time_Start": 2753.0,
      "Time_End": 2759.0,
      "Text": " It is technically now against the law for them to send out confidential information or even your web address without your consent."
    },
    {
      "Time_Start": 2759.0,
      "Time_End": 2764.0,
      "Text": " But, lots of things get made into laws that don't have big enforcement problems."
    },
    {
      "Time_Start": 2764.0,
      "Time_End": 2769.0,
      "Text": " We've got like two minutes, so there has to be a really great question."
    },
    {
      "Time_Start": 2769.0,
      "Time_End": 2772.0,
      "Text": " The guy in the black thinks he's got a really great question."
    },
    {
      "Time_Start": 2803.0,
      "Time_End": 2805.0,
      "Text": " I'll let Gail answer. I don't know what the FBI's rules are."
    },
    {
      "Time_Start": 2805.0,
      "Time_End": 2808.0,
      "Text": " In Nevada, we don't have those rules. We can take the equipment."
    },
    {
      "Time_Start": 2808.0,
      "Time_End": 2812.0,
      "Text": " The problem is, 20 years ago, cops got into forfeiting stuff, right?"
    },
    {
      "Time_Start": 2812.0,
      "Time_End": 2816.0,
      "Text": " We all end up with warehouses full of Yugos that we couldn't do anything with."
    },
    {
      "Time_Start": 2816.0,
      "Time_End": 2818.0,
      "Text": " It's the same way with computer equipment."
    },
    {
      "Time_Start": 2818.0,
      "Time_End": 2823.0,
      "Text": " You take every system you get, pretty soon you've got a warehouse full of computer boxes that nobody has the time to look at anyway."
    },
    {
      "Time_Start": 2823.0,
      "Time_End": 2826.0,
      "Text": " So, we, for the most part, have quit taking it."
    },
    {
      "Time_Start": 2826.0,
      "Time_End": 2828.0,
      "Text": " If it's a child porno guy, we take his equipment."
    },
    {
      "Time_Start": 2828.0,
      "Time_End": 2832.0,
      "Text": " But, you know, we think it's a medical billing company that's ripping off Medicare."
    },
    {
      "Time_Start": 2832.0,
      "Time_End": 2837.0,
      "Text": " We just go in and keep a copy of the hard drive, because there's no way for us to haul that equipment away."
    },
    {
      "Time_Start": 2845.0,
      "Time_End": 2848.0,
      "Text": " Well, we threaten to do it, but no, we don't do it."
    },
    {
      "Time_Start": 2851.0,
      "Time_End": 2854.0,
      "Text": " I can't tell you what the FBI's doing. We don't do it here."
    },
    {
      "Time_Start": 2854.0,
      "Time_End": 2858.0,
      "Text": " The question, or the argument here, has been going back and forth a little bit."
    },
    {
      "Time_Start": 2858.0,
      "Time_End": 2860.0,
      "Text": " Now, this really is the last question, folks."
    },
    {
      "Time_Start": 2860.0,
      "Time_End": 2867.0,
      "Text": " It has been going back and forth a little bit on why we see some computers and not others, for example."
    },
    {
      "Time_Start": 2867.0,
      "Time_End": 2870.0,
      "Text": " That whole area of forensics is evolving."
    },
    {
      "Time_Start": 2870.0,
      "Time_End": 2875.0,
      "Text": " And, hopefully, with the help of the people who are writing better forensics tools,"
    },
    {
      "Time_Start": 2875.0,
      "Time_End": 2881.0,
      "Text": " and people who are writing better law, including some of the now beginning to be computer literate judges,"
    },
    {
      "Time_Start": 2881.0,
      "Time_End": 2886.0,
      "Text": " we will have this worked out so it's a basis of equality for both sides."
    },
    {
      "Time_Start": 2886.0,
      "Time_End": 2892.0,
      "Text": " Don't forget, the defense also has access to the evidence, even if it's in the prosecution's hands."
    },
    {
      "Time_Start": 2892.0,
      "Time_End": 2898.0,
      "Text": " We don't even have very good procedures worked out for how we share looking at that evidence"
    },
    {
      "Time_Start": 2898.0,
      "Time_End": 2900.0,
      "Text": " without causing each other's cases problems."
    },
    {
      "Time_Start": 2900.0,
      "Time_End": 2904.0,
      "Text": " This is definitely an evolving field, computer forensics."
    },
    {
      "Time_Start": 2905.0,
      "Time_End": 2910.0,
      "Text": " There are a couple groups that teach it, one even certifies it,"
    },
    {
      "Time_Start": 2910.0,
      "Time_End": 2914.0,
      "Text": " but there's no consensus yet on what is the right thing to do in each circumstance."
    },
    {
      "Time_Start": 2914.0,
      "Time_End": 2918.0,
      "Text": " And that's partly because every system, every situation is unique."
    },
    {
      "Time_Start": 2918.0,
      "Time_End": 2919.0,
      "Text": " That's the only answer I can give you."
    },
    {
      "Time_Start": 2919.0,
      "Time_End": 2923.0,
      "Text": " Now, we can't take more questions because it wouldn't be fair to the next speaker, who I want to hear."
    },
    {
      "Time_Start": 2923.0,
      "Time_End": 2928.0,
      "Text": " But, I will be here. I will be around until Sunday afternoon."
    },
    {
      "Time_Start": 2928.0,
      "Time_End": 2934.0,
      "Text": " Kevin has to leave, but we can't, as we said, we can't give legal advice."
    },
    {
      "Time_Start": 2934.0,
      "Time_End": 2937.0,
      "Text": " We're just kind of doing the best we can to answer questions."
    },
    {
      "Time_Start": 2937.0,
      "Time_End": 2943.0,
      "Text": " And I'll be around, and feel free to come up and ask later, but we do have to give the next speaker time, so thanks."
    },
    {
      "Time_Start": 2943.0,
      "Time_End": 2948.0,
      "Text": " Oh, and after all the speeches are over and before the evening events,"
    },
    {
      "Time_Start": 2948.0,
      "Time_End": 2955.0,
      "Text": " there will be a reunion of the people in 602 and 502A codes who are on probation and are not supposed to be here."
    },
    {
      "Time_Start": 2955.0,
      "Time_End": 2956.0,
      "Text": " I'll see you in the bar."
    },
    {
      "Time_Start": 2958.0,
      "Time_End": 2959.0,
      "Text": " Thank you."
    }
  ]
}