{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.8,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good afternoon everyone. Welcome to Policy at DEF CON. This is Navigating the Digital"
    },
    {
      "Time_Start": 5.8,
      "Time_End": 10.64,
      "Text": " Frontier, Advancing Cyber Diplomacy in a Connected World, moderated by Christopher"
    },
    {
      "Time_Start": 10.64,
      "Time_End": 15.38,
      "Text": " Painter. So a few announcements before we begin. This talk is being hosted on the record,"
    },
    {
      "Time_Start": 15.38,
      "Time_End": 21.62,
      "Text": " it's being recorded. So as such, please make sure your cell phones are silenced. And uh,"
    },
    {
      "Time_Start": 21.62,
      "Time_End": 25.32,
      "Text": " and if you ask a question, please come up to the mic and speak into it so that way we can"
    },
    {
      "Time_Start": 25.32,
      "Time_End": 31.18,
      "Text": " capture it in the recording. Um, also as a policy, uh, please make sure if you take any"
    },
    {
      "Time_Start": 31.18,
      "Time_End": 35.42,
      "Text": " photos you don't have, you don't do so without the explicit permission of everyone in the"
    },
    {
      "Time_Start": 35.42,
      "Time_End": 41.620000000000005,
      "Text": " frame. But yeah, with that I will pass it over to Christopher. Great. Uh, well welcome"
    },
    {
      "Time_Start": 41.620000000000005,
      "Time_End": 45.8,
      "Text": " everyone and I know it's been a long day and uh, it's the end of a long day so what better,"
    },
    {
      "Time_Start": 45.8,
      "Time_End": 50.5,
      "Text": " what better thing to talk about than diplomacy in cyberspace. I should say this is the um,"
    },
    {
      "Time_Start": 50.5,
      "Time_End": 53.3,
      "Text": " uh, it's turning out to be like the world's most dangerous panel because two of our"
    },
    {
      "Time_Start": 53.32000000000001,
      "Time_End": 57.36000000000001,
      "Text": " panelists had to cancel, one for a family emergency, one literally fell into a black hole. So"
    },
    {
      "Time_Start": 57.36000000000001,
      "Time_End": 61.800000000000004,
      "Text": " they got black holed and uh, they're, they're okay. Uh, but we've been able to field a great"
    },
    {
      "Time_Start": 61.800000000000004,
      "Time_End": 66.16,
      "Text": " group of people. Rather than me read their, their bios, I'm going to actually just have each"
    },
    {
      "Time_Start": 66.16,
      "Time_End": 70.28,
      "Text": " of them do a short introduction and then we'll dive into the substance. Basically this is a"
    },
    {
      "Time_Start": 70.28,
      "Time_End": 74.04,
      "Text": " pretty broad ranging panel because when we talk about diplomacy in cyberspace, it means a lot"
    },
    {
      "Time_Start": 74.04,
      "Time_End": 78.88000000000001,
      "Text": " of different things. There are negotiations happening in the UN, both on the rules of the"
    },
    {
      "Time_Start": 78.88,
      "Time_End": 83.53999999999999,
      "Text": " road in cyberspace, particularly for nation states, but not just nation states. Uh, there's a"
    },
    {
      "Time_Start": 83.53999999999999,
      "Time_End": 88.28,
      "Text": " new cyber crime treaty being negotiated in the UN right now, which has uh, there's lots of"
    },
    {
      "Time_Start": 88.28,
      "Time_End": 91.82,
      "Text": " different moving parts of that. There's lots of other work internationally. There's capacity"
    },
    {
      "Time_Start": 91.82,
      "Time_End": 97.41999999999999,
      "Text": " building work, uh, that my organization, uh, which I'll talk about in a little bit, is doing,"
    },
    {
      "Time_Start": 97.41999999999999,
      "Time_End": 103.3,
      "Text": " uh, and others are doing on this panel as well. There is, um, standards bodies. There's a"
    },
    {
      "Time_Start": 103.3,
      "Time_End": 108.36,
      "Text": " whole, I mean there's, there's a huge dimension which is great because for years we tried to"
    },
    {
      "Time_Start": 108.38,
      "Time_End": 112.92,
      "Text": " say, look, cyber is important as a technical issue, but it's also important as a policy issue,"
    },
    {
      "Time_Start": 112.92,
      "Time_End": 118.28,
      "Text": " particularly as an international policy and diplomatic issue. Uh, and that was often a"
    },
    {
      "Time_Start": 118.28,
      "Time_End": 125.3,
      "Text": " struggle. You know, uh, I, I, for myself, I was in government for a long time, 28 years doing,"
    },
    {
      "Time_Start": 125.3,
      "Time_End": 130.5,
      "Text": " uh, as a criminal prosecutor, uh, then at the White House and then at the State Department as"
    },
    {
      "Time_Start": 130.5,
      "Time_End": 137.44,
      "Text": " the first cyber diplomat. Uh, my successor in the room, I see. So, uh, uh, you know, and, and"
    },
    {
      "Time_Start": 137.46,
      "Time_End": 141.16,
      "Text": " when I created that office, that was the first one in the world. No one who was thinking about"
    },
    {
      "Time_Start": 141.16,
      "Time_End": 145.6,
      "Text": " this at the time, but now it's really taken off. There are about 45 countries who have cyber"
    },
    {
      "Time_Start": 145.6,
      "Time_End": 149.7,
      "Text": " ambassadors or diplomats. So this really has become an issue. And, and one of the things we"
    },
    {
      "Time_Start": 149.7,
      "Time_End": 153.78,
      "Text": " want to impress on all of you is you may well ask, well, why do I care? And we'll try to like"
    },
    {
      "Time_Start": 153.78,
      "Time_End": 157.22,
      "Text": " make the case of why you should care about this and all this stuff that's going on. But with"
    },
    {
      "Time_Start": 157.22,
      "Time_End": 161.42,
      "Text": " that, without any further ado, let me go down the line and have each person do a little intro"
    },
    {
      "Time_Start": 161.44000000000003,
      "Time_End": 166.44000000000003,
      "Text": " from themselves. Monica? Thank you, Chris. And I guess I can't pull it. Okay. I'll just, uh,"
    },
    {
      "Time_Start": 169.68,
      "Time_End": 174.42000000000002,
      "Text": " speak like this. Um, it's, I'm delighted to be here. Thank you all for coming. Uh, my name is"
    },
    {
      "Time_Start": 174.42000000000002,
      "Time_End": 178.92000000000002,
      "Text": " Monica Ruiz. I'm a senior government affairs manager within Microsoft's digital diplomacy"
    },
    {
      "Time_Start": 178.92000000000002,
      "Time_End": 182.76000000000002,
      "Text": " team. I'll be very brief in my introduction because I know you're going to, um, circle back"
    },
    {
      "Time_Start": 182.76000000000002,
      "Time_End": 188.3,
      "Text": " with, um, additional questions, but I will say one of the main reasons why I was excited to join"
    },
    {
      "Time_Start": 188.32000000000002,
      "Time_End": 193.62,
      "Text": " Microsoft prior to when I worked at the Hewlett Foundation, which was my previous job, was"
    },
    {
      "Time_Start": 193.62,
      "Time_End": 198.46,
      "Text": " because there is a company like Microsoft that has a digital diplomacy team and is engaging in"
    },
    {
      "Time_Start": 198.46,
      "Time_End": 202.60000000000002,
      "Text": " these issues that Chris made reference to. And so I'm happy to dive into that a little bit more"
    },
    {
      "Time_Start": 202.60000000000002,
      "Time_End": 208.54000000000002,
      "Text": " deeply. Um, but certainly to me it's, it's a topic of very much of interest and I'm happy"
    },
    {
      "Time_Start": 208.54000000000002,
      "Time_End": 215.04000000000002,
      "Text": " we're making space at DEF CON to talk about it. Thank you. Thank you. Um, good afternoon"
    },
    {
      "Time_Start": 215.06,
      "Time_End": 220.76,
      "Text": " everyone. Uh, my name is Maurice Kent. Uh, I am the deputy team lead, uh, for USAID's"
    },
    {
      "Time_Start": 220.76,
      "Time_End": 225.89999999999998,
      "Text": " cybersecurity capacity building team, uh, based out of Washington. Uh, it's a relatively new"
    },
    {
      "Time_Start": 225.89999999999998,
      "Time_End": 231.6,
      "Text": " team. It's about two years old. And it joins, uh, kind of a broader collection of digitally"
    },
    {
      "Time_Start": 231.6,
      "Time_End": 238.14,
      "Text": " focused teams, uh, focusing on, you know, cryptocurrency, on AI, on digital connectivity, uh,"
    },
    {
      "Time_Start": 238.14,
      "Time_End": 243.22,
      "Text": " digital skills, all those kinds of things, um, that USAID, uh, pushes across all of our"
    },
    {
      "Time_Start": 243.26,
      "Time_End": 246.9,
      "Text": " projects. And I can explain a little bit more about how, what our agency is and how we fit"
    },
    {
      "Time_Start": 246.9,
      "Time_End": 252.74,
      "Text": " into the broader USG, uh, cyber diplomacy and development, uh, space and then talk a little"
    },
    {
      "Time_Start": 252.74,
      "Time_End": 257.14,
      "Text": " bit about all of those pieces as we get into it. So, we'll leave it there. Great. Thank you."
    },
    {
      "Time_Start": 257.14,
      "Time_End": 261.12,
      "Text": " Good afternoon everybody. Uh, John Banghart. I am senior director for cybersecurity services"
    },
    {
      "Time_Start": 261.12,
      "Time_End": 265.92,
      "Text": " with a firm called Venable. Um, my background includes time at NIST, time at the White"
    },
    {
      "Time_Start": 265.92,
      "Time_End": 269.62,
      "Text": " House, time at Center for Internet Security, time at Microsoft. I've been at this for a"
    },
    {
      "Time_Start": 269.62,
      "Time_End": 273.4,
      "Text": " while. I've been a lot of different places. I'm probably the least diplomatic person on"
    },
    {
      "Time_Start": 273.4,
      "Time_End": 276.8,
      "Text": " this group in terms of my background. Um, but I'm going to talk about public private"
    },
    {
      "Time_Start": 276.8,
      "Time_End": 280.3,
      "Text": " partnerships. I'm going to talk about international standards and why that's important and"
    },
    {
      "Time_Start": 280.3,
      "Time_End": 286.24,
      "Text": " why you should care. So, looking forward to it. Thank you. Uh, hello everybody. My name is"
    },
    {
      "Time_Start": 286.24,
      "Time_End": 292.44,
      "Text": " Orlando Garces. Uh, I'm a cybersecurity program officer of the Inter-American Committee"
    },
    {
      "Time_Start": 292.44,
      "Time_End": 297.44,
      "Text": " Against Terrorism of the Organization of American States. Uh, happy to be here. I think, uh,"
    },
    {
      "Time_Start": 301.71999999999997,
      "Time_End": 308.98,
      "Text": " we have to do a lot, we have to work a lot on diplomacy in the region. So, uh, we look forward"
    },
    {
      "Time_Start": 308.98,
      "Time_End": 314.0,
      "Text": " to have a great conversation. Uh, we in the cybersecurity program, uh, we, uh, work in three"
    },
    {
      "Time_Start": 315.0,
      "Time_End": 320.0,
      "Text": " different areas. We work in policy development, cyber policy development, uh, also in"
    },
    {
      "Time_Start": 323.68,
      "Time_End": 328.68,
      "Text": " capacity building and then, uh, research and development. So, uh, great to be here. Great. Uh,"
    },
    {
      "Time_Start": 331.82,
      "Time_End": 337.26,
      "Text": " and, um, you know, I should say, John, you say you're the least diplomatic, uh, person here."
    },
    {
      "Time_Start": 337.26,
      "Time_End": 342.02,
      "Text": " Some of the, some of the least diplomatic people I know are diplomats. So, uh, probably not"
    },
    {
      "Time_Start": 342.02,
      "Time_End": 348.46,
      "Text": " all of them. Um, so, uh, you know, broad range of backgrounds, uh, everything from public"
    },
    {
      "Time_Start": 348.46,
      "Time_End": 354.2,
      "Text": " private partnership in this area to, um, uh, to some of the capacity building and regional work"
    },
    {
      "Time_Start": 354.2,
      "Time_End": 358.2,
      "Text": " that the OAS is doing. So, what I want to do is just to set the stage a little bit, have each"
    },
    {
      "Time_Start": 358.2,
      "Time_End": 362.35999999999996,
      "Text": " person talk about what they do. One of the things I do now is I run a foundation called the"
    },
    {
      "Time_Start": 362.35999999999996,
      "Time_End": 366.59999999999997,
      "Text": " Global Forum on Cyber Expertise, uh, which is based in The Hague that has a bunch of"
    },
    {
      "Time_Start": 366.59999999999997,
      "Time_End": 370.58,
      "Text": " countries, civil society, companies as part of it that does capacity building around the"
    },
    {
      "Time_Start": 370.64,
      "Time_End": 374.53999999999996,
      "Text": " world, which helps, helps coordinate it. Microsoft is a member, for instance, the U.S. is a"
    },
    {
      "Time_Start": 374.53999999999996,
      "Time_End": 381.62,
      "Text": " member, many others are a member. Um, USAID we work with a lot, for instance, and OAS is, uh, a"
    },
    {
      "Time_Start": 381.62,
      "Time_End": 386.47999999999996,
      "Text": " member and partner. So, um, uh, but I'd like to get each panelist to give a little perspective"
    },
    {
      "Time_Start": 386.47999999999996,
      "Time_End": 390.32,
      "Text": " of this kind of broad topic and then we'll dig down and put a little more questions and try to"
    },
    {
      "Time_Start": 390.32,
      "Time_End": 392.36,
      "Text": " make this as interactive and a conversation as we can."
    },
    {
      "Time_Start": 392.36,
      "Time_End": 398.5,
      "Text": " All right. So, I will dive a little bit deeper into Microsoft's digital diplomacy team and"
    },
    {
      "Time_Start": 398.52,
      "Time_End": 403.16,
      "Text": " then, um, give a little bit of color in terms of how we engage international delegations, how we"
    },
    {
      "Time_Start": 403.16,
      "Time_End": 406.9,
      "Text": " try and plug into what is happening at the U.N. as, um, Chris said in the context of the"
    },
    {
      "Time_Start": 406.9,
      "Time_End": 411.36,
      "Text": " open-ended working group as part of the first committee, certainly the ad hoc, um, committee"
    },
    {
      "Time_Start": 411.36,
      "Time_End": 416.44,
      "Text": " focusing on the new cyber crime treaty. Um, so the digital diplomacy team is small and"
    },
    {
      "Time_Start": 416.44,
      "Time_End": 420.98,
      "Text": " mighty. Uh, you have about six individuals, um, based all over the world. So you have one"
    },
    {
      "Time_Start": 420.98,
      "Time_End": 425.68,
      "Text": " colleague in Redmond headquarters, myself I'm based out of D.C., I have three additional"
    },
    {
      "Time_Start": 425.7,
      "Time_End": 431.0,
      "Text": " colleagues, uh, based out of different places in Europe, so Ljubljana, Slovenia, Vienna,"
    },
    {
      "Time_Start": 431.0,
      "Time_End": 435.64,
      "Text": " Austria, and, uh, Prague, Czech Republic. And we have one last colleague based out of"
    },
    {
      "Time_Start": 435.64,
      "Time_End": 440.18,
      "Text": " Singapore. And ultimately what the digital diplomacy team does is we advocate for responsible"
    },
    {
      "Time_Start": 440.18,
      "Time_End": 444.88,
      "Text": " state behavior online and also call for rules of the road. Um, more accountability in this"
    },
    {
      "Time_Start": 444.88,
      "Time_End": 450.02,
      "Text": " space in terms of the, the 11 norms of international, uh, state behavior that were agreed to"
    },
    {
      "Time_Start": 450.02,
      "Time_End": 453.86,
      "Text": " in the context of the group of governmental experts and that were then reaffirmed in the"
    },
    {
      "Time_Start": 453.88,
      "Time_End": 457.98,
      "Text": " context of the open-ended working group. And so we try and provide an industry, industry"
    },
    {
      "Time_Start": 457.98,
      "Time_End": 463.58000000000004,
      "Text": " perspective across these dialogues. Um, and there are different ways that we interact with,"
    },
    {
      "Time_Start": 463.58000000000004,
      "Time_End": 469.46000000000004,
      "Text": " um, the diplomatic community in the context of international cyber norms. So we, uh, try and"
    },
    {
      "Time_Start": 469.46000000000004,
      "Time_End": 473.22,
      "Text": " plug in to, to what is happening in the open-ended working group. Unfortunately we've"
    },
    {
      "Time_Start": 473.22,
      "Time_End": 477.76,
      "Text": " applied numerous times to be accredited but, uh, we keep getting vetoed by a certain, uh,"
    },
    {
      "Time_Start": 477.76,
      "Time_End": 482.3,
      "Text": " country and so we do not have a formal stakeholder, um, role. You can, you can say who the"
    },
    {
      "Time_Start": 482.34000000000003,
      "Time_End": 486.92,
      "Text": " country is. It's not that. Okay. The Russian Federation keeps vetoing, uh, Microsoft from"
    },
    {
      "Time_Start": 486.92,
      "Time_End": 491.82,
      "Text": " actively engaging, uh, in discussions but we still have, um, found a way to contribute to"
    },
    {
      "Time_Start": 491.82,
      "Time_End": 496.16,
      "Text": " different delegations that are actively shaping these discussions. And so we have been, um,"
    },
    {
      "Time_Start": 496.16,
      "Time_End": 501.6,
      "Text": " honored and, and, and lucky to be able to have a, not a voice in the room but certainly a"
    },
    {
      "Time_Start": 501.6,
      "Time_End": 507.40000000000003,
      "Text": " seat in the room. Um, at the same time we, uh, organize, uh, numerous different events on"
    },
    {
      "Time_Start": 507.40000000000003,
      "Time_End": 511.34000000000003,
      "Text": " the sidelines of open-ended working group discussions. Whether it's around supply chain"
    },
    {
      "Time_Start": 511.38000000000005,
      "Time_End": 515.12,
      "Text": " security, whether it's from the issue of cyber mercenaries, certainly issues that are being"
    },
    {
      "Time_Start": 515.12,
      "Time_End": 519.9200000000001,
      "Text": " talked about in the open-ended working group and how that sort of feeds into what is, um,"
    },
    {
      "Time_Start": 519.9200000000001,
      "Time_End": 525.32,
      "Text": " ultimately making part of the annual progress report that actually just came out at the end"
    },
    {
      "Time_Start": 525.32,
      "Time_End": 529.9,
      "Text": " of July last month. Um, so that's one way we engage at the open-ended working group. We"
    },
    {
      "Time_Start": 529.9,
      "Time_End": 534.0400000000001,
      "Text": " organize side events with delegations. We also try and identify what are different"
    },
    {
      "Time_Start": 534.0400000000001,
      "Time_End": 538.8000000000001,
      "Text": " stakeholder communities that we can plug into. So, think communities like the Paris call"
    },
    {
      "Time_Start": 538.8,
      "Time_End": 542.9,
      "Text": " for trust and security in cyberspace. The biggest multi-stakeholder community of"
    },
    {
      "Time_Start": 542.9,
      "Time_End": 549.0799999999999,
      "Text": " industry, government, and civil society that is once again, I'm sorry for my voice here, is"
    },
    {
      "Time_Start": 549.0799999999999,
      "Time_End": 554.62,
      "Text": " once again trying, um, to, to call out certain behavior that's happening online across"
    },
    {
      "Time_Start": 554.62,
      "Time_End": 558.78,
      "Text": " different states and how the stakeholder groups can, can contribute to, to more accountability"
    },
    {
      "Time_Start": 558.78,
      "Time_End": 564.3599999999999,
      "Text": " in this space. And the last thing I'll say, we share information as a company in terms of"
    },
    {
      "Time_Start": 564.36,
      "Time_End": 568.8000000000001,
      "Text": " what we're seeing in the broader digital ecosystem. So we have something called, um, the"
    },
    {
      "Time_Start": 568.8000000000001,
      "Time_End": 575.3000000000001,
      "Text": " Microsoft Digital Defense Report that essentially, um, it's like, it's an assessment of"
    },
    {
      "Time_Start": 575.3000000000001,
      "Time_End": 579.94,
      "Text": " roughly like 43 trillion security signals that we see every day. It's assessed by roughly"
    },
    {
      "Time_Start": 579.94,
      "Time_End": 584.6800000000001,
      "Text": " 2,500 security experts within Microsoft and we push that out every year. But at the same"
    },
    {
      "Time_Start": 584.6800000000001,
      "Time_End": 588.08,
      "Text": " time we'll organize different briefings for different delegations that provide a little bit"
    },
    {
      "Time_Start": 588.08,
      "Time_End": 591.52,
      "Text": " more color in terms of what we're seeing in the digital ecosystem from our standpoint and"
    },
    {
      "Time_Start": 591.52,
      "Time_End": 595.78,
      "Text": " how can that, um, add a little bit more color to the discussions that are taking place more"
    },
    {
      "Time_Start": 595.78,
      "Time_End": 601.06,
      "Text": " internationally. The last thing I'll say is since the team is, uh, all over the world, uh,"
    },
    {
      "Time_Start": 601.06,
      "Time_End": 605.36,
      "Text": " spread out regionally, we're starting to plug into, you know, what our colleagues at the"
    },
    {
      "Time_Start": 605.36,
      "Time_End": 610.1999999999999,
      "Text": " OAS are doing, our colleagues in the OSCE are doing because in large part, different, uh,"
    },
    {
      "Time_Start": 610.1999999999999,
      "Time_End": 614.9399999999999,
      "Text": " issues, uh, sort of resonate differently across different regions and so we want to be able to"
    },
    {
      "Time_Start": 614.9399999999999,
      "Time_End": 619.88,
      "Text": " A, contribute to that, but certainly plug in and have clarity on it. So, um, yeah. Happy to"
    },
    {
      "Time_Start": 619.9399999999999,
      "Time_End": 625.24,
      "Text": " take questions afterwards. So, thanks, Monica. And I'd say a couple things. I mean, I know"
    },
    {
      "Time_Start": 625.24,
      "Time_End": 629.28,
      "Text": " some people in the room are familiar with some of these things. How many of you know, uh, what"
    },
    {
      "Time_Start": 629.28,
      "Time_End": 635.98,
      "Text": " the open-ended working group is? Okay, a smattering, a small smattering. Uh, so what's"
    },
    {
      "Time_Start": 635.98,
      "Time_End": 640.06,
      "Text": " happening is, you know, now that people have woken up to cyber being an important policy"
    },
    {
      "Time_Start": 640.06,
      "Time_End": 644.7,
      "Text": " issue, there's a lot of activity that's happening. Maybe too much activity in some ways, but"
    },
    {
      "Time_Start": 644.7,
      "Time_End": 649.4,
      "Text": " the, um, the UN has two processes going. One is to negotiate a cyber crime treaty and we'll"
    },
    {
      "Time_Start": 649.42,
      "Time_End": 654.12,
      "Text": " talk more about that in a little bit. But one is to bring all the countries of the world, so"
    },
    {
      "Time_Start": 654.12,
      "Time_End": 659.1,
      "Text": " it's all 191 UN member countries together, which could be kind of a cacophony, you might"
    },
    {
      "Time_Start": 659.1,
      "Time_End": 664.06,
      "Text": " imagine, where, uh, where they try to endorse rules of the road, voluntary rules of the road"
    },
    {
      "Time_Start": 664.06,
      "Time_End": 668.84,
      "Text": " for cyberspace. Things like, don't attack the critical infrastructure of another country when"
    },
    {
      "Time_Start": 668.84,
      "Time_End": 671.84,
      "Text": " you're not in wartime. When you're in wartime, there are rules, there's the, uh, what's"
    },
    {
      "Time_Start": 671.84,
      "Time_End": 675.38,
      "Text": " called the law of armed conflict. There are rules that apply both in cyberspace and the"
    },
    {
      "Time_Start": 675.4,
      "Time_End": 680.66,
      "Text": " physical world, but not in wartime, it's not really clear. So they endorse these set of 11"
    },
    {
      "Time_Start": 680.66,
      "Time_End": 684.84,
      "Text": " norms, it's sort of like the, uh, the movie Spinal Tap, they couldn't come up with 10, they"
    },
    {
      "Time_Start": 684.84,
      "Time_End": 688.98,
      "Text": " ended up with 11. So they have these 11 norms, and they're, they're, even though they're"
    },
    {
      "Time_Start": 688.98,
      "Time_End": 692.9399999999999,
      "Text": " voluntary, they're political commitments by all these countries. And one of the issues is"
    },
    {
      "Time_Start": 692.9399999999999,
      "Time_End": 696.82,
      "Text": " accountability, as Monty was saying, that, you know, it's great to have these rules, but if"
    },
    {
      "Time_Start": 696.82,
      "Time_End": 700.26,
      "Text": " countries violate them all the time willy nilly, what does that matter? So, so a lot of"
    },
    {
      "Time_Start": 700.26,
      "Time_End": 705.16,
      "Text": " discussion is around these issues. It's a consensus based process, this, this route, which"
    },
    {
      "Time_Start": 705.1999999999999,
      "Time_End": 709.04,
      "Text": " means everyone has to agree, and you can imagine, right now, people aren't really in an"
    },
    {
      "Time_Start": 709.04,
      "Time_End": 713.0799999999999,
      "Text": " agreeing mood on things, especially because of what's going on in Ukraine and what Russia is"
    },
    {
      "Time_Start": 713.0799999999999,
      "Time_End": 719.12,
      "Text": " doing. So, so they, they've been able to make kind of incremental progress, but the key"
    },
    {
      "Time_Start": 719.12,
      "Time_End": 723.4599999999999,
      "Text": " things were creating these rules of the road and confidence building measures, which are"
    },
    {
      "Time_Start": 723.4599999999999,
      "Time_End": 729.0,
      "Text": " like more tactical ways to build confidence, uh, and, uh, and create, uh, channels of"
    },
    {
      "Time_Start": 729.0,
      "Time_End": 732.9399999999999,
      "Text": " communication. So that's what that group has been doing in the UN. There's a lot of stuff"
    },
    {
      "Time_Start": 732.94,
      "Time_End": 737.5400000000001,
      "Text": " being done regionally, which, uh, I'll turn to Orlando next, actually, to talk about and"
    },
    {
      "Time_Start": 737.5400000000001,
      "Time_End": 740.8800000000001,
      "Text": " what the OS is doing, because they're plugging into that. So, so, but you have these big"
    },
    {
      "Time_Start": 740.8800000000001,
      "Time_End": 745.4200000000001,
      "Text": " international settings, you have regional settings, then you have all the other settings."
    },
    {
      "Time_Start": 745.4200000000001,
      "Time_End": 751.84,
      "Text": " Okay, thank you. So, uh, first of all, I just want to, um, you know, say that, uh, the"
    },
    {
      "Time_Start": 751.84,
      "Time_End": 757.2600000000001,
      "Text": " Organization of American States is the oldest regional organization in the world. Uh, it's"
    },
    {
      "Time_Start": 757.26,
      "Time_End": 763.92,
      "Text": " the premier regional forum for political, uh, discussion, policy analysis, and decision"
    },
    {
      "Time_Start": 763.92,
      "Time_End": 771.42,
      "Text": " making in the Western hemisphere. Uh, you know, the OS brings together all the 35 independent"
    },
    {
      "Time_Start": 771.42,
      "Time_End": 776.4399999999999,
      "Text": " states of the Americas and, uh, fulfills its essential purposes on four pillars, democracy,"
    },
    {
      "Time_Start": 780.06,
      "Time_End": 786.24,
      "Text": " human rights, security, and development. Uh, I work for the SICTE Inter-American Committee"
    },
    {
      "Time_Start": 786.26,
      "Time_End": 791.94,
      "Text": " Against Terrorism, and as I said before, it's the only regional entity, uh, whose purpose is"
    },
    {
      "Time_Start": 791.94,
      "Time_End": 797.5,
      "Text": " to prevent and combat terrorism in the, in the, in the region. So we have, uh, ambassadors"
    },
    {
      "Time_Start": 797.5,
      "Time_End": 804.08,
      "Text": " from all of the 35 member states, uh, that are representatives from, uh, from their"
    },
    {
      "Time_Start": 804.08,
      "Time_End": 810.38,
      "Text": " countries. Uh, the SICTE, you know, we, we look forward to promote, uh, cooperation and"
    },
    {
      "Time_Start": 810.38,
      "Time_End": 817.6,
      "Text": " dialogue, uh, among member states. And, uh, since 1990, I believe since 1990, the organization"
    },
    {
      "Time_Start": 817.6,
      "Time_End": 824.84,
      "Text": " has been, um, you know, by mandate of the member states, uh, discussing measures to promote"
    },
    {
      "Time_Start": 824.84,
      "Time_End": 829.84,
      "Text": " cooperation and, uh, trust to contribute to stability, uh, in the cyberspace. So, uh, uh,"
    },
    {
      "Time_Start": 833.22,
      "Time_End": 839.48,
      "Text": " specifically, we have worked, we have done a lot of work in, uh, non-traditional measures,"
    },
    {
      "Time_Start": 839.96,
      "Time_End": 844.96,
      "Text": " uh, confidence building measures, um, and, uh, we have, uh, to date, uh, several, uh, exactly"
    },
    {
      "Time_Start": 848.76,
      "Time_End": 855.9,
      "Text": " 11, uh, confidence building measure has been adopted by the OAS General Assembly, uh,"
    },
    {
      "Time_Start": 855.9,
      "Time_End": 860.9,
      "Text": " specifically in the years 2018, 2020, and 2023. And, um, that's very important and I will talk"
    },
    {
      "Time_Start": 863.64,
      "Time_End": 869.04,
      "Text": " about it later. And I should say a CBM is, uh, for those not familiar with these terms, CBM"
    },
    {
      "Time_Start": 869.64,
      "Time_End": 873.48,
      "Text": " is, what it sounds like, it's to build confidence and transparency between countries that maybe"
    },
    {
      "Time_Start": 873.48,
      "Time_End": 878.0799999999999,
      "Text": " don't agree on everything. And even, you know, even we had this in the, uh, the Cold War with,"
    },
    {
      "Time_Start": 878.0799999999999,
      "Time_End": 883.06,
      "Text": " uh, Russia and other countries, so that there was ways, for instance, a confident, a classic"
    },
    {
      "Time_Start": 883.06,
      "Time_End": 887.4599999999999,
      "Text": " confidence building measure is communication channels, hotlines, things like that, uh,"
    },
    {
      "Time_Start": 887.4599999999999,
      "Time_End": 892.54,
      "Text": " directories. Um, that's one example of something that's practical. It's not a policy thing, so"
    },
    {
      "Time_Start": 892.54,
      "Time_End": 896.5,
      "Text": " everyone should be able to do this to make sure you deescalate a possible conflict."
    },
    {
      "Time_Start": 897.06,
      "Time_End": 901.0,
      "Text": " Exactly. No, finally, we, uh, the OAS is an active member in all the international"
    },
    {
      "Time_Start": 901.0,
      "Time_End": 908.24,
      "Text": " discussion, uh, discussions on, uh, you know, rules, norms, principles on responsible"
    },
    {
      "Time_Start": 908.24,
      "Time_End": 913.24,
      "Text": " behavior of countries in cyberspace. And, uh, for example, we, we, uh, collaborate with the"
    },
    {
      "Time_Start": 915.82,
      "Time_End": 920.82,
      "Text": " UN Open-Ended Group. Uh, we also, uh, uh, CICTE, you know, the Committee Against"
    },
    {
      "Time_Start": 921.2800000000001,
      "Time_End": 926.2800000000001,
      "Text": " Terrorism is the, uh, GFCE, uh, Regional Americas Hub. Uh, we are, uh, working to, uh,"
    },
    {
      "Time_Start": 930.4200000000001,
      "Time_End": 936.46,
      "Text": " coordinating capacity building efforts in the region and, uh, also in the, uh, well, to"
    },
    {
      "Time_Start": 936.46,
      "Time_End": 941.2,
      "Text": " work more efficiently, uh, all together, no? So. And I'll delve more in the capacity"
    },
    {
      "Time_Start": 941.2,
      "Time_End": 945.2600000000001,
      "Text": " building in a few minutes. Um, thanks for that. And that's the example of a regional"
    },
    {
      "Time_Start": 945.2600000000001,
      "Time_End": 950.2800000000001,
      "Text": " organization, so not, you know, in the UN, but all the countries and, you know, and this,"
    },
    {
      "Time_Start": 951.06,
      "Time_End": 954.24,
      "Text": " and the Americas have been very, very active for a long time in this, which I think has been"
    },
    {
      "Time_Start": 954.24,
      "Time_End": 961.1999999999999,
      "Text": " great. Um, Maurice, let me go to you next. Um, and you approach this from a programming"
    },
    {
      "Time_Start": 961.1999999999999,
      "Time_End": 966.0799999999999,
      "Text": " standpoint from USAID. I remember back when I was at the White House and we did the White"
    },
    {
      "Time_Start": 966.0799999999999,
      "Time_End": 971.98,
      "Text": " House, uh, International Strategy for Cyberspace back in 2015. Um, at that time getting,"
    },
    {
      "Time_Start": 971.98,
      "Time_End": 975.4599999999999,
      "Text": " you know, the, what we call the traditional aid, the traditional development of"
    },
    {
      "Time_Start": 975.4599999999999,
      "Time_End": 978.76,
      "Text": " organizations involved was kind of tough because we were like, look, we, we deal with"
    },
    {
      "Time_Start": 978.8,
      "Time_End": 983.28,
      "Text": " water and dams and power. Important things. You guys, you cyber guys, what do you even,"
    },
    {
      "Time_Start": 983.28,
      "Time_End": 988.48,
      "Text": " why are you talking to us? But as we all know, those things are now all controlled by cyber."
    },
    {
      "Time_Start": 988.48,
      "Time_End": 993.62,
      "Text": " And so there's been, I think, a real, uh, not universally, but I think UICD has been on the"
    },
    {
      "Time_Start": 993.62,
      "Time_End": 997.92,
      "Text": " leading edge of like bringing that together. So please. Thanks Chris. Uh, we're working on"
    },
    {
      "Time_Start": 997.92,
      "Time_End": 1001.86,
      "Text": " it. Um, so I will start kind of zoomed in and then I'll zoom out and then I'll zoom back in,"
    },
    {
      "Time_Start": 1001.86,
      "Time_End": 1006.88,
      "Text": " I think, uh, over the next few minutes. Um, so crash course in USAID. So we, uh, as you can"
    },
    {
      "Time_Start": 1010.04,
      "Time_End": 1014.22,
      "Text": " see, I don't work directly in the White House or at the State Department. Uh, kind of two"
    },
    {
      "Time_Start": 1014.22,
      "Time_End": 1019.52,
      "Text": " organizations that would be leading on cyber diplomacy. Um, we're on the development side"
    },
    {
      "Time_Start": 1019.52,
      "Time_End": 1023.62,
      "Text": " and if you think about kind of the breakdown of diplomacy, international development and"
    },
    {
      "Time_Start": 1023.62,
      "Time_End": 1028.46,
      "Text": " defense, those are kind of the three ways, the three D's of US government policy. Uh,"
    },
    {
      "Time_Start": 1028.46,
      "Time_End": 1034.08,
      "Text": " over, uh, foreign policy. Um, AID, so the agency for international development, uh, is an"
    },
    {
      "Time_Start": 1034.08,
      "Time_End": 1040.68,
      "Text": " independent agency that manages the majority of US foreign assistance. So that means we work"
    },
    {
      "Time_Start": 1040.68,
      "Time_End": 1046.02,
      "Text": " in 70 or more countries, more than 70 countries around the world where we have offices, um,"
    },
    {
      "Time_Start": 1046.02,
      "Time_End": 1053.06,
      "Text": " and, uh, deliver, um, technical assistance, training, food, disaster response, um, uh,"
    },
    {
      "Time_Start": 1053.1,
      "Time_End": 1059.04,
      "Text": " equipment, um, across a wide range of sectors. So global health, disaster response, uh, economic"
    },
    {
      "Time_Start": 1059.04,
      "Time_End": 1064.8999999999999,
      "Text": " growth and energy, um, infrastructure development, uh, governance support, so help with, with,"
    },
    {
      "Time_Start": 1064.8999999999999,
      "Time_End": 1070.44,
      "Text": " uh, elections and that sort of thing. Um, and, and agriculture, uh, amongst others. Um, private"
    },
    {
      "Time_Start": 1070.44,
      "Time_End": 1075.52,
      "Text": " sector development. And all of those programs, kind of as Chris was alluding to, some of them,"
    },
    {
      "Time_Start": 1075.52,
      "Time_End": 1079.12,
      "Text": " the digital components are pretty obvious in terms of critical infrastructure and that sort of"
    },
    {
      "Time_Start": 1079.1200000000001,
      "Time_End": 1085.46,
      "Text": " thing. Um, others are less obvious, but, uh, you know, helping out developing, uh, clinics and,"
    },
    {
      "Time_Start": 1085.46,
      "Time_End": 1091.3200000000002,
      "Text": " uh, medical centers that are working with, um, both at risk and, you know, kind of regular"
    },
    {
      "Time_Start": 1091.3200000000002,
      "Time_End": 1097.3400000000001,
      "Text": " populations are generating a lot of data that needs to be protected. Um, and so, uh, we are"
    },
    {
      "Time_Start": 1097.3400000000001,
      "Time_End": 1102.88,
      "Text": " slowly waking up, rapidly waking up in some cases, uh, to needing to address the cyber risks"
    },
    {
      "Time_Start": 1102.94,
      "Time_End": 1109.94,
      "Text": " across all of our programs. Um, as well as now considering cyber security as kind of a key"
    },
    {
      "Time_Start": 1109.94,
      "Time_End": 1114.8400000000001,
      "Text": " capacity building sector that we might work in, uh, directly on its own. So it's kind of a two, two,"
    },
    {
      "Time_Start": 1114.8400000000001,
      "Time_End": 1121.96,
      "Text": " tier two level path there. Um, so a couple of things have happened to kind of thrust USAID"
    },
    {
      "Time_Start": 1121.96,
      "Time_End": 1129.2600000000002,
      "Text": " into this now really expanding US government wide, uh, I think, expansion of cyber diplomacy"
    },
    {
      "Time_Start": 1129.28,
      "Time_End": 1133.98,
      "Text": " and really pushing it as a priority across all of the foreign policy we do. Um, from our"
    },
    {
      "Time_Start": 1133.98,
      "Time_End": 1138.66,
      "Text": " perspective, and this is where I start to zoom out, um, USAID, uh, uh, in this administration has"
    },
    {
      "Time_Start": 1138.66,
      "Time_End": 1142.36,
      "Text": " become part of the National Security Council. Uh, our administrator sits alongside the"
    },
    {
      "Time_Start": 1142.36,
      "Time_End": 1147.86,
      "Text": " secretaries and that sort of thing, um, which elevates us into those dialogues, um, uh, which is"
    },
    {
      "Time_Start": 1147.86,
      "Time_End": 1153.6,
      "Text": " really helpful for us being elevated in those. Um, the second thing that's really kind of pushed"
    },
    {
      "Time_Start": 1153.6200000000001,
      "Time_End": 1160.0800000000002,
      "Text": " cyber diplomacy broadly, uh, within USG is the creation of the Cyber and Digital Policy, uh,"
    },
    {
      "Time_Start": 1160.0800000000002,
      "Time_End": 1165.5200000000002,
      "Text": " Bureau, uh, at state that, uh, Ambassador Nate Fick runs. So that's Chris' now second or third,"
    },
    {
      "Time_Start": 1165.5200000000002,
      "Time_End": 1172.1000000000001,
      "Text": " uh, follower, I guess. Um, and, uh, so that whole bureau is kind of in charge of, uh,"
    },
    {
      "Time_Start": 1172.1000000000001,
      "Time_End": 1177.16,
      "Text": " implementing and directing, uh, US cyber diplomacy, uh, alongside a bunch of things. And then the"
    },
    {
      "Time_Start": 1177.16,
      "Time_End": 1182.5800000000002,
      "Text": " third thing that happened, uh, this year was the release of the, uh, National Cyber Strategy in"
    },
    {
      "Time_Start": 1182.58,
      "Time_End": 1188.4199999999998,
      "Text": " March, um, which has five pillars. Uh, they are, you know, protecting critical infrastructure"
    },
    {
      "Time_Start": 1188.4199999999998,
      "Time_End": 1194.56,
      "Text": " both in the US and, uh, in allied nations. Um, looking at taking down bad guys, ransomware,"
    },
    {
      "Time_Start": 1194.56,
      "Time_End": 1200.1,
      "Text": " that sort of thing. Uh, working on securing, uh, mar- improving market forces and doing things"
    },
    {
      "Time_Start": 1200.1,
      "Time_End": 1205.98,
      "Text": " like SBOM and, uh, open source and secure by default. Um, improving standards internationally,"
    },
    {
      "Time_Start": 1205.98,
      "Time_End": 1211.22,
      "Text": " uh, and so those first four, uh, the first one on critical infrastructure we have a role to"
    },
    {
      "Time_Start": 1211.22,
      "Time_End": 1216.72,
      "Text": " play as an agency, USAID does, um, and we will take guidance on the other ones. Uh, we don't"
    },
    {
      "Time_Start": 1216.72,
      "Time_End": 1220.8,
      "Text": " really get involved with, you know, tracking down bad guys on ransomware. Um, but the fifth"
    },
    {
      "Time_Start": 1220.8,
      "Time_End": 1226.26,
      "Text": " one, uh, is looking at, uh, fo- forging, I think is the word they use, international"
    },
    {
      "Time_Start": 1226.26,
      "Time_End": 1232.84,
      "Text": " partnerships to, um, promote this, uh, overall, what are the three words, defensible, resilient,"
    },
    {
      "Time_Start": 1232.84,
      "Time_End": 1239.04,
      "Text": " and values aligned, uh, digital ecosystem. Uh, and so that's really where we step in, uh, is"
    },
    {
      "Time_Start": 1239.06,
      "Time_End": 1245.8799999999999,
      "Text": " being able to leverage all of the, uh, foreign assistance resources and partnerships and, uh,"
    },
    {
      "Time_Start": 1245.8799999999999,
      "Time_End": 1250.8799999999999,
      "Text": " programs that we have in, uh, building relationships, um, promoting USG and, uh, country partner"
    },
    {
      "Time_Start": 1254.24,
      "Time_End": 1260.32,
      "Text": " objectives, national security objectives, um, and cyber is a huge part of that. And so all of"
    },
    {
      "Time_Start": 1260.32,
      "Time_End": 1266.76,
      "Text": " our development work, uh, is kind of a key component of, uh, USG, uh, diplo- diplomatic efforts"
    },
    {
      "Time_Start": 1266.78,
      "Time_End": 1271.32,
      "Text": " at this point. Um, and we can get into that more, a little bit more, uh, as we get on."
    },
    {
      "Time_Start": 1271.32,
      "Time_End": 1275.0,
      "Text": " So, so one of the, the challenges in this area is, you know, there's lots of different"
    },
    {
      "Time_Start": 1275.0,
      "Time_End": 1278.12,
      "Text": " communities that exist in this space. I mean, you guys know this, there's the technical"
    },
    {
      "Time_Start": 1278.12,
      "Time_End": 1282.34,
      "Text": " community, the policy community who don't talk to each other nearly enough. There is the"
    },
    {
      "Time_Start": 1282.34,
      "Time_End": 1287.1,
      "Text": " economic community, the kind of innovation community, and the security community, they don't"
    },
    {
      "Time_Start": 1287.1,
      "Time_End": 1291.04,
      "Text": " talk to each other very well. But also there's the traditional development community that does"
    },
    {
      "Time_Start": 1291.04,
      "Time_End": 1295.48,
      "Text": " what USAID does and the World Bank and others do, and they don't really talk to the cyber"
    },
    {
      "Time_Start": 1295.5,
      "Time_End": 1298.94,
      "Text": " people and vice versa very well either in the past. That's changing, which is really"
    },
    {
      "Time_Start": 1298.94,
      "Time_End": 1304.34,
      "Text": " important. Uh, and, and one of the things that we're doing, um, later this year in November"
    },
    {
      "Time_Start": 1304.34,
      "Time_End": 1308.78,
      "Text": " in Ghana, in Accra, Ghana, we're having a, a big conference, my organization, GFC, in"
    },
    {
      "Time_Start": 1308.78,
      "Time_End": 1313.46,
      "Text": " partnership with the World Bank, the World Economic Forum, and the Cyber Peace Institute"
    },
    {
      "Time_Start": 1313.46,
      "Time_End": 1317.3600000000001,
      "Text": " to bring these communities together, to try to make everything, you know, every country"
    },
    {
      "Time_Start": 1317.3600000000001,
      "Time_End": 1321.76,
      "Text": " around the world is now saying we need help. Uh, especially the countries in the developing"
    },
    {
      "Time_Start": 1321.92,
      "Time_End": 1326.3799999999999,
      "Text": " world are saying we need help in, in Africa and the ASEAN countries and others saying,"
    },
    {
      "Time_Start": 1326.3799999999999,
      "Time_End": 1331.06,
      "Text": " and Latin America is saying, you know, we're happy to debate these esoteric rules of like,"
    },
    {
      "Time_Start": 1331.06,
      "Time_End": 1335.9,
      "Text": " you know, rules in cyberspace, which are important, but we need help right now. And so that, that"
    },
    {
      "Time_Start": 1335.9,
      "Time_End": 1339.16,
      "Text": " capacity building element is drawn through. So bringing these communities together is"
    },
    {
      "Time_Start": 1339.16,
      "Time_End": 1344.04,
      "Text": " important, but also bringing like the community here, the, the technical community and these"
    },
    {
      "Time_Start": 1344.04,
      "Time_End": 1347.8799999999999,
      "Text": " discussions is important. So the more you know about this stuff, the more I think to the"
    },
    {
      "Time_Start": 1347.9,
      "Time_End": 1352.2,
      "Text": " extent you can influence it, you can, I think there are opportunities to do that. I would"
    },
    {
      "Time_Start": 1352.2,
      "Time_End": 1357.5800000000002,
      "Text": " say, however, that like in this OEWG process, not just Moni, Monica's group, not just Microsoft,"
    },
    {
      "Time_Start": 1357.5800000000002,
      "Time_End": 1362.8200000000002,
      "Text": " but they blocked 30 different civil society organizations, including mine too. So it's not,"
    },
    {
      "Time_Start": 1362.8200000000002,
      "Time_End": 1366.5800000000002,
      "Text": " it's, there are some, there's some hurdles to be sure. The UN was not built for other"
    },
    {
      "Time_Start": 1366.5800000000002,
      "Time_End": 1372.96,
      "Text": " stakeholders. It was built for states, but there's still some opportunities. John, um, you"
    },
    {
      "Time_Start": 1372.96,
      "Time_End": 1376.7,
      "Text": " know, there, there are a number of things, you know, Monica has addressed a little bit, uh, the"
    },
    {
      "Time_Start": 1376.72,
      "Time_End": 1380.66,
      "Text": " public-private partnership from, you know, Microsoft is a kind of a unique company in the"
    },
    {
      "Time_Start": 1380.66,
      "Time_End": 1385.8,
      "Text": " sense that not a lot are really involved in that kind of policy issue. Uh, it's changing a"
    },
    {
      "Time_Start": 1385.8,
      "Time_End": 1390.3,
      "Text": " little bit, but I think Microsoft has been a leader. You, you, you've seen this, John, you've"
    },
    {
      "Time_Start": 1390.3,
      "Time_End": 1394.3400000000001,
      "Text": " seen it from both sides. You've seen it from the government side too. And you know, one of"
    },
    {
      "Time_Start": 1394.3400000000001,
      "Time_End": 1398.44,
      "Text": " the things, you know, going back to this community issue, one of the challenges I've seen"
    },
    {
      "Time_Start": 1398.44,
      "Time_End": 1403.22,
      "Text": " is like when the UN wrote this rule, we came up with this rule, don't attack the certs"
    },
    {
      "Time_Start": 1403.24,
      "Time_End": 1406.94,
      "Text": " because they're like the ambulances or the hospitals on the internet. I remember I"
    },
    {
      "Time_Start": 1406.94,
      "Time_End": 1410.6200000000001,
      "Text": " talked to first the form of incident response and security teams. I gave a keynote a few"
    },
    {
      "Time_Start": 1410.6200000000001,
      "Time_End": 1414.96,
      "Text": " years ago and they had no idea that that was done. There was no connection between the"
    },
    {
      "Time_Start": 1414.96,
      "Time_End": 1419.0,
      "Text": " people who were actually on the front lines and, and the people that were making this"
    },
    {
      "Time_Start": 1419.0,
      "Time_End": 1423.26,
      "Text": " policy. And that's a real problem. Uh, so you see that all the time. And I think you also"
    },
    {
      "Time_Start": 1423.26,
      "Time_End": 1427.46,
      "Text": " see this in standard and other setting bodies. So yeah, no, that's, that's a great example,"
    },
    {
      "Time_Start": 1427.46,
      "Time_End": 1432.6000000000001,
      "Text": " Chris. And I think, you know, it reminds me of sort of my earlier mental model when I"
    },
    {
      "Time_Start": 1432.6200000000001,
      "Time_End": 1437.3600000000001,
      "Text": " thought about diplomacy. You know, it was entirely informed by Hollywood, right? Like I"
    },
    {
      "Time_Start": 1437.3600000000001,
      "Time_End": 1442.7,
      "Text": " was either imagining these people in suits arguing in these big buildings trying to"
    },
    {
      "Time_Start": 1442.7,
      "Time_End": 1448.0000000000002,
      "Text": " avert catastrophe, save us from aliens or whatever the case may be. Or they were good for"
    },
    {
      "Time_Start": 1448.0000000000002,
      "Time_End": 1453.44,
      "Text": " nothing, no nothings that the heroes could blame, um, for, uh, sort of blame and shame. Um,"
    },
    {
      "Time_Start": 1453.44,
      "Time_End": 1457.3400000000001,
      "Text": " my mental model obviously has grown quite a bit in a lot of different ways. And I"
    },
    {
      "Time_Start": 1457.3400000000001,
      "Time_End": 1460.68,
      "Text": " mentioned that I'm sort of a non diplomatic person. And what I meant by that is I haven't"
    },
    {
      "Time_Start": 1460.7,
      "Time_End": 1465.96,
      "Text": " spent a lot of time doing actual diplomacy. Didn't really get started in it until 2013. And"
    },
    {
      "Time_Start": 1465.96,
      "Time_End": 1470.68,
      "Text": " in fact it was a trip with Chris to, in the state department when we went to Australia. Um,"
    },
    {
      "Time_Start": 1470.68,
      "Time_End": 1474.68,
      "Text": " and I actually learned during that that a lot of diplomacy involves good wine and good food."
    },
    {
      "Time_Start": 1474.68,
      "Time_End": 1479.78,
      "Text": " So there's a real upside to being involved in diplomacy as well. What I want to talk about"
    },
    {
      "Time_Start": 1479.78,
      "Time_End": 1484.52,
      "Text": " though a little bit is international standards, um, and, and the relation to diplomacy and"
    },
    {
      "Time_Start": 1484.52,
      "Time_End": 1489.22,
      "Text": " the, and, and how we can all influence that. How many people are involved in any way, in"
    },
    {
      "Time_Start": 1489.22,
      "Time_End": 1493.56,
      "Text": " any sort of international standards development? I know there's at least a couple of hands"
    },
    {
      "Time_Start": 1493.56,
      "Time_End": 1497.8,
      "Text": " need to be up because I recognize people. So every single one of you are a diplomat, right?"
    },
    {
      "Time_Start": 1497.8,
      "Time_End": 1502.42,
      "Text": " In, in, to some extent. And you may not often think about it that way, but to Chris's point,"
    },
    {
      "Time_Start": 1502.42,
      "Time_End": 1507.34,
      "Text": " there is a bit, really often a big gap between those of us that are more on the technical"
    },
    {
      "Time_Start": 1507.34,
      "Time_End": 1512.14,
      "Text": " side who are operational and the folks that are making policy. And international standards"
    },
    {
      "Time_Start": 1512.14,
      "Time_End": 1516.68,
      "Text": " is actually a place where we can do a lot about that. Um, one of the questions that, that"
    },
    {
      "Time_Start": 1516.68,
      "Time_End": 1521.72,
      "Text": " Chris wanted us to address is why should you care, right? And so I think as you've seen,"
    },
    {
      "Time_Start": 1521.72,
      "Time_End": 1526.38,
      "Text": " there's an awful lot of policy being made about cyber security right now. And I was in a"
    },
    {
      "Time_Start": 1526.38,
      "Time_End": 1530.52,
      "Text": " panel yesterday and Peter Brown from the UK Parliament made a really, really interesting"
    },
    {
      "Time_Start": 1530.52,
      "Time_End": 1536.26,
      "Text": " comment. He said, international standards are foundational to good policy, right? Whether"
    },
    {
      "Time_Start": 1536.26,
      "Time_End": 1540.4,
      "Text": " they're technical standards, process standards, they're foundational to good policy. If we"
    },
    {
      "Time_Start": 1540.4,
      "Time_End": 1544.0,
      "Text": " don't have good standards, if we don't have standards that work, consensus standards by the"
    },
    {
      "Time_Start": 1544.0,
      "Time_End": 1548.66,
      "Text": " way, um, then we're not going to have very good policy either. We're not going to be able to"
    },
    {
      "Time_Start": 1548.66,
      "Time_End": 1554.7,
      "Text": " educate, inform, or empower our policy makers to make good policy around the kinds of things"
    },
    {
      "Time_Start": 1554.7,
      "Time_End": 1560.04,
      "Text": " that we need from a cyber security perspective. Um, standards get used in other ways from a"
    },
    {
      "Time_Start": 1560.04,
      "Time_End": 1563.68,
      "Text": " political perspective as well. If you've been involved in standards bodies, you may have seen"
    },
    {
      "Time_Start": 1563.68,
      "Time_End": 1569.08,
      "Text": " this, right? Some countries will sometimes introduce standards into consensus bodies, um,"
    },
    {
      "Time_Start": 1569.1,
      "Time_End": 1575.3799999999999,
      "Text": " that very much favor, uh, their economy, right? Or their region. Um, they may try to stack the"
    },
    {
      "Time_Start": 1575.3799999999999,
      "Time_End": 1579.9399999999998,
      "Text": " deck, if you will, by sort of overloading, um, different consensus making bodies or"
    },
    {
      "Time_Start": 1579.9399999999998,
      "Time_End": 1584.78,
      "Text": " standards bodies to try and drive home the kinds of things that they care about. It's one of"
    },
    {
      "Time_Start": 1584.78,
      "Time_End": 1588.52,
      "Text": " the reasons that it's so important to be involved and I was glad to see some hands come up"
    },
    {
      "Time_Start": 1588.52,
      "Time_End": 1592.52,
      "Text": " for folks that are involved in it and I think I would encourage all of you, um, to get"
    },
    {
      "Time_Start": 1592.52,
      "Time_End": 1597.1,
      "Text": " involved in whatever standard makes sense for you, right? So, for example, I'm involved with"
    },
    {
      "Time_Start": 1597.1200000000001,
      "Time_End": 1602.0600000000002,
      "Text": " ISO SC38, that's cloud security standards. That's something that matters to me, it's an area"
    },
    {
      "Time_Start": 1602.0600000000002,
      "Time_End": 1606.6200000000001,
      "Text": " that I work in. But there are an awful lot of important technical standards out there, cyber"
    },
    {
      "Time_Start": 1606.6200000000001,
      "Time_End": 1611.8400000000001,
      "Text": " security standards, and an opportunity for everybody to get engaged, bring your expertise, and"
    },
    {
      "Time_Start": 1611.8400000000001,
      "Time_End": 1618.5000000000002,
      "Text": " whether you see it or not, that expertise and what you're doing in that work will inform"
    },
    {
      "Time_Start": 1618.5000000000002,
      "Time_End": 1623.18,
      "Text": " policy makers. It will give them the tools that they need to be able to make good policy"
    },
    {
      "Time_Start": 1623.2,
      "Time_End": 1627.4,
      "Text": " which all of us want. Because if we get bad policy, if we get bad regulation, because we have"
    },
    {
      "Time_Start": 1627.4,
      "Time_End": 1634.1000000000001,
      "Text": " bad standards or a lack of standards, international standards, um, we end up hurting our"
    },
    {
      "Time_Start": 1634.1000000000001,
      "Time_End": 1639.14,
      "Text": " ability to innovate, we end up hurting our ability to be able to protect, uh, the companies,"
    },
    {
      "Time_Start": 1639.14,
      "Time_End": 1644.54,
      "Text": " the citizens, um, and our nations. So, um, I'll stop there, I've got some more to say about"
    },
    {
      "Time_Start": 1644.54,
      "Time_End": 1647.88,
      "Text": " this, hopefully I'll have a chance when the time comes up, but again, international"
    },
    {
      "Time_Start": 1647.88,
      "Time_End": 1653.8600000000001,
      "Text": " standards, they are diplomacy, um, in their own kind of way, and super important to policy"
    },
    {
      "Time_Start": 1653.8600000000001,
      "Time_End": 1658.0,
      "Text": " makers, so just keep that in mind. Great, thanks. So, I want to have a little conversation"
    },
    {
      "Time_Start": 1658.0,
      "Time_End": 1662.7,
      "Text": " around some of these issues and also broaden others. Uh, Monica, you talked about all the work"
    },
    {
      "Time_Start": 1662.7,
      "Time_End": 1667.9,
      "Text": " Microsoft's doing in this area, you know, as I said, pretty unique as a company, it's not"
    },
    {
      "Time_Start": 1667.9,
      "Time_End": 1672.3400000000001,
      "Text": " like the only company that's involved, but there's not really any other ones that I think is"
    },
    {
      "Time_Start": 1672.44,
      "Time_End": 1678.88,
      "Text": " as active in the kind of policy diplomacy space. Why is that? I mean, why hasn't there been"
    },
    {
      "Time_Start": 1678.88,
      "Time_End": 1683.3200000000002,
      "Text": " this groundswell, why don't other companies see the value of, because what's happening, the"
    },
    {
      "Time_Start": 1683.3200000000002,
      "Time_End": 1687.3200000000002,
      "Text": " reason I think it matters to all you guys is what's being negotiated in these UN meetings,"
    },
    {
      "Time_Start": 1687.3200000000002,
      "Time_End": 1693.3200000000002,
      "Text": " these, you know, rooms, dark, well they're not that dark, but they're big, cavernous rooms,"
    },
    {
      "Time_Start": 1693.3200000000002,
      "Time_End": 1699.5400000000002,
      "Text": " they're not smoky anymore, uh, in the UN, whether it's in New York or in Geneva or in, uh,"
    },
    {
      "Time_Start": 1699.54,
      "Time_End": 1705.68,
      "Text": " the cybercrime ones in, um, Vienna, uh, you know, I think a lot of the folks who it's going to"
    },
    {
      "Time_Start": 1705.68,
      "Time_End": 1709.84,
      "Text": " impact are not there, and they don't know what's going on, and it does make a difference"
    },
    {
      "Time_Start": 1709.84,
      "Time_End": 1713.02,
      "Text": " because when people are writing rules of the road, and those rules are going to end up"
    },
    {
      "Time_Start": 1713.02,
      "Time_End": 1716.48,
      "Text": " applying to some extent to you or the countries you live in, and that's going to have an"
    },
    {
      "Time_Start": 1716.48,
      "Time_End": 1721.02,
      "Text": " effect, but why, I think, you know, your company has gotten that, why do you think that"
    },
    {
      "Time_Start": 1721.02,
      "Time_End": 1727.6599999999999,
      "Text": " hasn't been more of a groundswell with other, other companies around the world? Thanks for"
    },
    {
      "Time_Start": 1727.66,
      "Time_End": 1732.92,
      "Text": " the question, Chris, and I, and I agree with you, I think, uh, Microsoft has, um, for some"
    },
    {
      "Time_Start": 1732.92,
      "Time_End": 1737.0600000000002,
      "Text": " time, you know, the mere fact that we have a digital diplomacy team has allowed us to"
    },
    {
      "Time_Start": 1737.0600000000002,
      "Time_End": 1741.76,
      "Text": " engage in international forums and regional forums more proactively, but what I will say"
    },
    {
      "Time_Start": 1741.76,
      "Time_End": 1746.1000000000001,
      "Text": " is you're starting to see a trend towards more companies trying to plug into this space,"
    },
    {
      "Time_Start": 1746.1000000000001,
      "Time_End": 1750.78,
      "Text": " and I've actually seen this more and more, um, we talked about the ad hoc committee, which"
    },
    {
      "Time_Start": 1750.78,
      "Time_End": 1754.8200000000002,
      "Text": " is the, the third committee process negotiating a new cybercrime treaty, and you are"
    },
    {
      "Time_Start": 1754.84,
      "Time_End": 1758.9199999999998,
      "Text": " starting to see companies like Google, companies obviously like Microsoft and others try and"
    },
    {
      "Time_Start": 1758.9199999999998,
      "Time_End": 1764.08,
      "Text": " actively, um, shape and inform a lot of the negotiations that are, um, ultimately going to"
    },
    {
      "Time_Start": 1764.08,
      "Time_End": 1770.06,
      "Text": " result in the treaty next year, and so, um, I, I do think, uh, Microsoft has been, uh,"
    },
    {
      "Time_Start": 1770.06,
      "Time_End": 1775.96,
      "Text": " proactive in the digital diplomacy space, um, and has been, and, and we certainly plan to"
    },
    {
      "Time_Start": 1775.96,
      "Time_End": 1782.3,
      "Text": " continue to, and other companies, uh, are now starting to, to be a little bit more, more"
    },
    {
      "Time_Start": 1782.32,
      "Time_End": 1788.5,
      "Text": " proactive, particularly in the cybercrime space. I will also say there are, you know,"
    },
    {
      "Time_Start": 1788.5,
      "Time_End": 1792.1599999999999,
      "Text": " government affairs teams across major tech companies that are also engaging countries"
    },
    {
      "Time_Start": 1792.1599999999999,
      "Time_End": 1797.6,
      "Text": " directly versus engaging in international forums, so there are, there is certain, you know,"
    },
    {
      "Time_Start": 1797.6,
      "Time_End": 1801.44,
      "Text": " engagement taking place, maybe not, not, not internationally, but domestically across"
    },
    {
      "Time_Start": 1801.44,
      "Time_End": 1801.94,
      "Text": " different-"
    },
    {
      "Time_Start": 1801.94,
      "Time_End": 1805.24,
      "Text": " Although in the past, most of those engagements have been, please don't regulate me, you"
    },
    {
      "Time_Start": 1805.24,
      "Time_End": 1808.22,
      "Text": " know, that's what, usually what companies would go and engage on."
    },
    {
      "Time_Start": 1808.22,
      "Time_End": 1809.08,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1809.08,
      "Time_End": 1811.68,
      "Text": " And policy, it's a little more esoteric, so-"
    },
    {
      "Time_Start": 1811.7,
      "Time_End": 1815.8400000000001,
      "Text": " Absolutely, absolutely, but, but there has been that level of engagement, but certainly"
    },
    {
      "Time_Start": 1815.8400000000001,
      "Time_End": 1822.54,
      "Text": " not trickling up to the international stage, but, but hopefully, I'm hopeful that more, um,"
    },
    {
      "Time_Start": 1822.54,
      "Time_End": 1824.0800000000002,
      "Text": " tech voices will, will get involved."
    },
    {
      "Time_Start": 1824.0800000000002,
      "Time_End": 1828.42,
      "Text": " Uh, and in this, uh, cybercrime treaty, so that's going to be a binding treaty, if they"
    },
    {
      "Time_Start": 1828.42,
      "Time_End": 1831.38,
      "Text": " can reach an agreement, who knows if they can reach an agreement, and the rubber's ki-"
    },
    {
      "Time_Start": 1831.38,
      "Time_End": 1837.26,
      "Text": " kind of hitting the road on that, um, so that will have an effect. We did a panel on, uh,"
    },
    {
      "Time_Start": 1837.26,
      "Time_End": 1844.12,
      "Text": " digital authoritarianism and, uh, surveillance, and, you know, how you get evidence and what"
    },
    {
      "Time_Start": 1844.12,
      "Time_End": 1848.26,
      "Text": " the rule of law is makes a difference, and so it impacts not just cyber security, but"
    },
    {
      "Time_Start": 1848.26,
      "Time_End": 1850.66,
      "Text": " human rights and other issues going forward."
    },
    {
      "Time_Start": 1850.66,
      "Time_End": 1858.6,
      "Text": " Um, you know, Maurice, um, as I said, USAID, I think, has been taking a leading role recently"
    },
    {
      "Time_Start": 1858.6,
      "Time_End": 1860.8,
      "Text": " in this, it's, uh, been to transition."
    },
    {
      "Time_Start": 1860.8,
      "Time_End": 1866.64,
      "Text": " Um, it's sort of the same question for development banks, a lot of them still are like, this"
    },
    {
      "Time_Start": 1866.66,
      "Time_End": 1870.0600000000002,
      "Text": " is not our, you know, this is not our hood, we don't, we don't do this, so, so how do"
    },
    {
      "Time_Start": 1870.0600000000002,
      "Time_End": 1874.96,
      "Text": " you, how do you try to model or get other, other ones in the development community around"
    },
    {
      "Time_Start": 1874.96,
      "Time_End": 1879.16,
      "Text": " the world to get in the game, because this is a big issue, you know, the UN has these"
    },
    {
      "Time_Start": 1879.16,
      "Time_End": 1883.14,
      "Text": " development goals, I think, what are they, how many are they, 16? I can't remember."
    },
    {
      "Time_Start": 1883.14,
      "Time_End": 1883.64,
      "Text": " 16."
    },
    {
      "Time_Start": 1883.64,
      "Time_End": 1884.14,
      "Text": " 16's a lot."
    },
    {
      "Time_Start": 1884.14,
      "Time_End": 1888.88,
      "Text": " Um, and they're, they're high, none of them are cyber, none of them are even, you know,"
    },
    {
      "Time_Start": 1888.88,
      "Time_End": 1892.74,
      "Text": " digital, they, you know, the argument is, well, undergirds all of them, but there's not"
    },
    {
      "Time_Start": 1892.74,
      "Time_End": 1896.96,
      "Text": " even an understanding of that, I think, that they don't understand how cyber security and"
    },
    {
      "Time_Start": 1896.96,
      "Time_End": 1901.32,
      "Text": " even digital connectivity applies to those larger development goals, and I think they"
    },
    {
      "Time_Start": 1901.32,
      "Time_End": 1904.16,
      "Text": " clearly do, but there's not that understanding yet."
    },
    {
      "Time_Start": 1904.16,
      "Time_End": 1910.44,
      "Text": " Um, actually, uh, Chris, thanks for the question, um, I think that the, some of the development"
    },
    {
      "Time_Start": 1910.44,
      "Time_End": 1915.48,
      "Text": " banks, uh, the Inter-American Development Bank, World Bank, are actually pretty forward"
    },
    {
      "Time_Start": 1915.48,
      "Time_End": 1920.28,
      "Text": " leaning on cyber capacity building, um, AFDB, we've had a little bit less engagement with"
    },
    {
      "Time_Start": 1920.28,
      "Time_End": 1925.28,
      "Text": " so far, um, I think the key question, from a diplomatic standpoint, is, um, the limitations"
    },
    {
      "Time_Start": 1928.92,
      "Time_End": 1934.32,
      "Text": " or differences of the US government directly providing cyber capacity assistance versus a"
    },
    {
      "Time_Start": 1934.32,
      "Time_End": 1939.0,
      "Text": " multilateral organization that has, you know, various member organizations and partners and"
    },
    {
      "Time_Start": 1939.0,
      "Time_End": 1944.54,
      "Text": " that sort of thing, that, uh, share a wider range of political objectives, diplomatic"
    },
    {
      "Time_Start": 1944.56,
      "Time_End": 1950.04,
      "Text": " objectives, uh, than US government on its own, um, and so finding opportunities to"
    },
    {
      "Time_Start": 1950.04,
      "Time_End": 1956.58,
      "Text": " collaborate, uh, in ways that still support the national cyber strategy, um, are given, you"
    },
    {
      "Time_Start": 1956.58,
      "Time_End": 1961.08,
      "Text": " know, US government objectives in a given country, uh, and trying to align all of those things"
    },
    {
      "Time_Start": 1961.08,
      "Time_End": 1965.82,
      "Text": " together is interesting, um, and that's, I mean, I'll try to aggregate from a lot of different"
    },
    {
      "Time_Start": 1965.82,
      "Time_End": 1970.82,
      "Text": " engagements, but, um, just to kind of put in place how, um, our specific work on a given"
    },
    {
      "Time_Start": 1971.4399999999998,
      "Time_End": 1976.4399999999998,
      "Text": " capacity building thing can play a relatively outsized role in terms of, uh, diplomacy for"
    },
    {
      "Time_Start": 1980.1799999999998,
      "Time_End": 1986.96,
      "Text": " cyber, um, you know, in a given country, uh, and there's, in this particular example, I have a"
    },
    {
      "Time_Start": 1986.96,
      "Time_End": 1991.26,
      "Text": " colleague who, uh, is a foreign service officer down there, she couldn't make it here, and"
    },
    {
      "Time_Start": 1991.26,
      "Time_End": 1996.5,
      "Text": " she would have been better to tell this story, but it's fine. Too bad she's not here. Um, and"
    },
    {
      "Time_Start": 1996.52,
      "Time_End": 2002.58,
      "Text": " so we've been, you know, working with this country and with, uh, a development bank to think"
    },
    {
      "Time_Start": 2002.58,
      "Time_End": 2008.0,
      "Text": " about how we can combine our money to do cyber capacity building, and the, the recipient"
    },
    {
      "Time_Start": 2008.0,
      "Time_End": 2014.54,
      "Text": " country, uh, is interested in procuring equipment, uh, for their CERT, uh, and we say great,"
    },
    {
      "Time_Start": 2014.54,
      "Time_End": 2019.38,
      "Text": " uh, we would love to be able to do that with some of our money, um, you know, our, uh, mission"
    },
    {
      "Time_Start": 2019.38,
      "Time_End": 2023.54,
      "Text": " director and the ambassador and the White House are all aware of this, um, there's been, you"
    },
    {
      "Time_Start": 2023.56,
      "Time_End": 2028.6599999999999,
      "Text": " know, six, eight, ten months of dialogue between, uh, the host government and the development"
    },
    {
      "Time_Start": 2028.6599999999999,
      "Time_End": 2033.6599999999999,
      "Text": " bank and, uh, USAID, um, and as we move towards actually moving that money along, um, there"
    },
    {
      "Time_Start": 2037.68,
      "Time_End": 2042.24,
      "Text": " starts to be more and more question around, you know, if the development bank is"
    },
    {
      "Time_Start": 2042.24,
      "Time_End": 2047.48,
      "Text": " implementing all the money, uh, what sort of restrictions or controls are there in terms of what"
    },
    {
      "Time_Start": 2047.48,
      "Time_End": 2052.52,
      "Text": " technology is procured, right? Do the, uh, the, the, the technologies that would be procured"
    },
    {
      "Time_Start": 2052.54,
      "Time_End": 2056.6,
      "Text": " count as trusted technologies as far as our money is concerned? Uh, some certain things we can't"
    },
    {
      "Time_Start": 2056.6,
      "Time_End": 2060.78,
      "Text": " buy, uh, certain companies we can't buy certain types of technology, um, and those, you know,"
    },
    {
      "Time_Start": 2060.78,
      "Time_End": 2065.68,
      "Text": " there's a recent executive order, uh, that kind of touches on that just this week I think, um,"
    },
    {
      "Time_Start": 2065.68,
      "Time_End": 2070.82,
      "Text": " and whereas the development bank, uh, is able to, um, and so figuring out how to blend those"
    },
    {
      "Time_Start": 2070.82,
      "Time_End": 2076.28,
      "Text": " mon- those monies together, um, is, uh, it's a very much a development challenge, a like"
    },
    {
      "Time_Start": 2076.28,
      "Time_End": 2081.2,
      "Text": " gritty bureaucratic problem that is my day job, but not actually being able to consummate"
    },
    {
      "Time_Start": 2081.2,
      "Time_End": 2085.2799999999997,
      "Text": " that partnership and move things along and respond to the host country's request for help"
    },
    {
      "Time_Start": 2085.2799999999997,
      "Time_End": 2090.8799999999997,
      "Text": " creates a diplomatic issue up the chain, um, and so that is kind of, you know, my day to day is"
    },
    {
      "Time_Start": 2090.8799999999997,
      "Time_End": 2094.08,
      "Text": " country X comes up and says hey we're interested in getting separate capacity building and we"
    },
    {
      "Time_Start": 2094.08,
      "Time_End": 2098.3599999999997,
      "Text": " say cool, uh, are you, you know, do you want it from the US? Do you want it from the"
    },
    {
      "Time_Start": 2098.3599999999997,
      "Time_End": 2102.8599999999997,
      "Text": " development bank? Like, are, are you a close ally? Are you an emerging ally? Are you, you know,"
    },
    {
      "Time_Start": 2102.8599999999997,
      "Time_End": 2107.2,
      "Text": " and, or do you have an existing infrastructure that we can't really work on? And, okay, I'd"
    },
    {
      "Time_Start": 2107.2,
      "Time_End": 2112.5,
      "Text": " love to do workforce development and improve, uh, kind of your range of cyber abil-"
    },
    {
      "Time_Start": 2112.5,
      "Time_End": 2116.14,
      "Text": " capabilities, but at the end of the day if your infrastructure is vulnerable, does that"
    },
    {
      "Time_Start": 2116.14,
      "Time_End": 2119.8799999999997,
      "Text": " matter? Like, why am I spending money on that instead of directing everything towards, you"
    },
    {
      "Time_Start": 2119.8799999999997,
      "Time_End": 2124.08,
      "Text": " know, ripping out your cables and putting in trusted technologies? So, it's all very much a"
    },
    {
      "Time_Start": 2124.08,
      "Time_End": 2128.7799999999997,
      "Text": " diplomatic issue even though it's, uh, development at the end of the day. Chris, can I take"
    },
    {
      "Time_Start": 2128.7799999999997,
      "Time_End": 2133.7,
      "Text": " 30 seconds to add something? Um, so just, just a, a, to add on to what Maurice was saying,"
    },
    {
      "Time_Start": 2133.72,
      "Time_End": 2138.8599999999997,
      "Text": " you know, you mentioned at the start that you can often get sort of multi-organizational type"
    },
    {
      "Time_Start": 2138.8599999999997,
      "Time_End": 2142.14,
      "Text": " approaches to this and this is true not just with governments but also in the private"
    },
    {
      "Time_Start": 2142.14,
      "Time_End": 2147.7,
      "Text": " sector. So, I'm working with a number of US-based companies, uh, in West Africa for example,"
    },
    {
      "Time_Start": 2147.7,
      "Time_End": 2152.54,
      "Text": " not Nigeria, we didn't have anything to do with that. Um, but nevertheless, we're bringing"
    },
    {
      "Time_Start": 2152.54,
      "Time_End": 2157.08,
      "Text": " together technologies just like Maurice is talking about, um, to try and help these"
    },
    {
      "Time_Start": 2157.08,
      "Time_End": 2162.4199999999996,
      "Text": " countries build out their capacity, frankly to help provide options to other nations, um,"
    },
    {
      "Time_Start": 2162.44,
      "Time_End": 2166.38,
      "Text": " and what they're doing in those countries. But there's those kinds of opportunities exist as"
    },
    {
      "Time_Start": 2166.38,
      "Time_End": 2170.58,
      "Text": " well and collaborating with government, you can still do things just in the private sector"
    },
    {
      "Time_Start": 2170.58,
      "Time_End": 2177.46,
      "Text": " on, on that piece of it, so. Thanks. Great. Uh, Orlando, just, uh, you know, um, OAS, there's"
    },
    {
      "Time_Start": 2177.46,
      "Time_End": 2181.06,
      "Text": " two things they've done, I mean they've done a lot of things, but two things that they've"
    },
    {
      "Time_Start": 2181.06,
      "Time_End": 2185.3,
      "Text": " done is they've helped countries, particularly in Latin America and the Caribbean, develop"
    },
    {
      "Time_Start": 2185.3,
      "Time_End": 2189.7000000000003,
      "Text": " national level certs. Many of them didn't have certs at all, uh, before and now they do. And"
    },
    {
      "Time_Start": 2189.7200000000003,
      "Time_End": 2195.26,
      "Text": " also national strategies. Part of that process though is you try to get these countries to"
    },
    {
      "Time_Start": 2195.26,
      "Time_End": 2200.5000000000005,
      "Text": " adopt processes where they get not just the government, but other stakeholders involved. How,"
    },
    {
      "Time_Start": 2200.5000000000005,
      "Time_End": 2205.5000000000005,
      "Text": " how is that going? Yeah, well, uh, one of our main goal, goals is to, uh, you know, to, uh, try"
    },
    {
      "Time_Start": 2210.78,
      "Time_End": 2216.28,
      "Text": " to promote the debate, you know, promote debate and promote, uh, you know, the, the"
    },
    {
      "Time_Start": 2216.3,
      "Time_End": 2221.8,
      "Text": " cooperation, collaboration mechanisms in order to put in the same table all of the"
    },
    {
      "Time_Start": 2221.8,
      "Time_End": 2228.2200000000003,
      "Text": " multistakeholders, uh, that are involved, uh, in the, and, and are part of the cyber security"
    },
    {
      "Time_Start": 2228.2200000000003,
      "Time_End": 2233.2200000000003,
      "Text": " ecosystem. So, uh, we have done a great job, uh, on one hand, uh, building the CECERTA Americas,"
    },
    {
      "Time_Start": 2236.28,
      "Time_End": 2241.3,
      "Text": " that's, uh, that's a network of, uh, national, uh, response teams, uh, incident response,"
    },
    {
      "Time_Start": 2241.52,
      "Time_End": 2246.52,
      "Text": " response teams. We have, uh, already 41, uh, CECERTS of, of, uh, whole Americas. Um, and"
    },
    {
      "Time_Start": 2254.3,
      "Time_End": 2259.3,
      "Text": " also, uh, we, what, what we want to do is to promote, uh, and foster trust. That's, uh, our"
    },
    {
      "Time_Start": 2262.04,
      "Time_End": 2267.98,
      "Text": " main, our main goal because, uh, right now, uh, you know, 15 years ago this just always"
    },
    {
      "Time_Start": 2268.0,
      "Time_End": 2273.96,
      "Text": " talking about cyber security, uh, and we were like, uh, doing all, uh, you know, working"
    },
    {
      "Time_Start": 2273.96,
      "Time_End": 2280.44,
      "Text": " this, uh, first and second generation of, uh, national cyber security strategies, but now"
    },
    {
      "Time_Start": 2280.44,
      "Time_End": 2286.48,
      "Text": " there's a number of, uh, international community actors, uh, all around Latin America. You"
    },
    {
      "Time_Start": 2286.48,
      "Time_End": 2293.38,
      "Text": " were saying, you know, uh, um, uh, international, uh, organizations such as the United"
    },
    {
      "Time_Start": 2293.42,
      "Time_End": 2299.2200000000003,
      "Text": " Nations, uh, through the ITU, and then we have, um, you know, development, uh,"
    },
    {
      "Time_Start": 2299.2200000000003,
      "Time_End": 2305.4,
      "Text": " multilateral, uh, organizations like the World Bank, IDB, we have the European Union,"
    },
    {
      "Time_Start": 2305.4,
      "Time_End": 2310.4,
      "Text": " CARICOM, uh, we have, uh, uh, um, also, um, private companies, uh, uh, working with, very"
    },
    {
      "Time_Start": 2315.1400000000003,
      "Time_End": 2320.88,
      "Text": " closely with governments, and so, you know, the policy making processes in Latin America"
    },
    {
      "Time_Start": 2320.92,
      "Time_End": 2328.42,
      "Text": " has been, uh, changing, uh, it's been really hard because, uh, there's a lack of"
    },
    {
      "Time_Start": 2328.42,
      "Time_End": 2334.12,
      "Text": " capabilities in, in, uh, you know, governments, but, uh, you have to be very coordinated in"
    },
    {
      "Time_Start": 2334.12,
      "Time_End": 2340.0,
      "Text": " order to get, uh, you know, better results with all the international cooperation. Some"
    },
    {
      "Time_Start": 2340.0,
      "Time_End": 2344.96,
      "Text": " countries are doing just fine, for example, Dominican Republic, they are just great"
    },
    {
      "Time_Start": 2344.98,
      "Time_End": 2351.82,
      "Text": " because they have their own agency, and they just, they just, uh, know their, their, uh,"
    },
    {
      "Time_Start": 2351.82,
      "Time_End": 2358.1,
      "Text": " specific needs, and they know who to call in order to get that done, but other countries"
    },
    {
      "Time_Start": 2358.1,
      "Time_End": 2362.4,
      "Text": " in the region, they are like, they don't have, uh, a strong or robust, uh, governance"
    },
    {
      "Time_Start": 2362.4,
      "Time_End": 2369.44,
      "Text": " models, and, uh, so there's, uh, a lot of, uh, you know, um, inefficiencies there, so, uh,"
    },
    {
      "Time_Start": 2369.46,
      "Time_End": 2375.96,
      "Text": " we are helping, uh, the region, uh, uh, in order to, you know, to, to, uh, create the"
    },
    {
      "Time_Start": 2375.96,
      "Time_End": 2381.98,
      "Text": " strategic documents and strategic actions, and right now, uh, what we are focusing, um,"
    },
    {
      "Time_Start": 2381.98,
      "Time_End": 2386.78,
      "Text": " you know, um, we were talking about, I was talking about, uh, the CBMs that, uh, the"
    },
    {
      "Time_Start": 2386.78,
      "Time_End": 2391.78,
      "Text": " region has, uh, um, adopted through the OAS, uh, uh, General Assembly, and, uh, one of"
    },
    {
      "Time_Start": 2392.34,
      "Time_End": 2397.34,
      "Text": " those, uh, most of them are, uh, are, uh, um, um, uh, they are dealing with, uh, cyber"
    },
    {
      "Time_Start": 2403.2200000000003,
      "Time_End": 2408.2200000000003,
      "Text": " diplomacy, so, uh, we are doing a lot of work, uh, trying to do, uh, cyber diplomacy, uh, uh,"
    },
    {
      "Time_Start": 2411.7200000000003,
      "Time_End": 2418.6000000000004,
      "Text": " capacity building, uh, we have, uh, we have, um, uh, in, uh, we have, uh, invited more"
    },
    {
      "Time_Start": 2418.62,
      "Time_End": 2425.2,
      "Text": " than 800 official, public officials of the region through, uh, more than 20 international"
    },
    {
      "Time_Start": 2425.2,
      "Time_End": 2431.7,
      "Text": " law and international humanitarian law, uh, courses, uh, so, uh, that's what, uh, we are"
    },
    {
      "Time_Start": 2431.7,
      "Time_End": 2435.24,
      "Text": " doing right now. And I should also give a shout out to a program called the Women in"
    },
    {
      "Time_Start": 2435.24,
      "Time_End": 2439.04,
      "Text": " Cyber program, where there's been a number of countries in my organization that's been"
    },
    {
      "Time_Start": 2439.04,
      "Time_End": 2443.42,
      "Text": " helping run it. We brought women diplomats, particularly from Africa, but also from other"
    },
    {
      "Time_Start": 2443.44,
      "Time_End": 2449.2400000000002,
      "Text": " parts of the world to the UN meetings, and, you know, the UN, not surprisingly, kind of a"
    },
    {
      "Time_Start": 2449.2400000000002,
      "Time_End": 2455.38,
      "Text": " male-dominated place, cyber, male-dominated field, but now, uh, last year, over half the"
    },
    {
      "Time_Start": 2455.38,
      "Time_End": 2459.76,
      "Text": " interventions, half the statements made were by women, which is an amazing statement, so"
    },
    {
      "Time_Start": 2459.76,
      "Time_End": 2464.86,
      "Text": " that's another part of a, uh, community you're trying to broaden and widen. Uh, I want to"
    },
    {
      "Time_Start": 2464.86,
      "Time_End": 2468.46,
      "Text": " maybe leave time for a couple questions, but I, I just wanted anyone on the panel to"
    },
    {
      "Time_Start": 2468.46,
      "Time_End": 2472.26,
      "Text": " address one kind of elephant in the room, which is that, look, we're in a, we're in a"
    },
    {
      "Time_Start": 2472.28,
      "Time_End": 2475.94,
      "Text": " tough world right now. There's a lot of geopolitical tension, there's a lot of challenges."
    },
    {
      "Time_Start": 2475.94,
      "Time_End": 2480.7200000000003,
      "Text": " Cyberspace is not devoid from contact with the real world, with the, with the physical"
    },
    {
      "Time_Start": 2480.7200000000003,
      "Time_End": 2486.38,
      "Text": " world. Uh, the way you get countries to work together is they cooperate with each other, and"
    },
    {
      "Time_Start": 2486.38,
      "Time_End": 2490.1600000000003,
      "Text": " they just don't cooperate in cyberspace, they cooperate on other things, and if they're"
    },
    {
      "Time_Start": 2490.1600000000003,
      "Time_End": 2494.6000000000004,
      "Text": " enemies or they have problems, that affects everything else. And of course, you know, Russia's"
    },
    {
      "Time_Start": 2494.6000000000004,
      "Time_End": 2499.6000000000004,
      "Text": " invasion of Ukraine, uh, has caused, uh, you know, even more, uh, uh, conflict than usual"
    },
    {
      "Time_Start": 2502.34,
      "Time_End": 2506.48,
      "Text": " on these international bodies. Just as a prognosis matter, I mean, where, uh, do you think"
    },
    {
      "Time_Start": 2506.48,
      "Time_End": 2509.8,
      "Text": " we'll be able to make progress with those, these big geopolitical issues, which don't seem"
    },
    {
      "Time_Start": 2509.8,
      "Time_End": 2513.6200000000003,
      "Text": " to be going away anytime soon? Not everyone has to answer that, but whoever wants to answer"
    },
    {
      "Time_Start": 2513.6200000000003,
      "Time_End": 2519.98,
      "Text": " that. Or opine on it. I'm happy to answer it. I think I have the least to lose of everybody"
    },
    {
      "Time_Start": 2519.98,
      "Time_End": 2526.8,
      "Text": " up here, so, um, yeah, I, I mean, to, to some extent, I think what we're seeing now from a"
    },
    {
      "Time_Start": 2526.8,
      "Time_End": 2531.86,
      "Text": " geopolitical perspective is cyber as a national security issue, right? If you've worked in"
    },
    {
      "Time_Start": 2531.86,
      "Time_End": 2536.3,
      "Text": " this space, you've known that cyber security is a national security issue for a long time."
    },
    {
      "Time_Start": 2536.3,
      "Time_End": 2540.0,
      "Text": " But folks that have otherwise, policy makers and leaders who have otherwise been uninformed"
    },
    {
      "Time_Start": 2540.0,
      "Time_End": 2544.58,
      "Text": " about that, now are suddenly informed, and now they're suddenly concerned. And I think come,"
    },
    {
      "Time_Start": 2544.58,
      "Time_End": 2550.98,
      "Text": " what comes with that is that greater sense of our interdependence, right? I was gonna say"
    },
    {
      "Time_Start": 2550.98,
      "Time_End": 2554.96,
      "Text": " maybe we can treat it like climate change, it's a global problem, I'm not sure the way we've"
    },
    {
      "Time_Start": 2554.96,
      "Time_End": 2559.2000000000003,
      "Text": " treated that has been very good, so, maybe I shouldn't have brought that up, but nevertheless,"
    },
    {
      "Time_Start": 2559.2000000000003,
      "Time_End": 2563.78,
      "Text": " as a corollary, it's, it is a global problem, right? I mean the cyber security, cyber security"
    },
    {
      "Time_Start": 2563.78,
      "Time_End": 2568.78,
      "Text": " is sort of like the weather, like everybody depends upon it, everybody is involved in it,"
    },
    {
      "Time_Start": 2568.78,
      "Time_End": 2572.9800000000005,
      "Text": " and so for me, I am hopeful, I think there will always be conflict, that's just the way it"
    },
    {
      "Time_Start": 2572.9800000000005,
      "Time_End": 2578.7200000000003,
      "Text": " works, but I do think there is this recognition that we can really start to hurt each other"
    },
    {
      "Time_Start": 2578.7200000000003,
      "Time_End": 2582.6200000000003,
      "Text": " in cyber security, right? And I think with this new movie Oppenheimer, people have started"
    },
    {
      "Time_Start": 2582.6200000000003,
      "Time_End": 2587.2400000000002,
      "Text": " to talk about it in terms of things that happened there, and AI, and cyber, and all these"
    },
    {
      "Time_Start": 2587.2400000000002,
      "Time_End": 2591.6400000000003,
      "Text": " pieces, I don't know if that's a good corollary or not, but I do think there's hope, I do think"
    },
    {
      "Time_Start": 2591.6400000000003,
      "Time_End": 2597.1200000000003,
      "Text": " we can find a way forward on this, because it's, it's, it's a mutual problem, we all share it,"
    },
    {
      "Time_Start": 2597.1200000000003,
      "Time_End": 2600.0200000000004,
      "Text": " we can all hurt each other with it, so maybe we can try not to."
    },
    {
      "Time_Start": 2600.0200000000004,
      "Time_End": 2603.92,
      "Text": " Yeah, and I just say that, you know, all these countries want to have, you know, digital"
    },
    {
      "Time_Start": 2603.92,
      "Time_End": 2608.1000000000004,
      "Text": " transformation, they, they, they're betting their economies on that future, but without the"
    },
    {
      "Time_Start": 2608.1000000000004,
      "Time_End": 2612.6600000000003,
      "Text": " security as a, as an element to help bolster that, that could fall apart, and so I think"
    },
    {
      "Time_Start": 2612.6600000000003,
      "Time_End": 2616.9,
      "Text": " that's the, the argument to try to advance this. I wanna see if there are any questions,"
    },
    {
      "Time_Start": 2616.9,
      "Time_End": 2619.5,
      "Text": " we only have a few minutes left, but see, yeah, go to the microphone."
    },
    {
      "Time_Start": 2624.54,
      "Time_End": 2628.94,
      "Text": " So, uh, the talk was concerning, like, a lot of high-level policy change that happens from"
    },
    {
      "Time_Start": 2628.94,
      "Time_End": 2634.98,
      "Text": " the top down, but when there's a cyber incident, uh, from the lowest level, we always start"
    },
    {
      "Time_Start": 2634.98,
      "Time_End": 2641.6600000000003,
      "Text": " at attribution, so how do your guys' organizations deal with the complexity of attribution,"
    },
    {
      "Time_Start": 2641.6600000000003,
      "Time_End": 2646.6600000000003,
      "Text": " as in who did what, and how does that inform your policy, and diplomacy, and decision"
    },
    {
      "Time_Start": 2646.72,
      "Time_End": 2653.72,
      "Text": " making choices, uh, in that space? Who would like to jump in on that?"
    },
    {
      "Time_Start": 2660.7,
      "Time_End": 2664.44,
      "Text": " I, I think that's a really good question, and, um, a lot of the conversation, at least"
    },
    {
      "Time_Start": 2664.44,
      "Time_End": 2668.8399999999997,
      "Text": " from, from our vantage point, has started to shift towards that in, in large part, so,"
    },
    {
      "Time_Start": 2668.8399999999997,
      "Time_End": 2672.72,
      "Text": " um, I mentioned the Microsoft Digital Defense Report as something that we put out every"
    },
    {
      "Time_Start": 2672.7400000000002,
      "Time_End": 2677.9800000000005,
      "Text": " year, that sort of gives an assessment of the geopolitical landscape, and we as a company"
    },
    {
      "Time_Start": 2677.9800000000005,
      "Time_End": 2682.88,
      "Text": " have actually started, uh, well, have been, uh, attributing certain activities to certain,"
    },
    {
      "Time_Start": 2682.88,
      "Time_End": 2688.6000000000004,
      "Text": " um, countries that are behaving nefariously online. I think that doesn't necessarily,"
    },
    {
      "Time_Start": 2688.6000000000004,
      "Time_End": 2694.4,
      "Text": " um, inform what, what we do, we just want to share, uh, certain insights for the sake"
    },
    {
      "Time_Start": 2694.4,
      "Time_End": 2698.8,
      "Text": " of being very transparent in terms of what we're seeing, um, but it certainly is starting"
    },
    {
      "Time_Start": 2698.82,
      "Time_End": 2703.1600000000003,
      "Text": " to trickle up into, um, international, uh, negotiations of what is responsible state"
    },
    {
      "Time_Start": 2703.1600000000003,
      "Time_End": 2710.0,
      "Text": " behavior online, and how that's, how that's being colored. Um, one of the key elements"
    },
    {
      "Time_Start": 2710.0,
      "Time_End": 2716.1000000000004,
      "Text": " in the national cyber strategy is, you know, uh, encouraging and rewarding is kind of a,"
    },
    {
      "Time_Start": 2716.1000000000004,
      "Time_End": 2720.88,
      "Text": " it's a loaded phrase, so encouraging and, uh, promoting ethical state behavior, responsible"
    },
    {
      "Time_Start": 2720.88,
      "Time_End": 2726.1800000000003,
      "Text": " behavior, responsible use of technologies, um, and you combine that with, I think, this"
    },
    {
      "Time_Start": 2726.2,
      "Time_End": 2730.2,
      "Text": " is a pattern, this is my observation as a non, I don't know, I take off my government"
    },
    {
      "Time_Start": 2730.2,
      "Time_End": 2735.8799999999997,
      "Text": " hat, um, that this, uh, administration recently has been very forward leaning, I think, in"
    },
    {
      "Time_Start": 2735.8799999999997,
      "Time_End": 2740.72,
      "Text": " terms of attributing things, whether it's, you know, and, and using that strategically. Um,"
    },
    {
      "Time_Start": 2740.72,
      "Time_End": 2746.98,
      "Text": " and, uh, if an incident comes in, you know, a country comes in and says, hey, we've, we've"
    },
    {
      "Time_Start": 2746.98,
      "Time_End": 2752.5,
      "Text": " had an incident, we need assistance, we're working on it as best we can, um, there is,"
    },
    {
      "Time_Start": 2752.52,
      "Time_End": 2758.18,
      "Text": " uh, a whole, you know, series of processes that can get turned on, the attribution and once"
    },
    {
      "Time_Start": 2758.18,
      "Time_End": 2762.26,
      "Text": " we find out what's actually happened is well outside of USAID's concern, that's the, you"
    },
    {
      "Time_Start": 2762.26,
      "Time_End": 2767.86,
      "Text": " know, state department, defense and the president and all that kind of stuff, um, uh, we're"
    },
    {
      "Time_Start": 2767.86,
      "Time_End": 2772.06,
      "Text": " interested in repairing and recovering at that point, so, but I, I, you know, I, I think"
    },
    {
      "Time_Start": 2772.06,
      "Time_End": 2777.06,
      "Text": " that the, uh, caution around, um, attribution and, and, you know, utilizing, uh, what"
    },
    {
      "Time_Start": 2777.74,
      "Time_End": 2782.74,
      "Text": " information we have, uh, when we have it is, you know, there's been a little bit more of a"
    },
    {
      "Time_Start": 2785.74,
      "Time_End": 2791.24,
      "Text": " openness around that, uh, because it, it, it creates, um, kind of talking to, I had the"
    },
    {
      "Time_Start": 2791.24,
      "Time_End": 2798.2599999999998,
      "Text": " point, um, what you were saying earlier, um, about, uh, countries wanting to, uh, sort of"
    },
    {
      "Time_Start": 2798.2599999999998,
      "Time_End": 2803.16,
      "Text": " move, uh, forward and, and, oh, in terms of what commonalities are there, right, that, that,"
    },
    {
      "Time_Start": 2804.16,
      "Time_End": 2809.8399999999997,
      "Text": " that reduces conflict, um, things like ransomware, right, uh, for the most part, once you"
    },
    {
      "Time_Start": 2809.8399999999997,
      "Time_End": 2813.64,
      "Text": " have an idea of where that's coming from, that is a really shared thing where everyone is"
    },
    {
      "Time_Start": 2813.64,
      "Time_End": 2817.68,
      "Text": " getting hit by ransomware, it's not a, necessarily a nation state to nation state issue, um,"
    },
    {
      "Time_Start": 2817.68,
      "Time_End": 2822.54,
      "Text": " it can be, but, uh, that is something where there's a lot of common interest in identifying"
    },
    {
      "Time_Start": 2822.54,
      "Time_End": 2825.58,
      "Text": " where that's coming from and how to reduce it and so I think attribution there is powerful."
    },
    {
      "Time_Start": 2825.58,
      "Time_End": 2830.72,
      "Text": " Yeah. Although I would say that, uh, sometimes states act as safe havens for ransomware"
    },
    {
      "Time_Start": 2830.7200000000003,
      "Time_End": 2834.5200000000004,
      "Text": " activists and we've seen that and that, that's a challenge. And I also say it is this"
    },
    {
      "Time_Start": 2834.5200000000004,
      "Time_End": 2838.2000000000003,
      "Text": " mystery around attribution, it's a stupid, uh, cartoon of the dog on the internet, which"
    },
    {
      "Time_Start": 2838.2000000000003,
      "Time_End": 2843.6000000000004,
      "Text": " people always quote, when in fact attribution has gotten much more sophisticated, you"
    },
    {
      "Time_Start": 2843.6000000000004,
      "Time_End": 2847.94,
      "Text": " know, when it, when you have, when it walks like a duck and talks like a duck, it's a duck,"
    },
    {
      "Time_Start": 2847.94,
      "Time_End": 2852.84,
      "Text": " you know, and the motivations of nation states for prolonged conduct are easier to figure"
    },
    {
      "Time_Start": 2852.84,
      "Time_End": 2856.88,
      "Text": " out. The question is then what do you do about it, right? So attribution by the bad guys"
    },
    {
      "Time_Start": 2856.88,
      "Time_End": 2860.4800000000005,
      "Text": " use attribution like the little green men in the Ukraine where they had the patches over"
    },
    {
      "Time_Start": 2861.28,
      "Time_End": 2864.58,
      "Text": " their arms and say, oh, it wasn't us unless you have 100% proof. Well, you don't have 100%"
    },
    {
      "Time_Start": 2864.58,
      "Time_End": 2869.12,
      "Text": " proof of anything in life. So it becomes, I think, a little bit of a cycle and we have to"
    },
    {
      "Time_Start": 2869.12,
      "Time_End": 2873.58,
      "Text": " act and then go to the accountability piece. Let me take your question quickly, uh, and"
    },
    {
      "Time_Start": 2873.58,
      "Time_End": 2878.16,
      "Text": " then we'll just wrap up with a panel cause I know we're running out of time. Uh, so I take"
    },
    {
      "Time_Start": 2878.16,
      "Time_End": 2883.66,
      "Text": " notes, otherwise I ask bad questions. Um, so the gentleman from USAID, uh, mentioned, um,"
    },
    {
      "Time_Start": 2883.66,
      "Time_End": 2890.38,
      "Text": " trusted technologies. Um, do you have any confidence in the ability of the UN to regulate"
    },
    {
      "Time_Start": 2890.38,
      "Time_End": 2896.08,
      "Text": " what the off-duty activities of a lot of cyber warfare, uh, members are? So, you know,"
    },
    {
      "Time_Start": 2896.08,
      "Time_End": 2901.58,
      "Text": " there's a proliferation of, of cyber warfare capability in countries that has a large"
    },
    {
      "Time_Start": 2901.58,
      "Time_End": 2906.7200000000003,
      "Text": " number of, of trained persons who are ready and capable of doing a lot of these things."
    },
    {
      "Time_Start": 2906.7200000000003,
      "Time_End": 2911.86,
      "Text": " And are moonlighting. And they're moonlighting. And, and is there a desire to try and"
    },
    {
      "Time_Start": 2911.86,
      "Time_End": 2916.6400000000003,
      "Text": " regulate that on the UN cyber crime bill? All right. I'd ask anyone to address that. And"
    },
    {
      "Time_Start": 2916.64,
      "Time_End": 2921.64,
      "Text": " also any closing remarks you have, uh, just quickly as we go. So, I mean, I, I'd say, um,"
    },
    {
      "Time_Start": 2925.4,
      "Time_End": 2929.64,
      "Text": " you know, there are times when states are responsible for the activity of their citizens. Uh,"
    },
    {
      "Time_Start": 2929.64,
      "Time_End": 2933.8199999999997,
      "Text": " and, and they, there also is an agreement even among these UN things that if there is"
    },
    {
      "Time_Start": 2933.8199999999997,
      "Time_End": 2938.48,
      "Text": " malicious activity coming from your border and the country asks you for help, you're"
    },
    {
      "Time_Start": 2938.48,
      "Time_End": 2942.92,
      "Text": " supposed to help. You, you know, you have an obligation, at least an expectation, you'll"
    },
    {
      "Time_Start": 2942.92,
      "Time_End": 2946.06,
      "Text": " either employ your search or law enforcement to help. And when they don't, that's a safe"
    },
    {
      "Time_Start": 2946.12,
      "Time_End": 2951.62,
      "Text": " haven problem. So, there is an issue. We've seen this in countries where moonlight, uh,"
    },
    {
      "Time_Start": 2951.62,
      "Time_End": 2954.42,
      "Text": " these moonlight groups are doing things that the state doesn't want them to do. And that"
    },
    {
      "Time_Start": 2954.42,
      "Time_End": 2957.86,
      "Text": " is a problem. Uh, but often they're also doing something that the state wants them to do."
    },
    {
      "Time_Start": 2957.86,
      "Time_End": 2961.7999999999997,
      "Text": " We've seen that too. So that's, that's one thing I'd say about it. I don't know, Monty,"
    },
    {
      "Time_Start": 2961.7999999999997,
      "Time_End": 2965.24,
      "Text": " you have anything to add? Yeah, no. So, um, I, I think that's a really good question."
    },
    {
      "Time_Start": 2965.24,
      "Time_End": 2968.6,
      "Text": " Would certainly echo what you, um, mentioned, Chris. But one thing I wanted to say with"
    },
    {
      "Time_Start": 2968.6,
      "Time_End": 2972.9,
      "Text": " regards to the previous exchange we were having is that more attribution leads to more"
    },
    {
      "Time_Start": 2972.92,
      "Time_End": 2978.36,
      "Text": " accountability. And I think at this point the conversation has in fact shifted, um, to, to"
    },
    {
      "Time_Start": 2978.36,
      "Time_End": 2982.1600000000003,
      "Text": " exactly that. Right? Like there are 11 norms of responsible state behavior online. The"
    },
    {
      "Time_Start": 2982.1600000000003,
      "Time_End": 2985.7000000000003,
      "Text": " conversation is no longer like, do we need additional norms? I know there's, there's some"
    },
    {
      "Time_Start": 2985.7000000000003,
      "Time_End": 2991.64,
      "Text": " countries that are negotiating this versus not. Um, but how can you actually apply the"
    },
    {
      "Time_Start": 2991.64,
      "Time_End": 2996.2400000000002,
      "Text": " existing norms of responsible state behavior online and hold those that are actively"
    },
    {
      "Time_Start": 2996.2400000000002,
      "Time_End": 3001.12,
      "Text": " violating the norms of responsible state behavior online accountable for that? And, and"
    },
    {
      "Time_Start": 3001.14,
      "Time_End": 3004.7,
      "Text": " the problem is some of the international organizations we have are not incredibly well suited"
    },
    {
      "Time_Start": 3004.7,
      "Time_End": 3008.94,
      "Text": " to this. So, you know, the UN is great in many ways, uh, because of the participation and"
    },
    {
      "Time_Start": 3008.94,
      "Time_End": 3013.42,
      "Text": " legitimacy, but you have the UN Security Council. And if one of the bad actors is one of"
    },
    {
      "Time_Start": 3013.42,
      "Time_End": 3017.2599999999998,
      "Text": " those members of the UN Security Council, you're not going to get any consensus what they"
    },
    {
      "Time_Start": 3017.2599999999998,
      "Time_End": 3021.5,
      "Text": " need resolution out of it. They'll veto it. And that's, that's an issue. And so, so there"
    },
    {
      "Time_Start": 3021.5,
      "Time_End": 3025.0,
      "Text": " are limits that could be done. So I think we have to also see how, you know, what they"
    },
    {
      "Time_Start": 3025.0,
      "Time_End": 3029.4,
      "Text": " call like-minded groups can, can achieve. Any other just closing comments down the line"
    },
    {
      "Time_Start": 3029.42,
      "Time_End": 3033.38,
      "Text": " before we wrap up? Just really quick on- It doesn't have to be on that issue. Oh, I mean on that"
    },
    {
      "Time_Start": 3033.38,
      "Time_End": 3039.6600000000003,
      "Text": " issue. Like I, I, I can't speak to USG's, uh, kind of interest or non-interest or position"
    },
    {
      "Time_Start": 3039.6600000000003,
      "Time_End": 3044.42,
      "Text": " on wanting to, to investigate a regulator, you know, handle that sort of thing. That's, uh,"
    },
    {
      "Time_Start": 3044.42,
      "Time_End": 3050.2000000000003,
      "Text": " not in my, uh, I don't know, kind of panorama, but, um, I think it is interesting, you know,"
    },
    {
      "Time_Start": 3050.2000000000003,
      "Time_End": 3057.1,
      "Text": " that the situation with the, the, the Russian attack in Ukraine has kind of created a"
    },
    {
      "Time_Start": 3057.1,
      "Time_End": 3062.2799999999997,
      "Text": " whole weird situation that kind of dials everything to, not even 11, but like to 13. Um, like"
    },
    {
      "Time_Start": 3062.2799999999997,
      "Time_End": 3068.08,
      "Text": " the, the amount of response from allied nations there and involvement of private sector, uh,"
    },
    {
      "Time_Start": 3068.08,
      "Time_End": 3074.06,
      "Text": " and, uh, then demonstrating what USG can do in terms of response and partners and that"
    },
    {
      "Time_Start": 3074.06,
      "Time_End": 3079.3199999999997,
      "Text": " sort of thing, uh, creates, it's just a very unique case. And, and I think fosters a lot of"
    },
    {
      "Time_Start": 3079.3199999999997,
      "Time_End": 3082.4,
      "Text": " those questions and it's kind of forced all those things to the fore. So I appreciate your"
    },
    {
      "Time_Start": 3082.4,
      "Time_End": 3087.4,
      "Text": " question. It's a global problem. We need global solutions. Standards matter a lot. Well, I"
    },
    {
      "Time_Start": 3095.14,
      "Time_End": 3101.38,
      "Text": " think what, uh, the Americas region has done for the last seven years, you know, to agree all"
    },
    {
      "Time_Start": 3101.38,
      "Time_End": 3106.4,
      "Text": " the 35 member states in order to, to, uh, uh, you know, to, uh, take these diplomatic"
    },
    {
      "Time_Start": 3107.4,
      "Time_End": 3112.4,
      "Text": " procedures, these routes that are very complex and agreed upon, uh, these, uh, CBMs, for"
    },
    {
      "Time_Start": 3116.84,
      "Time_End": 3123.1800000000003,
      "Text": " example, uh, is amazing, uh, as a region. Uh, I just want to highlight one of them, uh, is to"
    },
    {
      "Time_Start": 3123.1800000000003,
      "Time_End": 3129.52,
      "Text": " encourage the leadership and participation of women in the ICT processes. Uh, so we are, we"
    },
    {
      "Time_Start": 3129.52,
      "Time_End": 3135.76,
      "Text": " are, uh, in the SICTE cyber security program, we are working on, uh, a very specific"
    },
    {
      "Time_Start": 3135.76,
      "Time_End": 3141.6600000000003,
      "Text": " project called closing the gender gap in the, uh, cyber security agenda in Latin America and"
    },
    {
      "Time_Start": 3141.6600000000003,
      "Time_End": 3148.0,
      "Text": " the Caribbean. We're working, uh, with, uh, some nations, uh, for example, working right now"
    },
    {
      "Time_Start": 3148.0,
      "Time_End": 3155.0400000000004,
      "Text": " with Costa Rica in order to, uh, uh, include the, uh, gender perspective in the national"
    },
    {
      "Time_Start": 3155.0400000000004,
      "Time_End": 3160.0400000000004,
      "Text": " cybersecurity strategy. So, uh, we are very proud of it and let's, uh, let's see how it goes."
    },
    {
      "Time_Start": 3160.64,
      "Time_End": 3165.64,
      "Text": " And last thing I'll say, I agree that, uh, global problems require global solutions, but"
    },
    {
      "Time_Start": 3169.38,
      "Time_End": 3174.7799999999997,
      "Text": " they also require a multi-stakeholder inclusion. Um, and certainly as we're thinking about"
    },
    {
      "Time_Start": 3174.7799999999997,
      "Time_End": 3180.92,
      "Text": " the, the ecosystem that is cyberspace, every stakeholder has, certainly has a role to play"
    },
    {
      "Time_Start": 3180.92,
      "Time_End": 3185.2599999999998,
      "Text": " in speaking from somewhere in the private sector. You know, we primarily own, maintain, and"
    },
    {
      "Time_Start": 3185.2599999999998,
      "Time_End": 3188.8,
      "Text": " operate a lot of the infrastructure that the internet runs on. And of course, government has a"
    },
    {
      "Time_Start": 3188.82,
      "Time_End": 3193.46,
      "Text": " key role. Civil society has a key role. So meaningful inclusion across different stakeholders."
    },
    {
      "Time_Start": 3193.46,
      "Time_End": 3198.0600000000004,
      "Text": " And I know that's an OASCBM. I know this is something that's been acknowledged across the"
    },
    {
      "Time_Start": 3198.0600000000004,
      "Time_End": 3202.6400000000003,
      "Text": " different, um, UN, uh, dialogues that we've been talking about, not only in the ad hoc committee,"
    },
    {
      "Time_Start": 3202.6400000000003,
      "Time_End": 3207.78,
      "Text": " but also at the OE, uh, OEWG. And so global problems, global solutions, but meaningful"
    },
    {
      "Time_Start": 3207.78,
      "Time_End": 3210.02,
      "Text": " multi-stakeholder inclusion is what I'd add. Thank you."
    },
    {
      "Time_Start": 3210.02,
      "Time_End": 3215.32,
      "Text": " Look, so I'll just say, you know, uh, thank you guys for coming. Uh, the point of the point of"
    },
    {
      "Time_Start": 3215.32,
      "Time_End": 3219.1400000000003,
      "Text": " this panel is to the extent you don't know these things are going on, they're going on, right?"
    },
    {
      "Time_Start": 3219.1400000000003,
      "Time_End": 3223.6200000000003,
      "Text": " And, and sometimes you think, oh, that UN stuff, that diplomacy stuff, it doesn't matter to me,"
    },
    {
      "Time_Start": 3223.6200000000003,
      "Time_End": 3228.0800000000004,
      "Text": " but it, it will matter to you. Uh, and yeah, sometimes you want to take your own life during"
    },
    {
      "Time_Start": 3228.0800000000004,
      "Time_End": 3232.82,
      "Text": " these meetings. They're like watching, uh, listening to paint dry almost, but they do make"
    },
    {
      "Time_Start": 3232.82,
      "Time_End": 3238.2200000000003,
      "Text": " progress and they do set some really important things that people aren't aware of. And I think"
    },
    {
      "Time_Start": 3238.2200000000003,
      "Time_End": 3242.1000000000004,
      "Text": " it's just important to be aware of it. There's lots of stuff online. You can find out about all"
    },
    {
      "Time_Start": 3242.12,
      "Time_End": 3249.12,
      "Text": " these processes. Obviously you can visit the sites and my organization, the, the gfc.org, uh, uh,"
    },
    {
      "Time_Start": 3249.12,
      "Time_End": 3255.42,
      "Text": " and the portal we have OAS, uh, lots online about them, uh, USAID, similarly Microsoft,"
    },
    {
      "Time_Start": 3255.42,
      "Time_End": 3261.2599999999998,
      "Text": " similarly. Uh, so there's lots of good material. I also say, I'll put in a plug. I do a podcast"
    },
    {
      "Time_Start": 3261.2599999999998,
      "Time_End": 3267.54,
      "Text": " that was, uh, the center for security internet, our security international studies, uh, CSIS,"
    },
    {
      "Time_Start": 3267.54,
      "Time_End": 3271.7799999999997,
      "Text": " uh, called inside cyber diplomacy, which I recommend to you, but there's a lot of good material"
    },
    {
      "Time_Start": 3271.78,
      "Time_End": 3276.5,
      "Text": " if you want to learn more about this, but don't be either willfully or negligibly blind about"
    },
    {
      "Time_Start": 3276.5,
      "Time_End": 3280.3,
      "Text": " the stuff that's going on because then you can't complain later on when things happen that"
    },
    {
      "Time_Start": 3280.3,
      "Time_End": 3284.46,
      "Text": " make no sense. And sometimes that happens if this community is not involved. So thank you."
    }
  ]
}