{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.04,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thank you very much and welcome everybody to the panel on the future of NFTs."
    },
    {
      "Time_Start": 7.44,
      "Time_End": 7.94,
      "Text": " Sorry."
    },
    {
      "Time_Start": 10.64,
      "Time_End": 16.240000000000002,
      "Text": " We all know what that is. So no, this is the software resilience panel, so welcome."
    },
    {
      "Time_Start": 17.28,
      "Time_End": 25.44,
      "Text": " So we have got a stellar lineup really, as you can tell, and I'm going to introduce them"
    },
    {
      "Time_Start": 26.0,
      "Time_End": 30.16,
      "Text": " on this end. So first of all, we have Camille Stewart-Gloucester,"
    },
    {
      "Time_Start": 30.8,
      "Time_End": 38.24,
      "Text": " who's the Deputy National Cyber Director at the Technology and Ecosystem Security Division"
    },
    {
      "Time_Start": 38.24,
      "Time_End": 42.8,
      "Text": " at the Office of the National Cyber Director at the White House in the United States."
    },
    {
      "Time_Start": 45.44,
      "Time_End": 47.36,
      "Text": " That's the shortest job title I've ever heard."
    },
    {
      "Time_Start": 48.96,
      "Time_End": 54.32,
      "Text": " Then we have Charlie Gladstone, who's Head of Software Resilience at the Department for"
    },
    {
      "Time_Start": 54.32,
      "Time_End": 62.480000000000004,
      "Text": " Science, Innovation and Technology in the UK. Who's this guy? Does anybody know this guy?"
    },
    {
      "Time_Start": 63.04,
      "Time_End": 73.03999999999999,
      "Text": " Let's show of hands. Nobody? Dr. Alan Friedman, who's the Senior Advisor and Strategist at the"
    },
    {
      "Time_Start": 73.03999999999999,
      "Time_End": 77.2,
      "Text": " Cyber Security and Infrastructure Security Agency, CISA, in the United States. Welcome, Alan."
    },
    {
      "Time_Start": 78.0,
      "Time_End": 84.16,
      "Text": " And myself, my name is David Rogers, and I advise the UK government on some security stuff."
    },
    {
      "Time_Start": 84.72000000000001,
      "Time_End": 89.44000000000001,
      "Text": " Also, I'm the Chair of the Fraud and Security Group at the Mobile Industry Association, the GSMA."
    },
    {
      "Time_Start": 90.08000000000001,
      "Time_End": 95.84,
      "Text": " So I'm just here to kind of facilitate here, and I'm also standing in for Jen Ellis,"
    },
    {
      "Time_Start": 95.84,
      "Time_End": 99.68,
      "Text": " who unfortunately can't be here, and we all send our best wishes as well."
    },
    {
      "Time_Start": 100.48,
      "Time_End": 104.0,
      "Text": " And hopefully, she's watching live now. Hi, Jen."
    },
    {
      "Time_Start": 105.52000000000001,
      "Time_End": 110.88000000000001,
      "Text": " So we're going to kind of split this up, and we would like to have quite a lot of audience"
    },
    {
      "Time_Start": 110.88,
      "Time_End": 117.75999999999999,
      "Text": " participation. So please, somebody's starting to fall asleep already. So yeah, you, get off your"
    },
    {
      "Time_Start": 117.75999999999999,
      "Time_End": 129.12,
      "Text": " phone. I woke you up, didn't I? It's going to get better. So we're going to talk about a global"
    },
    {
      "Time_Start": 129.12,
      "Time_End": 133.6,
      "Text": " approach to tackling software resilience, because software resilience isn't the biggest problem we"
    },
    {
      "Time_Start": 133.6,
      "Time_End": 145.28,
      "Text": " got in cyber, one of. Networks, cars, phones. We'll all be in a job anyway for a few years."
    },
    {
      "Time_Start": 145.92,
      "Time_End": 152.79999999999998,
      "Text": " So yeah, so what we're going to do is we're going to kind of flip through the risks. Well, we'll"
    },
    {
      "Time_Start": 152.79999999999998,
      "Time_End": 157.76,
      "Text": " spend a little bit of time on the risks. Then we'll talk about the challenges. Then we'll talk about"
    },
    {
      "Time_Start": 157.76,
      "Time_End": 165.04,
      "Text": " solutions. And throughout this, you can ask any question to the panelists that you like."
    },
    {
      "Time_Start": 166.0,
      "Time_End": 173.84,
      "Text": " I can't promise you that I'll answer them. To the other panelists. And yeah, we'll see how we get on."
    },
    {
      "Time_Start": 173.84,
      "Time_End": 178.16,
      "Text": " So start thinking about some of the questions that you'd like to ask the panelists. You know,"
    },
    {
      "Time_Start": 178.16,
      "Time_End": 184.64,
      "Text": " you don't get to meet these people every day, thankfully. But please do. You know, now's your"
    },
    {
      "Time_Start": 184.64000000000001,
      "Time_End": 191.76000000000002,
      "Text": " opportunity. So I'm going to start with Camille. So welcome Camille. Thanks for having me. Hi"
    },
    {
      "Time_Start": 191.76000000000002,
      "Time_End": 199.44000000000003,
      "Text": " everyone. So what does software resilience mean to you? Yeah, I'm going to start at, you know,"
    },
    {
      "Time_Start": 199.44000000000003,
      "Time_End": 210.32000000000002,
      "Text": " what my office does. How many of you are familiar with the Office of the National Cyber Director?"
    },
    {
      "Time_Start": 210.32,
      "Time_End": 219.12,
      "Text": " I love that as I do this over the last year, more hands go up in a room. But just to level set for"
    },
    {
      "Time_Start": 219.12,
      "Time_End": 224.0,
      "Text": " anyone who is not familiar, the Office of the National Cyber Director is the newest office in"
    },
    {
      "Time_Start": 224.0,
      "Time_End": 229.6,
      "Text": " the Executive Office of the President organized to orient ourselves around the national cyber"
    },
    {
      "Time_Start": 229.6,
      "Time_End": 237.84,
      "Text": " policy. How do we set an agenda for the United States around cyber policy? We aim to do that in"
    },
    {
      "Time_Start": 237.84,
      "Time_End": 244.56,
      "Text": " four ways. One, drive federal coherence. Two, embark on public-private partnerships. And when I"
    },
    {
      "Time_Start": 244.56,
      "Time_End": 248.88,
      "Text": " say private, I mean in the broadest sense, all non-federal partners, state and local, international"
    },
    {
      "Time_Start": 248.88,
      "Time_End": 256.72,
      "Text": " partners, private sector, industry, everyone. We want to align resources to aspirations. So we got"
    },
    {
      "Time_Start": 256.72,
      "Time_End": 261.04,
      "Text": " to make sure the money is there to do the work that we said we want to do. And we want to focus"
    },
    {
      "Time_Start": 261.04,
      "Time_End": 266.48,
      "Text": " on future resilience. And that's really where my division sits, is a focus on future resilience of"
    },
    {
      "Time_Start": 266.48,
      "Time_End": 272.72,
      "Text": " people and technology. And on the technology side, which is most germane to this conversation, one of"
    },
    {
      "Time_Start": 272.72,
      "Time_End": 279.84000000000003,
      "Text": " the biggest pieces of that is supply chain security. And of course within that, software supply chain"
    },
    {
      "Time_Start": 279.84000000000003,
      "Time_End": 291.44,
      "Text": " security. And at ONCD, we are really focused on thinking about the connection between the supply"
    },
    {
      "Time_Start": 291.52,
      "Time_End": 297.92,
      "Text": " chain to all of the priorities that we have set as a nation and in this international ecosystem. And"
    },
    {
      "Time_Start": 297.92,
      "Time_End": 301.84,
      "Text": " we recognize that that has to be a global endeavor. If you've taken a look at the national"
    },
    {
      "Time_Start": 301.84,
      "Time_End": 307.84,
      "Text": " cybersecurity strategy, you'll see global supply chains called out explicitly. But also what you'll"
    },
    {
      "Time_Start": 307.84,
      "Time_End": 312.24,
      "Text": " notice is that supply chain security is a thread throughout all of the pillars. That's how we"
    },
    {
      "Time_Start": 312.24,
      "Time_End": 317.28,
      "Text": " become more defensible. It's how we move towards that affirmative vision we set. It's a piece of"
    },
    {
      "Time_Start": 317.28000000000003,
      "Time_End": 322.56,
      "Text": " the puzzle as we think about shifting market forces and all of those things. And so it's a real"
    },
    {
      "Time_Start": 322.56,
      "Time_End": 329.28000000000003,
      "Text": " priority for us as an organization. And as we think about software in particular, we've really honed"
    },
    {
      "Time_Start": 329.28000000000003,
      "Time_End": 336.0,
      "Text": " in on what is the most atomic unit? And that's the code. And so how do we make sure we have"
    },
    {
      "Time_Start": 336.0,
      "Time_End": 342.96000000000004,
      "Text": " resilience in the code, that it is defensible? And that raises two things. One, how are we"
    },
    {
      "Time_Start": 342.96,
      "Time_End": 349.28,
      "Text": " thinking about open source software security? How are we focused on the most composable parts"
    },
    {
      "Time_Start": 349.28,
      "Time_End": 355.59999999999997,
      "Text": " of the ecosystem? Right? One of the greatest things about our software is that some really"
    },
    {
      "Time_Start": 355.59999999999997,
      "Time_End": 363.28,
      "Text": " smart and generous people have decided to like make code and make it available to a bunch of"
    },
    {
      "Time_Start": 363.28,
      "Time_End": 368.88,
      "Text": " people. That's something we want to incentivize. But also means that there are inconsistent"
    },
    {
      "Time_Start": 368.88,
      "Time_End": 374.32,
      "Text": " standards, that things are insecure, and we really need to focus on making sure that security"
    },
    {
      "Time_Start": 374.32,
      "Time_End": 380.44,
      "Text": " is a part of the model when we develop code. Whether it's open source, whether it's proprietary,"
    },
    {
      "Time_Start": 380.44,
      "Time_End": 385.44,
      "Text": " and most proprietary code is built on open source code as well. It includes some open source"
    },
    {
      "Time_Start": 385.44,
      "Time_End": 392.44,
      "Text": " code. So when we think about that, how are we going to advance the work there? We really want to"
    },
    {
      "Time_Start": 392.44,
      "Time_End": 396.28,
      "Text": " focus on collaborating with our partners. Our international partners, our private sector"
    },
    {
      "Time_Start": 396.28000000000003,
      "Time_End": 399.88000000000005,
      "Text": " partners, to understand the scope of the problem and the opportunities. And you'll see in the"
    },
    {
      "Time_Start": 399.88000000000005,
      "Time_End": 404.84000000000003,
      "Text": " National Cyber Security Strategy, two of the biggest ways we do that is that open source software"
    },
    {
      "Time_Start": 404.84000000000003,
      "Time_End": 409.8,
      "Text": " security initiative and software liability and thinking about that. And I'm sure we'll get into"
    },
    {
      "Time_Start": 409.8,
      "Time_End": 415.0,
      "Text": " that more as we have the conversation. But I just want to highlight those things."
    },
    {
      "Time_Start": 415.0,
      "Time_End": 417.72,
      "Text": " Good start. Okay. And over to you, Charlie."
    },
    {
      "Time_Start": 417.72,
      "Time_End": 423.40000000000003,
      "Text": " Great. Can you guys hear me all right? Super. I might actually steal your idea, Camille, because I'm"
    },
    {
      "Time_Start": 423.40000000000003,
      "Time_End": 427.64000000000004,
      "Text": " expecting probably fewer people. But could you guys raise your hands if you've heard of the UK"
    },
    {
      "Time_Start": 427.64000000000004,
      "Time_End": 433.8,
      "Text": " Department for Science, Innovation and Technology? Okay. Actually, you know, pretty good. I don't"
    },
    {
      "Time_Start": 433.8,
      "Time_End": 440.12,
      "Text": " blame you because DCIT, as we're known, was only actually created about six months ago. And it was"
    },
    {
      "Time_Start": 440.12,
      "Time_End": 446.92,
      "Text": " a sort of a new department based on a combination of what was previously the Department for Digital,"
    },
    {
      "Time_Start": 446.92,
      "Time_End": 451.48,
      "Text": " Culture, Media and Sport, which is, as you can imagine, a pretty broad department. They basically"
    },
    {
      "Time_Start": 451.48,
      "Time_End": 457.40000000000003,
      "Text": " took the D of DCMS and merged it with some different aspects of our Department for Business,"
    },
    {
      "Time_Start": 457.40000000000003,
      "Time_End": 462.44,
      "Text": " Energy and Industrial Strategy to create a new department whose sort of real overarching"
    },
    {
      "Time_Start": 462.44,
      "Time_End": 467.96000000000004,
      "Text": " ambition is to really cement the UK's position as a science and technology superpower in the world."
    },
    {
      "Time_Start": 469.48,
      "Time_End": 473.8,
      "Text": " You know, in practice, that's still an incredibly broad remit, you know, everything from sort of"
    },
    {
      "Time_Start": 473.8,
      "Time_End": 479.88,
      "Text": " space policy, science and innovation, artificial intelligence, but also, obviously, cyber security."
    },
    {
      "Time_Start": 480.84,
      "Time_End": 486.04,
      "Text": " And cyber security is split in terms of responsibilities across a few departments"
    },
    {
      "Time_Start": 486.04,
      "Time_End": 491.8,
      "Text": " in the British government. So specifically, DCIT is responsible for developing the UK's"
    },
    {
      "Time_Start": 491.8,
      "Time_End": 497.15999999999997,
      "Text": " cyber ecosystem and actually growing the sector, helping to secure the technologies that we use on"
    },
    {
      "Time_Start": 497.15999999999997,
      "Time_End": 502.76,
      "Text": " a day to day basis, and also is responsible for organisational resilience when it comes to cyber"
    },
    {
      "Time_Start": 502.76,
      "Time_End": 508.52,
      "Text": " security. So, you know, obviously, quite a few of the different themes of that, I think I'm"
    },
    {
      "Time_Start": 508.6,
      "Time_End": 513.64,
      "Text": " definitely keen to discuss today. So in terms of what the UK is interested in, I mean, I think,"
    },
    {
      "Time_Start": 513.64,
      "Time_End": 518.36,
      "Text": " I imagine most of the crowd here appreciates why software security is important, you know,"
    },
    {
      "Time_Start": 518.36,
      "Time_End": 523.08,
      "Text": " it's the absolute lifeblood of the digital economy, and is absolutely key to driving"
    },
    {
      "Time_Start": 523.08,
      "Time_End": 527.5600000000001,
      "Text": " innovation in the tech sector. But also, you know, realistically, in modern day, it's also key for"
    },
    {
      "Time_Start": 527.5600000000001,
      "Time_End": 533.5600000000001,
      "Text": " all sorts of organisations productivity. And in the UK, we are one sort of one of the largest"
    },
    {
      "Time_Start": 533.5600000000001,
      "Time_End": 539.1600000000001,
      "Text": " consumers of software in Europe. But we're also sort of have a really significant developer"
    },
    {
      "Time_Start": 539.1600000000001,
      "Time_End": 546.44,
      "Text": " presence. So I think we're sort of interested in it from from all sides. Our work sort of looking"
    },
    {
      "Time_Start": 546.44,
      "Time_End": 551.5600000000001,
      "Text": " particularly at software supply chains, stemmed from a couple of views that we held in 2021,"
    },
    {
      "Time_Start": 551.5600000000001,
      "Time_End": 557.8800000000001,
      "Text": " looking at supply chain risks relating to cyber in general. And one of the key things that came"
    },
    {
      "Time_Start": 557.8800000000001,
      "Time_End": 562.7600000000001,
      "Text": " out of that was that software supply chains weren't just the biggest risk, but they're"
    },
    {
      "Time_Start": 562.76,
      "Time_End": 567.56,
      "Text": " actually something that really needed more investigation and really more of a deep dive"
    },
    {
      "Time_Start": 567.56,
      "Time_End": 574.36,
      "Text": " into it. So in February this year, we published a call for views looking specifically at resilience"
    },
    {
      "Time_Start": 574.36,
      "Time_End": 580.52,
      "Text": " and security about software used by businesses and organisations in the UK. And there we sort of set"
    },
    {
      "Time_Start": 580.52,
      "Time_End": 585.64,
      "Text": " out some of the risks that we were identifying across the software lifecycle. We also asked"
    },
    {
      "Time_Start": 585.64,
      "Time_End": 590.92,
      "Text": " for views on sort of what industry and the sector is already doing to mitigate some of those risks."
    },
    {
      "Time_Start": 590.92,
      "Time_End": 595.24,
      "Text": " But crucially, we also asked for views on what the government should actually do about it."
    },
    {
      "Time_Start": 596.4399999999999,
      "Time_End": 600.8399999999999,
      "Text": " So that closed in May, and we've spent the last few months sort of listening to views and really"
    },
    {
      "Time_Start": 600.8399999999999,
      "Time_End": 604.8399999999999,
      "Text": " understanding the quite wide range of views that we heard through that, through that call for views."
    },
    {
      "Time_Start": 605.7199999999999,
      "Time_End": 609.0799999999999,
      "Text": " So today, I'm really keen to sort of share some of those things that we've heard."
    },
    {
      "Time_Start": 609.7199999999999,
      "Time_End": 614.1999999999999,
      "Text": " But also, I'm definitely here to listen as well. So yeah, as David said, really keen for questions."
    },
    {
      "Time_Start": 614.1999999999999,
      "Time_End": 618.52,
      "Text": " But also, I would love for anyone to just share their views on what the risks are in this space."
    },
    {
      "Time_Start": 619.24,
      "Time_End": 623.16,
      "Text": " You know, anything really. I'm definitely here to listen as well. So yeah, I mean,"
    },
    {
      "Time_Start": 623.16,
      "Time_End": 627.0,
      "Text": " thanks again to DEF CON for having me. I think hopefully this is going to be a really great"
    },
    {
      "Time_Start": 627.0,
      "Time_End": 633.0799999999999,
      "Text": " conversation. Great. You can tell that out of this panel, I'm the one that said he doesn't need a"
    },
    {
      "Time_Start": 633.08,
      "Time_End": 637.24,
      "Text": " mic. He shouldn't have a mic, I guess. He's feeling left out now, isn't he?"
    },
    {
      "Time_Start": 638.36,
      "Time_End": 645.08,
      "Text": " Borrow this for a moment. Sorry, mic is on. All right, SBOM. Hi, my name's Alan."
    },
    {
      "Time_Start": 647.64,
      "Time_End": 651.88,
      "Text": " We agreed that Alan's not allowed to talk about SBOM on the panel."
    },
    {
      "Time_Start": 652.5200000000001,
      "Time_End": 659.1600000000001,
      "Text": " This causes me physical pain. But no, right, we won't talk about the specifics of implementation"
    },
    {
      "Time_Start": 659.16,
      "Time_End": 665.56,
      "Text": " unless folks want to get into it. But when you are starting to try to build this, there are sort"
    },
    {
      "Time_Start": 665.56,
      "Time_End": 670.1999999999999,
      "Text": " of a couple of phenomena, which is that, one, everyone in the world is now a software company,"
    },
    {
      "Time_Start": 670.1999999999999,
      "Time_End": 675.88,
      "Text": " right? We all know this. We have amazing people from avionics and automotive and medical."
    },
    {
      "Time_Start": 677.4,
      "Time_End": 682.36,
      "Text": " In DC, you say law firms are software companies. And they're like, don't be ridiculous. And then"
    },
    {
      "Time_Start": 682.36,
      "Time_End": 689.96,
      "Text": " you say Panama Papers. And they say, oh, right. So we sort of have this model. And so that means"
    },
    {
      "Time_Start": 689.96,
      "Time_End": 698.04,
      "Text": " that the solutions that we advocate have to scale for the entire ecosystem. And"
    },
    {
      "Time_Start": 700.28,
      "Time_End": 707.16,
      "Text": " that started off as you start an initiative around different approaches to advancing"
    },
    {
      "Time_Start": 707.16,
      "Time_End": 713.4,
      "Text": " new technology, new paths to transparency, new tools. We all start at the same starting point."
    },
    {
      "Time_Start": 713.9599999999999,
      "Time_End": 719.16,
      "Text": " So we actually can coordinate. One of our fun challenges moving forward as we think about"
    },
    {
      "Time_Start": 719.16,
      "Time_End": 727.7199999999999,
      "Text": " resilience is we all advance at different paces. So in the cloud native world, SBOM is kind of"
    },
    {
      "Time_Start": 727.7199999999999,
      "Time_End": 733.56,
      "Text": " solved. It's boring. There's a docker command called SBOM. You know what it does? It gives you"
    },
    {
      "Time_Start": 733.5600000000001,
      "Time_End": 739.48,
      "Text": " an SBOM. Now, there are several of you in this room that I've shared the stage with who hate"
    },
    {
      "Time_Start": 740.0400000000001,
      "Time_End": 747.6400000000001,
      "Text": " when I use that example. Because, you know what? That doesn't work for a new satellite, uh,"
    },
    {
      "Time_Start": 747.6400000000001,
      "Time_End": 754.12,
      "Text": " addressable transformer. Right? They, the people that make OT, the people that make the stuff"
    },
    {
      "Time_Start": 754.12,
      "Time_End": 760.6,
      "Text": " that affects human safety, don't really use that kind of cloud native technology yet. So we need"
    },
    {
      "Time_Start": 760.6,
      "Time_End": 765.0,
      "Text": " to sort of understand that. So that's one of the higher level challenges that we have in the"
    },
    {
      "Time_Start": 765.0,
      "Time_End": 773.8000000000001,
      "Text": " policy space is how do we work with the full richness of the software community? And then"
    },
    {
      "Time_Start": 773.8000000000001,
      "Time_End": 781.0,
      "Text": " the second piece, of course, we haven't done a good job of defining resiliency. And part of the"
    },
    {
      "Time_Start": 781.0,
      "Time_End": 788.44,
      "Text": " problem is there's a famous, very popular internet pastime that was famously defined by the U.S."
    },
    {
      "Time_Start": 788.44,
      "Time_End": 795.32,
      "Text": " Supreme Court, which is, well, we don't know how to define it, but we know it when we see it. Uh,"
    },
    {
      "Time_Start": 795.32,
      "Time_End": 804.84,
      "Text": " and and resiliency, I think, fits. You remember that time that I was in the panel at the White"
    },
    {
      "Time_Start": 804.84,
      "Time_End": 815.96,
      "Text": " House? Remember when they used to let me speak in public? So part of the problem, and I think"
    },
    {
      "Time_Start": 815.96,
      "Time_End": 821.5600000000001,
      "Text": " my approach at CISA, where we look to our friends at the White House and partner with them on the"
    },
    {
      "Time_Start": 821.5600000000001,
      "Time_End": 827.32,
      "Text": " high level strategy, but a lot of the work that we do at CISA is identifying what are concrete"
    },
    {
      "Time_Start": 827.32,
      "Time_End": 834.2,
      "Text": " things that we can work on and build coalitions around, uh, that make a tangible difference. And"
    },
    {
      "Time_Start": 834.2,
      "Time_End": 839.96,
      "Text": " so, of course, we'll spend a lot of time today talking about the first step, which is transparency."
    },
    {
      "Time_Start": 839.96,
      "Time_End": 844.6800000000001,
      "Text": " Right? You gotta know what you have. You have to know what's out there. And that also creates"
    },
    {
      "Time_Start": 844.6800000000001,
      "Time_End": 853.24,
      "Text": " some challenges. So Camille talked about liability. Accountability and transparency play terribly"
    },
    {
      "Time_Start": 853.24,
      "Time_End": 859.8800000000001,
      "Text": " together. But we need both of them, right? We need a way to encourage good actors to talk about what"
    },
    {
      "Time_Start": 859.8800000000001,
      "Time_End": 864.7600000000001,
      "Text": " they're doing and have visibility, uh, not just from government regulators, but from private"
    },
    {
      "Time_Start": 864.7600000000001,
      "Time_End": 872.2,
      "Text": " contracts. Uh, right? If everyone is in the supply chain, most of us are in the middle. And so, uh,"
    },
    {
      "Time_Start": 872.2,
      "Time_End": 878.6,
      "Text": " how do we have that while still saying, you know what? If you don't do the basics, if you don't do"
    },
    {
      "Time_Start": 878.6,
      "Time_End": 884.6,
      "Text": " accepted practices, we're going to ask why. And sometime we're going to ask why with teeth. And so"
    },
    {
      "Time_Start": 884.6,
      "Time_End": 891.32,
      "Text": " that's one of the other tensions that we're going to need to resolve. Okay. So I feel like we're"
    },
    {
      "Time_Start": 891.32,
      "Time_End": 895.4000000000001,
      "Text": " talking solutions already and we haven't, we need to rewind a little bit and go, why, why are we all"
    },
    {
      "Time_Start": 895.4,
      "Time_End": 902.6,
      "Text": " sat here? Like what, what, what is it about software resiliency that is a problem? And why are we"
    },
    {
      "Time_Start": 902.6,
      "Time_End": 908.1999999999999,
      "Text": " thinking about these solutions? Are there any, I'm happy for you to give examples or, or specific"
    },
    {
      "Time_Start": 908.1999999999999,
      "Time_End": 915.4,
      "Text": " sort of things that you think are of concern. So Camille's got the mic. Yeah. So, um, much like"
    },
    {
      "Time_Start": 915.4,
      "Time_End": 922.52,
      "Text": " what Charlie talked about, we embarked on a journey in 2022 to really understand the, especially the"
    },
    {
      "Time_Start": 922.6,
      "Time_End": 927.88,
      "Text": " open source software ecosystem, but the software ecosystem as a whole and see how the federal"
    },
    {
      "Time_Start": 927.88,
      "Time_End": 935.3199999999999,
      "Text": " government should support the evolution towards a more secure environment, more secure software."
    },
    {
      "Time_Start": 935.3199999999999,
      "Time_End": 939.4,
      "Text": " And we established something called the Open Source Software Security Initiative that convenes"
    },
    {
      "Time_Start": 939.4,
      "Time_End": 944.84,
      "Text": " partners like CISA that includes DARPA and OMB and a number of other partners throughout the"
    },
    {
      "Time_Start": 944.84,
      "Time_End": 950.4399999999999,
      "Text": " federal government to really think about what is the work that we're already doing? Where does the"
    },
    {
      "Time_Start": 950.44,
      "Time_End": 957.1600000000001,
      "Text": " ecosystem need support? And what are the opportunities for us in the future to add to the"
    },
    {
      "Time_Start": 957.1600000000001,
      "Time_End": 963.5600000000001,
      "Text": " evolution that we're talking about? We went to London and we launched that initiative after we"
    },
    {
      "Time_Start": 963.5600000000001,
      "Time_End": 969.48,
      "Text": " had done this in-depth analysis. And some of the things that we found were that, you know, in"
    },
    {
      "Time_Start": 969.48,
      "Time_End": 976.7600000000001,
      "Text": " addition to malign actors trying to leverage software vulnerabilities, um, to wage attacks,"
    },
    {
      "Time_Start": 976.84,
      "Time_End": 984.2,
      "Text": " right, whether that is state actors, um, or not, there were some opportunities, right? The opacity"
    },
    {
      "Time_Start": 984.84,
      "Time_End": 992.76,
      "Text": " of the incentives for developers to incorporate security into their development life cycle,"
    },
    {
      "Time_Start": 994.28,
      "Time_End": 998.92,
      "Text": " it's not there, right? The transparency that Elle was talking about, it is hard to incentivize that"
    },
    {
      "Time_Start": 998.92,
      "Time_End": 1006.04,
      "Text": " behavior, particularly in the open source context. Um, we need transparency, better transparency"
    },
    {
      "Time_Start": 1006.0400000000001,
      "Time_End": 1010.6800000000001,
      "Text": " into the code that's in our environments of every organization, whether that is a government"
    },
    {
      "Time_Start": 1010.6800000000001,
      "Time_End": 1016.3600000000001,
      "Text": " or a private sector organization. We saw that in Spades and Log4Shell, right? Uh, there were a"
    },
    {
      "Time_Start": 1016.3600000000001,
      "Time_End": 1020.2,
      "Text": " number of organizations that the biggest part of their challenge was just figuring out what's in"
    },
    {
      "Time_Start": 1020.2,
      "Time_End": 1025.16,
      "Text": " their code base. And folks were scrambling to figure out not what was in- not only what the"
    },
    {
      "Time_Start": 1025.16,
      "Time_End": 1028.92,
      "Text": " things that they had incorporated themselves, but what their vendors had incorporated such that"
    },
    {
      "Time_Start": 1028.92,
      "Time_End": 1033.88,
      "Text": " they needed to remediate that. That's a problem. That- that's, you know, part of what Allen is"
    },
    {
      "Time_Start": 1033.88,
      "Time_End": 1038.5200000000002,
      "Text": " trying to solve with S-bombs, but something we all need to be thinking about, like, how do we"
    },
    {
      "Time_Start": 1038.5200000000002,
      "Time_End": 1044.0400000000002,
      "Text": " marry that up with the security vulnerabilities? We need better data and better connectivity"
    },
    {
      "Time_Start": 1044.0400000000002,
      "Time_End": 1049.0,
      "Text": " between something like an S-bombs and the security vulnerabilities that present themselves. And how"
    },
    {
      "Time_Start": 1049.0,
      "Time_End": 1054.3600000000001,
      "Text": " do we automate that and leverage that in a way that makes it actionable and easy to implement"
    },
    {
      "Time_Start": 1054.3600000000001,
      "Time_End": 1060.2800000000002,
      "Text": " quickly? And then another thing that we really focused on, especially in the open source context,"
    },
    {
      "Time_Start": 1060.28,
      "Time_End": 1066.44,
      "Text": " but in general, is memory-safe languages. How do we advance transitioning from memory-unsafe"
    },
    {
      "Time_Start": 1066.44,
      "Time_End": 1074.04,
      "Text": " languages to memory-safe languages? That is a huge opportunity for all of our governments, um,"
    },
    {
      "Time_Start": 1074.04,
      "Time_End": 1080.92,
      "Text": " to play a role in the evolution of the ecosystem. If we migrate large code bases from memory-unsafe"
    },
    {
      "Time_Start": 1080.92,
      "Time_End": 1085.8799999999999,
      "Text": " languages to memory-safe languages, we remediate up to 70 percent of security vulnerabilities."
    },
    {
      "Time_Start": 1085.88,
      "Time_End": 1090.44,
      "Text": " That is not the only solution, but that is a solution that we can advance in a very meaningful"
    },
    {
      "Time_Start": 1090.44,
      "Time_End": 1096.6000000000001,
      "Text": " way. So how do we do that? How do we get creative about the tools that we leverage to advance that?"
    },
    {
      "Time_Start": 1097.16,
      "Time_End": 1103.16,
      "Text": " Is it cyber insurance? Is it the liability structures that we're talking about? Is it"
    },
    {
      "Time_Start": 1103.16,
      "Time_End": 1108.6000000000001,
      "Text": " some other incentive structure that encourages this evolution and change in the market and"
    },
    {
      "Time_Start": 1108.6000000000001,
      "Time_End": 1114.2800000000002,
      "Text": " environment? And so a lot of our work has been collaborating with our international partners,"
    },
    {
      "Time_Start": 1114.28,
      "Time_End": 1120.84,
      "Text": " leveraging the insights they gain from some of their engagement with industry and our engagement"
    },
    {
      "Time_Start": 1120.84,
      "Time_End": 1125.72,
      "Text": " with industry. Like we have an RFI that we released this week on open source software security. I hope"
    },
    {
      "Time_Start": 1125.72,
      "Time_End": 1132.28,
      "Text": " all of you reply to it. We have one on regulatory harmonization. That data, that collaboration with"
    },
    {
      "Time_Start": 1132.28,
      "Time_End": 1137.3999999999999,
      "Text": " our partners, is really key towards us better understanding the space and being able to advance"
    },
    {
      "Time_Start": 1137.96,
      "Time_End": 1142.84,
      "Text": " not only things like funding and leveraging the per- the federal purse to advance behavior,"
    },
    {
      "Time_Start": 1142.84,
      "Time_End": 1148.1999999999998,
      "Text": " but what are the other ways that we can be supporting the ecosystem to drive software"
    },
    {
      "Time_Start": 1148.1999999999998,
      "Time_End": 1154.9199999999998,
      "Text": " security and software resilience? So I'm going to try and not be too repetitive,"
    },
    {
      "Time_Start": 1154.9199999999998,
      "Time_End": 1159.0,
      "Text": " and I take it as a good sign that a lot of the issues we've identified are also the ones that"
    },
    {
      "Time_Start": 1159.0,
      "Time_End": 1165.9599999999998,
      "Text": " have been identified by the White House. I think, so in our call for views, we set out a sort of a"
    },
    {
      "Time_Start": 1165.9599999999998,
      "Time_End": 1170.52,
      "Text": " full risk framework looking at risks in software development, looking at sort of barriers to"
    },
    {
      "Time_Start": 1170.52,
      "Time_End": 1175.6399999999999,
      "Text": " security in open source software, risks around the distribution of software and sort of software"
    },
    {
      "Time_Start": 1175.6399999999999,
      "Time_End": 1180.92,
      "Text": " resellers and the unique challenges around that, and also around sort of procurement, maintenance,"
    },
    {
      "Time_Start": 1180.92,
      "Time_End": 1185.24,
      "Text": " and end use by customer organizations who sort of, you know, buying a new software."
    },
    {
      "Time_Start": 1186.84,
      "Time_End": 1190.68,
      "Text": " And somewhat unhelpfully, I'd say that the views we've heard is that all of those areas are"
    },
    {
      "Time_Start": 1190.68,
      "Time_End": 1197.96,
      "Text": " important and need to be addressed, which is true. But I think in terms of sort of key threats"
    },
    {
      "Time_Start": 1197.96,
      "Time_End": 1203.48,
      "Text": " at its core, insecurely developed software is still the most important thing, and it's still"
    },
    {
      "Time_Start": 1203.48,
      "Time_End": 1207.4,
      "Text": " the thing that we've heard from all of the people we've spoken to that's the thing they're most"
    },
    {
      "Time_Start": 1207.4,
      "Time_End": 1211.32,
      "Text": " concerned about, and that actually a lot of the organizations we spoke to through this call for"
    },
    {
      "Time_Start": 1211.32,
      "Time_End": 1217.8,
      "Text": " views said that it was, if not one of the most, actually the most significant threat to their"
    },
    {
      "Time_Start": 1217.8,
      "Time_End": 1223.08,
      "Text": " organization's resilience. You know, it was either software that has accidentally introduced"
    },
    {
      "Time_Start": 1223.08,
      "Time_End": 1228.1999999999998,
      "Text": " vulnerabilities or intentionally introduced vulnerabilities. So, you know, there are a lot"
    },
    {
      "Time_Start": 1228.1999999999998,
      "Time_End": 1236.12,
      "Text": " of different threats here, but to some extent, the most fundamental one remains the key issue, right?"
    },
    {
      "Time_Start": 1237.48,
      "Time_End": 1242.84,
      "Text": " But we did also hear a lot of the same things that Camille was talking about. I think memory"
    },
    {
      "Time_Start": 1242.84,
      "Time_End": 1247.24,
      "Text": " unsafe language came up a lot, as did the use of secure development environments."
    },
    {
      "Time_Start": 1247.96,
      "Time_End": 1254.04,
      "Text": " But at its core, the issue that I think a lot of people identified was, as you were saying,"
    },
    {
      "Time_Start": 1254.04,
      "Time_End": 1260.68,
      "Text": " that the market incentives just aren't there to prioritize secure development. And while"
    },
    {
      "Time_Start": 1261.4,
      "Time_End": 1266.76,
      "Text": " this is a challenge for software vendors, the actual core problem is also that customers and"
    },
    {
      "Time_Start": 1266.76,
      "Time_End": 1271.8,
      "Text": " the organizations who buy this software fundamentally only care about two things. It's, you know, how"
    },
    {
      "Time_Start": 1271.8,
      "Time_End": 1278.52,
      "Text": " well does it work and how cheap is it? And security is often a second thought, right? And if"
    },
    {
      "Time_Start": 1279.1599999999999,
      "Time_End": 1283.48,
      "Text": " securely developing your software isn't a thing that allows you to differentiate your product in"
    },
    {
      "Time_Start": 1283.48,
      "Time_End": 1288.2,
      "Text": " the market, then it's not going to be something which companies are investing huge amounts of"
    },
    {
      "Time_Start": 1288.2,
      "Time_End": 1293.72,
      "Text": " money in. So I think it's a really massive challenge. And yeah, I mean, we'll get on to"
    },
    {
      "Time_Start": 1293.72,
      "Time_End": 1297.72,
      "Text": " solutions, but I think, you know, we do need to think more about how the government can influence"
    },
    {
      "Time_Start": 1297.72,
      "Time_End": 1302.84,
      "Text": " that and try and address that sort of market thing. So I just want to break that down a little"
    },
    {
      "Time_Start": 1302.84,
      "Time_End": 1308.1200000000001,
      "Text": " bit. So what you're saying is about insecurely developed software, but also obviously the"
    },
    {
      "Time_Start": 1308.1200000000001,
      "Time_End": 1314.1200000000001,
      "Text": " languages, you know, we don't, you know, there's a lack of type safety and memory safety issues,"
    },
    {
      "Time_Start": 1314.1200000000001,
      "Time_End": 1320.04,
      "Text": " but we're starting to see the languages come through. But surely there's an education question"
    },
    {
      "Time_Start": 1320.04,
      "Time_End": 1326.6000000000001,
      "Text": " for developers as well. So most of us who've done software engineering degrees know that there's no"
    },
    {
      "Time_Start": 1326.6000000000001,
      "Time_End": 1332.5200000000002,
      "Text": " mandatory security modules in, and most of the software engineers that I work with don't have a"
    },
    {
      "Time_Start": 1332.5200000000002,
      "Time_End": 1337.3200000000002,
      "Text": " clue about secure development, even though there's plenty of secure coding books out there. One of my"
    },
    {
      "Time_Start": 1337.3200000000002,
      "Time_End": 1342.7600000000002,
      "Text": " students, I showed him, there was a, so does anybody remember Stage Fright, the vulnerability"
    },
    {
      "Time_Start": 1342.7600000000002,
      "Time_End": 1350.2800000000002,
      "Text": " on Android 2015? And I was looking for this secure coding book and it said, it was written in 2003,"
    },
    {
      "Time_Start": 1351.0,
      "Time_End": 1357.96,
      "Text": " so Stage Fright was an integer overflow issue. And it said, you know, here's how you solve"
    },
    {
      "Time_Start": 1357.96,
      "Time_End": 1364.2,
      "Text": " integer overflow books. And then it said, by 2009, integer overflow books should be a thing of the"
    },
    {
      "Time_Start": 1364.2,
      "Time_End": 1372.76,
      "Text": " past. And then we were at 2015. But, you know, so how does education fit into this? Can I quickly"
    },
    {
      "Time_Start": 1372.76,
      "Time_End": 1378.52,
      "Text": " jump in again? So I think this is a really important thing. And, you know, when preparing"
    },
    {
      "Time_Start": 1378.52,
      "Time_End": 1382.2,
      "Text": " for this talk, I was thinking about both sort of short-term things that the government can really"
    },
    {
      "Time_Start": 1382.2,
      "Time_End": 1386.76,
      "Text": " do to quickly address this, but also I think one of the government's role is to really do that"
    },
    {
      "Time_Start": 1386.76,
      "Time_End": 1390.68,
      "Text": " long-term investment piece, right? And yeah, as you were saying, I think a lot of the stakeholders"
    },
    {
      "Time_Start": 1390.68,
      "Time_End": 1395.56,
      "Text": " we spoke to said, why isn't this a core part of all software development courses? And I think the"
    },
    {
      "Time_Start": 1395.56,
      "Time_End": 1401.4,
      "Text": " UK is making some inroads at trying to change that. So the National Cyber Security Centre has"
    },
    {
      "Time_Start": 1401.4,
      "Time_End": 1407.96,
      "Text": " a specific certification regime for university degrees that include sort of core cyber"
    },
    {
      "Time_Start": 1407.96,
      "Time_End": 1414.28,
      "Text": " essentials in the software development courses for both undergraduate and postgraduate."
    },
    {
      "Time_Start": 1415.16,
      "Time_End": 1419.96,
      "Text": " And also the UK's Cyber Security Council is working on the sort of formal and structural"
    },
    {
      "Time_Start": 1419.96,
      "Time_End": 1424.04,
      "Text": " professionalization of the cyber profession, which I think will really help. But"
    },
    {
      "Time_Start": 1425.0,
      "Time_End": 1429.48,
      "Text": " I think actually that long-term view is one of the most important roles that government has,"
    },
    {
      "Time_Start": 1429.48,
      "Time_End": 1435.0,
      "Text": " because it will obviously take a long time for all those people who are being trained to make"
    },
    {
      "Time_Start": 1435.0,
      "Time_End": 1438.76,
      "Text": " a difference in the actual market, right? It takes a while for those skills to get through the"
    },
    {
      "Time_Start": 1438.76,
      "Time_End": 1443.64,
      "Text": " system, but that doesn't mean that we shouldn't be doing it. I think there probably is more that"
    },
    {
      "Time_Start": 1443.64,
      "Time_End": 1449.8,
      "Text": " governments can do to make sure that security is almost sort of, it's not an afterthought, right?"
    },
    {
      "Time_Start": 1449.8,
      "Time_End": 1454.36,
      "Text": " And that it's there from the beginning. But yeah, I think we've already done some good stuff in the"
    },
    {
      "Time_Start": 1454.36,
      "Time_End": 1460.6,
      "Text": " UK and I'm hoping that we'll be able to expand that further. I'm so glad you brought that up."
    },
    {
      "Time_Start": 1460.6000000000001,
      "Time_End": 1465.96,
      "Text": " On Monday, we released, last Monday, the National Cyber Workforce and Education Strategy"
    },
    {
      "Time_Start": 1465.96,
      "Time_End": 1472.5200000000002,
      "Text": " that addresses exactly this. To your point, yes, the government has a large role in driving towards"
    },
    {
      "Time_Start": 1472.5200000000002,
      "Time_End": 1479.88,
      "Text": " educating developers or anyone about cyber security and cyber in general. And our strategy really"
    },
    {
      "Time_Start": 1480.92,
      "Time_End": 1485.2400000000002,
      "Text": " wants to start at the beginning and really wants to make sure that every person is equipped with"
    },
    {
      "Time_Start": 1485.24,
      "Time_End": 1490.68,
      "Text": " some foundational cyber skills that we can then build upon. Because we recognize that having"
    },
    {
      "Time_Start": 1490.68,
      "Time_End": 1496.2,
      "Text": " skills-based hiring, skills-based training is going to be essential to doing exactly this, right?"
    },
    {
      "Time_Start": 1496.2,
      "Time_End": 1503.16,
      "Text": " If when you became a developer, you didn't have security as part of your curriculum, that should"
    },
    {
      "Time_Start": 1503.16,
      "Time_End": 1509.56,
      "Text": " not mean that part of your professional evolution does not include training that focuses on security."
    },
    {
      "Time_Start": 1509.56,
      "Time_End": 1515.48,
      "Text": " Your skill set should evolve with the ecosystem and the things that we now recognize that we need."
    },
    {
      "Time_Start": 1515.48,
      "Time_End": 1520.44,
      "Text": " And so we need to build an education and training apparatus and a broader ecosystem that supports"
    },
    {
      "Time_Start": 1520.44,
      "Time_End": 1527.0,
      "Text": " you on that professional journey. It is a project for everyone though, right? We should not only"
    },
    {
      "Time_Start": 1527.0,
      "Time_End": 1532.6799999999998,
      "Text": " look to our governments to drive this, but private sector, community organizations, all of us need to"
    },
    {
      "Time_Start": 1532.6799999999998,
      "Time_End": 1537.72,
      "Text": " band together to really think about what those pieces and parts are. That said, on the other side,"
    },
    {
      "Time_Start": 1537.72,
      "Time_End": 1542.6000000000001,
      "Text": " one of the things we talk about in the national cyber security strategy is that we should be"
    },
    {
      "Time_Start": 1542.6000000000001,
      "Time_End": 1548.1200000000001,
      "Text": " shifting the burden from the small players to the big players. So in that education journey, we should"
    },
    {
      "Time_Start": 1548.1200000000001,
      "Time_End": 1555.32,
      "Text": " be thinking about how we put more of the onus on the tools that developers use to build security"
    },
    {
      "Time_Start": 1555.32,
      "Time_End": 1562.92,
      "Text": " into the cycle, the life cycle, the frameworks, the tools that they use to develop code and implement"
    },
    {
      "Time_Start": 1563.0800000000002,
      "Time_End": 1569.5600000000002,
      "Text": " it into a code base as another avenue for advancing security outcomes. So we need to pair these things"
    },
    {
      "Time_Start": 1569.5600000000002,
      "Time_End": 1574.6000000000001,
      "Text": " up. But I encourage you to read that strategy because it talks a lot, the workforce strategy,"
    },
    {
      "Time_Start": 1574.6000000000001,
      "Time_End": 1581.88,
      "Text": " because it talks a lot about partnering with universities and employers to better understand"
    },
    {
      "Time_Start": 1581.88,
      "Time_End": 1587.24,
      "Text": " their needs and to drive education outcomes. It talks about accreditation bodies. It is not an"
    },
    {
      "Time_Start": 1587.24,
      "Time_End": 1593.88,
      "Text": " easy thing to change curriculum at any level, whether it's K through 12 or at the university"
    },
    {
      "Time_Start": 1593.88,
      "Time_End": 1599.16,
      "Text": " level. And so that is a long-term investment that we must make now if we want to see the dividends"
    },
    {
      "Time_Start": 1599.16,
      "Time_End": 1606.52,
      "Text": " paid out from that. But we also, as organizations, should demand of and prepare our staff for those"
    },
    {
      "Time_Start": 1606.52,
      "Time_End": 1610.84,
      "Text": " things. I mean, if we are going to do the things that we talked about in terms of secure by design"
    },
    {
      "Time_Start": 1610.84,
      "Time_End": 1615.48,
      "Text": " and driving towards a more secure ecosystem, then that means we have to equip the people to support"
    },
    {
      "Time_Start": 1615.48,
      "Time_End": 1622.68,
      "Text": " that work. And so recognizing that every profession that works in the technology space, which is why"
    },
    {
      "Time_Start": 1622.68,
      "Time_End": 1628.3600000000001,
      "Text": " the strategy is focused on cyber, not cybersecurity, requires you to have some measure of security"
    },
    {
      "Time_Start": 1628.3600000000001,
      "Time_End": 1633.56,
      "Text": " skills, is something we articulate very clearly in the strategy. Because quite frankly, our engineers,"
    },
    {
      "Time_Start": 1633.56,
      "Time_End": 1639.4,
      "Text": " our developers, they should all understand what security is and how it can be built into the"
    },
    {
      "Time_Start": 1639.4,
      "Time_End": 1644.6,
      "Text": " things that they make. While we still have cybersecurity practitioners who can focus on"
    },
    {
      "Time_Start": 1644.6000000000001,
      "Time_End": 1653.16,
      "Text": " end point security and some of the other things. So since, since they've got the important high"
    },
    {
      "Time_Start": 1653.16,
      "Time_End": 1663.96,
      "Text": " level views, I will say that I know some developers. I've been friends with a few of them. I'm, I'm not"
    },
    {
      "Time_Start": 1663.96,
      "Time_End": 1670.92,
      "Text": " going to say that they're not smart, but I'm also not going to say that they're paying attention."
    },
    {
      "Time_Start": 1670.92,
      "Time_End": 1676.8400000000001,
      "Text": " They have to pay every two months, there's a new framework. Every three months, there's a new"
    },
    {
      "Time_Start": 1676.8400000000001,
      "Time_End": 1686.8400000000001,
      "Text": " platform. They're busy trying to keep up with tech. And we've tried. The next generation definitely"
    },
    {
      "Time_Start": 1686.8400000000001,
      "Time_End": 1692.68,
      "Text": " needs to be included. But one of the things we're going to be doing is one, how do we make it so"
    },
    {
      "Time_Start": 1692.68,
      "Time_End": 1699.0800000000002,
      "Text": " that they don't have to think about security? This is the famous shift left model. This is the famous,"
    },
    {
      "Time_Start": 1699.08,
      "Time_End": 1705.56,
      "Text": " uh, the second DevSecOps is what are the tools that we can bring into the process so that you"
    },
    {
      "Time_Start": 1705.56,
      "Time_End": 1714.6799999999998,
      "Text": " can't commit code that goes, pulls from something that's known bad. Uh, that your repo that you're"
    },
    {
      "Time_Start": 1714.6799999999998,
      "Time_End": 1721.48,
      "Text": " pulling from is actually maintained by the security team as well as the dev team. Uh, and so there are"
    },
    {
      "Time_Start": 1721.48,
      "Time_End": 1727.56,
      "Text": " things that we can do today as we move towards this. And then again, also shifting to better"
    },
    {
      "Time_Start": 1727.56,
      "Time_End": 1734.9199999999998,
      "Text": " ecosystems. You can't do a buffer overflow in Golang. Actually, it's not true. I saw someone try"
    },
    {
      "Time_Start": 1734.9199999999998,
      "Time_End": 1741.0,
      "Text": " to figure out how, but it was really hard. Like it was a very smart person to figure out. So, um,"
    },
    {
      "Time_Start": 1741.0,
      "Time_End": 1747.08,
      "Text": " and that gets back to the model of what are we, what are we trying to do with the rep threats? And"
    },
    {
      "Time_Start": 1747.08,
      "Time_End": 1752.76,
      "Text": " there are a couple of things. One of them is just known badness. And Rick Camille's talked a lot"
    },
    {
      "Time_Start": 1752.76,
      "Time_End": 1756.92,
      "Text": " about vulnerabilities. Uh, and we, we know that world and it's not just the, the public"
    },
    {
      "Time_Start": 1756.92,
      "Time_End": 1761.72,
      "Text": " ecosystems. It's not just the CVEs. There are private feeds, but there are other types of known"
    },
    {
      "Time_Start": 1761.72,
      "Time_End": 1769.48,
      "Text": " madness. So, uh, resilience is this huge issue in open source. Uh, last Christmas, there was a"
    },
    {
      "Time_Start": 1769.48,
      "Time_End": 1775.8,
      "Text": " great blog post by a French open source developer, not in the security field. And the title of the"
    },
    {
      "Time_Start": 1775.8,
      "Time_End": 1783.48,
      "Text": " blog post was, I am not your supply chain. Uh, because from his perspective, he provides"
    },
    {
      "Time_Start": 1783.48,
      "Time_End": 1793.48,
      "Text": " software as is any other problems you have or your problems. Now that's not true for when the US"
    },
    {
      "Time_Start": 1793.48,
      "Time_End": 1798.6,
      "Text": " government buys software, it's our problem and it's our suppliers problem. And so that's the"
    },
    {
      "Time_Start": 1798.6,
      "Time_End": 1805.0,
      "Text": " fun tension of thinking about that resilience. What do we do about, I hate the term bus problem"
    },
    {
      "Time_Start": 1805.0,
      "Time_End": 1810.28,
      "Text": " called the ukulele problem. Most people don't know that it's a lot more fun to learn to play"
    },
    {
      "Time_Start": 1810.28,
      "Time_End": 1815.56,
      "Text": " the ukulele than it is to maintain open source software. Uh, and so we need to make sure that"
    },
    {
      "Time_Start": 1815.56,
      "Time_End": 1821.08,
      "Text": " projects won't go away if someone decides to do something a lot more fun. And then one, one more"
    },
    {
      "Time_Start": 1821.08,
      "Time_End": 1825.88,
      "Text": " thing that I also want to put on the table that sort of in the known badness capability, it's a"
    },
    {
      "Time_Start": 1825.88,
      "Time_End": 1833.72,
      "Text": " little more subtle is tech debt. Um, right. We, we have got to find a way of wrestling this. And"
    },
    {
      "Time_Start": 1833.72,
      "Time_End": 1840.92,
      "Text": " this is one of those key for resilience models where if you're about to buy a product or buying"
    },
    {
      "Time_Start": 1840.92,
      "Time_End": 1847.64,
      "Text": " to, uh, an architecture, what's that going to cost you? What's your total cost of ownership?"
    },
    {
      "Time_Start": 1847.64,
      "Time_End": 1854.2,
      "Text": " Because if you're, if, if what you're buying is already outdated, uh, then you're going to have"
    },
    {
      "Time_Start": 1854.2,
      "Time_End": 1860.28,
      "Text": " some real problems down the road and not even a security issue. This is a dollar and cents issue."
    },
    {
      "Time_Start": 1860.36,
      "Time_End": 1864.6,
      "Text": " Someone's going to pay for it. And who is going to end up bearing that cost?"
    },
    {
      "Time_Start": 1866.76,
      "Time_End": 1871.32,
      "Text": " Yeah. So this is what was springing to mind as I was listening to this. So as a software"
    },
    {
      "Time_Start": 1871.32,
      "Time_End": 1877.96,
      "Text": " developer myself, and I think there was a recent tweet that we all saw about, um, this demand"
    },
    {
      "Time_Start": 1877.96,
      "Time_End": 1882.36,
      "Text": " that had come down to this open source library developer saying, you know, there's a serious"
    },
    {
      "Time_Start": 1882.36,
      "Time_End": 1886.68,
      "Text": " vulnerability in your, in your library. You need to fix it now within the next 48 hours."
    },
    {
      "Time_Start": 1887.64,
      "Time_End": 1891.8,
      "Text": " And this guy, I think quite rightly pointed out, he said, like, I recognize the severity of this"
    },
    {
      "Time_Start": 1891.8,
      "Time_End": 1896.68,
      "Text": " issue. I'm not like saying that's, that's not an issue. He said, but like, I don't get paid for"
    },
    {
      "Time_Start": 1896.68,
      "Time_End": 1902.44,
      "Text": " this. And you're like this big tech company and you're using my stuff for free. And I think this"
    },
    {
      "Time_Start": 1902.44,
      "Time_End": 1907.48,
      "Text": " has been a perennial problem for anyone involved in open source is, is basically these companies"
    },
    {
      "Time_Start": 1907.48,
      "Time_End": 1913.4,
      "Text": " that essentially abusing open source, half of them aren't contributing anything back. Some of"
    },
    {
      "Time_Start": 1913.4,
      "Time_End": 1919.88,
      "Text": " them aren't declaring they're using it. And they're, you know, it's the XKCD picture with"
    },
    {
      "Time_Start": 1919.88,
      "Time_End": 1926.0400000000002,
      "Text": " Dave at the bottom, right? Maintaining this vitally critical library. Like, you know,"
    },
    {
      "Time_Start": 1926.0400000000002,
      "Time_End": 1933.5600000000002,
      "Text": " what, what do we do to compensate open source developers or prevent big tech companies"
    },
    {
      "Time_Start": 1933.5600000000002,
      "Time_End": 1938.2800000000002,
      "Text": " essentially creating their own forks and maintaining and then syncing it whenever they"
    },
    {
      "Time_Start": 1938.28,
      "Time_End": 1944.92,
      "Text": " like? How do we deal with that problem? I think those are the points about building things"
    },
    {
      "Time_Start": 1944.92,
      "Time_End": 1949.56,
      "Text": " into the tools and make it easier for developers to, you know, incorporate security from the"
    },
    {
      "Time_Start": 1949.56,
      "Time_End": 1954.92,
      "Text": " beginning and also the liability structure. I know that, you know, building out a liability"
    },
    {
      "Time_Start": 1954.92,
      "Time_End": 1959.0,
      "Text": " structure will be complex. It will be tough. And what we are trying to do is make sure that we"
    },
    {
      "Time_Start": 1959.0,
      "Time_End": 1963.48,
      "Text": " are doing it in partnership with developers and companies to understand the implications of what"
    },
    {
      "Time_Start": 1963.48,
      "Time_End": 1972.68,
      "Text": " we are trying to build. But if liability falls on organizations, not on developers, it can"
    },
    {
      "Time_Start": 1972.68,
      "Time_End": 1977.4,
      "Text": " start to incentivize an ecosystem where they're not abusing developers, where developers are"
    },
    {
      "Time_Start": 1977.4,
      "Time_End": 1982.68,
      "Text": " feeding into something that doesn't disincentivize them from participating and from creating"
    },
    {
      "Time_Start": 1982.68,
      "Time_End": 1988.76,
      "Text": " these things. It is a feeding ecosystem apparatus, right? This, this should help with those"
    },
    {
      "Time_Start": 1988.76,
      "Time_End": 1993.0,
      "Text": " market shifts. I mean, it won't be the only thing that drives that, but I do think software"
    },
    {
      "Time_Start": 1993.0,
      "Time_End": 1999.56,
      "Text": " liability, um, will need to be a tool in our toolkit if we are going to drive towards, um,"
    },
    {
      "Time_Start": 1999.56,
      "Time_End": 2005.08,
      "Text": " remediating that kind of abuse of developers and driving towards the security outcomes that"
    },
    {
      "Time_Start": 2005.08,
      "Time_End": 2010.68,
      "Text": " we want to see. So on, on top of that, actually, I just want to add to this. So one of the"
    },
    {
      "Time_Start": 2010.68,
      "Time_End": 2016.84,
      "Text": " other problems that we have with open source, this sort of, uh, paradox, which is, well, open"
    },
    {
      "Time_Start": 2016.8400000000001,
      "Time_End": 2021.3200000000002,
      "Text": " source is available to everyone at peer review, but as we all know, the only people who have peer"
    },
    {
      "Time_Start": 2021.3200000000002,
      "Time_End": 2026.68,
      "Text": " review in the security bits are usually the people who want to break it and attack it. Um, is there,"
    },
    {
      "Time_Start": 2026.68,
      "Time_End": 2032.6000000000001,
      "Text": " is there any way that we can, can solve, uh, that issue in the future? Or is that, is that really"
    },
    {
      "Time_Start": 2032.6000000000001,
      "Time_End": 2037.88,
      "Text": " part and parcel of, of what you're putting forward in terms of shifting the market so that the"
    },
    {
      "Time_Start": 2037.88,
      "Time_End": 2043.0000000000002,
      "Text": " companies take responsibility for the open source they're using and essentially pay these people?"
    },
    {
      "Time_Start": 2043.16,
      "Time_End": 2045.08,
      "Text": " Is that right?"
    },
    {
      "Time_Start": 2045.08,
      "Time_End": 2051.4,
      "Text": " Yeah, I think so. I mean, I think what we need is a structure that makes it very clear who's"
    },
    {
      "Time_Start": 2051.4,
      "Time_End": 2057.88,
      "Text": " accountable and then that will drive where we see that review happening, right? If it's not the"
    },
    {
      "Time_Start": 2057.88,
      "Time_End": 2061.88,
      "Text": " developers and it's the organization, then they'll do the peer review to make sure that the code"
    },
    {
      "Time_Start": 2061.88,
      "Time_End": 2066.88,
      "Text": " is sound before they put it into, uh, their code base. They will keep an eye on it. They'll"
    },
    {
      "Time_Start": 2066.88,
      "Time_End": 2072.32,
      "Text": " maintain it. They'll know what vulnerabilities they're introducing into their environment. If"
    },
    {
      "Time_Start": 2072.32,
      "Time_End": 2078.88,
      "Text": " we don't, then there's no incentive on either end to do anything about that. And we continue to"
    },
    {
      "Time_Start": 2078.88,
      "Time_End": 2085.12,
      "Text": " hope that developers will maintain their code that they created out of the goodness of their heart"
    },
    {
      "Time_Start": 2085.12,
      "Time_End": 2090.6,
      "Text": " or to assume that companies, especially the smaller ones, not necessarily the bigger ones, they"
    },
    {
      "Time_Start": 2090.6,
      "Time_End": 2096.3,
      "Text": " might have the infrastructure and the staffing to be able to review code line by line. But these"
    },
    {
      "Time_Start": 2096.32,
      "Time_End": 2100.46,
      "Text": " smaller organizations that are trusting that this thing that they grabbed or have no idea that"
    },
    {
      "Time_Start": 2100.46,
      "Time_End": 2105.46,
      "Text": " some developer that they hired to help them build out a thing, um, is using open source code,"
    },
    {
      "Time_Start": 2108.04,
      "Time_End": 2112.84,
      "Text": " they don't have the infrastructure and the support to be able to, to do that peer review. So how"
    },
    {
      "Time_Start": 2112.84,
      "Time_End": 2118.2400000000002,
      "Text": " do we build out an environment that really helps you know where the accountability lies and"
    },
    {
      "Time_Start": 2118.2400000000002,
      "Time_End": 2121.48,
      "Text": " then you'll build in the infrastructure to be able to use that."
    },
    {
      "Time_Start": 2121.5,
      "Time_End": 2128.5,
      "Text": " So there are some built in advantages to the ecosystem as well. So there are a couple dozen"
    },
    {
      "Time_Start": 2128.5,
      "Time_End": 2132.78,
      "Text": " startups out there that just say, oh, well, how are we going to test our tool and show that it"
    },
    {
      "Time_Start": 2132.78,
      "Time_End": 2138.92,
      "Text": " scales? We will just run our tool against all the source on GitHub and identify and propose"
    },
    {
      "Time_Start": 2138.92,
      "Time_End": 2143.12,
      "Text": " things and, and measure things. So that's one piece where there are some structural advantages"
    },
    {
      "Time_Start": 2143.12,
      "Time_End": 2148.92,
      "Text": " that we can start to do. And there are innovators that are starting to engage in this. One of the"
    },
    {
      "Time_Start": 2148.94,
      "Time_End": 2154.98,
      "Text": " challenges we're working on collectively with this and the White House is you'd be surprised."
    },
    {
      "Time_Start": 2154.98,
      "Time_End": 2159.62,
      "Text": " Everyone thinks the government has a lot of money and they're not wrong, but it turns out it's"
    },
    {
      "Time_Start": 2159.62,
      "Time_End": 2165.12,
      "Text": " surprisingly hard for us to spend it in new ways. And so that's some of the work we're doing."
    },
    {
      "Time_Start": 2165.12,
      "Time_End": 2171.56,
      "Text": " Uh, so that's one piece. Two is figuring out where to prioritize. So there's a great research"
    },
    {
      "Time_Start": 2171.56,
      "Time_End": 2176.0,
      "Text": " by old friend of mine, Frank Nagle up at Harvard business, uh, that has sort of said, well,"
    },
    {
      "Time_Start": 2176.02,
      "Time_End": 2181.02,
      "Text": " what are the most used open source libraries? Uh, but like a lot of research, that data came"
    },
    {
      "Time_Start": 2184.66,
      "Time_End": 2190.86,
      "Text": " from the data that we had, which was modern applications. So we found out, right? Hey, this"
    },
    {
      "Time_Start": 2190.86,
      "Time_End": 2195.86,
      "Text": " is what's used in modern apps. CISA cares about really fun web applications. We do, but our real"
    },
    {
      "Time_Start": 2196.34,
      "Time_End": 2201.34,
      "Text": " priority is saving lives. It's the fundamental risks that affect all of society. And so one of"
    },
    {
      "Time_Start": 2210.48,
      "Time_End": 2215.36,
      "Text": " our projects that I'm really excited about that we've got CISA has an office, DHS is an office"
    },
    {
      "Time_Start": 2215.36,
      "Time_End": 2220.1600000000003,
      "Text": " of the chief economist. Uh, so our economists are partnering with our vulnerability experts to"
    },
    {
      "Time_Start": 2220.2,
      "Time_End": 2226.2999999999997,
      "Text": " figure out, uh, what are the most important pieces of open source software for critical"
    },
    {
      "Time_Start": 2226.2999999999997,
      "Time_End": 2231.94,
      "Text": " infrastructure, uh, measured quite broadly. And so that's going to allow us to sort of say,"
    },
    {
      "Time_Start": 2231.94,
      "Time_End": 2238.68,
      "Text": " this is where we should be focusing. I also want to flag one thing. I feel in security, we don't"
    },
    {
      "Time_Start": 2238.68,
      "Time_End": 2243.3799999999997,
      "Text": " often give ourselves a little pat on the back. So I want to acknowledge something that we've"
    },
    {
      "Time_Start": 2243.3799999999997,
      "Time_End": 2248.3999999999996,
      "Text": " learned to do. One of the first things I tackled when I joined government, uh, back in 2040,"
    },
    {
      "Time_Start": 2250.66,
      "Time_End": 2257.6,
      "Text": " or something like that, was look at vulnerability disclosure. And those of you who've been"
    },
    {
      "Time_Start": 2257.6,
      "Time_End": 2263.68,
      "Text": " coming to DEF CON for a while, excuse me, those of you who've been coming to DEF CON for a"
    },
    {
      "Time_Start": 2263.68,
      "Time_End": 2269.18,
      "Text": " while, remember it was not that long ago when that was a controversial topic. That was"
    },
    {
      "Time_Start": 2269.18,
      "Time_End": 2274.18,
      "Text": " fighting words, right? Remember no free bugs? Um, and this is now a solved problem. Our friends"
    },
    {
      "Time_Start": 2275.18,
      "Time_End": 2280.18,
      "Text": " in the UK have openly embraced it. Our friends in the Netherlands have been way ahead of the"
    },
    {
      "Time_Start": 2282.3199999999997,
      "Time_End": 2287.2599999999998,
      "Text": " United States on embracing the role of legitimate security. Um, governments from around the"
    },
    {
      "Time_Start": 2287.2599999999998,
      "Time_End": 2292.06,
      "Text": " world and different parts of the US government are all coming to DEF CON. Why? Because we"
    },
    {
      "Time_Start": 2292.06,
      "Time_End": 2296.7999999999997,
      "Text": " want to embrace the security research community. So in the open source, that, that is sort of"
    },
    {
      "Time_Start": 2296.7999999999997,
      "Time_End": 2302.7,
      "Text": " one of those fundamental pieces of resilience that I think we've got solved. Even the most"
    },
    {
      "Time_Start": 2302.7200000000003,
      "Time_End": 2308.8,
      "Text": " vicious corporate lawyers have at least been yelled at by their PR team saying, if you sue"
    },
    {
      "Time_Start": 2308.8,
      "Time_End": 2315.7000000000003,
      "Text": " this hacker, it will go poorly for us. Even if we're right, uh, it will not go well for us."
    },
    {
      "Time_Start": 2315.7000000000003,
      "Time_End": 2320.44,
      "Text": " We'll lose in the court of public opinion. And so that's one of those areas where we can sort"
    },
    {
      "Time_Start": 2320.44,
      "Time_End": 2324.7200000000003,
      "Text": " of build on that success. And, and I think we should acknowledge that that's progress that's"
    },
    {
      "Time_Start": 2324.7200000000003,
      "Time_End": 2330.5800000000004,
      "Text": " been made. Um, Charlie. Yeah, sorry. I mean, uh, I'll try to add too much. I mean, I think"
    },
    {
      "Time_Start": 2330.6,
      "Time_End": 2335.84,
      "Text": " we did look specifically at the barriers of, of, uh, open source, uh, the open source"
    },
    {
      "Time_Start": 2335.84,
      "Time_End": 2339.08,
      "Text": " community to sort of high levels of security as a part of our corporate views. And I think,"
    },
    {
      "Time_Start": 2339.08,
      "Time_End": 2343.3199999999997,
      "Text": " uh, obviously there's sort of the first thing that comes up when you speak to people about it"
    },
    {
      "Time_Start": 2343.3199999999997,
      "Time_End": 2349.02,
      "Text": " is essentially funding, right? And we need more funding. And, and I think actually, uh, you"
    },
    {
      "Time_Start": 2349.02,
      "Time_End": 2354.36,
      "Text": " know, one of the things we really wanted to investigate was the government's, uh, as an"
    },
    {
      "Time_Start": 2354.36,
      "Time_End": 2358.86,
      "Text": " actual player in the open source system, right? A developer that uses, uh, open source code,"
    },
    {
      "Time_Start": 2358.88,
      "Time_End": 2363.48,
      "Text": " but also, uh, uh, you know, someone who buys code, which is based on open source components."
    },
    {
      "Time_Start": 2363.48,
      "Time_End": 2367.26,
      "Text": " Um, and I think, uh, that's definitely something that we're thinking about moving, moving"
    },
    {
      "Time_Start": 2367.26,
      "Time_End": 2373.0,
      "Text": " forward, right? Uh, how do we lead by example as a responsible player ourselves in the"
    },
    {
      "Time_Start": 2373.0,
      "Time_End": 2377.6,
      "Text": " open source ecosystem? Uh, and I think that's really important. Um, I, I, so the only"
    },
    {
      "Time_Start": 2377.6,
      "Time_End": 2381.34,
      "Text": " thing I have, I have, I think we have made loads of progress and I do want to pat it on the"
    },
    {
      "Time_Start": 2381.34,
      "Time_End": 2385.7400000000002,
      "Text": " back, but I was actually quite surprised during our corporate views at how many people, how"
    },
    {
      "Time_Start": 2385.8,
      "Time_End": 2390.0000000000005,
      "Text": " many security researchers we have still heard contacting companies with vulnerabilities"
    },
    {
      "Time_Start": 2390.0000000000005,
      "Time_End": 2394.1000000000004,
      "Text": " and being either ignored or threatened with legal action. You know, I mean, I think, I"
    },
    {
      "Time_Start": 2394.1000000000004,
      "Time_End": 2398.48,
      "Text": " think, uh, we have made loads of progress, but one of the things from the UK perspective"
    },
    {
      "Time_Start": 2398.48,
      "Time_End": 2402.98,
      "Text": " we're really keen on doing is, is understanding what really needs to be completely"
    },
    {
      "Time_Start": 2402.98,
      "Time_End": 2408.0800000000004,
      "Text": " consistent practice here. And I think vulnerability disclosure is one of them. And, you"
    },
    {
      "Time_Start": 2408.0800000000004,
      "Time_End": 2412.32,
      "Text": " know, we're not at a hundred percent yet. I don't think we necessarily will be, but, um, uh,"
    },
    {
      "Time_Start": 2412.34,
      "Time_End": 2416.7400000000002,
      "Text": " it's definitely something that we're, we want to continue raising the standard on, uh,"
    },
    {
      "Time_Start": 2416.7400000000002,
      "Time_End": 2421.82,
      "Text": " because, you know, security researchers play an absolutely essential role, not only in, in,"
    },
    {
      "Time_Start": 2421.82,
      "Time_End": 2425.92,
      "Text": " uh, building that evidence base, but also in actually holding these companies to account. Uh,"
    },
    {
      "Time_Start": 2425.92,
      "Time_End": 2430.2200000000003,
      "Text": " and I, and I think that's something that we really need to defend and, and to respect."
    },
    {
      "Time_Start": 2430.2200000000003,
      "Time_End": 2434.56,
      "Text": " I just want to double down on the point about looking at governments and interrogating our"
    },
    {
      "Time_Start": 2434.56,
      "Time_End": 2439.6400000000003,
      "Text": " use. That is a big part of the work that we're doing as well. And I'm glad to hear Charlie"
    },
    {
      "Time_Start": 2439.66,
      "Time_End": 2444.0,
      "Text": " mention it because it's really important for us as players in the space and as some of the"
    },
    {
      "Time_Start": 2444.0,
      "Time_End": 2450.3399999999997,
      "Text": " largest users of open source software and software in general to use our purchasing power"
    },
    {
      "Time_Start": 2450.3399999999997,
      "Time_End": 2455.2,
      "Text": " to drive the market. That is one of those market tools that I was talking about. And"
    },
    {
      "Time_Start": 2455.2,
      "Time_End": 2461.58,
      "Text": " demanding of our supply chain that they think about these issues is a really important"
    },
    {
      "Time_Start": 2461.58,
      "Time_End": 2465.92,
      "Text": " first step towards shifting the market and towards understanding the problem better. I"
    },
    {
      "Time_Start": 2465.94,
      "Time_End": 2470.94,
      "Text": " mean, you'll see that in EO 14028, we talked about S-bombs and asking of our suppliers"
    },
    {
      "Time_Start": 2473.7400000000002,
      "Time_End": 2479.2200000000003,
      "Text": " to think about how they will leverage S-bombs and what we, and, and, and helping us map"
    },
    {
      "Time_Start": 2479.2200000000003,
      "Time_End": 2483.92,
      "Text": " out how we make sure that's a part of our procurement process, right? And thinking about how"
    },
    {
      "Time_Start": 2483.92,
      "Time_End": 2487.4,
      "Text": " we are leveraging our purchasing power to drive the market. So I just really wanted to"
    },
    {
      "Time_Start": 2487.4,
      "Time_End": 2493.86,
      "Text": " underscore that, that, that federal piece is a big, big piece and we should be leading by"
    },
    {
      "Time_Start": 2493.88,
      "Time_End": 2498.58,
      "Text": " example. And that interrogation of our opportunities to advance this work are really"
    },
    {
      "Time_Start": 2498.58,
      "Time_End": 2503.1600000000003,
      "Text": " important. So not only our purchasing power, but how can we spend grant money? How can we"
    },
    {
      "Time_Start": 2503.1600000000003,
      "Time_End": 2507.86,
      "Text": " wrap this as a requirement into grants that we are already giving on relevant topics, things"
    },
    {
      "Time_Start": 2507.86,
      "Time_End": 2510.9,
      "Text": " like that, are ways that we are also looking at shifting the market."
    },
    {
      "Time_Start": 2512.2000000000003,
      "Time_End": 2517.9,
      "Text": " Okay. And I mean, I've also noticed, um, as a developer, you know, where, uh, things are"
    },
    {
      "Time_Start": 2517.92,
      "Time_End": 2523.1600000000003,
      "Text": " shifting forward on parallel, parallel front. So you, um, you know, where we are putting"
    },
    {
      "Time_Start": 2523.1600000000003,
      "Time_End": 2527.1,
      "Text": " stuff on GitHub, you can scan that code to see whether there's, you've introduced a"
    },
    {
      "Time_Start": 2527.1,
      "Time_End": 2532.54,
      "Text": " vulnerability. Um, also Google, for example, have, have done some good things with their"
    },
    {
      "Time_Start": 2532.54,
      "Time_End": 2537.9,
      "Text": " IDEs to make sure that, you know, for example, you don't have an HTTP only connection,"
    },
    {
      "Time_Start": 2537.9,
      "Time_End": 2541.78,
      "Text": " that that's a dangerous function, or you're not using SMS, it causes that as a dangerous"
    },
    {
      "Time_Start": 2541.78,
      "Time_End": 2547.52,
      "Text": " function. So it kind of steers developers on the, onto the right track. But of course,"
    },
    {
      "Time_Start": 2547.52,
      "Time_End": 2552.4,
      "Text": " we, you know, Alan alluded to the fact that we have so much, um, legacy out there and"
    },
    {
      "Time_Start": 2552.4,
      "Time_End": 2557.7599999999998,
      "Text": " existing technical and security debt. Um, and so for all those factories that have got"
    },
    {
      "Time_Start": 2557.7599999999998,
      "Time_End": 2562.68,
      "Text": " embedded systems and, and those things that are out there globally, because, you know,"
    },
    {
      "Time_Start": 2563.04,
      "Time_End": 2567.08,
      "Text": " we, you know, relatively we're British and American, so we live in rich countries, but"
    },
    {
      "Time_Start": 2567.08,
      "Time_End": 2573.0,
      "Text": " most of the world isn't rich. And, um, you know, for those, we can't just rip and replace"
    },
    {
      "Time_Start": 2573.0,
      "Time_End": 2576.04,
      "Text": " all of that equipment. It's going to be out there for a long time. I was talking to"
    },
    {
      "Time_Start": 2576.04,
      "Time_End": 2580.2,
      "Text": " somebody earlier about 6G, you know, so when 6G is deployed, suddenly, you know, after"
    },
    {
      "Time_Start": 2580.2,
      "Time_End": 2586.04,
      "Text": " 2035, we're suddenly on the apocalypse, 2038. There will be kit out there in 2038 that's"
    },
    {
      "Time_Start": 2586.04,
      "Time_End": 2591.16,
      "Text": " going to be victim to that. So what do we do about the, the legacy?"
    },
    {
      "Time_Start": 2593.96,
      "Time_End": 2600.16,
      "Text": " So Camille, of course, has another strategy that she's going to talk about. Um, there,"
    },
    {
      "Time_Start": 2600.16,
      "Time_End": 2604.2799999999997,
      "Text": " there are some things that we can do at the technical level as well. So one of the things"
    },
    {
      "Time_Start": 2604.28,
      "Time_End": 2609.7200000000003,
      "Text": " that we're going to be rolling out over the next year or so is, uh, or I'll, I'll talk"
    },
    {
      "Time_Start": 2609.7200000000003,
      "Time_End": 2615.1200000000003,
      "Text": " about two initiatives I'm real excited about at CISA. Um, one of them we're still trying"
    },
    {
      "Time_Start": 2615.1200000000003,
      "Time_End": 2619.0,
      "Text": " to figure out the appropriate name for it. I'm, I'm notoriously bad at naming things."
    },
    {
      "Time_Start": 2619.0,
      "Time_End": 2625.5600000000004,
      "Text": " Uh, VEX is my fault. Um, but tentatively called software observable behavior analytics,"
    },
    {
      "Time_Start": 2625.5600000000004,
      "Time_End": 2630.5600000000004,
      "Text": " which is, I can't change the software in a thing, but what I can do is watch that software."
    },
    {
      "Time_Start": 2631.56,
      "Time_End": 2636.56,
      "Text": " Uh, and it's weird, just as for me, it's bananas that people sell software without"
    },
    {
      "Time_Start": 2640.16,
      "Time_End": 2645.84,
      "Text": " knowing what's in their own software. We also want to extend that to what's it going to"
    },
    {
      "Time_Start": 2645.84,
      "Time_End": 2650.84,
      "Text": " do on my network? Is this ever going to use UDP? Uh, what's the maximum size of a DNS lookup"
    },
    {
      "Time_Start": 2653.4,
      "Time_End": 2658.04,
      "Text": " that it's going to make? Um, what's the ports are going to be open? And that will allow"
    },
    {
      "Time_Start": 2658.06,
      "Time_End": 2664.34,
      "Text": " us to take something that is currently a little expensive, which is manually lock down a"
    },
    {
      "Time_Start": 2664.34,
      "Time_End": 2669.9,
      "Text": " network and enable better and more intelligent and easier to use software that I can just"
    },
    {
      "Time_Start": 2669.9,
      "Time_End": 2675.08,
      "Text": " put on my network and say, deny everything that doesn't fit into this box. And we should"
    },
    {
      "Time_Start": 2675.08,
      "Time_End": 2679.62,
      "Text": " be asking the question, why would you sell me something if you can't tell me what it's"
    },
    {
      "Time_Start": 2679.62,
      "Time_End": 2684.62,
      "Text": " going to do on my network? So that's one piece, uh, tentatively called SOBA because right"
    },
    {
      "Time_Start": 2684.64,
      "Time_End": 2689.54,
      "Text": " now everyone names all their security projects after food. So why, why should it just be"
    },
    {
      "Time_Start": 2689.54,
      "Time_End": 2694.54,
      "Text": " Tex-Mex food? Um, the second piece, uh, that, that we're sort of looking at gets a little bit"
    },
    {
      "Time_Start": 2697.18,
      "Time_End": 2702.8599999999997,
      "Text": " to this, which is, and it still follows the model that transparency is the first step that"
    },
    {
      "Time_Start": 2702.8599999999997,
      "Time_End": 2707.8599999999997,
      "Text": " we can innovate on top of, is there really isn't a good way of understanding what is actually"
    },
    {
      "Time_Start": 2708.1,
      "Time_End": 2713.1,
      "Text": " end of life or end of support. And so, uh, the White House issued, uh, the, uh, national"
    },
    {
      "Time_Start": 2718.1800000000003,
      "Time_End": 2724.42,
      "Text": " cyber strategy implementation plan. And one of the things they've asked SISA to do is to"
    },
    {
      "Time_Start": 2724.42,
      "Time_End": 2729.42,
      "Text": " come up with a solution for helping people who make software, people who buy software and"
    },
    {
      "Time_Start": 2731.02,
      "Time_End": 2736.02,
      "Text": " people who operate software. And that's, I think all of us, uh, to understand what is end of"
    },
    {
      "Time_Start": 2737.9,
      "Time_End": 2742.84,
      "Text": " life, what is end of support? Does it have the solution? What do we do now? No, but at least"
    },
    {
      "Time_Start": 2742.84,
      "Time_End": 2747.7000000000003,
      "Text": " it helps us prioritize that. And so that's something that we're starting to roll out. Uh,"
    },
    {
      "Time_Start": 2747.7000000000003,
      "Time_End": 2751.78,
      "Text": " there's a great, uh, technical working group that we're participating in. Uh, my team member"
    },
    {
      "Time_Start": 2751.78,
      "Time_End": 2757.2400000000002,
      "Text": " Justin back there is going to be doing all the technical standards work, uh, for, uh, this"
    },
    {
      "Time_Start": 2757.2400000000002,
      "Time_End": 2763.02,
      "Text": " as an Oasis standard. So there's lots of things that we can do without rip and replace to"
    },
    {
      "Time_Start": 2763.02,
      "Time_End": 2768.86,
      "Text": " make some progress. Um, yeah, I mean very quickly, I think going back to open source, right?"
    },
    {
      "Time_Start": 2768.86,
      "Time_End": 2773.46,
      "Text": " I mean, one of the, one of the useful things about open source is that it's largely free. Um,"
    },
    {
      "Time_Start": 2773.46,
      "Time_End": 2778.14,
      "Text": " and I think, uh, uh, that's something that we always want to support and, uh, and, and from a"
    },
    {
      "Time_Start": 2778.14,
      "Time_End": 2782.6,
      "Text": " security standpoint should also make sure that as much as possible we're making, uh, you know,"
    },
    {
      "Time_Start": 2782.6,
      "Time_End": 2787.24,
      "Text": " making solutions to some of these problems available to everyone around the world. You know,"
    },
    {
      "Time_Start": 2787.2400000000002,
      "Time_End": 2793.6800000000003,
      "Text": " I think, um, obviously there's, uh, there are problems in terms of global access to tech that,"
    },
    {
      "Time_Start": 2793.6800000000003,
      "Time_End": 2797.98,
      "Text": " uh, extend far past software, you know? I mean, there are lots of cars which are heavily"
    },
    {
      "Time_Start": 2797.98,
      "Time_End": 2802.48,
      "Text": " polluting in, uh, countries, uh, around the world, which are not legally allowed to buy in the EU."
    },
    {
      "Time_Start": 2802.48,
      "Time_End": 2806.7200000000003,
      "Text": " And so they get shipped elsewhere. I think there are obviously structural problems there, right?"
    },
    {
      "Time_Start": 2806.7200000000003,
      "Time_End": 2813.1200000000003,
      "Text": " Um, and, and some of that needs to be dealt with at the multilateral level. Um, uh, but"
    },
    {
      "Time_Start": 2813.18,
      "Time_End": 2818.68,
      "Text": " obviously some of it can be helped with funding, but, uh, uh, you know, in terms of the global"
    },
    {
      "Time_Start": 2818.68,
      "Time_End": 2823.72,
      "Text": " software community, uh, open source is obviously going to be key to that as well."
    },
    {
      "Time_Start": 2823.72,
      "Time_End": 2830.62,
      "Text": " So I'll just add that in partnership with State Department, USAID, and increasingly Peace Corps,"
    },
    {
      "Time_Start": 2830.62,
      "Time_End": 2834.3599999999997,
      "Text": " we are really thinking about how we bring our partners on along for the journey, right?"
    },
    {
      "Time_Start": 2834.3599999999997,
      "Time_End": 2840.0,
      "Text": " There are a set of partners like the ones represented here who are working in lockstep about"
    },
    {
      "Time_Start": 2840.02,
      "Time_End": 2843.78,
      "Text": " advancing this forward and are really thinking proactively and have the resources, as you"
    },
    {
      "Time_Start": 2843.78,
      "Time_End": 2850.56,
      "Text": " mentioned, to invest in this problem space. There are other partners who can benefit from our"
    },
    {
      "Time_Start": 2850.56,
      "Time_End": 2854.74,
      "Text": " lessons learned and the best practices that we have developed to implement things like"
    },
    {
      "Time_Start": 2854.74,
      "Time_End": 2861.24,
      "Text": " monitoring and other tools if they cannot invest in, um, upgrading their technology right now"
    },
    {
      "Time_Start": 2861.24,
      "Time_End": 2867.58,
      "Text": " to help mitigate the risks that are in front of them. And so we are doing a lot of work to reach"
    },
    {
      "Time_Start": 2867.58,
      "Time_End": 2874.2,
      "Text": " out to partners across, um, a number of different regions. For example, we were talking"
    },
    {
      "Time_Start": 2874.2,
      "Time_End": 2880.14,
      "Text": " earlier about the workforce challenge and as part of releasing that strategy, we recognize that"
    },
    {
      "Time_Start": 2880.14,
      "Time_End": 2885.44,
      "Text": " the implementation is very little bit federal government and a lot of bit everybody else, to be"
    },
    {
      "Time_Start": 2885.44,
      "Time_End": 2890.72,
      "Text": " frank. So how do we coalesce and convene everybody around that? And one of the ways that we"
    },
    {
      "Time_Start": 2890.72,
      "Time_End": 2894.2799999999997,
      "Text": " have done that is that a lot of our partners have already stood up to say, like, I'm ready to"
    },
    {
      "Time_Start": 2894.28,
      "Time_End": 2898.26,
      "Text": " implement this work. I see how important this is. One such organization is Cyber Safe"
    },
    {
      "Time_Start": 2898.26,
      "Time_End": 2904.8,
      "Text": " Foundation, based out of Nigeria, but is working in seven plus countries across Africa and"
    },
    {
      "Time_Start": 2904.8,
      "Time_End": 2909.7000000000003,
      "Text": " they are going to translate the ecosystem model that we've articulated for the continent of"
    },
    {
      "Time_Start": 2909.7000000000003,
      "Time_End": 2915.98,
      "Text": " Africa so that that can be a tool to help developers, to help cyber talent as they emerge and"
    },
    {
      "Time_Start": 2915.98,
      "Time_End": 2920.42,
      "Text": " as they continue to reskill and upskill be able to do exactly this. Be able to address the"
    },
    {
      "Time_Start": 2920.42,
      "Time_End": 2925.2200000000003,
      "Text": " threats as they manifest themselves in that ecosystem and relevant to that ecosystem. So it"
    },
    {
      "Time_Start": 2925.2200000000003,
      "Time_End": 2930.2400000000002,
      "Text": " might not be that we can just upgrade all the technology, but how else can they, um, leverage"
    },
    {
      "Time_Start": 2930.2400000000002,
      "Time_End": 2936.58,
      "Text": " the resources at their disposal and the skills at their disposal to mitigate the risks in"
    },
    {
      "Time_Start": 2936.58,
      "Time_End": 2938.0,
      "Text": " front of them?"
    },
    {
      "Time_Start": 2938.0,
      "Time_End": 2942.58,
      "Text": " Okay. Um, I feel like there's a number of directions we could take this conversation. Um, I"
    },
    {
      "Time_Start": 2942.58,
      "Time_End": 2950.16,
      "Text": " was just about to ask some questions about post-quantum, but, um, um, if so, but focusing, I"
    },
    {
      "Time_Start": 2950.16,
      "Time_End": 2954.06,
      "Text": " mean, obviously we did those strategies we can take that are not just about rip and replace. We"
    },
    {
      "Time_Start": 2954.06,
      "Time_End": 2959.96,
      "Text": " can maybe contain things that we know, uh, you know, sketchy and maybe monitor them more"
    },
    {
      "Time_Start": 2959.96,
      "Time_End": 2965.2799999999997,
      "Text": " closely or validate the input more closely, whatever, but just concentrate on the end of life"
    },
    {
      "Time_Start": 2965.2799999999997,
      "Time_End": 2972.2799999999997,
      "Text": " question here. Um, so there's all this debate around right to repair and code escrow and"
    },
    {
      "Time_Start": 2972.58,
      "Time_End": 2979.02,
      "Text": " we see, you know, my specialist is really IOT and you see a lots of these IOT companies that"
    },
    {
      "Time_Start": 2979.02,
      "Time_End": 2984.2,
      "Text": " were around in 2015, next big thing now going bust and people are going, hang on, I've got all"
    },
    {
      "Time_Start": 2984.2,
      "Time_End": 2991.16,
      "Text": " this stuff in my house. What, you know, what do you mean? I can't use it after 12 months. So"
    },
    {
      "Time_Start": 2991.16,
      "Time_End": 2996.2,
      "Text": " when that becomes a bit more critical, but some of that's critical, right? Some of it's maybe"
    },
    {
      "Time_Start": 2996.2000000000003,
      "Time_End": 3004.7400000000002,
      "Text": " life affecting. What do we do in that space around resilience? Is there, is there a clear"
    },
    {
      "Time_Start": 3004.7400000000002,
      "Time_End": 3009.78,
      "Text": " answer? Is there a strategy from, from governments on that or is it something that's in the"
    },
    {
      "Time_Start": 3009.78,
      "Time_End": 3014.38,
      "Text": " too hard box right now that we need to look at later? I don't know that it's all the way in the"
    },
    {
      "Time_Start": 3014.38,
      "Time_End": 3018.6200000000003,
      "Text": " too hard box, but, but it's in the process. I think there are a couple initiatives that seek to"
    },
    {
      "Time_Start": 3018.6200000000003,
      "Time_End": 3023.7200000000003,
      "Text": " address things like that. Um, the IOT labeling initiative, which is an international"
    },
    {
      "Time_Start": 3023.7200000000003,
      "Time_End": 3030.2200000000003,
      "Text": " initiative, is seeking to make clear to, clearer to users, um, what security features their"
    },
    {
      "Time_Start": 3030.2200000000003,
      "Time_End": 3034.76,
      "Text": " devices have, what end of life looks like, that kind of thing. I think that's more of an"
    },
    {
      "Time_Start": 3034.76,
      "Time_End": 3040.3,
      "Text": " awareness tool than it is going to be, um, a solution to the problem, quite frankly, right?"
    },
    {
      "Time_Start": 3040.3,
      "Time_End": 3047.3,
      "Text": " Because any logo on a box is going to be outdated and the, the validity of that information"
    },
    {
      "Time_Start": 3047.3,
      "Time_End": 3052.94,
      "Text": " changes rapidly, but if we can train folks to actually go beyond the logo and read the, the"
    },
    {
      "Time_Start": 3052.96,
      "Time_End": 3057.34,
      "Text": " data embedded underneath, right, that'll be included with that, they'll learn a lot about the"
    },
    {
      "Time_Start": 3057.34,
      "Time_End": 3061.38,
      "Text": " devices that are in their homes. They're probably going to do that on the front end. Will they"
    },
    {
      "Time_Start": 3061.38,
      "Time_End": 3065.38,
      "Text": " continue to do that? Maybe not. So that can't be the only solution, but it gets people"
    },
    {
      "Time_Start": 3065.38,
      "Time_End": 3069.28,
      "Text": " starting to think about the security of the devices in their home. And as people start to"
    },
    {
      "Time_Start": 3069.28,
      "Time_End": 3075.18,
      "Text": " realize and see in real time, um, how that can impact the safety for them and their"
    },
    {
      "Time_Start": 3075.18,
      "Time_End": 3080.26,
      "Text": " families, that'll be an important tool in our toolkit. The other thing I talked about in the"
    },
    {
      "Time_Start": 3080.28,
      "Time_End": 3086.5800000000004,
      "Text": " workforce strategy is foundation, foundational cyber skills for everyone, right? And if we"
    },
    {
      "Time_Start": 3086.5800000000004,
      "Time_End": 3090.7000000000003,
      "Text": " posit that reading, writing, and arithmetic are the traditional tools in everyone's"
    },
    {
      "Time_Start": 3090.7000000000003,
      "Time_End": 3095.6600000000003,
      "Text": " toolkit to be a functioning member of society, to help you advance and, and thrive, we say"
    },
    {
      "Time_Start": 3095.6600000000003,
      "Time_End": 3099.0400000000004,
      "Text": " that foundational cyber skills need to be a part of that toolkit too, that everyone should"
    },
    {
      "Time_Start": 3099.0400000000004,
      "Time_End": 3102.94,
      "Text": " have them, right? And that's not just digital literacy, which is the ability to use the"
    },
    {
      "Time_Start": 3102.94,
      "Time_End": 3107.6800000000003,
      "Text": " device, turn it off and on, but that's computational literacy, the ability to understand"
    },
    {
      "Time_Start": 3107.7000000000003,
      "Time_End": 3112.2400000000002,
      "Text": " that when you turn on and off a toggle, um, what does that mean in terms of your security"
    },
    {
      "Time_Start": 3112.2400000000002,
      "Time_End": 3115.9400000000005,
      "Text": " and privacy? How does it change the usability? What does that mean for your family? And"
    },
    {
      "Time_Start": 3115.9400000000005,
      "Time_End": 3120.1200000000003,
      "Text": " then digital resilience, the ability to adapt to a changing technological environment. So"
    },
    {
      "Time_Start": 3120.1200000000003,
      "Time_End": 3124.4600000000005,
      "Text": " as there's new features, new risks that you are able to keep up, not make you a cyber"
    },
    {
      "Time_Start": 3124.4600000000005,
      "Time_End": 3131.1200000000003,
      "Text": " security expert, but just as you, um, assess the risks of your physical security, I want"
    },
    {
      "Time_Start": 3131.1200000000003,
      "Time_End": 3135.2200000000003,
      "Text": " you to assess the, assess the risks of your digital safety and security, right? So you"
    },
    {
      "Time_Start": 3135.2400000000002,
      "Time_End": 3139.5400000000004,
      "Text": " might, Charlie, you might walk down the alley cause you know, karate and are willing to"
    },
    {
      "Time_Start": 3139.5400000000004,
      "Time_End": 3144.7400000000002,
      "Text": " take that risk. Come and bring it on. Right? For me, I don't know karate. I will not be"
    },
    {
      "Time_Start": 3144.7400000000002,
      "Time_End": 3148.6800000000003,
      "Text": " walking down the alley. I will be walking down the well road, right? I've done, I've"
    },
    {
      "Time_Start": 3148.6800000000003,
      "Time_End": 3153.42,
      "Text": " made a risk calculus, a decision based on who I am, what skills I have and what I know"
    },
    {
      "Time_Start": 3153.42,
      "Time_End": 3158.0200000000004,
      "Text": " about the environment. I want people to do that in their digital lives as well. And so"
    },
    {
      "Time_Start": 3158.0200000000004,
      "Time_End": 3161.36,
      "Text": " that's what those foundational cyber skills will equip people to do. So those are tool"
    },
    {
      "Time_Start": 3161.36,
      "Time_End": 3165.54,
      "Text": " tools that we are using to help with problems like that. But those, they're not going to be"
    },
    {
      "Time_Start": 3165.54,
      "Time_End": 3170.48,
      "Text": " the end all be all. And they also aren't a solution that manifests, um, a, an outcome that"
    },
    {
      "Time_Start": 3170.48,
      "Time_End": 3176.54,
      "Text": " we'd like to see today. Right? Yes. I mean, I completely agree. I don't know karate. Uh, but,"
    },
    {
      "Time_Start": 3176.54,
      "Time_End": 3182.6800000000003,
      "Text": " uh, and I definitely, I, yeah, probably be running rather than anything else. Um, yeah."
    },
    {
      "Time_Start": 3182.6800000000003,
      "Time_End": 3187.26,
      "Text": " So the UK take is taking a very similar approach. We have, um, uh, cyber aware campaign,"
    },
    {
      "Time_Start": 3187.3,
      "Time_End": 3191.1600000000003,
      "Text": " but also we do sort of lots of training in schools, um, and partnership with private"
    },
    {
      "Time_Start": 3191.1600000000003,
      "Time_End": 3195.5400000000004,
      "Text": " organizations to try and generally make sure that, uh, particularly sort of through the"
    },
    {
      "Time_Start": 3195.5400000000004,
      "Time_End": 3199.28,
      "Text": " educational process, people are, you know, cyber awareness and security is now being"
    },
    {
      "Time_Start": 3199.28,
      "Time_End": 3204.48,
      "Text": " taught in schools from a foundational level. Uh, and I think that's great regarding the"
    },
    {
      "Time_Start": 3204.48,
      "Time_End": 3210.1200000000003,
      "Text": " sort of end of life question. Uh, I think so, you know, the UK, uh, earlier this year, uh,"
    },
    {
      "Time_Start": 3210.1200000000003,
      "Time_End": 3215.2200000000003,
      "Text": " the, uh, product security and telecommunications infrastructure act PSTI act came, uh, it,"
    },
    {
      "Time_Start": 3215.2200000000003,
      "Time_End": 3219.86,
      "Text": " well, it entered royal assent, but we won't get back into the full question of what that"
    },
    {
      "Time_Start": 3219.86,
      "Time_End": 3224.92,
      "Text": " means in the British parliament. Um, no, no, let's, let's reopen the constitution. If you"
    },
    {
      "Time_Start": 3224.92,
      "Time_End": 3228.96,
      "Text": " guys do want to hear about that, we talked about it at a reasonable length at B sides a"
    },
    {
      "Time_Start": 3228.96,
      "Time_End": 3232.3,
      "Text": " couple of days ago. So I can send you that link. We've got through quite a few names of"
    },
    {
      "Time_Start": 3232.3,
      "Time_End": 3238.2000000000003,
      "Text": " monarchs actually. Yeah. Um, anyway, so it received royal assent in April this year,"
    },
    {
      "Time_Start": 3238.2000000000003,
      "Time_End": 3242.78,
      "Text": " and, uh, it will be coming into force in April next year. And one of the three core"
    },
    {
      "Time_Start": 3242.78,
      "Time_End": 3247.1800000000003,
      "Text": " requirements that that has for, uh, IOT consumer, IOT manufacturers is that they have"
    },
    {
      "Time_Start": 3247.1800000000003,
      "Time_End": 3252.6800000000003,
      "Text": " to communicate the lifespan of the product to consumers. They have to give an indication"
    },
    {
      "Time_Start": 3252.6800000000003,
      "Time_End": 3256.88,
      "Text": " of how long it will receive updates for and, you know, when it will be, uh, uh, when it"
    },
    {
      "Time_Start": 3256.88,
      "Time_End": 3261.6600000000003,
      "Text": " will be sort of closed down. Um, which I think is a real success and, and something that,"
    },
    {
      "Time_Start": 3261.6600000000003,
      "Time_End": 3266.5600000000004,
      "Text": " uh, you know, we are interested in looking at in other circumstances, you know, uh, I"
    },
    {
      "Time_Start": 3266.5600000000004,
      "Time_End": 3270.96,
      "Text": " don't think we're at the space where we're considering legislative options yet, but I"
    },
    {
      "Time_Start": 3270.98,
      "Time_End": 3275.52,
      "Text": " don't see why that shouldn't also be a consideration for software more widely if it's,"
    },
    {
      "Time_Start": 3275.52,
      "Time_End": 3282.06,
      "Text": " uh, you know, something that, uh, consumers or organizations are reliant on. Um, but I"
    },
    {
      "Time_Start": 3282.06,
      "Time_End": 3285.9,
      "Text": " think, you know, that doesn't solve all the issues. Uh, a company can tell you that"
    },
    {
      "Time_Start": 3285.9,
      "Time_End": 3290.14,
      "Text": " they'll update the product for 10 years, but if they then go bust the next year, that"
    },
    {
      "Time_Start": 3290.14,
      "Time_End": 3294.18,
      "Text": " doesn't necessarily help. Uh, and I think, you know, that that is a real problem, which,"
    },
    {
      "Time_Start": 3294.18,
      "Time_End": 3297.2400000000002,
      "Text": " um, we are, I think still trying to grapple with. Um,"
    },
    {
      "Time_Start": 3297.3,
      "Time_End": 3302.6000000000004,
      "Text": " so I should add that in the B2B case, a lot of companies already require code escrow because"
    },
    {
      "Time_Start": 3302.6000000000004,
      "Time_End": 3306.0000000000005,
      "Text": " they're worried about, you know, partners going bust and stuff, but it's the B2C space,"
    },
    {
      "Time_Start": 3306.0000000000005,
      "Time_End": 3310.2400000000002,
      "Text": " that customer space where they're just left high and dry. David, I'll, I'll ask you a"
    },
    {
      "Time_Start": 3310.2400000000002,
      "Time_End": 3313.6400000000003,
      "Text": " question of code escrow because I had a great conversation about this over lunch. Uh, so"
    },
    {
      "Time_Start": 3313.6400000000003,
      "Time_End": 3317.5200000000004,
      "Text": " code escrow for those of you who don't know is before I sign a major contract, I won't"
    },
    {
      "Time_Start": 3317.5200000000004,
      "Time_End": 3322.36,
      "Text": " demand your source code because you're reluctant to do that, but you need to put it in a vault."
    },
    {
      "Time_Start": 3322.36,
      "Time_End": 3327.1200000000003,
      "Text": " So if you go bust, I can access it. But here's my question, which is anyone who's ever looked"
    },
    {
      "Time_Start": 3327.14,
      "Time_End": 3334.14,
      "Text": " at someone else's code? Yeah. It's a couple of jobs. Uh, is there a successful case study"
    },
    {
      "Time_Start": 3334.14,
      "Time_End": 3337.3199999999997,
      "Text": " anywhere? And I, I don't know the answer, but it's a big, great research question for"
    },
    {
      "Time_Start": 3337.3199999999997,
      "Time_End": 3342.3199999999997,
      "Text": " anyone to find successful examples of code escrow actually leading to sustained maintenance."
    },
    {
      "Time_Start": 3346.3199999999997,
      "Time_End": 3352.2599999999998,
      "Text": " There is one actually. Uh, so there was an IOT products that I think Sony took on and"
    },
    {
      "Time_Start": 3352.2599999999998,
      "Time_End": 3356.4,
      "Text": " then, but it was the original development. When Sony dumped the product, it was the original"
    },
    {
      "Time_Start": 3356.4,
      "Time_End": 3360.8,
      "Text": " developer who stepped back in. So I think that's a, maybe a little biased sample issue"
    },
    {
      "Time_Start": 3360.8,
      "Time_End": 3365.48,
      "Text": " that I thought you're going to ask me a different question. I thought you're going to say cryptographic"
    },
    {
      "Time_Start": 3365.48,
      "Time_End": 3371.76,
      "Text": " keys and certificates. Oh no, I'm not touching the tension between rights repair versus signed"
    },
    {
      "Time_Start": 3371.76,
      "Time_End": 3376.88,
      "Text": " updates. That's yeah, but not even just signed up. I'm talking about like the thing just"
    },
    {
      "Time_Start": 3376.88,
      "Time_End": 3383.2400000000002,
      "Text": " won't compile and it won't run and the services aren't there to be able to make this thing"
    },
    {
      "Time_Start": 3383.2400000000002,
      "Time_End": 3390.2400000000002,
      "Text": " live again. So, and nobody's looking at this problem at least, you know, as an IOT person."
    },
    {
      "Time_Start": 3390.2400000000002,
      "Time_End": 3395.1200000000003,
      "Text": " And, and, and I'll be honest in the code of practice, the UK code of practice priority,"
    },
    {
      "Time_Start": 3395.1200000000003,
      "Time_End": 3397.92,
      "Text": " you know, we did put that in the two hard box because there were fundamental issues"
    },
    {
      "Time_Start": 3397.92,
      "Time_End": 3403.4,
      "Text": " like no default passwords. But it's, I mean, does anyone in the audience have a solution"
    },
    {
      "Time_Start": 3403.4,
      "Time_End": 3410.4,
      "Text": " to this? It's on the old logo. I'm on my phone. I'm on Twitter. So I want to sort of share"
    },
    {
      "Time_Start": 3413.28,
      "Time_End": 3418.76,
      "Text": " a few, because again, when a problem is too hard to solve at one level, you sort of look"
    },
    {
      "Time_Start": 3418.76,
      "Time_End": 3425.2000000000003,
      "Text": " around for what are my other levers and to, to make this international, I don't speak"
    },
    {
      "Time_Start": 3425.2000000000003,
      "Time_End": 3430.2000000000003,
      "Text": " for our friends at the ministry of information communication in Japan, but I do want to highlight"
    },
    {
      "Time_Start": 3430.2000000000003,
      "Time_End": 3437.2000000000003,
      "Text": " something that they did and one of the surprising findings. So four years ago and this is why"
    },
    {
      "Time_Start": 3437.88,
      "Time_End": 3443.7200000000003,
      "Text": " I love the importance of giving a global view, by the way, is there are innovators everywhere"
    },
    {
      "Time_Start": 3443.7200000000003,
      "Time_End": 3448.9600000000005,
      "Text": " on the planet. And so that's where we should all be learning from each other. That ministry"
    },
    {
      "Time_Start": 3448.9600000000005,
      "Time_End": 3455.9600000000005,
      "Text": " obtained the ability to scan the Japanese domestic IP space for home internet users."
    },
    {
      "Time_Start": 3460.0800000000004,
      "Time_End": 3465.1600000000003,
      "Text": " And they were looking, their plan was we'll find all these vulnerability devices and we'll"
    },
    {
      "Time_Start": 3465.2,
      "Time_End": 3470.2,
      "Text": " have a way of notifying them through their ISP. So it won't be the government coming."
    },
    {
      "Time_Start": 3470.2,
      "Time_End": 3474.2,
      "Text": " That's not what they say, but yeah, that's what we say. Uh, the, it won't be the government"
    },
    {
      "Time_Start": 3474.2,
      "Time_End": 3480.3599999999997,
      "Text": " coming and like interfering with them. But the surprising result, which was obvious in"
    },
    {
      "Time_Start": 3480.3599999999997,
      "Time_End": 3487.3599999999997,
      "Text": " retrospect is they found very, very few vulnerable devices. Now Japan's a pretty connected country."
    },
    {
      "Time_Start": 3487.6,
      "Time_End": 3494.6,
      "Text": " Why was this? And it's because we've accidentally built a really powerful and almost"
    },
    {
      "Time_Start": 3495.16,
      "Time_End": 3502.16,
      "Text": " flawless firewall for every internet user in certain areas. Anyone know what it is?"
    },
    {
      "Time_Start": 3503.8399999999997,
      "Time_End": 3508.8399999999997,
      "Text": " As a gentleman in the front. Yes, it's a network address translation. Like we failed at the"
    },
    {
      "Time_Start": 3508.8399999999997,
      "Time_End": 3515.8399999999997,
      "Text": " IPv6 translation model. We're still using IPv4. So now everyone sits behind a data diode,"
    },
    {
      "Time_Start": 3515.8399999999997,
      "Time_End": 3522.8399999999997,
      "Text": " um, for the safety critical stuff, for medical devices, for uh, the world. That's where we"
    },
    {
      "Time_Start": 3522.84,
      "Time_End": 3529.84,
      "Text": " actually need to say once you're on the internet, this is why Mirai affected security cameras"
    },
    {
      "Time_Start": 3529.84,
      "Time_End": 3533.84,
      "Text": " is because those were connected directly to the internet. And so one of the things we"
    },
    {
      "Time_Start": 3533.84,
      "Time_End": 3540.84,
      "Text": " need to do is look at our large scale protection systems, uh, are, are, you know, the, the"
    },
    {
      "Time_Start": 3542.84,
      "Time_End": 3547.84,
      "Text": " sassies and the WAN firewalls and things like that and say, how do we know that they're"
    },
    {
      "Time_Start": 3547.84,
      "Time_End": 3551.84,
      "Text": " doing their job? Because hey, guess what? Over the last couple of years, there's been"
    },
    {
      "Time_Start": 3551.84,
      "Time_End": 3555.84,
      "Text": " a lot of very high profile vulnerabilities around that. So let's look at the network"
    },
    {
      "Time_Start": 3555.84,
      "Time_End": 3563.84,
      "Text": " level and the appliance level as an alternative model for this. So, okay. So then resilience"
    },
    {
      "Time_Start": 3563.84,
      "Time_End": 3570.84,
      "Text": " further up the supply chain, um, and I guess accountability is then the next question."
    },
    {
      "Time_Start": 3571.84,
      "Time_End": 3580.84,
      "Text": " So, you know, we, we don't have a global model for this and a lot of those suppliers, those"
    },
    {
      "Time_Start": 3580.84,
      "Time_End": 3587.84,
      "Text": " companies, those products are in say China, for example, or other parts of the world where"
    },
    {
      "Time_Start": 3587.84,
      "Time_End": 3594.84,
      "Text": " we don't have any real jurisdiction. We can deal with maybe the importation, but how do"
    },
    {
      "Time_Start": 3594.84,
      "Time_End": 3601.84,
      "Text": " we ensure accountability in a, to create resilience? Does anybody have a view on that?"
    },
    {
      "Time_Start": 3602.84,
      "Time_End": 3608.84,
      "Text": " I can go first if you want. Um, I think, I think there are lots of different, uh, aspects"
    },
    {
      "Time_Start": 3608.84,
      "Time_End": 3612.84,
      "Text": " of accountability. And one of the things we've really been looking at, uh, in the UK"
    },
    {
      "Time_Start": 3612.84,
      "Time_End": 3617.84,
      "Text": " is, is, is, um, mechanisms for accountability that are actually already there, but just"
    },
    {
      "Time_Start": 3617.84,
      "Time_End": 3622.84,
      "Text": " might not be being used enough. So actually one of the key ways in which suppliers of"
    },
    {
      "Time_Start": 3622.84,
      "Time_End": 3627.84,
      "Text": " software can be held to account, uh, is by their customers through the contract. Um,"
    },
    {
      "Time_Start": 3627.84,
      "Time_End": 3633.84,
      "Text": " but a key challenge there is that, uh, one, you have, when we're looking at organizational"
    },
    {
      "Time_Start": 3633.84,
      "Time_End": 3638.84,
      "Text": " resilience in the United Kingdom, um, the significant majority of organizations are"
    },
    {
      "Time_Start": 3638.84,
      "Time_End": 3644.84,
      "Text": " small and medium sized businesses, often who don't have a dedicated security person at"
    },
    {
      "Time_Start": 3644.84,
      "Time_End": 3649.84,
      "Text": " all, let alone serious resource to actually, uh, dedicate to really looking into this."
    },
    {
      "Time_Start": 3649.84,
      "Time_End": 3654.84,
      "Text": " Um, often the people who are actually making these decisions and agreeing to contracts"
    },
    {
      "Time_Start": 3654.84,
      "Time_End": 3659.84,
      "Text": " are procurement professionals of which, and, and, and for them, cyber risk is one of a"
    },
    {
      "Time_Start": 3659.84,
      "Time_End": 3664.84,
      "Text": " great number of risks which they need to take into consideration. Um, so the question"
    },
    {
      "Time_Start": 3664.84,
      "Time_End": 3669.84,
      "Text": " really is how do you empower those businesses to actually, um, you know, hold these companies"
    },
    {
      "Time_Start": 3669.84,
      "Time_End": 3675.84,
      "Text": " to account, uh, in a way that, that, that sort of is contractually, uh, viable as it"
    },
    {
      "Time_Start": 3675.84,
      "Time_End": 3679.84,
      "Text": " were. Uh, so one of the things that we've been looking at is whether you can develop"
    },
    {
      "Time_Start": 3679.84,
      "Time_End": 3684.84,
      "Text": " actually sort of standardized clauses, which any company could essentially sort of take"
    },
    {
      "Time_Start": 3684.84,
      "Time_End": 3689.84,
      "Text": " and put into their contract, which would at least set a baseline standard of security"
    },
    {
      "Time_Start": 3689.84,
      "Time_End": 3695.84,
      "Text": " expectations in any relationship. Um, but I think, you know, that there are key challenges"
    },
    {
      "Time_Start": 3695.84,
      "Time_End": 3699.84,
      "Text": " here in terms of just the basic ability of procurement professionals and small businesses"
    },
    {
      "Time_Start": 3699.84,
      "Time_End": 3704.84,
      "Text": " to interpret and understand the challenges. Uh, even small businesses are often using"
    },
    {
      "Time_Start": 3704.84,
      "Time_End": 3709.84,
      "Text": " more than a hundred different kinds of software a lot of the time. And, um, and, and that"
    },
    {
      "Time_Start": 3709.84,
      "Time_End": 3713.84,
      "Text": " is a real challenge. So I think we do also need to think about how we can upscale small"
    },
    {
      "Time_Start": 3713.84,
      "Time_End": 3718.84,
      "Text": " businesses as government, whether through funding or programs or otherwise, uh, in a"
    },
    {
      "Time_Start": 3718.84,
      "Time_End": 3723.84,
      "Text": " way that actually lets them hold, uh, uh, software, software vendors and software developers"
    },
    {
      "Time_Start": 3723.84,
      "Time_End": 3728.84,
      "Text": " to account, uh, through the contract. But I do think that there is a sort of another"
    },
    {
      "Time_Start": 3728.84,
      "Time_End": 3732.84,
      "Text": " aspect here, which goes back to transparency, right? So even if you have a company which"
    },
    {
      "Time_Start": 3732.84,
      "Time_End": 3738.84,
      "Text": " has the skills and has the resources and has the expertise to ask the right questions of"
    },
    {
      "Time_Start": 3738.84,
      "Time_End": 3743.84,
      "Text": " their software vendors, quite a lot of the time, they're just meeting a brick wall. You"
    },
    {
      "Time_Start": 3743.84,
      "Time_End": 3748.84,
      "Text": " know, they're not being given the information they need. And we have heard that, you know,"
    },
    {
      "Time_Start": 3748.84,
      "Time_End": 3752.84,
      "Text": " particularly with the larger vendors, things have been getting better in the last few years"
    },
    {
      "Time_Start": 3752.84,
      "Time_End": 3756.84,
      "Text": " and they've been a bit more open about their security practices and how they securely develop"
    },
    {
      "Time_Start": 3756.84,
      "Time_End": 3761.84,
      "Text": " their software. But I think there is clearly a lot, a long way to go, particularly with"
    },
    {
      "Time_Start": 3761.84,
      "Time_End": 3766.84,
      "Text": " like sort of smaller and medium sized software vendors. So I think there's a big question"
    },
    {
      "Time_Start": 3766.84,
      "Time_End": 3771.84,
      "Text": " about how you empower people to hold companies accountable, but the transparency question"
    },
    {
      "Time_Start": 3771.84,
      "Time_End": 3775.84,
      "Text": " is also key. And I think you do need both the accountability and the transparency if"
    },
    {
      "Time_Start": 3775.84,
      "Time_End": 3779.84,
      "Text": " we're really going to raise the standards of software security across the board."
    },
    {
      "Time_Start": 3779.84,
      "Time_End": 3784.84,
      "Text": " I think where you leave off is where the government needs to pick up. And one of the things"
    },
    {
      "Time_Start": 3784.84,
      "Time_End": 3788.84,
      "Text": " that, you know, I mentioned about the national cybersecurity strategy is we're trying to shift"
    },
    {
      "Time_Start": 3788.84,
      "Time_End": 3792.84,
      "Text": " the burden from the small players to the big players. It should be that our cloud service"
    },
    {
      "Time_Start": 3792.84,
      "Time_End": 3798.84,
      "Text": " vendors, it should be that our large software vendors are held to account to make sure that"
    },
    {
      "Time_Start": 3798.84,
      "Time_End": 3803.84,
      "Text": " code is secure, to make sure technology and hardware is secure, and they should be thinking"
    },
    {
      "Time_Start": 3803.84,
      "Time_End": 3807.84,
      "Text": " about how all of those things come together. And so a lot of the work that we're doing"
    },
    {
      "Time_Start": 3807.84,
      "Time_End": 3811.84,
      "Text": " is kind of picking up where that leaves off and driving towards how do we hold those big"
    },
    {
      "Time_Start": 3811.84,
      "Time_End": 3816.84,
      "Text": " players accountable. Some of that is by starting with our own infrastructure and the things"
    },
    {
      "Time_Start": 3816.84,
      "Time_End": 3820.84,
      "Text": " that we procure, but also that's where those liability frameworks and some of those other"
    },
    {
      "Time_Start": 3820.84,
      "Time_End": 3824.84,
      "Text": " things come into play is holding them to account and engaging them in this process."
    },
    {
      "Time_Start": 3824.84,
      "Time_End": 3829.84,
      "Text": " That ongoing conversation has been a big part of shifting some of these bigger players to"
    },
    {
      "Time_Start": 3829.84,
      "Time_End": 3834.84,
      "Text": " act in the manner that we have wanted them to. So we engaged very directly with a number"
    },
    {
      "Time_Start": 3834.84,
      "Time_End": 3840.84,
      "Text": " of companies on the open source software question, particularly around memory unsafe languages."
    },
    {
      "Time_Start": 3840.84,
      "Time_End": 3845.84,
      "Text": " And recently you probably saw that Microsoft announced that they'll, over the next ten"
    },
    {
      "Time_Start": 3845.84,
      "Time_End": 3851.84,
      "Text": " years or so, will be migrating their code base from C and C++, memory unsafe languages,"
    },
    {
      "Time_Start": 3851.84,
      "Time_End": 3856.84,
      "Text": " to Rust. That's a huge win. And that started just from engagement. We didn't even have"
    },
    {
      "Time_Start": 3856.84,
      "Time_End": 3860.84,
      "Text": " to get to the point where we were building out liability frameworks and that kind of"
    },
    {
      "Time_Start": 3860.84,
      "Time_End": 3865.84,
      "Text": " thing. And so this shift that we've got of engaging ecosystem partners to be a part of"
    },
    {
      "Time_Start": 3865.84,
      "Time_End": 3869.84,
      "Text": " the ideation and solutioning, having these conversations, especially with these bigger"
    },
    {
      "Time_Start": 3869.84,
      "Time_End": 3876.84,
      "Text": " players, is starting to drive and catalyze the kind of action that we want to see."
    },
    {
      "Time_Start": 3876.84,
      "Time_End": 3880.84,
      "Text": " The other venue I just want to highlight is international standards bodies. We really"
    },
    {
      "Time_Start": 3880.84,
      "Time_End": 3885.84,
      "Text": " need to engage more in international standards bodies because that's where a lot of the"
    },
    {
      "Time_Start": 3885.84,
      "Time_End": 3892.84,
      "Text": " frameworks that folks are using start. And that is where a lot of our engineers and"
    },
    {
      "Time_Start": 3893.84,
      "Time_End": 3900.84,
      "Text": " developers are getting some measure of training, right? Talking to their peers in these forums."
    },
    {
      "Time_Start": 3900.84,
      "Time_End": 3905.84,
      "Text": " And organizations, small, medium, and large, should be encouraging their security teams"
    },
    {
      "Time_Start": 3905.84,
      "Time_End": 3911.84,
      "Text": " or technical teams to participate in standards bodies to both share and to learn as those"
    },
    {
      "Time_Start": 3911.84,
      "Time_End": 3917.84,
      "Text": " standards evolve. And so that's another opportunity for us to evolve that."
    },
    {
      "Time_Start": 3918.84,
      "Time_End": 3920.84,
      "Text": " Go to the microphone."
    },
    {
      "Time_Start": 3920.84,
      "Time_End": 3925.84,
      "Text": " Hi. A question about international standards bodies. Standards bodies like the W3C have"
    },
    {
      "Time_Start": 3925.84,
      "Time_End": 3930.84,
      "Text": " IPR policies where you have to covenant not to invoke your IP against people who implement"
    },
    {
      "Time_Start": 3930.84,
      "Time_End": 3935.84,
      "Text": " standards. What about comparable covenants to say that if you are given a right through"
    },
    {
      "Time_Start": 3935.84,
      "Time_End": 3940.84,
      "Text": " standardization such as an anti-circumvention right or tortious interference right that"
    },
    {
      "Time_Start": 3940.84,
      "Time_End": 3944.84,
      "Text": " would allow you to silence a security researcher who comes forward with a bona fide claim about"
    },
    {
      "Time_Start": 3944.84,
      "Time_End": 3951.84,
      "Text": " a defect in a product covered under the standard? That as a condition of membership, the SDO"
    },
    {
      "Time_Start": 3951.84,
      "Time_End": 3957.84,
      "Text": " can force vendors to covenant non-aggression against security researchers who make those"
    },
    {
      "Time_Start": 3957.84,
      "Time_End": 3958.84,
      "Text": " disclosures."
    },
    {
      "Time_Start": 3958.84,
      "Time_End": 3963.84,
      "Text": " I wonder if that's going to happen. I was actually just thinking about W3C just then"
    },
    {
      "Time_Start": 3963.84,
      "Time_End": 3971.84,
      "Text": " because I was involved in W3C for a long time. And I remember Thomas Rosler who's there"
    },
    {
      "Time_Start": 3971.84,
      "Time_End": 3977.84,
      "Text": " encouraging somebody to come and help out because this guy who worked for a big security"
    },
    {
      "Time_Start": 3977.84,
      "Time_End": 3982.84,
      "Text": " software company highlighted all these issues of HTML5 and said, come and join us, come"
    },
    {
      "Time_Start": 3982.84,
      "Time_End": 3987.84,
      "Text": " and help us because we really need more security people. And he went, I don't do standards."
    },
    {
      "Time_Start": 3991.84,
      "Time_End": 3998.84,
      "Text": " But on that bit about pulling those rules in, I think that would be really, really helpful."
    },
    {
      "Time_Start": 3998.84,
      "Time_End": 4003.84,
      "Text": " And actually we're just trying to get to the point where we're getting CVD for specifically"
    },
    {
      "Time_Start": 4003.84,
      "Time_End": 4009.84,
      "Text": " for standards. So for example, for 3GPP and NC, they have CVD schemes in place now, which"
    },
    {
      "Time_Start": 4009.84,
      "Time_End": 4010.84,
      "Text": " is great."
    },
    {
      "Time_Start": 4010.84,
      "Time_End": 4017.84,
      "Text": " And the one thing I'll say, I like that idea. We had a fun discussion about, you know, hey,"
    },
    {
      "Time_Start": 4017.84,
      "Time_End": 4023.84,
      "Text": " CVD is now a very common practice, not universal, still some edge cases, but we've made a lot"
    },
    {
      "Time_Start": 4023.84,
      "Time_End": 4029.84,
      "Text": " of progress on it. The one challenge for things like widely implemented standards,"
    },
    {
      "Time_Start": 4029.84,
      "Time_End": 4039.84,
      "Text": " especially if it's a flaw in the standard itself, is that multi-party CVD is an increasingly"
    },
    {
      "Time_Start": 4039.84,
      "Time_End": 4045.84,
      "Text": " common use case in CVD. There's a very good guide that came out of the Software Engineering"
    },
    {
      "Time_Start": 4045.84,
      "Time_End": 4051.84,
      "Text": " Institute and First.org that we're working on, but that's something where we want to"
    },
    {
      "Time_Start": 4051.84,
      "Time_End": 4057.84,
      "Text": " help promote the muscle memory of that. And it's sometimes contentious. So for example,"
    },
    {
      "Time_Start": 4057.84,
      "Time_End": 4062.84,
      "Text": " there was a couple of years ago, let me phrase this as neutrally as possible, a couple of"
    },
    {
      "Time_Start": 4062.84,
      "Time_End": 4069.84,
      "Text": " years ago, there was a ship-based vulnerability and the folks that found it and the primary"
    },
    {
      "Time_Start": 4069.84,
      "Time_End": 4077.84,
      "Text": " vendors had to figure out who to have inside the trust circle. And they made some decisions"
    },
    {
      "Time_Start": 4077.84,
      "Time_End": 4083.84,
      "Text": " about some of their downstream customers who were the ones shipping it, but not certain"
    },
    {
      "Time_Start": 4083.84,
      "Time_End": 4090.84,
      "Text": " governments. And there was a lot of kerfuffle. And I don't know if that's an area where there"
    },
    {
      "Time_Start": 4090.84,
      "Time_End": 4094.84,
      "Text": " is a single right answer or wrong answer, but as we think about this, and this goes"
    },
    {
      "Time_Start": 4094.84,
      "Time_End": 4101.84,
      "Text": " to the bigger picture resiliency, the easy ones have been solved. And so now we're dealing"
    },
    {
      "Time_Start": 4101.84,
      "Time_End": 4109.84,
      "Text": " with these more complex issues where we may have to make situational-based judgments."
    },
    {
      "Time_Start": 4109.84,
      "Time_End": 4115.84,
      "Text": " So I think if I can zoom out a little bit from that and talk about government's involvement"
    },
    {
      "Time_Start": 4115.84,
      "Time_End": 4118.84,
      "Text": " in international standards generally, I do think..."
    },
    {
      "Time_Start": 4118.84,
      "Time_End": 4124.84,
      "Text": " Well, Charlie, let's just finish the CVD. I do want to elaborate much more on standards,"
    },
    {
      "Time_Start": 4124.84,
      "Time_End": 4130.84,
      "Text": " but I think there's a really important point here, isn't there, about basically treating"
    },
    {
      "Time_Start": 4130.84,
      "Time_End": 4135.84,
      "Text": " security research in respect and fundamental issues of software resiliency when it comes"
    },
    {
      "Time_Start": 4135.84,
      "Time_End": 4140.84,
      "Text": " to the standards themselves. So there are lots of gaps. We probably both know where"
    },
    {
      "Time_Start": 4140.84,
      "Time_End": 4145.84,
      "Text": " a lot of bodies are buried in IETF and W3C, not just in the building."
    },
    {
      "Time_Start": 4145.84,
      "Time_End": 4146.84,
      "Text": " Yeah."
    },
    {
      "Time_Start": 4147.84,
      "Time_End": 4156.84,
      "Text": " So for example, so you talked about multi-party disclosure. So in the mobile industry, we"
    },
    {
      "Time_Start": 4156.84,
      "Time_End": 4162.84,
      "Text": " wrote an industry-wide CVD scheme, and I think it's the only industry that has one like that."
    },
    {
      "Time_Start": 4162.84,
      "Time_End": 4166.84,
      "Text": " So security researchers, instead of having to go to each company individually, they can"
    },
    {
      "Time_Start": 4166.84,
      "Time_End": 4171.84,
      "Text": " come to the GSMA where it's seen as an industry-wide issue. And so what we're seeing is that a"
    },
    {
      "Time_Start": 4171.84,
      "Time_End": 4176.84,
      "Text": " lot of those are actually standards-based vulnerabilities. But what we've also done"
    },
    {
      "Time_Start": 4176.84,
      "Time_End": 4182.84,
      "Text": " there is facilitate it because those vendors and the companies often didn't have a clue"
    },
    {
      "Time_Start": 4182.84,
      "Time_End": 4187.84,
      "Text": " how to deal with security researchers. So half the time it was about creating that relationship"
    },
    {
      "Time_Start": 4187.84,
      "Time_End": 4193.84,
      "Text": " and saying, look, don't hammer this guy. This person's coming to you in good faith."
    },
    {
      "Time_Start": 4193.84,
      "Time_End": 4199.84,
      "Text": " And I'll also say that's where governments can play a role. My wonderful colleague, Elizabeth"
    },
    {
      "Time_Start": 4199.84,
      "Time_End": 4206.84,
      "Text": " Cardona, went off to say something much more interesting than us. But CISA has a team as"
    },
    {
      "Time_Start": 4206.84,
      "Time_End": 4212.84,
      "Text": " helping with coordinator as last resort with a particular focus on safety critical. We"
    },
    {
      "Time_Start": 4212.84,
      "Time_End": 4220.84,
      "Text": " run the IC, it used to be called ICS, sir. And we work very hard to focus on how do we"
    },
    {
      "Time_Start": 4220.84,
      "Time_End": 4226.84,
      "Text": " get things fixed as quickly as possible. And I love David's model, which is like, say,"
    },
    {
      "Time_Start": 4226.84,
      "Time_End": 4232.84,
      "Text": " protecting the researcher, but also taking the view of how are we actually protecting the humans."
    },
    {
      "Time_Start": 4232.84,
      "Time_End": 4240.84,
      "Text": " We can trail our CVD panel, can't we? CVD panel, look it up on the channel. So go back"
    },
    {
      "Time_Start": 4240.84,
      "Time_End": 4243.84,
      "Text": " out. Are we continuing on CVD or are we going to switch to standards?"
    },
    {
      "Time_Start": 4243.84,
      "Time_End": 4247.84,
      "Text": " I was just going to make two quick comments. One was in an effort to advance that as well,"
    },
    {
      "Time_Start": 4247.84,
      "Time_End": 4253.84,
      "Text": " NIST is doing a lot of work to make sure that security researchers are respected in international"
    },
    {
      "Time_Start": 4253.84,
      "Time_End": 4259.84,
      "Text": " bodies. But also we kind of wanted to elevate the collaboration and the visibility on the"
    },
    {
      "Time_Start": 4259.84,
      "Time_End": 4265.84,
      "Text": " importance of security researchers. So we hosted our version of hackers on the hill, hackers at"
    },
    {
      "Time_Start": 4265.84,
      "Time_End": 4270.84,
      "Text": " the White House, and had a bunch of security researchers come in, learn more about what we're"
    },
    {
      "Time_Start": 4270.84,
      "Time_End": 4274.84,
      "Text": " doing, so we can learn more about the challenges that they're facing in these international"
    },
    {
      "Time_Start": 4274.84,
      "Time_End": 4280.84,
      "Text": " standards bodies and otherwise. So we can start to ideate on how we solution that and how we"
    },
    {
      "Time_Start": 4280.84,
      "Time_End": 4284.84,
      "Text": " can advance rules that will help support them in that environment."
    },
    {
      "Time_Start": 4284.84,
      "Time_End": 4290.84,
      "Text": " Cool. Okay. So, Charlie, I cut you off, but I cut you off for good reason. Because standards"
    },
    {
      "Time_Start": 4290.84,
      "Time_End": 4295.84,
      "Text": " is a favorite topic at the moment, right? Everyone wants to be in standards. Five years ago,"
    },
    {
      "Time_Start": 4295.84,
      "Time_End": 4301.84,
      "Text": " nobody wanted to be involved in standards. So we have all of these standards bodies around the"
    },
    {
      "Time_Start": 4301.84,
      "Time_End": 4304.84,
      "Text": " world. Charlie, what's the answer?"
    },
    {
      "Time_Start": 4305.84,
      "Time_End": 4311.84,
      "Text": " Simple. I mean, I think the UK perspective is, unsurprisingly, that these are global issues"
    },
    {
      "Time_Start": 4311.84,
      "Time_End": 4316.84,
      "Text": " and they need global solutions. And I think standards bodies play an absolutely essential role"
    },
    {
      "Time_Start": 4316.84,
      "Time_End": 4322.84,
      "Text": " in that. During our call for views, one of the things we did consult on was whether the UK"
    },
    {
      "Time_Start": 4322.84,
      "Time_End": 4327.84,
      "Text": " should support the development of new standards around software development. And I think"
    },
    {
      "Time_Start": 4327.84,
      "Time_End": 4333.84,
      "Text": " generally the view we heard was that the standards are largely out there. The problem is that"
    },
    {
      "Time_Start": 4333.84,
      "Time_End": 4339.84,
      "Text": " people aren't actually using them. And there's that classic XKCD comic again, second time"
    },
    {
      "Time_Start": 4339.84,
      "Time_End": 4343.84,
      "Text": " there's a reference, there's always a reference, about there being 14 international standards"
    },
    {
      "Time_Start": 4343.84,
      "Time_End": 4347.84,
      "Text": " and someone says, we need to create a new standard that brings together all these standards."
    },
    {
      "Time_Start": 4347.84,
      "Time_End": 4352.84,
      "Text": " And then the result is that there are 15 international standards. And that's definitely something"
    },
    {
      "Time_Start": 4352.84,
      "Time_End": 4357.84,
      "Text": " we want to avoid. So, I mean, I think one of the real values of standards is in encouraging"
    },
    {
      "Time_Start": 4357.84,
      "Time_End": 4363.84,
      "Text": " that sort of consistent approach that's sort of interoperable between different countries."
    },
    {
      "Time_Start": 4363.84,
      "Time_End": 4368.84,
      "Text": " And any of the solutions which we're potentially looking at from the UK perspective, we would"
    },
    {
      "Time_Start": 4368.84,
      "Time_End": 4375.84,
      "Text": " want to align wherever possible with the appropriate international standards. You know, which"
    },
    {
      "Time_Start": 4375.84,
      "Time_End": 4381.84,
      "Text": " standards body you use is another question and it's a hard one. But I think we're really keen"
    },
    {
      "Time_Start": 4381.84,
      "Time_End": 4386.84,
      "Text": " to work with other governments, with the US, we've been working with the Singaporean government"
    },
    {
      "Time_Start": 4386.84,
      "Time_End": 4393.84,
      "Text": " on this and a few others, but really to identify which of those standards are key for getting"
    },
    {
      "Time_Start": 4393.84,
      "Time_End": 4400.84,
      "Text": " the fundamentals right in software development, right? And secure development is the most"
    },
    {
      "Time_Start": 4400.84,
      "Time_End": 4404.84,
      "Text": " important thing that we need to get right and getting that international alignment is"
    },
    {
      "Time_Start": 4404.84,
      "Time_End": 4407.84,
      "Text": " going to be essential and I think standards are the main way of delivering that."
    },
    {
      "Time_Start": 4408.84,
      "Time_End": 4410.84,
      "Text": " Camille, do you have a follow-up?"
    },
    {
      "Time_Start": 4410.84,
      "Time_End": 4415.84,
      "Text": " I'll just say that that work should be complemented with the bilateral, multilateral engagement"
    },
    {
      "Time_Start": 4415.84,
      "Time_End": 4420.84,
      "Text": " that Charlie just highlighted, right? Because there are so many standards bodies, it can"
    },
    {
      "Time_Start": 4420.84,
      "Time_End": 4425.84,
      "Text": " get confusing and you don't know where your partners are aligned if you're not engaging"
    },
    {
      "Time_Start": 4425.84,
      "Time_End": 4429.84,
      "Text": " with them directly on their direction and the things that they have prioritized. And"
    },
    {
      "Time_Start": 4429.84,
      "Time_End": 4433.84,
      "Text": " so that's just a really important complement to that standards organization."
    },
    {
      "Time_Start": 4434.84,
      "Time_End": 4438.84,
      "Text": " And I think, sorry, I guess the thing I did want to add to that is that the role of governments,"
    },
    {
      "Time_Start": 4438.84,
      "Time_End": 4443.84,
      "Text": " right, is to add extra authority to those standards by telling people you need to look"
    },
    {
      "Time_Start": 4443.84,
      "Time_End": 4447.84,
      "Text": " at this, you know? And that's really where that symbiotic relationship properly comes"
    },
    {
      "Time_Start": 4447.84,
      "Time_End": 4448.84,
      "Text": " into its own."
    },
    {
      "Time_Start": 4450.84,
      "Time_End": 4452.84,
      "Text": " And so to tie things back to SBOM, SBOM."
    },
    {
      "Time_Start": 4455.84,
      "Time_End": 4460.84,
      "Text": " So one of the things, and again this is in the National Strategy Implementation Plan,"
    },
    {
      "Time_Start": 4461.84,
      "Time_End": 4467.84,
      "Text": " is to explicitly partner with our peer governments around the world to make sure that we're"
    },
    {
      "Time_Start": 4467.84,
      "Time_End": 4471.84,
      "Text": " all on the same page. Because the last thing that people want is to say, all right, I've"
    },
    {
      "Time_Start": 4471.84,
      "Time_End": 4475.84,
      "Text": " got to have, here's the American solution and here's the Japanese solution and here's"
    },
    {
      "Time_Start": 4475.84,
      "Time_End": 4476.84,
      "Text": " the European solution."
    },
    {
      "Time_Start": 4478.84,
      "Time_End": 4488.84,
      "Text": " And then, but I also, we have a national standards strategy which embraces industry-led, oh gosh,"
    },
    {
      "Time_Start": 4488.84,
      "Time_End": 4494.84,
      "Text": " consensus-based, there are a bunch of buzzwords in it. But I do want to put a flag in there"
    },
    {
      "Time_Start": 4494.84,
      "Time_End": 4501.84,
      "Text": " which is, especially for the evolving security space, we need to be careful of premature"
    },
    {
      "Time_Start": 4501.84,
      "Time_End": 4502.84,
      "Text": " standardization."
    },
    {
      "Time_Start": 4504.84,
      "Time_End": 4509.84,
      "Text": " And even in the IETF, which embraces rough consensus and running code, guess what? It's"
    },
    {
      "Time_Start": 4509.84,
      "Time_End": 4512.84,
      "Text": " like two vendors that are driving it. And not even two vendors, it's like two very"
    },
    {
      "Time_Start": 4512.84,
      "Time_End": 4518.84,
      "Text": " excited people who are in a tiny corner of a vendor. And so this is where we want to"
    },
    {
      "Time_Start": 4518.84,
      "Time_End": 4523.84,
      "Text": " say, let's show that it works, show that it can scale, and then make sure that everyone"
    },
    {
      "Time_Start": 4523.84,
      "Time_End": 4529.84,
      "Text": " can weigh in as we fine-tune it. And so that's one of those areas that, nothing in security"
    },
    {
      "Time_Start": 4529.84,
      "Time_End": 4530.84,
      "Text": " is ever easy."
    },
    {
      "Time_Start": 4531.84,
      "Time_End": 4534.84,
      "Text": " Okay, we're going to continue on standards in a minute."
    },
    {
      "Time_Start": 4536.84,
      "Time_End": 4538.84,
      "Text": " This question leads right into that a little bit."
    },
    {
      "Time_Start": 4538.84,
      "Time_End": 4542.84,
      "Text": " Well, I don't think, I was going to call it something that we can't call it, but um,"
    },
    {
      "Time_Start": 4542.84,
      "Time_End": 4546.84,
      "Text": " anyway, think of your, the standards of what you most hate and then we can come back to that."
    },
    {
      "Time_Start": 4546.84,
      "Time_End": 4550.84,
      "Text": " Uh, so, gentlemen, um, I was going to say, gentlemen in the gray shirt."
    },
    {
      "Time_Start": 4550.84,
      "Time_End": 4556.84,
      "Text": " Sure, sure. Um, so speaking of international standards, you know, we have the RED coming,"
    },
    {
      "Time_Start": 4556.84,
      "Time_End": 4562.84,
      "Text": " we have EU, EU harmonization, right, which also encompasses the EU Cybersecurity Act. These"
    },
    {
      "Time_Start": 4562.84,
      "Time_End": 4566.84,
      "Text": " dates are like eminent, right, they're like within months for some of them. I was wondering"
    },
    {
      "Time_Start": 4566.84,
      "Time_End": 4570.84,
      "Text": " how you were following those policies and how they should be ingested."
    },
    {
      "Time_Start": 4572.84,
      "Time_End": 4574.84,
      "Text": " Was this the Cyber Resilience Act?"
    },
    {
      "Time_Start": 4574.84,
      "Time_End": 4576.84,
      "Text": " Uh, well, it's the EU Cybersecurity Act."
    },
    {
      "Time_Start": 4576.84,
      "Time_End": 4577.84,
      "Text": " Yes."
    },
    {
      "Time_Start": 4577.84,
      "Time_End": 4579.84,
      "Text": " And then that feeds into the Harmonization Act."
    },
    {
      "Time_Start": 4579.84,
      "Time_End": 4580.84,
      "Text": " Of course."
    },
    {
      "Time_Start": 4580.84,
      "Time_End": 4583.84,
      "Text": " And then also we have the RED out there, which is even more."
    },
    {
      "Time_Start": 4583.84,
      "Time_End": 4587.84,
      "Text": " So basically, we've got a ton of policies that have come through from governments and"
    },
    {
      "Time_Start": 4587.84,
      "Time_End": 4588.84,
      "Text": " it's overwhelming industry."
    },
    {
      "Time_Start": 4588.84,
      "Time_End": 4589.84,
      "Text": " Correct."
    },
    {
      "Time_Start": 4589.84,
      "Time_End": 4592.84,
      "Text": " And individuals who are having to deal with this and answer vendor questionnaires and"
    },
    {
      "Time_Start": 4592.84,
      "Time_End": 4598.84,
      "Text": " all sorts of stuff from Europe, from America, wherever. And, um, what was the question?"
    },
    {
      "Time_Start": 4598.84,
      "Time_End": 4602.84,
      "Text": " How are you to your cyber organizations?"
    },
    {
      "Time_Start": 4602.84,
      "Time_End": 4603.84,
      "Text": " Do you realize?"
    },
    {
      "Time_Start": 4603.84,
      "Time_End": 4605.84,
      "Text": " How are you involved?"
    },
    {
      "Time_Start": 4605.84,
      "Time_End": 4611.84,
      "Text": " Well, so from a UK perspective, in terms of, in terms of the burden, um, so we in 2021"
    },
    {
      "Time_Start": 4611.84,
      "Time_End": 4616.84,
      "Text": " published a, a, a higher level strategy called the Plan for Digital Regulation. And that"
    },
    {
      "Time_Start": 4616.84,
      "Time_End": 4623.84,
      "Text": " set out our overall, uh, plan to make sure that while there are lots of new regulations"
    },
    {
      "Time_Start": 4623.84,
      "Time_End": 4628.84,
      "Text": " in cyber competition and online safety, we need to be looking at the picture as a whole."
    },
    {
      "Time_Start": 4628.84,
      "Time_End": 4632.84,
      "Text": " And we also need to make sure that, uh, especially because a lot of, uh, these regulations are"
    },
    {
      "Time_Start": 4632.84,
      "Time_End": 4637.84,
      "Text": " affecting the same companies that we're not, uh, creating unnecessary duplication that"
    },
    {
      "Time_Start": 4637.84,
      "Time_End": 4641.84,
      "Text": " we're not making it overly burdensome. Um, and, and the international aspect of that"
    },
    {
      "Time_Start": 4641.84,
      "Time_End": 4647.84,
      "Text": " is absolutely key. So I, in all of the policies we're looking at from in the UK, that question"
    },
    {
      "Time_Start": 4647.84,
      "Time_End": 4652.84,
      "Text": " of, uh, international alignment or at least interact international operability is absolutely"
    },
    {
      "Time_Start": 4652.84,
      "Time_End": 4657.84,
      "Text": " the center of our thinking. Um, I think we don't want to create unnecessary red tape"
    },
    {
      "Time_Start": 4657.84,
      "Time_End": 4665.84,
      "Text": " despite the reputation that, uh, most, most bureaucrats have. Um, and at its core, I think"
    },
    {
      "Time_Start": 4665.84,
      "Time_End": 4669.84,
      "Text": " we share the same objectives with, uh, you know, a lot of the, a lot of the outcomes"
    },
    {
      "Time_Start": 4669.84,
      "Time_End": 4675.84,
      "Text": " that the EU is trying to get a lot of the outcomes that, uh, people in the U S are developing."
    },
    {
      "Time_Start": 4675.84,
      "Time_End": 4679.84,
      "Text": " We are going to have different ways that we get there, but, uh, I think particularly,"
    },
    {
      "Time_Start": 4679.84,
      "Time_End": 4682.84,
      "Text": " you know, from the UK perspective, one of the things we really want to prioritize is"
    },
    {
      "Time_Start": 4682.84,
      "Time_End": 4689.84,
      "Text": " sort of outcomes focused regulatory questions and outcomes focused, uh, uh, processes, which"
    },
    {
      "Time_Start": 4689.84,
      "Time_End": 4695.84,
      "Text": " allow vendors and any other organizations involved to take their own approach to delivering,"
    },
    {
      "Time_Start": 4695.84,
      "Time_End": 4699.84,
      "Text": " uh, these solutions. And I think as much as possible, that's what we're trying to do."
    },
    {
      "Time_Start": 4699.84,
      "Time_End": 4705.84,
      "Text": " So, uh, international alignment, I think is, is a key part of that. Yeah. As we develop"
    },
    {
      "Time_Start": 4705.84,
      "Time_End": 4711.84,
      "Text": " a lot of these standards and, and our, on our path forward, quite frankly, we have made"
    },
    {
      "Time_Start": 4711.84,
      "Time_End": 4717.84,
      "Text": " sure to not only include our private sector, but include our international partners and"
    },
    {
      "Time_Start": 4717.84,
      "Time_End": 4722.84,
      "Text": " to share the lessons learned and best practices and hopes of all of us driving towards similar"
    },
    {
      "Time_Start": 4722.84,
      "Time_End": 4726.84,
      "Text": " solutions and outcomes. So for example, we just had the one year anniversary of the"
    },
    {
      "Time_Start": 4726.84,
      "Time_End": 4731.84,
      "Text": " CHIPS Act. You'll see, you're seeing CHIPS Acts pop up all around the world. Um, we have"
    },
    {
      "Time_Start": 4731.84,
      "Time_End": 4737.84,
      "Text": " been in direct engagement to share what we are learning about the semiconductor space"
    },
    {
      "Time_Start": 4737.84,
      "Time_End": 4742.84,
      "Text": " with our partners. That said, I think the point that Charlie just made is a really important"
    },
    {
      "Time_Start": 4742.84,
      "Time_End": 4746.84,
      "Text": " one, that we will have different pathways for getting there. We will choose different"
    },
    {
      "Time_Start": 4746.84,
      "Time_End": 4752.84,
      "Text": " models in hopes of reaching the same or similar outcomes. I'm not exactly sure that any one"
    },
    {
      "Time_Start": 4752.84,
      "Time_End": 4759.84,
      "Text": " person or government can solve for that, but that continued bilateral and multilateral"
    },
    {
      "Time_Start": 4759.84,
      "Time_End": 4765.84,
      "Text": " engagement and our engagement in these broader bodies has been the best path for us to kind"
    },
    {
      "Time_Start": 4765.84,
      "Time_End": 4770.84,
      "Text": " of share those best practices and lessons learned and our path forward. Um, but what"
    },
    {
      "Time_Start": 4770.84,
      "Time_End": 4774.84,
      "Text": " tends to happen is one government's going to move out on one thing while we're focused"
    },
    {
      "Time_Start": 4774.84,
      "Time_End": 4778.84,
      "Text": " on another thing. And then, you know, someone gets ahead of someone else. And I don't think"
    },
    {
      "Time_Start": 4778.84,
      "Time_End": 4783.84,
      "Text": " we'll ever get past that. But what we have been doing and are very aware of, and I'm"
    },
    {
      "Time_Start": 4783.84,
      "Time_End": 4789.84,
      "Text": " talking to our partners about how we then mitigate the pain on, on the industry. Um,"
    },
    {
      "Time_Start": 4789.84,
      "Time_End": 4795.84,
      "Text": " and, and so I think you've seen more bodies designed to bring industry into it so that"
    },
    {
      "Time_Start": 4795.84,
      "Time_End": 4801.84,
      "Text": " they can, even if it's throw out there like, Hey, I have this new obligation over here."
    },
    {
      "Time_Start": 4801.84,
      "Time_End": 4805.84,
      "Text": " How do we marry these things up? That's getting into the process. And so I'm hoping the pain"
    },
    {
      "Time_Start": 4805.84,
      "Time_End": 4810.84,
      "Text": " is reduced, but I just want to be frank that it will take time because we will inevitably"
    },
    {
      "Time_Start": 4810.84,
      "Time_End": 4816.84,
      "Text": " in certain areas have different, um, plans for how to achieve the same outcome."
    },
    {
      "Time_Start": 4816.84,
      "Time_End": 4821.84,
      "Text": " If I could just very quickly add, I think this isn't just to be supportive of industry."
    },
    {
      "Time_Start": 4821.84,
      "Time_End": 4826.84,
      "Text": " I mean, that is, it's a strategically desirable outcome for us as well. You know, the more"
    },
    {
      "Time_Start": 4826.84,
      "Time_End": 4831.84,
      "Text": " inconsistency or duplication there is in the regulatory environment, whether domestically"
    },
    {
      "Time_Start": 4831.84,
      "Time_End": 4835.84,
      "Text": " or internationally, the more that companies can sort of, to some extent, just pick and"
    },
    {
      "Time_Start": 4835.84,
      "Time_End": 4840.84,
      "Text": " choose which ones they want. Right. And regulatory arbitrage is something we want to minimize"
    },
    {
      "Time_Start": 4840.84,
      "Time_End": 4845.84,
      "Text": " that benefits us as, as, as well as you guys. Yeah. Really quick. I'll just say we have"
    },
    {
      "Time_Start": 4845.84,
      "Time_End": 4852.84,
      "Text": " a regulatory harmonization RFI out right now. Please respond to it. These are, these are"
    },
    {
      "Time_Start": 4852.84,
      "Time_End": 4859.84,
      "Text": " our opportunities to advance a better understanding. Yes, for industry, but more so for the entire"
    },
    {
      "Time_Start": 4859.84,
      "Time_End": 4866.84,
      "Text": " ecosystem. Uh, the, the one other point I'd make in terms of progress that I've seen inside"
    },
    {
      "Time_Start": 4866.84,
      "Time_End": 4873.84,
      "Text": " my short tenure in the U S government is we have chunks of governments that their job"
    },
    {
      "Time_Start": 4873.84,
      "Time_End": 4878.84,
      "Text": " is to work with other countries. Uh, and for a while they were pretty stoked, like they"
    },
    {
      "Time_Start": 4879.84,
      "Time_End": 4885.84,
      "Text": " were only at a very high level and increasingly they're now bringing in the technical experts"
    },
    {
      "Time_Start": 4885.84,
      "Time_End": 4890.84,
      "Text": " along with them. So when we meet with our counterparts, uh, we actually have engineers"
    },
    {
      "Time_Start": 4890.84,
      "Time_End": 4895.84,
      "Text": " in the room or security experts in the room who can say, okay, that's great, but here's,"
    },
    {
      "Time_Start": 4895.84,
      "Time_End": 4901.84,
      "Text": " here's a specific issue that you're, you're glossing over. So that's, that's where we're"
    },
    {
      "Time_Start": 4901.84,
      "Time_End": 4908.84,
      "Text": " trying to make progress in the process side. And just to brag a little bit about the UK's"
    },
    {
      "Time_Start": 4908.84,
      "Time_End": 4913.84,
      "Text": " IOT work, like, and together with the U S as well, I think the, the countries that work"
    },
    {
      "Time_Start": 4913.84,
      "Time_End": 4919.84,
      "Text": " together to basically create defragmentation of what good looks like in IOT standards,"
    },
    {
      "Time_Start": 4919.84,
      "Time_End": 4925.84,
      "Text": " I think does set a really good model for how we can work in the future. Cause it is, is"
    },
    {
      "Time_Start": 4925.84,
      "Time_End": 4930.84,
      "Text": " really the opposite of that XKCD comic that you mentioned. We actually did manage to achieve"
    },
    {
      "Time_Start": 4931.22,
      "Time_End": 4935.82,
      "Text": " a lot of harmonization, but, uh, sorry, you've been waiting very patiently there for a question."
    },
    {
      "Time_Start": 4935.82,
      "Time_End": 4939.4800000000005,
      "Text": " No, it's perfectly fine. And, but I, it's a question in a completely different direction. I"
    },
    {
      "Time_Start": 4939.4800000000005,
      "Time_End": 4944.5,
      "Text": " hope. Yeah, no, no, no. We're happy to go in another direction. Yeah. So, uh, no, no, no, no"
    },
    {
      "Time_Start": 4944.5,
      "Time_End": 4951.360000000001,
      "Text": " FT, uh, no NFTs and no AI. Uh, we've, we're talking about resilience, right? As I was talking"
    },
    {
      "Time_Start": 4951.360000000001,
      "Time_End": 4957.6,
      "Text": " about resilience and covering from ICS all the way down to SMB, right? Now the harsh reality"
    },
    {
      "Time_Start": 4957.64,
      "Time_End": 4964.54,
      "Text": " for most organizations is that they are not going to, they are being hit by, uh, open RDP."
    },
    {
      "Time_Start": 4964.54,
      "Time_End": 4971.18,
      "Text": " They are being hit by a poor, poor adoption of MFA. They are being hit by difficulties"
    },
    {
      "Time_Start": 4971.18,
      "Time_End": 4977.96,
      "Text": " patching existing codes. I would love to hear your perspectives on what can we do to help"
    },
    {
      "Time_Start": 4977.96,
      "Time_End": 4984.200000000001,
      "Text": " these organizations. Uh, this is not about asking them to meet another standard. This is"
    },
    {
      "Time_Start": 4984.2,
      "Time_End": 4990.24,
      "Text": " not about, uh, uh, pointing them to as much as I love them, memory safe languages, right?"
    },
    {
      "Time_Start": 4990.24,
      "Time_End": 4997.44,
      "Text": " How are we helping the, the, the, the proverbial dentist or that, that, that needs, uh, uh,"
    },
    {
      "Time_Start": 4997.44,
      "Time_End": 5002.5199999999995,
      "Text": " that needs to fix RDP. This is practical on the ground stuff they can do. Uh, actually we, we,"
    },
    {
      "Time_Start": 5002.5199999999995,
      "Time_End": 5008.22,
      "Text": " uh, at these sites we, um, we've talked about agri-tech and, uh, I actually looked at, um,"
    },
    {
      "Time_Start": 5008.22,
      "Time_End": 5013.3,
      "Text": " some British stuff from the National Farmers Union, which the NTSC had written. And it, it"
    },
    {
      "Time_Start": 5013.3,
      "Time_End": 5019.84,
      "Text": " was basically generic advice about MFA and stuff that was too technical, I think, for any"
    },
    {
      "Time_Start": 5019.84,
      "Time_End": 5025.1,
      "Text": " farmer that I know that's a mate of mine. And then I don't think it would achieve the desired"
    },
    {
      "Time_Start": 5025.1,
      "Time_End": 5031.9400000000005,
      "Text": " objective. So I'm kind of interested as well to see, you know, what practical stuff can we do"
    },
    {
      "Time_Start": 5031.9400000000005,
      "Time_End": 5039.320000000001,
      "Text": " to protect retailers and small businesses now? Yeah, it's, it's a really tough question. Um, I"
    },
    {
      "Time_Start": 5039.32,
      "Time_End": 5045.24,
      "Text": " think part of it needs to be industry led solutions. Um, you know, I think we as government"
    },
    {
      "Time_Start": 5045.24,
      "Time_End": 5053.16,
      "Text": " need to be really encouraging, uh, the industry to be creating new ways to reduce the complexity"
    },
    {
      "Time_Start": 5053.16,
      "Time_End": 5059.48,
      "Text": " and to make it easier for organizations to secure themselves. Um, you know, we, uh, as a part of our"
    },
    {
      "Time_Start": 5059.48,
      "Time_End": 5062.639999999999,
      "Text": " call for views consulted on whether the government should even be looking into trying to fund these"
    },
    {
      "Time_Start": 5062.639999999999,
      "Time_End": 5068.24,
      "Text": " industry tools to create the market for ourselves. Now that is, is, I think we had mixed reviews on"
    },
    {
      "Time_Start": 5068.24,
      "Time_End": 5074.76,
      "Text": " that. And, uh, uh, I think we'll see where it goes, but the point is that technology can often"
    },
    {
      "Time_Start": 5074.76,
      "Time_End": 5080.8,
      "Text": " really be a helpful solution. Um, and, uh, you know, guidance is useful, but people need to"
    },
    {
      "Time_Start": 5080.8,
      "Time_End": 5086.24,
      "Text": " actually read it and people need to, uh, to use it. And obviously, as, as we talked about before,"
    },
    {
      "Time_Start": 5086.24,
      "Time_End": 5091.16,
      "Text": " these are often small businesses operating on an absolute shoestring and none of whom are"
    },
    {
      "Time_Start": 5091.16,
      "Time_End": 5096.16,
      "Text": " cybersecurity experts. Um, I think part of this does go back to what, uh, Camille was talking"
    },
    {
      "Time_Start": 5096.2,
      "Time_End": 5102.28,
      "Text": " about before and about the shifting of responsibility to companies who can actually have"
    },
    {
      "Time_Start": 5102.28,
      "Time_End": 5106.96,
      "Text": " that resource, but also have the more centralized control. You know, I think in the UK, we really"
    },
    {
      "Time_Start": 5106.96,
      "Time_End": 5113.16,
      "Text": " agree with, uh, uh, the point made in, in the, uh, US cyber strategy that we need to be giving"
    },
    {
      "Time_Start": 5113.16,
      "Time_End": 5117.04,
      "Text": " responsibility to the people who are best placed in the whole ecosystem to actually deal with the"
    },
    {
      "Time_Start": 5117.04,
      "Time_End": 5123.24,
      "Text": " problems. Um, you know, immediate solutions are hard, uh, and I don't think we're going to solve"
    },
    {
      "Time_Start": 5123.24,
      "Time_End": 5129.36,
      "Text": " them overnight. Um, but I do think if we, if we, you know, the more we can move control over"
    },
    {
      "Time_Start": 5129.36,
      "Time_End": 5133.36,
      "Text": " that in terms of maintenance and use to the companies who actually, uh, you know, develop and"
    },
    {
      "Time_Start": 5133.36,
      "Time_End": 5137.679999999999,
      "Text": " maintain the software, the better it will be. But, you know, obviously there are cyber"
    },
    {
      "Time_Start": 5137.679999999999,
      "Time_End": 5141.96,
      "Text": " challenges, which are even outside of that, right? You can have the most secure software"
    },
    {
      "Time_Start": 5141.96,
      "Time_End": 5147.04,
      "Text": " ecosystem in the world, but still in the UK, the majority of cyber attacks are, you know,"
    },
    {
      "Time_Start": 5147.04,
      "Time_End": 5153.6,
      "Text": " phishing, uh, and, and, and simple things. You can't solve all of that, but I think, um, a big part of it is"
    },
    {
      "Time_Start": 5153.6,
      "Time_End": 5160.04,
      "Text": " training, uh, and a big part of it needs to be, uh, empowering organizations to actually, uh, know"
    },
    {
      "Time_Start": 5160.04,
      "Time_End": 5163.0,
      "Text": " what they need to do and, and, and to take those basic steps."
    },
    {
      "Time_Start": 5163.24,
      "Time_End": 5171.16,
      "Text": " So what does CISA have in common with nineties metal fans and the lock pick village? We love"
    },
    {
      "Time_Start": 5171.2,
      "Time_End": 5180.48,
      "Text": " tools. Uh, and, uh, right. So we can, we have some lessons. We can look at the past where things"
    },
    {
      "Time_Start": 5180.48,
      "Time_End": 5187.72,
      "Text": " that used to be very advanced and had to be described in sort of very fluffy, not actionable"
    },
    {
      "Time_Start": 5187.72,
      "Time_End": 5192.68,
      "Text": " guidance, threat intelligence, uh, static analysis. And you remember what static analysis used to"
    },
    {
      "Time_Start": 5192.68,
      "Time_End": 5197.08,
      "Text": " be like 10 years ago, here's a giant list of things that are completely irrelevant to your"
    },
    {
      "Time_Start": 5197.08,
      "Time_End": 5204.96,
      "Text": " product. Um, and now we've had the tools and the entire marketplace has now shifted to, we will"
    },
    {
      "Time_Start": 5204.96,
      "Time_End": 5212.28,
      "Text": " help you parse which ones are important. So this isn't a perfect approach, but we do have to"
    },
    {
      "Time_Start": 5212.28,
      "Time_End": 5218.96,
      "Text": " acknowledge that things start rarified and being used by very resourced organizations. And then"
    },
    {
      "Time_Start": 5218.96,
      "Time_End": 5222.48,
      "Text": " everyone looks to say, well, yeah, I can make money selling to a bank, but you know, be even"
    },
    {
      "Time_Start": 5222.4800000000005,
      "Time_End": 5229.4400000000005,
      "Text": " better is selling to 10,000 medium sized enterprises. Uh, and so that's, you know,"
    },
    {
      "Time_Start": 5230.76,
      "Time_End": 5237.8,
      "Text": " understanding what's the policy part and where's the engagement part to actually help when he's"
    },
    {
      "Time_Start": 5237.8,
      "Time_End": 5243.68,
      "Text": " the term trickle down, but actually helping these things scale and integrate and be part of"
    },
    {
      "Time_Start": 5243.68,
      "Time_End": 5249.4800000000005,
      "Text": " what companies are already spending money on. Yeah. So to echo that, the, that shifting of"
    },
    {
      "Time_Start": 5249.4800000000005,
      "Time_End": 5253.4400000000005,
      "Text": " burden, the education and training, all of those are some of the longer term solutions, but more"
    },
    {
      "Time_Start": 5253.4400000000005,
      "Time_End": 5258.080000000001,
      "Text": " tactically, um, one of the things that I found most frustrating when I used to work at the"
    },
    {
      "Time_Start": 5258.080000000001,
      "Time_End": 5263.240000000001,
      "Text": " department of Homeland Security was how few people, how few organizations understood the"
    },
    {
      "Time_Start": 5263.240000000001,
      "Time_End": 5268.84,
      "Text": " resources out of what was then MPPD is now says, uh, to support small and medium businesses"
    },
    {
      "Time_Start": 5268.84,
      "Time_End": 5273.360000000001,
      "Text": " and businesses of any size, really, but small and medium businesses. There are educational"
    },
    {
      "Time_Start": 5273.4,
      "Time_End": 5280.24,
      "Text": " materials there, but also you could get actual support to harden your networks, to remediate a"
    },
    {
      "Time_Start": 5280.24,
      "Time_End": 5285.16,
      "Text": " attack. And, and that's something that we have been working really hard to make sure that"
    },
    {
      "Time_Start": 5285.16,
      "Time_End": 5290.2,
      "Text": " organizations across the ecosystem in the landscape know about. Um, and, and there are similar"
    },
    {
      "Time_Start": 5290.2,
      "Time_End": 5295.24,
      "Text": " resources and other countries that really are there to support the small and medium"
    },
    {
      "Time_Start": 5295.24,
      "Time_End": 5298.5199999999995,
      "Text": " businesses and all businesses, but really the small and medium businesses that don't have the"
    },
    {
      "Time_Start": 5298.56,
      "Time_End": 5305.56,
      "Text": " infrastructure themselves to be able to address the attacks that they're, that they're seeing."
    },
    {
      "Time_Start": 5305.56,
      "Time_End": 5311.080000000001,
      "Text": " Um, more tactically also, I mean, we have a small business cybersecurity summit in October"
    },
    {
      "Time_Start": 5311.080000000001,
      "Time_End": 5316.160000000001,
      "Text": " through SBA. They're doing a lot of work to educate small businesses. We are quite literally as a"
    },
    {
      "Time_Start": 5316.160000000001,
      "Time_End": 5321.200000000001,
      "Text": " government on a roadshow to make sure that small and medium businesses feel seen and are just"
    },
    {
      "Time_Start": 5321.200000000001,
      "Time_End": 5326.4800000000005,
      "Text": " kind of tracking this issue in general and know where their resources are. Um, we've been"
    },
    {
      "Time_Start": 5326.4800000000005,
      "Time_End": 5333.320000000001,
      "Text": " engaging philanthropy in building out tools that can be more wildly, widely available. And so"
    },
    {
      "Time_Start": 5333.320000000001,
      "Time_End": 5337.240000000001,
      "Text": " we're getting more creative about how we engage all the members of the ecosystem, right? So"
    },
    {
      "Time_Start": 5337.240000000001,
      "Time_End": 5341.080000000001,
      "Text": " we're convening philanthropy, we're convening the nonprofit sector who often provides a"
    },
    {
      "Time_Start": 5341.080000000001,
      "Time_End": 5345.040000000001,
      "Text": " number of tools for small organizations. How do we make sure that they're getting the support"
    },
    {
      "Time_Start": 5345.040000000001,
      "Time_End": 5350.080000000001,
      "Text": " they need from the large organizations or have the tools that they need to be able to make"
    },
    {
      "Time_Start": 5350.080000000001,
      "Time_End": 5354.52,
      "Text": " sound purchasing and secure and defensible purchasing decisions so that when they then build"
    },
    {
      "Time_Start": 5354.52,
      "Time_End": 5357.68,
      "Text": " this other tool that supports all of these small and medium organizations, particularly in the"
    },
    {
      "Time_Start": 5357.68,
      "Time_End": 5363.06,
      "Text": " nonprofit sector, that they are buying something that has already contemplated these issues."
    },
    {
      "Time_Start": 5363.06,
      "Time_End": 5367.92,
      "Text": " You'll see in the National Cyber Workforce Strategy, we talk about fractional hiring. How do we"
    },
    {
      "Time_Start": 5367.92,
      "Time_End": 5372.360000000001,
      "Text": " share talent and resources such that an organization that cannot afford to have a"
    },
    {
      "Time_Start": 5372.360000000001,
      "Time_End": 5377.320000000001,
      "Text": " cybersecurity resource on staff all of the time can have one-fourth of their time while this"
    },
    {
      "Time_Start": 5377.320000000001,
      "Time_End": 5381.320000000001,
      "Text": " other organization has one-fourth or one-eighth of their time and making sure that somebody"
    },
    {
      "Time_Start": 5381.32,
      "Time_End": 5388.5199999999995,
      "Text": " has access to the information, to the skill sets that they need to harden their systems?"
    },
    {
      "Time_Start": 5388.5199999999995,
      "Time_End": 5393.92,
      "Text": " And I'll just highlight those things, but we're trying to get creative with how we reach out."
    },
    {
      "Time_Start": 5393.92,
      "Time_End": 5400.08,
      "Text": " There are so many small businesses, and this is not their type priority, right? If you are"
    },
    {
      "Time_Start": 5400.08,
      "Time_End": 5405.12,
      "Text": " the mom and pop shop who is just trying to service your neighborhood, you're not thinking"
    },
    {
      "Time_Start": 5405.12,
      "Time_End": 5409.16,
      "Text": " about this, but there are a lot of great programs coming out of academic institutions where"
    },
    {
      "Time_Start": 5409.16,
      "Time_End": 5416.96,
      "Text": " one of the ways they're training students is to go to those stores and help them implement"
    },
    {
      "Time_Start": 5416.96,
      "Time_End": 5421.86,
      "Text": " multi-factor authentication, help them make sure they have all the security settings turned"
    },
    {
      "Time_Start": 5421.86,
      "Time_End": 5429.32,
      "Text": " on in the programs that they've deployed in their stores. Those are great opportunities for"
    },
    {
      "Time_Start": 5429.32,
      "Time_End": 5433.26,
      "Text": " not only training and skill development for the students and for the people who will soon be in"
    },
    {
      "Time_Start": 5433.26,
      "Time_End": 5437.76,
      "Text": " our workforce, but it also supports small businesses. So some of that ecosystem model that"
    },
    {
      "Time_Start": 5437.76,
      "Time_End": 5443.360000000001,
      "Text": " we're building out through the National Cyber Workforce and Education Strategy are designed"
    },
    {
      "Time_Start": 5443.360000000001,
      "Time_End": 5448.26,
      "Text": " to create an ecosystem that feeds itself and supports organizations like that, small and"
    },
    {
      "Time_Start": 5448.26,
      "Time_End": 5452.06,
      "Text": " medium businesses, community organizations, et cetera."
    },
    {
      "Time_Start": 5452.06,
      "Time_End": 5459.26,
      "Text": " So I guess, I mean, on the practical stuff as well, I have noticed, you call it trickle-down."
    },
    {
      "Time_Start": 5459.26,
      "Time_End": 5465.26,
      "Text": " I think maybe of a different term, but I don't think it's trickle-down because it's kind of"
    },
    {
      "Time_Start": 5465.26,
      "Time_End": 5471.06,
      "Text": " like a top-down direction on, you know, secure by design and product security measures being"
    },
    {
      "Time_Start": 5471.06,
      "Time_End": 5476.360000000001,
      "Text": " put in all products that are sold into enterprises that end up, so I guess that's the trickle-down,"
    },
    {
      "Time_Start": 5476.360000000001,
      "Time_End": 5483.46,
      "Text": " that end up in those small businesses. But maybe there's this gap in time when they can't"
    },
    {
      "Time_Start": 5483.46,
      "Time_End": 5487.76,
      "Text": " afford to replace it, and that's obviously the money issue, it's the who-pays issue, it's"
    },
    {
      "Time_Start": 5487.76,
      "Time_End": 5492.26,
      "Text": " always the issue, the same with rip and replace in mobile networks, you know? There's a lot"
    },
    {
      "Time_Start": 5492.26,
      "Time_End": 5498.26,
      "Text": " of burden on industry to create resilience and a lot of burden on small businesses and"
    },
    {
      "Time_Start": 5498.26,
      "Time_End": 5504.06,
      "Text": " consumers who are stretched at the moment as well. Gentleman here in the blue shirt."
    },
    {
      "Time_Start": 5504.06,
      "Time_End": 5507.360000000001,
      "Text": " Great, thank you. And this may be outside the scope, but if so, just feel free to just"
    },
    {
      "Time_Start": 5507.360000000001,
      "Time_End": 5510.76,
      "Text": " gloss over it, but since we're talking about resilience, if we could, I'd like to back"
    },
    {
      "Time_Start": 5510.76,
      "Time_End": 5515.76,
      "Text": " up to the real 30,000-foot view. Is anybody looking at, we're technologists, we like to"
    },
    {
      "Time_Start": 5515.76,
      "Time_End": 5518.860000000001,
      "Text": " have technological solutions, we like to make our technology better, we argue about different"
    },
    {
      "Time_Start": 5518.86,
      "Time_End": 5525.46,
      "Text": " ways we can do that, but when it does fail, is anybody looking at or trying to recommend"
    },
    {
      "Time_Start": 5525.46,
      "Time_End": 5530.96,
      "Text": " to companies that they have backup plans for when these things fail? For resilience,"
    },
    {
      "Time_Start": 5530.96,
      "Time_End": 5534.36,
      "Text": " literally, is there an analog solution to this digital problem that we used to have and we"
    },
    {
      "Time_Start": 5534.36,
      "Time_End": 5539.36,
      "Text": " used to know how to use? Like, I am a cavalry did that report where the billing system went"
    },
    {
      "Time_Start": 5539.36,
      "Time_End": 5543.96,
      "Text": " down, or the employee records went down, and they didn't know how to do paper records"
    },
    {
      "Time_Start": 5543.96,
      "Time_End": 5548.259999999999,
      "Text": " anymore, they couldn't do that. So is there any kind of non-technical, do we actually suggest"
    },
    {
      "Time_Start": 5548.26,
      "Time_End": 5550.96,
      "Text": " non-technical resilience solutions?"
    },
    {
      "Time_Start": 5550.96,
      "Time_End": 5555.66,
      "Text": " Some companies have had that happen, haven't they, where they had to go back to paper and"
    },
    {
      "Time_Start": 5555.66,
      "Time_End": 5558.46,
      "Text": " then realize that maybe they should have done that exercise."
    },
    {
      "Time_Start": 5558.46,
      "Time_End": 5563.360000000001,
      "Text": " Yeah, absolutely. I mean, if you look at the national cybersecurity strategy, it focuses"
    },
    {
      "Time_Start": 5563.360000000001,
      "Time_End": 5567.06,
      "Text": " on defensibility and resilience, right, the ability to bounce back. And you'll probably"
    },
    {
      "Time_Start": 5567.06,
      "Time_End": 5572.56,
      "Text": " see this a lot in the election space where the guidance that's going out, especially"
    },
    {
      "Time_Start": 5572.56,
      "Time_End": 5576.96,
      "Text": " best practices, are really focused on, like, should you focus on paper ballots? Should"
    },
    {
      "Time_Start": 5576.96,
      "Time_End": 5582.06,
      "Text": " there be a backup where folks can vote through the machine, but there also is a printout"
    },
    {
      "Time_Start": 5582.06,
      "Time_End": 5587.16,
      "Text": " that they can verify their votes, right? So yes, there are definitely efforts to focus"
    },
    {
      "Time_Start": 5587.16,
      "Time_End": 5592.56,
      "Text": " on that resilience piece, because inevitably, even systems that have been designed with"
    },
    {
      "Time_Start": 5592.56,
      "Time_End": 5597.36,
      "Text": " security in mind from the very beginning and privacy in mind from the very beginning will"
    },
    {
      "Time_Start": 5597.36,
      "Time_End": 5601.76,
      "Text": " see an attack, will be compromised, right? And so when your defenses are down, how do you"
    },
    {
      "Time_Start": 5601.76,
      "Time_End": 5606.76,
      "Text": " get them back up? But some of that is an analog solution. So how do we think about"
    },
    {
      "Time_Start": 5606.76,
      "Time_End": 5610.76,
      "Text": " all of those things? And how do you have a plan for your organization that includes"
    },
    {
      "Time_Start": 5610.76,
      "Time_End": 5615.66,
      "Text": " the entire C-suite that everyone is engaged and involved? Those are the parts of the conversation"
    },
    {
      "Time_Start": 5615.66,
      "Time_End": 5618.56,
      "Text": " that we're having, not only with the small and medium businesses, but of course, with"
    },
    {
      "Time_Start": 5618.56,
      "Time_End": 5624.66,
      "Text": " the larger ones as well. So I don't think I have a, I'm not sure about"
    },
    {
      "Time_Start": 5624.66,
      "Time_End": 5632.66,
      "Text": " specific rules around having an analog solution, but in the UK, we have the Network and Information"
    },
    {
      "Time_Start": 5632.76,
      "Time_End": 5635.96,
      "Text": " Services Regulations. I think that's what they're called, the NIS regulations, they're"
    },
    {
      "Time_Start": 5635.96,
      "Time_End": 5641.36,
      "Text": " normally known as. And what that really is are rules which focus on critical national"
    },
    {
      "Time_Start": 5641.36,
      "Time_End": 5646.16,
      "Text": " infrastructure and organizations which are foundational to the operation of the UK. And"
    },
    {
      "Time_Start": 5646.16,
      "Time_End": 5653.66,
      "Text": " those regulations do have a more strict set of rules around how organizations, which so"
    },
    {
      "Time_Start": 5653.66,
      "Time_End": 5657.76,
      "Text": " includes all the major sort of CNI sectors, but also digital service providers, things"
    },
    {
      "Time_Start": 5657.860000000001,
      "Time_End": 5665.860000000001,
      "Text": " like cloud computing, we're looking to bring into scope very soon, so that they have plans"
    },
    {
      "Time_Start": 5665.860000000001,
      "Time_End": 5674.76,
      "Text": " in place in case of everything from small outages to pretty catastrophic risks."
    },
    {
      "Time_Start": 5674.76,
      "Time_End": 5680.46,
      "Text": " So I think broadly our approach is to prioritize the areas that are most critical in that space,"
    },
    {
      "Time_Start": 5680.46,
      "Time_End": 5686.56,
      "Text": " but I think it is a really interesting question about how organizations which aren't thinking"
    },
    {
      "Time_Start": 5686.56,
      "Time_End": 5692.56,
      "Text": " about that in the way they have to in CNI, how they deal with that. I think it's a real challenge."
    },
    {
      "Time_Start": 5694.56,
      "Time_End": 5698.56,
      "Text": " Just two other data points of how this is happening today and how we need to expand it."
    },
    {
      "Time_Start": 5698.56,
      "Time_End": 5705.56,
      "Text": " One, five years ago, the post-Mirai botnet, the Department of Commerce published what's"
    },
    {
      "Time_Start": 5705.56,
      "Time_End": 5709.56,
      "Text": " referred to as the botnet report, but basically saying, how do we think about resilience against"
    },
    {
      "Time_Start": 5709.56,
      "Time_End": 5715.56,
      "Text": " massive scale automated malware? And one of the things it recommended is, hey, if your"
    },
    {
      "Time_Start": 5715.56,
      "Time_End": 5723.56,
      "Text": " network is hit, either directly or indirectly, binders. You've got to have the phone numbers,"
    },
    {
      "Time_Start": 5723.56,
      "Time_End": 5729.56,
      "Text": " you've got to have the, these are the IPs, this is, again, if you have a secure facility,"
    },
    {
      "Time_Start": 5729.56,
      "Time_End": 5734.56,
      "Text": " how are you going to reboot things? What are some of the less used details that you need"
    },
    {
      "Time_Start": 5734.56,
      "Time_End": 5737.56,
      "Text": " to have at your fingertips?"
    },
    {
      "Time_Start": 5737.56,
      "Time_End": 5742.56,
      "Text": " Second piece that we've seen as more and more organizations tabletop against ransomware"
    },
    {
      "Time_Start": 5742.56,
      "Time_End": 5749.56,
      "Text": " is, again, having that explicit behavior where the executives become aware through"
    },
    {
      "Time_Start": 5749.56,
      "Time_End": 5756.56,
      "Text": " engaging against this. I love there's now a movement to bring in influence from role-playing"
    },
    {
      "Time_Start": 5756.56,
      "Time_End": 5762.56,
      "Text": " games, which I think a lot of us enjoy, to make tabletops more interesting, more engaging,"
    },
    {
      "Time_Start": 5762.56,
      "Time_End": 5768.56,
      "Text": " and more real. Nothing like a couple of D10s to help you figure out, will your decisions"
    },
    {
      "Time_Start": 5768.56,
      "Time_End": 5774.56,
      "Text": " actually have an effect? And that also gets to people thinking through, what happens if"
    },
    {
      "Time_Start": 5774.56,
      "Time_End": 5780.56,
      "Text": " I lose this organizational capacity? How will I stay afloat? How do I prioritize? And that"
    },
    {
      "Time_Start": 5780.56,
      "Time_End": 5785.56,
      "Text": " speaks directly to the concept of resilience, which is bend but not break."
    },
    {
      "Time_Start": 5785.56,
      "Time_End": 5791.56,
      "Text": " I look forward to the invite to your organizational resilience one-shot."
    },
    {
      "Time_Start": 5791.56,
      "Time_End": 5795.56,
      "Text": " We'd have that almost in the door."
    },
    {
      "Time_Start": 5796.56,
      "Time_End": 5804.56,
      "Text": " That goes back to our previous discussion about IoT and the death of those IoT companies."
    },
    {
      "Time_Start": 5804.56,
      "Time_End": 5812.56,
      "Text": " What do people, again back to consumers as well, so they're the victim of a lack of software"
    },
    {
      "Time_Start": 5812.56,
      "Time_End": 5821.56,
      "Text": " resiliency in the end of life or that company going bust or whatever. Do we need to be preparing"
    },
    {
      "Time_Start": 5822.56,
      "Time_End": 5830.56,
      "Text": " users for that? Imagine a large cloud service provider goes bust type situation. When we"
    },
    {
      "Time_Start": 5830.56,
      "Time_End": 5835.56,
      "Text": " wrote that IoT stuff, for example, I couldn't believe that we had to write in there that"
    },
    {
      "Time_Start": 5835.56,
      "Time_End": 5843.56,
      "Text": " a door lock should still operate. It's because some of these companies are just doing this"
    },
    {
      "Time_Start": 5843.56,
      "Time_End": 5848.56,
      "Text": " stuff on the bench and assuming, I call it the Silicon Valley problem, which is that"
    },
    {
      "Time_Start": 5848.56,
      "Time_End": 5853.56,
      "Text": " we've always got internet, right? And actually for a lot of people, they do have power outages"
    },
    {
      "Time_Start": 5853.56,
      "Time_End": 5856.56,
      "Text": " repeatedly, especially if you live in Wales."
    },
    {
      "Time_Start": 5856.56,
      "Time_End": 5862.56,
      "Text": " I think this speaks directly to this vision we have of secure by design, secure by default."
    },
    {
      "Time_Start": 5865.56,
      "Time_End": 5869.56,
      "Text": " There are some things we should keep from the 90s. The kids need to know about SCAR,"
    },
    {
      "Time_Start": 5870.56,
      "Time_End": 5881.56,
      "Text": " but consumer empowerment as a primary technical policy philosophy didn't work. We've"
    },
    {
      "Time_Start": 5881.56,
      "Time_End": 5888.56,
      "Text": " successfully taught a decent chunk of consumers to do one thing for security, which is look"
    },
    {
      "Time_Start": 5888.56,
      "Time_End": 5894.56,
      "Text": " for the little lock in your browser. And five years ago, that stopped being relevant with"
    },
    {
      "Time_Start": 5894.56,
      "Time_End": 5898.56,
      "Text": " Let's Encrypt. It's not that Let's Encrypt is bad, but now that means something that"
    },
    {
      "Time_Start": 5898.56,
      "Time_End": 5906.56,
      "Text": " conveys no semantics. So if our strategy depends on teaching consumers things, we're not"
    },
    {
      "Time_Start": 5906.56,
      "Time_End": 5911.56,
      "Text": " going to succeed. And that's why, again, as Camille's been saying, and Cissa has, we've"
    },
    {
      "Time_Start": 5911.56,
      "Time_End": 5916.56,
      "Text": " got a lot of workshops coming up this week, and there's Bob Lord, who's pioneering this"
    },
    {
      "Time_Start": 5916.56,
      "Time_End": 5923.56,
      "Text": " effort, to say, how can we make it so that people don't have to make those decisions?"
    },
    {
      "Time_Start": 5923.56,
      "Time_End": 5928.56,
      "Text": " I do also think, I mean, I think we do actually need to be careful in part as well. So the"
    },
    {
      "Time_Start": 5928.56,
      "Time_End": 5934.56,
      "Text": " UK has various parts of the UK government which looks at civil contingencies and catastrophic"
    },
    {
      "Time_Start": 5934.56,
      "Time_End": 5939.56,
      "Text": " events, but I also think you don't necessarily want to start going out with campaigns telling"
    },
    {
      "Time_Start": 5939.56,
      "Time_End": 5943.56,
      "Text": " everyone, you need to be prepared for what happens when the internet goes down across"
    },
    {
      "Time_Start": 5943.56,
      "Time_End": 5948.56,
      "Text": " the country, because ultimately that's the job of governments, that's the job of the"
    },
    {
      "Time_Start": 5948.56,
      "Time_End": 5954.56,
      "Text": " companies who run them. And I think while it is important people remain aware, and I'm"
    },
    {
      "Time_Start": 5954.56,
      "Time_End": 5959.56,
      "Text": " sure many people in this room do think a lot about those kind of things, you also don't"
    },
    {
      "Time_Start": 5959.56,
      "Time_End": 5966.56,
      "Text": " want to be scaring people unnecessarily. And I think fundamentally the responsibility is"
    },
    {
      "Time_Start": 5966.56,
      "Time_End": 5970.56,
      "Text": " of government and the organisations involved in that critical national infrastructure."
    },
    {
      "Time_Start": 5970.56,
      "Time_End": 5974.56,
      "Text": " But I think consumer empowerment where it works and where we can is great, but as you"
    },
    {
      "Time_Start": 5974.56,
      "Time_End": 5977.56,
      "Text": " say, it's not the solution which we can rely on."
    },
    {
      "Time_Start": 5977.56,
      "Time_End": 5982.56,
      "Text": " So this is merely a thought experiment just leading on from your question. So, you know,"
    },
    {
      "Time_Start": 5982.56,
      "Time_End": 5988.56,
      "Text": " what do we think will happen if, say, a large cloud provider suddenly went bust overnight?"
    },
    {
      "Time_Start": 5988.56,
      "Time_End": 5993.56,
      "Text": " Do we think it would be like the banks where they go, you know, you have to bail them out"
    },
    {
      "Time_Start": 5993.56,
      "Time_End": 6000.56,
      "Text": " for the greater good of the users and the disruption that would ensue? And I know that's"
    },
    {
      "Time_Start": 6000.56,
      "Time_End": 6006.56,
      "Text": " a controversial statement in itself because that's a point of view, but if any of you"
    },
    {
      "Time_Start": 6006.56,
      "Time_End": 6009.56,
      "Text": " guys thought about this just personally or, you know?"
    },
    {
      "Time_Start": 6009.56,
      "Time_End": 6014.56,
      "Text": " Yeah, I don't think I can commit the British government to bailing out cloud manufacturers"
    },
    {
      "Time_Start": 6014.56,
      "Time_End": 6015.56,
      "Text": " if they go bust."
    },
    {
      "Time_Start": 6015.56,
      "Time_End": 6017.56,
      "Text": " Yeah, just Google. Can you bail out Google?"
    },
    {
      "Time_Start": 6017.56,
      "Time_End": 6024.56,
      "Text": " Yeah. I mean, you know, at the risk of repeating myself, I think part of that is why we are"
    },
    {
      "Time_Start": 6024.56,
      "Time_End": 6028.56,
      "Text": " currently looking to update the network and information systems regulations to include"
    },
    {
      "Time_Start": 6028.56,
      "Time_End": 6035.56,
      "Text": " more digital service providers and digital infrastructure providers because, you know,"
    },
    {
      "Time_Start": 6035.56,
      "Time_End": 6039.56,
      "Text": " people are reliant on cloud services now in a way that they were not 10 years ago."
    },
    {
      "Time_Start": 6039.56,
      "Time_End": 6044.56,
      "Text": " And we need to make sure that, and I believe I would need to double check, but I think"
    },
    {
      "Time_Start": 6044.56,
      "Time_End": 6050.56,
      "Text": " that sort of question of solvency is a part of that. You know, it's not just about having"
    },
    {
      "Time_Start": 6050.56,
      "Time_End": 6054.56,
      "Text": " secure data centers and having everything in place. I think it's about the sustainability"
    },
    {
      "Time_Start": 6054.56,
      "Time_End": 6058.56,
      "Text": " and I think from both a government perspective and from a company perspective, making sure"
    },
    {
      "Time_Start": 6058.56,
      "Time_End": 6064.56,
      "Text": " that the availability of those services are there in those kind of circumstances."
    },
    {
      "Time_Start": 6064.56,
      "Time_End": 6069.56,
      "Text": " But, yeah, I mean, I think it's an interesting question. I don't imagine most cloud companies"
    },
    {
      "Time_Start": 6069.56,
      "Time_End": 6073.56,
      "Text": " are looking at going bust. It looks like they're probably going the other way and growing bigger."
    },
    {
      "Time_Start": 6073.56,
      "Time_End": 6075.56,
      "Text": " But, you know, you never know."
    },
    {
      "Time_Start": 6075.56,
      "Time_End": 6078.56,
      "Text": " Yeah, that's what I was going to say. I mean, in terms of prioritization of the list of"
    },
    {
      "Time_Start": 6078.56,
      "Time_End": 6084.56,
      "Text": " problems that we have discussed today, yeah, I mean, I don't know how that would happen"
    },
    {
      "Time_Start": 6084.56,
      "Time_End": 6088.56,
      "Text": " if the major cloud providers, I mean, everybody stops using them and then the money runs out."
    },
    {
      "Time_Start": 6088.56,
      "Time_End": 6095.56,
      "Text": " I mean, I think we can contingency plan for outages, but them going bust is not a thing"
    },
    {
      "Time_Start": 6095.56,
      "Time_End": 6101.56,
      "Text": " that I think most of us have put at the top of the list of challenges to triage, nor do"
    },
    {
      "Time_Start": 6101.56,
      "Time_End": 6107.56,
      "Text": " I think it's a realistic possibility anytime soon. So, I think we're okay."
    },
    {
      "Time_Start": 6107.56,
      "Time_End": 6109.56,
      "Text": " I'm looking forward to that clip next week."
    },
    {
      "Time_Start": 6109.56,
      "Time_End": 6111.56,
      "Text": " I know, right?"
    },
    {
      "Time_Start": 6111.56,
      "Time_End": 6118.56,
      "Text": " Okay, so you heard it here first. So, we've only got a few more minutes left. So, has"
    },
    {
      "Time_Start": 6118.56,
      "Time_End": 6122.56,
      "Text": " anybody got a burning question they would like to ask any of the panelists?"
    },
    {
      "Time_Start": 6122.56,
      "Time_End": 6124.56,
      "Text": " Or just views they want to share as well."
    },
    {
      "Time_Start": 6124.56,
      "Time_End": 6129.56,
      "Text": " I was going to say, you can give the closing remarks, yeah."
    },
    {
      "Time_Start": 6129.56,
      "Time_End": 6133.56,
      "Text": " So, we've kind of gone across a lot of the landscape, and I didn't get to what I wanted"
    },
    {
      "Time_Start": 6133.56,
      "Time_End": 6140.56,
      "Text": " to talk about with standards, but like, has anybody got any ideas about software resiliency"
    },
    {
      "Time_Start": 6140.56,
      "Time_End": 6143.56,
      "Text": " in terms of what you would like to see?"
    },
    {
      "Time_Start": 6143.56,
      "Time_End": 6148.56,
      "Text": " It's too late in the afternoon, you need some coffee, don't you?"
    },
    {
      "Time_Start": 6148.56,
      "Time_End": 6155.56,
      "Text": " So, okay, so what do you think, what keeps you awake at night, Alan?"
    },
    {
      "Time_Start": 6156.56,
      "Time_End": 6167.56,
      "Text": " So, I mean, for me, the question that I sort of worry about is why haven't we seen the"
    },
    {
      "Time_Start": 6167.56,
      "Time_End": 6169.56,
      "Text": " catastrophic attack?"
    },
    {
      "Time_Start": 6169.56,
      "Time_End": 6174.56,
      "Text": " And that's not really something that keeps me awake, but the fact that we spend a lot"
    },
    {
      "Time_Start": 6174.56,
      "Time_End": 6179.56,
      "Text": " of time in security, and I use the analogy of the Drake equation a lot, which is you've"
    },
    {
      "Time_Start": 6180.56,
      "Time_End": 6186.56,
      "Text": " got so many humans, 30,000 people come to the desert every year and learn how to pop"
    },
    {
      "Time_Start": 6186.56,
      "Time_End": 6192.56,
      "Text": " shell, many of them really are a little crazy, and many of those people have very strong"
    },
    {
      "Time_Start": 6192.56,
      "Time_End": 6195.56,
      "Text": " opinions about very important institutions."
    },
    {
      "Time_Start": 6195.56,
      "Time_End": 6201.56,
      "Text": " And so, I don't have a good answer for it, and that makes me sort of worry that it's"
    },
    {
      "Time_Start": 6201.56,
      "Time_End": 6206.56,
      "Text": " just sheer luck that we haven't seen sort of the very large event."
    },
    {
      "Time_Start": 6206.56,
      "Time_End": 6210.56,
      "Text": " And so, that's sort of the high-level policy question that is way above my pay grade, but"
    },
    {
      "Time_Start": 6210.56,
      "Time_End": 6213.56,
      "Text": " I like to raise it for people like Camille."
    },
    {
      "Time_Start": 6213.56,
      "Time_End": 6220.56,
      "Text": " I think that the real challenge for us, which we've sort of covered here, is really a kind"
    },
    {
      "Time_Start": 6220.56,
      "Time_End": 6224.56,
      "Text": " of a core problem of government, which is that you have a limited number of resources"
    },
    {
      "Time_Start": 6224.56,
      "Time_End": 6227.56,
      "Text": " and an essentially infinite number of challenges."
    },
    {
      "Time_Start": 6227.56,
      "Time_End": 6233.56,
      "Text": " That's true in cyber as much as it is everywhere else, and that prioritization is hard, and"
    },
    {
      "Time_Start": 6233.56,
      "Time_End": 6236.56,
      "Text": " there are always people who might lose out on that."
    },
    {
      "Time_Start": 6236.56,
      "Time_End": 6240.56,
      "Text": " I think one of the things that we're really hoping to do in the UK is listen to as many"
    },
    {
      "Time_Start": 6240.56,
      "Time_End": 6244.56,
      "Text": " people as possible to make sure that we are making the right decisions and that there"
    },
    {
      "Time_Start": 6244.56,
      "Time_End": 6247.56,
      "Text": " are the right people who are being protected."
    },
    {
      "Time_Start": 6247.56,
      "Time_End": 6254.56,
      "Text": " But, you know, there are always things which don't get done, and we are really keen to"
    },
    {
      "Time_Start": 6254.56,
      "Time_End": 6258.56,
      "Text": " make sure that we are at least, if we make that wrong decision, we've been as informed"
    },
    {
      "Time_Start": 6258.56,
      "Time_End": 6260.56,
      "Text": " as possible."
    },
    {
      "Time_Start": 6260.56,
      "Time_End": 6265.56,
      "Text": " So, actually, it would be remiss of me not to note that our call for views, we are probably"
    },
    {
      "Time_Start": 6265.56,
      "Time_End": 6269.56,
      "Text": " publishing our sort of response to it in the next few months, so anyone who's interested"
    },
    {
      "Time_Start": 6269.56,
      "Time_End": 6274.56,
      "Text": " in learning more about what our next steps are in the UK and also sort of actually sharing"
    },
    {
      "Time_Start": 6274.56,
      "Time_End": 6278.56,
      "Text": " your views on it, keep an eye out for that, but also, obviously, happily sort of have"
    },
    {
      "Time_Start": 6278.56,
      "Time_End": 6280.56,
      "Text": " a chat afterwards as well."
    },
    {
      "Time_Start": 6280.56,
      "Time_End": 6283.56,
      "Text": " Hashtag advert."
    },
    {
      "Time_Start": 6283.56,
      "Time_End": 6288.56,
      "Text": " The ability to mitigate risk across a number of different issues all at the same time at"
    },
    {
      "Time_Start": 6288.56,
      "Time_End": 6293.56,
      "Text": " scale at the pace that we need them to be mitigated."
    },
    {
      "Time_Start": 6293.56,
      "Time_End": 6296.56,
      "Text": " That's what keeps me up at night, all night."
    },
    {
      "Time_Start": 6296.56,
      "Time_End": 6305.56,
      "Text": " But I do take heart in the progress that we have made and the evolution of the role of"
    },
    {
      "Time_Start": 6305.56,
      "Time_End": 6308.56,
      "Text": " government and private sector collaboration."
    },
    {
      "Time_Start": 6308.56,
      "Time_End": 6314.56,
      "Text": " We've moved from that public-private, you know, partnership when it really was just"
    },
    {
      "Time_Start": 6314.56,
      "Time_End": 6318.56,
      "Text": " throwing threat indicators across the fence to true collaboration."
    },
    {
      "Time_Start": 6318.56,
      "Time_End": 6323.56,
      "Text": " I mean, I think you've heard in everyone's points how they've worked with a private sector"
    },
    {
      "Time_Start": 6323.56,
      "Time_End": 6328.56,
      "Text": " organization of one kind or another, an international organization of one kind or another, to try"
    },
    {
      "Time_Start": 6328.56,
      "Time_End": 6332.56,
      "Text": " to advance and end and better understand the implications of the things that we are trying"
    },
    {
      "Time_Start": 6332.56,
      "Time_End": 6334.56,
      "Text": " to do."
    },
    {
      "Time_Start": 6334.56,
      "Time_End": 6335.56,
      "Text": " That's an important evolution."
    },
    {
      "Time_Start": 6335.56,
      "Time_End": 6340.56,
      "Text": " It will take time, so that doesn't really help my speed and scale piece, but I take"
    },
    {
      "Time_Start": 6341.56,
      "Time_End": 6346.56,
      "Text": " heart in the fact that now, as one of the people who moves back and forth between government"
    },
    {
      "Time_Start": 6346.56,
      "Time_End": 6350.56,
      "Text": " and the private sector and has seen how much harm on both sides can be done when they're"
    },
    {
      "Time_Start": 6350.56,
      "Time_End": 6357.56,
      "Text": " not talking to each other, that institutionalization of the collaboration model and a true understanding"
    },
    {
      "Time_Start": 6357.56,
      "Time_End": 6360.56,
      "Text": " of the challenges we seek to solve, I think is really important."
    },
    {
      "Time_Start": 6360.56,
      "Time_End": 6361.56,
      "Text": " Thank you."
    },
    {
      "Time_Start": 6361.56,
      "Time_End": 6365.56,
      "Text": " We're going to have to shut this down because I want to ask the audience one thing."
    },
    {
      "Time_Start": 6366.56,
      "Time_End": 6370.56,
      "Text": " Based on when you stepped into the room, and I know some people have joined us on the way,"
    },
    {
      "Time_Start": 6370.56,
      "Time_End": 6374.56,
      "Text": " like Peter who's just walked in one minute before the end."
    },
    {
      "Time_Start": 6377.56,
      "Time_End": 6378.56,
      "Text": " You enjoyed that panel."
    },
    {
      "Time_Start": 6380.56,
      "Time_End": 6385.56,
      "Text": " Based on when you walked in the room, do you feel now more confident or less confident"
    },
    {
      "Time_Start": 6385.56,
      "Time_End": 6391.56,
      "Text": " about government's approach to software resiliency?"
    },
    {
      "Time_Start": 6391.56,
      "Time_End": 6394.56,
      "Text": " If you feel more confident, raise your hands now."
    },
    {
      "Time_Start": 6397.56,
      "Time_End": 6398.56,
      "Text": " That's all the government people, isn't it?"
    },
    {
      "Time_Start": 6404.56,
      "Time_End": 6406.56,
      "Text": " Who is less confident?"
    },
    {
      "Time_Start": 6411.56,
      "Time_End": 6415.56,
      "Text": " Who's in the kind of don't know category, middle ground?"
    },
    {
      "Time_Start": 6416.56,
      "Time_End": 6419.56,
      "Text": " What hasn't changed has to be a valid option."
    },
    {
      "Time_Start": 6422.56,
      "Time_End": 6423.56,
      "Text": " Hasn't changed."
    },
    {
      "Time_Start": 6423.56,
      "Time_End": 6425.56,
      "Text": " Your view hasn't changed."
    },
    {
      "Time_Start": 6426.56,
      "Time_End": 6428.56,
      "Text": " That sounds pessimistic."
    },
    {
      "Time_Start": 6438.56,
      "Time_End": 6441.56,
      "Text": " All that remains for me to say is thank you, the audience."
    },
    {
      "Time_Start": 6441.56,
      "Time_End": 6443.56,
      "Text": " Thank you to Camille."
    },
    {
      "Time_Start": 6443.56,
      "Time_End": 6444.56,
      "Text": " Thank you to Charlie."
    },
    {
      "Time_Start": 6444.56,
      "Time_End": 6445.56,
      "Text": " And thank you to Alan."
    },
    {
      "Time_Start": 6453.56,
      "Time_End": 6456.56,
      "Text": " And thank you very much to David for his excellent chairing as well."
    },
    {
      "Time_Start": 6456.56,
      "Time_End": 6457.56,
      "Text": " Yes, thank you."
    }
  ]
}