{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 7.2,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay, good morning everyone. I'm Adrian. I'll be your host for the beginning of the session."
    },
    {
      "Time_Start": 7.2,
      "Time_End": 11.96,
      "Text": " I'm the chief operations of the Syopis Institute, a non-profit based in Geneva, Switzerland,"
    },
    {
      "Time_Start": 11.96,
      "Time_End": 17.28,
      "Text": " long way from home. Today we're going to talk about how you, hackers, can help protect high"
    },
    {
      "Time_Start": 17.28,
      "Time_End": 21.64,
      "Text": " risk communities working with the government, with industry, with academia, and with civil"
    },
    {
      "Time_Start": 21.64,
      "Time_End": 27.48,
      "Text": " society. So it's just to give you a glimpse of what you can all do to contribute to protecting"
    },
    {
      "Time_Start": 27.48,
      "Time_End": 35.04,
      "Text": " the most vulnerable online. So today I'm surrounded by a fantastic panel and I'll in a second"
    },
    {
      "Time_Start": 35.04,
      "Time_End": 38.44,
      "Text": " introduce all of them. I just want to tell you a little bit more about how the session's"
    },
    {
      "Time_Start": 38.44,
      "Time_End": 42.56,
      "Text": " going to be structured. So we're going to do half an hour of introductions, five minutes"
    },
    {
      "Time_Start": 42.56,
      "Time_End": 46.16,
      "Text": " each, so you understand a little bit better where we come from, what we do to help protect"
    },
    {
      "Time_Start": 46.16,
      "Time_End": 51.8,
      "Text": " vulnerable communities. Then we'll ask you to contribute. We are doing this session at"
    },
    {
      "Time_Start": 51.8,
      "Time_End": 55.32,
      "Text": " DEF CON because we want to hear from you, hackers, how we can do better, how we can"
    },
    {
      "Time_Start": 55.32,
      "Time_End": 60.64,
      "Text": " protect better those communities. So we're going to break into three small groups and"
    },
    {
      "Time_Start": 60.64,
      "Time_End": 66.32,
      "Text": " we're going to go in depth into how hackers can help the government. So we have representatives"
    },
    {
      "Time_Start": 66.32,
      "Time_End": 72.44,
      "Text": " from the government here, from CISA and USAID, how hackers can help industry. So we have"
    },
    {
      "Time_Start": 72.44,
      "Time_End": 77.88,
      "Text": " representatives from Microsoft and from McDermott, Will and Emery, law firm. And then how hackers"
    },
    {
      "Time_Start": 77.88,
      "Time_End": 83.76,
      "Text": " can help academia and civil society, representatives from UC Berkeley and the Institute. So without"
    },
    {
      "Time_Start": 83.76,
      "Time_End": 88.16000000000001,
      "Text": " further ado, we have David from CISA who's going to tell us a little bit about the high"
    },
    {
      "Time_Start": 88.16000000000001,
      "Time_End": 94.2,
      "Text": " risk community initiative that the Joint Cyber Defense Collaborative is launching, has launched"
    },
    {
      "Time_Start": 94.2,
      "Time_End": 101.28,
      "Text": " actually. We have Maurice from USAID who's going to tell us a little bit about the aid"
    },
    {
      "Time_Start": 101.28,
      "Time_End": 106.36000000000001,
      "Text": " efforts of the U.S. abroad and how to invest in cyber poor environments around the world."
    },
    {
      "Time_Start": 106.36000000000001,
      "Time_End": 112.32000000000001,
      "Text": " We have Monica from Microsoft who's going to tell us how Microsoft contributes and industry"
    },
    {
      "Time_Start": 112.32000000000001,
      "Time_End": 118.72000000000001,
      "Text": " can contribute to protecting vulnerable communities. We have Mark from McDermott, Will and Emery"
    },
    {
      "Time_Start": 118.72000000000001,
      "Time_End": 123.32000000000001,
      "Text": " who has just concluded a study on volunteer networks to see how we can provide assistance"
    },
    {
      "Time_Start": 123.32000000000001,
      "Time_End": 128.44,
      "Text": " at scale to these high risk communities. Then we've got Sarah who's representing the consortium"
    },
    {
      "Time_Start": 128.44,
      "Time_End": 134.56,
      "Text": " of cyber clinics out of UC Berkeley who's helping, who's having students help non-profits"
    },
    {
      "Time_Start": 134.56,
      "Time_End": 139.68,
      "Text": " around the world actually, not just in the U.S. And then myself, I'll tell you a little"
    },
    {
      "Time_Start": 139.68,
      "Time_End": 145.56,
      "Text": " bit more about who I am and what we do out of out of Geneva for the entire world. So thanks a"
    },
    {
      "Time_Start": 145.56,
      "Time_End": 150.48000000000002,
      "Text": " lot for being here. We expect this session to be engaging, dynamic. Feel free to ask"
    },
    {
      "Time_Start": 150.48000000000002,
      "Time_End": 154.02,
      "Text": " questions, raise your hands. We'll also break into smaller groups so you can contribute"
    },
    {
      "Time_Start": 154.02,
      "Time_End": 157.56,
      "Text": " directly. And David, I'll leave you the floor."
    },
    {
      "Time_Start": 157.56,
      "Time_End": 162.56,
      "Text": " Oh, there we go. Hi everybody. I hope you can take me seriously. So I'm really happy to be"
    },
    {
      "Time_Start": 162.92000000000002,
      "Time_End": 167.92000000000002,
      "Text": " here discussing this. I actually met my fiance who's right over here when I tweeted at her"
    },
    {
      "Time_Start": 174.12,
      "Time_End": 179.8,
      "Text": " like six years ago because she had written a paper on cyber volunteerism and the Estonian"
    },
    {
      "Time_Start": 179.8,
      "Time_End": 185.0,
      "Text": " Cyber Defense Corps. And now we're here on this panel at DEF CON on our two year anniversary,"
    },
    {
      "Time_Start": 185.0,
      "Time_End": 189.64000000000001,
      "Text": " the first time we had our first date to talk about cyber volunteers. We're getting married in"
    },
    {
      "Time_Start": 189.64000000000001,
      "Time_End": 196.66000000000003,
      "Text": " two weeks. So actually, I can't read. So I'm actually switch hitting here for an awesome"
    },
    {
      "Time_Start": 196.66000000000003,
      "Time_End": 201.9,
      "Text": " colleague of mine named Emily Scahill who actually runs the high risk communities planning"
    },
    {
      "Time_Start": 201.9,
      "Time_End": 207.4,
      "Text": " initiative. So forgive me, I do have some notes because this is not my particular program."
    },
    {
      "Time_Start": 207.4,
      "Time_End": 213.54000000000002,
      "Text": " But you know, the reason we're here is organizations that are highly vulnerable and lack"
    },
    {
      "Time_Start": 213.54000000000002,
      "Time_End": 218.28000000000003,
      "Text": " capacity to implement cyber security programs probably constitute the majority of"
    },
    {
      "Time_Start": 218.28,
      "Time_End": 223.12,
      "Text": " organizations, if not in the United States, then certainly the world as well. And our"
    },
    {
      "Time_Start": 223.12,
      "Time_End": 227.06,
      "Text": " director, Director Easterly, loves to speak about multi-factor authentication. But I can"
    },
    {
      "Time_Start": 227.06,
      "Time_End": 232.4,
      "Text": " tell you, my dad doesn't know how to implement multi-factor authentication. It might be as"
    },
    {
      "Time_Start": 232.4,
      "Time_End": 238.6,
      "Text": " easy as buying a YubiKey, but he doesn't even know to buy a YubiKey. So there are some"
    },
    {
      "Time_Start": 238.6,
      "Time_End": 243.54,
      "Text": " basic things that the folks in this room know how to do that some very important"
    },
    {
      "Time_Start": 243.54,
      "Time_End": 248.18,
      "Text": " organizations across this nation don't know how to do. What we're here to talk about is how"
    },
    {
      "Time_Start": 248.18,
      "Time_End": 254.12,
      "Text": " to leverage your expertise to help the most vulnerable organizations out there. So I"
    },
    {
      "Time_Start": 254.12,
      "Time_End": 258.36,
      "Text": " work in the planning branch inside the Joint Cyber Defense Collaborative, which is inside"
    },
    {
      "Time_Start": 258.36,
      "Time_End": 263.36,
      "Text": " CISA, which is inside DHS, which is part of the federal government of the United States. And"
    },
    {
      "Time_Start": 263.36,
      "Time_End": 268.5,
      "Text": " we're a nation of planet Earth and we're in the solar system. And our function in the"
    },
    {
      "Time_Start": 268.5,
      "Time_End": 272.88,
      "Text": " planning branch is to convene the federal interagency and the intelligence community with a"
    },
    {
      "Time_Start": 272.98,
      "Time_End": 278.18,
      "Text": " bunch of different industry partners to select very specific cyber security outcomes and"
    },
    {
      "Time_Start": 278.18,
      "Time_End": 282.42,
      "Text": " actually do proactive planning to achieve them. So one way to think about it is if a lot of"
    },
    {
      "Time_Start": 282.42,
      "Time_End": 286.65999999999997,
      "Text": " information sharing is about managing the problems we have, the planning we're doing is"
    },
    {
      "Time_Start": 286.65999999999997,
      "Time_End": 291.65999999999997,
      "Text": " supposed to either solve those problems or make them much, much easier for us to manage. So"
    },
    {
      "Time_Start": 294.5,
      "Time_End": 299.7,
      "Text": " APT actors deliberately target civil society organizations across the world to undermine"
    },
    {
      "Time_Start": 299.71999999999997,
      "Time_End": 304.36,
      "Text": " their ability to exercise democratic rights that are essential to the health of our"
    },
    {
      "Time_Start": 304.36,
      "Time_End": 309.74,
      "Text": " political economy and the political economy of nations across the world. So CISA launched a"
    },
    {
      "Time_Start": 309.74,
      "Time_End": 313.5,
      "Text": " high risk communities protection planning effort to improve cyber security for high risk"
    },
    {
      "Time_Start": 313.5,
      "Time_End": 318.74,
      "Text": " communities. So we define high risk communities, which is admittedly a nebulous term, to"
    },
    {
      "Time_Start": 318.74,
      "Time_End": 324.24,
      "Text": " really mean civil society. And we chose this focus because they are frequent targets of APT"
    },
    {
      "Time_Start": 324.26,
      "Time_End": 330.16,
      "Text": " actors, advanced persistent threat actors. They have low capacity and low levels of"
    },
    {
      "Time_Start": 330.16,
      "Time_End": 334.40000000000003,
      "Text": " government support and industry support generally speaking today. So we're talking"
    },
    {
      "Time_Start": 334.40000000000003,
      "Time_End": 340.1,
      "Text": " journalists, human rights organizations, NGOs, large and small. So we have three goals for"
    },
    {
      "Time_Start": 340.1,
      "Time_End": 345.22,
      "Text": " this initiative. A is to raise the cyber hygiene baseline for civil society. B is improve"
    },
    {
      "Time_Start": 345.22,
      "Time_End": 349.48,
      "Text": " the resilience of organizations that have been targeted already. And three is increase"
    },
    {
      "Time_Start": 349.5,
      "Time_End": 354.36,
      "Text": " government and industry support for civil society through real commitments. So how are we"
    },
    {
      "Time_Start": 354.36,
      "Time_End": 359.8,
      "Text": " doing this? We've, not we, Emily has established three working groups with over 30 industry"
    },
    {
      "Time_Start": 359.8,
      "Time_End": 364.24,
      "Text": " and civil society partners. And they are focused on, the first is cyber threat intelligence,"
    },
    {
      "Time_Start": 364.24,
      "Time_End": 368.44,
      "Text": " right? So a lot of the cyber threat intelligence out there is generally very enterprise"
    },
    {
      "Time_Start": 368.44,
      "Time_End": 374.28000000000003,
      "Text": " focused. It's not a lot of useful CTI for individuals or for small NGOs. And that matters"
    },
    {
      "Time_Start": 374.28000000000003,
      "Time_End": 379.36,
      "Text": " because a lot of NGOs operate in a bring your own device environment, right? So we want"
    },
    {
      "Time_Start": 379.36,
      "Time_End": 383.90000000000003,
      "Text": " some deliverables such as new threat products that actually describe risks specific to"
    },
    {
      "Time_Start": 383.90000000000003,
      "Time_End": 388.78000000000003,
      "Text": " high risk civil society organizations and individuals. And doing some more information sharing"
    },
    {
      "Time_Start": 388.78000000000003,
      "Time_End": 392.88,
      "Text": " generally between organizations in that space. The second working group is around awareness and"
    },
    {
      "Time_Start": 392.88,
      "Time_End": 397.62,
      "Text": " accessibility. So in October, cyber security month, we are going to have a dedicated"
    },
    {
      "Time_Start": 397.62,
      "Time_End": 401.72,
      "Text": " website up and running, hopefully. It will have cyber trainings for civil society"
    },
    {
      "Time_Start": 401.72,
      "Time_End": 408.2,
      "Text": " organizations. Our vulnerability management division has a ready set cyber program that is"
    },
    {
      "Time_Start": 408.2,
      "Time_End": 411.94,
      "Text": " either allows or will allow someone to take an assessment based on our cyber security"
    },
    {
      "Time_Start": 411.94,
      "Time_End": 416.3,
      "Text": " performance goals. Determine your level of maturity and then recommend CISA free services"
    },
    {
      "Time_Start": 416.3,
      "Time_End": 420.28,
      "Text": " that we can deliver to address those gaps. And then we're also going to have a database of"
    },
    {
      "Time_Start": 420.28,
      "Time_End": 424.44,
      "Text": " cyber volunteer organizations and programs. I have a bunch of slick sheets that I'm going to"
    },
    {
      "Time_Start": 424.44,
      "Time_End": 430.15999999999997,
      "Text": " hand out later. It's got a QR code on the bottom. Please tell us what you know about cyber"
    },
    {
      "Time_Start": 430.15999999999997,
      "Time_End": 434.36,
      "Text": " volunteer outfits that are out there today. We want to collect the list and we want to put it"
    },
    {
      "Time_Start": 434.36,
      "Time_End": 438.26,
      "Text": " out there. So if you want to get involved, you know who to contact. So everyone knows what's"
    },
    {
      "Time_Start": 438.26,
      "Time_End": 442.76,
      "Text": " going on. So if funders want to support this space, they know who's out there. And then we're"
    },
    {
      "Time_Start": 442.76,
      "Time_End": 446.76,
      "Text": " going to do an awareness road show for civil society organizations through conferences such as"
    },
    {
      "Time_Start": 446.76,
      "Time_End": 450.90000000000003,
      "Text": " this. And then finally the third working group is around operational collaboration and best"
    },
    {
      "Time_Start": 450.90000000000003,
      "Time_End": 456.84000000000003,
      "Text": " practices. So this is about getting companies like Google and Microsoft and folks with a lot"
    },
    {
      "Time_Start": 456.84000000000003,
      "Time_End": 461.34000000000003,
      "Text": " of resources who have been paying attention to this issue to work more together to enhance the"
    },
    {
      "Time_Start": 461.36,
      "Time_End": 466.44000000000005,
      "Text": " landscape for NGO security and risk management. So an example, let's get Meta, Microsoft, Apple"
    },
    {
      "Time_Start": 466.44000000000005,
      "Time_End": 470.90000000000003,
      "Text": " to actually reform their threat notifications. Because today they basically just send an email"
    },
    {
      "Time_Start": 470.90000000000003,
      "Time_End": 474.94000000000005,
      "Text": " that says hey, you've been targeted. Can we give a little more information? Can we provide some"
    },
    {
      "Time_Start": 474.94000000000005,
      "Time_End": 480.72,
      "Text": " actionable things they can do? Or creating an actual channel for sustained communications"
    },
    {
      "Time_Start": 480.72,
      "Time_End": 487.66,
      "Text": " between industry and key civil society nexus points such as, oh my god, what is the"
    },
    {
      "Time_Start": 487.68,
      "Time_End": 492.68,
      "Text": " Canadian organization? Yes, Citizen Lab, right. So organizations such as Citizen Lab that do a lot"
    },
    {
      "Time_Start": 495.32000000000005,
      "Time_End": 500.62,
      "Text": " of work here. Let's just make sure there's sustained communications. So we are executing the"
    },
    {
      "Time_Start": 500.62,
      "Time_End": 505.82000000000005,
      "Text": " plan right now. It's just been finished. It will continue to live on in a dedicated program"
    },
    {
      "Time_Start": 505.82000000000005,
      "Time_End": 511.84000000000003,
      "Text": " office next year. And I think that is all I have to say. So thank you very much."
    },
    {
      "Time_Start": 512.0600000000001,
      "Time_End": 517.0600000000001,
      "Text": " Can I also say really quickly, if you're looking for chairs, there's three up here up front and a"
    },
    {
      "Time_Start": 519.46,
      "Time_End": 524.46,
      "Text": " few over on that side if you'd like to sit. Thanks David. That was a really great introduction."
    },
    {
      "Time_Start": 529.84,
      "Time_End": 535.48,
      "Text": " Good morning everyone. My name is Maurice Kent. I work for USAID which is the agency for"
    },
    {
      "Time_Start": 535.48,
      "Time_End": 540.22,
      "Text": " international development. I will go into a bit of background. Most of you are probably not as"
    },
    {
      "Time_Start": 540.22,
      "Time_End": 546.7,
      "Text": " familiar with USAID as you are with CISA. So USAID is an independent government agency. It's"
    },
    {
      "Time_Start": 546.7,
      "Time_End": 551.8000000000001,
      "Text": " part of the National Security Council structure. It's been around for about 50 years. And we"
    },
    {
      "Time_Start": 551.8000000000001,
      "Time_End": 557.88,
      "Text": " manage the most of the foreign assistance budget overseas. So we do global health capacity"
    },
    {
      "Time_Start": 557.88,
      "Time_End": 562.6800000000001,
      "Text": " building, agriculture capacity building, economic growth, governance, disaster response,"
    },
    {
      "Time_Start": 562.6800000000001,
      "Time_End": 568.88,
      "Text": " energy. Basically every sector in 70 plus countries around the world where we work with"
    },
    {
      "Time_Start": 568.88,
      "Time_End": 574.42,
      "Text": " governments and civil society and private sector and all of those partners to help promote"
    },
    {
      "Time_Start": 574.42,
      "Time_End": 579.42,
      "Text": " local capacity building and objectives and well being. But then also as those relate to USG"
    },
    {
      "Time_Start": 581.62,
      "Time_End": 586.24,
      "Text": " national security interests and political interests, diplomatic interests and that sort of"
    },
    {
      "Time_Start": 586.24,
      "Time_End": 591.24,
      "Text": " thing. Throughout the kind of history and development of all of those projects that we have,"
    },
    {
      "Time_Start": 593.28,
      "Time_End": 598.68,
      "Text": " you know, many hundreds and hundreds and hundreds of contracts and grants and partnerships,"
    },
    {
      "Time_Start": 598.6800000000001,
      "Time_End": 605.3800000000001,
      "Text": " all of those programs have digital components. And they're generating data. People are"
    },
    {
      "Time_Start": 605.3800000000001,
      "Time_End": 611.2600000000001,
      "Text": " working, you know, more digitally. And of course we discover that all of those programs have"
    },
    {
      "Time_Start": 611.2600000000001,
      "Time_End": 616.6600000000001,
      "Text": " vulnerabilities. In many cases we'll focus specifically on the high risk communities, the same"
    },
    {
      "Time_Start": 616.6600000000001,
      "Time_End": 622.84,
      "Text": " kind of organizations that David mentioned, whether they're human rights defenders of minority"
    },
    {
      "Time_Start": 622.84,
      "Time_End": 629.38,
      "Text": " groups, LGBTQI groups, whether they are journalists, civil society organizations, other"
    },
    {
      "Time_Start": 629.38,
      "Time_End": 635.1800000000001,
      "Text": " security poor organizations as well. In many cases and in many of the countries we work, those"
    },
    {
      "Time_Start": 635.1800000000001,
      "Time_End": 641.5600000000001,
      "Text": " compared to other places, the US and elsewhere, those high risk communities are extremely"
    },
    {
      "Time_Start": 641.5600000000001,
      "Time_End": 646.52,
      "Text": " vulnerable and facing substantial threat with even less safety net than they might have in the"
    },
    {
      "Time_Start": 646.52,
      "Time_End": 651.52,
      "Text": " US. Sorry, my notes went away. And so over the past, I don't know, 10 years, 10, 12 years,"
    },
    {
      "Time_Start": 653.96,
      "Time_End": 659.4,
      "Text": " USAID has, as we're doing, you know, capacity building and helping those organizations do"
    },
    {
      "Time_Start": 659.4,
      "Time_End": 665.14,
      "Text": " their day jobs better as well, we're also, we've been looking towards supporting them with a"
    },
    {
      "Time_Start": 665.14,
      "Time_End": 671.14,
      "Text": " variety of cyber security and digital resilience skills and tools. We have a couple of"
    },
    {
      "Time_Start": 671.14,
      "Time_End": 676.34,
      "Text": " different programs, either they are indirect, so we have the greater internet freedom program,"
    },
    {
      "Time_Start": 676.34,
      "Time_End": 683.28,
      "Text": " which provides through internews, resources for a series of independent networks of, of"
    },
    {
      "Time_Start": 683.28,
      "Time_End": 689.22,
      "Text": " hackers and digital security consultants, that work in 30 plus countries. I run a contract"
    },
    {
      "Time_Start": 689.22,
      "Time_End": 693.6,
      "Text": " called Digital Apex, which hires security companies, hackers, some of whom are DEF CON"
    },
    {
      "Time_Start": 693.6,
      "Time_End": 698.0,
      "Text": " participants, to go to countries we work in and provide training and assessments and all those"
    },
    {
      "Time_Start": 698.02,
      "Time_End": 703.84,
      "Text": " things up there. And then we have country or regionally specific programs that work on"
    },
    {
      "Time_Start": 703.84,
      "Time_End": 708.84,
      "Text": " resilience of civil society and at risk communities. As we continue to develop those resources,"
    },
    {
      "Time_Start": 712.34,
      "Time_End": 718.92,
      "Text": " we're really excited for the CISA high risk community program to come into existence and to"
    },
    {
      "Time_Start": 718.92,
      "Time_End": 724.88,
      "Text": " work with them in bringing and leveraging the kind of massive resources at places like DEF CON"
    },
    {
      "Time_Start": 724.88,
      "Time_End": 731.4399999999999,
      "Text": " across the US and allied private industry and the hacker community to continue to ramp up"
    },
    {
      "Time_Start": 731.4399999999999,
      "Time_End": 735.02,
      "Text": " the availability of resources. You know, as, as that website and those trainings come live,"
    },
    {
      "Time_Start": 735.02,
      "Time_End": 738.42,
      "Text": " we'll be eager to figure out how we can localize that into different languages and stuff so it's"
    },
    {
      "Time_Start": 738.42,
      "Time_End": 742.86,
      "Text": " easier to access, how we can continue to build more partnerships, drive international"
    },
    {
      "Time_Start": 742.86,
      "Time_End": 749.76,
      "Text": " participation in HRC, and continue to engage with the community here, with academics and"
    },
    {
      "Time_Start": 749.78,
      "Time_End": 754.66,
      "Text": " others, um, to build up, uh, partnerships. And so I think that's kind of the discussion later"
    },
    {
      "Time_Start": 754.66,
      "Time_End": 759.66,
      "Text": " is, uh, I want to focus in on how we can, uh, use our resources to support broader, um,"
    },
    {
      "Time_Start": 763.26,
      "Time_End": 769.24,
      "Text": " partnerships and, and kind of, uh, wide reaching grassroots efforts so it's not necessarily,"
    },
    {
      "Time_Start": 769.24,
      "Time_End": 773.5,
      "Text": " you know, USAID has a partner, or USG has a partner, we see that that partner's had an"
    },
    {
      "Time_Start": 773.5,
      "Time_End": 777.68,
      "Text": " incident, we need to go pay somebody to go and respond, that that resource is already, uh, in"
    },
    {
      "Time_Start": 777.7,
      "Time_End": 780.74,
      "Text": " place and potentially, you know, that network is already there, that safety net is already"
    },
    {
      "Time_Start": 780.74,
      "Time_End": 785.74,
      "Text": " there. Um, so I guess I'll leave it there, uh, and we can go from there. Over."
    },
    {
      "Time_Start": 792.1200000000001,
      "Time_End": 796.86,
      "Text": " Good morning everyone, and apologies in advance for my, uh, voice, it's, uh, it's been a"
    },
    {
      "Time_Start": 796.86,
      "Time_End": 801.82,
      "Text": " hectic DEF CON but definitely a successful one. Um, so I am delighted to be here, thank you,"
    },
    {
      "Time_Start": 801.82,
      "Time_End": 806.86,
      "Text": " uh, to all of you for coming. Um, as David mentioned, this is the one topic that brought him"
    },
    {
      "Time_Start": 806.88,
      "Time_End": 811.08,
      "Text": " and I together so it's certainly near and dear to both of our hearts and we talked about"
    },
    {
      "Time_Start": 811.08,
      "Time_End": 814.98,
      "Text": " having these glasses on and being taken seriously so let, let's hope that we're, we're"
    },
    {
      "Time_Start": 814.98,
      "Time_End": 820.82,
      "Text": " getting to that. Um, but in any case, yes, my name is Monica Ruiz, I am a senior program,"
    },
    {
      "Time_Start": 820.82,
      "Time_End": 825.4,
      "Text": " um, manager within Microsoft's digital diplomacy team, and I wanted to talk a little bit"
    },
    {
      "Time_Start": 825.4,
      "Time_End": 830.24,
      "Text": " more about what Microsoft does in terms of providing support to high risk communities. And,"
    },
    {
      "Time_Start": 830.24,
      "Time_End": 834.94,
      "Text": " um, I'd like to go into three different buckets in order to, sort of delve into those"
    },
    {
      "Time_Start": 834.96,
      "Time_End": 840.82,
      "Text": " initiatives. Um, so the first one is, uh, Microsoft makes it a point to share information, um,"
    },
    {
      "Time_Start": 840.82,
      "Time_End": 844.8000000000001,
      "Text": " throughout the year with a lot of customers, users of our tools and services, and so we have"
    },
    {
      "Time_Start": 844.8000000000001,
      "Time_End": 848.6600000000001,
      "Text": " something called the Microsoft Digital Defense Report. And this is something that comes out"
    },
    {
      "Time_Start": 848.6600000000001,
      "Time_End": 853.94,
      "Text": " on an annual basis and it's essentially based on 43 trillion security signals that we receive"
    },
    {
      "Time_Start": 853.94,
      "Time_End": 859.6,
      "Text": " a day that is then assessed by roughly 20, 2500 security experts across the company. And"
    },
    {
      "Time_Start": 859.6,
      "Time_End": 863.58,
      "Text": " this is a way for us to, uh, push out information in terms of what we're seeing across the"
    },
    {
      "Time_Start": 863.58,
      "Time_End": 868.36,
      "Text": " digital ecosystem to then inform what are things that individuals can do to build better"
    },
    {
      "Time_Start": 868.36,
      "Time_End": 875.36,
      "Text": " resiliency, to be better cyber secure online. In addition to that, we have something, um,"
    },
    {
      "Time_Start": 875.36,
      "Time_End": 879.5,
      "Text": " that's a little bit more regionally focused and it's put together by the Microsoft Threat"
    },
    {
      "Time_Start": 879.5,
      "Time_End": 884.1,
      "Text": " Analysis Center. And so similar, like complementing the Microsoft Digital Defense Report,"
    },
    {
      "Time_Start": 884.1,
      "Time_End": 888.88,
      "Text": " this is another report that we put out a couple of times a year, um, that focuses on what"
    },
    {
      "Time_Start": 888.92,
      "Time_End": 894.02,
      "Text": " is the regional, um, state of affairs look like in a digital context and what is the foreign"
    },
    {
      "Time_Start": 894.02,
      "Time_End": 898.96,
      "Text": " influence information space look like based on our advantage point. And so we essentially,"
    },
    {
      "Time_Start": 898.96,
      "Time_End": 904.82,
      "Text": " um, put a lot of this information out again on an annual or quarterly basis, um, to be"
    },
    {
      "Time_Start": 904.82,
      "Time_End": 909.64,
      "Text": " transparent about this is, uh, what we're seeing, this is what users can do to sort of better"
    },
    {
      "Time_Start": 909.64,
      "Time_End": 915.3,
      "Text": " protect themselves. Secondly, I wanted to highlight the volunteer aspect, um, that, that"
    },
    {
      "Time_Start": 915.3000000000001,
      "Time_End": 920.44,
      "Text": " Microsoft employees are very excited to be participating in. So a big example of that would"
    },
    {
      "Time_Start": 920.44,
      "Time_End": 924.9000000000001,
      "Text": " be the Cyber Peace Institute. Um, from the digital diplomacy side, but certainly across the"
    },
    {
      "Time_Start": 924.9000000000001,
      "Time_End": 930.1800000000001,
      "Text": " company, we're delighted, um, to volunteer on a program called the Cyber Peace Builders,"
    },
    {
      "Time_Start": 930.1800000000001,
      "Time_End": 933.7800000000001,
      "Text": " which I know Adrian will talk a little bit more about, but it's essentially a very unique"
    },
    {
      "Time_Start": 933.7800000000001,
      "Time_End": 939.82,
      "Text": " network of cyber, uh, volunteers across, um, tech companies that provide support to"
    },
    {
      "Time_Start": 939.82,
      "Time_End": 944.6200000000001,
      "Text": " critical sector NGOs to build their cyber security. And this is something that many teams"
    },
    {
      "Time_Start": 944.64,
      "Time_End": 949.38,
      "Text": " across Microsoft contribute to, um, and have helped now since the program started a couple of"
    },
    {
      "Time_Start": 949.38,
      "Time_End": 955.12,
      "Text": " years ago. So we're pretty excited about that. Um, but in addition to that, um, we are so"
    },
    {
      "Time_Start": 955.12,
      "Time_End": 959.0600000000001,
      "Text": " excited and delighted to be part of the CISA High Risk Communities Initiative that David"
    },
    {
      "Time_Start": 959.0600000000001,
      "Time_End": 964.0600000000001,
      "Text": " covered that, um, Emily Sahil is so, um, effectively running. Um, we're involved across the"
    },
    {
      "Time_Start": 966.7,
      "Time_End": 972.2,
      "Text": " Mystic team, uh, the digital democracy team, and certainly the Democracy Forward team."
    },
    {
      "Time_Start": 972.22,
      "Time_End": 976.5200000000001,
      "Text": " And we're plugged into the different working groups, and so very excited to see how we can move"
    },
    {
      "Time_Start": 976.5200000000001,
      "Time_End": 982.5600000000001,
      "Text": " that, um, move that work forward and, um, continue contributing on that front. Um, in addition"
    },
    {
      "Time_Start": 982.5600000000001,
      "Time_End": 987.58,
      "Text": " to that, I did want to highlight, um, the fact that we also develop free tools and trainings for"
    },
    {
      "Time_Start": 989.8000000000001,
      "Time_End": 994.48,
      "Text": " high risk communities. We have a program called Account Guard. And Account Guard essentially,"
    },
    {
      "Time_Start": 994.48,
      "Time_End": 1000.98,
      "Text": " um, offers free, uh, trainings, but also added protection to individuals that use our"
    },
    {
      "Time_Start": 1001.0,
      "Time_End": 1006.36,
      "Text": " services, particularly, um, Office 365 products. So they get advanced protection, advanced"
    },
    {
      "Time_Start": 1006.36,
      "Time_End": 1010.94,
      "Text": " notification. Um, but we also have a catalog of different trainings that we make available to"
    },
    {
      "Time_Start": 1010.94,
      "Time_End": 1015.1,
      "Text": " civil society organizations that use our services as well. And so that's yet another way for us"
    },
    {
      "Time_Start": 1015.1,
      "Time_End": 1019.54,
      "Text": " to, to be a little bit more hands on and, and provide, uh, more security to those types of"
    },
    {
      "Time_Start": 1019.54,
      "Time_End": 1024.38,
      "Text": " groups. Um, lastly, and I didn't include it in the slide, but I, I would be remiss if I didn't"
    },
    {
      "Time_Start": 1024.38,
      "Time_End": 1029.52,
      "Text": " mention it, is Microsoft Skilling Initiative. Um, so this is something that we kicked off in"
    },
    {
      "Time_Start": 1029.52,
      "Time_End": 1036.1399999999999,
      "Text": " October 2021, where, um, we launched a campaign across different, um, community colleges"
    },
    {
      "Time_Start": 1036.1399999999999,
      "Time_End": 1043.04,
      "Text": " around the U.S. And we're essentially, uh, working toward a goal of, um, bringing 250,000"
    },
    {
      "Time_Start": 1043.04,
      "Time_End": 1049.12,
      "Text": " people into the cybersecurity pipeline by 2025. Because oftentimes we do hear, uh, a lot"
    },
    {
      "Time_Start": 1049.12,
      "Time_End": 1053.98,
      "Text": " about the talent pipeline and the fact that we certainly need to, you know, put in the work to,"
    },
    {
      "Time_Start": 1053.98,
      "Time_End": 1057.98,
      "Text": " to, to bring more people on board in this space. And so that's certainly something that we've"
    },
    {
      "Time_Start": 1057.98,
      "Time_End": 1064.1200000000001,
      "Text": " heard. And so our work with community colleges, or, um, in the U.S. is, is aimed at that. Um,"
    },
    {
      "Time_Start": 1064.1200000000001,
      "Time_End": 1069.96,
      "Text": " we're making curriculums available to all the nation's public community colleges. Um, we're"
    },
    {
      "Time_Start": 1069.96,
      "Time_End": 1075.94,
      "Text": " also providing training to new and existing faculty across 150 community colleges. And we're"
    },
    {
      "Time_Start": 1075.94,
      "Time_End": 1082.1,
      "Text": " also, um, providing scholarships and supplemental resources to 25,000 students in the U.S. And"
    },
    {
      "Time_Start": 1082.1,
      "Time_End": 1089.3999999999999,
      "Text": " to complement that, um, we actually kicked off, uh, in March 2022, um, a, uh, an expansion of"
    },
    {
      "Time_Start": 1089.3999999999999,
      "Time_End": 1093.58,
      "Text": " the program. And so now we're working with 23 countries outside of the U.S. to, again, help"
    },
    {
      "Time_Start": 1093.58,
      "Time_End": 1098.82,
      "Text": " build this talent pipeline and create more of a community to address certain risks that are, uh,"
    },
    {
      "Time_Start": 1098.82,
      "Time_End": 1103.56,
      "Text": " faced by high-risk communities, but also broaden the scope and the community of folks that are,"
    },
    {
      "Time_Start": 1103.56,
      "Time_End": 1108.6599999999999,
      "Text": " uh, working these issues in the space. Um, so with that, I'm very much looking forward to the,"
    },
    {
      "Time_Start": 1108.66,
      "Time_End": 1113.0600000000002,
      "Text": " uh, breakouts that we'll have in a little bit. And, uh, we'll hand it back to our moderator,"
    },
    {
      "Time_Start": 1113.0600000000002,
      "Time_End": 1114.0600000000002,
      "Text": " Adrian."
    },
    {
      "Time_Start": 1114.0600000000002,
      "Time_End": 1119.0600000000002,
      "Text": " Yeah. I'm passing back to, uh, to Mark."
    },
    {
      "Time_Start": 1119.0600000000002,
      "Time_End": 1125.6000000000001,
      "Text": " Hi, everyone. My name's Mark Schreiber. I'm from an international law firm, McDermott, Will &"
    },
    {
      "Time_Start": 1125.6000000000001,
      "Time_End": 1134.0800000000002,
      "Text": " Emery. We did a study of cyber volunteering, uh, that got published last March. The link should"
    },
    {
      "Time_Start": 1134.08,
      "Time_End": 1142.54,
      "Text": " be there and up on the board. Looks like this. It's about 80 pages long. We tried to canvas the"
    },
    {
      "Time_Start": 1142.54,
      "Time_End": 1152.56,
      "Text": " different groups, non-profits, state government, universities, anybody doing this type of"
    },
    {
      "Time_Start": 1152.56,
      "Time_End": 1160.8999999999999,
      "Text": " service. We then tried to break down those different organizations into pros and cons,"
    },
    {
      "Time_Start": 1160.92,
      "Time_End": 1168.5,
      "Text": " strengths and weaknesses, what more they would need, how to organize this better. We began to"
    },
    {
      "Time_Start": 1168.5,
      "Time_End": 1178.5,
      "Text": " understand that, uh, there was both a dearth of cyber security professionals. There was a"
    },
    {
      "Time_Start": 1178.5,
      "Time_End": 1187.22,
      "Text": " desperate need by smaller organizations, rural hospitals, civil society, you name it. I mean, our"
    },
    {
      "Time_Start": 1187.28,
      "Time_End": 1193.74,
      "Text": " firm does a fair amount of data breaches and day to day that's my job. It's a hard job even with"
    },
    {
      "Time_Start": 1193.74,
      "Time_End": 1199.8600000000001,
      "Text": " the best of forensic investigators and companies. We have the largest clients who can afford and"
    },
    {
      "Time_Start": 1199.8600000000001,
      "Time_End": 1206.06,
      "Text": " have enormous resources. How are smaller places going to be able to do that? So that was sort of"
    },
    {
      "Time_Start": 1206.06,
      "Time_End": 1213.04,
      "Text": " the dilemma we wanted to look at and in a almost chance conversation with David Forsey to my"
    },
    {
      "Time_Start": 1213.06,
      "Time_End": 1220.3999999999999,
      "Text": " right about a year ago here at DEF CON, uh, he gave us sort of the impetus, well, maybe a study"
    },
    {
      "Time_Start": 1220.3999999999999,
      "Time_End": 1228.08,
      "Text": " of some sort would be useful. And that was the origin of what we've done. We tried to break it"
    },
    {
      "Time_Start": 1228.08,
      "Time_End": 1235.82,
      "Text": " out into the differences between incident response and proactive cyber assessments, same"
    },
    {
      "Time_Start": 1235.82,
      "Time_End": 1240.96,
      "Text": " things that large law firms do with their clients all the time, and drill it down to smaller"
    },
    {
      "Time_Start": 1240.96,
      "Time_End": 1248.28,
      "Text": " organizations. And we ended up also coming up with a series of recommendations as a result of"
    },
    {
      "Time_Start": 1248.28,
      "Time_End": 1255.4,
      "Text": " that, several of which seem are now being adopted, uh, in the working groups that CISA so"
    },
    {
      "Time_Start": 1255.4,
      "Time_End": 1262.44,
      "Text": " artfully and vigorously is now putting together. So just a word about how did this all come"
    },
    {
      "Time_Start": 1262.44,
      "Time_End": 1272.64,
      "Text": " about? I listened to the Shields Up WebEx that CISA did, uh, in March of 22. It's three hours"
    },
    {
      "Time_Start": 1272.64,
      "Time_End": 1279.02,
      "Text": " long. At the very end, maybe two and a half hours in, a couple of the healthcare entities asked"
    },
    {
      "Time_Start": 1279.02,
      "Time_End": 1287.0,
      "Text": " about services, you know, free or discount services. And the response appropriately was, you"
    },
    {
      "Time_Start": 1287.0,
      "Time_End": 1292.32,
      "Text": " know, yeah, we have those, but it might take some time, maybe six to eight weeks for a pen test."
    },
    {
      "Time_Start": 1292.32,
      "Time_End": 1298.44,
      "Text": " We're understaffed. We need more resources. And it occurred to me at the end of listening to"
    },
    {
      "Time_Start": 1298.44,
      "Time_End": 1305.92,
      "Text": " that, well, what if there was some national catastrophic event? What would we do? I mean, we can't"
    },
    {
      "Time_Start": 1305.92,
      "Time_End": 1312.76,
      "Text": " manage it for all of the cases and clients we do with all of those resources. So, uh, at the"
    },
    {
      "Time_Start": 1312.76,
      "Time_End": 1320.8799999999999,
      "Text": " very, um, uh, end of that dilemma and as a result of DEFCON last year, we decided to do this"
    },
    {
      "Time_Start": 1320.8799999999999,
      "Time_End": 1327.68,
      "Text": " study. Uh, we made some recommendations, uh, there in the beginning of the report, much of it's"
    },
    {
      "Time_Start": 1327.68,
      "Time_End": 1333.76,
      "Text": " been tracked in the working groups and there's more to be done. Uh, and just the implementation"
    },
    {
      "Time_Start": 1333.76,
      "Time_End": 1340.36,
      "Text": " aspects, uh, how do you get, um, boots on the ground or butts in the seats or whatever the right"
    },
    {
      "Time_Start": 1340.4,
      "Time_End": 1346.3600000000001,
      "Text": " analogy is. That's the purpose of, uh, part of what we're going to talk about here and to"
    },
    {
      "Time_Start": 1346.3600000000001,
      "Time_End": 1351.96,
      "Text": " encourage you all to participate, uh, vigorously in the cyber volunteering program."
    },
    {
      "Time_Start": 1357.2800000000002,
      "Time_End": 1364.16,
      "Text": " Good morning. Um, I'd like to thank you. Good morning, David. Um, my name is Sarah Powazic. Uh,"
    },
    {
      "Time_Start": 1364.16,
      "Time_End": 1367.64,
      "Text": " I'm the program director of public interest cybersecurity at the center for long-term"
    },
    {
      "Time_Start": 1367.64,
      "Time_End": 1372.0,
      "Text": " cybersecurity at UC Berkeley. I'm really happy to be here this morning and I'd love to get a"
    },
    {
      "Time_Start": 1372.0,
      "Time_End": 1378.2,
      "Text": " sense of the room. Raise your hand if you're here from industry. Number of folks. Civil"
    },
    {
      "Time_Start": 1378.2,
      "Time_End": 1385.76,
      "Text": " society. Couple of folks. How about government? Lots of government folks. Um, how about"
    },
    {
      "Time_Start": 1385.76,
      "Time_End": 1392.4,
      "Text": " academia? Any, uh, educators or students in the audience? A couple. Thank you so much for being"
    },
    {
      "Time_Start": 1392.4,
      "Time_End": 1398.0800000000002,
      "Text": " here. Um, you know, academia isn't a typical actor in the cybersecurity space. Um, a lot of"
    },
    {
      "Time_Start": 1398.0800000000002,
      "Time_End": 1402.76,
      "Text": " folks double as teachers, but, um, not a lot of pure educators really come into the"
    },
    {
      "Time_Start": 1402.76,
      "Time_End": 1408.4,
      "Text": " cybersecurity space, but actually academia and higher education is becoming a huge player in"
    },
    {
      "Time_Start": 1408.4,
      "Time_End": 1413.2800000000002,
      "Text": " providing services to under-resourced organizations across the country. Um, so I'm here to"
    },
    {
      "Time_Start": 1413.2800000000002,
      "Time_End": 1417.4,
      "Text": " talk about the consortium of cybersecurity clinics and a really interesting model, um, for"
    },
    {
      "Time_Start": 1417.44,
      "Time_End": 1422.44,
      "Text": " serving local communities. Um, and it's based off of a really simple concept, which is that you"
    },
    {
      "Time_Start": 1422.44,
      "Time_End": 1429.48,
      "Text": " don't need to be an expert to be of service. Um, for decades, students in schools of law and"
    },
    {
      "Time_Start": 1429.48,
      "Time_End": 1435.52,
      "Text": " medicine have provided free services to their communities as a part of their core education. And"
    },
    {
      "Time_Start": 1435.52,
      "Time_End": 1440.8000000000002,
      "Text": " a number of years ago, um, a few institutions, um, the University of Alabama, University of"
    },
    {
      "Time_Start": 1440.8,
      "Time_End": 1448.6399999999999,
      "Text": " Berkeley, or goodness gracious, um, UC Berkeley, uh, MIT and, uh, University of Georgia thought that"
    },
    {
      "Time_Start": 1448.6399999999999,
      "Time_End": 1452.3999999999999,
      "Text": " that model could actually extend to cybersecurity where a number of organizations that are"
    },
    {
      "Time_Start": 1452.3999999999999,
      "Time_End": 1457.1599999999999,
      "Text": " providing services to their communities, um, were really falling behind on basic cyber"
    },
    {
      "Time_Start": 1457.1599999999999,
      "Time_End": 1461.72,
      "Text": " protections. So we've been running these programs for a number of years. Um, the basic"
    },
    {
      "Time_Start": 1461.72,
      "Time_End": 1466.96,
      "Text": " principle is that students come in with no experience required, undergrad and grad students,"
    },
    {
      "Time_Start": 1466.96,
      "Time_End": 1472.0,
      "Text": " all degree programs are welcome. And for the first number of weeks, they train them, they teach"
    },
    {
      "Time_Start": 1472.0,
      "Time_End": 1477.96,
      "Text": " them basic cybersecurity concepts, um, basic cyber hygiene. They run through the cybersecurity"
    },
    {
      "Time_Start": 1477.96,
      "Time_End": 1482.88,
      "Text": " performance goals that CISA has brought out. Um, and they teach them, uh, how to be"
    },
    {
      "Time_Start": 1482.88,
      "Time_End": 1487.8,
      "Text": " trainers. And then for the remainder of the course, the students are paired with a real client"
    },
    {
      "Time_Start": 1487.8,
      "Time_End": 1492.96,
      "Text": " in their community that needs their assistance. So each of the different clinics, um, function for"
    },
    {
      "Time_Start": 1492.96,
      "Time_End": 1497.88,
      "Text": " different communities. UC Berkeley's is focused on civil society, in particular organizations at"
    },
    {
      "Time_Start": 1497.88,
      "Time_End": 1502.04,
      "Text": " risk of politically motivated cyber attacks. So we actually work internationally, refugee"
    },
    {
      "Time_Start": 1502.04,
      "Time_End": 1508.04,
      "Text": " organizations and folks prosecuting war crimes, um, helping protect them, um, digitally online."
    },
    {
      "Time_Start": 1508.04,
      "Time_End": 1513.52,
      "Text": " Um, but a number of other clinics serve really, really local organizations. Um, the University of"
    },
    {
      "Time_Start": 1513.52,
      "Time_End": 1519.2,
      "Text": " Georgia serves school districts and local businesses, um, in the greater Georgia area. Um, the"
    },
    {
      "Time_Start": 1519.24,
      "Time_End": 1523.92,
      "Text": " University of Nevada, Las Vegas has partnered with their small business council and connects with local"
    },
    {
      "Time_Start": 1523.92,
      "Time_End": 1529.56,
      "Text": " dentistries and pizzerias and folks in their area to provide them basic cyber services. Um, it's a"
    },
    {
      "Time_Start": 1529.56,
      "Time_End": 1534.2,
      "Text": " really wonderful model. And the best part of it is that the students get a lot out of it too. Um, it"
    },
    {
      "Time_Start": 1534.2,
      "Time_End": 1539.04,
      "Text": " helps them get hands on experience before graduating, which helps them get a real job because"
    },
    {
      "Time_Start": 1539.04,
      "Time_End": 1543.44,
      "Text": " they can say, Hey, I've done this before. I've worked with a real client. I know what this looks"
    },
    {
      "Time_Start": 1543.44,
      "Time_End": 1548.56,
      "Text": " like in the wild and I'm prepared to continue offering these services. So, um, I'm really excited"
    },
    {
      "Time_Start": 1548.6,
      "Time_End": 1553.2,
      "Text": " to be here, really thrilled to be a part of the high risk communities program at CISA, um, and"
    },
    {
      "Time_Start": 1553.2,
      "Time_End": 1558.2,
      "Text": " looking forward to talking more about clinics. Um, so hi again, uh, Adrian from the Cyber Peace"
    },
    {
      "Time_Start": 1562.24,
      "Time_End": 1566.9199999999998,
      "Text": " Institute. We're a non-profit based, uh, out of, uh, Geneva. It was set up a few years ago by the"
    },
    {
      "Time_Start": 1566.9199999999998,
      "Time_End": 1571.9199999999998,
      "Text": " Hewlett Foundation, the MasterCard Foundation and Microsoft. Um, and we have a very simple"
    },
    {
      "Time_Start": 1571.9199999999998,
      "Time_End": 1577.9199999999998,
      "Text": " mission to bring about cyber peace, um, ambitious. And we try and break that down in three core"
    },
    {
      "Time_Start": 1577.92,
      "Time_End": 1582.6000000000001,
      "Text": " activities. So first we provide assistance to vulnerable communities. Second, we document how"
    },
    {
      "Time_Start": 1582.6000000000001,
      "Time_End": 1587.3600000000001,
      "Text": " those communities suffer, trying to draw a line between cyber attacks and suffering of human"
    },
    {
      "Time_Start": 1587.3600000000001,
      "Time_End": 1591.64,
      "Text": " life. And then we take those recommendations to public and private stakeholders to help them"
    },
    {
      "Time_Start": 1591.64,
      "Time_End": 1596.04,
      "Text": " come up with better laws and regulations to protect these communities. When it comes to"
    },
    {
      "Time_Start": 1596.04,
      "Time_End": 1600.5800000000002,
      "Text": " operational, operational assistance to vulnerable communities, we, we have set up a program"
    },
    {
      "Time_Start": 1600.5800000000002,
      "Time_End": 1604.38,
      "Text": " called the Cyber Peace Builders that Monica, you were talking about earlier that complements"
    },
    {
      "Time_Start": 1604.38,
      "Time_End": 1609.2800000000002,
      "Text": " really well what the cyber clinics are doing because essentially when your students graduate, um,"
    },
    {
      "Time_Start": 1609.2800000000002,
      "Time_End": 1615.16,
      "Text": " they have a venue to continue, continue volunteering to protect, um, vulnerable communities out of"
    },
    {
      "Time_Start": 1615.16,
      "Time_End": 1620.16,
      "Text": " their, um, thanks to their employers. So, um, the, um, reasons we chose to work with, um,"
    },
    {
      "Time_Start": 1622.6000000000001,
      "Time_End": 1628.5400000000002,
      "Text": " corporate cyber security professionals are three fold. The first is trust. Because we don't"
    },
    {
      "Time_Start": 1628.5400000000002,
      "Time_End": 1633.74,
      "Text": " have a professor that's supervising the help that's dispatched by the students to, to the,"
    },
    {
      "Time_Start": 1633.74,
      "Time_End": 1637.08,
      "Text": " um, non-profits, we need to make sure that, that the people who are helping know what they're"
    },
    {
      "Time_Start": 1637.08,
      "Time_End": 1641.68,
      "Text": " talking about. And we need to be able to trust them. So we're working with reputable companies"
    },
    {
      "Time_Start": 1641.68,
      "Time_End": 1646.22,
      "Text": " that we can vet and assess at scale, which we cannot do at an individual level, right? If you"
    },
    {
      "Time_Start": 1646.22,
      "Time_End": 1651.38,
      "Text": " want a network of volunteers, you cannot vet individually 10,000 people, uh, without incurring"
    },
    {
      "Time_Start": 1651.38,
      "Time_End": 1655.8,
      "Text": " massive costs. And so we work only with reputable companies and then we leverage the trust that"
    },
    {
      "Time_Start": 1655.8,
      "Time_End": 1660.26,
      "Text": " employers have in their employees so that we can dispatch people who we know know what they're"
    },
    {
      "Time_Start": 1660.26,
      "Time_End": 1665.06,
      "Text": " talking about and will provide valuable advice to non-profits. The second reason is"
    },
    {
      "Time_Start": 1665.06,
      "Time_End": 1669.5,
      "Text": " availability of talent. The biggest pool of cyber talent these days is in the corporate sector. So"
    },
    {
      "Time_Start": 1669.5,
      "Time_End": 1674.9,
      "Text": " if we want to help massive amounts of non-profits and small and medium enterprises, small"
    },
    {
      "Time_Start": 1674.9,
      "Time_End": 1680.78,
      "Text": " hospitals, then you need to tap into the biggest talent pool out there. The third is financial"
    },
    {
      "Time_Start": 1680.78,
      "Time_End": 1686.32,
      "Text": " sustainability. This is a core issue for us because a lot of volunteer networks have been"
    },
    {
      "Time_Start": 1686.32,
      "Time_End": 1691.48,
      "Text": " created in the past and, and had to stop for the simple reason that they cost money. And"
    },
    {
      "Time_Start": 1691.48,
      "Time_End": 1695.06,
      "Text": " people think that running a volunteer network is free because, you know, you don't have to"
    },
    {
      "Time_Start": 1695.06,
      "Time_End": 1698.8,
      "Text": " pay for the resource, but it's not free. You still have to manage a platform. You have to come"
    },
    {
      "Time_Start": 1698.8,
      "Time_End": 1703.1599999999999,
      "Text": " up with processes. You need to have people travel at events like Defcon. You need to, um,"
    },
    {
      "Time_Start": 1703.1599999999999,
      "Time_End": 1706.84,
      "Text": " manage the community, do outreach, convince people that you're not a scam because you're"
    },
    {
      "Time_Start": 1706.84,
      "Time_End": 1711.1399999999999,
      "Text": " providing free cybersecurity assistance to people worried that you're a scam. So there's some"
    },
    {
      "Time_Start": 1711.1399999999999,
      "Time_End": 1715.74,
      "Text": " costs. The beauty of those networks is that they can scale up without the cost scaling up. So"
    },
    {
      "Time_Start": 1715.74,
      "Time_End": 1719.76,
      "Text": " you can do a lot with very little, but you need to secure that base. When you work with the"
    },
    {
      "Time_Start": 1719.76,
      "Time_End": 1726.64,
      "Text": " private sector, you're able to tap into their CSR budget. And I'll jump into that, um, because"
    },
    {
      "Time_Start": 1726.64,
      "Time_End": 1732.58,
      "Text": " this is their massive positive trends in the CSR world that allows us essentially to ask"
    },
    {
      "Time_Start": 1732.58,
      "Time_End": 1737.88,
      "Text": " companies like Microsoft and MasterCard and, and HPE and Okta and Splunk and WithSecure and"
    },
    {
      "Time_Start": 1737.88,
      "Time_End": 1744.42,
      "Text": " whatnot to give us their employees, but also to pay us. Sounds like a double ask. It is, but"
    },
    {
      "Time_Start": 1744.44,
      "Time_End": 1747.8400000000001,
      "Text": " companies understand why they're going to pay. It's not a small, it's not a big amount that we"
    },
    {
      "Time_Start": 1747.8400000000001,
      "Time_End": 1752.8400000000001,
      "Text": " ask. So it's also a considerate. Um, there are four big trends in the, um, CSR world these days"
    },
    {
      "Time_Start": 1755.8200000000002,
      "Time_End": 1760.0800000000002,
      "Text": " that are fueling these, these types of opportunities. First, um, skill space, volunteering"
    },
    {
      "Time_Start": 1760.0800000000002,
      "Time_End": 1763.96,
      "Text": " opportunities. If you're a cybersecurity professional these days, you work for a company and"
    },
    {
      "Time_Start": 1763.96,
      "Time_End": 1768.3600000000001,
      "Text": " you want to use your skills to help, it's difficult. You're going to be able to help clean a"
    },
    {
      "Time_Start": 1768.3600000000001,
      "Time_End": 1773.2,
      "Text": " beach, participate in a shelter, uh, give, give food, things like that, which are very important"
    },
    {
      "Time_Start": 1773.22,
      "Time_End": 1777.48,
      "Text": " and very fulfilling. Um, but you're not going to be able to leverage your skills, right? So"
    },
    {
      "Time_Start": 1777.48,
      "Time_End": 1782.3600000000001,
      "Text": " there is a niche there and we're trying to, to fill that, fill that gap. The second is, um,"
    },
    {
      "Time_Start": 1782.3600000000001,
      "Time_End": 1787.9,
      "Text": " snackable pro bono. So a lot of volunteering opportunities these days take time. They need you"
    },
    {
      "Time_Start": 1787.9,
      "Time_End": 1793.9,
      "Text": " to travel, they need you to spend a full day or more, and employers don't like that so much."
    },
    {
      "Time_Start": 1793.9,
      "Time_End": 1798.04,
      "Text": " They want their employees to be able to do their volunteering in between two billable hours, to"
    },
    {
      "Time_Start": 1798.04,
      "Time_End": 1802.74,
      "Text": " be able to contribute fast, uh, to use their knowledge and not worry too much about the whole"
    },
    {
      "Time_Start": 1802.74,
      "Time_End": 1807.02,
      "Text": " logistics of it all. So what we do is we make sure all of the engagements are one to four hours,"
    },
    {
      "Time_Start": 1807.02,
      "Time_End": 1811.32,
      "Text": " they're easily scoped, volunteers come in, it's, they maximize face time and the advice they"
    },
    {
      "Time_Start": 1811.32,
      "Time_End": 1815.26,
      "Text": " give to, they give to, uh, non-profits, and then they get out and we handle the rest of the"
    },
    {
      "Time_Start": 1815.26,
      "Time_End": 1821.64,
      "Text": " relationship. The third is, uh, mounting ESG pressure. A lot of companies are asked to report"
    },
    {
      "Time_Start": 1821.64,
      "Time_End": 1825.64,
      "Text": " on their ESG practices. There's been a lot of greenwashing in the past, and so when you're"
    },
    {
      "Time_Start": 1825.64,
      "Time_End": 1829.84,
      "Text": " doing a skills-based volunteering, uh, initiative, you're allowing companies to align their"
    },
    {
      "Time_Start": 1829.8400000000001,
      "Time_End": 1834.38,
      "Text": " social good with their business priorities, so they like that. Um, and the last, but not the"
    },
    {
      "Time_Start": 1834.38,
      "Time_End": 1838.7200000000003,
      "Text": " least, is a big trend now in the non-profit world is, uh, what we call non-profit services, um,"
    },
    {
      "Time_Start": 1838.7200000000003,
      "Time_End": 1844.3200000000002,
      "Text": " software as a service models. So we're trying to create a financial pipeline between, uh, the"
    },
    {
      "Time_Start": 1844.3200000000002,
      "Time_End": 1850.1000000000001,
      "Text": " services that we offer and how we generate revenues to pay for our costs. In the past, most of"
    },
    {
      "Time_Start": 1850.1000000000001,
      "Time_End": 1854.94,
      "Text": " the non-profits would just raise grants from philanthropic actors or governments, which is"
    },
    {
      "Time_Start": 1854.94,
      "Time_End": 1860.64,
      "Text": " great, but at some point, these grants dry up because donors have different agendas, the money"
    },
    {
      "Time_Start": 1860.64,
      "Time_End": 1865.48,
      "Text": " is not infinite, and so you, you keep on having to fundraise. The other drawback of that is that"
    },
    {
      "Time_Start": 1865.48,
      "Time_End": 1871.1200000000001,
      "Text": " when you provide a service that's not financially, um, valued, you can provide a service that's"
    },
    {
      "Time_Start": 1871.1200000000001,
      "Time_End": 1874.96,
      "Text": " not qualitative because the people that are benefiting from it are not, at the end of the day,"
    },
    {
      "Time_Start": 1874.96,
      "Time_End": 1879.8,
      "Text": " paying for it. So by reintroducing a financial pipeline, having the companies, um, pay for"
    },
    {
      "Time_Start": 1879.8,
      "Time_End": 1883.2,
      "Text": " what we offer them, we make sure that we deliver the companies and the volunteers a good"
    },
    {
      "Time_Start": 1883.22,
      "Time_End": 1887.9,
      "Text": " experience, and we also make sure that the non-profits receive a valuable service, because if"
    },
    {
      "Time_Start": 1887.9,
      "Time_End": 1892.5,
      "Text": " the non-profits don't, then they wouldn't come to the network and then there would be no offer"
    },
    {
      "Time_Start": 1892.5,
      "Time_End": 1898.44,
      "Text": " for the volunteers and the companies. So these non-profit SaaS models, um, really are a game"
    },
    {
      "Time_Start": 1898.44,
      "Time_End": 1903.64,
      "Text": " changer. The Cyber Peace Builders was set up two years ago, we've helped so far over 150"
    },
    {
      "Time_Start": 1903.64,
      "Time_End": 1907.32,
      "Text": " non-profits around the world, uh, we've got a few here in the US, we're working with large groups"
    },
    {
      "Time_Start": 1907.32,
      "Time_End": 1912.26,
      "Text": " like the Kenyan Red Cross, like Doctors Without Borders, like SOS Mediterranean that are, um,"
    },
    {
      "Time_Start": 1912.28,
      "Time_End": 1917.32,
      "Text": " helping migrants in the Mediterranean Sea. We also help smaller organizations like Agamal in"
    },
    {
      "Time_Start": 1917.32,
      "Time_End": 1922.42,
      "Text": " Ghana, helping to fight malaria, there's an NGO we help here called AIDS Resource, helping to"
    },
    {
      "Time_Start": 1922.42,
      "Time_End": 1927.86,
      "Text": " protect, uh, people with, uh, AIDS, um, and so it's a variety of organizations which makes the"
    },
    {
      "Time_Start": 1927.86,
      "Time_End": 1933.4,
      "Text": " volunteering, I don't want to say fun, but engaging for the volunteers because they're exposed"
    },
    {
      "Time_Start": 1933.4,
      "Time_End": 1940.4,
      "Text": " to a variety of environments and very worthy causes. Um, I'll close here just to, to say that"
    },
    {
      "Time_Start": 1940.42,
      "Time_End": 1944.8200000000002,
      "Text": " when we set out on the mission to create a Builders, we wanted to, uh, walk the talk of"
    },
    {
      "Time_Start": 1944.8200000000002,
      "Time_End": 1948.96,
      "Text": " multi-stakeholderism. I used to work at the World Economic Forum, which is a big organization for"
    },
    {
      "Time_Start": 1948.96,
      "Time_End": 1953.5,
      "Text": " multi-stakeholder, um, collaboration. This is a perfect example of multi-stakeholder"
    },
    {
      "Time_Start": 1953.5,
      "Time_End": 1957.4,
      "Text": " collaboration because we're working closely with Academia and UC Berkeley. We have volunteers"
    },
    {
      "Time_Start": 1957.4,
      "Time_End": 1961.5800000000002,
      "Text": " from the private sector that are helping civil society. We're providing inputs to the"
    },
    {
      "Time_Start": 1961.5800000000002,
      "Time_End": 1965.88,
      "Text": " governments here in the US, in Switzerland. We're also working with cities, the city of Geneva,"
    },
    {
      "Time_Start": 1965.9,
      "Time_End": 1971.0,
      "Text": " the city of The Hague, that are willing to have local companies help local associations. So it's,"
    },
    {
      "Time_Start": 1971.0,
      "Time_End": 1975.5400000000002,
      "Text": " uh, a virtuous model that we're looking to scale. I'm actually recruiting, so if you're"
    },
    {
      "Time_Start": 1975.5400000000002,
      "Time_End": 1979.44,
      "Text": " interested, uh, come and see me after. But we're looking to scale this up and there are"
    },
    {
      "Time_Start": 1979.44,
      "Time_End": 1984.18,
      "Text": " virtually no limits to the number of, uh, people that we can take in and number of people we can"
    },
    {
      "Time_Start": 1984.18,
      "Time_End": 1988.8200000000002,
      "Text": " help. So, thanks a lot. I'm excited to jump into breakout groups. We're going to try and"
    },
    {
      "Time_Start": 1988.8200000000002,
      "Time_End": 1993.0600000000002,
      "Text": " separate. It's a good turnout, so we'll separate into three small groups where we can dive into"
    },
    {
      "Time_Start": 1993.1,
      "Time_End": 1997.44,
      "Text": " discussions. We'll rotate every 20 minutes, so you get a chance to speak to everyone and talk"
    },
    {
      "Time_Start": 1997.44,
      "Time_End": 2002.6799999999998,
      "Text": " about how industry, governments, civil society, and academia can help. And then we'll ask you"
    },
    {
      "Time_Start": 2002.6799999999998,
      "Time_End": 2007.58,
      "Text": " to contribute, take a few notes, maybe debrief at the end. But we'll all regroup, uh, in an hour or"
    },
    {
      "Time_Start": 2007.58,
      "Time_End": 2012.58,
      "Text": " so, so that we can all learn from each other. Is that alright? Thank you. Um, yeah, sure."
    },
    {
      "Time_Start": 2012.5800000000002,
      "Time_End": 2017.5800000000002,
      "Text": " Sure. Alright, yeah, so, um, do you want to take initial questions? Alright, so, let's do"
    },
    {
      "Time_Start": 2028.1000000000001,
      "Time_End": 2033.1000000000001,
      "Text": " walking group one, um, government here, so David and, um, and Maurice. Uh, walking group two"
    },
    {
      "Time_Start": 2036.1000000000001,
      "Time_End": 2041.1000000000001,
      "Text": " here in the middle with Monica and Mark. Walking group three here with Sarah and myself. Um,"
    },
    {
      "Time_Start": 2042.7400000000002,
      "Time_End": 2047.8200000000002,
      "Text": " and anyway, you're going to speak to all of us because we're, we're going to rotate. Okay? Thank"
    },
    {
      "Time_Start": 2047.8200000000002,
      "Time_End": 2053.92,
      "Text": " you. Everyone, thank you so much for staying, uh, up until the end. We really appreciate you"
    },
    {
      "Time_Start": 2053.92,
      "Time_End": 2058.46,
      "Text": " had amazing contributions. The other group leaders were telling us that you really had fantastic"
    },
    {
      "Time_Start": 2058.46,
      "Time_End": 2062.76,
      "Text": " ideas, so what, what this group will do, because we know each other quite well, particularly"
    },
    {
      "Time_Start": 2062.76,
      "Time_End": 2067.6000000000004,
      "Text": " these two, and we, we will, um, capitalize on all of your notes. We will contribute to the high"
    },
    {
      "Time_Start": 2067.6,
      "Time_End": 2072.64,
      "Text": " risk, um, initiative that, uh, Caesar is leading. We will input all of those ideas into our"
    },
    {
      "Time_Start": 2072.64,
      "Time_End": 2077.5,
      "Text": " thinking. We'll get back to you. And please do follow that QR code at the bottom of that page"
    },
    {
      "Time_Start": 2077.5,
      "Time_End": 2083.24,
      "Text": " and let us know if you, either if you run one, if you know one, if you know somebody who does, we"
    },
    {
      "Time_Start": 2083.24,
      "Time_End": 2088.72,
      "Text": " want to gather a list of all the volunteer outfits in the country and ultimately in the world, so"
    },
    {
      "Time_Start": 2088.72,
      "Time_End": 2092.12,
      "Text": " if you know them, let us know so we can put that on our website. Thank you."
    }
  ]
}