{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good afternoon and welcome to Policy at DEF CON. I am Heather, I am your room host. Um, and"
    },
    {
      "Time_Start": 8.14,
      "Time_End": 14.18,
      "Text": " this is demystifying hacking for state government officials. A few announcements before we"
    },
    {
      "Time_Start": 14.18,
      "Time_End": 19.18,
      "Text": " begin. Uh, this talk is being hosted on the record. Um, as a courtesy to speakers please make"
    },
    {
      "Time_Start": 21.02,
      "Time_End": 26.02,
      "Text": " sure that you uh, set your cell phones to silent. Um, we will have questions at the end. Please"
    },
    {
      "Time_Start": 26.58,
      "Time_End": 31.58,
      "Text": " use the microphone. Uh, because this is recorded we want to make sure that everyone can hear it"
    },
    {
      "Time_Start": 33.66,
      "Time_End": 38.66,
      "Text": " on the recording. Um, as a reminder, the photo policy prohibits taking pictures without the"
    },
    {
      "Time_Start": 40.2,
      "Time_End": 46.2,
      "Text": " explicit permission of everyone in the frame. That is not something that everyone in the"
    },
    {
      "Time_Start": 46.2,
      "Time_End": 51.2,
      "Text": " audience has done. So, please, please be careful. Um, and uh, with that, let's get started."
    },
    {
      "Time_Start": 52.2,
      "Time_End": 57.2,
      "Text": " I will let uh, Lindsay Folson introduce the panel. Thank you. Hello everyone. Um, I know"
    },
    {
      "Time_Start": 60.300000000000004,
      "Time_End": 66.3,
      "Text": " we're the, the last panel of the day so we'll try to keep it brief and um, not too boring. Um,"
    },
    {
      "Time_Start": 66.3,
      "Time_End": 70.58,
      "Text": " we're here to talk about demystifying hacking for state government officials which has"
    },
    {
      "Time_Start": 70.58,
      "Time_End": 76.78,
      "Text": " been a collaborative effort of members of the National Association of Secretaries of State."
    },
    {
      "Time_Start": 76.8,
      "Time_End": 81.3,
      "Text": " Very quickly I want to introduce my panel. My name is Lindsay Folson. I'm the deputy"
    },
    {
      "Time_Start": 81.3,
      "Time_End": 86.04,
      "Text": " executive director for the National Association of Secretaries of State which is the last"
    },
    {
      "Time_Start": 86.04,
      "Time_End": 91.52,
      "Text": " time I'll say that. NAS is our acronym. Um, I have with me Jack Cable, senior technical"
    },
    {
      "Time_Start": 91.52,
      "Time_End": 97.56,
      "Text": " advisor for CISA. Michael Ross, deputy secretary of state and chief of staff for the Iowa"
    },
    {
      "Time_Start": 97.56,
      "Time_End": 102.2,
      "Text": " Secretary of State's office. Jason Ingalls, founder and CEO of Ingalls Information"
    },
    {
      "Time_Start": 102.22,
      "Time_End": 107.76,
      "Text": " Security. And Brad Manuel, chief information officer for the Louisiana Secretary of State's"
    },
    {
      "Time_Start": 107.76,
      "Time_End": 114.10000000000001,
      "Text": " office. I know this is an on the record session and so I want to note that only my remarks"
    },
    {
      "Time_Start": 114.10000000000001,
      "Time_End": 119.04,
      "Text": " um, may be attributed to NAS and each panelist's remarks may be attributed to their"
    },
    {
      "Time_Start": 119.04,
      "Time_End": 124.04,
      "Text": " individual organizations. So very quickly what we're going to talk about is um, background"
    },
    {
      "Time_Start": 126.38,
      "Time_End": 132.02,
      "Text": " and history on demystifying hacking for NAS members and, and those they work with. Um,"
    },
    {
      "Time_Start": 132.04000000000002,
      "Time_End": 138.18,
      "Text": " the idea of Michael Ross here to bring a hacker con to NAS impacts and other efforts of, of"
    },
    {
      "Time_Start": 138.18,
      "Time_End": 142.72,
      "Text": " these efforts, state perspectives and lessons we've learned and then we hope to get the"
    },
    {
      "Time_Start": 142.72,
      "Time_End": 147.66000000000003,
      "Text": " whole room involved in some brainstorming and discussion. I want to very quickly talk"
    },
    {
      "Time_Start": 147.66000000000003,
      "Time_End": 153.76000000000002,
      "Text": " about who NAS is. We are a membership organization representing secretaries of state and"
    },
    {
      "Time_Start": 153.76000000000002,
      "Time_End": 159.56,
      "Text": " in a few cases where there's not a secretary, lieutenant governors across the country. Um,"
    },
    {
      "Time_Start": 159.58,
      "Time_End": 163.88,
      "Text": " secretaries of state, I, I mentioned this this morning, we're, we're not the U.S. State"
    },
    {
      "Time_Start": 163.88,
      "Time_End": 169.36,
      "Text": " Department. We represent the secretaries of state in each individual state who have many"
    },
    {
      "Time_Start": 169.36,
      "Time_End": 175.52,
      "Text": " roles and responsibilities, not just elections as many think uh, is, is that their only"
    },
    {
      "Time_Start": 175.52,
      "Time_End": 181.7,
      "Text": " role. But about 40 members of NAS service their state's chief election official. So that"
    },
    {
      "Time_Start": 181.7,
      "Time_End": 187.18,
      "Text": " means they are legally, it's a legal designation where they oversee election"
    },
    {
      "Time_Start": 187.20000000000002,
      "Time_End": 193.4,
      "Text": " administration in the state. And what exactly it means varies dramatically state by state."
    },
    {
      "Time_Start": 193.4,
      "Time_End": 199.04000000000002,
      "Text": " NAS's role is to serve, to serve as a medium of exchange for the, for the secretary of state"
    },
    {
      "Time_Start": 199.04000000000002,
      "Time_End": 204.74,
      "Text": " offices. We act as a conduit of information sharing between the states and their federal"
    },
    {
      "Time_Start": 204.74,
      "Time_End": 210.68,
      "Text": " government partners, other partners, and even more importantly our, our most important"
    },
    {
      "Time_Start": 210.72,
      "Time_End": 215.72,
      "Text": " role is sharing ideas and information, lessons learned across the states and territories. As"
    },
    {
      "Time_Start": 218.5,
      "Time_End": 223.76000000000002,
      "Text": " I mentioned, secretaries do more than just elections. Um, and we have initiatives in the"
    },
    {
      "Time_Start": 223.76000000000002,
      "Time_End": 229.54000000000002,
      "Text": " major areas of overlap across the secretary of state offices. They all do something a"
    },
    {
      "Time_Start": 229.54000000000002,
      "Time_End": 234.52,
      "Text": " little bit different but these are the areas where they, they tend to have um, similar"
    },
    {
      "Time_Start": 234.52,
      "Time_End": 239.22,
      "Text": " responsibilities across the state and so that's where NAS focuses its attention. Elections"
    },
    {
      "Time_Start": 239.22,
      "Time_End": 244.0,
      "Text": " and voting, cyber security, business services, so that's registering and renewing"
    },
    {
      "Time_Start": 244.0,
      "Time_End": 249.3,
      "Text": " businesses in the state, sometimes providing information and resources to businesses,"
    },
    {
      "Time_Start": 249.3,
      "Time_End": 254.3,
      "Text": " particularly small businesses, state record keeping and archives and more. So, why have we"
    },
    {
      "Time_Start": 257.78,
      "Time_End": 262.78,
      "Text": " been focused on demystifying hacking for, for members as an association? Um, as you all"
    },
    {
      "Time_Start": 263.28000000000003,
      "Time_End": 268.28000000000003,
      "Text": " know, the 2016 elections heightened attention of cyber security in election administration."
    },
    {
      "Time_Start": 271.66,
      "Time_End": 278.36,
      "Text": " Um, previous to 2016, cyber security was a thing that all secretary of state offices were"
    },
    {
      "Time_Start": 278.36,
      "Time_End": 285.06000000000006,
      "Text": " focused on in some way, but that dramatically increased after the 2016 elections when there"
    },
    {
      "Time_Start": 285.06000000000006,
      "Time_End": 290.70000000000005,
      "Text": " was nation state targeting of the internet connected infrastructure that relates to voter"
    },
    {
      "Time_Start": 290.71999999999997,
      "Time_End": 296.53999999999996,
      "Text": " registration. Um, in 2017 elections were designated critical infrastructure by the"
    },
    {
      "Time_Start": 296.53999999999996,
      "Time_End": 302.64,
      "Text": " department of homeland security and that really changed the um, the attention that was"
    },
    {
      "Time_Start": 302.64,
      "Time_End": 308.62,
      "Text": " given to election cyber security by the federal government but also by the public. Um, and"
    },
    {
      "Time_Start": 308.62,
      "Time_End": 315.41999999999996,
      "Text": " that led to increased security research attention on elections and on secretary of state"
    },
    {
      "Time_Start": 315.42,
      "Time_End": 321.58000000000004,
      "Text": " offices, including the launch of the voting village here at DEF CON. Um, we'll get into"
    },
    {
      "Time_Start": 321.58000000000004,
      "Time_End": 327.92,
      "Text": " this a little bit. Let me not get ahead of myself. Um, so, we'll get into this a little bit"
    },
    {
      "Time_Start": 327.92,
      "Time_End": 332.94,
      "Text": " in just a minute, but as many of you all know, the initial relationship between NAS and its"
    },
    {
      "Time_Start": 335.84000000000003,
      "Time_End": 340.68,
      "Text": " members and the election community as a whole and the security research community got off to"
    },
    {
      "Time_Start": 340.68,
      "Time_End": 345.94,
      "Text": " a rocky start. As I know happens, I'm learning here, happens with just about every single"
    },
    {
      "Time_Start": 345.94,
      "Time_End": 352.14,
      "Text": " industry. Um, and so we, we, we began focusing on relationship building and education"
    },
    {
      "Time_Start": 352.14,
      "Time_End": 357.68,
      "Text": " between the election administration community, particularly NAS members and the security"
    },
    {
      "Time_Start": 357.68,
      "Time_End": 363.3,
      "Text": " research community. I started with NAS in 2018 and that was one of the first things I was"
    },
    {
      "Time_Start": 363.3,
      "Time_End": 367.76,
      "Text": " tasked with. And so I just want to provide a little bit of background on the work that we've"
    },
    {
      "Time_Start": 367.78,
      "Time_End": 374.48,
      "Text": " done to bring us up to today. So one of the first things we did is look to, you know, good"
    },
    {
      "Time_Start": 374.48,
      "Time_End": 378.88,
      "Text": " models. Like where, where is there a good positive collaborative relationship? And"
    },
    {
      "Time_Start": 378.88,
      "Time_End": 385.62,
      "Text": " everybody pointed us to medical devices. And so we got in touch with, and the cavalry,"
    },
    {
      "Time_Start": 385.62,
      "Time_End": 391.8,
      "Text": " Bill Woods, and brought him out to NAS. Um, we got connected with Jack and, and several"
    },
    {
      "Time_Start": 391.84000000000003,
      "Time_End": 397.42,
      "Text": " other, um, independent security researchers and, and initially it was an education effort,"
    },
    {
      "Time_Start": 397.42,
      "Time_End": 403.92,
      "Text": " right? Um, we wanted to learn, NAS wanted to learn more about what, who hackers are, what you"
    },
    {
      "Time_Start": 403.92,
      "Time_End": 409.22,
      "Text": " do, what motivates you. And so initially it was an education effort that kind of morphed"
    },
    {
      "Time_Start": 409.22,
      "Time_End": 414.7,
      "Text": " into a focus on networking and relationship building. We started hosting meet and greets"
    },
    {
      "Time_Start": 414.7,
      "Time_End": 420.2,
      "Text": " between the cyber security staff and the secretary's offices and, um, some folks in the"
    },
    {
      "Time_Start": 420.2,
      "Time_End": 425.84,
      "Text": " hacker community. And then that really led us to where we are today, which is, um, you know,"
    },
    {
      "Time_Start": 425.84,
      "Time_End": 433.28,
      "Text": " really bringing hackers to NAS, trying to, um, bring a sample of what is going on here to"
    },
    {
      "Time_Start": 433.28,
      "Time_End": 438.91999999999996,
      "Text": " our conferences. And, and, and that's why we're here today. Because we're, we're really"
    },
    {
      "Time_Start": 438.91999999999996,
      "Time_End": 443.26,
      "Text": " interested in hearing from you all on, you know, good ways to build off of those efforts. I'm"
    },
    {
      "Time_Start": 443.26,
      "Time_End": 447.09999999999997,
      "Text": " going to ask Jack to provide a little bit of perspective on the, on the background and"
    },
    {
      "Time_Start": 447.1,
      "Time_End": 452.38,
      "Text": " history from the hacker side. Thank you, Lindsay. And first of all, thank you everyone for"
    },
    {
      "Time_Start": 452.38,
      "Time_End": 458.62,
      "Text": " coming, um, on 5pm on a Friday night. I know we're the only thing between you and happy"
    },
    {
      "Time_Start": 458.62,
      "Time_End": 464.32000000000005,
      "Text": " hour, so we'll hope to keep this engaging and maybe chat with some of you there. But as"
    },
    {
      "Time_Start": 464.32000000000005,
      "Time_End": 471.26000000000005,
      "Text": " Lindsay alluded to, really, there has been a storied history, uh, between hackers and the"
    },
    {
      "Time_Start": 471.26,
      "Time_End": 477.59999999999997,
      "Text": " elections community. And, uh, happy to say now we've made quite a bit of progress."
    },
    {
      "Time_Start": 477.59999999999997,
      "Time_End": 483.64,
      "Text": " Something we, we couldn't even have said, say, 5 or 6 years ago. Where I, I think especially"
    },
    {
      "Time_Start": 483.64,
      "Time_End": 488.64,
      "Text": " after the 2016 election, there became a recognition of how crucial security research was to,"
    },
    {
      "Time_Start": 492.68,
      "Time_End": 498.92,
      "Text": " um, helping build security into our elections. Um, and something that has, has been"
    },
    {
      "Time_Start": 498.92,
      "Time_End": 503.92,
      "Text": " reflected through the work at NASS, um, through work elsewhere as well. Um, we see it in"
    },
    {
      "Time_Start": 503.92,
      "Time_End": 510.40000000000003,
      "Text": " the, uh, DEF CON community as well. Um, but, um, I, I also saw this myself. Where I come from"
    },
    {
      "Time_Start": 510.40000000000003,
      "Time_End": 515.84,
      "Text": " a background as a security researcher, uh, later ventured into some of the policy world."
    },
    {
      "Time_Start": 515.84,
      "Time_End": 522.08,
      "Text": " Uh, but my foray into elections was when I was 18 and registering to vote for the first"
    },
    {
      "Time_Start": 522.08,
      "Time_End": 527.52,
      "Text": " time in Illinois and came across a pretty serious vulnerability in the Illinois voter"
    },
    {
      "Time_Start": 527.52,
      "Time_End": 531.68,
      "Text": " registration database. Um, as someone who didn't know much about how elections were"
    },
    {
      "Time_Start": 531.68,
      "Time_End": 537.22,
      "Text": " administered in Illinois, uh, took, uh, quite a bit of, uh, discovery to find even someone"
    },
    {
      "Time_Start": 537.22,
      "Time_End": 542.3,
      "Text": " to report that to. Um, and through, uh, the likes of CISA was able to eventually find a"
    },
    {
      "Time_Start": 542.3,
      "Time_End": 547.34,
      "Text": " contact. Eventually was able to get that vulnerability patched. Uh, but through that saw"
    },
    {
      "Time_Start": 547.34,
      "Time_End": 553.14,
      "Text": " really the, both the benefit of collaboration. Once I got in contact with, uh, the Illinois"
    },
    {
      "Time_Start": 553.14,
      "Time_End": 557.34,
      "Text": " Board of Elections, they were very grateful for that. But also the necessity for there to be"
    },
    {
      "Time_Start": 557.34,
      "Time_End": 564.34,
      "Text": " strong pathways between security researchers and election officials to ensure that, um,"
    },
    {
      "Time_Start": 564.34,
      "Time_End": 570.02,
      "Text": " when vulnerabilities were found, um, security researchers were able to make that known."
    },
    {
      "Time_Start": 570.02,
      "Time_End": 574.48,
      "Text": " So, since then, we've had some remarkable progress. We're now up to, by my count, five"
    },
    {
      "Time_Start": 574.48,
      "Time_End": 579.5,
      "Text": " states, um, including Iowa, Ohio, um, uh, North Carolina, Idaho, um, and Minnesota who"
    },
    {
      "Time_Start": 580.26,
      "Time_End": 587.16,
      "Text": " operate vulnerability disclosure programs, allowing security researchers to report"
    },
    {
      "Time_Start": 587.16,
      "Time_End": 593.04,
      "Text": " vulnerabilities, um, they've found in their systems. Um, the majority of major voting"
    },
    {
      "Time_Start": 593.04,
      "Time_End": 598.28,
      "Text": " machine manufacturers also operate vulnerability disclosure programs. Um, so we still have"
    },
    {
      "Time_Start": 598.28,
      "Time_End": 603.98,
      "Text": " progress to be made, uh, but really we are light years ahead of, uh, where we were even a"
    },
    {
      "Time_Start": 604.0,
      "Time_End": 609.64,
      "Text": " few years ago. Um, and I'm excited to see, um, states and election, um, manufacturers like"
    },
    {
      "Time_Start": 609.64,
      "Time_End": 613.54,
      "Text": " really welcoming, uh, security research, um, to, to help secure their systems."
    },
    {
      "Time_Start": 613.54,
      "Time_End": 618.54,
      "Text": " Thank you, Jack. And I, I think we're going to continue to see that number growing here in the"
    },
    {
      "Time_Start": 621.12,
      "Time_End": 626.76,
      "Text": " very near future on states with vulnerability disclosure programs. So, I'm going to, I'm"
    },
    {
      "Time_Start": 626.76,
      "Time_End": 631.4,
      "Text": " going to pass it down to Michael in just a minute, but after Michael's first trip to DEF CON,"
    },
    {
      "Time_Start": 631.42,
      "Time_End": 638.26,
      "Text": " um, Secretary Pate, who, who's here with us was, um, was our president at the time and he"
    },
    {
      "Time_Start": 638.26,
      "Time_End": 644.66,
      "Text": " was hosting our summer conference coming up. Um, it was 2021, so pandemic summer"
    },
    {
      "Time_Start": 644.66,
      "Time_End": 649.26,
      "Text": " conference, already really busy and Michael gives me a call and says, I want to bring DEF"
    },
    {
      "Time_Start": 649.26,
      "Time_End": 654.68,
      "Text": " CON to NAS at the summer conference. And so, um, I'll, I'll let him talk just a little bit"
    },
    {
      "Time_Start": 654.68,
      "Time_End": 656.68,
      "Text": " about why and what we did."
    },
    {
      "Time_Start": 662.02,
      "Time_End": 667.48,
      "Text": " So, I woke up one day and discovered we were part of the, uh, critical infrastructure and I had"
    },
    {
      "Time_Start": 667.48,
      "Time_End": 672.52,
      "Text": " no clue what that meant. I had to Google it and, uh, honestly, the federal government didn't"
    },
    {
      "Time_Start": 672.52,
      "Time_End": 677.3,
      "Text": " know who ran elections. And so, they had to kind of figure that out too. And so, we started"
    },
    {
      "Time_Start": 677.3,
      "Time_End": 683.6999999999999,
      "Text": " off pretty rocky and then I woke up another day and a nine-year-old kid had hacked the"
    },
    {
      "Time_Start": 683.6999999999999,
      "Time_End": 688.5,
      "Text": " secretary of state's computer system and changed the election results in less than three"
    },
    {
      "Time_Start": 688.5,
      "Time_End": 693.24,
      "Text": " minutes. That was a little bit of a surprise. And so, we weren't quite sure that was quite"
    },
    {
      "Time_Start": 693.24,
      "Time_End": 699.52,
      "Text": " accurate. And, uh, so just hearing that, uh, we had the opportunity to, uh, Secretary Pate"
    },
    {
      "Time_Start": 699.52,
      "Time_End": 704.52,
      "Text": " allowed me to come out to DEF CON and it was really kind of, uh, suspiciously and, and, and"
    },
    {
      "Time_Start": 704.52,
      "Time_End": 709.22,
      "Text": " kind of in a guarded way and what the heck is going on and who are these people and what are"
    },
    {
      "Time_Start": 709.22,
      "Time_End": 714.2,
      "Text": " they doing and how did they hack it in less than three minutes? And, and, uh, uh, but what I"
    },
    {
      "Time_Start": 714.2,
      "Time_End": 719.74,
      "Text": " discovered and I came back to Secretary Pate is that, uh, what I thought the white hat hack,"
    },
    {
      "Time_Start": 719.74,
      "Time_End": 726.1400000000001,
      "Text": " what that community was, was not what they were. I found them to be, uh, patriotic, uh, they"
    },
    {
      "Time_Start": 726.1400000000001,
      "Time_End": 730.88,
      "Text": " aren't anarchists. I mean, maybe there's one or two anarchists out there in the crowd, but"
    },
    {
      "Time_Start": 730.88,
      "Time_End": 735.88,
      "Text": " the majority of, of, of you guys were really, uh, uh, elections are important and you guys see"
    },
    {
      "Time_Start": 736.64,
      "Time_End": 741.64,
      "Text": " things differently. And so, we just kind of wanted to go to that next step. You know, we had"
    },
    {
      "Time_Start": 744.78,
      "Time_End": 749.02,
      "Text": " breakfast with Beau or lunch with him to kind of discover a little bit more about you guys."
    },
    {
      "Time_Start": 749.02,
      "Time_End": 754.38,
      "Text": " And as we started to kind of trust that, we started to look at what can we do, uh, because we"
    },
    {
      "Time_Start": 754.38,
      "Time_End": 761.0,
      "Text": " have both cyber security, you know, which is, you know, the critical part, but we also have to"
    },
    {
      "Time_Start": 761.02,
      "Time_End": 766.92,
      "Text": " reassure the public, uh, that elections are secure and that, you know, is also a critical"
    },
    {
      "Time_Start": 766.92,
      "Time_End": 772.86,
      "Text": " piece. And I think that the, uh, uh, white hat hacker community, uh, plays a part and helps us,"
    },
    {
      "Time_Start": 772.86,
      "Time_End": 777.88,
      "Text": " uh, do both of those things. So, based on Michael's idea, we created an, an event at NAS that"
    },
    {
      "Time_Start": 783.98,
      "Time_End": 789.28,
      "Text": " we now call Hacking Demystified. Um, and, and I called up, as soon as Michael came to me with"
    },
    {
      "Time_Start": 789.3,
      "Time_End": 794.1,
      "Text": " that, that idea, we got on the phone with Jack, with Beau, with a couple of others who are"
    },
    {
      "Time_Start": 794.1,
      "Time_End": 800.0,
      "Text": " organizers here at DEF CON. And, um, we're like, you know, Iowa wants to bring, bring a hack,"
    },
    {
      "Time_Start": 800.0,
      "Time_End": 805.14,
      "Text": " hacker con to NAS. What do you think we should do? Um, you know, recognizing that most"
    },
    {
      "Time_Start": 805.14,
      "Time_End": 810.48,
      "Text": " secretary of state offices didn't have representation at DEF CON. Folks had never been here."
    },
    {
      "Time_Start": 810.48,
      "Time_End": 815.06,
      "Text": " And, um, their idea was like, let's start with some of the fun stuff. Let's start with some of"
    },
    {
      "Time_Start": 815.0600000000001,
      "Time_End": 820.6800000000001,
      "Text": " the low hanging fruit, like less intimidating things. And so we brought a mini lock picking"
    },
    {
      "Time_Start": 820.6800000000001,
      "Time_End": 825.6800000000001,
      "Text": " village, soldering village, we had IOT hacking village, we had, um, just, just opportunities"
    },
    {
      "Time_Start": 828.48,
      "Time_End": 833.98,
      "Text": " for NAS members, their staff, and the folks we work with to get a taste of what goes on here."
    },
    {
      "Time_Start": 833.98,
      "Time_End": 839.0000000000001,
      "Text": " And you can see, um, some of, some of the fun activities that happened at our first event in"
    },
    {
      "Time_Start": 839.0,
      "Time_End": 845.98,
      "Text": " Iowa up here on the screen. And then, you know, we got a lot of good feedback. We got a lot"
    },
    {
      "Time_Start": 845.98,
      "Time_End": 850.72,
      "Text": " of constructive feedback. We learned, um, a lot from that event and decided we wanted to build"
    },
    {
      "Time_Start": 850.72,
      "Time_End": 857.22,
      "Text": " on the success and, and up next was hacking demystified 2.0. But I want to, um, ask Jason"
    },
    {
      "Time_Start": 857.22,
      "Time_End": 862.1,
      "Text": " next. So Jason is, Jason's company is a corporate affiliate of NAS and they have been"
    },
    {
      "Time_Start": 862.1,
      "Time_End": 867.84,
      "Text": " incredibly supportive both financially but even more importantly, um, operationally with"
    },
    {
      "Time_Start": 867.84,
      "Time_End": 874.48,
      "Text": " running these events. They, they've, um, lended so much volunteer staff support to making"
    },
    {
      "Time_Start": 874.48,
      "Time_End": 878.1800000000001,
      "Text": " this happen. And so I just want him to talk a little bit about the importance of these"
    },
    {
      "Time_Start": 878.1800000000001,
      "Time_End": 882.82,
      "Text": " events and why you've been so supportive. Sure, thanks Lindsey. And thank y'all for being"
    },
    {
      "Time_Start": 882.82,
      "Time_End": 889.2,
      "Text": " here. Um, so we got involved, uh, in NAS as a sponsor and we're going to Iowa for the"
    },
    {
      "Time_Start": 889.2,
      "Time_End": 893.96,
      "Text": " conference and we lost, there's a hacker conference going on during NAS. We gotta get, we"
    },
    {
      "Time_Start": 893.96,
      "Time_End": 899.1,
      "Text": " gotta be part of that. So, um, so we have to be part of it and we're, and then, you know,"
    },
    {
      "Time_Start": 899.1,
      "Time_End": 904.36,
      "Text": " we're thinking, well, what do we do about, uh, next year when we go to Baton Rouge?"
    },
    {
      "Time_Start": 904.36,
      "Time_End": 909.24,
      "Text": " Because, uh, we're a Louisiana based cyber security services company. And so, uh, we"
    },
    {
      "Time_Start": 909.24,
      "Time_End": 913.3000000000001,
      "Text": " thought about, we do a lot of breach response and we thought, hm, might be helpful to do, uh,"
    },
    {
      "Time_Start": 913.3000000000001,
      "Time_End": 917.38,
      "Text": " something about ransomware because, you know, people hear about it in the news and, um, you"
    },
    {
      "Time_Start": 917.38,
      "Time_End": 921.82,
      "Text": " know, I, I kind of think of it as like the digital equivalent of an AK-47. You can do a lot"
    },
    {
      "Time_Start": 921.82,
      "Time_End": 928.62,
      "Text": " with it. Um, so we wanted to make sure that people understood the basics around how that"
    },
    {
      "Time_Start": 928.62,
      "Time_End": 933.62,
      "Text": " happens and what happens after everything gets locked down, et cetera. And, um, we were"
    },
    {
      "Time_Start": 933.62,
      "Time_End": 939.5,
      "Text": " able to think through and produce kind of this, um, you know, the narrative with"
    },
    {
      "Time_Start": 939.5,
      "Time_End": 943.84,
      "Text": " everybody's help. Uh, we were able to put it together, but more important than that narrative"
    },
    {
      "Time_Start": 943.84,
      "Time_End": 949.94,
      "Text": " for us was the opportunity to get universities involved, uh, and, and to get like students"
    },
    {
      "Time_Start": 949.96,
      "Time_End": 955.0600000000001,
      "Text": " who were in cyber majors to come in and participate. That again, you know, was something"
    },
    {
      "Time_Start": 955.0600000000001,
      "Time_End": 961.1,
      "Text": " that we picked up in Iowa, uh, with the universities contributing, uh, labor and support in"
    },
    {
      "Time_Start": 961.1,
      "Time_End": 965.8800000000001,
      "Text": " Iowa. We were able to do that with some of the schools in Louisiana. Um, and what I saw"
    },
    {
      "Time_Start": 965.8800000000001,
      "Time_End": 970.8800000000001,
      "Text": " there was kind of this wonderful combination of government, academia, um, industry and, and,"
    },
    {
      "Time_Start": 973.8800000000001,
      "Time_End": 978.9200000000001,
      "Text": " and interested parties. And, um, it was a really positive experience for everybody. Um,"
    },
    {
      "Time_Start": 978.94,
      "Time_End": 983.1400000000001,
      "Text": " folks got to make, you know, connections and discuss things, uh, where there probably"
    },
    {
      "Time_Start": 983.1400000000001,
      "Time_End": 988.2800000000001,
      "Text": " wasn't a lot of overlap before. Um, they realized where that might lie afterwards and, and"
    },
    {
      "Time_Start": 988.2800000000001,
      "Time_End": 992.48,
      "Text": " how they might be able to connect and start discussing ways to help protect, you know,"
    },
    {
      "Time_Start": 992.48,
      "Time_End": 997.82,
      "Text": " this critical infrastructure that, that underlies democracy. And Brad's office, the"
    },
    {
      "Time_Start": 997.82,
      "Time_End": 1003.22,
      "Text": " Louisiana secretary of state's office was again, I think president and host of this"
    },
    {
      "Time_Start": 1003.22,
      "Time_End": 1007.0600000000001,
      "Text": " conference, NAS president and host of this conference. And so Brad was one of the key"
    },
    {
      "Time_Start": 1007.1,
      "Time_End": 1013.1800000000001,
      "Text": " planners. Anything you want to add about the event in Louisiana? So Jason kind of stole a lot"
    },
    {
      "Time_Start": 1013.1800000000001,
      "Time_End": 1018.82,
      "Text": " of my thunder there, but you're good. So anyways, and when they brought it to us and the"
    },
    {
      "Time_Start": 1018.82,
      "Time_End": 1024.72,
      "Text": " topic became ransomware, it fit very well with where we were. Uh, cause in 2019,"
    },
    {
      "Time_Start": 1024.72,
      "Time_End": 1029.6000000000001,
      "Text": " Louisiana was, uh, was struck with ransomware statewide, uh, pretty heavily during the"
    },
    {
      "Time_Start": 1029.6000000000001,
      "Time_End": 1033.5,
      "Text": " school, uh, their school board. And it all occurred right around an election, which"
    },
    {
      "Time_Start": 1033.5,
      "Time_End": 1041.24,
      "Text": " created a, uh, a narrative that, uh, was, was false. So we wanted to take and"
    },
    {
      "Time_Start": 1041.24,
      "Time_End": 1046.78,
      "Text": " demystify, uh, it, it worked perfectly, uh, demystify the, the thought process"
    },
    {
      "Time_Start": 1046.78,
      "Time_End": 1052.52,
      "Text": " behind ransomware and understanding that, uh, that there is a, a, uh, structured"
    },
    {
      "Time_Start": 1052.52,
      "Time_End": 1059.0,
      "Text": " response to any type of incident. Um, and then also bring in, like Jason had stated,"
    },
    {
      "Time_Start": 1059.04,
      "Time_End": 1066.5,
      "Text": " bring in the, uh, education, uh, portion, uh, bring in volunteers all over the place,"
    },
    {
      "Time_Start": 1066.5,
      "Time_End": 1071.64,
      "Text": " security researchers, and just keeping that, that, uh, line of communication open, uh, is, is"
    },
    {
      "Time_Start": 1071.64,
      "Time_End": 1075.24,
      "Text": " really what we were trying to push forward. And I think it was a complete success."
    },
    {
      "Time_Start": 1075.24,
      "Time_End": 1079.98,
      "Text": " Agreed. And I, I do think Louisiana is the most collaborative event we've had where we"
    },
    {
      "Time_Start": 1079.98,
      "Time_End": 1087.06,
      "Text": " had, you know, we had several hackers there. We had, uh, aspiring hackers. We had a lot, a"
    },
    {
      "Time_Start": 1087.28,
      "Time_End": 1092.6,
      "Text": " lot of different folks involved in that one. And in this scenario, we did introduce, uh, a"
    },
    {
      "Time_Start": 1092.6,
      "Time_End": 1097.5,
      "Text": " vulnerability report from a security researcher so that folks would have the opportunity to"
    },
    {
      "Time_Start": 1097.5,
      "Time_End": 1102.1399999999999,
      "Text": " understand kind of how that would be handled if you have a vulnerability disclosure policy"
    },
    {
      "Time_Start": 1102.1399999999999,
      "Time_End": 1106.44,
      "Text": " versus if you don't. Jack, do you want to talk a little bit about that? Yep. So it really"
    },
    {
      "Time_Start": 1106.44,
      "Time_End": 1111.94,
      "Text": " had two main goals with the event. The first, as Lindsay mentioned, was to put attendees"
    },
    {
      "Time_Start": 1111.94,
      "Time_End": 1115.9199999999998,
      "Text": " in the shoes of hackers. Um, and I imagine many people in this room have been in this"
    },
    {
      "Time_Start": 1115.94,
      "Time_End": 1120.3200000000002,
      "Text": " scenario where you find vulnerability, it's really serious, and you know it needs to get"
    },
    {
      "Time_Start": 1120.3200000000002,
      "Time_End": 1125.1200000000001,
      "Text": " into the right hand so it can be fixed. Um, and how challenging it can be without having a"
    },
    {
      "Time_Start": 1125.1200000000001,
      "Time_End": 1130.5,
      "Text": " defined point of contact, not knowing who to disclose it to. Um, because every day that this"
    },
    {
      "Time_Start": 1130.5,
      "Time_End": 1135.0,
      "Text": " is out, there is another chance that can be exploited. Uh, so putting participants in the"
    },
    {
      "Time_Start": 1135.0,
      "Time_End": 1139.8000000000002,
      "Text": " shoes of security researchers to understand the value of, say, having a vulnerability"
    },
    {
      "Time_Start": 1139.8000000000002,
      "Time_End": 1144.38,
      "Text": " disclosure policy, being able to have a channel where you can report it, being able to have a"
    },
    {
      "Time_Start": 1144.44,
      "Time_End": 1149.5,
      "Text": " legal safe harbor that, um, assures you that no legal action will be taken for good faith"
    },
    {
      "Time_Start": 1149.5,
      "Time_End": 1155.18,
      "Text": " reporting of a security vulnerability, um, I think really, uh, was crucial to kind of"
    },
    {
      "Time_Start": 1155.18,
      "Time_End": 1160.18,
      "Text": " helping attendees understand the importance of that. Um, and then the second part was to"
    },
    {
      "Time_Start": 1160.18,
      "Time_End": 1166.66,
      "Text": " really show that a lot of these vulnerabilities aren't these kind of crazy complicated"
    },
    {
      "Time_Start": 1166.66,
      "Time_End": 1172.24,
      "Text": " attacks that, um, only kind of top experts can understand, but the truth is the vast"
    },
    {
      "Time_Start": 1172.26,
      "Time_End": 1177.36,
      "Text": " majority of vulnerabilities attacks are quite simple, uh, leverage on sorts of"
    },
    {
      "Time_Start": 1177.36,
      "Time_End": 1183.5,
      "Text": " vulnerabilities that, um, are repeated all over the place. Um, so being able to demonstrate"
    },
    {
      "Time_Start": 1183.5,
      "Time_End": 1190.08,
      "Text": " that and kind of in combination with the fact that applying a few relatively simple defenses"
    },
    {
      "Time_Start": 1190.08,
      "Time_End": 1196.52,
      "Text": " can help, um, block off entire paths of attacks, um, we we hoped would be able to kind of"
    },
    {
      "Time_Start": 1196.52,
      "Time_End": 1201.52,
      "Text": " help paint the picture that security isn't some insurmountable thing, but rather, uh, by"
    },
    {
      "Time_Start": 1201.54,
      "Time_End": 1206.8799999999999,
      "Text": " taking some pretty basic steps can, um, eliminate, especially with ransomware, which is,"
    },
    {
      "Time_Start": 1206.8799999999999,
      "Time_End": 1211.42,
      "Text": " uh, financially motivated targets that the most simple vulnerabilities, um, can can"
    },
    {
      "Time_Start": 1211.42,
      "Time_End": 1217.98,
      "Text": " prevent a lot of that. Thanks Jack. And yeah, yeah, while while many secretary of state"
    },
    {
      "Time_Start": 1217.98,
      "Time_End": 1222.02,
      "Text": " offices developing vulnerability disclosure programs and getting to that level of"
    },
    {
      "Time_Start": 1222.02,
      "Time_End": 1226.46,
      "Text": " maturity is a positive thing, we also wanted to show, like, even if you don't have that and"
    },
    {
      "Time_Start": 1226.46,
      "Time_End": 1230.74,
      "Text": " you get a vulnerability report, it doesn't mean panic, right? These are some of the ways"
    },
    {
      "Time_Start": 1230.76,
      "Time_End": 1234.52,
      "Text": " that you can work through this and, um, Jack did a great job working with the states on"
    },
    {
      "Time_Start": 1234.52,
      "Time_End": 1239.06,
      "Text": " that. Um, we also, after the success of this event, really saw a lot of interest from"
    },
    {
      "Time_Start": 1239.06,
      "Time_End": 1243.44,
      "Text": " others, um, the National Conference of State Legislatures, for example, reached out to us"
    },
    {
      "Time_Start": 1243.44,
      "Time_End": 1248.4,
      "Text": " and NAS sat down with them and, um, helped them plan, you know, get started on the planning"
    },
    {
      "Time_Start": 1248.4,
      "Time_End": 1253.2,
      "Text": " of an event like this. We've seen states take the idea and run with it and so it it really"
    },
    {
      "Time_Start": 1253.2,
      "Time_End": 1259.24,
      "Text": " is evangelizing a bit. Um, and so our lot, our most recent hacking demystified event was"
    },
    {
      "Time_Start": 1259.24,
      "Time_End": 1265.54,
      "Text": " at this last summer conference. We were in Washington D.C. and as we, um, were planning"
    },
    {
      "Time_Start": 1265.54,
      "Time_End": 1272.46,
      "Text": " hacking demystified 3.0 and trying to pick a theme, one thing that we could not ignore was"
    },
    {
      "Time_Start": 1272.46,
      "Time_End": 1277.76,
      "Text": " that we had many new secretaries of state. Um, and some of those folks were new to the"
    },
    {
      "Time_Start": 1277.76,
      "Time_End": 1283.6,
      "Text": " elections community, um, and their staff as well. So we we didn't want to, you know, get"
    },
    {
      "Time_Start": 1283.6,
      "Time_End": 1288.9,
      "Text": " into a more complicated topic. We kind of wanted to go back to basics and and we chose"
    },
    {
      "Time_Start": 1288.9,
      "Time_End": 1293.46,
      "Text": " behind the breach for this topic and Jason really helped kind of lay out the strategy for"
    },
    {
      "Time_Start": 1293.46,
      "Time_End": 1298.44,
      "Text": " this so I want to turn it over to him to talk about it. Yeah, so, um, you know, we were we"
    },
    {
      "Time_Start": 1298.44,
      "Time_End": 1304.0800000000002,
      "Text": " were trying to really tell a story about, okay, um, you hear about data breaches, um, let's"
    },
    {
      "Time_Start": 1304.0800000000002,
      "Time_End": 1308.2800000000002,
      "Text": " let's talk about the various different ways that they can happen. Let's talk about the kind"
    },
    {
      "Time_Start": 1308.2800000000002,
      "Time_End": 1314.7800000000002,
      "Text": " of impacts that they have. Let's talk about how people can identify ways to respond, how"
    },
    {
      "Time_Start": 1314.78,
      "Time_End": 1321.68,
      "Text": " to reach out for help, and educate, uh, essentially, uh, folks on, you know, the the risks of"
    },
    {
      "Time_Start": 1321.68,
      "Time_End": 1327.3799999999999,
      "Text": " of a data breach happening and then what to do about it. We had scenarios where, you know,"
    },
    {
      "Time_Start": 1327.3799999999999,
      "Time_End": 1333.16,
      "Text": " we had, um, we we of course, you know, because LLM AI is the new flavor of the month thing"
    },
    {
      "Time_Start": 1333.16,
      "Time_End": 1337.06,
      "Text": " that everybody wants to talk about, um, we uh we had to talk about a scenario that involved"
    },
    {
      "Time_Start": 1337.06,
      "Time_End": 1342.54,
      "Text": " that and, um, we also had other examples, uh, of, you know, email phishing and just your"
    },
    {
      "Time_Start": 1342.56,
      "Time_End": 1347.56,
      "Text": " typical types of of, you know, entry vectors for bad guys to to get in and and wreck havoc. Um,"
    },
    {
      "Time_Start": 1350.36,
      "Time_End": 1357.34,
      "Text": " and and just being able to, again, have government, academia, industry, and other interested"
    },
    {
      "Time_Start": 1357.34,
      "Time_End": 1363.28,
      "Text": " parties participate in various scenario parts, uh, was very helpful. I mean, I I thought"
    },
    {
      "Time_Start": 1363.28,
      "Time_End": 1368.28,
      "Text": " that, um, people got a lot out of it and they were able to, this time, I guess the thing"
    },
    {
      "Time_Start": 1368.32,
      "Time_End": 1373.06,
      "Text": " that I would say was a little different was we had folks moving between stations almost"
    },
    {
      "Time_Start": 1373.06,
      "Time_End": 1377.26,
      "Text": " like a spoke and hub system. So, you know, they'd go to the station, they'd go back to, like,"
    },
    {
      "Time_Start": 1377.26,
      "Time_End": 1382.04,
      "Text": " center base, they'd talk about what they what they heard or what they saw, and then, you know,"
    },
    {
      "Time_Start": 1382.04,
      "Time_End": 1386.24,
      "Text": " that would lead them to the next section. And so, you know, whereas, like, hacking"
    },
    {
      "Time_Start": 1386.24,
      "Time_End": 1391.24,
      "Text": " demystified 2 was more of a serialized thing where people went through these stations, um,"
    },
    {
      "Time_Start": 1391.24,
      "Time_End": 1396.62,
      "Text": " 3 was more of a hub and spoke type thing. Um, you know, I think that, um, people probably"
    },
    {
      "Time_Start": 1396.6200000000001,
      "Time_End": 1401.46,
      "Text": " got more out of that because they were able to, um, you know, essentially pick your own"
    },
    {
      "Time_Start": 1401.46,
      "Time_End": 1407.0600000000002,
      "Text": " adventure, but it was somewhat controlled in the sense that, um, you you were able to get"
    },
    {
      "Time_Start": 1407.0600000000002,
      "Time_End": 1412.5000000000002,
      "Text": " some information, part of the scenarios, go back, discuss that, put the whole picture"
    },
    {
      "Time_Start": 1412.5000000000002,
      "Time_End": 1417.68,
      "Text": " together, and then kind of add to that over the course of it. Thanks Jason. Yeah, this one"
    },
    {
      "Time_Start": 1417.68,
      "Time_End": 1422.2800000000002,
      "Text": " this one was a lot of fun, um, in terms of the activities and we we had a lot of secretaries"
    },
    {
      "Time_Start": 1422.28,
      "Time_End": 1426.72,
      "Text": " involved. We had a spear fishing competition, which was, uh, the competition was fierce."
    },
    {
      "Time_Start": 1426.72,
      "Time_End": 1432.46,
      "Text": " Actually, Brad down here was one of our winners, um, one of our master spear fishers. Uh,"
    },
    {
      "Time_Start": 1432.46,
      "Time_End": 1436.6,
      "Text": " okay, so I want to move along so we can open up the room. So really quickly, I'm going to ask"
    },
    {
      "Time_Start": 1436.6,
      "Time_End": 1442.1,
      "Text": " states to talk about just kind of in this light, some of the things that you've taken and"
    },
    {
      "Time_Start": 1442.1,
      "Time_End": 1447.1,
      "Text": " run with either, um, either leading into this or, um, or as a result of some of these"
    },
    {
      "Time_Start": 1447.6000000000001,
      "Time_End": 1454.6000000000001,
      "Text": " collaborative activities. So I'm going to turn it down to Louisiana first and, um, just to"
    },
    {
      "Time_Start": 1454.6000000000001,
      "Time_End": 1460.2800000000002,
      "Text": " talk a little bit about your collaborative approach to resilience in, um, in Louisiana."
    },
    {
      "Time_Start": 1460.2800000000002,
      "Time_End": 1466.1200000000001,
      "Text": " Alright, so this event, uh, basically has opened up doors for, uh, community continued"
    },
    {
      "Time_Start": 1466.1200000000001,
      "Time_End": 1472.92,
      "Text": " communication, uh, whether it be with, uh, with third party vendors or, um, educators or"
    },
    {
      "Time_Start": 1472.94,
      "Time_End": 1478.8200000000002,
      "Text": " researchers, it's opened that door for us to have that conversation. Um, it's allowed us to"
    },
    {
      "Time_Start": 1478.8200000000002,
      "Time_End": 1485.52,
      "Text": " realize the, uh, the need for having internal security as well as, uh, someone else looking"
    },
    {
      "Time_Start": 1485.52,
      "Time_End": 1490.54,
      "Text": " out a 24 seven sock. Um, it's opened up conversations for, for even, even within NAS on"
    },
    {
      "Time_Start": 1493.76,
      "Time_End": 1500.0800000000002,
      "Text": " other states, uh, that that's been a huge effort, uh, for us to be able to call on another"
    },
    {
      "Time_Start": 1500.1,
      "Time_End": 1505.4399999999998,
      "Text": " state to say, hey, are you seeing something like this? Uh, what are you reacting, uh, to right"
    },
    {
      "Time_Start": 1505.4399999999998,
      "Time_End": 1512.04,
      "Text": " now? Maybe I'm seeing the same thing. Uh, it, it's, it's been great on, on that effort, uh, as"
    },
    {
      "Time_Start": 1512.04,
      "Time_End": 1517.08,
      "Text": " far as opening up doors is the biggest thing for us. Awesome. And then Iowa has been one of"
    },
    {
      "Time_Start": 1517.08,
      "Time_End": 1521.9199999999998,
      "Text": " the states that's really led the way in the NAS community at embracing security research."
    },
    {
      "Time_Start": 1521.9199999999998,
      "Time_End": 1526.9199999999998,
      "Text": " And so will you just talk briefly about that? So we've been encouraging other states to"
    },
    {
      "Time_Start": 1530.1399999999999,
      "Time_End": 1533.06,
      "Text": " do that. We've been encouraging the secretary of state, but also even within the state of Iowa,"
    },
    {
      "Time_Start": 1533.06,
      "Time_End": 1538.06,
      "Text": " other agencies to, to put together vulnerability disclosure policy, to invite researchers to come"
    },
    {
      "Time_Start": 1540.6,
      "Time_End": 1545.78,
      "Text": " and to look for vulnerabilities. I think two reasons why I think that's important. Uh, number"
    },
    {
      "Time_Start": 1545.78,
      "Time_End": 1550.78,
      "Text": " one, we've had the feds come in and do a pen test and we had the Iowa guard come in and do a pen"
    },
    {
      "Time_Start": 1550.78,
      "Time_End": 1555.4199999999998,
      "Text": " test. And then we had private company come in to do a pen test and then we opened it up to"
    },
    {
      "Time_Start": 1555.42,
      "Time_End": 1561.2,
      "Text": " researchers and you guys find vulnerabilities. I'm scratching my head. How come you guys find"
    },
    {
      "Time_Start": 1561.2,
      "Time_End": 1565.1000000000001,
      "Text": " things? I think you guys are, you're wired different. You see things differently. You're"
    },
    {
      "Time_Start": 1565.1000000000001,
      "Time_End": 1569.64,
      "Text": " puzzlers. You, you, you know, have different perspectives. And I think that's, that's"
    },
    {
      "Time_Start": 1569.64,
      "Time_End": 1574.78,
      "Text": " important. And then second, we want to reassure the public because if I'm government and I say"
    },
    {
      "Time_Start": 1574.78,
      "Time_End": 1579.52,
      "Text": " government says we're good, some of you are going to say, Oh yeah, government says we're good."
    },
    {
      "Time_Start": 1579.52,
      "Time_End": 1584.42,
      "Text": " Yeah, right. It's you guys. And I think the, uh, for us to be able to say, but we're also"
    },
    {
      "Time_Start": 1584.42,
      "Time_End": 1591.8600000000001,
      "Text": " inviting white hat hackers, researchers to come in, I think also helps to reassure, uh, some"
    },
    {
      "Time_Start": 1591.8600000000001,
      "Time_End": 1598.14,
      "Text": " people that yes, not only as government, not only is, you know, are these, uh, um, military and"
    },
    {
      "Time_Start": 1598.14,
      "Time_End": 1603.0800000000002,
      "Text": " those folks helping out, but also researchers are. And so we just went with the bug bounty"
    },
    {
      "Time_Start": 1603.0800000000002,
      "Time_End": 1608.18,
      "Text": " program. It's the, uh, I think the first secretary of state, but the first agency in Iowa, uh,"
    },
    {
      "Time_Start": 1608.18,
      "Time_End": 1612.88,
      "Text": " we've had positive results. There's been a couple of things that, that they found that was"
    },
    {
      "Time_Start": 1612.94,
      "Time_End": 1618.22,
      "Text": " out of scope. Uh, so it didn't affect us, but they were some fairly major ones for some other"
    },
    {
      "Time_Start": 1618.22,
      "Time_End": 1623.42,
      "Text": " agencies. So we passed it on to them and also encouraged them to do a bug bounty program. Um,"
    },
    {
      "Time_Start": 1623.42,
      "Time_End": 1629.5200000000002,
      "Text": " and I think one of the areas that we're probably looking at next is about half of the counties"
    },
    {
      "Time_Start": 1629.5200000000002,
      "Time_End": 1637.5400000000002,
      "Text": " in Iowa don't have an IT and, uh, or, um, the janitor's kid is the IT director. It's probably"
    },
    {
      "Time_Start": 1637.54,
      "Time_End": 1644.24,
      "Text": " does a really good job. And so part of our challenge is how can we help those counties"
    },
    {
      "Time_Start": 1644.24,
      "Time_End": 1650.68,
      "Text": " without an IT infrastructure? And I don't know how we involve or work with, with your"
    },
    {
      "Time_Start": 1650.68,
      "Time_End": 1655.42,
      "Text": " community, but I think that might be part of the solution, you know, down, down the road, you"
    },
    {
      "Time_Start": 1655.42,
      "Time_End": 1661.06,
      "Text": " know, how to do that. We are doing another bug bounty with three counties, uh, and the results"
    },
    {
      "Time_Start": 1661.06,
      "Time_End": 1666.26,
      "Text": " are going to go to all the County IT directors. And we're, our suggestions, if three counties"
    },
    {
      "Time_Start": 1666.28,
      "Time_End": 1670.78,
      "Text": " get the same vulnerability, you probably should do something immediately. And, uh, but again, I"
    },
    {
      "Time_Start": 1670.78,
      "Time_End": 1676.22,
      "Text": " see that challenge in the future. How do we, uh, maybe work with you to figure out how do we"
    },
    {
      "Time_Start": 1676.22,
      "Time_End": 1682.46,
      "Text": " assist those counties? We have some counties, 5,000 people, more deer than there are people in"
    },
    {
      "Time_Start": 1682.46,
      "Time_End": 1689.6,
      "Text": " the County. And so they don't have, you know, a hundred, 200, $300,000 budget for IT. Uh, and,"
    },
    {
      "Time_Start": 1689.6,
      "Time_End": 1693.64,
      "Text": " and so I think we need to kind of figure out how do we work with you and with others to, to"
    },
    {
      "Time_Start": 1693.76,
      "Time_End": 1694.66,
      "Text": " assist them in that."
    },
    {
      "Time_Start": 1694.66,
      "Time_End": 1699.66,
      "Text": " Okay. Um, I, I know everyone is, is ready to get the party started. So I, I'm going to quickly"
    },
    {
      "Time_Start": 1706.24,
      "Time_End": 1710.64,
      "Text": " go through this part and then we'll open the room up. Um, so lessons learned and, and"
    },
    {
      "Time_Start": 1710.64,
      "Time_End": 1717.5800000000002,
      "Text": " recommendations, uh, for folks in the room. Um, coordinate directly with the, the folks who"
    },
    {
      "Time_Start": 1717.62,
      "Time_End": 1724.3,
      "Text": " are implementing and overseeing systems, right? I, I think that, um, it, it's not always easy"
    },
    {
      "Time_Start": 1724.3,
      "Time_End": 1729.5,
      "Text": " and you don't always know where to go, but I encourage you if you're, if you're looking to"
    },
    {
      "Time_Start": 1729.5,
      "Time_End": 1736.24,
      "Text": " support government with your security research, try at least to coordinate directly. Um, I"
    },
    {
      "Time_Start": 1736.24,
      "Time_End": 1741.34,
      "Text": " think that both sides will find it a more productive relationship. On that note, it's really"
    },
    {
      "Time_Start": 1741.34,
      "Time_End": 1746.1799999999998,
      "Text": " important to meet each other where we are. I think that, you know, when, when we say that"
    },
    {
      "Time_Start": 1746.18,
      "Time_End": 1750.98,
      "Text": " the relationship between, you know, policy makers broadly and the security research"
    },
    {
      "Time_Start": 1750.98,
      "Time_End": 1754.72,
      "Text": " community or the election administration and the security research community got off to a"
    },
    {
      "Time_Start": 1754.72,
      "Time_End": 1759.3600000000001,
      "Text": " rocky start, there were just a lot of misunderstandings on either side and not"
    },
    {
      "Time_Start": 1759.3600000000001,
      "Time_End": 1764.1000000000001,
      "Text": " understanding each other's role. And, um, you know, it's really important to meet each other"
    },
    {
      "Time_Start": 1764.1000000000001,
      "Time_End": 1768.44,
      "Text": " where we are and, and have conversations and get to know each other and respect each"
    },
    {
      "Time_Start": 1768.44,
      "Time_End": 1773.24,
      "Text": " other's expertise and be willing to learn something from each other. Um, and then of"
    },
    {
      "Time_Start": 1773.24,
      "Time_End": 1777.64,
      "Text": " course you're, some of you are probably thinking, like, I don't think hackers in the election"
    },
    {
      "Time_Start": 1777.64,
      "Time_End": 1782.24,
      "Text": " community have a perfect relationship. No, that's not the case, right? Collaboration does"
    },
    {
      "Time_Start": 1782.24,
      "Time_End": 1787.98,
      "Text": " not eliminate disagreement. We are still going to make each other nervous, right? But, um, it"
    },
    {
      "Time_Start": 1787.98,
      "Time_End": 1794.26,
      "Text": " does increase the value of the work that you're doing. And, and so at this point we're"
    },
    {
      "Time_Start": 1794.26,
      "Time_End": 1798.36,
      "Text": " going to open it up and we'll, we can go down the line again if, if we don't get a lot of"
    },
    {
      "Time_Start": 1798.3600000000001,
      "Time_End": 1804.1200000000001,
      "Text": " questions. But, um, I do want to note, we didn't, this wasn't our focus today, but"
    },
    {
      "Time_Start": 1804.1200000000001,
      "Time_End": 1810.96,
      "Text": " demystifying goes both ways, right? Just like, um, policy makers or policy implementers"
    },
    {
      "Time_Start": 1810.96,
      "Time_End": 1815.96,
      "Text": " or election administrators don't understand exactly the work that you do, um, you all don't"
    },
    {
      "Time_Start": 1818.38,
      "Time_End": 1824.8200000000002,
      "Text": " exactly understand the nuance of the work that we do, right? And so, um, try to understand."
    },
    {
      "Time_Start": 1824.84,
      "Time_End": 1830.84,
      "Text": " Reach out to the people who can, um, give you that trusted information, who can break it"
    },
    {
      "Time_Start": 1830.84,
      "Time_End": 1836.78,
      "Text": " down for you, explain it to you. Um, NASA's always available to connect folks with their"
    },
    {
      "Time_Start": 1836.78,
      "Time_End": 1841.62,
      "Text": " own mem- with their own secretaries of state. We're always there to give the, like, national"
    },
    {
      "Time_Start": 1841.62,
      "Time_End": 1846.62,
      "Text": " one on, 101 on, um, how elections are run in the US and what a secretary of state is. So, um,"
    },
    {
      "Time_Start": 1846.7600000000002,
      "Time_End": 1852.7600000000002,
      "Text": " please be open to having the work of government demystified for you, just like we're very"
    },
    {
      "Time_Start": 1856.0000000000002,
      "Time_End": 1861.8400000000001,
      "Text": " open to having it demyst- having your work demystified for us. Um, and with that, I just, I"
    },
    {
      "Time_Start": 1861.8400000000001,
      "Time_End": 1866.94,
      "Text": " want to open it up. First, we, we can take questions, but I also put, um, some prompts up"
    },
    {
      "Time_Start": 1866.94,
      "Time_End": 1872.1200000000001,
      "Text": " here where, you know, we, we want to have a bit of a conversation. So some things we want"
    },
    {
      "Time_Start": 1872.1200000000001,
      "Time_End": 1878.16,
      "Text": " to think about are, um, you know, what are, like, remaining misconceptions you think that,"
    },
    {
      "Time_Start": 1878.16,
      "Time_End": 1883.8000000000002,
      "Text": " um, we have about your work and, you know, what's the most important thing that you wish"
    },
    {
      "Time_Start": 1883.8000000000002,
      "Time_End": 1889.0800000000002,
      "Text": " government officials knew about what you did? Um, or if you're a government official who"
    },
    {
      "Time_Start": 1889.0800000000002,
      "Time_End": 1894.0800000000002,
      "Text": " wants to add, kind of, to the conversation here. So, um, how do we continue to improve"
    },
    {
      "Time_Start": 1894.0800000000002,
      "Time_End": 1899.48,
      "Text": " collaboration? From the NAS perspective specifically, we've done these three events, we've"
    },
    {
      "Time_Start": 1899.48,
      "Time_End": 1903.88,
      "Text": " done a lot of networking, we'll continue to do work, but, kind of, what's the next step in"
    },
    {
      "Time_Start": 1903.88,
      "Time_End": 1909.9,
      "Text": " this process? We want to hear from you all. So, go ahead. And please use the mics. Thank you."
    },
    {
      "Time_Start": 1917.9,
      "Time_End": 1924.2,
      "Text": " Hello, hello. Um, yeah, I'm, I'm from Baltimore, um, like, it was really well publicized,"
    },
    {
      "Time_Start": 1924.2,
      "Time_End": 1930.4,
      "Text": " but 2019 Baltimore got, uh, affected by a really significant ransomware attack, took down,"
    },
    {
      "Time_Start": 1930.4,
      "Time_End": 1933.74,
      "Text": " like, a significant, significant portions of our IT system, and then there's been, like,"
    },
    {
      "Time_Start": 1933.74,
      "Time_End": 1937.98,
      "Text": " routinely ransomware attacks against medical databases and a whole host of other things. And I"
    },
    {
      "Time_Start": 1937.98,
      "Time_End": 1942.92,
      "Text": " think in response to that, or in the midst of that, Larry Hogan made, like, a pretty"
    },
    {
      "Time_Start": 1942.92,
      "Time_End": 1949.18,
      "Text": " significant investment in creating a director of cy- cyber resiliency with, like, a decent"
    },
    {
      "Time_Start": 1949.18,
      "Time_End": 1956.04,
      "Text": " budget attached where they can, sort of, like, run, um, like, like, red team, like, there's a"
    },
    {
      "Time_Start": 1956.04,
      "Time_End": 1962.48,
      "Text": " contract for, like, a red teaming company to go in and, sort of, like, try to maybe also run,"
    },
    {
      "Time_Start": 1962.48,
      "Time_End": 1968.96,
      "Text": " uh, essentially try to influence the IT system to increase its resiliency, um, but with a"
    },
    {
      "Time_Start": 1968.96,
      "Time_End": 1972.5,
      "Text": " dedicated, like, significant budget, budget to, to do that as well. And I'm just, kind of,"
    },
    {
      "Time_Start": 1972.5,
      "Time_End": 1976.96,
      "Text": " curious from you all's perspective, is that something that you see in the conversation at"
    },
    {
      "Time_Start": 1976.98,
      "Time_End": 1980.98,
      "Text": " other states, um, potentially making similar investments?"
    },
    {
      "Time_Start": 1980.98,
      "Time_End": 1986.6200000000001,
      "Text": " Thank you. I'm from Baltimore as well, so. Um, I'll let the states weigh in on this one."
    },
    {
      "Time_Start": 1986.6200000000001,
      "Time_End": 1992.3600000000001,
      "Text": " Alright, so, um, Louisiana has, has taken effort since 2019, we also, uh, our school board was"
    },
    {
      "Time_Start": 1992.3600000000001,
      "Time_End": 1997.74,
      "Text": " hit with, uh, ransomware across the state, and the state identified that we needed some"
    },
    {
      "Time_Start": 1997.74,
      "Time_End": 2002.8400000000001,
      "Text": " sort of, uh, dedicated cyber response, right? Uh, so the Louisiana Cyber Sec- uh, Security"
    },
    {
      "Time_Start": 2002.8600000000001,
      "Time_End": 2008.16,
      "Text": " Commission was created, uh, and under that, the Louisiana, Louisiana National Guard is an"
    },
    {
      "Time_Start": 2008.16,
      "Time_End": 2012.7400000000002,
      "Text": " incident response team, is kind of what it's built as. Uh, and then the election, uh, there's"
    },
    {
      "Time_Start": 2012.7400000000002,
      "Time_End": 2018.14,
      "Text": " an election security committee on that, which, which I sit on that as well. So, that was one"
    },
    {
      "Time_Start": 2018.14,
      "Time_End": 2023.5400000000002,
      "Text": " of the responses, uh, and each year, legislation is passed to, to present more in the"
    },
    {
      "Time_Start": 2023.5400000000002,
      "Time_End": 2029.5800000000002,
      "Text": " budget. Um, and just this year, uh, that commission was an executive order, uh, but just"
    },
    {
      "Time_Start": 2029.66,
      "Time_End": 2034.66,
      "Text": " this year, it is now legislated and mandated. So, we're taking a serious effort, uh, at that."
    },
    {
      "Time_Start": 2034.66,
      "Time_End": 2040.6000000000001,
      "Text": " We understand, uh, that, that it's, it's needed, um, and we keep putting our money where our"
    },
    {
      "Time_Start": 2040.6000000000001,
      "Time_End": 2047.8400000000001,
      "Text": " mouth is on that, that front. I just, and, and, yeah, I, I think it's a great idea. I think"
    },
    {
      "Time_Start": 2047.8400000000001,
      "Time_End": 2051.6400000000003,
      "Text": " maybe that's an area we might be going into. I think one of the things, too, that, that you"
    },
    {
      "Time_Start": 2051.6400000000003,
      "Time_End": 2056.6800000000003,
      "Text": " need to know is that elections in each state are probably a little different, and even"
    },
    {
      "Time_Start": 2056.68,
      "Time_End": 2061.56,
      "Text": " within the state of Iowa, we have, uh, the federal elections, but we oversee the"
    },
    {
      "Time_Start": 2061.56,
      "Time_End": 2068.46,
      "Text": " elections. We also have counties. Uh, our, our, uh, um, voter registration file, we're in"
    },
    {
      "Time_Start": 2068.46,
      "Time_End": 2073.7999999999997,
      "Text": " charge of that, but the counties have to do certain things by law, and so we've, you know,"
    },
    {
      "Time_Start": 2073.7999999999997,
      "Time_End": 2079.3399999999997,
      "Text": " had to kind of work in, in that area. We've, we've worked with our state to, uh, get in-point"
    },
    {
      "Time_Start": 2079.3399999999997,
      "Time_End": 2085.54,
      "Text": " detection, uh, on every piece of equipment in the auditor's office. We were able to do"
    },
    {
      "Time_Start": 2085.54,
      "Time_End": 2090.44,
      "Text": " that, you know, working with our, our state OCAO, and so I'm gonna, I'll bring that up to our"
    },
    {
      "Time_Start": 2090.44,
      "Time_End": 2095.32,
      "Text": " state OCAO about putting together or seeing if there's any contract possibilities to"
    },
    {
      "Time_Start": 2095.32,
      "Time_End": 2100.32,
      "Text": " actually putting together some red teams to try and do that, so it's a great idea."
    },
    {
      "Time_Start": 2104.42,
      "Time_End": 2112.0,
      "Text": " Anyone else? Who's up next? Trevor Timmons. Um, so you mentioned that you brought in folks"
    },
    {
      "Time_Start": 2112.0,
      "Time_End": 2116.26,
      "Text": " from, uh, universities to kind of help these sessions, trying to bridge the divide, maybe"
    },
    {
      "Time_Start": 2116.26,
      "Time_End": 2120.6,
      "Text": " between government officials and the cyber security research community. I mean, have you"
    },
    {
      "Time_Start": 2120.6,
      "Time_End": 2125.64,
      "Text": " seen some examples of where that may be, uh, paying off in the future, or do you see some"
    },
    {
      "Time_Start": 2125.64,
      "Time_End": 2130.72,
      "Text": " potential for where that might go in the future? Go for it, Jason. Yeah, happy to talk about"
    },
    {
      "Time_Start": 2130.72,
      "Time_End": 2136.62,
      "Text": " that. Um, so, you know, everybody talks about the job shortage or the lack of qualified"
    },
    {
      "Time_Start": 2136.62,
      "Time_End": 2141.42,
      "Text": " talent in cyber, you know, the number you hear today is there's 700,000 open jobs in"
    },
    {
      "Time_Start": 2141.44,
      "Time_End": 2146.14,
      "Text": " cyber, and we all know, well, I mean, having done this for a little while, I think most"
    },
    {
      "Time_Start": 2146.14,
      "Time_End": 2150.82,
      "Text": " folks know that the, the real challenge is not so much that there's not enough talent, it's"
    },
    {
      "Time_Start": 2150.82,
      "Time_End": 2157.02,
      "Text": " that there's a huge barrier to entry to get qualified, to get into jobs, right? So folks go"
    },
    {
      "Time_Start": 2157.02,
      "Time_End": 2160.9,
      "Text": " into cyber, great, they've got a degree, and nobody wants to hire them because they don't"
    },
    {
      "Time_Start": 2160.9,
      "Time_End": 2165.9,
      "Text": " have the magic number of things, they don't have that CISP yet, you know, for the entry"
    },
    {
      "Time_Start": 2165.92,
      "Time_End": 2172.92,
      "Text": " level job. So, um, so what we found was that helping, so bringing university into this"
    },
    {
      "Time_Start": 2172.92,
      "Time_End": 2178.86,
      "Text": " picture, and having real discussions about election, cyber security, with them in the"
    },
    {
      "Time_Start": 2178.86,
      "Time_End": 2184.54,
      "Text": " room, help them understand what they needed to be preparing their students for when it"
    },
    {
      "Time_Start": 2184.54,
      "Time_End": 2189.34,
      "Text": " came to the job market. Uh, so that was one thing, you know, just getting a good, good look"
    },
    {
      "Time_Start": 2189.34,
      "Time_End": 2193.58,
      "Text": " at what are the real challenges, what are the positions that these folks need, um, what are"
    },
    {
      "Time_Start": 2193.62,
      "Time_End": 2200.16,
      "Text": " the skill sets, um, that are necessary to support cyber risk management for the election"
    },
    {
      "Time_Start": 2200.16,
      "Time_End": 2205.7599999999998,
      "Text": " vertical, so to speak. So that was one big win, um, and then, you know, I think also just"
    },
    {
      "Time_Start": 2205.7599999999998,
      "Time_End": 2210.7799999999997,
      "Text": " having their voice sort of helping to inform, um, where they see issues in their own"
    },
    {
      "Time_Start": 2213.42,
      "Time_End": 2219.22,
      "Text": " academic environment, like where they see problems, there's a lot of commonality, you know,"
    },
    {
      "Time_Start": 2219.26,
      "Time_End": 2224.94,
      "Text": " between different industries, there's overlap, and taking the time for folks to get to"
    },
    {
      "Time_Start": 2224.94,
      "Time_End": 2230.1400000000003,
      "Text": " the common ground of, okay, we have this problem too, what did you do about it, because"
    },
    {
      "Time_Start": 2230.1400000000003,
      "Time_End": 2233.44,
      "Text": " maybe you got an idea that we don't, and we'd love to hear it because we might want to"
    },
    {
      "Time_Start": 2233.44,
      "Time_End": 2238.44,
      "Text": " go apply it to our side. That was very valuable. Yeah, and I think another, you know,"
    },
    {
      "Time_Start": 2240.9800000000005,
      "Time_End": 2245.9800000000005,
      "Text": " key point in involving students in this is just teaching them about the space, right? Um,"
    },
    {
      "Time_Start": 2249.32,
      "Time_End": 2253.7200000000003,
      "Text": " as was mentioned earlier, a lot of folks in the cyber security space have these patriotic"
    },
    {
      "Time_Start": 2253.7200000000003,
      "Time_End": 2258.5600000000004,
      "Text": " motivations and really want to help, um, improve, lift the collective resilience of the"
    },
    {
      "Time_Start": 2258.5600000000004,
      "Time_End": 2263.9,
      "Text": " U.S. and kind of what better way to do that than support the cyber security of our election"
    },
    {
      "Time_Start": 2263.9,
      "Time_End": 2268.5800000000004,
      "Text": " administration process, but elections, the way that we run elections in the U.S., it's a"
    },
    {
      "Time_Start": 2268.5800000000004,
      "Time_End": 2274.92,
      "Text": " very complicated system, right? We have the 50 states who run their own elections and"
    },
    {
      "Time_Start": 2274.92,
      "Time_End": 2279.98,
      "Text": " within the states, um, they're mostly administered at the local level, it depends on the"
    },
    {
      "Time_Start": 2279.98,
      "Time_End": 2287.0,
      "Text": " state, but, um, so you have 8,000 plus local election jurisdictions and every state does"
    },
    {
      "Time_Start": 2287.0,
      "Time_End": 2291.46,
      "Text": " things a little bit differently based on their, you know, their own independent, or their"
    },
    {
      "Time_Start": 2291.46,
      "Time_End": 2297.54,
      "Text": " own individual state's needs and state culture and, um, learning about that and being able"
    },
    {
      "Time_Start": 2297.54,
      "Time_End": 2301.78,
      "Text": " to interact with the folks who are running the elections I think has, students have really"
    },
    {
      "Time_Start": 2301.8,
      "Time_End": 2307.8,
      "Text": " enjoyed it. I always get, like, really, really great feedback from the professors who bring"
    },
    {
      "Time_Start": 2307.8,
      "Time_End": 2312.34,
      "Text": " their students out there and, um, I hear from the students who have come, you know, who have"
    },
    {
      "Time_Start": 2312.34,
      "Time_End": 2316.78,
      "Text": " come to those events asking, like, how do I get involved? What do you recommend in terms of"
    },
    {
      "Time_Start": 2316.78,
      "Time_End": 2322.46,
      "Text": " internships to, like, get involved in this space? And so, uh, it's exciting. Elections are,"
    },
    {
      "Time_Start": 2322.46,
      "Time_End": 2328.1000000000004,
      "Text": " are a challenging space, but it's an exciting space and, and it's great to see, um, see the"
    },
    {
      "Time_Start": 2328.12,
      "Time_End": 2334.12,
      "Text": " folks, you know, really wanting to pour, pour into it with their skill sets. Others? Yeah, go"
    },
    {
      "Time_Start": 2335.66,
      "Time_End": 2341.7599999999998,
      "Text": " for it. I'm going to jump in there a little bit with what he just asked. I'm with, uh, the"
    },
    {
      "Time_Start": 2341.7599999999998,
      "Time_End": 2346.94,
      "Text": " city government in Oklahoma. I'm on the state cyber security grant. One of the things we"
    },
    {
      "Time_Start": 2346.94,
      "Time_End": 2352.2799999999997,
      "Text": " looked at in implementing those grants was, uh, something that Texas A&M came up with and"
    },
    {
      "Time_Start": 2352.2799999999997,
      "Time_End": 2357.68,
      "Text": " that is starting a SOC that supported the local city governments. And so we are in the"
    },
    {
      "Time_Start": 2357.7,
      "Time_End": 2364.3999999999996,
      "Text": " process over the next two to three years of building SOCs in e- security operation centers,"
    },
    {
      "Time_Start": 2364.3999999999996,
      "Time_End": 2369.3999999999996,
      "Text": " um, in each one of the major state institutions with the idea of getting students that foot in"
    },
    {
      "Time_Start": 2372.3199999999997,
      "Time_End": 2377.3399999999997,
      "Text": " the door to get them that experience. You know, get a CISSP, you got to have like five or six"
    },
    {
      "Time_Start": 2377.3399999999997,
      "Time_End": 2382.12,
      "Text": " years of experience. You're not going to get that in college, but you have all these companies"
    },
    {
      "Time_Start": 2382.12,
      "Time_End": 2385.9199999999996,
      "Text": " out there wanting that thing. So now you're going to be hiring somebody that may get two to"
    },
    {
      "Time_Start": 2385.96,
      "Time_End": 2391.64,
      "Text": " three years working as a SOC analyst. And, uh, one of our private universities actually did"
    },
    {
      "Time_Start": 2391.64,
      "Time_End": 2395.8,
      "Text": " this internally and over the course of the time they were able to build up and get some really"
    },
    {
      "Time_Start": 2395.8,
      "Time_End": 2400.28,
      "Text": " good. They started actually getting in more than just SOC analyst jobs. They started going"
    },
    {
      "Time_Start": 2400.28,
      "Time_End": 2404.52,
      "Text": " out and doing the pen testings and that kind of thing. And so I think that's where the states"
    },
    {
      "Time_Start": 2404.52,
      "Time_End": 2409.52,
      "Text": " can really start working with their own institutions, you know, the state, um, education"
    },
    {
      "Time_Start": 2409.52,
      "Time_End": 2413.86,
      "Text": " stuff and start building that cyber talent pool. So I just wanted to toss that in there."
    },
    {
      "Time_Start": 2413.86,
      "Time_End": 2419.54,
      "Text": " Great. Thank you. And I know, um, both states here have done a lot of work with their local"
    },
    {
      "Time_Start": 2419.54,
      "Time_End": 2426.1800000000003,
      "Text": " universities on, um, you know, both, both getting them involved and just the, the"
    },
    {
      "Time_Start": 2426.1800000000003,
      "Time_End": 2431.1800000000003,
      "Text": " demystifying process as well. Right. Um, others? Okay. Are there, are there other NAS"
    },
    {
      "Time_Start": 2435.1200000000003,
      "Time_End": 2442.0,
      "Text": " demystifying sessions planned? And if so, how do we get involved? Great question. Um, so"
    },
    {
      "Time_Start": 2442.0,
      "Time_End": 2447.14,
      "Text": " no, not yet. Uh, we, we've typically so far done these at our summer conferences. So our"
    },
    {
      "Time_Start": 2447.14,
      "Time_End": 2452.32,
      "Text": " last one just happened last month. Um, and in our July summer conference and we plan to"
    },
    {
      "Time_Start": 2452.32,
      "Time_End": 2457.32,
      "Text": " conferences per year. Um, but open to ideas and folks who want to get involved. Um, my"
    },
    {
      "Time_Start": 2460.22,
      "Time_End": 2465.46,
      "Text": " contact information is here. So feel free to reach out to me. Um, you know, like I said, we,"
    },
    {
      "Time_Start": 2465.46,
      "Time_End": 2470.5,
      "Text": " we've done these three events, three events and we're kind of looking for is the, is the"
    },
    {
      "Time_Start": 2470.5,
      "Time_End": 2476.4,
      "Text": " best approach continuing this model. Um, maybe doing something a little bit different"
    },
    {
      "Time_Start": 2476.4,
      "Time_End": 2482.58,
      "Text": " moving forward. So I, I'm happy to hear from others and, and have, have ideas. And also"
    },
    {
      "Time_Start": 2482.58,
      "Time_End": 2488.42,
      "Text": " states are doing some of this stuff themselves, right? In, in state events that Iowa does"
    },
    {
      "Time_Start": 2488.42,
      "Time_End": 2493.42,
      "Text": " their, um, what left of boom event. Um, and so, you know, even whether it's NAS events or, or"
    },
    {
      "Time_Start": 2494.28,
      "Time_End": 2501.2200000000003,
      "Text": " getting you con, connected with some of our members, we'd be happy to hear from you. Are"
    },
    {
      "Time_Start": 2501.2200000000003,
      "Time_End": 2506.92,
      "Text": " there other questions or feedback? Okay. Uh, go ahead. All right. So when you guys are"
    },
    {
      "Time_Start": 2506.92,
      "Time_End": 2511.16,
      "Text": " interacting with, uh, folks in the cyber research community, right? And they say, Hey, they"
    },
    {
      "Time_Start": 2511.16,
      "Time_End": 2516.2400000000002,
      "Text": " look at some tech that you've got, um, which is going to be a lot of tech, right? Because you"
    },
    {
      "Time_Start": 2516.2400000000002,
      "Time_End": 2520.98,
      "Text": " have to have a lot of voting machines and they say, Hey, I found something for you. How"
    },
    {
      "Time_Start": 2521.0,
      "Time_End": 2525.7400000000002,
      "Text": " difficult is it for you to actually implement a fix? Is it as easy as a phone call? Or are you"
    },
    {
      "Time_Start": 2525.7400000000002,
      "Time_End": 2530.78,
      "Text": " like now, you know, talking to vendors and sourcing and talking to people about funding?"
    },
    {
      "Time_Start": 2530.78,
      "Time_End": 2535.78,
      "Text": " Like, is this a big turn or, or a pretty easy turnaround? So I'll give kind of a quick"
    },
    {
      "Time_Start": 2535.78,
      "Time_End": 2541.86,
      "Text": " overview and then if anybody wants to weigh in, they can. But, um, you know, everybody's"
    },
    {
      "Time_Start": 2541.86,
      "Time_End": 2547.2,
      "Text": " mind goes immediately to the voting, vote casting and tabulation systems, which the"
    },
    {
      "Time_Start": 2547.2200000000003,
      "Time_End": 2552.5600000000004,
      "Text": " manufacturers of those systems play, play a big role in, in, I think the question that"
    },
    {
      "Time_Start": 2552.5600000000004,
      "Time_End": 2559.6000000000004,
      "Text": " you're asking there, but what our members have been more focused on, and I think for good"
    },
    {
      "Time_Start": 2559.6000000000004,
      "Time_End": 2564.34,
      "Text": " reason, which we could talk about is, are the internet connected systems that support"
    },
    {
      "Time_Start": 2564.34,
      "Time_End": 2569.2000000000003,
      "Text": " election administration. So we're talking, uh, voter registration systems, election"
    },
    {
      "Time_Start": 2569.2000000000003,
      "Time_End": 2574.4800000000005,
      "Text": " management systems, uh, websites that share election information. And so their"
    },
    {
      "Time_Start": 2574.5,
      "Time_End": 2580.54,
      "Text": " vulnerability disclosure policies, when a, when a secretary's office has them, um, that,"
    },
    {
      "Time_Start": 2580.54,
      "Time_End": 2585.68,
      "Text": " that's the scope of those. And, and those are the systems where they're able to implement"
    },
    {
      "Time_Start": 2585.68,
      "Time_End": 2590.28,
      "Text": " changes, whether it's working with their vendor or, um, in-house developers. But does"
    },
    {
      "Time_Start": 2590.28,
      "Time_End": 2597.82,
      "Text": " anyone else want to weigh in on that? This doesn't probably answer your question, but one"
    },
    {
      "Time_Start": 2597.82,
      "Time_End": 2601.62,
      "Text": " of the things that we need to do is reassure the public. And so what we've done in the"
    },
    {
      "Time_Start": 2601.62,
      "Time_End": 2606.5,
      "Text": " state of Iowa, Secretary Page has put together with the legislature, uh, after each"
    },
    {
      "Time_Start": 2606.5,
      "Time_End": 2611.64,
      "Text": " election, we have the vote counting machines, we, we have, uh, the physical ballots, and we"
    },
    {
      "Time_Start": 2611.64,
      "Time_End": 2618.38,
      "Text": " actually go in and we do a, uh, hand count of, in each county, one precinct, and they just,"
    },
    {
      "Time_Start": 2618.38,
      "Time_End": 2621.98,
      "Text": " you know, with their finger, one, two, three, four, five, and they match it against the"
    },
    {
      "Time_Start": 2621.98,
      "Time_End": 2628.58,
      "Text": " machine. And so, again, we have confidence, we want to kind of ensure confidence, but"
    },
    {
      "Time_Start": 2628.58,
      "Time_End": 2633.54,
      "Text": " we're also, again, we have the VDP, so that if you do find something, you know, we, we"
    },
    {
      "Time_Start": 2633.54,
      "Time_End": 2639.98,
      "Text": " want to be able to see that and respond to that and, and work with that. But again, uh,"
    },
    {
      "Time_Start": 2639.98,
      "Time_End": 2643.62,
      "Text": " just with the machines, and, and not every state does it, but, but I think most of the"
    },
    {
      "Time_Start": 2643.62,
      "Time_End": 2649.1,
      "Text": " states do, they do an audit to make sure that those paper ballots match with those machine"
    },
    {
      "Time_Start": 2649.1,
      "Time_End": 2655.04,
      "Text": " counts. And I think the majority of the time, I, I, I'm not sure if I've heard it where"
    },
    {
      "Time_Start": 2655.06,
      "Time_End": 2658.94,
      "Text": " they haven't matched, so we have pretty high confidence from that level."
    },
    {
      "Time_Start": 2658.94,
      "Time_End": 2666.5,
      "Text": " Yeah, it's, it's really important to, you know, understand the difference between the, the"
    },
    {
      "Time_Start": 2666.5,
      "Time_End": 2670.54,
      "Text": " internet connected systems that support elections and, and these vote casting and"
    },
    {
      "Time_Start": 2670.54,
      "Time_End": 2676.82,
      "Text": " tabulation systems. The, really the latter have a lot of, you're able to implement a lot"
    },
    {
      "Time_Start": 2676.82,
      "Time_End": 2682.22,
      "Text": " of resiliency into the process through things like paper and auditing that the paper"
    },
    {
      "Time_Start": 2682.2400000000002,
      "Time_End": 2687.2400000000002,
      "Text": " ballots or the paper trail so that, um, you know, to, to instill confidence, but also to"
    },
    {
      "Time_Start": 2691.6800000000003,
      "Time_End": 2696.6800000000003,
      "Text": " ensure accuracy, right? Um, the internet connected systems, those are not connected to the"
    },
    {
      "Time_Start": 2699.6600000000003,
      "Time_End": 2704.2200000000003,
      "Text": " voting systems and, and they're separate, but they're still very important, right? They're"
    },
    {
      "Time_Start": 2704.2200000000003,
      "Time_End": 2709.46,
      "Text": " still very important to the process and they're what we know has been the target of"
    },
    {
      "Time_Start": 2709.5,
      "Time_End": 2716.38,
      "Text": " adversaries in the past. And so, um, it's really, it has to be an effort for, for both of"
    },
    {
      "Time_Start": 2716.38,
      "Time_End": 2720.42,
      "Text": " these things. And I, I know we're almost out of time, so I really want to go down the line"
    },
    {
      "Time_Start": 2720.42,
      "Time_End": 2725.42,
      "Text": " one more time, just in the spirit of collaboration, um, any like last minute thoughts, um,"
    },
    {
      "Time_Start": 2727.92,
      "Time_End": 2732.52,
      "Text": " encouragement for the folks in the room, lessons learned that you want to share, just quick,"
    },
    {
      "Time_Start": 2732.52,
      "Time_End": 2738.36,
      "Text": " quick note, we have two minutes to go. I'll go to Jack. I'll keep it short, I'll say really"
    },
    {
      "Time_Start": 2738.36,
      "Time_End": 2743.4,
      "Text": " just get involved. Um, there's so many opportunities now, whether it's participating in a"
    },
    {
      "Time_Start": 2743.4,
      "Time_End": 2748.44,
      "Text": " vulnerability disclosure program or a bug bounty, um, if your state doesn't have one, get,"
    },
    {
      "Time_Start": 2748.44,
      "Time_End": 2754.58,
      "Text": " uh, talk to them, um, encourage them to set one up. Um, there's all sorts of other"
    },
    {
      "Time_Start": 2754.58,
      "Time_End": 2760.26,
      "Text": " opportunities, um, get in contact with Lindsay at NASS, um, I'll plug at CISA, we also have a"
    },
    {
      "Time_Start": 2760.26,
      "Time_End": 2763.76,
      "Text": " number of, um, opportunities to get involved. We have a session tomorrow where you can"
    },
    {
      "Time_Start": 2763.76,
      "Time_End": 2768.6000000000004,
      "Text": " provide feedback on some guidance we're putting out on secure by design, uh, we put out a"
    },
    {
      "Time_Start": 2768.6000000000004,
      "Time_End": 2774.5400000000004,
      "Text": " request for information on open source security, um, as well, so please do get involved, um,"
    },
    {
      "Time_Start": 2774.5400000000004,
      "Time_End": 2779.5400000000004,
      "Text": " get your opinions in and we can collaboratively do better here. I think I just want to say"
    },
    {
      "Time_Start": 2782.78,
      "Time_End": 2788.5600000000004,
      "Text": " we appreciate the research community, you know, that's a, there's the landscape is changing,"
    },
    {
      "Time_Start": 2788.5600000000004,
      "Time_End": 2793.6000000000004,
      "Text": " I think for you, for us, we're trying to learn and I think one of our goals has been how do"
    },
    {
      "Time_Start": 2793.6,
      "Time_End": 2798.54,
      "Text": " we work towards cyber maturity, we're not, we know we're not there, the minute I say we're"
    },
    {
      "Time_Start": 2798.54,
      "Time_End": 2803.88,
      "Text": " there, one of you guys is going to prove us wrong, uh, so we're just moving in that direction"
    },
    {
      "Time_Start": 2803.88,
      "Time_End": 2810.18,
      "Text": " of cyber maturity and, uh, continuing to improve and continuing to learn, um, from you guys"
    },
    {
      "Time_Start": 2810.18,
      "Time_End": 2815.2,
      "Text": " and, and, uh, from, uh, experts in this, this field. I just want to say that, um, thanks to"
    },
    {
      "Time_Start": 2815.9,
      "Time_End": 2820.9,
      "Text": " Mike's leadership, Lindsey's, uh, continued shepherding of this project, you're seeing, what"
    },
    {
      "Time_Start": 2825.5800000000004,
      "Time_End": 2831.32,
      "Text": " you see is a multi-year project, uh, that has made some impact and has helped inform and"
    },
    {
      "Time_Start": 2831.32,
      "Time_End": 2836.5200000000004,
      "Text": " educate and bring together people to collaborate on a problem that, that overlaps multiple"
    },
    {
      "Time_Start": 2836.5200000000004,
      "Time_End": 2841.5200000000004,
      "Text": " disciplines. And I, I, just one second that, and as well, if you do want to get involved, please"
    },
    {
      "Time_Start": 2841.88,
      "Time_End": 2846.88,
      "Text": " contact, uh, NAS, they can get you to whatever state, uh, that, that you, you represent. And"
    },
    {
      "Time_Start": 2849.52,
      "Time_End": 2854.2,
      "Text": " then, uh, as well, uh, if, if you are a student and you're looking to, to get even more"
    },
    {
      "Time_Start": 2854.2,
      "Time_End": 2859.2,
      "Text": " involved, look at scholarship for service, uh, it's not just, uh, for federal service, you can"
    },
    {
      "Time_Start": 2859.2,
      "Time_End": 2863.44,
      "Text": " also, uh, relate that to state service as well. Uh, so that's one way to get some education"
    },
    {
      "Time_Start": 2863.44,
      "Time_End": 2868.44,
      "Text": " paid and be involved at the same time. Thank you everybody."
    },
    {
      "Time_Start": 2871.52,
      "Time_End": 2876.54,
      "Text": " Thank you."
    }
  ]
}