{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 5.04,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Good afternoon, everyone. My name is Maurice. I'm going to be your host, which means that I just"
    },
    {
      "Time_Start": 5.04,
      "Time_End": 8.5,
      "Text": " get to go over a few of the ground rules, and then let you get here for what you really"
    },
    {
      "Time_Start": 8.5,
      "Time_End": 14.18,
      "Text": " wanted to hear about, which is International Policy 101. Like I said, we're going to start"
    },
    {
      "Time_Start": 14.18,
      "Time_End": 19.98,
      "Text": " this off by letting you know that this is going to be on the record. So that is going to be"
    },
    {
      "Time_Start": 19.98,
      "Time_End": 25.86,
      "Text": " streamed out, and make sure that if you don't want to be on camera, you take note of the"
    },
    {
      "Time_Start": 25.86,
      "Time_End": 30.86,
      "Text": " camera behind you. As we're going to be hearing from our panelists today, they're going to go"
    },
    {
      "Time_Start": 34.8,
      "Time_End": 38.96,
      "Text": " through, introduce themselves, and then we'll have some Q&A at the end. Also, at the end of"
    },
    {
      "Time_Start": 38.96,
      "Time_End": 42.739999999999995,
      "Text": " the session, there is going to be a feedback slide, so you can go ahead and scan the QR code,"
    },
    {
      "Time_Start": 42.739999999999995,
      "Time_End": 46.44,
      "Text": " let us know what you thought about it. During the session, please keep in mind, if you have"
    },
    {
      "Time_Start": 46.44,
      "Time_End": 51.82,
      "Text": " anything that beeps, makes any fun noises, put that on silence, so that way we don't all"
    },
    {
      "Time_Start": 51.82,
      "Time_End": 58.32,
      "Text": " hear it. And then lastly, as a reminder, if you are standing up, please try to find a seat, if"
    },
    {
      "Time_Start": 58.32,
      "Time_End": 63.32,
      "Text": " not, keep the hallways clear as best we can. And with that, let's go ahead and start. Thank you."
    },
    {
      "Time_Start": 65.0,
      "Time_End": 70.5,
      "Text": " Thank you very much, Maurice, and thank you all for coming. Welcome to DEF CON. It's"
    },
    {
      "Time_Start": 70.5,
      "Time_End": 74.4,
      "Text": " fantastic to be here, great opportunity to share, and we've got a wonderful panel to talk"
    },
    {
      "Time_Start": 74.4,
      "Time_End": 80.28,
      "Text": " through international cyber security policy work. Just a few things from our side, we"
    },
    {
      "Time_Start": 80.3,
      "Time_End": 85.98,
      "Text": " have allocated about one hour, 20 minutes for the kind of component of it, the on-the-record"
    },
    {
      "Time_Start": 85.98,
      "Time_End": 90.02,
      "Text": " component, and the intention will be that that will enable people to come and ask questions"
    },
    {
      "Time_Start": 90.02,
      "Time_End": 94.12,
      "Text": " afterwards and have a kind of one-on-one conversation, if that's helpful. Of course, happy"
    },
    {
      "Time_Start": 94.12,
      "Time_End": 99.52000000000001,
      "Text": " to be flexible, make the most of time, but also that's the intention. So, what we're going to do"
    },
    {
      "Time_Start": 99.52000000000001,
      "Time_End": 104.3,
      "Text": " is just start with a few personal introductions. You know, really excited to be here. So, my"
    },
    {
      "Time_Start": 104.36,
      "Time_End": 112.36,
      "Text": " name is Peter Stephens, and I'm at the OECD, which is, thank you, that wasn't expected, but"
    },
    {
      "Time_Start": 112.36,
      "Time_End": 118.03999999999999,
      "Text": " greatly appreciated. So, it's an international organization based in Paris, which supports"
    },
    {
      "Time_Start": 118.03999999999999,
      "Time_End": 123.84,
      "Text": " 30 member state countries on a range of policy issues. As you can maybe tell from my accent,"
    },
    {
      "Time_Start": 123.84,
      "Time_End": 127.12,
      "Text": " previously, I was based in the United Kingdom, where I worked in the Department of Digital,"
    },
    {
      "Time_Start": 127.12,
      "Time_End": 131.51999999999998,
      "Text": " Culture, Media, and Sport, and I led the Secure by Design Policy Initiative, so the work on"
    },
    {
      "Time_Start": 131.74,
      "Time_End": 136.64000000000001,
      "Text": " IT security was my area. So, it's great to be here, and what I'll do is just pass down, and"
    },
    {
      "Time_Start": 136.64000000000001,
      "Time_End": 139.04000000000002,
      "Text": " then we can, we'll have a start-up conversation."
    },
    {
      "Time_Start": 139.04000000000002,
      "Time_End": 143.78,
      "Text": " Hi, all. My name's Adam Dovell. I work for the Australian government at the embassy in D.C.,"
    },
    {
      "Time_Start": 143.78,
      "Time_End": 149.12,
      "Text": " and my job is to engage with the U.S. government and the industry on cybersecurity policy."
    },
    {
      "Time_Start": 151.92000000000002,
      "Time_End": 156.62,
      "Text": " Hi, there. Peter Brown. I work for the European Parliament. I'm a career civil servant there"
    },
    {
      "Time_Start": 156.66,
      "Time_End": 162.66,
      "Text": " since 1990, although I did take a 10-year sabbatical working in the private sector."
    },
    {
      "Time_Start": 162.66,
      "Time_End": 169.06,
      "Text": " I lead on tech policy for the, what I call the Eat Your Own Dog Food Service, which is"
    },
    {
      "Time_Start": 169.06,
      "Time_End": 175.02,
      "Text": " where we examine within the parliament how policy that we're adopting politically actually"
    },
    {
      "Time_Start": 175.02,
      "Time_End": 178.9,
      "Text": " will have an impact within the IT services in the parliament. So, we're sort of stuck"
    },
    {
      "Time_Start": 178.9,
      "Time_End": 181.1,
      "Text": " between policy and operations."
    },
    {
      "Time_Start": 181.1,
      "Time_End": 185.98000000000002,
      "Text": " Hi, everyone. It's great to be here. My name's Bryony Crown, and I lead on all things cyber"
    },
    {
      "Time_Start": 185.98,
      "Time_End": 190.78,
      "Text": " policy in the embassy in D.C. for the British government, but similar to Adam, also these"
    },
    {
      "Time_Start": 190.78,
      "Time_End": 193.98,
      "Text": " are all things cyber policy with the U.S. and industry."
    },
    {
      "Time_Start": 193.98,
      "Time_End": 201.78,
      "Text": " I'm Ari Schwartz. I'm Managing Director of Cybersecurity Services at Venable. I also"
    },
    {
      "Time_Start": 201.78,
      "Time_End": 207.57999999999998,
      "Text": " run the Center for Cybersecurity Policy and Law, and previously in the Obama administration,"
    },
    {
      "Time_Start": 207.57999999999998,
      "Time_End": 209.98,
      "Text": " I was in the National Security Council."
    },
    {
      "Time_Start": 209.98,
      "Time_End": 215.5,
      "Text": " Thank you so much, and we're really hoping to have an interactive session as well, so"
    },
    {
      "Time_Start": 215.5,
      "Time_End": 218.9,
      "Text": " please do feel free to continue to ask questions. As I said, there will be an opportunity at"
    },
    {
      "Time_Start": 218.9,
      "Time_End": 223.5,
      "Text": " the end for off-the-record conversations as well, but if you want to raise questions,"
    },
    {
      "Time_Start": 223.5,
      "Time_End": 226.5,
      "Text": " then please feel free to do so."
    },
    {
      "Time_Start": 226.5,
      "Time_End": 230.9,
      "Text": " So, what I'd also like the intention from this session is that everyone leaves with"
    },
    {
      "Time_Start": 230.9,
      "Time_End": 234.9,
      "Text": " an understanding of what the key priorities are, what people at different countries are"
    },
    {
      "Time_Start": 234.9,
      "Time_End": 240.1,
      "Text": " working on, and how we can make sure that we continue to inform one another of our work"
    },
    {
      "Time_Start": 240.1,
      "Time_End": 241.5,
      "Text": " as it progresses."
    },
    {
      "Time_Start": 241.5,
      "Time_End": 246.3,
      "Text": " So, the way that we were thinking about framing this conversation was to think through the"
    },
    {
      "Time_Start": 246.3,
      "Time_End": 250.5,
      "Text": " various challenges that cybersecurity policy makers have been facing, first of all, in"
    },
    {
      "Time_Start": 250.5,
      "Time_End": 255.7,
      "Text": " creating their own identity. It's had to be generated very quickly, and then how that"
    },
    {
      "Time_Start": 255.7,
      "Time_End": 262.1,
      "Text": " has translated into challenges of securing existing technologies, and then moving into"
    },
    {
      "Time_Start": 262.1,
      "Time_End": 266.3,
      "Text": " challenges that have been how we can learn from that experiences to make sure that we're"
    },
    {
      "Time_Start": 266.3,
      "Time_End": 270.5,
      "Text": " more resilient, became more capable of addressing these issues, and then in the future, also"
    },
    {
      "Time_Start": 270.5,
      "Time_End": 277.5,
      "Text": " for touching upon cyber workforce and cybersecurity skills agenda as well as an area of interest."
    },
    {
      "Time_Start": 277.5,
      "Time_End": 283.9,
      "Text": " So, I think, for me, one area that I'm particularly interested in is how we can be helping to"
    },
    {
      "Time_Start": 283.9,
      "Time_End": 290.3,
      "Text": " play catch-up. I think an area that, in my experience in DCMS, that we had was, particularly"
    },
    {
      "Time_Start": 290.3,
      "Time_End": 294.3,
      "Text": " in light of the Mirai botnet attack, was thinking about, okay, now I've got so many of these"
    },
    {
      "Time_Start": 294.3,
      "Time_End": 298.5,
      "Text": " IoT devices that are being used by businesses and by individuals across the United Kingdom"
    },
    {
      "Time_Start": 298.5,
      "Time_End": 304.1,
      "Text": " and, of course, across the world, and we had to retrofit security into those forms"
    },
    {
      "Time_Start": 304.1,
      "Time_End": 309.9,
      "Text": " of technology, and that was a real challenge of how we can create this approach where working"
    },
    {
      "Time_Start": 309.9,
      "Time_End": 315.1,
      "Text": " in policy is a particular way of operating, and which often relies on lengthy consultation"
    },
    {
      "Time_Start": 315.1,
      "Time_End": 322.5,
      "Text": " processes, long engagements with various stakeholders, and lots of ministerial engagement or lots"
    },
    {
      "Time_Start": 322.5,
      "Time_End": 327.9,
      "Text": " of hierarchical processes. It can be often, I mean, we can all agree, not as fast as the"
    },
    {
      "Time_Start": 327.90000000000003,
      "Time_End": 331.3,
      "Text": " private sector in terms of how it can operate, but then there's been a question of how we"
    },
    {
      "Time_Start": 331.3,
      "Time_End": 337.1,
      "Text": " can learn quickly to try and make the best impact we can within those areas of technologies."
    },
    {
      "Time_Start": 337.1,
      "Time_End": 341.3,
      "Text": " So, you know, I think that that comes into this secure by design approach that quite"
    },
    {
      "Time_Start": 341.3,
      "Time_End": 346.50000000000006,
      "Text": " often gets referred to. So, I suppose what I'd love to really talk about is, maybe start"
    },
    {
      "Time_Start": 346.50000000000006,
      "Time_End": 350.70000000000005,
      "Text": " with Bryony, understanding a bit more about some of the work that's been taking on in"
    },
    {
      "Time_Start": 350.7,
      "Time_End": 356.3,
      "Text": " the UK, and also, so you can talk through both on the PSTI bill, but also a bit more"
    },
    {
      "Time_Start": 356.3,
      "Time_End": 358.3,
      "Text": " on telco."
    },
    {
      "Time_Start": 358.3,
      "Time_End": 362.7,
      "Text": " Cool, thank you very much. So, just to start a bit about secure by design, because I feel"
    },
    {
      "Time_Start": 362.7,
      "Time_End": 367.3,
      "Text": " like in UK government we've talked about secure by design for quite a long time now, so talking"
    },
    {
      "Time_Start": 367.3,
      "Time_End": 373.9,
      "Text": " about what that actually means is about how we want to secure technology and data sharing"
    },
    {
      "Time_Start": 373.9,
      "Time_End": 379.5,
      "Text": " systems on a secure by default basis, which basically means that we're not retrofitting"
    },
    {
      "Time_Start": 379.5,
      "Time_End": 383.9,
      "Text": " and we're not doing a security as an add-on. I'm sure a lot of you have heard about the"
    },
    {
      "Time_Start": 383.9,
      "Time_End": 388.3,
      "Text": " analogies we talk about having seatbelts in cars, making sure that, as you know, if we"
    },
    {
      "Time_Start": 388.3,
      "Time_End": 392.9,
      "Text": " have seatbelts there's less deaths. I'm sure people have also heard about if we have, with"
    },
    {
      "Time_Start": 392.9,
      "Time_End": 396.9,
      "Text": " aeroplanes, that we used to have square windows, which meant there was pressure on the corners,"
    },
    {
      "Time_Start": 396.9,
      "Time_End": 401.3,
      "Text": " which led to many more deaths. Now we have circular windows, which means that they're"
    },
    {
      "Time_Start": 401.3,
      "Time_End": 407.7,
      "Text": " secure by default and it's much more safe. So, that's something that we, I think that's"
    },
    {
      "Time_Start": 407.9,
      "Time_End": 411.09999999999997,
      "Text": " something that's how we need to think about, particularly I'm sure we're going to talk"
    },
    {
      "Time_Start": 411.09999999999997,
      "Time_End": 416.9,
      "Text": " more about AI and how we need to approach that. But what we recognise is that we can"
    },
    {
      "Time_Start": 416.9,
      "Time_End": 420.3,
      "Text": " talk a lot about that, but actually that's really difficult for industry. It costs money,"
    },
    {
      "Time_Start": 420.3,
      "Time_End": 423.9,
      "Text": " it costs time, you want to go quick to market, it's really, really difficult. So, actually"
    },
    {
      "Time_Start": 423.9,
      "Time_End": 429.3,
      "Text": " how we work together to make that as enforceable and easy as possible is how we can actually"
    },
    {
      "Time_Start": 429.3,
      "Time_End": 435.7,
      "Text": " achieve that. So, in April we issued some guidance with a lot of countries, with Australia,"
    },
    {
      "Time_Start": 435.7,
      "Time_End": 441.7,
      "Text": " with the US and a number of other partners, a bit of a roadmap of how companies can do"
    },
    {
      "Time_Start": 441.7,
      "Time_End": 446.9,
      "Text": " that. And that's meant to be some really sort of easy enforceable steps. This isn't rocket"
    },
    {
      "Time_Start": 446.9,
      "Time_End": 449.9,
      "Text": " science what we're talking about, this is about not having default passwords, this is"
    },
    {
      "Time_Start": 449.9,
      "Time_End": 454.5,
      "Text": " about things that should be being done by practice. But sometimes that's really difficult"
    },
    {
      "Time_Start": 454.5,
      "Time_End": 458.09999999999997,
      "Text": " when people are not thinking about security as, you know, because you want to go quickly"
    },
    {
      "Time_Start": 458.09999999999997,
      "Time_End": 463.5,
      "Text": " into the market. So, we're doing that via a variety of initiatives and I know there's"
    },
    {
      "Time_Start": 463.5,
      "Time_End": 467.3,
      "Text": " a listening session with CISA later to go through some of that guidance line by line"
    },
    {
      "Time_Start": 467.3,
      "Time_End": 473.3,
      "Text": " and get some feedback. But some of the things that we're doing in the UK to enforce that"
    },
    {
      "Time_Start": 473.3,
      "Time_End": 479.3,
      "Text": " is with our Product Security Act, which was brought into force at the end of last year"
    },
    {
      "Time_Start": 479.3,
      "Time_End": 485.9,
      "Text": " and will be made law by April next year. That's about consumer devices. And what we've done"
    },
    {
      "Time_Start": 485.9,
      "Time_End": 490.3,
      "Text": " is take this much a very evidence-based approach. So, this was taking evidence from our National"
    },
    {
      "Time_Start": 490.3,
      "Time_End": 494.5,
      "Text": " Cyber Security Centre to look at where do we see the most threat and where can we do"
    },
    {
      "Time_Start": 494.5,
      "Time_End": 499.3,
      "Text": " things that make the most impact. And that's via three steps. So, one is not having default"
    },
    {
      "Time_Start": 499.3,
      "Time_End": 505.90000000000003,
      "Text": " passwords, one is having a mechanism to report vulnerabilities and the third one is the manufacturer"
    },
    {
      "Time_Start": 505.90000000000003,
      "Time_End": 512.3,
      "Text": " to be transparent about how long that device will be updated for. The really great thing"
    },
    {
      "Time_Start": 512.3,
      "Time_End": 516.1,
      "Text": " about this legislation is that it can be updated. This is very much seen as the initial raising"
    },
    {
      "Time_Start": 516.1,
      "Time_End": 520.5,
      "Text": " of that resilience, but it was something that we can potentially look to build upon"
    },
    {
      "Time_Start": 520.5,
      "Time_End": 524.5,
      "Text": " in the years to come. And I'm sure we'll go talk a bit more about the CRA, but that's"
    },
    {
      "Time_Start": 524.5,
      "Time_End": 528.7,
      "Text": " something we see as something that is very much in partnership and something that we"
    },
    {
      "Time_Start": 528.7,
      "Time_End": 532.7,
      "Text": " will see to be, that we will continue to assess and see how both those bits of legislation"
    },
    {
      "Time_Start": 532.7,
      "Time_End": 539.1,
      "Text": " grow. The second bit of legislation which came into force almost two years ago now is"
    },
    {
      "Time_Start": 539.1,
      "Time_End": 545.9,
      "Text": " the Telecoms Security Act. This is really to recognise that telecoms and networks are"
    },
    {
      "Time_Start": 545.9,
      "Time_End": 550.5,
      "Text": " the backbone of how we manage our everyday lives. And we talk a lot about in the UK about"
    },
    {
      "Time_Start": 550.5,
      "Time_End": 554.5,
      "Text": " making the UK the safest place to live and work online. And this was seen as the backbone"
    },
    {
      "Time_Start": 554.5,
      "Time_End": 558.5,
      "Text": " of how we do that. And there was a tonne of work that went into inform that work about"
    },
    {
      "Time_Start": 558.5,
      "Time_End": 564.6999999999999,
      "Text": " we had diversification strategy, we had looking at what areas of the network were most vulnerable"
    },
    {
      "Time_Start": 564.6999999999999,
      "Time_End": 569.3,
      "Text": " to threat. And so this is, like I say, a very evidence-based approach. And the aim of that"
    },
    {
      "Time_Start": 569.3,
      "Time_End": 573.3,
      "Text": " legislation is to raise the resilience of networks and to make sure that they, areas"
    },
    {
      "Time_Start": 573.3000000000001,
      "Time_End": 578.1,
      "Text": " that see the most threat, are resilient as much as possible. So that's something we're"
    },
    {
      "Time_Start": 578.1,
      "Time_End": 581.9000000000001,
      "Text": " really proud of in the UK. We've still got a long way to go, we haven't fixed everything,"
    },
    {
      "Time_Start": 581.9000000000001,
      "Time_End": 585.3000000000001,
      "Text": " but it's something that to us, those two areas, is something that we're seeing as a real key"
    },
    {
      "Time_Start": 585.3000000000001,
      "Time_End": 589.9000000000001,
      "Text": " of how we can raise the overall security of the UK and indeed the world."
    },
    {
      "Time_Start": 589.9000000000001,
      "Time_End": 593.1,
      "Text": " I think that's, I mean, it's amazing to hear about and I think something that may be interesting"
    },
    {
      "Time_Start": 593.1,
      "Time_End": 596.9000000000001,
      "Text": " for participants who may be not familiar with the intricacies of UK parliamentary law is"
    },
    {
      "Time_Start": 596.9000000000001,
      "Time_End": 601.3000000000001,
      "Text": " there's sort of, there's the distinction between primary legislation and secondary legislation."
    },
    {
      "Time_Start": 601.3000000000001,
      "Time_End": 604.3000000000001,
      "Text": " And in both cases, those bills are what we call primary legislation, which means it's"
    },
    {
      "Time_Start": 604.3000000000001,
      "Time_End": 608.3000000000001,
      "Text": " on the statute book as an independent piece of legislation, which takes a long time to"
    },
    {
      "Time_Start": 608.3000000000001,
      "Time_End": 614.3000000000001,
      "Text": " get implemented because there's a lot of parliamentary time that goes into that process. So the competition"
    },
    {
      "Time_Start": 614.3000000000001,
      "Time_End": 619.3000000000001,
      "Text": " internally to secure a spot in the Queen's speech, which generates the kind of, which"
    },
    {
      "Time_Start": 619.3000000000001,
      "Time_End": 625.3000000000001,
      "Text": " where all of the, what bills will be introduced, that is very competitive. But once you're"
    },
    {
      "Time_Start": 625.3000000000001,
      "Time_End": 630.3000000000001,
      "Text": " on that statute book, it becomes much easier to add regulation. So actually, in terms of"
    },
    {
      "Time_Start": 630.3000000000001,
      "Time_End": 634.3000000000001,
      "Text": " creating the capacity to be more adaptable, there is a distinction between primary and"
    },
    {
      "Time_Start": 634.3000000000001,
      "Time_End": 637.3000000000001,
      "Text": " secondary. And that's, I'm sure that maybe in other countries as well, but I think that's"
    },
    {
      "Time_Start": 637.3000000000001,
      "Time_End": 642.3000000000001,
      "Text": " a really important part for both the PSTI Bill and the Telco Security Bill is an important"
    },
    {
      "Time_Start": 642.3000000000001,
      "Time_End": 647.3000000000001,
      "Text": " distinction. And I think, helpfully, as a big challenge that I think legislation faces"
    },
    {
      "Time_Start": 647.3000000000001,
      "Time_End": 653.3000000000001,
      "Text": " is how can it, how do you avoid becoming obsolete as soon as you become implemented? Because"
    },
    {
      "Time_Start": 653.3000000000001,
      "Time_End": 658.3000000000001,
      "Text": " as technology moves so quickly, that's very difficult. So my hope is that by having that"
    },
    {
      "Time_Start": 658.3000000000001,
      "Time_End": 662.3000000000001,
      "Text": " process and that engagement with industry and that engagement with security communities,"
    },
    {
      "Time_Start": 662.3000000000001,
      "Time_End": 666.3000000000001,
      "Text": " you're able to make sure you're fit for purpose in that way. So yeah, I think that's an important"
    },
    {
      "Time_Start": 666.3000000000001,
      "Time_End": 670.3000000000001,
      "Text": " point as well, definitely. Adam, do you want to talk a bit more about some of the things"
    },
    {
      "Time_Start": 670.3000000000001,
      "Time_End": 672.3000000000001,
      "Text": " that have been going on in Australia on that side?"
    },
    {
      "Time_Start": 672.3000000000001,
      "Time_End": 684.3000000000001,
      "Text": " Sure. And I'll start by outlining Australia's position in our region. In 2017, in recognition"
    },
    {
      "Time_Start": 684.3000000000001,
      "Time_End": 689.3000000000001,
      "Text": " of the deteriorated geostrategic environment we found ourselves, Australia Government"
    },
    {
      "Time_Start": 689.3000000000001,
      "Time_End": 694.3000000000001,
      "Text": " made the decision to introduce legislation which would require our telecommunications"
    },
    {
      "Time_Start": 694.3000000000001,
      "Time_End": 700.3000000000001,
      "Text": " companies to not have vendor equipment in their networks that came from countries which"
    },
    {
      "Time_Start": 700.3000000000001,
      "Time_End": 707.3000000000001,
      "Text": " were subject to extraterritorial direction. Then we went on a journey over the next few"
    },
    {
      "Time_Start": 708.3000000000001,
      "Time_End": 715.3000000000001,
      "Text": " years to outline what we consider to be critical infrastructure assets. So we have required"
    },
    {
      "Time_Start": 715.3000000000001,
      "Time_End": 723.3000000000001,
      "Text": " through legislation that was introduced in 2018, we've defined 11 sectors, within that"
    },
    {
      "Time_Start": 723.3000000000001,
      "Time_End": 730.3000000000001,
      "Text": " there's 22 asset classes. And those assets are required to report to the Australian Government,"
    },
    {
      "Time_Start": 730.3000000000001,
      "Time_End": 735.3000000000001,
      "Text": " their asset holdings, their ownership structure, so we get an understanding of which countries"
    },
    {
      "Time_Start": 735.3000000000001,
      "Time_End": 741.3000000000001,
      "Text": " have the ability to direct operations in Australia's critical infrastructure. They're"
    },
    {
      "Time_Start": 741.3000000000001,
      "Time_End": 748.3000000000001,
      "Text": " also required to mandatorily report cyber incidents, in the same way that the US is"
    },
    {
      "Time_Start": 748.3000000000001,
      "Time_End": 755.3000000000001,
      "Text": " developing CECIA, going through the rule-making process for CECIA, it's a very similar mandatory"
    },
    {
      "Time_Start": 755.3000000000001,
      "Time_End": 762.3000000000001,
      "Text": " reporting obligation, the timeframes are very much aligned. The next element of that is"
    },
    {
      "Time_Start": 762.3000000000001,
      "Time_End": 767.3000000000001,
      "Text": " a requirement to develop a risk management plan, and as part of that risk management"
    },
    {
      "Time_Start": 767.3000000000001,
      "Time_End": 773.3000000000001,
      "Text": " plan, cyber security is a critical element, and we are requiring entities to develop a"
    },
    {
      "Time_Start": 773.3000000000001,
      "Time_End": 779.3000000000001,
      "Text": " plan that uses an internationally recognised framework, so NIST is one of those frameworks"
    },
    {
      "Time_Start": 779.3000000000001,
      "Time_End": 787.3000000000001,
      "Text": " that we allow our asset providers to use. We also have designated some assets to be"
    },
    {
      "Time_Start": 787.3000000000001,
      "Time_End": 793.3000000000001,
      "Text": " systems of national significance, so you might have heard in the US there has been"
    },
    {
      "Time_Start": 793.3000000000001,
      "Time_End": 800.3000000000001,
      "Text": " consideration of introducing legislation that would designate systems SICCI, or systems"
    },
    {
      "Time_Start": 800.3000000000001,
      "Time_End": 807.3000000000001,
      "Text": " of critical importance, and so we have done that for 82 different asset classes, so we've"
    },
    {
      "Time_Start": 807.3000000000001,
      "Time_End": 813.3000000000001,
      "Text": " outlined 950 assets that we consider to be critical infrastructure, and a subset of that"
    },
    {
      "Time_Start": 813.3000000000001,
      "Time_End": 818.3000000000001,
      "Text": " which we consider to be systems of national significance, there's 82 of those, so we are"
    },
    {
      "Time_Start": 818.3000000000001,
      "Time_End": 824.3000000000001,
      "Text": " working with those assets, those operators, to put in place incident response plans, they"
    },
    {
      "Time_Start": 824.3000000000001,
      "Time_End": 829.3000000000001,
      "Text": " will also exercise with relevant agencies, including our Australian Cyber Security Centre,"
    },
    {
      "Time_Start": 829.3000000000001,
      "Time_End": 837.3000000000001,
      "Text": " they will be required to provide systems information where necessary. We also have another obligation"
    },
    {
      "Time_Start": 837.3000000000001,
      "Time_End": 843.3000000000001,
      "Text": " under the legislation which allows for government assistance measures, so that would allow"
    },
    {
      "Time_Start": 843.3000000000001,
      "Time_End": 849.3000000000001,
      "Text": " our government to direct an asset to do a certain thing, or in extremist, in the case"
    },
    {
      "Time_Start": 849.3000000000001,
      "Time_End": 856.3000000000001,
      "Text": " of a near wartime environment, we would direct an asset to do something and potentially take"
    },
    {
      "Time_Start": 856.3000000000001,
      "Time_End": 863.3000000000001,
      "Text": " on responsibility of their system, so we've seen the situation in our region deteriorate,"
    },
    {
      "Time_Start": 863.3000000000001,
      "Time_End": 869.3000000000001,
      "Text": " we understand that there's significant risk to them, and we're on this journey to build"
    },
    {
      "Time_Start": 869.3000000000001,
      "Time_End": 874.3000000000001,
      "Text": " the resilience of our critical infrastructure. It's in its infancy, just this month we'll"
    },
    {
      "Time_Start": 874.3000000000001,
      "Time_End": 879.3000000000001,
      "Text": " be introducing the risk management plan, so we're yet to do a full analysis of what it"
    },
    {
      "Time_Start": 879.3000000000001,
      "Time_End": 884.3000000000001,
      "Text": " looks like and how it has improved the resilience of our critical infrastructure in Australia."
    },
    {
      "Time_Start": 884.3000000000001,
      "Time_End": 890.3000000000001,
      "Text": " I think that's, thank you very much, and I know that there's a lot of different frameworks"
    },
    {
      "Time_Start": 890.3000000000001,
      "Time_End": 895.3000000000001,
      "Text": " that are taking place and under consultation as well, and Peter, I know that there's a"
    },
    {
      "Time_Start": 895.3000000000001,
      "Time_End": 899.3000000000001,
      "Text": " lot of work that's been going on in the European Union, the Parliament, the Cyber Resilience"
    },
    {
      "Time_Start": 899.3000000000001,
      "Time_End": 905.3000000000001,
      "Text": " Act, and also other big pieces of legislation there, which would be great to hear your views,"
    },
    {
      "Time_Start": 905.3000000000001,
      "Time_End": 910.3000000000001,
      "Text": " particularly on that process of catching up on those existing technologies."
    },
    {
      "Time_Start": 911.3000000000001,
      "Time_End": 920.3000000000001,
      "Text": " Sure. Yeah, so firstly, just as a preliminary remark, it's important to understand the way"
    },
    {
      "Time_Start": 920.3000000000001,
      "Time_End": 926.3000000000001,
      "Text": " the European Union is established, it legislates in areas where individual member states within"
    },
    {
      "Time_Start": 926.3000000000001,
      "Time_End": 930.3000000000001,
      "Text": " the European Union have given it authority to work together on behalf of all of the member"
    },
    {
      "Time_Start": 930.3000000000001,
      "Time_End": 936.3000000000001,
      "Text": " states. Technically, there is no reference in any of the EU treaties to cyber security"
    },
    {
      "Time_Start": 936.3000000000001,
      "Time_End": 941.3000000000001,
      "Text": " being a policy area that the EU is allowed to work on, so there's been some sort of delicate"
    },
    {
      "Time_Start": 941.3000000000001,
      "Time_End": 946.3000000000001,
      "Text": " footwork over the last 10 years to try and identify areas where the European Union can"
    },
    {
      "Time_Start": 946.3000000000001,
      "Time_End": 953.3000000000001,
      "Text": " act. We've had NIS and NIS2, the two Cyber Security Acts, which established and improved"
    },
    {
      "Time_Start": 953.3000000000001,
      "Time_End": 959.3000000000001,
      "Text": " the European Agency for Cyber Security, ANISA, and there's also with the Cyber Resilience"
    },
    {
      "Time_Start": 959.3000000000001,
      "Time_End": 968.3000000000001,
      "Text": " Act, particularly, given a basis for legislating on issues regarding a sort of common approach"
    },
    {
      "Time_Start": 968.3000000000001,
      "Time_End": 977.3000000000001,
      "Text": " across the European Union for the market of sale and availability of goods which have"
    },
    {
      "Time_Start": 977.3000000000001,
      "Time_End": 983.3000000000001,
      "Text": " cyber security implications. The reason I mention that is because a lot of things like"
    },
    {
      "Time_Start": 983.3000000000001,
      "Time_End": 988.3000000000001,
      "Text": " critical infrastructure, for example, are exclusively national competencies of which"
    },
    {
      "Time_Start": 988.3000000000001,
      "Time_End": 995.3000000000001,
      "Text": " the European Union doesn't itself have any competencies except for on a coordination"
    },
    {
      "Time_Start": 995.3000000000001,
      "Time_End": 1000.3000000000001,
      "Text": " basis. I think in terms of the substance of legislative work, we've taken what we call"
    },
    {
      "Time_Start": 1000.3000000000001,
      "Time_End": 1008.3000000000001,
      "Text": " a sort of ecosystem approach, recognising that this increasingly complex ecosystem of"
    },
    {
      "Time_Start": 1008.3000000000001,
      "Time_End": 1015.3000000000001,
      "Text": " devices, services, interfaces between digital systems and the real world, the data that's"
    },
    {
      "Time_Start": 1015.3000000000001,
      "Time_End": 1021.3000000000001,
      "Text": " driving and feeding those systems, the software, the algorithms, the learning models and everything"
    },
    {
      "Time_Start": 1021.3000000000001,
      "Time_End": 1031.3000000000002,
      "Text": " else, together represent both an opportunity and a threat and a risk to having real world"
    },
    {
      "Time_Start": 1031.3000000000002,
      "Time_End": 1036.3000000000002,
      "Text": " impacts, either to citizens, to infrastructure, to people and services in the real world."
    },
    {
      "Time_Start": 1036.3000000000002,
      "Time_End": 1042.3000000000002,
      "Text": " And that sort of ecosystem approach underpins the work that's being put forward in the Cyber"
    },
    {
      "Time_Start": 1042.3,
      "Time_End": 1046.3,
      "Text": " Resilience Act, which itself is one piece of legislation alongside others that have"
    },
    {
      "Time_Start": 1046.3,
      "Time_End": 1055.3,
      "Text": " gone through this current legislature of the Parliament, including NIST 2, the EIDAS,"
    },
    {
      "Time_Start": 1055.3,
      "Time_End": 1063.3,
      "Text": " which is the European E-Identity Scheme, the AI Act, the Data Act, the Data Governance"
    },
    {
      "Time_Start": 1063.3,
      "Time_End": 1069.3,
      "Text": " Act and various other pieces of primary legislation coming out of the EU. I won't go into all"
    },
    {
      "Time_Start": 1069.3,
      "Time_End": 1074.3,
      "Text": " of those because it's just a vast area, but just pick out a few points of relevance, I think,"
    },
    {
      "Time_Start": 1074.3,
      "Time_End": 1083.3,
      "Text": " on the Cyber Resilience Act. Despite its name, it's really looking at that domain of connected"
    },
    {
      "Time_Start": 1083.3,
      "Time_End": 1091.3,
      "Text": " devices. The lawyers deliberately didn't want to talk specifically about IoT, but again,"
    },
    {
      "Time_Start": 1091.3,
      "Time_End": 1097.3,
      "Text": " it's that sort of part of that broader ecosystem of the interfaces with the real world and"
    },
    {
      "Time_Start": 1097.3,
      "Time_End": 1103.3,
      "Text": " the services and systems and software behind those that directly interact with those actuator"
    },
    {
      "Time_Start": 1103.3,
      "Time_End": 1110.3,
      "Text": " sensors and IoT devices. The general approach, which I think Bryony mentioned as well from"
    },
    {
      "Time_Start": 1110.3,
      "Time_End": 1118.3,
      "Text": " the UK government approach, is largely a risk-based one, where we've classified different"
    },
    {
      "Time_Start": 1118.3,
      "Time_End": 1122.3,
      "Text": " products and services on the market according to an initial evaluation of what the risk"
    },
    {
      "Time_Start": 1122.3,
      "Time_End": 1130.3,
      "Text": " levels are, the lowest risk being you're good with your product as it is at the moment."
    },
    {
      "Time_Start": 1130.3,
      "Time_End": 1135.3,
      "Text": " We then have two regulated classes, the Class 1 products and services, which are those which"
    },
    {
      "Time_Start": 1135.3,
      "Time_End": 1140.3,
      "Text": " are considered lower risk but nonetheless present a risk, which is where we are looking"
    },
    {
      "Time_Start": 1140.3,
      "Time_End": 1145.3,
      "Text": " for what will be called the European Union Declaration of Conformity, so similar to the"
    },
    {
      "Time_Start": 1145.3,
      "Time_End": 1150.3,
      "Text": " SDOC that you see in a number of other countries, and then the Class 2, which is the higher"
    },
    {
      "Time_Start": 1150.3,
      "Time_End": 1159.3,
      "Text": " risk, which requires a third-party certified conformity assessment to be done."
    },
    {
      "Time_Start": 1159.3,
      "Time_End": 1166.3,
      "Text": " The Act itself is broken down into areas covering the security requirements, sort of minimum"
    },
    {
      "Time_Start": 1166.3,
      "Time_End": 1173.3,
      "Text": " security requirements, and I think they're very, very similar to the UK government's"
    },
    {
      "Time_Start": 1173.3,
      "Time_End": 1181.3,
      "Text": " approach there, requiring that products come on the market are secure and patchable and"
    },
    {
      "Time_Start": 1181.3,
      "Time_End": 1187.3,
      "Text": " patched through the declared lifecycle of the product. So if someone says, we think"
    },
    {
      "Time_Start": 1187.3,
      "Time_End": 1193.3,
      "Text": " this product's going to be on the market for 10 years, they've got to assess, attest"
    },
    {
      "Time_Start": 1193.3,
      "Time_End": 1198.3,
      "Text": " to and have an assessment that their products are indeed being maintained, patched, updated"
    },
    {
      "Time_Start": 1198.3,
      "Time_End": 1206.3,
      "Text": " and whatever, for the entirety of that lifecycle. That no product comes onto the, I have to"
    },
    {
      "Time_Start": 1206.3,
      "Time_End": 1211.3,
      "Text": " say this with a straight face in this audience and in this event, but does come onto the"
    },
    {
      "Time_Start": 1211.3,
      "Time_End": 1219.3,
      "Text": " market with no exploitable vulnerabilities. Good luck with enforcing that one."
    },
    {
      "Time_Start": 1219.3,
      "Time_End": 1226.3,
      "Text": " Exploitable vulnerabilities, not known exploited vulnerabilities, but as a political statement,"
    },
    {
      "Time_Start": 1226.3,
      "Time_End": 1232.3,
      "Text": " it's a good starting point to come from. Interestingly, and I think this is where"
    },
    {
      "Time_Start": 1232.3,
      "Time_End": 1237.3,
      "Text": " there's a bit of a difference and we move ahead of legislatures elsewhere in the world,"
    },
    {
      "Time_Start": 1237.3,
      "Time_End": 1244.3,
      "Text": " is two things about updates and patching. One is requiring manufacturers to have two"
    },
    {
      "Time_Start": 1244.3,
      "Time_End": 1250.3,
      "Text": " paths for updates, one for security updates and one for functional updates, allowing and"
    },
    {
      "Time_Start": 1250.3,
      "Time_End": 1255.3,
      "Text": " actually by default, ensuring that security updates are on by default and don't require"
    },
    {
      "Time_Start": 1255.3,
      "Time_End": 1260.3,
      "Text": " user consent, whereas functional updates should be separated out and have a possibility for"
    },
    {
      "Time_Start": 1260.3,
      "Time_End": 1267.3,
      "Text": " the user of the device or service to determine whether or not to update the functionality,"
    },
    {
      "Time_Start": 1267.3,
      "Time_End": 1271.3,
      "Text": " but to separate the two out. And I think that's an interesting element, whether it's, again,"
    },
    {
      "Time_Start": 1271.3,
      "Time_End": 1277.3,
      "Text": " whether it'll hold to the test of time, we will see."
    },
    {
      "Time_Start": 1277.3,
      "Time_End": 1283.3,
      "Text": " The second one is the idea of, and I think many of us have seen that in operational environments"
    },
    {
      "Time_Start": 1283.3,
      "Time_End": 1289.3,
      "Text": " where you want to sort of default back to a factory reset. You're not sure about the"
    },
    {
      "Time_Start": 1289.3,
      "Time_End": 1295.3,
      "Text": " vulnerability of something, so you want to go back to a starting point, but requiring"
    },
    {
      "Time_Start": 1296.3,
      "Time_End": 1302.3,
      "Text": " that you can do a factory reset together with all of the security updates that have been"
    },
    {
      "Time_Start": 1302.3,
      "Time_End": 1307.3,
      "Text": " implemented up to date. So you may be able to have a situation where a product has been"
    },
    {
      "Time_Start": 1307.3,
      "Time_End": 1312.3,
      "Text": " securely and safely updated and those updates are, the security updates are maintained,"
    },
    {
      "Time_Start": 1312.3,
      "Time_End": 1317.3,
      "Text": " but you want to default back to the original settings for many of the other aspects. And"
    },
    {
      "Time_Start": 1317.3,
      "Time_End": 1321.3,
      "Text": " I think that was another interesting aspect."
    },
    {
      "Time_Start": 1321.3,
      "Time_End": 1327.3,
      "Text": " The other thing is, unlike in cybersecurity legislation elsewhere, and because of that"
    },
    {
      "Time_Start": 1327.3,
      "Time_End": 1334.3,
      "Text": " bigger ecosystem that I talked about, the Cyber Resilience Act also covers issues about"
    },
    {
      "Time_Start": 1334.3,
      "Time_End": 1341.3,
      "Text": " confidentiality, integrity, and availability of the data and requirements that data, particularly"
    },
    {
      "Time_Start": 1341.3,
      "Time_End": 1349.3,
      "Text": " personal data, is compliant with the more well-known GDPR, the data protection regulation"
    },
    {
      "Time_Start": 1349.3,
      "Time_End": 1358.3,
      "Text": " of the EU, but also a number of rules governing the use of data by those devices and by the"
    },
    {
      "Time_Start": 1358.3,
      "Time_End": 1364.3,
      "Text": " services around those devices. I think I'll leave it there at this stage. I mean, I'll"
    },
    {
      "Time_Start": 1364.3,
      "Time_End": 1365.3,
      "Text": " say, broader conversation."
    },
    {
      "Time_Start": 1365.3,
      "Time_End": 1370.3,
      "Text": " So one thing for me that's interesting is the relationship just on the IoT side to the"
    },
    {
      "Time_Start": 1370.3,
      "Time_End": 1373.3,
      "Text": " role of standards and how they face the EU. Would that be interesting?"
    },
    {
      "Time_Start": 1373.3,
      "Time_End": 1377.3,
      "Text": " Yeah, indeed. So when I mentioned about the Class 1 and Class 2 products, the Class 2"
    },
    {
      "Time_Start": 1377.3,
      "Time_End": 1382.3,
      "Text": " products are the ones which require a conformity assessment. And to do the conformity assessment,"
    },
    {
      "Time_Start": 1382.3,
      "Time_End": 1388.3,
      "Text": " you need to have standards against which you're making an assessment and doing a certification."
    },
    {
      "Time_Start": 1388.3,
      "Time_End": 1395.3,
      "Text": " The problem we have there, and it's both a sort of geopolitical battle as well as a purely"
    },
    {
      "Time_Start": 1395.3,
      "Time_End": 1401.3,
      "Text": " standards technical battle, is there isn't really a lot in the standards world that we"
    },
    {
      "Time_Start": 1401.3,
      "Time_End": 1406.3,
      "Text": " can base ourselves on as a starting point. And what they've taken is, okay, there is"
    },
    {
      "Time_Start": 1406.3,
      "Time_End": 1412.3,
      "Text": " a European standard, the ETSI 303645, which I think other people have referenced. But"
    },
    {
      "Time_Start": 1412.3,
      "Time_End": 1421.3,
      "Text": " beyond that, and this isn't an issue limited to the Cyber Resilience Act, it's more a general"
    },
    {
      "Time_Start": 1421.3,
      "Time_End": 1426.3,
      "Text": " principle about EU legislation, that when standards and conformity assessment are required,"
    },
    {
      "Time_Start": 1426.3,
      "Time_End": 1434.3,
      "Text": " there is a very laborious and Eurocentric approach to standardization, which requires"
    },
    {
      "Time_Start": 1434.3,
      "Time_End": 1440.3,
      "Text": " firstly that the European standards bodies are given instructions to do a sort of survey"
    },
    {
      "Time_Start": 1440.3,
      "Time_End": 1446.3,
      "Text": " of what standards may be in place and available that conform with or that align with the requirements"
    },
    {
      "Time_Start": 1446.3,
      "Time_End": 1451.3,
      "Text": " of a particular piece of legislation, only then determining whether there are international"
    },
    {
      "Time_Start": 1451.3,
      "Time_End": 1459.3,
      "Text": " standards through ISO, IEC, ITU, that fulfill the requirements of the legislation. But more"
    },
    {
      "Time_Start": 1459.3,
      "Time_End": 1464.3,
      "Text": " often than not, we see in its practice that the European Parliament's been trying to push"
    },
    {
      "Time_Start": 1464.3,
      "Time_End": 1469.3,
      "Text": " back a bit on, which is the European Commission as our executive branch, sort of defaults,"
    },
    {
      "Time_Start": 1469.3,
      "Time_End": 1473.3,
      "Text": " it's sort of knee-jerk reaction is if we need standards, we go immediately to the European"
    },
    {
      "Time_Start": 1473.3,
      "Time_End": 1478.3,
      "Text": " standards body and create something new, which may already have been created or established"
    },
    {
      "Time_Start": 1478.3,
      "Time_End": 1482.3,
      "Text": " elsewhere. So there are some, let's say, some geopolitics involved in that, it's not just"
    },
    {
      "Time_Start": 1482.3,
      "Time_End": 1484.3,
      "Text": " purely technical issues."
    },
    {
      "Time_Start": 1484.3,
      "Time_End": 1487.3,
      "Text": " I think it's really interesting on the standards bodies, because that's something that, again,"
    },
    {
      "Time_Start": 1487.3,
      "Time_End": 1492.3,
      "Text": " that the UK government, when it was helping to deliver the Product Security and Infrastructure"
    },
    {
      "Time_Start": 1492.3,
      "Time_End": 1497.3,
      "Text": " Act, was helping to think about how it can recognize and refer to existing technical"
    },
    {
      "Time_Start": 1497.3,
      "Time_End": 1502.3,
      "Text": " standards and make sure that they are embedded or referred to in the way that regulation"
    },
    {
      "Time_Start": 1502.3,
      "Time_End": 1507.3,
      "Text": " is drafted. And of course, to make sure those have been updatable, because to try and resolve"
    },
    {
      "Time_Start": 1507.3,
      "Time_End": 1511.3,
      "Text": " an issue where you just refer to something which has become obsolete. And I think within"
    },
    {
      "Time_Start": 1511.3,
      "Time_End": 1516.3,
      "Text": " the standards body, something that I've seen on IoT specifically, is a lot of organizations"
    },
    {
      "Time_Start": 1516.3,
      "Time_End": 1519.3,
      "Text": " are starting to map out the relationship between the existing standards bodies and"
    },
    {
      "Time_Start": 1519.3,
      "Time_End": 1525.3,
      "Text": " the outcomes and the terms within it. So to try and diffuse that geopolitical issue, where"
    },
    {
      "Time_Start": 1525.3,
      "Time_End": 1530.3,
      "Text": " people feel like, okay, we have to go with this one because it has this particular association"
    },
    {
      "Time_Start": 1530.3,
      "Time_End": 1534.3,
      "Text": " and actually try to move to say, well, actually, there's kind of universal consensus around"
    },
    {
      "Time_Start": 1534.3,
      "Time_End": 1539.3,
      "Text": " these particular points. And that, I think, is something that is a view that we're looking"
    },
    {
      "Time_Start": 1539.3,
      "Time_End": 1542.3,
      "Text": " to aim towards as sort of helping on that front."
    },
    {
      "Time_Start": 1542.3,
      "Time_End": 1549.3,
      "Text": " Yeah. And I think, just to round out that, I'm speaking purely in personal capacity here"
    },
    {
      "Time_Start": 1549.3,
      "Time_End": 1554.3,
      "Text": " as someone who's been working in standards work as well about the last 30 years. Standards"
    },
    {
      "Time_Start": 1554.3,
      "Time_End": 1562.3,
      "Text": " are not a tool for regulation. They can help underpin it. But neither are they an alternative"
    },
    {
      "Time_Start": 1562.3,
      "Time_End": 1567.3,
      "Text": " to regulation. For me, I've always seen sort of standards being a sort of bedrock foundation"
    },
    {
      "Time_Start": 1567.3,
      "Time_End": 1573.3,
      "Text": " in which regulation, business-to-business agreements, and other sorts of deals can be"
    },
    {
      "Time_Start": 1573.3,
      "Time_End": 1579.3,
      "Text": " done, where you're agreeing a common basis to do that. What we have seen historically"
    },
    {
      "Time_Start": 1579.3,
      "Time_End": 1584.3,
      "Text": " is, for a lot of areas of legislation in the European Union, standards have been developed"
    },
    {
      "Time_Start": 1584.3,
      "Time_End": 1591.3,
      "Text": " as a tool to implement legislation, rather than looking at the sort of panoply of standards"
    },
    {
      "Time_Start": 1592.3,
      "Time_End": 1597.3,
      "Text": " available and say, well, actually, the requirements in this standard or this standard meet 90%"
    },
    {
      "Time_Start": 1597.3,
      "Time_End": 1601.3,
      "Text": " of our requirements. So we don't need to go out and build something new. And for the 10%"
    },
    {
      "Time_Start": 1601.3,
      "Time_End": 1605.3,
      "Text": " that's missing, we will do whatever's necessary to build that up. And trying to get into that"
    },
    {
      "Time_Start": 1605.3,
      "Time_End": 1612.3,
      "Text": " mindset of using and reusing existing standards is becoming increasingly important in that"
    },
    {
      "Time_Start": 1612.3,
      "Time_End": 1617.3,
      "Text": " international cooperation. I mentioned about it, but the Trade and Technology Council,"
    },
    {
      "Time_Start": 1617.3,
      "Time_End": 1623.3,
      "Text": " which is a big political corporation between the EU and the US, one of the streams of"
    },
    {
      "Time_Start": 1623.3,
      "Time_End": 1631.3,
      "Text": " that work, and we've seen that elsewhere in Quad Alliance, in APEC, in the India-EU"
    },
    {
      "Time_Start": 1631.3,
      "Time_End": 1638.3,
      "Text": " Trade and Technology environment and others, is recognizing that if you're going to trade"
    },
    {
      "Time_Start": 1638.3,
      "Time_End": 1646.3,
      "Text": " and improve the markets across those geopolitical boundaries, it's easier to do that if you're"
    },
    {
      "Time_Start": 1646.3,
      "Time_End": 1652.3,
      "Text": " working on the added basis of conforming to agreed and common standards, which everybody's used."
    },
    {
      "Time_Start": 1652.3,
      "Time_End": 1657.3,
      "Text": " I think there's another thing just on that point, and we will move on, I promise, but"
    },
    {
      "Time_Start": 1657.3,
      "Time_End": 1663.3,
      "Text": " just on the role of recommendations from international organizations. So I know this is something"
    },
    {
      "Time_Start": 1663.3,
      "Time_End": 1667.3,
      "Text": " which, again, it's not just the role of technical standards, and there's also, particularly"
    },
    {
      "Time_Start": 1667.3,
      "Time_End": 1672.3,
      "Text": " for countries not for the United Kingdom, but for others as well, is how can we, how"
    },
    {
      "Time_Start": 1672.3,
      "Time_End": 1677.3,
      "Text": " can international organizations play a role to help share good practice recommendations"
    },
    {
      "Time_Start": 1677.3,
      "Time_End": 1681.3,
      "Text": " that can then be used by countries that don't have necessarily the same level of cyber capacity?"
    },
    {
      "Time_Start": 1681.3,
      "Time_End": 1686.3,
      "Text": " So the OECD recently published a series of recommendations around management vulnerabilities"
    },
    {
      "Time_Start": 1686.3,
      "Time_End": 1691.3,
      "Text": " and also on the management of product security, so those have been helpful in terms of, they've"
    },
    {
      "Time_Start": 1691.3,
      "Time_End": 1695.3,
      "Text": " gone through a process where they've been ratified by the 30 member states, and of course"
    },
    {
      "Time_Start": 1695.3,
      "Time_End": 1699.3,
      "Text": " they don't go into the technical detail that you would expect in a technical standard,"
    },
    {
      "Time_Start": 1699.3,
      "Time_End": 1703.3,
      "Text": " but it is a helpful sort of starting point and a helpful tool to share in terms of that"
    },
    {
      "Time_Start": 1703.3,
      "Time_End": 1706.3,
      "Text": " capacity building for countries maybe where you don't have the level of resource that"
    },
    {
      "Time_Start": 1706.3,
      "Time_End": 1709.3,
      "Text": " you would have in, say, the United Kingdom or the European Union or the United States"
    },
    {
      "Time_Start": 1709.3,
      "Time_End": 1715.3,
      "Text": " or Australia. And I know that Ori has done a huge amount of work as well in his role"
    },
    {
      "Time_Start": 1715.3,
      "Time_End": 1719.3,
      "Text": " with Latin American countries. We know, of course, Costa Rica had a devastating attack"
    },
    {
      "Time_Start": 1719.3,
      "Time_End": 1724.3,
      "Text": " in the northern distant past, and it would be really helpful, Ori, if you could share"
    },
    {
      "Time_Start": 1724.3,
      "Time_End": 1728.3,
      "Text": " some of your insights working in Latin America, and then also you were saying that in Kenya"
    },
    {
      "Time_Start": 1728.3,
      "Time_End": 1731.3,
      "Text": " and Africa as well, it would be fantastic to hear from you as well."
    },
    {
      "Time_Start": 1731.3,
      "Time_End": 1737.3,
      "Text": " Yeah, I first want to comment on this point that you use this term, countries that have"
    },
    {
      "Time_Start": 1737.3,
      "Time_End": 1744.3,
      "Text": " less capacity, and I think it's important to point out that that's not always just Latin"
    },
    {
      "Time_Start": 1744.3,
      "Time_End": 1750.3,
      "Text": " America or African countries. I mean, when I was in government, we met with the Norwegian"
    },
    {
      "Time_Start": 1750.3,
      "Time_End": 1757.3,
      "Text": " military, and one of the lead civilians there said, you know, I don't think you guys realize"
    },
    {
      "Time_Start": 1757.3,
      "Time_End": 1762.3,
      "Text": " how much impact you guys actually have on the rest of the world when you put out a new"
    },
    {
      "Time_Start": 1762.3,
      "Time_End": 1766.3,
      "Text": " policy. And I said, yeah, no, we really think about what issues we want to lead on and how"
    },
    {
      "Time_Start": 1766.3,
      "Time_End": 1774.3,
      "Text": " we do it. She said, no, Ori, you really, when you put out a policy, we translate that policy"
    },
    {
      "Time_Start": 1774.3,
      "Time_End": 1780.3,
      "Text": " directly into Norwegian, and then we take the cover page off, and we put our cover page"
    },
    {
      "Time_Start": 1780.3,
      "Time_End": 1787.3,
      "Text": " on, and that's our policy, right? And I think that that, I mean, I think the UK has some"
    },
    {
      "Time_Start": 1787.3,
      "Time_End": 1792.3,
      "Text": " of that impact as well, and Australia probably regionally. That's what the EU wants, right?"
    },
    {
      "Time_Start": 1792.3,
      "Time_End": 1797.3,
      "Text": " That's the kind of impact the EU wants, and that's part of the standards, the geopolitical"
    },
    {
      "Time_Start": 1797.3,
      "Time_End": 1805.3,
      "Text": " kind of overview here. I mean, US is usually standardizing before and then bringing it to"
    },
    {
      "Time_Start": 1805.3,
      "Time_End": 1812.3,
      "Text": " the international arena and then pointing to an international standard in most cases,"
    },
    {
      "Time_Start": 1812.3,
      "Time_End": 1816.3,
      "Text": " which is one of the reasons the EU wants to work around it, but we can go into some of that"
    },
    {
      "Time_Start": 1816.3,
      "Time_End": 1821.3,
      "Text": " more later on, but I think that that's, you know, some of the idea here. But that's Norway,"
    },
    {
      "Time_Start": 1821.3,
      "Time_End": 1827.3,
      "Text": " right? Norway's a very wealthy country. They just don't have the capacity to have the kind"
    },
    {
      "Time_Start": 1827.3,
      "Time_End": 1835.3,
      "Text": " of policies that the UK, the US, Australia do, and maybe Germany, France, some of the EU"
    },
    {
      "Time_Start": 1835.3,
      "Time_End": 1843.3,
      "Text": " countries do, which is interesting in that way. I think that we have seen Latin America"
    },
    {
      "Time_Start": 1843.3,
      "Time_End": 1847.3,
      "Text": " basically take a similar approach to some of these things, especially as it relates to"
    },
    {
      "Time_Start": 1847.3,
      "Time_End": 1851.3,
      "Text": " what they tell their agencies to do, but then the agencies themselves don't have the ability"
    },
    {
      "Time_Start": 1851.3,
      "Time_End": 1856.3,
      "Text": " to follow those policies that US agencies do. So they have these policies like, you know,"
    },
    {
      "Time_Start": 1856.3,
      "Time_End": 1863.3,
      "Text": " Mexico put together, and Brazil both put together cyber strategies over the years, and they're"
    },
    {
      "Time_Start": 1863.3,
      "Time_End": 1869.3,
      "Text": " very detailed, and they look a lot like the US strategies do, but do they have the ability"
    },
    {
      "Time_Start": 1869.3,
      "Time_End": 1875.3,
      "Text": " to implement them? And so we've seen these countries do that. Usually, and this is kind"
    },
    {
      "Time_Start": 1875.3,
      "Time_End": 1881.3,
      "Text": " of the big trend in the region, is usually cybersecurity has been run out of the ICT"
    },
    {
      "Time_Start": 1881.3,
      "Time_End": 1889.3,
      "Text": " unit, which might do regulation and internal controls, or the CIO's office, you know,"
    },
    {
      "Time_Start": 1889.3,
      "Time_End": 1897.3,
      "Text": " a federal CIO for federal agencies, and that's who runs it. Costa Rica had this huge breach"
    },
    {
      "Time_Start": 1897.3,
      "Time_End": 1903.3,
      "Text": " last year, which was a ransomware attack, shut down the government. It was like right"
    },
    {
      "Time_Start": 1903.3,
      "Time_End": 1907.3,
      "Text": " at the time of the presidential election. It was a total disaster for the country. They"
    },
    {
      "Time_Start": 1907.3,
      "Time_End": 1912.3,
      "Text": " still have not recovered. They're still, a lot of the agencies are still offline. The"
    },
    {
      "Time_Start": 1912.3,
      "Time_End": 1918.3,
      "Text": " US gave them $25 million, and a plan that came from MITRE and Carnegie Mellon about"
    },
    {
      "Time_Start": 1918.3,
      "Time_End": 1923.3,
      "Text": " how to respond to it, and they're still working their way through that in Costa Rica right"
    },
    {
      "Time_Start": 1923.3,
      "Time_End": 1929.3,
      "Text": " now. $25 million has turned out not to be enough for them, even with that. To go forward,"
    },
    {
      "Time_Start": 1929.3,
      "Time_End": 1933.3,
      "Text": " they just don't have the internal expertise to be able to deal with this kind of situation."
    },
    {
      "Time_Start": 1933.3,
      "Time_End": 1940.3,
      "Text": " And we're seeing that other places in Latin, that really made, had a big impact in the"
    },
    {
      "Time_Start": 1940.3,
      "Time_End": 1948.3,
      "Text": " rest of Latin America. Mexico also last year had an incident, which they call a Guacamaya"
    },
    {
      "Time_Start": 1948.3,
      "Time_End": 1957.3,
      "Text": " breach, and that led the president there basically to say the same, say publicly, we just don't"
    },
    {
      "Time_Start": 1957.3,
      "Time_End": 1961.3,
      "Text": " have the expertise in the country, which is something that a lot of people, that a"
    },
    {
      "Time_Start": 1961.3,
      "Time_End": 1966.3,
      "Text": " lot of us that have worked with Mexico knew, but they had not been admitted publicly before."
    },
    {
      "Time_Start": 1966.3,
      "Time_End": 1970.3,
      "Text": " They want to now build a cybersecurity agency there. We see the same thing in Brazil, as"
    },
    {
      "Time_Start": 1970.3,
      "Time_End": 1974.3,
      "Text": " I said, where they want to, where there's talk about, there's legislation to do, to"
    },
    {
      "Time_Start": 1974.3,
      "Time_End": 1980.3,
      "Text": " have a cybersecurity agency. Columbia also is talking about building a new cybersecurity"
    },
    {
      "Time_Start": 1980.3,
      "Time_End": 1984.3,
      "Text": " agency in a similar way. It has not passed yet. People thought that it was going to,"
    },
    {
      "Time_Start": 1984.3,
      "Time_End": 1988.3,
      "Text": " and it did not get to that point. But Chile seems to be the first that actually is going"
    },
    {
      "Time_Start": 1988.3,
      "Time_End": 1993.3,
      "Text": " to get it through and move forward with that idea. Will it work for them? We hope that"
    },
    {
      "Time_Start": 1993.3,
      "Time_End": 1999.3,
      "Text": " it will help them bring more of a workforce and a structured approach to it that's not"
    },
    {
      "Time_Start": 1999.3,
      "Time_End": 2006.3,
      "Text": " just a kind of follow-on to IT, IT management. Some people are looking at this from a real"
    },
    {
      "Time_Start": 2006.3,
      "Time_End": 2011.3,
      "Text": " true security point of view, and bringing in and building a workforce that can do the"
    },
    {
      "Time_Start": 2011.3,
      "Time_End": 2016.3,
      "Text": " work inside the country. So I think that's what we're seeing in the region. There's other"
    },
    {
      "Time_Start": 2016.3,
      "Time_End": 2020.3,
      "Text": " trends, too, but I think that's the one that probably makes the most sense to go over,"
    },
    {
      "Time_Start": 2020.3,
      "Time_End": 2026.3,
      "Text": " since we've seen so many different countries now take that same path."
    },
    {
      "Time_Start": 2026.3,
      "Time_End": 2037.3,
      "Text": " Africa is not in the same place. I mean, we have seen recently, this year, Kenya had an"
    },
    {
      "Time_Start": 2037.3,
      "Time_End": 2043.3,
      "Text": " incident that they had a lot of trouble recovering from as well. There's still some signs that"
    },
    {
      "Time_Start": 2043.3,
      "Time_End": 2049.3,
      "Text": " they're past it at this point, but it took them a long time to get to there. And they're"
    },
    {
      "Time_Start": 2049.3,
      "Time_End": 2054.3,
      "Text": " like the most advanced, I don't want to say number one, I don't have a ranking to go by"
    },
    {
      "Time_Start": 2054.3,
      "Time_End": 2059.3,
      "Text": " here, of African countries, but are the ones that we've worked with. They're very, very"
    },
    {
      "Time_Start": 2059.3,
      "Time_End": 2064.3,
      "Text": " high up, and have more of a workforce than other African countries do, but yet they haven't"
    },
    {
      "Time_Start": 2065.3,
      "Time_End": 2070.3,
      "Text": " been able to respond to this incident, and they were not prepared for it. Other African"
    },
    {
      "Time_Start": 2070.3,
      "Time_End": 2078.3,
      "Text": " countries not prepared at all. So we're hoping that the silver lining from the Kenya incident,"
    },
    {
      "Time_Start": 2078.3,
      "Time_End": 2083.3,
      "Text": " similar to what we saw in Costa Rica, that there can be this kind of public awakening"
    },
    {
      "Time_Start": 2083.3,
      "Time_End": 2090.3,
      "Text": " around this from the politicians on this, that they need to put more resources around."
    },
    {
      "Time_Start": 2090.3,
      "Time_End": 2098.3,
      "Text": " And in this case, ask Europe and the U.S. for resources to be able to help them build"
    },
    {
      "Time_Start": 2098.3,
      "Time_End": 2105.3,
      "Text": " cyber defenses the same way that they ask to build physical defenses. So that's where we are."
    },
    {
      "Time_Start": 2105.3,
      "Time_End": 2109.3,
      "Text": " Thanks, Larry. I think you raised really important points about the importance of workforce"
    },
    {
      "Time_Start": 2109.3,
      "Time_End": 2115.3,
      "Text": " strategy, or workforce issues, and how important it is for countries to have that pipeline"
    },
    {
      "Time_Start": 2115.3,
      "Time_End": 2120.3,
      "Text": " of expertise to be able to build resilience within the country. And I think hopefully"
    },
    {
      "Time_Start": 2120.3,
      "Time_End": 2124.3,
      "Text": " we'll get a chance to talk about that a bit later. And I think also, in terms of your"
    },
    {
      "Time_Start": 2124.3,
      "Time_End": 2129.3,
      "Text": " point about strategies being beautiful and generated, and a very nice document, but then"
    },
    {
      "Time_Start": 2129.3,
      "Time_End": 2133.3,
      "Text": " in terms of the implementation within that, difficult to track. Again, which comes back"
    },
    {
      "Time_Start": 2133.3,
      "Time_End": 2138.3,
      "Text": " to the expertise point, but also how do we make sure that, I think if countries are now"
    },
    {
      "Time_Start": 2138.3,
      "Time_End": 2142.3,
      "Text": " getting to a point of recognizing the important role of having a national cyber security strategy,"
    },
    {
      "Time_Start": 2142.3,
      "Time_End": 2147.3,
      "Text": " how can we make sure that they continue to have impact and don't become a kind of beautiful"
    },
    {
      "Time_Start": 2147.3,
      "Time_End": 2148.3,
      "Text": " document that sits on a shelf?"
    },
    {
      "Time_Start": 2148.3,
      "Time_End": 2152.3,
      "Text": " Right. I mean, one thing that's important, I think there was a time in 2017 when Mexico"
    },
    {
      "Time_Start": 2152.3,
      "Time_End": 2157.3,
      "Text": " had the federal police right there strategy, and it was very, very militaristic. The first"
    },
    {
      "Time_Start": 2157.3,
      "Time_End": 2162.3,
      "Text": " draft was very militaristic, and made a lot of people really uncomfortable inside the"
    },
    {
      "Time_Start": 2162.3,
      "Time_End": 2166.3,
      "Text": " country, especially because they had had so many problems with activists and going after"
    },
    {
      "Time_Start": 2166.3,
      "Time_End": 2171.3,
      "Text": " activists, and a lot of concern over it. And they came and they, to give them some credit,"
    },
    {
      "Time_Start": 2171.3,
      "Time_End": 2174.3,
      "Text": " they redid it, and they actually went and they looked at other strategies around the"
    },
    {
      "Time_Start": 2174.3,
      "Time_End": 2178.3,
      "Text": " world, and how they did it, and made it so that it was focused on engaging industry,"
    },
    {
      "Time_Start": 2178.3,
      "Time_End": 2184.3,
      "Text": " and there was a study at the time that was done looking at what industry looked like"
    },
    {
      "Time_Start": 2184.3,
      "Time_End": 2188.3,
      "Text": " in Mexico, and where they needed to improve. But I still think that in the end, that strategy"
    },
    {
      "Time_Start": 2188.3,
      "Time_End": 2193.3,
      "Text": " was still something that was unrealistic for them to implement, given the workforce, which"
    },
    {
      "Time_Start": 2193.3,
      "Time_End": 2194.3,
      "Text": " goes to your point."
    },
    {
      "Time_Start": 2195.3,
      "Time_End": 2202.3,
      "Text": " And I think, so bringing it back now to the UK, Australia, and Europe, I think, of course,"
    },
    {
      "Time_Start": 2202.3,
      "Time_End": 2207.3,
      "Text": " there's been a lot of work that's been happening, a lot of sort of development of these capacity,"
    },
    {
      "Time_Start": 2207.3,
      "Time_End": 2211.3,
      "Text": " a lot of work, you know, creating, when I joined the cyber team in DCMS, I think there"
    },
    {
      "Time_Start": 2211.3,
      "Time_End": 2215.3,
      "Text": " was sort of 30 people, and by the time I left, it was about 200. So, you know, we saw a huge"
    },
    {
      "Time_Start": 2215.3,
      "Time_End": 2219.3,
      "Text": " growth in the level of resource needed to help work on these different initiatives that"
    },
    {
      "Time_Start": 2219.3,
      "Time_End": 2224.3,
      "Text": " were taking place. And I think, you know, that we now have a position where it's a recognized"
    },
    {
      "Time_Start": 2224.3,
      "Time_End": 2229.3,
      "Text": " area within many government operations, there's a recognized policy function, and it has a"
    },
    {
      "Time_Start": 2229.3,
      "Time_End": 2233.3,
      "Text": " series of roles which are being called out and updated through some of the strategies."
    },
    {
      "Time_Start": 2233.3,
      "Time_End": 2238.3,
      "Text": " So what I'd love to do is just talk through maybe, you know, as we stand now, what we"
    },
    {
      "Time_Start": 2238.3,
      "Time_End": 2242.3,
      "Text": " see as the most important policy considerations for this year, and for, you know, of course,"
    },
    {
      "Time_Start": 2242.3,
      "Time_End": 2247.3,
      "Text": " we've got a lot of technologies that we're probably going to talk about, including artificial"
    },
    {
      "Time_Start": 2247.3,
      "Time_End": 2251.3,
      "Text": " intelligence. So we'd love to hear your insights on that front. So, Adam, can I start with"
    },
    {
      "Time_Start": 2251.3,
      "Time_End": 2252.3,
      "Text": " you on that one?"
    },
    {
      "Time_Start": 2252.3,
      "Time_End": 2255.3,
      "Text": " Sure, and I might go back a step and just, sorry."
    },
    {
      "Time_Start": 2255.3,
      "Time_End": 2260.3,
      "Text": " Could I ask you please to keep the microphones closer to the speakers? If it's more than"
    },
    {
      "Time_Start": 2260.3,
      "Time_End": 2264.3,
      "Text": " about eight inches away from you, you're in heavy competition every time the door opens"
    },
    {
      "Time_Start": 2264.3,
      "Time_End": 2265.3,
      "Text": " and it's hard to hear."
    },
    {
      "Time_Start": 2265.3,
      "Time_End": 2266.3,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2266.3,
      "Time_End": 2271.3,
      "Text": " That's good advice. So I might just go back and give some context as to what we've seen"
    },
    {
      "Time_Start": 2271.3,
      "Time_End": 2278.3,
      "Text": " in Australia the last year, year and a half. We, late last year, suffered two significant"
    },
    {
      "Time_Start": 2278.3,
      "Time_End": 2286.3,
      "Text": " data breaches, the scale which affected the personal data of about 10 million Australians."
    },
    {
      "Time_Start": 2286.3,
      "Time_End": 2291.3,
      "Text": " So there were an attack on our second largest telecommunication company and our largest"
    },
    {
      "Time_Start": 2291.3,
      "Time_End": 2296.3,
      "Text": " healthcare provider. And that was a seminal moment in the way that Australians think about"
    },
    {
      "Time_Start": 2296.3,
      "Time_End": 2303.3,
      "Text": " cyber and data security in the same way that I think Colonial Pipeline was in this country."
    },
    {
      "Time_Start": 2303.3,
      "Time_End": 2309.3,
      "Text": " It also was politically seismic and meant that we, for the first time now, have a cyber"
    },
    {
      "Time_Start": 2309.3,
      "Time_End": 2317.3,
      "Text": " security minister within our cabinet, so the highest levels of government. And we've gone"
    },
    {
      "Time_Start": 2317.3,
      "Time_End": 2323.3,
      "Text": " through a review which essentially found that in Australia, at a macro level, industry faces"
    },
    {
      "Time_Start": 2323.3,
      "Time_End": 2331.3,
      "Text": " a maze of unclear regulation and government doesn't provide the type of clear directives"
    },
    {
      "Time_Start": 2331.3,
      "Time_End": 2338.3,
      "Text": " as to how to best uplift their cyber security, nor does it clarify obligations on data security"
    },
    {
      "Time_Start": 2338.3,
      "Time_End": 2344.3,
      "Text": " and classify what is considered to be the most sensitive data that organisations in"
    },
    {
      "Time_Start": 2344.3,
      "Time_End": 2345.3,
      "Text": " Australia hold."
    },
    {
      "Time_Start": 2345.3,
      "Time_End": 2350.3,
      "Text": " So that all brings us to the point also where we recognise that there's not the genuine"
    },
    {
      "Time_Start": 2350.3,
      "Time_End": 2355.3,
      "Text": " bi-directional information exchange that we do need to ensure that industry in Australia"
    },
    {
      "Time_Start": 2355.3,
      "Time_End": 2361.3,
      "Text": " has the right type of visibility of the threat it faces. That brings us to the point where"
    },
    {
      "Time_Start": 2361.3,
      "Time_End": 2366.3,
      "Text": " we now are developing a new cyber strategy. To Ari's point, we've been monitoring developments"
    },
    {
      "Time_Start": 2366.3,
      "Time_End": 2372.3,
      "Text": " in the US very closely and fundamentally in Australia we are philosophically aligned with"
    },
    {
      "Time_Start": 2372.3,
      "Time_End": 2378.3,
      "Text": " the new US strategy. We recognise the status quo cannot endure and we need to undertake"
    },
    {
      "Time_Start": 2378.3,
      "Time_End": 2383.3,
      "Text": " the two fundamental shifts which are outlined in the US strategy. So that's moving the burden"
    },
    {
      "Time_Start": 2383.3,
      "Time_End": 2389.3,
      "Text": " to those who can best take on the risk and secondly incentivising long-term investments."
    },
    {
      "Time_Start": 2389.3,
      "Time_End": 2395.3,
      "Text": " Unlike other countries, Australia does have the capability to move quickly on legislation"
    },
    {
      "Time_Start": 2395.3,
      "Time_End": 2400.3,
      "Text": " and also the capability to deliver on our stated goals. So we are hoping that we can"
    },
    {
      "Time_Start": 2400.3,
      "Time_End": 2406.3,
      "Text": " actually go further in terms of implementation than the US can by virtue of the legislation"
    },
    {
      "Time_Start": 2406.3,
      "Time_End": 2410.3,
      "Text": " that we'll introduce. But I might stop it there."
    },
    {
      "Time_Start": 2410.3,
      "Time_End": 2417.3,
      "Text": " Thanks Adam. So yes, the UK published its cyber security strategy about a year and a"
    },
    {
      "Time_Start": 2417.3,
      "Time_End": 2422.3,
      "Text": " half ago. So hopefully a useful blueprint for the US and Australia. But the whole message"
    },
    {
      "Time_Start": 2422.3,
      "Time_End": 2427.3,
      "Text": " of that strategy was that this is a whole of society effort. We can't do it alone in"
    },
    {
      "Time_Start": 2427.3,
      "Time_End": 2430.3,
      "Text": " government, we can't do it alone in industry, we can't do it alone in academia. We have"
    },
    {
      "Time_Start": 2430.3,
      "Time_End": 2432.3,
      "Text": " to do this all together."
    },
    {
      "Time_Start": 2433.3,
      "Time_End": 2437.3,
      "Text": " The tagline that we talk a lot about in the UK is to make the UK the safest place to live"
    },
    {
      "Time_Start": 2437.3,
      "Time_End": 2442.3,
      "Text": " and work online. What this strategy recognises is that this is not about the UK anymore,"
    },
    {
      "Time_Start": 2442.3,
      "Time_End": 2446.3,
      "Text": " this is about the world. Because obviously, as everyone knows, we can't just, bipartisan,"
    },
    {
      "Time_Start": 2446.3,
      "Time_End": 2453.3,
      "Text": " just work one part of the UK. But obviously a strategy, it's all very well and good,"
    },
    {
      "Time_Start": 2453.3,
      "Time_End": 2456.3,
      "Text": " but it's not worth the paper it's written on unless you actually do it and actually"
    },
    {
      "Time_Start": 2456.3,
      "Time_End": 2459.3,
      "Text": " carry it out. And so I know the US have done a brilliant implementation plan, I'm sure"
    },
    {
      "Time_Start": 2459.3,
      "Time_End": 2463.3,
      "Text": " Australia will do something similar. But that is something that we're really actively"
    },
    {
      "Time_Start": 2463.3,
      "Time_End": 2465.3,
      "Text": " taking forwards."
    },
    {
      "Time_Start": 2467.3,
      "Time_End": 2472.3,
      "Text": " We talked a bit about the priorities for the future, Peter. So for us, is the horrible"
    },
    {
      "Time_Start": 2472.3,
      "Time_End": 2476.3,
      "Text": " term of emerging technology. And I won't go into the debate of what's emerged and what's"
    },
    {
      "Time_Start": 2476.3,
      "Time_End": 2480.3,
      "Text": " emerging. But for us, there are two broad buckets of we have technologies we need to"
    },
    {
      "Time_Start": 2480.3,
      "Time_End": 2484.3,
      "Text": " care about today, and then ones that are in the future that we still need to care about,"
    },
    {
      "Time_Start": 2484.3,
      "Time_End": 2488.3,
      "Text": " but we need to think about putting the security principles in place. So the ones we're really"
    },
    {
      "Time_Start": 2489.3,
      "Time_End": 2494.3,
      "Text": " focused on at the moment in the UK today is AI, and I'm sure we'll go on to talk about"
    },
    {
      "Time_Start": 2494.3,
      "Time_End": 2499.3,
      "Text": " that a bit more in detail. But also quantum and semiconductors, and there's lots of different"
    },
    {
      "Time_Start": 2499.3,
      "Time_End": 2505.3,
      "Text": " areas I could go on and on about. But it's something that we're taking really seriously"
    },
    {
      "Time_Start": 2505.3,
      "Time_End": 2508.3,
      "Text": " and that's something that's really front and centre of how we implement. And going back"
    },
    {
      "Time_Start": 2508.3,
      "Time_End": 2512.3,
      "Text": " to what I was talking about earlier about secure by default, is there something that"
    },
    {
      "Time_Start": 2512.3,
      "Time_End": 2516.3,
      "Text": " is very much the core of how we're approaching those technologies and making sure that that"
    },
    {
      "Time_Start": 2516.3,
      "Time_End": 2520.3,
      "Text": " security approach is embedded right from the start, and something that we're looking"
    },
    {
      "Time_Start": 2520.3,
      "Time_End": 2522.3,
      "Text": " to take, how we're going to take forwards."
    },
    {
      "Time_Start": 2529.3,
      "Time_End": 2535.3,
      "Text": " So I mentioned that the CRA was part of a broader package of different pieces of legislation,"
    },
    {
      "Time_Start": 2535.3,
      "Time_End": 2543.3,
      "Text": " which one advantage we have, I think, as a national parliament, as a European parliament"
    },
    {
      "Time_Start": 2543.3,
      "Time_End": 2550.3,
      "Text": " compared with others, is that there is an agreed legislative programme over a full five"
    },
    {
      "Time_Start": 2550.3,
      "Time_End": 2558.3,
      "Text": " year period, where the European Commission is responsible for drafting and putting legislation"
    },
    {
      "Time_Start": 2558.3,
      "Time_End": 2563.3,
      "Text": " on the conveyor belt, and where parliament together with the member states represented"
    },
    {
      "Time_Start": 2563.3,
      "Time_End": 2569.3,
      "Text": " in the European Council have the final say in that legislation. So we're coming towards"
    },
    {
      "Time_Start": 2569.3,
      "Time_End": 2573.3,
      "Text": " the end of the legislature, there'll be elections next year and I'll come back to that because"
    },
    {
      "Time_Start": 2573.3,
      "Time_End": 2579.3,
      "Text": " that's another relevant point in a moment. So in that whole period we've had the Cyber"
    },
    {
      "Time_Start": 2579.3,
      "Time_End": 2586.3,
      "Text": " Resilience Act, we are pretty far along now with the Artificial Intelligence Act as well,"
    },
    {
      "Time_Start": 2586.3,
      "Time_End": 2597.3,
      "Text": " which has been after I think it was 7,300 amendments tabled, discussed and debated within"
    },
    {
      "Time_Start": 2597.3,
      "Time_End": 2602.3,
      "Text": " the European Parliament to get to a compromise where we now have a solid negotiating position."
    },
    {
      "Time_Start": 2602.3,
      "Time_End": 2607.3,
      "Text": " Even that's not the end of the story because parliament has its position, the European"
    },
    {
      "Time_Start": 2607.3,
      "Time_End": 2619.3,
      "Text": " Council has its, and we have to now reconcile those two versions. But there is the legislature's"
    },
    {
      "Time_Start": 2620.3,
      "Time_End": 2627.3,
      "Text": " feet being held to the fire very much because under EU, our internal rules, any legislation"
    },
    {
      "Time_Start": 2627.3,
      "Time_End": 2632.3,
      "Text": " which isn't passed and adopted by the end of the legislature, our last legislative session"
    },
    {
      "Time_Start": 2632.3,
      "Time_End": 2638.3,
      "Text": " being in May next year, falls away. So however advanced the draft is, it's not been written"
    },
    {
      "Time_Start": 2638.3,
      "Time_End": 2646.3,
      "Text": " into law, you go back to square one. So there's a real push to get all of these pieces of"
    },
    {
      "Time_Start": 2646.3,
      "Time_End": 2651.3,
      "Text": " legislation through. In terms of challenges for the next year then, I mentioned the election"
    },
    {
      "Time_Start": 2651.3,
      "Time_End": 2662.3,
      "Text": " coming up. European Union, the European Parliament which then plays an important role in the"
    },
    {
      "Time_Start": 2662.3,
      "Time_End": 2670.3,
      "Text": " nomination and final confirmation of the European Commission, it's a five year process. In the"
    },
    {
      "Time_Start": 2671.3,
      "Time_End": 2678.3,
      "Text": " US you've got a two year congressional process for the election of the whole House and a"
    },
    {
      "Time_Start": 2678.3,
      "Time_End": 2682.3,
      "Text": " third of the Senate over a complete six year period and the presidential elections over"
    },
    {
      "Time_Start": 2682.3,
      "Time_End": 2687.3,
      "Text": " a four year period. So anyone who can do the maths sees that the common denominator there"
    },
    {
      "Time_Start": 2687.3,
      "Time_End": 2693.3,
      "Text": " is 20, so every 20 years we have the same year, we have the elections of the European"
    },
    {
      "Time_Start": 2693.3,
      "Time_End": 2698.3,
      "Text": " Parliament at the same year as the US presidential and congressional elections. So 2024 is going"
    },
    {
      "Time_Start": 2698.3,
      "Time_End": 2705.3,
      "Text": " to be a big year for us because of the issue of disinformation and election integrity and"
    },
    {
      "Time_Start": 2705.3,
      "Time_End": 2712.3,
      "Text": " election security. This is requiring already quite a massive mobilisation both within the"
    },
    {
      "Time_Start": 2712.3,
      "Time_End": 2720.3,
      "Text": " institutions in terms of cyber policy, in terms of policy, operational cyber policy."
    },
    {
      "Time_Start": 2721.3,
      "Time_End": 2729.3,
      "Text": " We face, or we're trying to face that with a severe skills shortage. In a situation where"
    },
    {
      "Time_Start": 2729.3,
      "Time_End": 2735.3,
      "Text": " budgets are limited, where it's difficult to get any new staff or any institution, just"
    },
    {
      "Time_Start": 2735.3,
      "Time_End": 2742.3,
      "Text": " to give you a sort of flavour of the importance of it for us, of the total complement of new"
    },
    {
      "Time_Start": 2742.3,
      "Time_End": 2749.3,
      "Text": " posts that can be filled and have bums on seats and actually doing the work, something"
    },
    {
      "Time_Start": 2749.3,
      "Time_End": 2754.3,
      "Text": " like 55% of all new posts are in the field of cyber security across all European institutions."
    },
    {
      "Time_Start": 2754.3,
      "Time_End": 2761.3,
      "Text": " So it's seen as one of the most important growth areas. However, and I'll be the first"
    },
    {
      "Time_Start": 2761.3,
      "Time_End": 2767.3,
      "Text": " to admit this, the sort of people we want to attract to those jobs, not that interested"
    },
    {
      "Time_Start": 2767.3,
      "Time_End": 2773.3,
      "Text": " in working as career bureaucrats like myself. I'm dressing down, this is my idea of dressing"
    },
    {
      "Time_Start": 2774.3,
      "Time_End": 2782.3,
      "Text": " down. So we've got to be realistic to find talent that will work for us in an environment"
    },
    {
      "Time_Start": 2782.3,
      "Time_End": 2786.3,
      "Text": " where they're comfortable. I mean, the career structure isn't attractive for people who"
    },
    {
      "Time_Start": 2786.3,
      "Time_End": 2791.3,
      "Text": " are involved in cyber security. The salary, at least the initial starting salaries, may"
    },
    {
      "Time_Start": 2791.3,
      "Time_End": 2797.3,
      "Text": " look relatively attractive. But for people who are used to a high degree of autonomy"
    },
    {
      "Time_Start": 2798.3,
      "Time_End": 2804.3,
      "Text": " to be driven by clear objectives and wins over short periods of time, the flexibility"
    },
    {
      "Time_Start": 2804.3,
      "Time_End": 2812.3,
      "Text": " of where and how they work, from the starting point, we're not an attractive proposition"
    },
    {
      "Time_Start": 2812.3,
      "Time_End": 2817.3,
      "Text": " for people in the field of cyber security. And we recognise that. And part of the problem"
    },
    {
      "Time_Start": 2817.3,
      "Time_End": 2823.3,
      "Text": " we have is where for most posts that come available for recruitment, we have a ratio"
    },
    {
      "Time_Start": 2823.3,
      "Time_End": 2830.3,
      "Text": " of something like 400 to 500 candidates per post. We are down to a situation where we're"
    },
    {
      "Time_Start": 2830.3,
      "Time_End": 2836.3,
      "Text": " barely getting the number of candidates for the number of posts available in the cyber"
    },
    {
      "Time_Start": 2836.3,
      "Time_End": 2840.3,
      "Text": " security field. So we've got a problem. And we recognise it, we're addressing it. And"
    },
    {
      "Time_Start": 2840.3,
      "Time_End": 2848.3,
      "Text": " at the moment, the way we're addressing it is through third parties. So we're using contracted"
    },
    {
      "Time_Start": 2848.3,
      "Time_End": 2853.3,
      "Text": " service providers, who themselves can then take people on on a much more flexible basis"
    },
    {
      "Time_Start": 2853.3,
      "Time_End": 2859.3,
      "Text": " and have sort of service level agreements with us in terms of what they deliver. And"
    },
    {
      "Time_Start": 2859.3,
      "Time_End": 2866.3,
      "Text": " that's proving useful and is patching or both literally and figuratively patching some of"
    },
    {
      "Time_Start": 2866.3,
      "Time_End": 2873.3,
      "Text": " the problems we have in terms of capability. But as a long term solution, it doesn't work."
    },
    {
      "Time_Start": 2874.3,
      "Time_End": 2880.3,
      "Text": " Public procurement rules are also lengthy and clunky. And having contractors on board"
    },
    {
      "Time_Start": 2880.3,
      "Time_End": 2885.3,
      "Text": " and having them recruit people according to certain criteria, it's a very complex process."
    },
    {
      "Time_Start": 2885.3,
      "Time_End": 2894.3,
      "Text": " So the appeal there, I think, is to recognise that it's not a sort of come and serve your"
    },
    {
      "Time_Start": 2894.3,
      "Time_End": 2902.3,
      "Text": " country of appeal that the US or other countries can offer to hackers, analysts and others"
    },
    {
      "Time_Start": 2902.3,
      "Time_End": 2907.3,
      "Text": " in the field that would not normally look at these as career opportunities. But we are"
    },
    {
      "Time_Start": 2907.3,
      "Time_End": 2913.3,
      "Text": " appealing because of the attacks against the parliament, because it stood up in support"
    },
    {
      "Time_Start": 2913.3,
      "Time_End": 2919.3,
      "Text": " of Ukraine against the Russian aggression. We've provided practical support for the Ukrainian"
    },
    {
      "Time_Start": 2919.3,
      "Time_End": 2924.3,
      "Text": " parliament, and we're paying the price in terms of an uptick in attacks against our"
    },
    {
      "Time_Start": 2924.3,
      "Time_End": 2930.3,
      "Text": " infrastructure. We are starting to ramp up this issue about appealing to public conscience"
    },
    {
      "Time_Start": 2930.3,
      "Time_End": 2934.3,
      "Text": " and also saying this is not just about defending a grey, distant bureaucratic institution."
    },
    {
      "Time_Start": 2934.3,
      "Time_End": 2939.3,
      "Text": " It's about defending the integrity of the democratic process and of elections generally."
    },
    {
      "Time_Start": 2939.3,
      "Time_End": 2942.3,
      "Text": " And that's, yeah, that's what I'd say on those."
    },
    {
      "Time_Start": 2942.3,
      "Time_End": 2948.3,
      "Text": " Thank you, Peter. And I think definitely keen for us to have a conversation about skills"
    },
    {
      "Time_Start": 2948.3,
      "Time_End": 2951.3,
      "Text": " because it definitely it's coming through as something which, as we're facing future"
    },
    {
      "Time_Start": 2951.3,
      "Time_End": 2957.3,
      "Text": " challenges, how are we preparing ourselves for them? So perhaps, Ari, what I'd love to"
    },
    {
      "Time_Start": 2957.3,
      "Time_End": 2963.3,
      "Text": " talk, you spoke briefly about the effectiveness of Mexico adapting its approach in light of"
    },
    {
      "Time_Start": 2963.3,
      "Time_End": 2968.3,
      "Text": " feedback in terms of developing a strategy. And I think there are lots of tired tropes"
    },
    {
      "Time_Start": 2968.3,
      "Time_End": 2972.3,
      "Text": " about what it's like working in the bureaucracy, what it's like working in government."
    },
    {
      "Time_Start": 2972.3,
      "Time_End": 2977.3,
      "Text": " I'd love to say they're all untrue. You can still watch episodes of Yes Minister and"
    },
    {
      "Time_Start": 2977.3,
      "Time_End": 2985.3,
      "Text": " it's kind of, I think people would agree it's still there. But I think there has been, I"
    },
    {
      "Time_Start": 2985.3,
      "Time_End": 2989.3,
      "Text": " feel, I have felt like an adaptive approach of how we can be more outcome focused, how"
    },
    {
      "Time_Start": 2989.3,
      "Time_End": 2994.3,
      "Text": " we can prioritise the areas which make the biggest impact on the objective, in the UK's"
    },
    {
      "Time_Start": 2994.3,
      "Time_End": 2998.3,
      "Text": " case, to make the UK the safest place to work and be online. But I'd love your thoughts"
    },
    {
      "Time_Start": 2998.3,
      "Time_End": 2999.3,
      "Text": " of maybe some examples."
    },
    {
      "Time_Start": 2999.3,
      "Time_End": 3003.3,
      "Text": " So one thing, I mean, the UK has done a great job. NCSC, where you used to work, has done"
    },
    {
      "Time_Start": 3003.3,
      "Time_End": 3010.3,
      "Text": " a great job in terms of the consultations. If anything, let's sort of, maybe we've been"
    },
    {
      "Time_Start": 3010.3,
      "Time_End": 3016.3,
      "Text": " deluged with consultations, like deluged by transparency from the UK, which I'd much"
    },
    {
      "Time_Start": 3016.3,
      "Time_End": 3021.3,
      "Text": " prefer over the opposite. So I don't mean that as a criticism, but it does get hard"
    },
    {
      "Time_Start": 3021.3,
      "Time_End": 3026.3,
      "Text": " if you have five consultations at the same time for the same people. Because it's like,"
    },
    {
      "Time_Start": 3026.3,
      "Time_End": 3032.3,
      "Text": " even in the US, it's like we don't have that many full-time cyber policy people commenting."
    },
    {
      "Time_Start": 3032.3,
      "Time_End": 3038.3,
      "Text": " So I think spacing them out is helpful, but also understand, like, you have politicians"
    },
    {
      "Time_Start": 3038.3,
      "Time_End": 3042.3,
      "Text": " that want to get stuff done now. So that becomes harder. We're starting to see that"
    },
    {
      "Time_Start": 3042.3,
      "Time_End": 3048.3,
      "Text": " in the US. We're probably going to have three RFIs in the US within the next two months."
    },
    {
      "Time_Start": 3048.3,
      "Time_End": 3054.3,
      "Text": " There's one out now that's going to be extended. So I think we're expecting to have three that"
    },
    {
      "Time_Start": 3054.3,
      "Time_End": 3060.3,
      "Text": " we have to comment on there. So it's a similar situation. I think it's great, though, because"
    },
    {
      "Time_Start": 3060.3,
      "Time_End": 3068.3,
      "Text": " the RFI and the consultation process leads to a much better first draft of a product,"
    },
    {
      "Time_Start": 3068.3,
      "Time_End": 3075.3,
      "Text": " policy product or legislation, than what we would have otherwise. So obviously, I prefer"
    },
    {
      "Time_Start": 3075.3,
      "Time_End": 3079.3,
      "Text": " them to be spaced out, but that would be good. I'd say Australia does a very good job as"
    },
    {
      "Time_Start": 3079.3,
      "Time_End": 3083.3,
      "Text": " well. I mean, Australia has reached out to us and I know has reached out to a lot of"
    },
    {
      "Time_Start": 3083.3,
      "Time_End": 3087.3,
      "Text": " other people when they put something out that they feel like this is something we need to"
    },
    {
      "Time_Start": 3087.3,
      "Time_End": 3093.3,
      "Text": " get attention to, like we don't want to surprise anybody when this is happening. Adam does"
    },
    {
      "Time_Start": 3093.3,
      "Time_End": 3098.3,
      "Text": " a particularly good job of it, so I can praise him on the panel. But I think, you know, they've"
    },
    {
      "Time_Start": 3098.3,
      "Time_End": 3104.3,
      "Text": " had us testify and set the time for the testimony in a way that we could actually testify, which"
    },
    {
      "Time_Start": 3104.3,
      "Time_End": 3108.3,
      "Text": " like most countries don't want foreigners to testify and they're like actually, you"
    },
    {
      "Time_Start": 3108.3,
      "Time_End": 3113.3,
      "Text": " know, purposely seeking it out and asking for it. So that's really helpful."
    },
    {
      "Time_Start": 3114.3,
      "Time_End": 3120.3,
      "Text": " The EU, you know, the structure is Byzantine in the first place, so it's hard to, like"
    },
    {
      "Time_Start": 3120.3,
      "Time_End": 3126.3,
      "Text": " if you're not actually in Brussels, I think it's very difficult to figure out even where"
    },
    {
      "Time_Start": 3126.3,
      "Time_End": 3132.3,
      "Text": " things are and the Commission does not reach out that way. Parliament does. I mean, members"
    },
    {
      "Time_Start": 3132.3,
      "Time_End": 3138.3,
      "Text": " of Parliament come on tours and they want input, so that's helpful. And I'd say even"
    },
    {
      "Time_Start": 3138.3,
      "Time_End": 3147.3,
      "Text": " the Council member, the Council staff, when you go visit, really does, too, want input."
    },
    {
      "Time_Start": 3147.3,
      "Time_End": 3151.3,
      "Text": " The problem with Parliament is that they have a lot of issues and the members themselves"
    },
    {
      "Time_Start": 3151.3,
      "Time_End": 3156.3,
      "Text": " are not educated at all on what they're voting on or what they're doing and things come through"
    },
    {
      "Time_Start": 3156.3,
      "Time_End": 3164.3,
      "Text": " quickly, and so only... Yeah, it's sort of equivalent to Congress, actually. I'd say"
    },
    {
      "Time_Start": 3164.3,
      "Time_End": 3170.3,
      "Text": " the Congressional US Congress staff now, with like the tech fellows and stuff like"
    },
    {
      "Time_Start": 3170.3,
      "Time_End": 3176.3,
      "Text": " that, are probably a little bit better educated than the elected members' staff, and then"
    },
    {
      "Time_Start": 3176.3,
      "Time_End": 3181.3,
      "Text": " the elected members are about the same, maybe worse in the US, but depending on who it is."
    },
    {
      "Time_Start": 3181.3,
      "Time_End": 3185.3,
      "Text": " Because a lot of times you get young people in European Parliament that are rising stars"
    },
    {
      "Time_Start": 3185.3,
      "Time_End": 3191.3,
      "Text": " and then they know a lot and they want to engage on these issues, but it is complicated."
    },
    {
      "Time_Start": 3191.3,
      "Time_End": 3196.3,
      "Text": " And even just that you have these three places to go to and the Commission sort of puts you"
    },
    {
      "Time_Start": 3196.3,
      "Time_End": 3199.3,
      "Text": " off for a little while and then you have like a very short period where you can say something"
    },
    {
      "Time_Start": 3199.3,
      "Time_End": 3206.3,
      "Text": " and then they're like, oh, now we can't make any changes. So it is unlike other places"
    },
    {
      "Time_Start": 3206.3,
      "Time_End": 3213.3,
      "Text": " and so that has been difficult, too. I don't know if that answered the question, but it"
    },
    {
      "Time_Start": 3213.3,
      "Time_End": 3215.3,
      "Text": " kind of gives you the..."
    },
    {
      "Time_Start": 3215.3,
      "Time_End": 3219.3,
      "Text": " I enjoy the reference of deluge by consultation, because I definitely feel as though what's"
    },
    {
      "Time_Start": 3219.3,
      "Time_End": 3223.3,
      "Text": " been effective for me has been to be able to be transparent with communities and say,"
    },
    {
      "Time_Start": 3223.3,
      "Time_End": 3228.3,
      "Text": " no, we do read and we do actually engage with what you've shared with us, and we try to"
    },
    {
      "Time_Start": 3228.3,
      "Time_End": 3232.3,
      "Text": " adapt the format to make it not overly burdensome, so it's not just you have to have a government"
    },
    {
      "Time_Start": 3232.3,
      "Time_End": 3237.3,
      "Text": " affairs division in order to fill this in, but you can contribute your insight."
    },
    {
      "Time_Start": 3237.3,
      "Time_End": 3243.3,
      "Text": " Like in the US sometimes you'll get something from an agency that is like a spreadsheet"
    },
    {
      "Time_Start": 3243.3,
      "Time_End": 3248.3,
      "Text": " and it has like, oh, you've got to fill in this box and it's only 1,000 characters, right?"
    },
    {
      "Time_Start": 3248.3,
      "Time_End": 3259.3,
      "Text": " And I'd say the NTSC is the opposite of that. It's like, you know, here is a lot of questions"
    },
    {
      "Time_Start": 3259.3,
      "Time_End": 3262.3,
      "Text": " you can fill out whatever you want. You can not fill out what you want. It can be as long"
    },
    {
      "Time_Start": 3262.3,
      "Time_End": 3265.3,
      "Text": " as you want to make it, et cetera, which I think is great. It makes it much easier to"
    },
    {
      "Time_Start": 3265.3,
      "Time_End": 3270.3,
      "Text": " comment and some of the... I'm not saying all US agencies do that. Some US agencies"
    },
    {
      "Time_Start": 3270.3,
      "Time_End": 3278.3,
      "Text": " have that approach too, but I'm sure for some engineers that little box is very helpful,"
    },
    {
      "Time_Start": 3278.3,
      "Time_End": 3283.3,
      "Text": " but for someone that's trying to give a fulsome viewpoint and you only care about one issue,"
    },
    {
      "Time_Start": 3283.3,
      "Time_End": 3287.3,
      "Text": " having 1,000 characters is not very helpful."
    },
    {
      "Time_Start": 3287.3,
      "Time_End": 3291.3,
      "Text": " I think it can be challenging to know who the right person to contact is and actually"
    },
    {
      "Time_Start": 3291.3,
      "Time_End": 3295.3,
      "Text": " to help decipher the complexities because I think it can be potentially quite burdensome"
    },
    {
      "Time_Start": 3295.3,
      "Time_End": 3300.3,
      "Text": " insight about how the hell can I engage with my government? How can I share feedback and"
    },
    {
      "Time_Start": 3300.3,
      "Time_End": 3303.3,
      "Text": " actually to try and make that process as simple as possible? Yeah, I completely agree."
    },
    {
      "Time_Start": 3303.3,
      "Time_End": 3306.3,
      "Text": " That's something which there's still more to be done and it's inconsistent, but I think"
    },
    {
      "Time_Start": 3306.3,
      "Time_End": 3310.3,
      "Text": " that's something which I think does help in how these things work."
    },
    {
      "Time_Start": 3310.3,
      "Time_End": 3316.3,
      "Text": " I'm a bit aware of time and Bryony, you mentioned the AI work that was taking place in that"
    },
    {
      "Time_Start": 3316.3,
      "Time_End": 3318.3,
      "Text": " kingdom. I'd love to hear a bit more from that if that's okay."
    },
    {
      "Time_Start": 3318.3,
      "Time_End": 3323.3,
      "Text": " Yeah, of course. So I think, you know, obviously we've all heard the terrifying, scary stories"
    },
    {
      "Time_Start": 3323.3,
      "Time_End": 3328.3,
      "Text": " about AI and I think the predominant feeling in the UK is that what we've got to remember"
    },
    {
      "Time_Start": 3328.3,
      "Time_End": 3333.3,
      "Text": " is that there's a lot for good as well. Everyone knows here about all the things that you can"
    },
    {
      "Time_Start": 3333.3,
      "Time_End": 3338.3,
      "Text": " achieve, like coding and drug discovery. I mean, in the UK government we're very, very"
    },
    {
      "Time_Start": 3338.3,
      "Time_End": 3342.3,
      "Text": " excited that this could solve our expenses issue because at the moment we have a very"
    },
    {
      "Time_Start": 3342.3,
      "Time_End": 3345.3,
      "Text": " long, cumbersome process. So if that could fix that, that would be great."
    },
    {
      "Time_Start": 3345.3,
      "Time_End": 3350.3,
      "Text": " But yeah, obviously we're very conscious of the risks as well."
    },
    {
      "Time_Start": 3350.3,
      "Time_End": 3355.3,
      "Text": " I think what we're feeling is that it's akin to a lot of the 90s with the sort of"
    },
    {
      "Time_Start": 3355.3,
      "Time_End": 3359.3,
      "Text": " explosion of the internet and all the hype and the excitement that was around that and"
    },
    {
      "Time_Start": 3359.3,
      "Time_End": 3365.3,
      "Text": " obviously it went really fast and security wasn't an integral consideration."
    },
    {
      "Time_Start": 3365.3,
      "Time_End": 3369.3,
      "Text": " So what we want to do, going back to what I said earlier, is like, let's learn from"
    },
    {
      "Time_Start": 3369.3,
      "Time_End": 3373.3,
      "Text": " those lessons from the past and let's make sure that when we're looking at AI, we're"
    },
    {
      "Time_Start": 3373.3,
      "Time_End": 3377.3,
      "Text": " doing this looking at security and making sure it's embedded now because otherwise"
    },
    {
      "Time_Start": 3377.3,
      "Time_End": 3381.3,
      "Text": " it's going to be really, really painful if we have to retrofit in a few years' time and"
    },
    {
      "Time_Start": 3381.3,
      "Time_End": 3386.3,
      "Text": " think about how we want to manage that. So that's what we're looking at at the moment"
    },
    {
      "Time_Start": 3386.3,
      "Time_End": 3391.3,
      "Text": " in the UK. We've published a number of papers on potential regulation from DSIT, the Department"
    },
    {
      "Time_Start": 3391.3,
      "Time_End": 3396.3,
      "Text": " of Science, Innovation and Technology. We've also published on the National Cyber Security"
    },
    {
      "Time_Start": 3396.3,
      "Time_End": 3402.3,
      "Text": " Centre's website some principles for thinking about security for machine learning as well."
    },
    {
      "Time_Start": 3402.3,
      "Time_End": 3406.3,
      "Text": " So that's something that is, again, for all of us, it's going to be one of our number"
    },
    {
      "Time_Start": 3406.3,
      "Time_End": 3411.3,
      "Text": " one priorities going forwards. Our Prime Minister announced when he visited D.C. a"
    },
    {
      "Time_Start": 3411.3,
      "Time_End": 3417.3,
      "Text": " couple of months ago that there's going to be a global AI summit in the UK in the autumn."
    },
    {
      "Time_Start": 3417.3,
      "Time_End": 3421.3,
      "Text": " That's going to be looking at safety and working with other countries about how we"
    },
    {
      "Time_Start": 3421.3,
      "Time_End": 3426.3,
      "Text": " can think about building on things like the White House's recent voluntary commitments"
    },
    {
      "Time_Start": 3426.3,
      "Time_End": 3430.3,
      "Text": " and thinking about how we can do this together because what we're really clear on is that"
    },
    {
      "Time_Start": 3430.3,
      "Time_End": 3435.3,
      "Text": " we can't do it alone. We need to do this internationally."
    },
    {
      "Time_Start": 3435.3,
      "Time_End": 3440.3,
      "Text": " Thank you. So I think something that's really come through as a bit of a theme here has"
    },
    {
      "Time_Start": 3440.3,
      "Time_End": 3444.3,
      "Text": " been the important role of capacity building and of how can we ensure that we're preparing"
    },
    {
      "Time_Start": 3444.3,
      "Time_End": 3449.3,
      "Text": " the cyber workforce. So I'd love to hear perspectives on that side. So Adam, is that"
    },
    {
      "Time_Start": 3449.3,
      "Time_End": 3452.3,
      "Text": " something that you can share a bit more on Australia?"
    },
    {
      "Time_Start": 3452.3,
      "Time_End": 3457.3,
      "Text": " Sure. So we're in the midst of developing a new strategy and to Ari's point, we've"
    },
    {
      "Time_Start": 3457.3,
      "Time_End": 3464.3,
      "Text": " just gone through a consultation process and garnered about 350 responses. And as part"
    },
    {
      "Time_Start": 3464.3,
      "Time_End": 3470.3,
      "Text": " of that, there was a recognition that Australia, if we continue with the current dynamics in"
    },
    {
      "Time_Start": 3470.3,
      "Time_End": 3477.3,
      "Text": " terms of our workforce and our skills, we'll have a shortage of 46,000 people by 2026."
    },
    {
      "Time_Start": 3477.3,
      "Time_End": 3482.3,
      "Text": " And so in recognition of that, the government is considering a holistic approach to the"
    },
    {
      "Time_Start": 3482.3,
      "Time_End": 3487.3,
      "Text": " way that we develop skills and a cyber workforce in Australia. So one of the things that will"
    },
    {
      "Time_Start": 3487.3,
      "Time_End": 3493.3,
      "Text": " likely come forth in the new strategy is a new curricula for first and secondary school"
    },
    {
      "Time_Start": 3493.3,
      "Time_End": 3499.3,
      "Text": " students. So that looks at not just cyber security, but also online safety as well"
    },
    {
      "Time_Start": 3499.3,
      "Time_End": 3505.3,
      "Text": " and literacy. The second is a professionalism scheme. So the feedback received was that"
    },
    {
      "Time_Start": 3505.3,
      "Time_End": 3511.3,
      "Text": " there's not enough understanding of what are the standards to meet cyber security skills"
    },
    {
      "Time_Start": 3511.3,
      "Time_End": 3516.3,
      "Text": " in Australia. And the third is a recognition that there's elements of our society that"
    },
    {
      "Time_Start": 3516.3,
      "Time_End": 3521.3,
      "Text": " we can inject into cyber security if we give them the opportunity to return to work through"
    },
    {
      "Time_Start": 3521.3,
      "Time_End": 3528.3,
      "Text": " schemes that will work for migrants, mothers returning from work, or other people who might"
    },
    {
      "Time_Start": 3528.3,
      "Time_End": 3533.3,
      "Text": " be returning from a disability, et cetera. So there's kind of three key elements to the"
    },
    {
      "Time_Start": 3533.3,
      "Time_End": 3538.3,
      "Text": " cyber and skills conversation, sorry, the workforce and skills conversation in Australia"
    },
    {
      "Time_Start": 3538.3,
      "Time_End": 3540.3,
      "Text": " at the moment."
    },
    {
      "Time_Start": 3542.3,
      "Time_End": 3548.3,
      "Text": " Yeah, I talked a little bit about the skills thing, so I won't repeat any of that. The"
    },
    {
      "Time_Start": 3548.3,
      "Time_End": 3553.3,
      "Text": " only other element in the Cyber Security Act, which I should touch on, it's been added"
    },
    {
      "Time_Start": 3553.3,
      "Time_End": 3560.3,
      "Text": " by the parliament, it wasn't in the original commission draft text, is increasing funding"
    },
    {
      "Time_Start": 3560.3,
      "Time_End": 3566.3,
      "Text": " and support for the European Cyber Security Agency, EISA, and particularly for its work"
    },
    {
      "Time_Start": 3566.3,
      "Time_End": 3577.3,
      "Text": " on developing its sort of the cyber security community practice and of facilitating the"
    },
    {
      "Time_Start": 3577.3,
      "Time_End": 3582.3,
      "Text": " exchange of competencies with the national cyber security centres. As I say, cyber security"
    },
    {
      "Time_Start": 3582.3,
      "Time_End": 3586.3,
      "Text": " isn't an EU competence, and that's why we have to sort of dance around the legislation"
    },
    {
      "Time_Start": 3586.3,
      "Time_End": 3591.3,
      "Text": " a little bit in terms of doing this, but there was pretty much universal support for the"
    },
    {
      "Time_Start": 3591.3,
      "Time_End": 3597.3,
      "Text": " idea of not EISA taking over from the national cyber security centres, that's never going"
    },
    {
      "Time_Start": 3597.3,
      "Time_End": 3602.3,
      "Text": " to happen, we just don't have that capacity, but improving the exchange of experiences"
    },
    {
      "Time_Start": 3602.3,
      "Time_End": 3608.3,
      "Text": " and looking at, again, standards, STIX, TAXI and others for information, rapid information"
    },
    {
      "Time_Start": 3608.3,
      "Time_End": 3615.3,
      "Text": " exchange on new exposed vulnerabilities or attacks, and being able to improve that in"
    },
    {
      "Time_Start": 3615.3,
      "Time_End": 3620.3,
      "Text": " an environment which is, you've got to remember, the European Union's 27 countries, European"
    },
    {
      "Time_Start": 3620.3,
      "Time_End": 3627.3,
      "Text": " Parliament's made up of 700 members from 107 national political parties working in 23 languages"
    },
    {
      "Time_Start": 3628.3,
      "Time_End": 3634.3,
      "Text": " where the legislation that's implemented is implemented in those 23 languages, so excuse"
    },
    {
      "Time_Start": 3634.3,
      "Time_End": 3639.3,
      "Text": " the little bit if things are sometimes a bit complicated, but even at this level, everything"
    },
    {
      "Time_Start": 3639.3,
      "Time_End": 3644.3,
      "Text": " working on cyber security at a national level, English may be the lingua franca for a lot"
    },
    {
      "Time_Start": 3644.3,
      "Time_End": 3649.3,
      "Text": " of operations and a lot of stuff, but you cannot impose that on a country like Romania"
    },
    {
      "Time_Start": 3649.3,
      "Time_End": 3657.3,
      "Text": " or Serbia or Estonia that their workforce exclusively work in English, so you've got"
    },
    {
      "Time_Start": 3657.3,
      "Time_End": 3662.3,
      "Text": " to provide that competence also on a multilingual basis and I think that's the other thing."
    },
    {
      "Time_Start": 3662.3,
      "Time_End": 3666.3,
      "Text": " The only final element I'd mention is, and I touched on it when I talked about election"
    },
    {
      "Time_Start": 3666.3,
      "Time_End": 3670.3,
      "Text": " integrity, and that is there's a call from a recent report of the European Parliament"
    },
    {
      "Time_Start": 3670.3,
      "Time_End": 3676.3,
      "Text": " on election interference and foreign interference, is a call to member states to make election"
    },
    {
      "Time_Start": 3677.3,
      "Time_End": 3681.3,
      "Text": " systems part of, classify them as critical infrastructure, which is not the case at the"
    },
    {
      "Time_Start": 3681.3,
      "Time_End": 3683.3,
      "Text": " moment."
    },
    {
      "Time_Start": 3689.3,
      "Time_End": 3693.3,
      "Text": " Thank you. So I think the only thing I would add as a consideration for us for the next"
    },
    {
      "Time_Start": 3693.3,
      "Time_End": 3700.3,
      "Text": " year is going to be looking at cyber skills. So for us in the UK, there's no point in us"
    },
    {
      "Time_Start": 3700.3,
      "Time_End": 3705.3,
      "Text": " talking about increasing resilience of critical national infrastructure, looking at the threat"
    },
    {
      "Time_Start": 3705.3,
      "Time_End": 3711.3,
      "Text": " if we just don't have the people to do it. Currently in the UK we have a gap of 11,000"
    },
    {
      "Time_Start": 3711.3,
      "Time_End": 3719.3,
      "Text": " jobs and our cyber workforce needs to grow by 50% over the last four years, so there"
    },
    {
      "Time_Start": 3719.3,
      "Time_End": 3726.3,
      "Text": " is a bit of a tight spot. So what we're really clear and what we want to do for young people"
    },
    {
      "Time_Start": 3726.3,
      "Time_End": 3730.3,
      "Text": " and people mid-career or any point in their career is have a really clear visualisation"
    },
    {
      "Time_Start": 3730.3,
      "Time_End": 3735.3,
      "Text": " of what a career in cybersecurity looks like. So we talk about teachers, we talk about lawyers,"
    },
    {
      "Time_Start": 3735.3,
      "Time_End": 3739.3,
      "Text": " we have children who want to do something like that. At the moment there isn't a clear"
    },
    {
      "Time_Start": 3739.3,
      "Time_End": 3743.3,
      "Text": " career path if you want to become a cyber professional. So over the last two years we"
    },
    {
      "Time_Start": 3743.3,
      "Time_End": 3747.3,
      "Text": " have worked really closely with industry and a number of other partners to think about"
    },
    {
      "Time_Start": 3747.3,
      "Time_End": 3753.3,
      "Text": " how do we create a clear career path for the people who want to get into cyber. So that"
    },
    {
      "Time_Start": 3753.3,
      "Time_End": 3759.3,
      "Text": " has led to the creation of the Cyber Security Advisory Council, which is an umbrella organisation"
    },
    {
      "Time_Start": 3759.3,
      "Time_End": 3764.3,
      "Text": " working with lots of different partners to create that career path. We're not saying"
    },
    {
      "Time_Start": 3764.3,
      "Time_End": 3768.3,
      "Text": " there's still a long way to go and we're still doing a lot of consultation, there's currently"
    },
    {
      "Time_Start": 3768.3,
      "Time_End": 3774.3,
      "Text": " 16 different specialisms within the Cyber Security Council, there are different areas"
    },
    {
      "Time_Start": 3774.3,
      "Time_End": 3778.3,
      "Text": " of accreditation, but what it tries to take is a holistic, looking at all the different"
    },
    {
      "Time_Start": 3778.3,
      "Time_End": 3782.3,
      "Text": " things that you can do to qualify in cyber. So someone who did, like for myself, did a"
    },
    {
      "Time_Start": 3782.3,
      "Time_End": 3786.3,
      "Text": " linguistics degree, it's making sure that we can value all the different things that"
    },
    {
      "Time_Start": 3786.3,
      "Time_End": 3790.3,
      "Text": " you know that people bring to the table in cyber and making sure that that is recognised,"
    },
    {
      "Time_Start": 3790.3,
      "Time_End": 3796.3,
      "Text": " but also creating that clear pathway and creating a clear visualisation of what people want"
    },
    {
      "Time_Start": 3796.3,
      "Time_End": 3798.3,
      "Text": " to do by working in cyber."
    },
    {
      "Time_Start": 3801.3,
      "Time_End": 3807.3,
      "Text": " Ari, I think you mentioned earlier about the consultation values, it would be great to"
    },
    {
      "Time_Start": 3807.3,
      "Time_End": 3811.3,
      "Text": " hear a bit more about what you'd like to see more of, from what you've seen some countries"
    },
    {
      "Time_Start": 3811.3,
      "Time_End": 3815.3,
      "Text": " do really well in addition to that, and then what maybe you think we should be doing more"
    },
    {
      "Time_Start": 3815.3,
      "Time_End": 3818.3,
      "Text": " to help us get to that capacity issue a bit sooner."
    },
    {
      "Time_Start": 3819.3,
      "Time_End": 3824.3,
      "Text": " Yeah, I mean the capacity issue is hard, it's everywhere, right? It's in the developed countries"
    },
    {
      "Time_Start": 3824.3,
      "Time_End": 3829.3,
      "Text": " and the non-developed countries and I think from my point of view a lot of that has been"
    },
    {
      "Time_Start": 3829.3,
      "Time_End": 3836.3,
      "Text": " that we have to get much more, think about getting much more diversity into the structure."
    },
    {
      "Time_Start": 3836.3,
      "Time_End": 3842.3,
      "Text": " I mean one of the things that the UK has done is they had this effort to bring like, I forget"
    },
    {
      "Time_Start": 3842.3,
      "Time_End": 3846.3,
      "Text": " what grade level it would be here, but girls are at a certain grade level, they have a"
    },
    {
      "Time_Start": 3846.3,
      "Time_End": 3855.3,
      "Text": " competition only girls can enter on tech skills that leads towards cyber security and have"
    },
    {
      "Time_Start": 3855.3,
      "Time_End": 3863.3,
      "Text": " a challenge for them and had a tonne of participation, tonne, tonne, tonne participation and got"
    },
    {
      "Time_Start": 3863.3,
      "Time_End": 3867.3,
      "Text": " national write-ups and things like that. I think we need to do a lot more of that, but"
    },
    {
      "Time_Start": 3867.3,
      "Time_End": 3873.3,
      "Text": " that's like planning ten years out, right? And I think that might be the path."
    },
    {
      "Time_Start": 3874.3,
      "Time_End": 3879.3,
      "Text": " We do have, you know, there is this kind of challenge, you're talking about AI, right,"
    },
    {
      "Time_Start": 3879.3,
      "Time_End": 3883.3,
      "Text": " and you have the idea of like we're going to automate a lot more of security and at"
    },
    {
      "Time_Start": 3883.3,
      "Time_End": 3888.3,
      "Text": " the same time like we want to get more people into these jobs who then their jobs might"
    },
    {
      "Time_Start": 3888.3,
      "Time_End": 3893.3,
      "Text": " disappear as well, so I think that there is a little bit of a challenge on that side of"
    },
    {
      "Time_Start": 3893.3,
      "Time_End": 3904.3,
      "Text": " it, but I mean there are still so many cyber security jobs right now. I mean what Peter"
    },
    {
      "Time_Start": 3904.3,
      "Time_End": 3910.3,
      "Text": " was saying in terms of the number of open vacancies, if you look at what we have in"
    },
    {
      "Time_Start": 3910.3,
      "Time_End": 3920.3,
      "Text": " the U.S. on the CyberSeek page that NICE puts together in NIST, they have, I think"
    },
    {
      "Time_Start": 3920.3,
      "Time_End": 3930.3,
      "Text": " it is the number of open jobs is equal to the number of people in that are qualified"
    },
    {
      "Time_Start": 3930.3,
      "Time_End": 3935.3,
      "Text": " for those jobs, so if everyone switched obviously you'd have all the other new jobs open up,"
    },
    {
      "Time_Start": 3935.3,
      "Time_End": 3940.3,
      "Text": " right, so it is not like it's just a, we have to bring down the number of jobs, yeah,"
    },
    {
      "Time_Start": 3940.3,
      "Time_End": 3944.3,
      "Text": " and automation can help with that to some degree, but we also have to get more people"
    },
    {
      "Time_Start": 3944.3,
      "Time_End": 3950.3,
      "Text": " into the workforce that diversifies the workforce and think differently about who those people"
    },
    {
      "Time_Start": 3950.3,
      "Time_End": 3954.3,
      "Text": " are, and it might mean thinking ten years down the road in order to get enough people"
    },
    {
      "Time_Start": 3954.3,
      "Time_End": 3959.3,
      "Text": " to do that and to bring those kind of challenges because you're not going to just, you know,"
    },
    {
      "Time_Start": 3959.3,
      "Time_End": 3964.3,
      "Text": " the other key to this is a lot of those jobs aren't the entry level jobs, right, if you"
    },
    {
      "Time_Start": 3964.3,
      "Time_End": 3969.3,
      "Text": " look at the job categories, most of them need three to five years' experience as the"
    },
    {
      "Time_Start": 3969.3,
      "Time_End": 3974.3,
      "Text": " baseline, so how do you get three to five years' experience, right, so there is a lot"
    },
    {
      "Time_Start": 3974.3,
      "Time_End": 3980.3,
      "Text": " of this discussion, apprenticeships and things like that in order to get there, but we've"
    },
    {
      "Time_Start": 3980.3,
      "Time_End": 3985.3,
      "Text": " got to think a lot more creatively because apprenticeships are hard to scale, so."
    },
    {
      "Time_Start": 3985.3,
      "Time_End": 3989.3,
      "Text": " Just any of the points that people like to raise on the skills agenda before we move"
    },
    {
      "Time_Start": 3990.3,
      "Time_End": 3995.3,
      "Text": " Just what Ari just mentioned regarding our Cyber First Girls competition, which is, thank"
    },
    {
      "Time_Start": 3995.3,
      "Time_End": 3999.3,
      "Text": " you for your very kind comments, Ari, because, yeah, we're really proud of the Cyber First"
    },
    {
      "Time_Start": 3999.3,
      "Time_End": 4005.3,
      "Text": " competition, and it's about girls aged 13 and they do a coding competition over the"
    },
    {
      "Time_Start": 4005.3,
      "Time_End": 4011.3,
      "Text": " summer, and it's, what we see is this point where in the UK that's where you choose"
    },
    {
      "Time_Start": 4011.3,
      "Time_End": 4015.3,
      "Text": " your next stage of education, which can dictate what A levels you do and which university"
    },
    {
      "Time_Start": 4015.3,
      "Time_End": 4019.3,
      "Text": " you go to, so it really is a real determining point, quite terrifying you have to make that"
    },
    {
      "Time_Start": 4019.3,
      "Time_End": 4023.3,
      "Text": " as age 13, 14, but, you know, there you go, but what we're seeing is a lot of girls drop"
    },
    {
      "Time_Start": 4023.3,
      "Time_End": 4029.3,
      "Text": " off from, you know, cyber sort of topics at that age, so this is why that competition"
    },
    {
      "Time_Start": 4029.3,
      "Time_End": 4032.3,
      "Text": " is aimed at that age to try and tackle that."
    },
    {
      "Time_Start": 4032.3,
      "Time_End": 4036.3,
      "Text": " The only other thing I would say is some of the other programmes we have, we're starting"
    },
    {
      "Time_Start": 4036.3,
      "Time_End": 4041.3,
      "Text": " to see some results, so they've been in progress for about the last seven, eight years, and"
    },
    {
      "Time_Start": 4041.3,
      "Time_End": 4046.3,
      "Text": " we're now seeing some of those people who have went to these competitions at age 13"
    },
    {
      "Time_Start": 4046.3,
      "Time_End": 4050.3,
      "Text": " now coming in as interns into the Department of Science and Innovation Technology, you"
    },
    {
      "Time_Start": 4050.3,
      "Time_End": 4054.3,
      "Text": " know, we're talking small numbers, but it's a really good sign."
    },
    {
      "Time_Start": 4054.3,
      "Time_End": 4061.3,
      "Text": " Peter, just before we go to questions, Peter, you mentioned briefly, and feel free to not"
    },
    {
      "Time_Start": 4061.3,
      "Time_End": 4065.3,
      "Text": " speak on it, but you were talking about the importance of elections and the election security"
    },
    {
      "Time_Start": 4065.3,
      "Time_End": 4069.3,
      "Text": " component, I'd love to hear any more input you have on that side."
    },
    {
      "Time_Start": 4070.3,
      "Time_End": 4076.3,
      "Text": " Yeah, I mean, for this audience, I don't think anyone needs reminding about some of the challenges"
    },
    {
      "Time_Start": 4076.3,
      "Time_End": 4083.3,
      "Text": " that we see in elections already with deep fakes, whether video or audio, but also the"
    },
    {
      "Time_Start": 4083.3,
      "Time_End": 4088.3,
      "Text": " way that social media is being used and driven by increasingly automated systems which are"
    },
    {
      "Time_Start": 4088.3,
      "Time_End": 4098.3,
      "Text": " bought by, let's say, either state or non-state actors, you know, off-the-shelf sort of disinformation"
    },
    {
      "Time_Start": 4098.3,
      "Time_End": 4107.3,
      "Text": " or interference capacities. The Parliament's approach has been, we had a special committee"
    },
    {
      "Time_Start": 4107.3,
      "Time_End": 4114.3,
      "Text": " set up for a year and a half looking at foreign interference and election integrity, and some"
    },
    {
      "Time_Start": 4114.3,
      "Time_End": 4119.3,
      "Text": " of the issues were sort of pointing, not just pointing the finger at online platforms, but"
    },
    {
      "Time_Start": 4119.3,
      "Time_End": 4123.3,
      "Text": " sort of saying, you know, you guys have got to pull your weight a little bit in terms"
    },
    {
      "Time_Start": 4123.3,
      "Time_End": 4133.3,
      "Text": " of trying to either, to ban is unrealistic, but to call on them to rein in the possibility"
    },
    {
      "Time_Start": 4133.3,
      "Time_End": 4140.3,
      "Text": " for advertisers to do sort of micro-targeted political campaigning, so even in a particular"
    },
    {
      "Time_Start": 4140.3,
      "Time_End": 4148.3,
      "Text": " electoral district, to be able, using AI, a malign actor would be able to target an"
    },
    {
      "Time_Start": 4148.3,
      "Time_End": 4154.3,
      "Text": " audience of 1,000 Facebook users, for example, in one constituency, each with a very different"
    },
    {
      "Time_Start": 4154.3,
      "Time_End": 4161.3,
      "Text": " message based on the information and data available to them, and to do that well, that's"
    },
    {
      "Time_Start": 4161.3,
      "Time_End": 4168.3,
      "Text": " what political campaigning is about, to do that nefariously and to put out misinformation"
    },
    {
      "Time_Start": 4168.3,
      "Time_End": 4173.3,
      "Text": " or lies, knowing that one person is going to be more susceptible to something which"
    },
    {
      "Time_Start": 4173.3,
      "Time_End": 4178.3,
      "Text": " is claimed in one area where another person would not, that sort of micro-targeting is"
    },
    {
      "Time_Start": 4178.3,
      "Time_End": 4184.3,
      "Text": " something which we're very concerned about. We are calling on the online platforms to"
    },
    {
      "Time_Start": 4184.3,
      "Time_End": 4188.3,
      "Text": " take more seriously and more rapid action on takedown of misinformation, where it's"
    },
    {
      "Time_Start": 4188.3,
      "Time_End": 4195.3,
      "Text": " clear, not misinformation, disinformation, to clarify the terminology, where it's known"
    },
    {
      "Time_Start": 4195.3,
      "Time_End": 4204.3,
      "Text": " that there are actors that are clearly behaving in a way of promoting false information online."
    },
    {
      "Time_Start": 4204.3,
      "Time_End": 4209.3,
      "Text": " I mentioned about the integrity of election systems and them being considered as critical"
    },
    {
      "Time_Start": 4209.3,
      "Time_End": 4217.3,
      "Text": " infrastructure. The other area which I think is, it may be marginal interest, but protection"
    },
    {
      "Time_Start": 4217.3,
      "Time_End": 4224.3,
      "Text": " of journalists and of what we're talking about introducing so-called mirror clauses,"
    },
    {
      "Time_Start": 4224.3,
      "Time_End": 4232.3,
      "Text": " whereby we will provide access to non-European journalists in reciprocity of the openness"
    },
    {
      "Time_Start": 4232.3,
      "Time_End": 4237.3,
      "Text": " of other third countries to do the same for us. So if you are faced with a country which"
    },
    {
      "Time_Start": 4237.3,
      "Time_End": 4241.3,
      "Text": " has a very tightly controlled media, where there are no journalists or foreign journalists"
    },
    {
      "Time_Start": 4241.3,
      "Time_End": 4246.3,
      "Text": " have very limited access to information, well, it's going to be a tit-for-tat and you can"
    },
    {
      "Time_Start": 4246.3,
      "Time_End": 4252.3,
      "Text": " expect to get more limited access to, as a journalist from those countries, to the"
    },
    {
      "Time_Start": 4252.3,
      "Time_End": 4258.3,
      "Text": " political space that we have. I think a lot of that is, a lot of people talk about AI"
    },
    {
      "Time_Start": 4258.3,
      "Time_End": 4263.3,
      "Text": " and I think AI is going to be one of the critical aspects in terms of where we are. We have"
    },
    {
      "Time_Start": 4263.3,
      "Time_End": 4269.3,
      "Text": " the whole AI Act and I'm not going to go into any of the details about that, but this issue,"
    },
    {
      "Time_Start": 4269.3,
      "Time_End": 4274.3,
      "Text": " whether it's for us operationally in the Parliament to have sort of transparency or insight to"
    },
    {
      "Time_Start": 4274.3,
      "Time_End": 4281.3,
      "Text": " how algorithms are being used for a service that we may buy in off the shelf to help some"
    },
    {
      "Time_Start": 4281.3,
      "Time_End": 4286.3,
      "Text": " of our internal work, to know that it's, that the service is reliable, that it has high"
    },
    {
      "Time_Start": 4286.3,
      "Time_End": 4292.3,
      "Text": " level of integrity, that the data sources being used or whatever are known, that there"
    },
    {
      "Time_Start": 4292.3,
      "Time_End": 4297.3,
      "Text": " isn't data poisoning upstream before the algorithms or the language models are being used or deployed."
    },
    {
      "Time_Start": 4297.3,
      "Time_End": 4303.3,
      "Text": " These are all issues about transparency which have a clear relationship to the whole world"
    },
    {
      "Time_Start": 4303.3,
      "Time_End": 4309.3,
      "Text": " of cyber security because you want to keep the integrity of that whole chain of training"
    },
    {
      "Time_Start": 4309.3,
      "Time_End": 4315.3,
      "Text": " data, operational data, synthetic data or whatever coming through those models before"
    },
    {
      "Time_Start": 4315.3,
      "Time_End": 4319.3,
      "Text": " providing sort of decision support. Whether that's in terms of our operational systems,"
    },
    {
      "Time_Start": 4319.3,
      "Time_End": 4326.3,
      "Text": " whether that's in terms of what gets pushed out in mass media or online and social media,"
    },
    {
      "Time_Start": 4326.3,
      "Time_End": 4332.3,
      "Text": " that interface between cyber security challenges and AI I think is going to be increasingly"
    },
    {
      "Time_Start": 4332.3,
      "Time_End": 4335.3,
      "Text": " a headache for us in the coming year."
    },
    {
      "Time_Start": 4335.3,
      "Time_End": 4339.3,
      "Text": " Thank you. Thank you very much. I'd love to hear any questions that we have as well,"
    },
    {
      "Time_Start": 4339.3,
      "Time_End": 4346.3,
      "Text": " so please do feel free. There's a microphone here if anyone would like to come join. Yes, please."
    },
    {
      "Time_Start": 4346.3,
      "Time_End": 4349.3,
      "Text": " Apologies, it'll be a little long winded, but I promise there's a question. I wanted"
    },
    {
      "Time_Start": 4349.3,
      "Time_End": 4353.3,
      "Text": " to hit on a couple of points that you talked about, especially as it comes to two issues"
    },
    {
      "Time_Start": 4353.3,
      "Time_End": 4358.3,
      "Text": " that are kind of related in the way that they have their impacts in their respective ways,"
    },
    {
      "Time_Start": 4358.3,
      "Time_End": 4363.3,
      "Text": " and that's the kind of implication of enforcing a national or international at whatever level"
    },
    {
      "Time_Start": 4363.3,
      "Time_End": 4369.3,
      "Text": " cyber security policy on small businesses. And also kind of conflated with a separate"
    },
    {
      "Time_Start": 4369.3,
      "Time_End": 4374.3,
      "Text": " issue, and that's what we spoke about as far as Mexico not having the expertise to develop"
    },
    {
      "Time_Start": 4374.3,
      "Time_End": 4379.3,
      "Text": " their own cyber security policy or to implement that cyber security policy. Looking at, for"
    },
    {
      "Time_Start": 4379.3,
      "Time_End": 4386.3,
      "Text": " example, Africa and developing into a more modern internet connected world. Kind of the"
    },
    {
      "Time_Start": 4386.3,
      "Time_End": 4390.3,
      "Text": " similar impact on small businesses applies to smaller countries. For example, complying"
    },
    {
      "Time_Start": 4390.3,
      "Time_End": 4395.3,
      "Text": " with GDPR is a challenge for small businesses as well as it is for smaller countries to"
    },
    {
      "Time_Start": 4395.3,
      "Time_End": 4399.3,
      "Text": " comply with those kind of internationalized cyber security policies. So taking into account,"
    },
    {
      "Time_Start": 4399.3,
      "Time_End": 4404.3,
      "Text": " for example, the geopolitics of Russian and Chinese influence as it comes to Africa and"
    },
    {
      "Time_Start": 4404.3,
      "Time_End": 4409.3,
      "Text": " being able to knowledge transfer to smaller countries and smaller businesses how to comply"
    },
    {
      "Time_Start": 4409.3,
      "Time_End": 4413.3,
      "Text": " with those cyber security policies. What do you see as the most feasible solutions for"
    },
    {
      "Time_Start": 4413.3,
      "Time_End": 4419.3,
      "Text": " us to be able to kind of prevent conflating national security with cyber security and"
    },
    {
      "Time_Start": 4419.3,
      "Time_End": 4423.3,
      "Text": " be able to share that information and that knowledge with smaller businesses and countries"
    },
    {
      "Time_Start": 4423.3,
      "Time_End": 4431.3,
      "Text": " to not impose a greater cost on them to comply?"
    },
    {
      "Time_Start": 4431.3,
      "Time_End": 4437.3,
      "Text": " So a lot of countries have actually have kind of like the minimus rules. So Japan and their"
    },
    {
      "Time_Start": 4438.3,
      "Time_End": 4443.3,
      "Text": " privacy law came up with a, you know, this is the minimum amount of information you collect"
    },
    {
      "Time_Start": 4443.3,
      "Time_End": 4449.3,
      "Text": " and or and also here's the number of like how small like your income is and et cetera"
    },
    {
      "Time_Start": 4449.3,
      "Time_End": 4454.3,
      "Text": " and kind of has some degree of changing that based on that. Obviously you don't want just"
    },
    {
      "Time_Start": 4454.3,
      "Time_End": 4458.3,
      "Text": " because someone doesn't make a lot of money or it only has a couple employees but collects"
    },
    {
      "Time_Start": 4458.3,
      "Time_End": 4463.3,
      "Text": " information on the entire world. You don't want to like totally get rid of everything."
    },
    {
      "Time_Start": 4463.3,
      "Time_End": 4467.3,
      "Text": " So there is a balance there, especially in the privacy discussion. But I do think that"
    },
    {
      "Time_Start": 4467.3,
      "Time_End": 4475.3,
      "Text": " it is your point about the separation of national security and cyber security is a good one"
    },
    {
      "Time_Start": 4475.3,
      "Time_End": 4480.3,
      "Text": " and having an understanding of like the impact, like the broader impact that you're having"
    },
    {
      "Time_Start": 4480.3,
      "Time_End": 4485.3,
      "Text": " on the economy when you come up with these rules and how do you go about it affecting"
    },
    {
      "Time_Start": 4485.3,
      "Time_End": 4491.3,
      "Text": " small businesses and keeping that into account as you make the policy. And you know, one"
    },
    {
      "Time_Start": 4491.3,
      "Time_End": 4496.3,
      "Text": " of the things we hear a lot from the EU is, don't worry about it. We don't have it in"
    },
    {
      "Time_Start": 4496.3,
      "Time_End": 4500.3,
      "Text": " the in the regulation but we're, I mean we don't have it in the, but when we put, when"
    },
    {
      "Time_Start": 4500.3,
      "Time_End": 4505.3,
      "Text": " we have the, what's it called, the implementing language, right? It'll be in the implementing"
    },
    {
      "Time_Start": 4505.3,
      "Time_End": 4508.3,
      "Text": " language, this issue. And a lot of the small business stuff that we have raised with the"
    },
    {
      "Time_Start": 4508.3,
      "Time_End": 4513.3,
      "Text": " EU, they say, you know, wait for the implementing language. I can't say that makes the small"
    },
    {
      "Time_Start": 4513.3,
      "Time_End": 4518.3,
      "Text": " businesses I've spoken to that understand what the CRA is going to do very, like doesn't"
    },
    {
      "Time_Start": 4518.3,
      "Time_End": 4523.3,
      "Text": " mollify them but I do think that there is something to be said about like, you know,"
    },
    {
      "Time_Start": 4523.3,
      "Time_End": 4530.3,
      "Text": " sometimes if we can get, as we get into more details and that the, you know, the people"
    },
    {
      "Time_Start": 4530.3,
      "Time_End": 4535.3,
      "Text": " with expertise that are writing it, you know, can go into more detail there and then don't"
    },
    {
      "Time_Start": 4535.3,
      "Time_End": 4541.3,
      "Text": " have to worry about, you know, what the, like every, like this becoming a thousand page"
    },
    {
      "Time_Start": 4541.3,
      "Time_End": 4545.3,
      "Text": " regulation in the first place, right? So, but the implementing language can deal with"
    },
    {
      "Time_Start": 4545.3,
      "Time_End": 4550.3,
      "Text": " it. So, I think that there is, has been some more effort to deal with small businesses"
    },
    {
      "Time_Start": 4550.3,
      "Time_End": 4555.3,
      "Text": " and kind of like what we would consider to be the regulation language and the EU would"
    },
    {
      "Time_Start": 4555.3,
      "Time_End": 4558.3,
      "Text": " consider to be the implementing language, so."
    },
    {
      "Time_Start": 4558.3,
      "Time_End": 4560.3,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4560.3,
      "Time_End": 4566.3,
      "Text": " Actually, in the CRA, there is, in the primary legislation, there is direct reference to"
    },
    {
      "Time_Start": 4566.3,
      "Time_End": 4572.3,
      "Text": " small businesses with certain exemptions in terms of how they implement but also support"
    },
    {
      "Time_Start": 4572.3,
      "Time_End": 4577.3,
      "Text": " small businesses, for example, to engage in the standardization or conformity assessment"
    },
    {
      "Time_Start": 4577.3,
      "Time_End": 4582.3,
      "Text": " processes or whatever and giving them a sort of bit of a leg up. The other element, and"
    },
    {
      "Time_Start": 4582.3,
      "Time_End": 4587.3,
      "Text": " this is a more controversial one but I think it can't be ignored, many of the European"
    },
    {
      "Time_Start": 4587.3,
      "Time_End": 4595.3,
      "Text": " Union countries are former colonial powers. Britain, well, Britain is no longer in the"
    },
    {
      "Time_Start": 4595.3,
      "Time_End": 4601.3,
      "Text": " EU, unfortunately, but, you know, France, Germany, Netherlands, Spain, Portugal, Italy,"
    },
    {
      "Time_Start": 4601.3,
      "Time_End": 4606.3,
      "Text": " little Belgium where I'm a national. They're all former colonial powers and the reason"
    },
    {
      "Time_Start": 4606.3,
      "Time_End": 4612.3,
      "Text": " that's important is because they still have strong links with those former colonies and"
    },
    {
      "Time_Start": 4612.3,
      "Time_End": 4616.3,
      "Text": " those countries which are now independent countries and there's a very strong political"
    },
    {
      "Time_Start": 4616.3,
      "Time_End": 4621.3,
      "Text": " and administrative culture of cooperation with those countries on a bilateral basis"
    },
    {
      "Time_Start": 4621.3,
      "Time_End": 4625.3,
      "Text": " and multilateral basis and I don't think that can be ignored in terms of the support"
    },
    {
      "Time_Start": 4625.3,
      "Time_End": 4632.3,
      "Text": " that they can provide indirectly to those countries through their bilateral efforts."
    },
    {
      "Time_Start": 4632.3,
      "Time_End": 4636.3,
      "Text": " And the final element, though, I'd mention is I touched on this Trade and Technology"
    },
    {
      "Time_Start": 4636.3,
      "Time_End": 4641.3,
      "Text": " Council which is sort of jamboree of the big wigs in trade and technology policy between"
    },
    {
      "Time_Start": 4641.3,
      "Time_End": 4648.3,
      "Text": " the EU and the US but they have launched a number of small pilot projects for support"
    },
    {
      "Time_Start": 4649.3,
      "Time_End": 4655.3,
      "Text": " in various technology areas for third party countries. I think the current ones are Senegal,"
    },
    {
      "Time_Start": 4655.3,
      "Time_End": 4662.3,
      "Text": " Jamaica, Sierra Leone and there was a fourth country where there are particular projects"
    },
    {
      "Time_Start": 4662.3,
      "Time_End": 4669.3,
      "Text": " whether it's in supporting 5G implementation in remote areas to improve infrastructure"
    },
    {
      "Time_Start": 4669.3,
      "Time_End": 4676.3,
      "Text": " for learning and for schools but coupling that with cyber security capability to ensure"
    },
    {
      "Time_Start": 4676.3,
      "Time_End": 4682.3,
      "Text": " that's not going to get taken over by some malign force to undermine the whole project."
    },
    {
      "Time_Start": 4682.3,
      "Time_End": 4688.3,
      "Text": " But so there are various avenues and I would say in addition to which the European Union"
    },
    {
      "Time_Start": 4688.3,
      "Time_End": 4695.3,
      "Text": " treaties specifically have provisions for small businesses so it's sort of baked into"
    },
    {
      "Time_Start": 4695.3,
      "Time_End": 4699.3,
      "Text": " the treaties in terms of how the European Union operates."
    },
    {
      "Time_Start": 4699.3,
      "Time_End": 4704.3,
      "Text": " That's a really good point. In fact, we run this group called Latam CISO which is"
    },
    {
      "Time_Start": 4704.3,
      "Time_End": 4712.3,
      "Text": " made up of 250 of the chief information security officers in Latin America and the annual conference"
    },
    {
      "Time_Start": 4712.3,
      "Time_End": 4716.3,
      "Text": " this year is actually going to be in Spain and the reason for that is the Spanish government"
    },
    {
      "Time_Start": 4716.3,
      "Time_End": 4720.3,
      "Text": " is excited to have it but it was really Telefonica that's excited to have it there and it's"
    },
    {
      "Time_Start": 4720.3,
      "Time_End": 4724.3,
      "Text": " to bring in, I mean some of these are small businesses, they want to fly them over there"
    },
    {
      "Time_Start": 4724.3,
      "Time_End": 4733.3,
      "Text": " and it's actually not the government as much as the telecommunications company, the large"
    },
    {
      "Time_Start": 4733.3,
      "Time_End": 4743.3,
      "Text": " telecommunications companies from the former colonizer that is engaged in working with them"
    },
    {
      "Time_Start": 4743.3,
      "Time_End": 4747.3,
      "Text": " et cetera and we see that with U.S. companies too. A lot of the U.S. companies want to engage"
    },
    {
      "Time_Start": 4747.3,
      "Time_End": 4750.3,
      "Text": " with them and kind of give support to some of the smaller companies there and get them"
    },
    {
      "Time_Start": 4750.3,
      "Time_End": 4755.3,
      "Text": " to buy their products or get the governments to support them buying their products. So"
    },
    {
      "Time_Start": 4755.3,
      "Time_End": 4765.3,
      "Text": " I think that there is something to that in terms of helping boost it even from the companies"
    },
    {
      "Time_Start": 4765.3,
      "Time_End": 4771.3,
      "Text": " involved in the space or the pseudo, in some cases the pseudo, when you have a telecom"
    },
    {
      "Time_Start": 4771.3,
      "Time_End": 4775.3,
      "Text": " a lot of times it's a jointly run."
    },
    {
      "Time_Start": 4775.3,
      "Time_End": 4780.3,
      "Text": " And just from my side too, I have three points on, thank you for the question. I think that"
    },
    {
      "Time_Start": 4780.3,
      "Time_End": 4785.3,
      "Text": " first of all there is a clear distinction between national security and digital security"
    },
    {
      "Time_Start": 4785.3,
      "Time_End": 4789.3,
      "Text": " as the complexities within that and something that the OECD does because of course there's"
    },
    {
      "Time_Start": 4789.3,
      "Time_End": 4795.3,
      "Text": " international organizations have mandates and so the OECD doesn't look at national security"
    },
    {
      "Time_Start": 4795.3,
      "Time_End": 4799.3,
      "Text": " because there are other organizations that engage on that basis so they work at security"
    },
    {
      "Time_Start": 4799.3,
      "Time_End": 4803.3,
      "Text": " within the digital economy which is looking at vulnerabilities that help to, if exploited"
    },
    {
      "Time_Start": 4803.3,
      "Time_End": 4807.3,
      "Text": " can underpin digital security. Now of course I recognize that there have been diagrams"
    },
    {
      "Time_Start": 4807.3,
      "Time_End": 4813.3,
      "Text": " not two separate bubbles but there is an active decision to think well how can we do that"
    },
    {
      "Time_Start": 4813.3,
      "Time_End": 4818.3,
      "Text": " and I think a benefit of doing that from my side is that it helps to diffuse the conversation"
    },
    {
      "Time_Start": 4818.3,
      "Time_End": 4822.3,
      "Text": " about transparency, about sharing information because you can say I don't care about the"
    },
    {
      "Time_Start": 4822.3,
      "Time_End": 4826.3,
      "Text": " sort of national security stuff but we do need to track how much you're boosting resilience"
    },
    {
      "Time_Start": 4826.3,
      "Time_End": 4831.3,
      "Text": " and a helpful way to diffuse that is to focus on the digital security component."
    },
    {
      "Time_Start": 4831.3,
      "Time_End": 4835.3,
      "Text": " Another thing that I'd probably talk about is the talk about smaller countries. Again"
    },
    {
      "Time_Start": 4835.3,
      "Time_End": 4840.3,
      "Text": " the OECD has 38 member states and produces recommendations that are then shared with"
    },
    {
      "Time_Start": 4840.3,
      "Time_End": 4844.3,
      "Text": " and used quite often by those countries that are middle income and also section countries"
    },
    {
      "Time_Start": 4844.3,
      "Time_End": 4850.3,
      "Text": " so like the Brazils of this world which are looking to the outputs from those organizations"
    },
    {
      "Time_Start": 4850.3,
      "Time_End": 4855.3,
      "Text": " and saying well how can we look to use these as starters for how we look to introduce policies."
    },
    {
      "Time_Start": 4856.3,
      "Time_End": 4862.3,
      "Text": " On a sort of purely very specific point, on IoT security when the UK government introduced"
    },
    {
      "Time_Start": 4862.3,
      "Time_End": 4867.3,
      "Text": " the Product Security Telecommunications Infrastructure Act and prior to doing so we placed"
    },
    {
      "Time_Start": 4867.3,
      "Time_End": 4874.3,
      "Text": " we actually created a grant scheme which was supporting businesses to meet minimum requirements"
    },
    {
      "Time_Start": 4874.3,
      "Time_End": 4879.3,
      "Text": " and actually to look at how they can implement the better security practices within their products"
    },
    {
      "Time_Start": 4879.3,
      "Time_End": 4883.3,
      "Text": " and because we recognize that like actually there was the optimistic viewpoint that most"
    },
    {
      "Time_Start": 4883.3,
      "Time_End": 4888.3,
      "Text": " manufacturers wanted to do good but maybe just didn't know how so we created a grant"
    },
    {
      "Time_Start": 4888.3,
      "Time_End": 4893.3,
      "Text": " which supported the development of assurance schemes across connected televisions and also"
    },
    {
      "Time_Start": 4893.3,
      "Time_End": 4899.3,
      "Text": " smart connected toys because that's a particular motive and also just a self-assessment framework"
    },
    {
      "Time_Start": 4899.3,
      "Time_End": 4903.3,
      "Text": " that manufacturers could then use and that then came with free training that was available"
    },
    {
      "Time_Start": 4903.3,
      "Time_End": 4907.3,
      "Text": " so it's not like a perfect solution but it was something which government you know"
    },
    {
      "Time_Start": 4907.3,
      "Time_End": 4911.3,
      "Text": " helpful to prioritize thinking through how are you making sure that you are not you know"
    },
    {
      "Time_Start": 4911.3,
      "Time_End": 4915.3,
      "Text": " you're balancing the carrot and stick so supporting manufacturers particularly those at the smaller end"
    },
    {
      "Time_Start": 4915.3,
      "Time_End": 4920.3,
      "Text": " where you do want to generate the innovation and I think you know UK's use of ARIA is a really"
    },
    {
      "Time_Start": 4920.3,
      "Time_End": 4924.3,
      "Text": " it's a great example of you know taking the model from DARPA and looking to how we can amplify it"
    },
    {
      "Time_Start": 4924.3,
      "Time_End": 4927.3,
      "Text": " you know it's a really helpful scheme there as well so thank you for the question."
    },
    {
      "Time_Start": 4927.3,
      "Time_End": 4930.3,
      "Text": " Any other points on the panel?"
    },
    {
      "Time_Start": 4930.3,
      "Time_End": 4932.3,
      "Text": " Quick question, yes."
    },
    {
      "Time_Start": 4934.3,
      "Time_End": 4937.3,
      "Text": " Thank you all for doing this panel, I know most of you."
    },
    {
      "Time_Start": 4937.3,
      "Time_End": 4941.3,
      "Text": " As a former US government of cyber officials it's really great to hear how much commonality"
    },
    {
      "Time_Start": 4941.3,
      "Time_End": 4945.3,
      "Text": " there is in the approaches that your governments are taking but you know as we see increasingly"
    },
    {
      "Time_Start": 4945.3,
      "Time_End": 4950.3,
      "Text": " malicious authoritarian cyber attacks by authoritarian governments and increasingly"
    },
    {
      "Time_Start": 4950.3,
      "Time_End": 4956.3,
      "Text": " debilitating ransomware attacks the private sector plays a key role developing new capabilities"
    },
    {
      "Time_Start": 4956.3,
      "Time_End": 4961.3,
      "Text": " we have new programs like bug bounties that help get at you know identifying vulnerabilities."
    },
    {
      "Time_Start": 4961.3,
      "Time_End": 4966.3,
      "Text": " As you look to the future what do you think, what are you most optimistic about in the way"
    },
    {
      "Time_Start": 4966.3,
      "Time_End": 4969.3,
      "Text": " that the private sector can assist in doing cyber security?"
    },
    {
      "Time_Start": 4969.3,
      "Time_End": 4973.3,
      "Text": " Because we've talked a lot about what governments can do you know cyber security strategies,"
    },
    {
      "Time_Start": 4973.3,
      "Time_End": 4977.3,
      "Text": " workforce development but what are the things that you really want the private sector to"
    },
    {
      "Time_Start": 4977.3,
      "Time_End": 4981.3,
      "Text": " you know launch on that can really help the governments protect their citizens?"
    },
    {
      "Time_Start": 4981.3,
      "Time_End": 4982.3,
      "Text": " Thanks."
    },
    {
      "Time_Start": 4984.3,
      "Time_End": 4988.3,
      "Text": " I mean Brian you talked about how this isn't everyone's getting this together I think that's"
    },
    {
      "Time_Start": 4988.3,
      "Time_End": 4999.3,
      "Text": " totally true and that we have seen you know the there is the kind of well we need companies"
    },
    {
      "Time_Start": 4999.3,
      "Time_End": 5005.3,
      "Text": " to do better in terms of securing their code etc but also I do think that the companies"
    },
    {
      "Time_Start": 5005.3,
      "Time_End": 5009.3,
      "Text": " are the ones that come up with the solutions right I mean the most of the solutions in"
    },
    {
      "Time_Start": 5009.3,
      "Time_End": 5015.3,
      "Text": " the space don't come from governments that say oh here's here's how we can here's"
    },
    {
      "Time_Start": 5015.3,
      "Time_End": 5020.3,
      "Text": " what we need to implement in order to make this happen I mean look at uh even CSRB that"
    },
    {
      "Time_Start": 5020.3,
      "Time_End": 5026.3,
      "Text": " just put out this new uh report the the cyber security review board on the lapsus the first"
    },
    {
      "Time_Start": 5026.3,
      "Time_End": 5032.3,
      "Text": " thing on there is FIDO right the governments didn't create FIDO companies created FIDO"
    },
    {
      "Time_Start": 5032.3,
      "Time_End": 5037.3,
      "Text": " that's a standard that then is implemented by companies so I mean almost every solution"
    },
    {
      "Time_Start": 5037.3,
      "Time_End": 5044.3,
      "Text": " comes out of you know uh companies coming together addressing an issue um you know and"
    },
    {
      "Time_Start": 5044.3,
      "Time_End": 5049.3,
      "Text": " then that leads to it being standardized and then you kind of have the policies that"
    },
    {
      "Time_Start": 5049.3,
      "Time_End": 5054.3,
      "Text": " come over well we should implement this because there's a standard out there to do it um which"
    },
    {
      "Time_Start": 5054.3,
      "Time_End": 5058.3,
      "Text": " is one of the reasons I think there is some frustration from the way that Europe basically"
    },
    {
      "Time_Start": 5058.3,
      "Time_End": 5063.3,
      "Text": " says well we need to come up with a European standard first well the reason you know it's"
    },
    {
      "Time_Start": 5063.3,
      "Time_End": 5067.3,
      "Text": " a problem is because there was a standard out there already and people aren't implementing"
    },
    {
      "Time_Start": 5067.3,
      "Time_End": 5073.3,
      "Text": " it not because we need a new European standard right um so I think that that that uh that"
    },
    {
      "Time_Start": 5073.3,
      "Time_End": 5079.3,
      "Text": " is exactly the kind of like the we need to be able to get these standards we we need we"
    },
    {
      "Time_Start": 5079.3,
      "Time_End": 5084.3,
      "Text": " need to get that structure from okay we have a solution and we need to standardize the"
    },
    {
      "Time_Start": 5084.3,
      "Time_End": 5088.3,
      "Text": " solution we need to make internationalize that and we have to get governments to accept"
    },
    {
      "Time_Start": 5088.3,
      "Time_End": 5094.3,
      "Text": " that happen faster um than it does today uh but it's getting it is already pretty efficient"
    },
    {
      "Time_Start": 5094.3,
      "Time_End": 5100.3,
      "Text": " of a of a system if we can get people the the problem is more getting the people to"
    },
    {
      "Time_Start": 5100.3,
      "Time_End": 5105.3,
      "Text": " actually implement it or you know creating the structure in which people are forced to"
    },
    {
      "Time_Start": 5105.3,
      "Time_End": 5111.3,
      "Text": " implement it so. Thank you uh Rob I would say I mean the short answer is we need to"
    },
    {
      "Time_Start": 5111.3,
      "Time_End": 5115.3,
      "Text": " work on everything together well this is you know this is we have to work hand in glove"
    },
    {
      "Time_Start": 5115.3,
      "Time_End": 5119.3,
      "Text": " and in UK we have lots of initiatives like public private partnerships it's obviously"
    },
    {
      "Time_Start": 5119.3,
      "Time_End": 5124.3,
      "Text": " a buzzword of today but the industry 100 program we have the information exchanges"
    },
    {
      "Time_Start": 5124.3,
      "Time_End": 5129.3,
      "Text": " we have with our critical national infrastructure partners the charity sector with academia"
    },
    {
      "Time_Start": 5129.3,
      "Time_End": 5133.3,
      "Text": " it's it's everything is absolutely at the core of everything we do and we take it really"
    },
    {
      "Time_Start": 5133.3,
      "Time_End": 5137.3,
      "Text": " seriously I think what for me is just we have to make it as easy as possible for industry"
    },
    {
      "Time_Start": 5137.3,
      "Time_End": 5141.3,
      "Text": " you know you want to do you know obviously you've got your day jobs as well and it's"
    },
    {
      "Time_Start": 5141.3,
      "Time_End": 5145.3,
      "Text": " we just need to make it really clear and as actionable for you as possible."
    },
    {
      "Time_Start": 5149.3,
      "Time_End": 5153.3,
      "Text": " Thanks for the question Rob um yeah probably a bit more difficult from a European Union"
    },
    {
      "Time_Start": 5153.3,
      "Time_End": 5159.3,
      "Text": " perspective we're the ones who you always always seen as sort of taking a sort of sledgehammer"
    },
    {
      "Time_Start": 5159.3,
      "Time_End": 5168.3,
      "Text": " approach to to industry um innovation uh we you know there's lots of talk about so you"
    },
    {
      "Time_Start": 5168.3,
      "Time_End": 5171.3,
      "Text": " know there's innovation there's regulation and they're opposed to each other you can't"
    },
    {
      "Time_Start": 5171.3,
      "Time_End": 5177.3,
      "Text": " innovate if there's too much regulation you can't I think it's a bit of a BS uh dichotomy"
    },
    {
      "Time_Start": 5177.3,
      "Time_End": 5186.3,
      "Text": " um the famous phrase what is it um you know necessity is the mother of invention um when"
    },
    {
      "Time_Start": 5186.3,
      "Time_End": 5191.3,
      "Text": " GDPR was being discussed we had a lot of pushback a lot of pushback saying this isn't possible"
    },
    {
      "Time_Start": 5191.3,
      "Time_End": 5197.3,
      "Text": " nobody can do this do this and the very cynical amongst the the parliament at the time sort"
    },
    {
      "Time_Start": 5197.3,
      "Time_End": 5202.3,
      "Text": " of said you innovate you you're always claiming you can innovate go innovate go find a new"
    },
    {
      "Time_Start": 5202.3,
      "Time_End": 5207.3,
      "Text": " model instead of just sort of pimping off um people's private data in order to make"
    },
    {
      "Time_Start": 5207.3,
      "Time_End": 5212.3,
      "Text": " your money go find another way of of making money and people did innovate and we now have"
    },
    {
      "Time_Start": 5212.3,
      "Time_End": 5217.3,
      "Text": " very thriving business around privacy protection and a lot of businesses have made a lot of"
    },
    {
      "Time_Start": 5217.3,
      "Time_End": 5224.3,
      "Text": " money out of that um so I think there is I mean that's that's one extreme uh view personally"
    },
    {
      "Time_Start": 5225.3,
      "Time_End": 5232.3,
      "Text": " I don't necessarily share that um but I think innovation um has to there has to be incentives"
    },
    {
      "Time_Start": 5232.3,
      "Time_End": 5236.3,
      "Text": " and I think to say you know necessity is the mother of invention go out and innovate that's"
    },
    {
      "Time_Start": 5236.3,
      "Time_End": 5241.3,
      "Text": " that's fine in practice but if you're in an environment where innovation is rewarded and"
    },
    {
      "Time_Start": 5241.3,
      "Time_End": 5247.3,
      "Text": " that's clearly the sort of US um sort of free market model which which it makes uh it very"
    },
    {
      "Time_Start": 5247.3,
      "Time_End": 5253.3,
      "Text": " very attractive then the Europeans shouldn't be so surprised that some of that innovation"
    },
    {
      "Time_Start": 5253.3,
      "Time_End": 5260.3,
      "Text": " goes to the US I mean UK France Germany we have thriving IT infrastructure industries"
    },
    {
      "Time_Start": 5260.3,
      "Time_End": 5266.3,
      "Text": " and whatever through the 50s 60s and 70s we didn't innovate in the and we didn't invest"
    },
    {
      "Time_Start": 5266.3,
      "Time_End": 5271.3,
      "Text": " in those and today those a lot of those industries have uh have drifted away so I think there's"
    },
    {
      "Time_Start": 5271.3,
      "Time_End": 5277.3,
      "Text": " a more fundamental problem in terms of providing the incentives to industry to be able to come"
    },
    {
      "Time_Start": 5277.3,
      "Time_End": 5283.3,
      "Text": " up with the sort of responses you're talking about and I think that that imbalance between"
    },
    {
      "Time_Start": 5283.3,
      "Time_End": 5288.3,
      "Text": " the innovation response and the incentives I think is the core issue I don't have a magic"
    },
    {
      "Time_Start": 5288.3,
      "Time_End": 5292.3,
      "Text": " wand I don't have an obvious solution for that but I think that's where the that's where"
    },
    {
      "Time_Start": 5292.3,
      "Time_End": 5300.3,
      "Text": " the real problem lies. Uh so sorry three points from me so I think the I'm most optimistic"
    },
    {
      "Time_Start": 5300.3,
      "Time_End": 5305.3,
      "Text": " about uh the manner in which we're moving towards a more collaborative environment with"
    },
    {
      "Time_Start": 5305.3,
      "Time_End": 5311.3,
      "Text": " um industry on on threat sharing and threat blocking and certainly the JCD construct here"
    },
    {
      "Time_Start": 5311.3,
      "Time_End": 5315.3,
      "Text": " while still nascent I think is something that we're looking at very closely in Australia"
    },
    {
      "Time_Start": 5315.3,
      "Time_End": 5320.3,
      "Text": " and see if we can triage that to work within the Five Eyes to do something similar. The"
    },
    {
      "Time_Start": 5320.3,
      "Time_End": 5325.3,
      "Text": " other element to um the innovation point is around building sovereign capability with"
    },
    {
      "Time_Start": 5325.3,
      "Time_End": 5329.3,
      "Text": " the Australian government where there are incentives to do so and then also potentially"
    },
    {
      "Time_Start": 5329.3,
      "Time_End": 5336.3,
      "Text": " working with the within the AUKUS framework um to develop those those uh high-end technologies"
    },
    {
      "Time_Start": 5336.3,
      "Time_End": 5341.3,
      "Text": " that we will all need for the competition that's coming. The last point and to that"
    },
    {
      "Time_Start": 5341.3,
      "Time_End": 5346.3,
      "Text": " um that issue as well is working with the Quad partners and the ability to bring industry"
    },
    {
      "Time_Start": 5346.3,
      "Time_End": 5351.3,
      "Text": " into the into the dialogue there because the Quad which is India, Japan, Australia and"
    },
    {
      "Time_Start": 5351.3,
      "Time_End": 5357.3,
      "Text": " the United States has a huge economic uh heft behind it 28% of the world's GDP sits within"
    },
    {
      "Time_Start": 5357.3,
      "Time_End": 5362.3,
      "Text": " that those four countries so the ability of to shape and set standards is will be people"
    },
    {
      "Time_Start": 5362.3,
      "Time_End": 5369.3,
      "Text": " through that bringing industry into that conversation is is crucial. Can I just say thank you all"
    },
    {
      "Time_Start": 5369.3,
      "Time_End": 5374.3,
      "Text": " very much for the questions um and can I also thank you very much for our panel um so thank"
    },
    {
      "Time_Start": 5374.3,
      "Time_End": 5377.3,
      "Text": " you Ari, thank you Brian, thank you Peter and thank you Adam and thank you all uh for"
    },
    {
      "Time_Start": 5377.3,
      "Time_End": 5381.3,
      "Text": " joining um we will be around and around and available um for some time if you'd like to"
    },
    {
      "Time_Start": 5381.3,
      "Time_End": 5385.3,
      "Text": " have some conversations uh following the panel um but thank you very much and enjoy the rest"
    },
    {
      "Time_Start": 5385.3,
      "Time_End": 5386.3,
      "Text": " of your day."
    },
    {
      "Time_Start": 5386.3,
      "Time_End": 5387.3,
      "Text": " Thank you."
    },
    {
      "Time_Start": 5387.3,
      "Time_End": 5392.3,
      "Text": " Applause"
    }
  ]
}