{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 4.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n As I said, we are recording this on the record, but some folks in the audience may not want to"
    },
    {
      "Time_Start": 4.0,
      "Time_End": 9.3,
      "Text": " be uh internet famous, so keep that in mind. And with that, let's start with Harley for"
    },
    {
      "Time_Start": 9.3,
      "Time_End": 16.44,
      "Text": " introduction. Hi everybody, I am Harley Geiger and I'm a cyber security attorney with the"
    },
    {
      "Time_Start": 16.44,
      "Time_End": 21.82,
      "Text": " law firm Venable uh LLP. I've been working in cyber security law and policy for about 15"
    },
    {
      "Time_Start": 21.82,
      "Time_End": 27.12,
      "Text": " years. Um I've been a Hill staffer as well as a attorney at the uh Center for Democracy and"
    },
    {
      "Time_Start": 27.12,
      "Time_End": 30.880000000000003,
      "Text": " Technology as well as the cyber security firm Rapid 7. Thank you all so much for being"
    },
    {
      "Time_Start": 30.880000000000003,
      "Time_End": 37.760000000000005,
      "Text": " here. Hi everyone, my name is Michaela Lee. I work at the White House at the office of the"
    },
    {
      "Time_Start": 37.760000000000005,
      "Time_End": 43.16,
      "Text": " National Cyber Director as a director on our strategy and research team and previously"
    },
    {
      "Time_Start": 43.16,
      "Time_End": 47.1,
      "Text": " have worked at cyber security consulting firms um and my background is actually in human"
    },
    {
      "Time_Start": 47.1,
      "Time_End": 51.0,
      "Text": " rights and looking at the human rights violations that can stem from the use of tech"
    },
    {
      "Time_Start": 51.02,
      "Time_End": 57.52,
      "Text": " products and services. Hello, good morning everyone. My name is Suzanne Schwartz and I am"
    },
    {
      "Time_Start": 57.52,
      "Time_End": 63.24,
      "Text": " the director of the Office of Strategic Partnerships and Technology Innovation at FDA's"
    },
    {
      "Time_Start": 63.24,
      "Time_End": 68.84,
      "Text": " Center for Devices and Radiological Health. It is our center and our office that has"
    },
    {
      "Time_Start": 68.84,
      "Time_End": 75.84,
      "Text": " spearheaded the efforts around regulating medical devices from a cyber security"
    },
    {
      "Time_Start": 75.86,
      "Time_End": 80.86,
      "Text": " perspective. You'll hear more about that. Hello, my name is Lindsey Forsen. I am the deputy"
    },
    {
      "Time_Start": 83.72,
      "Time_End": 90.24000000000001,
      "Text": " executive director of the National Association of Secretaries of State or NASS. Um I handle"
    },
    {
      "Time_Start": 90.24000000000001,
      "Time_End": 95.74000000000001,
      "Text": " our cyber security and election security profile among other things at NASS. Um I came to"
    },
    {
      "Time_Start": 95.74000000000001,
      "Time_End": 102.58000000000001,
      "Text": " NASS by way of academia where I um looked at cyber security for local election offices from"
    },
    {
      "Time_Start": 102.62,
      "Time_End": 107.62,
      "Text": " an administrative capacity standpoint at Auburn University. Happy to be here. Hi everyone,"
    },
    {
      "Time_Start": 111.16,
      "Time_End": 115.8,
      "Text": " my name is Lauren Zabrick. I am a senior advisor at the Cyber Security and Infrastructure"
    },
    {
      "Time_Start": 115.8,
      "Time_End": 120.8,
      "Text": " Security Agency or CISA um in the cyber security division. Um I came to this role from"
    },
    {
      "Time_Start": 122.98,
      "Time_End": 126.94,
      "Text": " the Belfer Center at the Harvard Kennedy School where I ran the cyber project for a couple"
    },
    {
      "Time_Start": 126.98,
      "Time_End": 133.78,
      "Text": " of years. Prior to that um I was at Recorded Future. Prior to that I um I was a an"
    },
    {
      "Time_Start": 133.78,
      "Time_End": 138.38,
      "Text": " intelligence analyst in the government where I did uh counter terrorism work and prior to"
    },
    {
      "Time_Start": 138.38,
      "Time_End": 145.4,
      "Text": " that I was in the military. Thanks. Alright, so the way this is going to work um I've been"
    },
    {
      "Time_Start": 145.4,
      "Time_End": 151.2,
      "Text": " asked to give a fifteen minute or so overview uh just about a high level of US cyber"
    },
    {
      "Time_Start": 151.2,
      "Time_End": 156.3,
      "Text": " policy and then I'll turn it over to these amazing colleagues here to talk about their"
    },
    {
      "Time_Start": 156.3,
      "Time_End": 160.94,
      "Text": " work and uh and their agencies and uh how they fit into cyber policy and some of their"
    },
    {
      "Time_Start": 160.94,
      "Time_End": 165.94,
      "Text": " priorities. So, we'll get started. So, a few years ago, right, it and I think for people who"
    },
    {
      "Time_Start": 169.32000000000002,
      "Time_End": 174.54000000000002,
      "Text": " have been uh paying attention to this space, there we spent a lot of time as advocates"
    },
    {
      "Time_Start": 174.54000000000002,
      "Time_End": 180.02,
      "Text": " trying to convince the uh the government that cyber security was a problem and that we"
    },
    {
      "Time_Start": 180.02,
      "Time_End": 186.06,
      "Text": " needed to do something about it. Uh we are past that stage of advocacy. Uh the federal"
    },
    {
      "Time_Start": 186.06,
      "Time_End": 190.82,
      "Text": " government and many of the states also are are now aware of cyber security. It's"
    },
    {
      "Time_Start": 190.82,
      "Time_End": 195.32,
      "Text": " frontline news every day uh and there is a lot of action that is happening in this space"
    },
    {
      "Time_Start": 195.32,
      "Time_End": 199.96,
      "Text": " and so the question is more about you know like like what do we do as opposed to should we"
    },
    {
      "Time_Start": 199.96,
      "Time_End": 204.94,
      "Text": " do something. Um and so I'm gonna give you start out with sort of a high level like like"
    },
    {
      "Time_Start": 204.94,
      "Time_End": 210.88,
      "Text": " just very rough uh uh estimate of the numbers uh to show kind of like some of the the"
    },
    {
      "Time_Start": 210.88,
      "Time_End": 215.28,
      "Text": " volume of action on this. So, in the United States, the the legislative branch, so this is"
    },
    {
      "Time_Start": 215.3,
      "Time_End": 221.5,
      "Text": " the US House and the US Senate. Uh right now, in the current Congress, which is a two-year"
    },
    {
      "Time_Start": 221.5,
      "Time_End": 226.68,
      "Text": " two-year Congress, um there are a hundred and ninety-five bills with cyber security in it."
    },
    {
      "Time_Start": 226.68,
      "Time_End": 231.82,
      "Text": " Um this is again a very rough measure but uh but gives you a sense of it. Thirteen have"
    },
    {
      "Time_Start": 231.82,
      "Time_End": 235.22,
      "Text": " already passed one chamber, meaning that one has passed the House or one has passed the"
    },
    {
      "Time_Start": 235.22,
      "Time_End": 241.3,
      "Text": " Senate and two have passed both chambers. In the executive branch, oops, in the executive"
    },
    {
      "Time_Start": 241.32000000000002,
      "Time_End": 247.66000000000003,
      "Text": " branch, you have 213 notices and proposed rules with cyber security in 2023. Um and here,"
    },
    {
      "Time_Start": 247.66000000000003,
      "Time_End": 252.26000000000002,
      "Text": " we're just looking at cyber security. Um it you know, so it's cutting out a number of other"
    },
    {
      "Time_Start": 252.26000000000002,
      "Time_End": 257.40000000000003,
      "Text": " regulations that are sort of adjacent or that matter uh to cyber security. Uh 28 are"
    },
    {
      "Time_Start": 257.40000000000003,
      "Time_End": 261.7,
      "Text": " proposed rules, meaning these are regulations that the US government is considering and"
    },
    {
      "Time_Start": 261.7,
      "Time_End": 266.24,
      "Text": " then 30 have become rules. Uh many, the reason the numbers are different is because some"
    },
    {
      "Time_Start": 266.26,
      "Time_End": 271.26,
      "Text": " of those came from uh before 2023. And I don't have great numbers for the states, uh uh"
    },
    {
      "Time_Start": 274.40000000000003,
      "Time_End": 279.40000000000003,
      "Text": " credit to uh NCSL, um but in 2022, uh 40 states considered about 250 cyber security"
    },
    {
      "Time_Start": 281.84000000000003,
      "Time_End": 286.84000000000003,
      "Text": " bills. Uh 24 enacted some form of cyber security legislation and um and many others are"
    },
    {
      "Time_Start": 289.18,
      "Time_End": 294.92,
      "Text": " considering it presently. Um just haven't, don't have great full state uh coverage right"
    },
    {
      "Time_Start": 294.96000000000004,
      "Time_End": 301.0,
      "Text": " now for 2023. So a fair amount of action, right? Especially compared to say a decade ago"
    },
    {
      "Time_Start": 301.0,
      "Time_End": 305.7,
      "Text": " when this was, this was not on the radar of most politicians. Uh so it is, it is a high"
    },
    {
      "Time_Start": 305.7,
      "Time_End": 310.34000000000003,
      "Text": " amount of volume. This doesn't even include things like guidance or non-regulatory"
    },
    {
      "Time_Start": 310.34000000000003,
      "Time_End": 315.72,
      "Text": " documents like uh like guidance, um uh best practices, things like that, standards. Um"
    },
    {
      "Time_Start": 315.72,
      "Time_End": 320.76,
      "Text": " there's a high volume of those as well. So I'm gonna talk a little bit now about some of"
    },
    {
      "Time_Start": 320.8,
      "Time_End": 324.44,
      "Text": " the specific sectors uh that this is happening. And starting with critical"
    },
    {
      "Time_Start": 324.44,
      "Time_End": 328.3,
      "Text": " infrastructure. I think that critical infrastructure is a really important one uh"
    },
    {
      "Time_Start": 328.3,
      "Time_End": 332.38,
      "Text": " particularly this year. Not only because it's critical infrastructure, it's the stuff"
    },
    {
      "Time_Start": 332.38,
      "Time_End": 338.24,
      "Text": " that we depend on for life and safety. Um but because this is a year where, this in the"
    },
    {
      "Time_Start": 338.24,
      "Time_End": 342.36,
      "Text": " end of 2022 is a year where there's sort of a turning point in terms of the US"
    },
    {
      "Time_Start": 342.36,
      "Time_End": 346.52,
      "Text": " government's approach to critical infrastructure cyber security. Um the previous"
    },
    {
      "Time_Start": 346.52,
      "Time_End": 350.7,
      "Text": " model was sort of voluntary risk management. Right? So there are for many uh"
    },
    {
      "Time_Start": 350.7,
      "Time_End": 355.0,
      "Text": " sectors with the exception maybe of both electric or the financial sector, many"
    },
    {
      "Time_Start": 355.0,
      "Time_End": 360.94,
      "Text": " sectors did not really have a cyber security rule requiring them specifically to secure"
    },
    {
      "Time_Start": 360.94,
      "Time_End": 366.24,
      "Text": " their, their infrastructure. Um and so as a result the, the approach was you know we"
    },
    {
      "Time_Start": 366.24,
      "Time_End": 371.97999999999996,
      "Text": " will work with the sector, we'll come up with a, a sector specific plan and uh the"
    },
    {
      "Time_Start": 372.04,
      "Time_End": 376.88,
      "Text": " oversight has been criticized in the past as being very loose uh for, for those uh for"
    },
    {
      "Time_Start": 376.88,
      "Time_End": 382.06,
      "Text": " those sectors. Um what is changing now and this was announced very clearly in the"
    },
    {
      "Time_Start": 382.06,
      "Time_End": 386.5,
      "Text": " national cyber strategy that was released earlier this year is that the government uh"
    },
    {
      "Time_Start": 386.5,
      "Time_End": 392.0,
      "Text": " no longer views this voluntary model as sufficient. Uh that we have sort of gone,"
    },
    {
      "Time_Start": 392.0,
      "Time_End": 396.64000000000004,
      "Text": " made progress but have gone about as far as we're going to go with entirely voluntary"
    },
    {
      "Time_Start": 396.64000000000004,
      "Time_End": 401.28000000000003,
      "Text": " risk management. And so the emerging model for critical infrastructure uh cyber"
    },
    {
      "Time_Start": 401.3,
      "Time_End": 406.88000000000005,
      "Text": " security regulation is for the government to use its existing authority in ways that"
    },
    {
      "Time_Start": 406.88000000000005,
      "Time_End": 412.68,
      "Text": " are somewhat creative um and ideally in ways that are straightforward. Um and where"
    },
    {
      "Time_Start": 412.68,
      "Time_End": 417.22,
      "Text": " there are gaps in cyber security regulation for the, for the uh the sectors to then seek"
    },
    {
      "Time_Start": 417.22,
      "Time_End": 422.70000000000005,
      "Text": " out new authorities uh from congress uh to in order to have cyber security uh"
    },
    {
      "Time_Start": 422.70000000000005,
      "Time_End": 428.26000000000005,
      "Text": " requirements explicit in regulation. Um in the just the past year, year and a half"
    },
    {
      "Time_Start": 428.28,
      "Time_End": 433.12,
      "Text": " we've seen regulations for some sectors that include uh the water sector, rail,"
    },
    {
      "Time_Start": 433.12,
      "Time_End": 438.26,
      "Text": " pipelines, aviation, financial. I think we are all uh broadly anticipating the chemical"
    },
    {
      "Time_Start": 438.26,
      "Time_End": 442.3,
      "Text": " sector. There's a lot of talk about something coming in the, in the health sector. Um"
    },
    {
      "Time_Start": 442.3,
      "Time_End": 447.24,
      "Text": " you'll hear soon about uh medical devices. So there's been a lot happening on critical"
    },
    {
      "Time_Start": 447.24,
      "Time_End": 452.8,
      "Text": " infrastructure. This is the top, I believe it is the first priority actually uh"
    },
    {
      "Time_Start": 452.8,
      "Time_End": 456.84,
      "Text": " chronologically in the national cyber strategy. So this is a sector, or this is an"
    },
    {
      "Time_Start": 456.86,
      "Time_End": 463.56000000000006,
      "Text": " area of cyber policy that I think we can expect to roll on uh for the next few years. Um"
    },
    {
      "Time_Start": 463.56000000000006,
      "Time_End": 469.24,
      "Text": " another big one, the IOT uh security uh trust mark. Uh they're calling it a trust mark"
    },
    {
      "Time_Start": 469.24,
      "Time_End": 473.48,
      "Text": " because people just lose it when they hear the word label. They think oh it's a sticker on a"
    },
    {
      "Time_Start": 473.48,
      "Time_End": 478.04,
      "Text": " physical box. No, it is not a sticker on a physical box. Um it's what we call it the trust"
    },
    {
      "Time_Start": 478.04,
      "Time_End": 483.08000000000004,
      "Text": " mark so people don't get it confused. Um what we are talking about here is uh IOT"
    },
    {
      "Time_Start": 483.12,
      "Time_End": 488.12,
      "Text": " labeling uh the nutrition label this is. A mark on uh connected devices. It can be on the"
    },
    {
      "Time_Start": 492.5,
      "Time_End": 498.59999999999997,
      "Text": " physical packaging. It can be on the uh the online content around the device that shows"
    },
    {
      "Time_Start": 498.59999999999997,
      "Time_End": 503.03999999999996,
      "Text": " that the device has some sort of baseline level of security. This has been talked about"
    },
    {
      "Time_Start": 503.03999999999996,
      "Time_End": 508.52,
      "Text": " for a long time but what's changed now is that the White House has announced that it is"
    },
    {
      "Time_Start": 508.52000000000004,
      "Time_End": 513.6600000000001,
      "Text": " going forward with this. That it has White House backing. The uh Federal Communications"
    },
    {
      "Time_Start": 513.6600000000001,
      "Time_End": 519.7,
      "Text": " Commission recently issued a notice of proposed rule making to implement uh this concept."
    },
    {
      "Time_Start": 519.7,
      "Time_End": 525.64,
      "Text": " So it is, it is going to march ahead. Um and again it is, this is not just a static label"
    },
    {
      "Time_Start": 525.64,
      "Time_End": 530.88,
      "Text": " like just a symbol by itself. The vision for it is that it will be layered and dynamic."
    },
    {
      "Time_Start": 530.88,
      "Time_End": 537.2800000000001,
      "Text": " Meaning that uh as a regular consumer you can see sort of top line very basic information."
    },
    {
      "Time_Start": 537.28,
      "Time_End": 541.72,
      "Text": " If you are a more sophisticated consumer like the fine people in this room you can go into a"
    },
    {
      "Time_Start": 541.72,
      "Time_End": 546.36,
      "Text": " deeper layer to get more technical information. And then very very deep layers for things"
    },
    {
      "Time_Start": 546.36,
      "Time_End": 551.36,
      "Text": " like machine readable information. Uh there is talk of including a QR code on it which I"
    },
    {
      "Time_Start": 551.36,
      "Time_End": 557.76,
      "Text": " think is going to be very interesting. Um and the security content that you have to"
    },
    {
      "Time_Start": 557.76,
      "Time_End": 563.88,
      "Text": " attest to in order to apply and use the trust mark is going to be voluntary uh security"
    },
    {
      "Time_Start": 563.88,
      "Time_End": 568.38,
      "Text": " standards that are issued by NIST. NIST has issued a IOT security baseline and that's going"
    },
    {
      "Time_Start": 568.38,
      "Time_End": 573.82,
      "Text": " to be we anticipate the criteria. So although you're not required to use the trust mark,"
    },
    {
      "Time_Start": 573.82,
      "Time_End": 579.22,
      "Text": " if you use it but you are falsifying your attestation. You're saying we've, we've met this"
    },
    {
      "Time_Start": 579.22,
      "Time_End": 584.8,
      "Text": " baseline but you haven't. Then you could be liable for uh for false marketing. You know"
    },
    {
      "Time_Start": 584.8,
      "Time_End": 589.74,
      "Text": " false advertising under the FTC Act. Um and so in that way you, there is an enforcement"
    },
    {
      "Time_Start": 589.76,
      "Time_End": 595.24,
      "Text": " mechanism. Um I mentioned that the FCC has this notice of proposed rule making out now. Uh"
    },
    {
      "Time_Start": 595.24,
      "Time_End": 599.24,
      "Text": " there is an opportunity for everyone to comment on that. They're soliciting public feedback if"
    },
    {
      "Time_Start": 599.24,
      "Time_End": 604.24,
      "Text": " you want to get involved. Uh it is widely viewed as a right now focused on consumer IOT."
    },
    {
      "Time_Start": 606.64,
      "Time_End": 612.96,
      "Text": " Uh but there is discussion about also applying this concept if not this exact label to routers"
    },
    {
      "Time_Start": 612.96,
      "Time_End": 617.96,
      "Text": " and industrial IOT uh OT next. So I'm going to talk a little bit more about the"
    },
    {
      "Time_Start": 619.82,
      "Time_End": 625.8,
      "Text": " vulnerability. Vulnerability disclosure is a um is a topic that has been discussed a lot at"
    },
    {
      "Time_Start": 625.8,
      "Time_End": 632.64,
      "Text": " DEF CON and we are seeing the good kind of vulnerability disclosure proliferate through"
    },
    {
      "Time_Start": 632.64,
      "Time_End": 638.54,
      "Text": " regulations and policies in the United States and abroad. So when I say the good kind I mean"
    },
    {
      "Time_Start": 638.54,
      "Time_End": 643.78,
      "Text": " we have a channel that is open and if you submit your vulnerabilities to us then we will triage"
    },
    {
      "Time_Start": 643.78,
      "Time_End": 648.66,
      "Text": " them and do something about it and then you know communicate back out with you and you can"
    },
    {
      "Time_Start": 648.74,
      "Time_End": 653.78,
      "Text": " tweet about it or something. Um what we're, what is changing however, we're seeing this as a"
    },
    {
      "Time_Start": 653.78,
      "Time_End": 659.62,
      "Text": " regulatory trend is that there are a growing number of regulations that contemplate"
    },
    {
      "Time_Start": 659.62,
      "Time_End": 666.56,
      "Text": " requiring disclosure of vulnerabilities to government agencies and on timelines that don't"
    },
    {
      "Time_Start": 666.56,
      "Time_End": 672.1,
      "Text": " necessarily mean that that vulnerability is going to be patched. Uh so a big one is the EU"
    },
    {
      "Time_Start": 672.1,
      "Time_End": 677.64,
      "Text": " Cyber Resilience Act. If you have not heard of that law you will. Uh it will have a GDPR"
    },
    {
      "Time_Start": 677.68,
      "Time_End": 684.3199999999999,
      "Text": " like effect on security when it passes. I say when because it's going to pass. Uh this is uh it's"
    },
    {
      "Time_Start": 684.3199999999999,
      "Time_End": 689.0,
      "Text": " not law yet. They're discussing it sort of at the legislative level but it is at a very advanced"
    },
    {
      "Time_Start": 689.0,
      "Time_End": 695.76,
      "Text": " stage. The EU Cyber Resilience Act includes provisions uh to require organizations if they"
    },
    {
      "Time_Start": 695.76,
      "Time_End": 702.24,
      "Text": " have an actively exploited vulnerability to to notify uh it's unclear which which government"
    },
    {
      "Time_Start": 702.28,
      "Time_End": 707.32,
      "Text": " agency it'll be, possibly a NISA, possibly the uh the CISRTS, uh but notify them about that"
    },
    {
      "Time_Start": 707.32,
      "Time_End": 712.76,
      "Text": " vulnerability within 24 hours. So within 24 hours of finding out that your vulnerability is"
    },
    {
      "Time_Start": 712.76,
      "Time_End": 718.48,
      "Text": " exploited is not enough time most likely to uh patch that vulnerability and this is for any"
    },
    {
      "Time_Start": 718.48,
      "Time_End": 725.48,
      "Text": " software being sold in the EU. The effect of it will be a rolling list of software packages"
    },
    {
      "Time_Start": 725.48,
      "Time_End": 731.12,
      "Text": " with vulnerabilities that were recently exploited and not likely uh patched um being shared"
    },
    {
      "Time_Start": 731.12,
      "Time_End": 736.12,
      "Text": " among EU government agencies. Um in France uh there is a similar uh similar uh it's now law."
    },
    {
      "Time_Start": 739.24,
      "Time_End": 743.84,
      "Text": " So it's a similar law. This was in their uh military programming legislation and it too"
    },
    {
      "Time_Start": 743.84,
      "Time_End": 749.28,
      "Text": " required uh disclosure of vulnerabilities uh to the uh French government uh to to ANSI"
    },
    {
      "Time_Start": 749.28,
      "Time_End": 755.36,
      "Text": " actually um within a short period of time. Less than less than 3 days. Um and there it was"
    },
    {
      "Time_Start": 755.36,
      "Time_End": 760.32,
      "Text": " not even a distinction I believe of uh whether or not the the the vulnerability was exploited."
    },
    {
      "Time_Start": 760.84,
      "Time_End": 764.96,
      "Text": " Um at this time there's no distinction between whether the vulnerability is exploited by a"
    },
    {
      "Time_Start": 764.96,
      "Time_End": 768.88,
      "Text": " criminal or by good face security researchers and there's no distinction as it as it relates"
    },
    {
      "Time_Start": 768.88,
      "Time_End": 773.44,
      "Text": " to severity. If you're wondering how organizations are even going to comply with this you're not"
    },
    {
      "Time_Start": 773.44,
      "Time_End": 780.32,
      "Text": " alone. Um uh China has a somewhat now famous vulnerability requi- uh disclosure requirement."
    },
    {
      "Time_Start": 780.32,
      "Time_End": 785.9200000000001,
      "Text": " This was passed um I believe last year it came in came into effect. Uh and this too requires"
    },
    {
      "Time_Start": 785.9200000000001,
      "Time_End": 793.84,
      "Text": " every organization to have a a CBD uh you know vulnerability disclosure policy but to pass on"
    },
    {
      "Time_Start": 793.84,
      "Time_End": 799.3600000000001,
      "Text": " disclosures to the Chinese government. If you are an independent researcher you have the the the"
    },
    {
      "Time_Start": 799.3600000000001,
      "Time_End": 804.72,
      "Text": " great choice of disclosing your vulnerabilities that you have discovered to the company that"
    },
    {
      "Time_Start": 804.72,
      "Time_End": 808.8000000000001,
      "Text": " owns it which then must disclose it to the Chinese government or to the Chinese government."
    },
    {
      "Time_Start": 808.8000000000001,
      "Time_End": 813.1200000000001,
      "Text": " That's it. You don't get to talk about it publicly. So this is a trend that we're seeing"
    },
    {
      "Time_Start": 813.12,
      "Time_End": 818.88,
      "Text": " worldwide. There is uh indeed in the United States now legislation to update FISMA. FISMA"
    },
    {
      "Time_Start": 818.88,
      "Time_End": 823.36,
      "Text": " is the law that requires security for government agencies that looks at doing something somewhat"
    },
    {
      "Time_Start": 823.36,
      "Time_End": 826.64,
      "Text": " similar. I'm not going to spend a lot of time on that because it's still new and I don't expect"
    },
    {
      "Time_Start": 826.64,
      "Time_End": 832.32,
      "Text": " it to pass but it is out there. Um the reason why we think this is a problem quickly and probably"
    },
    {
      "Time_Start": 832.32,
      "Time_End": 837.52,
      "Text": " many of you get this is that if we're disclosing unmitigated vulnerabilities to a lot of government"
    },
    {
      "Time_Start": 837.52,
      "Time_End": 842.72,
      "Text": " agencies there are risks. You are depending on the security of that government agency and the EU"
    },
    {
      "Time_Start": 842.72,
      "Time_End": 846.72,
      "Text": " under the Cyber Resilience Act model if it goes to all the agencies they contemplate it's more"
    },
    {
      "Time_Start": 846.72,
      "Time_End": 851.44,
      "Text": " than 50. 50 agencies. You're depending on the security of all of them not to alert adversaries."
    },
    {
      "Time_Start": 852.0,
      "Time_End": 856.4,
      "Text": " You are also depending on trust that they will not use these vulnerabilities for surveillance"
    },
    {
      "Time_Start": 856.4,
      "Time_End": 862.32,
      "Text": " purposes. And independent research unless it's specifically carved out it's going to be kicking"
    },
    {
      "Time_Start": 862.32,
      "Time_End": 867.44,
      "Text": " off this this process where you know I found a vulnerability in your software and now you have"
    },
    {
      "Time_Start": 867.44,
      "Time_End": 871.28,
      "Text": " to tell the government. That's going to make it so that you are not as welcoming to my vulnerability"
    },
    {
      "Time_Start": 871.28,
      "Time_End": 879.76,
      "Text": " disclosure. So keep an eye out for this. Incident reporting. So here we're talking about separately"
    },
    {
      "Time_Start": 879.76,
      "Time_End": 884.3199999999999,
      "Text": " from vulnerability disclosure also separate from breach notification. So when we talked about"
    },
    {
      "Time_Start": 884.3199999999999,
      "Time_End": 890.64,
      "Text": " breach notification in the past that was about loss of personal information. Here there is a"
    },
    {
      "Time_Start": 890.64,
      "Time_End": 896.8,
      "Text": " at this point fairly well developed set of laws and requirements to disclose cyber incidents that"
    },
    {
      "Time_Start": 896.8000000000001,
      "Time_End": 901.0400000000001,
      "Text": " are independent of whether or not personal information is involved right. And so if you"
    },
    {
      "Time_Start": 901.0400000000001,
      "Time_End": 906.8000000000001,
      "Text": " have been disrupted in some sort of way you now depending on what sector you sit in may have an"
    },
    {
      "Time_Start": 906.8000000000001,
      "Time_End": 913.44,
      "Text": " obligation to notify regulators. So CERCIA is a big one that's for critical infrastructure owners"
    },
    {
      "Time_Start": 913.44,
      "Time_End": 918.08,
      "Text": " and operators. It flows down to their contractors as well. So if they experience a significant"
    },
    {
      "Time_Start": 918.08,
      "Time_End": 923.5200000000001,
      "Text": " incident they will have to notify CISA. That is not yet in effect but it is it is law but there"
    },
    {
      "Time_Start": 923.52,
      "Time_End": 928.16,
      "Text": " is at a regulatory stage where the final regulation is not out. Many of you have probably heard in"
    },
    {
      "Time_Start": 928.16,
      "Time_End": 932.8,
      "Text": " recent days of the Securities and Exchange Commission requirements the SEC. This is a very"
    },
    {
      "Time_Start": 932.8,
      "Time_End": 938.3199999999999,
      "Text": " big one. This applies to every publicly traded company and the requirement is such that if you"
    },
    {
      "Time_Start": 938.3199999999999,
      "Time_End": 943.6,
      "Text": " are a publicly traded company and you experience a material cybersecurity incident you must disclose"
    },
    {
      "Time_Start": 943.6,
      "Time_End": 949.68,
      "Text": " this effectively publicly within four days of determining that this is a material incident."
    },
    {
      "Time_Start": 949.6800000000001,
      "Time_End": 956.24,
      "Text": " So you disclose it through your 8k form which then goes on to the EDGAR system and that is"
    },
    {
      "Time_Start": 956.24,
      "Time_End": 961.5200000000001,
      "Text": " public. So that is in again four days not clear whether or not your incident is going to be"
    },
    {
      "Time_Start": 961.5200000000001,
      "Time_End": 967.2800000000001,
      "Text": " contained or mitigated at that time. There's a bunch of others. So financial sector FCC point is"
    },
    {
      "Time_Start": 967.2800000000001,
      "Time_End": 972.08,
      "Text": " for every sectoral regulator that's out there they want a piece of this action and they're all"
    },
    {
      "Time_Start": 972.08,
      "Time_End": 976.1600000000001,
      "Text": " putting out incident reporting requirements. There's not a general one for the United States"
    },
    {
      "Time_Start": 976.16,
      "Time_End": 980.9599999999999,
      "Text": " but the patchwork does spread pretty broad. And when I say patchwork we recognize that there's a"
    },
    {
      "Time_Start": 980.9599999999999,
      "Time_End": 986.24,
      "Text": " patchwork. The U.S. government has talked openly about it. CERCIA itself has a has a part of it"
    },
    {
      "Time_Start": 986.24,
      "Time_End": 992.0,
      "Text": " in the law that requires CISA to have a incident reporting harmonization council. But harmonization"
    },
    {
      "Time_Start": 992.0,
      "Time_End": 996.56,
      "Text": " is also just a fancy word. What do we what do we really mean by that? What is what is the outcome"
    },
    {
      "Time_Start": 996.56,
      "Time_End": 1003.1999999999999,
      "Text": " going to be? And especially how will that process affect independent agencies like the SEC that"
    },
    {
      "Time_Start": 1003.2,
      "Time_End": 1007.2800000000001,
      "Text": " don't necessarily have to listen? How will it affect things like the cyber resilience acts,"
    },
    {
      "Time_Start": 1007.2800000000001,
      "Time_End": 1014.88,
      "Text": " non-U.S. organizations? And then lastly the talk about incident reporting is is fine. Transparency"
    },
    {
      "Time_Start": 1014.88,
      "Time_End": 1019.5200000000001,
      "Text": " is good but we had transparency with data breach notification. It didn't fix privacy."
    },
    {
      "Time_Start": 1019.5200000000001,
      "Time_End": 1023.84,
      "Text": " Cyber incident reporting is not going to fix cyber security. It'll be a big compliance burden"
    },
    {
      "Time_Start": 1023.84,
      "Time_End": 1027.44,
      "Text": " and it will help transparency. It will help some things but it is not the same thing as resilience."
    },
    {
      "Time_Start": 1028.4,
      "Time_End": 1036.4,
      "Text": " So beyond just incident reporting there is this right now there is a drive within the U.S."
    },
    {
      "Time_Start": 1036.4,
      "Time_End": 1042.0800000000002,
      "Text": " government driven by the White House to harmonize cyber security regulations more broadly not just"
    },
    {
      "Time_Start": 1042.0800000000002,
      "Time_End": 1048.96,
      "Text": " about cyber incidents. It is almost like cyber should have a policy. And so the office of the"
    },
    {
      "Time_Start": 1048.96,
      "Time_End": 1057.2,
      "Text": " national coordinator for for cyber has issued a regulatory harmonization initiative and has"
    },
    {
      "Time_Start": 1057.6000000000001,
      "Time_End": 1063.1200000000001,
      "Text": " asking for public feedback right now. That is a request for information that is present and anyone"
    },
    {
      "Time_Start": 1063.1200000000001,
      "Time_End": 1069.52,
      "Text": " here can comment on it. But the idea is to try to as much as possible get our cyber security"
    },
    {
      "Time_Start": 1070.0800000000002,
      "Time_End": 1078.0,
      "Text": " requirements to be more consistent and ideally to be based on a level of a baseline. And that"
    },
    {
      "Time_Start": 1078.0,
      "Time_End": 1085.6000000000001,
      "Text": " baseline right now looks like probably it will be the performance goals that the that CISA has"
    },
    {
      "Time_Start": 1085.6,
      "Time_End": 1092.3999999999999,
      "Text": " issued. But it may differ by sector. Streamlining regulations that are redundant so that you don't"
    },
    {
      "Time_Start": 1092.3999999999999,
      "Time_End": 1099.4399999999998,
      "Text": " have to comply with the same thing twice and issue two incidents for example. And ideally cutting"
    },
    {
      "Time_Start": 1099.4399999999998,
      "Time_End": 1105.52,
      "Text": " across not just the federal sectors but also states as well. Here again however you have the"
    },
    {
      "Time_Start": 1105.52,
      "Time_End": 1109.4399999999998,
      "Text": " same problem as harmonization with incident reporting. How will it affect independent"
    },
    {
      "Time_Start": 1109.4399999999998,
      "Time_End": 1115.1999999999998,
      "Text": " agencies? How will they work with states? And many of the problems are outside of the United States"
    },
    {
      "Time_Start": 1115.2,
      "Time_End": 1119.6000000000001,
      "Text": " as far as regulatory compliance. So it's a significant challenge but this is one that is"
    },
    {
      "Time_Start": 1119.6000000000001,
      "Time_End": 1122.8,
      "Text": " ongoing right now. We're going to hear more about harmonization for the rest of the year."
    },
    {
      "Time_Start": 1124.32,
      "Time_End": 1129.92,
      "Text": " And then artificial intelligence. It's so hot right now but if it's already illegal to hack"
    },
    {
      "Time_Start": 1130.64,
      "Time_End": 1134.64,
      "Text": " does it need to be more illegal to hack with artificial intelligence? There's a lot that's"
    },
    {
      "Time_Start": 1134.64,
      "Time_End": 1139.8400000000001,
      "Text": " happening and I want to kick it briefly to my killer colleague Heather West who follows this"
    },
    {
      "Time_Start": 1139.8400000000001,
      "Time_End": 1143.04,
      "Text": " space very closely to talk about some of what's happening in artificial intelligence."
    },
    {
      "Time_Start": 1143.92,
      "Time_End": 1149.6,
      "Text": " I love that I get to jump up here for just a hot second. As Harley said you know artificial"
    },
    {
      "Time_Start": 1149.6,
      "Time_End": 1153.52,
      "Text": " intelligence is all over the place. Is it new? Is it not? Who knows? I mean we kind of know."
    },
    {
      "Time_Start": 1154.56,
      "Time_End": 1159.12,
      "Text": " But it's it's worth walking through a little bit of what various governments are thinking about"
    },
    {
      "Time_Start": 1159.12,
      "Time_End": 1163.04,
      "Text": " here because it could be really really impactful particularly at the intersection of these"
    },
    {
      "Time_Start": 1163.04,
      "Time_End": 1168.48,
      "Text": " artificial intelligence systems and cybersecurity. One of the things that that I think is a little"
    },
    {
      "Time_Start": 1168.48,
      "Time_End": 1173.84,
      "Text": " bit underappreciated by some policymakers is how important artificial artificial intelligence is"
    },
    {
      "Time_Start": 1173.84,
      "Time_End": 1178.16,
      "Text": " for cybersecurity. It's kind of a bedrock to a lot of these technologies and yet there's a"
    },
    {
      "Time_Start": 1178.16,
      "Time_End": 1185.68,
      "Text": " lot of hand-waving happening. So you've probably heard of a number of administration actions one"
    },
    {
      "Time_Start": 1185.68,
      "Time_End": 1191.28,
      "Text": " of which is kind of being operationalized next door in the generative AI red teaming village"
    },
    {
      "Time_Start": 1191.28,
      "Time_End": 1196.32,
      "Text": " or AI village. It's actually pretty cool. I had a chance to poke around a little bit. It's worth"
    },
    {
      "Time_Start": 1196.32,
      "Time_End": 1203.4399999999998,
      "Text": " it's worth taking a look. But there's they're letting at scale people go in and try to break"
    },
    {
      "Time_Start": 1203.4399999999998,
      "Time_End": 1208.72,
      "Text": " these systems. That's really cool. And these companies have committed to working together"
    },
    {
      "Time_Start": 1208.72,
      "Time_End": 1214.08,
      "Text": " and working with the government to try to make sure that AI systems are secure and that we know"
    },
    {
      "Time_Start": 1214.08,
      "Time_End": 1221.36,
      "Text": " how to use AI for security which is pretty cool. Earlier this week the DARPA AI challenge was"
    },
    {
      "Time_Start": 1221.3600000000001,
      "Time_End": 1226.64,
      "Text": " announced of funding over the next few years to think about security. Like it's really apparent"
    },
    {
      "Time_Start": 1226.64,
      "Time_End": 1233.92,
      "Text": " to me that the government has realized that focusing on security for AI is one of the places"
    },
    {
      "Time_Start": 1233.92,
      "Time_End": 1239.6000000000001,
      "Text": " that we know how to jump into right now. There are a lot of other pieces of this puzzle and I have"
    },
    {
      "Time_Start": 1239.6000000000001,
      "Time_End": 1243.2800000000002,
      "Text": " the sneaking suspicion that the other folks up here are going to talk about this more than a"
    },
    {
      "Time_Start": 1243.2800000000002,
      "Time_End": 1249.92,
      "Text": " little bit. So I won't go too far into it but it's worth looking at and and differentiating what's"
    },
    {
      "Time_Start": 1249.92,
      "Time_End": 1256.4,
      "Text": " new and what's not. It's so hot right now I think legislators have a rubber stamp that says now"
    },
    {
      "Time_Start": 1256.4,
      "Time_End": 1263.92,
      "Text": " with AI. There are a ton of congressional and state proposals. They're all variously interesting."
    },
    {
      "Time_Start": 1263.92,
      "Time_End": 1268.4,
      "Text": " Some of them have to do with security. Some of them have to do with fairness and bias and for"
    },
    {
      "Time_Start": 1268.4,
      "Time_End": 1273.6000000000001,
      "Text": " example there's a bunch of state proposals around hiring bias. That's incredibly important. It's"
    },
    {
      "Time_Start": 1273.6000000000001,
      "Time_End": 1281.5200000000002,
      "Text": " really interesting. There's a lot of action internationally. The AI Act in the EU is in"
    },
    {
      "Time_Start": 1281.5200000000002,
      "Time_End": 1287.7600000000002,
      "Text": " trialogue right now. Their final negotiations. One of the most notable things there is how it interacts"
    },
    {
      "Time_Start": 1287.7600000000002,
      "Time_End": 1294.16,
      "Text": " with the Cyber Resilience Act that Harley mentioned. The product liability directive. The AI"
    },
    {
      "Time_Start": 1294.16,
      "Time_End": 1300.0800000000002,
      "Text": " liability directive. Thinking about what it means for an AI product to be defective and what the"
    },
    {
      "Time_Start": 1300.08,
      "Time_End": 1306.8,
      "Text": " burden of proof is to think about that. And defective can mean security. There are over 50"
    },
    {
      "Time_Start": 1306.8,
      "Time_End": 1310.48,
      "Text": " national strategies out there from various countries thinking about how they're going to"
    },
    {
      "Time_Start": 1310.48,
      "Time_End": 1316.8,
      "Text": " approach AI and how they're going to approach security for AI. And there's a ton of private"
    },
    {
      "Time_Start": 1316.8,
      "Time_End": 1321.6,
      "Text": " sector initiatives. I personally am spending a bunch of time with my colleagues at Venable"
    },
    {
      "Time_Start": 1321.6,
      "Time_End": 1328.08,
      "Text": " thinking about what it means to be utilizing developing AI well, responsibly, securely."
    },
    {
      "Time_Start": 1329.08,
      "Time_End": 1334.04,
      "Text": " So it is incredibly hot. I can't wait to hear what everybody else is thinking about on this"
    },
    {
      "Time_Start": 1334.04,
      "Time_End": 1335.28,
      "Text": " front. Thanks, Harley."
    },
    {
      "Time_Start": 1335.28,
      "Time_End": 1343.28,
      "Text": " Thank you, Heather. So because this is DEF CON. That was amazing. Not now. Okay. That was the"
    },
    {
      "Time_Start": 1343.28,
      "Time_End": 1349.28,
      "Text": " right choice. So because this is DEF CON, I also want to talk about some of the hacker law"
    },
    {
      "Time_Start": 1358.24,
      "Time_End": 1365.82,
      "Text": " priorities. And then we're rounding out the end of it before I turn it over. So in the past we've"
    },
    {
      "Time_Start": 1365.82,
      "Time_End": 1371.98,
      "Text": " talked at DEF CON quite a lot about the computer fraud and abuse act. And I know I'm"
    },
    {
      "Time_Start": 1371.98,
      "Time_End": 1376.88,
      "Text": " skipping out of order here seemingly, but hear me out. So the computer fraud and abuse act has"
    },
    {
      "Time_Start": 1376.88,
      "Time_End": 1382.34,
      "Text": " had a lot of changes over the past couple of years. Through the Supreme Court, the"
    },
    {
      "Time_Start": 1382.34,
      "Time_End": 1388.88,
      "Text": " Van Buren case, as well as the Department of Justice charging policy on CFAA. Point is, the"
    },
    {
      "Time_Start": 1388.88,
      "Time_End": 1395.42,
      "Text": " CFAA is now more narrow than it used to be. It has taken some of the heat off of some forms of"
    },
    {
      "Time_Start": 1395.42,
      "Time_End": 1403.42,
      "Text": " research. That is not the same for the states. State laws were not touched by the Department of"
    },
    {
      "Time_Start": 1403.42,
      "Time_End": 1409.2,
      "Text": " Justice's charging policy. It's not touched by the Supreme Court ruling on CFAA, because the"
    },
    {
      "Time_Start": 1409.2,
      "Time_End": 1416.28,
      "Text": " CFAA is a federal law. The things that people, that this community has historically feared and"
    },
    {
      "Time_Start": 1416.28,
      "Time_End": 1420.96,
      "Text": " complained about as it relates to the over breadth of the CFAA is actually more present in the"
    },
    {
      "Time_Start": 1420.96,
      "Time_End": 1425.74,
      "Text": " states. So anyone here from wherever state you are from, if you look up your state, and"
    },
    {
      "Time_Start": 1425.74,
      "Time_End": 1430.16,
      "Text": " then computer crime law, you'll be able to read it for yourself. But they have not evolved. And"
    },
    {
      "Time_Start": 1430.16,
      "Time_End": 1435.58,
      "Text": " so I just want to emphasize that as a hacker law priority, that I think this is where the"
    },
    {
      "Time_Start": 1435.58,
      "Time_End": 1440.66,
      "Text": " action ought to be for this community that has historically done so well at speaking up for"
    },
    {
      "Time_Start": 1440.66,
      "Time_End": 1448.66,
      "Text": " itself. DMCA section 1201. This is arguably the second most important hacking law at the"
    },
    {
      "Time_Start": 1448.7,
      "Time_End": 1455.7,
      "Text": " federal level. That law requires you to get the authorization of the software copyright owner"
    },
    {
      "Time_Start": 1455.7,
      "Time_End": 1460.5400000000002,
      "Text": " before circumventing a technological protection measure to software, even if you own the"
    },
    {
      "Time_Start": 1460.5400000000002,
      "Time_End": 1466.7,
      "Text": " copy of the software, because it is a copyright law. That, too, has gotten a lot better. So"
    },
    {
      "Time_Start": 1466.7,
      "Time_End": 1471.5400000000002,
      "Text": " there are now exceptions for security researchers there. Where there is not an exception,"
    },
    {
      "Time_Start": 1471.5400000000002,
      "Time_End": 1477.8200000000002,
      "Text": " though, is in what they call trafficking. So this is making your tools available to the public"
    },
    {
      "Time_Start": 1477.82,
      "Time_End": 1482.62,
      "Text": " in some form, whether you're doing it for pay or just making it available for free. Section"
    },
    {
      "Time_Start": 1482.62,
      "Time_End": 1486.9399999999998,
      "Text": " 1201 forbids this, and there is no exception. Every security company is just sort of"
    },
    {
      "Time_Start": 1486.9399999999998,
      "Time_End": 1491.58,
      "Text": " whistling past this regulation. It's not often enforced, but it has been enforced. It is"
    },
    {
      "Time_Start": 1491.58,
      "Time_End": 1496.74,
      "Text": " not just a criminal law. It is also a private law, meaning that it's subject to private"
    },
    {
      "Time_Start": 1496.74,
      "Time_End": 1504.74,
      "Text": " lawsuits. And we have seen a private lawsuit based on this in the past. CFAA, I mentioned"
    },
    {
      "Time_Start": 1505.4,
      "Time_End": 1510.9,
      "Text": " some of the evolution of it. The DOJ's charging policy was very significant, insofar as the"
    },
    {
      "Time_Start": 1510.9,
      "Time_End": 1515.44,
      "Text": " Department of Justice says, if you are doing good-faith security research, we will, by"
    },
    {
      "Time_Start": 1515.44,
      "Time_End": 1520.24,
      "Text": " default, sort of decline to prosecute you, as long as you're not doing something worse."
    },
    {
      "Time_Start": 1520.24,
      "Time_End": 1525.24,
      "Text": " That's prosecution. The CFAA, like the DMCA, is not just a criminal statute. It's also a"
    },
    {
      "Time_Start": 1525.24,
      "Time_End": 1529.94,
      "Text": " private statute, meaning that you can be sued privately under the CFAA. That has not"
    },
    {
      "Time_Start": 1529.94,
      "Time_End": 1535.94,
      "Text": " changed. We're seeing a lot of bright spots in CVD and vulnerability disclosure policies,"
    },
    {
      "Time_Start": 1535.94,
      "Time_End": 1539.44,
      "Text": " but, like I said, I think we're getting further left of boom to the point where we are"
    },
    {
      "Time_Start": 1539.44,
      "Time_End": 1545.06,
      "Text": " now being required to, in some circumstances, disclose our vulnerabilities in a mandatory"
    },
    {
      "Time_Start": 1545.06,
      "Time_End": 1550.3600000000001,
      "Text": " way to government agencies. And that is our chief concern as it relates to the way that"
    },
    {
      "Time_Start": 1550.3600000000001,
      "Time_End": 1558.3600000000001,
      "Text": " this is evolving globally. This is my last slide, and then I'll turn it over. And that is,"
    },
    {
      "Time_Start": 1558.7800000000002,
      "Time_End": 1563.98,
      "Text": " if you want to advocate on these things, right? So this is part of what we hope you'll come"
    },
    {
      "Time_Start": 1563.98,
      "Time_End": 1570.2800000000002,
      "Text": " away with. If you want to advocate on this, it is easy to just appreciate the problem, right?"
    },
    {
      "Time_Start": 1570.2800000000002,
      "Time_End": 1576.7800000000002,
      "Text": " To say, well, CFAA is too broad, or states haven't evolved. What is harder is finding the"
    },
    {
      "Time_Start": 1576.7800000000002,
      "Time_End": 1580.5200000000002,
      "Text": " right officials to describe your problem to. Some of them are up here. Some of them are"
    },
    {
      "Time_Start": 1580.5200000000002,
      "Time_End": 1584.16,
      "Text": " at DEF CON. But finding the right official to describe that problem is really the next"
    },
    {
      "Time_Start": 1584.16,
      "Time_End": 1588.1200000000001,
      "Text": " step. And then, even more difficult, substantially more difficult, is actually coming up"
    },
    {
      "Time_Start": 1588.1200000000001,
      "Time_End": 1592.0400000000002,
      "Text": " with a solution to the problem that you have identified. And that is what we ask our"
    },
    {
      "Time_Start": 1592.0400000000002,
      "Time_End": 1597.0000000000002,
      "Text": " government officials to do. That is what makes their job pretty hard. And coming up with a"
    },
    {
      "Time_Start": 1597.0000000000002,
      "Time_End": 1602.2,
      "Text": " solution that actually works for the world is even more difficult, because it's not just a"
    },
    {
      "Time_Start": 1602.2,
      "Time_End": 1606.46,
      "Text": " world that cares about security out there. We have other things, like business or public"
    },
    {
      "Time_Start": 1606.46,
      "Time_End": 1611.16,
      "Text": " safety and other things like that, that all must be balanced, not just about hacker rights."
    },
    {
      "Time_Start": 1611.16,
      "Time_End": 1616.0400000000002,
      "Text": " And then, finally, making actual tangible progress on your solution, that's where it really"
    },
    {
      "Time_Start": 1616.04,
      "Time_End": 1620.96,
      "Text": " begins. Thank you so much. I hope you appreciated that overview. Now I want to turn it"
    },
    {
      "Time_Start": 1620.96,
      "Time_End": 1627.1599999999999,
      "Text": " over to my colleagues at the White House here to talk about what they do. And that's it."
    },
    {
      "Time_Start": 1627.1599999999999,
      "Time_End": 1628.1599999999999,
      "Text": " Thank you."
    },
    {
      "Time_Start": 1628.1599999999999,
      "Time_End": 1638.1599999999999,
      "Text": " Thanks so much, Harley. That was an incredibly useful background for, I think, what the"
    },
    {
      "Time_Start": 1638.1599999999999,
      "Time_End": 1645.54,
      "Text": " rest of us on the panel are going to talk about, which is, what do each of our organizations"
    },
    {
      "Time_Start": 1645.54,
      "Time_End": 1651.62,
      "Text": " do within this context, and how do we do it? The hope is that through this session, you'll"
    },
    {
      "Time_Start": 1651.62,
      "Time_End": 1656.42,
      "Text": " have a better understanding of what each of our offices or organizations do as it relates to"
    },
    {
      "Time_Start": 1656.42,
      "Time_End": 1661.7,
      "Text": " cyber policy, the kinds of levers and tools that we have in our toolbox, and hopefully, as"
    },
    {
      "Time_Start": 1661.7,
      "Time_End": 1666.74,
      "Text": " well, the kinds of levers and tools that you have in your toolbox to engage in this policy"
    },
    {
      "Time_Start": 1666.74,
      "Time_End": 1671.82,
      "Text": " process. The one thing that I want to say up front is that the challenge with doing a"
    },
    {
      "Time_Start": 1671.82,
      "Time_End": 1677.28,
      "Text": " cyber policy 101 session is that sometimes there are very, very different understandings of"
    },
    {
      "Time_Start": 1677.28,
      "Time_End": 1684.82,
      "Text": " what the word cyber means. And that is, I think, understandable. There are people who think"
    },
    {
      "Time_Start": 1684.82,
      "Time_End": 1691.7,
      "Text": " of the word cyber and take that to mean offensive tools and approaches to attack adversaries."
    },
    {
      "Time_Start": 1691.7,
      "Time_End": 1697.48,
      "Text": " They might think that it means enterprise IT networks and securing those, or the defense of"
    },
    {
      "Time_Start": 1697.48,
      "Time_End": 1703.32,
      "Text": " critical infrastructure. To some people, cyber means a job classification that helps the"
    },
    {
      "Time_Start": 1703.32,
      "Time_End": 1708.1,
      "Text": " federal government identify the types of technical skills that we need within our departments"
    },
    {
      "Time_Start": 1708.1,
      "Time_End": 1712.2,
      "Text": " and agencies. And there's a really wide range of topics here. I think over the course of the"
    },
    {
      "Time_Start": 1712.2,
      "Time_End": 1717.24,
      "Text": " rest of the session, we might use the same terms to mean different things, but hopefully, we"
    },
    {
      "Time_Start": 1717.24,
      "Time_End": 1723.2,
      "Text": " can help parse the differences and the nuances within the way that we think about cyber"
    },
    {
      "Time_Start": 1723.2,
      "Time_End": 1729.04,
      "Text": " policy. So, that's just a little bit of framing up front. For those of you who came in a"
    },
    {
      "Time_Start": 1729.04,
      "Time_End": 1732.9,
      "Text": " little bit late, I work at the Office of the National Cyber Director at the White House, and we"
    },
    {
      "Time_Start": 1732.9,
      "Time_End": 1738.78,
      "Text": " are an incredibly new office, a new component in the Executive Office of the President,"
    },
    {
      "Time_Start": 1738.78,
      "Time_End": 1743.48,
      "Text": " established only a few years ago, but it was established through the recognition, because"
    },
    {
      "Time_Start": 1743.48,
      "Time_End": 1748.96,
      "Text": " the recognition that historically, it's been very difficult to understand how to establish"
    },
    {
      "Time_Start": 1748.98,
      "Time_End": 1755.8600000000001,
      "Text": " some level of cohesion across the federal government to address cyber security issues."
    },
    {
      "Time_Start": 1755.8600000000001,
      "Time_End": 1761.16,
      "Text": " ONCD sits at the intersection of all those kind of different definitions of cyber that I"
    },
    {
      "Time_Start": 1761.16,
      "Time_End": 1766.16,
      "Text": " mentioned up top, and it makes it incredibly useful to bring some of those elements"
    },
    {
      "Time_Start": 1768.54,
      "Time_End": 1773.3,
      "Text": " together, but also challenging, because that world is very complex. And so, one of the ways"
    },
    {
      "Time_Start": 1773.3,
      "Time_End": 1778.1200000000001,
      "Text": " that we, one of the things that we hope to do is to engage deeply with the private sector,"
    },
    {
      "Time_Start": 1778.14,
      "Time_End": 1782.38,
      "Text": " with civil society, to better understand that complexity and apply that to the way that we"
    },
    {
      "Time_Start": 1782.38,
      "Time_End": 1787.38,
      "Text": " think about policy making. So, ONCD was established in 2021 by Congress. It took us a little"
    },
    {
      "Time_Start": 1791.0200000000002,
      "Time_End": 1795.16,
      "Text": " while to get off the ground, because we didn't have money at that point, and so appropriation"
    },
    {
      "Time_Start": 1795.16,
      "Time_End": 1800.16,
      "Text": " only came a little bit later, but we're now about 80 people strong, and have been working on"
    },
    {
      "Time_Start": 1802.6000000000001,
      "Time_End": 1807.24,
      "Text": " a number of different issues that I'll kind of lay out for you all today. I'll talk a little"
    },
    {
      "Time_Start": 1807.26,
      "Time_End": 1810.96,
      "Text": " bit about the National Cyber Security Strategy, which was released in March that Harley"
    },
    {
      "Time_Start": 1810.96,
      "Time_End": 1817.0,
      "Text": " mentioned, and then all of the work that we've done since then to implement that strategy. I"
    },
    {
      "Time_Start": 1817.0,
      "Time_End": 1822.18,
      "Text": " think one of the, sometimes the challenge of a strategy or a strategy document is that it's"
    },
    {
      "Time_Start": 1822.18,
      "Time_End": 1826.92,
      "Text": " words on a page that could turn into words on a shelf, unless there is sufficient buy-in"
    },
    {
      "Time_Start": 1826.92,
      "Time_End": 1830.78,
      "Text": " within the right communities, both within the interagency, other departments and agencies"
    },
    {
      "Time_Start": 1830.78,
      "Time_End": 1836.1200000000001,
      "Text": " across the federal government, or buy-in from other stakeholders in the private sector or"
    },
    {
      "Time_Start": 1836.14,
      "Time_End": 1842.3400000000001,
      "Text": " in civil society. And our hope is to make sure that this is not a strategy that sits on the"
    },
    {
      "Time_Start": 1842.3400000000001,
      "Time_End": 1848.5200000000002,
      "Text": " shelf, but that it is implemented, and that it is funded, that we're able to align our budget"
    },
    {
      "Time_Start": 1848.5200000000002,
      "Time_End": 1853.46,
      "Text": " to our aspirations over the course of this implementation. So, the National Cyber Security"
    },
    {
      "Time_Start": 1853.46,
      "Time_End": 1858.46,
      "Text": " Strategy that was signed by the President and released in March of this year laid out two"
    },
    {
      "Time_Start": 1860.3600000000001,
      "Time_End": 1865.4,
      "Text": " fundamental shifts, and if you're familiar with this already, that's great. For those of you"
    },
    {
      "Time_Start": 1865.46,
      "Time_End": 1870.0800000000002,
      "Text": " who haven't had a chance to take a look at it, I definitely encourage you to read it, because"
    },
    {
      "Time_Start": 1870.0800000000002,
      "Time_End": 1876.2,
      "Text": " these two fundamental shifts are important to the way that we're thinking about the vision"
    },
    {
      "Time_Start": 1876.2,
      "Time_End": 1881.3000000000002,
      "Text": " for cyberspace in this decisive decade, the things that we hope to accomplish in the next"
    },
    {
      "Time_Start": 1881.3000000000002,
      "Time_End": 1886.5800000000002,
      "Text": " decade and in years to come as well. Harley talked a little bit about regulation, that's part"
    },
    {
      "Time_Start": 1886.5800000000002,
      "Time_End": 1891.64,
      "Text": " of the first shift that we established in the National Cyber Security Strategy, and that shift"
    },
    {
      "Time_Start": 1891.66,
      "Time_End": 1898.26,
      "Text": " is about shifting the burden, understanding that there needs to be a shift in terms of who"
    },
    {
      "Time_Start": 1898.26,
      "Time_End": 1903.14,
      "Text": " is responsible for managing cybersecurity risk, and we want to move that away from the end"
    },
    {
      "Time_Start": 1903.14,
      "Time_End": 1909.94,
      "Text": " user, the consumer, and move that up towards those who are most capable, who are the biggest"
    },
    {
      "Time_Start": 1909.94,
      "Time_End": 1916.94,
      "Text": " and potentially most responsible entities for that cybersecurity risk. Now, that involves"
    },
    {
      "Time_Start": 1917.1200000000001,
      "Time_End": 1923.9,
      "Text": " things like regulation and regulatory harmonization, and we also talk in the strategy about"
    },
    {
      "Time_Start": 1923.9,
      "Time_End": 1929.74,
      "Text": " software liability model as well, but this is something that we want to change because, as it"
    },
    {
      "Time_Start": 1929.74,
      "Time_End": 1935.3200000000002,
      "Text": " stands now, we're asking elementary schools and rural hospitals to go toe-to-toe with"
    },
    {
      "Time_Start": 1935.3200000000002,
      "Time_End": 1941.44,
      "Text": " transnational criminal organizations, and not only is that not fair, it's also not effective."
    },
    {
      "Time_Start": 1941.44,
      "Time_End": 1946.9,
      "Text": " We want to change that model so that we can address some of these problems at the part of"
    },
    {
      "Time_Start": 1946.9,
      "Time_End": 1952.5600000000002,
      "Text": " the chain where they are most able to be addressed. So that's the first big shift. The other"
    },
    {
      "Time_Start": 1952.5600000000002,
      "Time_End": 1958.0600000000002,
      "Text": " big shift is thinking about how we incentivize long-term investments in cybersecurity. What"
    },
    {
      "Time_Start": 1958.0600000000002,
      "Time_End": 1963.98,
      "Text": " we want is a world in which when private sector entities or public sector entities are"
    },
    {
      "Time_Start": 1963.98,
      "Time_End": 1969.6000000000001,
      "Text": " fighting with trade-offs, the trade-offs that they have to make between the perhaps easy but"
    },
    {
      "Time_Start": 1969.6000000000001,
      "Time_End": 1976.3200000000002,
      "Text": " temporary fix versus the more difficult but enduring fix, that the enduring solution is the"
    },
    {
      "Time_Start": 1976.32,
      "Time_End": 1980.9399999999998,
      "Text": " one that should be the right choice. We want to make that an easier choice. We want to help"
    },
    {
      "Time_Start": 1980.9399999999998,
      "Time_End": 1986.32,
      "Text": " shape market forces so that that choice is the one that people automatically go to, and"
    },
    {
      "Time_Start": 1986.32,
      "Time_End": 1992.82,
      "Text": " sometimes that's difficult. I think one example that I'll raise is the kinds of infrastructure"
    },
    {
      "Time_Start": 1992.82,
      "Time_End": 1998.1,
      "Text": " investments that we're making right now. The Biden-Harris administration has poured, has"
    },
    {
      "Time_Start": 1998.1,
      "Time_End": 2004.28,
      "Text": " signed legislation to pour millions and millions of dollars into infrastructure, into clean"
    },
    {
      "Time_Start": 2004.28,
      "Time_End": 2010.94,
      "Text": " energy infrastructure as well, and one of the potential risks is that that money rolls out,"
    },
    {
      "Time_Start": 2010.94,
      "Time_End": 2016.16,
      "Text": " that infrastructure is built without sufficient understanding of the potential cybersecurity"
    },
    {
      "Time_Start": 2016.16,
      "Time_End": 2021.8999999999999,
      "Text": " risks, but building some of those cybersecurity mitigations in at the beginning. And if we"
    },
    {
      "Time_Start": 2021.8999999999999,
      "Time_End": 2026.78,
      "Text": " look five years, ten years, twenty years down the line, are we going to run the risk of"
    },
    {
      "Time_Start": 2026.78,
      "Time_End": 2030.2,
      "Text": " vulnerabilities in that infrastructure? Are we going to have to rip and replace, which may"
    },
    {
      "Time_Start": 2030.2,
      "Time_End": 2035.8600000000001,
      "Text": " cost exorbitantly more? How do we make sure that we are doing things in a way that is"
    },
    {
      "Time_Start": 2035.8600000000001,
      "Time_End": 2040.6200000000001,
      "Text": " secure at the beginning, and we're thinking about that kind of secure by design mentality"
    },
    {
      "Time_Start": 2040.6200000000001,
      "Time_End": 2045.78,
      "Text": " early on. So incentivizing those long-term investments in cybersecurity is the other big"
    },
    {
      "Time_Start": 2045.78,
      "Time_End": 2051.2,
      "Text": " shift that we talk about in the National Cybersecurity Strategy. The implementation of that"
    },
    {
      "Time_Start": 2051.2,
      "Time_End": 2055.48,
      "Text": " strategy is something that we've been focused on for the last couple of months, and in fact, a"
    },
    {
      "Time_Start": 2055.48,
      "Time_End": 2061.14,
      "Text": " month ago, the implementation plan was released publicly. This doesn't happen all that"
    },
    {
      "Time_Start": 2061.14,
      "Time_End": 2064.98,
      "Text": " often, but this is something that we wanted to make sure happened both for transparency's"
    },
    {
      "Time_Start": 2064.98,
      "Time_End": 2070.98,
      "Text": " sake as well as for accountability's sake. We think it's important to put the implementation"
    },
    {
      "Time_Start": 2070.98,
      "Time_End": 2076.44,
      "Text": " plan out there, not only for us to hold ourselves accountable, but for you all to hold us"
    },
    {
      "Time_Start": 2076.44,
      "Time_End": 2082.48,
      "Text": " accountable as well. You can find that implementation plan, pull it apart, ask questions"
    },
    {
      "Time_Start": 2082.48,
      "Time_End": 2088.14,
      "Text": " about it. There are things that are already underway and are already being implemented. One"
    },
    {
      "Time_Start": 2088.14,
      "Time_End": 2091.6,
      "Text": " of the pieces that Harley mentioned is the request for information on regulatory"
    },
    {
      "Time_Start": 2091.6,
      "Time_End": 2097.14,
      "Text": " harmonization. We know that regulatory harmonization is a big, thorny topic that is going"
    },
    {
      "Time_Start": 2097.14,
      "Time_End": 2104.26,
      "Text": " to take years to unpack and understand, and we know as well that engagement with the"
    },
    {
      "Time_Start": 2104.26,
      "Time_End": 2109.98,
      "Text": " private sector is necessary. It is necessary for us to be able to do that effectively. So"
    },
    {
      "Time_Start": 2109.98,
      "Time_End": 2115.6,
      "Text": " that's out and live now. There's also one that was just released yesterday on open source"
    },
    {
      "Time_Start": 2115.6,
      "Time_End": 2120.94,
      "Text": " software, and there's a request for information that we would love to hear from you all in"
    },
    {
      "Time_Start": 2120.94,
      "Time_End": 2126.48,
      "Text": " this room as well as many other people who are here at DEF CON about the ways in which we"
    },
    {
      "Time_Start": 2126.48,
      "Time_End": 2131.84,
      "Text": " can think about security of open source software and memory safe languages. So those are"
    },
    {
      "Time_Start": 2131.84,
      "Time_End": 2136.34,
      "Text": " some of the things that we've been doing recently. I'll hit on two more and then pass it"
    },
    {
      "Time_Start": 2136.34,
      "Time_End": 2142.96,
      "Text": " off to the other panelists here. One thing that we released last week is the national"
    },
    {
      "Time_Start": 2142.96,
      "Time_End": 2148.2000000000003,
      "Text": " cyber workforce and education strategy. And I think that this is incredibly important"
    },
    {
      "Time_Start": 2148.2000000000003,
      "Time_End": 2154.1600000000003,
      "Text": " because it illustrates the kind of missing piece of the puzzle that's often underemphasized"
    },
    {
      "Time_Start": 2154.1600000000003,
      "Time_End": 2160.2000000000003,
      "Text": " or overlooked, and that is the people, the talent, the expertise that is needed to do all"
    },
    {
      "Time_Start": 2160.2,
      "Time_End": 2166.24,
      "Text": " of the things that we hope to do to meet our aspirations for cyberspace. And that people"
    },
    {
      "Time_Start": 2166.24,
      "Time_End": 2171.24,
      "Text": " part is incredibly important. Finding training, getting people into jobs where they can"
    },
    {
      "Time_Start": 2171.24,
      "Time_End": 2175.62,
      "Text": " help defend critical infrastructure, where they can think about the issues that arise with"
    },
    {
      "Time_Start": 2175.62,
      "Time_End": 2181.96,
      "Text": " ITOT conversions, where they can be in positions to help make decisions on how we think"
    },
    {
      "Time_Start": 2181.96,
      "Time_End": 2187.96,
      "Text": " about securing our nation's digital ecosystem. Those are things that require talented"
    },
    {
      "Time_Start": 2187.96,
      "Time_End": 2195.96,
      "Text": " people. And the national cyber and workforce education strategy is the U.S. government's"
    },
    {
      "Time_Start": 2195.96,
      "Time_End": 2202.88,
      "Text": " plan to address those shortfalls and how to train up the next generation of digital"
    },
    {
      "Time_Start": 2202.88,
      "Time_End": 2208.12,
      "Text": " workforce, our digital workforce. And then finally, the last thing that I'll mention is the"
    },
    {
      "Time_Start": 2208.12,
      "Time_End": 2212.92,
      "Text": " kind of values alignment piece. So the national cybersecurity strategy talks about"
    },
    {
      "Time_Start": 2212.92,
      "Time_End": 2217.92,
      "Text": " defensibility, it talks about resilience, but it also talks about values alignment. And"
    },
    {
      "Time_Start": 2217.92,
      "Time_End": 2224.6800000000003,
      "Text": " that's something that is often difficult to define and shape. One of the things that we did"
    },
    {
      "Time_Start": 2224.6800000000003,
      "Time_End": 2229.6800000000003,
      "Text": " around the Summit for Democracy back in March is work with the State Department to put out a"
    },
    {
      "Time_Start": 2229.6800000000003,
      "Time_End": 2237.1800000000003,
      "Text": " call to action on the development and implementation of censorship circumvention tools. So"
    },
    {
      "Time_Start": 2237.18,
      "Time_End": 2243.12,
      "Text": " thinking about the ways in which technologies can be helpful in circumventing the"
    },
    {
      "Time_Start": 2243.12,
      "Time_End": 2249.0,
      "Text": " authoritarian censorship that happens in other countries in order to make it more, make the"
    },
    {
      "Time_Start": 2249.0,
      "Time_End": 2254.96,
      "Text": " internet more accessible, more open, and more resilient. Those are the types of things"
    },
    {
      "Time_Start": 2254.96,
      "Time_End": 2260.18,
      "Text": " that we've been working on in the last couple of months. Some of my colleagues that are"
    },
    {
      "Time_Start": 2260.18,
      "Time_End": 2265.14,
      "Text": " here at DEF CON have sessions on those topics, including on secure by design and open"
    },
    {
      "Time_Start": 2265.14,
      "Time_End": 2270.06,
      "Text": " source software and anti-censorship, and definitely encourage you to find any one of us. We"
    },
    {
      "Time_Start": 2270.06,
      "Time_End": 2276.14,
      "Text": " tend to be wearing these shiny badges. And ask us questions. Give us feedback. We definitely"
    },
    {
      "Time_Start": 2276.14,
      "Time_End": 2283.14,
      "Text": " want to hear from you all in this room. And I'll pass it over."
    },
    {
      "Time_Start": 2283.14,
      "Time_End": 2289.1,
      "Text": " All right. Thank you. And I want to start off by saying, Harley, a lot of, you know, your"
    },
    {
      "Time_Start": 2289.1,
      "Time_End": 2296.2999999999997,
      "Text": " overview provided a lot of touch points for us at FDA reflective of the journey that we've"
    },
    {
      "Time_Start": 2296.2999999999997,
      "Time_End": 2304.3399999999997,
      "Text": " had over the past decade and a little bit longer. And let me first also mention that I'm"
    },
    {
      "Time_Start": 2304.3399999999997,
      "Time_End": 2308.5,
      "Text": " going to have to leave a little bit early with my team. My team members are actually here in"
    },
    {
      "Time_Start": 2308.5,
      "Time_End": 2312.7599999999998,
      "Text": " the audience as well. But we're going to have to hop over to Biohacking Village for some"
    },
    {
      "Time_Start": 2312.76,
      "Time_End": 2320.2200000000003,
      "Text": " activities over there. I think the best place for me to start, especially since we're here at"
    },
    {
      "Time_Start": 2320.2200000000003,
      "Time_End": 2326.96,
      "Text": " DEF CON right now, is in reflecting back to what some of you who are in the audience here in"
    },
    {
      "Time_Start": 2326.96,
      "Time_End": 2334.7200000000003,
      "Text": " the room and possibly those of you who are, you know, listening, recall with respect to"
    },
    {
      "Time_Start": 2334.7200000000003,
      "Time_End": 2343.0200000000004,
      "Text": " demos that have taken place over the years on the stage at Black Hat and DEF CON, showing"
    },
    {
      "Time_Start": 2343.0200000000004,
      "Time_End": 2349.76,
      "Text": " the potential for exploiting vulnerabilities in medical devices that can result in significant,"
    },
    {
      "Time_Start": 2349.76,
      "Time_End": 2356.46,
      "Text": " I would say, sometimes catastrophic patient harm. And those types of demonstrations that"
    },
    {
      "Time_Start": 2356.46,
      "Time_End": 2363.88,
      "Text": " have been done by white hat hackers, by security, independent security researchers, were"
    },
    {
      "Time_Start": 2363.88,
      "Time_End": 2372.42,
      "Text": " very much a call to action, I would say, for the agency. If we go back, we dial back all those"
    },
    {
      "Time_Start": 2372.42,
      "Time_End": 2380.1800000000003,
      "Text": " years, 10 years plus, when those demos occurred, the state of our community, the health care"
    },
    {
      "Time_Start": 2380.1800000000003,
      "Time_End": 2388.52,
      "Text": " ecosystem, was such that manufacturers were issuing cease and desist letters to those security"
    },
    {
      "Time_Start": 2388.56,
      "Time_End": 2395.42,
      "Text": " researchers. And we're obviously coming to the FDA as well, complaining that researchers shouldn't"
    },
    {
      "Time_Start": 2395.42,
      "Time_End": 2403.16,
      "Text": " be doing any of those activities. They're putting patients in harm's way. We're creating a crisis of"
    },
    {
      "Time_Start": 2403.16,
      "Time_End": 2415.92,
      "Text": " confidence in the public with respect to the use of these devices. And if you consider that's where"
    },
    {
      "Time_Start": 2415.92,
      "Time_End": 2426.66,
      "Text": " we were 10 plus years ago, and what we at the agency needed to do to bring us to the present,"
    },
    {
      "Time_Start": 2426.66,
      "Time_End": 2433.62,
      "Text": " this is a very, very hard hill or mountain to climb, I would say. And certainly we did not do that"
    },
    {
      "Time_Start": 2433.62,
      "Time_End": 2440.26,
      "Text": " alone. Certainly we did that with many partners, many collaborators across the entirety of the"
    },
    {
      "Time_Start": 2440.26,
      "Time_End": 2448.1600000000003,
      "Text": " medical device ecosystem. And one of the places where we started was with this community, with the"
    },
    {
      "Time_Start": 2448.1600000000003,
      "Time_End": 2456.76,
      "Text": " hacker community, with security researchers, with really trying to get a better understanding of"
    },
    {
      "Time_Start": 2456.76,
      "Time_End": 2464.5,
      "Text": " what was happening with respect to vulnerabilities as they were identified, and what type of"
    },
    {
      "Time_Start": 2464.5,
      "Time_End": 2475.9,
      "Text": " potential risks they exposed or they bring up towards the use of these devices. I want to say very"
    },
    {
      "Time_Start": 2475.9,
      "Time_End": 2488.4,
      "Text": " clearly, our stance at FDA is that you cannot have, we cannot have a safe device unless that device is"
    },
    {
      "Time_Start": 2488.4,
      "Time_End": 2498.5,
      "Text": " cyber secure. I'll say that again. Our position is that for a device to be safe for patient use, a device"
    },
    {
      "Time_Start": 2498.5,
      "Time_End": 2508.1,
      "Text": " obviously that has capabilities of connection or has software within it, that device has to have basic"
    },
    {
      "Time_Start": 2508.1,
      "Time_End": 2518.7,
      "Text": " security by design and capabilities of being able to be protected from a security perspective. And moving"
    },
    {
      "Time_Start": 2518.7,
      "Time_End": 2528.9,
      "Text": " the ecosystem from a culture of this can never happen, these vulnerabilities are kind of hypothetical, they are"
    },
    {
      "Time_Start": 2528.9,
      "Time_End": 2536.5,
      "Text": " theoretical, just because they're being shown on this stage doesn't mean that in reality, in a real use"
    },
    {
      "Time_Start": 2536.5,
      "Time_End": 2545.0,
      "Text": " environment, anything bad could ever happen. Moving people away from that mindset, from that culture, has been"
    },
    {
      "Time_Start": 2545.0,
      "Time_End": 2552.7,
      "Text": " a really substantial journey over the past bunch of years, over the past decade essentially. But we've gotten"
    },
    {
      "Time_Start": 2552.7,
      "Time_End": 2562.8,
      "Text": " there through a lot of the work that we have done, again, with groups such as I Am the Cavalry and others who"
    },
    {
      "Time_Start": 2562.9,
      "Time_End": 2572.9,
      "Text": " have been huge proponents, and as Harley talked about in his slides, the advocacy aspect of what an audience, what a"
    },
    {
      "Time_Start": 2572.9,
      "Time_End": 2582.1000000000004,
      "Text": " coalition can bring to a particular policy area where change is very much needed. So that, just for openers, I want you to"
    },
    {
      "Time_Start": 2582.1000000000004,
      "Time_End": 2591.0,
      "Text": " make that very clear. So FDA, what is our mission? Again, we are there to protect and promote the public health, and we do"
    },
    {
      "Time_Start": 2591.0,
      "Time_End": 2602.3,
      "Text": " that through regulatory activities including oversight of medical products in total. Our office, the office that I"
    },
    {
      "Time_Start": 2602.3,
      "Time_End": 2612.7,
      "Text": " represent within the Center for Devices and Radiological Health, has responsibility for medical devices. And if you"
    },
    {
      "Time_Start": 2612.8,
      "Time_End": 2621.7000000000003,
      "Text": " were to go back and look at the statutory language for which we abide by, or which we operate under, it has always been"
    },
    {
      "Time_Start": 2621.7000000000003,
      "Time_End": 2629.5000000000005,
      "Text": " reasonable assurance of safety and effectiveness. We've never had, up until recent, so I'll get to the really great news, but"
    },
    {
      "Time_Start": 2629.5000000000005,
      "Time_End": 2638.0000000000005,
      "Text": " we never have had explicit authorities around cybersecurity. If you were to just kind of go through all of our regulations,"
    },
    {
      "Time_Start": 2638.0,
      "Time_End": 2647.0,
      "Text": " all of the food and drug law, the word cybersecurity, up until very recently, has never appeared. So you might say it was"
    },
    {
      "Time_Start": 2647.0,
      "Time_End": 2655.2,
      "Text": " sort of a conundrum back in 2013 when we really started to deal with these vulnerabilities being brought forward to us by"
    },
    {
      "Time_Start": 2655.2,
      "Time_End": 2666.8,
      "Text": " security researchers as to how are we going to be able to appropriately deal with this within our regulatory schema, our"
    },
    {
      "Time_Start": 2666.8,
      "Time_End": 2675.5,
      "Text": " framework. And we did have to be pretty creative about that. Harley talked also about if you don't have existing or explicit"
    },
    {
      "Time_Start": 2675.5,
      "Time_End": 2686.4,
      "Text": " authorities, how might one use existing authorities in order to be able to issue policy and, again, move or drive towards"
    },
    {
      "Time_Start": 2686.5,
      "Time_End": 2700.2000000000003,
      "Text": " advancing or strengthening cybersecurity, which is what we did through a lot of our initial policy documents that start from the"
    },
    {
      "Time_Start": 2700.2000000000003,
      "Time_End": 2710.7000000000003,
      "Text": " premarket side. And what we mean by premarket is manufacturers within the medical device industry need to come to the agency with a"
    },
    {
      "Time_Start": 2710.8,
      "Time_End": 2722.3,
      "Text": " submission, with a package of material in which they are providing data or evidence that supports that reasonable assurance of safety"
    },
    {
      "Time_Start": 2722.3,
      "Time_End": 2733.8,
      "Text": " and effectiveness. And in order for that device to be allowed or what we call authorized to go onto the market, to be used, to be sold,"
    },
    {
      "Time_Start": 2733.9,
      "Time_End": 2747.5,
      "Text": " to be enabled by clinicians and by patients, it has to go through that FDA process. So back in 2013-14, we issued that very first"
    },
    {
      "Time_Start": 2747.5,
      "Time_End": 2761.3,
      "Text": " premarket guidance laying out basic tenets of what we expect manufacturers to do with respect to security by design. Again, we don't"
    },
    {
      "Time_Start": 2761.3,
      "Time_End": 2772.0,
      "Text": " have the explicit authority, so what we used were other existing regulations, the quality system regulation, for one, as a hook, if you"
    },
    {
      "Time_Start": 2772.0,
      "Time_End": 2784.1000000000004,
      "Text": " will, in terms of manufacturers needing to abide by that existing regulation in order to meet design controls and other aspects of"
    },
    {
      "Time_Start": 2784.1,
      "Time_End": 2795.7,
      "Text": " security and software that would allow for those devices to go on the market. We continued, you know, along in this journey, a lot of it"
    },
    {
      "Time_Start": 2795.7,
      "Time_End": 2804.7,
      "Text": " through, again, meeting with, engaging with the ecosystem. A lot of what we've done has been multi-stakeholder engagement with patients, with"
    },
    {
      "Time_Start": 2804.7,
      "Time_End": 2812.7,
      "Text": " healthcare delivery organizations and clinicians, with the independent security researcher community, and obviously with industry medical"
    },
    {
      "Time_Start": 2812.8,
      "Time_End": 2824.7000000000003,
      "Text": " device manufacturers themselves, as well as now we have an entire stakeholder group of third-party security vendors as well. And in this period of"
    },
    {
      "Time_Start": 2824.7000000000003,
      "Time_End": 2836.0000000000005,
      "Text": " time of really trying to change the culture within the healthcare sector in terms of recognizing that these are emerging threats, that the healthcare"
    },
    {
      "Time_Start": 2836.0,
      "Time_End": 2847.2,
      "Text": " sector has a very significant exposed attack surface that is not being addressed. And certainly from where we sit in our role on the medical device"
    },
    {
      "Time_Start": 2847.2,
      "Time_End": 2860.7,
      "Text": " side, this is an area where we need to be having manufacturers step up to the plate and deal with devices. So much of what we learned over this"
    },
    {
      "Time_Start": 2860.7000000000003,
      "Time_End": 2870.7000000000003,
      "Text": " period of time as we did this engagement, as we developed these collaborations, included interactions with other government agencies, included a lot of,"
    },
    {
      "Time_Start": 2870.7000000000003,
      "Time_End": 2880.1000000000004,
      "Text": " yes, what were voluntary efforts through prior executive orders and prior administrations, but these were important in terms of really starting to, again, move the"
    },
    {
      "Time_Start": 2880.1,
      "Time_End": 2897.2999999999997,
      "Text": " needle towards what our expectations were. In 2016, we released a post-market guidance, which meant that, yes, while devices as they go onto the market need to have"
    },
    {
      "Time_Start": 2897.2999999999997,
      "Time_End": 2907.2999999999997,
      "Text": " security built into them, we know that vulnerabilities are going to emerge over the life cycle of that device. They're going to be identified. And it's not a one-and-done"
    },
    {
      "Time_Start": 2907.5,
      "Time_End": 2918.3,
      "Text": " once the device goes on the market, but what is the manufacturer's responsibility in keeping that device and maintaining that device from a risk management, from a cybersecurity"
    },
    {
      "Time_Start": 2918.3,
      "Time_End": 2930.7000000000003,
      "Text": " perspective throughout that life cycle? Because of a lot of the work that we did with the community, you had things included within our guidance such as coordinated vulnerability"
    },
    {
      "Time_Start": 2930.7000000000003,
      "Time_End": 2945.7000000000003,
      "Text": " disclosures, that we had an expectation that manufacturers would need to have, first of all, processes and policy in place for ingesting vulnerability information that came to them, regardless of"
    },
    {
      "Time_Start": 2945.7000000000003,
      "Time_End": 2963.5000000000005,
      "Text": " who provided that information, that they needed to do the necessary assessment and analysis of that vulnerability to determine what type of risk was involved. And if that risk certainly was of a critical nature, what we called uncontrolled"
    },
    {
      "Time_Start": 2963.5,
      "Time_End": 2992.7,
      "Text": " vulnerabilities, that the manufacturers absolutely need to take action to reduce that risk through various efforts of remediation. And to disclose that to the public in a coordinated manner with FDA, with what's now CISA as well, so that there was really a very aligned effort towards providing"
    },
    {
      "Time_Start": 2992.7000000000003,
      "Time_End": 3015.7000000000003,
      "Text": " information and reducing the potential for a crisis of confidence among patients, family members who rely on these devices, be it pacemakers, implantable devices, insulin, infusion pumps, all of those types of devices, for which we've also issued over the years a lot of safety communications as well as part of this disclosure process."
    },
    {
      "Time_Start": 3016.7000000000003,
      "Time_End": 3029.7000000000003,
      "Text": " So you had the pre-market guidance. We've had the post-market guidance. We've also promised all along that this is an evolution within the healthcare space. We're going to need to iterate."
    },
    {
      "Time_Start": 3029.7000000000003,
      "Time_End": 3047.7000000000003,
      "Text": " What we put out in 2014 or 2016 is not going to be sufficient to meet the mark of the future, of the present and the future, and that we would continue to address where there's a need to really, again, raise the bar based upon what we were learning."
    },
    {
      "Time_Start": 3047.7000000000003,
      "Time_End": 3065.7000000000003,
      "Text": " And so in 2018, we issued an updated pre-market guidance at the time, and that, you know, in comparison to the pre-market in 2014, which was just nearly nine pages, just basic foundations, the 2018 one was somewhere as close to 20 pages."
    },
    {
      "Time_Start": 3065.7000000000003,
      "Time_End": 3071.7000000000003,
      "Text": " This is already a lot more meat, a lot more substance within that guidance."
    },
    {
      "Time_Start": 3072.7000000000003,
      "Time_End": 3086.7000000000003,
      "Text": " Here's the thing. You know, by 2018, from all we were learning and what we were seeing, it became very clear to us as well that, yes, there are certain – there's a lot that we can do through guidance."
    },
    {
      "Time_Start": 3087.7000000000003,
      "Time_End": 3102.7000000000003,
      "Text": " However, there are certain areas where to really advance cybersecurity in medical devices, we were going to need additional authorities, very specific cybersecurity authorities that we really did not have."
    },
    {
      "Time_Start": 3103.7000000000003,
      "Time_End": 3120.7000000000003,
      "Text": " And we put out what was called a medical device safety action plan, and one of those sections in there was focused on cybersecurity where we already signaled to the public that we were considering seeking additional authorities for medical device cybersecurity."
    },
    {
      "Time_Start": 3120.7000000000003,
      "Time_End": 3149.7000000000003,
      "Text": " Included within that was requiring or mandating coordinated vulnerability disclosure, mandating a software bill of materials, mandating that as part of the pre-market submission that manufacturers need to submit to the agency, they need to provide the appropriate evidence that patching or updating a device that's out there is going to be safe and not going to affect the performance of that device."
    },
    {
      "Time_Start": 3149.7000000000003,
      "Time_End": 3166.7000000000003,
      "Text": " And while we signaled that in 2018, we also provided proposals, legislative proposals, what we call A19s is the common lingo for that, where we made that case in justification for why, you know, we've got to close that gap."
    },
    {
      "Time_Start": 3166.7000000000003,
      "Time_End": 3184.7000000000003,
      "Text": " It wasn't about taking a regulatory hammer and bluntly, you know, putting down a request for regulations, it's really more like carving out with a scalpel those specific areas where we're, you know, we're going to need to drive further and we need more very specific regulatory authority."
    },
    {
      "Time_Start": 3184.7000000000003,
      "Time_End": 3204.7000000000003,
      "Text": " And over the, you know, over the past several years, we've been pushing and been persistent in terms of pushing this particular area, working with many partners on the healthcare provider side, with the security researcher community, with patients, with others, in order to make that case."
    },
    {
      "Time_Start": 3204.7000000000003,
      "Time_End": 3233.7000000000003,
      "Text": " I'm going to, you know, kind of speed up to where we are at present, where finally we have received in 2022, in December, December 29th of 2022, to be specific, the omnibus, which passed, and included within it was the Patch Act, which provides multiple provisions requiring manufacturers in order to abide by the patch act."
    },
    {
      "Time_Start": 3233.7000000000003,
      "Time_End": 3251.7000000000003,
      "Text": " To abide by certain key elements in submitting their premarket applications to the agency, as well as the expectation for what they're going to need to do for the lifetime of that device."
    },
    {
      "Time_Start": 3251.7000000000003,
      "Time_End": 3266.7000000000003,
      "Text": " Including coordinated vulnerability disclosure, policies and processes with a timeframe expected for not merely disclosing, but patching that vulnerability, depending upon its criticality."
    },
    {
      "Time_Start": 3266.7000000000003,
      "Time_End": 3275.7000000000003,
      "Text": " In addition to that, mandating SBOM, that manufacturers need to submit the software bill of materials to the agency."
    },
    {
      "Time_Start": 3276.7000000000003,
      "Time_End": 3289.7000000000003,
      "Text": " That statute has gone into, excuse me, implementation 90 days later, which was March 29th of this year."
    },
    {
      "Time_Start": 3290.7000000000003,
      "Time_End": 3306.7000000000003,
      "Text": " And at present, so I would say to you that we also issued what's called a refuse to accept policy guidance on March 29th, which essentially states that as of October 1st of this year, we have something called refuse to accept."
    },
    {
      "Time_Start": 3306.7000000000003,
      "Time_End": 3327.7000000000003,
      "Text": " Which means that if a submission comes in to the agency that does not have the necessary elements for cybersecurity required for premarket review, then that submission would get immediately rejected from going into, again, the process of review."
    },
    {
      "Time_Start": 3328.7000000000003,
      "Time_End": 3331.7000000000003,
      "Text": " And it returns back to the sponsor, the manufacturer."
    },
    {
      "Time_Start": 3335.7000000000003,
      "Time_End": 3347.7000000000003,
      "Text": " It returns back to the manufacturer, and the manufacturer is going to lose time as a result in being able to get that product to the market until they provide the information for which that submission is accepted."
    },
    {
      "Time_Start": 3348.7000000000003,
      "Time_End": 3366.7000000000003,
      "Text": " We've been working very much interactively with manufacturers over the years and even over this period of time since the statute has gone into effect so that they can understand better what it is that they need to provide to the agency."
    },
    {
      "Time_Start": 3366.7000000000003,
      "Time_End": 3369.7000000000003,
      "Text": " But this is a real inflection point for us."
    },
    {
      "Time_Start": 3369.7000000000003,
      "Time_End": 3374.7000000000003,
      "Text": " And we're really excited to be at this stage right now."
    },
    {
      "Time_Start": 3374.7000000000003,
      "Time_End": 3379.7000000000003,
      "Text": " It doesn't solve all of the problems with regard to medical devices."
    },
    {
      "Time_Start": 3379.7000000000003,
      "Time_End": 3382.7000000000003,
      "Text": " It doesn't directly address legacy."
    },
    {
      "Time_Start": 3382.7000000000003,
      "Time_End": 3394.7000000000003,
      "Text": " And we could have a whole separate discussion around those devices out there that are legacy equipment for which that's really more of a whole of community type of an approach towards dealing with in addition to FDA."
    },
    {
      "Time_Start": 3394.7000000000003,
      "Time_End": 3401.7000000000003,
      "Text": " But certainly with respect to new medical devices that are going to be going on the market, this is a game changer."
    },
    {
      "Time_Start": 3402.7000000000003,
      "Time_End": 3417.7000000000003,
      "Text": " And we're very much leaning into this in terms of really making sure that we capitalize in full upon these new provisions, these new authorities that we were given."
    },
    {
      "Time_Start": 3419.7000000000003,
      "Time_End": 3422.7000000000003,
      "Text": " I'm going to stop right there and turn it over to you."
    },
    {
      "Time_Start": 3426.7000000000003,
      "Time_End": 3427.7000000000003,
      "Text": " Great. Thank you."
    },
    {
      "Time_Start": 3428.7000000000003,
      "Time_End": 3432.7000000000003,
      "Text": " I know we've had a lot of new folks come in the room, so just reintroducing myself."
    },
    {
      "Time_Start": 3432.7000000000003,
      "Time_End": 3433.7000000000003,
      "Text": " My name is Lindsey Forsen."
    },
    {
      "Time_Start": 3433.7000000000003,
      "Time_End": 3437.7000000000003,
      "Text": " I'm with the National Association of Secretaries of State."
    },
    {
      "Time_Start": 3437.7000000000003,
      "Time_End": 3441.7000000000003,
      "Text": " I know this is a lot of policy talk for a Friday morning in Vegas."
    },
    {
      "Time_Start": 3441.7000000000003,
      "Time_End": 3448.7000000000003,
      "Text": " And I know secretaries have a very specific role, and we're in a Cyber 101, Cyber Policy 101 session."
    },
    {
      "Time_Start": 3448.7000000000003,
      "Time_End": 3455.7000000000003,
      "Text": " So I'm not going to get too far into the weeds, but I do want to touch on who is NAS, who are our members, what do we do?"
    },
    {
      "Time_Start": 3455.7000000000003,
      "Time_End": 3461.7000000000003,
      "Text": " How they fit kind of within the broader state cyber policy environment."
    },
    {
      "Time_Start": 3461.7000000000003,
      "Time_End": 3468.7000000000003,
      "Text": " And just some priorities of secretaries and what they've been working on in the cyberspace."
    },
    {
      "Time_Start": 3468.7000000000003,
      "Time_End": 3471.7000000000003,
      "Text": " But I'll get through those things relatively quickly."
    },
    {
      "Time_Start": 3471.7000000000003,
      "Time_End": 3474.7000000000003,
      "Text": " So NAS is a membership association."
    },
    {
      "Time_Start": 3474.7000000000003,
      "Time_End": 3477.7000000000003,
      "Text": " We represent the secretaries of state across the country."
    },
    {
      "Time_Start": 3477.7000000000003,
      "Time_End": 3481.7000000000003,
      "Text": " Their profile has increased in recent years, as you might know."
    },
    {
      "Time_Start": 3481.7000000000003,
      "Time_End": 3488.7000000000003,
      "Text": " We've gone from, you know, when I tell people what I do, they think I work for the U.S. State Department,"
    },
    {
      "Time_Start": 3488.7000000000003,
      "Time_End": 3493.7000000000003,
      "Text": " to when I tell people what I do, they want to talk election security."
    },
    {
      "Time_Start": 3493.7000000000003,
      "Time_End": 3497.7000000000003,
      "Text": " And so that's been a bit of a transition."
    },
    {
      "Time_Start": 3497.7000000000003,
      "Time_End": 3500.7000000000003,
      "Text": " So secretaries of state, they're in almost every state."
    },
    {
      "Time_Start": 3500.7000000000003,
      "Time_End": 3509.7000000000003,
      "Text": " In the states where they aren't, the other position that's closest, lieutenant governor, may be our member of NAS, and often they are."
    },
    {
      "Time_Start": 3509.7000000000003,
      "Time_End": 3514.7000000000003,
      "Text": " They do a lot more than just elections, actually, as you may or may not know."
    },
    {
      "Time_Start": 3514.7000000000003,
      "Time_End": 3520.7000000000003,
      "Text": " Every single secretary of state role is a little bit different from the other states."
    },
    {
      "Time_Start": 3520.7000000000003,
      "Time_End": 3523.7000000000003,
      "Text": " Forty of them serve as their state chief election official."
    },
    {
      "Time_Start": 3523.7000000000003,
      "Time_End": 3531.7000000000003,
      "Text": " Almost all of them run business, what we call business services at NAS, for their states, registering, renewing businesses,"
    },
    {
      "Time_Start": 3531.7000000000003,
      "Time_End": 3535.7000000000003,
      "Text": " providing resources to small businesses, those sorts of things."
    },
    {
      "Time_Start": 3536.7000000000003,
      "Time_End": 3541.7000000000003,
      "Text": " A lot of them are the main record keeper, and the archivist is within the secretary's office."
    },
    {
      "Time_Start": 3541.7000000000003,
      "Time_End": 3543.7000000000003,
      "Text": " A lot of them do international relations."
    },
    {
      "Time_Start": 3543.7000000000003,
      "Time_End": 3546.7000000000003,
      "Text": " That's our one tie to the U.S. State Department."
    },
    {
      "Time_Start": 3546.7000000000003,
      "Time_End": 3551.7000000000003,
      "Text": " But, you know, their roles and responsibilities vary drastically."
    },
    {
      "Time_Start": 3551.7000000000003,
      "Time_End": 3561.7000000000003,
      "Text": " NAS, our role in the cyberspace and in all the space is to be a liaison between the states and the federal government or other partners."
    },
    {
      "Time_Start": 3561.7000000000003,
      "Time_End": 3563.7000000000003,
      "Text": " We work very closely with CISA."
    },
    {
      "Time_Start": 3563.7000000000003,
      "Time_End": 3569.7000000000003,
      "Text": " We work with them almost every day on, you know, whatever cybersecurity issues the members are facing"
    },
    {
      "Time_Start": 3569.7000000000003,
      "Time_End": 3576.7000000000003,
      "Text": " or are looking for support from the federal government or looking for less support from the federal government."
    },
    {
      "Time_Start": 3576.7000000000003,
      "Time_End": 3582.7000000000003,
      "Text": " We also work with FBI cyber and the intelligence community, the Election Assistance Commission,"
    },
    {
      "Time_Start": 3582.7000000000003,
      "Time_End": 3586.7000000000003,
      "Text": " and are kind of that conduit of information sharing back and forth."
    },
    {
      "Time_Start": 3586.7000000000003,
      "Time_End": 3593.7000000000003,
      "Text": " We also, our main role and what we are the most proud of our work is sharing the best ideas"
    },
    {
      "Time_Start": 3593.7000000000003,
      "Time_End": 3599.7000000000003,
      "Text": " and the most serious lessons learned across the states with each other."
    },
    {
      "Time_Start": 3599.7000000000003,
      "Time_End": 3607.7000000000003,
      "Text": " And I think that that information sharing role has really increased the collective resilience of Secretary of State offices"
    },
    {
      "Time_Start": 3607.7000000000003,
      "Time_End": 3611.7000000000003,
      "Text": " and the election, the security of our elections in this country."
    },
    {
      "Time_Start": 3611.7000000000003,
      "Time_End": 3615.7000000000003,
      "Text": " Just the sharing from Secretary of State office to Secretary of State office,"
    },
    {
      "Time_Start": 3615.7000000000003,
      "Time_End": 3618.7000000000003,
      "Text": " the building of relationships across their CIOs and CISOs,"
    },
    {
      "Time_Start": 3618.7000000000003,
      "Time_End": 3623.7000000000003,
      "Text": " and that's really, you know, the role that is most important to us at NAS."
    },
    {
      "Time_Start": 3623.7000000000003,
      "Time_End": 3632.7000000000003,
      "Text": " So secretaries in most states, I'm moving on to point number two, kind of how they fit in that state cyber policy environment."
    },
    {
      "Time_Start": 3632.7000000000003,
      "Time_End": 3636.7000000000003,
      "Text": " First, and most importantly probably to this discussion,"
    },
    {
      "Time_Start": 3636.7000000000003,
      "Time_End": 3642.7000000000003,
      "Text": " they are primarily administrators more so than they are policymakers, right?"
    },
    {
      "Time_Start": 3642.7000000000003,
      "Time_End": 3648.7000000000003,
      "Text": " They work with the state legislature and they sometimes advocate for policy positions,"
    },
    {
      "Time_Start": 3648.7000000000003,
      "Time_End": 3653.7000000000003,
      "Text": " but ultimately their role is administering the law."
    },
    {
      "Time_Start": 3653.7000000000003,
      "Time_End": 3656.7000000000003,
      "Text": " And so that's an important point."
    },
    {
      "Time_Start": 3656.7000000000003,
      "Time_End": 3663.7000000000003,
      "Text": " But in most states, the Secretary of State is an independently elected constitutional officer,"
    },
    {
      "Time_Start": 3663.7000000000003,
      "Time_End": 3665.7000000000003,
      "Text": " which means they don't fall under the governor."
    },
    {
      "Time_Start": 3665.7000000000003,
      "Time_End": 3668.7000000000003,
      "Text": " They are a separate statewide elected official."
    },
    {
      "Time_Start": 3668.7000000000003,
      "Time_End": 3677.7000000000003,
      "Text": " What that means is that they have to do a lot of coordination in the state with those who do work under the governor, right?"
    },
    {
      "Time_Start": 3677.7000000000003,
      "Time_End": 3681.7000000000003,
      "Text": " The Homeland Security Advisor, the Office of the State Chief Information Officer,"
    },
    {
      "Time_Start": 3681.7000000000003,
      "Time_End": 3686.7000000000003,
      "Text": " the Emergency Management Department, whatever it may be called in a state,"
    },
    {
      "Time_Start": 3686.7000000000003,
      "Time_End": 3690.7000000000003,
      "Text": " the National Guard, the governor's office, the state legislature, right?"
    },
    {
      "Time_Start": 3690.7000000000003,
      "Time_End": 3694.7000000000003,
      "Text": " So there's a lot of intrastate coordination that secretaries of state do,"
    },
    {
      "Time_Start": 3694.7000000000003,
      "Time_End": 3700.7000000000003,
      "Text": " and that role for them has increased dramatically since the 2016 election"
    },
    {
      "Time_Start": 3700.7000000000003,
      "Time_End": 3705.7000000000003,
      "Text": " and the designation of elections as critical infrastructure in 2017."
    },
    {
      "Time_Start": 3705.7000000000003,
      "Time_End": 3712.7000000000003,
      "Text": " And so I'll just make that point and can address any questions on that one later."
    },
    {
      "Time_Start": 3712.7000000000003,
      "Time_End": 3716.7000000000003,
      "Text": " And I'll move on to the third point, which is kind of in the cyber space,"
    },
    {
      "Time_Start": 3716.7000000000003,
      "Time_End": 3722.7000000000003,
      "Text": " what have been major trends for my members and major priorities?"
    },
    {
      "Time_Start": 3722.7000000000003,
      "Time_End": 3730.7000000000003,
      "Text": " So as you may know, election administration gets much more complicated than the 50 states run their own elections"
    },
    {
      "Time_Start": 3730.7000000000003,
      "Time_End": 3734.7000000000003,
      "Text": " in that most of the administration happens at the local government level,"
    },
    {
      "Time_Start": 3734.7000000000003,
      "Time_End": 3739.7000000000003,
      "Text": " so we're talking 8,000 to 10,000 local government election jurisdictions."
    },
    {
      "Time_Start": 3739.7000000000003,
      "Time_End": 3743.7000000000003,
      "Text": " And so in the cyber arena, a big part of the role of the Secretary of State"
    },
    {
      "Time_Start": 3743.7000000000003,
      "Time_End": 3747.7000000000003,
      "Text": " is providing support to those local government administrators."
    },
    {
      "Time_Start": 3747.7000000000003,
      "Time_End": 3752.7000000000003,
      "Text": " So in some places it's municipalities and townships, in most places it's counties."
    },
    {
      "Time_Start": 3752.7000000000003,
      "Time_End": 3757.7000000000003,
      "Text": " And so a massive push among Secretary of State offices has been establishing"
    },
    {
      "Time_Start": 3757.7000000000003,
      "Time_End": 3763.7000000000003,
      "Text": " what most of them call cyber navigator programs where they're employing folks at the state level"
    },
    {
      "Time_Start": 3763.7000000000003,
      "Time_End": 3766.7000000000003,
      "Text": " to go out and be boots on the grounds in the counties and the municipalities"
    },
    {
      "Time_Start": 3766.7000000000003,
      "Time_End": 3771.7000000000003,
      "Text": " to work with folks to raise their resilience."
    },
    {
      "Time_Start": 3771.7000000000003,
      "Time_End": 3777.7000000000003,
      "Text": " And part of that effort has been maturing the risk assessment model for states,"
    },
    {
      "Time_Start": 3777.7000000000003,
      "Time_End": 3785.7000000000003,
      "Text": " using actual frameworks that are out there to assess and prioritize risk management for the local governments."
    },
    {
      "Time_Start": 3785.7000000000003,
      "Time_End": 3792.7000000000003,
      "Text": " Again, usually just like our relationship with the federal government is still largely voluntary."
    },
    {
      "Time_Start": 3792.7000000000003,
      "Time_End": 3798.7000000000003,
      "Text": " That's a voluntary information and support structure with states to locals."
    },
    {
      "Time_Start": 3798.7000000000003,
      "Time_End": 3800.7000000000003,
      "Text": " It's generally the same, right?"
    },
    {
      "Time_Start": 3800.7000000000003,
      "Time_End": 3804.7000000000003,
      "Text": " Secretaries of State do not have, most of them do not have much authority"
    },
    {
      "Time_Start": 3804.7000000000003,
      "Time_End": 3809.7000000000003,
      "Text": " over their local election officials or local governments."
    },
    {
      "Time_Start": 3809.7000000000003,
      "Time_End": 3813.7000000000003,
      "Text": " And through the cyber navigator programs, they've really learned that most local election offices"
    },
    {
      "Time_Start": 3813.7000000000003,
      "Time_End": 3819.7000000000003,
      "Text": " get that IT and cybersecurity support from somewhere else in the county or municipal government"
    },
    {
      "Time_Start": 3819.7000000000003,
      "Time_End": 3821.7000000000003,
      "Text": " or even from a managed service provider."
    },
    {
      "Time_Start": 3821.7000000000003,
      "Time_End": 3825.7000000000003,
      "Text": " And so it's a very complex environment in which they work."
    },
    {
      "Time_Start": 3826.7000000000003,
      "Time_End": 3830.7000000000003,
      "Text": " But they have, you know, there are some secretaries who can impose requirements."
    },
    {
      "Time_Start": 3830.7000000000003,
      "Time_End": 3835.7000000000003,
      "Text": " A lot of others use federal grant funding to incentivize certain requirements."
    },
    {
      "Time_Start": 3835.7000000000003,
      "Time_End": 3842.7000000000003,
      "Text": " And that's been a big move in recent years is to, you know, tie specific requirements,"
    },
    {
      "Time_Start": 3842.7000000000003,
      "Time_End": 3847.7000000000003,
      "Text": " very basic foundational cyber requirements to federal grant funds for election security"
    },
    {
      "Time_Start": 3847.7000000000003,
      "Time_End": 3851.7000000000003,
      "Text": " as they pass them down to local governments."
    },
    {
      "Time_Start": 3851.7000000000003,
      "Time_End": 3858.7000000000003,
      "Text": " Besides working with their locals, other major areas have been cyber incident reporting"
    },
    {
      "Time_Start": 3858.7000000000003,
      "Time_End": 3860.7000000000003,
      "Text": " for elections specifically."
    },
    {
      "Time_Start": 3860.7000000000003,
      "Time_End": 3867.7000000000003,
      "Text": " But a lot of times within broader state laws, you know, from locals to the state"
    },
    {
      "Time_Start": 3867.7000000000003,
      "Time_End": 3873.7000000000003,
      "Text": " requiring some cyber incident reporting and or from vendors imposing or working with their,"
    },
    {
      "Time_Start": 3873.7000000000003,
      "Time_End": 3877.7000000000003,
      "Text": " either imposing requirements on their vendors through contracts or working with their vendors"
    },
    {
      "Time_Start": 3877.7000000000003,
      "Time_End": 3882.7000000000003,
      "Text": " to come to agreements on things like vendors sharing vulnerability assessments,"
    },
    {
      "Time_Start": 3882.7000000000003,
      "Time_End": 3888.7000000000003,
      "Text": " vendors establishing coordinated vulnerability disclosure policies and things like that."
    },
    {
      "Time_Start": 3888.7000000000003,
      "Time_End": 3895.7000000000003,
      "Text": " And then, you know, the other point that I would say has been a major priority,"
    },
    {
      "Time_Start": 3895.7000000000003,
      "Time_End": 3898.7000000000003,
      "Text": " and I could go on, but I'll stick with this one,"
    },
    {
      "Time_Start": 3898.7000000000003,
      "Time_End": 3902.7000000000003,
      "Text": " is kind of maturing the cybersecurity teams in the secretary of state offices."
    },
    {
      "Time_Start": 3903.7000000000003,
      "Time_End": 3910.7000000000003,
      "Text": " And so, you know, realizing that that IT director handling cybersecurity is not working anymore."
    },
    {
      "Time_Start": 3910.7000000000003,
      "Time_End": 3912.7000000000003,
      "Text": " The role is bigger."
    },
    {
      "Time_Start": 3912.7000000000003,
      "Time_End": 3918.7000000000003,
      "Text": " And so, you know, a lot of secretary of state offices are hiring CISOs,"
    },
    {
      "Time_Start": 3918.7000000000003,
      "Time_End": 3924.7000000000003,
      "Text": " having them be a part of the senior leadership team, and really building the team under that."
    },
    {
      "Time_Start": 3924.7000000000003,
      "Time_End": 3928.7000000000003,
      "Text": " And I said that was the last one, but one more, and a plug for our later session,"
    },
    {
      "Time_Start": 3928.7000000000003,
      "Time_End": 3933.7000000000003,
      "Text": " which is just establishing vulnerability disclosure policies and working with the hacker community."
    },
    {
      "Time_Start": 3933.7000000000003,
      "Time_End": 3935.7000000000003,
      "Text": " We've come a long way."
    },
    {
      "Time_Start": 3935.7000000000003,
      "Time_End": 3938.7000000000003,
      "Text": " We're not quite 10 years into the relationship."
    },
    {
      "Time_Start": 3938.7000000000003,
      "Time_End": 3941.7000000000003,
      "Text": " Like, on the medical side, elections isn't."
    },
    {
      "Time_Start": 3941.7000000000003,
      "Time_End": 3948.7000000000003,
      "Text": " But a lot of secretaries have established vulnerability disclosure policies in the last few years,"
    },
    {
      "Time_Start": 3948.7000000000003,
      "Time_End": 3952.7000000000003,
      "Text": " not just for their election systems, but for Internet-connected systems"
    },
    {
      "Time_Start": 3952.7000000000003,
      "Time_End": 3955.7000000000003,
      "Text": " that are under the control of the secretary of state office."
    },
    {
      "Time_Start": 3956.7000000000003,
      "Time_End": 3961.7000000000003,
      "Text": " And there's more definitely thinking about it and working with some people in this room"
    },
    {
      "Time_Start": 3961.7000000000003,
      "Time_End": 3965.7000000000003,
      "Text": " and a lot of people in this building to get to that point."
    },
    {
      "Time_Start": 3966.7000000000003,
      "Time_End": 3972.7000000000003,
      "Text": " So we've done a lot of work at NASS through our members in cyber leadership positions"
    },
    {
      "Time_Start": 3972.7000000000003,
      "Time_End": 3977.7000000000003,
      "Text": " to really work to build bridges with the hacker community and improve the relationship."
    },
    {
      "Time_Start": 3977.7000000000003,
      "Time_End": 3983.7000000000003,
      "Text": " And I really think that my members in many, many states are kind of leading the way in state government"
    },
    {
      "Time_Start": 3983.7000000000003,
      "Time_End": 3989.7000000000003,
      "Text": " in terms of establishing VDPs and even encouraging the CIO to do the same, to follow suit."
    },
    {
      "Time_Start": 3990.7000000000003,
      "Time_End": 3997.7000000000003,
      "Text": " Or, you know, just working with building those relationships with the security research community."
    },
    {
      "Time_Start": 3997.7000000000003,
      "Time_End": 4000.7000000000003,
      "Text": " And we're going to be talking a little bit more about that this afternoon at 5."
    },
    {
      "Time_Start": 4000.7000000000003,
      "Time_End": 4001.7000000000003,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4004.7000000000003,
      "Time_End": 4006.7000000000003,
      "Text": " All right. I'm the last one."
    },
    {
      "Time_Start": 4007.7000000000003,
      "Time_End": 4010.7000000000003,
      "Text": " All right, first I'm just going to ask you three questions, okay?"
    },
    {
      "Time_Start": 4010.7000000000003,
      "Time_End": 4013.7000000000003,
      "Text": " How many of you are familiar with CISA?"
    },
    {
      "Time_Start": 4014.7000000000003,
      "Time_End": 4015.7000000000003,
      "Text": " Okay, awesome."
    },
    {
      "Time_Start": 4015.7000000000003,
      "Time_End": 4021.7000000000003,
      "Text": " How many are you familiar with our director Jen Easterly and her Rubik's Cube skills?"
    },
    {
      "Time_Start": 4023.7000000000003,
      "Time_End": 4024.7000000000003,
      "Text": " Okay."
    },
    {
      "Time_Start": 4024.7000000000003,
      "Time_End": 4029.7000000000003,
      "Text": " How many of you think you can do a Rubik's Cube in like, I don't know, in just a couple minutes?"
    },
    {
      "Time_Start": 4030.7000000000003,
      "Time_End": 4031.7000000000003,
      "Text": " Yeah, me either."
    },
    {
      "Time_Start": 4031.7000000000003,
      "Time_End": 4036.7000000000003,
      "Text": " I can't do one to save my life, so when I watch her do it, I'm amazed."
    },
    {
      "Time_Start": 4036.7000000000003,
      "Time_End": 4041.7000000000003,
      "Text": " So, and I also want to just acknowledge everyone here on the panel."
    },
    {
      "Time_Start": 4041.7000000000003,
      "Time_End": 4043.7000000000003,
      "Text": " It's been really fascinating to hear you."
    },
    {
      "Time_Start": 4043.7000000000003,
      "Time_End": 4050.7000000000003,
      "Text": " And I just, I love this idea of, you know, being in government because you see these issues, right?"
    },
    {
      "Time_Start": 4050.7000000000003,
      "Time_End": 4052.7000000000003,
      "Text": " And you want to try to fix them, right?"
    },
    {
      "Time_Start": 4052.7000000000003,
      "Time_End": 4056.7000000000003,
      "Text": " And not necessarily in government, but other aspects of law and policy."
    },
    {
      "Time_Start": 4056.7000000000003,
      "Time_End": 4060.7000000000003,
      "Text": " And so I just want to, you know, give my appreciation, my admiration for you all."
    },
    {
      "Time_Start": 4060.7000000000003,
      "Time_End": 4063.7000000000003,
      "Text": " And especially here in the community too for your interest."
    },
    {
      "Time_Start": 4063.7000000000003,
      "Time_End": 4065.7000000000003,
      "Text": " And, you know, I just want to thank you."
    },
    {
      "Time_Start": 4066.7000000000003,
      "Time_End": 4068.7000000000003,
      "Text": " So I'm at CISA."
    },
    {
      "Time_Start": 4068.7000000000003,
      "Time_End": 4070.7000000000003,
      "Text": " I've been there for about six or seven months."
    },
    {
      "Time_Start": 4070.7000000000003,
      "Time_End": 4072.7000000000003,
      "Text": " It's awesome."
    },
    {
      "Time_Start": 4072.7000000000003,
      "Time_End": 4075.7000000000003,
      "Text": " So if you're ever thinking about joining government, please do."
    },
    {
      "Time_Start": 4075.7000000000003,
      "Time_End": 4077.7000000000003,
      "Text": " We are always hiring."
    },
    {
      "Time_Start": 4077.7000000000003,
      "Time_End": 4084.7000000000003,
      "Text": " So, and if you are interested, I can talk to you after about some open positions."
    },
    {
      "Time_Start": 4084.7000000000003,
      "Time_End": 4086.7000000000003,
      "Text": " So what do we do?"
    },
    {
      "Time_Start": 4086.7000000000003,
      "Time_End": 4094.7000000000003,
      "Text": " We work with our partners to drive down systemic risk too and to defend our critical infrastructure, right?"
    },
    {
      "Time_Start": 4094.7000000000003,
      "Time_End": 4096.700000000001,
      "Text": " So let's unpack that."
    },
    {
      "Time_Start": 4096.700000000001,
      "Time_End": 4098.700000000001,
      "Text": " There are kind of three main things in there."
    },
    {
      "Time_Start": 4098.700000000001,
      "Time_End": 4100.700000000001,
      "Text": " What are the who?"
    },
    {
      "Time_Start": 4100.700000000001,
      "Time_End": 4105.700000000001,
      "Text": " The who mostly are our federal civilian branches, right?"
    },
    {
      "Time_Start": 4105.700000000001,
      "Time_End": 4109.700000000001,
      "Text": " So we're the primary people responsible for protecting that."
    },
    {
      "Time_Start": 4109.700000000001,
      "Time_End": 4114.700000000001,
      "Text": " We work with our state and local tribal territorial partners."
    },
    {
      "Time_Start": 4114.700000000001,
      "Time_End": 4116.700000000001,
      "Text": " The private sector as well."
    },
    {
      "Time_Start": 4116.700000000001,
      "Time_End": 4120.700000000001,
      "Text": " And, of course, you know, with the general public, with you all."
    },
    {
      "Time_Start": 4120.700000000001,
      "Time_End": 4122.700000000001,
      "Text": " How do we do it?"
    },
    {
      "Time_Start": 4122.7,
      "Time_End": 4126.7,
      "Text": " Well, there's a number of ways that we organize how we're doing it, right?"
    },
    {
      "Time_Start": 4126.7,
      "Time_End": 4131.7,
      "Text": " We kind of get our strategy and authorities, and I'll go over that in a second."
    },
    {
      "Time_Start": 4131.7,
      "Time_End": 4139.7,
      "Text": " But right now our cyber strategic plan really is focused on three main things, okay?"
    },
    {
      "Time_Start": 4139.7,
      "Time_End": 4142.7,
      "Text": " That's addressing the immediate threats, right?"
    },
    {
      "Time_Start": 4142.7,
      "Time_End": 4151.7,
      "Text": " So kind of like that blocking and tackling and, you know, making sure that the most immediate threats are stopped, mitigated, prevented, et cetera."
    },
    {
      "Time_Start": 4151.7,
      "Time_End": 4153.7,
      "Text": " Hardening the terrain, right?"
    },
    {
      "Time_Start": 4153.7,
      "Time_End": 4163.7,
      "Text": " So making it so that, you know, we can't get those or attackers really can't get, you know, our critical infrastructure and things like that."
    },
    {
      "Time_Start": 4163.7,
      "Time_End": 4165.7,
      "Text": " And, finally, driving security at scale."
    },
    {
      "Time_Start": 4165.7,
      "Time_End": 4171.7,
      "Text": " So to Harley's point earlier, remember reporting doesn't equal resilience, and we know that."
    },
    {
      "Time_Start": 4171.7,
      "Time_End": 4186.7,
      "Text": " And so as part of the national cybersecurity strategy and that shift and then, you know, the resulting strategies, that's something that we're really invested in is making sure that our products, our software, our hardware are secure."
    },
    {
      "Time_Start": 4186.7,
      "Time_End": 4191.7,
      "Text": " Because that is what's really going to drive resilience and security."
    },
    {
      "Time_Start": 4191.7,
      "Time_End": 4196.7,
      "Text": " Things like reporting and all the other things are important, they're great."
    },
    {
      "Time_Start": 4196.7,
      "Time_End": 4201.7,
      "Text": " But, ultimately, it is the security of our products that will help us."
    },
    {
      "Time_Start": 4201.7,
      "Time_End": 4207.7,
      "Text": " As well as I'll put a plug in on the state side, too, especially our emergency management, right?"
    },
    {
      "Time_Start": 4207.7,
      "Time_End": 4217.7,
      "Text": " And I'll just give a plug to my former colleague at the Belfer Center, Juliet Kayyem, who really talks a lot about resilience and sort of right of boom, right?"
    },
    {
      "Time_Start": 4217.7,
      "Time_End": 4224.7,
      "Text": " I think the left of boom and the right of boom are so critically important, and I don't think that we address it enough."
    },
    {
      "Time_Start": 4224.7,
      "Time_End": 4227.7,
      "Text": " I think we're kind of like in the boom, right, a lot."
    },
    {
      "Time_Start": 4227.7,
      "Time_End": 4230.7,
      "Text": " We need to go left and we need to go very right."
    },
    {
      "Time_Start": 4230.7,
      "Time_End": 4231.7,
      "Text": " Okay?"
    },
    {
      "Time_Start": 4231.7,
      "Time_End": 4232.7,
      "Text": " All right."
    },
    {
      "Time_Start": 4232.7,
      "Time_End": 4235.7,
      "Text": " So how do we work with our interagency partners?"
    },
    {
      "Time_Start": 4235.7,
      "Time_End": 4236.7,
      "Text": " How do we fit in?"
    },
    {
      "Time_Start": 4236.7,
      "Time_End": 4240.7,
      "Text": " So think of us as the doers and the advisors."
    },
    {
      "Time_Start": 4240.7,
      "Time_End": 4253.7,
      "Text": " So we get our authorities, we get our money from Congress, but then we get our strategic direction from the Office of the National Cyber Director, from, you know, we look to the National Security Council."
    },
    {
      "Time_Start": 4254.7,
      "Time_End": 4264.7,
      "Text": " We look to, of course, you know, big CISA for our big strategy, and then, of course, within our division, we have our cyber strat plan."
    },
    {
      "Time_Start": 4264.7,
      "Time_End": 4272.7,
      "Text": " We work hand-in-hand together with the other federal cyber executive branch, so we're actually responsible for protecting them."
    },
    {
      "Time_Start": 4272.7,
      "Time_End": 4277.7,
      "Text": " We work together with state and local, especially through our cyber state advisors."
    },
    {
      "Time_Start": 4277.7,
      "Time_End": 4291.7,
      "Text": " So if you know that CISA actually has 10 regional offices, which is awesome, then you may know the cyber security advisors there, the state advisors in each of the different states."
    },
    {
      "Time_Start": 4291.7,
      "Time_End": 4298.7,
      "Text": " I believe we're in Region 9 right now, so I don't know if we have any of our Region 9 colleagues from this area."
    },
    {
      "Time_Start": 4299.7,
      "Time_End": 4313.7,
      "Text": " And then we do a lot of collaboration with the interagency, so the State Department, FBI, NSA, the intelligence community, Department of Defense, to help defend and, of course, collaborate."
    },
    {
      "Time_Start": 4313.7,
      "Time_End": 4320.7,
      "Text": " So what are we working on in the next year, right?"
    },
    {
      "Time_Start": 4320.7,
      "Time_End": 4324.7,
      "Text": " So I mentioned these three major things that we're doing."
    },
    {
      "Time_Start": 4324.7,
      "Time_End": 4333.7,
      "Text": " This is really from our cyber security strategic plan, which, of course, flows from the National Cyber Security Plan as well as CISA's strategic plan as well."
    },
    {
      "Time_Start": 4333.7,
      "Time_End": 4337.7,
      "Text": " But let's talk about what addressing those immediate threats are."
    },
    {
      "Time_Start": 4337.7,
      "Time_End": 4349.7,
      "Text": " We want to increase our visibility and we want to increase our ability to mitigate the threats through data collaboration and cyber response and recovery fund."
    },
    {
      "Time_Start": 4349.7,
      "Time_End": 4355.7,
      "Text": " I apologize. I'm getting over a cold, so I don't know if I can continue."
    },
    {
      "Time_Start": 4355.7,
      "Time_End": 4366.7,
      "Text": " But I will just say hardening the terrain, understanding how the attacks occur, and then driving security at scale."
    },
    {
      "Time_Start": 4366.7,
      "Time_End": 4368.7,
      "Text": " This is a really important one for me."
    },
    {
      "Time_Start": 4368.7,
      "Time_End": 4379.7,
      "Text": " I'm working on Secure by Design, so Michaela mentioned this a lot, as well as the open source security or software security ecosystem."
    },
    {
      "Time_Start": 4379.7,
      "Time_End": 4382.7,
      "Text": " We are giving a talk tomorrow on Secure by Design."
    },
    {
      "Time_Start": 4382.7,
      "Time_End": 4383.7,
      "Text": " Please come."
    },
    {
      "Time_Start": 4383.7,
      "Time_End": 4385.7,
      "Text": " Please come look at our draft and mark it up."
    },
    {
      "Time_Start": 4385.7,
      "Time_End": 4394.7,
      "Text": " We brought CISA-branded red pens for you to do so, so we're really excited for you to come and take a look at it."
    },
    {
      "Time_Start": 4394.7,
      "Time_End": 4398.7,
      "Text": " And we're looking at emerging tech and workforce as well."
    },
    {
      "Time_Start": 4398.7,
      "Time_End": 4405.7,
      "Text": " So those are the major things that we're doing, and I'm going to pause there because I don't want to go on forever, but thank you."
    },
    {
      "Time_Start": 4405.7,
      "Time_End": 4406.7,
      "Text": " Thank you so much."
    },
    {
      "Time_Start": 4406.7,
      "Time_End": 4408.7,
      "Text": " Can we get a round of applause for our panel?"
    },
    {
      "Time_Start": 4408.7,
      "Time_End": 4415.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4415.7,
      "Time_End": 4418.7,
      "Text": " And we still have a bit of time, I believe, Maurice, right?"
    },
    {
      "Time_Start": 4418.7,
      "Time_End": 4423.7,
      "Text": " So if you have any questions, we covered a lot of grounds on U.S. policy, and that was the point, right?"
    },
    {
      "Time_Start": 4423.7,
      "Time_End": 4429.7,
      "Text": " It was U.S. policy 101, and so you got to see a broad range of things."
    },
    {
      "Time_Start": 4429.7,
      "Time_End": 4430.7,
      "Text": " What do you think?"
    },
    {
      "Time_Start": 4430.7,
      "Time_End": 4432.7,
      "Text": " What is left out?"
    },
    {
      "Time_Start": 4432.7,
      "Time_End": 4434.7,
      "Text": " What do you want to know more about?"
    },
    {
      "Time_Start": 4434.7,
      "Time_End": 4439.7,
      "Text": " Please, now is a good time for your questions."
    },
    {
      "Time_Start": 4439.7,
      "Time_End": 4451.7,
      "Text": " And as a reminder, go ahead and step up to the mic so that everyone can hear the question."
    },
    {
      "Time_Start": 4452.7,
      "Time_End": 4453.7,
      "Text": " So my question."
    },
    {
      "Time_Start": 4453.7,
      "Time_End": 4454.7,
      "Text": " Oh, no."
    },
    {
      "Time_Start": 4454.7,
      "Time_End": 4455.7,
      "Text": " Oh, no."
    },
    {
      "Time_Start": 4455.7,
      "Time_End": 4457.7,
      "Text": " Do I just need to talk really loud?"
    },
    {
      "Time_Start": 4457.7,
      "Time_End": 4458.7,
      "Text": " Does that one work?"
    },
    {
      "Time_Start": 4458.7,
      "Time_End": 4459.7,
      "Text": " Check, check, check."
    },
    {
      "Time_Start": 4459.7,
      "Time_End": 4460.7,
      "Text": " Check, check, check."
    },
    {
      "Time_Start": 4460.7,
      "Time_End": 4463.7,
      "Text": " Anything?"
    },
    {
      "Time_Start": 4463.7,
      "Time_End": 4464.7,
      "Text": " I can go over there."
    },
    {
      "Time_Start": 4464.7,
      "Time_End": 4465.7,
      "Text": " Okay."
    },
    {
      "Time_Start": 4465.7,
      "Time_End": 4466.7,
      "Text": " Let's start."
    },
    {
      "Time_Start": 4466.7,
      "Time_End": 4469.7,
      "Text": " Go ahead while we're waiting."
    },
    {
      "Time_Start": 4469.7,
      "Time_End": 4471.7,
      "Text": " Oh, well."
    },
    {
      "Time_Start": 4471.7,
      "Time_End": 4476.7,
      "Text": " All right, so my question on harmonizing some of the regulations and things like that."
    },
    {
      "Time_Start": 4477.7,
      "Time_End": 4482.7,
      "Text": " In higher education specifically, there's a, I would call it a disconnect between the"
    },
    {
      "Time_Start": 4482.7,
      "Time_End": 4485.7,
      "Text": " research side of things and the education side of things."
    },
    {
      "Time_Start": 4485.7,
      "Time_End": 4492.7,
      "Text": " And in the research side of things, we functionally work as a federal contractor for the purposes"
    },
    {
      "Time_Start": 4492.7,
      "Time_End": 4494.7,
      "Text": " of, you know, DOD grants and things like that."
    },
    {
      "Time_Start": 4494.7,
      "Time_End": 4499.7,
      "Text": " And the side of it that deals with educational data and student data and things like that"
    },
    {
      "Time_Start": 4499.7,
      "Time_End": 4500.7,
      "Text": " is entirely separate."
    },
    {
      "Time_Start": 4500.7,
      "Time_End": 4505.7,
      "Text": " And I know there are talks of changes in regulation in that area."
    },
    {
      "Time_Start": 4505.7,
      "Time_End": 4510.7,
      "Text": " I was wondering if you guys could talk a little bit about those two areas and the possibility"
    },
    {
      "Time_Start": 4510.7,
      "Time_End": 4516.7,
      "Text": " of bringing them together a little more and sort of allowing us to utilize our efforts"
    },
    {
      "Time_Start": 4516.7,
      "Time_End": 4521.7,
      "Text": " in both areas rather than having the research security people and the other security people"
    },
    {
      "Time_Start": 4521.7,
      "Time_End": 4526.7,
      "Text": " and we like wave at each other across, you know, the way, so."
    },
    {
      "Time_Start": 4526.7,
      "Time_End": 4527.7,
      "Text": " Great."
    },
    {
      "Time_Start": 4527.7,
      "Time_End": 4531.7,
      "Text": " I can jump in and then if anyone else wants to chime in as well, feel free to."
    },
    {
      "Time_Start": 4531.7,
      "Time_End": 4533.7,
      "Text": " Really appreciate your question."
    },
    {
      "Time_Start": 4533.7,
      "Time_End": 4539.7,
      "Text": " I think it illustrates why regulatory harmonization is so challenging because it is sector specific"
    },
    {
      "Time_Start": 4539.7,
      "Time_End": 4541.7,
      "Text": " in many cases."
    },
    {
      "Time_Start": 4541.7,
      "Time_End": 4545.7,
      "Text": " And so academia may be very different than the types of regulatory harmonization that's"
    },
    {
      "Time_Start": 4545.7,
      "Time_End": 4548.7,
      "Text": " needed in the water sector or utilities."
    },
    {
      "Time_Start": 4548.7,
      "Time_End": 4553.7,
      "Text": " One of the things that we are hoping to do with the request for information, the RFI,"
    },
    {
      "Time_Start": 4553.7,
      "Time_End": 4558.7,
      "Text": " is to pull out some of those sector specific nuances so that we can say, all right, we"
    },
    {
      "Time_Start": 4558.7,
      "Time_End": 4564.7,
      "Text": " can engage with both independent regulators as well as engage on, with the sector, with"
    },
    {
      "Time_Start": 4564.7,
      "Time_End": 4570.7,
      "Text": " private sector entities or universities on those particular questions of how do we ensure"
    },
    {
      "Time_Start": 4570.7,
      "Time_End": 4577.7,
      "Text": " that regulation is not conflicting with each other or overlapping or hopefully not discordant"
    },
    {
      "Time_Start": 4577.7,
      "Time_End": 4580.7,
      "Text": " at all and where the gaps are."
    },
    {
      "Time_Start": 4580.7,
      "Time_End": 4582.7,
      "Text": " So I think you mentioned that as well."
    },
    {
      "Time_Start": 4582.7,
      "Time_End": 4587.7,
      "Text": " Sometimes there are gaps and that causes some of the problems."
    },
    {
      "Time_Start": 4587.7,
      "Time_End": 4590.7,
      "Text": " I think it's very much a part of what we're hoping to do."
    },
    {
      "Time_Start": 4590.7,
      "Time_End": 4598.7,
      "Text": " And in the next couple of months, the goal is to solicit information from the general"
    },
    {
      "Time_Start": 4598.7,
      "Time_End": 4603.7,
      "Text": " public, solicit information from the departments and agencies that we work with, and come up"
    },
    {
      "Time_Start": 4603.7,
      "Time_End": 4608.7,
      "Text": " with plans to harmonize regulation in each of those sectors."
    },
    {
      "Time_Start": 4608.7,
      "Time_End": 4613.7,
      "Text": " So happy to talk with you more afterwards as well, but definitely encourage you to contribute"
    },
    {
      "Time_Start": 4613.7,
      "Time_End": 4618.7,
      "Text": " to that process of informing sector specific regulatory harmonization."
    },
    {
      "Time_Start": 4618.7,
      "Time_End": 4623.7,
      "Text": " I thought that was a great point that you raised."
    },
    {
      "Time_Start": 4623.7,
      "Time_End": 4628.7,
      "Text": " I had not actually heard about that particular regulatory quirk, but I think it makes absolute"
    },
    {
      "Time_Start": 4628.7,
      "Time_End": 4634.7,
      "Text": " sense to, one of the things that I think we're seeing as more organizations are taking on"
    },
    {
      "Time_Start": 4634.7,
      "Time_End": 4640.7,
      "Text": " cybersecurity departments like in governments and nonprofits and companies, we want to avoid"
    },
    {
      "Time_Start": 4640.7,
      "Time_End": 4643.7,
      "Text": " having those cybersecurity departments siloed."
    },
    {
      "Time_Start": 4643.7,
      "Time_End": 4648.7,
      "Text": " I mean, really it should be a horizontal across the organization sort of function."
    },
    {
      "Time_Start": 4648.7,
      "Time_End": 4652.7,
      "Text": " And it sounds like what you're describing is the separation between that function and"
    },
    {
      "Time_Start": 4652.7,
      "Time_End": 4657.7,
      "Text": " the folks that are working with student data, which is not really sustainable, right?"
    },
    {
      "Time_Start": 4657.7,
      "Time_End": 4661.7,
      "Text": " Student data is some of the most valuable assets that our schools have."
    },
    {
      "Time_Start": 4661.7,
      "Time_End": 4664.7,
      "Text": " And so yes, I think that's an excellent point."
    },
    {
      "Time_Start": 4664.7,
      "Time_End": 4671.7,
      "Text": " To Michaela's point, I would encourage you to talk with folks about submitting comments"
    },
    {
      "Time_Start": 4671.7,
      "Time_End": 4675.7,
      "Text": " on that very issue to ONCD."
    },
    {
      "Time_Start": 4675.7,
      "Time_End": 4681.7,
      "Text": " I think we take for granted a lot of times the willingness, the openness of U.S. government"
    },
    {
      "Time_Start": 4681.7,
      "Time_End": 4686.7,
      "Text": " agencies to feedback from the population."
    },
    {
      "Time_Start": 4686.7,
      "Time_End": 4691.7,
      "Text": " But there are formal processes where you can submit comments and make a difference."
    },
    {
      "Time_Start": 4691.7,
      "Time_End": 4697.7,
      "Text": " And I do believe that ONCD will read it and will do what they can."
    },
    {
      "Time_Start": 4697.7,
      "Time_End": 4698.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4698.7,
      "Time_End": 4699.7,
      "Text": " Did you have a follow-up?"
    },
    {
      "Time_Start": 4699.7,
      "Time_End": 4702.7,
      "Text": " No, that was it."
    },
    {
      "Time_Start": 4702.7,
      "Time_End": 4709.7,
      "Text": " We're doing CMMC for our research things, but we're not necessarily doing that for our"
    },
    {
      "Time_Start": 4709.7,
      "Time_End": 4710.7,
      "Text": " student data at the moment."
    },
    {
      "Time_Start": 4710.7,
      "Time_End": 4712.7,
      "Text": " So yeah, that was pretty much it."
    },
    {
      "Time_Start": 4712.7,
      "Time_End": 4713.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4713.7,
      "Time_End": 4714.7,
      "Text": " That was great."
    },
    {
      "Time_Start": 4714.7,
      "Time_End": 4715.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4715.7,
      "Time_End": 4716.7,
      "Text": " All right."
    },
    {
      "Time_Start": 4716.7,
      "Time_End": 4717.7,
      "Text": " And we had at least one other question."
    },
    {
      "Time_Start": 4717.7,
      "Time_End": 4718.7,
      "Text": " Yeah."
    },
    {
      "Time_Start": 4718.7,
      "Time_End": 4720.7,
      "Text": " I'll try to keep it brief."
    },
    {
      "Time_Start": 4720.7,
      "Time_End": 4726.7,
      "Text": " I kind of want to do a concern, then a question, then a compliment, if you don't mind."
    },
    {
      "Time_Start": 4726.7,
      "Time_End": 4732.7,
      "Text": " So coming from a technical IR leadership role, I feel like my job is going to be increasingly"
    },
    {
      "Time_Start": 4732.7,
      "Time_End": 4737.7,
      "Text": " about how I can align facts to avoid a material incident."
    },
    {
      "Time_Start": 4737.7,
      "Time_End": 4743.7,
      "Text": " So I'd like to ask what your honest definition would be of a material impact in a generic"
    },
    {
      "Time_Start": 4744.7,
      "Time_End": 4745.7,
      "Text": " enterprise."
    },
    {
      "Time_Start": 4745.7,
      "Time_End": 4751.7,
      "Text": " And also just an appreciation for kind of a thankless job that I think you do, because"
    },
    {
      "Time_Start": 4751.7,
      "Time_End": 4752.7,
      "Text": " it's not easy."
    },
    {
      "Time_Start": 4752.7,
      "Time_End": 4753.7,
      "Text": " So yeah."
    },
    {
      "Time_Start": 4753.7,
      "Time_End": 4757.7,
      "Text": " I'll start, if you don't mind."
    },
    {
      "Time_Start": 4757.7,
      "Time_End": 4762.7,
      "Text": " Because your initial question, it sounded like you wanted to, for those of you that"
    },
    {
      "Time_Start": 4762.7,
      "Time_End": 4767.7,
      "Text": " didn't hear, it sounded like you said part of your job would be to align facts with a"
    },
    {
      "Time_Start": 4767.7,
      "Time_End": 4771.7,
      "Text": " FOIA-able record of the incident."
    },
    {
      "Time_Start": 4771.7,
      "Time_End": 4772.7,
      "Text": " Right?"
    },
    {
      "Time_Start": 4772.7,
      "Time_End": 4774.7,
      "Text": " And so did I get that right?"
    },
    {
      "Time_Start": 4774.7,
      "Time_End": 4775.7,
      "Text": " I guess, yeah."
    },
    {
      "Time_Start": 4775.7,
      "Time_End": 4776.7,
      "Text": " That's your fear."
    },
    {
      "Time_Start": 4776.7,
      "Time_End": 4777.7,
      "Text": " If I could use street terms, I guess."
    },
    {
      "Time_Start": 4777.7,
      "Time_End": 4784.7,
      "Text": " I mean, I feel like executives are going to want us as incident responders to find anything"
    },
    {
      "Time_Start": 4784.7,
      "Time_End": 4788.7,
      "Text": " we can to avoid calling something a material incident, because the SEC says you've got"
    },
    {
      "Time_Start": 4788.7,
      "Time_End": 4789.7,
      "Text": " four days now."
    },
    {
      "Time_Start": 4789.7,
      "Time_End": 4793.7,
      "Text": " As soon as an incident pops off, you've got four days before you've got to report it."
    },
    {
      "Time_Start": 4794.7,
      "Time_End": 4805.7,
      "Text": " So the SEC's law or regulation is unique insofar as it will go public."
    },
    {
      "Time_Start": 4805.7,
      "Time_End": 4809.7,
      "Text": " So to be clear, the other incident reporting regulations that are out there, almost all"
    },
    {
      "Time_Start": 4809.7,
      "Time_End": 4810.7,
      "Text": " of them are confidential."
    },
    {
      "Time_Start": 4810.7,
      "Time_End": 4815.7,
      "Text": " And so for CERCIA, which is a major one for critical infrastructure owners and operators,"
    },
    {
      "Time_Start": 4815.7,
      "Time_End": 4819.7,
      "Text": " and when we say critical infrastructure, it's a big, big chunk to the economy."
    },
    {
      "Time_Start": 4819.7,
      "Time_End": 4822.7,
      "Text": " Those actually are exempt from FOIA."
    },
    {
      "Time_Start": 4822.7,
      "Time_End": 4826.7,
      "Text": " And there's a fair amount of anonymization that is supposed to take place when you submit"
    },
    {
      "Time_Start": 4826.7,
      "Time_End": 4827.7,
      "Text": " an incident to CERCIA."
    },
    {
      "Time_Start": 4827.7,
      "Time_End": 4832.7,
      "Text": " The SEC's rule is completely different, as you know, and it's public."
    },
    {
      "Time_Start": 4832.7,
      "Time_End": 4836.7,
      "Text": " And this is something that the security community raised repeatedly with the SEC as being potentially"
    },
    {
      "Time_Start": 4836.7,
      "Time_End": 4842.7,
      "Text": " problematic, but they went ahead with it anyway, because their mandate is actually not to enhance"
    },
    {
      "Time_Start": 4842.7,
      "Time_End": 4843.7,
      "Text": " security."
    },
    {
      "Time_Start": 4843.7,
      "Time_End": 4846.7,
      "Text": " It is to provide information to investors."
    },
    {
      "Time_Start": 4846.7,
      "Time_End": 4848.7,
      "Text": " That is what it is."
    },
    {
      "Time_Start": 4848.7,
      "Time_End": 4851.7,
      "Text": " And I think that you raise a good point."
    },
    {
      "Time_Start": 4851.7,
      "Time_End": 4853.7,
      "Text": " It is not actually even just about incidents."
    },
    {
      "Time_Start": 4853.7,
      "Time_End": 4856.7,
      "Text": " It's about your entire security program, your entire security posture, because those are"
    },
    {
      "Time_Start": 4856.7,
      "Time_End": 4859.7,
      "Text": " things that have to be disclosed under that same regulation."
    },
    {
      "Time_Start": 4859.7,
      "Time_End": 4864.7,
      "Text": " And I think that where it will move is not to deny facts."
    },
    {
      "Time_Start": 4864.7,
      "Time_End": 4868.7,
      "Text": " I think that you're going to be releasing it publicly."
    },
    {
      "Time_Start": 4868.7,
      "Time_End": 4875.7,
      "Text": " There may be pressure to dress up the facts in a way that is better for public consumption."
    },
    {
      "Time_Start": 4875.7,
      "Time_End": 4876.7,
      "Text": " Yeah, that's it."
    },
    {
      "Time_Start": 4876.7,
      "Time_End": 4877.7,
      "Text": " Right?"
    },
    {
      "Time_Start": 4877.7,
      "Time_End": 4879.7,
      "Text": " But that doesn't mean being false about it either."
    },
    {
      "Time_Start": 4880.7,
      "Time_End": 4884.7,
      "Text": " I think what it means is looping in your legal team and your corporate communications team"
    },
    {
      "Time_Start": 4884.7,
      "Time_End": 4888.7,
      "Text": " earlier on in the process, that when you do make that disclosure, you're accurate, but"
    },
    {
      "Time_Start": 4888.7,
      "Time_End": 4893.7,
      "Text": " you also, you're clearing the message that you want to get out there to the public, because"
    },
    {
      "Time_Start": 4893.7,
      "Time_End": 4896.7,
      "Text": " now you're playing to a different audience than if you were just submitting it to, say,"
    },
    {
      "Time_Start": 4896.7,
      "Time_End": 4898.7,
      "Text": " CISA under CERCIA."
    },
    {
      "Time_Start": 4898.7,
      "Time_End": 4899.7,
      "Text": " Okay."
    },
    {
      "Time_Start": 4899.7,
      "Time_End": 4900.7,
      "Text": " So I don't think it's about being false."
    },
    {
      "Time_Start": 4900.7,
      "Time_End": 4904.7,
      "Text": " I think it will be about more cross-collaboration with other arms of the business."
    },
    {
      "Time_Start": 4904.7,
      "Time_End": 4905.7,
      "Text": " Yeah, okay."
    },
    {
      "Time_Start": 4905.7,
      "Time_End": 4907.7,
      "Text": " Yeah, and if I could just jump in on that."
    },
    {
      "Time_Start": 4907.7,
      "Time_End": 4909.7,
      "Text": " I don't know if you guys can hear me."
    },
    {
      "Time_Start": 4909.7,
      "Time_End": 4913.7,
      "Text": " This idea of secure by design is super important, right?"
    },
    {
      "Time_Start": 4913.7,
      "Time_End": 4920.7,
      "Text": " You can advocate for that, because if you're the ones who are kind of getting, you know,"
    },
    {
      "Time_Start": 4920.7,
      "Time_End": 4924.7,
      "Text": " not in trouble, but you're concerned about that, again, let's shift that burden way,"
    },
    {
      "Time_Start": 4924.7,
      "Time_End": 4931.7,
      "Text": " way left, right, to the manufacturers of that software that can ensure or at least work"
    },
    {
      "Time_Start": 4931.7,
      "Time_End": 4937.7,
      "Text": " to, you know, make these products secure so that, you know, there's less attacks, right?"
    },
    {
      "Time_Start": 4937.7,
      "Time_End": 4939.7,
      "Text": " It makes your job easier."
    },
    {
      "Time_Start": 4939.7,
      "Time_End": 4943.7,
      "Text": " So, you know, let's generate that demand as well from our vendors."
    },
    {
      "Time_Start": 4943.7,
      "Time_End": 4944.7,
      "Text": " All right."
    },
    {
      "Time_Start": 4944.7,
      "Time_End": 4945.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4945.7,
      "Time_End": 4946.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 4946.7,
      "Time_End": 4950.7,
      "Text": " If we have time, let's do one more question, and then end it."
    },
    {
      "Time_Start": 4950.7,
      "Time_End": 4952.7,
      "Text": " We have, like, three people that want to talk."
    },
    {
      "Time_Start": 4952.7,
      "Time_End": 4953.7,
      "Text": " We can take more."
    },
    {
      "Time_Start": 4953.7,
      "Time_End": 4954.7,
      "Text": " We can take more questions?"
    },
    {
      "Time_Start": 4954.7,
      "Time_End": 4957.7,
      "Text": " Let's do, oh, my gosh, we have a whole bunch."
    },
    {
      "Time_Start": 4957.7,
      "Time_End": 4959.7,
      "Text": " We are going to do this forever."
    },
    {
      "Time_Start": 4959.7,
      "Time_End": 4961.7,
      "Text": " Go for it."
    },
    {
      "Time_Start": 4961.7,
      "Time_End": 4966.7,
      "Text": " You know, different device types, network devices, medical devices, election devices,"
    },
    {
      "Time_Start": 4966.7,
      "Time_End": 4971.7,
      "Text": " IoT devices have a lot of similar challenges in securing."
    },
    {
      "Time_Start": 4971.7,
      "Time_End": 4977.7,
      "Text": " It's wonderful to see the progress that's been made in the medical device field over"
    },
    {
      "Time_Start": 4977.7,
      "Time_End": 4979.7,
      "Text": " the last ten years."
    },
    {
      "Time_Start": 4979.7,
      "Time_End": 4985.7,
      "Text": " How are agencies working together to learn from, you know, overcoming some of the challenges"
    },
    {
      "Time_Start": 4985.7,
      "Time_End": 4987.7,
      "Text": " there?"
    },
    {
      "Time_Start": 4987.7,
      "Time_End": 4992.7,
      "Text": " What should we expect in the next two, three years as far as collaboration?"
    },
    {
      "Time_Start": 4992.7,
      "Time_End": 4994.7,
      "Text": " On medical devices specifically?"
    },
    {
      "Time_Start": 4994.7,
      "Time_End": 4996.7,
      "Text": " Across all device families, really."
    },
    {
      "Time_Start": 4996.7,
      "Time_End": 5000.7,
      "Text": " We see medical device and election device, for instance."
    },
    {
      "Time_Start": 5000.7,
      "Time_End": 5004.7,
      "Text": " The risks are high in both, obviously."
    },
    {
      "Time_Start": 5004.7,
      "Time_End": 5008.7,
      "Text": " How are your teams collaborating?"
    },
    {
      "Time_Start": 5008.7,
      "Time_End": 5017.7,
      "Text": " Yeah, I think that similarly between the two communities, you know, when security research"
    },
    {
      "Time_Start": 5017.7,
      "Time_End": 5024.7,
      "Text": " starts, when the attention shifts to your industry, it's, you know, everybody gets a"
    },
    {
      "Time_Start": 5024.7,
      "Time_End": 5025.7,
      "Text": " little scared, right?"
    },
    {
      "Time_Start": 5025.7,
      "Time_End": 5031.7,
      "Text": " Like, nobody knows what it is before the collaboration starts between the security research community"
    },
    {
      "Time_Start": 5031.7,
      "Time_End": 5035.7,
      "Text": " and the manufacturers and the policy folks and the implementers."
    },
    {
      "Time_Start": 5035.7,
      "Time_End": 5041.7,
      "Text": " And so, we've come a long way in terms of that education and building those bridges."
    },
    {
      "Time_Start": 5041.7,
      "Time_End": 5045.7,
      "Text": " What I will say is we do want to learn from what works."
    },
    {
      "Time_Start": 5045.7,
      "Time_End": 5052.7,
      "Text": " So, we engaged, NASS immediately engaged, or not immediately, but very quickly when"
    },
    {
      "Time_Start": 5052.7,
      "Time_End": 5058.7,
      "Text": " I started at NASS, and that was their first time bringing on someone with a cyber focus."
    },
    {
      "Time_Start": 5058.7,
      "Time_End": 5064.7,
      "Text": " I engaged with IM Calvary because I knew that they had, you know, we knew their history"
    },
    {
      "Time_Start": 5064.7,
      "Time_End": 5071.7,
      "Text": " with the medical community, and we, Bo Woods is a good friend of mine, and we work very"
    },
    {
      "Time_Start": 5071.7,
      "Time_End": 5072.7,
      "Text": " closely with them."
    },
    {
      "Time_Start": 5072.7,
      "Time_End": 5077.7,
      "Text": " We've brought them in to talk, you know, about success stories, and we have some NASS"
    },
    {
      "Time_Start": 5077.7,
      "Time_End": 5083.7,
      "Text": " folks here whose first stop was the biomedical hacking village to learn how it looks pretty"
    },
    {
      "Time_Start": 5083.7,
      "Time_End": 5085.7,
      "Text": " different from the voting village, so, right?"
    },
    {
      "Time_Start": 5085.7,
      "Time_End": 5090.7,
      "Text": " And so, there's still a ways to go, and obviously the manufacturers play a big role"
    },
    {
      "Time_Start": 5090.7,
      "Time_End": 5093.7,
      "Text": " here, and I don't speak on behalf of the manufacturers."
    },
    {
      "Time_Start": 5093.7,
      "Time_End": 5097.7,
      "Text": " But, there is a lot of work being done with them, too."
    },
    {
      "Time_Start": 5097.7,
      "Time_End": 5103.7,
      "Text": " And so, I think that we are, we've come a long way, but we recognize that there's"
    },
    {
      "Time_Start": 5103.7,
      "Time_End": 5105.7,
      "Text": " still a long way to go."
    },
    {
      "Time_Start": 5105.7,
      "Time_End": 5111.7,
      "Text": " But, to your point, we absolutely want to look at those success models, like the medical"
    },
    {
      "Time_Start": 5111.7,
      "Time_End": 5117.7,
      "Text": " success model, and learn from it, and try to implement what is similar, right?"
    },
    {
      "Time_Start": 5117.7,
      "Time_End": 5121.7,
      "Text": " Because there are some similarities, and there are also some key differences."
    },
    {
      "Time_Start": 5122.7,
      "Time_End": 5126.7,
      "Text": " I think an important difference with medical devices, and you heard Suzanne Schwartz talking"
    },
    {
      "Time_Start": 5126.7,
      "Time_End": 5131.7,
      "Text": " about this earlier, is that they have a specific regulatory authority on cybersecurity."
    },
    {
      "Time_Start": 5131.7,
      "Time_End": 5136.7,
      "Text": " And a lot of, I mean, we don't have that really for just general IoT devices in the"
    },
    {
      "Time_Start": 5136.7,
      "Time_End": 5137.7,
      "Text": " United States."
    },
    {
      "Time_Start": 5137.7,
      "Time_End": 5141.7,
      "Text": " That is changing overseas, and we talked a bit about the Cyber Resilience Act."
    },
    {
      "Time_Start": 5141.7,
      "Time_End": 5147.7,
      "Text": " There are a few other things that are happening in Europe that will, I think, require secure"
    },
    {
      "Time_Start": 5147.7,
      "Time_End": 5153.7,
      "Text": " by design, as well as post-market cybersecurity actions, which I think will potentially lift"
    },
    {
      "Time_Start": 5153.7,
      "Time_End": 5155.7,
      "Text": " all boats outside of Europe."
    },
    {
      "Time_Start": 5155.7,
      "Time_End": 5159.7,
      "Text": " But, that is one key difference."
    },
    {
      "Time_Start": 5159.7,
      "Time_End": 5163.7,
      "Text": " The other, I think another thing to point out is the trust mark that we talked about"
    },
    {
      "Time_Start": 5163.7,
      "Time_End": 5165.7,
      "Text": " earlier, the IoT trust mark."
    },
    {
      "Time_Start": 5165.7,
      "Time_End": 5168.7,
      "Text": " There was movement in and out of the room, so I'm not sure if you were here, but there"
    },
    {
      "Time_Start": 5168.7,
      "Time_End": 5175.7,
      "Text": " is, okay, so this is one way that I think the U.S. government is laudably trying to"
    },
    {
      "Time_Start": 5175.7,
      "Time_End": 5181.7,
      "Text": " extend its coverage to other IoT devices outside of just medical devices to have at"
    },
    {
      "Time_Start": 5181.7,
      "Time_End": 5183.7,
      "Text": " least demonstrate a baseline of security."
    },
    {
      "Time_Start": 5183.7,
      "Time_End": 5186.7,
      "Text": " And then, to some extent, it is going to be up to consumers."
    },
    {
      "Time_Start": 5186.7,
      "Time_End": 5190.7,
      "Text": " It will be up to consumers to vote with their wallets and show that security matters to"
    },
    {
      "Time_Start": 5190.7,
      "Time_End": 5193.7,
      "Text": " them and buy the device that has the trust mark."
    },
    {
      "Time_Start": 5193.7,
      "Time_End": 5202.7,
      "Text": " Yeah, and just to jump on that, too, we know that there are challenges, especially in,"
    },
    {
      "Time_Start": 5202.7,
      "Time_End": 5207.7,
      "Text": " say, OT and those devices, right, as far as backwards compatibility and, of course,"
    },
    {
      "Time_Start": 5207.7,
      "Time_End": 5212.7,
      "Text": " the massive investment, right, that has to last several years."
    },
    {
      "Time_Start": 5212.7,
      "Time_End": 5216.7,
      "Text": " So, but we know that through a lot of engagement with that community."
    },
    {
      "Time_Start": 5216.7,
      "Time_End": 5222.7,
      "Text": " And so, as part of our secure by design work, we are engaging with a lot of different manufacturers,"
    },
    {
      "Time_Start": 5222.7,
      "Time_End": 5226.7,
      "Text": " both on the software and hardware side, because we want to understand that."
    },
    {
      "Time_Start": 5226.7,
      "Time_End": 5231.7,
      "Text": " And, of course, we also want to understand the consumer side of things, too, right, understand"
    },
    {
      "Time_Start": 5231.7,
      "Time_End": 5233.7,
      "Text": " those investments and those needs."
    },
    {
      "Time_Start": 5233.7,
      "Time_End": 5238.7,
      "Text": " So it's, you know, sort of a long journey for this understanding, but that's something"
    },
    {
      "Time_Start": 5238.7,
      "Time_End": 5241.7,
      "Text": " that we are prioritizing."
    },
    {
      "Time_Start": 5241.7,
      "Time_End": 5242.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 5242.7,
      "Time_End": 5243.7,
      "Text": " All right."
    },
    {
      "Time_Start": 5243.7,
      "Time_End": 5246.7,
      "Text": " We had a couple of other folks that wanted to ask questions."
    },
    {
      "Time_Start": 5246.7,
      "Time_End": 5249.7,
      "Text": " Let's go ahead and get two more questions."
    },
    {
      "Time_Start": 5249.7,
      "Time_End": 5250.7,
      "Text": " Hey, there."
    },
    {
      "Time_Start": 5250.7,
      "Time_End": 5253.7,
      "Text": " Thank you, guys, for holding this panel."
    },
    {
      "Time_Start": 5253.7,
      "Time_End": 5257.7,
      "Text": " And I came a little bit late, so I apologize that this was already covered."
    },
    {
      "Time_Start": 5257.7,
      "Time_End": 5259.7,
      "Text": " But I have a question."
    },
    {
      "Time_Start": 5259.7,
      "Time_End": 5265.7,
      "Text": " The medical devices and also the MSPs that you mentioned for election security, are there"
    },
    {
      "Time_Start": 5265.7,
      "Time_End": 5273.7,
      "Text": " plans or current measures in place to kind of, like, if you have an MSP who uses a subcontractor"
    },
    {
      "Time_Start": 5273.7,
      "Time_End": 5277.7,
      "Text": " or another vendor or you have a vendor who uses a vendor who uses a vendor, what kind"
    },
    {
      "Time_Start": 5277.7,
      "Time_End": 5284.7,
      "Text": " of measures are in place to kind of, you know, make sure that the vendor inside the vendor"
    },
    {
      "Time_Start": 5284.7,
      "Time_End": 5288.7,
      "Text": " is compliant or, you know, upholding these regulations?"
    },
    {
      "Time_Start": 5288.7,
      "Time_End": 5293.7,
      "Text": " Because what I would be particularly concerned about is, like, kind of a game of telephone"
    },
    {
      "Time_Start": 5293.7,
      "Time_End": 5295.7,
      "Text": " where the vendor says, yes, we're compliant."
    },
    {
      "Time_Start": 5295.7,
      "Time_End": 5299.7,
      "Text": " The manufacturer just hits that at face value, and there's not really investigation."
    },
    {
      "Time_Start": 5299.7,
      "Time_End": 5306.7,
      "Text": " So can you guys speak to that?"
    },
    {
      "Time_Start": 5306.7,
      "Time_End": 5307.7,
      "Text": " Yeah."
    },
    {
      "Time_Start": 5307.7,
      "Time_End": 5312.7,
      "Text": " So I think one of the things that we're thinking about on the software side is a software liability"
    },
    {
      "Time_Start": 5312.7,
      "Time_End": 5317.7,
      "Text": " model that can help address some of those challenges, the kind of kick the ball, kick"
    },
    {
      "Time_Start": 5317.7,
      "Time_End": 5320.7,
      "Text": " the can, whichever the analogy is."
    },
    {
      "Time_Start": 5320.7,
      "Time_End": 5327.7,
      "Text": " That, we know, is a very challenging topic to address, both from a practical standpoint"
    },
    {
      "Time_Start": 5327.7,
      "Time_End": 5328.7,
      "Text": " as well as from a legal standpoint."
    },
    {
      "Time_Start": 5328.7,
      "Time_End": 5332.7,
      "Text": " And so that's one of the things that's in the National Cybersecurity Strategy and that"
    },
    {
      "Time_Start": 5332.7,
      "Time_End": 5335.7,
      "Text": " we anticipate working on for multiple years."
    },
    {
      "Time_Start": 5335.7,
      "Time_End": 5339.7,
      "Text": " That's not something that's going to be able to be addressed within the next year or so."
    },
    {
      "Time_Start": 5339.7,
      "Time_End": 5345.7,
      "Text": " But the intermediary steps that we're taking to determine what that model should look like"
    },
    {
      "Time_Start": 5345.7,
      "Time_End": 5351.7,
      "Text": " include a lot of engagement with folks who are in this room and in other spaces as well"
    },
    {
      "Time_Start": 5351.7,
      "Time_End": 5357.7,
      "Text": " to understand what are some of the potential downstream effects if we make certain liability"
    },
    {
      "Time_Start": 5357.7,
      "Time_End": 5363.7,
      "Text": " shifts in the market."
    },
    {
      "Time_Start": 5364.7,
      "Time_End": 5369.7,
      "Text": " So just very quickly on the MSP side for state and local government."
    },
    {
      "Time_Start": 5369.7,
      "Time_End": 5375.7,
      "Text": " So there are a lot of state efforts that are happening related to what requirements should"
    },
    {
      "Time_Start": 5375.7,
      "Time_End": 5378.7,
      "Text": " be for MSPs who work with state or local government."
    },
    {
      "Time_Start": 5378.7,
      "Time_End": 5382.7,
      "Text": " I'm not an expert on those by any means."
    },
    {
      "Time_Start": 5382.7,
      "Time_End": 5389.7,
      "Text": " One thing I'll say is the Louisiana Secretary of State's office was very involved in that"
    },
    {
      "Time_Start": 5389.7,
      "Time_End": 5395.7,
      "Text": " legislative process and now in the implementation process for what they did post-2019 ransomware"
    },
    {
      "Time_Start": 5395.7,
      "Time_End": 5398.7,
      "Text": " incidents in the state of Louisiana."
    },
    {
      "Time_Start": 5398.7,
      "Time_End": 5403.7,
      "Text": " The CIO for the Secretary of State's office will be on the panel later today at 5, and"
    },
    {
      "Time_Start": 5403.7,
      "Time_End": 5405.7,
      "Text": " he's going to talk a little bit about that."
    },
    {
      "Time_Start": 5405.7,
      "Time_End": 5410.7,
      "Text": " So in most states, the Secretary of State's office wouldn't necessarily be leading the"
    },
    {
      "Time_Start": 5410.7,
      "Time_End": 5412.7,
      "Text": " way on that."
    },
    {
      "Time_Start": 5413.7,
      "Time_End": 5420.7,
      "Text": " But what I will add on the local government side, I mentioned a lot of local townships,"
    },
    {
      "Time_Start": 5420.7,
      "Time_End": 5429.7,
      "Text": " municipalities, counties work with an MSP, and it's incredibly complex."
    },
    {
      "Time_Start": 5429.7,
      "Time_End": 5438.7,
      "Text": " But one thing on the election side that is being done is lowering the risk that you're"
    },
    {
      "Time_Start": 5439.7,
      "Time_End": 5445.7,
      "Text": " what is that MSP doing, and what actual risk does that have to the elections."
    },
    {
      "Time_Start": 5445.7,
      "Time_End": 5451.7,
      "Text": " Often you're coming down to just like IT operations for the county clerk's office or whatever"
    },
    {
      "Time_Start": 5451.7,
      "Time_End": 5456.7,
      "Text": " it may be, and certainly there's some risk there, but maybe it's to public-facing websites"
    },
    {
      "Time_Start": 5456.7,
      "Time_End": 5457.7,
      "Text": " and things like that."
    },
    {
      "Time_Start": 5457.7,
      "Time_End": 5465.7,
      "Text": " It's not to the, they're putting things in place to isolate the IT systems on which the"
    },
    {
      "Time_Start": 5465.7,
      "Time_End": 5467.7,
      "Text": " election really relies."
    },
    {
      "Time_Start": 5467.7,
      "Time_End": 5473.7,
      "Text": " Absolutely the actual voting systems, the vote casting and tabulation systems, but additionally"
    },
    {
      "Time_Start": 5473.7,
      "Time_End": 5479.7,
      "Text": " the voter registration systems and those other IT systems that really are integral to the"
    },
    {
      "Time_Start": 5479.7,
      "Time_End": 5480.7,
      "Text": " process."
    },
    {
      "Time_Start": 5481.7,
      "Time_End": 5482.7,
      "Text": " Thank you all."
    },
    {
      "Time_Start": 5482.7,
      "Time_End": 5483.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 5483.7,
      "Time_End": 5485.7,
      "Text": " And I think we have time for one more question."
    },
    {
      "Time_Start": 5485.7,
      "Time_End": 5488.7,
      "Text": " Ma'am in the back, I know you've been coming up to the mic."
    },
    {
      "Time_Start": 5488.7,
      "Time_End": 5489.7,
      "Text": " Do you want to do it?"
    },
    {
      "Time_Start": 5490.7,
      "Time_End": 5491.7,
      "Text": " Yeah."
    },
    {
      "Time_Start": 5492.7,
      "Time_End": 5493.7,
      "Text": " Okay."
    },
    {
      "Time_Start": 5493.7,
      "Time_End": 5494.7,
      "Text": " All righty."
    },
    {
      "Time_Start": 5494.7,
      "Time_End": 5495.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 5495.7,
      "Time_End": 5501.7,
      "Text": " So as more regulation gets added, usually the cost of implementation goes up and a lot"
    },
    {
      "Time_Start": 5501.7,
      "Time_End": 5506.7,
      "Text": " of companies either can't afford it, so it pushes a lot of players out of the market."
    },
    {
      "Time_Start": 5506.7,
      "Time_End": 5513.7,
      "Text": " And it stagnates the velocity which products can get released to the market."
    },
    {
      "Time_Start": 5513.7,
      "Time_End": 5519.7,
      "Text": " So I was wondering, and that causes a lot of repetitive work to be done among companies"
    },
    {
      "Time_Start": 5519.7,
      "Time_End": 5522.7,
      "Text": " where everybody needs to have a SOC team, a security team."
    },
    {
      "Time_Start": 5522.7,
      "Time_End": 5527.7,
      "Text": " So I was wondering if there's any initiative for a security framework that would allow"
    },
    {
      "Time_Start": 5527.7,
      "Time_End": 5534.7,
      "Text": " companies to specialize in each one of those aspects and standardize security controls"
    },
    {
      "Time_Start": 5534.7,
      "Time_End": 5538.7,
      "Text": " in a way that it lowers the barrier to entry for companies."
    },
    {
      "Time_Start": 5539.7,
      "Time_End": 5550.7,
      "Text": " I'll take that just to say this idea of baking security in right from the design phase, we"
    },
    {
      "Time_Start": 5550.7,
      "Time_End": 5555.7,
      "Text": " believe in this as part of our principles of Secure by Design is that it needs to be"
    },
    {
      "Time_Start": 5555.7,
      "Time_End": 5557.7,
      "Text": " a business decision."
    },
    {
      "Time_Start": 5557.7,
      "Time_End": 5562.7,
      "Text": " And we know that there are a lot of different methods like well-lit paths, for instance,"
    },
    {
      "Time_Start": 5562.7,
      "Time_End": 5570.7,
      "Text": " to have certain components that are already done and approved and things like that for"
    },
    {
      "Time_Start": 5570.7,
      "Time_End": 5574.7,
      "Text": " use in other parts of the product."
    },
    {
      "Time_Start": 5575.7,
      "Time_End": 5584.7,
      "Text": " But truly, the business leaders, right, CEO and that level are the ones that need to really"
    },
    {
      "Time_Start": 5584.7,
      "Time_End": 5586.7,
      "Text": " push that in their company."
    },
    {
      "Time_Start": 5586.7,
      "Time_End": 5593.7,
      "Text": " Can't just be the security team, right, or the technical officer or the CISO, right,"
    },
    {
      "Time_Start": 5593.7,
      "Time_End": 5596.7,
      "Text": " has to be from the top."
    },
    {
      "Time_Start": 5596.7,
      "Time_End": 5609.7,
      "Text": " And we know that this is going to be a shift because that decision might be relatively"
    },
    {
      "Time_Start": 5609.7,
      "Time_End": 5613.7,
      "Text": " new, somewhat novel, but we think, too, it's very much like quality, right?"
    },
    {
      "Time_Start": 5613.7,
      "Time_End": 5618.7,
      "Text": " And again, we know that that is a business decision that comes from the top as well."
    },
    {
      "Time_Start": 5619.7,
      "Time_End": 5623.7,
      "Text": " Just the one last thing that I'll add to that."
    },
    {
      "Time_Start": 5623.7,
      "Time_End": 5627.7,
      "Text": " The point of regulatory harmonization is to actually streamline things and hopefully reduce"
    },
    {
      "Time_Start": 5627.7,
      "Time_End": 5628.7,
      "Text": " costs."
    },
    {
      "Time_Start": 5628.7,
      "Time_End": 5634.7,
      "Text": " Like that goal is part of the RFI that we've put out on regulatory harmonization so that"
    },
    {
      "Time_Start": 5634.7,
      "Time_End": 5640.7,
      "Text": " we don't have conflicting regulators where you are having to comply with one over here"
    },
    {
      "Time_Start": 5640.7,
      "Time_End": 5644.7,
      "Text": " and then do the exact same process, spend a lot of money, do the exact same thing over"
    },
    {
      "Time_Start": 5644.7,
      "Time_End": 5646.7,
      "Text": " here for a different regulator."
    },
    {
      "Time_Start": 5646.7,
      "Time_End": 5650.7,
      "Text": " And reciprocity is a big part of that, and so hopefully getting to a point where regulators"
    },
    {
      "Time_Start": 5650.7,
      "Time_End": 5655.7,
      "Text": " will accept the results of an assessment on one hand and the other regulator on the other"
    },
    {
      "Time_Start": 5655.7,
      "Time_End": 5657.7,
      "Text": " hand will also be able to accept that."
    },
    {
      "Time_Start": 5657.7,
      "Time_End": 5660.7,
      "Text": " The goal of that is to reduce costs instead of increase them."
    },
    {
      "Time_Start": 5663.7,
      "Time_End": 5665.7,
      "Text": " And with that, let's go ahead and please thank our panelists."
    },
    {
      "Time_Start": 5665.7,
      "Time_End": 5667.7,
      "Text": " I think it's been very informative."
    },
    {
      "Time_Start": 5667.7,
      "Time_End": 5672.7,
      "Text": " And please do also scan the QR code, leave your feedback."
    },
    {
      "Time_Start": 5672.7,
      "Time_End": 5677.7,
      "Text": " I promise it is not a rick roll, but, you know, it's also DEF CON, so you've got to"
    },
    {
      "Time_Start": 5677.7,
      "Time_End": 5680.7,
      "Text": " be a little bit careful with the QR codes you're scanning."
    },
    {
      "Time_Start": 5680.7,
      "Time_End": 5681.7,
      "Text": " Thank you."
    },
    {
      "Time_Start": 5683.7,
      "Time_End": 5684.7,
      "Text": " Thank you."
    }
  ]
}