{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 6.2,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Alright, good afternoon. Um, welcome to Policy at DEF CON. Uh, my name's Will Loomis, uh, and"
    },
    {
      "Time_Start": 6.2,
      "Time_End": 11.94,
      "Text": " I'm a goon here. Uh, this talk is going to be, uh, Cyber Policy Adrift, Chartering a Path"
    },
    {
      "Time_Start": 11.94,
      "Time_End": 16.580000000000002,
      "Text": " Forward for International Maritime Cybersecurity. Um, and we'll have a great panel of four"
    },
    {
      "Time_Start": 16.580000000000002,
      "Time_End": 20.72,
      "Text": " people here. I'll introduce them all in a second. Um, but before I do so, just a couple of"
    },
    {
      "Time_Start": 20.72,
      "Time_End": 25.92,
      "Text": " quick announcements. Um, first of all, this talk was going to be hosted on the record. Um,"
    },
    {
      "Time_Start": 25.92,
      "Time_End": 29.060000000000002,
      "Text": " cell phones, as a courtesy to our speaker and audience, we ask that you check to make sure"
    },
    {
      "Time_Start": 29.060000000000002,
      "Time_End": 34.46,
      "Text": " your cell phones are set to silent, uh, at this time. Um, uh, if the speakers allow questions"
    },
    {
      "Time_Start": 34.46,
      "Time_End": 38.6,
      "Text": " at the end, if we have time, please use the standing mic over there so that everyone can"
    },
    {
      "Time_Start": 38.6,
      "Time_End": 42.440000000000005,
      "Text": " hear you. Make sure to point the mic, uh, towards your face so that everyone can actually"
    },
    {
      "Time_Start": 42.440000000000005,
      "Time_End": 47.040000000000006,
      "Text": " hear you. Uh, as a reminder, the DEF CON photo policy prohibits taking pictures without"
    },
    {
      "Time_Start": 47.040000000000006,
      "Time_End": 51.88,
      "Text": " the explicit permission of everyone in the frame. Uh, so please keep that in mind. Uh, with"
    },
    {
      "Time_Start": 51.88,
      "Time_End": 56.620000000000005,
      "Text": " that, uh, let's get started. I'm gonna welcome our four speakers here. Um, first, uh, our"
    },
    {
      "Time_Start": 56.620000000000005,
      "Time_End": 62.18000000000001,
      "Text": " moderator, Nina Collers, our kitty hegemon here. Um, associate professor at the Cyber and"
    },
    {
      "Time_Start": 62.18000000000001,
      "Time_End": 67.36,
      "Text": " Innovation Policy Institute at the US Naval War College. Uh, and then our three panelists. Uh,"
    },
    {
      "Time_Start": 67.36,
      "Time_End": 72.80000000000001,
      "Text": " we have, uh, Josh Reiter, uh, Deputy PCA at the Department of the Navy. Um, we have Blake"
    },
    {
      "Time_Start": 72.80000000000001,
      "Time_End": 77.7,
      "Text": " Benson, uh, Industrial Control System and Cybersecurity Practice Lead at ABS. And we have"
    },
    {
      "Time_Start": 77.7,
      "Time_End": 82.68,
      "Text": " Cliff Nieve, uh, Director for MAD Maritime at MAD Security. Welcome all and thanks for"
    },
    {
      "Time_Start": 82.68,
      "Time_End": 87.68,
      "Text": " joining us today. Over to Nina. Thanks. Alright. So in true DEF CON fashion, uh, I'm going to"
    },
    {
      "Time_Start": 93.38000000000001,
      "Time_End": 97.72000000000001,
      "Text": " look briefly at my colleagues. Did you have prepared remarks or are we just gonna, okay,"
    },
    {
      "Time_Start": 97.72000000000001,
      "Time_End": 102.12,
      "Text": " good, I'm gonna ask questions. We prepared for this. Alright, so I'll start just by"
    },
    {
      "Time_Start": 102.12,
      "Time_End": 106.4,
      "Text": " introducing myself briefly, um, and then I'll let my colleagues do so as well. But I want to"
    },
    {
      "Time_Start": 106.4,
      "Time_End": 110.26,
      "Text": " talk a little bit about what I thought the, what the, what the logic was about building a"
    },
    {
      "Time_Start": 110.28,
      "Time_End": 115.12,
      "Text": " panel that looked like this or thought about this. And, and the thing that, that I wanted to"
    },
    {
      "Time_Start": 115.12,
      "Time_End": 120.12,
      "Text": " kind of dig underneath, thanks, um, is that despite the fact that the oceans are a shared"
    },
    {
      "Time_Start": 123.86,
      "Time_End": 128.86,
      "Text": " space, both legally and in terms of the resources we use, the entities that are allowed to"
    },
    {
      "Time_Start": 131.3,
      "Time_End": 136.3,
      "Text": " govern or required to operate upon it actually have very different perspectives on what it"
    },
    {
      "Time_Start": 136.92000000000002,
      "Time_End": 142.52,
      "Text": " is they're getting to get up to, what the problem actually is and how we solve it. And so I"
    },
    {
      "Time_Start": 142.52,
      "Time_End": 147.10000000000002,
      "Text": " wanted to make sure that we had a rep who could speak to us about what the Navy sees when"
    },
    {
      "Time_Start": 147.10000000000002,
      "Time_End": 151.56,
      "Text": " they see the maritime industry and cyber security, what the private sector sees when they"
    },
    {
      "Time_Start": 151.56,
      "Time_End": 155.94,
      "Text": " think about this question, what the Coast Guard thinks. So I wanted to make sure we got that"
    },
    {
      "Time_Start": 155.94,
      "Time_End": 160.14000000000001,
      "Text": " on the table. So if that doesn't come out by the end of the talk, by the end of our talking to"
    },
    {
      "Time_Start": 160.14000000000001,
      "Time_End": 165.82000000000002,
      "Text": " each other, please press us a little bit on that. Uh, I am recently out of the office of the"
    },
    {
      "Time_Start": 165.84,
      "Time_End": 170.23999999999998,
      "Text": " Undersecretary of Defense for Research and Engineering, which is inside the Pentagon. And I"
    },
    {
      "Time_Start": 170.23999999999998,
      "Time_End": 175.22,
      "Text": " have just returned back to the U.S. Naval War College where we'll work on things like defense"
    },
    {
      "Time_Start": 175.22,
      "Time_End": 180.92,
      "Text": " critical infrastructure, but also thinking about how we go from everyday operations, you"
    },
    {
      "Time_Start": 180.92,
      "Time_End": 186.45999999999998,
      "Text": " know, sort of cargo shipping to, uh, little leisure cruises all the way up to high end"
    },
    {
      "Time_Start": 186.45999999999998,
      "Time_End": 191.76,
      "Text": " conflict where the Navy is thinking about sort of warheads on foreheads and that kind of"
    },
    {
      "Time_Start": 191.78,
      "Time_End": 197.34,
      "Text": " question. Right? So that's all fair game here. Um, so if I'm going to step back for a second and"
    },
    {
      "Time_Start": 197.34,
      "Time_End": 203.28,
      "Text": " let my colleagues introduce themselves. Sure. Uh, my name's Cliff Neve. Um, I'm with MAD"
    },
    {
      "Time_Start": 203.28,
      "Time_End": 209.35999999999999,
      "Text": " Security. I'm a retired Coast Guard officer. Uh, my last, uh, duty assignment was as"
    },
    {
      "Time_Start": 209.35999999999999,
      "Time_End": 213.32,
      "Text": " Deputy Commander at Coast Guard Cyber Command. And I was kind of like there when it"
    },
    {
      "Time_Start": 213.32,
      "Time_End": 219.06,
      "Text": " happened as far as the Coast Guard, um, standing up, uh, cyber security and starting to"
    },
    {
      "Time_Start": 219.06,
      "Time_End": 225.1,
      "Text": " implement cyber security into the maritime, uh, Transportation Security Act type of"
    },
    {
      "Time_Start": 225.1,
      "Time_End": 230.1,
      "Text": " elements. And, uh, that, that's my background. Sure. Yeah, Blake Benson. Um, first things"
    },
    {
      "Time_Start": 233.18,
      "Time_End": 239.18,
      "Text": " first. I mean, I'm a washed up cyber operator, um, by trade. I was doing Title 10 OCO and"
    },
    {
      "Time_Start": 239.18,
      "Time_End": 244.02,
      "Text": " DCO at the Air Force and was specializing in kind of non-traditional vulnerability"
    },
    {
      "Time_Start": 244.02,
      "Time_End": 250.02,
      "Text": " assessments of, uh, combat weapon systems, which included airframes at the time. And, um,"
    },
    {
      "Time_Start": 250.02,
      "Time_End": 255.86,
      "Text": " started in OT cyber risk practice. And I guess it's been about four years ago, um, with the"
    },
    {
      "Time_Start": 255.86,
      "Time_End": 260.90000000000003,
      "Text": " American Bureau of Shipping. And so kind of was grandfathered into the, uh, maritime"
    },
    {
      "Time_Start": 260.90000000000003,
      "Time_End": 266.48,
      "Text": " industry. But it turns out, um, ships are just kind of really slow planes, uh, in a lot of"
    },
    {
      "Time_Start": 266.48,
      "Time_End": 271.48,
      "Text": " ways. So it translated pretty well. And, um, and now we, we support various, we support the"
    },
    {
      "Time_Start": 271.62,
      "Time_End": 276.62,
      "Text": " Coast Guard, we support Navy, uh, non-combatant ships. We've got a tremendous amount of, of,"
    },
    {
      "Time_Start": 279.12,
      "Time_End": 284.02000000000004,
      "Text": " um, like OT specific, industrial control system specific risk assessment work that we've"
    },
    {
      "Time_Start": 284.02000000000004,
      "Time_End": 289.02000000000004,
      "Text": " done on, uh, floating platforms out there. So. Thank you. Josh? Hi, I'm Josh Ryder. I'm the, uh,"
    },
    {
      "Time_Start": 291.8,
      "Time_End": 297.0,
      "Text": " Deputy Principal Cyber Advisor, uh, on the Secretary of the Navy staff. Uh, I'm a former"
    },
    {
      "Time_Start": 297.02,
      "Time_End": 301.66,
      "Text": " merchant marine officer, spent about five and a half years at sea. I was the IT manager for the"
    },
    {
      "Time_Start": 301.66,
      "Time_End": 307.74,
      "Text": " Port of Austin for three years. So I know the, the waterfront and the shipboard side. Uh, and"
    },
    {
      "Time_Start": 307.74,
      "Time_End": 312.8,
      "Text": " then I spent, uh, way too long at the Office of Naval Intelligence, about 17 years, looking"
    },
    {
      "Time_Start": 312.8,
      "Time_End": 320.82,
      "Text": " mostly at civil maritime issues. Um, and now I also work at the, the Pentagon, uh, again as the"
    },
    {
      "Time_Start": 320.82,
      "Time_End": 325.92,
      "Text": " Deputy Principal Cyber Advisor. Excellent. All right. So thank all three of you in advance"
    },
    {
      "Time_Start": 325.94,
      "Time_End": 330.78000000000003,
      "Text": " and I'm at, I apologize. I'm still sort of on shift as a goon. And then when I, when I leave"
    },
    {
      "Time_Start": 330.78000000000003,
      "Time_End": 335.58000000000004,
      "Text": " today, I'll, I'll come off shift. So I'm still wearing my goon wear. Um, but I'm sure you'll"
    },
    {
      "Time_Start": 335.58000000000004,
      "Time_End": 342.0,
      "Text": " forgive me. So let's start with just a top line question. Um, and so as you start to answer,"
    },
    {
      "Time_Start": 342.0,
      "Time_End": 346.76,
      "Text": " whoever answers first gets to be the original one. What I'm going to ask each of you to do is"
    },
    {
      "Time_Start": 346.76,
      "Time_End": 351.90000000000003,
      "Text": " not say the same thing that anybody else has said already. And so I'm going to start here,"
    },
    {
      "Time_Start": 351.92,
      "Time_End": 361.92,
      "Text": " which is, why should we care about the fact that we are still building policy? Why do we care"
    },
    {
      "Time_Start": 361.92,
      "Time_End": 367.66,
      "Text": " about this for the maritime domain, if you're speaking DOD? So first one to answer, why"
    },
    {
      "Time_Start": 367.66,
      "Time_End": 373.90000000000003,
      "Text": " should we care? And then we'll go from there. Just in time delivery. It's one of our greatest"
    },
    {
      "Time_Start": 373.90000000000003,
      "Time_End": 379.58000000000004,
      "Text": " strengths and it's one of our greatest vulnerabilities. Uh, you've all undoubtedly been"
    },
    {
      "Time_Start": 379.58,
      "Time_End": 386.26,
      "Text": " affected by strikes in the port of LA Long Beach. Uh, prices going up, goods not available,"
    },
    {
      "Time_Start": 386.26,
      "Time_End": 392.5,
      "Text": " and those are all just routine, non-attack disruptions within the maritime industry. Now"
    },
    {
      "Time_Start": 392.5,
      "Time_End": 396.29999999999995,
      "Text": " imagine something in the maritime industry on the order of a colonial pipeline where things"
    },
    {
      "Time_Start": 396.29999999999995,
      "Time_End": 403.18,
      "Text": " are shut down deliberately, uh, where we lack resilience to get them back online quickly and"
    },
    {
      "Time_Start": 403.18,
      "Time_End": 408.68,
      "Text": " container ships pile up outside of ports, can't offload, goods are not delivered, food doesn't"
    },
    {
      "Time_Start": 408.68,
      "Time_End": 413.72,
      "Text": " get where it needs to be, goods don't get where it needs to be, and uh, the economic might of"
    },
    {
      "Time_Start": 413.72,
      "Time_End": 418.72,
      "Text": " the United States is at risk. Why should we care? Sure. Well, you may have heard the term, you"
    },
    {
      "Time_Start": 423.26,
      "Time_End": 429.76,
      "Text": " can't regulate, you can't regulate to security, but you can regulate to compliance. And one"
    },
    {
      "Time_Start": 429.76,
      "Time_End": 434.88,
      "Text": " of the most interesting things about maritime is, especially when you look at the port"
    },
    {
      "Time_Start": 434.88,
      "Time_End": 440.68,
      "Text": " environment, and ships are one thing, and we'll talk quite a bit about the policies and"
    },
    {
      "Time_Start": 440.68,
      "Time_End": 445.82,
      "Text": " various kind of governing bodies that regulate ships, and really they don't regulate at all."
    },
    {
      "Time_Start": 445.82,
      "Time_End": 452.32,
      "Text": " Um, they provide recommendations in a lot of cases like IMO, um, for example. It's not a legal"
    },
    {
      "Time_Start": 452.32,
      "Time_End": 458.1,
      "Text": " requirement, but it becomes a pseudo requirement because you can't get insured, um, without"
    },
    {
      "Time_Start": 458.1,
      "Time_End": 461.94,
      "Text": " that, without that policy in place. And so that's a little bit different than like a, a"
    },
    {
      "Time_Start": 461.96,
      "Time_End": 468.04,
      "Text": " federal regulator that says you have to do this. They make recommendations, and then um,"
    },
    {
      "Time_Start": 468.04,
      "Time_End": 473.88,
      "Text": " people adopt it, but in the, in the port infrastructure space, the amount of stakeholders"
    },
    {
      "Time_Start": 473.88,
      "Time_End": 480.88,
      "Text": " that are at any given port is so disparate. I mean there is a, you could have a, a, an oil and"
    },
    {
      "Time_Start": 480.88,
      "Time_End": 486.18,
      "Text": " gas refinery there, you could have a food and Bev, uh, like chemical additives, uh, critical"
    },
    {
      "Time_Start": 486.18,
      "Time_End": 489.96,
      "Text": " infrastructure there, and what applies to them is very different from a regulatory"
    },
    {
      "Time_Start": 489.98,
      "Time_End": 494.42,
      "Text": " perspective, and that's where the Coast Guard comes into play, that's where DHS, uh, chemical"
    },
    {
      "Time_Start": 494.42,
      "Time_End": 501.42,
      "Text": " facility anti-terrorism standards come into play, and so, um, we need to have more, I guess,"
    },
    {
      "Time_Start": 501.42,
      "Time_End": 507.16,
      "Text": " kind of consolidated policy, but uh, consistent policy in how we approach this, and with the"
    },
    {
      "Time_Start": 507.16,
      "Time_End": 511.94000000000005,
      "Text": " amount of federal stakeholders that are providing, um, regulatory guidance in this space, we"
    },
    {
      "Time_Start": 511.94000000000005,
      "Time_End": 515.88,
      "Text": " need to be aligned in what it is that, that we're telling stakeholders to do, because they"
    },
    {
      "Time_Start": 515.9,
      "Time_End": 521.7,
      "Text": " share a common environment, and that's the really unique part about Maritime. So public and"
    },
    {
      "Time_Start": 521.7,
      "Time_End": 526.0,
      "Text": " private partnerships is kind of an interesting dance in that, um, the United States, you know,"
    },
    {
      "Time_Start": 526.0,
      "Time_End": 531.24,
      "Text": " our government is responsible for making sure that our critical infrastructure is secure, and"
    },
    {
      "Time_Start": 531.24,
      "Time_End": 536.38,
      "Text": " typically it's private government, private elements that are, that are doing that, and so,"
    },
    {
      "Time_Start": 536.38,
      "Time_End": 540.48,
      "Text": " one of the, the big things from the Coast Guard perspective was when 9-11 happened, the"
    },
    {
      "Time_Start": 540.48,
      "Time_End": 546.1,
      "Text": " Maritime Transportation Security Act of 2002 was established, and that basically defined"
    },
    {
      "Time_Start": 546.1,
      "Time_End": 552.2,
      "Text": " that, um, certain critical infrastructure ports and facilities, offshore, uh, rigs in some"
    },
    {
      "Time_Start": 552.2,
      "Time_End": 558.84,
      "Text": " cases, uh, had to be, uh, secure for the US interest, and so the Coast Guard worked with"
    },
    {
      "Time_Start": 558.84,
      "Time_End": 563.08,
      "Text": " public, you know, with the private sector to try to make sure that those physical security"
    },
    {
      "Time_Start": 563.08,
      "Time_End": 569.1800000000001,
      "Text": " controls were met, and words matter, and we'll talk about that in policy, I'm sure, a lot, and,"
    },
    {
      "Time_Start": 569.22,
      "Time_End": 575.72,
      "Text": " um, the word cyber was not in the Maritime Transportation Security Act of 2002, which caused"
    },
    {
      "Time_Start": 575.72,
      "Time_End": 580.36,
      "Text": " me an endless amount of problems as an active duty Coast Guard officer trying to get cyber"
    },
    {
      "Time_Start": 580.36,
      "Time_End": 585.36,
      "Text": " security, uh, taken, taken more seriously, um, uh, across the board, but, um, so in 2000, 2020, on"
    },
    {
      "Time_Start": 589.6400000000001,
      "Time_End": 595.08,
      "Text": " my birthday, ironically, um, the Coast Guard did publish an AVIC that said, yes, cyber"
    },
    {
      "Time_Start": 595.12,
      "Time_End": 600.26,
      "Text": " security is included in the Maritime Transportation Security Act of 2002, that was only 21"
    },
    {
      "Time_Start": 600.26,
      "Time_End": 605.96,
      "Text": " years later, or only 18 years later for those counting, um, but as a result, you know,"
    },
    {
      "Time_Start": 605.96,
      "Time_End": 612.6600000000001,
      "Text": " policies are important, and words do matter, and, uh, one of the things that, that struck me"
    },
    {
      "Time_Start": 612.6600000000001,
      "Time_End": 616.34,
      "Text": " as I was kinda preparing for this is that, you know, when you're working with policy, things"
    },
    {
      "Time_Start": 616.34,
      "Time_End": 623.0400000000001,
      "Text": " take a long time, and policies take seemingly forever to get through, and perfection is the"
    },
    {
      "Time_Start": 623.04,
      "Time_End": 628.04,
      "Text": " enemy of good enough, but you have to be good enough, and so we have to make sure from a"
    },
    {
      "Time_Start": 630.2199999999999,
      "Time_End": 636.5799999999999,
      "Text": " policy perspective that we're moving forward, uh, in a way that's going to be helpful to the"
    },
    {
      "Time_Start": 636.5799999999999,
      "Time_End": 640.88,
      "Text": " private sector, and help preserve our way of life and the way things go from a critical"
    },
    {
      "Time_Start": 640.88,
      "Time_End": 645.26,
      "Text": " infrastructure perspective, but we also have to make sure that the policies that we develop"
    },
    {
      "Time_Start": 645.26,
      "Time_End": 650.26,
      "Text": " are, uh, holistic, are achievable, and, uh, and are good enough, and are gonna, gonna stand"
    },
    {
      "Time_Start": 650.26,
      "Time_End": 655.26,
      "Text": " the test of time. Alright, so I have a question, so, so we're talking, we're talking in"
    },
    {
      "Time_Start": 663.7,
      "Time_End": 667.56,
      "Text": " somewhat in the abstract, right, so we're talking about some, some fuzzy idea of governance,"
    },
    {
      "Time_Start": 667.56,
      "Time_End": 671.68,
      "Text": " and some fuzzy idea of who's responsible, and meeting standards and compliance, and that's"
    },
    {
      "Time_Start": 671.68,
      "Time_End": 676.68,
      "Text": " great, um, but I'm curious, for each one of you, what is the, what is it that keeps, what's"
    },
    {
      "Time_Start": 677.4000000000001,
      "Time_End": 682.4000000000001,
      "Text": " the scenario keeps you up at night? What, what, when you go to bed, you're like, oh man, I"
    },
    {
      "Time_Start": 686.6800000000001,
      "Time_End": 691.4200000000001,
      "Text": " really hope this particular alignment, he's already, this particular alignment doesn't go"
    },
    {
      "Time_Start": 691.4200000000001,
      "Time_End": 695.72,
      "Text": " down, right, like what is it, what is it that keeps you up, and, and, you know, speak from"
    },
    {
      "Time_Start": 695.72,
      "Time_End": 700.5200000000001,
      "Text": " your, from your, from your positional perspective, but also just kind of what keeps you up at"
    },
    {
      "Time_Start": 700.5200000000001,
      "Time_End": 705.5600000000001,
      "Text": " night, what, what scares you about this space that's not, not well regulated? We have not"
    },
    {
      "Time_Start": 705.58,
      "Time_End": 712.3800000000001,
      "Text": " done the hard work, um, from the industry side, or the federal side, to decompose the"
    },
    {
      "Time_Start": 712.3800000000001,
      "Time_End": 718.1600000000001,
      "Text": " functions and systems that support the most critical pieces of our infrastructure"
    },
    {
      "Time_Start": 718.1600000000001,
      "Time_End": 724.3000000000001,
      "Text": " country-wide. Ports are a huge emphasis of that, 90, was it 90% of consumer goods go"
    },
    {
      "Time_Start": 724.3000000000001,
      "Time_End": 730.1400000000001,
      "Text": " through the shipping industry, so, um, you know, the Coast Guard has done great modeling on"
    },
    {
      "Time_Start": 730.1400000000001,
      "Time_End": 735.34,
      "Text": " the secondary, if you want to talk like risk as a, as a framework, um, you know, they've"
    },
    {
      "Time_Start": 735.36,
      "Time_End": 740.0600000000001,
      "Text": " done a tremendous amount of work on determining what the secondary and tertiary economic"
    },
    {
      "Time_Start": 740.0600000000001,
      "Time_End": 744.64,
      "Text": " impacts of a cyber incident might be at any given port, um, because that's similar to the"
    },
    {
      "Time_Start": 744.64,
      "Time_End": 750.7800000000001,
      "Text": " same anti-terrorism models that they've been building since 2005, um, which is a really, I"
    },
    {
      "Time_Start": 750.7800000000001,
      "Time_End": 756.88,
      "Text": " think, distinct thing we, we should hone in on, um, that those models, although they were"
    },
    {
      "Time_Start": 756.88,
      "Time_End": 761.6600000000001,
      "Text": " built for anti-terrorism, still capture consequence pretty well in the port environment, and"
    },
    {
      "Time_Start": 761.68,
      "Time_End": 767.5799999999999,
      "Text": " so, you know, you might say, well, we know, Blake, or, you know, anybody at this panel, you, you"
    },
    {
      "Time_Start": 767.5799999999999,
      "Time_End": 771.02,
      "Text": " just said there's models that are built that show us what our biggest consequence is, the"
    },
    {
      "Time_Start": 771.02,
      "Time_End": 776.6,
      "Text": " scenario that keeps us up at night, but the issue is, there's no context for the functions"
    },
    {
      "Time_Start": 776.6,
      "Time_End": 781.6,
      "Text": " that, that support those ports, and so, um, supply chain on, um, cranes that were, uh,"
    },
    {
      "Time_Start": 784.5,
      "Time_End": 791.54,
      "Text": " developed and shipped over and are now in Newport and some other places that, um, had"
    },
    {
      "Time_Start": 791.56,
      "Time_End": 797.9,
      "Text": " intentional backdoors and on, uh, cranes that have, uh, open DDE, uh, vulnerabilities"
    },
    {
      "Time_Start": 797.9,
      "Time_End": 804.0,
      "Text": " because the control system on the gantry cranes are built by, uh, basically buttons tied to"
    },
    {
      "Time_Start": 804.0,
      "Time_End": 809.4399999999999,
      "Text": " ex- open Excel, which is kind of interesting. Um, there's things like that, and so my worst"
    },
    {
      "Time_Start": 809.4399999999999,
      "Time_End": 815.74,
      "Text": " case scenario is we didn't do the, what keeps me up at night is, um, as ports continue,"
    },
    {
      "Time_Start": 815.76,
      "Time_End": 821.76,
      "Text": " continually kind of become more integrated and more digitized, uh, we haven't isolated the"
    },
    {
      "Time_Start": 821.76,
      "Time_End": 826.7,
      "Text": " functions that really make them tick. Like, we haven't figured out what's really important in"
    },
    {
      "Time_Start": 826.7,
      "Time_End": 831.1800000000001,
      "Text": " the, in the port environment from a digital perspective to isolate, in the military we"
    },
    {
      "Time_Start": 831.1800000000001,
      "Time_End": 834.88,
      "Text": " called it cyber key terrain, but we haven't defined the cyber key terrain in these port"
    },
    {
      "Time_Start": 834.88,
      "Time_End": 839.38,
      "Text": " environments to a, to a point where, um, our government stakeholders or even industry"
    },
    {
      "Time_Start": 839.38,
      "Time_End": 844.52,
      "Text": " stakeholders understand where they fit in the system, and so, there are scenarios, I'm sure"
    },
    {
      "Time_Start": 844.54,
      "Time_End": 849.6,
      "Text": " that they exist, and, um, you know, we've done great research on them, maybe, maybe we're"
    },
    {
      "Time_Start": 849.6,
      "Time_End": 854.84,
      "Text": " college researchers, everybody does research on it, but I'm sure there's a scenario where"
    },
    {
      "Time_Start": 854.84,
      "Time_End": 861.42,
      "Text": " something so benign, like a, like a terminal operating system, for example, um, or when we"
    },
    {
      "Time_Start": 861.42,
      "Time_End": 867.46,
      "Text": " move to port electrification, for example, a battery storage site, um, is going to have a"
    },
    {
      "Time_Start": 867.46,
      "Time_End": 872.56,
      "Text": " vulnerability that shuts a port down for a week, uh, that no one captured anywhere, it wasn't"
    },
    {
      "Time_Start": 872.6,
      "Time_End": 878.44,
      "Text": " in a risk model anywhere, and so, defining what those functions are, and kind of what's"
    },
    {
      "Time_Start": 878.44,
      "Time_End": 883.48,
      "Text": " critical in a port environment is the first step to figuring that out, and we just haven't,"
    },
    {
      "Time_Start": 883.48,
      "Time_End": 888.48,
      "Text": " there's not been a whole lot of joint work done on that subject, for various reasons."
    },
    {
      "Time_Start": 893.6600000000001,
      "Time_End": 898.2,
      "Text": " Uh, what keeps me up at night, and, and what concerns me the most is, I think a lack of"
    },
    {
      "Time_Start": 898.2,
      "Time_End": 903.6400000000001,
      "Text": " leadership, and a lack of leadership understanding of, of cyber security risk, and-"
    },
    {
      "Time_Start": 903.6400000000001,
      "Time_End": 906.98,
      "Text": " We are on the record, and I just wanted to put that out there."
    },
    {
      "Time_Start": 906.98,
      "Time_End": 911.5200000000001,
      "Text": " Yeah, yeah, no, no, no, so, so, no, no, and I'm not saying lack of leadership from, from any,"
    },
    {
      "Time_Start": 911.5200000000001,
      "Time_End": 916.12,
      "Text": " from any one thing, but, no, no, from, from what I've seen, so I've been to lots and lots and"
    },
    {
      "Time_Start": 916.12,
      "Time_End": 921.32,
      "Text": " lots of ports, um, and we, we've worked with a lot of organizations, and so what we see is"
    },
    {
      "Time_Start": 921.32,
      "Time_End": 927.6,
      "Text": " when I say lack of leadership, it's the fact that at the CEO level, at the C level, nobody,"
    },
    {
      "Time_Start": 928.26,
      "Time_End": 934.1,
      "Text": " uh, integrates cyber risk in their overall business plans. I teach a class at the University of"
    },
    {
      "Time_Start": 934.1,
      "Time_End": 939.1800000000001,
      "Text": " New Haven at the graduate level called Cyber Risk, Cyber Risk Management, and the very first"
    },
    {
      "Time_Start": 939.1800000000001,
      "Time_End": 944.1800000000001,
      "Text": " question on the very first quiz of my semester is, true or false, cyber security risk should"
    },
    {
      "Time_Start": 946.72,
      "Time_End": 953.6600000000001,
      "Text": " be separate from all other risks because it's so specialized. False. And it's a 100 point"
    },
    {
      "Time_Start": 953.66,
      "Time_End": 960.0,
      "Text": " quiz, and that's the only question on that quiz. Because, because so frequently you go to"
    },
    {
      "Time_Start": 960.0,
      "Time_End": 966.04,
      "Text": " these places and you see ports with, you know, physical security is just, they've got tons of"
    },
    {
      "Time_Start": 966.04,
      "Time_End": 970.78,
      "Text": " police cars, you know, one east coast port has, you know, all these police cars and a gate,"
    },
    {
      "Time_Start": 970.78,
      "Time_End": 975.4399999999999,
      "Text": " somebody escorted us to the, to the facility, they had a badge thing, they had everything else,"
    },
    {
      "Time_Start": 975.4399999999999,
      "Time_End": 979.88,
      "Text": " and then the CIO says, yeah, I can't get money for a sock, I can't get money to, to monitor"
    },
    {
      "Time_Start": 979.88,
      "Time_End": 985.4399999999999,
      "Text": " our network. And, and it's like this, what is wrong here? From like a leadership perspective,"
    },
    {
      "Time_Start": 985.4399999999999,
      "Time_End": 990.22,
      "Text": " what's, what's going on? And Gary Kessler just at the, at the last meeting, you know, he, he"
    },
    {
      "Time_Start": 990.22,
      "Time_End": 993.42,
      "Text": " brought up a really interesting point, he said, the answer to solving the cyber security problem"
    },
    {
      "Time_Start": 993.42,
      "Time_End": 998.42,
      "Text": " is to take computer scientists out of it. And, and because frequently, um, they're not able to"
    },
    {
      "Time_Start": 1000.86,
      "Time_End": 1005.86,
      "Text": " articulate the risk. And it's, it's a business and a, um, a mission area that the C level"
    },
    {
      "Time_Start": 1006.32,
      "Time_End": 1011.32,
      "Text": " personnel abdicate almost entirely throughout the board to their IT guy or gal. And the IT guy or"
    },
    {
      "Time_Start": 1018.36,
      "Time_End": 1022.8000000000001,
      "Text": " gal doesn't always understand the mission risk, isn't able to articulate it, and if the C"
    },
    {
      "Time_Start": 1022.8000000000001,
      "Time_End": 1027.28,
      "Text": " level folks aren't paying attention to it, it's not gonna get the attention it deserves. And,"
    },
    {
      "Time_Start": 1027.28,
      "Time_End": 1032.78,
      "Text": " um, you know, even governmental organizations very frequently, the, the component leads, are"
    },
    {
      "Time_Start": 1032.8,
      "Time_End": 1037.8,
      "Text": " like, well, talk to my CIO, talk to my, you know, no, this is a, this is a mission area, just"
    },
    {
      "Time_Start": 1040.5,
      "Time_End": 1045.52,
      "Text": " like any other risk. And so I think that it's, it's, there's a problem with visibility at the"
    },
    {
      "Time_Start": 1045.52,
      "Time_End": 1050.52,
      "Text": " leadership level, and, and, and, and, and maybe that will change as the digital natives"
    },
    {
      "Time_Start": 1054.82,
      "Time_End": 1059.96,
      "Text": " ascend to these positions, and they understand what an IP address is, because when they"
    },
    {
      "Time_Start": 1059.98,
      "Time_End": 1064.18,
      "Text": " grew up, they actually had a computer, as opposed to a lot of those component commanders don't"
    },
    {
      "Time_Start": 1064.18,
      "Time_End": 1069.02,
      "Text": " have, have, you know, were introduced to that later in life. So I'm hopeful that, that, that, that"
    },
    {
      "Time_Start": 1069.02,
      "Time_End": 1073.3600000000001,
      "Text": " some of that's gonna change. Alright, so we're gonna go to Josh now and see if he wants to lose"
    },
    {
      "Time_Start": 1073.3600000000001,
      "Time_End": 1078.3600000000001,
      "Text": " his job. Go ahead. I am less than three years from retirement, so. Go on, go on. But, uh, but"
    },
    {
      "Time_Start": 1081.3,
      "Time_End": 1087.28,
      "Text": " I'm gonna actually amplify, uh, two of your points. Um, the first is, when we talk about"
    },
    {
      "Time_Start": 1087.3,
      "Time_End": 1093.0,
      "Text": " policy, right, to, so this is a, uh, this is not a strategy forum, this is a policy forum, but"
    },
    {
      "Time_Start": 1093.0,
      "Time_End": 1098.0,
      "Text": " policy is the bridge between strategy and execution. And if for no other reason than I would"
    },
    {
      "Time_Start": 1099.74,
      "Time_End": 1103.8799999999999,
      "Text": " like to keep my job, I'm not gonna highlight a lack of leadership, I'm gonna highlight a lack of"
    },
    {
      "Time_Start": 1103.8799999999999,
      "Time_End": 1110.08,
      "Text": " coherent strategy, right? So in order to get to execution, you have to have a policy that"
    },
    {
      "Time_Start": 1110.08,
      "Time_End": 1115.82,
      "Text": " determines what that execution's gonna look like, and you have to know why you're doing what"
    },
    {
      "Time_Start": 1115.86,
      "Time_End": 1120.86,
      "Text": " you're doing and what you're, and, and how. And we're lacking really coherent strategy. There"
    },
    {
      "Time_Start": 1123.0,
      "Time_End": 1127.54,
      "Text": " was a Maritime Cybersecurity Act under the, the previous administration, it was like ten"
    },
    {
      "Time_Start": 1127.54,
      "Time_End": 1133.48,
      "Text": " pages, you know, it, it, you know, so, so it's not that there is no strategy, it's just clearly"
    },
    {
      "Time_Start": 1133.48,
      "Time_End": 1139.62,
      "Text": " not getting us enough where we need to be. And the other part that, um, that you touched on"
    },
    {
      "Time_Start": 1139.62,
      "Time_End": 1143.9199999999998,
      "Text": " and I'm not even sure you, you realize you touched on it is the liveware, right? We talk about"
    },
    {
      "Time_Start": 1143.92,
      "Time_End": 1148.16,
      "Text": " hardware, we talk about software, we talk about critical infrastructure, what we don't spend a"
    },
    {
      "Time_Start": 1148.16,
      "Time_End": 1152.1000000000001,
      "Text": " lot of time talking about, although we are now on the DOD side and the, and the National"
    },
    {
      "Time_Start": 1152.1000000000001,
      "Time_End": 1157.1000000000001,
      "Text": " Cyber Director, uh, is, is the people. And, um, the fact that there are technical people, your,"
    },
    {
      "Time_Start": 1161.0,
      "Time_End": 1167.38,
      "Text": " your CIOs and your CSIMs in the ports is great because a lot of cybersecurity jobs are just"
    },
    {
      "Time_Start": 1167.38,
      "Time_End": 1172.42,
      "Text": " completely vacant, so it's not even a matter of having people who understand, it's a matter of"
    },
    {
      "Time_Start": 1172.42,
      "Time_End": 1178.5600000000002,
      "Text": " having people at all. And I'm concerned, you know, what keeps me up at night is that we're not"
    },
    {
      "Time_Start": 1178.5600000000002,
      "Time_End": 1184.16,
      "Text": " creating the workforce of the future, right? We're still, we're still generating the workforce"
    },
    {
      "Time_Start": 1184.16,
      "Time_End": 1189.9,
      "Text": " of the past for the jobs of the future. I feel like Tyson, Tyson Meadows is in the audience, I"
    },
    {
      "Time_Start": 1189.9,
      "Time_End": 1193.38,
      "Text": " think he's, he's spoken about this a few times. Did you want to go ahead and, and? Well, I, I"
    },
    {
      "Time_Start": 1193.38,
      "Time_End": 1198.98,
      "Text": " wanted to clarify that when I said lack of leadership, I didn't mean of, of, of, of, of, of, of"
    },
    {
      "Time_Start": 1199.58,
      "Time_End": 1205.72,
      "Text": " any, of, of any, I mean lack of leadership, lack of leadership in organizations in general."
    },
    {
      "Time_Start": 1205.72,
      "Time_End": 1211.72,
      "Text": " Lack of, yeah, lack of, you know, lack of the CEO being responsible, so just wanted to clarify"
    },
    {
      "Time_Start": 1211.72,
      "Time_End": 1217.6,
      "Text": " that. So, I, so I'm gonna, I'm gonna, I'm, I'm gonna exercise the, the moderator's prerogative"
    },
    {
      "Time_Start": 1217.6,
      "Time_End": 1222.44,
      "Text": " and, and monologue a little bit as well because I watch this space all the time and my job, by"
    },
    {
      "Time_Start": 1222.44,
      "Time_End": 1227.14,
      "Text": " the way, is not to sort of think about specific policies at a federal level. The kind of"
    },
    {
      "Time_Start": 1227.14,
      "Time_End": 1231.18,
      "Text": " research we do at the War College is we look at, you know, sort of how do you, how do you put a"
    },
    {
      "Time_Start": 1231.18,
      "Time_End": 1236.44,
      "Text": " bunch of, a bunch of folks onto a, a tin ship that's loaded with computers and then send them"
    },
    {
      "Time_Start": 1236.44,
      "Time_End": 1241.74,
      "Text": " into the line of fire and like, you know, hope it all works out. And so the thing that, the thing"
    },
    {
      "Time_Start": 1241.74,
      "Time_End": 1245.6200000000001,
      "Text": " that's been hard for me to wrap my head around, and I think that, I think that everything"
    },
    {
      "Time_Start": 1245.6200000000001,
      "Time_End": 1251.26,
      "Text": " everyone said gets at it, the thing, this leadership and being able to articulate the problem is"
    },
    {
      "Time_Start": 1251.28,
      "Time_End": 1257.8799999999999,
      "Text": " huge. So if, if you haven't been paying attention, the United States has been in a period of, in"
    },
    {
      "Time_Start": 1257.8799999999999,
      "Time_End": 1262.8799999999999,
      "Text": " theory, right, not actual active maritime combat for, hmm, 70 years or so. And so, so active"
    },
    {
      "Time_Start": 1268.12,
      "Time_End": 1273.0,
      "Text": " maritime combat is a certain kind of skill and so we haven't been doing it and in the"
    },
    {
      "Time_Start": 1273.0,
      "Time_End": 1278.8,
      "Text": " meantime we went into a period of peace, the end of the Cold War, and we privatized"
    },
    {
      "Time_Start": 1278.8,
      "Time_End": 1285.54,
      "Text": " everything, everything, right. So all the way down to how, how the Navy gets its stuff, with"
    },
    {
      "Time_Start": 1285.54,
      "Time_End": 1290.56,
      "Text": " very few exceptions, important exceptions, but very few exceptions. The Navy is reliant upon"
    },
    {
      "Time_Start": 1293.28,
      "Time_End": 1298.3,
      "Text": " the private sector to deliver its stuff and it's by the sea. So can you imagine what that might"
    },
    {
      "Time_Start": 1301.56,
      "Time_End": 1306.5,
      "Text": " look like if we decide that, okay, there's going to be, there's going to be a great power war,"
    },
    {
      "Time_Start": 1306.5,
      "Time_End": 1312.64,
      "Text": " we're worried about it, what, what happens? Right, so we have made it cheap. We have made"
    },
    {
      "Time_Start": 1312.64,
      "Time_End": 1317.64,
      "Text": " shipping monstrously cheap. And then we have no money for cyber security because it's"
    },
    {
      "Time_Start": 1321.22,
      "Time_End": 1326.22,
      "Text": " monstrously cheap. And then I need to be reliant upon that system to be available in a high end"
    },
    {
      "Time_Start": 1330.2,
      "Time_End": 1334.5,
      "Text": " war. That's, right, it's terrifying, right, trying to, trying to wrap my mind around how do I"
    },
    {
      "Time_Start": 1335.5,
      "Time_End": 1340.5,
      "Text": " even get back to something that I can control so that I can resupply, maintain, right. Again, I"
    },
    {
      "Time_Start": 1343.14,
      "Time_End": 1347.78,
      "Text": " don't want to, not super excited about it, don't want there to be a high end war, but if there's"
    },
    {
      "Time_Start": 1347.78,
      "Time_End": 1352.78,
      "Text": " gonna, I need there to be stuff. And so this is what keeps me up at night. Ports, who's operating"
    },
    {
      "Time_Start": 1356.56,
      "Time_End": 1361.36,
      "Text": " ships, how many ships we have, all of that. It's terrifying to me. But anyway, moderator's"
    },
    {
      "Time_Start": 1361.3600000000001,
      "Time_End": 1366.3600000000001,
      "Text": " prerogative. I got a little dark there. Anybody else? No? We good? Alright. So what are the"
    },
    {
      "Time_Start": 1368.92,
      "Time_End": 1372.8600000000001,
      "Text": " challenges? What is, what is the primary challenge? So he says lack of leadership, but in"
    },
    {
      "Time_Start": 1372.8600000000001,
      "Time_End": 1377.8600000000001,
      "Text": " real terms, somebody, you know, somebody really needs to X. Someone has got to X. To quote a"
    },
    {
      "Time_Start": 1380.2800000000002,
      "Time_End": 1385.2800000000002,
      "Text": " Chappelle-ism, uh, this is recorded, but I'm gonna punch down on my own people a little bit,"
    },
    {
      "Time_Start": 1385.6399999999999,
      "Time_End": 1392.6399999999999,
      "Text": " including myself here. Um, traditional cyber security experts don't know how to"
    },
    {
      "Time_Start": 1392.6399999999999,
      "Time_End": 1397.6399999999999,
      "Text": " communicate risk. At all. I'm gonna say that again. Traditional cyber security experts,"
    },
    {
      "Time_Start": 1400.52,
      "Time_End": 1406.52,
      "Text": " enterprise cyber security experts, doesn't matter what environment they come from, um, don't"
    },
    {
      "Time_Start": 1406.52,
      "Time_End": 1413.3,
      "Text": " know how to communicate risk. And what I mean by that is, what, the problems that we've just"
    },
    {
      "Time_Start": 1413.32,
      "Time_End": 1418.32,
      "Text": " discussed are a safety problem. Like capital S, safety, right? And they fund those things. Uh,"
    },
    {
      "Time_Start": 1421.06,
      "Time_End": 1427.5,
      "Text": " they will upgrade a refinery, they will upgrade a food and add, like a, uh, sugar processing or"
    },
    {
      "Time_Start": 1427.5,
      "Time_End": 1432.5,
      "Text": " boiler operation, um, for sugar refinement or, or, what, they'll upgrade a ship, no problem. We"
    },
    {
      "Time_Start": 1434.78,
      "Time_End": 1438.1399999999999,
      "Text": " upgrade ships all the time because the safety environmental management system on board or the"
    },
    {
      "Time_Start": 1438.1399999999999,
      "Time_End": 1442.82,
      "Text": " safety management system says, oh, you're, you've got an issue here, and Wartzilla is quick"
    },
    {
      "Time_Start": 1442.84,
      "Time_End": 1449.3799999999999,
      "Text": " to, quick to give a quote back to the Navy, right? Or, or what have you. Um, we have not"
    },
    {
      "Time_Start": 1449.3799999999999,
      "Time_End": 1455.78,
      "Text": " figured out as an industry, um, and, again, again, this is kind of an industrial control"
    },
    {
      "Time_Start": 1455.78,
      "Time_End": 1462.4199999999998,
      "Text": " systems and OT focused thing, but it's like the nexus between, um, physical process safety and"
    },
    {
      "Time_Start": 1462.4199999999998,
      "Time_End": 1468.06,
      "Text": " just safety in general and how these systems that are digitally enabled help provide and"
    },
    {
      "Time_Start": 1468.08,
      "Time_End": 1473.6399999999999,
      "Text": " support those functions to make the mission happen has not, like, we don't know how to"
    },
    {
      "Time_Start": 1473.6399999999999,
      "Time_End": 1479.12,
      "Text": " communicate that. Um, and there's not models for it, like, bow tie models are really great for"
    },
    {
      "Time_Start": 1479.12,
      "Time_End": 1485.36,
      "Text": " it, but we don't really use those in the US very much, which is strange to me, but everywhere"
    },
    {
      "Time_Start": 1485.36,
      "Time_End": 1490.36,
      "Text": " else when you go to the EU, like, they communicate cyber risk in, in the form of a bow tie"
    },
    {
      "Time_Start": 1490.36,
      "Time_End": 1494.8999999999999,
      "Text": " model all the time, but it's like, we're just not, we haven't figured it out yet, and until we"
    },
    {
      "Time_Start": 1494.9,
      "Time_End": 1501.0800000000002,
      "Text": " figure that out, um, the budget challenges that we've just talked about won't be solved,"
    },
    {
      "Time_Start": 1501.0800000000002,
      "Time_End": 1508.0800000000002,
      "Text": " because, um, it's not, we can't translate cyber risk into operational risk yet. I mean, we"
    },
    {
      "Time_Start": 1508.0800000000002,
      "Time_End": 1513.4,
      "Text": " can in some situations, but few and, few and far between. So that's a huge, huge challenge"
    },
    {
      "Time_Start": 1513.4,
      "Time_End": 1518.4,
      "Text": " in my mind. So, some of the self-improvement gurus will say that a good way to reframe"
    },
    {
      "Time_Start": 1518.7800000000002,
      "Time_End": 1523.7800000000002,
      "Text": " things when you say, I don't have enough time to do something, is to say instead, that's not a"
    },
    {
      "Time_Start": 1526.48,
      "Time_End": 1530.72,
      "Text": " priority for me, right? So when you say, like, I, you know, I don't have time to eat right, I"
    },
    {
      "Time_Start": 1530.72,
      "Time_End": 1535.46,
      "Text": " don't have time to exercise, I don't have time to be healthy, instead say, it's not a priority"
    },
    {
      "Time_Start": 1535.46,
      "Time_End": 1539.96,
      "Text": " to me to be health, healthy. So I would say that from an industry perspective, we have a"
    },
    {
      "Time_Start": 1539.96,
      "Time_End": 1545.7,
      "Text": " similar paradigm. Every time someone says, I don't have enough money for cyber security, in"
    },
    {
      "Time_Start": 1545.7,
      "Time_End": 1552.3400000000001,
      "Text": " fact, what they're saying is, cyber security is not a priority. And once we face that, once"
    },
    {
      "Time_Start": 1552.3400000000001,
      "Time_End": 1559.02,
      "Text": " we take a good, hard look at that, um, things will hopefully improve. And then the second"
    },
    {
      "Time_Start": 1559.02,
      "Time_End": 1565.02,
      "Text": " half of that, going back to the people, is the, you know, the elephant in the room that OT is"
    },
    {
      "Time_Start": 1565.02,
      "Time_End": 1570.02,
      "Text": " not IT. And that you can't send somebody to, you know, Microsoft training, uh, for your"
    },
    {
      "Time_Start": 1570.42,
      "Time_End": 1575.36,
      "Text": " industrial control systems, you know, unless it happens to be, you know, a Microsoft product. Um,"
    },
    {
      "Time_Start": 1575.36,
      "Time_End": 1580.36,
      "Text": " and when you hire a CIO, you're generally hiring an IT person, who looks at things with"
    },
    {
      "Time_Start": 1585.86,
      "Time_End": 1592.68,
      "Text": " keyboards and screens, and that circuit board that controls a pressure relief valve on a"
    },
    {
      "Time_Start": 1592.68,
      "Time_End": 1598.52,
      "Text": " gas main is really not in their, their wheelhouse. And we have to change that. If you look"
    },
    {
      "Time_Start": 1598.52,
      "Time_End": 1604.92,
      "Text": " online for, you know, vendor training for OT, there's like three orders of magnitude more"
    },
    {
      "Time_Start": 1604.92,
      "Time_End": 1610.2,
      "Text": " stuff for, you know, your standard desktop computer than there is for an industrial control"
    },
    {
      "Time_Start": 1610.2,
      "Time_End": 1616.34,
      "Text": " system. And as much as I might be upset if my home computer crashed, I'd be a lot more"
    },
    {
      "Time_Start": 1616.34,
      "Time_End": 1621.94,
      "Text": " upset if the power company crashed and I didn't have power to anything in my house. So I"
    },
    {
      "Time_Start": 1621.96,
      "Time_End": 1628.3400000000001,
      "Text": " think that, uh, that as an, that as an industry, um, both, both public sector and private"
    },
    {
      "Time_Start": 1628.3400000000001,
      "Time_End": 1633.3400000000001,
      "Text": " sector, uh, we need to increase capacity and training for the OT side. Um, one of the"
    },
    {
      "Time_Start": 1635.6200000000001,
      "Time_End": 1640.6200000000001,
      "Text": " challenges is definitely resources, um, and I think that one of the, one of the ways that, that"
    },
    {
      "Time_Start": 1643.1200000000001,
      "Time_End": 1649.66,
      "Text": " the government has succeeded, uh, recently between the Coast Guard and CISA is, I see a lot"
    },
    {
      "Time_Start": 1649.68,
      "Time_End": 1654.68,
      "Text": " of value add to the, to the private sector. And, um, you know, I know CISA does, offers free"
    },
    {
      "Time_Start": 1658.3000000000002,
      "Time_End": 1664.2,
      "Text": " scans, offers free, um, you know, the Coast Guard has cyber protection teams that go out and"
    },
    {
      "Time_Start": 1664.2,
      "Time_End": 1669.2,
      "Text": " do, um, uh, free, uh, assessments to critical ports and waterways. And I think that, that"
    },
    {
      "Time_Start": 1671.78,
      "Time_End": 1677.44,
      "Text": " one of the big challenges is getting people to do cyber security the right way. And we see"
    },
    {
      "Time_Start": 1677.46,
      "Time_End": 1682.8600000000001,
      "Text": " examples every day of people doing cyber security dumb. Right? And, you know, example is"
    },
    {
      "Time_Start": 1682.8600000000001,
      "Time_End": 1687.66,
      "Text": " some of these port security grant program things that come along. And, and the, and the, uh,"
    },
    {
      "Time_Start": 1687.66,
      "Time_End": 1692.18,
      "Text": " Atlanta Council actually did a nice paper talking about how the Coast Guard could be, could"
    },
    {
      "Time_Start": 1692.18,
      "Time_End": 1697.3400000000001,
      "Text": " and should be inserted into that process. Um, you know, I've heard of port grants being"
    },
    {
      "Time_Start": 1697.3400000000001,
      "Time_End": 1702.98,
      "Text": " approved for ports going out and buying a SIM. It's like, okay, great, so you bought a SIM."
    },
    {
      "Time_Start": 1703.02,
      "Time_End": 1709.2,
      "Text": " Who's going to operate the SIM? Okay, you bought Tanium. Really? What are you going to do?"
    },
    {
      "Time_Start": 1709.2,
      "Time_End": 1713.84,
      "Text": " Okay, you have two people on your IT staff? Yeah, we're going to learn Tanium and we're going"
    },
    {
      "Time_Start": 1713.84,
      "Time_End": 1718.98,
      "Text": " to figure it out. And then we're going to learn Splunk and we're going to deploy it. That's"
    },
    {
      "Time_Start": 1718.98,
      "Time_End": 1725.28,
      "Text": " not a smart use of resources. So how can we work together to share resources, to share"
    },
    {
      "Time_Start": 1725.28,
      "Time_End": 1730.82,
      "Text": " knowledge, to, to, to figure out how to do joint SOCs, you know, security operations. They're"
    },
    {
      "Time_Start": 1730.82,
      "Time_End": 1735.4399999999998,
      "Text": " expensive. I own one. I own a security operations center in Huntsville. They're expensive."
    },
    {
      "Time_Start": 1735.4399999999998,
      "Time_End": 1740.4399999999998,
      "Text": " They're hard to set up. And even if you do it full time, it's a challenge. A port just doesn't"
    },
    {
      "Time_Start": 1743.6399999999999,
      "Time_End": 1748.72,
      "Text": " have the resources or shouldn't have the resources to necessarily, most of them, unless"
    },
    {
      "Time_Start": 1748.72,
      "Time_End": 1753.28,
      "Text": " they're the giant ones, to stand up all those resources on their own. I think one of the"
    },
    {
      "Time_Start": 1753.28,
      "Time_End": 1756.9199999999998,
      "Text": " challenges is, is figuring out how to break down those barriers between governmental"
    },
    {
      "Time_Start": 1756.96,
      "Time_End": 1763.3600000000001,
      "Text": " organizations and between private and public and using those funds instead of just saying,"
    },
    {
      "Time_Start": 1763.3600000000001,
      "Time_End": 1767.8400000000001,
      "Text": " yep, here's $40,000 for this, here's $40,000 for this, here's $120,000 for this, saying,"
    },
    {
      "Time_Start": 1767.8400000000001,
      "Time_End": 1773.38,
      "Text": " hey, here's a million dollars and we're going to service everybody. And so I think that"
    },
    {
      "Time_Start": 1773.38,
      "Time_End": 1778.24,
      "Text": " getting people to break down those fiefdoms, and again that's a leadership problem, it's not a"
    },
    {
      "Time_Start": 1778.24,
      "Time_End": 1782.8200000000002,
      "Text": " technical problem, it's a leadership problem of people giving up their control over their"
    },
    {
      "Time_Start": 1782.86,
      "Time_End": 1787.86,
      "Text": " fiefdoms. And that is an extraordinarily difficult challenge to face. If you've never been"
    },
    {
      "Time_Start": 1790.46,
      "Time_End": 1796.5,
      "Text": " slow rolled by somebody on your IT staff, then you've never known. But if you think of that"
    },
    {
      "Time_Start": 1796.5,
      "Time_End": 1800.34,
      "Text": " at the component level, it's even more difficult. But I think that's one of the biggest"
    },
    {
      "Time_Start": 1800.34,
      "Time_End": 1805.08,
      "Text": " challenges, is using the right resources in the right way and breaking down those barriers."
    },
    {
      "Time_Start": 1805.08,
      "Time_End": 1810.78,
      "Text": " I want to be respectful of that people's time because I wanted to give you an opportunity to"
    },
    {
      "Time_Start": 1810.78,
      "Time_End": 1815.32,
      "Text": " ask questions at any level that you want to ask. And so I just wanted to do a little bit"
    },
    {
      "Time_Start": 1815.32,
      "Time_End": 1821.82,
      "Text": " more prodding and just sort of say something nice. What is working? What is actually"
    },
    {
      "Time_Start": 1821.82,
      "Time_End": 1826.92,
      "Text": " working or what has promise that you think this is working?"
    },
    {
      "Time_Start": 1826.92,
      "Time_End": 1832.66,
      "Text": " Two years ago we did a pretty comprehensive, or actually it's been almost three years ago"
    },
    {
      "Time_Start": 1832.66,
      "Time_End": 1838.7,
      "Text": " now, we did a pretty comprehensive study for one of the DHS centers of excellence, the"
    },
    {
      "Time_Start": 1838.72,
      "Time_End": 1844.7,
      "Text": " Stevens Institute, on uh the maritime industry as a whole. And we went back and reassessed"
    },
    {
      "Time_Start": 1844.7,
      "Time_End": 1850.3,
      "Text": " like some cha- we wanted to see owner operator, we we commonly refer to like ports as a whole"
    },
    {
      "Time_Start": 1850.3,
      "Time_End": 1854.74,
      "Text": " as owner operators. And it's like okay, if you go to the port of Savannah, I mean we"
    },
    {
      "Time_Start": 1854.74,
      "Time_End": 1860.28,
      "Text": " surveyed on in 2018, here's the results that they had based on C2M2, which is a maturity"
    },
    {
      "Time_Start": 1860.28,
      "Time_End": 1864.22,
      "Text": " model for cyber security. We were like, you know, stack up against this and and it's pretty"
    },
    {
      "Time_Start": 1864.22,
      "Time_End": 1867.72,
      "Text": " lightweight. And so we had those results and we went back and one of the things they"
    },
    {
      "Time_Start": 1867.74,
      "Time_End": 1872.74,
      "Text": " couldn't answer back then was who do you call when you have a cyber incident? Like who do you"
    },
    {
      "Time_Start": 1875.1200000000001,
      "Time_End": 1880.8600000000001,
      "Text": " call? And they would say oh uh InfraGard. And it's like okay, that's an option, yeah call"
    },
    {
      "Time_Start": 1880.8600000000001,
      "Time_End": 1886.22,
      "Text": " the FBI, that one works. Um or they would say well I'm supposed to call CISA but I actually"
    },
    {
      "Time_Start": 1886.22,
      "Time_End": 1890.5,
      "Text": " call provider X, whoever their security provider is, who hopefully knows where they're"
    },
    {
      "Time_Start": 1890.5,
      "Time_End": 1896.34,
      "Text": " supposed to report up to. In some cases they would say um I'm gonna call DOE, like for oil"
    },
    {
      "Time_Start": 1896.3600000000001,
      "Time_End": 1901.3600000000001,
      "Text": " and gas cause of the uh of CSER, right? Um and so CISA has done a great job uh CIRCIA, the"
    },
    {
      "Time_Start": 1905.2,
      "Time_End": 1910.2400000000002,
      "Text": " new uh infrastructure reporting act that's that's in I think still in notice for proposed"
    },
    {
      "Time_Start": 1910.2400000000002,
      "Time_End": 1916.6200000000001,
      "Text": " rulemaking status, right? Uh I think, don't don't hold me on that, but um is re- kind of"
    },
    {
      "Time_Start": 1916.6200000000001,
      "Time_End": 1921.7600000000002,
      "Text": " reestablishing themselves as a critical critical focal point for all cyber reporting um for"
    },
    {
      "Time_Start": 1921.78,
      "Time_End": 1926.3799999999999,
      "Text": " incidents. And so that's huge because it helps streamline the process because often times"
    },
    {
      "Time_Start": 1926.3799999999999,
      "Time_End": 1932.12,
      "Text": " what happens in an incident is um when you have multiple federal stakeholders involved they"
    },
    {
      "Time_Start": 1932.12,
      "Time_End": 1938.3,
      "Text": " all end up in a like spider man exercise of pointing at each other like here's how we're"
    },
    {
      "Time_Start": 1938.3,
      "Time_End": 1942.9,
      "Text": " gonna transfer the risk. Um and so it's like if you cut the systems back on and it's still"
    },
    {
      "Time_Start": 1942.9,
      "Time_End": 1945.98,
      "Text": " broken it's your fault and you have to fix it or it's your fault and you have to fix it. And"
    },
    {
      "Time_Start": 1946.0,
      "Time_End": 1952.6,
      "Text": " so um yeah I think CISA has done a really good job um trying to centralize the reporting"
    },
    {
      "Time_Start": 1952.6,
      "Time_End": 1958.0,
      "Text": " effort and we've seen that in policy and in uh you know legislation as a response to some of"
    },
    {
      "Time_Start": 1958.0,
      "Time_End": 1961.58,
      "Text": " the executive orders that have come out in the national security memorandums and things like"
    },
    {
      "Time_Start": 1961.58,
      "Time_End": 1968.32,
      "Text": " that. So pat on the back for CISA. So um I I think one of the biggest things I saw out of the"
    },
    {
      "Time_Start": 1968.32,
      "Time_End": 1973.32,
      "Text": " Coast Guard is that they've um uh resourced maritime transportation um security specialists"
    },
    {
      "Time_Start": 1976.3600000000001,
      "Time_End": 1981.3600000000001,
      "Text": " cyber at each of the 36 I think it is now sectors and uh each district and each area. And"
    },
    {
      "Time_Start": 1984.0,
      "Time_End": 1990.64,
      "Text": " so there are cyber security specialists now in in each of those areas and each of those"
    },
    {
      "Time_Start": 1990.64,
      "Time_End": 1997.44,
      "Text": " sectors has an area maritime security committee and um I'm on the cyber sub working group"
    },
    {
      "Time_Start": 1997.44,
      "Time_End": 2002.44,
      "Text": " at the uh St. Petersburg one in Florida and there is a very very strong Coast Guard and CISA"
    },
    {
      "Time_Start": 2002.74,
      "Time_End": 2007.74,
      "Text": " presence. Very strong, very respected. They bring a lot to the table. Industry is"
    },
    {
      "Time_Start": 2011.96,
      "Time_End": 2016.76,
      "Text": " responding. All the ports come to the meetings. They're always informative. And I think"
    },
    {
      "Time_Start": 2016.76,
      "Time_End": 2021.76,
      "Text": " that in many cases you know you have the high level policy but then you have that organic you"
    },
    {
      "Time_Start": 2024.3,
      "Time_End": 2028.8,
      "Text": " know local cause you're always gonna have the good old boys the you know that that kind of"
    },
    {
      "Time_Start": 2028.8,
      "Time_End": 2035.6399999999999,
      "Text": " thing. Um but I've seen a lot of uh a lot of really positives out of the the the sectors"
    },
    {
      "Time_Start": 2035.6399999999999,
      "Time_End": 2040.02,
      "Text": " where they have a strong area maritime security committee with CISA and Coast Guard"
    },
    {
      "Time_Start": 2040.02,
      "Time_End": 2044.48,
      "Text": " leadership and presence being involved. Doing exercises. When you do those exercises you"
    },
    {
      "Time_Start": 2044.48,
      "Time_End": 2049.56,
      "Text": " start to figure out in a hurry who you're supposed to call, who's responsible for what. And"
    },
    {
      "Time_Start": 2049.56,
      "Time_End": 2055.16,
      "Text": " so I think that um where where the Coast Guard and CISA have done particularly well is by"
    },
    {
      "Time_Start": 2055.16,
      "Time_End": 2062.2,
      "Text": " investing in those uh positions at those sectors to to actually embed and work with uh"
    },
    {
      "Time_Start": 2062.2,
      "Time_End": 2067.2,
      "Text": " industry in those areas. So on the public sector side I'm actually really encouraged and"
    },
    {
      "Time_Start": 2070.3399999999997,
      "Time_End": 2076.18,
      "Text": " downright proud of the the latest uh workforce documents that have come out. Uh where"
    },
    {
      "Time_Start": 2076.18,
      "Time_End": 2081.16,
      "Text": " we're establishing real work roles and training and qualification standards and it's not"
    },
    {
      "Time_Start": 2081.16,
      "Time_End": 2086.52,
      "Text": " just like the IT person. You know where people actually have to professionalize you know what"
    },
    {
      "Time_Start": 2086.52,
      "Time_End": 2091.54,
      "Text": " they're doing and I'm hoping that will lead to a uh a greater lash up with that IT versus OT"
    },
    {
      "Time_Start": 2093.3999999999996,
      "Time_End": 2098.3999999999996,
      "Text": " problem. Uh on the public sector side I'm encouraged by the greater emphasis on HBOMB and"
    },
    {
      "Time_Start": 2100.94,
      "Time_End": 2105.94,
      "Text": " SBOMB. And uh the the the default result of that will be to put a a greater emphasis on"
    },
    {
      "Time_Start": 2111.42,
      "Time_End": 2116.62,
      "Text": " uh components made by adversaries not getting into our critical infrastructure or at least"
    },
    {
      "Time_Start": 2116.62,
      "Time_End": 2123.16,
      "Text": " being aware of them you know. Um I look today and I you know I think that uh I think anybody"
    },
    {
      "Time_Start": 2123.16,
      "Time_End": 2127.1,
      "Text": " who's working on critical infrastructure should have to watch the pilot episode of the"
    },
    {
      "Time_Start": 2127.1,
      "Time_End": 2132.64,
      "Text": " Battlestar Galactica reboot. Like did you learn nothing? You know um you should be able to"
    },
    {
      "Time_Start": 2132.64,
      "Time_End": 2137.64,
      "Text": " run these things disconnected if you have to um because Cylons. So those are the things"
    },
    {
      "Time_Start": 2138.0,
      "Time_End": 2143.0,
      "Text": " that that I'm encouraged by. That took a turn. Um alright so that's that's great. So I"
    },
    {
      "Time_Start": 2146.3399999999997,
      "Time_End": 2151.24,
      "Text": " wanted to give the audience an opportunity to step forward um and ask any questions whether"
    },
    {
      "Time_Start": 2151.24,
      "Time_End": 2156.44,
      "Text": " down in the weeds or um higher up and so I'm just gonna sort of stand by and I'll uh we do"
    },
    {
      "Time_Start": 2156.44,
      "Time_End": 2161.46,
      "Text": " have microphones or you can just yell. Go ahead. Hey uh my name's Don Moss. I'm a uh former"
    },
    {
      "Time_Start": 2162.34,
      "Time_End": 2167.62,
      "Text": " uh Air Force now Space Force Defensive Cyber Elf so shout out. Space Force? Yeah um in my"
    },
    {
      "Time_Start": 2167.62,
      "Time_End": 2172.76,
      "Text": " experience uh some of our organizational leaders don't see uh cyber security they see it"
    },
    {
      "Time_Start": 2172.76,
      "Time_End": 2176.96,
      "Text": " more as a check box you know just a tick and not and they don't really prioritize the"
    },
    {
      "Time_Start": 2176.96,
      "Time_End": 2182.16,
      "Text": " robustness or the performance of their cyber security posture. So do you think or in your"
    },
    {
      "Time_Start": 2182.16,
      "Time_End": 2187.54,
      "Text": " experience do you share the same sentiment or and then uh is there ways around the policy"
    },
    {
      "Time_Start": 2187.56,
      "Time_End": 2192.2599999999998,
      "Text": " or can we rewrite the policy to where that they care about the performance of their cyber"
    },
    {
      "Time_Start": 2192.2599999999998,
      "Time_End": 2197.5,
      "Text": " security or cyber posture? I'll take first crack at that. So uh only speaking for the"
    },
    {
      "Time_Start": 2197.5,
      "Time_End": 2202.34,
      "Text": " Department of the Navy um we've we've very declaratively started a shift from a culture of"
    },
    {
      "Time_Start": 2202.34,
      "Time_End": 2207.34,
      "Text": " compliance to a culture of readiness. Having a three year ATO that that was not accurate"
    },
    {
      "Time_Start": 2211.68,
      "Time_End": 2217.08,
      "Text": " the day it was signed because it you know each individual piece of paper was a snapshot in"
    },
    {
      "Time_Start": 2217.66,
      "Time_End": 2222.66,
      "Text": " time um is not protecting our stuff and saying okay now I've got an ATO bags down feed up"
    },
    {
      "Time_Start": 2225.36,
      "Time_End": 2231.34,
      "Text": " I'll wait three years before I do it again that's not working for anybody. So uh there's a"
    },
    {
      "Time_Start": 2231.34,
      "Time_End": 2238.08,
      "Text": " greater emphasis on on true risk management um and I'm not I'm not gonna blow smoke here and"
    },
    {
      "Time_Start": 2238.08,
      "Time_End": 2243.96,
      "Text": " tell you yeah we got this solved man we're you know we're all over it um but we've we've"
    },
    {
      "Time_Start": 2243.96,
      "Time_End": 2249.28,
      "Text": " kinda done the Babe Ruth you know we're pointing at where we're gonna hit the ball and and"
    },
    {
      "Time_Start": 2249.28,
      "Time_End": 2254.28,
      "Text": " we've acknowledged that that culture of compliance is not serving us and needs to change."
    },
    {
      "Time_Start": 2258.52,
      "Time_End": 2265.38,
      "Text": " Performance based standards is all the rage right now. I mean if you if you look at CISA uh"
    },
    {
      "Time_Start": 2265.38,
      "Time_End": 2270.62,
      "Text": " cyber performance goals right the CPGs that just came out uh there's more iterations coming"
    },
    {
      "Time_Start": 2270.62,
      "Time_End": 2276.0,
      "Text": " for the sector specific goals which are a subset of the cyber performance goals um they're"
    },
    {
      "Time_Start": 2276.0,
      "Time_End": 2280.74,
      "Text": " all performance based. TSA security directive for pipeline first time it went out TSA"
    },
    {
      "Time_Start": 2280.74,
      "Time_End": 2286.5,
      "Text": " administrator was at a talk earlier this morning he was like it was terrible we did a 180 and"
    },
    {
      "Time_Start": 2286.5,
      "Time_End": 2291.68,
      "Text": " the second one was performance based and so there's two federal organizations that are um"
    },
    {
      "Time_Start": 2291.68,
      "Time_End": 2296.48,
      "Text": " really hot and heavy on the um performance based standards now and so I think to your point"
    },
    {
      "Time_Start": 2296.48,
      "Time_End": 2302.68,
      "Text": " um yes performance based standards as a policy uh will help you get to security better than it"
    },
    {
      "Time_Start": 2302.68,
      "Time_End": 2309.2,
      "Text": " will to compliance um and you know if I had my druthers I would like to burn RMF to the"
    },
    {
      "Time_Start": 2309.2,
      "Time_End": 2315.04,
      "Text": " ground but the reality is we can't do that um it's the nature of the beast in a lot of"
    },
    {
      "Time_Start": 2315.04,
      "Time_End": 2320.04,
      "Text": " situations and so you know adapt and overcome. I agree. Yeah so we we talked a little bit"
    },
    {
      "Time_Start": 2321.04,
      "Time_End": 2326.04,
      "Text": " about uh you know what happens when an ex-colonial pipeline happens on a port right um and so"
    },
    {
      "Time_Start": 2327.58,
      "Time_End": 2332.2799999999997,
      "Text": " that that sort of leads me to think like well I I I guess to solicit your insight into whether or"
    },
    {
      "Time_Start": 2332.2799999999997,
      "Time_End": 2337.2799999999997,
      "Text": " not a a policy or set of policies uh that outline um the sort of requisite um conditions for a"
    },
    {
      "Time_Start": 2339.96,
      "Time_End": 2344.7599999999998,
      "Text": " vulnerability found within vulnerability research programs to be disclosed to the vendor rather"
    },
    {
      "Time_Start": 2344.82,
      "Time_End": 2351.5,
      "Text": " than kept for the next duck snap right um it it occurs to me that uh transparency there might be"
    },
    {
      "Time_Start": 2351.5,
      "Time_End": 2356.84,
      "Text": " helpful to the greater community um and it feels as though it makes me a little nervous to say"
    },
    {
      "Time_Start": 2356.84,
      "Time_End": 2362.4,
      "Text": " oh well let's just trust you all um to sort of decide when something should be patched and"
    },
    {
      "Time_Start": 2362.4,
      "Time_End": 2368.34,
      "Text": " when something should be um you know weaponized for next split. I'm here from the government"
    },
    {
      "Time_Start": 2368.34,
      "Time_End": 2373.44,
      "Text": " and I'm here to help. Uh no I wouldn't I got nothing. Vulnerability disclosure what where"
    },
    {
      "Time_Start": 2373.44,
      "Time_End": 2378.44,
      "Text": " you guys on this one? Well I mean you want the fed perspective first or? No no no no no I'm"
    },
    {
      "Time_Start": 2381.2400000000002,
      "Time_End": 2386.2400000000002,
      "Text": " not in a position to articulate. Okay. Josh? No comment? All you buddy. Um yeah so I was in"
    },
    {
      "Time_Start": 2389.2200000000003,
      "Time_End": 2394.48,
      "Text": " that boat again like I used to be the dude that was doing that um feds call it capability"
    },
    {
      "Time_Start": 2394.48,
      "Time_End": 2400.82,
      "Text": " development uh in a lot of situations and so I was in that position and um I think we need to"
    },
    {
      "Time_Start": 2400.84,
      "Time_End": 2406.1400000000003,
      "Text": " do a better job of establishing who you can go to. Um it came up again this morning like I just"
    },
    {
      "Time_Start": 2406.1400000000003,
      "Time_End": 2410.84,
      "Text": " talked about TSA administrators call someone asked the same question in that talk and he was"
    },
    {
      "Time_Start": 2410.84,
      "Time_End": 2415.76,
      "Text": " like call the FBI and I was like I don't know any I wouldn't call the FBI like the FBI doesn't"
    },
    {
      "Time_Start": 2415.76,
      "Time_End": 2420.7000000000003,
      "Text": " know what to do with cyber charges like I'm going to catch a charge if I call the FBI and"
    },
    {
      "Time_Start": 2420.7000000000003,
      "Time_End": 2424.6000000000004,
      "Text": " disclose a vulnerability they don't know what I'm doing or who I work for you know like that's"
    },
    {
      "Time_Start": 2424.62,
      "Time_End": 2431.22,
      "Text": " uh kind of out of scope right? Um and uh who do you know so it's like I think we need to be"
    },
    {
      "Time_Start": 2431.22,
      "Time_End": 2436.66,
      "Text": " there are people within the federal community who are responsible for liaising those things. I"
    },
    {
      "Time_Start": 2436.66,
      "Time_End": 2442.2,
      "Text": " think we need to have more resources available for people to understand who they need to"
    },
    {
      "Time_Start": 2442.2,
      "Time_End": 2448.54,
      "Text": " contact in that space. I don't think that we do that very well at all. Um coming from being"
    },
    {
      "Time_Start": 2448.54,
      "Time_End": 2453.24,
      "Text": " in your shoes right? Um I had a program that I communicated through and there were people"
    },
    {
      "Time_Start": 2453.28,
      "Time_End": 2459.2200000000003,
      "Text": " designated to help me with that specific slice I was working on right? Um and reporting that"
    },
    {
      "Time_Start": 2459.2200000000003,
      "Time_End": 2466.0600000000004,
      "Text": " and getting it out and disclosing it. Um it's one of the big reasons that big providers in"
    },
    {
      "Time_Start": 2466.0600000000004,
      "Time_End": 2473.0000000000005,
      "Text": " this in the OT space like Dragos don't do attribution. Because they want to be able to put"
    },
    {
      "Time_Start": 2473.0000000000005,
      "Time_End": 2478.8,
      "Text": " everything out right? They want to anonymize things, pseudomize things right? So um yeah"
    },
    {
      "Time_Start": 2478.84,
      "Time_End": 2484.34,
      "Text": " that that's a really good a really good one that needs more work. So. Thank you. I want to just"
    },
    {
      "Time_Start": 2484.34,
      "Time_End": 2488.48,
      "Text": " uh to follow up on that. You don't have to stand there the whole time but I but the uh this"
    },
    {
      "Time_Start": 2488.48,
      "Time_End": 2493.28,
      "Text": " walking around on the floor here is a goon named Silas Cutler who has long made an argument"
    },
    {
      "Time_Start": 2493.28,
      "Time_End": 2497.82,
      "Text": " for what we call a single front door for vulnerability reporting whether that's the"
    },
    {
      "Time_Start": 2497.82,
      "Time_End": 2500.5600000000004,
      "Text": " department of defense or if that's the federal government. I think frankly the federal"
    },
    {
      "Time_Start": 2500.5600000000004,
      "Time_End": 2507.5600000000004,
      "Text": " government's the right answer. There is no single front door for U.S. vulnerability"
    },
    {
      "Time_Start": 2507.56,
      "Time_End": 2513.0,
      "Text": " disclosure for for threats to the United States in particular. There is a patchwork of"
    },
    {
      "Time_Start": 2513.0,
      "Time_End": 2518.0,
      "Text": " networks of friend DA's and back office phone calls and so one shop will receive a report"
    },
    {
      "Time_Start": 2520.2799999999997,
      "Time_End": 2524.98,
      "Text": " and they'll call somebody they know from another office because it's not my slice. And so"
    },
    {
      "Time_Start": 2524.98,
      "Time_End": 2529.72,
      "Text": " there is this conversation that has slowed over time but probably needs to be picked up"
    },
    {
      "Time_Start": 2529.72,
      "Time_End": 2534.56,
      "Text": " again. So um yeah Silas Cutler is the person I talked to about that. But yeah thanks for"
    },
    {
      "Time_Start": 2534.82,
      "Time_End": 2540.96,
      "Text": " bringing that up. You all have identified that there's a general lack of concern at the"
    },
    {
      "Time_Start": 2540.96,
      "Time_End": 2548.0,
      "Text": " executive level for most of the organizations you've supported. Being a policy based talk"
    },
    {
      "Time_Start": 2548.0,
      "Time_End": 2553.74,
      "Text": " and knowing that um industry doesn't tend to do something out of pure goodwill. Is there"
    },
    {
      "Time_Start": 2553.74,
      "Time_End": 2558.74,
      "Text": " any stick to or carrot approach that is taken particularly in the you know ABS view of the"
    },
    {
      "Time_Start": 2559.6600000000003,
      "Time_End": 2564.6600000000003,
      "Text": " world like. You're gonna get fired now too alright. Hey uh we're not gonna get a vessel"
    },
    {
      "Time_Start": 2567.84,
      "Time_End": 2573.28,
      "Text": " certification if you don't do cyber right or. Yeah I'll step in front of that one. It's"
    },
    {
      "Time_Start": 2573.28,
      "Time_End": 2578.98,
      "Text": " gonna boil down to insurance carriers. So insurance carriers tend to worry about exposure"
    },
    {
      "Time_Start": 2578.98,
      "Time_End": 2584.5200000000004,
      "Text": " to data breach not in general liability of people and personnel. Well insurance carriers I"
    },
    {
      "Time_Start": 2584.54,
      "Time_End": 2589.38,
      "Text": " submit are concerned with anything that they could end up paying out on. Sure. So is there a"
    },
    {
      "Time_Start": 2589.38,
      "Time_End": 2594.38,
      "Text": " tie to the insurance. I go back to my colleagues point of that as a professional cadre"
    },
    {
      "Time_Start": 2597.02,
      "Time_End": 2602.7599999999998,
      "Text": " cyber security professionals are not good at expressing risk. So coming from the merchant"
    },
    {
      "Time_Start": 2602.7599999999998,
      "Time_End": 2608.16,
      "Text": " industry one of the questions on the Coast Guard exam is you know in like two and a half"
    },
    {
      "Time_Start": 2608.16,
      "Time_End": 2613.1,
      "Text": " inch white letters on a red handle in the lifeboat what does it actually say on the handle."
    },
    {
      "Time_Start": 2613.12,
      "Time_End": 2620.12,
      "Text": " Now I could say danger. Lever releases the hooks. Danger. Lever does any number of things."
    },
    {
      "Time_Start": 2620.12,
      "Time_End": 2626.2,
      "Text": " What it actually says is danger. Lever drops boat right. Now mechanically it's releasing the"
    },
    {
      "Time_Start": 2626.2,
      "Time_End": 2631.8399999999997,
      "Text": " things that are holding the boat in and apparently it used to say you know hey if you pull"
    },
    {
      "Time_Start": 2631.8399999999997,
      "Time_End": 2636.94,
      "Text": " this handle these hooks will let go. People go okay. Why do I care. Because the boat will"
    },
    {
      "Time_Start": 2636.94,
      "Time_End": 2642.48,
      "Text": " fall. And you were in the boat if you're holding on to the handle because there's no other"
    },
    {
      "Time_Start": 2642.5,
      "Time_End": 2646.8,
      "Text": " way to move the handle unless you're in the boat. And you're only supposed to do that when"
    },
    {
      "Time_Start": 2646.8,
      "Time_End": 2651.8,
      "Text": " you're in the water. I submit we as a a cyber security cadre need to be better at explaining"
    },
    {
      "Time_Start": 2655.38,
      "Time_End": 2660.38,
      "Text": " lever drops boat as opposed to cyber security risk murmur murmur ransomware murmur murmur. And"
    },
    {
      "Time_Start": 2662.72,
      "Time_End": 2667.12,
      "Text": " you know and people go yeah okay whatever. And and we need to be we need to be better as my"
    },
    {
      "Time_Start": 2667.16,
      "Time_End": 2672.16,
      "Text": " colleagues said of articulating risk. So I'll give this my very individual perspective"
    },
    {
      "Time_Start": 2675.2,
      "Time_End": 2680.2,
      "Text": " unaffiliated. I would say that we also need to figure out incentives in addition to the stick."
    },
    {
      "Time_Start": 2683.2799999999997,
      "Time_End": 2689.24,
      "Text": " And you know we've been talking about DFARS and CMMC for those who are familiar with DOD"
    },
    {
      "Time_Start": 2689.24,
      "Time_End": 2694.66,
      "Text": " contracting and DOD rules. So that that came out in 2013 that folks are supposed to be doing"
    },
    {
      "Time_Start": 2694.66,
      "Time_End": 2699.16,
      "Text": " that and here we are 10 years later. We would we put a man on the moon in that time in the"
    },
    {
      "Time_Start": 2699.16,
      "Time_End": 2705.58,
      "Text": " 60s but we haven't gotten DFARS and CMMC across the line. So you could fix a lot of those"
    },
    {
      "Time_Start": 2705.58,
      "Time_End": 2711.44,
      "Text": " problems tomorrow by just saying okay look any contract that has controlled unclassified"
    },
    {
      "Time_Start": 2711.44,
      "Time_End": 2716.44,
      "Text": " information in it 20 percent or 15 percent of the weighted evaluation for winning the contractor"
    },
    {
      "Time_Start": 2717.44,
      "Time_End": 2722.44,
      "Text": " criteria will be cyber security and what is your cyber security stance and what is your"
    },
    {
      "Time_Start": 2724.88,
      "Time_End": 2730.38,
      "Text": " cyber security posture. That will then incentivize people to actually go out and do cyber"
    },
    {
      "Time_Start": 2730.38,
      "Time_End": 2734.7200000000003,
      "Text": " security instead of going alright what box do I need to check. They would they would then be"
    },
    {
      "Time_Start": 2734.7200000000003,
      "Time_End": 2740.16,
      "Text": " incentivized to invest because right now the probability of win is unimpacted by cyber"
    },
    {
      "Time_Start": 2740.16,
      "Time_End": 2744.96,
      "Text": " security. It's a cost. It's a cost center that you get no investment out of towards your"
    },
    {
      "Time_Start": 2744.98,
      "Time_End": 2750.56,
      "Text": " probability of winning a contract or your bottom line. Um so I would I would submit that"
    },
    {
      "Time_Start": 2750.56,
      "Time_End": 2757.7400000000002,
      "Text": " figuring out ways to incent um in addition to policies is a way to do it and I think that we"
    },
    {
      "Time_Start": 2757.7400000000002,
      "Time_End": 2764.5,
      "Text": " haven't been able to crack that nut as effectively as we as we'd like to. Um I've got we have"
    },
    {
      "Time_Start": 2764.5,
      "Time_End": 2769.38,
      "Text": " five minutes left and so unless you're burning we want to give this gentleman a person that"
    },
    {
      "Time_Start": 2769.38,
      "Time_End": 2774.7200000000003,
      "Text": " he's got. Good afternoon I had a real quick question about uh vessel specific"
    },
    {
      "Time_Start": 2775.4800000000005,
      "Time_End": 2779.7200000000003,
      "Text": " cyber policy cause you were talking about earlier about how there's only a pseudo policy for"
    },
    {
      "Time_Start": 2779.7200000000003,
      "Time_End": 2785.38,
      "Text": " vessels and technically because of SMS and all those things there's no actual policy and"
    },
    {
      "Time_Start": 2785.38,
      "Time_End": 2791.1200000000003,
      "Text": " you're talking about too like how we can't let the fact that there's no perfect solution for"
    },
    {
      "Time_Start": 2791.1200000000003,
      "Time_End": 2796.5000000000005,
      "Text": " that not get good enough so I just wanted to ask in terms of cyber policy for vessels in terms"
    },
    {
      "Time_Start": 2796.5000000000005,
      "Time_End": 2802.44,
      "Text": " of kind of like preventing like cyber incidents like what does good enough for that actually"
    },
    {
      "Time_Start": 2802.46,
      "Time_End": 2807.3,
      "Text": " look like? We yeah there's and it actually was what I would answer uh the gentleman's"
    },
    {
      "Time_Start": 2807.3,
      "Time_End": 2811.1,
      "Text": " question before you as well with which is uh the International Association of"
    },
    {
      "Time_Start": 2811.1,
      "Time_End": 2818.04,
      "Text": " Classification Societies which is a really long thing. Um just developed to these unified"
    },
    {
      "Time_Start": 2818.04,
      "Time_End": 2821.48,
      "Text": " requirements ABS my parent company American Bureau of Shipping is a classification"
    },
    {
      "Time_Start": 2821.48,
      "Time_End": 2827.56,
      "Text": " society so is DNV so is Lloyd's Register German Lloyd's um amongst others and so uh the"
    },
    {
      "Time_Start": 2827.58,
      "Time_End": 2832.58,
      "Text": " International Association of Class puts rules in that we have to follow as class societies"
    },
    {
      "Time_Start": 2832.58,
      "Time_End": 2837.22,
      "Text": " that's what allows us to maintain our non-profit status status not for profit status as a class"
    },
    {
      "Time_Start": 2837.22,
      "Time_End": 2842.42,
      "Text": " society. Uh they just did cyber this year. Uh for new ships well they've been working on it"
    },
    {
      "Time_Start": 2842.42,
      "Time_End": 2849.4,
      "Text": " since 2018 but new ships um that have a request for uh essentially the the date for the ship to"
    },
    {
      "Time_Start": 2849.4,
      "Time_End": 2856.4,
      "Text": " be built we call it an RFC um after January 1, 2024 have to abide with uh roughly 70 percent"
    },
    {
      "Time_Start": 2856.44,
      "Time_End": 2860.88,
      "Text": " more controls and some of them are really technical they want you to do monitoring on board"
    },
    {
      "Time_Start": 2860.88,
      "Time_End": 2866.62,
      "Text": " ships to for hardening of material as an as an option. Um not that you have to do monitoring"
    },
    {
      "Time_Start": 2866.62,
      "Time_End": 2872.06,
      "Text": " but it's the easiest path of resistance if you want to comply with it in some cases and so um"
    },
    {
      "Time_Start": 2872.06,
      "Time_End": 2877.76,
      "Text": " how do we do that? What do we work on? Well uh the standards based performance for IACs is"
    },
    {
      "Time_Start": 2877.76,
      "Time_End": 2884.46,
      "Text": " based in ISA IEC 62443 not NIST. And that's a big deal. Like from a practitioner's"
    },
    {
      "Time_Start": 2884.46,
      "Time_End": 2891.2400000000002,
      "Text": " perspective I can find you a bunch of people that can do NIST 853 uh I can find you a lot"
    },
    {
      "Time_Start": 2891.2400000000002,
      "Time_End": 2896.2400000000002,
      "Text": " less people that can do an ISA IEC 6244 62443 attestation so that's a big that's a big leap"
    },
    {
      "Time_Start": 2899.82,
      "Time_End": 2904.7400000000002,
      "Text": " that I'm really excited for um you know it's going to be part of class so it's a requirement"
    },
    {
      "Time_Start": 2904.7400000000002,
      "Time_End": 2909.62,
      "Text": " you can't you can't get a vessel certified after this year without it so if it's if it started"
    },
    {
      "Time_Start": 2909.62,
      "Time_End": 2914.62,
      "Text": " construction on that date. Two minutes. Willems. Hey all thank you for joining today. One"
    },
    {
      "Time_Start": 2918.12,
      "Time_End": 2922.2,
      "Text": " question on my side uh obviously a lot of challenges in terms of like the public private"
    },
    {
      "Time_Start": 2922.2,
      "Time_End": 2927.5,
      "Text": " collaboration on the US side um but inherently the maritime transportation uh sector is very"
    },
    {
      "Time_Start": 2927.5,
      "Time_End": 2931.7799999999997,
      "Text": " international uh in the way that it operates and functions um so we'd love to hear from folks"
    },
    {
      "Time_Start": 2931.7799999999997,
      "Time_End": 2936.58,
      "Text": " uh a little bit about um how kind of collaboration harmonization can look across the"
    },
    {
      "Time_Start": 2936.58,
      "Time_End": 2940.12,
      "Text": " international spectrum and potentially like some challenges and opportunities in that"
    },
    {
      "Time_Start": 2940.12,
      "Time_End": 2945.12,
      "Text": " space. Big question not a two minute question. Yeah so so unfortunately the biggest thing I"
    },
    {
      "Time_Start": 2947.72,
      "Time_End": 2951.42,
      "Text": " see there is challenge I really like to be a glass half full kind of guy but in this in this"
    },
    {
      "Time_Start": 2951.42,
      "Time_End": 2956.42,
      "Text": " particular case I'm uh I'm I'm thirsty and uh there's not a lot there because the reality is we"
    },
    {
      "Time_Start": 2959.2,
      "Time_End": 2964.34,
      "Text": " are in international competition not just with adversaries and competitors but with with our"
    },
    {
      "Time_Start": 2964.4,
      "Time_End": 2969.4,
      "Text": " own allies uh in a free market to who can do it cheaper and you know more security does not"
    },
    {
      "Time_Start": 2972.6800000000003,
      "Time_End": 2977.6800000000003,
      "Text": " equal cheaper that that equation generally doesn't balance um so the more we we increase"
    },
    {
      "Time_Start": 2980.1200000000003,
      "Time_End": 2985.1200000000003,
      "Text": " regulation um we have to be mindful in terms of US federal regulation that it has to apply on"
    },
    {
      "Time_Start": 2987.98,
      "Time_End": 2992.8,
      "Text": " every ship that calls on the United States not just US shipping or we're gonna hurt"
    },
    {
      "Time_Start": 2992.82,
      "Time_End": 2999.0600000000004,
      "Text": " ourselves and and uh you know the the US merchant marine is already at a kind of historic low"
    },
    {
      "Time_Start": 2999.0600000000004,
      "Time_End": 3004.1400000000003,
      "Text": " point of capacity uh we need to be mindful while we try to increase security that we don't"
    },
    {
      "Time_Start": 3004.1400000000003,
      "Time_End": 3009.1400000000003,
      "Text": " make that worse. Just from a uh sort of a guns and bombs perspective um the the pace and the"
    },
    {
      "Time_Start": 3015.1400000000003,
      "Time_End": 3018.42,
      "Text": " kinds of technologies and the pace in which we purchase them and the kinds of things we're"
    },
    {
      "Time_Start": 3018.44,
      "Time_End": 3023.44,
      "Text": " trying to do um means we're outrunning most of our partners and allies in the process and"
    },
    {
      "Time_Start": 3026.08,
      "Time_End": 3029.42,
      "Text": " so that yeah it doesn't look doesn't doesn't look good it's not looking good for"
    },
    {
      "Time_Start": 3029.42,
      "Time_End": 3034.7200000000003,
      "Text": " harmonization um in part because of the way in which uh at least from the military"
    },
    {
      "Time_Start": 3034.7200000000003,
      "Time_End": 3039.86,
      "Text": " perspective the way in which the United States uh thinks about technology and its role in"
    },
    {
      "Time_Start": 3039.86,
      "Time_End": 3044.64,
      "Text": " conflict and so it's always the biggest the the faster the the further the shooting which"
    },
    {
      "Time_Start": 3044.66,
      "Time_End": 3050.3199999999997,
      "Text": " means we're outrunning all of our allies who can barely afford those kinds of things and so"
    },
    {
      "Time_Start": 3050.3199999999997,
      "Time_End": 3054.7,
      "Text": " yeah harmonization is uh I think from a from a from a military perspective I think is is quite"
    },
    {
      "Time_Start": 3054.7,
      "Time_End": 3059.7,
      "Text": " far off. Sorry I didn't want to say something now. Yeah I went in on a high note pal. So so"
    },
    {
      "Time_Start": 3066.24,
      "Time_End": 3070.3799999999997,
      "Text": " with that I want to I want to ask the audience to be very kind to sort of give my my"
    },
    {
      "Time_Start": 3070.38,
      "Time_End": 3075.4,
      "Text": " colleagues a round of applause. The best part about this is that we all leave through the"
    },
    {
      "Time_Start": 3081.2400000000002,
      "Time_End": 3086.44,
      "Text": " same door and so please pull us aside and ask more specific questions if you'd like to we're"
    },
    {
      "Time_Start": 3086.44,
      "Time_End": 3091.44,
      "Text": " very excited to engage. Thank you."
    }
  ]
}