{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.4,
      "Text": "This text was transcribed using whisper model: large-v2\n\n My name is Kuba Grecki. It's a huge honor to be the first speaker this year. Thank you,"
    },
    {
      "Time_Start": 14.4,
      "Time_End": 22.240000000000002,
      "Text": " Dorota and Andrzej for picking me to be actually the first person today. And today I will be"
    },
    {
      "Time_Start": 22.240000000000002,
      "Time_End": 28.88,
      "Text": " talking about how a smooth sea never made a skilled fisherman. I'll be talking about the"
    },
    {
      "Time_Start": 29.04,
      "Time_End": 37.6,
      "Text": " toolkits that the red teams use and how it should be much better than the bad guys are using."
    },
    {
      "Time_Start": 37.6,
      "Time_End": 43.76,
      "Text": " Because the bad guys' toolkits are evolving and it should be the same in general for the red teams."
    },
    {
      "Time_Start": 44.4,
      "Time_End": 50.08,
      "Text": " So quickly about me. My name is Kuba Grecki. I'm an offensive security tools developer,"
    },
    {
      "Time_Start": 50.8,
      "Time_End": 58.0,
      "Text": " also ex-MMO game hacker. I used to write bots for online games like 20 years ago where I learned"
    },
    {
      "Time_Start": 58.0,
      "Time_End": 66.08,
      "Text": " all the skills that I'm using today. I also run a blog that's at breakdev.org. I write about my"
    },
    {
      "Time_Start": 66.08,
      "Time_End": 72.88,
      "Text": " own research and also about the tools that I'm releasing and updating. I am the creator of Evil"
    },
    {
      "Time_Start": 72.88,
      "Time_End": 78.4,
      "Text": " Jinx, so you can also refer to me as that Evil Jinx guy like some people do, because that's what"
    },
    {
      "Time_Start": 78.4,
      "Time_End": 86.64,
      "Text": " I'm mostly just known for. And I'm also releasing Evil Jinx Pro this year. So this is also what the"
    },
    {
      "Time_Start": 86.64,
      "Time_End": 93.52,
      "Text": " talk will be mainly about. I've released Poundrop. It's like a Dropbox for red teams tool"
    },
    {
      "Time_Start": 94.08,
      "Time_End": 98.72,
      "Text": " that I released several years ago. It is unfortunately a bit outdated right now,"
    },
    {
      "Time_Start": 98.72,
      "Time_End": 104.0,
      "Text": " but I plan to do something about it and maybe integrate it with Evil Jinx at one point."
    },
    {
      "Time_Start": 104.8,
      "Time_End": 111.28,
      "Text": " Last year, I also started this community that's called BreakDev Red. It's a community for red"
    },
    {
      "Time_Start": 111.28,
      "Time_End": 118.32000000000001,
      "Text": " teamers, and I only allow people to join who actually exist, so no anonymous access. The"
    },
    {
      "Time_Start": 118.32000000000001,
      "Time_End": 124.4,
      "Text": " entrance is free, but basically every person that wants to join needs to be pre-approved"
    },
    {
      "Time_Start": 125.84,
      "Time_End": 131.52,
      "Text": " to maintain the quality of content and discussions inside and to make sure that"
    },
    {
      "Time_Start": 131.52,
      "Time_End": 139.28,
      "Text": " everyone is actually on the red teams inside. I have also released a course on how to use Evil"
    },
    {
      "Time_Start": 139.28,
      "Time_End": 144.72,
      "Text": " Jinx. I made the tool hard enough to use that I had to release the course to teach people how to"
    },
    {
      "Time_Start": 144.72,
      "Time_End": 150.16,
      "Text": " do it. And here I have to say a huge thank you to every one of you who actually bought the course."
    },
    {
      "Time_Start": 150.16,
      "Time_End": 155.68,
      "Text": " I know that there are some people in the audience here, because this actually makes it possible for"
    },
    {
      "Time_Start": 155.68,
      "Time_End": 162.32,
      "Text": " me to work on Evil Jinx Pro this year and also the last year, and this is actually why it's"
    },
    {
      "Time_Start": 162.32,
      "Time_End": 170.64,
      "Text": " possible to self-fund this whole project. As mentioned, it all started actually at ZipCon."
    },
    {
      "Time_Start": 171.51999999999998,
      "Time_End": 177.92,
      "Text": " Seven years ago, I had a lightning talk during the lunchtime break. It was like 15 minutes. It was my"
    },
    {
      "Time_Start": 177.92,
      "Time_End": 184.16,
      "Text": " first time at ZipCon, also my first cyber security conference, I believe, and also my first time"
    },
    {
      "Time_Start": 184.16,
      "Time_End": 191.04,
      "Text": " speaking. I had this Wi-Fi hacking hardware that was based on Raspberry Pi with connected"
    },
    {
      "Time_Start": 191.04,
      "Time_End": 197.6,
      "Text": " cables to it, and I was presenting it. And at the end, when I actually showed the credits and"
    },
    {
      "Time_Start": 198.56,
      "Time_End": 205.68,
      "Text": " other things I did, I mentioned briefly Evil Jinx that I released just like a month before."
    },
    {
      "Time_Start": 206.48,
      "Time_End": 213.35999999999999,
      "Text": " And after I actually ended the presentation, someone from the audience actually approached me"
    },
    {
      "Time_Start": 213.35999999999999,
      "Time_End": 219.51999999999998,
      "Text": " and told me, man, why didn't you actually talk about this project instead? So then I thought,"
    },
    {
      "Time_Start": 219.52,
      "Time_End": 225.60000000000002,
      "Text": " maybe there is something there. So then apparently a lot of people actually liked the project and"
    },
    {
      "Time_Start": 225.60000000000002,
      "Time_End": 232.16000000000003,
      "Text": " have been using it ever since, and then later I released Evil Jinx second version and the third"
    },
    {
      "Time_Start": 232.16000000000003,
      "Time_End": 238.88,
      "Text": " version. But what the talk is about is like defenses against phishing are evolving. Phishing"
    },
    {
      "Time_Start": 238.88,
      "Time_End": 244.48000000000002,
      "Text": " is getting harder. Black market phishing toolkits keep evolving, and the red teamers are essentially"
    },
    {
      "Time_Start": 244.48000000000002,
      "Time_End": 251.36,
      "Text": " left alone with open source toolkits that they have to somehow like glue up together and make it"
    },
    {
      "Time_Start": 251.36,
      "Time_End": 258.8,
      "Text": " work, and there's a lot of effort that every red teamer has to put into making all the open source"
    },
    {
      "Time_Start": 258.8,
      "Time_End": 267.12,
      "Text": " toolkits actually work that you probably know yourself. And I actually plan to help and solve"
    },
    {
      "Time_Start": 267.12,
      "Time_End": 274.08000000000004,
      "Text": " this problem for everyone, and this is with the release of Evil Jinx Pro that supposedly"
    },
    {
      "Time_Start": 274.15999999999997,
      "Time_End": 279.76,
      "Text": " will come sometime later this year, and I want to solve all the issues that actually red teams have"
    },
    {
      "Time_Start": 280.71999999999997,
      "Time_End": 288.47999999999996,
      "Text": " regarding the setup, the infrastructure, the maintenance as well for it, and also the"
    },
    {
      "Time_Start": 288.47999999999996,
      "Time_End": 294.0,
      "Text": " detection part. And the detection part regarding phishing, like Evil Jinx is a reverse phishing"
    },
    {
      "Time_Start": 294.0,
      "Time_End": 300.79999999999995,
      "Text": " framework, and the main issue with it is your links get detected, like there is like this red"
    },
    {
      "Time_Start": 301.52000000000004,
      "Time_End": 308.8,
      "Text": " red panel shown in Chrome when your phishing link is detected, and how to prevent"
    },
    {
      "Time_Start": 308.8,
      "Time_End": 314.96000000000004,
      "Text": " scanners from accessing it. And as well, first of all, I wanted to like address the elephant"
    },
    {
      "Time_Start": 314.96000000000004,
      "Time_End": 321.44,
      "Text": " in the room, like because I'm writing offensive security tools, so they are open source, and"
    },
    {
      "Time_Start": 321.44,
      "Time_End": 327.36,
      "Text": " I am also giving like the bad guys the capability to do the bad things. So what can we do? The bad"
    },
    {
      "Time_Start": 327.36,
      "Time_End": 334.24,
      "Text": " guys like phishing, the bad guys like free tools. Red teams need to simulate the bad guys, and the"
    },
    {
      "Time_Start": 334.24,
      "Time_End": 339.36,
      "Text": " red teams also need the better tools than the bad guys are actually using, but we cannot give the"
    },
    {
      "Time_Start": 339.36,
      "Time_End": 344.96000000000004,
      "Text": " bad guys the tools that the red teams have which would be better than they are using. So it's"
    },
    {
      "Time_Start": 344.96000000000004,
      "Time_End": 350.88,
      "Text": " basically will turn into a loop. So I was thinking how can I actually prevent that so that I can"
    },
    {
      "Time_Start": 350.88,
      "Time_End": 357.04,
      "Text": " create a tool that actually makes the red teamer lives easier, but not give it out to the bad guys."
    },
    {
      "Time_Start": 357.44,
      "Time_End": 363.28000000000003,
      "Text": " And that's why I created this break the red community, like I mentioned before, that's like"
    },
    {
      "Time_Start": 363.28000000000003,
      "Time_End": 370.96000000000004,
      "Text": " a vetted community for people who work specifically on red teams, and I know that they exist, and they"
    },
    {
      "Time_Start": 370.96000000000004,
      "Time_End": 377.04,
      "Text": " work for another company that is also red teaming. So it actually gives like this good environment"
    },
    {
      "Time_Start": 377.04,
      "Time_End": 384.0,
      "Text": " for people to share your TTPs and not be worried too much about them being used by bad actors,"
    },
    {
      "Time_Start": 384.0,
      "Time_End": 390.72,
      "Text": " and also Evil Jinx Pro will be only available once it releases to the people who actually join"
    },
    {
      "Time_Start": 391.6,
      "Time_End": 398.08,
      "Text": " the community. So here I want to jump in into what will be available in Evil Jinx Pro once it"
    },
    {
      "Time_Start": 398.08,
      "Time_End": 407.2,
      "Text": " releases. On the second part of the talk, I want to also focus on one of the technical"
    },
    {
      "Time_Start": 407.2,
      "Time_End": 412.16,
      "Text": " sites. So first one will be more like a bit of an advertisement about the features, and later I will"
    },
    {
      "Time_Start": 412.16,
      "Time_End": 419.28000000000003,
      "Text": " actually teach you something interesting. So first of all, I redid Evil Jinx to have a client"
    },
    {
      "Time_Start": 419.28000000000003,
      "Time_End": 425.04,
      "Text": " server architecture. So like you remember, Evil Jinx right now you have to SSH into a server,"
    },
    {
      "Time_Start": 425.04,
      "Time_End": 431.52000000000004,
      "Text": " configure it, and it's like a client and a server in one thing. So right now it's separated."
    },
    {
      "Time_Start": 431.52000000000004,
      "Time_End": 437.44000000000005,
      "Text": " We have a client that connects to several different servers on the outside,"
    },
    {
      "Time_Start": 437.44,
      "Time_End": 444.64,
      "Text": " and you can also deploy servers from the client. So there's like just one command that you just"
    },
    {
      "Time_Start": 444.64,
      "Time_End": 451.2,
      "Text": " set up the IP, your SSH key or the root password, set up the username, and you type in deploy,"
    },
    {
      "Time_Start": 451.2,
      "Time_End": 456.92,
      "Text": " it will automatically deploy to the server that you want. No need to SSH anymore to every server,"
    },
    {
      "Time_Start": 456.92,
      "Time_End": 462.64,
      "Text": " just to make sure that everything is working, and also I have added a multi-user collaboration. So"
    },
    {
      "Time_Start": 462.64,
      "Time_End": 470.47999999999996,
      "Text": " now if you have several people actually working on a specific set of on one campaign that for"
    },
    {
      "Time_Start": 470.47999999999996,
      "Time_End": 478.36,
      "Text": " example encapsulates several servers, they can all connect to one server, and one person can"
    },
    {
      "Time_Start": 478.36,
      "Time_End": 484.4,
      "Text": " create lures like set up the campaign, set up the fishlets, the other one can actually start"
    },
    {
      "Time_Start": 484.4,
      "Time_End": 489.8,
      "Text": " preparing different things, and you can all see the actions in real time together what you are"
    },
    {
      "Time_Start": 489.8,
      "Time_End": 499.08,
      "Text": " doing. It's like similar like a team server on any kind of C2 framework. So I have also been"
    },
    {
      "Time_Start": 499.08,
      "Time_End": 505.6,
      "Text": " thinking about how to hide the API. There's also like a public API that's being exposed, and you"
    },
    {
      "Time_Start": 505.6,
      "Time_End": 512.8,
      "Text": " have to use a special SNI host name to connect to Evil Jinx on port 443, so like the whole API is"
    },
    {
      "Time_Start": 512.8,
      "Time_End": 518.84,
      "Text": " pretty well hidden, because if someone doesn't know the randomly generated host name, they will"
    },
    {
      "Time_Start": 518.84,
      "Time_End": 524.52,
      "Text": " not be able to access this API. This is probably like a technical detail that I'll explain sometime"
    },
    {
      "Time_Start": 524.52,
      "Time_End": 532.44,
      "Text": " later. This is a set of commands that should deploy one server that you want. So you basically"
    },
    {
      "Time_Start": 532.44,
      "Time_End": 539.0,
      "Text": " just add a server with the IP and its name, then you register it with the server, which is the"
    },
    {
      "Time_Start": 539.0,
      "Time_End": 545.6,
      "Text": " licensing server, and then you type in deploy, and that should be it. Now also Evil Jinx, because"
    },
    {
      "Time_Start": 545.6,
      "Time_End": 552.2,
      "Text": " it's a client server, it has a client server architecture, it has the full API that's accessible"
    },
    {
      "Time_Start": 552.2,
      "Time_End": 557.76,
      "Text": " through HTTP requests or persistent web socket connections, and here's like a sample of the"
    },
    {
      "Time_Start": 557.76,
      "Time_End": 563.6,
      "Text": " response that you get from the Evil Jinx server to grab the list of sessions. So I'm really eager"
    },
    {
      "Time_Start": 563.6,
      "Time_End": 570.6,
      "Text": " to see if the community in the future will try to use it to automate some of the stuff that"
    },
    {
      "Time_Start": 570.6,
      "Time_End": 579.8000000000001,
      "Text": " Evil Jinx is doing, and maybe like use some kind of this AI hype to do phishing automation or"
    },
    {
      "Time_Start": 579.8000000000001,
      "Time_End": 587.32,
      "Text": " whatever. There's also Evil Puppet, which is the module that I also talked about last year. This is"
    },
    {
      "Time_Start": 587.32,
      "Time_End": 592.6,
      "Text": " like a background browser that's controllable with phishlets, and essentially what"
    },
    {
      "Time_Start": 592.6,
      "Time_End": 597.84,
      "Text": " it allows you, it allows you to extract specific shadow tokens from the legitimate session that's"
    },
    {
      "Time_Start": 597.84,
      "Time_End": 607.4,
      "Text": " running in the background. I covered it a bit in the other talks, but here you can see that it will"
    },
    {
      "Time_Start": 607.4,
      "Time_End": 614.1600000000001,
      "Text": " trigger on when the phished user is actually approaching this path that is being outlined"
    },
    {
      "Time_Start": 614.1600000000001,
      "Time_End": 621.6800000000001,
      "Text": " here, it will open the login page in the background browser, grab the username that the user entered"
    },
    {
      "Time_Start": 621.8000000000001,
      "Time_End": 628.1600000000001,
      "Text": " in real-time on the phishing session in their own browser, then type it in and also type in"
    },
    {
      "Time_Start": 628.1600000000001,
      "Time_End": 634.84,
      "Text": " the password and later click the button to submit, and once the post request actually is initiated,"
    },
    {
      "Time_Start": 634.84,
      "Time_End": 641.96,
      "Text": " it will grab this shadow token that is crucial to inject into the reverse proxy session to not"
    },
    {
      "Time_Start": 641.96,
      "Time_End": 647.44,
      "Text": " get the account blocked, because it contains browser telemetry that has to be retrieved from"
    },
    {
      "Time_Start": 647.44,
      "Time_End": 654.1600000000001,
      "Text": " the legitimate browser. That should probably be a separate talk, so I'll just talk about it a bit"
    },
    {
      "Time_Start": 654.1600000000001,
      "Time_End": 661.84,
      "Text": " briefly here. There's also a reverse proxy as a website spoofer, so for now all of the unauthorised"
    },
    {
      "Time_Start": 661.84,
      "Time_End": 669.44,
      "Text": " requests to Evil Jinx actually resulted in the redirection to the rickroll video or the"
    },
    {
      "Time_Start": 669.44,
      "Time_End": 676.6800000000001,
      "Text": " other website that you specified, but this time you can actually proxy another website the same way"
    },
    {
      "Time_Start": 676.84,
      "Time_End": 683.6,
      "Text": " as in general Evil Jinx works, it will reverse proxy the content from another website and show"
    },
    {
      "Time_Start": 683.6,
      "Time_End": 690.9200000000001,
      "Text": " it in context of the phishing domain that you are using. So this is a bit more convenient because"
    },
    {
      "Time_Start": 690.9200000000001,
      "Time_End": 698.6,
      "Text": " it allows you to present that your phishing domain is actually hosting a legitimate website and you"
    },
    {
      "Time_Start": 698.6,
      "Time_End": 703.5600000000001,
      "Text": " don't have to put like some kind of static content that can be easily fingerprintable, you can"
    },
    {
      "Time_Start": 703.5600000000001,
      "Time_End": 709.96,
      "Text": " specify whichever URL you want. So here as an example I use the Cameron's World website that"
    },
    {
      "Time_Start": 709.96,
      "Time_End": 718.5200000000001,
      "Text": " is being proxied through linkedin.fake.com. Another thing, TLS wildcard certificates, so you know that"
    },
    {
      "Time_Start": 718.5200000000001,
      "Time_End": 725.6400000000001,
      "Text": " Evil Jinx currently is able to retrieve and renew certificates from Let's Encrypt, but all the TLS"
    },
    {
      "Time_Start": 725.6400000000001,
      "Time_End": 733.0400000000001,
      "Text": " certificates are registered for the full hostname with the subdomain, and this is actually an issue"
    },
    {
      "Time_Start": 733.28,
      "Time_End": 740.28,
      "Text": " because every time you ever register a TLS certificate, maybe some of you don't know because"
    },
    {
      "Time_Start": 740.28,
      "Time_End": 747.3199999999999,
      "Text": " I didn't know before, this certificate gets published in the TLS transparency log which is"
    },
    {
      "Time_Start": 747.3199999999999,
      "Time_End": 754.0799999999999,
      "Text": " publicly accessible worldwide. So all of the bots and scanners that try to look for phishing URLs"
    },
    {
      "Time_Start": 754.0799999999999,
      "Time_End": 761.64,
      "Text": " and scan the phishing links will retrieve the domains from there and start looking if this is"
    },
    {
      "Time_Start": 761.72,
      "Time_End": 768.1999999999999,
      "Text": " a website that's hosting a fake login page or whatever, and that's when the scanning begins."
    },
    {
      "Time_Start": 768.1999999999999,
      "Time_End": 775.84,
      "Text": " So with the wildcard certificates this problem just vanishes because the wildcard certificate"
    },
    {
      "Time_Start": 775.84,
      "Time_End": 784.6,
      "Text": " will hide the subdomain that you are using in your hostname, so the bots would have to brute"
    },
    {
      "Time_Start": 784.76,
      "Time_End": 791.24,
      "Text": " force the subdomain to find your hostname. So this actually prevents the majority of"
    },
    {
      "Time_Start": 791.24,
      "Time_End": 798.4,
      "Text": " scannings from the bots worldwide. There is also automated JavaScript obfuscation implemented. I"
    },
    {
      "Time_Start": 798.4,
      "Time_End": 807.5600000000001,
      "Text": " use the engine that's hosted on obfuscator.io, and every injected script into the landing page"
    },
    {
      "Time_Start": 807.5600000000001,
      "Time_End": 814.2,
      "Text": " that you're using in your phishlets, or it's JavaScript that's injected to handle the redirection"
    },
    {
      "Time_Start": 814.32,
      "Time_End": 821.12,
      "Text": " to the real website afterwards, after the phishing is a success, every script is actually"
    },
    {
      "Time_Start": 821.12,
      "Time_End": 826.36,
      "Text": " dynamically obfuscated. It's cached for five minutes and then it re-obfuscates it, but it"
    },
    {
      "Time_Start": 826.36,
      "Time_End": 832.4000000000001,
      "Text": " actually prevents any kind of scanners to fingerprint the scripts that you want to"
    },
    {
      "Time_Start": 832.4000000000001,
      "Time_End": 838.48,
      "Text": " inject into your phishing landing pages and protect them from signature matching."
    },
    {
      "Time_Start": 838.48,
      "Time_End": 846.36,
      "Text": " Then I have also rewritten the database to SQLite. Before it was BundDB, it was a long"
    },
    {
      "Time_Start": 846.36,
      "Time_End": 855.28,
      "Text": " time ago before actually there was no SQL driver for Go to be written natively. You had to use C"
    },
    {
      "Time_Start": 855.28,
      "Time_End": 863.6,
      "Text": " and compile it through the C libraries and it would then rely on the libc version, so it was"
    },
    {
      "Time_Start": 863.6,
      "Time_End": 868.64,
      "Text": " hard to make one binary that would work on all distributions, so, sorry, Melvin, I don't know"
    },
    {
      "Time_Start": 868.64,
      "Time_End": 874.72,
      "Text": " if Melvin made it today, but you will have to probably rewrite the bobber. This is like a very"
    },
    {
      "Time_Start": 874.72,
      "Time_End": 880.8000000000001,
      "Text": " nice thing that Melvin from TrustedSec actually released and made like this triforce of free"
    },
    {
      "Time_Start": 880.8000000000001,
      "Time_End": 886.72,
      "Text": " tools working together, and it was reliant on actually retrieving the data from the BundDB"
    },
    {
      "Time_Start": 886.8000000000001,
      "Time_End": 894.4,
      "Text": " database. Another thing, it's the external DNS management. For now, Evil Jinx had a local name"
    },
    {
      "Time_Start": 894.4,
      "Time_End": 902.88,
      "Text": " server working on the same host as the phishing server, so you had to point the domain, the"
    },
    {
      "Time_Start": 902.88,
      "Time_End": 908.24,
      "Text": " phishing domain that you registered, you had to point the name servers to the IP of the Evil Jinx"
    },
    {
      "Time_Start": 908.24,
      "Time_End": 915.28,
      "Text": " server, which was kind of suspicious and probably if someone looked into it, it would be pretty"
    },
    {
      "Time_Start": 915.28,
      "Time_End": 921.6,
      "Text": " much easy to tell that it is like a phishing instance that's just hosting the name server on"
    },
    {
      "Time_Start": 921.6,
      "Time_End": 928.64,
      "Text": " the same IP as the phishing server, and now you can actually avoid that, and Evil Jinx supports"
    },
    {
      "Time_Start": 930.0799999999999,
      "Time_End": 940.56,
      "Text": " the use of external DNS providers like CloudFlare, DigitalOcean and Route53 for now, AWS and more"
    },
    {
      "Time_Start": 941.2800000000001,
      "Time_End": 948.6400000000001,
      "Text": " will come, so basically all of this is doable through the libDNS library that actually provides"
    },
    {
      "Time_Start": 948.6400000000001,
      "Time_End": 955.2,
      "Text": " like this interface for any API that I can put into it, so let me know later if there is any"
    },
    {
      "Time_Start": 955.2,
      "Time_End": 961.84,
      "Text": " DNS provider that you want implemented that you are using on a daily basis, and this will give me"
    },
    {
      "Time_Start": 961.84,
      "Time_End": 969.6800000000001,
      "Text": " a great feedback. And now we go into JA4 signature spoofing, so first of all I wanted to ask how"
    },
    {
      "Time_Start": 969.6800000000001,
      "Time_End": 977.5200000000001,
      "Text": " many of you know what is JA4 or JA3? Okay, great, that may be interesting, so this is something"
    },
    {
      "Time_Start": 978.32,
      "Time_End": 986.96,
      "Text": " that came up like a pretty new thing, so basically it is used to fingerprint the software that is"
    },
    {
      "Time_Start": 989.6800000000001,
      "Time_End": 996.5600000000001,
      "Text": " initiating the TLS handshake and establishing the TLS connection, so what I did, I implemented the"
    },
    {
      "Time_Start": 996.5600000000001,
      "Time_End": 1002.32,
      "Text": " spoofing of this, but let's dive now deeper to the more technical part of this talk and talk more"
    },
    {
      "Time_Start": 1002.32,
      "Time_End": 1011.2800000000001,
      "Text": " about JA4. So JA4 plus is essentially like a suite of network fingerprinting algorithms, you could"
    },
    {
      "Time_Start": 1011.2800000000001,
      "Time_End": 1016.0000000000001,
      "Text": " say, like it generates signatures for several different types of handshakes that you can use,"
    },
    {
      "Time_Start": 1016.0000000000001,
      "Time_End": 1021.6800000000001,
      "Text": " but we will be focusing in this talk only on the TLS handshake, and more specifically,"
    },
    {
      "Time_Start": 1022.24,
      "Time_End": 1029.04,
      "Text": " of course I have to credit, it was made by John Althaus, the JA4 from Fox IO, a really great guy,"
    },
    {
      "Time_Start": 1029.04,
      "Time_End": 1036.64,
      "Text": " I talked to him briefly about a few things, and it is a successor to JA3, JA3 I think was"
    },
    {
      "Time_Start": 1037.2,
      "Time_End": 1045.2,
      "Text": " released by a different company before and now John is releasing JA4 under his own company,"
    },
    {
      "Time_Start": 1045.2,
      "Time_End": 1053.1200000000001,
      "Text": " if I'm not mistaken. So in general, the JA4 is a signature generated from the TLS handshake"
    },
    {
      "Time_Start": 1053.1200000000001,
      "Time_End": 1058.0,
      "Text": " client hello packet, so if you know, like this is the client hello packet,"
    },
    {
      "Time_Start": 1059.1200000000001,
      "Time_End": 1068.16,
      "Text": " gives the server the information, what is the TLS version it supports, what is the ALPN, so if the"
    },
    {
      "Time_Start": 1068.16,
      "Time_End": 1076.5600000000002,
      "Text": " client that's initiating the TLS connection supports HTTP 1.1 or does it also support HTTP"
    },
    {
      "Time_Start": 1076.5600000000002,
      "Time_End": 1085.52,
      "Text": " 2 or even QUIC, that is also embedded in this client hello packet. It lists all the supported"
    },
    {
      "Time_Start": 1085.52,
      "Time_End": 1093.92,
      "Text": " cipher suites with which the secure communication will be established, and it also lists the list"
    },
    {
      "Time_Start": 1093.92,
      "Time_End": 1098.0,
      "Text": " of TLS extensions that are used, and one of the TLS extensions that you probably are familiar"
    },
    {
      "Time_Start": 1098.0,
      "Time_End": 1105.28,
      "Text": " with is the SNI extension, which actually outputs the host name of the server that you are"
    },
    {
      "Time_Start": 1105.28,
      "Time_End": 1113.76,
      "Text": " connecting to, so basically it gives the firewalls the ability to tell what domain the client is"
    },
    {
      "Time_Start": 1113.76,
      "Time_End": 1119.28,
      "Text": " trying to connect to before the connection is actually encrypted, so this is sent in plain text"
    },
    {
      "Time_Start": 1119.28,
      "Time_End": 1127.84,
      "Text": " so it can be intercepted and scanned. This is how the JA4 fingerprint signature looks like,"
    },
    {
      "Time_Start": 1127.84,
      "Time_End": 1133.76,
      "Text": " it's basically divided into three sections, there is an A section, B section and a C section,"
    },
    {
      "Time_Start": 1133.76,
      "Time_End": 1142.24,
      "Text": " no pun intended, and the first section actually tells you what is the TCP, what is the protocol,"
    },
    {
      "Time_Start": 1142.24,
      "Time_End": 1150.48,
      "Text": " TLS version, if it supports SNI on the host name or the IP, number of cipher suites and the other"
    },
    {
      "Time_Start": 1150.48,
      "Time_End": 1156.24,
      "Text": " things. The second part, the B part is what we will be mostly focusing on, and this actually"
    },
    {
      "Time_Start": 1156.24,
      "Time_End": 1164.16,
      "Text": " tells what is the list of, it sorts the list of all the codes for all the cipher suites and"
    },
    {
      "Time_Start": 1165.1200000000001,
      "Time_End": 1174.96,
      "Text": " creates a signature, it hashes the full set of the list of these codes, and the third section"
    },
    {
      "Time_Start": 1174.96,
      "Time_End": 1181.68,
      "Text": " that we will not be focusing on is just the hash of all the extensions that are being sent in the"
    },
    {
      "Time_Start": 1181.68,
      "Time_End": 1189.52,
      "Text": " client hello packet. So this is a screenshot from Wireshark, and in Wireshark you can see that the"
    },
    {
      "Time_Start": 1189.6,
      "Time_End": 1194.8799999999999,
      "Text": " client hello packet, so this is basically the reading of what the client hello packet looks"
    },
    {
      "Time_Start": 1194.8799999999999,
      "Time_End": 1200.72,
      "Text": " like in Wireshark, you can take a look yourself when you have free time and this is where the"
    },
    {
      "Time_Start": 1200.72,
      "Time_End": 1207.84,
      "Text": " cipher suites are listed and this is the list of extensions. This is when I expanded the drop down,"
    },
    {
      "Time_Start": 1207.84,
      "Time_End": 1215.2,
      "Text": " you can see the codes for each cipher suite which are being used to generate this signature,"
    },
    {
      "Time_Start": 1215.2,
      "Time_End": 1221.2,
      "Text": " so the J4 in raw form, you can see the first section before the underscore is the same,"
    },
    {
      "Time_Start": 1221.2,
      "Time_End": 1226.88,
      "Text": " because it just has information about the other characteristics of the connection,"
    },
    {
      "Time_Start": 1226.88,
      "Time_End": 1233.1200000000001,
      "Text": " but the second B part is just a list of all of the codes for the cipher suites, and later it is,"
    },
    {
      "Time_Start": 1234.24,
      "Time_End": 1243.1200000000001,
      "Text": " there is I think the SHA256 hash I think taken out of it and truncated into 12 characters."
    },
    {
      "Time_Start": 1244.0800000000002,
      "Time_End": 1252.0000000000002,
      "Text": " So here let's take a look what are the most common applications, what are the J4 signatures,"
    },
    {
      "Time_Start": 1252.0000000000002,
      "Time_End": 1258.0800000000002,
      "Text": " and here you can take a look at Google Chrome for example which is take only look at the middle"
    },
    {
      "Time_Start": 1258.0800000000002,
      "Time_End": 1264.64,
      "Text": " section, at the B section, because the other ones will vary, will be different too often,"
    },
    {
      "Time_Start": 1265.2,
      "Time_End": 1270.88,
      "Text": " and what I want you to take a closer look at is the sliver malware and evil jinx,"
    },
    {
      "Time_Start": 1271.68,
      "Time_End": 1277.92,
      "Text": " like you can tell that the middle section is the same, and the funny thing is they are both"
    },
    {
      "Time_Start": 1277.92,
      "Time_End": 1284.5600000000002,
      "Text": " written in Go language, so they use the same Go TLS library which has the same list of supported"
    },
    {
      "Time_Start": 1284.5600000000002,
      "Time_End": 1290.3200000000002,
      "Text": " cipher suites and if you do not change it you can basically fingerprint every software that's"
    },
    {
      "Time_Start": 1290.3200000000002,
      "Time_End": 1297.0400000000002,
      "Text": " connecting to you that was written in Go language, so this is like a clear way to block evil jinx"
    },
    {
      "Time_Start": 1297.04,
      "Time_End": 1303.28,
      "Text": " from talking to the destination server that attackers are trying to attack."
    },
    {
      "Time_Start": 1304.3999999999999,
      "Time_End": 1311.92,
      "Text": " So scouting for prey, the Google Chrome J4B signature is this one, you can remember it"
    },
    {
      "Time_Start": 1311.92,
      "Time_End": 1318.8799999999999,
      "Text": " because it will be mentioned later in the talk, there is also this Golang signature that I"
    },
    {
      "Time_Start": 1318.8799999999999,
      "Time_End": 1326.48,
      "Text": " mentioned, and you can think like who actually uses J3 or J4, is there any service, and basically"
    },
    {
      "Time_Start": 1327.2,
      "Time_End": 1333.04,
      "Text": " Cloudflare of course is using it, I had an issue with evil jinx previously, I think like a year"
    },
    {
      "Time_Start": 1333.04,
      "Time_End": 1340.4,
      "Text": " ago when I did some tests, and whenever a page was actually protected with Cloudflare, immediately"
    },
    {
      "Time_Start": 1340.4,
      "Time_End": 1346.24,
      "Text": " when I went into the phishing page that was proxied by evil jinx I got presented with the"
    },
    {
      "Time_Start": 1347.28,
      "Time_End": 1353.1200000000001,
      "Text": " captcha that I had to solve, and I had no idea why or how exactly it is happening because it"
    },
    {
      "Time_Start": 1353.1200000000001,
      "Time_End": 1359.44,
      "Text": " made no sense, and later when I actually customised and modified several of the cipher"
    },
    {
      "Time_Start": 1359.44,
      "Time_End": 1365.68,
      "Text": " suites that the Go is using and I just added I think two, removed a few, then this captcha"
    },
    {
      "Time_Start": 1365.68,
      "Time_End": 1371.2800000000002,
      "Text": " stopped appearing, so it actually proven to me that Cloudflare is doing this kind of thing,"
    },
    {
      "Time_Start": 1372.0800000000002,
      "Time_End": 1378.96,
      "Text": " scanning for J3 or J4 signatures. So what can be done in terms of the attackers, how can we"
    },
    {
      "Time_Start": 1379.52,
      "Time_End": 1388.8,
      "Text": " prevent the hunters from basically, well not the hunters, but how can we prevent the destination"
    },
    {
      "Time_Start": 1388.8,
      "Time_End": 1393.6000000000001,
      "Text": " server from knowing that they are using evil jinx. So this is basically what I mentioned,"
    },
    {
      "Time_Start": 1393.6000000000001,
      "Time_End": 1400.56,
      "Text": " you can modify the list of supported TLS ciphers if you need, and also there is this UTLS library"
    },
    {
      "Time_Start": 1400.56,
      "Time_End": 1406.56,
      "Text": " that I implemented into evil jinx pro that basically will randomise the list of cipher"
    },
    {
      "Time_Start": 1406.6399999999999,
      "Time_End": 1412.6399999999999,
      "Text": " suites every time the connection is made to prevent any kind of, any form of blacklisting"
    },
    {
      "Time_Start": 1412.6399999999999,
      "Time_End": 1418.72,
      "Text": " of the J4 signature. So it gives you different J4 signatures with every TLS connection,"
    },
    {
      "Time_Start": 1419.84,
      "Time_End": 1427.44,
      "Text": " and it's also good to avoid J4 blacklists. So this is enough until defenders deploy more advanced"
    },
    {
      "Time_Start": 1427.44,
      "Time_End": 1432.96,
      "Text": " detections, and probably they will, I even have a few ideas, maybe not a good idea to share them"
    },
    {
      "Time_Start": 1432.96,
      "Time_End": 1440.24,
      "Text": " right now, but there is also another option when a client connects to the phishing server which"
    },
    {
      "Time_Start": 1440.24,
      "Time_End": 1447.52,
      "Text": " hosts evil jinx, you can actually grab the TLS client hello packet that's coming from the client's"
    },
    {
      "Time_Start": 1447.52,
      "Time_End": 1452.8,
      "Text": " browser, and you can copy the list of the cipher suites into the connection that evil jinx is"
    },
    {
      "Time_Start": 1452.8,
      "Time_End": 1460.08,
      "Text": " making to the destination server, so that it actually mimics the client, the real client to"
    },
    {
      "Time_Start": 1460.3999999999999,
      "Time_End": 1470.1599999999999,
      "Text": " the server. So what, then I get, I had the idea, if the servers can actually detect evil jinx,"
    },
    {
      "Time_Start": 1471.12,
      "Time_End": 1478.0,
      "Text": " what about actually detecting who is connecting to evil jinx itself, like all the bots that are"
    },
    {
      "Time_Start": 1478.0,
      "Time_End": 1483.36,
      "Text": " actually scanning the phishing links and things like, is it possible to actually harness the power"
    },
    {
      "Time_Start": 1483.3600000000001,
      "Time_End": 1492.64,
      "Text": " of J4 to actually make it in reverse and make the hunters become the hunted? So then you basically"
    },
    {
      "Time_Start": 1492.64,
      "Time_End": 1502.64,
      "Text": " have evil jinx becoming the defender, and the tables have turned. So basically I decided that"
    },
    {
      "Time_Start": 1502.64,
      "Time_End": 1507.8400000000001,
      "Text": " it would be maybe a good idea to reinvent the wheel, because why not? Like it's always a great"
    },
    {
      "Time_Start": 1507.84,
      "Time_End": 1514.48,
      "Text": " idea. So Cloudflare is already great at detecting the bots. This is like their entire business model."
    },
    {
      "Time_Start": 1514.48,
      "Time_End": 1520.56,
      "Text": " So basically let's try to see what Cloudflare is great at, and do the same thing."
    },
    {
      "Time_Start": 1520.56,
      "Time_End": 1526.6399999999999,
      "Text": " There is a Cloudflare turnstile that you can use with evil jinx. This is like mainly"
    },
    {
      "Time_Start": 1527.1999999999998,
      "Time_End": 1535.52,
      "Text": " their service to detect bots in real time to prevent you also from showing the capture."
    },
    {
      "Time_Start": 1535.52,
      "Time_End": 1542.0,
      "Text": " It only shows the capture whenever it detects some anomalies. You can check it out. I made"
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1546.8799999999999,
      "Text": " like a proof of concept that you can actually use turnstile with evil jinx as a redirector, so it"
    },
    {
      "Time_Start": 1546.8799999999999,
      "Time_End": 1553.6,
      "Text": " will protect your phishing pages with turnstile. But why not implement our own bot guard that would"
    },
    {
      "Time_Start": 1553.6,
      "Time_End": 1560.8799999999999,
      "Text": " be available in evil jinx pro like by default? And behold, it's a poor man's Cloudflare idea. So it's"
    },
    {
      "Time_Start": 1560.88,
      "Time_End": 1567.2,
      "Text": " like a very cheap version probably, but I decided to do it properly and prepare with some kind of"
    },
    {
      "Time_Start": 1567.2,
      "Time_End": 1572.4,
      "Text": " research. So I forked the Go vhost library that I've been using to extract the host names from"
    },
    {
      "Time_Start": 1572.4,
      "Time_End": 1579.2,
      "Text": " the SNI extension data, and I added the code to generate J4 signatures for every connection that's"
    },
    {
      "Time_Start": 1579.2,
      "Time_End": 1584.48,
      "Text": " actually coming into evil jinx, because the code for Go was not publicly available, so I used"
    },
    {
      "Time_Start": 1584.48,
      "Time_End": 1591.04,
      "Text": " the documentation that John outhouse published and wrote my own signature calculation"
    },
    {
      "Time_Start": 1592.16,
      "Time_End": 1598.72,
      "Text": " code. And then I set up the logging so that every time I got the connection to evil jinx, I would"
    },
    {
      "Time_Start": 1598.72,
      "Time_End": 1606.48,
      "Text": " log the IP J4, some additional telemetry that I will talk about a bit later. And then I will have"
    },
    {
      "Time_Start": 1606.48,
      "Time_End": 1612.16,
      "Text": " some data set to analyze later. Later, I also disabled the usage of wildcard certificates,"
    },
    {
      "Time_Start": 1612.16,
      "Time_End": 1616.96,
      "Text": " because like I told you, if you don't use wildcard certificates, the bots will immediately"
    },
    {
      "Time_Start": 1616.96,
      "Time_End": 1624.0800000000002,
      "Text": " start scanning your server. And that was my that's what I wanted to do for a change. So basically,"
    },
    {
      "Time_Start": 1624.0800000000002,
      "Time_End": 1631.8400000000001,
      "Text": " I wanted every bot to scan my website while I was gathering as much data as possible. I also"
    },
    {
      "Time_Start": 1631.8400000000001,
      "Time_End": 1638.64,
      "Text": " uploaded the phishing link to every URL scanning service I could find like virus total, others"
    },
    {
      "Time_Start": 1639.3600000000001,
      "Time_End": 1644.88,
      "Text": " that I found randomly on the on the internet. And then I waited. So I gathered the data for a bit"
    },
    {
      "Time_Start": 1644.88,
      "Time_End": 1652.72,
      "Text": " like one month. And what were the results, I got like a total of 820 requests to my phishing links,"
    },
    {
      "Time_Start": 1652.72,
      "Time_End": 1658.48,
      "Text": " and also to phishing domains, and they came from 680 unique IP. So you can see like, what is the"
    },
    {
      "Time_Start": 1658.48,
      "Time_End": 1664.8000000000002,
      "Text": " percentage of unique IP is being used. And this actually also proven to me that IP blacklisting"
    },
    {
      "Time_Start": 1664.8,
      "Time_End": 1672.3999999999999,
      "Text": " is that these days, it's like, I even saw one bot scanning my, my page in real time, it was"
    },
    {
      "Time_Start": 1672.3999999999999,
      "Time_End": 1677.84,
      "Text": " scanning this spoof page that I was actually retrieving from the external resource. And it"
    },
    {
      "Time_Start": 1677.84,
      "Time_End": 1685.28,
      "Text": " was scanning every single URL it found in the HTML content. And the origin IP was different with"
    },
    {
      "Time_Start": 1685.28,
      "Time_End": 1692.32,
      "Text": " every request. So they are definitely using IP rotating services. So IP blacklisting basically"
    },
    {
      "Time_Start": 1692.32,
      "Time_End": 1699.28,
      "Text": " makes no sense these days. I've also logged the ASNs for every IP that I got just in case I could"
    },
    {
      "Time_Start": 1699.28,
      "Time_End": 1705.9199999999998,
      "Text": " see some kind of maybe patterns of what organisations use what IP ranges and maybe just"
    },
    {
      "Time_Start": 1705.9199999999998,
      "Time_End": 1713.4399999999998,
      "Text": " scan I don't know, I saw Palo Alto, ASN or others, but essentially, there were too many to make any"
    },
    {
      "Time_Start": 1713.4399999999998,
      "Time_End": 1721.04,
      "Text": " kind of reliable information out of it. And here like a plug for IP info, like thanks to these"
    },
    {
      "Time_Start": 1721.04,
      "Time_End": 1730.56,
      "Text": " guys, because they release free databases of ASNs and also IP to get a location which they"
    },
    {
      "Time_Start": 1730.56,
      "Time_End": 1735.04,
      "Text": " update daily and you can just download it so and use it in your own projects, which is pretty"
    },
    {
      "Time_Start": 1735.04,
      "Time_End": 1743.2,
      "Text": " amazing. So the most popular J4B signatures that I encountered during this test, and this is"
    },
    {
      "Time_Start": 1743.2,
      "Time_End": 1750.1599999999999,
      "Text": " actually pretty, it was actually pretty sad to see because 80% of all requests came from Google"
    },
    {
      "Time_Start": 1750.24,
      "Time_End": 1757.1200000000001,
      "Text": " Chrome, which they had like the J4B signature, there were only like 11% of requests originating"
    },
    {
      "Time_Start": 1757.68,
      "Time_End": 1763.52,
      "Text": " from Go software and the Google bot because it advertised itself in the user agent was just"
    },
    {
      "Time_Start": 1763.52,
      "Time_End": 1770.72,
      "Text": " 1% and it also has the unique J4 signature. So the result, it was a partial failure."
    },
    {
      "Time_Start": 1771.68,
      "Time_End": 1778.4,
      "Text": " The J4 signatures on their own are not enough to detect bots, unfortunately, because most bots use"
    },
    {
      "Time_Start": 1778.4,
      "Time_End": 1783.44,
      "Text": " the Chrome engine, like the headless browsers and things like that. But then I had a new idea,"
    },
    {
      "Time_Start": 1783.44,
      "Time_End": 1790.0,
      "Text": " like all the phish users that you are actually attacking as a red team must have JavaScript"
    },
    {
      "Time_Start": 1790.0,
      "Time_End": 1794.4,
      "Text": " enabled because otherwise the login page will not work, like JavaScript is everywhere these days."
    },
    {
      "Time_Start": 1794.4,
      "Time_End": 1800.88,
      "Text": " So it is safe to assume that JavaScript will always be available on the target system. How"
    },
    {
      "Time_Start": 1800.88,
      "Time_End": 1806.4,
      "Text": " many bots actually are able to run JavaScript? And that's what I wanted to find out. So before"
    },
    {
      "Time_Start": 1806.4,
      "Time_End": 1813.68,
      "Text": " I also started this, I started gathering telemetry through the injected JavaScript"
    },
    {
      "Time_Start": 1813.68,
      "Time_End": 1820.88,
      "Text": " that I had in every landing page of my phishing server, and it would report back the telemetry"
    },
    {
      "Time_Start": 1820.88,
      "Time_End": 1825.92,
      "Text": " to the Evil Jinx server for analysis in real time, like through the AJAX request,"
    },
    {
      "Time_Start": 1825.92,
      "Time_End": 1832.0800000000002,
      "Text": " then Evil Jinx actually analyses it and then spits back information as a response, whether"
    },
    {
      "Time_Start": 1832.08,
      "Time_End": 1840.32,
      "Text": " it's allowed or not for this user to connect. And the question was, like, how many page views"
    },
    {
      "Time_Start": 1840.32,
      "Time_End": 1846.0,
      "Text": " out of this whole 820 resulted in telemetry data being sent back to the Evil Jinx server,"
    },
    {
      "Time_Start": 1846.0,
      "Time_End": 1852.8,
      "Text": " which meant how many of these bots actually did run JavaScript? And the answer was 35."
    },
    {
      "Time_Start": 1852.8,
      "Time_End": 1862.3999999999999,
      "Text": " So that was pretty amazing, like, how these bots work and how little of them actually have"
    },
    {
      "Time_Start": 1862.3999999999999,
      "Time_End": 1871.12,
      "Text": " JavaScript enabled. So then I began analysing browser telemetry that actually got returned"
    },
    {
      "Time_Start": 1872.96,
      "Time_End": 1878.32,
      "Text": " to Evil Jinx. So I decided to go for the low-hanging fruit because that probably would"
    },
    {
      "Time_Start": 1878.32,
      "Time_End": 1883.28,
      "Text": " result in the less false positives, and there were, like, really tons of... I also mentioned,"
    },
    {
      "Time_Start": 1883.28,
      "Time_End": 1890.0,
      "Text": " I think, there's the FP collect library that I used to collect this information in JavaScript."
    },
    {
      "Time_Start": 1891.2,
      "Time_End": 1899.2,
      "Text": " Then I decided to analyse the telemetry, and I would get the browser window size and the user"
    },
    {
      "Time_Start": 1899.2,
      "Time_End": 1906.72,
      "Text": " agent. For analysing the user agent, I used the UA parser library that you can see a link to here."
    },
    {
      "Time_Start": 1906.72,
      "Time_End": 1912.32,
      "Text": " It would only help me to grab the name of the browser, OS, and the version."
    },
    {
      "Time_Start": 1914.16,
      "Time_End": 1920.72,
      "Text": " So first I started with window size analysis. So that may seem a bit like a joke, but it was"
    },
    {
      "Time_Start": 1920.72,
      "Time_End": 1927.3600000000001,
      "Text": " actually interesting to see that most of the... so basically browser window is divided into two"
    },
    {
      "Time_Start": 1927.3600000000001,
      "Time_End": 1933.1200000000001,
      "Text": " specific sets. It's the inner window and the outer window. The inner window is what you see"
    },
    {
      "Time_Start": 1933.1200000000001,
      "Time_End": 1939.44,
      "Text": " except for the toolbar and the edges, I believe, and the outer window is what you have"
    },
    {
      "Time_Start": 1939.44,
      "Time_End": 1945.2,
      "Text": " as a full window of what you are running. And most of the bots actually"
    },
    {
      "Time_Start": 1947.2,
      "Time_End": 1953.8400000000001,
      "Text": " seems to be using a very generic screen dimensions, and they seem they all are running"
    },
    {
      "Time_Start": 1953.8400000000001,
      "Time_End": 1959.44,
      "Text": " in full screen mode. I tested on my own PC, and you can only get these kind of results if you"
    },
    {
      "Time_Start": 1959.52,
      "Time_End": 1967.6000000000001,
      "Text": " actually type in F11 in Chrome to put the page into full screen. So it was pretty unlikely"
    },
    {
      "Time_Start": 1968.24,
      "Time_End": 1974.72,
      "Text": " that you would be phishing a target who uses exclusively a browser in full screen mode. I"
    },
    {
      "Time_Start": 1974.72,
      "Time_End": 1979.76,
      "Text": " don't know if you maybe encountered any cases like that, but to me, it seems pretty unlikely."
    },
    {
      "Time_Start": 1979.76,
      "Time_End": 1984.88,
      "Text": " So this is like the first thing that I started to detect. Then there was also another case that"
    },
    {
      "Time_Start": 1984.88,
      "Time_End": 1989.5200000000002,
      "Text": " the outer window was actually smaller than the inner window. How is it possible? How can you"
    },
    {
      "Time_Start": 1989.5200000000002,
      "Time_End": 1997.8400000000001,
      "Text": " make the window smaller and the inner window bigger? That made no sense. So I started Googling"
    },
    {
      "Time_Start": 1997.8400000000001,
      "Time_End": 2004.64,
      "Text": " it a bit, and apparently you can do it when you zoom out the page with control and minus,"
    },
    {
      "Time_Start": 2006.0,
      "Time_End": 2013.44,
      "Text": " but then also the device pixel ratio gets below one, and every bot actually reported"
    },
    {
      "Time_Start": 2013.44,
      "Time_End": 2019.28,
      "Text": " that the device pixel ratio to be always one, and it never changed. So this was another"
    },
    {
      "Time_Start": 2019.28,
      "Time_End": 2024.4,
      "Text": " signature that something was suspicious about the browser that's connecting to your website."
    },
    {
      "Time_Start": 2026.3200000000002,
      "Time_End": 2034.0800000000002,
      "Text": " Another thing was a natural unrealistic window sizes. Outer window of size one pixel is pretty"
    },
    {
      "Time_Start": 2034.0800000000002,
      "Time_End": 2041.44,
      "Text": " much not possible. And then I began to do the browser version analysis, and I could see that"
    },
    {
      "Time_Start": 2041.44,
      "Time_End": 2048.48,
      "Text": " almost all, like I'm talking about 95 per cent probably of all browsers that ever contacted"
    },
    {
      "Time_Start": 2048.48,
      "Time_End": 2056.2400000000002,
      "Text": " Evil Jinx had outdated browser versions. So, defenders, if you're writing the bots, just"
    },
    {
      "Time_Start": 2056.2400000000002,
      "Time_End": 2062.0,
      "Text": " make sure to at least keep the user agent updated with all the updates, because it's really the"
    },
    {
      "Time_Start": 2062.0,
      "Time_End": 2067.52,
      "Text": " lowest hanging fruit, because it is very unlikely for any request to come from the browser that is"
    },
    {
      "Time_Start": 2068.24,
      "Time_End": 2075.92,
      "Text": " six months older or anything. Then there was this interesting case that I found, and I couldn't tell"
    },
    {
      "Time_Start": 2076.72,
      "Time_End": 2082.56,
      "Text": " what, how to, I knew that it is a bot, because it used the link that I specifically prepared for the"
    },
    {
      "Time_Start": 2082.56,
      "Time_End": 2091.28,
      "Text": " bots, and it actually reported an iPhone running the Safari browser connecting to my server,"
    },
    {
      "Time_Start": 2091.28,
      "Time_End": 2096.16,
      "Text": " and the window dimensions looked pretty okay. I don't know what are the dimensions of the iPhone"
    },
    {
      "Time_Start": 2096.7999999999997,
      "Time_End": 2102.7999999999997,
      "Text": " maybe you can figure out if something is fishy about it. Then the version was pretty up-to-date,"
    },
    {
      "Time_Start": 2103.6,
      "Time_End": 2109.52,
      "Text": " and I was thinking what else can I look into? So I looked at the other telemetry that was also"
    },
    {
      "Time_Start": 2109.52,
      "Time_End": 2115.52,
      "Text": " gathered, and I saw like the video card data. The video card was made by Google, and it was"
    },
    {
      "Time_Start": 2115.52,
      "Time_End": 2121.3599999999997,
      "Text": " angled, and I later Googled this angle thing, and I think I saw, if I remember correctly, it was only"
    },
    {
      "Time_Start": 2121.44,
      "Time_End": 2130.1600000000003,
      "Text": " for Android devices, essentially, and then I also compared it with the JA4 signature that I also"
    },
    {
      "Time_Start": 2130.1600000000003,
      "Time_End": 2134.7200000000003,
      "Text": " captured, and it told me that it was actually Chromium engine connecting, so it was not really"
    },
    {
      "Time_Start": 2134.7200000000003,
      "Time_End": 2141.6,
      "Text": " Safari on the iPhone. I could tell by cross-checking all this data that I gathered that it was actually"
    },
    {
      "Time_Start": 2141.6,
      "Time_End": 2148.8,
      "Text": " a fake user agent. So it was not Safari really. So the real detection power comes from cross-checking"
    },
    {
      "Time_Start": 2148.8,
      "Time_End": 2154.7200000000003,
      "Text": " all this data through the all different sensors. So JA4 actually was not useless in this situation."
    },
    {
      "Time_Start": 2154.7200000000003,
      "Time_End": 2164.0800000000004,
      "Text": " It serves as a really great addition to what you can do for detecting the bots. So here I set up"
    },
    {
      "Time_Start": 2164.0800000000004,
      "Time_End": 2169.6800000000003,
      "Text": " a bit of like a customisation for Evil Jinx Pro where you can set up your own YAML script and to"
    },
    {
      "Time_Start": 2169.68,
      "Time_End": 2180.0,
      "Text": " blacklist specific JA4 signatures, or you can set up what versions of major browsers you allow,"
    },
    {
      "Time_Start": 2180.0,
      "Time_End": 2186.8799999999997,
      "Text": " and all of that will be, all the other requests will basically be shown this generic website that"
    },
    {
      "Time_Start": 2186.8799999999997,
      "Time_End": 2194.24,
      "Text": " you are redirecting from a different site to actually fool the user that there is no phishing"
    },
    {
      "Time_Start": 2194.2400000000002,
      "Time_End": 2204.7200000000003,
      "Text": " involved. So here I wanted to tell you to contact me later after the talk and let me know,"
    },
    {
      "Time_Start": 2205.5200000000004,
      "Time_End": 2210.32,
      "Text": " probably best to also contact me on the email with the subject ZipCon Breakdown. If you are on the"
    },
    {
      "Time_Start": 2210.32,
      "Time_End": 2215.0400000000004,
      "Text": " red team and you want to join the great community of red teamers and want to share information,"
    },
    {
      "Time_Start": 2215.6000000000004,
      "Time_End": 2222.32,
      "Text": " it would be great to have you, and everyone is invited, especially from the ZipCon crowd,"
    },
    {
      "Time_Start": 2222.32,
      "Time_End": 2226.0800000000004,
      "Text": " because then I can confirm you really exist, so it would be much easier."
    },
    {
      "Time_Start": 2227.1200000000003,
      "Time_End": 2232.88,
      "Text": " So Evil Jinx Pro is actually coming soon, later this year, and how much time do we have still"
    },
    {
      "Time_Start": 2232.88,
      "Time_End": 2241.52,
      "Text": " left? Ten minutes. Okay. So if we have ten minutes, I can actually show you maybe a small live demo,"
    },
    {
      "Time_Start": 2241.52,
      "Time_End": 2257.6,
      "Text": " if I manage to. Okay. So this is the client of Evil Jinx Pro. So you can see right now it is"
    },
    {
      "Time_Start": 2257.6,
      "Time_End": 2263.92,
      "Text": " running on the local machine, and I can actually list all the servers that are being supported by,"
    },
    {
      "Time_Start": 2264.2400000000002,
      "Time_End": 2272.2400000000002,
      "Text": " that are configured right now, and you will be able to connect to each one of them one by one."
    },
    {
      "Time_Start": 2272.2400000000002,
      "Time_End": 2282.4,
      "Text": " So here I connected to the local server, then I connect to another server that I have on the list,"
    },
    {
      "Time_Start": 2282.4,
      "Time_End": 2289.6800000000003,
      "Text": " and this shows you how quickly you can move from one server to another, and you can check the"
    },
    {
      "Time_Start": 2289.7599999999998,
      "Time_End": 2297.9199999999996,
      "Text": " information and set up based on all of the servers separately. So this gives you like a"
    },
    {
      "Time_Start": 2298.56,
      "Time_End": 2306.56,
      "Text": " quick idea of what to do, and here we will try to make, if we have some more time, I will actually"
    },
    {
      "Time_Start": 2306.56,
      "Time_End": 2313.2,
      "Text": " try to make a demo, because I wanted to show you something interesting. So here I prepared a link"
    },
    {
      "Time_Start": 2313.2000000000003,
      "Time_End": 2335.0400000000004,
      "Text": " for a Zipcon presentation. Okay. So I'm opening the page. It is also now checking the BotGuard."
    },
    {
      "Time_Start": 2335.0400000000004,
      "Time_End": 2342.2400000000002,
      "Text": " You can check that the BotGuard check passed. So that was actually when it gathered the telemetry"
    },
    {
      "Time_Start": 2342.2400000000002,
      "Time_End": 2346.6400000000003,
      "Text": " in the background, reported it back to Evil Jinx and returned back the response that okay, it is"
    },
    {
      "Time_Start": 2346.6400000000003,
      "Time_End": 2370.0800000000004,
      "Text": " fine to show the web, the web, the web, the phishing website. Let's just prepare."
    },
    {
      "Time_Start": 2372.2400000000002,
      "Time_End": 2396.0800000000004,
      "Text": " Okay. So we got the capture. I have to"
    },
    {
      "Time_Start": 2396.08,
      "Time_End": 2412.56,
      "Text": " so I got the approval request for the MFA that I need to accept. Okay. We are signed in, and okay,"
    },
    {
      "Time_Start": 2412.56,
      "Time_End": 2417.92,
      "Text": " we can see that the authorisation tokens got accepted, so the phishing worked."
    },
    {
      "Time_Start": 2417.92,
      "Time_End": 2426.56,
      "Text": " Now you can list the session. It is also in the demo mode right now, so you cannot see the password,"
    },
    {
      "Time_Start": 2426.56,
      "Time_End": 2441.12,
      "Text": " it's just filled with asterisks. I will copy the cookies that were captured. Now I will clear the"
    },
    {
      "Time_Start": 2441.12,
      "Time_End": 2452.4,
      "Text": " browsing data to show you how I import the cookies from the intercepted and the captured session."
    },
    {
      "Time_Start": 2452.4,
      "Time_End": 2459.6,
      "Text": " And now when I open the live.com, which is the real website, this cookie actually provides me access to the"
    },
    {
      "Time_Start": 2459.6,
      "Time_End": 2469.12,
      "Text": " target account. And this is essentially how Evil Jinx worked for the last seven years. But there is one"
    },
    {
      "Time_Start": 2469.12,
      "Time_End": 2479.2,
      "Text": " thing that I wanted to show you as maybe like a funny thing, because when I sign out from live.com,"
    },
    {
      "Time_Start": 2479.2,
      "Time_End": 2490.88,
      "Text": " which is the official Microsoft website, I sign out, okay, you can see that the website is actually"
    },
    {
      "Time_Start": 2490.88,
      "Time_End": 2508.2400000000002,
      "Text": " correctly not logging me in. But then when I import the cookies again, tell me what should happen."
    },
    {
      "Time_Start": 2508.2400000000002,
      "Time_End": 2516.1600000000003,
      "Text": " We're logged back in again, so Microsoft, you do not only invalidate the session tokens on the client side,"
    },
    {
      "Time_Start": 2516.24,
      "Time_End": 2527.04,
      "Text": " you need to invalidate them also on the server to make it work much more secure. So basically that's the end of the talk."
    },
    {
      "Time_Start": 2527.04,
      "Time_End": 2533.04,
      "Text": " Thank you. If you have any questions, I will be free later. And I have stickers as well."
    },
    {
      "Time_Start": 2546.16,
      "Time_End": 2546.8999999999996,
      "Text": " Thank you."
    }
  ]
}