{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 13.52,
      "Text": "This text was transcribed using whisper model: large-v2\n\n So, today I'm going to be chatting to you guys about unified Red Team automation, so"
    },
    {
      "Time_Start": 13.52,
      "Time_End": 17.88,
      "Text": " not so much automating the actual job, because as far as I'm concerned, that's still always"
    },
    {
      "Time_Start": 17.88,
      "Time_End": 21.2,
      "Text": " going to be done by people, but we're going to be mainly looking at the infrastructure"
    },
    {
      "Time_Start": 21.2,
      "Time_End": 26.080000000000002,
      "Text": " side of things and trying to kind of utilize and collate as much information into a single"
    },
    {
      "Time_Start": 26.080000000000002,
      "Time_End": 27.080000000000002,
      "Text": " portal as we can."
    },
    {
      "Time_Start": 27.080000000000002,
      "Time_End": 30.080000000000002,
      "Text": " So, yeah, I'm going to kind of walk you through it."
    },
    {
      "Time_Start": 30.080000000000002,
      "Time_End": 35.56,
      "Text": " The second half of the talk is all demo and live demo, so wish me luck, but we'll see"
    },
    {
      "Time_Start": 35.56,
      "Time_End": 36.56,
      "Text": " how we get on."
    },
    {
      "Time_Start": 36.56,
      "Time_End": 37.96,
      "Text": " So, who am I?"
    },
    {
      "Time_Start": 37.96,
      "Time_End": 38.96,
      "Text": " I'm Don Morton."
    },
    {
      "Time_Start": 38.96,
      "Time_End": 40.96,
      "Text": " I'm a Red Team specialist at Bulletproof."
    },
    {
      "Time_Start": 40.96,
      "Time_End": 45.120000000000005,
      "Text": " I've been Red Teaming and pen testing now for probably the last nearly five years, but"
    },
    {
      "Time_Start": 45.120000000000005,
      "Time_End": 48.88,
      "Text": " the last kind of three years of that pretty much solid in Red Teaming."
    },
    {
      "Time_Start": 48.88,
      "Time_End": 55.0,
      "Text": " Before that, I was a sysadmin, so automating things and basically taking the laziest way"
    },
    {
      "Time_Start": 55.0,
      "Time_End": 57.44,
      "Text": " out of stuff is pretty much how I learn IT."
    },
    {
      "Time_Start": 57.44,
      "Time_End": 61.84,
      "Text": " You've probably seen me around Discord as either like Czar, I think I'm on Twitter at"
    },
    {
      "Time_Start": 61.84,
      "Time_End": 68.0,
      "Text": " DSEC or some variation of it, so, yeah, feel free to grab me for a chat."
    },
    {
      "Time_Start": 68.0,
      "Time_End": 70.32,
      "Text": " So we're just going to have a quick look at kind of what this is, what I'm going to be"
    },
    {
      "Time_Start": 70.32,
      "Time_End": 73.76,
      "Text": " talking about, and the portal I've designed to do it."
    },
    {
      "Time_Start": 73.76,
      "Time_End": 77.76,
      "Text": " What I viewed as the current challenges and what was annoying me or frustrating me in"
    },
    {
      "Time_Start": 77.76,
      "Time_End": 82.36,
      "Text": " terms of deploying infrastructure in a quick way, getting information from it and sharing"
    },
    {
      "Time_Start": 82.36,
      "Time_End": 86.84,
      "Text": " it between multiple resources, and then we'll look at the general approach I kind of took,"
    },
    {
      "Time_Start": 86.84,
      "Time_End": 91.08,
      "Text": " so with a big caveat of I'm not a dev in any way, shape, or form, so I've probably done"
    },
    {
      "Time_Start": 91.08,
      "Time_End": 94.24,
      "Text": " some really stupid design choices, but it works."
    },
    {
      "Time_Start": 94.24,
      "Time_End": 98.56,
      "Text": " So we'll then pick up with a kind of demo, and I'll run through building some infrastructure,"
    },
    {
      "Time_Start": 98.56,
      "Time_End": 101.4,
      "Text": " show what it looks like, and then show the additional features of bringing information"
    },
    {
      "Time_Start": 101.4,
      "Time_End": 105.03999999999999,
      "Text": " together within kind of a single portal that I've done, and then I'll discuss the kind"
    },
    {
      "Time_Start": 105.03999999999999,
      "Time_End": 108.24,
      "Text": " of future plans and releases and things that are coming, stuff that you guys can actually"
    },
    {
      "Time_Start": 108.24,
      "Time_End": 110.12,
      "Text": " get involved with."
    },
    {
      "Time_Start": 110.12,
      "Time_End": 114.56,
      "Text": " So yeah, as I mentioned, it's a look into the approaches used to simplify and centralize"
    },
    {
      "Time_Start": 114.56,
      "Time_End": 119.04,
      "Text": " the deployment and management of infrastructure, and now probably considerably more, starting"
    },
    {
      "Time_Start": 119.04,
      "Time_End": 123.12,
      "Text": " to add in sort of more and more features, and this is achieved using a web-based tool"
    },
    {
      "Time_Start": 123.12,
      "Time_End": 125.32000000000001,
      "Text": " that I've called Red Commander."
    },
    {
      "Time_Start": 125.32000000000001,
      "Time_End": 130.48000000000002,
      "Text": " So it's all based on open source kind of, well, Django platform, and we'll have a kind"
    },
    {
      "Time_Start": 130.48000000000002,
      "Time_End": 133.12,
      "Text": " of sneak peek into all of that."
    },
    {
      "Time_Start": 133.12,
      "Time_End": 137.96,
      "Text": " So the current challenges I kind of identified and things I didn't like with how I was deploying"
    },
    {
      "Time_Start": 137.96,
      "Time_End": 143.12,
      "Text": " infrastructure currently was that there's tons of open source, multiple open source"
    },
    {
      "Time_Start": 143.12,
      "Time_End": 149.20000000000002,
      "Text": " sort of CICD and CLI-based Terraform Ansible deployment tools, and they all require lots"
    },
    {
      "Time_Start": 149.20000000000002,
      "Time_End": 154.44,
      "Text": " of heavy customization, you're constantly adding the same IPs, you're having one operator"
    },
    {
      "Time_Start": 154.44,
      "Time_End": 158.64000000000001,
      "Text": " deploying resources completely independently from everyone else, you have no visibility"
    },
    {
      "Time_Start": 158.64000000000001,
      "Time_End": 162.72,
      "Text": " across your different resources, and some of these are quite out of date or they're"
    },
    {
      "Time_Start": 162.72,
      "Time_End": 168.8,
      "Text": " really overly complex and use new Ansible roles, new functionality that is quickly depreciated"
    },
    {
      "Time_Start": 168.8,
      "Time_End": 172.07999999999998,
      "Text": " or moved on and APIs changed, so you're constantly having to repair things."
    },
    {
      "Time_Start": 172.07999999999998,
      "Time_End": 175.52,
      "Text": " So I was like, right, I'm going to try and keep it as simple as possible, take out all"
    },
    {
      "Time_Start": 175.52,
      "Time_End": 178.84,
      "Text": " the room for errors, and design something suitable."
    },
    {
      "Time_Start": 178.84,
      "Time_End": 182.32,
      "Text": " As I mentioned, managing and deploying infrastructure across multiple cloud providers and systems"
    },
    {
      "Time_Start": 182.32,
      "Time_End": 186.04,
      "Text": " is also a bit of a pain."
    },
    {
      "Time_Start": 186.04,
      "Time_End": 192.44,
      "Text": " These days we kind of utilize any cloud system or cloud platform we can, be that from deploying"
    },
    {
      "Time_Start": 192.44,
      "Time_End": 196.35999999999999,
      "Text": " VMs and infrastructure to the network side of things, so being flexible to go anywhere"
    },
    {
      "Time_Start": 196.35999999999999,
      "Time_End": 200.76,
      "Text": " and put things anywhere we can, that's kind of what we want to be doing."
    },
    {
      "Time_Start": 200.76,
      "Time_End": 204.28,
      "Text": " Likewise from a management perspective as kind of a lead, tracking infrastructure in"
    },
    {
      "Time_Start": 204.28,
      "Time_End": 208.92,
      "Text": " terms of costing, project assignment, and life cycles when you're using multiple platforms"
    },
    {
      "Time_Start": 208.92,
      "Time_End": 213.88,
      "Text": " again is a pain, and as a small team, there's only two to four of us really focusing on"
    },
    {
      "Time_Start": 213.88,
      "Time_End": 219.56,
      "Text": " red teaming, so the more we can optimize our features and our functionality and make things"
    },
    {
      "Time_Start": 219.56,
      "Time_End": 223.48,
      "Text": " as streamlined as possible, the better, and if I can keep an eye on the bottom line, costing"
    },
    {
      "Time_Start": 223.48,
      "Time_End": 225.6,
      "Text": " where things are, great."
    },
    {
      "Time_Start": 225.6,
      "Time_End": 229.44,
      "Text": " So those are the kind of what I identified as the challenges, and with that in mind,"
    },
    {
      "Time_Start": 229.44,
      "Time_End": 233.96,
      "Text": " I started, this is like the fifth time everyone's seen this meme, I think, today, or like yesterday,"
    },
    {
      "Time_Start": 233.96,
      "Time_End": 239.16,
      "Text": " but I started to kind of identify things that my platform must have to try and address those"
    },
    {
      "Time_Start": 239.16,
      "Time_End": 240.16,
      "Text": " kind of issues."
    },
    {
      "Time_Start": 240.16,
      "Time_End": 244.76,
      "Text": " So easy to manage, so that's why I ended up going kind of the web route, I wanted to move"
    },
    {
      "Time_Start": 244.76,
      "Time_End": 249.32,
      "Text": " away from CLI and config files and constantly having to change and add things."
    },
    {
      "Time_Start": 249.35999999999999,
      "Time_End": 253.95999999999998,
      "Text": " We used other platforms, like we used OST, and that kind of single pain, single area"
    },
    {
      "Time_Start": 253.95999999999998,
      "Time_End": 258.28,
      "Text": " you go to and just clicking, navigating, generating what you need to was perfect."
    },
    {
      "Time_Start": 258.28,
      "Time_End": 264.12,
      "Text": " Secure, obviously with CI, CD, and Terraform, Ansible, you're storing a lot of secrets,"
    },
    {
      "Time_Start": 264.12,
      "Time_End": 270.24,
      "Text": " you're accessing data, so trying to design a platform in the most secure way possible,"
    },
    {
      "Time_Start": 270.24,
      "Time_End": 276.15999999999997,
      "Text": " probably not me best at, not being a full web dev, but I tried to take best steps to"
    },
    {
      "Time_Start": 276.16,
      "Time_End": 282.40000000000003,
      "Text": " minimize disclosure of secrets, only using them during runtime, encrypted storage, et"
    },
    {
      "Time_Start": 282.40000000000003,
      "Time_End": 283.40000000000003,
      "Text": " cetera."
    },
    {
      "Time_Start": 283.40000000000003,
      "Time_End": 287.36,
      "Text": " Also making use of modern infrastructure approaches, there's not been a massive change in terms"
    },
    {
      "Time_Start": 287.36,
      "Time_End": 291.56,
      "Text": " of deploying Red Team infrastructure since the blue screen of Jeff days."
    },
    {
      "Time_Start": 291.56,
      "Time_End": 297.12,
      "Text": " So doing this has been interesting, and we've touched on some of the key technologies I"
    },
    {
      "Time_Start": 297.12,
      "Time_End": 301.04,
      "Text": " look to use, Ansible, Terraform, and Tailscale, so Tailscale I'm probably going to bang on"
    },
    {
      "Time_Start": 301.04,
      "Time_End": 305.72,
      "Text": " about a lot today, but it's really been kind of a unifying technology to allow us to do"
    },
    {
      "Time_Start": 305.72,
      "Time_End": 306.72,
      "Text": " what we need to."
    },
    {
      "Time_Start": 306.72,
      "Time_End": 312.40000000000003,
      "Text": " It must support at least Azure and AWS, so from our point of view, AWS is our core provider,"
    },
    {
      "Time_Start": 312.40000000000003,
      "Time_End": 316.88000000000005,
      "Text": " most of our infrastructure goes in there, Azure is a secondary, and that's kind of how"
    },
    {
      "Time_Start": 316.88000000000005,
      "Time_End": 318.68,
      "Text": " it's got to work as a minimum."
    },
    {
      "Time_Start": 318.68,
      "Time_End": 322.88000000000005,
      "Text": " API driven as well, so everything within the web portal needs to be API driven, I want"
    },
    {
      "Time_Start": 322.88000000000005,
      "Time_End": 329.92,
      "Text": " to be able to slot it in anywhere and have projects spun up and designed by your upstream"
    },
    {
      "Time_Start": 329.92,
      "Time_End": 335.64000000000004,
      "Text": " sales pipelines to automatically generate and spin up resources, so API is a key."
    },
    {
      "Time_Start": 335.64,
      "Time_End": 341.08,
      "Text": " And a modular design that even someone like me can quickly add new functionality to, you"
    },
    {
      "Time_Start": 341.08,
      "Time_End": 346.4,
      "Text": " don't need to be an absolute expert in Terraform, Ansible, you can just plop in new features,"
    },
    {
      "Time_Start": 346.4,
      "Time_End": 349.76,
      "Text": " new functions, new playbooks, and it will just work."
    },
    {
      "Time_Start": 349.76,
      "Time_End": 353.28,
      "Text": " And also, like I said, which is kind of the end goal, is to start unifying as many data"
    },
    {
      "Time_Start": 353.28,
      "Time_End": 358.28,
      "Text": " sources from an engagement into a single area, so as an operator, as a lead, you can see"
    },
    {
      "Time_Start": 358.28,
      "Time_End": 362.0,
      "Text": " everything that's going on across your organization, across your teams, across the multiple jobs"
    },
    {
      "Time_Start": 362.0,
      "Time_End": 367.12,
      "Text": " you've got going on, and even now starting to ingest things like C2 logs, parsing, and"
    },
    {
      "Time_Start": 367.12,
      "Time_End": 374.6,
      "Text": " eventually look to introduce AI or learning models into further kind of digging into that"
    },
    {
      "Time_Start": 374.6,
      "Time_End": 377.36,
      "Text": " data and providing insight."
    },
    {
      "Time_Start": 377.36,
      "Time_End": 382.88,
      "Text": " So as I mentioned, the kind of core technologies I'm looking at, tail scale is really the beating"
    },
    {
      "Time_Start": 382.88,
      "Time_End": 388.0,
      "Text": " heart of everything, it makes things so easy to tie everything together, and that's what's"
    },
    {
      "Time_Start": 388.0,
      "Time_End": 391.76,
      "Text": " really changed probably over the last couple of years with using that over previous Red"
    },
    {
      "Time_Start": 391.76,
      "Time_End": 396.8,
      "Text": " Team deployments, you know, you can have multiple resources in different providers, unify all"
    },
    {
      "Time_Start": 396.8,
      "Time_End": 401.68,
      "Text": " over a secure backend network, and communication is easy, there's no port forwarding, there's"
    },
    {
      "Time_Start": 401.68,
      "Time_End": 407.84,
      "Text": " no on-demand SSH tunnels spun up, public ports being available, there's no excuse for that"
    },
    {
      "Time_Start": 407.84,
      "Time_End": 411.56,
      "Text": " kind of stuff these days, you can just do it all over tail scale."
    },
    {
      "Time_Start": 411.56,
      "Time_End": 416.4,
      "Text": " Django was something I kind of got to know a bit with tools like Ghostwriter, which you'll"
    },
    {
      "Time_Start": 416.40000000000003,
      "Time_End": 419.84000000000003,
      "Text": " probably see when you see the platform, where I've taken some of the inspiration and kind"
    },
    {
      "Time_Start": 419.84000000000003,
      "Time_End": 424.68,
      "Text": " of like the project-driven approach, and that I use as kind of a basis."
    },
    {
      "Time_Start": 424.68,
      "Time_End": 429.68000000000006,
      "Text": " The one thing I hated about Django was its API framework, but Ninja API has come along"
    },
    {
      "Time_Start": 429.68000000000006,
      "Time_End": 434.76000000000005,
      "Text": " recently and it's basically fast API, but for Django it integrates with all of that,"
    },
    {
      "Time_Start": 434.76000000000005,
      "Time_End": 439.24,
      "Text": " and even for a mug like me, it's quite easy."
    },
    {
      "Time_Start": 439.24,
      "Time_End": 443.64000000000004,
      "Text": " Mailgun as well, we use that for all of our mail notifications, the platform hooks into"
    },
    {
      "Time_Start": 443.68,
      "Time_End": 448.68,
      "Text": " things like Teams, Slack, Discord, to kind of keep operators up to date as things move"
    },
    {
      "Time_Start": 448.68,
      "Time_End": 451.08,
      "Text": " through different stages."
    },
    {
      "Time_Start": 451.08,
      "Time_End": 455.71999999999997,
      "Text": " CloudFront, again, we use for automatic site generation and things like domain aging and"
    },
    {
      "Time_Start": 455.71999999999997,
      "Time_End": 458.2,
      "Text": " like aging them out, making things look legitimate."
    },
    {
      "Time_Start": 458.2,
      "Time_End": 462.88,
      "Text": " Adobe OS, again, as I mentioned, our core provider, Azure, Ansible, and Terraform."
    },
    {
      "Time_Start": 462.88,
      "Time_End": 467.76,
      "Text": " So everyone's probably familiar with a lot of those things, and I haven't done too much"
    },
    {
      "Time_Start": 467.76,
      "Time_End": 472.12,
      "Text": " of reinventing the wheel in terms of use of Terraform and Ansible, I've just kind of tarted"
    },
    {
      "Time_Start": 472.12,
      "Time_End": 475.44,
      "Text": " it up and made it look pretty."
    },
    {
      "Time_Start": 475.44,
      "Time_End": 480.88,
      "Text": " So the core design concept, as I mentioned, hasn't really changed."
    },
    {
      "Time_Start": 480.88,
      "Time_End": 486.04,
      "Text": " We're looking at deploying kind of private VPC groups per project, each group is individual"
    },
    {
      "Time_Start": 486.04,
      "Time_End": 490.8,
      "Text": " and self-contained, so for example, the internet-facing security groups and the private security groups"
    },
    {
      "Time_Start": 490.8,
      "Time_End": 497.12,
      "Text": " can't talk to each other over AWS, all traffic goes over the backend tail network, and this"
    },
    {
      "Time_Start": 497.12,
      "Time_End": 500.72,
      "Text": " lockdown of communication is just really, really useful."
    },
    {
      "Time_Start": 500.72,
      "Time_End": 505.88000000000005,
      "Text": " So we can do exactly the same and have all of these resources within Azure, within GCP"
    },
    {
      "Time_Start": 505.88000000000005,
      "Time_End": 510.48,
      "Text": " or anywhere, and the network layout and architecture still stays exactly the same, it doesn't matter"
    },
    {
      "Time_Start": 510.48,
      "Time_End": 512.6,
      "Text": " where they're placed."
    },
    {
      "Time_Start": 512.6,
      "Time_End": 517.48,
      "Text": " The overlaying architecture and control, again, which I'll talk about further on, around tail"
    },
    {
      "Time_Start": 517.48,
      "Time_End": 522.52,
      "Text": " net ACLs, again, gives us lots of control, so where the resources can't directly talk"
    },
    {
      "Time_Start": 522.52,
      "Time_End": 526.48,
      "Text": " to each other within the cloud platform, we can have them locked down."
    },
    {
      "Time_Start": 526.48,
      "Time_End": 531.72,
      "Text": " So for example, project VPC1 and project VPC2 can't talk to each other at all in either"
    },
    {
      "Time_Start": 531.72,
      "Time_End": 534.5600000000001,
      "Text": " of the resources within Azure."
    },
    {
      "Time_Start": 534.5600000000001,
      "Time_End": 538.8000000000001,
      "Text": " They also can't talk between projects over tail scale, but as an operator, you can come"
    },
    {
      "Time_Start": 538.8000000000001,
      "Time_End": 542.48,
      "Text": " in and talk to all projects and to your core networks, and your core networks can talk"
    },
    {
      "Time_Start": 542.48,
      "Time_End": 543.48,
      "Text": " to everywhere."
    },
    {
      "Time_Start": 543.48,
      "Time_End": 549.7,
      "Text": " So with ACL taggings within tail scale, we can create really dynamic networks across"
    },
    {
      "Time_Start": 549.7,
      "Time_End": 554.76,
      "Text": " all different resources, easy peasy, it's no problem, doesn't matter, and the API for"
    },
    {
      "Time_Start": 554.76,
      "Time_End": 559.3199999999999,
      "Text": " things like tail scale and management, again, easy to plug into, add to the platform, we"
    },
    {
      "Time_Start": 559.3199999999999,
      "Time_End": 564.08,
      "Text": " can just deploy resources, tag it on the fly, and it's ready to go."
    },
    {
      "Time_Start": 564.08,
      "Time_End": 569.4,
      "Text": " So yeah, tried and tested, probably not unfamiliar with the kind of basic layout of how the Red"
    },
    {
      "Time_Start": 569.4,
      "Time_End": 572.4399999999999,
      "Text": " Team sort of infrastructure looks."
    },
    {
      "Time_Start": 572.4399999999999,
      "Time_End": 576.6,
      "Text": " The bonus as well with approach is we can add as many resources to a project as we want,"
    },
    {
      "Time_Start": 576.6,
      "Time_End": 581.3199999999999,
      "Text": " so anything from a simple penetration test or phishing assessment, you can have a single"
    },
    {
      "Time_Start": 581.32,
      "Time_End": 585.5200000000001,
      "Text": " go fish server deployed, for example, or you can have 30 C2 servers, it's entirely"
    },
    {
      "Time_Start": 585.5200000000001,
      "Time_End": 588.48,
      "Text": " up to you."
    },
    {
      "Time_Start": 588.48,
      "Time_End": 593.6400000000001,
      "Text": " As I mentioned, we use kind of tail scale access controls, so we have operator devices,"
    },
    {
      "Time_Start": 593.6400000000001,
      "Time_End": 599.36,
      "Text": " core network devices, and then project systems, so project systems are dynamically created"
    },
    {
      "Time_Start": 599.36,
      "Time_End": 603.6800000000001,
      "Text": " every time you add a new project and prepare a resource, and then operator devices are"
    },
    {
      "Time_Start": 603.6800000000001,
      "Time_End": 607.9200000000001,
      "Text": " automatically joined when someone or a new person joins the tail scale network and adds"
    },
    {
      "Time_Start": 607.9200000000001,
      "Time_End": 610.0,
      "Text": " their own device to it."
    },
    {
      "Time_Start": 610.0,
      "Time_End": 613.08,
      "Text": " Operator devices can access all areas of the network but cannot talk to each other"
    },
    {
      "Time_Start": 613.08,
      "Time_End": 617.68,
      "Text": " to prevent people from playing around with each other's devices."
    },
    {
      "Time_Start": 617.68,
      "Time_End": 621.68,
      "Text": " Project devices cannot talk to other project devices but can talk to each other, so it's"
    },
    {
      "Time_Start": 621.68,
      "Time_End": 627.52,
      "Text": " easy to share things like back end network traffic over things like Red Elk and all other"
    },
    {
      "Time_Start": 627.52,
      "Time_End": 630.52,
      "Text": " services, C2 servers, for example."
    },
    {
      "Time_Start": 630.52,
      "Time_End": 636.56,
      "Text": " The other thing we use is ephemeral keying or ephemeral tagging within tail scale, so"
    },
    {
      "Time_Start": 636.5600000000001,
      "Time_End": 640.5200000000001,
      "Text": " once a node goes down for a period of time, I think it's like half an hour, half an hour"
    },
    {
      "Time_Start": 640.5200000000001,
      "Time_End": 644.6800000000001,
      "Text": " to an hour, depending how often it refreshes, it used to be much slower, now it's much quicker,"
    },
    {
      "Time_Start": 644.6800000000001,
      "Time_End": 647.9200000000001,
      "Text": " the nodes are automatically removed, so we don't need to add in any other extra logic"
    },
    {
      "Time_Start": 647.9200000000001,
      "Time_End": 652.6,
      "Text": " to remove these from the tail net, once they're powered down and removed, they're gone, so"
    },
    {
      "Time_Start": 652.6,
      "Time_End": 658.2800000000001,
      "Text": " these kind of fundamental technologies within tail scale have made things considerably easier."
    },
    {
      "Time_Start": 658.2800000000001,
      "Time_End": 661.6800000000001,
      "Text": " There's also additional features which I haven't really touched on, such as, you know, tail"
    },
    {
      "Time_Start": 661.6800000000001,
      "Time_End": 665.8800000000001,
      "Text": " scale provides the ability to SSH directly into hostess using tail scale."
    },
    {
      "Time_Start": 665.92,
      "Time_End": 669.96,
      "Text": " We can also use back end certificate generation, so it uses Let's Encrypt, for example, on"
    },
    {
      "Time_Start": 669.96,
      "Time_End": 676.96,
      "Text": " the back end to generate accepted certificates within a private network, so we never have"
    },
    {
      "Time_Start": 676.96,
      "Time_End": 682.56,
      "Text": " to expose DNS records or anything else, we can just create private back end Let's Encrypt"
    },
    {
      "Time_Start": 682.56,
      "Time_End": 686.8,
      "Text": " certificates for things like Red Elk and it all just works, we get secure back end comms"
    },
    {
      "Time_Start": 686.8,
      "Time_End": 689.04,
      "Text": " all within our controlled network."
    },
    {
      "Time_Start": 689.04,
      "Time_End": 692.4,
      "Text": " There are open source alternatives for the keying server and authentication server for"
    },
    {
      "Time_Start": 692.4,
      "Time_End": 697.0,
      "Text": " tail scale, so if you're in controlled environments and you have to have control of your own network"
    },
    {
      "Time_Start": 697.0,
      "Time_End": 700.6,
      "Text": " access and things like that and don't want to rely on tail scale as a company to do it,"
    },
    {
      "Time_Start": 700.6,
      "Time_End": 705.1999999999999,
      "Text": " you can do it in an open source way, you just have to host your own server."
    },
    {
      "Time_Start": 705.1999999999999,
      "Time_End": 708.24,
      "Text": " So something to bear in mind."
    },
    {
      "Time_Start": 708.24,
      "Time_End": 715.16,
      "Text": " And as for the actual platform itself, as I mentioned, it's a posh way of doing stupid"
    },
    {
      "Time_Start": 715.16,
      "Time_End": 720.76,
      "Text": " things quickly, so it basically does lots of moving around of templates."
    },
    {
      "Time_Start": 720.76,
      "Time_End": 726.88,
      "Text": " So as long as you put things in the right area, you follow the correct naming conventions,"
    },
    {
      "Time_Start": 726.88,
      "Time_End": 730.2,
      "Text": " the portal will pick up what you're doing and move things into the correct area."
    },
    {
      "Time_Start": 730.2,
      "Time_End": 735.12,
      "Text": " So if you go through an initial request for new infrastructure here, you'll submit a build"
    },
    {
      "Time_Start": 735.12,
      "Time_End": 738.76,
      "Text": " request to the API, which is pushed through from the front end, so it will automatically"
    },
    {
      "Time_Start": 738.76,
      "Time_End": 743.0,
      "Text": " pull things through like your project ID and project information and any other fields you"
    },
    {
      "Time_Start": 743.0,
      "Time_End": 744.92,
      "Text": " need to pass between the database."
    },
    {
      "Time_Start": 744.92,
      "Time_End": 749.52,
      "Text": " It's one of the reasons I chose Django, because the relationship database set up on it is"
    },
    {
      "Time_Start": 749.52,
      "Time_End": 750.52,
      "Text": " so easy."
    },
    {
      "Time_Start": 750.52,
      "Time_End": 753.76,
      "Text": " Again, I can do it, so it can't be that difficult."
    },
    {
      "Time_Start": 753.76,
      "Time_End": 758.16,
      "Text": " The statuses as well are also tagged along on the back end to send updates and notifications"
    },
    {
      "Time_Start": 758.16,
      "Time_End": 762.24,
      "Text": " and also to limit certain features and functions kicking in at different times."
    },
    {
      "Time_Start": 762.24,
      "Time_End": 767.4399999999999,
      "Text": " DNS records and DNS zone management is also included in the platform."
    },
    {
      "Time_Start": 767.4399999999999,
      "Time_End": 771.8,
      "Text": " At the moment it only supports route 53, but it gives you the complete ability to track"
    },
    {
      "Time_Start": 771.8,
      "Time_End": 776.28,
      "Text": " domains and also assign them to resources as you build them on the fly."
    },
    {
      "Time_Start": 776.28,
      "Time_End": 779.28,
      "Text": " So once that's done, effectively it takes all that information, including the modules,"
    },
    {
      "Time_Start": 779.28,
      "Time_End": 784.72,
      "Text": " so say for example we're building a team server, it will fire it through, build a unique project"
    },
    {
      "Time_Start": 784.72,
      "Time_End": 789.48,
      "Text": " location where it's going to hold all of that Terraform information, populate those templates"
    },
    {
      "Time_Start": 789.48,
      "Time_End": 792.0799999999999,
      "Text": " with the required bits of information."
    },
    {
      "Time_Start": 792.0799999999999,
      "Time_End": 797.0,
      "Text": " The bonus of this is you can use templates and variables and areas that Terraform doesn't"
    },
    {
      "Time_Start": 797.0,
      "Time_End": 801.28,
      "Text": " usually let you use, so because we use Ginger on the back end just to move those templates"
    },
    {
      "Time_Start": 801.28,
      "Time_End": 806.12,
      "Text": " around and render them with the database information, we can set variables, name things"
    },
    {
      "Time_Start": 806.12,
      "Time_End": 809.72,
      "Text": " quickly and easily without having to rely on Terraform variables."
    },
    {
      "Time_Start": 809.72,
      "Time_End": 813.4399999999999,
      "Text": " So we can name things differently, get away with a bit more than Terraform natively with"
    },
    {
      "Time_Start": 813.4399999999999,
      "Time_End": 815.3199999999999,
      "Text": " this allow."
    },
    {
      "Time_Start": 815.3199999999999,
      "Time_End": 820.9599999999999,
      "Text": " Also one of the things I designed in through the whole process is often I'll screw something"
    },
    {
      "Time_Start": 820.9599999999999,
      "Time_End": 826.24,
      "Text": " up or I want to join or jump into a particular stage in the process and do something manually,"
    },
    {
      "Time_Start": 826.24,
      "Time_End": 830.0799999999999,
      "Text": " be it a quick change to a template or how I want to deploy something."
    },
    {
      "Time_Start": 830.08,
      "Time_End": 835.48,
      "Text": " A lot of designs I see are so streamlined and only work in one way."
    },
    {
      "Time_Start": 835.48,
      "Time_End": 839.6,
      "Text": " This again takes very much things in the old classic way, it will create sort of written"
    },
    {
      "Time_Start": 839.6,
      "Time_End": 843.48,
      "Text": " inventory files for things like Ansible, all the configurations for Terraform, the state"
    },
    {
      "Time_Start": 843.48,
      "Time_End": 848.1600000000001,
      "Text": " files are separated and isolated, so you can just jump into the back end Docker container,"
    },
    {
      "Time_Start": 848.1600000000001,
      "Time_End": 851.44,
      "Text": " change what you need to and rerun it and it will work."
    },
    {
      "Time_Start": 851.44,
      "Time_End": 854.5600000000001,
      "Text": " So once it goes through the Terraform kind of apply status, all the directives are being"
    },
    {
      "Time_Start": 854.5600000000001,
      "Time_End": 859.76,
      "Text": " created, it will then start querying tail scale API and what it will do here is then"
    },
    {
      "Time_Start": 860.4399999999999,
      "Time_End": 865.24,
      "Text": " create the tagged project groups I mentioned with the ACLs, set up the rules for that based"
    },
    {
      "Time_Start": 865.24,
      "Time_End": 868.68,
      "Text": " on its templates and then it will also sit there and just wait for this information to"
    },
    {
      "Time_Start": 868.68,
      "Time_End": 873.28,
      "Text": " come back and then populate the private tail scale IP addresses into the database so now"
    },
    {
      "Time_Start": 873.28,
      "Time_End": 877.76,
      "Text": " you know and the portal knows where all your resources are and generate your Ansible inventory"
    },
    {
      "Time_Start": 877.76,
      "Time_End": 879.4399999999999,
      "Text": " files."
    },
    {
      "Time_Start": 879.4399999999999,
      "Time_End": 882.88,
      "Text": " So now you've got all your on disk information, you've got your Ansible file to inventory"
    },
    {
      "Time_Start": 882.88,
      "Time_End": 887.8,
      "Text": " files all built, your infrastructure stood up, you now go through the final stage which"
    },
    {
      "Time_Start": 887.84,
      "Time_End": 891.5600000000001,
      "Text": " will be the Ansible configuration and again this just takes a playbook, you can have as"
    },
    {
      "Time_Start": 891.5600000000001,
      "Time_End": 895.5600000000001,
      "Text": " many playbooks for team servers as you want so you can keep up with all the latest hotness"
    },
    {
      "Time_Start": 895.5600000000001,
      "Time_End": 899.1200000000001,
      "Text": " and have all the best C2s with all your playbooks, no problem."
    },
    {
      "Time_Start": 899.1200000000001,
      "Time_End": 905.0400000000001,
      "Text": " It also supports just raw variable input through the form so Ansible runner will just allow"
    },
    {
      "Time_Start": 905.0400000000001,
      "Time_End": 911.36,
      "Text": " you to input whatever amount of variables you want in a kind of key and value pair."
    },
    {
      "Time_Start": 911.36,
      "Time_End": 915.2,
      "Text": " So if you are using your own playbooks and you want to import them, you can update the"
    },
    {
      "Time_Start": 915.2,
      "Time_End": 919.2,
      "Text": " front end forms to take in whatever variables you want, pass it down to Ansible runner,"
    },
    {
      "Time_Start": 919.2,
      "Time_End": 922.32,
      "Text": " your playbooks will have access to them and it's good to go and again that's all stored"
    },
    {
      "Time_Start": 922.32,
      "Time_End": 926.48,
      "Text": " in the database so you don't need to redo it, it's just there."
    },
    {
      "Time_Start": 926.48,
      "Time_End": 932.24,
      "Text": " The playbook will then run, configure device and at that stage you have a complete project."
    },
    {
      "Time_Start": 932.24,
      "Time_End": 936.5200000000001,
      "Text": " So we'll have a look at how that actually looks in practice when we get going."
    },
    {
      "Time_Start": 936.5200000000001,
      "Time_End": 941.5200000000001,
      "Text": " As I mentioned adding new modules and new features is pretty straightforward, Ansible"
    },
    {
      "Time_Start": 941.52,
      "Time_End": 946.64,
      "Text": " updates, you follow module name, for example, team servers, assets will be files, things"
    },
    {
      "Time_Start": 946.64,
      "Time_End": 950.0,
      "Text": " that need to be moved around by your playbooks to be made available and you just put in as"
    },
    {
      "Time_Start": 950.0,
      "Time_End": 952.68,
      "Text": " many playbooks as you want, easy as that, you want to add a new playbook, just put it"
    },
    {
      "Time_Start": 952.68,
      "Time_End": 954.48,
      "Text": " in the folder."
    },
    {
      "Time_Start": 954.48,
      "Time_End": 959.0799999999999,
      "Text": " Same goes for new modules within Terraform as well, you just add in new modules, ensure"
    },
    {
      "Time_Start": 959.0799999999999,
      "Time_End": 963.24,
      "Text": " you update a module load template from the template that's already available to you and"
    },
    {
      "Time_Start": 963.24,
      "Time_End": 965.48,
      "Text": " again you'll have new modules."
    },
    {
      "Time_Start": 965.48,
      "Time_End": 971.1999999999999,
      "Text": " There are custom logic around certain things like there's malware, malleable profile passing"
    },
    {
      "Time_Start": 971.36,
      "Time_End": 975.36,
      "Text": " and things like that that happen depending on what module types you're using."
    },
    {
      "Time_Start": 975.36,
      "Time_End": 978.5600000000001,
      "Text": " So there's like specialist modules with its own logic, but if you want to just add your"
    },
    {
      "Time_Start": 978.5600000000001,
      "Time_End": 982.12,
      "Text": " own raw module you can."
    },
    {
      "Time_Start": 982.12,
      "Time_End": 985.12,
      "Text": " Again try to keep it really simple, just put files in the right places, name them right"
    },
    {
      "Time_Start": 985.12,
      "Time_End": 987.12,
      "Text": " you're good to go."
    },
    {
      "Time_Start": 987.12,
      "Time_End": 988.12,
      "Text": " Demo time."
    },
    {
      "Time_Start": 988.12,
      "Time_End": 992.2800000000001,
      "Text": " So yeah, so we'll have a quick look at the project."
    },
    {
      "Time_Start": 992.2800000000001,
      "Time_End": 998.08,
      "Text": " So it's all as I mentioned like kind of web generated, so everything's dynamically added"
    },
    {
      "Time_Start": 998.1600000000001,
      "Time_End": 999.96,
      "Text": " and everything stems from projects."
    },
    {
      "Time_Start": 999.96,
      "Time_End": 1003.4000000000001,
      "Text": " I don't know why I'm looking up there, I've got it right in front of my face."
    },
    {
      "Time_Start": 1003.4000000000001,
      "Time_End": 1008.1600000000001,
      "Text": " So once a new project's created you can see there's a number of different kind of pieces"
    },
    {
      "Time_Start": 1008.1600000000001,
      "Time_End": 1010.2,
      "Text": " of information we go through."
    },
    {
      "Time_Start": 1010.2,
      "Time_End": 1015.08,
      "Text": " Again this can all be driven by the API so there's no need to manually go in and create"
    },
    {
      "Time_Start": 1015.08,
      "Time_End": 1016.08,
      "Text": " projects."
    },
    {
      "Time_Start": 1016.08,
      "Time_End": 1022.24,
      "Text": " So for example we use pipe drive, so our upstream process would be a job's confirmed, it's booked,"
    },
    {
      "Time_Start": 1022.24,
      "Time_End": 1026.0,
      "Text": " that automatically raises a project, you can assign it to a lead, they get an email, you"
    },
    {
      "Time_Start": 1026.0,
      "Time_End": 1028.16,
      "Text": " go and you build your infrastructure."
    },
    {
      "Time_Start": 1028.16,
      "Time_End": 1030.96,
      "Text": " We have separate areas like project IOCs and op logs which we'll have a look at when we"
    },
    {
      "Time_Start": 1030.96,
      "Time_End": 1037.0,
      "Text": " get a build going, end dates, notes, like full WYSIWYG support pretty much throughout."
    },
    {
      "Time_Start": 1037.0,
      "Time_End": 1039.96,
      "Text": " As I mentioned like projects are the key, everything stems off a project, it's pretty"
    },
    {
      "Time_Start": 1039.96,
      "Time_End": 1040.96,
      "Text": " much assigned to that."
    },
    {
      "Time_Start": 1040.96,
      "Time_End": 1046.48,
      "Text": " We can also have things like tasks, but again we'll circle back around as we get time."
    },
    {
      "Time_Start": 1046.48,
      "Time_End": 1049.84,
      "Text": " The infrastructure is kind of the primary area we'll pay attention to today."
    },
    {
      "Time_Start": 1049.84,
      "Time_End": 1054.56,
      "Text": " So you can see there's already a project deployed here which has a number of resources, so this"
    },
    {
      "Time_Start": 1054.56,
      "Time_End": 1058.8,
      "Text": " has like stage one, it's got an engine XHTPS redirector which is linked to that stage"
    },
    {
      "Time_Start": 1058.8,
      "Time_End": 1062.8,
      "Text": " one, we've also got a go fish server and a phishing redirect server, so you can name"
    },
    {
      "Time_Start": 1062.8,
      "Time_End": 1066.1599999999999,
      "Text": " the type name to put whatever you want, to give it custom names so you know what's going"
    },
    {
      "Time_Start": 1066.1599999999999,
      "Time_End": 1070.6399999999999,
      "Text": " on, platforms and its status and everything as I say it's tracked through."
    },
    {
      "Time_Start": 1070.6399999999999,
      "Time_End": 1075.52,
      "Text": " You can see domain names are also excited, attached and picked up along with tail scale"
    },
    {
      "Time_Start": 1075.52,
      "Time_End": 1082.0,
      "Text": " private IPs, public IPs, et cetera, and there's also build terminals which is probably horrendously"
    },
    {
      "Time_Start": 1082.0,
      "Time_End": 1087.68,
      "Text": " formatted because Terraform loves to add colors and I haven't filtered it all out."
    },
    {
      "Time_Start": 1087.68,
      "Time_End": 1092.12,
      "Text": " You can see all the back end stuff as it's going through, so adding the keys, builds,"
    },
    {
      "Time_Start": 1092.12,
      "Time_End": 1096.2,
      "Text": " you also get, if we keep scrolling, over the million builds I've done over the last few"
    },
    {
      "Time_Start": 1096.2,
      "Time_End": 1098.52,
      "Text": " days making sure nothing breaks."
    },
    {
      "Time_Start": 1098.52,
      "Time_End": 1103.72,
      "Text": " You can also see things like the Ansible outputs as well for the playbooks as they go through,"
    },
    {
      "Time_Start": 1103.72,
      "Time_End": 1107.4,
      "Text": " so that's available again in the portal without having to go and find it yourself or get onto"
    },
    {
      "Time_Start": 1107.4,
      "Time_End": 1108.4,
      "Text": " the actual resources."
    },
    {
      "Time_Start": 1108.4,
      "Time_End": 1114.0800000000002,
      "Text": " But what we'll do is we'll just quickly build something on the demo project, we'll just"
    },
    {
      "Time_Start": 1114.0800000000002,
      "Time_End": 1122.48,
      "Text": " build something nice and easy, so we'll go for a Nginx server, we'll build it on, in"
    },
    {
      "Time_Start": 1122.48,
      "Time_End": 1131.52,
      "Text": " fact actually we'll just add another domain, I purchased yesterday, if this works, like"
    },
    {
      "Time_Start": 1131.52,
      "Time_End": 1135.8000000000002,
      "Text": " my hands, my heart is fully in the hands of the demo god, so there you go, again this"
    },
    {
      "Time_Start": 1135.8,
      "Time_End": 1143.24,
      "Text": " dynamically pulls everything from route 53, so now DMX33F has been added, so we can go"
    },
    {
      "Time_Start": 1143.24,
      "Time_End": 1152.32,
      "Text": " back to infrastructure, add a new build, select the project, again we'll go for Nginx, we'll"
    },
    {
      "Time_Start": 1152.32,
      "Time_End": 1162.04,
      "Text": " select the DNS domain we want to use and we'll call this one reader.dmx33f.com and we'll"
    },
    {
      "Time_Start": 1162.04,
      "Time_End": 1166.44,
      "Text": " just call this one demo reader."
    },
    {
      "Time_Start": 1166.44,
      "Time_End": 1171.1599999999999,
      "Text": " So that's now queued, effectively the database has been populated, that's ready to go."
    },
    {
      "Time_Start": 1171.1599999999999,
      "Time_End": 1177.8,
      "Text": " What we'll now add for that as well, why not, we'll go for, nope, go for a phishing server,"
    },
    {
      "Time_Start": 1177.8,
      "Time_End": 1190.56,
      "Text": " again we'll go on that, we'll call it mail.dmx33f.com and we'll just call this go phish."
    },
    {
      "Time_Start": 1190.56,
      "Time_End": 1194.9199999999998,
      "Text": " And again, that's now ready to go, so now we can just click prepare and as I mentioned"
    },
    {
      "Time_Start": 1194.9199999999998,
      "Time_End": 1199.1599999999999,
      "Text": " like during the process that's going to initialize Terraform, initialize all the directories,"
    },
    {
      "Time_Start": 1199.1599999999999,
      "Time_End": 1203.0,
      "Text": " build everything and then we can just work through the build steps as we go."
    },
    {
      "Time_Start": 1203.0,
      "Time_End": 1206.6599999999999,
      "Text": " So the first initialization takes a little bit of time because it has to load the Terraform"
    },
    {
      "Time_Start": 1206.6599999999999,
      "Time_End": 1210.56,
      "Text": " provider and do all that kind of good stuff, but after that it's a fairly straightforward"
    },
    {
      "Time_Start": 1210.56,
      "Time_End": 1211.56,
      "Text": " process."
    },
    {
      "Time_Start": 1211.56,
      "Time_End": 1215.32,
      "Text": " Again, we don't have to config Ansible at this point, we can do it later, we can do"
    },
    {
      "Time_Start": 1215.32,
      "Time_End": 1220.24,
      "Text": " it at the beginning, but we'll do that in a sec, shouldn't take too long, he says, hopefully"
    },
    {
      "Time_Start": 1220.92,
      "Time_End": 1222.92,
      "Text": " Everyone's staring at a spinning thing."
    },
    {
      "Time_Start": 1222.92,
      "Time_End": 1227.2,
      "Text": " There we go."
    },
    {
      "Time_Start": 1227.2,
      "Time_End": 1231.0,
      "Text": " So that's now updated to planned and what we'll do now is go and configure these, so"
    },
    {
      "Time_Start": 1231.0,
      "Time_End": 1235.44,
      "Text": " we'll start with go phish and we'll just do a clean go phish redirector, so again this"
    },
    {
      "Time_Start": 1235.44,
      "Time_End": 1239.48,
      "Text": " is going to, it's going to be any playbook you want, you can customize them however you"
    },
    {
      "Time_Start": 1239.48,
      "Time_End": 1243.44,
      "Text": " want, so this one for example is just going to spin up go phish, going to strip most of"
    },
    {
      "Time_Start": 1243.44,
      "Time_End": 1248.4,
      "Text": " the indicators via its docker deployment and then also with the redirector playbook it's"
    },
    {
      "Time_Start": 1248.4,
      "Time_End": 1254.92,
      "Text": " going to lock down sort of 443 and internet ports, so it only goes through the redirector."
    },
    {
      "Time_Start": 1254.92,
      "Time_End": 1260.0800000000002,
      "Text": " So with that set, you can now see that's updated to configured and we'll configure the redirector"
    },
    {
      "Time_Start": 1260.0800000000002,
      "Time_End": 1263.98,
      "Text": " and again you get linked resources, so it says redirector C2, these can be the phishing"
    },
    {
      "Time_Start": 1263.98,
      "Time_End": 1268.68,
      "Text": " servers or C2s and it will automatically populate the backend NGINX configurations to make sure"
    },
    {
      "Time_Start": 1268.68,
      "Time_End": 1274.0600000000002,
      "Text": " the right ports go to the right tail scale server IPs and you're kind of good to go."
    },
    {
      "Time_Start": 1274.06,
      "Time_End": 1282.3,
      "Text": " So we'll do a redirector on here, so we'll go for gscott.com, so basically covert redirect"
    },
    {
      "Time_Start": 1282.3,
      "Time_End": 1285.46,
      "Text": " URL, so anything that doesn't match any of the rules within our NGINX config is going"
    },
    {
      "Time_Start": 1285.46,
      "Time_End": 1290.5,
      "Text": " to be automatically redirected and we'll hit build on that."
    },
    {
      "Time_Start": 1290.5,
      "Time_End": 1294.1399999999999,
      "Text": " So that will build everything in that project group and while that builds, because that"
    },
    {
      "Time_Start": 1294.1399999999999,
      "Time_End": 1297.34,
      "Text": " will take a little bit of time, we'll go have a look around some of the other kind of project"
    },
    {
      "Time_Start": 1297.34,
      "Time_End": 1300.86,
      "Text": " areas and one of the things I said I wanted to do was kind of unify as much information,"
    },
    {
      "Time_Start": 1300.8600000000001,
      "Time_End": 1307.0200000000002,
      "Text": " so things like managing DNS records can be fully done within the portal, so we can do"
    },
    {
      "Time_Start": 1307.0200000000002,
      "Time_End": 1310.9,
      "Text": " automatic mail gun registration, so click a button, you're automatically registered"
    },
    {
      "Time_Start": 1310.9,
      "Time_End": 1314.3000000000002,
      "Text": " with a mail gun, everything's done, everything's set up and the domain's added, you can then"
    },
    {
      "Time_Start": 1314.3000000000002,
      "Time_End": 1319.2,
      "Text": " just go add your SMTP user, you're good to go, phishing, everything else like that."
    },
    {
      "Time_Start": 1319.2,
      "Time_End": 1324.0200000000002,
      "Text": " We can add custom records directly, we can do reputation checks, so you can see this"
    },
    {
      "Time_Start": 1324.0200000000002,
      "Time_End": 1328.98,
      "Text": " hooks into virus total, these can be run as part of a cron job or independently, so this"
    },
    {
      "Time_Start": 1329.02,
      "Time_End": 1332.7,
      "Text": " is probably quite similar to anyone who uses Ghostwriter, they have a DNS or a domain name"
    },
    {
      "Time_Start": 1332.7,
      "Time_End": 1337.82,
      "Text": " kind of register and management platform and that's where I kind of got the inspiration"
    },
    {
      "Time_Start": 1337.82,
      "Time_End": 1339.66,
      "Text": " from that."
    },
    {
      "Time_Start": 1339.66,
      "Time_End": 1343.54,
      "Text": " This again is also showing that Terraform's running, there's a single backend queue at"
    },
    {
      "Time_Start": 1343.54,
      "Time_End": 1348.46,
      "Text": " the moment until I got it working, so if you're running a job and a Terraform job's running,"
    },
    {
      "Time_Start": 1348.46,
      "Time_End": 1352.7,
      "Text": " all other jobs that rely on Terraform, check that queue, so we can't do something like"
    },
    {
      "Time_Start": 1352.7,
      "Time_End": 1356.14,
      "Text": " an incubation domain at the moment, but what we have here usually which will click which"
    },
    {
      "Time_Start": 1356.14,
      "Time_End": 1360.5400000000002,
      "Text": " I'll come back to, we can deploy a domain based on categories either finance, health"
    },
    {
      "Time_Start": 1360.5400000000002,
      "Time_End": 1365.5400000000002,
      "Text": " or technology and it will deploy effectively a dummy website, dummy domain that you can"
    },
    {
      "Time_Start": 1365.5400000000002,
      "Time_End": 1369.3400000000001,
      "Text": " leave up to age and make your domain look legitimate for like a period of time, which"
    },
    {
      "Time_Start": 1369.3400000000001,
      "Time_End": 1372.1000000000001,
      "Text": " is pretty handy."
    },
    {
      "Time_Start": 1372.1000000000001,
      "Time_End": 1376.94,
      "Text": " Recent features as well we've added is project IOCs as well, so again this is all API driven,"
    },
    {
      "Time_Start": 1376.94,
      "Time_End": 1382.3000000000002,
      "Text": " so we have ingesters that we can fire files into or points at file paths, it will go through"
    },
    {
      "Time_Start": 1382.3,
      "Time_End": 1386.58,
      "Text": " and add all the file hashes for the files you want to put in there, we can also go through"
    },
    {
      "Time_Start": 1386.58,
      "Time_End": 1392.26,
      "Text": " and add manual project IOCs, things like registry keys, service names, user agents, stuff like"
    },
    {
      "Time_Start": 1392.26,
      "Time_End": 1395.78,
      "Text": " that that we can then export and put into our reporting."
    },
    {
      "Time_Start": 1395.78,
      "Time_End": 1399.86,
      "Text": " Op logs are pretty new, I think I finished it this week, I think it's still in my features"
    },
    {
      "Time_Start": 1399.86,
      "Time_End": 1405.34,
      "Text": " to do but I did it, so for example this is working at the moment with stage one and Cobalt,"
    },
    {
      "Time_Start": 1405.34,
      "Time_End": 1409.26,
      "Text": " so it will automatically parse logs as they're created and fire them to the API so we can"
    },
    {
      "Time_Start": 1409.26,
      "Time_End": 1413.9,
      "Text": " see when a new beacon comes in, we can also see when certain commands are run, we get"
    },
    {
      "Time_Start": 1413.9,
      "Time_End": 1418.86,
      "Text": " the output for them and then they're also automatically categorized based on their TTP"
    },
    {
      "Time_Start": 1418.86,
      "Time_End": 1423.22,
      "Text": " and what the command is that's run based on the database and that's populated, we can"
    },
    {
      "Time_Start": 1423.22,
      "Time_End": 1428.58,
      "Text": " export that directly into our reporting platform or provide it to the blue team so they can"
    },
    {
      "Time_Start": 1428.58,
      "Time_End": 1433.74,
      "Text": " see our full timeline of activity of what we're doing."
    },
    {
      "Time_Start": 1433.74,
      "Time_End": 1437.42,
      "Text": " So yeah, that's like I said, that's one of my key ideas, when I say unified red team"
    },
    {
      "Time_Start": 1437.46,
      "Time_End": 1442.8600000000001,
      "Text": " automation, it really is to go back to like five year ago vibe of like single pane of"
    },
    {
      "Time_Start": 1442.8600000000001,
      "Time_End": 1448.22,
      "Text": " glass I guess would be the cliche term of bringing as much information together so you"
    },
    {
      "Time_Start": 1448.22,
      "Time_End": 1452.7,
      "Text": " can make like good decisions as an operator, good decisions as a lead and see what's going"
    },
    {
      "Time_Start": 1452.7,
      "Time_End": 1455.42,
      "Text": " on across your entire team."
    },
    {
      "Time_Start": 1455.42,
      "Time_End": 1459.46,
      "Text": " So let's check back in and see how this is running, so the job is finished, you can see"
    },
    {
      "Time_Start": 1459.46,
      "Time_End": 1464.66,
      "Text": " the tail scale IPs have been updated, there's public IPs for both resources as by default"
    },
    {
      "Time_Start": 1464.66,
      "Time_End": 1470.02,
      "Text": " the mail templates automatically set up a public IP, but now the final step would just"
    },
    {
      "Time_Start": 1470.02,
      "Time_End": 1482.02,
      "Text": " be to run playbooks, so again we'll hit run maybe, I just can't click, if in doubt, so"
    },
    {
      "Time_Start": 1482.02,
      "Time_End": 1491.66,
      "Text": " configured, configured, built, yep, now click is not working, demo gods, come on, why you"
    },
    {
      "Time_Start": 1491.78,
      "Time_End": 1498.78,
      "Text": " do this to me, quick jump over, cannot process male profile, it's because there is no male"
    },
    {
      "Time_Start": 1498.78,
      "Time_End": 1507.14,
      "Text": " profile, it's probably why, fat fingers, never mind, phishing reader copy, so there we go,"
    },
    {
      "Time_Start": 1507.14,
      "Time_End": 1511.3400000000001,
      "Text": " so if you have a malleable profile playbook and it detects that you're using a malleable"
    },
    {
      "Time_Start": 1511.3400000000001,
      "Time_End": 1515.7,
      "Text": " profile and there's a stage one or a Cobalt strike malleable profile attached, it will"
    },
    {
      "Time_Start": 1515.7,
      "Time_End": 1521.42,
      "Text": " effectively pass it for you and populate that into the nginx config, so you have everything"
    },
    {
      "Time_Start": 1521.46,
      "Time_End": 1527.46,
      "Text": " ready to go for you and it should all be set up, so in theory now, that still doesn't run,"
    },
    {
      "Time_Start": 1527.46,
      "Time_End": 1531.66,
      "Text": " oh it does, there we go, so run playbook will now run, it will go through and do that, so"
    },
    {
      "Time_Start": 1531.66,
      "Time_End": 1534.94,
      "Text": " you can see again on the back end if you have a look, like it will set up the nginx phishing"
    },
    {
      "Time_Start": 1534.94,
      "Time_End": 1539.02,
      "Text": " server, redirects, all of that stuff, so we can check in on how that's going, but it seems"
    },
    {
      "Time_Start": 1539.02,
      "Time_End": 1542.42,
      "Text": " to be ticking along quite happily."
    },
    {
      "Time_Start": 1542.42,
      "Time_End": 1547.38,
      "Text": " One other thing we've added recently and again is part of ongoing features, threat groups,"
    },
    {
      "Time_Start": 1547.38,
      "Time_End": 1551.8600000000001,
      "Text": " emulation plans and op vaults, so threat groups for example, we can import direct sticks"
    },
    {
      "Time_Start": 1551.8600000000001,
      "Time_End": 1557.7,
      "Text": " information, pass it and have groups, so we can edit TTPs, threat profiles and eventually"
    },
    {
      "Time_Start": 1557.7,
      "Time_End": 1561.2600000000002,
      "Text": " the plan is to have built emulation plans that we can import directly into vector for"
    },
    {
      "Time_Start": 1561.2600000000002,
      "Time_End": 1568.14,
      "Text": " purple teaming, but that's still kind of in progress, another idea which again, I have"
    },
    {
      "Time_Start": 1568.14,
      "Time_End": 1572.1000000000001,
      "Text": " to give a bit of credit to the Outflank guys for this, we kind of got inspiration from"
    },
    {
      "Time_Start": 1572.1000000000001,
      "Time_End": 1577.3400000000001,
      "Text": " using OST, so they have a way of sharing approaches and recipes effectively within their platform,"
    },
    {
      "Time_Start": 1577.38,
      "Time_End": 1583.1000000000001,
      "Text": " for different users, so one thing we've now included is a kind of an op vault, so this"
    },
    {
      "Time_Start": 1583.1000000000001,
      "Time_End": 1588.2200000000003,
      "Text": " allows us to pass various tools, import their Yara rules which will then eventually be applied"
    },
    {
      "Time_Start": 1588.2200000000003,
      "Time_End": 1594.7800000000002,
      "Text": " to CICD pipelines as tools are built, we can also pull out their detection rules, so this"
    },
    {
      "Time_Start": 1594.7800000000002,
      "Time_End": 1599.2,
      "Text": " for example is using Elastic, so it's their publicly available rules, and we can add kind"
    },
    {
      "Time_Start": 1599.2,
      "Time_End": 1604.5000000000002,
      "Text": " of bypass guidance, so if we've seen certain rules or certain detections during engagements,"
    },
    {
      "Time_Start": 1604.5,
      "Time_End": 1607.86,
      "Text": " perhaps as an operator come in for the next person to say look, if you're operating against"
    },
    {
      "Time_Start": 1607.86,
      "Time_End": 1614.06,
      "Text": " Elastic, consider taking this particular steps to avoid this, we've seen this being a detection,"
    },
    {
      "Time_Start": 1614.06,
      "Time_End": 1618.14,
      "Text": " use X, Y and Z repo, blah, blah, blah, also things like operational considerations can"
    },
    {
      "Time_Start": 1618.14,
      "Time_End": 1624.02,
      "Text": " be added as well, so if you're operating against Elastic EDR, don't use run DLL, use unicorn.dll"
    },
    {
      "Time_Start": 1624.02,
      "Time_End": 1629.3,
      "Text": " et cetera, so this is something we're hoping to kind of build out over time, as we engage"
    },
    {
      "Time_Start": 1629.3,
      "Time_End": 1633.22,
      "Text": " more and more kind of, as we do more and more engagements, we learn more and more about"
    },
    {
      "Time_Start": 1633.5,
      "Time_End": 1637.82,
      "Text": " different EDRs and we have somewhere to store that information, so yeah, that's something"
    },
    {
      "Time_Start": 1637.82,
      "Time_End": 1641.74,
      "Text": " quite cool that we added recently, we'll see if this playbook is still running, it still"
    },
    {
      "Time_Start": 1641.74,
      "Time_End": 1646.22,
      "Text": " is of course, so GoFish is still installing, it's installing Go, which will probably take"
    },
    {
      "Time_Start": 1646.22,
      "Time_End": 1650.82,
      "Text": " forever, but we can have a look at some of the other ones, so you can see kind of tail"
    },
    {
      "Time_Start": 1650.82,
      "Time_End": 1656.42,
      "Text": " scale IPs here for example for stage one, so if you go look at 107.4, I should show"
    },
    {
      "Time_Start": 1656.42,
      "Time_End": 1663.06,
      "Text": " the API, so Ninja API for those who haven't used it is quite interesting, it has all the"
    },
    {
      "Time_Start": 1663.26,
      "Time_End": 1669.1399999999999,
      "Text": " features, like I said, a fast API, so you get automatic API documentation, so everything"
    },
    {
      "Time_Start": 1669.1399999999999,
      "Time_End": 1673.58,
      "Text": " is generated as you go through, you don't need to mess around with any of that, and"
    },
    {
      "Time_Start": 1673.58,
      "Time_End": 1678.3,
      "Text": " like I said, I've tried to kind of keep everything API driven as much as possible, and this just"
    },
    {
      "Time_Start": 1678.3,
      "Time_End": 1683.82,
      "Text": " allows us to use it in as many different ways as possible, things like the op log and like"
    },
    {
      "Time_Start": 1683.82,
      "Time_End": 1690.82,
      "Text": " Yara parsers and Yara importers are much easier when you have an API to work with, so I didn't"
    },
    {
      "Time_Start": 1690.82,
      "Time_End": 1695.3799999999999,
      "Text": " think actually I'd be stood around waiting in all my demos, but there we go."
    },
    {
      "Time_Start": 1695.3799999999999,
      "Time_End": 1698.62,
      "Text": " One of the other things we can quickly do, I should just show you this, if it works,"
    },
    {
      "Time_Start": 1698.62,
      "Time_End": 1703.62,
      "Text": " so again this is a brand new domain, you can see that these new records have been added,"
    },
    {
      "Time_Start": 1703.62,
      "Time_End": 1709.34,
      "Text": " we should also be able to just hit mailgun, and hope nothing goes wrong on the back end,"
    },
    {
      "Time_Start": 1709.34,
      "Time_End": 1713.74,
      "Text": " and this will now go off to query mailgun, we hit refresh again, and we see that all"
    },
    {
      "Time_Start": 1713.74,
      "Time_End": 1719.3799999999999,
      "Text": " of those MX records, all of the NS records, the CNAMEs, everything have been added, so"
    },
    {
      "Time_Start": 1719.6200000000001,
      "Time_End": 1724.2600000000002,
      "Text": " like I said, this domain is now fully configured to be used with mailgun."
    },
    {
      "Time_Start": 1724.2600000000002,
      "Time_End": 1728.74,
      "Text": " The other things we can do is also assign domain names to certain projects, so we know"
    },
    {
      "Time_Start": 1728.74,
      "Time_End": 1732.8200000000002,
      "Text": " when a domain name is in use, add notes for things to ensure other teams aren't using"
    },
    {
      "Time_Start": 1732.8200000000002,
      "Time_End": 1737.38,
      "Text": " it for phishing, if it's reserved for red teaming or something else, but that's pretty"
    },
    {
      "Time_Start": 1737.38,
      "Time_End": 1740.8200000000002,
      "Text": " much how we designed it, so it can be used by any member of the team, you can be a seasoned"
    },
    {
      "Time_Start": 1740.8200000000002,
      "Time_End": 1745.8200000000002,
      "Text": " red teamer and jump in and deploy your infrastructure or just need to do a quick phishing assessment."
    },
    {
      "Time_Start": 1746.82,
      "Time_End": 1747.82,
      "Text": " Why does this take so long?"
    },
    {
      "Time_Start": 1748.82,
      "Time_End": 1750.82,
      "Text": " Building Go Fish from Source."
    },
    {
      "Time_Start": 1752.82,
      "Time_End": 1753.82,
      "Text": " What a time."
    },
    {
      "Time_Start": 1757.82,
      "Time_End": 1758.82,
      "Text": " Stand around."
    },
    {
      "Time_Start": 1758.82,
      "Time_End": 1760.82,
      "Text": " Everyone spends all their life just staring at spinny wheels."
    },
    {
      "Time_Start": 1762.82,
      "Time_End": 1770.82,
      "Text": " But we'll show you one of the other redirectors as well, so if we have a look at stage one,"
    },
    {
      "Time_Start": 1770.82,
      "Time_End": 1775.82,
      "Text": " again, once an operator's joined to their network, we can quickly jump into any of the"
    },
    {
      "Time_Start": 1775.82,
      "Time_End": 1780.82,
      "Text": " back end stage ones, if that API, if that IP is even correct."
    },
    {
      "Time_Start": 1780.82,
      "Time_End": 1781.82,
      "Text": " 174, 177."
    },
    {
      "Time_Start": 1785.82,
      "Time_End": 1790.82,
      "Text": " 174, 177, 177."
    },
    {
      "Time_Start": 1791.82,
      "Time_End": 1792.82,
      "Text": " 177."
    },
    {
      "Time_Start": 1797.82,
      "Time_End": 1801.82,
      "Text": " So you can see this dives now directly into our stage one instance, and again, this is"
    },
    {
      "Time_Start": 1801.82,
      "Time_End": 1806.82,
      "Text": " all private, it's all self-contained, there's no public ports exposed, there's no need to"
    },
    {
      "Time_Start": 1806.82,
      "Time_End": 1811.82,
      "Text": " risk anyone else being able to get access to our C2 infrastructure, even the AWS instances"
    },
    {
      "Time_Start": 1811.82,
      "Time_End": 1815.82,
      "Text": " themselves can't talk to each other, it all only happens over tail scale."
    },
    {
      "Time_Start": 1816.82,
      "Time_End": 1817.82,
      "Text": " So, there we go."
    },
    {
      "Time_Start": 1820.82,
      "Time_End": 1821.82,
      "Text": " IP table is ticking through now."
    },
    {
      "Time_Start": 1824.82,
      "Time_End": 1825.82,
      "Text": " Update config files."
    },
    {
      "Time_Start": 1825.82,
      "Time_End": 1828.82,
      "Text": " This is the slowest Playbook deploy I've ever done."
    },
    {
      "Time_Start": 1830.82,
      "Time_End": 1836.82,
      "Text": " And then we start Go Fish again now, so this should be the final task, he says."
    },
    {
      "Time_Start": 1837.82,
      "Time_End": 1841.82,
      "Text": " And what we also do here at the last stage is to cap the login credentials, so they're"
    },
    {
      "Time_Start": 1841.82,
      "Time_End": 1845.82,
      "Text": " available for certain things within the actual portal themselves, so now that job's been"
    },
    {
      "Time_Start": 1845.82,
      "Time_End": 1846.82,
      "Text": " completed."
    },
    {
      "Time_Start": 1846.82,
      "Time_End": 1850.82,
      "Text": " If you need to then sign into the Go Fish instance, for example, that we've got, we"
    },
    {
      "Time_Start": 1850.82,
      "Time_End": 1851.82,
      "Text": " can scroll down through here."
    },
    {
      "Time_Start": 1853.82,
      "Time_End": 1854.82,
      "Text": " Hit refresh."
    },
    {
      "Time_Start": 1855.82,
      "Time_End": 1856.82,
      "Text": " Scroll down through here."
    },
    {
      "Time_Start": 1856.82,
      "Time_End": 1858.82,
      "Text": " And we can go find the password and username."
    },
    {
      "Time_Start": 1860.82,
      "Time_End": 1862.82,
      "Text": " So, you can just literally grab out the admin password."
    },
    {
      "Time_Start": 1864.82,
      "Time_End": 1866.82,
      "Text": " We'll go grab the IP as well."
    },
    {
      "Time_Start": 1868.82,
      "Time_End": 1869.82,
      "Text": " Go Fish."
    },
    {
      "Time_Start": 1872.82,
      "Time_End": 1874.82,
      "Text": " So, now this has all been built on the fly here now."
    },
    {
      "Time_Start": 1876.82,
      "Time_End": 1877.82,
      "Text": " So, we're going to go ahead and do that."
    },
    {
      "Time_Start": 1879.82,
      "Time_End": 1880.82,
      "Text": " So, we're going to go ahead and do that."
    },
    {
      "Time_Start": 1880.82,
      "Time_End": 1881.82,
      "Text": " Hit refresh."
    },
    {
      "Time_Start": 1884.82,
      "Time_End": 1886.82,
      "Text": " So, now this has all been built on the fly here now."
    },
    {
      "Time_Start": 1891.82,
      "Time_End": 1892.82,
      "Text": " Yes."
    },
    {
      "Time_Start": 1897.82,
      "Time_End": 1903.82,
      "Text": " So, you can see in terms of deployments, in preparation for things like our assumed"
    },
    {
      "Time_Start": 1903.82,
      "Time_End": 1907.82,
      "Text": " breach assessments, our deployment times have gone from having to mess around for a day"
    },
    {
      "Time_Start": 1907.82,
      "Time_End": 1908.82,
      "Text": " with the infrastructure up and running."
    },
    {
      "Time_Start": 1908.82,
      "Time_End": 1912.82,
      "Text": " We can get payloads up and running and be testing payloads within 20 minutes, half an"
    },
    {
      "Time_Start": 1912.82,
      "Time_End": 1917.82,
      "Text": " hour, so it's made like a hell of a difference in terms of deployment times."
    },
    {
      "Time_Start": 1919.82,
      "Time_End": 1920.82,
      "Text": " Go back in here."
    },
    {
      "Time_Start": 1920.82,
      "Time_End": 1922.82,
      "Text": " And that's all working, he says."
    },
    {
      "Time_Start": 1925.82,
      "Time_End": 1930.82,
      "Text": " One other thing we can just quickly do is just go and make sure and verify that the"
    },
    {
      "Time_Start": 1930.82,
      "Time_End": 1934.82,
      "Text": " redirector for our domain is also bouncing traffic."
    },
    {
      "Time_Start": 1935.82,
      "Time_End": 1940.82,
      "Text": " So, hopefully if we go here, we should get redirected to ZFcon."
    },
    {
      "Time_Start": 1941.82,
      "Time_End": 1942.82,
      "Text": " And we do."
    },
    {
      "Time_Start": 1943.82,
      "Time_End": 1944.82,
      "Text": " So, again, that's covert, that's hidden."
    },
    {
      "Time_Start": 1944.82,
      "Time_End": 1949.82,
      "Text": " It's got private location files for certain areas to actually allow traffic through to"
    },
    {
      "Time_Start": 1949.82,
      "Time_End": 1952.82,
      "Text": " the Go Fish instance, and Go Fish is up and running and ready."
    },
    {
      "Time_Start": 1952.82,
      "Time_End": 1956.82,
      "Text": " So, a bit slower than I planned, probably over a hotspot, but that's pretty much the"
    },
    {
      "Time_Start": 1956.82,
      "Time_End": 1959.82,
      "Text": " end-to-end process of deploying infrastructure."
    },
    {
      "Time_Start": 1959.82,
      "Time_End": 1963.82,
      "Text": " And you can just keep adding more and more resources up here, for example."
    },
    {
      "Time_Start": 1963.82,
      "Time_End": 1967.82,
      "Text": " As you see in the top group, there's two, four different examples of different resources."
    },
    {
      "Time_Start": 1967.82,
      "Time_End": 1971.82,
      "Text": " We can just keep piling different resources on top of each other, configuring them and"
    },
    {
      "Time_Start": 1971.82,
      "Time_End": 1974.82,
      "Text": " deploying them, and they will just work."
    },
    {
      "Time_Start": 1974.82,
      "Time_End": 1977.82,
      "Text": " They won't interfere with other existing deployments."
    },
    {
      "Time_Start": 1977.82,
      "Time_End": 1979.82,
      "Text": " Everything's segregated from each other."
    },
    {
      "Time_Start": 1979.82,
      "Time_End": 1981.82,
      "Text": " And as I keep saying, it just works."
    },
    {
      "Time_Start": 1982.82,
      "Time_End": 1986.82,
      "Text": " So, the feature roadmap that's coming up is Oplog, which is now in there."
    },
    {
      "Time_Start": 1986.82,
      "Time_End": 1991.82,
      "Text": " But the emulation builder for indices for vector will also be added in soon."
    },
    {
      "Time_Start": 1991.82,
      "Time_End": 1994.82,
      "Text": " LLM integration as well, to allow us to query data that's there."
    },
    {
      "Time_Start": 1994.82,
      "Time_End": 1999.82,
      "Text": " It's particularly helpful now that you can tag a project to using a certain EDR provider"
    },
    {
      "Time_Start": 1999.82,
      "Time_End": 2002.82,
      "Text": " and also have the op vault that you can go through and gather all that information."
    },
    {
      "Time_Start": 2002.82,
      "Time_End": 2007.82,
      "Text": " CICD pipelines, again, to integrate with YAR and build toolkits for each project."
    },
    {
      "Time_Start": 2007.82,
      "Time_End": 2010.82,
      "Text": " So, if you have a project, you can have an approved toolkit based on the provider you're"
    },
    {
      "Time_Start": 2010.82,
      "Time_End": 2012.82,
      "Text": " using or going up against."
    },
    {
      "Time_Start": 2012.82,
      "Time_End": 2016.82,
      "Text": " And then expanding those project build queues out to rather than being one over the whole"
    },
    {
      "Time_Start": 2016.82,
      "Time_End": 2020.82,
      "Text": " platform, it's one per project, so you can do multiple builds at the same time."
    },
    {
      "Time_Start": 2022.82,
      "Time_End": 2027.82,
      "Text": " And this week, there will be a fast API proof of concept for the kind of original version"
    },
    {
      "Time_Start": 2027.82,
      "Time_End": 2029.82,
      "Text": " that started it all."
    },
    {
      "Time_Start": 2029.82,
      "Time_End": 2034.82,
      "Text": " So, it'll allow you to build infrastructure over just a basic API."
    },
    {
      "Time_Start": 2034.82,
      "Time_End": 2037.82,
      "Text": " There's no backend database or interconnectivity of the resources."
    },
    {
      "Time_Start": 2037.82,
      "Time_End": 2041.82,
      "Text": " But you can kind of check out my spaghetti code and see what I've done in terms of moving"
    },
    {
      "Time_Start": 2041.82,
      "Time_End": 2043.82,
      "Text": " templates around and working with it."
    },
    {
      "Time_Start": 2043.82,
      "Time_End": 2047.82,
      "Text": " Toward the end of the year, I'm going to release the infrastructure and project module."
    },
    {
      "Time_Start": 2047.82,
      "Time_End": 2051.8199999999997,
      "Text": " So, you'll be able to add projects and release infrastructure for it."
    },
    {
      "Time_Start": 2051.8199999999997,
      "Time_End": 2054.8199999999997,
      "Text": " And then in the future, once all the features are complete, I haven't really thought that"
    },
    {
      "Time_Start": 2054.8199999999997,
      "Time_End": 2058.8199999999997,
      "Text": " far, but at the moment, it's going to remain sort of closed source with more and more features"
    },
    {
      "Time_Start": 2058.8199999999997,
      "Time_End": 2060.8199999999997,
      "Text": " added to the public source version as we go forward."
    },
    {
      "Time_Start": 2060.8199999999997,
      "Time_End": 2062.8199999999997,
      "Text": " So, yeah."
    },
    {
      "Time_Start": 2062.8199999999997,
      "Time_End": 2065.8199999999997,
      "Text": " Thank you for listening to me bang on about infrastructure."
    }
  ]
}