{
  "metadata": {
    "webpage_url": "https://www.youtube.com/watch?v=cHhxJzavq5I",
    "title": "TROOPERS24: Apple CarPlay - What's Under the Hood",
    "description": "Talk by Hannah Nöttgen - June 27th, 2024 at TROOPERS24 IT security conference in Heidelberg, Germany hosted by @ERNW_ITSec\n\n#TROOPERS24 #ITsecurity \nhttps://troopers.de/troopers24/talks/8mcykg/\n\nMore impressions:\n  / wearetroopers  \n  / ernw_itsec  \nhttps://infosec.exchange/@WEareTROOPERS\nhttps://infosec.exchange/@ERNW https://ernw.de",
    "channel_url": "https://www.youtube.com/channel/UCPY5aUREHmbDO4PtR6AYLfQ",
    "duration": 1902,
    "channel": "TROOPERS IT Security Conference",
    "uploader": "TROOPERS IT Security Conference",
    "upload_date": "20240909"
  },
  "segments": {
    "metadata": {
      "webpage_url": "https://www.youtube.com/watch?v=cHhxJzavq5I",
      "title": "TROOPERS24: Apple CarPlay - What's Under the Hood",
      "description": "Talk by Hannah Nöttgen - June 27th, 2024 at TROOPERS24 IT security conference in Heidelberg, Germany hosted by @ERNW_ITSec\n\n#TROOPERS24 #ITsecurity \nhttps://troopers.de/troopers24/talks/8mcykg/\n\nMore impressions:\n  / wearetroopers  \n  / ernw_itsec  \nhttps://infosec.exchange/@WEareTROOPERS\nhttps://infosec.exchange/@ERNW https://ernw.de",
      "channel_url": "https://www.youtube.com/channel/UCPY5aUREHmbDO4PtR6AYLfQ",
      "duration": 1902,
      "channel": "TROOPERS IT Security Conference",
      "uploader": "TROOPERS IT Security Conference",
      "upload_date": "20240909"
    },
    "segments": [
      {
        "Time_Start": 0.0,
        "Time_End": 21.76,
        "Text": "This text was transcribed using whisper model: large-v2\n\n Thank you for the introduction and I'm glad to see so many people here in the last slot."
      },
      {
        "Time_Start": 21.76,
        "Time_End": 27.68,
        "Text": " As already said, my name is Hanna Nöttgen and I'm currently working at CIMO and my research"
      },
      {
        "Time_Start": 27.759999999999998,
        "Time_End": 34.72,
        "Text": " topic is Apple CarPlay and this is also what this talk here is about. A little disclaimer"
      },
      {
        "Time_Start": 34.72,
        "Time_End": 41.04,
        "Text": " at the beginning, this will be a reversing talk and we have a little bit of security at the end."
      },
      {
        "Time_Start": 42.56,
        "Time_End": 51.760000000000005,
        "Text": " Okay, so what is CarPlay? Like the first question. So here we can see a lot of CarPlay"
      },
      {
        "Time_Start": 51.76,
        "Time_End": 58.96,
        "Text": " related things. So we have the iPhone as main component in Apple CarPlay. It runs the application"
      },
      {
        "Time_Start": 59.519999999999996,
        "Time_End": 67.6,
        "Text": " and then we see different connection options. Like we have wireless connections over Bluetooth"
      },
      {
        "Time_Start": 67.6,
        "Time_End": 76.56,
        "Text": " and Wi-Fi but we also can have a cabled option over lightning cable. We have the integration"
      },
      {
        "Time_Start": 76.64,
        "Time_End": 85.12,
        "Text": " of native apps like Siri for voice recognition, phone calls, iMessages and of course navigation."
      },
      {
        "Time_Start": 86.08,
        "Time_End": 92.0,
        "Text": " Additionally we have in CarPlay third-party functionalities. Like here for example we have"
      },
      {
        "Time_Start": 92.80000000000001,
        "Time_End": 101.12,
        "Text": " the FordPass app for remote controlling your car, EasyPark or Domino's for ordering pizza on the"
      },
      {
        "Time_Start": 101.12,
        "Time_End": 110.32000000000001,
        "Text": " go. This very important feature. Then we have peripheral devices like we have the sound system"
      },
      {
        "Time_Start": 110.32000000000001,
        "Time_End": 121.68,
        "Text": " of our car integrated, the touch display of our head unit and so the next thing which will come"
      },
      {
        "Time_Start": 121.68,
        "Time_End": 127.76,
        "Text": " with CarPlay 2.0 is like integration of instrument cluster or digital instrument cluster."
      },
      {
        "Time_Start": 128.32,
        "Time_End": 138.0,
        "Text": " So for Apple CarPlay, Apple didn't reinvent the wheel. So they use already familiar protocols."
      },
      {
        "Time_Start": 139.84,
        "Time_End": 146.64000000000001,
        "Text": " We have here the iApp version 2 protocol for accessory communication and the main purpose"
      },
      {
        "Time_Start": 146.64000000000001,
        "Time_End": 154.4,
        "Text": " in CarPlay is the authentication but we also have the AirPlay protocol which is known as"
      },
      {
        "Time_Start": 154.72,
        "Time_End": 156.96,
        "Text": " common streaming protocol."
      },
      {
        "Time_Start": 160.24,
        "Time_End": 168.08,
        "Text": " Yeah so my main motivation to research this topic was a little bit security related. So"
      },
      {
        "Time_Start": 168.8,
        "Time_End": 174.56,
        "Text": " first I asked the question why CarPlay could be an interesting target for an attacker."
      },
      {
        "Time_Start": 175.28,
        "Time_End": 183.6,
        "Text": " So we have a few cool features coming with this. We have a kind of remote execution because the"
      },
      {
        "Time_Start": 183.6,
        "Time_End": 192.79999999999998,
        "Text": " apps from CarPlay can be started over touch input on the head unit and sometimes we also have"
      },
      {
        "Time_Start": 192.79999999999998,
        "Time_End": 200.48,
        "Text": " keyboard input. Also CarPlay has access to a wealth of private information like"
      },
      {
        "Time_Start": 201.2,
        "Time_End": 208.88,
        "Text": " iMessage, emails, what I already mentioned and we should not forget that it has influence on"
      },
      {
        "Time_Start": 208.88,
        "Time_End": 217.2,
        "Text": " driver safety so it could easily distract the driver. What also is worth mentioning is that"
      },
      {
        "Time_Start": 217.2,
        "Time_End": 225.04,
        "Text": " CarPlay is allowed to do all of these things without unlocking the iPhone because this is"
      },
      {
        "Time_Start": 225.04,
        "Time_End": 234.4,
        "Text": " a default setting in CarPlay. So in the next few slides I want to introduce you a bit of my setup."
      },
      {
        "Time_Start": 235.04,
        "Time_End": 245.12,
        "Text": " So I had two different head units. The first one was a Ford Sync 3 head unit attached to the"
      },
      {
        "Time_Start": 245.12,
        "Time_End": 254.24,
        "Text": " whole car. The problem was it was very uncomfortable to work with and my neighbors thought I tried to"
      },
      {
        "Time_Start": 254.24,
        "Time_End": 262.16,
        "Text": " steal the car or something and yeah the next thing that the experiments were draining the car"
      },
      {
        "Time_Start": 262.16,
        "Time_End": 270.24,
        "Text": " battery so you already had to start the engine after 50 minutes. Also at the beginning I was a"
      },
      {
        "Time_Start": 270.24,
        "Time_End": 280.16,
        "Text": " little bit scared because I don't know what's going on there and I had the thought of"
      },
      {
        "Time_Start": 281.12,
        "Time_End": 290.72,
        "Text": " crashing anything and so I got a second setup like a Sony standalone head unit and this makes the"
      },
      {
        "Time_Start": 290.72,
        "Time_End": 300.56,
        "Text": " work a lot easier. So here you can see the wired CarPlay setup. We have an iPhone 8 jailbroken"
      },
      {
        "Time_Start": 301.36,
        "Time_End": 309.68,
        "Text": " connected with lightning to the car and since you use lightning cable for the connection to the car"
      },
      {
        "Time_Start": 309.68,
        "Time_End": 319.44000000000005,
        "Text": " you have to use Wi-Fi for connecting your notebook via Frida because there is no suitable adapter."
      },
      {
        "Time_Start": 320.4,
        "Time_End": 333.68,
        "Text": " So here is the wireless setup. My problem was my personal car was not able to do wireless CarPlay"
      },
      {
        "Time_Start": 333.68,
        "Time_End": 344.0,
        "Text": " so we do a trick and bought like this off-the-shelf product which is called CarLink Kit 4.0 adapter"
      },
      {
        "Time_Start": 344.72,
        "Time_End": 354.08,
        "Text": " and so we could make a wireless connection between iPhone and car which was very useful"
      },
      {
        "Time_Start": 354.08,
        "Time_End": 363.52,
        "Text": " for example for packet capturing and also dynamic reversing was easier and yeah then we had"
      },
      {
        "Time_Start": 363.52,
        "Time_End": 371.2,
        "Text": " the port free and we could connect our notebook over lightning. So now we do a little bit of a"
      },
      {
        "Time_Start": 371.2,
        "Time_End": 382.24,
        "Text": " deep dive into CarPlay system. So this is the short version of included processes that are"
      },
      {
        "Time_Start": 382.24,
        "Time_End": 392.15999999999997,
        "Text": " important for CarPlay. So we see here our main applications CarPlay with its two smaller sidekicks"
      },
      {
        "Time_Start": 392.15999999999997,
        "Time_End": 400.56,
        "Text": " like CarPlay wallpaper and CarPlay settings and then they also work together with the springboard"
      },
      {
        "Time_Start": 400.56,
        "Time_End": 408.88,
        "Text": " and the backboard daemon and they are responsible for processing UI or touch events."
      },
      {
        "Time_Start": 410.72,
        "Time_End": 416.96,
        "Text": " So here the accessory daemon is used for communicating our iApp version 2.0."
      },
      {
        "Time_Start": 418.4,
        "Time_End": 427.36,
        "Text": " We have the media server daemon which is responsible for CarPlay and yeah like the"
      },
      {
        "Time_Start": 427.36,
        "Time_End": 433.92,
        "Text": " CarKit daemon is the one daemon instrumenting all the stuff over this so-called CarKit service"
      },
      {
        "Time_Start": 433.92,
        "Time_End": 445.6,
        "Text": " but we have later more on this. Yeah so what are important workflows like in CarPlay."
      },
      {
        "Time_Start": 445.6,
        "Time_End": 451.84000000000003,
        "Text": " So for starting CarPlay the car is communicating we assume here the wireless setting"
      },
      {
        "Time_Start": 452.32000000000005,
        "Time_End": 461.28000000000003,
        "Text": " over bluetooth classic and makes the standard device and service discovery with the iPhone."
      },
      {
        "Time_Start": 463.12,
        "Time_End": 471.28000000000003,
        "Text": " So the bluetooth daemon then sends the information to the user event agent which is like"
      },
      {
        "Time_Start": 471.92,
        "Time_End": 478.96000000000004,
        "Text": " the neighbor process of the launch daemon and together they then take care of starting all the"
      },
      {
        "Time_Start": 479.68000000000006,
        "Time_End": 487.12000000000006,
        "Text": " processes needed for CarPlay like the CarPlay application itself, CarKit daemon or accessory daemon."
      },
      {
        "Time_Start": 490.72,
        "Time_End": 498.88000000000005,
        "Text": " The next thing is forwarding data in the system over iApp version 2.0. So we also see later that"
      },
      {
        "Time_Start": 499.04,
        "Time_End": 508.96,
        "Text": " that the iApp data can sit of various stacks. So here in this example we have bluetooth"
      },
      {
        "Time_Start": 509.6,
        "Time_End": 518.32,
        "Text": " and wi-fi. So the bluetooth messages are taken care of by the bluetooth daemon and the"
      },
      {
        "Time_Start": 519.12,
        "Time_End": 526.64,
        "Text": " wi-fi packages go to the media server daemon. They then process all this data in the"
      },
      {
        "Time_Start": 527.1999999999999,
        "Time_End": 536.48,
        "Text": " core accessory framework which is an objective c implemented and they then have a server client"
      },
      {
        "Time_Start": 536.48,
        "Time_End": 543.76,
        "Text": " model over xpc which is apple's inter-process communication with the accessory daemon."
      },
      {
        "Time_Start": 544.96,
        "Time_End": 553.36,
        "Text": " So the client can invoke messages in the server so incoming messages are transported from the"
      },
      {
        "Time_Start": 553.36,
        "Time_End": 560.5600000000001,
        "Text": " client side to the server side but also the server can invoke functions when it wants to"
      },
      {
        "Time_Start": 560.5600000000001,
        "Time_End": 570.88,
        "Text": " send data to the car. So now we somehow have to distribute information inside the CarPlay system"
      },
      {
        "Time_Start": 571.44,
        "Time_End": 579.6800000000001,
        "Text": " and therefore we have two different ways. So here the first one is over the ACC external"
      },
      {
        "Time_Start": 579.6800000000001,
        "Time_End": 587.9200000000001,
        "Text": " accessory server and this then connects to the other processes also again over the core"
      },
      {
        "Time_Start": 587.9200000000001,
        "Time_End": 597.2800000000001,
        "Text": " accessory framework and then we have a long list of processes that somehow receive information"
      },
      {
        "Time_Start": 598.0000000000001,
        "Time_End": 609.6,
        "Text": " from this. But this is more like the server knocks on the door and says hey i found a new"
      },
      {
        "Time_Start": 609.6,
        "Time_End": 616.96,
        "Text": " accessory when you want to have more information then you have to go and ask Karkit for this."
      },
      {
        "Time_Start": 617.6800000000001,
        "Time_End": 627.9200000000001,
        "Text": " And therefore the Karkit daemon and its Karkit service agent are responsible and again we have"
      },
      {
        "Time_Start": 627.9200000000001,
        "Time_End": 636.24,
        "Text": " here they are connected again over xpc with other processes. Here we have the Karkit"
      },
      {
        "Time_Start": 636.24,
        "Time_End": 646.96,
        "Text": " framework which is also an Objective-C framework and this framework for example instructs"
      },
      {
        "Time_Start": 648.24,
        "Time_End": 657.36,
        "Text": " the preferences application to set the preferences accordingly in the menu or"
      },
      {
        "Time_Start": 657.6800000000001,
        "Time_End": 667.04,
        "Text": " we can also set the Wi-Fi credentials for the Wi-Fi daemon or start advertising AirPlay over Bonjour."
      },
      {
        "Time_Start": 668.8000000000001,
        "Time_End": 677.92,
        "Text": " Now we speak of AirPlay. So the next thing in CarPlay is like the AirPlay functionality."
      },
      {
        "Time_Start": 678.56,
        "Time_End": 689.1999999999999,
        "Text": " So the AirPlay packets are arriving over Wi-Fi and wireless or like ethernet in the wired option"
      },
      {
        "Time_Start": 690.56,
        "Time_End": 699.68,
        "Text": " and then the media server daemon has the AirPlay sender framework and also more important the"
      },
      {
        "Time_Start": 699.68,
        "Time_End": 707.04,
        "Text": " AP transport framework and opposite to the other frameworks this is a C implementation"
      },
      {
        "Time_Start": 707.5999999999999,
        "Time_End": 715.52,
        "Text": " and interesting classes here is the main AirPlay session class which could have multiple streams"
      },
      {
        "Time_Start": 716.24,
        "Time_End": 725.12,
        "Text": " and in the streams then there are http packages for control messages or we also can have screen"
      },
      {
        "Time_Start": 725.12,
        "Time_End": 733.36,
        "Text": " packages for video stream. So these packets then are transformed to core media types and"
      },
      {
        "Time_Start": 733.76,
        "Time_End": 744.5600000000001,
        "Text": " they are then sent to the media framework so they can do their magic and then all these things are"
      },
      {
        "Time_Start": 745.52,
        "Time_End": 752.88,
        "Text": " sent to CarPlay and it's other processes so they can calculate the UI."
      },
      {
        "Time_Start": 753.84,
        "Time_End": 762.32,
        "Text": " Now we want to talk about the iPod accessory protocol version 2 or in short"
      },
      {
        "Time_Start": 762.32,
        "Time_End": 770.48,
        "Text": " iOp version 2. So here on this slide you can see all official information from Apple that you find"
      },
      {
        "Time_Start": 770.48,
        "Time_End": 782.24,
        "Text": " to this protocol. So very generous. The reason here is that this protocol is part of the MFI"
      },
      {
        "Time_Start": 782.24,
        "Time_End": 790.24,
        "Text": " program and manufacturer can register for this MFI but they have to sign an NDA and also if you"
      },
      {
        "Time_Start": 790.24,
        "Time_End": 798.4,
        "Text": " produce a device you have to pay a fee to Apple and also every device you produce has to have"
      },
      {
        "Time_Start": 798.4,
        "Time_End": 806.96,
        "Text": " this special authentication processor which is called MFI chip. So now what we found out so far"
      },
      {
        "Time_Start": 807.6800000000001,
        "Time_End": 815.6,
        "Text": " so it's a proprietary protocol from Apple and in CarPlay it's used for"
      },
      {
        "Time_Start": 815.76,
        "Time_End": 824.88,
        "Text": " transmitting accessory data also authentication and out-of-band establishment of Wi-Fi connections."
      },
      {
        "Time_Start": 824.88,
        "Time_End": 834.24,
        "Text": " So how we already saw it can sit on top of various sticks so we have USB, Bluetooth or Wi-Fi like"
      },
      {
        "Time_Start": 834.24,
        "Time_End": 844.32,
        "Text": " AirPlay. AirPlay is Wi-Fi. For CarPlay there's always a specific pattern"
      },
      {
        "Time_Start": 845.76,
        "Time_End": 854.08,
        "Text": " which consists of three to four steps. So we have the link initialization where the head unit starts"
      },
      {
        "Time_Start": 854.08,
        "Time_End": 861.52,
        "Text": " and the communication and send a fixed packet and the iPhone answers then with the same packet"
      },
      {
        "Time_Start": 862.4,
        "Time_End": 868.96,
        "Text": " and then we have a bit of link negotiation setting link timer and stuff so that which is"
      },
      {
        "Time_Start": 868.96,
        "Time_End": 875.92,
        "Text": " important if you have a timeout. The cars then sending the accessory information which includes"
      },
      {
        "Time_Start": 876.56,
        "Time_End": 882.72,
        "Text": " like manufacturer data, display size, mode if we are connected over Bluetooth or USB"
      },
      {
        "Time_Start": 883.44,
        "Time_End": 891.6,
        "Text": " such things. Then we have the authentication phase which is a challenge response"
      },
      {
        "Time_Start": 892.32,
        "Time_End": 902.96,
        "Text": " but we have an extra slide for this. And then when you are on wireless CarPlay we have also"
      },
      {
        "Time_Start": 902.96,
        "Time_End": 911.6,
        "Text": " an out-of-band Wi-Fi establishment so credentials of the Wi-Fi or of the car hotspot"
      },
      {
        "Time_Start": 911.6,
        "Time_End": 915.6800000000001,
        "Text": " are then sent to the iPhone over its Bluetooth connection."
      },
      {
        "Time_Start": 918.8000000000001,
        "Time_End": 926.24,
        "Text": " Yeah so packets. I won't bore you with that a lot but we have two different packet types"
      },
      {
        "Time_Start": 926.24,
        "Time_End": 936.08,
        "Text": " in IAP version 2. So only the first one are these FF55 type and yeah it's like"
      },
      {
        "Time_Start": 936.88,
        "Time_End": 945.2800000000001,
        "Text": " setting up your protocol. And the interesting thing here is which we also encounter with the"
      },
      {
        "Time_Start": 945.2800000000001,
        "Time_End": 952.8000000000001,
        "Text": " other packet type we have a checksum which is a one byte long and it's a two's complement checksum"
      },
      {
        "Time_Start": 952.8000000000001,
        "Time_End": 961.6,
        "Text": " so we have here no authentication reason or something. Yeah so this is the second packet"
      },
      {
        "Time_Start": 961.6,
        "Time_End": 972.32,
        "Text": " type the FF58 type. It has three additional bytes for acknowledgement and session data flag"
      },
      {
        "Time_Start": 972.32,
        "Time_End": 980.4,
        "Text": " for example. And yeah when we have session data then we have an additional accessory capsule"
      },
      {
        "Time_Start": 981.36,
        "Time_End": 991.0400000000001,
        "Text": " where we exactly have one. And also we have then we can have multiple data headers like when we have"
      },
      {
        "Time_Start": 991.6,
        "Time_End": 1002.5600000000001,
        "Text": " for example two integers then there are two data header. Also session data has its own checksum at"
      },
      {
        "Time_Start": 1002.5600000000001,
        "Time_End": 1015.84,
        "Text": " the end. Okay yeah authentication in IAP version 2. So this is one of the main tasks and in the"
      },
      {
        "Time_Start": 1015.84,
        "Time_End": 1022.8000000000001,
        "Text": " first step the head unit sends an certificate which is stored in this MFI chip together with"
      },
      {
        "Time_Start": 1022.8000000000001,
        "Time_End": 1032.32,
        "Text": " the private key material and the iPhone then checks the certificate. And if this is valid"
      },
      {
        "Time_Start": 1032.32,
        "Time_End": 1041.6000000000001,
        "Text": " then iPhone sends a 90 byte nonce. Then the car signs it with its private key and"
      },
      {
        "Time_Start": 1041.84,
        "Time_End": 1050.56,
        "Text": " sends it back. So if something went wrong you see here you get a message that this accessory is not"
      },
      {
        "Time_Start": 1051.1999999999998,
        "Time_End": 1058.9599999999998,
        "Text": " supported. And a thing also worth mentioning here is that only the accessory authenticates"
      },
      {
        "Time_Start": 1060.0,
        "Time_End": 1069.6,
        "Text": " but the iPhone didn't have to authenticate. Okay so the next thing is like an wireless"
      },
      {
        "Time_Start": 1069.6,
        "Time_End": 1075.6799999999998,
        "Text": " car play the wi-fi handover. We can see here a timeline of the bluetooth connection."
      },
      {
        "Time_Start": 1076.3999999999999,
        "Time_End": 1083.9199999999998,
        "Text": " So we have a normal bluetooth device discovery and service discovery protocol."
      },
      {
        "Time_Start": 1085.12,
        "Time_End": 1095.1999999999998,
        "Text": " We have a pairing phase like for encrypting with this link here. And we can have numeric comparison"
      },
      {
        "Time_Start": 1095.2,
        "Time_End": 1102.24,
        "Text": " or just works and the manufacturer of the car decides here which method is used."
      },
      {
        "Time_Start": 1105.04,
        "Time_End": 1110.8,
        "Text": " Yeah on top then two RF com channels are established and we see here in channel one"
      },
      {
        "Time_Start": 1110.8,
        "Time_End": 1117.1200000000001,
        "Text": " then I have version 2 data is transmitted. And at the very end of the communication"
      },
      {
        "Time_Start": 1117.1200000000001,
        "Time_End": 1123.7600000000002,
        "Text": " the wi-fi credentials are transmitted. Okay so to the next protocol."
      },
      {
        "Time_Start": 1127.2800000000002,
        "Time_End": 1134.64,
        "Text": " With AirPlay the information situation is better a lot better. So this is Apple's protocol for"
      },
      {
        "Time_Start": 1134.64,
        "Time_End": 1141.1200000000001,
        "Text": " streaming video and audio content. And we know that the communicating devices have to"
      },
      {
        "Time_Start": 1141.1200000000001,
        "Time_End": 1150.0000000000002,
        "Text": " be in the same network. And we have developer information for this. And"
      },
      {
        "Time_Start": 1151.1200000000001,
        "Time_End": 1156.72,
        "Text": " yeah already some reversing efforts from other researchers like we have open AirPlay implementation."
      },
      {
        "Time_Start": 1158.64,
        "Time_End": 1163.5200000000002,
        "Text": " But some things stay closed source. For example"
      },
      {
        "Time_Start": 1163.5200000000002,
        "Time_End": 1169.68,
        "Text": " these MFI authentication just works when you have the additional hardware like this MFI chip."
      },
      {
        "Time_Start": 1172.0000000000002,
        "Time_End": 1179.7600000000002,
        "Text": " Okay here you can see the timeline for AirPlay in CarPlay. At the beginning we have again"
      },
      {
        "Time_Start": 1179.7600000000002,
        "Time_End": 1191.0400000000002,
        "Text": " device discovery and this is done over IPv6. And if this doesn't work we have a fallback to IPv4."
      },
      {
        "Time_Start": 1191.8400000000001,
        "Time_End": 1197.2800000000002,
        "Text": " And this is then followed by the standard Bonjour discovery from Apple."
      },
      {
        "Time_Start": 1198.08,
        "Time_End": 1205.44,
        "Text": " And yeah the car and the iPhone they get their destination ports of the first stream."
      },
      {
        "Time_Start": 1205.44,
        "Time_End": 1213.44,
        "Text": " And also the type of authentication is determined during Bonjour because they have a special"
      },
      {
        "Time_Start": 1213.44,
        "Time_End": 1222.3999999999999,
        "Text": " record where the flags for AirPlay then are set. After this we start five different AirPlay streams"
      },
      {
        "Time_Start": 1222.88,
        "Time_End": 1229.2800000000002,
        "Text": " like we have four for TCP and data. And then we have one UDP for network timing protocol"
      },
      {
        "Time_Start": 1229.2800000000002,
        "Time_End": 1236.72,
        "Text": " which is used for synchronizing time between the two devices. So in the next slides I now want to"
      },
      {
        "Time_Start": 1236.72,
        "Time_End": 1244.88,
        "Text": " discuss the different streams. So the first stream is unencrypted and it's simply an HTTP"
      },
      {
        "Time_Start": 1245.8400000000001,
        "Time_End": 1252.3200000000002,
        "Text": " request and response. So and the main goal is that the car can offer its AirPlay receiver ID."
      },
      {
        "Time_Start": 1254.72,
        "Time_End": 1261.92,
        "Text": " When the iPhone gets this receiver ID it says done and we can start with the control stream."
      },
      {
        "Time_Start": 1264.3200000000002,
        "Time_End": 1267.3600000000001,
        "Text": " I think this is the most important one because"
      },
      {
        "Time_Start": 1268.0,
        "Time_End": 1273.7600000000002,
        "Text": " it sets up the other things and also is responsible for authentication at encryption."
      },
      {
        "Time_Start": 1275.8400000000001,
        "Time_End": 1284.4,
        "Text": " Yeah here we have it consists or the three initial steps are here the pair setup phase."
      },
      {
        "Time_Start": 1284.96,
        "Time_End": 1293.8400000000001,
        "Text": " So the car sends a salt and a public key or they exchange public keys and calculate proofs for this."
      },
      {
        "Time_Start": 1295.92,
        "Time_End": 1304.0,
        "Text": " In the second step a shared secret is calculated like they again they exchange"
      },
      {
        "Time_Start": 1304.16,
        "Time_End": 1312.0,
        "Text": " public key session public keys and from this they derive then a shared secret for a chachacha"
      },
      {
        "Time_Start": 1312.0,
        "Time_End": 1320.24,
        "Text": " 20 poly one three or five. And this is a standardized encryption and it's encrypted"
      },
      {
        "Time_Start": 1320.24,
        "Time_End": 1330.48,
        "Text": " and also authenticated. So in the authentication setup phase this is the step which is especially"
      },
      {
        "Time_Start": 1330.48,
        "Time_End": 1338.64,
        "Text": " for MFI authentication and here the iPhone sends a public key but it's not really treated as a"
      },
      {
        "Time_Start": 1338.64,
        "Time_End": 1347.84,
        "Text": " public key because the car then simply generates its own a pencil to the public key of the iPhone"
      },
      {
        "Time_Start": 1347.84,
        "Time_End": 1359.1200000000001,
        "Text": " and does a signature over this. And then the car sends everything back also with the certificate"
      },
      {
        "Time_Start": 1359.1200000000001,
        "Time_End": 1367.8400000000001,
        "Text": " which is in the which is stored in the MFI chip. But the CarPlay control has also further tasks."
      },
      {
        "Time_Start": 1367.8400000000001,
        "Time_End": 1378.24,
        "Text": " Here we can see the most important ones. So it sets up the other streams. It sets up also the"
      },
      {
        "Time_Start": 1380.3200000000002,
        "Time_End": 1384.24,
        "Text": " human interface device which is in fact the touch display."
      },
      {
        "Time_Start": 1384.96,
        "Time_End": 1393.2,
        "Text": " Then the iPhone switches off the bluetooth of the car or the head unit and we have a"
      },
      {
        "Time_Start": 1393.2,
        "Time_End": 1399.68,
        "Text": " feedback which is kind of an heartbeat so for controlling your connection."
      },
      {
        "Time_Start": 1403.2,
        "Time_End": 1411.44,
        "Text": " So then we have the CarPlay event stream and this is a bit funny because in CarPlay event we have"
      },
      {
        "Time_Start": 1411.44,
        "Time_End": 1416.8,
        "Text": " exactly the same communication over IAP version two which we saw"
      },
      {
        "Time_Start": 1418.16,
        "Time_End": 1425.04,
        "Text": " which we saw on bluetooth. And yeah so we have a second or third round of authentication"
      },
      {
        "Time_Start": 1426.48,
        "Time_End": 1432.16,
        "Text": " and it's also the same certificate use that is used in the all setup phase."
      },
      {
        "Time_Start": 1433.1200000000001,
        "Time_End": 1443.0400000000002,
        "Text": " And yeah possible reasons for that could be that maybe the accessory daemon has no access to the"
      },
      {
        "Time_Start": 1443.0400000000002,
        "Time_End": 1451.52,
        "Text": " AirPlay pairing I could imagine. But maybe it's also a thing that we have to stay compatible between"
      },
      {
        "Time_Start": 1452.48,
        "Time_End": 1463.76,
        "Text": " wireless and wired CarPlay. Okay so the next task of the event stream is like"
      },
      {
        "Time_Start": 1464.4,
        "Time_End": 1472.6399999999999,
        "Text": " sending so-called hit reports and this is so in short this is coordinates of touch events."
      },
      {
        "Time_Start": 1473.92,
        "Time_End": 1480.6399999999999,
        "Text": " So there are coordinates in it and the packets are transferred to the media server daemon"
      },
      {
        "Time_Start": 1480.64,
        "Time_End": 1487.92,
        "Text": " which encapsulates them in core media types and then this is forwarded to the CarPlay application"
      },
      {
        "Time_Start": 1487.92,
        "Time_End": 1497.76,
        "Text": " and the other small helpers. So they calculate like in their imaginary display what this touch event"
      },
      {
        "Time_Start": 1499.76,
        "Time_End": 1508.0,
        "Text": " would trigger in their imaginary display. Then they are rendering a video stream"
      },
      {
        "Time_Start": 1508.88,
        "Time_End": 1517.92,
        "Text": " which is HEVC encoded and stream it back over the CarPlay one stream. So here's no"
      },
      {
        "Time_Start": 1519.04,
        "Time_End": 1527.12,
        "Text": " real data, real private data transmitted because we only have this kind of video stream."
      },
      {
        "Time_Start": 1529.04,
        "Time_End": 1536.56,
        "Text": " Okay so now the rather short security part. Spoiler we found something but we can't talk"
      },
      {
        "Time_Start": 1536.56,
        "Time_End": 1543.6,
        "Text": " about it yet. So I have to bore you with these theoretical and default stuff."
      },
      {
        "Time_Start": 1546.8,
        "Time_End": 1558.72,
        "Text": " Yeah but it's not my fault. I reported in March and 10 days ago I was told I can't talk about this."
      },
      {
        "Time_Start": 1558.72,
        "Time_End": 1563.92,
        "Text": " So until now I don't really get a plan fixing date or something."
      },
      {
        "Time_Start": 1566.0,
        "Time_End": 1577.3600000000001,
        "Text": " Okay so security on availability. We tried dosing with a simple SYN flooding and it works."
      },
      {
        "Time_Start": 1578.24,
        "Time_End": 1583.28,
        "Text": " So the head unit became unresponsive. So we tried it on both targets. We tried on iPhone"
      },
      {
        "Time_Start": 1583.28,
        "Time_End": 1593.36,
        "Text": " and on the head unit. It works but you have to be in the car hotspot for this. So"
      },
      {
        "Time_Start": 1594.0,
        "Time_End": 1598.56,
        "Text": " then I think it would be just easier to get a Wi-Fi jammer or something."
      },
      {
        "Time_Start": 1600.8799999999999,
        "Time_End": 1609.12,
        "Text": " Also I found a cool cache but it did not work because maybe this was"
      },
      {
        "Time_Start": 1609.92,
        "Time_End": 1616.72,
        "Text": " legacy thing or maybe there are other files but manipulating this cache had no result."
      },
      {
        "Time_Start": 1618.0800000000002,
        "Time_End": 1625.2,
        "Text": " So attacking authentication. Yeah like this is very hard because we have three rounds of it"
      },
      {
        "Time_Start": 1626.0800000000002,
        "Time_End": 1633.7600000000002,
        "Text": " and the weakest challenge is 19 bytes long. So replay attack here is hard to impossible"
      },
      {
        "Time_Start": 1634.56,
        "Time_End": 1640.24,
        "Text": " and the only way would be to get like the private keys of the MFI chip."
      },
      {
        "Time_Start": 1641.52,
        "Time_End": 1644.48,
        "Text": " So MFI is your hardest enemy here."
      },
      {
        "Time_Start": 1647.36,
        "Time_End": 1653.84,
        "Text": " Confidentiality. So with confidentiality it's also difficult because we only have like this"
      },
      {
        "Time_Start": 1653.84,
        "Time_End": 1662.0,
        "Text": " video stream and it's encrypted with cha-cha-cha poly and session keys. So you have to be there"
      },
      {
        "Time_Start": 1662.0,
        "Time_End": 1670.56,
        "Text": " in every session to read like this key material to decrypt this video stream and therefore you"
      },
      {
        "Time_Start": 1670.56,
        "Time_End": 1679.36,
        "Text": " have also you need physical access like to these to the head unit and then I think it's just easier"
      },
      {
        "Time_Start": 1679.36,
        "Time_End": 1685.92,
        "Text": " to install some device for screen capturing because this is already a pretty hard attacker model."
      },
      {
        "Time_Start": 1686.8000000000002,
        "Time_End": 1696.48,
        "Text": " So what I saw till now Apple did here a pretty decent job and I mean they used custom protocols"
      },
      {
        "Time_Start": 1696.48,
        "Time_End": 1703.2,
        "Text": " but they were already long in production. So we know Airplay had some problems in the past but"
      },
      {
        "Time_Start": 1703.2,
        "Time_End": 1713.76,
        "Text": " I think these things are already fixed. Yeah so now to future work you somehow have to beat"
      },
      {
        "Time_Start": 1714.48,
        "Time_End": 1721.76,
        "Text": " this MFI chip but I leave this to the hardware people. We're currently building a fuzzer on"
      },
      {
        "Time_Start": 1721.76,
        "Time_End": 1728.4,
        "Text": " iApp version 2 because this is a pretty old protocol. I mean who has today an iPod?"
      },
      {
        "Time_Start": 1729.68,
        "Time_End": 1736.96,
        "Text": " No one. So and also I could imagine that we can somehow mess with these touch events."
      },
      {
        "Time_Start": 1737.8400000000001,
        "Time_End": 1749.3600000000001,
        "Text": " So on the long term we see here CarPlay 2.0 is at the start. So here we have news from yesterday"
      },
      {
        "Time_Start": 1749.3600000000001,
        "Time_End": 1756.64,
        "Text": " and seems like it will get fancy. The launch is planned of the end for the end of this year"
      },
      {
        "Time_Start": 1756.64,
        "Time_End": 1769.76,
        "Text": " together with Aston Martin. But yeah so CarPlay 2.0 is coming but I think it's hard to argue to"
      },
      {
        "Time_Start": 1769.76,
        "Time_End": 1781.2,
        "Text": " get an Aston Martin as research car. So maybe I have to wait a little bit for this. So here you"
      },
      {
        "Time_Start": 1781.2,
        "Time_End": 1788.56,
        "Text": " can see in short the contribution I made. So I had identified the underlying protocols of CarPlay."
      },
      {
        "Time_Start": 1789.68,
        "Time_End": 1795.52,
        "Text": " Reversed iApp version 2.0. We had a quick overview of the Airplay usage in CarPlay"
      },
      {
        "Time_Start": 1796.48,
        "Time_End": 1802.96,
        "Text": " and a very short security analysis. So on this slide I have my image sources"
      },
      {
        "Time_Start": 1803.6000000000001,
        "Time_End": 1806.72,
        "Text": " and now feel free to ask questions."
      },
      {
        "Time_Start": 1816.32,
        "Time_End": 1821.92,
        "Text": " All right thank you for your insights. We do have time for one or two quick questions."
      },
      {
        "Time_Start": 1823.2,
        "Time_End": 1831.04,
        "Text": " No it's not your problem but or not your fault but the closing ceremony starts at five. So be quick."
      },
      {
        "Time_Start": 1833.1200000000001,
        "Time_End": 1840.8,
        "Text": " One quick question. You mentioned at the beginning of your talk you made your investigation with an"
      },
      {
        "Time_Start": 1840.8,
        "Time_End": 1849.1200000000001,
        "Text": " iPhone 8. For iPhone 8 you wouldn't get the newest iOS version. Do you know if the newest version has"
      },
      {
        "Time_Start": 1850.8,
        "Time_End": 1854.88,
        "Text": " changes on this Airplay code or on the protocols?"
      },
      {
        "Time_Start": 1855.8400000000001,
        "Time_End": 1865.44,
        "Text": " I didn't look into newer versions but I think Airplay is already like a pretty used protocol."
      },
      {
        "Time_Start": 1865.44,
        "Time_End": 1872.5600000000002,
        "Text": " So I won't expect, so I don't know for sure, but I won't expect that they have any kind of changes there."
      },
      {
        "Time_Start": 1874.88,
        "Time_End": 1878.8000000000002,
        "Text": " All right do we have another short and quick question?"
      },
      {
        "Time_Start": 1878.8,
        "Time_End": 1889.36,
        "Text": " All right I don't see any hands so please join me at saying thank you Hanna and you did it guys."
      }
    ]
  }
}