{
  "metadata": {
    "webpage_url": "https://www.youtube.com/watch?v=CjJsySNiVvE",
    "title": "TROOPERS24: Insert coin: Hacking arcades for fun",
    "description": "Talk by Ignacio Navarro - June 27th, 2024 at TROOPERS24 IT security conference in Heidelberg, Germany hosted by @ERNW_ITSec\n\n#TROOPERS24 #ITsecurity \nhttps://troopers.de/troopers24/talks/zsrhcx/\n\nMore impressions:\n  / wearetroopers  \n  / ernw_itsec  \nhttps://infosec.exchange/@WEareTROOPERS\nhttps://infosec.exchange/@ERNW https://ernw.de",
    "channel_url": "https://www.youtube.com/channel/UCPY5aUREHmbDO4PtR6AYLfQ",
    "duration": 1587,
    "channel": "TROOPERS IT Security Conference",
    "uploader": "TROOPERS IT Security Conference",
    "upload_date": "20240909"
  },
  "segments": {
    "metadata": {
      "webpage_url": "https://www.youtube.com/watch?v=CjJsySNiVvE",
      "title": "TROOPERS24: Insert coin: Hacking arcades for fun",
      "description": "Talk by Ignacio Navarro - June 27th, 2024 at TROOPERS24 IT security conference in Heidelberg, Germany hosted by @ERNW_ITSec\n\n#TROOPERS24 #ITsecurity \nhttps://troopers.de/troopers24/talks/zsrhcx/\n\nMore impressions:\n  / wearetroopers  \n  / ernw_itsec  \nhttps://infosec.exchange/@WEareTROOPERS\nhttps://infosec.exchange/@ERNW https://ernw.de",
      "channel_url": "https://www.youtube.com/channel/UCPY5aUREHmbDO4PtR6AYLfQ",
      "duration": 1587,
      "channel": "TROOPERS IT Security Conference",
      "uploader": "TROOPERS IT Security Conference",
      "upload_date": "20240909"
    },
    "segments": [
      {
        "Time_Start": 0.0,
        "Time_End": 16.2,
        "Text": "This text was transcribed using whisper model: large-v2\n\n Good afternoon, everyone. It's the last talk. All of us are a little bit tired, I think."
      },
      {
        "Time_Start": 16.2,
        "Time_End": 23.080000000000002,
        "Text": " At least I'm so tired right now. So, I will try to do this stuff quickly. So, I'm from"
      },
      {
        "Time_Start": 23.080000000000002,
        "Time_End": 28.680000000000003,
        "Text": " Cordoba, Argentina. It's quite far from here. I work in application security and insurance"
      },
      {
        "Time_Start": 28.680000000000003,
        "Time_End": 35.160000000000004,
        "Text": " company and also in my free time I do some ethical hacking stuff. That's it. And a fun"
      },
      {
        "Time_Start": 35.160000000000004,
        "Time_End": 39.480000000000004,
        "Text": " fact, as I told you yesterday, if you went to a storytelling, I love sneakers and also"
      },
      {
        "Time_Start": 39.480000000000004,
        "Time_End": 46.6,
        "Text": " I made clothes. So, I agree with that shit. What we're going to see today, first of all,"
      },
      {
        "Time_Start": 46.6,
        "Time_End": 51.92,
        "Text": " a little introduction, how I found this system, the Argentinian company in charge of the entire"
      },
      {
        "Time_Start": 51.92,
        "Time_End": 58.6,
        "Text": " production of the stuff. So, my doors, broker authorizations, a little bit about the Android"
      },
      {
        "Time_Start": 58.6,
        "Time_End": 65.96000000000001,
        "Text": " application that they have. I can take over risk conditions. There was a web server using"
      },
      {
        "Time_Start": 65.96000000000001,
        "Time_End": 71.8,
        "Text": " for bookings. I mean, you can book different arcade or amusement parks. Some say server"
      },
      {
        "Time_Start": 71.8,
        "Time_End": 77.56,
        "Text": " who I found using shooting and that. And a little bit about the NFC. I divide the talk"
      },
      {
        "Time_Start": 77.56,
        "Time_End": 84.32000000000001,
        "Text": " in different stages, like ten stages, plus the stage number zero. So, that's it. But"
      },
      {
        "Time_Start": 84.32000000000001,
        "Time_End": 87.72,
        "Text": " first of all, a little disclaimer, because maybe some techniques and procedures are not"
      },
      {
        "Time_Start": 87.72,
        "Time_End": 92.64,
        "Text": " completely legal, so please don't do that stuff at your home. If you found something,"
      },
      {
        "Time_Start": 92.64,
        "Time_End": 97.4,
        "Text": " just report that immediately. Just don't be an asshole. That's the facing website and"
      },
      {
        "Time_Start": 97.4,
        "Time_End": 103.24000000000001,
        "Text": " the stuff. In Argentina, some people are facing some universities or libraries, so why are"
      },
      {
        "Time_Start": 103.24000000000001,
        "Time_End": 110.04,
        "Text": " you doing that shit? So, last December, I went to Sao Paulo for Hackers to Hackers,"
      },
      {
        "Time_Start": 110.04,
        "Time_End": 116.24000000000001,
        "Text": " a really, really nice conference. So, technical and that, but also they have a lot of parties"
      },
      {
        "Time_Start": 116.24000000000001,
        "Time_End": 125.16000000000001,
        "Text": " over there. I mean, there's parties from Friday to Sunday. So, I really loved the conference."
      },
      {
        "Time_Start": 125.16000000000001,
        "Time_End": 128.32000000000002,
        "Text": " And in one of those parties, I met a girl from Brazil, and the next day we went to take"
      },
      {
        "Time_Start": 128.32,
        "Time_End": 134.44,
        "Text": " some drinks, and after some beers, we were walking, and we found an arcade place into"
      },
      {
        "Time_Start": 134.44,
        "Time_End": 141.32,
        "Text": " the mall, and after some beers, it's so funny, they play some stuff. So, there was that totem"
      },
      {
        "Time_Start": 141.32,
        "Time_End": 151.95999999999998,
        "Text": " used by the car to reach them and check the money and that. When I saw that, I stand in"
      },
      {
        "Time_Start": 151.96,
        "Time_End": 160.04000000000002,
        "Text": " front of the machine for, like, five minutes, and thinking, okay, this is an old, old Windows."
      },
      {
        "Time_Start": 160.04000000000002,
        "Time_End": 167.36,
        "Text": " Maybe there is something interesting here. So, stage number one. As I told you, we bought"
      },
      {
        "Time_Start": 167.36,
        "Time_End": 172.36,
        "Text": " the car. That one was the car, just a normal one with the name of the company. They have"
      },
      {
        "Time_Start": 172.36,
        "Time_End": 179.16,
        "Text": " the some I Googled the application for the stuff, so I ran a little bit faster over that"
      },
      {
        "Time_Start": 179.16,
        "Time_End": 184.92,
        "Text": " one with a normal dictionary. There was not so much data. There was just a PHP running"
      },
      {
        "Time_Start": 184.92,
        "Time_End": 192.96,
        "Text": " in Drupal, and they had spoke the info.php. They were running an old version of PHP, like"
      },
      {
        "Time_Start": 192.96,
        "Time_End": 199.72,
        "Text": " from 2019, and there's interesting research from Redmond, there's a QR code. If they had"
      },
      {
        "Time_Start": 199.72,
        "Time_End": 204.8,
        "Text": " the file uploads, and you have LFI, you can get some access to that one, because the file"
      },
      {
        "Time_Start": 204.8,
        "Time_End": 210.64000000000001,
        "Text": " is saved on the TMP folder and that. But we need the LFI. At the moment, we don't have"
      },
      {
        "Time_Start": 210.64000000000001,
        "Time_End": 217.92000000000002,
        "Text": " anything about it. So, I ran a sub funder, IDNSX, just to check the different subdomains"
      },
      {
        "Time_Start": 217.92000000000002,
        "Time_End": 224.4,
        "Text": " and that, and I found another one more interesting for the application who they use for check"
      },
      {
        "Time_Start": 224.4,
        "Time_End": 228.8,
        "Text": " your salary and charge some money to the car, and you can check the history where you play"
      },
      {
        "Time_Start": 228.8,
        "Time_End": 237.12,
        "Text": " and that, but I tried to work the stuff too, and they had a middleware, so you can't do"
      },
      {
        "Time_Start": 237.12,
        "Time_End": 242.76000000000002,
        "Text": " any exploitation or something like that. You can just check the credits and the last movement,"
      },
      {
        "Time_Start": 242.76000000000002,
        "Time_End": 252.32000000000002,
        "Text": " so I say, okay, maybe there is not this way, maybe there is no talk this year. So I spent"
      },
      {
        "Time_Start": 252.32000000000002,
        "Time_End": 258.6,
        "Text": " like one week or two weeks trying to work the application without any luck. So I turned"
      },
      {
        "Time_Start": 258.6,
        "Time_End": 265.0,
        "Text": " the car, and I see at the bottom they have some URLs from another company, so I Googled"
      },
      {
        "Time_Start": 265.0,
        "Time_End": 272.12,
        "Text": " that one, and that was an Argentinian company. I read a little bit more, and they say, okay,"
      },
      {
        "Time_Start": 272.12,
        "Time_End": 278.88,
        "Text": " we provide systems for cashless stuff, so we are not also just okay, we have amusement"
      },
      {
        "Time_Start": 278.88,
        "Time_End": 285.12,
        "Text": " park, we have bowling, we have skate parks. So, at that moment, I say, okay, I want to"
      },
      {
        "Time_Start": 285.12,
        "Time_End": 289.0,
        "Text": " read a little bit more, and they have on the web page published all the customers around"
      },
      {
        "Time_Start": 289.0,
        "Time_End": 295.4,
        "Text": " the world, and that was in more than seven countries, more than 2,000 installations around"
      },
      {
        "Time_Start": 295.4,
        "Time_End": 302.6,
        "Text": " the world. So now I say, yes, I want to try to hack this user right now. So, thank you."
      },
      {
        "Time_Start": 302.6,
        "Time_End": 312.6,
        "Text": " I run another DNS stuff, and I found the documentation for the API version number 2, and they use"
      },
      {
        "Time_Start": 312.6,
        "Time_End": 319.36,
        "Text": " the application secrets, but they encode that stuff, which I want, and they encode"
      },
      {
        "Time_Start": 319.36,
        "Time_End": 329.72,
        "Text": " again. I don't know why. But you need to generate the token, so that's fine. If we want to try"
      },
      {
        "Time_Start": 329.72,
        "Time_End": 340.56,
        "Text": " to the API, without any token or something, we get status 200, the response, but the JSON"
      },
      {
        "Time_Start": 340.56,
        "Time_End": 349.2,
        "Text": " says status success, success false, and status code 403, so access denied. That was fine,"
      },
      {
        "Time_Start": 349.2,
        "Time_End": 355.48,
        "Text": " but we need the API key and the API secret for that. But what happens if we delete the"
      },
      {
        "Time_Start": 355.48,
        "Time_End": 361.4,
        "Text": " version number 2 on the path? It's not supposed to work, but in this case, when we check,"
      },
      {
        "Time_Start": 361.4,
        "Time_End": 364.72,
        "Text": " we have all the access for the stuff because they don't have any type of validation in"
      },
      {
        "Time_Start": 364.72,
        "Time_End": 372.36,
        "Text": " that end point. That happened with all the end points in the API version number 1, so"
      },
      {
        "Time_Start": 372.36,
        "Time_End": 380.96000000000004,
        "Text": " you can get a lot of 200 okay with data, without data, and a lot of 400 errors. Also, the same"
      },
      {
        "Time_Start": 380.96000000000004,
        "Time_End": 388.36,
        "Text": " structure like status success, success false, and random stuff. So, stage number 3, the"
      },
      {
        "Time_Start": 388.36,
        "Time_End": 395.44,
        "Text": " IDOS and the authorization, I check what is IDOS when you can get access to different"
      },
      {
        "Time_Start": 395.44,
        "Time_End": 402.68,
        "Text": " objects, if they are yours or not, because there's not any validation for the user supplies,"
      },
      {
        "Time_Start": 402.68,
        "Time_End": 408.52000000000004,
        "Text": " so I check my car, I say this is your number, this is your credit and your money, but if"
      },
      {
        "Time_Start": 408.52000000000004,
        "Time_End": 415.72,
        "Text": " I check another car, I get that access too without any token or something. So, that happened"
      },
      {
        "Time_Start": 415.72,
        "Time_End": 420.08000000000004,
        "Text": " with the customer too. Also, that was a sequential ID, so you can check the customer number 1,"
      },
      {
        "Time_Start": 420.08000000000004,
        "Time_End": 427.92,
        "Text": " the customer number 2, and you can get the address, the phone, the email, the last movement,"
      },
      {
        "Time_Start": 427.92,
        "Time_End": 433.8,
        "Text": " the car they used, where they used the car, and that with all the customer in the more"
      },
      {
        "Time_Start": 433.8,
        "Time_End": 440.96000000000004,
        "Text": " than seven countries. So, after that stuff, I was this guy, because it's just normal stuff,"
      },
      {
        "Time_Start": 440.96000000000004,
        "Time_End": 446.16,
        "Text": " super simple. I wrote a script just to forget the cars and the customer who have some money"
      },
      {
        "Time_Start": 446.16,
        "Time_End": 451.24,
        "Text": " into the account, and we can say, okay, maybe this one has 100, 200, and that, just for"
      },
      {
        "Time_Start": 451.24,
        "Time_End": 459.40000000000003,
        "Text": " check that. And there was a 2,000 installation with the same one. I came back to the website"
      },
      {
        "Time_Start": 459.40000000000003,
        "Time_End": 463.12000000000006,
        "Text": " and started to check a little bit more, and I said, okay, we have this stuff in Spain,"
      },
      {
        "Time_Start": 463.12,
        "Time_End": 474.24,
        "Text": " we have some in Prague, UK, Saudi Arabia, a lot of stuff. And also, one of them is so"
      },
      {
        "Time_Start": 474.24,
        "Time_End": 482.88,
        "Text": " interesting because there's a big arcade in one of those hotels, and there's a big roller"
      },
      {
        "Time_Start": 482.88,
        "Time_End": 487.88,
        "Text": " coaster too. I don't want to say the name, but I think you know what I'm talking about,"
      },
      {
        "Time_Start": 487.88,
        "Time_End": 494.12,
        "Text": " and they use the same system for that stuff. So, that was a really, really big shit. I"
      },
      {
        "Time_Start": 494.12,
        "Time_End": 501.15999999999997,
        "Text": " was checking a little bit more about the API, and I found another interesting thing, you"
      },
      {
        "Time_Start": 501.15999999999997,
        "Time_End": 505.84,
        "Text": " can get the car from the kiosk, and also you can check the salary and the amount in the"
      },
      {
        "Time_Start": 505.84,
        "Time_End": 511.56,
        "Text": " mobile application. So, I opened the store and tried to find it, and I didn't find it"
      },
      {
        "Time_Start": 511.56,
        "Time_End": 518.68,
        "Text": " because that was a Brazilian arcade. So, I went to the APK for check the different"
      },
      {
        "Time_Start": 518.68,
        "Time_End": 524.48,
        "Text": " stuff, and I found a lot of applications. So, I don't know that one. I had to compile"
      },
      {
        "Time_Start": 524.48,
        "Time_End": 530.24,
        "Text": " that stuff with the APK tool or Java compilers. We get the code because that was in a fuscator"
      },
      {
        "Time_Start": 530.24,
        "Time_End": 535.12,
        "Text": " so you can read the entire code for the entire application. I get some, well, in this case,"
      },
      {
        "Time_Start": 535.12,
        "Time_End": 540.2,
        "Text": " I run JS beautifier just to make the code more pretty, and now we can get access to"
      },
      {
        "Time_Start": 540.2,
        "Time_End": 547.76,
        "Text": " the API key, API secrets, the booking URLs, the account code, and that. I get more applications"
      },
      {
        "Time_Start": 547.76,
        "Time_End": 555.9200000000001,
        "Text": " just for checking if that was the same stuff, and, yes, all of them was on a fuscator, and"
      },
      {
        "Time_Start": 555.9200000000001,
        "Time_End": 564.6400000000001,
        "Text": " they have a code that is a different number. That was kind of complicated to guess which"
      },
      {
        "Time_Start": 564.64,
        "Time_End": 571.84,
        "Text": " one is for each company. With that account code, and the end point was the same one for"
      },
      {
        "Time_Start": 571.84,
        "Time_End": 578.8,
        "Text": " everyone because it's the same API, you can get the company. But you have the list of"
      },
      {
        "Time_Start": 578.8,
        "Time_End": 586.28,
        "Text": " the customers, so you can Google it, and that's fine. So, you don't need to use the account"
      },
      {
        "Time_Start": 586.28,
        "Time_End": 591.36,
        "Text": " code or something like that. What I'm saying, you can, for example, in this case, we sent"
      },
      {
        "Time_Start": 591.36,
        "Time_End": 598.48,
        "Text": " to the main API with the account code, and say this one is amusement park from Ecuador."
      },
      {
        "Time_Start": 598.48,
        "Time_End": 603.72,
        "Text": " But if we Google the name of the company, and we get the application for the stuff,"
      },
      {
        "Time_Start": 603.72,
        "Time_End": 607.76,
        "Text": " we can just consume the API directly without any token or account code or something, and"
      },
      {
        "Time_Start": 607.76,
        "Time_End": 615.0,
        "Text": " it's the same stuff. There was an interesting end point for credit in your car, and that"
      },
      {
        "Time_Start": 615.0,
        "Time_End": 619.2,
        "Text": " say, okay, you need to generate the token, but we have the API key and the API secrets"
      },
      {
        "Time_Start": 619.2,
        "Time_End": 626.68,
        "Text": " right now. So we generate the token, and there's a different offer in this case that was $200,"
      },
      {
        "Time_Start": 626.68,
        "Time_End": 637.84,
        "Text": " $500, and they have ID, a sequential ID, too. There's an end point for sales. If you want"
      },
      {
        "Time_Start": 637.84,
        "Time_End": 642.96,
        "Text": " to do some online recharge on that, please set the deliver true parameter to do that"
      },
      {
        "Time_Start": 642.96,
        "Time_End": 648.48,
        "Text": " automatically, and you don't need to do anything. So, you can generate a lot of stuff. But I"
      },
      {
        "Time_Start": 648.48,
        "Time_End": 654.32,
        "Text": " don't know here, but $2,000 is a lot of money, or $200, too, so I don't want to be in jail"
      },
      {
        "Time_Start": 654.32,
        "Time_End": 662.0400000000001,
        "Text": " for the stuff. About the end points into the application, they have more than 20. All of"
      },
      {
        "Time_Start": 662.0400000000001,
        "Time_End": 669.44,
        "Text": " them without any token and that. All the code in plain text, as I told you. And there was"
      },
      {
        "Time_Start": 669.44,
        "Time_End": 674.8800000000001,
        "Text": " an interesting one about the customers. So, in this case, we can find the date customer,"
      },
      {
        "Time_Start": 674.8800000000001,
        "Time_End": 679.5200000000001,
        "Text": " and that's saying authorization meter with the token generated before, but they didn't"
      },
      {
        "Time_Start": 679.5200000000001,
        "Time_End": 685.08,
        "Text": " validate the stuff, so I don't know why they are sending that stuff. We can check the body"
      },
      {
        "Time_Start": 685.08,
        "Time_End": 690.9200000000001,
        "Text": " in this case that has the name, the last name, the email, and the newsletter, just random"
      },
      {
        "Time_Start": 690.9200000000001,
        "Time_End": 697.9200000000001,
        "Text": " stuff. But the most interesting stuff I think was the email, because we don't have any validation"
      },
      {
        "Time_Start": 697.92,
        "Time_End": 702.7199999999999,
        "Text": " or something, so, what's happening if we can just run the emails and get access to"
      },
      {
        "Time_Start": 702.7199999999999,
        "Time_End": 710.64,
        "Text": " that account? So now we can do some accounting. In this case, I check my account, and I have"
      },
      {
        "Time_Start": 710.64,
        "Time_End": 717.68,
        "Text": " this email and that from Webhook, but if we send a post, just changing the email, that"
      },
      {
        "Time_Start": 717.68,
        "Time_End": 725.9599999999999,
        "Text": " changes successfully without any validations, without any token. So, I record a little demo"
      },
      {
        "Time_Start": 725.96,
        "Time_End": 732.96,
        "Text": " for the stuff. It's just logging into my account. And just showing your stuff, because"
      },
      {
        "Time_Start": 732.96,
        "Time_End": 737.44,
        "Text": " there is no email or something for the user. The customer says, hey, we are changing your"
      },
      {
        "Time_Start": 737.44,
        "Time_End": 744.0400000000001,
        "Text": " email just for your information. So we log into our account, we exit, and we come back"
      },
      {
        "Time_Start": 744.0400000000001,
        "Time_End": 751.2800000000001,
        "Text": " to a Webhook, we send the post, and now we're going to go to the application and ask for"
      },
      {
        "Time_Start": 751.28,
        "Time_End": 756.6,
        "Text": " the, hey, I forgot my password. This one is my account, so please give me the password."
      },
      {
        "Time_Start": 756.6,
        "Time_End": 762.3199999999999,
        "Text": " We're going to ask for the stuff. I'm so bad at editing videos, so, sorry, it could be"
      },
      {
        "Time_Start": 762.3199999999999,
        "Time_End": 773.0,
        "Text": " more faster, I think, but at least I try. So we receive the email, we're going to come"
      },
      {
        "Time_Start": 773.0,
        "Time_End": 778.56,
        "Text": " back to the application and say, okay, we're going to say the password 123, and we're going"
      },
      {
        "Time_Start": 778.5600000000001,
        "Time_End": 800.48,
        "Text": " to receive the stuff in our email. It could be more fast. Sorry. So, we log into our account"
      },
      {
        "Time_Start": 800.48,
        "Time_End": 807.5200000000001,
        "Text": " with the new password, and we get access for the same account, and the other user didn't"
      },
      {
        "Time_Start": 807.52,
        "Time_End": 812.64,
        "Text": " notice about that. I mean, when he tried to log in again, we're going to say they don't"
      },
      {
        "Time_Start": 812.64,
        "Time_End": 818.4399999999999,
        "Text": " have the user, but you can do that with all the users without any token or something."
      },
      {
        "Time_Start": 818.4399999999999,
        "Time_End": 826.12,
        "Text": " About the risk condition is when you try to access to the same object at the same time."
      },
      {
        "Time_Start": 826.12,
        "Time_End": 832.48,
        "Text": " There was a secure code for the lab which is really interesting. There is some different"
      },
      {
        "Time_Start": 832.48,
        "Time_End": 838.44,
        "Text": " type of attack for risk condition, but something is so easy. In this case, they have an offer"
      },
      {
        "Time_Start": 838.44,
        "Time_End": 844.88,
        "Text": " stuff like if you set the application in your phone, you can get 400 tickets for just reclaim"
      },
      {
        "Time_Start": 844.88,
        "Time_End": 851.28,
        "Text": " some rewards and that. I wrote a Python script, just a normal one. They send just random posts,"
      },
      {
        "Time_Start": 851.28,
        "Time_End": 858.64,
        "Text": " in this case, 100 threads. I run the stuff, it gets five hits, and when we check the history,"
      },
      {
        "Time_Start": 858.64,
        "Time_End": 865.56,
        "Text": " you have six stuff, too, with 300 tickets each one, and you can do that more technically"
      },
      {
        "Time_Start": 865.56,
        "Time_End": 869.68,
        "Text": " if you want, but in this case, it was just a random Python. This one was just tickets,"
      },
      {
        "Time_Start": 869.68,
        "Time_End": 874.24,
        "Text": " but you have some rewards about money and that, so maybe it could be more complicated"
      },
      {
        "Time_Start": 874.24,
        "Time_End": 883.4399999999999,
        "Text": " and dangerous. As I told you, in this case, there was 1,000 tickets and $100 bonus, but"
      },
      {
        "Time_Start": 883.44,
        "Time_End": 889.32,
        "Text": " I didn't check the stuff. As I told you, there was a booking portal for the different"
      },
      {
        "Time_Start": 889.32,
        "Time_End": 895.24,
        "Text": " arcade and amusement, and they have a lot of exposed data. In this case, the most interesting"
      },
      {
        "Time_Start": 895.24,
        "Time_End": 903.72,
        "Text": " are the TMP and the data. In the TMP, we can find some different logs from XML, some data"
      },
      {
        "Time_Start": 903.72,
        "Time_End": 910.6800000000001,
        "Text": " about the store, some pictures, some different APN ports, data about the cacher and that,"
      },
      {
        "Time_Start": 910.6800000000001,
        "Time_End": 917.32,
        "Text": " but not so interesting, I mean. Also, there was uploads. I wrote a little Python script"
      },
      {
        "Time_Start": 917.32,
        "Time_End": 921.0000000000001,
        "Text": " to try to find different interesting files because there was a random picture from the"
      },
      {
        "Time_Start": 921.0000000000001,
        "Time_End": 930.32,
        "Text": " places and that. An iPhone 3 with some folder that says facturación Argentina, which means"
      },
      {
        "Time_Start": 930.32,
        "Time_End": 937.08,
        "Text": " the invoice generated from Argentina. In that folder, they have some certificates, and they"
      },
      {
        "Time_Start": 937.08,
        "Time_End": 945.44,
        "Text": " use the stuff in Argentina for saying, okay, I'm this company, trust me, and this person"
      },
      {
        "Time_Start": 945.44,
        "Time_End": 953.4000000000001,
        "Text": " gave me $80,000. So we can generate a lot of different invoices at the name of the company,"
      },
      {
        "Time_Start": 953.4000000000001,
        "Time_End": 960.8000000000001,
        "Text": " but if we have the certificates, there is maybe some folder with all the invoices. So"
      },
      {
        "Time_Start": 960.8000000000001,
        "Time_End": 965.88,
        "Text": " the data folder, we found all the invoices from Argentina with all the customer data,"
      },
      {
        "Time_Start": 965.88,
        "Time_End": 976.8,
        "Text": " where they live, how they pay, how much, and there was around 600, 700 stuff. But also,"
      },
      {
        "Time_Start": 976.8,
        "Time_End": 980.2,
        "Text": " they need a booking manager for the stuff because you can get all the bookings, but"
      },
      {
        "Time_Start": 980.2,
        "Time_End": 985.4,
        "Text": " you need something to manage that stuff. So they have another portal who asks, okay, give"
      },
      {
        "Time_Start": 985.4,
        "Time_End": 992.12,
        "Text": " me your name, your last name, or the reservation code, but if you just press enter, just click"
      },
      {
        "Time_Start": 992.12,
        "Time_End": 999.4,
        "Text": " in search. You get all the reservation from all that customer, and some of them are new."
      },
      {
        "Time_Start": 999.4,
        "Time_End": 1009.08,
        "Text": " In this case, they're from April. Yeah, April, March. And they have some SQLI, some application"
      },
      {
        "Time_Start": 1009.08,
        "Time_End": 1016.6800000000001,
        "Text": " errors and that. You can manage all the stuff, and also you can set negative tips. So that's"
      },
      {
        "Time_Start": 1016.6800000000001,
        "Time_End": 1024.48,
        "Text": " really simple stuff. Well, all the customer data and that. About the service, as I told"
      },
      {
        "Time_Start": 1024.48,
        "Time_End": 1028.28,
        "Text": " you yesterday on the storytelling, sometimes I'm a little bit bored and I open Shoe and"
      },
      {
        "Time_Start": 1028.28,
        "Time_End": 1033.88,
        "Text": " I try to find something. So I say, okay, let's see what we can get from this stuff. First"
      },
      {
        "Time_Start": 1033.88,
        "Time_End": 1040.52,
        "Text": " of all, they have the send public, so you can create an account with just a random email."
      },
      {
        "Time_Start": 1040.52,
        "Time_End": 1044.96,
        "Text": " In the send, they have a lot of different videos showing the application and how that"
      },
      {
        "Time_Start": 1044.96,
        "Time_End": 1051.16,
        "Text": " works, but they have a lot of user names, password, email, application key, secrets,"
      },
      {
        "Time_Start": 1051.16,
        "Time_End": 1055.96,
        "Text": " just in the random videos. And also they have some network maps, so that can give you some"
      },
      {
        "Time_Start": 1055.96,
        "Time_End": 1065.24,
        "Text": " idea about how is the network inside the different parks and arcades. Also there was a GoCart"
      },
      {
        "Time_Start": 1065.24,
        "Time_End": 1073.96,
        "Text": " team in the U.S. who they have public the user stuff. I mean, they have the login page,"
      },
      {
        "Time_Start": 1073.96,
        "Time_End": 1078.68,
        "Text": " but the webpack was exposed, so you can get all the different API end points, and in this"
      },
      {
        "Time_Start": 1078.68,
        "Time_End": 1082.8400000000001,
        "Text": " case you can get access to all the user, just the first name, the age and where they live,"
      },
      {
        "Time_Start": 1082.8400000000001,
        "Time_End": 1087.88,
        "Text": " but it's kind of private data. And also you can get access to all the different monitors"
      },
      {
        "Time_Start": 1087.88,
        "Time_End": 1094.52,
        "Text": " at the GoCart, so you can say, okay, maybe this guy is close to winning that. That was"
      },
      {
        "Time_Start": 1094.52,
        "Time_End": 1101.48,
        "Text": " without talking, too, so there was a lot of biggest problems. About the Spain was one"
      },
      {
        "Time_Start": 1101.48,
        "Time_End": 1107.56,
        "Text": " of the biggest stuff because they have exposed the admin console for all the different amusement"
      },
      {
        "Time_Start": 1107.56,
        "Time_End": 1114.48,
        "Text": " parks, but they have a user and password, so I tried to do some SQL that didn't work,"
      },
      {
        "Time_Start": 1114.48,
        "Time_End": 1121.3600000000001,
        "Text": " but they have exposed the webpack, too, so we can see the entire code of the application,"
      },
      {
        "Time_Start": 1121.3600000000001,
        "Time_End": 1126.0,
        "Text": " and they have some random API end points where you can check all the different machines into"
      },
      {
        "Time_Start": 1126.0,
        "Time_End": 1134.2,
        "Text": " a place, and you can get the public IP from them, so you can do some stuff. But also,"
      },
      {
        "Time_Start": 1134.2,
        "Time_End": 1140.32,
        "Text": " they had the login part public, too, and you can see the different roles, the login end"
      },
      {
        "Time_Start": 1140.32,
        "Time_End": 1152.4,
        "Text": " points, and as we saw at the beginning, they use like a random body for the responses,"
      },
      {
        "Time_Start": 1152.4,
        "Time_End": 1158.3200000000002,
        "Text": " and they say, okay, if this one is 200, okay, just give me the token and it's fine, but"
      },
      {
        "Time_Start": 1158.3200000000002,
        "Time_End": 1167.24,
        "Text": " if it's 407, do something, and if it's 420, do another stuff. I started to say, okay,"
      },
      {
        "Time_Start": 1167.24,
        "Time_End": 1173.76,
        "Text": " what is 420? I thought he was talking about some weed, maybe, or something like that."
      },
      {
        "Time_Start": 1173.76,
        "Time_End": 1179.76,
        "Text": " So I changed the response code for 420, and that gave me this screen to say, okay, set"
      },
      {
        "Time_Start": 1179.76,
        "Time_End": 1184.64,
        "Text": " the new password for this user, so we are the same stuff at the beginning. We can change"
      },
      {
        "Time_Start": 1184.64,
        "Time_End": 1196.0,
        "Text": " all the passwords for all the users in the company. About the NFC, we have a lot of time."
      },
      {
        "Time_Start": 1196.0,
        "Time_End": 1199.28,
        "Text": " The Brazilian card. I don't want to explain a little bit more. There is a secure code"
      },
      {
        "Time_Start": 1199.28,
        "Time_End": 1207.28,
        "Text": " for a guy who explained a lot of information about the NFC. In my case, I just used the"
      },
      {
        "Time_Start": 1207.28,
        "Time_End": 1214.0,
        "Text": " flipper zero for the card, because that was with the default credentials, the default"
      },
      {
        "Time_Start": 1214.0,
        "Time_End": 1222.6,
        "Text": " keys, the key A and key B, so we get access to the classic, we have the UID, and the NFC"
      },
      {
        "Time_Start": 1222.6,
        "Time_End": 1230.48,
        "Text": " had like 16 blocks and used the first one for the manufacturer data. In this case, the"
      },
      {
        "Time_Start": 1230.48,
        "Time_End": 1239.6,
        "Text": " card was empty. They just have some number in the first block, and if we moved that number"
      },
      {
        "Time_Start": 1239.6,
        "Time_End": 1246.4,
        "Text": " to decimal stuff, it is the same number as the card. So there's not much data into the"
      },
      {
        "Time_Start": 1246.4,
        "Time_End": 1251.52,
        "Text": " card, so you can just replace that number and you can emulate that card with your flipper."
      },
      {
        "Time_Start": 1251.52,
        "Time_End": 1256.64,
        "Text": " Last week, I presented this talk in Spain, and one of the guys came and said, hey, I"
      },
      {
        "Time_Start": 1256.64,
        "Time_End": 1260.96,
        "Text": " went to an amusement park close to here with my son last week, and I have the card here"
      },
      {
        "Time_Start": 1260.96,
        "Time_End": 1266.16,
        "Text": " if you want to check. He said, yes, right now. We scanned the card, and that was the"
      },
      {
        "Time_Start": 1266.16,
        "Time_End": 1272.2800000000002,
        "Text": " same stuff. They changed the manufacturer, but they just have the number into the card,"
      },
      {
        "Time_Start": 1272.2800000000002,
        "Time_End": 1279.0400000000002,
        "Text": " so basically, it is the same stuff, like Argentina and all the different countries. But, for"
      },
      {
        "Time_Start": 1279.0400000000002,
        "Time_End": 1286.6000000000001,
        "Text": " emulate or try to change the number, you need the flipper zero or some different stuff for"
      },
      {
        "Time_Start": 1286.64,
        "Time_End": 1292.16,
        "Text": " the NFC. So I came back to the application, and I re-delivered a little bit more of the"
      },
      {
        "Time_Start": 1292.16,
        "Time_End": 1299.3600000000001,
        "Text": " code. In the Android application, they have this thing that says, if it's not iOS, I don't"
      },
      {
        "Time_Start": 1299.3600000000001,
        "Time_End": 1306.1200000000001,
        "Text": " know why they changed the platform into the Android application. If the NFC is okay, do"
      },
      {
        "Time_Start": 1306.1200000000001,
        "Time_End": 1312.68,
        "Text": " something. So I say, okay, maybe there is something interesting here. So I asked my"
      },
      {
        "Time_Start": 1312.68,
        "Time_End": 1320.3600000000001,
        "Text": " dad for the phone, and we logged into the application, just a random one. We have our"
      },
      {
        "Time_Start": 1320.3600000000001,
        "Time_End": 1326.3600000000001,
        "Text": " user, normal stuff, and we can get access to all the cards, and also we can emulate"
      },
      {
        "Time_Start": 1326.3600000000001,
        "Time_End": 1331.24,
        "Text": " the card with our phone, so we can just attach some random cards to the phone, and that's"
      },
      {
        "Time_Start": 1331.24,
        "Time_End": 1336.52,
        "Text": " going to work because they have a pin code, but they don't validate the stuff. You can"
      },
      {
        "Time_Start": 1336.52,
        "Time_End": 1342.6,
        "Text": " do some stuff, and you can do some account takeover, too, so you can join all the stuff."
      },
      {
        "Time_Start": 1342.6,
        "Time_End": 1348.96,
        "Text": " I spoke so fast, but it's okay. What we can do, we can get the data from all the different"
      },
      {
        "Time_Start": 1348.96,
        "Time_End": 1354.44,
        "Text": " customers, just from the card stuff or from the bookings. We can emulate and get access"
      },
      {
        "Time_Start": 1354.44,
        "Time_End": 1364.76,
        "Text": " to them, charge some money into that stuff, and earn multiple prices. But, in Germany,"
      },
      {
        "Time_Start": 1364.76,
        "Time_End": 1369.6,
        "Text": " they don't have so much customers here, at least in the web page. They have a big amusement"
      },
      {
        "Time_Start": 1369.6,
        "Time_End": 1376.92,
        "Text": " park in Baden, but that's it, so. But I was here in Europe, they have, as I told you at"
      },
      {
        "Time_Start": 1376.92,
        "Time_End": 1382.6,
        "Text": " the beginning, Spain is one of the countries with more customers, and then some in Turkey,"
      },
      {
        "Time_Start": 1382.6000000000001,
        "Time_End": 1394.8400000000001,
        "Text": " but here in Germany, just Baden, so. See you there. About the conclusions. At 2024,"
      },
      {
        "Time_Start": 1394.8400000000001,
        "Time_End": 1400.64,
        "Text": " we still have some simple vulnerabilities in that stuff, so the zero days are so fucking"
      },
      {
        "Time_Start": 1400.64,
        "Time_End": 1408.68,
        "Text": " awesome, too, but just with some random stuff, we can exploit the big companies. The culture"
      },
      {
        "Time_Start": 1408.68,
        "Time_End": 1414.44,
        "Text": " could help the companies to avoid these mistakes and fix them in the development stage, and"
      },
      {
        "Time_Start": 1414.44,
        "Time_End": 1420.0,
        "Text": " you don't need to wait until the product is in production to fix it. Education and training"
      },
      {
        "Time_Start": 1420.0,
        "Time_End": 1426.16,
        "Text": " for the company, the normal stuff for everything. When I found this stuff, I reported several"
      },
      {
        "Time_Start": 1426.16,
        "Time_End": 1435.76,
        "Text": " times, and in April, yes, in April, May, they say we had a meeting in Colombia. I say, okay,"
      },
      {
        "Time_Start": 1435.92,
        "Time_End": 1440.6,
        "Text": " let's work together to fix all the stuff, la, la, la. They say, sure, let's do it. I mean, I report"
      },
      {
        "Time_Start": 1440.6,
        "Time_End": 1445.16,
        "Text": " in that stuff, so, if you want to work and you want to pay me for the stuff, that's perfect,"
      },
      {
        "Time_Start": 1445.16,
        "Time_End": 1453.96,
        "Text": " but I'm doing this stuff just for fun, I mean. Okay, I wrote my report, I send them, and that"
      },
      {
        "Time_Start": 1453.96,
        "Time_End": 1459.64,
        "Text": " was like two months ago, and they didn't answer, so last week, I sent another email, hey, guys,"
      },
      {
        "Time_Start": 1459.96,
        "Time_End": 1466.2800000000002,
        "Text": " what about, did you fix the stuff or something? And no one answered, so I hope they fix it."
      },
      {
        "Time_Start": 1466.2800000000002,
        "Time_End": 1473.72,
        "Text": " And if not, you can go to Aden. No, I'm joking. So, if you found something, report the stuff,"
      },
      {
        "Time_Start": 1473.72,
        "Time_End": 1479.0800000000002,
        "Text": " just don't be an asshole and be facing the website and the stuff. You can report that and write the"
      },
      {
        "Time_Start": 1479.0800000000002,
        "Time_End": 1485.4,
        "Text": " talk for the stuff. And if someone sends you some report, please pay a little bit of attention. You"
      },
      {
        "Time_Start": 1485.4,
        "Time_End": 1489.72,
        "Text": " don't need to pay them, but just, hey, thank you, thank you for reporting the stuff, and that's"
      },
      {
        "Time_Start": 1489.72,
        "Time_End": 1497.16,
        "Text": " it, but just don't be an asshole again. And that's all. So, that was so fast. So, we have, like,"
      },
      {
        "Time_Start": 1497.16,
        "Time_End": 1498.92,
        "Text": " 35 minutes. Thank you so much."
      },
      {
        "Time_Start": 1507.88,
        "Time_End": 1514.68,
        "Text": " Thank you for the very entertaining talk, and the nice slides. And are there any questions"
      },
      {
        "Time_Start": 1514.68,
        "Time_End": 1521.8,
        "Text": " here in the audience? Man, that must have been one hell of a Brazilian girl."
      },
      {
        "Time_Start": 1528.6000000000001,
        "Time_End": 1529.5600000000002,
        "Text": " Any other questions?"
      },
      {
        "Time_Start": 1533.96,
        "Time_End": 1540.28,
        "Text": " From my side, maybe. Are there any other things, other findings in the pipeline that you are still"
      },
      {
        "Time_Start": 1540.36,
        "Time_End": 1544.6,
        "Text": " not talking about? Yeah, I'm going to go present this talk in Vegas at DEF CON."
      },
      {
        "Time_Start": 1544.6,
        "Time_End": 1549.32,
        "Text": " And we'll be maybe more focused in the US machines. But also, I want to present this"
      },
      {
        "Time_Start": 1549.32,
        "Time_End": 1555.8,
        "Text": " talk in Sky Talks, which is not recorded. So, if you want to see more vulnerabilities,"
      },
      {
        "Time_Start": 1555.8,
        "Time_End": 1561.3999999999999,
        "Text": " you can go there and check. But yeah, I'm going to go more in deep in some stuff, in some APIs,"
      },
      {
        "Time_Start": 1561.96,
        "Time_End": 1569.08,
        "Text": " and some disclosures, too. Any other questions from the audience?"
      },
      {
        "Time_Start": 1570.28,
        "Time_End": 1575.08,
        "Text": " Okay. Then, thanks again."
      }
    ]
  }
}