{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 9.96,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Welcome to our talk. I am Starr Brown and I am pleased to introduce Bob Gorley of"
    },
    {
      "Time_Start": 9.96,
      "Time_End": 17.32,
      "Text": " say your company, OODA, Datalink, and I am the executive director of the XR"
    },
    {
      "Time_Start": 17.32,
      "Time_End": 22.88,
      "Text": " Village and you're joining us today to understand from fiction to reality the"
    },
    {
      "Time_Start": 22.88,
      "Time_End": 30.28,
      "Text": " history of the metaverse and XR. Thanks Starr. And Starr, first I want to say thanks for"
    },
    {
      "Time_Start": 30.28,
      "Time_End": 33.48,
      "Text": " pulling together the XR Village. For those of you who haven't done it yet"
    },
    {
      "Time_Start": 33.48,
      "Time_End": 37.48,
      "Text": " please sign up for our discord because there's going to be a lot of persistent"
    },
    {
      "Time_Start": 37.48,
      "Time_End": 41.4,
      "Text": " content in the discord including things like these slides that we'll put there."
    },
    {
      "Time_Start": 41.4,
      "Time_End": 48.32,
      "Text": " And the XR Village has got to capture the flag going on right now and some"
    },
    {
      "Time_Start": 48.32,
      "Time_End": 52.84,
      "Text": " demos with some advanced technology that's really awesome. What we'd like to"
    },
    {
      "Time_Start": 52.84,
      "Time_End": 57.6,
      "Text": " talk about today is the past present and future of the metaverse and some"
    },
    {
      "Time_Start": 57.6,
      "Time_End": 62.68000000000001,
      "Text": " threats to the metaverse. We thought I'd start with some slides that I'll"
    },
    {
      "Time_Start": 62.68000000000001,
      "Time_End": 67.36,
      "Text": " quickly go through just to talk about my view of the threats and then Starr and I"
    },
    {
      "Time_Start": 67.36,
      "Time_End": 71.52000000000001,
      "Text": " will have a discussion on the topic. Sound about right? Sounds good. Okay let's"
    },
    {
      "Time_Start": 71.52000000000001,
      "Time_End": 75.72,
      "Text": " do it. So the topic of these slides is defending the metaverse and I wanted to"
    },
    {
      "Time_Start": 75.72,
      "Time_End": 79.72,
      "Text": " give you just an overview of what I'm trying to capture in these notes. If you"
    },
    {
      "Time_Start": 79.72,
      "Time_End": 83.4,
      "Text": " want a copy of this just send me an email or come to the discord server for"
    },
    {
      "Time_Start": 83.4,
      "Time_End": 87.48,
      "Text": " the XR Village and I'll post these there that you can download. So we are going to"
    },
    {
      "Time_Start": 87.48,
      "Time_End": 90.88,
      "Text": " talk about the metaverse and what it is and what it's not and how that relates"
    },
    {
      "Time_Start": 90.88,
      "Time_End": 95.08,
      "Text": " to XR. We're going to talk about then the key threats and some ideas on"
    },
    {
      "Time_Start": 95.08,
      "Time_End": 97.8,
      "Text": " mitigating the threats and we're going to talk a little bit about the history"
    },
    {
      "Time_Start": 97.8,
      "Time_End": 103.8,
      "Text": " of this stuff. Before going further I wanted to talk about the history of XR."
    },
    {
      "Time_Start": 103.92,
      "Time_End": 112.72,
      "Text": " XR meaning virtual reality, extended reality, augmented reality, all together"
    },
    {
      "Time_Start": 112.72,
      "Time_End": 119.52,
      "Text": " has a long history that I think actually starts in science fiction. There was a"
    },
    {
      "Time_Start": 119.52,
      "Time_End": 126.56,
      "Text": " 1935 science fiction story called Pygmalion's Glasses which outlined what"
    },
    {
      "Time_Start": 126.56,
      "Time_End": 131.36,
      "Text": " the metaverse is talked about today and what XR is talked about today. Science"
    },
    {
      "Time_Start": 131.4,
      "Time_End": 136.16000000000003,
      "Text": " fiction, a nice short story but it was really an exciting vision of what could"
    },
    {
      "Time_Start": 136.16000000000003,
      "Time_End": 141.16000000000003,
      "Text": " happen if you can put on goggles and be in a different world and that's what"
    },
    {
      "Time_Start": 141.16000000000003,
      "Time_End": 146.08,
      "Text": " we're building and experimenting with today in the XR Village. But there are"
    },
    {
      "Time_Start": 146.08,
      "Time_End": 150.28000000000003,
      "Text": " threats and that's what we wanted to get into with this presentation. I say"
    },
    {
      "Time_Start": 150.28000000000003,
      "Time_End": 153.64000000000001,
      "Text": " there's five threats but I'm going to talk about a sixth one that I learned"
    },
    {
      "Time_Start": 153.64000000000001,
      "Time_End": 158.8,
      "Text": " about today and with your feedback maybe there's more. We need to talk about the"
    },
    {
      "Time_Start": 158.8,
      "Time_End": 162.84,
      "Text": " threats so we can figure out how to mitigate the threats. The bottom line up"
    },
    {
      "Time_Start": 162.84,
      "Time_End": 170.68,
      "Text": " front, we are building through extended reality a new system, a metaverse, a new"
    },
    {
      "Time_Start": 170.68,
      "Time_End": 176.16000000000003,
      "Text": " wave of technology and it is not going to be more secure than the current waves"
    },
    {
      "Time_Start": 176.16000000000003,
      "Time_End": 181.4,
      "Text": " of technology. The three waves as we see them, the first wave was the internet"
    },
    {
      "Time_Start": 181.4,
      "Time_End": 186.28,
      "Text": " itself connecting computers and servers together in an interoperable way. The"
    },
    {
      "Time_Start": 186.28,
      "Time_End": 191.6,
      "Text": " second wave of internet technologies is the mobile revolution that based upon"
    },
    {
      "Time_Start": 191.6,
      "Time_End": 197.48,
      "Text": " cell technologies that included mobile devices and all the applications that"
    },
    {
      "Time_Start": 197.48,
      "Time_End": 204.16,
      "Text": " came with that. The third wave that is now being built is this XR wave. It's a"
    },
    {
      "Time_Start": 204.16,
      "Time_End": 209.6,
      "Text": " wave towards the metaverse. It really is the future. The first two waves are still"
    },
    {
      "Time_Start": 209.6,
      "Time_End": 215.52,
      "Text": " going to be there for a long time but the third wave, the XR wave, is what is"
    },
    {
      "Time_Start": 215.52,
      "Time_End": 220.32000000000002,
      "Text": " being built right now and is why this village is so hopping over here. Next"
    },
    {
      "Time_Start": 220.32000000000002,
      "Time_End": 226.28,
      "Text": " please. So what is the metaverse? You hear metaverse frequently. My view is don't"
    },
    {
      "Time_Start": 226.28,
      "Time_End": 230.72,
      "Text": " lock into anyone's specific definition. It's far too early for that but what is"
    },
    {
      "Time_Start": 230.72,
      "Time_End": 236.4,
      "Text": " being built is a massive scalable interoperable network of networks and"
    },
    {
      "Time_Start": 236.4,
      "Time_End": 242.32000000000002,
      "Text": " persistent virtual reality and augmented reality worlds. That metaverse is being"
    },
    {
      "Time_Start": 242.4,
      "Time_End": 246.51999999999998,
      "Text": " built but it's not here yet. We have hints of what's coming and I'll show you"
    },
    {
      "Time_Start": 246.51999999999998,
      "Time_End": 251.12,
      "Text": " a few on the next slide. Next please. So these are some of the hints that we're"
    },
    {
      "Time_Start": 251.12,
      "Time_End": 257.4,
      "Text": " seeing. I don't think of any of these as the metaverse. They're just indicators of"
    },
    {
      "Time_Start": 257.4,
      "Time_End": 261.56,
      "Text": " what's coming when it's all linked together in a scalable persistent way."
    },
    {
      "Time_Start": 261.56,
      "Time_End": 265.32,
      "Text": " You have all seen the business collaboration tools and the education"
    },
    {
      "Time_Start": 265.32,
      "Time_End": 269.0,
      "Text": " collaboration tools. I think you've probably all seen the games that are out"
    },
    {
      "Time_Start": 269.0,
      "Time_End": 272.88,
      "Text": " there that can be accessed through any computer or mobile devices through"
    },
    {
      "Time_Start": 272.88,
      "Time_End": 277.32,
      "Text": " extended reality, augmented reality, virtual reality. You don't have to have"
    },
    {
      "Time_Start": 277.32,
      "Time_End": 281.96,
      "Text": " the goggles but the goggles help a lot too. You have also seen the other tools"
    },
    {
      "Time_Start": 281.96,
      "Time_End": 289.64,
      "Text": " that are being the games like Roblox, Fortnite and others. The digital twins in"
    },
    {
      "Time_Start": 289.64,
      "Time_End": 293.52,
      "Text": " the business world you've seen. These are all hints of what's coming but it's not"
    },
    {
      "Time_Start": 293.52,
      "Time_End": 298.6,
      "Text": " the metaverse yet. Right. Next please. The metaverse is coming however and that"
    },
    {
      "Time_Start": 298.68,
      "Time_End": 303.36,
      "Text": " metaverse of tomorrow is going to impact so many industries as you can see over"
    },
    {
      "Time_Start": 303.36,
      "Time_End": 308.40000000000003,
      "Text": " in the XR village and get hints of what is coming including just about anyone"
    },
    {
      "Time_Start": 308.40000000000003,
      "Time_End": 312.32000000000005,
      "Text": " who needs to work with data for a business or professional reason but also"
    },
    {
      "Time_Start": 312.32000000000005,
      "Time_End": 317.42,
      "Text": " anyone who likes entertainment in a nice 3D interactive way. It is going to be a"
    },
    {
      "Time_Start": 317.42,
      "Time_End": 321.52000000000004,
      "Text": " trillion dollar industry. Next please. I'd like to jump in and share that we have"
    },
    {
      "Time_Start": 321.52000000000004,
      "Time_End": 326.8,
      "Text": " a live working model of a digital twin scenario with in collaboration with ICS"
    },
    {
      "Time_Start": 326.8,
      "Time_End": 333.04,
      "Text": " Village. It's off the rails and you can interact and explore practical uses of"
    },
    {
      "Time_Start": 333.04,
      "Time_End": 337.04,
      "Text": " this novel technology. Cool. You remind me of another thing that I think we should"
    },
    {
      "Time_Start": 337.04,
      "Time_End": 342.96000000000004,
      "Text": " have told these folks about and that is Bad VR. Bad VR is awesome and first of"
    },
    {
      "Time_Start": 342.96000000000004,
      "Time_End": 348.68,
      "Text": " all it's a great name for a company but Bad stands for bring all your data to VR"
    },
    {
      "Time_Start": 348.68,
      "Time_End": 354.68,
      "Text": " and there's a demo in your village. There is all new ways to visualize real time"
    },
    {
      "Time_Start": 354.68,
      "Time_End": 358.56,
      "Text": " with spatial packet capture and directly into the goggles so that in"
    },
    {
      "Time_Start": 358.56,
      "Time_End": 364.48,
      "Text": " your living world you can see Wi-Fi signals, other cellular signal, RF"
    },
    {
      "Time_Start": 364.48,
      "Time_End": 370.12,
      "Text": " signal and so on. Awesome. The way the business analysts look at this trillion"
    },
    {
      "Time_Start": 370.12,
      "Time_End": 374.2,
      "Text": " dollar industry is shown here. Next please. Now I want to talk about the"
    },
    {
      "Time_Start": 374.2,
      "Time_End": 378.24,
      "Text": " threats and when I built this I was thinking of five major threats that are"
    },
    {
      "Time_Start": 378.24,
      "Time_End": 382.8,
      "Text": " coming in the metaverse that are not being dealt with yet in my opinion. Now"
    },
    {
      "Time_Start": 382.8,
      "Time_End": 387.0,
      "Text": " running a village I want to be able to take input from everybody in the village"
    },
    {
      "Time_Start": 387.0,
      "Time_End": 391.52000000000004,
      "Text": " to see if this covers all the threats or not. I did hear of a sixth one today I"
    },
    {
      "Time_Start": 391.52000000000004,
      "Time_End": 395.68,
      "Text": " want to tell you about. Brief review of these threats being built I mean that"
    },
    {
      "Time_Start": 395.68,
      "Time_End": 399.04,
      "Text": " are impacting the metaverse. There's new privacy threats we all need to worry"
    },
    {
      "Time_Start": 399.04,
      "Time_End": 402.84000000000003,
      "Text": " about. If you have a device on your head and that is collecting data and moving"
    },
    {
      "Time_Start": 402.84000000000003,
      "Time_End": 407.12,
      "Text": " that data to the cloud there are privacy issues that we need to sort out today."
    },
    {
      "Time_Start": 407.12,
      "Time_End": 411.68,
      "Text": " There's an issue of languor. What happens if you put on devices and it just pulls"
    },
    {
      "Time_Start": 411.68,
      "Time_End": 415.40000000000003,
      "Text": " you into this world in ways that make you want to detach from the real world"
    },
    {
      "Time_Start": 415.40000000000003,
      "Time_End": 419.40000000000003,
      "Text": " and if too much of that happens in society what's going to happen to all of"
    },
    {
      "Time_Start": 419.40000000000003,
      "Time_End": 423.52,
      "Text": " us? And that relates directly to the third one the onophrenia which is an"
    },
    {
      "Time_Start": 423.52,
      "Time_End": 428.04,
      "Text": " inability over time to distinguish what is real and what is not real. A very"
    },
    {
      "Time_Start": 428.04,
      "Time_End": 433.04,
      "Text": " serious threat. Absolutely. There's new fraud vectors. If someone can know so"
    },
    {
      "Time_Start": 433.04,
      "Time_End": 437.52,
      "Text": " much about you including what you really desire it's going to make it easier for"
    },
    {
      "Time_Start": 437.52,
      "Time_End": 440.72,
      "Text": " them to commit fraud against you. And then I list the last one here of"
    },
    {
      "Time_Start": 440.72,
      "Time_End": 446.36,
      "Text": " unleashing demons. The worst of human spirit may be tapped into and brought"
    },
    {
      "Time_Start": 446.36,
      "Time_End": 451.12,
      "Text": " out in ways that are not good. Now I wanted to talk about the sixth threat"
    },
    {
      "Time_Start": 451.12,
      "Time_End": 456.32000000000005,
      "Text": " star. It's one that I it really didn't dawn on me this threat until"
    },
    {
      "Time_Start": 456.32000000000005,
      "Time_End": 462.32000000000005,
      "Text": " conversations this morning about the future of all this technology and it's"
    },
    {
      "Time_Start": 462.32000000000005,
      "Time_End": 467.24,
      "Text": " the threat to us humans and our livelihoods. Now this relates to far more"
    },
    {
      "Time_Start": 467.24,
      "Time_End": 472.72,
      "Text": " than just XR. This is XR plus artificial intelligence plus overall better"
    },
    {
      "Time_Start": 472.72,
      "Time_End": 477.32,
      "Text": " automation and technologies and we see what's going on right now in Hollywood"
    },
    {
      "Time_Start": 477.32,
      "Time_End": 482.56,
      "Text": " to screenwriters and actors and actresses and this is a serious threat"
    },
    {
      "Time_Start": 482.56,
      "Time_End": 487.36,
      "Text": " to them but it's also a threat to journalists. It's a threat to truck"
    },
    {
      "Time_Start": 487.36,
      "Time_End": 490.48,
      "Text": " drivers. It's a threat to those who work in agriculture in the mining industry."
    },
    {
      "Time_Start": 490.48,
      "Time_End": 494.8,
      "Text": " This is another threat we need to think about. The future of XR is that a threat"
    },
    {
      "Time_Start": 494.8,
      "Time_End": 499.40000000000003,
      "Text": " to us humans which leads to the need for frameworks to solve these threats"
    },
    {
      "Time_Start": 499.40000000000003,
      "Time_End": 505.8,
      "Text": " and I'll just rapidly push through these frameworks. I believe personally we need"
    },
    {
      "Time_Start": 505.8,
      "Time_End": 510.44,
      "Text": " to think through what does everybody need to do to mitigate these threats and"
    },
    {
      "Time_Start": 510.44,
      "Time_End": 514.6,
      "Text": " I'm looking for open ideas here so please get a copy of these slides off"
    },
    {
      "Time_Start": 514.6,
      "Time_End": 518.48,
      "Text": " our server. Read through this. Give me your feedback. How do we address these"
    },
    {
      "Time_Start": 518.48,
      "Time_End": 523.24,
      "Text": " threats? I've put in suggestions for individuals, communities, companies,"
    },
    {
      "Time_Start": 523.32,
      "Time_End": 527.84,
      "Text": " governments and academia and we don't need to go through all of this right now."
    },
    {
      "Time_Start": 527.84,
      "Time_End": 532.6800000000001,
      "Text": " It's my suggestions. Things for people, us to do. We need to keep learning for"
    },
    {
      "Time_Start": 532.6800000000001,
      "Time_End": 537.0,
      "Text": " go ahead and hit the next for communities. The communities like DEF CON"
    },
    {
      "Time_Start": 537.0,
      "Time_End": 540.76,
      "Text": " community. What do we want out of this new world of extended reality and"
    },
    {
      "Time_Start": 540.76,
      "Time_End": 545.4,
      "Text": " virtual reality and enhanced and augmented reality? We need to figure that"
    },
    {
      "Time_Start": 545.4,
      "Time_End": 549.24,
      "Text": " out for companies. Companies have a role to play here too. They really need to be"
    },
    {
      "Time_Start": 549.24,
      "Time_End": 554.92,
      "Text": " building in security that meets our requirements. So I interject here."
    },
    {
      "Time_Start": 554.92,
      "Time_End": 561.48,
      "Text": " The thing with building, you hit a keynote for me and the point is that we"
    },
    {
      "Time_Start": 561.48,
      "Time_End": 565.5600000000001,
      "Text": " need to start thinking about building products, software, hardware and policy"
    },
    {
      "Time_Start": 565.5600000000001,
      "Time_End": 570.0,
      "Text": " better by design from the beginning so that we avoid problems in the future."
    },
    {
      "Time_Start": 570.0,
      "Time_End": 578.84,
      "Text": " Yeah. There's a role for governments. I don't want the government in our VR"
    },
    {
      "Time_Start": 578.84,
      "Time_End": 583.5600000000001,
      "Text": " but they're going to be there and also I think there's a role in our government"
    },
    {
      "Time_Start": 583.5600000000001,
      "Time_End": 587.36,
      "Text": " in pushing back against hostile nation states that are going to be in our"
    },
    {
      "Time_Start": 587.36,
      "Time_End": 593.0,
      "Text": " extended reality. So we need to decide what we want our government to do in"
    },
    {
      "Time_Start": 593.0,
      "Time_End": 598.6800000000001,
      "Text": " this world. Yeah absolutely. The entire purpose of XR Village is to drive better"
    },
    {
      "Time_Start": 598.6800000000001,
      "Time_End": 603.32,
      "Text": " public policy and it's not no one likes being told what to do but the reality is"
    },
    {
      "Time_Start": 603.32,
      "Time_End": 608.48,
      "Text": " that for society to function we all need some set of regulations. A framework is a"
    },
    {
      "Time_Start": 608.48,
      "Time_End": 614.8000000000001,
      "Text": " good place to start but we need to get collectively informed, educated, have a"
    },
    {
      "Time_Start": 614.8000000000001,
      "Time_End": 619.16,
      "Text": " little fun but then go make the rules better. Make the rules we want to see"
    },
    {
      "Time_Start": 619.16,
      "Time_End": 626.48,
      "Text": " because we're in a position now with emerging policies and other legal"
    },
    {
      "Time_Start": 626.48,
      "Time_End": 632.32,
      "Text": " representations in Washington and beyond that these conversations are happening."
    },
    {
      "Time_Start": 632.32,
      "Time_End": 637.64,
      "Text": " So now is the time to scream to make sure that we can inform better public"
    },
    {
      "Time_Start": 637.64,
      "Time_End": 642.08,
      "Text": " policy for tomorrow. Yeah what a great goal and it's a great opportunity to"
    },
    {
      "Time_Start": 642.08,
      "Time_End": 648.4,
      "Text": " engage with this village which gets to this recommendation list here. Join our"
    },
    {
      "Time_Start": 648.4,
      "Time_End": 655.28,
      "Text": " discord server, come meet with Star over in the village and get engaged and that"
    },
    {
      "Time_Start": 655.28,
      "Time_End": 659.04,
      "Text": " Star is kind of the end of the graphics really if you wanted to transition to"
    },
    {
      "Time_Start": 659.04,
      "Time_End": 666.68,
      "Text": " the discussion portion of our time together here. Yeah I think I think the"
    },
    {
      "Time_Start": 666.6800000000001,
      "Time_End": 670.5200000000001,
      "Text": " time is now. I don't know how to make that go away so we're gonna live with it"
    },
    {
      "Time_Start": 670.5200000000001,
      "Time_End": 676.44,
      "Text": " but the point is is how many people in this room knew what extended reality was"
    },
    {
      "Time_Start": 676.44,
      "Time_End": 681.0000000000001,
      "Text": " before sitting down? You knew the umbrella term. That's wonderful because"
    },
    {
      "Time_Start": 681.0000000000001,
      "Time_End": 685.6800000000001,
      "Text": " every single person with the exception of one has said I have no idea. I've"
    },
    {
      "Time_Start": 685.6800000000001,
      "Time_End": 691.32,
      "Text": " talked to thousands of people so far this weekend and in a room of computer"
    },
    {
      "Time_Start": 691.32,
      "Time_End": 696.5600000000001,
      "Text": " people or security people I might expect that you'd have more more understanding"
    },
    {
      "Time_Start": 696.5600000000001,
      "Time_End": 700.6800000000001,
      "Text": " of at least what the umbrella encompasses so that we can understand"
    },
    {
      "Time_Start": 700.6800000000001,
      "Time_End": 706.12,
      "Text": " the vulnerabilities that lie ahead to help. You know and Star I think this is"
    },
    {
      "Time_Start": 706.12,
      "Time_End": 710.2800000000001,
      "Text": " one it underscores for me that you are a pioneer and the other village founders"
    },
    {
      "Time_Start": 710.2800000000001,
      "Time_End": 714.5200000000001,
      "Text": " and I'm very glad this is starting. It was here last year in a small way but"
    },
    {
      "Time_Start": 714.5200000000001,
      "Time_End": 719.0000000000001,
      "Text": " now you've really grown and I think next year you're probably gonna be connected"
    },
    {
      "Time_Start": 719.0000000000001,
      "Time_End": 723.9200000000001,
      "Text": " to every other village it seems like. It seems like it and to be honest a lot of"
    },
    {
      "Time_Start": 723.92,
      "Time_End": 728.7199999999999,
      "Text": " our current setup came because it takes a village and that is the theme for the"
    },
    {
      "Time_Start": 728.7199999999999,
      "Time_End": 733.56,
      "Text": " year and we wouldn't be here without having been accepted as an adjunct to"
    },
    {
      "Time_Start": 733.56,
      "Time_End": 739.88,
      "Text": " other appropriate areas from biohacking to car hacking to ICS and beyond policy"
    },
    {
      "Time_Start": 739.88,
      "Time_End": 745.8,
      "Text": " of course and this year we're standing alone and we have pretty pretty solid"
    },
    {
      "Time_Start": 745.8,
      "Time_End": 752.0799999999999,
      "Text": " interest in the topic so I'm really here to ask the community to contribute to"
    },
    {
      "Time_Start": 752.08,
      "Time_End": 757.5600000000001,
      "Text": " think about how how the metaverse and how living outside of what you can touch"
    },
    {
      "Time_Start": 757.5600000000001,
      "Time_End": 763.2800000000001,
      "Text": " can be affected and think about the naughty things. Think about the way we"
    },
    {
      "Time_Start": 763.2800000000001,
      "Time_End": 769.5200000000001,
      "Text": " can tell people what we need to fix today. Right I think that's exactly what"
    },
    {
      "Time_Start": 769.5200000000001,
      "Time_End": 773.8000000000001,
      "Text": " I think needs to happen too. If we want our technology to serve humans and make"
    },
    {
      "Time_Start": 773.8000000000001,
      "Time_End": 777.6800000000001,
      "Text": " the universe better we need to figure out what these threats really are and"
    },
    {
      "Time_Start": 777.6800000000001,
      "Time_End": 781.2,
      "Text": " then how to mitigate them and I love the way that you said we're informing policy"
    },
    {
      "Time_Start": 781.6,
      "Time_End": 786.48,
      "Text": " because we have direct connections now into the policy world. We are we're making great"
    },
    {
      "Time_Start": 786.48,
      "Time_End": 793.2,
      "Text": " leaps ahead in some regards but we are still talking to each other you know we"
    },
    {
      "Time_Start": 793.2,
      "Time_End": 797.44,
      "Text": " need to get to a position where we can include and educate and I think we're"
    },
    {
      "Time_Start": 797.44,
      "Time_End": 801.72,
      "Text": " really at the right time to do so. You know another thing I noticed about your"
    },
    {
      "Time_Start": 801.72,
      "Time_End": 806.6800000000001,
      "Text": " village is there's a lot of young people there. It is it is this morning I think"
    },
    {
      "Time_Start": 806.6800000000001,
      "Time_End": 810.84,
      "Text": " everybody was maybe a little hungover and that's you know that's awesome but"
    },
    {
      "Time_Start": 810.84,
      "Time_End": 816.6,
      "Text": " we have a lot of children this morning in this equipment and and really"
    },
    {
      "Time_Start": 816.6,
      "Time_End": 821.08,
      "Text": " becoming some of the best demonstrators of I have you know a seven-year-old"
    },
    {
      "Time_Start": 821.08,
      "Time_End": 826.96,
      "Text": " grabbing Wi-Fi bars out of the sky and giving bad VRs demo. They latch on like"
    },
    {
      "Time_Start": 826.96,
      "Time_End": 832.48,
      "Text": " this. They adopt like this. This is why we need to think about this. I work largely"
    },
    {
      "Time_Start": 832.52,
      "Time_End": 836.5600000000001,
      "Text": " in the education space and I've encountered many teachers who are"
    },
    {
      "Time_Start": 836.5600000000001,
      "Time_End": 842.76,
      "Text": " actively using AR in the classroom. VR in the classroom. They've been doing it"
    },
    {
      "Time_Start": 842.76,
      "Time_End": 848.2,
      "Text": " for five years. They have zero concept who is looking backwards at their"
    },
    {
      "Time_Start": 848.2,
      "Time_End": 852.88,
      "Text": " children in said classroom. They didn't even know it was a thing. They didn't"
    },
    {
      "Time_Start": 852.88,
      "Time_End": 858.48,
      "Text": " know that data was stored. They didn't know that data was perhaps viewable in"
    },
    {
      "Time_Start": 858.48,
      "Time_End": 863.84,
      "Text": " ways that they might not expect. So things beyond there's temperature"
    },
    {
      "Time_Start": 863.84,
      "Time_End": 868.0,
      "Text": " sensing technology and I'll just leave that there. So it's it's a pretty"
    },
    {
      "Time_Start": 868.0,
      "Time_End": 872.4,
      "Text": " interesting field to put on glasses and see something that we're not all"
    },
    {
      "Time_Start": 872.4,
      "Time_End": 877.76,
      "Text": " realizing is being seen. And can I put you on the spot and ask you for a real"
    },
    {
      "Time_Start": 877.76,
      "Time_End": 881.76,
      "Text": " definition of XR because I'm not sure I'm using that in the proper way and how"
    },
    {
      "Time_Start": 881.76,
      "Time_End": 888.24,
      "Text": " do you define XR? I tend to think of XR as being an umbrella term. So for me"
    },
    {
      "Time_Start": 888.5600000000001,
      "Time_End": 892.8,
      "Text": " it's less about the metaverse and I think working through you it makes me"
    },
    {
      "Time_Start": 892.8,
      "Time_End": 899.84,
      "Text": " really think beyond hardware. So I think it's XR encompasses AR and VR along"
    },
    {
      "Time_Start": 899.84,
      "Time_End": 909.6,
      "Text": " with the associated virtual worlds. Wonderful. That's great. Well I really"
    },
    {
      "Time_Start": 909.6,
      "Time_End": 914.8,
      "Text": " think this village is contributing already and I'm wondering if we can"
    },
    {
      "Time_Start": 914.8800000000001,
      "Time_End": 919.2,
      "Text": " entice more people into the Discord server if we can persist this dialogue"
    },
    {
      "Time_Start": 919.2,
      "Time_End": 925.84,
      "Text": " between DEF CONs. Absolutely. Absolutely. So join us on Discord, XR Village."
    },
    {
      "Time_Start": 925.84,
      "Time_End": 929.44,
      "Text": " You'll find our information on Twitter and on the slides and not those slides"
    },
    {
      "Time_Start": 929.44,
      "Time_End": 934.0000000000001,
      "Text": " though. So we'll come over. We're down yonder. We'd love to have you come play"
    },
    {
      "Time_Start": 934.0,
      "Time_End": 944.32,
      "Text": " and then come see the demos and check us out. Cool. Thank you."
    }
  ]
}