{"segments": [{"Time_Start": 0.0, "Time_End": 7.0, "Text": " Thank you."}, {"Time_Start": 7.0, "Time_End": 9.0, "Text": " Thank you."}, {"Time_Start": 9.0, "Time_End": 13.0, "Text": " It's always great to be back every year."}, {"Time_Start": 13.0, "Time_End": 15.0, "Text": " I think this is definitely the last time."}, {"Time_Start": 15.0, "Time_End": 18.0, "Text": " And, you know, sooner later, you're right."}, {"Time_Start": 18.0, "Time_End": 22.0, "Text": " What I wanted to do today, because when you look back over nine years"}, {"Time_Start": 22.0, "Time_End": 25.0, "Text": " and look at the different themes that I have been talking about,"}, {"Time_Start": 25.0, "Time_End": 29.0, "Text": " you realize you've kind of arrived at a point where they really have converged."}, {"Time_Start": 29.0, "Time_End": 41.0, "Text": " that the issues as we have evolved together have formed a very clear focus for me and it's going to be difficult to articulate it as clear as it is to me"}, {"Time_Start": 41.0, "Time_End": 44.0, "Text": " because I don't think we yet have the language to understand it."}, {"Time_Start": 44.0, "Time_End": 47.0, "Text": " So I'm going to try and it's going to have some dense pieces in it."}, {"Time_Start": 47.0, "Time_End": 51.0, "Text": " We've only got, what, 40 minutes to talk and I do want after a few minutes."}, {"Time_Start": 51.0, "Time_End": 58.0, "Text": " Hopefully I will stimulate questions and do not hesitate to ask them and we'll manage that as best we can."}, {"Time_Start": 58.0, "Time_End": 67.0, "Text": " because what I'm trying to talk about, I call it quantum hacking, but that's just one of those titles I make up that doesn't necessarily mean a lot."}, {"Time_Start": 67.0, "Time_End": 83.0, "Text": " But what I'm trying to say is that clearly people, when they are discussing security and privacy and intellectual property and intelligence and cyber war and all the issues that are blazed on the media's crosswires all the time,"}, {"Time_Start": 83.0, "Time_End": 86.0, "Text": " often sound like they're coming from totally different perspectives."}, {"Time_Start": 86.0, "Time_End": 115.98, "Text": " And it became perfectly clear to me that they were, that in fact, the transition in the middle of which we find ourselves from one way of framing our understanding of humankind to the next makes it impossible for people to articulate clearly what they see unless they know what their assumptions are, because it is from those assumptions that the conversation issues. And when people are coming at them from different assumptions, it sounds like conflict. But in fact, one is like relativity and one is like."}, {"Time_Start": 116.0, "Time_End": 122.0, "Text": " quantum mechanics, which you know, I don't know anything about physics other than what I read in picture books."}, {"Time_Start": 122.0, "Time_End": 128.5, "Text": " You know, meet Mr. Neutrino or I am Mr. Quark, you know, that kind of thing."}, {"Time_Start": 129.1, "Time_End": 130.5, "Text": " It's popularized stuff."}, {"Time_Start": 130.5, "Time_End": 135.5, "Text": " I can't do the math, but I try to grasp it as best I can by reading popularized accounts."}, {"Time_Start": 135.5, "Time_End": 140.6, "Text": " And string theory, as I understand it, is an attempt to dig more deeply using mathematical structures"}, {"Time_Start": 140.6, "Time_End": 145.98, "Text": " that will somehow reconcile seemingly contradictory ways of constructing reality, one"}, {"Time_Start": 146.0, "Time_End": 150.9, "Text": " called relativity, the other called quantum mechanics. Or it is kind of like the wave"}, {"Time_Start": 150.9, "Time_End": 155.38, "Text": " particle duality, which we now all know and are taught as common sense. If you look at the"}, {"Time_Start": 155.38, "Time_End": 159.96, "Text": " photon from the point of view of a particle, it will behave like a particle and you can measure"}, {"Time_Start": 159.96, "Time_End": 164.68, "Text": " it as if it is a particle, whereas if you look at it as if it is a wave, it will behave"}, {"Time_Start": 164.68, "Time_End": 170.9, "Text": " like a wave. I think what I like to call cyborg humanity, in other words, humanity as"}, {"Time_Start": 170.9, "Time_End": 175.98, "Text": " formed by its symbiotic relationship with network computing, is becoming a different"}, {"Time_Start": 176.0, "Time_End": 180.28, "Text": " kind of humanity, if by that we simply mean it would have to get into essence and"}, {"Time_Start": 180.28, "Time_End": 185.24, "Text": " philosophical concepts to know that we think and behave differently. And that's the value"}, {"Time_Start": 185.24, "Time_End": 190.68, "Text": " of being older and still having some memory left, is that you remember how you used to"}, {"Time_Start": 190.68, "Time_End": 195.18, "Text": " think and you notice that it is profoundly different from the way you think now. And there"}, {"Time_Start": 195.18, "Time_End": 199.94, "Text": " have been analogies in the past to this kind of event, like William Kaxton, who brought the printing"}, {"Time_Start": 199.94, "Time_End": 205.8, "Text": " press to England in the late 1400s. And when he was in his 60s, he looked back and said"}, {"Time_Start": 205.8, "Time_End": 212.9, "Text": " the England I remember is not the England I inhabit. So profound has been the transformation"}, {"Time_Start": 212.9, "Time_End": 217.62, "Text": " by this machine of the space we inhabit. I mean, that's what he would have said if he had done"}, {"Time_Start": 217.62, "Time_End": 221.72, "Text": " asked and used words like the space has changed. I don't remember exactly how he did it,"}, {"Time_Start": 222.12, "Time_End": 226.20000000000002, "Text": " but that's what he meant. The space has changed, and he didn't mean the physical space out there."}, {"Time_Start": 226.5, "Time_End": 231.42000000000002, "Text": " He meant the internal landscape we inhabit as our subjective field of collective experience."}, {"Time_Start": 231.9, "Time_End": 235.78, "Text": " Because what the printing press had done was taken peoples who thought of themselves"}, {"Time_Start": 235.8, "Time_End": 242.14000000000001, "Text": " as individual units, smaller groupings, tribal units, if you will, and had names"}, {"Time_Start": 242.14000000000001, "Time_End": 247.34, "Text": " and identities based on those units, and by choosing a dialect, a single one among many,"}, {"Time_Start": 247.34, "Time_End": 252.8, "Text": " and then imposing that on the whole space called English, created the space called English,"}, {"Time_Start": 252.8, "Time_End": 259.04, "Text": " and someone who thought of themselves in 1500 as an English person profoundly experienced"}, {"Time_Start": 259.04, "Time_End": 264.7, "Text": " reality differently than someone who thought they were a Yorkshireman or from East Essex merely."}, {"Time_Start": 265.8, "Time_End": 270.84000000000003, "Text": " was a transformative engine, and during the transition, people get confused, and the"}, {"Time_Start": 270.84000000000003, "Time_End": 277.24, "Text": " space gets gray. I love working in the gray spaces, because that's where we can see most clearly"}, {"Time_Start": 277.24, "Time_End": 284.12, "Text": " what is emerging. And I love the term gray hat hacker. It's one of my favorites. A gray hat hacker,"}, {"Time_Start": 284.12, "Time_End": 287.06, "Text": " as you know, is a black hat hacker who needs a job."}, {"Time_Start": 289.16, "Time_End": 295.78000000000003, "Text": " And, right? Okay, validation. So I'll go on."}, {"Time_Start": 295.8, "Time_End": 300.12, "Text": " to the next, which is a white hat hacker, which is a black hat hacker who does not"}, {"Time_Start": 300.12, "Time_End": 308.68, "Text": " always tell the truth. Because how else did you learn anything, except by doing what subsequently,"}, {"Time_Start": 308.68, "Time_End": 314.52, "Text": " as the context was redefined, came to be called black hat hacking. Well, now something else"}, {"Time_Start": 314.52, "Time_End": 319.32, "Text": " is happening too long the evolutionary path. Jay Heiser, a month or two ago, and information security"}, {"Time_Start": 319.32, "Time_End": 323.68, "Text": " wrote a piece in which he said he was on a platform and someone introduced himself as a white"}, {"Time_Start": 323.68, "Time_End": 330.0, "Text": " hat hacker. And he said, cut out all the cowboy crap. We're not cowboys, and we don't"}, {"Time_Start": 330.0, "Time_End": 335.46, "Text": " wear white and gray and black hats. This is about risk management. We're kind of insurance"}, {"Time_Start": 335.46, "Time_End": 341.46000000000004, "Text": " people in a business. Now, what did that signify? There are a number of places you could put the"}, {"Time_Start": 341.46000000000004, "Time_End": 346.62, "Text": " markers. But, you know, every time something truly powerful emerges, first there's mythology."}, {"Time_Start": 347.22, "Time_End": 352.04, "Text": " Then the mythology is turned into metaphor, and then the metaphor is deconstructed and described"}, {"Time_Start": 352.04, "Time_End": 353.38, "Text": " objectively and scientifically."}, {"Time_Start": 353.68, "Time_End": 357.76, "Text": " And by the time you're doing that, no one believes the myth anymore."}, {"Time_Start": 357.92, "Time_End": 359.86, "Text": " What was the mythology of hacking?"}, {"Time_Start": 360.22, "Time_End": 364.36, "Text": " Well, go back to when the net began to emerge in public imagination."}, {"Time_Start": 364.36, "Time_End": 368.86, "Text": " And Gibson wrote Neuromancer, and Sterling wrote Islands in the Net,"}, {"Time_Start": 369.34000000000003, "Time_End": 370.9, "Text": " anticipating wisely."}, {"Time_Start": 371.04, "Time_End": 372.72, "Text": " My title, Islands in the Clickstream."}, {"Time_Start": 373.9, "Time_End": 377.7, "Text": " And in a pre-cognitive moment."}, {"Time_Start": 378.26, "Time_End": 380.32, "Text": " You know, I don't know if Bruce will acknowledge that."}, {"Time_Start": 381.16, "Time_End": 382.96000000000004, "Text": " Sometimes people think they came before."}, {"Time_Start": 383.68, "Time_End": 386.48, "Text": " But that's their confusion in a space-time world."}, {"Time_Start": 389.5, "Time_End": 395.18, "Text": " At any rate, the mythology emerged as cyberspace, a consensual hallucination."}, {"Time_Start": 395.58, "Time_End": 399.62, "Text": " Well, you know, you could have applied that definition, which seems so profound to speech as well,"}, {"Time_Start": 399.68, "Time_End": 402.06, "Text": " which is also a consensual hallucination."}, {"Time_Start": 402.06, "Time_End": 405.28000000000003, "Text": " What we are engaged in right now is creating cyber speech."}, {"Time_Start": 405.74, "Time_End": 413.08, "Text": " In other words, a virtual space which we inhabit as if it is real, but which we have inhabited now for so long as humankind that speaks"}, {"Time_Start": 413.08, "Time_End": 419.32, "Text": " through the structures of the brain and the evolution of the teeth, tongue, palate, prefrontal cortex."}, {"Time_Start": 419.52, "Time_End": 425.62, "Text": " You know how it worked all together, and suddenly we built the symbolic space to manage the complexity of our social environment."}, {"Time_Start": 425.97999999999996, "Time_End": 428.9, "Text": " It seems like that's when it emerged to manage that."}, {"Time_Start": 429.24, "Time_End": 434.29999999999995, "Text": " So that could have been said a speech or writing or printing press, but he said it of electronic communication."}, {"Time_Start": 434.71999999999997, "Time_End": 435.9, "Text": " And people believe the myth."}, {"Time_Start": 435.96, "Time_End": 437.86, "Text": " You go back and read John Perry Barlow."}, {"Time_Start": 438.15999999999997, "Time_End": 442.64, "Text": " And now it sounds like someone who writes the lyrics for the Grateful Dead, exactly."}, {"Time_Start": 443.08, "Time_End": 447.35999999999996, "Text": " on a very, very extraordinarily powerful and enjoyable acid trip."}, {"Time_Start": 447.82, "Time_End": 451.94, "Text": " Because he was describing cyberspace as if it was separate from meat space."}, {"Time_Start": 452.35999999999996, "Time_End": 454.03999999999996, "Text": " And you remember, it's just sucked us in."}, {"Time_Start": 454.15999999999997, "Time_End": 455.88, "Text": " We're going to, we believe the myth."}, {"Time_Start": 456.03999999999996, "Time_End": 457.64, "Text": " Cyberspace has no boundaries."}, {"Time_Start": 458.09999999999997, "Time_End": 459.64, "Text": " Cyberspace has no laws."}, {"Time_Start": 460.09999999999997, "Time_End": 463.97999999999996, "Text": " Pioneers go out west, and there are no fences, and we can roam what we will"}, {"Time_Start": 463.97999999999996, "Time_End": 466.14, "Text": " and capture the pelts that we will and so on."}, {"Time_Start": 466.47999999999996, "Time_End": 469.32, "Text": " But sooner or later, come the merchants after the frontiersmen,"}, {"Time_Start": 469.65999999999997, "Time_End": 471.36, "Text": " and then after the merchants come the lawyers."}, {"Time_Start": 471.36, "Time_End": 473.06, "Text": " And when the lawyers show up, the game is always."}, {"Time_Start": 473.08, "Time_End": 481.47999999999996, "Text": " over. And you know it is. It is. Because what was free and open range where you could"}, {"Time_Start": 481.47999999999996, "Time_End": 487.15999999999997, "Text": " graze is now fenced in. And suddenly the dotted lines that they're drawing on maps are implied"}, {"Time_Start": 487.15999999999997, "Time_End": 492.03999999999996, "Text": " to be real lines, which by social construction and agreement, we all agree, are real. And we say,"}, {"Time_Start": 492.03999999999996, "Time_End": 496.88, "Text": " well, what about cyberspace then this powerful new domain, forgetting that it was invented"}, {"Time_Start": 496.88, "Time_End": 502.08, "Text": " over 40 or 50 years through the military, industrial, educational, entertainment media complex,"}, {"Time_Start": 502.08, "Time_End": 507.53999999999996, "Text": " for getting its origins and source. It's wraparound many censored surveillance systems"}, {"Time_Start": 507.53999999999996, "Time_End": 513.24, "Text": " that enable us to do what we do as if we are birds in digital cages. You don't have to move"}, {"Time_Start": 513.24, "Time_End": 519.46, "Text": " the bird. You just move the cage. That's where it came from. But we believe the mythology. But now"}, {"Time_Start": 519.46, "Time_End": 523.74, "Text": " when you read John Perry Barlow, it's clearly, you say, well, it was a metaphor. And by the time you"}, {"Time_Start": 523.74, "Time_End": 528.02, "Text": " say, well, it was a metaphor, it is not even a metaphor any longer. It is already being understood"}, {"Time_Start": 528.02, "Time_End": 532.06, "Text": " as it's chips and switches and routers and so on. It is the internet."}, {"Time_Start": 532.08, "Time_End": 536.0, "Text": " And it can be described mathematically and objectively, and some say that's the way I've"}, {"Time_Start": 536.0, "Time_End": 542.88, "Text": " always described it. So where do you put yourself on the trajectory? The myth, the metaphor, or"}, {"Time_Start": 542.88, "Time_End": 547.9200000000001, "Text": " the reality? Well, what I'm talking about really is trying to drill down to the deeper assumptions"}, {"Time_Start": 547.9200000000001, "Time_End": 555.0600000000001, "Text": " that control our perception and our behavior. And I'm going to try to say as sincerely and with"}, {"Time_Start": 555.0600000000001, "Time_End": 561.96, "Text": " as much passion as I can that from my understanding, because I do cross many borders and boundaries,"}, {"Time_Start": 562.08, "Time_End": 568.48, "Text": " and work in many different places. The stakes have never been higher. Because the danger we face now"}, {"Time_Start": 568.48, "Time_End": 575.9000000000001, "Text": " of losing things which may have already been lost irrevocably by having been put into a bureaucratic"}, {"Time_Start": 575.9000000000001, "Time_End": 581.94, "Text": " structure that it may not be possible to dismantle, mean that things we took for granted, like the"}, {"Time_Start": 581.94, "Time_End": 588.3000000000001, "Text": " First and Fourth Amendments, may truly be lost in the same way that hacking was given power"}, {"Time_Start": 588.3000000000001, "Time_End": 593.34, "Text": " by the technology to replace the spies or intelligence or counterintelligence of nation-states."}, {"Time_Start": 593.7600000000001, "Time_End": 598.2, "Text": " What used to be given by sanction of the state was given to a whole generation by sanction"}, {"Time_Start": 598.2, "Time_End": 603.3800000000001, "Text": " of the way the technology worked, i.e., the ability to break the rules, cross the borders,"}, {"Time_Start": 603.5400000000001, "Time_End": 608.1400000000001, "Text": " live in a world without walls, and seek out a way to free the mind. Well, the technology"}, {"Time_Start": 608.1400000000001, "Time_End": 613.7600000000001, "Text": " gave us that, but the technology also gives you the dark side. And the implementations of technology"}, {"Time_Start": 613.7600000000001, "Time_End": 618.1400000000001, "Text": " now. I'll say it at the end, too, try to make it clearer. The implementation"}, {"Time_Start": 618.3000000000001, "Time_End": 624.0400000000001, "Text": " of what technology enables us to do when fused with a mission imperative, that leaders"}, {"Time_Start": 624.0400000000001, "Time_End": 629.6200000000001, "Text": " who are using privacy and secrecy at a level we have not seen since Watergate and maybe"}, {"Time_Start": 629.6200000000001, "Time_End": 633.82, "Text": " before the Nixon administration, according to someone like John Dean, who is there."}, {"Time_Start": 634.1200000000001, "Time_End": 639.9000000000001, "Text": " This is not about Republicans, Democrats, libertarians. It's about the inevitable necessity of"}, {"Time_Start": 639.9000000000001, "Time_End": 645.9000000000001, "Text": " exposure and transparency because of what we are in danger of losing. And I'll try to be as specific"}, {"Time_Start": 645.9, "Time_End": 652.1, "Text": " as I can. Now, I said drill down to assumptions. I just did a speech in Black Hat."}, {"Time_Start": 652.1999999999999, "Time_End": 656.4599999999999, "Text": " I was plugged in, you know how well organized we are, right? At 10 o'clock the night before,"}, {"Time_Start": 656.5799999999999, "Time_End": 662.36, "Text": " could I do a speech at 10 o'clock the next morning? So I did one I had done at the Pentagon the week before."}, {"Time_Start": 662.48, "Time_End": 668.66, "Text": " And that's an example, I think, of the fact that I can go different places. But it's also true that when I"}, {"Time_Start": 668.66, "Time_End": 673.0799999999999, "Text": " looked out at who was in that conference room at the Pentagon, which was the only room in which I was allowed to go,"}, {"Time_Start": 673.4399999999999, "Time_End": 675.88, "Text": " other than the restroom, I noticed."}, {"Time_Start": 675.9, "Time_End": 678.4, "Text": " that about one-third of the people were people I knew from DefCon."}, {"Time_Start": 681.66, "Time_End": 686.38, "Text": " That's not an exaggeration. And people kept coming up and say, don't you recognize me? Well, no,"}, {"Time_Start": 686.48, "Time_End": 691.3, "Text": " when you're wearing fed clothes and have short, blonde hair one inch tall, and last year at"}, {"Time_Start": 691.3, "Time_End": 695.86, "Text": " DefCon, you had shoulder-length Jesus-like hair. No, I didn't recognize you right off the bat."}, {"Time_Start": 696.9399999999999, "Time_End": 700.6999999999999, "Text": " You're wearing a different uniform, and he subsequently wrote an email saying, well, I guess a hobby"}, {"Time_Start": 700.6999999999999, "Time_End": 703.36, "Text": " is a hobby, regardless of who pays the check."}, {"Time_Start": 703.36, "Time_End": 709.54, "Text": " And recently I was in Israel speaking for Microsoft Israel, and you'll appreciate this."}, {"Time_Start": 710.02, "Time_End": 715.1, "Text": " This was not the official line, but an email from the person who invited me to return for the second year to keynote the conference,"}, {"Time_Start": 715.5600000000001, "Time_End": 717.82, "Text": " said you are going to be the bookend for Steve Balmer."}, {"Time_Start": 718.0600000000001, "Time_End": 720.64, "Text": " And the reason is you will give Steve Balmer credibility."}, {"Time_Start": 724.0600000000001, "Time_End": 727.62, "Text": " Now, I'm only telling you that because you're my close friends."}, {"Time_Start": 727.72, "Time_End": 729.5, "Text": " Don't repeat that outside this room."}, {"Time_Start": 731.02, "Time_End": 733.26, "Text": " I don't think I'm going back anyway, a third time."}, {"Time_Start": 733.36, "Time_End": 738.36, "Text": " But the point is, why could I be trusted to do that, even though I had keynote at Apache"}, {"Time_Start": 738.36, "Time_End": 745.5600000000001, "Text": " Khan the year before, because I own myself, a situation in which you often, as you know, I think,"}, {"Time_Start": 746.02, "Time_End": 750.16, "Text": " find yourself feeling lonely and uncertain to what organizational structures you belong,"}, {"Time_Start": 750.26, "Time_End": 752.12, "Text": " even as they morph and their identity changes."}, {"Time_Start": 752.6800000000001, "Time_End": 759.32, "Text": " But we do need some kind of social community to reinforce our sense of who we are in this transitional time"}, {"Time_Start": 759.32, "Time_End": 763.34, "Text": " so we can make a conscious, intentional effort to develop."}, {"Time_Start": 763.36, "Time_End": 769.4, "Text": " and build the identity that we need to build in this time of transition and morphing organizational"}, {"Time_Start": 769.4, "Time_End": 776.12, "Text": " structures. And that's why I come back here. This is one of the places where I have developed"}, {"Time_Start": 776.12, "Time_End": 783.82, "Text": " trusted friends who allow me to discover who I really am and make my primary commitments."}, {"Time_Start": 783.82, "Time_End": 788.0, "Text": " You wouldn't think that you come to the primary hacker convention to find your ethical"}, {"Time_Start": 788.0, "Time_End": 793.34, "Text": " or moral center. But once you've been out there where people"}, {"Time_Start": 793.36, "Time_End": 798.54, "Text": " think they have an ethical and moral center and have lied to themselves about where they put it"}, {"Time_Start": 798.54, "Time_End": 804.78, "Text": " as opposed to in here where we know we create it from scratch every day of our lives. It really"}, {"Time_Start": 804.78, "Time_End": 809.34, "Text": " is a place where you can find it. So what are some of the assumptions in that speech of Black had"}, {"Time_Start": 809.34, "Time_End": 815.36, "Text": " I mentioned Matt Blaise's statement that the critic of the missing link or the weakest link in any security"}, {"Time_Start": 815.36, "Time_End": 820.98, "Text": " situation is often the definition of the problem. And the definition of the problem is most often"}, {"Time_Start": 820.98, "Time_End": 823.3000000000001, "Text": " not what we think it is."}, {"Time_Start": 824.02, "Time_End": 829.34, "Text": " And so you have to drill down below your assumption about the space of the network and who owns it"}, {"Time_Start": 829.34, "Time_End": 834.3000000000001, "Text": " and how it operates in order to see what matters most in order to know what really needs"}, {"Time_Start": 834.3000000000001, "Time_End": 839.44, "Text": " to be secured or if you're intruding in that network to know what really matters that you need to take"}, {"Time_Start": 839.44, "Time_End": 844.4, "Text": " out in order to build a piece of something bigger so you can understand what's going on."}, {"Time_Start": 844.7, "Time_End": 848.78, "Text": " And I'm saying that's my work because the system won't answer any questions about itself."}, {"Time_Start": 848.78, "Time_End": 855.52, "Text": " Robin Roberts, she used to be head of R&D's CIA Infosec, R&D, a small group, but a powerful group."}, {"Time_Start": 856.16, "Time_End": 858.66, "Text": " She said that you can't query the system."}, {"Time_Start": 858.78, "Time_End": 862.3199999999999, "Text": " You cannot ask it once it is built what assumptions it is making."}, {"Time_Start": 862.88, "Time_End": 869.04, "Text": " And therefore the human awareness or consciousness of what it is and does is what's most critical for the hacker mentality."}, {"Time_Start": 869.64, "Time_End": 872.86, "Text": " Or Sal Svi said, a friend who brought me to Microsoft in the first place,"}, {"Time_Start": 873.12, "Time_End": 877.22, "Text": " after listening to my talks at Black Hat, which is how she found me on the web,"}, {"Time_Start": 877.22, "Time_End": 878.24, "Text": " Excuse me."}, {"Time_Start": 878.82, "Time_End": 884.98, "Text": " She said she noticed that more and more people are substituting security appliance for building a secure network."}, {"Time_Start": 885.4, "Time_End": 888.48, "Text": " And more and more people are simply putting the appliance in their network."}, {"Time_Start": 888.48, "Time_End": 894.3000000000001, "Text": " And therefore, security seems to be inversely proportionate to how little you know about your system."}, {"Time_Start": 895.0600000000001, "Time_End": 899.9200000000001, "Text": " In other words, the feeling of security, not information assurance and general security,"}, {"Time_Start": 900.0400000000001, "Time_End": 904.6800000000001, "Text": " but the feeling of it, is inversely proportionate to what you know about the system"}, {"Time_Start": 904.6800000000001, "Time_End": 907.2, "Text": " because you have never taken that black box of power."}, {"Time_Start": 907.22, "Time_End": 911.82, "Text": " heart and seen what it does and doesn't do and how it interacts with the other applications."}, {"Time_Start": 912.9200000000001, "Time_End": 917.28, "Text": " And therefore, I enjoin you to remember Marshall McLuhan's statement, nothing is inevitable."}, {"Time_Start": 918.08, "Time_End": 922.48, "Text": " Nothing is inevitable so long as we are willing to become conscious."}, {"Time_Start": 923.0, "Time_End": 925.72, "Text": " So long as we are willing to become conscious."}, {"Time_Start": 926.02, "Time_End": 928.0600000000001, "Text": " That includes remembering history."}, {"Time_Start": 928.8000000000001, "Time_End": 934.72, "Text": " At the Pentagon, I was astonished to talk about the closed world of computer simulations using Paul Edwards,"}, {"Time_Start": 934.72, "Time_End": 936.98, "Text": " who teaches the University of Michigan's term for it."}, {"Time_Start": 937.22, "Time_End": 942.5400000000001, "Text": " book, the closed world, because it showed how the conversation or discourse in a simulated world"}, {"Time_Start": 942.5400000000001, "Time_End": 947.36, "Text": " built over 50 years is what determines the kinds of political choices we make."}, {"Time_Start": 947.36, "Time_End": 951.6, "Text": " And I said, you know, like, for example, Igloo White during Vietnam, and that one person"}, {"Time_Start": 951.6, "Time_End": 955.4200000000001, "Text": " in that military context knew what Igloo White was."}, {"Time_Start": 955.4200000000001, "Time_End": 961.0600000000001, "Text": " Who can tell me what Igloo White is?"}, {"Time_Start": 961.0600000000001, "Time_End": 963.38, "Text": " Thank you."}, {"Time_Start": 964.34, "Time_End": 965.5400000000001, "Text": " Throw him the Hershey Bar."}, {"Time_Start": 967.22, "Time_End": 971.98, "Text": " Igloo White was filling the Ho Chi Minh Trail coming down from North Vietnam, forking"}, {"Time_Start": 971.98, "Time_End": 976.38, "Text": " through Cambodia to South Vietnam, fill you with sensors that would detect, for example,"}, {"Time_Start": 976.38, "Time_End": 981.38, "Text": " the smell of urine, or the sound of human voices, or the footsteps of soldiers, or the treads"}, {"Time_Start": 981.38, "Time_End": 983.08, "Text": " of trucks and tanks."}, {"Time_Start": 983.08, "Time_End": 987.98, "Text": " In other words, it was an attempt to use electronic means to detect the enemy, and as soon as"}, {"Time_Start": 987.98, "Time_End": 991.46, "Text": " something was detected, and if you went to the center for Iglo White, it would look"}, {"Time_Start": 991.46, "Time_End": 996.98, "Text": " as terrific as the wall of knowledge looks when you go to Iraq and see how the battle"}, {"Time_Start": 996.98, "Time_End": 1002.26, "Text": " space is defined electronically. It looked great. It was the best video game in the world."}, {"Time_Start": 1002.72, "Time_End": 1007.44, "Text": " And whenever there was an interruption in the space, a perturbation in the force, they would push"}, {"Time_Start": 1007.44, "Time_End": 1011.82, "Text": " the button and a missile would hit, wherever the urine was, or the truck was, or the voice was,"}, {"Time_Start": 1011.9200000000001, "Time_End": 1016.62, "Text": " and then they would name it as a kill. And by the end of the wall, we had destroyed more trucks"}, {"Time_Start": 1016.62, "Time_End": 1022.2, "Text": " that North Vietnam had been capable of making. But no one noticed, because they were in the"}, {"Time_Start": 1022.2, "Time_End": 1026.8, "Text": " closed world of the simulation without a point of reference to something outside it."}, {"Time_Start": 1026.98, "Time_End": 1031.94, "Text": " metaphor and analogy, as I'm saying, that's the danger of an administration or a form of government"}, {"Time_Start": 1031.94, "Time_End": 1039.32, "Text": " as committed to secrecy as this one is doing what it is doing with the technology, which is bending"}, {"Time_Start": 1039.32, "Time_End": 1045.58, "Text": " the rules in a way they have never been built. So by the end of the war, we should have won,"}, {"Time_Start": 1045.68, "Time_End": 1049.88, "Text": " and there should have been no TED offensive, because the men in material to conduct it should"}, {"Time_Start": 1049.88, "Time_End": 1055.94, "Text": " never have passed that way. But of course, the Vietnamese had spoofed all the symptoms that we were"}, {"Time_Start": 1055.94, "Time_End": 1059.46, "Text": " attacking with missiles, because once they knew we were looking for urine and trucks and voices,"}, {"Time_Start": 1059.88, "Time_End": 1065.1000000000001, "Text": " of course, what do you provide, urine, trucks, voices, whatever. And every time there was a"}, {"Time_Start": 1065.1000000000001, "Time_End": 1069.44, "Text": " missile strike, they waited until it was over, and then they infiltrated down to South Vietnam."}, {"Time_Start": 1070.76, "Time_End": 1075.24, "Text": " Same thing happened with Watergate, but as I said, people who were in the Watergate space at"}, {"Time_Start": 1075.24, "Time_End": 1080.3200000000002, "Text": " the time are alarmed at the degree to which it is being done now inside a shroud of secrecy"}, {"Time_Start": 1080.3200000000002, "Time_End": 1085.78, "Text": " that must be penetrated. What will happen over time inevitably is the truth,"}, {"Time_Start": 1085.94, "Time_End": 1092.54, "Text": " will out. And who will blow the whistle is currently not known. But somebody will get"}, {"Time_Start": 1092.54, "Time_End": 1100.5, "Text": " to a point inside the system who can't stand what is happening. People are already at that"}, {"Time_Start": 1100.5, "Time_End": 1105.54, "Text": " point. Let me tell you how it works, because I've left different careers, and at first you try"}, {"Time_Start": 1105.54, "Time_End": 1110.72, "Text": " to negotiate with it. You try to fix it. You try to negotiate with the White House. You"}, {"Time_Start": 1110.72, "Time_End": 1114.66, "Text": " try to negotiate with the powers that be in different communities of intelligence. You"}, {"Time_Start": 1114.66, "Time_End": 1116.5, "Text": " You try to make it right."}, {"Time_Start": 1116.5, "Time_End": 1121.3200000000002, "Text": " You try to balance the legal issues against what you see people doing."}, {"Time_Start": 1121.3200000000002, "Time_End": 1125.74, "Text": " Because when there's a moral imperative, people feel forgiveness is much, much easier to get"}, {"Time_Start": 1125.74, "Time_End": 1127.8200000000002, "Text": " afterward than permission."}, {"Time_Start": 1127.8200000000002, "Time_End": 1137.0400000000002, "Text": " In the same way that murder and torture became fundamental attributes of strategy after 9-1-1."}, {"Time_Start": 1137.0400000000002, "Time_End": 1144.0600000000002, "Text": " And so they are trying inside those who have a conscience to do something that aligns the actions"}, {"Time_Start": 1144.06, "Time_End": 1151.72, "Text": " of our nation with the dictates of that conscience. But they also perceive how difficult"}, {"Time_Start": 1151.72, "Time_End": 1159.06, "Text": " and slippery it is. And someone whose conscience will not quit will sooner or later out the"}, {"Time_Start": 1159.06, "Time_End": 1166.02, "Text": " modus operandi of what is going on. I wish I could be more specific, but I can't. Because I'm"}, {"Time_Start": 1166.02, "Time_End": 1170.56, "Text": " not the Washington Post and I can't say what is going on. And anyone, if I did, would"}, {"Time_Start": 1170.56, "Time_End": 1174.04, "Text": " say he's crazy because that's easy to say."}, {"Time_Start": 1174.06, "Time_End": 1177.2, "Text": " And what are his sources? And what does he know about what he's talking about?"}, {"Time_Start": 1177.54, "Time_End": 1182.2, "Text": " And we would be left with a conspiracy theorist who had too much crack last night."}, {"Time_Start": 1182.48, "Time_End": 1188.48, "Text": " And pretty soon the reputation, such as it is, tattered though it may be, would come down."}, {"Time_Start": 1189.04, "Time_End": 1192.98, "Text": " So we have to keep a light heart as we go through this adventure."}, {"Time_Start": 1193.54, "Time_End": 1198.2, "Text": " McLuhan said that, too. The machine easily masters the grim and the dumb."}, {"Time_Start": 1198.9199999999998, "Time_End": 1203.04, "Text": " The masters of technology must be lighthearted and intelligent."}, {"Time_Start": 1204.06, "Time_End": 1206.3799999999999, "Text": " Okay, I'm going to pause to see if there any questions at this point."}, {"Time_Start": 1206.46, "Time_End": 1208.98, "Text": " Because somebody, in a crowd like this, must have thought of something."}, {"Time_Start": 1210.6599999999999, "Time_End": 1211.1399999999999, "Text": " Yes."}, {"Time_Start": 1211.7, "Time_End": 1213.44, "Text": " Did you give a similar speech at the Pentagon?"}, {"Time_Start": 1215.84, "Time_End": 1219.04, "Text": " The speech I gave at the Pentagon was very similar."}]}