{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 9.540000000000001,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thank you very much. Thanks for coming out. I want to talk a little bit about security"
    },
    {
      "Time_Start": 9.540000000000001,
      "Time_End": 15.8,
      "Text": " operations and basically a survey that I've written for the last seven years in terms"
    },
    {
      "Time_Start": 15.8,
      "Time_End": 20.84,
      "Text": " of studying of what people are doing for security operations. So just a little bit about me"
    },
    {
      "Time_Start": 20.84,
      "Time_End": 24.72,
      "Text": " and why you might be interested in hearing my opinions and thoughts on people running"
    },
    {
      "Time_Start": 24.72,
      "Time_End": 31.16,
      "Text": " cyber security operations. I work as a consultant and people typically call the style of consulting"
    },
    {
      "Time_Start": 31.16,
      "Time_End": 36.28,
      "Text": " that I do like an army of one. I basically have zero employees. I do all my own contracting."
    },
    {
      "Time_Start": 36.28,
      "Time_End": 41.36,
      "Text": " I do all my own engagements. I actually do my delivery. Yes, his eyes are popping like"
    },
    {
      "Time_Start": 41.36,
      "Time_End": 47.239999999999995,
      "Text": " why the hell would you do that to yourself? It is a little bit strange, but it works for"
    },
    {
      "Time_Start": 47.239999999999995,
      "Time_End": 53.120000000000005,
      "Text": " me. I've been working in security operations for a while. Basically, I wrote a class on"
    },
    {
      "Time_Start": 53.160000000000004,
      "Time_End": 58.160000000000004,
      "Text": " this. I've been writing the survey. I started working in computers when I was 15 years old"
    },
    {
      "Time_Start": 58.160000000000004,
      "Time_End": 64.36,
      "Text": " and that's in the 80s. So I was doing Unix systems administration, running tape in high"
    },
    {
      "Time_Start": 64.36,
      "Time_End": 69.64,
      "Text": " school, that kind of stuff. I've been teaching for the SANS Institute and I've been a certified"
    },
    {
      "Time_Start": 69.64,
      "Time_End": 75.76,
      "Text": " SANS instructor for more than 10 years. I've worked in US government quite a bit, defense"
    },
    {
      "Time_Start": 75.96000000000001,
      "Time_End": 84.84,
      "Text": " energy, non-defense, non-energy agencies. I've worked for a number of different organizations"
    },
    {
      "Time_Start": 84.84,
      "Time_End": 91.56,
      "Text": " across a number of different sectors. What I've tried to do over the last several years"
    },
    {
      "Time_Start": 91.56,
      "Time_End": 98.32000000000001,
      "Text": " is really get my knowledge and my understanding of the way that things work, my anecdotal"
    },
    {
      "Time_Start": 98.32000000000001,
      "Time_End": 102.92,
      "Text": " experience with the way that things work into a more generalized construct of how people"
    },
    {
      "Time_Start": 102.92,
      "Time_End": 108.92,
      "Text": " actually do cybersecurity operations. If you want to connect on LinkedIn or Twitter,"
    },
    {
      "Time_Start": 108.92,
      "Time_End": 113.04,
      "Text": " I'm never on either of those, but if you send me a message there, I'll answer it in a couple"
    },
    {
      "Time_Start": 113.04,
      "Time_End": 121.16,
      "Text": " of weeks. I have sort of this problem with running a SOC survey because all of the surveys"
    },
    {
      "Time_Start": 121.16,
      "Time_End": 128.6,
      "Text": " that we see all the time, it's just somebody's opinion to a question that they're not really"
    },
    {
      "Time_Start": 128.76,
      "Time_End": 136.84,
      "Text": " data to us. So with that in mind, if I say data, please refactor that in your brain. It's not data."
    },
    {
      "Time_Start": 136.84,
      "Time_End": 143.16,
      "Text": " I've not been like measuring things. This is not mass. I'm not going into other people's"
    },
    {
      "Time_Start": 143.16,
      "Time_End": 147.4,
      "Text": " SOCs and actually looking at the detections that they've engineered in order to be able"
    },
    {
      "Time_Start": 147.4,
      "Time_End": 156.28,
      "Text": " to comprehend it. That being said, this is probably the most open source of insight into"
    },
    {
      "Time_Start": 156.28,
      "Time_End": 161.64000000000001,
      "Text": " other people's cybersecurity operations that you will find. And I've worked really hard"
    },
    {
      "Time_Start": 161.64000000000001,
      "Time_End": 168.04,
      "Text": " to try to collect information in a way, collect responses in a way that I can then share that"
    },
    {
      "Time_Start": 168.04,
      "Time_End": 173.08,
      "Text": " with people in order to do something useful with it. Because in my experience, a lot of"
    },
    {
      "Time_Start": 173.08,
      "Time_End": 177.24,
      "Text": " people will say, okay, well, we're running our SOC this way. What is that company doing?"
    },
    {
      "Time_Start": 177.24,
      "Time_End": 182.04,
      "Text": " What is that organization doing? How can I do it like them? And people are constantly"
    },
    {
      "Time_Start": 182.67999999999998,
      "Time_End": 187.16,
      "Text": " holding their cards really close to themselves and then trying to peek at other people's hands"
    },
    {
      "Time_Start": 187.16,
      "Time_End": 193.23999999999998,
      "Text": " to see what they're doing. And so I'm trying to facilitate that in a way that provides some"
    },
    {
      "Time_Start": 193.23999999999998,
      "Time_End": 199.32,
      "Text": " sort of a third party that's somewhat trusted. So if you do work in a SOC, if you do work as"
    },
    {
      "Time_Start": 199.32,
      "Time_End": 205.48,
      "Text": " an analyst, if you have engineered or architected a SOC, I would appreciate it if either this year"
    },
    {
      "Time_Start": 205.48,
      "Time_End": 211.39999999999998,
      "Text": " or next year you actually respond to the survey. Also, there's a release event that's coming up"
    },
    {
      "Time_Start": 211.4,
      "Time_End": 219.08,
      "Text": " for the 24 survey that you can get to. I'm talking about the data from the previous one"
    },
    {
      "Time_Start": 219.08,
      "Time_End": 225.16,
      "Text": " and the response period is open currently for the current one, which will be released in,"
    },
    {
      "Time_Start": 225.16,
      "Time_End": 231.56,
      "Text": " I don't know, it's like July or August or something like that. Okay. This website,"
    },
    {
      "Time_Start": 231.56,
      "Time_End": 238.84,
      "Text": " soc-survey.com also has links to the last seven years of reports. And since 2020, I've released"
    },
    {
      "Time_Start": 238.84,
      "Time_End": 244.44,
      "Text": " the data, de-identified of course, which is something that I think is pretty important,"
    },
    {
      "Time_Start": 245.4,
      "Time_End": 250.52,
      "Text": " so that people can look at how I'm doing the analysis and point out and say, no, no, no,"
    },
    {
      "Time_Start": 250.52,
      "Time_End": 255.48000000000002,
      "Text": " you did that wrong. Like that's completely wrong. And I'll get into some of that in a little bit."
    },
    {
      "Time_Start": 255.48000000000002,
      "Time_End": 261.56,
      "Text": " So let me talk about some of the highlights of the 23 survey in order to just explain what I'm"
    },
    {
      "Time_Start": 261.56,
      "Time_End": 265.32,
      "Text": " seeing. Some of this stuff, you're going to see a chart and it's just like, okay, this is what"
    },
    {
      "Time_Start": 265.32,
      "Time_End": 270.68,
      "Text": " the answers are. And then some of what I say is actually going to be Chris's opinion on why that"
    },
    {
      "Time_Start": 270.68,
      "Time_End": 276.84,
      "Text": " comes out that way and what people are actually doing. So an interesting thing about the survey"
    },
    {
      "Time_Start": 276.84,
      "Time_End": 285.4,
      "Text": " is that roughly 640 people took it and the average time, and the survey is done in Qualtrics,"
    },
    {
      "Time_Start": 285.4,
      "Time_End": 292.28,
      "Text": " the average time to take the survey was 59 minutes. Excuse me, the mean time was 59 minutes."
    },
    {
      "Time_Start": 293.24,
      "Time_End": 299.40000000000003,
      "Text": " 59 minutes where somebody sat there and took a survey. They didn't get paid for it and they spent"
    },
    {
      "Time_Start": 299.40000000000003,
      "Time_End": 304.28000000000003,
      "Text": " an hour doing it. Now this is an interesting thing in and of itself. The people who are"
    },
    {
      "Time_Start": 304.28000000000003,
      "Time_End": 310.44000000000005,
      "Text": " answering this are actually investing a lot of time in it. And just in talking to people about"
    },
    {
      "Time_Start": 310.44000000000005,
      "Time_End": 316.68,
      "Text": " this, something that people have told me, just taking the survey challenges them to think about"
    },
    {
      "Time_Start": 317.0,
      "Time_End": 323.16,
      "Text": " how they're doing their operations. And the other thing is, this suggests to me that it's"
    },
    {
      "Time_Start": 324.28000000000003,
      "Time_End": 328.6,
      "Text": " quality responses. I mean, this is not a five-minute thing that people are just like,"
    },
    {
      "Time_Start": 330.2,
      "Time_End": 335.0,
      "Text": " where's my $50 gift card at the end of it? Because there is no gift card at the end of it,"
    },
    {
      "Time_Start": 335.0,
      "Time_End": 340.6,
      "Text": " right? So this is another reason why this is actually something that's useful. I think that"
    },
    {
      "Time_Start": 340.6,
      "Time_End": 345.56,
      "Text": " you could take this and then people have told me they take it and get budget based on, hey,"
    },
    {
      "Time_Start": 345.56,
      "Time_End": 352.28000000000003,
      "Text": " this is what they're saying is useful in our environment. Another thing that's quite useful"
    },
    {
      "Time_Start": 352.84,
      "Time_End": 359.88,
      "Text": " is a technology comparison. And I'll get to some technology explanations later where your peers"
    },
    {
      "Time_Start": 359.88,
      "Time_End": 366.68,
      "Text": " have graded in the survey what technologies work for them, what technologies don't work for them,"
    },
    {
      "Time_Start": 366.68,
      "Time_End": 372.28,
      "Text": " what technologies they're able to get into production fully, partially, or not at all."
    },
    {
      "Time_Start": 372.28000000000003,
      "Time_End": 377.00000000000006,
      "Text": " So if you go look at this and you're like, hey, I want to buy this great new deception capability,"
    },
    {
      "Time_Start": 377.96000000000004,
      "Time_End": 385.64000000000004,
      "Text": " generally around deception, your peers don't like it and they can't get it fully into production."
    },
    {
      "Time_Start": 385.64000000000004,
      "Time_End": 389.96000000000004,
      "Text": " So if you still want it, you might be thinking, okay, how do I constrain my deployment so that"
    },
    {
      "Time_Start": 389.96000000000004,
      "Time_End": 395.72,
      "Text": " I'm only tactically deploying it into some specific place to make sure that it does exactly what I"
    },
    {
      "Time_Start": 395.72,
      "Time_End": 400.76000000000005,
      "Text": " want rather than thinking about doing deception generally across my entire enterprise? Okay,"
    },
    {
      "Time_Start": 400.76,
      "Time_End": 403.96,
      "Text": " so that might be a useful thing that you can do with some of this information."
    },
    {
      "Time_Start": 405.0,
      "Time_End": 409.96,
      "Text": " The other part of this is that this is primarily North American companies and primarily small"
    },
    {
      "Time_Start": 409.96,
      "Time_End": 415.88,
      "Text": " companies. I mean, there were some large companies, like if you look at this graphic here,"
    },
    {
      "Time_Start": 415.88,
      "Time_End": 424.92,
      "Text": " each of these buildings accounts for basically 25 respondents. So it's something where roughly 80"
    },
    {
      "Time_Start": 424.92,
      "Time_End": 433.08000000000004,
      "Text": " organizations were larger than 50,000 employees who responded to this. Different roles."
    },
    {
      "Time_Start": 433.72,
      "Time_End": 438.6,
      "Text": " In the last couple of years, we've actually experimented with doing the survey in different"
    },
    {
      "Time_Start": 438.6,
      "Time_End": 445.56,
      "Text": " languages. And just as an example, when we did it in Spanish and Portuguese, the respondents actually"
    },
    {
      "Time_Start": 445.56,
      "Time_End": 452.84000000000003,
      "Text": " shifted to South America instead of Europe as the second group for headquarters. I basically just"
    },
    {
      "Time_Start": 452.84000000000003,
      "Time_End": 458.68,
      "Text": " haven't been able to keep the funding going to get that into different languages. I've tried to"
    },
    {
      "Time_Start": 459.40000000000003,
      "Time_End": 463.88000000000005,
      "Text": " compel them to do Arabic as just an example. I don't know if you all are aware of this,"
    },
    {
      "Time_Start": 463.88000000000005,
      "Time_End": 471.08000000000004,
      "Text": " but the Middle East is going through a tremendous growth spurt and cyber is part of that. So just"
    },
    {
      "Time_Start": 471.08000000000004,
      "Time_End": 478.36,
      "Text": " something to think about. If you're in sort of this area, it's not just North America. There are"
    },
    {
      "Time_Start": 478.36,
      "Time_End": 483.0,
      "Text": " a lot of people in different places trying to do cybersecurity operations. And in my experience,"
    },
    {
      "Time_Start": 483.0,
      "Time_End": 488.04,
      "Text": " they tend to do it somewhat differently depending upon the way that their organizations are"
    },
    {
      "Time_Start": 488.04,
      "Time_End": 495.88,
      "Text": " structured. In terms of running a SOC, I asked the question, what do you do? What are your"
    },
    {
      "Time_Start": 495.88,
      "Time_End": 502.76,
      "Text": " capabilities? How do you consider whether it is a SOC or not? And so the top things were alerting"
    },
    {
      "Time_Start": 502.76,
      "Time_End": 509.8,
      "Text": " and triage. I mean, that seems self-evident, but in fact, that's what the responses sort of confirmed."
    },
    {
      "Time_Start": 510.59999999999997,
      "Time_End": 517.4,
      "Text": " The incident response capability was part of the SOC capability. Some organizations will split"
    },
    {
      "Time_Start": 517.4,
      "Time_End": 522.04,
      "Text": " that out and say, no, no, our incident responders are over there. This is our monitoring capability."
    },
    {
      "Time_Start": 522.76,
      "Time_End": 527.3199999999999,
      "Text": " Compliance and data protection sort of round out the list of the different things that are there."
    },
    {
      "Time_Start": 528.2800000000001,
      "Time_End": 535.0,
      "Text": " I'll talk about outsourcing in a moment, but actually this particular representation is"
    },
    {
      "Time_Start": 535.0,
      "Time_End": 541.32,
      "Text": " intended to depict in addition to what do you do, how do you do it? What sort of things were"
    },
    {
      "Time_Start": 541.32,
      "Time_End": 547.6400000000001,
      "Text": " outsourced as opposed to done internally and what things are you actually doing"
    },
    {
      "Time_Start": 547.6400000000001,
      "Time_End": 552.6800000000001,
      "Text": " both internally and outsourced? And I'll come back to some of those aspects of the outsourcing."
    },
    {
      "Time_Start": 553.5600000000001,
      "Time_End": 559.4000000000001,
      "Text": " For the people who responded to the survey, they said that most of their incidents, they're"
    },
    {
      "Time_Start": 559.4000000000001,
      "Time_End": 566.2,
      "Text": " actually able to detect prior to having a third-party notification. And this is an interesting"
    },
    {
      "Time_Start": 566.2,
      "Time_End": 572.36,
      "Text": " one because when you look at Verizon Data Breach Investigation Report, a lot of what they're"
    },
    {
      "Time_Start": 572.36,
      "Time_End": 579.0000000000001,
      "Text": " saying is that the breaches tend to be known when you have third-party detection and then you're"
    },
    {
      "Time_Start": 579.0,
      "Time_End": 584.44,
      "Text": " being told about that. So the information represented in the respondents to the survey,"
    },
    {
      "Time_Start": 585.08,
      "Time_End": 590.84,
      "Text": " most of what they're seeing, they're detecting internally. I can't necessarily say that that is"
    },
    {
      "Time_Start": 590.84,
      "Time_End": 595.4,
      "Text": " something that's due to their own maturity or that the people who are self-selecting into the"
    },
    {
      "Time_Start": 595.4,
      "Time_End": 601.24,
      "Text": " responses are actually doing this, but this is something that is different than what I've seen"
    },
    {
      "Time_Start": 601.24,
      "Time_End": 611.4,
      "Text": " in a bunch of the other industry reports that are out there. Metrics, it's interesting to me"
    },
    {
      "Time_Start": 611.4,
      "Time_End": 618.2,
      "Text": " every year when I see this, 84% say that they collect and expose metrics. And every time I see"
    },
    {
      "Time_Start": 618.2,
      "Time_End": 624.92,
      "Text": " that answer, I think, what are these other 16% of the people doing? Literally, how does your"
    },
    {
      "Time_Start": 624.92,
      "Time_End": 631.88,
      "Text": " organization continue to give you money to run a SOC if you're not reporting anything? I mean,"
    },
    {
      "Time_Start": 631.88,
      "Time_End": 638.36,
      "Text": " that seems crazy to me. 11% of them said, no, we don't provide metrics. The other roughly 5%"
    },
    {
      "Time_Start": 639.3199999999999,
      "Time_End": 644.1999999999999,
      "Text": " say that they don't know. So the respondents said that they weren't sure if they were reporting"
    },
    {
      "Time_Start": 644.1999999999999,
      "Time_End": 649.0799999999999,
      "Text": " metrics or not. Of the metrics that are reported, and there's lots of questions around these"
    },
    {
      "Time_Start": 649.08,
      "Time_End": 658.9200000000001,
      "Text": " different ones, the top three, top one, quantity of incidents, which I think is a meaningless metric,"
    },
    {
      "Time_Start": 658.9200000000001,
      "Time_End": 664.9200000000001,
      "Text": " to be perfectly honest with you. How many did you have? We had 36 last month. Is that the right"
    },
    {
      "Time_Start": 664.9200000000001,
      "Time_End": 673.48,
      "Text": " number? Is that a good number? Is that going up? Is that going down? The metric itself is something"
    },
    {
      "Time_Start": 673.48,
      "Time_End": 680.44,
      "Text": " that is not meaningful, and you're measuring something that is out of your control in terms of"
    },
    {
      "Time_Start": 680.44,
      "Time_End": 686.04,
      "Text": " your detective capability. So this is one, though, that a lot of people report that they do."
    },
    {
      "Time_Start": 686.84,
      "Time_End": 693.08,
      "Text": " Time to detect, time from detection to eradication is another one that is frequently"
    },
    {
      "Time_Start": 693.08,
      "Time_End": 699.8000000000001,
      "Text": " reported. I think that this is actually at least something that you can control for that."
    },
    {
      "Time_Start": 699.8000000000001,
      "Time_End": 704.9200000000001,
      "Text": " And then the ratio of incidents from known and unknown vulnerabilities, also an interesting thing"
    },
    {
      "Time_Start": 704.9200000000001,
      "Time_End": 710.2,
      "Text": " that starts to get into posture management capability, vulnerability management, your ability"
    },
    {
      "Time_Start": 710.2,
      "Time_End": 717.5600000000001,
      "Text": " to actually detect things that are in your environment and then trace that through a root"
    },
    {
      "Time_Start": 717.5600000000001,
      "Time_End": 722.6,
      "Text": " cause to be able to identify, yeah, this was a problem that we knew about and it hurt us."
    },
    {
      "Time_Start": 723.08,
      "Time_End": 730.2,
      "Text": " So this is something that is quite useful for SOCs to do, and a lot of organizations"
    },
    {
      "Time_Start": 730.2,
      "Time_End": 736.28,
      "Text": " don't do it well. And the top metric being the one that's just like a simple count is an indication"
    },
    {
      "Time_Start": 736.28,
      "Time_End": 741.48,
      "Text": " of that, in my opinion. The other thing that I asked about was the idea of orchestration automation."
    },
    {
      "Time_Start": 742.0400000000001,
      "Time_End": 748.36,
      "Text": " This has become a bit of a buzzword over the last five years. Orchestration automation really is"
    },
    {
      "Time_Start": 748.36,
      "Time_End": 753.96,
      "Text": " scripting the tools in order to do the things that work within a workflow that you have decided"
    },
    {
      "Time_Start": 753.96,
      "Time_End": 760.28,
      "Text": " is the right way that your organization will run your security operations. So in addition to the"
    },
    {
      "Time_Start": 760.28,
      "Time_End": 767.08,
      "Text": " question of are you doing this, there was a question about how do you approach the tuning"
    },
    {
      "Time_Start": 767.08,
      "Time_End": 771.8000000000001,
      "Text": " needs of the SOAR, which I think is a little bit more insightful rather than are you using it, do"
    },
    {
      "Time_Start": 771.8000000000001,
      "Time_End": 776.6800000000001,
      "Text": " you have this technology, do you like the technology, it's how do you tune it. And what was interesting"
    },
    {
      "Time_Start": 776.6800000000001,
      "Time_End": 783.48,
      "Text": " to me is the top response is that yes, we do actually frequently change our workflows, and"
    },
    {
      "Time_Start": 783.48,
      "Time_End": 787.8000000000001,
      "Text": " I'll zoom in on this so maybe you can read it if you want to see it. So we frequently change the"
    },
    {
      "Time_Start": 787.8000000000001,
      "Time_End": 796.7600000000001,
      "Text": " SOAR workflows. We have dedicated staff is actually a lower answer than we frequently change the"
    },
    {
      "Time_Start": 796.7600000000001,
      "Time_End": 803.1600000000001,
      "Text": " workflows and the analysts or users of the SOAR are authorized and empowered to make the change"
    },
    {
      "Time_Start": 803.16,
      "Time_End": 811.9599999999999,
      "Text": " directly. Now optimally, I think that there would actually be some sort of a workflow verification"
    },
    {
      "Time_Start": 811.9599999999999,
      "Time_End": 819.0799999999999,
      "Text": " prior to an analyst who's in the midst of doing something being authorized to change the workflow."
    },
    {
      "Time_Start": 820.4399999999999,
      "Time_End": 827.3199999999999,
      "Text": " That being said, the fact that they say that they frequently change it and adjust it anyway, I think"
    },
    {
      "Time_Start": 827.32,
      "Time_End": 833.72,
      "Text": " is actually a really positive thing. SOAR is effectively just APIs to be able to pull data"
    },
    {
      "Time_Start": 833.72,
      "Time_End": 839.0,
      "Text": " from different places and scripting to do the things that you need to do. So if your analysts"
    },
    {
      "Time_Start": 839.0,
      "Time_End": 846.44,
      "Text": " are empowered to do the adjustment on the fly, you're going to have low maturity, but you are"
    },
    {
      "Time_Start": 846.44,
      "Time_End": 852.44,
      "Text": " going to be flexible and adaptable. So this is something that I have seen organizations do"
    },
    {
      "Time_Start": 852.44,
      "Time_End": 857.96,
      "Text": " moderately well, and I'm happy that people are embracing this. The other thing I will say"
    },
    {
      "Time_Start": 857.96,
      "Time_End": 864.84,
      "Text": " about SOAR, again just my opinion on the deployment of this, is while I actually really"
    },
    {
      "Time_Start": 865.48,
      "Time_End": 869.8000000000001,
      "Text": " prefer the idea of do-it-yourself, write the scripts, do all these things, I think from an"
    },
    {
      "Time_Start": 869.8000000000001,
      "Time_End": 877.08,
      "Text": " organizational perspective, that is a path of pain in order to decide no, no, no, we're just going to"
    },
    {
      "Time_Start": 877.08,
      "Time_End": 883.24,
      "Text": " do all that in Python ourselves. And I think that from an institutional enterprise perspective,"
    },
    {
      "Time_Start": 884.44,
      "Time_End": 890.36,
      "Text": " deciding on the best SOAR that matches your requirements and then doing small amounts of"
    },
    {
      "Time_Start": 890.36,
      "Time_End": 895.5600000000001,
      "Text": " customization is actually the more efficient path. And from somebody who is a control freak,"
    },
    {
      "Time_Start": 895.5600000000001,
      "Time_End": 901.8000000000001,
      "Text": " I want to write the code myself, I want to verify that it's been something that we vetted and did,"
    },
    {
      "Time_Start": 901.8000000000001,
      "Time_End": 907.8000000000001,
      "Text": " I still think from an institutional perspective, the better way is to put it into a tool"
    },
    {
      "Time_Start": 908.5200000000001,
      "Time_End": 913.48,
      "Text": " that allows you to do that customization and flexibility when you really need it,"
    },
    {
      "Time_Start": 913.48,
      "Time_End": 919.8800000000001,
      "Text": " but that you don't have to always worry about having a scripting or a programmer on staff"
    },
    {
      "Time_Start": 919.8800000000001,
      "Time_End": 927.32,
      "Text": " who's competent to be able to make those changes. Another thing that I asked about was the"
    },
    {
      "Time_Start": 927.32,
      "Time_End": 933.48,
      "Text": " idea of how do you deal with data? If you're going to do detections, you need to be able to"
    },
    {
      "Time_Start": 933.48,
      "Time_End": 941.96,
      "Text": " pull data into some sort of a correlation engine, typically a SIEM. And so what I've found is that"
    },
    {
      "Time_Start": 941.96,
      "Time_End": 947.96,
      "Text": " a lot of people just push everything into the SIEM and don't really apply much selection,"
    },
    {
      "Time_Start": 947.96,
      "Time_End": 953.24,
      "Text": " and this plays out in the survey responses. Everything goes into the SIEM was the top,"
    },
    {
      "Time_Start": 953.8,
      "Time_End": 959.5600000000001,
      "Text": " and then there's sort of a risk-based criteria is the next one. And I mean, think about it,"
    },
    {
      "Time_Start": 959.5600000000001,
      "Time_End": 965.24,
      "Text": " when you are deciding, do you need that data in your SIEM? The easy answer is yes,"
    },
    {
      "Time_Start": 965.96,
      "Time_End": 970.52,
      "Text": " right? I'm just going to push it in there in case that we need it. And this is, you know,"
    },
    {
      "Time_Start": 970.52,
      "Time_End": 976.36,
      "Text": " if you're sort of a maximalist, you know, packer or camper or whatever you want to say in terms of"
    },
    {
      "Time_Start": 976.36,
      "Time_End": 981.72,
      "Text": " how you personally approach things, are you always thinking about being completely minimal"
    },
    {
      "Time_Start": 981.8000000000001,
      "Time_End": 987.72,
      "Text": " in terms of what information you have on hand? And if you're not sure, the easier selection is"
    },
    {
      "Time_Start": 987.72,
      "Time_End": 993.0,
      "Text": " to just throw it all in there. Now, this is something that some people are saying, and"
    },
    {
      "Time_Start": 993.0,
      "Time_End": 996.9200000000001,
      "Text": " actually almost the same number of people are saying, yeah, we'd actually do some selection"
    },
    {
      "Time_Start": 996.9200000000001,
      "Time_End": 1002.6,
      "Text": " criteria in terms of which data we're going to collect. Now, this would be better from an"
    },
    {
      "Time_Start": 1002.6,
      "Time_End": 1008.36,
      "Text": " efficiency perspective if you know what detections you're going to engineer. And if you actually are"
    },
    {
      "Time_Start": 1008.36,
      "Time_End": 1014.6,
      "Text": " doing that well, I think that that's a good approach to it. I would also suggest that with"
    },
    {
      "Time_Start": 1014.6,
      "Time_End": 1019.88,
      "Text": " the advent of the cloud, with Sentinel and Chronicle, that I think what's going to happen"
    },
    {
      "Time_Start": 1019.88,
      "Time_End": 1024.76,
      "Text": " is a lot more people are going to just start throwing all the data in there because it's easy"
    },
    {
      "Time_Start": 1024.76,
      "Time_End": 1031.64,
      "Text": " to do. And then when they are basically spending a lot of money in order to store data that they"
    },
    {
      "Time_Start": 1031.64,
      "Time_End": 1038.04,
      "Text": " never use, eventually it will drive efficiency to be able to say, no, this is the detection that I"
    },
    {
      "Time_Start": 1038.04,
      "Time_End": 1042.76,
      "Text": " need. This is the data source that I actually need for it. And let me go ahead and decide which"
    },
    {
      "Time_Start": 1042.76,
      "Time_End": 1048.68,
      "Text": " data will be pushed out. For now, I don't think people have figured this out. And this probably"
    },
    {
      "Time_Start": 1048.68,
      "Time_End": 1053.96,
      "Text": " resonates with you. It's easier to just push it into the SIEM, pay a little bit of extra money,"
    },
    {
      "Time_Start": 1053.96,
      "Time_End": 1059.24,
      "Text": " not have to worry about selecting on the front side so that you can do queries afterwards."
    },
    {
      "Time_Start": 1060.44,
      "Time_End": 1065.6399999999999,
      "Text": " From a budgeting perspective, there are a number of things that are out there in terms of"
    },
    {
      "Time_Start": 1066.1200000000001,
      "Time_End": 1073.0800000000002,
      "Text": " how people approach budgeting. Most people have a difficult time when they're working in the SOC"
    },
    {
      "Time_Start": 1073.0800000000002,
      "Time_End": 1081.4,
      "Text": " to understand how that works within their organization. And so the largest answer was"
    },
    {
      "Time_Start": 1081.4,
      "Time_End": 1086.68,
      "Text": " basically that the management takes a bunch of recommendations from the leads but ultimately"
    },
    {
      "Time_Start": 1086.68,
      "Time_End": 1092.2800000000002,
      "Text": " decides how they're going to allocate funding. This is the reality that all of us face. I haven't"
    },
    {
      "Time_Start": 1092.28,
      "Time_End": 1096.6,
      "Text": " found anybody that says, yeah, we have a limitless budget. The only people that come close to the"
    },
    {
      "Time_Start": 1096.6,
      "Time_End": 1101.96,
      "Text": " limitless budget are the ones that are basically immediately after a large-scale breach for the"
    },
    {
      "Time_Start": 1101.96,
      "Time_End": 1106.76,
      "Text": " first two years. And I'm not making this up. This is the conversations that I've had with people"
    },
    {
      "Time_Start": 1106.76,
      "Time_End": 1111.96,
      "Text": " consistently. For about the first two years after a large-scale breach, pretty much you can have all"
    },
    {
      "Time_Start": 1111.96,
      "Time_End": 1118.28,
      "Text": " the money that you want. And then after that, things start to get reined in. And the reason"
    },
    {
      "Time_Start": 1118.36,
      "Time_End": 1126.44,
      "Text": " for that that I've observed is that your management does not understand how the organization"
    },
    {
      "Time_Start": 1127.8799999999999,
      "Time_End": 1135.24,
      "Text": " effectively deploys its funding. They go and ask for stuff. And then the funding comes or it doesn't"
    },
    {
      "Time_Start": 1135.24,
      "Time_End": 1142.52,
      "Text": " come. Making a compelling argument on a consistent basis in order to show this is the technology that"
    },
    {
      "Time_Start": 1142.52,
      "Time_End": 1146.6,
      "Text": " we need to acquire, this is the staffing that we need to acquire, this is the way that this is going"
    },
    {
      "Time_Start": 1146.6000000000001,
      "Time_End": 1152.92,
      "Text": " to be effective at defending and providing loss prevention. Over time is how you actually"
    },
    {
      "Time_Start": 1152.92,
      "Time_End": 1163.0800000000002,
      "Text": " successfully win budget. But the SOC is providing an offer of loss prevention. And I think that"
    },
    {
      "Time_Start": 1163.64,
      "Time_End": 1167.72,
      "Text": " these words are things that you should think about how to use them in your environment."
    },
    {
      "Time_Start": 1167.72,
      "Time_End": 1173.4,
      "Text": " You're not even guaranteeing loss prevention. You're providing an offer of loss prevention."
    },
    {
      "Time_Start": 1173.4,
      "Time_End": 1177.96,
      "Text": " And your organization is making a decision. Is it worth it for me to spend all this money"
    },
    {
      "Time_Start": 1177.96,
      "Time_End": 1185.64,
      "Text": " on something that might solve some problems? Or is it better for us to just keep going and"
    },
    {
      "Time_Start": 1185.64,
      "Time_End": 1191.96,
      "Text": " dumping money into business investment and let all of those other things just kind of fall out"
    },
    {
      "Time_Start": 1191.96,
      "Time_End": 1199.48,
      "Text": " how they will? And fail a little bit, but fail as gracefully as possible. And it's not until"
    },
    {
      "Time_Start": 1199.48,
      "Time_End": 1205.0,
      "Text": " there's some big failures that you're, not your cyber management, but your executive management"
    },
    {
      "Time_Start": 1205.0,
      "Time_End": 1209.4,
      "Text": " say, yeah, yeah, yeah, we need to deal with that. The best thing that could happen to you"
    },
    {
      "Time_Start": 1210.04,
      "Time_End": 1216.3600000000001,
      "Text": " in terms of budgeting is to have an organization, much like the organization that you work in,"
    },
    {
      "Time_Start": 1216.3600000000001,
      "Time_End": 1221.08,
      "Text": " have a big breach. So you don't have to deal with the real pain of it and then take that headline"
    },
    {
      "Time_Start": 1221.08,
      "Time_End": 1225.88,
      "Text": " to your management and say, this is what's going on in this industry. This is how they're targeting"
    },
    {
      "Time_Start": 1225.88,
      "Time_End": 1232.8400000000001,
      "Text": " these people. That's basically us. And we'll be the next headline if you do not address some"
    },
    {
      "Time_Start": 1232.8400000000001,
      "Time_End": 1237.72,
      "Text": " of these fundamental problems. And I think that this is the key to winning budget."
    },
    {
      "Time_Start": 1238.7600000000002,
      "Time_End": 1247.16,
      "Text": " Okay. And I mean, I hesitate to ask organizations to spend money when they don't need to."
    },
    {
      "Time_Start": 1247.16,
      "Time_End": 1251.0800000000002,
      "Text": " And I think that that's something that we should really think about. We could fix everything"
    },
    {
      "Time_Start": 1251.8799999999999,
      "Time_End": 1256.84,
      "Text": " if we had limitless money. We simply don't have limitless money. And so it's the right sort of"
    },
    {
      "Time_Start": 1256.84,
      "Time_End": 1263.24,
      "Text": " prioritization for our budget. And this is in light of what the organization needs to do"
    },
    {
      "Time_Start": 1263.24,
      "Time_End": 1268.36,
      "Text": " in order to survive. Because we don't have enough staff, because we don't have enough"
    },
    {
      "Time_Start": 1269.56,
      "Time_End": 1276.28,
      "Text": " internal capacity, knowledge, capability, we tend to look for third parties to help us"
    },
    {
      "Time_Start": 1277.24,
      "Time_End": 1282.2,
      "Text": " in order to outsource some of the things that we need to do. Going back to that list of capability"
    },
    {
      "Time_Start": 1282.2,
      "Time_End": 1289.8799999999999,
      "Text": " that I showed earlier, this chart is a little bit confusing. So let me explain it. The way that this"
    },
    {
      "Time_Start": 1289.8799999999999,
      "Time_End": 1298.92,
      "Text": " chart is actually depicted is not a count, but a rank in order. So the rank that shows red is"
    },
    {
      "Time_Start": 1299.0,
      "Time_End": 1307.16,
      "Text": " actually the order of the sort from top to bottom. And this is the highest to least outsourced"
    },
    {
      "Time_Start": 1308.04,
      "Time_End": 1314.44,
      "Text": " activities and capabilities within the organization. The blue rank is whether it's"
    },
    {
      "Time_Start": 1314.44,
      "Time_End": 1322.44,
      "Text": " done at all. So let me just sort of move this in here. So if you look at the order of the red,"
    },
    {
      "Time_Start": 1322.44,
      "Time_End": 1329.4,
      "Text": " basically this is the most outsourced to the least outsourced. And the blue is the most likely"
    },
    {
      "Time_Start": 1329.4,
      "Time_End": 1336.76,
      "Text": " to be done to the least likely to be done. And at the top, where the red ranks are the things that"
    },
    {
      "Time_Start": 1336.76,
      "Time_End": 1343.24,
      "Text": " are most likely to be outsourced, there's a lot of least likely to be done type items on that list."
    },
    {
      "Time_Start": 1344.1200000000001,
      "Time_End": 1354.1200000000001,
      "Text": " Pen testing, red teaming, purple teaming, the top three activities. Basically, we're very likely to"
    },
    {
      "Time_Start": 1354.1200000000001,
      "Time_End": 1365.16,
      "Text": " outsource them in SOCs, and we're very likely not to do it at all. So this becomes a circumstance of"
    },
    {
      "Time_Start": 1365.96,
      "Time_End": 1372.36,
      "Text": " is the SOC actually verifying that those detections and defenses that they're deploying"
    },
    {
      "Time_Start": 1373.56,
      "Time_End": 1380.44,
      "Text": " work at all? And if you're not testing it on an ongoing basis, if you're not testing it while"
    },
    {
      "Time_Start": 1380.44,
      "Time_End": 1385.96,
      "Text": " you're doing the detection engineering, how do you know that it works? And I'm going to tell you,"
    },
    {
      "Time_Start": 1385.96,
      "Time_End": 1396.36,
      "Text": " in my opinion, most SOCs don't know that it works. They don't. And it's only when either"
    },
    {
      "Time_Start": 1396.36,
      "Time_End": 1400.84,
      "Text": " somebody internal decides, hey, we should really do this purple teaming thing and make this"
    },
    {
      "Time_Start": 1400.84,
      "Time_End": 1407.8,
      "Text": " effective, that that traction becomes something where there's a drive for change."
    },
    {
      "Time_Start": 1408.9199999999998,
      "Time_End": 1414.84,
      "Text": " The other thing that's very commonly outsourced, forensics and any sort of variation on forensics"
    },
    {
      "Time_Start": 1414.84,
      "Time_End": 1420.04,
      "Text": " and threat intelligence. And these are things that I think organizations currently are trying"
    },
    {
      "Time_Start": 1420.04,
      "Time_End": 1425.56,
      "Text": " to understand how to incorporate that into their pipeline within their security operations,"
    },
    {
      "Time_Start": 1425.56,
      "Time_End": 1430.1999999999998,
      "Text": " and they're struggling. They're struggling to be able to understand how to tactically deploy that."
    },
    {
      "Time_Start": 1431.32,
      "Time_End": 1439.9599999999998,
      "Text": " So this is what the chart looks like, but it's something that's a struggle for everybody in"
    },
    {
      "Time_Start": 1439.9599999999998,
      "Time_End": 1445.08,
      "Text": " terms of how to decide what resources to outsource. But what they're doing is usually"
    },
    {
      "Time_Start": 1445.08,
      "Time_End": 1447.3999999999999,
      "Text": " outsourcing, pen testing, forensics, and threat intel."
    },
    {
      "Time_Start": 1449.72,
      "Time_End": 1454.76,
      "Text": " In terms of the size of the SOC, there tends to be about 10 to 25 people."
    },
    {
      "Time_Start": 1455.4,
      "Time_End": 1464.44,
      "Text": " This is blue, indicating the most common size of analysts, whereas red is more of the"
    },
    {
      "Time_Start": 1464.44,
      "Time_End": 1471.0,
      "Text": " administrative staff. And that, the answer was two to 10 people. So you have a few people,"
    },
    {
      "Time_Start": 1471.56,
      "Time_End": 1479.32,
      "Text": " three, five people kind of keeping the lights on, and then maybe 10, 15 analysts working"
    },
    {
      "Time_Start": 1480.28,
      "Time_End": 1485.72,
      "Text": " in order to be able to do that. I have done a bunch of different pivots on this,"
    },
    {
      "Time_Start": 1485.72,
      "Time_End": 1491.3999999999999,
      "Text": " I'm not going to go into it now. But what I have seen is that even really large organizations"
    },
    {
      "Time_Start": 1492.04,
      "Time_End": 1498.52,
      "Text": " tend to hover around that 15 to 20 staff. And again, in my experience, and looking at this"
    },
    {
      "Time_Start": 1498.52,
      "Time_End": 1505.08,
      "Text": " and talking to organizations, larger organizations, what they do is they have 15 staff members"
    },
    {
      "Time_Start": 1505.08,
      "Time_End": 1510.1999999999998,
      "Text": " internally, and then those staff members are essentially managing contractors or interfacing"
    },
    {
      "Time_Start": 1510.1999999999998,
      "Time_End": 1515.0,
      "Text": " with third parties that they transfer a lot of the operational work, whether you want to call it"
    },
    {
      "Time_Start": 1515.0,
      "Time_End": 1523.24,
      "Text": " level one, initial triage, XDR, I'm sorry, MDR for your endpoint detection response or extended"
    },
    {
      "Time_Start": 1523.24,
      "Time_End": 1528.04,
      "Text": " detection response. This is something that larger organizations tend to leverage outsourcing pretty"
    },
    {
      "Time_Start": 1528.04,
      "Time_End": 1536.44,
      "Text": " substantially. From staffing, what the staff looks like in the SOC, I asked a bit about the"
    },
    {
      "Time_Start": 1536.44,
      "Time_End": 1543.72,
      "Text": " hiring, like what do managers care about hiring for? And so the items that were typically"
    },
    {
      "Time_Start": 1544.28,
      "Time_End": 1550.68,
      "Text": " identified in information security as a general concept, the idea of threat analysis, data"
    },
    {
      "Time_Start": 1550.68,
      "Time_End": 1556.92,
      "Text": " analysis, and intelligence analysis were the top skills that hiring managers were looking for."
    },
    {
      "Time_Start": 1558.12,
      "Time_End": 1565.3999999999999,
      "Text": " Asked about how long do employees stick around? The one to three years in the SOC was the most"
    },
    {
      "Time_Start": 1565.3999999999999,
      "Time_End": 1573.8,
      "Text": " common answer. Most of you, this probably resonates, especially at the level one type SOC"
    },
    {
      "Time_Start": 1575.08,
      "Time_End": 1581.8,
      "Text": " role. People will move for a little bit of money. And I'm actually going to address that"
    },
    {
      "Time_Start": 1581.8,
      "Time_End": 1586.52,
      "Text": " on the next slide in terms of what people move for and how to retain them."
    },
    {
      "Time_Start": 1587.32,
      "Time_End": 1595.08,
      "Text": " But what's interesting about this is we then went and looked about, well, okay, in IT, is that normal?"
    },
    {
      "Time_Start": 1595.08,
      "Time_End": 1600.6,
      "Text": " Is one to three years normal? And in fact, that's about the average turnover across most of IT,"
    },
    {
      "Time_Start": 1600.6,
      "Time_End": 1607.96,
      "Text": " one to three years. So it's not just cybersecurity that has this notion of churn, it's IT generally."
    },
    {
      "Time_Start": 1607.96,
      "Time_End": 1615.64,
      "Text": " And so in order to avoid the notion of churn, what can you do to keep people around? And this is"
    },
    {
      "Time_Start": 1615.64,
      "Time_End": 1626.3600000000001,
      "Text": " interesting. Career progression was substantially higher than meaningful work or money. So it's more"
    },
    {
      "Time_Start": 1626.3600000000001,
      "Time_End": 1632.3600000000001,
      "Text": " compelling for a person to stay in a role if they feel like they have something that they're"
    },
    {
      "Time_Start": 1632.3600000000001,
      "Time_End": 1639.8000000000002,
      "Text": " moving toward from a growth perspective. Money, of course, is good. I mean, everybody wants that."
    },
    {
      "Time_Start": 1639.8000000000002,
      "Time_End": 1648.2800000000002,
      "Text": " But this was something, by a substantial margin, was an indication that that's how"
    },
    {
      "Time_Start": 1649.0000000000002,
      "Time_End": 1655.2400000000002,
      "Text": " managers were actually retaining staff. So something to think about just in terms of"
    },
    {
      "Time_Start": 1655.8,
      "Time_End": 1665.32,
      "Text": " how that might work. Remote work, since 2020, has been something that is quite common."
    },
    {
      "Time_Start": 1665.32,
      "Time_End": 1670.92,
      "Text": " And the question usually becomes, can we securely transport the data to the staff in order to be"
    },
    {
      "Time_Start": 1670.92,
      "Time_End": 1677.8,
      "Text": " able to do that? Sometimes it's whether the individual is actually in a role that would"
    },
    {
      "Time_Start": 1677.8,
      "Time_End": 1684.44,
      "Text": " allow them to do that. So this was a breakdown of what makes it so that you can do remote work"
    },
    {
      "Time_Start": 1684.52,
      "Time_End": 1692.04,
      "Text": " if you're doing it. In terms of back to staffing from a hiring perspective, what technologies were"
    },
    {
      "Time_Start": 1692.04,
      "Time_End": 1697.96,
      "Text": " most important for hiring managers were EDR and SIN. And that's not really a surprise, but it is"
    },
    {
      "Time_Start": 1697.96,
      "Time_End": 1703.8,
      "Text": " something that's consistent. I have this long technology list, and I'm going to basically"
    },
    {
      "Time_Start": 1703.8,
      "Time_End": 1709.0,
      "Text": " talk about some of these here. I know you can't read it. But this long technology list was a"
    },
    {
      "Time_Start": 1709.96,
      "Time_End": 1716.84,
      "Text": " ranking of the GPA of the technology. So I asked the question, do you give it an A,"
    },
    {
      "Time_Start": 1716.84,
      "Time_End": 1723.64,
      "Text": " do you give it a B, do you give it a C, and so on. No technology got As in terms of what people"
    },
    {
      "Time_Start": 1723.64,
      "Time_End": 1733.16,
      "Text": " graded it as. The highest response was the EDR, EDR, XDR. I grouped them together in the questioning."
    },
    {
      "Time_Start": 1733.16,
      "Time_End": 1738.84,
      "Text": " The next highest was email filters. And this is just a question of satisfaction. Do you like"
    },
    {
      "Time_Start": 1738.8400000000001,
      "Time_End": 1744.8400000000001,
      "Text": " this technology? Does it do what you want it to do? So that was at the top of the list. And down"
    },
    {
      "Time_Start": 1744.8400000000001,
      "Time_End": 1751.64,
      "Text": " at the bottom of the list, no surprise, artificial intelligence and machine learning. Absolute bottom"
    },
    {
      "Time_Start": 1751.64,
      "Time_End": 1758.5200000000002,
      "Text": " of the list. Now, this is an interesting thing. And again, I'm just my opinion in terms of"
    },
    {
      "Time_Start": 1758.5200000000002,
      "Time_End": 1766.0400000000002,
      "Text": " projection. Next year, AIML, I think it will be off of the bottom. And I think that over the next"
    },
    {
      "Time_Start": 1766.04,
      "Time_End": 1773.6399999999999,
      "Text": " couple of years, this will actually basically cycle up higher into the ranking. It was the"
    },
    {
      "Time_Start": 1773.6399999999999,
      "Time_End": 1781.48,
      "Text": " first time that I had it in the survey last year. It was 23. It was the first sort of debut for it."
    },
    {
      "Time_Start": 1782.2,
      "Time_End": 1789.32,
      "Text": " Deception, frequency analysis, packet analysis, full PCAP have consistently been near the bottom."
    },
    {
      "Time_Start": 1790.28,
      "Time_End": 1797.1599999999999,
      "Text": " This is something that people don't like, just from a perspective of that. Now again, I know that"
    },
    {
      "Time_Start": 1797.1599999999999,
      "Time_End": 1802.9199999999998,
      "Text": " you can't read this chart. I'm putting it up there to talk about what it is. The next thing that I"
    },
    {
      "Time_Start": 1802.9199999999998,
      "Time_End": 1812.36,
      "Text": " did in the chart was to be able to map the idea of how far do you get the deployment. And so we"
    },
    {
      "Time_Start": 1812.36,
      "Time_End": 1818.4399999999998,
      "Text": " asked the question, on the same technology set, do you have a full production deployment, a partial"
    },
    {
      "Time_Start": 1819.16,
      "Time_End": 1823.3200000000002,
      "Text": " production deployment? Are you in some sort of a staging but haven't finished the deployment yet?"
    },
    {
      "Time_Start": 1823.88,
      "Time_End": 1829.16,
      "Text": " And this complicated chart, which again, you can download the survey and look at the details of"
    },
    {
      "Time_Start": 1829.16,
      "Time_End": 1833.64,
      "Text": " this. But let me pull out the important components of it. This particular chart,"
    },
    {
      "Time_Start": 1835.3200000000002,
      "Time_End": 1843.8,
      "Text": " the tendency was that the higher ranked GPA technologies arrived at full production deployment."
    },
    {
      "Time_Start": 1844.76,
      "Time_End": 1850.84,
      "Text": " Okay, so this, I cannot draw a causal relationship between it, but it is trending in the same"
    },
    {
      "Time_Start": 1850.84,
      "Time_End": 1856.76,
      "Text": " direction. The higher the satisfaction, the more likely that you have a full production deployment."
    },
    {
      "Time_Start": 1857.96,
      "Time_End": 1863.08,
      "Text": " And so this is what your peers are saying in terms of the technology and what they're doing."
    },
    {
      "Time_Start": 1864.04,
      "Time_End": 1867.6399999999999,
      "Text": " I'm going to shift a little bit in terms of what I'm talking about. I mean, I'm still going to"
    },
    {
      "Time_Start": 1867.6399999999999,
      "Time_End": 1873.48,
      "Text": " talk about the survey, but I'm going to talk about something momentarily. Before I do that,"
    },
    {
      "Time_Start": 1874.12,
      "Time_End": 1878.36,
      "Text": " I want to see if anybody has any questions on any of the charts that I've talked about so far."
    },
    {
      "Time_Start": 1878.36,
      "Time_End": 1882.44,
      "Text": " Yeah, question. Yeah, actually, hold on one second. Let her give you the thing."
    },
    {
      "Time_Start": 1884.76,
      "Time_End": 1893.1599999999999,
      "Text": " Hi. Do you do any trending analysis of year to year? Yes. Because I saw with hiring stuff and"
    },
    {
      "Time_Start": 1893.1599999999999,
      "Time_End": 1899.1599999999999,
      "Text": " turnover, it seemed like with COVID, of course, some of these numbers might change because remote"
    },
    {
      "Time_Start": 1899.16,
      "Time_End": 1906.0400000000002,
      "Text": " work becomes more prevalent and turnover and just the general availability of roles outside"
    },
    {
      "Time_Start": 1906.0400000000002,
      "Time_End": 1911.8000000000002,
      "Text": " of someone's immediate area became a lot more available. And I figured that might have a say in"
    },
    {
      "Time_Start": 1913.24,
      "Time_End": 1916.0400000000002,
      "Text": " reasons people are leaving. So I'm just curious if you have that."
    },
    {
      "Time_Start": 1916.0400000000002,
      "Time_End": 1925.0800000000002,
      "Text": " Yeah, exactly. So two things on the trend analysis. One is yes, I do. The trend around"
    },
    {
      "Time_Start": 1925.08,
      "Time_End": 1932.9199999999998,
      "Text": " the question of retention, that money, I think that the first year that it was not the top was"
    },
    {
      "Time_Start": 1932.9199999999998,
      "Time_End": 1941.0,
      "Text": " 21, if I remember correctly. But the other reason why I've been really pushing to release the"
    },
    {
      "Time_Start": 1941.0,
      "Time_End": 1946.1999999999998,
      "Text": " information, the de-identified responses is, and this is what I'm going to go into next,"
    },
    {
      "Time_Start": 1946.1999999999998,
      "Time_End": 1950.52,
      "Text": " is you can get the data and start to do some of that if you're interested."
    },
    {
      "Time_Start": 1951.0,
      "Time_End": 1958.6,
      "Text": " Okay. What I release, and before I start to go into the next thing, any other questions?"
    },
    {
      "Time_Start": 1958.6,
      "Time_End": 1963.08,
      "Text": " Anything else? Yeah. Okay. Yeah. I got a couple of them. Because I'm going to go into the Jupyter"
    },
    {
      "Time_Start": 1963.08,
      "Time_End": 1967.72,
      "Text": " Lab notebook stuff, which I'll then show you how you could look at some of that too,"
    },
    {
      "Time_Start": 1967.72,
      "Time_End": 1971.8799999999999,
      "Text": " because there's usually questions like that from people specifically. Yeah. Please."
    },
    {
      "Time_Start": 1971.8799999999999,
      "Time_End": 1978.12,
      "Text": " Hey. So for the outsourcing slide that you had on there, you had things like threat"
    },
    {
      "Time_Start": 1978.1200000000001,
      "Time_End": 1984.68,
      "Text": " research and threat hunting. But then on the hiring skills that people wanted was like threat"
    },
    {
      "Time_Start": 1984.68,
      "Time_End": 1990.2,
      "Text": " analysis and intelligence analysis. So we have a lot of outsourcing for things that people are"
    },
    {
      "Time_Start": 1990.2,
      "Time_End": 1998.2,
      "Text": " looking for to get, they want their staff to be intelligent on. Is it just they're not finding"
    },
    {
      "Time_Start": 1998.2,
      "Time_End": 2002.44,
      "Text": " these people? Yeah. That's a great question. It's actually a really interesting question in terms of"
    },
    {
      "Time_Start": 2002.44,
      "Time_End": 2007.64,
      "Text": " the inside of like, okay, well, we're outsourcing that a lot, but you're also saying that a skill"
    },
    {
      "Time_Start": 2007.64,
      "Time_End": 2015.4,
      "Text": " set that managers are looking for is threat analysis, right? So the first part of this is"
    },
    {
      "Time_Start": 2016.6000000000001,
      "Time_End": 2021.0,
      "Text": " that a lot of organizations actually do stuff, and I'm going to put this in here in terms of"
    },
    {
      "Time_Start": 2021.96,
      "Time_End": 2027.72,
      "Text": " some of the activities that are in here and try to find where the, there it is. So threat hunting,"
    },
    {
      "Time_Start": 2027.72,
      "Time_End": 2031.72,
      "Text": " threat research, vulnerability assessment. A lot of organizations are actually doing both"
    },
    {
      "Time_Start": 2032.44,
      "Time_End": 2039.0,
      "Text": " internal and external. And so, and there's some more granular questions around the threat"
    },
    {
      "Time_Start": 2039.0,
      "Time_End": 2046.6000000000001,
      "Text": " intelligence specifically, as an example, where it's a question of, are you doing ingestion of"
    },
    {
      "Time_Start": 2046.6000000000001,
      "Time_End": 2053.56,
      "Text": " IOCs or are you doing the threat intelligence origination where you're actually doing the"
    },
    {
      "Time_Start": 2053.56,
      "Time_End": 2059.0,
      "Text": " analysis and then sharing that? So I think that that's part of the answer to your question is that"
    },
    {
      "Time_Start": 2059.08,
      "Time_End": 2064.52,
      "Text": " what threat intelligence is actually takes a variety of forms. The other part of it is, I think"
    },
    {
      "Time_Start": 2064.52,
      "Time_End": 2069.8,
      "Text": " that threat intel is getting outsourced a lot because it's like, yeah, just go to the dark web,"
    },
    {
      "Time_Start": 2069.8,
      "Time_End": 2075.4,
      "Text": " pull all the stuff that might be about my company and send it to me. But then internally, we need"
    },
    {
      "Time_Start": 2075.4,
      "Time_End": 2083.64,
      "Text": " somebody who understands, okay, now I've got this enormous list or stick taxi or whatever form"
    },
    {
      "Time_Start": 2083.64,
      "Time_End": 2090.12,
      "Text": " they're getting it in, that needs to be turned into a product that becomes useful to the executives,"
    },
    {
      "Time_Start": 2090.12,
      "Time_End": 2097.7999999999997,
      "Text": " to the internal detection engineering monitoring and so on. So then they have a person who's taking"
    },
    {
      "Time_Start": 2097.7999999999997,
      "Time_End": 2104.12,
      "Text": " this sort of glut of data that's coming from their third party outsourced intelligence provider in"
    },
    {
      "Time_Start": 2104.12,
      "Time_End": 2110.7599999999998,
      "Text": " order to make that useful. So that's how I think that that's playing out. The other part of it is"
    },
    {
      "Time_Start": 2110.76,
      "Time_End": 2116.0400000000004,
      "Text": " threat analysis also becomes a risk analysis perspective. So if you can understand the threat,"
    },
    {
      "Time_Start": 2116.0400000000004,
      "Time_End": 2121.1600000000003,
      "Text": " then you can make it understandable to the organization on how should we respond to that."
    },
    {
      "Time_Start": 2122.0400000000004,
      "Time_End": 2129.0800000000004,
      "Text": " But a great and very insightful question here. Have you had a hard time with people"
    },
    {
      "Time_Start": 2129.0800000000004,
      "Time_End": 2132.6800000000003,
      "Text": " self-identifying as working in the SOC? Like, for example, I know a lot of people who are"
    },
    {
      "Time_Start": 2132.6800000000003,
      "Time_End": 2136.92,
      "Text": " instant responders who are very firm. They're like, I do not work in the SOC. I am an instant"
    },
    {
      "Time_Start": 2136.92,
      "Time_End": 2144.2000000000003,
      "Text": " responder. Or people in threat intel I know also take that line. Yeah. So that's also a good"
    },
    {
      "Time_Start": 2144.2000000000003,
      "Time_End": 2151.56,
      "Text": " question. For me, the way that I've tried to do it is, look, it doesn't really matter if you call it a"
    },
    {
      "Time_Start": 2151.56,
      "Time_End": 2157.16,
      "Text": " SOC, if you call it a fusion center, if you call it a CSIRT. If you do incident response, that's fine."
    },
    {
      "Time_Start": 2157.16,
      "Time_End": 2163.32,
      "Text": " And there is essentially almost a stigma associated with the notion of the monitoring"
    },
    {
      "Time_Start": 2163.32,
      "Time_End": 2169.6400000000003,
      "Text": " component of it. So yes, I've definitely observed that, that a lot of people push off that label"
    },
    {
      "Time_Start": 2170.2000000000003,
      "Time_End": 2178.44,
      "Text": " of the SOC because for some reason it's perceived as negative. And I think one of the reasons why"
    },
    {
      "Time_Start": 2178.44,
      "Time_End": 2188.76,
      "Text": " it's perceived as negative is there's this label and it's L1. No one wants to be construed as L1"
    },
    {
      "Time_Start": 2188.76,
      "Time_End": 2195.8,
      "Text": " because that's like the entry level cyber job. And there was a talk, so I've done, you know,"
    },
    {
      "Time_Start": 2195.8,
      "Time_End": 2203.96,
      "Text": " different presentations for years. And one of the ones that I did in 2018, it was a SOC summit that"
    },
    {
      "Time_Start": 2203.96,
      "Time_End": 2212.0400000000004,
      "Text": " I was doing through SANS. I'm going to get his last name wrong, but Ismael Catano, I think was"
    },
    {
      "Time_Start": 2212.04,
      "Time_End": 2221.8,
      "Text": " his last name, he gave a presentation at the time. He was the Verizon MSSP manager. And I'm pointing,"
    },
    {
      "Time_Start": 2221.8,
      "Time_End": 2226.68,
      "Text": " you know, out toward Dulles, right? So it's like, what he said was, you know, it's a really interesting"
    },
    {
      "Time_Start": 2226.68,
      "Time_End": 2238.68,
      "Text": " thing that the most important decision in a SOC is given to the most junior role. And usually under"
    },
    {
      "Time_Start": 2238.68,
      "Time_End": 2244.04,
      "Text": " tremendous time pressure, 10-minute service level objective in order to make a decision, do we need"
    },
    {
      "Time_Start": 2244.04,
      "Time_End": 2253.48,
      "Text": " to act or is this a false positive? And he said that what this is creating is stigma and"
    },
    {
      "Time_Start": 2253.48,
      "Time_End": 2260.44,
      "Text": " essentially an opportunity for missing a lot of stuff. So yes, the idea of like, do we not like"
    },
    {
      "Time_Start": 2260.44,
      "Time_End": 2267.48,
      "Text": " the SOC? People don't like it. And it's kind of an interesting thing. I chose this area intentionally"
    },
    {
      "Time_Start": 2267.48,
      "Time_End": 2272.68,
      "Text": " many years ago, because I felt like it was the biggest problem for most organizations that they"
    },
    {
      "Time_Start": 2272.68,
      "Time_End": 2278.6,
      "Text": " cannot figure out how to operationalize their security capability. And it persists"
    },
    {
      "Time_Start": 2278.6,
      "Time_End": 2282.04,
      "Text": " in the world today. So another question."
    },
    {
      "Time_Start": 2287.32,
      "Time_End": 2293.56,
      "Text": " If you try to take this more to like a maturity model. So, you know, as you showed the"
    },
    {
      "Time_Start": 2293.56,
      "Time_End": 2299.08,
      "Text": " statistics of what going through, okay, if they're outsourcing more, it's not necessarily a bad thing."
    },
    {
      "Time_Start": 2299.08,
      "Time_End": 2305.32,
      "Text": " Like the old MSSP days, they're more moving toward an MDR and XDR, next generations and all that"
    },
    {
      "Time_Start": 2305.32,
      "Time_End": 2311.88,
      "Text": " type of stuff, right? So is there a way to kind of gauge the journey that everybody's at the same"
    },
    {
      "Time_Start": 2311.88,
      "Time_End": 2318.12,
      "Text": " level, right? Yeah, that's an awesome question. And I have a bunch of other talks that I do about"
    },
    {
      "Time_Start": 2318.12,
      "Time_End": 2326.3599999999997,
      "Text": " maturity. But let me answer your question. There is a maturity basis that I use when I do"
    },
    {
      "Time_Start": 2326.3599999999997,
      "Time_End": 2332.44,
      "Text": " maturity assessments for organizations. They're Rob Van Oos out of the Netherlands."
    },
    {
      "Time_Start": 2332.44,
      "Time_End": 2339.4,
      "Text": " If you look up SOC, C-M-M, S-O-C dash C-M-M, there's actually a basis for doing a maturity assessment."
    },
    {
      "Time_Start": 2339.4,
      "Time_End": 2347.96,
      "Text": " And what he's done over the last several years is to try to develop a consistent assessment criteria"
    },
    {
      "Time_Start": 2347.96,
      "Time_End": 2353.08,
      "Text": " and I'm working with him and he has now this network of people who are actually"
    },
    {
      "Time_Start": 2353.08,
      "Time_End": 2360.52,
      "Text": " doing maturity assessments to provide a basis of comparison between SOCs. So this SOC survey is"
    },
    {
      "Time_Start": 2360.52,
      "Time_End": 2364.92,
      "Text": " kind of a different thing of like trending and what people are doing and a view of it. But"
    },
    {
      "Time_Start": 2364.92,
      "Time_End": 2372.84,
      "Text": " what you're talking about is absolutely, we want to have a global comparative index on what it"
    },
    {
      "Time_Start": 2372.84,
      "Time_End": 2378.2000000000003,
      "Text": " means to be a security operations center. And you mentioned another thing about the negative"
    },
    {
      "Time_Start": 2378.2000000000003,
      "Time_End": 2383.32,
      "Text": " perception of outsourcing. I think outsourcing is phenomenal. I think there's a very high value"
    },
    {
      "Time_Start": 2383.32,
      "Time_End": 2390.44,
      "Text": " proposition to it. I also think that the one that I just had up there a moment ago in terms of"
    },
    {
      "Time_Start": 2391.4,
      "Time_End": 2398.92,
      "Text": " internal only, outsourced only, and then both, I think that the careful selection of vendor partners"
    },
    {
      "Time_Start": 2398.92,
      "Time_End": 2405.2400000000002,
      "Text": " who can supplement your capability and drive your staff to do better is really the right mix."
    },
    {
      "Time_Start": 2405.2400000000002,
      "Time_End": 2411.56,
      "Text": " And pen testing is a great example of this. If you can get an external party who has expertise"
    },
    {
      "Time_Start": 2411.56,
      "Time_End": 2420.6,
      "Text": " to come in and do one pen test and you are not absorbing the operational activity into your"
    },
    {
      "Time_Start": 2420.6,
      "Time_End": 2428.28,
      "Text": " internal pen test team, you're missing a huge opportunity to be able to reuse that capability."
    },
    {
      "Time_Start": 2428.28,
      "Time_End": 2432.76,
      "Text": " This is something that, as I work with organizations to help them to refactor how"
    },
    {
      "Time_Start": 2432.76,
      "Time_End": 2439.2400000000002,
      "Text": " they're doing it, it's simply a matter of if you're getting a report that tells how the"
    },
    {
      "Time_Start": 2439.2400000000002,
      "Time_End": 2444.44,
      "Text": " third party did it, your staff should be able to replicate that. You shouldn't have to go back and"
    },
    {
      "Time_Start": 2444.44,
      "Time_End": 2450.52,
      "Text": " pay for that again. What you should be paying for in your third party pen test is creativity and"
    },
    {
      "Time_Start": 2450.52,
      "Time_End": 2456.36,
      "Text": " growth and their research and their expertise. And if you're not capturing that operationally"
    },
    {
      "Time_Start": 2456.36,
      "Time_End": 2461.56,
      "Text": " internally, you're missing an opportunity. You're being wasteful with your resources."
    },
    {
      "Time_Start": 2465.1600000000003,
      "Time_End": 2470.2000000000003,
      "Text": " Let me go into this and I'm going to kind of do this fast and then I'll take one more round of"
    },
    {
      "Time_Start": 2470.2000000000003,
      "Time_End": 2475.4,
      "Text": " questions after that. The other thing, and this is kind of like the gentleman's question here"
    },
    {
      "Time_Start": 2475.4,
      "Time_End": 2482.28,
      "Text": " earlier, is I think it was in 2018, the first time that somebody contacted me after I released the"
    },
    {
      "Time_Start": 2482.28,
      "Time_End": 2489.96,
      "Text": " survey and this person asked me, hey, your report is useful. I work in an organization that"
    },
    {
      "Time_Start": 2489.96,
      "Time_End": 2497.1600000000003,
      "Text": " has 100,000 employees. What I really want to know is what the other like 10 organizations that are"
    },
    {
      "Time_Start": 2497.1600000000003,
      "Time_End": 2505.0800000000004,
      "Text": " like me in the financial industry that do this thing. And so I couldn't give him the responses."
    },
    {
      "Time_Start": 2505.08,
      "Time_End": 2513.96,
      "Text": " I couldn't share that. I kept sort of pushing in order to get it to be released. Now in 2020,"
    },
    {
      "Time_Start": 2514.68,
      "Time_End": 2520.36,
      "Text": " I actually released the survey myself. I didn't do it with SANS Institute because they didn't do"
    },
    {
      "Time_Start": 2520.36,
      "Time_End": 2526.36,
      "Text": " the survey in 2020. So in 2020 was the first year that all of the responses, I mean de-identified,"
    },
    {
      "Time_Start": 2526.36,
      "Time_End": 2532.44,
      "Text": " of course, got released. And since then that's happened. So let me just do the setup of the"
    },
    {
      "Time_Start": 2532.44,
      "Time_End": 2539.88,
      "Text": " Jupyter notebook and talk about some of the things for this. If you want to do this on your own,"
    },
    {
      "Time_Start": 2539.88,
      "Time_End": 2545.4,
      "Text": " you need Python, you need Pandas, you need Seaborn and JupyterLab. These are all the links to be able"
    },
    {
      "Time_Start": 2545.4,
      "Time_End": 2553.08,
      "Text": " to get those things. Also having the Excel support is necessary. I like word clouds,"
    },
    {
      "Time_Start": 2553.08,
      "Time_End": 2558.6,
      "Text": " so there's some capability to do that. And then this is how you would start it up."
    },
    {
      "Time_Start": 2559.56,
      "Time_End": 2566.04,
      "Text": " Now I actually, I'm not going to type anything. I do have a subset of the JupyterLab stuff,"
    },
    {
      "Time_Start": 2566.04,
      "Time_End": 2574.04,
      "Text": " so I can just talk through what I basically do in my analysis for this."
    },
    {
      "Time_Start": 2574.04,
      "Time_End": 2583.56,
      "Text": " Yeah, that's a friend of mine sticker. So this is the Jupyter notebook"
    },
    {
      "Time_Start": 2584.04,
      "Time_End": 2591.7999999999997,
      "Text": " that I basically have pulled out a few things of what I do when I do the analysis. I also"
    },
    {
      "Time_Start": 2593.08,
      "Time_End": 2599.7999999999997,
      "Text": " work with Barbara Filkins, and so she does a bunch of analysis. I do a bunch of analysis,"
    },
    {
      "Time_Start": 2599.7999999999997,
      "Time_End": 2606.44,
      "Text": " we combine it. But this is available for download and the de-identified data is available for"
    },
    {
      "Time_Start": 2606.44,
      "Time_End": 2612.04,
      "Text": " download from the SOC survey. So if you want to say like, oh, my organization's headquartered"
    },
    {
      "Time_Start": 2612.6,
      "Time_End": 2616.92,
      "Text": " in Asia, I only want to look at the other organizations that say that their headquarter"
    },
    {
      "Time_Start": 2616.92,
      "Time_End": 2621.24,
      "Text": " in Asia, you can do that. So the preliminary stuff here is just a bunch of like, is this"
    },
    {
      "Time_Start": 2621.24,
      "Time_End": 2629.8,
      "Text": " working properly? Do I have the information in my data set? The next thing, this is"
    },
    {
      "Time_Start": 2631.64,
      "Time_End": 2636.2799999999997,
      "Text": " something that's a big challenge, and this is kind of some exploratory analysis when you're"
    },
    {
      "Time_Start": 2636.2799999999997,
      "Time_End": 2641.08,
      "Text": " dealing with data that you usually need to do, is the way that the spreadsheet is actually listed"
    },
    {
      "Time_Start": 2641.08,
      "Time_End": 2647.4,
      "Text": " out. The labels are terrible, and they're really difficult to comprehend. So what I end up doing"
    },
    {
      "Time_Start": 2647.4,
      "Time_End": 2653.88,
      "Text": " is relabeling everything, and I just keep reusing the code in order to do that. And I actually"
    },
    {
      "Time_Start": 2654.92,
      "Time_End": 2662.52,
      "Text": " take the original question, and I write a little Python. I eliminated it just for tidiness in this"
    },
    {
      "Time_Start": 2662.52,
      "Time_End": 2668.04,
      "Text": " particular notebook. And then I use the question, which is what the comment is for each of these,"
    },
    {
      "Time_Start": 2668.04,
      "Time_End": 2671.72,
      "Text": " in order to be able to relabel all of the columns for all of the responses."
    },
    {
      "Time_Start": 2672.44,
      "Time_End": 2678.2,
      "Text": " Now, on the one hand, this is ridiculous to spend the time doing. On the other hand,"
    },
    {
      "Time_Start": 2679.16,
      "Time_End": 2686.68,
      "Text": " my brain can't wrap around the like 500 columns of data that's actually in there. Sorry, 500"
    },
    {
      "Time_Start": 2686.68,
      "Time_End": 2693.32,
      "Text": " columns of responses that are actually in there. So this is just the code for basically remapping"
    },
    {
      "Time_Start": 2693.32,
      "Time_End": 2700.52,
      "Text": " that in a data frame inside of pandas to be able to work through that. Then I have code down here"
    },
    {
      "Time_Start": 2700.52,
      "Time_End": 2706.76,
      "Text": " that says if you want to shift it to like this is the organization size that I want to just look at"
    },
    {
      "Time_Start": 2706.76,
      "Time_End": 2714.1200000000003,
      "Text": " big organizations based out of Asia. Now, I release this because I literally use this when"
    },
    {
      "Time_Start": 2714.1200000000003,
      "Time_End": 2720.6000000000004,
      "Text": " I'm advising companies. Like I go back and will say, okay, just as an example, I had an organization"
    },
    {
      "Time_Start": 2720.6,
      "Time_End": 2728.52,
      "Text": " approach me to help them to provide guidance to a customer of theirs that was based in South America"
    },
    {
      "Time_Start": 2728.52,
      "Time_End": 2733.56,
      "Text": " in terms of how to do some work. And I was helping them to make decisions. And I was like, okay,"
    },
    {
      "Time_Start": 2733.56,
      "Time_End": 2738.92,
      "Text": " this is how I would do this when I go into the survey data and do these pivots to be able to"
    },
    {
      "Time_Start": 2738.92,
      "Time_End": 2746.7599999999998,
      "Text": " answer the questions for a comparative analysis. I just moved it back up. Okay, so there's some"
    },
    {
      "Time_Start": 2746.76,
      "Time_End": 2752.28,
      "Text": " stuff in here in terms of how to do regional selections of the codes in there in order to"
    },
    {
      "Time_Start": 2752.28,
      "Time_End": 2758.44,
      "Text": " create alternate data frames to work through them. Then, again, from sort of an exploratory"
    },
    {
      "Time_Start": 2758.44,
      "Time_End": 2764.0400000000004,
      "Text": " perspective, I do a bunch of graphing just to kind of wrap my brain around what I'm dealing with."
    },
    {
      "Time_Start": 2764.0400000000004,
      "Time_End": 2771.5600000000004,
      "Text": " So I have some code that basically works through all of the different graphs that are there."
    },
    {
      "Time_Start": 2772.2799999999997,
      "Time_End": 2778.84,
      "Text": " So this just talks about the different details of the of the titles of how I want the"
    },
    {
      "Time_Start": 2779.56,
      "Time_End": 2785.64,
      "Text": " the label on the charting to come out. So that's all in there. And then I write it where I basically"
    },
    {
      "Time_Start": 2785.64,
      "Time_End": 2792.44,
      "Text": " dump all the graphs out to the file system as well as putting them into this."
    },
    {
      "Time_Start": 2792.44,
      "Time_End": 2799.64,
      "Text": " So this is, again, when I'm doing the preliminary analysis, I go through and I chart every single"
    },
    {
      "Time_Start": 2799.64,
      "Time_End": 2805.16,
      "Text": " question. And the other reason why I'm showing this to you is also when you start dealing with"
    },
    {
      "Time_Start": 2806.6,
      "Time_End": 2814.12,
      "Text": " data responses, whatever you're dealing with, it's really hard to think that you're"
    },
    {
      "Time_Start": 2815.0,
      "Time_End": 2821.16,
      "Text": " doing it appropriately. So if you can share your methodology of analysis with other people"
    },
    {
      "Time_Start": 2821.16,
      "Time_End": 2829.3199999999997,
      "Text": " and expose your thinking, it is really helpful to, number one, make sure you're not making mistakes."
    },
    {
      "Time_Start": 2829.72,
      "Time_End": 2834.8399999999997,
      "Text": " Number two, then give other people who want to do analysis an opportunity to peer into how you're"
    },
    {
      "Time_Start": 2834.8399999999997,
      "Time_End": 2839.64,
      "Text": " thinking about it. And I found that Jupyter is phenomenal for this because I can just share this"
    },
    {
      "Time_Start": 2839.64,
      "Time_End": 2846.12,
      "Text": " with you and say, OK, look at it. And so I've got a lot of details in here, but basically I'm setting"
    },
    {
      "Time_Start": 2846.12,
      "Time_End": 2854.2,
      "Text": " it up to where I'm trying to make graphics that are ready to drop into a report. I will also say"
    },
    {
      "Time_Start": 2854.2000000000003,
      "Time_End": 2860.84,
      "Text": " inside of cybersecurity operations, we're usually really terrible at reporting and our explanation"
    },
    {
      "Time_Start": 2860.84,
      "Time_End": 2866.5200000000004,
      "Text": " of our rationale. And so I'm trying to kind of provide a good example of how I approach that"
    },
    {
      "Time_Start": 2866.5200000000004,
      "Time_End": 2871.8,
      "Text": " thinking and the rigor that I use in order to do that in order to be able to make assessments of"
    },
    {
      "Time_Start": 2871.8,
      "Time_End": 2877.7200000000003,
      "Text": " things that I don't fully understand. So this is, for me, this is kind of like my exploratory"
    },
    {
      "Time_Start": 2877.7200000000003,
      "Time_End": 2882.0400000000004,
      "Text": " analysis. And there's some code where I'm dealing with things where I don't want charts that have"
    },
    {
      "Time_Start": 2882.04,
      "Time_End": 2889.56,
      "Text": " 30 items in it. So I like filter some stuff down. But I basically just am able to visualize"
    },
    {
      "Time_Start": 2889.56,
      "Time_End": 2896.44,
      "Text": " every single question that comes out. But that's there. And then I go into some of the details of"
    },
    {
      "Time_Start": 2897.24,
      "Time_End": 2904.2,
      "Text": " how I deal with technology. I think this is what I included as the final sort of demo"
    },
    {
      "Time_Start": 2904.2,
      "Time_End": 2910.84,
      "Text": " component inside of here. So these are all still just getting it to where I've got the charts"
    },
    {
      "Time_Start": 2910.92,
      "Time_End": 2918.1200000000003,
      "Text": " the way that I want. And then in the technology here, I talk about some of the difficulty of"
    },
    {
      "Time_Start": 2918.1200000000003,
      "Time_End": 2924.84,
      "Text": " finding certain segments of data and then pivoting around inside of it in order to do the visualizations"
    },
    {
      "Time_Start": 2924.84,
      "Time_End": 2931.2400000000002,
      "Text": " and the counting and the rationale of how I basically did the GPA-based assessment of the"
    },
    {
      "Time_Start": 2931.2400000000002,
      "Time_End": 2937.6400000000003,
      "Text": " different technologies. This is sort of a first stab at the view of what were people's"
    },
    {
      "Time_Start": 2938.3599999999997,
      "Time_End": 2944.52,
      "Text": " opinions of the technology. And in this, and of course, I'm not going to take the time to go into"
    },
    {
      "Time_Start": 2944.52,
      "Time_End": 2950.52,
      "Text": " it. But when I was first looking at this, I was asking the question, where are there cases where"
    },
    {
      "Time_Start": 2950.52,
      "Time_End": 2956.92,
      "Text": " people love it and hate it? It's like, because I can have one thing where everybody gave it a C"
    },
    {
      "Time_Start": 2956.92,
      "Time_End": 2961.08,
      "Text": " and another one where there are lots of As and Fs. And I can end up with the same GPA."
    },
    {
      "Time_Start": 2961.08,
      "Time_End": 2965.4,
      "Text": " So I was trying to look at some of these from a visualization perspective. And you can do it"
    },
    {
      "Time_Start": 2965.4,
      "Time_End": 2972.6,
      "Text": " statistically as well to decide on this. And then just some details working through the"
    },
    {
      "Time_Start": 2972.6,
      "Time_End": 2979.4,
      "Text": " numbers on whether people liked it or not, and then ending up with the GPAs. So this JupyterLab"
    },
    {
      "Time_Start": 2979.4,
      "Time_End": 2985.08,
      "Text": " notebook, it's on that website that you can download if you do have analysis that you want to"
    },
    {
      "Time_Start": 2985.08,
      "Time_End": 2993.0,
      "Text": " do. If you do have other questions, feel free to ask. Now that I've shown you this,"
    },
    {
      "Time_Start": 2993.0,
      "Time_End": 2994.92,
      "Text": " it may sort of trigger some other thoughts."
    },
    {
      "Time_Start": 2997.64,
      "Time_End": 2999.96,
      "Text": " Anything else? Yeah, go ahead. Or are we out of time?"
    },
    {
      "Time_Start": 2999.96,
      "Time_End": 3000.68,
      "Text": " We are out of time."
    },
    {
      "Time_Start": 3000.68,
      "Time_End": 3003.08,
      "Text": " I'm sorry. You can ask me afterwards. Yep. Okay."
    },
    {
      "Time_Start": 3003.72,
      "Time_End": 3005.96,
      "Text": " So let's give a hand to Christopher Crowley."
    },
    {
      "Time_Start": 3005.96,
      "Time_End": 3012.92,
      "Text": " Thank you."
    }
  ]
}