{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 10.68,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hey everyone. Let me get started. I'm not going to read the title to you. For some reason"
    },
    {
      "Time_Start": 10.68,
      "Time_End": 17.76,
      "Text": " I picked the longest title that I could imagine. Maybe path-related. Anyway, for people that"
    },
    {
      "Time_Start": 17.76,
      "Time_End": 22.04,
      "Text": " don't know me, I'll quickly introduce myself. I'm Olaf. I'm from the Netherlands. I'm a"
    },
    {
      "Time_Start": 22.04,
      "Time_End": 28.560000000000002,
      "Text": " detection engineer at Falcon Force, a company I also partially founded. I've been in the"
    },
    {
      "Time_Start": 28.560000000000002,
      "Time_End": 34.52,
      "Text": " blue space like forever. I've never done attacks. I replicated attacks and I tried to understand"
    },
    {
      "Time_Start": 34.52,
      "Time_End": 39.92,
      "Text": " them in order to properly defend companies. But that's about it. You don't want to have"
    },
    {
      "Time_Start": 39.92,
      "Time_End": 47.120000000000005,
      "Text": " me as a red team operator for sure. I didn't study any cyber stuff. I used to be a documentary"
    },
    {
      "Time_Start": 47.120000000000005,
      "Time_End": 53.84,
      "Text": " photographer. I went to art school. So I'm fairly visually oriented. That's why I like"
    },
    {
      "Time_Start": 53.84,
      "Time_End": 59.52,
      "Text": " graphs so much, I guess. And of course I like wormhogs because every Olaf does. So"
    },
    {
      "Time_Start": 59.52,
      "Time_End": 67.0,
      "Text": " what can you expect from me today? So we'll have a lot of slides with lists. I'll use"
    },
    {
      "Time_Start": 67.0,
      "Time_End": 74.80000000000001,
      "Text": " some graphs to talk about the value of lists. Some more lists because I love lists. And"
    },
    {
      "Time_Start": 74.80000000000001,
      "Time_End": 80.88,
      "Text": " of course we're going to talk about how to apply Bloodhound stuff for blue. And the reason"
    },
    {
      "Time_Start": 80.88,
      "Time_End": 86.6,
      "Text": " why I made the list jokes, it might be obvious now. This is a quote from John Lambert from"
    },
    {
      "Time_Start": 86.6,
      "Time_End": 92.24,
      "Text": " a very long time ago where defenders seem to think in lists and attackers don't. But"
    },
    {
      "Time_Start": 92.24,
      "Time_End": 96.96,
      "Text": " as long as that's true, attacker might win. Not fully agree with it probably, but that's"
    },
    {
      "Time_Start": 96.96,
      "Time_End": 101.67999999999999,
      "Text": " fine. It bugged me and I wanted to do something about it. So a year after that at Black Hat,"
    },
    {
      "Time_Start": 101.67999999999999,
      "Time_End": 110.39999999999999,
      "Text": " they released Bloodhound 1.0. Like baby Bloodhounds, the graph was tiny but already useful. And"
    },
    {
      "Time_Start": 110.4,
      "Time_End": 115.56,
      "Text": " by now I think it's even grown more. This is an old screenshot from Andy from I think"
    },
    {
      "Time_Start": 115.56,
      "Time_End": 122.56,
      "Text": " a year ago where you can see the graph has exponentially grown. And the value for most"
    },
    {
      "Time_Start": 122.56,
      "Time_End": 128.56,
      "Text": " of the offensive people is obvious, right? It's been used quite a long time and it's"
    },
    {
      "Time_Start": 128.56,
      "Time_End": 135.6,
      "Text": " extremely powerful, extremely useful. And sadly I don't see a lot of people on the defensive"
    },
    {
      "Time_Start": 135.6,
      "Time_End": 140.72,
      "Text": " side utilize it as much as they could, right? Quite often we see them run it once a year"
    },
    {
      "Time_Start": 140.72,
      "Time_End": 146.6,
      "Text": " on an assessment or an audit, go through it, fix stuff, good. And then next year they do"
    },
    {
      "Time_Start": 146.6,
      "Time_End": 151.88,
      "Text": " it again. But in the year in between, it's like gone, which is a shame. And it's not"
    },
    {
      "Time_Start": 151.88,
      "Time_End": 157.35999999999999,
      "Text": " necessarily the lack of documentation. There's plenty of stuff around like red team pen testing"
    },
    {
      "Time_Start": 157.35999999999999,
      "Time_End": 161.76,
      "Text": " stuff. But even if you Google with the blue team force quotes in there, you get plenty"
    },
    {
      "Time_Start": 161.76,
      "Time_End": 167.0,
      "Text": " of results. It's not all blue team focused, of course, but we were all creative people"
    },
    {
      "Time_Start": 167.0,
      "Time_End": 172.23999999999998,
      "Text": " so we can think about how we can actually apply it and how we can use it. So talking"
    },
    {
      "Time_Start": 172.23999999999998,
      "Time_End": 178.2,
      "Text": " to a lot of blue teamers, of course, fake tweets, but there's a lot of sense of, hey,"
    },
    {
      "Time_Start": 178.2,
      "Time_End": 184.6,
      "Text": " this isn't built for us. So why can we use that? Or yeah, I'm not really familiar with"
    },
    {
      "Time_Start": 184.6,
      "Time_End": 189.0,
      "Text": " Cypher. It looks like a very daunting query language and it has a learning curve like"
    },
    {
      "Time_Start": 189.0,
      "Time_End": 194.68,
      "Text": " any other ones, but you'll get used to it. And then the next thing is, so I can't keep"
    },
    {
      "Time_Start": 194.68,
      "Time_End": 200.0,
      "Text": " on auditing this because I'm busy running incidents, these kinds of things. So how can"
    },
    {
      "Time_Start": 200.0,
      "Time_End": 207.28,
      "Text": " I utilize this in a more sustainable manner? And then for both sides, there's quite a lot"
    },
    {
      "Time_Start": 207.28,
      "Time_End": 212.24,
      "Text": " of challenges in collecting data in the first place, right? You need to run scans and you"
    },
    {
      "Time_Start": 212.24,
      "Time_End": 217.96,
      "Text": " need to schedule that. Usually you need to get permission from somebody, sometimes other"
    },
    {
      "Time_Start": 217.96,
      "Time_End": 222.24,
      "Text": " operation teams or network people won't like you because you want to have the firewall"
    },
    {
      "Time_Start": 222.24,
      "Time_End": 226.4,
      "Text": " opened up to all the networks. And that's also sort of the next point where it's pretty"
    },
    {
      "Time_Start": 226.4,
      "Time_End": 232.32,
      "Text": " hard to penetrate like all of your subnets if you properly segmented your network because"
    },
    {
      "Time_Start": 232.32,
      "Time_End": 237.76000000000002,
      "Text": " then there's all kinds of firewalls in betweens and boundaries to get like session data and"
    },
    {
      "Time_Start": 237.76000000000002,
      "Time_End": 243.12,
      "Text": " local admin data, that kind of stuff. And the biggest downside of running a scan is"
    },
    {
      "Time_Start": 243.12,
      "Time_End": 247.76,
      "Text": " like once you're done, it's already sort of old and you don't run it consecutively"
    },
    {
      "Time_Start": 247.76,
      "Time_End": 253.04,
      "Text": " because reasons. It's quite a lot of work. It's quite compute intensive. And then you"
    },
    {
      "Time_Start": 253.04,
      "Time_End": 257.88,
      "Text": " also need to ingest like this huge amount of data every time. And then of course the"
    },
    {
      "Time_Start": 257.88,
      "Time_End": 262.92,
      "Text": " same thing is all your local data isn't as visible as you want it to be maybe on the"
    },
    {
      "Time_Start": 262.92,
      "Time_End": 268.6,
      "Text": " AD side. And then the next question comes to rise is like, hey, I scanned this session"
    },
    {
      "Time_Start": 268.6,
      "Time_End": 276.36,
      "Text": " yesterday. What about now? Do I scan again? These kinds of reasons. So that's still a"
    },
    {
      "Time_Start": 276.36,
      "Time_End": 281.68,
      "Text": " struggle. So maybe an obvious point is but why are sessions important? So let's imagine"
    },
    {
      "Time_Start": 281.68,
      "Time_End": 291.96000000000004,
      "Text": " this user, he has a session to this computer. But there's also this like diamond user, which"
    },
    {
      "Time_Start": 291.96,
      "Time_End": 298.44,
      "Text": " is usually a global admin or in this case, a domain admin that had a session to that"
    },
    {
      "Time_Start": 298.44,
      "Time_End": 305.96,
      "Text": " computer as well. And they also had a session to a domain app or domain controller. So in"
    },
    {
      "Time_Start": 305.96,
      "Time_End": 310.03999999999996,
      "Text": " this case, it was had a session and that's sort of maybe a precursor to later, which"
    },
    {
      "Time_Start": 310.03999999999996,
      "Time_End": 315.59999999999997,
      "Text": " is one of the edges I added is it's equally valuable. So if even if the user isn't logged"
    },
    {
      "Time_Start": 315.59999999999997,
      "Time_End": 320.12,
      "Text": " onto that machine right now, it's quite likely that they will return, right? If somebody"
    },
    {
      "Time_Start": 320.12,
      "Time_End": 325.28000000000003,
      "Text": " logs onto a machine, they probably do it again. So an attacker can wait for that, capture"
    },
    {
      "Time_Start": 325.28000000000003,
      "Time_End": 330.6,
      "Text": " the creds and play with it. Or maybe the creds are still stored in memory. If the session"
    },
    {
      "Time_Start": 330.6,
      "Time_End": 337.52,
      "Text": " is very long, it might be still present. So all this information is something that I figured"
    },
    {
      "Time_Start": 337.52,
      "Time_End": 343.6,
      "Text": " as a blue teamers like, hey, we kind of have this stuff, right? We have logs and logs are"
    },
    {
      "Time_Start": 343.6,
      "Time_End": 348.64,
      "Text": " boring for some people, but they're extremely powerful and useful to me because I can see"
    },
    {
      "Time_Start": 348.64,
      "Time_End": 354.24,
      "Text": " who logs in, where, when, when they log off and where else they are playing around and"
    },
    {
      "Time_Start": 354.24,
      "Time_End": 359.4,
      "Text": " doing all kinds of other things. So with that, we can do a lot of cool stuff. One of the"
    },
    {
      "Time_Start": 359.4,
      "Time_End": 365.03999999999996,
      "Text": " things again, as I mentioned many times now, we can see log ons, but also unlocks. We can"
    },
    {
      "Time_Start": 365.03999999999996,
      "Time_End": 370.96,
      "Text": " only see log offs. We can see if a user is modified, if the user is added to a group,"
    },
    {
      "Time_Start": 370.96,
      "Time_End": 374.56,
      "Text": " if there's a new group created and then a user has been added to it, all this kind of"
    },
    {
      "Time_Start": 374.56,
      "Time_End": 380.84,
      "Text": " stuff. But we can also, since we are looking at logs, we can generate alerts. Our EDR generates"
    },
    {
      "Time_Start": 380.84,
      "Time_End": 386.96,
      "Text": " alerts, all these things that generate alerts, which also might open up some new attack potential"
    },
    {
      "Time_Start": 386.96,
      "Time_End": 393.48,
      "Text": " or give us the capability to track an attacker along a path. And then on the Azure side,"
    },
    {
      "Time_Start": 393.48,
      "Time_End": 398.92,
      "Text": " we can also do all kinds of other stools stuff like role modifications, but also the eligibility"
    },
    {
      "Time_Start": 398.92,
      "Time_End": 404.28,
      "Text": " of a role, which is a PIM thing on the Azure side. And one of the other things that I'll"
    },
    {
      "Time_Start": 404.28000000000003,
      "Time_End": 410.88000000000005,
      "Text": " demo later is also MFA. So if somebody hijacks your MFA, suddenly they have control over"
    },
    {
      "Time_Start": 410.88000000000005,
      "Time_End": 419.12,
      "Text": " maybe multiple accounts. And all this stuff, again, is logged. So it's in near real time."
    },
    {
      "Time_Start": 419.12,
      "Time_End": 422.36,
      "Text": " Depends a little bit on your platform. Azure might be sometimes a little bit slow in logging,"
    },
    {
      "Time_Start": 422.36,
      "Time_End": 428.74,
      "Text": " but still you will get it. And every time you process this, your path might change."
    },
    {
      "Time_Start": 428.74,
      "Time_End": 433.64000000000004,
      "Text": " So this is why we created Falconhounds. The first version was created by JD in the back"
    },
    {
      "Time_Start": 433.64,
      "Time_End": 442.56,
      "Text": " in PowerShell. And from there, we learned that if you used, or at least I learned with"
    },
    {
      "Time_Start": 442.56,
      "Time_End": 447.28,
      "Text": " limited PowerShell knowledge, that if you run that at scale, it struggles a little bit"
    },
    {
      "Time_Start": 447.28,
      "Time_End": 454.97999999999996,
      "Text": " with big data sets. So at some point, we converted it to Go, which it has the ability to query"
    },
    {
      "Time_Start": 454.97999999999996,
      "Time_End": 458.68,
      "Text": " like all these data sources. I'm not going to list them out, but the primary one is probably"
    },
    {
      "Time_Start": 458.68,
      "Time_End": 466.32,
      "Text": " Neo4j for Bloodhound, and I support most of the bigger logging facilities. So it queries"
    },
    {
      "Time_Start": 466.32,
      "Time_End": 472.32,
      "Text": " the data, and then it stores the results somewhere else. So one of the things could be I query"
    },
    {
      "Time_Start": 472.32,
      "Time_End": 478.8,
      "Text": " a log and I store it in Neo4j, and I can then do path calculations. But I might also want"
    },
    {
      "Time_Start": 478.8,
      "Time_End": 487.52,
      "Text": " to query Neo4j via Bloodhound, and get it from, give me all the domain admins, and put"
    },
    {
      "Time_Start": 487.52,
      "Time_End": 492.96,
      "Text": " it in a watch list for my sim to actually work with, which should be always up to date"
    },
    {
      "Time_Start": 492.96,
      "Time_End": 497.2,
      "Text": " instead of generating it from AD and then doing all kinds of other hassles, right? We"
    },
    {
      "Time_Start": 497.2,
      "Time_End": 504.71999999999997,
      "Text": " have one single source of truth already. And since it built a Go, we can build it for Linux,"
    },
    {
      "Time_Start": 504.71999999999997,
      "Time_End": 510.91999999999996,
      "Text": " for Windows, for Mac, whichever you like. So you can put it next to your Bloodhound"
    },
    {
      "Time_Start": 510.91999999999996,
      "Time_End": 515.4399999999999,
      "Text": " Docker instances or whichever you're using, which is quite convenient. So basically, the"
    },
    {
      "Time_Start": 515.44,
      "Time_End": 520.8000000000001,
      "Text": " only thing you really need to do to start using it is create API credentials, configure"
    },
    {
      "Time_Start": 520.8000000000001,
      "Time_End": 527.9200000000001,
      "Text": " them, decide on, well, put it in a config, of course, and define basically what you want"
    },
    {
      "Time_Start": 527.9200000000001,
      "Time_End": 533.6800000000001,
      "Text": " to run. So which platforms do I want to support and what queries do I want to execute? There's"
    },
    {
      "Time_Start": 533.6800000000001,
      "Time_End": 539.12,
      "Text": " a long repo already with stuff in there. And then you basically create a cron job or schedule"
    },
    {
      "Time_Start": 539.12,
      "Time_End": 545.36,
      "Text": " task to run it every, whatever you like. Generally, I'd like to do it every 15 minutes"
    },
    {
      "Time_Start": 545.36,
      "Time_End": 550.88,
      "Text": " because some of the path calculation queries can take a little, and you don't necessarily"
    },
    {
      "Time_Start": 550.88,
      "Time_End": 557.16,
      "Text": " need every five minutes up-to-date information in most environments, unless you are so heavily"
    },
    {
      "Time_Start": 557.16,
      "Time_End": 561.92,
      "Text": " automated that you can actually stop an attacker within 10 minutes, which would be impressive"
    },
    {
      "Time_Start": 561.92,
      "Time_End": 568.44,
      "Text": " and rare, but I give you the challenge. So basically, the simplified flow of the whole"
    },
    {
      "Time_Start": 568.44,
      "Time_End": 575.5200000000001,
      "Text": " tool is that we have a lot of actions that it can do, one of which is it queries logs."
    },
    {
      "Time_Start": 575.5200000000001,
      "Time_End": 581.0,
      "Text": " It will process the results, make it into a nice JSON format, and then it can either"
    },
    {
      "Time_Start": 581.0,
      "Time_End": 590.4000000000001,
      "Text": " upload it to Neo4j or to a CSV file, watch list, markdown file, whatever you like. Then"
    },
    {
      "Time_Start": 590.4000000000001,
      "Time_End": 594.7600000000001,
      "Text": " there is a bunch of cleanup actions that I do. So one of the things is I time out sessions"
    },
    {
      "Time_Start": 594.76,
      "Time_End": 603.72,
      "Text": " after a certain period, but also if I remove closed alerts from an object. So let's say"
    },
    {
      "Time_Start": 603.72,
      "Time_End": 609.24,
      "Text": " I have an alert on a user, which I wrote down first, then I resolve the alerts, then I also"
    },
    {
      "Time_Start": 609.24,
      "Time_End": 614.68,
      "Text": " want to remove it because then that user isn't owned anymore in my world. So I want to clean"
    },
    {
      "Time_Start": 614.68,
      "Time_End": 621.08,
      "Text": " that up. And then I have a new clean database in Neo4j, then I query it for all kinds of"
    },
    {
      "Time_Start": 621.08,
      "Time_End": 626.2800000000001,
      "Text": " paths, all kinds of information that I want. I process it again, and I basically write"
    },
    {
      "Time_Start": 626.2800000000001,
      "Time_End": 633.9200000000001,
      "Text": " it to either my sim or a watch list or a report or whatever we like to do. It's all supported"
    },
    {
      "Time_Start": 633.9200000000001,
      "Time_End": 639.6800000000001,
      "Text": " there. The markdown is limited, so it's basically just giving you a table of all the results"
    },
    {
      "Time_Start": 639.6800000000001,
      "Time_End": 646.1600000000001,
      "Text": " that you were interested in, but it can be very useful to copy paste that into your report."
    },
    {
      "Time_Start": 646.16,
      "Time_End": 651.1999999999999,
      "Text": " So some sample actions that are in there. So one, of course, as I mentioned a lot, is"
    },
    {
      "Time_Start": 651.1999999999999,
      "Time_End": 656.6,
      "Text": " keep the session information up to date, which is really useful in terms of like, hey, how"
    },
    {
      "Time_Start": 656.6,
      "Time_End": 663.12,
      "Text": " are people moving around my network, these kinds of things. But also marking everything"
    },
    {
      "Time_Start": 663.12,
      "Time_End": 668.48,
      "Text": " that has an alert on it as owned. And of course, owned is potentially owned because we have"
    },
    {
      "Time_Start": 668.48,
      "Time_End": 672.9,
      "Text": " false positives in the Blue Team world and all kinds of things, but still a correlation"
    },
    {
      "Time_Start": 672.9,
      "Time_End": 678.06,
      "Text": " that might actually be interesting or prioritize the analysis of your alerts. If you know,"
    },
    {
      "Time_Start": 678.06,
      "Time_End": 683.78,
      "Text": " hey, this user has a path to a sensitive resource or something I care about, and there's an"
    },
    {
      "Time_Start": 683.78,
      "Time_End": 688.86,
      "Text": " alert on it, I might want to investigate that before I look at that other user that doesn't"
    },
    {
      "Time_Start": 688.86,
      "Time_End": 694.66,
      "Text": " seem to have any access. So that can already be a very nice thing to reprioritize your"
    },
    {
      "Time_Start": 694.66,
      "Time_End": 701.46,
      "Text": " flows. And basically because we're repeatedly querying for all these paths, we can do all"
    },
    {
      "Time_Start": 701.46,
      "Time_End": 706.1,
      "Text": " kinds of interesting bits where we can see lateral movement activities and these kinds"
    },
    {
      "Time_Start": 706.1,
      "Time_End": 709.9000000000001,
      "Text": " of things throughout our environments. But we can also add new users, new groups, everything"
    },
    {
      "Time_Start": 709.9000000000001,
      "Time_End": 715.7800000000001,
      "Text": " that is added to your environment in between your bigger scans, which you still want to do."
    },
    {
      "Time_Start": 715.7800000000001,
      "Time_End": 720.1,
      "Text": " We can keep it up to date in the meantime. And then we can augment it whenever we import"
    },
    {
      "Time_Start": 720.1,
      "Time_End": 728.1600000000001,
      "Text": " a new scan. And we could even start calculating choke points and other paths that might be"
    },
    {
      "Time_Start": 728.16,
      "Time_End": 733.48,
      "Text": " more significant than others. But you have to build those yourself because I don't want"
    },
    {
      "Time_Start": 733.48,
      "Time_End": 740.56,
      "Text": " to butcher the BHE product. But technically, it would be possible, even though the capability"
    },
    {
      "Time_Start": 740.56,
      "Time_End": 746.6,
      "Text": " is probably limited. And I'm not as smart as all the developers out there. So how do"
    },
    {
      "Time_Start": 746.6,
      "Time_End": 752.88,
      "Text": " you configure this? So basically, there is a YAML template that I provide for every action."
    },
    {
      "Time_Start": 752.88,
      "Time_End": 756.8399999999999,
      "Text": " And of course, this is way too little to read. But technically, you basically give it a name,"
    },
    {
      "Time_Start": 756.84,
      "Time_End": 761.84,
      "Text": " an identifier, some other metadata, whether it's active or not, and whether you want"
    },
    {
      "Time_Start": 761.84,
      "Time_End": 768.1600000000001,
      "Text": " to debug it or not. And then in there, you basically give it a source platform. So what"
    },
    {
      "Time_Start": 768.1600000000001,
      "Time_End": 773.36,
      "Text": " do I query? In this case, it's MDE, Defender for Endpoints. And I give it a native Kusto"
    },
    {
      "Time_Start": 773.36,
      "Time_End": 779.2,
      "Text": " query. So I basically just tell it, hey, fetch this and project only the stuff I care about."
    },
    {
      "Time_Start": 779.2,
      "Time_End": 786.76,
      "Text": " So it's sort of get data. If you know Kusto, this is very familiar. If you know Splunk,"
    },
    {
      "Time_Start": 786.8,
      "Time_End": 792.16,
      "Text": " you write a Splunk query. That's sort of the thing. And then you define outputs. So I call"
    },
    {
      "Time_Start": 792.16,
      "Time_End": 798.08,
      "Text": " it targets. And you can have as many as you like, as long as it's supported by the code."
    },
    {
      "Time_Start": 798.08,
      "Time_End": 803.84,
      "Text": " But in this case, it's a Neo4j target, and it's a watch list, which is the Sentinel equivalent"
    },
    {
      "Time_Start": 803.84,
      "Time_End": 811.8,
      "Text": " of the Splunk lookup list. So it's technically just a CSV hosted in the sim. And again, on"
    },
    {
      "Time_Start": 811.8000000000001,
      "Time_End": 818.1200000000001,
      "Text": " the Neo4j side, you just give it Cypher. And I try to make it as simple as possible."
    },
    {
      "Time_Start": 818.1200000000001,
      "Time_End": 825.32,
      "Text": " But technically, I work with the Neo4j parameters. So for every result from the top query, I"
    },
    {
      "Time_Start": 825.32,
      "Time_End": 829.8000000000001,
      "Text": " generate a Cypher query with the parameters that I care about. So in this case, I have"
    },
    {
      "Time_Start": 829.8000000000001,
      "Time_End": 836.8000000000001,
      "Text": " this fancy thing, right? Does it work? No. Okay, great. Technology. So basically, I replace"
    },
    {
      "Time_Start": 836.8000000000001,
      "Time_End": 843.4000000000001,
      "Text": " this dollar sign device name with the device name that I get from there. And I do that"
    },
    {
      "Time_Start": 843.4000000000001,
      "Time_End": 848.6400000000001,
      "Text": " with all the other ones. So you can technically just juggle with data and get it into the"
    },
    {
      "Time_Start": 848.6400000000001,
      "Time_End": 854.2800000000001,
      "Text": " right format, and it will take care of the submission for you."
    },
    {
      "Time_Start": 854.28,
      "Time_End": 861.24,
      "Text": " So if you haven't imagined ideas, some practical use cases that you could think of is generate"
    },
    {
      "Time_Start": 861.24,
      "Time_End": 868.4,
      "Text": " watch lists for devices that are harder to mitigate. So you'll have some paths in your"
    },
    {
      "Time_Start": 868.4,
      "Time_End": 873.4,
      "Text": " environment, right? You can't get rid of some. Some are just needed. So you can put them"
    },
    {
      "Time_Start": 873.4,
      "Time_End": 879.4,
      "Text": " in a list and maybe deprioritize incidents or reprioritize incidents if one of those"
    },
    {
      "Time_Start": 879.48,
      "Time_End": 887.64,
      "Text": " resources is involved. That. But you can also generate, basically, well, in Kusto, it's"
    },
    {
      "Time_Start": 887.64,
      "Time_End": 892.24,
      "Text": " very easy. I'm not sure about Splunk, but you can basically do a diff between the previous"
    },
    {
      "Time_Start": 892.24,
      "Time_End": 897.16,
      "Text": " set of paths and the current set of paths, because I write them every time. If there's"
    },
    {
      "Time_Start": 897.16,
      "Time_End": 903.24,
      "Text": " a new one or one grows, I want to have an alert. I don't care about the same paths that"
    },
    {
      "Time_Start": 903.24,
      "Time_End": 907.52,
      "Text": " I already knew about, because that's just flooding people with alerts that they can't"
    },
    {
      "Time_Start": 907.52,
      "Time_End": 914.1999999999999,
      "Text": " do anything about. And one of the other cool thing is you can track uncommon session or"
    },
    {
      "Time_Start": 914.1999999999999,
      "Time_End": 920.28,
      "Text": " anomalous sessions along a certain path as a sort of lateral movement indicators. Like,"
    },
    {
      "Time_Start": 920.28,
      "Time_End": 926.88,
      "Text": " hey, this user never logs into these kinds of machines or shouldn't. If it happens, I"
    },
    {
      "Time_Start": 926.88,
      "Time_End": 931.0,
      "Text": " want to have an alert. So there's one action in there that automatically looks for domain"
    },
    {
      "Time_Start": 931.0,
      "Time_End": 934.8,
      "Text": " admins that are logging into workstations, for instance, right? Why would they? There's"
    },
    {
      "Time_Start": 934.8000000000001,
      "Time_End": 938.6,
      "Text": " simply no reason for that. So these simple things you can also build as an action, but"
    },
    {
      "Time_Start": 938.6,
      "Time_End": 946.4000000000001,
      "Text": " you can also do that within your sim. And you can also uncover risky resources that"
    },
    {
      "Time_Start": 946.4000000000001,
      "Time_End": 952.4000000000001,
      "Text": " have paths that you weren't aware of, which I'll have a couple of examples for you in"
    },
    {
      "Time_Start": 952.4000000000001,
      "Time_End": 962.6800000000001,
      "Text": " a sec. So, of course, now I try to do a demo, if the internet permits me. So if you don't"
    },
    {
      "Time_Start": 962.8000000000001,
      "Time_End": 966.96,
      "Text": " give it any permission or any variables, you'll just get the help output. And there's a couple"
    },
    {
      "Time_Start": 966.96,
      "Time_End": 970.84,
      "Text": " of things you want to do. So if you want to use Azure Data Explorer, you need to initialize"
    },
    {
      "Time_Start": 970.84,
      "Time_End": 975.72,
      "Text": " it. If you want to use Azure Key Vault, there is a variable that you can give it as well"
    },
    {
      "Time_Start": 975.72,
      "Time_End": 981.1200000000001,
      "Text": " and it will get all the credentials it needs from an Azure Key Vault. And you can also"
    },
    {
      "Time_Start": 981.1200000000001,
      "Time_End": 986.6,
      "Text": " play for debugging. There's a couple of options that you can use. So let's see if this is"
    },
    {
      "Time_Start": 986.64,
      "Time_End": 996.4,
      "Text": " actually readable. I hope it is. Yay for dark mode. So one of the things that you can do"
    },
    {
      "Time_Start": 996.4,
      "Time_End": 1004.32,
      "Text": " if you are running on the, that's too much. So you can basically also look if you don't"
    },
    {
      "Time_Start": 1004.32,
      "Time_End": 1009.24,
      "Text": " want to read through all the documents, but you can get a list of all the actions that"
    },
    {
      "Time_Start": 1009.24,
      "Time_End": 1015.6,
      "Text": " are there. So these are currently, there's 68 actions that it can take. So this is already"
    },
    {
      "Time_Start": 1015.64,
      "Time_End": 1022.2,
      "Text": " out of the box provided and contributors are very welcome because it's more of a pet project."
    },
    {
      "Time_Start": 1022.2,
      "Time_End": 1029.84,
      "Text": " So basically you can see where it's running. So if you don't have Elastic, then disable it."
    },
    {
      "Time_Start": 1029.84,
      "Time_End": 1033.52,
      "Text": " There's also a feature in there that if you don't provide it creds for Elastic, it will"
    },
    {
      "Time_Start": 1033.52,
      "Time_End": 1038.32,
      "Text": " try to run it and see, hey, there's no creds and skips it. So you don't even need to tamper"
    },
    {
      "Time_Start": 1038.32,
      "Time_End": 1044.96,
      "Text": " with it that much. There's two variants of the graph API in there, which might be confusing,"
    },
    {
      "Time_Start": 1045.72,
      "Time_End": 1052.0,
      "Text": " but there's the Go SDK version that I use for certain things because they're quite complicated"
    },
    {
      "Time_Start": 1052.0,
      "Time_End": 1061.24,
      "Text": " with consecutive lookups. One of the ones is the, where are you? Well, anyway, I do"
    },
    {
      "Time_Start": 1061.24,
      "Time_End": 1066.56,
      "Text": " and the MFA lookups, but you have to do that per user. So you have to basically get all"
    },
    {
      "Time_Start": 1066.56,
      "Time_End": 1071.1200000000001,
      "Text": " the users and iterate all over all the users to actually get their MFA settings from the"
    },
    {
      "Time_Start": 1071.1200000000001,
      "Time_End": 1078.7600000000002,
      "Text": " graph API, which is extremely useful. But yeah, you can't do that with a single URL"
    },
    {
      "Time_Start": 1078.7600000000002,
      "Time_End": 1085.68,
      "Text": " based query. So the MS graph allows you to just give it a graph URL as you would also"
    },
    {
      "Time_Start": 1085.68,
      "Time_End": 1089.4,
      "Text": " do it with a curl command. And if you want to do fancy stuff, then you have to build"
    },
    {
      "Time_Start": 1089.4,
      "Time_End": 1096.2800000000002,
      "Text": " a Go module. So it's the same with OAuth consent and some of the other things I've added recently."
    },
    {
      "Time_Start": 1096.28,
      "Time_End": 1101.8799999999999,
      "Text": " The rest should be very straightforward, native query languages for Sentinel, Defender"
    },
    {
      "Time_Start": 1101.8799999999999,
      "Time_End": 1109.96,
      "Text": " or Cypher. So one of the things that we can do now is just have it run. You have to, it"
    },
    {
      "Time_Start": 1109.96,
      "Time_End": 1117.2,
      "Text": " assumes a config local. If you have multiple configs like I do, you can basically define"
    },
    {
      "Time_Start": 1117.2,
      "Time_End": 1123.12,
      "Text": " where it actually is and then you set it off, right? So it starts querying Sentinel. If"
    },
    {
      "Time_Start": 1123.1200000000001,
      "Time_End": 1127.7600000000002,
      "Text": " it finds stuff, it will tell you what it's doing. So in this case, it's finding not much"
    },
    {
      "Time_Start": 1127.7600000000002,
      "Time_End": 1134.48,
      "Text": " because it's one of my lab environments that is relatively still. So I'll abort that. And"
    },
    {
      "Time_Start": 1134.48,
      "Time_End": 1141.0400000000002,
      "Text": " basically what you can also do is if I'm only caring about, for instance, the sessions,"
    },
    {
      "Time_Start": 1141.0400000000002,
      "Time_End": 1146.92,
      "Text": " I can actually tell it I only want to run, for instance, this query. And then I can just"
    },
    {
      "Time_Start": 1146.92,
      "Time_End": 1151.8000000000002,
      "Text": " run that. It actually finds two sessions. But let's say I haven't run it in a while"
    },
    {
      "Time_Start": 1151.8799999999999,
      "Time_End": 1157.72,
      "Text": " because I ran it on my laptop and I was traveling and had these kinds of things. I can also"
    },
    {
      "Time_Start": 1157.72,
      "Time_End": 1162.48,
      "Text": " give it a bigger loopback and it will override the default of 15 minutes. And now it actually"
    },
    {
      "Time_Start": 1162.48,
      "Time_End": 1169.08,
      "Text": " found 11, right? So it will update Neo4j for us, do all that kind of fancy stuff. And if"
    },
    {
      "Time_Start": 1169.08,
      "Time_End": 1174.72,
      "Text": " I, I'm not sure if it's actually correct, I can give it a debug and it will also give"
    },
    {
      "Time_Start": 1174.72,
      "Time_End": 1179.0,
      "Text": " me like all the raw output. So it will give me the JSON that I get back from, in this"
    },
    {
      "Time_Start": 1179.0,
      "Time_End": 1183.16,
      "Text": " case, Sentinel with all the query results. So I can see there's all kinds of stuff in"
    },
    {
      "Time_Start": 1183.16,
      "Time_End": 1189.38,
      "Text": " there. And then all the consecutive Cypher queries that it's actually generating and"
    },
    {
      "Time_Start": 1189.38,
      "Time_End": 1195.88,
      "Text": " updating my database with. So you can see that I set a source, in this case Falconaut,"
    },
    {
      "Time_Start": 1195.88,
      "Time_End": 1200.72,
      "Text": " so I can also query like how many sessions are in my database that I generated compared"
    },
    {
      "Time_Start": 1200.72,
      "Time_End": 1205.58,
      "Text": " to what is automatically imported. If you care about that stuff, it was primarily useful"
    },
    {
      "Time_Start": 1205.58,
      "Time_End": 1211.3799999999999,
      "Text": " for development purposes, but I left it in there just to have a stamp in your environment."
    },
    {
      "Time_Start": 1211.3799999999999,
      "Time_End": 1217.1399999999999,
      "Text": " And here you can see that basically I'm doing a merge of a user and a computer with a session."
    },
    {
      "Time_Start": 1217.1399999999999,
      "Time_End": 1224.78,
      "Text": " So that's one of the things that it can do. And then of course, on the other side, it"
    },
    {
      "Time_Start": 1224.78,
      "Time_End": 1231.4399999999998,
      "Text": " is equally interesting. So before I forget stuff, yeah. And basically what other things"
    },
    {
      "Time_Start": 1231.44,
      "Time_End": 1236.8,
      "Text": " is doing, what I actually wanted to show, but I copy pasted another one, is Defender"
    },
    {
      "Time_Start": 1236.8,
      "Time_End": 1243.0,
      "Text": " for Endpoints also logs CVEs on a machine because they're run Qualys Lite on it. And"
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1248.44,
      "Text": " they also flag it with a tag that says, is there a publicly known exploit for it? So"
    },
    {
      "Time_Start": 1248.44,
      "Time_End": 1254.88,
      "Text": " I built a query that looks for only hosts that have a CVE and a publicly known exploit."
    },
    {
      "Time_Start": 1254.88,
      "Time_End": 1259.76,
      "Text": " So technically it might be exploitable. So one of the things that we can then do is flag"
    },
    {
      "Time_Start": 1259.84,
      "Time_End": 1267.2,
      "Text": " that back to Neo4j. And the same, what they also do in Defender for Endpoints is they"
    },
    {
      "Time_Start": 1267.2,
      "Time_End": 1274.64,
      "Text": " look for machines that are publicly exposed. So how they do that is interesting. They host"
    },
    {
      "Time_Start": 1274.64,
      "Time_End": 1280.16,
      "Text": " it, I think on DigitalOcean, they have a box that is continuously scanning the whole internet"
    },
    {
      "Time_Start": 1280.16,
      "Time_End": 1287.48,
      "Text": " for ports. All those results, they are storing and they're sending, they're correlating on"
    },
    {
      "Time_Start": 1287.48,
      "Time_End": 1292.48,
      "Text": " the backend. So Defender for Endpoint also looks for incoming connections, right? And"
    },
    {
      "Time_Start": 1292.48,
      "Time_End": 1297.76,
      "Text": " if there's a match, then it's a publicly exposed port. And the reason why they do it from DigitalOcean,"
    },
    {
      "Time_Start": 1297.76,
      "Time_End": 1302.68,
      "Text": " like all attackers also do, but basically there's a lot of people that are whitelisting"
    },
    {
      "Time_Start": 1302.68,
      "Time_End": 1308.16,
      "Text": " or allowlisting the Azure IP space because they also use it for that same reason. And"
    },
    {
      "Time_Start": 1308.16,
      "Time_End": 1312.6,
      "Text": " sometimes they do that kind of stuff. So if they scan it from their own environment, that"
    },
    {
      "Time_Start": 1312.6,
      "Time_End": 1317.32,
      "Text": " might give a lot of false positives. Whereas if DigitalOcean can reach it, bad guys can"
    },
    {
      "Time_Start": 1317.32,
      "Time_End": 1323.48,
      "Text": " reach it too, so it's more relevant for you. So one of the things that I add there is also"
    },
    {
      "Time_Start": 1323.48,
      "Time_End": 1328.24,
      "Text": " that flag. So I've basically given and exposed this true flag if there is something open"
    },
    {
      "Time_Start": 1328.24,
      "Time_End": 1332.8,
      "Text": " on the internet. So if we look at it, we can actually see that this machine is actually"
    },
    {
      "Time_Start": 1332.8,
      "Time_End": 1340.12,
      "Text": " also exploitable apparently, but it's exposed. And then we can even, it's exposed since the"
    },
    {
      "Time_Start": 1340.12,
      "Time_End": 1347.24,
      "Text": " 9th, so two days ago. And the ports are 3389. So in this case, RDP is open to the internet"
    },
    {
      "Time_Start": 1347.24,
      "Time_End": 1353.52,
      "Text": " for this machine, which I still don't know if that's a problem. I can maybe look at if,"
    },
    {
      "Time_Start": 1353.52,
      "Time_End": 1358.92,
      "Text": " oh, it actually has some outbound object control, but this is Jonas's talk, so I'm not going"
    },
    {
      "Time_Start": 1358.92,
      "Time_End": 1366.72,
      "Text": " to look into that bit. But another one is I can have a look at like, hey, who has logged"
    },
    {
      "Time_Start": 1366.72,
      "Time_End": 1371.76,
      "Text": " onto this machine, right? So since I'm syncing everything, I can see that three users have"
    },
    {
      "Time_Start": 1371.76,
      "Time_End": 1378.52,
      "Text": " been, are logged onto this machine. So that might be already more interesting. In this case,"
    },
    {
      "Time_Start": 1378.52,
      "Time_End": 1383.8799999999999,
      "Text": " there's a sort of spoiler because you also see diamonds since it's a tiny lab. But this could"
    },
    {
      "Time_Start": 1383.8799999999999,
      "Time_End": 1389.0,
      "Text": " be an initial access vector for a user, right? They can password spray either one of those three"
    },
    {
      "Time_Start": 1389.0,
      "Time_End": 1396.04,
      "Text": " accounts. And basically then we can go into the little bit fancier cipher, and we can actually"
    },
    {
      "Time_Start": 1396.04,
      "Time_End": 1399.84,
      "Text": " see what would happen if this machine got compromised. And it's quite a lot that they"
    },
    {
      "Time_Start": 1399.84,
      "Time_End": 1406.12,
      "Text": " can access, right? So this is like half my domain. So this is actually the query that would run"
    },
    {
      "Time_Start": 1406.12,
      "Time_End": 1414.6,
      "Text": " through Falconhound, and that output, all these paths, are basically sent to Sentinel. So in"
    },
    {
      "Time_Start": 1414.6,
      "Time_End": 1425.1599999999999,
      "Text": " Sentinel, we get information like, first of all, like these exposed device to high values. So this"
    },
    {
      "Time_Start": 1425.16,
      "Time_End": 1431.64,
      "Text": " is an event ID that it generates. And every time I run, you'll, if there are results, you get a log"
    },
    {
      "Time_Start": 1431.64,
      "Time_End": 1440.44,
      "Text": " entry. It might be hard to read. Let me see if I can expand it a bit. Is that better? And I give"
    },
    {
      "Time_Start": 1440.44,
      "Time_End": 1447.48,
      "Text": " quite a lot of information. So what I also do is I add a query that the analyst could copy-paste"
    },
    {
      "Time_Start": 1447.48,
      "Time_End": 1454.88,
      "Text": " into Bloodhound and see what am I looking at, right? If this, I also give it as a list because"
    },
    {
      "Time_Start": 1455.0800000000002,
      "Time_End": 1461.4,
      "Text": " Sentinel can't show you graphs, and we need lists. So it will give you a list of all the stuff that"
    },
    {
      "Time_Start": 1461.4,
      "Time_End": 1467.92,
      "Text": " can be accessed. So this is not good, technically. So there's basically, they can get to anything"
    },
    {
      "Time_Start": 1467.92,
      "Time_End": 1475.2800000000002,
      "Text": " which you don't want to have. So if you can't parse this, then you can also just copy-paste that"
    },
    {
      "Time_Start": 1475.2800000000002,
      "Time_End": 1480.48,
      "Text": " same query that I actually just showed you in the UI. You can just copy-paste that. So that's sort"
    },
    {
      "Time_Start": 1480.48,
      "Time_End": 1489.96,
      "Text": " of a very basic demo of one of the capabilities. And then going back to slides because I'm kind of"
    },
    {
      "Time_Start": 1489.96,
      "Time_End": 1500.44,
      "Text": " behind already. And this scales quite well. So this is a screenshot of me running it at a 150,000"
    },
    {
      "Time_Start": 1500.44,
      "Time_End": 1508.64,
      "Text": " endpoint environment with 200,000 users and 80,000 servers. And it's probably not legible. It will"
    },
    {
      "Time_Start": 1508.64,
      "Time_End": 1515.3600000000001,
      "Text": " eat some memory, in this case like 50 gigs. That's primarily Neo4j being very hungry, being Java-based,"
    },
    {
      "Time_Start": 1515.3600000000001,
      "Time_End": 1523.5200000000002,
      "Text": " which everybody not likes so much. So anyway, to really give it a spurs, I also figured let's"
    },
    {
      "Time_Start": 1523.5200000000002,
      "Time_End": 1529.8400000000001,
      "Text": " collect all the sessions in that environment of the last two weeks, which you'll never do. But I"
    },
    {
      "Time_Start": 1529.8400000000001,
      "Time_End": 1538.4,
      "Text": " wanted to see the performance of the tool. So it got 340,000 sessions, and it took in maybe"
    },
    {
      "Time_Start": 1538.5600000000002,
      "Time_End": 1544.3200000000002,
      "Text": " two and a half minutes. What is it? Three and a half minutes to get that into Neo4j, which is"
    },
    {
      "Time_Start": 1544.3200000000002,
      "Time_End": 1551.0400000000002,
      "Text": " pretty cool because in the previous version of the tool, it took 15 minutes. But basically what"
    },
    {
      "Time_Start": 1551.0400000000002,
      "Time_End": 1556.16,
      "Text": " it's doing is it's looking up every user and then every computer and then making the"
    },
    {
      "Time_Start": 1556.16,
      "Time_End": 1562.0800000000002,
      "Text": " connection, right? So it has to do quite some transactions. And this is on a fairly stock"
    },
    {
      "Time_Start": 1562.0800000000002,
      "Time_End": 1568.3200000000002,
      "Text": " server. It's not on my laptop because that would take definitely longer. So yeah, in most environments"
    },
    {
      "Time_Start": 1568.32,
      "Time_End": 1575.4399999999998,
      "Text": " this would work, even with Neo4j. Some stuff just to show you basically how it looks on the"
    },
    {
      "Time_Start": 1575.4399999999998,
      "Time_End": 1582.56,
      "Text": " back end. It's the same. So we're looking at Neo4j where I'm sort of doing a similar query of a session"
    },
    {
      "Time_Start": 1582.56,
      "Time_End": 1587.9199999999998,
      "Text": " that I showed you earlier, and then you can see like how it would generate that hash session tag."
    },
    {
      "Time_Start": 1589.28,
      "Time_End": 1593.76,
      "Text": " The cool thing about Defender for Endpoint is that we can also collect that, but also on the"
    },
    {
      "Time_Start": 1593.76,
      "Time_End": 1600.56,
      "Text": " Sentinel side, we can collect logouts. But not everybody logs that because it's also noise."
    },
    {
      "Time_Start": 1601.36,
      "Time_End": 1606.48,
      "Text": " So one of the things that I also do is I time them out and that's configurable. I do it after"
    },
    {
      "Time_Start": 1606.48,
      "Time_End": 1612.08,
      "Text": " three days. I assume most sessions are dead, and otherwise there's probably some activity again"
    },
    {
      "Time_Start": 1612.08,
      "Time_End": 1617.76,
      "Text": " after the weekend and people will get a new update. But I don't delete the session."
    },
    {
      "Time_Start": 1618.72,
      "Time_End": 1624.16,
      "Text": " I replace it with sort of from the hash session to a had session, so a former session."
    },
    {
      "Time_Start": 1624.72,
      "Time_End": 1630.56,
      "Text": " And I record when I timed it out. And this is particularly useful since I'm also generating"
    },
    {
      "Time_Start": 1630.56,
      "Time_End": 1636.32,
      "Text": " alerts for an analyst. And if they copy-paste that query that I showed you earlier into the graph,"
    },
    {
      "Time_Start": 1636.32,
      "Time_End": 1641.12,
      "Text": " and it's like, hey, I don't see it. It's gone because I removed the session. But technically"
    },
    {
      "Time_Start": 1641.12,
      "Time_End": 1646.56,
      "Text": " the problem is still there, right? So we can't analyze it properly. So that's why I introduced"
    },
    {
      "Time_Start": 1646.56,
      "Time_End": 1651.6799999999998,
      "Text": " this. And also because it's quite likely that the user will be back. So that path is actually"
    },
    {
      "Time_Start": 1651.6799999999998,
      "Time_End": 1656.1599999999999,
      "Text": " very relevant. So that's one of the reasons why I started adding these kinds of things."
    },
    {
      "Time_Start": 1657.04,
      "Time_End": 1665.12,
      "Text": " So I keep on extending the schema. And maybe in hindsight, I might redesign some bits."
    },
    {
      "Time_Start": 1665.12,
      "Time_End": 1670.6399999999999,
      "Text": " But I have like a had session property or edge that I introduced. It has consent. So OAuth"
    },
    {
      "Time_Start": 1670.64,
      "Time_End": 1676.96,
      "Text": " consent. So I'm not sure if you were in the SaaS-based path attacks this morning. OAuth consent"
    },
    {
      "Time_Start": 1676.96,
      "Time_End": 1683.8400000000001,
      "Text": " is extremely well used by attackers, sadly. And we can see the scopes and everything from the logs"
    },
    {
      "Time_Start": 1683.8400000000001,
      "Time_End": 1688.72,
      "Text": " again and from the graph API. So we can, again, update our graphs so that we can see what the"
    },
    {
      "Time_Start": 1688.72,
      "Time_End": 1694.3200000000002,
      "Text": " attack paths on the Azure site at least are. And one of the other bits that I started playing with"
    },
    {
      "Time_Start": 1694.3200000000002,
      "Time_End": 1700.0,
      "Text": " is since I saw a lot of clients getting account hijacking where they would do some man in the"
    },
    {
      "Time_Start": 1700.0,
      "Time_End": 1706.56,
      "Text": " middle or necessary in the middle attack, add a second factor to the MFA like a backup one. So"
    },
    {
      "Time_Start": 1706.56,
      "Time_End": 1712.8,
      "Text": " even if you use the device authenticator thing from Microsoft, they might add a phone number"
    },
    {
      "Time_Start": 1712.8,
      "Time_End": 1717.6,
      "Text": " or an email address and say, hey, I don't have my phone right now, but I can access my email"
    },
    {
      "Time_Start": 1717.6,
      "Time_End": 1724.08,
      "Text": " and they can still log in. So that's a very useful one. And I have some examples that it"
    },
    {
      "Time_Start": 1724.08,
      "Time_End": 1728.88,
      "Text": " actually worked as well. And one of the things I was missing as well on the Azure side is the"
    },
    {
      "Time_Start": 1728.88,
      "Time_End": 1734.4,
      "Text": " roles are collected, but the eligibility. So like the privilege identity management components"
    },
    {
      "Time_Start": 1734.4,
      "Time_End": 1738.96,
      "Text": " where you technically don't have the role, but you can assign yourself the role, which is"
    },
    {
      "Time_Start": 1739.6000000000001,
      "Time_End": 1745.1200000000001,
      "Text": " for an attacker the same thing. I also started adding that. And on top of that, there's all"
    },
    {
      "Time_Start": 1745.1200000000001,
      "Time_End": 1750.96,
      "Text": " kinds of properties. It's way more than is on the screen, but all kinds of additional information"
    },
    {
      "Time_Start": 1750.96,
      "Time_End": 1757.5200000000002,
      "Text": " like the publicly known ports, but also the CVEs and these kinds of things. So how can we use this"
    },
    {
      "Time_Start": 1757.52,
      "Time_End": 1764.8,
      "Text": " as defenders, which is probably the most important bit, is a couple of things. So one of the things"
    },
    {
      "Time_Start": 1764.8,
      "Time_End": 1770.4,
      "Text": " is you could start building queries like this or copy pastes from the slide where I'm"
    },
    {
      "Time_Start": 1770.4,
      "Time_End": 1776.56,
      "Text": " looking at a deviation of paths. So I know what I have now in terms of paths, which I might have"
    },
    {
      "Time_Start": 1776.56,
      "Time_End": 1780.8799999999999,
      "Text": " investigated or can't do anything about. But if it grows, I want to know about it. So that's"
    },
    {
      "Time_Start": 1780.8799999999999,
      "Time_End": 1786.32,
      "Text": " basically what this query does, right? So if there are new paths or new steps in a path, I'll be"
    },
    {
      "Time_Start": 1786.32,
      "Time_End": 1791.9199999999998,
      "Text": " informed. And the way that looks from a practical side is, in this case, this is from a real client,"
    },
    {
      "Time_Start": 1792.8,
      "Time_End": 1799.52,
      "Text": " still on the old plot hound, but it doesn't really matter, where that user on the left was compromised"
    },
    {
      "Time_Start": 1801.4399999999998,
      "Time_End": 1807.12,
      "Text": " via a silly phishing attack. But I mean, it's a long path that the attacker has to take, but it's"
    },
    {
      "Time_Start": 1807.12,
      "Time_End": 1812.08,
      "Text": " just adding itself to certain groups and logging into the machine. And then all of a sudden,"
    },
    {
      "Time_Start": 1812.8799999999999,
      "Time_End": 1818.8,
      "Text": " they own the whole company, right? So it might be lengthy, but it's relevant. And it's actually"
    },
    {
      "Time_Start": 1818.8,
      "Time_End": 1825.36,
      "Text": " happening quite a bit. And the same for one of those other scenarios is where this is,"
    },
    {
      "Time_Start": 1826.1599999999999,
      "Time_End": 1833.04,
      "Text": " on the bottom, there's an SCCM server with a fairly old SQL version on it, which has RCE."
    },
    {
      "Time_Start": 1835.12,
      "Time_End": 1840.8799999999999,
      "Text": " And from there, it isn't that far to a full domain compromise if they wouldn't abuse the"
    },
    {
      "Time_Start": 1840.88,
      "Time_End": 1847.5200000000002,
      "Text": " SCCM in the first place, which is also very feasible, as we saw earlier today. So not necessarily"
    },
    {
      "Time_Start": 1847.5200000000002,
      "Time_End": 1852.72,
      "Text": " that the defender can do something about this, but for one of our clients, we're now also connecting"
    },
    {
      "Time_Start": 1852.72,
      "Time_End": 1857.68,
      "Text": " it to their vulnerability management system and their team. And they are actually using this now"
    },
    {
      "Time_Start": 1857.68,
      "Time_End": 1862.72,
      "Text": " as one of the inputs of prioritization of patching. And it might not be possible, but they can isolate"
    },
    {
      "Time_Start": 1862.72,
      "Time_End": 1866.16,
      "Text": " the host maybe a little bit more or something like that. I mean, the user doesn't necessarily"
    },
    {
      "Time_Start": 1866.16,
      "Time_End": 1872.24,
      "Text": " have to have access to SQL directly, these kinds of things. So they can do stuff about it at least."
    },
    {
      "Time_Start": 1872.24,
      "Time_End": 1881.0400000000002,
      "Text": " So it might scope broader than just the SOC. And you can do way more, right? So you know"
    },
    {
      "Time_Start": 1881.0400000000002,
      "Time_End": 1885.52,
      "Text": " the Kerberosable users because you can collect them from Bloodhound, like every user with an SPN."
    },
    {
      "Time_Start": 1886.0800000000002,
      "Time_End": 1891.92,
      "Text": " So if for some reason, this is the poorest lateral movement example ever, but that user starts"
    },
    {
      "Time_Start": 1891.92,
      "Time_End": 1898.0,
      "Text": " getting a session somewhere, we can do two things. So we can generate a watch list, which we can"
    },
    {
      "Time_Start": 1898.0,
      "Time_End": 1904.0800000000002,
      "Text": " correlate with our event logs and generate an alert that way, which is probably the most likely way a"
    },
    {
      "Time_Start": 1904.0800000000002,
      "Time_End": 1909.68,
      "Text": " SOC would do it. Or you can still use Bloodhound as well or the Neo4j database, run an action where"
    },
    {
      "Time_Start": 1909.68,
      "Time_End": 1914.4,
      "Text": " you can actually see, hey, I updated the session for a user, that user also has an SPN. So I'm writing"
    },
    {
      "Time_Start": 1914.4,
      "Time_End": 1919.2,
      "Text": " a log entry or do both, right? So you can have multiple options that way as well."
    },
    {
      "Time_Start": 1920.0,
      "Time_End": 1924.4,
      "Text": " I showed you this, where the query is usually also pasted in the sim, so you can"
    },
    {
      "Time_Start": 1924.96,
      "Time_End": 1930.32,
      "Text": " dynamically do stuff. Or take it a little bit further, where we're designing our own"
    },
    {
      "Time_Start": 1931.28,
      "Time_End": 1936.64,
      "Text": " investigation enrichment and analysis platform because we didn't like what was out there,"
    },
    {
      "Time_Start": 1936.64,
      "Time_End": 1941.76,
      "Text": " like everybody with open source also does, right? Why not another tool? And basically what we're"
    },
    {
      "Time_Start": 1941.76,
      "Time_End": 1946.96,
      "Text": " doing is we're getting every alert from our environment, getting all of the entities out, so"
    },
    {
      "Time_Start": 1946.96,
      "Time_End": 1953.52,
      "Text": " IPs, email addresses, whatever, and we're running all kinds of enrichers on top of it. And we can"
    },
    {
      "Time_Start": 1953.52,
      "Time_End": 1958.08,
      "Text": " provide additional context, like how many other alerts have been triggering in the environment,"
    },
    {
      "Time_Start": 1958.08,
      "Time_End": 1964.88,
      "Text": " that kind of stuff. But, and this is an older version, but still relevant, we can also check"
    },
    {
      "Time_Start": 1964.88,
      "Time_End": 1971.6000000000001,
      "Text": " already some relevant stuff. So how many outbinds things can that user control? And we can even"
    },
    {
      "Time_Start": 1972.4800000000002,
      "Time_End": 1979.2800000000002,
      "Text": " just with a small fork of the Docker container, we can also just implement it in the tool. So"
    },
    {
      "Time_Start": 1979.2800000000002,
      "Time_End": 1984.2400000000002,
      "Text": " now this is a screenshot, but we now have a live version where the analyst already has the query"
    },
    {
      "Time_Start": 1984.2400000000002,
      "Time_End": 1989.2,
      "Text": " ran that was in the log, and it can immediately visualize it as well instead of scrolling through"
    },
    {
      "Time_Start": 1989.2,
      "Time_End": 1996.2400000000002,
      "Text": " a long list. So that's actually quite useful. And then another cool thing is we can actually"
    },
    {
      "Time_Start": 1996.24,
      "Time_End": 2004.64,
      "Text": " see lateral movement as well. Well, technically we could, right? At least the likelihood of false"
    },
    {
      "Time_Start": 2004.64,
      "Time_End": 2010.72,
      "Text": " false, or the likelihood of lateral movement is there if you know a path and are more alerts"
    },
    {
      "Time_Start": 2010.72,
      "Time_End": 2019.1200000000001,
      "Text": " popping up along a path. We may be able to investigate that user now, because he hasn't"
    },
    {
      "Time_Start": 2019.1200000000001,
      "Time_End": 2024.48,
      "Text": " generated an alert yet, but we have to assume that the attacker is looking at the same data as we are,"
    },
    {
      "Time_Start": 2024.48,
      "Time_End": 2029.28,
      "Text": " even though we might have a richer set with all our very enrichments, but we can now take steps"
    },
    {
      "Time_Start": 2029.28,
      "Time_End": 2034.72,
      "Text": " as well. We might be able to block the user or isolate that machine so that the attacker at least"
    },
    {
      "Time_Start": 2034.72,
      "Time_End": 2040.4,
      "Text": " can't progress while we are also investigating that stuff. So we can be a little bit more proactive."
    },
    {
      "Time_Start": 2040.4,
      "Time_End": 2046.88,
      "Text": " That's kind of cool about it. The sad thing is that BHE doesn't really have that old indicator yet."
    },
    {
      "Time_Start": 2047.3600000000001,
      "Time_End": 2054.8,
      "Text": " So that's why the screenshot is from the old interface. But I mean, you can query it,"
    },
    {
      "Time_Start": 2054.8,
      "Time_End": 2060.1600000000003,
      "Text": " so you can also just, or fork and add it yourself. Technically also not that hard,"
    },
    {
      "Time_Start": 2061.04,
      "Time_End": 2067.2000000000003,
      "Text": " but maybe feature requests are just in there. Yeah, and then some real world stuff as well."
    },
    {
      "Time_Start": 2067.92,
      "Time_End": 2073.52,
      "Text": " Yeah, it's been mentioned a couple of times today, so I won't go into most of it. And if you haven't"
    },
    {
      "Time_Start": 2073.52,
      "Time_End": 2080.56,
      "Text": " read about it or heard about it, this video is epic. You have to watch that. So I tried actually"
    },
    {
      "Time_Start": 2080.56,
      "Time_End": 2086.88,
      "Text": " recreating that attack, which even the fault that Microsoft introduced into their own environment,"
    },
    {
      "Time_Start": 2086.88,
      "Time_End": 2092.72,
      "Text": " it's pretty hard to replicate. To get a enterprise app registration that is from a former tenant"
    },
    {
      "Time_Start": 2092.72,
      "Time_End": 2098.24,
      "Text": " and then trusted in the second tenant and able to do stuff, creating that is already not trivial,"
    },
    {
      "Time_Start": 2098.24,
      "Time_End": 2101.84,
      "Text": " at least not for me. It took me quite a bit and it's not documented, so you have to fiddle with"
    },
    {
      "Time_Start": 2101.84,
      "Time_End": 2107.2000000000003,
      "Text": " the graph API because there's no UI that allows you to do it. But basically this is sort of a"
    },
    {
      "Time_Start": 2107.2000000000003,
      "Time_End": 2112.32,
      "Text": " visual representation of how that initial factor looks, right? And now we know a little bit more"
    },
    {
      "Time_Start": 2112.32,
      "Time_End": 2116.96,
      "Text": " from the blog post from a couple of days ago that most likely password spraying was the initial"
    },
    {
      "Time_Start": 2116.96,
      "Time_End": 2122.8,
      "Text": " access factor. No surprise there. Apparently they didn't use MFA or not proper one, so it was"
    },
    {
      "Time_Start": 2122.8,
      "Time_End": 2128.2400000000002,
      "Text": " relatively easy to get into that dev environment. And from there they could laterally move along"
    },
    {
      "Time_Start": 2128.2400000000002,
      "Time_End": 2133.44,
      "Text": " the path. So one of the things again is what I collect is I collect all of the MFA information,"
    },
    {
      "Time_Start": 2133.44,
      "Time_End": 2139.5200000000004,
      "Text": " so I can see that this user has phone and email as their authentication methods. This is their"
    },
    {
      "Time_Start": 2139.5200000000004,
      "Time_End": 2144.88,
      "Text": " email address, this is their phone number. So there is some PII, but I mean the rest is PII as well."
    },
    {
      "Time_Start": 2145.6800000000003,
      "Time_End": 2150.6400000000003,
      "Text": " Also their preference you get from the graph API, so you can see what the preferred authentication"
    },
    {
      "Time_Start": 2150.64,
      "Time_End": 2158.56,
      "Text": " method is. And then in this case SMS is not allowed, so it's only phone recipient. So basically"
    },
    {
      "Time_Start": 2158.56,
      "Time_End": 2164.4,
      "Text": " you get a phone call from Azure like, hey are you this? And then you confirm. But you can also use"
    },
    {
      "Time_Start": 2164.4,
      "Time_End": 2170.4,
      "Text": " the email address. So in this case some Russian email address was added to it and that user can"
    },
    {
      "Time_Start": 2170.4,
      "Time_End": 2174.96,
      "Text": " use the same password and use the email address as the second factor to actually get stuff done."
    },
    {
      "Time_Start": 2175.6,
      "Time_End": 2180.8,
      "Text": " And one of the things we can now do as well, since we know these relationships, we can also see"
    },
    {
      "Time_Start": 2181.52,
      "Time_End": 2185.76,
      "Text": " what other shared MFA settings are there. Because sometimes there's account sharing,"
    },
    {
      "Time_Start": 2185.76,
      "Time_End": 2190.16,
      "Text": " sometimes account hijacking, sometimes it's both. So we can actually start building some"
    },
    {
      "Time_Start": 2190.16,
      "Time_End": 2196.8,
      "Text": " detections based on this, where we assume it's not relevant. So this is from a real environment,"
    },
    {
      "Time_Start": 2196.8,
      "Time_End": 2201.52,
      "Text": " that's why it's so tiny and you probably can't even see it. But there's like all kinds of small"
    },
    {
      "Time_Start": 2201.52,
      "Time_End": 2209.36,
      "Text": " clusters here of shared accounts with or accounts with shared MFA settings. And a slightly bigger"
    },
    {
      "Time_Start": 2209.36,
      "Time_End": 2216.8,
      "Text": " one is this example, which is for me illegible. Sorry about that, but it's probably the beamer,"
    },
    {
      "Time_Start": 2216.8,
      "Time_End": 2223.2,
      "Text": " blaming on tech. There's two really big pockets there and that's one of the things I learned,"
    },
    {
      "Time_Start": 2223.2,
      "Time_End": 2229.7599999999998,
      "Text": " is that a lot of teams, or at least a couple of clients, teams that build accounts for new"
    },
    {
      "Time_Start": 2230.2400000000002,
      "Time_End": 2234.48,
      "Text": " new hires, whatever, they use a placeholder phone number because they need to assign"
    },
    {
      "Time_Start": 2235.44,
      "Time_End": 2242.4,
      "Text": " one MFA factor on creation. That's just the Azure policy that they have. You need to have MFA."
    },
    {
      "Time_Start": 2242.4,
      "Time_End": 2246.88,
      "Text": " So even if you create a new account, it needs to have an MFA property already. Apparently that's a"
    },
    {
      "Time_Start": 2246.88,
      "Time_End": 2251.6800000000003,
      "Text": " technical thing and I wasn't aware of that. But these can be filtered out quite easily and for"
    },
    {
      "Time_Start": 2251.6800000000003,
      "Time_End": 2258.8,
      "Text": " some reason it looks like a ninja turtle to me. But this is also a real example from that, from"
    },
    {
      "Time_Start": 2258.8,
      "Time_End": 2268.0800000000004,
      "Text": " one of those clients, is where the user that is very blurred is a finance executive. And why the"
    },
    {
      "Time_Start": 2268.0800000000004,
      "Time_End": 2274.0,
      "Text": " hell does a finance executive need to share their phone number with four other accounts? So this"
    },
    {
      "Time_Start": 2274.0,
      "Time_End": 2279.44,
      "Text": " actually was a compromised user, so that's why I added it and heavily blurred it. But their phone"
    },
    {
      "Time_Start": 2279.44,
      "Time_End": 2285.04,
      "Text": " number was sort of not their phone number, but that not their phone number was also not one of"
    },
    {
      "Time_Start": 2285.04,
      "Time_End": 2290.24,
      "Text": " the phone numbers of one of those other ones. So it's basically hijacked accounts, where they"
    },
    {
      "Time_Start": 2290.24,
      "Time_End": 2296.08,
      "Text": " chained it to actually try to steal money, which they fortunately didn't. But still it was interesting"
    },
    {
      "Time_Start": 2296.08,
      "Time_End": 2301.04,
      "Text": " and there were no other alerts around those accounts. So still that was a pretty cool compromise."
    },
    {
      "Time_Start": 2302.4,
      "Time_End": 2308.48,
      "Text": " In terms of implementation, I would recommend, I mean you still need Sharp Hound and Azure Hound,"
    },
    {
      "Time_Start": 2308.48,
      "Time_End": 2313.7599999999998,
      "Text": " because from the original source you get way more information than logs. Logs are nice,"
    },
    {
      "Time_Start": 2314.5600000000004,
      "Time_End": 2319.84,
      "Text": " but they're very limited in some fashions as well. So you still want to get all that information. And"
    },
    {
      "Time_Start": 2319.84,
      "Time_End": 2325.44,
      "Text": " with Sharp Hound you can use LDAP filters to only do updates, right, so you can get smaller sets."
    },
    {
      "Time_Start": 2325.44,
      "Time_End": 2331.1200000000003,
      "Text": " I'm not aware of that Azure can do that, Azure Hound. I don't think so. Would be nice, because"
    },
    {
      "Time_Start": 2331.1200000000003,
      "Time_End": 2338.1600000000003,
      "Text": " some of those sets are humongous. I see nods. Oh cool, okay, I need to know that. And then on top"
    },
    {
      "Time_Start": 2338.1600000000003,
      "Time_End": 2343.1200000000003,
      "Text": " of that you can schedule Falcon Hound in a period you like. I would recommend 15 minutes, unless"
    },
    {
      "Time_Start": 2343.12,
      "Time_End": 2347.2,
      "Text": " your environment is that big that it can't cope with that, then set it to an hour, I don't care."
    },
    {
      "Time_Start": 2347.92,
      "Time_End": 2352.0,
      "Text": " But as frequent as you can, because you want to see that lateral movement stuff."
    },
    {
      "Time_Start": 2352.56,
      "Time_End": 2361.2799999999997,
      "Text": " So in terms of support, BHE is not supported yet, apart from sessions. I can do sessions, but in a"
    },
    {
      "Time_Start": 2361.8399999999997,
      "Time_End": 2367.44,
      "Text": " less preferred way. And the primary reason is, this is an event log, if you've never seen it,"
    },
    {
      "Time_Start": 2367.44,
      "Time_End": 2374.32,
      "Text": " it's pretty depressing, but they don't have the SID. And everything in BHE is SID based, and also"
    },
    {
      "Time_Start": 2374.32,
      "Time_End": 2382.32,
      "Text": " BHCE. So my workaround for CE is Neo4j, because I can directly access that to do anything I like,"
    },
    {
      "Time_Start": 2382.32,
      "Time_End": 2388.8,
      "Text": " which is very nice. But BHE doesn't have that capability for all the right reasons, because"
    },
    {
      "Time_Start": 2388.8,
      "Time_End": 2394.96,
      "Text": " they don't want you to fiddle with their database, since they have to support it. But the SID thing"
    },
    {
      "Time_Start": 2394.96,
      "Time_End": 2401.52,
      "Text": " is a problem, because one of the things I tried first was, every time I get a new session, for"
    },
    {
      "Time_Start": 2401.52,
      "Time_End": 2408.16,
      "Text": " instance, for a user, I queried the API of Bloodhound, got the SID, and then started doing the same for"
    },
    {
      "Time_Start": 2408.16,
      "Time_End": 2414.2400000000002,
      "Text": " the computer, and then updating it. That works, but if you have to do that for 5,000 sessions every 15"
    },
    {
      "Time_Start": 2414.2400000000002,
      "Time_End": 2420.48,
      "Text": " minutes, the API doesn't really like you as much as you might expect. So one of the things I now"
    },
    {
      "Time_Start": 2420.48,
      "Time_End": 2430.16,
      "Text": " built in the meantime is, on first run every day, I collect all the users and all the computers"
    },
    {
      "Time_Start": 2430.16,
      "Time_End": 2435.28,
      "Text": " in a local SQLite database, and I use that as a reference point, because that's like"
    },
    {
      "Time_Start": 2435.28,
      "Time_End": 2440.16,
      "Text": " 500 times quicker, but still not very preferable, right? Because we're storing all kinds of"
    },
    {
      "Time_Start": 2440.16,
      "Time_End": 2446.56,
      "Text": " information that we already have, so it's not very efficient. So that's something I know that the team"
    },
    {
      "Time_Start": 2446.56,
      "Time_End": 2452.64,
      "Text": " is aware of and working on, so that's going to be supported probably soon, hopefully. But at"
    },
    {
      "Time_Start": 2452.64,
      "Time_End": 2458.7999999999997,
      "Text": " least they're working on it, so that's great. Yeah, and why would you consider it if the examples"
    },
    {
      "Time_Start": 2458.7999999999997,
      "Time_End": 2463.12,
      "Text": " weren't clear enough? I mean, you would have up-to-date sessions, all kinds of paths, MFA settings,"
    },
    {
      "Time_Start": 2463.7599999999998,
      "Time_End": 2468.56,
      "Text": " alerts for durability information, so the use case is broader than only your identity team,"
    },
    {
      "Time_Start": 2468.56,
      "Time_End": 2476.48,
      "Text": " or only the SOC. I think you can apply it in multiple ways, and especially the"
    },
    {
      "Time_Start": 2476.48,
      "Time_End": 2481.7599999999998,
      "Text": " unexpected account sharing, I haven't found a better way of doing it. I also built some normal"
    },
    {
      "Time_Start": 2481.7599999999998,
      "Time_End": 2490.16,
      "Text": " SIEM logic for it, but it also relies on a time frame of data. So if the old hijack was two weeks"
    },
    {
      "Time_Start": 2490.16,
      "Time_End": 2496.56,
      "Text": " ago, that's sort of usually outside of your look-back scope, because that's very, very costly to run."
    },
    {
      "Time_Start": 2496.56,
      "Time_End": 2500.96,
      "Text": " So having a database that actually can be queried for that kind of stuff is very relevant."
    },
    {
      "Time_Start": 2502.08,
      "Time_End": 2506.0,
      "Text": " And the coolest bit is that you can continuously evaluate all the attack"
    },
    {
      "Time_Start": 2506.0,
      "Time_End": 2510.56,
      "Text": " paths in your environment and actually see it grow and shrink, hopefully shrink."
    },
    {
      "Time_Start": 2512.7999999999997,
      "Time_End": 2517.68,
      "Text": " Yeah, and the rest is, I think, the same. So also the IR team would love this, because they can also"
    },
    {
      "Time_Start": 2517.68,
      "Time_End": 2525.04,
      "Text": " see, they can basically trace back also how a user went through the attack or to the flows."
    },
    {
      "Time_Start": 2525.7599999999998,
      "Time_End": 2532.88,
      "Text": " So yeah, I kind of modified this thing, right? This is still the same, regardless if it's true or not,"
    },
    {
      "Time_Start": 2532.88,
      "Time_End": 2538.64,
      "Text": " but defenders can now also leverage these graphs to make more lists. And as long as this is true,"
    },
    {
      "Time_Start": 2538.64,
      "Time_End": 2546.08,
      "Text": " attackers won't be able to win, hopefully. So with that, tool's available, it's open source,"
    },
    {
      "Time_Start": 2546.64,
      "Time_End": 2552.64,
      "Text": " it's free, it will remain to be free, hopefully you use it, hopefully you give me either feedback"
    },
    {
      "Time_Start": 2552.64,
      "Time_End": 2559.52,
      "Text": " that it sucks or do a pull request with some awesome new queries. And with that,"
    },
    {
      "Time_Start": 2560.08,
      "Time_End": 2561.8399999999997,
      "Text": " I leave it to questions. Thank you."
    },
    {
      "Time_Start": 2568.7999999999997,
      "Time_End": 2575.6,
      "Text": " Oh yeah, and while flying over here with that nice white line, it actually also works on the"
    },
    {
      "Time_Start": 2575.6,
      "Time_End": 2580.8799999999997,
      "Text": " airplane Wi-Fi. It's slow, but it doesn't fail doing hundreds of API calls. Yes?"
    },
    {
      "Time_Start": 2581.6800000000003,
      "Time_End": 2589.12,
      "Text": " You mentioned that the Bloodhound API stuff is under development, the GitHub page says early"
    },
    {
      "Time_Start": 2590.4,
      "Time_End": 2597.04,
      "Text": " release. What are the specific limitations? Yeah, the primary limitation is that everything"
    },
    {
      "Time_Start": 2597.04,
      "Time_End": 2604.96,
      "Text": " needs to have a SID or an object ID in Neo4j language, which is not always available in the"
    },
    {
      "Time_Start": 2605.04,
      "Time_End": 2613.2,
      "Text": " data that I want to ship towards it. So I have to have either a lookup reference or a more"
    },
    {
      "Time_Start": 2613.2,
      "Time_End": 2619.04,
      "Text": " forgiving cipher. So you can do cipher over the Bloodhound API, but I can't do sets, I can't do"
    },
    {
      "Time_Start": 2619.04,
      "Time_End": 2626.4,
      "Text": " merges and some other things that I like to do. That's one of the reasons. The other reason is"
    },
    {
      "Time_Start": 2626.4,
      "Time_End": 2633.52,
      "Text": " that the whole team has built it with a certain use case, right? So they built a model and a"
    },
    {
      "Time_Start": 2633.52,
      "Time_End": 2638.08,
      "Text": " schema that is hard-coded into the code so that they can validate all the data that comes in."
    },
    {
      "Time_Start": 2639.04,
      "Time_End": 2645.36,
      "Text": " Is this what I expect? No, then I ignore it. And all that stuff that I showed you with additional"
    },
    {
      "Time_Start": 2645.36,
      "Time_End": 2652.4,
      "Text": " edges and properties isn't in that model, so it won't accept it stock. So those are the primary"
    },
    {
      "Time_Start": 2652.4,
      "Time_End": 2659.68,
      "Text": " reasons for now why I stopped developing it, because it's sort of, I'm banging my head against"
    },
    {
      "Time_Start": 2659.68,
      "Time_End": 2668.48,
      "Text": " a virtual wall, which doesn't give. So there's two options. I am talking to the team and they"
    },
    {
      "Time_Start": 2668.48,
      "Time_End": 2674.96,
      "Text": " are aware of most of it, so they're working on a way to support it, which is awesome. So in the"
    },
    {
      "Time_Start": 2674.96,
      "Time_End": 2680.7999999999997,
      "Text": " meantime, Neo4j is still supported as long as it is, so we can just use that for the open-source"
    },
    {
      "Time_Start": 2680.7999999999997,
      "Time_End": 2686.7999999999997,
      "Text": " version. For the closed-source version, then we have to wait for these functionalities."
    },
    {
      "Time_Start": 2687.76,
      "Time_End": 2690.0800000000004,
      "Text": " Any idea how long it might be?"
    },
    {
      "Time_Start": 2690.0800000000004,
      "Time_End": 2694.8,
      "Text": " No, I don't work for Spectra, so I have no influence over this at all. I can just make"
    },
    {
      "Time_Start": 2695.36,
      "Time_End": 2699.6800000000003,
      "Text": " suggestions what I would like to see, and that isn't a guarantee that it will come, because it's"
    },
    {
      "Time_Start": 2699.6800000000003,
      "Time_End": 2704.4,
      "Text": " their product and I can only... I'm just wondering how receptive they are."
    },
    {
      "Time_Start": 2704.4,
      "Time_End": 2710.96,
      "Text": " Very. Yeah, very. But they have their own backlog, their own time frames,"
    },
    {
      "Time_Start": 2710.96,
      "Time_End": 2714.6400000000003,
      "Text": " which I can't dictate, and I'm happy about that as well."
    },
    {
      "Time_Start": 2717.1200000000003,
      "Time_End": 2723.76,
      "Text": " Yeah, but it's very easy to talk to them and give them suggestions and make... Everybody can..."
    },
    {
      "Time_Start": 2723.76,
      "Time_End": 2726.48,
      "Text": " It's also partially open-source. Everybody can make a Git issue,"
    },
    {
      "Time_Start": 2727.1200000000003,
      "Time_End": 2730.7200000000003,
      "Text": " make a recommendation, and we'll be seriously treated."
    },
    {
      "Time_Start": 2739.84,
      "Time_End": 2744.2400000000002,
      "Text": " Yeah, I dark-mode Bloodhub because I didn't like the white thing."
    },
    {
      "Time_Start": 2747.76,
      "Time_End": 2759.1200000000003,
      "Text": " Oh. That worked directly with Neo4j? I wouldn't really know. There's billions of them,"
    },
    {
      "Time_Start": 2759.1200000000003,
      "Time_End": 2764.0,
      "Text": " but most of them you need to... The good thing about the Bloodhunt UI is that it's tailored"
    },
    {
      "Time_Start": 2764.0,
      "Time_End": 2770.0800000000004,
      "Text": " to the dataset it's expecting, so it can give you all these fancier tables and these kinds of things."
    },
    {
      "Time_Start": 2770.0800000000004,
      "Time_End": 2774.8,
      "Text": " So if you can work with that, I would still recommend that. The only thing I ran into on"
    },
    {
      "Time_Start": 2774.8,
      "Time_End": 2779.52,
      "Text": " large-scale environments is where the Bloodhunt UI has a different timeout than the Neo4j"
    },
    {
      "Time_Start": 2780.48,
      "Time_End": 2784.48,
      "Text": " native interface. So if you have a query that takes too long to process,"
    },
    {
      "Time_Start": 2785.1200000000003,
      "Time_End": 2789.76,
      "Text": " you'll get an error on the Bloodhunt interface, which the Neo4j instance won't."
    },
    {
      "Time_Start": 2790.96,
      "Time_End": 2794.1600000000003,
      "Text": " Just it looks ugly and it's annoying with all the bumpy thingies."
    },
    {
      "Time_Start": 2795.1200000000003,
      "Time_End": 2800.2400000000002,
      "Text": " I haven't looked further for other stuff. I usually just use the API and work with JSON"
    },
    {
      "Time_Start": 2800.88,
      "Time_End": 2805.0400000000004,
      "Text": " because it's quicker. Not helpful. Sorry. Yeah."
    },
    {
      "Time_Start": 2812.6400000000003,
      "Time_End": 2820.6400000000003,
      "Text": " Both. So everything that shows me a session, I'll use. So in the repo, everything is enabled,"
    },
    {
      "Time_Start": 2820.6400000000003,
      "Time_End": 2823.92,
      "Text": " so I wouldn't recommend doing that because why duplicating your efforts?"
    },
    {
      "Time_Start": 2824.64,
      "Time_End": 2831.12,
      "Text": " But yeah, so I don't have CrowdStrike API access yet because they don't like companies that also"
    },
    {
      "Time_Start": 2831.12,
      "Time_End": 2838.4,
      "Text": " do red teams. But yeah, as soon as I get an API for that, they probably also store a local logon"
    },
    {
      "Time_Start": 2838.4,
      "Time_End": 2848.32,
      "Text": " and maybe some other stuff. So I'll pull it from anywhere I can. Yeah. Yeah. I haven't seen one"
    },
    {
      "Time_Start": 2848.32,
      "Time_End": 2855.04,
      "Text": " that didn't. At least from the DC, right? Not from every local machine. So you'll have some"
    },
    {
      "Time_Start": 2855.6000000000004,
      "Time_End": 2860.88,
      "Text": " limitations into the local logons you won't see via Sentinel. That's why I also have the"
    },
    {
      "Time_Start": 2860.88,
      "Time_End": 2866.0,
      "Text": " Defender one. If you have Defender, go for that one. Because the cool thing about Defender,"
    },
    {
      "Time_Start": 2866.8,
      "Time_End": 2872.48,
      "Text": " I had to skip that slide due to time constraints, but Defender, apart from the device logon events,"
    },
    {
      "Time_Start": 2872.48,
      "Time_End": 2878.0,
      "Text": " as they call it, so that's basically 4624, but then in Defender, they also have a device"
    },
    {
      "Time_Start": 2878.0,
      "Time_End": 2883.84,
      "Text": " information table where they store all the currently logged on users. So if it's not in"
    },
    {
      "Time_Start": 2883.84,
      "Time_End": 2888.64,
      "Text": " there, you can already time it out and these kinds of things. So it's actually more capable"
    },
    {
      "Time_Start": 2888.64,
      "Time_End": 2894.8,
      "Text": " because it will show you way more. Yes. Are you using the Security Center API for everything in"
    },
    {
      "Time_Start": 2894.8,
      "Time_End": 2900.8,
      "Text": " Defender or are you actually having to go and do live response queries? I'm curious if there's"
    },
    {
      "Time_Start": 2900.8,
      "Time_End": 2904.96,
      "Text": " anything that you're actually having to query the device itself and it takes a while to run"
    },
    {
      "Time_Start": 2904.96,
      "Time_End": 2911.44,
      "Text": " the investigation package. Oh, no, I haven't needed that yet. But at some point, it's actually"
    },
    {
      "Time_Start": 2911.44,
      "Time_End": 2917.12,
      "Text": " a cool idea to get some additional stuff that you can't get from other information sources."
    },
    {
      "Time_Start": 2917.12,
      "Time_End": 2925.6,
      "Text": " Generally, I just use the Log Analytics SDK or the Defender, they now call it M365D,"
    },
    {
      "Time_Start": 2925.6,
      "Time_End": 2931.92,
      "Text": " or whatever it's going to be tomorrow since the MVP summit is going on. So yeah, I just use the"
    },
    {
      "Time_Start": 2931.92,
      "Time_End": 2938.64,
      "Text": " native APIs that they give us that are fully supported, which is for long-term best. Yes."
    },
    {
      "Time_Start": 2939.76,
      "Time_End": 2946.7200000000003,
      "Text": " Your suggestion in this slide is to run SharePound and Azure Pound infrequently and not collect session data."
    },
    {
      "Time_Start": 2946.7200000000003,
      "Time_End": 2954.32,
      "Text": " If you're already running them daily and collecting the session data, how does the session update that this does"
    },
    {
      "Time_Start": 2955.28,
      "Time_End": 2963.28,
      "Text": " play nice with the data that's already there? Yeah, it will only update stuff that is older."
    },
    {
      "Time_Start": 2964.56,
      "Time_End": 2970.0800000000004,
      "Text": " So the timeout, if you have a timeout set for three days and it checks after the third day"
    },
    {
      "Time_Start": 2970.0800000000004,
      "Time_End": 2976.0800000000004,
      "Text": " and the same session is still live at full time? No, because probably it's likely that there's"
    },
    {
      "Time_Start": 2976.0800000000004,
      "Time_End": 2981.2000000000003,
      "Text": " still activity. So if there's activity, that timer will be updated every Falcon Hounds run."
    },
    {
      "Time_Start": 2981.92,
      "Time_End": 2987.92,
      "Text": " So it's happy about that. And if you're worried that you might still have some stuff that it"
    },
    {
      "Time_Start": 2987.92,
      "Time_End": 2994.0000000000005,
      "Text": " times out, then you just disable that action to time it out. It's also an option. And it"
    },
    {
      "Time_Start": 2994.0000000000005,
      "Time_End": 2999.2000000000003,
      "Text": " also depends on how you're doing your path calculation. So if you have all your relationships"
    },
    {
      "Time_Start": 2999.2000000000003,
      "Time_End": 3004.1600000000003,
      "Text": " in your query that you are caring about, so like the hash session, then you either have to add"
    },
    {
      "Time_Start": 3004.1600000000003,
      "Time_End": 3010.2400000000002,
      "Text": " the hash session, or depending on the environment, how big it is and how efficient, you can also just"
    },
    {
      "Time_Start": 3010.2400000000002,
      "Time_End": 3016.1600000000003,
      "Text": " remove all the relations and have it look at everything. But that might be performance"
    },
    {
      "Time_Start": 3016.1600000000003,
      "Time_End": 3021.6000000000004,
      "Text": " intensive. So I wouldn't necessarily recommend that. But there's a fix for both sides."
    },
    {
      "Time_Start": 3025.6800000000003,
      "Time_End": 3029.6000000000004,
      "Text": " Cool. Thanks for all the questions."
    }
  ]
}