{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.38,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Alright, thanks for coming. Today's topic is hopefully a little eye-catching, maybe"
    },
    {
      "Time_Start": 14.38,
      "Time_End": 19.14,
      "Text": " brought you in the door to kind of hear what the topic today. Adversary Emulation is a"
    },
    {
      "Time_Start": 19.14,
      "Time_End": 27.8,
      "Text": " Fraud. This topic is A, highly controversial. B, is hopefully going to help uncover some"
    },
    {
      "Time_Start": 27.8,
      "Time_End": 33.5,
      "Text": " of the hidden, maybe not so hidden, truths that exist within the world of cyber security."
    },
    {
      "Time_Start": 33.5,
      "Time_End": 42.4,
      "Text": " So the goal of this talk is to figure out how to provide security to ourselves, to our"
    },
    {
      "Time_Start": 42.4,
      "Time_End": 50.64,
      "Text": " customers, to our clients, to our organizations, and do so amid the flurry of buzzwords that"
    },
    {
      "Time_Start": 50.64,
      "Time_End": 55.32,
      "Text": " we're used to seeing within technology and cyber security specifically. So I'm talking"
    },
    {
      "Time_Start": 55.32,
      "Time_End": 62.08,
      "Text": " about words such as adversary emulation, adversary simulation, artificial intelligence,"
    },
    {
      "Time_Start": 62.08,
      "Time_End": 69.16,
      "Text": " machine learning, big data. We are surrounded by words that are drowning us in the complexity"
    },
    {
      "Time_Start": 69.16,
      "Time_End": 77.44,
      "Text": " of their meaning instead of focusing on the pure basics that, if we're on this call, that"
    },
    {
      "Time_Start": 77.44,
      "Time_End": 85.2,
      "Text": " we are paid to do, which is to secure our organizations. Security in general can be"
    },
    {
      "Time_Start": 85.2,
      "Time_End": 93.03999999999999,
      "Text": " a complicated topic, but at its root, what we're solving for, what we should be optimizing"
    },
    {
      "Time_Start": 93.03999999999999,
      "Time_End": 100.96,
      "Text": " for, is a quite simplistic endpoint. So today's outline, what are we going to be doing? The"
    },
    {
      "Time_Start": 100.96,
      "Time_End": 106.84,
      "Text": " first thing we're going to do is outline what the actual problem is. What is the cyber security"
    },
    {
      "Time_Start": 106.84,
      "Time_End": 114.08,
      "Text": " problem? Why does complexity exist throughout the organizations that we used to work at?"
    },
    {
      "Time_Start": 114.08,
      "Time_End": 120.88000000000001,
      "Text": " Then let's zoom in on the problems security teams, red, blue, and purple, are actually"
    },
    {
      "Time_Start": 120.88000000000001,
      "Time_End": 127.68,
      "Text": " running into. Security teams, as opposed to companies without dedicated security, focus"
    },
    {
      "Time_Start": 127.68,
      "Time_End": 133.12,
      "Text": " on much different problem sets. They actually have a different language than most other"
    },
    {
      "Time_Start": 133.16,
      "Time_End": 139.28,
      "Text": " organizations that have IT and InfoSec actually have. Security teams understand purple teaming."
    },
    {
      "Time_Start": 139.28,
      "Time_End": 144.56,
      "Text": " They understand what an adversary is, an APT, an exploit, a vulnerability, a risk, a threat."
    },
    {
      "Time_Start": 144.56,
      "Time_End": 151.12,
      "Text": " These are topics that a typical IT department or even InfoSec and DevOps, it's a language"
    },
    {
      "Time_Start": 151.12,
      "Time_End": 155.20000000000002,
      "Text": " they're not used to hearing. So we're going to zoom in on the actual problems that security"
    },
    {
      "Time_Start": 155.20000000000002,
      "Time_End": 160.0,
      "Text": " teams face. And finally, we're going to actually determine how to solve the problems that we've"
    },
    {
      "Time_Start": 160.0,
      "Time_End": 164.0,
      "Text": " outlined. It's a lot of different avenues we're going to go through on this one. We're going to"
    },
    {
      "Time_Start": 164.0,
      "Time_End": 173.04,
      "Text": " try to take our best stab at how do you solve for the problems we meet. At the end of the day,"
    },
    {
      "Time_Start": 173.04,
      "Time_End": 178.16,
      "Text": " there's only one thing we should be questioning, which is how can I provide better security to my"
    },
    {
      "Time_Start": 178.16,
      "Time_End": 182.24,
      "Text": " organization? Ignore everything else. This is the route. This is what we're going to try to"
    },
    {
      "Time_Start": 182.24,
      "Time_End": 189.68,
      "Text": " optimize for. Who am I? Why you should listen to me? I am the CTO of Prelude Research and I"
    },
    {
      "Time_Start": 189.68,
      "Time_End": 196.24,
      "Text": " focus primarily on offensive security for defense. And so that intersects with a lot"
    },
    {
      "Time_Start": 196.24,
      "Time_End": 202.16,
      "Text": " of these buzzwords, which is why it's a topic of concern and interest to me, such as adversary"
    },
    {
      "Time_Start": 202.16,
      "Time_End": 208.72,
      "Text": " emulation, adversary simulation, red teaming, penetration testing. These terms often intersect"
    },
    {
      "Time_Start": 208.72,
      "Time_End": 213.92000000000002,
      "Text": " with offensive security. Now, outside of Prelude, I've spent the last couple of years doing things"
    },
    {
      "Time_Start": 213.92000000000002,
      "Time_End": 219.20000000000002,
      "Text": " like building MITRE's Caldera framework. I designed the second version of that. My handle"
    },
    {
      "Time_Start": 219.20000000000002,
      "Time_End": 224.08,
      "Text": " is privateducky on GitHub, so you can kind of see my involvement there. I've also spent a number of"
    },
    {
      "Time_Start": 224.08,
      "Time_End": 230.00000000000003,
      "Text": " years, probably 12 or so years, in under-the-cover roles at various organizations that range from"
    },
    {
      "Time_Start": 230.00000000000003,
      "Time_End": 236.96,
      "Text": " Rockwell Collins, which is a defense contractor out in Iowa, along with roles at places like John"
    },
    {
      "Time_Start": 236.96,
      "Time_End": 242.00000000000003,
      "Text": " Deere in software engineering and big data, roles at FireEye within red teaming and threat"
    },
    {
      "Time_Start": 242.0,
      "Time_End": 246.8,
      "Text": " intelligence, and a few disconnected years on and off at different security startups and"
    },
    {
      "Time_Start": 246.8,
      "Time_End": 251.84,
      "Text": " consulting roles. Through it all, what I actually do and what I've dedicated the last three or four"
    },
    {
      "Time_Start": 251.84,
      "Time_End": 258.56,
      "Text": " years of my life to is building autonomous systems which can hack into computers. Specifically in the"
    },
    {
      "Time_Start": 258.56,
      "Time_End": 266.88,
      "Text": " last year, my focus has been on Prelude Operator. Operator itself is a free, largely community-driven,"
    },
    {
      "Time_Start": 267.52,
      "Time_End": 272.4,
      "Text": " largely open-source framework, command and control framework, that focuses on bringing"
    },
    {
      "Time_Start": 272.4,
      "Time_End": 278.08,
      "Text": " security back down to the basics. So instead of fighting the complexity, semantics, even the"
    },
    {
      "Time_Start": 278.08,
      "Time_End": 284.15999999999997,
      "Text": " technology, here at Prelude, we actually believe the time that we spend should be spent solving"
    },
    {
      "Time_Start": 284.15999999999997,
      "Time_End": 289.52,
      "Text": " security problems, actually problems that objectively create more security for the"
    },
    {
      "Time_Start": 289.52,
      "Time_End": 294.08,
      "Text": " businesses, the organizations that we work for, instead of just solving problems to solve them."
    },
    {
      "Time_Start": 294.08,
      "Time_End": 299.68,
      "Text": " So that is our MO, that's our mission, and what I have been spending my life dedicated to."
    },
    {
      "Time_Start": 301.44,
      "Time_End": 307.84,
      "Text": " All right, stepping back into the cybersecurity problem, the 10,000-foot cybersecurity problem."
    },
    {
      "Time_Start": 308.88,
      "Time_End": 315.76,
      "Text": " What is cybersecurity? Now, before we dive into the problem specifically, let's go ahead and meet"
    },
    {
      "Time_Start": 315.76,
      "Time_End": 321.28,
      "Text": " a few of the personas. So we're going to see these friendly faces throughout this talk."
    },
    {
      "Time_Start": 321.28000000000003,
      "Time_End": 328.32000000000005,
      "Text": " These are categories of people that I just want you to be familiar with. So meet the executive,"
    },
    {
      "Time_Start": 328.96000000000004,
      "Time_End": 334.72,
      "Text": " meet the security vendor, meet the various components that make up an enterprise security"
    },
    {
      "Time_Start": 334.72,
      "Time_End": 339.84000000000003,
      "Text": " team. Red team or blue team, or a lot of us are purple teamers on the call. Underneath the technical"
    },
    {
      "Time_Start": 339.84000000000003,
      "Time_End": 345.84000000000003,
      "Text": " team, you typically end up with two different types of personas. Computer science grads,"
    },
    {
      "Time_Start": 346.48,
      "Time_End": 352.08000000000004,
      "Text": " those that have odd backgrounds. Computer science grads go through your typical bachelor's programs"
    },
    {
      "Time_Start": 352.8,
      "Time_End": 360.16,
      "Text": " at four-year colleges and have a formal education in the theory behind computer science, as well as"
    },
    {
      "Time_Start": 361.28000000000003,
      "Time_End": 366.72,
      "Text": " some hands-on experience maybe within software engineering fundamentals. Those with odd"
    },
    {
      "Time_Start": 366.72,
      "Time_End": 371.68,
      "Text": " backgrounds come from everything else. I fall into that category, a large number of us in security"
    },
    {
      "Time_Start": 371.68,
      "Time_End": 378.16,
      "Text": " actually fall into this. My personal background was as a journalism major and spending the first"
    },
    {
      "Time_Start": 378.16,
      "Time_End": 383.44,
      "Text": " year of my career as a print journalist, as a copy editor for a newspaper in Virginia. Now, a lot of"
    },
    {
      "Time_Start": 383.44,
      "Time_End": 388.0,
      "Text": " us come from those backgrounds. It could be literally anything. You meet a lot of very interesting"
    },
    {
      "Time_Start": 388.0,
      "Time_End": 392.08,
      "Text": " people within this industry, and it's something that I think actually makes the industry quite"
    },
    {
      "Time_Start": 392.08,
      "Time_End": 400.0,
      "Text": " interesting to work in. All right, so now that we've met the personas, let's try to figure out"
    },
    {
      "Time_Start": 400.08,
      "Time_End": 405.6,
      "Text": " what this whole cyber security thing is. So, if I were stepping back and saying I need to learn"
    },
    {
      "Time_Start": 405.6,
      "Time_End": 409.52,
      "Text": " what cyber security is, I need to, coming from an outside perspective, I need to"
    },
    {
      "Time_Start": 410.8,
      "Time_End": 418.8,
      "Text": " define what is cyber security. I would probably start by learning the legal. Now, here's a handful"
    },
    {
      "Time_Start": 419.36,
      "Time_End": 425.6,
      "Text": " of phrases and terms I may come across if I were googling cyber security, maybe even specifically"
    },
    {
      "Time_Start": 425.6,
      "Time_End": 430.64000000000004,
      "Text": " on the offensive side, because I'm interested in how to learn what cyber security is. I'll"
    },
    {
      "Time_Start": 430.64000000000004,
      "Time_End": 436.24,
      "Text": " come across terms like penetration testing, the various ways of describing adversary emulation,"
    },
    {
      "Time_Start": 436.24,
      "Time_End": 442.08000000000004,
      "Text": " simulation, cyber operations, red and purple teaming, and so forth. So, there's a lot of"
    },
    {
      "Time_Start": 442.08000000000004,
      "Time_End": 448.32000000000005,
      "Text": " things here. So, I may get pretty over my head quickly with understanding the lingo. So, I may"
    },
    {
      "Time_Start": 448.32000000000005,
      "Time_End": 453.92,
      "Text": " flip over and try to figure out what are the solutions. How do you perform and conduct"
    },
    {
      "Time_Start": 453.92,
      "Time_End": 458.24,
      "Text": " cyber security? Well, I would probably see antivirus signature scanning as a big one,"
    },
    {
      "Time_Start": 458.24,
      "Time_End": 463.84000000000003,
      "Text": " vulnerability scanning, manual security testing, and then the various endpoint monitoring,"
    },
    {
      "Time_Start": 463.84000000000003,
      "Time_End": 468.16,
      "Text": " detection, response, sims, centralized logging, all these tools that are out there."
    },
    {
      "Time_Start": 468.16,
      "Time_End": 473.6,
      "Text": " So, I could drown in those. So, I may look at the attackers. I may try to put the hat of an"
    },
    {
      "Time_Start": 473.6,
      "Time_End": 480.08000000000004,
      "Text": " adversary on and say, hey, how can I understand cyber security through their lens? So, now we're"
    },
    {
      "Time_Start": 480.08,
      "Time_End": 486.08,
      "Text": " talking nation state hackers. We're talking financial attackers. We're talking adversary"
    },
    {
      "Time_Start": 486.08,
      "Time_End": 492.4,
      "Text": " script kiddies, unk groups, unclassified attackers. The list goes on and on there as well."
    },
    {
      "Time_Start": 492.4,
      "Time_End": 498.15999999999997,
      "Text": " So, I may say, no big deal. I will get educated. So, I check out Google and I say, give me a"
    },
    {
      "Time_Start": 498.15999999999997,
      "Time_End": 503.44,
      "Text": " cyber security certificate. That will solve my problem. The industry is full of certificates,"
    },
    {
      "Time_Start": 503.44,
      "Time_End": 510.24,
      "Text": " as we're all aware of. There's an entire funnel of certificates a person can go through,"
    },
    {
      "Time_Start": 510.8,
      "Time_End": 515.76,
      "Text": " keep up on as they expire, renew, and so forth. There are dozens of certificates. I tossed out"
    },
    {
      "Time_Start": 515.76,
      "Time_End": 522.0,
      "Text": " a few that may ring a bell for people on the call. And then you may say, well, I need my certified"
    },
    {
      "Time_Start": 522.0,
      "Time_End": 531.6,
      "Text": " ethical hacker certificate. I may need OSCP. I may need CISA. I may need security plus. I may need"
    },
    {
      "Time_Start": 531.6,
      "Time_End": 536.64,
      "Text": " whatever. Now, a lot of these do have overlapping information. How do I determine which of these"
    },
    {
      "Time_Start": 536.64,
      "Time_End": 542.48,
      "Text": " certificates is the correct one for me in my case? Well, that can be a little tricky to figure out."
    },
    {
      "Time_Start": 542.48,
      "Time_End": 547.2,
      "Text": " So, I'll say, you know, before I do any of that, I'm going to go ahead and learn cyber security on"
    },
    {
      "Time_Start": 547.2,
      "Time_End": 552.8000000000001,
      "Text": " my own. So, the way I do that, I'll probably Google the tools I could use. This is a very"
    },
    {
      "Time_Start": 552.8000000000001,
      "Time_End": 558.8000000000001,
      "Text": " small list of the tools that are at my disposal in the cyber security realm. A lot of us use"
    },
    {
      "Time_Start": 558.8000000000001,
      "Time_End": 564.6400000000001,
      "Text": " open source tools. So, the large bulk of these tools will be in that category. Now, open source"
    },
    {
      "Time_Start": 564.6400000000001,
      "Time_End": 571.0400000000001,
      "Text": " tools come and go. A popular open source tool may spend a couple of years, maybe more. Gaining"
    },
    {
      "Time_Start": 571.0400000000001,
      "Time_End": 576.8000000000001,
      "Text": " popularity as an author or an owner of a project has time and energy to put toward maintaining the"
    },
    {
      "Time_Start": 576.8000000000001,
      "Time_End": 583.5200000000001,
      "Text": " project. Over time, because cyber security people are not software engineers, projects tend to hit"
    },
    {
      "Time_Start": 583.52,
      "Time_End": 589.68,
      "Text": " a point where they become unsustainable from the technology aspect. So, it becomes more difficult"
    },
    {
      "Time_Start": 589.68,
      "Time_End": 594.96,
      "Text": " to maintain the project, therefore more time consuming. And in the open source, that usually"
    },
    {
      "Time_Start": 594.96,
      "Time_End": 599.92,
      "Text": " means a project gets abandoned. And so, this happens more times than it does not. And so,"
    },
    {
      "Time_Start": 599.92,
      "Time_End": 604.64,
      "Text": " after a couple of years, you will typically see an open source project start to lose popularity"
    },
    {
      "Time_Start": 604.64,
      "Time_End": 610.72,
      "Text": " because it is not being updated. And what happens in its place? A new tool will rise from the ashes"
    },
    {
      "Time_Start": 610.72,
      "Time_End": 616.4,
      "Text": " and start to fill that need. Now, I may look at this and say, well, that's a pretty big list of"
    },
    {
      "Time_Start": 616.4,
      "Time_End": 622.08,
      "Text": " tools. So, let me focus on languages, computer languages. Now, we've got Python, Bash, PowerShell,"
    },
    {
      "Time_Start": 622.96,
      "Time_End": 628.08,
      "Text": " all the C variants, maybe some JavaScript. How do I determine which one of these I should focus"
    },
    {
      "Time_Start": 628.08,
      "Time_End": 633.84,
      "Text": " my energy on? Maybe C++, PowerShell. Which one's more important? Should I know how pointers are"
    },
    {
      "Time_Start": 633.84,
      "Time_End": 638.4,
      "Text": " done in C or should I learn the four different ways of formatting strings in Python? These are"
    },
    {
      "Time_Start": 638.4,
      "Time_End": 643.84,
      "Text": " the questions I may have to face early on in my cybersecurity journey. So, I may flip over and say,"
    },
    {
      "Time_Start": 643.84,
      "Time_End": 651.76,
      "Text": " let's look at the frameworks. How do I categorize risk in cybersecurity? I can use NIST. That'll"
    },
    {
      "Time_Start": 651.76,
      "Time_End": 656.3199999999999,
      "Text": " give me a little bit of a framework for understanding how to classify that. What about"
    },
    {
      "Time_Start": 656.3199999999999,
      "Time_End": 661.84,
      "Text": " ATT&CK? Well, that's going to give me a nice common language and a nice way to describe risk as well as"
    },
    {
      "Time_Start": 661.84,
      "Time_End": 666.96,
      "Text": " cybersecurity. What about Lockheed Martin's cyber kill chain? And the list goes on here as well."
    },
    {
      "Time_Start": 667.84,
      "Time_End": 672.5600000000001,
      "Text": " Okay. So, there's a lot of complexity. That's kind of the point I'm driving at here,"
    },
    {
      "Time_Start": 672.5600000000001,
      "Time_End": 678.64,
      "Text": " whether we're talking lingo, education, tools and processes, there is a lot of complexity"
    },
    {
      "Time_Start": 678.64,
      "Time_End": 685.52,
      "Text": " and no singular path that we as security professionals are driving toward or pushing"
    },
    {
      "Time_Start": 685.52,
      "Time_End": 692.24,
      "Text": " forward in. Therefore, we're essentially drowning in complexity behind all of the many options that"
    },
    {
      "Time_Start": 692.24,
      "Time_End": 701.04,
      "Text": " exist for us. So, let's take a look at what this means in the real world. So, we've got two types"
    },
    {
      "Time_Start": 701.04,
      "Time_End": 706.4,
      "Text": " of personas on screen. Those that come from computer science backgrounds. Those that come"
    },
    {
      "Time_Start": 706.4,
      "Time_End": 714.48,
      "Text": " from our backgrounds. We talked about this before. Now, these troops meld together. This is almost"
    },
    {
      "Time_Start": 714.48,
      "Time_End": 719.76,
      "Text": " every security team out there and almost every organization, whether they are a security-focused"
    },
    {
      "Time_Start": 719.76,
      "Time_End": 725.9200000000001,
      "Text": " organization or an organization that does security. You have a security team that is mixed of people"
    },
    {
      "Time_Start": 725.9200000000001,
      "Time_End": 730.08,
      "Text": " that know different lingos, that come from different educations, that are used to using"
    },
    {
      "Time_Start": 730.08,
      "Time_End": 735.52,
      "Text": " different tools and that are used to following different processes in order to conduct security."
    },
    {
      "Time_Start": 736.08,
      "Time_End": 742.24,
      "Text": " Now, aside from the security team, which is kind of mixed and running independently, you've got the"
    },
    {
      "Time_Start": 742.24,
      "Time_End": 749.04,
      "Text": " security executives kind of living up in this separate world up here and they are typically"
    },
    {
      "Time_Start": 749.04,
      "Time_End": 756.16,
      "Text": " bouncing around to places like RSA, Blackhats. They are talking to the board at the company."
    },
    {
      "Time_Start": 756.16,
      "Time_End": 762.4,
      "Text": " Now, their concern is ensuring that the company is protected, but they're doing so from a different"
    },
    {
      "Time_Start": 762.4,
      "Time_End": 766.96,
      "Text": " perspective. It's a much higher perspective than the boots on the ground security folks."
    },
    {
      "Time_Start": 766.96,
      "Time_End": 771.44,
      "Text": " Now, the executive is meeting. They're a little unhappy at this point because they're being sold."
    },
    {
      "Time_Start": 771.44,
      "Time_End": 777.44,
      "Text": " They're being wined and dined. They're being sold by security vendors who are promising the move."
    },
    {
      "Time_Start": 778.0,
      "Time_End": 784.6400000000001,
      "Text": " Now, the security executive will buy a product and say this fancy expensive product, whether it's"
    },
    {
      "Time_Start": 784.6400000000001,
      "Time_End": 791.2800000000001,
      "Text": " offense or defensive based, and they'll say, yeah, this will work in my system. So I'll push this"
    },
    {
      "Time_Start": 791.2800000000001,
      "Time_End": 798.24,
      "Text": " product down market to my security team. I'm going to have my security team add this product into"
    },
    {
      "Time_Start": 798.24,
      "Time_End": 805.28,
      "Text": " their offerings, into their tools, and use that to do security. Now, sometimes that can be good."
    },
    {
      "Time_Start": 805.28,
      "Time_End": 810.64,
      "Text": " Most of the time that can be bad. The security team may receive the product and instructions"
    },
    {
      "Time_Start": 810.64,
      "Time_End": 814.5600000000001,
      "Text": " from the executive and may actually put it on the shelf. I've seen this a lot. They'll put it on the"
    },
    {
      "Time_Start": 814.5600000000001,
      "Time_End": 820.24,
      "Text": " shelf. They'll never even use it. It'll just sit there. Other times it will get maybe set up,"
    },
    {
      "Time_Start": 820.24,
      "Time_End": 826.16,
      "Text": " maybe configured, maybe it'll actually be used once in a while. But this is the process. And"
    },
    {
      "Time_Start": 826.16,
      "Time_End": 831.76,
      "Text": " because the executive is purchasing these products, you end up with many security vendors."
    },
    {
      "Time_Start": 831.76,
      "Time_End": 835.52,
      "Text": " If you've been to RSA or Black Hat, you've seen this. You've seen all the booths. Now, all of"
    },
    {
      "Time_Start": 835.52,
      "Time_End": 842.9599999999999,
      "Text": " these security vendors are selling to the executive who continues to purchase products, often overlapping"
    },
    {
      "Time_Start": 842.9599999999999,
      "Time_End": 849.36,
      "Text": " products, and they push them down to the team. It's not uncommon for a larger organization"
    },
    {
      "Time_Start": 850.08,
      "Time_End": 857.6,
      "Text": " to have purchased upwards of two dozen security tools, often overlapping in what they actually do,"
    },
    {
      "Time_Start": 857.6,
      "Time_End": 861.12,
      "Text": " and they push them down to their security teams and ask them to use them."
    },
    {
      "Time_Start": 863.04,
      "Time_End": 868.88,
      "Text": " All right, let's zoom in. So, high resolution now. So, what is the security problem for us?"
    },
    {
      "Time_Start": 868.88,
      "Time_End": 874.5600000000001,
      "Text": " Boots on the ground, security people in the red, blue, purple space, we're in charge of securing"
    },
    {
      "Time_Start": 874.5600000000001,
      "Time_End": 881.9200000000001,
      "Text": " our organizations. How does this problem, this cyclical problem of how products are purchased"
    },
    {
      "Time_Start": 881.9200000000001,
      "Time_End": 887.36,
      "Text": " and how they're pushed down to us, how does that create an even bigger issue for us? So,"
    },
    {
      "Time_Start": 887.36,
      "Time_End": 894.4000000000001,
      "Text": " it's not actually complexity that sneaks in and kills the cat. It is fraud. It is the concept"
    },
    {
      "Time_Start": 894.4000000000001,
      "Time_End": 902.4000000000001,
      "Text": " that we are drowning in so much complexity, and we're given so many tools that we are unable"
    },
    {
      "Time_Start": 902.48,
      "Time_End": 907.92,
      "Text": " to differentiate and to determine which are the correct tools for us, what are providing"
    },
    {
      "Time_Start": 907.92,
      "Time_End": 912.72,
      "Text": " security, which ones are not, and that complexity is really hindering us from doing our job. So,"
    },
    {
      "Time_Start": 913.28,
      "Time_End": 918.3199999999999,
      "Text": " let's zoom in a bit. So, before we do that, we are going to take a quick two-minute detour"
    },
    {
      "Time_Start": 918.3199999999999,
      "Time_End": 920.0,
      "Text": " and watch a video clip."
    },
    {
      "Time_Start": 920.8,
      "Time_End": 931.6,
      "Text": " Uh-oh. Okay, okay, nobody panic. Listen up, listen up. Everyone, follow me to the shelter."
    },
    {
      "Time_Start": 931.6,
      "Time_End": 938.96,
      "Text": " We've got enough food for 14 days. Space heater and fan."
    },
    {
      "Time_Start": 938.96,
      "Time_End": 947.9200000000001,
      "Text": " Uh, it's saying server, I think. So, if I put that password, otherwise we can't do anything."
    },
    {
      "Time_Start": 947.9200000000001,
      "Time_End": 960.1600000000001,
      "Text": " Uh, what's my password? Try 0-0-0. 0-0-0. Okay, now try 0-0-0. 0-0-1."
    },
    {
      "Time_Start": 962.1600000000001,
      "Time_End": 964.88,
      "Text": " Wait, does anyone remember when it was set up?"
    },
    {
      "Time_Start": 964.88,
      "Time_End": 967.04,
      "Text": " Uh, was it eight years ago?"
    },
    {
      "Time_Start": 967.04,
      "Time_End": 971.6,
      "Text": " I don't know, I'm just trying to think of what happened in time."
    },
    {
      "Time_Start": 971.6,
      "Time_End": 973.6,
      "Text": " I don't understand what's happening."
    },
    {
      "Time_Start": 974.8,
      "Time_End": 976.4,
      "Text": " I'm just telling you, I don't see what I'm setting up."
    },
    {
      "Time_Start": 978.56,
      "Time_End": 983.4399999999999,
      "Text": " Okay, we'll do it backwards. Our IT guys have to think. Glasses, turbine, ear pair,"
    },
    {
      "Time_Start": 983.4399999999999,
      "Time_End": 990.8,
      "Text": " fatty-free, shorts, fatty-two, blossom, and time stone. Think, blossom, time stone."
    },
    {
      "Time_Start": 990.8,
      "Time_End": 992.16,
      "Text": " I got it. Fry up."
    },
    {
      "Time_Start": 995.76,
      "Time_End": 997.76,
      "Text": " It made me laugh when I heard it."
    },
    {
      "Time_Start": 999.76,
      "Time_End": 1000.56,
      "Text": " Big boobs."
    },
    {
      "Time_Start": 1002.16,
      "Time_End": 1003.52,
      "Text": " Cowboy, Lizzie."
    },
    {
      "Time_Start": 1005.04,
      "Time_End": 1006.48,
      "Text": " You're taking the wrong step."
    },
    {
      "Time_Start": 1007.36,
      "Time_End": 1008.48,
      "Text": " Try big boobs, Lizzie."
    },
    {
      "Time_Start": 1010.48,
      "Time_End": 1010.96,
      "Text": " Password."
    },
    {
      "Time_Start": 1012.0,
      "Time_End": 1016.24,
      "Text": " Right, yes. The important thing is, this kept us secure, people."
    },
    {
      "Time_Start": 1016.24,
      "Time_End": 1029.28,
      "Text": " You know, as unbelievable as it sounds, what we just watched is not too abnormal."
    },
    {
      "Time_Start": 1029.28,
      "Time_End": 1037.2,
      "Text": " If we are honest with ourselves, we may actually exist and work at an organization that mimics that"
    },
    {
      "Time_Start": 1037.2,
      "Time_End": 1042.24,
      "Text": " pretty closely. I can't tell you the number of times I have worked at an organization"
    },
    {
      "Time_Start": 1042.96,
      "Time_End": 1051.28,
      "Text": " that runs everything passwordless because it is easier for the technical people to navigate and do"
    },
    {
      "Time_Start": 1051.28,
      "Time_End": 1055.2,
      "Text": " their daily job. It isn't even at security organizations that have had that policy."
    },
    {
      "Time_Start": 1056.48,
      "Time_End": 1066.56,
      "Text": " Now, let's take a detour and look at what would happen if we attempted to"
    },
    {
      "Time_Start": 1066.56,
      "Time_End": 1071.36,
      "Text": " hack into, as an adversary, Dunder Mifflin paper company."
    },
    {
      "Time_Start": 1073.1200000000001,
      "Time_End": 1077.36,
      "Text": " Now, how would a red and blue exercise go in this type of environment?"
    },
    {
      "Time_Start": 1077.36,
      "Time_End": 1082.48,
      "Text": " So, if we were called in and said, hey, maybe not from that adversarial standpoint, but as a"
    },
    {
      "Time_Start": 1082.48,
      "Time_End": 1087.68,
      "Text": " red teamer and blue teamer, if we were called in and said, hey, let's go ahead and do an exercise"
    },
    {
      "Time_Start": 1088.16,
      "Time_End": 1094.16,
      "Text": " on the office, what would we do? What would it look like? Now, or how should it go, anyway?"
    },
    {
      "Time_Start": 1094.16,
      "Time_End": 1100.0,
      "Text": " Now, here is the blueprint of the office. We could gain this through open source intelligence"
    },
    {
      "Time_Start": 1100.96,
      "Time_End": 1105.84,
      "Text": " gathering. No problem. That would not be an issue. It's nine seasons of the television show."
    },
    {
      "Time_Start": 1105.84,
      "Time_End": 1112.32,
      "Text": " We could get access to this. Now, the very first thing to understand is the blue team."
    },
    {
      "Time_Start": 1112.32,
      "Time_End": 1119.36,
      "Text": " They are probably situated over here in the annex where they're kind of pushed off to the side,"
    },
    {
      "Time_Start": 1119.36,
      "Time_End": 1125.12,
      "Text": " plenty of room for monitors, sit over by Toby. And of course, you've got the one blue teamer who is"
    },
    {
      "Time_Start": 1125.2,
      "Time_End": 1130.3200000000002,
      "Text": " notorious for being inside of the break room all the time while everybody else is kind of"
    },
    {
      "Time_Start": 1130.3200000000002,
      "Time_End": 1137.5200000000002,
      "Text": " tinkering away looking at logs. Now, you may also have the red team that gets siphoned off into a"
    },
    {
      "Time_Start": 1137.5200000000002,
      "Time_End": 1143.44,
      "Text": " conference room, unannounced, unnoticed, and are placed there during the red team exercise."
    },
    {
      "Time_Start": 1144.64,
      "Time_End": 1150.96,
      "Text": " And of course, you've got the targets. Now, the red team would probably want to target Ryan"
    },
    {
      "Time_Start": 1150.96,
      "Time_End": 1157.92,
      "Text": " because he has wolf.com. He has the technical expertise within the office based on the open"
    },
    {
      "Time_Start": 1157.92,
      "Time_End": 1163.44,
      "Text": " source intelligence. You'd probably also want to hit up the accounting department. They have the"
    },
    {
      "Time_Start": 1163.44,
      "Time_End": 1169.92,
      "Text": " crown jewels. They have the financial data for the organization. And so the red team may,"
    },
    {
      "Time_Start": 1169.92,
      "Time_End": 1176.0,
      "Text": " in an ideal world, attempt to infiltrate that accounting department, probably through Kevin,"
    },
    {
      "Time_Start": 1176.0,
      "Time_End": 1182.96,
      "Text": " who would be the target I would go after. And then from Kevin's computer, which is probably"
    },
    {
      "Time_Start": 1182.96,
      "Time_End": 1188.16,
      "Text": " full of malware based on the sites the office television show shows him going to, we'd probably"
    },
    {
      "Time_Start": 1188.16,
      "Time_End": 1193.68,
      "Text": " be able to attempt a lateral movement tactic over to Ryan's computer, where we would expect to have"
    },
    {
      "Time_Start": 1193.68,
      "Time_End": 1200.48,
      "Text": " larger system privileges. And from Ryan's computer, we would attempt to move laterally to Michael's,"
    },
    {
      "Time_Start": 1200.48,
      "Time_End": 1205.52,
      "Text": " who is the boss, which is where we'd probably have our finale of an attack and attempt to"
    },
    {
      "Time_Start": 1205.52,
      "Time_End": 1211.52,
      "Text": " exfiltrate the boss's emails, among other private information. Now, the purple team would pop in"
    },
    {
      "Time_Start": 1212.56,
      "Time_End": 1217.28,
      "Text": " during this exercise, in the middle of the exercise, and start to work with the red and blue"
    },
    {
      "Time_Start": 1217.28,
      "Time_End": 1224.4,
      "Text": " teams in order to ensure it goes smooth, to ensure the blue team is learning and remediating"
    },
    {
      "Time_Start": 1225.04,
      "Time_End": 1229.28,
      "Text": " to the types of attacks that are occurring. And the purple team is there as the"
    },
    {
      "Time_Start": 1229.28,
      "Time_End": 1236.8799999999999,
      "Text": " layer of communication between red and blue. Now, that is how it should go. Now, let's look at a"
    },
    {
      "Time_Start": 1236.8799999999999,
      "Time_End": 1243.44,
      "Text": " typical red-blue exercise and how it actually goes. Same blue team, maybe slightly smaller,"
    },
    {
      "Time_Start": 1243.44,
      "Time_End": 1250.16,
      "Text": " still sitting in the annex. That's where they are. Red team ushered into the conference room"
    },
    {
      "Time_Start": 1250.16,
      "Time_End": 1258.3999999999999,
      "Text": " unannounced. So far, so good. Now, two days later, nothing has changed. That is typical."
    },
    {
      "Time_Start": 1258.4,
      "Time_End": 1264.16,
      "Text": " The first two days, the blue team is blissfully unaware the red team is there. The red team has"
    },
    {
      "Time_Start": 1264.16,
      "Time_End": 1270.8000000000002,
      "Text": " spent two days setting up tooling and is just now ready to go. That may be operating systems,"
    },
    {
      "Time_Start": 1270.8000000000002,
      "Time_End": 1277.6000000000001,
      "Text": " command and control centers, connecting to the network, getting a single foothold into the system,"
    },
    {
      "Time_Start": 1277.6000000000001,
      "Time_End": 1282.5600000000002,
      "Text": " even if it's white card. There's a number of things that can go wrong. The expectation is,"
    },
    {
      "Time_Start": 1282.56,
      "Time_End": 1286.96,
      "Text": " this is kind of how it actually goes. Takes a couple days to get off and running. Now,"
    },
    {
      "Time_Start": 1288.32,
      "Time_End": 1293.28,
      "Text": " we'll say they find a target. It's not Ryan, not the accounting department. They're going after"
    },
    {
      "Time_Start": 1293.28,
      "Time_End": 1299.9199999999998,
      "Text": " whoever they can get. And that may not be the most ideal target or not. And so, we'll say they go"
    },
    {
      "Time_Start": 1299.9199999999998,
      "Time_End": 1307.52,
      "Text": " after Daryl. And they go ahead and get an agent running, a rat running on his machine. Now,"
    },
    {
      "Time_Start": 1307.52,
      "Time_End": 1316.32,
      "Text": " immediately, the blue team notices the activity as suspicious. And they isolate the red team"
    },
    {
      "Time_Start": 1316.32,
      "Time_End": 1322.4,
      "Text": " activity, isolate the red team workstations. And the red team exercise is now over."
    },
    {
      "Time_Start": 1323.2,
      "Time_End": 1329.36,
      "Text": " Now, a blue teamer kind of wanders into the break room, pulls out his phone, opens up Twitter and"
    },
    {
      "Time_Start": 1329.36,
      "Time_End": 1334.96,
      "Text": " announces how great the blue team is and how horrible the red team is because of how fast"
    },
    {
      "Time_Start": 1334.96,
      "Time_End": 1340.4,
      "Text": " the blue team caught them. And that sparks an issue where the purple teamers are no longer"
    },
    {
      "Time_Start": 1340.4,
      "Time_End": 1345.92,
      "Text": " helping. They run for the door and they are hiding out in the stairwell. This is how it typically"
    },
    {
      "Time_Start": 1345.92,
      "Time_End": 1354.56,
      "Text": " goes because a red-blue exercise is looked at as a competition, not so much as a security event or"
    },
    {
      "Time_Start": 1354.56,
      "Time_End": 1360.64,
      "Text": " an exercise to create security at the end of the day. Because of that competition and the fueling"
    },
    {
      "Time_Start": 1360.96,
      "Time_End": 1366.64,
      "Text": " of hitting red versus blue, we're actually not getting as much out of these exercises as we"
    },
    {
      "Time_Start": 1366.64,
      "Time_End": 1372.48,
      "Text": " should, which is why the whole topic of purple teaming exists and what we as purple teamers are"
    },
    {
      "Time_Start": 1372.48,
      "Time_End": 1379.0400000000002,
      "Text": " supposed to do in order to remedy these situations. Now, the bigger question, after seeing"
    },
    {
      "Time_Start": 1379.0400000000002,
      "Time_End": 1383.8400000000001,
      "Text": " how a red team operation should go, how it actually goes, the question we should all ask,"
    },
    {
      "Time_Start": 1383.84,
      "Time_End": 1390.9599999999998,
      "Text": " is Dunder Mifflin now safe? A couple of questions that we need to ask as a symbol of this in order"
    },
    {
      "Time_Start": 1390.9599999999998,
      "Time_End": 1397.04,
      "Text": " to drive at the point. So, how good was the red team? If I hired that red team today,"
    },
    {
      "Time_Start": 1397.04,
      "Time_End": 1402.3999999999999,
      "Text": " they found 10 vulnerabilities in Dunder Mifflin networks and I hire a team next year,"
    },
    {
      "Time_Start": 1403.04,
      "Time_End": 1408.9599999999998,
      "Text": " they find five. Was the first team better or did the defense close five holes in that in between?"
    },
    {
      "Time_Start": 1409.76,
      "Time_End": 1413.36,
      "Text": " How good was the blue team? Did they have the right detection and response tools? Were they"
    },
    {
      "Time_Start": 1413.3600000000001,
      "Time_End": 1419.8400000000001,
      "Text": " configured? How good were they at implementing the fixes that the red team gave them? And, of course,"
    },
    {
      "Time_Start": 1419.8400000000001,
      "Time_End": 1424.8000000000002,
      "Text": " how good was a purple team? Were they effectively communicating with the red and blue sides? Was"
    },
    {
      "Time_Start": 1424.8000000000002,
      "Time_End": 1432.88,
      "Text": " this an effective good red team exercise? Now, if we can't answer this question, then we might be"
    },
    {
      "Time_Start": 1432.88,
      "Time_End": 1438.4,
      "Text": " drowning in complexity. If there are additional questions that are sprouting up in terms of"
    },
    {
      "Time_Start": 1438.4,
      "Time_End": 1442.24,
      "Text": " how do we determine whether success, how do we determine if we're safer"
    },
    {
      "Time_Start": 1442.24,
      "Time_End": 1447.6000000000001,
      "Text": " than we were before? If we are struggling to answer that question, we are drowning in complexity."
    },
    {
      "Time_Start": 1449.2800000000002,
      "Time_End": 1453.92,
      "Text": " Now, how does an executive go about answering that question from their side? They're not"
    },
    {
      "Time_Start": 1453.92,
      "Time_End": 1458.8000000000002,
      "Text": " boots on the ground. They're not typically part of these exercises aside from being briefed on"
    },
    {
      "Time_Start": 1458.8000000000002,
      "Time_End": 1463.6000000000001,
      "Text": " the results. Now, you've got the security team off to the left side. We've got the executive"
    },
    {
      "Time_Start": 1463.92,
      "Time_End": 1469.44,
      "Text": " backed by a number of security vendors that had tools that were probably used during the exercise."
    },
    {
      "Time_Start": 1470.0000000000002,
      "Time_End": 1475.68,
      "Text": " And the typical thing is that either the executive or the security team,"
    },
    {
      "Time_Start": 1475.68,
      "Time_End": 1481.2800000000002,
      "Text": " in order to answer the question of, am I safe now? They'll throw new tools at the problem."
    },
    {
      "Time_Start": 1481.2800000000002,
      "Time_End": 1486.4800000000002,
      "Text": " They'll say, you know what? If I use Cobalt Strike, if I used Caldera, if I wrote custom"
    },
    {
      "Time_Start": 1486.4800000000002,
      "Time_End": 1491.44,
      "Text": " implants, that would solve my problem. I could answer the question. They'll throw new processes"
    },
    {
      "Time_Start": 1491.44,
      "Time_End": 1497.76,
      "Text": " at the problem. If we just mapped everything to attack, that would fix it. If we conducted"
    },
    {
      "Time_Start": 1497.76,
      "Time_End": 1504.0,
      "Text": " our exercises over the cyber kill chain, that would do it. They'll throw new certs at the problem."
    },
    {
      "Time_Start": 1504.0,
      "Time_End": 1510.4,
      "Text": " Everyone go get your ethical hacker certificate, or all jobs that we hire, all entry-level jobs"
    },
    {
      "Time_Start": 1510.4,
      "Time_End": 1518.0,
      "Text": " now require a special certificate. So you'll see these sort of kind of ad hoc reactionary responses"
    },
    {
      "Time_Start": 1518.0,
      "Time_End": 1522.24,
      "Text": " to solving the security problem that we described before."
    },
    {
      "Time_Start": 1524.64,
      "Time_End": 1531.2,
      "Text": " Who wins as we go about this and we tack on this level of complexity? Security vendors."
    },
    {
      "Time_Start": 1531.2,
      "Time_End": 1536.8,
      "Text": " Security vendors win. Security vendors are the ones that are creating and selling tools. They"
    },
    {
      "Time_Start": 1536.8,
      "Time_End": 1543.36,
      "Text": " are the ones that are often mapping tools to, or even creating, different types of frameworks and"
    },
    {
      "Time_Start": 1543.3600000000001,
      "Time_End": 1549.68,
      "Text": " requirements and compliance-driven processes. They're also the ones selling or encouraging"
    },
    {
      "Time_Start": 1549.68,
      "Time_End": 1554.88,
      "Text": " people to get certificates that renew on a yearly basis that cost thousands of dollars"
    },
    {
      "Time_Start": 1554.88,
      "Time_End": 1559.7600000000002,
      "Text": " that organizations typically have to foot the bill on, if not individuals. So the security"
    },
    {
      "Time_Start": 1559.7600000000002,
      "Time_End": 1564.16,
      "Text": " vendor is kind of the one that gets more powerful at the end of the day through all of this."
    },
    {
      "Time_Start": 1566.16,
      "Time_End": 1571.6000000000001,
      "Text": " And like I said before, it's complexity that kills our cap. You have the executive who has"
    },
    {
      "Time_Start": 1571.6000000000001,
      "Time_End": 1579.6000000000001,
      "Text": " the vendor whispering in his ear, you just need, insert buzzword. Now, an executive does have more"
    },
    {
      "Time_Start": 1579.6000000000001,
      "Time_End": 1585.2800000000002,
      "Text": " on their mind than just the actual security of the organization. They have a boardroom. So they're"
    },
    {
      "Time_Start": 1585.2800000000002,
      "Time_End": 1593.7600000000002,
      "Text": " thinking, well, I need to justify how my actions, how my activities, how did they reflect on the"
    },
    {
      "Time_Start": 1593.76,
      "Time_End": 1600.56,
      "Text": " organization? If we get hacked, I need to be able to show the board that we had"
    },
    {
      "Time_Start": 1602.0,
      "Time_End": 1607.2,
      "Text": " all of these security tools, that we had these vendors behind us, that it wasn't my fault."
    },
    {
      "Time_Start": 1607.2,
      "Time_End": 1613.68,
      "Text": " So there is some serious concern to the executive of how do you balance risk at the corporate level."
    },
    {
      "Time_Start": 1613.68,
      "Time_End": 1618.8799999999999,
      "Text": " And so they have much more on their plate that they are balancing than first meets the eye."
    },
    {
      "Time_Start": 1619.5200000000002,
      "Time_End": 1623.7600000000002,
      "Text": " Now, it's sort of like this. So it kind of helps to see an analogy because security vendors aren't"
    },
    {
      "Time_Start": 1623.7600000000002,
      "Time_End": 1632.5600000000002,
      "Text": " bad. It's not a bad thing to be a security vendor. It is just about who has the upper hand. So it's"
    },
    {
      "Time_Start": 1632.5600000000002,
      "Time_End": 1638.24,
      "Text": " kind of like this. So you see this picture, you get the security team down here. They're kind of"
    },
    {
      "Time_Start": 1638.24,
      "Time_End": 1645.2,
      "Text": " the kids in this picture that's fitting for more than one reason. So that's our security team."
    },
    {
      "Time_Start": 1645.2,
      "Time_End": 1651.52,
      "Text": " You've got the executive who is in charge of the security team ultimately, and they are shopping"
    },
    {
      "Time_Start": 1651.52,
      "Time_End": 1657.92,
      "Text": " around for vendors. The vendor is the one selling the products, selling the solutions. And who do"
    },
    {
      "Time_Start": 1657.92,
      "Time_End": 1663.3600000000001,
      "Text": " you think has the upper hand here? This doesn't mean that the ice cream truck is evil. This doesn't"
    },
    {
      "Time_Start": 1663.3600000000001,
      "Time_End": 1668.4,
      "Text": " mean that they have bad intentions or are fraudulent, but they have the upper hand in this"
    },
    {
      "Time_Start": 1668.4,
      "Time_End": 1674.48,
      "Text": " situation. The executive is in the middle and balancing, and the security team is kind of"
    },
    {
      "Time_Start": 1674.48,
      "Time_End": 1680.0,
      "Text": " giving their wants and desires, but the decision is not ultimately theirs. It's what happens here."
    },
    {
      "Time_Start": 1680.56,
      "Time_End": 1686.8,
      "Text": " Now, if this is an organization that promises adversary immolation, well, that is something you"
    },
    {
      "Time_Start": 1686.8,
      "Time_End": 1695.12,
      "Text": " need to..."
    },
    {
      "Time_Start": 1710.8,
      "Time_End": 1714.24,
      "Text": " Now let's look at the topic of adversary immolation specifically."
    },
    {
      "Time_Start": 1714.96,
      "Time_End": 1722.16,
      "Text": " So let's say I have a four-person team, and that team is doing adversary immolation. I may,"
    },
    {
      "Time_Start": 1723.52,
      "Time_End": 1731.28,
      "Text": " as a knowledgeable security person, define adversary immolation as the act of using the"
    },
    {
      "Time_Start": 1731.28,
      "Time_End": 1740.08,
      "Text": " tactics and techniques that are known to a specific threat actor, replicating those tactics and"
    },
    {
      "Time_Start": 1740.08,
      "Time_End": 1746.6399999999999,
      "Text": " techniques inside my environment to get a rough idea as to what my reaction, my detection and"
    },
    {
      "Time_Start": 1746.6399999999999,
      "Time_End": 1754.08,
      "Text": " response would be if I face a similar threat. Now, as a four-person security team, I understand the"
    },
    {
      "Time_Start": 1755.6,
      "Time_End": 1760.1599999999999,
      "Text": " pros and cons of this approach. I understand where my limitations may exist, which is going"
    },
    {
      "Time_Start": 1760.1599999999999,
      "Time_End": 1767.4399999999998,
      "Text": " to be significant as a four-person team that is most likely restricted based on budget and time."
    },
    {
      "Time_Start": 1768.16,
      "Time_End": 1776.88,
      "Text": " And I may be backed by a 30-person marketing team at my organization that is promising the fact that"
    },
    {
      "Time_Start": 1776.88,
      "Time_End": 1784.56,
      "Text": " I do adversary immolation. Now, that 30-person marketing team and how they portray and define"
    },
    {
      "Time_Start": 1784.56,
      "Time_End": 1791.28,
      "Text": " adversary immolation may be very different from what me as a security person conducting the"
    },
    {
      "Time_Start": 1791.28,
      "Time_End": 1796.0,
      "Text": " exercises thinks I'm doing. So this is something you want to look out for as you're looking"
    },
    {
      "Time_Start": 1796.0,
      "Time_End": 1803.04,
      "Text": " specifically at the topic of adversary immolation, is what does the security team do?"
    },
    {
      "Time_Start": 1803.04,
      "Time_End": 1808.32,
      "Text": " What do the security team members promise and think they're doing versus what is being sold"
    },
    {
      "Time_Start": 1808.32,
      "Time_End": 1813.68,
      "Text": " from the security vendors, especially down as a security vendor may sell to an executive"
    },
    {
      "Time_Start": 1813.68,
      "Time_End": 1821.2,
      "Text": " that may or may not understand the fact that adversary immolation is not the same thing as"
    },
    {
      "Time_Start": 1821.2,
      "Time_End": 1826.96,
      "Text": " being attacked by a threat actor. A security team conducting adversary immolation does not"
    },
    {
      "Time_Start": 1826.96,
      "Time_End": 1833.76,
      "Text": " have unlimited budget, does not have unlimited time. They're conducting the exercise for improving the"
    },
    {
      "Time_Start": 1833.76,
      "Time_End": 1841.04,
      "Text": " defensive posture of an organization, not for a malicious action that could span years, including"
    },
    {
      "Time_Start": 1841.04,
      "Time_End": 1848.32,
      "Text": " surveillance and initial access. Now, that's the big thing when we're talking advanced adversary"
    },
    {
      "Time_Start": 1848.32,
      "Time_End": 1854.3999999999999,
      "Text": " emulation that you need to keep in mind. Now, it's a very, very misleading road to walk down"
    },
    {
      "Time_Start": 1854.3999999999999,
      "Time_End": 1859.52,
      "Text": " once you start incorporating or connecting the dots, if you will, between the marketing at some"
    },
    {
      "Time_Start": 1859.52,
      "Time_End": 1864.8799999999999,
      "Text": " organizations and vendors and the security teams that are conducting the exercises, whether it's"
    },
    {
      "Time_Start": 1864.8799999999999,
      "Time_End": 1872.6399999999999,
      "Text": " a tool-based thing or if it's a manual team that's out there doing it. Threat actors that work at"
    },
    {
      "Time_Start": 1872.64,
      "Time_End": 1881.2800000000002,
      "Text": " nation states typically have access to resources that we as security vendors do not have. We don't"
    },
    {
      "Time_Start": 1881.2800000000002,
      "Time_End": 1887.8400000000001,
      "Text": " have the luxury of this unlimited time, as I said, and money, but we also don't have the manpower."
    },
    {
      "Time_Start": 1887.8400000000001,
      "Time_End": 1897.1200000000001,
      "Text": " An organization that is at a China, at a North Korea, at a Russia, they have resources that span"
    },
    {
      "Time_Start": 1897.1200000000001,
      "Time_End": 1904.0000000000002,
      "Text": " into the hundreds, if not thousands of, say, employees that are conducting these exercises"
    },
    {
      "Time_Start": 1904.0000000000002,
      "Time_End": 1911.0400000000002,
      "Text": " with different specialties and significant amount of research behind their actions. Now,"
    },
    {
      "Time_Start": 1911.68,
      "Time_End": 1918.48,
      "Text": " as a security vendor, we're going to do our best to replicate what we see in the public sense as"
    },
    {
      "Time_Start": 1918.48,
      "Time_End": 1925.7600000000002,
      "Text": " far as what these groups do in order to provide that, I would say, rough estimation of how that"
    },
    {
      "Time_Start": 1925.76,
      "Time_End": 1931.6,
      "Text": " emulation should go. But again, keep in mind that this is being powered, us as security vendors,"
    },
    {
      "Time_Start": 1931.6,
      "Time_End": 1939.12,
      "Text": " our emulation is being funneled or filtered through the open source intelligence or, if we're"
    },
    {
      "Time_Start": 1939.12,
      "Time_End": 1944.32,
      "Text": " incredibly lucky, some other custom form of classified intelligence that allows us"
    },
    {
      "Time_Start": 1945.68,
      "Time_End": 1952.16,
      "Text": " a peek into the actual activities of these organizations. Now, a group from China may"
    },
    {
      "Time_Start": 1952.24,
      "Time_End": 1959.3600000000001,
      "Text": " attempt to reuse the tactics and techniques of a group in Russia in order for Russia to get blamed"
    },
    {
      "Time_Start": 1959.3600000000001,
      "Time_End": 1966.3200000000002,
      "Text": " for some giant attack that happens in the world when really China was behind it or vice versa."
    },
    {
      "Time_Start": 1966.3200000000002,
      "Time_End": 1971.92,
      "Text": " And the amount of hearsay that goes on within threat intelligence becomes an incredibly difficult"
    },
    {
      "Time_Start": 1971.92,
      "Time_End": 1977.76,
      "Text": " problem to solve from a threat intelligence standpoint. And because of that, and the"
    },
    {
      "Time_Start": 1977.76,
      "Time_End": 1983.84,
      "Text": " unlimited time and money that I talked about before, the act of adversary emulation is an"
    },
    {
      "Time_Start": 1983.84,
      "Time_End": 1990.8799999999999,
      "Text": " incredibly difficult topic. And so expectations will be the number one thing that you should"
    },
    {
      "Time_Start": 1990.8799999999999,
      "Time_End": 1997.04,
      "Text": " think about when you are contemplating the topic. When you are within an adversary emulation"
    },
    {
      "Time_Start": 1997.04,
      "Time_End": 2003.04,
      "Text": " exercise, if you're a purple teamer and you are supporting one, think through how it's being"
    },
    {
      "Time_Start": 2003.04,
      "Time_End": 2009.44,
      "Text": " portrayed. Think through the words that are being used. Think through not just you on the security"
    },
    {
      "Time_Start": 2009.44,
      "Time_End": 2014.1599999999999,
      "Text": " team, but think through how the people that are consuming the results of the exercise,"
    },
    {
      "Time_Start": 2014.1599999999999,
      "Time_End": 2017.36,
      "Text": " what their expectation is. Is it actually matching what yours is?"
    },
    {
      "Time_Start": 2025.36,
      "Time_End": 2032.1599999999999,
      "Text": " The bigger question is, are you safer given that there are more security companies today than ever"
    },
    {
      "Time_Start": 2032.16,
      "Time_End": 2042.3200000000002,
      "Text": " before? That is a completive question that you should spend time thinking, considering,"
    },
    {
      "Time_Start": 2042.3200000000002,
      "Time_End": 2050.56,
      "Text": " contemplating over. Well, let's focus on the solutions now. How do we get security back to"
    },
    {
      "Time_Start": 2050.56,
      "Time_End": 2058.7200000000003,
      "Text": " the basics? The first thing you should do before anything else is to understand the difference"
    },
    {
      "Time_Start": 2058.7200000000003,
      "Time_End": 2065.92,
      "Text": " between these three dimensions. Vulnerability versus threat versus risk. A vulnerability"
    },
    {
      "Time_Start": 2066.4800000000005,
      "Time_End": 2073.5200000000004,
      "Text": " is a weakness or a gap in our protection efforts. If we don't have any protection efforts,"
    },
    {
      "Time_Start": 2073.5200000000004,
      "Time_End": 2082.2400000000002,
      "Text": " it's our non-efforts. A threat is anything that can exploit a vulnerability. A risk is the potential"
    },
    {
      "Time_Start": 2082.2400000000002,
      "Time_End": 2091.84,
      "Text": " loss if a threat exploits a vulnerability. Let's look at this on paper. Port 22 being open to the"
    },
    {
      "Time_Start": 2091.84,
      "Time_End": 2098.5600000000004,
      "Text": " internet with a default password, that's a vulnerability. Now, a threat in this case is"
    },
    {
      "Time_Start": 2098.5600000000004,
      "Time_End": 2104.0000000000005,
      "Text": " any person that has access to the internet. Technically, maybe they could find that vulnerability"
    },
    {
      "Time_Start": 2104.0,
      "Time_End": 2112.88,
      "Text": " and exploit it. Now, the potential loss if that threat exploits port 22, that's the risk. In this"
    },
    {
      "Time_Start": 2112.88,
      "Time_End": 2119.68,
      "Text": " case, because it's a remote code execution vulnerability, the risk is pretty high. Theft"
    },
    {
      "Time_Start": 2119.68,
      "Time_End": 2124.56,
      "Text": " or destruction to the private files or network. If this computer is completely isolated, connected"
    },
    {
      "Time_Start": 2124.56,
      "Time_End": 2130.24,
      "Text": " to nothing, it contains nothing but a default Ubuntu operating system, well, my risk is very low."
    },
    {
      "Time_Start": 2130.2400000000002,
      "Time_End": 2136.1600000000003,
      "Text": " Therefore, my need to close the vulnerability, the hole, may be very low as well. If that server"
    },
    {
      "Time_Start": 2136.1600000000003,
      "Time_End": 2142.2400000000002,
      "Text": " with the open 22 port is my database server with financial records, well, my risk is going to be"
    },
    {
      "Time_Start": 2142.2400000000002,
      "Time_End": 2150.7200000000003,
      "Text": " significantly tilted into the higher category. Understanding that difference is important."
    },
    {
      "Time_Start": 2150.7200000000003,
      "Time_End": 2155.0400000000004,
      "Text": " Now, what is good cyber hygiene? So, I lifted this definition from Digital Guardian, which I thought"
    },
    {
      "Time_Start": 2155.04,
      "Time_End": 2161.2,
      "Text": " was quite good. Cyber hygiene is a reference to the practices and steps that users of computers"
    },
    {
      "Time_Start": 2161.2,
      "Time_End": 2167.52,
      "Text": " and other devices take to maintain system health and improve online security. These practices are"
    },
    {
      "Time_Start": 2167.52,
      "Time_End": 2173.2799999999997,
      "Text": " often part of a routine to ensure the safety of identity and other details that could be stolen"
    },
    {
      "Time_Start": 2173.2799999999997,
      "Time_End": 2179.92,
      "Text": " or corrupted. Much like physical hygiene, cyber hygiene is regularly conducted to ward off natural"
    },
    {
      "Time_Start": 2179.92,
      "Time_End": 2185.36,
      "Text": " deterioration and common faults. Just like personal hygiene, cyber hygiene is important,"
    },
    {
      "Time_Start": 2185.92,
      "Time_End": 2191.28,
      "Text": " and it is actually quite similar between small companies and big companies. This is something"
    },
    {
      "Time_Start": 2191.28,
      "Time_End": 2195.36,
      "Text": " that a lot of people probably wouldn't think of, maybe even not want to admit to, but the"
    },
    {
      "Time_Start": 2196.48,
      "Time_End": 2202.2400000000002,
      "Text": " offset and differences of what is good cyber hygiene to a big company is pretty much the same"
    },
    {
      "Time_Start": 2202.2400000000002,
      "Time_End": 2207.92,
      "Text": " as small. It doesn't mean that it is as accessible to small companies as big companies, but the same"
    },
    {
      "Time_Start": 2207.92,
      "Time_End": 2215.44,
      "Text": " rules apply in terms of what is important. So, the biggest bucket of things that a company should do"
    },
    {
      "Time_Start": 2216.0,
      "Time_End": 2223.04,
      "Text": " is understand how to perform inventory audit. Understand the computers, devices, mobile phones,"
    },
    {
      "Time_Start": 2223.04,
      "Time_End": 2230.8,
      "Text": " tablets, IoT, the devices you have that have access to your assets. That could be your network,"
    },
    {
      "Time_Start": 2230.8,
      "Time_End": 2236.96,
      "Text": " your VPN, your email servers, your databases. This could be anything company-wide. Understand"
    },
    {
      "Time_Start": 2236.96,
      "Time_End": 2243.12,
      "Text": " what you actually own and how it's connected. It sounds like a crazy simple thing. I have"
    },
    {
      "Time_Start": 2243.12,
      "Time_End": 2248.8,
      "Text": " yet to find an organization that really does well at this at scale. This is a big problem."
    },
    {
      "Time_Start": 2248.8,
      "Time_End": 2257.44,
      "Text": " It is the base of security. Once you have that solved, add centralized logging. Add the ability"
    },
    {
      "Time_Start": 2257.44,
      "Time_End": 2263.68,
      "Text": " to forward system logs, monitoring logs, what have you, to a centralized location for analysis."
    },
    {
      "Time_Start": 2263.8399999999997,
      "Time_End": 2268.24,
      "Text": " Don't even need to necessarily perform the analysis right away. Have centralized logging"
    },
    {
      "Time_Start": 2268.24,
      "Time_End": 2275.12,
      "Text": " set up so you can perform it later. Schedule patching and updating. Again, this is one of the"
    },
    {
      "Time_Start": 2275.7599999999998,
      "Time_End": 2281.9199999999996,
      "Text": " core fundamentals of security. Ensure your operating systems, ensure your applications"
    },
    {
      "Time_Start": 2281.9199999999996,
      "Time_End": 2287.6,
      "Text": " are patched and up to date. Patches come out for Microsoft on Patch Tuesdays. Applications get"
    },
    {
      "Time_Start": 2288.56,
      "Time_End": 2294.4,
      "Text": " patched and updated constantly. Come up with a schedule for doing so and make it automatic."
    },
    {
      "Time_Start": 2295.36,
      "Time_End": 2300.72,
      "Text": " The next step, start vulnerability scanning and remediation. This is perimeter scanning. This is"
    },
    {
      "Time_Start": 2300.72,
      "Time_End": 2306.0,
      "Text": " understanding how somebody could get in. When you run a vulnerability scan, you may get a thousand"
    },
    {
      "Time_Start": 2306.0,
      "Time_End": 2312.3199999999997,
      "Text": " or more responses in terms of what your vulnerability could be to the perimeter,"
    },
    {
      "Time_Start": 2312.3199999999997,
      "Time_End": 2317.12,
      "Text": " to the internet. But remembering the difference between vulnerability, threat, and risk,"
    },
    {
      "Time_Start": 2317.2,
      "Time_End": 2325.04,
      "Text": " we should be able to filter down and prioritize what the important vulnerabilities that we want"
    },
    {
      "Time_Start": 2325.04,
      "Time_End": 2332.08,
      "Text": " to remediate are. Implement cybersecurity education. This goes for not just security"
    },
    {
      "Time_Start": 2332.08,
      "Time_End": 2337.12,
      "Text": " staff. This goes for our entire organization. We've all seen those video click-throughs,"
    },
    {
      "Time_Start": 2337.12,
      "Time_End": 2343.04,
      "Text": " compliance-driven security education videos that we need to take every six or 12 months."
    },
    {
      "Time_Start": 2343.04,
      "Time_End": 2349.44,
      "Text": " That is not security education. Come up with a plan that educates your security teams and your"
    },
    {
      "Time_Start": 2349.44,
      "Time_End": 2355.7599999999998,
      "Text": " regular users in a way that is fruitful and not strictly compliance-based."
    },
    {
      "Time_Start": 2357.44,
      "Time_End": 2362.56,
      "Text": " Now we're getting into some bigger company territory where usually expense and accessibility"
    },
    {
      "Time_Start": 2362.56,
      "Time_End": 2366.96,
      "Text": " comes in for big companies. Staff an internal security team. If you've solved everything up"
    },
    {
      "Time_Start": 2366.96,
      "Time_End": 2374.08,
      "Text": " above with an IT and an InfoSec specifically, go ahead and start to staff up your internal security"
    },
    {
      "Time_Start": 2374.08,
      "Time_End": 2379.52,
      "Text": " team. Get a couple of people or a full team of people, depending on your size and industry,"
    },
    {
      "Time_Start": 2379.52,
      "Time_End": 2386.08,
      "Text": " and run a red, blue, purple team. That will provide wonderful security at the end of the day"
    },
    {
      "Time_Start": 2386.08,
      "Time_End": 2392.8,
      "Text": " in terms of focus and energy. Then start conducting red team exercises. So bring in,"
    },
    {
      "Time_Start": 2392.8,
      "Time_End": 2397.28,
      "Text": " whether it's internal or managed, start actually doing offensive security and that"
    },
    {
      "Time_Start": 2397.28,
      "Time_End": 2403.84,
      "Text": " adversary lens type of attack in order to understand what your actual threat would be"
    },
    {
      "Time_Start": 2403.84,
      "Time_End": 2410.5600000000004,
      "Text": " if somebody came in and went after you. Let's take a case study in incident response. I'm"
    },
    {
      "Time_Start": 2410.5600000000004,
      "Time_End": 2416.5600000000004,
      "Text": " going to pull this case study from my days doing some incident response at a threat intelligence"
    },
    {
      "Time_Start": 2416.5600000000004,
      "Time_End": 2422.4,
      "Text": " organization. As a red teamer, I would often sit with the blue team and go out on incident response"
    },
    {
      "Time_Start": 2422.48,
      "Time_End": 2432.96,
      "Text": " calls and see how an attacker made it into a system, provide advice on areas they may have"
    },
    {
      "Time_Start": 2433.84,
      "Time_End": 2440.96,
      "Text": " gone or set up persistence or backdoors and so forth. This is a case study that isn't specific"
    },
    {
      "Time_Start": 2440.96,
      "Time_End": 2448.32,
      "Text": " to one case, but this is a case study that is generic that was a combination of many experiences"
    },
    {
      "Time_Start": 2448.56,
      "Time_End": 2454.1600000000003,
      "Text": " that I had in the field. Let's use Dunder Mifflin again as our sample company."
    },
    {
      "Time_Start": 2456.0,
      "Time_End": 2462.6400000000003,
      "Text": " If Dunder Mifflin were attacked and multiple adversaries or an adversary made"
    },
    {
      "Time_Start": 2463.28,
      "Time_End": 2469.6000000000004,
      "Text": " several footholds into the organization, what do they do? They call up their local incident"
    },
    {
      "Time_Start": 2469.6000000000004,
      "Time_End": 2477.36,
      "Text": " responders who come into the field, meet with, in this case, our security executive. Maybe it's a"
    },
    {
      "Time_Start": 2477.36,
      "Time_End": 2483.6800000000003,
      "Text": " system administrator, somebody that is capable of talking about the architecture of the environment."
    },
    {
      "Time_Start": 2483.6800000000003,
      "Time_End": 2490.7200000000003,
      "Text": " That person sits behind a whiteboard. They draw a very complicated drawing of circles and squares,"
    },
    {
      "Time_Start": 2490.7200000000003,
      "Time_End": 2495.92,
      "Text": " trying to outline what the architecture of the organization looks like because the red and blue"
    },
    {
      "Time_Start": 2495.92,
      "Time_End": 2501.52,
      "Text": " team needs to understand that environment. What did I find? It was always wrong."
    },
    {
      "Time_Start": 2502.48,
      "Time_End": 2509.84,
      "Text": " So, the architecture that an organization thought they had after they had been attacked,"
    },
    {
      "Time_Start": 2510.4,
      "Time_End": 2515.2,
      "Text": " as they drew it up and said, these are my servers, these are my connections between my networks,"
    },
    {
      "Time_Start": 2515.2,
      "Time_End": 2522.24,
      "Text": " it was always wrong. Organizations are struggling at the basic foundation of cyber security."
    },
    {
      "Time_Start": 2522.8,
      "Time_End": 2529.36,
      "Text": " Inventory asset, understanding how your networks are connected. Just understanding that will put"
    },
    {
      "Time_Start": 2529.44,
      "Time_End": 2537.36,
      "Text": " you miles ahead of your peers in the industry, and it is not sexy. It is incredibly basic,"
    },
    {
      "Time_Start": 2537.36,
      "Time_End": 2544.1600000000003,
      "Text": " but it is also incredibly crucial to performing what we're being paid to do, which is to secure"
    },
    {
      "Time_Start": 2544.1600000000003,
      "Time_End": 2551.36,
      "Text": " our organizations. But you might say, I'm just a boots on the ground worker. I'm a red teamer."
    },
    {
      "Time_Start": 2551.36,
      "Time_End": 2558.96,
      "Text": " I'm a purple teamer. I am not an executive. I am not in charge of what we get to work on."
    },
    {
      "Time_Start": 2558.96,
      "Time_End": 2565.6,
      "Text": " I'm not in charge of making these decisions. But ask these basic questions. Instead of pulling"
    },
    {
      "Time_Start": 2565.6,
      "Time_End": 2570.2400000000002,
      "Text": " off the latest buzzword and going with the flow, ask a handful of basic questions to your"
    },
    {
      "Time_Start": 2570.2400000000002,
      "Time_End": 2576.32,
      "Text": " organizations. Push back, push your organization and your management team towards solving the boring"
    },
    {
      "Time_Start": 2576.32,
      "Time_End": 2582.48,
      "Text": " but the important problems, and then actually tackle them. Don't just focus on the sexy buzzwords."
    },
    {
      "Time_Start": 2582.48,
      "Time_End": 2587.84,
      "Text": " So, here's a few questions you can ask to try to prompt people to go in this direction,"
    },
    {
      "Time_Start": 2587.84,
      "Time_End": 2593.1200000000003,
      "Text": " to swim in the same direction as you. Do we know all of the devices used by employees,"
    },
    {
      "Time_Start": 2593.84,
      "Time_End": 2599.84,
      "Text": " what they can do, and what they should be accessing? Do we save all system and endpoint logs?"
    },
    {
      "Time_Start": 2599.84,
      "Time_End": 2606.96,
      "Text": " What's the retention policy? Who reviews them? How are patches rolled out? Are we looking beyond"
    },
    {
      "Time_Start": 2606.96,
      "Time_End": 2613.84,
      "Text": " Windows? Linux servers are notorious for being open blind spots in a lot of organizations,"
    },
    {
      "Time_Start": 2614.4,
      "Time_End": 2621.04,
      "Text": " and a lot of blue and purple teamers have no idea how their organization actually handles patches."
    },
    {
      "Time_Start": 2622.08,
      "Time_End": 2628.56,
      "Text": " How do we determine vulnerabilities? What about threats? Do we categorize risks? Instead of just"
    },
    {
      "Time_Start": 2628.56,
      "Time_End": 2633.76,
      "Text": " understanding that your organization can be exploited, circle back to that vulnerability"
    },
    {
      "Time_Start": 2633.76,
      "Time_End": 2640.7200000000003,
      "Text": " versus threat versus risk. Zero in on what the actual risk is to the organization and make that"
    },
    {
      "Time_Start": 2640.7200000000003,
      "Time_End": 2647.2000000000003,
      "Text": " the central part of how you approach security. How are we staying current? How do our regular"
    },
    {
      "Time_Start": 2647.2000000000003,
      "Time_End": 2653.6800000000003,
      "Text": " employees get smarter at cyber security? People at regular employees don't need to be experts in"
    },
    {
      "Time_Start": 2653.6800000000003,
      "Time_End": 2658.96,
      "Text": " cyber security, but there should be a plan in motion that educates people to get smarter and"
    },
    {
      "Time_Start": 2658.96,
      "Time_End": 2665.44,
      "Text": " smarter on a very important topic. Finally, how are we growing our cyber team and our knowledge"
    },
    {
      "Time_Start": 2665.44,
      "Time_End": 2672.7200000000003,
      "Text": " internally? Outside of the compliance-driven security and outside of these very complex,"
    },
    {
      "Time_Start": 2672.7200000000003,
      "Time_End": 2677.6,
      "Text": " very side case, edge case things that we may be very interested in, what are we doing to actually"
    },
    {
      "Time_Start": 2677.6,
      "Time_End": 2682.48,
      "Text": " build their base skill sets up? Then our last thing, can we start doing red team assessments?"
    },
    {
      "Time_Start": 2682.48,
      "Time_End": 2687.76,
      "Text": " If we're not doing them, can we do them? If we are doing them, how do we get better at them?"
    },
    {
      "Time_Start": 2687.76,
      "Time_End": 2692.32,
      "Text": " Don't just do them. Ask the question, how do we get more value out of doing them?"
    },
    {
      "Time_Start": 2693.2000000000003,
      "Time_End": 2701.6800000000003,
      "Text": " As we're getting ready to close, I want you to take a step back again and think about the red,"
    },
    {
      "Time_Start": 2701.6800000000003,
      "Time_End": 2707.36,
      "Text": " blue, and purple spaces. So especially as Purple Team Conference, a lot of us are purple teamers,"
    },
    {
      "Time_Start": 2707.36,
      "Time_End": 2712.0,
      "Text": " think about this for a second. As you're looking at the process of purple teaming,"
    },
    {
      "Time_Start": 2712.8,
      "Time_End": 2719.6800000000003,
      "Text": " when you're looking at it from a day-to-day job, what is your process? What are you being paid to do?"
    },
    {
      "Time_Start": 2720.0,
      "Time_End": 2730.24,
      "Text": " If you're facing processes and decisions that seem overly complicated, if it's a 45-step plan"
    },
    {
      "Time_Start": 2730.24,
      "Time_End": 2739.3599999999997,
      "Text": " to conduct a purple team process, that is looking either more like a checklist, which probably isn't"
    },
    {
      "Time_Start": 2739.3599999999997,
      "Time_End": 2746.3199999999997,
      "Text": " going to be as effective for your organization, or if it's looking more like just too much complexity,"
    },
    {
      "Time_Start": 2746.48,
      "Time_End": 2753.92,
      "Text": " just too much complexity, dial it back. Ask the questions. Purple teaming doesn't have to be"
    },
    {
      "Time_Start": 2753.92,
      "Time_End": 2761.6800000000003,
      "Text": " complicated. The stuff we get to spend our time doing is incredibly valuable. It is incredibly"
    },
    {
      "Time_Start": 2761.6800000000003,
      "Time_End": 2768.56,
      "Text": " interesting, but interesting and complexity don't have to be the same. Now, this is something we"
    },
    {
      "Time_Start": 2768.56,
      "Time_End": 2774.48,
      "Text": " should just all be conscious of. We want to spend our time making an impact. We want to spend our"
    },
    {
      "Time_Start": 2774.48,
      "Time_End": 2779.6,
      "Text": " time securing organizations, and creating complexity for us and our co-workers just"
    },
    {
      "Time_Start": 2779.6,
      "Time_End": 2786.88,
      "Text": " doesn't always do that. You take the complexity where you need to eat the complexity, but aim to"
    },
    {
      "Time_Start": 2786.88,
      "Time_End": 2792.64,
      "Text": " simplify in every other place. And when we're talking specifically on the topic of adversary"
    },
    {
      "Time_Start": 2792.64,
      "Time_End": 2799.92,
      "Text": " emulation, if you're being promised the moon in adversary emulation, and it is an incredibly"
    },
    {
      "Time_Start": 2799.92,
      "Time_End": 2807.92,
      "Text": " complicated process to get from here to the moon, then don't just accept it. Push back,"
    },
    {
      "Time_Start": 2809.28,
      "Time_End": 2816.88,
      "Text": " go to the basics, and focus on securing your organization. Now, this all comes back to the"
    },
    {
      "Time_Start": 2817.52,
      "Time_End": 2825.36,
      "Text": " primary purpose of this talk. Keep it simple, stupid. The old-fashioned KISS rule. Focus on"
    },
    {
      "Time_Start": 2825.36,
      "Time_End": 2832.88,
      "Text": " the basics. Don't get tied up into the buzzwords. Understand why complexity is killing cybersecurity"
    },
    {
      "Time_Start": 2832.88,
      "Time_End": 2839.52,
      "Text": " from the cyclical way that security products are sold from executives down to boots on the ground,"
    },
    {
      "Time_Start": 2839.52,
      "Time_End": 2844.96,
      "Text": " back up to security vendors. Understanding how that process works. Understanding that it is"
    },
    {
      "Time_Start": 2844.96,
      "Time_End": 2851.1200000000003,
      "Text": " driven because of the complexity that exists within the industry. And then balancing that with"
    },
    {
      "Time_Start": 2852.08,
      "Time_End": 2857.3599999999997,
      "Text": " how do we solve the problem by keeping things simple? That is the focus that I hope that you"
    },
    {
      "Time_Start": 2857.3599999999997,
      "Time_End": 2861.52,
      "Text": " take out of this talk. I hope that you learn something out of this as far as simplicity. I"
    },
    {
      "Time_Start": 2861.52,
      "Time_End": 2868.88,
      "Text": " hope that you learn no sexy new buzzwords and no sexy new processes, but that my talk was able to"
    },
    {
      "Time_Start": 2868.88,
      "Time_End": 2875.68,
      "Text": " at least reinforce how important the basics of security are, the foundational pieces,"
    },
    {
      "Time_Start": 2875.68,
      "Time_End": 2882.7999999999997,
      "Text": " to our everyday work. Thank you very much."
    }
  ]
}