{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.120000000000001,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hello, everyone. Thanks for coming. I'm Alex Frelos, and I'm joined by my colleague here,"
    },
    {
      "Time_Start": 15.120000000000001,
      "Time_End": 21.76,
      "Text": " Jack Butler, and we're presenting on COVID-19 tracing apps, the proliferation of rush development."
    },
    {
      "Time_Start": 23.92,
      "Time_End": 28.0,
      "Text": " Now a little bit about ourselves. I'm currently a director at"
    },
    {
      "Time_Start": 28.0,
      "Time_End": 34.0,
      "Text": " a Fortune 500 company directing a penetration testing team. I'd like to consider myself"
    },
    {
      "Time_Start": 34.0,
      "Time_End": 39.36,
      "Text": " technical as well as managerial. Some of my interests lie in web application testing,"
    },
    {
      "Time_Start": 39.36,
      "Time_End": 47.2,
      "Text": " aviation testing, and just enjoying the outdoors. And my name is John Butler. I'm a mobile application"
    },
    {
      "Time_Start": 47.2,
      "Time_End": 53.6,
      "Text": " security specialist, and I have a strong background in prevention of reverse engineering of mobile"
    },
    {
      "Time_Start": 53.6,
      "Time_End": 60.800000000000004,
      "Text": " applications. I also currently work as a mobile app security specialist for a leading security"
    },
    {
      "Time_Start": 60.800000000000004,
      "Time_End": 67.68,
      "Text": " firm in the mobile space, Guard Square. And much of the research that we'll be presenting today,"
    },
    {
      "Time_Start": 67.68,
      "Time_End": 74.08,
      "Text": " as well as the findings that we'll discuss today, was conducted as part of my daily duties"
    },
    {
      "Time_Start": 74.64,
      "Time_End": 79.36,
      "Text": " and research alongside my peers over at Guard Square."
    },
    {
      "Time_Start": 79.76,
      "Time_End": 83.84,
      "Text": " So to get things kicked off, we're going to actually go over a brief overview of what we"
    },
    {
      "Time_Start": 83.84,
      "Time_End": 88.96,
      "Text": " hope to accomplish during this conversation and just give you guys a little bit more of a backdrop"
    },
    {
      "Time_Start": 88.96,
      "Time_End": 93.28,
      "Text": " and some context to work off of. So the first thing we want to cover is the actual purpose"
    },
    {
      "Time_Start": 93.28,
      "Time_End": 99.03999999999999,
      "Text": " of today's conversation and the purpose of contact tracing applications in general."
    },
    {
      "Time_Start": 99.03999999999999,
      "Time_End": 102.48,
      "Text": " For anybody here who doesn't know what a contact tracing application is,"
    },
    {
      "Time_Start": 102.8,
      "Time_End": 110.48,
      "Text": " it's meant to actually trace individuals who do or do not have COVID. But more importantly,"
    },
    {
      "Time_Start": 110.48,
      "Time_End": 117.92,
      "Text": " LERT users are specific individuals that are using the application of potential exposures to other"
    },
    {
      "Time_Start": 118.80000000000001,
      "Time_End": 125.44,
      "Text": " users that are within a proximal location. Now, just in order to address rollout history,"
    },
    {
      "Time_Start": 125.75999999999999,
      "Time_End": 132.16,
      "Text": " COVID-19 contact tracing applications have started to appear since the actual pandemic began."
    },
    {
      "Time_Start": 133.2,
      "Time_End": 140.8,
      "Text": " We've seen a number of different changes over the course of time with regards to the tools"
    },
    {
      "Time_Start": 140.8,
      "Time_End": 146.72,
      "Text": " that are available in order to actually build security in to core functionality of these"
    },
    {
      "Time_Start": 146.72,
      "Time_End": 151.28,
      "Text": " applications. And we'll discuss this during our conversation here today as well."
    },
    {
      "Time_Start": 151.28,
      "Time_End": 156.4,
      "Text": " We're also going to be touching upon different application variants. So something that you're"
    },
    {
      "Time_Start": 156.4,
      "Time_End": 161.68,
      "Text": " going to notice is that there are many different COVID-19 contact tracing applications, not one"
    },
    {
      "Time_Start": 162.4,
      "Time_End": 169.2,
      "Text": " unified application of any sort. So we see this is actually occurring on country-by-country basis,"
    },
    {
      "Time_Start": 169.2,
      "Time_End": 175.44,
      "Text": " but also state levels within the United States, adding to the confusion of which"
    },
    {
      "Time_Start": 175.76,
      "Time_End": 181.68,
      "Text": " one do you actually download. We're going to be touching on the importance of trust today. It's"
    },
    {
      "Time_Start": 181.68,
      "Time_End": 187.2,
      "Text": " a very important thing. If COVID-19 contact tracing applications are going to be adopted"
    },
    {
      "Time_Start": 188.0,
      "Time_End": 196.4,
      "Text": " and used as a effective utility for fighting this pandemic, then users need to trust that"
    },
    {
      "Time_Start": 196.4,
      "Time_End": 200.88,
      "Text": " the applications are built with security and privacy in mind. And we're going to be talking"
    },
    {
      "Time_Start": 200.88,
      "Time_End": 205.2,
      "Text": " users need to trust that the applications are built with security and privacy in mind."
    },
    {
      "Time_Start": 205.84,
      "Time_End": 208.96,
      "Text": " And these are some of the contingencies that we'll also discuss today."
    },
    {
      "Time_Start": 210.88,
      "Time_End": 216.0,
      "Text": " Moving on to just information collected by the application, we're going to, of course, be diving"
    },
    {
      "Time_Start": 216.0,
      "Time_End": 221.6,
      "Text": " into our findings on a very granular level, the controls that we analyzed within the applications,"
    },
    {
      "Time_Start": 221.6,
      "Time_End": 227.68,
      "Text": " the apps themselves, information that was collected by the applications that we view to be an overstep"
    },
    {
      "Time_Start": 228.32,
      "Time_End": 234.32,
      "Text": " and more. And that really ties into and folds nicely into our final point here, which is just"
    },
    {
      "Time_Start": 234.32,
      "Time_End": 238.88,
      "Text": " brokenness of COVID-19 contact tracing applications, many of the security and"
    },
    {
      "Time_Start": 238.88,
      "Time_End": 244.24,
      "Text": " privacy concerns that we've observed and recommendations for how we can improve in the"
    },
    {
      "Time_Start": 244.24,
      "Time_End": 253.04000000000002,
      "Text": " future. So now that we've provided a general overview of what we're going to be discussing"
    },
    {
      "Time_Start": 253.04000000000002,
      "Time_End": 257.44,
      "Text": " today and what we hope to accomplish in today's conversation, we can actually move on to a"
    },
    {
      "Time_Start": 257.44,
      "Time_End": 264.71999999999997,
      "Text": " general overview of our testing approach. So to help you better understand our testing"
    },
    {
      "Time_Start": 264.71999999999997,
      "Time_End": 270.48,
      "Text": " approach, we're going to be going over together the apps that we analyzed, as well as the actual"
    },
    {
      "Time_Start": 270.48,
      "Time_End": 275.76,
      "Text": " overview of controls studied. So the actual protection mechanisms that we were looking"
    },
    {
      "Time_Start": 275.76,
      "Time_End": 281.68,
      "Text": " for inside of these applications. And then we're also going to review a summary of findings"
    },
    {
      "Time_Start": 282.56,
      "Time_End": 288.64,
      "Text": " and an overview of the data that we were able to collect and analyze as a result of this research."
    },
    {
      "Time_Start": 295.92,
      "Time_End": 299.84000000000003,
      "Text": " The first thing I would like to do is provide you with a timeline of the actual applications"
    },
    {
      "Time_Start": 299.84000000000003,
      "Time_End": 306.4,
      "Text": " that we analyzed so that you can better understand the entire backdrop of the research and the story"
    },
    {
      "Time_Start": 306.40000000000003,
      "Time_End": 315.20000000000005,
      "Text": " that goes behind it. So back in June of 2020, I actually had the opportunity to analyze 14 of the"
    },
    {
      "Time_Start": 315.20000000000005,
      "Time_End": 321.04,
      "Text": " original COVID-19 applications. Now at the time, these were actually just APKs, so the data was"
    },
    {
      "Time_Start": 321.04,
      "Time_End": 326.16,
      "Text": " limited to Android. This was certainly enough to pique interest in the privacy and security"
    },
    {
      "Time_Start": 326.16,
      "Time_End": 333.20000000000005,
      "Text": " concerns that reside in the space and definitely made myself, my colleagues, very interested to"
    },
    {
      "Time_Start": 333.2,
      "Time_End": 338.47999999999996,
      "Text": " see how this would progress into the future. So in December of 2020, myself and my colleagues"
    },
    {
      "Time_Start": 338.47999999999996,
      "Time_End": 346.48,
      "Text": " analyzed the same 14 original APKs that we took a look at. We extended that by taking a look at"
    },
    {
      "Time_Start": 346.48,
      "Time_End": 354.08,
      "Text": " another 38 Android applications. And we also extended the data set by introducing 43 new"
    },
    {
      "Time_Start": 354.08,
      "Time_End": 360.71999999999997,
      "Text": " iOS contact tracing applications to provide some telemetry there. So in general, and to provide a"
    },
    {
      "Time_Start": 360.72,
      "Time_End": 366.48,
      "Text": " real breakdown, we analyzed 95 applications in total. The majority of these were government"
    },
    {
      "Time_Start": 366.48,
      "Time_End": 372.72,
      "Text": " orchestrated contact tracing applications. But it's actually important to note that they"
    },
    {
      "Time_Start": 372.72,
      "Time_End": 378.96000000000004,
      "Text": " weren't all countries, so it's not just country by country. We actually do have 13 U.S. states"
    },
    {
      "Time_Start": 379.6,
      "Time_End": 386.64000000000004,
      "Text": " as well as two U.S. territories. So there were many different applications, and this actually adds to"
    },
    {
      "Time_Start": 386.64,
      "Time_End": 393.52,
      "Text": " some of the confusion behind finding the correct application and the opportunity behind"
    },
    {
      "Time_Start": 393.52,
      "Time_End": 398.96,
      "Text": " the phishing campaigns that we've observed, which we'll discuss later throughout this conversation."
    },
    {
      "Time_Start": 404.15999999999997,
      "Time_End": 408.32,
      "Text": " Now for anybody interested in a more granular spread of what applications we actually took a"
    },
    {
      "Time_Start": 408.32,
      "Time_End": 412.8,
      "Text": " look at, I've gone ahead and I've enumerated all of those applications on this slide"
    },
    {
      "Time_Start": 412.8,
      "Time_End": 417.68,
      "Text": " here. So you can see both Android and iOS, the applications by country, by name, or by state and"
    },
    {
      "Time_Start": 417.68,
      "Time_End": 424.40000000000003,
      "Text": " name, U.S. territory and name. So you can actually take a closer look at all the different individual"
    },
    {
      "Time_Start": 424.40000000000003,
      "Time_End": 431.28000000000003,
      "Text": " applications that we analyzed as part of this presentation, as part of this analysis that we're"
    },
    {
      "Time_Start": 431.28000000000003,
      "Time_End": 437.04,
      "Text": " discussing here today. Now I'd like to start by providing a brief introduction on the Exposure"
    },
    {
      "Time_Start": 437.04,
      "Time_End": 443.20000000000005,
      "Text": " Notifications API, which was created by Apple and Google back in May of 2020. I've provided a link"
    },
    {
      "Time_Start": 443.20000000000005,
      "Time_End": 447.68,
      "Text": " to the developer documentation for anybody who's interested in taking a peek at this, and this is"
    },
    {
      "Time_Start": 447.68,
      "Time_End": 454.40000000000003,
      "Text": " actually created in order to unify the way in which application developers go about creating"
    },
    {
      "Time_Start": 454.40000000000003,
      "Time_End": 459.52000000000004,
      "Text": " secure contact tracing applications, and specifically was designed with a couple goals in mind, so"
    },
    {
      "Time_Start": 459.52,
      "Time_End": 468.0,
      "Text": " security, privacy, and safety. So safely and securely notify individuals of potential exposures to COVID-19,"
    },
    {
      "Time_Start": 468.0,
      "Time_End": 473.91999999999996,
      "Text": " but also to actually reduce and limit the collection of private user information, which"
    },
    {
      "Time_Start": 473.91999999999996,
      "Time_End": 482.56,
      "Text": " simply isn't necessary but was also observed in the existence of early COVID-19 contact tracing"
    },
    {
      "Time_Start": 482.56,
      "Time_End": 488.71999999999997,
      "Text": " applications. Now the implementation of this API is very simple. It's a secure Bluetooth"
    },
    {
      "Time_Start": 488.72,
      "Time_End": 493.76000000000005,
      "Text": " implementation. It doesn't collect any other information at all, and if you're actually"
    },
    {
      "Time_Start": 493.76000000000005,
      "Time_End": 498.16,
      "Text": " interested in learning more about how this works, you can take a look at the link that I've provided"
    },
    {
      "Time_Start": 498.16,
      "Time_End": 504.8,
      "Text": " here, though it is very simple, straightforward, and this won't be the primary point of the conversation"
    },
    {
      "Time_Start": 504.8,
      "Time_End": 515.76,
      "Text": " that we drive here today. Now as we discussed on the previous slide, the Exposure Notification API"
    },
    {
      "Time_Start": 515.76,
      "Time_End": 521.2,
      "Text": " had a couple goals in mind, and tying into that slide, we're going to discuss a little bit more in"
    },
    {
      "Time_Start": 521.2,
      "Time_End": 529.2,
      "Text": " depth what the expectations of this API were when it was created, and then what the actual outcomes"
    },
    {
      "Time_Start": 529.2,
      "Time_End": 537.28,
      "Text": " and the actual results that we observed in the wild are. So hopping into the actual expectations,"
    },
    {
      "Time_Start": 537.28,
      "Time_End": 543.6,
      "Text": " Google and Apple clearly had expected that by providing core functionality for developers to"
    },
    {
      "Time_Start": 543.6,
      "Time_End": 549.12,
      "Text": " actually make secure contact tracing applications using this secure Bluetooth mechanism that they"
    },
    {
      "Time_Start": 549.12,
      "Time_End": 560.24,
      "Text": " provided in this very convenient API that health organizations and the majority of the world"
    },
    {
      "Time_Start": 560.24,
      "Time_End": 566.88,
      "Text": " would actually adopt the API and use it. Of course, as mentioned, the API's goal is to provide"
    },
    {
      "Time_Start": 566.88,
      "Time_End": 574.24,
      "Text": " that core functionality for building secure applications. Providing this API was a major"
    },
    {
      "Time_Start": 574.24,
      "Time_End": 585.92,
      "Text": " innovation, and going back to trust, it's very important that users who download COVID-19"
    },
    {
      "Time_Start": 585.92,
      "Time_End": 589.92,
      "Text": " contact tracing applications can actually trust that those applications are secure"
    },
    {
      "Time_Start": 590.64,
      "Time_End": 597.12,
      "Text": " and that they're private. So Google and Apple genuinely possess the belief that"
    },
    {
      "Time_Start": 598.9599999999999,
      "Time_End": 607.76,
      "Text": " by designing applications with security and privacy top of mind, customers or users rather"
    },
    {
      "Time_Start": 607.76,
      "Time_End": 614.0,
      "Text": " who consume those applications will see value, they will trust those applications, and it will"
    },
    {
      "Time_Start": 614.0,
      "Time_End": 621.84,
      "Text": " actually drive the utility of contact tracing applications in helping prevent the spread of this"
    },
    {
      "Time_Start": 621.84,
      "Time_End": 630.24,
      "Text": " disease. Now, in terms of the applications that we analyzed in the subset of data that we're"
    },
    {
      "Time_Start": 630.24,
      "Time_End": 637.92,
      "Text": " discussing today, of the applications we analyzed, 60% of those apps did indeed use the exposure"
    },
    {
      "Time_Start": 637.92,
      "Time_End": 646.0,
      "Text": " notification API provided by Google and Apple. So 62% of Android applications and 58% of iOS"
    },
    {
      "Time_Start": 646.0,
      "Time_End": 654.9599999999999,
      "Text": " applications. However, 40% neglected to use the exposure notification API, and they instead took"
    },
    {
      "Time_Start": 654.9599999999999,
      "Time_End": 661.4399999999999,
      "Text": " a do-it-yourself approach to security. They completely neglected the core functionalities"
    },
    {
      "Time_Start": 661.44,
      "Time_End": 668.4000000000001,
      "Text": " provided to them by Google and Apple. And in many cases, there are actually these applications,"
    },
    {
      "Time_Start": 668.4000000000001,
      "Time_End": 673.36,
      "Text": " several of them that we analyzed are collecting unnecessary additional pieces of user information,"
    },
    {
      "Time_Start": 673.36,
      "Time_End": 678.72,
      "Text": " which we'll cover in later slides. So suffice it to say there were significant security and privacy"
    },
    {
      "Time_Start": 678.72,
      "Time_End": 684.4000000000001,
      "Text": " concerns, specifically within the 40% of applications that did not use the exposure"
    },
    {
      "Time_Start": 684.4000000000001,
      "Time_End": 690.96,
      "Text": " notifications API. And this is going to be the main focus and center of our conversation today."
    },
    {
      "Time_Start": 690.96,
      "Time_End": 696.32,
      "Text": " So as opposed to focusing on the 60% of apps, which actually did use the exposure notification"
    },
    {
      "Time_Start": 696.32,
      "Time_End": 703.44,
      "Text": " API, we're actually going to be zooming in on the 40%, which deliberately elected not to use that."
    },
    {
      "Time_Start": 707.52,
      "Time_End": 712.24,
      "Text": " So finally, with regards to our testing approach, I would like to actually cover the individual"
    },
    {
      "Time_Start": 712.24,
      "Time_End": 718.1600000000001,
      "Text": " controls studied and the actual security mechanisms that we tried to take a look at with regards to"
    },
    {
      "Time_Start": 718.16,
      "Time_End": 724.8,
      "Text": " the individual applications that we analyzed. So I have gone ahead and actually listed the"
    },
    {
      "Time_Start": 724.8,
      "Time_End": 730.24,
      "Text": " individual features that we were looking for in these individual applications. And I'll actually"
    },
    {
      "Time_Start": 730.24,
      "Time_End": 735.6,
      "Text": " take some time in order to discuss each of these features, their importance, the value add, and"
    },
    {
      "Time_Start": 737.04,
      "Time_End": 743.76,
      "Text": " we can go from there. So starting at the top with string encryption, it's very important to utilize"
    },
    {
      "Time_Start": 743.76,
      "Time_End": 751.4399999999999,
      "Text": " string encryption to replace sensitive contexts that might reveal secure operations inside of the"
    },
    {
      "Time_Start": 751.4399999999999,
      "Time_End": 758.64,
      "Text": " application. Now a perfect example of this that we see in applications very regularly is API endpoints."
    },
    {
      "Time_Start": 758.64,
      "Time_End": 764.96,
      "Text": " API endpoints can be, and other sensitive strings, can be returned through reflection and can"
    },
    {
      "Time_Start": 764.96,
      "Time_End": 771.68,
      "Text": " otherwise appear throughout the application as well. It's very important to replace any of these"
    },
    {
      "Time_Start": 771.6800000000001,
      "Time_End": 778.5600000000001,
      "Text": " strings with encrypted representations that are entropy-less, that are meaningless, so that"
    },
    {
      "Time_Start": 778.5600000000001,
      "Time_End": 784.96,
      "Text": " attackers cannot easily enumerate these using tools like BoxMolly, using tools like the native"
    },
    {
      "Time_Start": 784.96,
      "Time_End": 792.6400000000001,
      "Text": " Unix command strings, or others like Redari as well. Now name obfuscation is a very basic feature."
    },
    {
      "Time_Start": 792.6400000000001,
      "Time_End": 800.24,
      "Text": " It is provided by open source optimization tools such as ProGuard, but it is really"
    },
    {
      "Time_Start": 800.96,
      "Time_End": 807.52,
      "Text": " only designed to modify the names of common identifiers of classes, methods, fields, and things"
    },
    {
      "Time_Start": 807.52,
      "Time_End": 812.4,
      "Text": " of the sort. That said, it still adds a level of complexity to your application so that when"
    },
    {
      "Time_Start": 812.4,
      "Time_End": 819.2,
      "Text": " attackers do disassemble your code, the package structure and the names of classes, methods, fields,"
    },
    {
      "Time_Start": 819.2,
      "Time_End": 825.28,
      "Text": " and things of that sort are not immediately obvious. Now data at rest encryption is very"
    },
    {
      "Time_Start": 825.28,
      "Time_End": 829.6,
      "Text": " important if you do have sensitive files or sensitive information that is stored in, for"
    },
    {
      "Time_Start": 829.6,
      "Time_End": 836.16,
      "Text": " example, SQLite files. Those should, of course, be encrypted at rest. Otherwise, what"
    },
    {
      "Time_Start": 836.16,
      "Time_End": 841.84,
      "Text": " you're actually going to find is that those files are effectively unencrypted, and this is something"
    },
    {
      "Time_Start": 841.84,
      "Time_End": 848.4,
      "Text": " that we did notice in a number of the COVID contact tracing applications is that they do"
    },
    {
      "Time_Start": 848.4,
      "Time_End": 854.72,
      "Text": " collect sensitive information that's not necessary. They do store it completely unencrypted, and"
    },
    {
      "Time_Start": 855.6,
      "Time_End": 858.48,
      "Text": " these are some of the privacy concerns that we'll discuss later."
    },
    {
      "Time_Start": 861.76,
      "Time_End": 866.08,
      "Text": " Moving on to RASP, which stands for Runtime Application Self-Protection,"
    },
    {
      "Time_Start": 867.6,
      "Time_End": 875.0400000000001,
      "Text": " these are also known as resiliency features. So if you adhere to a security framework such as"
    },
    {
      "Time_Start": 875.0400000000001,
      "Time_End": 881.28,
      "Text": " the Mobile Application Security Verification Standard by OWASP, you can actually take a look"
    },
    {
      "Time_Start": 881.28,
      "Time_End": 886.3199999999999,
      "Text": " at the Mobile Security Testing Guide. What you're going to find in there is that there"
    },
    {
      "Time_Start": 886.3199999999999,
      "Time_End": 891.28,
      "Text": " are resilience guidelines. These resilience guidelines are specifically aimed to help"
    },
    {
      "Time_Start": 891.28,
      "Time_End": 897.76,
      "Text": " organizations implement robust security controls to protect their applications both statically"
    },
    {
      "Time_Start": 897.76,
      "Time_End": 907.1999999999999,
      "Text": " and dynamically against online and offline attacks. Now we are really going to be taking a look at two"
    },
    {
      "Time_Start": 907.44,
      "Time_End": 914.4000000000001,
      "Text": " features in particular. That's going to be root detection and jailbreak detection. So those are"
    },
    {
      "Time_Start": 914.4000000000001,
      "Time_End": 921.9200000000001,
      "Text": " the equivalent feature on either platform, Android and iOS. And of course, these forms"
    },
    {
      "Time_Start": 921.9200000000001,
      "Time_End": 930.1600000000001,
      "Text": " of runtime checks are going to ensure at all entry points in the application that if it is opened,"
    },
    {
      "Time_Start": 930.88,
      "Time_End": 936.0,
      "Text": " ideally, it should crash on a jailbroken or a rooted Android device."
    },
    {
      "Time_Start": 937.76,
      "Time_End": 943.44,
      "Text": " Similarly, emulator checks are designed in order to ensure that if the application is executed on"
    },
    {
      "Time_Start": 943.44,
      "Time_End": 949.9200000000001,
      "Text": " an emulated device, for example, ADB, it will crash inside of that emulated environment."
    },
    {
      "Time_Start": 951.76,
      "Time_End": 955.9200000000001,
      "Text": " So we'll actually take a look at this. We'll see how many applications actually did use"
    },
    {
      "Time_Start": 957.0400000000001,
      "Time_End": 962.1600000000001,
      "Text": " robust controls like this and how many didn't. And we're also going to be taking a look at SSL"
    },
    {
      "Time_Start": 962.16,
      "Time_End": 968.0,
      "Text": " pinning. SSL pinning is very important to secure communications and information traveling over the"
    },
    {
      "Time_Start": 968.0,
      "Time_End": 974.64,
      "Text": " wire between the application and a backend. So if you are serializing inputs, if you are sending"
    },
    {
      "Time_Start": 975.28,
      "Time_End": 983.4399999999999,
      "Text": " sensitive information over the wire, it's very, very important to actually pin your application"
    },
    {
      "Time_Start": 983.4399999999999,
      "Time_End": 990.3199999999999,
      "Text": " to its backend, either using a certain number of public keys or certificates. And it's also"
    },
    {
      "Time_Start": 990.32,
      "Time_End": 994.6400000000001,
      "Text": " very important to further secure those implementations so that they cannot later be"
    },
    {
      "Time_Start": 994.6400000000001,
      "Time_End": 1002.96,
      "Text": " patched out, which is very common. Finally, we have arrived at app attestation. App attestation"
    },
    {
      "Time_Start": 1003.5200000000001,
      "Time_End": 1012.88,
      "Text": " just allows for the possibility of actually distinguishing that the application itself"
    },
    {
      "Time_Start": 1013.52,
      "Time_End": 1020.88,
      "Text": " is receiving a legitimate connection from the application or from an instance of that"
    },
    {
      "Time_Start": 1020.88,
      "Time_End": 1029.52,
      "Text": " application itself. So a great example of this is Google Safety Net. And this is just one of"
    },
    {
      "Time_Start": 1029.52,
      "Time_End": 1035.92,
      "Text": " the many things that we did take a look at inside of the applications that we analyzed."
    },
    {
      "Time_Start": 1036.64,
      "Time_End": 1041.68,
      "Text": " So with this in mind, we're now going to move on to an overview of the"
    },
    {
      "Time_Start": 1042.48,
      "Time_End": 1046.3200000000002,
      "Text": " data that we gathered and summarize some of those results for you."
    },
    {
      "Time_Start": 1049.3600000000001,
      "Time_End": 1055.28,
      "Text": " So now that we've explained our testing approach and our methodology, we're going to go into"
    },
    {
      "Time_Start": 1055.28,
      "Time_End": 1060.72,
      "Text": " a full overview of the data and the analysis that we actually performed,"
    },
    {
      "Time_Start": 1060.72,
      "Time_End": 1064.8000000000002,
      "Text": " as well as the takeaways that we were able to derive from analyzing that data."
    },
    {
      "Time_Start": 1066.72,
      "Time_End": 1071.68,
      "Text": " So hopping directly into the data, you can actually see here on our first slide,"
    },
    {
      "Time_Start": 1071.68,
      "Time_End": 1078.4,
      "Text": " we are taking a look at the Android applications. Now, of all of the 40% of applications that fell"
    },
    {
      "Time_Start": 1078.4,
      "Time_End": 1084.48,
      "Text": " into the category which did not use the exposure notification API, we did take a look at 20"
    },
    {
      "Time_Start": 1084.48,
      "Time_End": 1089.68,
      "Text": " do-it-yourself Android applications. And of them, we have actually mapped the different percentage"
    },
    {
      "Time_Start": 1089.68,
      "Time_End": 1093.2,
      "Text": " of those applications that adhered to the controls that we were looking for"
    },
    {
      "Time_Start": 1093.44,
      "Time_End": 1099.8400000000001,
      "Text": " and possessed these different protection mechanisms. And it's very clear that on the"
    },
    {
      "Time_Start": 1099.8400000000001,
      "Time_End": 1104.96,
      "Text": " Android side of the house, most applications don't possess these protections and therefore"
    },
    {
      "Time_Start": 1104.96,
      "Time_End": 1107.04,
      "Text": " additionally possess weak security posture."
    },
    {
      "Time_Start": 1110.56,
      "Time_End": 1115.04,
      "Text": " Piggybacking off the last slide, you can see on this slide that we provided a number of"
    },
    {
      "Time_Start": 1115.04,
      "Time_End": 1120.0800000000002,
      "Text": " applications and a percentage of applications which adhere to the control mechanisms that"
    },
    {
      "Time_Start": 1120.08,
      "Time_End": 1127.1999999999998,
      "Text": " we took a look at on the previous slide. So for example, you can actually see that 95%"
    },
    {
      "Time_Start": 1127.1999999999998,
      "Time_End": 1133.9199999999998,
      "Text": " of these applications possess two or fewer of the protections that we were looking at."
    },
    {
      "Time_Start": 1133.9199999999998,
      "Time_End": 1137.6799999999998,
      "Text": " Now, please do bear in mind that the slide that we're reviewing right now is just the"
    },
    {
      "Time_Start": 1137.6799999999998,
      "Time_End": 1143.12,
      "Text": " Android portion of the applications that we looked at. But just from a 30,000-foot view"
    },
    {
      "Time_Start": 1143.12,
      "Time_End": 1149.52,
      "Text": " of the 40% of applications that we analyzed which did not use the exposure notification API,"
    },
    {
      "Time_Start": 1149.52,
      "Time_End": 1156.8799999999999,
      "Text": " 95% of those applications used two or fewer protections, meaning they're not building"
    },
    {
      "Time_Start": 1156.8799999999999,
      "Time_End": 1161.52,
      "Text": " these applications with security or privacy in mind. And actually, zero of them had five"
    },
    {
      "Time_Start": 1161.52,
      "Time_End": 1162.8,
      "Text": " or more of these protections."
    },
    {
      "Time_Start": 1165.84,
      "Time_End": 1170.72,
      "Text": " So now taking a look at the iOS side of the house, you can see that we have equivalently"
    },
    {
      "Time_Start": 1170.72,
      "Time_End": 1175.36,
      "Text": " provided the same control mechanisms that we looked at for the Android side. And in"
    },
    {
      "Time_Start": 1175.3600000000001,
      "Time_End": 1180.16,
      "Text": " the top right-hand corner, you're going to see that for the iOS side of the house, we"
    },
    {
      "Time_Start": 1180.16,
      "Time_End": 1187.44,
      "Text": " actually analyzed 18 do-it-yourself iOS applications. By do-it-yourself, we mean these applications"
    },
    {
      "Time_Start": 1187.44,
      "Time_End": 1193.2,
      "Text": " deliberately elected not to use the exposure notification API and instead elected to implement"
    },
    {
      "Time_Start": 1194.0800000000002,
      "Time_End": 1195.3600000000001,
      "Text": " controls themselves."
    },
    {
      "Time_Start": 1196.2400000000002,
      "Time_End": 1201.7600000000002,
      "Text": " Now, what you can see is that most of these features are actually implemented very"
    },
    {
      "Time_Start": 1201.76,
      "Time_End": 1206.0,
      "Text": " conservatively across the applications that we analyzed. And actually, app attestation"
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1212.24,
      "Text": " and name obfuscation just simply don't appear at all. So once again, on the iOS side of"
    },
    {
      "Time_Start": 1212.24,
      "Time_End": 1219.04,
      "Text": " the house, we are very quickly realizing that robust security does not seem to exist inside"
    },
    {
      "Time_Start": 1219.04,
      "Time_End": 1223.76,
      "Text": " of the majority of these contact tracing applications."
    },
    {
      "Time_Start": 1223.76,
      "Time_End": 1230.64,
      "Text": " And now, once again, you can see that we have provided the same chart that we did for"
    },
    {
      "Time_Start": 1230.64,
      "Time_End": 1237.2,
      "Text": " Android in order to display the number of applications and the percentage of applications"
    },
    {
      "Time_Start": 1237.2,
      "Time_End": 1242.0,
      "Text": " which actually adhered to a certain number of the controls that we were looking for."
    },
    {
      "Time_Start": 1242.0,
      "Time_End": 1247.6,
      "Text": " So in this case, we can actually see that 61% of the iOS applications that we looked"
    },
    {
      "Time_Start": 1248.5600000000002,
      "Time_End": 1259.5200000000002,
      "Text": " at, so 11 of the 18, actually possessed two or fewer controls. And in general, 94% of"
    },
    {
      "Time_Start": 1259.5200000000002,
      "Time_End": 1265.44,
      "Text": " these applications possessed two or less. So on the Android side, we can see that 95%"
    },
    {
      "Time_Start": 1265.44,
      "Time_End": 1270.3200000000002,
      "Text": " of those applications. And on the iOS side, we can see that 94% of those applications"
    },
    {
      "Time_Start": 1270.3200000000002,
      "Time_End": 1274.3200000000002,
      "Text": " possessed two or fewer of the controls that we were looking for."
    },
    {
      "Time_Start": 1274.32,
      "Time_End": 1279.6,
      "Text": " Once again, representing that these COVID app contact tracing applications are not"
    },
    {
      "Time_Start": 1279.6,
      "Time_End": 1281.6,
      "Text": " being built with security in mind."
    },
    {
      "Time_Start": 1285.6799999999998,
      "Time_End": 1291.04,
      "Text": " Now, beyond the lack of security controls, which we were able to highlight in previous"
    },
    {
      "Time_Start": 1291.04,
      "Time_End": 1296.8,
      "Text": " slides, we also believe that privacy concerns should be a large portion of today's conversation"
    },
    {
      "Time_Start": 1296.8,
      "Time_End": 1300.8799999999999,
      "Text": " and should be illuminated. So we're going to take a look at GPS privacy concerns, which"
    },
    {
      "Time_Start": 1300.88,
      "Time_End": 1306.0800000000002,
      "Text": " we observed in a number of these different contact tracing applications. And we're going"
    },
    {
      "Time_Start": 1306.0800000000002,
      "Time_End": 1312.64,
      "Text": " to start by calling out the fact that many GPS apps or a number of the GPS apps that"
    },
    {
      "Time_Start": 1312.64,
      "Time_End": 1317.2800000000002,
      "Text": " we observed actually collect additional user information, which is not necessary, such"
    },
    {
      "Time_Start": 1317.2800000000002,
      "Time_End": 1323.7600000000002,
      "Text": " as a passport number, phone number, a device ID, or other pieces of valuable information"
    },
    {
      "Time_Start": 1323.7600000000002,
      "Time_End": 1330.16,
      "Text": " which aren't required to anonymously notify users of potential exposure. Additionally,"
    },
    {
      "Time_Start": 1330.16,
      "Time_End": 1335.92,
      "Text": " those sensitive pieces of information were, in some cases, stored in securely, such as"
    },
    {
      "Time_Start": 1335.92,
      "Time_End": 1344.88,
      "Text": " in unencrypted SQL-like databases, or potentially leaked in other ways, making them effectively"
    },
    {
      "Time_Start": 1344.88,
      "Time_End": 1353.52,
      "Text": " unencrypted. So it's very safe to say that this is definitely a privacy concern. These"
    },
    {
      "Time_Start": 1353.52,
      "Time_End": 1356.72,
      "Text": " applications actually don't need to collect additional information, which is the point"
    },
    {
      "Time_Start": 1356.8,
      "Time_End": 1362.08,
      "Text": " of the exposure notification API, which only relies on Bluetooth and does not collect any"
    },
    {
      "Time_Start": 1362.08,
      "Time_End": 1367.92,
      "Text": " other sensitive pieces of user information. And with that being said, this can actually"
    },
    {
      "Time_Start": 1367.92,
      "Time_End": 1373.3600000000001,
      "Text": " call into question the safety of these applications and potentially hinder the value"
    },
    {
      "Time_Start": 1373.3600000000001,
      "Time_End": 1378.08,
      "Text": " of contact tracing applications when it comes to combating the pandemic itself."
    },
    {
      "Time_Start": 1380.8,
      "Time_End": 1385.6000000000001,
      "Text": " So in summarizing the results, there was a gross lack of static protection amongst the"
    },
    {
      "Time_Start": 1385.6000000000001,
      "Time_End": 1390.72,
      "Text": " applications that we analyzed. And you were able to very clearly see that based on the data in the"
    },
    {
      "Time_Start": 1390.72,
      "Time_End": 1394.3200000000002,
      "Text": " previous slides, based on the controls that we looked at in the very low percentage of"
    },
    {
      "Time_Start": 1394.3200000000002,
      "Time_End": 1400.5600000000002,
      "Text": " applications that actually contained those. Similarly, the runtime protections were poorly"
    },
    {
      "Time_Start": 1400.5600000000002,
      "Time_End": 1406.2400000000002,
      "Text": " implemented. And in most cases, and in many cases, they were just not implemented at all,"
    },
    {
      "Time_Start": 1406.2400000000002,
      "Time_End": 1412.4800000000002,
      "Text": " meaning that both static reverse engineering of applications, disassembling and understanding"
    },
    {
      "Time_Start": 1412.48,
      "Time_End": 1418.08,
      "Text": " code, making changes to that code would be very feasible and trivial for attackers."
    },
    {
      "Time_Start": 1418.8,
      "Time_End": 1423.3600000000001,
      "Text": " Exploitation at runtime, so whether it be attaching debuggers, opening it on a rooted or"
    },
    {
      "Time_Start": 1423.3600000000001,
      "Time_End": 1429.52,
      "Text": " an emulated device, modifying and tampering with files, hooking functions and things of that sort,"
    },
    {
      "Time_Start": 1429.52,
      "Time_End": 1437.52,
      "Text": " once again, would all be very easy at runtime. We also noticed exposed API endpoints, which"
    },
    {
      "Time_Start": 1437.52,
      "Time_End": 1443.36,
      "Text": " makes data in transit a concern. As we mentioned, several of these applications are not only"
    },
    {
      "Time_Start": 1443.36,
      "Time_End": 1450.8,
      "Text": " collecting GPS information, but also sensitive user information. And if you're not implementing"
    },
    {
      "Time_Start": 1450.8,
      "Time_End": 1456.24,
      "Text": " SSL pinning, which most of these applications certainly were not, then data in transit is"
    },
    {
      "Time_Start": 1456.24,
      "Time_End": 1461.6,
      "Text": " a concern. And even if you do implement SSL pinning, if you don't have the robust protections,"
    },
    {
      "Time_Start": 1461.6,
      "Time_End": 1466.32,
      "Text": " both static and dynamic needed to secure those implementations and prevent attackers from just"
    },
    {
      "Time_Start": 1466.32,
      "Time_End": 1473.28,
      "Text": " patching them out either statically or at runtime by, for example, hooking those functions,"
    },
    {
      "Time_Start": 1474.48,
      "Time_End": 1479.52,
      "Text": " then once again, these SSL pinning implementations will simply be bypassed."
    },
    {
      "Time_Start": 1479.52,
      "Time_End": 1484.32,
      "Text": " So returning to the first two points, the lack of static and dynamic protection"
    },
    {
      "Time_Start": 1484.32,
      "Time_End": 1491.76,
      "Text": " is a large concern, which leads to greater issues. String encryption, for example,"
    },
    {
      "Time_Start": 1491.84,
      "Time_End": 1497.76,
      "Text": " would be able to very easily encrypt the strings or the API endpoints, very quickly mitigating"
    },
    {
      "Time_Start": 1497.76,
      "Time_End": 1503.52,
      "Text": " this risk. Finally, we were able to identify multiple different instances of rogue applications."
    },
    {
      "Time_Start": 1504.24,
      "Time_End": 1510.0,
      "Text": " So in our sources, we have provided links to a number of different cases of rogue applications"
    },
    {
      "Time_Start": 1510.64,
      "Time_End": 1517.84,
      "Text": " that are floating under the veil of COVID-19 legitimate governing bodies and applications"
    },
    {
      "Time_Start": 1518.8,
      "Time_End": 1524.08,
      "Text": " for users. But in actuality, they're masquerading as those legitimate sources,"
    },
    {
      "Time_Start": 1524.08,
      "Time_End": 1530.9599999999998,
      "Text": " hoping that unsuspecting victims will download and install their rogue application and grant"
    },
    {
      "Time_Start": 1530.9599999999998,
      "Time_End": 1537.6,
      "Text": " them permissions into either their Android or iOS device. Now, we've also seen instances of"
    },
    {
      "Time_Start": 1537.6,
      "Time_End": 1542.9599999999998,
      "Text": " ransomware appearing, once again, under the veil of COVID-19. So you can see CryDroid"
    },
    {
      "Time_Start": 1543.8400000000001,
      "Time_End": 1550.16,
      "Text": " instances that have occurred. So this is something to bear in mind. Once again, if these"
    },
    {
      "Time_Start": 1551.1200000000001,
      "Time_End": 1554.8,
      "Text": " governing bodies are not hardening their applications, then it's very easy for"
    },
    {
      "Time_Start": 1554.8,
      "Time_End": 1559.6000000000001,
      "Text": " attackers to very quickly modify them and use them as portions of phishing campaigns"
    },
    {
      "Time_Start": 1559.6000000000001,
      "Time_End": 1563.8400000000001,
      "Text": " that can be used to actually stage more sophisticated attacks downstream."
    },
    {
      "Time_Start": 1566.08,
      "Time_End": 1569.28,
      "Text": " Some other observations that we made throughout our testing and research"
    },
    {
      "Time_Start": 1570.0,
      "Time_End": 1576.32,
      "Text": " was, first of all, that application security is not determined by nation's wealth. So for example,"
    },
    {
      "Time_Start": 1576.32,
      "Time_End": 1584.6399999999999,
      "Text": " if we look at Israel, who's number 32 out of 196 in terms of GDP in the year 2020, they had"
    },
    {
      "Time_Start": 1584.6399999999999,
      "Time_End": 1589.76,
      "Text": " significantly worse application security than some of the countries in Africa who had their own"
    },
    {
      "Time_Start": 1589.76,
      "Time_End": 1594.56,
      "Text": " contact tracing app. Now, that's contrary to what we thought. We thought that a country who had high"
    },
    {
      "Time_Start": 1594.56,
      "Time_End": 1601.36,
      "Text": " GDP had a lot of money for developing a contact tracing app securely, but that's not the case."
    },
    {
      "Time_Start": 1602.6399999999999,
      "Time_End": 1608.6399999999999,
      "Text": " Second of all, GDPR and HIPAA violations were noticed, especially in the DIY apps."
    },
    {
      "Time_Start": 1609.52,
      "Time_End": 1615.6799999999998,
      "Text": " England's was one. Their test and trace program broke GDPR data laws because they weren't adhering"
    },
    {
      "Time_Start": 1617.52,
      "Time_End": 1623.2,
      "Text": " to GDPR regulations as it pertained to the storage and processing of data."
    },
    {
      "Time_Start": 1624.0800000000002,
      "Time_End": 1629.52,
      "Text": " Now, thirdly, there's the encouragement of waiving data privacy rights. There are users who are"
    },
    {
      "Time_Start": 1629.52,
      "Time_End": 1635.28,
      "Text": " downloading these applications thinking that they're robust with security and privacy in mind,"
    },
    {
      "Time_Start": 1635.28,
      "Time_End": 1641.1200000000001,
      "Text": " but that's not the case. So there needs to be transparency, and there wasn't in terms of"
    },
    {
      "Time_Start": 1641.1200000000001,
      "Time_End": 1646.56,
      "Text": " how privacy was being handled. Let's move on to flawed development and integration."
    },
    {
      "Time_Start": 1646.96,
      "Time_End": 1651.6799999999998,
      "Text": " We clearly noticed that development teams were having difficulties in a variety of areas."
    },
    {
      "Time_Start": 1652.72,
      "Time_End": 1657.76,
      "Text": " The first of them being timeline sensitivity. With the pandemic picking up in pace,"
    },
    {
      "Time_Start": 1658.32,
      "Time_End": 1664.6399999999999,
      "Text": " development had to be rushed to get a working application out as soon as possible. The sprints,"
    },
    {
      "Time_Start": 1664.6399999999999,
      "Time_End": 1669.44,
      "Text": " as a result, were focused on fixing functionality or creating that functionality,"
    },
    {
      "Time_Start": 1670.1599999999999,
      "Time_End": 1672.72,
      "Text": " leaving little consideration for security in that time."
    },
    {
      "Time_Start": 1672.8,
      "Time_End": 1676.24,
      "Text": " The second thing we noticed was that the development team had to choose between"
    },
    {
      "Time_Start": 1677.68,
      "Time_End": 1682.96,
      "Text": " their approach to constraints, whether they wanted quality, which would require a long"
    },
    {
      "Time_Start": 1682.96,
      "Time_End": 1689.68,
      "Text": " development time, or if they wanted short release time, but as a result, control the spread and"
    },
    {
      "Time_Start": 1689.68,
      "Time_End": 1697.1200000000001,
      "Text": " potentially save human lives. The third difficulty that we saw these development teams have was the"
    },
    {
      "Time_Start": 1697.6000000000001,
      "Time_End": 1702.24,
      "Text": " fact that this was such a unique solution. There hadn't been a contact tracing app before that"
    },
    {
      "Time_Start": 1702.88,
      "Time_End": 1709.7600000000002,
      "Text": " had to be released on such a large scale. There was no previous poster child. I don't think that"
    },
    {
      "Time_Start": 1709.7600000000002,
      "Time_End": 1714.4,
      "Text": " a developer could go on to Stack Overflow and get the necessary code and call it a day."
    },
    {
      "Time_Start": 1716.0800000000002,
      "Time_End": 1722.8000000000002,
      "Text": " That wasn't really possible there. The fact that these applications were handling sensitive data,"
    },
    {
      "Time_Start": 1722.8,
      "Time_End": 1729.52,
      "Text": " this had to be looked at in terms of privacy. Some applications, of course, considered privacy"
    },
    {
      "Time_Start": 1729.52,
      "Time_End": 1732.8799999999999,
      "Text": " and security very well, others didn't, but either way, there had to be some sort of"
    },
    {
      "Time_Start": 1733.9199999999998,
      "Time_End": 1737.68,
      "Text": " consideration for that sensitive data, even at minimum."
    },
    {
      "Time_Start": 1739.9199999999998,
      "Time_End": 1744.3999999999999,
      "Text": " The rush to development of these contact tracing applications didn't come without any effects."
    },
    {
      "Time_Start": 1744.96,
      "Time_End": 1747.6,
      "Text": " There's actually quite a few effects that came about as a result."
    },
    {
      "Time_Start": 1747.92,
      "Time_End": 1752.72,
      "Text": " As I mentioned in the last slide, there was a main focus on functionality of the applications"
    },
    {
      "Time_Start": 1752.72,
      "Time_End": 1758.72,
      "Text": " and a limited regard for security and privacy as a result, just mainly because the goal was"
    },
    {
      "Time_Start": 1758.72,
      "Time_End": 1764.8000000000002,
      "Text": " to develop an application as soon as possible and release it to the public. Furthermore, there was a"
    },
    {
      "Time_Start": 1764.8000000000002,
      "Time_End": 1769.2,
      "Text": " lacking of features that would allow for integration with other apps or COVID apps."
    },
    {
      "Time_Start": 1769.2,
      "Time_End": 1774.4800000000002,
      "Text": " Let's say the European Union wanted all of Europe's countries to be able to use the app,"
    },
    {
      "Time_Start": 1774.8,
      "Time_End": 1779.84,
      "Text": " the European Union wanted all of Europe's countries to integrate into one application."
    },
    {
      "Time_Start": 1780.56,
      "Time_End": 1787.68,
      "Text": " This wouldn't be possible because this integration feature wasn't built in. However, as a result,"
    },
    {
      "Time_Start": 1787.68,
      "Time_End": 1792.88,
      "Text": " less time was spent on development, which means that getting to the controlling of the spread"
    },
    {
      "Time_Start": 1792.88,
      "Time_End": 1799.3600000000001,
      "Text": " happened sooner. You can claim that as a benefit. Lastly, there was an ethical dilemma."
    },
    {
      "Time_Start": 1799.3600000000001,
      "Time_End": 1805.2,
      "Text": " These developers know that there's a known risk of security in these applications, yet"
    },
    {
      "Time_Start": 1805.2,
      "Time_End": 1811.1200000000001,
      "Text": " they're still releasing it. The question is, do you release an app that is unhardened due to lack"
    },
    {
      "Time_Start": 1811.1200000000001,
      "Time_End": 1816.48,
      "Text": " of time and money? On one hand, the spread might be thwarted, but at the same time, it's opening"
    },
    {
      "Time_Start": 1816.48,
      "Time_End": 1822.4,
      "Text": " doors for a long-term headache if these people's data get stolen. You have to weigh the long-term"
    },
    {
      "Time_Start": 1822.4,
      "Time_End": 1829.52,
      "Text": " effects against the short-term in that case. Let's move on to recommendations for timebox"
    },
    {
      "Time_Start": 1829.52,
      "Time_End": 1838.0,
      "Text": " development. The first recommendation is to unify apps. That can be done in one of two ways,"
    },
    {
      "Time_Start": 1838.0,
      "Time_End": 1844.88,
      "Text": " or both. The first being using a common API, and the second being consolidating apps. The first way"
    },
    {
      "Time_Start": 1844.88,
      "Time_End": 1854.24,
      "Text": " is using one of Google's or Apple's APIs, also known as the Notification Exposure API, or similar."
    },
    {
      "Time_Start": 1854.24,
      "Time_End": 1860.3200000000002,
      "Text": " I put an asterisk there because I believe that it doesn't necessarily have to be a private company"
    },
    {
      "Time_Start": 1860.3200000000002,
      "Time_End": 1867.2,
      "Text": " solution. It could be a public government-created solution. Either way, global issues should be"
    },
    {
      "Time_Start": 1867.2,
      "Time_End": 1872.5600000000002,
      "Text": " fought on a global scale. There should be that common API that should be utilized when it's"
    },
    {
      "Time_Start": 1872.56,
      "Time_End": 1877.6799999999998,
      "Text": " there. The second, as I mentioned, is consolidating apps. There are way too many apps on the app"
    },
    {
      "Time_Start": 1877.6799999999998,
      "Time_End": 1884.8799999999999,
      "Text": " stores. Users have trouble knowing which one's legitimate, which one's not. The fact that there"
    },
    {
      "Time_Start": 1884.8799999999999,
      "Time_End": 1890.0,
      "Text": " are so many state-level apps, that's just contributing to the issue. To that, we're"
    },
    {
      "Time_Start": 1890.0,
      "Time_End": 1898.0,
      "Text": " just saying, no, let's skip not having these state-level apps. Country is fine, but making"
    },
    {
      "Time_Start": 1898.08,
      "Time_End": 1906.32,
      "Text": " sure that it's utilizing the common API and not a do-it-yourself one. Anybody who's not"
    },
    {
      "Time_Start": 1906.32,
      "Time_End": 1912.08,
      "Text": " complying with this, our thoughts are that they should be fined. There's going to be proposed"
    },
    {
      "Time_Start": 1912.88,
      "Time_End": 1917.36,
      "Text": " contact tracing app requirements, and anybody who's not adhering to them should be fined."
    },
    {
      "Time_Start": 1919.12,
      "Time_End": 1924.8,
      "Text": " The second thing we'd like to recommend is a security-focused SDLC. For those of you who"
    },
    {
      "Time_Start": 1924.8,
      "Time_End": 1930.48,
      "Text": " aren't familiar with what an SDLC is, it's a software development life cycle. It's typically"
    },
    {
      "Time_Start": 1930.48,
      "Time_End": 1939.6,
      "Text": " found in companies and pertains to how development goes from start to finish. We're particularly"
    },
    {
      "Time_Start": 1939.6,
      "Time_End": 1946.3999999999999,
      "Text": " recommending a shift-left approach, which means including security earlier and at every phase,"
    },
    {
      "Time_Start": 1946.3999999999999,
      "Time_End": 1949.76,
      "Text": " meaning that it's everywhere, and that it's a forethought, not an afterthought."
    },
    {
      "Time_Start": 1950.24,
      "Time_End": 1956.4,
      "Text": " We're recommending that teams aren't siloed. If there's a security team, we want them to work"
    },
    {
      "Time_Start": 1956.4,
      "Time_End": 1962.64,
      "Text": " with a development team for communication to be facilitated. There doesn't have to be a"
    },
    {
      "Time_Start": 1962.64,
      "Time_End": 1969.76,
      "Text": " pick-one approach to choosing either functionality or security. You can have both. That's the fact"
    },
    {
      "Time_Start": 1969.76,
      "Time_End": 1975.6,
      "Text": " that these development and security teams can work in parallel together, especially when new"
    },
    {
      "Time_Start": 1975.6000000000001,
      "Time_End": 1981.2800000000002,
      "Text": " features are being released. There could be an iterative approach where security is constantly"
    },
    {
      "Time_Start": 1981.2800000000002,
      "Time_End": 1988.0800000000002,
      "Text": " being checked in these features. One thing that would allow for security tests in these types of"
    },
    {
      "Time_Start": 1988.72,
      "Time_End": 1995.1200000000001,
      "Text": " feature releases is something called a technical security review, which documents that there's"
    },
    {
      "Time_Start": 1995.1200000000001,
      "Time_End": 2002.72,
      "Text": " been scanning in the code that's been performed, documents the inter-service communication."
    },
    {
      "Time_Start": 2003.3600000000001,
      "Time_End": 2006.8,
      "Text": " The service has to communicate with another service. That will be documented there,"
    },
    {
      "Time_Start": 2007.52,
      "Time_End": 2011.28,
      "Text": " along with any scanning results, testing that had been done."
    },
    {
      "Time_Start": 2012.0,
      "Time_End": 2018.16,
      "Text": " If there is no software development lifecycle, in the case that a company doesn't have to adhere to"
    },
    {
      "Time_Start": 2019.1200000000001,
      "Time_End": 2026.56,
      "Text": " PCI regulations or HIPAA, what have you, then typically you can hook it into an existing"
    },
    {
      "Time_Start": 2026.56,
      "Time_End": 2033.04,
      "Text": " change management process. You can hook security processes into that because whenever there's an"
    },
    {
      "Time_Start": 2033.04,
      "Time_End": 2037.6,
      "Text": " application that gets added to an inventory, let's say, typically there's a change management process"
    },
    {
      "Time_Start": 2037.6,
      "Time_End": 2043.6799999999998,
      "Text": " for that. Very similarly, you can just include security aspects to be included in that."
    },
    {
      "Time_Start": 2045.76,
      "Time_End": 2052.56,
      "Text": " Now, with regards to development requirements, we have a number of recommendations that we"
    },
    {
      "Time_Start": 2052.56,
      "Time_End": 2060.48,
      "Text": " would provide, starting with adhering to some form of security standard or security framework"
    },
    {
      "Time_Start": 2060.48,
      "Time_End": 2068.24,
      "Text": " like OWASP. You can take a closer look at, for example, OWASP Mobile Application Security"
    },
    {
      "Time_Start": 2068.24,
      "Time_End": 2076.0,
      "Text": " Verification Standard or the Mobile Security Testing Guide, which both will act as an excellent"
    },
    {
      "Time_Start": 2076.0,
      "Time_End": 2080.7999999999997,
      "Text": " blueprint for security specialists that are looking to implement robust controls inside of"
    },
    {
      "Time_Start": 2080.8,
      "Time_End": 2087.76,
      "Text": " their mobile applications. And then also, as mentioned in the second point here, add resilience"
    },
    {
      "Time_Start": 2087.76,
      "Time_End": 2094.4,
      "Text": " to that application so that it can stand up to and defend itself from sophisticated attackers,"
    },
    {
      "Time_Start": 2094.4,
      "Time_End": 2101.92,
      "Text": " both statically and dynamically. Now, we also recommend employing a masked scanning solution"
    },
    {
      "Time_Start": 2102.8,
      "Time_End": 2106.96,
      "Text": " so that you can identify vulnerabilities in code and actually remediate those."
    },
    {
      "Time_Start": 2107.6,
      "Time_End": 2113.84,
      "Text": " And we also then recommend implementing a code hardening solution. So, as we were able to"
    },
    {
      "Time_Start": 2113.84,
      "Time_End": 2118.16,
      "Text": " illuminate earlier and identify most of the applications we're taking a look at here don't"
    },
    {
      "Time_Start": 2118.16,
      "Time_End": 2124.2400000000002,
      "Text": " have any form of obfuscation, string encryption, runtime application self-protection mechanisms,"
    },
    {
      "Time_Start": 2124.8,
      "Time_End": 2132.16,
      "Text": " or other basic security components which would be useful in deterring bad actors. So,"
    },
    {
      "Time_Start": 2133.12,
      "Time_End": 2139.04,
      "Text": " by employing a code hardening solution, you can make it infeasible for those attackers who"
    },
    {
      "Time_Start": 2139.04,
      "Time_End": 2144.3199999999997,
      "Text": " are actually looking to make modifications and nefariously attack those applications."
    },
    {
      "Time_Start": 2145.6,
      "Time_End": 2154.0,
      "Text": " And lastly, we hope that the final product through these recommendations will be a more"
    },
    {
      "Time_Start": 2154.0,
      "Time_End": 2162.48,
      "Text": " safe and secure privacy-focused application that earns the trust of its users and overall"
    },
    {
      "Time_Start": 2163.2,
      "Time_End": 2168.8,
      "Text": " results in improved adoption and utility in combating this pandemic."
    },
    {
      "Time_Start": 2171.84,
      "Time_End": 2177.52,
      "Text": " Now, on the previous slide, we recommended a code hardening solution. And the reason for this is"
    },
    {
      "Time_Start": 2177.52,
      "Time_End": 2184.88,
      "Text": " that in all fairness and in our honest experience, we can tell you that most teams, while"
    },
    {
      "Time_Start": 2184.88,
      "Time_End": 2190.0,
      "Text": " they do have what's needed to build a functional application, don't have what they need to implement"
    },
    {
      "Time_Start": 2190.0,
      "Time_End": 2197.7599999999998,
      "Text": " robust security controls. In fact, most development teams are focused on functionality and performance"
    },
    {
      "Time_Start": 2197.7599999999998,
      "Time_End": 2205.04,
      "Text": " of that application. But it's very important to consider that these government bodies"
    },
    {
      "Time_Start": 2205.92,
      "Time_End": 2211.2,
      "Text": " who should actually be employing robust security controls to protect their user base"
    },
    {
      "Time_Start": 2211.92,
      "Time_End": 2216.64,
      "Text": " should be using a code hardening solution. Code hardening solutions, like some of the ones that"
    },
    {
      "Time_Start": 2216.64,
      "Time_End": 2222.64,
      "Text": " I'm about to recommend, will actually allow you to implement robust security controls in a very"
    },
    {
      "Time_Start": 2222.64,
      "Time_End": 2228.24,
      "Text": " short amount of time. More than that, what I can say is that as most of these security teams don't"
    },
    {
      "Time_Start": 2228.2400000000002,
      "Time_End": 2235.44,
      "Text": " possess in-house specialization in the area, they don't have the manpower to keep up with"
    },
    {
      "Time_Start": 2235.44,
      "Time_End": 2242.96,
      "Text": " the evolving threat landscape. So just the updates with Magisk and check rain and jailbreaking"
    },
    {
      "Time_Start": 2242.96,
      "Time_End": 2249.92,
      "Text": " routing of devices alone can be a very mighty task for development teams to manage. This is why by"
    },
    {
      "Time_Start": 2249.92,
      "Time_End": 2257.6800000000003,
      "Text": " outsourcing this type of work to a specialist firm or an actual enterprise-grade solution,"
    },
    {
      "Time_Start": 2257.68,
      "Time_End": 2262.64,
      "Text": " you can receive all the benefits of those protections and you can actually get wonderful"
    },
    {
      "Time_Start": 2262.64,
      "Time_End": 2268.8799999999997,
      "Text": " support when you need it. It'll all be maintained for you and you can really just focus on"
    },
    {
      "Time_Start": 2268.8799999999997,
      "Time_End": 2274.7999999999997,
      "Text": " implementing the features which are necessary as opposed to managing security, which quite frankly,"
    },
    {
      "Time_Start": 2274.7999999999997,
      "Time_End": 2280.3999999999996,
      "Text": " most of these governing bodies are woefully unprepared to do. So getting into the actual"
    },
    {
      "Time_Start": 2280.3999999999996,
      "Time_End": 2285.68,
      "Text": " meat and potatoes of today's slide besides the why for code protection, I think that's clear."
    },
    {
      "Time_Start": 2286.08,
      "Time_End": 2290.72,
      "Text": " These governing bodies need to harden their code. They need to protect the sensitive user"
    },
    {
      "Time_Start": 2290.72,
      "Time_End": 2293.52,
      "Text": " data if they're going to collect it in the first place, which they shouldn't be."
    },
    {
      "Time_Start": 2294.3999999999996,
      "Time_End": 2300.16,
      "Text": " And regardless, they need to earn the trust of their user bases to further drive adoption."
    },
    {
      "Time_Start": 2301.9199999999996,
      "Time_End": 2307.2799999999997,
      "Text": " So with that in mind, to provide an agnostic recommendation, again, and you can look up"
    },
    {
      "Time_Start": 2307.2799999999997,
      "Time_End": 2312.3199999999997,
      "Text": " different code hardening solutions, I highly recommend GuardSquare. GuardSquare is the"
    },
    {
      "Time_Start": 2312.32,
      "Time_End": 2317.76,
      "Text": " leader in mobile application protection, offering code hardening solutions, both obfuscation and"
    },
    {
      "Time_Start": 2317.76,
      "Time_End": 2323.76,
      "Text": " encryption, runtime application self-protection, real-time threat event monitoring, and"
    },
    {
      "Time_Start": 2324.56,
      "Time_End": 2332.48,
      "Text": " application scanning solutions for both iOS, Android, Unity, and hybrid applications alike."
    },
    {
      "Time_Start": 2332.48,
      "Time_End": 2337.28,
      "Text": " So if you are operating on a mobile platform, I highly recommend reaching out to GuardSquare,"
    },
    {
      "Time_Start": 2338.0,
      "Time_End": 2344.4,
      "Text": " scheduling a demo. You can feel free to reach out to me. And with that in mind, we can actually"
    },
    {
      "Time_Start": 2344.4,
      "Time_End": 2349.2000000000003,
      "Text": " help you address not only your pain points, but how we can help you address those pain points by"
    },
    {
      "Time_Start": 2349.2000000000003,
      "Time_End": 2354.4,
      "Text": " implementing robust security controls. Now, tying into the topic of the previous"
    },
    {
      "Time_Start": 2354.4,
      "Time_End": 2361.52,
      "Text": " slide in code hardening, really folding into this, is the idea and the importance of actually"
    },
    {
      "Time_Start": 2361.52,
      "Time_End": 2367.6,
      "Text": " adopting the triple constraint. And the triple constraint is the idea of balancing time, cost,"
    },
    {
      "Time_Start": 2367.6,
      "Time_End": 2373.52,
      "Text": " and quality. But in practice, we often find that you really many times can only pick two."
    },
    {
      "Time_Start": 2374.08,
      "Time_End": 2379.7599999999998,
      "Text": " So I think this pandemic situation really underscored a perfect use case whereby they"
    },
    {
      "Time_Start": 2379.7599999999998,
      "Time_End": 2385.12,
      "Text": " just didn't have enough time. They rushed applications to market. They didn't put"
    },
    {
      "Time_Start": 2385.12,
      "Time_End": 2392.24,
      "Text": " money into specialized security knowledge or enterprise-grade code hardening solutions that"
    },
    {
      "Time_Start": 2392.24,
      "Time_End": 2398.4,
      "Text": " really could help implement these solutions. And as a result, they really suffered in the"
    },
    {
      "Time_Start": 2398.4,
      "Time_End": 2403.2799999999997,
      "Text": " quality department. If they had implemented security properly and actually standardized"
    },
    {
      "Time_Start": 2403.2799999999997,
      "Time_End": 2409.52,
      "Text": " the way they went about things from the right, from the get-go, if they had employed the correct"
    },
    {
      "Time_Start": 2410.24,
      "Time_End": 2416.64,
      "Text": " specialists in order to do this, then they really wouldn't have had these problems. But"
    },
    {
      "Time_Start": 2417.2,
      "Time_End": 2421.12,
      "Text": " it comes down to the fact that they haven't spent money on these solutions"
    },
    {
      "Time_Start": 2421.7599999999998,
      "Time_End": 2428.08,
      "Text": " in order to fix the problem correctly. The second thing that's important to acknowledge"
    },
    {
      "Time_Start": 2428.08,
      "Time_End": 2433.84,
      "Text": " is that it's not always just a matter of time or money. It's a matter of skill."
    },
    {
      "Time_Start": 2433.84,
      "Time_End": 2441.28,
      "Text": " And so with that in mind, it's very important to accept the fact that many teams don't have"
    },
    {
      "Time_Start": 2441.28,
      "Time_End": 2446.2400000000002,
      "Text": " the specialized in-house knowledge for security. They're development teams. And that's totally fine."
    },
    {
      "Time_Start": 2446.2400000000002,
      "Time_End": 2452.0,
      "Text": " Development is one thing. Security is a completely another thing. And it's completely fine to"
    },
    {
      "Time_Start": 2452.0,
      "Time_End": 2459.28,
      "Text": " outsource this and to buy an SDK that allows you to properly secure your mobile application."
    },
    {
      "Time_Start": 2459.84,
      "Time_End": 2467.1200000000003,
      "Text": " Developers buy SDKs all the time for the purpose of saving time and not having to put specialists"
    },
    {
      "Time_Start": 2467.1200000000003,
      "Time_End": 2472.48,
      "Text": " into actually designing that thing. So really, security should not be viewed differently."
    },
    {
      "Time_Start": 2472.48,
      "Time_End": 2477.0400000000004,
      "Text": " If you don't have the knowledge to implement it yourself, you should purchase the solution"
    },
    {
      "Time_Start": 2477.0400000000004,
      "Time_End": 2482.7200000000003,
      "Text": " from somebody else or at least governing bodies who are producing what are supposed to be"
    },
    {
      "Time_Start": 2482.7200000000003,
      "Time_End": 2489.6000000000004,
      "Text": " legitimized applications that are safe and secure for users. They should be doing this."
    },
    {
      "Time_Start": 2491.5200000000004,
      "Time_End": 2501.36,
      "Text": " And lastly, it's very important to avoid the do-it-yourself scenario as much as possible,"
    },
    {
      "Time_Start": 2502.1600000000003,
      "Time_End": 2509.1200000000003,
      "Text": " because we're finding that most of the time, sophisticated attackers find a way to bypass that."
    },
    {
      "Time_Start": 2509.6,
      "Time_End": 2518.0,
      "Text": " So if you don't have a solution that is backed by research and is tested in many environments,"
    },
    {
      "Time_Start": 2518.56,
      "Time_End": 2522.08,
      "Text": " then attackers are going to very quickly bypass that do-it-yourself implementation"
    },
    {
      "Time_Start": 2522.72,
      "Time_End": 2528.64,
      "Text": " using instrumentation tools and other methods. And it's really not going to get you very far."
    },
    {
      "Time_Start": 2530.08,
      "Time_End": 2535.04,
      "Text": " So with this in mind, it's advisable to once again, use a code hardening solution,"
    },
    {
      "Time_Start": 2535.52,
      "Time_End": 2540.32,
      "Text": " especially in the event that you don't have a specialization. In many cases,"
    },
    {
      "Time_Start": 2541.04,
      "Time_End": 2545.52,
      "Text": " it's a whole lot cheaper than employing a bunch of specialists to do it in-house."
    },
    {
      "Time_Start": 2546.96,
      "Time_End": 2552.4,
      "Text": " But also, the solution will be managed for you. You can get support. And in many times,"
    },
    {
      "Time_Start": 2552.4,
      "Time_End": 2558.4,
      "Text": " it just equates to less effort in that sense as well. If you enjoyed the topic of this presentation,"
    },
    {
      "Time_Start": 2558.4,
      "Time_End": 2562.16,
      "Text": " we'd like to recommend some ideas for future projects that you can take on yourself."
    },
    {
      "Time_Start": 2563.12,
      "Time_End": 2568.24,
      "Text": " Quite simply, vaccine passport applications. They're very similar to contact tracing"
    },
    {
      "Time_Start": 2568.24,
      "Time_End": 2573.2799999999997,
      "Text": " applications, but they've had more development time as they're not time-pressed in terms of"
    },
    {
      "Time_Start": 2573.2799999999997,
      "Time_End": 2578.3999999999996,
      "Text": " development as they're racing against the surging pandemic. They're also more unified,"
    },
    {
      "Time_Start": 2578.3999999999996,
      "Time_End": 2584.64,
      "Text": " meaning that a whole region such as the European Union is only relying on one application versus"
    },
    {
      "Time_Start": 2584.64,
      "Time_End": 2589.6,
      "Text": " a multitude. But there's still a reason to be skeptical because we've seen the way that"
    },
    {
      "Time_Start": 2589.68,
      "Time_End": 2595.44,
      "Text": " the development approach has been for the contact tracing applications. Despite there being more"
    },
    {
      "Time_Start": 2595.44,
      "Time_End": 2602.08,
      "Text": " time, it doesn't necessarily mean that development has included security practices and processes."
    },
    {
      "Time_Start": 2602.96,
      "Time_End": 2607.6,
      "Text": " Some test cases we'd like to recommend there is seeing if you can change the approval status"
    },
    {
      "Time_Start": 2607.6,
      "Time_End": 2614.24,
      "Text": " of uploaded COVID tests, and also seeing if you can bypass the proof of vaccination validation,"
    },
    {
      "Time_Start": 2614.2400000000002,
      "Time_End": 2618.5600000000004,
      "Text": " where I believe you upload a picture of your vaccination card."
    },
    {
      "Time_Start": 2619.76,
      "Time_End": 2623.5200000000004,
      "Text": " And with that, we'd like to open it up to any questions. Thank you."
    },
    {
      "Time_Start": 2644.2400000000002,
      "Time_End": 2644.7400000000002,
      "Text": " Thank you."
    },
    {
      "Time_Start": 2674.2400000000002,
      "Time_End": 2674.7400000000002,
      "Text": " Thank you."
    }
  ]
}