{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.16,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Hey everyone, welcome to my talk on Operators, EDR Sensors, and OODA Loops, Understanding"
    },
    {
      "Time_Start": 15.16,
      "Time_End": 20.36,
      "Text": " and Exploiting Defensive Loops to Win Operations. It's an honor to be able to present this,"
    },
    {
      "Time_Start": 20.36,
      "Time_End": 23.88,
      "Text": " and I wanted to thank you for taking the time to watch this, and a big thank you to the"
    },
    {
      "Time_Start": 23.88,
      "Time_End": 29.04,
      "Text": " organizers of ZivCon for the work that they do behind the scenes. I also started a blog"
    },
    {
      "Time_Start": 29.04,
      "Time_End": 33.839999999999996,
      "Text": " post series on how to evade EDRs or APPs as some might call them, but I just haven't"
    },
    {
      "Time_Start": 33.839999999999996,
      "Time_End": 37.2,
      "Text": " gotten around to completing it. It's something I'd like to get back to later when I have"
    },
    {
      "Time_Start": 37.2,
      "Time_End": 42.16,
      "Text": " the time, but if any of you have been following that, then you can consider this talk as another"
    },
    {
      "Time_Start": 42.16,
      "Time_End": 47.76,
      "Text": " paradigm to think about the same topic without necessarily supplanting the paradigm in that"
    },
    {
      "Time_Start": 47.76,
      "Time_End": 52.879999999999995,
      "Text": " series. I'm also aware that I certainly have gaps in my understanding on this topic,"
    },
    {
      "Time_Start": 52.879999999999995,
      "Time_End": 58.32,
      "Text": " so I welcome any critical questions or comments that come out of this so that my assumptions"
    },
    {
      "Time_Start": 58.32,
      "Time_End": 62.32,
      "Text": " can be challenged, and I think it's also a great way to learn. Just so I'm not wasting"
    },
    {
      "Time_Start": 62.32,
      "Time_End": 66.84,
      "Text": " anyone's time, I wanted to say that this talk isn't about some special secret sauce"
    },
    {
      "Time_Start": 66.84,
      "Time_End": 72.2,
      "Text": " or universal silver bullet that can bypass EDR products. Instead, this talk is about"
    },
    {
      "Time_Start": 72.2,
      "Time_End": 77.08,
      "Text": " how we make decisions as operators, and how we can use that to our advantage when up against"
    },
    {
      "Time_Start": 77.08,
      "Time_End": 82.38,
      "Text": " EDR sensors. So on the slide you can see the agenda. I'll go over OODA Loops for those"
    },
    {
      "Time_Start": 82.38,
      "Time_End": 86.97999999999999,
      "Text": " that aren't familiar with them, as well as my interpretation of how that applies"
    },
    {
      "Time_Start": 86.97999999999999,
      "Time_End": 91.97999999999999,
      "Text": " to operators. Then we'll go over how to leverage that same decision-making process"
    },
    {
      "Time_Start": 91.97999999999999,
      "Time_End": 97.5,
      "Text": " we use as operators to understand how EDR sensors work, and how to circumvent them."
    },
    {
      "Time_Start": 97.5,
      "Time_End": 102.17999999999999,
      "Text": " And lastly, I'll sum it up with some takeaways and things that you can consider as you're"
    },
    {
      "Time_Start": 102.17999999999999,
      "Time_End": 107.66,
      "Text": " in the process of evading EDRs. So my name is Jackson, also known on Twitter as JacksonT."
    },
    {
      "Time_Start": 108.06,
      "Time_End": 112.38,
      "Text": " A bit about myself, I did my bachelor's degree at the University of Toronto in Canada,"
    },
    {
      "Time_Start": 112.38,
      "Time_End": 117.42,
      "Text": " which is where I'm from. I majored in public policy, did a double minor in psychology and"
    },
    {
      "Time_Start": 117.42,
      "Time_End": 122.7,
      "Text": " computer science. My hobbies are in red teaming and vulnerability research, and I used to work"
    },
    {
      "Time_Start": 122.7,
      "Time_End": 127.66,
      "Text": " for Disney's internal red team, and prior to that I was a consultant at Security Compass,"
    },
    {
      "Time_Start": 127.66,
      "Time_End": 132.62,
      "Text": " focusing on application security and vulnerability research, which is how I got my start in this"
    },
    {
      "Time_Start": 132.62,
      "Time_End": 138.06,
      "Text": " field. I bring up the social science background because although I'm definitely not an expert,"
    },
    {
      "Time_Start": 138.06,
      "Time_End": 143.02,
      "Text": " I like to understand how people think and how they make decisions. Some might recognize the"
    },
    {
      "Time_Start": 143.02,
      "Time_End": 148.62,
      "Text": " avatar there as the logo for Kumon, it's what they call the thinking face. When I was a red"
    },
    {
      "Time_Start": 148.62,
      "Time_End": 153.66,
      "Text": " team operator, our operations were very scenario-based and we had a specific starting point"
    },
    {
      "Time_Start": 153.66,
      "Time_End": 159.18,
      "Text": " and a specific business goal to reach at the end of the op. One of my favourite parts about each op"
    },
    {
      "Time_Start": 159.18,
      "Time_End": 164.78,
      "Text": " was this process where as a team we reasoned about our current situation and then we decided"
    },
    {
      "Time_Start": 164.78,
      "Time_End": 169.5,
      "Text": " what our next course of action should be, and we would do this again and again and again"
    },
    {
      "Time_Start": 169.5,
      "Time_End": 175.34,
      "Text": " as we inched closer to our goal. What it came down to was this repeatable or looped process"
    },
    {
      "Time_Start": 175.34,
      "Time_End": 181.82,
      "Text": " where as operators we observed the environment we were up against, then we identified our options,"
    },
    {
      "Time_Start": 181.82,
      "Time_End": 188.46,
      "Text": " we weighed them, and then we selected one that we acted on. Of course, this situational awareness and"
    },
    {
      "Time_Start": 188.46,
      "Time_End": 193.82000000000002,
      "Text": " tactical decision-making isn't really unique to red teaming. It can be applied to many areas"
    },
    {
      "Time_Start": 193.82000000000002,
      "Time_End": 198.62,
      "Text": " of life and it's one of the focuses of the cognitive sciences, operations research,"
    },
    {
      "Time_Start": 198.62,
      "Time_End": 203.58,
      "Text": " military psychology, and more. And that's what eventually led me to John Boyd's work on what"
    },
    {
      "Time_Start": 203.58,
      "Time_End": 209.5,
      "Text": " he called the OODA loop. I'll give you a moment to take a look at this, especially for those of"
    },
    {
      "Time_Start": 209.5,
      "Time_End": 211.42000000000002,
      "Text": " you that aren't already familiar with it."
    },
    {
      "Time_Start": 219.02,
      "Time_End": 224.46,
      "Text": " So to give some background here, John Boyd was a fighter pilot and strategist in the US Air Force"
    },
    {
      "Time_Start": 224.46,
      "Time_End": 230.46,
      "Text": " and he came up with this OODA loop model while analysing dogfights. OODA stands for Observe,"
    },
    {
      "Time_Start": 230.46,
      "Time_End": 236.86,
      "Text": " Orient, Decide, and Act, and this loop provides a structured way of transforming the information"
    },
    {
      "Time_Start": 236.86,
      "Time_End": 243.26000000000002,
      "Text": " we sense and perceive into action. It's a way of showing how we make complex decisions based"
    },
    {
      "Time_Start": 243.26,
      "Time_End": 249.57999999999998,
      "Text": " on limited context and evidence of unfolding situations. To speak a bit about each process,"
    },
    {
      "Time_Start": 249.57999999999998,
      "Time_End": 254.14,
      "Text": " we start with Observe, which is scanning the environment and gathering information from as"
    },
    {
      "Time_Start": 254.14,
      "Time_End": 259.5,
      "Text": " many sources as possible. Then we have Orient, which is analysing the information we get,"
    },
    {
      "Time_Start": 259.5,
      "Time_End": 265.74,
      "Text": " synthesising it into meaningful knowledge where we can understand what options are available to us"
    },
    {
      "Time_Start": 265.74,
      "Time_End": 270.94,
      "Text": " and what we can do with them. Then we have Decide, which is considering those options"
    },
    {
      "Time_Start": 270.94,
      "Time_End": 276.3,
      "Text": " and then selecting a subsequent course of action, and then finally Act, which is carrying out that"
    },
    {
      "Time_Start": 276.3,
      "Time_End": 282.06,
      "Text": " selected decision. As you're looking at this and are internalising for those that aren't already"
    },
    {
      "Time_Start": 282.06,
      "Time_End": 288.22,
      "Text": " familiar with it, it's worth noting that this isn't a single threaded flow where you just focus"
    },
    {
      "Time_Start": 288.22,
      "Time_End": 294.78,
      "Text": " on these one at a time in isolation. Instead, these are parallel and interrelated processes"
    },
    {
      "Time_Start": 294.78,
      "Time_End": 300.14,
      "Text": " that you continuously cycle through. In the next few slides, I'll go over what this loop looks like"
    },
    {
      "Time_Start": 300.14,
      "Time_End": 304.21999999999997,
      "Text": " for operators, at least in the way that I'm interpreting it based on my experience, and then"
    },
    {
      "Time_Start": 304.21999999999997,
      "Time_End": 309.74,
      "Text": " I'll provide an example after that. Before I begin explaining the operator Zoodle loop, it's worth"
    },
    {
      "Time_Start": 309.74,
      "Time_End": 314.7,
      "Text": " saying that number one, this isn't the main part of the talk, and number two, this is most likely"
    },
    {
      "Time_Start": 314.7,
      "Time_End": 319.9,
      "Text": " stuff that you already do, and there's really nothing particularly new to learn from. So why"
    },
    {
      "Time_Start": 319.9,
      "Time_End": 325.82,
      "Text": " am I talking about this? Well, the idea is to take a step back and explain our day-to-day work in the"
    },
    {
      "Time_Start": 325.82,
      "Time_End": 330.7,
      "Text": " context of this model, so that when we go over EDR sensors later with the same model, we can see"
    },
    {
      "Time_Start": 330.7,
      "Time_End": 336.7,
      "Text": " the parallels more clearly. Starting with the observe process, this is where we seek and gather"
    },
    {
      "Time_Start": 336.7,
      "Time_End": 341.26,
      "Text": " information from our environment, and it gets fed into the orient process. So from an operator's"
    },
    {
      "Time_Start": 341.26,
      "Time_End": 345.74,
      "Text": " standpoint, I look at this as a combination of what we gather from the target environment and"
    },
    {
      "Time_Start": 345.74,
      "Time_End": 349.82,
      "Text": " what we gather outside of it. So from the target environment, this can include things like"
    },
    {
      "Time_Start": 349.82,
      "Time_End": 355.34,
      "Text": " enumerating a target company's subdomains or open shares in its network, and it also includes"
    },
    {
      "Time_Start": 355.34000000000003,
      "Time_End": 361.26000000000005,
      "Text": " observing the consequences of our actions, whether what we did brought us closer to our objective"
    },
    {
      "Time_Start": 361.26000000000005,
      "Time_End": 366.94000000000005,
      "Text": " or further from it, and whether it raised suspicions from defenders. And self-growth also plays into"
    },
    {
      "Time_Start": 366.94000000000005,
      "Time_End": 372.22,
      "Text": " this, where we're gathering information about the latest TTPs from our Twitter feeds as an example,"
    },
    {
      "Time_Start": 372.22,
      "Time_End": 377.18,
      "Text": " and just generally speaking, continuously consuming other material that help us learn and grow."
    },
    {
      "Time_Start": 377.82000000000005,
      "Time_End": 382.3,
      "Text": " Next, we have the orient process, which is where we analyze and synthesize our observations and"
    },
    {
      "Time_Start": 382.3,
      "Time_End": 388.06,
      "Text": " then produce options as a result. You can call them solutions or paths. I use them somewhat"
    },
    {
      "Time_Start": 388.06,
      "Time_End": 392.54,
      "Text": " interchangeably in this context, but this is basically where we ask ourselves, what does this"
    },
    {
      "Time_Start": 392.54,
      "Time_End": 397.98,
      "Text": " information mean to us, and what can we do about it? And I think this is why tools like Bloodhound,"
    },
    {
      "Time_Start": 397.98,
      "Time_End": 403.34000000000003,
      "Text": " Auspex, Grouper, etc., they provide a lot of value because they're good at automating some of the"
    },
    {
      "Time_Start": 403.34000000000003,
      "Time_End": 409.66,
      "Text": " observe and orient parts for us. For example, with AD, the Sharphound collector serves as an active"
    },
    {
      "Time_Start": 409.66,
      "Time_End": 414.3,
      "Text": " observer to gather information about the environment, and when the results of that get fed"
    },
    {
      "Time_Start": 414.3,
      "Time_End": 419.66,
      "Text": " into Bloodhound, we can get a sense of what options or attack paths are available to us to reach a"
    },
    {
      "Time_Start": 419.66,
      "Time_End": 426.38,
      "Text": " certain resource. When I look at the paths available to us from an evade EDR or EPP standpoint, there"
    },
    {
      "Time_Start": 426.38,
      "Time_End": 431.58000000000004,
      "Text": " are these four categories of options that come to mind. The first one is avoidance, where you just"
    },
    {
      "Time_Start": 431.58000000000004,
      "Time_End": 437.18,
      "Text": " avoid directly operating on systems that have the products installed. Companies often have saturation"
    },
    {
      "Time_Start": 437.18,
      "Time_End": 442.3,
      "Text": " issues, so it's something to take advantage of where you can. The second one is abusing blind"
    },
    {
      "Time_Start": 442.3,
      "Time_End": 447.98,
      "Text": " spots, where sometimes the sensor doesn't collect on or doesn't report on certain types of events."
    },
    {
      "Time_Start": 447.98,
      "Time_End": 453.82,
      "Text": " This could just be a configuration issue, or it could be a missing implementation in the software."
    },
    {
      "Time_Start": 454.46000000000004,
      "Time_End": 459.82,
      "Text": " Third is blending in, where the malicious activity we're performing fits in so well that it's hard"
    },
    {
      "Time_Start": 459.82,
      "Time_End": 465.34000000000003,
      "Text": " for defenders to distinguish between what's benign and what's not. And lastly, we have sensor"
    },
    {
      "Time_Start": 465.34000000000003,
      "Time_End": 471.34000000000003,
      "Text": " tampering, which I see as reducing the sensor's capabilities across any of these four processes."
    },
    {
      "Time_Start": 472.22,
      "Time_End": 477.1,
      "Text": " Decide is the next process, and this is where we deliberate on the options we've identified and"
    },
    {
      "Time_Start": 477.1,
      "Time_End": 481.82000000000005,
      "Text": " then select a course of action. This is where we can consider what's important to us and then"
    },
    {
      "Time_Start": 481.82000000000005,
      "Time_End": 487.74,
      "Text": " figure out what to do that best represents those values. So I usually look at this as a constraint"
    },
    {
      "Time_Start": 487.74,
      "Time_End": 493.58000000000004,
      "Text": " satisfaction problem, and usually for Red Team Ops, I try to pick the option that moves us closer"
    },
    {
      "Time_Start": 493.58,
      "Time_End": 499.9,
      "Text": " to the operational goal of course, is unlikely to be detected, and is a path of least resistance."
    },
    {
      "Time_Start": 500.78,
      "Time_End": 505.09999999999997,
      "Text": " But it's worth taking a step back and asking, well why are those our constraints?"
    },
    {
      "Time_Start": 505.9,
      "Time_End": 511.58,
      "Text": " Well in my mind, one way we can decide on a course of action is to tie it to the engagement type."
    },
    {
      "Time_Start": 512.22,
      "Time_End": 516.78,
      "Text": " You might have internal penetration tests with the goal of achieving a certain scenario,"
    },
    {
      "Time_Start": 516.78,
      "Time_End": 520.38,
      "Text": " but without needing to be covert, whereas something like that would matter for"
    },
    {
      "Time_Start": 521.34,
      "Time_End": 527.18,
      "Text": " Red Team Operations. And in some operations, there could be additional constraints that make it a"
    },
    {
      "Time_Start": 527.18,
      "Time_End": 532.54,
      "Text": " top priority to reduce liabilities that lead to attribution and other consequences."
    },
    {
      "Time_Start": 533.34,
      "Time_End": 538.46,
      "Text": " But those constraints aren't likely to be the highest priority for most Red Team Operations,"
    },
    {
      "Time_Start": 538.46,
      "Time_End": 544.06,
      "Text": " because if you get caught, the stakes aren't as high, and you can eventually put your hands up"
    },
    {
      "Time_Start": 544.06,
      "Time_End": 549.66,
      "Text": " and still say that it's the Red Team. I know there's definitely varying definitions when it"
    },
    {
      "Time_Start": 549.66,
      "Time_End": 555.18,
      "Text": " comes to these engagement types, but in my mind, what matters most for this decision-making process"
    },
    {
      "Time_Start": 555.18,
      "Time_End": 560.86,
      "Text": " is identifying the constraints that have been imposed, and then evaluating our options against"
    },
    {
      "Time_Start": 560.86,
      "Time_End": 565.74,
      "Text": " them. So at this point, we're going to take a small detour, and I'll show another way to look"
    },
    {
      "Time_Start": 565.74,
      "Time_End": 570.86,
      "Text": " at constraints by using six principles from Macky Monty's Computer Network Exploitation,"
    },
    {
      "Time_Start": 570.86,
      "Time_End": 576.3,
      "Text": " or C&E framework. He wrote about these in his book called Network Attacks and Exploitation,"
    },
    {
      "Time_Start": 576.3000000000001,
      "Time_End": 582.7,
      "Text": " which is definitely a gem as far as offensive security books go. Although I'll try to spend"
    },
    {
      "Time_Start": 582.7,
      "Time_End": 587.98,
      "Text": " the next few minutes describing these principles, I just can't quite do it justice here, so I'd"
    },
    {
      "Time_Start": 587.98,
      "Time_End": 592.5400000000001,
      "Text": " recommend getting his book instead. It's not too long of a read, and you can probably just spend a"
    },
    {
      "Time_Start": 592.5400000000001,
      "Time_End": 597.98,
      "Text": " weekend ingesting the material there. So after I go through these principles, I'll then map it back"
    },
    {
      "Time_Start": 597.98,
      "Time_End": 604.22,
      "Text": " to how we can use them to make decisions during ops. So the first one here is knowledge, which is"
    },
    {
      "Time_Start": 604.22,
      "Time_End": 611.26,
      "Text": " the broad and deep understanding of technology, people, and organizations. If we can think of"
    },
    {
      "Time_Start": 611.26,
      "Time_End": 616.22,
      "Text": " this principle as being variable, then we might want to consider what type of skill set do we"
    },
    {
      "Time_Start": 616.22,
      "Time_End": 621.34,
      "Text": " want to emulate. Could it be a script kitty that can get some IP addresses and run tools against"
    },
    {
      "Time_Start": 621.34,
      "Time_End": 626.22,
      "Text": " them? Or perhaps a more advanced adversary that not only understands the technology,"
    },
    {
      "Time_Start": 626.22,
      "Time_End": 632.5400000000001,
      "Text": " but also the psychological characteristics of the people they're targeting, and be able to find gaps"
    },
    {
      "Time_Start": 632.54,
      "Time_End": 638.2199999999999,
      "Text": " to exploit in the target enterprise's policy, their norms, and their organizational structure."
    },
    {
      "Time_Start": 639.3399999999999,
      "Time_End": 645.74,
      "Text": " The next one here is innovation, which is creating or adapting technology and methodology to new"
    },
    {
      "Time_Start": 645.74,
      "Time_End": 650.62,
      "Text": " circumstances. So an example could be getting stuck on something, like maybe having a script"
    },
    {
      "Time_Start": 650.62,
      "Time_End": 655.98,
      "Text": " not work, and then making adjustments to adapt it to its environment, and then you're good to go,"
    },
    {
      "Time_Start": 655.98,
      "Time_End": 661.5,
      "Text": " and you're not blocked anymore. So when I look at this as a variable, I see it as the degree to"
    },
    {
      "Time_Start": 661.5,
      "Time_End": 669.02,
      "Text": " which we intend to demonstrate novel capabilities. Awareness involves mapping out the operational"
    },
    {
      "Time_Start": 669.02,
      "Time_End": 674.38,
      "Text": " domain and being able to detect and monitor relevant events. So you can think of using"
    },
    {
      "Time_Start": 674.38,
      "Time_End": 679.1,
      "Text": " Bloodhound as a good example where you're actually mapping out AD domains and then digging through"
    },
    {
      "Time_Start": 679.1,
      "Time_End": 685.34,
      "Text": " the company's internal wiki to identify targets that can help build awareness. But mapping out"
    },
    {
      "Time_Start": 685.34,
      "Time_End": 690.38,
      "Text": " the operational domain is half of it. The other half is being able to get a sense of what's"
    },
    {
      "Time_Start": 690.38,
      "Time_End": 696.06,
      "Text": " relevant to you in near real time or possible. And what you get when you combine these two is"
    },
    {
      "Time_Start": 696.06,
      "Time_End": 701.66,
      "Text": " something like a marauder's map. So with this, you can orient yourself in the environment and get a"
    },
    {
      "Time_Start": 701.66,
      "Time_End": 707.42,
      "Text": " sense of where you should be going, but also be able to understand the likelihood and consequences"
    },
    {
      "Time_Start": 707.42,
      "Time_End": 712.7,
      "Text": " of getting caught. Precaution is the fourth one, and this is about minimizing the impact of"
    },
    {
      "Time_Start": 712.7,
      "Time_End": 717.98,
      "Text": " unwitting actions that are outside of your control. Let's say if a code base is refactored,"
    },
    {
      "Time_Start": 717.98,
      "Time_End": 722.46,
      "Text": " then you might lose the backdoor that you've implanted into it. Or when ACLs change, you might"
    },
    {
      "Time_Start": 722.46,
      "Time_End": 728.3000000000001,
      "Text": " lose your access. But the fact of the matter is that these things just occasionally happen as part"
    },
    {
      "Time_Start": 728.3000000000001,
      "Time_End": 733.26,
      "Text": " of the day to day efforts in the target environment, usually without them knowing that you're there."
    },
    {
      "Time_Start": 733.26,
      "Time_End": 738.0600000000001,
      "Text": " So this is where adding points of access that are redundant and diverse come into play."
    },
    {
      "Time_Start": 739.74,
      "Time_End": 744.46,
      "Text": " Operational security is probably one that almost all of us actively think about during Red Team"
    },
    {
      "Time_Start": 744.46,
      "Time_End": 750.5400000000001,
      "Text": " Ops, and it involves minimizing these three things, the exposure, detection, and reaction"
    },
    {
      "Time_Start": 750.5400000000001,
      "Time_End": 756.7,
      "Text": " to an operation. Lastly, we have program security, which is containing the damage caused by the"
    },
    {
      "Time_Start": 756.7,
      "Time_End": 761.5,
      "Text": " compromise of an operation. Like I mentioned earlier, when real attackers get caught, there's"
    },
    {
      "Time_Start": 761.5,
      "Time_End": 766.14,
      "Text": " more at stake and they can have a lot more to lose. There are liabilities around attribution,"
    },
    {
      "Time_Start": 766.14,
      "Time_End": 771.58,
      "Text": " attacker infrastructure, and the exposure of private capabilities. So I think in most Red"
    },
    {
      "Time_Start": 771.58,
      "Time_End": 778.14,
      "Text": " Teams, this is something that can be emulated to a degree. But for many places, whether the service"
    },
    {
      "Time_Start": 778.14,
      "Time_End": 783.98,
      "Text": " is provided in-house or externally, at least from my experience, I'm not sure how common or even how"
    },
    {
      "Time_Start": 783.98,
      "Time_End": 789.9000000000001,
      "Text": " appropriate an economic model would be that justifies the cost or investment of emulating"
    },
    {
      "Time_Start": 789.9000000000001,
      "Time_End": 795.34,
      "Text": " this properly at a very high degree. But anyway, Matthew's book goes into this and other topics in"
    },
    {
      "Time_Start": 795.34,
      "Time_End": 798.86,
      "Text": " detail. So it's definitely worth a read if this is something that interests you."
    },
    {
      "Time_Start": 799.82,
      "Time_End": 803.1800000000001,
      "Text": " So yeah, these are the principles I try to keep in mind while doing Ops."
    },
    {
      "Time_Start": 803.82,
      "Time_End": 809.02,
      "Text": " I'm definitely not perfect at it, but I can see how they fit in the context of this OODA loop model."
    },
    {
      "Time_Start": 809.66,
      "Time_End": 814.78,
      "Text": " So whenever I have some attack path options available to me, I can decide on which to"
    },
    {
      "Time_Start": 814.78,
      "Time_End": 820.46,
      "Text": " choose by looking at these principles as variables in a data type we can call a tradecraft policy."
    },
    {
      "Time_Start": 821.26,
      "Time_End": 826.0600000000001,
      "Text": " Each variable maps back to the degree to how much or how little we intend to demonstrate"
    },
    {
      "Time_Start": 826.0600000000001,
      "Time_End": 831.82,
      "Text": " the principle, perhaps represented as a Likert scale. And then these variables become a mix of"
    },
    {
      "Time_Start": 831.82,
      "Time_End": 837.4200000000001,
      "Text": " hard and soft constraints when a policy is defined. What this means is that any engagement"
    },
    {
      "Time_Start": 837.4200000000001,
      "Time_End": 843.98,
      "Text": " type can be represented with a tradecraft policy. So as we review the options available to us,"
    },
    {
      "Time_Start": 843.98,
      "Time_End": 850.46,
      "Text": " we can then evaluate them against the constraints and then more objectively get a sense of how each"
    },
    {
      "Time_Start": 850.46,
      "Time_End": 856.46,
      "Text": " of the available options score against the policy. And then we can pick one that's optimal"
    },
    {
      "Time_Start": 856.46,
      "Time_End": 860.86,
      "Text": " if there is one. Otherwise, we just pick one within the feasible region of options."
    },
    {
      "Time_Start": 862.22,
      "Time_End": 867.34,
      "Text": " And I'll say that the substance of this shouldn't be new to most of us. This is just kind of part"
    },
    {
      "Time_Start": 867.34,
      "Time_End": 872.22,
      "Text": " of our intuition. But that said, I find it useful to have some sort of mental framework"
    },
    {
      "Time_Start": 872.22,
      "Time_End": 877.1,
      "Text": " to cross-check that intuition and then be able to defend decisions that way."
    },
    {
      "Time_Start": 878.0600000000001,
      "Time_End": 882.22,
      "Text": " Now, when you bring these variables back to labels like red team, adversary emulation,"
    },
    {
      "Time_Start": 882.22,
      "Time_End": 886.94,
      "Text": " internal pentest, and so on, I'll say with what we're seeing here, this isn't a perfect depiction,"
    },
    {
      "Time_Start": 886.94,
      "Time_End": 892.62,
      "Text": " and there's certainly room for disagreement. But the idea is to put the labels aside and to think"
    },
    {
      "Time_Start": 892.62,
      "Time_End": 897.74,
      "Text": " about what these engagement types mean based on the constraints imposed on them. For example,"
    },
    {
      "Time_Start": 897.74,
      "Time_End": 903.34,
      "Text": " an internal pentest might take OPSEC less seriously than a red team op, and a red team op"
    },
    {
      "Time_Start": 903.34,
      "Time_End": 908.62,
      "Text": " might take program security less seriously than a real-world offensive op, so it's somewhat"
    },
    {
      "Time_Start": 908.62,
      "Time_End": 915.58,
      "Text": " relative. Moving on, in the ACT process, this is where you execute on the decision you deliberated"
    },
    {
      "Time_Start": 915.58,
      "Time_End": 920.14,
      "Text": " on to use as a TTP. For those of you familiar with the MITRE ATT&CK framework, you can think"
    },
    {
      "Time_Start": 920.14,
      "Time_End": 926.5400000000001,
      "Text": " of an action as the same as executing on any of the TTPs here. And all of the OODLELOO processes"
    },
    {
      "Time_Start": 926.54,
      "Time_End": 931.0999999999999,
      "Text": " that occur before this one can explain how and why you chose your TTPs."
    },
    {
      "Time_Start": 933.02,
      "Time_End": 938.14,
      "Text": " In my mind, and I'm not sure if this is a fair interpretation, but I would expand the ACT process"
    },
    {
      "Time_Start": 938.14,
      "Time_End": 942.9399999999999,
      "Text": " to include the things you do both in the operational environment and the non-operational"
    },
    {
      "Time_Start": 942.9399999999999,
      "Time_End": 949.26,
      "Text": " environment. So in the operational environment, there are also administrative tasks like seeking"
    },
    {
      "Time_Start": 949.26,
      "Time_End": 954.4599999999999,
      "Text": " guidance on targeting and tradecraft and also producing daily status reports. And in the"
    },
    {
      "Time_Start": 954.46,
      "Time_End": 959.82,
      "Text": " non-operational environment, there's continual development with capabilities and infrastructure,"
    },
    {
      "Time_Start": 959.82,
      "Time_End": 966.5400000000001,
      "Text": " and there's also continual self-growth. At this point, I'll move away from the abstract concepts"
    },
    {
      "Time_Start": 966.5400000000001,
      "Time_End": 970.7,
      "Text": " and try to put some grounding on them by way of a simplified operational example."
    },
    {
      "Time_Start": 971.58,
      "Time_End": 976.46,
      "Text": " This over here is a sanitized and modified version of a scenario that I had encountered"
    },
    {
      "Time_Start": 976.46,
      "Time_End": 981.5,
      "Text": " in the past where there was an assumed breach starting point, and the goal was to get access"
    },
    {
      "Time_Start": 981.58,
      "Time_End": 987.9,
      "Text": " to a server with the crown jewels. So starting with Observe, we gather a lot of information during"
    },
    {
      "Time_Start": 987.9,
      "Time_End": 992.46,
      "Text": " operations, usually at a faster pace than we can articulate. So for the sake of this scenario,"
    },
    {
      "Time_Start": 992.46,
      "Time_End": 997.58,
      "Text": " I'll just go over a few. First, we have the data from our Sharphound collection, which includes"
    },
    {
      "Time_Start": 997.58,
      "Time_End": 1002.78,
      "Text": " groups, group memberships, active sessions, computers, and so on from the domain that we're"
    },
    {
      "Time_Start": 1002.78,
      "Time_End": 1009.34,
      "Text": " targeting. We also have credentials for a utility service account that were found in a file at some"
    },
    {
      "Time_Start": 1009.34,
      "Time_End": 1014.14,
      "Text": " point during the auth. And then as we're traversing through the environment, we can see that"
    },
    {
      "Time_Start": 1014.14,
      "Time_End": 1021.26,
      "Text": " this fancy EDR 2000 product is installed on most endpoints we come across, and that LSAS is lacking"
    },
    {
      "Time_Start": 1021.26,
      "Time_End": 1027.58,
      "Text": " protections like credential guard or having PPL enabled. And in addition to the observations we"
    },
    {
      "Time_Start": 1027.58,
      "Time_End": 1031.82,
      "Text": " make from the operational environment, from a self-growth standpoint, we have this growing"
    },
    {
      "Time_Start": 1031.82,
      "Time_End": 1037.9,
      "Text": " knowledge of various LSAS dumping techniques. On the right, you can see our situation model,"
    },
    {
      "Time_Start": 1037.9,
      "Time_End": 1041.98,
      "Text": " which is the mental representation of the situation described in our problem."
    },
    {
      "Time_Start": 1042.6200000000001,
      "Time_End": 1047.5800000000002,
      "Text": " Based on our Bloodhound data, there is a path available to this crown jewel server,"
    },
    {
      "Time_Start": 1048.22,
      "Time_End": 1053.3400000000001,
      "Text": " but we can't directly authenticate to the server using the credentials that we currently have."
    },
    {
      "Time_Start": 1053.3400000000001,
      "Time_End": 1058.7,
      "Text": " So instead, we can pivot to a jump box, which has an active session for an account that can"
    },
    {
      "Time_Start": 1058.7,
      "Time_End": 1065.18,
      "Text": " authenticate to the target server. Another path also involves this Bertha Scott user."
    },
    {
      "Time_Start": 1065.18,
      "Time_End": 1069.98,
      "Text": " Now it turns out that the service account that we have access to, we can use that to change the"
    },
    {
      "Time_Start": 1069.98,
      "Time_End": 1075.1000000000001,
      "Text": " password for this user. And we can use that to directly log into the crown jewel server."
    },
    {
      "Time_Start": 1076.38,
      "Time_End": 1081.18,
      "Text": " We can also tell from some previous experience cross-checked with online searches that"
    },
    {
      "Time_Start": 1081.18,
      "Time_End": 1087.5800000000002,
      "Text": " this fancy EDR 2000 product actually isn't that fancy in that it's good at detecting"
    },
    {
      "Time_Start": 1087.5800000000002,
      "Time_End": 1093.5,
      "Text": " malicious command lines, but not much more than that. So we might be good if we just manage not,"
    },
    {
      "Time_Start": 1093.5,
      "Time_End": 1097.82,
      "Text": " if we manage not to use lull bins that have easily signatured command lines."
    },
    {
      "Time_Start": 1099.26,
      "Time_End": 1103.98,
      "Text": " And lastly, if we go with the credential dumping route, we can try to map our understanding of"
    },
    {
      "Time_Start": 1103.98,
      "Time_End": 1109.02,
      "Text": " LSAS dumping techniques, the ones that we know about to the operational environment."
    },
    {
      "Time_Start": 1109.02,
      "Time_End": 1113.1,
      "Text": " So here you can see that they're divided into techniques that are, that can be invoked by"
    },
    {
      "Time_Start": 1113.1,
      "Time_End": 1118.38,
      "Text": " certain command lines processes versus techniques where you invoke specific Windows API functions."
    },
    {
      "Time_Start": 1118.5400000000002,
      "Time_End": 1124.14,
      "Text": " So it looks like we have a couple options from the orient phase to process to get to the crown"
    },
    {
      "Time_Start": 1124.14,
      "Time_End": 1129.74,
      "Text": " jewel server. But the decide process is where we can apply constraints to make an optimal choice."
    },
    {
      "Time_Start": 1130.7800000000002,
      "Time_End": 1136.3000000000002,
      "Text": " In this scenario, we're doing a so-called internal penetration test with the blue team looped in."
    },
    {
      "Time_Start": 1136.3000000000002,
      "Time_End": 1143.2600000000002,
      "Text": " So OPSEC isn't really a high priority. But if in the sense that if we're caught, it's not the end"
    },
    {
      "Time_Start": 1143.9,
      "Time_End": 1149.74,
      "Text": " of the OP, and we can still keep going. But at the same time, we want to avoid denial of service"
    },
    {
      "Time_Start": 1149.74,
      "Time_End": 1154.46,
      "Text": " where possible. So practically speaking, I think that dampers our ability to change"
    },
    {
      "Time_Start": 1154.46,
      "Time_End": 1159.02,
      "Text": " Bertha Scott password. So we won't be able to get access to the crown jewels a bit more directly."
    },
    {
      "Time_Start": 1160.3799999999999,
      "Time_End": 1164.94,
      "Text": " Program security is considered important in the sense that if we have secret sauce for"
    },
    {
      "Time_Start": 1164.94,
      "Time_End": 1170.3799999999999,
      "Text": " dumping credentials, we'd want to use them only when it fits the situation and the timing is right."
    },
    {
      "Time_Start": 1170.46,
      "Time_End": 1175.9,
      "Text": " We're also given some guidance to try to achieve the path of least resistance. So we could put a"
    },
    {
      "Time_Start": 1175.9,
      "Time_End": 1181.98,
      "Text": " cap on capabilities that require higher levels of knowledge and innovation unless they're required."
    },
    {
      "Time_Start": 1182.5400000000002,
      "Time_End": 1188.94,
      "Text": " So what that means is we can put API based LSAS dumping techniques on hold unless we need to use"
    },
    {
      "Time_Start": 1188.94,
      "Time_End": 1195.3400000000001,
      "Text": " them. And that we know that the EDR is great at blocking processes with suspicious command lines."
    },
    {
      "Time_Start": 1195.34,
      "Time_End": 1202.22,
      "Text": " So to work around that, we can use task manager to dump LSAS over RDP, which wouldn't create a"
    },
    {
      "Time_Start": 1202.22,
      "Time_End": 1209.02,
      "Text": " suspicious command line. Now we've effectively filtered down our options to one that we can act"
    },
    {
      "Time_Start": 1209.02,
      "Time_End": 1215.34,
      "Text": " on, we can use the utility service account to RDP into the jump box server, then we can launch task"
    },
    {
      "Time_Start": 1215.34,
      "Time_End": 1220.6999999999998,
      "Text": " manager, right click dump LSAS. And that can get us credentials or hashes for that crown jewel"
    },
    {
      "Time_Start": 1221.5,
      "Time_End": 1225.5800000000002,
      "Text": " And that can get us credentials or hashes for that crown jewel service account."
    },
    {
      "Time_Start": 1226.14,
      "Time_End": 1230.54,
      "Text": " And with those we can finally laterally move to the crown jewel server for collection."
    },
    {
      "Time_Start": 1231.5800000000002,
      "Time_End": 1236.94,
      "Text": " So hopefully I didn't bore you too much with this section. The point here really isn't to show how"
    },
    {
      "Time_Start": 1236.94,
      "Time_End": 1242.54,
      "Text": " to dump LSAS or any new operational technique. It's really just to spell out how the decision"
    },
    {
      "Time_Start": 1242.54,
      "Time_End": 1248.3,
      "Text": " making process in our day to day operations work fits into this OODA loop model. So that when we"
    },
    {
      "Time_Start": 1248.3,
      "Time_End": 1254.06,
      "Text": " go into this next section on EDR evasion and try to apply the same model, we can see the parallels"
    },
    {
      "Time_Start": 1254.06,
      "Time_End": 1260.78,
      "Text": " more clearly. And that brings us to the main question, how do we win against EDR sensors?"
    },
    {
      "Time_Start": 1261.74,
      "Time_End": 1267.26,
      "Text": " So most of the historic research I've read around EDR bypasses, they kind of look at them as a black"
    },
    {
      "Time_Start": 1267.26,
      "Time_End": 1271.58,
      "Text": " box in the sense that you just try throwing a bunch of payloads at them and you see what sticks."
    },
    {
      "Time_Start": 1272.46,
      "Time_End": 1275.98,
      "Text": " And you can also look at what alerts show up in a customer dashboard."
    },
    {
      "Time_Start": 1276.46,
      "Time_End": 1282.22,
      "Text": " And that collective experience is kind of what shapes how we decide on how to bypass products"
    },
    {
      "Time_Start": 1282.22,
      "Time_End": 1287.18,
      "Text": " the next time we're up against them. The downside though, is that we usually don't really see the"
    },
    {
      "Time_Start": 1287.18,
      "Time_End": 1291.5,
      "Text": " technical reasons why something worked or why something failed. It just kind of ends up being"
    },
    {
      "Time_Start": 1291.5,
      "Time_End": 1297.58,
      "Text": " anecdotal. And that's been changing. There continues to be a growing amount of public"
    },
    {
      "Time_Start": 1297.58,
      "Time_End": 1303.9,
      "Text": " research on understanding per product internals and taking advantage of them. So from what I'm"
    },
    {
      "Time_Start": 1303.9,
      "Time_End": 1309.66,
      "Text": " seeing, a larger subset of them focus on the observed part, like using unhooking, disabling"
    },
    {
      "Time_Start": 1309.66,
      "Time_End": 1316.14,
      "Text": " ANSI, using direct syscalls to deliberately limit the EDR's visibility. And I think it's reasonable"
    },
    {
      "Time_Start": 1316.14,
      "Time_End": 1322.46,
      "Text": " to approach it from this angle first, because it focuses on the sensor's perimeter. And we can more"
    },
    {
      "Time_Start": 1322.46,
      "Time_End": 1328.6200000000001,
      "Text": " easily leverage existing knowledge of OS internals to understand how sensors interface with the OS."
    },
    {
      "Time_Start": 1328.6200000000001,
      "Time_End": 1333.8200000000002,
      "Text": " So in some way, this kind of serves as a path of least resistance. But there's also a smaller"
    },
    {
      "Time_Start": 1333.82,
      "Time_End": 1339.58,
      "Text": " subset of offensive research that focuses on how the sensor makes sense of the raw events that it"
    },
    {
      "Time_Start": 1339.58,
      "Time_End": 1344.7,
      "Text": " receives and how it reacts to them. And I'll go into these in the next few slides. But what I'm"
    },
    {
      "Time_Start": 1344.7,
      "Time_End": 1350.7,
      "Text": " trying to convey here in this slide is that when we look at EDR sensors in this cognitive model,"
    },
    {
      "Time_Start": 1350.7,
      "Time_End": 1356.1399999999999,
      "Text": " we should recognize that EDR sensors also have OODA loops, and that to win against them,"
    },
    {
      "Time_Start": 1356.1399999999999,
      "Time_End": 1362.86,
      "Text": " using John Boyd's terms, you have to operate inside their OODA loops. So what this means to me"
    },
    {
      "Time_Start": 1362.8600000000001,
      "Time_End": 1369.42,
      "Text": " is understanding EDR sensors and the context of each process of the loop, and then figuring out"
    },
    {
      "Time_Start": 1369.42,
      "Time_End": 1374.22,
      "Text": " how to circumvent each process where appropriate. And the way I've approached this is to kind of"
    },
    {
      "Time_Start": 1374.22,
      "Time_End": 1380.3000000000002,
      "Text": " loosely look at each process in the context of the CIA triad. From there, you'll also want to"
    },
    {
      "Time_Start": 1380.3000000000002,
      "Time_End": 1385.42,
      "Text": " operate your offensive loop at a faster pace than the defensive loop. Although defenders have been"
    },
    {
      "Time_Start": 1385.42,
      "Time_End": 1390.8600000000001,
      "Text": " catching up quickly, which is great, attackers still fundamentally have more agility by operating"
    },
    {
      "Time_Start": 1390.94,
      "Time_End": 1396.46,
      "Text": " in smaller and nimble groups. So essentially, what you do is improve each process in your"
    },
    {
      "Time_Start": 1396.46,
      "Time_End": 1402.38,
      "Text": " operator loop in a way that allows you to make better and faster choices than defenders. And as"
    },
    {
      "Time_Start": 1402.38,
      "Time_End": 1408.3000000000002,
      "Text": " a result, this can create some ambiguity, confusion, paralysis, maybe to some degree,"
    },
    {
      "Time_Start": 1408.3000000000002,
      "Time_End": 1413.8200000000002,
      "Text": " but according to this model, it'll slow down their ability to respond. So that's a very high"
    },
    {
      "Time_Start": 1413.8200000000002,
      "Time_End": 1420.0600000000002,
      "Text": " level overview of how to win according to the OODA model. But I'm now going to dive a little deeper"
    },
    {
      "Time_Start": 1420.06,
      "Time_End": 1425.74,
      "Text": " and take you through how EDRs work in the context of each process of the loop. And I'll try to go"
    },
    {
      "Time_Start": 1425.74,
      "Time_End": 1431.4199999999998,
      "Text": " over how to circumvent each process in the context of the CIA triad and try to provide some examples"
    },
    {
      "Time_Start": 1431.4199999999998,
      "Time_End": 1437.6599999999999,
      "Text": " as well. So real quick, I mentioned earlier that I was loosely applying the CIA triad to this."
    },
    {
      "Time_Start": 1437.6599999999999,
      "Time_End": 1441.8999999999999,
      "Text": " I'm not really sure if I'm using the best terms here or if we even need to be this granular,"
    },
    {
      "Time_Start": 1441.8999999999999,
      "Time_End": 1446.3799999999999,
      "Text": " but I added this slide just to provide some more context. Basically, with confidentiality,"
    },
    {
      "Time_Start": 1446.38,
      "Time_End": 1450.46,
      "Text": " you're not really tampering the sensor. It's just kind of more about deep dive research"
    },
    {
      "Time_Start": 1450.46,
      "Time_End": 1455.5,
      "Text": " and analysis. You're really just learning more about it and how it's configured so that you can"
    },
    {
      "Time_Start": 1455.5,
      "Time_End": 1460.0600000000002,
      "Text": " use that knowledge to win. But with integrity and availability, that's where it can involve"
    },
    {
      "Time_Start": 1460.0600000000002,
      "Time_End": 1466.5400000000002,
      "Text": " some level of tampering, where you're shaping or disabling specific behaviors that work toward"
    },
    {
      "Time_Start": 1466.5400000000002,
      "Time_End": 1472.22,
      "Text": " your interests, but against the defender's interests. Starting with the observe process,"
    },
    {
      "Time_Start": 1472.22,
      "Time_End": 1477.58,
      "Text": " this involves the intake of information, which includes observing both OS-level events and also"
    },
    {
      "Time_Start": 1477.58,
      "Time_End": 1482.38,
      "Text": " accepting communications directed towards its different components. When the sensor decides"
    },
    {
      "Time_Start": 1482.38,
      "Time_End": 1487.58,
      "Text": " to perform an action on a system, then it's also in a position to observe the events that unfold"
    },
    {
      "Time_Start": 1487.58,
      "Time_End": 1492.94,
      "Text": " from that interaction. A few examples are listed here that include OS interactions like being able"
    },
    {
      "Time_Start": 1492.94,
      "Time_End": 1498.6200000000001,
      "Text": " to monitor process creations, file writes, API usage, and so on. But there's also updates to"
    },
    {
      "Time_Start": 1498.6200000000001,
      "Time_End": 1504.14,
      "Text": " signatures and models, as well as updates to the sensor's configuration and policy, which,"
    },
    {
      "Time_Start": 1504.14,
      "Time_End": 1508.94,
      "Text": " as we'll go into the next sections, help respectively with the orient and decide processes."
    },
    {
      "Time_Start": 1510.0600000000002,
      "Time_End": 1515.9,
      "Text": " If we go back to the task manager LSAS dumping example, we can ask ourselves what raw events are"
    },
    {
      "Time_Start": 1515.9,
      "Time_End": 1521.0200000000002,
      "Text": " available for a sensor to observe. So we don't have to get into the details as much because"
    },
    {
      "Time_Start": 1521.0200000000002,
      "Time_End": 1526.0600000000002,
      "Text": " that could be a talk on its own, but with what we have listed here, we have a couple kernel mode"
    },
    {
      "Time_Start": 1526.06,
      "Time_End": 1531.1799999999998,
      "Text": " callbacks that can let the sensor know about the creation of the task manager process in addition"
    },
    {
      "Time_Start": 1531.1799999999998,
      "Time_End": 1537.4199999999998,
      "Text": " to whether it created a process handle on LSAS. We also have an inline user mode hook for when"
    },
    {
      "Time_Start": 1537.4199999999998,
      "Time_End": 1542.7,
      "Text": " task manager attempts to read process memory for LSAS, and another filter driver callback"
    },
    {
      "Time_Start": 1542.7,
      "Time_End": 1548.1399999999999,
      "Text": " which lets it know about the dump file being created in the temp folder. Now I imagine there"
    },
    {
      "Time_Start": 1548.1399999999999,
      "Time_End": 1552.62,
      "Text": " could be more relevant and redundant forms of telemetry, but just for the sake of example,"
    },
    {
      "Time_Start": 1552.7,
      "Time_End": 1558.3000000000002,
      "Text": " I'll limit it to these. When it comes to attacking the observe process of the sensors loop,"
    },
    {
      "Time_Start": 1558.3000000000002,
      "Time_End": 1563.66,
      "Text": " we have a few options available to us. First, we can get visibility into exactly what kind of"
    },
    {
      "Time_Start": 1563.66,
      "Time_End": 1568.7800000000002,
      "Text": " telemetry is being collected from the OS, and that's where the telemetry sorcerer tool on the"
    },
    {
      "Time_Start": 1568.7800000000002,
      "Time_End": 1574.94,
      "Text": " top right does for enumerating kernel mode callbacks, inline user mode hooks, and ETW providers."
    },
    {
      "Time_Start": 1574.94,
      "Time_End": 1579.98,
      "Text": " And it's worth spending the time to understand what each of these can capture and the value they"
    },
    {
      "Time_Start": 1579.98,
      "Time_End": 1584.3,
      "Text": " provide so that if you're tampering with sensors, it's done in a more meaningful way."
    },
    {
      "Time_Start": 1584.94,
      "Time_End": 1591.9,
      "Text": " And on that topic, a popular option these days tends to be around the removal of inline user"
    },
    {
      "Time_Start": 1591.9,
      "Time_End": 1597.66,
      "Text": " mode hooks. But perhaps what's less common is keeping the hooks and instead patching the"
    },
    {
      "Time_Start": 1597.66,
      "Time_End": 1603.02,
      "Text": " injected sensor DLL to prevent it from reporting the telemetry to its service component."
    },
    {
      "Time_Start": 1603.98,
      "Time_End": 1608.8600000000001,
      "Text": " A lot of sensors rely on kernel mode callbacks for telemetry around processes, threads, objects,"
    },
    {
      "Time_Start": 1608.8600000000001,
      "Time_End": 1614.7800000000002,
      "Text": " files, the registry, and so on. And although patching those out would require higher privileges,"
    },
    {
      "Time_Start": 1614.7800000000002,
      "Time_End": 1620.46,
      "Text": " since you need to usually load a driver for it, anecdotally speaking, it looks like several"
    },
    {
      "Time_Start": 1620.46,
      "Time_End": 1627.9,
      "Text": " products just don't detect this right away. With ETW, you can patch user mode API functions to"
    },
    {
      "Time_Start": 1627.9,
      "Time_End": 1633.18,
      "Text": " disable reporting, and also use the Windows API to remove providers from trace sessions"
    },
    {
      "Time_Start": 1633.18,
      "Time_End": 1638.14,
      "Text": " associated with products. And the last one that comes to mind is just getting familiar with the"
    },
    {
      "Time_Start": 1638.14,
      "Time_End": 1644.38,
      "Text": " product's inter-process communication, or IPC channels, and use that as a way to spoof or tamper"
    },
    {
      "Time_Start": 1644.38,
      "Time_End": 1649.9,
      "Text": " communications from other sensor components. Now, most of this probably isn't new, but for me, when"
    },
    {
      "Time_Start": 1649.9,
      "Time_End": 1655.3400000000001,
      "Text": " I fit it into this OODA loop, it forces me to think about what I haven't considered from these other"
    },
    {
      "Time_Start": 1655.3400000000001,
      "Time_End": 1661.18,
      "Text": " subsequent processes. But continuing on the observe process, I wanted to briefly introduce a small"
    },
    {
      "Time_Start": 1661.18,
      "Time_End": 1665.66,
      "Text": " project I've been working on with help from the Lover, and it's something we'd like to open source"
    },
    {
      "Time_Start": 1665.66,
      "Time_End": 1670.6200000000001,
      "Text": " in the future. It's called Flashbang, and basically it's a declarative-based capability"
    },
    {
      "Time_Start": 1670.6200000000001,
      "Time_End": 1676.94,
      "Text": " for evasion. It borrows the fishlets concept from Evil Jinx, in that you can have these YAML"
    },
    {
      "Time_Start": 1676.94,
      "Time_End": 1683.3400000000001,
      "Text": " blindlet files at a per-product or per-environment level, and each blindlet contains a sequence of"
    },
    {
      "Time_Start": 1683.3400000000001,
      "Time_End": 1688.5400000000002,
      "Text": " actions, like suppressing telemetry, which can abstract away the need to write code for stuff"
    },
    {
      "Time_Start": 1688.5400000000002,
      "Time_End": 1693.5,
      "Text": " like this. Once a blindlet is enabled, you can start doing suspicious stuff with the telemetry"
    },
    {
      "Time_Start": 1693.5,
      "Time_End": 1699.02,
      "Text": " collection suppressed, and then you can disable it, which will roll back the changes. You can see"
    },
    {
      "Time_Start": 1699.02,
      "Time_End": 1703.74,
      "Text": " a few of these actions here, like suppressing telemetry or doing memory patching, some utility"
    },
    {
      "Time_Start": 1703.74,
      "Time_End": 1709.42,
      "Text": " functions as well, and this embraces that model that there isn't a universal or silver bullet"
    },
    {
      "Time_Start": 1709.42,
      "Time_End": 1714.46,
      "Text": " solution, but instead that there's a toolbox and this idea of creating templates to adapt to"
    },
    {
      "Time_Start": 1714.46,
      "Time_End": 1721.26,
      "Text": " different products or situations. A small example here, where you can see a payload from a blindlet"
    },
    {
      "Time_Start": 1721.26,
      "Time_End": 1725.74,
      "Text": " on the left, and then on the right you can see output from Cobalt Strike when it's enabled."
    },
    {
      "Time_Start": 1725.74,
      "Time_End": 1729.98,
      "Text": " It's edited a little bit just to make it more readable on the slide, but you might want to pause"
    },
    {
      "Time_Start": 1729.98,
      "Time_End": 1735.66,
      "Text": " or put this on full screen, where on the left you can see a driver setting object that gives you some"
    },
    {
      "Time_Start": 1735.66,
      "Time_End": 1741.18,
      "Text": " flexibility in loading it, and then on the bottom you can see the sequence of actions, like suppressing"
    },
    {
      "Time_Start": 1741.18,
      "Time_End": 1749.5,
      "Text": " kernel mode callbacks, user mode hooks, as well as providers from a ETW session. So here's another"
    },
    {
      "Time_Start": 1749.5,
      "Time_End": 1755.9,
      "Text": " example using a test harness against OpenEDR with some more verbose output. On the top right you can"
    },
    {
      "Time_Start": 1755.9,
      "Time_End": 1760.06,
      "Text": " see the blindlet, and at the bottom right you can see the kernel mode callbacks and telemetry"
    },
    {
      "Time_Start": 1760.06,
      "Time_End": 1765.5,
      "Text": " sourcer, showing that they haven't been suppressed yet. Once it's enabled though, you can refresh"
    },
    {
      "Time_Start": 1765.5,
      "Time_End": 1772.46,
      "Text": " telemetry sourcer, and then be able to see that they're now suppressed. And it's at this point"
    },
    {
      "Time_Start": 1772.46,
      "Time_End": 1777.1,
      "Text": " that you can start doing some malicious stuff with reduced risk of getting caught, and then you can"
    },
    {
      "Time_Start": 1777.1000000000001,
      "Time_End": 1782.6200000000001,
      "Text": " disable it, which will just put it back to normal. Moving on to the orient phase of the sensor loop,"
    },
    {
      "Time_Start": 1782.6200000000001,
      "Time_End": 1787.5800000000002,
      "Text": " this is where it processes its observations to internalize them, and then determine what its"
    },
    {
      "Time_Start": 1787.5800000000002,
      "Time_End": 1792.7,
      "Text": " options are. If you recall from the operator loop, this is somewhat similar at a high level, but from"
    },
    {
      "Time_Start": 1792.7,
      "Time_End": 1798.38,
      "Text": " the sensor side this involves a few things. There's the continual process of building an internal"
    },
    {
      "Time_Start": 1798.38,
      "Time_End": 1803.8200000000002,
      "Text": " situation model to represent the system, which kind of at a high level is similar to the crown"
    },
    {
      "Time_Start": 1803.82,
      "Time_End": 1808.86,
      "Text": " jewels exercise we did in the earlier example. Then there's normalizing the raw events we get"
    },
    {
      "Time_Start": 1808.86,
      "Time_End": 1813.8999999999999,
      "Text": " from the observe process, so that it can be reasoned by the sensor. The event data gets"
    },
    {
      "Time_Start": 1813.8999999999999,
      "Time_End": 1818.9399999999998,
      "Text": " synthesized into the situation model, which allows it to look for malicious activity through the use"
    },
    {
      "Time_Start": 1818.9399999999998,
      "Time_End": 1824.54,
      "Text": " of signatures or models. And in the next few slides I'll continue that LSAS dumping example"
    },
    {
      "Time_Start": 1824.54,
      "Time_End": 1828.22,
      "Text": " to provide a more concrete but simplified flow of what you're seeing on this slide."
    },
    {
      "Time_Start": 1829.18,
      "Time_End": 1833.18,
      "Text": " So here's a simplified example of what a situation model could look like."
    },
    {
      "Time_Start": 1833.18,
      "Time_End": 1838.3,
      "Text": " You can have a variety of objects of different types, like sessions, users, processes, and files."
    },
    {
      "Time_Start": 1839.02,
      "Time_End": 1844.38,
      "Text": " Here, when the task manager process is created, that emits an event from the psset create process"
    },
    {
      "Time_Start": 1844.38,
      "Time_End": 1850.54,
      "Text": " notify routine callback, which then gets normalized as a process create event. It gets synthesized"
    },
    {
      "Time_Start": 1850.54,
      "Time_End": 1857.02,
      "Text": " into the model, represented as the Bertha Scott user creating that process. Next, when we right"
    },
    {
      "Time_Start": 1857.34,
      "Time_End": 1863.58,
      "Text": " click the LSAS process and dump it, that results in task manager creating a process handle on LSAS,"
    },
    {
      "Time_Start": 1863.58,
      "Time_End": 1869.26,
      "Text": " which gets normalized as a process access event. I've seen a few examples online where folks use"
    },
    {
      "Time_Start": 1869.26,
      "Time_End": 1874.1399999999999,
      "Text": " direct syscalls to evade this, but in my understanding that's not as relevant because"
    },
    {
      "Time_Start": 1874.1399999999999,
      "Time_End": 1879.98,
      "Text": " the EDR may well be receiving relevant telemetry from the kernel mode callback instead of a user"
    },
    {
      "Time_Start": 1879.98,
      "Time_End": 1885.9,
      "Text": " mode hook. So direct syscalls might not be the most helpful here. Third, when the memory of that"
    },
    {
      "Time_Start": 1885.9,
      "Time_End": 1892.46,
      "Text": " process is read using the handle, that can get normalized into a process read event. And lastly,"
    },
    {
      "Time_Start": 1892.46,
      "Time_End": 1897.18,
      "Text": " when the LSAS dump file is created, that can be normalized as a file create event."
    },
    {
      "Time_Start": 1898.94,
      "Time_End": 1903.74,
      "Text": " So something like this can be detected with a variety of behavioral signatures, each with their"
    },
    {
      "Time_Start": 1903.74,
      "Time_End": 1909.26,
      "Text": " own pros and cons. Just for the sake of example, if there was a signature for a task manager"
    },
    {
      "Time_Start": 1909.26,
      "Time_End": 1914.7800000000002,
      "Text": " accessing LSAS, then what if he could just dump it from another process? Or if there was a rule"
    },
    {
      "Time_Start": 1914.78,
      "Time_End": 1919.8999999999999,
      "Text": " to catch processes that are not running a system but are accessing LSAS, then what if we just"
    },
    {
      "Time_Start": 1919.8999999999999,
      "Time_End": 1927.02,
      "Text": " elevated our agent or run our dumping process as a system instead? I think as operators, we're"
    },
    {
      "Time_Start": 1927.02,
      "Time_End": 1932.22,
      "Text": " sometimes in the dark on exactly how an EDR is detecting a certain technique, and we're usually"
    },
    {
      "Time_Start": 1932.22,
      "Time_End": 1937.26,
      "Text": " in this brainstorming process to get around that. But if we could know more about what specific"
    },
    {
      "Time_Start": 1937.26,
      "Time_End": 1942.54,
      "Text": " malicious behaviors the product is looking for, then the less it feels like we're taking a shot"
    },
    {
      "Time_Start": 1942.54,
      "Time_End": 1948.22,
      "Text": " at in the dark, and the faster we get at developing tailored bypasses that are specific to the product"
    },
    {
      "Time_Start": 1948.22,
      "Time_End": 1953.8999999999999,
      "Text": " and the environment that we're up against. When it comes to attacks, the brainstorming we just did"
    },
    {
      "Time_Start": 1953.8999999999999,
      "Time_End": 1959.8999999999999,
      "Text": " about bypasses is something that we can enhance, if we can manage to recover the behavioral signatures"
    },
    {
      "Time_Start": 1959.8999999999999,
      "Time_End": 1965.6599999999999,
      "Text": " from the sensors. We can also try to recover any on-sensor ML models or static signatures to do"
    },
    {
      "Time_Start": 1965.6599999999999,
      "Time_End": 1971.18,
      "Text": " the same type of exercise, but the caveat to keep in mind is that not all of this detection logic is"
    },
    {
      "Time_Start": 1971.18,
      "Time_End": 1977.02,
      "Text": " stored on sensors. It depends on the product, but if a product supports prevention while the endpoint"
    },
    {
      "Time_Start": 1977.02,
      "Time_End": 1982.0600000000002,
      "Text": " is offline, I think it's fair to assume that whatever detection logic relevant for that should"
    },
    {
      "Time_Start": 1982.0600000000002,
      "Time_End": 1987.5,
      "Text": " be available on-sensor. That said, the caveat again is that there could be additional logic on the"
    },
    {
      "Time_Start": 1987.5,
      "Time_End": 1993.9,
      "Text": " server side that we won't necessarily have visibility of. The other thing we can glean from deeper"
    },
    {
      "Time_Start": 1993.9,
      "Time_End": 1999.98,
      "Text": " sensor analysis are software bugs and design or architectural issues. There are certain types of"
    },
    {
      "Time_Start": 1999.98,
      "Time_End": 2006.14,
      "Text": " attack indicators like novel suspicious command lines for which EDR products can model and develop"
    },
    {
      "Time_Start": 2006.14,
      "Time_End": 2011.1,
      "Text": " detections really quickly, but then there are other attack indicators that can be harder to model"
    },
    {
      "Time_Start": 2011.1,
      "Time_End": 2015.9,
      "Text": " because maybe the telemetry isn't there or it's unaccounted for in the way that events are being"
    },
    {
      "Time_Start": 2015.9,
      "Time_End": 2021.82,
      "Text": " internalized in the sensor. Other times it isn't a modeling issue but perhaps a consequence of the"
    },
    {
      "Time_Start": 2021.82,
      "Time_End": 2027.5,
      "Text": " natural frictions or constraints imposed on a product like endpoint resource utilization or"
    },
    {
      "Time_Start": 2027.5,
      "Time_End": 2033.58,
      "Text": " privacy compliance. This depends on the product, but some common examples include being unable to"
    },
    {
      "Time_Start": 2033.58,
      "Time_End": 2040.78,
      "Text": " scan large binaries or not being able to auto-upload suspected mal-docs respectively. So these modeling"
    },
    {
      "Time_Start": 2040.78,
      "Time_End": 2046.62,
      "Text": " issues and these frictions, they can take longer to remediate assuming that they have high enough"
    },
    {
      "Time_Start": 2046.62,
      "Time_End": 2052.38,
      "Text": " priority and that the capabilities that generally take advantage of them could potentially have"
    },
    {
      "Time_Start": 2052.38,
      "Time_End": 2057.9,
      "Text": " a longer shelf life. On the integrity and availability side, you can try to modify"
    },
    {
      "Time_Start": 2057.9,
      "Time_End": 2063.02,
      "Text": " detection logic or somehow try to degrade the functioning of that component, but in most"
    },
    {
      "Time_Start": 2063.02,
      "Time_End": 2069.1800000000003,
      "Text": " products that might end up triggering anti-tampering mechanisms. From a path of least"
    },
    {
      "Time_Start": 2069.1800000000003,
      "Time_End": 2074.54,
      "Text": " resistance standpoint, I think the confidentiality attacks are a bit more practical and less risky,"
    },
    {
      "Time_Start": 2074.54,
      "Time_End": 2079.1,
      "Text": " especially if you can get that level of introspection from a lab environment. But if it"
    },
    {
      "Time_Start": 2079.1,
      "Time_End": 2083.18,
      "Text": " makes sense to go down the avenue of tampering, then it's worth considering some of the lower"
    },
    {
      "Time_Start": 2083.18,
      "Time_End": 2087.5,
      "Text": " cost efforts you can do, like limiting its visibility so that way you don't have to dig as"
    },
    {
      "Time_Start": 2087.5,
      "Time_End": 2092.86,
      "Text": " deep into individual products. I've got a couple case studies I can go over for this section, the"
    },
    {
      "Time_Start": 2092.86,
      "Time_End": 2099.02,
      "Text": " first one being by Kamial on Twitter. They looked into attack surface reduction or ASR signatures"
    },
    {
      "Time_Start": 2099.02,
      "Time_End": 2104.7,
      "Text": " for Windows Defender and what they were able to do was extract and decompile relevant Lua scripts"
    },
    {
      "Time_Start": 2104.7,
      "Time_End": 2110.8599999999997,
      "Text": " from VDM files, which are the resource files for the engine. And within those, you can see generic"
    },
    {
      "Time_Start": 2110.8599999999997,
      "Time_End": 2117.3399999999997,
      "Text": " ASR parameters for each rule, like path exclusions and monitored locations. This is really powerful"
    },
    {
      "Time_Start": 2117.3399999999997,
      "Time_End": 2122.62,
      "Text": " stuff because from an operator standpoint, it shines some light on why a bypass attempt would"
    },
    {
      "Time_Start": 2122.62,
      "Time_End": 2128.14,
      "Text": " have worked or not worked by being able to see details like this. For example, if this rule"
    },
    {
      "Time_Start": 2128.7,
      "Time_End": 2137.2599999999998,
      "Text": " prevents LSAS dumping, one way we can try to bypass it is by registering a service host DLL,"
    },
    {
      "Time_Start": 2137.2599999999998,
      "Time_End": 2143.2599999999998,
      "Text": " which could potentially trigger that path exclusion. So by recovering behavioral signatures"
    },
    {
      "Time_Start": 2143.2599999999998,
      "Time_End": 2148.06,
      "Text": " like this, it gives us something to work with, at least as a starting point, instead of completely"
    },
    {
      "Time_Start": 2148.06,
      "Time_End": 2154.2999999999997,
      "Text": " shooting in the dark. The second case study is about Silance's ML model for file classification."
    },
    {
      "Time_Start": 2154.3,
      "Time_End": 2158.1400000000003,
      "Text": " The authors at Skylight Cyber published it a couple years ago, and I thought it was really"
    },
    {
      "Time_Start": 2158.1400000000003,
      "Time_End": 2163.42,
      "Text": " interesting because there wasn't much like it out at the time. These models, they contain a"
    },
    {
      "Time_Start": 2163.42,
      "Time_End": 2167.5800000000004,
      "Text": " treasure trove of intellectual property, usually with a lot of training going into them to get"
    },
    {
      "Time_Start": 2167.5800000000004,
      "Time_End": 2172.38,
      "Text": " them into a more workable state. But the thing is that when they're deployed on endpoints,"
    },
    {
      "Time_Start": 2172.38,
      "Time_End": 2177.34,
      "Text": " developers can lose control over how that model is being used. And there's a couple things that"
    },
    {
      "Time_Start": 2177.34,
      "Time_End": 2182.46,
      "Text": " you can do with it that they did as well. The first is to decouple the model from the product"
    },
    {
      "Time_Start": 2182.46,
      "Time_End": 2186.62,
      "Text": " and build a test harness to validate potentially malicious files against them."
    },
    {
      "Time_Start": 2186.62,
      "Time_End": 2190.62,
      "Text": " So that way you can scan files without having the telemetry go up to the cloud."
    },
    {
      "Time_Start": 2191.26,
      "Time_End": 2196.14,
      "Text": " And the second, perhaps more interestingly, was to find biases in the model to come up with"
    },
    {
      "Time_Start": 2196.14,
      "Time_End": 2201.82,
      "Text": " universal strings that you can use to pad any malicious binary with, which ends up confusing"
    },
    {
      "Time_Start": 2201.82,
      "Time_End": 2207.26,
      "Text": " the model into making false negatives. So just showing a couple slides from their presentation,"
    },
    {
      "Time_Start": 2207.26,
      "Time_End": 2212.86,
      "Text": " this one shows how they extracted the model file. And this one shows the test harness that"
    },
    {
      "Time_Start": 2212.86,
      "Time_End": 2218.2200000000003,
      "Text": " they wrote for the file where you have a file as input and an output score indicating whether"
    },
    {
      "Time_Start": 2218.2200000000003,
      "Time_End": 2225.34,
      "Text": " it thinks that it's malicious or not. This one over here shows the result of the universal bypass"
    },
    {
      "Time_Start": 2225.34,
      "Time_End": 2229.7400000000002,
      "Text": " that they found whereby mutating a variety of samples, they were able to create these false"
    },
    {
      "Time_Start": 2229.7400000000002,
      "Time_End": 2235.5800000000004,
      "Text": " negative scenarios, which I thought was pretty cool stuff. Moving to decide as the next process,"
    },
    {
      "Time_Start": 2235.58,
      "Time_End": 2240.62,
      "Text": " the sensor has to make decisions based on how it's configured. And as operators, this at a"
    },
    {
      "Time_Start": 2240.62,
      "Time_End": 2245.2599999999998,
      "Text": " high level isn't too different to how we select a course of action based on formal rules of"
    },
    {
      "Time_Start": 2245.2599999999998,
      "Time_End": 2250.54,
      "Text": " engagement and tradecraft policy. But there is a difference in that we can also make decisions from"
    },
    {
      "Time_Start": 2250.54,
      "Time_End": 2255.58,
      "Text": " our intuition. And I'm not sure if we're quite there yet with sensors where some sensors today"
    },
    {
      "Time_Start": 2255.58,
      "Time_End": 2260.54,
      "Text": " primarily make decisions based on explicit rules and configurations, although not exclusively."
    },
    {
      "Time_Start": 2261.5,
      "Time_End": 2266.54,
      "Text": " Some examples where a sensor could take different directions based on its configuration include the"
    },
    {
      "Time_Start": 2266.54,
      "Time_End": 2271.66,
      "Text": " degree to how much data should be collected or phoned home. Clearly, it could be too noisy to"
    },
    {
      "Time_Start": 2271.66,
      "Time_End": 2276.22,
      "Text": " receive the full firehose of raw data that the sensor itself is observing. So that has to be"
    },
    {
      "Time_Start": 2276.22,
      "Time_End": 2281.1,
      "Text": " filtered further, but also configurable so that the customer can decide on the trade off involved."
    },
    {
      "Time_Start": 2281.82,
      "Time_End": 2287.1,
      "Text": " And there could be more constraints on reducing network bandwidth or endpoint utilization,"
    },
    {
      "Time_Start": 2287.1,
      "Time_End": 2290.2999999999997,
      "Text": " and avoiding potential legal and privacy issues with what's sent."
    },
    {
      "Time_Start": 2291.1,
      "Time_End": 2296.54,
      "Text": " Some sensors can also take action on malicious behavior based on how confident its detection is,"
    },
    {
      "Time_Start": 2296.54,
      "Time_End": 2301.18,
      "Text": " which can include notifying the customer, and also automated prevention if configured."
    },
    {
      "Time_Start": 2301.8199999999997,
      "Time_End": 2307.18,
      "Text": " As far as attacks go, the main ones I consider is just being able to recover sensor configurations"
    },
    {
      "Time_Start": 2307.18,
      "Time_End": 2312.46,
      "Text": " to something that's humanly readable, and also doing the analysis to understand how that data"
    },
    {
      "Time_Start": 2312.46,
      "Time_End": 2315.98,
      "Text": " is being used in conditional logic throughout the sensor, whether that's something that's"
    },
    {
      "Time_Start": 2315.98,
      "Time_End": 2321.66,
      "Text": " hard coded or soft coded. With tampering, I've had some success with manipulating those values"
    },
    {
      "Time_Start": 2321.66,
      "Time_End": 2327.34,
      "Text": " or altering the logic by patching conditional jumps. But most sensors have some anti anti"
    },
    {
      "Time_Start": 2327.34,
      "Time_End": 2331.82,
      "Text": " tampering mechanisms like detecting when a handle is open to its service process,"
    },
    {
      "Time_Start": 2331.82,
      "Time_End": 2336.54,
      "Text": " or monitoring changes to its settings in the registry. So you'd likely have to find some"
    },
    {
      "Time_Start": 2336.54,
      "Time_End": 2341.58,
      "Text": " workaround to that first and how easy or how difficult that is really depends on the product."
    },
    {
      "Time_Start": 2342.54,
      "Time_End": 2347.18,
      "Text": " I've got a couple examples here just to visually show how configuration values can be stored."
    },
    {
      "Time_Start": 2347.8199999999997,
      "Time_End": 2352.62,
      "Text": " On the left, this product has different flags for the collection types of support. So if you can"
    },
    {
      "Time_Start": 2352.62,
      "Time_End": 2357.1,
      "Text": " pull these values on a target system, you can get a better sense of what you're up against."
    },
    {
      "Time_Start": 2357.1,
      "Time_End": 2362.22,
      "Text": " Similarly, on the right is a screenshot of MacGyver script for parsing out sysmon configurations,"
    },
    {
      "Time_Start": 2362.22,
      "Time_End": 2366.7,
      "Text": " which I thought was really cool, especially because this configuration it has that granular"
    },
    {
      "Time_Start": 2366.7000000000003,
      "Time_End": 2372.2200000000003,
      "Text": " logic of what it does and doesn't report on. Moving to the act process, this is where the"
    },
    {
      "Time_Start": 2372.2200000000003,
      "Time_End": 2377.42,
      "Text": " sensor executes on the decisions it's selected. And in understanding this, I find it useful to"
    },
    {
      "Time_Start": 2377.42,
      "Time_End": 2382.38,
      "Text": " look at the sensor not as a monolithic agent, but rather as a patchwork of different components,"
    },
    {
      "Time_Start": 2382.38,
      "Time_End": 2387.26,
      "Text": " each with their own capabilities for action. For example, a communications module could be"
    },
    {
      "Time_Start": 2387.26,
      "Time_End": 2392.3,
      "Text": " responsible for sending telemetry to the cloud. An IR module could be responsible for responding"
    },
    {
      "Time_Start": 2392.3,
      "Time_End": 2397.42,
      "Text": " to any server side taskings, and a prevention module can handle terminating and deleting"
    },
    {
      "Time_Start": 2397.42,
      "Time_End": 2403.5800000000004,
      "Text": " malware if it's configured to do so. When it comes to attacks, I think what interests me the most,"
    },
    {
      "Time_Start": 2403.5800000000004,
      "Time_End": 2408.54,
      "Text": " at least in being enlightened, is getting visibility into the events generated by the sensor."
    },
    {
      "Time_Start": 2408.54,
      "Time_End": 2413.1000000000004,
      "Text": " Because once you have that, it can unlock the opportunity to build some capabilities with"
    },
    {
      "Time_Start": 2413.1000000000004,
      "Time_End": 2418.54,
      "Text": " program security in mind, like building more secure lab environments to observe how sensors"
    },
    {
      "Time_Start": 2418.54,
      "Time_End": 2424.7,
      "Text": " react to different TTPs. You can also attempt to selectively filter events, where the idea is that"
    },
    {
      "Time_Start": 2424.7,
      "Time_End": 2429.02,
      "Text": " you intercept sensor events before they're phoned home, and then you filter out the ones that you"
    },
    {
      "Time_Start": 2429.02,
      "Time_End": 2433.98,
      "Text": " don't want the server to see. It's something I've successfully tried in the past, and while I think"
    },
    {
      "Time_Start": 2433.98,
      "Time_End": 2438.7799999999997,
      "Text": " it's an interesting concept, I personally haven't found any need to actually use a capability like"
    },
    {
      "Time_Start": 2438.7799999999997,
      "Time_End": 2444.38,
      "Text": " this. Also, this might be easier on some products than others, so this and other tampering techniques"
    },
    {
      "Time_Start": 2444.38,
      "Time_End": 2447.98,
      "Text": " are things that you might want to look at opportunistically, especially if it's something"
    },
    {
      "Time_Start": 2447.98,
      "Time_End": 2453.66,
      "Text": " you can avoid having to do in the first place. I'll briefly dig into this notion of having an"
    },
    {
      "Time_Start": 2453.66,
      "Time_End": 2458.06,
      "Text": " offline telemetry backend. I wrote about it in depth last year, so feel free to check out the"
    },
    {
      "Time_Start": 2458.06,
      "Time_End": 2464.86,
      "Text": " link if that interests you. Basically, the idea is to treat an EDR sensor almost as if it's like"
    },
    {
      "Time_Start": 2464.86,
      "Time_End": 2470.38,
      "Text": " malware in a contained environment, where you try to dissect and see to protocols and communications."
    },
    {
      "Time_Start": 2470.38,
      "Time_End": 2474.78,
      "Text": " And at a high level, there are three steps to it, two of them required, one of them optional."
    },
    {
      "Time_Start": 2474.78,
      "Time_End": 2481.02,
      "Text": " The first one is capturing the raw event buffers from the sensor in real-time or near real-time,"
    },
    {
      "Time_Start": 2481.02,
      "Time_End": 2486.0600000000004,
      "Text": " and then the second is recovering any schemas so that the buffers can be parsed to be more"
    },
    {
      "Time_Start": 2486.0600000000004,
      "Time_End": 2491.5800000000004,
      "Text": " human-readable. And optionally, the third is pointing the sensor to a mock server that you"
    },
    {
      "Time_Start": 2491.5800000000004,
      "Time_End": 2496.7000000000003,
      "Text": " develop, which can collect the events and then ship them off to your own sim. In the example"
    },
    {
      "Time_Start": 2496.7000000000003,
      "Time_End": 2502.0600000000004,
      "Text": " here, we're using Elastic Stack, and with that, we can also build dashboard views to make better"
    },
    {
      "Time_Start": 2502.06,
      "Time_End": 2508.38,
      "Text": " sense of the data that we're getting. Alright, so that pretty much covers the EDR sensors loop,"
    },
    {
      "Time_Start": 2508.38,
      "Time_End": 2512.7799999999997,
      "Text": " so now let's get into conclusions and recap. We'll start by trying to directly answer that"
    },
    {
      "Time_Start": 2512.7799999999997,
      "Time_End": 2517.9,
      "Text": " question of how do we win against EDR sensors by getting inside their OODA loops. Well, when we"
    },
    {
      "Time_Start": 2517.9,
      "Time_End": 2523.58,
      "Text": " look at the observe process, my first recommendation is to identify the telemetry sources used by the"
    },
    {
      "Time_Start": 2523.58,
      "Time_End": 2528.2999999999997,
      "Text": " sensors you're up against, and you can use that information to guide tradecraft and develop"
    },
    {
      "Time_Start": 2528.3,
      "Time_End": 2533.5800000000004,
      "Text": " capabilities to blind or filter sensor events when needed. I first approached this by building"
    },
    {
      "Time_Start": 2533.5800000000004,
      "Time_End": 2538.3,
      "Text": " off the works of others and creating Telemetry Sourcer, which helped me understand this aspect"
    },
    {
      "Time_Start": 2538.3,
      "Time_End": 2542.78,
      "Text": " of sensors better, but the problem with that was that it was meant for lab environments and it"
    },
    {
      "Time_Start": 2542.78,
      "Time_End": 2547.5,
      "Text": " couldn't easily be used from an operational standpoint. So I started writing Flashbang"
    },
    {
      "Time_Start": 2547.5,
      "Time_End": 2552.2200000000003,
      "Text": " after that to operationalize the blinding capability in a flexible way where you can"
    },
    {
      "Time_Start": 2552.2200000000003,
      "Time_End": 2557.6600000000003,
      "Text": " write configuration files for different products, similar to how we have fishlets and eviljinks for"
    },
    {
      "Time_Start": 2557.66,
      "Time_End": 2563.02,
      "Text": " different websites. The next recommendation is to get familiar with how telemetry flows between"
    },
    {
      "Time_Start": 2563.02,
      "Time_End": 2568.7,
      "Text": " different components of the sensor and see where you can find opportunities to tamper or interrupt"
    },
    {
      "Time_Start": 2568.7,
      "Time_End": 2574.54,
      "Text": " that flow. Most sensors have a user mode and a kernel mode component, so you can leverage existing"
    },
    {
      "Time_Start": 2574.54,
      "Time_End": 2580.46,
      "Text": " OS internals knowledge to dig into how IPC functions between those components. And like I"
    },
    {
      "Time_Start": 2580.46,
      "Time_End": 2586.22,
      "Text": " mentioned earlier, an alternative to removing inline user mode hooks is to keep them there but"
    },
    {
      "Time_Start": 2586.2200000000003,
      "Time_End": 2592.0600000000004,
      "Text": " patch out functionality to prevent the injected sensor DLL from passing the telemetry to its core"
    },
    {
      "Time_Start": 2592.0600000000004,
      "Time_End": 2597.42,
      "Text": " component. This is kind of similar to how user mode ETW reporting can be patched out as well."
    },
    {
      "Time_Start": 2599.0200000000004,
      "Time_End": 2603.82,
      "Text": " With Orient, there's certainly an opportunity to understand more deeply how sensors are able"
    },
    {
      "Time_Start": 2603.82,
      "Time_End": 2609.1800000000003,
      "Text": " to identify malicious behavior, and when you're able to see how things work at a more granular"
    },
    {
      "Time_Start": 2609.1800000000003,
      "Time_End": 2614.2200000000003,
      "Text": " level, it naturally becomes easier to develop capabilities that retain some level of stealth."
    },
    {
      "Time_Start": 2614.2200000000003,
      "Time_End": 2620.2200000000003,
      "Text": " So with that, the third recommendation is to get familiar with any on-sensor signatures or models"
    },
    {
      "Time_Start": 2620.2200000000003,
      "Time_End": 2626.6200000000003,
      "Text": " at an ongoing technical level, because by doing this, it keeps you inside the sensor's loop by"
    },
    {
      "Time_Start": 2626.6200000000003,
      "Time_End": 2632.3,
      "Text": " knowing how techniques get detected, and it also builds a pipeline for bypass generation ideas to"
    },
    {
      "Time_Start": 2632.3,
      "Time_End": 2638.46,
      "Text": " come to you for triage. The fourth recommendation is to get familiar with any design or architecture"
    },
    {
      "Time_Start": 2638.46,
      "Time_End": 2643.82,
      "Text": " limitations or bugs in the product itself, because although some bypasses can be rendered"
    },
    {
      "Time_Start": 2643.9,
      "Time_End": 2649.5,
      "Text": " ineffective with a quick signature update, others might need a software update which can take longer"
    },
    {
      "Time_Start": 2649.5,
      "Time_End": 2655.26,
      "Text": " because of complexity and limited resources, so the bypasses that take advantage of that"
    },
    {
      "Time_Start": 2655.26,
      "Time_End": 2662.38,
      "Text": " are more likely to retain some longevity. And in general, if you're in a position where you're"
    },
    {
      "Time_Start": 2662.38,
      "Time_End": 2667.82,
      "Text": " continuously building a library of new capabilities and program security is something that matters,"
    },
    {
      "Time_Start": 2667.82,
      "Time_End": 2672.86,
      "Text": " you can take somewhat of a mechanical ratchet approach where the new capabilities slowly"
    },
    {
      "Time_Start": 2672.86,
      "Time_End": 2678.1400000000003,
      "Text": " graduate out of lab environments only when it's appropriate to do so, especially if things are"
    },
    {
      "Time_Start": 2678.1400000000003,
      "Time_End": 2683.42,
      "Text": " still working with less sophisticated techniques. It could be risky, depending on your tradecraft"
    },
    {
      "Time_Start": 2683.42,
      "Time_End": 2689.42,
      "Text": " policy, to unnecessarily introduce more sophisticated capabilities in a live environment,"
    },
    {
      "Time_Start": 2689.42,
      "Time_End": 2695.1,
      "Text": " because any opportunity to use a capability is also an opportunity to potentially expose it."
    },
    {
      "Time_Start": 2696.2200000000003,
      "Time_End": 2701.26,
      "Text": " In the design process, we can abuse sensor configuration details to get a better idea of"
    },
    {
      "Time_Start": 2701.26,
      "Time_End": 2706.38,
      "Text": " how it's tuned for detection and prevention. There are already several pretty useful tools"
    },
    {
      "Time_Start": 2706.38,
      "Time_End": 2711.5800000000004,
      "Text": " and scripts available for detecting the presence of a sensor on an endpoint, but we can take that"
    },
    {
      "Time_Start": 2711.5800000000004,
      "Time_End": 2717.34,
      "Text": " a step further to parse local configurations and use that to guide tradecraft. In this script, we"
    },
    {
      "Time_Start": 2717.34,
      "Time_End": 2722.86,
      "Text": " can see configuration data that's locally stored on the endpoint, which can include information"
    },
    {
      "Time_Start": 2722.86,
      "Time_End": 2728.6200000000003,
      "Text": " about settings that you can abuse or be cautious about, as well as information about path exclusions"
    },
    {
      "Time_Start": 2728.62,
      "Time_End": 2734.62,
      "Text": " and blacklisted hashes. Of course, the degree to how much or how little you can get really depends"
    },
    {
      "Time_Start": 2734.62,
      "Time_End": 2740.7,
      "Text": " on the product that you're writing this kind of script for. The sixth recommendation is this"
    },
    {
      "Time_Start": 2740.7,
      "Time_End": 2746.62,
      "Text": " notion of formalizing some of our operator intuition into reasoning, where we can build"
    },
    {
      "Time_Start": 2746.62,
      "Time_End": 2753.9,
      "Text": " toward tradecraft suggestion tools that internalize operational awareness against tradecraft policies."
    },
    {
      "Time_Start": 2753.9,
      "Time_End": 2759.34,
      "Text": " I think when we encapsulate this concept into Clippy, it shows both the promise and the"
    },
    {
      "Time_Start": 2759.34,
      "Time_End": 2766.46,
      "Text": " potential for poor execution that can come with something like this. And lastly, with ACT, the"
    },
    {
      "Time_Start": 2766.46,
      "Time_End": 2771.9,
      "Text": " most utility I got out of this was getting direct visibility into the telemetry that sensors phone"
    },
    {
      "Time_Start": 2771.9,
      "Time_End": 2777.34,
      "Text": " home. So having that offline telemetry backend was game-changing for my workflow, because on one"
    },
    {
      "Time_Start": 2777.34,
      "Time_End": 2782.78,
      "Text": " screen you can have a VM with a sensor where you're interactively exposing it to malicious stimuli,"
    },
    {
      "Time_Start": 2782.78,
      "Time_End": 2787.7400000000002,
      "Text": " and on another screen you can see the telemetry it would have sent to the cloud without the risk"
    },
    {
      "Time_Start": 2787.7400000000002,
      "Time_End": 2792.46,
      "Text": " of actually exposing that information about the malware. And of course, you can build a"
    },
    {
      "Time_Start": 2792.46,
      "Time_End": 2798.1400000000003,
      "Text": " detonation lab on top of this and validate payloads headlessly. So when you combine this with whatever"
    },
    {
      "Time_Start": 2798.1400000000003,
      "Time_End": 2803.82,
      "Text": " payload generator you use for initial access, this effectively serves as that fitness function."
    },
    {
      "Time_Start": 2803.82,
      "Time_End": 2809.02,
      "Text": " As you're automatically generating payloads with various configurations, you can programmatically"
    },
    {
      "Time_Start": 2809.02,
      "Time_End": 2814.3,
      "Text": " throw them against this validator and filter out the ones that generate on-sensor detections or"
    },
    {
      "Time_Start": 2814.3,
      "Time_End": 2821.58,
      "Text": " other suspicious telemetry. Zooming out a bit, we can ask ourselves, well, what does this partially"
    },
    {
      "Time_Start": 2821.58,
      "Time_End": 2827.74,
      "Text": " imply for the present or future direction in the space of operations R&D? The first that comes to"
    },
    {
      "Time_Start": 2827.74,
      "Time_End": 2834.3,
      "Text": " mind is introducing more data-driven EDR bypasses in addition to anecdotal ones, because instead of"
    },
    {
      "Time_Start": 2834.3,
      "Time_End": 2840.1400000000003,
      "Text": " solely relying on our intuition, we can now have technical reasons to justify a bypass. You can get"
    },
    {
      "Time_Start": 2840.1400000000003,
      "Time_End": 2845.1800000000003,
      "Text": " a higher level of confidence when you have direct knowledge of the signatures that are being bypassed"
    },
    {
      "Time_Start": 2845.1800000000003,
      "Time_End": 2850.86,
      "Text": " or the telemetry that is or isn't being sent by the sensor when it's exposed to certain stimuli."
    },
    {
      "Time_Start": 2851.9,
      "Time_End": 2857.5,
      "Text": " The second is to enhance operations with optimization techniques, such as those from"
    },
    {
      "Time_Start": 2857.5,
      "Time_End": 2863.82,
      "Text": " operations research, evolutionary computation, or automated planning. In my mind, the decision-making"
    },
    {
      "Time_Start": 2863.82,
      "Time_End": 2869.5,
      "Text": " process in OODA loops naturally led to what are called combinatorial optimization problems, where"
    },
    {
      "Time_Start": 2869.5,
      "Time_End": 2874.46,
      "Text": " you're trying to find the best solution to a problem out of a very large set of possible"
    },
    {
      "Time_Start": 2874.46,
      "Time_End": 2880.7000000000003,
      "Text": " solutions. And as operators, we're constantly trying to find that best attack path out of many that's"
    },
    {
      "Time_Start": 2880.7000000000003,
      "Time_End": 2886.7000000000003,
      "Text": " optimized to fit with the situation as well as the tradecraft policy that we use for an engagement."
    },
    {
      "Time_Start": 2886.7000000000003,
      "Time_End": 2892.06,
      "Text": " So as we put more effort into bridging that gap between the data we get and the decisions we make,"
    },
    {
      "Time_Start": 2892.06,
      "Time_End": 2897.82,
      "Text": " we can make our OODA loop go faster, which is how you win according to this model. And it's"
    },
    {
      "Time_Start": 2897.82,
      "Time_End": 2903.18,
      "Text": " interesting to see how automation efforts in the space can further tighten that timeline between"
    },
    {
      "Time_Start": 2903.74,
      "Time_End": 2911.18,
      "Text": " observations and decisions. I hesitate to call this stuff AI only because it's kind of a buzzword,"
    },
    {
      "Time_Start": 2911.18,
      "Time_End": 2917.34,
      "Text": " and it's definitely an area I'm not deeply familiar with, but I see the value proposition"
    },
    {
      "Time_Start": 2917.34,
      "Time_End": 2923.98,
      "Text": " from approaching things this way. So an example to think about is to model initial access payload"
    },
    {
      "Time_Start": 2923.98,
      "Time_End": 2929.34,
      "Text": " generation as an optimization problem. I don't think there's enough time to go into this in detail,"
    },
    {
      "Time_Start": 2929.34,
      "Time_End": 2934.38,
      "Text": " but feel free to pause if you can and take a look. On the left, you can see that there are"
    },
    {
      "Time_Start": 2934.38,
      "Time_End": 2939.34,
      "Text": " collections of nodes that are linked with edges representing legal transitions from one node to"
    },
    {
      "Time_Start": 2939.34,
      "Time_End": 2944.94,
      "Text": " another. We start at the top with a delivery vector and end all the way down to an action"
    },
    {
      "Time_Start": 2944.94,
      "Time_End": 2949.9,
      "Text": " like executing shellcode. When we think of how to build out initial access capabilities"
    },
    {
      "Time_Start": 2949.9,
      "Time_End": 2954.3,
      "Text": " with this model, it just kind of boils down to adding more nodes to each collection"
    },
    {
      "Time_Start": 2954.3,
      "Time_End": 2957.9,
      "Text": " and then creatively thinking of ways to add new edges to connect them."
    },
    {
      "Time_Start": 2958.62,
      "Time_End": 2963.7400000000002,
      "Text": " When we think about how to generate the best solution out of the many combinations here,"
    },
    {
      "Time_Start": 2963.7400000000002,
      "Time_End": 2968.46,
      "Text": " we can add weights to the edges by scoring the nodes against the tradecraft policy that's being"
    },
    {
      "Time_Start": 2968.46,
      "Time_End": 2973.26,
      "Text": " used. And doing this can give you a ranked list of potential solutions to choose from."
    },
    {
      "Time_Start": 2974.1400000000003,
      "Time_End": 2978.86,
      "Text": " From there, you can further filter down solutions by running them against a fitness function,"
    },
    {
      "Time_Start": 2978.86,
      "Time_End": 2983.6600000000003,
      "Text": " namely that detonation lab with the private telemetry backend. This is where you can get"
    },
    {
      "Time_Start": 2983.6600000000003,
      "Time_End": 2989.7400000000002,
      "Text": " a better approximation of whether a sensor with a representative configuration would have detected"
    },
    {
      "Time_Start": 2989.7400000000002,
      "Time_End": 2995.0200000000004,
      "Text": " the payload without the risk of sending all that telemetry to the cloud. So putting this all"
    },
    {
      "Time_Start": 2995.0200000000004,
      "Time_End": 3000.78,
      "Text": " together, it helps reduce uncertainty and it serves as a way of tightening that gap between"
    },
    {
      "Time_Start": 3000.78,
      "Time_End": 3006.3,
      "Text": " what you see, what you know, and what you choose. Anyway, that was a bit of a mouthful,"
    },
    {
      "Time_Start": 3006.3,
      "Time_End": 3010.46,
      "Text": " but I wanted to highlight the potential of taking this cognitive model a step further."
    },
    {
      "Time_Start": 3012.86,
      "Time_End": 3017.42,
      "Text": " Zooming out further, I think the quote that kind of captures the moral of the story is that"
    },
    {
      "Time_Start": 3017.42,
      "Time_End": 3023.26,
      "Text": " to cut down a tree in five minutes, spend three minutes sharpening your ax. It's nothing new to"
    },
    {
      "Time_Start": 3023.26,
      "Time_End": 3028.3,
      "Text": " a lot of us, but it's worth reminding ourselves to slow down, think, and prepare before we act."
    },
    {
      "Time_Start": 3028.94,
      "Time_End": 3033.34,
      "Text": " And the second thing was that, as I was looking into this, it reinforced that notion that when"
    },
    {
      "Time_Start": 3033.34,
      "Time_End": 3037.98,
      "Text": " you compare two things against the same model, you can sometimes gain some additional insights"
    },
    {
      "Time_Start": 3037.98,
      "Time_End": 3043.42,
      "Text": " about each. So the insight I got about EDR sensors was this deeper understanding of how"
    },
    {
      "Time_Start": 3043.42,
      "Time_End": 3048.1400000000003,
      "Text": " they attempt to emulate a decision-making process that's somewhat similar to our own,"
    },
    {
      "Time_Start": 3048.1400000000003,
      "Time_End": 3053.7400000000002,
      "Text": " even if it's somewhat at an early stage for now. And the second insight for operations was this"
    },
    {
      "Time_Start": 3053.82,
      "Time_End": 3059.0200000000004,
      "Text": " quantification of tradecraft policy to give sanity checks on our intuition, as I've been"
    },
    {
      "Time_Start": 3059.0200000000004,
      "Time_End": 3064.86,
      "Text": " alluding to in previous slides. My next thought is that if we can actually quantify our tradecraft"
    },
    {
      "Time_Start": 3064.86,
      "Time_End": 3071.0200000000004,
      "Text": " policy to some degree, how does that translate into the code level for developed capabilities?"
    },
    {
      "Time_Start": 3071.82,
      "Time_End": 3076.2200000000003,
      "Text": " And as is common in InfoSec, if this is something that we're thinking about,"
    },
    {
      "Time_Start": 3076.2200000000003,
      "Time_End": 3082.5400000000004,
      "Text": " where has it already been done or attempted? All right, well, that's all I have. Thank you"
    },
    {
      "Time_Start": 3082.54,
      "Time_End": 3087.1,
      "Text": " so much for taking the time to watch this and listen to me say a bunch of stuff. I know that"
    },
    {
      "Time_Start": 3087.1,
      "Time_End": 3091.58,
      "Text": " most of the technical details probably weren't novel to many of you, and of course my perspective"
    },
    {
      "Time_Start": 3091.58,
      "Time_End": 3096.54,
      "Text": " is limited, but I hope that this generated some ideas and I convinced some of you to look at"
    },
    {
      "Time_Start": 3096.54,
      "Time_End": 3102.06,
      "Text": " things with this OODA loop model and to also recognize that this model is something that's"
    },
    {
      "Time_Start": 3102.06,
      "Time_End": 3108.46,
      "Text": " much broader than its applications just for operations and EDR sensors. I also have DMs"
    },
    {
      "Time_Start": 3108.46,
      "Time_End": 3113.58,
      "Text": " open and can continue this conversation where I can. And lastly, I wanted to thank those that"
    },
    {
      "Time_Start": 3113.58,
      "Time_End": 3124.2200000000003,
      "Text": " reviewed this talk and thank the organizers of ZeefCon for hosting this."
    }
  ]
}