{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 20.240000000000002,
      "Text": "This text was transcribed using whisper model: large-v2\n\n It was a great talk. Up until the point where I got bumped. Who was here at 1 o'clock to"
    },
    {
      "Time_Start": 20.240000000000002,
      "Time_End": 24.28,
      "Text": " see my talk then? And you came back. I love each and every one of you."
    },
    {
      "Time_Start": 24.28,
      "Time_End": 37.160000000000004,
      "Text": " I live with this guy, so that scares me a lot. It's good to see that half the audience"
    },
    {
      "Time_Start": 37.160000000000004,
      "Time_End": 42.040000000000006,
      "Text": " is actually friends of mine. That's cool. It makes me feel special."
    },
    {
      "Time_Start": 42.040000000000006,
      "Time_End": 49.120000000000005,
      "Text": " This is a log pick demo here. I'd like to first apologize publicly to my cohorts here"
    },
    {
      "Time_Start": 49.120000000000005,
      "Time_End": 55.080000000000005,
      "Text": " because on the schedule it says, more log picking, virus. It doesn't mention Gurney,"
    },
    {
      "Time_Start": 55.080000000000005,
      "Time_End": 68.28,
      "Text": " Steve, or Hobbit. I am so sorry, guys. Honestly, my portion of the talks about the handcuffs"
    },
    {
      "Time_Start": 68.28,
      "Time_End": 72.76,
      "Text": " and hiding picks and all that stuff, these guys are the ones who are going really into"
    },
    {
      "Time_Start": 72.76,
      "Time_End": 80.0,
      "Text": " the depth of the locks themselves. Every single one of these guys is incredibly talented."
    },
    {
      "Time_Start": 80.0,
      "Time_End": 87.80000000000001,
      "Text": " Next year, when we do this talk, I guarantee their names will be on the list. That's for"
    },
    {
      "Time_Start": 87.80000000000001,
      "Time_End": 101.36000000000001,
      "Text": " your applause. I can't stand being up there. I'm going to jump down. I aim for the cup"
    },
    {
      "Time_Start": 101.36,
      "Time_End": 107.88,
      "Text": " and I hit it. Okay. Just out of curiosity, does anyone in the audience have any handcuffs?"
    },
    {
      "Time_Start": 107.88,
      "Time_End": 116.88,
      "Text": " Raise your hand. With you. With you. Mom, put your hand down, okay? All right."
    },
    {
      "Time_Start": 116.88,
      "Time_End": 124.28,
      "Text": " I was going to see if I could display. It's kind of funny. I was at H2K up in New York."
    },
    {
      "Time_Start": 124.28,
      "Time_End": 130.28,
      "Text": " Anybody else went to H2K in New York? Rockin'. That was a lot of fun. I did a virus talk"
    },
    {
      "Time_Start": 130.28,
      "Time_End": 134.52,
      "Text": " up there. I'm going to be doing the virus talk tomorrow here, 1 o'clock, hoping that"
    },
    {
      "Time_Start": 134.52,
      "Time_End": 137.52,
      "Text": " I don't get bumped. I would really like you guys to show up for the virus talk. We're"
    },
    {
      "Time_Start": 137.52,
      "Time_End": 141.92000000000002,
      "Text": " going to be introducing some really new information that should probably scare the hell out of"
    },
    {
      "Time_Start": 141.92000000000002,
      "Time_End": 151.92000000000002,
      "Text": " some of you. Yeah, cool stuff. It is a bad thing, actually. It's a very, very bad thing."
    },
    {
      "Time_Start": 151.92000000000002,
      "Time_End": 156.48,
      "Text": " All right. So no one here has handcuffs. What type of a hacker convention is this? What's"
    },
    {
      "Time_Start": 156.48,
      "Time_End": 167.39999999999998,
      "Text": " wrong with you people? How quickly? Oh, wait, those are Karen's. Karen's won't work. They're"
    },
    {
      "Time_Start": 167.39999999999998,
      "Time_End": 177.44,
      "Text": " not police regulation. Never mind. I don't know. Yeah, don't sweat it. We've got a pair"
    },
    {
      "Time_Start": 177.44,
      "Time_End": 181.92,
      "Text": " of handcuffs here. They're just kind of stiff. You know, last year when we did this talk,"
    },
    {
      "Time_Start": 181.92000000000002,
      "Time_End": 187.24,
      "Text": " I said, who has handcuffs? And half the audience was like, ooh. I don't have handcuffs. It's"
    },
    {
      "Time_Start": 187.24,
      "Time_End": 198.60000000000002,
      "Text": " like, for the demo. Oh, sorry. Okay. You brought the handcuffs with you? I'm the warm-up, by"
    },
    {
      "Time_Start": 198.60000000000002,
      "Time_End": 204.28000000000003,
      "Text": " the way, for the actual show. I'll be performing twice in Vegas this weekend. Thank you very"
    },
    {
      "Time_Start": 204.28,
      "Time_End": 215.88,
      "Text": " much. Hey, it's true, too. Rock. Okay. These are standard handcuffs here, except that they're"
    },
    {
      "Time_Start": 215.88,
      "Time_End": 223.4,
      "Text": " black and the police have the silver ones. Now, show of hands, who was at the lock pick"
    },
    {
      "Time_Start": 223.4,
      "Time_End": 228.0,
      "Text": " demo last year? Okay. So you're going to hear the same damn speech, but most of you guys"
    },
    {
      "Time_Start": 228.0,
      "Time_End": 233.52,
      "Text": " haven't heard this. What I'm going to show you about picking handcuffs is literally for"
    },
    {
      "Time_Start": 233.52,
      "Time_End": 239.96,
      "Text": " entertainment value only. As I stated last year, for God's sakes, don't be stupid. If"
    },
    {
      "Time_Start": 239.96,
      "Time_End": 248.76000000000002,
      "Text": " anyone with a badge puts you into handcuffs, do not pick your way out. I mean, it sounds"
    },
    {
      "Time_Start": 248.76000000000002,
      "Time_End": 252.4,
      "Text": " like a joke, but I know some of you are going to do it. For God's sakes, don't do that,"
    },
    {
      "Time_Start": 252.4,
      "Time_End": 256.24,
      "Text": " all right? Because if you're only being picked up for questioning and you pick your handcuffs,"
    },
    {
      "Time_Start": 256.24,
      "Time_End": 260.36,
      "Text": " this is not a joke to them. Okay? It's like if you get pulled over for speeding and you"
    },
    {
      "Time_Start": 260.36,
      "Time_End": 265.48,
      "Text": " try to run away, now you're definitely going to jail. Okay? Really, seriously, don't be"
    },
    {
      "Time_Start": 265.48,
      "Time_End": 271.32,
      "Text": " stupid. This is actually just for entertainment values. I actually got into lock picking and"
    },
    {
      "Time_Start": 271.32,
      "Time_End": 276.04,
      "Text": " handcuffs. Well, I got into handcuffs for other reasons, but that's none of your business."
    },
    {
      "Time_Start": 276.04,
      "Time_End": 279.64,
      "Text": " I got into picking different locks because I was a professional magician for 15 years."
    },
    {
      "Time_Start": 279.64,
      "Time_End": 286.64,
      "Text": " I performed all over the country, including here in Vegas. Thank you. So in that 15 years,"
    },
    {
      "Time_Start": 286.64,
      "Time_End": 294.32,
      "Text": " I've actually learned on how to improv picks. I'll give you right now, everybody take notes"
    },
    {
      "Time_Start": 294.32,
      "Time_End": 298.96,
      "Text": " who's got pens, I'll tell you exactly the picks you should carry with you that you will"
    },
    {
      "Time_Start": 298.96,
      "Time_End": 305.96,
      "Text": " not get in trouble for right now. You ready for the list? It's a long one. There is no"
    },
    {
      "Time_Start": 305.96,
      "Time_End": 319.52,
      "Text": " waiting. All right. A paper clip. A Leatherman. Thank you. That's it. That's all you need."
    },
    {
      "Time_Start": 319.52,
      "Time_End": 325.59999999999997,
      "Text": " A paper clip, a Leatherman, I can get you 75% of the locks. Who's going to bust you"
    },
    {
      "Time_Start": 325.59999999999997,
      "Time_End": 332.67999999999995,
      "Text": " for a paper clip? Nobody. Who's going to bust you for having a Leatherman? Nobody but your"
    },
    {
      "Time_Start": 332.68,
      "Time_End": 339.68,
      "Text": " mom. I just carry the paper clip on my belt loop, right here. It's just a paper clip."
    },
    {
      "Time_Start": 339.68,
      "Time_End": 345.8,
      "Text": " I carry the Leatherman in my pouch. I'm cool. No big deal. If I want to show off to my friends,"
    },
    {
      "Time_Start": 345.8,
      "Time_End": 350.56,
      "Text": " which I actually don't do that often, thank God. Or they wouldn't be my friends. You just"
    },
    {
      "Time_Start": 350.56,
      "Time_End": 357.24,
      "Text": " unfold the paper clip, unfold your Leatherman, bend up the tip so you have a small little"
    },
    {
      "Time_Start": 357.24,
      "Time_End": 362.56,
      "Text": " pick area. And that's your pick. And then you fold up the Leatherman, pull out the screwdriver,"
    },
    {
      "Time_Start": 362.56,
      "Time_End": 369.2,
      "Text": " and that's your tension bar. And I've gone through master locks. I've gone through dead"
    },
    {
      "Time_Start": 369.2,
      "Time_End": 374.64,
      "Text": " bolts. I've gone through many, many different locks. It's not very good for raking, because"
    },
    {
      "Time_Start": 374.64,
      "Time_End": 379.96000000000004,
      "Text": " when you rake a paper clip, it bends too much. But it's actually, and I honestly don't use"
    },
    {
      "Time_Start": 379.96000000000004,
      "Time_End": 384.92,
      "Text": " a small paper clip. You want the heavy, heavy-duty paper clips. You know what I want? Those thick"
    },
    {
      "Time_Start": 384.92,
      "Time_End": 390.08000000000004,
      "Text": " metal paper clips. They're fantastic. The absolute best picks in the world. What I'm"
    },
    {
      "Time_Start": 390.08000000000004,
      "Time_End": 397.08000000000004,
      "Text": " going to do now is I'm going to get a volunteer from the audience. A female volunteer with"
    },
    {
      "Time_Start": 397.44,
      "Time_End": 404.44,
      "Text": " pants who doesn't mind me touching her butt. Come here, niece. I know, I love this part"
    },
    {
      "Time_Start": 407.56,
      "Time_End": 414.56,
      "Text": " of the job. This is another roommate of mine. I said, I want you to touch my butt. I said,"
    },
    {
      "Time_Start": 415.12,
      "Time_End": 422.12,
      "Text": " she knows my wife, too. Okay. These are the common picks used for handcuffs. It's a very,"
    },
    {
      "Time_Start": 425.52000000000004,
      "Time_End": 432.52000000000004,
      "Text": " very thin piece of spring steel metal. About that long for the visuals here. They're very"
    },
    {
      "Time_Start": 434.96000000000004,
      "Time_End": 439.36,
      "Text": " flexible, and they're actually not just good for picking handcuffs. You can actually use"
    },
    {
      "Time_Start": 439.36,
      "Time_End": 444.24,
      "Text": " these for tension bars and actually picking other locks. They're very, very good. And"
    },
    {
      "Time_Start": 444.24,
      "Time_End": 449.96000000000004,
      "Text": " I'll show you how you use them to pick handcuffs. Now, where do I get a piece of metal this"
    },
    {
      "Time_Start": 449.96000000000004,
      "Time_End": 455.2,
      "Text": " small and this thin? Well, I'm glad you asked. If you ever see a street sweeper going down"
    },
    {
      "Time_Start": 455.2,
      "Time_End": 462.2,
      "Text": " the street, follow it. These are the bristles. These are the bristles of the street sweepers."
    },
    {
      "Time_Start": 462.24,
      "Time_End": 466.8,
      "Text": " They snap off all the time. You walk about three or four blocks, you can usually pick"
    },
    {
      "Time_Start": 466.8,
      "Time_End": 472.64,
      "Text": " up about six or seven bristles. That's all you need. Now, for the handcuffs, these actually"
    },
    {
      "Time_Start": 472.64,
      "Time_End": 476.71999999999997,
      "Text": " aren't filed down. These are just snapped off. Literally, these are what I call raw"
    },
    {
      "Time_Start": 476.71999999999997,
      "Time_End": 483.36,
      "Text": " picks. This one's actually been bent into a tension wrench. What you'll do with these"
    },
    {
      "Time_Start": 483.36,
      "Time_End": 489.0,
      "Text": " is if you find they're not fitting into the handcuffs very well, when I show you how they"
    },
    {
      "Time_Start": 489.0,
      "Time_End": 495.24,
      "Text": " actually work, you can file down the edges about halfway. File half of it down just a"
    },
    {
      "Time_Start": 495.24,
      "Time_End": 500.44,
      "Text": " little bit, like on a grinding stone, to make it a little bit thinner. And the width for"
    },
    {
      "Time_Start": 500.44,
      "Time_End": 507.44,
      "Text": " these are absolutely perfect. Who can tell me the absolute best pick for a pair of handcuffs,"
    },
    {
      "Time_Start": 508.04,
      "Time_End": 515.04,
      "Text": " aside from these? Anybody? A key. When I was doing magic shows, I could hide about 500"
    },
    {
      "Time_Start": 516.28,
      "Time_End": 521.64,
      "Text": " picks on my body, and you'd be lucky if you found about four or five of them. Now, for"
    },
    {
      "Time_Start": 521.64,
      "Time_End": 528.32,
      "Text": " the demonstration of where you hide the picks. Niece, can you stand up on the stage, hon?"
    },
    {
      "Time_Start": 528.32,
      "Time_End": 535.32,
      "Text": " Niece's butt. Okay. Can you please show it to the people this way? Oh, I love this view."
    },
    {
      "Time_Start": 546.72,
      "Time_End": 553.72,
      "Text": " Okay. Thin metal hides well, and also is very pliable. So what you can do is behind the"
    },
    {
      "Time_Start": 554.72,
      "Time_End": 561.72,
      "Text": " seams and behind the loops here, you can hide picks everywhere. Anywhere there's a seam,"
    },
    {
      "Time_Start": 563.1600000000001,
      "Time_End": 568.0,
      "Text": " you can hide one of these picks. Down here, multiple ones. Along the side. All you have"
    },
    {
      "Time_Start": 568.0,
      "Time_End": 573.12,
      "Text": " to do is make a, especially this type of a pant, these type seams, it's a double stitch."
    },
    {
      "Time_Start": 573.12,
      "Time_End": 577.72,
      "Text": " This is actually a little hollow inside. If you just tear up the jeans a little bit so"
    },
    {
      "Time_Start": 577.72,
      "Time_End": 583.72,
      "Text": " they look worn, people don't notice the little hole that this pick slid right into. Ah, I"
    },
    {
      "Time_Start": 583.72,
      "Time_End": 588.12,
      "Text": " see little light bulbs going on. Oh, I never thought of that. Well, I got paid to think"
    },
    {
      "Time_Start": 588.12,
      "Time_End": 592.96,
      "Text": " about that. Put them down the sides here, down the end of the seams here, along the"
    },
    {
      "Time_Start": 592.96,
      "Time_End": 597.36,
      "Text": " edge here, when they're long pants all the way down. You can put tons of these things"
    },
    {
      "Time_Start": 597.36,
      "Time_End": 604.0,
      "Text": " all over the place. Do not go to the airport and try to get through security. I left a"
    },
    {
      "Time_Start": 604.0,
      "Time_End": 608.44,
      "Text": " show, I had to catch a plane, I had all the picks on me, and I had to explain to them"
    },
    {
      "Time_Start": 608.44,
      "Time_End": 613.4,
      "Text": " why I had 32 keys for handcuffs, all these little pieces of wire, and I was pulling them"
    },
    {
      "Time_Start": 613.4,
      "Time_End": 616.32,
      "Text": " out one by one. I was like, oh, I got this one here, and I got this one here, and I'm"
    },
    {
      "Time_Start": 616.32,
      "Time_End": 620.16,
      "Text": " putting them on the table, and the lady's looking at me going, what the hell is up with"
    },
    {
      "Time_Start": 620.16,
      "Time_End": 627.16,
      "Text": " you? And I was like, I like heavy pants, okay? Yeah, and don't go swimming, okay? Just a"
    },
    {
      "Time_Start": 627.92,
      "Time_End": 634.92,
      "Text": " safety tip. On the belt loops here, always, always, always wear a belt, okay? It's great"
    },
    {
      "Time_Start": 635.4,
      "Time_End": 640.92,
      "Text": " for hiding things. If someone searches you, because, I mean, obviously you all want to"
    },
    {
      "Time_Start": 640.92,
      "Time_End": 647.1999999999999,
      "Text": " be professional magicians, right? Yeah, see, that's why I'm doing this talk. I'm progressing"
    },
    {
      "Time_Start": 647.1999999999999,
      "Time_End": 653.12,
      "Text": " the art. Okay, if you have someone search you for the entertainment value and try to"
    },
    {
      "Time_Start": 653.12,
      "Time_End": 657.72,
      "Text": " find the picks, it's a lot more amazing when you actually get out of the handcuffs. Wear"
    },
    {
      "Time_Start": 657.72,
      "Time_End": 664.72,
      "Text": " a belt. Wear the belt tight, not loose. You should be able to get your finger in here,"
    },
    {
      "Time_Start": 665.16,
      "Time_End": 669.72,
      "Text": " okay? It should be uncomfortable for them to get their finger here, especially if they"
    },
    {
      "Time_Start": 669.72,
      "Time_End": 673.68,
      "Text": " wear it lower, because I tell you right now, they're not going to want to put their finger"
    },
    {
      "Time_Start": 673.68,
      "Time_End": 680.6800000000001,
      "Text": " behind the belt down here, okay? What I used to do on my pants, and she doesn't have as"
    },
    {
      "Time_Start": 681.1600000000001,
      "Time_End": 685.48,
      "Text": " many loops as I have on mine, I've got like a whole bunch, I would actually sew a key"
    },
    {
      "Time_Start": 685.48,
      "Time_End": 692.48,
      "Text": " behind every single belt loop all around me. And sometimes I would sew on extra loops."
    },
    {
      "Time_Start": 693.6400000000001,
      "Time_End": 699.1600000000001,
      "Text": " And then what I would do along the top edge here, ignore the underwear, I would also put"
    },
    {
      "Time_Start": 699.1600000000001,
      "Time_End": 706.1600000000001,
      "Text": " sheet metal picks along the edges here, along here, down the sides, everywhere. This is"
    },
    {
      "Time_Start": 706.7199999999999,
      "Time_End": 711.4399999999999,
      "Text": " kind of hard to put your pants on, because you lift them up and go, Jesus Christ. Now"
    },
    {
      "Time_Start": 711.4399999999999,
      "Time_End": 715.64,
      "Text": " that's not the only place you can actually put picks. The pants is just the beginning."
    },
    {
      "Time_Start": 715.64,
      "Time_End": 722.0799999999999,
      "Text": " Your shoes can hold a ton of picks along the edges. Once again, your seams are your best"
    },
    {
      "Time_Start": 722.0799999999999,
      "Time_End": 726.68,
      "Text": " friends, because when they pat you down, it's like, okay, whatever, you know, no problem,"
    },
    {
      "Time_Start": 726.68,
      "Time_End": 733.68,
      "Text": " I don't feel anything, it's no biggie. I love knees, she's sweet. So all this stuff is usually"
    },
    {
      "Time_Start": 734.24,
      "Time_End": 738.6400000000001,
      "Text": " oblivious. And what I would sometimes do, just so people would actually find them, is"
    },
    {
      "Time_Start": 738.6400000000001,
      "Time_End": 743.24,
      "Text": " I'd make some of the picks obvious. So they went, hey, I found this, and I'm going, well,"
    },
    {
      "Time_Start": 743.24,
      "Time_End": 748.24,
      "Text": " duh. You'd have to be an idiot not to find that one. I left it out in the open for you."
    },
    {
      "Time_Start": 748.24,
      "Time_End": 753.96,
      "Text": " And believe it or not, I would always keep it like a paper clip, just stuck right here"
    },
    {
      "Time_Start": 753.96,
      "Time_End": 758.84,
      "Text": " in my back pocket. And no matter what, I always left that there, because I always wanted them"
    },
    {
      "Time_Start": 758.84,
      "Time_End": 762.6800000000001,
      "Text": " to go, hey, it's a paper clip, you could use this, and pull it away. No one ever took the"
    },
    {
      "Time_Start": 762.6800000000001,
      "Time_End": 769.6800000000001,
      "Text": " paper clip out of my back pocket. I was like, whatever. Your shirt, wear a heavy shirt."
    },
    {
      "Time_Start": 770.8800000000001,
      "Time_End": 777.5600000000001,
      "Text": " Sweatshirts are really great for hiding picks in. Make little pockets, be a ninja, you know,"
    },
    {
      "Time_Start": 777.5600000000001,
      "Time_End": 782.32,
      "Text": " pocket boy. And the coolest thing that I heard of that just came out, or might have been"
    },
    {
      "Time_Start": 782.32,
      "Time_End": 788.6800000000001,
      "Text": " out, who here has a pierced tongue? Raise your hand. Nobody has a pierced tongue at"
    },
    {
      "Time_Start": 788.6800000000001,
      "Time_End": 795.6800000000001,
      "Text": " a hacker convention? Okay. One girl. And niece. Okay. And I know that, too, duh. Not"
    },
    {
      "Time_Start": 800.44,
      "Time_End": 807.44,
      "Text": " like you think. A friend of mine, B-String, was telling me on the phone, he goes, dude,"
    },
    {
      "Time_Start": 809.08,
      "Time_End": 813.6,
      "Text": " you've got to check this out. Well, he has his tongue pierced, he's got a barbell. No,"
    },
    {
      "Time_Start": 813.64,
      "Time_End": 820.64,
      "Text": " you don't have to show your ass anymore. Thank you. Hand for niece. Apparently they sell"
    },
    {
      "Time_Start": 821.96,
      "Time_End": 826.32,
      "Text": " the barbell for your pierced tongue, and this would probably work for any other type of"
    },
    {
      "Time_Start": 826.32,
      "Time_End": 833.12,
      "Text": " piercings. Oh, it's a custom piece? Okay. It's a custom piece for the tongue. And what"
    },
    {
      "Time_Start": 833.12,
      "Time_End": 836.72,
      "Text": " it is, it's your little barbell, and if you get your hands up there, you can unscrew the"
    },
    {
      "Time_Start": 836.72,
      "Time_End": 843.72,
      "Text": " top, and it's a handcuff key. And I'm going, hmm, get my tongue pierced? No, I've got other"
    },
    {
      "Time_Start": 843.72,
      "Time_End": 848.72,
      "Text": " places to hide it. But if you have your tongue pierced, that's like perfect. Who's going"
    },
    {
      "Time_Start": 848.72,
      "Time_End": 855.72,
      "Text": " to say, let me see that barbell? You're going, these picks can be hidden anywhere. You got"
    },
    {
      "Time_Start": 856.08,
      "Time_End": 860.96,
      "Text": " a hat, more places to hide the picks. All right. On to the explanation on how picks"
    },
    {
      "Time_Start": 860.96,
      "Time_End": 867.96,
      "Text": " are hidden. So one other thing that occurred to us before this is that something that I've"
    },
    {
      "Time_Start": 874.32,
      "Time_End": 878.76,
      "Text": " done from time to time to show where you can hide picks and how much fun you can have with"
    },
    {
      "Time_Start": 878.76,
      "Time_End": 885.76,
      "Text": " it is you have lots and lots of very natural places to hide picks. For instance, hidden"
    },
    {
      "Time_Start": 886.76,
      "Time_End": 893.76,
      "Text": " within the beard. It doesn't work on me. You can also tuck them into the hair. If you're"
    },
    {
      "Time_Start": 896.0,
      "Time_End": 903.0,
      "Text": " wearing hairpins or various things of that sort. I have designed in the past lock picks"
    },
    {
      "Time_Start": 903.0,
      "Time_End": 910.0,
      "Text": " that are earrings. Very, very stylish. Basically, you want to make it into anything that people"
    },
    {
      "Time_Start": 910.04,
      "Time_End": 917.04,
      "Text": " aren't looking for. Glasses. When I was very young, I used to get out of handcuffs using"
    },
    {
      "Time_Start": 917.44,
      "Time_End": 924.44,
      "Text": " my night brace. All sorts of things. Basically, you're just hiding a piece of metal. There's"
    },
    {
      "Time_Start": 925.84,
      "Time_End": 930.96,
      "Text": " two different types of handcuffs. This is more the police regulation handcuffs here,"
    },
    {
      "Time_Start": 930.96,
      "Time_End": 937.96,
      "Text": " which are a piece of chain separated by little ball swivels. And it's a ratchet style handcuff."
    },
    {
      "Time_Start": 938.48,
      "Time_End": 943.5600000000001,
      "Text": " You can buy handcuffs anywhere, people. Just make sure it's a ratchet style handcuff and"
    },
    {
      "Time_Start": 943.5600000000001,
      "Time_End": 948.36,
      "Text": " not the one with the little circle pin thing there because you're not going to really learn"
    },
    {
      "Time_Start": 948.36,
      "Time_End": 953.36,
      "Text": " how to pick with those. They're not the police regulation ones. You want to play with these."
    },
    {
      "Time_Start": 953.36,
      "Time_End": 958.32,
      "Text": " Also, the keyhole is designed with a piece of metal in the center so it's very difficult"
    },
    {
      "Time_Start": 958.32,
      "Time_End": 963.32,
      "Text": " to get a piece of metal inside there to actually pick it physically. So it was actually pretty"
    },
    {
      "Time_Start": 963.36,
      "Time_End": 967.5600000000001,
      "Text": " well thought out until someone did, hey, look, I have a street sweeper and hey, there's a"
    },
    {
      "Time_Start": 967.5600000000001,
      "Time_End": 972.32,
      "Text": " piece of metal and hey, let's try this. The way this works is it has a ratchet that comes"
    },
    {
      "Time_Start": 972.32,
      "Time_End": 979.32,
      "Text": " down and grabs the teeth, which keeps you from opening it. All right, that's point one."
    },
    {
      "Time_Start": 980.32,
      "Time_End": 987.32,
      "Text": " Neon, can I borrow you for a second? I need you to hold the microphone down. Neon rain."
    },
    {
      "Time_Start": 988.32,
      "Time_End": 1005.32,
      "Text": " The way these work is the inside of this has a series of four ratchets shaped like this."
    },
    {
      "Time_Start": 1005.32,
      "Time_End": 1010.32,
      "Text": " And what these do is they come down and they press down, this whole section is on a spring,"
    },
    {
      "Time_Start": 1010.32,
      "Time_End": 1016.32,
      "Text": " and then they bounce up and catch the teeth. Very simplistic thing. The problem here is"
    },
    {
      "Time_Start": 1016.32,
      "Time_End": 1029.3200000000002,
      "Text": " this is a spring. Now, these wonderful pieces of metal fit perfectly down here to where"
    },
    {
      "Time_Start": 1029.3200000000002,
      "Time_End": 1034.3200000000002,
      "Text": " the springs are. They're also thin enough that they can get between this and the handcuff"
    },
    {
      "Time_Start": 1034.3200000000002,
      "Time_End": 1041.3200000000002,
      "Text": " and actually press the spring down. And then, boom, this pops open. Now you're going, well,"
    },
    {
      "Time_Start": 1041.32,
      "Time_End": 1046.32,
      "Text": " why isn't he demoing this? Because these are not police regulation handcuffs and we"
    },
    {
      "Time_Start": 1046.32,
      "Time_End": 1052.32,
      "Text": " didn't grind these. So these don't fit very well in here. It makes it very, very difficult."
    },
    {
      "Time_Start": 1052.32,
      "Time_End": 1056.32,
      "Text": " I don't understand it. You can buy aftermarket handcuffs that are quote unquote police regulation"
    },
    {
      "Time_Start": 1056.32,
      "Time_End": 1061.32,
      "Text": " type handcuffs and you actually have to modify these to pick those. But if you actually have"
    },
    {
      "Time_Start": 1061.32,
      "Time_End": 1068.32,
      "Text": " real police handcuffs, you don't. Which I don't understand. Because regular police regulation"
    },
    {
      "Time_Start": 1068.32,
      "Time_End": 1073.32,
      "Text": " handcuffs, these work perfectly without any modifications. But when you buy them, you know,"
    },
    {
      "Time_Start": 1073.32,
      "Time_End": 1080.32,
      "Text": " at the alternate toy shop, sometimes you have to file them down. Sometimes you don't, sometimes"
    },
    {
      "Time_Start": 1080.32,
      "Time_End": 1085.32,
      "Text": " you do. Also, most handcuffs aren't very well oiled when you buy them. You have to oil them"
    },
    {
      "Time_Start": 1085.32,
      "Time_End": 1090.32,
      "Text": " and lubricate them, make sure the spring's done well. And police are always very notorious"
    },
    {
      "Time_Start": 1090.32,
      "Time_End": 1097.32,
      "Text": " for keeping them very well lubricated, the handcuffs. Okay. Now, the cool thing with"
    },
    {
      "Time_Start": 1097.32,
      "Time_End": 1102.32,
      "Text": " these type of handcuffs is when you're in the handcuffs, you can twist your wrist to"
    },
    {
      "Time_Start": 1102.32,
      "Time_End": 1107.32,
      "Text": " be able to move around to slide the bar down and open up the handcuffs. Great. Well, someone"
    },
    {
      "Time_Start": 1107.32,
      "Time_End": 1120.32,
      "Text": " invented these. These are a bitch. Now, the thing with the flat bar is the flat bar works"
    },
    {
      "Time_Start": 1120.32,
      "Time_End": 1125.32,
      "Text": " great if it's a single lock handcuffs, which basically means they jump in here and they"
    },
    {
      "Time_Start": 1125.32,
      "Time_End": 1129.32,
      "Text": " can still be tightened again. Well, there's a little pin on the side of the handcuffs"
    },
    {
      "Time_Start": 1129.32,
      "Time_End": 1134.32,
      "Text": " here that if they double lock the handcuffs, it actually locks that spring in the up position,"
    },
    {
      "Time_Start": 1134.32,
      "Time_End": 1138.32,
      "Text": " which means that little flat bar doesn't do anything and you're back to a very small"
    },
    {
      "Time_Start": 1138.32,
      "Time_End": 1145.32,
      "Text": " paper clip or what I like to do is I like to take a sewing needle and I'll hide the"
    },
    {
      "Time_Start": 1145.32,
      "Time_End": 1149.32,
      "Text": " sewing needle and the sewing needle I'll do is I'll bend the tip of the sewing needle"
    },
    {
      "Time_Start": 1149.32,
      "Time_End": 1152.32,
      "Text": " and it'll fit perfectly inside the lock and it's easy, I'll actually make like a little"
    },
    {
      "Time_Start": 1152.32,
      "Time_End": 1156.32,
      "Text": " Z with the sewing needle like this and I can actually put it inside the lock and turn it"
    },
    {
      "Time_Start": 1156.32,
      "Time_End": 1162.32,
      "Text": " and actually pick the handcuffs directly that way. But with these, you have no hinge."
    },
    {
      "Time_Start": 1163.32,
      "Time_End": 1167.32,
      "Text": " Oh, damn. You're good. Here, I have a sewing needle."
    },
    {
      "Time_Start": 1169.32,
      "Time_End": 1171.32,
      "Text": " It was in my purse."
    },
    {
      "Time_Start": 1171.32,
      "Time_End": 1178.32,
      "Text": " No comment. But if you look here, most picks and stuff are too thick to hand here and this"
    },
    {
      "Time_Start": 1178.32,
      "Time_End": 1184.32,
      "Text": " slides right in here and you can go all the way around. Ow, as it stabs me in the finger."
    },
    {
      "Time_Start": 1184.32,
      "Time_End": 1188.32,
      "Text": " Wrong end. Way to go. By the way, if you use a sewing needle, cut off the tip. Just a safety"
    },
    {
      "Time_Start": 1188.32,
      "Time_End": 1193.32,
      "Text": " thought. But it fits perfectly in here. So it's a lot easier to actually zoom around"
    },
    {
      "Time_Start": 1193.32,
      "Time_End": 1198.32,
      "Text": " and actually pick. Sewing needles are great. Thank you. You can have it back. It stabbed"
    },
    {
      "Time_Start": 1198.32,
      "Time_End": 1203.32,
      "Text": " me and I'm bleeding. That's wonderful. Now, I actually got locked up in one of these before"
    },
    {
      "Time_Start": 1203.32,
      "Time_End": 1209.32,
      "Text": " and I was doing an escape, an underwater escape, which I will never, ever do again. If you"
    },
    {
      "Time_Start": 1209.32,
      "Time_End": 1213.32,
      "Text": " ever see magicians doing underwater escapes and you're going, oh, that's not dangerous,"
    },
    {
      "Time_Start": 1213.32,
      "Time_End": 1219.32,
      "Text": " he knows what he's doing. Uh-uh. No. I know a lot of professional magicians. I know David"
    },
    {
      "Time_Start": 1219.32,
      "Time_End": 1225.32,
      "Text": " Copperfield. I know Harry Blackstone Jr., Penn Dragons, Penn and Taylor. I know a lot"
    },
    {
      "Time_Start": 1225.32,
      "Time_End": 1228.32,
      "Text": " of these guys and I've talked to some of these people who have attempted. You notice you"
    },
    {
      "Time_Start": 1228.32,
      "Time_End": 1232.32,
      "Text": " don't see the underwater illusions with the really big names? There's a reason. I know"
    },
    {
      "Time_Start": 1232.32,
      "Time_End": 1236.32,
      "Text": " a lot of people who have nearly drowned on rehearsals. It's really, really dangerous."
    },
    {
      "Time_Start": 1236.32,
      "Time_End": 1243.32,
      "Text": " So here I am being stupid and doing an underwater thing I did not rehearse. And I said, hey,"
    },
    {
      "Time_Start": 1243.32,
      "Time_End": 1248.32,
      "Text": " no sweat. I can hold my breath for four minutes. I was practicing. And I know I can pick out,"
    },
    {
      "Time_Start": 1248.32,
      "Time_End": 1252.32,
      "Text": " you know, pick these locks. No question. All I asked is someone bring up a pair of handcuffs,"
    },
    {
      "Time_Start": 1252.32,
      "Time_End": 1257.32,
      "Text": " handcuff me in. I had my picks. I was ready to go. They doused me underwater and someone"
    },
    {
      "Time_Start": 1257.32,
      "Time_End": 1263.32,
      "Text": " brought these. And I was like, hey, I've never seen those. Shouldn't be a problem. Okay."
    },
    {
      "Time_Start": 1264.32,
      "Time_End": 1271.32,
      "Text": " That was almost my famous last words. Literally. Because first thing they did is they put the"
    },
    {
      "Time_Start": 1271.32,
      "Time_End": 1277.32,
      "Text": " handcuffs with the locking mechanism toward me. And they're like this and you can't turn."
    },
    {
      "Time_Start": 1277.32,
      "Time_End": 1283.32,
      "Text": " You can't get to the lock. Also, you do have the key for this, right? These are triple"
    },
    {
      "Time_Start": 1283.32,
      "Time_End": 1291.32,
      "Text": " locking handcuffs. Triple locking means that without the key you are totally foobarred."
    },
    {
      "Time_Start": 1292.32,
      "Time_End": 1294.32,
      "Text": " Oh, here. Handcuff me, baby."
    },
    {
      "Time_Start": 1298.32,
      "Time_End": 1300.32,
      "Text": " Who's your daddy? Okay."
    },
    {
      "Time_Start": 1304.32,
      "Time_End": 1309.32,
      "Text": " Now, the problem here is when these are tight on the wrist, it's very difficult to grab"
    },
    {
      "Time_Start": 1309.32,
      "Time_End": 1313.32,
      "Text": " anything and place it in here, much less on this side. I can't turn my wrist. On top of"
    },
    {
      "Time_Start": 1313.32,
      "Time_End": 1319.32,
      "Text": " that, I couldn't get into the pick. And all I wanted to do and all I had with me was a"
    },
    {
      "Time_Start": 1319.32,
      "Time_End": 1324.32,
      "Text": " single flat bar. This is when I started putting thousands of picks on my body right after"
    },
    {
      "Time_Start": 1324.32,
      "Time_End": 1328.32,
      "Text": " this trick. So I had this single flat bar and I couldn't get in here because the son"
    },
    {
      "Time_Start": 1328.32,
      "Time_End": 1334.32,
      "Text": " of a bitch triple locked it on me. And I'm sitting there going, I'm underwater. I can't"
    },
    {
      "Time_Start": 1334.32,
      "Time_End": 1339.32,
      "Text": " breathe. I can't get out of this because I was chained behind a pole. I was smart enough"
    },
    {
      "Time_Start": 1339.32,
      "Time_End": 1345.32,
      "Text": " to sit there and work out a signal with our stage hands that if I give the signal, get"
    },
    {
      "Time_Start": 1345.32,
      "Time_End": 1350.32,
      "Text": " me the hell out of the water, it means I'm dying. I made sure to pay him in advance for"
    },
    {
      "Time_Start": 1350.32,
      "Time_End": 1357.32,
      "Text": " the show, by the way. A really nice brother said, so I'm sitting there hitting the signal"
    },
    {
      "Time_Start": 1357.32,
      "Time_End": 1363.32,
      "Text": " and he's talking to some chick. I got bubbles coming out of my mouth and I'm stomping on"
    },
    {
      "Time_Start": 1363.32,
      "Time_End": 1367.32,
      "Text": " the cage with one fist like this. And he's sitting there like I can see him off stage"
    },
    {
      "Time_Start": 1367.32,
      "Time_End": 1371.32,
      "Text": " and I'm going, so, hi, how you doing? You want to be a magician's assistant? I'm not"
    },
    {
      "Time_Start": 1371.32,
      "Time_End": 1376.32,
      "Text": " really a magician, but he is and I can get you in. And he finally turns around and the"
    },
    {
      "Time_Start": 1376.32,
      "Time_End": 1381.32,
      "Text": " stage comes up and I'm going, I'm sorry, I can't do it. That was probably the most embarrassing"
    },
    {
      "Time_Start": 1381.32,
      "Time_End": 1386.32,
      "Text": " time of my life. These are really, really hard to pick. Even with the lock on the other"
    },
    {
      "Time_Start": 1386.32,
      "Time_End": 1392.32,
      "Text": " side, they're very difficult to pick, even with the needle. They're hard. So if your"
    },
    {
      "Time_Start": 1392.32,
      "Time_End": 1400.32,
      "Text": " girlfriend or boyfriend or both puts you into these and they go out for a sandwich, take"
    },
    {
      "Time_Start": 1400.32,
      "Time_End": 1419.32,
      "Text": " a nap. You're going to be there for a while. Get me out. This is the other hard part."
    },
    {
      "Time_Start": 1419.32,
      "Time_End": 1430.32,
      "Text": " Thank you, Dan. Okay, so questions on this portion of the talk?"
    },
    {
      "Time_Start": 1430.32,
      "Time_End": 1438.32,
      "Text": " Can you explain that one? The triple locking portions of these?"
    },
    {
      "Time_Start": 1438.32,
      "Time_End": 1443.32,
      "Text": " I only know about two of them. It surprised me on that one too."
    },
    {
      "Time_Start": 1444.32,
      "Time_End": 1450.32,
      "Text": " It automatically locks when you first put it down. It makes the spring a lot more difficult"
    },
    {
      "Time_Start": 1450.32,
      "Time_End": 1455.32,
      "Text": " to press down so they can be tightened, but it's harder to press the spring down. It automatically"
    },
    {
      "Time_Start": 1455.32,
      "Time_End": 1461.32,
      "Text": " does that, so that's lock one. Then you have the little press in button here and it forces"
    },
    {
      "Time_Start": 1461.32,
      "Time_End": 1465.32,
      "Text": " the spring up and you can't get it through that and it's lock two. Also, actually maybe"
    },
    {
      "Time_Start": 1465.32,
      "Time_End": 1468.32,
      "Text": " they're only double locking. I think they're only double locking. These are. The third"
    },
    {
      "Time_Start": 1468.32,
      "Time_End": 1475.32,
      "Text": " ones I saw actually made it so this portion didn't bend. These do. The ones that I saw,"
    },
    {
      "Time_Start": 1475.32,
      "Time_End": 1480.32,
      "Text": " which are the triple locking ones, these are still a hinge and then you hit the other lock"
    },
    {
      "Time_Start": 1480.32,
      "Time_End": 1487.32,
      "Text": " and it's a solid piece of metal. I was like, well, that sucks. A lot."
    },
    {
      "Time_Start": 1487.32,
      "Time_End": 1491.32,
      "Text": " The other thing with these locks are, just for the point, if you can get a pair of these"
    },
    {
      "Time_Start": 1491.32,
      "Time_End": 1497.32,
      "Text": " to play with, they got smart on these. When you put the pry bar down here, it's almost"
    },
    {
      "Time_Start": 1497.32,
      "Time_End": 1502.32,
      "Text": " impossible to get it down less than a millimeter. So you can't even get the pry bar through"
    },
    {
      "Time_Start": 1502.32,
      "Time_End": 1508.32,
      "Text": " here to get to the spring anyhow. It's a pain in the butt. I've ground down some of my files"
    },
    {
      "Time_Start": 1508.32,
      "Time_End": 1512.32,
      "Text": " where I was like, hey, there's no more metal left and I still can't get through. So it's"
    },
    {
      "Time_Start": 1512.32,
      "Time_End": 1516.32,
      "Text": " a pain."
    },
    {
      "Time_Start": 1516.32,
      "Time_End": 1521.32,
      "Text": " Actually, I don't see a lot of police officers with them, but the ones that have them like"
    },
    {
      "Time_Start": 1521.32,
      "Time_End": 1528.32,
      "Text": " to use them a lot. The other thing that police officers like to use is zip ties. There are"
    },
    {
      "Time_Start": 1528.32,
      "Time_End": 1532.32,
      "Text": " no pigs. Get over it. I don't recommend zip ties when you're playing with somebody else"
    },
    {
      "Time_Start": 1532.32,
      "Time_End": 1535.32,
      "Text": " either, by the way, because they're really, really dangerous and you have to cut them"
    },
    {
      "Time_Start": 1535.32,
      "Time_End": 1538.32,
      "Text": " off. And I don't know about you, but I'm really nervous about leaving them with a knife near"
    },
    {
      "Time_Start": 1538.32,
      "Time_End": 1543.32,
      "Text": " my wrist. Especially if I've had to argue with them in the past two years."
    },
    {
      "Time_Start": 1543.32,
      "Time_End": 1545.32,
      "Text": " Question?"
    },
    {
      "Time_Start": 1545.32,
      "Time_End": 1547.32,
      "Text": " What?"
    },
    {
      "Time_Start": 1547.32,
      "Time_End": 1549.32,
      "Text": " Oh, thumb cuffs."
    },
    {
      "Time_Start": 1549.32,
      "Time_End": 1553.32,
      "Text": " You were supposed to bring me some thumb cuffs because I was going to talk about those. Thumb"
    },
    {
      "Time_Start": 1553.32,
      "Time_End": 1558.32,
      "Text": " cuffs actually are a lot like handcuffs because you can actually use the pry bar on them."
    },
    {
      "Time_Start": 1558.32,
      "Time_End": 1563.32,
      "Text": " They just hurt really, really bad as you're trying to move your wrist around because they"
    },
    {
      "Time_Start": 1563.32,
      "Time_End": 1568.32,
      "Text": " actually have teeth on the inside that grip to your thumbs. So if you have sweaty thumbs,"
    },
    {
      "Time_Start": 1568.32,
      "Time_End": 1572.32,
      "Text": " why you would have sweaty thumbs, I don't know. But if you have sweaty thumbs, it keeps"
    },
    {
      "Time_Start": 1572.32,
      "Time_End": 1577.32,
      "Text": " them from coming off your thumbs. And thumb cuffs hurt a lot. So I've actually gotten"
    },
    {
      "Time_Start": 1577.32,
      "Time_End": 1579.32,
      "Text": " out thumb cuffs once."
    },
    {
      "Time_Start": 1585.32,
      "Time_End": 1588.32,
      "Text": " You know, it's funny you mention that. Demonstration time."
    },
    {
      "Time_Start": 1592.32,
      "Time_End": 1595.32,
      "Text": " This was the most popular part last year."
    },
    {
      "Time_Start": 1596.32,
      "Time_End": 1601.32,
      "Text": " I can get out of a recognition straitjacket in under 30 seconds."
    },
    {
      "Time_Start": 1604.32,
      "Time_End": 1608.32,
      "Text": " In this instance, he does have something up his sleeves."
    },
    {
      "Time_Start": 1608.32,
      "Time_End": 1610.32,
      "Text": " Here?"
    },
    {
      "Time_Start": 1610.32,
      "Time_End": 1612.32,
      "Text": " I want to talk to you afterwards."
    },
    {
      "Time_Start": 1612.32,
      "Time_End": 1614.32,
      "Text": " So do I."
    },
    {
      "Time_Start": 1617.32,
      "Time_End": 1621.32,
      "Text": " I've done this already twice where my right shoulder is kind of sore."
    },
    {
      "Time_Start": 1625.32,
      "Time_End": 1627.32,
      "Text": " I've done this before."
    },
    {
      "Time_Start": 1641.32,
      "Time_End": 1643.32,
      "Text": " Don't try this at home."
    },
    {
      "Time_Start": 1656.32,
      "Time_End": 1658.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1666.32,
      "Time_End": 1671.32,
      "Text": " Actually, you're not really born able to do that."
    },
    {
      "Time_Start": 1671.32,
      "Time_End": 1676.32,
      "Text": " When I was five years old, I fell out of a tree about a story and a half and landed on"
    },
    {
      "Time_Start": 1676.32,
      "Time_End": 1680.32,
      "Text": " a brick in my back and I dislocated both shoulders at the same time."
    },
    {
      "Time_Start": 1680.32,
      "Time_End": 1683.32,
      "Text": " And since then I'm able to do that."
    },
    {
      "Time_Start": 1683.32,
      "Time_End": 1685.32,
      "Text": " Unlike Mel Gibson."
    },
    {
      "Time_Start": 1685.32,
      "Time_End": 1687.32,
      "Text": " Yeah, it was worth it."
    },
    {
      "Time_Start": 1687.32,
      "Time_End": 1690.32,
      "Text": " Yeah, you try to get up when you can't move your arms."
    },
    {
      "Time_Start": 1690.32,
      "Time_End": 1692.32,
      "Text": " It's kind of a bitch."
    },
    {
      "Time_Start": 1692.32,
      "Time_End": 1697.32,
      "Text": " But it doesn't hurt that bad to actually put them back in."
    },
    {
      "Time_Start": 1697.32,
      "Time_End": 1701.32,
      "Text": " It just makes your arms kind of sore like you've lifted weights for an hour and a half."
    },
    {
      "Time_Start": 1703.32,
      "Time_End": 1705.32,
      "Text": " Yes, sir."
    },
    {
      "Time_Start": 1709.32,
      "Time_End": 1711.32,
      "Text": " Yes, they do."
    },
    {
      "Time_Start": 1711.32,
      "Time_End": 1713.32,
      "Text": " Yes, they are metal."
    },
    {
      "Time_Start": 1713.32,
      "Time_End": 1715.32,
      "Text": " But you know what?"
    },
    {
      "Time_Start": 1715.32,
      "Time_End": 1717.32,
      "Text": " They're not illegal."
    },
    {
      "Time_Start": 1717.32,
      "Time_End": 1721.32,
      "Text": " And really it depends on how many you have with you in any given density."
    },
    {
      "Time_Start": 1721.32,
      "Time_End": 1725.32,
      "Text": " I've walked through carrying a fair number and they've never cared."
    },
    {
      "Time_Start": 1727.32,
      "Time_End": 1729.32,
      "Text": " No, I had 200 on me."
    },
    {
      "Time_Start": 1731.32,
      "Time_End": 1733.32,
      "Text": " Plus keys."
    },
    {
      "Time_Start": 1733.32,
      "Time_End": 1735.32,
      "Text": " So I have a lot of metal."
    },
    {
      "Time_Start": 1735.32,
      "Time_End": 1737.32,
      "Text": " Any other questions and then we're going to continue."
    },
    {
      "Time_Start": 1742.32,
      "Time_End": 1744.32,
      "Text": " Okay, what are street cleaning bristles?"
    },
    {
      "Time_Start": 1744.32,
      "Time_End": 1746.32,
      "Text": " He missed the talk."
    },
    {
      "Time_Start": 1746.32,
      "Time_End": 1748.32,
      "Text": " This is a metal."
    },
    {
      "Time_Start": 1748.32,
      "Time_End": 1750.32,
      "Text": " These are the bristles from street sweepers."
    },
    {
      "Time_Start": 1750.32,
      "Time_End": 1754.32,
      "Text": " So when a street sweeper walks by, just kind of follow it."
    },
    {
      "Time_Start": 1754.32,
      "Time_End": 1756.32,
      "Text": " Like, pssh, thank you."
    },
    {
      "Time_Start": 1756.32,
      "Time_End": 1758.32,
      "Text": " Next, pssh, thank you."
    },
    {
      "Time_Start": 1758.32,
      "Time_End": 1760.32,
      "Text": " These are actually gurneys."
    },
    {
      "Time_Start": 1760.32,
      "Time_End": 1764.32,
      "Text": " Street cleaning bristles in most major cities are everywhere."
    },
    {
      "Time_Start": 1764.32,
      "Time_End": 1767.32,
      "Text": " But you're not really trained to see them."
    },
    {
      "Time_Start": 1767.32,
      "Time_End": 1770.32,
      "Text": " And once you start looking for them, they're everywhere."
    },
    {
      "Time_Start": 1770.32,
      "Time_End": 1772.32,
      "Text": " Well, they're dark and they blend in."
    },
    {
      "Time_Start": 1772.32,
      "Time_End": 1774.32,
      "Text": " They blend in with concrete."
    },
    {
      "Time_Start": 1774.32,
      "Time_End": 1779.32,
      "Text": " And if you start walking along the street just looking for pieces of metal like that,"
    },
    {
      "Time_Start": 1779.32,
      "Time_End": 1781.32,
      "Text": " you'll be surprised how many you find."
    },
    {
      "Time_Start": 1781.32,
      "Time_End": 1782.32,
      "Text": " Yeah, that's kind of cool."
    },
    {
      "Time_Start": 1782.32,
      "Time_End": 1784.32,
      "Text": " If you walk barefoot, you find more."
    },
    {
      "Time_Start": 1786.32,
      "Time_End": 1788.32,
      "Text": " Alright, one more question and we're going to move on."
    },
    {
      "Time_Start": 1788.32,
      "Time_End": 1789.32,
      "Text": " You."
    },
    {
      "Time_Start": 1789.32,
      "Time_End": 1792.32,
      "Text": " What about the theory of hiding stuff in steel-toed shoes?"
    },
    {
      "Time_Start": 1792.32,
      "Time_End": 1797.32,
      "Text": " Well, yeah, you can hide things in steel-toed shoes, but how are you going to get them out?"
    },
    {
      "Time_Start": 1797.32,
      "Time_End": 1799.32,
      "Text": " I mean, there's probably an upper part."
    },
    {
      "Time_Start": 1799.32,
      "Time_End": 1801.32,
      "Text": " Yeah, you can actually drill a hole."
    },
    {
      "Time_Start": 1801.32,
      "Time_End": 1803.32,
      "Text": " And, I mean, that's fine."
    },
    {
      "Time_Start": 1803.32,
      "Time_End": 1804.32,
      "Text": " But, you know what?"
    },
    {
      "Time_Start": 1804.32,
      "Time_End": 1805.32,
      "Text": " You get the metal in your laces, too."
    },
    {
      "Time_Start": 1805.32,
      "Time_End": 1806.32,
      "Text": " And it's a lot easier."
    },
    {
      "Time_Start": 1806.32,
      "Time_End": 1808.32,
      "Text": " And you don't have to drill any holes."
    },
    {
      "Time_Start": 1808.32,
      "Time_End": 1809.32,
      "Text": " Because they're going to go."
    },
    {
      "Time_Start": 1809.32,
      "Time_End": 1811.32,
      "Text": " Because that wand just goes, dee-dee-dee-dee."
    },
    {
      "Time_Start": 1811.32,
      "Time_End": 1814.32,
      "Text": " You know, you can have anything there."
    },
    {
      "Time_Start": 1814.32,
      "Time_End": 1817.32,
      "Text": " And it's going to pick up the metal on the shoes anyhow."
    },
    {
      "Time_Start": 1817.32,
      "Time_End": 1819.32,
      "Text": " Belt buckles are my favorite."
    },
    {
      "Time_Start": 1819.32,
      "Time_End": 1820.32,
      "Text": " Oh, my God, man."
    },
    {
      "Time_Start": 1820.32,
      "Time_End": 1823.32,
      "Text": " Get one of your big old Texan belt buckles."
    },
    {
      "Time_Start": 1823.32,
      "Time_End": 1827.32,
      "Text": " You know, the things you can actually use to hide behind in case of, like, gunfire."
    },
    {
      "Time_Start": 1827.32,
      "Time_End": 1829.32,
      "Text": " These big, huge monster things."
    },
    {
      "Time_Start": 1829.32,
      "Time_End": 1830.32,
      "Text": " Wear a cowboy hat."
    },
    {
      "Time_Start": 1830.32,
      "Time_End": 1831.32,
      "Text": " Yep."
    },
    {
      "Time_Start": 1831.32,
      "Time_End": 1832.32,
      "Text": " Mm-hmm."
    },
    {
      "Time_Start": 1832.32,
      "Time_End": 1833.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 1833.32,
      "Time_End": 1835.32,
      "Text": " You kind of wander over there."
    },
    {
      "Time_Start": 1835.32,
      "Time_End": 1837.32,
      "Text": " And they're going, hey, that's a nice belt buckle."
    },
    {
      "Time_Start": 1837.32,
      "Time_End": 1839.32,
      "Text": " And behind it, you've got car keys."
    },
    {
      "Time_Start": 1839.32,
      "Time_End": 1841.32,
      "Text": " You know, all kinds of other crap there."
    },
    {
      "Time_Start": 1841.32,
      "Time_End": 1843.32,
      "Text": " Throwing stars, you know."
    },
    {
      "Time_Start": 1843.32,
      "Time_End": 1845.32,
      "Text": " You know, it's like, you know."
    },
    {
      "Time_Start": 1845.32,
      "Time_End": 1848.32,
      "Text": " I did it once when I was 18 going to the airport."
    },
    {
      "Time_Start": 1848.32,
      "Time_End": 1851.32,
      "Text": " I actually had a whole bunch of stuff there I probably shouldn't have had on the airplane."
    },
    {
      "Time_Start": 1851.32,
      "Time_End": 1853.32,
      "Text": " And I went, oh, God."
    },
    {
      "Time_Start": 1853.32,
      "Time_End": 1855.32,
      "Text": " And they went, okay, go."
    },
    {
      "Time_Start": 1855.32,
      "Time_End": 1858.32,
      "Text": " And I went, oh, God."
    },
    {
      "Time_Start": 1858.32,
      "Time_End": 1859.32,
      "Text": " All right."
    },
    {
      "Time_Start": 1859.32,
      "Time_End": 1860.32,
      "Text": " We're going to continue on."
    },
    {
      "Time_Start": 1860.32,
      "Time_End": 1861.32,
      "Text": " That's my portion of the talk."
    },
    {
      "Time_Start": 1861.32,
      "Time_End": 1862.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 1862.32,
      "Time_End": 1874.32,
      "Text": " Thank you."
    },
    {
      "Time_Start": 1874.32,
      "Time_End": 1878.32,
      "Text": " I still get to sit up here."
    },
    {
      "Time_Start": 1878.32,
      "Time_End": 1879.32,
      "Text": " Do you want to start with that?"
    },
    {
      "Time_Start": 1879.32,
      "Time_End": 1881.32,
      "Text": " Do you want me to rotate?"
    },
    {
      "Time_Start": 1881.32,
      "Time_End": 1882.32,
      "Text": " This will be up in a moment."
    },
    {
      "Time_Start": 1882.32,
      "Time_End": 1887.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 1887.32,
      "Time_End": 1889.32,
      "Text": " Let's start with a diagram."
    },
    {
      "Time_Start": 1917.32,
      "Time_End": 1934.32,
      "Text": " Okay, I guess we're going to go into talking about general lockpicking of pin tumbler type locks."
    },
    {
      "Time_Start": 1934.32,
      "Time_End": 1954.32,
      "Text": " We'll go over what a lock is composed of, a typical pin tumbler type lock."
    },
    {
      "Time_Start": 1954.32,
      "Time_End": 1957.32,
      "Text": " I know the graphics are shitty, but deal."
    },
    {
      "Time_Start": 1957.32,
      "Time_End": 1967.32,
      "Text": " So we've got a laser pointer."
    },
    {
      "Time_Start": 1967.32,
      "Time_End": 1969.32,
      "Text": " Anyone got a laser pointer?"
    },
    {
      "Time_Start": 1969.32,
      "Time_End": 1971.32,
      "Text": " I know."
    },
    {
      "Time_Start": 1971.32,
      "Time_End": 1974.32,
      "Text": " There must be some punky ass kids with laser pointers."
    },
    {
      "Time_Start": 1974.32,
      "Time_End": 1976.32,
      "Text": " Can I borrow it?"
    },
    {
      "Time_Start": 1976.32,
      "Time_End": 1984.32,
      "Text": " Thank you, this was just a social engineering experiment."
    },
    {
      "Time_Start": 1984.32,
      "Time_End": 1999.32,
      "Text": " Typical pin tumbler, obviously a key, and we've got two sets of pins actually."
    },
    {
      "Time_Start": 1999.32,
      "Time_End": 2004.32,
      "Text": " We've got the key pins, because they touch the key, and the drive pins up here."
    },
    {
      "Time_Start": 2004.32,
      "Time_End": 2008.32,
      "Text": " And pushing all that down is a series of springs."
    },
    {
      "Time_Start": 2008.32,
      "Time_End": 2017.32,
      "Text": " When you insert your key, the little ridges here, the pins fall into those ridges, and this is with the key in."
    },
    {
      "Time_Start": 2017.32,
      "Time_End": 2022.32,
      "Text": " But with the key out, you can see where the pins join here."
    },
    {
      "Time_Start": 2022.32,
      "Time_End": 2029.32,
      "Text": " They don't line up on this line here, which is actually this area, which is called the plug."
    },
    {
      "Time_Start": 2029.32,
      "Time_End": 2034.32,
      "Text": " And when you put your key in and the key turns, you're turning the plug."
    },
    {
      "Time_Start": 2034.32,
      "Time_End": 2036.32,
      "Text": " That's what rotates."
    },
    {
      "Time_Start": 2036.32,
      "Time_End": 2044.32,
      "Text": " So when you put your key in, it gets all these sets of pins all lined up on this line called the shear line."
    },
    {
      "Time_Start": 2044.32,
      "Time_End": 2048.3199999999997,
      "Text": " And when those are lined up, then the plug is free to turn."
    },
    {
      "Time_Start": 2048.3199999999997,
      "Time_End": 2055.3199999999997,
      "Text": " And then the mechanism behind here will unlock the lock."
    },
    {
      "Time_Start": 2055.3199999999997,
      "Time_End": 2058.3199999999997,
      "Text": " Do you have pictures?"
    },
    {
      "Time_Start": 2058.3199999999997,
      "Time_End": 2062.3199999999997,
      "Text": " We've got some images of some pick tools."
    },
    {
      "Time_Start": 2062.32,
      "Time_End": 2072.32,
      "Text": " But basically when you're picking, since you don't have the key, you want to be able to create this line of pins lined up on the shear line."
    },
    {
      "Time_Start": 2072.32,
      "Time_End": 2078.32,
      "Text": " And what you do, and I don't know if I have better graphics."
    },
    {
      "Time_Start": 2087.32,
      "Time_End": 2090.32,
      "Text": " I don't have a good graphic to show you how the process goes."
    },
    {
      "Time_Start": 2090.32,
      "Time_End": 2098.32,
      "Text": " But when the plug is turned and you have all these pins all in scattered positions, it's going to put some tension on the pins."
    },
    {
      "Time_Start": 2101.32,
      "Time_End": 2112.32,
      "Text": " Even though you may take a lock apart and you take a look and you see this series of holes where all the pins are, they're not all lined up exactly."
    },
    {
      "Time_Start": 2112.32,
      "Time_End": 2116.32,
      "Text": " There's some skewing of the holes for the pins."
    },
    {
      "Time_Start": 2116.32,
      "Time_End": 2121.32,
      "Text": " And that's the sort of defect that you're going to take advantage of when you actually do your lock picking."
    },
    {
      "Time_Start": 2121.32,
      "Time_End": 2124.32,
      "Text": " You're going to actually depend on that for the picking."
    },
    {
      "Time_Start": 2124.32,
      "Time_End": 2130.32,
      "Text": " When you rotate the plug, because of that skew, certain pins are going to bind first."
    },
    {
      "Time_Start": 2130.32,
      "Time_End": 2137.32,
      "Text": " And what you want to do is get these pins pushed up such that they do get to the shear line."
    },
    {
      "Time_Start": 2137.32,
      "Time_End": 2143.32,
      "Text": " And then these drive pins, because you're turning, get caught up inside, up in this area."
    },
    {
      "Time_Start": 2143.32,
      "Time_End": 2154.32,
      "Text": " And if you can do that one by one and get all these drive pins caught up inside of the hole area up in here, then you'll be able to rotate the plug and open the lock."
    },
    {
      "Time_Start": 2158.32,
      "Time_End": 2164.32,
      "Text": " And we've got some, let's take a look at some of the tools here."
    },
    {
      "Time_Start": 2174.32,
      "Time_End": 2178.32,
      "Text": " So here's some of your basic tools."
    },
    {
      "Time_Start": 2178.32,
      "Time_End": 2185.32,
      "Text": " A lot of times you can pick a lock with a method called scrubbing or raking."
    },
    {
      "Time_Start": 2185.32,
      "Time_End": 2191.32,
      "Text": " And I often use a snake shape tool, which is this one."
    },
    {
      "Time_Start": 2191.32,
      "Time_End": 2202.32,
      "Text": " And in that, when you're doing scrubbing or raking, you're putting a light tension on the plug and scrubbing the pins back and forth with your rake tool."
    },
    {
      "Time_Start": 2202.32,
      "Time_End": 2214.32,
      "Text": " And that activity, if you're doing it active enough, will get all or very many of the pins stuck and you can open the lock."
    },
    {
      "Time_Start": 2214.32,
      "Time_End": 2223.32,
      "Text": " On some better locks that have better tolerances on them, you may have to go in and pick the lock pin by pin."
    },
    {
      "Time_Start": 2223.32,
      "Time_End": 2229.32,
      "Text": " And in that case, you'd use like a half diamond shape tool or a hook shaped tool."
    },
    {
      "Time_Start": 2229.32,
      "Time_End": 2237.32,
      "Text": " And you'd actually go in, put some tension on the plug, and feel for the pins, and then push them up one by one until you can get it open."
    },
    {
      "Time_Start": 2237.32,
      "Time_End": 2246.32,
      "Text": " Down here is your torsion wrench, which goes into the keyway, and that's what you're using to put tension on the plug."
    },
    {
      "Time_Start": 2250.32,
      "Time_End": 2253.32,
      "Text": " So that's kind of an outline of the mechanics."
    },
    {
      "Time_Start": 2253.32,
      "Time_End": 2258.32,
      "Text": " And Steve, why don't you go ahead and elaborate."
    },
    {
      "Time_Start": 2260.32,
      "Time_End": 2264.32,
      "Text": " I'm not really clear as far as tension in what manner."
    },
    {
      "Time_Start": 2264.32,
      "Time_End": 2265.32,
      "Text": " He's about to explain that."
    },
    {
      "Time_Start": 2265.32,
      "Time_End": 2266.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 2266.32,
      "Time_End": 2269.32,
      "Text": " That's kind of what I'm trying to understand."
    },
    {
      "Time_Start": 2269.32,
      "Time_End": 2284.32,
      "Text": " Okay, well, the standard way that many of us have used to describe picking locks is that of a door with three doorknobs, or four doorknobs, or some number of doorknobs more than you have hands."
    },
    {
      "Time_Start": 2285.32,
      "Time_End": 2291.32,
      "Text": " The way I usually describe it is you're standing naked in front of a door."
    },
    {
      "Time_Start": 2291.32,
      "Time_End": 2297.32,
      "Text": " The door can open towards you or away from you."
    },
    {
      "Time_Start": 2297.32,
      "Time_End": 2303.32,
      "Text": " If it opens towards you, you are allowed to touch one knob at a time."
    },
    {
      "Time_Start": 2303.32,
      "Time_End": 2305.32,
      "Text": " No, two knobs at a time. Sorry."
    },
    {
      "Time_Start": 2305.32,
      "Time_End": 2309.32,
      "Text": " If it opens away from you, you are allowed to touch one knob at a time."
    },
    {
      "Time_Start": 2309.32,
      "Time_End": 2311.32,
      "Text": " How do you open the door?"
    },
    {
      "Time_Start": 2311.32,
      "Time_End": 2319.32,
      "Text": " Now, this will be your standard door where you turn the knob, it retracts the bolt, and the screen saver goes off."
    },
    {
      "Time_Start": 2319.32,
      "Time_End": 2326.32,
      "Text": " You'll turn the knob and retract the bolt. If you let go of the knob, the bolt extends again."
    },
    {
      "Time_Start": 2326.32,
      "Time_End": 2329.32,
      "Text": " So the question is, how do you open the door?"
    },
    {
      "Time_Start": 2329.32,
      "Time_End": 2331.32,
      "Text": " Do we have any guesses?"
    },
    {
      "Time_Start": 2331.32,
      "Time_End": 2333.32,
      "Text": " Over here."
    },
    {
      "Time_Start": 2333.32,
      "Time_End": 2338.32,
      "Text": " Push the door to try and get it so the bolt doesn't line up with the door."
    },
    {
      "Time_Start": 2338.32,
      "Time_End": 2340.32,
      "Text": " Exactly. And then you do what?"
    },
    {
      "Time_Start": 2340.32,
      "Time_End": 2348.32,
      "Text": " And then you open this one, push it so it won't line up, you put pressure on the door, and so on, right?"
    },
    {
      "Time_Start": 2348.32,
      "Time_End": 2349.32,
      "Text": " Correct. Did everyone hear that?"
    },
    {
      "Time_Start": 2349.32,
      "Time_End": 2350.32,
      "Text": " No."
    },
    {
      "Time_Start": 2350.32,
      "Time_End": 2351.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 2351.32,
      "Time_End": 2353.32,
      "Text": " Give the guy with the hair wrap a hand."
    },
    {
      "Time_Start": 2353.32,
      "Time_End": 2357.32,
      "Text": " Come on up here."
    },
    {
      "Time_Start": 2357.32,
      "Time_End": 2373.32,
      "Text": " Okay. What he described is that you push on the door, and you try each knob, and you see which one retracts but doesn't actually, when you're pushing it, re-extend fully."
    },
    {
      "Time_Start": 2373.32,
      "Time_End": 2378.32,
      "Text": " And then when you've done that, you go to the next knob and try the same thing."
    },
    {
      "Time_Start": 2378.32,
      "Time_End": 2390.32,
      "Text": " And basically by iterating through all of the knobs, you're playing on the inefficiencies between the bolt matching up to the hole."
    },
    {
      "Time_Start": 2390.32,
      "Time_End": 2392.32,
      "Text": " With the plug, yes."
    },
    {
      "Time_Start": 2392.32,
      "Time_End": 2400.32,
      "Text": " So you'll be rotating the plug, and you're going to be searching for the first pin that is binding as you're applying pressure and rotating."
    },
    {
      "Time_Start": 2400.32,
      "Time_End": 2403.32,
      "Text": " Do you have any..."
    },
    {
      "Time_Start": 2403.32,
      "Time_End": 2407.32,
      "Text": " Actually, if we could go back to the picture of the plug over here."
    },
    {
      "Time_Start": 2407.32,
      "Time_End": 2413.32,
      "Text": " Sadly, we only have one projector."
    },
    {
      "Time_Start": 2413.32,
      "Time_End": 2415.32,
      "Text": " By applying tension..."
    },
    {
      "Time_Start": 2415.32,
      "Time_End": 2416.32,
      "Text": " Can you hear it?"
    },
    {
      "Time_Start": 2416.32,
      "Time_End": 2420.32,
      "Text": " No, you're feeling it."
    },
    {
      "Time_Start": 2420.32,
      "Time_End": 2427.32,
      "Text": " This will take a moment because this is a very slow laptop."
    },
    {
      "Time_Start": 2427.32,
      "Time_End": 2434.32,
      "Text": " You went one word at a time, didn't you?"
    },
    {
      "Time_Start": 2434.32,
      "Time_End": 2442.32,
      "Text": " It was tempested off of somebody else's machine."
    },
    {
      "Time_Start": 2442.32,
      "Time_End": 2454.32,
      "Text": " So what you're doing when you're picking is you're applying tension, and then you're inserting the pick, and you're feeling each pin and lifting it up."
    },
    {
      "Time_Start": 2454.32,
      "Time_End": 2460.32,
      "Text": " And one of them will be binding and will be a lot stiffer than all of the others."
    },
    {
      "Time_Start": 2460.32,
      "Time_End": 2466.32,
      "Text": " And so you're lifting that up until it's no longer stiff, and you have now raised it above the shear line."
    },
    {
      "Time_Start": 2466.32,
      "Time_End": 2468.32,
      "Text": " And it will cock just a little bit."
    },
    {
      "Time_Start": 2468.32,
      "Time_End": 2473.32,
      "Text": " You probably, when you're very early on learning to do this, won't even notice it's cocking."
    },
    {
      "Time_Start": 2473.32,
      "Time_End": 2479.32,
      "Text": " And that will move it just a little bit forward, and then you're moving to the next pin."
    },
    {
      "Time_Start": 2479.32,
      "Time_End": 2486.32,
      "Text": " Because you already picked one pin, you'll go and you'll do this for four pins, five pins, six pins."
    },
    {
      "Time_Start": 2486.32,
      "Time_End": 2489.32,
      "Text": " And when you get to the last pin, the lock will open."
    },
    {
      "Time_Start": 2489.32,
      "Time_End": 2491.32,
      "Text": " So we had a question back here?"
    },
    {
      "Time_Start": 2491.32,
      "Time_End": 2494.32,
      "Text": " About how many pins does the average lock have?"
    },
    {
      "Time_Start": 2494.32,
      "Time_End": 2495.32,
      "Text": " About how many?"
    },
    {
      "Time_Start": 2495.32,
      "Time_End": 2497.32,
      "Text": " How many pins does the average lock have?"
    },
    {
      "Time_Start": 2497.32,
      "Time_End": 2499.32,
      "Text": " It depends on the lock."
    },
    {
      "Time_Start": 2499.32,
      "Time_End": 2507.32,
      "Text": " Your standard master, we don't actually have any of them here, your standard master lock with a little blue band around it usually has four pins."
    },
    {
      "Time_Start": 2507.32,
      "Time_End": 2515.32,
      "Text": " A lot of door locks to, say, your house or your apartment will have five or six pins."
    },
    {
      "Time_Start": 2516.32,
      "Time_End": 2519.32,
      "Text": " In fact, most office locks will have six."
    },
    {
      "Time_Start": 2519.32,
      "Time_End": 2528.32,
      "Text": " A lot of universities will use a multi-key system for masters, grandmasters, great grandmasters, etc."
    },
    {
      "Time_Start": 2528.32,
      "Time_End": 2530.32,
      "Text": " Many of those will have seven pins."
    },
    {
      "Time_Start": 2530.32,
      "Time_End": 2534.32,
      "Text": " So it really depends on where you're at, etc."
    },
    {
      "Time_Start": 2534.32,
      "Time_End": 2540.32,
      "Text": " One of the things that you frequently should do early on is go in there with your pick and feel."
    },
    {
      "Time_Start": 2540.32,
      "Time_End": 2543.32,
      "Text": " You should be able to feel and count how many pins you have."
    },
    {
      "Time_Start": 2544.32,
      "Time_End": 2546.32,
      "Text": " We had another question over here?"
    },
    {
      "Time_Start": 2546.32,
      "Time_End": 2552.32,
      "Text": " The hardest part of picking a lock is figuring out which pin is going to bind first."
    },
    {
      "Time_Start": 2552.32,
      "Time_End": 2555.32,
      "Text": " I can't assume it's always going to be the one up front."
    },
    {
      "Time_Start": 2555.32,
      "Time_End": 2556.32,
      "Text": " That is correct."
    },
    {
      "Time_Start": 2556.32,
      "Time_End": 2561.32,
      "Text": " The comment was, one of the hardest parts about picking a lock is finding which binds first."
    },
    {
      "Time_Start": 2561.32,
      "Time_End": 2563.32,
      "Text": " And you can't assume it's going to be the one up front."
    },
    {
      "Time_Start": 2563.32,
      "Time_End": 2565.32,
      "Text": " That is correct."
    },
    {
      "Time_Start": 2565.32,
      "Time_End": 2576.32,
      "Text": " And, in fact, one of the things that makes certain types of locks very difficult is when the one that binds first is the rearmost pin."
    },
    {
      "Time_Start": 2576.32,
      "Time_End": 2578.32,
      "Text": " And it binds very, very high up."
    },
    {
      "Time_Start": 2578.32,
      "Time_End": 2580.32,
      "Text": " You have to lift the pin very high."
    },
    {
      "Time_Start": 2580.32,
      "Time_End": 2590.32,
      "Text": " Which means that you have to get all the way to the rear of the lock, lift up the pin, and do so without binding anything in front or causing any problems in front."
    },
    {
      "Time_Start": 2590.32,
      "Time_End": 2593.32,
      "Text": " Steve, I'd like to add another thing there."
    },
    {
      "Time_Start": 2593.32,
      "Time_End": 2601.32,
      "Text": " In multiple pin type of locks, I've come across some that you had to start with the second to the last pin,"
    },
    {
      "Time_Start": 2601.32,
      "Time_End": 2607.32,
      "Text": " and then move over to the front and hit the first pin, and then go back down, skip two and hit one, and then move it that way."
    },
    {
      "Time_Start": 2607.32,
      "Time_End": 2611.32,
      "Text": " Those are a bitch to get through."
    },
    {
      "Time_Start": 2611.32,
      "Time_End": 2621.32,
      "Text": " The average time for a locksmith, someone who is a licensed locksmith, to actually get through locks can be up to 25 minutes on a lock they've never used before."
    },
    {
      "Time_Start": 2621.32,
      "Time_End": 2626.32,
      "Text": " So when you're playing with locks and you get used to your lock, that rocks."
    },
    {
      "Time_Start": 2626.32,
      "Time_End": 2629.32,
      "Text": " I mean, you're going to get through it in a matter of seconds and so forth."
    },
    {
      "Time_Start": 2629.32,
      "Time_End": 2635.32,
      "Text": " But when you come across a lock you haven't used, and this is so you don't get discouraged if you want to go play,"
    },
    {
      "Time_Start": 2635.32,
      "Time_End": 2644.32,
      "Text": " the first time you try to hit a new lock, it could take you 25 minutes, it could take you 30 minutes, it could take you a couple days before you figure out what it takes to open up that lock."
    },
    {
      "Time_Start": 2644.32,
      "Time_End": 2646.32,
      "Text": " Don't be discouraged. Keep trying."
    },
    {
      "Time_Start": 2646.32,
      "Time_End": 2648.32,
      "Text": " I agree."
    },
    {
      "Time_Start": 2648.32,
      "Time_End": 2655.32,
      "Text": " One of the things I will recommend is if you know somebody that picks locks, have them check it out first and make sure that there's nothing funny in there,"
    },
    {
      "Time_Start": 2655.32,
      "Time_End": 2659.32,
      "Text": " because there are a couple things that can make your life more difficult in picking the lock."
    },
    {
      "Time_Start": 2659.32,
      "Time_End": 2664.32,
      "Text": " And you want to start with something simple. Start with a 4-pin or a 5-pin and work your way up."
    },
    {
      "Time_Start": 2664.32,
      "Time_End": 2667.32,
      "Text": " Graphite powder. Get graphite powder."
    },
    {
      "Time_Start": 2671.32,
      "Time_End": 2674.32,
      "Text": " Just another comment. Think about the door problem again."
    },
    {
      "Time_Start": 2674.32,
      "Time_End": 2682.32,
      "Text": " If it opens away from you and you're pushing really hard on it, you will be able to feel which knob is stiff because its latch has got a lot of pressure on it."
    },
    {
      "Time_Start": 2682.32,
      "Time_End": 2686.32,
      "Text": " In the door hardware industry, it's actually called preload."
    },
    {
      "Time_Start": 2686.32,
      "Time_End": 2690.32,
      "Text": " And when you're thinking about electric strikes that have to open under those conditions,"
    },
    {
      "Time_Start": 2690.32,
      "Time_End": 2693.32,
      "Text": " if somebody's pushing really hard on the door and you've got like a fire safety situation,"
    },
    {
      "Time_Start": 2693.32,
      "Time_End": 2698.32,
      "Text": " it has to still open under a certain amount of preload to be rated."
    },
    {
      "Time_Start": 2699.32,
      "Time_End": 2703.32,
      "Text": " A bent screwdriver."
    },
    {
      "Time_Start": 2707.32,
      "Time_End": 2708.32,
      "Text": " Tension wrench."
    },
    {
      "Time_Start": 2708.32,
      "Time_End": 2715.32,
      "Text": " This is your same piece of street cleaner bristle, earlier, with a little bit of a bend in the end."
    },
    {
      "Time_Start": 2715.32,
      "Time_End": 2720.32,
      "Text": " And you use this, inserting it into the keyway, and rotate."
    },
    {
      "Time_Start": 2720.32,
      "Time_End": 2725.32,
      "Text": " Something that Virus had mentioned earlier, graphite lubricant."
    },
    {
      "Time_Start": 2725.32,
      "Time_End": 2730.32,
      "Text": " Graphite lubricant. Lubrication makes your life so much better."
    },
    {
      "Time_Start": 2732.32,
      "Time_End": 2734.32,
      "Text": " For use with locks only."
    },
    {
      "Time_Start": 2734.32,
      "Time_End": 2736.32,
      "Text": " Yeah, for use with locks only."
    },
    {
      "Time_Start": 2736.32,
      "Time_End": 2743.32,
      "Text": " And a very serious thing, when you feel that you need to lubricate a lock, use graphite lubricant."
    },
    {
      "Time_Start": 2743.32,
      "Time_End": 2747.32,
      "Text": " Don't use WD-40. Don't use any sort of oil."
    },
    {
      "Time_Start": 2747.32,
      "Time_End": 2751.32,
      "Text": " Because if they've used graphite lubricant in there in the past or after that,"
    },
    {
      "Time_Start": 2751.32,
      "Time_End": 2755.32,
      "Text": " it'll go in there, it'll mix with the WD-40, it'll gum up the lock, you'll never get it open."
    },
    {
      "Time_Start": 2757.32,
      "Time_End": 2762.32,
      "Text": " Basically, you can use WD-40, and it will work,"
    },
    {
      "Time_Start": 2762.32,
      "Time_End": 2768.32,
      "Text": " but basically the locksmithing industry has settled on graphite lubricant, it's better,"
    },
    {
      "Time_Start": 2768.32,
      "Time_End": 2771.32,
      "Text": " and if everybody just sticks with graphite lubricant, then you don't have a problem."
    },
    {
      "Time_Start": 2771.32,
      "Time_End": 2776.32,
      "Text": " If you start putting WD-40 in there, it solidifies, life sucks."
    },
    {
      "Time_Start": 2776.32,
      "Time_End": 2779.32,
      "Text": " Yeah, they encourage it to the guy who has to take the lock out."
    },
    {
      "Time_Start": 2779.32,
      "Time_End": 2780.32,
      "Text": " Exactly."
    },
    {
      "Time_Start": 2780.32,
      "Time_End": 2782.32,
      "Text": " Think of it as Unix for locks."
    },
    {
      "Time_Start": 2783.32,
      "Time_End": 2784.32,
      "Text": " It's better."
    },
    {
      "Time_Start": 2784.32,
      "Time_End": 2785.32,
      "Text": " It's better."
    },
    {
      "Time_Start": 2785.32,
      "Time_End": 2787.32,
      "Text": " There's a question back there."
    },
    {
      "Time_Start": 2787.32,
      "Time_End": 2788.32,
      "Text": " Ah, I'm sorry."
    },
    {
      "Time_Start": 2788.32,
      "Time_End": 2789.32,
      "Text": " Will an Allen wrench work?"
    },
    {
      "Time_Start": 2789.32,
      "Time_End": 2792.32,
      "Text": " Will an Allen wrench work? Yes, an Allen wrench will work."
    },
    {
      "Time_Start": 2792.32,
      "Time_End": 2796.32,
      "Text": " You'll, in most cases, have to flatten the sides of it a little bit."
    },
    {
      "Time_Start": 2796.32,
      "Time_End": 2799.32,
      "Text": " The problem with most Allen wrenches is they'll get too brittle."
    },
    {
      "Time_Start": 2799.32,
      "Time_End": 2804.32,
      "Text": " And so at some point you'll be applying tension, and it'll snap."
    },
    {
      "Time_Start": 2804.32,
      "Time_End": 2814.32,
      "Text": " One of the other things that is largely a style issue is the street cleaner bristle has a little bit of flex to it,"
    },
    {
      "Time_Start": 2814.32,
      "Time_End": 2818.32,
      "Text": " and that will absorb, most people tend to over-torque,"
    },
    {
      "Time_Start": 2818.32,
      "Time_End": 2822.32,
      "Text": " and just apply too much pressure with the tension wrench."
    },
    {
      "Time_Start": 2822.32,
      "Time_End": 2827.32,
      "Text": " And so this is very good at absorbing some of your torque."
    },
    {
      "Time_Start": 2827.32,
      "Time_End": 2830.32,
      "Text": " If you're using something like an Allen wrench, it has no give."
    },
    {
      "Time_Start": 2831.32,
      "Time_End": 2836.32,
      "Text": " Hobbit uses a bent nail that he bent 20-some years ago."
    },
    {
      "Time_Start": 2836.32,
      "Time_End": 2840.32,
      "Text": " And it works very, very well, but it's absolutely firm,"
    },
    {
      "Time_Start": 2840.32,
      "Time_End": 2844.32,
      "Text": " and so you have to be very careful about how much tension you're applying."
    },
    {
      "Time_Start": 2844.32,
      "Time_End": 2853.32,
      "Text": " Yeah, even some of the commercial tension wrenches will have a 90-degree twist on it to actually give you even more flex."
    },
    {
      "Time_Start": 2853.32,
      "Time_End": 2855.32,
      "Text": " Yeah, there are some with 90-degree twists."
    },
    {
      "Time_Start": 2855.32,
      "Time_End": 2862.32,
      "Text": " There are some with a little spring, basically midway down here, that will absorb some of the force."
    },
    {
      "Time_Start": 2862.32,
      "Time_End": 2870.32,
      "Text": " None of us are affiliated with Loon Panics, so this is not a plug,"
    },
    {
      "Time_Start": 2870.32,
      "Time_End": 2875.32,
      "Text": " but if you check out the Loon Panic books, they have pictures of lots of different things in there,"
    },
    {
      "Time_Start": 2875.32,
      "Time_End": 2877.32,
      "Text": " and it's good to thumb through and see what they have."
    },
    {
      "Time_Start": 2877.32,
      "Time_End": 2879.32,
      "Text": " Wait, I have a comment."
    },
    {
      "Time_Start": 2880.32,
      "Time_End": 2882.32,
      "Text": " For those of you who are interested and really get into lockpickings,"
    },
    {
      "Time_Start": 2882.32,
      "Time_End": 2885.32,
      "Text": " you can pick up picks fairly inexpensive."
    },
    {
      "Time_Start": 2885.32,
      "Time_End": 2886.32,
      "Text": " They're not a very expensive model."
    },
    {
      "Time_Start": 2886.32,
      "Time_End": 2892.32,
      "Text": " You will notice when you buy your first set of lockpicks that there's several duplicates of your picks,"
    },
    {
      "Time_Start": 2892.32,
      "Time_End": 2895.32,
      "Text": " and you're going to ask, why do I have duplicates of picks?"
    },
    {
      "Time_Start": 2895.32,
      "Time_End": 2897.32,
      "Text": " Because picks break."
    },
    {
      "Time_Start": 2897.32,
      "Time_End": 2900.32,
      "Text": " So you will find, especially with tension wrenches,"
    },
    {
      "Time_Start": 2900.32,
      "Time_End": 2904.32,
      "Text": " until you actually start to get an idea on how much pressure to put down,"
    },
    {
      "Time_Start": 2904.32,
      "Time_End": 2906.32,
      "Text": " you're going to be breaking tension wrenches."
    },
    {
      "Time_Start": 2906.32,
      "Time_End": 2909.32,
      "Text": " Buy yourself a cheap set, learn on that, then buy them."
    },
    {
      "Time_Start": 2909.32,
      "Time_End": 2916.32,
      "Text": " I've seen prices on full lock sets that have like 60 pieces up to $800 for the set, and then some."
    },
    {
      "Time_Start": 2916.32,
      "Time_End": 2922.32,
      "Text": " So start small, get a cheap set, and get used to replacing the tension wrenches."
    },
    {
      "Time_Start": 2922.32,
      "Time_End": 2925.32,
      "Text": " There was a question way back there with the guy in the black shirt."
    },
    {
      "Time_Start": 2926.32,
      "Time_End": 2930.32,
      "Text": " I don't know what you're saying, but from a beginner's perspective,"
    },
    {
      "Time_Start": 2930.32,
      "Time_End": 2939.32,
      "Text": " is there like a random lock that has more tolerance than others that might be better?"
    },
    {
      "Time_Start": 2939.32,
      "Time_End": 2941.32,
      "Text": " Quick set is great."
    },
    {
      "Time_Start": 2941.32,
      "Time_End": 2945.32,
      "Text": " There's actually an interesting aspect to that question."
    },
    {
      "Time_Start": 2945.32,
      "Time_End": 2954.32,
      "Text": " The question was, for the beginner, is there a particular lock that has a set of tolerances that are useful for the beginner?"
    },
    {
      "Time_Start": 2954.32,
      "Time_End": 2956.32,
      "Text": " Making it a little bit easier."
    },
    {
      "Time_Start": 2956.32,
      "Time_End": 2961.32,
      "Text": " Quick set is very, very good in that realm, in that they're pretty generic,"
    },
    {
      "Time_Start": 2961.32,
      "Time_End": 2964.32,
      "Text": " they're nothing fancy, they're not real high quality machining,"
    },
    {
      "Time_Start": 2964.32,
      "Time_End": 2967.32,
      "Text": " and usually they're pretty easy to get through."
    },
    {
      "Time_Start": 2967.32,
      "Time_End": 2974.32,
      "Text": " The master padlock, standard master padlock, you've all seen them, laminated sorts of things,"
    },
    {
      "Time_Start": 2974.32,
      "Time_End": 2980.32,
      "Text": " are very, very low tolerances to the point of being incredibly difficult sometimes."
    },
    {
      "Time_Start": 2980.32,
      "Time_End": 2984.32,
      "Text": " And there have been numerous situations where people who are very good at picking locks"
    },
    {
      "Time_Start": 2984.32,
      "Time_End": 2990.32,
      "Text": " will get hung up on a master padlock just because it's such crap."
    },
    {
      "Time_Start": 2990.32,
      "Time_End": 2994.32,
      "Text": " You know, you're picking it, expecting to feel certain things,"
    },
    {
      "Time_Start": 2994.32,
      "Time_End": 3000.32,
      "Text": " and you're feeling them not because they're there, but because it's just not put together terribly well."
    },
    {
      "Time_Start": 3000.32,
      "Time_End": 3004.32,
      "Text": " What about the set of locks that you find on a passenger machine or an elevator,"
    },
    {
      "Time_Start": 3004.32,
      "Time_End": 3007.32,
      "Text": " or a permanent lock that might have a round piece?"
    },
    {
      "Time_Start": 3007.32,
      "Time_End": 3010.32,
      "Text": " All right, I've got the answer for that."
    },
    {
      "Time_Start": 3010.32,
      "Time_End": 3015.32,
      "Text": " They have what they call set keys for the round barrel locks."
    },
    {
      "Time_Start": 3015.32,
      "Time_End": 3017.32,
      "Text": " They're actually called barrel locks."
    },
    {
      "Time_Start": 3017.32,
      "Time_End": 3021.32,
      "Text": " And what this key is, is you place it in there and you apply pressure."
    },
    {
      "Time_Start": 3021.32,
      "Time_End": 3029.32,
      "Text": " And what they do is, the pins on these special keys for picking these are very stiff,"
    },
    {
      "Time_Start": 3029.32,
      "Time_End": 3032.32,
      "Text": " and it pushes them back. You actually have to add a lot of pressure."
    },
    {
      "Time_Start": 3032.32,
      "Time_End": 3037.32,
      "Text": " And then you pull it out, and now you have a perfect key for that specific machine"
    },
    {
      "Time_Start": 3037.32,
      "Time_End": 3040.32,
      "Text": " or whatever type of tumbler you're trying to open up."
    },
    {
      "Time_Start": 3040.32,
      "Time_End": 3044.32,
      "Text": " And it'll stay that way. And then you can actually reset it to use it later."
    },
    {
      "Time_Start": 3044.32,
      "Time_End": 3048.32,
      "Text": " Now, here's the drawback. If you need to use it on several machines, it's going to take you a while."
    },
    {
      "Time_Start": 3048.32,
      "Time_End": 3052.32,
      "Text": " Drawback number two, they're about $300 to $400 each."
    },
    {
      "Time_Start": 3052.32,
      "Time_End": 3053.32,
      "Text": " Nah."
    },
    {
      "Time_Start": 3053.32,
      "Time_End": 3057.32,
      "Text": " The last time I saw them, they were about $300 to $400 a piece."
    },
    {
      "Time_Start": 3057.32,
      "Time_End": 3061.32,
      "Text": " I haven't seen them any cheaper. If you know where I can get them for like $50, I'm so there."
    },
    {
      "Time_Start": 3061.32,
      "Time_End": 3062.32,
      "Text": " We'll talk later."
    },
    {
      "Time_Start": 3062.32,
      "Time_End": 3063.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 3063.32,
      "Time_End": 3066.32,
      "Text": " You can find them for about $50."
    },
    {
      "Time_Start": 3066.32,
      "Time_End": 3072.32,
      "Text": " One of the problems is that there are several different styles, left offset, right offset."
    },
    {
      "Time_Start": 3072.32,
      "Time_End": 3075.32,
      "Text": " I think there are two separate diameters, if I recall."
    },
    {
      "Time_Start": 3075.32,
      "Time_End": 3078.32,
      "Text": " The one that I saw will fit them all."
    },
    {
      "Time_Start": 3078.32,
      "Time_End": 3079.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 3079.32,
      "Time_End": 3081.32,
      "Text": " It was $400, and it was really nice."
    },
    {
      "Time_Start": 3081.32,
      "Time_End": 3082.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 3082.32,
      "Time_End": 3084.32,
      "Text": " I don't like it, because I'm not getting $400 for it."
    },
    {
      "Time_Start": 3084.32,
      "Time_End": 3088.32,
      "Text": " I've bought, in my life, two of the $50 ones."
    },
    {
      "Time_Start": 3088.32,
      "Time_End": 3093.32,
      "Text": " And they're both about that big and relatively small and will fit in your pocket."
    },
    {
      "Time_Start": 3093.32,
      "Time_End": 3094.32,
      "Text": " And I've lost both of them."
    },
    {
      "Time_Start": 3094.32,
      "Time_End": 3096.32,
      "Text": " So, it's kind of a pain in the butt."
    },
    {
      "Time_Start": 3107.32,
      "Time_End": 3108.32,
      "Text": " Well, okay."
    },
    {
      "Time_Start": 3108.32,
      "Time_End": 3113.32,
      "Text": " In a payphone, a payphone tends to use a different style of lock called a lever lock."
    },
    {
      "Time_Start": 3114.32,
      "Time_End": 3116.32,
      "Text": " Like a washing machine?"
    },
    {
      "Time_Start": 3116.32,
      "Time_End": 3118.32,
      "Text": " A washing machine, maybe."
    },
    {
      "Time_Start": 3120.32,
      "Time_End": 3121.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3121.32,
      "Time_End": 3138.32,
      "Text": " Actually, a lot of the washing machine locks that I see are actually called Abloys, which are very big in the UK and Europe and basically everywhere but here, except in those cases."
    },
    {
      "Time_Start": 3138.32,
      "Time_End": 3142.32,
      "Text": " And they're another entirely different style of lock and very difficult to pick."
    },
    {
      "Time_Start": 3143.32,
      "Time_End": 3149.32,
      "Text": " So, just a few more comments on equipment."
    },
    {
      "Time_Start": 3149.32,
      "Time_End": 3155.32,
      "Text": " What we've described is for getting through the standard 4, 5, 6 pin lock."
    },
    {
      "Time_Start": 3155.32,
      "Time_End": 3160.32,
      "Text": " It usually comes down to, we had the diagram up of the two or three different styles of picks."
    },
    {
      "Time_Start": 3160.32,
      "Time_End": 3167.32,
      "Text": " If you buy a pick kit, a lot of times the pick kits will have, you know, 75 different picks."
    },
    {
      "Time_Start": 3167.32,
      "Time_End": 3169.32,
      "Text": " You only really need two."
    },
    {
      "Time_Start": 3169.32,
      "Time_End": 3172.32,
      "Text": " You need one that's a hook on the end and you need one that's a little bit wavy."
    },
    {
      "Time_Start": 3172.32,
      "Time_End": 3175.32,
      "Text": " Some people like to have one that's a diamond point."
    },
    {
      "Time_Start": 3175.32,
      "Time_End": 3179.32,
      "Text": " All of the other ones just really aren't worth it, in my opinion."
    },
    {
      "Time_Start": 3181.32,
      "Time_End": 3186.32,
      "Text": " Sometimes they will address that one particular lock and get you through it."
    },
    {
      "Time_Start": 3186.32,
      "Time_End": 3192.32,
      "Text": " But in the end, you should be able to do everything with those two picks and one or two different styles of tension wrenches."
    },
    {
      "Time_Start": 3192.32,
      "Time_End": 3193.32,
      "Text": " Yes, sir?"
    },
    {
      "Time_Start": 3196.32,
      "Time_End": 3198.32,
      "Text": " Very briefly about Medeco locks."
    },
    {
      "Time_Start": 3198.32,
      "Time_End": 3206.32,
      "Text": " What we've described with a normal, yeah, we're talking about doing an advanced talk next year."
    },
    {
      "Time_Start": 3206.32,
      "Time_End": 3208.32,
      "Text": " So, we'll possibly go into that a little bit more."
    },
    {
      "Time_Start": 3208.32,
      "Time_End": 3214.32,
      "Text": " What the Medeco does is with your standard lock, you want to raise the pin to the correct height."
    },
    {
      "Time_Start": 3214.32,
      "Time_End": 3220.32,
      "Text": " With the Medeco, you have to raise it to the correct height and rotate it to the correct rotation."
    },
    {
      "Time_Start": 3220.32,
      "Time_End": 3225.32,
      "Text": " And so, actually picking it takes a little more practice and a little more skill."
    },
    {
      "Time_Start": 3226.32,
      "Time_End": 3228.32,
      "Text": " It isn't within the scope of this talk."
    },
    {
      "Time_Start": 3229.32,
      "Time_End": 3233.32,
      "Text": " We are actually talking, I've been talking to Hobbit and everybody here about"
    },
    {
      "Time_Start": 3233.32,
      "Time_End": 3236.32,
      "Text": " we're going to put together an advanced lock picking thing,"
    },
    {
      "Time_Start": 3236.32,
      "Time_End": 3239.32,
      "Text": " going into the more difficult and the more advanced type of locks."
    },
    {
      "Time_Start": 3239.32,
      "Time_End": 3245.32,
      "Text": " And hopefully, depending on all of our tying friends, we may actually present that next year at DEF CON."
    },
    {
      "Time_Start": 3245.32,
      "Time_End": 3250.32,
      "Text": " Oh, by the way, I'm hoping to actually have my sponsorship set up for next year's DEF CON."
    },
    {
      "Time_Start": 3250.32,
      "Time_End": 3257.32,
      "Text": " I found a group of people who had actually sponsored this lock picking talk."
    },
    {
      "Time_Start": 3257.32,
      "Time_End": 3263.32,
      "Text": " And they offered to give me a box of full sets of lock picks for me to give out."
    },
    {
      "Time_Start": 3263.32,
      "Time_End": 3266.32,
      "Text": " Plus, raffle off a couple night vision goggles."
    },
    {
      "Time_Start": 3266.32,
      "Time_End": 3270.32,
      "Text": " So, if I can get the sponsorships, keep your fingers crossed, people."
    },
    {
      "Time_Start": 3270.32,
      "Time_End": 3272.32,
      "Text": " This talk is going to rock next year."
    },
    {
      "Time_Start": 3272.32,
      "Time_End": 3275.32,
      "Text": " And the instructors should get night vision goggles too."
    },
    {
      "Time_Start": 3275.32,
      "Time_End": 3276.32,
      "Text": " Yeah, I think so too."
    },
    {
      "Time_Start": 3276.32,
      "Time_End": 3279.32,
      "Text": " Yeah, I've already got my set, but that's all right."
    },
    {
      "Time_Start": 3279.32,
      "Time_End": 3282.32,
      "Text": " They were talking about giving me about 200 sets of picks."
    },
    {
      "Time_Start": 3282.32,
      "Time_End": 3285.32,
      "Text": " I mean, these were nice, about $35 sets."
    },
    {
      "Time_Start": 3285.32,
      "Time_End": 3291.32,
      "Text": " Now, just as a side note, you shouldn't actually need night vision goggles to go through locks."
    },
    {
      "Time_Start": 3291.32,
      "Time_End": 3293.32,
      "Text": " You should be able to do it all by feel."
    },
    {
      "Time_Start": 3294.32,
      "Time_End": 3296.32,
      "Text": " These are the different style of locks."
    },
    {
      "Time_Start": 3296.32,
      "Time_End": 3301.32,
      "Text": " You have the hook shaped, the diamond, and the rake."
    },
    {
      "Time_Start": 3302.32,
      "Time_End": 3305.32,
      "Text": " It's a little more stylized using..."
    },
    {
      "Time_Start": 3306.32,
      "Time_End": 3308.32,
      "Text": " It's my job to press the button."
    },
    {
      "Time_Start": 3309.32,
      "Time_End": 3312.32,
      "Text": " Using common geographic figures."
    },
    {
      "Time_Start": 3312.32,
      "Time_End": 3314.32,
      "Text": " But that's basically what you're looking at."
    },
    {
      "Time_Start": 3314.32,
      "Time_End": 3319.32,
      "Text": " The wrench, frequently 90 degree, usually a little bit less than 90 degrees."
    },
    {
      "Time_Start": 3319.32,
      "Time_End": 3321.32,
      "Text": " So you can get it in there."
    },
    {
      "Time_Start": 3321.32,
      "Time_End": 3324.32,
      "Text": " And there will sometimes be different sort of waves."
    },
    {
      "Time_Start": 3324.32,
      "Time_End": 3329.32,
      "Text": " So if you have a doorknob with a lock in the handle recessed a bit, you can actually get it in there."
    },
    {
      "Time_Start": 3330.32,
      "Time_End": 3331.32,
      "Text": " I just wanted to talk..."
    },
    {
      "Time_Start": 3331.32,
      "Time_End": 3335.32,
      "Text": " This is a slide from the presentation that's posted on the door."
    },
    {
      "Time_Start": 3336.32,
      "Time_End": 3337.32,
      "Text": " I have more copies."
    },
    {
      "Time_Start": 3337.32,
      "Time_End": 3339.32,
      "Text": " I'll put them out on the table."
    },
    {
      "Time_Start": 3340.32,
      "Time_End": 3341.32,
      "Text": " It's also..."
    },
    {
      "Time_Start": 3341.32,
      "Time_End": 3343.32,
      "Text": " The URL is up on the door also."
    },
    {
      "Time_Start": 3344.32,
      "Time_End": 3346.32,
      "Text": " It's basically a self-study course."
    },
    {
      "Time_Start": 3347.32,
      "Time_End": 3360.32,
      "Text": " And it will take you from the really easy quick set pin tumbler locks through a padlock to a wafer style tumbler lock."
    },
    {
      "Time_Start": 3360.32,
      "Time_End": 3367.32,
      "Text": " And then to a Schlage pin tumbler which has a little bit better tolerances and is a little bit more difficult."
    },
    {
      "Time_Start": 3367.32,
      "Time_End": 3372.32,
      "Text": " There's also some worded locks there for extra credit."
    },
    {
      "Time_Start": 3372.32,
      "Time_End": 3376.32,
      "Text": " If you happen to have worded lock picks."
    },
    {
      "Time_Start": 3376.32,
      "Time_End": 3379.32,
      "Text": " The worded locks do take a different type of pick."
    },
    {
      "Time_Start": 3380.32,
      "Time_End": 3383.32,
      "Text": " We are running out of time so I'm going to take a couple questions."
    },
    {
      "Time_Start": 3384.32,
      "Time_End": 3385.32,
      "Text": " Do we have anyone after us?"
    },
    {
      "Time_Start": 3385.32,
      "Time_End": 3386.32,
      "Text": " Yeah."
    },
    {
      "Time_Start": 3386.32,
      "Time_End": 3387.32,
      "Text": " Okay."
    },
    {
      "Time_Start": 3387.32,
      "Time_End": 3388.32,
      "Text": " Pick guns?"
    },
    {
      "Time_Start": 3388.32,
      "Time_End": 3390.32,
      "Text": " We'll be around a little bit packing up here."
    },
    {
      "Time_Start": 3390.32,
      "Time_End": 3392.32,
      "Text": " If you have questions, come on up and ask."
    },
    {
      "Time_Start": 3393.32,
      "Time_End": 3395.32,
      "Text": " There will be people probably hanging out by the lock board."
    },
    {
      "Time_Start": 3396.32,
      "Time_End": 3398.32,
      "Text": " Please come and try and pick the locks."
    },
    {
      "Time_Start": 3399.32,
      "Time_End": 3400.32,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 3400.32,
      "Time_End": 3401.32,
      "Text": " Thank you guys."
    }
  ]
}