{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 19.56,
      "Text": "This text was transcribed using whisper model: large-v2\n\n For those of you who don't know me, let's just say, you can't hear me. I'm not loud"
    },
    {
      "Time_Start": 19.56,
      "Time_End": 27.240000000000002,
      "Text": " enough. You can't hear me. I'm not loud enough. Okay. Got it. That's the first time in my"
    },
    {
      "Time_Start": 27.240000000000002,
      "Time_End": 33.56,
      "Text": " life anybody's ever told me I wasn't loud. I've been screwing with computers for 23 years."
    },
    {
      "Time_Start": 33.56,
      "Time_End": 37.88,
      "Text": " I started with HP 3000, seven-column paper tape. I've programmed on punch cards. I've"
    },
    {
      "Time_Start": 37.88,
      "Time_End": 40.940000000000005,
      "Text": " done client server. I've done mainframes. I've done assembler and mainframes. I've done"
    },
    {
      "Time_Start": 40.940000000000005,
      "Time_End": 46.44,
      "Text": " assembler on PCs. I've been around a long time. The purpose of this talk, which is called"
    },
    {
      "Time_Start": 46.44,
      "Time_End": 55.68000000000001,
      "Text": " building a backdoor binary, my animated slide, is a step-by-step walkthrough of how to program"
    },
    {
      "Time_Start": 55.68,
      "Time_End": 60.5,
      "Text": " your way back into that box you just worked so hard to root. The motivation behind this"
    },
    {
      "Time_Start": 60.5,
      "Time_End": 65.36,
      "Text": " being I consider hacking to have essentially five steps. Figuring out what it is you want"
    },
    {
      "Time_Start": 65.36,
      "Time_End": 70.56,
      "Text": " to get into. Figuring out how it is you're going to get into it. Actually doing the exploit."
    },
    {
      "Time_Start": 70.56,
      "Time_End": 75.44,
      "Text": " Number four, my most important point, cleaning up after yourself. And number five, making"
    },
    {
      "Time_Start": 75.44,
      "Time_End": 78.08,
      "Text": " sure that you don't have to go through steps one through four the next time you want to"
    },
    {
      "Time_Start": 78.08,
      "Time_End": 83.52,
      "Text": " get back in. This talk falls under number five. Namely, setting yourself up a way to"
    },
    {
      "Time_Start": 83.56,
      "Time_End": 89.64,
      "Text": " get into an allegedly secure system after you've already got back into it. So that essentially"
    },
    {
      "Time_Start": 89.64,
      "Time_End": 95.47999999999999,
      "Text": " you have access, which may or may not be legitimate at this point, but the end user base doesn't"
    },
    {
      "Time_Start": 95.47999999999999,
      "Time_End": 102.47999999999999,
      "Text": " think they've been owned. Okay? So this is featuring secure shell SSH.2.0.13. I know"
    },
    {
      "Time_Start": 103.16,
      "Time_End": 110.16,
      "Text": " 2.1 is out. I actually wrote this several months ago. I am working on a 2.1. And I'm"
    },
    {
      "Time_Start": 111.16,
      "Time_End": 118.16,
      "Text": " Wrangler. So the point here, the first point I want to make is that security, the heightened"
    },
    {
      "Time_Start": 118.92,
      "Time_End": 124.72,
      "Text": " level of security in the community has made it such that people are actually paying attention."
    },
    {
      "Time_Start": 124.72,
      "Time_End": 127.6,
      "Text": " They may not necessarily have a clue, but they're paying attention. So a lot of the"
    },
    {
      "Time_Start": 127.6,
      "Time_End": 130.76,
      "Text": " obvious stuff that you used to be able to use to get into things is gone. You're not"
    },
    {
      "Time_Start": 130.76,
      "Time_End": 134.16,
      "Text": " going to just tell it into somebody's machine with certain environment variables set and"
    },
    {
      "Time_Start": 134.16,
      "Time_End": 138.56,
      "Text": " boom, you're a root user, okay? People are actually, they know what Nmap is, they know"
    },
    {
      "Time_Start": 138.56,
      "Time_End": 143.56,
      "Text": " how to download it, they know how to run it. They may not do much more than that, but"
    },
    {
      "Time_Start": 143.56,
      "Time_End": 148.8,
      "Text": " you're not going to find the obvious ways into a system anymore. So if you want to get"
    },
    {
      "Time_Start": 148.8,
      "Time_End": 152.68,
      "Text": " into something, you actually have to pay attention. And I mean, other than just going to root"
    },
    {
      "Time_Start": 152.68,
      "Time_End": 157.96,
      "Text": " shell and downloading the latest exploit and running it and seeing if it works. Most of"
    },
    {
      "Time_Start": 157.96,
      "Time_End": 164.96,
      "Text": " the time, remote access has been turned off for non-essential services. You know? I mean,"
    },
    {
      "Time_Start": 164.96,
      "Time_End": 169.22,
      "Text": " you may find, you're going to find a lot of sun boxes with RPC turned on, okay? But"
    },
    {
      "Time_Start": 169.22,
      "Time_End": 176.22,
      "Text": " if, you know, a good star Nix box is going to have maybe FTP, probably FSH, definitely"
    },
    {
      "Time_Start": 181.0,
      "Time_End": 188.0,
      "Text": " not Telnet, maybe SMTP, maybe DNS, maybe web, and that's it, you know? And of course then"
    },
    {
      "Time_Start": 188.88,
      "Time_End": 195.8,
      "Text": " there's the NT world and we're not going there. So for the most part, what I'm trying to say"
    },
    {
      "Time_Start": 195.8,
      "Time_End": 199.84,
      "Text": " here is that secure shell has become the de facto remote access protocol in systems where"
    },
    {
      "Time_Start": 199.84,
      "Time_End": 203.2,
      "Text": " people are actually paying attention. And again, there are exceptions to this rule."
    },
    {
      "Time_Start": 203.2,
      "Time_End": 206.88,
      "Text": " There are Telnets out there. I've got a whole freaking web page of over 3,000 class Cs of"
    },
    {
      "Time_Start": 206.88,
      "Time_End": 213.88,
      "Text": " Telnets. But if you're going after a, shall we say a worthy target, the likelihood is"
    },
    {
      "Time_Start": 213.88,
      "Time_End": 218.4,
      "Text": " you're going to have to actually think a little to figure out how to bust in. So this"
    },
    {
      "Time_Start": 218.4,
      "Time_End": 221.76,
      "Text": " is a coding example. This is an example of something I actually sat down and did and"
    },
    {
      "Time_Start": 221.76,
      "Time_End": 227.64,
      "Text": " spent quite a long night doing. And I wanted to go through it in a methodical way and explain"
    },
    {
      "Time_Start": 227.64,
      "Time_End": 231.07999999999998,
      "Text": " some of the pitfalls because essentially when you think about, okay, backdooring SSH, you"
    },
    {
      "Time_Start": 231.07999999999998,
      "Time_End": 236.5,
      "Text": " would think it's a fairly trivial exercise. Go in and find some password and then say,"
    },
    {
      "Time_Start": 236.5,
      "Time_End": 240.72,
      "Text": " if my password, you know, is this, then branch around all the validation code and let me"
    },
    {
      "Time_Start": 240.72,
      "Time_End": 246.48,
      "Text": " in. It's not. Okay? So the first thing I'm going to cover is the design, which is understanding"
    },
    {
      "Time_Start": 246.48,
      "Time_End": 251.2,
      "Text": " the code and what you intend to accomplish with it. The next thing, coding, the factors"
    },
    {
      "Time_Start": 251.2,
      "Time_End": 254.52,
      "Text": " that you have to consider when you're modifying the source code, namely how to do it so that"
    },
    {
      "Time_Start": 254.52,
      "Time_End": 259.92,
      "Text": " you don't break it. Building, which is emulating the original as closely as possible. Just"
    },
    {
      "Time_Start": 259.92,
      "Time_End": 263.16,
      "Text": " because you can gain access doesn't mean the entire user community should be locked out."
    },
    {
      "Time_Start": 263.16,
      "Time_End": 268.4,
      "Text": " They might notice that. Installation, which is actually going in there, doing the dirty"
    },
    {
      "Time_Start": 268.4,
      "Time_End": 273.32,
      "Text": " work. And that, too, turned out to be non-trivial. And finally, my favorite, share the information,"
    },
    {
      "Time_Start": 273.32,
      "Time_End": 282.32,
      "Text": " which I hope is why we're all here today. Oops, that was ‑‑ there we go. Plan what"
    },
    {
      "Time_Start": 282.32,
      "Time_End": 288.53999999999996,
      "Text": " you want to accomplish. In essence, my theory and my philosophy, I won't, like, burden you"
    },
    {
      "Time_Start": 288.53999999999996,
      "Time_End": 292.03999999999996,
      "Text": " with it too much, but just to say that a hack is a statement that cannot be ignored. If"
    },
    {
      "Time_Start": 292.03999999999996,
      "Time_End": 296.84,
      "Text": " you're going to go to the trouble of gaining illegitimate computer access, there's a reason"
    },
    {
      "Time_Start": 296.84000000000003,
      "Time_End": 300.64000000000004,
      "Text": " for it. And you should think it through, because there are repercussions that are associated"
    },
    {
      "Time_Start": 300.64000000000004,
      "Time_End": 305.04,
      "Text": " with it. If you're going to do this kind of thing, think about what exactly it is you"
    },
    {
      "Time_Start": 305.04,
      "Time_End": 310.72,
      "Text": " intend to accomplish. Do you want to be able to snag those HR records? Or do you want to"
    },
    {
      "Time_Start": 310.72,
      "Time_End": 314.36,
      "Text": " be able to read a certain person's e‑mail because you think that they're cheating on"
    },
    {
      "Time_Start": 314.36,
      "Time_End": 319.52000000000004,
      "Text": " you or whatever the hell it is? Understand what your motivation is. If you're trying"
    },
    {
      "Time_Start": 319.52000000000004,
      "Time_End": 325.00000000000006,
      "Text": " to just, you know, if you're playing what I call sport hacking, where you're essentially"
    },
    {
      "Time_Start": 325.0,
      "Time_End": 327.76,
      "Text": " trying to see how many boxes you can have root on at the same time. I don't know what"
    },
    {
      "Time_Start": 327.76,
      "Time_End": 331.78,
      "Text": " your motivation is, but you need to know that up front. Because that is going to influence"
    },
    {
      "Time_Start": 331.78,
      "Time_End": 336.68,
      "Text": " what you do later on down the line. And what is involved in replacing the files"
    },
    {
      "Time_Start": 336.68,
      "Time_End": 342.44,
      "Text": " on the system? Unix, there are a lot of different aspects of this to be considered. You know,"
    },
    {
      "Time_Start": 342.44,
      "Time_End": 346.4,
      "Text": " the size, the checks on the ownership, the times, the log entries that are going to be"
    },
    {
      "Time_Start": 346.4,
      "Time_End": 351.4,
      "Text": " generated by your legitimate or illegitimate access. Security tools that may or may not"
    },
    {
      "Time_Start": 351.40000000000003,
      "Time_End": 355.6,
      "Text": " be in place to monitor what it is you're doing or something that you think you might"
    },
    {
      "Time_Start": 355.6,
      "Time_End": 363.04,
      "Text": " do later on. And the fact that you want the behavior of the system to remain within expected"
    },
    {
      "Time_Start": 363.04,
      "Time_End": 370.04,
      "Text": " parameters. You don't want to give a system administrator or user, clueless or otherwise,"
    },
    {
      "Time_Start": 370.04,
      "Time_End": 373.92,
      "Text": " any kind of a red flag or even a yellow flag that might make them start to poke around"
    },
    {
      "Time_Start": 373.92,
      "Time_End": 379.64000000000004,
      "Text": " and discover that actually there's something going on there."
    },
    {
      "Time_Start": 379.64,
      "Time_End": 384.88,
      "Text": " Just to give you an idea, I did this on a lot of different platforms. And for this,"
    },
    {
      "Time_Start": 384.88,
      "Time_End": 391.88,
      "Text": " this is just Solaris 2.7. I did 1.2.27 and 2.0.13. I actually have a lot of comparisons"
    },
    {
      "Time_Start": 391.88,
      "Time_End": 398.03999999999996,
      "Text": " for other ones for like BSD and Linux and all. But just the difference between the stripped"
    },
    {
      "Time_Start": 398.03999999999996,
      "Time_End": 404.32,
      "Text": " binary and the unstripped binary, you've got quite a lot of range here. On this slide,"
    },
    {
      "Time_Start": 404.32,
      "Time_End": 414.04,
      "Text": " you've got between 600K and 2600K. I've seen the binary get up to 760K. So there's file"
    },
    {
      "Time_Start": 414.04,
      "Time_End": 418.68,
      "Text": " size is something I'm going to touch on a lot here, because that's something that tools"
    },
    {
      "Time_Start": 418.68,
      "Time_End": 426.32,
      "Text": " look at and something that people can eyeball. I need to turn off my radio. There we go."
    },
    {
      "Time_Start": 426.32,
      "Time_End": 430.44,
      "Text": " File checksums. I've actually got this in a slide later, but I think it bears sufficient"
    },
    {
      "Time_Start": 430.44,
      "Time_End": 436.76,
      "Text": " weight that I should say it early enough now. Tripwire will ruin your whole day. Everybody"
    },
    {
      "Time_Start": 436.76,
      "Time_End": 443.52,
      "Text": " who's not running Tripwire on your system right now, raise your hand, please. All the"
    },
    {
      "Time_Start": 443.52,
      "Time_End": 447.8,
      "Text": " rest of you, please raise your hand, too. Come on, raise your hands. I want to see the"
    },
    {
      "Time_Start": 447.8,
      "Time_End": 451.4,
      "Text": " hands that are not ‑‑ I'm not going to go after you later. Just let me get a show"
    },
    {
      "Time_Start": 451.4,
      "Time_End": 460.42,
      "Text": " of hands. Yeah, there's a few, okay? Binary checksumming is a really nice tool for tracking"
    },
    {
      "Time_Start": 460.42,
      "Time_End": 464.74,
      "Text": " Trojans. If somebody gains illegitimate access to your system and they change the binary"
    },
    {
      "Time_Start": 464.74,
      "Time_End": 468.14000000000004,
      "Text": " indiscriminately, and unfortunately a lot of people who hack systems nowadays are indiscriminate."
    },
    {
      "Time_Start": 468.14000000000004,
      "Time_End": 472.94,
      "Text": " They don't really pay attention to the fine details. A binary checksumming is going to"
    },
    {
      "Time_Start": 472.94,
      "Time_End": 477.5,
      "Text": " spot it and is going to hopefully generate the appropriate red flag not in tomorrow morning's"
    },
    {
      "Time_Start": 477.5,
      "Time_End": 485.86,
      "Text": " e‑mail, you know, preferably on the console that's up there on the wall. The CRC 32‑bit"
    },
    {
      "Time_Start": 485.86,
      "Time_End": 489.02000000000004,
      "Text": " checksum algorithm, I can and will go into that, but I'm not going to do it during this"
    },
    {
      "Time_Start": 489.02,
      "Time_End": 492.34,
      "Text": " talk because, quite honestly, I could do a whole talk on checksumming. So if you want"
    },
    {
      "Time_Start": 492.34,
      "Time_End": 494.97999999999996,
      "Text": " to get into, like, the differences between the different platforms and the different"
    },
    {
      "Time_Start": 494.97999999999996,
      "Time_End": 501.09999999999997,
      "Text": " binary formats and the checksums and stuff, let's go drink beer. File access time stamps."
    },
    {
      "Time_Start": 501.09999999999997,
      "Time_End": 504.5,
      "Text": " In Unix you have three time stamps. You have the time that the file was last accessed,"
    },
    {
      "Time_Start": 504.5,
      "Time_End": 508.82,
      "Text": " the time that the file was last modified, and the time that the file attributes, excluding"
    },
    {
      "Time_Start": 508.82,
      "Time_End": 515.86,
      "Text": " the above, were last changed. Last time I checked, two of those could be modified by"
    },
    {
      "Time_Start": 516.1,
      "Time_End": 521.9,
      "Text": " user commands and the third one was a programmatic challenge. Still, if you're going to screw"
    },
    {
      "Time_Start": 521.9,
      "Time_End": 525.42,
      "Text": " around with files and you're going to screw around with file attributes, it's best to"
    },
    {
      "Time_Start": 525.42,
      "Time_End": 531.22,
      "Text": " make note beforehand of what the original ones were and what the ones are going to be"
    },
    {
      "Time_Start": 531.22,
      "Time_End": 535.42,
      "Text": " after you change it. Hopefully those two values will be the same, and that way if somebody"
    },
    {
      "Time_Start": 535.42,
      "Time_End": 539.94,
      "Text": " does decide to do something cute like diff their entire file system tree overnight, that"
    },
    {
      "Time_Start": 539.94,
      "Time_End": 545.84,
      "Text": " won't show up in the listing. And understanding the source code and its behavior, and this"
    },
    {
      "Time_Start": 545.84,
      "Time_End": 551.6800000000001,
      "Text": " one is going to take two minutes instead of one. Secure shell is a client server protocol,"
    },
    {
      "Time_Start": 551.6800000000001,
      "Time_End": 556.6800000000001,
      "Text": " yay. It creates an encrypted communication channel between the hosts. It performs authentication"
    },
    {
      "Time_Start": 556.6800000000001,
      "Time_End": 560.0,
      "Text": " against the encrypted password. It stores the password in the user credential for the"
    },
    {
      "Time_Start": 560.0,
      "Time_End": 565.52,
      "Text": " privileged user only. So this actually is a special case, okay? The encrypted hash does"
    },
    {
      "Time_Start": 565.52,
      "Time_End": 573.48,
      "Text": " not get stored for anybody except UID 0. So since we happen to want UID 0, that's germane."
    },
    {
      "Time_Start": 573.48,
      "Time_End": 576.94,
      "Text": " You can configure this thing. There are two configuration files. There's actually the"
    },
    {
      "Time_Start": 576.94,
      "Time_End": 581.6,
      "Text": " client side configuration file and the server side configuration file, and the configurations"
    },
    {
      "Time_Start": 581.6,
      "Time_End": 586.48,
      "Text": " actually dictate what parts of the code are traversed during normal execution. So it's"
    },
    {
      "Time_Start": 586.48,
      "Time_End": 590.32,
      "Text": " important to understand what configurations are set up. For example, you can disable root"
    },
    {
      "Time_Start": 590.32,
      "Time_End": 595.4,
      "Text": " login. You can do reverse mappings. Those things, if you turn all that off, a system"
    },
    {
      "Time_Start": 595.4,
      "Time_End": 598.64,
      "Text": " administrator who's looking through the log and doesn't see that for a day or two or a"
    },
    {
      "Time_Start": 598.64,
      "Time_End": 604.56,
      "Text": " week or two, might actually get a clue that something's not behaving the appropriate way."
    },
    {
      "Time_Start": 604.56,
      "Time_End": 610.64,
      "Text": " You can do debugging and event logging. The build generates a library, live SSH session"
    },
    {
      "Time_Start": 610.64,
      "Time_End": 617.3199999999999,
      "Text": " dot A, and several helpers, the SSH agent, the key generation. One point I'm going to"
    },
    {
      "Time_Start": 617.3199999999999,
      "Time_End": 622.4399999999999,
      "Text": " make here is that I'm leaving as an exercise to the reader, quote, unquote, doing pass"
    },
    {
      "Time_Start": 622.4399999999999,
      "Time_End": 627.6,
      "Text": " phrases, okay? I set this up to do pass words. Most of the implementations, in fact, all"
    },
    {
      "Time_Start": 627.6,
      "Time_End": 632.62,
      "Text": " of the implementations of SSH I've ever seen do pass words, but you can also do pass phrases."
    },
    {
      "Time_Start": 632.62,
      "Time_End": 636.4,
      "Text": " That would involve other binaries and more coding, but just to simplify it and keep it"
    },
    {
      "Time_Start": 636.4,
      "Time_End": 642.62,
      "Text": " into a fairly narrow spectrum. And conditional compilation within the code supports various"
    },
    {
      "Time_Start": 642.62,
      "Time_End": 646.6800000000001,
      "Text": " Unix variants. There's AIX code. There's a lot of if-defs in the code. So when you're"
    },
    {
      "Time_Start": 646.6800000000001,
      "Time_End": 650.28,
      "Text": " actually physically going through the code, you need to know what your platform is. You"
    },
    {
      "Time_Start": 650.28,
      "Time_End": 654.64,
      "Text": " need to understand where the branches are going to go and how the conditional compilation"
    },
    {
      "Time_Start": 654.64,
      "Time_End": 662.48,
      "Text": " is going to work. Okay. Real quick animation of the protocol."
    },
    {
      "Time_Start": 662.48,
      "Time_End": 668.8,
      "Text": " The server sends a public key over the wire, and it goes to the client. The client encrypts"
    },
    {
      "Time_Start": 668.8,
      "Time_End": 673.6,
      "Text": " a random session key and returns it to the server. The server decrypts the client's session"
    },
    {
      "Time_Start": 673.6,
      "Time_End": 678.72,
      "Text": " key, and then using that, the server sends a client an encrypted challenge, which the"
    },
    {
      "Time_Start": 678.72,
      "Time_End": 683.92,
      "Text": " client can decrypt, and then you have your session established. So it's a three-way handshake"
    },
    {
      "Time_Start": 683.92,
      "Time_End": 690.16,
      "Text": " a la TCPIP, but it's utilizing encryption, and it's not SINs and ACs so much as it is"
    },
    {
      "Time_Start": 690.16,
      "Time_End": 696.92,
      "Text": " challenge and response. And, okay, one more for the password validation,"
    },
    {
      "Time_Start": 696.92,
      "Time_End": 702.04,
      "Text": " which is going to be a little more detailed as far as how the code actually ‑‑ the"
    },
    {
      "Time_Start": 702.04,
      "Time_End": 705.8399999999999,
      "Text": " logic in the code actually validates the password that the user enters."
    },
    {
      "Time_Start": 705.84,
      "Time_End": 718.2,
      "Text": " Oh, I'm sorry. Sucks to be tall. Okay. The password database on the system has the encrypted"
    },
    {
      "Time_Start": 718.2,
      "Time_End": 721.72,
      "Text": " password hash. Everybody understand ‑‑ of course you understand encrypted password"
    },
    {
      "Time_Start": 721.72,
      "Time_End": 726.76,
      "Text": " hash. That's stored in a structure, it's called SSH user rec, that's the credential structure"
    },
    {
      "Time_Start": 726.76,
      "Time_End": 732.1600000000001,
      "Text": " that gets built on the server side, and that has the name of the user, the directory, the"
    },
    {
      "Time_Start": 732.88,
      "Time_End": 738.62,
      "Text": " shell they're doing. It's the G‑coast fields and a couple of other things."
    },
    {
      "Time_Start": 738.62,
      "Time_End": 745.7199999999999,
      "Text": " What happens in SSHD, SSHD being the demon portion of SSH that runs on the target machine,"
    },
    {
      "Time_Start": 745.7199999999999,
      "Time_End": 751.4399999999999,
      "Text": " there are a couple of pieces of logic that get tested even before the password comparison"
    },
    {
      "Time_Start": 751.4399999999999,
      "Time_End": 756.28,
      "Text": " begins. The first one being the number of password guesses, which is configurable in"
    },
    {
      "Time_Start": 756.28,
      "Time_End": 761.6,
      "Text": " the configuration file. The second one being whether or not root logins are permitted,"
    },
    {
      "Time_Start": 761.6,
      "Time_End": 767.72,
      "Text": " we'll address that later. The password comes in across the wire, it's a clear text password,"
    },
    {
      "Time_Start": 767.72,
      "Time_End": 772.4,
      "Text": " the password is checked for size to see if it's less than or equal to 64, so no buffer"
    },
    {
      "Time_Start": 772.4,
      "Time_End": 776.76,
      "Text": " overruns here. There's a couple of checks that are actually"
    },
    {
      "Time_Start": 776.76,
      "Time_End": 780.96,
      "Text": " pretty amusing because they're for RPC and Kerberos passwords and they're both empty"
    },
    {
      "Time_Start": 780.96,
      "Time_End": 787.0400000000001,
      "Text": " blocks. I think that's actually got code in it in 2.1. And then the clear text password"
    },
    {
      "Time_Start": 787.04,
      "Time_End": 791.68,
      "Text": " gets encrypted and a stir comp happens, so the password hash is compared against the"
    },
    {
      "Time_Start": 791.68,
      "Time_End": 796.04,
      "Text": " encrypted password that the user entered, and if that comes to zero, if you've got a"
    },
    {
      "Time_Start": 796.04,
      "Time_End": 801.0799999999999,
      "Text": " comparison that matches, then you authenticate at that point, okay? So that's just the password"
    },
    {
      "Time_Start": 801.0799999999999,
      "Time_End": 808.0799999999999,
      "Text": " validation scheme that the SSHD itself uses. This is a piece of the configuration file."
    },
    {
      "Time_Start": 809.5999999999999,
      "Time_End": 813.4399999999999,
      "Text": " The config file itself would not fit on a single slide, so I just chopped some of it"
    },
    {
      "Time_Start": 813.44,
      "Time_End": 818.2,
      "Text": " out and put it up here so we could talk about a few points. Port 22 is the default port"
    },
    {
      "Time_Start": 818.2,
      "Time_End": 822.0,
      "Text": " for SSH. Of course, if you're setting up your SSH and it doesn't happen to talk on port"
    },
    {
      "Time_Start": 822.0,
      "Time_End": 828.0,
      "Text": " 22, they might notice. Forward agent and forward X11 are two things"
    },
    {
      "Time_Start": 828.0,
      "Time_End": 835.0,
      "Text": " that allow you to do tunneled X sessions through SSH. I routinely turn those off. I could go"
    },
    {
      "Time_Start": 836.5600000000001,
      "Time_End": 839.5600000000001,
      "Text": " into a ‑‑ I could probably do a talk on why that's a good idea to do that. If you"
    },
    {
      "Time_Start": 839.5600000000001,
      "Time_End": 844.2,
      "Text": " want to talk about that, we can do that offline. Password guesses is set to three. Some places"
    },
    {
      "Time_Start": 844.2,
      "Time_End": 850.8800000000001,
      "Text": " set it to a smaller number. Permit root log in. There's a check in the code that says"
    },
    {
      "Time_Start": 850.8800000000001,
      "Time_End": 857.7600000000001,
      "Text": " if your UID is zero and permit root log in says no, you get kicked out. We will circumvent"
    },
    {
      "Time_Start": 857.7600000000001,
      "Time_End": 861.7600000000001,
      "Text": " that. Let's see. Require reverse mapping. That's"
    },
    {
      "Time_Start": 861.7600000000001,
      "Time_End": 865.5600000000001,
      "Text": " a lot of fun. That's basically DNS lookups. If you're on an added network and you have"
    },
    {
      "Time_Start": 865.84,
      "Time_End": 871.0400000000001,
      "Text": " internal DNS, then those DNS lookups will work. If not, you might find that your SSH"
    },
    {
      "Time_Start": 871.0400000000001,
      "Time_End": 876.48,
      "Text": " doesn't work. But regardless, you need to know what these config settings are. Because,"
    },
    {
      "Time_Start": 876.48,
      "Time_End": 883.48,
      "Text": " again, you want your Trojan to behave identically to the target code, the existing correct target"
    },
    {
      "Time_Start": 884.48,
      "Time_End": 890.0000000000001,
      "Text": " code. Understanding the vigorous of the software,"
    },
    {
      "Time_Start": 890.0000000000001,
      "Time_End": 893.6800000000001,
      "Text": " the flow of control within the modules, the scope of the variables within the source code."
    },
    {
      "Time_Start": 893.6800000000001,
      "Time_End": 897.0400000000001,
      "Text": " That's actually germane. There's actually a very good separation of scope between the"
    },
    {
      "Time_Start": 897.0400000000001,
      "Time_End": 902.48,
      "Text": " modules in SSH. The supported functionality and the crypt function. I spent about two"
    },
    {
      "Time_Start": 902.48,
      "Time_End": 909.48,
      "Text": " hours really late one night trying to figure out why crypt wasn't working. And with caffeine"
    },
    {
      "Time_Start": 909.6400000000001,
      "Time_End": 912.44,
      "Text": " and all that, you know, I just wasn't doing that well. And all of a sudden I remembered"
    },
    {
      "Time_Start": 912.44,
      "Time_End": 916.08,
      "Text": " that there's this notation in the man page under bugs that says, oh, yeah, crypt returns"
    },
    {
      "Time_Start": 916.08,
      "Time_End": 920.5000000000001,
      "Text": " a static pointer to a static object. So you call it multiple times and you get the same"
    },
    {
      "Time_Start": 920.54,
      "Time_End": 927.54,
      "Text": " hash back. That was good once I figured that out, but I really missed those two hours."
    },
    {
      "Time_Start": 928.18,
      "Time_End": 932.98,
      "Text": " Okay. Maintaining the core functionality. Understand how the untainted code responds."
    },
    {
      "Time_Start": 932.98,
      "Time_End": 939.62,
      "Text": " Again, the point here is to have a Trojan that behaves identically to the accurate and"
    },
    {
      "Time_Start": 939.62,
      "Time_End": 945.46,
      "Text": " replaced source code. With the one exception being that you can get in using it. That includes"
    },
    {
      "Time_Start": 945.46,
      "Time_End": 949.98,
      "Text": " the configuration stuff that we just talked about. Logging. And choosing a special case."
    },
    {
      "Time_Start": 949.98,
      "Time_End": 954.5,
      "Text": " In this case I said, you know, we're choosing the passwords. We're not using the pass phrases."
    },
    {
      "Time_Start": 954.5,
      "Time_End": 959.5,
      "Text": " If you can pick a special case that's less obvious. Like logging in as root. And don't"
    },
    {
      "Time_Start": 959.5,
      "Time_End": 962.54,
      "Text": " gut the code and expect that no one is paying attention. Because, again, once you build"
    },
    {
      "Time_Start": 962.54,
      "Time_End": 969.0600000000001,
      "Text": " your binary, you want your binary to be as close to the correct size as possible. One"
    },
    {
      "Time_Start": 969.0600000000001,
      "Time_End": 975.1800000000001,
      "Text": " of the things you can do is you can modify logging that will give you away. Your conditional"
    },
    {
      "Time_Start": 975.1800000000001,
      "Time_End": 978.46,
      "Text": " compilation code for TCP wrappers. If they're not running wrappers, you don't need that"
    },
    {
      "Time_Start": 978.46,
      "Time_End": 983.4200000000001,
      "Text": " code. The DNS lookups, I don't think administrators really pay that much attention to whether"
    },
    {
      "Time_Start": 983.4200000000001,
      "Time_End": 988.5,
      "Text": " or not DNS lookup failures show up in the logs. If they have fascist logging enabled"
    },
    {
      "Time_Start": 988.5,
      "Time_End": 993.1800000000001,
      "Text": " and fascist logging is actually an option in the config file. And what it is is it's"
    },
    {
      "Time_Start": 993.1800000000001,
      "Time_End": 998.26,
      "Text": " verbose logging. It logs the entire connection of the session and the setup of the connection."
    },
    {
      "Time_Start": 998.26,
      "Time_End": 1003.74,
      "Text": " You want to keep that. For obvious reasons. Again, if people are checking the logs. Failed"
    },
    {
      "Time_Start": 1003.74,
      "Time_End": 1008.38,
      "Text": " login attempts should show up. Administrators might get suspicion if they notice that everybody"
    },
    {
      "Time_Start": 1009.38,
      "Time_End": 1013.7,
      "Text": " is logging in, no problem whatsoever. And if root logins are disallowed, failed attempts"
    },
    {
      "Time_Start": 1013.7,
      "Time_End": 1020.7,
      "Text": " to log in as root should show up in the logs. Again, otherwise it arises suspicion. Don't"
    },
    {
      "Time_Start": 1021.7,
      "Time_End": 1026.22,
      "Text": " add stupid variable names. It's amazing how many root kits I've run into where people"
    },
    {
      "Time_Start": 1026.22,
      "Time_End": 1032.02,
      "Text": " name things hack and 31337. That stuff will show up when people start doing forensics."
    },
    {
      "Time_Start": 1032.5,
      "Time_End": 1039.5,
      "Text": " High level forensics like running strings on the thing. Don't make bad choices. And"
    },
    {
      "Time_Start": 1039.7,
      "Time_End": 1043.5,
      "Text": " be careful how much code you add. If you want to do something really clever like you want"
    },
    {
      "Time_Start": 1043.5,
      "Time_End": 1048.94,
      "Text": " to collect a bunch of passwords from all the SSH users and mail them to your hot mail account"
    },
    {
      "Time_Start": 1048.94,
      "Time_End": 1052.76,
      "Text": " or whatever, you're going to put a fairly significant chunk of code into this binary"
    },
    {
      "Time_Start": 1052.76,
      "Time_End": 1056.7,
      "Text": " to do that and it's going to bloat the thing. You can strip it, you can do all the optimization"
    },
    {
      "Time_Start": 1056.7,
      "Time_End": 1059.22,
      "Text": " you want and you're going to have this big fat thing and you're going to have to figure"
    },
    {
      "Time_Start": 1059.22,
      "Time_End": 1064.14,
      "Text": " out how to shrink it down. So, you know, understand that there are boundaries within"
    },
    {
      "Time_Start": 1064.14,
      "Time_End": 1067.1000000000001,
      "Text": " which you can work and try to stay within those boundaries. Because if you generate"
    },
    {
      "Time_Start": 1067.1000000000001,
      "Time_End": 1072.18,
      "Text": " a 10 meg binary and the original one was 6 meg, it will probably get noticed eventually."
    },
    {
      "Time_Start": 1072.18,
      "Time_End": 1075.78,
      "Text": " The thing you want is to not be noticed here. You're trying to do this in as much of a stealth"
    },
    {
      "Time_Start": 1075.78,
      "Time_End": 1082.78,
      "Text": " mode as possible. Commenting your source, I won't even talk about it. We all know that."
    },
    {
      "Time_Start": 1083.02,
      "Time_End": 1089.46,
      "Text": " The importance of coding exceptionally well. If your Trojan binary crashes, they're probably"
    },
    {
      "Time_Start": 1089.46,
      "Time_End": 1094.66,
      "Text": " going to catch you. So even though it's really tempting to be clever when you're doing the"
    },
    {
      "Time_Start": 1094.66,
      "Time_End": 1098.8999999999999,
      "Text": " code, it's probably a good idea not to do that and just code straight and make sure"
    },
    {
      "Time_Start": 1098.8999999999999,
      "Time_End": 1103.62,
      "Text": " that your functionality is real clean and also people that you pass the code on to are"
    },
    {
      "Time_Start": 1103.62,
      "Time_End": 1108.82,
      "Text": " going to review your efforts and they're going to judge you on those efforts. And picking"
    },
    {
      "Time_Start": 1108.82,
      "Time_End": 1115.82,
      "Text": " a password that is not hack or 31337 that doesn't show up as a recognizable, you know,"
    },
    {
      "Time_Start": 1116.1799999999998,
      "Time_End": 1121.82,
      "Text": " root George is a bad password in any case. It's especially bad in this case because if"
    },
    {
      "Time_Start": 1121.82,
      "Time_End": 1126.5,
      "Text": " they strings the binary and they see George, they're going to notice. And don't use your"
    },
    {
      "Time_Start": 1126.5,
      "Time_End": 1130.1799999999998,
      "Text": " regular password, okay? Because if you distribute your source and you put your regular password"
    },
    {
      "Time_Start": 1130.1799999999998,
      "Time_End": 1133.26,
      "Text": " in the source, people are going to pay attention to that and they're probably going to go and"
    },
    {
      "Time_Start": 1133.26,
      "Time_End": 1139.5,
      "Text": " try it on your IP, all right? This is my little diagram for the scoping issue. There"
    },
    {
      "Time_Start": 1139.5,
      "Time_End": 1145.54,
      "Text": " actually is really ‑‑ tattoo is not here and I'm really grateful. The scoping between"
    },
    {
      "Time_Start": 1145.54,
      "Time_End": 1151.26,
      "Text": " the library portion of the code and the daemon portion of the code is exceptionally clear"
    },
    {
      "Time_Start": 1151.26,
      "Time_End": 1158.26,
      "Text": " cut. You cannot see the password in the SSHD code the way it's written. You can only have"
    },
    {
      "Time_Start": 1159.26,
      "Time_End": 1165.9,
      "Text": " it within scope in the library. So you've got these two different components of this"
    },
    {
      "Time_Start": 1165.9,
      "Time_End": 1172.9,
      "Text": " code and a complete and total schism between where the encrypted password hash is and where"
    },
    {
      "Time_Start": 1173.74,
      "Time_End": 1180.3799999999999,
      "Text": " you want to access it, namely an SSHD. So what do you do? You add a new subroutine to"
    },
    {
      "Time_Start": 1180.3799999999999,
      "Time_End": 1185.66,
      "Text": " the library, namely give me the password out of the user cred, okay? So you therefore defeat"
    },
    {
      "Time_Start": 1185.66,
      "Time_End": 1192.66,
      "Text": " the scoping issue. Another logic diagram a la the earlier one,"
    },
    {
      "Time_Start": 1193.38,
      "Time_End": 1197.3400000000001,
      "Text": " are you going to change the password, yes or no? Is the length of the password greater"
    },
    {
      "Time_Start": 1197.3400000000001,
      "Time_End": 1203.22,
      "Text": " than 64, yes or no? Is the password valid, yes or no? Is the user ID greater than zero,"
    },
    {
      "Time_Start": 1203.22,
      "Time_End": 1208.3000000000002,
      "Text": " yes or no? And are root logins allowed, yes or no? That's the linear progression of the"
    },
    {
      "Time_Start": 1208.3000000000002,
      "Time_End": 1213.26,
      "Text": " logic within the authentication module itself, okay? So this is just a block diagram of the"
    },
    {
      "Time_Start": 1213.26,
      "Time_End": 1217.26,
      "Text": " logic within the pertinent module where the validation actually happens."
    },
    {
      "Time_Start": 1217.26,
      "Time_End": 1224.26,
      "Text": " All that coughing is making me thirsty. So given that that's the logic that things"
    },
    {
      "Time_Start": 1228.56,
      "Time_End": 1232.58,
      "Text": " are checked in, if it's necessary for you to reorganize the logic, you want to retain"
    },
    {
      "Time_Start": 1232.58,
      "Time_End": 1235.9,
      "Text": " that functionality, but you might find that what it is you want to accomplish requires"
    },
    {
      "Time_Start": 1235.9,
      "Time_End": 1242.1,
      "Text": " you to redesign the logic in some way, reorder things, don't break the functionality, but"
    },
    {
      "Time_Start": 1242.1000000000001,
      "Time_End": 1246.7400000000002,
      "Text": " maybe do checks in different orders or maybe put some go-tos or branches in there so that"
    },
    {
      "Time_Start": 1246.7400000000002,
      "Time_End": 1250.94,
      "Text": " what you can do is, if you don't want to check if root logins are allowed, and I suppose"
    },
    {
      "Time_Start": 1250.94,
      "Time_End": 1255.3000000000002,
      "Text": " you don't if you're trying to get in as root, you can probably branch around that code except"
    },
    {
      "Time_Start": 1255.3000000000002,
      "Time_End": 1259.1000000000001,
      "Text": " you might want to keep the log there because there will be logging in there if that check"
    },
    {
      "Time_Start": 1259.1000000000001,
      "Time_End": 1263.66,
      "Text": " fails. It will spit out a log entry that says somebody tried to get in as root with a valid"
    },
    {
      "Time_Start": 1263.66,
      "Time_End": 1268.0200000000002,
      "Text": " password and that's not allowed. If you make the decision that you don't think that's important"
    },
    {
      "Time_Start": 1268.0200000000002,
      "Time_End": 1270.7800000000002,
      "Text": " enough for it to stay in the logs and you need to gut your code just a little bit more"
    },
    {
      "Time_Start": 1270.78,
      "Time_End": 1275.42,
      "Text": " to get it down to where it needs to be, throw it out, okay? But these are the kind of decisions"
    },
    {
      "Time_Start": 1275.42,
      "Time_End": 1282.42,
      "Text": " that you're making while you're going through the process of changing this code. Configurable"
    },
    {
      "Time_Start": 1283.02,
      "Time_End": 1287.1,
      "Text": " features will restrict the individual access attempts. The permit root login is one, the"
    },
    {
      "Time_Start": 1287.1,
      "Time_End": 1293.8999999999999,
      "Text": " DNS lookups is another. This is my little DNS cloud drawing for those of you who, you"
    },
    {
      "Time_Start": 1293.8999999999999,
      "Time_End": 1298.06,
      "Text": " know, if you do a lookup on an IP, you get the host name back unless it's not resolvable,"
    },
    {
      "Time_Start": 1298.06,
      "Time_End": 1302.1399999999999,
      "Text": " in which case you get the IP back. And the code does check if IP equals host name and"
    },
    {
      "Time_Start": 1302.1399999999999,
      "Time_End": 1308.94,
      "Text": " reverse lookups are set, deny. So you got to circumvent that within the code. If you"
    },
    {
      "Time_Start": 1308.94,
      "Time_End": 1314.08,
      "Text": " want to not be denied on a reverse lookup, you've got to comment that out. In this case"
    },
    {
      "Time_Start": 1314.08,
      "Time_End": 1317.94,
      "Text": " I did something really simple. It returns true if the lookup fails, so I just always"
    },
    {
      "Time_Start": 1317.94,
      "Time_End": 1322.22,
      "Text": " have it return false regardless of whether or not the lookup works. You won't see any"
    },
    {
      "Time_Start": 1322.22,
      "Time_End": 1327.52,
      "Text": " of those messages in the logs anymore that say DNS lookup failed. My take on that was"
    },
    {
      "Time_Start": 1327.52,
      "Time_End": 1334.52,
      "Text": " most sysadmins won't notice those missing. And again, the logging is associated with"
    },
    {
      "Time_Start": 1334.6,
      "Time_End": 1339.32,
      "Text": " altered functionality. This is the same principle essentially of just saying, you know, there's"
    },
    {
      "Time_Start": 1339.32,
      "Time_End": 1346.32,
      "Text": " your log entry that you're going to see if your log fails, okay? The other way of doing"
    },
    {
      "Time_Start": 1347.32,
      "Time_End": 1351.32,
      "Text": " it is just to remove the log statement. If you don't care whether or not the lookup fails"
    },
    {
      "Time_Start": 1351.32,
      "Time_End": 1356.04,
      "Text": " and it doesn't impact what you're trying to do, you can just strip out the logging statement,"
    },
    {
      "Time_Start": 1356.04,
      "Time_End": 1361.74,
      "Text": " actually stripping out the print Fs, gets you about a K off your binary for every statement"
    },
    {
      "Time_Start": 1361.74,
      "Time_End": 1367.04,
      "Text": " that you lose because that print F compiles in a bunch of code. It goes back to the library"
    },
    {
      "Time_Start": 1367.04,
      "Time_End": 1374.04,
      "Text": " every time. Elective surgery to adjust the resulting binary size. Again, the binary on"
    },
    {
      "Time_Start": 1375.04,
      "Time_End": 1379.56,
      "Text": " the original target will have a size and your root, so you have no excuse for going and"
    },
    {
      "Time_Start": 1379.56,
      "Time_End": 1383.32,
      "Text": " doing an LS on that directory and seeing what the size of that binary is. You have no excuse"
    },
    {
      "Time_Start": 1383.32,
      "Time_End": 1388.24,
      "Text": " for not going into SSH2 and grabbing that config file. You need to understand your"
    },
    {
      "Time_Start": 1388.24,
      "Time_End": 1392.04,
      "Text": " target before you do any of this coding. You want to understand what it is you're trying"
    },
    {
      "Time_Start": 1392.04,
      "Time_End": 1398.1799999999998,
      "Text": " to replace so that what you replace it with is so close to or identical to the original"
    },
    {
      "Time_Start": 1398.1799999999998,
      "Time_End": 1405.1799999999998,
      "Text": " that no one's going to notice. Removing sufficient code to connect the binary size. In this case"
    },
    {
      "Time_Start": 1405.6799999999998,
      "Time_End": 1410.8,
      "Text": " I ‑‑ let's see, I threw away the wrapper's code, basically. There wasn't wrappers running"
    },
    {
      "Time_Start": 1410.8,
      "Time_End": 1414.08,
      "Text": " on the target system, so I didn't need the wrapper's code. There's code in SSHD that"
    },
    {
      "Time_Start": 1414.08,
      "Time_End": 1417.6399999999999,
      "Text": " integrates with TCP wrappers. If they're not running wrappers, they don't need that code."
    },
    {
      "Time_Start": 1417.6399999999999,
      "Time_End": 1424.52,
      "Text": " I threw that away. I carved 20K off the binary. And beware of functional limitations and bugs."
    },
    {
      "Time_Start": 1424.52,
      "Time_End": 1429.56,
      "Text": " For those of you who have never seen it, this is Solaris 2.6. This is the crypt function."
    },
    {
      "Time_Start": 1429.56,
      "Time_End": 1432.48,
      "Text": " And I was actually hoping that this would give a better illustration of the fact that"
    },
    {
      "Time_Start": 1432.48,
      "Time_End": 1437.56,
      "Text": " it returns that static pointer every time. In hindsight, I don't really think it gives"
    },
    {
      "Time_Start": 1437.56,
      "Time_End": 1442.28,
      "Text": " you any better ‑‑ except for the fact there's those consts in comments. But it is"
    },
    {
      "Time_Start": 1442.28,
      "Time_End": 1445.6799999999998,
      "Text": " in the man page. Like I said, at about 4 in the morning, I sort of remembered that from"
    },
    {
      "Time_Start": 1445.6799999999998,
      "Time_End": 1450.72,
      "Text": " somewhere deep in my memory. I went and pulled it off the shelf and went and said, yep. So"
    },
    {
      "Time_Start": 1450.72,
      "Time_End": 1454.56,
      "Text": " there will be functional limitations in the code. And you will run into them and you will"
    },
    {
      "Time_Start": 1454.56,
      "Time_End": 1460.72,
      "Text": " want to figure out some way to circumvent those. And probably the most important slide"
    },
    {
      "Time_Start": 1460.72,
      "Time_End": 1466.24,
      "Text": " in the entire ‑‑ in this entire presentation is, you know, test what you're doing. Once"
    },
    {
      "Time_Start": 1466.24,
      "Time_End": 1472.4,
      "Text": " you put it there, it's there. And if you screwed up, you know, I hope your door insurance"
    },
    {
      "Time_Start": 1472.4,
      "Time_End": 1477.92,
      "Text": " is paid up. That's all I got to say. Testing is cheaper than door insurance."
    },
    {
      "Time_Start": 1477.92,
      "Time_End": 1483.8,
      "Text": " Okay. Building the binary, you want to try to use the compile and link options that are"
    },
    {
      "Time_Start": 1483.8,
      "Time_End": 1487.72,
      "Text": " as close to or identical to the target. Again, for the obvious reason that you want the result"
    },
    {
      "Time_Start": 1487.72,
      "Time_End": 1491.44,
      "Text": " to come out as close to or identical to the target that you're going to replace. If they"
    },
    {
      "Time_Start": 1491.44,
      "Time_End": 1494.88,
      "Text": " happen to have been nice and left you the source tree on the system that you're going"
    },
    {
      "Time_Start": 1494.88,
      "Time_End": 1501.72,
      "Text": " to put the Trojan on, I suggest you go and pull the make file and use it. If you have"
    },
    {
      "Time_Start": 1501.72,
      "Time_End": 1505.16,
      "Text": " access to the target, which you assumably do since you rooted it. If you don't have"
    },
    {
      "Time_Start": 1505.16,
      "Time_End": 1510.24,
      "Text": " access to the target for whatever reason, you let your connection timeout. Use the defaults,"
    },
    {
      "Time_Start": 1510.24,
      "Time_End": 1514.0800000000002,
      "Text": " go for full optimization, play around with it, experiment a little. You'll come up with"
    },
    {
      "Time_Start": 1514.0800000000002,
      "Time_End": 1517.72,
      "Text": " something that's close or not close enough. If you use full optimization, the worst thing"
    },
    {
      "Time_Start": 1517.72,
      "Time_End": 1520.8000000000002,
      "Text": " that will happen is they'll get an increase in performance. I don't think they'll complain"
    },
    {
      "Time_Start": 1520.8,
      "Time_End": 1527.8,
      "Text": " about that. And use an identical machine and OS, obviously. Okay. You'd be surprised"
    },
    {
      "Time_Start": 1528.76,
      "Time_End": 1531.84,
      "Text": " how many people build a binary on Linux and try to install it on Solaris and wonder why"
    },
    {
      "Time_Start": 1531.84,
      "Time_End": 1538.68,
      "Text": " it doesn't work. I'm sorry, I'm not trying to pander to the audience, but it's happened."
    },
    {
      "Time_Start": 1538.68,
      "Time_End": 1544.36,
      "Text": " And size the binary correctly. You got to go to this Las Vegas Hilton, man, this Star"
    },
    {
      "Time_Start": 1544.3600000000001,
      "Time_End": 1551.3600000000001,
      "Text": " Trek place was good. Run a checksum. If you think they're running, by now, if you've gotten"
    },
    {
      "Time_Start": 1551.8400000000001,
      "Time_End": 1554.68,
      "Text": " into the system and you haven't figured out that they're running a checksum program, you"
    },
    {
      "Time_Start": 1554.68,
      "Time_End": 1561.3600000000001,
      "Text": " shouldn't be doing this at all. Okay? So enough said there. Do it all in your lab, you know?"
    },
    {
      "Time_Start": 1561.3600000000001,
      "Time_End": 1565.64,
      "Text": " Checksum the binary. If you have to figure out, and we'll talk about it in the next slide,"
    },
    {
      "Time_Start": 1565.64,
      "Time_End": 1569.92,
      "Text": " how to modify the binary so the checksum works, how to size the binary so that it's the appropriate"
    },
    {
      "Time_Start": 1569.92,
      "Time_End": 1576.92,
      "Text": " size. Do all this in your lab. I know you, you know, you are going to root this E4500"
    },
    {
      "Time_Start": 1577.76,
      "Time_End": 1584.04,
      "Text": " and all you have at home is an Ultra 5, okay? If it's running 64-bit Solaris 2.7, it's running"
    },
    {
      "Time_Start": 1584.04,
      "Time_End": 1588.3200000000002,
      "Text": " 64-bit Solaris 2.7. No, it's not running the SMP code, but don't worry about that. Just"
    },
    {
      "Time_Start": 1588.3200000000002,
      "Time_End": 1593.16,
      "Text": " do all this other stuff and you'll be okay. And don't do it on your FreeBSD box. It compiles"
    },
    {
      "Time_Start": 1593.16,
      "Time_End": 1599.6000000000001,
      "Text": " a hell of a lot faster, but it's not going to work. And write a README file. Because"
    },
    {
      "Time_Start": 1599.64,
      "Time_End": 1604.88,
      "Text": " if you're going to put it out in the community, it's nice to just give it to people and let"
    },
    {
      "Time_Start": 1604.88,
      "Time_End": 1609.3200000000002,
      "Text": " them know what it is you did and give them an idea of where you stopped and what they"
    },
    {
      "Time_Start": 1609.3200000000002,
      "Time_End": 1614.1200000000001,
      "Text": " can do with it. For example, I did the passwords. If somebody in here is going to do one and"
    },
    {
      "Time_Start": 1614.1200000000001,
      "Time_End": 1619.44,
      "Text": " it's going to be the passphrases, okay, it's in the README file. So you know, okay, I haven't"
    },
    {
      "Time_Start": 1619.44,
      "Time_End": 1626.44,
      "Text": " done the passphrases, but it's on the to-do list. And be paranoid, because there's a high"
    },
    {
      "Time_Start": 1626.72,
      "Time_End": 1630.92,
      "Text": " assumable risk in what I'm talking about here. Essentially, what I'm talking about is doing"
    },
    {
      "Time_Start": 1630.92,
      "Time_End": 1636.1200000000001,
      "Text": " something that in the United States, at least, is illegal. So you want to, you know, take"
    },
    {
      "Time_Start": 1636.1200000000001,
      "Time_End": 1639.96,
      "Text": " it seriously. You've already compromised your position. You've already rooted a box, but"
    },
    {
      "Time_Start": 1639.96,
      "Time_End": 1644.16,
      "Text": " you want to take this seriously, okay? Those of you who have had your doors kicked down"
    },
    {
      "Time_Start": 1644.16,
      "Time_End": 1649.0800000000002,
      "Text": " at 5 in the morning know what I'm talking about. The rest of you, take my word on it."
    },
    {
      "Time_Start": 1649.0800000000002,
      "Time_End": 1652.8,
      "Text": " And the 12 important things to remember before you begin, number one, fix the size and the"
    },
    {
      "Time_Start": 1652.8,
      "Time_End": 1658.6399999999999,
      "Text": " checksum. Number two, fix the time differences. This is sort of a checklist for when you're"
    },
    {
      "Time_Start": 1658.6399999999999,
      "Time_End": 1662.1599999999999,
      "Text": " actually going in and doing the install. What are the things you want to do when you're"
    },
    {
      "Time_Start": 1662.1599999999999,
      "Time_End": 1665.6399999999999,
      "Text": " installing the thing on the system? Number three is check for tripwire. You should already"
    },
    {
      "Time_Start": 1665.6399999999999,
      "Time_End": 1670.44,
      "Text": " know if tripwire and other tools are running, okay? And if they are, you shouldn't be at"
    },
    {
      "Time_Start": 1670.44,
      "Time_End": 1675.58,
      "Text": " this point, right? You should have gone away a long time ago. Check for immutable binaries"
    },
    {
      "Time_Start": 1675.58,
      "Time_End": 1679.6399999999999,
      "Text": " on BSD systems. It's a lot of fun when you go to try to install this on a BSD system"
    },
    {
      "Time_Start": 1679.8400000000001,
      "Time_End": 1682.92,
      "Text": " and it won't install and you can't move it, you can't copy it, you can't RM it, and then"
    },
    {
      "Time_Start": 1682.92,
      "Time_End": 1687.3200000000002,
      "Text": " you remember, oh, yeah, there's that extra high order part over there in the file attributes."
    },
    {
      "Time_Start": 1687.3200000000002,
      "Time_End": 1693.0800000000002,
      "Text": " I wonder if it's immutable. Check for cron jobs that run massive diffs across the file"
    },
    {
      "Time_Start": 1693.0800000000002,
      "Time_End": 1699.48,
      "Text": " system, what I call tripwire wannabes. That's going to catch you if you're not exactly dead"
    },
    {
      "Time_Start": 1699.48,
      "Time_End": 1705.5600000000002,
      "Text": " on for size and checksum. So, again, check for remote monitoring that tracks disk space"
    },
    {
      "Time_Start": 1705.5600000000002,
      "Time_End": 1709.5,
      "Text": " and CPU utilization. There's nothing more discouraging than to be sitting there trying"
    },
    {
      "Time_Start": 1709.5,
      "Time_End": 1713.38,
      "Text": " to do the install on this thing while somebody's big brother screen has gone red on the left"
    },
    {
      "Time_Start": 1713.38,
      "Time_End": 1717.98,
      "Text": " hand side because of all the disk utilization and CPU utilization. Nobody's on that machine."
    },
    {
      "Time_Start": 1717.98,
      "Time_End": 1724.46,
      "Text": " Why is that happening? Check for serial logging to the extent that you can. Go into syslog.conf"
    },
    {
      "Time_Start": 1724.46,
      "Time_End": 1731.22,
      "Text": " and look and see if they're dumping stuff to a PC over a null modem cable. If they are,"
    },
    {
      "Time_Start": 1731.22,
      "Time_End": 1737.18,
      "Text": " you're probably outed already, but you might as well know why. Check for other hacks or"
    },
    {
      "Time_Start": 1737.18,
      "Time_End": 1741.22,
      "Text": " tools like keystroke monitors. Why are you doing this work on a machine that somebody"
    },
    {
      "Time_Start": 1741.22,
      "Time_End": 1746.0600000000002,
      "Text": " else has already rooted and giving them all this free information, you know? Let them"
    },
    {
      "Time_Start": 1746.0600000000002,
      "Time_End": 1752.1000000000001,
      "Text": " go download the tar ball and figure it out. Don't hop the demon when you're still connected"
    },
    {
      "Time_Start": 1752.1000000000001,
      "Time_End": 1759.1000000000001,
      "Text": " using SSH. Okay. Good. I don't have to explain that one. Remove the source tree if you do"
    },
    {
      "Time_Start": 1759.54,
      "Time_End": 1764.22,
      "Text": " build on the target machine. And finally, no, not finally, clean up all the logs, including"
    },
    {
      "Time_Start": 1764.22,
      "Time_End": 1769.5,
      "Text": " sulog and all those logs, and avoid the temptation to log on to IRC and brag about your latest"
    },
    {
      "Time_Start": 1769.5,
      "Time_End": 1775.98,
      "Text": " hack. So this is my list of the 12 important things to remember before you begin. Once"
    },
    {
      "Time_Start": 1775.98,
      "Time_End": 1780.38,
      "Text": " you do the install, before you do the install on the target, try it on your own system,"
    },
    {
      "Time_Start": 1780.38,
      "Time_End": 1783.58,
      "Text": " you know? Circumvent network obstacles if you need to, if you're punching through a"
    },
    {
      "Time_Start": 1783.58,
      "Time_End": 1786.58,
      "Text": " checkpoint firewall because you went to black hat and you saw that great talk that those"
    },
    {
      "Time_Start": 1786.58,
      "Time_End": 1793.02,
      "Text": " guys gave and you just want to try all that stuff. Figure out how long it's going to take."
    },
    {
      "Time_Start": 1793.02,
      "Time_End": 1799.02,
      "Text": " Okay? There's actually, you know, there's this thing called time. And you actually use"
    },
    {
      "Time_Start": 1799.02,
      "Time_End": 1805.54,
      "Text": " it up when you're getting into a system, copying stuff, touching files, chomotting, choning"
    },
    {
      "Time_Start": 1805.54,
      "Time_End": 1809.5,
      "Text": " things. It takes a while. I don't care how fast you type. Figure out how long it's going"
    },
    {
      "Time_Start": 1809.5,
      "Time_End": 1813.9,
      "Text": " to take. If you're going to be spending one or two hours on their system, plan for that"
    },
    {
      "Time_Start": 1813.9,
      "Time_End": 1817.34,
      "Text": " and make sure you don't do it, you know, at 3 in the afternoon. Well, maybe you want to"
    },
    {
      "Time_Start": 1817.34,
      "Time_End": 1819.94,
      "Text": " do it at 3 in the afternoon because that's where everybody's using it. You're going to"
    },
    {
      "Time_Start": 1819.94,
      "Time_End": 1823.6200000000001,
      "Text": " be slow, but you don't care. They won't notice. If you do it at 3 in the morning and the utilization"
    },
    {
      "Time_Start": 1823.6200000000001,
      "Time_End": 1827.98,
      "Text": " has a little spike in it on their MRTGs, that might not be good either. And the goal is"
    },
    {
      "Time_Start": 1827.98,
      "Time_End": 1832.26,
      "Text": " to anticipate as many points of failure as possible. Okay? This is, like I said, originally"
    },
    {
      "Time_Start": 1832.26,
      "Time_End": 1834.98,
      "Text": " when I did this, I thought, oh, I'm just going to put some logic in here, build the thing"
    },
    {
      "Time_Start": 1834.98,
      "Time_End": 1840.66,
      "Text": " and I'm going to throw it up there. But it winds up being nontrivial. Gaining root access,"
    },
    {
      "Time_Start": 1840.66,
      "Time_End": 1844.06,
      "Text": " this is the third step, how to actually get in. And my slide says check bug track because"
    },
    {
      "Time_Start": 1844.06,
      "Time_End": 1851.06,
      "Text": " it's more current than this slide. Okay? Remote exploits, I just made a list of some"
    },
    {
      "Time_Start": 1852.02,
      "Time_End": 1856.02,
      "Text": " crap that, you know, was actually on bug track at the time that I wrote this, which is back"
    },
    {
      "Time_Start": 1856.02,
      "Time_End": 1860.4199999999998,
      "Text": " in April. So a lot of this stuff is probably already patched, but I just said, okay, I'll"
    },
    {
      "Time_Start": 1860.4199999999998,
      "Time_End": 1863.94,
      "Text": " just give them an example of some stuff, different OSs and different things that are current"
    },
    {
      "Time_Start": 1863.94,
      "Time_End": 1867.82,
      "Text": " right now. For those of you who are sitting there going, well, I don't have any remote"
    },
    {
      "Time_Start": 1867.82,
      "Time_End": 1872.58,
      "Text": " exploits. Well, there's some on bug track. And gaining root access on a system that you've"
    },
    {
      "Time_Start": 1872.6999999999998,
      "Time_End": 1877.82,
      "Text": " already compromised, well, you already know how to do that, don't you? But, again, I put"
    },
    {
      "Time_Start": 1877.82,
      "Time_End": 1884.34,
      "Text": " a few examples up here just for show. And circumventing network obstacles, scanning"
    },
    {
      "Time_Start": 1884.34,
      "Time_End": 1888.1799999999998,
      "Text": " for ports, scanning past the firewall, all of that, you know, who here was at Black Hat?"
    },
    {
      "Time_Start": 1888.1799999999998,
      "Time_End": 1891.4399999999998,
      "Text": " Can I get a show of hands for the people that were in Black Hat? Yeah. Did you guys catch"
    },
    {
      "Time_Start": 1891.4399999999998,
      "Time_End": 1896.3799999999999,
      "Text": " that talk, Doug Song's talk? I love to see a commercial product obliterated in front"
    },
    {
      "Time_Start": 1896.3799999999999,
      "Time_End": 1902.5,
      "Text": " of an audience. It's so much fun. Poke through the ports, you know, passive FTP tunneling,"
    },
    {
      "Time_Start": 1902.5,
      "Time_End": 1907.52,
      "Text": " four examples of that in that talk. And figure out how long it will take. Again, do a dry"
    },
    {
      "Time_Start": 1907.52,
      "Time_End": 1910.84,
      "Text": " run of the thing. Essentially what you want to do is you want to practice this. It's like"
    },
    {
      "Time_Start": 1910.84,
      "Time_End": 1915.1,
      "Text": " doing a talk, you know, although some of you out there may be objecting at this point."
    },
    {
      "Time_Start": 1915.1,
      "Time_End": 1918.26,
      "Text": " You need to rehearse the talk, you need to rehearse the hack. Because you want to get"
    },
    {
      "Time_Start": 1918.26,
      "Time_End": 1922.32,
      "Text": " it smooth, you want to get it to where you can say, okay, I can do this thing without"
    },
    {
      "Time_Start": 1922.32,
      "Time_End": 1926.3,
      "Text": " a lot of ‑‑ I don't want to wind up halfway in the middle of trojaning somebody's"
    },
    {
      "Time_Start": 1926.3,
      "Time_End": 1933.06,
      "Text": " SSH and find a gotcha. That would be a bad place to be."
    },
    {
      "Time_Start": 1933.06,
      "Time_End": 1937.46,
      "Text": " And the last part, which I call share, which is planning for the future. Post your package"
    },
    {
      "Time_Start": 1937.46,
      "Time_End": 1943.74,
      "Text": " discreetly so that others can expand on your work. Maybe a full‑blown rootkit is what"
    },
    {
      "Time_Start": 1943.74,
      "Time_End": 1947.3799999999999,
      "Text": " you want to do to this system ultimately. Okay? This is for the target machine that"
    },
    {
      "Time_Start": 1947.3799999999999,
      "Time_End": 1950.8999999999999,
      "Text": " we're talking about, once you've actually accomplished this. Maybe you want to rootkit"
    },
    {
      "Time_Start": 1950.8999999999999,
      "Time_End": 1954.1,
      "Text": " them, maybe you're going to put sniffers on there, maybe you're going to put other trojans"
    },
    {
      "Time_Start": 1954.1000000000001,
      "Time_End": 1958.0200000000002,
      "Text": " on there, maybe you want to put a nice ‑‑ I've got a great little FTPD that's got an"
    },
    {
      "Time_Start": 1958.0200000000002,
      "Time_End": 1965.22,
      "Text": " extra command added to the lexical analyzer that's called shell, S‑H‑E‑L."
    },
    {
      "Time_Start": 1965.22,
      "Time_End": 1969.4,
      "Text": " So yeah, once you're done, pat yourself on the back, but don't stop there. Think what"
    },
    {
      "Time_Start": 1969.4,
      "Time_End": 1975.46,
      "Text": " else you can do with this and or with other things to expand your access."
    },
    {
      "Time_Start": 1975.46,
      "Time_End": 1979.0600000000002,
      "Text": " And just to be fair about it, I threw in a slide to talk about protecting yourself against"
    },
    {
      "Time_Start": 1979.0600000000002,
      "Time_End": 1982.9,
      "Text": " trojan binaries. Again, tripwire will ruin your whole day. I think it's an excellent"
    },
    {
      "Time_Start": 1982.9,
      "Time_End": 1987.14,
      "Text": " tool, it costs nothing, it installs very cleanly and it does the job."
    },
    {
      "Time_Start": 1987.14,
      "Time_End": 1991.94,
      "Text": " The immutable bit on BSD systems, if you're running a BSD system, you have that high order"
    },
    {
      "Time_Start": 1991.94,
      "Time_End": 1998.26,
      "Text": " 8 bits in the file descriptor and it has the immutable bit and you can set that so that"
    },
    {
      "Time_Start": 1998.26,
      "Time_End": 2001.74,
      "Text": " your binaries cannot be changed except if you're the root user. Now, of course, if they've"
    },
    {
      "Time_Start": 2001.74,
      "Time_End": 2005.0600000000002,
      "Text": " got root on your box, they're probably going to see that and they're going to change it,"
    },
    {
      "Time_Start": 2005.0600000000002,
      "Time_End": 2008.94,
      "Text": " but it will slow them down a little. Okay? The other thing is you can set your whole"
    },
    {
      "Time_Start": 2009.06,
      "Time_End": 2013.78,
      "Text": " file system to be read only. If you put your binaries on slash user slash local slash bin"
    },
    {
      "Time_Start": 2013.78,
      "Time_End": 2018.5,
      "Text": " slash whatever, people aren't writing to that. The only person who's writing to that is the"
    },
    {
      "Time_Start": 2018.5,
      "Time_End": 2022.22,
      "Text": " system admin when he's doing install. Make the thing read only. It doesn't slow it down."
    },
    {
      "Time_Start": 2022.22,
      "Time_End": 2024.6200000000001,
      "Text": " And again, somebody will get in there and they'll try to write over the thing and it"
    },
    {
      "Time_Start": 2024.6200000000001,
      "Time_End": 2028.46,
      "Text": " won't happen and it will stop them in their tracks."
    },
    {
      "Time_Start": 2028.46,
      "Time_End": 2033.92,
      "Text": " Proactive auditing, diffing your file systems, if you can't run tripwire, run a find across"
    },
    {
      "Time_Start": 2033.92,
      "Time_End": 2038.8000000000002,
      "Text": " your whole friggin' file system, okay? It takes about ten minutes on a SCSI disk, you"
    },
    {
      "Time_Start": 2038.8000000000002,
      "Time_End": 2042.6000000000001,
      "Text": " know, on a decent sized machine and you'll get the diffs and you put them in your mailbox"
    },
    {
      "Time_Start": 2042.6000000000001,
      "Time_End": 2046.24,
      "Text": " and you'll see them in the morning. If you happen to see that root in the password file"
    },
    {
      "Time_Start": 2046.24,
      "Time_End": 2050.52,
      "Text": " shows up on that file system diff, then it might start to ring some bells for you and"
    },
    {
      "Time_Start": 2050.52,
      "Time_End": 2057.52,
      "Text": " you might decide to do a little poking around. Real hackers are lazy. Okay? Enough said."
    },
    {
      "Time_Start": 2058.52,
      "Time_End": 2063.72,
      "Text": " Know what you intend to accomplish. Consider the source. Change as little as possible."
    },
    {
      "Time_Start": 2063.72,
      "Time_End": 2067.64,
      "Text": " Please, please, please, please test your stuff. It is so frustrating. I had one break on me."
    },
    {
      "Time_Start": 2067.64,
      "Time_End": 2073.24,
      "Text": " It really sucked. Emulate the original as closely as possible. Do your homework. Don't"
    },
    {
      "Time_Start": 2073.24,
      "Time_End": 2077.08,
      "Text": " get caught unprepared. Do a dry run. Make sure you know what you're getting into and"
    },
    {
      "Time_Start": 2077.08,
      "Time_End": 2081.56,
      "Text": " share the information so that the rest of us can learn."
    },
    {
      "Time_Start": 2081.56,
      "Time_End": 2086.92,
      "Text": " And where to go to learn more? I'm going to post the package up on an FTP site. Probably"
    },
    {
      "Time_Start": 2086.92,
      "Time_End": 2091.36,
      "Text": " not today. Actually, probably not this week at this point. It will probably be next week"
    },
    {
      "Time_Start": 2091.36,
      "Time_End": 2096.88,
      "Text": " sometime. I will post these slides up on the web page. I have not done that, but again,"
    },
    {
      "Time_Start": 2096.88,
      "Time_End": 2101.96,
      "Text": " I will do that when I get back. And if you want to contact me, it's wrangler at netpublishing.com"
    },
    {
      "Time_Start": 2101.96,
      "Time_End": 2108.96,
      "Text": " is an email that I will answer. Where are we for time? Who's got to watch? Okay. Not"
    },
    {
      "Time_Start": 2109.44,
      "Time_End": 2116.44,
      "Text": " bad. It took me 50 minutes when I did it in the room. Eric Blodack's here yet? Okay, when"
    },
    {
      "Time_Start": 2123.4,
      "Time_End": 2128.84,
      "Text": " Chris gets here, anybody know what Chris looks like? When Chris gets here, you know. Actually,"
    },
    {
      "Time_Start": 2128.84,
      "Time_End": 2132.56,
      "Text": " I want to talk to Chris because I want to go drinking later. But I'll take some questions"
    },
    {
      "Time_Start": 2132.56,
      "Time_End": 2139.56,
      "Text": " in the meantime. Yeah? Yeah, okay. There you go. Goggins here yet? Okay, sweet. If"
    },
    {
      "Time_Start": 2153.88,
      "Time_End": 2160.88,
      "Text": " you want to talk to me, I'll be offline over in the corner. All right? Thank you very much."
    },
    {
      "Time_Start": 2162.56,
      "Time_End": 2163.08,
      "Text": " Thank you."
    }
  ]
}