{"segments": [{"Time_Start": 0.0, "Time_End": 4.0, "Text": " The basic..."}, {"Time_Start": 4.0, "Time_End": 21.46, "Text": " Here's the basic statement of the problem."}, {"Time_Start": 21.46, "Time_End": 28.900000000000002, "Text": " You have a user Alice, Alice and Bob are the traditional names for users described in a cryptographic system."}, {"Time_Start": 28.900000000000002, "Time_End": 36.900000000000006, "Text": " Alice isn't in place like China where they control and monitor all internet traffic in and out of the country."}, {"Time_Start": 36.900000000000006, "Time_End": 43.900000000000006, "Text": " Alice is communicating with a machine run by Bob, which is somewhere outside China like in the U.S."}, {"Time_Start": 43.900000000000006, "Time_End": 52.900000000000006, "Text": " And the assumption is that China does not know about Bob's machine, so they are not blocking communication between Alice and Bob,"}, {"Time_Start": 52.900000000000006, "Time_End": 58.900000000000006, "Text": " so she can send requests to him requesting the content of websites, which he has access."}, {"Time_Start": 58.9, "Time_End": 61.4, "Text": " to and he can take the content and pass them back to her."}, {"Time_Start": 61.4, "Time_End": 67.9, "Text": " But they have to use a communication method that cannot be automatically detected by the Chinese"}, {"Time_Start": 67.9, "Time_End": 71.9, "Text": " who are monitoring internet traffic in and out of their country."}, {"Time_Start": 71.9, "Time_End": 76.9, "Text": " Mallory, is a funny name for a Chinese network administrator, but he's called Mallory,"}, {"Time_Start": 76.9, "Time_End": 82.9, "Text": " is administering the great Chinese firewall and monitoring all traffic in and out of China."}, {"Time_Start": 82.9, "Time_End": 83.9, "Text": " He can..."}, {"Time_Start": 83.9, "Time_End": 85.9, "Text": " What did I say?"}, {"Time_Start": 85.9, "Time_End": 87.9, "Text": " Have I got like a bugger hang out of my nose or something?"}, {"Time_Start": 87.9, "Time_End": 88.9, "Text": " Why is there a word?"}, {"Time_Start": 88.9, "Time_End": 89.9, "Text": " pretty laughing."}, {"Time_Start": 89.9, "Time_End": 92.9, "Text": " Yeah, right."}, {"Time_Start": 92.9, "Time_End": 95.9, "Text": " I mean, that's an old expression."}, {"Time_Start": 95.9, "Time_End": 98.9, "Text": " I did that on purpose."}, {"Time_Start": 98.9, "Time_End": 104.9, "Text": " So he blocks access to sites that Alice is not supposed to be allowed to communicate with,"}, {"Time_Start": 104.9, "Time_End": 110.9, "Text": " like CNN.com, but the default policy is to allow sites that have not yet been classified,"}, {"Time_Start": 110.9, "Time_End": 114.9, "Text": " so, Alice is allowed to communicate with Bob."}, {"Time_Start": 114.9, "Time_End": 117.9, "Text": " But the protocol that Alice uses to communicate with Bob's website,"}, {"Time_Start": 117.9, "Time_End": 123.56, "Text": " website cannot have any characteristics which can be detected easily."}, {"Time_Start": 123.56, "Time_End": 127.80000000000001, "Text": " There are a lot of so-called solutions that are floating around that aren't really secure."}, {"Time_Start": 127.80000000000001, "Time_End": 134.66, "Text": " Like websites where you go and you can type in a URL in a field and a form and hit"}, {"Time_Start": 134.66, "Time_End": 138.02, "Text": " go and it will go and request the content of the page for you."}, {"Time_Start": 138.02, "Time_End": 143.74, "Text": " Those types of things are really insecure against monitoring because not only can they,"}, {"Time_Start": 143.74, "Time_End": 147.88, "Text": " you can actually monitor for field, for network traffic that indicates somebody to"}, {"Time_Start": 147.9, "Time_End": 150.9, "Text": " something into a field beginning with HTTP."}, {"Time_Start": 150.9, "Time_End": 154.9, "Text": " Not only can they see that, they can also see the traffic the other way and see what you were"}, {"Time_Start": 154.9, "Time_End": 155.9, "Text": " looking at."}, {"Time_Start": 155.9, "Time_End": 161.9, "Text": " So it's sort of a temporary solution, but it's not the kind of thing you would rely on in a situation"}, {"Time_Start": 161.9, "Time_End": 162.9, "Text": " like Alice."}, {"Time_Start": 166.9, "Time_End": 171.9, "Text": " There are two sort of ways of looking at this."}, {"Time_Start": 171.9, "Time_End": 176.9, "Text": " One of it is called the arms race strategy and the getting it right, the first"}, {"Time_Start": 176.9, "Time_End": 178.9, "Text": " getting it right the first time strategy."}, {"Time_Start": 178.9, "Time_End": 183.9, "Text": " Arms race means that we would design a protocol for Alice to communicate with Bob,"}, {"Time_Start": 183.9, "Time_End": 189.9, "Text": " knowing that there's, knowing that the Chinese that Mallory could figure out a way"}, {"Time_Start": 189.9, "Time_End": 194.4, "Text": " to block and detect that protocol, and they would say, okay, we'll fix that in an extra vision"}, {"Time_Start": 194.4, "Time_End": 199.4, "Text": " because it'll take them a few product cycles to figure out how to detect this protocol that we're using,"}, {"Time_Start": 199.4, "Time_End": 202.4, "Text": " and by the time they fix that, we'll have another one."}, {"Time_Start": 202.4, "Time_End": 203.9, "Text": " So that's the first strategy."}, {"Time_Start": 203.9, "Time_End": 206.88, "Text": " We published a protocol that has known we"}, {"Time_Start": 206.9, "Time_End": 211.9, "Text": " weaknesses. The Chinese government, the people who make the monitoring software,"}, {"Time_Start": 211.9, "Time_End": 216.9, "Text": " create software that detects those weaknesses, we create a new one, and so on."}, {"Time_Start": 216.9, "Time_End": 222.9, "Text": " The second strategy is getting it right the first time, which that doesn't literally mean getting it right the first time."}, {"Time_Start": 222.9, "Time_End": 226.9, "Text": " You never get it right the first time, but you should at least attempt to get it right the first time."}, {"Time_Start": 226.9, "Time_End": 232.9, "Text": " You should never try and distribute a protocol that has known weaknesses and to say,"}, {"Time_Start": 232.9, "Time_End": 235.9, "Text": " well, it'll take them a while to catch up, and by that time we'll have, we'll have, we'll have,"}, {"Time_Start": 235.9, "Time_End": 239.26000000000002, "Text": " have a new version that doesn't have those weaknesses in it."}, {"Time_Start": 239.26000000000002, "Time_End": 247.84, "Text": " I'm going to argue for why the arms race strategy, which is constantly coming up with new versions"}, {"Time_Start": 247.84, "Time_End": 250.18, "Text": " of the protocol, is a bad idea."}, {"Time_Start": 250.18, "Time_End": 256.9, "Text": " First of all, if we publish version 0.0 of some protocol and then lots of different bob"}, {"Time_Start": 256.9, "Time_End": 261.9, "Text": " sites spring up all over the internet using 0.0, and then we know that it's got a flaw in it,"}, {"Time_Start": 261.9, "Time_End": 265.24, "Text": " so, okay, two months for now, we'll have version 0.1."}, {"Time_Start": 265.24, "Time_End": 273.74, "Text": " then half of the sites upgrade to 0.1 and so on. Alice, the Alice's inside China, using the software,"}, {"Time_Start": 273.74, "Time_End": 282.90000000000003, "Text": " have got to communicate with different websites running by Bob, and version negotiation is not something that's easy in this scenario."}, {"Time_Start": 282.90000000000003, "Time_End": 287.6, "Text": " Because remember, all the communication between Alice and Bob has to be something that looks"}, {"Time_Start": 287.6, "Time_End": 295.22, "Text": " completely unsuspicious to somebody monitoring the traffic. So it's not a good, it's not possible to have Alice"}, {"Time_Start": 295.24, "Time_End": 302.24, "Text": " sending out headers saying, I would want to open a session using version 0.0 or version 0.1 of this protocol."}, {"Time_Start": 302.24, "Time_End": 312.24, "Text": " So any sort of situation where you end up with lots of different clients and servers using different versions of the software is a really bad idea."}, {"Time_Start": 312.24, "Time_End": 321.24, "Text": " Also, the problem is, and if we follow a plan which requires people to keep updating the protocol and making fixes to it,"}, {"Time_Start": 321.24, "Time_End": 325.22, "Text": " I mean, I don't want to spend three months on something that's going to be broken after a week."}, {"Time_Start": 325.24, "Time_End": 330.24, "Text": " somebody has to keep, somebody is going to have to keep updating the protocol to take care of all the fixes."}, {"Time_Start": 330.6, "Time_End": 331.34000000000003, "Text": " Do you want to do it?"}, {"Time_Start": 332.84000000000003, "Time_End": 334.46000000000004, "Text": " Yeah, volunteer. I don't want to."}, {"Time_Start": 334.88, "Time_End": 339.7, "Text": " That's why I prefer that if we're going to invest this amount of effort in designing a secure protocol,"}, {"Time_Start": 340.1, "Time_End": 342.72, "Text": " is why they get it right the first-time strategy is better."}, {"Time_Start": 343.16, "Time_End": 349.96000000000004, "Text": " Also, if you design and deploy a protocol that people use that can be detected easily,"}, {"Time_Start": 349.96000000000004, "Time_End": 355.22, "Text": " the problem is after that's been in use for a few months, all the bob people who are willing,"}, {"Time_Start": 355.24, "Time_End": 360.24, "Text": " running servers that Alice can communicate with, the Chinese network monitors will"}, {"Time_Start": 360.24, "Time_End": 365.86, "Text": " have detected those servers that Bob is running because, as we said, the protocol has"}, {"Time_Start": 365.86, "Time_End": 370.90000000000003, "Text": " a, if the protocol has a known weakness and it gives the sensors and monitors a chance to detect"}, {"Time_Start": 370.90000000000003, "Time_End": 376.36, "Text": " all the people who are running it, then they will then know that those sites are renegades"}, {"Time_Start": 376.36, "Time_End": 378.40000000000003, "Text": " and they will add them to their block list."}, {"Time_Start": 378.40000000000003, "Time_End": 384.28000000000003, "Text": " And so even if version 0.1 then comes out and it is secure and cannot be detected easily, it'll"}, {"Time_Start": 384.28000000000003, "Time_End": 388.48, "Text": " be too late because the sensors and monitors will have blocked all the people who are"}, {"Time_Start": 388.48, "Time_End": 393.58000000000004, "Text": " running these circumventor sites. Also, of course, from the user's point of view, Alice, inside China,"}, {"Time_Start": 393.68, "Time_End": 399.50000000000006, "Text": " if she's using version 0.0, doesn't do any good if version 0.1 comes out if she has already been"}, {"Time_Start": 399.50000000000006, "Time_End": 404.74, "Text": " arrested for using the old one, which was deployed even though it had no weaknesses in it."}, {"Time_Start": 404.74, "Time_End": 413.84000000000003, "Text": " So this sort of seems like a given from a security point of view, but I've been running a mailing"}, {"Time_Start": 413.84000000000003, "Time_End": 418.70000000000005, "Text": " for a while discussing how to come up with this type of protocol. I hear a lot of people"}, {"Time_Start": 418.70000000000005, "Time_End": 424.02000000000004, "Text": " saying stuff that sounds like they're edging towards where you just say, okay, let's release"}, {"Time_Start": 424.02000000000004, "Time_End": 431.1, "Text": " it this way and it will be inconvenient for the sensorware companies to come up with a way to fix"}, {"Time_Start": 431.1, "Time_End": 435.58000000000004, "Text": " against this so it will buy us some time and by the time they fix it, they'll come up with the next"}, {"Time_Start": 435.58000000000004, "Time_End": 441.02000000000004, "Text": " version. And I was just explaining why I think that's a bad idea. But people prefer things like,"}, {"Time_Start": 441.02000000000004, "Time_End": 443.82000000000005, "Text": " well, let's have a protocol with the browse."}, {"Time_Start": 443.84000000000003, "Time_End": 449.16, "Text": " passes cookies out to the server, and inside the cookie is data which represents"}, {"Time_Start": 449.16, "Time_End": 454.28000000000003, "Text": " the URL that you want to get. That is a short-term solution that's going to be blocked very"}, {"Time_Start": 454.28000000000003, "Time_End": 460.94000000000005, "Text": " quickly. It will either result in the censoring network administrators blocking all cookies"}, {"Time_Start": 460.94000000000005, "Time_End": 467.20000000000005, "Text": " by default and only allowing them for sites like Hotmail that really need them, or also they'll"}, {"Time_Start": 467.20000000000005, "Time_End": 471.40000000000003, "Text": " be able to monitor the cookie stream and tell what you're looking at anyway. Or something"}, {"Time_Start": 471.40000000000003, "Time_End": 475.16, "Text": " like use JavaScript to encrypt URLs submitted through forms."}, {"Time_Start": 475.24, "Time_End": 480.68, "Text": " That means if you're viewing a page on the client end, and I explain why it's a bad idea to"}, {"Time_Start": 480.68, "Time_End": 488.26000000000005, "Text": " type HTTP colon slash slash CNN.com into a form and submit it because the sensor network"}, {"Time_Start": 488.26000000000005, "Time_End": 493.74, "Text": " administrators can spot something like that. You could use a standard JavaScript on all these pages"}, {"Time_Start": 493.74, "Time_End": 499.86, "Text": " on the client end that can be used to encrypt the URL and submit it. The problem is that as soon as you do"}, {"Time_Start": 499.86, "Time_End": 501.38000000000005, "Text": " that, the sensor works."}, {"Time_Start": 501.40000000000003, "Time_End": 506.44000000000005, "Text": " makers will get a copy of that JavaScript code and have their censoring proxy servers"}, {"Time_Start": 506.44000000000005, "Time_End": 511.86, "Text": " just monitor incoming pages for that snippet of code and they will know that those pages are hostile"}, {"Time_Start": 511.86, "Time_End": 514.9000000000001, "Text": " sites that are used to circumvent their network and they'll block them."}, {"Time_Start": 514.9000000000001, "Time_End": 519.2800000000001, "Text": " Um, ROT 13 disguised page content is another obvious example."}, {"Time_Start": 519.2800000000001, "Time_End": 524.64, "Text": " A ROT 13 is where you will place every letter on the page with the letter of 13 places away"}, {"Time_Start": 524.64, "Time_End": 527.64, "Text": " from it in the alphabet or wrapping around at 26."}, {"Time_Start": 527.64, "Time_End": 531.38, "Text": " Obviously if anybody invented a protocol based on that,"}, {"Time_Start": 531.4, "Time_End": 536.64, "Text": " the sensorware makers would design their proxy to scan for pages that have been"}, {"Time_Start": 536.64, "Time_End": 542.78, "Text": " ROT 13. And this is stuff that people have actually proposed over the past couple of weeks"}, {"Time_Start": 542.78, "Time_End": 550.36, "Text": " on this discussion list talking about this problem, presumably because they're not, they're not"}, {"Time_Start": 550.36, "Time_End": 556.3199999999999, "Text": " missing the point over why arms race syndrome is a bad idea, which means saying, okay, we'll"}, {"Time_Start": 556.3199999999999, "Time_End": 560.36, "Text": " publish it this way, and of course they can come up with a way to detect it later, but that'll"}, {"Time_Start": 560.36, "Time_End": 561.16, "Text": " buy us some time."}, {"Time_Start": 561.16, "Time_End": 562.6, "Text": " and then we'll come out with a new version."}, {"Time_Start": 563.16, "Time_End": 566.54, "Text": " Don't, it's a very bad idea to get caught up in thinking that way."}, {"Time_Start": 567.04, "Time_End": 571.7199999999999, "Text": " This is why the strategy called getting it right the first time is a bad idea."}, {"Time_Start": 572.7199999999999, "Time_End": 578.28, "Text": " So the core assumptions for the get it right, the first time strategy means you want to,"}, {"Time_Start": 578.28, "Time_End": 584.48, "Text": " you want to design a protocol that can never be detected when it's in use."}, {"Time_Start": 584.78, "Time_End": 590.5, "Text": " You want to design it such that even the Chinese government knows the details of her protocol."}, {"Time_Start": 590.5, "Time_End": 595.16, "Text": " You publish all the source code for the client on Alice's end, and they serve her on Bob's end,"}, {"Time_Start": 595.44, "Time_End": 601.06, "Text": " and they can examine the details of the protocol, but they still cannot write software to detect"}, {"Time_Start": 601.06, "Time_End": 602.42, "Text": " when it is being used."}, {"Time_Start": 602.92, "Time_End": 609.12, "Text": " And that way, Alice can use it to communicate with Bob's machine, and Bob can de-interpret"}, {"Time_Start": 609.12, "Time_End": 613.0, "Text": " the request sent from Alice, and then request the websites and pass them back to her."}, {"Time_Start": 620.5, "Time_End": 628.6, "Text": " And there have been a lot of discussion about how important is it for the requests from going from Alice's machine to Bob's machine to be encrypted."}, {"Time_Start": 629.26, "Time_End": 641.6, "Text": " There's a key point here that encryption is not important as steganography because we're designing the system to be used in the kind of situation where just the fact that you're circumventing the system at all is likely to get you in trouble."}, {"Time_Start": 642.22, "Time_End": 650.48, "Text": " If they can figure out that you've circumvented the system, they're going to be not as concerned with what you are actually looking at, but simply the fact that you've got around"}, {"Time_Start": 650.5, "Time_End": 652.42, "Text": " it is going to be enough to get you in trouble."}, {"Time_Start": 652.54, "Time_End": 658.84, "Text": " So we're talking not about places like the U.S. where they might have limited monitoring of its citizens,"}, {"Time_Start": 659.0, "Time_End": 666.9, "Text": " but places where the regime is so strict that you can be punished just for attempting to break the rules."}, {"Time_Start": 667.12, "Time_End": 673.78, "Text": " Places like China or Iraq or high school, places where they're really cracking down on you."}, {"Time_Start": 675.34, "Time_End": 680.48, "Text": " Another epiphany that came to us after a while was it's just as valid."}, {"Time_Start": 680.5, "Time_End": 685.0, "Text": " to use secret key encryption for Bob's site as it is to use public key encryption."}, {"Time_Start": 685.0, "Time_End": 690.5, "Text": " And we want to use secret key encryption instead because for reasons that are explained later,"}, {"Time_Start": 690.5, "Time_End": 694.5, "Text": " you want the number of bits transmitted back and forth to be very small."}, {"Time_Start": 694.5, "Time_End": 702.5, "Text": " And if you use public key encryption securely, you're already running into a problem where you have to transmit 120 or 1,024 bits back and forth."}, {"Time_Start": 702.5, "Time_End": 710.48, "Text": " But the thing about public key encryption is that it's appropriate only for a site where, you know, every"}, {"Time_Start": 710.5, "Time_End": 724.5, "Text": " Everybody knows about it, including the adversary trying to monitor traffic, knows about the site you're communicating with, and they've published a public key, and the adversary has access to the public key, but they still can't decryp the transmissions."}, {"Time_Start": 724.5, "Time_End": 732.5, "Text": " For Bob's website, you're assuming that the adversary, Mallory, the Chinese government monitoring you, doesn't know about the site anyway."}, {"Time_Start": 732.5, "Time_End": 740.5, "Text": " So because the communication endpoint is secret, you don't lose anything by making the encryption key secret as well."}, {"Time_Start": 740.5, "Time_End": 745.5, "Text": " So whenever Bob distributes to people the location of his circumventor website,"}, {"Time_Start": 745.5, "Time_End": 749.5, "Text": " he just distributes the secret encryption key along with it as well."}, {"Time_Start": 753.5, "Time_End": 758.5, "Text": " Like I said, for the get it right the first time strategy,"}, {"Time_Start": 758.5, "Time_End": 766.5, "Text": " you're not trying to design a protocol that will be secure against whatever currently implemented monitoring, censoring, proxy servers exist."}, {"Time_Start": 766.5, "Time_End": 770.48, "Text": " You want to design it to be secure against current and,"}, {"Time_Start": 770.5, "Time_End": 780.5, "Text": " future monitoring proxies, which means assume that the network administrator in this case is using what you imagine to be the perfect program."}, {"Time_Start": 780.5, "Time_End": 785.5, "Text": " It has none of the shortcomings that exist in the one you have now."}, {"Time_Start": 785.5, "Time_End": 790.5, "Text": " This means you can actually, you could track users on a per session basis."}, {"Time_Start": 790.5, "Time_End": 794.5, "Text": " If somebody dials up on two different occasions, you can tell,"}, {"Time_Start": 794.5, "Time_End": 800.5, "Text": " you could look at the traffic from their first dial-in session and on their second dial-in session, and if you can, if you can,"}, {"Time_Start": 800.5, "Time_End": 808.5, "Text": " If you notice anything unusual about their second traffic session, then you can detect a deviation from their normal habits."}, {"Time_Start": 808.5, "Time_End": 813.5, "Text": " And then you'll, that's only possible, of course, if you track every user individually."}, {"Time_Start": 813.5, "Time_End": 821.5, "Text": " For certain features like HTTP, that would seem like a really easy way to solve all this problem."}, {"Time_Start": 821.5, "Time_End": 824.5, "Text": " Just have Bob's site use HTTP for Alice to communicate with them."}, {"Time_Start": 824.5, "Time_End": 830.5, "Text": " I believe that if we deployed a protocol based on something like HTTP,"}, {"Time_Start": 830.5, "Time_End": 832.5, "Text": " which is really easy to detect."}, {"Time_Start": 832.5, "Time_End": 848.5, "Text": " What would happen is the makers of the censoring, monitoring proxies would implement a policy where HTTP is blocked by default and then only allowed back for specific sites like Amazon.com to have a legitimate use for it."}, {"Time_Start": 848.5, "Time_End": 853.5, "Text": " And then the sensors know are not running a circumventor server on the back end."}, {"Time_Start": 853.5, "Time_End": 860.48, "Text": " I actually checked just anecdotably to look at my browser history to see how often"}, {"Time_Start": 860.5, "Time_End": 863.0, "Text": " I'm actually using an HTTP side."}, {"Time_Start": 863.0, "Time_End": 867.5, "Text": " And it was only like five sides in the previous month that I had hit using HTTP."}, {"Time_Start": 867.5, "Time_End": 874.0, "Text": " So it is actually not going to be a huge impact on what these sensors consider to be legitimate use"}, {"Time_Start": 874.0, "Time_End": 878.0, "Text": " if they implements in a policy where HDVS is blocked by default."}, {"Time_Start": 878.0, "Time_End": 879.5, "Text": " Same thing with things like cookies."}, {"Time_Start": 879.5, "Time_End": 881.5, "Text": " If you design a protocol that relies on cookies,"}, {"Time_Start": 881.5, "Time_End": 888.0, "Text": " they're probably going to do the same kind of thing where they implement a policy where cookies get blocked from websites by TVolt."}, {"Time_Start": 888.0, "Time_End": 890.0, "Text": " And then they will add it back for sites."}, {"Time_Start": 890.0, "Time_End": 897.0, "Text": " sites like hotmail.com that have a legitimate use for it and can't work without it."}, {"Time_Start": 897.0, "Time_End": 905.0, "Text": " Also for some of the features that were described later for this ideal perfect censoring software,"}, {"Time_Start": 905.0, "Time_End": 911.0, "Text": " some of the functions that might need to conduct would be two processor intensive if they did it for all users."}, {"Time_Start": 911.0, "Time_End": 916.0, "Text": " Like if you relied on being able to parse JavaScript on the pages that the user was looking at,"}, {"Time_Start": 916.0, "Time_End": 919.0, "Text": " that's obviously not feasible to do for the entire population of the data."}, {"Time_Start": 919.0, "Time_End": 923.6, "Text": " population of China, or the entire online population of China, which is a lot smaller."}, {"Time_Start": 923.6, "Time_End": 928.2, "Text": " But they don't have the resources to parse that for everybody, but they could do random audits"}, {"Time_Start": 928.2, "Time_End": 934.0, "Text": " on users where they select in any given moment 1% of all internet users going through their system"}, {"Time_Start": 934.0, "Time_End": 940.5, "Text": " are being are subject to a more processor intensive audit where they look more closely at each of the pages"}, {"Time_Start": 940.5, "Time_End": 945.5, "Text": " and tell whether they're using, say, malicious JavaScript code or not."}, {"Time_Start": 945.5, "Time_End": 948.98, "Text": " Also remember that the computing power doubles every 18 months."}, {"Time_Start": 949.0, "Time_End": 952.0, "Text": " and the online population does not."}, {"Time_Start": 952.0, "Time_End": 955.0, "Text": " So if we want this to be secure within the near future,"}, {"Time_Start": 955.0, "Time_End": 958.0, "Text": " we have to rely on the sensor and proxies,"}, {"Time_Start": 958.0, "Time_End": 961.0, "Text": " being able to devote exponentially more and more computing power"}, {"Time_Start": 961.0, "Time_End": 965.0, "Text": " to monitoring each individual user every year."}, {"Time_Start": 965.0, "Time_End": 968.0, "Text": " Both of these last two points are just basically a response"}, {"Time_Start": 968.0, "Time_End": 971.0, "Text": " to objections that are frequently made saying that there's"}, {"Time_Start": 971.0, "Time_End": 973.0, "Text": " no way the sensor could do blah, blah, blah,"}, {"Time_Start": 973.0, "Time_End": 976.0, "Text": " because they don't have the computing power"}, {"Time_Start": 976.0, "Time_End": 978.0, "Text": " to monitor everybody to the extent that it's"}, {"Time_Start": 978.0, "Time_End": 980.0, "Text": " extent that we think they would."}, {"Time_Start": 980.0, "Time_End": 985.0, "Text": " And yes, that might be true now, but they can solve this problem both by waiting for computers to get faster"}, {"Time_Start": 985.0, "Time_End": 990.0, "Text": " and also by only monitoring a certain subset of their users within each time period."}, {"Time_Start": 990.0, "Time_End": 1003.0, "Text": " Another thing that comes up pretty frequently on the list where this problem is discussed."}, {"Time_Start": 1003.0, "Time_End": 1007.98, "Text": " It is not fair to assume that these sensors have to, you know, play by"}, {"Time_Start": 1008.0, "Time_End": 1014.0, "Text": " the rules, meaning that you can't complain about, you know, if they're, say, for example, if they're going to start"}, {"Time_Start": 1014.0, "Time_End": 1018.0, "Text": " blocking cookies by default, no allowing the back for websites."}, {"Time_Start": 1018.0, "Time_End": 1023.0, "Text": " It's not fair to say, well, they're not going to do that because it would violate RFC something or other."}, {"Time_Start": 1023.0, "Time_End": 1031.0, "Text": " You can't whine about how the sensor is not playing fair by implementing a policy,"}, {"Time_Start": 1031.0, "Time_End": 1033.0, "Text": " they will block a lot of legitimate sites."}, {"Time_Start": 1033.0, "Time_End": 1038.0, "Text": " And I'll see people doing this when we discuss this, and they say, well, they'll never block HTPS"}, {"Time_Start": 1038.0, "Time_End": 1039.5, "Text": " because so many sites require it."}, {"Time_Start": 1039.5, "Time_End": 1046.0, "Text": " But the fact is that the software that is implemented to censor pornography and controversial political content"}, {"Time_Start": 1046.0, "Time_End": 1051.2, "Text": " already blocks so many legitimate sites that would actually not be that much of an impact for them"}, {"Time_Start": 1051.2, "Time_End": 1053.7, "Text": " to block HDPS by default."}, {"Time_Start": 1053.7, "Time_End": 1060.7, "Text": " The only rule we're following is that Mallory's, the censored proxy server, has to be useful"}, {"Time_Start": 1060.7, "Time_End": 1063.5, "Text": " to what they consider to be legitimate users."}, {"Time_Start": 1063.5, "Time_End": 1067.9, "Text": " That means that the default policy for websites have to be allowed by use."}, {"Time_Start": 1068.0, "Time_End": 1073.32, "Text": " default and then they only block websites that they know to be malicious. But in order for"}, {"Time_Start": 1073.32, "Time_End": 1078.06, "Text": " Alice to be able to communicate with Bob's website in the first place, they have to have what's"}, {"Time_Start": 1078.06, "Time_End": 1082.76, "Text": " called, the sensors have to have a, what's called a blacklist policy, which means all sites"}, {"Time_Start": 1082.76, "Time_End": 1086.5, "Text": " are allowed by default, and then all these sites on a blacklist get blocked."}, {"Time_Start": 1087.2, "Time_End": 1092.58, "Text": " That's the opposite of a white list policy where all sites are blocked by default and only sites"}, {"Time_Start": 1092.58, "Time_End": 1097.18, "Text": " on the right list get allowed. There are some programs that use this, but they make the internet"}, {"Time_Start": 1097.18, "Time_End": 1101.18, "Text": " it's so useless because there's no way the manufacturer can classify everything."}, {"Time_Start": 1106.18, "Time_End": 1112.18, "Text": " Two theoretical problems are how to communicate data from Alice to Bob's machine."}, {"Time_Start": 1112.18, "Time_End": 1116.18, "Text": " She wants to communicate the URL that she wants to look at."}, {"Time_Start": 1116.18, "Time_End": 1121.18, "Text": " The Bob needs then the reverse direction that information that information from"}, {"Time_Start": 1121.18, "Time_End": 1126.18, "Text": " Bob's machine to Alice has to contain the page contents that she wants to view."}, {"Time_Start": 1126.18, "Time_End": 1128.18, "Text": " that she wants to view."}, {"Time_Start": 1128.18, "Time_End": 1134.68, "Text": " This is just underlying obvious here, but these two problems actually have some theoretical differences."}, {"Time_Start": 1134.68, "Time_End": 1142.18, "Text": " First of all, when Alice needs to communicate her URL request to Bob's machine,"}, {"Time_Start": 1142.18, "Time_End": 1147.68, "Text": " a URL request has to arrive exactly as it was originally stated."}, {"Time_Start": 1147.68, "Time_End": 1152.68, "Text": " If you get even one letter in a URL wrong, then the garble data is useless."}, {"Time_Start": 1152.68, "Time_End": 1154.68, "Text": " You'll usually not get the right page."}, {"Time_Start": 1154.68, "Time_End": 1155.68, "Text": " That's not true, for example."}, {"Time_Start": 1155.68, "Time_End": 1159.68, "Text": " example of getting the page from Bob's machine back to Alice."}, {"Time_Start": 1159.68, "Time_End": 1163.68, "Text": " You can scramble a little and it'll still be useful to the recipient."}, {"Time_Start": 1163.68, "Time_End": 1171.68, "Text": " Also, in stating the problem, you have to decide whether you want Alice's machine just to be able to send a URL request over to Bob"}, {"Time_Start": 1171.68, "Time_End": 1177.68, "Text": " or whether you also want to support other HTTP header information like communicating cookies."}, {"Time_Start": 1177.68, "Time_End": 1180.68, "Text": " What if Alice wants to fill out a post form?"}, {"Time_Start": 1180.68, "Time_End": 1184.68, "Text": " Do you want the protocol to support that kind of information?"}, {"Time_Start": 1184.68, "Time_End": 1188.68, "Text": " because all of that makes it more difficult."}, {"Time_Start": 1192.68, "Time_End": 1195.68, "Text": " Again, like I said, it's different going the other direction"}, {"Time_Start": 1195.68, "Time_End": 1198.68, "Text": " because from a theoretical point of view,"}, {"Time_Start": 1198.68, "Time_End": 1202.68, "Text": " the communication going from Bob's machine back to Alice's machine"}, {"Time_Start": 1202.68, "Time_End": 1207.68, "Text": " has to arrive, or it does not have to arrive exactly as it was sent."}, {"Time_Start": 1207.68, "Time_End": 1211.68, "Text": " It's acceptable if the Bob's machine has to serve the page"}, {"Time_Start": 1211.68, "Time_End": 1213.68, "Text": " back in a way that it might not be recognizable."}, {"Time_Start": 1213.68, "Time_End": 1215.68, "Text": " not be recognizable to the censoring proxies."}, {"Time_Start": 1215.68, "Time_End": 1217.68, "Text": " You're allowed to scramble data or place words,"}, {"Time_Start": 1217.68, "Time_End": 1221.68, "Text": " do things like that, in such a way that the monitors won't detect it."}, {"Time_Start": 1221.68, "Time_End": 1231.68, "Text": " So, assuming now you've got Alice's machine,"}, {"Time_Start": 1231.68, "Time_End": 1237.68, "Text": " and you want to figure out a way to support a way for Alice to send a request to Bob"}, {"Time_Start": 1237.68, "Time_End": 1240.68, "Text": " and for Bob to send the page contents back to Alice."}, {"Time_Start": 1240.68, "Time_End": 1242.68, "Text": " There are two broad, there's a fork and eroded."}, {"Time_Start": 1242.68, "Time_End": 1243.98, "Text": " It's a fork in a road here."}, {"Time_Start": 1244.0800000000002, "Time_End": 1245.88, "Text": " The two broad strategies you can look at."}, {"Time_Start": 1246.22, "Time_End": 1250.8200000000002, "Text": " Either you assume that the only piece of software Alice needs is the browser."}, {"Time_Start": 1251.18, "Time_End": 1255.68, "Text": " And then you use building features of the browser like cookies and HTTP support and JavaScript"}, {"Time_Start": 1255.68, "Time_End": 1258.6200000000001, "Text": " to provide Alice of a way to communicate with Bob."}, {"Time_Start": 1258.92, "Time_End": 1261.6200000000001, "Text": " Obviously that would be preferable because that's a lot easier."}, {"Time_Start": 1261.92, "Time_End": 1267.76, "Text": " You don't have to distribute software to users if there's an upgrade on the server end and the client end"}, {"Time_Start": 1267.76, "Time_End": 1271.72, "Text": " will absorb that upgrade immediately because it's just the browser and so on."}, {"Time_Start": 1272.68, "Time_End": 1278.4, "Text": " way would be you have to distribute software to Alice so that Alice's browser"}, {"Time_Start": 1278.4, "Time_End": 1282.5600000000002, "Text": " communicates with the software and the software sends the request out to Bob's machine"}, {"Time_Start": 1282.5600000000002, "Time_End": 1287.3600000000001, "Text": " and Bob's machine decodes the request and sends data back through the same path."}, {"Time_Start": 1287.3600000000001, "Time_End": 1295.2, "Text": " What we've discovered through this discussion is that it's really not possible to come up"}, {"Time_Start": 1295.2, "Time_End": 1301.92, "Text": " with a satisfactory solution using the easy way, meaning using just the browser on the client"}, {"Time_Start": 1301.92, "Time_End": 1303.2, "Text": " and on Alice's machine."}, {"Time_Start": 1304.28, "Time_End": 1307.54, "Text": " Both of the previously stated problems end up falling apart."}, {"Time_Start": 1307.92, "Time_End": 1313.04, "Text": " There's no way to get the URL request from Alice machine to Bob without it being detected,"}, {"Time_Start": 1313.04, "Time_End": 1316.9, "Text": " and there's no way to get the page contents from Bach back to Alice without the"}, {"Time_Start": 1316.9, "Time_End": 1320.66, "Text": " snooper being able to see where you were looking at, or not being able to see where you're"}, {"Time_Start": 1320.66, "Time_End": 1327.3600000000001, "Text": " looking at, but being able to detect the URA using a circumvention system, which would place Alice"}, {"Time_Start": 1327.3600000000001, "Time_End": 1328.1200000000001, "Text": " in danger."}, {"Time_Start": 1331.92, "Time_End": 1338.5600000000002, "Text": " Specifically, most of the, most of this is sort of a summary of discussions that went"}, {"Time_Start": 1338.5600000000002, "Time_End": 1344.52, "Text": " around and around on the list discussing why ideas that might seem simple at first do not"}, {"Time_Start": 1344.52, "Time_End": 1345.52, "Text": " work."}, {"Time_Start": 1345.52, "Time_End": 1352.16, "Text": " Discussed why if you, there are a lot of the existing sites like anonymizer where you can type"}, {"Time_Start": 1352.16, "Time_End": 1358.26, "Text": " in a URL and hit get, hit go and a site will fetch it for you."}, {"Time_Start": 1358.26, "Time_End": 1361.9, "Text": " The problem of things like this is that it's easy to monitor."}, {"Time_Start": 1361.92, "Time_End": 1366.22, "Text": " get in post data submitted by a browser through form so that you can see if somebody"}, {"Time_Start": 1366.22, "Time_End": 1371.3600000000001, "Text": " typed in HTTP colon slash slash something and it'd be easy for the Chinese government to"}, {"Time_Start": 1371.3600000000001, "Time_End": 1376.02, "Text": " just say monitor for any site that looks like that and assume that it's a way of circumventing our firewall"}, {"Time_Start": 1376.02, "Time_End": 1382.3200000000002, "Text": " and even if you had a design in such a way that the HTTP in the beginning was not necessary"}, {"Time_Start": 1382.3200000000002, "Time_End": 1386.3000000000002, "Text": " it's really easy to spot if somebody's typed a URL into a field on a farm."}, {"Time_Start": 1386.3000000000002, "Time_End": 1391.8000000000002, "Text": " I mean a lot of this all of this seems really trivially obvious but it's a result of going"}, {"Time_Start": 1391.8, "Time_End": 1398.7, "Text": " around in circles for a long time and sort of discussion of how to solve this problem."}, {"Time_Start": 1398.7, "Time_End": 1405.7, "Text": " So when this is pointed out, somebody next said, well, instead of having a single form field"}, {"Time_Start": 1405.7, "Time_End": 1409.8, "Text": " on a browser where you type in the URL, well, let's just have multiple fields next to each"}, {"Time_Start": 1409.8, "Time_End": 1415.7, "Text": " other and you split the URL across those. The problem is, this is a good example"}, {"Time_Start": 1415.7, "Time_End": 1420.7, "Text": " of why steganography is a lot harder than cryptography. It's not that that wouldn't work."}, {"Time_Start": 1420.7, "Time_End": 1429.82, "Text": " It's that you're creating a situation which is rare enough that it would stand out to somebody who's monitoring your communication."}, {"Time_Start": 1430.32, "Time_End": 1436.64, "Text": " What's rare about that is that most forms only contain one field where you can type in text."}, {"Time_Start": 1436.96, "Time_End": 1440.3600000000001, "Text": " And there are lots and lots of exceptions, but that's generally the rule."}, {"Time_Start": 1440.3600000000001, "Time_End": 1450.68, "Text": " And forms where you could, excuse me, forms where you'd be asked to split data across several text fields would stand out to somebody who is monitoring for that type of"}, {"Time_Start": 1450.7, "Time_End": 1455.8, "Text": " of communication. Also, of course, if the, if you published your protocol about how to"}, {"Time_Start": 1455.8, "Time_End": 1460.6000000000001, "Text": " split the, split the data across different form fields, it's easy for the sensor to reverse"}, {"Time_Start": 1460.6000000000001, "Time_End": 1464.1000000000001, "Text": " engineer that and figure out what you're typing in."}, {"Time_Start": 1466.24, "Time_End": 1471.88, "Text": " Of course, so that idea was battered around for a while. It was inevitable that somebody would suggest"}, {"Time_Start": 1471.88, "Time_End": 1477.6200000000001, "Text": " using HCDPS for the communication both ways. Again, the problem is not that this will not work,"}, {"Time_Start": 1477.6200000000001, "Time_End": 1480.68, "Text": " but that it's easy to detect. First of all, it's easy to detect. It's, first of"}, {"Time_Start": 1480.7, "Time_End": 1484.46, "Text": " to detect, because it runs on a different port number from HTTP, obviously."}, {"Time_Start": 1484.46, "Time_End": 1491.7, "Text": " But even just if you ran it on port 80, you can still see the kind of data that people submit back and forth."}, {"Time_Start": 1491.7, "Time_End": 1500.2, "Text": " It's so obviously encrypted that it would be trivial for somebody to monitor for when you are using HTTPS and block it by default."}, {"Time_Start": 1500.2, "Time_End": 1510.2, "Text": " That would probably be the consequence of doing something like this is, like I said, sensors would start blocking HTTP for all sites and only allowing it for sites like Amazon.com."}, {"Time_Start": 1510.2, "Time_End": 1512.96, "Text": " that can actually have a legitimate use for it."}, {"Time_Start": 1519.7, "Time_End": 1524.98, "Text": " Somebody, the ideas that we're progressing through here, they get cooler and cooler, but they still"}, {"Time_Start": 1524.98, "Time_End": 1526.32, "Text": " do not really solve the problem."}, {"Time_Start": 1526.96, "Time_End": 1533.66, "Text": " Again, I was talking about earlier, if you type a URL into a form and then click a button"}, {"Time_Start": 1533.66, "Time_End": 1539.06, "Text": " that executes some JavaScript code on that form to scramble the URL's contents and then submit"}, {"Time_Start": 1539.06, "Time_End": 1539.6200000000001, "Text": " the form."}, {"Time_Start": 1540.2, "Time_End": 1545.2, "Text": " The person monitoring the traffic that goes over the wire will never actually see the URL that you typed in."}, {"Time_Start": 1545.2, "Time_End": 1547.2, "Text": " They'll only see the scrambled version of it."}, {"Time_Start": 1547.2, "Time_End": 1556.2, "Text": " But the problem is that you'd have to publish pages that had that JavaScript code on it to do the conversion of the scrambling of the algorithm."}, {"Time_Start": 1556.2, "Time_End": 1562.2, "Text": " And what the sensors could do is obviously they can monitor for any pages that have that specific code on it."}, {"Time_Start": 1562.2, "Time_End": 1566.2, "Text": " And when they see that, they know what you're doing and then they block the page."}, {"Time_Start": 1566.2, "Time_End": 1570.18, "Text": " This inspired the next suggestion, which is also"}, {"Time_Start": 1570.2, "Time_End": 1575.2, "Text": " also really cool and still doesn't solve the problem. Polymorphic JavaScript."}, {"Time_Start": 1575.2, "Time_End": 1584.2, "Text": " Polymorphism refers to a type of code that virus writers usually use to make the viruses"}, {"Time_Start": 1584.2, "Time_End": 1588.2, "Text": " unrecognizable to software that scans for it."}, {"Time_Start": 1588.2, "Time_End": 1594.2, "Text": " The idea is that polymorphic code, the specific instructions, the shape or the form of the code will change,"}, {"Time_Start": 1594.2, "Time_End": 1600.18, "Text": " but the logical effect of the code stays the same. So it modifies itself in ways that don't"}, {"Time_Start": 1600.2, "Time_End": 1607.2, "Text": " affect the output of the code, but it still wants the same way."}, {"Time_Start": 1607.2, "Time_End": 1612.2, "Text": " And the problem with this is writing polymorphic code is really difficult."}, {"Time_Start": 1612.2, "Time_End": 1617.2, "Text": " And if you want, the fact is that even if you change just a few variable names and stuff like that,"}, {"Time_Start": 1617.2, "Time_End": 1622.2, "Text": " it would still be possible for the censoring proxy to detect the shape of your JavaScript code"}, {"Time_Start": 1622.2, "Time_End": 1624.2, "Text": " when it sees it on the page."}, {"Time_Start": 1624.2, "Time_End": 1629.2, "Text": " If they know exactly what to look for and they know the algorithm that you're using to generate the code,"}, {"Time_Start": 1629.2, "Time_End": 1634.2, "Text": " to generate the code, it is not actually that difficult to write."}, {"Time_Start": 1634.2, "Time_End": 1640.2, "Text": " Simple ProScript that will recognize pages generated for that code, even if the code looks a little bit different every time."}, {"Time_Start": 1640.2, "Time_End": 1646.2, "Text": " Also, this is something where I mentioned earlier, that if the sensors don't have the processing power"}, {"Time_Start": 1646.2, "Time_End": 1651.2, "Text": " to do certain types of audits on every single page that every user looks at,"}, {"Time_Start": 1651.2, "Time_End": 1658.2, "Text": " but if they focus on a certain portion of their user audience and just do very process or intensive monitoring on them,"}, {"Time_Start": 1658.2, "Time_End": 1665.2, "Text": " on them, they could actually do things like parse the JavaScript code on a page viewed by a certain user"}, {"Time_Start": 1665.2, "Time_End": 1672.2, "Text": " and determine whether or not this code is executing, is a polymorphic version of the JavaScript"}, {"Time_Start": 1672.2, "Time_End": 1675.2, "Text": " that can be used to circumvent our site."}, {"Time_Start": 1675.2, "Time_End": 1679.2, "Text": " So, another idea."}, {"Time_Start": 1679.2, "Time_End": 1680.2, "Text": " I'm gone."}, {"Time_Start": 1680.2, "Time_End": 1687.2, "Text": " Those were all discussing weaknesses in the problem of transmitting the URL from Alice's machine."}, {"Time_Start": 1687.2, "Time_End": 1696.2, "Text": " his machine to Bob. The other problem is how do you get the page contents of the page Alice wants to view from Bob's machine back to Alice."}, {"Time_Start": 1696.2, "Time_End": 1700.2, "Text": " Again, there was the HCDPS idea."}, {"Time_Start": 1700.2, "Time_End": 1703.2, "Text": " We'll already explain it what happened if people use that. It would start getting blocked by default."}, {"Time_Start": 1703.2, "Time_End": 1705.2, "Text": " It is too easy to detect."}, {"Time_Start": 1709.2, "Time_End": 1717.18, "Text": " Somebody had also suggested you could send, when Bob's machine communicates back to Alice, you could send back a page that is structured"}, {"Time_Start": 1717.2, "Time_End": 1722.46, "Text": " in such a way so that JavaScript code on the page writes out, like document."}, {"Time_Start": 1722.46, "Time_End": 1726.48, "Text": " .write calls, it's a JavaScript function that will actually write out the entire contents"}, {"Time_Start": 1726.48, "Time_End": 1728.7, "Text": " of the page that Alice wants to view."}, {"Time_Start": 1728.7, "Time_End": 1735.3400000000001, "Text": " That means that the actual literal text of the page will not be visible to the censoring proxy"}, {"Time_Start": 1735.3400000000001, "Time_End": 1741.14, "Text": " server monitoring that stuff, but still you've got the problem that JavaScript code and pages that"}, {"Time_Start": 1741.14, "Time_End": 1746.06, "Text": " consist only of JavaScript that writes the entire page, those are also very easy to detect"}, {"Time_Start": 1746.06, "Time_End": 1750.3999999999999, "Text": " and it was another idea put forward I think by someone who"}, {"Time_Start": 1750.3999999999999, "Time_End": 1755.1, "Text": " I got the feeling that people were not really applying a lot of"}, {"Time_Start": 1755.1, "Time_End": 1759.1, "Text": " you know trying to attack their own ideas very very carefully"}, {"Time_Start": 1759.1, "Time_End": 1761.6599999999999, "Text": " when they were suggesting this kind of stuff because a lot of it"}, {"Time_Start": 1761.6599999999999, "Time_End": 1765.6599999999999, "Text": " it only took a moment's reflection to see why it would be too easy to detect"}, {"Time_Start": 1765.6599999999999, "Time_End": 1768.36, "Text": " and why it would not work I think people get into habits"}, {"Time_Start": 1768.36, "Time_End": 1772.06, "Text": " thinking about problems from any cryptographic point of view"}, {"Time_Start": 1772.06, "Time_End": 1775.06, "Text": " where you only have to be secure against people breaking it"}, {"Time_Start": 1775.06, "Time_End": 1781.3, "Text": " and the problems where you have to be secure against people detecting that you're using a protocol are different."}, {"Time_Start": 1783.3, "Time_End": 1791.74, "Text": " Next idea that came up, how about sending the page back to the user so there was scrambled in a certain way where the letter"}, {"Time_Start": 1791.74, "Time_End": 1797.62, "Text": " S replaced with a dollar sign, for example. This would be useful if the censoring proxy was monitoring"}, {"Time_Start": 1797.62, "Time_End": 1803.12, "Text": " for specific pages that you're viewing. Not being able to detect, Alice Community,"}, {"Time_Start": 1803.12, "Time_End": 1805.04, "Text": " who came with Bob, but they look at the contents of that."}, {"Time_Start": 1805.06, "Time_End": 1810.6599999999999, "Text": " pages that Alice is viewing and say if the proxy blocks CNN.com, which they actually"}, {"Time_Start": 1810.6599999999999, "Time_End": 1817.06, "Text": " do in China, what you would do is the censoring proxy would just keep a cached copy of CNN.com"}, {"Time_Start": 1817.06, "Time_End": 1823.56, "Text": " refreshed every day. And then every time Alice views a page, look at the contents of that page and see if it's"}, {"Time_Start": 1823.56, "Time_End": 1829.54, "Text": " identical to CNN.com. And then if it is, then you know that Alice is using some service to circumvent"}, {"Time_Start": 1829.54, "Time_End": 1835.04, "Text": " the Chinese firewall and view banned content. So this is the idea that somebody pulled"}, {"Time_Start": 1835.06, "Time_End": 1839.06, "Text": " to prevent against that was scramble the page in such a way that it is not,"}, {"Time_Start": 1839.06, "Time_End": 1843.06, "Text": " it's not recognizable to the, to the sensor."}, {"Time_Start": 1843.06, "Time_End": 1851.06, "Text": " The problem is that if you scramble in such a way that people can still recognize the text,"}, {"Time_Start": 1851.06, "Time_End": 1857.06, "Text": " then the censoring proxy can perform the reverse of the process and determine what the original page was."}, {"Time_Start": 1857.06, "Time_End": 1861.06, "Text": " Obviously, anything that's just scrambled by replacing S's with dollar signs,"}, {"Time_Start": 1861.06, "Time_End": 1864.56, "Text": " censoring proxy, you can compare that to the known plain text of a bad side."}, {"Time_Start": 1864.56, "Time_End": 1866.1, "Text": " and still make the comparison."}, {"Time_Start": 1866.6, "Time_End": 1872.96, "Text": " It doesn't help if you add randomness to the process, say that's such that only half of the Ss"}, {"Time_Start": 1872.96, "Time_End": 1877.76, "Text": " get replaced with dollar signs so that the censoring proxy doesn't have an exact page"}, {"Time_Start": 1877.76, "Time_End": 1884.26, "Text": " that it's monitoring for, but it just looks, it can still match the scrambled version of the page"}, {"Time_Start": 1884.26, "Time_End": 1886.1599999999999, "Text": " easily against the original version."}, {"Time_Start": 1886.54, "Time_End": 1892.3, "Text": " The problem is that you can only mangle the text on a page so much before it becomes unreadable"}, {"Time_Start": 1892.3, "Time_End": 1893.72, "Text": " to a human being as well."}, {"Time_Start": 1893.72, "Time_End": 1897.96, "Text": " Even if you start switching around letters and words and stuff, soon it becomes beyond,"}, {"Time_Start": 1898.48, "Time_End": 1900.76, "Text": " it reaches the point where humans can't recognize it either."}, {"Time_Start": 1901.26, "Time_End": 1907.18, "Text": " And in general, from an AI point of view, the problem is if the human reading the page"}, {"Time_Start": 1907.18, "Time_End": 1909.92, "Text": " can still recognize the original text and the meaning of it,"}, {"Time_Start": 1910.38, "Time_End": 1914.26, "Text": " the proxy server can still look at a copy of the page"}, {"Time_Start": 1914.26, "Time_End": 1919.06, "Text": " and match it against the known playtext of the page that is blocked."}, {"Time_Start": 1923.72, "Time_End": 1929.82, "Text": " Somebody else came up with another idea."}, {"Time_Start": 1929.94, "Time_End": 1937.2, "Text": " Well, how can you instead of just send the page back to the user by taking the text on the page"}, {"Time_Start": 1937.2, "Time_End": 1941.14, "Text": " and bearing it in a very large image and setting that back to the user?"}, {"Time_Start": 1942.56, "Time_End": 1946.14, "Text": " Well, okay, so is OCR really something to worry about?"}, {"Time_Start": 1946.26, "Time_End": 1953.66, "Text": " They obviously do not have time to form OCR on every page, on every image of every page viewed by a"}, {"Time_Start": 1953.72, "Time_End": 1960.18, "Text": " in China. But again, we're talking about, remember, the increasing speed of computing"}, {"Time_Start": 1960.18, "Time_End": 1965.6200000000001, "Text": " power is increasing faster than the online population, which means that they'll have exponentially"}, {"Time_Start": 1965.6200000000001, "Time_End": 1972.66, "Text": " more and more computing power devoted to auditing each user. More importantly, they can select"}, {"Time_Start": 1972.66, "Time_End": 1978.02, "Text": " a subset of users that they want to monitor, and anything that is computationally feasible, like"}, {"Time_Start": 1978.02, "Time_End": 1983.7, "Text": " OCR is, could be done if they really cared enough. You also have the problem that any time you"}, {"Time_Start": 1983.72, "Time_End": 1988.6000000000001, "Text": " We have human beings who are devoting resources to monitoring the pages being viewed"}, {"Time_Start": 1988.6000000000001, "Time_End": 1990.22, "Text": " by specific users."}, {"Time_Start": 1990.22, "Time_End": 1992.08, "Text": " Obviously, this would not be secure against that."}, {"Time_Start": 1992.08, "Time_End": 1994.44, "Text": " They can look at the image and tell what you were doing."}, {"Time_Start": 1994.44, "Time_End": 2007.32, "Text": " So, and of course, using large images like that would be a lot slower from the user's point of view and would not be a big enough gain to make up for the performance that that would cause."}, {"Time_Start": 2013.72, "Time_End": 2027.72, "Text": " So that segment was all explaining why it does not work to rely on built-in features of the browser to decode the communication being sent to back to Alice from Bob's machine."}, {"Time_Start": 2027.72, "Time_End": 2036.72, "Text": " What you need to do is you need to have a program running on Alice's machine that can do the decoding of the data being sent back from Bob."}, {"Time_Start": 2036.72, "Time_End": 2042.72, "Text": " That would be like a miniature proxy server that Alice runs on her computer and then she sets her browser to use that miniature proxy."}, {"Time_Start": 2042.72, "Time_End": 2044.64, "Text": " miniature proxy is the proxy server."}, {"Time_Start": 2044.64, "Time_End": 2048.88, "Text": " And the proxy server implements this protocol that we're trying to design here"}, {"Time_Start": 2048.88, "Time_End": 2052.62, "Text": " and communicates with Bob's machine outside of China"}, {"Time_Start": 2052.62, "Time_End": 2057.02, "Text": " and sends data back and forth in such a way that somebody monitoring the data stream"}, {"Time_Start": 2057.02, "Time_End": 2059.2200000000003, "Text": " can't tell they're doing anything suspicious."}, {"Time_Start": 2065.12, "Time_End": 2071.06, "Text": " Again, the two separate problems are how to get the data in the URL request from Alice to Bob"}, {"Time_Start": 2071.06, "Time_End": 2072.62, "Text": " and how to get the page content."}, {"Time_Start": 2072.7200000000003, "Time_End": 2073.9800000000005, "Text": " from Bob back to Alice."}, {"Time_Start": 2074.5000000000005, "Time_End": 2078.34, "Text": " And the protocol that we're working on designing"}, {"Time_Start": 2078.34, "Time_End": 2081.2400000000002, "Text": " actually takes care of both of these problems in such a way"}, {"Time_Start": 2081.2400000000002, "Time_End": 2083.84, "Text": " that depending on the level of security, you want,"}, {"Time_Start": 2084.28, "Time_End": 2089.1200000000003, "Text": " in the first version, a software program monitoring the communication"}, {"Time_Start": 2089.1200000000003, "Time_End": 2090.5600000000004, "Text": " would not be able to spot anything."}, {"Time_Start": 2090.94, "Time_End": 2094.3, "Text": " And if you want to be really, really secure, you can even get it so that a human being"}, {"Time_Start": 2094.3, "Time_End": 2097.7000000000003, "Text": " monitoring the communication stream would not notice anything suspicious."}, {"Time_Start": 2102.7200000000003, "Time_End": 2108.0600000000004, "Text": " The main problem is that URL requests going from Alistabob how to have to be disguised"}, {"Time_Start": 2108.0600000000004, "Time_End": 2112.1600000000003, "Text": " as the kind of web surfing traffic that a normal user would engage in."}, {"Time_Start": 2112.7000000000003, "Time_End": 2119.76, "Text": " Three types of things mainly that a web surfer would do would be you type in URLs that are not"}, {"Time_Start": 2119.76, "Time_End": 2124.44, "Text": " linked from a page you previously viewed, or you click on a link from the page that you're"}, {"Time_Start": 2124.44, "Time_End": 2127.9800000000005, "Text": " currently viewing, or you fill out of form to submit data."}, {"Time_Start": 2128.5600000000004, "Time_End": 2132.7000000000003, "Text": " Now, the next step is explaining why, looking at,"}, {"Time_Start": 2132.7200000000003, "Time_End": 2139.42, "Text": " looking at web traffic in terms of those three activities, why it does not work to use long"}, {"Time_Start": 2139.42, "Time_End": 2144.0600000000004, "Text": " and garbled URLs to transmit to transmit data from Alice's machine to Bob."}, {"Time_Start": 2144.28, "Time_End": 2146.5600000000004, "Text": " That's a very common proposed solution to the problem."}, {"Time_Start": 2147.0000000000005, "Time_End": 2151.6000000000004, "Text": " Look, if you look through your server log files, you'll see that people access URLs all the"}, {"Time_Start": 2151.6000000000004, "Time_End": 2153.6600000000003, "Text": " time that have 100 characters in them or more."}, {"Time_Start": 2153.6600000000003, "Time_End": 2159.36, "Text": " So let's just use, excuse me, let's just use some of these long and random looking URLs"}, {"Time_Start": 2159.36, "Time_End": 2162.7000000000003, "Text": " to transmit data from from Alice's machine."}, {"Time_Start": 2162.7200000000003, "Time_End": 2167.88, "Text": " to Bob and nobody will ever notice any difference and then Bob's machine"}, {"Time_Start": 2167.88, "Time_End": 2172.2000000000003, "Text": " which is using the same protocol can receive these URL requests and decode them to"}, {"Time_Start": 2172.2000000000003, "Time_End": 2178.5000000000005, "Text": " get the original data back. The reason that doesn't work is that during"}, {"Time_Start": 2178.5000000000005, "Time_End": 2184.2000000000003, "Text": " normal web surfing a user does not generally access those long and random"}, {"Time_Start": 2184.2000000000003, "Time_End": 2188.6400000000003, "Text": " looking URLs unless those URLs were linked from a page that was being viewed"}, {"Time_Start": 2188.6400000000003, "Time_End": 2192.7000000000003, "Text": " immediately prior to that by the same user and"}, {"Time_Start": 2192.7200000000003, "Time_End": 2197.1600000000003, "Text": " And we're assuming that the censoring proxy can track web surfing traffic on"}, {"Time_Start": 2197.1600000000003, "Time_End": 2198.9, "Text": " a per user basis."}, {"Time_Start": 2198.9, "Time_End": 2205.0000000000005, "Text": " That means if you're looking at a page that has a bunch of 100 character URLs on them, and if"}, {"Time_Start": 2205.0000000000005, "Time_End": 2209.1600000000003, "Text": " you click on one of those links and then go to that next page, that does not look suspicious"}, {"Time_Start": 2209.1600000000003, "Time_End": 2212.78, "Text": " to a sensor monitoring the traffic."}, {"Time_Start": 2212.78, "Time_End": 2219.28, "Text": " But if the next URL that you access is a 100 character URL that is not linked from"}, {"Time_Start": 2219.28, "Time_End": 2222.7000000000003, "Text": " the page you're currently viewing, then that gets flagged as suspicious."}, {"Time_Start": 2222.7200000000003, "Time_End": 2224.4800000000005, "Text": " by the people monitoring the traffic."}, {"Time_Start": 2224.82, "Time_End": 2228.4800000000005, "Text": " You won't necessarily block that URL because it can happen."}, {"Time_Start": 2228.6200000000003, "Time_End": 2232.32, "Text": " Somebody could be typing in something for their bookmarks list or an URL that somebody"}, {"Time_Start": 2232.32, "Time_End": 2233.0000000000005, "Text": " emailed them."}, {"Time_Start": 2233.0000000000005, "Time_End": 2239.1400000000003, "Text": " But that would be flagged as suspicious and if it happens over and over again, then you've"}, {"Time_Start": 2239.1400000000003, "Time_End": 2243.5800000000004, "Text": " got a profile in a particular user that you think might be trying to circumvent your system."}, {"Time_Start": 2246.1200000000003, "Time_End": 2251.82, "Text": " So to guard against this, what the censoring proxy would end up doing was they would maintain"}, {"Time_Start": 2251.82, "Time_End": 2256.6600000000003, "Text": " on a per user basis a list of links that the user is currently allowed to access"}, {"Time_Start": 2256.6600000000003, "Time_End": 2258.06, "Text": " about looking suspicious."}, {"Time_Start": 2258.06, "Time_End": 2263.82, "Text": " That would include links that are linked from the page they're currently viewing links that are"}, {"Time_Start": 2263.82, "Time_End": 2269.1400000000003, "Text": " created on the page by JavaScript code executing a lot of links are dynamically created every"}, {"Time_Start": 2269.1400000000003, "Time_End": 2276.32, "Text": " time you load the page or links that are URLs that you could access as a result of filling out"}, {"Time_Start": 2276.32, "Time_End": 2277.5, "Text": " a form on the page."}, {"Time_Start": 2277.5, "Time_End": 2281.8, "Text": " What happens when you fill out a form is that for a get form,"}, {"Time_Start": 2281.82, "Time_End": 2285.82, "Text": " the data that you enter and the fields on the form would get moved into the URL."}, {"Time_Start": 2285.82, "Time_End": 2294.82, "Text": " So the software monitor in your web traffic would scan for forms on pages that you load."}, {"Time_Start": 2294.82, "Time_End": 2298.82, "Text": " And then any URL that could be constructed out of that form would be okay."}, {"Time_Start": 2298.82, "Time_End": 2304.82, "Text": " But any other long URL that wasn't in that format would be considered a suspicious-looking traffic."}, {"Time_Start": 2304.82, "Time_End": 2311.8, "Text": " So this imposes a real bottleneck and how much information"}, {"Time_Start": 2311.82, "Time_End": 2315.02, "Text": " you can submit through a form."}, {"Time_Start": 2315.02, "Time_End": 2320.32, "Text": " If you have, if the user is filling out a form, then the form has a hidden field in it."}, {"Time_Start": 2320.32, "Time_End": 2326.02, "Text": " Then when the user submits that form, the value of the hidden field should be the same as whatever"}, {"Time_Start": 2326.02, "Time_End": 2327.1200000000003, "Text": " is set by the website."}, {"Time_Start": 2327.1200000000003, "Time_End": 2332.82, "Text": " I'm assuming a little bit of knowledge of HTML and forms here, which I don't really have time to explain."}, {"Time_Start": 2332.82, "Time_End": 2339.32, "Text": " But if you know how to design a form on a web page, speaking of stuff that CDC doesn't know how to do."}, {"Time_Start": 2339.32, "Time_End": 2340.82, "Text": " Who's your URL here?"}, {"Time_Start": 2340.82, "Time_End": 2346.82, "Text": " If you know how to design a form on a web page,"}, {"Time_Start": 2346.82, "Time_End": 2350.82, "Text": " if you set a value of a hidden field in the form, when the user submits the form,"}, {"Time_Start": 2350.82, "Time_End": 2354.82, "Text": " the value of that hidden field has to be the same as what you set for them."}, {"Time_Start": 2354.82, "Time_End": 2360.82, "Text": " Otherwise, they will give themselves away as doing something out of the ordinary."}, {"Time_Start": 2360.82, "Time_End": 2365.82, "Text": " If you have a drop-down list on the form that has eight choices,"}, {"Time_Start": 2365.82, "Time_End": 2369.82, "Text": " then the user can only submit three bits of information by making one of the"}, {"Time_Start": 2369.82, "Time_End": 2371.82, "Text": " by making one of those eight choices."}, {"Time_Start": 2371.82, "Time_End": 2374.82, "Text": " So it's not an efficient way for Alice to communicate with Bob"}, {"Time_Start": 2374.82, "Time_End": 2378.82, "Text": " by submitting a form over and over again and making choices on a drop-down list."}, {"Time_Start": 2378.82, "Time_End": 2382.82, "Text": " If each time you make a choice, you can only communicate three bits of information."}, {"Time_Start": 2382.82, "Time_End": 2390.82, "Text": " If you have a text field on a form, then you have the opportunity to submit more bits of information."}, {"Time_Start": 2390.82, "Time_End": 2393.82, "Text": " It's a variable amount of information that can go in a text field."}, {"Time_Start": 2393.82, "Time_End": 2398.82, "Text": " The problem is that the sensor and proxy could adopt a policy where if you submit two more"}, {"Time_Start": 2398.82, "Time_End": 2405.82, "Text": " If you submit too much text in a form, then that is considered suspicious traffic that possibly could be used to circumvent our system."}, {"Time_Start": 2405.82, "Time_End": 2412.82, "Text": " So they're going to implement a policy where any form that has more than a certain number of characters in it will get blocked by default."}, {"Time_Start": 2412.82, "Time_End": 2421.82, "Text": " But then websites which need that functionality to work, like Hotmail.com, you will be allowed to submit forms at sites like that."}, {"Time_Start": 2421.82, "Time_End": 2427.82, "Text": " But any other site, you will not be allowed to submit more than a certain amount of information through a form,"}, {"Time_Start": 2427.82, "Time_End": 2432.82, "Text": " because otherwise that would be considered suspicious traffic that might be used to get around the proxy."}, {"Time_Start": 2436.82, "Time_End": 2446.82, "Text": " So the solution to getting information from Alice to Bob is that Alice's machine has this miniature proxy server installed."}, {"Time_Start": 2446.82, "Time_End": 2452.82, "Text": " Alice types of requests into her web browser for a site that the Chinese government bans."}, {"Time_Start": 2452.82, "Time_End": 2456.82, "Text": " The web browser would talk to the software installed on Alice's machine saying,"}, {"Time_Start": 2456.82, "Time_End": 2461.82, "Text": " saying we want to format a request for www.c.com."}, {"Time_Start": 2461.82, "Time_End": 2466.82, "Text": " And then the miniature proxy server analysis machine would take the data in the request,"}, {"Time_Start": 2466.82, "Time_End": 2476.82, "Text": " www.cNum.com, and convert it into some sort of text query that could be entered in a form on a web page without looking too suspicious."}, {"Time_Start": 2476.82, "Time_End": 2483.82, "Text": " That text query would go out over the wire to Bob's machine somewhere in the States."}, {"Time_Start": 2483.82, "Time_End": 2486.8, "Text": " And then the only thing that the people monitoring the track"}, {"Time_Start": 2486.82, "Time_End": 2492.82, "Text": " would see was they would see a text query going from from Alice to Bob and they"}, {"Time_Start": 2492.82, "Time_End": 2496.82, "Text": " wouldn't obviously would not know anything about what that career represents"}, {"Time_Start": 2496.82, "Time_End": 2501.82, "Text": " because they wouldn't have Bob's secret encryption key so they wouldn't know the"}, {"Time_Start": 2501.82, "Time_End": 2504.82, "Text": " URL that Alice was requesting."}, {"Time_Start": 2504.82, "Time_End": 2509.82, "Text": " Or more importantly, not only would they not know what Alice is requesting, but they would not notice"}, {"Time_Start": 2509.82, "Time_End": 2512.82, "Text": " that they wouldn't know she was requesting anything at all."}, {"Time_Start": 2512.82, "Time_End": 2515.82, "Text": " It would look like a completely innocent communication."}, {"Time_Start": 2515.82, "Time_End": 2521.1000000000004, "Text": " innocent communication. The problem is that if you have too much, if the censoring"}, {"Time_Start": 2521.1000000000004, "Time_End": 2525.82, "Text": " proxy is imposing a limit on how much data you can submit through a form, so what happens is"}, {"Time_Start": 2525.82, "Time_End": 2531.26, "Text": " if you have a URL request that has, if you break it up into multiple parts, it's too big"}, {"Time_Start": 2531.26, "Time_End": 2537.6200000000003, "Text": " to fit into one text query, so you have to break it up into multiple resubmissions on the same page."}, {"Time_Start": 2537.6200000000003, "Time_End": 2542.5800000000004, "Text": " That is something that you want to avoid because if you wanted to do that, you would have"}, {"Time_Start": 2542.5800000000004, "Time_End": 2545.8, "Text": " to make sure that between each, each time you submit, you submit, that is something that you would have to avoid"}, {"Time_Start": 2545.82, "Time_End": 2552.82, "Text": " a request, you would have to pause for a few seconds because to anybody monitoring the traffic, you want to look like a real user."}, {"Time_Start": 2552.82, "Time_End": 2561.82, "Text": " And a real user submitting text at a query page would not submit a bunch of queries with a 0.1 second pause between them."}, {"Time_Start": 2561.82, "Time_End": 2566.82, "Text": " They would submit something, wait a few seconds, look at the results, submit something again."}, {"Time_Start": 2566.82, "Time_End": 2574.82, "Text": " So that creates a delay that's going to be a real problem if you have so much data that you're going to have to break it up over."}, {"Time_Start": 2574.82, "Time_End": 2578.82, "Text": " over multiple text queries in order not to get detected."}, {"Time_Start": 2578.82, "Time_End": 2602.82, "Text": " So, still one thing we didn't explain was how to convert the text, how to convert the URL request that Alice wants to send into a text query that can go out over the wire to Bob's machine and not look suspicious to somebody monitoring the traffic."}, {"Time_Start": 2602.82, "Time_End": 2609.82, "Text": " You can use an algorithm that maps bits to letters or something like that."}, {"Time_Start": 2609.82, "Time_End": 2617.82, "Text": " The problem is if your text query ends up consisting entirely of non-English words, or in the case of China, non-Chinese words or whatever, it's going to look."}, {"Time_Start": 2617.82, "Time_End": 2629.82, "Text": " That is also going to look suspicious to somebody monitoring the traffic, so you'll have to have a certain mix of English words in the query just so that it doesn't set off any red flags to people monitoring you."}, {"Time_Start": 2629.82, "Time_End": 2632.8, "Text": " Also, what is meant by a query that doesn't..."}, {"Time_Start": 2632.82, "Time_End": 2639.82, "Text": " look suspicious or not. If it's just a machine that the sensors are using to monitor traffic,"}, {"Time_Start": 2639.82, "Time_End": 2644.82, "Text": " then there are certain combinations of words that would not look suspicious to a machine, but if it was an actual"}, {"Time_Start": 2644.82, "Time_End": 2650.82, "Text": " human being monitoring you, then you have anything that looks like a random words jumbled together"}, {"Time_Start": 2650.82, "Time_End": 2657.82, "Text": " might be a tip off to a human monitoring you that you were using some kind of system to circumvent their policy."}, {"Time_Start": 2662.82, "Time_End": 2683.82, "Text": " And again, the second problem is how should you get the pages from Bob's machine back to Alice's machine in such a way that they look like real web pages, and they also have to not resemble the original web pages that Alice is actually requesting, because we assume the censoring proxy can compare the pages against the known text on a band site in order to recognize it."}, {"Time_Start": 2684.82, "Time_End": 2692.8, "Text": " You should not rely on the censoring proxy, taking the pages as served back from Bob's machine, and not modify."}, {"Time_Start": 2692.82, "Time_End": 2693.82, "Text": " them."}, {"Time_Start": 2693.82, "Time_End": 2701.82, "Text": " If you assume that the contents on Bob's machine will be returned exactly, and your protocol relies on that,"}, {"Time_Start": 2701.82, "Time_End": 2705.82, "Text": " then all of the sensors are going to start doing is they'll add an extra character at the end of every page or something,"}, {"Time_Start": 2705.82, "Time_End": 2708.82, "Text": " and then that will no longer be a valid assumption."}, {"Time_Start": 2708.82, "Time_End": 2712.82, "Text": " And also explain why you should not rely on cookies or HTTP or things like that,"}, {"Time_Start": 2712.82, "Time_End": 2715.82, "Text": " which the sensors could block very easily."}, {"Time_Start": 2715.82, "Time_End": 2721.82, "Text": " A couple of things that people came up with."}, {"Time_Start": 2721.82, "Time_End": 2728.82, "Text": " with use the least significant bit of an image data in an image to hide information."}, {"Time_Start": 2728.82, "Time_End": 2733.82, "Text": " Bob's machine would take the data, wants to send back to Alice, hide it inside an image,"}, {"Time_Start": 2733.82, "Time_End": 2738.82, "Text": " send the image back to Alice as part of a web page, and Alice's machine would receive the image"}, {"Time_Start": 2738.82, "Time_End": 2744.82, "Text": " and her proxy server would decode the image data and serve Alice the page that she wants to look at."}, {"Time_Start": 2744.82, "Time_End": 2750.82, "Text": " The problem with that is anything that relies on noise in a communication stream has a problem."}, {"Time_Start": 2750.82, "Time_End": 2756.82, "Text": " stream has a problem from a steganography point of view because the sensor could"}, {"Time_Start": 2756.82, "Time_End": 2762.82, "Text": " could introduce more noise into your stream in such a way that if they don't want to make"}, {"Time_Start": 2762.82, "Time_End": 2767.82, "Text": " the service inconvenient to legitimate users, so they don't want to introduce too much noise"}, {"Time_Start": 2767.82, "Time_End": 2771.82, "Text": " into an image that is not already have static in it."}, {"Time_Start": 2771.82, "Time_End": 2776.82, "Text": " But if they detect static in an image that is being served back, they can say, well, it's either"}, {"Time_Start": 2776.82, "Time_End": 2779.82, "Text": " an image that has real static in it, in which case we can introduce them more."}, {"Time_Start": 2779.82, "Time_End": 2781.82, "Text": " introduce some more and it won't matter."}, {"Time_Start": 2781.82, "Time_End": 2785.82, "Text": " Or it's an image that is being used by somebody trying to circumvent our system,"}, {"Time_Start": 2785.82, "Time_End": 2791.82, "Text": " in which case we can put in some more noise and it will then disrupt the communication stream."}, {"Time_Start": 2791.82, "Time_End": 2795.82, "Text": " So that was another idea that came to everybody about the same time,"}, {"Time_Start": 2795.82, "Time_End": 2799.82, "Text": " but also has problems which means we had to reject it."}, {"Time_Start": 2799.82, "Time_End": 2801.82, "Text": " Something else."}, {"Time_Start": 2801.82, "Time_End": 2805.82, "Text": " This is another lies on a different kind of noise stream."}, {"Time_Start": 2805.82, "Time_End": 2809.8, "Text": " You could, when Bob sends the pages back to Alice, you could"}, {"Time_Start": 2809.82, "Time_End": 2816.82, "Text": " could take the pages in the source code of the page, replace a character with"}, {"Time_Start": 2816.82, "Time_End": 2821.82, "Text": " ampersand followed by the hexadecimal code for that character, followed by a semicolon."}, {"Time_Start": 2821.82, "Time_End": 2825.82, "Text": " Then that actually causes the page to be displayed the same way in the browser,"}, {"Time_Start": 2825.82, "Time_End": 2829.82, "Text": " but Alice and Bob could agree on some system where, like, if I have the regular character,"}, {"Time_Start": 2829.82, "Time_End": 2834.82, "Text": " it's a zero, if I have this funky encryption character, it's a one, and we can use that to send"}, {"Time_Start": 2834.82, "Time_End": 2839.8, "Text": " zeros and ones back and forth. Again, you have the problem that..."}, {"Time_Start": 2839.82, "Time_End": 2844.82, "Text": " the sensor can modify pages there being sent back"}, {"Time_Start": 2844.82, "Time_End": 2849.82, "Text": " and could just take everything with an ampersand hexadecimal code semicolon"}, {"Time_Start": 2849.82, "Time_End": 2852.82, "Text": " and replace it with the actual corresponding character."}, {"Time_Start": 2852.82, "Time_End": 2858.82, "Text": " So anything that relies on that channel to communicate will be disrupted."}, {"Time_Start": 2858.82, "Time_End": 2861.82, "Text": " Why are these both mentioned back to back?"}, {"Time_Start": 2861.82, "Time_End": 2866.82, "Text": " Because they actually are similar problems in a non-obvious way."}, {"Time_Start": 2866.82, "Time_End": 2868.82, "Text": " They both rely on"}, {"Time_Start": 2868.82, "Time_End": 2873.82, "Text": " noise which means data that is normally insignificant."}, {"Time_Start": 2873.82, "Time_End": 2878.82, "Text": " The noise in an image is normally not something the user doesn't care about and"}, {"Time_Start": 2878.82, "Time_End": 2883.82, "Text": " the status of characters on a web page in the source code is also something the"}, {"Time_Start": 2883.82, "Time_End": 2885.82, "Text": " user doesn't care about."}, {"Time_Start": 2885.82, "Time_End": 2891.82, "Text": " So in both cases you can't rely on those channels to communicate information."}, {"Time_Start": 2891.82, "Time_End": 2896.82, "Text": " Excuse me."}, {"Time_Start": 2896.82, "Time_End": 2897.82, "Text": " Better."}, {"Time_Start": 2897.82, "Time_End": 2898.82, "Text": " Because..."}, {"Time_Start": 2898.82, "Time_End": 2904.82, "Text": " because the sensors could introduce more noise or they could simply strip out the noise"}, {"Time_Start": 2904.82, "Time_End": 2908.82, "Text": " like the replacing characters with the hexadecimal encoding"}, {"Time_Start": 2908.82, "Time_End": 2913.82, "Text": " so that that channel becomes unreliable."}, {"Time_Start": 2913.82, "Time_End": 2920.82, "Text": " So the protocol for sending pages from Bob's machine back to Alice"}, {"Time_Start": 2920.82, "Time_End": 2927.82, "Text": " has to rely on non-noise which means you have to hide the data in the words on the page."}, {"Time_Start": 2927.82, "Time_End": 2928.82, "Text": " And we assume that"}, {"Time_Start": 2928.82, "Time_End": 2933.82, "Text": " Because these censoring proxy does not want to disrupt service to legitimate users,"}, {"Time_Start": 2933.82, "Time_End": 2937.82, "Text": " they can't actually modify and replace words on the page that might change the meaning"}, {"Time_Start": 2937.82, "Time_End": 2942.82, "Text": " because then the service will be useless to all the people who are trying to use it for legitimate purposes."}, {"Time_Start": 2942.82, "Time_End": 2946.82, "Text": " So you can use the text on the page to communicate data."}, {"Time_Start": 2946.82, "Time_End": 2952.82, "Text": " And the 80 is a guy named Peter Wainer invented functions that will take bitstreams and convert them into text,"}, {"Time_Start": 2952.82, "Time_End": 2955.82, "Text": " which looks statistically like English text,"}, {"Time_Start": 2955.82, "Time_End": 2958.82, "Text": " and then you have a function on the other end that can convert it back into the"}, {"Time_Start": 2958.82, "Time_End": 2964.82, "Text": " the original bitstream. So that would be the kind of thing that you could use to communicate"}, {"Time_Start": 2964.82, "Time_End": 2971.82, "Text": " from Bob back to Alice. One general problem with all these things is that if the sensor notices"}, {"Time_Start": 2971.82, "Time_End": 2977.82, "Text": " that every time the user gets blocked from accessing a page, the next page they access is always"}, {"Time_Start": 2977.82, "Time_End": 2983.82, "Text": " the same one, they're going to realize that that page is a way of circumventing their system"}, {"Time_Start": 2983.82, "Time_End": 2987.82, "Text": " and that people are just going to it every time they get denied access somewhere."}, {"Time_Start": 2987.82, "Time_End": 2992.82, "Text": " that means that they're using it to get around the system."}, {"Time_Start": 2992.82, "Time_End": 2996.82, "Text": " There's no real way to solve this problem because you can't,"}, {"Time_Start": 2996.82, "Time_End": 2998.82, "Text": " the user has to be trusted."}, {"Time_Start": 2998.82, "Time_End": 3002.82, "Text": " The user who knows about Bob's circumventor side has to be trusted,"}, {"Time_Start": 3002.82, "Time_End": 3005.82, "Text": " not only not to give it away, but not to do anything stupid"}, {"Time_Start": 3005.82, "Time_End": 3009.82, "Text": " that would cause the monitors to figure out what it's being used for."}, {"Time_Start": 3009.82, "Time_End": 3013.82, "Text": " The only real thing that can be done against this would have"}, {"Time_Start": 3013.82, "Time_End": 3017.82, "Text": " Alice's client end tool, her proxies or server that she's running,"}, {"Time_Start": 3017.82, "Time_End": 3022.42, "Text": " can be configured every time you're about to access a circumventor site."}, {"Time_Start": 3022.42, "Time_End": 3027.82, "Text": " It could just warn you, just keep in mind that if you always access this site after you've been banned from a different site,"}, {"Time_Start": 3027.82, "Time_End": 3030.82, "Text": " then eventually that'll give the game away."}, {"Time_Start": 3030.82, "Time_End": 3034.82, "Text": " And the site, the circumventor site that you're using will get blocked as well."}, {"Time_Start": 3036.82, "Time_End": 3042.82, "Text": " Last thing I'll mention, what if you want us to do it securely in such a way"}, {"Time_Start": 3042.82, "Time_End": 3047.82, "Text": " so that even if a human being is monitoring Alice's network traffic,"}, {"Time_Start": 3047.82, "Time_End": 3051.82, "Text": " they won't be able to, they won't notice anything suspicious about what she's doing."}, {"Time_Start": 3051.82, "Time_End": 3057.82, "Text": " And we're talking early about certain kinds of text queries, random and those words jumbled together,"}, {"Time_Start": 3057.82, "Time_End": 3060.82, "Text": " will be, will look non-suspicious to a machine monitoring you,"}, {"Time_Start": 3060.82, "Time_End": 3063.82, "Text": " but they would look suspicious to a human being,"}, {"Time_Start": 3063.82, "Time_End": 3069.82, "Text": " and it could set off some red flags if a single user is being singled out from monitoring."}, {"Time_Start": 3074.82, "Time_End": 3077.82, "Text": " Then this noun means the,"}, {"Time_Start": 3077.82, "Time_End": 3084.82, "Text": " The text queries being sent from Alice's machine out to Bob has to meet a higher threshold for what is considered non-suspicious."}, {"Time_Start": 3084.82, "Time_End": 3089.82, "Text": " They have to look like the real kinds of queries that Alice would actually type in."}, {"Time_Start": 3089.82, "Time_End": 3093.82, "Text": " One way we've thought of to actually solve this problem is Alice could have a tool on her end,"}, {"Time_Start": 3093.82, "Time_End": 3100.82, "Text": " which will record the query she types in at real search engines during normal legitimate web surfing."}, {"Time_Start": 3100.82, "Time_End": 3106.82, "Text": " And then when she gets banned from a website and has to access Bob's circumventor site in order to get around it,"}, {"Time_Start": 3106.82, "Time_End": 3112.82, "Text": " She can use these stored queries that the tool on her end has saved a list of queries"}, {"Time_Start": 3112.82, "Time_End": 3116.82, "Text": " that she enters at search engines during normal usage."}, {"Time_Start": 3116.82, "Time_End": 3120.82, "Text": " And then each of those queries would hash to some specific value,"}, {"Time_Start": 3120.82, "Time_End": 3123.82, "Text": " which represents a few bits that she wants to communicate."}, {"Time_Start": 3123.82, "Time_End": 3128.82, "Text": " And so you would pick out the queries which Alice has entered in the past,"}, {"Time_Start": 3128.82, "Time_End": 3132.82, "Text": " whose hash values correspond to the data that she wants to send out now."}, {"Time_Start": 3132.82, "Time_End": 3135.82, "Text": " And also mentioned anything that Alice is that Alice has entered in the past,"}, {"Time_Start": 3135.82, "Time_End": 3139.82, "Text": " that Alice had entered a search engine that could possibly look suspicious."}, {"Time_Start": 3139.82, "Time_End": 3146.82, "Text": " You want to exclude queries that contain terms that might rage red flags to people monitoring her."}, {"Time_Start": 3146.82, "Time_End": 3155.82, "Text": " But that takes care of the problem of getting the data from Alice's machine to Bob's"}, {"Time_Start": 3155.82, "Time_End": 3158.82, "Text": " and not having anybody notice it."}, {"Time_Start": 3158.82, "Time_End": 3164.82, "Text": " Next step in the process is pages being sent back from Bob to Alice also have to look non-suspicious."}, {"Time_Start": 3164.82, "Time_End": 3165.8, "Text": " So I talked about Peter."}, {"Time_Start": 3165.82, "Time_End": 3172.82, "Text": " Wainer's mimic functions about how they take data streams and they turn it into text that looks like English text"}, {"Time_Start": 3172.82, "Time_End": 3175.82, "Text": " and then the inverse function turns the text backs into a bitstream."}, {"Time_Start": 3175.82, "Time_End": 3178.82, "Text": " And I was saying that the text looks statistically like English text,"}, {"Time_Start": 3178.82, "Time_End": 3181.82, "Text": " which means a computer cannot tell what you're doing."}, {"Time_Start": 3181.82, "Time_End": 3190.82, "Text": " But the problem is the text generated by a mimic function is very obvious to spot for a human being reading the page."}, {"Time_Start": 3190.82, "Time_End": 3192.82, "Text": " So that would not be sufficient."}, {"Time_Start": 3192.82, "Time_End": 3195.82, "Text": " Instead, you have a real problem here because you can't,"}, {"Time_Start": 3195.82, "Time_End": 3199.82, "Text": " you have to generate something that looks like text which could have been written by a human."}, {"Time_Start": 3199.82, "Time_End": 3203.82, "Text": " But you don't have a human being that can actually write the text for you."}, {"Time_Start": 3203.82, "Time_End": 3209.82, "Text": " And you can't use a copy of, you can't use a copy of some other page that has already been written"}, {"Time_Start": 3209.82, "Time_End": 3211.82, "Text": " or any text that has already been written,"}, {"Time_Start": 3211.82, "Time_End": 3215.82, "Text": " because then the censoring proxy could just monitor for sites"}, {"Time_Start": 3215.82, "Time_End": 3219.82, "Text": " which are always serving back copies of pages that were stolen from somewhere else."}, {"Time_Start": 3219.82, "Time_End": 3223.82, "Text": " So that would also leave too suspicious of an audit trail."}, {"Time_Start": 3223.82, "Time_End": 3225.82, "Text": " So you have a problem of how to, uh,"}, {"Time_Start": 3225.82, "Time_End": 3230.82, "Text": " how to create pages that would not look suspicious to the monitor."}, {"Time_Start": 3230.82, "Time_End": 3235.82, "Text": " One thing we came up with was that the pages returned by Bob site"}, {"Time_Start": 3235.82, "Time_End": 3239.82, "Text": " are returned in a format that you get at a search engine"}, {"Time_Start": 3239.82, "Time_End": 3243.82, "Text": " where you have summary information for each of the listings of a different page."}, {"Time_Start": 3243.82, "Time_End": 3248.82, "Text": " And those, that will actually, the advantage of that is it actually looks like the kind of page"}, {"Time_Start": 3248.82, "Time_End": 3253.82, "Text": " that you would expect to be served back in response to the text query"}, {"Time_Start": 3253.82, "Time_End": 3254.82, "Text": " that Alice had sent out in the first place."}, {"Time_Start": 3254.82, "Time_End": 3258.82, "Text": " in the first place. Usually when somebody's entering a text query, they're doing it so they can get a"}, {"Time_Start": 3258.82, "Time_End": 3263.82, "Text": " list of pages with the title and summary information and links and stuff like that."}, {"Time_Start": 3263.82, "Time_End": 3268.82, "Text": " And the data that would be being sent back from Bob's machine to Alice's machine,"}, {"Time_Start": 3268.82, "Time_End": 3276.82, "Text": " it would be hidden inside the page titles and the meta descriptions being served on the page."}, {"Time_Start": 3276.82, "Time_End": 3282.82, "Text": " And Alice's software on her end would understand the same protocol and decode it in the same way."}, {"Time_Start": 3284.82, "Time_End": 3291.82, "Text": " The only real weakness here is that a human being monitoring traffic both ways"}, {"Time_Start": 3291.82, "Time_End": 3295.82, "Text": " could see the query that Alice enters on Bob's site"}, {"Time_Start": 3295.82, "Time_End": 3300.82, "Text": " and could see the search engine results listing served from Bob back to Alice."}, {"Time_Start": 3300.82, "Time_End": 3304.82, "Text": " And they could notice that the search engine query results"}, {"Time_Start": 3304.82, "Time_End": 3308.82, "Text": " do not really correspond to the text query that Alice entered"}, {"Time_Start": 3308.82, "Time_End": 3313.82, "Text": " and they would conclude there's something suspicious going on."}, {"Time_Start": 3313.82, "Time_End": 3320.82, "Text": " The only real defense here is that even if Bob's site gets blocked because a human being"}, {"Time_Start": 3320.82, "Time_End": 3323.82, "Text": " monitored the traffic and detected something suspicious,"}, {"Time_Start": 3323.82, "Time_End": 3328.82, "Text": " Alice can say that Bob's site actually looks like a real search query site where you're"}, {"Time_Start": 3328.82, "Time_End": 3330.82, "Text": " into your text query and gets results."}, {"Time_Start": 3330.82, "Time_End": 3335.82, "Text": " So she can have sort of the play dumb defense where if she's in a situation"}, {"Time_Start": 3335.82, "Time_End": 3338.82, "Text": " where somebody confronts her with records of her traffic and says"}, {"Time_Start": 3338.82, "Time_End": 3342.82, "Text": " this Bob is running a known circumventor site for getting around our network."}, {"Time_Start": 3342.82, "Time_End": 3348.5800000000004, "Text": " our network, it's easy to point out that the traffic looks like real traffic to a site"}, {"Time_Start": 3348.5800000000004, "Time_End": 3353.5800000000004, "Text": " so Alice can claim that she was, that she didn't know what the site was for at the time."}, {"Time_Start": 3356.26, "Time_End": 3364.02, "Text": " To anybody who's interested in helping to work on this problem, what I've been talking"}, {"Time_Start": 3364.02, "Time_End": 3368.82, "Text": " about for the past 50 minutes, just to summarize the cycles that we go through is really,"}, {"Time_Start": 3368.82, "Time_End": 3372.8, "Text": " you come up with an idea for communicating between Alice and"}, {"Time_Start": 3372.82, "Time_End": 3378.6400000000003, "Text": " and Bob's server and then try to find some kind of pattern in the traffic that"}, {"Time_Start": 3378.6400000000003, "Time_End": 3384.7000000000003, "Text": " would give it away to somebody who's monitoring for the protocol and what I mentioned earlier"}, {"Time_Start": 3384.7000000000003, "Time_End": 3391.6600000000003, "Text": " was two traps to fall into the arms race syndrome where you if you spot a known flaw in the"}, {"Time_Start": 3391.6600000000003, "Time_End": 3396.88, "Text": " protocol don't get into the habit of saying well this will delay them by a few product cycles"}, {"Time_Start": 3396.88, "Time_End": 3401.5800000000004, "Text": " and by the time that they have a fix for this will come out with another one because if it's"}, {"Time_Start": 3401.58, "Time_End": 3405.2999999999997, "Text": " possible to design it in such a way the first time around that it's secure, you should"}, {"Time_Start": 3405.2999999999997, "Time_End": 3410.34, "Text": " do that instead of creating a temporarily insecure protocol that will put a lot of users"}, {"Time_Start": 3410.34, "Time_End": 3416.22, "Text": " in danger. And also remember that the people administering the censoring the censoring"}, {"Time_Start": 3416.22, "Time_End": 3423.2999999999997, "Text": " the censoring network do not have to allow anything they don't want to. So just be aware"}, {"Time_Start": 3423.2999999999997, "Time_End": 3428.64, "Text": " that the only thing you can really rely on is the URL requests going from Alice to Bob and"}, {"Time_Start": 3428.64, "Time_End": 3431.56, "Text": " the pages coming back from Bob to Alice because anything, anything,"}, {"Time_Start": 3431.58, "Time_End": 3436.96, "Text": " any other side channels like cookies, these sensors will not hesitate to block those"}, {"Time_Start": 3436.96, "Time_End": 3443.58, "Text": " if it is the only way to disrupt your protocol and it will not interfere with most normal websites."}, {"Time_Start": 3447.58, "Time_End": 3452.96, "Text": " Lastly, I'm sorry I ran out of time before I can get to talk a little bit more about our website"}, {"Time_Start": 3452.96, "Time_End": 3458.46, "Text": " and how I got started on this. Our website is at peacefire.org and we actually got started as a site"}, {"Time_Start": 3458.46, "Time_End": 3463.92, "Text": " with information about how to disable client and blocking software on home computers"}, {"Time_Start": 3463.92, "Time_End": 3469.48, "Text": " like Surfwatch. It was really trivial from a script kitty hacker point of view and"}, {"Time_Start": 3469.48, "Time_End": 3473.28, "Text": " it's not the kind of thing. I mean, even script kiddies would be ashamed in traffic and that kind of"}, {"Time_Start": 3473.28, "Time_End": 3480.12, "Text": " information. It's just so embarrassingly easy, but it is an issue that we had looked at for a while."}, {"Time_Start": 3480.2200000000003, "Time_End": 3484.4, "Text": " And we're actually perfectly upfront about the fact that the information on how to circumvent"}, {"Time_Start": 3484.4, "Time_End": 3488.12, "Text": " blocking software is just a gimmick to get people to come to the site."}, {"Time_Start": 3488.46, "Time_End": 3493.86, "Text": " and read information that we posted about internet censorship and why we're against it."}, {"Time_Start": 3493.86, "Time_End": 3500.26, "Text": " And then when it got to the problem of how to circumvent network level blocking programs like they use in high schools,"}, {"Time_Start": 3500.26, "Time_End": 3505.46, "Text": " that was when some of the more interesting questions came up, which is how should we do this securely"}, {"Time_Start": 3505.46, "Time_End": 3508.46, "Text": " in such a way that users using it cannot be detected."}, {"Time_Start": 3508.46, "Time_End": 3515.96, "Text": " And that led into the development of the, basically the math problem that I spent the last 50 minutes describing,"}, {"Time_Start": 3515.96, "Time_End": 3518.44, "Text": " which actually has pretty serious implications for,"}, {"Time_Start": 3518.46, "Time_End": 3523.54, "Text": " not just people facing censorship from their local ISP or their school or something,"}, {"Time_Start": 3523.66, "Time_End": 3528.68, "Text": " but if we can do this right, it would actually meet a great social need for this kind of thing"}, {"Time_Start": 3528.68, "Time_End": 3531.08, "Text": " in countries like China where it's a serious problem."}, {"Time_Start": 3531.48, "Time_End": 3536.98, "Text": " I think what a lot of people don't realize enough is that things like PGP and Zero Knowledge"}, {"Time_Start": 3536.98, "Time_End": 3543.26, "Text": " Systems and Anonymizer.com, which are useful to people who live in countries where they are allowed,"}, {"Time_Start": 3543.56, "Time_End": 3548.44, "Text": " are not actually that useful to people who live in countries where just the fact that you're using,"}, {"Time_Start": 3548.46, "Time_End": 3550.46, "Text": " encryption is enough to get you in trouble."}, {"Time_Start": 3550.46, "Time_End": 3557.46, "Text": " So I think that I hope that more work will end up being done on the subject of stachronography in general"}, {"Time_Start": 3557.46, "Time_End": 3561.46, "Text": " and circumvent accessing banned websites in particular."}, {"Time_Start": 3561.46, "Time_End": 3563.46, "Text": " That's the last slide."}, {"Time_Start": 3563.46, "Time_End": 3567.46, "Text": " So move on to questions in the..."}, {"Time_Start": 3567.46, "Time_End": 3570.46, "Text": " I think I saw that head in the back before anybody else go."}, {"Time_Start": 3570.46, "Time_End": 3576.46, "Text": " Are there any questions on how Alice is going?"}, {"Time_Start": 3576.46, "Time_End": 3585.46, "Text": " The question was, how should Alice get the software in order to use it to communicate with Bob?"}, {"Time_Start": 3585.46, "Time_End": 3594.46, "Text": " The assumption is that she knows at least one person, Bob, who was on the outside and she could obtain it from head."}, {"Time_Start": 3594.46, "Time_End": 3604.46, "Text": " Of course, next question is, can the sensors also monitor traffic between Alice and Bob so they could monitor for the exact bits that are being transmitted as Bob sends them to Alice?"}, {"Time_Start": 3604.46, "Time_End": 3620.46, "Text": " The sort of the assumption here is that the monitors are looking for general patterns of suspicious activity and any one single instance of activity like sending one PGP encrypted message from a user in the United States to a user in China."}, {"Time_Start": 3620.46, "Time_End": 3626.46, "Text": " Or if you want, the assumption is if you want to circumvent the system once, that's possible to do."}, {"Time_Start": 3626.46, "Time_End": 3634.44, "Text": " It's if you want to circumvent it repeatedly as a matter of habit, then you have to have more security to make sure that pattern"}, {"Time_Start": 3634.46, "Time_End": 3637.46, "Text": " of suspicious behavior don't aren't detected easily."}, {"Time_Start": 3637.46, "Time_End": 3638.46, "Text": " Go ahead."}, {"Time_Start": 3638.46, "Time_End": 3651.46, "Text": " Okay."}, {"Time_Start": 3651.46, "Time_End": 3657.46, "Text": " The question was that the protocol a network of"}, {"Time_Start": 3657.46, "Time_End": 3661.46, "Text": " a network of dynamically distributed outside of the control outside of the control of the control of the sensor"}, {"Time_Start": 3661.46, "Time_End": 3664.46, "Text": " of the sensor so that every time in person it makes a question"}, {"Time_Start": 3664.46, "Time_End": 3666.46, "Text": " they'd go to a different one."}, {"Time_Start": 3666.46, "Time_End": 3668.46, "Text": " That's actually something that was discussed a lot."}, {"Time_Start": 3668.46, "Time_End": 3675.46, "Text": " The problem is that that that model of sort of having a distributed network of,"}, {"Time_Start": 3675.46, "Time_End": 3680.46, "Text": " as a distributed network of nodes so that you can plug into any one of them every time you need a need a request."}, {"Time_Start": 3680.46, "Time_End": 3687.46, "Text": " That is more appropriate for things like Freenet and Gneutelo where these are systems where they're allowed to distribute files that are subject to censorship."}, {"Time_Start": 3687.46, "Time_End": 3693.46, "Text": " And any time they sensor one node, all the data gets distributed to all the other nodes as well."}, {"Time_Start": 3693.46, "Time_End": 3694.46, "Text": " nodes as well."}, {"Time_Start": 3694.46, "Time_End": 3701.46, "Text": " The reason that model works for something like Freenet is that the overhead involved in blocking a particular"}, {"Time_Start": 3701.46, "Time_End": 3703.46, "Text": " in censoring a particular node is fairly high."}, {"Time_Start": 3703.46, "Time_End": 3707.46, "Text": " They have to get a court order and get the police in to go in and shut something down."}, {"Time_Start": 3707.46, "Time_End": 3712.46, "Text": " The reason that model doesn't really work for this is because the overhead in censoring a particular"}, {"Time_Start": 3712.46, "Time_End": 3713.46, "Text": " node is not high."}, {"Time_Start": 3713.46, "Time_End": 3716.46, "Text": " All they have to do is added to their list of blocked sites for you."}, {"Time_Start": 3716.46, "Time_End": 3722.46, "Text": " So if you are dynamically communicating with many different Bob servers, then if you're"}, {"Time_Start": 3722.46, "Time_End": 3728.96, "Text": " then if your protocol gives you away as soon as you communicate with a server, it will get detected and blocked."}, {"Time_Start": 3728.96, "Time_End": 3738.96, "Text": " And then, so the reason the distributed network idea works for file sharing systems is because the overhead for shutting down a particular node is high."}, {"Time_Start": 3738.96, "Time_End": 3743.96, "Text": " It doesn't work for this because the effort involved in blocking one node is very small for the sensors."}, {"Time_Start": 3743.96, "Time_End": 3747.96, "Text": " Does that kind of, kind of explain it?"}, {"Time_Start": 3749.96, "Time_End": 3750.96, "Text": " Okay."}, {"Time_Start": 3750.96, "Time_End": 3751.96, "Text": " Okay."}, {"Time_Start": 3751.96, "Time_End": 3756.96, "Text": " get a shirt anyway. These are shirts that have the names and addresses of website."}, {"Time_Start": 3756.96, "Time_End": 3762.96, "Text": " I forgot to give a shirt the person in the back as well. They have the names and addresses of websites"}, {"Time_Start": 3762.96, "Time_End": 3767.96, "Text": " that have been censored by different blocking software programs for all kinds of ridiculous reasons."}, {"Time_Start": 3767.96, "Time_End": 3769.96, "Text": " I mean, Time Magazine is on here because..."}]}