{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 21.82,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay, this is what to expect, it's going to be an open forum, we have a good friend of"
    },
    {
      "Time_Start": 21.82,
      "Time_End": 27.1,
      "Text": " mine, a civil attorney, and we have a guy who is a prosecutor, and we tried to have"
    },
    {
      "Time_Start": 27.1,
      "Time_End": 32.260000000000005,
      "Text": " a criminal defense attorney up here, Jennifer, but she kind of disappeared, I guess she was"
    },
    {
      "Time_Start": 32.260000000000005,
      "Time_End": 41.260000000000005,
      "Text": " afraid of you guys. So if you two would like to make a statement, or? Sure. Hello. How's"
    },
    {
      "Time_Start": 41.260000000000005,
      "Time_End": 50.74,
      "Text": " that? That was good, huh? Alright. Yes, I've complained about the air conditioning again."
    },
    {
      "Time_Start": 50.74,
      "Time_End": 54.44,
      "Text": " I'm happy to see so many of the people that I work with here in the audience. I could"
    },
    {
      "Time_Start": 54.44,
      "Time_End": 58.64,
      "Text": " have a 100% success rate in spotting the feds, so anybody who wants to talk with me"
    },
    {
      "Time_Start": 58.64,
      "Time_End": 62.72,
      "Text": " after, if you need a t-shirt, let me know and maybe we can work something out, because"
    },
    {
      "Time_Start": 62.72,
      "Time_End": 70.47999999999999,
      "Text": " you can run, but you cannot hide. Nice to see you again. I'm going to go hunt for Jennifer."
    },
    {
      "Time_Start": 70.47999999999999,
      "Time_End": 76.56,
      "Text": " I'm a federal prosecutor from San Diego, California. My name is Mitch Denbin. And I, Peter asked"
    },
    {
      "Time_Start": 76.56,
      "Time_End": 80.8,
      "Text": " me to do this, and I agreed, because I thought it made sense to do a little bit of reality"
    },
    {
      "Time_Start": 80.8,
      "Time_End": 88.88,
      "Text": " checking. Talk about what we really prosecute versus what people think we prosecute, and"
    },
    {
      "Time_Start": 88.88,
      "Time_End": 93.72,
      "Text": " kind of give some people a comfort level. And the reason I'm willing to do that is,"
    },
    {
      "Time_Start": 93.72,
      "Time_End": 97.72,
      "Text": " you know, we talk a lot about what's legal and what's illegal, and a lot of the things"
    },
    {
      "Time_Start": 97.72,
      "Time_End": 101.52,
      "Text": " that people do are, if you look at the books, are illegal, but they don't get prosecuted"
    },
    {
      "Time_Start": 101.52,
      "Time_End": 107.08,
      "Text": " for it. And what that does is kind of embolden people to do things beyond the norms, and"
    },
    {
      "Time_Start": 107.08,
      "Time_End": 111.6,
      "Text": " say, hey, they didn't get hit for something that is illegal, like, you know, just jumping"
    },
    {
      "Time_Start": 111.6,
      "Time_End": 115.36,
      "Text": " into a system and jumping out without access. Wow, that means that, you know, I did something"
    },
    {
      "Time_Start": 115.36,
      "Time_End": 118.67999999999999,
      "Text": " illegal and I got away with it, I can do more. Because that's not the kind of stuff we're"
    },
    {
      "Time_Start": 118.67999999999999,
      "Time_End": 122.32,
      "Text": " looking at. So what I want to talk to you about is what we really prosecute versus what"
    },
    {
      "Time_Start": 122.32,
      "Time_End": 128.36,
      "Text": " we really don't, and maybe that way clear up some of the myths and some of the legends,"
    },
    {
      "Time_Start": 128.36,
      "Time_End": 132.16,
      "Text": " and go from there. That's what I'll talk about. Brian?"
    },
    {
      "Time_Start": 133.16,
      "Time_End": 139.16,
      "Text": " I, first of all, I'm not a Fed. I've been just harassed by, I don't know, it's like,"
    },
    {
      "Time_Start": 139.16,
      "Time_End": 143.16,
      "Text": " do people really think that Feds are going to send some fat, bald guy out here to…"
    },
    {
      "Time_Start": 143.16,
      "Time_End": 145.16,
      "Text": " Does he look like a Fed to you?"
    },
    {
      "Time_Start": 145.16,
      "Time_End": 150.16,
      "Text": " Yeah, I must. I don't know. I tend to give the Feds a little more credit. Maybe next"
    },
    {
      "Time_Start": 150.16,
      "Time_End": 154.16,
      "Text": " year they'll pull a double switch and have, flood the place with fat, bald guys."
    },
    {
      "Time_Start": 154.16,
      "Time_End": 156.16,
      "Text": " I agree."
    },
    {
      "Time_Start": 160.16,
      "Time_End": 167.16,
      "Text": " You know, it wouldn't cost much. Basically, I'm a civil practitioner. I am not interested"
    },
    {
      "Time_Start": 167.16,
      "Time_End": 177.16,
      "Text": " in throwing anyone in jail. I just want your money. I'm here to scare the bejesus out"
    },
    {
      "Time_Start": 177.16,
      "Time_End": 183.16,
      "Text": " of everyone and talk about the civil ramifications of unauthorized computer access."
    },
    {
      "Time_Start": 184.16,
      "Time_End": 193.16,
      "Text": " And just where I see civil litigation coming from in the next few years and how it will"
    },
    {
      "Time_Start": 193.16,
      "Time_End": 203.16,
      "Text": " affect newbie hackers, Uber hackers, or anyone else, I see considerable liability coming"
    },
    {
      "Time_Start": 203.16,
      "Time_End": 210.16,
      "Text": " for insurance companies and for insurance companies representing all the new startup"
    },
    {
      "Time_Start": 211.16,
      "Time_End": 219.16,
      "Text": " internet security consultants and firewall experts. And that's what I'm going to"
    },
    {
      "Time_Start": 219.16,
      "Time_End": 222.16,
      "Text": " go into after the discussion of the criminal matters."
    },
    {
      "Time_Start": 222.16,
      "Time_End": 223.16,
      "Text": " You're on."
    },
    {
      "Time_Start": 223.16,
      "Time_End": 230.16,
      "Text": " Okay, sorry. So basically, after we touch on the criminal aspects, I'm going to hit"
    },
    {
      "Time_Start": 230.16,
      "Time_End": 238.16,
      "Text": " you where your pocketbook is. I'm going to talk about where you may be civilly liable,"
    },
    {
      "Time_Start": 238.16,
      "Time_End": 243.16,
      "Text": " whether you're a hacker or in the internet security community."
    },
    {
      "Time_Start": 245.16,
      "Time_End": 248.16,
      "Text": " Alright, let's talk about criminal stuff first. Here's the kind of stuff we do."
    },
    {
      "Time_Start": 248.16,
      "Time_End": 254.16,
      "Text": " Stealing. Stealing is wrong. Remember, thou shalt not steal? Remember that one? One of"
    },
    {
      "Time_Start": 254.16,
      "Time_End": 258.15999999999997,
      "Text": " those commandment things? It's been wrong since we've had civilization. It's been"
    },
    {
      "Time_Start": 258.15999999999997,
      "Time_End": 263.15999999999997,
      "Text": " wrong. It always will be wrong. It's wrong today. It'll be wrong tomorrow. Stealing"
    },
    {
      "Time_Start": 263.16,
      "Time_End": 268.16,
      "Text": " is wrong. We should have been taught that as children. Stealing, taking something that"
    },
    {
      "Time_Start": 268.16,
      "Time_End": 273.16,
      "Text": " doesn't belong to you is wrong. And while it could be a lot of fun, I mean, who didn't"
    },
    {
      "Time_Start": 273.16,
      "Time_End": 276.16,
      "Text": " shoplift when they were a kid? I mean, while it could be a lot of fun and exciting and"
    },
    {
      "Time_Start": 276.16,
      "Time_End": 279.16,
      "Text": " challenging to take something that doesn't belong to you, it really sucks if you're"
    },
    {
      "Time_Start": 279.16,
      "Time_End": 284.16,
      "Text": " on the other end of it, particularly if it's something personal to you. So stealing,"
    },
    {
      "Time_Start": 284.16,
      "Time_End": 288.16,
      "Text": " if you're stealing, if you're out there stealing stuff, then you've got a problem"
    },
    {
      "Time_Start": 288.16,
      "Time_End": 292.16,
      "Text": " with us. I don't care about people rooting around systems for the most part, but when"
    },
    {
      "Time_Start": 292.16,
      "Time_End": 296.16,
      "Text": " you take something that doesn't belong to you, that's the kind of stuff that pisses"
    },
    {
      "Time_Start": 296.16,
      "Time_End": 303.16,
      "Text": " people off and what gets us going and gets us, we have a very slow, cumbersome process"
    },
    {
      "Time_Start": 303.16,
      "Time_End": 310.16,
      "Text": " in order to go after people. But when one steals, then we actually crank it up. You"
    },
    {
      "Time_Start": 310.16,
      "Time_End": 316.16,
      "Text": " heard the other day talk about a $5,000 limit. Well, that's not true. I don't want you"
    },
    {
      "Time_Start": 316.16,
      "Time_End": 321.16,
      "Text": " to think that you're safe if you steal less than $5,000. That's actually not true."
    },
    {
      "Time_Start": 321.16,
      "Time_End": 325.16,
      "Text": " In the part of the computer crime statute, it's 18 U.S.C. 1030 A4, if you happen to"
    },
    {
      "Time_Start": 325.16,
      "Time_End": 332.16,
      "Text": " care to look, if you break into a computer with intent to defraud, then there is no $5,000"
    },
    {
      "Time_Start": 332.16,
      "Time_End": 336.16,
      "Text": " limit. It's a felony right out the bat. It doesn't matter. So stealing credit cards"
    },
    {
      "Time_Start": 336.16,
      "Time_End": 342.16,
      "Text": " and using them, doing anything where you intend to get money from somebody by"
    },
    {
      "Time_Start": 342.16,
      "Time_End": 348.16,
      "Text": " misrepresenting or just by sleight of hand is the kind of stuff that gets us annoyed"
    },
    {
      "Time_Start": 348.16,
      "Time_End": 354.16,
      "Text": " and gets the victim annoyed, more appropriately, and we go ahead and look at people who steal."
    },
    {
      "Time_Start": 354.16,
      "Time_End": 360.16,
      "Text": " What else do we take seriously? We take malicious behavior seriously. It is wrong, it has"
    },
    {
      "Time_Start": 360.16,
      "Time_End": 365.16,
      "Text": " always been wrong or probably will always be wrong to destroy or damage property that"
    },
    {
      "Time_Start": 365.16,
      "Time_End": 369.16,
      "Text": " doesn't belong to you. It's just not cool if you're thinking about walking down a street"
    },
    {
      "Time_Start": 369.16,
      "Time_End": 373.16,
      "Text": " and throwing a rock through somebody's window. I mean, it's the kind of stuff that,"
    },
    {
      "Time_Start": 373.16,
      "Time_End": 379.16,
      "Text": " gee, that was wrong. And yeah, it's wrong in the physical world and it's also wrong"
    },
    {
      "Time_Start": 379.16,
      "Time_End": 384.16,
      "Text": " in the cyber world. What we tend to look at, because we're not terribly smart, is that"
    },
    {
      "Time_Start": 384.16,
      "Time_End": 389.16,
      "Text": " we look for a physical world counterpart to the kind of behavior that we see in cyber."
    },
    {
      "Time_Start": 389.16,
      "Time_End": 392.16,
      "Text": " So that if something is wrong and you know it to be wrong in the physical world, it's"
    },
    {
      "Time_Start": 392.16,
      "Time_End": 396.16,
      "Text": " probably going to be wrong in the cyber world and it's the kind of stuff that you look"
    },
    {
      "Time_Start": 396.16,
      "Time_End": 401.16,
      "Text": " at. So destroying property is just not a good thing to do. It's just not cool."
    },
    {
      "Time_Start": 401.16,
      "Time_End": 406.16,
      "Text": " So as a consequence, when we see that kind of behavior, malicious behavior, that is the"
    },
    {
      "Time_Start": 406.16,
      "Time_End": 413.16,
      "Text": " kind of thing that once again gets us interested. Now that does have the $5,000 threshold, just"
    },
    {
      "Time_Start": 413.16,
      "Time_End": 419.16,
      "Text": " to make things perfectly clear. If you do damage, delete, destroy information and it"
    },
    {
      "Time_Start": 419.16,
      "Time_End": 426.16,
      "Text": " costs the victim more than $5,000 to repair the damage, then it meets the federal jurisdictional"
    },
    {
      "Time_Start": 427.16,
      "Time_End": 431.16,
      "Text": " threshold. And it's kind of silly when you think about it, actually. What we're doing"
    },
    {
      "Time_Start": 431.16,
      "Time_End": 435.16,
      "Text": " is encouraging bad net citizenship. So if you have like a real good, if you're a solid"
    },
    {
      "Time_Start": 435.16,
      "Time_End": 441.16,
      "Text": " ISP and you get hacked into and a guy takes down a bunch of files and roots around and"
    },
    {
      "Time_Start": 441.16,
      "Time_End": 448.16,
      "Text": " does a lot of damage and you have to hire a consultant, for example, to come in and"
    },
    {
      "Time_Start": 448.16,
      "Time_End": 454.16,
      "Text": " figure out where the damage was done, to patch the holes and work up things, you're more"
    },
    {
      "Time_Start": 454.16,
      "Time_End": 459.16,
      "Text": " than $5,000 right off the bat. And that particular person, you know, can be looking at federal"
    },
    {
      "Time_Start": 459.16,
      "Time_End": 464.16,
      "Text": " prosecution. If, on the other hand, you're a good ISP, a good net citizen, and you have"
    },
    {
      "Time_Start": 464.16,
      "Time_End": 469.16,
      "Text": " pretty serious security and you have SIS managers who understand security, who catch the break"
    },
    {
      "Time_Start": 469.16,
      "Time_End": 474.16,
      "Text": " in fairly early, and it's somebody, you know, actually consider that the two crackers have"
    },
    {
      "Time_Start": 474.16,
      "Time_End": 479.16,
      "Text": " the same absolute intent. They just want to do damage. And let's say, for example, they"
    },
    {
      "Time_Start": 479.16,
      "Time_End": 484.16,
      "Text": " do the absolute same damage. They go in, they get some access, they destroy personal"
    },
    {
      "Time_Start": 484.16,
      "Time_End": 489.16,
      "Text": " web pages, they steal personal information, they just cause a ruckus. But this particular"
    },
    {
      "Time_Start": 489.16,
      "Time_End": 495.16,
      "Text": " second ISP is serious about security, catch the break in fairly early, have good backups,"
    },
    {
      "Time_Start": 495.16,
      "Time_End": 501.16,
      "Text": " are able to restore the deleted files quickly, they patch up right away, usually patch up"
    },
    {
      "Time_Start": 501.16,
      "Time_End": 506.16,
      "Text": " right away, and as a consequence, it's taken maybe a couple of SIS admins half a day to"
    },
    {
      "Time_Start": 506.16,
      "Time_End": 514.1600000000001,
      "Text": " put back together. What's that cost the company? $1,500 in time, no federal jurisdiction. Zero."
    },
    {
      "Time_Start": 514.1600000000001,
      "Time_End": 518.1600000000001,
      "Text": " So the good net citizen gets no action from us, and the bad net citizen, somebody who"
    },
    {
      "Time_Start": 518.1600000000001,
      "Time_End": 523.1600000000001,
      "Text": " doesn't give a wit about security, their case gets looked at by us. Which is kind of weird"
    },
    {
      "Time_Start": 523.1600000000001,
      "Time_End": 530.1600000000001,
      "Text": " and kind of disturbs any right-thinking person, I think. Maybe not. Oh, we have a question"
    },
    {
      "Time_Start": 530.1600000000001,
      "Time_End": 531.1600000000001,
      "Text": " from the audience."
    },
    {
      "Time_Start": 531.16,
      "Time_End": 536.16,
      "Text": " If, from a jurisdictional standpoint, if the victim of the crime is in San Diego, but"
    },
    {
      "Time_Start": 536.16,
      "Time_End": 540.16,
      "Text": " you track the perpetrator down, even if it's in, you know, whether you knew it or not,"
    },
    {
      "Time_Start": 540.16,
      "Time_End": 547.16,
      "Text": " it's in New York, where would you go to prosecute? I mean, who would pick up the, possibly?"
    },
    {
      "Time_Start": 547.16,
      "Time_End": 552.16,
      "Text": " As a practical matter, the prosecution is done where it's easier to prosecute. So in"
    },
    {
      "Time_Start": 552.16,
      "Time_End": 556.16,
      "Text": " a case where, let's just say someone from New York hacks into a company or hacks into"
    },
    {
      "Time_Start": 556.16,
      "Time_End": 562.16,
      "Text": " a naval facility in San Diego, not that that's ever happened, the most likely site of prosecution"
    },
    {
      "Time_Start": 562.16,
      "Time_End": 567.16,
      "Text": " would be the place of the victim computer system. Because it's easier on the victim"
    },
    {
      "Time_Start": 567.16,
      "Time_End": 571.16,
      "Text": " for the prosecution to occur there. The only time that doesn't really work is with juveniles."
    },
    {
      "Time_Start": 571.16,
      "Time_End": 577.16,
      "Text": " The juvenile system doesn't work that well on the federal side. Part of the reason for"
    },
    {
      "Time_Start": 577.16,
      "Time_End": 585.16,
      "Text": " that is that the computer crimes are not listed as delineated juvenile delinquency offenses."
    },
    {
      "Time_Start": 585.16,
      "Time_End": 590.16,
      "Text": " So as a consequence, you have to get permission from the local DA to prosecute it federally."
    },
    {
      "Time_Start": 590.16,
      "Time_End": 594.16,
      "Text": " Often times that's forthcoming, sometimes not. The problem, the federal system doesn't"
    },
    {
      "Time_Start": 594.16,
      "Time_End": 599.16,
      "Text": " have any juvenile detention facilities. We're lucky in California, lucky in California,"
    },
    {
      "Time_Start": 599.16,
      "Time_End": 605.16,
      "Text": " that because we have a very powerful juvenile justice system, that a federal case, a federal"
    },
    {
      "Time_Start": 605.16,
      "Time_End": 609.16,
      "Text": " juvenile case in California, the federal judges have access to the California Youth Authority"
    },
    {
      "Time_Start": 609.16,
      "Time_End": 614.16,
      "Text": " sentence. So that, if appropriate, someone can be sent to prison. Also, we have a pretty"
    },
    {
      "Time_Start": 614.16,
      "Time_End": 618.16,
      "Text": " good working relationship with our DAs around the state. So we get the juveniles taken care"
    },
    {
      "Time_Start": 618.16,
      "Time_End": 619.16,
      "Text": " of that way."
    },
    {
      "Time_Start": 619.16,
      "Time_End": 628.16,
      "Text": " You were a lawyer by some chance?"
    },
    {
      "Time_Start": 628.16,
      "Time_End": 633.16,
      "Text": " Yeah, whatever you said."
    },
    {
      "Time_Start": 633.16,
      "Time_End": 640.16,
      "Text": " My question is about the legality of reverse engineering. A lot of people say on the internet"
    },
    {
      "Time_Start": 641.16,
      "Time_End": 646.16,
      "Text": " or when you read through different materials that as long as it's for demonstration purposes"
    },
    {
      "Time_Start": 646.16,
      "Time_End": 650.16,
      "Text": " or that you have this 24-hour window, these protective warnings that go out there, that"
    },
    {
      "Time_Start": 650.16,
      "Time_End": 654.16,
      "Text": " it is legal to present this information for informational purposes, but the use of it"
    },
    {
      "Time_Start": 654.16,
      "Time_End": 660.16,
      "Text": " or the intended result is often considered illegal. Is this a real distinction or is"
    },
    {
      "Time_Start": 660.16,
      "Time_End": 661.16,
      "Text": " this..."
    },
    {
      "Time_Start": 661.16,
      "Time_End": 665.16,
      "Text": " A lot of this, did anybody hear that question? We talked about reverse engineering and the"
    },
    {
      "Time_Start": 665.16,
      "Time_End": 667.16,
      "Text": " legality of posting..."
    },
    {
      "Time_Start": 668.16,
      "Time_End": 674.16,
      "Text": " A lot of that will run into the civil arena. As a practical matter, I'll just answer this"
    },
    {
      "Time_Start": 674.16,
      "Time_End": 678.16,
      "Text": " very quickly. On the criminal side, if we get into a situation where we have a battle"
    },
    {
      "Time_Start": 678.16,
      "Time_End": 682.16,
      "Text": " of the experts, where the prosecution has to call somebody to say, this is something"
    },
    {
      "Time_Start": 682.16,
      "Time_End": 687.16,
      "Text": " that was created by reverse engineering, and the defense expert can say, well, it was readily"
    },
    {
      "Time_Start": 687.16,
      "Time_End": 690.16,
      "Text": " apparent, it really didn't have to be reverse engineered, we don't do those cases criminally."
    },
    {
      "Time_Start": 690.16,
      "Time_End": 695.16,
      "Text": " You're not really looking at a criminal case, for the most part, in a reverse engineered"
    },
    {
      "Time_Start": 695.16,
      "Time_End": 699.16,
      "Text": " product. But it does have, on the civil arena, it's a lot easier to do. So I'll shift to"
    },
    {
      "Time_Start": 699.16,
      "Time_End": 700.16,
      "Text": " Brian on that."
    },
    {
      "Time_Start": 700.16,
      "Time_End": 706.16,
      "Text": " Well, the intellectual property aspects of it, I'm not an intellectual property attorney."
    },
    {
      "Time_Start": 706.16,
      "Time_End": 713.16,
      "Text": " I know that the guys who do that work make far more money than I do. But essentially,"
    },
    {
      "Time_Start": 713.16,
      "Time_End": 722.16,
      "Text": " there's a question of intent. What was your intent in posting it? And once again, you"
    },
    {
      "Time_Start": 723.16,
      "Time_End": 729.16,
      "Text": " can come out and say, well, my intent was educational purposes. But if you have a history,"
    },
    {
      "Time_Start": 729.16,
      "Time_End": 738.16,
      "Text": " if there's evidence of intent otherwise, basically, in the civil arena, you go before"
    },
    {
      "Time_Start": 738.16,
      "Time_End": 747.16,
      "Text": " a jury and your burden of persuasion is preponderance of the evidence. It's not beyond a reasonable"
    },
    {
      "Time_Start": 747.16,
      "Time_End": 755.16,
      "Text": " doubt. Preponderance of the evidence is more likely than not. 51% to 49%. And those are"
    },
    {
      "Time_Start": 755.16,
      "Time_End": 765.16,
      "Text": " the questions that when you consider your jury pool and your burden of persuasion, do"
    },
    {
      "Time_Start": 765.16,
      "Time_End": 772.16,
      "Text": " you want to really put that question before 12 people who really weren't even smart enough"
    },
    {
      "Time_Start": 772.16,
      "Time_End": 781.16,
      "Text": " to get out of jury duty? And those intellectual property questions, frankly, I'm not prepared"
    },
    {
      "Time_Start": 781.16,
      "Time_End": 782.16,
      "Text": " to discuss. I don't know."
    },
    {
      "Time_Start": 782.16,
      "Time_End": 783.16,
      "Text": " Sir?"
    },
    {
      "Time_Start": 784.16,
      "Time_End": 786.16,
      "Text": " I can't hear you."
    },
    {
      "Time_Start": 786.16,
      "Time_End": 815.16,
      "Text": " For federal jurisdiction, for the most part,"
    },
    {
      "Time_Start": 815.16,
      "Time_End": 819.16,
      "Text": " you have to have attacked a protected computer. A protected computer is one that's used in"
    },
    {
      "Time_Start": 819.16,
      "Time_End": 824.16,
      "Text": " interstate commerce or interstate communications. So what we look to see in a given case, let's"
    },
    {
      "Time_Start": 824.16,
      "Time_End": 830.16,
      "Text": " just say you send a threat over the internet, an email threat to your next door neighbor."
    },
    {
      "Time_Start": 830.16,
      "Time_End": 834.16,
      "Text": " If it happens to pass through, let's just say AOL in Virginia, then there's going to"
    },
    {
      "Time_Start": 834.16,
      "Time_End": 839.16,
      "Text": " be federal jurisdiction for it. If it never leaves the state of California or the state"
    },
    {
      "Time_Start": 839.16,
      "Time_End": 842.16,
      "Text": " of Nevada, if that's where you are, then there could not be federal jurisdiction for that"
    },
    {
      "Time_Start": 842.16,
      "Time_End": 847.16,
      "Text": " particular offense. If you put a modem pool within a given state, it would make it more"
    },
    {
      "Time_Start": 847.16,
      "Time_End": 851.16,
      "Text": " difficult for us to establish federal jurisdiction. We'd have to prove that the communications"
    },
    {
      "Time_Start": 851.16,
      "Time_End": 856.16,
      "Text": " involved actually went outside state lines. If we have a difficult time proving that,"
    },
    {
      "Time_Start": 856.16,
      "Time_End": 861.16,
      "Text": " we would defer to the locals. So it would likely result in more local prosecution versus"
    },
    {
      "Time_Start": 861.16,
      "Time_End": 862.16,
      "Text": " federal."
    },
    {
      "Time_Start": 863.16,
      "Time_End": 879.16,
      "Text": " So if a local connection to a local ISP within the state was rated by the Public Utilities"
    },
    {
      "Time_Start": 879.16,
      "Time_End": 884.16,
      "Text": " Commission as being an out-of-state call, that still does not call the FBI or anybody"
    },
    {
      "Time_Start": 884.16,
      "Time_End": 887.16,
      "Text": " else that deals with federal issues into prosecuting that case?"
    },
    {
      "Time_Start": 887.16,
      "Time_End": 891.16,
      "Text": " It doesn't matter what they call it. What we're concerned with is the reality."
    },
    {
      "Time_Start": 891.16,
      "Time_End": 892.16,
      "Text": " Okay. Thanks."
    },
    {
      "Time_Start": 896.16,
      "Time_End": 899.16,
      "Text": " Wait for the mic, that way we can... because I'm not repeating questions very well."
    },
    {
      "Time_Start": 899.16,
      "Time_End": 904.16,
      "Text": " Who determines the damages for the $5,000 limit? Because the New York Times quoted some"
    },
    {
      "Time_Start": 904.16,
      "Time_End": 909.16,
      "Text": " ridiculous number for being defaced. Can you just make up this number?"
    },
    {
      "Time_Start": 909.16,
      "Time_End": 914.16,
      "Text": " No, actually, the law requires that whatever losses that someone incurs as a result of"
    },
    {
      "Time_Start": 914.16,
      "Time_End": 919.16,
      "Text": " a malicious act have to be reasonable. So it's not even what they actually incur. If"
    },
    {
      "Time_Start": 919.16,
      "Time_End": 925.16,
      "Text": " you make the mistake of paying $50,000 for somebody that reasonably would charge $10,000,"
    },
    {
      "Time_Start": 925.16,
      "Time_End": 931.16,
      "Text": " then if there's an argument about that, the argument is resolved in favor of what is reasonable."
    },
    {
      "Time_Start": 931.16,
      "Time_End": 937.16,
      "Text": " And we actually have to prove up the losses. So the answer is no, it's not just whatever"
    },
    {
      "Time_Start": 937.16,
      "Time_End": 942.16,
      "Text": " somebody says it is. We actually have to document it, and we can only use it to the extent that"
    },
    {
      "Time_Start": 942.16,
      "Time_End": 947.16,
      "Text": " it's reasonable. Which is why there's not a lot of cases on, well, there are some cases"
    },
    {
      "Time_Start": 947.16,
      "Time_End": 952.16,
      "Text": " on website defacement. Most people just look at that as graffiti. If it's entertaining,"
    },
    {
      "Time_Start": 952.16,
      "Time_End": 958.16,
      "Text": " we don't really bother with it. I mean, it's true. But if you take the site down and make"
    },
    {
      "Time_Start": 958.16,
      "Time_End": 962.16,
      "Text": " the information unaccessible for an extended period of time, then it becomes malicious."
    },
    {
      "Time_Start": 962.16,
      "Time_End": 967.16,
      "Text": " I mean, the line between something that's entertaining and kind of a fun sort of prank"
    },
    {
      "Time_Start": 967.16,
      "Time_End": 971.16,
      "Text": " to something that's malicious is a continuum. It's one of those things that you know it"
    },
    {
      "Time_Start": 971.16,
      "Time_End": 976.16,
      "Text": " when you see it, and you don't know it when you do it. But to answer your question directly"
    },
    {
      "Time_Start": 976.16,
      "Time_End": 979.16,
      "Text": " is the losses have to be documented, and they have to be reasonable."
    },
    {
      "Time_Start": 979.16,
      "Time_End": 985.16,
      "Text": " And on the civil side, we run into very difficult problems in proving damages in these kind"
    },
    {
      "Time_Start": 985.16,
      "Time_End": 994.16,
      "Text": " of cases as well. You know, it comes down to, well, was there trade secrets stolen?"
    },
    {
      "Time_Start": 994.16,
      "Time_End": 1001.16,
      "Text": " What's the value of those trade secrets? Yeah, we copied someone's customer list. We didn't"
    },
    {
      "Time_Start": 1002.16,
      "Time_End": 1007.16,
      "Text": " take it. We didn't deprive them of it. But if someone takes your customer list and solicits"
    },
    {
      "Time_Start": 1007.16,
      "Time_End": 1015.16,
      "Text": " all your customers and your sales go down noticeably, you've been damaged. There's tremendous"
    },
    {
      "Time_Start": 1015.16,
      "Time_End": 1021.16,
      "Text": " problems in proving up damages in these kind of cases, often requiring expert testimony"
    },
    {
      "Time_Start": 1021.16,
      "Time_End": 1028.1599999999999,
      "Text": " from economists and you name it, Internet security specialists. It's a difficult area."
    },
    {
      "Time_Start": 1029.16,
      "Time_End": 1033.16,
      "Text": " Trade secret theft is really difficult. Primarily if something is taken while in development,"
    },
    {
      "Time_Start": 1033.16,
      "Time_End": 1037.16,
      "Text": " the issue is what's the loss? Is it the cost of development? The product may never reach"
    },
    {
      "Time_Start": 1037.16,
      "Time_End": 1041.16,
      "Text": " the market, so that there really isn't an actual loss. It becomes very difficult for"
    },
    {
      "Time_Start": 1041.16,
      "Time_End": 1044.16,
      "Text": " us to figure those cases, and there's not a lot of federal cases on it."
    },
    {
      "Time_Start": 1046.16,
      "Time_End": 1050.16,
      "Text": " Yes, sir. If you guys were IT managers, what steps would you take to educate your corporate"
    },
    {
      "Time_Start": 1050.16,
      "Time_End": 1056.16,
      "Text": " attorneys on people you catch hacking internally? You know, like prosecution?"
    },
    {
      "Time_Start": 1057.16,
      "Time_End": 1064.16,
      "Text": " That actually enters both of our areas. From my perspective, that there is an interest"
    },
    {
      "Time_Start": 1064.16,
      "Time_End": 1071.16,
      "Text": " in corporations understanding what criminals are doing within their system, if in fact"
    },
    {
      "Time_Start": 1071.16,
      "Time_End": 1075.16,
      "Text": " they're criminals within their system. I think it's important for them to know that, and"
    },
    {
      "Time_Start": 1075.16,
      "Time_End": 1083.16,
      "Text": " there's a general societal interest in rooting out evil, if in fact evil is what is occurring."
    },
    {
      "Time_Start": 1083.16,
      "Time_End": 1088.16,
      "Text": " But there's a far greater interest for corporations to take a serious look at their security,"
    },
    {
      "Time_Start": 1088.16,
      "Time_End": 1092.16,
      "Text": " and it's called money, and Brian will talk about that."
    },
    {
      "Time_Start": 1092.16,
      "Time_End": 1099.16,
      "Text": " Exactly. My job, if I'm defending a corporate entity which may be used as a springboard"
    },
    {
      "Time_Start": 1099.16,
      "Time_End": 1106.16,
      "Text": " for an attack, or a security consultant or a security company who is charged and has"
    },
    {
      "Time_Start": 1106.16,
      "Time_End": 1112.16,
      "Text": " taken on the job of preventing such attacks, is not rooting out evil. It is protecting"
    },
    {
      "Time_Start": 1112.16,
      "Time_End": 1121.16,
      "Text": " my client from liability. And, you know, the question you asked is nebulous and really"
    },
    {
      "Time_Start": 1121.16,
      "Time_End": 1133.16,
      "Text": " huge. I mean, if you find your employees actually participating in cracking activities, you"
    },
    {
      "Time_Start": 1133.16,
      "Time_End": 1136.16,
      "Text": " have to take a serious look at it. You have to talk about bringing in the authorities,"
    },
    {
      "Time_Start": 1136.16,
      "Time_End": 1138.16,
      "Text": " you have to contact your insurer."
    },
    {
      "Time_Start": 1138.16,
      "Time_End": 1142.16,
      "Text": " Let me refine that again. Let's say you catch somebody doing something pretty malicious"
    },
    {
      "Time_Start": 1142.16,
      "Time_End": 1146.16,
      "Text": " internally, maybe to yourself or someone outside. How do you guys, if you're an IT manager,"
    },
    {
      "Time_Start": 1146.16,
      "Time_End": 1151.16,
      "Text": " how would you educate? Because normally your attorneys aren't very smart on anything, really,"
    },
    {
      "Time_Start": 1151.16,
      "Time_End": 1156.16,
      "Text": " except for like prosecuting DUI people or whatever. But how do you educate them? What"
    },
    {
      "Time_Start": 1156.16,
      "Time_End": 1160.16,
      "Text": " steps would you guys take to educate them on perhaps something, you know, maybe hire"
    },
    {
      "Time_Start": 1160.16,
      "Time_End": 1166.16,
      "Text": " a consultant? What are some of the options that you guys would suggest? Is it just a"
    },
    {
      "Time_Start": 1166.16,
      "Time_End": 1173.16,
      "Text": " crazy question? Well, no. I mean, it's a very real world question and it depends on"
    },
    {
      "Time_Start": 1173.16,
      "Time_End": 1180.16,
      "Text": " a number of factors. If I'm an in-house counsel representing a corporation and I become aware"
    },
    {
      "Time_Start": 1180.16,
      "Time_End": 1188.16,
      "Text": " that my company's computers are being used for attacks or, you know, actually employees"
    },
    {
      "Time_Start": 1188.16,
      "Time_End": 1195.16,
      "Text": " are being attacked from within, we bring the authorities in right away. We bring the authorities"
    },
    {
      "Time_Start": 1195.16,
      "Time_End": 1202.16,
      "Text": " in and then we also, we do some severe risk analysis and find out to the best of our"
    },
    {
      "Time_Start": 1202.16,
      "Time_End": 1207.16,
      "Text": " ability, internal investigation on what's happened, what's the, you know, if it's a"
    },
    {
      "Time_Start": 1207.16,
      "Time_End": 1213.16,
      "Text": " one-time thing, if it's been going on for months, do some quick damage assessment, contact"
    },
    {
      "Time_Start": 1213.16,
      "Time_End": 1220.16,
      "Text": " our insurers, you know, get the ball rolling to protect the company's assets, whether it"
    },
    {
      "Time_Start": 1221.16,
      "Time_End": 1227.16,
      "Text": " be, you know, springboard liability and whatnot. But definitely, I think, I think you have"
    },
    {
      "Time_Start": 1227.16,
      "Time_End": 1234.16,
      "Text": " to bring in the authorities the minute you're aware of such an attack. One of the more interesting"
    },
    {
      "Time_Start": 1234.16,
      "Time_End": 1238.16,
      "Text": " parts of that, to the extent a company has its assets kept in digital format, I mean,"
    },
    {
      "Time_Start": 1238.16,
      "Time_End": 1242.16,
      "Text": " they want to be able to protect them. And if somebody steals their trade secret, they"
    },
    {
      "Time_Start": 1242.16,
      "Time_End": 1247.16,
      "Text": " want to be able to sue civilly or get the federal authorities interested in prosecuting."
    },
    {
      "Time_Start": 1247.16,
      "Time_End": 1251.16,
      "Text": " Unfortunately, the law defines a trade secret as something that not only is secret, but"
    },
    {
      "Time_Start": 1251.16,
      "Time_End": 1255.16,
      "Text": " that the company has taken reasonable measures to protect. If the company does not engage"
    },
    {
      "Time_Start": 1255.16,
      "Time_End": 1259.16,
      "Text": " in any security practice, how has it taken reasonable measures to protect its secret?"
    },
    {
      "Time_Start": 1259.16,
      "Time_End": 1263.16,
      "Text": " So that's one of the, that's one of the easy doors through which corporate managers can"
    },
    {
      "Time_Start": 1263.16,
      "Time_End": 1267.16,
      "Text": " start understanding that there's a price to be paid for only being worried if the printer"
    },
    {
      "Time_Start": 1267.16,
      "Time_End": 1273.16,
      "Text": " is working. Right, and that, that's where I see in the next five years as an exploding"
    },
    {
      "Time_Start": 1273.16,
      "Time_End": 1279.16,
      "Text": " area of litigation, the reasonableness of the steps taken by the companies to protect"
    },
    {
      "Time_Start": 1279.16,
      "Time_End": 1288.16,
      "Text": " the data of computer network, network people to, to secure their systems, to prevent them"
    },
    {
      "Time_Start": 1288.16,
      "Time_End": 1295.16,
      "Text": " from being used as a springboard, that sort of thing. Because one of the, one of the areas"
    },
    {
      "Time_Start": 1295.16,
      "Time_End": 1299.16,
      "Text": " I was charged with here was to, you know, basically scare the hell out of the young"
    },
    {
      "Time_Start": 1300.16,
      "Time_End": 1307.16,
      "Text": " hackers and the, the bottom line is that it, let's, let's assume that there's been an attack"
    },
    {
      "Time_Start": 1307.16,
      "Time_End": 1312.16,
      "Text": " and let's assume we've been able to prove, prove damages. Let's say we have five million"
    },
    {
      "Time_Start": 1312.16,
      "Time_End": 1318.16,
      "Text": " dollars of actual damages that we can prove in court. I'm not going to get that from some"
    },
    {
      "Time_Start": 1318.16,
      "Time_End": 1322.16,
      "Text": " 20-year-old college kid, you know, unless he hits the lottery or comes up with a great"
    },
    {
      "Time_Start": 1322.16,
      "Time_End": 1332.16,
      "Text": " patent next year. But what I can do is I can go after the, the companies that he, he"
    },
    {
      "Time_Start": 1332.16,
      "Time_End": 1342.16,
      "Text": " jumped through. I can go after their security consultants who, you know, I, I will sue the"
    },
    {
      "Time_Start": 1342.16,
      "Time_End": 1347.16,
      "Text": " kid and you know why I will sue him is I will sue him basically to use him as a tool to"
    },
    {
      "Time_Start": 1347.16,
      "Time_End": 1353.16,
      "Text": " get to the people who have the deep pockets. I will, I will sit him down in deposition"
    },
    {
      "Time_Start": 1353.16,
      "Time_End": 1361.16,
      "Text": " and I will, I will ask him every technique that he used to pull this off and if I can"
    },
    {
      "Time_Start": 1361.16,
      "Time_End": 1366.16,
      "Text": " somehow establish that he used an exploit that was known, that they've been talking"
    },
    {
      "Time_Start": 1366.16,
      "Time_End": 1371.16,
      "Text": " about here at DEF CON for the last five years that any reasonable security expert should"
    },
    {
      "Time_Start": 1371.16,
      "Time_End": 1376.16,
      "Text": " have known about and should have taken steps to prevent, I will be attempting to dip into"
    },
    {
      "Time_Start": 1377.16,
      "Time_End": 1383.16,
      "Text": " their pockets to make my client whole. And I see that. There's not a lot of cases now."
    },
    {
      "Time_Start": 1383.16,
      "Time_End": 1389.16,
      "Text": " I, I, you hear the scuttlebutt and there's law review articles coming out projecting"
    },
    {
      "Time_Start": 1389.16,
      "Time_End": 1395.16,
      "Text": " this as, as the burgeoning area of civil litigation in the next few years and I think that's"
    },
    {
      "Time_Start": 1395.16,
      "Time_End": 1401.16,
      "Text": " where it's going to go and I think people in-house attorneys at the various, you know,"
    },
    {
      "Time_Start": 1402.16,
      "Time_End": 1405.16,
      "Text": " security consultants or springboards should be aware of that now."
    },
    {
      "Time_Start": 1405.16,
      "Time_End": 1407.16,
      "Text": " Do you want to say hello, Jennifer?"
    },
    {
      "Time_Start": 1407.16,
      "Time_End": 1413.16,
      "Text": " Hi. I'm Jennifer Granick. I'm a criminal defense attorney. Sorry I'm late. I was in the bar"
    },
    {
      "Time_Start": 1413.16,
      "Time_End": 1419.16,
      "Text": " and I thought, I thought this was going to be in the room that the CDC thing was on and"
    },
    {
      "Time_Start": 1419.16,
      "Time_End": 1422.16,
      "Text": " since it was on the TV in there I thought oh I don't have to worry until they're done"
    },
    {
      "Time_Start": 1422.16,
      "Time_End": 1428.16,
      "Text": " with all of that so I, I apologize for being so late. But if you guys have any criminal"
    },
    {
      "Time_Start": 1428.16,
      "Time_End": 1431.16,
      "Text": " questions you want the defense perspective on you can direct those towards me."
    },
    {
      "Time_Start": 1431.16,
      "Time_End": 1436.16,
      "Text": " I've already, I've already turned them to the good side of the force. It is your destiny."
    },
    {
      "Time_Start": 1436.16,
      "Time_End": 1437.16,
      "Text": " That's right."
    },
    {
      "Time_Start": 1440.16,
      "Time_End": 1444.16,
      "Text": " Um, I have a question about as far as intent goes and things like gray hat hacking and"
    },
    {
      "Time_Start": 1444.16,
      "Time_End": 1450.16,
      "Text": " things where, you know, maliciousness is not always as apparent. Take for example someone"
    },
    {
      "Time_Start": 1450.16,
      "Time_End": 1455.16,
      "Text": " who's showing a company, oh, you know, I broke into your system, this is your security holes,"
    },
    {
      "Time_Start": 1455.16,
      "Time_End": 1461.16,
      "Text": " this is what I got, this is how you fix it. Um, but they weren't hired by the company"
    },
    {
      "Time_Start": 1461.16,
      "Time_End": 1466.16,
      "Text": " and it wasn't so, you know, cut and dry. How do you deal with the not so obvious?"
    },
    {
      "Time_Start": 1466.16,
      "Time_End": 1470.16,
      "Text": " The, the question of intent in a criminal case is always the most difficult. And you"
    },
    {
      "Time_Start": 1470.16,
      "Time_End": 1474.16,
      "Text": " can only, the only way, and the jury's instructed that the only way that you can make a decision"
    },
    {
      "Time_Start": 1474.16,
      "Time_End": 1479.16,
      "Text": " about intent is by looking at the person's, the person's actions. What they said, what"
    },
    {
      "Time_Start": 1479.16,
      "Time_End": 1483.16,
      "Text": " they did, both before and after the action that we're looking at. And we have to prove"
    },
    {
      "Time_Start": 1483.16,
      "Time_End": 1487.16,
      "Text": " criminal intent. It's important. The situation that you posit is one that there, and there"
    },
    {
      "Time_Start": 1487.16,
      "Time_End": 1492.16,
      "Text": " are gray hat hackers who go ahead and scan a system, find a vulnerability. The question"
    },
    {
      "Time_Start": 1492.16,
      "Time_End": 1497.16,
      "Text": " comes up once they go ahead and exploit the vulnerability, have they done so with pure"
    },
    {
      "Time_Start": 1497.16,
      "Time_End": 1502.16,
      "Text": " motive or is their motive less than pure? If the message they send to the company is"
    },
    {
      "Time_Start": 1502.16,
      "Time_End": 1507.16,
      "Text": " I found a vulnerability in your system and I exploited it, and if you pay me $15,000"
    },
    {
      "Time_Start": 1507.16,
      "Time_End": 1511.16,
      "Text": " I'll repair it for you. Otherwise, I'm gonna put it, I'm gonna post it. Then we have a"
    },
    {
      "Time_Start": 1512.16,
      "Time_End": 1517.16,
      "Text": " situation of what we call extortion. Taking something that doesn't belong to you. And"
    },
    {
      "Time_Start": 1517.16,
      "Time_End": 1520.16,
      "Text": " it would be extortion."
    },
    {
      "Time_Start": 1520.16,
      "Time_End": 1524.16,
      "Text": " I wanna, I wanna respond to that because I don't think that's an accurate reflection"
    },
    {
      "Time_Start": 1524.16,
      "Time_End": 1530.16,
      "Text": " of what the law is. 1030 does not, the prosecutor's gonna give you the gloss on it, but the truth"
    },
    {
      "Time_Start": 1530.16,
      "Time_End": 1535.16,
      "Text": " is that 1030 doesn't require maliciousness. 1030 requires knowledge. So regardless of"
    },
    {
      "Time_Start": 1535.16,
      "Time_End": 1539.16,
      "Text": " the purity of your motives, if you have knowledge that you're gaining unauthorized access, you"
    },
    {
      "Time_Start": 1539.16,
      "Time_End": 1545.16,
      "Text": " can violate the unauthorized access statute, which is 18 U.S.C. 1030. And I have had cases"
    },
    {
      "Time_Start": 1545.16,
      "Time_End": 1552.16,
      "Text": " where a security company offered to provide services to a, an internet business, and the"
    },
    {
      "Time_Start": 1552.16,
      "Time_End": 1556.16,
      "Text": " system operator of the internet business said, well they're not, they don't know anything,"
    },
    {
      "Time_Start": 1556.16,
      "Time_End": 1560.16,
      "Text": " their own security's not good. And the security company said, yes it is, and the system operator"
    },
    {
      "Time_Start": 1560.16,
      "Time_End": 1566.16,
      "Text": " broke into their system and stole one of the internet company's own proprietary documents"
    },
    {
      "Time_Start": 1566.16,
      "Time_End": 1570.16,
      "Text": " that was stored on the security company's server, showed it to his manager and said,"
    },
    {
      "Time_Start": 1570.16,
      "Time_End": 1575.16,
      "Text": " look, they're not secure, I stole our own proprietary information off their server like"
    },
    {
      "Time_Start": 1575.16,
      "Time_End": 1579.16,
      "Text": " that. And then the manager brought it to the, to the security company, and then the security"
    },
    {
      "Time_Start": 1579.16,
      "Time_End": 1584.16,
      "Text": " company brought it to the FBI. And that's a violation of 1030 because he gained unauthorized"
    },
    {
      "Time_Start": 1584.16,
      "Time_End": 1591.16,
      "Text": " access. His motives were pure to protect his company from the mistake of hiring a security"
    },
    {
      "Time_Start": 1592.16,
      "Time_End": 1600.16,
      "Text": " company that was full of shit. But nonetheless, nonetheless he still had to meet me. So maliciousness"
    },
    {
      "Time_Start": 1600.16,
      "Time_End": 1604.16,
      "Text": " is not always an element of the statute, your motives can be pure and you can still get"
    },
    {
      "Time_Start": 1604.16,
      "Time_End": 1608.16,
      "Text": " to. If Jennifer hadn't been in the bar and was here when we were talking about this earlier,"
    },
    {
      "Time_Start": 1608.16,
      "Time_End": 1611.16,
      "Text": " she would have heard what I talked about at the beginning, about there are things that"
    },
    {
      "Time_Start": 1611.16,
      "Time_End": 1616.16,
      "Text": " may be technically illegal, and we can debate forever the areas of technical illegality"
    },
    {
      "Time_Start": 1616.16,
      "Time_End": 1620.16,
      "Text": " versus real illegality, but the good prosecutors only do the cases where maliciousness is clear,"
    },
    {
      "Time_Start": 1621.16,
      "Time_End": 1628.16,
      "Text": " at least to us. That's true. That's absolutely true. There are bad prosecutors as there are"
    },
    {
      "Time_Start": 1628.16,
      "Time_End": 1631.16,
      "Text": " bad computer system managers."
    },
    {
      "Time_Start": 1631.16,
      "Time_End": 1636.16,
      "Text": " So I'm really clear that the law should not criminalize things that are not prosecutable."
    },
    {
      "Time_Start": 1636.16,
      "Time_End": 1640.16,
      "Text": " The law should clearly say what's going to be illegal and not illegal, and we shouldn't"
    },
    {
      "Time_Start": 1640.16,
      "Time_End": 1646.16,
      "Text": " depend upon the good graces and discretion of some prosecutor to protect our rights."
    },
    {
      "Time_Start": 1646.16,
      "Time_End": 1649.16,
      "Text": " Your argument is not with me, your argument is with the Congress of the United States,"
    },
    {
      "Time_Start": 1649.16,
      "Time_End": 1653.16,
      "Text": " the representatives of the people here today. If you want to change the law, be my guest."
    },
    {
      "Time_Start": 1653.16,
      "Time_End": 1658.16,
      "Text": " What I'm trying to do, what we only try and do is take the worst of the worst off the"
    },
    {
      "Time_Start": 1658.16,
      "Time_End": 1663.16,
      "Text": " street. If I prosecuted every single act that's been made illegal by the Congress, I wouldn't"
    },
    {
      "Time_Start": 1663.16,
      "Time_End": 1668.16,
      "Text": " be here enjoying your company today. I'd be too busy. So we're forced as a result of resource"
    },
    {
      "Time_Start": 1668.16,
      "Time_End": 1674.16,
      "Text": " allocation to only skim the cream, and those of us who do our job responsibly do that."
    },
    {
      "Time_Start": 1674.16,
      "Time_End": 1679.16,
      "Text": " There are others, and we both know them, but the reality is if you're looking at what"
    },
    {
      "Time_Start": 1679.16,
      "Time_End": 1682.16,
      "Text": " you can do and what you can't do, if that's what we're here to talk about, if you're knowingly"
    },
    {
      "Time_Start": 1682.16,
      "Time_End": 1686.16,
      "Text": " engaging in malicious activity and you're doing damage or you're stealing something,"
    },
    {
      "Time_Start": 1686.16,
      "Time_End": 1688.16,
      "Text": " you're going to be talking to us."
    },
    {
      "Time_Start": 1688.16,
      "Time_End": 1695.16,
      "Text": " And one aspect that becomes involved with trade secrets, especially in large corporations,"
    },
    {
      "Time_Start": 1695.16,
      "Time_End": 1703.16,
      "Text": " is is it actually a secret or has it been made available to the public? I've had a case"
    },
    {
      "Time_Start": 1703.16,
      "Time_End": 1711.16,
      "Text": " in the civil arena suing an oil company, it will remain nameless, where I was in court"
    },
    {
      "Time_Start": 1711.16,
      "Time_End": 1718.16,
      "Text": " jumping up and down trying to get access to some documents, and we had an army of lawyers"
    },
    {
      "Time_Start": 1718.16,
      "Time_End": 1723.16,
      "Text": " on the other side basically saying that it would be the end of the world as we know it"
    },
    {
      "Time_Start": 1723.16,
      "Time_End": 1728.16,
      "Text": " if I was able to get these documents. And essentially, you know, I had the documents"
    },
    {
      "Time_Start": 1728.16,
      "Time_End": 1734.16,
      "Text": " in my hand, and I got the documents from the oil company's website the night before."
    },
    {
      "Time_Start": 1734.16,
      "Time_End": 1738.16,
      "Text": " So I was able to tell the judge, you know, the end of the world is here, Your Honor,"
    },
    {
      "Time_Start": 1738.16,
      "Time_End": 1745.16,
      "Text": " but I still need copies of these documents given to me under oath. And the upshot was"
    },
    {
      "Time_Start": 1745.16,
      "Time_End": 1751.16,
      "Text": " it resulted in a $10,000 discovery sanction for the oil company. But what happens a lot"
    },
    {
      "Time_Start": 1751.16,
      "Time_End": 1757.16,
      "Text": " of times is these companies, the larger the company, the left hand may not know what the"
    },
    {
      "Time_Start": 1757.16,
      "Time_End": 1762.16,
      "Text": " right hand is doing. They can be jumping up and down screaming trade secret, yet their"
    },
    {
      "Time_Start": 1762.16,
      "Time_End": 1766.16,
      "Text": " public relations department has posted the information in a press release six months"
    },
    {
      "Time_Start": 1766.16,
      "Time_End": 1771.16,
      "Text": " ago. So, you know, that's an issue that comes up from time to time."
    },
    {
      "Time_Start": 1771.16,
      "Time_End": 1780.16,
      "Text": " To the civil litigator, as someone that's working independently, doing security auditing"
    },
    {
      "Time_Start": 1780.16,
      "Time_End": 1785.16,
      "Text": " for someone, what steps would you recommend that person take to protect themselves in"
    },
    {
      "Time_Start": 1785.16,
      "Time_End": 1792.16,
      "Text": " the event that, you know, the company gets broken into afterwards?"
    },
    {
      "Time_Start": 1792.16,
      "Time_End": 1795.16,
      "Text": " As far as to protect your assets?"
    },
    {
      "Time_Start": 1795.16,
      "Time_End": 1800.16,
      "Text": " Yeah. You can knock off the ETS, too."
    },
    {
      "Time_Start": 1800.16,
      "Time_End": 1804.16,
      "Text": " I think what you need to do, one, is look at your form of business. You may want to"
    },
    {
      "Time_Start": 1804.16,
      "Time_End": 1811.16,
      "Text": " go into an LLC, a corporation. You want to get insurance. You want to get E&O coverage."
    },
    {
      "Time_Start": 1811.16,
      "Time_End": 1817.16,
      "Text": " And the amount of coverage you need, I think you need to look at, do a good analysis of"
    },
    {
      "Time_Start": 1817.16,
      "Time_End": 1826.16,
      "Text": " your exposure. What is the likely exposure or what is the possible exposure that, you"
    },
    {
      "Time_Start": 1826.16,
      "Time_End": 1834.16,
      "Text": " know, is going to fall your way? And go out and spend some money and get insurance and"
    },
    {
      "Time_Start": 1834.16,
      "Time_End": 1839.16,
      "Text": " talk to an attorney. Talk to an attorney, look at your documents. Some of these things"
    },
    {
      "Time_Start": 1839.16,
      "Time_End": 1846.16,
      "Text": " you can contract away with your clients. You know, because you're in a risky business."
    },
    {
      "Time_Start": 1846.16,
      "Time_End": 1851.16,
      "Text": " You may be doing everything right, and still there may be some evil genius in the back"
    },
    {
      "Time_Start": 1851.16,
      "Time_End": 1856.16,
      "Text": " of the room who may crack your firewall even though you did nothing wrong. He just may"
    },
    {
      "Time_Start": 1856.16,
      "Time_End": 1862.16,
      "Text": " have tripped on. You might not have been negligent, but if there is damage, they're going to look"
    },
    {
      "Time_Start": 1862.16,
      "Time_End": 1869.16,
      "Text": " to you. So protect yourself, you know, by maybe changing your form of business. Look"
    },
    {
      "Time_Start": 1869.16,
      "Time_End": 1878.16,
      "Text": " into E&O coverage and discuss with your clients a way to maybe, you know, contract out and"
    },
    {
      "Time_Start": 1878.16,
      "Time_End": 1882.16,
      "Text": " get an indemnification clause from them. You may not get it. I wouldn't give it to you,"
    },
    {
      "Time_Start": 1882.16,
      "Time_End": 1889.16,
      "Text": " but they might depending on if your talents are so critical to their success and they"
    },
    {
      "Time_Start": 1889.16,
      "Time_End": 1894.16,
      "Text": " want you, they may be willing to negotiate with you and hold you harmless from any events."
    },
    {
      "Time_Start": 1894.16,
      "Time_End": 1900.16,
      "Text": " Don't count on it, but it's worth a shot. We've got to pass the mic around so people"
    },
    {
      "Time_Start": 1900.16,
      "Time_End": 1909.16,
      "Text": " can hear what's going on. I know you want to keep it. Rock out."
    },
    {
      "Time_Start": 1909.16,
      "Time_End": 1921.16,
      "Text": " You had mentioned code section, I believe 1300 or 1301 about criminalizing unauthorized"
    },
    {
      "Time_Start": 1921.16,
      "Time_End": 1927.16,
      "Text": " access. 1030. 1030, thank you. What does this do in a situation where you've got a company"
    },
    {
      "Time_Start": 1927.16,
      "Time_End": 1933.16,
      "Text": " like Yahoo that's checking into deep links at various other websites when those websites"
    },
    {
      "Time_Start": 1933.16,
      "Time_End": 1940.16,
      "Text": " specifically don't want that deep linking done? Does that criminalize that behavior"
    },
    {
      "Time_Start": 1940.16,
      "Time_End": 1946.16,
      "Text": " also? Generally, I'll just make it clear, generally business to business behavior unless"
    },
    {
      "Time_Start": 1946.16,
      "Time_End": 1951.16,
      "Text": " somebody's stealing someone else's property is not something that we look at. Deep linking,"
    },
    {
      "Time_Start": 1951.16,
      "Time_End": 1957.16,
      "Text": " I guess you're talking about a basic or exceeding an authorized access if it's even that. We"
    },
    {
      "Time_Start": 1957.16,
      "Time_End": 1961.16,
      "Text": " recognize one of the things that's a reality, even though Jennifer doesn't think it's a"
    },
    {
      "Time_Start": 1961.16,
      "Time_End": 1966.16,
      "Text": " good thing, if you simply exceed authorized access or access without authority, protected"
    },
    {
      "Time_Start": 1966.16,
      "Time_End": 1971.16,
      "Text": " computer and obtain information and do nothing more than that, that's a misdemeanor. There"
    },
    {
      "Time_Start": 1971.16,
      "Time_End": 1976.16,
      "Text": " is almost no federal prosecutor in the country that will willingly accept a misdemeanor case."
    },
    {
      "Time_Start": 1976.16,
      "Time_End": 1981.16,
      "Text": " We just don't do them because we're too damn busy doing other stuff. So if it gives you"
    },
    {
      "Time_Start": 1981.16,
      "Time_End": 1985.16,
      "Text": " a comfort level to know that you can access a protected computer, obtain information and"
    },
    {
      "Time_Start": 1985.16,
      "Time_End": 1989.16,
      "Text": " you probably won't get prosecuted, fine. Go home with that knowledge and sleep secure."
    },
    {
      "Time_Start": 1989.16,
      "Time_End": 1994.16,
      "Text": " But on the other hand, don't let that embolden you, is my message, to go beyond and enter"
    },
    {
      "Time_Start": 1994.16,
      "Time_End": 1999.16,
      "Text": " the felony zone which is steal stuff or damage stuff because then we'll be talking to you."
    },
    {
      "Time_Start": 1999.16,
      "Time_End": 2003.16,
      "Text": " I just want to add that there is a case that sort of touches on what I think you're talking"
    },
    {
      "Time_Start": 2003.16,
      "Time_End": 2009.16,
      "Text": " about which is the bidder's edge case in which a company called bidder's edge, like a bidder"
    },
    {
      "Time_Start": 2009.16,
      "Time_End": 2014.16,
      "Text": " in an auction, was doing mining of other auction sites and compiling them all so people could"
    },
    {
      "Time_Start": 2014.16,
      "Time_End": 2019.16,
      "Text": " see what the best price was on an auction. And eBay then went back and sued them saying"
    },
    {
      "Time_Start": 2019.16,
      "Time_End": 2023.16,
      "Text": " that they had gained unauthorized access to eBay's system by collecting this information"
    },
    {
      "Time_Start": 2023.16,
      "Time_End": 2027.16,
      "Text": " and using it in their own business. So this is something that we're seeing worked out"
    },
    {
      "Time_Start": 2027.16,
      "Time_End": 2032.16,
      "Text": " not so much in the criminal context for the reasons that my colleague has so excellently"
    },
    {
      "Time_Start": 2032.16,
      "Time_End": 2034.16,
      "Text": " stated, but in the civil context as well."
    },
    {
      "Time_Start": 2034.16,
      "Time_End": 2036.16,
      "Text": " Don't try and make up now."
    },
    {
      "Time_Start": 2036.16,
      "Time_End": 2042.16,
      "Text": " So in that case there could be civil damages as opposed to criminal prosecution."
    },
    {
      "Time_Start": 2042.16,
      "Time_End": 2044.16,
      "Text": " Right, exactly."
    },
    {
      "Time_Start": 2044.16,
      "Time_End": 2047.16,
      "Text": " Pass the mic back to you."
    },
    {
      "Time_Start": 2047.16,
      "Time_End": 2054.16,
      "Text": " I just have a question of where on the prosecutorial and defense side is counter strike hacking"
    },
    {
      "Time_Start": 2054.16,
      "Time_End": 2058.16,
      "Text": " or hacking back as we saw recently with the World Trade Organization denial of service"
    },
    {
      "Time_Start": 2058.16,
      "Time_End": 2064.16,
      "Text": " attacks which were reversed and sent right back to the group of hackers which was malicious,"
    },
    {
      "Time_Start": 2064.16,
      "Time_End": 2069.16,
      "Text": " caused damage, but at the same time was simply just a deflection of what they were doing."
    },
    {
      "Time_Start": 2070.16,
      "Time_End": 2077.16,
      "Text": " The problem with counter attack is that to the extent that you are sniffing a system"
    },
    {
      "Time_Start": 2077.16,
      "Time_End": 2082.16,
      "Text": " that doesn't belong to you in order to keep going up the chain, then you're probably violating"
    },
    {
      "Time_Start": 2082.16,
      "Time_End": 2089.16,
      "Text": " the federal wiretap statutes. There are no protections or there's no exception under"
    },
    {
      "Time_Start": 2089.16,
      "Time_End": 2094.16,
      "Text": " the federal wiretap statutes for trespassers. And the federal wiretap statute doesn't only"
    },
    {
      "Time_Start": 2094.16,
      "Time_End": 2098.16,
      "Text": " apply to government activity, but it also applies to private activity. So if you can"
    },
    {
      "Time_Start": 2098.16,
      "Time_End": 2103.16,
      "Text": " hack back to somebody without sniffing a system that you don't have rights to, then you're"
    },
    {
      "Time_Start": 2103.16,
      "Time_End": 2109.16,
      "Text": " probably in violation of federal law. Would you be prosecuted? The odds are I would say"
    },
    {
      "Time_Start": 2109.16,
      "Time_End": 2116.16,
      "Text": " no because we wouldn't want to be in a position of trying to explain to a jury why you're"
    },
    {
      "Time_Start": 2116.16,
      "Time_End": 2120.16,
      "Text": " a bad person for going back after somebody who did some damage to you. It's the kind"
    },
    {
      "Time_Start": 2121.16,
      "Time_End": 2124.16,
      "Text": " of thing we would hope can be worked out in a civil arena, particularly if you violated"
    },
    {
      "Time_Start": 2124.16,
      "Time_End": 2128.16,
      "Text": " some federal statutes on the way. So hacking back is not a good idea if you're going to"
    },
    {
      "Time_Start": 2128.16,
      "Time_End": 2132.16,
      "Text": " be looking to the government to protect you down the road, and maybe a bad idea if you're"
    },
    {
      "Time_Start": 2132.16,
      "Time_End": 2138.16,
      "Text": " otherwise in hot water with the government because of the wiretap laws. It's our favorite"
    },
    {
      "Time_Start": 2138.16,
      "Time_End": 2142.16,
      "Text": " statute. It's a lot easier to prove a federal wiretap violation than almost anything else"
    },
    {
      "Time_Start": 2142.16,
      "Time_End": 2147.16,
      "Text": " that a cracker can do. Most crackers, one of the first things they do is put the sniffer"
    },
    {
      "Time_Start": 2147.16,
      "Time_End": 2151.16,
      "Text": " in in order to get other passwords and logins. And that's the kind of thing we don't have"
    },
    {
      "Time_Start": 2151.16,
      "Time_End": 2158.16,
      "Text": " to prove much, only that it was an interception that occurred. So that's, if there's any other"
    },
    {
      "Time_Start": 2158.16,
      "Time_End": 2161.16,
      "Text": " advice I can have you take away from this is don't do that."
    },
    {
      "Time_Start": 2162.16,
      "Time_End": 2165.16,
      "Text": " Can we get this guy and then this gentleman and then this gentleman?"
    },
    {
      "Time_Start": 2165.16,
      "Time_End": 2167.16,
      "Text": " Okay. Can we do this gentleman?"
    },
    {
      "Time_Start": 2169.16,
      "Time_End": 2174.16,
      "Text": " Here comes the mic. Unless you want to talk real, stand up and talk real loud, practice"
    },
    {
      "Time_Start": 2174.16,
      "Time_End": 2175.16,
      "Text": " your public speaking."
    },
    {
      "Time_Start": 2181.16,
      "Time_End": 2186.16,
      "Text": " I sort of have a question on the extent of liability and insurance, and I'm going to"
    },
    {
      "Time_Start": 2186.16,
      "Time_End": 2190.16,
      "Text": " use an analogy here. If I leave my car in the red light district with the keys in it"
    },
    {
      "Time_Start": 2190.16,
      "Time_End": 2194.16,
      "Text": " and the door's unlocked, the law's not going to do a whole lot to protect me if I really"
    },
    {
      "Time_Start": 2194.16,
      "Time_End": 2199.16,
      "Text": " sign on and say steal this car. How far is the law going to go to protect systems that"
    },
    {
      "Time_Start": 2199.16,
      "Time_End": 2204.16,
      "Text": " are basically set up wide open with a big welcome banner saying come on in?"
    },
    {
      "Time_Start": 2204.16,
      "Time_End": 2210.16,
      "Text": " You just couldn't help yourself? Are you going to be able to sell that to the blue haired"
    },
    {
      "Time_Start": 2210.16,
      "Time_End": 2213.16,
      "Text": " old women and retirees that are sitting on that jury?"
    },
    {
      "Time_Start": 2213.16,
      "Time_End": 2215.16,
      "Text": " I'm not a lawyer so I wouldn't be able to do that."
    },
    {
      "Time_Start": 2215.16,
      "Time_End": 2221.16,
      "Text": " I think I'd have a better chance of selling them that I'm a male model than that story."
    },
    {
      "Time_Start": 2225.16,
      "Time_End": 2229.16,
      "Text": " Think about it. You don't have to persuade me because you're paying me, I'll believe"
    },
    {
      "Time_Start": 2229.16,
      "Time_End": 2230.16,
      "Text": " you."
    },
    {
      "Time_Start": 2235.16,
      "Time_End": 2240.16,
      "Text": " You're going to have to persuade the people that are sitting on that jury that I just"
    },
    {
      "Time_Start": 2240.16,
      "Time_End": 2243.16,
      "Text": " couldn't help myself and it's not going to fly."
    },
    {
      "Time_Start": 2243.16,
      "Time_End": 2246.16,
      "Text": " That argument actually comes up in some of the criminal cases too, the argument that"
    },
    {
      "Time_Start": 2246.16,
      "Time_End": 2251.16,
      "Text": " you didn't exceed authorized access if the system was so poorly configured that pretty"
    },
    {
      "Time_Start": 2251.16,
      "Time_End": 2254.16,
      "Text": " much anybody with some basic skill can walk in."
    },
    {
      "Time_Start": 2254.16,
      "Time_End": 2257.16,
      "Text": " And that gets back to the old concepts of right and wrong. If you know that you're doing"
    },
    {
      "Time_Start": 2257.16,
      "Time_End": 2263.16,
      "Text": " wrong, then you probably are. And we can argue all day about whether people deserve what"
    },
    {
      "Time_Start": 2263.16,
      "Time_End": 2267.16,
      "Text": " happens to them. I mean just because I forget to lock my apartment one day, does that give"
    },
    {
      "Time_Start": 2267.16,
      "Time_End": 2271.16,
      "Text": " a neighbor the right to open the door and take my stereo? I don't think so."
    },
    {
      "Time_Start": 2271.16,
      "Time_End": 2276.16,
      "Text": " I mean who would say that that's okay? I mean if I happen to leave my shades open at night"
    },
    {
      "Time_Start": 2276.16,
      "Time_End": 2281.16,
      "Text": " and somebody creeps through the bushes, climbs a tree to take a peek at me in the nude, I"
    },
    {
      "Time_Start": 2281.16,
      "Time_End": 2285.16,
      "Text": " mean the peeping Tom thing, who thinks that's good? I mean that kind of obtaining information,"
    },
    {
      "Time_Start": 2285.16,
      "Time_End": 2287.16,
      "Text": " you know that it's wrong."
    },
    {
      "Time_Start": 2287.16,
      "Time_End": 2290.16,
      "Text": " I mean exactly, but you don't know what you're getting until you peek in the window. You"
    },
    {
      "Time_Start": 2290.16,
      "Time_End": 2293.16,
      "Text": " see me, you go, shit, I climbed a tree for nothing."
    },
    {
      "Time_Start": 2295.16,
      "Time_End": 2297.16,
      "Text": " Jennifer had the tree cut down outside her house."
    },
    {
      "Time_Start": 2298.16,
      "Time_End": 2300.16,
      "Text": " There's no trees outside my house."
    },
    {
      "Time_Start": 2301.16,
      "Time_End": 2304.16,
      "Text": " That's where we have a cross complaint because both sides are damaged."
    },
    {
      "Time_Start": 2312.16,
      "Time_End": 2313.16,
      "Text": " The gentleman in the hat."
    },
    {
      "Time_Start": 2313.16,
      "Time_End": 2315.16,
      "Text": " Send the mic back. To the man with the hat."
    },
    {
      "Time_Start": 2315.16,
      "Time_End": 2317.16,
      "Text": " Who's got the mic?"
    },
    {
      "Time_Start": 2317.16,
      "Time_End": 2318.16,
      "Text": " Somebody stole our mic."
    },
    {
      "Time_Start": 2318.16,
      "Time_End": 2320.16,
      "Text": " Oh, sorry. The other guy with the hat."
    },
    {
      "Time_Start": 2320.16,
      "Time_End": 2322.16,
      "Text": " Somebody should play Jerry Springer and kind of roll around."
    },
    {
      "Time_Start": 2322.16,
      "Time_End": 2323.16,
      "Text": " Should I do it?"
    },
    {
      "Time_Start": 2323.16,
      "Time_End": 2330.16,
      "Text": " As an extension to the previous question there, how does implied access, I mean if you go"
    },
    {
      "Time_Start": 2330.16,
      "Time_End": 2336.16,
      "Text": " to a government website, you know, it's public, there's no passwords, you generally assume"
    },
    {
      "Time_Start": 2336.16,
      "Time_End": 2339.16,
      "Text": " you're allowed to go in, look around, anything that's linked there."
    },
    {
      "Time_Start": 2339.16,
      "Time_End": 2344.16,
      "Text": " So they're giving you access to certain files within a certain directory structure in the"
    },
    {
      "Time_Start": 2344.16,
      "Time_End": 2345.16,
      "Text": " system."
    },
    {
      "Time_Start": 2345.16,
      "Time_End": 2351.16,
      "Text": " Now if on that same box they had an open net bio share with no password, there's nothing"
    },
    {
      "Time_Start": 2351.16,
      "Time_End": 2356.16,
      "Text": " in the front gate telling you don't enter, but because there's nothing, it's just like"
    },
    {
      "Time_Start": 2357.16,
      "Time_End": 2359.16,
      "Text": " your website, you're giving them access."
    },
    {
      "Time_Start": 2359.16,
      "Time_End": 2362.16,
      "Text": " But in this case it happens to be the entire drive."
    },
    {
      "Time_Start": 2362.16,
      "Time_End": 2366.16,
      "Text": " How does that really differ from a legal standpoint?"
    },
    {
      "Time_Start": 2366.16,
      "Time_End": 2371.16,
      "Text": " On the civil side, we're basically looking at a trespass analysis here."
    },
    {
      "Time_Start": 2371.16,
      "Time_End": 2377.16,
      "Text": " If I invite you in, if I'm a bar owner and I invite you in to come in and have a good"
    },
    {
      "Time_Start": 2377.16,
      "Time_End": 2379.16,
      "Text": " time, that's fine."
    },
    {
      "Time_Start": 2379.16,
      "Time_End": 2381.16,
      "Text": " And Jennifer will be there."
    },
    {
      "Time_Start": 2381.16,
      "Time_End": 2384.16,
      "Text": " Jennifer will be there longer than she should."
    },
    {
      "Time_Start": 2384.16,
      "Time_End": 2388.16,
      "Text": " But if you then sit at my bar and reach across the bar and grab my margarita bowl and throw"
    },
    {
      "Time_Start": 2388.16,
      "Time_End": 2395.16,
      "Text": " up into it or something, you have exceeded your access and your authorization and you"
    },
    {
      "Time_Start": 2395.16,
      "Time_End": 2397.16,
      "Text": " have caused me damage."
    },
    {
      "Time_Start": 2400.16,
      "Time_End": 2405.16,
      "Text": " And you know, when you're talking about government websites, I do a lot of legal research on"
    },
    {
      "Time_Start": 2405.16,
      "Time_End": 2407.16,
      "Text": " government websites because they're excellent."
    },
    {
      "Time_Start": 2408.16,
      "Time_End": 2413.16,
      "Text": " But usually, once again, in the civil arena, you're talking about reasonableness."
    },
    {
      "Time_Start": 2413.16,
      "Time_End": 2417.16,
      "Text": " And when you're talking about reasonableness, you're talking about what can I persuade a"
    },
    {
      "Time_Start": 2417.16,
      "Time_End": 2420.16,
      "Text": " jury with a preponderance of the evidence standard."
    },
    {
      "Time_Start": 2420.16,
      "Time_End": 2422.16,
      "Text": " And it's not that hard."
    },
    {
      "Time_Start": 2422.16,
      "Time_End": 2426.16,
      "Text": " If there are hard cases, those are the ones that get litigated and make law."
    },
    {
      "Time_Start": 2426.16,
      "Time_End": 2429.16,
      "Text": " But we don't have that law right now, but you know."
    },
    {
      "Time_Start": 2429.16,
      "Time_End": 2431.16,
      "Text": " I actually look at what the end result is."
    },
    {
      "Time_Start": 2431.16,
      "Time_End": 2436.16,
      "Text": " If you get access because the system has been so poorly configured, the website is so bad"
    },
    {
      "Time_Start": 2436.16,
      "Time_End": 2438.16,
      "Text": " that you get into places you shouldn't."
    },
    {
      "Time_Start": 2438.16,
      "Time_End": 2440.16,
      "Text": " And then you just start deleting files."
    },
    {
      "Time_Start": 2440.16,
      "Time_End": 2445.16,
      "Text": " At that point, there's no question that you know what you're doing is wrong and I'm with you."
    },
    {
      "Time_Start": 2445.16,
      "Time_End": 2447.16,
      "Text": " I'm all over you."
    },
    {
      "Time_Start": 2447.16,
      "Time_End": 2450.16,
      "Text": " If all you've done is look around and go, ha ha, look at these idiots."
    },
    {
      "Time_Start": 2450.16,
      "Time_End": 2454.16,
      "Text": " Is there a potential federal misdemeanor there?"
    },
    {
      "Time_Start": 2454.16,
      "Time_End": 2455.16,
      "Text": " Maybe."
    },
    {
      "Time_Start": 2455.16,
      "Time_End": 2456.16,
      "Text": " Do I care?"
    },
    {
      "Time_Start": 2456.16,
      "Time_End": 2457.16,
      "Text": " No."
    },
    {
      "Time_Start": 2457.16,
      "Time_End": 2460.16,
      "Text": " No, this is that invitation part of this."
    },
    {
      "Time_Start": 2460.16,
      "Time_End": 2461.16,
      "Text": " Well, what's the invitation?"
    },
    {
      "Time_Start": 2462.16,
      "Time_End": 2466.16,
      "Text": " Simply by having your system poorly configured is not the same thing as having a welcome sign."
    },
    {
      "Time_Start": 2466.16,
      "Time_End": 2468.16,
      "Text": " It's not saying steal this car."
    },
    {
      "Time_Start": 2468.16,
      "Time_End": 2472.16,
      "Text": " You see the issue is it's not about the invitation."
    },
    {
      "Time_Start": 2472.16,
      "Time_End": 2474.16,
      "Text": " It's about the action that results from it."
    },
    {
      "Time_Start": 2474.16,
      "Time_End": 2475.16,
      "Text": " That's what he's saying."
    },
    {
      "Time_Start": 2475.16,
      "Time_End": 2481.16,
      "Text": " If you have malicious intent, just because someone's walking around with a tax card doesn't mean you can go out."
    },
    {
      "Time_Start": 2481.16,
      "Time_End": 2484.16,
      "Text": " This is an excellent point."
    },
    {
      "Time_Start": 2484.16,
      "Time_End": 2490.16,
      "Text": " As a practical matter, what I see is that often to prove unauthorized access, all they have to do is they bring in the victim"
    },
    {
      "Time_Start": 2490.16,
      "Time_End": 2493.16,
      "Text": " to say, like, I didn't mean he could get in there."
    },
    {
      "Time_Start": 2493.16,
      "Time_End": 2497.16,
      "Text": " And you have to understand that, especially I think this is difficult for technical people,"
    },
    {
      "Time_Start": 2497.16,
      "Time_End": 2500.16,
      "Text": " that permissions is not the same as permission."
    },
    {
      "Time_Start": 2500.16,
      "Time_End": 2505.16,
      "Text": " Just because it's set up so you can doesn't mean that you are allowed."
    },
    {
      "Time_Start": 2505.16,
      "Time_End": 2510.16,
      "Text": " But as a practical matter, the way that law enforcement looks at it is they don't really care if you get in."
    },
    {
      "Time_Start": 2510.16,
      "Time_End": 2515.16,
      "Text": " It is sort of what you do after because that's what captures their imagination and makes it a great case."
    },
    {
      "Time_Start": 2515.16,
      "Time_End": 2516.16,
      "Text": " When does yes mean no?"
    },
    {
      "Time_Start": 2516.16,
      "Time_End": 2517.16,
      "Text": " When does what?"
    },
    {
      "Time_Start": 2517.16,
      "Time_End": 2519.16,
      "Text": " When does yes mean no?"
    },
    {
      "Time_Start": 2520.16,
      "Time_End": 2522.16,
      "Text": " That's a very funny joke."
    },
    {
      "Time_Start": 2526.16,
      "Time_End": 2532.16,
      "Text": " I would say yes means no when what you do in there is something that pisses off the prosecutor."
    },
    {
      "Time_Start": 2532.16,
      "Time_End": 2538.16,
      "Text": " And I had a case just like this where a web server was running this old buggy software that displayed the master password file."
    },
    {
      "Time_Start": 2538.16,
      "Time_End": 2543.16,
      "Text": " And it wasn't so much that the guy got the master password file that pissed off my prosecutor,"
    },
    {
      "Time_Start": 2543.16,
      "Time_End": 2548.16,
      "Text": " but it was that he ran crack against it and then printed the de-encrypted version on IRC."
    },
    {
      "Time_Start": 2548.16,
      "Time_End": 2550.16,
      "Text": " That's what she got mad at."
    },
    {
      "Time_Start": 2550.16,
      "Time_End": 2555.16,
      "Text": " So, you know, sometimes it's the thing that happens after the fact that really gets you in the hot water."
    },
    {
      "Time_Start": 2555.16,
      "Time_End": 2557.16,
      "Text": " Trafficking in passwords is a federal offense."
    },
    {
      "Time_Start": 2557.16,
      "Time_End": 2559.16,
      "Text": " It's 1029."
    },
    {
      "Time_Start": 2559.16,
      "Time_End": 2561.16,
      "Text": " There was a guy over there who had a question."
    },
    {
      "Time_Start": 2561.16,
      "Time_End": 2566.16,
      "Text": " Hi. What kind of arrangements are made with the United States and Canada"
    },
    {
      "Time_Start": 2566.16,
      "Time_End": 2571.16,
      "Text": " if a Canadian citizen breaks a law in the United States concerning system penetration?"
    },
    {
      "Time_Start": 2571.16,
      "Time_End": 2573.16,
      "Text": " Hypothetically?"
    },
    {
      "Time_Start": 2573.16,
      "Time_End": 2575.16,
      "Text": " Oh yeah."
    },
    {
      "Time_Start": 2576.16,
      "Time_End": 2579.16,
      "Text": " Well, I'm retired."
    },
    {
      "Time_Start": 2579.16,
      "Time_End": 2581.16,
      "Text": " Hypothetically, eh?"
    },
    {
      "Time_Start": 2585.16,
      "Time_End": 2589.16,
      "Text": " As you know, I cannot talk about any pending cases."
    },
    {
      "Time_Start": 2589.16,
      "Time_End": 2595.16,
      "Text": " And, of course, my responses are my own and not the official response of the United States Department of Justice."
    },
    {
      "Time_Start": 2595.16,
      "Time_End": 2601.16,
      "Text": " Nevertheless, there are a number of ways that we deal with international events."
    },
    {
      "Time_Start": 2601.16,
      "Time_End": 2608.16,
      "Text": " Canada is actually an easy example because we have a treaty with Canada that allows for mutual legal assistance."
    },
    {
      "Time_Start": 2608.16,
      "Time_End": 2613.16,
      "Text": " We have an extradition treaty with Canada that is actually used fairly extensively."
    },
    {
      "Time_Start": 2613.16,
      "Time_End": 2621.16,
      "Text": " We share some culture with Canada so that we have an easier time talking to each other about matters of import."
    },
    {
      "Time_Start": 2621.16,
      "Time_End": 2626.16,
      "Text": " We have the ability and have regularly provided Canadians lawfully with information that we've obtained"
    },
    {
      "Time_Start": 2626.16,
      "Time_End": 2628.16,
      "Text": " that they've used to prosecute their own citizens."
    },
    {
      "Time_Start": 2628.16,
      "Time_End": 2630.16,
      "Text": " So Canada is an easy example."
    },
    {
      "Time_Start": 2630.16,
      "Time_End": 2636.16,
      "Text": " There are countries, however, in which it's much more difficult, even with treaties,"
    },
    {
      "Time_Start": 2636.16,
      "Time_End": 2642.16,
      "Text": " to gain the type of cooperation that we want where there's been international destructive behavior."
    },
    {
      "Time_Start": 2642.16,
      "Time_End": 2647.16,
      "Text": " Could you address that same issue from the opposite of an American citizen?"
    },
    {
      "Time_Start": 2647.16,
      "Time_End": 2649.16,
      "Text": " It's actually the same."
    },
    {
      "Time_Start": 2649.16,
      "Time_End": 2654.16,
      "Text": " When we have these treaties, like with Canada, China we do not have an extradition treaty with."
    },
    {
      "Time_Start": 2654.16,
      "Time_End": 2661.16,
      "Text": " So if an American citizen hacking from their own room breaks into a Chinese computer system"
    },
    {
      "Time_Start": 2661.16,
      "Time_End": 2667.16,
      "Text": " and causes all kinds of damage, it would create some international diplomatic discussions."
    },
    {
      "Time_Start": 2667.16,
      "Time_End": 2677.16,
      "Text": " But the American would be completely free from prosecution unless they happen to travel to China"
    },
    {
      "Time_Start": 2677.16,
      "Time_End": 2681.16,
      "Text": " or a country familiar with China or a country friendly with China."
    },
    {
      "Time_Start": 2682.16,
      "Time_End": 2688.16,
      "Text": " Now if China hacked back, then we get into some very interesting situations."
    },
    {
      "Time_Start": 2688.16,
      "Time_End": 2693.16,
      "Text": " Does China hack back as the government of China or does it hack back as an individual who was hacked?"
    },
    {
      "Time_Start": 2693.16,
      "Time_End": 2698.16,
      "Text": " Once we get into areas of warfare, of informational warfare,"
    },
    {
      "Time_Start": 2698.16,
      "Time_End": 2703.16,
      "Text": " and suddenly we've gone from a very simple, hey, I got into a China system, cool."
    },
    {
      "Time_Start": 2703.16,
      "Time_End": 2707.16,
      "Text": " Next thing you know we have the Chinese government responding."
    },
    {
      "Time_Start": 2708.16,
      "Time_End": 2709.16,
      "Text": " It's almost like a movie."
    },
    {
      "Time_Start": 2709.16,
      "Time_End": 2713.16,
      "Text": " And the answer to it is one that, would the American ultimately get prosecuted?"
    },
    {
      "Time_Start": 2713.16,
      "Time_End": 2719.16,
      "Text": " Probably not because the Chinese government probably would not give us enough information to mount a successful prosecution."
    },
    {
      "Time_Start": 2719.16,
      "Time_End": 2721.16,
      "Text": " If they did, would we prosecute? Yes."
    },
    {
      "Time_Start": 2725.16,
      "Time_End": 2727.16,
      "Text": " Would we send them to China for prison?"
    },
    {
      "Time_Start": 2727.16,
      "Time_End": 2729.16,
      "Text": " No, just for re-education."
    },
    {
      "Time_Start": 2730.16,
      "Time_End": 2738.16,
      "Text": " I have a question on due diligence on the places that are the jump point."
    },
    {
      "Time_Start": 2738.16,
      "Time_End": 2740.16,
      "Text": " You talked about civil litigation there."
    },
    {
      "Time_Start": 2740.16,
      "Time_End": 2747.16,
      "Text": " What sort of matrix or guide do you have to go by to show that they haven't performed due diligence?"
    },
    {
      "Time_Start": 2747.16,
      "Time_End": 2751.16,
      "Text": " Well, this is a tricky..."
    },
    {
      "Time_Start": 2751.16,
      "Time_End": 2753.16,
      "Text": " Where is that established at?"
    },
    {
      "Time_Start": 2753.16,
      "Time_End": 2757.16,
      "Text": " Well, you're talking about a negligence standard."
    },
    {
      "Time_Start": 2757.16,
      "Time_End": 2763.16,
      "Text": " And a negligence standard, you have to have a duty, there has to be a breach of that duty, and then damage."
    },
    {
      "Time_Start": 2763.16,
      "Time_End": 2766.16,
      "Text": " There's absolutely..."
    },
    {
      "Time_Start": 2766.16,
      "Time_End": 2769.16,
      "Text": " The case law on this doesn't exist."
    },
    {
      "Time_Start": 2769.16,
      "Time_End": 2772.16,
      "Text": " It's basically..."
    },
    {
      "Time_Start": 2772.16,
      "Time_End": 2775.16,
      "Text": " What you have with the civil field is..."
    },
    {
      "Time_Start": 2775.16,
      "Time_End": 2783.16,
      "Text": " Legislatures, it's not sexy to pass civil laws, civil penalties."
    },
    {
      "Time_Start": 2784.16,
      "Time_End": 2788.16,
      "Text": " You can't go out and get re-elected saying I'm tough on torts."
    },
    {
      "Time_Start": 2788.16,
      "Time_End": 2794.16,
      "Text": " So what you have here is you have basically the common law developing through the courts."
    },
    {
      "Time_Start": 2794.16,
      "Time_End": 2808.16,
      "Text": " And you have the courts trying to jam technology issues that evolve daily into pigeon-holed tort theories that go back to Blackstone."
    },
    {
      "Time_Start": 2808.16,
      "Time_End": 2810.16,
      "Text": " Go back a hundred years."
    },
    {
      "Time_Start": 2810.16,
      "Time_End": 2815.16,
      "Text": " Right now we have cases about unauthorized access."
    },
    {
      "Time_Start": 2815.16,
      "Time_End": 2818.16,
      "Text": " Basically trespass to chattel cases."
    },
    {
      "Time_Start": 2818.16,
      "Time_End": 2826.16,
      "Text": " The eBay case Jennifer discussed earlier, that's kind of a trespass analysis."
    },
    {
      "Time_Start": 2826.16,
      "Time_End": 2836.16,
      "Text": " There's a misrepresentation analysis that goes on with regard to using pass codes."
    },
    {
      "Time_Start": 2836.16,
      "Time_End": 2841.16,
      "Text": " Basically you're representing that you're the rightful owner of that pass code."
    },
    {
      "Time_Start": 2841.16,
      "Time_End": 2850.16,
      "Text": " And the machine is seen as the agent of the victim, accepting the pass codes as being genuine."
    },
    {
      "Time_Start": 2850.16,
      "Time_End": 2853.16,
      "Text": " There's some real strained analysis going on here."
    },
    {
      "Time_Start": 2853.16,
      "Time_End": 2858.16,
      "Text": " With regard to the jump point analysis, you're looking at a negligence."
    },
    {
      "Time_Start": 2859.16,
      "Time_End": 2868.16,
      "Text": " The analysis would be, was I reasonable in the efforts that I took to protect the system from this kind of event happening?"
    },
    {
      "Time_Start": 2868.16,
      "Time_End": 2876.16,
      "Text": " And the evidence that you would put on is, well, we came to DEF CON and hired the best security guy I could find at the bar."
    },
    {
      "Time_Start": 2876.16,
      "Time_End": 2883.16,
      "Text": " You have to sit there and you're going to have to show that you took reasonable steps to secure your system."
    },
    {
      "Time_Start": 2884.16,
      "Time_End": 2893.16,
      "Text": " If you have security consultants or in-house people who keep up to date on the latest exploits and you can document that,"
    },
    {
      "Time_Start": 2893.16,
      "Time_End": 2899.16,
      "Text": " you can show that they've gone to conferences, we have training programs, we've done this, we've done everything we can."
    },
    {
      "Time_Start": 2899.16,
      "Time_End": 2903.16,
      "Text": " You've made a strong case for not being negligent."
    },
    {
      "Time_Start": 2903.16,
      "Time_End": 2909.16,
      "Text": " Because like I said before, you may do everything you can, but there may just be someone out there smarter than you."
    },
    {
      "Time_Start": 2909.16,
      "Time_End": 2912.16,
      "Text": " And you're not negligent."
    },
    {
      "Time_Start": 2912.16,
      "Time_End": 2921.16,
      "Text": " But in the end analysis, it comes down to convincing a jury or settling a case if you don't want bad publicity."
    },
    {
      "Time_Start": 2921.16,
      "Time_End": 2930.16,
      "Text": " Have you ever felt like you're responsible for, let's say, a client of yours being in a jump off point?"
    },
    {
      "Time_Start": 2930.16,
      "Time_End": 2935.16,
      "Text": " I've been on the other side of that one."
    },
    {
      "Time_Start": 2935.16,
      "Time_End": 2940.16,
      "Text": " No, I've done, like I said, this is a developing area of the law."
    },
    {
      "Time_Start": 2940.16,
      "Time_End": 2950.16,
      "Text": " My background, I've done a lot of consulting and basically similar type areas."
    },
    {
      "Time_Start": 2950.16,
      "Time_End": 2962.16,
      "Text": " I've gone into auto body shops and given speeches on sexual harassment and why you can't post the hustler centerfold up on the wall."
    },
    {
      "Time_Start": 2962.16,
      "Time_End": 2965.16,
      "Text": " It's a similar type analysis with what you have now."
    },
    {
      "Time_Start": 2965.16,
      "Time_End": 2968.16,
      "Text": " You'd be surprised."
    },
    {
      "Time_Start": 2968.16,
      "Time_End": 2972.16,
      "Text": " But it's a similar type analysis to what's going on now."
    },
    {
      "Time_Start": 2972.16,
      "Time_End": 2979.16,
      "Text": " You basically have to take the analysis that I just described and say, well, we've entered into contracts."
    },
    {
      "Time_Start": 2979.16,
      "Time_End": 2984.16,
      "Text": " You also have to worry about, what have I represented to my clients that I can do?"
    },
    {
      "Time_Start": 2984.16,
      "Time_End": 2987.16,
      "Text": " You may have a fraud misrepresentation claim coming your way."
    },
    {
      "Time_Start": 2987.16,
      "Time_End": 2994.16,
      "Text": " If you've huffed and puffed and built yourself up to say you can do more than you can do."
    },
    {
      "Time_Start": 2994.16,
      "Time_End": 2998.16,
      "Text": " For example, if I said I'm on managing benefits, I'm on managing benefits."
    },
    {
      "Time_Start": 2998.16,
      "Time_End": 3004.16,
      "Text": " If I say I'm on managing benefits, I'm talking about a report and I'm saying I'm on managing benefits."
    },
    {
      "Time_Start": 3004.16,
      "Time_End": 3008.16,
      "Text": " I'm going to need a translator for that."
    },
    {
      "Time_Start": 3008.16,
      "Time_End": 3012.16,
      "Text": " I'm on managing, I'm talking about security services."
    },
    {
      "Time_Start": 3012.16,
      "Time_End": 3023.6,
      "Text": " Well, see, that's a case where I think you have to, in your contract, if you're, you've"
    },
    {
      "Time_Start": 3023.6,
      "Time_End": 3028.16,
      "Text": " got to disclose, make a full disclosure of exactly what you're selling them. If you're"
    },
    {
      "Time_Start": 3028.16,
      "Time_End": 3034.64,
      "Text": " telling them that I'm giving you a system that we're monitoring and we're doing this"
    },
    {
      "Time_Start": 3034.64,
      "Time_End": 3039.72,
      "Text": " and that and you're not providing that, you've basically defrauded your client. If you tell"
    },
    {
      "Time_Start": 3039.7200000000003,
      "Time_End": 3044.96,
      "Text": " them here, here's what you're getting, it's as is, it may be good enough, may not, you"
    },
    {
      "Time_Start": 3044.96,
      "Time_End": 3049.92,
      "Text": " buy it at your own risk and you can get somebody to sign off on that, good for you, you know."
    },
    {
      "Time_Start": 3049.92,
      "Time_End": 3052.84,
      "Text": " That's one of the other things, aside from stealing, lying has always been wrong, will"
    },
    {
      "Time_Start": 3052.84,
      "Time_End": 3056.0400000000004,
      "Text": " always be wrong, so if you lie to somebody to steal their money or lie to somebody to"
    },
    {
      "Time_Start": 3056.0400000000004,
      "Time_End": 3059.2400000000002,
      "Text": " get them to give you their money voluntarily, that's also the kind of thing that interests"
    },
    {
      "Time_Start": 3059.2400000000002,
      "Time_End": 3061.2400000000002,
      "Text": " us because it's simple and we're not that smart."
    },
    {
      "Time_Start": 3061.2400000000002,
      "Time_End": 3081.6400000000003,
      "Text": " Yes, we have to prove that the evidence that we're using is authentic and there are ways"
    },
    {
      "Time_Start": 3081.6400000000003,
      "Time_End": 3085.6800000000003,
      "Text": " to do that. One of the, that's why it's important, one of the things that we went back to earlier"
    },
    {
      "Time_Start": 3085.6800000000003,
      "Time_End": 3090.84,
      "Text": " is if a company or a victim gets law enforcement involved early, then one of the things that"
    },
    {
      "Time_Start": 3090.84,
      "Time_End": 3094.84,
      "Text": " we can do is secure a system and secure the logs so at least at the point we have them,"
    },
    {
      "Time_Start": 3094.84,
      "Time_End": 3099.1600000000003,
      "Text": " we know they're genuine. The issue as to whether they're genuine when we come in is a difficult"
    },
    {
      "Time_Start": 3099.1600000000003,
      "Time_End": 3104.04,
      "Text": " one and one we have to look at on a case by case basis. We have been successful 100% of"
    },
    {
      "Time_Start": 3104.04,
      "Time_End": 3109.08,
      "Text": " the time in getting logs in. We have not, we have overcome several challenges of because"
    },
    {
      "Time_Start": 3109.08,
      "Time_End": 3112.76,
      "Text": " it's digital, it's ephemeral and it could be changed and modified and then you get to"
    },
    {
      "Time_Start": 3112.76,
      "Time_End": 3117.8,
      "Text": " look at who these people are and what's their motivation. What is your motivation in faking"
    },
    {
      "Time_Start": 3117.8,
      "Time_End": 3121.96,
      "Text": " these logs and bringing your system down and costing yourself $15,000? Are you that"
    },
    {
      "Time_Start": 3121.96,
      "Time_End": 3126.96,
      "Text": " vengeful? So as a practical matter, it's not a real issue for us although it comes up in"
    },
    {
      "Time_Start": 3126.96,
      "Time_End": 3127.96,
      "Text": " every case."
    },
    {
      "Time_Start": 3127.96,
      "Time_End": 3150.4,
      "Text": " Many of the things come down to with 1030 with authorization and the ability to grant"
    },
    {
      "Time_Start": 3150.4,
      "Time_End": 3155.36,
      "Text": " access, if a person is on like pound hack and they say I own this box, here have an"
    },
    {
      "Time_Start": 3155.36,
      "Time_End": 3160.88,
      "Text": " account and a password. They're committing fraud in one way but they're also using a"
    },
    {
      "Time_Start": 3160.88,
      "Time_End": 3165.7200000000003,
      "Text": " form of communication that is common in the culture on that channel. How will that affect"
    },
    {
      "Time_Start": 3165.7200000000003,
      "Time_End": 3170.2400000000002,
      "Text": " a case where a person that didn't break into the box is now using that box and doing their"
    },
    {
      "Time_Start": 3170.2400000000002,
      "Time_End": 3174.04,
      "Text": " own work and deleting files? Okay, it's the use of the box is not something that generally"
    },
    {
      "Time_Start": 3174.04,
      "Time_End": 3179.04,
      "Text": " concerns me. I mean it may be some unauthorized access there but I don't care. We look at"
    },
    {
      "Time_Start": 3179.04,
      "Time_End": 3182.76,
      "Text": " the result. If after you get access to the box, whether you've got it because you've"
    },
    {
      "Time_Start": 3182.76,
      "Time_End": 3187.5200000000004,
      "Text": " been lied to or got it legitimately or got it illegitimately, once you start doing damage"
    },
    {
      "Time_Start": 3187.5200000000004,
      "Time_End": 3193.1200000000003,
      "Text": " to the box and we look at what kind of damage you caused, whether you did it intentionally,"
    },
    {
      "Time_Start": 3193.1200000000003,
      "Time_End": 3197.4,
      "Text": " recklessly or negligently, that's when we start looking at it. We look at the conduct"
    },
    {
      "Time_Start": 3197.4,
      "Time_End": 3202.8,
      "Text": " after the fact. The mere fact of illegal access, while it is an offense, is not the kind of"
    },
    {
      "Time_Start": 3202.8,
      "Time_End": 3203.8,
      "Text": " thing that gets us going."
    },
    {
      "Time_Start": 3203.8,
      "Time_End": 3219.1600000000003,
      "Text": " Okay, if a person who claims to own the box gives you access and says go ahead and trash"
    },
    {
      "Time_Start": 3219.1600000000003,
      "Time_End": 3224.1200000000003,
      "Text": " it and you do, the easy answer for me is that the person who comes in, if they reasonably"
    },
    {
      "Time_Start": 3224.1200000000003,
      "Time_End": 3230.02,
      "Text": " believe that person did own the box and gave them permission, they lacked criminal intent"
    },
    {
      "Time_Start": 3230.02,
      "Time_End": 3231.78,
      "Text": " and it would not be a criminal case."
    },
    {
      "Time_Start": 3231.78,
      "Time_End": 3236.18,
      "Text": " Okay, officially we're out of time but the next speaker says we can keep with questions"
    },
    {
      "Time_Start": 3236.18,
      "Time_End": 3240.7,
      "Text": " for a few more minutes. And by the way, I just got an announcement, they have finally"
    },
    {
      "Time_Start": 3240.7,
      "Time_End": 3241.7,
      "Text": " fixed the air conditioning."
    },
    {
      "Time_Start": 3241.7000000000003,
      "Time_End": 3261.1000000000004,
      "Text": " Once it exceeds $5,000. It's right in the statute. And we talked about how to get there,"
    },
    {
      "Time_Start": 3261.1000000000004,
      "Time_End": 3267.82,
      "Text": " it has to be reasonable. But once you exceed $5,000 in costs of repair and costs of analysis,"
    },
    {
      "Time_Start": 3267.82,
      "Time_End": 3271.34,
      "Text": " then there's federal jurisdiction if the computer was a federally protected computer."
    },
    {
      "Time_Start": 3271.34,
      "Time_End": 3272.34,
      "Text": " Say again?"
    },
    {
      "Time_Start": 3272.34,
      "Time_End": 3281.34,
      "Text": " This is not an article of investigation that is not in the line of investigation. It is"
    },
    {
      "Time_Start": 3281.34,
      "Time_End": 3287.7000000000003,
      "Text": " not normally, or usually doesn't take place, all the time."
    },
    {
      "Time_Start": 3287.7000000000003,
      "Time_End": 3292.42,
      "Text": " The question is, does every case in which the damage exceeds $5,000 get investigated?"
    },
    {
      "Time_Start": 3292.42,
      "Time_End": 3297.5,
      "Text": " The question is, it depends where it occurs. In some federal districts, the resources of"
    },
    {
      "Time_Start": 3297.5,
      "Time_End": 3302.5,
      "Text": " such that the guidelines before which the case will be investigated or prosecuted gets"
    },
    {
      "Time_Start": 3302.5,
      "Time_End": 3308.34,
      "Text": " ratcheted up. In some districts like mine, if you exceed $5,000, I'm looking at it. So"
    },
    {
      "Time_Start": 3308.34,
      "Time_End": 3309.34,
      "Text": " stay out of San Diego."
    },
    {
      "Time_Start": 3309.34,
      "Time_End": 3321.14,
      "Text": " The fellow in the glasses right there."
    },
    {
      "Time_Start": 3321.14,
      "Time_End": 3326.54,
      "Text": " If someone breaks into your box and then proceeds to install an IRC client and use it, are there"
    },
    {
      "Time_Start": 3326.54,
      "Time_End": 3330.18,
      "Text": " any legal problems with logging all of their actions and communications that originate"
    },
    {
      "Time_Start": 3330.18,
      "Time_End": 3332.58,
      "Text": " from your box that they've broken into?"
    },
    {
      "Time_Start": 3332.58,
      "Time_End": 3336.7,
      "Text": " Jennifer talked about that yesterday. As a sys manager, you have the right to monitor,"
    },
    {
      "Time_Start": 3336.7,
      "Time_End": 3341.54,
      "Text": " use, and disclose to protect yourself and protect the rights that you have in the system."
    },
    {
      "Time_Start": 3341.54,
      "Time_End": 3347.02,
      "Text": " So you can monitor to your heart's content. That's not an issue for me. And I'm allowed"
    },
    {
      "Time_Start": 3347.02,
      "Time_End": 3351.7799999999997,
      "Text": " to some extent to surf behind you. If you're a sys manager and you're monitoring, using,"
    },
    {
      "Time_Start": 3351.7799999999997,
      "Time_End": 3355.5,
      "Text": " and disclosing to protect yourself, I'm allowed to use that information. So long as you're"
    },
    {
      "Time_Start": 3355.5,
      "Time_End": 3359.54,
      "Text": " acting in your best interest and not in the interest of the government. Once your interests"
    },
    {
      "Time_Start": 3359.54,
      "Time_End": 3364.22,
      "Text": " shift and the reason you're monitoring and disclosing is to get somebody prosecuted and"
    },
    {
      "Time_Start": 3364.22,
      "Time_End": 3368.34,
      "Text": " not to protect yourself, the interests have changed and I'm required to get a wiretap"
    },
    {
      "Time_Start": 3368.34,
      "Time_End": 3373.98,
      "Text": " order. Unless your system is bannered, that is, that anybody who enters your system sees"
    },
    {
      "Time_Start": 3373.98,
      "Time_End": 3377.9,
      "Text": " something that says you have no right to privacy in this system, we're going to monitor, use,"
    },
    {
      "Time_Start": 3377.9,
      "Time_End": 3382.86,
      "Text": " and disclose to our heart's content. Beware. Then I can, as a prosecutor, I can use everything"
    },
    {
      "Time_Start": 3382.86,
      "Time_End": 3384.3,
      "Text": " that the sys manager does in logging."
    },
    {
      "Time_Start": 3385.1000000000004,
      "Time_End": 3389.54,
      "Text": " And this goes back to the question that was asked earlier from the civil side. If you're"
    },
    {
      "Time_Start": 3389.54,
      "Time_End": 3394.6200000000003,
      "Text": " aware of this kind of activity, what do you do? You want to document that activity for"
    },
    {
      "Time_Start": 3394.6200000000003,
      "Time_End": 3400.5800000000004,
      "Text": " your purposes, you know, as well as for law enforcement purposes. You want to have the"
    },
    {
      "Time_Start": 3400.5800000000004,
      "Time_End": 3408.86,
      "Text": " ability to preserve evidence that you may use in a suit against someone else or may"
    },
    {
      "Time_Start": 3408.94,
      "Time_End": 3415.1,
      "Text": " be used against you. You want to have that, talk to your in-house counsel or your lawyer"
    },
    {
      "Time_Start": 3415.1,
      "Time_End": 3422.1,
      "Text": " and notify the authorities and preserve that evidence for your own purposes."
    },
    {
      "Time_Start": 3422.1,
      "Time_End": 3428.42,
      "Text": " Okay, here's another scenario. A distributor denial of service tool is used to take an"
    },
    {
      "Time_Start": 3428.42,
      "Time_End": 3433.7400000000002,
      "Text": " e-tailer offline for an hour. That e-tailer generates $5,000 worth of income every hour"
    },
    {
      "Time_Start": 3433.7400000000002,
      "Time_End": 3437.94,
      "Text": " they're online. Is that a prosecutable case if you can identify the source of the denial"
    },
    {
      "Time_Start": 3437.94,
      "Time_End": 3438.94,
      "Text": " of service?"
    },
    {
      "Time_Start": 3438.94,
      "Time_End": 3442.46,
      "Text": " If you can identify, well, when you say the source, you mean the person who triggered"
    },
    {
      "Time_Start": 3442.46,
      "Time_End": 3443.46,
      "Text": " it?"
    },
    {
      "Time_Start": 3443.46,
      "Time_End": 3444.46,
      "Text": " Yeah, the person who triggered it."
    },
    {
      "Time_Start": 3444.46,
      "Time_End": 3445.46,
      "Text": " Absolutely. Love to do it."
    },
    {
      "Time_Start": 3445.46,
      "Time_End": 3446.46,
      "Text": " Just curious, that's all."
    },
    {
      "Time_Start": 3446.46,
      "Time_End": 3464.02,
      "Text": " Can use of bandwidth be used as a damage tool? Probably not. What we do, one of the ways"
    },
    {
      "Time_Start": 3464.02,
      "Time_End": 3468.18,
      "Text": " that you can get federal jurisdiction is if you enter a system without authority, exceed"
    },
    {
      "Time_Start": 3468.18,
      "Time_End": 3475.9,
      "Text": " authorized access and steal computer time. And if that time exceeds $1,000, then we have"
    },
    {
      "Time_Start": 3475.9,
      "Time_End": 3481.3,
      "Text": " the ability to prosecute. But mere bandwidth, mere use of bandwidth, I don't know how you"
    },
    {
      "Time_Start": 3481.3,
      "Time_End": 3485.14,
      "Text": " can put a monetary use on it. The denial of service cases are easy because if you shut"
    },
    {
      "Time_Start": 3485.14,
      "Time_End": 3489.42,
      "Text": " down an e-commerce site, they can actually count or extrapolate what they've lost. If"
    },
    {
      "Time_Start": 3489.42,
      "Time_End": 3497.1800000000003,
      "Text": " all you've done is steal some bandwidth, for the most part, Mr. Dapster, then it's"
    },
    {
      "Time_Start": 3497.1800000000003,
      "Time_End": 3500.34,
      "Text": " not the kind of thing that we'd be looking at unless there's some other intentional damage"
    },
    {
      "Time_Start": 3500.34,
      "Time_End": 3501.34,
      "Text": " going on."
    },
    {
      "Time_Start": 3501.34,
      "Time_End": 3512.14,
      "Text": " How do you evaluate time? Oh, there's a lot of companies, some of their computer centers"
    },
    {
      "Time_Start": 3512.14,
      "Time_End": 3516.14,
      "Text": " actually bill their departments for use of some of their mainframes. And we would just"
    },
    {
      "Time_Start": 3516.14,
      "Time_End": 3518.94,
      "Text": " use those figures to determine the loss."
    },
    {
      "Time_Start": 3518.94,
      "Time_End": 3527.06,
      "Text": " Provide us charge for bandwidth as well. We would use their costs."
    },
    {
      "Time_Start": 3527.06,
      "Time_End": 3536.26,
      "Text": " It's my understanding that existing Supreme Court case law limits the, well actually calls"
    },
    {
      "Time_Start": 3536.26,
      "Time_End": 3541.78,
      "Text": " on constitutional statutes which are so vague and give prosecutors so much discretion in"
    },
    {
      "Time_Start": 3541.78,
      "Time_End": 3546.54,
      "Text": " the prosecution that a potential offender would not necessarily know if they were subject"
    },
    {
      "Time_Start": 3546.54,
      "Time_End": 3553.02,
      "Text": " to prosecution. How does that jive with the amount of discretion you're saying that you"
    },
    {
      "Time_Start": 3553.02,
      "Time_End": 3555.02,
      "Text": " have when you're choosing who to prosecute?"
    },
    {
      "Time_Start": 3555.02,
      "Time_End": 3558.3,
      "Text": " Well, the courts have also recognized that prosecutors can decide what to prosecute and"
    },
    {
      "Time_Start": 3558.3,
      "Time_End": 3563.14,
      "Text": " what not. There's a difference between prosecutorial discretion and whether the law is so vague"
    },
    {
      "Time_Start": 3563.14,
      "Time_End": 3568.58,
      "Text": " that you don't know what you're doing is illegal. The law is actually pretty clear. We can debate"
    },
    {
      "Time_Start": 3568.58,
      "Time_End": 3574.06,
      "Text": " what is unauthorized access and what the permissions mean in that regard. But unauthorized access,"
    },
    {
      "Time_Start": 3574.06,
      "Time_End": 3578.1,
      "Text": " if you're in a system that you know you don't have rights to, it's pretty easy. Now I can"
    },
    {
      "Time_Start": 3578.1,
      "Time_End": 3582.66,
      "Text": " decide as a prosecutor what the appropriate use of my resources are in order to investigate"
    },
    {
      "Time_Start": 3582.66,
      "Time_End": 3587.14,
      "Text": " and prosecute. That's something firmly committed to the executive branch and it doesn't raise"
    },
    {
      "Time_Start": 3587.14,
      "Time_End": 3591.14,
      "Text": " the same issue. We can argue about whether I exercise my discretion appropriately, but"
    },
    {
      "Time_Start": 3591.14,
      "Time_End": 3594.18,
      "Text": " as a practical matter, they're two separate ideas."
    },
    {
      "Time_Start": 3594.18,
      "Time_End": 3600.22,
      "Text": " I think we're just about out of time now since people have filtered into the room for the"
    },
    {
      "Time_Start": 3600.2200000000003,
      "Time_End": 3607.2200000000003,
      "Text": " next talk. So any final thoughts as such? And I'm going to get some Vitamin Follies"
    },
    {
      "Time_Start": 3607.2200000000003,
      "Time_End": 3609.0200000000004,
      "Text": " at a bar or something."
    },
    {
      "Time_Start": 3609.0200000000004,
      "Time_End": 3611.82,
      "Text": " I'll buy Jennifer her first drink after this session."
    },
    {
      "Time_Start": 3611.82,
      "Time_End": 3614.82,
      "Text": " Jennifer is a fun drunk."
    },
    {
      "Time_Start": 3614.82,
      "Time_End": 3616.82,
      "Text": " Thank you, but that won't be my first."
    }
  ]
}