{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 23.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I'm going to be talking today about autonomous nodes, which are basically little computer"
    },
    {
      "Time_Start": 23.0,
      "Time_End": 28.0,
      "Text": " programs that you can say they have their own little artificial intelligence inside."
    },
    {
      "Time_Start": 28.0,
      "Time_End": 35.0,
      "Text": " The idea is not that they're artificially intelligent, it's just that they live by rules"
    },
    {
      "Time_Start": 35.0,
      "Time_End": 39.0,
      "Text": " and die by those rules, and they don't talk to anybody else."
    },
    {
      "Time_Start": 39.0,
      "Time_End": 41.0,
      "Text": " They kind of do their own thing."
    },
    {
      "Time_Start": 41.0,
      "Time_End": 43.0,
      "Text": " I wanted to give some thanks up front."
    },
    {
      "Time_Start": 43.0,
      "Time_End": 46.0,
      "Text": " There's a lot of people who've helped me with this."
    },
    {
      "Time_Start": 46.0,
      "Time_End": 55.0,
      "Text": " Caesar, Bats, all 40 ounces of the ghetto hackers, DT, Dementia, Absolute Nick, who"
    },
    {
      "Time_Start": 55.0,
      "Time_End": 58.0,
      "Text": " fixed my laptop."
    },
    {
      "Time_Start": 58.0,
      "Time_End": 67.0,
      "Text": " FastEddy, SimTheIckyGuy, Michelle, Mike, and in Linwood where I would sit for hours"
    },
    {
      "Time_Start": 67.0,
      "Time_End": 69.0,
      "Text": " and hours all night drinking coffee."
    },
    {
      "Time_Start": 69.0,
      "Time_End": 71.0,
      "Text": " I have a nice little Denny's there."
    },
    {
      "Time_Start": 71.0,
      "Time_End": 74.0,
      "Text": " They're pretty cool."
    },
    {
      "Time_Start": 74.0,
      "Time_End": 79.0,
      "Text": " What are autonomous nodes and intelligent agents?"
    },
    {
      "Time_Start": 79.0,
      "Time_End": 83.0,
      "Text": " There is a distinction between the two."
    },
    {
      "Time_Start": 83.0,
      "Time_End": 92.0,
      "Text": " You'll hear a lot about intelligent agents in network software that goes out and retrieves"
    },
    {
      "Time_Start": 92.0,
      "Time_End": 96.0,
      "Text": " information for you, such as a news agent."
    },
    {
      "Time_Start": 96.0,
      "Time_End": 101.0,
      "Text": " You tell it what type of news you actually want to read, and it goes and gets it from"
    },
    {
      "Time_Start": 101.0,
      "Time_End": 106.0,
      "Text": " all the different types of places that it knows about."
    },
    {
      "Time_Start": 106.0,
      "Time_End": 111.0,
      "Text": " The differentiation between an autonomous node and one of those agents is that the agent"
    },
    {
      "Time_Start": 111.0,
      "Time_End": 116.0,
      "Text": " goes in and gets information, and it relies on your input to determine what it does and"
    },
    {
      "Time_Start": 116.0,
      "Time_End": 118.0,
      "Text": " where it looks."
    },
    {
      "Time_Start": 118.0,
      "Time_End": 124.0,
      "Text": " An autonomous node, once you begin running it, it does what it wants and does what it"
    },
    {
      "Time_Start": 124.0,
      "Time_End": 132.0,
      "Text": " was programmed to do, and it doesn't care what anybody tells it to do from that point."
    },
    {
      "Time_Start": 132.0,
      "Time_End": 138.0,
      "Text": " It was my intention when I originally asked DT if I could speak here that I'd have a full"
    },
    {
      "Time_Start": 138.0,
      "Time_End": 144.0,
      "Text": " demonstration of one of these nodes working, and we were going to actually use a buffer overflow"
    },
    {
      "Time_Start": 144.0,
      "Time_End": 149.0,
      "Text": " in Windows NT and do a quick demonstration."
    },
    {
      "Time_Start": 149.0,
      "Time_End": 157.0,
      "Text": " The way the development went, I ended up redesigning many portions with Caesar's help, and doing"
    },
    {
      "Time_Start": 157.0,
      "Time_End": 164.0,
      "Text": " a full demonstration didn't seem right because, well, make fun of me because I'm running Windows"
    },
    {
      "Time_Start": 164.0,
      "Time_End": 166.0,
      "Text": " already."
    },
    {
      "Time_Start": 166.0,
      "Time_End": 170.0,
      "Text": " The demonstration would have been on a Windows box and such."
    },
    {
      "Time_Start": 170.0,
      "Time_End": 176.0,
      "Text": " The idea is I want the autonomous node project itself to be able to be run on many, many"
    },
    {
      "Time_Start": 176.0,
      "Time_End": 184.0,
      "Text": " platforms, operating systems, and there's that."
    },
    {
      "Time_Start": 184.0,
      "Time_End": 190.0,
      "Text": " Autonomous nodes are currently being used, like I said earlier, in many network applications"
    },
    {
      "Time_Start": 190.0,
      "Time_End": 192.0,
      "Text": " and other informational applications."
    },
    {
      "Time_Start": 192.0,
      "Time_End": 201.0,
      "Text": " Currently, Sandia, which is a government job house, is using autonomous nodes they're creating"
    },
    {
      "Time_Start": 201.0,
      "Time_End": 209.0,
      "Text": " alone to actually have a defense network which will be used to basically protect government"
    },
    {
      "Time_Start": 209.0,
      "Time_End": 211.0,
      "Text": " networks from hackers."
    },
    {
      "Time_Start": 211.0,
      "Time_End": 217.0,
      "Text": " And the standard hacker or hackers that are going to be attempting to penetrate any of"
    },
    {
      "Time_Start": 217.0,
      "Time_End": 225.0,
      "Text": " these type of servers will be not up against a server administrator of any kind or even"
    },
    {
      "Time_Start": 225.0,
      "Time_End": 234.0,
      "Text": " just Bob Joe software that is watchdogging the servers."
    },
    {
      "Time_Start": 234.0,
      "Time_End": 242.0,
      "Text": " You're going to be looking at attacking multiple, multiple nodes of machines that are running"
    },
    {
      "Time_Start": 243.0,
      "Time_End": 250.0,
      "Text": " solely to watch for you and communicate between themselves and then hack you back or report"
    },
    {
      "Time_Start": 250.0,
      "Time_End": 252.0,
      "Text": " that they're being hacked."
    },
    {
      "Time_Start": 252.0,
      "Time_End": 256.0,
      "Text": " But currently, Sandia did release a press release, and you can see it on their page"
    },
    {
      "Time_Start": 256.0,
      "Time_End": 264.0,
      "Text": " at www.sandia.gov, where they said that multiple red teams of hackers from some three-letter"
    },
    {
      "Time_Start": 264.0,
      "Time_End": 270.0,
      "Text": " acronym places were unable to penetrate their networks using these nodes."
    },
    {
      "Time_Start": 270.0,
      "Time_End": 280.0,
      "Text": " They also stated that they would like to convince ISPs in the future to actually run these nodes"
    },
    {
      "Time_Start": 280.0,
      "Time_End": 289.0,
      "Text": " so that all of the information, packets of any email, any connections, anything that is not"
    },
    {
      "Time_Start": 289.0,
      "Time_End": 296.0,
      "Text": " encrypted in the United States, it is possible that many more three-letter acronym people can be"
    },
    {
      "Time_Start": 296.0,
      "Time_End": 301.0,
      "Text": " reading all of that and capturing all of this using these nodes."
    },
    {
      "Time_Start": 301.0,
      "Time_End": 312.0,
      "Text": " And it would also render hackers' attacks on almost any ISP, including the DEF CON webpage, useless."
    },
    {
      "Time_Start": 312.0,
      "Time_End": 326.0,
      "Text": " Autonomous nodes can be powerful because they do not exactly rely on anyone to ever talk to them."
    },
    {
      "Time_Start": 326.0,
      "Time_End": 333.0,
      "Text": " Once you define the rules and what you want to happen, autonomous nodes perform a single task."
    },
    {
      "Time_Start": 333.0,
      "Time_End": 339.0,
      "Text": " So if you're ever performing a single task in networking, something you're going to do often,"
    },
    {
      "Time_Start": 339.0,
      "Time_End": 348.0,
      "Text": " much like running Nmap on a machine, running certain programs where many hackers will go and they'll"
    },
    {
      "Time_Start": 348.0,
      "Time_End": 356.0,
      "Text": " script out the commonly used things, I propose that in the future what we'll see is we'll actually see"
    },
    {
      "Time_Start": 356.0,
      "Time_End": 366.0,
      "Text": " many of these nodes that have a back end or a front end where hackers can simply take a module"
    },
    {
      "Time_Start": 366.0,
      "Time_End": 374.0,
      "Text": " that performs one of these actions or events and plugs it in and then runs the autonomous node."
    },
    {
      "Time_Start": 374.0,
      "Time_End": 379.0,
      "Text": " And the autonomous node knows the rules by which the hacker set forth."
    },
    {
      "Time_Start": 379.0,
      "Time_End": 386.0,
      "Text": " And so you can always do, say for instance, once someone writes DNS poisoner, then they simply"
    },
    {
      "Time_Start": 386.0,
      "Time_End": 395.0,
      "Text": " plug it into the autonomous node structure and then forever and ever they'll always have the ability"
    },
    {
      "Time_Start": 395.0,
      "Time_End": 398.0,
      "Text": " to run this certain program."
    },
    {
      "Time_Start": 398.0,
      "Time_End": 411.0,
      "Text": " And the design itself should present the ability for an ever-expanding and ever-growing use of these tools"
    },
    {
      "Time_Start": 411.0,
      "Time_End": 421.0,
      "Text": " that are developed with these modules so that some guy goes and he writes, for instance, a DNS poisoner"
    },
    {
      "Time_Start": 422.0,
      "Time_End": 427.0,
      "Text": " and then Bob Joe over here, he needs a DNS poisoner as well, and he's going to write it differently"
    },
    {
      "Time_Start": 427.0,
      "Time_End": 431.0,
      "Text": " and he's going to use a different format and it's going to run on Linux."
    },
    {
      "Time_Start": 431.0,
      "Time_End": 435.0,
      "Text": " And then this guy over here, his works on a different operating system."
    },
    {
      "Time_Start": 435.0,
      "Time_End": 442.0,
      "Text": " And there's no common goals and there's no common tools that are being, there's no common structure"
    },
    {
      "Time_Start": 442.0,
      "Time_End": 448.0,
      "Text": " for the tools that are being developed today for network security as a whole."
    },
    {
      "Time_Start": 448.0,
      "Time_End": 458.0,
      "Text": " So, the autonomous nodes would allow that a set of rules to be defined so that specific events"
    },
    {
      "Time_Start": 458.0,
      "Time_End": 466.0,
      "Text": " that happen, whether it's from a packet sniffer or an IRC channel, that there's a layer of information"
    },
    {
      "Time_Start": 466.0,
      "Time_End": 474.0,
      "Text": " that will feed into the rules which are defined by the programmer or script language possibly"
    },
    {
      "Time_Start": 474.0,
      "Time_End": 481.0,
      "Text": " so that things can happen based on the data that is received and seen by the node itself."
    },
    {
      "Time_Start": 481.0,
      "Time_End": 485.0,
      "Text": " And then I have the army of one."
    },
    {
      "Time_Start": 485.0,
      "Time_End": 494.0,
      "Text": " Currently, the GhettoHackers have quite a few members and, well, if all of you have been out by the CTF table"
    },
    {
      "Time_Start": 494.0,
      "Time_End": 496.0,
      "Text": " you can see we were kind of going at it pretty hardcore."
    },
    {
      "Time_Start": 497.0,
      "Time_End": 504.0,
      "Text": " In the future, there's not going to be an army of people necessarily."
    },
    {
      "Time_Start": 504.0,
      "Time_End": 508.0,
      "Text": " There's going to be an army of nodes. There's going to be an army of programs."
    },
    {
      "Time_Start": 508.0,
      "Time_End": 514.0,
      "Text": " Sandia, with their publication, said, hey, yeah, we're going to have 50 computers here all doing different things,"
    },
    {
      "Time_Start": 514.0,
      "Time_End": 517.0,
      "Text": " talking to each other. That's the defense."
    },
    {
      "Time_Start": 517.0,
      "Time_End": 525.0,
      "Text": " And no group of people can think fast enough and can act fast enough based on the information"
    },
    {
      "Time_Start": 525.0,
      "Time_End": 533.0,
      "Text": " that will be seen when you are hacking to make the right choices fast enough to penetrate."
    },
    {
      "Time_Start": 533.0,
      "Time_End": 545.0,
      "Text": " An army of one will be the hacker or the freaker or someone of that nature"
    },
    {
      "Time_Start": 545.0,
      "Time_End": 550.0,
      "Text": " who actually has computers that are doing all of the small tasks that he wants."
    },
    {
      "Time_Start": 550.0,
      "Time_End": 569.0,
      "Text": " The structure that can be used to do that must allow that the actions for the programs that they want to make"
    },
    {
      "Time_Start": 569.0,
      "Time_End": 577.0,
      "Text": " be structured significantly the same so that an autonomous node that's packet sniffing behind a firewall"
    },
    {
      "Time_Start": 577.0,
      "Time_End": 584.0,
      "Text": " and then sending that data, sneaking it outside the firewall, he sends it over to, say, an IRC server."
    },
    {
      "Time_Start": 584.0,
      "Time_End": 591.0,
      "Text": " There's a node on the IRC server that the same hacker who put the node behind the firewall put there."
    },
    {
      "Time_Start": 591.0,
      "Time_End": 596.0,
      "Text": " And it, the information layer that it's using, is just reading right from the IRC channel."
    },
    {
      "Time_Start": 596.0,
      "Time_End": 603.0,
      "Text": " And so in that case, he takes the data, and he doesn't, neither of the nodes know that the other one exists,"
    },
    {
      "Time_Start": 603.0,
      "Time_End": 609.0,
      "Text": " nor do they care, because they run on the rules internally. They don't care about anybody else."
    },
    {
      "Time_Start": 609.0,
      "Time_End": 617.0,
      "Text": " So he sees some data on the IRC channel, and he sends it to, you know, via, he makes little mail packets"
    },
    {
      "Time_Start": 617.0,
      "Time_End": 620.0,
      "Text": " and sends it via mail to South Africa or something."
    },
    {
      "Time_Start": 621.0,
      "Time_End": 629.0,
      "Text": " This is an example application of what multiple nodes can do and exactly how people will hack in the future."
    },
    {
      "Time_Start": 632.0,
      "Time_End": 640.0,
      "Text": " I want to talk a moment about some of the components that create a node."
    },
    {
      "Time_Start": 642.0,
      "Time_End": 645.0,
      "Text": " A hacker node would be nothing without an exploit database."
    },
    {
      "Time_Start": 645.0,
      "Time_End": 654.0,
      "Text": " This database is not some big SQL server specific thing."
    },
    {
      "Time_Start": 654.0,
      "Time_End": 657.0,
      "Text": " It's a basic ANSI C implementation."
    },
    {
      "Time_Start": 657.0,
      "Time_End": 659.0,
      "Text": " You've got fields, you've got rows, you've got columns."
    },
    {
      "Time_Start": 659.0,
      "Time_End": 661.0,
      "Text": " It's very simple."
    },
    {
      "Time_Start": 661.0,
      "Time_End": 668.0,
      "Text": " They're customizable templates, so you could have anything from a database that records an IP"
    },
    {
      "Time_Start": 668.0,
      "Time_End": 677.0,
      "Text": " and operating system information to usernames that were sniffed off of the network."
    },
    {
      "Time_Start": 680.0,
      "Time_End": 687.0,
      "Text": " Each of these modules will be, in some cases, loadable upon runtime."
    },
    {
      "Time_Start": 687.0,
      "Time_End": 693.0,
      "Text": " In some cases, they will have to be compiled in, and it really is going to depend on the operating system"
    },
    {
      "Time_Start": 693.0,
      "Time_End": 699.0,
      "Text": " and the platform that are used for that specific node."
    },
    {
      "Time_Start": 701.0,
      "Time_End": 707.0,
      "Text": " The attack tree logic is something that Bruce Schneier, many of you know who Bruce is,"
    },
    {
      "Time_Start": 707.0,
      "Time_End": 710.0,
      "Text": " actually documented."
    },
    {
      "Time_Start": 710.0,
      "Time_End": 718.0,
      "Text": " I believe he put it as, he finally was putting the smack down on the ideas that people had talked about"
    },
    {
      "Time_Start": 718.0,
      "Time_End": 724.0,
      "Text": " as far as making a logical tree and then sorting the nodes of that tree"
    },
    {
      "Time_Start": 724.0,
      "Time_End": 730.0,
      "Text": " to determine the best plausible way, under certain circumstances, to get to your goal."
    },
    {
      "Time_Start": 730.0,
      "Time_End": 736.0,
      "Text": " Where, if you were to take a node and say that it was a bank vault,"
    },
    {
      "Time_Start": 736.0,
      "Time_End": 743.0,
      "Text": " and then you would have, then, cascading leaves off of that, where one would be, you could blow it up."
    },
    {
      "Time_Start": 744.0,
      "Time_End": 750.0,
      "Text": " And then each of the nodes would have data assigned to it regarding what it would take to do that."
    },
    {
      "Time_Start": 750.0,
      "Time_End": 756.0,
      "Text": " In the case of blowing it up, you might need dynamite, in which case that might cost $25,000."
    },
    {
      "Time_Start": 756.0,
      "Time_End": 762.0,
      "Text": " And so there's data that's associated with actions that can take place within an attack tree."
    },
    {
      "Time_Start": 762.0,
      "Time_End": 769.0,
      "Text": " In these fields that you would define, you would then run simple sort algorithms"
    },
    {
      "Time_Start": 769.0,
      "Time_End": 772.0,
      "Text": " that would go through and say, which is the least expensive way?"
    },
    {
      "Time_Start": 772.0,
      "Time_End": 775.0,
      "Text": " And so then you go through all the leaves of your entire tree, and you say,"
    },
    {
      "Time_Start": 775.0,
      "Time_End": 779.0,
      "Text": " well, blowing up the bank vault to get the money is not going to be the cheapest way."
    },
    {
      "Time_Start": 779.0,
      "Time_End": 781.0,
      "Text": " We're looking for the cheapest way."
    },
    {
      "Time_Start": 781.0,
      "Time_End": 787.0,
      "Text": " And that might, over here, turn out to be just going and getting a lot of guns and stealing a van and showing up."
    },
    {
      "Time_Start": 787.0,
      "Time_End": 796.0,
      "Text": " So the attack tree logic itself is going to be a module that can be loaded by the node."
    },
    {
      "Time_Start": 796.0,
      "Time_End": 800.0,
      "Text": " If the node's purpose is aggressive, or maybe even defensive,"
    },
    {
      "Time_Start": 800.0,
      "Time_End": 807.0,
      "Text": " the node will have the ability to assign specific information in a tree, say of a network map,"
    },
    {
      "Time_Start": 807.0,
      "Time_End": 813.0,
      "Text": " to determine the fastest way to hack something, the easiest way to hack something,"
    },
    {
      "Time_Start": 813.0,
      "Time_End": 816.0,
      "Text": " or possibly the most stealthiest way."
    },
    {
      "Time_Start": 821.0,
      "Time_End": 826.0,
      "Text": " The independent decision making kind of just falls into the rules."
    },
    {
      "Time_Start": 827.0,
      "Time_End": 835.0,
      "Text": " The rules is the code that the developer creates for the specific node."
    },
    {
      "Time_Start": 844.0,
      "Time_End": 855.0,
      "Text": " The decisions themselves are specific of the designs and the choices that the developer makes when he writes it."
    },
    {
      "Time_Start": 855.0,
      "Time_End": 862.0,
      "Text": " This is why I shy away from saying it is artificial intelligence, because it's really not."
    },
    {
      "Time_Start": 862.0,
      "Time_End": 869.0,
      "Text": " The developer has to know about the cases that it will happen before he writes the code to create the rules."
    },
    {
      "Time_Start": 871.0,
      "Time_End": 876.0,
      "Text": " In many cases, when we want to instruct the node to have a certain behavior,"
    },
    {
      "Time_Start": 876.0,
      "Time_End": 883.0,
      "Text": " it would be troublesome to maintain hundreds of nodes around, hence the initial suggestion."
    },
    {
      "Time_Start": 883.0,
      "Time_End": 888.0,
      "Text": " An initial suggestion is when you run your node,"
    },
    {
      "Time_Start": 888.0,
      "Time_End": 894.0,
      "Text": " because you don't want 50 nodes around, one that does some packet sniffing and some decisions based on that,"
    },
    {
      "Time_Start": 894.0,
      "Time_End": 897.0,
      "Text": " a node that sits over here and does some DNS poisoning."
    },
    {
      "Time_Start": 897.0,
      "Time_End": 904.0,
      "Text": " It makes more sense because if you exploit a box and you want to run a bunch of programs on it,"
    },
    {
      "Time_Start": 904.0,
      "Time_End": 910.0,
      "Text": " it's probably going to be pretty obvious if you upload 100 megabytes worth of data to the machine"
    },
    {
      "Time_Start": 910.0,
      "Time_End": 913.0,
      "Text": " and then take up half the CPU time as well."
    },
    {
      "Time_Start": 913.0,
      "Time_End": 923.0,
      "Text": " So generally, you'll run a node and you'll incorporate more functionality in the rules than you'll need"
    },
    {
      "Time_Start": 923.0,
      "Time_End": 928.0,
      "Text": " so that it is all together, and then you will have an initial suggestion to the node,"
    },
    {
      "Time_Start": 928.0,
      "Time_End": 937.0,
      "Text": " and you will say, hi, I want you to be aggressive for a given node that is actually intended to exploit a box."
    },
    {
      "Time_Start": 941.0,
      "Time_End": 951.0,
      "Text": " Some of the other issues about having a node that you use that is a client on your machine,"
    },
    {
      "Time_Start": 951.0,
      "Time_End": 953.0,
      "Text": " and you use it to exploit a server."
    },
    {
      "Time_Start": 953.0,
      "Time_End": 962.0,
      "Text": " At that point, you put another node on the server, naturally, and that can be for reasons of packet sniffing."
    },
    {
      "Time_Start": 962.0,
      "Time_End": 971.0,
      "Text": " You might put it there simply to own the box, to keep certain watchdog programs from running on the server."
    },
    {
      "Time_Start": 971.0,
      "Time_End": 979.0,
      "Text": " There's multiple reasons, and in that case, you might have a hierarchy of nodes,"
    },
    {
      "Time_Start": 979.0,
      "Time_End": 986.0,
      "Text": " which would actually turn the autonomous nodes back into intelligent agents because they might want to communicate."
    },
    {
      "Time_Start": 993.0,
      "Time_End": 1003.0,
      "Text": " One issue that I've had while working with this is that the code for this is somewhat touchy"
    },
    {
      "Time_Start": 1003.0,
      "Time_End": 1010.0,
      "Text": " because it's probably not a good idea to have replicating autonomous hacking nodes floating around the internet"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1018.0,
      "Text": " where any script kitty can decide they want to replicate 200,000 machines out there."
    },
    {
      "Time_Start": 1019.0,
      "Time_End": 1027.0,
      "Text": " The status of this project is basically going to work that it is kind of a closed code."
    },
    {
      "Time_Start": 1032.0,
      "Time_End": 1042.0,
      "Text": " The obscure communication layer, this is basically going to be an implementation of a layer of communication"
    },
    {
      "Time_Start": 1042.0,
      "Time_End": 1049.0,
      "Text": " where the node, when he's in a situation where he doesn't want to say,"
    },
    {
      "Time_Start": 1049.0,
      "Time_End": 1053.0,
      "Text": " Hey, I'm over here. Why don't you come format my hard drive or delete me?"
    },
    {
      "Time_Start": 1053.0,
      "Time_End": 1062.0,
      "Text": " He will generally use higher-level protocols, and then he will do all of his communication via payloading"
    },
    {
      "Time_Start": 1062.0,
      "Time_End": 1067.0,
      "Text": " right onto the top of the protocol, just make something that's valid that's going to go through a firewall."
    },
    {
      "Time_Start": 1067.0,
      "Time_End": 1075.0,
      "Text": " Then he tags on the end some signature information and some basic information that he's trying to send,"
    },
    {
      "Time_Start": 1075.0,
      "Time_End": 1079.0,
      "Text": " such as, Hey, I found a username and password, such a thing."
    },
    {
      "Time_Start": 1079.0,
      "Time_End": 1085.0,
      "Text": " At that point, he can send data via payload directly outside of a firewall or just peer-to-peer."
    },
    {
      "Time_Start": 1085.0,
      "Time_End": 1090.0,
      "Text": " Now, a node that's running on that other machine that's packet-sniffing can say,"
    },
    {
      "Time_Start": 1090.0,
      "Time_End": 1095.0,
      "Text": " Oh, because he's packet-sniffing, he sees everything, and he sees the payload,"
    },
    {
      "Time_Start": 1095.0,
      "Time_End": 1101.0,
      "Text": " and he's looking for the idea or the ID of another node, and so he sees that,"
    },
    {
      "Time_Start": 1101.0,
      "Time_End": 1105.0,
      "Text": " and then he can immediately take that information and do whatever he wanted with it."
    },
    {
      "Time_Start": 1105.0,
      "Time_End": 1112.0,
      "Text": " Possibly there was a node inside of a network that didn't want to be found, hence the rules."
    },
    {
      "Time_Start": 1112.0,
      "Time_End": 1115.0,
      "Text": " He was being quiet because he was in a network."
    },
    {
      "Time_Start": 1115.0,
      "Time_End": 1119.0,
      "Text": " At that point, perhaps he saw a username and password, and so he decided,"
    },
    {
      "Time_Start": 1119.0,
      "Time_End": 1123.0,
      "Text": " Okay, I'm going to broadcast this out to an IRC channel."
    },
    {
      "Time_Start": 1123.0,
      "Time_End": 1127.0,
      "Text": " Now, he's an autonomous node. He doesn't care if anybody hears him."
    },
    {
      "Time_Start": 1127.0,
      "Time_End": 1129.0,
      "Text": " He's going to broadcast anyway."
    },
    {
      "Time_Start": 1129.0,
      "Time_End": 1134.0,
      "Text": " Maybe he waits until Monday morning when there's a lot of traffic on the network at work"
    },
    {
      "Time_Start": 1134.0,
      "Time_End": 1139.0,
      "Text": " before he broadcasts so that no one can specifically see that."
    },
    {
      "Time_Start": 1139.0,
      "Time_End": 1143.0,
      "Text": " These are some of the ideas that come around when you start talking about"
    },
    {
      "Time_Start": 1143.0,
      "Time_End": 1148.0,
      "Text": " the little hacker programs that are going to take over the Internet."
    },
    {
      "Time_Start": 1148.0,
      "Time_End": 1155.0,
      "Text": " Then, let's say on this IRC channel, the information shows up."
    },
    {
      "Time_Start": 1155.0,
      "Time_End": 1161.0,
      "Text": " Also included in this communication layer, we'll link back to the exploit database,"
    },
    {
      "Time_Start": 1161.0,
      "Time_End": 1168.0,
      "Text": " but there could also be a database that stores the server mappings, usernames, and such."
    },
    {
      "Time_Start": 1168.0,
      "Time_End": 1174.0,
      "Text": " The packet sniffer on the inside of the firewall, he sends a bunch of data out and says,"
    },
    {
      "Time_Start": 1174.0,
      "Time_End": 1179.0,
      "Text": " Hey, I found a password, I found a username, and actually sends some commands"
    },
    {
      "Time_Start": 1179.0,
      "Time_End": 1188.0,
      "Text": " so that another node, if it happens to see it, stores that information into a database."
    },
    {
      "Time_Start": 1188.0,
      "Time_End": 1191.0,
      "Text": " The packet sniffer I input where applicable."
    },
    {
      "Time_Start": 1191.0,
      "Time_End": 1201.0,
      "Text": " There are certain cases on certain networks where this is not going to be working, basically."
    },
    {
      "Time_Start": 1201.0,
      "Time_End": 1206.0,
      "Text": " On a switched network, you're going to have problems seeing certain packets"
    },
    {
      "Time_Start": 1206.0,
      "Time_End": 1211.0,
      "Text": " going from many of the other client machines that are on that network."
    },
    {
      "Time_Start": 1211.0,
      "Time_End": 1217.0,
      "Text": " There are certain aggressive natures that a node could take."
    },
    {
      "Time_Start": 1217.0,
      "Time_End": 1221.0,
      "Text": " Depending on the initial suggestion that is given to the node,"
    },
    {
      "Time_Start": 1221.0,
      "Time_End": 1227.0,
      "Text": " upon which it can determine, Hey, I'm supposed to be aggressive, or I'm supposed to be quiet."
    },
    {
      "Time_Start": 1227.0,
      "Time_End": 1232.0,
      "Text": " In the aggressive case, if a node was sitting on a switched network,"
    },
    {
      "Time_Start": 1232.0,
      "Time_End": 1238.0,
      "Text": " he might decide to go ahead and DOS the switch, and try to get it to switch into hubbed mode."
    },
    {
      "Time_Start": 1238.0,
      "Time_End": 1243.0,
      "Text": " At that point, maybe sniff the network, try to get what he can,"
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1248.0,
      "Text": " and then send that information out to an IRC server."
    },
    {
      "Time_Start": 1254.0,
      "Time_End": 1259.0,
      "Text": " Want me to speed it up? Just a little bit? Okay."
    },
    {
      "Time_Start": 1263.0,
      "Time_End": 1269.0,
      "Text": " Generally, the purpose behind this entire project is to supply common ground"
    },
    {
      "Time_Start": 1269.0,
      "Time_End": 1276.0,
      "Text": " upon which any network security program for any operating system and platform can be developed."
    },
    {
      "Time_Start": 1276.0,
      "Time_End": 1282.0,
      "Text": " Also, so that ghetto hackers can win CTF without slaving at the CTF tables."
    },
    {
      "Time_Start": 1284.0,
      "Time_End": 1291.0,
      "Text": " The first two operating systems for which I'm currently working this project on is Linux and Windows."
    },
    {
      "Time_Start": 1291.0,
      "Time_End": 1295.0,
      "Text": " For my entire life, I've actually worked on DOS and Windows."
    },
    {
      "Time_Start": 1295.0,
      "Time_End": 1300.0,
      "Text": " My current job includes working on Windows, as much as I'm a ghetto hacker."
    },
    {
      "Time_Start": 1300.0,
      "Time_End": 1304.0,
      "Text": " I only have Linux on one machine, and I think it's broke."
    },
    {
      "Time_Start": 1308.0,
      "Time_End": 1317.0,
      "Text": " Later, following loading and finishing the modules for the autonomous nodes,"
    },
    {
      "Time_Start": 1317.0,
      "Time_End": 1323.0,
      "Text": " I'm hoping to have a port to OpenBSD and a couple other operating systems."
    },
    {
      "Time_Start": 1323.0,
      "Time_End": 1328.0,
      "Text": " I'm hoping that I'm actually going to have a working version of this next year"
    },
    {
      "Time_Start": 1328.0,
      "Time_End": 1331.0,
      "Text": " with the intention of using it actually at CTF."
    },
    {
      "Time_Start": 1338.0,
      "Time_End": 1340.0,
      "Text": " I think that's about all I have."
    },
    {
      "Time_Start": 1340.0,
      "Time_End": 1342.0,
      "Text": " Any questions?"
    },
    {
      "Time_Start": 1342.0,
      "Time_End": 1347.0,
      "Text": " I'm probably not that clear on stuff, because I'm all nervous when I talk out in front of people."
    },
    {
      "Time_Start": 1354.0,
      "Time_End": 1372.0,
      "Text": " Because of the size, the speed, and the very specific nature at which a node needs to perform a single task"
    },
    {
      "Time_Start": 1372.0,
      "Time_End": 1376.0,
      "Text": " and just do exactly what I want, and he's right there, and he's going to do this,"
    },
    {
      "Time_Start": 1376.0,
      "Time_End": 1381.0,
      "Text": " I haven't even thought about actually doing any AI work at all."
    },
    {
      "Time_Start": 1383.0,
      "Time_End": 1387.0,
      "Text": " Maybe later on, if all of this was incorporated into a single object,"
    },
    {
      "Time_Start": 1387.0,
      "Time_End": 1394.0,
      "Text": " which literally was NodeHacker, the guy that could do anything you wanted him to do,"
    },
    {
      "Time_Start": 1394.0,
      "Time_End": 1397.0,
      "Text": " could take down any box, could do any type of poisoning,"
    },
    {
      "Time_Start": 1397.0,
      "Time_End": 1402.0,
      "Text": " at that point in time, it would probably be such a big project that you'd have to actually"
    },
    {
      "Time_Start": 1402.0,
      "Time_End": 1406.0,
      "Text": " move to the point where you used real rules of artificial intelligence"
    },
    {
      "Time_Start": 1406.0,
      "Time_End": 1412.0,
      "Text": " to determine importance of events and such."
    },
    {
      "Time_Start": 1413.0,
      "Time_End": 1415.0,
      "Text": " Any questions?"
    },
    {
      "Time_Start": 1434.0,
      "Time_End": 1436.0,
      "Text": " They are actually using AI."
    },
    {
      "Time_Start": 1436.0,
      "Time_End": 1442.0,
      "Text": " They are also, to my knowledge, incorporating the ability for a server"
    },
    {
      "Time_Start": 1442.0,
      "Time_End": 1449.0,
      "Text": " they're actually not taking an FTP server and then writing some AI code on the side to watch what's going on."
    },
    {
      "Time_Start": 1449.0,
      "Time_End": 1453.0,
      "Text": " They're actually rewriting the FTP server at that point"
    },
    {
      "Time_Start": 1453.0,
      "Time_End": 1457.0,
      "Text": " and incorporating all of the security into the service itself,"
    },
    {
      "Time_Start": 1457.0,
      "Time_End": 1463.0,
      "Text": " so that literally your FTP server would be able to talk to your web server"
    },
    {
      "Time_Start": 1463.0,
      "Time_End": 1465.0,
      "Text": " as far as the security is concerned and say,"
    },
    {
      "Time_Start": 1465.0,
      "Time_End": 1469.0,
      "Text": " Hey, I saw this. What did you see? That type of a thing."
    },
    {
      "Time_Start": 1482.0,
      "Time_End": 1484.0,
      "Text": " I'm sorry. I'm sorry."
    },
    {
      "Time_Start": 1484.0,
      "Time_End": 1499.0,
      "Text": " Oh, the attack tree itself, each of the leafs or the actual nodes themselves are a database."
    },
    {
      "Time_Start": 1499.0,
      "Time_End": 1501.0,
      "Text": " It is a database itself."
    },
    {
      "Time_Start": 1501.0,
      "Time_End": 1505.0,
      "Text": " So the template that's used to create those nodes"
    },
    {
      "Time_Start": 1505.0,
      "Time_End": 1510.0,
      "Text": " can simply be used to actually store that information to a database."
    },
    {
      "Time_Start": 1511.0,
      "Time_End": 1514.0,
      "Text": " You could create it on the fly if you wanted to."
    },
    {
      "Time_Start": 1514.0,
      "Time_End": 1516.0,
      "Text": " Does that answer your question?"
    },
    {
      "Time_Start": 1540.0,
      "Time_End": 1542.0,
      "Text": " Let me see if this answers your question."
    },
    {
      "Time_Start": 1542.0,
      "Time_End": 1545.0,
      "Text": " Let's say I have a node."
    },
    {
      "Time_Start": 1545.0,
      "Time_End": 1550.0,
      "Text": " And this node is supposed to map a network."
    },
    {
      "Time_Start": 1550.0,
      "Time_End": 1552.0,
      "Text": " That's its intention."
    },
    {
      "Time_Start": 1552.0,
      "Time_End": 1556.0,
      "Text": " And we'll say that it's going to map a network"
    },
    {
      "Time_Start": 1556.0,
      "Time_End": 1561.0,
      "Text": " and then somewhere it's going to exploit or replicate itself."
    },
    {
      "Time_Start": 1561.0,
      "Time_End": 1563.0,
      "Text": " So it creates a database."
    },
    {
      "Time_Start": 1563.0,
      "Time_End": 1566.0,
      "Text": " It performs its deeds of sniffing the network."
    },
    {
      "Time_Start": 1566.0,
      "Time_End": 1572.0,
      "Text": " And it sees very simple signs through packets."
    },
    {
      "Time_Start": 1572.0,
      "Time_End": 1574.0,
      "Text": " And it just starts marking down and says,"
    },
    {
      "Time_Start": 1574.0,
      "Time_End": 1578.0,
      "Text": " Okay, I think that this guy is this type of an operating system over here at this IP."
    },
    {
      "Time_Start": 1578.0,
      "Time_End": 1580.0,
      "Text": " And then I think that this guy is over here."
    },
    {
      "Time_Start": 1580.0,
      "Time_End": 1582.0,
      "Text": " And I saw some message come through."
    },
    {
      "Time_Start": 1582.0,
      "Time_End": 1584.0,
      "Text": " And he tries to basically map out."
    },
    {
      "Time_Start": 1584.0,
      "Time_End": 1586.0,
      "Text": " And we'll say that there are, say, five machines there."
    },
    {
      "Time_Start": 1586.0,
      "Time_End": 1593.0,
      "Text": " Now, let's say that I told him that there was an actual machine behind us."
    },
    {
      "Time_Start": 1593.0,
      "Time_End": 1597.0,
      "Text": " And he's trying to figure out the way to get there by mapping this network."
    },
    {
      "Time_Start": 1597.0,
      "Time_End": 1601.0,
      "Text": " In that case, his attack tree would,"
    },
    {
      "Time_Start": 1601.0,
      "Time_End": 1605.0,
      "Text": " by the traces of the different routes through the machines,"
    },
    {
      "Time_Start": 1605.0,
      "Time_End": 1610.0,
      "Text": " he would create himself the nodes that would exist on the tree."
    },
    {
      "Time_Start": 1610.0,
      "Time_End": 1614.0,
      "Text": " And then at that point, predefined sort routines that would say,"
    },
    {
      "Time_Start": 1614.0,
      "Time_End": 1619.0,
      "Text": " by operating system or different things like that,"
    },
    {
      "Time_Start": 1619.0,
      "Time_End": 1623.0,
      "Text": " based on the exploits that he had in his own database,"
    },
    {
      "Time_Start": 1623.0,
      "Time_End": 1628.0,
      "Text": " he could sort by that and then determine which route he would want to take."
    },
    {
      "Time_Start": 1628.0,
      "Time_End": 1634.0,
      "Text": " Does that answer your question?"
    },
    {
      "Time_Start": 1634.0,
      "Time_End": 1641.0,
      "Text": " Okay, you can grab me afterwards if you'd like to talk about it more."
    },
    {
      "Time_Start": 1641.0,
      "Time_End": 1644.0,
      "Text": " Are there any more questions?"
    },
    {
      "Time_Start": 1644.0,
      "Time_End": 1645.0,
      "Text": " Sir?"
    },
    {
      "Time_Start": 1646.0,
      "Time_End": 1650.0,
      "Text": " They say you've got more exploits on a given portion of your tree."
    },
    {
      "Time_Start": 1650.0,
      "Time_End": 1655.0,
      "Text": " I'd rather you design one node for a given database"
    },
    {
      "Time_Start": 1655.0,
      "Time_End": 1658.0,
      "Text": " and deal with all four of those exploits rather than just four."
    },
    {
      "Time_Start": 1658.0,
      "Time_End": 1663.0,
      "Text": " So, you know, how do you deal with each and every one of those exploits?"
    },
    {
      "Time_Start": 1663.0,
      "Time_End": 1673.0,
      "Text": " Personally, I..."
    },
    {
      "Time_Start": 1673.0,
      "Time_End": 1678.0,
      "Text": " Can you say the question again? Sorry."
    },
    {
      "Time_Start": 1678.0,
      "Time_End": 1686.0,
      "Text": " He said, would I rather have one node that knew about four exploits"
    },
    {
      "Time_Start": 1686.0,
      "Time_End": 1692.0,
      "Text": " and could use them rather than having four nodes with four different exploits?"
    },
    {
      "Time_Start": 1693.0,
      "Time_End": 1697.0,
      "Text": " If the four nodes were on four different machines,"
    },
    {
      "Time_Start": 1697.0,
      "Time_End": 1700.0,
      "Text": " the purpose being to spread out and attack,"
    },
    {
      "Time_Start": 1700.0,
      "Time_End": 1705.0,
      "Text": " I guess there's kind of some more information that might change my decision."
    },
    {
      "Time_Start": 1705.0,
      "Time_End": 1708.0,
      "Text": " If I was just working from my client machine,"
    },
    {
      "Time_Start": 1708.0,
      "Time_End": 1712.0,
      "Text": " I'd like one node that would actually know about everything."
    },
    {
      "Time_Start": 1712.0,
      "Time_End": 1716.0,
      "Text": " But if you're doing a range of attacks from different positions,"
    },
    {
      "Time_Start": 1716.0,
      "Time_End": 1720.0,
      "Text": " it would make more sense to have multiple nodes."
    },
    {
      "Time_Start": 1732.0,
      "Time_End": 1737.0,
      "Text": " I'm not actually real familiar with library nodes, did you say?"
    },
    {
      "Time_Start": 1739.0,
      "Time_End": 1743.0,
      "Text": " I have not done any research on library nodes."
    },
    {
      "Time_Start": 1746.0,
      "Time_End": 1750.0,
      "Text": " Any other questions?"
    }
  ]
}