{"segments": [{"Time_Start": 0.0, "Time_End": 19.84, "Text": " for those of you who don't know me let's just say you can't hear me i'm not loud enough"}, {"Time_Start": 19.84, "Time_End": 27.5, "Text": " you can't hear me i'm not loud enough okay got it that's the first time in my life"}, {"Time_Start": 27.5, "Time_End": 29.02, "Text": " anybody's ever told me i wasn't loud"}, {"Time_Start": 30.0, "Time_End": 36.5, "Text": " I've been screwing with computers for 23 years. I started with HP 3,000, seven-column paper tape."}, {"Time_Start": 36.6, "Time_End": 39.72, "Text": " I've programmed on punch cards. I've done client server. I've done mainframes. I've done"}, {"Time_Start": 39.72, "Time_End": 42.76, "Text": " assembler and mainframes. I've done assembler on PCs. I've been around a long time."}, {"Time_Start": 43.980000000000004, "Time_End": 49.06, "Text": " The purpose of this talk, which is called building a backdoor binary, my animated slide,"}, {"Time_Start": 50.2, "Time_End": 57.94, "Text": " is a step-by-step walk through, this is going to be a lot of fun, of how to program your way back into that box you just worked so hard to root."}, {"Time_Start": 57.94, "Time_End": 63.8, "Text": " the motivation behind this being I consider hacking to have essentially five steps"}, {"Time_Start": 63.8, "Time_End": 68.17999999999999, "Text": " figuring out what it is you want to get into figuring out how it is you're going to get into it"}, {"Time_Start": 68.17999999999999, "Time_End": 73.3, "Text": " actually doing the exploit number four my most important point cleaning up after yourself"}, {"Time_Start": 73.3, "Time_End": 77.82, "Text": " and number five making sure that you don't have to go through steps one through four the next time"}, {"Time_Start": 77.82, "Time_End": 83.36, "Text": " you want to get back in this talk falls under number five namely setting yourself up a way"}, {"Time_Start": 83.36, "Time_End": 87.92, "Text": " to get into an allegedly secure system after you've already got back into it"}, {"Time_Start": 87.94, "Time_End": 93.3, "Text": " so that essentially you have access, which may or may not be legitimate at this point,"}, {"Time_Start": 93.64, "Time_End": 96.4, "Text": " but the end user base doesn't think they've been owned."}, {"Time_Start": 97.36, "Time_End": 97.56, "Text": " Okay?"}, {"Time_Start": 98.22, "Time_End": 102.53999999999999, "Text": " So this is featuring SecureCell SSH.2.0.13."}, {"Time_Start": 102.78, "Time_End": 106.53999999999999, "Text": " I know 2.1 is out. I actually wrote this several months ago."}, {"Time_Start": 107.86, "Time_End": 111.82, "Text": " I am working on a 2.1, and I'm Wrangler."}, {"Time_Start": 113.44, "Time_End": 117.92, "Text": " So the point here, the first point I want to make is that secure."}, {"Time_Start": 117.94, "Time_End": 123.94, "Text": " The heightened level of security in the community has made it such that people are actually"}, {"Time_Start": 123.94, "Time_End": 126.94, "Text": " paying attention. They may not necessarily have a clue, but they're paying attention."}, {"Time_Start": 126.94, "Time_End": 129.94, "Text": " So a lot of the obvious stuff that you used to be able to use to get into things is gone."}, {"Time_Start": 129.94, "Time_End": 133.94, "Text": " You're not going to just telling it into somebody's machine with certain environment variables set,"}, {"Time_Start": 133.94, "Time_End": 135.94, "Text": " and boom, you're a root user, okay?"}, {"Time_Start": 135.94, "Time_End": 139.94, "Text": " People are actually, they know what NMAP is, they know how to download it, they know how to run it,"}, {"Time_Start": 139.94, "Time_End": 146.94, "Text": " they may not, you know, do much more than that, but you're not going to find the obvious ways into a system anymore."}, {"Time_Start": 146.94, "Time_End": 155.9, "Text": " So, if you want to get into something, you actually have to pay attention, and I mean, other than just going to root shell and downloading the latest exploit and running it and seeing if it works."}, {"Time_Start": 157.46, "Time_End": 164.52, "Text": " Most of the time, remote access has been turned off for non-essential services, you know?"}, {"Time_Start": 164.64, "Time_End": 168.1, "Text": " I mean, you may find, you're going to find a lot of sunboxes with RPC turned on, okay?"}, {"Time_Start": 168.68, "Time_End": 176.5, "Text": " But if, you know, a good star Nix box is going to have maybe FTP, probably FTP, probably FTC,"}, {"Time_Start": 176.94, "Time_End": 187.98, "Text": " SSH, definitely not telnet, maybe SMTP, maybe DNS, maybe web, and that's it, you know?"}, {"Time_Start": 188.0, "Time_End": 191.52, "Text": " And of course, then there's the NT world and we're not going there."}, {"Time_Start": 193.68, "Time_End": 201.07999999999998, "Text": " So for the most part, what I'm trying to say here is that Secure Shell has become the de facto remote access protocol in systems where people are actually paying attention."}, {"Time_Start": 201.2, "Time_End": 203.06, "Text": " And again, there are exceptions to this rule."}, {"Time_Start": 203.14, "Time_End": 204.18, "Text": " There are telnet's out there."}, {"Time_Start": 204.18, "Time_End": 206.92, "Text": " I've got a whole frigging web page of over 3,000 class Cs of"}, {"Time_Start": 206.94, "Time_End": 213.9, "Text": " telnets. But if you're going after a, shall we say, a worthy target, the likelihood is you're"}, {"Time_Start": 213.9, "Time_End": 219.28, "Text": " going to have to actually think a little to figure out how to bust in. So this is a coding example."}, {"Time_Start": 219.38, "Time_End": 223.57999999999998, "Text": " This is an example of something I actually sat down and did and spent quite a long night doing."}, {"Time_Start": 224.52, "Time_End": 228.98, "Text": " And I wanted to go through it in a methodical way and explain some of the pitfalls because essentially"}, {"Time_Start": 228.98, "Time_End": 232.66, "Text": " when you think about, okay, backdoring SSH, you would think it's a fairly trivial exercise."}, {"Time_Start": 232.66, "Time_End": 236.92, "Text": " Go in and find some password and then say, if my password, if my password."}, {"Time_Start": 236.94, "Time_End": 241.44, "Text": " password, you know, is this, then branch around all the validation code and let me in."}, {"Time_Start": 241.44, "Time_End": 242.94, "Text": " It's not."}, {"Time_Start": 242.94, "Time_End": 243.94, "Text": " Okay?"}, {"Time_Start": 243.94, "Time_End": 248.94, "Text": " So the first thing I'm going to cover is the design, which is understanding the code and what you intend to accomplish with it."}, {"Time_Start": 248.94, "Time_End": 255.94, "Text": " The next thing, coding, the factors that you have to consider when you're modifying the source code, namely how to do it so that you don't break it."}, {"Time_Start": 255.94, "Time_End": 262.94, "Text": " Building, which is emulating the original as closely as possible, just because you can gain access doesn't mean the entire user community should be locked out."}, {"Time_Start": 262.94, "Time_End": 263.94, "Text": " They might notice that."}, {"Time_Start": 263.94, "Time_End": 269.94, "Text": " that installation, which is actually going in there, doing the dirty work, and that too turned out to be non-trivial."}, {"Time_Start": 269.94, "Time_End": 274.94, "Text": " And finally, my favorite, share the information, which I hope is why we're all here today."}, {"Time_Start": 274.94, "Time_End": 279.94, "Text": " Oops, that was, here go, there we go."}, {"Time_Start": 279.94, "Time_End": 282.94, "Text": " Plan what you want to accomplish."}, {"Time_Start": 282.94, "Time_End": 288.94, "Text": " In essence, my theory and my philosophy, I won't burden you with it too much,"}, {"Time_Start": 288.94, "Time_End": 291.94, "Text": " but just to say that a hack is a statement that cannot be ignored."}, {"Time_Start": 291.94, "Time_End": 297.38, "Text": " If you're going to go to the trouble of gaining illegitimate computer access, there's a reason for it."}, {"Time_Start": 297.7, "Time_End": 301.04, "Text": " And you should think it through, because there are repercussions that are associated with it."}, {"Time_Start": 301.84, "Time_End": 305.74, "Text": " If you're going to do this kind of thing, think about what exactly it is you intend to accomplish."}, {"Time_Start": 305.9, "Time_End": 309.4, "Text": " Do you want to be able to snag those HR records?"}, {"Time_Start": 309.4, "Time_End": 315.26, "Text": " Or do you want to be able to read a certain person's email because you think that they're cheating on you or whatever the hell it is?"}, {"Time_Start": 315.26, "Time_End": 316.94, "Text": " You know, understand what your motivation is."}, {"Time_Start": 318.54, "Time_End": 321.62, "Text": " If you're trying to just, you know, if you're playing,"}, {"Time_Start": 321.94, "Time_End": 327.3, "Text": " what I call sport hacking, where you're essentially trying to see how many boxes you can have root on at the same time."}, {"Time_Start": 327.36, "Time_End": 333.1, "Text": " I don't know what your motivation is, but you need to know that up front, because that is going to influence what you do later on down the line."}, {"Time_Start": 334.38, "Time_End": 337.34, "Text": " And what is involved in replacing the files on the system?"}, {"Time_Start": 338.74, "Time_End": 344.5, "Text": " Unix, there are a lot of different aspects of this to be considered, you know, the size, the checks on the ownership, the times,"}, {"Time_Start": 345.06, "Time_End": 349.04, "Text": " the log entries that are going to be generated by your legitimate or illegitimate access,"}, {"Time_Start": 349.04, "Time_End": 356.36, "Text": " security tools that may or may not be in place to monitor what it is you're doing or something that you think you might do later on."}, {"Time_Start": 357.20000000000005, "Time_End": 363.58000000000004, "Text": " And the fact that you want the behavior of the system to remain within expected parameters."}, {"Time_Start": 363.58000000000004, "Time_End": 376.04, "Text": " You don't want to give a system administrator or a user, clueless or otherwise, any kind of a red flag or even a yellow flag that might make them start to poke around and discover that actually there's something going on there."}, {"Time_Start": 379.04, "Time_End": 383.18, "Text": " Just to give you an idea, I did this on a lot of different platforms."}, {"Time_Start": 383.8, "Time_End": 386.64000000000004, "Text": " And for this, this is just Solaris 2.7."}, {"Time_Start": 388.08000000000004, "Time_End": 390.5, "Text": " I did 1.2.27 and 2.0.13."}, {"Time_Start": 390.66, "Time_End": 394.42, "Text": " I actually have a lot of comparisons for other ones for like BSD and Linux and all."}, {"Time_Start": 394.92, "Time_End": 399.42, "Text": " But just the difference between the strip binary and the unstripped binary,"}, {"Time_Start": 401.92, "Time_End": 403.5, "Text": " you've got quite a lot of range here."}, {"Time_Start": 403.58000000000004, "Time_End": 407.78000000000003, "Text": " On this slide, you've got between, you know, 600K and 2600K."}, {"Time_Start": 408.04, "Time_End": 408.86, "Text": " I've seen the binary."}, {"Time_Start": 409.04, "Time_End": 415.96000000000004, "Text": " up to 760K. So there's file size is something I'm going to touch on a lot here,"}, {"Time_Start": 416.04, "Time_End": 420.16, "Text": " because that's something that tools look at and something that people can eyeball."}, {"Time_Start": 420.48, "Time_End": 428.44, "Text": " I need to turn off my radio. Here we go. File check sums. I've actually got this in a slide"}, {"Time_Start": 428.44, "Time_End": 432.70000000000005, "Text": " later, but I think it bears a sufficient weight that I should say it earlier enough now. Tripwire"}, {"Time_Start": 432.70000000000005, "Time_End": 439.02000000000004, "Text": " will ruin your whole day. Everybody who's not running tripwire on your system,"}, {"Time_Start": 439.04, "Time_End": 440.6, "Text": " right now, raise your hand, please."}, {"Time_Start": 442.98, "Time_End": 446.68, "Text": " All the rest of you, please raise your hand, too. Come on, raise your hands."}, {"Time_Start": 446.90000000000003, "Time_End": 450.62, "Text": " I want to see the hands that are not. I'm not going to, I'm not going to go after you later. Just"}, {"Time_Start": 450.62, "Time_End": 454.56, "Text": " let me get a show of hands. Yeah, there's a few, okay?"}, {"Time_Start": 456.82000000000005, "Time_End": 461.74, "Text": " Binary check-summing is a really nice tool for tracking Trojans. If somebody gains"}, {"Time_Start": 461.74, "Time_End": 465.42, "Text": " illegitimate access to your system and they change the binary indiscriminately, and"}, {"Time_Start": 465.42, "Time_End": 469.02000000000004, "Text": " unfortunately, a lot of people who hack systems nowadays are indiscriminate, they don't really pay attention."}, {"Time_Start": 469.04, "Time_End": 470.40000000000003, "Text": " to the fine details."}, {"Time_Start": 471.28000000000003, "Time_End": 473.42, "Text": " A binary check-summing is going to spot it"}, {"Time_Start": 473.42, "Time_End": 476.14000000000004, "Text": " and is going to hopefully generate the appropriate reg flag,"}, {"Time_Start": 476.38, "Time_End": 478.0, "Text": " not in tomorrow morning's email,"}, {"Time_Start": 480.08000000000004, "Time_End": 482.36, "Text": " preferably on the console that's up there on the wall."}, {"Time_Start": 484.22, "Time_End": 486.88, "Text": " The CRC-32-bit check-sum algorithm, I can"}, {"Time_Start": 486.88, "Time_End": 489.3, "Text": " and will go into that, but I'm not going to do it during this talk"}, {"Time_Start": 489.3, "Time_End": 491.36, "Text": " because quite honestly I could do a whole talk on check-summing."}, {"Time_Start": 491.78000000000003, "Time_End": 493.40000000000003, "Text": " So if you want to get into the differences"}, {"Time_Start": 493.40000000000003, "Time_End": 495.62, "Text": " between the different platforms and the different binary formats"}, {"Time_Start": 495.62, "Time_End": 497.42, "Text": " and the checksums and stuff, let's go drink beer."}, {"Time_Start": 499.04, "Time_End": 504.32, "Text": " File access timestamps in Unix, you have three timestamps, you have the time that the file was last accessed,"}, {"Time_Start": 504.32, "Time_End": 510.48, "Text": " the time that the file was last modified, and the time that the file attributes, excluding the above, were last changed."}, {"Time_Start": 511.58000000000004, "Time_End": 518.64, "Text": " Last time I checked, two of those could be modified by user commands, and the third one was a programmatic challenge."}, {"Time_Start": 520.1800000000001, "Time_End": 524.3000000000001, "Text": " Still, if you're going to screw around with files and you're going to screw around with file attributes,"}, {"Time_Start": 524.62, "Time_End": 529.02, "Text": " it's best to make note beforehand of what the original ones were."}, {"Time_Start": 529.04, "Time_End": 532.18, "Text": " and what the ones are going to be after you change it."}, {"Time_Start": 532.4, "Time_End": 534.1999999999999, "Text": " Hopefully those two values will be the same."}, {"Time_Start": 534.6999999999999, "Time_End": 539.12, "Text": " And that way, if somebody does decide to do something cute like diff their entire file system tree overnight,"}, {"Time_Start": 539.52, "Time_End": 540.9599999999999, "Text": " that won't show up in the listing."}, {"Time_Start": 543.5999999999999, "Time_End": 545.5799999999999, "Text": " And understanding the source code and its behavior,"}, {"Time_Start": 545.6999999999999, "Time_End": 547.56, "Text": " and this one's going to take two minutes instead of one."}, {"Time_Start": 549.0799999999999, "Time_End": 551.14, "Text": " SecureShell is a client server protocol, yay."}, {"Time_Start": 551.9399999999999, "Time_End": 554.56, "Text": " It creates an encrypted communication channel between the hosts."}, {"Time_Start": 555.3199999999999, "Time_End": 557.64, "Text": " It performs authentication against the encrypted password."}, {"Time_Start": 557.64, "Time_End": 559.02, "Text": " It stores the password in the user-conserver."}, {"Time_Start": 559.04, "Time_End": 561.92, "Text": " potential for the privileged user only."}, {"Time_Start": 561.92, "Time_End": 564.0799999999999, "Text": " So this actually is a special case."}, {"Time_Start": 564.0799999999999, "Time_End": 569.2199999999999, "Text": " The encrypted hash does not get stored for anybody except UID zero."}, {"Time_Start": 569.2199999999999, "Time_End": 573.3399999999999, "Text": " So since we have no one, UID zero, that's germane."}, {"Time_Start": 573.3399999999999, "Time_End": 574.88, "Text": " You can configure this thing."}, {"Time_Start": 574.88, "Time_End": 576.4399999999999, "Text": " There are two configuration files."}, {"Time_Start": 576.4399999999999, "Time_End": 578.26, "Text": " There's actually the client side configuration file"}, {"Time_Start": 578.26, "Time_End": 579.9599999999999, "Text": " and the server side configuration file."}, {"Time_Start": 579.9599999999999, "Time_End": 583.98, "Text": " And the configurations actually dictate what parts of the code"}, {"Time_Start": 583.98, "Time_End": 586.2199999999999, "Text": " are traversed during normal execution."}, {"Time_Start": 586.2199999999999, "Time_End": 588.86, "Text": " So it's important to understand what configurations are set up,"}, {"Time_Start": 588.86, "Time_End": 591.86, "Text": " For example, you can disable route login, you can do reverse mappings."}, {"Time_Start": 592.0, "Time_End": 596.94, "Text": " Those things, if you turn all that off, a system administrator who's looking through the log"}, {"Time_Start": 596.94, "Time_End": 602.14, "Text": " and doesn't see that for a day or two or a week or two might actually get a clue that something's not behaving the appropriate way."}, {"Time_Start": 604.08, "Time_End": 606.02, "Text": " You can do debugging and event logging."}, {"Time_Start": 606.94, "Time_End": 612.7, "Text": " The bill generates a library, well, live SSH session.a, and several helpers."}, {"Time_Start": 612.86, "Time_End": 615.64, "Text": " The SSH agent, the key generation."}, {"Time_Start": 616.34, "Time_End": 618.84, "Text": " One point I'm going to make here is that I'm leaving as an exercise."}, {"Time_Start": 618.86, "Time_End": 623.02, "Text": " to the reader, quote unquote, doing pass phrases."}, {"Time_Start": 623.02, "Time_End": 625.86, "Text": " Okay, I did, I set this up to do pass words."}, {"Time_Start": 625.86, "Time_End": 628.36, "Text": " Most of the implementations, in fact, all of the implementations"}, {"Time_Start": 628.36, "Time_End": 632.36, "Text": " of SSH I've ever seen do pass words, but you can also do past phrases."}, {"Time_Start": 632.36, "Time_End": 634.36, "Text": " That would involve other binaries and more coding."}, {"Time_Start": 634.36, "Time_End": 638.36, "Text": " But, you know, just to simplify it and keep it into a fairly narrow spectrum."}, {"Time_Start": 638.36, "Time_End": 643.36, "Text": " And conditional compilation within the code supports various Unix variance."}, {"Time_Start": 643.36, "Time_End": 644.36, "Text": " There's AIX code."}, {"Time_Start": 644.36, "Time_End": 646.36, "Text": " There's a lot of if-defs in the code."}, {"Time_Start": 646.36, "Time_End": 648.84, "Text": " So when you're actually physically going through the code, you need to"}, {"Time_Start": 648.86, "Time_End": 652.86, "Text": " to know what your platform is, you need to understand, you know, where the branches are"}, {"Time_Start": 652.86, "Time_End": 655.86, "Text": " going to go and how the conditional compilation is going to work."}, {"Time_Start": 655.86, "Time_End": 660.86, "Text": " Okay, real quick animation of the protocol."}, {"Time_Start": 660.86, "Time_End": 667.86, "Text": " The server sends a public key over the wire, and it goes to the client."}, {"Time_Start": 667.86, "Time_End": 671.86, "Text": " The client encrypts a random session key and returns it to the server."}, {"Time_Start": 671.86, "Time_End": 673.86, "Text": " The server decrypts the client's session key."}, {"Time_Start": 673.86, "Time_End": 678.86, "Text": " And then using that, the server sends a client an encrypted challenge, which the client"}, {"Time_Start": 678.86, "Time_End": 681.86, "Text": " can decrypt, and then you have your session established."}, {"Time_Start": 681.86, "Time_End": 686.86, "Text": " So it's a three-way handshake, a la TCPIP, but it's utilizing encryption,"}, {"Time_Start": 686.86, "Time_End": 691.86, "Text": " and it's not sins and acts so much as it is challenging response."}, {"Time_Start": 691.86, "Time_End": 698.86, "Text": " And okay, one more for the password validation, which is going to be a little more"}, {"Time_Start": 698.86, "Time_End": 703.86, "Text": " detailed as far as how the code actually, the logic in the code actually validates the password"}, {"Time_Start": 703.86, "Time_End": 705.86, "Text": " that the user enters."}, {"Time_Start": 705.86, "Time_End": 707.86, "Text": " Oh, I'm sorry."}, {"Time_Start": 708.86, "Time_End": 710.86, "Text": " It sucks to be tall."}, {"Time_Start": 710.86, "Time_End": 718.86, "Text": " Okay, the password database on the system has the encrypted password hash."}, {"Time_Start": 718.86, "Time_End": 721.86, "Text": " Everybody understand, of course you understand encrypted password hash."}, {"Time_Start": 721.86, "Time_End": 724.86, "Text": " That's stored in a structure, it's called SSH user rec."}, {"Time_Start": 724.86, "Time_End": 728.86, "Text": " That's the credential structure that gets built on the server side."}, {"Time_Start": 728.86, "Time_End": 733.86, "Text": " And that has the name of the user, the directory, the home directory, the shell they're doing."}, {"Time_Start": 733.86, "Time_End": 736.86, "Text": " It's the G Coast fields and a couple of other things."}, {"Time_Start": 736.86, "Time_End": 737.86, "Text": " Okay."}, {"Time_Start": 737.86, "Time_End": 738.86, "Text": " What happens?"}, {"Time_Start": 738.86, "Time_End": 744.86, "Text": " What happens in SSHD, SSH being the demon portion of SSH that runs on the target machine,"}, {"Time_Start": 744.86, "Time_End": 751.86, "Text": " there are a couple of pieces of logic that get tested even before the password comparison begins."}, {"Time_Start": 751.86, "Time_End": 757.86, "Text": " The first one being the number of password guesses, which is configurable in the configuration file."}, {"Time_Start": 757.86, "Time_End": 761.86, "Text": " The second one being whether or not route logins are permitted, okay?"}, {"Time_Start": 761.86, "Time_End": 763.86, "Text": " And we'll address that later."}, {"Time_Start": 763.86, "Time_End": 765.86, "Text": " The password comes in across the wire."}, {"Time_Start": 765.86, "Time_End": 767.86, "Text": " It's clear text password."}, {"Time_Start": 767.86, "Time_End": 768.86, "Text": " The password is checked for size."}, {"Time_Start": 768.86, "Time_End": 773.86, "Text": " to see if it's less than or equal to 64, so no buffer overruns here."}, {"Time_Start": 773.86, "Time_End": 775.86, "Text": " There's a couple of checks."}, {"Time_Start": 775.86, "Time_End": 779.86, "Text": " They're actually pretty amusing because they're for RPC and Kerberos passwords,"}, {"Time_Start": 779.86, "Time_End": 781.86, "Text": " and they're both empty blocks."}, {"Time_Start": 781.86, "Time_End": 785.86, "Text": " I think that's actually got code in it in 2.1."}, {"Time_Start": 785.86, "Time_End": 788.86, "Text": " And then the clear text password gets encrypted and a stir comp happens."}, {"Time_Start": 788.86, "Time_End": 793.86, "Text": " So the password hash is compared against the encrypted password that the user entered,"}, {"Time_Start": 793.86, "Time_End": 796.86, "Text": " and if that comes to zero, if you've got a comparison that matches,"}, {"Time_Start": 796.86, "Time_End": 797.86, "Text": " then you authenticate at that point."}, {"Time_Start": 797.86, "Time_End": 799.86, "Text": " at that point."}, {"Time_Start": 799.86, "Time_End": 804.86, "Text": " So that's just the password validation scheme that the SSHD itself uses."}, {"Time_Start": 804.86, "Time_End": 808.86, "Text": " This is a piece of the configuration file."}, {"Time_Start": 808.86, "Time_End": 813.86, "Text": " The config file itself would not fit on a single slide, so I just chop some of it out and"}, {"Time_Start": 813.86, "Time_End": 816.86, "Text": " put it up here so we could talk about a few points."}, {"Time_Start": 816.86, "Time_End": 818.86, "Text": " Port 22 is the default port for SSH."}, {"Time_Start": 818.86, "Time_End": 823.86, "Text": " Of course, if you're setting up your SSH and it doesn't happen to talk on port 22, they might notice."}, {"Time_Start": 823.86, "Time_End": 826.86, "Text": " Forward Agent and Forward X11 are two things."}, {"Time_Start": 826.86, "Time_End": 831.86, "Text": " are two things that allow you to do tunneled X sessions through SSH."}, {"Time_Start": 831.86, "Time_End": 834.86, "Text": " I routinely turn those off."}, {"Time_Start": 834.86, "Time_End": 838.86, "Text": " I could go into a, I could probably do a talk on why that's a good idea to do that."}, {"Time_Start": 838.86, "Time_End": 841.86, "Text": " If you want to talk about that, we can do that offline."}, {"Time_Start": 841.86, "Time_End": 845.86, "Text": " Password guess is set to three, some places set it to a smaller number."}, {"Time_Start": 845.86, "Time_End": 848.86, "Text": " Permit route login."}, {"Time_Start": 848.86, "Time_End": 852.86, "Text": " There's a check in the code that says if your UID is zero"}, {"Time_Start": 852.86, "Time_End": 855.86, "Text": " and permit root login says no, you get kicked out."}, {"Time_Start": 855.86, "Time_End": 857.86, "Text": " We will circumvent that."}, {"Time_Start": 857.86, "Time_End": 860.86, "Text": " Let's see, require reverse mapping."}, {"Time_Start": 860.86, "Time_End": 861.86, "Text": " That's a lot of fun."}, {"Time_Start": 861.86, "Time_End": 863.86, "Text": " That's basically DNS lookups."}, {"Time_Start": 863.86, "Time_End": 866.86, "Text": " If you're on an added network and you have an internal DNS,"}, {"Time_Start": 866.86, "Time_End": 868.86, "Text": " then those DNS lookups will work."}, {"Time_Start": 868.86, "Time_End": 870.86, "Text": " If not, you might find that your SSH doesn't work."}, {"Time_Start": 870.86, "Time_End": 875.86, "Text": " But regardless, you need to know what these config file config settings are"}, {"Time_Start": 875.86, "Time_End": 879.86, "Text": " because again, you want your Trojan to behave identically"}, {"Time_Start": 879.86, "Time_End": 884.86, "Text": " to the target code, the existing correct target code."}, {"Time_Start": 884.86, "Time_End": 889.86, "Text": " Understanding the vagaries of the software,"}, {"Time_Start": 889.86, "Time_End": 891.86, "Text": " the flow of control within the modules,"}, {"Time_Start": 891.86, "Time_End": 893.86, "Text": " the scope of the variables within the source code,"}, {"Time_Start": 893.86, "Time_End": 894.86, "Text": " and that's actually germane."}, {"Time_Start": 894.86, "Time_End": 898.86, "Text": " There's actually a very good separation of scope between the modules in SSH,"}, {"Time_Start": 898.86, "Time_End": 901.86, "Text": " the supported functionality, and the crypt function."}, {"Time_Start": 901.86, "Time_End": 903.86, "Text": " I spent about two hours really late one night,"}, {"Time_Start": 903.86, "Time_End": 906.86, "Text": " trying to figure out why crypt wasn't working."}, {"Time_Start": 906.86, "Time_End": 909.86, "Text": " And with caffeine and all that, you know,"}, {"Time_Start": 909.86, "Time_End": 911.86, "Text": " I just wasn't doing that well."}, {"Time_Start": 911.86, "Time_End": 913.86, "Text": " And all of a sudden I remembered that there's this notation in the man page"}, {"Time_Start": 913.86, "Time_End": 914.86, "Text": " under bugs that says,"}, {"Time_Start": 914.86, "Time_End": 918.86, "Text": " says, oh yeah, crypto returns a static pointer to a static object."}, {"Time_Start": 918.86, "Time_End": 921.86, "Text": " So you call it multiple times you get the same hashback."}, {"Time_Start": 921.86, "Time_End": 926.86, "Text": " That was good once I figured that out, but I really missed those two hours."}, {"Time_Start": 926.86, "Time_End": 930.86, "Text": " Okay, maintaining the core functionality,"}, {"Time_Start": 930.86, "Time_End": 932.86, "Text": " understand how the untainted code responds."}, {"Time_Start": 932.86, "Time_End": 936.86, "Text": " Again, the point here is to have a Trojan that behaves identically"}, {"Time_Start": 936.86, "Time_End": 940.86, "Text": " to the accurate and replaced source code,"}, {"Time_Start": 940.86, "Time_End": 943.86, "Text": " with the one exception being that you can get in using it."}, {"Time_Start": 943.86, "Time_End": 947.86, "Text": " That includes the configuration stuff that we just talked about, logging,"}, {"Time_Start": 947.86, "Time_End": 951.86, "Text": " and choosing a special case, in this case I said, you know, we're choosing the passwords,"}, {"Time_Start": 951.86, "Time_End": 953.86, "Text": " we're not using the past phrases."}, {"Time_Start": 953.86, "Time_End": 957.86, "Text": " If you can pick a special case that's less obvious, like logging in his root."}, {"Time_Start": 957.86, "Time_End": 960.86, "Text": " And don't gut the code and expect that no one is paying attention,"}, {"Time_Start": 960.86, "Time_End": 963.86, "Text": " because again, once you build your binary, you want your binary to be as close"}, {"Time_Start": 963.86, "Time_End": 966.86, "Text": " to the correct size as possible."}, {"Time_Start": 966.86, "Time_End": 972.86, "Text": " One of the things you can do is you can modify logging that will give you away."}, {"Time_Start": 972.86, "Time_End": 976.86, "Text": " your conditional compilation code for TCP wrappers,"}, {"Time_Start": 976.86, "Time_End": 978.86, "Text": " if they're not running wrappers, you don't need that code."}, {"Time_Start": 978.86, "Time_End": 982.86, "Text": " The DNS lookups, I don't think administrators really pay that much attention"}, {"Time_Start": 982.86, "Time_End": 985.86, "Text": " to whether or not DNS lookup failures show up in the logs."}, {"Time_Start": 985.86, "Time_End": 991.86, "Text": " If they have fascist logging enabled and fascist logging is actually an option in the config file"}, {"Time_Start": 991.86, "Time_End": 993.86, "Text": " and what it is is it's verbose logging."}, {"Time_Start": 993.86, "Time_End": 997.86, "Text": " It logs the entire connection of the session and the setup of the connection."}, {"Time_Start": 997.86, "Time_End": 1000.86, "Text": " You want to keep that for obvious reasons."}, {"Time_Start": 1000.86, "Time_End": 1001.86, "Text": " Again, if people are checking the logs."}, {"Time_Start": 1001.86, "Time_End": 1002.86, "Text": " in the logs."}, {"Time_Start": 1002.86, "Time_End": 1005.86, "Text": " Failed login attempts should show up."}, {"Time_Start": 1005.86, "Time_End": 1008.86, "Text": " Administrators might get suspicion if they notice that everybody's having,"}, {"Time_Start": 1008.86, "Time_End": 1010.86, "Text": " everybody's logging in, no problem whatsoever."}, {"Time_Start": 1010.86, "Time_End": 1016.86, "Text": " And if root logins are disallowed, failed attempts to log in as root should show up in the logs."}, {"Time_Start": 1016.86, "Time_End": 1018.86, "Text": " Again, otherwise it arises suspicion."}, {"Time_Start": 1018.86, "Time_End": 1022.86, "Text": " Don't add stupid variable names."}, {"Time_Start": 1022.86, "Time_End": 1028.8600000000001, "Text": " It's amazing how many root kits I've run into where people name things hack and 31337."}, {"Time_Start": 1028.8600000000001, "Time_End": 1030.8600000000001, "Text": " That stuff will show up when people start doing forensics."}, {"Time_Start": 1030.8600000000001, "Time_End": 1034.8600000000001, "Text": " forensics, even just high-level forensics, like running strings on the thing."}, {"Time_Start": 1034.8600000000001, "Time_End": 1035.8600000000001, "Text": " Okay?"}, {"Time_Start": 1035.8600000000001, "Time_End": 1038.8600000000001, "Text": " So don't make bad choices."}, {"Time_Start": 1038.8600000000001, "Time_End": 1040.8600000000001, "Text": " And be careful of how much code you add."}, {"Time_Start": 1040.8600000000001, "Time_End": 1042.8600000000001, "Text": " If you want to do something really clever,"}, {"Time_Start": 1042.8600000000001, "Time_End": 1045.8600000000001, "Text": " like you want to collect a bunch of passwords from all the SSH users"}, {"Time_Start": 1045.8600000000001, "Time_End": 1049.8600000000001, "Text": " and you want to mail them to your hotmail account or whatever,"}, {"Time_Start": 1049.8600000000001, "Time_End": 1052.8600000000001, "Text": " you're going to put a fairly significant chunk of code into this binary to do that,"}, {"Time_Start": 1052.8600000000001, "Time_End": 1053.8600000000001, "Text": " and it's going to bloat the thing."}, {"Time_Start": 1053.8600000000001, "Time_End": 1056.8600000000001, "Text": " You can strip it, you can do all the optimization you want,"}, {"Time_Start": 1056.8600000000001, "Time_End": 1058.8600000000001, "Text": " and you're going to have this big fat thing,"}, {"Time_Start": 1058.8600000000001, "Time_End": 1059.8600000000001, "Text": " and you're going to have to figure out how to shrink it down."}, {"Time_Start": 1059.8600000000001, "Time_End": 1060.8600000000001, "Text": " down."}, {"Time_Start": 1060.8600000000001, "Time_End": 1065.68, "Text": " So, you know, understand that there are boundaries within which you can work and try to stay within"}, {"Time_Start": 1065.68, "Time_End": 1070.14, "Text": " those boundaries, because if you generate a 10-meg binary and the original one was 6-meg, it'll"}, {"Time_Start": 1070.14, "Time_End": 1072.14, "Text": " probably get noticed eventually."}, {"Time_Start": 1072.14, "Time_End": 1074.38, "Text": " And the thing you want is to not be noticed here."}, {"Time_Start": 1074.38, "Time_End": 1079.5200000000002, "Text": " You're trying to do this in as much of a stealth mode as possible."}, {"Time_Start": 1079.5200000000002, "Time_End": 1085.0600000000002, "Text": " Commenting your source, I won't even talk about it, we all know that."}, {"Time_Start": 1085.0600000000002, "Time_End": 1087.14, "Text": " The importance of coding exceptionally well."}, {"Time_Start": 1087.14, "Time_End": 1089.8400000000001, "Text": " If your Trojan binary crashes, they're probably going to cast."}, {"Time_Start": 1089.8600000000001, "Time_End": 1091.8600000000001, "Text": " you."}, {"Time_Start": 1091.8600000000001, "Time_End": 1096.0200000000002, "Text": " So even though it's really tempting to be clever when you're doing the code, it's probably a good"}, {"Time_Start": 1096.0200000000002, "Time_End": 1101.38, "Text": " idea not to do that and just code straight and make sure that your functionality is real clean."}, {"Time_Start": 1101.38, "Time_End": 1105.2600000000002, "Text": " And also people that you pass the code onto are going to review your efforts and they're going to"}, {"Time_Start": 1105.2600000000002, "Time_End": 1108.48, "Text": " judge you on those efforts."}, {"Time_Start": 1108.48, "Time_End": 1115.44, "Text": " And picking a password that is not hack or 31337 that doesn't show up as a recognizable,"}, {"Time_Start": 1115.44, "Time_End": 1119.8400000000001, "Text": " you know, Root George is a bad password in any."}, {"Time_Start": 1119.8600000000001, "Time_End": 1123.46, "Text": " case, it's especially bad in this case, because if they strings the binary and they see George,"}, {"Time_Start": 1123.46, "Time_End": 1125.96, "Text": " they're going to notice."}, {"Time_Start": 1125.96, "Time_End": 1129.46, "Text": " And don't use your regular password, okay, because if you distribute your source and you put your"}, {"Time_Start": 1129.46, "Time_End": 1132.8200000000002, "Text": " regular password into source, people are going to pay attention to that, and they're probably"}, {"Time_Start": 1132.8200000000002, "Time_End": 1137.3400000000001, "Text": " going to go and try it on your IP, all right?"}, {"Time_Start": 1137.3400000000001, "Time_End": 1139.48, "Text": " This is my little diagram for the scoping issue."}, {"Time_Start": 1139.48, "Time_End": 1144.5400000000002, "Text": " There actually is really, tattoo's not here, and I'm really grateful."}, {"Time_Start": 1144.5400000000002, "Time_End": 1149.3000000000002, "Text": " The scoping between the library portion of the code and the demon portion of the code is"}, {"Time_Start": 1149.3, "Time_End": 1158.2, "Text": " exceptionally clear-cut. You cannot see the password in the SSHD code, the way it's written."}, {"Time_Start": 1158.44, "Time_End": 1164.96, "Text": " You can only have it within scope in the library. So you've got these two different components"}, {"Time_Start": 1164.96, "Time_End": 1173.72, "Text": " of this code and a complete and total schism between where the encrypted password hash is and where"}, {"Time_Start": 1173.72, "Time_End": 1178.8, "Text": " you want to access it, namely in SSHD. So what do you do?"}, {"Time_Start": 1179.3, "Time_End": 1184.3, "Text": " add a new subroutine to the library, namely, give me the password out of the user cred."}, {"Time_Start": 1184.3, "Time_End": 1192.08, "Text": " Okay? So you therefore defeat the scoping issue. Another logic diagram, a la the earlier one."}, {"Time_Start": 1193.1599999999999, "Time_End": 1198.32, "Text": " Are you going to change the password yes or no? Is the length of the password greater than 64? Yes or"}, {"Time_Start": 1198.32, "Time_End": 1204.6, "Text": " no? Is the password valid? Yes or no? Is the user ID greater than zero? Yes or no? And are"}, {"Time_Start": 1204.6, "Time_End": 1209.2, "Text": " root logins allowed? Yes or no. That's the linear progression of the logic within the"}, {"Time_Start": 1209.3, "Time_End": 1214.6599999999999, "Text": " authentication module itself. Okay, so this is just a block diagram of the logic within the pertinent"}, {"Time_Start": 1214.6599999999999, "Time_End": 1220.24, "Text": " module where the validation actually happens. All that coughing's making me thirsty."}, {"Time_Start": 1221.68, "Time_End": 1231.12, "Text": " So given that that's the logic that things are checked in, if it's necessary for you to reorganize"}, {"Time_Start": 1231.12, "Time_End": 1234.8799999999999, "Text": " the logic, you want to retain that functionality, but you might find that what it is you want to"}, {"Time_Start": 1234.8799999999999, "Time_End": 1239.28, "Text": " accomplish requires you to redesign the logic in some way. Reorder things."}, {"Time_Start": 1239.3, "Time_End": 1244.8999999999999, "Text": " don't break the functionality, but maybe do checks in different orders, or maybe put some"}, {"Time_Start": 1244.8999999999999, "Time_End": 1250.1, "Text": " go-toes or branches in there so that what you can do is, if you don't want to check if root logins"}, {"Time_Start": 1250.1, "Time_End": 1253.74, "Text": " are allowed, and I suppose you don't if you're trying to get in his route, you can probably branch"}, {"Time_Start": 1253.74, "Time_End": 1258.6399999999999, "Text": " around that code. Except you might want to keep the log there, because there will be logging in there"}, {"Time_Start": 1258.6399999999999, "Time_End": 1262.72, "Text": " if that check fails. It'll spit out a log entry that says somebody tried to get in his route"}, {"Time_Start": 1262.72, "Time_End": 1267.4199999999998, "Text": " with a valid password, and that's not allowed. If you make the decision that you don't think"}, {"Time_Start": 1267.4199999999998, "Time_End": 1269.28, "Text": " that's important enough for it to stay in the logs."}, {"Time_Start": 1269.3, "Time_End": 1272.1, "Text": " You need to gut your code just a little bit more to get it down to where it needs to be."}, {"Time_Start": 1272.34, "Time_End": 1272.82, "Text": " Throw it out."}, {"Time_Start": 1273.4199999999998, "Time_End": 1273.6599999999999, "Text": " Okay?"}, {"Time_Start": 1273.82, "Time_End": 1278.8799999999999, "Text": " But these are the kind of decisions that you're making while you're going through the process of changing this code."}, {"Time_Start": 1281.8799999999999, "Time_End": 1285.26, "Text": " Configurable features will restrict the individual access attempts."}, {"Time_Start": 1285.3799999999999, "Time_End": 1286.6599999999999, "Text": " The permit route login is one."}, {"Time_Start": 1286.96, "Time_End": 1288.08, "Text": " The DNS lookups is another."}, {"Time_Start": 1289.0, "Time_End": 1291.28, "Text": " This is my little DNS cloud drawing."}, {"Time_Start": 1292.02, "Time_End": 1299.28, "Text": " For those of you who, you know, if you do a lookup on an IP, you get the host name back unless it's not resolvable, in which case you get the IP back."}, {"Time_Start": 1299.3, "Time_End": 1303.74, "Text": " and the code does check if IP equals host name and reverse lookups are set, deny."}, {"Time_Start": 1304.52, "Time_End": 1308.18, "Text": " So you've got to circumvent that within the code."}, {"Time_Start": 1308.62, "Time_End": 1313.6399999999999, "Text": " If you want to not be denied on a reverse lookup, you've got to comment that out."}, {"Time_Start": 1313.68, "Time_End": 1315.12, "Text": " In this case, I did something really simple."}, {"Time_Start": 1315.22, "Time_End": 1320.8999999999999, "Text": " It returns true if the lookup fails, so I just always have it return false, regardless of whether or not the lookup works."}, {"Time_Start": 1321.48, "Time_End": 1325.6599999999999, "Text": " You won't see any of those messages in the logs anymore that say DNS lookup failed."}, {"Time_Start": 1326.36, "Time_End": 1329.26, "Text": " My take on that was most sysadmins won't notice those missing."}, {"Time_Start": 1329.3, "Time_End": 1335.3799999999999, "Text": " And again, the logging is associated with altered functionality."}, {"Time_Start": 1335.54, "Time_End": 1342.78, "Text": " This is the same principle, essentially, of just saying, you know, there's your log entry that you're going to see if your log fails, okay?"}, {"Time_Start": 1346.34, "Time_End": 1348.62, "Text": " The other way of doing it is just to remove the log statement."}, {"Time_Start": 1348.9199999999998, "Time_End": 1353.1599999999999, "Text": " If you don't care whether or not the lookup fails and it doesn't impact what you're trying to do,"}, {"Time_Start": 1353.1599999999999, "Time_End": 1359.28, "Text": " you can just strip out the logging statement, actually stripping out the print-ifs, gets you about a K."}, {"Time_Start": 1359.3, "Time_End": 1364.72, "Text": " off your binary for every statement that you lose because that printf compiles in a bunch of code."}, {"Time_Start": 1365.32, "Time_End": 1367.36, "Text": " You know, it goes back to the library every time."}, {"Time_Start": 1369.86, "Time_End": 1372.7, "Text": " Elective surgery to adjust the resulting binary size."}, {"Time_Start": 1373.1599999999999, "Time_End": 1379.3, "Text": " Again, the binary on the original target will have a size and your route, so you have no excuse for going"}, {"Time_Start": 1379.3, "Time_End": 1382.62, "Text": " and doing an LS on that directory and seeing what the size of that binary is."}, {"Time_Start": 1382.6399999999999, "Time_End": 1386.82, "Text": " You have no excuse for not going into Etsy SSH2 and grabbing that config file."}, {"Time_Start": 1387.1, "Time_End": 1389.28, "Text": " You need to understand your target before you."}, {"Time_Start": 1389.3, "Time_End": 1392.52, "Text": " you do any of this coding, you want to understand what it is you're trying to replace"}, {"Time_Start": 1392.52, "Time_End": 1398.6399999999999, "Text": " so that what you replace it with is so close to or identical to the original that no one's"}, {"Time_Start": 1398.6399999999999, "Time_End": 1399.28, "Text": " going to notice."}, {"Time_Start": 1402.84, "Time_End": 1405.1399999999999, "Text": " Removing sufficient code to connect the binary size."}, {"Time_Start": 1405.24, "Time_End": 1409.8, "Text": " In this case, I, let's see, I threw away the wrappers code, basically."}, {"Time_Start": 1409.94, "Time_End": 1412.6399999999999, "Text": " There wasn't wrappers running on the target system, so I didn't need the wrappers code."}, {"Time_Start": 1412.72, "Time_End": 1415.26, "Text": " There's code in SSHD that integrates with TCP wrappers."}, {"Time_Start": 1415.5, "Time_End": 1416.36, "Text": " They're not running wrappers."}, {"Time_Start": 1416.54, "Time_End": 1417.3999999999999, "Text": " They don't need that code."}, {"Time_Start": 1417.3999999999999, "Time_End": 1418.4199999999998, "Text": " I threw that away."}, {"Time_Start": 1418.42, "Time_End": 1420.1000000000001, "Text": " I carve 20K off the binary."}, {"Time_Start": 1422.24, "Time_End": 1424.38, "Text": " And beware of functional limitations and bugs."}, {"Time_Start": 1424.46, "Time_End": 1426.8400000000001, "Text": " For those of you have never seen it, this is Solaris 2.6."}, {"Time_Start": 1427.3400000000001, "Time_End": 1434.22, "Text": " This is the crypt function, and I was actually hoping that this would give a better illustration of the fact that it returns that static pointer every time."}, {"Time_Start": 1435.78, "Time_End": 1440.78, "Text": " In hindsight, I don't really think it gives you any better, except that for the fact, there's those consts in comments."}, {"Time_Start": 1441.48, "Time_End": 1446.76, "Text": " But it is in the man page, and like I said, at about 4 in the morning, I sort of remembered that from somewhere deep in my memory,"}, {"Time_Start": 1446.76, "Time_End": 1448.4, "Text": " and I went and pulled it off the shelf and went."}, {"Time_Start": 1448.42, "Time_End": 1454.22, "Text": " So there will be functional limitations in the code, and you will run into them,"}, {"Time_Start": 1454.26, "Time_End": 1456.0600000000002, "Text": " and you will want to figure out some way to circumvent those."}, {"Time_Start": 1457.92, "Time_End": 1464.96, "Text": " And probably the most important slide in this entire presentation is, you know, test what you're doing."}, {"Time_Start": 1465.8600000000001, "Time_End": 1472.8200000000002, "Text": " Once you put it there, it's there, and if you screwed up, you know, I hope your door insurance is paid up."}, {"Time_Start": 1472.8600000000001, "Time_End": 1473.54, "Text": " That's all I've got to say."}, {"Time_Start": 1474.5600000000002, "Time_End": 1476.02, "Text": " Testing is cheaper than door insurance."}, {"Time_Start": 1478.42, "Time_End": 1485.54, "Text": " Okay, building the binary, you want to try to use the compile and link options that are as close to or identical to the target."}, {"Time_Start": 1485.8400000000001, "Time_End": 1490.6200000000001, "Text": " Again, for the obvious reason that you want the result to come out as close to or identical to the target that you're going to replace."}, {"Time_Start": 1491.02, "Time_End": 1496.46, "Text": " If they happen to have been nice and left you the source tree on the system that you're going to put the Trojan on,"}, {"Time_Start": 1496.78, "Time_End": 1499.1000000000001, "Text": " I suggest you go and pull the make file and use it."}, {"Time_Start": 1501.0600000000002, "Time_End": 1504.3200000000002, "Text": " If you have access to the target, which you assumably do since you rooted it."}, {"Time_Start": 1504.5800000000002, "Time_End": 1507.94, "Text": " If you don't have access to the target, for whatever reason, you let your connection time out,"}, {"Time_Start": 1508.42, "Time_End": 1513.3400000000001, "Text": " use the defaults, go for full optimization, play around with it, experiment a little."}, {"Time_Start": 1513.52, "Time_End": 1515.8400000000001, "Text": " You'll come up with something that's closer or not close enough."}, {"Time_Start": 1516.04, "Time_End": 1519.6200000000001, "Text": " If you use full optimization, the worst thing that will happen is they'll get an increase in performance."}, {"Time_Start": 1519.72, "Time_End": 1521.2, "Text": " I don't think they'll complain about that."}, {"Time_Start": 1522.64, "Time_End": 1525.3000000000002, "Text": " And use an identical machine in OS, obviously."}, {"Time_Start": 1527.9, "Time_End": 1532.3600000000001, "Text": " You'd be surprised how many people build a binary on Linux and try to install it on Solaris and wonder why it doesn't work."}, {"Time_Start": 1532.46, "Time_End": 1535.94, "Text": " Okay? I'm sorry, I'm not trying to pander to the audience, but, you know, it's happened."}, {"Time_Start": 1538.42, "Time_End": 1541.42, "Text": " and size the binary collect correctly."}, {"Time_Start": 1541.42, "Time_End": 1545.42, "Text": " You gotta go to this Las Vegas Hilton, man, this Star Trek place was good."}, {"Time_Start": 1548.42, "Time_End": 1549.42, "Text": " Run a checksum."}, {"Time_Start": 1549.42, "Time_End": 1552.42, "Text": " If you think they're running, by now, if you've gotten into the system"}, {"Time_Start": 1552.42, "Time_End": 1554.42, "Text": " and you haven't figured out that they're running a check sum program,"}, {"Time_Start": 1554.42, "Time_End": 1556.42, "Text": " you shouldn't be doing this at all, okay?"}, {"Time_Start": 1556.42, "Time_End": 1558.42, "Text": " So enough said there."}, {"Time_Start": 1558.42, "Time_End": 1562.42, "Text": " Do it all in your lab, you know, check some the binary."}, {"Time_Start": 1562.42, "Time_End": 1565.42, "Text": " If you have to figure out, and we'll talk about it in the next slide,"}, {"Time_Start": 1565.42, "Time_End": 1567.42, "Text": " how to modify the binary so the check sum works,"}, {"Time_Start": 1567.42, "Time_End": 1568.42, "Text": " how to size the binary,"}, {"Time_Start": 1568.42, "Time_End": 1571.02, "Text": " so that it's the appropriate size."}, {"Time_Start": 1571.02, "Time_End": 1572.68, "Text": " Do all this in your lab."}, {"Time_Start": 1572.68, "Time_End": 1577.5, "Text": " I know you are going to root this E-4500,"}, {"Time_Start": 1577.5, "Time_End": 1580.74, "Text": " and all you have at home is an Ultra5, okay?"}, {"Time_Start": 1580.74, "Time_End": 1585.5, "Text": " If it's running 64-bit Solaris 2.7, it's running 64-bit Solaris 2.7."}, {"Time_Start": 1585.5, "Time_End": 1588.1000000000001, "Text": " No, it's not running the SMP code, but don't worry about that."}, {"Time_Start": 1588.1000000000001, "Time_End": 1591.0, "Text": " Just do all this other stuff, and you'll be okay."}, {"Time_Start": 1591.0, "Time_End": 1592.72, "Text": " You know, and don't do it on your FreeBSD box."}, {"Time_Start": 1592.72, "Time_End": 1595.48, "Text": " It compiles a hell of a lot faster, but it's not gonna work."}, {"Time_Start": 1597.3600000000001, "Time_End": 1598.4, "Text": " And write a ReadMe file."}, {"Time_Start": 1598.42, "Time_End": 1604.5800000000002, "Text": " because if you're going to put it out in the community, it's nice to just give it to people"}, {"Time_Start": 1604.5800000000002, "Time_End": 1609.38, "Text": " and let them know what it is you did and give them an idea of where you stopped and what they"}, {"Time_Start": 1609.38, "Time_End": 1614.18, "Text": " can do with it. For example, I did the passwords. If somebody in here is going to do one and it's"}, {"Time_Start": 1614.18, "Time_End": 1619.6200000000001, "Text": " going to be the past phrases, okay, it's in the read me file. So you know, okay, I haven't done the"}, {"Time_Start": 1619.6200000000001, "Time_End": 1626.9, "Text": " past phrases, but it's on the to-do list. And be paranoid because there's a high,"}, {"Time_Start": 1626.9, "Time_End": 1631.24, "Text": " a sumable risk in what I'm talking about here. Essentially what I'm talking about is doing something"}, {"Time_Start": 1631.24, "Time_End": 1637.52, "Text": " that in the United States at least is illegal. So you want to, you know, take it seriously. You've"}, {"Time_Start": 1637.52, "Time_End": 1641.3400000000001, "Text": " already compromised your position, you've already rooted a box, but you want to take this seriously,"}, {"Time_Start": 1641.64, "Time_End": 1645.5400000000002, "Text": " okay? Those of you who have had your doors kick down at 5 in the morning know what I'm talking about."}, {"Time_Start": 1645.6000000000001, "Time_End": 1651.0600000000002, "Text": " The rest of you, take my word on it. And the 12 important things to remember before you begin."}, {"Time_Start": 1651.0600000000002, "Time_End": 1656.4, "Text": " Number one, fix the size and the check sum. Number two, fix the time differences."}, {"Time_Start": 1656.9, "Time_End": 1660.4, "Text": " This is sort of a checklist for when you're actually going in and doing the install."}, {"Time_Start": 1660.5800000000002, "Time_End": 1663.3000000000002, "Text": " What are the things you want to do when you're installing the thing on the system?"}, {"Time_Start": 1663.44, "Time_End": 1668.0800000000002, "Text": " Number three is check for trip wire. You should already know if trip wire and other tools are running, okay?"}, {"Time_Start": 1668.24, "Time_End": 1672.96, "Text": " And if they are, you shouldn't be at this point, right? You should have gone away a long time ago."}, {"Time_Start": 1674.22, "Time_End": 1682.72, "Text": " Check for immutable binaries on BSD systems. It's a lot of fun when you go to try to install this on a BSD system, and it won't install, and you can't move it, you can't copy it, and you can't RM it."}, {"Time_Start": 1682.76, "Time_End": 1686.88, "Text": " And then you remember, oh yeah, there's that extra high order part over there in the file app."}, {"Time_Start": 1686.9, "Time_End": 1693.0600000000002, "Text": " I wonder if it's immutable. Check for cron jobs that run massive diffs across the file system,"}, {"Time_Start": 1693.18, "Time_End": 1701.22, "Text": " what I call trip wire wannabes. That's going to catch you if you're not exactly dead on for size and check some."}, {"Time_Start": 1701.22, "Time_End": 1716.48, "Text": " So again, check for remote monitoring that tracks disk space and CPU utilization. There's nothing more discouraging than to be sitting there trying to do the install on this thing while somebody's big brother's screen has gone red on the left hand side because of all the disk utilization and CPU utilization."}, {"Time_Start": 1716.9, "Time_End": 1717.8200000000002, "Text": " nobody's on that machine."}, {"Time_Start": 1717.92, "Time_End": 1718.5400000000002, "Text": " Why is that happening?"}, {"Time_Start": 1720.0400000000002, "Time_End": 1723.24, "Text": " Check for serial logging to the extent that you can."}, {"Time_Start": 1723.3600000000001, "Time_End": 1729.26, "Text": " Go into syslog.comf and look and see if they're actually dumping stuff to a PC over a, you know, a null modem cable."}, {"Time_Start": 1729.8000000000002, "Time_End": 1733.68, "Text": " If they are, you're probably outed already, but you might as well know why."}, {"Time_Start": 1735.94, "Time_End": 1738.8000000000002, "Text": " Check for other hacksore tools like keystroke monitors."}, {"Time_Start": 1739.18, "Time_End": 1745.46, "Text": " Why are you doing this work on a machine that somebody else has already rooted and giving them, you know, all this free information?"}, {"Time_Start": 1745.46, "Time_End": 1746.88, "Text": " You know, let them go download the tarbord."}, {"Time_Start": 1746.9, "Time_End": 1751.7, "Text": " ball and figure it out. Don't hop the demon before you're still, when you're still"}, {"Time_Start": 1751.7, "Time_End": 1757.2, "Text": " connected using SSH. Okay, good. I don't have to explain that one."}, {"Time_Start": 1758.2, "Time_End": 1763.0, "Text": " Remove the source tree if you do to build on the target machine. And finally, no, not finally,"}, {"Time_Start": 1763.1200000000001, "Time_End": 1767.3400000000001, "Text": " clean up all the logs, including Sioux Log and all those logs, and avoid the temptation to"}, {"Time_Start": 1767.3400000000001, "Time_End": 1772.94, "Text": " log onto IRC and brag about your latest hack. So this is my list of the 12 important things"}, {"Time_Start": 1772.94, "Time_End": 1776.88, "Text": " to remember before you begin. Once you do the install, try."}, {"Time_Start": 1776.9, "Time_End": 1782.76, "Text": " Before you do the install on the target, try it on your own system, you know, circumvent network obstacles if you need to,"}, {"Time_Start": 1782.8600000000001, "Time_End": 1787.18, "Text": " if you're punching through a checkpoint firewall because you went to Black Hat, you saw that great talk that those guys gave,"}, {"Time_Start": 1787.26, "Time_End": 1788.5800000000002, "Text": " and you just want to try all that stuff."}, {"Time_Start": 1790.26, "Time_End": 1792.94, "Text": " Figure out how long it's going to take, okay?"}, {"Time_Start": 1793.8600000000001, "Time_End": 1801.02, "Text": " There's actually, you know, there's this thing called time, and you actually use it up when you're getting into a system,"}, {"Time_Start": 1802.02, "Time_End": 1806.88, "Text": " copying stuff, touching files, chomotting, choning things. It takes a while."}, {"Time_Start": 1806.9, "Time_End": 1808.16, "Text": " I mean, I don't care how fast you type."}, {"Time_Start": 1808.42, "Time_End": 1809.7800000000002, "Text": " Figure out how long it's going to take."}, {"Time_Start": 1809.8400000000001, "Time_End": 1812.1200000000001, "Text": " If you're going to be spending one or two hours on their system,"}, {"Time_Start": 1813.02, "Time_End": 1816.5, "Text": " plan for that, and make sure you don't do it, you know, at three in the afternoon."}, {"Time_Start": 1816.68, "Time_End": 1819.5800000000002, "Text": " Well, maybe you want to do it at three in the afternoon because that's where everybody's using it."}, {"Time_Start": 1819.6200000000001, "Time_End": 1820.98, "Text": " You're going to be slow, but you don't care."}, {"Time_Start": 1821.0400000000002, "Time_End": 1821.64, "Text": " They won't notice."}, {"Time_Start": 1821.88, "Time_End": 1825.4, "Text": " If you do it at three in the morning and the utilization has a little spike in it on their MRTGs,"}, {"Time_Start": 1825.48, "Time_End": 1826.4, "Text": " that might not be good either."}, {"Time_Start": 1827.3000000000002, "Time_End": 1830.0400000000002, "Text": " And the goal is to anticipate as many points of failure as possible."}, {"Time_Start": 1830.5400000000002, "Time_End": 1833.0, "Text": " Okay, this is, like I said, originally when I did this, I thought,"}, {"Time_Start": 1833.0600000000002, "Time_End": 1835.8600000000001, "Text": " oh, I'm just going to put some logic in here, build the thing, and I'm going to throw it up there."}, {"Time_Start": 1835.8600000000001, "Time_End": 1837.16, "Text": " but it winds up being non-trivial."}, {"Time_Start": 1839.2, "Time_End": 1842.44, "Text": " Gaining route access, this is the third step, how to actually get in,"}, {"Time_Start": 1842.5000000000002, "Time_End": 1845.2800000000002, "Text": " and my slide says, check bug track, because it's more current than this slide."}, {"Time_Start": 1850.22, "Time_End": 1854.68, "Text": " Remote exploits, I just made a list of some crap that, you know, was actually on bug track"}, {"Time_Start": 1854.68, "Time_End": 1856.3600000000001, "Text": " at the time that I wrote this, which is back in April."}, {"Time_Start": 1856.46, "Time_End": 1860.7800000000002, "Text": " So a lot of this stuff is probably already patched, but I just said, okay, I'll just give them"}, {"Time_Start": 1860.7800000000002, "Time_End": 1864.3400000000001, "Text": " an example of some stuff, different OSs and different things that are current right now."}, {"Time_Start": 1864.3400000000001, "Time_End": 1866.88, "Text": " for those of you who are sitting there going,"}, {"Time_Start": 1866.96, "Time_End": 1868.2, "Text": " well, I don't have any remote exploits."}, {"Time_Start": 1868.2800000000002, "Time_End": 1869.2800000000002, "Text": " Well, there's some on bug track."}, {"Time_Start": 1870.7800000000002, "Time_End": 1873.2800000000002, "Text": " And gaining root access on a system that you've already compromised."}, {"Time_Start": 1873.44, "Time_End": 1875.18, "Text": " Well, you already know how to do that, don't you?"}, {"Time_Start": 1877.0200000000002, "Time_End": 1879.16, "Text": " But again, I put a few examples up here just for show."}, {"Time_Start": 1881.9, "Time_End": 1886.7600000000002, "Text": " And circumventing network obstacles, scanning for ports, scanning past the firewall, all of that."}, {"Time_Start": 1887.0600000000002, "Time_End": 1888.2200000000003, "Text": " Who here was it Black Hat?"}, {"Time_Start": 1888.3200000000002, "Time_End": 1890.1000000000001, "Text": " Can I get a show of hands for the people that were in Black Hat?"}, {"Time_Start": 1890.2, "Time_End": 1890.44, "Text": " Yeah."}, {"Time_Start": 1890.8000000000002, "Time_End": 1892.7800000000002, "Text": " Did you guys catch that talk, Doug Sung's talk?"}, {"Time_Start": 1892.78, "Time_End": 1896.84, "Text": " I love to see a commercial product obliterated in front of an audience."}, {"Time_Start": 1896.94, "Time_End": 1897.54, "Text": " It's so much fun."}, {"Time_Start": 1899.28, "Time_End": 1902.32, "Text": " Poke through the ports, you know, passive FTP tunneling."}, {"Time_Start": 1902.42, "Time_End": 1903.72, "Text": " There were examples of that and that talk."}, {"Time_Start": 1905.22, "Time_End": 1906.68, "Text": " And figure out how long it will take."}, {"Time_Start": 1906.76, "Time_End": 1908.18, "Text": " Again, do a dry run of the thing."}, {"Time_Start": 1908.46, "Time_End": 1910.56, "Text": " Essentially what you want to do is you want to practice this."}, {"Time_Start": 1910.6, "Time_End": 1913.74, "Text": " It's like doing a talk, you know, although some of you out there may be objecting at this point."}, {"Time_Start": 1914.74, "Time_End": 1916.1399999999999, "Text": " You need to rehearse the talk."}, {"Time_Start": 1916.2, "Time_End": 1917.26, "Text": " You need to rehearse the talk. You need to rehearse the hack."}, {"Time_Start": 1917.42, "Time_End": 1918.6399999999999, "Text": " Because you want to get it smooth."}, {"Time_Start": 1918.74, "Time_End": 1921.5, "Text": " You want to get it to where you can say, okay, I can do this thing"}, {"Time_Start": 1921.5, "Time_End": 1923.5, "Text": " without a lot of..."}, {"Time_Start": 1923.5, "Time_End": 1925.38, "Text": " I don't want to wind up halfway in the middle of"}, {"Time_Start": 1925.38, "Time_End": 1927.5, "Text": " trojaning somebody's SSH and find a gotcha."}, {"Time_Start": 1928.0, "Time_End": 1929.36, "Text": " That would be a bad place to be."}, {"Time_Start": 1932.62, "Time_End": 1934.66, "Text": " And the last part, which I call Cher,"}, {"Time_Start": 1934.9, "Time_End": 1936.12, "Text": " which is planning for the future."}, {"Time_Start": 1936.82, "Time_End": 1939.78, "Text": " Post your package discreetly so that others can expand on your work."}, {"Time_Start": 1941.94, "Time_End": 1945.12, "Text": " Maybe a full-blown root kit is what you want to do to this system ultimately."}, {"Time_Start": 1945.84, "Time_End": 1948.0, "Text": " This is for the target machine that we're talking about,"}, {"Time_Start": 1948.06, "Time_End": 1949.42, "Text": " once you've actually accomplished this."}, {"Time_Start": 1949.86, "Time_End": 1950.98, "Text": " Maybe you want to root kit them."}, {"Time_Start": 1950.98, "Time_End": 1952.66, "Text": " Maybe you're going to put sniffers on there."}, {"Time_Start": 1952.94, "Time_End": 1954.4, "Text": " Maybe you're going to put other Trojans on there."}, {"Time_Start": 1954.46, "Time_End": 1955.72, "Text": " Maybe you want to put a nice..."}, {"Time_Start": 1955.72, "Time_End": 1960.14, "Text": " I've got a great little FTPD that's got an extra command added to the lexical analyzer."}, {"Time_Start": 1960.26, "Time_End": 1961.9, "Text": " It's called Shell, S-H-E-L."}, {"Time_Start": 1964.82, "Time_End": 1968.96, "Text": " So, yeah, once you're done, you know, pat yourself on the back, but don't stop there."}, {"Time_Start": 1969.06, "Time_End": 1973.44, "Text": " Think what else you can do with this and or with other things to expand your access."}, {"Time_Start": 1975.02, "Time_End": 1979.8600000000001, "Text": " And just to be fair about it, I threw in the slide to talk about protecting yourself against Trojan binaries."}, {"Time_Start": 1980.16, "Time_End": 1980.96, "Text": " Again, trip wire."}, {"Time_Start": 1980.98, "Time_End": 1984.44, "Text": " will ruin your whole day. I think it's an excellent tool. It costs nothing. It installs very"}, {"Time_Start": 1984.44, "Time_End": 1990.6, "Text": " cleanly and it does the job. The immutable bit on BSD systems. If you're running a BSD system,"}, {"Time_Start": 1990.9, "Time_End": 1996.72, "Text": " you have that high order eight bits in the file descriptor, and it has the immutable bit."}, {"Time_Start": 1996.94, "Time_End": 2000.98, "Text": " And you can set that so that your binaries cannot be changed except if you're the root user."}, {"Time_Start": 2001.1200000000001, "Time_End": 2004.9, "Text": " Now, of course, if they've got root on your box, they're probably going to see that and they're going to change it,"}, {"Time_Start": 2004.94, "Time_End": 2009.44, "Text": " but it will slow them down a little. Okay? The other thing is you can set your whole file system"}, {"Time_Start": 2009.44, "Time_End": 2010.2, "Text": " to be read only."}, {"Time_Start": 2010.98, "Time_End": 2017.22, "Text": " If you put your binaries on slash users slash local slash bin slash whatever, people aren't writing to that."}, {"Time_Start": 2017.28, "Time_End": 2019.72, "Text": " The only person who's writing to that is assisting in when he's doing installed."}, {"Time_Start": 2019.8, "Time_End": 2021.58, "Text": " Make the thing read only. It doesn't slow it down."}, {"Time_Start": 2022.16, "Time_End": 2026.78, "Text": " And again, somebody will get in there and they'll try to write over the thing and it won't happen and it'll stop them in their tracks."}, {"Time_Start": 2028.04, "Time_End": 2035.28, "Text": " Proactive auditing, diffing your file systems. If you can't run tripwire, run a find across your whole friggin' file system."}, {"Time_Start": 2035.28, "Time_End": 2040.96, "Text": " Okay? It takes about 10 minutes on a scuzzy disk, you know, on a decent size machine. And you'll get to"}, {"Time_Start": 2040.98, "Time_End": 2043.64, "Text": " diffs and you put them in your mailbox and you'll see them in the morning."}, {"Time_Start": 2043.72, "Time_End": 2047.9, "Text": " If you happen to see that root in the password file shows up on that file system diff,"}, {"Time_Start": 2048.22, "Time_End": 2052.38, "Text": " then it might start to bring some bells for you and you might decide to do a little poking around."}, {"Time_Start": 2054.72, "Time_End": 2055.96, "Text": " Real hackers are lazy."}, {"Time_Start": 2057.52, "Time_End": 2063.22, "Text": " Okay, enough said. Know what you intend to accomplish. Consider the source, change as little as possible."}, {"Time_Start": 2063.46, "Time_End": 2067.62, "Text": " Please, please, please, please, test your stuff. It's so frustrating. I had one break on me."}, {"Time_Start": 2067.64, "Time_End": 2068.18, "Text": " It really sucked."}, {"Time_Start": 2068.18, "Time_End": 2072.02, "Text": " emulate the original as closely as possible."}, {"Time_Start": 2072.3199999999997, "Time_End": 2076.16, "Text": " Do your homework. Don't get caught unprepared. Do a dry run. Make sure you know what you're getting into."}, {"Time_Start": 2076.7599999999998, "Time_End": 2079.1, "Text": " And share the information so that the rest of us can learn."}, {"Time_Start": 2081.16, "Time_End": 2085.2799999999997, "Text": " And where to go to learn more? I'm going to post the package up on an FTP site."}, {"Time_Start": 2086.48, "Time_End": 2091.66, "Text": " Probably not today. Actually, probably not this week at this point. It'll probably be next week sometime."}, {"Time_Start": 2092.16, "Time_End": 2097.94, "Text": " I will post these slides up on the web page. I have not done that, but again, I will do that when I get back."}, {"Time_Start": 2098.18, "Time_End": 2103.18, "Text": " And if you want to contact me, it's Wrangler.netpublishing.com is an email that I will answer."}, {"Time_Start": 2108.3999999999996, "Time_End": 2110.8999999999996, "Text": " Where are we for time? Who's got to watch?"}, {"Time_Start": 2112.48, "Time_End": 2115.96, "Text": " Okay. Not bad. It took me 50 minutes when I did it in the room."}, {"Time_Start": 2119.2999999999997, "Time_End": 2126.02, "Text": " Eric Bloodak's here yet? Okay. When Chris gets here, anybody know what Chris looks like?"}, {"Time_Start": 2126.62, "Time_End": 2128.16, "Text": " When Chris gets here, you know?"}, {"Time_Start": 2128.18, "Time_End": 2130.5, "Text": " Actually, I want to talk to Chris because I want to go drinking later."}, {"Time_Start": 2131.46, "Time_End": 2133.0, "Text": " But I'll take some questions in the meantime."}, {"Time_Start": 2134.74, "Time_End": 2134.8799999999997, "Text": " Yeah."}, {"Time_Start": 2135.08, "Time_End": 2137.54, "Text": " Do you go back to the brain that was the checklist you do?"}, {"Time_Start": 2138.2599999999998, "Time_End": 2139.12, "Text": " Yeah. Okay."}, {"Time_Start": 2145.96, "Time_End": 2146.66, "Text": " There you go."}, {"Time_Start": 2149.7799999999997, "Time_End": 2151.46, "Text": " Gaghan's here yet?"}, {"Time_Start": 2152.14, "Time_End": 2152.64, "Text": " Okay. Okay, sweet."}, {"Time_Start": 2153.48, "Time_End": 2156.24, "Text": " If you want to talk to me, I'll be offline."}, {"Time_Start": 2158.18, "Time_End": 2159.46, "Text": " Over in the corner, all right?"}, {"Time_Start": 2161.2999999999997, "Time_End": 2162.22, "Text": " Thank you very much."}]}