{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 17.76,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Responsible for the security there, everything from monitoring intrusions to recovering from,"
    },
    {
      "Time_Start": 17.76,
      "Time_End": 21.16,
      "Text": " you know, if anyone manages to root a box, which since I've been there, they haven't,"
    },
    {
      "Time_Start": 21.16,
      "Time_End": 26.64,
      "Text": " but you know, that may happen. You never know. Anyway, so this talk is really basic. It is"
    },
    {
      "Time_Start": 26.64,
      "Time_End": 33.04,
      "Text": " aimed at those of you with DSL and cable modems. Basically, I can't tell you how many people"
    },
    {
      "Time_Start": 33.04,
      "Time_End": 38.64,
      "Text": " I hear who basically say, oh, I don't need a modem. I don't have anything important on"
    },
    {
      "Time_Start": 38.64,
      "Time_End": 43.72,
      "Text": " my computer. And my basic reason, motivation for this talk was to prove that even if you"
    },
    {
      "Time_Start": 43.72,
      "Time_End": 50.480000000000004,
      "Text": " don't think you have anything valuable on your computer, you probably do. In my mind,"
    },
    {
      "Time_Start": 50.480000000000004,
      "Time_End": 54.28,
      "Text": " before I begin, I'll begin in a second, the kinds of information that people don't think"
    },
    {
      "Time_Start": 54.28,
      "Time_End": 59.88,
      "Text": " of as valuable are financial information. I run Quicken. I have all of my bank accounts"
    },
    {
      "Time_Start": 59.88,
      "Time_End": 65.8,
      "Text": " on Quicken. Well, if I have a Windows 98 machine that is connected by default and I'm unfortunately"
    },
    {
      "Time_Start": 65.8,
      "Time_End": 70.8,
      "Text": " silly enough to share my C drive, people can download my Quicken and there's Quicken crack"
    },
    {
      "Time_Start": 70.8,
      "Time_End": 75.64,
      "Text": " programs and they can get my password and they can pay my bills for me or their own."
    },
    {
      "Time_Start": 75.64,
      "Time_End": 81.68,
      "Text": " That's one example. Another example is simply just games. I mean, you've been playing Quake"
    },
    {
      "Time_Start": 81.68,
      "Time_End": 88.08000000000001,
      "Text": " 3 or whatever the new thing is for, you know, 10 or 20 or 30 or 40 or 50 hours and someone"
    },
    {
      "Time_Start": 88.08000000000001,
      "Time_End": 97.96000000000001,
      "Text": " says, ha, ha, ha, I'll delete your Quake file. I mean, there's, there's, there's. Thank you"
    },
    {
      "Time_Start": 97.96000000000001,
      "Time_End": 104.72,
      "Text": " for the interruption. Anyways. There are actually valuable pieces of information that you wouldn't"
    },
    {
      "Time_Start": 104.72,
      "Time_End": 109.28,
      "Text": " think of as valuable. How would you like to have to reformat your pretty new HP? You know"
    },
    {
      "Time_Start": 109.28,
      "Time_End": 112.56,
      "Text": " how long it takes to install Windows 98 if you've never done it before and even if you"
    },
    {
      "Time_Start": 112.56,
      "Time_End": 117.92,
      "Text": " know how. Anyways, I'm going to begin now because it looks like we're kind of settling"
    },
    {
      "Time_Start": 117.92,
      "Time_End": 125.12,
      "Text": " down. So, this is, the title of this talk is Home-Based Firewalls and Why You Need Them."
    },
    {
      "Time_Start": 125.12,
      "Time_End": 133.96,
      "Text": " Doobie track. There we go. Okay. This is a threat matrix. I'm going to explain it to"
    },
    {
      "Time_Start": 133.96,
      "Time_End": 141.24,
      "Text": " you. Along the top axis are threat, OS, the type of technology, cable, DSL, or modem."
    },
    {
      "Time_Start": 141.24,
      "Time_End": 146.04000000000002,
      "Text": " And then I'll just go down really briefly and explain this. Basically, the first threat"
    },
    {
      "Time_Start": 146.04000000000002,
      "Time_End": 152.32,
      "Text": " is the network neighborhood. Microsoft's infinite let's share our network with the world. Basically"
    },
    {
      "Time_Start": 152.32,
      "Time_End": 157.0,
      "Text": " Windows, technically Linux can be also classified in here. If you're using something called"
    },
    {
      "Time_Start": 157.0,
      "Time_End": 163.08,
      "Text": " Samba, Linux can export file systems just like Windows can. And the Samba, unfortunately"
    },
    {
      "Time_Start": 163.08,
      "Time_End": 167.44000000000003,
      "Text": " and Linux suffers from all of the same security problems in some respects that the Windows"
    },
    {
      "Time_Start": 167.44000000000003,
      "Time_End": 172.96,
      "Text": " one does unless you set it up right. And it's kind of hard to set up right. Basically, network"
    },
    {
      "Time_Start": 172.96,
      "Time_End": 177.84,
      "Text": " neighborhood exists as a threat on both cable, DSL, and modem. Now, the main differences"
    },
    {
      "Time_Start": 177.84,
      "Time_End": 183.36,
      "Text": " between cable, DSL, and modem, modem is generally intermittent unless you've got a leased line"
    },
    {
      "Time_Start": 183.36,
      "Time_End": 191.92000000000002,
      "Text": " or you know, some people have ISDN. Poor people. Anyways, they have ISDN and it's basically"
    },
    {
      "Time_Start": 191.92000000000002,
      "Time_End": 197.36,
      "Text": " up and down. Cable and DSL are what we call 24-7 connections. They're usually always on"
    },
    {
      "Time_Start": 197.36,
      "Time_End": 201.96,
      "Text": " and usually your computer's always connected. So the threat risk is much higher for cable"
    },
    {
      "Time_Start": 201.96,
      "Time_End": 209.04000000000002,
      "Text": " and DSL modem, and DSL as opposed to modem. DOS's denial of service, everything from the"
    },
    {
      "Time_Start": 209.04000000000002,
      "Time_End": 215.76000000000002,
      "Text": " ICMP fragmenting tax that people put out, the ones that took down Yahoo, and simple"
    },
    {
      "Time_Start": 215.76000000000002,
      "Time_End": 218.8,
      "Text": " things like doing wind nuke. You know, if you don't like someone I've ever seen, you"
    },
    {
      "Time_Start": 218.8,
      "Time_End": 224.16000000000003,
      "Text": " wind nuke them. That's a denial of service attack. And there's a whole wide class of"
    },
    {
      "Time_Start": 224.16000000000003,
      "Time_End": 231.08,
      "Text": " these, you know, depending on the OS. All three are vulnerable, all three platforms,"
    },
    {
      "Time_Start": 231.08,
      "Time_End": 238.28,
      "Text": " modem, cable, and DSL. IRC chat attacks, these are probably what I would consider to be for"
    },
    {
      "Time_Start": 238.28,
      "Time_End": 244.64000000000001,
      "Text": " a home user who is young, I was saying probably in the 14 to 21 range when IRC is still a"
    },
    {
      "Time_Start": 244.64000000000001,
      "Time_End": 247.68,
      "Text": " cool thing. Basically, that's your"
    }
  ]
}