{"segments": [{"Time_Start": 0.0, "Time_End": 11.36, "Text": " Hello, my handle isender."}, {"Time_Start": 11.36, "Time_End": 13.84, "Text": " I'm one of the original founders of the ghetto hackers."}, {"Time_Start": 13.84, "Time_End": 28.16, "Text": " I'm going to be talking today about autonomous nodes, which are basically little computer programs that you can say they have their own little artificial intelligence inside."}, {"Time_Start": 28.16, "Time_End": 41.16, "Text": " The idea is not that they're artificially intelligent, it's just that they live by rules and die by those rules, and they don't talk to anybody else, they kind of do their own thing."}, {"Time_Start": 41.16, "Time_End": 44.16, "Text": " I wanted to give some thanks up front."}, {"Time_Start": 44.16, "Time_End": 46.16, "Text": " There's a lot of people who've helped me with this."}, {"Time_Start": 46.16, "Time_End": 57.16, "Text": " Caesar, bats, all 40 ounces of the ghetto hackers, DT, dementia, Absolute Nick, who fixed my laptop."}, {"Time_Start": 57.160000000000004, "Time_End": 71.16, "Text": " Fast Eddie, send the icky guy and Michelle, Mike, and in Linwood where I would sit for hours and hours all night drinking coffee, a nice little Denny's there, they're pretty cool."}, {"Time_Start": 75.16, "Time_End": 79.16, "Text": " What are autonomous nodes and intelligent agents?"}, {"Time_Start": 79.16, "Time_End": 86.16, "Text": " There is a distinction between the two. You'll hear a lot about intelligent agents in"}, {"Time_Start": 86.16, "Time_End": 95.16, "Text": " network software that goes out and retrieves information for you such as a news agent."}, {"Time_Start": 95.16, "Time_End": 105.16, "Text": " You tell what type of news you actually want to read, and it goes and gets it from all the different type of places that it knows about."}, {"Time_Start": 105.16, "Time_End": 115.16, "Text": " The differentiation between an autonomous node and one of those agents is that the agent goes and gets information and it relies on your input to determine what it does."}, {"Time_Start": 115.16, "Time_End": 118.16, "Text": " and what it does and where it looks."}, {"Time_Start": 118.16, "Time_End": 125.16, "Text": " An autonomous node, once you begin running it, it does what it wants and does what it was programmed to do,"}, {"Time_Start": 125.16, "Time_End": 129.16, "Text": " and it doesn't care what anybody tells it to do from that point."}, {"Time_Start": 129.16, "Time_End": 136.16, "Text": " It was my intention when I originally asked DT if I could speak here,"}, {"Time_Start": 136.16, "Time_End": 141.16, "Text": " that I'd have a full demonstration of one of these nodes working,"}, {"Time_Start": 141.16, "Time_End": 144.16, "Text": " and we were going to actually use a buffer overflow in a..."}, {"Time_Start": 144.16, "Time_End": 148.16, "Text": " in a Windows NT and do a quick demonstration."}, {"Time_Start": 148.16, "Time_End": 156.16, "Text": " The way the development went, I ended up redesigning many portions with Caesar's help,"}, {"Time_Start": 156.16, "Time_End": 165.16, "Text": " and doing a full demonstration didn't seem right because, well, making fun of me because I'm running Windows already."}, {"Time_Start": 165.16, "Time_End": 173.16, "Text": " The demonstration would have been on the Windows box and such, and the idea is I want the Autonomous Node project itself to be"}, {"Time_Start": 173.16, "Time_End": 179.16, "Text": " to be able to be run on many, many platforms operating systems."}, {"Time_Start": 179.16, "Time_End": 182.16, "Text": " And there's that."}, {"Time_Start": 182.16, "Time_End": 188.16, "Text": " Autonomous nodes are currently being used, like I said earlier,"}, {"Time_Start": 188.16, "Time_End": 192.16, "Text": " we're in many network applications and other informational applications."}, {"Time_Start": 192.16, "Time_End": 198.16, "Text": " Currently, Sandea, which is a government job house,"}, {"Time_Start": 198.16, "Time_End": 202.16, "Text": " is using autonomous nodes they're creating their own,"}, {"Time_Start": 202.16, "Time_End": 203.16, "Text": " to actually have to actually have."}, {"Time_Start": 203.16, "Time_End": 211.16, "Text": " have a defense network which will be used to basically protect government networks from hackers."}, {"Time_Start": 211.16, "Time_End": 219.16, "Text": " And the standard hacker or hackers, they're going to be attempting to penetrate any of these type of servers,"}, {"Time_Start": 219.16, "Time_End": 232.16, "Text": " will be not up against a server administrator of any kind or even just Bob Joe software that is a watchdog."}, {"Time_Start": 232.16, "Time_End": 234.16, "Text": " is watchdogging the servers."}, {"Time_Start": 234.16, "Time_End": 240.16, "Text": " You're going to be looking at attacking multiple,"}, {"Time_Start": 240.16, "Time_End": 244.16, "Text": " multiple modes of machines that are running solely to watch for you"}, {"Time_Start": 244.16, "Time_End": 250.16, "Text": " and communicate between themselves and then hack you back or report"}, {"Time_Start": 250.16, "Time_End": 252.16, "Text": " that they're being hacked."}, {"Time_Start": 252.16, "Time_End": 255.16, "Text": " But currently, CMDia did release a press release,"}, {"Time_Start": 255.16, "Time_End": 259.15999999999997, "Text": " and you can see it on their page at www.candia.gov,"}, {"Time_Start": 259.15999999999997, "Time_End": 262.14, "Text": " where they said that multiple red teams are"}, {"Time_Start": 262.16, "Time_End": 269.16, "Text": " hackers from some three-letter acronym places were unable to penetrate their networks using these nodes."}, {"Time_Start": 269.16, "Time_End": 280.16, "Text": " They also stated that they would like to convince ISPs in the future to actually run these nodes"}, {"Time_Start": 280.16, "Time_End": 291.16, "Text": " so that all of the information packets of any email, any connections, anything that is not encrypted in the United States,"}, {"Time_Start": 291.16, "Time_End": 301.16, "Text": " It is possible that many more, through letter acronym, people can be reading all of that and capturing all of this using these nodes."}, {"Time_Start": 301.16, "Time_End": 312.16, "Text": " And they would also render hackers' attacks on almost any ISP, including the DefCon webpage, useless."}, {"Time_Start": 321.16, "Time_End": 327.16, "Text": " because they do not exactly rely on anyone to ever talk to them."}, {"Time_Start": 327.16, "Time_End": 334.16, "Text": " Once you define the rules and what you want to happen, autonomous nodes perform a single task."}, {"Time_Start": 334.16, "Time_End": 339.16, "Text": " So if you're ever performing a single task in networking, something you're going to do often,"}, {"Time_Start": 339.16, "Time_End": 350.16, "Text": " much like running NMAP on a machine, running certain programs where many hackers will go and they'll script out the commonly used things."}, {"Time_Start": 350.16, "Time_End": 352.16, "Text": " used things."}, {"Time_Start": 352.16, "Time_End": 363.16, "Text": " I propose that in the future, what we'll see is we'll actually see many of these nodes that have a back end or front end"}, {"Time_Start": 363.16, "Time_End": 370.16, "Text": " where hackers can simply take a module that performs one of these actions or events and"}, {"Time_Start": 370.16, "Time_End": 374.16, "Text": " plugs it in and then runs the autonomous node."}, {"Time_Start": 374.16, "Time_End": 379.16, "Text": " The autonomous node knows the rules by which that the hacker set forth."}, {"Time_Start": 379.16, "Time_End": 385.16, "Text": " And so you can always do, say, for instance, once someone writes a DNS Poisoner,"}, {"Time_Start": 385.16, "Time_End": 391.16, "Text": " then they simply plug it into the autonomous node structure,"}, {"Time_Start": 391.16, "Time_End": 398.16, "Text": " and then forever and ever, they'll always have the ability to run this certain program."}, {"Time_Start": 398.16, "Time_End": 408.16, "Text": " And the design itself should present the ability for an ever-expanding and ever-growing"}, {"Time_Start": 408.16, "Time_End": 418.16, "Text": " growing use of these tools that are developed with these modules so that some guy goes"}, {"Time_Start": 418.16, "Time_End": 424.40000000000003, "Text": " and he writes, for instance, a DNS poisoner, and then Bob Joe over here, he needs a DNS"}, {"Time_Start": 424.40000000000003, "Time_End": 429.16, "Text": " poisoner as well, and he's going to write it differently and he's going to use a different format"}, {"Time_Start": 429.16, "Time_End": 431.16, "Text": " and it's going to run on Linux."}, {"Time_Start": 431.16, "Time_End": 435.16, "Text": " And then this guy over here, his works on a different operating system."}, {"Time_Start": 435.16, "Time_End": 437.16, "Text": " And there's no common goals and there's no common tools and there's no common tools."}, {"Time_Start": 437.16, "Time_End": 448.16, "Text": " and there's no common structure for the tools that are being developed today for network security as a whole."}, {"Time_Start": 448.16, "Time_End": 459.16, "Text": " The autonomous nodes would allow that a set of rules to be defined so that specific events that happen,"}, {"Time_Start": 459.16, "Time_End": 467.14000000000004, "Text": " whether it's from a packet sniffer or an IRC channel, that there's a layer of information that will feed in"}, {"Time_Start": 467.16, "Time_End": 474.16, "Text": " to the rules which are defined by the programmer or script language possibly"}, {"Time_Start": 474.16, "Time_End": 481.16, "Text": " so that things can happen based on the data that is received and seen by the note itself."}, {"Time_Start": 481.16, "Time_End": 485.16, "Text": " And then I have the Army of One."}, {"Time_Start": 485.16, "Time_End": 492.16, "Text": " Currently, the ghetto hackers have quite a few members and, well, if you know,"}, {"Time_Start": 492.16, "Time_End": 496.16, "Text": " if you have been out by the CTF table, you can see we were kind of going at it pretty hardcore."}, {"Time_Start": 496.16, "Time_End": 504.16, "Text": " In the future, there's not going to be an army of people necessarily."}, {"Time_Start": 504.16, "Time_End": 506.16, "Text": " There's going to be an army of nodes."}, {"Time_Start": 506.16, "Time_End": 509.16, "Text": " There's going to be an army of programs."}, {"Time_Start": 509.16, "Time_End": 513.1600000000001, "Text": " Sandia, with their publication, said, hey, yeah, we're going to have 50 computers here"}, {"Time_Start": 513.1600000000001, "Time_End": 516.1600000000001, "Text": " all doing different things, talking to each other."}, {"Time_Start": 516.1600000000001, "Time_End": 517.1600000000001, "Text": " That's the defense."}, {"Time_Start": 517.1600000000001, "Time_End": 525.1600000000001, "Text": " And no group of people can think fast enough and can act fast enough based on the information"}, {"Time_Start": 525.16, "Time_End": 533.16, "Text": " that will be seen when you are hacking to make the right choices fast enough to penetrate."}, {"Time_Start": 533.16, "Time_End": 544.16, "Text": " An army of one will be the hacker or the freaker or someone or someone of that nature"}, {"Time_Start": 544.16, "Time_End": 550.16, "Text": " who actually has computers that are doing all the small tasks that he wants."}, {"Time_Start": 550.16, "Time_End": 554.16, "Text": " The structure that can be used to do that must"}, {"Time_Start": 554.16, "Time_End": 569.16, "Text": " must allow that the actions for the programs that they want to make"}, {"Time_Start": 569.16, "Time_End": 576.16, "Text": " be structured significantly the same so that an autonomous mode that's packet sniffing"}, {"Time_Start": 576.16, "Time_End": 581.16, "Text": " behind a firewall and then sending that data sneaking it outside the firewall"}, {"Time_Start": 581.16, "Time_End": 584.14, "Text": " he sends it over to say an IRC server"}, {"Time_Start": 584.16, "Time_End": 590.66, "Text": " there's a node on the IRC server that the same hacker who put the node behind the file while put there."}, {"Time_Start": 590.66, "Time_End": 596.16, "Text": " And it, the information layer that it's using, is just reading right from the IRC channel."}, {"Time_Start": 596.16, "Time_End": 601.16, "Text": " And so in that case, he takes the data, and he doesn't, neither of the nodes,"}, {"Time_Start": 601.16, "Time_End": 607.16, "Text": " know that the other one exists, nor do they care, because they run on the rules internally."}, {"Time_Start": 607.16, "Time_End": 610.16, "Text": " They don't care about anybody else."}, {"Time_Start": 610.16, "Time_End": 613.66, "Text": " So he sees some data on the IRC channel and he sends it to,"}, {"Time_Start": 613.66, "Time_End": 620.66, "Text": " you know, he makes little mail packets and sends it via mail to South Africa or something."}, {"Time_Start": 620.66, "Time_End": 630.66, "Text": " This is an example application of what multiple nodes can do and exactly how people will hack in the future."}, {"Time_Start": 630.66, "Time_End": 640.66, "Text": " I want to talk a moment about some of the components that create a node."}, {"Time_Start": 640.66, "Time_End": 645.66, "Text": " Hacker node would be nothing without an exploit database."}, {"Time_Start": 645.66, "Time_End": 653.66, "Text": " This database is not some big SQL server specific thing."}, {"Time_Start": 653.66, "Time_End": 657.66, "Text": " It's a basic ANCC implementation."}, {"Time_Start": 657.66, "Time_End": 659.66, "Text": " You got fields, you got rows, you got columns."}, {"Time_Start": 659.66, "Time_End": 661.66, "Text": " It's very simple."}, {"Time_Start": 661.66, "Time_End": 669.66, "Text": " They're customizable templates, so you could have anything from a database that records an IP and"}, {"Time_Start": 669.66, "Time_End": 680.66, "Text": " operating system information to usernames that were sniffed off of the network."}, {"Time_Start": 680.66, "Time_End": 687.66, "Text": " Each of these modules will be, in some cases, loadable upon runtime,"}, {"Time_Start": 687.66, "Time_End": 693.66, "Text": " in some cases they will have to be compiled in, and it really is going to depend on the operating system"}, {"Time_Start": 693.66, "Time_End": 698.66, "Text": " and the platform that are used for that specific node."}, {"Time_Start": 698.66, "Time_End": 699.66, "Text": " node."}, {"Time_Start": 699.66, "Time_End": 707.66, "Text": " The attack tree logic is something that Bruce Schneier, many of you know who Bruce's,"}, {"Time_Start": 707.66, "Time_End": 715.66, "Text": " actually documented, he, I believe he put it, he finally was putting the smackdown on"}, {"Time_Start": 715.66, "Time_End": 722.66, "Text": " the ideas that people had talked about as far as making a logical tree and then sorting"}, {"Time_Start": 722.66, "Time_End": 727.66, "Text": " the nodes of that tree to determine the best plausible way under certain circumstances."}, {"Time_Start": 727.66, "Time_End": 736.66, "Text": " circumstances to get to your goal where if you were to take a note and say that it was a bank fault,"}, {"Time_Start": 736.66, "Time_End": 743.66, "Text": " and then you would have then cascading leaves off of that where one would be you could blow it up."}, {"Time_Start": 743.66, "Time_End": 750.66, "Text": " And then each of the nodes would have data assigned to it regarding what it would take to do that."}, {"Time_Start": 750.66, "Time_End": 755.66, "Text": " In the case of blowing it up, you might need dynamite, in which case that might cost $25,000."}, {"Time_Start": 755.66, "Time_End": 757.64, "Text": " And so there's data that's data that's a number that's"}, {"Time_Start": 757.66, "Time_End": 761.66, "Text": " associated with actions that can take place within an attack tree."}, {"Time_Start": 761.66, "Time_End": 768.66, "Text": " And these fields that you would define, you would then run simple sort algorithms"}, {"Time_Start": 768.66, "Time_End": 771.66, "Text": " that would go through and say, which is the least expensive way?"}, {"Time_Start": 771.66, "Time_End": 775.66, "Text": " And so then you go through all the leaves of your entire tree and you say,"}, {"Time_Start": 775.66, "Time_End": 779.66, "Text": " well, rolling up the bank vault to get the money is not going to be the cheapest way."}, {"Time_Start": 779.66, "Time_End": 781.66, "Text": " We're looking for the cheapest way."}, {"Time_Start": 781.66, "Time_End": 786.66, "Text": " And that might over here turn out to be just going and getting a lot of guns and stealing a van and showing up."}, {"Time_Start": 786.66, "Time_End": 787.66, "Text": " going up."}, {"Time_Start": 787.66, "Time_End": 796.4599999999999, "Text": " So the attack tree logic itself is going to be a module that can be loaded by the node."}, {"Time_Start": 796.4599999999999, "Time_End": 802.86, "Text": " If the node's purpose is aggressive or maybe even defensive, the node will have the ability"}, {"Time_Start": 802.86, "Time_End": 809.9599999999999, "Text": " to assign specific information in a tree, say of a network map, to determine the fastest way"}, {"Time_Start": 809.9599999999999, "Time_End": 816.16, "Text": " to hack something, the easiest way to hack something, or possibly the most stealthiest way."}, {"Time_Start": 816.16, "Time_End": 826.36, "Text": " the independent decision making kind of just falls into the rules."}, {"Time_Start": 826.36, "Time_End": 834.9599999999999, "Text": " The rules are, is the code that the developer creates for the specific node."}, {"Time_Start": 834.9599999999999, "Time_End": 844.52, "Text": " The decisions that is the same. The decisions themselves themselves, the decisions themselves, the decisions themselves, the decisions themselves, the decisions themselves."}, {"Time_Start": 844.52, "Time_End": 853.42, "Text": " The decisions themselves are specific of the designs and the choices that the developer"}, {"Time_Start": 853.42, "Time_End": 855.42, "Text": " makes when he writes it."}, {"Time_Start": 855.42, "Time_End": 862.22, "Text": " This is why I shy away from saying it is artificial intelligence because it's really not."}, {"Time_Start": 862.22, "Time_End": 867.72, "Text": " The developer has to know about the cases that it will happen before he writes the code"}, {"Time_Start": 867.72, "Time_End": 869.3199999999999, "Text": " to create the rules."}, {"Time_Start": 869.3199999999999, "Time_End": 874.5, "Text": " In many cases, one will want to instruct the node to"}, {"Time_Start": 874.52, "Time_End": 876.52, "Text": " have a certain behavior."}, {"Time_Start": 876.52, "Time_End": 883.52, "Text": " There would be troublesome to maintain hundreds of nodes around, hence the initial suggestion."}, {"Time_Start": 883.52, "Time_End": 888.52, "Text": " An initial suggestion is when you run your node."}, {"Time_Start": 888.52, "Time_End": 893.52, "Text": " Because you don't want 50 nodes around, one that does some packet sniffing and some decisions"}, {"Time_Start": 893.52, "Time_End": 897.52, "Text": " based on that, a node that sits over here and does some DNS poisoning,"}, {"Time_Start": 897.52, "Time_End": 903.52, "Text": " it makes more sense because if you exploit a box and you want to run a bunch of programs on it,"}, {"Time_Start": 903.52, "Time_End": 912.52, "Text": " on it, it's probably going to be pretty obvious if you upload 100 megabytes worth of data to the machine and then take up half the CPU time as well."}, {"Time_Start": 912.52, "Time_End": 924.52, "Text": " So generally, you will, you can run, you'll run a node and you'll incorporate more functionality in the rules than you'll need so that it is all together."}, {"Time_Start": 924.52, "Time_End": 933.5, "Text": " And then you will have an initial suggestion to the node and you will say, hi, I want you to be aggressive for a given node that is actually"}, {"Time_Start": 933.52, "Time_End": 936.5799999999999, "Text": " intended to exploit a box."}, {"Time_Start": 943.38, "Time_End": 950.34, "Text": " Some of the other issues about having a node that you use, that you actually, is a client on your"}, {"Time_Start": 950.34, "Time_End": 953.0, "Text": " machine, and you use it to exploit a server."}, {"Time_Start": 953.56, "Time_End": 961.66, "Text": " At that point, you put another node on the server, naturally, and that can be for reasons of"}, {"Time_Start": 961.66, "Time_End": 962.48, "Text": " packet sniffing."}, {"Time_Start": 962.78, "Time_End": 963.5, "Text": " You might put it there."}, {"Time_Start": 963.52, "Time_End": 971.52, "Text": " simply to own the box, to keep certain watchdog programs from running on the server,"}, {"Time_Start": 971.52, "Time_End": 973.52, "Text": " there's multiple reasons."}, {"Time_Start": 973.52, "Time_End": 982.02, "Text": " And in that case, you might have a hierarchy of nodes, which would actually turn the autonomous nodes"}, {"Time_Start": 982.02, "Time_End": 986.52, "Text": " and back into intelligent agents because they might want to communicate."}, {"Time_Start": 993.52, "Time_End": 1003.28, "Text": " One issue that I've had while working with this is that the code for this is somewhat touchy"}, {"Time_Start": 1003.28, "Time_End": 1009.0799999999999, "Text": " because it's probably not a good idea to have replicating autonomous hacking nodes floating"}, {"Time_Start": 1009.0799999999999, "Time_End": 1016.96, "Text": " around the internet where any script kitty can decide they want to replicate 200,000 machines"}, {"Time_Start": 1016.96, "Time_End": 1018.1999999999999, "Text": " out there."}, {"Time_Start": 1018.1999999999999, "Time_End": 1023.5, "Text": " So the status of this project is basically going to work that it is"}, {"Time_Start": 1023.52, "Time_End": 1027.52, "Text": " kind of a closed, closed code."}, {"Time_Start": 1031.52, "Time_End": 1039.52, "Text": " The obscure communication layer, this is basically going to be an implementation of a layer"}, {"Time_Start": 1039.52, "Time_End": 1047.52, "Text": " of a layer of communication where the node, when he's in a situation where he doesn't want"}, {"Time_Start": 1047.52, "Time_End": 1053.02, "Text": " to say, hey, I'm over here, why don't you come format my hard drive or delete me."}, {"Time_Start": 1053.52, "Time_End": 1060.52, "Text": " He will generally use higher level protocols, and then he will do all of his communication via"}, {"Time_Start": 1060.52, "Time_End": 1067.52, "Text": " payloading right onto the top of the protocol, it just makes something that's valid that's going to go through a firewall."}, {"Time_Start": 1067.52, "Time_End": 1075.52, "Text": " And then he tags on the end, some signature information, and some basic information that he's trying to send,"}, {"Time_Start": 1075.52, "Time_End": 1079.52, "Text": " such as, hey, I found a username and password, such a thing."}, {"Time_Start": 1079.52, "Time_End": 1082.52, "Text": " And at that point, he can send data via payload directly outside of a firewall."}, {"Time_Start": 1082.52, "Time_End": 1085.52, "Text": " outside of a firewall or just peer-to-peer."}, {"Time_Start": 1085.52, "Time_End": 1092.52, "Text": " Now a node that's running on that other machine that's packet-sniffing can say, oh, because he is packet-sniffing, he sees everything,"}, {"Time_Start": 1092.52, "Time_End": 1101.02, "Text": " and he sees the payload, and he's looking for the idea or the ID of another node, and so he sees that,"}, {"Time_Start": 1101.02, "Time_End": 1105.02, "Text": " and then he can immediately take that information and do whatever he wanted with it."}, {"Time_Start": 1105.02, "Time_End": 1110.02, "Text": " Possibly there was a node inside of a network that didn't want to be found."}, {"Time_Start": 1110.02, "Time_End": 1112.02, "Text": " Hence the rules."}, {"Time_Start": 1112.02, "Time_End": 1115.02, "Text": " He was being quiet because he was in a network."}, {"Time_Start": 1115.02, "Time_End": 1118.02, "Text": " And at that point, perhaps he saw a username and password."}, {"Time_Start": 1118.02, "Time_End": 1123.02, "Text": " And so he decided, okay, I'm going to broadcast this out to an IRC channel."}, {"Time_Start": 1123.02, "Time_End": 1125.02, "Text": " Now, he's an autonomous node."}, {"Time_Start": 1125.02, "Time_End": 1127.02, "Text": " He doesn't care if anybody hears him."}, {"Time_Start": 1127.02, "Time_End": 1129.02, "Text": " He's going to broadcast anyway."}, {"Time_Start": 1129.02, "Time_End": 1134.02, "Text": " And maybe he waits till Monday morning when there's a lot of traffic on the network at work"}, {"Time_Start": 1134.02, "Time_End": 1139.02, "Text": " before he broadcasts so that no one can specifically see that."}, {"Time_Start": 1139.02, "Time_End": 1140.02, "Text": " These are some of the ideas."}, {"Time_Start": 1140.02, "Time_End": 1147.02, "Text": " ideas that come around when you start talking about the little hacker programs that are going to take over the internet."}, {"Time_Start": 1147.02, "Time_End": 1155.02, "Text": " Then, let's say on this IRC channel, the information shows up."}, {"Time_Start": 1155.02, "Time_End": 1161.02, "Text": " Also included in this communication layer, we'll link back to the exploit database."}, {"Time_Start": 1161.02, "Time_End": 1168.02, "Text": " But there could also be a database that stores the server mappings, user names, and such."}, {"Time_Start": 1168.02, "Time_End": 1171.02, "Text": " the packet smither on the inside of the firewall,"}, {"Time_Start": 1171.02, "Time_End": 1174.02, "Text": " he sends a bunch of data out and says,"}, {"Time_Start": 1174.02, "Time_End": 1177.02, "Text": " Hey, I found a password, I found a username,"}, {"Time_Start": 1177.02, "Time_End": 1179.02, "Text": " and actually send some commands"}, {"Time_Start": 1179.02, "Time_End": 1182.02, "Text": " so that another node, if it happens to see it,"}, {"Time_Start": 1182.02, "Time_End": 1184.02, "Text": " stores that information into a database."}, {"Time_Start": 1188.02, "Time_End": 1190.02, "Text": " The packet smiffer and input were applicable."}, {"Time_Start": 1190.02, "Time_End": 1194.02, "Text": " There are certain cases on certain networks"}, {"Time_Start": 1194.02, "Time_End": 1197.02, "Text": " where this is not going to be,"}, {"Time_Start": 1197.02, "Time_End": 1204.02, "Text": " not going to be working, basically. On a switch network, you're going to have"}, {"Time_Start": 1204.02, "Time_End": 1211.02, "Text": " problems seeing certain packets going from many of the other client machines that are on that network."}, {"Time_Start": 1211.02, "Time_End": 1216.02, "Text": " And there are certain aggressive natures that a node could take,"}, {"Time_Start": 1216.02, "Time_End": 1223.02, "Text": " now depending on the initial suggestion that is given to the node upon which it can determine,"}, {"Time_Start": 1223.02, "Time_End": 1226.02, "Text": " hey, I'm supposed to be aggressive, or I'm supposed to be quiet, in the initial suggestion that is given to the node,"}, {"Time_Start": 1226.02, "Time_End": 1233.02, "Text": " quiet. In the aggressive case, if a node was sitting on a switch network, he might decide"}, {"Time_Start": 1233.02, "Time_End": 1238.02, "Text": " to go ahead and dose the switch and try to get it to switch into hubbed mode."}, {"Time_Start": 1238.02, "Time_End": 1243.02, "Text": " And at that point, maybe sniff the network, try to get what he can,"}, {"Time_Start": 1243.02, "Time_End": 1247.02, "Text": " and then send that information out to an IRC server."}, {"Time_Start": 1247.02, "Time_End": 1255.02, "Text": " Want me to speed it up?"}, {"Time_Start": 1255.02, "Time_End": 1259.02, "Text": " Just a little bit? Okay."}, {"Time_Start": 1263.02, "Time_End": 1269.02, "Text": " Generally, the purpose behind this entire project is to supply common ground"}, {"Time_Start": 1269.02, "Time_End": 1276.02, "Text": " on which any network security program for any operating system and platform can be developed,"}, {"Time_Start": 1276.02, "Time_End": 1282.02, "Text": " and also so the ghetto hackers can win CTF without slaving at the CTF tables."}, {"Time_Start": 1282.02, "Time_End": 1289.02, "Text": " The first two operating systems for which I'm currently working this project on"}, {"Time_Start": 1289.02, "Time_End": 1292.02, "Text": " is Linux and Windows."}, {"Time_Start": 1292.02, "Time_End": 1295.02, "Text": " For my entire life, I've actually worked on DOS and Windows."}, {"Time_Start": 1295.02, "Time_End": 1300.02, "Text": " My current job includes working on Windows as much as I'm a ghetto hacker."}, {"Time_Start": 1300.02, "Time_End": 1304.02, "Text": " I only have Linux on one machine and I think it's broke."}, {"Time_Start": 1304.02, "Time_End": 1311.02, "Text": " So, later following, including, including"}, {"Time_Start": 1311.02, "Time_End": 1318.02, "Text": " and finishing the modules for the autonomous nodes."}, {"Time_Start": 1318.02, "Time_End": 1323.02, "Text": " I'm hoping to have a port to open BSD and a couple other operating systems."}, {"Time_Start": 1323.02, "Time_End": 1328.02, "Text": " And I'm hoping that I'm actually going to have a working version of this next year"}, {"Time_Start": 1328.02, "Time_End": 1334.02, "Text": " with the intention of using it actually at CTF."}, {"Time_Start": 1334.02, "Time_End": 1340.02, "Text": " And I think that's about all I have is any questions."}, {"Time_Start": 1340.02, "Time_End": 1341.02, "Text": " and questions."}, {"Time_Start": 1341.02, "Time_End": 1361.02, "Text": " I'm probably not that clear on stuff because I'm all nervous when I talk out in front of people."}, {"Time_Start": 1361.02, "Time_End": 1368.02, "Text": " Because of the size, the speed, and the very specific nature at which a node,"}, {"Time_Start": 1368.02, "Time_End": 1374.02, "Text": " needs to perform a single task and just do exactly what I want."}, {"Time_Start": 1374.02, "Time_End": 1377.02, "Text": " He's right there and he's going to do this."}, {"Time_Start": 1377.02, "Time_End": 1381.02, "Text": " I haven't even thought about actually doing any AI work at all."}, {"Time_Start": 1381.02, "Time_End": 1387.02, "Text": " Maybe later on, if all of this was incorporated into a single object,"}, {"Time_Start": 1387.02, "Time_End": 1394.02, "Text": " which literally was node hacker, the guy that could do anything you wanted him to do,"}, {"Time_Start": 1394.02, "Time_End": 1397.02, "Text": " could take down any box, could do any type of poisoning."}, {"Time_Start": 1397.02, "Time_End": 1398.02, "Text": " At that point,"}, {"Time_Start": 1398.02, "Time_End": 1402.02, "Text": " time it may seem it would probably be such a big project that you'd have to actually"}, {"Time_Start": 1402.02, "Time_End": 1408.02, "Text": " move to the point where you used real rules of artificial intelligence to determine"}, {"Time_Start": 1408.02, "Time_End": 1412.02, "Text": " importance of events and such"}, {"Time_Start": 1412.02, "Time_End": 1414.02, "Text": " such"}, {"Time_Start": 1414.02, "Time_End": 1418.02, "Text": " This is the other"}, {"Time_Start": 1418.02, "Time_End": 1420.02, "Text": " Just like"}, {"Time_Start": 1420.02, "Time_End": 1421.02, "Text": " just like to be in"}, {"Time_Start": 1421.02, "Time_End": 1423.02, "Text": " behind"}, {"Time_Start": 1423.02, "Time_End": 1424.02, "Text": " I'm not"}, {"Time_Start": 1424.02, "Time_End": 1437.02, "Text": " They are actually using AI."}, {"Time_Start": 1437.02, "Time_End": 1442.02, "Text": " They are also, to my knowledge, incorporating the ability for a server."}, {"Time_Start": 1442.02, "Time_End": 1447.02, "Text": " They're actually not taking an FTP server and then writing some AI"}, {"Time_Start": 1447.02, "Time_End": 1450.02, "Text": " on the side to watch what's going on."}, {"Time_Start": 1450.02, "Time_End": 1453.02, "Text": " They're actually rewriting the FTP server at that point."}, {"Time_Start": 1453.02, "Time_End": 1453.82, "Text": " In"}, {"Time_Start": 1454.02, "Time_End": 1458.02, "Text": " incorporating all of the security into the service itself"}, {"Time_Start": 1458.02, "Time_End": 1461.02, "Text": " so that literally your FTP server"}, {"Time_Start": 1461.02, "Time_End": 1463.02, "Text": " will be able to talk to your web server"}, {"Time_Start": 1463.02, "Time_End": 1465.02, "Text": " as far as the security's concerned and say,"}, {"Time_Start": 1465.02, "Time_End": 1467.02, "Text": " hey, I saw this, did you, what did you see?"}, {"Time_Start": 1467.02, "Time_End": 1469.02, "Text": " That type of a thing."}, {"Time_Start": 1469.02, "Time_End": 1482.02, "Text": " Anyone else?"}, {"Time_Start": 1482.02, "Time_End": 1483.02, "Text": " I'm sorry?"}, {"Time_Start": 1483.02, "Time_End": 1484.02, "Text": " I'm sorry."}, {"Time_Start": 1484.02, "Time_End": 1492.02, "Text": " Oh, the attack tree itself,"}, {"Time_Start": 1492.02, "Time_End": 1496.02, "Text": " each of the lease or the actual modes"}, {"Time_Start": 1496.02, "Time_End": 1499.02, "Text": " will themselves are database."}, {"Time_Start": 1499.02, "Time_End": 1502.02, "Text": " It is a database itself."}, {"Time_Start": 1502.02, "Time_End": 1506.02, "Text": " So the template that's used to create those nodes"}, {"Time_Start": 1506.02, "Time_End": 1510.02, "Text": " can simply be used to actually store that information to a database."}, {"Time_Start": 1510.02, "Time_End": 1512.02, "Text": " You could create it on the fly"}, {"Time_Start": 1512.02, "Time_End": 1513.02, "Text": " if you wanted to."}, {"Time_Start": 1513.02, "Time_End": 1514.02, "Text": " Thank you."}, {"Time_Start": 1514.02, "Time_End": 1516.02, "Text": " Does that answer your question?"}, {"Time_Start": 1543.02, "Time_End": 1550.02, "Text": " a node and this mode is supposed to map a network. That's its intention."}, {"Time_Start": 1550.02, "Time_End": 1556.02, "Text": " And we'll say that it's going to map a network and"}, {"Time_Start": 1556.02, "Time_End": 1558.02, "Text": " then somewhere it's going to"}, {"Time_Start": 1558.02, "Time_End": 1561.02, "Text": " exploit or replicate itself."}, {"Time_Start": 1561.02, "Time_End": 1566.02, "Text": " So it creates a database, it performs its deeds of sniffing the network"}, {"Time_Start": 1566.02, "Time_End": 1572.02, "Text": " and it sees very simple signs through packets that and it's just"}, {"Time_Start": 1572.02, "Time_End": 1574.02, "Text": " and he just starts marking down and says,"}, {"Time_Start": 1574.02, "Time_End": 1576.02, "Text": " okay, I think that this guy is this type"}, {"Time_Start": 1576.02, "Time_End": 1578.02, "Text": " of an operating system over here at this IP,"}, {"Time_Start": 1578.02, "Time_End": 1580.02, "Text": " and then I think that this guy's over here,"}, {"Time_Start": 1580.02, "Time_End": 1583.02, "Text": " and I saw some message come from, and he tries to basically"}, {"Time_Start": 1583.02, "Time_End": 1585.02, "Text": " map out, and we'll say that there are, say,"}, {"Time_Start": 1585.02, "Time_End": 1587.02, "Text": " five machines there."}, {"Time_Start": 1587.02, "Time_End": 1591.02, "Text": " Now, let's say that I told him that there was an actual machine"}, {"Time_Start": 1591.02, "Time_End": 1595.02, "Text": " behind us, and he's trying to figure out the way to get there"}, {"Time_Start": 1595.02, "Time_End": 1597.02, "Text": " by mapping this network."}, {"Time_Start": 1597.02, "Time_End": 1602.02, "Text": " In that case, his attack tree would, by the trace"}, {"Time_Start": 1602.02, "Time_End": 1605.02, "Text": " of the different routes through the machines,"}, {"Time_Start": 1605.02, "Time_End": 1609.02, "Text": " he would create himself the nodes that would exist on the tree."}, {"Time_Start": 1609.02, "Time_End": 1613.02, "Text": " And then at that point, predefined sort routines"}, {"Time_Start": 1613.02, "Time_End": 1616.02, "Text": " that would say by operating system"}, {"Time_Start": 1616.02, "Time_End": 1620.02, "Text": " or different things like that based on the exploits"}, {"Time_Start": 1620.02, "Time_End": 1623.02, "Text": " that he had in his own database,"}, {"Time_Start": 1623.02, "Time_End": 1625.02, "Text": " he could sort by that and then determine"}, {"Time_Start": 1625.02, "Time_End": 1628.02, "Text": " which route he would want to take."}, {"Time_Start": 1628.02, "Time_End": 1631.02, "Text": " Does that answer your question?"}, {"Time_Start": 1632.02, "Time_End": 1637.02, "Text": " Okay, we can grab me afterwards if you'd like to talk about it more."}, {"Time_Start": 1637.02, "Time_End": 1642.02, "Text": " Are there any more questions?"}, {"Time_Start": 1642.02, "Time_End": 1644.02, "Text": " Sir?"}, {"Time_Start": 1644.02, "Time_End": 1650.02, "Text": " So you're talking more, if you say you've got more exploits on a given part in the tree,"}, {"Time_Start": 1650.02, "Time_End": 1653.02, "Text": " you're talking about you rather, because I have one node,"}, {"Time_Start": 1653.02, "Time_End": 1657.02, "Text": " we'll take a database and deal with all more of those exports"}, {"Time_Start": 1657.02, "Time_End": 1661.02, "Text": " rather than those exports are actually for, so you know, you know, you have to know,"}, {"Time_Start": 1661.02, "Time_End": 1674.02, "Text": " Personally, I..."}, {"Time_Start": 1674.02, "Time_End": 1675.52, "Text": " Can you say the question again?"}, {"Time_Start": 1675.52, "Time_End": 1677.02, "Text": " Sorry."}, {"Time_Start": 1677.02, "Time_End": 1684.02, "Text": " He said, would I rather have one node that"}, {"Time_Start": 1684.02, "Time_End": 1688.02, "Text": " that knew about four exploits"}, {"Time_Start": 1688.02, "Time_End": 1691.02, "Text": " and could use them rather than having four nodes with four"}, {"Time_Start": 1691.02, "Time_End": 1693.02, "Text": " different exploits."}, {"Time_Start": 1693.02, "Time_End": 1698.02, "Text": " If the four nodes were on four different machines,"}, {"Time_Start": 1698.02, "Time_End": 1701.02, "Text": " the purpose being to spread out an attack,"}, {"Time_Start": 1701.02, "Time_End": 1706.02, "Text": " I guess there's kind of some more information that might change my decision."}, {"Time_Start": 1706.02, "Time_End": 1708.02, "Text": " If I was just working from my client machine,"}, {"Time_Start": 1708.02, "Time_End": 1712.02, "Text": " I'd like one node that would actually know about everything."}, {"Time_Start": 1712.02, "Time_End": 1716.02, "Text": " But if you're doing a range of attacks from different positions,"}, {"Time_Start": 1716.02, "Time_End": 1720.02, "Text": " it would make more sense to have multiple notes."}, {"Time_Start": 1720.02, "Time_End": 1737.02, "Text": " I'm not actually real familiar with library nodes, did you say?"}, {"Time_Start": 1737.02, "Time_End": 1748.02, "Text": " I have not done any research on library nodes."}, {"Time_Start": 1748.02, "Time_End": 1749.02, "Text": " Any other questions?"}, {"Time_Start": 1749.02, "Time_End": 1751.02, "Text": " Thank you."}]}