{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 20.0,
      "Text": "This text was transcribed using whisper model: large-v2\n\n and it's being presented by me. Is that better? Okay. Again, my talk is Tunneling and Firewalls."
    },
    {
      "Time_Start": 21.0,
      "Time_End": 35.0,
      "Text": " Closer? Hey! Let me try something first. Hey! Thank you. We've got plenty of cable. That's always good to know."
    },
    {
      "Time_Start": 35.0,
      "Time_End": 41.0,
      "Text": " I'll start at the beginning. What is tunneling? Tunneling is essentially creating a virtual database"
    },
    {
      "Time_Start": 41.0,
      "Time_End": 46.0,
      "Text": " path between two computers, potentially using their protocol. An example given is you can use the"
    },
    {
      "Time_Start": 46.0,
      "Time_End": 68.0,
      "Text": " HTTP protocol between two machines to do Telnet. Oh, it is on. Sorry. I'll try it next time."
    },
    {
      "Time_Start": 68.0,
      "Time_End": 74.0,
      "Text": " All right. There's a bunch of available tunneling software, but the most popular one right now"
    },
    {
      "Time_Start": 74.0,
      "Time_End": 79.0,
      "Text": " is GNU HTTP Tunnel. It's really generic and it's really quite nice. It's been developed by some"
    },
    {
      "Time_Start": 79.0,
      "Time_End": 84.0,
      "Text": " guys at NoCrew. There's also a variety of homegrown solutions that do roughly the same thing"
    },
    {
      "Time_Start": 84.0,
      "Time_End": 91.0,
      "Text": " that HTTP Tunnel does. The user is well designed, don't handle proxies near as well. This is an"
    },
    {
      "Time_Start": 91.0,
      "Time_End": 96.0,
      "Text": " example network. We've just got the firewall only allowing outgoing connections on port 80 for"
    },
    {
      "Time_Start": 96.0,
      "Time_End": 101.0,
      "Text": " regular HTTP. All their access is blocked. An example being 23 for Telnet is blocked, 21 all the"
    },
    {
      "Time_Start": 102.0,
      "Time_End": 111.0,
      "Text": " standard ports. That's the only way you can get out. And let me flip over to this. Telnet space"
    },
    {
      "Time_Start": 111.0,
      "Time_End": 120.0,
      "Text": " home. And unable to connect to remote host connection refused. This machine is work. This machine"
    },
    {
      "Time_Start": 120.0,
      "Time_End": 129.0,
      "Text": " is home, by the way, for this. The Mac is the other one. All right. So let me start the HTTPS"
    },
    {
      "Time_Start": 129.0,
      "Time_End": 150.0,
      "Text": " Tunnel server on home. Now we've established half of the connection. Well, actually a third of"
    },
    {
      "Time_Start": 150.0,
      "Time_End": 159.0,
      "Text": " it the way it's set up right now. Now we run the client side on the other machine. Sorry."
    },
    {
      "Time_Start": 181.0,
      "Time_End": 194.0,
      "Text": " Okay. Now we have a virtual data path between two machines. Now I'll just do Telnet to this"
    },
    {
      "Time_Start": 194.0,
      "Time_End": 204.0,
      "Text": " machine work on port 2323 because that's where I set it up with the minus F option. And it's"
    },
    {
      "Time_Start": 204.0,
      "Time_End": 211.0,
      "Text": " connected to the other remote machine now. So you can get by pretty much any standard blocking"
    },
    {
      "Time_Start": 211.0,
      "Time_End": 215.0,
      "Text": " procedure. Because a lot of people with their firewalls will allow anything out on port 80"
    },
    {
      "Time_Start": 215.0,
      "Time_End": 220.0,
      "Text": " because that's what you use for HTTP access for just regular web browsing stuff like that. You"
    },
    {
      "Time_Start": 220.0,
      "Time_End": 225.0,
      "Text": " can use this to run anything you want to pretty much. You can run X over it, SSH, anything. I"
    },
    {
      "Time_Start": 225.0,
      "Time_End": 229.0,
      "Text": " mean, I would never run Telnet over it in a real world situation because that's just stupid."
    },
    {
      "Time_Start": 229.0,
      "Time_End": 244.0,
      "Text": " So let me go back to the thing now. That's actually a bug with rock. It does 321 every time you"
    },
    {
      "Time_Start": 244.0,
      "Time_End": 253.0,
      "Text": " type a character. But it makes it look more impressive at least. So how does HTTP Tunneling"
    },
    {
      "Time_Start": 253.0,
      "Time_End": 259.0,
      "Text": " work? Well, we've started both HTS and HTC on the respective machines. We've set the command."
    },
    {
      "Time_Start": 259.0,
      "Time_End": 266.0,
      "Text": " And what it does is it encapsulates that into an HTTP packet, sends it via HTC over to the other"
    },
    {
      "Time_Start": 266.0,
      "Time_End": 273.0,
      "Text": " machine, and the HTS receives that, tears apart the HTTP packet, and then sends the command"
    },
    {
      "Time_Start": 273.0,
      "Time_End": 281.0,
      "Text": " locally. And then it also passes the data back, of course. The basic protocol is formatted in a"
    },
    {
      "Time_Start": 281.0,
      "Time_End": 287.0,
      "Text": " really simple ‑‑ it's a very simple protocol they've laid out. This protocol allows it to pass"
    },
    {
      "Time_Start": 287.0,
      "Time_End": 292.0,
      "Text": " through a variety of proxies along the lines of squid, pretty much anything. If you can get"
    },
    {
      "Time_Start": 292.0,
      "Time_End": 298.0,
      "Text": " access out any way, you can use this to do port forwarding and other types of options. The"
    },
    {
      "Time_Start": 298.0,
      "Time_End": 304.0,
      "Text": " protocol has seven different requests. Five requests send additional data and two just send a"
    },
    {
      "Time_Start": 304.0,
      "Time_End": 310.0,
      "Text": " command to it, to their side. The two types of requests are the request with a 0X40 bit"
    },
    {
      "Time_Start": 310.0,
      "Time_End": 316.0,
      "Text": " consists of one byte with just a command in it, along the lines of open, close, disconnect. And"
    },
    {
      "Time_Start": 316.0,
      "Time_End": 322.0,
      "Text": " the request with a 0X40 byte clear have a two bit length field along the variable data field. I'll"
    },
    {
      "Time_Start": 322.0,
      "Time_End": 328.0,
      "Text": " show you in a sec. There are seven different requests. Tunnel open, tunnel data, tunnel padding,"
    },
    {
      "Time_Start": 328.0,
      "Time_End": 336.0,
      "Text": " tunnel error, tunnel pad one, tunnel close and tunnel disconnect. Tunnel open is just the"
    },
    {
      "Time_Start": 336.0,
      "Time_End": 342.0,
      "Text": " first request. You send that from the client to the server and it creates a virtual data path."
    },
    {
      "Time_Start": 342.0,
      "Time_End": 349.0,
      "Text": " Data is just whatever command you want to encapsulate into an HTTP request. Example being"
    },
    {
      "Time_Start": 349.0,
      "Time_End": 354.0,
      "Text": " when it's converted into like the tunnel net command, it puts that into an HTTP cell header"
    },
    {
      "Time_Start": 354.0,
      "Time_End": 360.0,
      "Text": " and makes it compliant with the standard. The padding is used if you're going through a proxy"
    },
    {
      "Time_Start": 360.0,
      "Time_End": 366.0,
      "Text": " like squid. Because squid usually you set it to 32K. And it will fill up the rest of that data so"
    },
    {
      "Time_Start": 366.0,
      "Time_End": 370.0,
      "Text": " it will actually send that command now instead of just holding it in the proxy. And it will also"
    },
    {
      "Time_Start": 370.0,
      "Time_End": 377.0,
      "Text": " use it on the way back so you can get the command right away. Tunnel error is in case you have a"
    },
    {
      "Time_Start": 377.0,
      "Time_End": 382.0,
      "Text": " rare example where you have an error in the connection. Right now this is not a real robust"
    },
    {
      "Time_Start": 382.0,
      "Time_End": 387.0,
      "Text": " protocol because you're running another protocol on top of HTTP and taking advantage of get and"
    },
    {
      "Time_Start": 387.0,
      "Time_End": 392.0,
      "Text": " put. And that can occasionally have problems if you're going between incompatible versions of"
    },
    {
      "Time_Start": 392.0,
      "Time_End": 400.0,
      "Text": " stuff. Tunnel pad one just exists if you have a buffer size greater than 32K. I mean, you"
    },
    {
      "Time_Start": 400.0,
      "Time_End": 405.0,
      "Text": " rarely do it with a proxy, but if you have a really, really low link connection, you will."
    },
    {
      "Time_Start": 405.0,
      "Time_End": 410.0,
      "Text": " It also beats the crap out of the system because it sends a bunch of one‑byte packets and"
    },
    {
      "Time_Start": 410.0,
      "Time_End": 417.0,
      "Text": " one of those just has to be encoded. Tunnel close closes the tunnel. Pretty much"
    },
    {
      "Time_Start": 417.0,
      "Time_End": 423.0,
      "Text": " straightforward. Tunnel disconnect is used to temporarily disconnect the connection."
    },
    {
      "Time_Start": 423.0,
      "Time_End": 427.0,
      "Text": " It's a very simple protocol. That's one of the reasons why it works so well. Because they've"
    },
    {
      "Time_Start": 427.0,
      "Time_End": 431.0,
      "Text": " designed it pretty robustly and it works on a variety of systems. We've used it a few times"
    },
    {
      "Time_Start": 431.0,
      "Time_End": 436.0,
      "Text": " and I'll say where you use it in a little bit here. Actually, right now. Why tunnel?"
    },
    {
      "Time_Start": 436.0,
      "Time_End": 441.0,
      "Text": " One of the reasons is you have a static link program without source. Some of them expect a"
    },
    {
      "Time_Start": 441.0,
      "Time_End": 445.0,
      "Text": " certain port and you cannot give them that port. Example being if you have a web server that"
    },
    {
      "Time_Start": 445.0,
      "Time_End": 450.0,
      "Text": " only will work on port 80 and you have to move to 8080 for some various reason, you can use"
    },
    {
      "Time_Start": 450.0,
      "Time_End": 455.0,
      "Text": " this to do a shift of it. Another reason is you have limited access to the outside world. A"
    },
    {
      "Time_Start": 455.0,
      "Time_End": 462.0,
      "Text": " lot of times if you're using a connection like AltaVista, it won't give you port 25 for SMTP."
    },
    {
      "Time_Start": 462.0,
      "Time_End": 467.0,
      "Text": " It will give you port 80. You can use this to send stuff remotely. And of course the third"
    },
    {
      "Time_Start": 467.0,
      "Time_End": 473.0,
      "Text": " reason is evil system administrators trying to hold you back. The question is how do you"
    },
    {
      "Time_Start": 473.0,
      "Time_End": 478.0,
      "Text": " combat tunneling? The first thing is sniffers work great. Because nothing tends to deter people"
    },
    {
      "Time_Start": 478.0,
      "Time_End": 482.0,
      "Text": " more than seeing a dump of all their passwords and account names on their desk in the morning."
    },
    {
      "Time_Start": 482.0,
      "Time_End": 486.0,
      "Text": " If they're stupid enough to use a tunnel program and you told them not to, they're probably"
    },
    {
      "Time_Start": 486.0,
      "Time_End": 490.0,
      "Text": " stupid enough to use something that sends stuff in clear text. Another thing is look for"
    },
    {
      "Time_Start": 490.0,
      "Time_End": 495.0,
      "Text": " tunneling software. If you use the source for HTTP tunnel, there are certain signatures you can"
    },
    {
      "Time_Start": 495.0,
      "Time_End": 500.0,
      "Text": " find in it right now. As the saying goes, use the source, Luke. Another way to do it is"
    },
    {
      "Time_Start": 500.0,
      "Time_End": 504.0,
      "Text": " policy. Explain the security problem someone could be opening up. Obviously an example"
    },
    {
      "Time_Start": 504.0,
      "Time_End": 509.0,
      "Text": " being here that it's great going out, but we could also do this somehow getting in. I could"
    },
    {
      "Time_Start": 509.0,
      "Time_End": 514.0,
      "Text": " open a port that's a very high number and no one would even ‑‑ like above 1024 and it"
    },
    {
      "Time_Start": 514.0,
      "Time_End": 519.0,
      "Text": " would allow that stuff in. I could shift that to some other part of the machine. And the"
    },
    {
      "Time_Start": 519.0,
      "Time_End": 524.0,
      "Text": " other way to really combat tunneling is education. Ask why people are using tunneling software."
    },
    {
      "Time_Start": 524.0,
      "Time_End": 529.0,
      "Text": " Can you help them remove the need for it? Like by installing a socks proxy or something."
    },
    {
      "Time_Start": 529.0,
      "Time_End": 534.0,
      "Text": " There's an old story about Patton when he was at West Point. He was part of the ‑‑"
    },
    {
      "Time_Start": 534.0,
      "Time_End": 539.0,
      "Text": " he wasn't part of the faculty. He was a student, part of the student government. And he was"
    },
    {
      "Time_Start": 539.0,
      "Time_End": 543.0,
      "Text": " asked what they could do about people walking on the grass all the time. His response was,"
    },
    {
      "Time_Start": 543.0,
      "Time_End": 547.0,
      "Text": " well, put sidewalks where people are walking. This is the same idea. If they're using the"
    },
    {
      "Time_Start": 547.0,
      "Time_End": 551.0,
      "Text": " tunneling software, usually they have a reason for it besides just to be dicks. The answer"
    },
    {
      "Time_Start": 551.0,
      "Time_End": 556.0,
      "Text": " is to help find out what that problem is and help them find a solution for it."
    },
    {
      "Time_Start": 556.0,
      "Time_End": 560.0,
      "Text": " What's the future HTTP tunnel? They've got a bunch of things on their to‑do list. These"
    },
    {
      "Time_Start": 560.0,
      "Time_End": 564.0,
      "Text": " are the ones I thought were most important. They're going to add SSL encryption someday."
    },
    {
      "Time_Start": 564.0,
      "Time_End": 568.0,
      "Text": " They're waiting until after September 20th when the RSA patent expires and they also"
    },
    {
      "Time_Start": 568.0,
      "Time_End": 572.0,
      "Text": " have to deal with the export restrictions which not a lot of people are thrilled with."
    },
    {
      "Time_Start": 572.0,
      "Time_End": 577.0,
      "Text": " Data compression. There's a version of it out there that uses Zlib, but it has some issues."
    },
    {
      "Time_Start": 577.0,
      "Time_End": 585.0,
      "Text": " You're always padding the entries out with HTTP headers which can be quite wasteful."
    },
    {
      "Time_Start": 587.0,
      "Time_End": 591.0,
      "Text": " They're also trying to extend it so it can work with other protocols like FTP. Their"
    },
    {
      "Time_Start": 591.0,
      "Time_End": 595.0,
      "Text": " goal eventually is to be able to call it XTP tunnel and be able to use any transport, use"
    },
    {
      "Time_Start": 595.0,
      "Time_End": 599.0,
      "Text": " Telnet, anything to do it. They're working on that. It's still very early, but it's going"
    },
    {
      "Time_Start": 599.0,
      "Time_End": 602.0,
      "Text": " to really change the way it works because it's going to make it very hard to detect"
    },
    {
      "Time_Start": 602.0,
      "Time_End": 606.0,
      "Text": " and stop. And the other way they're trying to do it is they're trying to add this now,"
    },
    {
      "Time_Start": 606.0,
      "Time_End": 610.0,
      "Text": " simple encoding of red trivial sniffing. Now they're at 13, but a little bit more advanced"
    },
    {
      "Time_Start": 610.0,
      "Time_End": 615.0,
      "Text": " than that. They're trying to add some random‑type signatures to it."
    },
    {
      "Time_Start": 615.0,
      "Time_End": 620.0,
      "Text": " Tunneling is a very valuable tool. We've used it a little bit here and there because it's"
    },
    {
      "Time_Start": 620.0,
      "Time_End": 625.0,
      "Text": " helped us in certain situations where we need to use it. Tunneling can also bypass security"
    },
    {
      "Time_Start": 626.0,
      "Time_End": 631.0,
      "Text": " measures. That's probably the biggest single problem with tunneling. It can bypass any"
    },
    {
      "Time_Start": 631.0,
      "Time_End": 636.0,
      "Text": " firewall you have if you set it up correctly. Because you're creating a virtual path and"
    },
    {
      "Time_Start": 636.0,
      "Time_End": 641.0,
      "Text": " whatever you're adding on top of that is up to the user. What you're doing is you're hiding"
    },
    {
      "Time_Start": 641.0,
      "Time_End": 647.0,
      "Text": " the data inside a more acceptable protocol. And education and training are pretty much"
    },
    {
      "Time_Start": 647.0,
      "Time_End": 652.0,
      "Text": " the best defense. The main links for it is GNU HTTP tunnels"
    },
    {
      "Time_Start": 652.0,
      "Time_End": 656.0,
      "Text": " website and the firewall piercing mini how to. You can find either one of these just"
    },
    {
      "Time_Start": 656.0,
      "Time_End": 662.0,
      "Text": " by doing a search in Google without any problems. The first question anyone always asks me is,"
    },
    {
      "Time_Start": 662.0,
      "Time_End": 666.0,
      "Text": " is there a Windows version of it? And the answer is yes, there is. It runs under the"
    },
    {
      "Time_Start": 666.0,
      "Time_End": 671.0,
      "Text": " Cygnus SIGWIN toolkit. The other question I usually ask is, is there a Macintosh version"
    },
    {
      "Time_Start": 671.0,
      "Time_End": 677.0,
      "Text": " of it? And no, there's not. It will run on Mac OS X server edition, but it hasn't been"
    },
    {
      "Time_Start": 677.0,
      "Time_End": 680.0,
      "Text": " officially ported yet. There's also ‑‑ it works on pretty much any standard version"
    },
    {
      "Time_Start": 680.0,
      "Time_End": 685.0,
      "Text": " of Unix like FreeBSD or Solaris or any of the standard ones."
    },
    {
      "Time_Start": 685.0,
      "Time_End": 694.0,
      "Text": " The third question I usually get asked is ‑‑ hang on a sec. Oh, will it run on a web server?"
    },
    {
      "Time_Start": 694.0,
      "Time_End": 699.0,
      "Text": " Since I overloaded port 80 on this, will this work concurrently with a web server? Right"
    },
    {
      "Time_Start": 699.0,
      "Time_End": 703.0,
      "Text": " now, not. But they are working on that as well. But we're not sure how that's going"
    },
    {
      "Time_Start": 703.0,
      "Time_End": 707.0,
      "Text": " to work because we're going to have to override the way the behavior happens a bit right now"
    },
    {
      "Time_Start": 707.0,
      "Time_End": 712.0,
      "Text": " because it has one session on both sides. Meanwhile, the web server will fork off multiple"
    },
    {
      "Time_Start": 712.0,
      "Time_End": 718.0,
      "Text": " copies to handle that. But they're working on that piece. Any other questions?"
    },
    {
      "Time_Start": 718.0,
      "Time_End": 720.0,
      "Text": " Sure."
    },
    {
      "Time_Start": 726.0,
      "Time_End": 728.0,
      "Text": " Does it work through what, sir?"
    },
    {
      "Time_Start": 730.0,
      "Time_End": 736.0,
      "Text": " It works through network address and translation. It will work through all that if you can get"
    },
    {
      "Time_Start": 736.0,
      "Time_End": 739.0,
      "Text": " a direct path back to it. If you're doing real masquerading, no, because it doesn't"
    },
    {
      "Time_Start": 739.0,
      "Time_End": 743.0,
      "Text": " have a path back. It will work outgoing, of course, but coming back, it won't work into"
    },
    {
      "Time_Start": 743.0,
      "Time_End": 746.0,
      "Text": " it. So that's one of the first steps of defense of it."
    },
    {
      "Time_Start": 750.0,
      "Time_End": 754.0,
      "Text": " It's actually ‑‑ that's what it's designed for. There's some options that will go through"
    },
    {
      "Time_Start": 754.0,
      "Time_End": 758.0,
      "Text": " like any standard proxy. Sometimes you have to figure out the real port the proxy exists"
    },
    {
      "Time_Start": 758.0,
      "Time_End": 763.0,
      "Text": " at. And the FAQ has the instructions for doing that. I don't have a proxy set up on this"
    },
    {
      "Time_Start": 763.0,
      "Time_End": 767.0,
      "Text": " one, but it does work with squid and all the standard ones I've seen."
    },
    {
      "Time_Start": 779.0,
      "Time_End": 784.0,
      "Text": " Yes, it is. If you send it in clear text, you're asking for it. What you do is you run"
    },
    {
      "Time_Start": 784.0,
      "Time_End": 789.0,
      "Text": " a more secure protocol on top of it like SSH if you want to protect your stuff. It might"
    },
    {
      "Time_Start": 789.0,
      "Time_End": 794.0,
      "Text": " show up with some basic encoding on it, like if you've got spaces in your password, which"
    },
    {
      "Time_Start": 794.0,
      "Time_End": 800.0,
      "Text": " I do and most people should, it will escape those. But the password is pretty trivial"
    },
    {
      "Time_Start": 800.0,
      "Time_End": 805.0,
      "Text": " to figure out. This is a great tool to use, but make sure you use something secure on"
    },
    {
      "Time_Start": 805.0,
      "Time_End": 812.0,
      "Text": " top of it like SCFDP or SSH and stuff like that to give you an additional level of stuff."
    },
    {
      "Time_Start": 813.0,
      "Time_End": 815.0,
      "Text": " Yes?"
    },
    {
      "Time_Start": 818.0,
      "Time_End": 822.0,
      "Text": " If you're going through a proxy, does anything end up in the cache? Yes, it does. They've"
    },
    {
      "Time_Start": 822.0,
      "Time_End": 829.0,
      "Text": " added a fix in 303 that has a random ID to the end of it so it does not have the same"
    },
    {
      "Time_Start": 829.0,
      "Time_End": 835.0,
      "Text": " entry. So you can have like my first command has got certain trailing information on it."
    },
    {
      "Time_Start": 835.0,
      "Time_End": 839.0,
      "Text": " My second will have another random number and so on and so forth. So you'll have a lot"
    },
    {
      "Time_Start": 839.0,
      "Time_End": 843.0,
      "Text": " of random entries in the cache, but each one will be unique so you won't have a replay"
    },
    {
      "Time_Start": 843.0,
      "Time_End": 848.0,
      "Text": " problem. It would be really tough to play back the session."
    },
    {
      "Time_Start": 856.0,
      "Time_End": 862.0,
      "Text": " The question is could you run across an entire session in the cache? Yes. If you've got your"
    },
    {
      "Time_Start": 862.0,
      "Time_End": 867.0,
      "Text": " proxy turned on or you've got your proxy caching or logging everything, it's going to do a"
    },
    {
      "Time_Start": 867.0,
      "Time_End": 873.0,
      "Text": " straight dump of the session. So do not use this with Telnet. That's rule number one."
    },
    {
      "Time_Start": 878.0,
      "Time_End": 884.0,
      "Text": " Yes, it actually does encapsulate it in real HTTP. It does comply with 3L standard."
    },
    {
      "Time_Start": 884.0,
      "Time_End": 894.0,
      "Text": " Could you repeat the last part?"
    },
    {
      "Time_Start": 898.0,
      "Time_End": 902.0,
      "Text": " It will be seen as ordinary web traffic for the most part, but there will be certain signs"
    },
    {
      "Time_Start": 902.0,
      "Time_End": 906.0,
      "Text": " that you can see if you know what to look for because it does use certain identifiers in a"
    },
    {
      "Time_Start": 906.0,
      "Time_End": 911.0,
      "Text": " different way than the other piece, than regular like Netscape tends to do things. But it's"
    },
    {
      "Time_Start": 911.0,
      "Time_End": 915.0,
      "Text": " kind of hard to find, but you can go through a log if you know what to look for. They're"
    },
    {
      "Time_Start": 915.0,
      "Time_End": 919.0,
      "Text": " working on adding that. That's what the simple encoding they're trying to do to make it look"
    },
    {
      "Time_Start": 919.0,
      "Time_End": 922.0,
      "Text": " more like a Netscape session or something else."
    },
    {
      "Time_Start": 932.0,
      "Time_End": 936.0,
      "Text": " You can't. That's the problem. The answer to the question is can you prevent it from getting"
    },
    {
      "Time_Start": 936.0,
      "Time_End": 940.0,
      "Text": " through a firewall? If you open up any port, you can use software like this to get through"
    },
    {
      "Time_Start": 940.0,
      "Time_End": 946.0,
      "Text": " the firewall. You can do that. Some things like network isolation to make it tougher to get"
    },
    {
      "Time_Start": 946.0,
      "Time_End": 951.0,
      "Text": " so they can't open something inside your local net. But to get out, you can't stop it. You can"
    },
    {
      "Time_Start": 951.0,
      "Time_End": 956.0,
      "Text": " also use this to go out, hit other sites. Actually, you can use your home machine, set up"
    },
    {
      "Time_Start": 956.0,
      "Time_End": 961.0,
      "Text": " Netscape session on that, send the X window stuff through and browse all the porn you want to"
    },
    {
      "Time_Start": 961.0,
      "Time_End": 966.0,
      "Text": " while you're at work in regards to how they block stuff. I'm not saying you would, but some"
    },
    {
      "Time_Start": 966.0,
      "Time_End": 968.0,
      "Text": " people do."
    },
    {
      "Time_Start": 974.0,
      "Time_End": 980.0,
      "Text": " Here's the question about the performance. The performance can suck. It's encapsulating"
    },
    {
      "Time_Start": 980.0,
      "Time_End": 986.0,
      "Text": " every single command inside an HTTP header. The secret to this is have a good connection."
    },
    {
      "Time_Start": 986.0,
      "Time_End": 990.0,
      "Text": " If I didn't have a cable modem, I probably wouldn't try it. Also, the question is what you're"
    },
    {
      "Time_Start": 990.0,
      "Time_End": 995.0,
      "Text": " sending across it. When we send X across it, unless you're using compression options inside"
    },
    {
      "Time_Start": 995.0,
      "Time_End": 999.0,
      "Text": " the later versions of X, you are going to be paying a lot because it sends everything back"
    },
    {
      "Time_Start": 999.0,
      "Time_End": 1003.0,
      "Text": " and forth. This is a unique packet. Yes, sir?"
    },
    {
      "Time_Start": 1010.0,
      "Time_End": 1015.0,
      "Text": " The question is have I tried to use delegate SSL proxies, so just using regular HTTP proxies."
    },
    {
      "Time_Start": 1015.0,
      "Time_End": 1020.0,
      "Text": " The answer is no, I haven't yet. They probably have done it at this site. They do have a mailing"
    },
    {
      "Time_Start": 1020.0,
      "Time_End": 1022.0,
      "Text": " list and it's pretty good."
    },
    {
      "Time_Start": 1025.0,
      "Time_End": 1029.0,
      "Text": " Actually, if you use something that would do compression, that's where they were looking"
    },
    {
      "Time_Start": 1029.0,
      "Time_End": 1035.0,
      "Text": " to add Zlib to it to help improve the performance on it quite a bit. Way back there."
    },
    {
      "Time_Start": 1050.0,
      "Time_End": 1077.0,
      "Text": " The question is, to make it much shorter, can you use this with something like a Java"
    },
    {
      "Time_Start": 1078.0,
      "Time_End": 1083.0,
      "Text": " app to move stuff around in terms of ports? Yes, you can, but the question is with the"
    },
    {
      "Time_Start": 1083.0,
      "Time_End": 1086.0,
      "Text": " performance issues of it, I don't think it would really be that useful. You can obviously"
    },
    {
      "Time_Start": 1086.0,
      "Time_End": 1090.0,
      "Text": " take a look at the source. It is open source, so they can do license. Some of the pieces"
    },
    {
      "Time_Start": 1090.0,
      "Time_End": 1095.0,
      "Text": " there are very good. There's also more generic port forwarding tools like LeapFrog, which"
    },
    {
      "Time_Start": 1095.0,
      "Time_End": 1102.0,
      "Text": " you might want to take a look at because that will do some of that work. You can hit www.coste.com"
    },
    {
      "Time_Start": 1103.0,
      "Time_End": 1109.0,
      "Text": " or do what I do and hit Google and do LeapFrog search. Any more questions? Yes, sir."
    },
    {
      "Time_Start": 1116.0,
      "Time_End": 1120.0,
      "Text": " That's a very good question. What happens if you have open port 80 on your home computer?"
    },
    {
      "Time_Start": 1120.0,
      "Time_End": 1128.0,
      "Text": " You can bind what port that can connect to. If you do something like SSH, you can only"
    },
    {
      "Time_Start": 1128.0,
      "Time_End": 1133.0,
      "Text": " do it so it can hit that SSH port. There's basically port forwarding on this end."
    },
    {
      "Time_Start": 1143.0,
      "Time_End": 1150.0,
      "Text": " Your host.allow will launch. No, actually, just tell me it uses that. SSH has its own"
    },
    {
      "Time_Start": 1150.0,
      "Time_End": 1157.0,
      "Text": " configuration utility. Yes, you can use that in that situation."
    },
    {
      "Time_Start": 1173.0,
      "Time_End": 1179.0,
      "Text": " The question is can you use this as a proxy to send requests out to your home machine"
    },
    {
      "Time_Start": 1179.0,
      "Time_End": 1184.0,
      "Text": " and have that do the surfing for you? I haven't done that. It may be possible. What I've done"
    },
    {
      "Time_Start": 1184.0,
      "Time_End": 1189.0,
      "Text": " is I've run X across it and brought up a Netscape from my home machine. It was quite slow, but"
    },
    {
      "Time_Start": 1189.0,
      "Time_End": 1191.0,
      "Text": " it did work."
    },
    {
      "Time_Start": 1202.0,
      "Time_End": 1207.0,
      "Text": " Probably not because of the overhead of sending back all the stuff. It worked better than"
    },
    {
      "Time_Start": 1207.0,
      "Time_End": 1212.0,
      "Text": " doing it the way I was doing it running X where it sends every pixel back to you. I'm not"
    },
    {
      "Time_Start": 1212.0,
      "Time_End": 1216.0,
      "Text": " exactly sure how the performance of that would work using it that way. It's a great question"
    },
    {
      "Time_Start": 1216.0,
      "Time_End": 1220.0,
      "Text": " to ask on the mailing list. They're a pretty active group. They're up to version 303 now"
    },
    {
      "Time_Start": 1220.0,
      "Time_End": 1224.0,
      "Text": " and they're getting ready to release 304. They'd love some help getting it up to spec"
    },
    {
      "Time_Start": 1224.0,
      "Time_End": 1226.0,
      "Text": " where they want it to go in a couple of areas."
    },
    {
      "Time_Start": 1238.0,
      "Time_End": 1243.0,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 1243.0,
      "Time_End": 1250.0,
      "Text": " The main purpose of this is to help educate people. A firewall will not stop all your"
    },
    {
      "Time_Start": 1250.0,
      "Time_End": 1254.0,
      "Text": " problems. It's a great first step, but you also have to understand what the firewall"
    },
    {
      "Time_Start": 1254.0,
      "Time_End": 1259.0,
      "Text": " does and doesn't allow. That's just a part of the process of learning what it does do,"
    },
    {
      "Time_Start": 1259.0,
      "Time_End": 1263.0,
      "Text": " keeping in touch with your users. If you do put up walls high enough against your user,"
    },
    {
      "Time_Start": 1264.0,
      "Time_End": 1268.0,
      "Text": " they will find ways around them. They always have and they always will. Thank you very"
    },
    {
      "Time_Start": 1268.0,
      "Time_End": 1270.0,
      "Text": " much."
    }
  ]
}