{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 18.96,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Okay. What I do is I do a lot of vulnerability analysis on NT. We've done penetration testing"
    },
    {
      "Time_Start": 18.96,
      "Time_End": 29.88,
      "Text": " on NT. On a variety of government firms. Basically what this is for is for the sysadmins or security"
    },
    {
      "Time_Start": 29.88,
      "Time_End": 34.4,
      "Text": " type people. And it's also for the newbie hacker who wants to learn a little bit more"
    },
    {
      "Time_Start": 34.4,
      "Time_End": 42.0,
      "Text": " about your system. So as I'm giving this information out, this is not only for them. They're probably"
    },
    {
      "Time_Start": 42.0,
      "Time_End": 47.519999999999996,
      "Text": " going to be paying more attention than you are as a sysadmin. This is Mr. Nasty, which"
    },
    {
      "Time_Start": 47.519999999999996,
      "Time_End": 56.519999999999996,
      "Text": " is me. Don't I look like that? The arms and everything, huh? Okay. And basically what"
    },
    {
      "Time_Start": 56.52,
      "Time_End": 61.36,
      "Text": " we're going to do is we're using a free tool. It's a free tool called dump ACL. Anybody"
    },
    {
      "Time_Start": 61.36,
      "Time_End": 66.52000000000001,
      "Text": " use dump ACL? You probably have it on your system somewhere. It's in a little bitty folder"
    },
    {
      "Time_Start": 66.52000000000001,
      "Time_End": 72.84,
      "Text": " up there called dump ACL. Nobody ever really uses it. They just have it out there. We've"
    },
    {
      "Time_Start": 72.84,
      "Time_End": 77.56,
      "Text": " exploited so many systems using that particular tool because we can go out and dump your ACL"
    },
    {
      "Time_Start": 77.56,
      "Time_End": 86.04,
      "Text": " list and look at everything that's out there. On your machine. And these are like seriously"
    },
    {
      "Time_Start": 86.04,
      "Time_End": 93.2,
      "Text": " poorly configured machines that are out there. Let me go in. Basically what this is, this"
    },
    {
      "Time_Start": 93.2,
      "Time_End": 97.28,
      "Text": " is pretty much the application here that you can see. And this is where to get it. And"
    },
    {
      "Time_Start": 97.28,
      "Time_End": 101.0,
      "Text": " this is where to e‑mail me if you really want to ask me another question about this"
    },
    {
      "Time_Start": 101.0,
      "Time_End": 108.2,
      "Text": " or anything. Pretty much what I ‑‑ I have an agenda here and pretty much a cause. And"
    },
    {
      "Time_Start": 108.2,
      "Time_End": 114.28,
      "Text": " I will explain something to you. A lot of you sysadmins who work in areas where you"
    },
    {
      "Time_Start": 114.28,
      "Time_End": 121.72,
      "Text": " have people who want to stand above the policy. Can you guys hear me okay? You can hear me"
    },
    {
      "Time_Start": 121.72,
      "Time_End": 127.24000000000001,
      "Text": " fine? It's people who want to stand above the policy. And I'm going to point out two"
    },
    {
      "Time_Start": 127.24000000000001,
      "Time_End": 132.48,
      "Text": " critical individuals. Because there were two here yesterday in the Haxor track. And they"
    },
    {
      "Time_Start": 132.48,
      "Time_End": 137.88,
      "Text": " were attorneys. One of them is attorneys. And the other one is doctors. These people"
    },
    {
      "Time_Start": 137.88,
      "Time_End": 143.72,
      "Text": " want to ride above your policy. Your policies say that you need to have stronger passwords."
    },
    {
      "Time_Start": 143.72,
      "Time_End": 148.88,
      "Text": " But doctors feel above the law and they feel like they don't need to have stronger passwords."
    },
    {
      "Time_Start": 148.88,
      "Time_End": 152.28,
      "Text": " Because they need to have access to all these systems. We've been in the hospitals where"
    },
    {
      "Time_Start": 152.28,
      "Time_End": 157.44,
      "Text": " we could go in and see a doctor logged on five different computers and he's not even"
    },
    {
      "Time_Start": 157.44,
      "Time_End": 163.56,
      "Text": " there. But he's got all this information open. What does that have to do with this? If you"
    },
    {
      "Time_Start": 163.56,
      "Time_End": 167.72,
      "Text": " go and look at his password, it's probably a four digit password and it's probably his"
    },
    {
      "Time_Start": 167.72,
      "Time_End": 175.12,
      "Text": " dog's name or something. Okay? But when we've gone in and we've told security officers"
    },
    {
      "Time_Start": 175.12,
      "Time_End": 179.32,
      "Text": " you need to just shut him down. The security officer will tell us well we've done that."
    },
    {
      "Time_Start": 179.32,
      "Time_End": 186.56,
      "Text": " We've gone over and we've shut down the machine. That doctor goes over to the chief of surgery"
    },
    {
      "Time_Start": 186.56,
      "Time_End": 194.16,
      "Text": " and he'll complain. And guess who gets in trouble? The security officer. He gets his"
    },
    {
      "Time_Start": 194.16,
      "Time_End": 202.2,
      "Text": " butt ringed for doing his job but the doctor gets away with it. Now, what better way as"
    },
    {
      "Time_Start": 202.2,
      "Time_End": 208.24,
      "Text": " a hacker, okay this is just some more information on dump ACO. I don't like to read from slides."
    },
    {
      "Time_Start": 208.24,
      "Time_End": 212.48,
      "Text": " Would you guys rather me read from slides? I could read from slides and it would bore"
    },
    {
      "Time_Start": 212.48,
      "Time_End": 219.2,
      "Text": " the death out of you. I'm not going to say any four letter words. I wanted to. I really"
    },
    {
      "Time_Start": 219.20000000000002,
      "Time_End": 229.92000000000002,
      "Text": " did. Oh, this works on Windows 2000. It does. It works wonderfully on Windows 2000. If"
    },
    {
      "Time_Start": 229.92000000000002,
      "Time_End": 236.24,
      "Text": " you go over to their website, somarosoft.com, he's got a whole bunch of information over"
    },
    {
      "Time_Start": 236.24,
      "Time_End": 240.60000000000002,
      "Text": " there. You know he's from a little bitty town in South Texas. I couldn't believe that. I"
    },
    {
      "Time_Start": 240.6,
      "Time_End": 249.6,
      "Text": " would expect him to be from Silicon Valley or Boston or something. Okay, I'm kind of"
    },
    {
      "Time_Start": 249.6,
      "Time_End": 253.6,
      "Text": " nervous so I'm going to go on a little bit of a rant and more information. Yeah, go ahead."
    },
    {
      "Time_Start": 253.6,
      "Time_End": 261.88,
      "Text": " Password, passfeld.dll. Right, you could run passfeld.dll but you can override passfeld.dll."
    },
    {
      "Time_Start": 261.88,
      "Time_End": 268.15999999999997,
      "Text": " I mean that is not the silver bullet to this problem. That's right, you could do that and"
    },
    {
      "Time_Start": 268.16,
      "Time_End": 271.56,
      "Text": " you could set that up in your policies and that's very good to do. But then if you have a"
    },
    {
      "Time_Start": 271.56,
      "Time_End": 275.52000000000004,
      "Text": " doctor that comes in and says, hey, I can't remember all of those funky digits and you"
    },
    {
      "Time_Start": 275.52000000000004,
      "Time_End": 278.64000000000004,
      "Text": " better take them off because if you don't take them off, I'm going to get the chief of"
    },
    {
      "Time_Start": 278.64000000000004,
      "Time_End": 282.36,
      "Text": " surgery to come down and he's going to crawl down your rear end and the chief of surgery is"
    },
    {
      "Time_Start": 282.36,
      "Time_End": 285.72,
      "Text": " going to go over and he's going to throw policy at you and say, you know what, take that"
    },
    {
      "Time_Start": 285.72,
      "Time_End": 290.92,
      "Text": " stuff off of the system. So where did you go? I mean, where did you get from that? My point"
    },
    {
      "Time_Start": 290.92,
      "Time_End": 295.36,
      "Text": " is, my point is, and to any newbie hacker out there, don't identify yourself, I don't care"
    },
    {
      "Time_Start": 295.36,
      "Time_End": 301.36,
      "Text": " who you are. To any newbie hacker out there, you know, stop the DDoS attacks and the"
    },
    {
      "Time_Start": 301.36,
      "Time_End": 305.52000000000004,
      "Text": " buffer overflow stuff. I mean, those are good to get in what you need to, okay? Into the"
    },
    {
      "Time_Start": 305.52000000000004,
      "Time_End": 310.64,
      "Text": " NT systems and probably shut down one to get into another because it's probably blocked by"
    },
    {
      "Time_Start": 310.64,
      "Time_End": 315.72,
      "Text": " some kind of firewall that's not an NT box, it's probably some Solaris box or something like"
    },
    {
      "Time_Start": 315.72,
      "Time_End": 320.0,
      "Text": " that out there. But then once you get in the NT machine, don't go over there and set up, you"
    },
    {
      "Time_Start": 320.0,
      "Time_End": 325.16,
      "Text": " know, an IRC channel or something stupid that they can track you, you know? I mean, that's"
    },
    {
      "Time_Start": 325.16,
      "Time_End": 329.0,
      "Text": " ridiculous, you know? Do something good. If you're going to go to jail, which you probably"
    },
    {
      "Time_Start": 329.0,
      "Time_End": 333.16,
      "Text": " will, you know, you might as well come out, you might as well come out with a little honeypot,"
    },
    {
      "Time_Start": 333.16,
      "Time_End": 341.16,
      "Text": " right? Of your own, right? A couple of $10,000 or whatever. How do you do that? Well, use"
    },
    {
      "Time_Start": 341.16,
      "Time_End": 347.04,
      "Text": " your imagination a little bit. Doctor's information is privacy, period. That's all I'll say,"
    },
    {
      "Time_Start": 347.04,
      "Time_End": 355.04,
      "Text": " okay? You heard what the limit was with the lawyers. What was it, $5,000? So what, $4,900?"
    },
    {
      "Time_Start": 355.04,
      "Time_End": 367.04,
      "Text": " $799.99? And there's, right? Somebody got the joke. Okay. All right. What you do is, when"
    },
    {
      "Time_Start": 367.04,
      "Time_End": 372.04,
      "Text": " you go into dump ACL in your permission reports, you want to get a lot of information off of"
    },
    {
      "Time_Start": 372.04,
      "Time_End": 377.04,
      "Text": " your system so that you can see how it's set up, all right? This is good for you new system"
    },
    {
      "Time_Start": 377.04,
      "Time_End": 381.04,
      "Text": " admins, this is good for you people who are taking over a new machine, you know, all of a"
    },
    {
      "Time_Start": 381.04,
      "Time_End": 385.04,
      "Text": " sudden the director goes over, or whoever is in charge, and says, okay, now you're in"
    },
    {
      "Time_Start": 385.04,
      "Time_End": 389.04,
      "Text": " charge of this box, you have no clue what's going on with it. So this is a good thing"
    },
    {
      "Time_Start": 389.04,
      "Time_End": 394.04,
      "Text": " to run when you first initially get there. If you put this on your machines, I suggest"
    },
    {
      "Time_Start": 394.04,
      "Time_End": 402.04,
      "Text": " you limit the permissions to only yourself. And again, this is a good reason to have a"
    },
    {
      "Time_Start": 402.04,
      "Time_End": 409.04,
      "Text": " security officer besides the sysadmin. Sysadmin's got too many other jobs to do. For instance,"
    },
    {
      "Time_Start": 409.04,
      "Time_End": 415.04,
      "Text": " hey, I don't want to go off on a rant here, but, you know, sysadmin's got a lot of work"
    },
    {
      "Time_Start": 415.04,
      "Time_End": 419.04,
      "Text": " to do. You guys are fixing printer problems, and people can't get their monitor up, and"
    },
    {
      "Time_Start": 419.04,
      "Time_End": 422.04,
      "Text": " they can't get their stuff running. I had a guy one time run into the office, he was"
    },
    {
      "Time_Start": 422.04,
      "Time_End": 427.04,
      "Text": " just scared to death. He had pulled up a document on the Word, and he was like, I can't get"
    },
    {
      "Time_Start": 427.04,
      "Time_End": 431.04,
      "Text": " my Word document, I can see it on the screen, but I just can't, I mean, I know it's up there"
    },
    {
      "Time_Start": 431.04,
      "Time_End": 436.04,
      "Text": " because I can see the header up here. How come I can't get to my Word document? I went over"
    },
    {
      "Time_Start": 436.04,
      "Time_End": 440.04,
      "Text": " to his desk, and sure enough, there was a Word document, he had a white background,"
    },
    {
      "Time_Start": 440.04,
      "Time_End": 445.04,
      "Text": " and I could move the cursor around as if it was going through a document. It was like"
    },
    {
      "Time_Start": 445.04,
      "Time_End": 455.04,
      "Text": " 15, 20 pages. I said, did you just change your font to white? He said, yeah, uh-huh."
    },
    {
      "Time_Start": 455.04,
      "Time_End": 464.04,
      "Text": " I said, what color is your background? He said, white. I said, you don't get it yet?"
    },
    {
      "Time_Start": 464.04,
      "Time_End": 468.04,
      "Text": " So, I mean, those are the problems that you guys are dealing with, right? I mean, you're"
    },
    {
      "Time_Start": 468.04,
      "Time_End": 474.04,
      "Text": " dealing with a lot of brain-dead type of losers out there, right? They have no idea. Their"
    },
    {
      "Time_Start": 474.04,
      "Time_End": 479.04,
      "Text": " job is 8 to 5. It's not these guys who are sleeping on the floor at night, you know,"
    },
    {
      "Time_Start": 479.04,
      "Time_End": 483.04,
      "Text": " waiting for the hacker to come in, the Uber hackers to come in, all right?"
    },
    {
      "Time_Start": 483.04,
      "Time_End": 487.04,
      "Text": " All right. This is a report view. This is all the information that you can get off of"
    },
    {
      "Time_Start": 488.04,
      "Time_End": 498.04,
      "Text": " I only have half a screen? It's a Pentium 2. Okay. So this is the report. Can you guys"
    },
    {
      "Time_Start": 498.04,
      "Time_End": 506.04,
      "Text": " see that okay over there? Probably not, right? Yeah, believe me. I'll put it on the DEF CON"
    },
    {
      "Time_Start": 506.04,
      "Time_End": 514.04,
      "Text": " place when I get home, not while I'm here. Anyway, this is a report view. This is the"
    },
    {
      "Time_Start": 514.04,
      "Time_End": 518.04,
      "Text": " type of information that you can't get out of it. Remember, if you're running a really"
    },
    {
      "Time_Start": 518.04,
      "Time_End": 523.04,
      "Text": " big system, you know, you guys have 5,000 or more users on your system, this is going"
    },
    {
      "Time_Start": 523.04,
      "Time_End": 527.04,
      "Text": " to take a little while. You can run it remotely. You don't have to run it on the server, so"
    },
    {
      "Time_Start": 527.04,
      "Time_End": 533.04,
      "Text": " it doesn't take up so much CPU energy. Yes? Yeah. Oh, yeah, by the way, it's free. The"
    },
    {
      "Time_Start": 533.04,
      "Time_End": 539.04,
      "Text": " question was, is this free? Yes, it is free. Right now it is free. So if you go out to"
    },
    {
      "Time_Start": 539.04,
      "Time_End": 547.04,
      "Text": " that site, you can get it for free, okay? So I don't work for them. I just use the tool."
    },
    {
      "Time_Start": 547.04,
      "Time_End": 565.04,
      "Text": " Pardon me? URL. Same to you. What's the URL? The URL is www.Somarsoft.com. S-O-M-A-R-S-O-F-T.com."
    },
    {
      "Time_Start": 566.04,
      "Time_End": 574.04,
      "Text": " S-O-M-A-R-S-O-F-T.com. It's on each one of my slides. Okay? It will be on each one of"
    },
    {
      "Time_Start": 574.04,
      "Time_End": 580.04,
      "Text": " the slides. Believe me. Okay. This way, since you can run it remotely, this is just to prove"
    },
    {
      "Time_Start": 580.04,
      "Time_End": 583.04,
      "Text": " that you can run it remotely. All you have to do is just type in the slash slash and"
    },
    {
      "Time_Start": 583.04,
      "Time_End": 588.04,
      "Text": " the computer name and it will just ‑‑ what is it, UNC? You can type in UNC or you can"
    },
    {
      "Time_Start": 588.04,
      "Time_End": 593.04,
      "Text": " type in the IP address of the other computer and you can run it. Now, because it can be"
    },
    {
      "Time_Start": 593.04,
      "Time_End": 598.04,
      "Text": " run remotely, somebody can probably run it on your machine. I mean, on big networks that"
    },
    {
      "Time_Start": 598.04,
      "Time_End": 602.04,
      "Text": " we've run, you just get it on the client side, you go in and establish a null session, boom,"
    },
    {
      "Time_Start": 602.04,
      "Time_End": 610.04,
      "Text": " you're in. You can start downloading the ACL from there. And I'll address that in a second."
    },
    {
      "Time_Start": 610.04,
      "Time_End": 617.04,
      "Text": " Pretty much these are the different categories of the dump ACL reports. But one of the things"
    },
    {
      "Time_Start": 617.04,
      "Time_End": 622.04,
      "Text": " I want to ask you guys while this is kind of going up there, you want to look at policies"
    },
    {
      "Time_Start": 622.04,
      "Time_End": 630.04,
      "Text": " groups. How many people would run a test on a production environment? How many people"
    },
    {
      "Time_Start": 630.04,
      "Time_End": 635.04,
      "Text": " in here would run tests on a production environment? Yeah. You work for the government then. I"
    },
    {
      "Time_Start": 635.04,
      "Time_End": 643.04,
      "Text": " found a Fed. Okay. Can you see why the logic in that doesn't make any sense? You want to"
    },
    {
      "Time_Start": 643.04,
      "Time_End": 648.04,
      "Text": " run as many tests as you can. The reason being and the reason why I say this is because going"
    },
    {
      "Time_Start": 648.04,
      "Time_End": 653.04,
      "Text": " out and running something like this on a machine, you know how many test accounts we can"
    },
    {
      "Time_Start": 653.04,
      "Time_End": 659.04,
      "Text": " find? We can find so many test accounts and they remain dormant. They're active, but they're"
    },
    {
      "Time_Start": 659.04,
      "Time_End": 667.04,
      "Text": " just dormant there. So if you even run pastel.dll and you did it, you know, as this"
    },
    {
      "Time_Start": 667.04,
      "Time_End": 672.04,
      "Text": " conscientious sysadmin, you know, so that everybody's going to have to comply with this"
    },
    {
      "Time_Start": 672.04,
      "Time_End": 677.04,
      "Text": " stronger passwords, you're still going to have all these dormant accounts that don't comply"
    },
    {
      "Time_Start": 677.04,
      "Time_End": 681.04,
      "Text": " that somebody can just change the password on any time they want to. And usually these"
    },
    {
      "Time_Start": 681.04,
      "Time_End": 686.04,
      "Text": " test accounts are run by who? Sysadmins. And usually they're what? They're probably"
    },
    {
      "Time_Start": 686.04,
      "Time_End": 690.04,
      "Text": " administrative accounts, right? And you know what? Each one of these hackers out here, if"
    },
    {
      "Time_Start": 690.04,
      "Time_End": 699.04,
      "Text": " they didn't know it, they know it now. So guard them. And do what it says to do with"
    },
    {
      "Time_Start": 699.04,
      "Time_End": 705.04,
      "Text": " NT. Change ‑‑ hide it. Decoy that admin account. Make it something that it really"
    },
    {
      "Time_Start": 705.04,
      "Time_End": 709.04,
      "Text": " doesn't. So that newbie hacker will go after that admin account. You know when I went to"
    },
    {
      "Time_Start": 709.04,
      "Time_End": 713.04,
      "Text": " DEF CON and a guy told me how to get into the NT machine. Now I'm over there and he's got"
    },
    {
      "Time_Start": 713.04,
      "Time_End": 717.04,
      "Text": " this little bitty nothing. But he thinks he's got something. So let him happy. He's been"
    },
    {
      "Time_Start": 717.04,
      "Time_End": 727.04,
      "Text": " happy for a while. You just keep track of him. Okay. A lot of times this stuff goes by"
    },
    {
      "Time_Start": 727.04,
      "Time_End": 731.04,
      "Text": " itself. I just have to hit a button every once in a while and it will start running by"
    },
    {
      "Time_Start": 731.04,
      "Time_End": 737.04,
      "Text": " itself. On the policies, it dumps five different categories. This is one of the categories."
    },
    {
      "Time_Start": 737.04,
      "Time_End": 741.04,
      "Text": " Basically it's going to tell you when you run this, this makes more sense to you when"
    },
    {
      "Time_Start": 741.04,
      "Time_End": 746.04,
      "Text": " you get the program. It's like Greek right now. Okay? It was Greek to me when I first"
    },
    {
      "Time_Start": 746.04,
      "Time_End": 750.04,
      "Text": " saw this. I was like what does it mean? I don't know. But just believe me, when it's"
    },
    {
      "Time_Start": 750.04,
      "Time_End": 754.04,
      "Text": " doing this, you'll see it when it comes up with the program. You want to run your policies"
    },
    {
      "Time_Start": 754.04,
      "Time_End": 761.04,
      "Text": " so you can check to make sure that your policies comply with how your real policies, your written"
    },
    {
      "Time_Start": 761.04,
      "Time_End": 769.04,
      "Text": " policies are set up, your permissions. You don't want, okay. I went into one place and"
    },
    {
      "Time_Start": 769.04,
      "Time_End": 775.04,
      "Text": " the guys were saying, hey, we've got this really cool way of setting up accounts. Okay?"
    },
    {
      "Time_Start": 775.04,
      "Time_End": 781.04,
      "Text": " And it was a conference I went to last month. And they were teaching sysadmins how to set"
    },
    {
      "Time_Start": 781.04,
      "Time_End": 788.04,
      "Text": " it up. And guess what? The guy was real proud of the fact that he was an MCSE. I'm an MCSE."
    },
    {
      "Time_Start": 788.04,
      "Time_End": 793.04,
      "Text": " He made sure he stated that. And he says, guess what? What we do is when we get all"
    },
    {
      "Time_Start": 793.04,
      "Time_End": 797.04,
      "Text": " these new people come in, because we've got a lot of students coming in, in order to save"
    },
    {
      "Time_Start": 797.04,
      "Time_End": 804.04,
      "Text": " time, we set them up in a guest account. So we've got 5,000 students that come in every"
    },
    {
      "Time_Start": 804.04,
      "Time_End": 809.04,
      "Text": " six months and we set them up in a guest account. How safe is that? That's real safe, isn't"
    },
    {
      "Time_Start": 809.04,
      "Time_End": 818.04,
      "Text": " it? I don't get any acknowledgment out there. That scares me. Okay. This is the policy information."
    },
    {
      "Time_Start": 818.04,
      "Time_End": 825.04,
      "Text": " So the point there is don't make any assumptions on how you're setting this stuff up. Look"
    },
    {
      "Time_Start": 825.04,
      "Time_End": 830.04,
      "Text": " at this. Pull this information down. By the way, this is all Word. You guys are NT people."
    },
    {
      "Time_Start": 830.04,
      "Time_End": 838.04,
      "Text": " I mean Word. This is Windows. You guys are all NT people. Save this as a text column"
    },
    {
      "Time_Start": 838.04,
      "Time_End": 844.04,
      "Text": " with a limited file. You'll know when you go into save as. File, save as. The reason"
    },
    {
      "Time_Start": 844.04,
      "Time_End": 848.04,
      "Text": " being is because then you can pull this up into something like Excel and you can run"
    },
    {
      "Time_Start": 848.04,
      "Time_End": 855.04,
      "Text": " a lot of analysis on it really quick. You know the sort fast function or something like"
    },
    {
      "Time_Start": 855.04,
      "Time_End": 864.04,
      "Text": " that in Excel? It pulls out information that's unbelievable. Okay?"
    },
    {
      "Time_Start": 864.04,
      "Time_End": 873.04,
      "Text": " Let's go to the next one. And this particular category here is group accounts. This one"
    },
    {
      "Time_Start": 873.04,
      "Time_End": 879.04,
      "Text": " isn't as important. It doesn't have a lot of good information, but it's good to know"
    },
    {
      "Time_Start": 879.04,
      "Time_End": 883.04,
      "Text": " and to keep track of. You know, you don't know if you're, especially if you've got 4,000,"
    },
    {
      "Time_Start": 883.04,
      "Time_End": 886.04,
      "Text": " 5,000 accounts out there, how do you know you've been hacked? How do you know that there's"
    },
    {
      "Time_Start": 886.04,
      "Time_End": 891.04,
      "Text": " a new account in there? I mean, in some cases, are you the only sysadmin out there in your"
    },
    {
      "Time_Start": 891.04,
      "Time_End": 895.04,
      "Text": " particular domain? Probably not. You know, I mean, in some of these places, especially"
    },
    {
      "Time_Start": 895.04,
      "Time_End": 898.04,
      "Text": " if you guys are government people, I know that there's probably, you know, I've seen"
    },
    {
      "Time_Start": 898.04,
      "Time_End": 904.04,
      "Text": " anywhere between 15 and 25 sysadmins all running around. They're running around in different"
    },
    {
      "Time_Start": 904.04,
      "Time_End": 908.04,
      "Text": " divisions but on the same domain and they're installing stuff right and left and all of"
    },
    {
      "Time_Start": 908.04,
      "Time_End": 913.04,
      "Text": " a sudden half of the domain goes down. They don't know who did it. It was their own sysadmins"
    },
    {
      "Time_Start": 913.04,
      "Time_End": 916.04,
      "Text": " that are doing it. I mean, they're hacking into their own systems and crashing them,"
    },
    {
      "Time_Start": 916.04,
      "Time_End": 923.04,
      "Text": " so they don't need you newbie hackers running any script kitties against them. They're doing"
    },
    {
      "Time_Start": 923.04,
      "Time_End": 928.04,
      "Text": " it on their own. Okay, this is a group of accounts. I can't remember what the next one"
    },
    {
      "Time_Start": 928.04,
      "Time_End": 935.04,
      "Text": " is. Oh, by the way, I hope you guys don't mind. Don't try to steal my camera afterwards."
    },
    {
      "Time_Start": 935.04,
      "Time_End": 939.04,
      "Text": " I took pictures of the group here and the reason why I did it is because I'm giving"
    },
    {
      "Time_Start": 939.04,
      "Time_End": 947.04,
      "Text": " this seminar again in Austin, Texas to a group of government folks. I just want to"
    },
    {
      "Time_Start": 947.04,
      "Time_End": 952.04,
      "Text": " show them what they're up against. Because if the room at the next conference has got"
    },
    {
      "Time_Start": 952.04,
      "Time_End": 959.04,
      "Text": " like a smidgen of people here and there, I just want to show them the odds, the ratio."
    },
    {
      "Time_Start": 959.04,
      "Time_End": 964.04,
      "Text": " You know, they're doomed. Okay, this is the file system permission reports. Pretty much"
    },
    {
      "Time_Start": 964.04,
      "Time_End": 972.04,
      "Text": " it's going to give you all this information on your file systems. There's a regedit report"
    },
    {
      "Time_Start": 972.04,
      "Time_End": 980.04,
      "Text": " that kind of works alongside this and you can make changes to your regedit or however"
    },
    {
      "Time_Start": 980.04,
      "Time_End": 985.04,
      "Text": " you need to so that nobody else can get to it. And a lot of systems that we've seen,"
    },
    {
      "Time_Start": 985.0400000000001,
      "Time_End": 999.0400000000001,
      "Text": " the regedit is really not set up so it's secure and everybody and their brother has"
    },
    {
      "Time_Start": 999.0400000000001,
      "Time_End": 1004.0400000000001,
      "Text": " access to it. So go into your system, use this particular tool and I'm emphasizing"
    },
    {
      "Time_Start": 1004.0400000000001,
      "Time_End": 1009.0400000000001,
      "Text": " that and I'm sorry if I'm emphasizing it but the thing is that not too many people"
    },
    {
      "Time_Start": 1009.0400000000001,
      "Time_End": 1014.0400000000001,
      "Text": " go in and really take a conscientious look at what their system's doing. If you guys"
    },
    {
      "Time_Start": 1014.0400000000001,
      "Time_End": 1020.0400000000001,
      "Text": " are the sysadmins, I'm pleading with you, please don't also be the security officers"
    },
    {
      "Time_Start": 1020.0400000000001,
      "Time_End": 1025.04,
      "Text": " as well. I mean, if you don't know what I'm saying, there's a cross section of duties"
    },
    {
      "Time_Start": 1025.04,
      "Time_End": 1031.04,
      "Text": " there. There's not a segregation of duties. I mean, don't be the only one that has to"
    },
    {
      "Time_Start": 1031.04,
      "Time_End": 1039.04,
      "Text": " be accountable because if legal issues come up, you're boxing yourself in pretty much"
    },
    {
      "Time_Start": 1039.04,
      "Time_End": 1043.04,
      "Text": " is what I'm saying."
    },
    {
      "Time_Start": 1043.04,
      "Time_End": 1055.04,
      "Text": " Okay. Boy, I had a lot of things here. Another thing that we've seen is a lot of security"
    },
    {
      "Time_Start": 1055.04,
      "Time_End": 1059.04,
      "Text": " officers that they put out there, they just kind of pick them at random. There's a guy"
    },
    {
      "Time_Start": 1059.04,
      "Time_End": 1064.04,
      "Text": " who's going to get ready to retire or he's got a couple more years in the company before"
    },
    {
      "Time_Start": 1065.04,
      "Time_End": 1070.04,
      "Text": " he leaves and so they put him in there as a security officer and the guy has no clue."
    },
    {
      "Time_Start": 1070.04,
      "Time_End": 1075.04,
      "Text": " You know, what is a security officer? He doesn't know if he should wear a gun, if he should"
    },
    {
      "Time_Start": 1075.04,
      "Time_End": 1084.04,
      "Text": " wear a badge. You know, he wants to go to some kind of class on TCPIP that he has no"
    },
    {
      "Time_Start": 1084.04,
      "Time_End": 1090.04,
      "Text": " clue, that probably has no relationship to what he's doing at all. But to me, the way"
    },
    {
      "Time_Start": 1090.04,
      "Time_End": 1097.04,
      "Text": " I look at that is you send somebody out. Has anybody ever gone looking for, oh gosh,"
    },
    {
      "Time_Start": 1097.04,
      "Time_End": 1105.04,
      "Text": " what is it? I had it on the tip of my tongue earlier. Snipe hunting. So you know what I'm"
    },
    {
      "Time_Start": 1105.04,
      "Time_End": 1109.04,
      "Text": " talking about. What they're doing is they're just taking these security officers and they're"
    },
    {
      "Time_Start": 1109.04,
      "Time_End": 1113.04,
      "Text": " telling them to go snipe hunting. If you've never gone and seen a snipe, you have no clue"
    },
    {
      "Time_Start": 1113.04,
      "Time_End": 1118.04,
      "Text": " to what to look for. It's the same thing with hacking and looking for somebody hacking into"
    },
    {
      "Time_Start": 1118.04,
      "Time_End": 1121.04,
      "Text": " your system. And I'm not just talking about your newbies out there. I'm talking about"
    },
    {
      "Time_Start": 1121.04,
      "Time_End": 1125.04,
      "Text": " the internal people because that's what this tool basically is for, is the internal people"
    },
    {
      "Time_Start": 1125.04,
      "Time_End": 1130.04,
      "Text": " who are just kind of clicking around going, you know, how far can I get? How far can I"
    },
    {
      "Time_Start": 1130.04,
      "Time_End": 1140.04,
      "Text": " get up there? If you don't know what kind of configuration to look for, you're clueless"
    },
    {
      "Time_Start": 1140.04,
      "Time_End": 1145.04,
      "Text": " out there, right? I mean, the ISO is clueless. The information security officers are just"
    },
    {
      "Time_Start": 1145.04,
      "Time_End": 1154.04,
      "Text": " completely clueless. Oh, by the way, I hope I didn't offend any MCSEs out there."
    },
    {
      "Time_Start": 1154.04,
      "Time_End": 1158.04,
      "Text": " This is a share permission report. This is a real good report because this provides you"
    },
    {
      "Time_Start": 1158.04,
      "Time_End": 1162.04,
      "Text": " information on your different shares. I mean, and what you want to do is you want to look"
    },
    {
      "Time_Start": 1162.04,
      "Time_End": 1167.04,
      "Text": " at segregation of duties. If you don't have a good knowledge of segregation of duties,"
    },
    {
      "Time_Start": 1167.04,
      "Time_End": 1170.04,
      "Text": " you know, you might want to get with your accounting department and maybe talk to an"
    },
    {
      "Time_Start": 1170.04,
      "Time_End": 1176.04,
      "Text": " auditor or something and ask them what, how to go about segregation of duties. Or maybe"
    },
    {
      "Time_Start": 1176.04,
      "Time_End": 1181.04,
      "Text": " run this report and share this with another, with an auditor so that they can help you"
    },
    {
      "Time_Start": 1181.04,
      "Time_End": 1195.04,
      "Text": " break this out. Oops. By the way, the, where's my pointer? The information over here, the"
    },
    {
      "Time_Start": 1195.04,
      "Time_End": 1203.04,
      "Text": " save as, that's just a good rule of thumb. Just save it as that. You know, dot TXT or"
    },
    {
      "Time_Start": 1203.04,
      "Time_End": 1208.04,
      "Text": " whatever before. So that you know what you ran. Just kind of helps you out a little bit"
    },
    {
      "Time_Start": 1208.04,
      "Time_End": 1214.04,
      "Text": " there. And as far as these options are concerned for the permissions and reports, you want"
    },
    {
      "Time_Start": 1214.04,
      "Time_End": 1220.04,
      "Text": " to select certain settings or certain information here so that it pulls up this stuff. That"
    },
    {
      "Time_Start": 1220.04,
      "Time_End": 1223.04,
      "Text": " way when you go back, you can kind of refer back to something like this and it will tell"
    },
    {
      "Time_Start": 1223.04,
      "Time_End": 1234.04,
      "Text": " you what's there. This is the share permission report. It's hot in here. Is it hot in here"
    },
    {
      "Time_Start": 1234.04,
      "Time_End": 1241.04,
      "Text": " to you guys? Boy, this is, this is awful. Okay, I'm going to try to go through this"
    },
    {
      "Time_Start": 1241.04,
      "Time_End": 1245.04,
      "Text": " really, really quick so you guys can walk outside because this is, I'm about to pass"
    },
    {
      "Time_Start": 1245.04,
      "Time_End": 1257.04,
      "Text": " out up here. Yes? Yeah, you call it what you want to. As far as the, the question is what"
    },
    {
      "Time_Start": 1257.04,
      "Time_End": 1261.04,
      "Text": " is the file extension for the column delimited file? You call it what you want to. Basically"
    },
    {
      "Time_Start": 1261.04,
      "Time_End": 1266.04,
      "Text": " it's going to be, you should save it as a TXT file. Okay. Then you can export it or"
    },
    {
      "Time_Start": 1266.04,
      "Time_End": 1271.04,
      "Text": " I'm sorry, import it into Excel. It's really, since it's column delimited, I mean that little"
    },
    {
      "Time_Start": 1271.04,
      "Time_End": 1275.04,
      "Text": " wizard comes up and it just kind of, you just go yes, yes, yes, yes, yes and then it"
    },
    {
      "Time_Start": 1275.04,
      "Time_End": 1285.04,
      "Text": " does the rest for you. Any other questions? Yes. What does it run on? Oh, it will, yes,"
    },
    {
      "Time_Start": 1285.04,
      "Time_End": 1292.04,
      "Text": " it will run on, oh, it won't run on like 9X. Okay, it will run on NT. It will only run"
    },
    {
      "Time_Start": 1292.04,
      "Time_End": 1307.04,
      "Text": " on NT box because usually that's where your servers are located. 139, yes. Right. And"
    },
    {
      "Time_Start": 1307.04,
      "Time_End": 1312.04,
      "Text": " it will also run on an alpha box as well. I ran it on an alpha box as well as an Intel"
    },
    {
      "Time_Start": 1312.04,
      "Time_End": 1320.04,
      "Text": " machine. So, yes. Any other questions? Yes. Yeah, I'm going to put them on the DEF CON"
    },
    {
      "Time_Start": 1320.04,
      "Time_End": 1324.04,
      "Text": " slide. I'm going to give them to him when I get back and that will be Monday. I'm sorry?"
    },
    {
      "Time_Start": 1324.04,
      "Time_End": 1329.04,
      "Text": " Yeah, DT's website. It will be on his so you guys can get it up there if you really want"
    },
    {
      "Time_Start": 1329.04,
      "Time_End": 1334.04,
      "Text": " to. What I'm also going to put on the side is a couple of documents that will be in Word"
    },
    {
      "Time_Start": 1334.04,
      "Time_End": 1338.04,
      "Text": " and, you know, I'm sorry for anybody, Unix people out there or whatever, but this is"
    },
    {
      "Time_Start": 1338.04,
      "Time_End": 1345.04,
      "Text": " an NT kind of situation so it will all be in DOC format and it's how to set up the everyone"
    },
    {
      "Time_Start": 1345.04,
      "Time_End": 1349.04,
      "Text": " groups. This is another problem that I've noticed with people is setting up everyone"
    },
    {
      "Time_Start": 1349.04,
      "Time_End": 1354.04,
      "Text": " groups, a lot of people just copy the everyone and just maybe rename it, but it keeps all"
    },
    {
      "Time_Start": 1354.04,
      "Time_End": 1358.04,
      "Text": " the permissions of the everyone group. The problem with that, I mean, you can obviously"
    },
    {
      "Time_Start": 1358.04,
      "Time_End": 1363.04,
      "Text": " see. If you're trying to separate the receiving department from, say, the accounting department,"
    },
    {
      "Time_Start": 1363.04,
      "Time_End": 1368.04,
      "Text": " then there's really no segregation except in the name of the group itself, right? All"
    },
    {
      "Time_Start": 1368.04,
      "Time_End": 1372.04,
      "Text": " they have to do is just point and click in the network neighborhood and boom, they're"
    },
    {
      "Time_Start": 1372.04,
      "Time_End": 1379.04,
      "Text": " wherever they want to go. And if you're a sysadmin, you know, use this along with the"
    },
    {
      "Time_Start": 1379.04,
      "Time_End": 1384.04,
      "Text": " security administrator as well. I know you don't have a lot of time. Boy, your time is"
    },
    {
      "Time_Start": 1384.04,
      "Time_End": 1391.04,
      "Text": " really, really short and if you work for the government, I, you know, I hope you guys more"
    },
    {
      "Time_Start": 1392.04,
      "Time_End": 1399.04,
      "Text": " about that. Yes. Okay. How can you prevent somebody from having access to this tool?"
    },
    {
      "Time_Start": 1407.04,
      "Time_End": 1414.04,
      "Text": " You right click on the folder that it's in or the best ‑‑ I'm sorry."
    },
    {
      "Time_Start": 1422.04,
      "Time_End": 1426.04,
      "Text": " Well, with that, what you have to do is you have to go in and you have to shut down probably"
    },
    {
      "Time_Start": 1426.04,
      "Time_End": 1433.04,
      "Text": " 139. But if you do that, then how are people going to authenticate? Yes, go ahead."
    },
    {
      "Time_Start": 1452.04,
      "Time_End": 1455.04,
      "Text": " Okay."
    },
    {
      "Time_Start": 1466.04,
      "Time_End": 1471.04,
      "Text": " Right, but you got to ‑‑ okay, the question or the comment basically is to turn off enumeration"
    },
    {
      "Time_Start": 1471.04,
      "Time_End": 1476.04,
      "Text": " inside of your server so that somebody else sitting on an empty box remotely is not going"
    },
    {
      "Time_Start": 1476.04,
      "Time_End": 1481.04,
      "Text": " to use this tool as they get it for free and then scam all this information off of your box."
    },
    {
      "Time_Start": 1481.04,
      "Time_End": 1491.04,
      "Text": " Good question. Apparently it's on tech net and if you do a search on it, it will come up."
    },
    {
      "Time_Start": 1491.04,
      "Time_End": 1494.04,
      "Text": " Yes. Wait."
    },
    {
      "Time_Start": 1494.04,
      "Time_End": 1498.04,
      "Text": " Do you have to run this tool as an administrator equivalent?"
    },
    {
      "Time_Start": 1498.04,
      "Time_End": 1503.04,
      "Text": " Do you have to run the tool as an administrator equivalent? Yes, you do."
    },
    {
      "Time_Start": 1504.04,
      "Time_End": 1511.04,
      "Text": " For one thing you might be worried about, can you do this in multiple domains if you have ‑‑"
    },
    {
      "Time_Start": 1516.04,
      "Time_End": 1521.04,
      "Text": " Yeah, you can only run this on one PDC at a time. You cannot run this on your entire domain."
    },
    {
      "Time_Start": 1521.04,
      "Time_End": 1525.04,
      "Text": " You have to run this established, you can't run it by a single domain."
    },
    {
      "Time_Start": 1525.04,
      "Time_End": 1531.04,
      "Text": " Right, exactly. And that's why I was kind of concerned about the enumeration. Yes."
    },
    {
      "Time_Start": 1531.04,
      "Time_End": 1536.04,
      "Text": " Can you be vocal about using a null session attack?"
    },
    {
      "Time_Start": 1536.04,
      "Time_End": 1539.04,
      "Text": " Yes, a null session attack, that's what I had mentioned earlier."
    },
    {
      "Time_Start": 1539.04,
      "Time_End": 1542.04,
      "Text": " He was just saying about the null session attack that I had mentioned earlier."
    },
    {
      "Time_Start": 1542.04,
      "Time_End": 1548.04,
      "Text": " Yes. Remotely on an empty box you can establish a null session with the server that's over there."
    },
    {
      "Time_Start": 1548.04,
      "Time_End": 1551.04,
      "Text": " I mean, you want exploits on NT."
    },
    {
      "Time_Start": 1551.04,
      "Time_End": 1556.04,
      "Text": " You know, Greg Hoagland and I were sitting out there at lunchtime and we were talking about an"
    },
    {
      "Time_Start": 1556.04,
      "Time_End": 1562.04,
      "Text": " exploit that we had done at the conference in Reno, Nevada, where all you do is set up a server,"
    },
    {
      "Time_Start": 1562.04,
      "Time_End": 1569.04,
      "Text": " an NT server, remotely and then it's going ‑‑ oh, gosh, I can't remember."
    },
    {
      "Time_Start": 1569.04,
      "Time_End": 1579.04,
      "Text": " Anyway, what it does is you set it up as a BDC and it replicates on your system."
    },
    {
      "Time_Start": 1579.04,
      "Time_End": 1583.04,
      "Text": " So you actually ‑‑ and then if you want to, I mean, you can knock the other system down"
    },
    {
      "Time_Start": 1583.04,
      "Time_End": 1588.04,
      "Text": " and people are authenticating on you so you can get passwords right and left on an LM hash especially."
    },
    {
      "Time_Start": 1588.04,
      "Time_End": 1592.04,
      "Text": " I mean, well, it doesn't matter. You have the SAM file right there."
    },
    {
      "Time_Start": 1592.04,
      "Time_End": 1596.04,
      "Text": " So you can sit up and run Loft Crack against it all day long."
    },
    {
      "Time_Start": 1596.04,
      "Time_End": 1600.04,
      "Text": " So, I mean, that's something that you need to worry about and you need to look at."
    },
    {
      "Time_Start": 1600.04,
      "Time_End": 1606.04,
      "Text": " But, you know, those are some things that your information security officer as you as a sysadmin needs to do."
    },
    {
      "Time_Start": 1606.04,
      "Time_End": 1610.04,
      "Text": " I'm sorry, what?"
    },
    {
      "Time_Start": 1610.04,
      "Time_End": 1614.04,
      "Text": " I still didn't get that."
    },
    {
      "Time_Start": 1614.04,
      "Time_End": 1618.04,
      "Text": " Secure ID for NT log‑in."
    },
    {
      "Time_Start": 1618.04,
      "Time_End": 1620.04,
      "Text": " Oh, using like a third‑party log‑in?"
    },
    {
      "Time_Start": 1620.04,
      "Time_End": 1624.04,
      "Text": " No, at this point, no."
    },
    {
      "Time_Start": 1624.04,
      "Time_End": 1627.04,
      "Text": " And part of the reason, like I mentioned before, it's the doctors."
    },
    {
      "Time_Start": 1627.04,
      "Time_End": 1634.04,
      "Text": " You got doctors and lawyers who feel that they don't ‑‑ they cannot be bothered with that, okay?"
    },
    {
      "Time_Start": 1635.04,
      "Time_End": 1637.04,
      "Text": " They just cannot be bothered with that."
    },
    {
      "Time_Start": 1637.04,
      "Time_End": 1643.04,
      "Text": " And until there's a liability placed on the doctors, until there's a liability placed on the doctors"
    },
    {
      "Time_Start": 1643.04,
      "Time_End": 1652.04,
      "Text": " that makes them accountable for securing patient information or for securing client information,"
    },
    {
      "Time_Start": 1652.04,
      "Time_End": 1656.04,
      "Text": " then nothing's going to happen to them, okay?"
    },
    {
      "Time_Start": 1656.04,
      "Time_End": 1663.04,
      "Text": " And believe me, if you go to a doctor and tell them, hey, I got patient information,"
    },
    {
      "Time_Start": 1663.04,
      "Time_End": 1666.04,
      "Text": " write me out a check for $4,999.99."
    },
    {
      "Time_Start": 1666.04,
      "Time_End": 1669.04,
      "Text": " Do you think he's going to go to the CIA or FBI?"
    },
    {
      "Time_Start": 1669.04,
      "Time_End": 1672.04,
      "Text": " Well, if he does, what's going to happen to him?"
    },
    {
      "Time_Start": 1672.04,
      "Time_End": 1674.04,
      "Text": " He'll probably lose his license."
    },
    {
      "Time_Start": 1674.04,
      "Time_End": 1679.04,
      "Text": " So it's probably cheaper to you, one of those risks of business."
    },
    {
      "Time_Start": 1679.04,
      "Time_End": 1683.04,
      "Text": " He'll probably just write you out a check for $4,999.99."
    },
    {
      "Time_Start": 1683.04,
      "Time_End": 1685.04,
      "Text": " Now, am I encouraging you to do that?"
    },
    {
      "Time_Start": 1685.04,
      "Time_End": 1689.04,
      "Text": " No, I don't encourage anybody to do that, okay?"
    },
    {
      "Time_Start": 1689.04,
      "Time_End": 1692.04,
      "Text": " I guess I should have put a waiver up here."
    },
    {
      "Time_Start": 1692.04,
      "Time_End": 1694.04,
      "Text": " And a disclaimer."
    },
    {
      "Time_Start": 1694.04,
      "Time_End": 1695.04,
      "Text": " Yes?"
    },
    {
      "Time_Start": 1695.04,
      "Time_End": 1706.04,
      "Text": " The law specifies that damage isn't five grand, but extortion or blackmail on any level, even a dollar, just so you know, is a crime."
    },
    {
      "Time_Start": 1706.04,
      "Time_End": 1707.04,
      "Text": " Right."
    },
    {
      "Time_Start": 1707.04,
      "Time_End": 1710.04,
      "Text": " My point, though, is that even if you do something like that,"
    },
    {
      "Time_Start": 1710.04,
      "Time_End": 1715.04,
      "Text": " the doctors themselves, for a release of patient information poorly secured like that,"
    },
    {
      "Time_Start": 1715.04,
      "Time_End": 1721.04,
      "Text": " will probably lose their license or, sadly, their reputation, which is even worse."
    },
    {
      "Time_Start": 1721.04,
      "Time_End": 1722.04,
      "Text": " Yes?"
    },
    {
      "Time_Start": 1722.04,
      "Time_End": 1726.04,
      "Text": " Weak link here is usually the people who choose poor password."
    },
    {
      "Time_Start": 1726.04,
      "Time_End": 1728.04,
      "Text": " That's the weakest link."
    },
    {
      "Time_Start": 1728.04,
      "Time_End": 1730.04,
      "Text": " The idea is to send back a poor password."
    },
    {
      "Time_Start": 1730.04,
      "Time_End": 1738.04,
      "Text": " Can you point me out any resources for helping to not do illiterate end users create a strong password?"
    },
    {
      "Time_Start": 1738.04,
      "Time_End": 1745.04,
      "Text": " What are some of your favorite song lyrics in the first letter of the password?"
    },
    {
      "Time_Start": 1745.04,
      "Time_End": 1746.04,
      "Text": " That's a great one."
    },
    {
      "Time_Start": 1746.04,
      "Time_End": 1754.04,
      "Text": " The question is, how do you make end users, rain-dead end users, learn to make stronger passwords?"
    },
    {
      "Time_Start": 1754.04,
      "Time_End": 1757.04,
      "Text": " Well, one of them, of course, is to put in the passfelt.dll."
    },
    {
      "Time_Start": 1757.04,
      "Time_End": 1759.04,
      "Text": " I mean, that's going to sort of force them to do it."
    },
    {
      "Time_Start": 1759.04,
      "Time_End": 1763.04,
      "Text": " It's going to tick them off, but it's going to force them to do it."
    },
    {
      "Time_Start": 1763.04,
      "Time_End": 1765.04,
      "Text": " The other thing is just training."
    },
    {
      "Time_Start": 1765.04,
      "Time_End": 1767.04,
      "Text": " Training users on a regular basis."
    },
    {
      "Time_Start": 1767.04,
      "Time_End": 1769.04,
      "Text": " What's that DLL?"
    },
    {
      "Time_Start": 1769.04,
      "Time_End": 1771.04,
      "Text": " It's called passfelt.dll."
    },
    {
      "Time_Start": 1771.04,
      "Time_End": 1775.04,
      "Text": " It's on, what is it, SP2 on up?"
    },
    {
      "Time_Start": 1775.04,
      "Time_End": 1782.04,
      "Text": " And I think SP4 has got a better fix on the old stuff."
    },
    {
      "Time_Start": 1782.04,
      "Time_End": 1785.04,
      "Text": " What website is it on, the passfelt.dll?"
    },
    {
      "Time_Start": 1785.04,
      "Time_End": 1792.04,
      "Text": " Well, you can get it off Microsoft's site, but if you're running NT, it's on your SP2 on up."
    },
    {
      "Time_Start": 1792.04,
      "Time_End": 1798.04,
      "Text": " But I think, like I said, SP4 has got a fix to something that was on SP2."
    },
    {
      "Time_Start": 1798.04,
      "Time_End": 1800.04,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 1800.04,
      "Time_End": 1801.04,
      "Text": " Yes."
    },
    {
      "Time_Start": 1801.04,
      "Time_End": 1803.04,
      "Text": " In the tool, don't ACL let you do modeling?"
    },
    {
      "Time_Start": 1803.04,
      "Time_End": 1810.04,
      "Text": " It will let you set up the rules and policies and then see how they would play out on the network."
    },
    {
      "Time_Start": 1810.04,
      "Time_End": 1816.04,
      "Text": " So after you've just developed a report, can you set up the policies and see how they would play out on the shared?"
    },
    {
      "Time_Start": 1816.04,
      "Time_End": 1817.04,
      "Text": " Oh, yes."
    },
    {
      "Time_Start": 1817.04,
      "Time_End": 1818.04,
      "Text": " Okay."
    },
    {
      "Time_Start": 1818.04,
      "Time_End": 1823.04,
      "Text": " The question is, can you do modeling with this, like engineer your whole topology there?"
    },
    {
      "Time_Start": 1823.04,
      "Time_End": 1824.04,
      "Text": " Create policy."
    },
    {
      "Time_Start": 1824.04,
      "Time_End": 1825.04,
      "Text": " Create policy."
    },
    {
      "Time_Start": 1825.04,
      "Time_End": 1826.04,
      "Text": " Right."
    },
    {
      "Time_Start": 1826.04,
      "Time_End": 1827.04,
      "Text": " Yes."
    },
    {
      "Time_Start": 1827.04,
      "Time_End": 1828.04,
      "Text": " Yeah, that would be an excellent idea to do something like that."
    },
    {
      "Time_Start": 1828.04,
      "Time_End": 1830.04,
      "Text": " Set it up on a test environment, see how it runs."
    },
    {
      "Time_Start": 1830.04,
      "Time_End": 1833.04,
      "Text": " Set up all your groups and all your individual accounts and everything."
    },
    {
      "Time_Start": 1833.04,
      "Time_End": 1834.04,
      "Text": " That works fine."
    },
    {
      "Time_Start": 1834.04,
      "Time_End": 1837.04,
      "Text": " And just move it over into the real environment once it works."
    },
    {
      "Time_Start": 1837.04,
      "Time_End": 1838.04,
      "Text": " Yes."
    },
    {
      "Time_Start": 1838.04,
      "Time_End": 1839.04,
      "Text": " Excellent idea."
    },
    {
      "Time_Start": 1839.04,
      "Time_End": 1842.04,
      "Text": " Any other questions?"
    },
    {
      "Time_Start": 1842.04,
      "Time_End": 1843.04,
      "Text": " Okay."
    },
    {
      "Time_Start": 1843.04,
      "Time_End": 1844.04,
      "Text": " It's hot."
    },
    {
      "Time_Start": 1844.04,
      "Time_End": 1845.04,
      "Text": " Yeah, I'm hot."
    },
    {
      "Time_Start": 1845.04,
      "Time_End": 1849.04,
      "Text": " And I feel sorry for the people over at CDC, because not only are they hot, but they're also going to get a virus."
    },
    {
      "Time_Start": 1849.04,
      "Time_End": 1851.04,
      "Text": " So thank you very much."
    },
    {
      "Time_Start": 1852.04,
      "Time_End": 1853.04,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 1853.04,
      "Time_End": 1854.04,
      "Text": " Thank you very much."
    },
    {
      "Time_Start": 1854.04,
      "Time_End": 1856.04,
      "Text": " Applause."
    }
  ]
}