{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 14.56,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I can actually start my talk now. And again, if I go over here and you can't hear me, just"
    },
    {
      "Time_Start": 14.56,
      "Time_End": 18.12,
      "Text": " wave your hands at me and let me know. My name is Jeff Thompson, otherwise known as"
    },
    {
      "Time_Start": 18.12,
      "Time_End": 21.96,
      "Text": " Mithrandir for some of the people here who are my friends and know me. I'm a director"
    },
    {
      "Time_Start": 21.96,
      "Time_End": 26.88,
      "Text": " at a company called Argus Systems Group, and I have a title, which is called Software Evangelist"
    },
    {
      "Time_Start": 26.88,
      "Time_End": 30.56,
      "Text": " and Visionary, which essentially means that I get to stand in front of people like you,"
    },
    {
      "Time_Start": 30.56,
      "Time_End": 34.08,
      "Text": " jump up and down, wave my arms, and pretend like I know what I'm talking about. Every"
    },
    {
      "Time_Start": 34.08,
      "Time_End": 38.8,
      "Text": " once in a while I do, most of the time probably not. I'm going to be giving a presentation"
    },
    {
      "Time_Start": 38.8,
      "Time_End": 44.8,
      "Text": " on how to hack B1 trusted operating systems. And hopefully this will be fun for me and"
    },
    {
      "Time_Start": 44.8,
      "Time_End": 48.2,
      "Text": " also fun for all of you. I'm going to be using the pitbull.compact"
    },
    {
      "Time_Start": 48.2,
      "Time_End": 52.16,
      "Text": " trust operating system product suite, and that's a big sentence, which is essentially"
    },
    {
      "Time_Start": 52.16,
      "Time_End": 56.84,
      "Text": " our company's trusted operating system product as a reference for giving this talk. However,"
    },
    {
      "Time_Start": 56.84,
      "Time_End": 60.24,
      "Text": " all of the things that I will be talking about should be pretty easily translatable"
    },
    {
      "Time_Start": 60.24,
      "Time_End": 64.4,
      "Text": " to other trusted operating systems. I'm trying to leave it fairly general so all you guys"
    },
    {
      "Time_Start": 64.4,
      "Time_End": 69.88000000000001,
      "Text": " can break into Trusted Solaris, or Virtual Vault, or some of the other fun little OS's"
    },
    {
      "Time_Start": 69.88000000000001,
      "Time_End": 73.44,
      "Text": " out there. Just to tell you a little bit about the company,"
    },
    {
      "Time_Start": 73.44,
      "Time_End": 77.76,
      "Text": " as I mentioned, it's Argus Systems Group, and we build B1, commercial grade B1 trusted"
    },
    {
      "Time_Start": 77.76,
      "Time_End": 81.56,
      "Text": " operating systems. All the work that we do is at the OS level and the kernel level. We"
    },
    {
      "Time_Start": 81.56,
      "Time_End": 85.16,
      "Text": " really don't do much at the application level. We leave that to other people who want to"
    },
    {
      "Time_Start": 85.16,
      "Time_End": 89.24,
      "Text": " do things like encryption and SSH and fun stuff like that."
    },
    {
      "Time_Start": 89.24,
      "Time_End": 91.88,
      "Text": " So I'm going to ask three quick questions. We have to have a little interactive part"
    },
    {
      "Time_Start": 91.88,
      "Time_End": 95.75999999999999,
      "Text": " so I get a little something out of this. First of all, I'm wondering if you could raise your"
    },
    {
      "Time_Start": 95.75999999999999,
      "Time_End": 100.56,
      "Text": " hands if you've ever heard of trusted operating systems before. All right. That's pretty sweet."
    },
    {
      "Time_Start": 100.56,
      "Time_End": 103.67999999999999,
      "Text": " I like that. The next one is kind of the kicker. How many"
    },
    {
      "Time_Start": 103.67999999999999,
      "Time_End": 108.6,
      "Text": " people have actually used a trusted operating system, been on a box, tried to hack one,"
    },
    {
      "Time_Start": 108.60000000000001,
      "Time_End": 116.04,
      "Text": " say, this week, or just kind of a system administrator or whatever? All right. So not"
    },
    {
      "Time_Start": 116.04,
      "Time_End": 120.80000000000001,
      "Text": " quite as many. You guys need to change that, and I'll tell you how at the end of the speech."
    },
    {
      "Time_Start": 120.80000000000001,
      "Time_End": 123.44000000000001,
      "Text": " The next thing is I'm wondering how many people are here who are actually trying to break"
    },
    {
      "Time_Start": 123.44000000000001,
      "Time_End": 131.84,
      "Text": " the box that I brought in. It's a little IBM ThinkPad running Pitbull Solaris on there."
    },
    {
      "Time_Start": 131.84,
      "Time_End": 139.92000000000002,
      "Text": " Anybody? All right. Well, you'll learn something. Basically, I should just mention that real"
    },
    {
      "Time_Start": 139.92000000000002,
      "Time_End": 144.52,
      "Text": " quick. What we did is we brought in a Pitbull box for the Capture a Flag competition, and"
    },
    {
      "Time_Start": 144.52,
      "Time_End": 148.48000000000002,
      "Text": " we opened up a web server, put a cheap little messaging board system out, hoping someone"
    },
    {
      "Time_Start": 148.48000000000002,
      "Time_End": 155.64000000000001,
      "Text": " could hack that, threw up IRC, SSHD, Telnet, FingerD, IMAP, POP, SendMail, and I think"
    },
    {
      "Time_Start": 155.64000000000001,
      "Time_End": 158.92000000000002,
      "Text": " that's it. And today I just gave away Etsy Shadow with all the passwords in it, too,"
    },
    {
      "Time_Start": 158.92000000000002,
      "Time_End": 162.64000000000001,
      "Text": " so people should be able to crack those. And the point is really just to kind of demonstrate"
    },
    {
      "Time_Start": 162.64000000000001,
      "Time_End": 167.62,
      "Text": " that you can give what would appear to be the house away on a trusted operating system,"
    },
    {
      "Time_Start": 167.62,
      "Time_End": 170.96,
      "Text": " and if you configure it correctly, there's nothing that people can do to break into it"
    },
    {
      "Time_Start": 170.96,
      "Time_End": 175.68,
      "Text": " because of the mechanisms that it provides. So my speech is going to be composed of two"
    },
    {
      "Time_Start": 175.68,
      "Time_End": 179.12,
      "Text": " parts. The first part I had actually hoped to do during a newbie session, but for whatever"
    },
    {
      "Time_Start": 179.12,
      "Time_End": 182.24,
      "Text": " reason I didn't get that. So I'm going to have to kind of roll it into here just to"
    },
    {
      "Time_Start": 182.24,
      "Time_End": 186.44000000000003,
      "Text": " give some background on trusted operating systems. I'll try and wing through it fairly"
    },
    {
      "Time_Start": 186.44,
      "Time_End": 189.72,
      "Text": " quickly and not go into too much detail, but just enough so you guys can understand"
    },
    {
      "Time_Start": 189.72,
      "Time_End": 193.4,
      "Text": " what I'm talking about. And the second part, which is, of course, methodologies for hacking"
    },
    {
      "Time_Start": 193.4,
      "Time_End": 197.84,
      "Text": " trusted OS. I'm not going to be giving away any minus one or zero day wares here, so you"
    },
    {
      "Time_Start": 197.84,
      "Time_End": 202.92,
      "Text": " can't go out and, like, hack all the Swiss banks and stuff. Immediately, at least. And"
    },
    {
      "Time_Start": 202.92,
      "Time_End": 207.72,
      "Text": " don't tell them that I taught you how to do this if you go do it. So the other thing is,"
    },
    {
      "Time_Start": 207.72,
      "Time_End": 211.44,
      "Text": " of course, an assumption I make because it's the UberHacker, everybody's really smart speech,"
    },
    {
      "Time_Start": 211.44,
      "Time_End": 217.8,
      "Text": " I'm not going to go into actually how to hack boxes and per se what the old OS is."
    },
    {
      "Time_Start": 217.8,
      "Time_End": 221.94,
      "Text": " But a lot of the tools that you have, a lot of the methodologies that you use in old systems"
    },
    {
      "Time_Start": 221.94,
      "Time_End": 226.56,
      "Text": " apply directly to hacking trusted operating systems, buffer overflows, things like that."
    },
    {
      "Time_Start": 226.56,
      "Time_End": 230.92,
      "Text": " However, the mindset that you have to approach your attack with is very different. And that's"
    },
    {
      "Time_Start": 230.92,
      "Time_End": 235.86,
      "Text": " going to really be the crux of this speech is to try and get all of you into that mindset."
    },
    {
      "Time_Start": 235.86,
      "Time_End": 239.12,
      "Text": " So to understand trusted operating systems, there's really four concepts which are worth"
    },
    {
      "Time_Start": 239.12,
      "Time_End": 243.56,
      "Text": " understanding. The first is least privilege or something else known as capabilities, the"
    },
    {
      "Time_Start": 243.56,
      "Time_End": 248.92000000000002,
      "Text": " POSIX capabilities model, which many of you may be familiar with. An idea of authorizations,"
    },
    {
      "Time_Start": 248.92000000000002,
      "Time_End": 254.6,
      "Text": " mandatory access control, and the idea of putting security into the network layer. And"
    },
    {
      "Time_Start": 254.6,
      "Time_End": 258.88,
      "Text": " by that I mean into the actual data on the network stack that passes through the system"
    },
    {
      "Time_Start": 258.88,
      "Time_End": 265.08,
      "Text": " as opposed to just at the IP layer, which would be filtering. For privileges, there's"
    },
    {
      "Time_Start": 265.08,
      "Time_End": 268.74,
      "Text": " two concepts that you need to understand. The first is least privilege. This has actually"
    },
    {
      "Time_Start": 268.74,
      "Time_End": 272.24,
      "Text": " been written about quite a bit in a lot of security books. When there's the little three"
    },
    {
      "Time_Start": 272.24,
      "Time_End": 277.7,
      "Text": " page chapter on B1 trusted operating systems, they mention it as a sort of exotic thing."
    },
    {
      "Time_Start": 277.7,
      "Time_End": 281.78000000000003,
      "Text": " Least privilege is the idea that rather than having like on standard Unix systems where"
    },
    {
      "Time_Start": 281.78000000000003,
      "Time_End": 286.42,
      "Text": " you have UID zero or root, which has complete access to the system, it can override all"
    },
    {
      "Time_Start": 286.42,
      "Time_End": 290.1,
      "Text": " security on the system, it has access to all system calls. Rather than doing that, you"
    },
    {
      "Time_Start": 290.1,
      "Time_End": 294.94,
      "Text": " take all the concepts of what root can do and you break it up into privileges. So for"
    },
    {
      "Time_Start": 294.94,
      "Time_End": 298.62,
      "Text": " example, root needs to mount a file system. Well, mounting is a concept that's also a"
    },
    {
      "Time_Start": 298.62,
      "Time_End": 302.5,
      "Text": " system call. So what you do is you create a privilege which says now that this program"
    },
    {
      "Time_Start": 302.5,
      "Time_End": 307.34,
      "Text": " or this process can actually mount a file system. And to give you kind of a real world"
    },
    {
      "Time_Start": 307.34,
      "Time_End": 311.54,
      "Text": " example of that, you can take a web server and if you want to bind to port 80, you need"
    },
    {
      "Time_Start": 311.54,
      "Time_End": 315.3,
      "Text": " to run it as root and then it'll switch to another user. The reason why you need to run"
    },
    {
      "Time_Start": 315.3,
      "Time_End": 318.94,
      "Text": " it as root is not because it needs to have access to files in the system, simply because"
    },
    {
      "Time_Start": 318.94,
      "Time_End": 323.5,
      "Text": " it needs to bind to port 80 because it's a privileged port. So on a trusted operating"
    },
    {
      "Time_Start": 323.54,
      "Time_End": 327.14,
      "Text": " system, instead of setting it as root or giving it total access to the system, you simply"
    },
    {
      "Time_Start": 327.14,
      "Time_End": 330.98,
      "Text": " give it one privilege and it can bind to the privileged port and that's all it needs."
    },
    {
      "Time_Start": 330.98,
      "Time_End": 337.42,
      "Text": " The next thing to get into is, this is a little bit of a, in a coding topic, is the idea of"
    },
    {
      "Time_Start": 337.42,
      "Time_End": 340.86,
      "Text": " privilege bracketing. But it also affects you when you're trying to break boxes. And"
    },
    {
      "Time_Start": 340.86,
      "Time_End": 345.5,
      "Text": " it's this, is that privilege bracketing is the idea that a process or program only needs"
    },
    {
      "Time_Start": 345.5,
      "Time_End": 350.34,
      "Text": " to turn on its privileges or its abilities when it needs to use them. And when it's done"
    },
    {
      "Time_Start": 350.34000000000003,
      "Time_End": 354.66,
      "Text": " using them, it can throw them away. So on standard Unix, you want to throw them away,"
    },
    {
      "Time_Start": 354.66,
      "Time_End": 357.98,
      "Text": " you become something else besides root. On a trusted operating system, you simply drop"
    },
    {
      "Time_Start": 357.98,
      "Time_End": 361.66,
      "Text": " the privilege and now if somebody goes and breaks that program, it's not there anymore"
    },
    {
      "Time_Start": 361.66,
      "Time_End": 366.98,
      "Text": " and there's no way for them to get it back. And so now you can, you can limit the exposure"
    },
    {
      "Time_Start": 366.98,
      "Time_End": 371.1,
      "Text": " in your code and also where you're really going to need to focus your, your reviews"
    },
    {
      "Time_Start": 371.1,
      "Time_End": 374.74,
      "Text": " of your code, at least your security relevant reviews of your code, where privileges are"
    },
    {
      "Time_Start": 374.74,
      "Time_End": 378.78000000000003,
      "Text": " going to be active. And it allows you to start building much more secure software and spend"
    },
    {
      "Time_Start": 378.78000000000003,
      "Time_End": 383.62,
      "Text": " time where it, where it matters in review. So privileges. Traditionally, Unix has one"
    },
    {
      "Time_Start": 383.62,
      "Time_End": 389.86,
      "Text": " privilege, root. You're root, you have everything. You're not root, you try to get root. And"
    },
    {
      "Time_Start": 389.86,
      "Time_End": 393.1,
      "Text": " with that, there's, what we do is we take that idea of root, like I said, and break"
    },
    {
      "Time_Start": 393.1,
      "Time_End": 397.3,
      "Text": " it up into privileges. So now we have things like a file system mounting privilege, a DAC"
    },
    {
      "Time_Start": 397.3,
      "Time_End": 401.78000000000003,
      "Text": " read privilege. DAC is just another word for permission bits or access control list. It's"
    },
    {
      "Time_Start": 401.78000000000003,
      "Time_End": 405.66,
      "Text": " just kind of an encompassing term. And then you also create new privileges which are specific"
    },
    {
      "Time_Start": 405.66,
      "Time_End": 409.74,
      "Text": " to trusted operating systems. Privileges which allow you to override mandatory access"
    },
    {
      "Time_Start": 409.74,
      "Time_End": 414.06,
      "Text": " control rules. Or a great privilege here, and this is kind of a hint, if you can get"
    },
    {
      "Time_Start": 414.06,
      "Time_End": 419.3,
      "Text": " this on a system, PVPVPROC. It's a privilege that gives the process an ability to set privileges"
    },
    {
      "Time_Start": 419.3,
      "Time_End": 423.94000000000005,
      "Text": " on other processes. So if you have that, you just start giving yourself lots of nice privileges"
    },
    {
      "Time_Start": 423.94000000000005,
      "Time_End": 429.22,
      "Text": " and then you can own the system. All right, processes. There's three, there's three types"
    },
    {
      "Time_Start": 429.22,
      "Time_End": 433.22,
      "Text": " of privilege sets that you can have in a process. And the first one is one really important"
    },
    {
      "Time_Start": 433.22,
      "Time_End": 436.74,
      "Text": " to understand. It's the limiting privilege set. The idea behind the limiting privilege"
    },
    {
      "Time_Start": 436.74,
      "Time_End": 441.66,
      "Text": " set is that you can specify for a process and all of its children that they can never"
    },
    {
      "Time_Start": 441.66,
      "Time_End": 446.02000000000004,
      "Text": " exceed this amount of privilege. So a great thing to do with this is if you have users"
    },
    {
      "Time_Start": 446.02000000000004,
      "Time_End": 449.98,
      "Text": " logging on to your system who you don't trust, don't ever want to trust, you can give them"
    },
    {
      "Time_Start": 449.98,
      "Time_End": 454.82000000000005,
      "Text": " a limiting privilege set which says no privileges. Now, no matter what that user does, they can"
    },
    {
      "Time_Start": 454.82000000000005,
      "Time_End": 459.18,
      "Text": " run programs that would normally give them privilege. They can do those kinds of things."
    },
    {
      "Time_Start": 459.18,
      "Time_End": 461.86,
      "Text": " And when they run them, the kernel will see that they have this limiting privilege set"
    },
    {
      "Time_Start": 461.86,
      "Time_End": 465.42,
      "Text": " and will refuse to give them privileges. The program may continue to run, but it will"
    },
    {
      "Time_Start": 465.42,
      "Time_End": 469.74,
      "Text": " run without any kind of special ability on the system or special access. The maximum"
    },
    {
      "Time_Start": 469.74,
      "Time_End": 474.22,
      "Text": " privilege set is essentially the set of privileges that a process can use over its lifetime."
    },
    {
      "Time_Start": 474.22,
      "Time_End": 478.62,
      "Text": " And the effective privilege set is the set of privileges that the process is using at"
    },
    {
      "Time_Start": 478.62,
      "Time_End": 482.78000000000003,
      "Text": " any given moment. So it can raise and lower these privileges in its effective set. When"
    },
    {
      "Time_Start": 482.78000000000003,
      "Time_End": 486.46000000000004,
      "Text": " it doesn't want them anymore, it throws them out of its maximum set. And when it doesn't"
    },
    {
      "Time_Start": 486.46000000000004,
      "Time_End": 489.90000000000003,
      "Text": " want its children to have any privileges anymore, it throws it out of its limiting privilege"
    },
    {
      "Time_Start": 489.90000000000003,
      "Time_End": 497.14000000000004,
      "Text": " set. Now, files, privileges work in a different way on files. And particularly, they really"
    },
    {
      "Time_Start": 497.14000000000004,
      "Time_End": 501.98,
      "Text": " work on executables in almost all cases. What you do is you can put three types of privileges"
    },
    {
      "Time_Start": 501.98,
      "Time_End": 507.04,
      "Text": " on files. And the sets are innate, proxy, and authorized. Innate set of privileges are"
    },
    {
      "Time_Start": 507.04,
      "Time_End": 510.82000000000005,
      "Text": " put onto an executable. And what that means is when that program is run, the privileges"
    },
    {
      "Time_Start": 510.82000000000005,
      "Time_End": 515.94,
      "Text": " in the innate set will be placed into the maximum set of the new program, right, as"
    },
    {
      "Time_Start": 515.94,
      "Time_End": 521.1,
      "Text": " long as they don't exceed the limiting privilege set. So it's always placed against that. Proxy"
    },
    {
      "Time_Start": 521.1,
      "Time_End": 526.5400000000001,
      "Text": " privileges are simply the set of privileges that if the process that execs the program"
    },
    {
      "Time_Start": 526.5400000000001,
      "Time_End": 531.4200000000001,
      "Text": " runs it, only privileges that existed in the process before will be passed on through the"
    },
    {
      "Time_Start": 531.4200000000001,
      "Time_End": 535.0200000000001,
      "Text": " proxy privileges. So it's just saying these are what will allow this program to pick up"
    },
    {
      "Time_Start": 535.0200000000001,
      "Time_End": 540.74,
      "Text": " in addition to the innate set. And authorized privileges are a set of privileges which a"
    },
    {
      "Time_Start": 540.74,
      "Time_End": 545.0600000000001,
      "Text": " program only gets if the user has an authorization. And I'll explain what authorizations mean"
    },
    {
      "Time_Start": 545.1,
      "Time_End": 552.1,
      "Text": " in just a minute. So there's lots of privilege stuff. How privileges move, just very quickly,"
    },
    {
      "Time_Start": 552.1,
      "Time_End": 556.1,
      "Text": " is if you fork a process, privileges carry across the fork. So demons that have privileges"
    },
    {
      "Time_Start": 556.1,
      "Time_End": 561.6600000000001,
      "Text": " in fork will still have privileges on their children. However, if you exec, then all of"
    },
    {
      "Time_Start": 561.6600000000001,
      "Time_End": 565.74,
      "Text": " the rules for privilege transference come into place, the innate privileges, the proxy"
    },
    {
      "Time_Start": 565.74,
      "Time_End": 571.5400000000001,
      "Text": " privileges, and the authorized privilege sets. And to give another example of that, and this"
    },
    {
      "Time_Start": 571.9399999999999,
      "Time_End": 578.9399999999999,
      "Text": " has a large effect on buffer overflow strategies on these boxes, is because you would lose"
    },
    {
      "Time_Start": 579.8199999999999,
      "Time_End": 583.5799999999999,
      "Text": " your privileges when you exec. If somebody buffer overflows a program that has privilege,"
    },
    {
      "Time_Start": 583.5799999999999,
      "Time_End": 587.14,
      "Text": " and right now what does everybody do? They use shell code. That's most of the assembly"
    },
    {
      "Time_Start": 587.14,
      "Time_End": 591.38,
      "Text": " code that's available. Well, when you exec a shell, the shell most likely will not have"
    },
    {
      "Time_Start": 591.38,
      "Time_End": 596.98,
      "Text": " any innate privileges on it, unless the administrator's an idiot. And they won't have any proxy privileges"
    },
    {
      "Time_Start": 597.14,
      "Time_End": 603.02,
      "Text": " for, most likely, for the same reason. So what happens is when you do that buffer overflow,"
    },
    {
      "Time_Start": 603.02,
      "Time_End": 605.62,
      "Text": " the person gets on the system through that process, but they're not going to have any"
    },
    {
      "Time_Start": 605.62,
      "Time_End": 612.62,
      "Text": " special access to the system. Now to kind of go through authorizations. Privileges,"
    },
    {
      "Time_Start": 612.94,
      "Time_End": 617.62,
      "Text": " as I said, are an attribute that's applied to a process, and it specifies what special"
    },
    {
      "Time_Start": 617.62,
      "Time_End": 622.54,
      "Text": " rights a process has. Authorizations are more of a user-level concept, and an authorization"
    },
    {
      "Time_Start": 622.54,
      "Time_End": 628.3,
      "Text": " simply says that if a user runs this program, they're allowed to. And it's used in a couple"
    },
    {
      "Time_Start": 628.3,
      "Time_End": 633.9399999999999,
      "Text": " ways, and I'll explain that. One thing that can happen is that a program that's run can"
    },
    {
      "Time_Start": 633.9399999999999,
      "Time_End": 639.14,
      "Text": " look up the user who's running it, because it can look at its own UID. And it will say,"
    },
    {
      "Time_Start": 639.14,
      "Time_End": 642.9,
      "Text": " does the user who's trying to run me have this authorization? For example, is this user"
    },
    {
      "Time_Start": 642.9,
      "Time_End": 647.62,
      "Text": " considered a security administrator or a system operator? And if they're one of those, then"
    },
    {
      "Time_Start": 647.62,
      "Time_End": 652.02,
      "Text": " I want to let them use me. And if they're not, then I'll exit and say there's an error."
    },
    {
      "Time_Start": 652.02,
      "Time_End": 656.62,
      "Text": " I'll only perform a limited set of functionality, or I'll drop my privileges, or I'll never"
    },
    {
      "Time_Start": 656.62,
      "Time_End": 661.78,
      "Text": " use them. And so it allows programs to decide how it should operate based on who runs them"
    },
    {
      "Time_Start": 661.78,
      "Time_End": 666.98,
      "Text": " as well. Now there's actually two sets of authorizations"
    },
    {
      "Time_Start": 666.98,
      "Time_End": 670.78,
      "Text": " which can be placed onto files, and this violates the rule that I said that this all takes place"
    },
    {
      "Time_Start": 670.78,
      "Time_End": 677.06,
      "Text": " in user space, because these are two, I guess, counter-examples of that. The first is access"
    },
    {
      "Time_Start": 677.1,
      "Time_End": 681.6600000000001,
      "Text": " authorizations. You can say on a file that only a security administrator can run this"
    },
    {
      "Time_Start": 681.6600000000001,
      "Time_End": 687.74,
      "Text": " program. Only a UID who has this authorization is allowed to run this program. And so what"
    },
    {
      "Time_Start": 687.74,
      "Time_End": 691.7800000000001,
      "Text": " happens is when that program's run, the kernel will look and see if the user who's trying"
    },
    {
      "Time_Start": 691.7800000000001,
      "Time_End": 696.5400000000001,
      "Text": " to run it has the correct authorization. If he doesn't, he can't run it. This brings up"
    },
    {
      "Time_Start": 696.5400000000001,
      "Time_End": 701.6600000000001,
      "Text": " something else I should mention about processes. Like the limiting privilege set, there's also"
    },
    {
      "Time_Start": 701.66,
      "Time_End": 708.66,
      "Text": " a limiting authorization set. And what this means is that you can put onto a process,"
    },
    {
      "Time_Start": 708.66,
      "Time_End": 712.28,
      "Text": " you can say to that process, or really to the kernel about the process, that it can"
    },
    {
      "Time_Start": 712.28,
      "Time_End": 715.5799999999999,
      "Text": " only have a certain set of authorizations. This is one of the things that we did on the"
    },
    {
      "Time_Start": 715.5799999999999,
      "Time_End": 720.06,
      "Text": " box that we put out there. Anything that's coming in through INetD has a limiting authorization"
    },
    {
      "Time_Start": 720.06,
      "Time_End": 724.2199999999999,
      "Text": " set of login, which means you can log into the system. So you can come in through Telnet,"
    },
    {
      "Time_Start": 724.2199999999999,
      "Time_End": 727.8199999999999,
      "Text": " you can come in through FTP, and you can do those sorts of things. However, once you're"
    },
    {
      "Time_Start": 727.82,
      "Time_End": 732.1800000000001,
      "Text": " on there, you can't obtain any other authorizations. So if you change to a new UID, who would normally"
    },
    {
      "Time_Start": 732.1800000000001,
      "Time_End": 735.7,
      "Text": " have the security administrator authorization, which would mean you could do lots of bad"
    },
    {
      "Time_Start": 735.7,
      "Time_End": 740.86,
      "Text": " things on the box, you won't have those authorizations, even though you're that user. And then the"
    },
    {
      "Time_Start": 740.86,
      "Time_End": 744.0200000000001,
      "Text": " last thing is the privilege authorization set. And this goes back to what I was saying"
    },
    {
      "Time_Start": 744.0200000000001,
      "Time_End": 748.46,
      "Text": " about the authorization privilege set. Just flip the two words. And what this is is a"
    },
    {
      "Time_Start": 748.46,
      "Time_End": 753.9000000000001,
      "Text": " list of authorizations placed on an executable that says, if this executable is run, then"
    },
    {
      "Time_Start": 754.02,
      "Time_End": 761.02,
      "Text": " it obtains these extra privileges, and so it gets some special abilities. With authorizations,"
    },
    {
      "Time_Start": 761.4599999999999,
      "Time_End": 764.42,
      "Text": " you create a concept of, and these are really important ones to know when you're going after"
    },
    {
      "Time_Start": 764.42,
      "Time_End": 770.02,
      "Text": " a box. Kind of historically, they're called ISSO, SA, and SO, and there can be other roles."
    },
    {
      "Time_Start": 770.02,
      "Time_End": 774.98,
      "Text": " Roles are simply a concept that you apply to your users to say that these users, excuse"
    },
    {
      "Time_Start": 774.98,
      "Time_End": 778.9,
      "Text": " me, should have special abilities on the system. An ISSO is a security officer. They should"
    },
    {
      "Time_Start": 778.9,
      "Time_End": 784.06,
      "Text": " be allowed to change security on the system. Obviously, this is a very, very trusted account."
    },
    {
      "Time_Start": 784.06,
      "Time_End": 789.54,
      "Text": " SA, system administrator, can add users. SO can reboot the system. But we don't need to"
    },
    {
      "Time_Start": 789.54,
      "Time_End": 793.8199999999999,
      "Text": " give them the root abilities that you would have on standard UNIX. We just give them the"
    },
    {
      "Time_Start": 793.8199999999999,
      "Time_End": 798.66,
      "Text": " specific authorizations that they require to do the tasks that they need to do. And"
    },
    {
      "Time_Start": 798.66,
      "Time_End": 803.8199999999999,
      "Text": " how that works is that you put authorization checks on the administrative programs, and"
    },
    {
      "Time_Start": 803.82,
      "Time_End": 807.94,
      "Text": " these programs will then check to see if the right person is running them."
    },
    {
      "Time_Start": 807.94,
      "Time_End": 814.94,
      "Text": " MAC, mandatory access control. This is a very boring definition taken from TC Sec Glossary."
    },
    {
      "Time_Start": 815.0600000000001,
      "Time_End": 819.2600000000001,
      "Text": " TC Sec is better known as the Rainbow Series. If any of you have managed to get through"
    },
    {
      "Time_Start": 819.2600000000001,
      "Time_End": 826.2600000000001,
      "Text": " all of the books, not just the orange book, congratulations. Actually, I just have a question."
    },
    {
      "Time_Start": 826.2600000000001,
      "Time_End": 830.58,
      "Text": " How many people have a set of rainbow books at home? Has everybody managed to order them?"
    },
    {
      "Time_Start": 830.58,
      "Time_End": 833.82,
      "Text": " No? All right. Well, now you want to read about Common Criteria, which is equally a"
    },
    {
      "Time_Start": 833.82,
      "Time_End": 840.82,
      "Text": " boring read. But it's good to know about. So mandatory access control is, from a historical"
    },
    {
      "Time_Start": 841.6600000000001,
      "Time_End": 845.7800000000001,
      "Text": " and a government perspective, is the idea of looking at information and saying that"
    },
    {
      "Time_Start": 845.7800000000001,
      "Time_End": 850.58,
      "Text": " this object on a system, this process or this file, is protected at a certain level. And"
    },
    {
      "Time_Start": 850.58,
      "Time_End": 854.6600000000001,
      "Text": " we all know this is things like, this is a top secret piece of information. And then"
    },
    {
      "Time_Start": 854.6600000000001,
      "Time_End": 858.5400000000001,
      "Text": " you look at processes or other objects that try to access that information. And you say,"
    },
    {
      "Time_Start": 858.54,
      "Time_End": 863.38,
      "Text": " I don't care who that person is. It doesn't matter what their UID is. All I care about"
    },
    {
      "Time_Start": 863.38,
      "Time_End": 868.18,
      "Text": " is that that process has been cleared to access this information. And what that means is that"
    },
    {
      "Time_Start": 868.18,
      "Time_End": 875.18,
      "Text": " if somebody is in a MAC level, that they can change UIDs and their access through MAC will"
    },
    {
      "Time_Start": 875.4599999999999,
      "Time_End": 881.5,
      "Text": " not change. And that's very significant and makes everybody else's job very difficult."
    },
    {
      "Time_Start": 881.5,
      "Time_End": 887.4599999999999,
      "Text": " What happens with MAC is if you create a file, whatever SL or MAC label is on your process,"
    },
    {
      "Time_Start": 887.46,
      "Time_End": 891.3000000000001,
      "Text": " that's how the file will be protected, always. There's no way for an owner of a file to"
    },
    {
      "Time_Start": 891.3000000000001,
      "Time_End": 896.46,
      "Text": " change this. This is very, very different from discretionary access control. Under DAC,"
    },
    {
      "Time_Start": 896.46,
      "Time_End": 901.3000000000001,
      "Text": " if you own the file, you can change its access controls. And the reason why this is useful"
    },
    {
      "Time_Start": 901.3000000000001,
      "Time_End": 906.5,
      "Text": " with MAC is that you can also tie this into the network. And you can say, I have an administrator"
    },
    {
      "Time_Start": 906.5,
      "Time_End": 909.74,
      "Text": " who's connecting to my system. He has a username and password. He's really smart. He comes"
    },
    {
      "Time_Start": 909.74,
      "Time_End": 915.6600000000001,
      "Text": " through SSH. But because we're using SSH, we may let other people SSH in from the Internet"
    },
    {
      "Time_Start": 915.66,
      "Time_End": 921.3,
      "Text": " because we have regular users on our system. But we also have this ISSO or security administrator"
    },
    {
      "Time_Start": 921.3,
      "Time_End": 926.06,
      "Text": " who comes in from internally. What you can do is actually apply MAC labels, as I said,"
    },
    {
      "Time_Start": 926.06,
      "Time_End": 930.3399999999999,
      "Text": " to the network layer and say, this administrator coming in internally has one type of access."
    },
    {
      "Time_Start": 930.3399999999999,
      "Time_End": 933.8199999999999,
      "Text": " Well, full access because we trust people who come in from inside. Unless they're corporate"
    },
    {
      "Time_Start": 933.8199999999999,
      "Time_End": 937.98,
      "Text": " insiders and we have a whole different set of problems. But somebody who just grabs this"
    },
    {
      "Time_Start": 937.98,
      "Time_End": 941.1,
      "Text": " guy's password and comes in from the public Internet, we don't want him to have the same"
    },
    {
      "Time_Start": 941.1,
      "Time_End": 946.5400000000001,
      "Text": " access. Under standard Unix, he does. If you're root from the inside, from the outside,"
    },
    {
      "Time_Start": 946.5400000000001,
      "Time_End": 952.02,
      "Text": " from a VPN, you're root. It doesn't matter. Using MAC, you can change that. And I'll explain"
    },
    {
      "Time_Start": 952.02,
      "Time_End": 956.74,
      "Text": " what those mechanisms are. And again, those will directly affect an attack onto a system."
    },
    {
      "Time_Start": 956.74,
      "Time_End": 960.38,
      "Text": " And kind of a corollary to this, something else that occurs is that the owner of a file"
    },
    {
      "Time_Start": 960.38,
      "Time_End": 964.78,
      "Text": " cannot give access to his file to somebody else. He can through DAC. But if he copies"
    },
    {
      "Time_Start": 964.78,
      "Time_End": 968.6600000000001,
      "Text": " it through MAC, the file will be at least as well protected as it was when it was the"
    },
    {
      "Time_Start": 968.66,
      "Time_End": 974.9399999999999,
      "Text": " original file. So only people who are cleared for a file can ever see a file."
    },
    {
      "Time_Start": 974.9399999999999,
      "Time_End": 979.62,
      "Text": " To briefly go through what an SL is. SL stands for sensitivity label. This is the kind of"
    },
    {
      "Time_Start": 979.62,
      "Time_End": 984.4599999999999,
      "Text": " the security object that's used to decide access under mandatory access control in a"
    },
    {
      "Time_Start": 984.4599999999999,
      "Time_End": 989.9399999999999,
      "Text": " model that is called the Bell Lepage model. There's two components. There's a classification,"
    },
    {
      "Time_Start": 989.9399999999999,
      "Time_End": 993.8199999999999,
      "Text": " which is things like you know, probably is unclassified, classified, secret, top secret."
    },
    {
      "Time_Start": 993.8199999999999,
      "Time_End": 997.3,
      "Text": " And then there's compartments or categories. And they're the same thing, but depending"
    },
    {
      "Time_Start": 997.3000000000001,
      "Time_End": 1000.3000000000001,
      "Text": " on where you work or where you live, they might be called one or the other. These are"
    },
    {
      "Time_Start": 1000.3000000000001,
      "Time_End": 1003.5000000000001,
      "Text": " kind of like groupings, where you might say I have a financial compartment that's being"
    },
    {
      "Time_Start": 1003.5000000000001,
      "Time_End": 1008.3000000000001,
      "Text": " protected or a cryptography department if you're working for the NSA. Or very exciting"
    },
    {
      "Time_Start": 1008.3000000000001,
      "Time_End": 1013.3000000000001,
      "Text": " names like Project A, Project B, and Project C. And SLs are written out with the classification"
    },
    {
      "Time_Start": 1013.3000000000001,
      "Time_End": 1021.2400000000001,
      "Text": " first, followed by a set of compartments. Now, how SLs, how the different pieces relate"
    },
    {
      "Time_Start": 1021.2400000000001,
      "Time_End": 1025.7,
      "Text": " to each other. The classifications are, as I said, in a hierarchical relationship. So"
    },
    {
      "Time_Start": 1025.7,
      "Time_End": 1028.94,
      "Text": " they can be equal to, greater than, or less than each other. So top secret is greater"
    },
    {
      "Time_Start": 1028.94,
      "Time_End": 1032.8600000000001,
      "Text": " than secret, is greater than confidential, is greater than unclassified. Compartments"
    },
    {
      "Time_Start": 1032.8600000000001,
      "Time_End": 1036.9,
      "Text": " work differently. They're actually placed into sets. So you have basic set relationships."
    },
    {
      "Time_Start": 1036.9,
      "Time_End": 1042.98,
      "Text": " They can be subsets, supersets, disjoint, or equal to each other. And that's just basic"
    },
    {
      "Time_Start": 1042.98,
      "Time_End": 1046.9,
      "Text": " set theory. Now, a word you're going to hear a lot if you start to play around with mandatory"
    },
    {
      "Time_Start": 1046.9,
      "Time_End": 1051.66,
      "Text": " access control is the concept of dominance, of label dominance. And in order for a label"
    },
    {
      "Time_Start": 1051.66,
      "Time_End": 1057.3400000000001,
      "Text": " to dominate another label, there's two things, two criteria that have to be met. The first"
    },
    {
      "Time_Start": 1057.3400000000001,
      "Time_End": 1061.18,
      "Text": " is that the label that's trying to dominate the other label, label one dominating label"
    },
    {
      "Time_Start": 1061.18,
      "Time_End": 1065.38,
      "Text": " two, its classification has to be equal to or greater, which makes sense. In order for"
    },
    {
      "Time_Start": 1065.38,
      "Time_End": 1068.94,
      "Text": " somebody to access a piece of information that's secret, they need to be secret or top"
    },
    {
      "Time_Start": 1068.94,
      "Time_End": 1073.7,
      "Text": " secret. You probably wouldn't let an unclassified guy come in and read that. The next piece"
    },
    {
      "Time_Start": 1073.7,
      "Time_End": 1077.8200000000002,
      "Text": " is that the compartment set has to be equal to or a superset of the other compartment"
    },
    {
      "Time_Start": 1077.82,
      "Time_End": 1085.7,
      "Text": " set. On trusted operating systems, essentially, typically, every object on a system has an"
    },
    {
      "Time_Start": 1085.7,
      "Time_End": 1090.62,
      "Text": " S.L. and is protected by MAC. That's not always necessarily true, but typically it is. But"
    },
    {
      "Time_Start": 1090.62,
      "Time_End": 1095.1,
      "Text": " most importantly, processes and files will always have S.L.s. We're not going to have"
    },
    {
      "Time_Start": 1095.1,
      "Time_End": 1100.34,
      "Text": " a very good MAC system. And again, as I mentioned, whenever processes create files, the labels"
    },
    {
      "Time_Start": 1100.34,
      "Time_End": 1104.78,
      "Text": " will be placed in the files. And when processes create new processes, the labels will transfer"
    },
    {
      "Time_Start": 1104.82,
      "Time_End": 1109.3799999999999,
      "Text": " to the new processes. So what happens is when a system boots up, it's going to have to create"
    },
    {
      "Time_Start": 1109.3799999999999,
      "Time_End": 1115.02,
      "Text": " the init process, process one, and it's going to put a default S.L. onto that process. And"
    },
    {
      "Time_Start": 1115.02,
      "Time_End": 1119.66,
      "Text": " so now when init spawns off all of its children, all of those processes will have the same"
    },
    {
      "Time_Start": 1119.66,
      "Time_End": 1123.26,
      "Text": " MAC label. Well, that's not very useful because now everybody's at the same level and it's"
    },
    {
      "Time_Start": 1123.26,
      "Time_End": 1128.62,
      "Text": " not really providing too much protection. So what we do is we put privileges on processes"
    },
    {
      "Time_Start": 1128.6200000000001,
      "Time_End": 1135.5800000000002,
      "Text": " or programs that are going to run, like login or SSHD. And what we do is we give those programs"
    },
    {
      "Time_Start": 1135.5800000000002,
      "Time_End": 1139.5800000000002,
      "Text": " the ability to change their own S.L.s. So now when somebody logs onto the system like"
    },
    {
      "Time_Start": 1139.5800000000002,
      "Time_End": 1144.3000000000002,
      "Text": " I do, it goes and says, hey, that's Jeff. I'll give him top secret all access to the"
    },
    {
      "Time_Start": 1144.3000000000002,
      "Time_End": 1147.5800000000002,
      "Text": " system. He can do whatever he wants to me. But when someone else comes in, they can get"
    },
    {
      "Time_Start": 1147.5800000000002,
      "Time_End": 1151.7,
      "Text": " a different level. And that allows you to put people at different levels in a system"
    },
    {
      "Time_Start": 1151.7,
      "Time_End": 1156.8200000000002,
      "Text": " and isolate them from each other. And I'll explain how that isolation works. This is"
    },
    {
      "Time_Start": 1156.82,
      "Time_End": 1161.02,
      "Text": " how mandatory access control works in the Bella Padula model. In order for a process"
    },
    {
      "Time_Start": 1161.02,
      "Time_End": 1168.02,
      "Text": " to read a file, a process has to have an S.L. that dominates the S.L. of the file to read."
    },
    {
      "Time_Start": 1168.98,
      "Time_End": 1175.26,
      "Text": " In order to write to a file, a process has to be equal to the S.L. of the file. Not dominate,"
    },
    {
      "Time_Start": 1175.26,
      "Time_End": 1179.7,
      "Text": " equal to it. And now I'll give you an example of how this applies. If you have a system"
    },
    {
      "Time_Start": 1179.7,
      "Time_End": 1182.98,
      "Text": " and you place every file in the system at implementation low, which is the lowest S.L."
    },
    {
      "Time_Start": 1182.98,
      "Time_End": 1187.66,
      "Text": " you can have on a system, that means every S.L. dominates it and thus has read access"
    },
    {
      "Time_Start": 1187.66,
      "Time_End": 1191.38,
      "Text": " to it. But then you go and you put on log in and you say, every user that logs into"
    },
    {
      "Time_Start": 1191.38,
      "Time_End": 1194.78,
      "Text": " the system, place them at confidential. Well, now every user that comes on a system has"
    },
    {
      "Time_Start": 1194.78,
      "Time_End": 1199.46,
      "Text": " read access, but they don't have write access to any files on the system, no matter what"
    },
    {
      "Time_Start": 1199.46,
      "Time_End": 1203.42,
      "Text": " user ID they become, no matter what they do on the system. They only have read access"
    },
    {
      "Time_Start": 1203.42,
      "Time_End": 1210.42,
      "Text": " to the system. Processes have two other S.L.s applied to them. There's concept of minimum"
    },
    {
      "Time_Start": 1211.1000000000001,
      "Time_End": 1217.0600000000002,
      "Text": " and maximum clearance. And what this means is simply that the process's effective S.L."
    },
    {
      "Time_Start": 1217.0600000000002,
      "Time_End": 1222.22,
      "Text": " can go between these two ranges. And in fact, the only way for a process to change its effective"
    },
    {
      "Time_Start": 1222.22,
      "Time_End": 1227.1000000000001,
      "Text": " S.L. is if it has privileges or it has access to an administrative program that will allow"
    },
    {
      "Time_Start": 1227.1000000000001,
      "Time_End": 1231.22,
      "Text": " it to change that. Typically you don't give people the ability to do this because you"
    },
    {
      "Time_Start": 1231.22,
      "Time_End": 1235.5800000000002,
      "Text": " want to lock them in at a specific S.L. so that they can't get out and change other pieces"
    },
    {
      "Time_Start": 1235.58,
      "Time_End": 1241.34,
      "Text": " of the system. And secondarily, directories and devices have a second S.L. which is called"
    },
    {
      "Time_Start": 1241.34,
      "Time_End": 1246.6599999999999,
      "Text": " a maximum S.L. So they actually have a minimum and a maximum. Files are single level containers."
    },
    {
      "Time_Start": 1246.6599999999999,
      "Time_End": 1249.9399999999998,
      "Text": " So they have one S.L. That's the S.L. that they're protected at. Directories can have"
    },
    {
      "Time_Start": 1249.9399999999998,
      "Time_End": 1253.6399999999999,
      "Text": " lots of files in them. These files can be at different levels. Implementation low, top"
    },
    {
      "Time_Start": 1253.6399999999999,
      "Time_End": 1258.34,
      "Text": " secret all. So you might put a range on a directory to allow people to put more types"
    },
    {
      "Time_Start": 1258.34,
      "Time_End": 1262.02,
      "Text": " of information in there. And devices are the same way. Some devices you may want to allow"
    },
    {
      "Time_Start": 1262.1399999999999,
      "Time_End": 1267.1399999999999,
      "Text": " many people to connect to. Other devices you only want one person to connect to, like DevKMM."
    },
    {
      "Time_Start": 1267.1399999999999,
      "Time_End": 1273.26,
      "Text": " Now just to show here, this is kind of a logging example. What will happen on most trusted"
    },
    {
      "Time_Start": 1273.26,
      "Time_End": 1277.46,
      "Text": " operating systems is that you'll have a database which will store security information, like"
    },
    {
      "Time_Start": 1277.46,
      "Time_End": 1281.54,
      "Text": " a clearance file, which will store minimum, maximum clearance, and then a default clearance"
    },
    {
      "Time_Start": 1281.54,
      "Time_End": 1286.1399999999999,
      "Text": " that's S.L. that someone would log in at. And under Pitbull, it's stored in S.E. Security"
    },
    {
      "Time_Start": 1286.14,
      "Time_End": 1291.9,
      "Text": " Clear and other trusted operating systems, it's elsewhere. Also, log in and some other"
    },
    {
      "Time_Start": 1291.9,
      "Time_End": 1296.46,
      "Text": " programs may give the ability to a user to decide a session level that they would like"
    },
    {
      "Time_Start": 1296.46,
      "Time_End": 1301.46,
      "Text": " to connect to the system at. So here we say, set my effective S.L. to other S.L. A.B. They"
    },
    {
      "Time_Start": 1301.46,
      "Time_End": 1305.5,
      "Text": " can request that. If you want somebody to always and only log in at one S.L., you make"
    },
    {
      "Time_Start": 1305.5,
      "Time_End": 1308.7800000000002,
      "Text": " their minimum, their maximum, and their default the same. And they're locked into this compartment."
    },
    {
      "Time_Start": 1308.7800000000002,
      "Time_End": 1313.8200000000002,
      "Text": " All right. This is the last bit on the trusted operating system part when we get to the interesting"
    },
    {
      "Time_Start": 1313.82,
      "Time_End": 1318.54,
      "Text": " bits. This is very important because it's significantly different than any of the other"
    },
    {
      "Time_Start": 1318.54,
      "Time_End": 1323.34,
      "Text": " mechanisms on standard Unix. And it's the idea of putting access control information"
    },
    {
      "Time_Start": 1323.34,
      "Time_End": 1327.8999999999999,
      "Text": " in the network layer. Not just at the IP layer, but all the way down through under Solaris"
    },
    {
      "Time_Start": 1327.8999999999999,
      "Time_End": 1332.62,
      "Text": " it would be streams, through wherever your data flow model is on the OS. And you can"
    },
    {
      "Time_Start": 1332.62,
      "Time_End": 1337.1799999999998,
      "Text": " place rules on the system which say if data comes in from a specific interface, from a"
    },
    {
      "Time_Start": 1337.18,
      "Time_End": 1343.9,
      "Text": " specific host, over a port, using a protocol, basic firewalling rules, then you apply security"
    },
    {
      "Time_Start": 1343.9,
      "Time_End": 1348.8200000000002,
      "Text": " labels to that. And then what you can do is restrict processes running on the system based"
    },
    {
      "Time_Start": 1348.8200000000002,
      "Time_End": 1354.22,
      "Text": " on their S.L.s, who they can talk to because of this security information. And you can"
    },
    {
      "Time_Start": 1354.22,
      "Time_End": 1358.74,
      "Text": " also restrict how information go out and how information come in. And this is different"
    },
    {
      "Time_Start": 1358.74,
      "Time_End": 1364.6200000000001,
      "Text": " too than under Unix. Because what happens is once you get, when you're in a system and"
    },
    {
      "Time_Start": 1364.6200000000001,
      "Time_End": 1369.6200000000001,
      "Text": " you do filtering, you can say either people can get in or can come out. But you can't"
    },
    {
      "Time_Start": 1369.6200000000001,
      "Time_End": 1373.8200000000002,
      "Text": " say I want to allow this process out, but I don't want to allow that process out. So"
    },
    {
      "Time_Start": 1373.8200000000002,
      "Time_End": 1378.6200000000001,
      "Text": " you can do some pretty interesting things with that. This is a very basic example of"
    },
    {
      "Time_Start": 1378.6200000000001,
      "Time_End": 1381.74,
      "Text": " a network rule. I've cut out a lot of some of the extra stuff that doesn't matter for"
    },
    {
      "Time_Start": 1381.74,
      "Time_End": 1386.1000000000001,
      "Text": " this talk. You can see from the top part that it's essentially a standard firewalling rule."
    },
    {
      "Time_Start": 1386.1000000000001,
      "Time_End": 1390.38,
      "Text": " We specify ports, not mask. Here we're looking at a 192.0.0 network. And we're looking at"
    },
    {
      "Time_Start": 1390.38,
      "Time_End": 1394.46,
      "Text": " TCP protocol. The next part that's different though from a firewalling rule is the idea"
    },
    {
      "Time_Start": 1394.46,
      "Time_End": 1400.14,
      "Text": " of specifying a minimum and a maximum S.L. range on this interface or on this rule."
    },
    {
      "Time_Start": 1400.14,
      "Time_End": 1405.66,
      "Text": " This is the types of data that you allow to flow out of this rule. So here basically we're"
    },
    {
      "Time_Start": 1405.66,
      "Time_End": 1410.3400000000001,
      "Text": " saying anybody can send information out through this, that applies to this rule. However,"
    },
    {
      "Time_Start": 1410.3400000000001,
      "Time_End": 1414.74,
      "Text": " a very important piece is this default S.L. and here it's confidential A. And what this"
    },
    {
      "Time_Start": 1414.74,
      "Time_End": 1418.1000000000001,
      "Text": " does is it's saying that every piece of data that comes into the system will be marked"
    },
    {
      "Time_Start": 1418.1000000000001,
      "Time_End": 1422.22,
      "Text": " at this level. So now processes have to dominate this label in order to be able to read the"
    },
    {
      "Time_Start": 1422.26,
      "Time_End": 1427.9,
      "Text": " information, to be able to access it. And here's a big blocky diagram kind of summing"
    },
    {
      "Time_Start": 1427.9,
      "Time_End": 1431.98,
      "Text": " all this up to show you why this actually means something. On this we have two processes"
    },
    {
      "Time_Start": 1431.98,
      "Time_End": 1435.9,
      "Text": " running. We have a web server and an SQL server. The web server is running at confidential"
    },
    {
      "Time_Start": 1435.9,
      "Time_End": 1442.6200000000001,
      "Text": " HTTP. HTTP is a compartment. And we also have an SQL server running at con SQL. One of the"
    },
    {
      "Time_Start": 1442.6200000000001,
      "Time_End": 1446.42,
      "Text": " things right here is you'll notice that the S.L.s are disjoint from each other. And what"
    },
    {
      "Time_Start": 1446.42,
      "Time_End": 1450.98,
      "Text": " this means is that the web server can't access the SQL server. It can't access it over the"
    },
    {
      "Time_Start": 1450.98,
      "Time_End": 1455.58,
      "Text": " network internally. And it can't access its files because here I'm assuming that the files"
    },
    {
      "Time_Start": 1455.58,
      "Time_End": 1460.3,
      "Text": " are protected at that level. Another thing that we can do is place the web server's files,"
    },
    {
      "Time_Start": 1460.3,
      "Time_End": 1465.54,
      "Text": " its content, its binaries, CGI programs, at confidential. And what that does is it gives"
    },
    {
      "Time_Start": 1465.54,
      "Time_End": 1470.66,
      "Text": " the web server read only access to its files, but not write access. So now if somebody comes"
    },
    {
      "Time_Start": 1470.66,
      "Time_End": 1475.58,
      "Text": " in and breaks through CGI bin programs that are written poorly, which happens on occasion,"
    },
    {
      "Time_Start": 1475.58,
      "Time_End": 1479.5,
      "Text": " then they're only going to have read access to these files. And they can become root,"
    },
    {
      "Time_Start": 1479.5,
      "Time_End": 1483.06,
      "Text": " they can become ISSO, they can become any user they want to, but they're locked into"
    },
    {
      "Time_Start": 1483.06,
      "Time_End": 1487.26,
      "Text": " this Mac compartment that only has read access to the files. So very quickly you have a read"
    },
    {
      "Time_Start": 1487.26,
      "Time_End": 1492.34,
      "Text": " only web server. And that's just a very simple application of what you can do here. And then"
    },
    {
      "Time_Start": 1492.34,
      "Time_End": 1497.58,
      "Text": " basically what the networking rules do is it allows you to set up these data flows,"
    },
    {
      "Time_Start": 1497.58,
      "Time_End": 1502.02,
      "Text": " for example, here on port 80 to the web server that allow some people to connect in and keep"
    },
    {
      "Time_Start": 1502.02,
      "Time_End": 1505.3,
      "Text": " other people from connecting. So for example, on the main interface we have port 80 con"
    },
    {
      "Time_Start": 1505.3,
      "Time_End": 1509.3799999999999,
      "Text": " HTTP, which allows, it's a general rule which allows anybody to connect through that port"
    },
    {
      "Time_Start": 1509.3799999999999,
      "Time_End": 1514.34,
      "Text": " at that level. But the interface default is confidential default, which means that anybody"
    },
    {
      "Time_Start": 1514.34,
      "Time_End": 1517.82,
      "Text": " coming in through this interface will get marked at that if they go anywhere else besides"
    },
    {
      "Time_Start": 1517.82,
      "Time_End": 1521.58,
      "Text": " the web server, which then means they can't talk to the SQL server. But it's not so much"
    },
    {
      "Time_Start": 1521.58,
      "Time_End": 1524.58,
      "Text": " the filtering aspects that are important, because you can do those, you can accomplish"
    },
    {
      "Time_Start": 1524.58,
      "Time_End": 1528.5,
      "Text": " those things with firewalls. It's the fact that you can now isolate your processes and"
    },
    {
      "Time_Start": 1528.5,
      "Time_End": 1532.34,
      "Text": " your subsystems from each other, which we did a whole lot of on the web, on our system"
    },
    {
      "Time_Start": 1532.38,
      "Time_End": 1536.5800000000002,
      "Text": " that we're letting people hack. And you can trap people in these."
    },
    {
      "Time_Start": 1536.5800000000002,
      "Time_End": 1545.5800000000002,
      "Text": " All right. The fun stuff. Hacking B1 trusted operating systems. The first thing, and I"
    },
    {
      "Time_Start": 1545.5800000000002,
      "Time_End": 1548.6200000000001,
      "Text": " mentioned this before, that you have to do is you have to change your mindset. Because"
    },
    {
      "Time_Start": 1548.6200000000001,
      "Time_End": 1553.1000000000001,
      "Text": " what you're attacking is not the same. And the types of attacks that you would use, while"
    },
    {
      "Time_Start": 1553.1000000000001,
      "Time_End": 1557.2600000000002,
      "Text": " it might yield some kind of access, will probably not yield the type of access that you're usually"
    },
    {
      "Time_Start": 1557.26,
      "Time_End": 1562.5,
      "Text": " going for. Keep it in your head. Root and UID zero has no special meaning on these"
    },
    {
      "Time_Start": 1562.5,
      "Time_End": 1568.9,
      "Text": " systems. UID zero is no different than UID 1024. Access to files, anything that you're"
    },
    {
      "Time_Start": 1568.9,
      "Time_End": 1573.86,
      "Text": " trying to get to, is controlled by both DAC and MAC. So when I start talking about you"
    },
    {
      "Time_Start": 1573.86,
      "Time_End": 1577.34,
      "Text": " need to have this type of SL or this to pass a MAC check, and I don't talk about DAC, it's"
    },
    {
      "Time_Start": 1577.34,
      "Time_End": 1580.9,
      "Text": " because I'm assuming that everybody already understands how permission bits work. You"
    },
    {
      "Time_Start": 1580.9,
      "Time_End": 1588.02,
      "Text": " have to pass both checks, though. So now, if you can, if you get past MAC, which can"
    },
    {
      "Time_Start": 1588.02,
      "Time_End": 1593.5800000000002,
      "Text": " only be, can only be done, excuse me, by obtaining privileges, then you get to, you're still"
    },
    {
      "Time_Start": 1593.5800000000002,
      "Time_End": 1598.5400000000002,
      "Text": " back to the standard DAC problem. You have to become user or you have to obtain privileges"
    },
    {
      "Time_Start": 1598.5400000000002,
      "Time_End": 1608.5800000000002,
      "Text": " in order to circumvent DAC. All right. The corollary to root access on a standard system."
    },
    {
      "Time_Start": 1608.78,
      "Time_End": 1613.86,
      "Text": " Root access is, under a trusted operating system, is essentially having access to all"
    },
    {
      "Time_Start": 1613.86,
      "Time_End": 1616.9399999999998,
      "Text": " administrative commands. That they'll let you run them and do whatever you want to do"
    },
    {
      "Time_Start": 1616.9399999999998,
      "Time_End": 1620.1399999999999,
      "Text": " on the system. They'll let you give you all the privileges. They'll let you change files."
    },
    {
      "Time_Start": 1620.1399999999999,
      "Time_End": 1624.74,
      "Text": " If you can do all of those things, then you really have complete access to the system."
    },
    {
      "Time_Start": 1624.74,
      "Time_End": 1629.86,
      "Text": " So now you're not so much going after a UID as you are going after authorizations or privileges"
    },
    {
      "Time_Start": 1629.86,
      "Time_End": 1634.34,
      "Text": " and also getting yourself to a correct SL. So now we have new problems when we attack"
    },
    {
      "Time_Start": 1634.34,
      "Time_End": 1637.98,
      "Text": " a system. You have to figure out what are the files or what is the information that"
    },
    {
      "Time_Start": 1637.98,
      "Time_End": 1641.8600000000001,
      "Text": " you're going after? How is it protected? How can I get to the level that it's protected"
    },
    {
      "Time_Start": 1641.8600000000001,
      "Time_End": 1645.14,
      "Text": " at so that I can access it? If I just need to read it, it's one problem. If I need to"
    },
    {
      "Time_Start": 1645.14,
      "Time_End": 1649.18,
      "Text": " write to it, it's an entirely different problem. And then how can I get the, how can I get"
    },
    {
      "Time_Start": 1649.18,
      "Time_End": 1652.58,
      "Text": " the authorizations that I need in order to run the programs that I need to run to do"
    },
    {
      "Time_Start": 1652.58,
      "Time_End": 1656.5,
      "Text": " this? And of course, if you can figure out some great way to hack a process that happens"
    },
    {
      "Time_Start": 1656.5,
      "Time_End": 1661.3,
      "Text": " to have all privileges on it, then you're pretty much done as well."
    },
    {
      "Time_Start": 1661.3,
      "Time_End": 1665.22,
      "Text": " Set UID programs aren't quite the juicy target they used to be because set UID under trusted"
    },
    {
      "Time_Start": 1665.22,
      "Time_End": 1669.5,
      "Text": " operating systems performs one function. It changes your user ID. Well, you can become"
    },
    {
      "Time_Start": 1669.5,
      "Time_End": 1674.78,
      "Text": " another user ID that might give you more authorizations on a system because a user ID might have them."
    },
    {
      "Time_Start": 1674.78,
      "Time_End": 1679.7,
      "Text": " But if the system is set up correctly, you're probably stuck in a limiting authorization"
    },
    {
      "Time_Start": 1679.7,
      "Time_End": 1683.1000000000001,
      "Text": " set where you can't get them like we did on the machine we're letting people try and break"
    },
    {
      "Time_Start": 1683.1000000000001,
      "Time_End": 1686.78,
      "Text": " into. The thing to remember is when you're going"
    },
    {
      "Time_Start": 1686.78,
      "Time_End": 1690.66,
      "Text": " after a set UID, you're not going to be changing your SL. You're still going to be locked into"
    },
    {
      "Time_Start": 1690.66,
      "Time_End": 1694.94,
      "Text": " this level and isolated from the rest of the system. Even though you might all of a sudden"
    },
    {
      "Time_Start": 1694.94,
      "Time_End": 1699.74,
      "Text": " start passing DAC checks, you're not going to be passing the MAC checks."
    },
    {
      "Time_Start": 1699.74,
      "Time_End": 1703.5800000000002,
      "Text": " So now what you need to do instead of looking for set UID programs is look for executables"
    },
    {
      "Time_Start": 1703.5800000000002,
      "Time_End": 1707.7,
      "Text": " and daemons that are running with privilege with special access. If you can find those,"
    },
    {
      "Time_Start": 1707.7,
      "Time_End": 1710.78,
      "Text": " those are the programs that you need to break so that you can obtain the privileges or the"
    },
    {
      "Time_Start": 1710.78,
      "Time_End": 1716.42,
      "Text": " authorizations that you need in order to get into the system."
    },
    {
      "Time_Start": 1716.42,
      "Time_End": 1720.5800000000002,
      "Text": " There's kind of two ways to go after privilege programs and obviously there's more than this,"
    },
    {
      "Time_Start": 1720.58,
      "Time_End": 1724.8999999999999,
      "Text": " but I just want to talk about two because they're a little bit different because of"
    },
    {
      "Time_Start": 1724.8999999999999,
      "Time_End": 1729.26,
      "Text": " trusted operating system natures. As I mentioned, buffer overflows that create"
    },
    {
      "Time_Start": 1729.26,
      "Time_End": 1734.9399999999998,
      "Text": " a shield, a shell, will not yield privileges because you're doing an exec and you'll lose"
    },
    {
      "Time_Start": 1734.9399999999998,
      "Time_End": 1737.3799999999999,
      "Text": " those privileges. So now what needs to happen is people need"
    },
    {
      "Time_Start": 1737.3799999999999,
      "Time_End": 1740.6599999999999,
      "Text": " to go out and start writing new shell code. The shell code needs to do a little bit more"
    },
    {
      "Time_Start": 1740.6599999999999,
      "Time_End": 1745.58,
      "Text": " creative work. It's going to have to go out and find authorization tables, modify those,"
    },
    {
      "Time_Start": 1745.58,
      "Time_End": 1748.58,
      "Text": " modify clearance databases so that you can log in at a level that you want to log in"
    },
    {
      "Time_Start": 1748.58,
      "Time_End": 1752.1799999999998,
      "Text": " at and modify network labeling rules so that if you come in over the network you can gain"
    },
    {
      "Time_Start": 1752.1799999999998,
      "Time_End": 1760.1,
      "Text": " access in the way that you'd like to. One of the first things to check on a B1 operating"
    },
    {
      "Time_Start": 1760.1,
      "Time_End": 1764.8999999999999,
      "Text": " system, and don't bother checking on Pitbull because this is not a problem, but it's still"
    },
    {
      "Time_Start": 1764.8999999999999,
      "Time_End": 1770.82,
      "Text": " worth mentioning because you should look for it, is the idea of trusted library paths."
    },
    {
      "Time_Start": 1770.82,
      "Time_End": 1775.4199999999998,
      "Text": " On some systems you may have run into a little issue if you run a set UID program and you"
    },
    {
      "Time_Start": 1775.42,
      "Time_End": 1781.8600000000001,
      "Text": " can specify a, or a program running as root, and you can specify a library path to look"
    },
    {
      "Time_Start": 1781.8600000000001,
      "Time_End": 1785.3000000000002,
      "Text": " for libraries so you can get it to use a different library than it was intended to. In other"
    },
    {
      "Time_Start": 1785.3000000000002,
      "Time_End": 1788.78,
      "Text": " words, you can say, hey, use this great library I wrote in slash temp instead of slash lib."
    },
    {
      "Time_Start": 1788.78,
      "Time_End": 1791.8200000000002,
      "Text": " Well, if you can do that, obviously you can get a program running as root to do whatever"
    },
    {
      "Time_Start": 1791.8200000000002,
      "Time_End": 1796.38,
      "Text": " you want it to, if you can get it to run commands or anything you've written in the library."
    },
    {
      "Time_Start": 1796.38,
      "Time_End": 1799.8600000000001,
      "Text": " The same thing is true of privilege programs. It's the same kind of attack, it's just now"
    },
    {
      "Time_Start": 1799.8600000000001,
      "Time_End": 1804.42,
      "Text": " you're going for privilege programs. So it's really quick and easy to check, you know,"
    },
    {
      "Time_Start": 1804.42,
      "Time_End": 1808.18,
      "Text": " setting the environment variable paths and see if that works, because if you do that,"
    },
    {
      "Time_Start": 1808.18,
      "Time_End": 1813.1000000000001,
      "Text": " you have access to the system very easily, and without a whole lot of creativity. And"
    },
    {
      "Time_Start": 1813.1000000000001,
      "Time_End": 1815.98,
      "Text": " if you can't do that, then you need to find locations where libraries are located and"
    },
    {
      "Time_Start": 1815.98,
      "Time_End": 1822.3000000000002,
      "Text": " try and get some in there and get people to use them, which is an obvious attack."
    },
    {
      "Time_Start": 1822.3000000000002,
      "Time_End": 1826.66,
      "Text": " The thing to remember now as well is because before we used to play set UID zero on programs"
    },
    {
      "Time_Start": 1826.66,
      "Time_End": 1830.38,
      "Text": " that we needed to do special things, now we have limited privilege sets, which means that"
    },
    {
      "Time_Start": 1830.42,
      "Time_End": 1835.22,
      "Text": " if you're going after the mount command, it's only going to yield the mount privilege. It's"
    },
    {
      "Time_Start": 1835.22,
      "Time_End": 1839.5,
      "Text": " not going to yield special file system access. So lots of programs that we may have normally"
    },
    {
      "Time_Start": 1839.5,
      "Time_End": 1845.18,
      "Text": " went after before are not going to be yielding the type of access that we want. So now you"
    },
    {
      "Time_Start": 1845.18,
      "Time_End": 1848.98,
      "Text": " have to be a little choosier over the programs that you're going for. Though, of course,"
    },
    {
      "Time_Start": 1848.98,
      "Time_End": 1851.8600000000001,
      "Text": " if you can get a privilege that lets you insert curl modules, that's great, and you can get"
    },
    {
      "Time_Start": 1851.8600000000001,
      "Time_End": 1856.2600000000002,
      "Text": " everything else from there."
    },
    {
      "Time_Start": 1856.2600000000002,
      "Time_End": 1859.0600000000002,
      "Text": " And the last item on the last slide, which I should mention too, is probably one of the"
    },
    {
      "Time_Start": 1859.06,
      "Time_End": 1864.02,
      "Text": " most important things to go after are processes that give you the ability to override security"
    },
    {
      "Time_Start": 1864.02,
      "Time_End": 1868.54,
      "Text": " checks, mandatory access control and DAC checks, and also, very importantly, processes which"
    },
    {
      "Time_Start": 1868.54,
      "Time_End": 1872.98,
      "Text": " have the ability to set privileges on processes. It's clearly one of the most important privileges"
    },
    {
      "Time_Start": 1872.98,
      "Time_End": 1876.7,
      "Text": " that exist. And if you can get that, then you can give yourself whatever you need to"
    },
    {
      "Time_Start": 1876.7,
      "Time_End": 1880.1799999999998,
      "Text": " do the work that you want to."
    },
    {
      "Time_Start": 1880.1799999999998,
      "Time_End": 1883.8799999999999,
      "Text": " Getting files into system directories is a little trickier. It's not just becoming the"
    },
    {
      "Time_Start": 1883.8799999999999,
      "Time_End": 1888.3799999999999,
      "Text": " user ID. Now you have to be the right SL to place information in there. And you can look"
    },
    {
      "Time_Start": 1888.38,
      "Time_End": 1892.74,
      "Text": " at directories on a Pitbull system, for example, with a program called SecLS. Minus S gives"
    },
    {
      "Time_Start": 1892.74,
      "Time_End": 1895.8600000000001,
      "Text": " you the SL on the directories."
    },
    {
      "Time_Start": 1895.8600000000001,
      "Time_End": 1900.5,
      "Text": " Some directories are going to be created multilevel, which means they allow a range of data to"
    },
    {
      "Time_Start": 1900.5,
      "Time_End": 1904.9,
      "Text": " be placed into them. So if you're an attacker and you exist in a range that allows you to"
    },
    {
      "Time_Start": 1904.9,
      "Time_End": 1908.8200000000002,
      "Text": " put information in there, like say, for example, slash lib, they don't make it, it's not made"
    },
    {
      "Time_Start": 1908.8200000000002,
      "Time_End": 1913.22,
      "Text": " a single level directory. Then if you're an attacker, you can put information in there"
    },
    {
      "Time_Start": 1913.22,
      "Time_End": 1916.6200000000001,
      "Text": " if you can pass the DAC check, which means all you have to do is guess maybe the root"
    },
    {
      "Time_Start": 1916.6200000000001,
      "Time_End": 1920.3000000000002,
      "Text": " password or an ISSO password or somebody who would have write access into that directory."
    },
    {
      "Time_Start": 1920.3000000000002,
      "Time_End": 1924.6200000000001,
      "Text": " Now all of a sudden you went and circumvented MAC checks. And now you can make your libraries"
    },
    {
      "Time_Start": 1924.6200000000001,
      "Time_End": 1929.7800000000002,
      "Text": " or things in Etsy or wherever it is that you're going after available to other people to use"
    },
    {
      "Time_Start": 1929.7800000000002,
      "Time_End": 1932.0600000000002,
      "Text": " and break their boxes with."
    },
    {
      "Time_Start": 1932.0600000000002,
      "Time_End": 1935.7,
      "Text": " Single level directories are a little trickier because they force you to be specifically"
    },
    {
      "Time_Start": 1935.7,
      "Time_End": 1940.5600000000002,
      "Text": " at that level to do this type of work. So one of the first things that you should do"
    },
    {
      "Time_Start": 1940.5600000000002,
      "Time_End": 1945.46,
      "Text": " is search a machine for multilevel system type directories. Then it becomes really just"
    },
    {
      "Time_Start": 1945.46,
      "Time_End": 1949.14,
      "Text": " the old problem of becoming that user ID."
    },
    {
      "Time_Start": 1949.14,
      "Time_End": 1952.02,
      "Text": " The next thing is if you have a multilevel directory that has a range on it that you"
    },
    {
      "Time_Start": 1952.02,
      "Time_End": 1956.22,
      "Text": " fall into, and you can become the user who owns that directory, you can also remove the"
    },
    {
      "Time_Start": 1956.22,
      "Time_End": 1961.74,
      "Text": " directory and thus getting rid of the files that are underneath it. And this is significant"
    },
    {
      "Time_Start": 1961.74,
      "Time_End": 1965.14,
      "Text": " because there can actually be files in the directory that you wouldn't have access to,"
    },
    {
      "Time_Start": 1965.14,
      "Time_End": 1970.26,
      "Text": " but you may want to replace. Like for example, in Etsy, there's a little file called shadow."
    },
    {
      "Time_Start": 1970.26,
      "Time_End": 1973.82,
      "Text": " And that's usually protected at the highest level the system can protect it at. While"
    },
    {
      "Time_Start": 1973.9399999999998,
      "Time_End": 1978.1399999999999,
      "Text": " if you can become implementation low, and slash Etsy is a multilevel directory from"
    },
    {
      "Time_Start": 1978.1399999999999,
      "Time_End": 1982.06,
      "Text": " below to TSL, you can blow away Etsy, replace it, put a new Etsy in there with a shadow"
    },
    {
      "Time_Start": 1982.06,
      "Time_End": 1986.3799999999999,
      "Text": " that you like. And again, you know, now you have more access to the system or the security"
    },
    {
      "Time_Start": 1986.3799999999999,
      "Time_End": 1989.74,
      "Text": " clearance files or things like that. And you can replace the lib, you know, the attack"
    },
    {
      "Time_Start": 1989.74,
      "Time_End": 1994.06,
      "Text": " applies obviously to all directories. And again, this allows you to circumvent the mandatory"
    },
    {
      "Time_Start": 1994.06,
      "Time_End": 1998.78,
      "Text": " access control checks placed on a system."
    },
    {
      "Time_Start": 1998.78,
      "Time_End": 2002.5,
      "Text": " Obviously it's very important to get a new SL because chances are the SL that you log"
    },
    {
      "Time_Start": 2002.5,
      "Time_End": 2006.7,
      "Text": " into a system is not one that you want, but one that the administrator wants you to have."
    },
    {
      "Time_Start": 2006.7,
      "Time_End": 2012.22,
      "Text": " So start looking for ways to change it. There's a few different ways to do this. You can set"
    },
    {
      "Time_Start": 2012.22,
      "Time_End": 2015.66,
      "Text": " it, sometimes in systems you can set it for your session as I mentioned before, or you"
    },
    {
      "Time_Start": 2015.66,
      "Time_End": 2019.5,
      "Text": " can ask you to a new user which might change your effective SL. And you can also leverage"
    },
    {
      "Time_Start": 2019.5,
      "Time_End": 2023.42,
      "Text": " networking connections to get to new levels."
    },
    {
      "Time_Start": 2023.42,
      "Time_End": 2027.7,
      "Text": " Setting your session SL can be done through a couple different ways typically. For example,"
    },
    {
      "Time_Start": 2027.7,
      "Time_End": 2032.2,
      "Text": " we have a program we call Trusted SSH, which is essentially a trusted operating system"
    },
    {
      "Time_Start": 2032.2,
      "Time_End": 2037.72,
      "Text": " aware SSH that lets you specify your effective SL. One thing though, again, is that your"
    },
    {
      "Time_Start": 2037.72,
      "Time_End": 2042.28,
      "Text": " effective SL has to be within your minimum maximum clearance as specified in some sort"
    },
    {
      "Time_Start": 2042.28,
      "Time_End": 2048.52,
      "Text": " of clearance database unless they've implemented it in a very, very broken way."
    },
    {
      "Time_Start": 2048.52,
      "Time_End": 2051.96,
      "Text": " Another example of something that can be used to get different access on a system, if you're"
    },
    {
      "Time_Start": 2051.96,
      "Time_End": 2057.2400000000002,
      "Text": " able to get user passwords, and this is true on a Pitbull system, if you do an SU dash"
    },
    {
      "Time_Start": 2057.2400000000002,
      "Time_End": 2061.52,
      "Text": " and you're saying I want to change to this new user, your effective SL will be changed."
    },
    {
      "Time_Start": 2061.52,
      "Time_End": 2065.7599999999998,
      "Text": " So if all of your system files are protected at implementation low, you get the root password,"
    },
    {
      "Time_Start": 2065.7599999999998,
      "Time_End": 2069.72,
      "Text": " you do SU dash root and his default clearance is in below, all of a sudden you have access"
    },
    {
      "Time_Start": 2069.72,
      "Time_End": 2073.68,
      "Text": " to all the system files and the game's over."
    },
    {
      "Time_Start": 2073.68,
      "Time_End": 2079.2,
      "Text": " So again though, when you do an SU dash, most likely your effective SL will have to be in"
    },
    {
      "Time_Start": 2079.2,
      "Time_End": 2081.96,
      "Text": " the range of your clearance, otherwise it won't let you do that. And that's true under"
    },
    {
      "Time_Start": 2081.96,
      "Time_End": 2084.7599999999998,
      "Text": " Pitbull and hopefully true under other systems."
    },
    {
      "Time_Start": 2084.7599999999998,
      "Time_End": 2089.48,
      "Text": " Now authorizations. Because authorizations are tied to user ID, becoming a new user can"
    },
    {
      "Time_Start": 2089.48,
      "Time_End": 2093.36,
      "Text": " still have a great effect on a system if the administrative commands are not protected"
    },
    {
      "Time_Start": 2093.36,
      "Time_End": 2097.08,
      "Text": " at a level that prohibits you from getting to them, which hopefully when someone's configuring"
    },
    {
      "Time_Start": 2097.08,
      "Time_End": 2100.4,
      "Text": " a system, that's exactly what they do. For example, on the box that we have out there,"
    },
    {
      "Time_Start": 2100.4,
      "Time_End": 2104.32,
      "Text": " we put everything at TSL, top secret all, which essentially means nobody has access"
    },
    {
      "Time_Start": 2104.32,
      "Time_End": 2110.56,
      "Text": " to them except for one user who comes in over SSH who uses an RSA key, a 1024 bit RSA key."
    },
    {
      "Time_Start": 2110.56,
      "Time_End": 2114.04,
      "Text": " Well unless somebody guesses that key, there's really no way for them to get into the system"
    },
    {
      "Time_Start": 2114.04,
      "Time_End": 2118.32,
      "Text": " at that level. And again, I should mention again, beware the limiting authorization set"
    },
    {
      "Time_Start": 2118.32,
      "Time_End": 2124.28,
      "Text": " because now SUing to other users doesn't help you."
    },
    {
      "Time_Start": 2124.28,
      "Time_End": 2129.1600000000003,
      "Text": " RC scripts. Obviously on any system, if you can modify the RC scripts, even a standard"
    },
    {
      "Time_Start": 2129.1600000000003,
      "Time_End": 2132.88,
      "Text": " Unix system, you probably have a lot of power. And on standard Unix, you've already rooted"
    },
    {
      "Time_Start": 2132.88,
      "Time_End": 2137.04,
      "Text": " the box. On our trusted operating systems, though, it's a little bit different. If you"
    },
    {
      "Time_Start": 2137.04,
      "Time_End": 2141.0,
      "Text": " get access to an RC script, though, you have pretty much access to the whole system after"
    },
    {
      "Time_Start": 2141.0,
      "Time_End": 2145.7200000000003,
      "Text": " reboot. And the reason is is that RC scripts are typically either launched with lots of"
    },
    {
      "Time_Start": 2145.7200000000003,
      "Time_End": 2149.84,
      "Text": " privileges, which means pretty much open access to the system, or they have lots of"
    },
    {
      "Time_Start": 2149.84,
      "Time_End": 2153.92,
      "Text": " authorizations in order to run the programs that they need to to start up the system."
    },
    {
      "Time_Start": 2153.92,
      "Time_End": 2159.46,
      "Text": " So this is another very juicy target to go after on these boxes."
    },
    {
      "Time_Start": 2159.46,
      "Time_End": 2163.1600000000003,
      "Text": " Network labeling. As I showed you before, you can specify what a label is for different"
    },
    {
      "Time_Start": 2163.1600000000003,
      "Time_End": 2166.8,
      "Text": " ports for different services. And so now if you can find a service which is running on"
    },
    {
      "Time_Start": 2166.8,
      "Time_End": 2170.84,
      "Text": " a box at a level that you'd like to be at, like implementation low, and you can exploit"
    },
    {
      "Time_Start": 2170.88,
      "Time_End": 2176.52,
      "Text": " that, buffer overflow that program, you can give yourself a shell at that SL. Now the"
    },
    {
      "Time_Start": 2176.52,
      "Time_End": 2180.76,
      "Text": " only thing you have to do is become the user that you want with the right authorizations,"
    },
    {
      "Time_Start": 2180.76,
      "Time_End": 2186.2000000000003,
      "Text": " and you can have full access to the system. So don't ever run any services at implementation"
    },
    {
      "Time_Start": 2186.2000000000003,
      "Time_End": 2190.56,
      "Text": " low if that's what your system files are at. That's a lesson."
    },
    {
      "Time_Start": 2190.56,
      "Time_End": 2194.36,
      "Text": " Kernel bugs. Kernel bugs are always good for any operating system. All the securities in"
    },
    {
      "Time_Start": 2194.36,
      "Time_End": 2198.1600000000003,
      "Text": " the kernel inside in there, and if you can break the kernel, you own the system. You"
    },
    {
      "Time_Start": 2198.2,
      "Time_End": 2201.0,
      "Text": " can circumvent all the security, or at least you should be able to figure out a way to"
    },
    {
      "Time_Start": 2201.0,
      "Time_End": 2204.3199999999997,
      "Text": " do that."
    },
    {
      "Time_Start": 2204.3199999999997,
      "Time_End": 2207.24,
      "Text": " So kind of where to look on trusted operating systems. Of course, first, there's all the"
    },
    {
      "Time_Start": 2207.24,
      "Time_End": 2210.56,
      "Text": " regular old kernel bugs that happen every once in a while. If you can find one of those"
    },
    {
      "Time_Start": 2210.56,
      "Time_End": 2213.92,
      "Text": " to get in, then you can give yourself the access you need. But there's other things"
    },
    {
      "Time_Start": 2213.92,
      "Time_End": 2218.04,
      "Text": " that you can go after, too, which are kernel-related. Look at devkmem. That gives you access to"
    },
    {
      "Time_Start": 2218.04,
      "Time_End": 2222.2799999999997,
      "Text": " all of kernel memory. If it's at an SL that you can get to and you can become a user who"
    },
    {
      "Time_Start": 2222.2799999999997,
      "Time_End": 2226.56,
      "Text": " has access to it, then you can modify kernel memory. And you should pretty much be able"
    },
    {
      "Time_Start": 2226.56,
      "Time_End": 2230.04,
      "Text": " to take over the box from that. And you can give yourself all the privileges you need,"
    },
    {
      "Time_Start": 2230.04,
      "Time_End": 2233.88,
      "Text": " pick the UID that you'd like to have, and give yourself an SL that would allow you to"
    },
    {
      "Time_Start": 2233.88,
      "Time_End": 2235.12,
      "Text": " do what you need to do."
    },
    {
      "Time_Start": 2235.12,
      "Time_End": 2239.6,
      "Text": " Also, access to raw devices is very useful. If you can get access to a raw device, you"
    },
    {
      "Time_Start": 2239.6,
      "Time_End": 2243.32,
      "Text": " can modify the security structures in the files and change everything to a level that"
    },
    {
      "Time_Start": 2243.32,
      "Time_End": 2247.16,
      "Text": " is more amenable to the level that you're at, and then again get the access that you'd"
    },
    {
      "Time_Start": 2247.16,
      "Time_End": 2248.16,
      "Text": " like."
    },
    {
      "Time_Start": 2248.16,
      "Time_End": 2252.92,
      "Text": " Also, it's interesting to look at devices. Look through IO control interfaces and different"
    },
    {
      "Time_Start": 2252.92,
      "Time_End": 2257.28,
      "Text": " ways to communicate with devices. They typically tend to be a little less scrutinized on B1"
    },
    {
      "Time_Start": 2257.28,
      "Time_End": 2262.64,
      "Text": " systems, just because a lot of times there aren't, the MAC rules aren't being looked"
    },
    {
      "Time_Start": 2262.64,
      "Time_End": 2267.28,
      "Text": " at in the IO control. Simply, the only time a MAC check takes place is when you try and"
    },
    {
      "Time_Start": 2267.28,
      "Time_End": 2271.12,
      "Text": " open and access the device. But after that, you can communicate with the device readily,"
    },
    {
      "Time_Start": 2271.12,
      "Time_End": 2274.56,
      "Text": " which is reasonable, but if somebody screwed up their device, then you can have access"
    },
    {
      "Time_Start": 2274.56,
      "Time_End": 2275.56,
      "Text": " to the system."
    },
    {
      "Time_Start": 2275.56,
      "Time_End": 2280.28,
      "Text": " Also, it's worthwhile checking to see if IPC mechanisms on a system are actually using"
    },
    {
      "Time_Start": 2280.28,
      "Time_End": 2284.28,
      "Text": " MAC. If they're not, you have a way to communicate with processes that are at a different level"
    },
    {
      "Time_Start": 2284.28,
      "Time_End": 2293.0,
      "Text": " than you, and you can potentially use that as an attack path."
    },
    {
      "Time_Start": 2293.0,
      "Time_End": 2296.1600000000003,
      "Text": " It's important to remember that anything that you can find once you circumvent MAC is only"
    },
    {
      "Time_Start": 2296.1600000000003,
      "Time_End": 2299.96,
      "Text": " then protected by DAC, or if there's something that isn't actually checking mandatory access"
    },
    {
      "Time_Start": 2299.96,
      "Time_End": 2304.6400000000003,
      "Text": " control, then you're probably back to a DAC or no-access check attack, and now all you"
    },
    {
      "Time_Start": 2304.6400000000003,
      "Time_End": 2309.0,
      "Text": " need is possibly is to know a password to become a UID. You're back to the old problem."
    },
    {
      "Time_Start": 2309.0,
      "Time_End": 2312.36,
      "Text": " So again, as I say this a lot, really what you're trying to do is you're trying to reduce"
    },
    {
      "Time_Start": 2312.36,
      "Time_End": 2316.8,
      "Text": " your problem set to get rid of the layers that the trusted operating system puts on"
    },
    {
      "Time_Start": 2316.8,
      "Time_End": 2321.8,
      "Text": " by meeting the access checks that it makes and bringing it back to a common attack problem."
    },
    {
      "Time_Start": 2321.8,
      "Time_End": 2328.36,
      "Text": " It's difficult, but it can be done if the system is misconfigured."
    },
    {
      "Time_Start": 2328.36,
      "Time_End": 2331.56,
      "Text": " These are real basic things which you should just always check because somebody might screw"
    },
    {
      "Time_Start": 2331.56,
      "Time_End": 2335.92,
      "Text": " up the box. Try and log in as a highly authorized user. Can you guess the password for the security"
    },
    {
      "Time_Start": 2336.44,
      "Time_End": 2340.92,
      "Text": " administrator? Do they let you connect as him from an external connection and add an"
    },
    {
      "Time_Start": 2340.92,
      "Time_End": 2345.16,
      "Text": " SL that lets you run administrative programs or access system files? It's worth trying."
    },
    {
      "Time_Start": 2345.16,
      "Time_End": 2349.12,
      "Text": " It's probably not the case, but it's definitely worth looking at. And also look for the security"
    },
    {
      "Time_Start": 2349.12,
      "Time_End": 2352.92,
      "Text": " databases. They're pretty much the key to the security on the system, and if you can"
    },
    {
      "Time_Start": 2352.92,
      "Time_End": 2358.64,
      "Text": " modify them, you're going to own the box fairly quickly."
    },
    {
      "Time_Start": 2358.64,
      "Time_End": 2362.6,
      "Text": " Just to mention some of the commercial trusted operating systems that are available, there's"
    },
    {
      "Time_Start": 2362.6,
      "Time_End": 2366.6,
      "Text": " of course the company I work for, Argo Systems Group, we make Pitbull. That's on Solaris"
    },
    {
      "Time_Start": 2366.6,
      "Time_End": 2371.88,
      "Text": " 7, Spark, and x86. We're porting to Solaris 8, Solaris 6. We have early release on AIX,"
    },
    {
      "Time_Start": 2371.88,
      "Time_End": 2376.88,
      "Text": " and we're porting to Linux on 32-bit and 64-bit kernels. And as I understand, that's going"
    },
    {
      "Time_Start": 2376.88,
      "Time_End": 2381.2,
      "Text": " to be available because I'm sure some people here are interested in that by the end of"
    },
    {
      "Time_Start": 2381.2,
      "Time_End": 2384.6,
      "Text": " the fourth quarter, and we should have a beta program available for that as well."
    },
    {
      "Time_Start": 2384.6,
      "Time_End": 2388.56,
      "Text": " HP makes a product called Virtual Vault, which runs on HP hardware and is part of a suite"
    },
    {
      "Time_Start": 2388.56,
      "Time_End": 2393.7599999999998,
      "Text": " called Presidium. There's also an effort underway to create a trusted operating system,"
    },
    {
      "Time_Start": 2393.7599999999998,
      "Time_End": 2397.92,
      "Text": " an open source trusted operating system on top of FreeBSD, and you can find out information"
    },
    {
      "Time_Start": 2397.92,
      "Time_End": 2403.36,
      "Text": " on that at www.trustedbsd.com."
    },
    {
      "Time_Start": 2403.36,
      "Time_End": 2406.96,
      "Text": " So the best way to learn how to break these boxes is of course to have your own and start"
    },
    {
      "Time_Start": 2406.96,
      "Time_End": 2411.32,
      "Text": " securing it and breaking it. So you should get one and start doing it, and it's very"
    },
    {
      "Time_Start": 2411.32,
      "Time_End": 2415.48,
      "Text": " easy to do actually because we're giving ours away for free for individual, non-commercial"
    },
    {
      "Time_Start": 2415.48,
      "Time_End": 2422.48,
      "Text": " users. So if you go to ArgusRevolution.com, we have ISO, I'm sorry, ISO images available."
    },
    {
      "Time_Start": 2422.48,
      "Time_End": 2426.26,
      "Text": " You can order the media, all those kinds of things, and you can have unlimited licenses."
    },
    {
      "Time_Start": 2426.26,
      "Time_End": 2430.08,
      "Text": " We make all that available."
    },
    {
      "Time_Start": 2430.08,
      "Time_End": 2434.48,
      "Text": " I'll be making this speech and the presentation I gave for Black Hat, which as I said was"
    },
    {
      "Time_Start": 2434.48,
      "Time_End": 2440.0,
      "Text": " more detailed as far as trusted operating systems go, available on the Argus Revolution"
    },
    {
      "Time_Start": 2440.0,
      "Time_End": 2444.48,
      "Text": " website. There's going to be, I believe, a real audio stream available on Black Hat's"
    },
    {
      "Time_Start": 2444.48,
      "Time_End": 2447.84,
      "Text": " website for the presentation that I gave. I don't know what the case is for DEF CON,"
    },
    {
      "Time_Start": 2447.84,
      "Time_End": 2451.16,
      "Text": " what they're doing with that exactly. And white papers, documentation, and there's a"
    },
    {
      "Time_Start": 2451.16,
      "Time_End": 2455.72,
      "Text": " discussion forum available on the website as well if you have questions. And of course,"
    },
    {
      "Time_Start": 2455.72,
      "Time_End": 2459.78,
      "Text": " please feel free to e-mail me if you have any questions. And yes, I will definitely"
    },
    {
      "Time_Start": 2459.78,
      "Time_End": 2460.78,
      "Text": " answer questions."
    },
    {
      "Time_Start": 2460.78,
      "Time_End": 2461.78,
      "Text": " Yes?"
    },
    {
      "Time_Start": 2461.78,
      "Time_End": 2475.36,
      "Text": " Yeah, they have the OB1 stuff, yeah. In truth, most of it I know is from hearsay. I tried"
    },
    {
      "Time_Start": 2475.36,
      "Time_End": 2479.1000000000004,
      "Text": " to contact them, but I didn't get a lot of information back. I know what they have done"
    },
    {
      "Time_Start": 2479.1000000000004,
      "Time_End": 2486.26,
      "Text": " is they've released what is based off of the trusted IRICS code base. They did a CMW there."
    },
    {
      "Time_Start": 2486.26,
      "Time_End": 2489.7400000000002,
      "Text": " And basically they released that code as an example. And from what I understand is that"
    },
    {
      "Time_Start": 2489.7400000000002,
      "Time_End": 2493.0600000000004,
      "Text": " there is an effort underway at SGI, at least with people who work there, who are trying"
    },
    {
      "Time_Start": 2493.0600000000004,
      "Time_End": 2499.0600000000004,
      "Text": " to create a trusted Linux which is essentially based on the trusted IRICS code base."
    },
    {
      "Time_Start": 2499.0600000000004,
      "Time_End": 2504.1800000000003,
      "Text": " What do you think of that code base?"
    },
    {
      "Time_Start": 2504.1800000000003,
      "Time_End": 2505.1800000000003,
      "Text": " No comment."
    },
    {
      "Time_Start": 2505.1800000000003,
      "Time_End": 2506.1800000000003,
      "Text": " You can ask them off the record."
    },
    {
      "Time_Start": 2506.1800000000003,
      "Time_End": 2510.78,
      "Text": " Yeah, no comment. You can come up and talk to me about it. That's fine. Just not through"
    },
    {
      "Time_Start": 2510.78,
      "Time_End": 2511.78,
      "Text": " the microphone."
    },
    {
      "Time_Start": 2511.78,
      "Time_End": 2512.78,
      "Text": " Yes?"
    },
    {
      "Time_Start": 2512.78,
      "Time_End": 2528.86,
      "Text": " All right. The question was what about role-based access control, something called RBAC. RBAC"
    },
    {
      "Time_Start": 2528.86,
      "Time_End": 2535.98,
      "Text": " is essentially a discretionary access control mechanism which is, I mentioned roles, like"
    },
    {
      "Time_Start": 2535.98,
      "Time_End": 2542.3,
      "Text": " ISSO, SOSA. The idea there is you're creating roles and you can create an access control"
    },
    {
      "Time_Start": 2542.3,
      "Time_End": 2549.54,
      "Text": " set around that. It's not a pure mandatory system, but it is still very useful. That's"
    },
    {
      "Time_Start": 2549.54,
      "Time_End": 2556.1,
      "Text": " actually out on Solaris 8 as I understand it. RBAC is being made available as well."
    },
    {
      "Time_Start": 2556.1,
      "Time_End": 2559.46,
      "Text": " There is a Linux version as well. I've actually not used it on Linux yet."
    },
    {
      "Time_Start": 2559.46,
      "Time_End": 2584.46,
      "Text": " Yeah. Oh, there are. Okay. Do you know what website that's on? It's ARG? RSBAC. DE. Okay."
    },
    {
      "Time_Start": 2584.46,
      "Time_End": 2610.46,
      "Text": " Right. All right. Any other questions? Sorry, I haven't looked over here yet. Yes?"
    },
    {
      "Time_Start": 2611.46,
      "Time_End": 2630.1,
      "Text": " Yes. He was making a comment on seeing files in a directory, and there's two things I'll"
    },
    {
      "Time_Start": 2630.1,
      "Time_End": 2636.2200000000003,
      "Text": " say about that. One is that if you are looking, if you have access to a directory, to the"
    },
    {
      "Time_Start": 2636.2200000000003,
      "Time_End": 2640.7400000000002,
      "Text": " directory file, then you can see what's in a file, but when then you go into the directory"
    },
    {
      "Time_Start": 2640.7400000000002,
      "Time_End": 2644.46,
      "Text": " and you actually try and look at the, examine the structures of the files, you may not have"
    },
    {
      "Time_Start": 2644.46,
      "Time_End": 2649.1400000000003,
      "Text": " access to them. The second thing is there's another concept called, oh, now it's going"
    },
    {
      "Time_Start": 2649.1400000000003,
      "Time_End": 2654.9800000000005,
      "Text": " to escape my mind, partition directories. And the idea is that you can create these,"
    },
    {
      "Time_Start": 2654.9800000000005,
      "Time_End": 2660.2200000000003,
      "Text": " this directory structure, it's kind of a virtual directory structure under directories, where"
    },
    {
      "Time_Start": 2660.2200000000003,
      "Time_End": 2662.94,
      "Text": " depending on the level of the file that you're putting in there, it will go into one of these"
    },
    {
      "Time_Start": 2662.94,
      "Time_End": 2668.7400000000002,
      "Text": " subdirectories, which is marked at a specific single level. And so what level you're at"
    },
    {
      "Time_Start": 2668.7400000000002,
      "Time_End": 2672.54,
      "Text": " kind of puts you into one of these subdirectories and you can't get access to the other ones."
    },
    {
      "Time_Start": 2672.54,
      "Time_End": 2677.54,
      "Text": " So you can completely separate files that are at different levels from users. Yes?"
    },
    {
      "Time_Start": 2677.54,
      "Time_End": 2684.54,
      "Text": " Oh, do you want to exploit the third party developers? Oh, always. No, the API isn't"
    },
    {
      "Time_Start": 2694.18,
      "Time_End": 2701.18,
      "Text": " very complicated, fortunately, at least speaking for myself. But it, but, and it's not really"
    },
    {
      "Time_Start": 2702.18,
      "Time_End": 2708.2599999999998,
      "Text": " some, well, I guess even with Mac stuff. I guess kind of the advantage to it is that"
    },
    {
      "Time_Start": 2708.2599999999998,
      "Time_End": 2712.72,
      "Text": " when you're working with the API, you're most likely working with it in very specific pieces"
    },
    {
      "Time_Start": 2712.72,
      "Time_End": 2718.7799999999997,
      "Text": " of your code, whereas the problem with standard Unix is that you're working with those things,"
    },
    {
      "Time_Start": 2718.7799999999997,
      "Time_End": 2722.74,
      "Text": " but you pretty much said that you're working with it in the entire program, because you've"
    },
    {
      "Time_Start": 2722.74,
      "Time_End": 2726.2599999999998,
      "Text": " said it's UID zero, here's my, you know, here's all I can do, and I can do, you know, change"
    },
    {
      "Time_Start": 2726.3,
      "Time_End": 2731.38,
      "Text": " mods and things in files. But when you're working with the trusted operating system"
    },
    {
      "Time_Start": 2731.38,
      "Time_End": 2736.5400000000004,
      "Text": " APIs, you're going to have to be very aware of what, you know, what you're using, where"
    },
    {
      "Time_Start": 2736.5400000000004,
      "Time_End": 2739.86,
      "Text": " you're using them, because they're going to apply specifically to the pieces of code that"
    },
    {
      "Time_Start": 2739.86,
      "Time_End": 2743.7000000000003,
      "Text": " you're trying to work with. That made a little bit of sense. I should also mention that on"
    },
    {
      "Time_Start": 2743.7000000000003,
      "Time_End": 2747.86,
      "Text": " the site, we make our SDK available as well for the product for free, so if people want"
    },
    {
      "Time_Start": 2747.86,
      "Time_End": 2752.34,
      "Text": " to play around with that. For example, I've made a multi-level aware LDAP server, which"
    },
    {
      "Time_Start": 2752.7400000000002,
      "Time_End": 2756.7000000000003,
      "Text": " does security using mandatory access control as well, so you can limit access to the LDAP"
    },
    {
      "Time_Start": 2756.7000000000003,
      "Time_End": 2761.06,
      "Text": " server based on where users are coming from in a mandatory fashion. That was just a little"
    },
    {
      "Time_Start": 2761.06,
      "Time_End": 2763.06,
      "Text": " side project for fun. Yes?"
    },
    {
      "Time_Start": 2763.06,
      "Time_End": 2768.06,
      "Text": " Does that mean that applications have to be trusted aware?"
    },
    {
      "Time_Start": 2768.06,
      "Time_End": 2774.06,
      "Text": " No, absolutely not. The, what you can do if you have a, what we call a commercial off-the-shelf"
    },
    {
      "Time_Start": 2774.06,
      "Time_End": 2778.02,
      "Text": " program, which is a government way of saying just regular programs that everybody uses,"
    },
    {
      "Time_Start": 2778.02,
      "Time_End": 2783.74,
      "Text": " like me and you, you do not need to modify those programs. However, if they run, if they"
    },
    {
      "Time_Start": 2783.74,
      "Time_End": 2787.82,
      "Text": " would run on a system as a regular user, they're not performing security relevant functions,"
    },
    {
      "Time_Start": 2787.82,
      "Time_End": 2792.06,
      "Text": " so you just run them as normal. However, if they would have run as root normally, which"
    },
    {
      "Time_Start": 2792.06,
      "Time_End": 2795.82,
      "Text": " means they probably were performing security relevant functions, then what you need to"
    },
    {
      "Time_Start": 2795.82,
      "Time_End": 2800.46,
      "Text": " do is look at that program and figure out what privileges it needs. Now, okay, how do"
    },
    {
      "Time_Start": 2800.46,
      "Time_End": 2804.06,
      "Text": " you do that without code? Well, you can. For example, with Pitbull, we have a program that"
    },
    {
      "Time_Start": 2804.06,
      "Time_End": 2808.18,
      "Text": " we created called Trace PV, which essentially analyzes the binary, the libraries that it's"
    },
    {
      "Time_Start": 2808.18,
      "Time_End": 2811.54,
      "Text": " linking against and looks at all these things and figures out what privileges it needs and"
    },
    {
      "Time_Start": 2811.54,
      "Time_End": 2815.9,
      "Text": " we'll set up the program so it'll run properly in a least privileged fashion. Trusted Solaris"
    },
    {
      "Time_Start": 2815.9,
      "Time_End": 2819.98,
      "Text": " has a program similar to that, but it's much more limited. I don't think Virtual Vault"
    },
    {
      "Time_Start": 2819.98,
      "Time_End": 2821.98,
      "Text": " has anything like that at all. I'm sorry?"
    },
    {
      "Time_Start": 2821.98,
      "Time_End": 2822.98,
      "Text": " Yes, please."
    },
    {
      "Time_Start": 2822.98,
      "Time_End": 2840.7,
      "Text": " Ladies and gentlemen, a couple things. Racial slurs against people who are here will not"
    },
    {
      "Time_Start": 2840.7,
      "Time_End": 2848.62,
      "Text": " be tolerated. Threats against the staff, although I will kick your ass or I will kill you, will"
    },
    {
      "Time_Start": 2848.62,
      "Time_End": 2854.66,
      "Text": " not be tolerated. Threats against other convention goers, although I will kick your ass or kill"
    },
    {
      "Time_Start": 2854.66,
      "Time_End": 2859.98,
      "Text": " you, will not be tolerated. There's a group of people out there who seem to think that"
    },
    {
      "Time_Start": 2859.98,
      "Time_End": 2867.7799999999997,
      "Text": " IRC is real life. IRC is not real life. In real life, that is assault, and you will go"
    },
    {
      "Time_Start": 2867.7799999999997,
      "Time_End": 2873.2599999999998,
      "Text": " to jail. I'm hoping some of their friends are in this room right now. I'm hoping these"
    },
    {
      "Time_Start": 2873.2599999999998,
      "Time_End": 2877.1,
      "Text": " people will get to them and tell them to go away and not to come back, so I do not have"
    },
    {
      "Time_Start": 2877.1,
      "Time_End": 2883.62,
      "Text": " to put you in jail. Because if I catch you, I will make sure you go to jail. I'm sorry"
    },
    {
      "Time_Start": 2883.62,
      "Time_End": 2887.2599999999998,
      "Text": " to have to bring this up this way, but this will not be tolerated and this is the third"
    },
    {
      "Time_Start": 2887.2599999999998,
      "Time_End": 2892.3399999999997,
      "Text": " or fourth incident that I have heard in the last two days with this group of people. We"
    },
    {
      "Time_Start": 2892.3399999999997,
      "Time_End": 2899.8199999999997,
      "Text": " are supposed to be enlightened, mature adults. Good fun and pranks is fine. Threatening to"
    },
    {
      "Time_Start": 2899.8199999999997,
      "Time_End": 2904.22,
      "Text": " hurt someone is not fine. Thank you very much for your time."
    },
    {
      "Time_Start": 2907.1,
      "Time_End": 2929.74,
      "Text": " Alright, are there any other questions I can answer? Yes. No comment. Actually, the"
    },
    {
      "Time_Start": 2929.74,
      "Time_End": 2934.66,
      "Text": " pricing model and all that stuff has changed and I am an engineer, not a salesperson, so"
    },
    {
      "Time_Start": 2934.66,
      "Time_End": 2940.02,
      "Text": " I hate to answer those questions. I should say, and maybe I can get a round of applause"
    },
    {
      "Time_Start": 2940.02,
      "Time_End": 2943.3799999999997,
      "Text": " for this and make me feel good, the program I mentioned before, the Argus Revolution program,"
    },
    {
      "Time_Start": 2943.3799999999997,
      "Time_End": 2946.8199999999997,
      "Text": " was actually put together by me. I pushed it through. I wanted to make the product available"
    },
    {
      "Time_Start": 2946.8199999999997,
      "Time_End": 2952.58,
      "Text": " to people for free, like me and you, because it's worth us using it. So that's it."
    }
  ]
}