{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 15.44,
      "Text": "This text was transcribed using whisper model: large-v2\n\n Thank you all, just to get an idea, can I see hands on who in this room considers himself"
    },
    {
      "Time_Start": 15.44,
      "Time_End": 17.28,
      "Text": " on the blue side of things?"
    },
    {
      "Time_Start": 17.28,
      "Time_End": 24.32,
      "Text": " Half-ish, so the other half is red, who do we have in the red team, red team operators,"
    },
    {
      "Time_Start": 24.32,
      "Time_End": 25.32,
      "Text": " penetration testers?"
    },
    {
      "Time_Start": 25.32,
      "Time_End": 34.6,
      "Text": " Also a bunch, so we've got a nice 50-50 split, well as introduced we are from Outflank and"
    },
    {
      "Time_Start": 34.6,
      "Time_End": 38.120000000000005,
      "Text": " we're going to talk about object failures that are made by blue teams and especially"
    },
    {
      "Time_Start": 38.120000000000005,
      "Time_End": 46.64,
      "Text": " how we as red team operators monitor what's happening out there, what we see on our infrastructure."
    },
    {
      "Time_Start": 46.64,
      "Time_End": 53.04,
      "Text": " About us, I'm Mark, I started coding on mainframes just before the Euro conversion and the year"
    },
    {
      "Time_Start": 53.04,
      "Time_End": 57.4,
      "Text": " 2000 problem and all that stuff, so the black screens with green letters, found out quite"
    },
    {
      "Time_Start": 57.4,
      "Time_End": 61.44,
      "Text": " fast that I was not the average developer, doesn't also mean that I was better, I'm just"
    },
    {
      "Time_Start": 61.44,
      "Time_End": 65.8,
      "Text": " not a developer, I'm not structured enough to be a proper developer, but I did have my"
    },
    {
      "Time_Start": 65.8,
      "Time_End": 70.8,
      "Text": " way with computers, so I rolled into security, did that for a while and started being really"
    },
    {
      "Time_Start": 70.8,
      "Time_End": 78.16,
      "Text": " offensive security as of 2004, now I'm a red team operator, I'm also lazy, so if I do things"
    },
    {
      "Time_Start": 78.16,
      "Time_End": 84.75999999999999,
      "Text": " twice or three times, I tend to develop something around it to make it easier for me."
    },
    {
      "Time_Start": 84.75999999999999,
      "Time_End": 87.32,
      "Text": " My colleague Mark is here as well."
    },
    {
      "Time_Start": 87.32,
      "Time_End": 94.64,
      "Text": " My name is Mark, you can follow my ramblings on Twitter, hashtag MarkovIP, I want to thank"
    },
    {
      "Time_Start": 94.64,
      "Time_End": 98.56,
      "Text": " you all for being here, I want to thank the conference organisers for allowing us to talk"
    },
    {
      "Time_Start": 98.56,
      "Time_End": 100.03999999999999,
      "Text": " about this topic."
    },
    {
      "Time_Start": 100.03999999999999,
      "Time_End": 106.84,
      "Text": " My official information security career started in 2006, before that I had a background in"
    },
    {
      "Time_Start": 106.88000000000001,
      "Time_End": 113.88000000000001,
      "Text": " system and network engineering, making things nowadays are great things, most of my part"
    },
    {
      "Time_Start": 113.88000000000001,
      "Time_End": 120.2,
      "Text": " is still a red team operator, I built some tools to ease my work, also recently I had"
    },
    {
      "Time_Start": 120.2,
      "Time_End": 125.72,
      "Text": " the experience of doing some threat hunting experience at the blue side of a company,"
    },
    {
      "Time_Start": 125.72,
      "Time_End": 132.44,
      "Text": " so fully aligned with the keynote, I want to say that it really helps a red teamer to"
    },
    {
      "Time_Start": 132.44,
      "Time_End": 136.32,
      "Text": " be on the blue side and otherwise as well, the blue team where I'm working right now"
    },
    {
      "Time_Start": 136.32,
      "Time_End": 139.44,
      "Text": " really benefits from the red team experience that I bring to the whole threat hunting"
    },
    {
      "Time_Start": 139.44,
      "Time_End": 145.04,
      "Text": " and the whole soccer finding, so yeah, so that's the company Outflank."
    },
    {
      "Time_Start": 145.04,
      "Time_End": 149.44,
      "Text": " Yeah, then a short note about Outflank, what Outflank is and why we even founded it, because"
    },
    {
      "Time_Start": 149.44,
      "Time_End": 154.48,
      "Text": " there's plenty of security firms out there, why find a new one?"
    },
    {
      "Time_Start": 154.48,
      "Time_End": 162.07999999999998,
      "Text": " We saw that often pentesters moved to being red teamers and those two are, in our opinion,"
    },
    {
      "Time_Start": 162.07999999999998,
      "Time_End": 165.6,
      "Text": " different kinds of creatures, pentesters are not red teamers, red teamers aren't always"
    },
    {
      "Time_Start": 165.6,
      "Time_End": 172.0,
      "Text": " pentesters, so even though they have similar skill sets, the way they operate should be"
    },
    {
      "Time_Start": 172.0,
      "Time_End": 177.28,
      "Text": " quite different, so that's why we found Outflank about three, three and a half years ago, to"
    },
    {
      "Time_Start": 177.28,
      "Time_End": 183.44,
      "Text": " specialise in red teaming, we built a small team, we're now with six people, all with"
    },
    {
      "Time_Start": 183.44,
      "Time_End": 187.92,
      "Text": " a decent amount of experience, so we don't have only the tech on board to do proper red"
    },
    {
      "Time_Start": 187.92,
      "Time_End": 192.56,
      "Text": " teams, but also have a vision on how red teams should be done, before we dive into our product"
    },
    {
      "Time_Start": 192.72,
      "Time_End": 197.04,
      "Text": " we're building and how we try to improve our work, I first want to dive a bit into what"
    },
    {
      "Time_Start": 197.04,
      "Time_End": 201.2,
      "Text": " we think red teams should be, so at least then we're all on the same page, we might"
    },
    {
      "Time_Start": 201.2,
      "Time_End": 205.84,
      "Text": " agree, we might not agree, but at least then we know how we define red teaming and how"
    },
    {
      "Time_Start": 205.84,
      "Time_End": 206.8,
      "Text": " we see it."
    },
    {
      "Time_Start": 208.16,
      "Time_End": 213.12,
      "Text": " We often like to compare red teaming with this image, a boxing match, well not a match,"
    },
    {
      "Time_Start": 213.12,
      "Time_End": 220.24,
      "Text": " a training game, if you consider the red team to be the trainer, then there's no use in"
    },
    {
      "Time_Start": 220.24,
      "Time_End": 225.68,
      "Text": " knocking the blue team out, breaking in, stealing all their gold, going away, make"
    },
    {
      "Time_Start": 225.68,
      "Time_End": 230.8,
      "Text": " a dance, write a report, there's no learning in that, the blue team is not going to improve"
    },
    {
      "Time_Start": 230.8,
      "Time_End": 236.32000000000002,
      "Text": " by doing that once, twice or five times, they might learn from the report and they might"
    },
    {
      "Time_Start": 236.32000000000002,
      "Time_End": 241.60000000000002,
      "Text": " build some more detections to find what you specifically did at that point, but you're"
    },
    {
      "Time_Start": 241.60000000000002,
      "Time_End": 246.0,
      "Text": " not going to really train them in their daily operations, especially if a real actor will"
    },
    {
      "Time_Start": 246.08,
      "Time_End": 252.24,
      "Text": " once knock on the door, so how we see red teaming is more in a sparring situation, we"
    },
    {
      "Time_Start": 252.24,
      "Time_End": 259.28,
      "Text": " even would go as far as to state that a red team that was undetected due to the whole"
    },
    {
      "Time_Start": 259.28,
      "Time_End": 265.6,
      "Text": " operation is a field for the red team as well, red teams should move towards being detected,"
    },
    {
      "Time_Start": 265.6,
      "Time_End": 270.32,
      "Text": " they should move towards engage with the blue team, because only that is how a training"
    },
    {
      "Time_Start": 270.4,
      "Time_End": 275.84,
      "Text": " match works and how a training match can be used to improve capabilities on both sides."
    },
    {
      "Time_Start": 277.12,
      "Time_End": 281.92,
      "Text": " But before we dive deeper into the Red Elk and the tool we're going to present,"
    },
    {
      "Time_Start": 282.56,
      "Time_End": 288.24,
      "Text": " I want a word on how our infrastructure looks like and I think it's really closely aligned"
    },
    {
      "Time_Start": 288.24,
      "Time_End": 294.08,
      "Text": " to what we see out in the wild, we have the customer here on the left side and a line of"
    },
    {
      "Time_Start": 294.08,
      "Time_End": 297.92,
      "Text": " redirectors in between and then we have the command and control server that we will be"
    },
    {
      "Time_Start": 297.92,
      "Time_End": 304.0,
      "Text": " operating on, we tend to use Coupled Strike a lot, of course other platforms might be just"
    },
    {
      "Time_Start": 304.0,
      "Time_End": 310.56,
      "Text": " as good and just as usable and even then you'll end up with a similar IT infrastructure on the"
    },
    {
      "Time_Start": 310.56,
      "Time_End": 317.04,
      "Text": " offensive side, being a layer of redirectors that you use to reroute or do more intelligent stuff,"
    },
    {
      "Time_Start": 317.04,
      "Time_End": 320.64,
      "Text": " but at least you use to reroute to see through traffic to your backends."
    },
    {
      "Time_Start": 322.08000000000004,
      "Time_End": 326.48,
      "Text": " Well this is the schematics, but as soon as we start doing an offensive operation,"
    },
    {
      "Time_Start": 326.56,
      "Time_End": 331.6,
      "Text": " but we might run three scenarios at the same time and within this one scenario one of my"
    },
    {
      "Time_Start": 331.6,
      "Time_End": 336.72,
      "Text": " colleagues will always ask me, Mark can I have another profile, C2 profile for this specific"
    },
    {
      "Time_Start": 336.72,
      "Time_End": 342.48,
      "Text": " scenario, so quite soon we'll find ourselves having at least four or five command and control"
    },
    {
      "Time_Start": 342.48,
      "Time_End": 349.6,
      "Text": " servers on the backend, up to 15, sometimes even 20 redirectors, where there's a lot of need of"
    },
    {
      "Time_Start": 350.48,
      "Time_End": 355.6,
      "Text": " manual additions in how we want to divert traffic, how we want to monitor traffic, where we want to"
    },
    {
      "Time_Start": 355.6,
      "Time_End": 362.32000000000005,
      "Text": " send it, I think the basic message is things get complex quite fast, also on the red team side of"
    },
    {
      "Time_Start": 362.32000000000005,
      "Time_End": 367.68,
      "Text": " things and we quite often have over 40 or 50 systems that we just spun up over the last few"
    },
    {
      "Time_Start": 367.68,
      "Time_End": 372.56,
      "Text": " weeks and yeah we want to keep an eye on what's going on, what's happening on these machines,"
    },
    {
      "Time_Start": 372.56,
      "Time_End": 377.84000000000003,
      "Text": " who is pinging them, who is visiting the sites on there, who is talking to C2 and so on."
    },
    {
      "Time_Start": 379.20000000000005,
      "Time_End": 384.8,
      "Text": " So that's where for the red team a big challenge is and only if the red team is in control of its"
    },
    {
      "Time_Start": 384.8,
      "Time_End": 389.04,
      "Text": " operation that's the place where we can help the blue team in the best way possible."
    },
    {
      "Time_Start": 393.84000000000003,
      "Time_End": 402.24,
      "Text": " So our infrastructure grows exponentially, we try to or we tend to lose oversight as long"
    },
    {
      "Time_Start": 402.24,
      "Time_End": 405.92,
      "Text": " when the infrastructure grows and grows the more components are added, so we're having"
    },
    {
      "Time_Start": 406.8,
      "Time_End": 414.0,
      "Text": " roughly said two challenges with our infrastructure, remaining in a position of proper oversight and"
    },
    {
      "Time_Start": 414.0,
      "Time_End": 420.72,
      "Text": " having proper insight during the operation, we want to know what's going on. If you look at the"
    },
    {
      "Time_Start": 420.72,
      "Time_End": 427.6,
      "Text": " concept of oversight, let's look at cowboys, they have typical challenges, they have their herd"
    },
    {
      "Time_Start": 427.6,
      "Time_End": 433.44,
      "Text": " which is running around everywhere, they want to know if their herd is in proper shape, if they're"
    },
    {
      "Time_Start": 433.44,
      "Time_End": 440.56,
      "Text": " alive, where they are etc all these things, so they have about the same type of changes with the"
    },
    {
      "Time_Start": 440.56,
      "Time_End": 448.08,
      "Text": " oversight. If you look at the insight that we want to get, I want to reference back to the French"
    },
    {
      "Time_Start": 448.08,
      "Time_End": 454.56,
      "Text": " Sherlock Holmes, this is a picture of Mr. Locard, Edmund Locard, he was in the early 20th century,"
    },
    {
      "Time_Start": 454.56,
      "Time_End": 462.0,
      "Text": " he was the first person with forensic science to do it properly, scientific-based, evidence-based"
    },
    {
      "Time_Start": 462.0,
      "Time_End": 467.44,
      "Text": " practice, he used actually scientific measures to go to a crime scene and do the investigation,"
    },
    {
      "Time_Start": 468.32,
      "Time_End": 477.92,
      "Text": " he used raw data to get the proper insight, so he is most famous for his statement which is"
    },
    {
      "Time_Start": 477.92,
      "Time_End": 485.76,
      "Text": " every contact leaves a trace or principle and this actually goes both ways, every interaction that"
    },
    {
      "Time_Start": 485.76,
      "Time_End": 492.08,
      "Text": " red does will leave a trace for blue to find, every interaction that blue does will leave a trace for"
    },
    {
      "Time_Start": 492.08,
      "Time_End": 498.47999999999996,
      "Text": " red to find, and that's interesting, that's an important thing to remember. So with those two"
    },
    {
      "Time_Start": 498.47999999999996,
      "Time_End": 504.8,
      "Text": " challenges that we have, let's look at the tools that we can use for getting better at that."
    },
    {
      "Time_Start": 507.36,
      "Time_End": 511.84,
      "Text": " So the dogs that are used by the cowboys, the microscopes that are used by"
    },
    {
      "Time_Start": 513.1999999999999,
      "Time_End": 518.96,
      "Text": " forensic investigators, we do not have something like that for our own infrastructure"
    },
    {
      "Time_Start": 519.0400000000001,
      "Time_End": 522.1600000000001,
      "Text": " to look at or our own operation, so we need to create something ourselves,"
    },
    {
      "Time_Start": 522.72,
      "Time_End": 529.2800000000001,
      "Text": " and that's what we came up with. I apologize in advance for this awesome picture, if there's"
    },
    {
      "Time_Start": 529.2800000000001,
      "Time_End": 532.72,
      "Text": " anybody in the room who has some creative background that can make a better picture,"
    },
    {
      "Time_Start": 532.72,
      "Time_End": 537.9200000000001,
      "Text": " we are open to that, but at this moment it's just this elk with a red sunglass,"
    },
    {
      "Time_Start": 538.88,
      "Time_End": 543.6,
      "Text": " we've already put it on stickers I believe, we do have a few stickers indeed, so"
    },
    {
      "Time_Start": 544.0,
      "Time_End": 549.6800000000001,
      "Text": " Red Elk combines the two things that we need to fix, oversight and insight. You can read the blog"
    },
    {
      "Time_Start": 549.6800000000001,
      "Time_End": 554.0,
      "Text": " where we introduced this, you can go to our github because we thought this is important as well,"
    },
    {
      "Time_Start": 554.0,
      "Time_End": 557.76,
      "Text": " because there's no such thing in the community at this moment, so we open sourced it,"
    },
    {
      "Time_Start": 557.76,
      "Time_End": 560.96,
      "Text": " feel free to play with it, either if you're on the red side or the blue side."
    },
    {
      "Time_Start": 564.4,
      "Time_End": 571.6,
      "Text": " What does it do? Well, let's have a more higher overview of how a network or an operation"
    },
    {
      "Time_Start": 571.6800000000001,
      "Time_End": 577.6,
      "Text": " should look like. On the left side you have the target network, the client that we're trying to"
    },
    {
      "Time_Start": 577.6,
      "Time_End": 583.9200000000001,
      "Text": " hack, normal C2 traffic and normal tech traffic will always flow through a redirect, just as"
    },
    {
      "Time_Start": 583.9200000000001,
      "Time_End": 588.5600000000001,
      "Text": " Mark, my colleague, has said, so there's a first line infrastructure which will have reverse"
    },
    {
      "Time_Start": 588.5600000000001,
      "Time_End": 593.28,
      "Text": " proxies, domain frontings, normal websites, tracking pixels, everything goes through a"
    },
    {
      "Time_Start": 593.28,
      "Time_End": 600.0,
      "Text": " first line of infrastructure, and then there is some traffic that is allowed to go through as"
    },
    {
      "Time_Start": 600.0,
      "Time_End": 607.6,
      "Text": " C2 traffic back to our C2 service, which can be multiple. Let's put in Red Elk."
    },
    {
      "Time_Start": 609.6,
      "Time_End": 614.88,
      "Text": " Red Elk does a few things, of course the Elk within Red Elk stands for Elasticsearch,"
    },
    {
      "Time_Start": 614.88,
      "Time_End": 616.08,
      "Text": " Logstash and Kibana."
    },
    {
      "Time_Start": 619.76,
      "Time_End": 627.28,
      "Text": " Okay, this is better? Okay, so Elasticsearch, Logstash, Kibana, the NoSQL dataset with Kibana"
    },
    {
      "Time_Start": 627.28,
      "Time_End": 634.88,
      "Text": " being the front end for it and Logstash being the whole log filtering thing. Red Elk gets its"
    },
    {
      "Time_Start": 634.88,
      "Time_End": 640.88,
      "Text": " data using FileBeat, a component that reads all the log files from the redirectors or anything"
    },
    {
      "Time_Start": 640.88,
      "Time_End": 647.12,
      "Text": " within the first line of infrastructure, as well as the logs from our team servers during the"
    },
    {
      "Time_Start": 647.12,
      "Time_End": 652.9599999999999,
      "Text": " operation, so we get traffic data as well as operational data. And on the right side you will"
    },
    {
      "Time_Start": 652.96,
      "Time_End": 658.8000000000001,
      "Text": " see another picture for data copy, which means that we transfer specific files during the"
    },
    {
      "Time_Start": 658.8000000000001,
      "Time_End": 665.12,
      "Text": " operation as well back to our central Red Elk server. Why? We want to have one central overview"
    },
    {
      "Time_Start": 665.12,
      "Time_End": 670.32,
      "Text": " of all screenshots, all downloaded files, all keystrokes, everything during the operation which"
    },
    {
      "Time_Start": 670.32,
      "Time_End": 675.84,
      "Text": " was spread across multiple team servers, we want to have one central location, so we're transferring"
    },
    {
      "Time_Start": 675.84,
      "Time_End": 682.08,
      "Text": " that back to the Red Elk server. We're making some dashboards, we're storing it into indexers,"
    },
    {
      "Time_Start": 682.08,
      "Time_End": 686.8000000000001,
      "Text": " we're doing enrichments of the data that is coming in, of course as it's being a big search engine"
    },
    {
      "Time_Start": 686.8000000000001,
      "Time_End": 691.6800000000001,
      "Text": " we can do some searching with it, and with that we can have a proper access for the red team as well"
    },
    {
      "Time_Start": 691.6800000000001,
      "Time_End": 698.08,
      "Text": " if you might want to do that, have the white team as well look into some of the data. Of course for"
    },
    {
      "Time_Start": 698.08,
      "Time_End": 703.36,
      "Text": " the blue team it's not that weird, it's actually not new at all to collect data, put it in one"
    },
    {
      "Time_Start": 703.36,
      "Time_End": 707.6800000000001,
      "Text": " place so you can look at it, but you would be surprised to see how little tooling there is"
    },
    {
      "Time_Start": 707.6800000000001,
      "Time_End": 714.5600000000001,
      "Text": " for Red Elks to do this properly. Exactly, so pretty simple, right? We're putting in some"
    },
    {
      "Time_Start": 715.2800000000001,
      "Time_End": 719.7600000000001,
      "Text": " Elk stack in the middle, put in some logs, do some filtering, do some enrichment, that's it."
    },
    {
      "Time_Start": 720.48,
      "Time_End": 726.24,
      "Text": " Well, let's look what happens when the blue team actually finds some artifacts of our attack."
    },
    {
      "Time_Start": 726.8000000000001,
      "Time_End": 731.36,
      "Text": " The SOC starts to do some analysis, they will find a piece of malware on their systems, they will do"
    },
    {
      "Time_Start": 731.36,
      "Time_End": 738.32,
      "Text": " some analysis. That analysis can include basically querying for the ND5s or other IOCs"
    },
    {
      "Time_Start": 738.32,
      "Time_End": 744.8000000000001,
      "Text": " to online security service providers, Antigua Spamhouse, VirusTotal, IBM X-Force, some online"
    },
    {
      "Time_Start": 744.8000000000001,
      "Time_End": 753.6800000000001,
      "Text": " resources. That's interesting, because those online service providers will start doing live"
    },
    {
      "Time_Start": 753.6800000000001,
      "Time_End": 759.12,
      "Text": " analysis and will start searching on the IP addresses or DNS names of our infrastructure,"
    },
    {
      "Time_Start": 759.12,
      "Time_End": 764.16,
      "Text": " which will be the first line of defense. And as we're getting the data, we will get it into Red"
    },
    {
      "Time_Start": 764.16,
      "Time_End": 772.24,
      "Text": " Elk. Many times analysts as well start querying our infrastructure as well. So there is communication"
    },
    {
      "Time_Start": 772.24,
      "Time_End": 777.68,
      "Text": " from the SOC, perhaps a different upload, perhaps a different external IP address, back to our"
    },
    {
      "Time_Start": 777.68,
      "Time_End": 785.84,
      "Text": " infrastructure. And here comes the SIM functionality. We can query for all those attacks or"
    },
    {
      "Time_Start": 785.84,
      "Time_End": 791.36,
      "Text": " these artifacts or the IOCs at the online service providers, as well as we, because we put all the"
    },
    {
      "Time_Start": 791.36,
      "Time_End": 799.36,
      "Text": " data inside the Elk stack as well, we can query smartly in our own data, which will give us some"
    },
    {
      "Time_Start": 799.36,
      "Time_End": 807.84,
      "Text": " rule-based alarming functionality. So that's the high vision. Now let's talk about specific"
    },
    {
      "Time_Start": 807.84,
      "Time_End": 811.76,
      "Text": " infrastructure components that are supported at this moment. Like my colleague Mark said"
    },
    {
      "Time_Start": 811.76,
      "Time_End": 818.16,
      "Text": " already, we tend to use Cobblestrike quite a lot. We built this in the beginning for Cobblestrike,"
    },
    {
      "Time_Start": 818.16,
      "Time_End": 822.8,
      "Text": " so it has a full support for Cobblestrike. If you're using Cobblestrike, this is a tool that"
    },
    {
      "Time_Start": 822.8,
      "Time_End": 828.08,
      "Text": " you actually want. You might want to dive into Red Elk. There is no custom CNA required. Everything"
    },
    {
      "Time_Start": 828.08,
      "Time_End": 835.6,
      "Text": " is done with the out-of-the-box experience. We are working on Faction C2, as well as Empire,"
    },
    {
      "Time_Start": 835.6,
      "Time_End": 840.08,
      "Text": " for the team server components to have that included as well. We're working on that. It will"
    },
    {
      "Time_Start": 840.08,
      "Time_End": 845.2800000000001,
      "Text": " be released somewhere in the next few months, and you are encouraged to help us with that."
    },
    {
      "Time_Start": 846.96,
      "Time_End": 851.44,
      "Text": " We're gaining one location for all the logs, all the data, everything from the entire operation"
    },
    {
      "Time_Start": 851.44,
      "Time_End": 855.9200000000001,
      "Text": " to one central location, and we're doing some heavy enrichments. Talking about the redirectors,"
    },
    {
      "Time_Start": 856.88,
      "Time_End": 864.6400000000001,
      "Text": " we started with HAProxy as a proper tool. We will be working on support for Nginx and"
    },
    {
      "Time_Start": 864.6400000000001,
      "Time_End": 868.72,
      "Text": " Apache. There will be somewhere in the near future. Again, you are encouraged to help us."
    },
    {
      "Time_Start": 870.64,
      "Time_End": 875.76,
      "Text": " Depending on every redirector, reverse proxy tool that you will use, you will need to adjust some"
    },
    {
      "Time_Start": 875.76,
      "Time_End": 881.9200000000001,
      "Text": " type of logging, because in the basics, they will never give you enough information. Custom"
    },
    {
      "Time_Start": 881.9200000000001,
      "Time_End": 888.0,
      "Text": " logging is required. All the traffic is locked, and then we can do some enrichments with, for"
    },
    {
      "Time_Start": 888.0,
      "Time_End": 893.12,
      "Text": " example, Raynoise, which is awesome, or Tor address. We know which Tor addresses are there,"
    },
    {
      "Time_Start": 893.12,
      "Time_End": 901.28,
      "Text": " and we can include that. As well, we know which IP addresses are of our own team as well from the"
    },
    {
      "Time_Start": 901.28,
      "Time_End": 907.52,
      "Text": " blue team, and we can tag those addresses within the stack to make smart decisions."
    },
    {
      "Time_Start": 908.16,
      "Time_End": 912.32,
      "Text": " Of course, that's something you have to set before we start. We'll find our own test labs,"
    },
    {
      "Time_Start": 912.32,
      "Time_End": 917.2,
      "Text": " or we'll test our own beacons, or test our setup. We'll put these in an IP list. This is the red"
    },
    {
      "Time_Start": 917.2,
      "Time_End": 921.92,
      "Text": " team. Don't alarm on that. It's ourselves, and we'll make a list as soon as we can after first"
    },
    {
      "Time_Start": 921.9200000000001,
      "Time_End": 928.1600000000001,
      "Text": " contact is there with the customer to gather the IPs they often use. You might have someone"
    },
    {
      "Time_Start": 928.1600000000001,
      "Time_End": 933.5200000000001,
      "Text": " working from home, and you wouldn't know that IP, but the base IPs they use, you can also put"
    },
    {
      "Time_Start": 933.5200000000001,
      "Time_End": 940.08,
      "Text": " them in a text file saying, okay, this is what we expect to be the customer, and all other IPs might"
    },
    {
      "Time_Start": 940.08,
      "Time_End": 947.6,
      "Text": " be worth investigating. Graphical-wise, no rocket science here. There's data from"
    },
    {
      "Time_Start": 947.6800000000001,
      "Time_End": 953.0400000000001,
      "Text": " your actual target. There's data coming in from non-target IP addresses. It's on the redirector."
    },
    {
      "Time_Start": 953.0400000000001,
      "Time_End": 956.72,
      "Text": " You can make some smart writing over there. Either redirect to your focus website or"
    },
    {
      "Time_Start": 958.4,
      "Time_End": 961.36,
      "Text": " whatever, and maybe redirect some data back to your C2 service."
    },
    {
      "Time_Start": 961.36,
      "Time_End": 965.6,
      "Text": " Yeah, I think what's worth mentioning here is that the redirector, but I think the picture is"
    },
    {
      "Time_Start": 965.6,
      "Time_End": 969.9200000000001,
      "Text": " clear on that. The redirector is more than just SOCOT. It's more than just our IP tables,"
    },
    {
      "Time_Start": 969.9200000000001,
      "Time_End": 975.2,
      "Text": " which force everything. We try to make these redirectors smart somehow, and diverting"
    },
    {
      "Time_Start": 975.76,
      "Time_End": 981.5200000000001,
      "Text": " non-C2 traffic so it will never end up on our team server, and diverting that to a"
    },
    {
      "Time_Start": 981.5200000000001,
      "Time_End": 984.88,
      "Text": " bogus website or to some other tool that we might use for some reason."
    },
    {
      "Time_Start": 988.72,
      "Time_End": 995.0400000000001,
      "Text": " So internet traffic and C2 traffic will hit our infrastructure. Any reverse proxy tool"
    },
    {
      "Time_Start": 995.0400000000001,
      "Time_End": 1000.4000000000001,
      "Text": " that you will use will send it to a specific destination, and depending on the name that"
    },
    {
      "Time_Start": 1000.4,
      "Time_End": 1006.4,
      "Text": " you gave for that destination, you will see that back into RedElk. Important thing to note,"
    },
    {
      "Time_Start": 1006.4,
      "Time_End": 1011.12,
      "Text": " if you start using RedElk, you will need to do some configuration yourself. The installer of"
    },
    {
      "Time_Start": 1011.12,
      "Time_End": 1016.56,
      "Text": " RedElk will not fix your reverse proxy for you. There's a wiki. It's not that hard, but just be"
    },
    {
      "Time_Start": 1017.4399999999999,
      "Time_End": 1023.68,
      "Text": " aware of that. Filebeat reads the logs, forwards it all to RedElk. Logstash receives it,"
    },
    {
      "Time_Start": 1023.68,
      "Time_End": 1030.16,
      "Text": " does some enrichment, and stores it in a search. And there's a few backend processes going on."
    },
    {
      "Time_Start": 1030.16,
      "Time_End": 1033.76,
      "Text": " Every minute, extra enrichment is done on the data that's being received."
    },
    {
      "Time_Start": 1036.16,
      "Time_End": 1041.76,
      "Text": " For example, tagging which specific IP address, if it was from the red team, or from the target,"
    },
    {
      "Time_Start": 1041.76,
      "Time_End": 1047.0400000000002,
      "Text": " or some other known actor for which the IP address is known, we can tag those things and make smart"
    },
    {
      "Time_Start": 1047.0400000000002,
      "Time_End": 1051.92,
      "Text": " decisions with the data afterwards. Every two minutes, we sync specific files from the team"
    },
    {
      "Time_Start": 1051.92,
      "Time_End": 1059.44,
      "Text": " server. Every five minutes, there is a rule-based sim-like functionality, and I will show you in a"
    },
    {
      "Time_Start": 1059.44,
      "Time_End": 1062.88,
      "Text": " minute how the thumbnails actually look like. Because we're transferring the screenshots,"
    },
    {
      "Time_Start": 1062.88,
      "Time_End": 1066.8,
      "Text": " we do some processing on them. Not having the big screenshots, but having small thumbnails,"
    },
    {
      "Time_Start": 1066.8,
      "Time_End": 1073.1200000000001,
      "Text": " so you can easily go through that. One reason for wanting this is that I often have to manage all"
    },
    {
      "Time_Start": 1073.1200000000001,
      "Time_End": 1077.8400000000001,
      "Text": " the team servers, and I get multiple requests from team members if they can have SSH keys on"
    },
    {
      "Time_Start": 1077.8400000000001,
      "Time_End": 1082.72,
      "Text": " the team server so they can query through the log files that Cobalt Strike writes to disk and so on,"
    },
    {
      "Time_Start": 1082.72,
      "Time_End": 1086.0800000000002,
      "Text": " and then they have to log into five machines and come back to me that they can't find the"
    },
    {
      "Time_Start": 1086.08,
      "Time_End": 1091.4399999999998,
      "Text": " data and so on and so on, so now it's all in one place. We want to see everything."
    },
    {
      "Time_Start": 1094.96,
      "Time_End": 1100.72,
      "Text": " Okay, so let's pray for the demo gods. We've got our Red Elk instance here,"
    },
    {
      "Time_Start": 1102.3999999999999,
      "Time_End": 1108.32,
      "Text": " and you will be welcomed with the normal Kibana interface. Let's just go to discover."
    },
    {
      "Time_Start": 1108.32,
      "Time_End": 1120.48,
      "Text": " Yep, there it is. So this is like a typical Kibana interface. For the people not familiar"
    },
    {
      "Time_Start": 1120.48,
      "Time_End": 1126.3999999999999,
      "Text": " with this, I will walk you through it. We're in the discovery. This is the section where you can"
    },
    {
      "Time_Start": 1126.3999999999999,
      "Time_End": 1130.6399999999999,
      "Text": " look at the raw data. This is a search field where you can do some live searching in the data."
    },
    {
      "Time_Start": 1130.6399999999999,
      "Time_End": 1135.04,
      "Text": " You can select on the top right, you can select the time period that you want to search in,"
    },
    {
      "Time_Start": 1135.04,
      "Time_End": 1141.84,
      "Text": " and there is a timestamp period indication where data will be received."
    },
    {
      "Time_Start": 1142.8799999999999,
      "Time_End": 1150.3999999999999,
      "Text": " And here below, you will see the raw data. Okay, I don't like this type of columns or"
    },
    {
      "Time_Start": 1150.3999999999999,
      "Time_End": 1156.48,
      "Text": " there is no structure in that, so we created a few views for you. Let's start with timeline"
    },
    {
      "Time_Start": 1156.48,
      "Time_End": 1164.24,
      "Text": " overview, which will give you an overview of the commands and actions taken by every Red Team"
    },
    {
      "Time_Start": 1164.24,
      "Time_End": 1168.4,
      "Text": " operator. It's parsing the Cobblestrike logs and giving you some information."
    },
    {
      "Time_Start": 1170.56,
      "Time_End": 1176.24,
      "Text": " So we've got a timestamp, a specific name for an attack scenario. You will give these names"
    },
    {
      "Time_Start": 1176.24,
      "Time_End": 1182.08,
      "Text": " yourself, the specific username that this target beacon was running on, internal IP address,"
    },
    {
      "Time_Start": 1182.08,
      "Time_End": 1188.24,
      "Text": " some beacon ID, the host name, operating system, and the actual message of the log file. You can"
    },
    {
      "Time_Start": 1188.24,
      "Time_End": 1194.56,
      "Text": " remove things as you want, and you can get to a bit more raw data in this. This is default"
    },
    {
      "Time_Start": 1194.56,
      "Time_End": 1205.84,
      "Text": " Kibana stuff, messages are stored here. So let's look at a different view. Again, I'm leaving out"
    },
    {
      "Time_Start": 1205.84,
      "Time_End": 1211.84,
      "Text": " every join, leave events, new beacon events, weblog events, etc. I'm focusing for specific"
    },
    {
      "Time_Start": 1211.84,
      "Time_End": 1217.36,
      "Text": " input commands, and I'm focusing for a specific attack scenario, because during a monthly"
    },
    {
      "Time_Start": 1217.68,
      "Time_End": 1223.1200000000001,
      "Text": " engagement, afterwards, let's just say we want to give the Blue Team the proper information about"
    },
    {
      "Time_Start": 1223.1200000000001,
      "Time_End": 1228.4,
      "Text": " a specific attack. Let's say we hit an SSH, we tried to do an SSH connection to a specific system,"
    },
    {
      "Time_Start": 1228.4,
      "Time_End": 1232.0800000000002,
      "Text": " and we want to give that detailed information back to the Blue Team. The data is in there,"
    },
    {
      "Time_Start": 1232.0800000000002,
      "Time_End": 1236.88,
      "Text": " all you need to do is live searching. We know it was within this attack name. These are all"
    },
    {
      "Time_Start": 1236.88,
      "Time_End": 1241.7600000000002,
      "Text": " the commands being parsed somewhere. Let's just search for SSH, and it will do some"
    },
    {
      "Time_Start": 1242.72,
      "Time_End": 1247.68,
      "Text": " querying. Here you will see that a specific operator at a specific time hit the SSH command."
    },
    {
      "Time_Start": 1248.32,
      "Time_End": 1254.48,
      "Text": " A feature that I really like is that we created some hyperlinks to this, and you can easily just"
    },
    {
      "Time_Start": 1254.48,
      "Time_End": 1258.24,
      "Text": " get the full beacon log of that specific operation, and you can use normal"
    },
    {
      "Time_Start": 1261.2,
      "Time_End": 1265.68,
      "Text": " AppleJF for searching within your browser. All the data is along central location,"
    },
    {
      "Time_Start": 1265.68,
      "Time_End": 1271.28,
      "Text": " it will give you overview. If you're in the Blue Team, go and ask one of your Red Team members to"
    },
    {
      "Time_Start": 1272.16,
      "Time_End": 1276.8,
      "Text": " send you all the commands for user x on system y. I'll tell you they'll start sweating."
    },
    {
      "Time_Start": 1278.08,
      "Time_End": 1281.68,
      "Text": " We did a similar thing with an overview of all the indicators of compromise. At the end,"
    },
    {
      "Time_Start": 1281.68,
      "Time_End": 1285.6,
      "Text": " you might want to give the Blue Team an overview of all the IOCs that you did."
    },
    {
      "Time_Start": 1286.32,
      "Time_End": 1291.6,
      "Text": " Simple click, this is the overview. It will list everything that's generated by Corporate Strike,"
    },
    {
      "Time_Start": 1291.6,
      "Time_End": 1298.24,
      "Text": " so every file uploaded, every file created. Here, of course, you can share these,"
    },
    {
      "Time_Start": 1298.32,
      "Time_End": 1303.84,
      "Text": " you can get your CSV report. This is just default Kibana stuff."
    },
    {
      "Time_Start": 1305.84,
      "Time_End": 1310.0,
      "Text": " It will generate a CSV file for you, which you can download."
    },
    {
      "Time_Start": 1312.16,
      "Time_End": 1316.56,
      "Text": " We really tend to put all our IOCs in here, so even if we send out a phishing mail,"
    },
    {
      "Time_Start": 1316.56,
      "Time_End": 1321.84,
      "Text": " in which we attach our HTML smuggle word document, we will upload that same document"
    },
    {
      "Time_Start": 1321.84,
      "Time_End": 1325.6,
      "Text": " to one of our own test beacons, just to make sure that it's in here, because this system"
    },
    {
      "Time_Start": 1325.68,
      "Time_End": 1329.68,
      "Text": " is monitoring VirusTotal and all the others. Even if not the Blue Team, but the user decides,"
    },
    {
      "Time_Start": 1331.2,
      "Time_End": 1335.0400000000002,
      "Text": " on hindsight, this document was a bit odd, let's upload it to VirusTotal,"
    },
    {
      "Time_Start": 1335.0400000000002,
      "Time_End": 1340.72,
      "Text": " then at least we get an alarm. Someone at the client decided to upload that document."
    },
    {
      "Time_Start": 1340.72,
      "Time_End": 1346.16,
      "Text": " We might decide to clean up the persistency we had on that user's desktop, or build up other"
    },
    {
      "Time_Start": 1346.16,
      "Time_End": 1352.16,
      "Text": " persistencies somewhere else. At least it gives us to be in control of our scenario and to decide"
    },
    {
      "Time_Start": 1352.16,
      "Time_End": 1355.92,
      "Text": " what we want and how we want to engage with the Blue Team and train them to be better."
    },
    {
      "Time_Start": 1356.72,
      "Time_End": 1363.92,
      "Text": " Yep, exactly. So, simple IOC overview. Same goes for keystrokes. When I'm in a long operation,"
    },
    {
      "Time_Start": 1363.92,
      "Time_End": 1368.16,
      "Text": " I don't remember that specific system where we had that specific keylog. So, I don't want to"
    },
    {
      "Time_Start": 1368.16,
      "Time_End": 1372.96,
      "Text": " log into every specific team server to query through the keylogs. I want to have one central"
    },
    {
      "Time_Start": 1372.96,
      "Time_End": 1377.2,
      "Text": " location. Same goes here. It's a big list and you can click again on the link to get the full"
    },
    {
      "Time_Start": 1378.0800000000002,
      "Time_End": 1387.92,
      "Text": " text-based log. Screenshots. Simple overview. I do remember that specific screenshot that I saw"
    },
    {
      "Time_Start": 1387.92,
      "Time_End": 1393.04,
      "Text": " some weeks ago during the operation, which had that very important application on it."
    },
    {
      "Time_Start": 1393.04,
      "Time_End": 1399.44,
      "Text": " I can quickly browse through this list and, well, in this case, actually catch some antivirus boxes"
    },
    {
      "Time_Start": 1399.44,
      "Time_End": 1403.68,
      "Text": " with this, which will have a big role in receiving hybrid analysis. Again, link to the bigger"
    },
    {
      "Time_Start": 1403.68,
      "Time_End": 1411.1200000000001,
      "Text": " screenshot. Okay, so that's all on the operations. Yep, we make a lot of screenshots during"
    },
    {
      "Time_Start": 1411.1200000000001,
      "Time_End": 1416.0,
      "Text": " our operation because as we feel red teaming, or at least a scenario that you plot, usually has an"
    },
    {
      "Time_Start": 1416.0,
      "Time_End": 1420.0,
      "Text": " out phase as well. You want to reach something. You want to go to a certain goal. For most of"
    },
    {
      "Time_Start": 1420.0,
      "Time_End": 1425.1200000000001,
      "Text": " our red team operations, being domain admin is in the end. It's basically the start of actually"
    },
    {
      "Time_Start": 1425.1200000000001,
      "Time_End": 1429.28,
      "Text": " getting to the business crown jewels. That's how you also involve the business in an exercise like"
    },
    {
      "Time_Start": 1429.28,
      "Time_End": 1434.6399999999999,
      "Text": " this, which means that sometimes for days or even weeks, we might have to key log and screenshot"
    },
    {
      "Time_Start": 1434.6399999999999,
      "Time_End": 1441.04,
      "Text": " users in order to learn how they work, what their daily operation is. We don't know all the business"
    },
    {
      "Time_Start": 1441.76,
      "Time_End": 1446.16,
      "Text": " stuff on the application, so we have to learn from the users and the daily procedures on how to get"
    },
    {
      "Time_Start": 1446.16,
      "Time_End": 1450.72,
      "Text": " to what we consider our goal. We'll do that through screenshots, and that's why it's so"
    },
    {
      "Time_Start": 1451.44,
      "Time_End": 1457.52,
      "Text": " valuable to us to have that all in one location. Okay, cool. So, what I just showed you was all"
    },
    {
      "Time_Start": 1457.52,
      "Time_End": 1462.8,
      "Text": " about operations during the red teaming, as in commands typed by the operators. So, let's take a"
    },
    {
      "Time_Start": 1462.8,
      "Time_End": 1470.16,
      "Text": " quick look about specific data. Well, requests that came back to me that touched our infrastructure."
    },
    {
      "Time_Start": 1470.8,
      "Time_End": 1477.68,
      "Text": " So, we got a different view, which is on the redirected traffic. It will give you the same type"
    },
    {
      "Time_Start": 1477.68,
      "Time_End": 1484.8799999999999,
      "Text": " of columns, scenario, the destination that the reverse proxy actually chose, which could be your"
    },
    {
      "Time_Start": 1484.88,
      "Time_End": 1489.0400000000002,
      "Text": " decoy or your corporate strike, or this is the name that you give it yourself. And it does some"
    },
    {
      "Time_Start": 1489.0400000000002,
      "Time_End": 1493.7600000000002,
      "Text": " enrichment on source IP address and some GeoIP tagging, and it will give you the full request,"
    },
    {
      "Time_Start": 1493.7600000000002,
      "Time_End": 1499.0400000000002,
      "Text": " stuff like that. Enrichment is also done with the tags. So, you will see here that there's an IP"
    },
    {
      "Time_Start": 1499.0400000000002,
      "Time_End": 1503.8400000000001,
      "Text": " list for red team and IP list for the customer. If you define these within the configs, tagging"
    },
    {
      "Time_Start": 1503.8400000000001,
      "Time_End": 1510.4,
      "Text": " will be done automatically, and you can quickly just select for every specific customer request."
    },
    {
      "Time_Start": 1510.5600000000002,
      "Time_End": 1520.8000000000002,
      "Text": " Okay, I've got a few more examples. Simply searching for non-antivirus systems or, yeah,"
    },
    {
      "Time_Start": 1520.8000000000002,
      "Time_End": 1527.2800000000002,
      "Text": " systems, it's as easy as this. You will get all the information from where antivirus systems are"
    },
    {
      "Time_Start": 1527.2800000000002,
      "Time_End": 1533.44,
      "Text": " doing live interaction with your infrastructure. This is interesting. I've got a few more examples,"
    },
    {
      "Time_Start": 1533.76,
      "Time_End": 1545.76,
      "Text": " but we're running low on time. So, let's go back to the presentation. So, back up things for if."
    },
    {
      "Time_Start": 1550.8,
      "Time_End": 1555.44,
      "Text": " This is the interface of Symantec EDR, their next generation EDR solution."
    },
    {
      "Time_Start": 1556.16,
      "Time_End": 1561.2,
      "Text": " And why did I pick this screenshot? Well, look at the two arrows below. There are two"
    },
    {
      "Time_Start": 1562.0800000000002,
      "Time_End": 1567.04,
      "Text": " easy clickable things for the operator. One is submit to sandbox, which is Symantec's own"
    },
    {
      "Time_Start": 1567.04,
      "Time_End": 1573.28,
      "Text": " specific sandbox, and there's submit to virus total. It's made easy for the blue team to upload"
    },
    {
      "Time_Start": 1573.28,
      "Time_End": 1579.2,
      "Text": " stuff to online live analysis. Blue team or the customer in general. Often, if we speak to blue"
    },
    {
      "Time_Start": 1579.2,
      "Time_End": 1584.0,
      "Text": " teams, they would say, we would never upload anything to an online service. But we yet have"
    },
    {
      "Time_Start": 1584.72,
      "Time_End": 1592.0,
      "Text": " to find the first customer when we didn't hit an alarm. This is, nowadays it's called Microsoft"
    },
    {
      "Time_Start": 1592.0,
      "Time_End": 1600.32,
      "Text": " Defender ATP. Again, two screenshots, two buttons. One is that actually it already does a check with"
    },
    {
      "Time_Start": 1600.32,
      "Time_End": 1605.28,
      "Text": " online virus total. And the second one is if you want to submit it for deep analysis at the"
    },
    {
      "Time_Start": 1605.28,
      "Time_End": 1611.76,
      "Text": " Microsoft analysis cloud thingy. Funny thing is that because we're getting the beacons back,"
    },
    {
      "Time_Start": 1611.76,
      "Time_End": 1617.6,
      "Text": " or at least because we're analyzing the data, we can see which specific systems are getting"
    },
    {
      "Time_Start": 1617.6,
      "Time_End": 1624.96,
      "Text": " a beacon back. It's a bit smaller size, but you will see the amount of... These are system names,"
    },
    {
      "Time_Start": 1624.96,
      "Time_End": 1630.8,
      "Text": " admin PC, John PC, stuff like that. And compared to the different attacking scenarios,"
    },
    {
      "Time_Start": 1630.8,
      "Time_End": 1636.0,
      "Text": " you will see that many times, well, it's pretty obvious. Sandboxes will stand out. These do not"
    },
    {
      "Time_Start": 1636.0,
      "Time_End": 1642.24,
      "Text": " look like your average target computer name. It's a clear indicator. Basically, this data,"
    },
    {
      "Time_Start": 1642.24,
      "Time_End": 1646.72,
      "Text": " you could give a full presentation on. What we see is if you post something to a sandbox,"
    },
    {
      "Time_Start": 1646.72,
      "Time_End": 1651.44,
      "Text": " you will likely see that sandbox call back to you. And then half an hour later, two other sandboxes"
    },
    {
      "Time_Start": 1651.44,
      "Time_End": 1655.28,
      "Text": " pop up where you never submitted yourself because they're sharing data. And this will go on for a"
    },
    {
      "Time_Start": 1655.28,
      "Time_End": 1661.6,
      "Text": " few hours and then it will be quiet. And if your malware did evil stuff, then the next morning or"
    },
    {
      "Time_Start": 1661.68,
      "Time_End": 1666.8000000000002,
      "Text": " a few hours later, you will have a huge wave of investigators and sandboxes flowing all over."
    },
    {
      "Time_Start": 1666.8000000000002,
      "Time_End": 1671.92,
      "Text": " Apparently, people that buy all the samples that go into these sandboxes and try to reanalyze"
    },
    {
      "Time_Start": 1671.92,
      "Time_End": 1677.0400000000002,
      "Text": " themselves, and you'll have a huge wave of incoming connections. You'll also see interesting"
    },
    {
      "Time_Start": 1677.0400000000002,
      "Time_End": 1680.72,
      "Text": " things like... I don't know if there's anybody from Trustwave within the audience, but if there"
    },
    {
      "Time_Start": 1680.72,
      "Time_End": 1689.44,
      "Text": " is, I do want to have a talk with you because we always see traffic from Trustwave with multiple"
    },
    {
      "Time_Start": 1689.52,
      "Time_End": 1692.96,
      "Text": " different IP addresses at the same time, trying to reach a different type of URLs."
    },
    {
      "Time_Start": 1696.0800000000002,
      "Time_End": 1699.8400000000001,
      "Text": " Uppercase, lowercase, everything, but always requests at the same time from different IP"
    },
    {
      "Time_Start": 1699.8400000000001,
      "Time_End": 1703.44,
      "Text": " addresses. I want to know what's going on. So if there's somebody from Trustwave, please"
    },
    {
      "Time_Start": 1703.44,
      "Time_End": 1709.28,
      "Text": " catch me later on the presentation. We can do some user agents checking all the data is here."
    },
    {
      "Time_Start": 1709.92,
      "Time_End": 1714.16,
      "Text": " I'm going to go quickly through these. These are instant messaging previews things. It's"
    },
    {
      "Time_Start": 1714.16,
      "Time_End": 1720.0,
      "Text": " no new research, but because we have the data, you can quickly see how the previews are generated,"
    },
    {
      "Time_Start": 1720.0,
      "Time_End": 1728.16,
      "Text": " in this case by Telegram. You need to read this from bottom to top. So this is live typed,"
    },
    {
      "Time_Start": 1728.16,
      "Time_End": 1733.2,
      "Text": " and it's building up the URL that we're testing here. So there's many more resources at this"
    },
    {
      "Time_Start": 1733.2,
      "Time_End": 1739.52,
      "Text": " specific link. And other Red Team operators are interested in public IP addresses of known"
    },
    {
      "Time_Start": 1740.16,
      "Time_End": 1744.4,
      "Text": " domain classifiers as well. So this was a discussion that I had with one of the operators"
    },
    {
      "Time_Start": 1744.4,
      "Time_End": 1751.04,
      "Text": " of SpectreOps, Kelly. Because we have such data, we can easily go through and get this intel to us."
    },
    {
      "Time_Start": 1753.04,
      "Time_End": 1758.48,
      "Text": " Then we have the catch of the day. Even we get caught by surprise sometimes. When I was asked"
    },
    {
      "Time_Start": 1758.48,
      "Time_End": 1762.6399999999999,
      "Text": " by one of my colleagues to spin up a new infrastructure with new redirectors for"
    },
    {
      "Time_Start": 1762.6399999999999,
      "Time_End": 1767.36,
      "Text": " one of the ongoing assignments, we found this. I just spin up this fresh redirector,"
    },
    {
      "Time_Start": 1767.3600000000001,
      "Time_End": 1773.68,
      "Text": " link it into our system, and then we suddenly get all kinds of calls from phones to whatever it is."
    },
    {
      "Time_Start": 1773.68,
      "Time_End": 1779.92,
      "Text": " They all came from my RN. I've got no clue what IP address DigitalOcean assigned to us in this case."
    },
    {
      "Time_Start": 1779.92,
      "Time_End": 1785.7600000000002,
      "Text": " But this went on for hours, and actually it's just continuously. It's still running. We decided"
    },
    {
      "Time_Start": 1785.7600000000002,
      "Time_End": 1790.2400000000002,
      "Text": " to scoop this IP address out of the engagement, because it would fill our database really fast."
    },
    {
      "Time_Start": 1790.2400000000002,
      "Time_End": 1794.96,
      "Text": " But I've got no clue what I'm looking at here. I've got some peak hacks. If anyone's interested"
    },
    {
      "Time_Start": 1794.96,
      "Time_End": 1800.0,
      "Text": " in diving into this stuff, or if anyone has a clue, catch me later on in the conference and we'll"
    },
    {
      "Time_Start": 1800.0,
      "Time_End": 1805.04,
      "Text": " have a chat about it. I decided to park it for a while and continue our daily operation."
    },
    {
      "Time_Start": 1805.04,
      "Time_End": 1809.92,
      "Text": " But now we have these insights, we get these kind of surprises that you normally might not even see."
    },
    {
      "Time_Start": 1810.8,
      "Time_End": 1818.56,
      "Text": " Okay, we need to speed up. So one more thing I want to point, touch on, is we, up until now, we look"
    },
    {
      "Time_Start": 1818.56,
      "Time_End": 1823.2,
      "Text": " at data on the external infrastructure, but we can do the same thing on the internal side."
    },
    {
      "Time_Start": 1824.16,
      "Time_End": 1828.24,
      "Text": " Can we see actions by the blue team on the internal side once we've been"
    },
    {
      "Time_Start": 1828.8,
      "Time_End": 1834.72,
      "Text": " detected? One of the things is, for example, a change of the KAB TGT password update."
    },
    {
      "Time_Start": 1835.8400000000001,
      "Time_End": 1839.92,
      "Text": " If we come into a client and we see that the last time the password was changed was many,"
    },
    {
      "Time_Start": 1839.92,
      "Time_End": 1844.56,
      "Text": " many, many years ago, and during the up, all of a sudden the password has changed, well,"
    },
    {
      "Time_Start": 1844.56,
      "Time_End": 1849.6000000000001,
      "Text": " something fishy is going on. There are many more things that we can do. A quick overview."
    },
    {
      "Time_Start": 1850.5600000000002,
      "Time_End": 1854.0800000000002,
      "Text": " You've got the data with Redhawk, you can do the smart querying yourself, there are many"
    },
    {
      "Time_Start": 1854.0800000000002,
      "Time_End": 1859.92,
      "Text": " interesting things that you can do. We are working on more automated alarms, but it's not up to the"
    },
    {
      "Time_Start": 1859.92,
      "Time_End": 1866.3200000000002,
      "Text": " level that we are, well, it works for us right now, but we will be improving. So two major alarms"
    },
    {
      "Time_Start": 1866.3200000000002,
      "Time_End": 1871.7600000000002,
      "Text": " that we've got right now is an IOC of ourselves seen at one of the public security service"
    },
    {
      "Time_Start": 1871.7600000000002,
      "Time_End": 1877.2,
      "Text": " providers, VirusTotal, IBM Explorers, Hybrid Analysis, and you will get an alarm when that IOC"
    },
    {
      "Time_Start": 1877.2,
      "Time_End": 1884.16,
      "Text": " is found, as well as an unknown IP address hitting RSC2, which is not tagged by one of the"
    },
    {
      "Time_Start": 1884.16,
      "Time_End": 1889.76,
      "Text": " gray noise things as being a typical web scanner-like background noise of the internet."
    },
    {
      "Time_Start": 1891.52,
      "Time_End": 1897.04,
      "Text": " Okay, if you want to get in touch and help out this project, please, please get in touch."
    },
    {
      "Time_Start": 1898.8,
      "Time_End": 1904.16,
      "Text": " What we've seen so far from Redhawk is still somewhat passive, though. We do gather all the"
    },
    {
      "Time_Start": 1904.16,
      "Time_End": 1908.88,
      "Text": " Intel on one database, and we can manually grab through that, but we felt the need also to be"
    },
    {
      "Time_Start": 1908.88,
      "Time_End": 1916.0,
      "Text": " able to interact live when something happens. We want to stay in control of our operation,"
    },
    {
      "Time_Start": 1916.0,
      "Time_End": 1921.52,
      "Text": " to act as a proper trainer for our customer, for the blue team and the organization behind it,"
    },
    {
      "Time_Start": 1921.52,
      "Time_End": 1925.8400000000001,
      "Text": " or with it. So in order to stay in control, we needed to move faster, we needed to be able to"
    },
    {
      "Time_Start": 1925.8400000000001,
      "Time_End": 1932.88,
      "Text": " respond live to what's happening. One of the things we do, just to a glance at how we operate,"
    },
    {
      "Time_Start": 1932.88,
      "Time_End": 1940.0,
      "Text": " we never tend to work with Cobblestrike staging. We make our own staging, and we never tend to work"
    },
    {
      "Time_Start": 1940.0,
      "Time_End": 1946.88,
      "Text": " with stageless items on disk, so we don't want our full stage already there, because if it's there,"
    },
    {
      "Time_Start": 1946.88,
      "Time_End": 1953.6000000000001,
      "Text": " we can't control it anymore. We tend to find some way for our initial vector to download,"
    },
    {
      "Time_Start": 1953.6000000000001,
      "Time_End": 1958.0800000000002,
      "Text": " the initial vector and or the persistency, to download the full stage and then start working."
    },
    {
      "Time_Start": 1958.08,
      "Time_End": 1961.9199999999998,
      "Text": " Usually, for example, to host text files somewhere, as easy as that, and download those."
    },
    {
      "Time_Start": 1964.48,
      "Time_End": 1968.8799999999999,
      "Text": " And then we usually have a bot that migrates. If we have persistency in Word, we'll have a bot that"
    },
    {
      "Time_Start": 1968.8799999999999,
      "Time_End": 1973.36,
      "Text": " will migrate to another process that will live longer than Word, because the user might kill"
    },
    {
      "Time_Start": 1973.36,
      "Time_End": 1978.8799999999999,
      "Text": " Word after a few minutes, and if you can dive into some tray icon, you can live for the rest"
    },
    {
      "Time_Start": 1978.88,
      "Time_End": 1989.68,
      "Text": " of the day. So what we introduced was Red File. It's basically a very simple Python tool that"
    },
    {
      "Time_Start": 1989.68,
      "Time_End": 1995.2800000000002,
      "Text": " lives in your web server, that can help you serving files the way you need them to be served."
    },
    {
      "Time_Start": 1996.16,
      "Time_End": 2001.7600000000002,
      "Text": " I'll get into some examples on that, but basically every file that you request is built"
    },
    {
      "Time_Start": 2002.72,
      "Time_End": 2008.8799999999999,
      "Text": " live and you can code however you want it. You can do it IP-based or you can have a lot of rules in"
    },
    {
      "Time_Start": 2008.8799999999999,
      "Time_End": 2014.8,
      "Text": " there. Yes, you can always whitelist on IP if you want some IP restrictions, but you might want to"
    },
    {
      "Time_Start": 2014.8,
      "Time_End": 2020.64,
      "Text": " be able to react on a user agent and serve a different content for a certain user agent."
    },
    {
      "Time_Start": 2020.64,
      "Time_End": 2026.48,
      "Text": " You might want to be able to react on the time of the day, the amount of calls you get, if a certain"
    },
    {
      "Time_Start": 2026.56,
      "Time_End": 2032.64,
      "Text": " pixel is hit before the payload is called, and so on. Basically, I was building a lot of these"
    },
    {
      "Time_Start": 2032.64,
      "Time_End": 2037.2,
      "Text": " tools separately and I decided it had to be easier, so I built something that works with modules. You"
    },
    {
      "Time_Start": 2037.2,
      "Time_End": 2042.48,
      "Text": " can just have this Python shell running or this Flask framework running, and this is a working"
    },
    {
      "Time_Start": 2042.48,
      "Time_End": 2049.04,
      "Text": " code, basically 12 lines of effective code that will serve something based on user agents."
    },
    {
      "Time_Start": 2050.0,
      "Time_End": 2056.48,
      "Text": " We can now serve whatever we want to serve. I'm going to walk you through two examples of"
    },
    {
      "Time_Start": 2056.48,
      "Time_End": 2067.44,
      "Text": " how we use that. I think this is the first one. We saw an engagement where we see a proxy hitting"
    },
    {
      "Time_Start": 2067.44,
      "Time_End": 2073.04,
      "Text": " our payload and then the real user agent comes along. We want to divert this proxy somewhere"
    },
    {
      "Time_Start": 2073.04,
      "Time_End": 2079.2799999999997,
      "Text": " else, so at least that the investigation doesn't see something evil is going on, and we want the"
    },
    {
      "Time_Start": 2079.2799999999997,
      "Time_End": 2092.56,
      "Text": " user, of course, to get the real payload. That's got to be this one. Here we have the default"
    },
    {
      "Time_Start": 2092.56,
      "Time_End": 2098.08,
      "Text": " payload that you will see if you come from a random IP, so an IP that is not known."
    },
    {
      "Time_Start": 2099.04,
      "Time_End": 2105.52,
      "Text": " No matter how often I click this, this is where I get served. If I put the VPN off,"
    },
    {
      "Time_Start": 2105.52,
      "Time_End": 2112.0,
      "Text": " now I'm just in our own lab environment, so it's a whitelisted IP, and I will get the payload that"
    },
    {
      "Time_Start": 2112.0,
      "Time_End": 2117.04,
      "Text": " I really want to serve to the customer. Of course, an IP whitelist you can build on any web server."
    },
    {
      "Time_Start": 2117.04,
      "Time_End": 2122.16,
      "Text": " It's just the concept that it's really easy to build this diversified on IP or on any other"
    },
    {
      "Time_Start": 2122.8799999999997,
      "Time_End": 2126.48,
      "Text": " thing you want to divert on."
    },
    {
      "Time_Start": 2131.8399999999997,
      "Time_End": 2146.48,
      "Text": " Another one we have here is, what we saw at another customer is we have"
    },
    {
      "Time_Start": 2146.48,
      "Time_End": 2153.6,
      "Text": " persistency in Microsoft Word, and this specific persistency, this guy tended to select a lot of"
    },
    {
      "Time_Start": 2153.6,
      "Time_End": 2159.04,
      "Text": " Word documents on his desktop and open them all at the same time, so we would see a lot of beacons"
    },
    {
      "Time_Start": 2159.04,
      "Time_End": 2165.12,
      "Text": " in a few minutes, but as we have auto-migration on, in this case, we would migrate 18 times to"
    },
    {
      "Time_Start": 2165.12,
      "Time_End": 2169.76,
      "Text": " our process we want to live in for the day. As you can imagine, that's not something that's useful"
    },
    {
      "Time_Start": 2169.76,
      "Time_End": 2176.96,
      "Text": " for us, so what did we build? We built the same little module that will serve content only once"
    },
    {
      "Time_Start": 2176.96,
      "Time_End": 2182.5600000000004,
      "Text": " in 30 seconds, so it will serve the content. If you hit F5, it will not serve you anything at all"
    },
    {
      "Time_Start": 2183.2000000000003,
      "Time_End": 2188.2400000000002,
      "Text": " until 30 seconds later. Just another simple way of controlling when and how we serve content"
    },
    {
      "Time_Start": 2189.28,
      "Time_End": 2195.76,
      "Text": " to our victim. Again, the code, it's a one-pager. This might not be 12 or 20 lines,"
    },
    {
      "Time_Start": 2195.76,
      "Time_End": 2201.1200000000003,
      "Text": " but that's about it. Well, that's just how we ease our operation, but then once we've built this,"
    },
    {
      "Time_Start": 2201.1200000000003,
      "Time_End": 2205.5200000000004,
      "Text": " we can also use it to decoy. We can use it to see if we can serve a real payload"
    },
    {
      "Time_Start": 2206.1600000000003,
      "Time_End": 2209.92,
      "Text": " to our victim and another payload to the blue team."
    },
    {
      "Time_Start": 2212.1600000000003,
      "Time_End": 2216.8,
      "Text": " Well, let's give that a try. I built a payload that goes by key."
    },
    {
      "Time_Start": 2217.76,
      "Time_End": 2221.76,
      "Text": " So, I'm going to click this link. This is the link. This is one payload with a key in it,"
    },
    {
      "Time_Start": 2221.76,
      "Time_End": 2228.1600000000003,
      "Text": " and the first click might be for the proxy. Well, we all see get a robots.txt here, so this URL"
    },
    {
      "Time_Start": 2228.1600000000003,
      "Time_End": 2234.1600000000003,
      "Text": " here gives you a robots.txt. If we now press refresh, as this might be the second call"
    },
    {
      "Time_Start": 2234.1600000000003,
      "Time_End": 2241.76,
      "Text": " after the proxy has done its thing, we'll now have a default CobaltStrike PowerShell macro."
    },
    {
      "Time_Start": 2242.1600000000003,
      "Time_End": 2250.0,
      "Text": " We'll now have a default CobaltStrike PowerShell macro. Interesting. So, SOP finds some infection"
    },
    {
      "Time_Start": 2250.0,
      "Time_End": 2257.5200000000004,
      "Text": " and they'll start researching this URL. Once they look at the URL, they also get some PowerShell,"
    },
    {
      "Time_Start": 2257.5200000000004,
      "Time_End": 2262.0,
      "Text": " but this seems to be a Bitcoin stealer. Is it any threat, a Bitcoin stealer? It's annoying"
    },
    {
      "Time_Start": 2262.0,
      "Time_End": 2266.1600000000003,
      "Text": " to have mobile around your organization looking for Bitcoins, but unless you're a Bitcoin exchange,"
    },
    {
      "Time_Start": 2266.7200000000003,
      "Time_End": 2271.36,
      "Text": " this is likely not going to put a higher note on with you, but nevertheless, it's weird that"
    },
    {
      "Time_Start": 2271.36,
      "Time_End": 2275.04,
      "Text": " it even comes in, so you share it with a colleague. He also looks at it. So, yeah,"
    },
    {
      "Time_Start": 2275.04,
      "Time_End": 2281.1200000000003,
      "Text": " it's a Bitcoin stealer. It's odd, but how do we get this into our endpoints? Why didn't we see"
    },
    {
      "Time_Start": 2281.1200000000003,
      "Time_End": 2286.2400000000002,
      "Text": " this before? Maybe we should gather the team and have a look at it together. So, they gather the"
    },
    {
      "Time_Start": 2286.2400000000002,
      "Time_End": 2292.96,
      "Text": " team, put it on Beamer, and they request the URL again, and this is our default scene. Basically,"
    },
    {
      "Time_Start": 2292.96,
      "Time_End": 2298.1600000000003,
      "Text": " what I'm trying to show you here is it's really easy to have one URL and change it as you go."
    },
    {
      "Time_Start": 2298.8799999999997,
      "Time_End": 2303.44,
      "Text": " For us, it's a tool that's really convenient to work alongside RedElk. So, RedElk, we have"
    },
    {
      "Time_Start": 2303.44,
      "Time_End": 2308.56,
      "Text": " passive information to gather data on and decide how we want to react, and then we have RedFile,"
    },
    {
      "Time_Start": 2308.56,
      "Time_End": 2315.12,
      "Text": " which we can really easy program to react how we want it and the way we want it, and we can decide"
    },
    {
      "Time_Start": 2315.7599999999998,
      "Time_End": 2319.7599999999998,
      "Text": " what we want to teach the blue team. How we might be pushing them by decoing them,"
    },
    {
      "Time_Start": 2319.7599999999998,
      "Time_End": 2325.04,
      "Text": " we might choose not to, depending on where they stand, what we all decided on forehand,"
    },
    {
      "Time_Start": 2325.52,
      "Time_End": 2332.88,
      "Text": " what there's to learn in this operation. So, basically, we think red teaming should be there"
    },
    {
      "Time_Start": 2332.88,
      "Time_End": 2338.8,
      "Text": " to make blue teams better. It should be a training game and not an ego-based win-win"
    },
    {
      "Time_Start": 2338.8,
      "Time_End": 2347.6,
      "Text": " situation, not red against blue. RedFile and RedElk can be of great help to red teamers to make"
    },
    {
      "Time_Start": 2347.6,
      "Time_End": 2353.04,
      "Text": " proper reports, have all the data in one place, but also to roll a better scenario, and also to"
    },
    {
      "Time_Start": 2353.7599999999998,
      "Time_End": 2360.16,
      "Text": " roll a better scenario. And then, please, blue, think of your OPSEC. We always hit alarms somewhere."
    },
    {
      "Time_Start": 2361.6,
      "Time_End": 2368.56,
      "Text": " Thanks."
    }
  ]
}