{
  "segments": [
    {
      "Time_Start": 0.0,
      "Time_End": 10.6,
      "Text": "This text was transcribed using whisper model: large-v2\n\n I am Alex."
    },
    {
      "Time_Start": 10.6,
      "Time_End": 11.6,
      "Text": " This is Jason."
    },
    {
      "Time_Start": 11.6,
      "Time_End": 14.280000000000001,
      "Text": " You will see that APT28 is crossed out."
    },
    {
      "Time_Start": 14.280000000000001,
      "Time_End": 19.92,
      "Text": " That is because when we wrote this and when we submitted it, I was at FireEye, which tracks"
    },
    {
      "Time_Start": 19.92,
      "Time_End": 22.92,
      "Text": " this particular activity as APT28."
    },
    {
      "Time_Start": 22.92,
      "Time_End": 27.32,
      "Text": " Now that I'm at CrowdStrike, I am used to tracking it as Fancy Bear."
    },
    {
      "Time_Start": 27.32,
      "Time_End": 31.36,
      "Text": " And what we're here to talk about today is in the same vein of how attacks really are"
    },
    {
      "Time_Start": 31.36,
      "Time_End": 35.64,
      "Text": " complex events driven by human beings, as has been touched on by a number of talks so"
    },
    {
      "Time_Start": 35.64,
      "Time_End": 42.44,
      "Text": " far this morning, how misconceptions about what it means to be a human being and deal"
    },
    {
      "Time_Start": 42.44,
      "Time_End": 47.16,
      "Text": " with the human consequences of activities like the actors who are likely responsible"
    },
    {
      "Time_Start": 47.16,
      "Time_End": 51.56,
      "Text": " for Fancy Bear and things like that, specifically related to activity that has been documented"
    },
    {
      "Time_Start": 51.56,
      "Time_End": 57.2,
      "Text": " in recent U.S. government indictments over the last year, can help inform a variety"
    },
    {
      "Time_Start": 57.2,
      "Time_End": 60.480000000000004,
      "Text": " of both blue and red team activities."
    },
    {
      "Time_Start": 60.480000000000004,
      "Time_End": 63.2,
      "Text": " All right."
    },
    {
      "Time_Start": 63.2,
      "Time_End": 67.88,
      "Text": " So the normal disclaimers, and I have to actually read this word for word."
    },
    {
      "Time_Start": 67.88,
      "Time_End": 69.88,
      "Text": " That's the policy, so I apologize."
    },
    {
      "Time_Start": 69.88,
      "Time_End": 73.4,
      "Text": " We are here speaking for on behalf of no one but ourselves, and in no way do either of"
    },
    {
      "Time_Start": 73.4,
      "Time_End": 78.48,
      "Text": " us represent in any sort of way possible, at least any more, the United States government."
    },
    {
      "Time_Start": 78.48,
      "Time_End": 84.76,
      "Text": " And our analysis is based entirely on assessments of open source reporting and our own experiences,"
    },
    {
      "Time_Start": 84.76,
      "Time_End": 89.24000000000001,
      "Text": " both together and separate, but generalized in a pretty understandable and obvious sort"
    },
    {
      "Time_Start": 89.24000000000001,
      "Time_End": 93.32000000000001,
      "Text": " of way as we go through this."
    },
    {
      "Time_Start": 93.32000000000001,
      "Time_End": 96.66,
      "Text": " So we were given a very kind introduction, just to kind of go over it a little bit."
    },
    {
      "Time_Start": 96.66,
      "Time_End": 102.68,
      "Text": " We tried to capture our own individual essences up here in one image each."
    },
    {
      "Time_Start": 102.68,
      "Time_End": 106.56,
      "Text": " I spend most of my time tracking state nexus espionage."
    },
    {
      "Time_Start": 106.56,
      "Time_End": 110.08,
      "Text": " I did it with a focus on critical infrastructure at FireEye."
    },
    {
      "Time_Start": 110.08,
      "Time_End": 115.48,
      "Text": " I do it more kind of in what I find super interesting now that I'm at CrowdStrike."
    },
    {
      "Time_Start": 115.48,
      "Time_End": 119.84,
      "Text": " Before that, I did a lot of critical infrastructure and cybersecurity exercise stuff for the U.S."
    },
    {
      "Time_Start": 119.84,
      "Time_End": 126.72,
      "Text": " government, and I feel like this is a general good representation of what I look like on"
    },
    {
      "Time_Start": 126.72,
      "Time_End": 130.44,
      "Text": " a day-to-day basis at work."
    },
    {
      "Time_Start": 130.44,
      "Time_End": 134.52,
      "Text": " And as was said in the introduction, I spent about 15 years in the U.S. intelligence community,"
    },
    {
      "Time_Start": 134.52,
      "Time_End": 139.0,
      "Text": " primarily designing, running, managing, executing offensive cyber and tech operations all over"
    },
    {
      "Time_Start": 139.0,
      "Time_End": 140.0,
      "Text": " the world."
    },
    {
      "Time_Start": 140.0,
      "Time_End": 144.88,
      "Text": " Did that for, like I said, about 15 years, until about two years ago when I left, fled"
    },
    {
      "Time_Start": 144.88,
      "Time_End": 149.84,
      "Text": " the Washington, D.C. area to another part of the United States, and began working in"
    },
    {
      "Time_Start": 149.84,
      "Time_End": 154.0,
      "Text": " the private sector security, doing a lot of product stuff and managed detection and response"
    },
    {
      "Time_Start": 154.0,
      "Time_End": 156.76000000000002,
      "Text": " at a company called East Entire, where I am now."
    },
    {
      "Time_Start": 156.76000000000002,
      "Time_End": 159.84,
      "Text": " In those 15 years, there were sort of two types of operations that I worked on, and"
    },
    {
      "Time_Start": 159.84,
      "Time_End": 162.64000000000001,
      "Text": " I only touch on this because it will become relevant as we get through."
    },
    {
      "Time_Start": 162.64000000000001,
      "Time_End": 166.28,
      "Text": " One is what we would call remote operations, where everyone can do their job in shorts"
    },
    {
      "Time_Start": 166.28,
      "Time_End": 169.64000000000001,
      "Text": " and flip-flops from the comfort of their office, and at the end of the day, you get to go home"
    },
    {
      "Time_Start": 169.64000000000001,
      "Time_End": 173.56,
      "Text": " and hang out with your spouse and your dog and your cat, where you throw exploits at"
    },
    {
      "Time_Start": 173.56,
      "Time_End": 176.64000000000001,
      "Text": " a target, you get in, you spearfish people, you get that moment where you're like, we're"
    },
    {
      "Time_Start": 176.64000000000001,
      "Time_End": 180.32000000000002,
      "Text": " in, and everyone gets happy and people get awards and it's great and it's exciting."
    },
    {
      "Time_Start": 180.32000000000002,
      "Time_End": 183.72000000000003,
      "Text": " But not all the time are those networks accessible remotely."
    },
    {
      "Time_Start": 183.72000000000003,
      "Time_End": 186.32000000000002,
      "Text": " Sometimes you can't get in from 5,000 miles away and you have to get a little bit more"
    },
    {
      "Time_Start": 186.32000000000002,
      "Time_End": 187.48000000000002,
      "Text": " clever about it."
    },
    {
      "Time_Start": 187.48000000000002,
      "Time_End": 191.32000000000002,
      "Text": " In those scenarios where we have things like close access operations, some poor schmuck"
    },
    {
      "Time_Start": 191.32,
      "Time_End": 194.44,
      "Text": " has got to wear a backpack and a disguise with a bunch of gear in that backpack and"
    },
    {
      "Time_Start": 194.44,
      "Time_End": 198.79999999999998,
      "Text": " wander around in a courtyard of an office building or outside the walls of a compound"
    },
    {
      "Time_Start": 198.79999999999998,
      "Time_End": 203.82,
      "Text": " and try to do something clever with the Wi-Fi or some other RF thing to try to bridge access"
    },
    {
      "Time_Start": 203.82,
      "Time_End": 206.76,
      "Text": " into a network for someone else to do something interesting with it."
    },
    {
      "Time_Start": 206.76,
      "Time_End": 209.6,
      "Text": " And those sorts of operations, close access, have a unique nature about them, and we'll"
    },
    {
      "Time_Start": 209.6,
      "Time_End": 215.32,
      "Text": " talk about that as we get deeper on Fancy Bear."
    },
    {
      "Time_Start": 215.32,
      "Time_End": 219.72,
      "Text": " So what we're here to talk about today is basically the fact that with a lot of state"
    },
    {
      "Time_Start": 219.72,
      "Time_End": 224.48,
      "Text": " nexus activity, we come with a lot of preconceived notions just kind of as a baseline community,"
    },
    {
      "Time_Start": 224.48,
      "Time_End": 229.0,
      "Text": " and certainly the general public does, as do a lot of the executives that we answer"
    },
    {
      "Time_Start": 229.0,
      "Time_End": 236.18,
      "Text": " to, especially if we're serving corporate clients, about how state nexus operations"
    },
    {
      "Time_Start": 236.18,
      "Time_End": 240.74,
      "Text": " come to be and what goes into making them and what you can kind of draw out of them"
    },
    {
      "Time_Start": 240.74,
      "Time_End": 243.57999999999998,
      "Text": " in observing them and responding to them."
    },
    {
      "Time_Start": 243.57999999999998,
      "Time_End": 249.36,
      "Text": " And the reality is is that they're human, and like all human activities, there is chaos"
    },
    {
      "Time_Start": 249.36,
      "Time_End": 251.60000000000002,
      "Text": " involved."
    },
    {
      "Time_Start": 251.60000000000002,
      "Time_End": 254.8,
      "Text": " Murphy's Law applies kind of across the board here, even though there's the preconceived"
    },
    {
      "Time_Start": 254.8,
      "Time_End": 259.56,
      "Text": " notion that if you're looking at a set of activity that has been attributed to a state"
    },
    {
      "Time_Start": 259.56,
      "Time_End": 263.92,
      "Text": " nexus actor, it's probably considered very sophisticated, but in reality there is a lot"
    },
    {
      "Time_Start": 263.92,
      "Time_End": 269.96000000000004,
      "Text": " more beneath the surface that is people scrambling to find solutions, people scrambling to meet"
    },
    {
      "Time_Start": 269.96000000000004,
      "Time_End": 271.88,
      "Text": " requirements, so on and so forth."
    },
    {
      "Time_Start": 271.88,
      "Time_End": 274.04,
      "Text": " And so that's what we want to address here today."
    },
    {
      "Time_Start": 274.04,
      "Time_End": 278.6,
      "Text": " And keep in mind, these actors, as sophisticated as they may be, at the end of the day what"
    },
    {
      "Time_Start": 278.6,
      "Time_End": 281.92,
      "Text": " they're trying to do is make sure that you don't catch them, or that even if you do catch"
    },
    {
      "Time_Start": 281.92,
      "Time_End": 285.28000000000003,
      "Text": " them, that you can't figure out who they are, and if you can figure out who they are, that"
    },
    {
      "Time_Start": 285.28000000000003,
      "Time_End": 287.36,
      "Text": " you can't do anything to really harm them."
    },
    {
      "Time_Start": 287.36,
      "Time_End": 291.76000000000005,
      "Text": " Unlike criminal actors whose main goal is likely profit, make money, and then everything"
    },
    {
      "Time_Start": 291.76000000000005,
      "Time_End": 295.68,
      "Text": " else is sort of secondary to that, these actors' goal is to not get caught, other than some"
    },
    {
      "Time_Start": 295.68,
      "Time_End": 299.04,
      "Text": " weird corner cases where they want to get caught, but excluding those for a second,"
    },
    {
      "Time_Start": 299.04,
      "Time_End": 302.84000000000003,
      "Text": " for the most part they're spending lots of time, energy, money, resources, and people"
    },
    {
      "Time_Start": 302.84000000000003,
      "Time_End": 307.36,
      "Text": " hours to make sure that none of you in this room can either emulate what they do or detect"
    },
    {
      "Time_Start": 307.40000000000003,
      "Time_End": 308.56,
      "Text": " them when they're doing it."
    },
    {
      "Time_Start": 308.56,
      "Time_End": 312.08000000000004,
      "Text": " So it's a very purposeful thing that they're trying to achieve, and because they're putting"
    },
    {
      "Time_Start": 312.08000000000004,
      "Time_End": 315.6,
      "Text": " that much energy and resourcing into doing that, they are often very effective at it,"
    },
    {
      "Time_Start": 315.6,
      "Time_End": 318.36,
      "Text": " and that drives a lot of the sort of analysis you end up doing on them."
    },
    {
      "Time_Start": 321.36,
      "Time_End": 325.56,
      "Text": " So the way we're going to do that is primarily by looking at fancy bear activity, with a"
    },
    {
      "Time_Start": 325.56,
      "Time_End": 329.24,
      "Text": " little bit of sandworm activity as well, and I'm going to mention this again in a few"
    },
    {
      "Time_Start": 329.24,
      "Time_End": 333.44,
      "Text": " minutes, but to really concretely bound where the information that we're going to be"
    },
    {
      "Time_Start": 333.44,
      "Time_End": 336.96000000000004,
      "Text": " talking about comes from, there were two indictments issued by the United States"
    },
    {
      "Time_Start": 336.96,
      "Time_End": 341.44,
      "Text": " government against officers of Russian military intelligence, the GRU, that were issued over"
    },
    {
      "Time_Start": 341.44,
      "Time_End": 342.64,
      "Text": " the last year."
    },
    {
      "Time_Start": 342.64,
      "Time_End": 348.28,
      "Text": " The first was issued in July of 2018, related to GRU activities aimed to interfere in the"
    },
    {
      "Time_Start": 348.28,
      "Time_End": 354.52,
      "Text": " 2016 U.S. presidential election, and there was an October 2018 indictment targeting GRU"
    },
    {
      "Time_Start": 354.52,
      "Time_End": 361.46,
      "Text": " officers allegedly involved in remote and close access operations targeting a variety"
    },
    {
      "Time_Start": 361.46,
      "Time_End": 366.67999999999995,
      "Text": " of organizations, specifically those related to anti-doping efforts in international sport"
    },
    {
      "Time_Start": 366.68,
      "Time_End": 371.8,
      "Text": " and chemical weapons analysis, and so we're going to be really focusing within the bounds"
    },
    {
      "Time_Start": 371.8,
      "Time_End": 376.64,
      "Text": " of those data sets on activity that can be linked to fancy bear."
    },
    {
      "Time_Start": 380.64,
      "Time_End": 381.76,
      "Text": " So why do we care, right?"
    },
    {
      "Time_Start": 381.76,
      "Time_End": 385.44,
      "Text": " So it's already been said, I think, no less than three times today that attribution is"
    },
    {
      "Time_Start": 385.44,
      "Time_End": 390.56,
      "Text": " important with an asterisk next to it, like it's important in general, but is it important"
    },
    {
      "Time_Start": 390.56,
      "Time_End": 394.56,
      "Text": " to you in your enterprise, at what level of attribution, or what level of attribution"
    },
    {
      "Time_Start": 394.56,
      "Time_End": 395.76,
      "Text": " is even relevant to you, right?"
    },
    {
      "Time_Start": 395.84,
      "Time_End": 400.12,
      "Text": " So what we're positing here is that there is value generically in attribution, knowing"
    },
    {
      "Time_Start": 400.12,
      "Time_End": 404.52,
      "Text": " who did a thing to you, or who's doing a thing out there in the wild, and that the more detail"
    },
    {
      "Time_Start": 404.52,
      "Time_End": 409.84,
      "Text": " you have about that attribution, the more better, excellent you can be in your day-to-day"
    },
    {
      "Time_Start": 409.84,
      "Time_End": 413.56,
      "Text": " activities, whether you're a blue team trying to detect those adversaries and what they're"
    },
    {
      "Time_Start": 413.56,
      "Time_End": 417.15999999999997,
      "Text": " doing, right, building a detection engineering regime that can detect the type of tactics,"
    },
    {
      "Time_Start": 417.15999999999997,
      "Time_End": 420.56,
      "Text": " tools, and techniques that those adversaries use, or if you're a red team, you're trying"
    },
    {
      "Time_Start": 420.56,
      "Time_End": 424.24,
      "Text": " to emulate the nature of how those adversaries behave so that you can better prepare your"
    },
    {
      "Time_Start": 424.24,
      "Time_End": 427.8,
      "Text": " enterprise for detecting them in the future were you to be targeted by them, or maybe"
    },
    {
      "Time_Start": 427.8,
      "Time_End": 434.32,
      "Text": " in some cases because you know you're being targeted by them through some particular means."
    },
    {
      "Time_Start": 434.32,
      "Time_End": 438.24,
      "Text": " So one of the big things that when Jason and I were coming up with this talk was that there's,"
    },
    {
      "Time_Start": 438.24,
      "Time_End": 442.40000000000003,
      "Text": " like I said, there's this common conception that if you're dealing with state nexus activity,"
    },
    {
      "Time_Start": 442.40000000000003,
      "Time_End": 447.0,
      "Text": " particularly from, you know, specific states, you're looking at something that's sophisticated"
    },
    {
      "Time_Start": 447.0,
      "Time_End": 452.36,
      "Text": " and well thought out and well organized, and so there's this spectrum of highly orderly"
    },
    {
      "Time_Start": 452.40000000000003,
      "Time_End": 457.68,
      "Text": " entities and highly more so chaotic entities. You know, on one end we have there's the GRU's"
    },
    {
      "Time_Start": 457.68,
      "Time_End": 462.44,
      "Text": " coat of arms, and on the other hand we have the best open source image that I could find"
    },
    {
      "Time_Start": 462.44,
      "Time_End": 468.6,
      "Text": " of somebody I thought represented that end of the spectrum. And you imagine hacktivists"
    },
    {
      "Time_Start": 468.6,
      "Time_End": 473.28000000000003,
      "Text": " and criminals are on one end for the most part, and state actors, particularly intelligence"
    },
    {
      "Time_Start": 473.28000000000003,
      "Time_End": 479.64,
      "Text": " services, are on the other, with the idea that there's more opportunistic, there's more"
    },
    {
      "Time_Start": 480.56,
      "Time_End": 484.36,
      "Text": " opportunism on one end, more planning on the other, more reactionary activity on one end,"
    },
    {
      "Time_Start": 484.36,
      "Time_End": 491.36,
      "Text": " more proactivity on the other. But in reality, things are really messy, and I intentionally"
    },
    {
      "Time_Start": 491.91999999999996,
      "Time_End": 498.62,
      "Text": " made this slide messy and not pretty to look at to reflect the fact that there really is"
    },
    {
      "Time_Start": 498.62,
      "Time_End": 503.12,
      "Text": " everybody's on all ends of the spectrum. For example, when I was at FireEye, they put out"
    },
    {
      "Time_Start": 503.12,
      "Time_End": 507.12,
      "Text": " a blog about FIN7, and it was noted in some of the tweets and stuff that came out around"
    },
    {
      "Time_Start": 507.12,
      "Time_End": 513.68,
      "Text": " that that FIN7 has its own JIRA instance for operations that they maintained meticulously."
    },
    {
      "Time_Start": 513.68,
      "Time_End": 518.52,
      "Text": " So there you have an e-crime actor definitely on the highly ordered end of the spectrum."
    },
    {
      "Time_Start": 518.52,
      "Time_End": 522.5600000000001,
      "Text": " On the highly chaotic end of the spectrum from StateNexus, Joe brought up earlier that"
    },
    {
      "Time_Start": 522.5600000000001,
      "Time_End": 529.5600000000001,
      "Text": " in Crash Override they made not one but two mistakes, kind of at the very end of the attack."
    },
    {
      "Time_Start": 529.84,
      "Time_End": 535.26,
      "Text": " So you can see that it's not, you can't fit these people into one end of a spectrum or"
    },
    {
      "Time_Start": 535.26,
      "Time_End": 540.22,
      "Text": " even in one box on a spectrum. It's, you have to be aware that with all of these actors"
    },
    {
      "Time_Start": 540.22,
      "Time_End": 544.8199999999999,
      "Text": " there's the potentiality for a variety of types of behavior and varying levels of chaotic"
    },
    {
      "Time_Start": 544.8199999999999,
      "Time_End": 548.58,
      "Text": " behavior within any given activity."
    },
    {
      "Time_Start": 548.58,
      "Time_End": 553.02,
      "Text": " And no, look, to be fair, like this is really hard to conceptualize because it's very fluid"
    },
    {
      "Time_Start": 553.02,
      "Time_End": 557.26,
      "Text": " and it's dynamic and it changes every second of every day for every actor. The previous"
    },
    {
      "Time_Start": 557.26,
      "Time_End": 561.14,
      "Text": " version of the slide was really nice and easy to understand. That mental framework that"
    },
    {
      "Time_Start": 561.14,
      "Time_End": 565.22,
      "Text": " we have, it's not that way, and it's not necessarily a bad thing, but it's important to remember"
    },
    {
      "Time_Start": 565.22,
      "Time_End": 570.7,
      "Text": " that that's not always necessarily the case. In particular, we find that we have organizational"
    },
    {
      "Time_Start": 570.7,
      "Time_End": 574.7,
      "Text": " frameworks that even help drive that particular methodology. So, for example, the Pyramid"
    },
    {
      "Time_Start": 574.7,
      "Time_End": 578.78,
      "Text": " of Pain is a good example of this, where you have levels of sophistication in what can"
    },
    {
      "Time_Start": 578.78,
      "Time_End": 581.6600000000001,
      "Text": " be detected, right? You start at the very bottom where it's very basic and you work"
    },
    {
      "Time_Start": 581.6600000000001,
      "Time_End": 585.62,
      "Text": " your way up in a very serial way to the very top of the pyramid where it's really sophisticated"
    },
    {
      "Time_Start": 585.62,
      "Time_End": 588.02,
      "Text": " and really hard to detect or hard to change."
    },
    {
      "Time_Start": 588.02,
      "Time_End": 591.46,
      "Text": " But that's a very formulaic and organized way to look at it, which makes sense in our"
    },
    {
      "Time_Start": 591.46,
      "Time_End": 595.12,
      "Text": " brains, but unfortunately doesn't really accurately represent the way the actors work. Instead,"
    },
    {
      "Time_Start": 595.12,
      "Time_End": 598.88,
      "Text": " they work a lot like this, where in some cases, one operation for a nation-state actor"
    },
    {
      "Time_Start": 598.88,
      "Time_End": 603.24,
      "Text": " might be all the way on the highly orderly side, but that same nation-state actor the"
    },
    {
      "Time_Start": 603.24,
      "Time_End": 607.0,
      "Text": " next day could be all the way on the highly chaotic side, but then most days of the week"
    },
    {
      "Time_Start": 607.0,
      "Time_End": 609.88,
      "Text": " they're sort of smack in the middle. They're running different operations with various"
    },
    {
      "Time_Start": 609.88,
      "Time_End": 615.92,
      "Text": " levels of complexity and chaos."
    },
    {
      "Time_Start": 615.92,
      "Time_End": 620.36,
      "Text": " So what are the implications of this common misperception? So the key to remember is that"
    },
    {
      "Time_Start": 620.36,
      "Time_End": 624.86,
      "Text": " the chaotic nature of what's going on in that particular country's leadership and strategic"
    },
    {
      "Time_Start": 624.86,
      "Time_End": 628.7,
      "Text": " level organizations impacts everybody. And the way to think about this is that chaos"
    },
    {
      "Time_Start": 628.7,
      "Time_End": 632.42,
      "Text": " is like water, right? For those of you that have a basement or live in a wet climate,"
    },
    {
      "Time_Start": 632.42,
      "Time_End": 635.5,
      "Text": " water that starts off at the top, right, coming from the sky, tends to find its way down to"
    },
    {
      "Time_Start": 635.5,
      "Time_End": 638.38,
      "Text": " your basement one way or the other, right? And your basement floods."
    },
    {
      "Time_Start": 638.38,
      "Time_End": 642.1800000000001,
      "Text": " Chaos is very much the same way. There's three levels where this operates. So one is the"
    },
    {
      "Time_Start": 642.1800000000001,
      "Time_End": 646.7,
      "Text": " strategic level, sort of the 100,000-foot level, where you have national-level leadership."
    },
    {
      "Time_Start": 646.7,
      "Time_End": 649.82,
      "Text": " The next level down is sort of operational, where you have people making decisions about"
    },
    {
      "Time_Start": 649.82,
      "Time_End": 653.1,
      "Text": " what operations we're doing and how we're doing them. And that bottom-most layer is"
    },
    {
      "Time_Start": 653.1,
      "Time_End": 656.82,
      "Text": " the tactical, the people actually on keyboard, walking around the compounds with a backpack,"
    },
    {
      "Time_Start": 656.82,
      "Time_End": 660.78,
      "Text": " wearing a disguise, doing stupid things, the people actually executing those operations."
    },
    {
      "Time_Start": 660.78,
      "Time_End": 664.58,
      "Text": " Those three levels get affected in a variety of different ways, depending on the nature"
    },
    {
      "Time_Start": 664.58,
      "Time_End": 669.22,
      "Text": " of that chaos and how much of it you see at the highest levels."
    },
    {
      "Time_Start": 669.22,
      "Time_End": 673.1800000000001,
      "Text": " So that water can manifest in a couple of different ways, and I'm going to talk about"
    },
    {
      "Time_Start": 673.1800000000001,
      "Time_End": 679.3000000000001,
      "Text": " four of them. And the big ones are strategic culture, organizational culture, and kind"
    },
    {
      "Time_Start": 679.3000000000001,
      "Time_End": 684.3000000000001,
      "Text": " of the competition between organizations, which is sort of an evolution of sorts of"
    },
    {
      "Time_Start": 684.3000000000001,
      "Time_End": 688.82,
      "Text": " strategic culture. Leadership demands, which can vary significantly in how they impact"
    },
    {
      "Time_Start": 688.82,
      "Time_End": 694.7,
      "Text": " operations from one type of government to another. And then finally, domestic politics,"
    },
    {
      "Time_Start": 694.7,
      "Time_End": 700.86,
      "Text": " which often influences all of the other ones as well. And what all of this water does is,"
    },
    {
      "Time_Start": 700.86,
      "Time_End": 706.1400000000001,
      "Text": " you know, this idea that, oh, you know, the intelligence agency X decides that they need"
    },
    {
      "Time_Start": 706.14,
      "Time_End": 710.9399999999999,
      "Text": " to compromise target A, so they go out and plan the operation and just get to do it."
    },
    {
      "Time_Start": 710.9399999999999,
      "Time_End": 716.06,
      "Text": " There's no simple conceive and execute plan when you're dealing with all of these different"
    },
    {
      "Time_Start": 716.06,
      "Time_End": 722.58,
      "Text": " variables affecting the way that you're trying to move forward."
    },
    {
      "Time_Start": 722.58,
      "Time_End": 726.62,
      "Text": " So as I touched on before, the information in the case study that we're doing here is"
    },
    {
      "Time_Start": 726.62,
      "Time_End": 731.34,
      "Text": " very much based in information from open sources from U.S. government indictments. So I'm going"
    },
    {
      "Time_Start": 731.34,
      "Time_End": 735.02,
      "Text": " to slow down here for a second, because if I don't, what we're all about to say doesn't"
    },
    {
      "Time_Start": 735.02,
      "Time_End": 739.78,
      "Text": " make any sense. So there's two units that have been indicted, two GRU units that have"
    },
    {
      "Time_Start": 739.78,
      "Time_End": 748.9,
      "Text": " been indicted by the U.S. government, 26165 and 74455. Activity that was described in"
    },
    {
      "Time_Start": 748.9,
      "Time_End": 758.14,
      "Text": " U.S. indictments in 2018, in July of 2018, links 26165 to activity that has been publicly"
    },
    {
      "Time_Start": 758.14,
      "Time_End": 765.74,
      "Text": " attributed in blogs and in press reporting to APT28, also known as Fancy Bear. So by"
    },
    {
      "Time_Start": 765.74,
      "Time_End": 772.46,
      "Text": " that causality, you can look at unit 26165 and then draw a dotted line to activity associated"
    },
    {
      "Time_Start": 772.46,
      "Time_End": 777.8199999999999,
      "Text": " with them in an indictment in October of 2018, targeting anti-doping organizations and chemical"
    },
    {
      "Time_Start": 777.8199999999999,
      "Time_End": 783.78,
      "Text": " weapon organizations, and say that there is a reasonable way to make an assumption that"
    },
    {
      "Time_Start": 783.86,
      "Time_End": 790.86,
      "Text": " there could be a link between the Fancy Bear activity and unit 26165 in that context. In"
    },
    {
      "Time_Start": 790.86,
      "Time_End": 800.4599999999999,
      "Text": " the same extent, unit 74455 was charged in the July 2018 indictment as related to certain"
    },
    {
      "Time_Start": 800.4599999999999,
      "Time_End": 807.14,
      "Text": " influence aspects and other activities related to election interference in 2016. They were"
    },
    {
      "Time_Start": 807.14,
      "Time_End": 813.66,
      "Text": " also cited as being involved in certain influence activities related to targeting of anti-doping"
    },
    {
      "Time_Start": 813.66,
      "Time_End": 819.3399999999999,
      "Text": " organizations in the October 2018 indictment. Now, that's all on the one side. On the other"
    },
    {
      "Time_Start": 819.3399999999999,
      "Time_End": 825.74,
      "Text": " side, you have press reporting in the U.S. that linked unit 74455 to NotPetya, which has been"
    },
    {
      "Time_Start": 825.74,
      "Time_End": 832.3,
      "Text": " attributed basically by all and sundry to Sandworm. So from there, we can draw a dotted line"
    },
    {
      "Time_Start": 832.3,
      "Time_End": 838.86,
      "Text": " link for the purposes of this discussion to unit 74455. And for the same reason that Jason"
    },
    {
      "Time_Start": 838.86,
      "Time_End": 843.5,
      "Text": " read the original disclaimer word for word, I will read this word for word. Proceeding on"
    },
    {
      "Time_Start": 843.5,
      "Time_End": 847.54,
      "Text": " these explicit assumptions for the purposes of this talk, we'll operate under the premise that"
    },
    {
      "Time_Start": 847.54,
      "Time_End": 854.02,
      "Text": " discussed unit 26165 activity represents at least some segment of Fancy Bear activity, and"
    },
    {
      "Time_Start": 854.02,
      "Time_End": 859.62,
      "Text": " that discussed unit 74455 activity represents at least some segment of Sandworm activity."
    },
    {
      "Time_Start": 859.62,
      "Time_End": 869.02,
      "Text": " Everyone got that? Cool? Welcome to my thesis. So getting back into how that water"
    },
    {
      "Time_Start": 869.02,
      "Time_End": 873.02,
      "Text": " manifests, what those chaotic dynamics manifest as, we'll start with strategic culture. This is"
    },
    {
      "Time_Start": 873.02,
      "Time_End": 878.54,
      "Text": " about as high up in influence as you can get. For a very simple version, Americans are known for"
    },
    {
      "Time_Start": 878.54,
      "Time_End": 885.5,
      "Text": " being very loud. In this case, studies of Russian intelligence operations throughout the ages"
    },
    {
      "Time_Start": 885.5,
      "Time_End": 890.3,
      "Text": " have given a picture of a specific culture that permeates the way that they conduct operations"
    },
    {
      "Time_Start": 890.3,
      "Time_End": 897.18,
      "Text": " that was termed by a former CIA official as the clandestine mentality. It's this idea dating all"
    },
    {
      "Time_Start": 897.18,
      "Time_End": 902.86,
      "Text": " the way back to the Bolshevik period that someone is out there to get me. The only way that I can"
    },
    {
      "Time_Start": 902.86,
      "Time_End": 909.02,
      "Text": " stop them is by engaging in secret counteraction. Therefore, I must always be engaging in action,"
    },
    {
      "Time_Start": 909.02,
      "Time_End": 914.54,
      "Text": " and I must always be on my toes, and must be emphasizing clandestinity in everything that I do,"
    },
    {
      "Time_Start": 914.54,
      "Time_End": 918.7,
      "Text": " which goes back to Jason's point that when typically in any intelligence service,"
    },
    {
      "Time_Start": 918.7,
      "Time_End": 923.9,
      "Text": " clandestinity is a major part of how they're operating. But here it goes to another level,"
    },
    {
      "Time_Start": 923.9,
      "Time_End": 928.46,
      "Text": " and that it is a pervasive element of the cultural approach to dealing with threats."
    },
    {
      "Time_Start": 929.26,
      "Time_End": 934.7,
      "Text": " This manifests a little bit more clearly in organizational cultures, where you then have"
    },
    {
      "Time_Start": 934.7,
      "Time_End": 939.58,
      "Text": " the traditions of specific organizations, the histories of specific organizations,"
    },
    {
      "Time_Start": 939.58,
      "Time_End": 943.6600000000001,
      "Text": " impacting and mingling with that strategic culture to form an organizational culture."
    },
    {
      "Time_Start": 944.46,
      "Time_End": 949.4200000000001,
      "Text": " In this case, the researcher Mark Gagliotti has talked about something called the wartime mindset"
    },
    {
      "Time_Start": 949.4200000000001,
      "Time_End": 954.86,
      "Text": " that he's described as evident in the Russian intelligence community since 2011. This mindset"
    },
    {
      "Time_Start": 955.58,
      "Time_End": 961.98,
      "Text": " consists of three major prongs. First is that Russia is at some sort of existential,"
    },
    {
      "Time_Start": 961.98,
      "Time_End": 967.02,
      "Text": " traditionally political and ideological existential risk, that that risk emanates"
    },
    {
      "Time_Start": 967.02,
      "Time_End": 971.42,
      "Text": " from the West, forcing Russia into a zero-sum competition with the West,"
    },
    {
      "Time_Start": 971.42,
      "Time_End": 976.78,
      "Text": " and that therefore action is always preferable over inaction to avoid loss of an advantage."
    },
    {
      "Time_Start": 976.78,
      "Time_End": 982.3000000000001,
      "Text": " In the case of Unit 26165, you can actually see some of this in their unit motto, which is"
    },
    {
      "Time_Start": 982.3000000000001,
      "Time_End": 989.5000000000001,
      "Text": " there is always a solution. And with that impetus for action, that impetus for activity,"
    },
    {
      "Time_Start": 989.5000000000001,
      "Time_End": 993.82,
      "Text": " you're also dealing with competition dynamics between organizations within intelligence"
    },
    {
      "Time_Start": 993.82,
      "Time_End": 1002.0600000000001,
      "Text": " communities. There is a rich, very volatile history of competition between Russian intelligence"
    },
    {
      "Time_Start": 1002.0600000000001,
      "Time_End": 1006.7,
      "Text": " entities, particularly between the Federal Security Service, the FSB, and the GRU,"
    },
    {
      "Time_Start": 1006.7,
      "Time_End": 1012.22,
      "Text": " known for burning each other's operations, outing each other's officers, stealing information from"
    },
    {
      "Time_Start": 1012.22,
      "Time_End": 1018.5400000000001,
      "Text": " each other. It can get very, very, very aggressive. Now look, I mean, Alex says this. Anytime he says"
    },
    {
      "Time_Start": 1018.5400000000001,
      "Time_End": 1022.46,
      "Text": " it and anytime a researcher talks about this competition between Russian intelligence services,"
    },
    {
      "Time_Start": 1022.46,
      "Time_End": 1025.58,
      "Text": " someone always wants to raise their hand and say, yeah, yeah, yeah, but the US has that too, right?"
    },
    {
      "Time_Start": 1025.58,
      "Time_End": 1029.5,
      "Text": " There's US intelligence services and they're competing and there's constricted resources"
    },
    {
      "Time_Start": 1029.5,
      "Time_End": 1032.78,
      "Text": " and all that sort of jazz. And the reality, of course, is that's true, right? There's always"
    },
    {
      "Time_Start": 1032.78,
      "Time_End": 1037.34,
      "Text": " competition between a nation-state's intelligence services and how they function with each other."
    },
    {
      "Time_Start": 1037.34,
      "Time_End": 1041.42,
      "Text": " The difference, though, is that, at least from the United States perspective, that competition"
    },
    {
      "Time_Start": 1041.42,
      "Time_End": 1046.78,
      "Text": " occurs in a highly organized legal framework where it involves mostly lawyers and as much"
    },
    {
      "Time_Start": 1046.78,
      "Time_End": 1050.54,
      "Text": " as the individual operators and people involved want to flame each other and destroy each other,"
    },
    {
      "Time_Start": 1050.54,
      "Time_End": 1053.9,
      "Text": " at the end of the day, we're all on the same side. We're all working towards the same objectives"
    },
    {
      "Time_Start": 1053.9,
      "Time_End": 1058.3000000000002,
      "Text": " and we're all working together to achieve a common aim. That same sort of feeling, right,"
    },
    {
      "Time_Start": 1058.3000000000002,
      "Time_End": 1061.66,
      "Text": " that universal we're all out to do, that we're all in this together, one team, one fight,"
    },
    {
      "Time_Start": 1061.66,
      "Time_End": 1064.6200000000001,
      "Text": " is not pervasive if it exists at all within the Russian services."
    },
    {
      "Time_Start": 1065.5800000000002,
      "Time_End": 1073.5800000000002,
      "Text": " So, I talked earlier about leadership demands. This is something that can be, it's a variable"
    },
    {
      "Time_Start": 1073.5800000000002,
      "Time_End": 1077.5800000000002,
      "Text": " that also depends on the type of government that a specific intelligence service is responding to."
    },
    {
      "Time_Start": 1078.46,
      "Time_End": 1082.94,
      "Text": " In the US, for example, like Jason said, command authority goes through a lot of layers of structure"
    },
    {
      "Time_Start": 1082.94,
      "Time_End": 1088.0600000000002,
      "Text": " and legality and process before it reaches down to operational and tactical levels. While in a"
    },
    {
      "Time_Start": 1088.94,
      "Time_End": 1094.3,
      "Text": " place like Russia, you have power deeply concentrated in individuals as opposed to"
    },
    {
      "Time_Start": 1094.3,
      "Time_End": 1098.86,
      "Text": " in offices or in institutions. So, you have leadership demands that can manifest more"
    },
    {
      "Time_Start": 1098.86,
      "Time_End": 1105.6599999999999,
      "Text": " directly in operational activities. A good example in my view is the fact that you can look at a lot"
    },
    {
      "Time_Start": 1105.6599999999999,
      "Time_End": 1111.4199999999998,
      "Text": " of Russian cyber activity and see an element of Praetorianism in it. In this context, Praetorianism"
    },
    {
      "Time_Start": 1112.38,
      "Time_End": 1118.3000000000002,
      "Text": " refers to the idea that Putin has engaged in a series of demonstrable behaviors that aim to"
    },
    {
      "Time_Start": 1118.3000000000002,
      "Time_End": 1125.02,
      "Text": " delegitimize the ideas of democracy in Western political institutions as valid compared to the"
    },
    {
      "Time_Start": 1125.02,
      "Time_End": 1129.98,
      "Text": " political institutions that he has instituted in Russia. So, the idea is to delegitimize those"
    },
    {
      "Time_Start": 1129.98,
      "Time_End": 1135.02,
      "Text": " in the eyes particularly of a domestic audience in an effort to legitimize his own activities"
    },
    {
      "Time_Start": 1135.02,
      "Time_End": 1139.1000000000001,
      "Text": " and behaviors. There's a contrast here, of course, with the way this happens in the US."
    },
    {
      "Time_Start": 1139.18,
      "Time_End": 1142.3000000000002,
      "Text": " There's a contrast here, of course, with the way this happens in the United States. Again,"
    },
    {
      "Time_Start": 1142.3000000000002,
      "Time_End": 1145.66,
      "Text": " to be fair, we don't want to pick on the Russians and say they do it and they're bad at it because"
    },
    {
      "Time_Start": 1145.66,
      "Time_End": 1149.8200000000002,
      "Text": " the Americans have a version of this as well. But again, the difference is it's a legal and"
    },
    {
      "Time_Start": 1149.8200000000002,
      "Time_End": 1153.66,
      "Text": " organized sort of way. We have a thing called the National Intelligence Priorities Framework,"
    },
    {
      "Time_Start": 1153.66,
      "Time_End": 1157.9,
      "Text": " the most boring administrative term you ever have, the NIPIF. The NIPIF is something that"
    },
    {
      "Time_Start": 1157.9,
      "Time_End": 1162.38,
      "Text": " the President and the National Security Council and the most senior levels of US national security"
    },
    {
      "Time_Start": 1162.38,
      "Time_End": 1167.18,
      "Text": " and foreign policy put together to say, what are the things we care about from a policy perspective"
    },
    {
      "Time_Start": 1167.18,
      "Time_End": 1171.98,
      "Text": " and we want more information on. So, when the President or the NSC says, I really care about"
    },
    {
      "Time_Start": 1171.98,
      "Time_End": 1177.18,
      "Text": " Peru and I care about Peru's economy. Well, someone then at the next level down says,"
    },
    {
      "Time_Start": 1177.18,
      "Time_End": 1181.26,
      "Text": " well, Peru's economy is based upon grain production and grain export. So, then as that"
    },
    {
      "Time_Start": 1181.26,
      "Time_End": 1186.46,
      "Text": " works its way down, what you end up with is that tactical operations executed by the US military,"
    },
    {
      "Time_Start": 1186.46,
      "Time_End": 1192.0600000000002,
      "Text": " the US intelligence community and other elements at the very like on the ground level, you can draw"
    },
    {
      "Time_Start": 1192.0600000000002,
      "Time_End": 1196.22,
      "Text": " dotted lines from those operations all the way up to the most senior levels of the government"
    },
    {
      "Time_Start": 1196.22,
      "Time_End": 1199.82,
      "Text": " because that NIPIF framework is what allows those lower levels to answer the questions that"
    },
    {
      "Time_Start": 1199.82,
      "Time_End": 1204.46,
      "Text": " the senior levels set out, right? Think about that in contrast to what Alex just explained here,"
    },
    {
      "Time_Start": 1204.46,
      "Time_End": 1207.74,
      "Text": " where its powers just concentrated entirely at the top and everyone's just trying to please"
    },
    {
      "Time_Start": 1207.74,
      "Time_End": 1209.5,
      "Text": " the master, right? Like that she but you knew there."
    },
    {
      "Time_Start": 1214.78,
      "Time_End": 1219.1000000000001,
      "Text": " So, and then this is where domestic politics comes in. This is something that is more pervasive and"
    },
    {
      "Time_Start": 1219.1000000000001,
      "Time_End": 1223.9,
      "Text": " kind of more predictable than just related to leadership structures because every country"
    },
    {
      "Time_Start": 1223.9,
      "Time_End": 1229.18,
      "Text": " is going to have domestic politics no matter how liberal or conservative, for lack of a better"
    },
    {
      "Time_Start": 1229.18,
      "Time_End": 1234.7,
      "Text": " term, their government structures actually are. The case that we're looking at particularly,"
    },
    {
      "Time_Start": 1234.7,
      "Time_End": 1240.14,
      "Text": " I want to talk about the emphasis on targeting of anti-doping organizations. So, over the last"
    },
    {
      "Time_Start": 1240.14,
      "Time_End": 1248.0600000000002,
      "Text": " several years leading up to the Rio 2016 Olympics, there were a number of exposés and reports by"
    },
    {
      "Time_Start": 1248.0600000000002,
      "Time_End": 1252.7,
      "Text": " international sports administrative bodies that basically outed systematic Russian doping efforts"
    },
    {
      "Time_Start": 1253.42,
      "Time_End": 1259.1000000000001,
      "Text": " at major international sporting events. That's a loss of international prestige. It is not a loss"
    },
    {
      "Time_Start": 1259.1000000000001,
      "Time_End": 1264.78,
      "Text": " of international power. You're not losing control of territory or military assets. Nobody's getting"
    },
    {
      "Time_Start": 1264.78,
      "Time_End": 1271.1000000000001,
      "Text": " invaded. Your economy isn't being targeted, but your pride hurts and that can cause domestic"
    },
    {
      "Time_Start": 1271.1000000000001,
      "Time_End": 1277.1000000000001,
      "Text": " political costs. So, your national pride prestige can drive things which we like to call vanity"
    },
    {
      "Time_Start": 1277.1000000000001,
      "Time_End": 1281.5800000000002,
      "Text": " operations. You're engaging in operations specifically in order to recover some sense"
    },
    {
      "Time_Start": 1281.58,
      "Time_End": 1285.58,
      "Text": " of pride and prestige because you're feeling vain about the fact that you got caught doing"
    },
    {
      "Time_Start": 1285.58,
      "Time_End": 1290.78,
      "Text": " something wrong or that somebody outed something else you did. There's no other real edge to it."
    },
    {
      "Time_Start": 1293.74,
      "Time_End": 1298.62,
      "Text": " Does anybody have a toddler at home? Because it's a lot like that, right? Like when you catch your"
    },
    {
      "Time_Start": 1298.62,
      "Time_End": 1302.9399999999998,
      "Text": " young child doing something wrong and they get upset about that, right, they tend to do something"
    },
    {
      "Time_Start": 1302.9399999999998,
      "Time_End": 1306.06,
      "Text": " else to either make up for it or actually make it much worse for themselves, which it's really hard"
    },
    {
      "Time_Start": 1306.06,
      "Time_End": 1309.1,
      "Text": " to convince them that they shouldn't do that. But it's the same sort of thing going on here,"
    },
    {
      "Time_Start": 1309.18,
      "Time_End": 1315.9,
      "Text": " it's a fascinating process. And it exists in both contexts. So, for example, in these operations"
    },
    {
      "Time_Start": 1315.9,
      "Time_End": 1322.38,
      "Text": " that Unit 26165 engaged in where they deployed close access teams to compromise networks of"
    },
    {
      "Time_Start": 1322.38,
      "Time_End": 1329.0200000000002,
      "Text": " multiple international anti-doping organizations, those materials were then exploited in influence"
    },
    {
      "Time_Start": 1329.0200000000002,
      "Time_End": 1334.38,
      "Text": " operations that tried to portray a general victimization narrative of Russia. Russia has"
    },
    {
      "Time_Start": 1334.38,
      "Time_End": 1341.5800000000002,
      "Text": " been victimized because they are persecuted for their superiority or that the West can't fairly"
    },
    {
      "Time_Start": 1341.5800000000002,
      "Time_End": 1347.0200000000002,
      "Text": " compete or that it's all political machinations at play and all the evidence is doctored. And you"
    },
    {
      "Time_Start": 1347.0200000000002,
      "Time_End": 1353.0200000000002,
      "Text": " can see in the indictment that actually lays out parallels between influence outlets operated by"
    },
    {
      "Time_Start": 1353.0200000000002,
      "Time_End": 1359.98,
      "Text": " Unit 74455 mirroring almost exactly the talking points of senior government Russian officials"
    },
    {
      "Time_Start": 1359.98,
      "Time_End": 1364.78,
      "Text": " in a relatively close time frame. And let's just talk about those close access operations for one"
    },
    {
      "Time_Start": 1364.78,
      "Time_End": 1368.94,
      "Text": " second, right? So, these are operations where intelligence officers are going overseas,"
    },
    {
      "Time_Start": 1368.94,
      "Time_End": 1372.6200000000001,
      "Text": " right, likely under some sort of cover with documentation to prove they are who they say"
    },
    {
      "Time_Start": 1372.6200000000001,
      "Time_End": 1376.54,
      "Text": " they are when they're actually not that person, right? So, they go overseas undercover with"
    },
    {
      "Time_Start": 1376.54,
      "Time_End": 1380.78,
      "Text": " documentation, they have technical gear that they use to execute these operations, right? They have"
    },
    {
      "Time_Start": 1380.78,
      "Time_End": 1385.26,
      "Text": " Wi-Fi gear, they have all sorts of interesting gizmos and gadgets like out of Inspector Gadget"
    },
    {
      "Time_Start": 1385.26,
      "Time_End": 1389.18,
      "Text": " or James Bond, all this sort of stuff squirreled away in their backpacks and hidden in secret"
    },
    {
      "Time_Start": 1389.18,
      "Time_End": 1393.1000000000001,
      "Text": " compartments. They have specially designed cars that they use to do this stuff, they have all"
    },
    {
      "Time_Start": 1393.1000000000001,
      "Time_End": 1397.02,
      "Text": " these tactics they use to avoid detection while they're walking around the city. All these things"
    },
    {
      "Time_Start": 1397.02,
      "Time_End": 1402.46,
      "Text": " happen when they get caught, it has a massive cost on the actor that just got caught, right? All this"
    },
    {
      "Time_Start": 1402.46,
      "Time_End": 1407.26,
      "Text": " stuff that they used is now exposed, they can't use it anymore, develop new tactics, people can't"
    },
    {
      "Time_Start": 1407.26,
      "Time_End": 1412.22,
      "Text": " travel, documents get burned, aliases get burned, all this bad stuff happens. And to do all of that"
    },
    {
      "Time_Start": 1412.22,
      "Time_End": 1416.6200000000001,
      "Text": " and risk all of that, Ford is essentially a vanity operation, seems utterly insane."
    },
    {
      "Time_Start": 1417.0200000000002,
      "Time_End": 1422.6200000000001,
      "Text": " And again, we don't want to just talk about only Russia, there's a recent US example of this as"
    },
    {
      "Time_Start": 1422.6200000000001,
      "Time_End": 1428.5400000000002,
      "Text": " well. Back in November of 2018, there was a discussion about how US Cybercom conducted an"
    },
    {
      "Time_Start": 1428.5400000000002,
      "Time_End": 1434.7800000000002,
      "Text": " offensive operation, it was described in the press and also by US government officials targeting the"
    },
    {
      "Time_Start": 1435.5000000000002,
      "Time_End": 1441.66,
      "Text": " Internet Research Association. Agency. Agency, yes. I always confuse the two IRAs."
    },
    {
      "Time_Start": 1441.98,
      "Time_End": 1447.02,
      "Text": " Where it became an issue where they were describing that they had disrupted the IRA"
    },
    {
      "Time_Start": 1447.02,
      "Time_End": 1451.9,
      "Text": " in engaging in what could have potentially been actions to influence the outcome of the US"
    },
    {
      "Time_Start": 1451.9,
      "Time_End": 1457.74,
      "Text": " elections in 2018. To a lot of people in the general public, this seemed like a big win. Oh,"
    },
    {
      "Time_Start": 1457.74,
      "Time_End": 1462.5400000000002,
      "Text": " the US is doing something against Russia, especially in our domestic political environment,"
    },
    {
      "Time_Start": 1462.5400000000002,
      "Time_End": 1466.6200000000001,
      "Text": " being able to, for the White House to be seen taking a hard stance against Russia is a politically"
    },
    {
      "Time_Start": 1466.6200000000001,
      "Time_End": 1474.7800000000002,
      "Text": " valuable point. But if you went one level down to security commentators, technology commentators,"
    },
    {
      "Time_Start": 1474.7800000000002,
      "Time_End": 1479.0200000000002,
      "Text": " from what was described, it sounded like maybe they turned off a LAN for a couple of hours."
    },
    {
      "Time_Start": 1480.38,
      "Time_End": 1485.1000000000001,
      "Text": " And that's not a real effect in terms of the long scheme of things when you're conducting"
    },
    {
      "Time_Start": 1485.1000000000001,
      "Time_End": 1489.42,
      "Text": " nation state influence operations. If you have an outlet like the Internet Research Agency,"
    },
    {
      "Time_Start": 1489.42,
      "Time_End": 1493.5000000000002,
      "Text": " its main job is to build up narratives over a very long period of time,"
    },
    {
      "Time_Start": 1494.06,
      "Time_End": 1498.78,
      "Text": " insert those narratives into foreign political discourse, and then watch them create fractures"
    },
    {
      "Time_Start": 1498.78,
      "Time_End": 1506.7,
      "Text": " and fissures. How is turning off their LAN at the end of what would be their operational cycle"
    },
    {
      "Time_Start": 1506.7,
      "Time_End": 1511.1,
      "Text": " at all going to really impact something beyond scoring you domestic political points when it"
    },
    {
      "Time_Start": 1511.1,
      "Time_End": 1518.46,
      "Text": " reaches the press? This can manifest in a lot of different ways. It's not just one way or the other,"
    },
    {
      "Time_Start": 1518.46,
      "Time_End": 1521.98,
      "Text": " and it can even manifest at lower levels. National pride and prestige is one thing."
    },
    {
      "Time_Start": 1522.7,
      "Time_End": 1525.98,
      "Text": " Being able to demonstrate taking other kinds of political stances is another."
    },
    {
      "Time_Start": 1530.7,
      "Time_End": 1535.58,
      "Text": " So the actual genesis for this talk is this hang-on-tight thinking or methodology."
    },
    {
      "Time_Start": 1535.58,
      "Time_End": 1538.7,
      "Text": " And there was something that happened a couple months back, and Alex and I were talking about"
    },
    {
      "Time_Start": 1538.7,
      "Time_End": 1543.26,
      "Text": " how crazy this thing was, and we started talking about this concept that the lower level officers,"
    },
    {
      "Time_Start": 1543.26,
      "Time_End": 1546.94,
      "Text": " the ones on the ground executing, the guys in the close access operations running around with the"
    },
    {
      "Time_Start": 1546.94,
      "Time_End": 1551.42,
      "Text": " backpack, they have this sense of hang-on-tight thinking because they're on a train that is"
    },
    {
      "Time_Start": 1551.42,
      "Time_End": 1557.02,
      "Text": " barely on the track. It is barreling down a track going very, very fast, extremely wobbly,"
    },
    {
      "Time_Start": 1557.02,
      "Time_End": 1560.38,
      "Text": " possibly going to go off the track at any minute, but they're just trying to hold on"
    },
    {
      "Time_Start": 1560.38,
      "Time_End": 1563.18,
      "Text": " while still doing their jobs because they have to do the things they're told to do."
    },
    {
      "Time_Start": 1563.18,
      "Time_End": 1567.1000000000001,
      "Text": " Go execute the operations, get on keyboard, do the thing. They have to execute their job,"
    },
    {
      "Time_Start": 1567.1000000000001,
      "Time_End": 1571.8200000000002,
      "Text": " but they have to have this sense of what is actually happening and how does this influence"
    },
    {
      "Time_Start": 1571.8200000000002,
      "Time_End": 1575.9,
      "Text": " what I'm doing? And it influences it in a couple of ways. It influences it in the planning and"
    },
    {
      "Time_Start": 1575.9,
      "Time_End": 1579.66,
      "Text": " the timing of the plans that you're going to execute. Do you spend the amount of time you"
    },
    {
      "Time_Start": 1579.66,
      "Time_End": 1583.26,
      "Text": " really want to planning to the right extent the operations that you're going to run where"
    },
    {
      "Time_Start": 1583.26,
      "Time_End": 1587.3400000000001,
      "Text": " you don't want to get caught, where the calculus is really high? Do you spend the amount of time"
    },
    {
      "Time_Start": 1587.3400000000001,
      "Time_End": 1591.42,
      "Text": " you really want to in the execution of that operation to really make sure all the T's are"
    },
    {
      "Time_Start": 1591.42,
      "Time_End": 1595.1000000000001,
      "Text": " crossed, all the I's are dotted, all the things are done the right way to make sure that it goes"
    },
    {
      "Time_Start": 1595.1000000000001,
      "Time_End": 1599.66,
      "Text": " well and you don't get caught? In any of the post-op or follow-on activity, yes, it's done,"
    },
    {
      "Time_Start": 1599.66,
      "Time_End": 1603.66,
      "Text": " great, check the box, but that's it, right? Just move on to the next thing because we have so many"
    },
    {
      "Time_Start": 1603.66,
      "Time_End": 1607.5800000000002,
      "Text": " other things stacked up to do next. And then finally, in the aftermath of a compromise,"
    },
    {
      "Time_Start": 1607.58,
      "Time_End": 1611.5,
      "Text": " if you fail and you get caught and then potentially attributed, how do you respond to"
    },
    {
      "Time_Start": 1611.5,
      "Time_End": 1616.06,
      "Text": " that when you have this hang-on type thinking where I just got to do anything I can do to get"
    },
    {
      "Time_Start": 1616.06,
      "Time_End": 1620.3799999999999,
      "Text": " from one day to the next because everything above me is pure chaos, right? And I don't really know"
    },
    {
      "Time_Start": 1620.3799999999999,
      "Time_End": 1624.6999999999998,
      "Text": " what to do other than just keep doing my job to the best level that I can without getting myself"
    },
    {
      "Time_Start": 1624.6999999999998,
      "Time_End": 1630.1399999999999,
      "Text": " fired or in some cases killed. This impacts a lot of different things including operational"
    },
    {
      "Time_Start": 1630.1399999999999,
      "Time_End": 1635.74,
      "Text": " decisions. And a good example of this is where the operations manager goes into the room with"
    },
    {
      "Time_Start": 1635.74,
      "Time_End": 1639.5,
      "Text": " the management and says, I want to do this operation. I'm going to use a particular tool,"
    },
    {
      "Time_Start": 1640.7,
      "Time_End": 1645.42,
      "Text": " drunk koala. I want to deploy the drunk koala implant on this particular target. That's"
    },
    {
      "Time_Start": 1645.42,
      "Time_End": 1649.26,
      "Text": " fantastic, right? But then the management looks at that and says, well, we don't really want you"
    },
    {
      "Time_Start": 1649.26,
      "Time_End": 1654.14,
      "Text": " to do that. We want you to deploy a super short giraffe instead, right? But that's not the right"
    },
    {
      "Time_Start": 1654.14,
      "Time_End": 1658.22,
      "Text": " tool for the operation, but there's some political, some thing going on at some higher level that the"
    },
    {
      "Time_Start": 1658.22,
      "Time_End": 1662.54,
      "Text": " operator doesn't know about that impacts the way this decision gets made. And instead of using the"
    },
    {
      "Time_Start": 1662.54,
      "Time_End": 1666.3,
      "Text": " tool that's right for the operation, they end up being forced to use a tool that's not right for"
    },
    {
      "Time_Start": 1666.3,
      "Time_End": 1671.42,
      "Text": " the operation. This is a common outplay of what happens when you have that sort of chaos at those"
    },
    {
      "Time_Start": 1671.42,
      "Time_End": 1676.06,
      "Text": " higher levels. That chaos filters all its way down to the level at which I'm choosing what tools I"
    },
    {
      "Time_Start": 1676.06,
      "Time_End": 1682.62,
      "Text": " want to use in my particular operation. So now that we've laid out this whole structure of how"
    },
    {
      "Time_Start": 1682.62,
      "Time_End": 1687.26,
      "Text": " this chaos exists and what it can look like, let's talk about how it actually has manifested in our"
    },
    {
      "Time_Start": 1687.26,
      "Time_End": 1693.1,
      "Text": " case studies. So we have three here. The first, and I'll just go chronologically, we have the"
    },
    {
      "Time_Start": 1693.1,
      "Time_End": 1699.18,
      "Text": " Russian interference in the 2016 election. So this is the July 2018 indictment. This described"
    },
    {
      "Time_Start": 1699.18,
      "Time_End": 1707.1,
      "Text": " Unit 26165 as engaging in a sustained, very long, very persistent campaign to gain remote access to"
    },
    {
      "Time_Start": 1707.1,
      "Time_End": 1713.26,
      "Text": " a number of US political institutions and then distribute the materials stolen from that for"
    },
    {
      "Time_Start": 1713.26,
      "Time_End": 1718.86,
      "Text": " influence purposes. The biggest thing you see here is the targets, like the Democratic National"
    },
    {
      "Time_Start": 1718.86,
      "Time_End": 1726.3799999999999,
      "Text": " Committee, the Democratic Congressional Campaign Committee, all of these things are high value"
    },
    {
      "Time_Start": 1726.3799999999999,
      "Time_End": 1731.9,
      "Text": " targets from an intelligence services perspective. If you get caught there, it's a big deal."
    },
    {
      "Time_Start": 1732.94,
      "Time_End": 1740.3,
      "Text": " And so you had Fancy Bear, this is what the 26165 activity is really connected to per the indictment,"
    },
    {
      "Time_Start": 1740.3,
      "Time_End": 1745.82,
      "Text": " present in the DNC's networks for a big portion of 2016. But at the same time, it later came out"
    },
    {
      "Time_Start": 1745.82,
      "Time_End": 1751.58,
      "Text": " that there was a second bear in the DNC's networks, Cozy Bear, also referred to as APT29."
    },
    {
      "Time_Start": 1752.46,
      "Time_End": 1758.7,
      "Text": " Now you would assume where you have the potential loss of clandestinity, the potential loss of tools,"
    },
    {
      "Time_Start": 1758.7,
      "Time_End": 1764.06,
      "Text": " the potential for attribution, the potential for loss of mission success, that there would be a"
    },
    {
      "Time_Start": 1764.06,
      "Time_End": 1770.7,
      "Text": " detailed, thorough structure to de-conflict operations in order to meet the goal associated"
    },
    {
      "Time_Start": 1770.7,
      "Time_End": 1776.7,
      "Text": " with sending a team to target those entities in the first place. Clearly, that didn't exist"
    },
    {
      "Time_Start": 1776.7,
      "Time_End": 1783.58,
      "Text": " because, as was also covered in press reporting and in blogs and all over Twitter, once Fancy Bear"
    },
    {
      "Time_Start": 1783.58,
      "Time_End": 1788.22,
      "Text": " got kicked out, Cozy Bear got kicked out too, and they had been there for longer. So it was"
    },
    {
      "Time_Start": 1788.22,
      "Time_End": 1793.34,
      "Text": " another operational dividend cost where potentially multiple intelligence services were losing"
    },
    {
      "Time_Start": 1793.3400000000001,
      "Time_End": 1799.0200000000002,
      "Text": " operations because they weren't de-conflicting. And that de-confliction is something that you see"
    },
    {
      "Time_Start": 1799.9800000000002,
      "Time_End": 1804.8600000000001,
      "Text": " formalized in a lot of other services, in a lot of other communities, and its absence here signals"
    },
    {
      "Time_Start": 1804.8600000000001,
      "Time_End": 1810.3000000000002,
      "Text": " that there must have clearly been some sort of impetus to cause two separate actor groups to"
    },
    {
      "Time_Start": 1810.3000000000002,
      "Time_End": 1815.8200000000002,
      "Text": " target the same entities in the same period of time while ignoring, essentially, the potential risks"
    },
    {
      "Time_Start": 1815.82,
      "Time_End": 1823.74,
      "Text": " involved. Then we go on to the GRU hacking to undermine anti-doping efforts. This ties back"
    },
    {
      "Time_Start": 1823.74,
      "Time_End": 1829.34,
      "Text": " into the discussion of vanity operations, domestic politics, and the really risks of close access"
    },
    {
      "Time_Start": 1829.34,
      "Time_End": 1836.22,
      "Text": " operations. There were numerous close access operations described in detail, and as somebody"
    },
    {
      "Time_Start": 1836.22,
      "Time_End": 1841.74,
      "Text": " who has studied this kind of activity for a long time, it was stunning for me to read an indictment"
    },
    {
      "Time_Start": 1841.74,
      "Time_End": 1847.5,
      "Text": " that laid out close access operations so thoroughly. I don't know the sources that"
    },
    {
      "Time_Start": 1847.5,
      "Time_End": 1851.66,
      "Text": " were able to procure in that indictment, but clearly those operations had been very thoroughly"
    },
    {
      "Time_Start": 1851.66,
      "Time_End": 1859.26,
      "Text": " burned. But again, you usually engage in close access operations when the remote options have"
    },
    {
      "Time_Start": 1859.26,
      "Time_End": 1864.94,
      "Text": " been exhausted, as Jason has described. The idea that they went all the way to the wall of choosing"
    },
    {
      "Time_Start": 1864.94,
      "Time_End": 1871.1,
      "Text": " close access operations on multiple occasions, reusing personnel, in some cases even reusing"
    },
    {
      "Time_Start": 1871.1000000000001,
      "Time_End": 1876.6200000000001,
      "Text": " laptops that still had information from old operations on them to target these entities"
    },
    {
      "Time_Start": 1876.6200000000001,
      "Time_End": 1883.9,
      "Text": " over and over again, signals again that the desire for a result was very, very, very high."
    },
    {
      "Time_Start": 1884.6200000000001,
      "Time_End": 1889.2600000000002,
      "Text": " Despite the fact that there was a significant amount of risk involved, there was still the"
    },
    {
      "Time_Start": 1889.2600000000002,
      "Time_End": 1892.8600000000001,
      "Text": " decision to undertake operations using those tactics, techniques, and procedures."
    },
    {
      "Time_Start": 1894.0600000000002,
      "Time_End": 1898.3000000000002,
      "Text": " I think it's important to note that the implication should not be that these actors"
    },
    {
      "Time_Start": 1898.3,
      "Time_End": 1902.62,
      "Text": " aren't sophisticated, that they reused the laptops with the same information on them,"
    },
    {
      "Time_Start": 1902.62,
      "Time_End": 1908.1399999999999,
      "Text": " the same tooling. That's not because they didn't know better. These are highly professional,"
    },
    {
      "Time_Start": 1908.1399999999999,
      "Time_End": 1912.7,
      "Text": " longstanding, they know what they're doing. These services are competent in what they're"
    },
    {
      "Time_Start": 1912.7,
      "Time_End": 1917.1,
      "Text": " out there to do, and they're good when they do it. So the fact that these compromises were made"
    },
    {
      "Time_Start": 1917.1,
      "Time_End": 1921.98,
      "Text": " for some reason, it lends credence to what Alex is saying here, that there's no foreseeable"
    },
    {
      "Time_Start": 1921.98,
      "Time_End": 1926.3,
      "Text": " operational reason why you would make those operational compromises when this is the logical"
    },
    {
      "Time_Start": 1926.3,
      "Time_End": 1930.1399999999999,
      "Text": " result. Not only do you get caught, but it exposes this operation, the way you did it,"
    },
    {
      "Time_Start": 1930.1399999999999,
      "Time_End": 1933.98,
      "Text": " the tools you used, the people involved, and historical operations that are then tied to it."
    },
    {
      "Time_Start": 1935.1,
      "Time_End": 1939.58,
      "Text": " And then you have our last case here, which is the close access operations that were publicized"
    },
    {
      "Time_Start": 1939.58,
      "Time_End": 1943.82,
      "Text": " by the British and Dutch governments targeting entities related to chemical weapons analysis."
    },
    {
      "Time_Start": 1944.94,
      "Time_End": 1949.98,
      "Text": " This material was released at the same time as the October 2018 indictments, but also included"
    },
    {
      "Time_Start": 1950.8600000000001,
      "Time_End": 1957.1,
      "Text": " a stunning, I feel stunning is the right word, PowerPoint deck describing in detail how a GRU"
    },
    {
      "Time_Start": 1957.1,
      "Time_End": 1965.34,
      "Text": " close access team was tracked and disrupted trying to target the organization for the"
    },
    {
      "Time_Start": 1966.14,
      "Time_End": 1973.02,
      "Text": " prevention of chemical weapons in The Hague. This is a kind of operation where it makes more sense"
    },
    {
      "Time_Start": 1973.02,
      "Time_End": 1978.06,
      "Text": " from a kind of grand scheme and even from like a tactical perspective to use a close access"
    },
    {
      "Time_Start": 1978.06,
      "Time_End": 1983.8999999999999,
      "Text": " operation to target a hardened entity that was related to ongoing political affairs that could"
    },
    {
      "Time_Start": 1983.8999999999999,
      "Time_End": 1989.4199999999998,
      "Text": " incur significant costs in terms of sanctions and diplomatic consequences for Russia in relationship"
    },
    {
      "Time_Start": 1989.4199999999998,
      "Time_End": 1996.3799999999999,
      "Text": " to the attempted assassination of Sergei Skripal in March of 2018. But you can draw a line from"
    },
    {
      "Time_Start": 1996.3799999999999,
      "Time_End": 2002.54,
      "Text": " the compromise of close access operations related to the anti-doping efforts to the compromise of"
    },
    {
      "Time_Start": 2002.54,
      "Time_End": 2009.5,
      "Text": " the operation against OPCW because some operators were reused, techniques were reused,"
    },
    {
      "Time_Start": 2010.46,
      "Time_End": 2017.98,
      "Text": " physical tech was reused. So by being willing to have to, not even by being willing, by having to"
    },
    {
      "Time_Start": 2017.98,
      "Time_End": 2025.02,
      "Text": " engage in high risk operational decisions in service of vanity objectives, you put future"
    },
    {
      "Time_Start": 2025.02,
      "Time_End": 2030.46,
      "Text": " objectives, future operations against real objectives at greater risk of loss of compromise,"
    },
    {
      "Time_Start": 2030.46,
      "Time_End": 2042.06,
      "Text": " loss of success, attribution, and so on. So why does all of this matter? We've been going on to"
    },
    {
      "Time_Start": 2042.06,
      "Time_End": 2046.94,
      "Text": " what could be a very really interesting master's thesis about the dynamics inside intelligence"
    },
    {
      "Time_Start": 2046.94,
      "Time_End": 2051.1,
      "Text": " organizations, which I know I'm prone and I know at least multiple people in this audience know"
    },
    {
      "Time_Start": 2051.1,
      "Time_End": 2057.58,
      "Text": " I'm prone to ramble on about. But at the same time, there is value in the holistic understanding of"
    },
    {
      "Time_Start": 2057.58,
      "Time_End": 2063.1,
      "Text": " what goes into adversary behavior. That is, if you're in a situation where these types of actors"
    },
    {
      "Time_Start": 2063.1,
      "Time_End": 2067.58,
      "Text": " are in your threat profile and there's something that you're confronting on a regular basis, or"
    },
    {
      "Time_Start": 2067.58,
      "Time_End": 2071.98,
      "Text": " even on a basis where they're going to be your edge case, but it's a very severe edge case,"
    },
    {
      "Time_Start": 2073.58,
      "Time_End": 2079.18,
      "Text": " a deeper comprehension of those drivers can help you defend smarter, emulate smarter, and overall"
    },
    {
      "Time_Start": 2079.18,
      "Time_End": 2083.66,
      "Text": " manage risk better. I spend a fair amount of time helping a variety of different types of"
    },
    {
      "Time_Start": 2083.66,
      "Time_End": 2089.58,
      "Text": " enterprises build a detection engineering regime. Not necessarily what tool in what place, but how"
    },
    {
      "Time_Start": 2089.58,
      "Time_End": 2093.5,
      "Text": " to think about what your threat actors do, how the nature of what they do affects what's going to"
    },
    {
      "Time_Start": 2093.5,
      "Time_End": 2097.5,
      "Text": " happen to your network, and then how do you build a system to detect those things, and then once you"
    },
    {
      "Time_Start": 2097.5,
      "Time_End": 2101.02,
      "Text": " detect them, which is only the first part of the battle, actually understand what that is and what"
    },
    {
      "Time_Start": 2101.02,
      "Time_End": 2105.66,
      "Text": " it means that you detected it in the first place. In the case of understanding not only who did the"
    },
    {
      "Time_Start": 2105.66,
      "Time_End": 2110.3799999999997,
      "Text": " operation at the attribution, but the nature of the actor who did it, how they think, how they apply"
    },
    {
      "Time_Start": 2110.38,
      "Time_End": 2114.78,
      "Text": " their methodology, and what they actually end up doing operationally helps you take the facets"
    },
    {
      "Time_Start": 2114.78,
      "Time_End": 2118.38,
      "Text": " that you learn that detection engineering and ideally spread it across your enterprise. So it's"
    },
    {
      "Time_Start": 2118.38,
      "Time_End": 2123.1800000000003,
      "Text": " not saying that I know that this particular actor has access to this particular exploit, therefore"
    },
    {
      "Time_Start": 2123.1800000000003,
      "Time_End": 2127.6600000000003,
      "Text": " I will make sure that my edge defenses are bounded and done in such a way to make sure I can protect"
    },
    {
      "Time_Start": 2127.6600000000003,
      "Time_End": 2132.46,
      "Text": " against that exploit, right? That's not a good strategic decision, that's a very tactical one."
    },
    {
      "Time_Start": 2132.46,
      "Time_End": 2137.1,
      "Text": " How do you extract the value out of that attribution and understanding of your adversary"
    },
    {
      "Time_Start": 2137.1,
      "Time_End": 2141.58,
      "Text": " and spread the value across your detection regime? In addition, you can work to enhance the"
    },
    {
      "Time_Start": 2141.58,
      "Time_End": 2146.54,
      "Text": " fidelity of your emulation activities, and I liked in our keynote today where you talked about"
    },
    {
      "Time_Start": 2146.54,
      "Time_End": 2151.98,
      "Text": " not restricting your red team to say you are aptx and only do that, instead give them latitude,"
    },
    {
      "Time_Start": 2151.98,
      "Time_End": 2156.86,
      "Text": " right? Let them be the artist that they want to be in designing their red team behavior. As part of"
    },
    {
      "Time_Start": 2156.86,
      "Time_End": 2162.14,
      "Text": " that, let's expand it even wider, right? So for example, we can pen test and red team the"
    },
    {
      "Time_Start": 2162.14,
      "Time_End": 2166.14,
      "Text": " internal network all day long, but is anybody thinking about the fact that the Wi-Fi that you"
    },
    {
      "Time_Start": 2166.14,
      "Time_End": 2170.7,
      "Text": " use in your office is powerful enough, right? The APs you're using are powerful enough that that"
    },
    {
      "Time_Start": 2170.7,
      "Time_End": 2175.5,
      "Text": " Wi-Fi signal is seen at relatively decent strength three blocks down the road at a cafe where someone"
    },
    {
      "Time_Start": 2175.5,
      "Time_End": 2179.74,
      "Text": " could be sitting with a laptop and potentially interacting with your network unbeknownst to you,"
    },
    {
      "Time_Start": 2179.74,
      "Time_End": 2184.7,
      "Text": " right? There are these close access considerations where what is your adversary capable of and or"
    },
    {
      "Time_Start": 2184.7,
      "Time_End": 2189.9,
      "Text": " willing to do with it? How do you build that into those emulation activities? And at the same time,"
    },
    {
      "Time_Start": 2190.62,
      "Time_End": 2194.54,
      "Text": " even along the lines of threat hunting, which is a place where I often see a lot of interaction"
    },
    {
      "Time_Start": 2194.54,
      "Time_End": 2199.66,
      "Text": " between red and blue teamers and exchanging tactics in general where the discourse can be"
    },
    {
      "Time_Start": 2199.66,
      "Time_End": 2205.66,
      "Text": " strongest. If you're engaging in an operation as a red teamer or even as a blue teamer where"
    },
    {
      "Time_Start": 2205.66,
      "Time_End": 2210.46,
      "Text": " you're concerned about somebody like Fancy Bear, what kind of data is Fancy Bear going to be"
    },
    {
      "Time_Start": 2210.46,
      "Time_End": 2215.66,
      "Text": " looking for now that you're aware that they can be motivated by things like vanity, you know? It"
    },
    {
      "Time_Start": 2215.66,
      "Time_End": 2221.2599999999998,
      "Text": " could be valuable looking at an anti-doping institution, for example. There's multiple"
    },
    {
      "Time_Start": 2221.26,
      "Time_End": 2225.26,
      "Text": " data sets within an anti-doping institution that could be of value to the Russian government and"
    },
    {
      "Time_Start": 2225.26,
      "Time_End": 2229.9,
      "Text": " not necessarily all of them related to Russian or foreign athletes. A lot of it could be related to"
    },
    {
      "Time_Start": 2229.9,
      "Time_End": 2234.94,
      "Text": " relationships that those entities have to other international governance bodies. But if you know"
    },
    {
      "Time_Start": 2236.2200000000003,
      "Time_End": 2241.82,
      "Text": " XYZ current events could be driving particularly wounds of pride and prestige, it might be worth"
    },
    {
      "Time_Start": 2241.82,
      "Time_End": 2246.1400000000003,
      "Text": " simulating looking at where, you know, maybe there's been malicious activity here,"
    },
    {
      "Time_Start": 2246.1400000000003,
      "Time_End": 2249.6600000000003,
      "Text": " maybe it's worth simulating malicious activity here in those cases."
    },
    {
      "Time_Start": 2251.98,
      "Time_End": 2258.86,
      "Text": " So where do we go from here? I was always a fan of presentations that got up and said a bunch of"
    },
    {
      "Time_Start": 2258.86,
      "Time_End": 2262.3,
      "Text": " things and then said, well, what's the next logical step from this, right? Not only what do you get"
    },
    {
      "Time_Start": 2262.3,
      "Time_End": 2266.86,
      "Text": " out of it, but what can we do from here? So one is what is the overall influence of government's"
    },
    {
      "Time_Start": 2266.86,
      "Time_End": 2270.5400000000004,
      "Text": " ideology all the way down to the execution of these technical and cyber operations? Well, we"
    },
    {
      "Time_Start": 2270.5400000000004,
      "Time_End": 2274.6200000000003,
      "Text": " talked about Russia a lot here. You can think of other actors where you apply the same methodology."
    },
    {
      "Time_Start": 2274.6200000000003,
      "Time_End": 2278.78,
      "Text": " The Iranians are a potentially good example where in the sort of Iranian theocracy you have this"
    },
    {
      "Time_Start": 2278.78,
      "Time_End": 2282.86,
      "Text": " concept of exporting the revolution. Well, if you have that at the highest levels of the Iranian"
    },
    {
      "Time_Start": 2282.86,
      "Time_End": 2286.6200000000003,
      "Text": " government, if you bring that all the way down to the lower levels, how does exporting the"
    },
    {
      "Time_Start": 2286.6200000000003,
      "Time_End": 2290.94,
      "Text": " revolution and everything that that means apply in the intelligence operations context and in the"
    },
    {
      "Time_Start": 2290.94,
      "Time_End": 2296.86,
      "Text": " cyber operations context? In addition, how do pseudo and non-governmental interests also affect"
    },
    {
      "Time_Start": 2296.86,
      "Time_End": 2302.2200000000003,
      "Text": " these sorts of things? So for example, NGOs, think tanks, contractors, criminal organizations,"
    },
    {
      "Time_Start": 2302.2200000000003,
      "Time_End": 2305.98,
      "Text": " how do the way those organizations act and think and operate affect the way that these same"
    },
    {
      "Time_Start": 2305.98,
      "Time_End": 2310.7,
      "Text": " operations will be executed? And then how do you drive value from that into your own detection"
    },
    {
      "Time_Start": 2310.7,
      "Time_End": 2318.38,
      "Text": " regime? And on a broader basic level, you can basically take the academic function of"
    },
    {
      "Time_Start": 2318.38,
      "Time_End": 2323.5,
      "Text": " intelligence studies, which has gotten to be a stronger and broader part of the academic field"
    },
    {
      "Time_Start": 2323.5,
      "Time_End": 2328.22,
      "Text": " over the last couple of years, and start applying it to the internal dynamics of the relevant"
    },
    {
      "Time_Start": 2328.22,
      "Time_End": 2333.42,
      "Text": " entities. So a lot of times intelligence studies and histories of intelligence organizations focus"
    },
    {
      "Time_Start": 2333.5,
      "Time_End": 2340.06,
      "Text": " on big things. Counterintelligence failures, penetrations, historical deception operations,"
    },
    {
      "Time_Start": 2340.94,
      "Time_End": 2346.86,
      "Text": " wartime operations. But if you start looking in those resources and those research structures"
    },
    {
      "Time_Start": 2346.86,
      "Time_End": 2351.9,
      "Text": " and saying, let's take the lessons that we can learn about how an entity thinks, who that entity"
    },
    {
      "Time_Start": 2351.9,
      "Time_End": 2357.58,
      "Text": " responds to, what has typically been a big driver or not for that entity, and start applying it to"
    },
    {
      "Time_Start": 2357.58,
      "Time_End": 2362.06,
      "Text": " potential future cyber operations, you can glean a lot of the kinds of insights that we talked about"
    },
    {
      "Time_Start": 2362.06,
      "Time_End": 2368.86,
      "Text": " today. And with that, we intentionally left a few minutes so that we could answer any questions"
    },
    {
      "Time_Start": 2368.86,
      "Time_End": 2372.46,
      "Text": " you have. Thank you very much."
    }
  ]
}